[
  {
    "comment_id": "10153544374209753",
    "commenter_b": "It was lost on you. Feelz i know",
    "commenter_a": "Well who am I to judge someone else right? That's one way to keep order in a the marital contract, I mean at least he didn't throw acid in her face, stone her, cut off her nose or other body parts, subject her to a tribal council of judgement to be gang raped by all the men in the village, I mean compared to the 3rd world barbarians coming to the US from the middle-east and the subcontinent, he's downright civilized",
    "post_message": "A man from Harlem, New York has forced his wife to walk down the street naked as a punishment for talking to other men. Jason Melo recorded the incident, hurling insults at her the entire time. The video was uploaded to Youtube, but has since been taken down. However, an edited version that blurs out his Melo’s wife’s naked body has surfaced and shows the humiliating situation unravel. The video has sent outrage across the internet, causing people to wonder how such an embarrassing form of... @webpagelink"
  },
  {
    "comment_id": "10154242909886770",
    "commenter_b": "The people in that little town should not have to put up with that garbage. They are illegal immigrants and should not be allowed into our country like that. It's high time our law's were inforced, we have no idea who or what these people are and as far as I know, the USA is a free democratic country and there are no refugees from there. Trudeau better stand up for Canadians for once in his PM position and stop this.",
    "commenter_a": "Take them and keep them",
    "post_message": "A municipal authority in Manitoba, Canada is concerned about the influx of dozens of “asylum seekers” who showed up to border town of Emerson Sunday morning."
  },
  {
    "comment_id": "809241822444574",
    "commenter_b": "If Hillary Clinton were elected in 2016, she would be the second oldest POTUS (behind Reagan). She is out of touch with America, living in her liberal bubble. She bragged that she had NOT driven a car herself since the 1990's! I agree, she should not survive the Benghazi questioning (scandal). Some have wondered if her head injury will trigger the onset of dementia (Alzheimers). Reagan may have been suffering from dementia as his term ended.",
    "commenter_a": "If the POTUS Obama & the Mayor of NYC had the skills to actually lead the American people, then the protests, rioting, looting & now the assassinations of Police Officers would NOT be happening. If Obama would lead instead of fanning the flames of the racist, race-baiters, then America would not be subjected to the disgrace we are currently suffering through as a people. It is time for everyone to join together \"as Americans\" to shut out the racist, race baiters; support our Police (protect them, if necessary); put an END to the false protests; lock up the criminals (looters & arsonists) & PROSECUTE the Grand Jury liars.",
    "post_message": "Cleaning up for the New Year!"
  },
  {
    "comment_id": "1128964310481999",
    "commenter_b": "Dayton Huebner thank you for proving yet again that one can't cure stupid or open a closed mind. Just once I wish people who are still stuck in the 50's definition of communism would educate themselves. You aren't even close.",
    "commenter_a": "I've never contributed any financial assistance to a political campaign before. Couple days ago, I did, and it went to the campaign of Bernie Sanders. I don't usually trust politicians, and I don't ever remember being as excited as I am today about a candidate running for the White House. Bernie Sanders has not only earned my vote, but also my contribution to his campaign. Bernie Sanders has raised millions of dollars from small contributions from middle-class, ordinary families, unlike most politicians that go to their Wall Street buddies to beg for big cash donations. Bernie Sanders doesn't flip-flop on issues like most politicians do, his message was the same back in the 1990's. You can youtube it, it's incredible how honest and passionate he is, and has been about the need for our government to work and represent all Americans, and not just those at the very top. I ...",
    "post_message": "In 1944, President Franklin D. Roosevelt presaged Bernie Sanders by calling for a \"Second Bill of Rights\" of an economic nature. They were: The right to a useful and remunerative job in the industries or shops or farms or mines of the nation; The right to earn enough to provide adequate food and clothing and recreation; The right of every businessman, large and small, to trade in an atmosphere of freedom from unfair competition and domination by monopolies at home or abroad; The right of every family to a decent home; The right to adequate medical care and the opportunity to achieve and enjoy good health; The right to adequate protection from the economic fears of old age, sickness, accident, and unemployment; The right to a good education. Video by Occupy Democrats, LIKE our page for more!"
  },
  {
    "comment_id": "954482047940531",
    "commenter_b": "Guilty. Got caught and in federal court if you admit you committed the crime you will get less time. The feds work on a point system. And she knows how to play the game. Plus I'm sure she will testify against the other idiots involved.",
    "commenter_a": "I wonder why she confessed. Guilt must have been eating her up.",
    "post_message": "A former prosecutor in St. Louis, Missouri confesses in open federal court to ignoring information about a cop’s brutal beating of a man who was restrained in handcuffs. Bliss Barber Worrell, 28, pleaded guilty to felony misprision for her role in the corrupt concealment last year. She also confessed to filing a phony charge against the suspect after his beating. The victim, Michael Waller, was beaten by St. Louis detective Thomas Carroll, who arrested him on charges of stealing his daughter’s credit card. DETAILS ----> @webpagelink"
  }
]
