[{"comment_id":"10152896761617293","commenter_b":"and the mob was mad when he called thm out too .... NEXT!! -","commenter_a":"Nothing like calling them as he (and most of the rest of the world) sees 'em!","post_message":"\"Currently, an evil front is being formed against us,\" he said. \"Now the pope has joined this conspiracy.\""},{"comment_id":"10153048928789071","commenter_b":"We have to build a wall...","commenter_a":"@username gute Nacht murica","post_message":"A Univision reporter gets kicked out of a Trump event"},{"comment_id":"10153470128239497","commenter_b":"Get outta here!","commenter_a":"Strange new cult forming under my guidance 😈","post_message":"\"Somehow, the account management team has forged a society all its own.\""},{"comment_id":"10154268994748822","commenter_b":"Assclown fool","commenter_a":"I'm so proud to have this man as my governor and I'm ashamed of the Pennsylvanians (some of whom are commenting here) who are racists and religious bigots. Thank you Governor Wolf for representing ALL Pennsylvanians (even the ignorant ones) and for protecting our children!","post_message":"NEW: Gov. Tom Wolf's administration released a response plan after recent incidents involving racism and religious intolerance in Pennsylvania schools."},{"comment_id":"1304540879566920","commenter_b":"If Gwyneth puts it in Goop, it's not a feminist thing, lol","commenter_a":"This is a feminist thing, eh?","post_message":"Don't put herbs in your vagina, for goodness sake. Your womb doesn't need a freaking detox."},{"comment_id":"1357245971012470","commenter_b":"I prefer her to LEAVE!!!","commenter_a":"The way you get around those problems young lady is to loudly speak out against radical Islam, disavow any sympathy for them or their cause, encourage other like minded Muslims to do the same. That's how you stop the American people from associating you with them. Or you could just leave the country.","post_message":"She joins CNN's Costello to trash Trump after his victory..."},{"comment_id":"472562882934292","commenter_b":"She's a want to be Queen A Big Not she's not the first ya got it .","commenter_a":"that woman definitely needs therapy posing as a queen lol dream on woman","post_message":"Michelle tried to do something absurd, but USPS shut her down. Awesome, it's about time someone told her 'no'. Do you support the post office's stand against Michelle?"}]
