[{"comment_id":"799386623536836","commenter_b":"I guess those two hundred people needed to find a safe place?","commenter_a":"Come to St. Petersburg...right across the bay!!! We're much smarter HERE!","post_message":"\"Of course, we're in Florida, you're going to boo.\" - Amy Schumer after being booed for making jokes about Donald J. Trump"},{"comment_id":"10154195854358256","commenter_b":"Nice strawman Julia. Careful you don't smoke around that one.","commenter_a":"Palin is as irrelevant on the right as Debra Wasserman Schultz is on the left.","post_message":"Sarah Palin, take a seat."},{"comment_id":"1253938284627180","commenter_b":"Your mom's a joke","commenter_a":"Because vag isn't gonna pound itself........","post_message":"From an evolutionary perspective, men are a really bad idea. So why do they exist?"},{"comment_id":"10153410031966615","commenter_b":"Oh man. This breaks my heart. I FOUGHT for my baby to live and can't even begin to imagine this happening to my children. :(","commenter_a":"Horrible story, horrible people to treat their kid like that. But I still can't figure out where was that carseat? Is it so hard for wpxi to say if carseat was in the car or in the house? Every time I read the story it just says child was left in carseat.","post_message":"BREAKING: The parents of a 23-month-old girl who died after police said she was left in her car seat for 13 hours have been arrested -- and will face homicide charges. WPXI Cara Sapida is talking with police and will have the latest on Channel 11 at Noon."},{"comment_id":"666489030205380","commenter_b":"Get the hell out of our country","commenter_a":"I though you were leaving the country Rosie, what's keeping you?","post_message":"Get comfy, Rosie!"},{"comment_id":"10154615680566880","commenter_b":"Like auto manufacturers too?","commenter_a":"People who believe that Musk is a genius should support him by staying fully invested. Those who distrust a business reliant on government subsidies should bail. This will be an excellent test case in the economics of government investments. A future under Hillary promises heavy government investments in the Musks of the world.","post_message":"There could be a disaster coming."},{"comment_id":"10153841941246770","commenter_b":"I'm not voting for the CORRUPT, LYING, MURDERING, CROOKED iLL SICK PERSON! I'll VOTE FOR TRUMP, you know why because the LIBERALS are a bunch of sick twisted people who do give one crap about this country!!! #NEVERHILLARY","commenter_a":"You ad your husband are a perfect for each other. Both dumb as a brick!","post_message":"Chrissy Teigen just called Trump a \"sociopath\" on live television."}]
