[{"comment_id":"1152030998150262","commenter_b":"You wouldn't believe it even if it was released. You'd say it was staged. Let the girl rip.","commenter_a":"How about releasing ALL the footage of her before , DURING , and AFTER her untimely murder!!! Its easy to let America view when she was alive. BS!!","post_message":"\"This video should demonstrate that people who are out there going through a lot of trouble to spread lies and mis-truths on Waller County — we are not going to stand idly by and allow that to happen.\""},{"comment_id":"1060233254031678","commenter_b":"I have a question, I received an email from the bernie sanders.com saying i did not have a party preference but to request a democratic ballot. i did get a democratic ballot. this is my first time voting and was wonder if that's what it actually meant?","commenter_a":"I like how honest Bernie is. The Democrats sold that clean coal fantasy for years, and Clinton is still trying to sell it. Heck, she said natural gas is a \"bridge fuel\" when, renewable can replace most energy needs. When a candidate who sold fracking to the world, and supports \"clean coal\" gets environmental group endorcements. That candidate is the establishment. Because nothing else makes any damn sense.","post_message":"Safe fracking is like clean coal, pure fiction. Fracking pollutes water, degrades air quality and worsens climate change. No amount of regulation can make it safe."},{"comment_id":"1109554819065528","commenter_b":"Bitch please,","commenter_a":"To everyone hating on Superman, you don't have shit.","post_message":""},{"comment_id":"893404867419235","commenter_b":"Really! Like WTF! Those sharks don't belong there! This bullshit is effecting tourism! Kill'em all, right?? You freakin gluttonous capitalistic bitches! 😡","commenter_a":"o_O *slow blink*","post_message":"Why isn't the government protecting our freedom of beach?"},{"comment_id":"1551325111574622","commenter_b":"This is HER country.","commenter_a":"Now do we really care what this looney tune thinks or if she accepts Trump...if she does not accept him....send her out of the country!","post_message":"No one could have said this better."},{"comment_id":"10154346331578812","commenter_b":"I love the sons of Diana and Charles.. The babies are as sweet as can be..long live the queen","commenter_a":"So cute x","post_message":"Prince George is allowed to stay up 15 minutes past his bedtime to meet the Obamas at Kensington Palace dinner."},{"comment_id":"10154119917737234","commenter_b":"Donna anther corrupt politician","commenter_a":"Marine Waters","post_message":"Who Will Be The Next DNC Chair? The Vote Is Happening Now"}]
