[{"comment_id":"10157942641385354","commenter_b":"Horseshit. Grow a set wussie. You give me a bad name.","commenter_a":"Danika Pearson","post_message":"Wake Up, Gun Owners. This is No Joke."},{"comment_id":"10153554902129087","commenter_b":"Ha haaaa!!! I think it's funny you fools immediately claim racism when somebody wants to do something that doesn't suit you. Well get over it!!! ILLEGAL immigrants have no business being here! Come to this country LEGALLY or fuck off!!!!","commenter_a":"We paid Mexico for those borders and they let illegals in and tramp through their country to come here Yeah you will pay for it..","post_message":"\"I’m not going to pay for that f---ing wall,” former Mexican President Vicente Fox to Jorge Ramos during a fiery interview on Thursday. \"[Donald Trump] should pay for it. He’s got the money.\""},{"comment_id":"1283553535022959","commenter_b":"Ryan got a totally cushy job.","commenter_a":"Aleks Evans","post_message":"LOL! Not helping anyone, Ryan!! SHARE if you agree! (Hat tip to The Christian Left)"},{"comment_id":"1116747615049049","commenter_b":"Women frequently nurse their Babies in the train station where I work - I applaud it as natural and organic and cannot imagine why in Heaven's name it is such an issue - (we all come with identical equipment and this is what breasts are for) Nursed Babies are much healthier than those bottle fed","commenter_a":"Beautiful","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"},{"comment_id":"1120933471338794","commenter_b":"Lol","commenter_a":"These uneducated hillbillies dont care because they cant afford to buy a trailer anyway...","post_message":"Millions upon millions of his poorest voters just got terrible news."},{"comment_id":"10154964534141337","commenter_b":"@username so then why is everyone so butthurt about other immigrants coming in? What's done is done, they got in, the end","commenter_a":"An awful lot of illegally immigrated Europeans happy to see him deported on this page. Maybe you Mofos would be better off learning your native tongue, I know us Natives would love to see your cave dwelling, disease spreading barbarians back to where you emigrated from.","post_message":"Documenting the heartbreaking and unbelievable deportation of South Korean man Adam Crapser"},{"comment_id":"10152829564776770","commenter_b":"Go home Clintons","commenter_a":"Bullshit cover up","post_message":"Hillary is secretly a great person, says Clinton campaign"}]
