[{"comment_id":"907616379294892","commenter_b":"More crickets!","commenter_a":"She really doesn't have a chance this time, way to old and way to much baggage , All you la las might want to take a look at her record , do some research and vote for someone qualified instead of following the sheep.","post_message":"Kelly was one of the lucky moms who got a Mother's Day surprise to remember: a call from Hillary."},{"comment_id":"10152786318205736","commenter_b":"She's a nut","commenter_a":"That's what I said about her","post_message":"What are your thoughts on race identification?"},{"comment_id":"10154713916667446","commenter_b":"It's her normal way. She's a bitch","commenter_a":"Trying to be as objective as possible.., she comes across as very angry and off putting , yikes","post_message":""},{"comment_id":"10153386535509099","commenter_b":"What shame. Thought most grown women are maternal. I was right \"MOST\" not all.","commenter_a":"Maybe we should stay home with our babies.","post_message":"A hidden nanny cam captured more alleged abuse against the 3-year-old girl and 1-year-old twins @webpagelink"},{"comment_id":"10152775475131045","commenter_b":"Yes, don't nobody want to mess with this grandma about her grandchildren.","commenter_a":"As a grandparent I cannot Fathom how you could do this. I would protect my children and grandchildren with my last breath","post_message":"Breaking news out of Etowah County tonight. A jury found Joyce Garrard guilty of capital murder in the running death of her 9-year-old granddaughter."},{"comment_id":"10153838420452217","commenter_b":"English can be privatised ? Wow.","commenter_a":"I'll trademark all the vowels...That way they are just spcsvrs...which makes no sense...","post_message":"Yes, you are reading this clearly. 👀 👓"},{"comment_id":"10153884149866130","commenter_b":"Its a joke you stupid bitches. Get over yaselfs.","commenter_a":"Ummm, kinda defeats the purpose of going out to the bar to get drunk if the bar is going to try and deter me from drinking. Wtf. Thats like my weed dealer explaining the importance of not smoking so I dont get cancer, smh. Dumb. Lol.","post_message":"One bar is getting patrons to think twice about drunk-driving by setting up a live-stream with a convicted felon."}]
