[{"comment_id":"10153386864707235","commenter_b":"Eww","commenter_a":"They probably wanted to sniff it.","post_message":"This should not be legal."},{"comment_id":"10153124217341051","commenter_b":"Ive seen women pulling crap everything from getting a friend to flirt to wrecking a guys car.Stupid and insecure....","commenter_a":"she was watching too much titanic","post_message":"This woman wanted to test her boyfriend's love for her by climbing over the railing on a cruise ship to see if he'd come to her rescue. You can probably guess how that worked out."},{"comment_id":"10153157541959641","commenter_b":"Yes Dilma get the hell out!","commenter_a":"protests? you can't never even think about it ! if you join to a manifestation group you can get killed or lose your job if you be an influent person , you can get bribed and many people are shut because of these reasons this is the message that we've been received from our fathers the message has been transmitted from generations to generations a message of fear were the law is to rule the poor .","post_message":"Hundreds of thousands marched in Sao Paulo, Brazil, with one message for President Dilma Rousseff: Get out. cnn.it/1ynM33B"},{"comment_id":"1280033575423027","commenter_b":"She didn't say anything that hasn't been said before.","commenter_a":"The trouble with Trump is he doesn't his rallies long enough to study for the job he is trying to get elected to which is so important. Hillary has the experience plus she takes off for a few days to study what is going on in this country and around the world. Hillary gets an A+ and is definitely ready to take over the Oval Office on day one. Go Hillary!","post_message":"Another right-wing conspiracy bites the dust."},{"comment_id":"623307227823727","commenter_b":"She should never be President,God help us if she does","commenter_a":"This whole thing just makes me ill!","post_message":"Crooked Hillary Clinton Lies vs. the FBI: A Tale of Two Press Conferences."},{"comment_id":"10152903989921336","commenter_b":"Just say your sorry, it'll be ok, long time ago let it go.","commenter_a":"The sooner the better","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."},{"comment_id":"1172100076163796","commenter_b":"Tape the bitches mouth shut and repeatedly butt fuck her","commenter_a":"Cruelty to animals is not OK.","post_message":"The internet is calling for blood after a woman posted a photo of her dog with its mouth duct-taped shut."}]
