[{"comment_id":"468040403386540","commenter_b":"They need to leave America!!!","commenter_a":"No, do we get ours? Did any of our relatives from the past get their's","post_message":"Should The US Allow Muslims To Have Their Own Areas? Comment 'yes' or 'no'."},{"comment_id":"405687699555825","commenter_b":"They all do it, he was just to stupid and got caught.","commenter_a":"SOP,,,,,since forever!!!! Most all are getting away with it and have since day one!!!!","post_message":"How many politicians are getting away with this every day?"},{"comment_id":"10154583346243855","commenter_b":"Governor Brown will be on the right side of history!","commenter_a":"Big talk now. Let's see how mouthy he is when President Trump and the Congress cut off funds to states who harbor illegal aliens and otherwise defy federal laws. Can't wait to see CA in an even worse budget squeeze. Talk is cheap when others are paying your bills.","post_message":"Thank you, Jerry Brown! Read the full text of the California governor's anti-Trump State of the State address: @webpagelink"},{"comment_id":"613597282122381","commenter_b":"You don't see conservatives trying to preserve the right to vote? Of course they are. Why is it perfectly ok in your eyes that we have to prove ourselves to exercise our right to bear arms, but having to have an id to vote is racist? Mass shootings are still a rare occurrence in our country.","commenter_a":"When Obama's secret servicemen are the first to lay down their guns, and he doesn't get shot, I will believe \"gun control\" works.","post_message":"I support it. Do you? Occupy Democrats"},{"comment_id":"1088954241145047","commenter_b":"To all the women bitching","commenter_a":"He paid 50,000 for it! It's his! You big fat sissys!","post_message":"The identity of the American man who lured a treasured African lion out of a national park, shot it, stalked it for two days, then beheaded and skinned the animal, has been revealed. He's a dentist from Minnesota."},{"comment_id":"1155155194501829","commenter_b":"Get over it. There are two different justice systems, if not more; operating within one....","commenter_a":"white privilege","post_message":""},{"comment_id":"735303209993590","commenter_b":"Goog God.Shouldnt there be a law against ugly girls in bikinis?","commenter_a":"Probably wearing a swimsuit!!!","post_message":"What Chelsea Clinton Was Just Caught Doing Could Destroy Hillary's Campaign This puts Michelle Obama to shame. Do you think Hillary Clinton would make a horrible president?"}]
