[{"comment_id":"10152940519275933","commenter_b":"Mr. Kasich is a nice man but Donald Trump is right about everything he states - if we don't deport ILLEGALS then we will have to grant them amnesty. I know the deportation is not feasible - but it could be done but I know it won't happen - but we most certainly should deport the criminals who are here illegally. Illegals should have NO RIGHTS - first of all they break the law when they enter here. I'm voting for Trump. Mr. Kasich - what about OUR rights? Do the citizens of America have any rights ? are we protected any more? Now, what's happened is that these illegals are stuck here - that's why we MUST STOP IT. We cannot support the entire world no matter how sympathetic we are to them.","commenter_a":"The strong leader is not @username......he says deporting 20 million illegals is inhumane! You're part of the problem! How patriotic can you be, how much can you love your country to condone an invasion by 20 million illegals into our country that is now a welfare state with very high unemployment. The 11 million came from the 2010 census.....but many hispanics refused to answer the questionaire out of fear.....also, since 2010, millions more have come acrtoss the border. It's 20 million, folks!","post_message":"America deserves a strong leader back in the White House. America needs John Kasich."},{"comment_id":"1186457031407058","commenter_b":"I say we give it to them. not one cent of White money, black doctors, black hospitals, black colleges, black cities, and build big walls and let them deal with their own people","commenter_a":"This is what happens when you erase history just like the Confederate flag","post_message":"Strange for those that call themselves 'progressive'..."},{"comment_id":"10153341904559170","commenter_b":"And why haven't you taken responsibility for your actions?","commenter_a":"And why haven't you solved your people's problems yet, Herm? Too busy slangin pizzas and tap dancing for white folks?","post_message":"Deplorable."},{"comment_id":"10156129057215389","commenter_b":"Uhh...nope!!!...I was born also...but not today!","commenter_a":"Yes, it might cost her a lot like not greeting to be president.","post_message":"Question of the Day: Do you believe Hillary Clinton is really sorry about her server scandal?"},{"comment_id":"10153562033956336","commenter_b":"Its not just the issue of illegals crossing the border and the US supporting them. The borders are open to terrorists coming across too and for both issues the bordetd need to be sealed ig we are to save our Country. Trump is right, without borders we don't have a Country.","commenter_a":"Ann Coulter is becoming the Johnny One-Note of 2016. SHUT UP ABOUT IMMIGRATION, ALREADY!!! There are dozens of issues out there that could (should) get your attention but every time I see you on @username you're yapping about immigration.","post_message":"\"The voters keep saying, 'We don't want any more immigration.' That's why Trump is so popular. So pick it up, Republicans.\" Do you agree with Ann Coulter about Donald J. Trump?"},{"comment_id":"1610662465894059","commenter_b":"And she should be out of a job.","commenter_a":"Yes","post_message":"\"These hands clean the rooms every single day for Mr. Trump so he can be rich.\" Meet the Trump workers who are not voting for Donald J. Trump @webpagelink"},{"comment_id":"10153764706938984","commenter_b":"Bring the hostages home AND KILL THE IRAN DEAL!!!","commenter_a":"Anything to stop him is ok","post_message":"Senate Republicans just revealed their bold new plan to stop Obama, and Democrats are NOT happy they're putting up this fight... Do you support what these Republicans are doing?"}]
