[{"comment_id":"1171557939550328","commenter_b":"OBAMA IS A TRAITOR. HE SHOULD LEAVE THE WHITE HOUSE ASAP.","commenter_a":"Obama just sunk lower than even I thought he could sink..as he was trying to be a comedian - he deliberately chastised Donald J. Trump over and over...he should be so embarrassed but he's an idiot so I guess we are still to assume he's above and better than the rest of us. By the way Obama - no one was laughing other than \"AT\" you for being so ignorant. That got you no leverage with anyone in that room if those people attending were normal human beings - only your planted people gave you any recognition and even they must have been devastated by your horribly degrading remarks all made in the name of humor - just as Will Farrell finds Alzheimers disease comedy - this was right up there with it...SHAME ON YOU FOR BEING SUCH AN ASS HOLE!!!","post_message":"PHOTOS and VIDEO of TRUMP RALLY IN CALIFORNIA... Arrests, Cars Smashed, Mexican Flags, Riot Cops.... Can't wait for the deportations to begin. See photos and video from event: @webpagelink"},{"comment_id":"1598147256865554","commenter_b":"She is such a pig , I can't stomach her !!!","commenter_a":"You sound \"Off Your Rocker\" !!! A lot of you are talking and showing signs that are vulgar and disgusting! My mother always said that a person shows their ignorance by what they say and do! Seems like a lot of ignorant women were there today!","post_message":"Remember when Michelle Obama said \"when they go low, we go high\"? Neither does Ashley Judd ===>"},{"comment_id":"10156311774755354","commenter_b":"you bitch","commenter_a":"POS","post_message":"PARTY TIME!!!"},{"comment_id":"10154282373471636","commenter_b":"@username the uk intends on putting it's own citizens first. .to achieve this we intend to control the flow of immigration here ( not close them) the problem with the EU free movement is that the poorer member citizens prefer to go and live in the more welthiest members causing a flood in the labour market. .all other countries outside the uk have this policy","commenter_a":"They realise they can't risk all the british emigrants in the EU, the majority of them being pensioners, returning to the uk and putting a financial and physical strain on things like the health service.","post_message":"Excellent"},{"comment_id":"832838423431849","commenter_b":"She won't be in the White House.","commenter_a":"A-hole","post_message":"Say WHAT?!?!? In remarks today to the South Carolina Democratic Women's Council, Hillary Clinton says \"You're not going to see me turn white in the White House!\""},{"comment_id":"1007444045971350","commenter_b":"don't change anything","commenter_a":"STOP","post_message":"First The 20, Now The $5 Bill - Obama Announces More 'Diverse' Face For The Bill Stop it. Leave our money alone. Do you think they should keep honest Abe on the 5$ bill?"},{"comment_id":"10152958936935927","commenter_b":"You can bet if she was muslim, her actions would be perfectly justified ....they wouldn't jail her or tell her to get another job !!!!!!!","commenter_a":"The governor has the power to quietly transfer her people..he choose instead to jail her, its ridiculous..Muslims in the MTA in NYC refused to do their job based on religion reasons, it never even made the news and they were quietly transferred...not jailed. It was worked out quietly and amicably, yet this woman they choose to jail. The governor should be asked why he choose to make an example of her...","post_message":"WATCH: Governor Huckabee - \"You're telling me that you cannot make an accommodation for an elected Democrat county clerk from Rowan County, Kentucky?\""}]
