[{"comment_id":"1758834931015826","commenter_b":"A dude with a dick is what he is!!! Let's call a Ace an Ace & a spade a spade now!!","commenter_a":"Oh fuck this bullshit! Enough already! You're a chick with a dick we get it, not the first, nor the last. Ever been to fucking Thailand? Loaded with these fuckin things. Better looking too.","post_message":""},{"comment_id":"10153482509219714","commenter_b":"The girl is a faker","commenter_a":"Once you go black you don't go back. She took it out of context.","post_message":"NAACP leader Rachel Dolezal is speaking out in the wake of controversy."},{"comment_id":"1160665140611621","commenter_b":"Men, have no business making any rules or laws that apply to women....PERIOD !","commenter_a":"Who elects these illiterate morons? New Hampshire, step up your game.","post_message":"These male legislators may not be grown-up enough to talk about women's bodies."},{"comment_id":"10153671476736509","commenter_b":"Online predators? she lied about her age, and deceiving people. wtf is wrong with you. how would that be all those men's fault? she lied dude. i'm glad mom stopped it. we need to do something about females lying about age. why are the men in the wrong hear? but that's the double standard of women though. kids should not be on Facebook period. we need to regulate Facebook and make it for adults only. and use id's to sign in. just like in a bar. i applaud mom, she could of gotten pregnant the works. it would of been her own fault. why? because she lied and said she was a grown up when she clearly was not. mom has every right to give those people a chance to delete her. and i bet you real quick, those people removed her. good job mom. good job. kids don't belong ...","commenter_a":"So people are shitting on her for tough love because she's trying to protect her child from online predators? WTF is wrong with society.","post_message":"Tough love or public humiliation? This Denver mom gave some strong feedback about her daughter's suggestive Facebook postings: @webpagelink"},{"comment_id":"10153306477369586","commenter_b":"Bunch of dumb asses.","commenter_a":"this is sick","post_message":"Yes, those are real dead cats. :( Oklahoma high school students posted this disturbing video on Facebook. Wait until you see how the teacher was involved. HELP STOP THIS: @webpagelink"},{"comment_id":"711006379048137","commenter_b":"THERE IS SOMETHING WRONG WITH THIS BRAINLESS MORON...CAN NOT LISTEN TO HER HAVE TO CHANGE THE CHANNELL.....I WISH THEY WOULD NOT PUT HER ON...DISAPOINTED CNN.","commenter_a":"I just cannot listen to her!!","post_message":"No, Donald Trump would NEVER try to draw attention to himself. /smh/ --Andrew"},{"comment_id":"10154725381070579","commenter_b":"You may want to look into Stein or Johnson... Hillary is a corrupt habitual liar and anyone that does not see it, is not the sharpest knife in the drawer...","commenter_a":"I'm a United States Army Veteran and I'm With Her. Trump's complete failure to understand basic foreign policy concepts, his relationship with Putin, and his out-of-control ego are a one-way trip into a third world war. His kind of \"leadership\" is the last thing America needs. Clinton isn't perfect but she's better than any of the other candidates today.","post_message":"Active & Retired Military: Your choice in 2016?"}]
