[{"comment_id":"1333556083351913","commenter_b":"Javier judging by the other comment threads on this post it seems that very many people at least in the USA disagree that those activities are as gender neutral as you do.","commenter_a":"None of this shit is new 😐 Men have always been barbers, tap dancers, ballet dancers, shoe makers, basket weavers, bakers, or tailors. What the hell is wrong with any of this stuff? More importantly... WHY are you pointing this normal stuff out as if it is odd???","post_message":"This mom is encouraging boys to do what they love — no matter what people have to say."},{"comment_id":"523996764459649","commenter_b":"She is so full of crap!!!","commenter_a":"Not my husband ... Wrong again Laura !","post_message":"Laura Ingraham makes predictions:"},{"comment_id":"941252249248581","commenter_b":"Oh Bill, you handsome devil...lol, NOT!!!","commenter_a":"It couldn't happen to a more deserving bunch of lying propagandists Hell Bent on fomenting Hate, Racial War & Spewing Male Bovine Feces.","post_message":"Fox News has enlisted two of their biggest twits to play the victim card and accuse Dish Network of censorship as the battle between the two rages on for a fourth straight week."},{"comment_id":"10153062976166680","commenter_b":"Eh. Women do come back in body bags but whatever.","commenter_a":"The candidates should pledge to keep Jackson and Hamilton on the currency. Where does it say a women has to go on a bill. Women don't come back in body bags during our wars. To go on a currency bill as Washington, Lincoln, Hamilton, Jackson, Grant, Franklin, and Jefferson have is b/c of their committment to this country, AND NOT b/c of their genitals. If a woman is to go on a bill let it be on a three-dollar bill.","post_message":"POLITICO Europe: “There is such a thing as society,” Cameron said in an implied retort to Margaret Thatcher’s counter-view, “it’s just not the same thing as the state.”"},{"comment_id":"1137409276317081","commenter_b":"Hillary threatened by a female!? The Republican Party just makes me laugh!","commenter_a":"Hillary Clinton threatened by Melania??? lol give me a break.","post_message":"\"It's just another example of... when Hillary Clinton is threatened by a female, the first thing she does is try to destroy the person\": Donald J. Trump's campaign manager Paul Manafort addresses allegations that Melania Trump's #GOPConvention speech was plagiarized @webpagelink"},{"comment_id":"822517567938820","commenter_b":"This woman is crazy saying Hillary is the most loved and respected woman in the world! She's been hanging around Hillary to much, and Hillary's lying is rubbing off!!","commenter_a":"Security should of threw her out on her ass. The demons must be running scared.","post_message":"Watch: Dem Chair Shows Up INSIDE GOP Convention Arena And Does The Unthinkable It is amazing to see to what extent the Democratic party will try to derail Trump's campaign. Do you stand behind Donald Trump?"},{"comment_id":"10153837280246051","commenter_b":"@username I totally agree with you! If people would not hire illegals at the first place, illegals would not be in the USA!","commenter_a":"The end! \"Beating the system\", fucking seriously! There is a system for a reason. How many people do it the right way and how many are unable to do so because of people like her and her family \"beating the system\"! Her scholarship should be revoked!","post_message":"This Yale-bound valedictorian stood in front of her entire school and made an announcement that stunned everyone:"}]
