[{"comment_id":"10152694140572452","commenter_b":"Joanna Funes wtf lol","commenter_a":"Ewww I mean it this for real? Nikki Deleon Lexi Richman Ashleigh Gray","post_message":"WHAT'S THAT SMELL? Burger King announced Wednesday that it will soon be selling a Whopper-scented perfume @webpagelink"},{"comment_id":"10153189013365736","commenter_b":"Please don't insult scum. Scum must be very embarrassed to be compared to HER!","commenter_a":"Of course she did it. Using that poor boys abduction to get her face on T.V. What an evil woman n","post_message":"Kyron Horman's stepmother Terri Horman gives People magazine an exclusive interview about the disappearance in June, 2010 of the 7-year-old."},{"comment_id":"10152698246092293","commenter_b":"Obama is SCARED His Funding of these TERRORISTS, will have to STOP!","commenter_a":"Obama was right not to go.","post_message":"\"We agree that we should have sent someone with a higher profile in addition to the ambassador to France.\""},{"comment_id":"10156197802695354","commenter_b":"More proof that starlets should keep their thoughts and actions to themselves.","commenter_a":"Trash ball----please take out with the rest of the garbage...!","post_message":"The America-hating, donut-licking, liberal icon, Ariana Grande, enlightens the country she hates yet again..."},{"comment_id":"1284879431547513","commenter_b":"ve que no es vara :)","commenter_a":"@username Sergio Boudet lo que hablabamos el otro dia","post_message":"Colorado kept $1 billion away from drug cartels last year."},{"comment_id":"484149281775652","commenter_b":"Get rid of him and his fat AZZ wife!","commenter_a":"Yes","post_message":"VIDEO: Kanye West cries racism after Beyonce loses... Kanye is a fool and a cancer, let's ban him from America. Do you agree Kanye should be banned from America?"},{"comment_id":"1008939885848662","commenter_b":"Thank you.","commenter_a":"I hate ghetto ratchet ignorant hood people. Their lives are so mediocre they literally just take up space and resources.","post_message":"The disrespect!"}]
