[{"comment_id":"10154179770204330","commenter_b":"How did this happen,if the Zoo was secured? Just so happens this is a Black child. Had it been a White child,there wouldn't be no complaints. Hypocrites!","commenter_a":"Accidents happen. They do. However, accountability and fault are determined and responsibility for the loss of this priceless animal (financial) should be taken in a court of law.","post_message":"\"Accidents happen.\" That's the response from the mother of the 4-year-old boy who fell into the gorilla exhibit at the Cincinnati Zoo over the weekend, forcing zoo staff to shoot and kill the gorilla. She says too many people are judging her. Thoughts? @webpagelink"},{"comment_id":"10153875712703128","commenter_b":"Natalie Grace","commenter_a":"my iphone 6s lpus battey has not died on me. it has lasted me all day every day. they increased the battery life so if people are having problems then thats off","post_message":"With its entry into the battery case market, Apple finally admits that heavy iPhone users could use more juice. Its solution also fixes many of the issues present with third-party cases."},{"comment_id":"10154380784584877","commenter_b":"And this lady is Exhibit A.","commenter_a":"Maybe way back in the day... Im not trying to be funny but women of a certain background look good till about 35 and then start to look haggish","post_message":"People are still coming out of the woodworks to stake their claim on Prince's estate."},{"comment_id":"10153202645506350","commenter_b":"This women should go talk to parents.","commenter_a":"Everyone saying \"she could have dealt with this privately, how embarrassing for the kid\". She never even mentioned his name... She is just addressing him along with all the other boys out there who do this. Something similar happened to me when I was in grade school and instead of having my back, all my friends labeled me as a bitch for not giving this guy a chance. He WAS harassing me but it was seen as \"cute\" because women are taught to appreciate male attention no matter the circumstances. We are taught it is the best thing that could ever happen to us. Just bear in mind that if a teenage daughter willingly comes to her mother for help, during a time when most teens seek distance from their parents, there is clearly a huge problem. This is video that can help a lot of other parents and teens ...","post_message":"This mom has a message for the boy repeatedly being rejected by her 14-year-old daughter: No means no."},{"comment_id":"10153918675239170","commenter_b":"Incompetent? Really? Jobless rate record low. Economy back on track. Bin Laden dead. Equal rights for everyone. Health care for everyone. I think you need to reevaluate. Perhaps it is the people who you are getting your facts from who are the incompetent ones. And since they're evidently your only source, I'd say you might want to step up your game.","commenter_a":"He's such an incompetent douchbag. 12 more months, thank God!","post_message":"Probably as close as Obama will ever come to actually admitting it."},{"comment_id":"10153446505791130","commenter_b":"I prefer the Wicked Witch is dead!","commenter_a":"Olha, Fer Montano!","post_message":"A songwriting expert reveals the reason."},{"comment_id":"857720034363387","commenter_b":"This crap has to stop!!!!We do NOT need hillary and another 4 years of obozo and their evil ways-they have destroyed this country--we can not afford all these immigrants---we have to take care of our own first!!!!!","commenter_a":"They'll vote for Gary before Hillary.","post_message":"Exclusive: Federal immigration officials may be working overtime to swear in as many new \"citizen voters\" as possible before the presidential election, according to an internal Obama administration email disclosed to FoxNews.com by Republican Sen. Ron Johnson of Wisconsin."}]
