[{"comment_id":"10154138002220671","commenter_b":"If they dont catch her already","commenter_a":"#NewAge","post_message":"Police pursuing possible homicide suspect in Southern California"},{"comment_id":"1081267351952171","commenter_b":"@username WHO IS TRUMP RACIST TO....I WANT AN ANSWER....IF YOU ARE GOING TO SAY IT AND BELIEVE IT THEN YOU CAN TELL THE REST OF US","commenter_a":"Why would anyone vote for her after everything she's done has been exposed? She is not for the American people. Benghazi was enough for me to say #nohillary her plans to continue Obamacare, my vote is a NO, setting up a private server in her home where classified information on an unsecured server putting OUR safety at risk (then lying about it) that's a No. Claims she will fight for the children out of one side of her mouth and supporting late term abortion out of the other. #notwithher. The Clinton foundation taking donations from countries that abuse their woman and children, yet she believes in equality for women?? No way , never ever Hillary. Donald J. Trump for POTUS!!!","post_message":"\"She’s going to open the borders, pack the Supreme Court and you are not going to have the same country. Maybe you like that, maybe you don’t. But we’re not going back to the status quo, period. And so Republicans need to understand if Trump loses, it is a new America, OK? A lot is on the line, whether you like him or not. That is real.”"},{"comment_id":"10155137005061037","commenter_b":"Most illegals come here by not wading a river.","commenter_a":"Trump supporters are more worry about illegals than of terrorists what a sad world dnt forget that criminals come of all races and not just cause your brown skin means your from mexico Natives,Mexicans,Italians share the same skin color","post_message":"He once referred to it as “The Great Wall of Trump.”"},{"comment_id":"10153734508783132","commenter_b":"I have often said this...there comes a time when women need to realize this","commenter_a":"Just because you can wear one doesn't mean you should.","post_message":"NENE LEAKES can definitely rock a bikini."},{"comment_id":"10153111641514138","commenter_b":"Bitchassniggas","commenter_a":"I'm glad they stopped him because he would go there get training and come back!! We already have had too many of them do that there's a lot that get caught that we don't know about.","post_message":"Arrested at Minneapolis-St. Paul International Airport with a one-way ticket to Somalia + a fake passport"},{"comment_id":"10152762362423645","commenter_b":"smh...","commenter_a":"Marlo","post_message":"Wow. That must have been a strange night. Kurt Busch testifies that his ex-girlfriend is a 'trained assassin' who returned from a mission in blood-splattered gown."},{"comment_id":"10153613317153132","commenter_b":"Lovely woman","commenter_a":"magnifique Augrey","post_message":"\"I didn't know she was a movie star. She always looked at my father like he was the center of attention.\""}]
