[{"comment_id":"10154624417173010","commenter_b":"Water board this bitch daily then drown her","commenter_a":"Sorry. 21 years is not long enough. That baby is missing out on 80 or so years of Life. Dad is Missing out on 60 years with His son. That is NOT justice for that baby. I don't believe in an afterlife, but hers would Be incredibly cruel And dark.","post_message":"When the boy regained consciousness, she called the child's father to ask him to give up his custody rights. When he said no, she once again held the toddler's head underwater until he died, prosecutors said."},{"comment_id":"10154396026094714","commenter_b":"Hey woman need your number","commenter_a":"Angie Slater.... awesome words for you","post_message":"\"A strong spirit transcends rules.\" — Prince #RIP"},{"comment_id":"972471592821368","commenter_b":"Don't beleave this is west point?","commenter_a":"yes they are acting like beyonce,stupid","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"10155605832169657","commenter_b":"Lock her up","commenter_a":"When you see it written out like this, it is nothing short of stunning. Clinton emails. Trump admitting sexual assault. Clinton emails. Trump charity fraud. Clinton emails. Trump calls for nuclear proliferation. Clinton emails. Trump calls for national stop and frisk. Clinton emails. Trump violates trade embargo with Cuba. Clinton emails. Trump sued over Trump U fraud. Clinton emails. Trump bribes DA. Clinton emails. Trump doesn't pay taxes for 20 years. Clinton emails. Trump employs campaign manager involved in illegal corruption with Russia. Clinton emails. Trump calls for ban of an entire religion from entering US. Clinton emails. Trump lied about support for Iraq War over and over in debate. Clinton emails. Trump in court for rape of a minor. Clinton emails. Trump unaware of Russia's Crimea occupation. Clinton emails. Trump unaware of situation in Syria. Clinton emails. Trump penalized for racist housing discrimination. Clinton emails. Trump files for bankruptcy ...","post_message":"Hillary wants you to believe that there's nothing to see."},{"comment_id":"968043416588740","commenter_b":"I don't think the majority of people in England would believe any of this rubbish any more than you or I","commenter_a":"The danger of this kind of journalism is the Anti Scottish fervour that it builds up in England. English nationalism is not the civic nationalism that we are trying to achieve in Scotland. The feathers of the establishment have been rattled by,first the referendum, and then the GE. The audacity as the Mail sees it is for Scotland to be ungrateful subsidy junkies who have sent 56 SNP MPs to Westminster to represent their constituents. To carry on this vilification that Cameron promoted during the GE campaign, only months after love bombing Scotland, is to let a Genie out of a bottle that won't go back in. The union could and should end in an agreement between too friendly nations who share an island by the voting power of the people of Scotland, and not by this ever increasing acrimony fostered by the English press. It's a dangerous and unprincipled ...","post_message":"Did the Scottish National Party (SNP) hound Charles Kennedy to his death?"},{"comment_id":"10153325446200950","commenter_b":"@username you dumb ass, read the initial comment before you come for me bitch.","commenter_a":"Get them all out of here!!!","post_message":"Two refugees from Iraq with alleged ties to ISIS are due in court Friday to face federal charges of supporting terrorism. According to an affidavit, both men are accused of lying to cover up their efforts to support terrorism. The arrests are now renewing a debate over bringing refugees from Syria and other countries to the U.S."},{"comment_id":"10154291814626178","commenter_b":"Everything she touches goes to h**l.","commenter_a":"Well if they have a remake of the Munsters she might have a chance. Looks like a cross between Grandpa and Eddie.","post_message":"Michelle Obama to appear on another television show. Is this an appropriate role for the FLOTUS?"}]
