[{"comment_id":"10153754020631337","commenter_b":"Little Crybaby Bitches....aww","commenter_a":"Mets fans are always crying.","post_message":"'AN ABSOLUTE SCUMBAG': Folks were not happy with Chase Utley's slide against the New York Mets, to the point that they almost went too far..."},{"comment_id":"10152980624100667","commenter_b":"Not.","commenter_a":"The Ross Perot of the 21st century :/","post_message":"Donald Trump declined to rule out a third-party presidential bid Thursday if he loses the Republican nomination. \"I will not make the pledge at this time,\" Trump said at the start of the GOP prime-time debate."},{"comment_id":"1628105883873422","commenter_b":"And your a bitch DANI KAYE","commenter_a":"Sandy if you like him so much. Why don't you just go and live with him at the white house.","post_message":"Tomorrow, we will leave behind a president who has carried himself with quiet dignity for eight years and replace him with a man who is neither quiet nor dignified."},{"comment_id":"439363889585238","commenter_b":"This not funny I found it tasteless made my blood boil I am seeing red ! Someone needs to stop her from having any more kid someone put the whore to work fast she is hurting all of us","commenter_a":"SEND HER TO IRAN...","post_message":"“I mean, who would want to work in America?\""},{"comment_id":"846327085437336","commenter_b":"How any woman could vote republican(step ford) is beyond me, but they need to turn off Fox and Friends. Lol","commenter_a":"I STAND WITH RAND! I am a woman that has worked hard to build a career and strong skill set and I have no complaints about my salary. I earn what I deserve based on what I have done for MYSELF. Women are not inferior, stop acting like it!","post_message":"Ugh. Senator Rand Paul announced his bid for the White House, and he's one of the most anti-woman politicians out there. If he thinks the war on women is over, he just doesn't get it."},{"comment_id":"1764917753728484","commenter_b":"Not!!! When she decided to make \"her\" body a home to another human being it stopped being \"her\" body and it became \"their\" body. And as that other human being is incapable of making decisions for itself, that dumb cunt sucking poisons into \"their\" body should be jailed until the other human being is freed. Then the dumb cunt should be put in an air tight room and have the exhaust of a semi pumped into it.","commenter_a":"No,it's not her choice.Since it's obviously to late for an abortion,and she cant' control her substance abuse;she should be incarcerated until the birth of the child.The child should be then taken from her and given the best possible foster care. Hopefully the child is ok.In any case,she should be charged with child endangerment at the very least and remain incarcerated until she's no longer able to reproduce.They should also find the father of this child to find out if he is either complicit in this endangerment or is morally able to care for the child.","post_message":"What do you think? Join Us: The Free Thought Project"},{"comment_id":"894432780616200","commenter_b":"Baltimore is am example of liberal policies failure people want jobs not government social handouts","commenter_a":"This is a Democrat liberal myth if any of the Democrats they would read a history books they would learn that the Democratic Party was the original racist party remember Lincoln was a Republican","post_message":"Can't say we weren't warned ahead of time this might be a problem."}]
