[{"comment_id":"1074021369287319","commenter_b":"She's negative. ..kinda like both of u ... f off","commenter_a":"Beyonce is an asshole","post_message":"Not a lot people noticed, but Beyonce took a major stand last night."},{"comment_id":"10153612983935329","commenter_b":"Where's the fat men in crop tops","commenter_a":"@username this is why buzzfeed is terrible lol. So hypocritical","post_message":"God bless you, Roberto Bolle. God bless the male body and also tights."},{"comment_id":"10153671476736509","commenter_b":"Online predators? she lied about her age, and deceiving people. wtf is wrong with you. how would that be all those men's fault? she lied dude. i'm glad mom stopped it. we need to do something about females lying about age. why are the men in the wrong hear? but that's the double standard of women though. kids should not be on Facebook period. we need to regulate Facebook and make it for adults only. and use id's to sign in. just like in a bar. i applaud mom, she could of gotten pregnant the works. it would of been her own fault. why? because she lied and said she was a grown up when she clearly was not. mom has every right to give those people a chance to delete her. and i bet you real quick, those people removed her. good job mom. good job. kids don't belong ...","commenter_a":"So people are shitting on her for tough love because she's trying to protect her child from online predators? WTF is wrong with society.","post_message":"Tough love or public humiliation? This Denver mom gave some strong feedback about her daughter's suggestive Facebook postings: @webpagelink"},{"comment_id":"10154154937686409","commenter_b":"Very smart wife! You'd do well to follow her example!","commenter_a":"Beg to differ tree hugger. My wife warms up her 4Runner for five to ten minutes. I never warm up. Her car is a 2006 and runs like new. I've gone through two cars. And '06 and an' 08","post_message":""},{"comment_id":"10154056167770329","commenter_b":"For Christ's sake lady give it a rest!!! Please get yourself fixed and do my reproduce we don't anymore people like you. And if you've already reproduced I pray for your children. Now kindly fuck off and go find someone else to annoy. Seriously anyone else. The other girl got the message why can't you??","commenter_a":"So stupid. Blackface doesn't make someone racist.","post_message":"IMPORTANT REMINDER: It's never okay to wear blackface!"},{"comment_id":"1061054770617718","commenter_b":"I'm voting for you Hillary!!!","commenter_a":"That will be hard to do from Leavenworth. But if she thinks she can go for it. Bill will be too busy I am afraid to help though.","post_message":"“It’s clear she knows how to get things accomplished in these crazy political times. She’s still standing after decades of Republican attacks, and she’ll force them to the table once in office.” -Iowa Starting Line"},{"comment_id":"10153229424353352","commenter_b":"What a crock of shit. She's a crazy bitch who needs life in prison.","commenter_a":"Postpartum depression is a real illness. This women obviously is in psychosis; not recognizing her action at the time. Praying for these babies, her husband and her. When she is in her right mind; she will have to live with this action for the rest of her life. Also, if her husband and doctors were aware of her illness; they should also be accountable. A women this sick should never be unattended with her children. I pray for these babies health.","post_message":"Army wife says she slashed throats of her three crying babies with kitchen knife to keep them from disturbing her Special Forces husband"}]
