[{"comment_id":"10153102018738822","commenter_b":"What is wrong with these women!?","commenter_a":"Dumb fkn bitch","post_message":"A mother has been arrested after she left her baby on the side of the road in Maryland this past weekend."},{"comment_id":"10155808489605968","commenter_b":"Exactly.","commenter_a":"Of course they knew.","post_message":"KEY POINT: \"The current and former officials said that although they believed that Pence was misled about the contents of Flynn’s communications with the Russian ambassador, they couldn’t rule out that Flynn was acting with the knowledge of others in the transition.\""},{"comment_id":"10153283394148984","commenter_b":"She needs to be in the big house not the white house","commenter_a":"Grill her ass !","post_message":"Trey Gowdy has invited Hillary Clinton to testify, in private, on her decision to delete thousands of emails from her private server as well as the full scope of her responsibility in the 2012 attacks at Benghazi. Let Rep. Trey Gowdy know how you feel and customize an email just for him!"},{"comment_id":"1317863694976546","commenter_b":"She is not his type","commenter_a":"Hillary paid them","post_message":"BREAKING Trump campaign adviser A.J. Delgado tells Brian Williams the allegations of inappropriate touching against Donald J. Trump aren't credible."},{"comment_id":"10154558604929411","commenter_b":"dont worry Ann, no one would wana rape your fat ass","commenter_a":"What I find terrible is that if anybody wears a bikini they \"have chances of being raped\". Sorry, but France has to keep their country free of this BS. Next time a french woman steps into a pool in a bikini, will she be molested by this woman hating monsters?","post_message":"The pool park has allowed bathers to wear burqinis and jilbab de bains as way of exception"},{"comment_id":"10154273453111509","commenter_b":"Same thing is happening here in the US","commenter_a":"This is what happens when the liberal party's refuse to listen to the people. They don't want any more migrants.","post_message":"France's far-right Front National party has made gains in the wake of the #Paris attacks."},{"comment_id":"10153615979136336","commenter_b":"The screams of protest would wake the dead if that happened.......even after the muslims get they demands met!!! This is a true blight on America!!!","commenter_a":"Should be open to all faiths. Can you imagine the liberal outrage if it was a Christian prayer room?","post_message":"\"How loud do you think the objections would be today if they spent $250,000 in taxpayer money to build a new prayer room exclusively for evangelical Christians?\" – Rev. Franklin Graham"}]
