[{"comment_id":"10152562554341636","commenter_b":"Time to persecute muslims everywhere.","commenter_a":"I will never support terrorism but I also think we have to respect other people's religions...","post_message":"Ahmed Merabet had raised his hands up in surrender before being shot dead..."},{"comment_id":"1342391692491333","commenter_b":"Put her in jail","commenter_a":"Buses...bussed them in and still cannot fill a gym","post_message":"Hillary Clinton spoke at a campaign rally in Sanford, with one week left until the election."},{"comment_id":"1232367160117626","commenter_b":"You aren't a fan of any carnivorous animal? LOL ok.","commenter_a":"Killing for fun. \"End of the moral analysis\" The \"arguments\" of the article are pathetic. \"let’s not forget that wildlife reserves can also kill lions.\" Oh, right, I had forgotten that in this world, \"I'm not the only one to do bad\" is considered an argument. I'm not a fan of any carnivorous animal, but if you decide that they're a problem, you'd better come up with solutions that are more ethical than their own actions.","post_message":""},{"comment_id":"1187655654624295","commenter_b":"You couldn't even please your husband, what makes you think you can please us? #NeverHillary","commenter_a":"Nice","post_message":"In the presence of practical, tactical brilliance at Hamilton: An American Musical."},{"comment_id":"10153956823096135","commenter_b":"I want Michigan to win. Been a fan for many, many years !!","commenter_a":".","post_message":"POLL: It's time for The Game! The Michigan Wolverines face off against the Ohio State Buckeyes at high noon Saturday on WXYZ-TV. We want to know who you think is going to win. React to this post with a heart if you think it will be Michigan and a like if you think it will be Ohio State. You can also predict the final score with a comment. Also, if you share this post your friends can weigh in too."},{"comment_id":"619645721526492","commenter_b":"I bet this woman also looks good with clothes on (y)","commenter_a":"Please don't take any advise from the Kardashian's. Look at their lives, they have no right to give out advice","post_message":"Would you contour your bum? We're trying out the 3D tan loved by Kim Kardashian West and Olympia Valance"},{"comment_id":"1264843663556103","commenter_b":"Christianity will not be dead, extremist Islam will keep it from dying and drying out. BTW atheist here.","commenter_a":"Because \"Christmas break\" is very Biblical. -.- I am so sick of these people hijacking God and MY Faith for their asshattery and hate. It's repulsive and they are such an embarrassment. And this is why Christianity will be dead in the US within the next 50-75 years.","post_message":"This kind of ignorance has no business influencing school children."}]
