[{"comment_id":"895290923994817","commenter_b":"Charlotte u must b mistaken u must mean SLICK WILLIE & HIS FAMOUS LEWINSKY & HIS ASHTRAY WHERE HE PLACED HUS CIGAR!!! HE SAID HE DID NOT HAVE SEX WITH THAT WOMAN & THEN HE ADMITTED HE DID!!! Also remember the FOUR BRAVE AMERICANS WHO DIED UNDER LYING HILLARY!! She shd b in jail!! U have been carrying the water for the dems & it is disgusting!! Grow up cupcake & if u can't go get a coloring book and color!!","commenter_a":"We need a liar, rapist and whore nude model in the White House . U bet","post_message":"With every announcement America is falling more and more in love with the Trump family. This is awesome, it's exactly what was needed. Can we get 5,000 'LIKES' for the Trump family?"},{"comment_id":"517589811698946","commenter_b":"No it is a religious theme park what is wrong people want to let Muslims in our schools and force our American children to learn there karen but they don't want a Mural of God in a theme park .","commenter_a":"Freedom of speech. Don't like it go to another country.","post_message":"A theme park in Orlando with a Christian message was challenged by the Freedom From Religion Foundation over a mural that could be seen on the highway."},{"comment_id":"1692723517682991","commenter_b":"One of you crazy ladies is from Texas.","commenter_a":"Realism is not what I see coming from most of HRC's supporters. There are some extremely hard to admit, and in fact, frightening facts that I think we have all tried to glaze over for years. In Bernie Sanders we have got a candidate that is addressing those facts. Climate Change is real, most democrats are no longer climate change deniers, but I feel like the real threats are being overlooked. For example, droughts are happening all over the United States. We are quickly depleting our fresh water aquifers. When one factors Fracking into this, we are willfully allowing our government to destroy more of our fresh water systems. HRC cannot denounce Fracking. Now, before you think that article that spells out how much HRC is taking in campaign contributions from the fossil fuel industry is another Republican smear tactic, note that it is by Greenpeace. She has to go. ...","post_message":"\"We can open the door to every person in this country again.\" —President Bill Clinton"},{"comment_id":"10155910750959062","commenter_b":"She should have thought about her baby before she decided to become a thief! Do the crime do the time!!! She got caught and now she's worried about her baby! Should have been worried before doing the crime! Baby is being raised by a habitual, especially if she can't act straight while pregnant","commenter_a":"She was sentenced 14 days and is getting them 3 for 1 that's 5 days people. If she were male and not pregnant she would have been ordered six months. Being pregnant isn't a get out of jail free card.","post_message":"Right or wrong?"},{"comment_id":"10153095122281770","commenter_b":"Screw her","commenter_a":"DONALD TRUMP for PRESIDENT","post_message":"Hillary Clinton urged attendees at her Alexandria, Virginia, campaign rally on Friday to “start a competing organization” to the National Rifle Association and join her fight to end the “plague of gun violence.”"},{"comment_id":"10153406999866336","commenter_b":"This is why blacks think conservatives are racist. Only foxtards are defending this flag.","commenter_a":"How about just not ban anything...and let the consumers decide for themselves !!! Or...would that be racist somehow too ???","post_message":"“If Amazon.com is removing the Confederate flag from its offerings, the logical and principled decision is to stop selling any promotional material... of Che Guevara or any mass killer.”"},{"comment_id":"219022051835576","commenter_b":"Legal Immigration isn't a Problem! Melania Trump is a legal Immigrant!","commenter_a":"YES","post_message":"Senator Tom Cotton just introduced Trump's immigration proposal through the Senate! Sign the petition SUPPORTING the bill HERE: @webpagelink"}]
