[{"comment_id":"10152870782829091","commenter_b":"Who kill innocent people ... Im just saying .. Encourage them America ....this is why the world is crazy cuz of the way y'all( liberal whites ) think ..filthy animals","commenter_a":"What the hell is wrong with people..... She should of had her students send letters to our troops","post_message":"SHOCKING: A teacher in New Jersey has been suspended for having her third-grade class to write get well letters to a sick inmate convicted of killing a Philadelphia policeman: @webpagelink [PHOTO: Forest Street School]"},{"comment_id":"783835985050207","commenter_b":"Ginny don't forget under obummer gas was over $5 a gallon. Our healthcare got destroyed. Illegals flooded our country sanctuary cities like where Kate from the unpassed Kate's law was MURDERED by a loser criminal ILLEGAL career criminal thug. I could go on but I've found that the foolish people out there that haven't woken up yet never will.","commenter_a":"I love how about Obama and Hillary want to save the world but not America","post_message":"Obama plans on bringing in 10,000 Syrian refugees, but Hillary Clinton wants to increase that to 65,000. What do you think?"},{"comment_id":"10154092020795950","commenter_b":"Understood but will be a taxpayer nightmare of added security details. I am sure there are comparable private schools in DC.","commenter_a":"Can you imagine if any other President did this? In addition to taking his grown CIVILIAN kids to meetings with foreign leaders. And people are actually defending this...lol","post_message":"America could soon have a long distance FLOTUS."},{"comment_id":"10153238705381717","commenter_b":"Yes, well if you're a woman who's into men, that is how it should be. Is there any particular reason you're trying to pick a fight?","commenter_a":"What's next ppl marrying there pets!# Gross..one man and one woman period. DAMM GAYS","post_message":"In case you missed it:"},{"comment_id":"1401830939879019","commenter_b":"If you are in the U.S illegal,then you should be deported period,there is some circumstances involved in illegals","commenter_a":"Amen brother!","post_message":"Black Trump Supporter Just Exposed SICK Thing He Saw Muslims Doing In His TownHas BRUTAL Message For Liberals Share if you agree they will NEVER Assimilate"},{"comment_id":"10155832964064062","commenter_b":"But you're gonna pay for that wall?? Here's some facts no fake or false ones where are you getting your info?? Russia? @webpagelink @webpagelink And if you make that much good for you hire trumps tax attorney trump hasn't paid for taxes you're crying about in 20 years, It'll help offset the insurance cost. I'm sure you can afford it.. And again democracy is majority of the vote as for the illegitimate vote why don't you believe the fact it was tampered with to make trump win? Guess 2+2 never equals 4 ..he won with little more than 25% of actual registered voters now tell me how that works?? As for God's being in government it's expressly written to be kept out by our founding fathers ..called separation of church and state.","commenter_a":"I feel sorry for the people who actually believe in him. They need God in their lives, seems as nothing in this earth can convince them they are being screwed lied to and alienating half of the world. Keep drinking that kool aid let's see what shambles we are left in.","post_message":"President-elect Donald Trump defended a plan this morning that would see the U.S. initially pay for a border wall with Mexico and be reimbursed at a later date."},{"comment_id":"10152998486166680","commenter_b":"BRAVO TO TRUMP!!!! We LOVE your IMMIGRATION POLICY!!! But, you \"must\" repeal the 1965 Immigration Policy to make sure things go back to normal!! Those who use the \"RACE CARD\" and cll names are really part of the problem!! Place them on \"BLOCK\"!! Of course they will rant and scream racism, because that is the very tool and threat they use that they are so used to getting their own way with! THEY are also destroying this Country! What is unconstitutional is what is being done NOW! Deporting ILLEGALS is the LAW!!! The LEFT are out in droves to slander, to name call, to label, to smear, to relentlessly attack all supporters of Trump and anyone else who is trying to save this Country!","commenter_a":"2016 TRUMP FOR PRESIDENT 2016","post_message":"Donald J. Trump's three-principle plan: “1. A nation without borders is not a nation. There must be a wall across the southern border. 2. A nation without laws is not a nation. Laws passed in accordance with our Constitutional system of government must be enforced. 3. A nation that does not serve its own citizens is not a nation. Any immigration plan must improve jobs, wages and security for all Americans.”"}]
