[{"comment_id":"802434323195863","commenter_b":"I support neither group. Blacks and whites need to get along. We are in a failing country that is falling apart.we need to get rid of this racism and focus on the big picture here","commenter_a":"As a member of the Armed Forces and a decorated war veteran...she does not owe me an apology. She used her platform to deliver a message while honoring a historic Black-ran group on their 50th anniversary during the one month Black history seems to be relevant. Coldplay honored the LGBT community in their performance but ironically there was no uproar over that. If anything @username you owe me, the Armed Forces, and the Veterans an apology for posting this crap and trying rally up sympathizers to further your racist agenda. Radical? Hardly....maybe you should brush up on some history and ask yourself why these organizations began in the first place before posting....oh and this...","post_message":"***BLACK PANTHER PARTY SUPPORTER AND BLM RADICAL DONOR BEYONCE OWES AMERICA'S POLICE, ARMED FORCES, & VETERANS AN APOLOGY***"},{"comment_id":"1982433335149738","commenter_b":"Beyonce is good in showing off her booty and that's about it .","commenter_a":"Agreed with Santana. Her performance was too visual artistic and address to a very narrow audience....it was not too much a vocal challenge or a singing performance in the true sense. This characterize her style over all.","post_message":"Carlos Santana: Beyoncé is not a singer, with all respect to her"},{"comment_id":"10153565125016162","commenter_b":"Evil. What is so sick about our world is that moms and dads kill their babies every day by the thousands. It's called abortion. We should be as offended and grieved at the kids killed in the womb and out of the womb.","commenter_a":"Typical crackhead POS!!!! He should commit suicide.","post_message":"CHARGED: Young parents arrested after newborn found to have 20 fractures, police say: @webpagelink"},{"comment_id":"10154134849200695","commenter_b":"Sorry that you have to know the pain :( if you want to follow along like my page @username Walks ..I'll be posting updates there along the way","commenter_a":"I am walking across America this year in honor of my sister who died of an overdose. I am going from Delaware to California and telling people about this epidemic and about Good Samaritan laws that protect people from going to jail if they call 911 for help when they see someone overdosing. @webpagelink","post_message":"A powerful new drug is triggering a spike in overdose deaths in Atlanta & across Georgia. Where the pills are coming from and the urgent warning from experts at the CDC, today at 5."},{"comment_id":"10154691859089778","commenter_b":"Smart enough to know that it's people like Trump that make the world go round. It takes the 1% to contribute the 99% of us that couldn't keep the economy a float without there financial support or contributions to the economy. What is ruining our economy is supporters like yourselves who probably believe in giving the minorities a place to stand in the bread line while they send there un-taxed & undocumented earnings home to there families living like royalty on the backs of the mighty American dollar. While the rest of registered documented citizens pay our taxes to make America great. I am all for immigrants who are here legally and lawfully it's you stupid idiots who support the system in the blind to allow otherwise.","commenter_a":"Racist people are coming out the woodworks. They are attacking Donald Trumps campaigned because they are to stupid to understand the truths of our Society. To stupid to understand simple economics, taxes and laws. They result to violence and idiotic actions. Because they are to stupid to see what's right and wrong!","post_message":"Protests erupted during a Donald Trump rally in Chicago, forcing him to cancel the rally. @webpagelink"},{"comment_id":"1060076290679393","commenter_b":"I believe you! Just saying IMF found some crazy monetary practices. Matching 8% would create a crazily unsustainable and unattainable and unrealistic economic goal. We had our state government promise such riches for a 20 year period to public employees and it's not a practice followed and linger because we have had to fund that same crazy generosity despite economic ups and downs. This created alot of resentment as courts say we must continue to fund these government employees who gave themselves this great pension!","commenter_a":"This is just like Greece, nepotism, expensive payrolls and pensions created to benefit a few individuals and their families while real public needs are neglected...this is the opposite of socialism @username","post_message":"The budget crisis faced by Illinois is dire - the state government itself is drowning in $37 billion of debt. Read more: @webpagelink via Special Reports"},{"comment_id":"10155487456986509","commenter_b":"Hillary is a baby killer.","commenter_a":"He was completely right on everything he called a disaster. The biggest disaster of all was the video proving that she and her campaign incited the violence at his rallies. Perhaps using the word rigged is an oversimplification, but for Christ's sake, she's guilty if inciting riotous behavior. Vote Trump, as middle finger to the corruption in government.","post_message":"- Aleppo - Hillary Clinton's tax plan - Obamacare ...and more things that Donald J. Trump called a \"disaster\" at the final #debate. @webpagelink"}]
