[{"comment_id":"10152734752677434","commenter_b":"Lol","commenter_a":"Hmmmm I actually do think he's kinda sketchy re: women. If he's so power to the people, then where was he when Gore or Kerry ran? Just sayin","post_message":"Bernie Sanders wrote an essay in 1972 that mentions rape, and it's weird as hell"},{"comment_id":"10153585291913132","commenter_b":"The only reason 14-16 is a plus size model is because of fashion magazines. She is a NORMAL size model. That is average size.","commenter_a":"The woman depicted in this picture is a \"plus sized\" model and she's drop dead gorgeous! I wish they would STOP trying to glamorize Tess Holiday... she's pretty and if she truly feels good about herself being morbidly obese and unhealthy then good for her, but she's sending the wrong message!","post_message":"\"All women need to do to get a bikini body is to put a bikini on.\" - Tess Holliday"},{"comment_id":"10153335992009071","commenter_b":"Malia Young-Williams","commenter_a":"Omar Kashmir","post_message":"We tried Shake Shack’s new Chick-fil-A killer."},{"comment_id":"10154274374674445","commenter_b":"Meant north Falmouth not Nana! These txt terms get ahead of me lol!","commenter_a":"Granddaughters & sister-in-law-,law live in E,& Nana Falmouth have to check it out!, saw on local TV Chronicle last night!","post_message":"Chronicle on WCVB Channel 5 is exploring the beauty of Cape Cod. What's your favorite spot to visit each year? Watch live: @webpagelink"},{"comment_id":"10153329525229203","commenter_b":"It's called Sharia Law and it's practiced in Muslim Country's where Women are considered worthless property.","commenter_a":"Alexis A Massey","post_message":"In Nigeria, violence a husband for the purpose of correcting his wife is considered lawful."},{"comment_id":"10154205810731179","commenter_b":"Ah misogynist women are the *best*.","commenter_a":"Don't flatter yourself lmao. Look at his wife 😍😍","post_message":"#WomensMarch"},{"comment_id":"10152863643681990","commenter_b":"Illegal immigrants should not be here to commit any crime. U. S. Citizens do not need the extra concern.","commenter_a":"Yes look at Dyllan Roof he looks Latino... He shoot 9 black people last month in church.","post_message":"IMMIGRANTS AND CRIME: Despite rhetoric in the Pier 14 shooting Francisco Sanchez case, immigrants do not commit more crimes that U.S. citizens. That's according to 100 years of research according to the American Immigration Council. @webpagelink"}]
