[{"comment_id":"10153444568593984","commenter_b":"hillary shouldn't even be allowed to run, she and all her and obamas co-horts should be in jail for treason. and what would be so bad about going back to the 50's. that was a great time to grow up. at least the govt. was 80% honest and not 99% dishonest. if she gets elected then something is diffinitely wrong with this country and the people in it.","commenter_a":"Sorry Mr. Levin but unless the Republicans can come up with a candidate who doesn't still live in the 1950s and can stay out of people's bedrooms, Hillary will win.","post_message":"BOOM! Outspoken Levin just stepped up to the plate and asked what everyone else is thinking. Hillary will NOT like this one bit... Do you support Mark Levin?"},{"comment_id":"881610245305235","commenter_b":"She is skanky.","commenter_a":"Megyn Kelly is a waste of human potential. A bright and flashy exterior but of little inner substance.","post_message":""},{"comment_id":"10153444104128690","commenter_b":"Americans breed Christians at alarming rates... They have taken over.","commenter_a":"stop buddist terrorist!","post_message":"The group has stoked anti-Muslim sentiment by saying Muslim communities have high birth rates and will eventually overrun the predominately Buddhist country even though they currently represent less than 10 percent of the population. @webpagelink"},{"comment_id":"1068924329809654","commenter_b":"I would hope so Peter! Because she is a women","commenter_a":"I've always considered myself conservative, I box, hunt, camp, work hard, and don't support socialism, but I believe Bernie is the best canidate.. I know for a fact I'm more manly than the person who typed this weak paper","post_message":"An open letter from a real woman to \"male adults\": \"We can and we should cherish men who exhibit traditionally masculine characteristics. They have made the world what it is today. I raise my glass to you gents. I've even made you a sandwich. But on the flip side of these strapping, rugged men there's you. A Bernie Sanders sycophant with not quite enough self-worth to fill an egg cup. Or a teaspoon. Certainly not enough to fill your bong. Take a good long puff before you read the rest of this, it's not going to get any better. I'm not going to make you a sandwich either. May I recommend a Hot Pocket? What is a man? A man, as defined by this woman, exemplifies the evolutionary behavior of a provider. This can take one of two forms (maybe both) of hunting and/or gathering. The more successful the man ..."},{"comment_id":"10156281148690725","commenter_b":"The wife knew what was going on","commenter_a":"The non-profit has rules and he \"didn't follow them\" (I guess) so the family should return it. 100 Club should learn by this mistake and not give out money till the ruling is over...Everyone expect the family to put a \"Go-Fund-Me\" page up soon :/","post_message":"An organization that helps the families of officers during times of need is now asking for the substantial donations made to the loved ones of Lt. Joe Gliniewicz to be returned ----> @webpagelink"},{"comment_id":"1201578119864976","commenter_b":"All rapists should be killed.","commenter_a":"Yes it does","post_message":"This reeks of white privilege."},{"comment_id":"10152810811021130","commenter_b":"It absolutely shocks me that this many woman are grossed out by their own bodies. What a shame!","commenter_a":"I'm glad to see this getting publicity. I love my cup and would love to see more acceptance and less \"ewwwwww\" about it. It's great!","post_message":"Menstrual cups could be a great alternative if you don't like tampons or pads."}]
