[{"comment_id":"843269965740273","commenter_b":"How do you know it's a woman?","commenter_a":"It's so sad to see how judgmental people are. Opinions are like belly buttons. Everyone has one and they're filled with lint. To call this woman names and degrading her by calling her IT, is shameful. Not everyone lives inside the box or mold of society. \"Free your mind, and the rest will follow!\"","post_message":"Today's culture is damn sickening. This thing is straight from hell and should be sent back. This is ridiculous..not even funny"},{"comment_id":"806491062782835","commenter_b":"Its funny the democratic party started the Confederate nation and fought to keep slavery. Robert byrd retired in 2010 a Democrat longest serving politician in history and was active member of the klan. Imagine all yhr bills he voted on due to his racist views. Alot of the Democrats knew he was a klan member and said nothing. Pull some ones opinions off line and use them to your benefits but truth is your being lied to but 99% of politicians and the first to speak up you all attack.lol just like o malley saying all lives matter and Democrats attacked him for that. Yet alone he is democrat himself. Get it through your heads we are done with the hypocrits and lies and political correctness","commenter_a":"Can someone please explain to me who they are polling to get Trump in the lead?","post_message":"And yes, it's really his number."},{"comment_id":"1048920205189554","commenter_b":"@username idiot!!!!","commenter_a":"It's not necessary to test on animals. Their bodies are not like ours.... it means nothing. Do the back study of how useless animal testing is, folks.","post_message":"This is the heart-touching moment 156 beagles are set free from an animal testing facility in India. Credit: Caters TV"},{"comment_id":"1407030135990971","commenter_b":"pugsky er uhyggelig","commenter_a":"@username Jeg ønsker mig en bullpug!","post_message":"Lots of adorable, slightly sad faces."},{"comment_id":"10153350173059255","commenter_b":"Isn't that one of their anchorwomen?","commenter_a":"Most \"Sex Obsessed\" persons constanty ruminate about avoiding and policing sex.","post_message":"Really, guys?"},{"comment_id":"10153351260137439","commenter_b":"Go home to your rodent pit ugly woman","commenter_a":"Why did they come to the USA? To bring death? Shame yourself Mother of Satan.","post_message":"@webpagelink"},{"comment_id":"10153031617927217","commenter_b":"Nope, women can't","commenter_a":"Can they pee standing up?","post_message":"While the two women will graduate this week, they will not serve in the US Army's 75th Ranger Regiment. The US military has yet to lift a ban on women serving in the fighting force."}]
