[{"comment_id":"10152879295577623","commenter_b":"A lot of girls are...","commenter_a":"Worst part is...SHE looks like she was cute,pre meth...","post_message":"A man and woman from North Carolina were arrested in Louisiana and face charges of manufacturing meth."},{"comment_id":"10154102450848984","commenter_b":"OMG, Hillary is so very, very, very White !","commenter_a":"She just wants to be president, talks a lot of BS.","post_message":"Wow. Hillary Clinton was caught doing something next to Al Sharpton that is fueling the criticism that she is a complete fraud... and it was all caught on camera. Do you think Hillary will be the Democratic nominee?"},{"comment_id":"1766281877023124","commenter_b":"Its not the bathrooms that rea really an issue, its the open locker roons with few changing stalls that people are really worried about since most transgenders do not get the full plumbing make over.","commenter_a":"Who is going to notice if this guy uses a men's room? I swear America is making more problems each day out of boredom. No one here in Germany gives a shit is your trans or taking your kids to the shitter. If a trans or better said a human being needs to pee I really don't care what gender they are or identify with. It's none of my fucking business.","post_message":"When it comes down to it, trans people just need to pee. That's all."},{"comment_id":"10153025578804753","commenter_b":"Which one are you Dave... The chick in the skirt..?","commenter_a":"Cowardly cops should go find work at the library..!","post_message":"Police said the man instead charged at the officer, who retreated behind his patrol car while giving numerous commands for the suspect to drop the rock. The man raised the rock to strike the officer, so the officer fired his weapon 3 times to prevent the suspect from striking him. According to a police statement, the officer, “used deadly force against deadly force”"},{"comment_id":"10156613595445354","commenter_b":"I'm amazed at how ignorant she is!!!","commenter_a":"Wasserman Schultz is what you cal and air head. The elivator does not reach the top floor.","post_message":"\"...it’s incumbent upon us to stand with our Muslim brothers and sisters and make sure that we can push back hard...\""},{"comment_id":"10153399487739411","commenter_b":"wrong , Britain has nothing to be ashamed about, its not British people planting bombs and blowing their own kind up, if you haven't got anything useful to say except the usual stereo typical crap then stfu and go away, preferably to the middle east if you think the people are so great. Its funny how people such as yourself preach \"tolerance\", care to show an example of tolerance shown by Islam or its followers","commenter_a":"To that ignorant little britain first shitbag you do not represent my country, Britain is built on the back of slavery, racism and bigoted xenophobic imperialism but today it SHOULD stand for tolerance, cosmopolitanism and living in peace with our collective of ethnicities from all corners of the former empire (Including Wales and ireland, remember when it was fashionable to hate the Irish too, wake up muppet divide and conquer is as old as politics itself.)","post_message":""},{"comment_id":"10153830861505695","commenter_b":"It is much safer at sea then it is to remain in port.","commenter_a":"Praying they're found. Since the owners and the captain of the ship knew the path of the hurricane, why was it allowed to leave the port or at the very least why wasn't it rerouted?","post_message":"Loved ones aren't giving up hope, despite a life ring being found."}]
