[{"comment_id":"850014095139630","commenter_b":"Those illegals and Refugees are everywhere,and plenty of them,obama has been busy letting them in the last 8 hills,hillary killed off soldiers[American] and wanted muslims in,guess she wanted to kill babies that was full term so they would not grow up for the usa,,what a mess,in the usa,why don;t they stop all of this junk? This is America?","commenter_a":"So I have posted this many times.... How many of our citizens have to die or be injured before these Far Left Dems understand and see the light! These illegals and Refugees are not good people......","post_message":"John Kasich opened up Ohio's borders to refugees and himself to a tidal wave of Twitter hate..."},{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"},{"comment_id":"764116903756422","commenter_b":"@username I don't see you birthing a baby out of your pee hole.","commenter_a":"I see all of these people shaming women for having an abortion, but it takes two. The woman just has to walk around with the evidence. So many are so quick to hold up signs and protest against a woman's choice yet we have so many unwanted children waiting to be adopted. Caring for children doesn't stop at a fetus. If you're going to protest and shame a woman for making, for some a very difficult choice, how about you go through an adoption process, pay for children's education and medical, etc. If you're not out there trying to adopt unwanted children, then you really shouldn't be shaming a woman for having an abortion or taking her right to choose. Perhaps if people and the government put this much attention toward education, and giving equal opportunities to all, we would have more successful people and less unplanned pregnancies.","post_message":"\"Women's health and rights are now one of the first casualties of the Trump administration.\""},{"comment_id":"985183654870370","commenter_b":"She's tripping.......","commenter_a":"She got a low i.q. and a low self esteem. Your kids should come before any man. They always say a fool and their money will soon part. And soon, it will all be gone and so will he.","post_message":"The N.C. woman who won a $188 million Powerball last February is facing an onslaught of criticism after she posted a $12 million bond for her boyfriend…for the fourth time. Lamarr (Hot Sauce) McDow was arrested Tuesday for violating the terms of his pre-trial release. As NewsOne reported last year, Marie Holmes, 26, posted bond for McDow three times — once just weeks after she collected her winnings ($3 million), once in August ($6 million) and again in October after he was arrested for possession of a firearm by a felon. Is the public being too hard on Holmes? Is it any of our business what she does with her money? Let us know ----> @webpagelink"},{"comment_id":"10152695549716615","commenter_b":"My wife has never done drugs.","commenter_a":"That lady obv is a meth head..","post_message":"A second grader who has autism - slapped by a teacher's aide. That boy's parents tell WPXI Joe Holden their son was tapping on the aide's shoulder, trying to get her attention, when they say she hit him. Both mom and dad are now upset with how the school handled the incident. We're learning more about the aide's punishment and why it's just not enough for these parents. Joe is also making calls to the school for a response. He'll have an update tonight at 5:06 p.m. on Channel 11 News."},{"comment_id":"10153603934566336","commenter_b":"From one extreme to the other. Idiots who need to find villages.","commenter_a":"That is so ridiculous! Why are people so stupid and go to such extremes.","post_message":"In the wake of the controversy surrounding the Confederate flag, a school district in Tennessee has banned all flags and banners, including the American flag."},{"comment_id":"989628607749873","commenter_b":"Lord have mercy, poor little baby, may he rest in peace.","commenter_a":"HOW?!?! HOW DOES THIS HAPPEN?!?! I just can't wrap my head around it. I have tried to understand but I am also a busy/working mother and I just can't understand how you can forget about a child in a car.","post_message":"Parents, grandparents and caregivers of any kind - PLEASE remember to always check your vehicle: @webpagelink"}]
