[{"comment_id":"10154369386511545","commenter_b":"Imagine if someone came and ruined America and a civil war started. People killing and fighting everyone. Not everyone has the money to buy guns or the nads to pull a trigger. Hopefully that never happens but I am guessing people would try and leave, some in a hurry to wherever is better and closest....and hopefully don't get turned away at borders.","commenter_a":"Why, oh why, can't the pot stirrers understand the difference between LEGAL and ILLEGAL when it comes to immigration?!? The US was indeed made up of immigrants, and we love immigrants still, WHO COME HERE LEGALLY. And while I'm at it, why should we take in refugees WHEN WE HAVE NEEDY AND HOMELESS AMERICANS IN EVERY MAJOR CITY IN THE US? Let's give the CITIZENS all the benefits first. Why is that such a hard concept for some people? Seriously! Do you really think any other country in the world would put refugees AHEAD of its own citizens?!? No! Americans first, then help others. Just like in an airplane, put YOUR oxygen mask on first, then help the ones around you. Oy!","post_message":"The full commercial didn't appear on television during the big game after it was rejected by Fox. The full ad, which is nearly six minutes long, is available on the company's Twitter account."},{"comment_id":"10156408466705354","commenter_b":"This woman is so disgusting! I can't even stomach accidentally surfing and the view is on for the second it takes for me to change it!","commenter_a":"Don't watch that show. Should be taken off and replaced with Mr. Roger's Neighborhood reruns.","post_message":"Maybe they should open every show with a preemptive apology for all the mind-blowingly stupid things they're sure to say. VIDEO below of their latest..."},{"comment_id":"10155222410880354","commenter_b":"Oobama and his stupid bastards.","commenter_a":"Deport EVERY SINGLE ONE!","post_message":"Obama Administration Sets Up Hotline for Illegals Seeking Amnesty Under Obama's New Policy."},{"comment_id":"1145471028827087","commenter_b":"Joy yes the Bible said far be it from the true God to act wickedly! Death is the last enemy, the pain we feel when a love one dies is beyond words indeed God don't cause wickedness n bad things to happen but he \"ALLOWS\" I lost my son who I love dearly and reading and focusing on JOB experience help me to keep my sanity! THANKS BE TO GOD.","commenter_a":"You would not believe how many people said \"everything happens for a reason\" or \"this was God's plan\" when my son was stillborn. It made me so angry, still does. There is no reason, the autopsy proved that.","post_message":"In case you missed it: Sometimes saying \"Everything happens for a reason\" can hurt the folks we mean to help."},{"comment_id":"10156142090560594","commenter_b":"I know","commenter_a":"Go back to Brooooooooklyn. Where you belong.","post_message":"If we can't have San Francisco Giants postseason wins, this is the next best thing."},{"comment_id":"546417122231127","commenter_b":"You're so racist it's sick. Tell that to the kids who can't go to school because they can build multimillion dollar stadiums or provide tourist attractions all while shutting down schools. You grew up a sheltered white girl. I already know.","commenter_a":"They lack the testicular fortitude to do this on a Saturday night around 2 Am in Miami 's Liberty City or Overtown or in front of Snoop Dog's house in LA. Instead they go on a Sunday afternoon, when this office is closed. I see nothing but loudmouth cowards with missing teeth and bad clothes.","post_message":"White Lives Matter group protests outside of the NAACP in Houston's third ward! #WSHH #NAACP #Houston #WhiteLivesMatter #BlackLivesMatter #AllLivesMatter"},{"comment_id":"522407631280177","commenter_b":"Translation: her vagina scares me.","commenter_a":"Maybe it is because Hillary Clinton is just plain unlikable. I am not a Trump fan but will hold my nose and vote for him over her. Her voice scares people, she just can't connect with anyone. She is the female John Kerry.","post_message":"Hillary Clinton and Democrats think or hope that once the primary wraps up, tensions will subside."}]
