[{"comment_id":"10153603488066680","commenter_b":"The only law that need making is that ONE that makes it illegal for people to break the law!!","commenter_a":"The Boston bomber used a pressure cooker, Oklahoma was fertilizer. Killers will find a way. Let's blame the perpetrators, the ideology,not inanimate objects. Law abiding citizens should not have there rights tampered w. Let's enforce the laws we have.","post_message":"\"We need to have the hard discussion and talk about gun laws that allow an individual to legally purchase weapons that facilitate mass killing. We have to have those hard discussions,\" Lynch said Tuesday."},{"comment_id":"10153454779861336","commenter_b":"If Mexicans went they would no longer be illegal aliens. They'd be going home.","commenter_a":"I didn't know NASA was racist theres no black astronauts on the list!","post_message":"NASA - National Aeronautics and Space Administration has named the four astronauts who will fly on capsules built by private companies — SpaceX and Boeing."},{"comment_id":"10153617049593984","commenter_b":"Hillary's a woman chaser to.","commenter_a":"Bill has Always been a Woman chaser... Hillary Must been doing something Wrong... Or she's to busy Scamming People out of their Money.....","post_message":"This woman has struck fear into the hearts of the Clintons for a long time. Now she may have just landed a knockout blow on Hillary... This could be what takes Hillary down. Do your part to make sure that happens by spreading this article to your friends and family."},{"comment_id":"409710459217248","commenter_b":"Sad she's even allowed in this country & in our schools!","commenter_a":"Sad that she promotes hate.","post_message":"Jewish professor shuts her mouth..."},{"comment_id":"834047250056984","commenter_b":"NO MORE ILLEGALS IN THIS COUNTRY ON WELFARE!","commenter_a":"Ladies and gentlemen, the next president of the United States, Donald Trump. Trump train all the way to the white house!!!! #trump2016","post_message":"Thank you Illinois! #SuperTuesday #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"604349323031583","commenter_b":"You're an idiot. It doesn't matter what book you use to swear I could use The Heir to the Empire by Timothy Zhan and that would be acceptable. This is a secular country not a Christian nation if you want to argue that fact look up the 1st ammendment which is the freedom of religion and freedom from religion in addition to separation of church and state. If she wants to use the Quran let her if you want to use the Bible fine if I want to swear on a star wars book damn those corrupt judges I'm going to swear on my Star Wars book","commenter_a":"No. We use the Bible in this country.","post_message":"Should he have allowed her to take her oath on the Koran?"},{"comment_id":"161828217554597","commenter_b":"Racist bitch","commenter_a":"The racist white ppl that support Trump never show black ppl in a good light!! Never!! @username is the most racist of the right-wing, white supremacist sites!","post_message":"After the Louisiana flood, this man started wondering when the help from Black Lives Matter and Black Panthers would be arriving... The TRUTH is devastating..."}]
