[{"comment_id":"10155810026285725","commenter_b":"Now Mr Trump you know as well as I do Obobblehead is a backstroker, he says one thing and then does another, then tries to back stroke to cover his lies","commenter_a":"Finally someone who thinks like a REAL American!! You have our vote.","post_message":"Make our borders strong and stop illegal immigration. Even President Obama agrees-"},{"comment_id":"971601666302233","commenter_b":"It seems like all the intelligent women with morals have been fired... This show needs to be cancelled!","commenter_a":"Yes","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"1317571668339082","commenter_b":"Same base of people that have supported him all along - not enough!","commenter_a":"Uhm, Trump is not losing support. Did you not see the amount of people that showed up to his rally today?? You've got to be joking!! He spoke to at least 25K people. And there were still people outside whom the fire Marshall would not allow in!!","post_message":"The National Rifle Association has spent more than $21 million on the presidential race, praising Donald J. Trump and knocking Hillary Clinton."},{"comment_id":"10152704207984135","commenter_b":"Don't tell me how to live my life, bitch!","commenter_a":"And now on this part of our safari, we see on our right a fat Rino. The gazelle on it's left hasn't to worry, for Rinos are herbivore. This particular Rino, unfortunately, is an omnivore. Watch out, Laura!","post_message":"w/ Laura Ingraham at #CPAC2015"},{"comment_id":"10153944733281178","commenter_b":"She should be in jail.....sick, liar.....","commenter_a":"She's mentally ill or clinically insane.","post_message":"If this came from a Republican, their campaign would be immediately over. #TTT16"},{"comment_id":"620543131446096","commenter_b":"She's a LIAR!!!!!","commenter_a":"So, she's going to declare bankruptcy and drop out of the presidential race???","post_message":"Wow. I don't think she thought this one through... Do you think a Hillary Clinton presidency would be terrible for America?"},{"comment_id":"10154426235974369","commenter_b":"My Smith & Wesson says otherwise, son.","commenter_a":"If you support trump. Every time you Run or walk you will be Trampled","post_message":"Donald J. Trump really went after Hillary Clinton in his speech today."}]
