[{"comment_id":"1787645241556279","commenter_b":"They look beautiful, professional and feminine. Certainly classy women.","commenter_a":"These are first class ladies No attitude","post_message":"There's great symbolism in Melania Trump and Ivanka Trump's inauguration style."},{"comment_id":"10153231447637217","commenter_b":"But if she was an alcoholic, it would be okay","commenter_a":"...and yet we allow 16 year olds and younger to raise children because 'if you do the crime, do the time' BUT HEAVEN FORBID THAT YOU SMOKE MARIJUANA","post_message":"Sindy Melany Ortiz says a hospital is restricting her access to her newborn daughter because she smoked marijuana."},{"comment_id":"10154061060138433","commenter_b":"@username -that's the point. Many have NOT committed a crime or have been overcharged to force a plea because poor people can't afford bail, or to wait in jail for a trial and to leave their kids or their job..","commenter_a":"They seem well paid to me. Especially when there's a glut of them.","post_message":"Did you see the Netflix series Making a Murderer? Remember Jerome Buting, one of the defense attorneys? PolitiFact Wisconsin recently checked his claim that Wisconsin pays criminal defense lawyers who represent the indigent $40 per hour, \"the lowest in the country.\" That rated a Mostly True."},{"comment_id":"678517065647894","commenter_b":"#TRUMPPOTUS Save America from wussies!","commenter_a":"When is NBC going to start posting about the latest Wikileaks stories?","post_message":"\"I regret coming to the Trump support event, and in particular allowing my son to be a part of it,\" one donor said."},{"comment_id":"10153062363276162","commenter_b":"Black women are much more violent than all other women combined!!! Actually, violence is the worst among blacks. So stop saying there are bad in all races.. WE ALL KNOW THERE ARE BAD PEOPLE IN ALL RACES.. but the fact is that more blacks commit crimes than all other races combined.. WHY? WHY???? WHY????????","commenter_a":"Just the blacks stealing again. They'll catch them.. eventually as always.. then when they fight the cops, they'll complain that the cops used unnecessary force again.","post_message":"SMASH & GRAB: Thieves smashed a stolen car through the windows of a Best Buy in Lincoln Park early this morning. Officials aren't sure how much was stolen, but no one was injured in the break-in. FULL STORY: @webpagelink"},{"comment_id":"790733494450561","commenter_b":"You go girl.","commenter_a":"good goin!! nice shot!","post_message":"65-Year-Old Woman Shoots Robber Michael Bontaites Square In The Chest. Thank god for the 2nd amendment. Do you support her right to bear arms?"},{"comment_id":"991210200940830","commenter_b":"DUMB-DUMB-DUMB WOMAN","commenter_a":"What a ghastly hag!","post_message":"She's not the only woman to make such a painfully ignorant comment. Just last week, a German Mayor made a very similar remark. Click here to read what she had to say about Muslim immigrant rapists, and how women in Germany can prevent rape: @webpagelink"}]
