[{"comment_id":"1416682211693618","commenter_b":"Ya we we'll come u 2 da seat Hillary","commenter_a":"She is a wonderful woman, read this to get the proof @webpagelink","post_message":"A reminder heading into tonight's debate."},{"comment_id":"10152831511530496","commenter_b":"She is ugly","commenter_a":"While we understand that there are various strong opinions on this topic, we ask that everyone express them with in a respectful manner. Memes and inappropriate comments will be blocked from view. Those posting slurs or otherwise offensive comments will have their posting access to our Facebook page blocked.","post_message":"Caitlyn Jenner, the Olympic athlete formerly known as Bruce, makes her debut as a transgender woman, posing in a swimsuit on the cover of Vanity Fair. Take a look: @webpagelink"},{"comment_id":"594411744025341","commenter_b":"You probably have one between your legs Shannon!","commenter_a":"Who cares! It's an inanimate object! Ever heard of idolatry? This is it!!!! True followers of Christ don't kneel before a statue, they kneel before the one true God.","post_message":"What does sheer animalistic Muslim hatred against Christians look like? Story below."},{"comment_id":"1246596595370794","commenter_b":"I commend you for being relentless and honorable. It is a very hard row you hoe in the cesspool in Washington D.C. I hope you have hazmat insurance. With deep respect, SFL","commenter_a":"Hon Gowdy, you have the support of the American people, Why, please tell, has the Congress of the United State, officials that we, the American people elected to represent us th the American peo have not brought charges against the current Administration, contempt, treason, murder, deriliction of duty, incompentence, assisting the enemies of the United States, Why Senator? Why? Why are you with the help of the rest of Washington letting us down?","post_message":"It’s taken way too long and way too much of our energy in simply gaining access to #Benghazi documents and witnesses. There continues to be time wasted negotiating with executive branch entities who do not want to give us what I believe Congress is entitled to."},{"comment_id":"10153359522561051","commenter_b":"I'd be waiting every day to catch those bitches.","commenter_a":"I hope she caught her in the parking lot.","post_message":"When this woman's 2-year-old son came home with these marks on his leg, she marched down to his school and demanded to see the surveillance footage. Now she's even more outraged."},{"comment_id":"10153528018151717","commenter_b":"She really most likely break the toilet seat when she sat and clog the toilet anyway....best she go to Wall mart to do her business anyway cause she will fit in so much better being in her own element.","commenter_a":"This doesn't have anything to do with being fat, and she isn't mentally ill. She is suffering from an illusion, and that is anyone gives a rat's ass about her opinion. I don't even think she can afford to shop at Target, and if she did she'd pay for it with food stamps. Her kids get free lunch at school, and are probably on state Medicaid. Point being, she is depending on the government to sustain her lifestyle of having as many no-neck young'uns as she can have. Probably only has sex in order to procreate and we are screwed up. I wonder what her white trash, holy roller agenda is all about?","post_message":"A serious kook attack has been captured on video."},{"comment_id":"1563567157272928","commenter_b":"Stupid ass motherfucker","commenter_a":"way to go rosie, now evryone knows why trump treats you like he does. you usless POS. Done let the door hit you in the ass on the way out. if Canada doesnt want you, please dont come back","post_message":"Rosie O'Donnell just restarted an epic feud."}]
