[{"comment_id":"1009448912521620","commenter_b":"I'm sick of seeing her scrunched up \"end of her world\" face. She and the others like her are the problem. Sorry cupcake, grow up and accept it.","commenter_a":"I dont see how any employer would want to hire these idiot mellinials.they dont think for themselves.they dont research for the trueth basicly you dont want morons working and running your buisiness.","post_message":"Ummm... WHAT?"},{"comment_id":"380847572097124","commenter_b":"This piss-ant compared himself to MLK!!! That's their mentality; he's blinded by hate. Typical rightwing idiocy!","commenter_a":"Idiot.","post_message":"Today is not the day for this nonsense."},{"comment_id":"1903950129833878","commenter_b":"@username It was stolen! Putin and Trump stole the election, doesn't your little brain understand this. A foreign dictator stole our election so that this con-man could be manipulated by an evil russian. Read!!","commenter_a":"Then come on Democrats, let's shut down America! Trump cannot make it to the White House!","post_message":"No doubt! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"940671535979474","commenter_b":"Traci, if you feel that way then please block me.","commenter_a":"The trolls are up and ready. I see no great news for women. No woman should have the right to kill, like no man should have the right to force himself on her. Two wrongs don't make a right.","post_message":"Life begins at conception and it's time the law reflected this obvious truth! Have you signed YOUR petition yet? Click HERE to urge Congress to pass the Life at Conception Act! @webpagelink"},{"comment_id":"10157007192550354","commenter_b":"But illegal aliens have Constitutional rights..yeah,she can go fk herself right about now","commenter_a":"tell that to chelsea you a hole","post_message":"\"...the Left is very energetic about inventing myriad rights for people who weren’t born in the United States or naturalized as citizens. How can the absolute denial of rights for unborn persons, whose parents are indisputably U.S. citizens, be logically squared with the Left’s zeal for handing out rights to foreign persons who just happen to be standing on U.S. soil?\""},{"comment_id":"10153312471793606","commenter_b":"Enough Rioting In Baltimore Already It's Time To Cleanup The Damage Those Idiots Made And To Restore Peace Better Yet Make Those Monkeys Who Damaged Baltimore Cleanup Their Own Mess","commenter_a":"<iframe width=\"330\" height=\"180\" src=\"@webpagelink\" frameborder=\"0\" allowfullscreen><\/iframe>","post_message":"#BaltimoreRiots: We're monitoring social media right now, and some people are tweeting to get out and riot AGAIN. @webpagelink"},{"comment_id":"10155404286440389","commenter_b":"she needs go home shut up and bake pie","commenter_a":"Benghazi won't go away...no matter how many deletes","post_message":"\"A left-leaning agenda won’t get [Hillary Clinton] the presidency – it’s only part of the battle.\" – Doug Schoen, pollster for former President Bill Clinton Question of the Day: Will Bill’s shenanigans hurt Hillary if she runs for president?"}]
