[{"comment_id":"10152873585726051","commenter_b":"I thought they are suppose to be getting a education if they are going to act like fouls then everyone needs to pay and kick them out of school so somebody wanting to be there can.","commenter_a":"What a disgrace!!! Is this what they went to college for? They should be expelled and not allowed in any other college!! Let them have to work hard for the rest of their lives!!","post_message":"This fraternity caused $430,000 in damage and wasn't sorry about it at all. Well, now they're sorry."},{"comment_id":"1124028447686512","commenter_b":"YES She will Win No he will Not be elected. We The People need Bernie Sanders and Elizabeth Warren in The Senate to Protect the Environment The Economy and raise a little hell with Corporate Greed and Global Poverty; End Hunger for Kids, Homelessness and Gun Violence.Heathcare Education and Social Justice For All; VOTE !","commenter_a":"Hillary won nothing I'm voting for Trump","post_message":"TELL US YOUR THOUGHTS! FOLLOW US at Reverb Press and Stories That Resonate <<<"},{"comment_id":"533052596897970","commenter_b":"Her coloring is terrible. Bad makeup artist. It's not natural looking.","commenter_a":"they should've casted danai gurira from the walking dead. She'd do an amazing job. The fact that they couldn't get a beautiful chocolate actress is plain disrespectful","post_message":"Here's Why Casting Zoe Saldana with Blackface is a Major Problem. What do you think? Please share this video! #NinaSimone"},{"comment_id":"10153700282571955","commenter_b":"Ann Coulter's long lost French sister !!! Yea !!!! <3 \\b\\b\\b\\b\\b","commenter_a":"European and US far right are far different there is no limited governemtn and free marekt in Europe, it is just taking chashing cultures seriously.","post_message":"NEW WONDER-GIRL OF FRANCE FAR RIGHT..."},{"comment_id":"1156100184429437","commenter_b":"This woman is for Trump","commenter_a":"It was really disgusting watching how Fox News joined the rest of the \"Left-stream\" media last night in savoring Ted Cruz's Wisconsin win. Megyn Kelly & co. continually dissected the voters by pointing out that \"Trump was losing the appeal of woman voters.\" \"That Wisconsin voters were educated and paid very close attention to details!\" How sad. Never in my life have I witnessed how the GOP could deliberately try & take down one of their own while leading the attacks against Mr. Trump in their on-going crusade \"to stop Trump!\" This is very disturbing. Cruz and that nasally annoying voice of his was carrying on as though he transformed this presidential race when in fact it was Mr. Trump who initiated the anti-establishment hostility from the moment he threw his hat in the presidential ring. Cruz is a GOP plant as is Kasich.","post_message":"THE EXPANSION OF TERROR is so much worse than what we'd like to admit, a new report out of the EU confirms: @webpagelink"},{"comment_id":"10154406219790329","commenter_b":"She's taking the piss out of men who try to compensate for their little sausages, get it now?","commenter_a":"Jacqueline Boggs","post_message":"\"My vagina just sneezed, judging from my underwear.\""},{"comment_id":"10153149917160667","commenter_b":"@username And I should lose my right to own gun's because of what he and a few others have done? Not going to happen.","commenter_a":"We have to stop this hate Americans have towards Muslims all bc of some crazies. I mean heck go read on Christianity through the years and check out what they've done!","post_message":"#HokiesDontHate is being used in a campaign by Muslim students to \"extinguish ignorance\" on campus."}]
