[{"comment_id":"10153945249138690","commenter_b":"The Muslims massacring Christians citizens","commenter_a":"She is a Christian with big heart offering kindness and help to the Muslims so would Muslims do the same things to Christians ?","post_message":"When refugees arrive at the Greece-Macedonia border, the smiling face that greets them is that of Gabriela Andreevska. Watch more Al Jazeera Shorts - @webpagelink"},{"comment_id":"589266911222085","commenter_b":"I'll say it to your face, tough guy...but we all know that a pussy like yourself will never deliver!","commenter_a":"A lady I worked with told me the closest thing to a lesbian experience she ever had was kissing, a liberal beta male on a dare!","post_message":"This is just the best!"},{"comment_id":"1801521536786663","commenter_b":"We can send all the \"safe space\" cry babies here. It will be perfect Trump will just need a longer wall. Oregon? You want in on this? Please speak up before we order materials for the wall","commenter_a":"Please do.","post_message":"The group said they plan to seek independence through the United Nations."},{"comment_id":"10153848630809411","commenter_b":"About time someone stands against the crooked cops","commenter_a":"My wish is that these imagrants won their battle and that they rule in Europe as it were Europes wish that they rule in my country. :) Now its your turn.","post_message":"'Like a war'"},{"comment_id":"10153500345233352","commenter_b":"Real women make it happen!! (:","commenter_a":"10.50 ???? I make $8.00 hr with 4 kids and a grandbaby,no child support,no housing I can tell a story","post_message":"Single mom, 22, reveals her struggle to live on McDonald’s wages of $10.50 an hour… and how she and her young son have to live in a moldy basement"},{"comment_id":"1125525780793011","commenter_b":"Sick people, and Michelle is out rapping with them, no class in the White House!","commenter_a":"YOUR a Dickhead! You should be arrested","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink Will Attorney General Loretta Lynch target this \"hate speech?\""},{"comment_id":"10153330953062452","commenter_b":"Stay out of this Stephanie Mullins","commenter_a":"Great. Now it'll be legal for California to smell worse than just smog and congestion. ***Disclaimer*** This comment was made in sarcastic jest. If you're offended by this joke, clearly you cannot comprehend sarcasm over the internet. Avoid replying if you're offended. You'll just make yourself look as stupid as the halfbreeds of Offended By Everything 2015. #PSA #TheMoreYouKnow #CalmYourTitsAndTokeYourHits","post_message":"Is California going to pot? The push to legalize recreational marijuana use in the state just got a big boost. The California Medical Association is giving the proposed ballot initiative a big thumbs up. abc7.la/20oIUO6 So, should adults 21 and over be able to buy and smoke weed?"}]
