[{"comment_id":"10156175309065231","commenter_b":"She lookin to get paid! I'm sorry ....she a hoe","commenter_a":"Voting democrat","post_message":"Pierson feels her new alliance with the Donald is \"perfect.\""},{"comment_id":"10155444687161490","commenter_b":"*how dare she!!!!!","commenter_a":"@username, This ^^","post_message":"Ivanka Trump tweets about the \"importance of women having a seat at the table. @webpagelink"},{"comment_id":"10153337404314454","commenter_b":"Just be thankful that our atmosphere isn't filled with Volcanic ash from a bunch of volcanoes erupting.... We could go into a hundred year mini Ice Age.","commenter_a":"The earth will one day shake humans off like fleas off a dog. But how sad we couldn't have done better.","post_message":"Using data collected by NASA satellites, researchers have found that more than 1/3 of the world's largest aquifers are drying up faster than they being replenished."},{"comment_id":"10154099091458984","commenter_b":"He is another politician and a big lier as well he cheated in the other debate with Ben Carson he will say anything to get a vote and he will owe a million favors for all the lobbyist sending him,all this money","commenter_a":"Why are people at war all the time with a Democrat or a republican let's change this to U.S. political leaders and vote for a person not a party. They always have to make people take sides and it needs to be changed.","post_message":"With the South Carolina primary right around the corner, Ted Cruz is doing his best to diminish Donald Trump's lead. Cruz's latest attack is getting a lot of attention, and it may cause some voters to ditch 'The Donald.' Is Ted Cruz right about Donald Trump?"},{"comment_id":"1752150585035881","commenter_b":"@username WE ARE GOING TO WIN HITH Hillary Clinton","commenter_a":"Interesting double standard. After all the horrendous things he's said about her this campaign, and the pathetic name calling, she offers one funny and spot on zinger and once again he has to have the last word.","post_message":"Watch the moment Donald J. Trump called rival Hillary Clinton \"a nasty woman.\""},{"comment_id":"1349045918521792","commenter_b":"You have a lot of names there Laurren.. The typical liberal feminist skank.. Way to go","commenter_a":"Just a suggestion for you @username people. If you dislike Trump and hate that he won a fair election then I suggest you retreat into your safe space for the next 4 years (at least). Shouldn't cause you too many problems as you probably don't have jobs anyway.","post_message":"This website is going viral, and Trump is not happy. You know what to do!"},{"comment_id":"382957778552770","commenter_b":"Better her than some right wing nut!","commenter_a":"Hoping for someone else - Hillary is too close to big bankers. :(","post_message":"You won't believe how large her lead is now!"}]
