[{"comment_id":"1136350429757739","commenter_b":"She needs to excuse herself from this case.. this is a total conflict of interest!!","commenter_a":"Crooked ass administration...don't force us \"We The People \" have had enough","post_message":"What the WHAT?! This cannot stand."},{"comment_id":"551801648301945","commenter_b":"I don't get it?Hillary will finish off this country!why not trump?He loves this country,He loves our military,he will get jobs bk from china&other countries that are ripping us in every way,He is rich enough that he doesn't need donations or special interests groups.That sounds a lot better than flooding America with illegal immigrants,Raising Taxes,&bankrupting the Country.","commenter_a":"I like Sanders but I believe he is too far left to win. Hillary has baggage but I believe she can win. Either way we have to keep the GOP out of the White House","post_message":"No matter which candidate you support - attacking each other isn't helping the cause. ~Marty"},{"comment_id":"324603137933515","commenter_b":"@username have her livein your house ! Problem solved ..","commenter_a":"She can come but her parents need to stay and fight for their country","post_message":""},{"comment_id":"10153874445353132","commenter_b":"Women WE MUST UNITE AGAINST STUPIDITY!,","commenter_a":"Did y'all read the article or just start running off at the mouth?! I, too, had the same reaction until I actually read the article. This congressman did not come up with this if his own accord. It was reported to him by the ones who trained them. THEY said there was special treatment.....not the congressman.","post_message":"\"Fighters must be prepared and capable. If they are not, people will die.\""},{"comment_id":"10152550592377014","commenter_b":"Someday we would love too visit, Beautiful!!","commenter_a":"Jeremiah Ludewig it's so pretty but idk if I could do with cactus lol","post_message":"Another night, another stunning Arizona sunset sent in by a great 3TV viewer. Thanks, Rosanne Zimmerman!"},{"comment_id":"1594655060832823","commenter_b":"Put her out there in the line of duty unarmed and we'll see how fast her mind changes!!!!!!!","commenter_a":"Impressive stupidity","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"1742743236000370","commenter_b":"Typical Bernie speech sounds like this.I like to thank my legs for supporting me.My arms for always having been by my side and as for my fingers-------I could always count on them.","commenter_a":"Thank you West Virginia and Nebraska...Im glad several of our states including Pa..can see what Trump needs to do.. JOBS....people need to get back to work.and Most hard working people want this...everyone needs to pay into the system..","post_message":"It is a great honor to have won both West Virginia and Nebraska, especially by such massive margins. My time spent in both states was a wonderful and enlightening experience for me. I learned a lot, and that knowledge will be put to good use towards the creation of businesses, jobs, and the strengthening and revival of their economies. I look forward to returning to West Virginia and Nebraska soon, and hope to win both states in the general election. Likewise, my time spent last week with the great people of Oregon will hopefully lead to another victory next Tuesday. Thank you! Donald J. Trump"}]
