[{"comment_id":"1499576316724205","commenter_b":"Leave now. You are discase","commenter_a":"CANT WAIT","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"10157707332290354","commenter_b":"Deport her ass","commenter_a":"If you vote Hillary you are just inviting scum like this into our country.","post_message":"What did she mean by this?"},{"comment_id":"1164111043641758","commenter_b":"that is not Trump8 wife","commenter_a":"Hey if you got it show it","post_message":"Liberals Attack Trump Family After Sexy Photos Of Ivanka Trump Leak. Let's show her our support. Do you stand behind the Trump family?"},{"comment_id":"235119820270004","commenter_b":"Haaaaaaaa!!!!! Stupid, stupid lady.","commenter_a":"Too bad crybabies, he is your president. And I hated Obama but I am a grown-up and lived with him and his ugly family for 8 years. So grow up and shut up","post_message":"Trump has now set a record for the most hated president."},{"comment_id":"649171271940118","commenter_b":"So how many times would we pay for the same illegals to be deported again and again and again","commenter_a":"Yes deport all the illegals that are in Our Country, if they can't come in our Country legally then they don't belong here, the illegals are nothing but a drain on our economy, with welfare, food stamps, medical housing and transportation which Obummer is giving them all, and Bankrupting our Country, all at the tax payers expense. I feel that they should have been deported long ago and not allowed to come back into the US since they came in illegally in the first place and those that have done this they should never also be allowed to try for Citizenship to The United States...","post_message":"Donald Trump just showed everyone how much illegals really cost. Enough is enough. Send them all back! Do you agree all illegals should be deported?"},{"comment_id":"954958944620884","commenter_b":"all fuckin jerks,","commenter_a":"WORD","post_message":"ClashDaily.com"},{"comment_id":"10152910274569091","commenter_b":"Lmao I wonder what gave him away... The eyes?","commenter_a":"@username lol","post_message":"This man was arrested smuggling 18 pounds of marijuana in his checked bags at LaGuardia Airport: @webpagelink"}]
