[{"comment_id":"10154789025934641","commenter_b":"If wonder woman can do it ..so can I","commenter_a":"This is so disappointing. Anyone petitioning for the removal of Wonder Woman as ambassador, clearly doesn't know the history of the character. Peace Justice Equality ...and more. Bottom line: basing her removal mainly on appearance - is sexist. Look at male superhero costumes. They leave little to the imagination also. No one is hollering about that. As a feminist, I understand that the sexual objectification of women is a huge problem in our culture. The answer is not to force women to cover up. The answer is to allow women to express themselves without fear. The answer is to teach our boys how to behave. Read the comics. Read the history of the character. Read scholarly articles on WW as a feminist icon. She has pro-women zingers that make me cheer! Many parts of her \"sexy\" costume are actually powerful symbols. Do some research. I know there are more important ...","post_message":"Wonder Woman has been stripped of her role as UN honorary ambassador less than two months after the appointment was made."},{"comment_id":"403409623179979","commenter_b":"And Hillary with Bill and Chelsia in tow is better. Maybe the icing looks better, but the cake is just as bad and tastes like crap.","commenter_a":"Do you ever wonder which one of the 14 GOP wannabes will get the nod. \"Please forget I'm a Bush, Bush; Mr. Personality Egomaniac Trump; etc. . Fourteen is a long list. I can't keep track. . .","post_message":"\"The crankiness of Scalia's insults run inverse to his intellectual consistency.\" Jon Stewart"},{"comment_id":"10157534463145354","commenter_b":"Ass holes","commenter_a":"Tell the Lebanese to get the F off","post_message":"Antisemitism mars Rio Olympics... “The 2016 Olympics – a disgrace!!”"},{"comment_id":"10155225064836509","commenter_b":"I always wondered how these bathrooms would cleaned. A typical janitor would violate the law twice if he/she cleaned these bathrooms. Or maybe they just don't get cleaned at all","commenter_a":"Hillary's a racist bigot!! She's disgusting! Calling all black people \"Super Predators\" is beyond uncalled for and her beliefs and policies have shown her disdain for the community. Only racists and bigots could support a lying criminal old white lady like her. We arent in the 60s anymore, the \"good 'ol Goldwater\" years are over. Ya know Hillary, you remember saying you were a \"goldwater girl\"?! The same group that opposed the civil rights movement?!!","post_message":"JUST IN: A federal judge has temporarily blocked the University of North Carolina from enforcing the state's so-called \"bathroom bill\" from applying to three transgender plaintiffs."},{"comment_id":"1537745819864402","commenter_b":"and that still doesnt make him legitimate to run. Even down here in Australia we know he doesnt qualify... Surely they havnt dumbed billy yankee down that much???????","commenter_a":"Boehner and Trump, best of buds...who would have thought?","post_message":"Ted Cruz just got the best endorsement he could ever get. He could not have gotten a better endorsement than he got out of John Boehner."},{"comment_id":"1114475591908563","commenter_b":"Scum","commenter_a":"Two interviews; one discussing the present, when he declares no share ownership etc, etc, and a second interview, which was today, discussing the past when he did own some. Two very different things. Perhaps it's wise to point that out, instead of skewing the facts to confuse your poor readers....","post_message":"BREAKING #MicBrights"},{"comment_id":"10153212964226336","commenter_b":"Daniel Eskildsen just because this women gave her kid a cookie doesn't mean she fills her kid with junk food.. cookies in my house are a treat to the healthy diets I have my children on..","commenter_a":"Teachers need to worry about teaching and not parenting","post_message":"Cookie crackdown! A preschool teacher sent a note home reprimanding a Colorado mom for packing Oreos in her 5-year-old daughter’s lunch."}]
