[{"comment_id":"1816060081994479","commenter_b":"Worst lady","commenter_a":"Healthy lunch...kids that depend on this for their only meal for the day are going home hungry.","post_message":"Vice President Joe Biden calls Michelle Obama the \"finest first lady in history\"."},{"comment_id":"274137179658285","commenter_b":"@username paying for this useless wall? Yeah I know. It must be stopped!","commenter_a":"I wonder how many of these people are willing to take any of it illegals home, feed them, pay their medical bill and totally care for them?","post_message":"LIVE: Protesters gather at JFK Airport in New York in response to Trump's immigration order. A Yellow Springs resident is planning a local protest for Sunday: @webpagelink"},{"comment_id":"987580134720040","commenter_b":"Send illegals home","commenter_a":"Send the illegal scum back home.","post_message":"\"The massive influx of immigrants, both legal and illegal, has been demonstrably bad for the employment prospects of low-skilled Americans...\""},{"comment_id":"971078176272942","commenter_b":"I am writing the facts and the reality. Muslims do not adapt to our culture, habits and language. There is one kind of human race which always cause problems: Muslims. The only thing Muslims do is fight. In your muslim countries, all what you guys do is fight, fight and fight. If you want to live according to the Islamic laws, go live in Muslim countries. There are enough Muslim countries where you can experience your believe . Let the people of Europe alone. Adjust or outside. Respect our Western culture.We do not need you. You are a cost for the European community. You make abuse of our social security. You have no added value for Europe.","commenter_a":"@username, All Muslims are terrorists. Muslim students have cheered in a Dutch school when they heard that the airport has been attacked in Brussels. Muslims have thrown stones at the police in Brussels at the time of the arrest of the terrorist Abdeslam.The situation in Europe is much worse than the media lets on. Muslims who commit such attacks are psychopaths. There is something seriously wrong in their heads. You can't negotiate With fools . There is only one way to deal with this. Eliminate! All the world has problems with the same human race: that are the Muslims. It is a fact and a reality. It is always with Muslims that the world has problems with. You forgot the attac in New York committed by Muslims coming from Brussels! Muslims are a threat to humanity. Please wake up Hillary. Face the reality of the danger!","post_message":"In our fight against radical jihadism, we have to do what actually works. One thing we know that does not work is offensive, inflammatory rhetoric that demonizes all Muslims. There are millions of peace-loving Muslims living, working, raising families, and paying taxes in this country. These Americans are a crucial line of defense against terrorism. They are the most likely to recognize the warning signs of radicalization before it’s too late, and the best positioned to block it. We need every American community invested in this fight, not fearful and sitting on the sidelines. So when Republican candidates like Ted Cruz call for treating American Muslims like criminals, and for racially profiling predominantly-Muslim neighborhoods, it’s wrong, it’s counter-productive, and it’s dangerous."},{"comment_id":"10157370446315354","commenter_b":"Let a woman kill them.","commenter_a":"Bring see how many get wiped out America is not afraid of you cowards","post_message":"As the ISIS cancer grows, the threat comes closer and closer."},{"comment_id":"727273657378849","commenter_b":"We can not trust Iran and we definitely do not need to give them money. Thanks for standing up against this deal and a deal that does not even include the release of our Americans held in the Iran prison.","commenter_a":"hey rodney you pathetic weasel,the US has violated almost every treaty they have ever signed you delusional fool.","post_message":"My statement on the nuclear deal reached with Iran: “In the coming days and weeks, I will carefully analyze the details of this agreement, but remain skeptical that the Iranian regime will live up to its end of the deal,” said Davis. “We’ve been here before with North Korea who two decades later have cheated its way out of a deal and onto a path to dozens of nuclear weapons. I fear this administration has agreed to terms that will leave the world’s leader in state-sponsored terrorism stronger economically with a nuclear program largely intact.” Last week, I spoke on the House floor warning against a bad deal with Iran →"},{"comment_id":"10153768028339614","commenter_b":"Lol Olivia you sound butthurt or does truth hurt as Ben Carson state all black lives matter not just criminals","commenter_a":"Where's the black lives matter people at? Or is only white on black that matters","post_message":"An anti-violence advocate is now paralyzed after being shot in the back during an attempted robbery, and the teenager arrested was supposed to attend one of his speeches on reducing juvenile crime rates. The Cal Poly Pomona student turned his life around after a criminal history beginning at the age of 12 and facing abuse in foster care. But while in Georgia to share his message of peace, Semaj Clark was shot. won be able to walk anymore, and that hurts me, but it not going to stop be from doing what I got to do, he said tearfully from his hospital bed in Georgia, where he continues to recover. Watch KTLA video here: @webpagelink"}]
