[{"comment_id":"10153771879894714","commenter_b":"@username shouldn't of made it seem like she gets to walk away from killing someone when they wrote the sentence with the link attached.","commenter_a":"but if Caitlyn Jenner wasn't famous then she would be treated like everyone else and serve jail time.","post_message":"Caitlyn Jenner will not face criminal charges in the February crash that resulted in the death of another driver."},{"comment_id":"952261771573668","commenter_b":"You don't have to like Trump to have your PUSSY groped!","commenter_a":"I'm telling ya people, you dont have to like Trump personally but you all have to get out there to vote for him to stop this stuff. Its unreal. Its almost like we are living in 1960's Soviet Union.","post_message":"This makes me sick..."},{"comment_id":"1216236868472563","commenter_b":"I'm all for it and We will let Yall have all of our democrats too","commenter_a":"Can we please please please have a vote on splitting the united states into the union and confederate states? Let the confederate states figure out first hand what \"do nothing\" politics really does. The north is already outperforming the south in money and academics, and they aren't so cruel either, but the south will never admit their shortcomings ever and at this point they are just a huge drag.","post_message":"The plan relies on individual tax credits to allow people to buy coverage from private insurers."},{"comment_id":"10153527234442434","commenter_b":"Lies! Aryan Jesus is from Florida!","commenter_a":"Bruh, even your religion came from the Middle East, STFU","post_message":"“I’d ask you to go back through history and figure out, where are these contributions that have been made by these other categories of people that you’re talking about, where did any subgroup contribute more to civilization?” asked Congressman Steve King"},{"comment_id":"1041909399153863","commenter_b":"Craig your brain isn't fully developed until you're in your 20's. Please just shut up.","commenter_a":"GOOD!...i hope she get life in prison...she killed a human being , not just a blob of cells....after 20 weeks the baby has feelings when touched...full lungs , full body parts , a full brain...it was murder plain and simple....why would ANY WOMAN wait sooo long to decide to kill her baby???","post_message":"The criminalization of pregnancy continues"},{"comment_id":"10153501793088837","commenter_b":"I don't care that they kissed but I think all PDA should be refrained. I won't do it in public and I don't like it when straight people do it. Save for privacy of your home. I don't mind seeing a quick kiss, but the groping is nasty.","commenter_a":"keep your private life private... and when you go to a different place be modest n respectful..carry yourselves accordingly","post_message":"UPDATE: Jordan Schaeffer still hasn't recovered from his Miami vacation when he and his boyfriend were beaten at a BK Whopper Bar in Miami Beach after they kissed."},{"comment_id":"497217833799843","commenter_b":"American does not need to bring any of them here. They need to return to their country and fight for it.","commenter_a":"some dumb asses do not see it..as I say only welcome children and women....period...send those men back and tell them to fight for their country......those are ISIS men....they do anything to get in the civilized countries and take over.....wakw up people","post_message":"Can you see the BIG difference?"}]
