[{"comment_id":"10155050203774369","commenter_b":"It wouldn't have meant a thing if Hillary didn't lie to the congressional hearing. She's the one that committed perjury and gave Russia the opportunity. .","commenter_a":"All I can say if they didn't have anything to hide, why so angry?","post_message":"The 2016 U.S. election was NOT the first to be the object of \"malicious cyber activity,\" Barack Obama said."},{"comment_id":"771398419667869","commenter_b":"Do not trust this corrupt bitch she will promise everything Bernie says so we will back her !Bernie or bust never Hillary she can not be trusted","commenter_a":"#Bernieorbust #NeverHillary #Hillarigged #IndictHillary #RIPDNC #Demexit","post_message":"Thanks to millions of people across the country, we have the most progressive platform in the history of the Democratic Party. Thank you! And while we have made great progress advancing the important issues that brought millions into the political process, the fight is just beginning."},{"comment_id":"10153206057979312","commenter_b":"Yeah that's why global warming is such a bigger deal than millions of humans getting their head slashed. Good one! You know they will come over here and do the same!","commenter_a":"If the President comes out in favor of it they'll drop the idea like a hot rock.","post_message":"Under the proposed measure, Missouri residents would switch to daylight saving time in March 2017 and never turn their clocks back again. Good idea? Bad idea?"},{"comment_id":"1451058244908937","commenter_b":"Deport illegals!!","commenter_a":"Florida for Trump!","post_message":"LIVE Trump! DRAIN THE SWAMP FOLLOW US for Conservative news!---> Freedom Daily Donald J. Trump Donald Trump For President #maga"},{"comment_id":"10155083980414203","commenter_b":"April BABIES have NO REALITY according to YOU! THAT IS WHAT IS CRAZY. I don't listen to insane lunatics April.","commenter_a":"Thank you Pence for deciding what women can do with their bodies. When the time comes, if it hasn't already, that you need Viagra or any other penile disfunction medication or treatment, we will decide if you can get your dick pills or not. Oh and, fuck you Pence!!","post_message":"Today was a Mike Pence crowd."},{"comment_id":"874881595880596","commenter_b":"Doesnt matter what they get The blacks or most of them would whine and complain about something!","commenter_a":"Lets just go back to the old days of segregation if that's what they want and they all can ride in the back of the bus","post_message":"“Whites Not Allowed” This is the public education system in Obama’s America."},{"comment_id":"1007444045971350","commenter_b":"don't change anything","commenter_a":"STOP","post_message":"First The 20, Now The $5 Bill - Obama Announces More 'Diverse' Face For The Bill Stop it. Leave our money alone. Do you think they should keep honest Abe on the 5$ bill?"}]
