[{"comment_id":"1008549135942537","commenter_b":"Stupid..and when it doesn't work do they turn in their brooms?","commenter_a":"Pray for our president every day!","post_message":"Witches Plan To Cast A ‘Binding Spell’ On Trump And His Supporters Every Month During The Crescent Moon @webpagelink"},{"comment_id":"1862646097306537","commenter_b":"Now that is what real Democracy looks like. You go GIRLS with you in spirit.","commenter_a":"Beautiful","post_message":"What a successful march! Can we get 300,000 likes for these brave ladies? Read more HERE: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153179149615399","commenter_b":"Most Conservative Women act childish.","commenter_a":"Right wing conservative instigator botox bitch.","post_message":"Actually, it's really not."},{"comment_id":"10152627290331636","commenter_b":"should be run over by a merkava driven by a female israeli lieutenant. thirty times.","commenter_a":"To all the comments... No one support banding women from driving in saudi expect the foreign policy of UK, USA and france which insisted to aid every decision that made or will be made by barbaric and dictator royal family in saudi since 1940s,.... lets stop taking and read history... \"Knowledge-is-power\"","post_message":"The totally logical justification for a ban on women driving in Saudi..."},{"comment_id":"10154208649726770","commenter_b":"She needs to go so she can do no more damage","commenter_a":"She will be dumped her country is tired of Muslims ruining their country raping their women","post_message":"Merkel's party is second in polls for the first time since 2010"},{"comment_id":"10153707771213598","commenter_b":"Oh wow, so I guess she never felt them moving around in there for the last FOUR months of her pregnancies. That was probably a monkey or a frog moving around in there. Right. Stupid, evil excuse for a woman.","commenter_a":"Her remarks don't make a bit of sense. What in the world she thought was growing in her body got 9 months, and she is swelling and gaming weight, etc. did any of her babies kick and move around? Was she skinny when her children were born? She just instantly gave birth to a baby out of the blue! Wow! Just plain stupid.","post_message":"Planned Parenthood President: My Childrens’ Lives Began at Delivery, Not Conception"},{"comment_id":"1040495199380065","commenter_b":"Looks like only gays and uninformed women votes get this evil women.","commenter_a":"President Hillary Clinton","post_message":"A win for Hillary."}]
