[{"comment_id":"617513011783820","commenter_b":"Bitch stumbles all the time","commenter_a":"She's a friggen Drunk ....!","post_message":"Hillary stumbles boarding plane..."},{"comment_id":"1419424701411870","commenter_b":"Um no","commenter_a":"Peter Di Benedetto","post_message":":O"},{"comment_id":"947458941975777","commenter_b":"@username Hillary won","commenter_a":"I'm voting for Bernie, Because I give a damn.","post_message":"I got into politics not to figure out how to become President. I got into politics because I give a damn. #DemDebate"},{"comment_id":"1399324063479459","commenter_b":"Put her away","commenter_a":"Karma!!!","post_message":"She got what was coming to her and then some. Excellent! People who treat cops like dirt should absolutely be called out and held accountable."},{"comment_id":"10154078774989877","commenter_b":"Besides reproduction and parts which aren't anyone's business, nothing in these comments state what makes a woman a woman.","commenter_a":"We should all be okay with this. Two words: Fairness and equality.","post_message":"Spelman College to consider admitting transgender women Grio fam, is it time HBCU's updated their views on gender identity? Sound off below!"},{"comment_id":"10156296694950293","commenter_b":"If all the grandkids reproduce themselves it could happen.","commenter_a":"The will be you soon @username","post_message":"A sweet story this morning. A grandmother hangs nearly 70 stockings on her wall every Christmas. Tell us about the traditions your family has!"},{"comment_id":"10153125857102994","commenter_b":"Just wondering if she is 13 or 14? Or is there 2 different shootings..? Because some sites says a different age than the others.","commenter_a":"Its called ignorance people. Doesnt matter if your black, white, asian or blue, these families live a life that involves violence, or may have experienced violence, try to take precautions to keep family safe but are ignorant to what \"safe\" really means. DPD can only do so much, with stupid people. Another tragedy, that will soon be replaced by another, unfortunately, probably by tomorrow evening. Stop the violence and ignorance everyone, and help save our children, who are the future.","post_message":"Police say no adults were home at the time. We'll have more @10 p.m."}]
