[{"comment_id":"1721466568134277","commenter_b":"SHE IS A HITLER","commenter_a":"What an idiot","post_message":"Was this a good idea?"},{"comment_id":"10153356838133690","commenter_b":"Let ur sister to mumbai to get a rape","commenter_a":"Pak and ISI will use the money to fund terrorists !!","post_message":"Pakistan and China have held close diplomatic, military and economic ties for decades, but these projects would represent the largest investment in Pakistani history. @webpagelink"},{"comment_id":"860171507364731","commenter_b":"Wow... really? So sad.. moms please be very careful who u leave ur kids with..","commenter_a":"she looks like she is a... \"few bricks short of a load\"","post_message":"This 18-year-old girl is accused of leaving her little sister in a hot car while her and her friend went shopping for swimsuits. Investigators say the 2-year-old's temperature was already at 100 degrees when she was rescued:"},{"comment_id":"10153353653386051","commenter_b":"Get in his ass!","commenter_a":"No more tacos or carne Asada for this loser.","post_message":"This man killed a police officer – and then laughed about it. Here's what happened to him in Texas yesterday. Do you consider this justice served?"},{"comment_id":"1022130381169318","commenter_b":"CUMMING are stupid brats !","commenter_a":"OMG what a crock","post_message":"Come on..."},{"comment_id":"10153630301063132","commenter_b":"Did they ever catch those fucktards??","commenter_a":"God Bless her and her family!","post_message":"\"I can't understand why they would want the thrill of hurting me like this, hurting my entire family.\""},{"comment_id":"1686157554986660","commenter_b":"Smart woman only a dummy would join Scientology!!","commenter_a":"Kirstie, you are beautiful and such a smart woman! I applaud your endorsement of Donald Trump. Don't let your \"neighbors\" get you down.","post_message":"I am sure people in Hollywood are losing their minds right about now, but this actress is NOT backing down. Do you support Kirstie Alley's presidential pick?"}]
