[{"comment_id":"10152592127946717","commenter_b":"I wonder why she hasn't refused service to other heathens? You know, non-Christians, like Muslims or women who cut their hair...wait...that bitch cuts her hair! Where's my stone!","commenter_a":"So let's get this right. She's in the business of making money but she didn't want to accept money and now she's willing to spend money in order to avoid making money. She is logically 'out of business'.","post_message":""},{"comment_id":"585837851590068","commenter_b":"Unlike Hillary taking the china!","commenter_a":"No matter your political views, Mrs. Reagan always showed great class and dignity to the Whitehouse. The love for her husband was extraordinary. May you rest in peace.","post_message":"Nancy Reagan died this morning of congestive heart failure at the age of 94. She will be buried at the Ronald Reagan Presidential Library in Simi Valley, California, next to her husband. @webpagelink"},{"comment_id":"588768447914861","commenter_b":"Good night bitches","commenter_a":"Well if ur dumb enough to punch urself in the face then ur dumb enough to not know Trump is the MAN and Hillary needs to be hung for treason and letting our people die in Bengazi","post_message":"For those who missed: @webpagelink"},{"comment_id":"1764684433799515","commenter_b":"Class all the way !! Just think they want to make America great again !!","commenter_a":"Boring & hard to understand","post_message":"It was truly an honor to introduce my wife, Melania Trump last night. Her speech and demeanor were absolutely incredible. Very proud! #GOPConvention"},{"comment_id":"949119691868046","commenter_b":"@username You cant be this obtuse. It was a joke. Have you seen any of her material? What was disgusting was her response to a KID.","commenter_a":"She's famous, making a great living for herself and it is because of the fans. If she doesn't want attention or people taking pictures of her / with her then she should have chose a different profession. She should be humbled that someone likes her enough to stop her on the street for a picture, not post a picture ridiculing a fan on her instagram for thousands of people to see. Poor taste.","post_message":"Find out what made Amy Schumer put an end to fan pics."},{"comment_id":"952520861503939","commenter_b":"We need to send in a drone and level the place. I will be tainted now and need to be rebuilt anyway.","commenter_a":"Operation White Privilege hasn't had an accidental firearms discharge yet. That has to be some kind of record.","post_message":"Do you not want the government to 'Waco' you? Because this is how you get the government to 'Waco' you."},{"comment_id":"10153761021059749","commenter_b":"yep! so that they can have all to themselves the beautiful beaches built in Arabian countries by Europeans and practice their 72 virgins rapping galore practices eh?","commenter_a":"There is a simple way to stop ISIL. Kill them, kill their supporters, and don't stop killing until they are neutralized. Chivalrous rules of war are for opponents who will reciprocate. Virtue without reward is foolish. This is NOT a US problem. If the Muslim world objects to ISIL they have one, only one, way to show it. Kill them. That's what war is for. ISIL are winning because they have the guts and the passion (to borrow an Oriana Fallacci phrase) to stay in the fight. Their opponents lose because they are weaklings.","post_message":"\"The glories of Syria are now off-limits to Western visitors, reduced to rubble by Assad and Isil. Now Egypt may suffer a similar fate.\""}]
