[{"comment_id":"1168211463199863","commenter_b":"It's there. (Fuscia)","commenter_a":"I couldn't find New Zealand in there either. I suppose with a population of only 4.5 million...it's no wonder why.","post_message":"Where did Australia disappear to ..."},{"comment_id":"10155273231713132","commenter_b":"She has medicine that causes it, you hateful witch!","commenter_a":"Umm not a role model for my child, sorry. Good dancing though, kid seems happy","post_message":"You go girl!"},{"comment_id":"10152940333217061","commenter_b":"@username shes a hoe","commenter_a":"Hi Guys :) I'm Ashley :) 19 years <3 , I m Single and beautiful <3 girl <3 please like my page :) in 2 secs and i'll send you a friend request and inbox you <3 you will never regret, :( i promise you, please support me by just 1 like <3 1 Like (y) = 99 Help <3","post_message":"Police: Jake Lloyd, the actor known for his role as young Anakin Skywalker in 'Star Wars', arrested: @webpagelink"},{"comment_id":"695333573948652","commenter_b":"@username you are wants wrong with lawless America. So let me ask you for a honest answer if that's possible for you. Is she doing this because she cares about USA or just to be first woman president? Honestly now!!!","commenter_a":"You're still more concerned with his words than you are her actions. It's sad that laws only apply to people on the right and left for that matter but not her. You hilliary supporters should be ashamed. How do you sleep at night.","post_message":"This is horrific. We cannot allow this man to become president."},{"comment_id":"1616469018618909","commenter_b":"Trending: Obama's Fault Racism Gun Violence Marines holding umbrellas Climate change (that is simultaneously not real) ISIS Al Queda Hot days Cold days Rainy days The economy Abortion rate Teen pregnancy rate Hurricanes Tsunamis Butterflies that flap their wings and cause Tsunamis Terror attacks in Paris Russia attacking Ukraine North Korea hating everyone Syrian Refugees Illegal Immigration Muslims Christians hating Muslims Cops \"fearing for their lives\" #BlackLivesMatter Fox News hatred The wealthy 1% Everyone else Fantastic Four being a horrible movie _________ Fill in the blank.","commenter_a":"I don't see how you blame our first African American president for racists coming out of the wood work.","post_message":"Barack Obama is seen as one of America's most racially polarizing presidents, numerous polls show. So will tensions ease once his term ends? #RaceAndReality"},{"comment_id":"10152748736401051","commenter_b":"To bad. You live in this Country and better ahear to our Laws. If you do not want to do it \"go back out of the US.","commenter_a":"Sucks to be her.","post_message":"This woman is very offended by what police asked her to do. The police say they did nothing wrong. Decide for yourselves who is right."},{"comment_id":"10153123601201051","commenter_b":"Every one that supports this is freaking stupid put the bitch in jail than when she is ready to pop take the baby put the child in a good home than hang the bitch...","commenter_a":"The woman in this picture is not 7 weeks pregnant. It is also her choice to make not mine.","post_message":"This woman is planning on having an abortion - but she says she'll cancel it on one condition."}]
