[{"comment_id":"10152823422866636","commenter_b":"There are desperate people with no job because of (mental) illness. There are enough jobs, but a lot of people don't want them. So immigrants take them and the 'jobseekers\" can blame them.","commenter_a":"We don't ask them to come here and risk life and limb doing so. Why exactly should we have them or even want them.","post_message":"Britain does not stack up well in comparison with other EU member states..."},{"comment_id":"10153235771901167","commenter_b":"Pay close attention! And the Liberals love this guy? @webpagelink","commenter_a":"Exactly. Hate crime.","post_message":"Multiple Planned Parenthood clinics have been targeted in arson attacks since the release of highly edited videos trying to smear them. Why aren't you hearing about that on the news?"},{"comment_id":"10154178335409877","commenter_b":"Well said Jillian. I too believe that BLACKLIVESMATTER! It's not right, it is unacceptable !! We are al the same inside, under the skin of all people. There is only 1 race. The HUMAN RACE, period!! The more that speak out the louder we are!! And I believe this to can CHANGE!","commenter_a":"Enough is enough","post_message":"So, so tired. #TerenceCrutcher"},{"comment_id":"482616358589904","commenter_b":"You mean white again. Lol. Hillary 2016!","commenter_a":"I am voting for Donald J. Trump to make America great again #trump2016","post_message":"\"That's it, that's the end of America.\""},{"comment_id":"10153941419749614","commenter_b":"how is she an idiot, Frank? your original post does indeed come across as victim blaming. rapists don't discriminate. it doesn't matter if it's 9pm or 9am - if they wanna rape someone, they will do it. also, this girl was with her father so I'm sure she felt pretty safe to be out after dark.","commenter_a":"Why would they be at a Playground in Brooklyn around 9 p.m.???","post_message":"Update: Police say they have four of the five males in custody in connection with the incident. Original post: New York police are looking for five men who forced a father at gunpoint to leave his teen daughter behind so they could take turns raping her, authorities say. The 18-year-old was with her father at the Osborn Playground in Brooklyn around 9 p.m. Thursday when the brutal gang rape took place, according to NYPD. Authorities released this grainy surveillance video, taken in a bodega before the violent assault, that they say shows the suspected attackers. Police are asking for the public's assistance in identifying them. Read KTLA story here: @webpagelink"},{"comment_id":"10152475655222434","commenter_b":"This has never happened at a Steel Panther concert, little disappointed. I'm an actress and I've had people fall asleep in the front row... That was pretty funny. Also Erica, if the band were that bothered by it, they would have got security to remove them from the venue","commenter_a":"Matthew Naughton","post_message":"This woman is what the kids would call \"punk rock.\""},{"comment_id":"872561492840104","commenter_b":"Just STFU!!!!","commenter_a":"You know he's an imbecile when he says the president should b e like a rapist,drugger of the unsuspecting; Bill Cosby","post_message":"\"America's Mayor\" wades back into the fray."}]
