[{"comment_id":"644856102371635","commenter_b":"Well if they don't like America doing it they can take back across the border with them ( GO BACK TO MEXICO)","commenter_a":"Quit posting stupid shit like this!!! It's not news.","post_message":"A Hispanic student is banning whites from using this term... because it's racist? 'LIKE' if this is WRONG!!!"},{"comment_id":"10154250068154749","commenter_b":"How does she get away with this rubbish?????","commenter_a":"Diane Abbot is a hypocrite of the first order, always trying to play the race card if the argument does not go her way. As for JC he's a dead man walking yes massive grass roots support but his own back benchers are actively plotting against him and most are preying for bad election results so they can stage a coup. He's lost big backers, even the labour red tops are Luke warm at best. And grass roots support doesn't transfer to the ordinary man and woman on the street who see him as a reactionary 70s throwback and apologist. Labour will either ditch it before the next general election or face annihilation and ditch him and her after.","post_message":""},{"comment_id":"10156643152565354","commenter_b":"Looks like a bad week for the Hollywood elites. He and Jada can cry on each other's shoulders. Just goes to show you that living in a mansion in Beverly Hills, riding in chauffeured limos, traveling the world and having the best of everything, still doesn't make these people happy. Pitiful!","commenter_a":"Booob!!!","post_message":"BAHAHAHA!"},{"comment_id":"10154165765599091","commenter_b":"#DrainTheSwamp #PayToPlay #RiggedElections #VoteFraud #NastyHillary #MAGA #CrookedHillary #NeverHillary #HillaryForPrison2016 #LockHerUp #BuildTheWall #BringBackJobs #LatinosForTrump #NoMoreClintons #BenghaziButcher #DefeatSocialism #BanIslam #EmailGate #CorruptMedia #ObamacareFail @webpagelink","commenter_a":"Congratulations and God bless!!!","post_message":"CONGRATS! Five female firefighters have graduated from the New York City Fire Department (FDNY) academy -- the most women to join New York's Bravest since 1982!"},{"comment_id":"1168129036575432","commenter_b":"@username, I'm not voting for Hillary and if you want to call me a monkey you can meet me outside any military base and we can handle this.","commenter_a":"Hillary is an evil narcissist, a pathological liar, a Corporatist, Bilderberg member, the Whore of Wallstreet, Queen of Corruption, & Ultimate Establishment Candidate. The DNC shoved her down our throat & cheated. Her supporters are dumber than NeoCons. Trump being terrible is no excuse for anything she's done. She can go to Hell. We'd rather vote for Jill who has no chance than put our names behind either of the scumbags running.","post_message":"The differences between Hillary Clinton and Donald Trump on the real issues impacting the middle class and working families of this country are very clear."},{"comment_id":"623726524464132","commenter_b":"LOCK HER UP ---THROW AWAY THE KEY","commenter_a":"That kind of memory or lack thereof makes her a danger to herself and others.","post_message":"Tom Fitton is LIVE discussing Hillary Clinton's response to Judicial Watch questioning under oath and more in our Weekly Update. [for higher volume touch sound icon on screen or turn your speakers up ]"},{"comment_id":"953522348018789","commenter_b":"I demand that the offender's stop offending me. I'm tired of being offended. They get offended over Merry Christmas they get offended over In God We Trust, offended over the Ten Commandments... And the list goes on and on well if they don't like it move out of America.","commenter_a":"Why make something as general as a Cracker Barrel a racist issue? Stop creating trouble and problems needlessly! Enjoy this holy season and spread love and goodwill, not hate!","post_message":"Liberals are demanding that Cracker and Barrel change their name to this. We can let this happen. Let's show them our support. Can we get 30,000 'LIKES' to keep Cracker and Barrel the same?"}]
