[{"comment_id":"10153118377188812","commenter_b":"She is mitochondrial eve. Not some delusional religious eve. All women contain the mitochondrial DNA of the first woman. It is passed down through all women. It is also evidence female came before male. Looks at my nipples* what do these do?","commenter_a":"She's 5 million years old; She's a Humanoid-Skeleton! She's not Neanderthal, Cro-Mgnon, or Java, they named her Lucy, they were listening to Elton John's; Lucy in the sky w Diamonds when she was dug-up. She's not a Cave-Woman, just a 4'5\" Woman! She was dug-up in South Africa, I don't know what you thought but, Could This be EVE?","post_message":"Study finds 3-million-year-old ancestors were a lot more handy than some thought: abcn.ws/1CuHe7M"},{"comment_id":"1554605091501420","commenter_b":"Merry Christmas","commenter_a":"True Patriots True Americans for Donald Trump Keep the White House Hillary Free 2016 This Is Why I Support The Ban On Illegal Refuges/Muslims, Deport Illegals No Amnesty, No Tax Dollars Spent On Any Of Them Watch How FAST They Self Deport Themselves!!! Bernie Supporters That Are Feeling The Burn Should Jump On The Trump Train To Defeat Hillary Who Would Be The Worst President In US History!!! Next Stop Novembers General Elections Then On To The White House Were Donald J. Trump Will Be The President Of The Unites States Of America! Thanks To You And All His Supportes Across This Great Nation!","post_message":"You think we can coexist with these people!? They HATE our way of life! Let's get 5000 SHARES if you believe Muslims will NEVER Assimilate in America!"},{"comment_id":"1129680070463931","commenter_b":"I don't know where you get this clump of cells thing... maybe in the beginning... before a mother even knows she's pregnant, but by the time they would know that fetus reacts to pain and sounds (especially it's mother's voice)... fairly quickly it dreams... science has shown this... putting religion aside... before the end of the 1st trimester it is a living being and respirates like any other human (just gets its oxygen and nutrition differently). Much more than a lump of cells. At 18-22 week the child can be born and live a normal life 9 time s out of 10 even if the mother's life is in danger at this point there is no more dangers to birth over abortion. On top of that... healthy infants get adopted by people that want them...","commenter_a":"This has nothing whatsoever to do with humane treatment. It's another attempt at shaming the woman for making her own personal choice and finding a way to punish her. This is also another ill-fated attempt at giving a fetus, a few cells, personhood. A fetus nor a clump of cells can be made to be treated as a once living, breathing human being, nor should it be treated as such. As soon as these \"lawmakers\" can dictate that, it's a short road to personhood, to claiming murder and denying a woman a choice and having autonomy over her own body.","post_message":"About 35,000 public comments poured into the Texas Health and Human Services Commission about the rule change."},{"comment_id":"10152897950463445","commenter_b":"To steal God is an oxymoron! Obviously your ignorant! God is there for everyone. It says in scripture that God will call up people from every nation on earth. After the rapture and 1000 yrs of destruction The promise land will be restored in all it's glory. And it's ridiculous to say everyone is Muslim, there were religions that worshipped idols and had orgies as part of their religious beliefs. This is what angered God and he wiped out the wicked in the great flood.","commenter_a":"My God doesn't reward murder , or threaten that if a person doesn't repent according to the Koran they will be killed. My God wouldn't reward living a just and Godly life with going to heaven and having 72 virgins!!! God would never give a sexual gift as a reward. Muslims treat women like shit, just like a woman has no civil rights. In America we have the right to practice whatever religion we want and freedom of speech. If this country sucked so bad immigrants wouldn't risk their lives to get here.🔯 Shalom😇","post_message":"#Cannabis Legalization Goes Mainstream in Israel"},{"comment_id":"658534947621213","commenter_b":"@username stay home then","commenter_a":"The Trump camp says Cruz is stealing the delegates? A delegate cannot be stolen! They are professional adult people that make up their own mind! In other words, they are not controlled by anyone!","post_message":""},{"comment_id":"10153312471793606","commenter_b":"Enough Rioting In Baltimore Already It's Time To Cleanup The Damage Those Idiots Made And To Restore Peace Better Yet Make Those Monkeys Who Damaged Baltimore Cleanup Their Own Mess","commenter_a":"<iframe width=\"330\" height=\"180\" src=\"@webpagelink\" frameborder=\"0\" allowfullscreen><\/iframe>","post_message":"#BaltimoreRiots: We're monitoring social media right now, and some people are tweeting to get out and riot AGAIN. @webpagelink"},{"comment_id":"10153687019896800","commenter_b":"Maybe abortion opponents could just focus on those things that actually reduce abortions. The #1 cause of abortion is unplanned pregnancy. Universal coverage for birth control has done a great job of reducing abortions in other countries. Equal pay guarantees also work - mothers in this country experience a greater wage gap than childless women. Job protection is an issue here. Women in this country still experience job loss solely because of pregnancy. And, child support is a huge problem here. Civilized countries pay custodial parents child support, and THEN collect it from the non-custodial parent. Knowing that you can afford to feed, house, and clothe a child is a factor when deciding whether to continue a pregnancy.","commenter_a":"If these conservatives really wanted to prevent abortions -- they should be handing out birth control like it was candy. After all, if you prevent an unwanted pregnancy you automatically prevent the need for an abortion. But I guess that kind of logic is beyond the comprehension of most conservatives. Considering the conservatives are trying to restrict or elimiminate access to birth control as well -- I don't think this is about preventing abortions at all. It seems like it's about a group of morally uptight religious busybodies going around poking their noses into other people's private matters and wanting to have total control over those people's lives.","post_message":"Trevor encourages abortion opponents to extend their pro-life stance beyond fetuses."}]
