[{"comment_id":"10156066398495354","commenter_b":"Just can't handle the truth or face reality can you, imagine that, a black playing the race card, what a shocker!","commenter_a":"Ramos may be Hispanic, but he is also rude and disrespectful to the other reporters in the room.","post_message":"Or maybe... because they attacked him first?"},{"comment_id":"1109408939099898","commenter_b":"yaaaassss bitch yasss","commenter_a":"Angela Swartzel Melinda Bailey Mallory Brogli Chelsea Pande Roma Rispoli Kunia Rodrigues Carmel Rae Anne Mellies @username Jackie Smith fucking dyingggg😂😂😂","post_message":"That Voice Over! (Free The Monkey Though)"},{"comment_id":"555137491342104","commenter_b":"HELLARY ROTTEN CLINTON IS A SEXUAL PREDATOR AND A RAPIST CRY BABY","commenter_a":"We won fairly and stop saying it was the russians and trump. Stop filling your head with media lies","post_message":"WATCH LIVE: Members of the Electoral College in Texas gather at the statehouse in Austin to vote for the president and vice president of the United States. One Republican elector, Chris Suprun, has revealed his intention to vote for John Kasich instead of Donald J. Trump."},{"comment_id":"10154147763835329","commenter_b":"She wouldn't understand","commenter_a":"@username do it to Sydney","post_message":"how to know your sibling is on drugs"},{"comment_id":"10153338672643721","commenter_b":"I've had a lot of experience with it An am only giving my opinion based on my experience am not trying to upset anyone am just giving u my insight","commenter_a":"So how are these people getting LSD exactly?","post_message":"How LSD microdosing became the hot new business trip. (via Rolling Stone)"},{"comment_id":"10153932713210950","commenter_b":"@username that's my point. If she wanted to look like a pig she should have stayed on the farm lol","commenter_a":"It wasn't a few pounds, she got fat!! It was her job to maintain an appearance and she failed. If she didn't want to be judged for her appearance then don't enter a beauty pageant. Smh","post_message":"This former Miss Universe says Donald J. Trump's comments about her brought up bad memories from 20 years ago when she gained a few pounds after winning his beauty pageant."},{"comment_id":"511461792370480","commenter_b":"The bitch will do as she always does: LIE, and the Establishment will protect her and not have an indictment. It's sad the way this country would rather have a corrupt person with a rap sheet longer than her arm, get away with everything she and Willie have done. Anyone: Google \"Clinton Chronicles\".","commenter_a":"Moot point... Hillary will get crushed by the FBI.","post_message":"Donald Trump says he would crush Hillary Clinton in a general election. Do you think he's right?"}]
