[{"comment_id":"10153197324656491","commenter_b":"@username if you don't have weapons, then vermin thugs might get your food and water.","commenter_a":"I wonder if this is how walking dead started","post_message":"The researchers plan to “revive” the virus in a safe laboratory setting."},{"comment_id":"759027444232402","commenter_b":"Sounds like a hate crime to me. Where is Loretta Lynch","commenter_a":"Judson no one cares what you would do, you sound like a child","post_message":"Judson Phillips, founder of Tea Party Nation and a Ted Cruz supporter, said that he would have punched Donald J. Trump instead of endorsing him if he was in Dr. Ben Carson’s shoes."},{"comment_id":"1331908300162530","commenter_b":"This is disgusting, disgrace to America this never happen before, DJ.T is disgrace for our America, so dangerous wild animal.","commenter_a":"He is right! We unfortunately live amongst animals!!","post_message":"Trump said organized 'thugs' shut down his First Amendment rights in Chicago"},{"comment_id":"10154251674646636","commenter_b":"O don't back benefit sanctions , however if your gonna make a living out of claiming benefits do the job right , simple as","commenter_a":"He has a sighted carer (his brother) who opens all his mail and should have done it. Obviously they had never requested braille correspondence. So on that aspect I (for once) can't fault the DSS however to not reinstate the money after they appealed the decision is just ridiculous.","post_message":"Awful"},{"comment_id":"10152724701755927","commenter_b":"I don't know who he is, but I do not like him.","commenter_a":"And? Who cares what Chris Hayes thinks!","post_message":"Remember this from Chris Hayes?"},{"comment_id":"10153183452347490","commenter_b":"The photographer is a WOMAN!","commenter_a":"I have 3 perspectives on this photo: as a PO in charge of the flag, it is against flag etiquette. As a Navy retiree, we need more people to support our militaries and this photo he is a defender of our country and our families. As a photographer this has no words to express how beautifully this photo turned out.","post_message":"THOUSANDS RALLY AROUND PHOTO -- Navy vet and photographer says she's getting more support, and business, after her photo of a baby cradled in the flag made national news:"},{"comment_id":"10153177691300399","commenter_b":"Geller is a Bitch Witch.","commenter_a":"Not BS the 700 club news just aired and isis has 71 soldiers in 15 different US states! We do not negotiate with or back down from terrorists! Geller you GO GIRL!","post_message":"Wilmore thinks Geller is flat out crazy."}]
