[{"comment_id":"10152828660804071","commenter_b":"Yes.Yes. The hookers have also existed forever. Its seeing where and who they recruit. thats what would shock you. These women aint street walkers or trailer park meth queens..","commenter_a":"So true.. Except the hookers, not sure about that.","post_message":"Some of these are shocking."},{"comment_id":"1095090630555419","commenter_b":"Leave then lol i did","commenter_a":"Chicago is the worse place to live it's sad I fear for my child and don't want her outside because there's so many shootings each day","post_message":"WOMAN SHOT AT STOP LIGHT: A 24-year-old woman has been shot multiple times while at a stop light at 71st & Wentworth in the Englewood neighborhood. It happened just after 11 p.m. The car she was driving ended up coming to a stop in a grassy lot with its driver side window shot out. She is being treated at Christ Hospital in Oak Lawn where Diane Pathieu ABC7 joins us live with the latest."},{"comment_id":"987873944592566","commenter_b":"She willl burn in Hell","commenter_a":"you have that right @username,I wonder if she ever thought how she got here on earth??","post_message":"Pro-abortion Congresswoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb. baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"1211880145496741","commenter_b":"No to illegals.","commenter_a":"Mr. Gowdy, enlist some of your \"sleeping\" colleagues to assist!","post_message":"Thank you!"},{"comment_id":"1718149915138787","commenter_b":"Why don't they remove these 3 evil women?","commenter_a":"I wouldn't waste 1 minute watching this group! They all look like they are wearing Halloween masks!","post_message":"Come... ON... Joy Behar needs to be banned from TV!"},{"comment_id":"1129314157104004","commenter_b":"WAKE UP PEOPLE PLEASE","commenter_a":"I did hit like on purpose it was an accident.","post_message":"**Terrorist attack on US Soil! This just in!**"},{"comment_id":"737825183044101","commenter_b":"I would let a refugee stay in my house.","commenter_a":"I thought all of you on the left were going to let them move into your houses","post_message":"Several refugees have lost fingers and hands from walking in sub-zero temperatures."}]
