[{"comment_id":"10153774465069170","commenter_b":"She is Pure Evil.........","commenter_a":"Gosh, I am so sorry that this is a waste of her time by the way she looks in this picture. This woman really believes she's above the law and she really needs to be indicted on this and her email server!!","post_message":"Forget all the analysis of this like it's a boxing match. All that matters is the facts that have been revealed, and these 10 minutes are the most important you can possibly see."},{"comment_id":"675106442643073","commenter_b":"Well, you are just a stupid BITCH! What say you now?","commenter_a":"that would be you Warren and you're a loon.","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.” Read more here: @webpagelink"},{"comment_id":"521423368048243","commenter_b":"so she condones women being nothing... beaten, raped, stoned for no reason...be told what to do and when to do it.. she should live with them for a while without all her money... become nothing ... not human anymore...","commenter_a":"No she doesn't","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way. What a disgrace. She needs to deported to the Middle East. Do you think Nicole Kidman is a sell out?"},{"comment_id":"578481392330649","commenter_b":"THEY LOOK SO FOOL OF IT.....SSSSSSSSSSSSSSSSSSS","commenter_a":"Pot, meet Kettle...","post_message":"“One of the greatest frauds in modern electoral history is Donald J. Trump pretending to be an outsider.\" Tonight on “Hannity,” Ted Cruz said that Trump is part of the establishment because he funded liberal Democrats for years."},{"comment_id":"196351097508558","commenter_b":"Ginger ass snowflake whiny bitch","commenter_a":"You have the right to be a dumbass ya crybaby snowflakes","post_message":"While Republicans stick to zero solutions and plenty of petty insults, the rest of us are hard at work rescuing our democracy from dictator Trump. Video by Occupy Democrats. LIKE our page for more."},{"comment_id":"10154937079431729","commenter_b":"Those are some ugly women.","commenter_a":"Indeed, Colonel.....I was also having thoughts along the same lines like why aren't women engaged in sports with men like football, baseball, rugby, la crosse, hockey and, on and on.","post_message":"Folks, I need you to weigh in on this as well."}]
