[{"comment_id":"10153030925550927","commenter_b":"She'll starve.","commenter_a":"Go back to sex worker ... Your jokes are not funny ....","post_message":"Comedian Margaret Cho admits she was once a \"sex worker,\" says \"There's no shame in it. ...\" But she didn't stop there!"},{"comment_id":"444002905787317","commenter_b":"I wish someone would shoot that muslim nigger","commenter_a":"Unfortunately, the mass shootings will continue in the USA as long as the NRA continues to have such a strong influence, through its lobby, with the Republican Party in control of Congress. So many simple steps could be taken...background checks for instance or the banning of multiple-firing weapons ( one doesn't need a machine gun to kill Bambi! ) but the Republicans in Congress blocked even the discussion of background checks the last time it was brought up. With such intransigence in not even allowing discussion of the issue, I am afraid that no gun control law will be passed. President Obama is right to be furious as I am. As an American, I feel distressed, angry and frustrated but also, sadly, resigned. It is simply a matter of time until the next mass shooting. PS: Fewer than half of all Americans actually own a gun but those who do ...","post_message":"President Barack Obama is furious. Watch as he addresses the nation after another mass shooting. At least 10 were killed and 7 injured in a shooting at a community college in southwestern Oregon."},{"comment_id":"940190486114130","commenter_b":"What a fucking shitbag","commenter_a":"Bill Clinton was President and the Commander in Chief during part of my time in the National Guard. I had no respect for him as a man but had I ever encountered him I would have rendered proper military courtesy out of respect for the office of the President. When you put on the uniform you mo longer get to pick and choose.","post_message":"HA! She should've thought twice..."},{"comment_id":"10153924127869197","commenter_b":"My condolences to the family","commenter_a":"God bless her","post_message":"This 10-year-old girl died after she pushed two other children out of harm's way. Read more about the courageous rescue by Kiera Larsen --> @webpagelink"},{"comment_id":"512998138876699","commenter_b":"We certainly need to close our borders, so these warmongering murdering Isis people don't creep in, for that is what they plan to do. We need to do that immediately! The infiltration of this violence is not needed here.","commenter_a":"We need to stand united with the world on this issue of terrorism. We are not doing enough and hundreds of thousands have died already.","post_message":"To the people of France, we stand united with you and all of France is on our hearts and in our prayers. If history has taught us anything, it proves we must remain vigilant against such cowardly, terrorist attacks. America can lead, and we have the strength to do so, but currently lack the leadership. My hope is that our national leaders grasp why so many Americans, including myself, want the Border secured so that we not only deal with the issue of illegal immigration but we also ensure terrorists do not cross our border to do us harm. Never has the old adage been more true: The World is safer when America is Strong: Our People know it, Our Allies know it, and most importantly, Our Enemies know it."},{"comment_id":"10153878226241336","commenter_b":"Yes Dave this is true and sickening","commenter_a":"This is Islam: the religion which teaches that there is only one god, Allah, and that Muhammad is god's prophet, the religion of Muslims. The religious faith of Muslims includes belief in Allah as the only god, (deity) and in Muhammad his prophet. And if anyone does not believe in Allah, they must be killed as infidels (non-believers)! Their goal and ideology world wide since the inception of Islam in 700 AD is to convert the world to Islam or kill them as non- believers! Notice what's been happening worldwide the past eight years? The Quran is their teaching book ALL Muslims learn from and live by daily. It makes up 99% of who they are and how they live. Most do not assimilate, (change) they make others assimilate (when their population becomes large enough) they are instructed in the Quran to kill you by any means necessary if you ...","post_message":"“When the President stands up and says ‘the Islamic State isn’t Islamic,’ that’s just nutty. Even schoolchildren can figure that out.” – Sen. Ted Cruz MORE: @webpagelink"},{"comment_id":"10154584993799497","commenter_b":"Thanks pussy","commenter_a":"U fuckin cucks","post_message":"Here what you need to know about the alt-right:"}]
