[{"comment_id":"1258599470822378","commenter_b":"Trump contributed millions to liberals and their policies and now says he wants to fix the mess that he funded. No thanks.","commenter_a":"i have decided its safer with cruz, he has a record, trump is all talk, there is no certainty how he would be as president.","post_message":"I think Trump going after Cruz is quite normal; it's understandable. But I think he's making a tactical error the way he's doing it. Whatever you want to say, Cruz is not a \"nasty\" guy. When you get into criticism, it better be believable."},{"comment_id":"10154456212209060","commenter_b":"Have yall seen an uncircumcised vagina? Yikes","commenter_a":",,,,yea but have yall seen an uncircumcised penis???? Yikes","post_message":"If men can become astrophysicists or master carpenters, surely they can learn to wash? Campaigners are fighting the perception that the benefits of circumcision outweigh the risks"},{"comment_id":"1382411831811576","commenter_b":"No reason to make threats or warn the Racist idiots..........when they start a ruckus, we'll bury them!","commenter_a":"..and people like you want to start a race war. You can't win that one...","post_message":"@webpagelink"},{"comment_id":"10155501213150354","commenter_b":"New campaign slogan: A burrito in every pot and a hooker in every bed...Vote for Hillary","commenter_a":"Why not, Hillary has been a pro at f**king everybody.","post_message":"Bill Clinton hits the jackpot."},{"comment_id":"10154185430309062","commenter_b":"Why force a woman to ruin her body if she doesnt want to","commenter_a":"Conservative's be like \"I demand you to keep that baby\" nine months later \"I don't want my tax dollars paying for those babies\"","post_message":"NEW: Another hidden camera video taken at a Planned Parenthood facility was just posted online, and Governor Greg Abbott has already responded."},{"comment_id":"909912449057779","commenter_b":"She is a CRIMINAL LIAR !!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Poor, really, couldn't they spell abysmal?","post_message":"Well if the shoe fits..."},{"comment_id":"10153322688803132","commenter_b":"I hope she drops dead now in the pits of hell for what she did to this poor girl!","commenter_a":"How stupid can people get ???","post_message":"\"She's going to run till I tell her to stop. She's gonna learn ... I don't play with her.\""}]
