[{"comment_id":"907221015981906","commenter_b":"what woman would fantasize about being gang raped?","commenter_a":"And is that because that's his fantasy","post_message":"When Democratic presidential contender Bernie Sanders was 30-years-old, he wrote that women fantasize about being gang-raped. His office did not immediately respond to a request for comment from TheBlaze."},{"comment_id":"1509765899325906","commenter_b":"Shut up bitch","commenter_a":"As much as i hate to see President Obama leave office, I can't wait. I can't wait to point out to my Republican friends that noone has knocked on your door and taken your guns, he did not declare himself a dictator and refuse to leave office and my personal favorite example of media driven paranoia......were you chipped??","post_message":"\"What EXACTLY has Obama ruined in this country?!?!\" Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153090995473984","commenter_b":"They both need to be jailed or shot as the traitors they are!","commenter_a":"Dems must be psycho after all she has had to do with the deaths of Stevens etc she thinks SHE should run for POTUS! The audacity of entitiled politicians is RUDE!!","post_message":"She probably thought she had gotten away with it. Not so fast, Hillary... Should she face criminal charges for this?"},{"comment_id":"10153198316596336","commenter_b":"Wilma Loo...Who LOVES you Girlfriend ? ;-)","commenter_a":"Translation:We hid the money in offshore accounts in tax evading countries,wiped our servers clean,burned all copies and rewrote history.Nothing to see here,move along,move along.","post_message":"“We made mistakes.” The Clinton Foundation has issued a statement after improperly reporting some of its donations. @webpagelink"},{"comment_id":"526053707590689","commenter_b":"She needs to go back to the Chicago geto where she belongs!","commenter_a":"She is such a liar she acts socked but she has tapers in the White House","post_message":"\"I can't stop thinking about this. It has shaken to me to my core in a way that I couldn't have predicted,\" Michelle Obama said regarding Donald J. Trump bragging on a 2005 tape about his fame allowing him to \"do anything to women.”"},{"comment_id":"683458785174693","commenter_b":"No Whoopie it's the exact OPPOSITE!!!! We did our homework on Corrupt Lying Criminal Killary Clinton and her open border policies and that's exactly why we voted TRUMP!!! Dumbass Racist!","commenter_a":"You didn't do yours.","post_message":"Whoopi Goldberg just scolded millions of Americans on The View. Apparently if you voted for Trump, it's because you \"didn't do your homework\" on Hillary."},{"comment_id":"10156021598895354","commenter_b":"And she is a witch and should be hunted-certainly not a good witch-her broom needs to be parked","commenter_a":"To think Obama and Bill Clinton are playing golf tpgether. I guess they feel shes going to jail anyway.","post_message":"So wait, you're saying Obama's Justice Dept. is conducting a politically-motivated witch-hunt via the FBI??? #NiceTry #LiberalLogic"}]
