[{"comment_id":"1212661252101912","commenter_b":"Lmfao bitch","commenter_a":"@username and you can't even do 5 seconds LOL","post_message":"A policeman just planked for 8 hours and broke the Guinness World Record."},{"comment_id":"10153212099990927","commenter_b":"She and Whoopi are proof that there are people in this world that shouldn't be allowed to reproduce.","commenter_a":"She is so irrelevant.","post_message":"So if you don't ago along with Obama plans...you're racist? Only the 'View' Crew could come up with something so stupid."},{"comment_id":"10153132255848145","commenter_b":"Thank you Rachel Payne Nunlist! :)","commenter_a":"I'm sure I will get major flack for this, but the older kids were 10 & 8!!!! Why don't they OPEN THE STUPID DOOR??? I'm not saying the mom was right, the kids could have for sure been taken, but for heavens sake, 10 & 8 is still 10 & 8 when it comes to a hot locked car!!!","post_message":"When a passerby found three young children alone in a locked car, police were called. The children's mom was found a few minutes later in a tanning salon. Here's what happened: @webpagelink #wftv"},{"comment_id":"690460261111351","commenter_b":"spelling lady...... come on now.","commenter_a":"I think I will get off here and work. Better than listening to his lioes","post_message":"Watch LIVE as President Obama speaks at a town hall at Fort Lee. Do you know someone taking part in the event?"},{"comment_id":"1801737773446077","commenter_b":"Hell no stupid BITCH","commenter_a":"That's what this country is all about- Idiots supporting idiots!","post_message":"President Obama called Hillary Clinton the most qualified presidential candidate ever. Do you agree?"},{"comment_id":"10152739568405796","commenter_b":"Thanks for breaking the \"fear of being called a racist\" barrier Charles. My memory serves to tell me that most of these crimes are done by out of state blacks. National statistics back this up.","commenter_a":"Anyone noticing if it isn't locals its out of staters and 9/10 times they're black...","post_message":"A South Carolina man admitted Friday in U.S. District Court that he imported crack cocaine, powdered cocaine and heroin from out of state and distributed the drugs in the Bangor area."},{"comment_id":"10154537125069024","commenter_b":"Bunch of boobs.","commenter_a":" Congratulations America!!Finally...a leader!!!! @webpagelink","post_message":""}]
