[{"comment_id":"989149777896374","commenter_b":"Es ist wie . Die REICHEN WERDEN IMMER REICHER UND DIE ARMEN IMMER . Die Schere geht immer weiter auseinander.....und dann sind die Leute noch so naiv und w diese Typen, die keine Ahnung haben, vom wirklichen Leben. ....und Leute wie Bernie Sanders, l man fallen.","commenter_a":"Raising wages does absolutely nothing. If you raise minimum wage to the argued $15 an hour, you would have to raise everyone else's wages the same percentage. Now that it costs more to pay workers, manufacturers now have to increase retail prices to make up the difference. This achieves nothing and you're back to square one. You get paid more, but products cost more. 1 to 1 is the same ratio as 4 to 4. Paying more money for the same exact thing is the precise definition of inflation. This mind set is why recessions exist in the countries that follow this policy.","post_message":"The Walton family, the owners of Wal-Mart, is the wealthiest family in America. Middle class taxpayers should not have to pay billions more in taxes in order to subsidize the wealthiest family in America. That's absurd."},{"comment_id":"1715281765380661","commenter_b":"These adulta should be ashamed of themselves! Hoping whatever league they are in bans them from attending any more games!!!","commenter_a":"What a bunch of degenerate so called parents and adults. Useless to kids and society","post_message":"WATCH: Brawl breaks out between coaches at an under-10 baseball game. The stunned little kids don even know what to do. The video was provided to ABC News by a spectator. @webpagelink"},{"comment_id":"1370796892943097","commenter_b":"That was the sunniest, rainy Portland day with which I've ever been blessed","commenter_a":"How's Trump in his press secretary going to lie about this one? LOL","post_message":"Incredible images of the women's march protest happening all around the world."},{"comment_id":"1369207093090488","commenter_b":"The woman is pure evil","commenter_a":"It's time for women to shine, it's Been over due. I'm so proud a women is going to be the next President of the United States 2016 for the 20th century","post_message":"LIVE: Democratic Presidential nominee Hillary Clinton speaks at Democratic National Convention."},{"comment_id":"812245008908679","commenter_b":"You are one sick bitch.","commenter_a":"More whit and wisdom from Donald Dump the worst! Just like the KGB. People might begin to vanish if he doesn't like them.","post_message":"I would like you know what Trump supporters think about this. I find it very unsettling."},{"comment_id":"501283103409637","commenter_b":"I'll bet this ungrateful Liberal enjoys the freedom that our military & constitution provide her !!!","commenter_a":"The original blonde joke. No offense meant for conservative blondes or any blonde with good sense.","post_message":""},{"comment_id":"10154156141525470","commenter_b":"Just have her carry bacon with her if she's in one of those \"gun-free\" zones.","commenter_a":"Wow! How scary is that! Pray to keep this family safe.","post_message":"A St. Louis area woman who is reportedly on an ISIS hit-list said an FBI agent came to her home and told her to “arm up” because she is a potential target. A Special Agent with the FBI on Wednesday came to April Agers’ front door, knocked and delivered the startling news. Agers is on an ISIS hit-list."}]
