[{"comment_id":"10155004778474136","commenter_b":"This woman is a nut case.","commenter_a":"Skimmers...","post_message":"\"I think he is leading himself into that kind of position where folks are beginning to ask what are we going to do and the answer is going to be, eventually, we have to do something about him,\" Maxine Waters waters said of President Donald J. Trump. FULL STORY: @webpagelink"},{"comment_id":"1061695460512781","commenter_b":"Forget about the suicidal Muslims getting atomic bombs, let's get those guns WTF","commenter_a":"\"Sniper ammo\" is next...wait for it....","post_message":"We didn't say anything about gun control, but it is gun control. Everybody knows they want gun control, and if they can't get your gun, what better secondary way than to get you bullets? Anybody with a brain knows what's going on here."},{"comment_id":"10153144950646350","commenter_b":"Or because girls are just jealous that \"that ugly skank\" will have taylor for life now","commenter_a":"Why is everyone a hater! Give them your best and move on! I think they are a wonderful couple! Congratulations!","post_message":"Congratulations, Lady Gaga!"},{"comment_id":"477777845756672","commenter_b":"Bull Crap, Hillary.","commenter_a":"Please take a good look at Chicago !!!","post_message":"Hillary Clinton's answer to crime is always to just crack down on law-abiding gun owners - not law breakers. But the American public is seeing through her gun control lies for what they really are: meaningless rhetoric."},{"comment_id":"10154468706093869","commenter_b":"Maybe not, 45 may beat her to the prison. At least, those of us who are not bamboozled are hoping to see him in a federal prison.","commenter_a":"Dream on. Hillary will be convited and thrown in prison where she belongs.","post_message":"Today's daily cartoon by Tom Toro. Swipe through more cartoons with the New Yorker Today app: @webpagelink"},{"comment_id":"10153686445776336","commenter_b":"Any illegal here who has family Who is here legally, the LEGAL family should be hit with a fine/special additional tax to pay for their illegal family here!","commenter_a":"Deport illegals! And all the money that are spending for them should be given to our vets!! Trump is the one who cares about Americans!","post_message":"\"Right now — and you know it — we have illegal immigrants that are treated better, by far, than our veterans.\" – Donald J. Trump (via Fox Business)"},{"comment_id":"1287415054614429","commenter_b":"@username If SCOTUS is majority conservative, and I'm sure it will be, they won't overturn any of this because they don't care about the wellbeing of this country or its people.","commenter_a":"Wanna bet? First, women have been ending pregnancies for millenia and nothing the Kentucky Legislature can do about that. Second, with Roe V Wade the law of the land, any attempts to ban abortion will be overturned. Third, the so-called \"pro-lifers\" will not always be in total control of Kentucky and what this Legislature might pass can just as easily be thrown out.","post_message":"For the first time in 95 years, Republicans took total control over the Kentucky state government this week and immediately moved to strip rights from women and workers."}]
