[{"comment_id":"480221218832838","commenter_b":"Kevin, if you look at Christine's profile, I would say all of her ancestors were not white... And you just backed up what I said about the white man thinking they could own the land. I believe that baffled the Natives. How could you own Mother Earth?","commenter_a":"Jesus WAS!!!!! A LIBERAL, you right-wing nuts!!!","post_message":""},{"comment_id":"973671239335036","commenter_b":"She always has been a racist bitch. Where have you'all been?","commenter_a":"Get your head out of your ass and do something productive with your life.","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"744192892380562","commenter_b":"Jerome-- a mole? Are they all?","commenter_a":"Close the borders. With all due respect congressman, only idiots would even consider calling military age men \"refugees.\" Our borders have been poorly managed that it is impossible to tell who has infiltrated my America. Seems that Congress has chosen to remain totally mute on this issue. Obama bashing does not hide the fact that inaction equals compliance.","post_message":"It's frustrating that President Obama refuses to shift his strategy to defeat ISIS. The horrific attacks in Paris are evidence that the current strategy to defeat ISIS is not working. I discussed this earlier today on Fox Business' Varney & Co.. Watch below:"},{"comment_id":"10153918892062629","commenter_b":"Nah. We love Israel more than any state as far as funding goes. A Jewish president is more likely than an atheist.","commenter_a":"What the actual fuck?? \"Whites quit being racist long ago\"?? Surely this is satire and I've missed the humor. And it's not just about blacks. If we get a Jewish president, wait until the real pitchforks come out","post_message":"Whites, who are not racist, are ready to commit genocide if that is what it takes to stop black people from being racist."},{"comment_id":"1188696831170787","commenter_b":"Because they're redneck, uneducated, bible thumping, gun grabbing Trump supporters who own arsenals, and the desire to kill a living being just eats at them so they kill innocent animals. Because that's what republican Jesus would do!","commenter_a":"They must have been upset that their sisters wouldn't fuck them... #NationalTrailerPark #YallQaeda","post_message":"Gun violence also affects those who have no voice to speak against it."},{"comment_id":"10152894841766636","commenter_b":"So they should ! Sex with a drunken person should never happen !","commenter_a":"It's funny, you could have had drunken sex over there without fear of prosecution. But if that new law comes in over here in the UK? A guy potentially could be charged with rape even though it was consensual at the time?!","post_message":"RIP Shagaluf."},{"comment_id":"10153947557669753","commenter_b":"Police and your government bosses, STOP PREYING ON BLACK PEOPLE LIKE HUNTING WILD GAME AND SHOOTING US TO KILL!!!","commenter_a":"She is crying a hell of a lot more now that she is being interviewed than when sitting next to a dying man with her child in a car... Still say something fishy about the whole situation","post_message":"Police scanner recordings obtained by a local Minneapolis news station reveals that St. Anthony police officers pulled over Philando Castile not because of a busted tail light but because he looked similar to a robbery suspect due to his “wide nose.” The startling dispatch recording indicates that not only was Castile seemingly racially profiled for his “wide nose”, his girlfriend says that officers lied when they claimed the stop was for a tail light that was out as the tail light was seen... @webpagelink"}]
