[{"comment_id":"10153854800096955","commenter_b":"@username loooooooool u stupid Americans are cute. Have fun finding water in 5 years 😜","commenter_a":"You should have to have a comprehensive background check before anyone can just buy a knife and close the knife show loop hole . Problem solved !","post_message":"NYC Residents On Edge After 3 Slashing Attacks In Less Than 48 Hours..."},{"comment_id":"10153509244088854","commenter_b":"Go home!!","commenter_a":"Don't let the hit you in the behind when you leave","post_message":"Obama Claims He’d Be Treated Better In Europe, Whines About “Names I’m Called” In America..."},{"comment_id":"10153155208743010","commenter_b":"Ariel Sharon was the last Israeli leader who sincerely wanted peace with the Palestinians and strived for it despite the war hawks. Only thing the Jews want now is all of the Palestinians lands, without the Arabs of course. They are ethnic cleansing it as we speak. Sad that after the holocaust, modern Jews behave as the Nazis.","commenter_a":"Peace will only come with the return of CHRIST Jesus!'","post_message":"In this Q&A with Los Angeles Times World, former Israeli President Shimon Peres discusses the prospect of peace in his lifetime, plus other issues affecting Israel and the world:"},{"comment_id":"10153260544144614","commenter_b":"What a coward b*tch","commenter_a":"Wow, he smacked that kid like it was a game! He needs his adult status revoked.","post_message":"Disturbing surveillance video shows a young boy being slapped by a man and falling to the ground in a Bakersfield grocery store. Justin Whittington, 23, was taken into custody in connection with the incident after the video was posted on social media and went viral. He was being held on $1,000,000 bail. The boy was not seriously injured, authorities said. Read KTLA's story here: @webpagelink"},{"comment_id":"1004203859620086","commenter_b":"Awful woman !!!","commenter_a":"I don't want to see this face in my newsfeed.","post_message":"Leave it to Michele Bachmann to exploit a tragedy to take a swing at President Obama"},{"comment_id":"10152694140572452","commenter_b":"Joanna Funes wtf lol","commenter_a":"Ewww I mean it this for real? Nikki Deleon Lexi Richman Ashleigh Gray","post_message":"WHAT'S THAT SMELL? Burger King announced Wednesday that it will soon be selling a Whopper-scented perfume @webpagelink"},{"comment_id":"10153089785921491","commenter_b":"Ah , the range of a true lady.","commenter_a":"Love everything about her, even though I'm now aware of an intimate and amusing detail of which I had't really given much thought.","post_message":"Interviewers, beware: do not mess with Amy Schumer."}]
