[{"comment_id":"10152612107376636","commenter_b":"Women have to cover their hair in 2015 Ffs as if hair tempts men into sinning, give me a break.","commenter_a":"Not true! I am a Muslim woman and NEVER been pushed away from any mosque; whether it be in my home country Egypt or in Tunisia where I currently live with my husban. I am totally sick of the Independent and of all the bogus they keep spreading on Islam","post_message":"This is a problem that has been going on for decades, and little has been done to change it"},{"comment_id":"1004794989572137","commenter_b":"Bruno stfu you POG bitch","commenter_a":"Wtf is going on here? Don't you have pride and respect for the uniform you wear, for the veterans that fought many battles wearing that same uniform HOLY FUCK!","post_message":"The new Army drill and ceremony standard. #thanksobama ~Will"},{"comment_id":"1044157185605292","commenter_b":"Wikipedia that hoe","commenter_a":"Let's be real, we never went to the moon.. We did not have the technology to go through the Van Allen radiation belt. The astronauts would had been cooked alive.","post_message":""},{"comment_id":"10153720536124087","commenter_b":"@username I bet you're wife is a illegal ass immigrant. Get ready to never see her again once he wins","commenter_a":"Cool. Soon there will be no minorities left for trump to insult. He'll start insulting the lackof intelligence of his supporters.","post_message":"GOP front-runner Donald J. Trump recalls phoning his credit-card company to see if an Indian call center would answer."},{"comment_id":"10154440259724060","commenter_b":"Bitch i know everything","commenter_a":"@username stay humble","post_message":"Our quote of the day is from English poet Percy Bysshe Shelley"},{"comment_id":"10153625386991179","commenter_b":"@username. Thought you would like this!","commenter_a":"Tracy McElfresh Jesy Anderson","post_message":"Here's another one! Who is the genius behind these?"},{"comment_id":"1061821787247406","commenter_b":"fact, king obama ignored our federal immigration laws and gave amnesty to millions of illegal aliens including the illegal that killed Kate steinle. had he enforced our laws and put a stop to san Franciscos sanctuary city policies that woman would be ALIVE today. fact, obama blamed cops before the facts came in about doin their jobs. cops were killed after his comments. had king obama stood up for cops and denounced black violence those cops would be ALIVE! wake up Cynthia. who's to blame for this mess? every MORON that voted twice for king obama. 😡","commenter_a":"so when king obama blames police for doin their jobs and cops get killed it's not king Obama's fault? when king obama allowed illegal aliens to invade our communities and then kill innocent Americans like kate steinle it's not king Obama's fault? you leftest are MORONS and HYPOCRITES. 😄","post_message":"\"People have to understand that hateful rhetoric and words and harassment of doctors and harassment of women going to health centers have real implications.\" -Planned Parenthood President Cecile Richards"}]
