[{"comment_id":"10153166532823188","commenter_b":"Women voting for conservatives are the ultimate foolish morons...","commenter_a":"I am a conservative FIRST and there is NO other party to which I can relate...I pray for common sense and decency to prevail but I REFUSE to ALLOW a few bad apples to make me think there is no hope within this party!!","post_message":"It's too late to save it."},{"comment_id":"10153517803776157","commenter_b":"Hmmm,,, just a little chance of rain Victoria Marshall? Need some rain in San Benito!! :))","commenter_a":"Light","post_message":"Meteorologist Victoria Marshall CBS 4 News is tracking the heat and the chance for rain in your forecast below:"},{"comment_id":"10153505413366770","commenter_b":"She's an idiot","commenter_a":"Kelly girl get over yourself, now your show will be a flop.","post_message":"Kelly Ripa was dressed for a funeral."},{"comment_id":"10154194875640009","commenter_b":"This woman is a black retard, like the retarded black guy that was standing behind her when she spoke about the Kremlin invading KOREA. You let goofballs like this in a leadership position, you'll get a 3rd world country.","commenter_a":"the poor that is","post_message":"ICYMI"},{"comment_id":"10157370446315354","commenter_b":"Let a woman kill them.","commenter_a":"Bring see how many get wiped out America is not afraid of you cowards","post_message":"As the ISIS cancer grows, the threat comes closer and closer."},{"comment_id":"10153434645860329","commenter_b":"no, #4 killllllled me. so funny.","commenter_a":"Matt Megan Freeman @username Megan KellyThis is actually the funniest thing I've read in a while.","post_message":"LOL"},{"comment_id":"10150977696104999","commenter_b":"No, the representation in the Senate is not of the people, but of the states. Each state has two Senators. That's equal representation. If you want representation of the people, you're looking in the wrong chamber.","commenter_a":"It is a very good thing that urban power centres cannot set the taxes of their rural neighbours. If they could the rural producers would become slaves and would have no quality of life in the pursuit of urban consumers actively destroying rural methods of negotiation. This is NOT a failing of the system, it is exactly why the system is in place. It is a good thing that farmers are not economic slaves of nearby cities.","post_message":"In the U.S. Senate, the least populous states are now more overrepresented than ever before."}]
