[{"comment_id":"10152853063786748","commenter_b":"Know what, dude, if you and Obama went to a lunch counter in the deep south in the '50s, you would both stand an equal chance of getting abused and assaulted. And if the right wing scum you shill for ever get back in power, you'll find yourself right back in the 'separate but equal' category tout suite. :P","commenter_a":"right. cause Alan West is the epitome of \"blackness\"","post_message":"Right-wing pundits claim Obama isn't *really* a black American"},{"comment_id":"1136052583084752","commenter_b":"tainted bully!!","commenter_a":"hIS mOUTH RUNNETH OVAH!!! E","post_message":"Curt Schilling, an unemployed baseball commentator who moonlights as a volunteer political commentator on social media, has a hot take on President Obama: @webpagelink"},{"comment_id":"10153746801086336","commenter_b":"Sure abuser.","commenter_a":"Go to court when you are told to and this won't happen. Simple.","post_message":"\"I have a one-year-old son and I'm trying to take care of him by myself! I'm begging you, please!\" the woman cried to the judge before she was led away."},{"comment_id":"10152977510376130","commenter_b":"Shut up meg","commenter_a":"I know what the show is about!!","post_message":""},{"comment_id":"10155048968076037","commenter_b":"I would be behind him Mr. Knowing it all","commenter_a":"Wikileaks said the emails were a \"leak,\" not a hack. i would like to see some evidence of wrongdoing, before Obama starts WWIII on his way out the door. Why is he effecting ANY major policy changes so close to being out?!?","post_message":"The US will kick out 35 Russian intelligence operatives & shutter 2 Russian compounds."},{"comment_id":"10153369790181770","commenter_b":"SHES A WITCH!!!","commenter_a":"hillary is an idiot , how could anyone vote for someone so evil, she has to be stopped","post_message":"Clinton thinks everything is fantastic at the U.S.-Mexico border."},{"comment_id":"712618255553616","commenter_b":"They are giving your money to the illegals.","commenter_a":"Moral standpoint! My husband is on disability because of 2 strokes. He cannot even get a part time job because of his disability. I'm on social security and we both do not make enough to get us through the month. We worked for our social security. It is our money. I hope people who are in the same boat as us will stand up to this major jackass!","post_message":"Trump will slash anything, as long as it doesn't affect HIS wallet."}]
