[{"comment_id":"1299985666689108","commenter_b":"typical woman sexism","commenter_a":"Almost every man I know that gets the flu is a big baby about it and stays home to be pampered and relax, while women who get sick continue with their daily routine of kids and work and household duties, so, ppft. Women still get it worse!","post_message":"Turns out, cold ad flu viruses might actually be worse for men after all."},{"comment_id":"10155151069049575","commenter_b":"If she can't raise her kid right she should have not ever been pregnant","commenter_a":"Single moms struggling to pay bills and work where she has to work long days just get by on 8.00 dollars an hour with no time left for teenagers out of control who know everything, i vote with helping the mom , the hardest job on any day.","post_message":"Teen who was among five arrested in downtown fights Saturday night admits she needs help. 16-year-old describes it as, \"scariest night\" of her life."},{"comment_id":"10157375449970354","commenter_b":"Fuck off you little bitch!","commenter_a":"Its ok. Nobody was listening.","post_message":"Isn't that so thoughtful of Leftists who deride religion to lecture Christians on their faith?"},{"comment_id":"508999315933206","commenter_b":"Well done Doc! I too wish you had more airtime, but we that follow you know!","commenter_a":"You are my 2nd favorite candate running. Would be 1st if not for you shaking hands and smiling with Al, Sharpton! Al Sharton!!!' What good can he possibly do for you?!!!!","post_message":"A leader listens when the American people speak. Unfortunately, our stage was filled with plenty of rhetoric and shouting politicians. I want We the People to know I hear you. Although I didn’t have much time to share my common sense solutions with you on stage, I look forward to continuing my clear, concise vision with the American people as I did tonight. Even more, it’s clear that the people were listening – we gained over 100,000 friends and patriots on Facebook during the debate. I am humbled by our over 400,000 Twitter followers that made us the Most Mentioned candidate on Twitter during the debate. We the People are fighting for freedom, and tonight is proof that the American people are winning."},{"comment_id":"1214214798614861","commenter_b":"From Chris (Author of this article) he mentioned \"dangerous batteries\". Well what did you know the whole world is putting blames on a company instead of the provider. Talented consumers indeed. Personally the problem probably lies with the performance output and the batteries supplying the phone. Note 7 is a heavy powerhorse so... overexerting the battery could damage it.","commenter_a":"This is worst than the BlackBerry disaster.","post_message":"BREAKING: Samsung ends production of the Galaxy Note 7."},{"comment_id":"1203579539653054","commenter_b":"I'll be sure to let them know you said that Ralf, I'm sure they'll be devastated,.?!","commenter_a":"More bs from HRC,.. H and her half-truths... Number of oil, gas and coal industry lobbyists that have made direct contributions to Hillary Clinton 2016 presidential campaign: 57 57 registered oil, coal and gas lobbyists have personally given $126,200 to the Hillary campaign Of those 57, 11 are bundlers. 11 lobbyists have bundled $1,140,930 in contributions to the Hillary campaign 43 lobbyists have contributed the maximum allowed ($2700). Source : @webpagelink","post_message":"Hillary Clinton showed a flash of anger when confronted by a climate activist: \"I'm so sick of the (Bernie Sanders) campaign lying about me.\" @webpagelink"},{"comment_id":"10153505844154714","commenter_b":"But THEY can't have their own..male with male doesn't make babies","commenter_a":"You made a typo. You said \"her family\". You mean Bruce spent the day with his family.","post_message":"It was Caitlyn Jenner's first Father's Day as an out trans woman."}]
