[{"comment_id":"1533566413336617","commenter_b":"YES !","commenter_a":"Yes","post_message":"Michelle Bachmann says Trump's win is positive of what the Lord did. Do you think God had a hand in Trump winning?"},{"comment_id":"789366324587278","commenter_b":"Jesus, doesn't anyone see a pattern here & this dirty insane hobag. I wouldn't vote for her if u paid me. She's evil..I pray Trump wins and try her and Ovomit for TREASON and HANG their sorry asses!!!","commenter_a":"And before everyone gets Butt hurt over this one lets just reminisce some history about the Clinton's... And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock Rose Law firm. Died of a gunshot wound to the head, ruleda suicide. 4 Ron Brown Secretary of Commerce and former DNC ...","post_message":"Clinton Mistress Reveals Herself, Drops Major Bombshell Right On Top Of Hillary This will completely derail her campaign. Do you think the last thing America needs right now is another Clinton?"},{"comment_id":"10152923328206051","commenter_b":"Screw you bitch.","commenter_a":"It don't count it was just a dog.","post_message":"This guy knew his injured neighbor couldn’t take her dog out for a walk, so he offered to. While the two were out, he killed it with an ax. Guess how much jail time he got. Wrong. Less."},{"comment_id":"444684015719892","commenter_b":"killing over a pizza.. one less tax payer.. those black thugs aren't too worried about their welfare checks these days","commenter_a":"They need to be stabbed to see how it feels than shoot","post_message":"Where are the rioters?"},{"comment_id":"1370415506308495","commenter_b":"I believe you have that backward.","commenter_a":"They are Demon-crats. Get it right you dirty rat!","post_message":"An activist joins thousands of Bernie Sanders supporters who are demonstrating ahead of the Democratic National Convention in Philadelphia."},{"comment_id":"736524969871414","commenter_b":"True she needs to sit down some where and just grow old. If they don't put her in jail.","commenter_a":"I had been wondering about Hillary and her health. I was just thinking today what if Hillary should get sick if she's in office. Woman have a tendency to become ill as we get older. Has had her menopausal years. Hell because when I get sick I don't want to be bothered by nobody. I don't think Hillary would able to handle this president stuff. Not that we don't want her to be president I really don't think she would make it. Stress on a woman is not good. It triggers other types of sicknesses. I know about that stress. I had to quit a job because of stress. I was so damn stressed out I came down with hyperthyroidism that made me lose 94 lbs in one month. Due to stress. My doctor made me quit my job or die. And I had been wondering about Hillary Clinton. She's ...","post_message":"BREAKING: Hillary Clinton's Health In Jeopardy... Campaign Could Be Over Either way she was never fit to be president. She should retire early. Can we get 30,000 'LIKES' to have Hillary drop out of the race?"},{"comment_id":"904790836280638","commenter_b":"Absolutely","commenter_a":"Obama care","post_message":"What's fair is fair! Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"}]
