[{"comment_id":"788216704618375","commenter_b":"Sure he is Jewish but how could a man of his intellect believe the cartoon that created this shithole country?","commenter_a":"Put on your yarmulka even though it's not Chanukah....welcome to Israel.","post_message":"Welcome to Israel, Jerry Seinfeld ðŸ˜ðŸ˜ðŸ˜"},{"comment_id":"1143931678960194","commenter_b":"Say Ms white woman...dismissed!","commenter_a":"Idiot!!!! Every race suffers racism!! And all lives matters. Not just blacks. An American is an American! I'm not a Caucasian American! They shouldn't say African Americans either. Get with this century!","post_message":"Clinton: \"We need to acknowledge some hard truths about race and justice in this country, and one of those hard truths is that that racial inequality is not merely a symptom of economic inequality. Black people across America still experience racism every day.\""},{"comment_id":"855360527843909","commenter_b":"Really clueless woman","commenter_a":"Shes not relevant!","post_message":"How's this for abortion logic?"},{"comment_id":"1017537058301696","commenter_b":"Black men are so screwed up, they are concerned about equal pay for women, pro-choice, illegal immigrants, grass, ducks and horses! Anything that has nothing to do with black men, a black man is concerned about. You idiots are going to be sorry, when all the immigrants are employed and NONE of you English-only speaking Negroes gets nothing. #BlackMen4Trump2016","commenter_a":"Maybe it was sarcasm. Idk... I need more rum...","post_message":"Wondering why Nation of Islam leader Louis Farrakhan said this about Donald Trump? ---> @webpagelink"},{"comment_id":"1201354526579759","commenter_b":"Can't turn a hoe into a housewife should of known that!!! Smh Anyway in other news?","commenter_a":"When the goin gets tough the fake show true colors","post_message":"\"She's felt trapped for a while... She doesn't want to stay married.\""},{"comment_id":"10153720554479330","commenter_b":"Exactly Kathy!! Lets duct tape her mouth shut!!!","commenter_a":"Good!! Can we duct tape her mouth!?!? I don't care that she made a post after this one saying that she was trying to make a point and that the dog stopped barking, no excuses and the dog was probably scared that the human he trusted would do this again!! She needs to be held accountable for this!!","post_message":"UPDATE: Police in Florida plan to speak with the person behind this viral Facebook post. So many calls reporting it as animal abuse have flooded into police departments from Connecticut to Florida that they've had to call in extra workers. --> @webpagelink"},{"comment_id":"780568308754036","commenter_b":"She is a pig!","commenter_a":"Loved it you will not see another first lady as classy and beautiful as Michelle Obama for a while. She is gorgeous!","post_message":"What did you think of the First Lady's sunny State of the Union dress?"}]
