[{"comment_id":"718386484926627","commenter_b":"But as soon as they hit 18, they're prostitutes? Crazy how one second can change the definition... #ijs","commenter_a":"Please don't call under age girls child prostitutes. They are victims of being sold to sex traffickers, or kidnapped. They are victims, not prostitutes.","post_message":"It wasn't all fun and games on Super Sunday."},{"comment_id":"10153182751728145","commenter_b":"Can the a/c compressor fit in my car? My A/C isn't working, I'll take the air over a flag! lol lol","commenter_a":"Give it a rest already","post_message":"Say goodbye to General Lee. Now toy versions of the iconic orange Dodge Charger will end production. Here's why: @webpagelink What do you think about this move? #WFTV"},{"comment_id":"10154682808296037","commenter_b":"@username. We don't need male genitalia to be smarter than you. Go run along and play, now.","commenter_a":"In his hand against his thigh. Plain as day. Please save and share for the ignorant.","post_message":"Charlotte police release body camera and dashboard videos of fatal shooting of Keith Lamont Scott."},{"comment_id":"928293913874616","commenter_b":"Brain dead liberals.Why would you want to force someone to marry you?","commenter_a":"What makes anyone think that someone would want the clergy in your faith to perform their ceremony if they did not believe in it. Two people in love that want to get married would never choose someone to marry them that was not accepting of them. There are many other clergy accepting out there. Not all WANT religious rites. Civil ceremonies performed are the legal ones that count. Not one person (straight or gay) can get married in the church without that civil license first. People are getting totally out of hand on this. The church is going to do what they want anyway. What really counts is marriage is legal for all.","post_message":"Wow."},{"comment_id":"10153566353686323","commenter_b":"Paul, I live in Heidelberg Germany. The Americans have left, and the army barracks have been filled with refugees. The plan was for 1200, but we have 1900. This summer, I drove to the UK. The British press reported trouble and riots in Calais and Dover - we sailed through, in both directions. Germany has taken 8x the number of refugees than Britain. And, incidently, I find that if I post here, I often receive an extremely rude and aggressive reply from someone in the UK. I find the British to be quite aggressive, probably frustration with the pro military, right wing, Banker Government, for whom they voted. (Preparing for a tirade of abuse here :) )","commenter_a":"Considering that the surge in recent immigration to EU is mainly due to military and political actions initiated and undeertaken by UK, US and France the hospitality displayed by Germany is more than commandable ... And the British attempts to refuse responsobility for the Lybian and middle eastern mess is plain shameful ...","post_message":"In July, Germany received 37,531 asylum applications, that is 5,586 more applications than the UK had in the whole of 2014."},{"comment_id":"10154388349554657","commenter_b":"Put the witch on a stick and burn her.","commenter_a":"Should be incarserating her.","post_message":"It is the political story that just won’t go away for Hillary Rodham Clinton:"},{"comment_id":"10152797115634117","commenter_b":"Matthew, most of you gun totters don't have the balls to pull the trigger. But if you need a gun to make you feel like a man, knock yourself out. Guns are there for men who's wives wont let them have a penis truck. Have a nice day.","commenter_a":"And the evil liberal Democrats want to take our guns away because the police are here to protect you.","post_message":"U.S. marshal's effort to censor a citizen's recording was foiled by yet another citizen recording in this small town that collects millions in asset forfeiture revenue."}]
