[{"comment_id":"10153877840551337","commenter_b":"I always hated rousey I'm glad her ass got knock the fuck out","commenter_a":"Truth is holly Holm is a real fighter n Dana white thought he picked another easy girl for Ronda to destroy well plan back fired ,Holm is a real fighter and real champion now let's see her n cyborg fight two top fighters Rousey is finished","post_message":"DAMN: Holly Holm didn't hold back with these comments about Ronda Rousey."},{"comment_id":"10152875626591051","commenter_b":"Yep.. she should have her vehicle towed for parking in the handicap spot. That will give her an attitude adjustment real quick!","commenter_a":"The American Disability Act will allow the police to fine this nasty man. I'd call the police. Let them handle him.","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"539787562878490","commenter_b":"Send Them back to their sand pile home, get them out of this country!","commenter_a":"Why were they even there watching if they didn't like it","post_message":"Furious Muslim students rush stage during American Sniper showing. They have no respect. If they don't like American Sniper they can leave. Do you agree these Muslims are out of line?"},{"comment_id":"1187051574713979","commenter_b":"She don't care why try and make her lower her standards. Melania is a very classy lady and you want her to lower herself and dress down.","commenter_a":"I'm sure she can find another dresser! No big deal!","post_message":"Michelle Obama's favorite designer, a woman who dressed the First Lady for 8 years in a row, just refused to dress Melania Trump. The reason? She isn't tolerant of her despite asking everyone else to be tolerant of her. The self-professed liberal meant to snub the new First Lady -- but she never saw this coming."},{"comment_id":"10153361923310796","commenter_b":"Google it or California DMV website. Wake up.","commenter_a":"With over 50% of new California Driver's Licenses issued to illegals will anyone challenge voter fraud in Mexifornia?","post_message":"Republican presidential front-runner Donald Trump blasted Mitt Romney in Maine on Thursday after the party’s 2012 nominee criticized him, saying Romney would have “dropped to his knees” for his endorsement four years ago."},{"comment_id":"236858020109682","commenter_b":"Get the lady off the pic","commenter_a":"He got in there by something called \"voting\". Just saying","post_message":"LIVE VIDEO: 'Not My Presidents Day' anti-Donald J. Trump protests are happening across the country. WARNING: Viewer discretion is advised"},{"comment_id":"922742544437395","commenter_b":"It's not so much stupid and idiocy as it is vicious.","commenter_a":"Mississippi. Period. Point Blank. (sorry to paint with such a broad brush, but.............)","post_message":"This racist needs to be fired now. Sign the petition to have him removed from office: @webpagelink"}]
