[{"comment_id":"10154383392767894","commenter_b":"These two witches are beholding to special interests!!! Drain the swamp!!!!","commenter_a":"did not help ...","post_message":"These two Republican senators voted against Betsy DeVos."},{"comment_id":"1281672095204357","commenter_b":"Yep, in with the younger roaring lion, out with the old senile evil slimy snake.","commenter_a":"I hope he can get Congress to kick them out of NYC. That building would make a remarkable place to house and care for our vets and homeless. That would save us so much money. The UN is not needed for us. No one I know wants to belong to a One World Order and governance. Let them move somewhere in Europe and take Soros with them.","post_message":"This is going to be good..."},{"comment_id":"10154336325219062","commenter_b":"Bradley Darrell see above message..","commenter_a":"To suggest the Pope has a liberal agenda is just showing ignorance. Conservatives claiming the Pope is pro-gay, pro-abortion, anti-marriage, blah,blah. The Pope has never said he agrees with those things, he has said it's not his place to judge others who have that life style. Just like Jesus would do today. He loves everyone without reservation. Something sorely lacking in today's society.","post_message":"Pope Francis says addressing climate change `can no longer be left to a future generation'"},{"comment_id":"10153002802946051","commenter_b":"Why do these girls think they can just come and do as they please and disturb ppl....that's good he wacked her off the desk...pinche mocosa pendeja","commenter_a":"Seriously? These kids might as well start applying at the dam circus","post_message":"This student was just sitting there, not taking part in any of the craziness, when one of the dancing girls decided to step forward. It didn't end well."},{"comment_id":"10154201803933869","commenter_b":"44?","commenter_a":"In fairness, what President hasn't had to pay $25 million to make a massive class action fraud lawsuit go away before assuming office?","post_message":"The election of Donald J. Trump to the Presidency is nothing less than a tragedy for the American republic, David Remnick writes."},{"comment_id":"10154278742015329","commenter_b":"Thats that lingo dang old times lol","commenter_a":"Diego X Flores Pringle","post_message":"Single and ready for a PRINGLE."},{"comment_id":"10153602966152217","commenter_b":"@username what a silly girl.","commenter_a":"Because corruption in Nigeria is a way of life practised at all levels of society and to suggest a correlation between corruption in Nigeria and in Westminster is fatuous and ridiculous, that's why.","post_message":"Why is David Cameron \"lecturing\" Nigeria and Afghanistan on corruption when Tory MPs are being investigated for potential electoral fraud? That's the question raised by the Scottish National Party's Angus Robertson. @webpagelink #PMQs"}]
