[{"comment_id":"10154114920114726","commenter_b":"She is an assault magnet!!","commenter_a":"What do Leonardo DiCaprio Congressman Allen West, the NYPD and Students for liberty all have in common? They all had assault charges filed by Michelle Fields......who is Michelle Fields>? The Woman who is claiming she was assaulted by Mr Trump's Campaign manger. Check her background.","post_message":"Even liberal Susan Sarandon thinks Trump is better than Clinton."},{"comment_id":"10154501246119255","commenter_b":"NUTS","commenter_a":"moron","post_message":"What a stooge. By Daily Kos user teacherken"},{"comment_id":"935532149828645","commenter_b":"No refugees immigtants.We're your great great.oh Grandparents Irish immigrant ?","commenter_a":"NO REFUGEES, NONE ! We Americans do not need more problems in our country. Stop them, am I CLEAR ?","post_message":"Our nation has always been welcoming, but we can’t let terrorists take advantage of our compassion. We should not bring Syrian refugees into this country unless we can be 100 percent confident that they are not here to do us harm."},{"comment_id":"788216704618375","commenter_b":"Sure he is Jewish but how could a man of his intellect believe the cartoon that created this shithole country?","commenter_a":"Put on your yarmulka even though it's not Chanukah....welcome to Israel.","post_message":"Welcome to Israel, Jerry Seinfeld 😍😍😍"},{"comment_id":"10154485360681323","commenter_b":"She won the election. Period.","commenter_a":"I congratulate Brazil for their courage and determination. The Latin-American left likes to keep the people they rule poor, uneducated and frightened. They like to pretend to be the saviors. But the truth is they always leave a country poorer, they become richer, and as in the case of Nicaragua, Cuba, Venezuela, and Bolivia, they do not leave, ever.","post_message":"In keeping with her pledge to fight until the end for the 54 million voters who put her in office, Rousseff – a former Marxist guerrilla – ended her presidency this week with a gritty 14-hour defence of her government’s achievements and a sharply worded attack on the “usurpers” and “coup-mongers” who ejected her from power without an election."},{"comment_id":"1703000273311505","commenter_b":"If they want want to demand, tell them to go home!","commenter_a":"First of all, you can buy any kind of food you choose on food stamps ( I work in a grocery store, if you could see what people buy with food stamps ) , secondly you can't DEMAND anything. If you have demands, demand it from your own country.","post_message":"Muslims On Welfare Benefits Make RIDICULOUS Demand About Food Stamps If you want special treatment, then go get a job. Do you agree beggars can't be choosers?"},{"comment_id":"1311876355490031","commenter_b":"These people should be locked up in cages. We have to be a voice for these poor animals. Set them Free!","commenter_a":"China don't care about shit","post_message":"Tourists take selfies with him"}]
