[{"comment_id":"10153585908813984","commenter_b":"See it turning into a Muslim state.lets wipe out all history.","commenter_a":"This is the stupidest bluff I have ever heard! Deny the NAACP and all they can do is hurt themselves. What's next? B.E.T. threatening to go off the air?","post_message":"The NAACP just made a stunning demand about this historical monument... this is shocking move. Nobody thought they would go this far... What do you think about the NAACP's demand?"},{"comment_id":"1870076373211219","commenter_b":"My first thought was to wonder where the women are.","commenter_a":"One small detail though. Local women are not even allowed to even try to approach the beach without their burkas and totally covered. OUTRAGEOUSLY INHUMANE TREATMENT OF WOMAN.","post_message":"Put us on the next plane to Dubai."},{"comment_id":"10154249016409170","commenter_b":"She's a soft spoken HACK!","commenter_a":"Bam, i love the dems motto, vote early and often. How is this right. Another star for NC. Good job","post_message":"Usually Democrats can play the race card with no consequences. Not this time."},{"comment_id":"10152702993831636","commenter_b":"would rather pay for a second hand BMW than be involved in a spit roast with her","commenter_a":"sex united fc Siddhant Behera Sanket Mohanty","post_message":"Manchester United have found themselves at the centre of another sex story..."},{"comment_id":"1059948200694894","commenter_b":"She isn't a women, if she was slick Willie would deny ever having sex with her","commenter_a":"Unlike him, she should be under federal indictment and disallowed from running for any office at all.","post_message":"It's getting downright catty between Hillary Clinton and Donald Trump."},{"comment_id":"10154141343121336","commenter_b":"Trump won every state TONIGHT and barely lost Ohio.. why is it even still a question of who WE THE PEOPLE want and NEED to get behind?? Wake up! #NoHillary","commenter_a":"Trump is a buffoon. Hillary will bury him in a landslide. We must nominate a person who could win in November...a ticket like Kasich/Rubio, Kasich/Cruz, or Kasich/Fiorina.","post_message":"“Here’s our vision for America: It’s an America with a brighter future. It’s an America with greater opportunity for our kids… It’s an American with more liberty and more safety and more security. It is America that is greater tomorrow than it is today and than it was yesterday.” – Ted Cruz"},{"comment_id":"1263029653753561","commenter_b":"This wasn't even a debate, it was #RealityTV. But yeah, Clinton couldn't have lost because #herOpponent has a #MentalDisability. Trump supporters are right, it's unfair to him to expect him to be competent. Donald show us your crooked tax returns #WordsMatter. Do you want the most powerful person on Earth to have the mouth, the character, the words of Donald Trump?? There is no argument for Trump. #ItsAVoteForHillaryAndHerAgenda #StrongerTogether #Progress #AFutureToBelieveIn #LoveTrumpsHate #LatinosArentRapists #WomenArentMissHouseKeeping #UnitedAgainstRacism #YesWeCan #DontBooVote #WhenYouGoDownWeGoHigh #LatinosArentPigs #ClimateChangeIsntAHoax #MissUniverse1996IsntMissPigy","commenter_a":"Its pretty simple boycott all these biased media outlets. Let their billionaires spend their money keeping it afloat. They don't help their own countrymen. But, sure want to take down America. Sorry, you are a idiot if you can't see this. Sad, but true Hillary is their puppet a long with Bush. The problem is the people are waking up. I can only say arm yourselves. These outlets and their mindless bots working for them are going to still put out the same trash everyday. You take down Law enforcement, then Military divide the people and conquer Keep being idiots.You will be telling of the America I love as \"Once upon a time\" You know those pastuers are always greener till your there. Don't you bots find it interesting Hillary is pulling a large number of Jewish vote and Muslim. WTH do you think she has promised each side to ...","post_message":"Trump's tax plan: 1. Huge tax cuts for billionaires and millionaires like him. 2. A tax hike for millions of middle-class families."}]
