[{"comment_id":"10150607537004999","commenter_b":"Each act of terrorism has its own agenda. Define the act.","commenter_a":"A hate crime is an act against someone or a group of people based on their gender, race, sexual orientation or religion. Terrorism is an attack in which the victims are not relevant to the agenda. Terrorism is a statement normally made towards a government, a hate crime is a statement towards the victim, it's personal. For me I think a hate crime is more horrific, to hunt and kill someone for being who they are. Terrorism is more of an act of a coward, a hail marry pass.","post_message":"\"Why can’t we own up to the fact that hate crimes are just another form of terrorism, perhaps the worst, since they target the weak among us?\" Read on in The New York Times Opinion."},{"comment_id":"10156506667295354","commenter_b":"MUCK FUSLIMS","commenter_a":"They hate what it stands for Freedom, and they want to take it over, take away all freedom and replace it with Sharia. They will by population growth win this battle and eliminate all non muslim men, women, and your children if you allow them to settle in our Country.","post_message":"\"The hatred of infidels is a religious imperative in Islam. No matter how fast we dance, appease, pay, accommodate, and submit, the hatred and holy war will not cease. On the contrary, the more we submit and reward the hatred and terror, the more we will have to surrender.\""},{"comment_id":"10153768028339614","commenter_b":"Lol Olivia you sound butthurt or does truth hurt as Ben Carson state all black lives matter not just criminals","commenter_a":"Where's the black lives matter people at? Or is only white on black that matters","post_message":"An anti-violence advocate is now paralyzed after being shot in the back during an attempted robbery, and the teenager arrested was supposed to attend one of his speeches on reducing juvenile crime rates. The Cal Poly Pomona student turned his life around after a criminal history beginning at the age of 12 and facing abuse in foster care. But while in Georgia to share his message of peace, Semaj Clark was shot. won be able to walk anymore, and that hurts me, but it not going to stop be from doing what I got to do, he said tearfully from his hospital bed in Georgia, where he continues to recover. Watch KTLA video here: @webpagelink"},{"comment_id":"10154449540370586","commenter_b":"That's bull learn something we do think for ourselves besides the president of the church knows she is evil educate yourself instead of spreading lies. Most Mormons are voting Trump or another candidate","commenter_a":"Most of the truly faithful Mormons will just vote for whoever church leaders tell them to, just like good little sheep... Both candidates should be in private talks with the church","post_message":"Democratic nominee Hillary Clinton’s campaign has launched “Mormons for Hillary” in an effort to woo people in red-state Utah to vote for her. Is it working?"},{"comment_id":"10155111433599614","commenter_b":"@username in Oregon not her she stinks hahah","commenter_a":"Jessica @username Davenport what an idiot lol","post_message":"The woman said she tried to get her pet ball python -- \"Bart\" -- out using cooking oil, but that didn't work. She went to the hospital, where her ear was numbed and stretched even more, freeing Bart. \"He acted like nothing even happened and was totally chill,\" she said."},{"comment_id":"10152904243581636","commenter_b":"If she wanted to kill herself she would have hope she frys!","commenter_a":"Those poor babies. This poor woman. I can't say I understand killing her babies, but she is very obviously severely depressed. I only wish she had gotten the medical attention she so clearly needs before she took such drastic measures.","post_message":"Officials say a Connecticut mother who allegedly murdered her two children left a suicide note next to the children bodies, explaining why she killed them."},{"comment_id":"10153179690136523","commenter_b":"So that one example involving you makes you come to the idea that lots of females lie..? And the proper way to handle that situation would be to go to the authorities and let them deal with it.","commenter_a":"Lots of girls lie about that stuff it happened to one of me old friends the bitch said he raped her be he really didn't there's lots of girls out there that's are like that","post_message":"19-year-old Owen Labrie, a former student at the elite St. Paul's School, appeared shaken as the verdict was read, at one point nodding his head and reaching for a tissue to wipe tears. At the time of the assault, the accuser was 15 and Labrie was an 18-year-old senior."}]
