[{"comment_id":"1104177846295508","commenter_b":"@username Actually the major of women that have Abortions are Christian @webpagelink","commenter_a":"thats is because the democRATs favorite sport is killing our unborn babies...","post_message":"There is something very important missing here..."},{"comment_id":"1188696831170787","commenter_b":"Because they're redneck, uneducated, bible thumping, gun grabbing Trump supporters who own arsenals, and the desire to kill a living being just eats at them so they kill innocent animals. Because that's what republican Jesus would do!","commenter_a":"They must have been upset that their sisters wouldn't fuck them... #NationalTrailerPark #YallQaeda","post_message":"Gun violence also affects those who have no voice to speak against it."},{"comment_id":"10153980064333132","commenter_b":"Keep the refugees out of America or we are next!!!!!!","commenter_a":"So said we pray for them.Trudeau open your eye to seeIf you bringing 25.000 refugees and Canada will be next","post_message":"#PrayForParis"},{"comment_id":"10153630301063132","commenter_b":"Did they ever catch those fucktards??","commenter_a":"God Bless her and her family!","post_message":"\"I can't understand why they would want the thrill of hurting me like this, hurting my entire family.\""},{"comment_id":"10153065757271636","commenter_b":"nope, men rape men too.","commenter_a":"Oh I see. Rapists are just misinformed. If only they had read this first, or someone had read it to them at an early age then we wouldn't have this problem that we have today. Women taking sensible precautions has nothing to do with preventing rape. Maybe we should write and share a ten point guide for thieves on why they shouldn't steal. Then we wouldn't have to lock our doors.","post_message":"Worth re-sharing"},{"comment_id":"10154367782019071","commenter_b":"@username...you go girl!","commenter_a":"there u go again with ur propaganda...trying to launch a smere campaign on donald trump..main stream media is pathetic..lol","post_message":"Before becoming Donald J. Trump's chief strategist, Bannon wanted to make a movie with Mel Gibson."},{"comment_id":"10154262917016800","commenter_b":"I am the tool to build that damn wall!","commenter_a":"Trever, don't be an idiot.... I know your just a puppet... but cut the strings man...","post_message":"Donald Trump's campaign funding is running low while his personal spending is running very, very high."}]
