[{"comment_id":"983254505089966","commenter_b":"I can't imagine any other first lady doing that. Both of them are not comporting themselves as befitting their roles","commenter_a":"Michelle is no rocket she looks like Ichabod crane","post_message":"What an embarrassment"},{"comment_id":"10154496628933132","commenter_b":"@username she didn't say anything to the girls. She simply gave them a card. If my daughters were acting like spoiled brats I would not mind if someone put them in their place!","commenter_a":"Sorry Helicopter Mom, if I were those girls parents I'd jump down your throat for trying to police the thoughts and opinions of this group of girls, from what it sounds like to me it was the equivalent of a negative review among peers, I for one applaud the young ladies for exercising their First Amendment rights of free speech and I place the mother in question for violating those young ladies personal and intellectual autonomy","post_message":"The author and parenting expert shared the importance of being beautiful both inside and out."},{"comment_id":"576869582486929","commenter_b":"BULLSHIT !","commenter_a":"And who's to pay for the insurance? Oh forgot the WORKING CLASS WITH TAX THAT'S WHO!!!!","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"},{"comment_id":"10153898443761770","commenter_b":"In GOD we TRUST....Vote for Trump/Pence 2016..Hillary hate guns because dangerous to the toddlers!!! But In the GOD's name why she's ok to rip out the unborn 9 months in the womb...and Hillary sharing our national classify to others and exchange to pay her ...GOD bless American people to support Trump... because only Trump/Pence can stop government corrupt, bring job, boom the economy, protect our family and help veterans, military and make America safe and great again... that Hillary been extremely careless to protect our national security....and Trump will stop Hillary accepting money from foreign country that treat LGBTQ and women like animal... and Hillary call all my Africa-American friends \"SUPER PREDATOR \" and insulting all my Latinos & Latinas \"NEEDY & BOWL of TACO\"","commenter_a":"Who gives a damn","post_message":"Nate Schmidt of the Washington Capitals sits down with David Hookstead to talk about life as an NHL player."},{"comment_id":"10155790474957316","commenter_b":"*she's a woman","commenter_a":"Um...He's a guy so....","post_message":"Manning had been a candidate for gender-reassignment surgery, which would have been paid for under the Pentagon’s new policy for transgender troops. But the terms of the 35-year sentence the court-martial imposed includes a “dishonorable discharge,” which the commutation did not affect, Army spokeswoman Cynthia Smith said Wednesday."},{"comment_id":"10153937473666336","commenter_b":"Michell is NOT a woman.","commenter_a":"PU$$ Y !!!","post_message":"\"You help keep us free. You help keep us strong. Whatever service you're in, whatever branch, we are extraordinarily grateful for everything that you do every single day.\" – President Barack Obama"},{"comment_id":"1392423634112580","commenter_b":"MESSAGE TO DONALD TRUMP AND TO THOSE WHO VOTED FOR: THE DEVIL IS AT HOME. EVERYONE MUST PROTECT HIS RIGHT BY LAW. MAKES YOU QUESTION WHY MADE THIS MILLONARY HUMAN BEING MADE OF FINITO DUST? THANK YOU TO THESE COUNTRIES. IN INDIA HAS 16 BUSINESSES, ARAB EMIRATES 13, CANADA 12, CHINA 9, INDONESIA 8, PANAMA 8, SAUDI ARABIA 8, SCOTLAND 7, AZERBAIYAN 5, BRASIL 4, IRELAND 4, ISRAEL 4, CATAR 4, FRENCH ANTILLES 2, SOUTH AFRICA 2, TURKEY 2 URUGUAY 2, BERMUDA ISLANDS 2. AND CASINO IS ONLY YOUR MASK. HOW EASY IS TOMB TO THE GOLIAT. AND IF IT CONDEMNS CUBA? EVERYONE CONDEMNS THEM; UNTIL WHERE THIS DONALD HITLER ADOLF TRUMP DICTATOR HAS ARRIVED. THE CURRENT MOMENT IS OF ABRUMING INTEREST FOR ALL REPUBLICANISMS THAT OCCUPY POSITIONS OF CONFIDENCE, THE REPUBLICANISMS HAVE CHOSEN THE MOST VIOLENT MAN WHO HAD ALREADY HAD SINCE THE FOUNDATION OF THE UNITED STATES OF ...","commenter_a":"So what happens now?? Castro brother takes over???same crap or the people change this?","post_message":"\"Everybody's been partying, basically, all night long.\" Earlier this morning on \"FOX & Friends Weekend,\" Phil Keating gave us a look at the pre-dawn celebrations occurring in Miami, Florida, in response to Fidel Castro's death. @webpagelink"}]
