[{"comment_id":"10153373946241833","commenter_b":"HE is a mental defective!","commenter_a":"he can leave anyday and take his moron buddies with him.","post_message":"The chairman of the Senate Judiciary Committee wants Attorney General Eric H. Holder Jr. to explain why a Department of Justice gun ban list has a defective category consisting almost entirely of names belonging to military veterans and their dependents. disturbing to think that the men and women who dedicated themselves to defending our freedom and values face undue threats to their fundamental Second Amendment rights from the very agency established to serve them, Sen. Chuck Grassley, Iowa Republican, said in a statement Wednesday."},{"comment_id":"10153080181251519","commenter_b":"Like StepFord Wives.. Im ashamed that A Women could trash and allow other sisters to have their rights taken away!!","commenter_a":"How can these people especially GOP WOMEN accept that party????","post_message":"Megyn Kelly slams Trump for calling women ‘fat pigs,’ ‘dogs,’ ‘slobs,’ and ‘disgusting animals'... and he laughs -- and so does the GOP crowd."},{"comment_id":"10153722838823984","commenter_b":"Pussy breath","commenter_a":"Through the key away","post_message":"A federal judge has ordered Kim Davis to remain in a jail cell until she agrees to issue marriage licenses to same-sex couples. The state is holding a metaphorical gun to her head, yet all she has done is stand firm in her conviction that marriage is between one man and one woman. Stand with us and sign the petition for Kim Davis to be released from jail immediately!"},{"comment_id":"817253511741162","commenter_b":"@username she isn't running. Stupid! Trump's wife is a ditzy bimbo... Not relevant.","commenter_a":"Hello!!! The Liberals are the ones voting for him. He is a danger to our country. I know many Conservatives who feel the same way about this democrat posing as a republican. Don't be stupid with your vote. The Liberals will still want to leave over Cruz being elected. Why not go that route? Or change your page to the Comical Former Conservative.","post_message":"Rosie and Whoopi too......one can dream..."},{"comment_id":"10154376449396636","commenter_b":"Sorry but the open door immigration you referred to doesnt apply to North Africans. No African countries are in the EU.","commenter_a":"I don't think the opinions of someone who has ruined an entire continent with her open door immigration policy are worth listening to....","post_message":"Strong words"},{"comment_id":"10153400314832183","commenter_b":"...and he thinks that threat is going to deter anyone from voting for Bernie. It makes me MORE determined to vote for Bernie. Don't let the door hit you in the ass Bill.","commenter_a":"PLEASE, vote for U.S. Senator Bernie Sanders for president so O'Reilly will go!!","post_message":""},{"comment_id":"497217833799843","commenter_b":"American does not need to bring any of them here. They need to return to their country and fight for it.","commenter_a":"some dumb asses do not see it..as I say only welcome children and women....period...send those men back and tell them to fight for their country......those are ISIS men....they do anything to get in the civilized countries and take over.....wakw up people","post_message":"Can you see the BIG difference?"}]
