[{"comment_id":"1367609406650925","commenter_b":"Lets stomp out evil everywhere.","commenter_a":"It will be good to have a true American running the government again.","post_message":"This is definitely the most Trump-tastic resolution that Donald J. Trump could have made..."},{"comment_id":"1173905836039000","commenter_b":"She's not my plan b.","commenter_a":", Sanders is a good man, sad what the DNC did to him, they rigged the rules against him, Hillary is running all the way to the bank laughing her big fat @ss off, this Democrat will not vote for that money sucking Hag !!","post_message":"Bernie Sanders shoots some hoops with NBC's Chris Jansing. More from the court: @webpagelink"},{"comment_id":"10153173329758984","commenter_b":"Wolves in sheep's clothing.","commenter_a":"Watch Yer back,Sheriff Joe,Yer dealin with Snakes...","post_message":"Look out, Obama. The sheriff's in town. Do you support what Sheriff Joe Arpaio just did to stop Obama's amnesty?"},{"comment_id":"1340506826002077","commenter_b":"Not me kick the muslims baxk to there own countries","commenter_a":"Why don't you go eat a goat turd sandwich and drop dead","post_message":"This is the congressman that stated the Islamization of America can't be stopped..."},{"comment_id":"470654633125117","commenter_b":"She wants he balls back","commenter_a":"Yes. One way ticket to kenya","post_message":"Michelle is turning 51, and you'll never believe what gift she wants. We have a good idea, how about a trip back to Kenya for her whole family? Anyone agree?"},{"comment_id":"1398961996812250","commenter_b":"Hhhh u wish loser umais .. our heels over u and ur terrorists logic","commenter_a":"So what stopped Iran from making a grand Muslim Allaince against Terrorists? Unfortunately Iran gave it a secterian touch by involving only shias in the fight against daesh. Iran did not reach out to any Muslim country to come and help them in fight against daesh or did they?","post_message":"Pakistan’s Defense Minister has confirmed that the country’s former Army Chief has been appointed as commander of a so-called Saudi-led military coalition."},{"comment_id":"10153555593349087","commenter_b":"Please seek professional help. Oh, and by the way...no man knoweth the hour. (Remember that part?)","commenter_a":"America is speaking loud and clear...CAN YOU HEAR US NOW??? As a Christian woman, I believe Donald J. Trump is an answer to prayer for this once great nation and he just might be a temporary reprieve from the judgment that we so rightly deserve and which looms so ominously on the horizon. He is clearly fighting back against the forces that be that are doing everything in their power to bring about global governance, he will fight for us, I believe that...he knows most of these devils personally and knows more than we do about them, I am sure, and he wants a great nation to leave to his own grandchildren...and he is bold and determined enough to want a great legacy to leave to them as well...what better legacy than saving a nation from itself...I have had many people ask me how I, as a Christian woman, could ...","post_message":"“Our borders are like Swiss cheese,” Donald Trump said at tonight's #GOPdebate. \"This is wall that’s going to work. The wall is $10-12 billion if I do it. Mexico will pay for it because they’re not doing us any favors.\""}]
