[{"comment_id":"601888693294679","commenter_b":"Pussy is pussy","commenter_a":"Almost every girl I've ever met before my current relationship has just been looking for someone to either buy all their shit so they don't have to work, or someone to be step daddy. Smh. I don't want to hear shit about unfair expectations.","post_message":"Well Damn!"},{"comment_id":"10155196605381178","commenter_b":"I suggest duct tape over her mouth...such a sad woman !","commenter_a":"Alveda King, Martin Luther King Jr.’s niece, accused Massachusetts Sen. Elizabeth Warren of playing the “race card” when she attempted, on the Senate floor, to read a letter written by Coretta Scott King in order to make her case against Sen. Jeff Sessions for attorney general. “It’s almost like a bait and switch, stir up the emotions, in the name of King—and my name is Alveda King—stir up people’s emotions, play the race card, which she was attempting to do,” King, who supported Donald Trump for president, said Wednesday on Fox Business Network. Sessions was confirmed Wednesday to be the next attorney general despite efforts by Democrats to derail the nomination. The full body voted along party lines to silence Warren for violating Senate rules after she attempted to read Coretta Scott King’s letter.","post_message":"Bitter, much?"},{"comment_id":"497513650439215","commenter_b":"Bitch","commenter_a":"Well then ll blacks are racist even if they don't use the Cracker word!!!","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"10153754678291336","commenter_b":"Can't play politics and disarm society if you make the kids safe! Gotta get a few kids killed to advance if you're a communist. The end justifies the means with these Freaks.","commenter_a":"jerry brown is a fool","post_message":"Does this make schools safer?"},{"comment_id":"1178309965526894","commenter_b":"@username I understand and do not disagree with you. I just believe that there is enormous demand for illegal workers by American employers for whatever reasons. That demand is what brings the illegals to this country and no one ever talks about this.","commenter_a":"Donald Trump does not have a problem with Mexican's, or anyone else for that matter. He has a problem, as do I, of illegally crossing the border to make use of our system without going through the proper channels. If you don't also have a problem with that, then this country is doomed.","post_message":"Worker says he took a stand against Donald J. Trump and his immigration policies by hanging a Mexican flag at the Trump International Hotel in Vancouver. \"From the concrete pouring, finishing, drywall, taping, wood forming and general labour, Mexicans were there, building it.\" @webpagelink"},{"comment_id":"935330543153792","commenter_b":"Kiss your mother with that tongue Karen?","commenter_a":"Excellent news. The courts have prevented the Harper regime from taking over the judicatory.","post_message":"It was the third time Khadr's case has been before the Supreme Court of Canada, and the third time the justices have ruled in his favour."},{"comment_id":"10152607726779071","commenter_b":"same here","commenter_a":"I've been dressing like a man for years and I assure you no one takes me seriously.","post_message":"The clothes you wear have a profound impact on how people perceive you."}]
