[{"comment_id":"10153166986805950","commenter_b":"Your lies are quite bare in the fact that Trump never said Mexicans are problem. He said ILLEGALs are problem. Legal and citizen Hispanics support him because liberals want to keep the illegals to keep wages down. Just like the South wanted to keep slaves for cheap labor. Guess who's hiring underpaid illegals for farming? California!","commenter_a":"The Anti-Defamation League is dead on. There were people with guns that stood up to the Nazis and they were wiped out with brutality. Additionally Hitler campaigned a lot like Trump promising to make Germany great again, riding into power on nationalism. Hitler sold the ubermensch and the German people bought it and you can't have superman without inferior beings to crush. European Jews were the scapegoats he needed, he pinned all German problems on them. Hitler preached that it was their fault, they were the reason Germany wasn't as great as it should be and Germans bought it. (Does that song sound familiar?) Every German could have ten guns and Hitler still would have come to power.","post_message":"Presidential hopeful Dr. Ben Carson Carson said that he believed \"the likelihood of Hitler being able to accomplish his goals would have been greatly diminished if the people had been armed.\""},{"comment_id":"946602502043757","commenter_b":"She is not presidential material!!!","commenter_a":"This is one shady lady.","post_message":"\"But we also are extremely troubled by the events...\""},{"comment_id":"10154941514794062","commenter_b":"Say what you like.. Hoe, no talent.. Her bank account says otherwise. Carry on","commenter_a":"The only fame she has is singing with her legs apart and if it wasn't for that she wouldn't have any fans.","post_message":"Good news for Beyonce fans!"},{"comment_id":"1058949000851488","commenter_b":"Of course it would. My God you people with your guns. Enough already.","commenter_a":"None of the proposed legislation would have saved a single life... this is all political theater and a cover for the Democrat's failed foreign policy.","post_message":"Senator Chris Murphy: \"I'm mortified by today's vote, but I'm not surprised by it. We learned in the months after Sandy Hook that the NRA has a vice-like grip on this place. Even when 90% of the American public wants change.\" Full video here: @webpagelink"},{"comment_id":"1809746189282784","commenter_b":"Why you wait until today to do this stupid you are old and stupid my God how a woman do these stupid thing","commenter_a":"Stupid stupid","post_message":"#LIVE VIDEO: Attorney Gloria Allred is holding a press conference with a woman who accuses Donald J. Trump of sexual misconduct."},{"comment_id":"10153787356025667","commenter_b":"Hello pretty lady","commenter_a":"Here's a fact for you Ms. Arnaud: Have you ever heard of Robert Byrd? Hillary considered him a close friend and mentor. Do some research.","post_message":"Hillary Clinton gave one of her strongest rebukes against Donald Trump at a speech in Reno, Nevada. @webpagelink"},{"comment_id":"10152700473451051","commenter_b":"Better to stay single. Plan to meet in a well lit public location. Women don't pick up or be picked up.","commenter_a":"I tried this one time! Never again! He scared me!","post_message":"It started out as an ordinary date between two people who met online. It ended very violently."}]
