[{"comment_id":"10153432969041037","commenter_b":"Liars too?","commenter_a":"History lesson needed here - the NAACP is and always has been open to people of all races/ethnicity for membership and leadership. This story is a non-issue.","post_message":"NAACP's Rachel Dolezal: \"We’re all from the African continent.”"},{"comment_id":"10154075665287377","commenter_b":"Denounce your US Citizenship,,proclaim illegal alien status anf receive FREE Medical from the Government!!!!","commenter_a":"Can't repeal it fast enough for me! My own insurance costs went up 700 bucks once Obamacare kicked in. Seems I'm paying for some family that can't afford their own insurance. Well... I can't afford their insurance either!","post_message":"Sen. Rand Paul slammed the Affordable Care Act, also known as Obamacare, saying Congress will, \"as its first course of action, vote to repeal Obamacare. It cannot happen soon enough.\""},{"comment_id":"1333030216717005","commenter_b":"She has no talent and is trash","commenter_a":"Levy a fine, and move on. That show was one of the best in a long time. Grande was very good.","post_message":"Singer and actress Ariana Grande surprised the \"Saturday Night Live\" audience and crew with an unexpected profanity during her monologue."},{"comment_id":"698823633563273","commenter_b":"Well then stop her. Isn't that your job?","commenter_a":"Yes a female Eric Holder,","post_message":"GOP leadership should stop the Loretta Lynch nomination by not reporting it to the floor for a vote. We must reject lawlessness, outright."},{"comment_id":"1127007594082684","commenter_b":"Hell yes, round em up & send em back in those pink boxers.","commenter_a":"HE 's the best man for the job","post_message":"ClashDaily.com"},{"comment_id":"1720013778051378","commenter_b":"No they don't.they are illegally living here ,they all need to be deported back to the desert.","commenter_a":"Nope! Not wanted.","post_message":"Incredible..."},{"comment_id":"1409033915841807","commenter_b":"it is her business, she can refuse anyone","commenter_a":"Shouldve kicked the dudes out then shaved her head","post_message":"A Muslim woman went into a local hair stylist and made a shocking demand regarding her religion. It didn't take her long to realize that she had picked the wrong hair stylist... Now, some are saying that this hairdresser went too far. Do you agree?"}]
