[{"comment_id":"10153367837094714","commenter_b":"You just don't understand feminism, boys are free to do what they want to do women should be just as free, to have sex, get drunk and behave carelessly just like boys do.","commenter_a":"Why would they take offense? Because they want to protect the image and dignity of young women? Seriously?","post_message":"Wow, we didn't see it until we looked closely"},{"comment_id":"1278673865484657","commenter_b":"I understand that Hillary has a criminal mind, and I never want someone like her in any office of our government. Her evil intentions are based upon her greedy lust for power and money. But with all due respect, Mr. Trump, what I find so incredibly \"shocking\" is that NO ONE CARES ENOUGH TO DO ANYTHING ABOUT HER!!! Everyone is pissing and moaning ALL THE TIME about Hillary and Obama, saying she done this, and Obama done that. BUT WHAT IS BEING DONE ABOUT THEIR REIGN OF TERROR? NOTHING. ZERO. ZILCH. NADA. To me that says that Americans are a bunch of APATHETIC ENABLERS. We the people deserve the lot we've been given because we, as a nation, have ALLOWED IT!!! #stoptheenabling #stopthetyranny #votetrump","commenter_a":"\"Because one wrong move can mean the difference between life and death.\" -Hillary Clinton, 8-25-16 We know that's true, Hillary. We know that's true. Signed: Ambassador Stevens Sean Smith Glen Doherty Tyrone Woods","post_message":"Hillary Clinton’s actions constitute all of the elements of a major criminal enterprise - she created a private illegal email server in order to hide her corrupt dealings. She did so knowing full well it would put American lives at risk by making classified information highly vulnerable to foreign hacking. But, she didn’t care – as long as it helped her get away with her crime, no risk to America was too great. Then, to further cover-up her crime, she deleted 33,000 emails to keep them out of the hands of authorities and the American public. As a further element of the criminal cover-up, she claimed under penalty of perjury that she turned over all of her work related emails. We now know this to be one more massive Clinton lie. The FBI found thousands of work-related emails she failed to turn over, including the new discovery this week of ..."},{"comment_id":"1858889271057520","commenter_b":"Bitchhhhh","commenter_a":"@username Jayquan Parker @username","post_message":"A woman drove her SUV into a T-Mobile store after she says she couldn't get her cracked iPhone replaced. @webpagelink"},{"comment_id":"10154356809342654","commenter_b":"DEPORTATE ALL IMMIGRANTS ILLEGAL! God Bless US .","commenter_a":"All the people walking there equals one mexican party or quince lmfao","post_message":"Immigrants who work at dozens of restaurants around Washington, D.C. are participating in the Without Immigrants protest. We're live at Pizzeria Paradiso (Dupont Circle) where managers are trying to get by without their employees AND we're live at the site where protesters are organizing."},{"comment_id":"10153332297102061","commenter_b":"What's racist about putting Americans protection FIRST from illegal alien Mexican criminals and potentially ISIS infiltrated refugees?","commenter_a":"Trump is a racist piece of trash. He needs to just step down and hide for a few years","post_message":"TOP STORY: Trump rally draws hundreds of protesters in Bernie Sanders' home state of Vermont: abcn.ws/1JxW5UZ -- see more on GMA..."},{"comment_id":"631671896999280","commenter_b":"Too many real stories of sexual predators taking advantage of this garbage! BOYCOTT target!","commenter_a":"After the Trump rally last night here in Pa all the restaurants and stores were packed in the vicinity. We drove past Target to get out of the traffic jam and we noticed they were dead. It was really weird to see.It was bad enough when we came home from Kmart one day my 13 year old daughter telling me a female came in the bathroom with a bag and needle. Wish I knew before we left but I do not want her coming out and telling me a MAN was in there watching her No way.","post_message":"Target customers show the company just how they feel about its new transgender bathroom policy. @webpagelink"},{"comment_id":"1753089554908587","commenter_b":"Race has nothing to do with him being a dumbass.","commenter_a":"and he owes over 10.000.000 to creditors in US","post_message":"Kanye West is finally leaving. Thank the lord. We don't want him anyway. Can we get 5,000 'LIKES' to have Kanye leave for good!"}]
