[{"comment_id":"10153889238948984","commenter_b":"Send them BACK to Syria!","commenter_a":"Go back....","post_message":"You would think that Syrian \"refugees\" wouldn't be able to make many demands of their host nations. However, they have -- and some of them are completely RIDICULOUS. This should put the lie to the myth that these migrants are only coming to the West to escape persecution... and this is what Obama wants to import HERE?"},{"comment_id":"10152944080940950","commenter_b":"You cant tell he has an accent?what a bitch!","commenter_a":"I know law enforcement still search for david sweat and richard matt 20 days after escape from Clinton Correctional Facility. I know correctional officer Gene Palmer has already arrested for possible help to david sweat and richard matt escape from prison. I say correctional officer, prison workers and prison staff never help to some inmates escape from prison. If correctional officer, prison workers and prison staff help to some inmates escape from prison and could be arrested add prosecutor attorney will announce charged against correctional officer, prison worker and prison staff.","post_message":"A guard charged in the New York prison escape \"knows that he made a mistake,\" his lawyer says: @webpagelink"},{"comment_id":"10153943482835579","commenter_b":"Pregnant German girl burned alive by Turkish immigrants Two Turkish men burn 19 year old Germany girl alive in honor killing. conservative-headlines.com","commenter_a":"Nice one Obama, now they'll be hauling the \"skunk\" sludge through our country on trains and trucks. But it's easy to fool your numb skull followers isn't it.","post_message":"Pres. Obama kills Keystone XL pipeline, saying it's not in U.S. interests. Your comments? @webpagelink"},{"comment_id":"1155384687884221","commenter_b":"That's what you get for working for him.....I wonder if he ever payed the little girls who sang and danced for him for a rally","commenter_a":"Trumps motto : if you're stupid enough to trust me you get what you deserve.","post_message":"If you work for Trump, you're going to get burned."},{"comment_id":"10153630301063132","commenter_b":"Did they ever catch those fucktards??","commenter_a":"God Bless her and her family!","post_message":"\"I can't understand why they would want the thrill of hurting me like this, hurting my entire family.\""},{"comment_id":"10152908269848855","commenter_b":"That isn't how lesbians do it.","commenter_a":"more and more promotion of sodomy","post_message":"Hooray!"},{"comment_id":"1387475997939242","commenter_b":"It's probably a welsh lamb that's fucking had enough of being raped 😂","commenter_a":"Fucking ouch!!!!","post_message":"And you thought you were having a bad day... via JukinVideo"}]
