[{"comment_id":"10153044064759456","commenter_b":"That is exactly the thought that went through my head!","commenter_a":"Yet this A**hole gets a $500,000 bond.....whew this judicial system!","post_message":"A Montgomery man is being held on a $1.25 million bond after being arrested for allegedly trafficking methamphetamine. @webpagelink"},{"comment_id":"10153016885814117","commenter_b":"The word you will never hear from your wife, @username.","commenter_a":"Perhaps the costs of CC regulation should be compared to the costs of climate change inaction? CEA finds what economists would call “increasing marginal costs” of delay. If we don’t make a concerted effort to keep the rise in average global temperature within the range consistent with modest costs and instead allow it to stabilize one degree Celsius higher, the annual additional damages would equal 0.9 percent of global output. A longer delay that added another degree would cause additional annual damages of 1.2 percent of global output. That’s a total change of 2.1 percentage points. To illustrate those annual costs more tangibly, 2.1 percent of current U.S. GDP, which is about a fifth of world output, is roughly $360 billion. The story doesn’t end there, however. There’s a lot of uncertainty around these estimates. Acting sooner rather than later is insurance against unpleasant surprises. We’re happy to pay fire ...","post_message":"Today, President Obama and the EPA are announcing the final regulations that would establish President's Clean Power Plan. How much will it cost you?"},{"comment_id":"829608320409843","commenter_b":"She is disgusting!","commenter_a":"I'm warmed by the tolerance of the libs. Not.","post_message":"Well, she certainly didn't shy away about how she feels."},{"comment_id":"1015160651860508","commenter_b":"@username go be stupid with your blond friends elsewhere","commenter_a":"If the little brat would have respected the teachers authority in the first place the cop wouldn't have even needed to be there.","post_message":"No matter how smarmy some snot-nosed teenager might be, even if she’s burning off the teacher’s time, the class time and her own time, there’s never a moment in which it’s appropriate for a law enforcement officer to try out his best WWE moves in order to bring her to heel — even if she takes a swing at him. @webpagelink"},{"comment_id":"10153152678751051","commenter_b":"Lady u need help your just stupid","commenter_a":"So many evil haters for every Obama achievement. You have all been wrong on everything Obama has done this far. It is time to take a positive stance!","post_message":"President Obama says today's Iran deal is a huge victory. What do you think: is this a good deal for America?"},{"comment_id":"10153206057979312","commenter_b":"Yeah that's why global warming is such a bigger deal than millions of humans getting their head slashed. Good one! You know they will come over here and do the same!","commenter_a":"If the President comes out in favor of it they'll drop the idea like a hot rock.","post_message":"Under the proposed measure, Missouri residents would switch to daylight saving time in March 2017 and never turn their clocks back again. Good idea? Bad idea?"},{"comment_id":"532673453589901","commenter_b":"Linda are you drunk? Your comment makes no sense. Girl get yourself together.","commenter_a":"If he does not support Obama he should not have to speak to him. It's a free country so far.","post_message":"Obama is outraged after Tom Brady made an epic stand against him. This is amazing. We have is back, let's show him our support. Can we get 10,000 'LIKES' for Tom Brady's stand against Obama?"}]
