[{"comment_id":"10154898475594657","commenter_b":"Trump Beat Trump.","commenter_a":"Bunch of lying scumbags! They've always known that Trump was going to crush them. They scurry around like the rats they are, searching in vain, for a way to beat Trump! TRUMP 2016!!!","post_message":"\"All of us shouldn't even have answered that question.\""},{"comment_id":"10154107303310286","commenter_b":"This has been my home longer than it's been yours.","commenter_a":"Go home","post_message":"#BREAKING: Organizers estimate around 250,000 people flooded the streets for the Women's March on Chicago – more than three times the expected attendance. Details: nbcchi.com/eWVXidj"},{"comment_id":"658224230997183","commenter_b":"She's buying her way out, watch. Criminal Just like Bush/Cheney. Ever see them traveling abroad? Ever wonder why?","commenter_a":"She is Ugly and a Liar just like Bill !!","post_message":"Judicial Watch announced it has filed a proposed order for discovery with a federal court that seeks the testimony of Hillary Clinton about her use of personal email account(s) for official State Department business. Judicial Watch discovery plan also seeks the testimony of Cheryl Mills, Clinton former chief of staff; and Jake Sullivan, former senior advisor and deputy chief of staff, as well as other current and former State Department officials. Please SHARE!"},{"comment_id":"10154455210992577","commenter_b":"Mite as well. Hillary going to rig it so why not lol","commenter_a":"If the biggest criminal in the world doesn't want all that competition from Hillary who can blame him?","post_message":""},{"comment_id":"10153493964774060","commenter_b":"And she could have foiled the whole dastardly plot by wearing a seatbelt!","commenter_a":"it's a shame the British had her murdered...","post_message":"On this day in 1981, Lady Diana Spencer married Prince Charles. At the time, The Economist gushed \"God save the next queen\". It was not to be. Read our obituary from 1997 @webpagelink"},{"comment_id":"10152954070746336","commenter_b":"She is an idiot","commenter_a":"More hot air.","post_message":"In a speech at the The Brookings Institution on Friday, Obama's National Security Adviser Susan Rice said while ISIS is dangerous, it is not a threat of \"existential nature\" like World War II or the Cold War. @webpagelink What do you think of her comments?"},{"comment_id":"10157375449970354","commenter_b":"Fuck off you little bitch!","commenter_a":"Its ok. Nobody was listening.","post_message":"Isn't that so thoughtful of Leftists who deride religion to lecture Christians on their faith?"}]
