[{"comment_id":"1432544963425545","commenter_b":"As Usual Asian people don't respect anything. They are doomed!","commenter_a":"Typical Asian - they'll eat anything that moves","post_message":"Their cries will make you question everything you put on your plate. How can anyone treat animals this way?"},{"comment_id":"10152966300122093","commenter_b":"You Must love getting raped .. how was your child life stupid","commenter_a":"he's fine as hell he can be my massage therapist any day ;)","post_message":"This man posed as a massage therapist.... he then sexually assaulted the Dallas women he tricked.... @webpagelink"},{"comment_id":"948827975173732","commenter_b":"Alright, Rosa! Good for you and good for Latina women!","commenter_a":"Yes @username with the Latin vote you will be our president 2016 yeaaaa","post_message":"Hillary stands up for Planned Parenthood—and women's rights."},{"comment_id":"10153910482357464","commenter_b":"We don't need another illegal immigrant running our country!! Vote for Trump","commenter_a":"We don't need another Obama in office be smart!! Vote for Trump","post_message":"Spoke with Hugh Hewitt yesterday on the eve of the Nevada caucuses. You can hear the discussion here: @webpagelink"},{"comment_id":"775509592583157","commenter_b":"@username they are home how about the real immigrants go home for a change ?","commenter_a":"Illegals come here from Mexico looking for a better life yet they want to turn the U.S. into Mexico...freakin' crazy, and stupid!","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"},{"comment_id":"10153462530999255","commenter_b":"The Chinese will be happy to take its place!","commenter_a":"Is that dog shittin in the flag. Thats just wrong just wrong.lol","post_message":"You don't see Nazi memorabilia on the Antiques Roadshow for a reason."},{"comment_id":"860972087426701","commenter_b":"ABSOLUTELY NEEDS TO GO TO PRISON FOR LIFE WITH HARD LABOR . MAKE HIM CLEAN TOILETS WITH A TOOTH BRUSH .","commenter_a":"Good Luck Generals....he's pretty slick...watch out for the fall out!","post_message":"Obama has betrayed our country. These generals are moving in to arrest him. Do you think Obama should be put behind bars?"}]
