[{"comment_id":"1123021131087914","commenter_b":"the bulshit they talk is baloney. the true Americans are the native people the rest are immigrants.","commenter_a":"eah did you ount the dead, I mean the millions massacred by your ancestors the funding fathers the true Americans the only ones with the right to talk about how bad is immigration. Your talk is baloney.","post_message":"A Pew study found immigration will account for 88% of U.S. population growth over the next 50 years."},{"comment_id":"1606127946356954","commenter_b":"Plus did you see any of his hand movements it was crap","commenter_a":"Can you believe what he said in his tape tries to put it on Bill Clinton and Hillary he's such an ass","post_message":"Anyone even THINKING of voting for Trump needs to see this shocking video. Video by Occupy Democrats, LIKE our page for more."},{"comment_id":"1141174309285545","commenter_b":"PUT THESE RAGHEADS OUT IF THEY CAN'T COMPLY!!!","commenter_a":"No","post_message":"The military doesn't bend their rules for their soldiers. If you want to serve, then fall in line. Do you think our society has become too sensitive?"},{"comment_id":"10155781129770329","commenter_b":"The Government shouldn't be funding ANY OF IT, that's the reason it would be discontinued. The Federal Government protects our borders, prosecutes Federal crimes (FBI) and unifies States with Federal Laws under the constitution. That's ALL I WANT THEM TO DO. I support Trump cleaning house on the outrageous spending the Federal Government has been doing for some time. PBS can go back to private funding and telethon like they did when I was a kid. NPR, same idea. They need to raise their own money like any other radio/news outlet. The amount of fees we will begin to charge Mexico for deporting all the people they let cross over will pay for The Wall. In taxes to Mexico for importing goods here. Learn basic Economics and US Government people, geez...","commenter_a":"The best part about PBS, NPR, and those other arts programs that are getting cut is that they actually don't cost that much. So, really, there isn't a lot of money being saved to go towards the idiotic wall that he wants to build.","post_message":""},{"comment_id":"10154896780339411","commenter_b":"Why is that boot still in charge. Get her out !!!!","commenter_a":"Says the leader that advocates the EU: one of the biggest protectionism rackets on the planet!","post_message":"'Globalization is happening. We can arrange it such that we strengthen multilateral instruments... or such that we seal ourselves off and become protectionist', said Angela Merkel."},{"comment_id":"10153570996910329","commenter_b":"*high five* you guys are awesome! :D","commenter_a":"I'm a proud Christian and I'm ecstatic about this. I'm not even gay. Or American.","post_message":""},{"comment_id":"410085892484700","commenter_b":"Yes, look at Seattle. They're thriving. Lol WTF. Way to make a point against yourself. The two highest min wage cities are Seattle and San Francisco and they're also the top two fastest growing metropolitan areas in the country right now.","commenter_a":"If you think shit is expensive now, just wait when the minimum wage is 10 bucks an hour...Walmart is in favor of this because people will only be able to afford to shop at Walmart instead of the locally owned businesses","post_message":"Walmart's announcement that it will raise its minimum wage to $10 an hour was claimed as a victory by both advocates and opponents of raising the federal minimum wage."}]
