[{"comment_id":"1629069924061974","commenter_b":"She's beyond dumb she is STUPID","commenter_a":"You people keep forgetting shes not the stupied one, its the people who voted her back in","post_message":"WOW! Huckabee Asks Nancy Pelosi If She’s \"Racist” Or \"Just Dumb” Over Dr. Ben Carson Comments"},{"comment_id":"10152956998151051","commenter_b":"Good! Send her ass to prison!","commenter_a":"Good","post_message":"Remember the veterinarian who got fired after doing this to a cat? Well, she just got some more bad news."},{"comment_id":"870513306380610","commenter_b":"Seriously?!?!?!?","commenter_a":"So the hackers can have even more access to our personal information? Great.","post_message":"The Postal Service is testing a \"notification\" service that emails you photos of the envelopes of your mail."},{"comment_id":"10155397159458797","commenter_b":"And no telling how many more he has! Since he likes to pull on ladies p___y. Freak!","commenter_a":"Since you all won't acknowledge our formal president as the \"First Black President\" i will only acknowledge trump as the FIRST PRESIDENT WITH THREE BABY MOMMAS' BAHAAAAA! HAPPY BLACK HISTORY MONTH!!!","post_message":"On this first day of Black History Month, we recognize former President of the United States, Barack Obama. He was the 44th U.S. President and the first African American to serve as president."},{"comment_id":"1079778352065591","commenter_b":"She is cum bumb","commenter_a":"Hillary may be her Girlfriend!","post_message":"Talk about condescending!"},{"comment_id":"10153468718801130","commenter_b":"Classy women.","commenter_a":"Gorgeous young women!","post_message":"\"They're not trying to look older than they are.\""},{"comment_id":"1868770480033724","commenter_b":"Why, because the system is being drained my illegal aliens and the corrupt gov. Trump is fixing that open your eyes.","commenter_a":"This is as embarrassing as it can get. I wouldn't want to be president of a country if I had to think so negative about it. America is a great place to live but they r making some poorer each day. Cut Social Security, cut Medicare, cut insurance , cut food stamp, cut cut. Why?","post_message":"No. Words."}]
