[{"comment_id":"1495136007456674","commenter_b":"Just every woman with a family huh? Men with a family don't do more too?","commenter_a":"You all don't know what hard work is. Every woman that has a family does more than fast food workers, and fireman definitely do much more than fast food workers!!!","post_message":"\"Some people say paramedics don't even get $15 an hour and they save lives. So why should fast food workers get that?\" That question comes up a lot when we cover #FightFor15 rallies, like this one in Detroit. But Fox2's Roop Raj is having to defend himself just for asking it. Watch his whole report here and see what you think: @webpagelink"},{"comment_id":"985323948188437","commenter_b":"Islam should not be in our school systems st all!!!!😯😯😯😯😯","commenter_a":"I don't think that our children need to know a lot about Islam. I think that our children need to be taught about our God - be they Christian or Jewish - also, they need to salute the flag and be educated to know that our men and women have sacrificed so much in order for us to be free.","post_message":"U.S. DEPARTMENT OF EDUCATION: Teachers Should Incorporate Islam In More Subjects"},{"comment_id":"10153623967716323","commenter_b":"This is the best thing ever said. Ever.","commenter_a":"Uniting all parts of Yorkshire could be a bad idea. If it took our fancy we could go game of thrones on your arse!","post_message":"\"Pit a bunch of Yorkshire folk against outsiders and they’ll all chunter on about how chuffing brilliant God’s Own County is. Put a Bradfordian, a Sheffielder, a Yorkie and a Leeds lad in the same room, however, and they’ll argue about their football teams, the relative quality of their beer, the beauty of their landscape and women, and everything in between. Often all that will unite them is a shared disdain for Hull.\" Full disclosure: Helen Pidd is from Lancashire."},{"comment_id":"10153844066851770","commenter_b":"******* PENCE WHIPPED WITH A KAINE *******","commenter_a":"Not too much for me to say, I hope they both lose. God bless the U.S., amen.","post_message":"The #VPDebate is over, but there's still a lot to talk about. Like that rumor that Trump is mad about Mike Pence doing so well, or all those times Tim Kaine interrupted him. Keep watching for a special round of trivia, starring a giant tub of Nutella. Your hosts: Christopher Bedford, Christian Datoc and Katie Frates."},{"comment_id":"442634665940047","commenter_b":"A phony through and through. All she cares about is herself and power","commenter_a":"Indeed","post_message":"ICYMI - Hillary Clinton an Expert at being Fake"},{"comment_id":"10153672150997217","commenter_b":"Watch your tongue","commenter_a":"Most muslims hate gays yet have no problem seeing a murderous paedophile prophet as a role model for all mankind? That's f***ed up I'm sorry but it is.","post_message":"BREAKING: The suspect for the mass shooting at Pulse Orlando gay nightclub is 29-year-old Omar Mateen, the BBC understands. It is believed the US citizen was not on a \"terrorism watch list\"."},{"comment_id":"10153010848717434","commenter_b":"Women have fewer children when they have excellent access to birth control. Education, free birth control and free condoms.","commenter_a":"We need to implement that policy here. If you're on any kind of public assistance, you can't be having more kids you can't afford to feed.","post_message":"The thing about demographics is you can’t just flip a switch."}]
