[{"comment_id":"10154975691779859","commenter_b":"Not only NO but hell NO!","commenter_a":"No","post_message":"Should Betsy DeVos be confirmed by the Senate. Although Roy Blunt supports her, local educators and politicians have expressed concerns about her nomination. Vote and then tells us why you support or do not support her in the comments."},{"comment_id":"10152521923501135","commenter_b":"The automakers would like to sell you a new vehicle sooner rather than later.","commenter_a":"Jennifer A. Thompson","post_message":"Do you really need to idle your car on days like today? We separate the facts from the myth. WHAT WE FOUND: @webpagelink"},{"comment_id":"10152907297842507","commenter_b":"look at them idiots......fff","commenter_a":"we need a new classification. White-Black-Latino-Asian-Native American-Loser.","post_message":"Anyone want to weigh in?"},{"comment_id":"1520981961255162","commenter_b":"And this coming from someone that used an \"excuse\" to avoid draft?","commenter_a":"This man is pitiful.","post_message":"Donald J. Trump suggested veterans suffering from PTSD are not \"strong.\""},{"comment_id":"10153812038063984","commenter_b":"We need to demand that our governor 's refuse to accept them in our states !!","commenter_a":"Totally against it.","post_message":"Wow. This definitely makes Obama's plan to accept refugees from war-torn Syria \"nothing short of crazy\" - as Ted Cruz would put it. America could be the next country to face this... Are you against allowing Syrian refugees into the U.S.?"},{"comment_id":"10153389679411350","commenter_b":"the dirty creep is the one defending a perv family Linda!!!!!!","commenter_a":"Why is this even a question????","post_message":"Should TLC cancel 19 Kids and Counting?"},{"comment_id":"1308350412560406","commenter_b":"She looks like a black snowman... Where's her neck..?","commenter_a":"Who cares what this fat cow thinks???","post_message":"Whoopi Runs Her Big Mouth at Mike Pence GETS A BRUTAL RESPONSE! Wow... she should just shut her mouth! Lets get 5000 SHARES if you agree she should be FIRED!!!"}]
