[{"comment_id":"504319243082965","commenter_b":"So many of these republiCANTS are using the same old debunked arguments lol Here let's clear up some bullshit and hopefully reach new dialogue on how to possibly prevent further mass shootings: -we've all seen the \"scaring us into dictorship memes\" Our government is corrupt but giving up on how far we've come as a country just to say fuck it let's start a new government here and deal with THAT transition process instead of getting rid of something that Americans are rightfully pissed off keep killing their kids and neighbors. -Yes, when guns are gone crime will still be a thing. Shootings MAY be a thing. Google search the COUNTRY OF AUSTRALIA and stop lying to yourselves. If you have any solutions for stopping all crime please let the class know motherfucker. For now can we ONLY focus on preventable mass shootings? Less guns means less gun related crime, ...","commenter_a":"But they said guns don't kill people!?","post_message":"Who sold this guy his gun?"},{"comment_id":"1028272853931448","commenter_b":"She wasn't even twerking she was just bn silly joking like she was. Pull up her dress with spanks under Neath......its really not a big deal. If Obama get mad about that he shitty.","commenter_a":"Carlos Aden Carlyle lol","post_message":""},{"comment_id":"1100335149996537","commenter_b":"White people crossing the border are rapist and murderers","commenter_a":"I wish there was some way for me to give him a lift to Mexico","post_message":"Happening right now, police in upstate New York are going door-to-door, hunting for one remaining escaped prisoner from a maximum security prison. The two escaped nearly two weeks ago. The other was shot and killed by police earlier today. Much more tonight at 10."},{"comment_id":"10153468487630530","commenter_b":"To conservative for you liberal","commenter_a":"Big ol lame duck","post_message":"Is Governor Rick Snyder a lame duck in the making?"},{"comment_id":"559978767492171","commenter_b":"This @username guy can be on my tv screen anytime he likes. Hello, there 😍","commenter_a":"Hillary for President!","post_message":"Take a sneak peek at the MSNBC #DemDebate! Hillary Clinton and Bernie Sanders face off tonight at 9pm ET. Here's how to watch: @webpagelink"},{"comment_id":"1068619743164680","commenter_b":"why 'send' them anyplace? Just teach our history & proper methods, uphold the laws of our nation, put teeth n the laws n place, cut off the welfare & they will leave....don't waste any more $ on them....well...maybe a 1-way ticket!","commenter_a":"Gutless flag burner won't show his face Cowards","post_message":"The nerve that Rudy Giuliani touched this week is not merely Obama's anti-Americanism; it is the anti-Americanism of the progressive left."},{"comment_id":"10153543758049753","commenter_b":"i hate this bitch","commenter_a":"You should start packing, so your ready when time comes","post_message":"According to Whoopi Goldberg, America will no longer be such a great nation if Donald Trump is elected. She shared this opinion Wednesday on The View where she stars as a cohost. This is what she said: “I’ve always been an American, and this has always been my country, and we’ve always been able to have discussions. And suddenly now it’s turning into, you know, ‘not them, not them.’ And you know, we have a lot of friends whose parents saw this already. They don’t want to relive this. They... @webpagelink"}]
