[{"comment_id":"1736087096643244","commenter_b":"She can dig as much dirt as she wants. We all see right through her. What a loser.","commenter_a":"Lied and busted on national tv","post_message":"Alicia Machado blames Donald Trump for her two eating disorders..."},{"comment_id":"991233837660061","commenter_b":"Fuck them, go back to the shit hole you crawled out of.","commenter_a":"If our culture offends u get out!","post_message":"First bacon, then bikinis, then beer and now sports fans should watch their ... wardrobe selection so not to offend The Religion Of Peace? @webpagelink"},{"comment_id":"1104177846295508","commenter_b":"@username Actually the major of women that have Abortions are Christian @webpagelink","commenter_a":"thats is because the democRATs favorite sport is killing our unborn babies...","post_message":"There is something very important missing here..."},{"comment_id":"1227346460655830","commenter_b":"This bitch is an idiot.. lol","commenter_a":"Really? Trump wants to end Social Security, Medicare, Medicaid, Food Stamps, and Obamacare! Voting Democrat is the only way to stay alive!","post_message":""},{"comment_id":"507278876143443","commenter_b":"Sorry but I do not understand why faces of those son of bitches are hidden! People should know who they are ....","commenter_a":"Cut them off and save them This is why when they become adults they attack humans!!!!!!!!!!! Ps. We should not be entertained at a circus by animals but actual talent of humans. Animals should be left in their habitat!!!!!","post_message":"Have you ever heard a baby bear's spirit break? THIS is the circus."},{"comment_id":"10153553106522411","commenter_b":"Can i pee on you","commenter_a":"It's sad that in this age for a 15 yr old to be out she is automatically labeled! Times change hell its summer break maybe her parents actually trust her. It's sad that people are blind to the fact that the issue is the guns and not enough enforcement this Lil girl will never come back ever! We live in the number one city in homicide many people know this but few are willing to do something","post_message":"UPDATE: Chicago police are still looking for suspects in the shooting death of 15-year-old Veronica Lopez, who was a passenger in a car on Lake Shore Drive early this morning. Police say she's just one of the victims in what's turning out to be a violent Memorial Day weekend. LATEST DETAILS: @webpagelink"},{"comment_id":"10153720190262894","commenter_b":"She'll always be a ghetto bitch from Chicago","commenter_a":"Read this shit @username gold diggin bitch","post_message":"Wiz Khalifa and Amber Rose Finalize Their Divorce, Hit the Strip Club Together [Video]"}]
