[{"comment_id":"1038174059551348","commenter_b":"@username you are an Idiot and will never Learn !!","commenter_a":"Absolutely! Why don't you just fly away to that new mansion in Dubai, never to be heard from again.","post_message":"Yes, and you should be ARRESTED!"},{"comment_id":"1208229205939996","commenter_b":"CRIMINALS DON'T OBEY GUN LAWS OR ANY LAWS!","commenter_a":"Somebody went postal in Orlando last night. Another mass shooting, our country has so many. I have to have a licence to drive a car, to prove I am not so crazy as to kill people with it needlessly. But any idiotic crazy person can own a gun, or lots of them, with no accountability. The second amendment was not written to cover high capacity assault rifles, designed only for killing people.","post_message":"LATEST: Approximately 20 people are dead and scores wounded after a gunman opened fire and took hostages at a gay nightclub in Orlando."},{"comment_id":"1539276206088035","commenter_b":"Yes,They Love to spend Our Money !","commenter_a":"That's what dems do,,,,spend money they don't have ,,,,,","post_message":"I'm perhaps the best fundraiser for the Democrats. If you want to separate Democrats from their money, tell them that I'm on the march. Tell them that I'm responsible something, and they will start writing checks for money that they don't even have."},{"comment_id":"900759883386314","commenter_b":"Hillary's supporters don't care that she's a sold-out Wall Street neocon. It's weird.","commenter_a":"She is the ONLY person on earth to know how it felt to take that place in history........glad she was the one who knew how to really cherish it for all of us... thanks Hillary... Girl, you rock!","post_message":"When history's in the making, sleep can wait."},{"comment_id":"10156546943220354","commenter_b":"THIS SHAMEFUL........","commenter_a":"What a piece of shit","post_message":"And then he said where he promises to MOVE if Trump DOES win..."},{"comment_id":"1296742057059213","commenter_b":"She is trifling","commenter_a":"This bitch stealing, got caught and now trying to act tough and threaten someone who is working to make a living for themselves. That bitch need to get a reality check and her welfare check taken. Cussing in front of her kid and possibly fighting and then what? Just sad.","post_message":"Rachet behavior at it's finest! #WSHH"},{"comment_id":"1744094332472035","commenter_b":"You fix it by following the laws already on the books and securing the borders. Start deporting anyone here illegally and fine businesses that are hiring them. When they see there's no work for them and we are serious about catching and deporting them most will pick up and leave.","commenter_a":"That's a real question but few are willing to answer without being labeled a bigot or racist. The immigration problem is very real and here is a clear example of how the illegal community drains resources for American citizens.","post_message":"During a heated exchange, Tucker Carlson asked immigration activist Jose Antonio Vargas if it’s fair for illegal immigrants to take coveted scholarships from American citizens. @webpagelink"}]
