[{"comment_id":"10152983460914342","commenter_b":"Good to hear","commenter_a":"When my grandmother got very sick we put her in a nursing home it was bad they make people thing it was the best place ever but it was not after my grandmother passed away that was the only day i saw my grandmother nice and clean ,(.... but now after my dads stroke we have him in a nursing skill facility and is the best of all i being into is call Grace Care here in katy is super clean nurses are super nice the whole staff is very friendly my dads loves this place the way they treat their patients is absolutely amazing i will recommend this place to anyone!!!!!!","post_message":"\"Most people don't realize how expensive this care can be until a parent or family member needs it...and then it's a real shock.\""},{"comment_id":"10154249857386770","commenter_b":"STOP.","commenter_a":"OMG.seriously..and down the toliet bowl we go.swirl, swirl","post_message":"Police officers in a Massachusetts town are no longer allowed to give kids high fives as they enter their elementary school because it reportedly makes illegal immigrants and minority students feel uncomfortable."},{"comment_id":"1106845012659268","commenter_b":"But are they Immigrants???","commenter_a":"Stop the hate!!!","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."},{"comment_id":"10156924916305405","commenter_b":"Kathy ugly woman inside and out. I don't talk to commie vermin!!","commenter_a":"Hillary will become president amidst your persistent digging. Republicans cannot even nominate a republican, the party is a total eclipse. Trump vs Hillary is a mono party.","post_message":"\"I have turned over all my emails…I have been incredibly open about doing that.\" Yet Clinton deleted more than 31,000 emails."},{"comment_id":"1513700471996539","commenter_b":"I agree with a person that wants sources: he is right to ask for them. I did not give some simply because it would take too much time on my part to gather them (about the same it would take to do the research on CRS and FATCA's actual consequences). These are the keywords you want: FATCA CRS money laundering Nevada","commenter_a":"Jumping on the demonize Putin wagon eh, big surprise coming from vice. This has nothing to do with Putin, but I see his name a hundred times. Clearly this leak came from the u.s. How about the American banks laundering drug money, or the us govt selling weapons to drug cartels, or CIA plane crashing full of cocaine, or u.s Senator macconell s boat full of cocaine. Won't touch that, because that's actual truth, stay away from that. Just another propaganda outlet for the u.s government.","post_message":"The Panama Papers were a big deal."},{"comment_id":"10153345787268984","commenter_b":"She's a corn ball","commenter_a":"Yes, She Is Crazy!","post_message":"Christians are ripping Hillary to shreds over this. What was she thinking?? Do you think Hillary's already done enough damage to America?"},{"comment_id":"910131575844085","commenter_b":"It should NOT be given to illegal aliens #1. It should not be a life time money train #2.","commenter_a":"Unfair.The middle class working people can no longer pay for these people to watch TV all day and do nothing. Now when we die out because of Obamcare.they too will die behind us.","post_message":"Welfare recipients just got hit with some devestating news. The party is coming to crashing halt. Do you think it should be illegal to live off other people's hard work?"}]
