[{"comment_id":"10157063927485725","commenter_b":"#ByeByeCrookedHillary","commenter_a":"Wipe terrorism off the map...so many countries suffering...and who knows...without TRUMP we WILL be next...TRUMP 2016","post_message":"Thank you Lt. Steven Rogers. We will respond to terrorism with strength in 2017!"},{"comment_id":"10153129046736051","commenter_b":"The border is broken and Obama wants everyone to come on in. Breakdown between law enforcement agencies. I agree with Trump. Build a damn wall. I live in a border city. Luckily we don't have a big problem but now we have to worry about middle eastern people.","commenter_a":"That's a Dad who will have nightmares the rest of his life! May God be with him. What a beautiful young woman! What the hell is wrong with our country?","post_message":"This woman's dad had his arm around her when they heard the pop. As she collapsed on the ground, he could hear her repeat the same thing over and over again: \"Dad, help me, help me.\""},{"comment_id":"10153809290224753","commenter_b":"She's a greedy mama! She's pathetic!","commenter_a":"Why do people keep making this disgusting family rich? They have no talent, nothing but yet people are infatuated with them please STOP talking about them, no one cares what they do!! And let's not start with that disgusting Jenner dude/lady wanna be","post_message":"Kris Jenner is ready to cash in on son Rob Kardashian and Blac Chyna’s surprising baby news. According to a new report by People, Jenner is reportedly looking at Kardashian and Chyna’s pregnancy from a “financial perspective” and is seeing some major dollar signs both for herself and the newly engaged couple. While some of the Kardashian and Jenner family were a little skeptical over the news that Rob and Blac are preparing to give Jenner another grandchild, People revealed that “Kris is... @webpagelink"},{"comment_id":"1188535021166526","commenter_b":"This is ridiculous! Impeach her and be done with this !","commenter_a":"\"Just because 5 Supreme Court judges make a ruling, it not a law,\" said Kim Davis's 4th and evidently very well-read husband","post_message":"Kentucky clerk Kim Davis’ husband Joe says his wife will never resign and calls out the judge who ordered her behind bars. @webpagelink"},{"comment_id":"10155627747429778","commenter_b":"Suck it up snowflakes","commenter_a":"So great!","post_message":"#BREAKING Donald Trump surpasses 270 votes in Electoral College to officially win Presidency"},{"comment_id":"10153385020755329","commenter_b":"don't talk that way about yourself.","commenter_a":"Pathetic idiot","post_message":"\"Growing up, I thought of Bruce Jenner as the kind of man I could never become. Now, I think of her as the kind of woman I try to be.\""},{"comment_id":"1042921652395512","commenter_b":"Clams don't eat salt. That's its foot anyway.","commenter_a":"Now who wants to lick salt off a clam","post_message":"It's easy to forget that shellfish are animals ... until you see something like this."}]
