[{"comment_id":"786447821458391","commenter_b":"And that woman belongs in a jumpsuit behind bars so what's your point","commenter_a":"Only people with dignity responded! The rest???? This man belong to a mafia organization! Not the White House!","post_message":"Former anchorman Dan Rather has issued a challenge to his colleagues: \"This cannot be treated as just another outrageous moment in the campaign.\""},{"comment_id":"1331908300162530","commenter_b":"This is disgusting, disgrace to America this never happen before, DJ.T is disgrace for our America, so dangerous wild animal.","commenter_a":"He is right! We unfortunately live amongst animals!!","post_message":"Trump said organized 'thugs' shut down his First Amendment rights in Chicago"},{"comment_id":"10153395954276051","commenter_b":"It's a deformed pig fetus.","commenter_a":"Yea right.","post_message":"When a woman found this bizarre creature in her backyard, she was completely horrified."},{"comment_id":"10155065257093984","commenter_b":"There is no doubt Israel or Jews were there first. As far back as 2166 B.C., some say as far back as 4000 B.C.. Arabs or Muslims first recorded being there 853 B.C., Mohammad wasn't born until 570 A.D..... The size of Israel is 12,877 Sq. mi. about the size of New Jersery... The size of Arab, Muslim land is 8,368,272 Sq. mi., and consist of 20 countries. That would be the size of putting together (Texas and Alaskas) 8 times.... Over the years Muslims have attacked Israel, even combining countries to fight Israel and have lost every time to Israel's strong military. During peace talks, Muslims have never given up anything to Israel. Whereas everytime Israel has given up land to Muslims, they have used the land to move closer for attacks against Israel. Muslims do not want peace with Israel. They have said they will not coexist with ...","commenter_a":"NBC is one of the least creditable news sources. The beat goes on ! Time to boycott them.","post_message":"Talk about \"fake news!\" Here's how NBC was just BUSTED in a massive lie designed to make people think less of Israel. Here's what they had to say that has a lot of people outraged... This proves EXACTLY how the mainstream media feels about Israel..."},{"comment_id":"895683467194573","commenter_b":"He's not crazy, his mother had him tested!","commenter_a":"I know he's an idiot","post_message":"President Paul?"},{"comment_id":"10154898475594657","commenter_b":"Trump Beat Trump.","commenter_a":"Bunch of lying scumbags! They've always known that Trump was going to crush them. They scurry around like the rats they are, searching in vain, for a way to beat Trump! TRUMP 2016!!!","post_message":"\"All of us shouldn't even have answered that question.\""},{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"}]
