[{"comment_id":"1009117072471350","commenter_b":"How typical for illegals to play the race card while obviously not understanding the term racist.","commenter_a":"No one in their right mind should support Trump","post_message":"Add Lindsey Graham to the list of Republicans who say they will not support Donald J. Trump."},{"comment_id":"527878314072059","commenter_b":"Put her in jail!!!!!!","commenter_a":"To recap: Hillary is \"the devil\" and has \"hatred in her heart\" and Trump is going to appoint a special prosecutor to \"put her in jail.\" This is how a democracy slouches into totalitarianism.","post_message":"Your reaction to the second presidential debate?"},{"comment_id":"1005094719524280","commenter_b":"Well lets send Trump to the southern border...im sure he will find all the rapists he is looking for....as matter of fact he should say to the all latino people in their faces,..you all bring nothing but rapists here....im sure when people came thru Ellis Island to start a new life Trump would have greeted them as well.","commenter_a":"Too bad the Coast Guard isn't on the southern border. The Cubans are actually fleeing a dictatorship.","post_message":"A USA Today reporter observed a U.S. Coast Guard crew intercepting Cuban rafters attempting to reach freedom on U.S. shores. Despite the recent news of normalizing relations between the U.S. and Cuba, these rafters were sent back to Cuba before they could celebrate on the 4th of July."},{"comment_id":"10154724312199486","commenter_b":"Yes come here and get shot!!! That will have them flooring in!","commenter_a":"Chicago will soon see that President is higher than Mayor...Fucktards!","post_message":"NAILED IT."},{"comment_id":"1019570198153414","commenter_b":"She's a Witch!","commenter_a":"@username is showing us what a doucebag he really is. Desperate for people to believe such utter non-sense. Common Sean, the real hurricane is YOU for posting this as you are so full of hot air. lol The truth is \"The Ads were pulled when the news of the hurricane was brought to life not the other way around\" Trying to politicize an unfortunate event is plain evil and you posting this stuff to draw attention in the wrong way is absolutely @username like.. SAD Americans being fool by you.","post_message":"Absolute ghouls."},{"comment_id":"10153473976261438","commenter_b":"Shut the fuck up attention whore","commenter_a":"Trump for president. Enough is enough, its time to get tough. Make America great again.","post_message":"What if Trump's polling ceiling is much higher than we thought?"},{"comment_id":"10153756353381337","commenter_b":"Samantha, I am aware of the defintion. Just telling you its irrelevant. It's a stupid term made to put people down for making different choices.","commenter_a":"Taylor swift is a hoe she goes thru like 4 boyfriends a year","post_message":"IT'S OVER: Taylor Swift allegedly dumped Calvin Harris because of an, ahem, \"massage\"..."}]
