[{"comment_id":"10153126028062235","commenter_b":"Shame on her !!!","commenter_a":"Oh please! Hahahahahah!","post_message":""},{"comment_id":"10153237839494203","commenter_b":"Marxist Feminists are ugly and nasty.","commenter_a":"Would you describe a man as \"testy\", Daily Beast? Thought not.","post_message":" can spin her way out of this. She can explain her way out of this."},{"comment_id":"10153068492709411","commenter_b":"Thank heavens...............one revolting misogynist pig gone, but alas another is replacing it.","commenter_a":"RIP","post_message":"BREAKING:"},{"comment_id":"10156669278135354","commenter_b":"Evil disgusting whore","commenter_a":"GRANNY couldn't tell the difference between LOVE and KINDNESS if her life depended on it!!! Her own husband had to go find love in someone else's arms cause she knows NOTHING about love!!!!!","post_message":"There was no \"love and kindness\" in Hillary's lies about Benghazi. It wasn't \"love and kindness\" when Hillary transferred 20% of US uranium to Russia for $145 Million in Clinton Foundation cash. \"Love and kindness\" don't describe her treatment of Bill's sex victims. Exposing US secrets through your server and destroying emails isn't \"love and kindness.\""},{"comment_id":"1437658776254148","commenter_b":"Go home burn your drunk","commenter_a":"Think its time we start saving the tax payers money and get all these corrupt career politicians out of office! These hearing are a waste of money when the system is rigged for them when they pick people like Lynch! She was picked solely on how she could withstand what she went through! Trump is real change! America needs these corrupt politician gone!","post_message":"\"Together we have begun a political revolution to transform America and that revolution continues,\" Sanders said in his endorsement of Clinton."},{"comment_id":"10153993909761491","commenter_b":"A women should be happy she has big tits-men will ne ef stop looking at her","commenter_a":"I got chastised by a femminest about 3 months ago for saying that it was a crime against man","post_message":"\"I chose surgery because of how I felt, not because of what anyone else thought.\""},{"comment_id":"1330832217009829","commenter_b":"Madoff needs a roomie.","commenter_a":"Lying sack of ----.","post_message":""}]
