[{"comment_id":"10154467987919342","commenter_b":"Ban cars. They kill more people than guns.","commenter_a":"Guns. Taking people's lives needlessly everyday because we let anyone and everyone have them. Not it's not a mental health issue. It's the acceptance of daily gun violence in our society. People will read this story and move on. Congrats NRA. Kill more Americans daily for our freedom to own guns. #GunsHaveMoreRightsThanPeople","post_message":"#Breaking: I 69 at Spur 527 is completely shutdown after a minor accident led to a deadly shooting."},{"comment_id":"1813322542237935","commenter_b":"Then what makes her capable of running our country","commenter_a":"Mrs Magoo👹","post_message":"Hillary Clinton tells the public: Don't bring up my health! Then she tells the FBI: My health kept me from remembering the answers to your questions!"},{"comment_id":"538835082988240","commenter_b":"Yes it would 😂 cause you a hoe","commenter_a":"@username this is how we would be with Mr kitty 😂😂","post_message":"\"I pay puppy support...\""},{"comment_id":"10154303006941636","commenter_b":"Ted I'm pretty sure that the home grown rapist far out weighs the immigrant/refugee rapist...all you people blaming all crime on immigrants and refugees must have been living in lala land cos I can't speak for Sweden but all of those crimes were in the U.K. Way before this flood of people hit britains shores","commenter_a":"Nothing to do with wanting their sovereignty back and not being dictated to by unelected EU bureaucrats? Good grief, this page is a shocker!","post_message":"According to a new study"},{"comment_id":"10155004778474136","commenter_b":"This woman is a nut case.","commenter_a":"Skimmers...","post_message":"\"I think he is leading himself into that kind of position where folks are beginning to ask what are we going to do and the answer is going to be, eventually, we have to do something about him,\" Maxine Waters waters said of President Donald J. Trump. FULL STORY: @webpagelink"},{"comment_id":"10153633951734170","commenter_b":"They are undocumented aliens.","commenter_a":"I find the term \"undocumented immigrant\" offensive. The press should stop using it.","post_message":"Epic VIDEO. Trump slams the proverbial door on a reporter who warns him that the term \"Anchor Baby\" could hurt someone's widdle feewings."},{"comment_id":"10152991332957377","commenter_b":"He is a lot weaker. Building a WAll is a lot cheaper then paying for all the illegals and their so called benefits!","commenter_a":"jeb cant carry his own state.","post_message":"Jeb Bush fights back..."}]
