[{"comment_id":"1737156569841341","commenter_b":"Me too, streamed. He handled disrupters well.","commenter_a":"Loved it, not like being there but watched it live. Trump you are predestined to be our next President.","post_message":"I LOVE YOU NEW YORK! Thank you for a terrific night, ALBANY! LETS GET OUT & VOTE TRUMP next Tuesday, April 19th -- and lets WIN, BIG LEAGUE!"},{"comment_id":"1766246316922622","commenter_b":"@username don't be nervous I'll only use My 2nd Amendment if you were to try to come into my home & try to harm my Family. I'm a nice guy. Now you're saying that other country's are doing just fine without Guns? Lol NO NO NO!!! Do you see what the hell is going on in Europe with the Muslim invasion or did you forget to Mention that part? The Europeans are telling us NOT to ever give up our GOD Giving Right of the 2nd Amendment. There homes are being invaded there women & children are being Raped & the FUKIN Government are sitting back & watching it all OH & they now have a Muslim PM. Something doesn't smell right wouldn't you agree? Just like I said they take your guns so when they come like they're doing now in Europe you won't be able to defend yourself. ...","commenter_a":"You gun loving Americans are so funny. I will bet all I have, that if one of you ever find yourself in a situation like the one this douche bag is referring to, which 99,9 to 100 % of you never will, you and your gun won't do anything but piss your pants. Guns would not have stopped this, nor any other terrorist attack, just like guns isn't stopping anything in your country, quite the opposite in fact. You won't see european people from Copenhagen, Paris, Brussels or any other high risk cities demand a right to carry guns, because we don't want to, because we know it don't work and because we are not stupid. Trump is a freaking idiot and sadly many of you Americans are brainwashed and scared so easily. I really really hate using the over used and annoying word, sheep, but that is what you ...","post_message":"At the National Rifle Association convention, Donald J. Trump said the Paris attacks may not have happened if people had guns to take down the terrorists. @webpagelink"},{"comment_id":"10153702607362014","commenter_b":"Heck yes I'll be trying this!","commenter_a":"This makes me think of good luck Charlies Bob-burrito lol","post_message":"It's the hybrid you've always hope for (or quite possibly not)."},{"comment_id":"10153283660836770","commenter_b":"This woman is an utter moron! There's more people watching the GOP debate tonight than all the democratic debates!","commenter_a":"Freud would be laughing at DWS totally projecting on the GOP.....exactly what she has been doing .....burying dem debates on Saturday nights!","post_message":"Democratic National Committee (DNC) Chairwoman Debbie Wasserman Schultz tweeted Saturday night suggesting the Republican Party was “trying to hide” a debate by scheduling it on the same weekend as the Super Bowl."},{"comment_id":"1143931678960194","commenter_b":"Say Ms white woman...dismissed!","commenter_a":"Idiot!!!! Every race suffers racism!! And all lives matters. Not just blacks. An American is an American! I'm not a Caucasian American! They shouldn't say African Americans either. Get with this century!","post_message":"Clinton: \"We need to acknowledge some hard truths about race and justice in this country, and one of those hard truths is that that racial inequality is not merely a symptom of economic inequality. Black people across America still experience racism every day.\""},{"comment_id":"1244580435606816","commenter_b":"GET THOSE ANIMALS OUT OF HERE ....PLEASE PEOPLE GET THEM OUT.!!!","commenter_a":"30 minute response time? Sounds like they were having their dinner first.","post_message":"So grateful, so eager to assimilate..."},{"comment_id":"10152794611951636","commenter_b":"It is just that!.we women have no say....we just get on with it!.","commenter_a":"Really?? A marketing campaign for icecream?? You don't know half of what happens .","post_message":"We’re not supposed to break the silence and secrecy surrounding women’s bleeding bodies..."}]
