[{"comment_id":"1113874841966859","commenter_b":"Beck, that British English is English English, as in the correct way to speak ENGLISH. ;)","commenter_a":"I’m with everyone else, “Learnt”?","post_message":"How many of these were you taught?"},{"comment_id":"10150664369884999","commenter_b":"Rule of thumb: Economists don't generally have armies at their disposal to help overthrow democratic governments who oppose their \"theories.\"","commenter_a":"You'd think true conservatives would be happy about the expansion of rights (gay marriage) and making sure everyone chips in on the healthcare system everyone uses (Obamacare). I guess they're not conservatives, just simple Republicans.","post_message":"The way some Republicans tell it, America is a pretty awful place these days."},{"comment_id":"928696510523431","commenter_b":"She should think about buying a woman's breasts.","commenter_a":"This girl can actually sing. Not sure why she does these things. Pointless, & invalidates her as an artist.","post_message":"Miley Cyrus shares naked tub pic"},{"comment_id":"1020621978034054","commenter_b":"Queen of England? LOL... She's such a jokester, a desperate one.","commenter_a":"Why should anyone stand with him? No reason to","post_message":"Sarah Palin doesn't stand with Ahmed."},{"comment_id":"775594199191746","commenter_b":"You should be in a burka, you slut.","commenter_a":"I suppose next the religious right will insist that women wear burkas next. They're getting more and more like muslim terrorists every day.","post_message":"“Somehow my shoulders are sexualized? Like it’s my responsibility to make sure the boys’ thoughts are not unclean.”"},{"comment_id":"10155208741709255","commenter_b":"These people need to go!!!","commenter_a":"Cowards","post_message":"Face the music, fellas."},{"comment_id":"10153296243781130","commenter_b":"So if this chick had aids and she was bleeding all over, that's cool right?","commenter_a":"And in the meantime virtually no attention was paid to the actual winner of the women's race, Tigist Tufa. Instead the media focuses on this woman and her disgusting stunt. Why am I not at all surprised that Huff Post jumped on the bandwagon.","post_message":"\"Periods are here to stay, and our generation has the power to put this conversation on the map today in order to blow through stigma.\""}]
