[{"comment_id":"951958574839238","commenter_b":"These fuckin nazi like pigs make me sick my family came running from this 50 years later now look what the fuck is goin on the fourth reich vultures of america be killing our most loyal friends. Howcome We cant hurt their fukin dogs but they can jus come blast ours away word is bond kill my dogs look the fuck out","commenter_a":"Yanky fuckin cops","post_message":"This video is one of the most cowardly acts you will ever see. The poor dog was scared, ran and hid behind a table, and then was executed by a coward with a badge. The Free Thought Project.com (Y)"},{"comment_id":"1270203316353471","commenter_b":"she cant and is a skank","commenter_a":"Say what you want about Miley--those pipes of hers are GOLD. period. And, she's been a sole advocate of LGBT and homeless rights. She's young and finding her voice but good for her for wading into the advocacy pool! Applause!!","post_message":"She may be an attention seeking diva with a voice like nails on a chalkboard, but she's also a politically active advocate for women's rights who despises Donald Trump."},{"comment_id":"10153092045117756","commenter_b":"there is no place around here seems like most females prefer dating sites i think","commenter_a":"screw dating sites they dont work","post_message":""},{"comment_id":"723507841151844","commenter_b":"Now her dumb ass should know better 😂😂😂","commenter_a":"@username @username bruh lol","post_message":"This pretty much sums up my life #WSHH"},{"comment_id":"851850534874696","commenter_b":"Loads of respect for her now:) well done woman! Anything to wind those twats up makes my day","commenter_a":"Good","post_message":"Selena Gomez sparks fury by violating religious dress code in mosque."},{"comment_id":"945724052142706","commenter_b":"Why would anyone vote for Hillary though? She's worse","commenter_a":"How could any Americans ever vote for a bigoted, vulgar, narcissistic billionaire who lies about almost everything and has advanced no policies or arguments other than strong and smart enough to do it. This is what happens when you get voters whose worldview consists of \"The Apprentice\", \"Keeping Up With the Kardashians\" along with \"Fox and Friends\". The masses of stupid going to the polls, very scary indeed.","post_message":"Donald Trump is on the verge of winning the Republican National Committee nomination, as the party plummets into a civil war that could destroy it entirely."},{"comment_id":"10153532910231336","commenter_b":"It's a food product, not plastic. Keep it real.","commenter_a":"It's not even real cheese anyway!! People, you're eating flavored plastic to begin with!","post_message":"RECALL ALERT: 36,000 cases of Kraft Singles cheese slices recalled after customers reported choking on the plastic wrapping. (via Fox Business)"}]
