[{"comment_id":"10153206229641336","commenter_b":"You Carol, are a Goddess if you can swallow that orange whole! Puh-tow!","commenter_a":"Great. We need someone like him. He gets my vote.","post_message":"Vermont Senator Bernie Sanders is set to announce his decision to run for the Democratic nomination for the presidency as soon as Thursday, according to multiple reports. @webpagelink"},{"comment_id":"1179437002118415","commenter_b":"How about black miss America ,didn't see any white girls","commenter_a":"Isn't BET racist because there's no white people nominated? Why do they have the right to protest the Oscars while holding black only awards programs?","post_message":"Disgusting! Actor Spews Anti-White Racism At BET Awards CROWD GOES WILD (VIDEO) I've never seen such clear racism be allowed on TV before, wow. Lets get 1000 SHARES if you AGREE BET is a RACIST network"},{"comment_id":"620704854748480","commenter_b":"agree","commenter_a":"Agree","post_message":"Enough said."},{"comment_id":"987929541300100","commenter_b":"You guys just don't know anything about Muslims! !!!! Wake up.America they will take over your land People are clapping for her for what????????","commenter_a":"Should be concerned about all Americans instead","post_message":"Watch: Bernie Sanders teaches Republicans a lesson on how to respect Muslim Americans and end racism in America."},{"comment_id":"606223439551496","commenter_b":"Cough cough a lady? Your kidding me! She is one of the most evil murderous woman alive.","commenter_a":"Oh yes Vicente like a mother that does nothing. One who allows her children to run amuck without obeying any rules or following the law. One who lies and deceives others for her own monetary gain. A mother who blames others for her mistakes. Yes Former President Vicente Fox this is your kind of Mother. Your people would continue to invade America. Our country would suffer greatly. Your drugs would kill and maim our children and others. She is just the Mother for you. However in America we want a different leader. We want Donald Trump. He will protect and defend America where others would not.","post_message":"\"I envision the presidency of the United States to be like a good [loving] and caring mother, a real lady,” said Vicente Fox."},{"comment_id":"10156725914675093","commenter_b":"Trump gonna go all the way...There's no stopping the Trump Train!","commenter_a":"I really like watching all you rpublicans running in circles..HA...HA....HA HA!!","post_message":"Other Republicans say we should protect the Constitution. Ted Cruz has actually done it; indeed, it has been the animating passion of his career. Read the full editorial in the link & vote in our poll at the end!"},{"comment_id":"10156651164980551","commenter_b":"Dame this women looks alot like Natily wood","commenter_a":"Mine, too!","post_message":""}]
