[{"comment_id":"813666455490598","commenter_b":"And she needs to dump her shit in the jungle","commenter_a":"I am so sick of reading about her ,she probably spent more money then all the first lady's in the last few years ,she thinks her shit don't stink now well I got news for her it does .","post_message":"What Michelle Obama Was Just Caught Doing With Her Daughters Will Make You FURIOUS She is the worst First Lady in history. Are you ready for the Obama family to be out the White House?"},{"comment_id":"10153933427867235","commenter_b":"Shouldn't she be looking for baby daddy #3 instead of being an idiot?","commenter_a":"Barstool--shut up and go try to figure out who your latest baby daddy is.","post_message":"She said, ‘Not everyone gets a trophy.’"},{"comment_id":"10154450520586320","commenter_b":"Well said Claudia","commenter_a":"own it. you have ignited and stirred the kettle and walked away. you have failed to address the real crimes of black/black murders happening every day in your 'home town' of chicago. you are perpetuating a false narrative to strip the local police from doing their job, create chaos and mistrust. own it for once and stop blaming everyone else.","post_message":"President Obama is to address the #BatonRougeShooting where 3 police officers were killed."},{"comment_id":"10154823227721162","commenter_b":"Africa still enslaves it's own people, but ok white people are the problem hahaha","commenter_a":"The kicker of the team is a black female this is clearly raciest read the article people ...you would be offened to if you where made fun of in such a manner comparing you to a gorilla but its funny and people are too sensitive because its not directed to you or your race #facebookBigots","post_message":"RACIST POST? The photo shows a white young woman hugging someone in a gorilla suit."},{"comment_id":"1044417148951095","commenter_b":"Ignorant bitch","commenter_a":"It's not people like this woman that scare me, it's the people that agree with and support her.","post_message":"Oh, and climate change is a hoax too!"},{"comment_id":"10154018676368701","commenter_b":"If she used a gun and shot the fleeing perp then she should get off free and clear ! The cops do don't they !","commenter_a":"Sadly, if it was a gun she would be facing attempted murder charges in shooting a fleeing suspect. Since a car is a lethal weapon, it wouldn't be surprising if they decide to charge with something comparable. Property is not worth life, ever","post_message":"Police credit the octogenarian driver with leaving damage that helped officers identify the thieves car and apprehend them."},{"comment_id":"10155398572138797","commenter_b":"The man never said it doesnt happen in the white community. But its not \"white history month\" he was pertaining to this month and what the race can do to honor their dedicated month. He did not say anything about tje white people not killing. Oh wait thought blacks killing blacks is justified right? The constant drive bys and convictions is oj because of your race? How about we say how about all the ghetto gang bangers and the wanna bes stop killing to honor this month whether black or white a thug is a freaking thug. Whites killing whites needs to stop also but we do not have a month dedicated to our history whether it be polish irish English. We will take gary and Chicago and all the mindless killing what race is it primarily? Oh wait its ok or white people's fault.","commenter_a":"I have an idea maybe for Black History Month. The young black kids can stop killing each other. But of course that won't happen.","post_message":"BLACK HISTORY MONTH: Today, and all month long, join us in celebrating the achievements, culture and contributions from black Americans across U.S. history."}]
