[{"comment_id":"10156425606485725","commenter_b":"Lol Caitlyn Jenner beat you as Most Fascinating Person. Lol Loser","commenter_a":"This is a cool post Donald ! I haul livestock so unfortunate'ly wasn't able to watch the show ! Really cool you post the neatest stuff!!!","post_message":"You do not want to miss Barbara Walters 10 Most Fascinating People of 2015 tonight at 9:30pmE on ABC! ENJOY!"},{"comment_id":"10157311512285294","commenter_b":"So... she's not a plagiariser, she's a liar. Guess her and Hillary have something in common after all.","commenter_a":"But didn't Melania say she had no help? Now this? I'm confused I call bull on this one","post_message":"\"I asked to put out this statement because I did not like seeing the way this was distracting from Mr. Trump's historic campaign for president and Melania's beautiful message and presentation.\""},{"comment_id":"838910662903525","commenter_b":"@username Take your temper tantrum elsewhere! Hillary's got this! #HillYes","commenter_a":"LOL JK BUILD THE WALL DEPORT THEM ALL TRUMP 2016","post_message":"I was so moved to receive this honor from Puyallup Tribal leaders."},{"comment_id":"1323629084344227","commenter_b":"and pretty much any woman could be a better president than Hillary.","commenter_a":"Not only can a woman be president but Hillary can be a better president than most men in fact the only MAN that can be a better president than her IS Bernie","post_message":"Stay classy, Bernie fans!"},{"comment_id":"1062730680414093","commenter_b":"Donald trump can't even get 35% registered republicans Please do the math Trump can't win a general Election. You remember my words I'm not being nasty\" just call it in the know. You will find out I'm correct.","commenter_a":"This is for all of my fellow Florida voters. I just received my mail in ballot. Donald Trump is on the very bottom of the list, so please be careful and select him.","post_message":""},{"comment_id":"986689444723866","commenter_b":"She's an idiot","commenter_a":"She's as smart as a bag of hammers. Attention seeking dweeb.","post_message":"Wait until you see this."},{"comment_id":"564263730449143","commenter_b":"She prolly snuck it in in her lady part","commenter_a":"Pam murdered Russ Farias wife Betsy and framed Russ","post_message":"Pam Hupp charged with murder - O'Fallon, Missouri Police and St. Charles County Prosecuting Attorney's Office hold a press conference on charges related to last week's shooting. Hupp has been charged with 1st degree murder in the shooting death of Louis Gumpenberger. She was arrested Tuesday. She was a central figure in a highly publicized murder trial covered extensively by Fox 2 News."}]
