[{"comment_id":"1269429443084021","commenter_b":"I prefer the lady in the center.","commenter_a":"I bet I can tell you which one sells the most copies haha.","post_message":"For the first time ever, there are three different Sports Illustrated Swimsuit covers – representing women of all shapes and sizes. @webpagelink"},{"comment_id":"1826661334287644","commenter_b":"These two comments made me laugh out loud!","commenter_a":"I didn't see Elizabeth Warren in there...","post_message":"Can you imagine seeing this in the distance? Unbelievable..."},{"comment_id":"10152782539256130","commenter_b":"It would take the entire roll of toilet paper for some women. Hell I go through super plus tampons with a super extra maxi overnight within 2 hours bc I have PCOS. I was homeless and LUCKILY people donated to the shelter and I was usually able to have what I needed. Sometimes I didn't but I would go sit in the day labor office with a bunch of homeless men, I was like the only woman there, while I was on my period, bleeding through my clothes just to go do manual labor all day so I could make $30 to buy what I needed. I fucking hate asshole people.","commenter_a":"Growing up poor, you learn to use other methods. Guess what's free and in bathrooms everywhere? =p","post_message":"Pads and tampons are often what homeless women ask for the most."},{"comment_id":"1722122661395846","commenter_b":"White people'n 😂😂😂😂😂😂😂😂","commenter_a":"Just White people..White people'n","post_message":"What...is...this?"},{"comment_id":"1670513393170878","commenter_b":"Hey he's jerking with his shit as lube on his pussy","commenter_a":"Wow it takes like 15 or more cops to take down 1 fucking guys.....pussy as pigs","post_message":"The most glorious thing we have ever seen. #thinblueline Footage from moments ago when protestors shut down HWY 70 near our shop. When the SHTF make sure you have the right SH*T @webpagelink"},{"comment_id":"1100039356678391","commenter_b":"Worthless; wait, that's an insult to worthless people......","commenter_a":"what an idiot the reason for this is all the race baiting he and Sharpton an d Holder and his other mouth pieces have preached and preached while they comdemn America.","post_message":"What happened in Ferguson, New York City? Doesn't matter where it is, it's the result of slavery. It is the result, lingering effects of slavery, Jim Crow."},{"comment_id":"869922156376214","commenter_b":"And this chick got her hair pulled and sat on","commenter_a":"This cop is a asshole point gun on kids wtf!! Is wrong with this pig!! His a punk bitch with a badge!!","post_message":"This cop should be prosecuted to the fullest extent of the law, not let off with a loophole. WTF?!"}]
