[{"comment_id":"1129911067026242","commenter_b":"Well said my friend....well said!! Megan Kelly WILL tear them apart...no doubt about it!","commenter_a":"Oh trust me they are in for a rude awaking during this interview. Big mistake if they think it will be a walk in the park. Megyn Kelly will rip them a new one. She is awesome at her job and takes no prisoners. Fox News is the only station not on Obama's payroll. ( not that this has anything to do with him) but it's the only news station were you can expect to hear the truth!!!! Love Megyn and Fox!!","post_message":""},{"comment_id":"262360004194462","commenter_b":"It's a bad photoshop job","commenter_a":"Ewww !! Haha","post_message":"TELL US IN THE COMMENTS!"},{"comment_id":"10153096190609614","commenter_b":"What kind of women gives up their child?","commenter_a":"Great daddy! This baby is so LUCKY to have such loving and loyal to baby kind of daddy!","post_message":"After this baby mom abandoned him because he was born with Down syndrome, his father stepped in to raise the son he calls and as a single dad. Leo Forrest was born in Armenia last month. Upon learning of the genetic condition, his mother and her family gave up on the child. They also told Samuel Forest he would no longer be welcome in their home if they decided to keep him, according to a GoFundMe page set up to help Forrest and the baby. Faced with a difficult choice -- his wife or his infant son the new father chose Leo. She has since filed for divorce, he says. Forrest is returning to Auckland, New Zealand, where he is originally from, to raise the baby. Read KTLA story here: @webpagelink"},{"comment_id":"1859080321003763","commenter_b":"@username IDIOT!! No brains!!","commenter_a":"Don't give them the attention they want......they are not America they are not speaking for me!","post_message":"Protesters shut down dc"},{"comment_id":"970527739636683","commenter_b":"Didn't notice the theme until I read the headline, after inspecting the goods.","commenter_a":"I don't see any injured vets? just hotness!!","post_message":"\"I'm not giving them back their confidence. They already have it.\""},{"comment_id":"10153436441037439","commenter_b":"STFU mooslins and go back home.","commenter_a":"Not me Jesus is Lord.We are not under any bondage to fear any thing.They are fighting a losing battie.","post_message":""},{"comment_id":"10152880338496636","commenter_b":"Says the white woman...","commenter_a":"Personally I think if the tribes want it built, the tribes should pay for it. It doesn't bother me one bit sitting unfinished and there are so many other things the state could spend the money on. How about paying our teachers a decent wage.","post_message":"You probably driven by this empty building. It had thousands of dollars poured into it, but it still sits as an empty shell. Thanks to a bill Gov. Mary Fallin signed, that may be changing soon."}]
