[{"comment_id":"729261537208194","commenter_b":"Not for criminals!!! More sheeple...","commenter_a":"When is everyone going to realize that gun control laws only apply to the law abiding citizen's? Criminals could care less what law is out there that says something is illegal, such as murder, drugs, ect.","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.” Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"1541756345884108","commenter_b":"Needs to be castrated","commenter_a":"someone please castrate this idiot","post_message":"The 'abhorrent' paedophile has been jailed for just THREE years"},{"comment_id":"897694810421095","commenter_b":"They don't belong here. We are just a safe place until they can outnumber us and overpower us","commenter_a":"She can leave.","post_message":"This is what happened when she refused for the National Anthem. If you don't respect our country, then you can leave. Do you think she should pack her bags?"},{"comment_id":"1043158469105219","commenter_b":"That's the spirit. Women, don't let anything keep you from making sandwiches!","commenter_a":"Suck it up buttercup,not everyone likes tattoos..","post_message":"'I don't understand how tattoos can stop me from making a sandwich'"},{"comment_id":"10153458308386336","commenter_b":"He'll build housing for the illegals on it.","commenter_a":"this man should be named adolph hitler.","post_message":"Despite Republican resistance, Pres. Obama announced the creation of three national monuments, encompassing more than a million acres of protected sites in Nevada, Texas and California."},{"comment_id":"10154962501399609","commenter_b":"And I love Mexican women too.","commenter_a":"This will bring in more money for our economy and more jobs to the US and lessen our trade deficit with Mexico. The demand for US products will go up and continue to stimulate our economy. Finally, we have a president making decisions that loves Americans and his country.","post_message":"JUST IN: President Trump wants to pay for the border wall by imposing a 20 percent tax on imports from Mexico. @webpagelink"},{"comment_id":"741928785958028","commenter_b":"Stop calling it \"OBAMACARE\"! It's the AFFORDABLE CARE ACT!!!","commenter_a":"The people that voted for Trump knew that this repeal was part of his plan. You voted for him, don't cry now. Suck it up. Unfortunately the ones that didn't vote for him have to suffer too.","post_message":"The American people know that this is a matter of life-or-death, and they're letting Republicans know it."}]
