[{"comment_id":"10152682791936167","commenter_b":"The thing that pisses me off is he gets paid for his bullshit!","commenter_a":"That rules him out.","post_message":"How Rush Limbaugh talks about female politicians:"},{"comment_id":"10153832600184087","commenter_b":"She is simply unwilling to burn her country to the ground with a Trump presidency. That makes her a phony? Good grief.","commenter_a":"Elizabeth Warren is a phony. I am so disappointed. I wish I had never donated to her campaign. She is trash. They can put her on the ticket as their little bone to throw at progressives, but I am not biting. #stillSanders","post_message":"Elizabeth Warren will meet with Hillary Clinton Friday morning just hours after hinting she would be open to being Clinton's vice president."},{"comment_id":"10153647913121051","commenter_b":"@username, Bitches and N***** 'are' two different words....sentence formulation goes a long way towards making one look less uneducated","commenter_a":"Hope the black girl punches the radio when rap artists use that word and call other women bitches","post_message":"Some people say this girl's angry reaction was justified. Others disagree. Decide for yourselves who is right."},{"comment_id":"10154356227669641","commenter_b":"Females have orgasms? ;)","commenter_a":"Is everyone who is reading this so dumb or is it just me? The comments seem to be coming from people in deep sleep. OK for starters let's all read the post in detail again then re-align comments.","post_message":"What is the actual purpose of the female orgasm?"},{"comment_id":"1160749183945110","commenter_b":"Lol, the next president will be Hillary!","commenter_a":"One of candidate from these group will be the next president of United of America. The name of that candidate is ......................... ?","post_message":"Here's what some of the candidates have been up to."},{"comment_id":"10152778500617093","commenter_b":"@username lol! I saw this earlier. Had me crackin up. She was playin NO games with him","commenter_a":"He may not see it now but when he gets older, he will thank her. God bless them.","post_message":"Mom finds her son in the middle of the Baltimore riots... many are calling her Mom of the Year for what she does next. @webpagelink"},{"comment_id":"1187051574713979","commenter_b":"She don't care why try and make her lower her standards. Melania is a very classy lady and you want her to lower herself and dress down.","commenter_a":"I'm sure she can find another dresser! No big deal!","post_message":"Michelle Obama's favorite designer, a woman who dressed the First Lady for 8 years in a row, just refused to dress Melania Trump. The reason? She isn't tolerant of her despite asking everyone else to be tolerant of her. The self-professed liberal meant to snub the new First Lady -- but she never saw this coming."}]
