[{"comment_id":"10153019047726130","commenter_b":"Not every cheerleader is a slut.","commenter_a":"meeting the cheerleader at the dance so you can go someplace else and apply what you have learned!!!!","post_message":"Young people still aren't getting much from sex ed."},{"comment_id":"791067471028294","commenter_b":"1. Leviticus 25:44 states that I may possess slaves, both male and female, provided they are purchased from neighboring nations. A friend of mine claims that this applies to Mexicans, but not Canadians. Can you clarify? Why can't I own Canadians? fair price for her? 3. I know that I am allowed no contact with a woman while she is in her period of menstrual uncleanliness - Lev.15: 19-24. The problem is, how do I tell? I have tried asking, but most women take offense. 4. When I burn a bull on the altar as a sacrifice, I know it creates a pleasing odor for the Lord - Lev.1:9. The problem is my neighbors. They claim the odor is not pleasing to them. Should I smite them? 5. I have a neighbor who insists on working on the Sabbath. Exodus 35:2 clearly states he shuld I ask the police to ...","commenter_a":"Yes, Jesus Loves Murderers as well but this does NOT mean He condones the murderer to continue to murder. God created us ALL but the murderer was not created that way just as Homosexual was not either...a sin is a sin. The BIBLE is very clear in this. Sin is delighful & addictive & we tend to consume ourself in our sins hence why it's hard to detour ourself from sin...that's why we NEED Jesus Christ in our hearts. Jesus Christ was tempted in the dessert with everything you can think of yet he continued to tell Satan no & to flee. When Jesus was thirsty & hungry in the dessert & Satan tempted him with food & water He still said no. We have to do the same with temptation/sin. There is ALWAYS a way out of sin if we put ALL our faith/hope/strenth in Jesus Christ He will ...","post_message":"Trey Pearson, Christian Rock Star, Comes Out As Gay. On the other hand, we reported on Jackie Hill-Perry, ex-lesbian, on how God helped turn her life around. Her Story >> @webpagelink"},{"comment_id":"10153368981378812","commenter_b":"As past wars have told us, you can ONLY stop violence with violence, these people need to be shot down","commenter_a":"You can't stop violence with violence.","post_message":"BREAKING UPDATE: Baltimore Police: At least 7 officers injured in clashes -- 1 is \"unresponsive,\" some have broken bones; mob has surrounded and destroyed a police cruiser -- LATEST: @webpagelink LIVE: @webpagelink"},{"comment_id":"10152902421671378","commenter_b":"She needs to set her asss down ! Cthu","commenter_a":"Ratchet asss fools ! The Baltimore Mayor is INCOMPETENT ! Her dumb az decides to enforce a curfew 24 hours AFTER the riot starts... #blankstare Why hasn't she called The National Guard ???","post_message":"#BREAKING Action News reporter Kenneth Moton is in Baltimore and this is some of what he is seeing this morning."},{"comment_id":"513297895525170","commenter_b":"common texans stop sharia now ! it's time to play cowboys and muslims !","commenter_a":"Way to go if they don't like it move back to Iran, Iraq or Saudi Arabia","post_message":"WAY TO GO TEXAS..."},{"comment_id":"10153036751566491","commenter_b":"Your mother is fired","commenter_a":"You're fired!","post_message":"NBC dumps Trump."},{"comment_id":"1563613390592441","commenter_b":"fucking bitch","commenter_a":"Let the parents kick the bitch with steel toe shoes in the head","post_message":"This woman should be in jail!"}]
