[{"comment_id":"10154285889541350","commenter_b":"Congrats Dylan and Savannah must be something in the water up there. Have a great day to all of you guys. From Georgia","commenter_a":"Good morning","post_message":"Join our weekend TODAY anchors for their first Facebook Live Q&A! Comment below with any questions you have for a chance to have them answered live!!"},{"comment_id":"10152790927666051","commenter_b":"Sport illustrated is worse, these are woman with their babies, that's all. No big deal.","commenter_a":"Kai","post_message":"This woman was very surprised when her photos were removed. She didn’t think they were inappropriate at all. Decide for yourselves whether they should’ve been taken down."},{"comment_id":"10153482590876509","commenter_b":"Yes. GTFO IF YOU DINT SUPPORT ISREAL SND THE USA","commenter_a":"Try again @username..... We still stand behind Israel!","post_message":"Two days after his victory at the polls, Israeli Prime Minister Benjamin Netanyahu has already walked back his disavowal of a two-state solution with Palestinian statehood. @webpagelink"},{"comment_id":"10153283312806130","commenter_b":"Denis I applaud you for teaching what you do. Big problem in our country is young girls are getting pregnant, guys leaving, single mom/hard to get education, etc ----> leads to broken family structures/children not raised properly---> leading to most problems we are facing in our country","commenter_a":"She didn't have sex, she had intercourse, or made love. Her sex is female. Why must we depersonalize coitus, to like farting or blowing your nose?? Let's put the LOVE back into making love, then our kids might make the connection to a loving act that sometimes leads to pregnancy. It's supposed to belong to people who are committed not a spectator sport or a recreational past time. :)","post_message":"She handled them pretty well though."},{"comment_id":"10154184073372093","commenter_b":"Are you kidding ? Mom said NO. Who knows what that WOMAN has exposed that baby too.","commenter_a":"Oh.. now shes just doing the most wonderful beautful natural thing that God as given women the best thing for a child...what's wrong with that ..bad mom for sayng no to someone wanting to be so generous and giving......","post_message":"The mom says the daycare worker asked if she could breastfeed her son. Disgusted, the mom said no. But as soon as she left the room, video shows the worker did it anyway... bit.ly/2kEuI1v"},{"comment_id":"1402866583068901","commenter_b":"HOW DO YALL EXPLAIN RICE COMMITTING CRIME AGAINST THE U.S, HOW BOUT HOW OBAMA LIED ABOUT ASSAD NOT HAVEING CHEMICAL WEAPONS. OBAMA LIED ! HOW BOUT TRUMP BEING PROVEN RIGHT ABOUT THE SURVEILLANCE ON HIM AND TEAM! HOW DO YOU FELL ABOUT YOUR CHILDREN BEING TAUGHT SHIRA LAW IN SCHOOL. ECT....","commenter_a":"I am glad to see to the media is holding their ground and calling him out. We need them to stay strong and sound the bullshit alert as needed.","post_message":"Trump lied SO much today, CBS had to call him out. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153136894823145","commenter_b":"Bottom line do what the officer says and don't talk back. The girl kept running her mouth to him. My child would have got in trouble by me for talking back the way she was.","commenter_a":"The only good cop is a dead cop","post_message":"Here's 5 things to know about the Texas officer seen on a viral video breaking up a disturbance at a pool party. #WFTV Watch the video here: @webpagelink"}]
