[{"comment_id":"1212130192174477","commenter_b":"Shall I keep going?","commenter_a":"Y'all are duped!!!! This is fake news, funny how any regular news outlet is not covering it. This would be mana fro heaven for CNN. Of course you now have been clued in, it won't do any good because you drank the Kool-aid and facts don't matter anymore. The fact that the fake story exists it a testament of propagated ignorance where it OK to be lazy and not even try to find the truth.","post_message":"IRAN OPENS Military Theme Park For Kids To Fight Israel, The West: Military Checkpoints, Machine Guns, Bullets Firing At U.S. Flags, Bunkers Replace Roller Coasters [VIDEO]"},{"comment_id":"1418467401509379","commenter_b":"These could be conservative witches. You never know","commenter_a":"Liberals have lost their minds. Smh. Even the conservative didn't get this stupid.","post_message":"\"You don't have to believe in 'magic' to believe in the power of intent and community.\""},{"comment_id":"1202395043109110","commenter_b":"betty you need to get your facts checked for you are off your mind. over the past 6 years the number have increase and a large number that was to be send back Obama administration let them go. don't listen to the libs press unless you can't think for yourself. a American life is worth more then sending illegals back. and it's the free stuff they get is why they come. so next illegal that was charged for federal crimes and sent back to their country comes back and kills an American why don't you go tell the family that there was nothing that could have been done to stop them because the illegal is more important then their love one. why don't you use your head and read both sides of the story instead of only one side unless you are an illegal yourself.","commenter_a":"Harry Reid is right. This bill is not the answer to a difficult problem. Some of the folks that have posted think this is a great bill. They aren't stopping to realize that it will cost more to house, feed, and send these people back to wherever they have come from, which is probably a very unsafe place or why would they have left in the first place? I hope this bill is seen for what it is, a terrible step in the wrong direction and hopefully our Senators will have more sense than to pass it into law. If you will check the numbers, in recent years more undocumented people have left the United States than have entered.","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.” Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."},{"comment_id":"10152758680722144","commenter_b":"Racist pigs","commenter_a":"What the hell are these people thinken DO THERE DUM ASSES KNOW THAT CHILD ABUSE","post_message":"WTF."},{"comment_id":"10153806284196509","commenter_b":"He is representing the USA is a PATRIOT with money. MANY MANY AMERICANS R Rich! PRAISE GOD WHOM ALL BLESSINGS FALL! RICH People make employment for others! RICH people can pay well & most do! Rich people donate to causes that heal, give to the poor, spread for GOOD! They are AMERICAN CITIZENS with opinions that this country needs fueled now!","commenter_a":"TRUMP is an AMERICAN that is ENTITLED to a VOICE! We support TRUMP!","post_message":"Both co-hosts of Miss USA, Cheryl Burke and Thomas Roberts, have pulled out of the pageant in light of recent comments from Donald J. Trump. @webpagelink"},{"comment_id":"10153855436966337","commenter_b":"It's a final effort to get her extra viewers lol","commenter_a":"God no! Jim Ian Eric Jesse Omar Eric","post_message":"PRETTY COOL: Do you want to see 'Supergirl' meet up with 'The Flash'?"},{"comment_id":"10153269295123352","commenter_b":"That last statement not only make her a dumb bitch but a ignorant one at that. Please use some of that money your boyfriend is making and educate yourself.","commenter_a":"So fake she has 3 kids no where does she have the time to make all of this stuff.","post_message":"Meet Etsy's richest seller: Mom-of-three sells 3,000 items a day and earns $65,000 a month from handmade socks and scarves"}]
