[{"comment_id":"1193969757300354","commenter_b":"I'm not a supporter of either, and race has nothing to do with it. So for you to bring it up makes you the racist. Watch TV, read the newspapers... There are increases numbers of illegals coming across our borders (Chinese were the latest reported in increased numbers over Mexican border), so it makes no difference where they are from, but where they are coming in through! California's politics is way out of whack with the rest of the country, and the demographics show which and where. That demographic could be put up across the country on every state and the trend would probably be the similar.","commenter_a":"more welfare& illegals more clinton... go figure!","post_message":"Sanders performed better than Clinton in California's northern, rural counties, which also tend to be whiter than the rest of the state."},{"comment_id":"10154201803933869","commenter_b":"44?","commenter_a":"In fairness, what President hasn't had to pay $25 million to make a massive class action fraud lawsuit go away before assuming office?","post_message":"The election of Donald J. Trump to the Presidency is nothing less than a tragedy for the American republic, David Remnick writes."},{"comment_id":"1231219033565772","commenter_b":"they can sew it to the mini brain they grew.....","commenter_a":"There is hope for me yet! Haha Juventas Buzevicius Moses Olivas Hanna Kozlowski Andrew Holtzmann","post_message":"Scientists have grown miniature kidneys in a laboratory."},{"comment_id":"10153452421356323","commenter_b":"\"Tear down this wall.\" ;)","commenter_a":"America will elect a Socialist when China democratically elects Ronald Reagan as its President.","post_message":"If Democratic socialist Bernie Sanders is elected president of the United States, how do you think it could impact global politics?"},{"comment_id":"10152890870819753","commenter_b":"She's a thug period.","commenter_a":"Now we can't call this woman a thug. Because you steal doesn't make you a thug. Big time corporations, corporate officials etc steal all the time they are not considered thugs. Let's be honest your calling her that because she is black. When cute little orange country with blonde hair and blue eyes lifts Tory burch glasses oh she's got a disorder and she won't get slammed, she will be escorted gently. You can get mad at my post if you want. I majored in History for a reason. I will say she a problem in society she gives a bad name to black people, there is no excuse ever to steal material crap. I understand if your starving and stealing food. But this is inexcusable. However, no man ever needs to slam a woman on the floor FOR ANY REASON! If your a man and your so strong, RESTRAIN ...","post_message":"Even though she was able to successfully open the driver’s door of her getaway car, the man did not allow her to get much farther than that. He grabbed the shoplifting woman as she opened the door, turned her on her back and slammed her on the ground seconds later. You think he used excessive force?"},{"comment_id":"586386844881451","commenter_b":"This woman DOES NOT love America!","commenter_a":"YOUR A LIAR !!!","post_message":"\"My vision for America is an America where everyone has a place. This is the America that I know and love.\" —Hillary"},{"comment_id":"10153305166698984","commenter_b":"Please! Just let her go away!!!!!!","commenter_a":"18 U.S. Code 2071 - Concealment, removal, or mutilation generally (a) Whoever willfully and unlawfully conceals, removes, mutilates, obliterates, or destroys, or attempts to do so, or, with intent to do so takes and carries away any record, proceeding, map, book, paper, document, or other thing, filed or deposited with any clerk or officer of any court of the United States, or in any public office, or with any judicial or public officer of the United States, shall be fined under this title or imprisoned not more than three years, or both. (b) Whoever, having the custody of any such record, proceeding, map, book, document, paper, or other thing, willfully and unlawfully conceals, removes, mutilates, obliterates, falsifies, or destroys the same, shall be fined under this title or imprisoned not more than three years, or both; and shall forfeit his office and be disqualified from holding any office under the ...","post_message":"Wow. One of Hillary's first moves as a candidate may be the one that kills her campaign... Do you hope Hillary loses?"}]
