[{"comment_id":"10152955110391336","commenter_b":"What i do NOT understand is.....if kids get vaccinated....then why in the world are those parents concerned their kids will get the disease they've been vaccinated for??? Aren't the vaccines any good?? It's NOT the ppl who aren't vaccinating their children who are bringing disease to other in this country....it's the illegals who are flooding in here who are bringing this stuff with them!!! Blame the correct ppl if you're going to play the blame game....","commenter_a":"Well said Margaret","post_message":"A 3-year-old girl with leukemia was exposed to measles at an outpatient clinic in Arizona."},{"comment_id":"10153140992043645","commenter_b":"If this a show of 'real women' will they also let the hair on their legs grow??","commenter_a":"Sick.","post_message":"On a less serious note,... Armpit hair is a growing trend for women. Will you participate? Or heck no !?"},{"comment_id":"10153155041977439","commenter_b":"Her. Defence allah made me do it ☺","commenter_a":"I hope they arrested this trash!","post_message":"MIAMI AIRPORT JIHAD TERROR: Muslim rams her car into a checkpoint and screaming in Arabic, threatens to BLOW UP airport. Go to pamelageller.com"},{"comment_id":"1270991109602974","commenter_b":"You are full of BS. Damm Obama imported these terrorists and should be charged and prosecuted!","commenter_a":"It doesn't matter what kind of statement Trump makes if it's not from the heart and just words he thinks people want to hear it meant nothing at all. When our PresidentObama sends his condolences and express his deepest regrets it is from the heart. Trump on the other hand is only putting on a show to try to make President Obama look bad because that is what all the Repugs do!! Won't work!!!","post_message":"This is what a real leader does!"},{"comment_id":"10153258414916770","commenter_b":"she more democrat liberal pig","commenter_a":"Megyn Kelly shouldn't be permitted to go anywhere near another GOP debate for the rest of her life after the debacle of the last one she was allowed to moderate..The sooner Fox News fires her off into oblivion the better..","post_message":"Donald J. Trump reignites the drama between himself and Megyn Kelly ahead of the January 28th Fox News Republican Debate."},{"comment_id":"10153708234594199","commenter_b":"Then go. If they let you in. Otherwise.... You might end up an illegal alien. Ironic, eh?","commenter_a":"Canada looks better everyday.","post_message":""},{"comment_id":"10154466524309203","commenter_b":"She's disgusting","commenter_a":"Enough of the hate and racism. Every time they open their mouths, garbage comes out.","post_message":"CNN political commentator Hughes: \"hoping I not going to have to [brush up on] my #DoratheExplorer to understand some of the speeches given this week. #DNC #TimKaine"}]
