[{"comment_id":"1308350412560406","commenter_b":"She looks like a black snowman... Where's her neck..?","commenter_a":"Who cares what this fat cow thinks???","post_message":"Whoopi Runs Her Big Mouth at Mike Pence GETS A BRUTAL RESPONSE! Wow... she should just shut her mouth! Lets get 5000 SHARES if you agree she should be FIRED!!!"},{"comment_id":"10155553244070354","commenter_b":"Sit your dumb racist ass down and shutup AL shapton and pay the taxes you owe","commenter_a":"Wake up people! States better start secession proceedings. The 10th Amendment: \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\"","post_message":"First he fought the right, then he fought the cops, now Al Sharpton announces his plan to fight his toughest opponent yet: ....The U.S. Constitution."},{"comment_id":"10153723426423487","commenter_b":"What the fuck ever. My answer is clear, even if backwards. Bikes should follow the rules, however it is phrased.....jackass.","commenter_a":"Of course they should follow the traffic laws. A bike has been my main mode of transportation for most of my 61 years. We cyclists demand drivers follow every rule and yet many of my fellow cyclists think the rules do not apply to them. They risk their lives, cause wrecks, etc. with careless behavior.","post_message":"What's safest for cyclists and pedestrians? (CityLab)"},{"comment_id":"1065479603531539","commenter_b":"Only more proof that you can't fix stupid! Who gives a damn what these idiots think? I sure don't.","commenter_a":"To heck with DC's","post_message":"The last time they did this, thousands of their CDs were destroyed..."},{"comment_id":"951284658242208","commenter_b":"She dished it out now she should be ready to take some of her own medicine, she purposely attacked Trump and and don't blame trump for no taking crap from her at all. None of what she did was professional.","commenter_a":"Megan Kelly was quite obviously biased against Trump. She was a horrible moderator as well...just horrible. I thought she ruined the entire debate. It was not really a debate at all any way. What a joke.","post_message":"Donald J. Trump declares war on Megyn Kelly after #GOPDebate."},{"comment_id":"10153301412809641","commenter_b":"tuch","commenter_a":"Warning: china is about to end... u.s. is the most powerful country in the world!","post_message":"BREAKING: Nearly every U.S. federal government agency has been hit by a massive hack thought to originate from the Chinese military, and millions more workers could be affected: @webpagelink"},{"comment_id":"10157271699240354","commenter_b":"sure take foreign money and rule with foreign masters LOL NO way you fool.","commenter_a":"No you don't, it's payola, play for pay!","post_message":"WATCH Hillary Clinton's hatchet man, David Brock, concede 'Clinton Cash' is no conspiracy book and discuss how the Clinton Machine is hunkering down for Donald Trump's big Monday 'Clinton Cash' speech on Hillary's self-enrichment through the Clinton Foundation..."}]
