[{"comment_id":"10153618824494778","commenter_b":"Lol jk","commenter_a":"At least we don't recruit murders us losing having killed anyone can the patriots say that....stfu period.","post_message":"Last summer, #Redskins Daniel Snyder said during an interview that the team was exploring the possibility of a new stadium. Now they're asking season ticket holders for input."},{"comment_id":"545649178956022","commenter_b":"I've held that Cruz is probably more dangerous than trump because he has all the bigotry and hate but he is actually serious about it as opposed to trump who is just a bizarre orange man who is saying what he needs to get elected.","commenter_a":"Is that so? Then he's an even bigger idiot than I thought","post_message":"Ted Cruz knew exactly what he was doing by not outright endorsing Donald J. Trump."},{"comment_id":"10155132618144885","commenter_b":"@username CA would be in a lot less debt if they kept their own revenues. CA ranks as 46/50 in dependent states in the US. They give more than they get.","commenter_a":"What are these liberal agencies and locations going to do without Federal Funding? This is a direct threat from Trump. From what I've seen from him he keeps his word. Places like Chicago are going to be in a world of hurt without federal money.","post_message":"Chicago Public Schools has instructed its principals not to let federal immigration agents inside district buildings without a criminal warrant."},{"comment_id":"10153111433392483","commenter_b":"Awwww lets cater to the criminals AGAIN shoot the bastard and be done i cant stand a fucking pedophile sick sick sick","commenter_a":"Their gonna let this perve go","post_message":"A gag order was issued today in the case of an Alabama pastor accused of sexually torturing, abusing and raping multiple children and teens."},{"comment_id":"10153748697767629","commenter_b":"If white women didn't flunk every black and Latino out we might have the blacks in college and in education that we need.","commenter_a":"When are we going to start making teachers uncomfortable and scared? its a white, more privileged profession with more time off. Especially at the college level. Shouldn't they fear being shot in the head too? Thankfully we are getting guns on college campuses so that all authority can be radically challenged with an in your face confrontation. The Russian left has always known the power of confronting authority so I'm glad America is catching up. War and Revolution baby! Just like the founding fathers intended.","post_message":"This is beautiful."},{"comment_id":"1203286669686614","commenter_b":"I am not sure where you, Harry Reid are coming from. This bill is not for or against immigration, it is against illegal immigration. Why are you against protecting the USA against illegal acts? The best thing we can do for the USA is have the exact same law for illegal immigrants as our neighbors to the south. Let us have the same illegal immigrant laws as Mexico, then there will be no thought or comments about being wrong or too tough. Yes?","commenter_a":"The vilest thing in the Congress are you sir!","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.” Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."},{"comment_id":"10152977390881130","commenter_b":"#fatgirlwasted","commenter_a":"@username YASSSSSS!","post_message":"Stoners, rejoice!"}]
