[{"comment_id":"726130267546926","commenter_b":"Bitch go make me a sandwich hold the mustard.","commenter_a":"I love how a bunch of \"men\" feel so threatened by strong women!!!!","post_message":"Demonstrations took place in England, Ireland, the Netherlands, Italy, Kenya, Mexico, Canada, Brazil, the United States, Australia and many other countries."},{"comment_id":"10154251165218984","commenter_b":"He shots he hits he scores, 250bucks for each, thrn charge mexico for the money, sry but see if you can just walk over the border there no you can not, you get arested and jailed asap, but some how the Mexicans and all the others get by Mexicos military hummmmm","commenter_a":"Oh yea Eean, Milo, Jackie, Heather, Cory, Liz, Justin.. Mmmmhhhhm I'm not gonna share on your walls but for those who have children, think of what type of democracy will enable if Sanders or Clinton both Democrat are elected president. To have too share the taxes you earn back for the benefit of others. Don't be naive because a lot abuse the system, which means if you want universal health care and benefits.. The Republican Party has to amend the laws of drug test issued for anyone wanting freebies and living off the cheese the government provides.. Which is I THE TAX PAYER. This revolution crap will end after New York. On another note, Ted Cruz may have a 10 day rant after this upcoming Super Tuesday winning Wisconsin with all delegates.. But Trump will win New York & all the eastern part of nation, and then we're too California! ...","post_message":"This is insane, and it happened right in front of a journalist... Do you think America needs a president with a firm stance on immigration?"},{"comment_id":"10153676230638984","commenter_b":"Hillary u r one dumb fucking bitch.u have to treat every race equal. An the man in the interview I have a question for you. (WERE U BORN IN AFRICA AND IF U WERE NOT THEN U R A BLACK AMERICAN.","commenter_a":"Where is the surprise in this? She's always been a radical.","post_message":"While Black Lives Matter is disruptively crashing other candidates' events, they're getting treated to behind the scenes meetings at Hillary Clinton events. Thank goodness this was captured on camera... Spread this video so everyone can see the real Hillary in action..."},{"comment_id":"10153828343101051","commenter_b":"You are a brave girl I'm happy you kids are out off that hell hole","commenter_a":"This so sick and so sad! I pray for these children are in a good foster home. The mother and the boyfriend and the other person go to jail for life. This child was very brave to email the teacher. Didn't anyone at school see that something was wrong with these kids? The boyfriend should be castrated! How can this happen in America?","post_message":"This teacher was reading her e-mails when she noticed a message from one of her students. Because of how young the kids in her class are, they rarely sent her e-mails. She realized almost immediately that something was wrong."},{"comment_id":"1469871926366166","commenter_b":"@username...... leave Our country!!!!","commenter_a":"Too late you racist p.o.s. you are hatred and bigotry..","post_message":"\"We will reject bigotry and hatred and oppression in all its forms, and seek a new future built on our common culture and values as one American people.\""},{"comment_id":"10154250068154749","commenter_b":"How does she get away with this rubbish?????","commenter_a":"Diane Abbot is a hypocrite of the first order, always trying to play the race card if the argument does not go her way. As for JC he's a dead man walking yes massive grass roots support but his own back benchers are actively plotting against him and most are preying for bad election results so they can stage a coup. He's lost big backers, even the labour red tops are Luke warm at best. And grass roots support doesn't transfer to the ordinary man and woman on the street who see him as a reactionary 70s throwback and apologist. Labour will either ditch it before the next general election or face annihilation and ditch him and her after.","post_message":""},{"comment_id":"10154134497810575","commenter_b":"I'm so sorry for your lost child. It sad and terrible we are being made to put up with these illegal criminal invaders.","commenter_a":"Hang him and the next ten people who allowed him to be here.","post_message":"NEW YORK GIRL DIES AFTER BEING HIT BY TWICE DEPORTED ILLEGAL ALIEN...."}]
