[{"comment_id":"10153345373924087","commenter_b":"Quit being a bitch you got your guns right?","commenter_a":"And Obama is going to let more terrorist in here so what's worse","post_message":"“He’s whipping up hatred to scapegoat a minority religious group, which has some very dangerous precedents,” Rep. Keith Ellison said of Donald Trump’s claims that thousands of Muslim Americans cheered the 9/11 attacks. “I mean, it’s the kind of behavior [that is] classic demagoguery, and you know, he’s going to get somebody hurt.\""},{"comment_id":"10153401840176336","commenter_b":"idiot and she if she would have fell and killed herself, her family would be suing. Stupidity NEVER ends.","commenter_a":"To me the flag symbolizes opposing the fed. I think that unites me with a lot of those flying the flag. Blessed to have made it to south carolina.","post_message":"A woman was arrested after climbing the flagpole in front of the South Carolina Statehouse and removing the Confederate Flag. @webpagelink"},{"comment_id":"10153670788291320","commenter_b":"This post just made my morning. You hit the nail on the head !!!!","commenter_a":"That family just needs to rent a van, pile into it, pick up the Kardashians and drive away!","post_message":"Disgraced reality TV star Josh Duggar was reportedly among the 32 million users of the adultery website, AshleyMadison.com. According to Gawker, Duggar, a married father of four, paid nearly $1,000 during his two-year subscription. His name, address and sexual preferences, and that of millions others, were posted online Tuesday night by a group of hackers. More: @webpagelink (AP photo)"},{"comment_id":"1269332673102189","commenter_b":"Becky, RAISE YOUR HEAD UP OUT YOUR BOYFRIENDS LAP, CHILD!","commenter_a":"Sorry but safety of USA citizens comes before everyone else!! This is All on Obumfuck!","post_message":"The youngest Nobel Prize winner says it perfectly."},{"comment_id":"546417122231127","commenter_b":"You're so racist it's sick. Tell that to the kids who can't go to school because they can build multimillion dollar stadiums or provide tourist attractions all while shutting down schools. You grew up a sheltered white girl. I already know.","commenter_a":"They lack the testicular fortitude to do this on a Saturday night around 2 Am in Miami 's Liberty City or Overtown or in front of Snoop Dog's house in LA. Instead they go on a Sunday afternoon, when this office is closed. I see nothing but loudmouth cowards with missing teeth and bad clothes.","post_message":"White Lives Matter group protests outside of the NAACP in Houston's third ward! #WSHH #NAACP #Houston #WhiteLivesMatter #BlackLivesMatter #AllLivesMatter"},{"comment_id":"10155447635791509","commenter_b":"She just needs to shut up. She's backing a rapist wife","commenter_a":"Wikileaks is Hillary's nightmare","post_message":"\"I can't believe that I am saying that a candidate for President of the United States has bragged about sexually assaulting women,\" Michelle Obama, speaking in New Hampshire, addresses the Donald J. Trump tape @webpagelink"},{"comment_id":"1857171411229870","commenter_b":"Apparently Madonna thinks about blowing a lot.","commenter_a":"She should be arrested for making terroristic threats!","post_message":"Madonna said she \"will not back down.\""}]
