[{"comment_id":"1032567170171905","commenter_b":"Remove her ass from the team.","commenter_a":"We are glad you are unhappy here... Please feel free to hightail it home!!! You are an embarrassment to our country!!!","post_message":"Ibtihaj Muhammad - the first American Muslim to compete in the Olympics wearing a hijab - just went on a disgusting rant about how much she hates the United States. This is SICK..."},{"comment_id":"1710140202573363","commenter_b":"I know it will be hard for Trump to send back all of the illegals, but he'll try his damdest. I hope he goes after the ones that are draining our system and leaves the ones that are hard working and honest people with good families not asking for handouts. Once we get rid of all the sponges in this country then we only have to deal with the riff raff , junkie americans that we already have to support!!","commenter_a":"Hallo everyone economy is getting worse because of Obama's and Bush's stupid policy so we need to make great world with Donald Trump.No to unlegal immigration no to Islam","post_message":"The economy is bad and getting worse-almost ZERO growth this quarter. Nobody can beat me on the economy (and jobs). MAKE AMERICA GREAT AGAIN"},{"comment_id":"1354934454518383","commenter_b":"She's disgusting!","commenter_a":"Hillary ! Explain to this young girl why you support second trimester abortions ( ripping the body out limb at a time up to Five minutes before natural birth ) I'm not with that !!!","post_message":"This team has so much to be proud of. Whatever happens tonight, thank you for everything."},{"comment_id":"1175128772557320","commenter_b":"This one nah woman?","commenter_a":"You didn't lose because you're a woman. You lost because of all the horrible things you did. Trump might have said a couple bad things, but you did many bad things. You spend our enemies money bashing him and he funded himself. I can't wait till he's in office and saying Merry Christmas is ok again and don't have to worry about offending someone for saying it. He WILL make America great again. GOD bless him.","post_message":"Scripture tells us: Let us not grow weary in doing good, for in due season, we shall reap, if we do not lose heart."},{"comment_id":"644967912360454","commenter_b":"That's a women? !","commenter_a":"He ain't banning a damned thing!","post_message":"A Hispanic student is banning whites from using this term... because it's racist? 'LIKE' if this is WRONG!!!"},{"comment_id":"896491237077292","commenter_b":"Give me a break with the martyrdom... I don't think this is an appropriate way to handle this.. Sian is right.. her's will fade and you will be left with nasty looking legs.","commenter_a":"The things you do for love","post_message":"Their daughter couldn't be happier...she even points at the tattoos and yells 'match!'"},{"comment_id":"524602671063646","commenter_b":"this is america fuck islam","commenter_a":"Go Texas","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy. Let them be angry. This America and if you don't like it, get out. Do you agree that Muslims should assimilate or leave?"}]
