[{"comment_id":"10153988549981130","commenter_b":"Why did you even read it WOMAN!?","commenter_a":"I think this tops the most pointless \"article\" I've ever read!","post_message":"Even Jay Z knew to get out of the way."},{"comment_id":"10154600060589641","commenter_b":"Because you never listen properly. Listen closely and you will learn. Building a wall. ..you got it right. That's one policy. it has to do with immigration. That's very big. Walls keep people and things out or in. Keep illegals out. Citizens, can now get the jobs the illegals had and spend that money in their country , instead of it being spent in another country. That's one in a nutshell. That is an economic principal. And it's a big one. It has a trickle down effect. There are many more policies that he has articulated. Learn them a2live.","commenter_a":"I am not an American, but I have one question to the Trump Supporters who thinks that CNN is bias... What Plans does Trump has to make America Great Again? Because since I started following the primaries to the last debate the one thing that I have ever heard from this Man is Building the Wall at the borders. The rest of the things from economy to foreign policies he says we are going to figure that out. By the way he says it is not good to give your agenda to your competitors. Is that the bases under which Donald is going to make America great again? Leaders are voted for their ideas and policies, how much healthcare they can provide, how much education they can give, what can they do with the GDP, etc. but this man knows just nothing. Shame to the Trump supporters!!! I would disowned ...","post_message":"Hillary Clinton: \"What we want to do is replenish the Social Security trust fund...\" Donald J. Trump: \"Such a nasty woman.\""},{"comment_id":"1419424701411870","commenter_b":"Um no","commenter_a":"Peter Di Benedetto","post_message":":O"},{"comment_id":"1747901745468646","commenter_b":"Do the same to that raghead bitch","commenter_a":"Is this true? If it is, she needs to be on death row!","post_message":"Muslim Nanny Who Beheaded 4 Year Old Girl Will Not Face Murder Trial Because... This is the world we are living in today people. What do you think her punishment should be?"},{"comment_id":"10153291330611770","commenter_b":"Sorry to hear this!","commenter_a":"when we have a women president this is the gal I would vote for she is smart and very much better looking then Hillary. Really!!!!!!!!","post_message":""},{"comment_id":"10153091745866523","commenter_b":"You're a pig!!!","commenter_a":"This whole thing was started by a Lawyer whose wife was a Teacher and a School Board Member. She was hysterically crying over the whole...Act 10 thing, so her dutiful hubby wasted millions of our tax dollars to pull out a witch hunt. Which begs the question: Did his wife put out after all that? Because I want to know if my tax dollars amounted to a 'Happy Ending' for most dutiful hubby.","post_message":"JUST IN: Wisconsin Supreme Court ends probe into 2012 recall campaign of Gov. Walker."},{"comment_id":"10152860755326051","commenter_b":"way to go Arizona..mebbe the first shot of the Revolution...we MUST abide by the Constitution or it means NOTHING!!","commenter_a":"What does any one expect for any state to follow the president even when he not following the law of the lands that was put there for a reason... His theory is he have a pen n a phone so that gives him the right to over step the government that he has to go through because it's the Law! He hasn't done nothing for me nor my family, all he has done is given my taxes away freely while we struggle.. Nothing he has done has improve my family living not one bit... At the end of the day we don't need his helping hand at all it does us more harm then good for us... If anyone expect any state to follow the president then he needs to lead by example n follow the laws that was put there way before his time n stop acting like the ...","post_message":"This state just passed a bill allowing them to ignore anything President Obama asks them to do. And that’s not even the most controversial part of the bill."}]
