[{"comment_id":"908033912663121","commenter_b":"Lowlife muslims","commenter_a":"Chaos? Why? They simply forfeit any match they refuse to participate in.","post_message":"You must be freaking KIDDING ME?!"},{"comment_id":"10157700515445294","commenter_b":"Educate yourself. So we rather have criminals holding people up at gun point running the street? Robbing innocent hard working people?. We feel bad for the criminals? However, I don't. Much peace and love.","commenter_a":"Well he won't do that again. Glad he won't be terrorizing hard workers anymore. I don't care if he had a drug problem look at all the people he held at gun point the past 3 weeks. Should feel sorry for those who had to be terrified of their life.","post_message":"Police say the robber was suspected of holding up other Cleveland-area CVS stores for opioids."},{"comment_id":"502126469966479","commenter_b":"Who knows who's here already? #WomenForTrump. Vote. #TRUMPFORPRESIDENT","commenter_a":"Is it just a few Americans that realize obummer n his administration are all Muslims, tied to CAIR, we could go on on on..72 in terrorist watch working for homeland security n DHs","post_message":""},{"comment_id":"10153923917206130","commenter_b":"No this is an attention seeker.Most women don't do this,especially at someone's wedding.","commenter_a":"Nothing says lets party more than a baby on a boob. :)","post_message":"Now THIS is a cool mom. 😎"},{"comment_id":"10153782445088984","commenter_b":"Interesting that this is the same city where the Muslims tried to impose Sharia law and got shut down by the mayor, a woman at that!","commenter_a":"This whole thing looks like it was aset up from the beginning, but too many people are jumping to conclusions before the facts are out ...","post_message":"The mayor of Irving, Texas -- the home of the Muslim \"bomb-clock\" boy -- just came forward with a shocking statement about the boy and his family. What she revealed shows exactly what's going on here. This was a setup from the first, and this mayor refuses to stay quiet about it. She needs our support."},{"comment_id":"1063700283715505","commenter_b":"No more illegals","commenter_a":"Keep legal immigrant families together. I have so many waiting in the Philippines waiting to legally come. The other illegals can wait to be legal like the rest or let all immigrants come to USA.","post_message":"The Supreme Court’s deadlocked ruling on immigration leaves families like Karla’s under the threat of deportation. We need a president that will fight to keep families together, not tear them apart."},{"comment_id":"1906434399416299","commenter_b":"Imagine something bit u on ur naked body lolzz","commenter_a":"The restaurant name should change to Animals restaurant","post_message":"Owners describe it as an 'orgasmic atmosphere.'"}]
