[{"comment_id":"10153424802654255","commenter_b":"Hillary 2016.....@webpagelink","commenter_a":"That'd be great if a liberal were running.","post_message":"When liberals go to the polls, liberals win."},{"comment_id":"10155110249450294","commenter_b":"She got caught in the moment ... She looks like she's on drugs!!! This b!tch ain't news worthy...","commenter_a":"I saw it also and I took it that she was comforting her BF and they were both distressed about what just happened in the game. I remember it was a tense time","post_message":"Ohio State Buckeyes won the game ... but here's the six seconds from last night's Sugar Bowl that everyone is talking about today. What is happening in this video?!"},{"comment_id":"1051832858188283","commenter_b":"That's why we're in the place we are now,to no where.","commenter_a":"Sure makes some pretty good points","post_message":"This extremely popular \"Bernie\" meme has tens of thousands of likes and shares yet it reflects a SAD reality about young people today and the public education system in America. Watch as we expose the sad truth behind this meme. [READ]"},{"comment_id":"976047545785108","commenter_b":"Go go Hillary, you will be next USA-President.","commenter_a":"Go Hillary all the way","post_message":"“Beijing is normally very hot and very dry in September, but it just poured rain throughout the conference. The Chinese claimed that it was the fault of all these women in Beijing.” Watch the history of Hillary’s stirring speech at the 1995 UN Women’s Conference:"},{"comment_id":"2035328873360726","commenter_b":"Touch my wife and you're a dead goat-humping mf.","commenter_a":"So this must be why American women want muslims in our country?","post_message":"SHARIA LAW BEATING Of Woman Captured On Cell Phones By Cheering Crowd…Woman Savagely Lashed With Cane By Masked Men…Screams In Pain Before Collapsing The smiling women in the large crowd is almost equally disturbing… ***WARNING***VIDEO IS VERY GRAPHIC And DISTURBING!"},{"comment_id":"10154493195323132","commenter_b":"@username Do you believe everything that you read on the interwebs? And why are you so gung ho about defending Schumer? Or are you simply into fat chicks?","commenter_a":"Is anyone here a marine biologist? We have a beached whale on our hands!","post_message":"Amy Schumer, Kate Hudson and Goldie Hawn are the epitome of squad goals on their Hawaiian vacation."},{"comment_id":"894582770641419","commenter_b":"Ship her out","commenter_a":"There is a special place in HELL for Rosie O'Donnell. It seems to me she is living her hell on earth her life has gone so well. Can you remember a movie? TV Show oh the view, did she get canned. What ever happened to that talk show. If I remember correctly she had problems with her own kids. I think they just didn't want anything to do with her. Go get back underneath your rock Rosie!","post_message":""}]
