[{"comment_id":"10154256686314641","commenter_b":"What a horrible woman.","commenter_a":"i'hve ,ever seen something like that until she was suffer from mental illness","post_message":"\"Mr. Sheats will have to live the rest of his life with this horrible memory.\""},{"comment_id":"786447821458391","commenter_b":"And that woman belongs in a jumpsuit behind bars so what's your point","commenter_a":"Only people with dignity responded! The rest???? This man belong to a mafia organization! Not the White House!","post_message":"Former anchorman Dan Rather has issued a challenge to his colleagues: \"This cannot be treated as just another outrageous moment in the campaign.\""},{"comment_id":"10152572021501680","commenter_b":"Jew haters","commenter_a":"This is not the United States of Israel.","post_message":"Israeli officials rushed to meetings on Capitol Hill, trying to calm a furor created by Benjamin Netanyahu’s planned speech. It didn’t work. @webpagelink"},{"comment_id":"691233461036607","commenter_b":"Every \"illegal immigrant should be deported\" good let's start with Malenia Trump","commenter_a":"Every last illegal immigrant in this country should be deported and all charged with a felony for being illegally here. If they come back again, charge the immigrant with two felonies and put them in prison, then deport them again when their sentence is up. If there is a third time for the immigrant to come back, give the natural life sentence. People that come here, should do so legally.","post_message":"Obama deported a record 1.5 million people in his first term."},{"comment_id":"10155442182635615","commenter_b":"Fix that damn grill! She looks like a damn key maker!","commenter_a":"get a new haircut, for starters...","post_message":"What do you think they should do with it?"},{"comment_id":"10152513756410927","commenter_b":"e is talking about his leader Satan","commenter_a":"Ha! The blind leading the blind. Schmuck. “This I say therefore, and testify in the Lord, that ye henceforth walk not as other Gentiles walk, in the vanity of their mind, Having the understanding darkened, being alienated from the life of God through the ignorance that is in them, because of the blindness of their heart:” Ephesians 4:17-18","post_message":"Obama says he has sought God's guidance in leading nation..."},{"comment_id":"583876271812949","commenter_b":"Niggah Please","commenter_a":"Um....why walmart though?","post_message":"Trump's #1 supporter has a disgusting warning for voters..."}]
