[{"comment_id":"514982215334916","commenter_b":"With all the illegal immigrants crossing our borders daily, we have no control over the diseases they are bringing into the country, diseases that were eradicated here,thanks to vaccines. If there is even a small chance my child could be exposed to diphtheria, whooping cough, or the measles, or polio, you can believe I will do whatever I can to protect them from these horrendous diseases. If you want to play Russian Roulette with those chances, that is up to you.","commenter_a":"Thanks for taking the time to let us see who you really are. I am more and more impressed by you each day.","post_message":"Each night I try and carve out some time to answer questions from my friends on Facebook. You can submit your questions by sending them to me via email at AskBen@BenCarson.com. I am out in Jackson, Wyoming tonight and my, is it pretty out here. The first question tonight is one I see comments on occasionally. It is from Devon and it is about childhood vaccinations. Devon, as you know, I spent my life with a Pediatric specialty. As a Pediatric Neurologist, I feel I have a very solid understanding of the developing brain of a child. Devon as you know, my life's work was in a pediatric specialty, caring for 15,000 children to ensure that they could live full, productive, and healthy lives. I can assure you that I would never advocate for a treatment for children without fully knowing that it is safe and in the best interest ..."},{"comment_id":"10153377124609705","commenter_b":"Women's restrooms are nastier than the men's.","commenter_a":"i don't have any issues with trans-friendly bathrooms. But unisex? Have you tried those? they're never clean!","post_message":"This intimate act is now a battleground for transgender acceptance."},{"comment_id":"914235348632517","commenter_b":"So sad","commenter_a":"He'll claim it was medicinal for his PTSD.","post_message":"Bowe Bergdahl, the U.S. soldier who was released in a prisoner exchange in Afghanistan for five Taliban detainees, wound up in the middle of a pot raid earlier this week @webpagelink"},{"comment_id":"1746177368955196","commenter_b":"she's full of it","commenter_a":"WTF this is what she said in her tweet: For the record, my book \"Settle for More\" does not suggest Trump had any debate Qs in advance, nor do I believe that he did. -","post_message":"MEGYN's LATEST CLAIM. @webpagelink"},{"comment_id":"10158323534995594","commenter_b":"Stupid idiot. He is not sending out legal immigrants.","commenter_a":"Closing stores and businesses won't make America Great Again","post_message":"“I feel like I want to put the message out that I am ashamed that I gave him my vote, and I wish I could repeal and replace my vote for him.”"},{"comment_id":"10150742367724999","commenter_b":"Yes Debra! Preach","commenter_a":"What?!! Do you really think young women voters can ignore that Hillary chose a MONSANTO lobbyist as her campaign manager? We'll wait for Elizabeth Warren, thank you very much. In the meantime- Senator Sanders is our Mr. Clean.","post_message":"Hillary Clinton's older feminist supporters had a message for young women who are not backing her candidacy: Shame on you. Update: Gloria Steinem later said she \"misspoke.\""},{"comment_id":"10155229441268352","commenter_b":"She is a grown ass women","commenter_a":"For all j-lo haters y'all can go straight to hell she is in love","post_message":"Daaaayum! Drake and J-Lo are KILLING THE DANCE FLOOR… watch Drake GRIND ON J-Lo's FAMOUS BOOTY… then slow-dancing together like they about to go make babies!! (Video -- Super HOT!!) ----> @webpagelink"}]
