[{"comment_id":"10153619254387439","commenter_b":"You stupid son of a bitch. She will never do a day in jail. Dream on asshole.","commenter_a":"FBI didn't seize a fucking thing, they were voluntarily turned over to the FBI and justice department. Geller is a rotten crotched liar.","post_message":"// google_ad_client = \"ca-pub-@username\"; google_ad_slot = \"@username\"; google_ad_width = 336; google_ad_height = 280; // ]]> // // ]]> Hillary is such a tool for jihad and a knave to her lover pal Huma Abedin, I don t care how this destroyer gets her comeuppance, as long as she does. Like Capone and tax evasion charges. It was hardly the worst of what he did, but it got him put away. She should be sitting in prison for Benghazi, but if this is the best we can do, so be it. Although I hardly trust the DoJ. WASHINGTON As pressure builds on Hillary Clinton to explain her official use of personal email while serving as secretary of state, she faced new complications Tuesday. It was disclosed her top aides are being drawn into a burgeoning federal inquiry and that two emails on her private account have been classified as “Top Secret.” ..."},{"comment_id":"493286290862389","commenter_b":"Now if we could just get her to STAY in Africa. ..and her little pea brained spouse. .","commenter_a":"I believe Hillary and Bill did something similar before they left office, milked the system for all they could and stole hundreds of thousands of dollars worth of White House furniture and art work.","post_message":"First lady Michelle Obama's family trip to Africa, Spain and Morocco to promote her \"Let Girls Learn\" initiative, and cut a CNN documentary on the effort, has already crossed the $1 million mark with many more expenses still to be tabulated. According to the bills that have already come in, Obama, accompanied by an entourage that includes her mom and daughters, has spent about $1.06 million: $512,737 for hotels and $252,471 for limos and transportation. - via Washington Examiner"},{"comment_id":"1146865702064592","commenter_b":"OMG, Catherine. Did you really say that? go wash your brain out with soap.","commenter_a":"Hillarys people Bribed the FBI to changed subpoena documents and change it from classified to a lower classification . If they can do something so illegal and get away with it. Think how the government can come after ANYONE! the Media owned by global elitist, Hillary is their puppet.","post_message":"Image from Meme GOP"},{"comment_id":"10155012522801944","commenter_b":"It's now about money Obama laid out a lot of this deportation and Trump has to bite the bullet. Now back to money. Only ones going to make money on the deportation of illegals are LAWYERS. Lose. Lose situation for the illegals. Serves them right? Our forefathers and mothers came in legally Any questions ?","commenter_a":"Id like to see 365 days without illegal immigrants. enforce the law deport illegals.","post_message":"Serves 'em right."},{"comment_id":"10153438712476636","commenter_b":"Good start but we need a lot tougher laws for the sex offenders especially the pedophiles and rapists.... If there is a country to deport them to then fine, if they are British I think we should start new colonies on the barren islands around the uk.","commenter_a":"Hear hear.....send them all home,BLAGGING no good scumbags. Thank god a bit of sense at last they have been taking the k Piss of our system too long","post_message":"Exclusive: Theresa May's response to the uncovering of sex abuse gangs"},{"comment_id":"10153502208726350","commenter_b":"Too bad they don't pay the woman as much as the men. Men.... 9 million to make it to 16 round. Women.... 2 million for Championship win.","commenter_a":"Congratulations ...Great team","post_message":"\"It was just an epic journey. One we'll never forget.\" - Carli Lloyd to Matt Lauer. #WorldCup #SheBelieves #USWNT Cc: FIFA Women's World Cup"},{"comment_id":"1266627376716224","commenter_b":"No one has said no to immigration, just no to ILLEGAL immigration. And NO to ILLEGAL CRIMINAL immigrants! Wish you people would finally get it.","commenter_a":"white old man...","post_message":"As the son of an immigrant father who came to this country with no money and little education, I understand that our greatest strength is our diversity. We are a nation of people who have come here from every corner of the earth. We practice many religions. We are gay and straight. We are black, white, Latino, Asian American and Native American. Mr. Trump. Your job as president is to bring people together, not divide them up. Support comprehensive immigration reform, not mass deportation."}]
