[{"comment_id":"10153354540679087","commenter_b":"U PEOPLE NEED TO WAKE THE FUCK UP","commenter_a":"Let's see how far his numbers drop when people realize that there will not be 100 Black Leaders endorsing him on Monday!!! They are pisses about that whopper of a lie!!","post_message":"Donald J. Trump claimed future generations are “going to know about Barack Hussein Obama” when they look back at today’s financial problems. “They're going to be thinking about, 'Obama really blew it.'\""},{"comment_id":"1203183663111217","commenter_b":"STFU","commenter_a":"Nothing Mr. Trump does compares with crimes Hillary and obama have committed.","post_message":"A prominent Republican who supports Donald Trump urged the candidate to start acting like “a potential leader of the United States.”"},{"comment_id":"10155440088805354","commenter_b":"Charlie, I guess it doesn't take much for you. When she stands up her boobs point south.","commenter_a":"Time for that old broad to retire.","post_message":"\"Why is it okay to show ass and no breast?\" - Madonna Fair question?"},{"comment_id":"10153227651945329","commenter_b":"Ikr how dare she maintain a healthy lifestyle, the bitch.","commenter_a":"She can fuck off","post_message":"More like baby washboard, amiright?"},{"comment_id":"494885290693351","commenter_b":"Say what you will, but she has the right to stick with her belief.","commenter_a":"For one, she's not crazy, for two, Congress has to pass the laws,and no law was passed for her to grant marriage licenses to gays. Gods law, IS LAW","post_message":"One side has got to give in. Right?"},{"comment_id":"10154883031433010","commenter_b":"Illegal Immigrants have been paying taxes for the longest time. Look it up. I suppose you don't want that money either.","commenter_a":"Those law makers assume that all Californians want this, many of us don't want lawless immigration, no matter what country they are from. We don't like that our laws aren't being enforced and our budget and resources for our state are being given away to non-Americans.","post_message":"California's fighting back."},{"comment_id":"10154220777628487","commenter_b":"u rude fuck","commenter_a":"I always find it irritating that a typical response to vegetarians/vegans is something along the lines of \"it's fine as long as you don't push your views on others.\" As a lifelong vegetarian for ethical reasons, I go about my day constantly reminded that the vast majority of the people I encounter are active proponents of what I consider to be systematic violence that trumps the holocaust. Imagine believing that and being expected never to mention it. I actually don't mention it, because I've found that people simply do not give a fuck about the suffering of animals, and it is far too depressing to endure such conversations. But it continues to irritiate me when people say, it's fine, just don't push your views on others.","post_message":"Russell Simmons, founder of Def Jam and author of \"The Happy Vegan\", teaches us how to defend the plant-based diet that many love to hate."}]
