[{"comment_id":"10154789025934641","commenter_b":"If wonder woman can do it ..so can I","commenter_a":"This is so disappointing. Anyone petitioning for the removal of Wonder Woman as ambassador, clearly doesn't know the history of the character. Peace Justice Equality ...and more. Bottom line: basing her removal mainly on appearance - is sexist. Look at male superhero costumes. They leave little to the imagination also. No one is hollering about that. As a feminist, I understand that the sexual objectification of women is a huge problem in our culture. The answer is not to force women to cover up. The answer is to allow women to express themselves without fear. The answer is to teach our boys how to behave. Read the comics. Read the history of the character. Read scholarly articles on WW as a feminist icon. She has pro-women zingers that make me cheer! Many parts of her \"sexy\" costume are actually powerful symbols. Do some research. I know there are more important ...","post_message":"Wonder Woman has been stripped of her role as UN honorary ambassador less than two months after the appointment was made."},{"comment_id":"10153033074808837","commenter_b":"To those with negative comments : May your offspring never have any genetic challanges. I'd hate to think of your lack of support to them","commenter_a":"You are a great dad, she must see you as her hero.","post_message":"HOW GREAT IS THIS? A father looking to support his 6-year-old daughter got a tattoo matching the same implant device that she received in her ear."},{"comment_id":"10154185430309062","commenter_b":"Why force a woman to ruin her body if she doesnt want to","commenter_a":"Conservative's be like \"I demand you to keep that baby\" nine months later \"I don't want my tax dollars paying for those babies\"","post_message":"NEW: Another hidden camera video taken at a Planned Parenthood facility was just posted online, and Governor Greg Abbott has already responded."},{"comment_id":"897587366974686","commenter_b":"Please don't speak English again your murdering my language. Just keep speaking Spanish.","commenter_a":"Speak English? Good or bad I'm bilingual BITCH","post_message":"Crazy Racist Old Lady Yells At A Woman For Speaking Spanish At An Ihop!"},{"comment_id":"712497285538613","commenter_b":"Islamists radicals are killing muslims every day in irak, syria etc! Its about thousand and thousand and for no reason! Israel, when attacked, its only to defend itself! As any country would do!","commenter_a":"Jewish extremists burned a kid alive too. Just stating a simple fact.","post_message":"Netanyahu: ISIS burns people alive, Iran hangs them in city squares"},{"comment_id":"10157702092900354","commenter_b":"And yet she's still allowed to run for POTUS... And there are still fools who will vote for her","commenter_a":"They thought no one would ever notice .","post_message":"The Clinton Cash Foundation is a $2 Billion Corruption Racket."},{"comment_id":"1164695216980191","commenter_b":"@username if you don't appreciate how this site reports things or how it's run, do us all a favor and take your clicker to someone else's bait!! Life's too short to have to deal with such negativity! Peace!","commenter_a":"This happened a year ago... Wonder why it is recirculating?","post_message":""}]
