[{"comment_id":"10152867173405667","commenter_b":"Can't stand her","commenter_a":"Start with the thugs then will talk","post_message":"\"How is it possible that we as a nation allow guns to fall into the hands of people whose hearts are filled with hate?\" Hillary Clintonsaid."},{"comment_id":"10153546186781162","commenter_b":"The disturbing replies to this is that people actually think just because she is a woman, she can hit whoever she wants and continue to escalate a fight. Doesn't matter who or what she is. You don't hit people period. Had she not come back in, hit him and continued this, there would have never been a problem.","commenter_a":"I'm all for not putting hands on a woman. But where's this equal opportunity draw the line at? She smacked the taste out dudes mouth. Don't start what you can't finish","post_message":"PANERA ATTACK: A Panera bread manager is fired after he was filmed punching a female employee in the head and knocking her to the ground. WATCH: @webpagelink (Warning: Graphic video)"},{"comment_id":"10155033056251350","commenter_b":"you alice are the lame one.... bet u r fun at parties....not!","commenter_a":"how can americans put the flynn event in context. flinn's entry into the trump power structure was vigorously opposed from the beginning: one might even consider his a marked man. part 2: media has propogated trump's comments on intelligence agencies extensively. so one could ask the question how does the leak on flynn occur in the first place: NSA surveillance or other. it would appear a US intelligence agency leaked to the anti trump news media:))) could one consider that a direct attack on this nation to influence American government: yes. trump must drain the swamp in the intelligence community now. the entire establishment apparatus that supported the status quo is now actively working against change middle class voted for: start the purge. there is an outlier that must be considered: Israel. trump is surrounded by Israel firsters. was flynn one of those or was he an American firster. did ...","post_message":"On this Valentine Day, watch George H.W. and Barbara Bush share their touching love letters on TODAY in 2011 (and try not to cry!) @webpagelink"},{"comment_id":"10153240848239087","commenter_b":"So he's trying to hold her accountable.... I think more people need to keep asking the ignored questions...","commenter_a":"I have never seen a grown man act that ridiculous in a public setting. Fucking pussy.","post_message":"Rep. Jim Jordan, chairman of the House Freedom Caucus, got into a heated shouting match with Planned Parenthood president Cecile Richards during today's House Oversight Committee hearing into the nonprofit's use of federal funds. WATCH:"},{"comment_id":"10154506752502619","commenter_b":"Call Sarah please let me leave you with this I am Hebrew my tribe is Nazarene but I am not Jewish a lot of people and I know that you're not one of them get that mixed up quite a bit for it is possible to be Hebrew and not to be Jewish","commenter_a":"There were no unions until the 19th century when a bunch of Jewish garment workers in NYC publicly protested and marched through the streets for safe,decent places to work and a living wage. How dare this bunch of ignorant,uneducated pigs discuss human rights. They couldn't find Israel on a map if their lives depended on it. Their hatred is based on jealousy of the achievements of Israel and the will to survive in a world where hatred of Jews is very fashionable.","post_message":"Citing the Jewish state's \"long history of violating the human rights of the Palestinians,\" the United Electrical, Radio and Machine Workers of America have reportedly become the first nationwide union to join the boycott against Israel."},{"comment_id":"10153502199714087","commenter_b":"If I had any faith in Clinton. Sure. But I don't. So....","commenter_a":"My dream is that Bernie Sanders agrees to run as Hillary Clinton's vice president on the condition that Elizabeth Warren be appointed Secretary of the Treasury and Bernie gets to focus on one main goal: voter turnout! Bernie can build the revolution he's been talking about by getting everyone more involved and then we can pick up some democratic seats this year and take back congress in 2018 with progressive candidates. Bernie's task would be non-partisan voter turnout and involvement supported by a strong democratic machine finding good candidates in local state governments and for congress. This is a long term plan, one that ultimately paves the way for President Warren. Bernie wouldn't get to be president but he would give us a good 16 year trajectory to push progressive policies. Wouldn't that be lovely?","post_message":"“In the last election, the mid-term election, 80 percent of young people didn’t vote,” Bernie Sanders said.“I’m very proud we’re bringing a whole lot of young people into the political process [and] that we’re revitalizing democracy. If we’re going to change America, that’s what we’ve got to do.”"},{"comment_id":"10152862008521336","commenter_b":"I'm so glad they caught those scumbags without more bloodshed. It still is b@llshit that some people think shooting at cops is an appropriate action to try and prove a point. If you want a lawless society I'm sure there is some third world country that will accept your dumb@ss.","commenter_a":"He Could Be Obama's Son!","post_message":"UPDATE: Two suspects are in police custody Tuesday for allegedly shooting two plainclothes NYPD officers responding to a robbery."}]
