[{"comment_id":"10153324088600736","commenter_b":"Having a girlfriend costs alot more than a hooker","commenter_a":"You would think that even the ugliest of men can get a girlfriend without having to pay for one...","post_message":"The man showed up at the police station \"much to the bewilderment of those in attendance,\" West Linn police said."},{"comment_id":"1359888287387770","commenter_b":"Stupid silly bitches","commenter_a":"And this is who women follow?","post_message":"SADLY, LIBERALS ARE TOO STUPID TO REALIZE WHAT THIS SIGNAL MEANS!"},{"comment_id":"10153969486484255","commenter_b":"Warren was among female Democratic senators who asked Hillary to run for 2016.","commenter_a":"When I think of Elizabeth Warren, I think honesty and integrity-that is why I can Only see her with Bernie Sanders-this is the Lady I envision as our first female POTUS!! Thank You Senator","post_message":"A beautiful smackdown. From Daily Kos user Lady Libertine"},{"comment_id":"712988442225067","commenter_b":"aint she pretty..i would rather kiss the south end of a north bound mule...","commenter_a":"My God that's one ugly broad she has more rinkles than a road map","post_message":"Like if you agree."},{"comment_id":"10153395852497629","commenter_b":"aSSHOLE NIGGA LOVER!","commenter_a":"I think it's safe to say they are not accusations but are indeed facts","post_message":"The interview is expected to include Dolezal’s first major comments regarding accusations that the she lied about her race."},{"comment_id":"10153363875728352","commenter_b":"We all need a break dumbass bitch but you don't see us throwing our kids out the car !!","commenter_a":"Yep she look like she need a BREAK!","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"990509770989495","commenter_b":"Any organization with 200,00members is not a church.","commenter_a":"This is what gives religion a bad name.","post_message":"Did Jesus Christ need a private jet to spread his word?"}]
