[{"comment_id":"10154871308810586","commenter_b":"Oh it was Bakersfield, now I get why it happened.","commenter_a":"Brooke, I bet this is my problem!!","post_message":"“They said it’s just fat, you’re just fat…it’s just fat developing there,” the man said of the benign tumor that doctors now believe likely started due to an ingrown hair."},{"comment_id":"10154344399454411","commenter_b":"fuck off you bitch American","commenter_a":"Abe out of all should know that you don't complain against your Slave-Masters. You sold yourselves to the Empire, now shut the fuck up and sit the fuck down.","post_message":"Kenneth Shinzato, a 32yo civil employee of the US military base in Okinawa, admitted that he strangled his victim"},{"comment_id":"10153356838133690","commenter_b":"Let ur sister to mumbai to get a rape","commenter_a":"Pak and ISI will use the money to fund terrorists !!","post_message":"Pakistan and China have held close diplomatic, military and economic ties for decades, but these projects would represent the largest investment in Pakistani history. @webpagelink"},{"comment_id":"10153711190119411","commenter_b":"Put them on big boats & send them too the U.S. !! Time for the yanks & Jews too clean up there mess they created !!","commenter_a":"They are provided with bins and skips in most places, yet they just throw their shit everywhere. Dirty pigs","post_message":"NIMBY-syndrome grips little-mittel-Europeans"},{"comment_id":"10153422547304138","commenter_b":"I watched it go down from the top of the parking ramp it was a woman cop that chased him down #Girlpower","commenter_a":"Haha scary I live on that intersection thank god I'm moving","post_message":"Not every day an inmate escapes in your neighborhood."},{"comment_id":"1099534980113254","commenter_b":"Anderson cooper is a killery bitch","commenter_a":"The country will be dancing in the streets if that happens. If anyone can get the job done, it's Donald J. Trump!!","post_message":"Donald Trump says he will prosecute Hillary Clinton if he becomes President of the United States."},{"comment_id":"10153916638559753","commenter_b":"Feed the gator Hillary and her pimp Obama kill that gator quick","commenter_a":"According to CNN the gator was a known Trump supporter and a life member of the NRA.","post_message":"News of yet another alligator attack has shaken things up in the state of Florida. A service dog named Precious has passed away after protecting her owner from being attacked by an alligator. Fox News reports the protective pit bill died after jumping in between her owner to save the man from an alligator attack in the southwestern portion of Florida. The alligator attack and death of this heroic service dog from Florida has prompted an inspect to determine whether or not the marina where... @webpagelink"}]
