[{"comment_id":"10157217624240354","commenter_b":"Send them to the Vatican you have walls keep them there","commenter_a":"Christians are in more danger than Muslims, that is the truth.","post_message":"Still no word on when the Pope plans to tear down that evil Vatican Wall surrounding his fortress and let all the \"migrants\" come flooding in."},{"comment_id":"10153256924124726","commenter_b":"What a jackass","commenter_a":"None of them were born in Africa.","post_message":"WATCH: Obama on Baltimore: \"Too Many Instances\" of Police Target Poor African Americans"},{"comment_id":"997862486926485","commenter_b":"She also set up a GoFundMe account. It's a publicity stunt to make money. She's a nasty person","commenter_a":"She showed she had class. Love this story.","post_message":"Two women called this mom a \"whale\" because of her size, what she did next is truly remarkable: @webpagelink"},{"comment_id":"10154622487769342","commenter_b":"Ignorance. Many Americans with family there. Not your brothers/sisters? Or don't they count?","commenter_a":"Fall out from whom? Iran saying Americans aren't welcome there? Darn. Or is it the shrieking protestors? Tiresome.","post_message":"Legal residents and visa-holders were being denied entry Saturday to the U.S. under the Trump action."},{"comment_id":"10152928682609753","commenter_b":"Is this another religious thing and now pushing in Indiana utah has cults that dirty old men take child brides and they dump boys out very young so no competition pigs","commenter_a":"disgusting","post_message":"The child’s mother, who is reportedly divorced from the father, asked that he not carry out the ceremony, but to no avail. Although the wedding was not recognized under Australian law, the series of events that took place after the wedding have led to the father’s arrest."},{"comment_id":"10153784012776337","commenter_b":"Bitch you won't riot. You'll cry !","commenter_a":"if you kill glen we riot","post_message":"HE TRIED! One The Walking Dead character would still be alive if producers had listened to Andrew Lincoln..."},{"comment_id":"1523513847666621","commenter_b":"Republicans had a smear campaign for him too, beginning with making him out to be a communist, with anti-American rhetoric to prove it. He would've been painted an insider since government is all he knows. They planned to trot out his rape fantasy story as well. Also, Vermont tried and failed it's statewide Healthcare for all system. He was treated with kid gloves compared to what he would've endured against the Trump post-truth machine.","commenter_a":"Sorry, Bill, but half of America already hated her BEFORE she ran. The media and Republicans have been excoriating her for 30 years. SHE NEVER HAD A CHANCE--unlike Bernie, who was almost universally beloved. He would have won. Fault: Democrats","post_message":"In case you missed them, we're counting down the most popular stories on BillMoyers.com during the past year: #9 - The fact is that Hillary Clinton wasn’t unpopular when she announced her decision to run in April 2015. If you look at the Gallup survey in March of 2015, 50 percent of Americans had a favorable impression of Clinton, only 39 percent an unfavorable one. So there was clearly no deep reservoir of Clinton hatred among the general public at the time. On the contrary: Americans liked her; they liked her quite a bit. Hillary Clinton's popularity didn't start to plummet until the press focus turned to her emails."}]
