[{"comment_id":"10153502660004087","commenter_b":"Obviously! She won by less than 2 delegates- 6 of which were won by COIN TOSS.","commenter_a":"She will enjoy in prison","post_message":"“Obviously, Secretary Clinton has won. So congratulations to her,\" said White House press secretary Josh Earnest said. I am sure they feel good about that. They should.\""},{"comment_id":"10154453575369087","commenter_b":"I love it.","commenter_a":"And Trump is right once again! Meryl Streep is a piece of s***!","post_message":"Donald J. Trump: \"Meryl Streep, one of the most over-rated actresses in Hollywood, doesn't know me but attacked last night at the Golden Globes. She is a Hillary flunky who lost big.\""},{"comment_id":"10153746801086336","commenter_b":"Sure abuser.","commenter_a":"Go to court when you are told to and this won't happen. Simple.","post_message":"\"I have a one-year-old son and I'm trying to take care of him by myself! I'm begging you, please!\" the woman cried to the judge before she was led away."},{"comment_id":"10153081703864024","commenter_b":"AMEN!!! Don't let these racist win, because all the cops are going to do is profile and stop people that are poor or of color","commenter_a":"Mayor wrong direction","post_message":"The mayor made clear he's not planning a return to stop & frisk policing, saying “Going back to an unconstitutional, alienating approach is not only inappropriate and unfair to the populace, it doesn’t work.\""},{"comment_id":"1329814237089560","commenter_b":"These seem so handy","commenter_a":"This feels like a Savannah thing.","post_message":"If there's one thing we can all agree on, it's that tying shoelaces is the worst: @webpagelink"},{"comment_id":"10153497244196051","commenter_b":"You are such a bitch. You need put to death just like you did your baby. You bitch","commenter_a":"Glad she didn't get off like Casey Anthony","post_message":"This woman didn't want her ex-boyfriend dating other women. Her 2-year-old daughter ended up paying the price."},{"comment_id":"1738986173036273","commenter_b":"@username : go away Trump or Bernie lover . Vote for Hillary","commenter_a":"Love Her! @username will be our next President of the United States of America!","post_message":"\"Clinton is a master at identifying problems and coming up with plans to solve them. There is seemingly no crisis too small to escape her attention, no subject outside her wheelhouse.\""}]
