[{"comment_id":"1303184443111138","commenter_b":"People check when you read this and other comments if your name is being used factilously by the Republican party to make statements in your name for Don the Con. Please watch.","commenter_a":"You sound like school children arguing on a playground. Little school children. This is what you got from the first presidential debate. Hillary did not do well if all you have to talk about is her accusation that Trump called some woman miss piggy.","post_message":"\"If any women was about to let go anything that he said in the past, this is not going to be it.\" - Morning Joe's Mika Brzezinski reacts to Donald J. Trump's remarks about ex-Miss Universe Alicia Machado's weight"},{"comment_id":"679630052167782","commenter_b":"She needs to be deported.","commenter_a":"i think you belong over there","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"743297559178019","commenter_b":"Dumbest fucking answer. Trump met with the black panther party and several top gang members from Chicago to reduce body counts and help fix the black community. Dumb asses mistake for deportation of illegals vs legal immigration. Left supporters are the dumbest people on the planet.","commenter_a":"Good !!! Just makes More room for the REAL PATRIOTS","post_message":"\"I'm not going to the White House. I don't feel accepted in the White House.\""},{"comment_id":"964740956976016","commenter_b":"I am glad to see someone else that sees what is happening. Right now there are 76k Islamic refugees that have arrived and continue to come. Barack Husein Obama has strategically placed them throughout the U.S. Now ask yourself, how long will it take before key cities fall to Islam within the U.S..? He knew what he was doing, and his plan is working due to tolerance and bleeding heart liberals. It may not be next year, however, in the near future, we will see more turmoil through Islam than anything else. Bullets and beans brother...","commenter_a":"Notice that the UN is NOT pushing to fight Muslim extremists so these people don't have to flee their homes? That they're trying to export them around the World instead? The reason is OBVIOUS. To create chaos and bring down western culture. Look at France and Germany's problems with the bastards..","post_message":"That was a ... BAD idea. Check it out. @webpagelink"},{"comment_id":"10153489348776756","commenter_b":"Only a woman could find something completely fucking trivial to bitch about a great thing.","commenter_a":"#FirstWorldNonProblems","post_message":"\"Can I just passively refuse to pass the beach balls back up until they collect around my feet in one incriminating pool? How coldly can I glare at the people who try to resurrect the beach balls I've silently condemned to the ground?"},{"comment_id":"10153542396586336","commenter_b":"A third term would be so awesome. Obama could really clean everything up. Do away with guns and churches- and make EVERYBODY git GAY MARRIED! yupyupyup....","commenter_a":"I don't even listen to the guy bc all he does is lie and spew gutter trash. He's an embarrassment. I'm waiting for that executive order where he can \"order\" himself to have a 3rd term! Wonder if those neutered GOP \"leaders\" will actually do anything then or just \"say\" they will! They are all sickening!","post_message":"Do you agree with Charles Krauthammer?"},{"comment_id":"10154318363317232","commenter_b":"Why aren't they being plowed through? Run these scumbuckets down!","commenter_a":"Sent in the robot","post_message":""}]
