[{"comment_id":"1363879910298702","commenter_b":"Yeah! Stupid Sheep","commenter_a":"Love Bernie Sanders! #feelthebern","post_message":"Bernie Sanders was cheered for like a rock star during his surprise visit to a Verizon picket line in Brooklyn today. Read full story: @webpagelink"},{"comment_id":"10155231887371037","commenter_b":"@username Proof he has no respect for the other branches of government.","commenter_a":"It's pretty sad that he's got to be the target of all this hate. It seems so many people can't go a single day without being hateful or judgemental. How can a group of people that claim to be loving and caring be so hateful and ugly hearted?","post_message":""},{"comment_id":"10152964045994753","commenter_b":"I must be living wrong, that bitch","commenter_a":"This is in England so who cares","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"1245500588795529","commenter_b":"Clinton thugs!","commenter_a":"@username-- You proud of this?? After watching this, I'm gladly giving my vote to Trump now. These Mexicans don't represent me, & aren't \"Americans\" acting like thugs.","post_message":"MUST WATCH: Video documents months of violent attacks by the radical left on Donald Trump supporters that are COMPLETELY ignored by the mainstream media. This video compilation shows Trump fans assaulted all ACROSS the nation. Worse and not surprising, the media, the left, and Hillary Clinton herself BLAME Trump for these violent assaults when they should be blaming those attacking the Trump supporters. Show your support for Trump by getting the TRUMP: REAL HOPE, REAL CHANGE bumpersticker! --> @webpagelink"},{"comment_id":"1377352988951720","commenter_b":"@username ok naked girl","commenter_a":"Chaos? Not really, just a bunch of virtue signaling, brainwashed and hypocritical snowflakes doing their stunt... Stop this nonsense, people support Trump!","post_message":""},{"comment_id":"10154081202079205","commenter_b":"We now need the DNC to forever get rid of super-delegates. This should be an immediate mission, so this never happens again. Contact the DNC and demand we end the Super-Delegates! #DNC #NoMoreSuperDelegates #ListenToVoters #VotesMatter @webpagelink Mailing address: Democratic National Committee 430 South Capitol St. SE Washington, DC 20003 Main phone number: 202-863-8000","commenter_a":"Yes it was a circus , that's too bad , 15 rounds Trump TKO not a knockout","post_message":"What did the polling look like heading into the CNN New York Democratic Debate, did the polls impact #BernieSanders or #HillaryClinton performance in the debate?"},{"comment_id":"470909953099585","commenter_b":"Every state should step up and protect our America, muslims can keep their beliefs to themselves, ban Shariah Law in all 50 states!!!","commenter_a":"WTF","post_message":"Muslims trying to force Shariah Law on Alabama just got owned. Good. We won't stand for Shariah Law in America. Do you agree this should happen in all 50 states?"}]
