[{"comment_id":"903353419700080","commenter_b":"She is so nasty looking all the time I bet she stinks","commenter_a":"What is Always wrong with her tongue? Personal hygiene is a must. Can someone tell her to brush it .","post_message":"Awesome!"},{"comment_id":"10153224206704726","commenter_b":"What is this surprising? That's what her husband preaches to us all... GIVE ME..GIVE ME","commenter_a":"She needs to be charged Millions for just being allowed to live in WH.","post_message":"WATCH: Obama: Michelle Upset She's Not Being Paid as First Lady"},{"comment_id":"1009448912521620","commenter_b":"I'm sick of seeing her scrunched up \"end of her world\" face. She and the others like her are the problem. Sorry cupcake, grow up and accept it.","commenter_a":"I dont see how any employer would want to hire these idiot mellinials.they dont think for themselves.they dont research for the trueth basicly you dont want morons working and running your buisiness.","post_message":"Ummm... WHAT?"},{"comment_id":"1062577053802042","commenter_b":"She looks like the kind of woman who would beat up a man alright. Man, that face is the stuff of nightmares!","commenter_a":"Domestic violence in the Clinton home?","post_message":"Does Hillary beat up Bill?"},{"comment_id":"1121295257893818","commenter_b":"Maybe the sign should have said \"ladies don't pee on the toilet seat\".","commenter_a":"By the Holy Ghost I am being formed in the Earth! Says the Lord, My Time has Come! When I say, , My Kingdom COMES FORTH! Now is the Day of Salvation! Whoever wants it . Whoever is thirsty for Right and Good, . Whoever is hungry for Love and Peace and Deliverance from evil, . Now is The Time!!! When u Ask me, I give. Whoever Asks will Receive. Believe! Believe! Believe! Now is The Time!","post_message":"The owner of Windy City Pizza posted a sign that appeared to reference the controversial topic of transgender restrooms: @webpagelink"},{"comment_id":"1084321754934235","commenter_b":"Get the hell out and sell the house.","commenter_a":"I'm literally crying right now hahaha","post_message":"Police in Sydney told the man neighbors heard death threats, screams and the crash of furniture being flung around."},{"comment_id":"10152734752677434","commenter_b":"Lol","commenter_a":"Hmmmm I actually do think he's kinda sketchy re: women. If he's so power to the people, then where was he when Gore or Kerry ran? Just sayin","post_message":"Bernie Sanders wrote an essay in 1972 that mentions rape, and it's weird as hell"}]
