[{"comment_id":"221003188363637","commenter_b":"@username And worse!!!! No wonder she needs to shop!","commenter_a":"Wait wait wait...I thought Trump's doctor told us that if elected, Trump would be the fittest, healthiest man to ever serve as President! You mean I was lied to about Trump???","post_message":"TELL US IN THE COMMENTS!"},{"comment_id":"10154238918214411","commenter_b":"truth hurts huh","commenter_a":"Republicans are nothing but Bible toting A HOLES who care nothing for other people you know that the party is a minority why you ask because the only way these jerks get elected is because of voter apathy if everybody would vote the Republican jerks would dry up and blow away","post_message":"Cheer up Republicans. The presidential race may be a mess, but you controlling state legislatures..."},{"comment_id":"1754512868165576","commenter_b":"Hillary will follow him ..........because she also wants Muslim invasion in United states.","commenter_a":"Barack Obama is the worst president ever in the history of the United States of America","post_message":"\"I fully expect by tomorrow morning that President Obama will ... give a press conference in which he'll explain that the problem is too many trucks. If only we had truck regulation then we wouldn't have problems like Nice, because it is trucks that are dangerous.\" – Newt Gingrich"},{"comment_id":"404568359667759","commenter_b":"They all need to go somewhere else!","commenter_a":"what is wrong with the United States flag this is United States we have the right to fly our flag just like any other country","post_message":"Why do some people want to ban our flag?"},{"comment_id":"1383945224964701","commenter_b":"Go away lady","commenter_a":"She definitely needs a half dozen chill pills....","post_message":"Sen. Elizabeth Warren has taken to Twitter to attack what she calls presumptive Republican presidential nominee Donald Trump's toxic stew of hatred insecurity."},{"comment_id":"789227971267780","commenter_b":"She's no lady !!!","commenter_a":"I am a democrat, yes a liberal and I have nothing but respect for our law enforcement officers. This young lady has a bad attitude and needs to learn respect. He did his job. No one is entitled.","post_message":"Obama Support Gives Cop Serious Attitude, Immediately Get’s What She Deserves [VIDEO]. Wow, she just made the biggest mistake of her life. Do you support our men and women in blue?"},{"comment_id":"990789407625962","commenter_b":"In coming President~Trump ^ seek and destroy all opposition within our borders and outside our borders VOTE TRUMP","commenter_a":"These and all jehadic Muslims are evil and need to be killed period.","post_message":"Who saw this coming? [Read below]"}]
