[{"comment_id":"940671535979474","commenter_b":"Traci, if you feel that way then please block me.","commenter_a":"The trolls are up and ready. I see no great news for women. No woman should have the right to kill, like no man should have the right to force himself on her. Two wrongs don't make a right.","post_message":"Life begins at conception and it's time the law reflected this obvious truth! Have you signed YOUR petition yet? Click HERE to urge Congress to pass the Life at Conception Act! @webpagelink"},{"comment_id":"1336076649746676","commenter_b":"It doesn't bother me at all","commenter_a":"Why does everyone need a day? Doesn't this kind of thing really inadvertently promote bias by constantly bringing up the differences between us all? We are all human and we all have strengths and weaknesses in different varieties this should be a strength among us not a divisive problem. If everyone would stop talking about it so much things would get much better. Make your decisions about people on an individual basis.","post_message":"Today is International Women's Day and to celebrate, we will be posting a series of images commemorating extraordinary women in the field of science that we believe you should have heard of. #WomenYouShouldHaveHeardOf Image courtesy Jewish Chronicle Archives/Heritage-Images."},{"comment_id":"921176444602838","commenter_b":"Bernie or Hillary will destroy the economy with their policies. Plus, they're so weak on immigration and would prefer for the illegal immigrants, who by the way, suck up over 150 billion dollars per year, to stay. Trump is on point with just about everything.","commenter_a":"Michael Luna Can't wait to see what Obama says or these other people just opening the gates to everyone... Donald J. Trump is right on this one, we need to close the border right now...","post_message":"The two men have been training at the base since February and “were screened prior to their arrival in the United States more than a year ago,” according to the statement."},{"comment_id":"10153935705086756","commenter_b":"@username And millions of flys eat shit daily.","commenter_a":"I agree with Paul Ryan. I didn't want him to have the job either. Or any other job. Anywhere.","post_message":"Ryan has said at least three times in the past year that he did not want the job. Now it's his."},{"comment_id":"633140033543242","commenter_b":"That's Ok She will BURN IN\"HELL\" Along with All The Rest of the Sheep That Followed HER !","commenter_a":"Ugly inside and out AND GETTING WORSE EVERY DAY","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"},{"comment_id":"10153535750495667","commenter_b":"@username she is a horse","commenter_a":"She's still ugly and that will never change!","post_message":"Michelle Obama turned Friday the 13th into a fashionable affair."},{"comment_id":"10154411481819062","commenter_b":"Or the reverse at movie theaters. How will women react when a bunch of not-women get in line in front of them while the men's restroom has nobody in it?","commenter_a":"So he/she's will get to sit on the can in the Women's rest room. Well turn about is fair play, women using the men's room when there is a line at sporting events. How will men react when they are standing at the urinal and a woman walks by heading for the toilet stall?","post_message":"HAPPENING TODAY: In about an hour, business leaders are expected to reveal their plans to support the Houston equal rights ordinance."}]
