[{"comment_id":"10153406887426955","commenter_b":"Can't wait until someone drops a house on Hilary.","commenter_a":"I'm no detective, but my guess would be Hillary, I mean the wicked witch of the east.","post_message":"WHO STOLE DOROTHY'S SLIPPERS?"},{"comment_id":"1875497529335937","commenter_b":"Ann Coulter is a very dumb idiot. I wish she would disappear","commenter_a":"That would keep many of his own people from voting.","post_message":"Fact check! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153163380586336","commenter_b":"ANIMAL! wait is that Obama's son??","commenter_a":"Hang em on national TV.","post_message":"UPDATE: A third man has been charged with sexually assaulting a woman during spring break in Panama City Beach, Florida, that was captured on cellphone video, authorities said."},{"comment_id":"10153866703120575","commenter_b":"Yeah she has hate written all over her face. Smug bitch","commenter_a":"Megyn's dislike of Trump is obvious.,and a bit over the top, clouding her Demeanor, Neutrality, and Professionalism.,she may have to pay the Piper if Trump goes all the way,!! Though, I don't feel Trump is a Vengeful person,!!","post_message":"66,000 Signed Petition to Boot Megyn Kelly from FOX News Debate!"},{"comment_id":"10154113063315950","commenter_b":"@username wrong. Polls showed Hillary winning the ELECTORAL vote. Wanna try again delusional one? #ShesNotYourPresidentAndNeverWillBe #GetOverIt #SoreLoser","commenter_a":"Polls Smolls! Haven't we learn anything when it comes to \"polls\"?! Bwhahahaha!","post_message":"Barack Obama has a 50 percent approval rating heading into his final months in office, a new poll found Monday."},{"comment_id":"10153236342649255","commenter_b":"What can you expect from a LIAR!","commenter_a":"That's why I dislike Christians their not trustworthy.","post_message":"Lies. All of it."},{"comment_id":"10153270898427217","commenter_b":"Wife is an idiot to allow this! Publicity stunt completely!","commenter_a":"Great job, idiot parents. Way to teach your kids how to be sexist, abusive morons early in life.","post_message":"🎄🎄 Funny or offensive? 🎄🎄"}]
