[{"comment_id":"1028867523831550","commenter_b":"STFU pussy","commenter_a":"Misunderstood character, he was not some badass Ranger, he was literally some kind of clerk who got brought along at the last minute. To me, this character represents the fears of what the average person would feel in that situation.","post_message":""},{"comment_id":"1849595058601808","commenter_b":"That's one hypothesis...","commenter_a":"Jamie Steward","post_message":"Believe it or not, this has been a complete mystery for a long time. But there IS an evolutionary reason for it."},{"comment_id":"1906434399416299","commenter_b":"Imagine something bit u on ur naked body lolzz","commenter_a":"The restaurant name should change to Animals restaurant","post_message":"Owners describe it as an 'orgasmic atmosphere.'"},{"comment_id":"2040319902861153","commenter_b":"Trump dont controll the border walls he will make trouble here in border town n Mexico... we have crime here due to there here already the Cartels n Zetas in da USA in the border cities... USA build walls the always around or underneath or make ladder in the walls","commenter_a":"Wow. You hate waterboarding of terrorist and protest on the streets of America on their behalf. But the beheadings of American soldiers, christians and innocent civilians in the Middle East and nothing said on the streets of America. And you call yourself an American. Seems like the left is more interested in open bathrooms and open borders, hmmm?","post_message":"Wake up, America!"},{"comment_id":"858797117508627","commenter_b":"& the rich bastards don't give a shite.","commenter_a":"rockthevote.com","post_message":"Unless we take bold action to address climate change, our children, grandchildren and great-grandchildren are going to look back on this period in history and ask a very simple question: Where were they?"},{"comment_id":"10153192741541336","commenter_b":"@username you sit there and bad mouth President Reagan about low wages and high debt well buddy you ain't seen nothing yet. obozo is bringing in all the illegals and he is giving all the companies a bonus to hire illegals over American citizens because they will work for lower wages so all wages will be kept low and where do you think obozo is getting all this money that he is passing out? It is not all taxes because if you don't work you don't pay taxes and the illegals don't pay taxes on what they earn. He is adding to the national debt by borrowing more money.","commenter_a":"I am 17 and a college student and this breaks my heart. Do people know what he did for the country? He was not perfect but he made America strong.","post_message":"Can you identify this man?"},{"comment_id":"954260038007303","commenter_b":"Shut up pain your wife's ugly","commenter_a":"@username 1254149964595086mond DeBusschere @username @username reminds me of the good ol days at the barracks","post_message":"Friends like this #WSHH"}]
