[{"comment_id":"10153564191549270","commenter_b":"Chupacabra, pick up DOD Files hay accurate B 52 bombing during knock out gooks ... evaporated socialists and during First Iraq company","commenter_a":"When the last time bombardier B52 knock out targets accurately .... during .Vietnam... Flight over Chinese and just scare... scare Chinese...","post_message":"\"We conduct B-52 flights in international air space in that part of the world all the time.\""},{"comment_id":"10153224960603984","commenter_b":"oh boo fuckin who leave bitch and take your husband with you","commenter_a":"She's out of touch on everything!!","post_message":"People are furious, and I can understand why. Do you think Michelle is an out of touch First Lady?"},{"comment_id":"10153575842934087","commenter_b":"If she withdraws we can toss her and Bernie a Peanut.","commenter_a":"Of course, who wants to be a target for Hillary shaming?","post_message":"Pressure is building on Democrats to rally behind front-runner Hillary Clinton after her strong Super Tuesday showing, but 22 House members and five senators are holding back."},{"comment_id":"10153618680301336","commenter_b":"I don't agree with what happened to Mr Ramos but I emphatically want the illegals sent packing and our borders fortified!","commenter_a":"Moron","post_message":"ICYMI: Univision anchor Jorge Ramos told Megyn Kelly that Donald J. Trump's immigration plan is full of empty promises. What do you think? @webpagelink"},{"comment_id":"1744224175810403","commenter_b":"Stupid girls lol","commenter_a":"Jeen Russel how dumbs lool 😂","post_message":""},{"comment_id":"862078977258615","commenter_b":"Most abortions are not because of these \"terrible diseases\", so quit using that as an excuse.","commenter_a":"Conservatives are pro-life until the child is born poor. Then they are just lazy and a drain on society. Pro-life my ass.","post_message":"One of the few actresses that isn't ashamed to be conservative and pro-life! One of the big reasons I support her :D"},{"comment_id":"10152922358545927","commenter_b":"PLEASE GET RID OF THIS TRAITOR NOW.","commenter_a":"This guy is quickly becoming a fossil himself.","post_message":"Obama VOWS to \"convene other nations to meet THIS threat. ...\" Can you guess what \"THREAT\" Obama is trying to combat?"}]
