[{"comment_id":"1011455315580612","commenter_b":"Is this guy a republican?","commenter_a":"Ignorance perpetuation personified!!!!!","post_message":"This guy is a complete moron."},{"comment_id":"439208642934096","commenter_b":"She should be fired !!!!!!!!!!!!!!!!!!!","commenter_a":"The teacher should be fired and possibly sent to Afghanistan!","post_message":"An Illinois teacher was placed on leave after stomping on the American flag in front of students. That teacher should be ashamed; the American flag deserves to be flown everywhere with respect and honor! ForAmerica"},{"comment_id":"10152871405466717","commenter_b":"I remember seeing this it really touched my heart loved it!!! And those moms can suck it!","commenter_a":"Moms... eat shit and die! Hypocritical, bigoted ass-holes..... 1,000,000 Moms = about 12 homophobic morons!","post_message":""},{"comment_id":"10155025944411509","commenter_b":"That is not a woman.","commenter_a":"Why is this even news. Do we report on all suicide attempts by convicted criminals or just the Transgender ones ? Bias, bias, bias....","post_message":"U.S. Army soldier Chelsea Manning, imprisoned for leaking classified documents, tweeted that she was \"glad to be alive.\""},{"comment_id":"761832037248738","commenter_b":"The Dell was your first mistake buy a Mac or a HP","commenter_a":"Bubba killed the jukebox last night...","post_message":"\"Man Kills His Computer.\""},{"comment_id":"1269429443084021","commenter_b":"I prefer the lady in the center.","commenter_a":"I bet I can tell you which one sells the most copies haha.","post_message":"For the first time ever, there are three different Sports Illustrated Swimsuit covers – representing women of all shapes and sizes. @webpagelink"},{"comment_id":"10154230428956509","commenter_b":"To protect us from bringing terrorists here. How can you tell if a Muslim is not an extremist?","commenter_a":"I don't think they should have to be Christians, just not Muslim.","post_message":"\"I don't know if you can prove that they're Christian... How are they proving it?\" Donald J. Trump said about Syrian refugees. @webpagelink"}]
