[{"comment_id":"10154133163039032","commenter_b":"Ohhh waaaa, namecalling hurts soooo bad, better to be a pig and be free than to be \"hip\" and be a socialist. Again libtards are so out of touch with reality its scary, you all hate this country and the constitution but yet none of you have lived in anoyher country to compare. Like I said, try living in China or Cuba, or Greece, or Russia if you all think big government and socialism are so great. Btw, name calling and insults mean nothing.","commenter_a":"To the guy with \"the america was never great\" sign, why don't you go live in another country for awhile and then come back and waive that sign. Scary how delusional some people are.","post_message":"Music, signs and lots of confrontation between Trump protesters and rally attendees in Prescott Valley. @webpagelink"},{"comment_id":"1160665140611621","commenter_b":"Men, have no business making any rules or laws that apply to women....PERIOD !","commenter_a":"Who elects these illiterate morons? New Hampshire, step up your game.","post_message":"These male legislators may not be grown-up enough to talk about women's bodies."},{"comment_id":"10153409867621051","commenter_b":"Where is your neighborhood bitch I'll be there with bells on think it's a game","commenter_a":"You darkies try and pull a stunt like that in my neighborhood , you'd be leaving in a body bag . KKK TIME !!","post_message":"Beating this teen girl senseless wasn't enough for these women. They also decided to leave a special message on her forehead."},{"comment_id":"10154490507826051","commenter_b":"Absolutely NOT! Lying Ghetto trash Marxists.","commenter_a":"Absolutely did not he's a Muslim has no class.","post_message":"Yes or no: Did the Obamas represent America with class and dignity?"},{"comment_id":"1383272325035057","commenter_b":"Donald is a leader and believe in America! Vote Trump 2016!!!!","commenter_a":"You can bet Lying ted is on that list!","post_message":"The process, meanwhile, is the only reason he will get even close to 1,237"},{"comment_id":"1676679282547936","commenter_b":"The women do have a choice... Unless they revolt.","commenter_a":"her crime was that his dinner was served to late by his wife and it was too cold for his liking..... Why would ANY woman marry a Muslim man? .... Even a Muslim woman.......","post_message":""},{"comment_id":"10154754813479369","commenter_b":"She is ALL Talk!!! A PERFECT Politician!","commenter_a":"I can't wait until he is prosecuted for all of the crimes he has committed. Will that happen? With a just justice system it will.","post_message":"Trump to Clinton: 'You'd be in jail' if I was in charge."}]
