[{"comment_id":"1242326225802834","commenter_b":"There are many exceptions to this, these comics are just to stir shit up, and promote dissatisfaction, imo. Live your life to the fullest and stop getting offended so much. It's not worth it, spending your life on this planet worried about what some shithead says or thinks about you.","commenter_a":"Hey ATTN, did you know there is a mass extinction going on globally? Maybe your perceptions of gender roles can take a back seat and you can do something more useful with your time.","post_message":"The double standard is all too real."},{"comment_id":"10154789025934641","commenter_b":"If wonder woman can do it ..so can I","commenter_a":"This is so disappointing. Anyone petitioning for the removal of Wonder Woman as ambassador, clearly doesn't know the history of the character. Peace Justice Equality ...and more. Bottom line: basing her removal mainly on appearance - is sexist. Look at male superhero costumes. They leave little to the imagination also. No one is hollering about that. As a feminist, I understand that the sexual objectification of women is a huge problem in our culture. The answer is not to force women to cover up. The answer is to allow women to express themselves without fear. The answer is to teach our boys how to behave. Read the comics. Read the history of the character. Read scholarly articles on WW as a feminist icon. She has pro-women zingers that make me cheer! Many parts of her \"sexy\" costume are actually powerful symbols. Do some research. I know there are more important ...","post_message":"Wonder Woman has been stripped of her role as UN honorary ambassador less than two months after the appointment was made."},{"comment_id":"10153629049609255","commenter_b":"Hey JEB. Your mom called: @webpagelink","commenter_a":"Pay no attention--he's speaking with his head---UP HIS ASS---AS USUAL !!","post_message":"Jeb! Bush, noted women's health expert."},{"comment_id":"10153482643681130","commenter_b":"its on your page Joseph Zawistan","commenter_a":"\"Recent graduate initiated hunger strike\"....Lol. Why don't you use your degree and go get a fuckin.job and concentrate on future like you're supposed to do when you graduate.","post_message":"There's been a call for three top Student Senate leaders to resign, and a recent graduate initiated a hunger strike."},{"comment_id":"10153862572524369","commenter_b":"I have pretty extensive vocabulary and definitely don't need to use slang so by all means generalize and assume that we all say it...it's sad people are really this stupid.","commenter_a":"If they want the racial slurs to go away, they need to stop saying them as well. It's a double standard.","post_message":"Student groups have complained for months of racial slurs and other slights on the overwhelmingly white campus. Now, more than two dozen players say they're staying on the bench until the university's president is removed due to his \"negligence toward marginalized students' experience.\""},{"comment_id":"10155262254115725","commenter_b":"Well he's a she.","commenter_a":"I don't care what he does.","post_message":"Flash Survey: Does Hillary Clinton's use of a personal email account to conduct Secretary of State business hurt her potential presidential run? Vote here ---> @webpagelink"},{"comment_id":"10152956998151051","commenter_b":"Good! Send her ass to prison!","commenter_a":"Good","post_message":"Remember the veterinarian who got fired after doing this to a cat? Well, she just got some more bad news."}]
