[{"comment_id":"10153049947289170","commenter_b":"From the info I have seen, they have entire areas that could just be surrounded and taken out......all those \"unsafe for non-muslims to enter\" areas......","commenter_a":"At least someone in power will acknowledge these Muslim terrorists need to be taken out! The problem is they have almost completely taken over France at this point. Apparently France has over 750 No-Go zones in which only Muslims are allowed to live and travel in these territories. Sadly the govern has let them take over like this.","post_message":"I guess this was some reality check."},{"comment_id":"10152556429696680","commenter_b":"I think it has been established that there would be a guest worker allocation. I am more concerned with the 40% of Illegals that are OVER stayed Visa workers! They come here on Visitor,Student and Work Visa's and don't leave when their term limit is up!! They are taking jobs from all levels of American workers!!","commenter_a":"In the meantime how about passing E-Verify and prison and fines to those employers that hire illegals??","post_message":"The House might have to delay consideration of its border security bill until the middle of February. @webpagelink"},{"comment_id":"1598021397151640","commenter_b":"At least God is doing something to help with the immigration problem.","commenter_a":"He is a wonderful god","post_message":"WHOA!"},{"comment_id":"1091133320986005","commenter_b":"Hillary should be jailed as well","commenter_a":"Austin no your ignorant","post_message":"WATCH LIVE: Donald Trump on the final day of campaigning in North Carolina"},{"comment_id":"10153907733031002","commenter_b":"I don't believe she \"deserved\" it at all. I also agree that a man that size obviously has other options to restrain someone. These girls need to realize these men aren't their daddy, brother, uncle.. They don't know how they are going to react, so they need to keep their hand to themselves. Neither party was right here.","commenter_a":"She Wasn't out of pocket. Just Because she was waiting for her brother that gave him the right to grab her up like she was an issue. This is a grown man, you don't punch a teenager on the face like she a man. He had no right to ever touch her, her brother was just trying to protect his sister, as he should.. PEOPLE are out of control.","post_message":"A mother is demanding answers after her daughter was punched during a heated exchange at a skating rink."},{"comment_id":"10154713916667446","commenter_b":"It's her normal way. She's a bitch","commenter_a":"Trying to be as objective as possible.., she comes across as very angry and off putting , yikes","post_message":""},{"comment_id":"10154167582371770","commenter_b":"LMAO they are their own worst enemy","commenter_a":"Sweet, we probably bought it as taxpayers.","post_message":"Liberals protest Trump by ... setting a Muslim immigrant's limo on fire."}]
