[{"comment_id":"10153205504771336","commenter_b":"You need to get the Fffff out there's you are useless Lady or what ever you are. You are a disgrace.","commenter_a":"Recall this mayor!","post_message":"“I never said, nor would I ever say, that we are giving people space to destroy our city. So my words should not be twisted.” Mayor Stephanie Rawlings-Blake spoke to reporters moments ago amid growing violence and chaos tonight in #Baltimore."},{"comment_id":"897189237043996","commenter_b":"No I hope not we need Hillary to run in 2016 . With all her baggage she will guarantee a Republican in the White House . She will be so busy trying to cover her tracks in crimes she won't have time to campaign ! And Billy's little visits to Orgy Island is going to be the next ship to sail !","commenter_a":"Hillary will walk all over him!","post_message":"He went to high school with Jeb Bush."},{"comment_id":"861742507286409","commenter_b":"This is a beastly crime Do what should be done to an inhuman beast! KILL IT.","commenter_a":"Beat him to death like he did the veteran","post_message":"Refugee Charged With Murder After Beating 97 Yr Old WWII Veteran To Death. No media outrage, no riots, nothing. What do you think his punishment should be?"},{"comment_id":"10152981955661336","commenter_b":"Obama the terrorist wants Islam to take over America!","commenter_a":"There's no sense in complaining!The people can get rid of obuma anyday they choose to!!","post_message":"\"[President Obama] clearly romanticizes Islam and treats it as though Islam is above all criticism… And until we hold Islam to the same standards as every other religion, ethically and behaviorally, terrorism wins.\" – Lt. Col. Ralph Peters"},{"comment_id":"1116898208348184","commenter_b":"She's the prime example of a \"nasty\" woman","commenter_a":"As if anything this trash had to say matters!! She's disgusting herself!! I mean she's into animals and champagne bottles!! Hello!! Need I say more. Madonna , you're far from a woman if virtue!!! Lmao","post_message":"Madonna slammed Donald Trump, claiming that he 'hates people of Color and Women and is Anti-Semitic.'"},{"comment_id":"10156861000555725","commenter_b":"No more stuffed-shirt limp-wristed men who talk to us in carefully chosen PC correct words .... We need a real man to take control of our country and return us to our glory days! AMERICA FIRST - EVERYONE ELSE IS A DISTANT SECOND ...... #TRUMP2016!!","commenter_a":"Why would anyone believe Breitbart after they made a business deal to screw one of their own?","post_message":"WOW! An honor to be the first-ever presidential candidate in a primary- to be endorsed by the National Border Patrol Council. WE WILL BUILD THE WALL-- WE WILL MAKE AMERICA SAFE AGAIN! Thank you."},{"comment_id":"10153504055809024","commenter_b":"If she is that ugly let her hide.","commenter_a":"It dies offend me that someone would hate women so much to do this to them","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"}]
