[{"comment_id":"10153619794460575","commenter_b":"You can see how they are when they don't get their way they are illegal illegal illegal shoot shoot shoot","commenter_a":"Cant wait for Trump to win and stop these third world demonstrations by illegals that dont belong here","post_message":"Trump refuses to be silenced. . ."},{"comment_id":"10154557994494087","commenter_b":"She is a lunatic! Ugh","commenter_a":"Jeff Sessions was that racist that prosecuted the KKK and has many black friends who defend him, yet Senator Warren throws the racist term around while pretending to be a native American? I don't get it. If you just hate someone just say it. Calling him a racist simply makes Ms Warren a racist and someone who stole from native Americans in order to further her financial coffers. You ma'am have Skelton's in your closet, live in a glass house yet you cast the first stone. Remember those HS days and your words Senator Warren.","post_message":"Elizabeth Warren: “Consider this MY warning: We won’t be silent. We will speak out. And we WILL persist.”"},{"comment_id":"1017809398240071","commenter_b":"Thought it was a low-res depiction of a chicken...","commenter_a":"Lexi Langlinais !!!","post_message":"A huge asteroid is set to pass close to Earth."},{"comment_id":"10153393648949228","commenter_b":"Actually, it's not normal for any woman to expose herself in public... feeding or not. It's quite self-centered.","commenter_a":"We all have to have something to complain about. It's like the news gives us one good story and the rest has to be bad. Give it a rest people. It's a normal mother instinct. LEAVE IT ALONE","post_message":"\"The mall told me it's perfectly fine, perfectly legal to breast-feed."},{"comment_id":"10153606624740667","commenter_b":"How's that gun free country law working out for them now ?? President Carter band Iranian Muslims during the hostage crisis & deported over 20,000 Iranian students, Iran is a Islam Islamic nation. Democrat's never called him a racist. US immigration Laws cover religious test for immigrants !! The AR 15 is not a military assault rifle & not fit for hunting deer or elk by some hunting laws, it's a singal shot gun !! Some pistol clips holds 15 rounds of ammo !! PS: Hillary is on record in support of a wall on US Mexican border !!","commenter_a":"So sad. :(","post_message":"BREAKING: Jo Cox has died."},{"comment_id":"865762326792523","commenter_b":"She needs to go home and git her dildo and go for a ride","commenter_a":"I'm sure Netanyahu is ignoring them...","post_message":"Why does the Democratic Party hate #Israel so much?"},{"comment_id":"895356030506185","commenter_b":"Saudees R disgusting devils.","commenter_a":"Saudi regime should be removed out of power and kicked out of the country.","post_message":"What do you expect of the #Saudi aggression against #Yemen? Raise your voice by taking part in our poll: www.presstv.ir"}]
