[{"comment_id":"10152783223285667","commenter_b":"I wondered what happened to the bikes. Bike sale soon????","commenter_a":"Yes and they have confiscated over 150 bikes..Bikers are pissed off","post_message":"Some of the dead and wounded may have been shot by officers responding to the bedlam, a Waco police spokesman said."},{"comment_id":"10153784012776337","commenter_b":"Bitch you won't riot. You'll cry !","commenter_a":"if you kill glen we riot","post_message":"HE TRIED! One The Walking Dead character would still be alive if producers had listened to Andrew Lincoln..."},{"comment_id":"10152881862581051","commenter_b":"Fry the bitch","commenter_a":"Sad god be with her","post_message":"When police responded to the 911 call, they saw this woman on her front lawn - covered in blood. But even that didn't prepare them for what was inside the house."},{"comment_id":"10154379818081509","commenter_b":"Go away Judy womble","commenter_a":"Shut up Donald...go away","post_message":"\"I think she's right -- I am angry.\" In an interview on Erin Burnett OutFront, Donald J. Trump responded to Nikki Haley's remarks about him after #SOTU. @webpagelink #TrumpOnCNN #SOTUresponse"},{"comment_id":"1180816798605996","commenter_b":"Our babies are so talented and intelligent","commenter_a":"Aram Kc Julia McLeod Ayling","post_message":"Happy International Cat Day!"},{"comment_id":"1610489359249521","commenter_b":"Maybe she'll have a stroke.","commenter_a":"She has RECENTLY HAD 2 BLOOD CLOTS ON HER BRAIN, FROM WHEN SHE FELL AND HIT HER HEAD. SHE IS EASILY CONFUSED, STAMMERS, SHORT-CIRCUITS , AND IS DILLUSIONAL. She is not well. \"THOU SHALL BEHOLD AND SEE THE REWA.RD OF THE WICKED\" !!!!!! Psalm 91.","post_message":"Hillary Clinton apparently needed assistance standing up at a rally."},{"comment_id":"10153511380259641","commenter_b":"I can't believe some of the comments here - So much hate {that's not justified} :/","commenter_a":"RIP the old England, lost to Islam now.","post_message":"#TBT:"}]
