[{"comment_id":"412094642305750","commenter_b":"Wow, this skank is as dumb as they get. Might be too much time on her back.","commenter_a":"Hey joe, arrest this clown. Lol.","post_message":"It's time for the Sheriff to pay up!"},{"comment_id":"800970150035571","commenter_b":"Stupid...sheeple its a bathroom!","commenter_a":"Target Please close doors move out of there where they respect all the people,,,,","post_message":" continue to believe that this is the right thing for Target,'' the company told TODAY in response to the boycott."},{"comment_id":"616683421873704","commenter_b":"I do too, Hillary won that election! They stole it and tainted our votes.","commenter_a":"Not my President impeach impeach impeach","post_message":"Share if you do too! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"439363889585238","commenter_b":"This not funny I found it tasteless made my blood boil I am seeing red ! Someone needs to stop her from having any more kid someone put the whore to work fast she is hurting all of us","commenter_a":"SEND HER TO IRAN...","post_message":"“I mean, who would want to work in America?\""},{"comment_id":"10154460389668445","commenter_b":"If this were on a normal sized girl, those panties would be muffin top city.","commenter_a":"What happened to the girl in the black suit her waist is half missing. Photoshop fail. Hahaha","post_message":"#Getstoned, caption this photo and tag two friends. These tees and more on sale shop.hightimes.com/collections/sale-items"},{"comment_id":"1315765065158489","commenter_b":"I think.. Mexico already knows where the border is...start shooting.... enough said!","commenter_a":"Mr. Trump - take down that wall !!!","post_message":"Pres. Donald J. Trump wants to pay for his proposed wall by slapping a 20 percent tax on imports from Mexico. Do you think the tax is a good idea?"},{"comment_id":"617179595103961","commenter_b":"She is SUPER PREDATOR HERSELF","commenter_a":"$illary🐍🐍🐍🐍🐍 in the grass she will do any thing say anything to win ... Oh ya she already has","post_message":"This Video SHOULD Cost Hillary Clinton The Black Vote"}]
