[{"comment_id":"10153567569125927","commenter_b":"The history of Islam counters everything he says about it. No surprise as he must have flunked history.","commenter_a":"pathological liar","post_message":"\"A perversion of Islam that has taken root ... that is appealing to even folks who don't necessarily know anything about Islam, and aren't even practicing Islam in any serious way ...\""},{"comment_id":"10153224449077293","commenter_b":"If it happens without her name on it, fine, but she still had no right to do what she did up to now and she has to get re-elected which I doubt she will. What she did was wrong and I hope she stays in jail. The nasty hag is going to be rich anyway because there's enough idiots out there to give her $$$.","commenter_a":"Simply put...it doesn't...","post_message":"The question has arisen before."},{"comment_id":"541079112748211","commenter_b":"Well then lady's better take another look at HiLAIRy nothing respectable there","commenter_a":"Both Hillary & Donald Trumpet don't belong as our President! Trumpet definetely can't be our President. He's full of so much anger & rage! Lord help us all! And, with Hillary, we risk open borders & even bigger issues with illegal immigrants! Our poor country doesn't stand a chance with either candidates! I don't trust either candidates!","post_message":"WATCH: Undecided voters describe Donald J. Trump and Hillary Clinton's debate performance in one word. #FoxNews2016 #Debates2016 How would you describe their performances? @webpagelink"},{"comment_id":"1558222467532092","commenter_b":"Oh, oh. Is this were the Kiju come from?","commenter_a":"And what will happen if we try and remove it? It will cause all kinds of movement in the earth's crust - aka DEVASTATING EARTHQUAKES!","post_message":"It's as much as 1,000km down, a third of the way to Earth's core."},{"comment_id":"1070333876354408","commenter_b":"She makes my ears hurt.","commenter_a":"She will say anything and she will lie to America like she's always there","post_message":""},{"comment_id":"1089340994496293","commenter_b":"Nope ! We won't be voting for her !","commenter_a":"What is she wearing; gift Wrap? I'm glad she's encouraging people to vote. Who you vote for is your personal choice.","post_message":"Miley Cyrus goes door-to-door at George Mason University registering college students to vote for Hillary Clinton abcn.ws/2dx2OnW"},{"comment_id":"1397496900343360","commenter_b":"\"I support the racist abortion of millions of black and latino children\", that all I see when I see anyone saying the support Planned Parenthood. Sounds like something close to what Hitler did... eugenics, anyone? Margret Sanger? Big fan of Hitler? Come on, it can't be a coincidence that blacks are encouraged by white PP employees to abort their babies, right? #StopRacistPP #ShutItDown #UGetMoreBensWitKids","commenter_a":"Or took their VIAGRA away. Bet we'd get some action then.","post_message":""}]
