[{"comment_id":"631712173663014","commenter_b":"Illegals should not have the right to vote.","commenter_a":"Trump is the answer our country needs at this point in time. I have a feeling that this election in November will bring record number of voters -- what I don't agree with is that illegals have the right to vote. That is why the Democrats are pushing this because otherwise they will lose. Voting should only be for US citizens. Looking forward to a better and greater America come January 2017. #Trump/Pence.","post_message":"Watch: This was the highest-scored moment of the entire 2016 Republican National Convention, and it happened during Donald J. Trump’s speech as he addressed the corruption surrounding Hillary Clinton. @webpagelink"},{"comment_id":"10152691933545950","commenter_b":"You look like a crooked bitch","commenter_a":"Yeah and what they are going to do give him the death penalty.....dam sure won't let him walk like they do those crooked a** cops","post_message":"A suspect has been arrested in the shooting of two police officers in Ferguson, Mo."},{"comment_id":"10152758029596545","commenter_b":"She was a nut, thankfully I moved not long after","commenter_a":"This reminds me of the time once I lived in Claremont, NH I was taking pictures of a pretty sunset in my front yard and my crazy neighbor threatened to come after me with a knife because she \"thought I was taking pictures of her\"","post_message":"Police are investigating after a man was shot and killed while taking pictures of the snow in Northeast Dallas just after midnight. STORY: @webpagelink"},{"comment_id":"953522348018789","commenter_b":"I demand that the offender's stop offending me. I'm tired of being offended. They get offended over Merry Christmas they get offended over In God We Trust, offended over the Ten Commandments... And the list goes on and on well if they don't like it move out of America.","commenter_a":"Why make something as general as a Cracker Barrel a racist issue? Stop creating trouble and problems needlessly! Enjoy this holy season and spread love and goodwill, not hate!","post_message":"Liberals are demanding that Cracker and Barrel change their name to this. We can let this happen. Let's show them our support. Can we get 30,000 'LIKES' to keep Cracker and Barrel the same?"},{"comment_id":"1123813841007500","commenter_b":"Illegals, you don't like our choice for president please do us a favor and go back to yours!","commenter_a":"Trump brought half his votes!!!","post_message":"WATCH LIVE: President Obama awaits Donald Trump's arrival at the White House for transition meeting. Story: @webpagelink"},{"comment_id":"1151245754895453","commenter_b":"Please like this page and visit this online clothing store and check the available stock. For all kind of Master replica and other beautiful stuff join us here. @webpagelink @webpagelink","commenter_a":"LOVE!!","post_message":"This 12-year-old boy — with no books and no money to get to the library — wanted to read so badly, he read junk mail. That was until his postman and the Internet stepped up to get him some books."},{"comment_id":"10153771879894714","commenter_b":"@username shouldn't of made it seem like she gets to walk away from killing someone when they wrote the sentence with the link attached.","commenter_a":"but if Caitlyn Jenner wasn't famous then she would be treated like everyone else and serve jail time.","post_message":"Caitlyn Jenner will not face criminal charges in the February crash that resulted in the death of another driver."}]
