[{"comment_id":"1658959434379097","commenter_b":"Nice boobs","commenter_a":"Sad.","post_message":"\"She could play a position if she wanted to,\" Donald J. Trump said of Sarah Palin, who threw her backing behind the real estate mogul on Tuesday."},{"comment_id":"10154603806201037","commenter_b":"You mean like your people did to the INDIANS","commenter_a":"If Mexico and Mexicans hate him so much, they are free to go back to their cesspool and stop raping the American welfare system!","post_message":"“[Donald J. Trump] is not welcome to Mexico. By 130 million people, we don’t like him. We don’t want him. We reject his message.\""},{"comment_id":"10154350204712994","commenter_b":"Have mercy. We need the capital punishment you kill you should be killed","commenter_a":"Carl. , I feel the same way .","post_message":"She was with a friend, and they got in an argument with some people at a liquor store. They left -- but the group followed them for a few blocks and then started shooting."},{"comment_id":"1066896063328404","commenter_b":"Get these suckers!","commenter_a":"Billie. Do you need to suck each and every bit of lefty nonsense and regurgitate it?","post_message":"Four House Democrats are calling for an investigation into the Center for Medical Progress (CMP) as the group’s deceptively edited video attacking Planned Parenthood continues to fall apart under public scrutiny."},{"comment_id":"10155152380736337","commenter_b":"\"I'm an idiot who has never read a book or even been in a bookstore but I fo sho is gonna post on Facebook all day and show those educated peoples the what for!\" And she says to get a life?","commenter_a":"I literally just had to google who J.K. Rowling is. This person has ZERO impact on me. I find it hilarious that these \"celebrities\" think that they impact our lives in any way, shape and/or form.","post_message":"BURN: J.K. Rowling's latest tweet-spree took no prisoners..."},{"comment_id":"1171399196245487","commenter_b":"She's better than me!..step into my personal space uninvited and your eye will get dot!!!","commenter_a":"Where's the guy in the 8 ball jacket when you need him???","post_message":"A racist Trump supporter went ballistic on a black subway passenger in NYC. #MicBrights"},{"comment_id":"10155752220095603","commenter_b":"Black lives must not matter too much, stupid idiots cannot stop killing each other.","commenter_a":"Tired of all this carp. Can we get along for a change.","post_message":""}]
