[{"comment_id":"118155238703506","commenter_b":"Yes, to bad they are ruining a great state. It's going to take more than Hollywood to support the illegals. Have fun, I'm gone","commenter_a":"Hell yesss goodbye","post_message":"There could be 49 states of America very soon. It's only a matter of time. Good riddance. Do you think we would be better without those libs?"},{"comment_id":"10156094482870354","commenter_b":"Throw that fat stank ass pig in the pen!","commenter_a":"She deserves the same","post_message":"***UPDATE***"},{"comment_id":"10153538979824117","commenter_b":"I feel like this world lacks sufficient moons for McAfee to howl at. I hope one day he can find his way home.","commenter_a":"Bye Felicia.","post_message":"Unverifiable accusations of skulduggery aimed at former Gov. Gary Johnson, and competitor John Mcafee says he cannot support the Libertarian Party if Johnson is the nominee."},{"comment_id":"10153914215895950","commenter_b":"Go fuck your cousin you wrong turn hillbilly bitch","commenter_a":"11 kids 10 women(I can only imagine what they look like...) there'll be no problem finding pallbearers for this one...Goodbye & Good Luck...","post_message":"Police say Walker, a.k.a. Shawty Lo, may have been the victim of a hit and run."},{"comment_id":"1146502822036413","commenter_b":"We can make the illegals pay taxes.","commenter_a":"He can just file bankruptcy when it's done being built.","post_message":"Constructing an impassable wall along the U.S.-Mexico border would be a tall order — even for master real estate developer and 2016 GOP presidential candidate Donald J. Trump."},{"comment_id":"1553570801369710","commenter_b":"The head of black panthers got robbed at gun point called police. They got his stuff back and arrested the criminal. Ben and jerry time to get your heads out of your ass. I won't buy any thing from you hope all true Americans stop buying your products let the boycott begin hope you lose millions in sales","commenter_a":"All lives matter.","post_message":"Why? Just...why"},{"comment_id":"1738890906325401","commenter_b":"Why no handcuffs? If i break the law and admit to it I'm no longer culpable? This should be challenged in every courtroom.","commenter_a":"California's Latino population is out of control. There are more Hispanics in California than there are people in 46 other states. 30% of all LEGAL immigrants come from Mexico. It's not \"diversity\" taking over, its misogynistic Hispanic rape culture being dumped on this country, and the democrats don't care how many little girls are raped & murdured and beaten & beheaded and sold into slavery & prostitution as long as they get millions of new voters. The age of consent for sex in Mexico is 12. In their culture it's ok to have sex with children. Not only that, these people are putting themselves in enormous risk, dying in the desert, and then we pay for them when they get here. It's madness! The majority of legal(51%)and illegal(72%) immigrants are on welfare according to the center for immigration studies. The number of immigrants on welfare should be 0! New report ...","post_message":"Note the swipe she took at Donald Trump..."}]
