[{"comment_id":"10153589793400329","commenter_b":"10154197025200954Mary Lu10154879708717248","commenter_a":"Ryan Bere still wanna do this?","post_message":"Jaws IRL."},{"comment_id":"10155996223940354","commenter_b":"Take their citizenship away and deport.","commenter_a":"Black trash","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS. Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"1868221936741025","commenter_b":"@username STUART BAILLIE IS RIGHT. AL SHARPTON IS THE ONLY MORON THAT LOST WEIGHT. ROSIE AND WHOOPI WILL NEED AN AIRBUS TO LEAVE HERE. THEY WILL HAVE TO MAKE A CUSTOMIZED GAS TANK TO HOLD ENOUGH FUEL TO GET IT OFF THE GROUND. NASA HAS ITS WORK CUT OUT FOR SURE. MAYBE THE ENTERPRISE USED ON STAR TREK WOULD WORK. BEAM THEM UP SCOTTIE. WARP 10","commenter_a":"I thought this fat fucking pig was leaving the country if Trump won. Just another piece of shit liar that won't leave as promised.","post_message":"Rosie O'Donnell has a new job."},{"comment_id":"1372709936105605","commenter_b":"someone should fire up her ass","commenter_a":"DISGUSTING NEWS BARBARIC..","post_message":"WTF IS WRONG WITH THIS CULTURE..."},{"comment_id":"1263570023663025","commenter_b":"Be a lying pussy...ok","commenter_a":"Some People would not understand diplomacy, poise and intelligence go way further than acting out of anger and fear (like most of republicans are reacting) Obama is doing exactly what he is supposed to do!","post_message":"\"YOU ARE NEXT.\" President Barack Obama tells ISIS leaders they cannot hide. Read more: @webpagelink"},{"comment_id":"10154090302722452","commenter_b":"So someone purchased a ticket for this bear, and the TSA couldn't screen it so it could go on the plane?!","commenter_a":"If he bought a ticket then he should have been allowed to bring it on the plane","post_message":"A YouTube star bought a plane ticket for a massive teddy bear as a stunt, but was forced to abandon the bear at LAX."},{"comment_id":"10155018887269329","commenter_b":"Rehash rehash... blah blah you lefties, blah blah. We won blah blah. No new content. Regurgitation continued. Yawn.","commenter_a":"You'll fit in with the self-important Hollyweird glitterati JKR. The British have never been enamoured of their paid entertainers except for simply that, as entertainers, who are well paid for their craft. The disenchanted and disenfranchised led the way with Brexit. Believe me, those who formed this majority are not racist not are they Ill educated. Nor are they of the lower socio-economic strata of society. They are the majority who stopped being intimidated by the PC brigade. The U.S. followed and Europe is next. The pendulum has swung back in reaction to the rot spreading from the highest echelons of government down, aided and abetted by a dishonest press and a compliant and unrepresentative public service.","post_message":"J.K. Rowling has outdone herself."}]
