[{"comment_id":"10154445854511973","commenter_b":"this is what i think about blm's","commenter_a":"CRIMINAL PIGS OF AMERICA!!","post_message":"We are broadcasting live from downtown Portland, where members of Don't Shoot Portland are holding a press conference regarding the recent shooting of Quanice Hayes, 17, by a Portland police officer."},{"comment_id":"1096108950465633","commenter_b":"Let em go and then build a wall around it so they stay gone","commenter_a":"I say let them go. Pull all the military bases and all the government jobs and everything that belongs to the United States of America, and that includes the dollar. Then round up all of the other Racists and Dumb Shits who blame all their trouble on Obama when it was Bush and the Republican majoritys falt and send them down to the new nation of Texas where they can be happy ever after. The United States will be better for it too.","post_message":"The majority of Texas Trump supporters say they'd rather secede from the U.S. than live under Hillary Clinton as president. Do you feel the same way?"},{"comment_id":"813461822117937","commenter_b":"Dream on billary Jr.","commenter_a":"Donald Trump for president thank you Jesus 2016","post_message":"Chelsea Clinton: Scalia’s Out of the Way, so now we can gut the Second Amendment @webpagelink"},{"comment_id":"990398314328597","commenter_b":"Fucking what the hell why u have to hit a poor guys damn this US is freedom fucking basdard try to find me I kick their ass to hell","commenter_a":"That fuck up stupid cop","post_message":"Listen to an MMA fighter break down the poor training of law enforcement. Source → @webpagelink Filming Cops (Y) Police The Police (Y) H/T Gracie Breakdown"},{"comment_id":"10154252490299778","commenter_b":"These horrible people who dare believe their status in a car is ever more important than a pedestrian need to be banished from all car transportation for the rest of their born days. If that were my kid, he'd be leaving town ASAP :(","commenter_a":"Get him","post_message":"A man is being sought after he ran over the top of a child and then sped out of the Arlington, McDonald's parking lot."},{"comment_id":"10154308587221323","commenter_b":"Oh stop with this mythology bull, grow up!","commenter_a":"Quran is base of Islam. Quran do not say that homosexuality is pride. GOD bans this type of relation in all abrahamic faiths, but also GOD say that He will punish this sin, people re not allowed to harm gays. They only can make advise. So Sadiq Khan should tell about Quran and not his personal views, abot homoseuxuality, only then muslims will accept him like a muslim.","post_message":"\"The irony of Brexit repercussions is that those good old (or new) British values we bang on about seem to be falling to pieces around our ears. Diversity, unity, respect, equality might sound like cliches on replay – but they do work for us, if we work for them. That’s why approaches like that of Sadiq KhanKhan are so badly needed now. He’s somehow got his act together during a moment of such uncertainty, doubt and disappointment.\""},{"comment_id":"10153279327706973","commenter_b":"Your saying this restaurant chain is hateful and kills animals when dozens of others do exactly the same thing? You do know that cows and fish are animals and killed in order to make the food you find at McDonald's, Burger King, Wendy's, Arby's, Subway, Taco Bell, Panda Express, Red Robin, Dennys, IHOP, etc. right?","commenter_a":"Don't do it! They're a little too conservative for our area. Do people really want to support a company that not-so-secretly opposes equal rights (not to mention the whole killing of animals thing...)? @webpagelink","post_message":"The fast-food chain is looking to to add one or two restaurants a year until there are 10 to 12 locations in the greater Portland area."}]
