[{"comment_id":"10154569293118132","commenter_b":"Her eyes are evil!!","commenter_a":"I think she was beautiful. This story has haunted me since it broke. Her and her daughters seemingly had a lot of love for each other. This is so tragic and so sad.","post_message":"5 things you need to know about Christy Byrd Sheats, the Texas mother who shot and killed her two daughters. (Via People True Crime)"},{"comment_id":"1642472956011827","commenter_b":"Hillary Clinton is against Christ and she is for anything illegal immigrants bring her money. .","commenter_a":"What would you have us call them, Hillary? They are in our country illegal,,,duh.","post_message":"Hillary Clinton says the term \"illegal immigrant\" is offensive and shouldn't be used. Is she right, or is this political correctness gone too far?"},{"comment_id":"1330647500288610","commenter_b":"Killers should be punished .","commenter_a":"evil","post_message":"The U.S. Fish and Wildlife Service said Thursday that necropsies had ruled out diseases as a cause of the eagles' deaths."},{"comment_id":"10156784755310354","commenter_b":"Fly on your Broomstick Hillary!!","commenter_a":"The fact that she has not been indicted by now with the mountain of evidence stacked against her is proof that it will NEVER happen, folks.","post_message":"There is zero irony in this story."},{"comment_id":"10153605257703984","commenter_b":"Afraid of the truth RNC they want only those who agree with their lies & deceit. No wants ur RINOS IN OFFICE.","commenter_a":"Sounds like Trump is a threat to Republicans, because he tells the truth? My understanding is all Repubicans should stand together. Go head Republicans, give this election to the Democrats and then whine afterward. All YOU have are empty words and promises and then you cave.","post_message":"I know the Republican Party has made some big mistakes in the past, but this one absolutely blows my mind. People are already saying they're done with the Republican Party after hearing this news. Trump has every right to be furious... Would you stand with Trump over the Republican Party?"},{"comment_id":"10154523489186336","commenter_b":"This must be an attempt to try and dig yourselves out of the hole you're in.","commenter_a":"If you want to know what is really happening in the world bypass FOX and CNN, and go to alternative news sources. You will be amazed to see how much the American news media ignores. We are all living in the dark.","post_message":"Now more than ever, viewers are turning to Fox News Channel – Most Watched, Most Trusted!"},{"comment_id":"10152917193351813","commenter_b":"Women have options. Don't have sex if you can't afford the reprocussions.","commenter_a":"Why would you vote to decrease the options women have for health care? Makes no sense at all.","post_message":"BREAKING: Senate fails to defund Planned Parenthood. The road ahead is uncertain, but for today logic prevails. We’ll continue to stand alongside our partner and access to care for millions."}]
