[{"comment_id":"1163296670367051","commenter_b":"Oooooo","commenter_a":"@username @username ummm they airways served alcohol. Unless they are talking about Webster","post_message":"Chuck E. Cheese's: Where a mom can be a mom! The family-friendly chain is hoping to lure in millennial parents by adding beer and wine to the menu."},{"comment_id":"1807011322902281","commenter_b":"In what part did she say super predators? Actually finish watching the video instead of make false accusations!!","commenter_a":"Do you guys have one recorded incident of Trump saying anything negative towards the black community like this? We have a recording of Hillary calling African-American super predators and saying to a group of black people that if they did not like what she had to say then she would just go talk to white people. @webpagelink","post_message":"BREAKING: Trump's own rental agent just told MSNBC that the Trumps told him: \"WE DON'T RENT TO N-WORDS\" Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153580091211601","commenter_b":"This Bit*h has a special place reserved for her in hell.","commenter_a":"HELL IS WAITING FOR HER","post_message":"In a Washington Post feature on Planned Parenthood, Cecile Richards, President of the nation’s largest abortion chain, says every abortion restriction in this nation must be challenged and removed."},{"comment_id":"10154498360755958","commenter_b":"You mean the Virginia Mary who gave birth to JESUS. I highly doubt that is the reason for the hijab..when many women rose up in the middle east against wearing it.","commenter_a":"I am amazed and sickened by the racist comments posted here. She is a doctor working in America saving American lives. She can wear whatever she chooses because this is America. Wow...","post_message":"\"I'm so happy to be back here in Cleveland.\" The Cleveland Clinic resident who was forced out of the U.S. under President Trump's executive order is back home and speaking out for the first time."},{"comment_id":"10154031009040329","commenter_b":"I'm crying about all of this all over again!!!!!!!!!!","commenter_a":"Riley","post_message":"People keep telling you “it’s only a show,” but then why does your heart hurt so much?"},{"comment_id":"10153588638028203","commenter_b":"Really an evil woman. Whether intentional or not. Please God, open her eyes and heart.","commenter_a":"This one is heading for hell also .","post_message":"Nancy Pelosi: Planned Parenthood videos are a 'distraction' @webpagelink"},{"comment_id":"1096205787130648","commenter_b":"this bitch looks horrible","commenter_a":"He sure doesn't call the Super predators you pos","post_message":"...says the woman who trashed tens of millions of working class Americans."}]
