[{"comment_id":"1455671454485613","commenter_b":"I thought alcohol is not allowed in their religion of peace.","commenter_a":"Drunk and drugged? Classic!","post_message":"The Rabbi looks like a natural at Jew Jitsu..."},{"comment_id":"10153792660631545","commenter_b":"Just like recent a white women in alexandria,la a manager at canes got stabbed by a black an but do they see us protesting and stuff.come on now","commenter_a":"Why do black people complain about their shootings??? Ever hear about Asians or white people being shot?? Do they protest like you do? Do they get anything specific??? No","post_message":"\"They had him pinned down,\" Abdullah Muflahi told CNN. \"He was out powered. There were two of them and there was one of him, and they were right on top of his chest.\""},{"comment_id":"10155855233440354","commenter_b":"Go away you airhead bitch","commenter_a":"To late dumb ass! No explication for intentionally exposing people to your obvious low grade DNA, should be a criminal offence!","post_message":"Even the liberal media is questioning this apology.... Check out the video...."},{"comment_id":"579913498825579","commenter_b":"Why not ?","commenter_a":"I want to be a billionaire....you got a problem with that?","post_message":""},{"comment_id":"10153398427016336","commenter_b":"And Never - Ever - try to make a woman choose between you or her horse! She will most certainly ride off into the sunset w/ o you!","commenter_a":"Ladies, Never make a man choose between you and his kids or his dog! You will lose every time if he is a real man!","post_message":"Faced with the \"it's me or the dog\" decision, a Virginia man chose his beagle."},{"comment_id":"10154941014182577","commenter_b":"Lies and fear. Lies about money and fear of foreigners. That's it.","commenter_a":"How was Nigel Farage's march?","post_message":""},{"comment_id":"902249986464524","commenter_b":"ridiculous..she was good enough to lay down and have a child with but now she's a hoe?","commenter_a":"SMDH now that an action right there to piss her off more. No woman wants the father of her child disrespecting her on media outlets. Let's see how long she gonna ban him from seeing his son now. Some guys never learn. No matter how much he hate her he need to handle their business in private. Who wants to grow up with the public and their father throwing shade at the person that gave birth them. U cant stop what the world thinks of Amber but Wiz should act more mature and handle it since he a Dad now. They need a mediator ASAP","post_message":"“Instagram Turnin’ These Wives Into Hos”: Wiz Khalifa Takes Cheap Shots At Amber Rose On New Song, “For Everybody” :("}]
