[{"comment_id":"521423368048243","commenter_b":"so she condones women being nothing... beaten, raped, stoned for no reason...be told what to do and when to do it.. she should live with them for a while without all her money... become nothing ... not human anymore...","commenter_a":"No she doesn't","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way. What a disgrace. She needs to deported to the Middle East. Do you think Nicole Kidman is a sell out?"},{"comment_id":"1245235738872618","commenter_b":"Shes definitely got bigger balls than you lady.","commenter_a":"God how can anybody not believe Michelle is a man? Look at his face in this pic, my god.","post_message":"\"Everyone was in tears...\""},{"comment_id":"10153032074653145","commenter_b":"How date she!!","commenter_a":"'Stupid is as stupid does' Glad there's one less pea size brain off the streets. She and others with that type of violent ideas should be dealt with accordingly. Enough of thugs who think they can spread such animosity in a country with so many opportunities to do something positive, enough!!","post_message":" thought about shooting every white cop I see in the head..\" That's part of a Facebook post that got this mother arrested #WFTV"},{"comment_id":"1186457031407058","commenter_b":"I say we give it to them. not one cent of White money, black doctors, black hospitals, black colleges, black cities, and build big walls and let them deal with their own people","commenter_a":"This is what happens when you erase history just like the Confederate flag","post_message":"Strange for those that call themselves 'progressive'..."},{"comment_id":"10153875721181770","commenter_b":"She is sipping Hillary juice.","commenter_a":"Nancy Pelosi IS a train wreck - so I would expect nothing less!","post_message":"Nancy Pelosi's Sunday morning interview on CNN was an absolute train wreck..."},{"comment_id":"10154049338463145","commenter_b":"Did people just quit washing their hands","commenter_a":"So now its not safe to but anything everyday its a recall on something","post_message":"RECALL ALERT: Hope you don't have this in your pantry. Warn your friends!"},{"comment_id":"1090226121037135","commenter_b":"Islam and muslims are biggest threat.","commenter_a":"Israel stands with France against terrorism. Do France stands with Israel against the same terrorism?","post_message":"France's year of terror"}]
