[{"comment_id":"10155069293808010","commenter_b":"@username well since trump is saying illegals voted for Hilary!!! I'm being sarcastic you Troll!!","commenter_a":"Oh let me guess they were illegal immigrants 2","post_message":"He operated the scheme for two years from behind bars. He and an accomplice made more than $600,000."},{"comment_id":"10153378576094087","commenter_b":"*you're","commenter_a":"your a SKANK!!!","post_message":"First Lady Michelle Obama and SNL player Jay Pharoah spit a sick bunch of dope rhymes in a new CollegeHumor rap video about how awesome it is to go to college. WATCH:"},{"comment_id":"10154469596571523","commenter_b":"How many illegal voters are on that too???!!!","commenter_a":"Who do they poll?? They never call me ever! I think they only poll those that are known demo's.....And personally he doesn't care what they think....he is just doing his job! GO TRUMP!!!","post_message":"President Donald J. Trump's approval rating reached a new low Saturday."},{"comment_id":"10153700779194062","commenter_b":"No NOT all Latinos are Mexicanos but that would be the first place anyone of that Heritage will head too is that is MEXICO with the quickness !!! You can not hide here in TEXAS we can tell da difference now.. Everybody stands out now a days!!!","commenter_a":"So where is the other guy that was last seen with them now?","post_message":"More: Baytown Police said the bodies were found Thursday afternoon at FM 563 at Eagle Ferry."},{"comment_id":"10152822886591130","commenter_b":"SHE* isn't 'dressed up as a woman. She is a fucking woman.","commenter_a":"Hold on a minute here, it's make your mind up here time fella/gal or whatever make & model you wake up wanting to be today as others (me) do mind where you take a piss as kids use these toilets and we need to protect from people who don't even know what sex they are from one toilet visit to the next !!!","post_message":"\"How we go about our business is none of yours.\""},{"comment_id":"10155037576899268","commenter_b":"So, all wives are prostitutes?","commenter_a":"When you obviously marry a man for his money, what else would you call it. If you sell your soul to the devil, you're a prostitute. After all, no one would want this orange Cheeto if it wasn't for his money.","post_message":"Melania Trump doesn't deserve to be slut-shamed."},{"comment_id":"256034241501428","commenter_b":"Hahah aww","commenter_a":"@username it'll be belated but you'll get it lol","post_message":"Pretty much #ValentinesDay #WSHH"}]
