[{"comment_id":"1038763572850057","commenter_b":"That is why UK and USA loves family rulling there in the midle eastern countries. Democracy, peace and stability there in M.E does not help uk and usa that is not what they after it is the mess and the chaos they are after and this is what they benefits from. Unfortunately it has always been like this. If not why they remove all thse regeme in ME but not even one country could not see better? IRAQ Libya are tw good examples","commenter_a":"The only people who should be ashamed are the terrorists bombing their own country, who made these refugees flee in the place.","post_message":"'Humanity washed ashore. SHAME SHAME SHAME...'"},{"comment_id":"10153128143973812","commenter_b":"Cows can't even read","commenter_a":"Japanese people have since killed 78% of all Dolphins seen in this video.","post_message":"WATCH: It seems more like a dream as you watch it, but for Alex Rivest, it was reality as he joined a large pod of dolphins off the coast of Hawaii's Big Island. This video was recorded in late December."},{"comment_id":"1324204954284728","commenter_b":"This is the future of the Democratic Party. She's sick .","commenter_a":"Thank goodness she got what she deserved.","post_message":"While out preaching on the sidewalk, a man was shocked to see a woman quickly approaching. Unfortunately, things would take a horrifying turn as the vile woman pulled something from between her legs and decided to gift him with it – but she wouldn’t be laughing just a few short days later. @webpagelink"},{"comment_id":"1211339922259660","commenter_b":"Love it!!","commenter_a":"Next Congress will be investigating the rape charges against Trump..............right? No? How about the fact that he doesn't pay income taxes.......? How about his dealings with China? No! Wait a minute, this sounds like another witch hunt, fact finding repeat of all the other investigations that Congressional Republicans have tried to have brought against Clinton. I've never seen anything like it.","post_message":"\"You are hereby served.\" Rep. Jason Chaffetz served a subpoena demanding the FBI’s full investigative file on the Hillary Clinton email probe. @webpagelink"},{"comment_id":"10153210442256336","commenter_b":"Good!! Put that b!tch in jail....","commenter_a":"Were they on Hillary Clinton's server?","post_message":"A Treasury Department watchdog has recovered roughly 6,400 emails from Lois Lerner and turned them over to Congress – reviving the investigation into the IRS targeting of conservative groups."},{"comment_id":"1180266452035470","commenter_b":"@username... Exactly! They're just drugged and/or drunken hoes.","commenter_a":"I FEEL YOU SHOULD HAVE A LIMITED AMOUNT OF KIDS IF YOU ARE ON WELFARE.","post_message":"WHOA! This judge goes off on this arrogant and ungrateful mother of 12 kids who has gotten a ridiculous amount of freebies from the state. What this mother says will disgust you. Can we get 2,000 'LIKES' to take back all the benefits this ungrateful moocher has gotten?"},{"comment_id":"600522876804958","commenter_b":"His girls should have to take the test and eat the same crap that Michelle thinks should be served at our schools. They are no more important than my kids are regardless who they are.","commenter_a":"Go ahead you slime bag daddy you","post_message":"Obama just waved this law for his daughters just because he can. No one is above the law. He is a criminal. Do you agree Obama is not above the law?"}]
