[{"comment_id":"1271975762826442","commenter_b":"You guys are so right & prosperous blacks had their own black slaves too. Our troublemaker-in-chief is keeping this going, stirring up strife so he can cry Marshal Law & keep his seat in our White House. We're in big trouble folks but most people don't even know that. Keepin' on puter & cell phone games, partying, gettin' high & working 2 jobs just to keep the bills paid. The average person has no time to protest & make trouble but we have the government paying people to not work so THEY have lots of time. It's how barry wants it to be.","commenter_a":"Loretta, Sadly, you're an intricate part of the problem. Just another old racist white person that cannot and/or will not recognize the murder of our young Black men by white racist police officers. Your kind will always find an excuse to somehow blame the victim...the evidence be Damn!","post_message":""},{"comment_id":"10154927875454174","commenter_b":"Build that wall","commenter_a":"Protesters now these days are who are dividing the races","post_message":"Protests are happening in cities across the U.S. once again while President Trump is reacting to the judicial order stopping his policy @webpagelink"},{"comment_id":"10153073313318445","commenter_b":"The queen only has a cheeky one tho!","commenter_a":"Come on America if the queen can have it. Why can't we?","post_message":"UK's First #Cannabis Pharmacy Opens in London!"},{"comment_id":"1339484486080508","commenter_b":"@username YOU ARE NOT SANE! HILLARY CAN'T FIGHT HER WAY OUT OF A PAPER BAG---SHE\"S A TRAITOR TO AMERICA.","commenter_a":"I'm a Trump fan, and these despicable lies about Cruz and the military are an idiot journalist's attempt to be relevant. Credible journalist? NOT! Immaturity at its finest!","post_message":"Mainstream media at it again."},{"comment_id":"10154680168205575","commenter_b":"@username that's a woman I would vote for","commenter_a":"You know, enough with this BS, I hope Trump wins again in 2020, and then Pence follows. These deranged off the rails nut cases think they lost now, just wait.","post_message":"Uh oh . . ."},{"comment_id":"1231979063521740","commenter_b":"OF COURSE IT WAS RANSOM!! AND NOW OBAMA HAS PUT THE AMERICAN TOURISM IN HARMS WAY HE IS THE VERY WORST THING THAT WE HAVE EVER HAD IN OUR WHITE HOUSE AND WE CAN'T WAIT FOR THEM TO GET OUT OF OUR WHITE HOUSE!!! HE HAS TRIED TO DESTROY AMERICA AND HAND IT OVER TO THE MUSLIMS AND THE ILLEGALS AND NOW THE TERRORIST !! LOOK AROUND YOU THEY ARE EVERYWHERE AND GROWING !!! YOU DEMOCRATS BETTER THINK ABOUT IT !!! TRUMP FOR PRESIDENT AND LETS WIN THIS TIME !! AND SAVE AMERICA AMEN","commenter_a":"Yeah right it was more like Money Laundering.","post_message":"“This was not ransom. Any suggestion that it had anything to do with ransom is absolutely and utterly false.” State Department spokesperson John Kirby defended a $400 million cash transfer to Iran during the release of U.S. hostages. @webpagelink"},{"comment_id":"10156406946480354","commenter_b":"She'll be a thief til her last breath!!!!!!!!!!!!!!!","commenter_a":"Hillary Clinton is a corrupt, old, nasty glory seeker.","post_message":"\"Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" Hillary Clinton is a _________________."}]
