[{"comment_id":"10156237879600594","commenter_b":"Her posture? She's not modeling, she's out on a boat with her nieces. I doubt they would have been in the picture if the intent was to be \"sexy\". She wearing a bathing suit. So what?","commenter_a":"The body is fine, the bikini is ugly and her posture is horrible.","post_message":"Ariel Winter takes the online hate and spins it into a message for all the bullied girls out there: \"YOU ARE BEAUTIFUL\""},{"comment_id":"10154249857386770","commenter_b":"STOP.","commenter_a":"OMG.seriously..and down the toliet bowl we go.swirl, swirl","post_message":"Police officers in a Massachusetts town are no longer allowed to give kids high fives as they enter their elementary school because it reportedly makes illegal immigrants and minority students feel uncomfortable."},{"comment_id":"10153542319922629","commenter_b":"Do you job or get the hell out of the way. She should have been fired weeks ago when she first refused to do the job she is being paid to do.","commenter_a":"a woman that has been married 3 times is turning down marriage licenses... go figure","post_message":"Citing religious beliefs (as opposed to, say, deep-seated, bigoted hangups), the county clerk refuses to treat gay people as equal to straight people."},{"comment_id":"10153546478451337","commenter_b":"Bitch? Way to completely destroy everything no makeup selfies are meant to promote","commenter_a":"that bitch is bad without makeup real talk","post_message":"PERFECT RESPONSE: Watch Lana - WWE perfectly shut down her Instagram trolls..."},{"comment_id":"1250044951682199","commenter_b":"Trump Wall GET THEM OUT","commenter_a":"I think everytime racist ,stupid and fear-fueling comments this guys makes in public, a terrorist opens a bottle of champagne and cheer. I mean, this guys just really want an actual attack to occur... everyday with his stupid comments put us in a greater risk for an attack.","post_message":"Tonight, in eyebrow-raising Donald Trump claims: I predicted terrorism, because \"I can feel it.\" Full story: @webpagelink"},{"comment_id":"10152700014751167","commenter_b":"Also there, Christians killing Hindus .","commenter_a":"And there was that situation in India a few years ago with Buddhists and Hindus killing each other.","post_message":"\"When you take Christianity, Judaism, Hinduism, Buddhism, whatever, their combined killings in the name of religion -- well, that would be zero.” #FoxNewsFacts"},{"comment_id":"1311726352220443","commenter_b":"Percy Lopez. ...taken to the cleaners, you have been schooled Percy, what's it like being a moron","commenter_a":"The best president ever!! Turned the economy 360 degrees after Bush's administration crashed it to the ground. You have done everything you could to help america Mr president. Your courage, dedication and integrity brought tears of gratitude to so many american people.","post_message":"'I can drink beer at 11.30am and Michelle won’t even know?'"}]
