[{"comment_id":"775594199191746","commenter_b":"You should be in a burka, you slut.","commenter_a":"I suppose next the religious right will insist that women wear burkas next. They're getting more and more like muslim terrorists every day.","post_message":"“Somehow my shoulders are sexualized? Like it’s my responsibility to make sure the boys’ thoughts are not unclean.”"},{"comment_id":"10152829564776770","commenter_b":"Go home Clintons","commenter_a":"Bullshit cover up","post_message":"Hillary is secretly a great person, says Clinton campaign"},{"comment_id":"10152959541546519","commenter_b":"But it's totally cool that the white women told the black kids to go back to their Section 8 housing, right? Ugh.","commenter_a":"I truly wish people would read the whole story before commenting. This was one of 2 cops (until backup arrived) who had just been charged by dozens of young adults and teens. He has every right to fear for his safety...AND he has every right to restrain a \"kid\" who is illegally trespassing in a gated community and trying to run every chance she gets.","post_message":"This cop picked the wrong kid to harass and abuse..."},{"comment_id":"10154493907103352","commenter_b":"Amen and thank you Lord","commenter_a":"Amen","post_message":""},{"comment_id":"10153937537377894","commenter_b":"No wonder she's an Ex","commenter_a":"Wait. So she is saying he disrespected the flag, what he is doing is wrong, and after all of that she has the nerve to say he needs to be humble? The stupid ass Star Spangled Banner is NOT the Pledge of fucking Allegiance, first of all. I wish people would recognize that. Second, draft dodging is ILLEGAL, you \"allegedly\" advised Muhammad to do that and now you want to split hairs about the \"right way to protest\"? Third, how is he not humble and if he wasn't why should he be? Muhammad Ali famously talked all types of shit now she telling a nigga to humble himself, bih, go away.","post_message":"Girl, Bye! Muhammad Ali’s Ex-Wife Says Colin Kaepernick Should ‘Get Off His High Horse and Humble Himself’"},{"comment_id":"1163328470392328","commenter_b":"A worthless bitch","commenter_a":"She is an amazing woman that should be admired. A class act.","post_message":"First Lady Michelle Obama continues to top lists of most admired women in the world. Do you admire her?"},{"comment_id":"10154339117992619","commenter_b":"THERE JOINING ISIS WILL LIBERATE THEM FROM ALL THERE PROBLEMS","commenter_a":"SO YOUR POINT IS ????","post_message":"A transsexual man and his gay female friend, have left to join ISIS, unaware that ISIS publicly executes gay people by throwing them off buildings and stoning them."}]
