[{"comment_id":"1068067499964996","commenter_b":"That's why it's called a Meltdown. Theoretically it is not supposed to stop until it reaches the center of the Earth. This may be a bit far fetched, though. Alien blood ain't got nothin' on a meltdown.","commenter_a":"Lennie","post_message":"Operators of the Fukushima nuclear power plant have identified a gaping hole in a reactor containment vessel, which has resulted in a drastic spike in radiation levels."},{"comment_id":"10154306553151729","commenter_b":"@username then you should be glad that we want to stay out of it, dumbass! Unless you want us to go back to our 1940s mindset and you won't have anything but a glass parking lot over there.","commenter_a":"They have been fighting over there for centuries. Stay out of it let them finish each other off.","post_message":"This is very serious folks."},{"comment_id":"10154140064560579","commenter_b":"Seriously Facebook . .you need to put a 'DUH' button on here","commenter_a":"She's right, the game is rigged and I'm sick and tired of the power elite in this country, be it the politicians or the media, trying to tell us what to think. Regardless of whether it's her or someone else, we DO have to take our country back.","post_message":"\"This game is rigged.\" Carly Fiorina on not being able to participate in Saturday night's debate in New Hampshire. Watch complete video here: @webpagelink"},{"comment_id":"10153037985012377","commenter_b":"100% true. Politics is no longer about helping American people. To all these politicians it is PURLEY about personal gain and saying ANYTHING and doing ANYTHING for votes. I wonder why we can't fix our economy with millions and millions of illegals taking jobs and paying ZERO taxes. It's a travesty and a COMPLETE INJUSTICE to ACTUAL HARD WORKING AMERICANS!","commenter_a":"It's the dirty, lying, self-righteous, power hungry B Sers who allowed this Illegal Immigration to go on for political gains and votes. Migration laws continually are being broken by both parties to either gain or expand their political power. They could care less how it's affecting the American citizen tax payers, by costi g them Billions of dollars per year to feed them, send them to school, healthcare, and their babies born here become immediately American citizens. Trump in 2026 for POTUS, to eliminate this millstone around the neck of the tax payers.","post_message":"An overwhelming majority of Americans believe illegal immigration is a problem..."},{"comment_id":"10154174664018812","commenter_b":"She's repeatedly called black people, \"Super Predators\".","commenter_a":"It is sad what the Clinton machine has done to such a great man. While Blacks were fighting for equal rights in the '60s. Sen. Sanders was on the front lines risking his life while Sen. Clinton was supporting a white supremacist. Most of my fellow Black American brothers and sisters have unfortunately fell for the Clinton scam and it is going to cost us big time.","post_message":"JUST IN: ABC News projects Bernie Sanders will win Nebraska Democratic caucuses."},{"comment_id":"10154828234334714","commenter_b":"No vote Hillary & she have problem health. Prison Hillary.","commenter_a":"I'D EVERYONE!!!! don the con has his sheep voting twice three times in some places!!!","post_message":"Democrats will seek court action to preemptively block potential voter harassment from Republican poll watchers."},{"comment_id":"10157746035990093","commenter_b":"Megan needs to be Fired! She could always work for the Clinton's.","commenter_a":"That's one lieing women","post_message":"Donna Brazile CANNOT take Megyn Kelly's line of questioning and it's hilariously uncomfortable. She's so CLEARLY lying!"}]
