[{"comment_id":"10153702607362014","commenter_b":"Heck yes I'll be trying this!","commenter_a":"This makes me think of good luck Charlies Bob-burrito lol","post_message":"It's the hybrid you've always hope for (or quite possibly not)."},{"comment_id":"10153894151651782","commenter_b":"So if people have an issue with racism in this country they should leave?? How dumb","commenter_a":"I'd make sure they get no government grants or assistance! Way to keep division strong!","post_message":"A Massachusetts college says it will remove the American flag from its campus: @webpagelink"},{"comment_id":"1231219033565772","commenter_b":"they can sew it to the mini brain they grew.....","commenter_a":"There is hope for me yet! Haha Juventas Buzevicius Moses Olivas Hanna Kozlowski Andrew Holtzmann","post_message":"Scientists have grown miniature kidneys in a laboratory."},{"comment_id":"10155546384855192","commenter_b":"Don't worry God would not choose an unworthy Woman to Have His Child. People no matter how much they serve Christ can still go through very hard times. He didn't say because you love Him, and serve Him that life would be easy.","commenter_a":"First of all to those that say praying won't help them.....You better understand that they don't worship God, or believe Jesus Christ died for their sins. Maybe that is why their world was shaken. God isn't playing. These are the end times. They need to stop the things they do, and accept Jesus Christ in their hearts.","post_message":"The death toll from Nepal's earthquake soared past 3,700 Monday and rescue workers are still struggling to reach two days after the disaster."},{"comment_id":"10153580764828352","commenter_b":"She needs to be done same way but leave her in the fire crazy birch.....stand there and ask her how it feel s and eat snacks in front of her ass she burns","commenter_a":"She look deranged with that crazy psycho stare","post_message":"Woman arrested for burning 8-year-old’s hands over open flame because she ate a snack without permission"},{"comment_id":"1610489359249521","commenter_b":"Maybe she'll have a stroke.","commenter_a":"She has RECENTLY HAD 2 BLOOD CLOTS ON HER BRAIN, FROM WHEN SHE FELL AND HIT HER HEAD. SHE IS EASILY CONFUSED, STAMMERS, SHORT-CIRCUITS , AND IS DILLUSIONAL. She is not well. \"THOU SHALL BEHOLD AND SEE THE REWA.RD OF THE WICKED\" !!!!!! Psalm 91.","post_message":"Hillary Clinton apparently needed assistance standing up at a rally."},{"comment_id":"508257596043081","commenter_b":"His wife destroyed that college but gave herself $200k severance pay. They are crooks","commenter_a":"If Sanders were to be nominated and elected in Nov, big problem is that he has not raised money, or campaigned for, congressional Democratic candidates. In other words, Sanders will be no better off than Obama has been if he can't get enough members of Congress to pass his initiatives.","post_message":"The attacks are going to get more unhinged."}]
