[{"comment_id":"1040232792739639","commenter_b":"Maybe the politicians should take a course in medical health","commenter_a":"She needs to have her nurses license taken away.","post_message":"“You cannot forcibly incarcerate someone if it’s not based on legal grounds” - Kaci Hickox on why she's suing Chris Christie"},{"comment_id":"908413552551727","commenter_b":"Omg poor man i hope she gets sent to prison","commenter_a":"Poor man. I hope his wife gets a nice long prison sentence.","post_message":"A year on, he still has scars..and some of them will never fade"},{"comment_id":"10153237461976367","commenter_b":"You ladies make a youngen proud :))","commenter_a":"As an older feminist, I have looked forward to the chance to vote for a woman for president for many years. I will be voting for Senator Sanders instead because his willingness to look at everything and proposed changes would improve the lives of millions of Americans. Women and men. A rising tide floats all boats.","post_message":"Would Sanders or Clinton do more to improve the lives of women in the United States?"},{"comment_id":"589887647811084","commenter_b":"Please don't breed...","commenter_a":"Well I'd show an officer my id when asked, but some people feel differently and it's their right to walk away if they've done nothing wrong. Obviously she was never charged with \"jaywalking\", so in retrospect, she did nothing wrong according to her court hearing. Just saying.","post_message":"Are you kidding me?"},{"comment_id":"10153177294431336","commenter_b":"How can a female win the MENS race? Read much?","commenter_a":"That's a female???","post_message":"JUST IN: Lelisa Desisa has won the men's race at The Boston Marathon in an unofficial time of 2 hours, 9 minutes, 17 seconds. It's the second victory for the Ethiopian, who won the marathon in 2013 just hours before the attacks. @webpagelink"},{"comment_id":"10152865946012293","commenter_b":"Married men have to make more. There are others to provide for.","commenter_a":"Jamal Barcillano :)","post_message":"Marriage appears to transform men’s approach to work and the way employers treat them."},{"comment_id":"10157066156885389","commenter_b":"Listen... Im pro-Trump and agree with a vast majority of his political stances; however, this wall fallacy is a dream.... a wall doesn't stop illegal entry, it only causes illegal entry to evolve. Initiating an armed presence is one of the most effective ways of mitigating unlawful entry by immigrants.","commenter_a":"Trump wants to rename USA to UST United States of Trump lol","post_message":"“We’re going to build a wall and it’s going to be a real wall… And it’s going to look beautiful because some day they’re going to call it ‘The Trump Wall.’” – Donald J. Trump at a rally in New Mexico"}]
