[{"comment_id":"602980583159868","commenter_b":"The majority of these people have never seen much less used a toilet. The do it everywhere at any time. It's sickening besides disgusting and a health problem. Expect to see toilets broken or destroyed in bathrooms from now on.","commenter_a":"Another cost to be added to culturally incompatible immigration","post_message":"Public restrooms are going to get an unusual addition due to all the immigrants coming in. The reason for the change will make you sick."},{"comment_id":"1245546388827745","commenter_b":"Don't disparage whores.","commenter_a":"Barrasso. It's embarassing to watch these whores. These scumbags have gotten so emboldened they don't even try to hide their crimes.","post_message":"Right after leading the floor debate in support of Scott Pruitt’s nomination to lead the EPA, Sen. John Barrasso attended a high-dollar fundraiser hosted by energy lobbyists."},{"comment_id":"10153921067764203","commenter_b":"@username, But many Women would and I bet You were going to have A lot more Women shooting themselves.","commenter_a":"Yah most women can't find their keys in their purse! As they fumble for the gun, they'll be long gone!","post_message":" new motto may just be you see something, say something. But make sure you packing heat and have good aim."},{"comment_id":"10152841582006130","commenter_b":"Yas girl","commenter_a":"Phebe Kim Gignac","post_message":"Your taste buds are going to explode."},{"comment_id":"1026033040752819","commenter_b":"And all those boobs in a row on display.","commenter_a":"I feel like the word \"leggy\" came up a lot in this article. As if the author was sorta fixated on this one thing about the girls who tormented her and swift in particular in a sorta Freudian way. Like, \"The evil reign of Taylor Swift, with her forever legs, way too long to be street-legal, stretching between pencil skirts and slightly worn Converse, glossy in the pink-frosted Malibu dusk... Um, I mean, hen culture and mean girls and stuff.\" I don't necessarily disagree with what she's saying, but she is really, really aware of Taylor Swift's legs.","post_message":"If T Swift and her squad rub you the wrong way, you're not alone. Here's why."},{"comment_id":"10152844711636167","commenter_b":"Some say brave, real people say KKKOCKSUCKINGWHORE","commenter_a":"What's \" brave\" about cutting seniors earned benefits??","post_message":"Except his plan would be \"terrible\" for the poor and middle class..."},{"comment_id":"717743675080590","commenter_b":"shes an ugly cunt that smells of camel piss","commenter_a":"Who is she ? Shariah ! Who's she? @username David A Doran","post_message":"FINALLY, We are taking back our country from the entitled Muslims that Obama let do whatever they want and try to tell us what to do!! SHARE if you agree that Sharia Law should NEVER be allowed in America!!!"}]
