[{"comment_id":"10153561312261748","commenter_b":"I'm come to the conclusion that we can safely assume the complete opposite of anything said by a conservative.....","commenter_a":"It's little wonder the whole world thinks the USA has gone bat shit crazy!","post_message":"Ted Cruz says people don't like Duck Dynasty's Phil Robertson because he \"speaks with joy,\" floats him as UN Ambassador"},{"comment_id":"10154352960083037","commenter_b":"Haha!! This dude is a savage!!","commenter_a":"@username you as a maintenance worker hahaha 😆😆😆😆","post_message":"A KXAN viewer sent us this video today. A maintenance worker at an Austin apartment complex was caught taking a swig of booze. How would you react?"},{"comment_id":"1419424701411870","commenter_b":"Um no","commenter_a":"Peter Di Benedetto","post_message":":O"},{"comment_id":"10153888535289160","commenter_b":"Donald Trump our only hope for Americans. Illegals should go home and work on making their own country great.","commenter_a":"Donald Trump for President United States of America","post_message":"Trump \"has a right\" to question if Trump U judge is fair the former AG claimed."},{"comment_id":"10157357339200354","commenter_b":"Nope don't thonk so. We the people have spoken.","commenter_a":"I think billy needs to brexit.","post_message":"If at first you don't succeed..."},{"comment_id":"1134245933335126","commenter_b":"@username sadly I think in a Trumparchy dipsticks like Susan will become Senators. Oh wait, they already have.","commenter_a":"It looks like your allies have a far more accurate picture of Trump that the American morons who vote for him do. He has made America a great laughing stock around the world. If America is to regain any pride, you MUST DUMP HERR TRUMP.; he is a danger to the whole world. If we could all vote, about 6 Billion people would vote No to Trump..","post_message":"These drawings are PERFECT."},{"comment_id":"1009448912521620","commenter_b":"I'm sick of seeing her scrunched up \"end of her world\" face. She and the others like her are the problem. Sorry cupcake, grow up and accept it.","commenter_a":"I dont see how any employer would want to hire these idiot mellinials.they dont think for themselves.they dont research for the trueth basicly you dont want morons working and running your buisiness.","post_message":"Ummm... WHAT?"}]
