[{"comment_id":"10154220107672293","commenter_b":"@username idiot","commenter_a":"Like the Central Park rapists (5 young black boys) some years back that Trump railroaded into jail, then never apologized when someone else confessed.","post_message":"Cooper was wrongfully convicted of armed robbery in Indiana in 1997, and he is still waiting to be pardoned."},{"comment_id":"1116747615049049","commenter_b":"Women frequently nurse their Babies in the train station where I work - I applaud it as natural and organic and cannot imagine why in Heaven's name it is such an issue - (we all come with identical equipment and this is what breasts are for) Nursed Babies are much healthier than those bottle fed","commenter_a":"Beautiful","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"},{"comment_id":"1847896892115179","commenter_b":"And what about the interface of other devices?","commenter_a":"There is no break through. It has always been there. Anyone heard of Tesla? Um hello...","post_message":""},{"comment_id":"10153134851981316","commenter_b":"Go away kardashian of the transgender world","commenter_a":"Lol. Worthless","post_message":"Feminists now attacking political correctness after Caitlyn Jenner honored by Glamour as Woman of the Year: @webpagelink"},{"comment_id":"10158604415035206","commenter_b":"@username The woman can speak five languages... get a grip","commenter_a":"I have never said anything negative about Barack Hussein Obama's wife, but since that's gonna be the new norm for the liberal lunatics, let me just say this. Melanie Trump has more class in her little finger than Michelle Obama ever had or ever will have. But just look at all the jealous women who are putting her down and all the worthless men with mangina's who are putting her down. You people are pathetic.","post_message":"“Melania will be an excellent first lady who will take Slovenian values of generosity, loyalty and trust to the United States and the world,\" said one fan from Melania's hometown."},{"comment_id":"10153798319264087","commenter_b":"fuck you. she didn't do shit when people called for help in libya. she sucks-and she hassled girls bill raped","commenter_a":"he cares about Americans. I always vote democrat, but not any more. i will vote for Bernie in june-but he don't have a chance-ill vote for Trump against that lying bitch","post_message":"“What I’m going to do is I want to focus on 15 or so states because we have to win, and I want my energy to be put in the states where it could go either way,\" Donald J. Trump said. \"And we’re going to play heavy, as an example, in California. No other Republican would, they wouldn’t even go to dinner in California. They wouldn’t do it.”"},{"comment_id":"10153322805023132","commenter_b":"She's still pregnant?","commenter_a":"I read it's a girl","post_message":"Do you think she's having a boy or girl?"}]
