[{"comment_id":"1721173881464308","commenter_b":"All lies, the smile to fool American's! No woman shouls allow to ru for prseident on Bil's Lewinski nasty in the White on principle alone on top of all the dangerous mistakes and incompetence that runs throyugh her desparate veins. Souless human!","commenter_a":"AMEN!!!!!!.......","post_message":"Breaking News: Hillary Clinton has clinched the Democratic nomination for president, according to The A.P."},{"comment_id":"10152650775565496","commenter_b":"Agreed. They gave that lady not one, but TWO! black eyes. They liked to beat her brains in.","commenter_a":"Why are they out on bond? If I were the D.A. I would be pushing for attempted murder charges.","post_message":"The trio of woman accused in a brutal beating over a squished hamburger were scheduled for court this morning. UPDATE on the case: @webpagelink"},{"comment_id":"10154042547832411","commenter_b":"Let's get rid of the illegal immigrants you wanna come here do it the legal way and learn to speak English too","commenter_a":"Why don't you dream up a way to protect Chicago!","post_message":"Emanuel asked Trump to continue deportation protections for \"DREAMers\" who were brought to the country before they were 16."},{"comment_id":"712497285538613","commenter_b":"Islamists radicals are killing muslims every day in irak, syria etc! Its about thousand and thousand and for no reason! Israel, when attacked, its only to defend itself! As any country would do!","commenter_a":"Jewish extremists burned a kid alive too. Just stating a simple fact.","post_message":"Netanyahu: ISIS burns people alive, Iran hangs them in city squares"},{"comment_id":"10153555901929087","commenter_b":"GO #TRUMP !!! HECK YEAH...YOU BET!!! THE ONLY ONE WHO WORKS CIRCLES AROUND THE REST, WHO KNOWS EXACTLY HOW TO MAKE AMERICA GREAT AGAIN !!! YOU BET!!!","commenter_a":"Yes, he's a strong Christian who takes on the Pope and walks in the path of Christ, building walls, abusing women and attacking people of other cultures. If this guy's a Christian, I'm Christie Brinkley.","post_message":"\"I'm always audited by the IRS, which I think is very unfair. Maybe because of religion,\" Donald J. Trump said after tonight's #GOPdebate. \"Maybe because of the fact that I am a strong Christian...you see what's happened, you have many religious groups complaining about that.\""},{"comment_id":"1070629882958022","commenter_b":"Look mr. TopHeavy, when you get pregnant let me know lol. I know many women who smoked while pregnant and had/have extremely healthy babies and children.","commenter_a":"Btw.. I'll call bullshit on this","post_message":"Here's what smoking does to your unborn baby."},{"comment_id":"10153113901480329","commenter_b":"Maybe she cover her face too in case it incites men to rape her. #goodgrief","commenter_a":"Bahaha! Don't flatter yourself lady. You're no Kate Upton!","post_message":"A Christian blogger has caused a stir online after publishing a blog post about her decision to stop wearing yoga pants because they cause men to think “lustful thoughts”."}]
