[{"comment_id":"1100137706687990","commenter_b":"Couldn't she have just not threatened him with scissors? Criminals need to be held to their actions","commenter_a":"Why were the police called? Where is the audio to the video? Why doesn't the video show the shooting? In the video, she is obviously advancing on the officer. And it doesn't matter how big the person is or what they have, a weapon is a weapon.","post_message":"If a 100lb woman makes you fear for your life, perhaps your to much of a coward to be a cop!!"},{"comment_id":"10153476026331509","commenter_b":"ladies ... let me increase ur chances looool","commenter_a":"Looks like I'll be dead earlier than I thought lol","post_message":"Being alone and feeling lonely increases your chances of early death by roughly 30%, researchers say. Simply being in the presence of others may not be enough: @webpagelink via CNN Health"},{"comment_id":"894618207261542","commenter_b":"yes i reject it and this ass too","commenter_a":"YES.","post_message":"Where do you stand? Vote here and make your voice heard."},{"comment_id":"10153883162778145","commenter_b":"Illegals cannot vote","commenter_a":"she has a point nobody likes having to pay for others but more than 50% of US citizens are on government assistance and probably all of the illegals that's why the democrats keep trying to make it easier for felons and illegals to vote , you know they will vote for the party giving stuff away","post_message":"The profanity-laden video was uploaded to YouTube and has sparked headlines and heated discussions on social media. You can watch it here:"},{"comment_id":"555063404660130","commenter_b":"That is right stop and look at what separation of State and church really is it was there to protect the church.","commenter_a":"@username is the ideal photocopy/ carbon copy of the fore fathers vision for America dream as a POTUS!!! BenCarsonWin!! GodWin!!! The Operation Heal!!! Inspire!!! Revive!!! The revival had begun, don't be left behind!!! Onward ever, backward never!!!","post_message":"You, Lord, keep my lamp burning; my God turns my darkness into light. (Psalm 18:28) We must not close our eyes when evil presents itself, for we allow darkness to abound -- it is only with open eyes that we can see His truth and calming presence. Revealed in the midst of chaos, He stands beside us as we stand with each other. With Him, together, we will be made stronger. -Ben"},{"comment_id":"10154275464344024","commenter_b":"@username You stfu!","commenter_a":"It's so nice to see that Black Lives Matter to Black People!","post_message":"Two people were killed early this morning, and several others were wounded, in a shooting at a Halloween party in Newburgh, Orange County. Details: @webpagelink"},{"comment_id":"938755412831598","commenter_b":"If she's a white lady, I'm a white lady.","commenter_a":"I am surprised she still has those white teeth in her mouth wow.","post_message":"Let's be honest. If this woman was black, she wouldn't be smiling for a cute little mugshot...because she'd most likely be dead now. #WhitePrivilege"}]
