[{"comment_id":"1007015132691568","commenter_b":"They're a success for the home invaders, they don't have to worry about getting shot now.","commenter_a":"Sadly gun crime happens so many time in the USA one wonders why they just don't legislate for firmer gun laws, but then again that will never happen...","post_message":"'America is a financially failing filth farm', he ranted"},{"comment_id":"10152762818573635","commenter_b":"And little girls whose only purpose is to bear little boys?","commenter_a":"The world needs little b o y s to become husbands, fathers, governors, farmers, presidents, and the righteous church leaders who exalt Jesus Christ \"who o n l y\" was crucified for world sin, and to whom only we bow and worship.","post_message":"\"The choice to not have children is selfish. Life rejuvenates and acquires energy when it multiplies: It is enriched, not impoverished! Children learn to take charge of their family, they mature in the sharing of sacrifices, and they grow in appreciation of its gifts.\""},{"comment_id":"10155788720365405","commenter_b":"What are you smoking Kate!","commenter_a":"Let's all remember that when Reagan was inaugurated, within hours he was greeting our 50+ hostages held in Iran for more than 400 days. Gov. Walker, you may be the one that will greet them in those hours following your inauguration.","post_message":"In this bad Iran deal, Obama has given up a lot and he hasn't even managed to bring back our Americans currently held hostage in Iran's prisons. We have to stop this reckless and irresponsible deal today. Join me in calling on Congress to stop this deal: @webpagelink"},{"comment_id":"10154160102065047","commenter_b":"GET US OUT OF THE UNITED NATIONS; THEY ARE NOT STANDING UP FOR 'BASIC HUMAN RIGHTS' FOR THESE WOMEN AND CHILDREN UNDER ISLAMIC RULE. WHY? THEY ARE RUN BY ISLAM NOW. GET THE UN OUT OF THE USA.","commenter_a":"Why do so many Americans support and justify this abomination???? The number of Islamic apologists is nauseating!","post_message":"Little girls in northern Kenya are being brutally tortured and enslaved. They're forced to marry men as old as their father or grandfather. Sign our urgent petition to demand an end to this evil practice."},{"comment_id":"10153507506919877","commenter_b":"Wendy get a life","commenter_a":"People always get offended when you say that you love dark skinned women. For some reason we have been deemed as \"too masculine\" or \"dirty looking\" or \"just unattractive\" because some how all dark skinned women everywhere are all unattractive *insert eye roll here*. We don't have the standard European features so when people say they love us they get offended and say \"well what about the rest of us?!\". No one said that he wouldn't date other races but he loves dark skinned women. Good for him because we are some beautiful women indeed!","post_message":"Mack Wilds Professes his Love for Dark-Skinned Women...and Wendy Williams Gets...Offended? Watch the clip below. Grio fam, what do you think of the young actor's remarks?"},{"comment_id":"10154099616106162","commenter_b":"I thought it was hilarious","commenter_a":"Double standard. If the tables were flipped we wouldn't even be allowed to mention a lack of caucasians without protests and al sharpton crying on tv.","post_message":"What would this year's Best Picture nominees look like with black actors? Chris Rock, Tracy Morgan and Whoopi Goldberg gave us a (hilarious) idea."},{"comment_id":"453758594748735","commenter_b":"Hey Keith when leeches use my hard earned money to live it's my right to how it's used so STFU!","commenter_a":"Look at it this way, if they can afford to go on cruises, go to psychics and buy liquor, then they don't need to be on welfare.","post_message":"This state just banned welfare recipients from spending their benefits on cruises and tattoos - and officials didn't stop there."}]
