[{"comment_id":"10153076129356680","commenter_b":"Yes she is a witch and should be burned","commenter_a":"Just another witch hunt.","post_message":"“This is enormously significant.”"},{"comment_id":"532815796909000","commenter_b":"Shut up lady","commenter_a":"STOP THIS.........these are two little girls that are living under the worst conditions possible at this time............leave them alone. Can you imagine how hurtful your stupid post are to them? They are teenagers.........they don't need their friends or the public to read your lies and innuendos. The site the the Patriot should be burned at the stake........stop your disgusting posts and leave innocent people alone............","post_message":"The White House is in uproar after Obama daughters caught doing THIS. This is outlandish. These are the daughters of our president. Would you vote to kick the Obamas out of the White House?"},{"comment_id":"10153154951847994","commenter_b":"Finally a judge with a brain! you go girl! They should get life but sadly they will have some tear jerking defense and will probably get ten years.","commenter_a":"Wow, this was compelling!!!","post_message":"A judge is furious over the death of a little child -- and she let the suspects hear it. She says watching their police interview footage was more like watching a cable TV show. Read more about the case here: @webpagelink"},{"comment_id":"822346244580816","commenter_b":"Lock her up for using RNC email server for government business.","commenter_a":"I will turn off any program that has her... the \"Minister of Propaganda\"","post_message":"It's time to stop giving Conway the mic - nothing she says is true or credible."},{"comment_id":"1063797583686996","commenter_b":"Giant vagina","commenter_a":"@username you","post_message":"It be like that"},{"comment_id":"531668583690388","commenter_b":"GO AWAY!","commenter_a":"This bitch needs to change, or else....","post_message":"Hillary Clinton just said all Christians have to change their beliefs. She is the one who needs to change her beliefs. Do you agree Hillary Clinton it out of line?"},{"comment_id":"953630401426610","commenter_b":"You are not Deplorable Hunny!! She is just Evil!!","commenter_a":"I am an immigrant who came here LEGALLY...just because I want LEGAL immigration and I want nthe Border Wall...Acc. to Hilary I am in the basket of \"DEPLORABLES\"","post_message":"Donald J. Trump speaks at the The Remembrance Project National Conference in Houston."}]
