[{"comment_id":"10153912277130329","commenter_b":"We should exile this dumb bitch to Syria!","commenter_a":"I rather vote for Kanye than for trump","post_message":"Kanye West revealed he would be running for president during last night's MTV VMAs."},{"comment_id":"10153370538292144","commenter_b":"@username She's a Republican.","commenter_a":"Not all republicans are pathological liar but all pathological liars are republican.","post_message":"\"This is not normal political hucksterism. It's a pathological disregard for the truth.\" —Kevin Drum"},{"comment_id":"1189532041066824","commenter_b":"only girls use pillow when they fight","commenter_a":"A pillow fight injured more than two dozen people????? Boy, are we ever ready for World War 3 if need be!!!","post_message":"UPDATE: A pillow fight at the United States Military Academy at West Point turned so violent that it caused concussions in 24 cadets, the superintendent of the school told NBC News on Saturday."},{"comment_id":"10153848630809411","commenter_b":"About time someone stands against the crooked cops","commenter_a":"My wish is that these imagrants won their battle and that they rule in Europe as it were Europes wish that they rule in my country. :) Now its your turn.","post_message":"'Like a war'"},{"comment_id":"10153552144846636","commenter_b":"Wow.. boo hoo. There's no \"controversy.\" Just a few crybaby parents who probably don't like soccer. This team is generating money in the Yukon community and also generating money for the school during a time of need. People should be thankful, not critical. This team isn't cutting into the school budget in any way, chill out.","commenter_a":"KFOR you need to get rid of the pop up ads your page uses!! Can't read a complete story or watch a video without getting a redirect to somewhere else. You are the only news station page there are issues with!","post_message":"\"By no means was it ever intended to say hey this is ours now.\""},{"comment_id":"863462260369465","commenter_b":"Phony witch","commenter_a":"This women is dumber than a board. Does she think no one notices?","post_message":"Hillary Clinton, you forgot to address your private jet in your climate change speech."},{"comment_id":"10154155058901770","commenter_b":"Yep just what I thought!! Gets her hair color from a bottle! And still stupid","commenter_a":"I think melania trump should be taking clothing tips from a real Material Girl","post_message":"Madonna slammed Trump supporters, calling them “lazy and “un-unified.\""}]
