[{"comment_id":"409554185871204","commenter_b":"Like we could depopulate people that breed like rats.","commenter_a":"Depopulate Mexico is the name of the game. Guess who benefits?","post_message":"The case of the 43 missing students in Mexico has galvanized discussion and efforts to locate thousands of others who remain missing."},{"comment_id":"1737156569841341","commenter_b":"Me too, streamed. He handled disrupters well.","commenter_a":"Loved it, not like being there but watched it live. Trump you are predestined to be our next President.","post_message":"I LOVE YOU NEW YORK! Thank you for a terrific night, ALBANY! LETS GET OUT & VOTE TRUMP next Tuesday, April 19th -- and lets WIN, BIG LEAGUE!"},{"comment_id":"394396457415315","commenter_b":"Muslim women why do you want to stay somewhere your notttttttt wantedddddddd !!!!!!!!!!!","commenter_a":"There was nothing wrong with America until THEY came here to destroy everything we have worked so hard for!!! She and eveyone like her needs to go back where they came from!!","post_message":"“You Are Everything That is Wrong in America”"},{"comment_id":"10153809983489486","commenter_b":"She needs jail","commenter_a":"oh hell, I know of NO ONE brave enough to bully Hillary","post_message":"Lol, Hillary fishing for sympathy.."},{"comment_id":"1164072160294870","commenter_b":"Did I hurt your feelings Harvard? Suck it up Nancy","commenter_a":"No I don't want you out of the White House I want you in prison he's a lowlife scumbag Obama you're just as bad as Hillary Clinton prisons too good for you I think you we voted a terrorist to run our country. U scumbag","post_message":"Yes!"},{"comment_id":"1179263908762059","commenter_b":"моод дэлгэрүүлж дээ... хэхэ...","commenter_a":"Jargalsaihan Mandakh, @username...","post_message":"Watch over 100,000 people swarm this public beach in China."},{"comment_id":"10156951068070725","commenter_b":"Americans will decide not illegals. Get ready for Trump.","commenter_a":"Mexicans all the way","post_message":"WOW! Great poll. Fox News just released their new GOP national poll - THANK YOU AMERICA! Lets MAKE AMERICA GREAT AGAIN!"}]
