[{"comment_id":"10154839732705695","commenter_b":"Amen to that!","commenter_a":"If Trump can be manipulated by someone half his age with no power over him then he doesn't belong in any leadership position, let alone the Presidency.","post_message":"She suggested that Trump may not have known his microphone was on, calling it \"kind of a boy talk\" that \"Access Hollywood\" host Billy Bush was encouraging."},{"comment_id":"10153468910666037","commenter_b":"Kids from low income communities and families qualify for free college education through goverment grants and programs... some choose to use those programs to better themselves and their famalies... others would rather point fingers and blame others... the only person to point the finger at in a capitalist society is the dude in the mirror because you can truly be anything you wanna be if you want it bad enough...","commenter_a":"This is awesome... more boots on the ground hopefully with the full support of the community and politicians to clean the crime up on the streets of this country... Every single city should follow in their footsteps!!","post_message":"The country's largest police force says it will also hire 400 administrative aides to take over desk jobs, which will free up more officers to walk the streets for community policing."},{"comment_id":"480289475501690","commenter_b":"Read thru all the comments before insinuating, fucking bitch","commenter_a":"What about womens rights? What about the Muslim teens who made a mistake? Or the children & women getting raped? What about the women who are clearly not mentally capable of handling pregnancy or a baby? Id rather an aborted baby than a murdered baby left in the dumpster.","post_message":"The bill has been called the first of its kind in the nation:"},{"comment_id":"10153791461399607","commenter_b":"No the home owners are getting a 10 yr break on property taxes. Look up Eager Park Townhomes.","commenter_a":"Who the hell can afford it, hell I bet the city will hit you with a $5,000 a year property extortion, I mean tax..","post_message":"Johns Hopkins University is offering a $36,000 incentive to employees to purchase a home in the new Eager Park neighborhood in East Baltimore through its \"Live Near Your Work\" program."},{"comment_id":"10154838337948797","commenter_b":"Mask? How did a hijab become a mask?","commenter_a":"Religious garment is to be used at church. As she lives in America she must take off the mask, is better for her to wear a miniskirt on this hot weather","post_message":"SOUND OFF: A woman wearing a hijab was asked to leave a Family Dollar store because of her Muslim face veil. When she protested that it was a religious garment, the manager explained that it is a high-crime area and the store gets \"robbed a lot. Was the store manager right in kicking her out? How would you have handled the situation? The best responses will go on air!"},{"comment_id":"937622143000705","commenter_b":"She can't win.","commenter_a":"Republicans are in total disarray! Hillary 2016","post_message":"According to the Washington Post, the four recent resignations have “gutted the core of Carson’s apparatus and left the 63-year-old first-time candidate with only a handful of experienced advisers.”"},{"comment_id":"849416281771667","commenter_b":"Not all women are evil feminists... Only feminists are evil...","commenter_a":"Abortion was legal by common law we brought with us from England at the very beginning of this country, the 1600's, women could abort up until quickening using herbs, falls, punches to the stomach, abortion potions were big business and freely advertised. The Founders did nothing to change this either. Try Googling the history of abortion in the US.","post_message":"Pretty much."}]
