[{"comment_id":"587546098014187","commenter_b":"It's ok, SHE has 24/7 armed guards, surrounding her...we just need to suck it up","commenter_a":"diane can have my gun, I will put it right where her head is at :))","post_message":"Diane Feinstein admits their are probably sleeper cells in America. So why does she want to take away your guns?"},{"comment_id":"726825177508060","commenter_b":"Muslims offend me. Make them leave.","commenter_a":"God help us all. Leave your American Flag flying high. I sure will. It's OUR country. If u don't like it----- get the h---ll OUT. We didn't invite u here.","post_message":"Texas man ordered to take down American flag because it offends Muslims. In our country we fly our flag. This is absurd. Do you think this is ridiculous?"},{"comment_id":"10153915045317434","commenter_b":"And like she's trying to get the fuck away.","commenter_a":"Am I the only one who thinks the second pic looks like he is going down on her? Oy!","post_message":"Enjoy some underwater pregnancy announcement pictures."},{"comment_id":"554182668075021","commenter_b":"What lower wages, you mean lower taxes. If you don't want to birth a child, just keep those nasty little knees together","commenter_a":"They are poor, jobless and believe the American dream is dead because they are stupid enough to keep being tricked into voting democrat.","post_message":"Last year was the first time that millennials surpassed baby boomers and Gen-Xers to become the largest voting demographic in the US."},{"comment_id":"10152705151371234","commenter_b":"He has a temperament ill suited to public office.","commenter_a":"That's because he didn't bring me KandyKakes, a cheese hoagie, and soft pretzels. Serves him right, loser.","post_message":"\"I think the trip was an utter failure... It should have been a trip of 'good behavior' instead of showing a short fuse,\" said a presidential historian at Rice University of Governor Chris Christie's trip to the U.K."},{"comment_id":"1159562730832064","commenter_b":"@username what refugees ! Go back to Jordan !","commenter_a":"Haha.... What about millions of refugees whose right to return is banned by Israel? But o o no emotions for Palestinians? Why?","post_message":"Group travelers told to cancel reservation at lodging in Bavaria because they are Israeli."},{"comment_id":"10156862030995389","commenter_b":"Governor Mike Huckabee said it best....If Ted Cruz isn't guilty of affairs with the five women, then he should bring charges against the National Enquiry. Otherwise, there may be something to it!","commenter_a":"Barf!!","post_message":"Get free tickets for Sean’s EXCLUSIVE event with Donald J. Trump in Milwaukee, Wisconsin MONDAY, April 4th at 5p ET. @webpagelink"}]
