[{"comment_id":"720244888107018","commenter_b":"they ran out on their bill and stiffed the waitress , who had to pay it from her own pocket ... THAT'S why they want to raise min . wage to 15, so waitresses at diners can afford to pay the tabs of these deadbeats","commenter_a":"LMBO","post_message":"Who paid the bill?"},{"comment_id":"10153581516273984","commenter_b":"The feds will just print more money huh. That's what's wrong with America is people like you don't know how things operate. The only money that gets printed is money that gets destroyed that banks send back. We are not in debt because we keep printing our own money. We can only print as much money as we have in our gold reserves. The reason we are in debt is because we keep borrowing money from places like China. But see that's the problem with the people in this country, they run to the polls to vote but have no clue how anything even operates","commenter_a":"Trump won't be any better. We will have more wars and more debt. Your pensions and other government ensured money will be gambled away again. The dollar will continue to devalue as the Fed prints money debt money. More American jobs will go overseas to China and Mexico. The middle class will slowly but surely wither away while people wonder what happened AGAIN and do absolutely nothing but complain on the couch or internet. The list goes on and on and on but you reap what you sew I guess. It is always the younger generation who has to clean up the mess of the old as always.","post_message":"Donald J. Trump just ripped apart Obama's Iran deal with 6 blunt words that hit home to millions of Americans. You know Obama hated hearing him say this, because Obama knows it's the truth."},{"comment_id":"10156527615820206","commenter_b":"She's getting my vote. I want a woman in the White House.","commenter_a":"Seeing Carly on Tuesday, can't wait!!","post_message":"Such a great welcome from supporters in Mackinac Island, Michigan today!"},{"comment_id":"949119691868046","commenter_b":"@username You cant be this obtuse. It was a joke. Have you seen any of her material? What was disgusting was her response to a KID.","commenter_a":"She's famous, making a great living for herself and it is because of the fans. If she doesn't want attention or people taking pictures of her / with her then she should have chose a different profession. She should be humbled that someone likes her enough to stop her on the street for a picture, not post a picture ridiculing a fan on her instagram for thousands of people to see. Poor taste.","post_message":"Find out what made Amy Schumer put an end to fan pics."},{"comment_id":"10155260669520557","commenter_b":"Death row is just fun. ;)","commenter_a":"Death is the easy way out, watch some of the programs on prisons Then you will feel better knowing that each and every day he or she will wake up in their 4x6 house shared with another body, no privacy to use the bathroom or get dressed, no delicious food and if their lucky can get through a shower safely. Every day they will think about what they have done and to me this is worst punishment than death!","post_message":"'I'm disappointed... he did not consult with district attorneys or consult with the families of victims whose lives have been torn apart by the people who have been sentenced to death for their actions,' Berks County DA says in speaking out today against Gov. Tom Wolf's moratorium on the death penalty in Pennsylvania."},{"comment_id":"10154739009466337","commenter_b":"I say extract the bitch the bitch that's in you that complains about characters of fiction switching ethnicities","commenter_a":"I say cast a white dude. Because it's cool to switch race's of established characters now right?","post_message":"BLADE'S RETURN? Marvel hopes so..."},{"comment_id":"873971869318028","commenter_b":"You can hack those toys so easily","commenter_a":"Junior Marquina Perez & @username I WAS NOT ABLE TO SEE YOUR REPLY :'(","post_message":"Do your kids like the Minions? One family did a double take after hearing their 5-year-old daughter's McDonald's Happy Meal Minion toy speak:"}]
