[{"comment_id":"10153167804586770","commenter_b":"What size cupp is she?","commenter_a":"can't be any worse than Obama.","post_message":"S.E. Cupp: \"I don't know how Trump's surrogates can sleep at night peddling this unconstitutional, un-conservative, and un-American garbage that is, frankly, from a guy that is never going to be president.\""},{"comment_id":"756693807767590","commenter_b":"Ian","commenter_a":"Joshua","post_message":"...bruh"},{"comment_id":"997479846960469","commenter_b":"Statements of a failed leader","commenter_a":"Not president U S president","post_message":"President Barack Obama said on Friday that the strategy adopted by Russia in Syria is a \"recipe for disaster.\""},{"comment_id":"1017537058301696","commenter_b":"Black men are so screwed up, they are concerned about equal pay for women, pro-choice, illegal immigrants, grass, ducks and horses! Anything that has nothing to do with black men, a black man is concerned about. You idiots are going to be sorry, when all the immigrants are employed and NONE of you English-only speaking Negroes gets nothing. #BlackMen4Trump2016","commenter_a":"Maybe it was sarcasm. Idk... I need more rum...","post_message":"Wondering why Nation of Islam leader Louis Farrakhan said this about Donald Trump? ---> @webpagelink"},{"comment_id":"10153259767028132","commenter_b":"Go back to stinky Bay City!","commenter_a":"Who cares about Madonna. She looked horrible at the Grammys and she has no room to talj","post_message":"Madonna is not a Fifty Shades of Grey fan."},{"comment_id":"10152881225108445","commenter_b":"eat a dick","commenter_a":"Take this shit down. 666 ain't got shit to do with weed.. God blessed us with weed","post_message":"Kosher Cannabis Edibles Coming to New York"},{"comment_id":"10152739568405796","commenter_b":"Thanks for breaking the \"fear of being called a racist\" barrier Charles. My memory serves to tell me that most of these crimes are done by out of state blacks. National statistics back this up.","commenter_a":"Anyone noticing if it isn't locals its out of staters and 9/10 times they're black...","post_message":"A South Carolina man admitted Friday in U.S. District Court that he imported crack cocaine, powdered cocaine and heroin from out of state and distributed the drugs in the Bangor area."}]
