[{"comment_id":"10156907192725594","commenter_b":"He is currently behind, I am not suggesting that he is not. What I am pointing out is that EVERY SINGLE POLL gives him a much wider lead over Trump than Hillary's lead. Most importantly in swing states. Who cares that Hillary won most of the Southern states, they are not going blue. Bernie won in most of the swing states and he polls dramatically better than her over Trump in those states. He may be losing the primaries, it is probable even. However if the point of this article is that Trump is such a threat to the presumptive Democratic nominee and we need to not be distracted by the primaries than it is fair to say, who is the better candidate to defeat Trump? Maybe for the sake of unity and defeating Trump, Hillary should bow out. You know, for the common good.","commenter_a":"I think we need to start asking the question is it time for Clinton to bow out of the race. Because if our main yardstick is not letting Trump be president all the polls are pretty clear, Sanders is our best bet.","post_message":"Yet Bernie Sanders is having none of it, frequently telling the thousands of supporters who attend his rallies that he still has a narrow path to the nomination."},{"comment_id":"10152700014751167","commenter_b":"Also there, Christians killing Hindus .","commenter_a":"And there was that situation in India a few years ago with Buddhists and Hindus killing each other.","post_message":"\"When you take Christianity, Judaism, Hinduism, Buddhism, whatever, their combined killings in the name of religion -- well, that would be zero.” #FoxNewsFacts"},{"comment_id":"1164072160294870","commenter_b":"Did I hurt your feelings Harvard? Suck it up Nancy","commenter_a":"No I don't want you out of the White House I want you in prison he's a lowlife scumbag Obama you're just as bad as Hillary Clinton prisons too good for you I think you we voted a terrorist to run our country. U scumbag","post_message":"Yes!"},{"comment_id":"10157139733295354","commenter_b":"\"Lets bring in 1000's of Muslim refugees\" Sincerely, Libtards of America","commenter_a":"Have you seen this on BBC today ?????When Donald J. Trump offered to make Sadiq Khan an \"exception\" to his ban on Muslims travelling to the US, here's how the new London Mayor responded.","post_message":"***BREAKING***"},{"comment_id":"10154029279516341","commenter_b":"By the Gods. Now they do have a chance to tell that envoy to give back Roman territory and she fucks it all up ! To the Circus with her !","commenter_a":"Bum nutter","post_message":""},{"comment_id":"1036028619826340","commenter_b":"Keep walking it back Donald, pretty soon the wall will be some bushes and a couple signs","commenter_a":"Dump Trump","post_message":"I have never liked the media term 'mass deportation' - but we must enforce the laws of the land!"},{"comment_id":"1120443904657696","commenter_b":"Google Michael L. Robinson. Transvestite.","commenter_a":"Should say make the First Lady a LADY again. Take that Michael. Obama perpetrated the greatest fraud against America ever and will get away with it. You watch.","post_message":"Is this cartoon offensive?"}]
