[{"comment_id":"10153438772266051","commenter_b":"Ignorant bitch.","commenter_a":"Grow up you spoiled brat.","post_message":"It's easy to see why this encounter between a woman going through the McDonald's drive-thru and an employee has gone viral."},{"comment_id":"1233486323342287","commenter_b":"Would rather have this girl as president than hillary.","commenter_a":"As a tax payer I don't mind paying for something like that.....I can't be mad....","post_message":"This 4.95 GPA student revealed her status as undocumented immigrant during her graduation speech. #MicBrights"},{"comment_id":"410883789115113","commenter_b":"I don't understand why they are picking on Trump! If I remember correctly the other candidates said the same thing. They did not want anymore refugees brought into to us but only Trump getts STOMPED for it.. DC is so afraid of him. Go Trump!","commenter_a":"Pot calling the kettle black.","post_message":"Trump is being attacked from all sides. He needs our support. Can we get 70,000 'LIKES' to elect Trump for president?"},{"comment_id":"693471650843413","commenter_b":"Yes they should be deported!","commenter_a":"Yes it should!!!","post_message":"Unbelievable fate for this liberal that disrespected our flag. This man will never be the same. Should burning the flag be grounds for deportation?"},{"comment_id":"10153380286877293","commenter_b":"You sound like a sensible woman out of all the waste of sperms in your state","commenter_a":"Should they all be Christian? Should they all be Muslim? How about the fact that they're human? However, we need to be sure that terrorists are not infiltrating and posing as refugees. THAT is the concern for our national security.","post_message":"Season’s greetings. A cartoon by Tom Toles via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10153371491386336","commenter_b":"Not American and horrible woman","commenter_a":"Mother Teresa.","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"10157833652505615","commenter_b":"I think it's really stupid to be laughing at someone trying pretty much entirely on her own to recount an election everyone agrees was not by the book. When calling this election \"not by the book\" is a gross understatement. Forcing recounts in some critical swing states in a situation where the electoral vote and popular vote are completely different is a reasonable endeavor. What's absurd is how much of the establishment is willing to lie back and let this thing happen, then assure us in the same breath nothing truly terrible will come out of this administration because the establishment will prevent it. Actions speak louder than words, and the inaction of pretty much everyone other than Stein, Sanders, and Warren speaks volumes.","commenter_a":"Jill Stein, election spoiler, is going to put that money raised in her own pocket to pay her expenses.","post_message":"This Just In – Just a few hours til deadline..."}]
