[{"comment_id":"1253938284627180","commenter_b":"Your mom's a joke","commenter_a":"Because vag isn't gonna pound itself........","post_message":"From an evolutionary perspective, men are a really bad idea. So why do they exist?"},{"comment_id":"1757774521121112","commenter_b":"This is so DUMB! I would vote for any Republican before I would vote for \"Killery\" You sure don't know what you will get with her!.","commenter_a":"@username Agreed","post_message":"An RNC delegate just announced the great lengths she’d go to make sure Trump doesn’t win, it's not going to sit well with many people..."},{"comment_id":"10156951068070725","commenter_b":"Americans will decide not illegals. Get ready for Trump.","commenter_a":"Mexicans all the way","post_message":"WOW! Great poll. Fox News just released their new GOP national poll - THANK YOU AMERICA! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"934884219913515","commenter_b":"@username they were not prostitutes. Those were his pimps.","commenter_a":"TRUMPS ASS LOOKS BETTER THAN RUBIO'S FACE. RUBIO IS A DAMN SWEATHOG!!!!!","post_message":"Marco Rubio mocks Donald Trump's face..."},{"comment_id":"1771115309794499","commenter_b":"Lock that b@tch up","commenter_a":"Obama did not even TRY to fix anything. He continued with the corruption at DC. And after 8 years his answer is \"vote for Hillary so she can\". And some people are actually falling for it. Pathetic!","post_message":""},{"comment_id":"10155157065294749","commenter_b":"Jade Louise Caswell can we go to chicken house again Sunday pls","commenter_a":"Jade Louise Caswell","post_message":"\"He pointed a gun at her head, demanding that she give him a nugget.\""},{"comment_id":"10153227586230047","commenter_b":"He did the right thing","commenter_a":"No","post_message":"While serving overseas, Sergeant Martland intervened to protect a child from sexual abuse. He deserves to be honored for this heroic action, not punished. Sign and Share our petition to fully reinstate Sergeant Martland: @webpagelink"}]
