[{"comment_id":"10153564191549270","commenter_b":"Chupacabra, pick up DOD Files hay accurate B 52 bombing during knock out gooks ... evaporated socialists and during First Iraq company","commenter_a":"When the last time bombardier B52 knock out targets accurately .... during .Vietnam... Flight over Chinese and just scare... scare Chinese...","post_message":"\"We conduct B-52 flights in international air space in that part of the world all the time.\""},{"comment_id":"10153892614846323","commenter_b":"Heartless bitch","commenter_a":"you failed your child it is your job to teach them not to go to strangers homes do not trust people over the internet and so on","post_message":"\"My heart breaks to think how scared he must have been.\""},{"comment_id":"1117028848356591","commenter_b":"An illegal can not vote. Period. God only knows what other conspiracy theories you are listening to","commenter_a":"Another Liberal Lie!!!! Did she make a statement or pose a question? \"If 45% of Americans pay no taxes, should they be aloud to vote?\" They are reaching They are losing and they know it They are getting desperate No choices Lying Old Woman Communist Old Man","post_message":"She has lost her damn mind."},{"comment_id":"10152932184944753","commenter_b":"BTW wasn't she on her way to see her Bf why not just let him pay for a cab instead of letting her ride on the subway while she's drunk and tired from all of the dancing in the party. I bet most of the people on that car where on the way to work and did not want any problems that early in the AM","commenter_a":"The foo recording is a straight both would've at least socked that lame ass predator","post_message":"What would you do if you witnessed this happening?"},{"comment_id":"1027408730682076","commenter_b":"She is so stupid","commenter_a":"Ur one dumb B****!!!!!!","post_message":"@webpagelink"},{"comment_id":"1098378433550493","commenter_b":"Gore's win was not robust enough and Bush et al weaseled their way into the White House and blew up the Middle East nearly blew up Roe V Wade - even if you have to hold your nose it will be worse if Hillary loses - people will die, the environment will be further destroyed, social security will be looted. Please reconsider. Fight for a third party after the election or begin now but please don't let Trump win - the pleasure of the spite will not be worth it. Just look at the destruction, devastation, the inhumanity, wreckage of Bush presidency. If Hillary is defeated because of the spite of Bernie people it will be a Pyrrhic victory certainly.","commenter_a":"Bernie, I will follow you anywhere... but I won't be able to vote for HER. I don't begrudge you supporting her... I'm sure there was a lot of pressure to do so as well as strategic reasons. I CAN get behind down ballot progressives though! Love you, Bernie!","post_message":""},{"comment_id":"787563944661438","commenter_b":"No more shrubs!","commenter_a":"What do you expect from him, he is a Bush.","post_message":"Democrats have a field day mocking Jeb Bush for pretending to be \"his own man\" despite the fact his policy advisors list reads like a Who's Who from the Reagan administration and those of his father, George H.W. Bush, and his brother, George W. Bush #ItDoesntFallFarFromTheTree"}]
