[{"comment_id":"10153156840858690","commenter_b":"F**k off, blue haired Zionist murderer!","commenter_a":"just a game, fake for 3 reasons: 1. To lower the rising American hate that's growing in the world 2. For Isreal to keep using the US as a negotiator (like calling your big brother to be a \"indendent \" deal maker\") 3. Confuse people, now we are talking about this while the settlements are being built and time goes on","post_message":"Increasingly isolated, Israeli Prime Minister Benjamin Netanyahu turns to US Senator Chuck Schumer, Israel's leading friend, to enlist his support against President Barack Obama. It's likely their conversation went like this, says Marwan Bishara. @webpagelink"},{"comment_id":"1236473219748126","commenter_b":"The police did what they needed to do. Woman was out of control","commenter_a":"Yes. NOT because of race, NOT because she is a woman, because she is resisting arrest. Have your day in court and don't try to get your justice in the street. It's just that simple.","post_message":"This Black Lives Thug Chick Gets Her FACE SLAMMED Into the Concrete... But after watching the video did she deserve it? We say yes! You decide! (VIDEO)"},{"comment_id":"10153198007713203","commenter_b":"Poor babies. Why do moms do this....May God for give us all. This needs to stop","commenter_a":"May God have mercy on the world.","post_message":"I left Planned Parenthood after seeing ‘perfectly formed’ quadruplets aborted: former abortion worker"},{"comment_id":"1171399196245487","commenter_b":"She's better than me!..step into my personal space uninvited and your eye will get dot!!!","commenter_a":"Where's the guy in the 8 ball jacket when you need him???","post_message":"A racist Trump supporter went ballistic on a black subway passenger in NYC. #MicBrights"},{"comment_id":"1231549493587943","commenter_b":"Hang her in the public square!","commenter_a":"We need term limits.","post_message":"Liberalism is a MENTAL disorder. Look what the Liberal tinkerpots are seeking to tear down now. BTW, nice glasses Babs!"},{"comment_id":"1056321874481529","commenter_b":"Why don't you purify yourself in the waters of Lake Minnetonka?\"","commenter_a":"All lives matter","post_message":"Hillary Clinton and Donald Trump face off now in the first presidential debate of the 2016 campaign:"},{"comment_id":"1089143724523512","commenter_b":"Jenny Magnanelli I would pummel him.","commenter_a":"Travis Kieska","post_message":"A Texas mother wants everyone to stay aware when out shopping with your baby. A man walked up picked up her 14-month-old without permission. When confronted, the man never spoke to the mom, just addressed the baby, then left the store with no merchandise. #NBC5Now More: @webpagelink"}]
