[{"comment_id":"10152940519275933","commenter_b":"Mr. Kasich is a nice man but Donald Trump is right about everything he states - if we don't deport ILLEGALS then we will have to grant them amnesty. I know the deportation is not feasible - but it could be done but I know it won't happen - but we most certainly should deport the criminals who are here illegally. Illegals should have NO RIGHTS - first of all they break the law when they enter here. I'm voting for Trump. Mr. Kasich - what about OUR rights? Do the citizens of America have any rights ? are we protected any more? Now, what's happened is that these illegals are stuck here - that's why we MUST STOP IT. We cannot support the entire world no matter how sympathetic we are to them.","commenter_a":"The strong leader is not @username......he says deporting 20 million illegals is inhumane! You're part of the problem! How patriotic can you be, how much can you love your country to condone an invasion by 20 million illegals into our country that is now a welfare state with very high unemployment. The 11 million came from the 2010 census.....but many hispanics refused to answer the questionaire out of fear.....also, since 2010, millions more have come acrtoss the border. It's 20 million, folks!","post_message":"America deserves a strong leader back in the White House. America needs John Kasich."},{"comment_id":"1322497724487878","commenter_b":"Lolololol congratulations trumplinas, you played yourself","commenter_a":"It's going to be just like the wall. Everyone will have insurance but you have it pay for it now and somehow we will be paid back later.","post_message":"He says all Americans will be \"beautifully covered.\""},{"comment_id":"10155024905873487","commenter_b":"Yes, but I am going out swinging. My representatives are getting letters, resistors are getting encouragement, all entreating those who swear to protect and defend the constitution are getting my support. I grew up when you did...and felt the same way. We are to be tested. Our Republic will need yo stand. So I will too. Join us!","commenter_a":"Good-bye halcyon days of growing up in the U.S. in the sixties and seventies. Worst shock of my life was 2008. I had always, unconditionally, believed that FDR's reforms were indissoluble, absolute, perfect. Now I don't trust anything; if there is money to be made, no perfidy is too great to be inflicted upon Joe Lunchbucket and me. It was a great experiment, but the protections against the avaricious that were put in place were not strong enough.","post_message":" don think Richard Nixon even comes to close to the level of corruption we already know about Trump."},{"comment_id":"10153509581416350","commenter_b":"DO NOT BUY ANYMORE OF HER CDS! DO NOT DOWNLOAD ANYMORE OF HER MUSIC! BOYCOTT HER LITTLE SMART ASS AND DISRESPECTFUL PUNK ASS THAT SHE IS!!!!","commenter_a":"America is HATING YOU....grab some brains!!!!","post_message":"Ariana Grande took to Twitter to explain the controversial video."},{"comment_id":"1199547530099410","commenter_b":"They should all be missing persons by now. These people are NOT seeking refuge. They are invaders brought here by our own president.","commenter_a":"Need to all be deported ASAP!","post_message":"MINNESOTA: MOB OF SOMALIS RAGE Through Upscale Neighborhood Threatening To “Kidnap” And “Rape” Homeowners [VIDEO]"},{"comment_id":"10152694220270736","commenter_b":"She doesn't have a soul.","commenter_a":"I'll be dead because of you then crashing sounds pretty intentional to me. How this person can even consider entertaining not guilty is beyond me. May the terror and the guilt of this tragedy eat her soul.","post_message":""},{"comment_id":"10155053775333984","commenter_b":"Maybe someone should shove a fork up your ass bitch","commenter_a":"I hope the government is checking the silverware and other furnishings of the WH before the Obamas leave...... we all remember what happened when the last democrat family left the White House.......","post_message":"As the Obamas leave the White House, Congress has some bad news for them... and this time, they're delivering it to MICHELLE Obama. See the bad news they have for the first lady while she's on her way out the door..."}]
