[{"comment_id":"10153547017035950","commenter_b":"There is no excuse for paddling in school. Sounds like mom has serious issues too.","commenter_a":"He has missed 18 days of school, he's got in two fights this week, he spit on a kid and his mother is on the verge of going to jail not only because he has missed school but because of things she does in her personal life. If she doesn't want to be a parent to that child somebody has to be.","post_message":"\"It was not a spanking. It was abuse,\" said the boy's mother."},{"comment_id":"812987998844624","commenter_b":"Bra,panty,stockings,make up are part of a woman's world We want to look presentable when we go out ....not look like a beat up gf or wife","commenter_a":"The husband is so sweet ,im sure he bought perfume and other toiletries for her","post_message":"The husband was helping his wife choose a makeup color that matched her skin tone. He helped her find the color and kissed her on the forehead, according to Love What Matters."},{"comment_id":"10153171170386051","commenter_b":"Nasty ugly bitch","commenter_a":"What a sick bitch","post_message":"Police showed up at this woman's home only to find her young grandson naked. They asked him what was going on - and that's when he broke down."},{"comment_id":"769122743278303","commenter_b":"Your right just little bitches","commenter_a":"Three armed thugs couldn't handle one 67yr. old man. Punk ass b!tches, take note; One responsible, LEGALLY armed American Citizen is better than three worthless, no job pussies with mothers on welfare with multiple kids from multiple donors. And they wonder why they get shot.","post_message":"Thugs Attack Little Girl, Grandpa Immediately Blows Them Away With Shotgun. Thank god for the 2nd amendment. Let's show him our support. Can we get 75,000 'LIKES' for this grandpa?"},{"comment_id":"10153101745071336","commenter_b":"kat, an arms limitation agreement isnt a treaty.","commenter_a":"Yep, once the ship starts sinking, the rats are the first to go. Good riddance!","post_message":"BREAKING NEWS: Senate Minority Leader Harry Reid announced that he will retire from the Senate at the end of his term. @webpagelink"},{"comment_id":"1242224722465203","commenter_b":"\"because they make decisions based on gut feeling and emotions\" - And here come the Facebook comments that'll prove just that. *sigh*","commenter_a":"I'm sure some don't, same with men.","post_message":"This person is also a board member of Women in Science and Engineering. -_-"},{"comment_id":"948719421835197","commenter_b":"naw, the generation of things now being exposed more like it","commenter_a":"The generation of no personal responsibility.","post_message":"If this tactic works, we're a sicker country than I could have ever imagined."}]
