[{"comment_id":"1233928029975949","commenter_b":"I got it!! She can't open her mouth without lying through her teeth!","commenter_a":"A few reasons not to vote for Hillary: 1. Knowingly and intentionally destroyed evidence in a criminal investigation. 2. Allowed Americans to be slaughtered when they could have been saved, then lied to the victims families and the American people about it. 3. Rigged the primaries against Bernie Sanders. 4. Selling military equipment and other favors for donations to the Clinton Foundation. 5. Threatening victims of her husbands sexual indiscretions. 6. Risked national security by sending classified information over an unsecured server. 7. Has lost her license to practice law due to dishonesty. I could go on and on with filegate, whitewater, etc., but I think you get the picture.","post_message":""},{"comment_id":"1657660854509683","commenter_b":"His wife was from Saudi Arabia the home of Isis and bin ladan. She radicalized him! These people mindset are very scary","commenter_a":"Islamic terrorist scumbags.. His wife should never have been admitted into the USA. America has the dumbest immigration policy on earth. Thanks for the 1965 \"turn America into the world's dumping ground \" immigration act teddy Kennedy!! NOT","post_message":"The gunman who turned a holiday party into a mass murder scene with his wife had complained that his co-workers made fun of him."},{"comment_id":"1642997759320670","commenter_b":"What a stupid bitch !","commenter_a":"What a bitch c...t","post_message":"These people need to be BANNED from games forever."},{"comment_id":"10154713916667446","commenter_b":"It's her normal way. She's a bitch","commenter_a":"Trying to be as objective as possible.., she comes across as very angry and off putting , yikes","post_message":""},{"comment_id":"1179133135441029","commenter_b":"No you're thinking of a dog. Easy mistake to make.","commenter_a":"Wasps bite. They don't sting.","post_message":"And you thought getting stung was bad."},{"comment_id":"10153359647714138","commenter_b":"Get the place shut down, then sue them for everything.","commenter_a":"Oh no!!","post_message":"When the family didn't hear back from Petco after a few hours they called the store and were told to meet the manager at an animal hospital."},{"comment_id":"10154531059061337","commenter_b":"Well there's the fact she acts like a cheap whore","commenter_a":"Really what is wrong with Miley Cyrus..? She got some serious issues & needs help...","post_message":"SHOWING OFF: Miley Cyrus didn't hesitate to full on make out with her Victoria's Secret girlfriend, despite the watchful eye of the paparazzi..."}]
