[{"comment_id":"508257596043081","commenter_b":"His wife destroyed that college but gave herself $200k severance pay. They are crooks","commenter_a":"If Sanders were to be nominated and elected in Nov, big problem is that he has not raised money, or campaigned for, congressional Democratic candidates. In other words, Sanders will be no better off than Obama has been if he can't get enough members of Congress to pass his initiatives.","post_message":"The attacks are going to get more unhinged."},{"comment_id":"10158515262905725","commenter_b":"Gomez u bitch u","commenter_a":"fukin who're","post_message":"All eyes were on Melania as she stepped into the ballroom."},{"comment_id":"10155736096870231","commenter_b":"Its not about the braids.....its about the #whitegirlsdoItBetter","commenter_a":"What is it called, then, when black women get relaxers to wear their hair straight?","post_message":"The young actress is making sure her comments about appropriation are taken seriously."},{"comment_id":"1009718899145010","commenter_b":"Well the Wicked Witch odf Washington has looked better noow hasn't she.....TRUMP will save America...For us Mericans. Yall can move to Canada.....","commenter_a":"The dumbing down of America, this is the people we take care of with government assistance, most are not capable of taking care of themselves let alone voting","post_message":"Woah. Donald Trump voters will be the end of America as we know it. Thanks to Mitchell Wiggs for the video. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154151138320399","commenter_b":"muhammad ali was a muslim. karreem abdul jabbar is a muslim. the rw always misses that.","commenter_a":"So what's wrong to be a Muslim? Is being a Muslim evil and being an evangelical Christian holy? Republicans are bunch of hypocrites. Very discriminatory and hateful bunch of bigots.","post_message":"He made his name as a Calvin Klein model and actor on \"General Hospital.\""},{"comment_id":"10155369881175389","commenter_b":"Hillary should run on a ticket with McCain. Both are so full of themselfs.....hint","commenter_a":"#ThaiJohnson the reason she doesn't look into the camera is the same reason a person lying to you can't look you in the eyes, she has that Obama syndrome can't stop lying and can't keep tract of the lies.","post_message":"Question of the Day: What do you think of Hillary Clinton's performance at today’s press conference? Tell us in the comments, and tune in to Fox News tonight at 10p ET for more on this story."},{"comment_id":"1096146180493131","commenter_b":"Mexicans showing their little dicks. Their penis's are as big as a Mexican pepper. Will see who kisses of illegals your asses are grass.","commenter_a":"Trump","post_message":"CITIES TELL TRUMP to KISS OFF @webpagelink"}]
