[{"comment_id":"10153499829950329","commenter_b":"Whooooah Michelle Esquibel Gena Esquibel","commenter_a":"Jenna Benham","post_message":"For a \"kids\" party, yes. Definitely not for adults. *coughs*"},{"comment_id":"953216211400448","commenter_b":"Ron, don't forget about the white folks whom have EBT cards and are on welfare.","commenter_a":"So why are we not receiving reparations like the Jews Obama.U jst gave them 12 million for something that didn't happen here!","post_message":"President Obama defends the Black Lives Matter movement, saying the concerns of the activists who have marched & protested for change are legitimate. Obama reiterates that while all lives do matter, black communities are under a specific & unique scourge that needs to be addressed. He also goes on to say that using the phrase “Black Lives Matter\" does not mean that other lives do not. DETAILS ----> @webpagelink"},{"comment_id":"1011635065552183","commenter_b":"Are you surprised by this woman's corruption? She should be in jail with the other corrupt politicians. Wonder what she'd look like if she didn't have access to plastic surgery for a couple of years.","commenter_a":"this woman should be took out and shot for all the corrupt things she has done ,, and throw in her friend Dirty Harry Reid also ...","post_message":"Here's Nancy Pelosi real \"war on women\""},{"comment_id":"1666828886940954","commenter_b":"when someone finally makes sense .. THANK YOU SALMAN RUSHDIE!","commenter_a":"Every thing they say here is an outright lie. There is Huffpoop id evil. not a shred of truth about any of these.","post_message":"Let's put Hillary Clinton's emails into perspective."},{"comment_id":"10153825929880399","commenter_b":"Domestic Terrorists","commenter_a":"Let's say Trump gets defeated; narrowly or by wide margins, makes no difference. Will his supporters begrudgingly acknowledge defeat in the public forum of a democratic vote? Will they accept hat their ideas and policies, such as they are, are not accepted by the majority of their fellow citizens? I don't believe they will. And what then? Will they turn to other methods to advance political ideas that cannot be achieved through conventional democratic means? And what will we call them then...?","post_message":"Josh Marshall \"You can say all sorts of things about these folks being crazy, or extremists or whatever else. But set aside all these evaluative or partisan interpretations and one thing is fairly clear in objective terms: a large portion of the GOP is not satisfied with what can realistically be achieved by conventional political means.\""},{"comment_id":"10154979630864218","commenter_b":"@username That damn Clinton how dare she think she is above the same laws we have to abide by....","commenter_a":"Face it the Democrats failed policies and over regulation aka job killers have finally awoken the American Voters in rural America their the ones truly hurting","post_message":"Maryland remains a deep blue state politically, but President-elect Donald Trump was able to flip white working-class votes in parts of Maryland, including eastern Baltimore County."},{"comment_id":"10153625105923128","commenter_b":"Stop bring toilet in every issue","commenter_a":"India should stop releasing Indian Movies in Pakistan long ago ..i don't knw why still they didn't do that","post_message":"Here's why an alleged Pakistani terror group wants a ban on an Indian movie."}]
