[{"comment_id":"485585728298674","commenter_b":"She is death warmed over!","commenter_a":"Not the first time Nancy has been hit. A face rearrangement could only improve her looks.","post_message":"Greta just kicked Pelosi to the curb... Good. We need more American women like Greta and less like Pelosi. Do you support Greta taking on Pelosi publicly?"},{"comment_id":"1642997759320670","commenter_b":"What a stupid bitch !","commenter_a":"What a bitch c...t","post_message":"These people need to be BANNED from games forever."},{"comment_id":"1705740913046354","commenter_b":"Bitch!","commenter_a":"Go whoop, go now.","post_message":"Oh my gosh, I can't believe Whoopi Goldberg said this. Cancel The View right now."},{"comment_id":"1895551420676942","commenter_b":"Its not a muslim ban you morons.....learn facts. The top 5 countries in regaurds to muslim population are still traveling with zero restrictions. Its a 3 month travel ban from the 7 countries with strong terror ties....and 3 months until the fix the problem of Isis slipping through the cracks. And if he is so mean and horrible, what is Obama and the rest of the democrates? Because this \"Ban\" is the exact same one Obama used in 2011 only Obama did it for 6 months...not 3. Please open your eyes before you spew blind hate.","commenter_a":"You are and idiot. Wake your ass up shame Trump has to protect you.","post_message":"Share if YOU stand with Sally Yates, too. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153380386696130","commenter_b":"No, illegal immigrants do not commit 35% of murders in this county. Give me factual numbers.","commenter_a":"Everyone hating, yet he leads all polls.","post_message":"The rest of the media finally remembered that Donald J. Trump is entertainment, not politics! (We told ya so!)"},{"comment_id":"10153004529954071","commenter_b":"Bill is a smart man!","commenter_a":"And what did Hillary say? Unless Trump is doing all this show to destroy the Republicans and elect Hillary as POTUS but then again there is Bernie.","post_message":"Former President Bill Clinton called Donald J. Trump in May and \"encouraged Trump's efforts.\""},{"comment_id":"10153577547513352","commenter_b":"Amber shut your ass up looking like momma June. Fat ass","commenter_a":"This sight sucks","post_message":"In sickness and in health: Soldier marries fiancée despite brain injury that left her unable to recognise him just days before their wedding… and then spent five years teaching her to walk, eat and speak again"}]
