[{"comment_id":"1557909130909006","commenter_b":"Go watch FOX bitch...","commenter_a":"Because guns cure racism and misogyny. Vice you are officially the retarded wing of journalism.","post_message":"What radical black womanist politics organized around self-defense actually looks like, and why it matters."},{"comment_id":"10154040549579411","commenter_b":"YOU STUPID WOMAN! Read some history first...","commenter_a":"Muslims ruled India from 7th century till 1856. All Indian heritage is created by Muslims rulers they civilized curry mouncher but still not enough... In entire Muslim India history you cannot find Hindu execution or forced convert to Islam..... Same 700 years Muslim rule on Spain... No force to converte to Islam.. No execution.","post_message":"5 assailants arrested, including a barber"},{"comment_id":"873173032819817","commenter_b":"Why are so many women that insecure? Come on...","commenter_a":"No thats called someone having mental issues lol","post_message":"Warning to all couples."},{"comment_id":"10153249048488352","commenter_b":"Pure evil heartless bitch","commenter_a":"The same thing should happen to her no doubt about it","post_message":"Texas woman, 26, found guilty of suffocating fiancé's two-year-old daughter to death using duct tape after he broke up with her"},{"comment_id":"918479428207062","commenter_b":"\"If you don't have the guts to run for office on your ideas, then you shouldn't run for office at all.\" Thank you, @username. #realtalk","commenter_a":"The last two elections I couldn't get to the polls because of 14 hour workdays","post_message":"If you don't have the guts to run for office on your ideas, then you shouldn't run for office at all."},{"comment_id":"10152660515486813","commenter_b":"Maybe , but I am not a damn Liberal pussy.","commenter_a":"Too f'ng bad , play stupid games , win stupid prizes . Its not a resort.","post_message":"HORROR in Georgia Prisons. ACLU's David Fathi sheds light on how America needs to twist the lens and reflect on how we treat those within the criminal justice system. @webpagelink"},{"comment_id":"602931503228475","commenter_b":"I have never heard of or seen a cow attack a person!!! No Good Worthless Muslims!!!","commenter_a":"Those men will burn in hell one day","post_message":"Two Men Were Stabbing a Girl in “Honor Killing” When This Cow DID THIS to Stop Them…"}]
