[{"comment_id":"476667025791225","commenter_b":"I agree","commenter_a":"He's right on!","post_message":"Donald Trump spoke out against gun-free zones in last night's debate, calling them \"target practice for the sickos.\" Agree or disagree? Via Opposing Views"},{"comment_id":"10153805413233352","commenter_b":"There is no such thing as going to far I would do the same shit....I'll kill a little bitch or nigga that lay a had on my child....no matter your age..or gender..daddy got your back....","commenter_a":"And???","post_message":"Shocking moment angry dad ‘tried to run over a group of teens for bullying his 13-year-old daughter’"},{"comment_id":"589804961210083","commenter_b":"If they don't like it then they can suck chuck","commenter_a":"Love my Marines.","post_message":"These Marines make huge stand and show Muslims they're not afraid. Love it. We need to spread this and show these Marines we have their back. Do you support our troops?"},{"comment_id":"10153361923310796","commenter_b":"Google it or California DMV website. Wake up.","commenter_a":"With over 50% of new California Driver's Licenses issued to illegals will anyone challenge voter fraud in Mexifornia?","post_message":"Republican presidential front-runner Donald Trump blasted Mitt Romney in Maine on Thursday after the party’s 2012 nominee criticized him, saying Romney would have “dropped to his knees” for his endorsement four years ago."},{"comment_id":"10153767198963690","commenter_b":"@username it is not just three countries being destroyed, all the countries in Europe to which the refugees are going will be destroyed economically, culturally, life as they know it will never be the same.","commenter_a":"Saddam a cde to be missed, a last Iraqis leader","post_message":"\"There are plenty of Iraqis for whom Saddam is a nightmare that they never want to see again. His legacy here, though, is complicated. It's not as simple as 'Dictator Bad, Democracy Good,' as the architects of the Iraq war would have you believe.\" Al Jazeera's Imran Khan, in Baghdad, filed this Reporter's Note."},{"comment_id":"10154179770204330","commenter_b":"How did this happen,if the Zoo was secured? Just so happens this is a Black child. Had it been a White child,there wouldn't be no complaints. Hypocrites!","commenter_a":"Accidents happen. They do. However, accountability and fault are determined and responsibility for the loss of this priceless animal (financial) should be taken in a court of law.","post_message":"\"Accidents happen.\" That's the response from the mother of the 4-year-old boy who fell into the gorilla exhibit at the Cincinnati Zoo over the weekend, forcing zoo staff to shoot and kill the gorilla. She says too many people are judging her. Thoughts? @webpagelink"},{"comment_id":"10153211590889255","commenter_b":"How on earth did that guy get elected in a logical state like Maine? Maybe he had some help.....","commenter_a":"JUst more proof that Le Page is a nutcase and a liar. So glad he isn't from NH . We have enough nutjobs of our own who scare the bejesus out of 4th gfaders!","post_message":"I think I just became an even bigger Stephen King fan."}]
