[{"comment_id":"1859080321003763","commenter_b":"@username IDIOT!! No brains!!","commenter_a":"Don't give them the attention they want......they are not America they are not speaking for me!","post_message":"Protesters shut down dc"},{"comment_id":"10155303364265603","commenter_b":"For exposing corruption and telling the truth...","commenter_a":"He should sue the pants off of Eric Holder.","post_message":"JUST IN: Ferguson Police Chief Tom Jackson resigns, effective March 19. Lt Col. Al Eickhoff will serve as acting chief as the City of Ferguson begins a nationwide search. We will carry the 5:30p press conference LIVE on-air and online. STORY: @webpagelink"},{"comment_id":"10156651950690354","commenter_b":"She can have all my babies","commenter_a":"Some poor schlep is going to get this girl pregnant one day and then oooooohhhhhhhh shitttttttt, here comes the crazy. Which brings up a good point. Wear condoms. Knowing is half the battle.","post_message":"Here's the VIDEO that's breaking the Internet today. \"Miami’s Local 10 identified the inebriated girl as second year University of Miami neurology resident Dr. Anjali Ramkissoon.\" **Viewer discretion is advised**"},{"comment_id":"1656355127989110","commenter_b":"@username Hahahahah devil bitch!!!!!😂😂😂😂😂😂","commenter_a":"I don't blame him. Look at his filthy, disgusting, whiny, wrinkly, pant suit wearing, adult diaper using, Parkinson ridden, messy asss cunt of a wife.","post_message":"Bill 'still dicking bimbos at home'..."},{"comment_id":"1647007322270889","commenter_b":"@username great values you're teaching your kid. Enjoy karma","commenter_a":"Yeah well cyclists need to be safer, in Utah they over take actual roads holding up traffic passing people off.","post_message":"Biking in America is way too dangerous. (Video: ATTN:)"},{"comment_id":"10156146715050354","commenter_b":"Who the fuck is indoctrinating children?","commenter_a":"It is what perverts do !","post_message":"Cha-ching! Tax dollars, y'all!"},{"comment_id":"1158796597473702","commenter_b":"She was having a PRIVATE conversation with her son! It is no one else's business!!!! She quite clearly stated she speaks English!!! Read the article people!!! So stating that immigrants should learn the native language in this situation is redundant!","commenter_a":"We speak many different languages in America.","post_message":"The woman was speaking with her son in Spanish while celebrating his birthday when a stranger interrupted to tell them, \"We speak English in America.\""}]
