[{"comment_id":"10152867381576130","commenter_b":"The fact he's sharing this photo makes it people's business lol","commenter_a":"So what does he have down there?","post_message":"\"We've had comments saying 'he doesn't look trans' which brings up a great point on what does trans even look like?\""},{"comment_id":"519430408242325","commenter_b":"What do expect from narcicistic bullies? They steal cheat etc...go figure....most poor folk who steal get arrested..why not trimp chimp rabid rat","commenter_a":"Well it's nice to see how Trumplestiltskin would use Meredith McIver as a scapegoat for that plagiarized speech that dipstick Melanoma Trumplestiltskin gave!! C'mon, surely you can see through the Trumplestiltskins I mean honestly am I the only one!? LOL!!","post_message":"Meredith McIver is listed as a co-author with Donald J. Trump on several of the books he's had his name on spanning more than a decade."},{"comment_id":"1726500120946412","commenter_b":"I'm not really sure why anyone would vote for that scandal ridden woman, but hey you got this little buddy.","commenter_a":"I did vote for U.S. Senator Bernie Sanders to win, but I not upset that my choice did not win, no, I let Democracy decide on that, and I am proud to vote for Hillary as our first female president. Everyone Rock the Vote!","post_message":"So much for party unity."},{"comment_id":"10153397415338984","commenter_b":"Guess you are be careful about who you ask to suck your dick!","commenter_a":"Very old","post_message":"Watch what happens when this bully starts a fight with the wrong guy... he didn't see this coming. The cameras caught this entire fight... Are you happy he got a giant slice of justice?"},{"comment_id":"10154376636126509","commenter_b":"I once heard, all Asian look alike!","commenter_a":"u killed innocent boy shame to those who disagree with Obama abt guns new law","post_message":"\"I just shot my son by accident.\" An Ohio father shot and killed his teenage son early Tuesday morning, apparently mistaking him for an intruder, Cincinnati Police said."},{"comment_id":"578813518988176","commenter_b":"He needs to be voted OUT","commenter_a":"Give them his job ! Asshole","post_message":"What do you think?"},{"comment_id":"500542473482734","commenter_b":"What's so crazy is that these people's ancestors were probably poor farmers! VERY few southerners owned slaves - only the richest - but they convinced the dumb farmers to go to war for them. Learn some history rednecks!","commenter_a":"Your ancestors didn't own a thing in their lives. They didn't own black people then and now. If someone did not willingly agree to become your slave it means you did not own them. They are their person. Unless they make An argreement with you as similar to terms of employment then you do not own then. All sales of slaves are void because you can't sell a human as property or goods. God already said Let My People Go... And so be it that was the end of slavery and should have remain that why. I'm sure if all Black people go back to Africa and the Caribbean and keep allot our wealth their and all white people move back to Europe without our riches we would still be more wealthy than you because you would knocking on our doors for our oil, gold, diamond and anything of value ...","post_message":"HOLY CRAP."}]
