[{"comment_id":"710336325799525","commenter_b":"U R A STUPID BITCH !!","commenter_a":"Yes she is a well educated lady. She puts family first and shows alot of class. She was a model you don't hear people caalling actresses names for their jobs. She also is a women who knows how to work hard , she understands the immigration system. She also understands the average needs of the normal everyday person.","post_message":"Will Melania Trump make a good First Lady?"},{"comment_id":"10154964993289411","commenter_b":"What have they to complain about the weather in Greece is lovely.","commenter_a":"pablo escobar ?","post_message":"LIVE: Protesters rally in Athens to honor memory of teen killed by police COURTESY: Ruptly"},{"comment_id":"10154570947183822","commenter_b":"his ass should of been hung long ago.....his mother should of been charged as an accomplice too.. she knew damn well those officers would be walking into an ambush.","commenter_a":"Yeah...and I want a million dollars....sorry buddy...you earned it. No remorse ...no care....there are no words...","post_message":"The man convicted of killing three police officers in Stanton Heights appeared in court today. Richard Poplawski wants all charges against him dropped, and declared \"Let's Go Pens\" as he was led into court."},{"comment_id":"1003687313057656","commenter_b":"The tears flow as I watch and read this... For all of you Christian Conservatives out there, REPUBLICANS IN CONGRESS PARTICULARLY, we need to open our hearts and welcome the Syrian refugees in, otherwise we cannot call ourselves \"CHRISTian\". The refugees will be vetted over a 2-3 year period ~ they're not coming tomorrow. Be compassionate ~ that is what we are about here in the USA, remember our quote on the Statue of Liberty, which was a gift to us from France (!), welcoming immigrants and refugees: \"Give me your tired, your poor, your huddled masses, yearning to be free.\" How about we practice what we're preaching with this message?","commenter_a":"Tears.","post_message":"Watch this and you will get chills. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153939182654060","commenter_b":"There are no women in a yakuza clan.","commenter_a":"Curiously -- nothing is said about females role in the family🔮","post_message":"In 2011 a Belgian photographer was allowed entry into one of Japan’s Yakuza families. Over two years, he captured the lives of those living in the underworld"},{"comment_id":"10153284046734228","commenter_b":"Th!at girl blacked her eye","commenter_a":"That dude is either Prior service (MP) or a local cop. His entire demeanor and physical behavior scream it. I don't think brandishing was the best idea either way..","post_message":"Teens who frequent the skate park say they aren surprised by the fight, but they can believe how it was stopped. A man pulled a gun. - @webpagelink"},{"comment_id":"10154349136059203","commenter_b":"Then you would be sexually assaulting a sexual assaulter","commenter_a":"If I ever saw this piece of shit in the street, I'd kick him in the nuts. He's a disgusting animal","post_message":"As if this could get any sicker."}]
