[{"comment_id":"964624156930666","commenter_b":"Fat wives also can wear jeans ^_^","commenter_a":"He must have a really fat wife.","post_message":"Sounds reasonable :/"},{"comment_id":"10154962501399609","commenter_b":"And I love Mexican women too.","commenter_a":"This will bring in more money for our economy and more jobs to the US and lessen our trade deficit with Mexico. The demand for US products will go up and continue to stimulate our economy. Finally, we have a president making decisions that loves Americans and his country.","post_message":"JUST IN: President Trump wants to pay for the border wall by imposing a 20 percent tax on imports from Mexico. @webpagelink"},{"comment_id":"1173905836039000","commenter_b":"She's not my plan b.","commenter_a":", Sanders is a good man, sad what the DNC did to him, they rigged the rules against him, Hillary is running all the way to the bank laughing her big fat @ss off, this Democrat will not vote for that money sucking Hag !!","post_message":"Bernie Sanders shoots some hoops with NBC's Chris Jansing. More from the court: @webpagelink"},{"comment_id":"1118742268187889","commenter_b":"ISLAM AND SHARIA LAW SHOULD BE BANNED FROM AMERICA PERIOD! THE MEMBERS OF THE OBAMA ADMINISTRATION NEED TO ALL BE REMOVED BY CONGRESS FOR TRYING TO TAKE OVER AMERICA THROUGH ISLAMIC RELIGION! PEOPLE LIKE OBAMA, HILLARY, LYNCH, HOLDER, GARLAND ARE ALL WORKING TO FORCE ISLAMIC BS UPON THIS COUNTRY! WE HAVE SECRETLY BEEN INVADED BY THESE POS TRAITORS AIMING TO BRING DOWN THE U.S. THROUGH ISLAM!","commenter_a":"finally a State with some b---s","post_message":"CELEBRATE!! VICTORY! South Carolina House Passes Bill Excluding Sharia Law From State Courts! THEY TOLD MUSLIMS HELL NO!"},{"comment_id":"1185646658122029","commenter_b":"Yeah, thanks fer nuthin'. Don't need some guy's forgiveness for anything. Not lookin' for it, ain't askin' for it.","commenter_a":"No one but God can forgive sins. The Pope and priests are men.","post_message":"BREAKING NEWS: Pope Francis will allow Roman Catholic priests to absolve women who have had abortions if they seek forgiveness, the Vatican announced Tuesday."},{"comment_id":"986959091402697","commenter_b":"Your wife?","commenter_a":"Twat","post_message":"The poll shows a 10.7 point lead among likely voters over Trump."},{"comment_id":"1574345245925141","commenter_b":"Hillary is a superpredator of immigrants and minorities. Bill is a superDUPERpredator of young women. She panders to Muslims who kill gays and rape women. Hypocrite superpredator. Ouch...","commenter_a":"We Americans know trump is weak. Trumps first trip to Mexico was a failure. He came to lie to American people just hours after the visit. Shame trump","post_message":"Thank you - Conservative Party of New York State. An honor to receive your endorsement! Together, we will MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"}]
