[{"comment_id":"10156334612930354","commenter_b":"P.S. \"Illegals\" cannot vote.","commenter_a":"Good for Hungary for putting up the fence. It is their country and they have every right to protect it from any invaders. It's too bad our Golfer-in-Chief and the rest of the liberals don't feel the same concern for our country. They don't want to stop illegals because of the votes they can bring. 'Bleeding Hearts\" are a really sick bunch of people.","post_message":"This can't be right... Obama--who lives in a home surrounded by a fence--says border fences don't work. How can this be?!"},{"comment_id":"1703542769705464","commenter_b":"Nothing wrong with the east end of london. I used to go there most weekend to watch West Ham. Most of the whites moved out so blame them for not integrating.","commenter_a":"What a load of BS.. The best thing about britain is that its a big melting pot of all cultures and religions and we all get along fine apart from a small minority of extremists.","post_message":"According to a shocking new report"},{"comment_id":"1832240316996227","commenter_b":"Since you took the time to report this, why not put the effort to fix it? or educate us how to prevent this? Or are you one of those assholes that like to stir up nonsense to get recognitions?","commenter_a":"When I was young I vowed to kill all the bees. I see my plan is working.","post_message":"Do NOT scroll past this!! ✋✋ Source → @webpagelink #WakeUpCall | #SaveTheBees Join Us: The Free Thought Project"},{"comment_id":"1185974561486681","commenter_b":"Motherfucka must of been hella hungry","commenter_a":"Ys Ir","post_message":"Ladies, would you let him?. #WSHH"},{"comment_id":"668156923332741","commenter_b":"Oh, so now you speak Spanish? You voodoo witch!","commenter_a":"What does it takes America to see that Obama and Hilary have offered our country very little for the past eight years, good deceptive speeches, pure empty promises, Obama Health Care that every Insurance Company wants to drop because they are loosing so much money, bad immigration system, from one lies and deceptions after another, 400,000,000 American tax dollars for ransom, two more Americans Kidnapped for more ransom money, bad Iran deals and foreign bribes for speech and favors from corrupt foreign leaders, 33,000 deleted government email, deleted and covered up under Hilary skeleton closet because Hilary think she is above the law, deceptions, Hilary lies and cover up about Benghazi, from one lies and deception after another coming from Hilary and Obama to much to list, while our country is falling apart and American Citizens are suffering, our poor minority American Citizens are suffering, getting worse and worse under ...","post_message":"A tan solo 83 días para el día de la elección, Trump contrató a una de las voces más extremistas de la derecha para dirigir su campaña. Este es quien realmente es Trump y queda claro que no va a cambiar."},{"comment_id":"1163551927039667","commenter_b":"What's on the inside is what matters. On the inside, Trump is pure puke and crap. Sher, on the other hand, is a decent human being who has paid plenty of dues.","commenter_a":"I don't like Trump, but at least he still has the face he was born with. Cher...not so much.","post_message":"\"I just wish he'd fall off the face of the earth,\" Cher said about Donald J. Trump"},{"comment_id":"1754483651501060","commenter_b":"When they take our gun rights away, what are we to protect ourselves with when evil terrorist get guns off the black market? And don't people see that more people are killed by drugs and drunk driving in America than by people shooting others? They just want to take our rights away!!!","commenter_a":"Barbaric!!","post_message":"Watch Rep. Louie Gohmert shout \"radical Islam\" at House Democrats who were staging a sit-in on gun control. @webpagelink"}]
