[{"comment_id":"10153183802333188","commenter_b":"\"The walking dead\" are serving as most of our representatives in Washington, take a good look next time someone speaks to the Congress.","commenter_a":"Why do you think it's so good? It prepares us for what we might expect in a SHTF scenario.","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"694905427350625","commenter_b":"@username do you have special \"illegal spotting\" glasses? How do you know who's here legally & who isn't? Can you just look at people and tell or what? It's ok for them to fight in the army but because they're \"illegal\", they shouldn't be able to live here. Illegal immigrants aren't the problem, racists are","commenter_a":"I'm a Mexican who lives in Mexico, I had to say that before someone comments that I should be deported. Let me tell you that WE, you and us, are not enemies, yet your federal government, and Trump have treated us like such. The point is that some of us even share family living in both sides. I do have lots of American friends who I care for and respect greatly. I do also know that the majority of Americans are decent, honest, hardworking, generous, and God loving people. I am not against you neither most of my fellow country men are. I ask you from the bottom of my heart and trying to appeal to your reason and kindness not to let all this crazy stuff mess with our relationship as fellow humans and as good neighbors. We are friends and family. Let's keep it like that. Thanks for ...","post_message":"We certainly have. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153710881709726","commenter_b":"yeah she needs to go to jail....","commenter_a":"Gowdy why worry Hilary broke a lot of laws and she's just scum period someone has to put her ass in jail","post_message":"WATCH: Benghazi Probe has ‘Nothing To Do’ with Clinton"},{"comment_id":"10154953325678984","commenter_b":"John, trump just said in his speech last night we have to unify. How can we when you make stupid statements like that!!","commenter_a":"President Trump should invite the Haitian Leaders, absolutely. And as a gift to them, hand over the Clinton's to them to face justice there.","post_message":"Obama probably isn't going to like this..."},{"comment_id":"953345841476863","commenter_b":"that same lie every fuckin time. let me guess. Cherokee. fuck that shit. bitch is lying. and she's just another white racist tryna curve us from the truth. you're nice shit don't fly around me. I'm gonna bring out the racist in you for everyone to see if you keep on. let's play","commenter_a":"I rarely hear a white person say either of these things, and if anything I hear blacks alday long say go back to Mexico to Spanish Americans","post_message":"We're waiting..."},{"comment_id":"10153950706953132","commenter_b":"This is why people suck.. who the hell does that?? why??? WTF.. really man!!????","commenter_a":"Autumn Baker","post_message":"But it's the little boy who won the game."},{"comment_id":"609176595931357","commenter_b":"Not shark tale though 😂😂😭😭 Alex McKay @username","commenter_a":"Jasmine Elise","post_message":""}]
