[{"comment_id":"1099878783413317","commenter_b":"Thank-YOU!!!!!","commenter_a":"Damn good question! Ask obama!!","post_message":"America's Freedom Fighters"},{"comment_id":"1283553535022959","commenter_b":"Ryan got a totally cushy job.","commenter_a":"Aleks Evans","post_message":"LOL! Not helping anyone, Ryan!! SHARE if you agree! (Hat tip to The Christian Left)"},{"comment_id":"10153327625216833","commenter_b":"She's a puppet","commenter_a":"Seems to me that the police that have been in danger are in the black communities.","post_message":"On March 28, MSNBC Melissa Harris-Perry suggested the push away from gun control and toward expanded gun rightswhich means more armed, law-abiding citizensactually puts police lives in danger."},{"comment_id":"10155206212838984","commenter_b":"It could also be that the libertards Have No Taste! They don't know a Good Thing When They See It!","commenter_a":"For the life of me , I cannot understand the obsession all these small minded liberals have with the Trump family. Is it jealously ?? You can't possibly spend that much time dwelling on people you don't even know. Lots of people weren't happy with the Obama presidency or his crude wife, but they didn't spend every waking moment stalking them, writing fake news about them. At this point I have serious concerns that there is a mental health epidemic in this country as far too many people are consumed with hatred that has no true origin. Hopefully the pharmaceutical companies can keep up with the demand for medications that clearly need to be prescribed.","post_message":"Maybe now this reporter will think twice before attacking the first lady."},{"comment_id":"10152984234114726","commenter_b":"Deport all Muslims!","commenter_a":"Muslims can live in their Muslim lands in the Middle East. Europe must expel these terrorists. Unlike the Nazis, these Islamists will NOT be sent to concentration or death camps. They will be sent to their homes to stop their invasion of other lands. But we must say things that are NOT politically correct and follow those with actions if we are to survive these Islamic horde. Once they have enough power to resist, then it would be too late. Now is the time to deport, expel or arrest them. Now not later.","post_message":"VIDEO: RAW footage from the terrorist attack in Paris!"},{"comment_id":"960647347306835","commenter_b":"I can't find what I'm looking for now.","commenter_a":"I try not to think of them at all...","post_message":"What do you think of these massive new changes coming to your local Target store?"},{"comment_id":"10153646192799342","commenter_b":"I hope they have to serve every minute if those 60 years! What trash!","commenter_a":"So sad......","post_message":"The details of this case are just awful."}]
