[{"comment_id":"10153261514799586","commenter_b":"There is no hope for trash like her, none. Evil cannot be cured by any medical means, can not be rehabbed by any therapy or therapists; its bone deep imbedded and what creates their DNA. The ONLY means of eradicating this evil is to permanently remove their existence from inhabiting the earth. Once removed, incinerate the physical carcass so there is absolutely no way of the evil occupying an ounce of space ever again, starting with animal and child predators of all existences such as this female beast.","commenter_a":"Word","post_message":"SHARE if you wonder the same thing. CC: Ricky Gervais #BanHunting"},{"comment_id":"10155297533295294","commenter_b":"What about mature women ??","commenter_a":"Tina, No not customers. How the company treats its employees. It might just be the local HD.","post_message":"Veterans, retirees and college students are strongly encouraged to apply."},{"comment_id":"1203190183110565","commenter_b":"And Trump will build a wall and call you a rapist!","commenter_a":"It happens every election year, Bill Clinton (2 terms), G.Bush 2 terms, Obama 2 terms they pander for our votre (Hispanic) and once they get into office what do they do for the Hispanics. Bill Clinton had a few token Hispanics in his administration so did George Bush and very few with President Obama. Now Clinton and Sanders are also clamoring for our vote. They will probably get the majority of Hispanics to vote for a Democrat but I have a feeling that once Sanders or Clinton get in it will be more of the same for Hispanics in high governmental positions, Nada or muy poquito!, Trump has alienated about 99.9% of Latinos and every other race and if he gets in who knows what he will try to do with every so called minority group in America. The KKK will administer Homeland Security, the Amereican Nazi Party will administer ...","post_message":"The state so rarely has much say in a presidential race..."},{"comment_id":"1538803016422900","commenter_b":"EVIL WOMAN!","commenter_a":"WHAT IS THAT, AN ALBINO MONKEY????????","post_message":"Did Hillary Clinton get her money's worth?"},{"comment_id":"10155456952478797","commenter_b":"His mom was white you racist white hater!","commenter_a":"African american? He's interacial! His mother is white, let's not forget her!","post_message":"Honoring Barack Obama, the 44th President of the United States and the first African American to serve as president. bit.ly/2mfD3IE"},{"comment_id":"10153895768928132","commenter_b":"Showing your butt in public doesn't empower women. It's the opposite. It shows women as sex objects. It shows little girls that is ok to post pictures of them naked. It shows those real woman with curves that if they don't look like that, they are not\"normal\".","commenter_a":"Beautiful!","post_message":"You rock, Demi Lovato!"},{"comment_id":"10153475441185329","commenter_b":"Bologna on stage lights sounds familiar.","commenter_a":"@username, I assume you have already done this many of times.","post_message":"This is how real men grill."}]
