[{"comment_id":"1721173881464308","commenter_b":"All lies, the smile to fool American's! No woman shouls allow to ru for prseident on Bil's Lewinski nasty in the White on principle alone on top of all the dangerous mistakes and incompetence that runs throyugh her desparate veins. Souless human!","commenter_a":"AMEN!!!!!!.......","post_message":"Breaking News: Hillary Clinton has clinched the Democratic nomination for president, according to The A.P."},{"comment_id":"10154274374674445","commenter_b":"Meant north Falmouth not Nana! These txt terms get ahead of me lol!","commenter_a":"Granddaughters & sister-in-law-,law live in E,& Nana Falmouth have to check it out!, saw on local TV Chronicle last night!","post_message":"Chronicle on WCVB Channel 5 is exploring the beauty of Cape Cod. What's your favorite spot to visit each year? Watch live: @webpagelink"},{"comment_id":"10157972017965093","commenter_b":"@username Hey moron why couldn't those 3 legged blind goats beat trump.","commenter_a":"They couldn't beat Trump, what makes you think they could beat Clinton. Just asking the question tells me that you still haven't figured out exactly how fed up people are with the Republican leadership. They, and their democratic counterparts are the reason people are crying for term limits.","post_message":"You decide..."},{"comment_id":"223405771457676","commenter_b":"Greg Allen Bitch was prob Bisexual🤣 There's alot of them women running around claiming they gay when they lowkey bi. Hell the woman I messed with was prob Bi on the low!","commenter_a":"To each their own.. Who cares if she wanna be a stud.. Lol y'all niggas mad that her broad prolly look better than yours.. And you are born with a dick.. lmfao.. Let this person be whatever they want, ain't hurting me or my pockets fam..","post_message":"Crazy difference... #YoungMA #WSHH"},{"comment_id":"10152710610321051","commenter_b":"Many Americans dont' have enough to while this couple seems to be eating too much - thanks to benefits they are not entitled to!","commenter_a":"Wrong!!!!","post_message":"A couple that lives off benefits because they’re too obese to work got another gift from taxpayers."},{"comment_id":"10152963839226051","commenter_b":"What is going on with these ungrateful wretches. They act worse than animals.Shut down the frat houses, they are all acting disrespectful","commenter_a":"cut their dicks off the young punks.","post_message":"Things just went from bad to worse for the frat boys who spit on wounded veterans and their service dogs before urinating on the American flag."},{"comment_id":"1469983173042150","commenter_b":"#Youcantdefendit #grabthembythepussy #anybodybutTrump","commenter_a":"Folks we should be talking about this Obama care collapse and how our premiums are going up in 2017 by 26% scary . My family can't afford this !!!","post_message":"The story just keeps getting worse, and worse."}]
