[{"comment_id":"1528594670781352","commenter_b":"Death penalty. Nothing less. Deporting them isn't going to change anything. They'll be back and will do this again.","commenter_a":"I love Obama","post_message":"If we don't have a border, we don't have a country. I want people to come in LEGALLY and follow the laws of our great country!"},{"comment_id":"1554605091501420","commenter_b":"Merry Christmas","commenter_a":"True Patriots True Americans for Donald Trump Keep the White House Hillary Free 2016 This Is Why I Support The Ban On Illegal Refuges/Muslims, Deport Illegals No Amnesty, No Tax Dollars Spent On Any Of Them Watch How FAST They Self Deport Themselves!!! Bernie Supporters That Are Feeling The Burn Should Jump On The Trump Train To Defeat Hillary Who Would Be The Worst President In US History!!! Next Stop Novembers General Elections Then On To The White House Were Donald J. Trump Will Be The President Of The Unites States Of America! Thanks To You And All His Supportes Across This Great Nation!","post_message":"You think we can coexist with these people!? They HATE our way of life! Let's get 5000 SHARES if you believe Muslims will NEVER Assimilate in America!"},{"comment_id":"10154108644646178","commenter_b":"This is where GWB, Dickhead Cheney and all those racist MURDERER Cops belongs. They are the real MURDERERS !!!","commenter_a":"Stupidity abounds in the liberal media. Wake up folks!","post_message":"\"Well, actually, again, if you are a terrorist you belong in Guantanamo Bay. That where they should stay....\""},{"comment_id":"10153119045143145","commenter_b":"You are actually showing your colors, stop trying this woman about race card when it was all about race.","commenter_a":"She was stupid and uncooperative. Why didn't she just do what they asked her instead of acting like a complete assh*le.","post_message":"This woman got into a road rage argument in a school parking lot. Then this is what happened when police arrived. #WFTV WATCH THE VIDEO: @webpagelink"},{"comment_id":"10154844264313132","commenter_b":"Sorry katie but i think you are confused between who hillary is and who trump is cuz clearly he was the one interupting her on soo many questions and tring to intimidate her just like he does every other woman but thank goodness she is a strong woman and did not let him get to her lol","commenter_a":"Wow this just goes to prove that hillary is the better candidate hands down. She definately killed trump and i think he got angry and became soo defensive lol she was very prepared and he was not","post_message":"Donald J. Trump says he will release his tax returns when Hillary Clinton releases her deleted emails. @webpagelink"},{"comment_id":"10158299454390206","commenter_b":"Then get the hell out.","commenter_a":"I will pay for the firing squad bullets! Now.","post_message":"Chelsea bombing suspect is apparently a United States-hating homophobe @webpagelink"},{"comment_id":"904212379645518","commenter_b":"These thugs and hoodlums should be arrested .","commenter_a":"Thugs","post_message":"He Wasn't Ready!"}]
