[{"comment_id":"10153638977331336","commenter_b":"Who said I only talked to one? I only mentioned ONE conversation","commenter_a":"Their apology means nothing if the employee was not fired immediately.","post_message":"The Pembroke Pines Police Department says that a uniformed officer was refused service at an Arby's simply for being a police officer."},{"comment_id":"617179595103961","commenter_b":"She is SUPER PREDATOR HERSELF","commenter_a":"$illary🐍🐍🐍🐍🐍 in the grass she will do any thing say anything to win ... Oh ya she already has","post_message":"This Video SHOULD Cost Hillary Clinton The Black Vote"},{"comment_id":"10152712220635736","commenter_b":"I'm half native you ignorant land thief!","commenter_a":"Kill it? Really? Greedy ass humans are the reason it has no food. HUMANS catch its food source and deplete rapidly. Maybe the shopkeeper will open up a tab for the poor thing. Maybe the natives should start shooting up all the white people? Doesn't sound fair? Don't go shooting starving animals.","post_message":"Watch: This seal jumps out of the water to search for food inside an Astoria market: @webpagelink"},{"comment_id":"430918413735174","commenter_b":"No inadiment object kills, ie, knife, gun, car, tire iron. It takes people to pick them up use/drive to kill someone. If y'all did your research, guns are not the leader in killing people. Your wife's Rolling pin is up there. Smh at some of you.","commenter_a":"Just waiting for the \"guns don't kill people\" squad","post_message":"\"More than half the women murdered each year are killed with firearms — and in nearly 75 percent of those deaths, the weapon is a handgun.\" Fault Lines: Death in Plain Sight, tonight at 10pET"},{"comment_id":"838829739577213","commenter_b":"Yes! They should be arrested!","commenter_a":"As long as it includes under God!","post_message":"This is disgusting. Do you support the Pledge of Allegiance?"},{"comment_id":"1204291722963907","commenter_b":"and as I assume the majority of their passengers are muslims - then they are providing them information that they require - AND - is harmless","commenter_a":"What kind of prayer? I've flown Royal Brunei Airways twice so far. Before the plane takes off, a Muslim prayer ist shown on the monitors and during the flight the direction towards Mekka is shown and not the plane's position!","post_message":"A passenger saw a WhatsApp message about 'prayer' and feared he was a terrorist"},{"comment_id":"10153896267090329","commenter_b":"How about don't send dick pics to anyone. If she wants to see it she can come over...","commenter_a":"The only one I dont support is the woman who shared a screenshot of the dick pic. Yes, unsolicited nude photos are completely uncool. BUT if a woman sent a boob pic to a dude without Asking him if he wanted one, and he shared it on the internet ... Well this would be a whole different post.","post_message":"More and more every day, women are turning to the internet to find the justice the real world won't give them."}]
