[{"comment_id":"10154104100243132","commenter_b":"#2. he likes ugly chicks","commenter_a":"Just be happy... The beginnings are the best!","post_message":"New year, new romance for Amy Schumer!"},{"comment_id":"967042846696781","commenter_b":"No. Smokers gotta find their own way outta hell...not on my tax dollar tganks!","commenter_a":"If you really want to quit smoking you can afford to buy it as cigarettes cost a fortune, put the money to better use","post_message":"Controversial..."},{"comment_id":"10153652749211336","commenter_b":"You better find a different church.","commenter_a":"Joe's Sunday Sermon - 09-06-2015 I guess I am compelled to address the elephant in the room. No, I am not making fun of her weight, it is just an expression. I am of course talking about Kim Davis, the misguided Kentucky Clerk of the Court that was recently jailed due to her contempt for the court and in my humble opinion, for humanity as well. This is NOT an issue of religious freedom. You can twist it, bend it and run it through a press and it will still not come out as a religious freedom issue. Does her issuing those licenses force her to change her religion or her religious views? No. No, it does not. She may still practice her religion as she chooses. She took an oath and that oath was to uphold the law. Does her religion condone being dishonest and deceitful? Well, again, in ...","post_message":"As Kim Davis began her third day behind bars yesterday, having chosen indefinite imprisonment over licensing gay marriage, around 300 people gathered on the lawn outside."},{"comment_id":"1182026965223689","commenter_b":"Those Redumblicans are getting worse everyday!","commenter_a":"He deserves what he got !","post_message":"Here's some more of those \"family values.\""},{"comment_id":"10153626418796509","commenter_b":"She truly is hideous","commenter_a":"God she's so ugly . How did she trick Ferris Bueller into marrying her?","post_message":"Many celebrities attended the Metropolitan Museum of Art's Costume Institute Gala in New York. See pictures from the red carpet. @webpagelink"},{"comment_id":"965586620162170","commenter_b":"Scumbag","commenter_a":"....too many \"GUNS\" on the street....and who is holding these guns????? The criminals, thugs, refugees, muslims, and other monsters that are given free reign and encouragement to commit these crimes against innocent citizens! Another elected official with his head up the governments butt!","post_message":"BREAKING…CAUGHT ON TAPE: 30 Yr Old MUSLIM MAN Ambushes, Shoots Philadelphia Cop Several Times “I’m shot. I’m bleeding heavily!” Muslim shooter says he did it \"In the name of Islam\" When Obama's War On Cops and Islamic Terror collide...."},{"comment_id":"668462060011039","commenter_b":"kick the racist out of here!!!","commenter_a":"Send him to Guantannamo","post_message":"A scandalous tape of Al Sharpton has been released... He's not gonna like this. Let's make it go viral. Sharpton is a complete hypocrite. Who's the racist now? Let's kick Sharpton out of America... NOW!"}]
