[{"comment_id":"10156964298475557","commenter_b":"Unbelievable that she is allowed to be running for president if I did what she did they would have found me guilty and thrown the key away!! To think she could be our president, omg!!","commenter_a":"Political game playing and media bias. This woman should be in prison. Not on a pedestal. She is as corrupt as they come. Why are people so stupid?","post_message":"Hillary Clinton will become the first woman to top a presidential ticket after securing enough commitments Monday from delegates to become the presumptive Democratic nominee, The Associated Press reported."},{"comment_id":"10150935910204999","commenter_b":"Women for Donald J. Trump","commenter_a":"Is this the Hillary lecture show or a debate where we're going to hear from two people. Chris Wallace if you wanted to have a person conversation with Hillary you should have called it as such and not drag us through this BS","post_message":"Chris Wallace’s star turn is a welcome source of pride at Fox News. And, maybe, some relief."},{"comment_id":"10153314267037434","commenter_b":"\"Just fly to the UK, no biggie\" except this woman couldn't raise the money to fly to the UK and pay for the procedure that others get for free, and so she ended up in the above situation. \"Fly to the UK, prpblem solved!\" Easy to be callous and glib when its some other poor sucker's life and you're ignorant of the facts, isn't it?","commenter_a":"Yay, Ireland. I live in terror of an unwanted pregnancy because of this kind of insanity. :/","post_message":"Had the woman been living anywhere else in the United Kingdom, she would not have seen a courtroom. However, abortion remains illegal in Northern Ireland."},{"comment_id":"923707264362696","commenter_b":"Then fuck off with THAT bullshit. You ain't Gods gift to women. 😂😂✋","commenter_a":"Why are dudes so obsessed with a woman's personal life? Why do you need to know that and why does that information matter? The real issue is are you both STD free, not how many people someone has had sex with. Evolve please!","post_message":"When She Says She Only Had Sex With 3 Guys"},{"comment_id":"10154027837914087","commenter_b":"Must be polling illegals...","commenter_a":"BOGUS BULLSHIT.","post_message":"Hillary Clinton leads Donald Trump by nearly double digits in New Mexico."},{"comment_id":"1353337611353126","commenter_b":"What needs to happen if Trump wants to make America great again is give it back to the original owners. I think it's funny when Trump supporters say their not racist and some aren't, yet you must know that so many are. That's why there's a popular Trump chant \"Make America white again\" which is ignorant because it never was!!! You killed off the main population of natives then brought the Africans here to work your farms without as much as a thank you. If true justice and freedom or anything great were to happen in that case we would pack all you European folk up and send ya shipping. You bitch about minorities yet your ancestors brought our ancestors here, to a land stolen from anothers ancestors. You are the problem and the contradiction, you should leave. But really all we want is to live peacefully with everyone now ...","commenter_a":"Went from racist, Muslim, and a wife who was one of the uncouth \"first lady\" ever.","post_message":"America DOES NOT stand with Trump. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1112602185474010","commenter_b":"FFFFFFFFFFFFFFFFFFFFFF trump he is a orange bigot! #Ftrump","commenter_a":"trump 2016","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."}]
