[{"comment_id":"10153031435480671","commenter_b":"Soldier on ladies!","commenter_a":"Ricky Myette","post_message":"What do you think about two women graduating from the Army's elite Ranger School?"},{"comment_id":"960199417353864","commenter_b":"You think allowing illegals to become citizens will not increase your \"real problems?\"","commenter_a":"What in the world are those loony Republicans thinking? Oh yeah, it's the \"me, me, me, f**k you!\" mentality that keeps them going. They ignore the real problems of gang wars, poverty, human strife, and persecution in the places where immigrants come from while at the same time, those idiot neocons perpetuate the \"War on Drugs\", \"War on Syria\". and all other unnecessary wars. Those people show no mercy on fellow human beings... Why is it that people remember to hate and separate while struggling to love and unite?","post_message":"Republicans are so eager to see brown-skinned children deported that they're willing to put the entire country at risk in hopes of making it happen."},{"comment_id":"1277527375611846","commenter_b":"@username, and you KNOW she absolutely will DO it, too!","commenter_a":"This election isn't about picking a president! It's about the Law..Yes the Law!!!!USA Law against Sharia law!! Wake up Americans, don't you Dare be fooled,don't you Dare wear the Americans are stupid label, show all those countries out there that your a brilliant Mind and your family will make a smart choice in votes for your Country and what it stands for! God bless our way of life.Amen","post_message":"Anti-Christian extremists are demanding that senior U.S. military chaplains be investigated and punished for praying in uniform. Sign our petition to fight back. We must defend our brave military chaplains."},{"comment_id":"458683577589570","commenter_b":"Negotiations are not PC, you get what you can out of your adversary ! GO AMERICA, to hell with \"global niceties !","commenter_a":"The author is racist against Asians. Trump is not","post_message":"Donald Trump shows that he's not afraid of anyone, especially people from other countries that he does business with every day."},{"comment_id":"526657100877562","commenter_b":"@username that's why I'm voting Jill Stein.","commenter_a":"I'd rather vote for the one who may have evaded taxes than the one who led the charge on foreign policies that killed millions of people and now possibly could cause WW3 by taunting Russia with the no-fly zone in Syria. But I digress...Jill Stein is who I'm voting for because I don't vote for monsters.","post_message":"So, Trump goes around and says, \"Hey, I'm worth billions, I'm a successful businessman, but I don't pay any taxes. But, you, you make 15 bucks an hour, you pay the taxes, not me.\" That's why people are angry and want real change in this country."},{"comment_id":"1333030216717005","commenter_b":"She has no talent and is trash","commenter_a":"Levy a fine, and move on. That show was one of the best in a long time. Grande was very good.","post_message":"Singer and actress Ariana Grande surprised the \"Saturday Night Live\" audience and crew with an unexpected profanity during her monologue."},{"comment_id":"1836028549960584","commenter_b":"She is our next President.actually Trump made it easier for her .","commenter_a":"Yeah, it pisses me off ... but my respect for her has just gotten greater.","post_message":"She and her supporters smile and thrive despite a daily avalanche of hatred."}]
