[{"comment_id":"10154121076339342","commenter_b":"You are sick! Abortion should not be an option, period!","commenter_a":"There are so many people who would love to have kids and can't. But monsters like this get that blessing and go and kill their kids. This world is so effed up.","post_message":"Chilling new details about how a mother allegedly took each of her kids into the bathtub, and took their lives."},{"comment_id":"10154917565918690","commenter_b":"how about stop raping women and build some toilets?","commenter_a":"Great job ....we feel proud of our national anthem..haters ...f****k offf","post_message":"\"The time has come, the citizens of the country realise that they live in a nation and are duty bound to show respect to the national anthem. @webpagelink"},{"comment_id":"1306172506079052","commenter_b":"@username if immigrants want to come to America and live the American Dream they should work for it. Trump isn't against immigration he is against ILLEGAL undocumented immigrants. If u want to come here, come the right way.","commenter_a":"And when a pregnant illegal comes here and has a baby born here that baby is a citizen and then that baby is able to get welfare food stamps housing WIC fuel assist etc... All while the mom is an illegal but cuz child is born here it's entitled WAKE UP AMERICA","post_message":"Donald J. Trump responded Monday to the worst terror attack on U.S. soil since 9/11 with a tough call to clamp down on Muslim immigration. @webpagelink"},{"comment_id":"10154442761894094","commenter_b":"Hopefully the other morons follow his wise protesting technique on Friday. Idiot.","commenter_a":"cool..or should i say hot...lol","post_message":"Two days before the inauguration, one man has started his crusade against President-elect Donald Trump, and it nearly cost him his life."},{"comment_id":"10153070826933701","commenter_b":"hes a fag it","commenter_a":"Nope!","post_message":"Heisman winner Marcus Mariota on the loss of wide receiver Darren Carrington to a failed drug test: \"We'll get another guy that's ready to go.\""},{"comment_id":"475643605893567","commenter_b":"Why not hit I would if she did that to me","commenter_a":"First up, this woman is NO lady!","post_message":"This lady just messed with the wrong 73 year-old."},{"comment_id":"10154258956738352","commenter_b":"Congratulations. Amazing lady.","commenter_a":"Twins!","post_message":""}]
