[{"comment_id":"10152902448996680","commenter_b":"Get your Zoloft refilled.","commenter_a":"She is despicable. Trash.","post_message":"The Island nation of Palau gets swept up in the Hillary Clinton controversy."},{"comment_id":"10154514379914657","commenter_b":"And your answer is to just try to talk them out of killing us Nancy. \"Maybe if we're just nice to them, they won't hate us\". Coward","commenter_a":"Stirring up more hate,the Republican way. Your answer to everything is violence.I have never heard so much vile hate in my life. You are horrible human beings.","post_message":"UPDATE: A Paris prosecutor has also confirmed the passport that was found."},{"comment_id":"1025021754204963","commenter_b":"Will make the perverted staff , horny ?","commenter_a":"Give gun control without rules. Makes a lot of sense. Not. But tell a little girl she can't feel pretty. :(","post_message":"A father bought an adorable dress for his adorable little 5-year-old girl but her school forced her to wear a t-shirt and a pair of jeans because her shoulders were showing and Texas school officials couldn't handle it."},{"comment_id":"10153141758042994","commenter_b":"unfortunately my tax dollars go from her welfare check to paying for her prison cell...I have no sympathy for her whatsoever... I feel sorry for her living children..","commenter_a":"Where's daddy? Protector supporter?","post_message":"\"My client has suffered from serious depression, long-term chronic,\" Steve Kaplan said. \"She's also less-than-average in intelligence.\""},{"comment_id":"1001898416489082","commenter_b":"Puke and barf!","commenter_a":"Muslim views and laws have no place in America. We have our own laws we don't need islamic sharia laws here,say no to anything muslim.","post_message":"\"Forget the so-called \"Jewish controlled media.\" In the West today wealthy Saudi royals pull all media strings.\""},{"comment_id":"608701745929674","commenter_b":"@username-I usually stay out of this topic area since it isn't making a huge impact on my life. However, science has shown that when populations of a certain group go up too high, homosexual bonds do come to play. For instance in Africa way back when, sometimes today, if the village had to many mouths to feed, the men would start mounting each other to prevent population growth. In animals, like dogs or cats, you have some that put off the opposite animals pheromones. For instance we use to have 2 female&spayed cats? The one kept dry humping the other.","commenter_a":"Considering most people don't get a sexual attraction until they hit puberty, how would they even know which students are homosexual unless the students are just acting out because of what they've seen their parents do...","post_message":"Pre-K? REALLY?!"},{"comment_id":"1299685360072319","commenter_b":"And what if the fingerprint belongs to a psychopath or a killer ? This solution gives the wrong message, that guns are okay, you just need to make them safer. But guns are not okay. But Americans will never understand this unfortunately. America was build on guns and blood. What do you expect. Don't come now with the reason it's the same with a knife. You can use a knife for different things, but it can also kill someone. A gun though has only one aim and it was made only for one reason and one purpose. To kill. And it's a very unfair way of killing too. I hate guns, I wish they all would disappear.","commenter_a":"This is a great idea if it can be refined to the point of consistent performance!","post_message":"Can a fingerprint save a life? This teenager is working on \"smart gun\" technology. (via INSIDER)"}]
