[{"comment_id":"714918215322687","commenter_b":"BUILD THE WALL","commenter_a":"Trump/Pence 2016... Enough of corrupt establishment politicians.","post_message":"Live: Donald J. Trump holds a rally in Manchester, New Hampshire."},{"comment_id":"775605039243294","commenter_b":"Experimental Sexual Preference Network - no longer watching this no moral standards network","commenter_a":"I will not be watching any more","post_message":"Leftist ESPN goes all in..."},{"comment_id":"10153459242386409","commenter_b":"That will teach him to open his big Mouth !!","commenter_a":"This is ridiculous","post_message":"A murderer serving three life terms for killing three people saw two more decades added to his sentence after a Washington State parole board considering his request for early release felt his crimes called for a harsher punishment."},{"comment_id":"10153590629541336","commenter_b":"Lady?","commenter_a":"How the hell is this \"lady\" not behind bars","post_message":"Ed Henry: “You were the official in charge. Did you wipe the server?” Hillary Clinton: “Like with a cloth or something?” WATCH: Today at a news conference, Ed Henry pressed Hillary Clinton as to whether or not she wiped emails from her personal server."},{"comment_id":"10155087301336509","commenter_b":"@username once stench like you and others weeded from this country, then decency and class will return. Its your choice to be losers. Stop blaming others for your failures in life..CLASSLESS!!!!!","commenter_a":"Michelle Obama is the strongest and the women with the most elegance I've ever heard of. Hopes she stays in politics and still get involved after she leaves the White House!","post_message":"\"Don't let anyone tell you that this country isn't great. This right now is the greatest country on earth,\" Michelle Obama said."},{"comment_id":"1549351415084883","commenter_b":"Dear Miss Jordan the idiot is not I that's for sure, just remember this this is not your land to start with. I hope you don't have an issue with the Native Americans because if it's true you should go back with you where you from.","commenter_a":"Why does the police have military style vehicles, why does the Native Americans still have to defend their land, why our government doesn't do anything about it.... Same old story oil companies rule the world.","post_message":"Watch as police in riot gear use pepper spray on activists protesting against the Dakota Access Pipeline. Multiple were arrested. More: @webpagelink"},{"comment_id":"10157409839305389","commenter_b":"CROOKED HILLARY everytime she Open her Mouth LIES come out !","commenter_a":"definition of a liberal: liar, thief, flip-flopper and now CORRUPT","post_message":""}]
