[{"comment_id":"987010284749083","commenter_b":"oh i would get me a few mini pigs i can have 3 here in my town in town. then i would put pig crap on the lawn all around my home i would be so mean. if i could hear them i would call the cops everytime make it a real pain","commenter_a":"Dope, I'd have pork on the grill and my guns loaded and pointed right at it. A sign saying come and get it, your choice on which one you want","post_message":"What would YOU do if you were put in this situation? Choose one of the two options! @webpagelink"},{"comment_id":"501298436725116","commenter_b":"Need more Americans like him . Hope he can beat all the charges . Muslims need to go back home !","commenter_a":"Not a hate crime","post_message":"A lesson he'll NEVER forget..."},{"comment_id":"1229126323813780","commenter_b":"Reaz Tiths tell us what @username has quoted about that book of peace.","commenter_a":"Islam does not teach us to kill others. But in real it is a religion of peace, although some are killing innocent Non Muslims in the name of Islam. What a shame! Islam teaches us to respect others beliefs & not to insult them for their religion. This is the Islam I've been taught","post_message":"'One child said a Muslim prayer and was spared, the other was killed'"},{"comment_id":"977484695718405","commenter_b":"You know all this for a fact?? Otherwise move along snowflake","commenter_a":"That was awkward to watch she was looking like she can't wait to get away from him seriously but her face never moves Botox much","post_message":"President Trump and First Lady Melania Trump just shared their first dance at the inaugural ball. @webpagelink"},{"comment_id":"735565289967382","commenter_b":"Dear God, kick this ignorant African so hard he gets back to Africa. He needs English as a second language. Also needs to be taught to not make threats. What a POS. Go back to where you came from.","commenter_a":"This guy is a fanatic. He'd better be stop or someone s going to get Bharat namely, him","post_message":"Knife wielding Muslim attacks Trump, but watched what happens next. I bet he never expected this. Let's show him our support. Can we get 30,000 'LIKES' Donald Trump?"},{"comment_id":"10158192109115206","commenter_b":"Moms Le Lotpi go to the kitchen? Is that where you think all woman belong? So ignorant.. Put your wife in the kitchen!!","commenter_a":"Wtf is wrong with these parents today. Heartless, deranged animals! Torture her slowly to her death..","post_message":""},{"comment_id":"10153603833598598","commenter_b":"Sick minded evil old women.","commenter_a":"One ignorant person!","post_message":"Nancy Pelosi: De-Funding Planned Parenthood Abortion Biz is “Taking Away Life-Saving Care”"}]
