[{"comment_id":"1346208208805563","commenter_b":"@username If you can even get in to see the surgeon!","commenter_a":"Its funny cause in Mexico, the full of thugs and criminals and rapists Mexico you can get major surgeries for free. Yes you need to wait a few weeks but you do get it free if you pay your fee (about 8% of your salary goes for health, another 8% for retirement and house)","post_message":""},{"comment_id":"10153010169898984","commenter_b":"Truth or not, IMPEACH him now. He is not good for America or for the American people.","commenter_a":"He's another Teflon Politician!!!! Makes no sense!","post_message":"[Best of 2014 Compilation] Back in Feb. 2014, Steven Seagal had some pretty harsh words for Barack Obama. Surprise! There are actually some actors in Hollywood who don't follow the party line..."},{"comment_id":"1271695059532579","commenter_b":"she is so miserable with herself she just lashes out at everyone such a poor excuse for a female","commenter_a":"Rosie is not well! Needs Mental Health help!","post_message":"Rosie is disgusting!"},{"comment_id":"1203190183110565","commenter_b":"And Trump will build a wall and call you a rapist!","commenter_a":"It happens every election year, Bill Clinton (2 terms), G.Bush 2 terms, Obama 2 terms they pander for our votre (Hispanic) and once they get into office what do they do for the Hispanics. Bill Clinton had a few token Hispanics in his administration so did George Bush and very few with President Obama. Now Clinton and Sanders are also clamoring for our vote. They will probably get the majority of Hispanics to vote for a Democrat but I have a feeling that once Sanders or Clinton get in it will be more of the same for Hispanics in high governmental positions, Nada or muy poquito!, Trump has alienated about 99.9% of Latinos and every other race and if he gets in who knows what he will try to do with every so called minority group in America. The KKK will administer Homeland Security, the Amereican Nazi Party will administer ...","post_message":"The state so rarely has much say in a presidential race..."},{"comment_id":"10152682791936167","commenter_b":"The thing that pisses me off is he gets paid for his bullshit!","commenter_a":"That rules him out.","post_message":"How Rush Limbaugh talks about female politicians:"},{"comment_id":"1211880145496741","commenter_b":"No to illegals.","commenter_a":"Mr. Gowdy, enlist some of your \"sleeping\" colleagues to assist!","post_message":"Thank you!"},{"comment_id":"10152902448996680","commenter_b":"Get your Zoloft refilled.","commenter_a":"She is despicable. Trash.","post_message":"The Island nation of Palau gets swept up in the Hillary Clinton controversy."}]
