[{"comment_id":"476652309189729","commenter_b":"donnnnt wanna hear it..cant stand her...","commenter_a":"Someone should us duck tape over her lips. She takes the cake for the most disgraceful women in the White House ever","post_message":""},{"comment_id":"10155222410880354","commenter_b":"Oobama and his stupid bastards.","commenter_a":"Deport EVERY SINGLE ONE!","post_message":"Obama Administration Sets Up Hotline for Illegals Seeking Amnesty Under Obama's New Policy."},{"comment_id":"10154113028645329","commenter_b":"Does this mean we all just became best friends?","commenter_a":"Wow. Completely true. Very accurate quiz.","post_message":"It really will. (via BuzzFeed Quiz)"},{"comment_id":"1262934473727561","commenter_b":"There is no 'weaker' version of the species. Both genders are the same species, just with physical differences.","commenter_a":"12,000 yrs. ago and they're still Lions 😭😭","post_message":"These images are just extraordinary. The cubs were just a few weeks old when they died."},{"comment_id":"827683380698175","commenter_b":"@username, so this guy should use the woman's bathroom?","commenter_a":"XY, XX there is nothing more, deal with it","post_message":"The American College of Pediatricians just made a SHOCKING statement about transgendering young children. Liberals are going to be pretty upset over this."},{"comment_id":"10153991299268984","commenter_b":"Make sure he meets his virgins..","commenter_a":"Coming SOON to an ENTIRE COUNTRY near you . . . !!!!!","post_message":"This ISIS supporter had planned something truly terrifying for New Year's Eve... Thankfully, law enforcement caught him just in time. Do we need to do more to support law enforcement against ISIS?"},{"comment_id":"10152885774891130","commenter_b":"Someone needs to tell that to most of today's feminists","commenter_a":"True Feminism exhibits equality. Real Feminists are not extremists seeking to belittle others. Liberal or conservative politics have nothing to do with that. Real Feminism exists on a daily basis through all walks of life. It incorporates normal women rising to challenges at work, at home, and in their communities, who expect equal treatment and equal compensation. It's sad that people can be so ignorant to this definition and can only judge radicalism with radical judgement.","post_message":"Long before feminism was a Hollywood buzzword, these films were way before their time."}]
