[{"comment_id":"10156750651870551","commenter_b":"Any one who eats pizza with a folk should get out of the country .WHAT A DOUCHEBAG","commenter_a":"He's a loser! Go down the tubes! And another one bites the dust!","post_message":""},{"comment_id":"912381755524744","commenter_b":"Cruz no need for explanation,ur vote wud be insignificant bc she is still the AG.Drop dead!","commenter_a":"We don't want Ted Cruz","post_message":"Ted Cruz was the only senator to miss the vote."},{"comment_id":"10153141451562894","commenter_b":"She a dub","commenter_a":"@username 😕","post_message":"Kylie Jenner literally just went from 100 to 0"},{"comment_id":"10154800678109203","commenter_b":"Stop the Racist Hate!","commenter_a":"Latinos are stupid especially the ones that are voting for the first time and have lived in politically corrupt countries. A vote for corrupt Hillary is throwing away the sacrifice they made to move here.Voting for a party that rigged a primary is a vote for corruption.","post_message":"\"We are the wall that can stop Trump.\" Latino Victory Project spokesman"},{"comment_id":"1170595402996226","commenter_b":"And the world would be a lot better place without your racist, misogynistic ass in it. Twit begone!","commenter_a":"Most admired my ass this stinking bitch allowed 4 people to die she a corrupt lying useless bitch should been in jail or zoo cage right next to the ape in heels","post_message":"Hillary Clinton just won Gallup's \"Most Admired Woman\" poll for the 21st time. Do you admire her?"},{"comment_id":"10153621477392293","commenter_b":"Holy crap. Did you even read it?","commenter_a":"UCMJ does prohibit frat w subordinates. This was NOT RAPE. Rape is not consensual. She was consenting then because he pulled away? She claims rape?? Not fair. If she wanted to be an officer then suck it up buttercup.","post_message":"A Naval Academy teacher fights to prove he’s innocent of sexual misconduct. Then a lost cell phone is found."},{"comment_id":"743297559178019","commenter_b":"Dumbest fucking answer. Trump met with the black panther party and several top gang members from Chicago to reduce body counts and help fix the black community. Dumb asses mistake for deportation of illegals vs legal immigration. Left supporters are the dumbest people on the planet.","commenter_a":"Good !!! Just makes More room for the REAL PATRIOTS","post_message":"\"I'm not going to the White House. I don't feel accepted in the White House.\""}]
