[{"comment_id":"10153341236279170","commenter_b":"This guy needs to stay in London. I do not exactly agree with what Pam Geller did, but she was well within her rights. It's just like when the muslims were building their mosque down the street from the 9/11 Memorial. They were within their rights, even though that definitely was the wrong thing and wrong place to put it. Islam has no tolerance and so America should stop being tolerant to Islam.","commenter_a":"So according to the traitor liberals it is fine to offend Jesus Christ but it is wrong to offend Mohammed , only in the bs traitor mind of the socialists this makes sense.","post_message":"If you're one of the people saying we need to rein in the First Amendment so we don't offend Islamists, just watch this VIDEO and know that THIS is what you're trying to coddle."},{"comment_id":"10153973412478854","commenter_b":"Move your black Ass ,no one cares.","commenter_a":"U Have Become Despicable & Have No Class.","post_message":""},{"comment_id":"1245235738872618","commenter_b":"Shes definitely got bigger balls than you lady.","commenter_a":"God how can anybody not believe Michelle is a man? Look at his face in this pic, my god.","post_message":"\"Everyone was in tears...\""},{"comment_id":"350626235140891","commenter_b":"She needs to be gone","commenter_a":"Then take Kenyatta West and get the hell out of the USA I think Iran would be a good place for you .","post_message":"Hip-Hop Artist Hates America, White Americans and Conservative People!"},{"comment_id":"10153786664991336","commenter_b":"You only needed 5 minutes, for her to spend 11 hours lying is a waste of time.","commenter_a":"We need closure and justice for them","post_message":"\"I'd like to believe that no matter what party you are, you want to put American life and safety first and foremost.\" – Gov. Mike Huckabee"},{"comment_id":"1383067515067050","commenter_b":"Your whore fingertips are getting in the way of you making any sense. Maybe if you'd done anything intelligent with your life instead of studying how to do your hair and makeup you'd see just what a failure to society you are.","commenter_a":"To all the haters, STFU. If you dont like it GTFOO our country, bc WE elected her! USA USA USA!!! We are great and will continue to be great with Hillary leading us.","post_message":"History has been made!"},{"comment_id":"10153350173059255","commenter_b":"Isn't that one of their anchorwomen?","commenter_a":"Most \"Sex Obsessed\" persons constanty ruminate about avoiding and policing sex.","post_message":"Really, guys?"}]
