[{"comment_id":"10156323559275294","commenter_b":"I will respond honestly. I am on the fence with medicinal use. Not sure it needs to be legalized for this purpose but not totally against it. I am totally against recreational usage because the bad outweighs any benefits in my opinion. I do not see it helping the economy or benefitting society at all. Plus the 10 only benefitted from the bill did not help and it should be a law only not a change to the constitution.","commenter_a":"To everyone that voted no I want a legit response on to what was so wrong with amendment???","post_message":"Issue 3, which would have legalized marijuana in Ohio, was voted down by a nearly two to one margin yesterday -- but officials with Responsible Ohio say the fight isn't over. Click below for more, including a complete list of election results:"},{"comment_id":"10153767520167994","commenter_b":"Alicia Anne , try Jennie Craig","commenter_a":"I no longer have any remorse for anyone in an accident. I see drivers acting like morons every morning and every night...until they start acting like humans, people will continue to die. Michigan drivers are all a bunch of morons.","post_message":"The Davison Freeway westbound remains closed as investigators comb the scene where a man was killed in a crash."},{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed. You can't see greatness at the same time you see that."},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"},{"comment_id":"10156546943220354","commenter_b":"THIS SHAMEFUL........","commenter_a":"What a piece of shit","post_message":"And then he said where he promises to MOVE if Trump DOES win..."},{"comment_id":"10155461555215354","commenter_b":"Cause shes an ASSHOLE","commenter_a":"Let her pay for it.","post_message":"Liberal values..."},{"comment_id":"10152973215291519","commenter_b":"So you are saying that black women are easier to compete with than whites women? I don't think so","commenter_a":"She couldn't compete with other white women so she became a light skinned black woman. Using our own weakness against us.","post_message":"The cringe factor here is off the charts..."}]
