[{"comment_id":"10154404189538984","commenter_b":"What awful things to say to a women! No brain.","commenter_a":"Hillary has no soul or conscience, shes just a pathetic excuse for a woman.","post_message":"This hero who survived the Benghazi massacre just laid into Hillary Clinton and told her exactly why she is such a horrible person. We all know Hillary's wretched, but what this hero just said to her takes it to a new level. And he's exactly right."},{"comment_id":"10153756780250695","commenter_b":"Respect everybody-easy on the sir crap","commenter_a":"the police and are like any other person they put there pants on and go to work ........they chose the job we didnt force it on them.i see no reason to buy there meals and say sir and ma'am to them.i work hard for what i have and i get nothing free so why should police get anything free.they have to come if you call them anyway........................!","post_message":"\"Put their charities on your giving list. If your local law enforcement has volunteer-citizen job opportunities, sign up.” Do you agree with his idea?"},{"comment_id":"932499113450014","commenter_b":"That chick in your photo is dating a dick btw.","commenter_a":"Fuck him for treating that person like that. Scumbag.","post_message":"Fuck this guy."},{"comment_id":"10153255952000950","commenter_b":"Isis days are numbered. They are not long for this world. Believe it or not theres more important fish to fry","commenter_a":"I think he's so creative!! Instead of CNN just cashing in on the money for no good reason - let's do something for those that have done so much for this country! You guys who think this is Mr Trump being cocky or greedy just don't get it...","post_message":"Donald J. Trump is demanding that CNN — the host of the next GOP debate — pay him $5 million dollars to participate, with the proceeds to be donated to veterans."},{"comment_id":"524602671063646","commenter_b":"this is america fuck islam","commenter_a":"Go Texas","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy. Let them be angry. This America and if you don't like it, get out. Do you agree that Muslims should assimilate or leave?"},{"comment_id":"1060332480688422","commenter_b":"Hillary foreign policy. Iran bad deal. Libya diaster, benghanzi four died on her watched as they pled for help and she wants more illegals and migrants to come in take over country putting our safey and jobs at risk. Voted for Iraq war, a war buillt on lies! Say No to Hillary!!!","commenter_a":"Whether Bernie likes it or not he has no say so over what this country's direction is.","post_message":"Our message in this campaign is of creating a nation and a vision based on social justice economic justice, racial justice, and environmental justice – and whether Donald Trump likes it or not, whether Hillary Clinton likes it or not, that is the future vision of this country."},{"comment_id":"10153993909761491","commenter_b":"A women should be happy she has big tits-men will ne ef stop looking at her","commenter_a":"I got chastised by a femminest about 3 months ago for saying that it was a crime against man","post_message":"\"I chose surgery because of how I felt, not because of what anyone else thought.\""}]
