[{"comment_id":"1115743115130630","commenter_b":"No Jay Reed, it doesn't offend me because, undocumented immigrants pay taxes, create business, and help the country's economy. Undocumented immigrants don't obtain unexpected or desabilty benefit even when they pay to the programs.","commenter_a":"California has no place for this disgusting xenophobic individual. Dump Donald Trump where he belongs. .the trash Dump.","post_message":"Protesters smashed a police cruiser and at least one fight broke out after Donald J. Trump's rally in Southern California Thursday night."},{"comment_id":"685062714983869","commenter_b":"So...when will they let Ted Nugent or Trey Gowdy be a moderator?","commenter_a":"Why Matt Lyer? What a CREEP!","post_message":"CLINTON, TRUMP SQUARE OFF"},{"comment_id":"10153471218374270","commenter_b":"What ever happened to OPSEC!","commenter_a":"What does that do? Piss them off?","post_message":"Big deal."},{"comment_id":"10153417298067434","commenter_b":"Yeah everyone needs this guy in the women's bathroom","commenter_a":"This is how we protect our women... not guarding bathrooms for trans \"predators\".","post_message":"\"I was going on about something and saw Monica staring behind and making a funny face. I stopped. 'What’s going on?' After a few second she said 'That guy just put something in her drink.'”"},{"comment_id":"1802884339926690","commenter_b":"evil woman","commenter_a":"You're right, Donald. She doesn't give up. She's been fighting to keep people like you from preying on others - all her life! You aren't even qualified to clean toilets.","post_message":"\"You interrupt me all the time. Why don't you interrupt her?\" All the times tonight's #debate moderators and Donald J. Trump talked over each other. @webpagelink"},{"comment_id":"999172976798392","commenter_b":"Corruption in the state department is at an all-time high.","commenter_a":"Where does obeying law fall in this action? Do you collectively feel above the law and justified in defying it? Perhaps a bit of prison time and being branded as felons for the rest of your miserable entitled life will bring you back to your senses.","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"10157662056330405","commenter_b":"Kasich is a sore loser..used to like him but after he lost the race for president he has gotten to be a sour sore loser..","commenter_a":"Good job, Governor! Wish there were more like you that agree to support what the PEOPLE want! My governor, Kasich, wrote in 80 year old John McCain for a president, wth! He's a disgrace!!!","post_message":"Great to rally a huge crowd in Eau Claire for Donald Trump, Mike Pence, Ron Johnson, and the entire Republican ticket."}]
