[{"comment_id":"10154102342209607","commenter_b":"Melania trump was a model","commenter_a":"And my question is why do we care? We elected a man with no political experience and our soon to be First Lady have nude pics floating around on the internet....I mean at this point does it matter if his family moves in? Everything about this is...unconventional lol.","post_message":"QUESTION OF THE DAY Do you think Melania and Barron Trump should move into the White House in January? Tell us your thoughts and they may appear live on Fox45 Morning News."},{"comment_id":"367420056779622","commenter_b":"she should be in jail","commenter_a":"This is not right","post_message":"THIS is where tax money go..."},{"comment_id":"10154288935233984","commenter_b":"What a bitch!","commenter_a":"You will know for sure when we run out water","post_message":"Dem Sen. Barbara Boxer just laid into this Catholic priest for appearing to question Pope Francis's warning on the dangers of global warming. Do you think global warming is a hoax?"},{"comment_id":"1793145997633986","commenter_b":"I believe Joy was referring to the women who willingly screwed a married man. That would absolutely make you a nasty tramp.","commenter_a":"That kind of shaming is the reason why many rape victims don't report there rape to the authorities. Joy needs to zip it and have respect for these girls!","post_message":"Paula Jones responded to Joy Behar’s claim that she was a \"tramp,\" and she took Bill Clinton down at the same time..."},{"comment_id":"10153310344686157","commenter_b":"If she gets droped off by the bus shes to young for you bruh","commenter_a":"If her shoes light up when she walks she is too young for you bro.","post_message":"Investigators believe 23-year-old Estevan Garcia sent naked Instagram photos to a 14-year-old girl. He worked for the Donna school district as a security guard."},{"comment_id":"10154013196294411","commenter_b":"Oh with hijab!absolutely she cover herself from you rapist pornographers.","commenter_a":"Americans should be blessed with islam for taking them to the right path","post_message":"They have always seen Iraq as a threat because it has the great potential to be a great regional independent power in its own right. (Op-Edge by Dan Glazebrook)"},{"comment_id":"633419350152037","commenter_b":"Bye, don't come back","commenter_a":"His gravy train parliamentary salary wasn't enough he must have found another income that was better for less hours","post_message":"What's next for David Cameron?"}]
