[{"comment_id":"1181986708533713","commenter_b":"if they don't like it they should leave America. Sure mexico, africa, iran or even canada would take them.","commenter_a":"Exactly! Behavior like this is a major part of why Hillary and her supporters just lost the election! Protesting is good, but not when you're whining about a person who won an election fair and square just because you disagree with them.","post_message":"\"This is not helping.\" One Hillary Clinton supporter in Chicago said he was unhappy with how some of the the anti-Donald J. Trump protests were being carried out @webpagelink"},{"comment_id":"1177291819033735","commenter_b":"Boy that was a huge crowd! 😂","commenter_a":"Good for you, kid!","post_message":"WATCH: A kid yells \"you suck\" at Ted Cruz. More here: @webpagelink"},{"comment_id":"10153677754598037","commenter_b":"All these females asking for equality. \"Wait, we don't want that equality.\" Sleep in the bed you make.","commenter_a":"Why are you women saying no? Cry for equal rights then don't want the same responsibilities as men.","post_message":"Do you support requiring women to register for the draft? If passed, 459,000 women in Texas would be eligible."},{"comment_id":"10153315723671336","commenter_b":"God's hands sand feet here on earth. Do it for the least of these","commenter_a":"This is an American.","post_message":"Since Christmas, 28-year-old Nic Martinez has traveled along the East Coast in a 25-foot trailer re-fitted as a barbershop. Along the way, he stops and cuts hair for veterans and the homeless. #ProudAmerican"},{"comment_id":"1225420670803521","commenter_b":"KICK THEM OUT","commenter_a":"Whatever happened to the US Military Academy's Code of Honor? If it's still in effect, those who raised a fist should be court-martialed.","post_message":"Concerns arose that the pose violated Pentagon rules on avoiding political activity by paying tribute to the civil rights-era Black Panthers group or to the present-day Black Lives Matter protests."},{"comment_id":"10153503664933132","commenter_b":"Kourtney hasn't helped things along with Scott. If she thinks enough of him to be with him unless he's a horrible snored and she can't get any sleep her place is in bed with her husband! I love kourtney the most but I think shes too controlling. Scott is using his parents death as an excuse for anything he does wrong and that's not right either. But in my opinion Scott is gorgeous!","commenter_a":"They do make cute kids","post_message":"Cute alert!"},{"comment_id":"1191296707568558","commenter_b":"Shawnee has some pretty crazy, unnecessary rules. Girls can't dye their hair to any color that is \"unnatural.\" They wouldn't of been able to walk either.","commenter_a":"So I wonder how many people could walk that have green or purple or blue hair but facial hair is not OK??","post_message":"Do you agree with the school's no-beard policy?"}]
