[{"comment_id":"10156946907525389","commenter_b":"@username you are just a hater. Stop disrespecting people specially Muslims.","commenter_a":"Love this man!","post_message":"\"Why didn't she say, 'Hey, make better lifestyle choices?' If you want to join something, why don't you join a church, why don't you join the Boy Scouts or the Girl Scouts?\" Milwaukee County Sheriff David A. Clarke Jr criticized Hillary Clinton's comment on joining \"positive gangs.\" @webpagelink"},{"comment_id":"10153812038063984","commenter_b":"We need to demand that our governor 's refuse to accept them in our states !!","commenter_a":"Totally against it.","post_message":"Wow. This definitely makes Obama's plan to accept refugees from war-torn Syria \"nothing short of crazy\" - as Ted Cruz would put it. America could be the next country to face this... Are you against allowing Syrian refugees into the U.S.?"},{"comment_id":"10153486383431037","commenter_b":"So how many cops takes to capture one guy?","commenter_a":"Tantiana Valentina","post_message":"MORE DETAILS: Second escaped prisoner shot by police, in custody and taken to hospital"},{"comment_id":"10153197324656491","commenter_b":"@username if you don't have weapons, then vermin thugs might get your food and water.","commenter_a":"I wonder if this is how walking dead started","post_message":"The researchers plan to “revive” the virus in a safe laboratory setting."},{"comment_id":"932169176839778","commenter_b":"And, they won't ever listen to us when they have all these illegals voting for them! I hope the Democratice citizens are taking note of all that is going on in our country!","commenter_a":"Americans had better listen to Anne Coulter. She is right and she is warning Americans what I have also been saying. We are losing America to illegal immigrants because of obama.","post_message":"A new Pew Poll found that only 24% of Americans want to increase immigration to the U.S."},{"comment_id":"774141519351123","commenter_b":"I hate when people treat service workers less than human just because they are having a bad day. I have been there as a server. Some people are evil!","commenter_a":"Entitlement, is why ppl act the way they do. But as a Manager sometimes you have to take what the customers throw at you, they are not always right but you make them Think they are! Its all in a days work, manager or not, right or wrong, you look like an ass when you throw a fit like this.","post_message":"Wow."},{"comment_id":"568744853313807","commenter_b":"Take her welfare away from her and force her 2 get a job!","commenter_a":"Their parents must be total Pieces of shlt","post_message":"Did this idiot DESERVE this?"}]
