[{"comment_id":"10152942027790399","commenter_b":"There is a word for women like her, but that would be an insult to hard working girls.","commenter_a":"That certainly says everything about her credibility, or lack thereof. :( AKA (I'll say anything for a buck)","post_message":"Megyn Kelly on msnbc: \"I’d have done O.K. there, too.”"},{"comment_id":"10154349136059203","commenter_b":"Then you would be sexually assaulting a sexual assaulter","commenter_a":"If I ever saw this piece of shit in the street, I'd kick him in the nuts. He's a disgusting animal","post_message":"As if this could get any sicker."},{"comment_id":"1146391592075725","commenter_b":"ANOTHER RACIST TO PODIUM","commenter_a":"Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry","post_message":"LIVE: Presidential Nominee Donald J. Trump is in Warren to speak to supporters just 8 days before election day. More info: bit.ly/TrumpvisitsMCC"},{"comment_id":"1219604621413341","commenter_b":"A very large dick","commenter_a":"I was born and raised on Ohio and this man embarrasses me","post_message":"Here's a clue: She's not a 62-year-old man, but that's not all. It gets worse. Much, much worse."},{"comment_id":"1107053186021095","commenter_b":"Woman enjoy sex more than man but how ? I cant beleive that","commenter_a":"Actually women enjoy sex even more than men, so leave them alone. Nature has to reward them more since they have to invest more in the fruits of the sexual act both during pregnancy and after birth.","post_message":"She started the affair when her teenage nephew came to live with her in 2008"},{"comment_id":"1727453857514316","commenter_b":"@username,just like your husbands grandparents came in the 30s,my grandparents also came here but in1907 and came threw Eli's Island LEGALLY which was harder to do in 1907 ..so there is no excuse for some coming here illegally today,none what so ever!!","commenter_a":"Trump wants illegals gone and so do I. My dad came to this country legally and at age 65 is still going strong. My brothers are so fortunate and blessed that my parents have given us this opportunity to make something out of ourselves. Seeing illegals demand stuff and act like they deserve things we Americans worked hard for burns me up inside. Illegals have no rights to anything and should be deported and forced to go through legal channels to attain citizenship like other immigrants. We need a wall or a stronger more secure border and absolutely no amnesty for these criminals","post_message":"\"Donald Trump is not a racist.\" Today, in front of Trump Tower, Donald J. Trump supporter Pastor Mark Burns fought back after an illegal immigrant activist tried to shout him down."},{"comment_id":"585422771627079","commenter_b":"I disagree. Trump will defeat the Liar Hillary.","commenter_a":"WELL IF 65-70% DON'T WANT TRUMP AND HIS POLL NUMBERS ARE MUCH HIGHER THEN TED'S... THEN I WOULD THINK 90-95% DON'T WANT TED AND EVEN LESS WANT RUBIO...","post_message":"\"If Donald is our nominee, in all likelihood, Hillary wins, we lose the Supreme Court for a generation, the Bill of Rights is lost, we're buried in debt, and jihadists rise across the globe,\" Ted Cruz said. Do you agree?"}]
