[{"comment_id":"1344780435541174","commenter_b":"Yes For Hillary!!!!!!","commenter_a":"Vote Hillary","post_message":"Watch: Hallie Jackson gives a special preview of what's to come on #ElectionDay from NBC News HQ in New York! Full coverage all day: @webpagelink"},{"comment_id":"10152814946648822","commenter_b":"Should have been three to six YEARS ! This woman is NUTS !","commenter_a":"I love the people on here, who claim to be about humane treatment of animals; but, they want this woman to get beat to death, while in jail. Hypocrites.","post_message":"The woman accused of stealing and euthanizing her neighbor's dog is headed to jail. Today she was sentenced to 3-6 months for killing the husky named \"Thor.\""},{"comment_id":"921294477938692","commenter_b":"Damn that bitch is fugly.","commenter_a":"Rothschild , Soros, Bush, Hillary, Bill, Hubbard, Gore, Planned Parenthood all are illuminati members. Sold their Soul to Satan","post_message":"“We don’t know all of the details about this particular incident, but we do know that our national epidemic of gun violence must be addressed,” Debbie Wasserman Schultz said Saturday after 3 people were killed at a Planned Parenthood in Colorado."},{"comment_id":"10152775428266051","commenter_b":"Tell the Moms to buy it themselves.","commenter_a":"How low can you get.","post_message":"These moms decided to e-mail their daughters’ class and ask for everyone to pitch in for their birthday gifts. Here’s how one mom responded to that."},{"comment_id":"10153247625591179","commenter_b":"vi sim. mas fiquei sabendo que legal mesmo é um creeper de pelúcia.","commenter_a":"Fernanda","post_message":"Same."},{"comment_id":"1088448164564744","commenter_b":"MOB VIOLENCE - MUSHY FRAUDULENT L A C K OF LEADERSHIP. VOTE THEM OUT OUT OUT !!!!!!","commenter_a":"Is this what we call, \"Today's Leaders?\"","post_message":"This guy is nuts!"},{"comment_id":"10154917656616509","commenter_b":"People, here the moronic trump plan : deport Americans from America! Ban Americans immigration from state to state. Unless you're a Caucasian with 'orange paint' on your face, then you must wear a badge to show who you are! That's the moronic trump have plans for America!","commenter_a":"So many people dead and Obama plays politics and slams Trump, Whats Obamas plan to stop this, He dont have one, Trump has one","post_message":"President Barack Obama on use of the term \"radical Islam\": \"What exactly would using this label accomplish?\" @webpagelink"}]
