[{"comment_id":"1169723563063063","commenter_b":"SHES ONE HELL OF ALOT BETTER THAN THE TRANNY AMERICA HAS PARADING AROUND AS A WOMAN NOW! THE TRANNYS NAME IS MICHAEL! ODUMBASS LOVES HIS GAYS! DAMN THAT IS ONE BUTT UGLY GORILLA FAVED TRANNY! MELANIA HAS MORE CLASS IN HER CRAP THAN THE TRANNY HAS IN HIS WHOLE BODY! P.S. TUCK THAT SCHLONG TRANNY!","commenter_a":"Agree","post_message":"I agree!"},{"comment_id":"10153696558342629","commenter_b":"SO MANY fucking people are up in arms for this person. Unless her mental illness was so severe, that she couldn't have had the slightest idea that driving into a crowd of people was a BAD thing to do, then I don't think her being an angry, evil nut job is enough to let this thing off the hook.","commenter_a":"Is anyone surprised that Adacia Chambers already has a days-old Facebook support group? Yeah, me either.","post_message":"“The evidence suggests this was an intentional act, not an accident.”"},{"comment_id":"944373212266686","commenter_b":"Planned Parenthoods primary function is abortion. Enough said. Defund it.","commenter_a":"Only 3% of Planned Parenthood's funding goes to providing abortion. None of that money comes from taxpayers. Defunding Planned Parenthood means defunding millions of dollars in preventive care, cancer screening, contraception (which reduces abortion), STI screening, and other such essential services. I'm pro-choice, but if you guys have such a problem with abortion, why don't you just campaign to force Planned Parenthood to stop providing abortion services and leave everything else intact?","post_message":"Wow."},{"comment_id":"10152683402245667","commenter_b":"She must like getting stuff for free.","commenter_a":"He's republican. Enuff said. Lost my vote.","post_message":"Marco Rubio has \"something\" important to say."},{"comment_id":"1383945224964701","commenter_b":"Go away lady","commenter_a":"She definitely needs a half dozen chill pills....","post_message":"Sen. Elizabeth Warren has taken to Twitter to attack what she calls presumptive Republican presidential nominee Donald Trump's toxic stew of hatred insecurity."},{"comment_id":"10154354422615950","commenter_b":"$400,000 a day for Melania to stay in NYC.","commenter_a":"Two weekends in a row out of three weeks in office we've flown him to Florida. Where is the Republican outrage?","post_message":"On Saturday, President Donald J. Trump is hosting Japanese Prime Minister Shinzo Abe at his resort in West Palm Beach."},{"comment_id":"1170311373061915","commenter_b":"Bitch, YOU'VE been punked and you're too stupid to grasp that fact!!!","commenter_a":"Will has a right to do what he wants to do.!!!!!!!!!! Who the f- -k does Trump think he is?!!!!!!!!!!!! It's time he kept his trap shut.!!!!!","post_message":"Brilliantly played, George Will!"}]
