[{"comment_id":"10153195924381130","commenter_b":"I agree.......who the hell cares!! Dumb ass bitch!","commenter_a":"@username @username ...at that point, who the hell cares aye? Lol","post_message":"Do you even wanna know?"},{"comment_id":"1029601670427380","commenter_b":"Waiting for Drumpf to deport his first and third wife. Apparently jobs aren't the only thing he likes to outsource.","commenter_a":"Kurt Schultz think you may enjoy. Just saying. Miss you, partner","post_message":"Trevor unpacks Donald Trump's response to the mass shooting in Orlando. @webpagelink"},{"comment_id":"10153873967388797","commenter_b":"Women want equal treatment. Then cry they don't get special treatment...","commenter_a":"The Man Should be on the Right.","post_message":"WHAT'S WRONG WITH THIS PHOTO? A picture of a couple walking down the sidewalk has sparked a heated debate on social media. What do you think? Here's why people are talking:"},{"comment_id":"887899764578453","commenter_b":"Any woman dumb enough to marry a cop shouldn't be surprised when he starts beating on you. How do you think cops unwind after work? The single ones get a dog to kick around","commenter_a":"Smh! When will it end?","post_message":"With all these red flags, police still didn't step in and protect her. Is it because the abusive husband was a fellow cop, so they just let him do what he wanted to her? Wow!"},{"comment_id":"1221931671171728","commenter_b":"Whst dumb lady","commenter_a":"No that really is your heart. If she can feel remorse for people shot by cops but not cops shot by people she's just a horrible person. Own it and don't try to dance around it by saying you feel guilty when you don't, I'd respect that more.","post_message":"“I am dealing with a bit of guilt because I don’t feel sad for the officers that lost their lives and I know that’s not really my heart,” James said in the video."},{"comment_id":"1265274246854453","commenter_b":"Checks and balances in government is what our forefathers had in mind when creating this country -- to offset those may use position to do heinous things. Banning an entire religion isn't the answer - and yes, it IS banning a religion if you say Christians from these countries can come, just not Muslims.","commenter_a":"But how come , you know , if one who comes over , has bad intentions or not ? This kind of mindset is not too much different , from the mind set of nazis","post_message":"President Donald J. Trump tweeted a message about the federal judge who halted his travel ban."},{"comment_id":"10152842669910779","commenter_b":"Feminazi alert","commenter_a":"Why aren't you showing her as an athlete, instead of an object? Such utter bullshit.","post_message":"She’s “a beast.” The “most dominant athlete alive.” The “greatest athlete” UFC president Dana White has ever worked with. But what’s her life really like? And how did she go from living in her car to being MMA’s unstoppable force? Erik Hedegaard tangles with Ronda Rousey. Click through to read the full feature."}]
