[{"comment_id":"10153586503151336","commenter_b":"Lmao @username is a pussy cuz a girl made it","commenter_a":"@username @username Cody Wilkerson","post_message":"Two women have made military history by becoming the first female soldiers to complete the U.S. Army's grueling Ranger Course."},{"comment_id":"10153342666393132","commenter_b":"She still is basic!","commenter_a":"He just swerrrved on her! Ayeeee! She needs to remember her roots and remember she was once 'basic'.","post_message":"\"Madonna, you have achieved unbelievable success and while we appreciate your talent and achievement, we expect you to appreciate ours.\""},{"comment_id":"10153448155621045","commenter_b":"Sure","commenter_a":"Elizabeth Kidd can we please please please go see this in 3D when it comes out ? Without the kids the first time lol","post_message":"Cannot wait! \"Keep on swimming.\""},{"comment_id":"10153067301701101","commenter_b":"duh","commenter_a":"I would argue that the rates of children who smoked marijuana, in the states that legalized marijuana, probably were the same. I bet little to nothing has changed.","post_message":"\"9.4 percent of children have used marijuana in states that have legalized medical marijuana, whereas the average in non-medical marijuana states is at 6.7 percent.”"},{"comment_id":"534767963372316","commenter_b":"HILLARY WILL TAKE OUR COUNRTY TO THE GROUND,ALL SHE CARE ABOUT IS POWOR","commenter_a":"In 1997, Donald Trump, who showed his personal courage by dodging the draft in 1960, had the gall to compare his heroism by sleeping with multiple women to the heroism shown by the brave men and women who served the United States in Vietnam. Interviewed by Howard Stern in 1997, Trump had the audacity to make the incredible claim that by risking his schlong to venereal disease from his sexual peccadilloes, his courage matched those who gave their lives facing mortar fire and bullets across the sea. Speaking of his sexual exploits, Trump bragged, been so lucky in terms of that whole world. It is a dangerous world out there. It scary, like Vietnam. Sort of like the Vietnam-era. It is my personal Vietnam. I feel like a great and very brave soldier.","post_message":"Crooked Hillary Clinton has lied from the beginning regarding her emails, and server. President Obama recently defended Crooked Hillary - saying she did not endanger national security. He also said ISIS was contained last year! Crooked Hillary will NEVER make America great again!"},{"comment_id":"1119467821481588","commenter_b":"Yay!!!","commenter_a":"Exactly his point!","post_message":"San Francisco 49ers quarterback Colin Kaepernick says he has received death threats for making his views known"},{"comment_id":"1006897696063097","commenter_b":"Praying for a awesome woman of God and Crouch family.....such seeds she has sown...","commenter_a":"Pamela Houston","post_message":"The TBN family continues to ask for prayers and promises to keep us updated on Jan's condition. #JanCrouch #TBN #stroke"}]
