[{"comment_id":"10153315514576336","commenter_b":"That turbofan jet engine intake is sturdy enough to handle the weight of that woman. Also, her derrière is not going to effect the shape of the intake. It is designed to handle air pressure from 250 knot IAS relative wind that at altitude could be as high as 550 knots TAS. So, what's the big deal? I think the picture looks COOL!!!","commenter_a":"I do not think so. The preconditions are whether the company has the clear policy for it, whether she got enough training of behavior in the company?","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10154153036124369","commenter_b":"She confuses common core with curriculum. Anyone against common core is against preparing kids for the job market. The curriculum used implementing common core was written by the text book companies and approved by local school boards. It's OK to be angry at that but Kasich has nothing to do with curriculum so hopefully now you can vote for him again.","commenter_a":"Wake up Ohio.. vote Trump. You need to understand everything Kasich stands for.","post_message":"Authorities in North Carolina say they are looking at Donald Trump's behavior as they continue their probe of a violent altercation at one of his rallies last week."},{"comment_id":"10155678849387004","commenter_b":"GET SOROS- GET SOROS!~ FREE AMERICA!","commenter_a":"This shows you how STUPID people at Berkeley are...","post_message":"In the 1960s, leftists at UC Berkeley fought for their free speech. Now they use violence and mayhem to trample on the rights of others..."},{"comment_id":"672451282894291","commenter_b":"@username The trump wall is ! I want mexico to build it ! If you arent part of the solution you are the problem .","commenter_a":"When a unstopable force meets a unimpregranable wall It is time to vote for Trump ! Hope I spelled that right libs and spell check police !","post_message":"Donald J. Trump said he didn't call Ted Cruz 'Lyin' Ted' in his New York victory speech because \"I thought it would be very undignified for me to get up at that particular moment with ... pretty much the world watching.\""},{"comment_id":"939244866171766","commenter_b":"The woman who jumped the young lady works as a loan officer for Bank of America. I guess she still has a job . Tyler thanks , it appears that in many of the comments throughout this post only one race was involved in \" trespassing\".","commenter_a":"Pool passes!!!!! I saw another comment somewhere else from an actual member at the pool. This was a members (HOA) only pool where there WAS several BLACK members and was present at the time. There was a private pool party going on where the DJ that was hired sent out a tweet about was he was doing. The pool was swarmed by kids from another neighborhood with no pass and uninvited. Which is technically \"trespassing\". They was asked to leave and started a fight in which the cops was called. The police had made several requests to leave with no luck. This girl ( if you watch the full video) was asked to leave several times and told the officer \" F-YOU\" and that's when the officer grabbed her. First off she and the rest was trespassing and second refused to leave when asked. @webpagelink","post_message":"A young woman who attended the McKinney pool party gives her explanation for \"how it all began.\" Watch the full interview here: @webpagelink"},{"comment_id":"1033161420090232","commenter_b":"Hispanics are illegals? Since when? Your profile photo just proves you're racist.","commenter_a":"Pardon me...illegals don't vote so does it matter","post_message":"A presidential candidate must win at least 40% of the Hispanic vote to win an election in modern America. Here's why that's very bad news for Donald Trump."},{"comment_id":"10153575814345950","commenter_b":"Fuck trump POS!","commenter_a":"Thry are all illegal wall jumpers. Come back to the US after u grow up","post_message":"\"No hate in our state,\" demonstrators chanted early in the day, with a few carrying Mexican flags in protest of Trump's anti-immigrant policies."}]
