[{"comment_id":"10155070444570603","commenter_b":"This disease is curable with treatment. If she puts it off she will die. Just as an abortion her parents still have the right to choose life for their child.","commenter_a":"This is crazy!","post_message":"UPDATE: Cassandra was diagnosed with Hodgkin Lymphoma in September. For three weeks she was getting chemotherapy, but then changed her mind and decided she didn't want it."},{"comment_id":"10153257437420950","commenter_b":"Just hang the filthy basterds","commenter_a":"But then again they are innocent unarmed harmless individuals with bright futures ahead and their victim is the evil one","post_message":"Two 20-year-old men allegedly stole a cellphone from a man with cerebral palsy, beat him, recorded the assault on his phone and posted it to his Facebook page, police said."},{"comment_id":"10150721680719999","commenter_b":"That's not true @username. There care is every bit as good as ours and not nearly as expensive.","commenter_a":"We need a single payer system. My daughter lives in France, and I'm always impressed with their healthcare. Stress free.","post_message":"Here is the surest way to enjoy the peace of mind that comes with having health insurance: Don’t get sick."},{"comment_id":"783835985050207","commenter_b":"Ginny don't forget under obummer gas was over $5 a gallon. Our healthcare got destroyed. Illegals flooded our country sanctuary cities like where Kate from the unpassed Kate's law was MURDERED by a loser criminal ILLEGAL career criminal thug. I could go on but I've found that the foolish people out there that haven't woken up yet never will.","commenter_a":"I love how about Obama and Hillary want to save the world but not America","post_message":"Obama plans on bringing in 10,000 Syrian refugees, but Hillary Clinton wants to increase that to 65,000. What do you think?"},{"comment_id":"10156127047875354","commenter_b":"U devil put this demon in the men's jail she get all the wood she wants . Why u crying bitch u r a girl now u need man.","commenter_a":"He/she needs therapy!","post_message":"Oh MAN!"},{"comment_id":"10153963839661782","commenter_b":"Why is it ok for the woman to hit him ?","commenter_a":"Not ok you POS","post_message":"BREAKING: A video that shows Oklahoma running back Joe Mixon punching a woman two years ago has been released. We want to stress that this video might be disturbing. We are showing it to you in an effort to be transparent. Click on the link to watch the video now: @webpagelink"},{"comment_id":"10156946534115093","commenter_b":"Hillary will trounce Trump because 70% of voters dislike Trump. That's the math.","commenter_a":"Ya use your own mind governor vote trump don't be an establishment governor. Trump is who the people want.","post_message":"Governor Mike Pence should exhibit the leadership that conservatives have come to expect from him."}]
