[{"comment_id":"10153486509166320","commenter_b":"Stupid woman. Don't vote for her just because she is a woman. You voted for a color. Remember...","commenter_a":"And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course ‘lest we forget’ what has happened to many “friends” of the Clintons. 1- James McDougal – Clinton’s convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr’s investigation. 2 – Mary Mahoney – A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown.. The murder happened just after she was to go public w:th her story of sexual harassment in the White House. 3 – Vince Foster – Former White House councilor, and colleague of Hillary Clinton at Little Rock’s Rose Law firm. Died of a gunshot wound to the head, ruled a suicide. 4 – Ron Brown – Secretary of Commerce and former DNC Chairman. Reported to have died by impact ...","post_message":"Hillary Clinton held her first major rally of her 2016 presidential campaign on Roosevelt Island today. She called for a new era of shared prosperity in America and told supporters that workers can trust her to fight for them."},{"comment_id":"1418008091611056","commenter_b":"I bet you a thousand dollars her girls didnt eat that crap they served. Im also sure she herself never ate that crap. She had a full service crew of chef's preparing her gourmet foods 24/7.","commenter_a":"Lunch program? What lunch program? My daughter will never eat lunch at school so I have to fix it for her everyday. On the few occasions where she had to buy it she says it's terrible and she didn't eat it. They serve stuff like corn dog tots with tater tots total processed garbage that doesn't even taste good. What tF is so hard about giving them a piece of chicken on a wheat roll with a piece of fruit?? It ain't rocket science people.","post_message":"Michelle Obama's legacy is already unraveling..."},{"comment_id":"10153362420896028","commenter_b":"I and many Americans clearly disagree.","commenter_a":"Obama: You are a historic disgrace. No President in US history has ever approached the safety of Americans with the level of smug indifference that you do. You are soft on Muslim terrorists and degrading to Christians and Jews. You golf through American beheadings and yawn away the deaths of Americans at Islamic hands. You have ZERO Moral Authority.And we look forward to reminding you of that until the last second you leave office. Signed, True Americans... :D","post_message":"UPDATE 5:45 p.m. PST: Our livestream has ended. \"I know that after so much war, many Americans are asking whether we are confronted by a cancer that has no immediate cure,\" he said. Read more: @webpagelink WATCH LIVE: President Obama to address nation on San Bernardino mass shooting from the Oval Office @webpagelink"},{"comment_id":"1189693781087315","commenter_b":"so wrong. We need to let Russia have their way with Soros and rid the world of this vermin.","commenter_a":"Soros is behind the refugee flood into Europe. His organizations sent Syrian approx. 19,000 tweets promising them housing and jobs in Europe and telling them how to get around border guards. He also was behind the whole effort led by Hillary to overthrow Middle East governments and replace them with governments of his choice. His influence has cost the deaths of thousands and thousands of people in the Middle East. This is the face of evil.","post_message":"Hacked documents from George Soros’s Open Society Institute state that the billionaire and his foundation helped to successfully convinced the Obama administration into increasing the total number of refugees taken in by the U.S. from 70k to 100k per year."},{"comment_id":"10153779495443854","commenter_b":"WE ALL DEAD","commenter_a":"is this where the inhabitants of the northern hemisphere exterminate themselves","post_message":"Putin Warnes of Global War"},{"comment_id":"788206447982585","commenter_b":"The trump train is heading for the trump wall. toot toot.","commenter_a":"Hurry Hillary call Wall Street call @username call AL Sharpton because your gunna need all the help you can get. The Trump Train is rolling straight for the White House !!!","post_message":"Hillary Clinton and her allies are preparing for the fight against Donald J. Trump."},{"comment_id":"10153382769757411","commenter_b":"I don't know who you've been talking to but it seems to me that America has been supporting the illegal Mexicans for quite a while and we have been paying for it with our tax dollars! So now people are angry because there is no money in our checking accounts because the government is taking it to pay for all the refugees and the illegals that is using our system! We have no country without a border, we have no country if everybody comes in that wants to! without doing it properly! Now is the time to take our country back and get it out of the true terrorist hands, that is in our government and has been for past several years, using the people to their advantage!","commenter_a":"People should protest all of Donald Trump's rallies and stop this man before he gets out of control. America does not need to return to the days of racism and prejudice to be \"great again\". I can't imagine Donald Trump as President of the United States. Everything will be one big reality show for him and he will be the host who gets to fire whoever gets in his way. His supporters are exhibiting the same attitude and acting like they are judge and jury treating protesters as if they should be deemed as Enemy Combatants who do not have rights. Donald Trump has stated that if he becomes President of the United States that he would wage war against Mexico in order to recuperate the cost to build his wall. Racism is his underlying motive. Just like when Hitler waged war against the Jews. His sole ambition to gain ...","post_message":"\"Donald Trump has created a toxic environment. And the toxic environment has allowed his supporters and those who sometimes seek confrontation to come together in violence.\" John Kasich today blasted Donald J. Trump for \"preying on the fears\" of Americans. Both Kasich and Marco Rubio suggested they may not support Trump should he become the GOP nominee. Story: @webpagelink"}]
