[{"comment_id":"10155755235340725","commenter_b":"U mean I have to marry ur ass!? Ugh","commenter_a":"Patti McGough, let's meet at Daley center on tuesday.","post_message":"#BREAKING: Supreme Court rules all gay couples have a constitutional right to marry-----> @webpagelink"},{"comment_id":"1036028619826340","commenter_b":"Keep walking it back Donald, pretty soon the wall will be some bushes and a couple signs","commenter_a":"Dump Trump","post_message":"I have never liked the media term 'mass deportation' - but we must enforce the laws of the land!"},{"comment_id":"912506822117747","commenter_b":"Grow up racist","commenter_a":"Thanks Fox, again you nailed it..","post_message":"Just when you thought #FoxNews couldn't get any crazier... @webpagelink From (Y) Counter Current News - MBD"},{"comment_id":"10153357050192464","commenter_b":"Israel is bankrupting America, rich Jews are destroying democracy & destroying jobs here in America, Jewish love-of-money & Golden Calf worship & other anti-Christian values are totally corrupting America and infecting the world such that Talmudic-believing Jews have put us on the path to the 6th Mass Extinction of Live on earth. And for 35 years we've had Presidents who love love love Israel, to America's detriment. I believe God is punishing America for supporting Israel. It is time we have a Pres who doesn't believe the propaganda, who sees Israel for what it really is, who knows Jews are no longer the poor, hungry victims of discrimination & the Holocaust but are now the oppressors & suppressors & war-mongers, the rich, greedy & self-serving people who don't give a damn about the USofA or the American people but only care about themselves. And we need a POTUS who isn't ...","commenter_a":"Look at the country's that take money We get no TAXES and the PEOPLE get no help","post_message":"SHARE if you agree we need a President who will #StandWithIsrael!"},{"comment_id":"10154668593434062","commenter_b":"Yes, and the NFL approved it and promoted it. If you're going to boycott anything it should be NFL products.","commenter_a":"For those that are clueless or ignorant, she endorses and is promoting the black panther party, which is a racist militaristic organization whose motto is literally \"kill whitey\".","post_message":"Online opinions are intense."},{"comment_id":"10154230428956509","commenter_b":"To protect us from bringing terrorists here. How can you tell if a Muslim is not an extremist?","commenter_a":"I don't think they should have to be Christians, just not Muslim.","post_message":"\"I don't know if you can prove that they're Christian... How are they proving it?\" Donald J. Trump said about Syrian refugees. @webpagelink"},{"comment_id":"1224398304283560","commenter_b":"I'm not here to judge anybody but whoever has the experiences will ultimately become the President. It's a done deal and nobody can deprive a woman of what she is duely qualified for . Our next president of United iiiStates of America is president @username.","commenter_a":"Kitty cat ? Lolololol So Republicans want a pig who assaults women as the next president of the mighty US of A","post_message":"This is horrific. We cannot allow this man to become president."}]
