[{"comment_id":"473513952773114","commenter_b":"She lied about her heritage stealing the opportunity from someone truly deserving and you thought she was principled. Lieing Hillary, Crooked Hiawatha!","commenter_a":"All it sealed was the fact that the vote I thought I'd be casting for Elizabeth Warren in 2020 will have to be cast elsewhere. Then Candidate Obama nailed it in 2008 when he said Hillary Clinton will change nothing, but say anything. A few pressers with Elizabeth Warren won't convince me that Hillary Clinton has suddenly become more progressive. It will just let me know that Elizabeth Warren isn't as principled as I had hoped and thought.","post_message":"Locked hand-in-hand in Ohio, Hillary Clinton and Elizabeth Warren sealed a powerful alliance Monday that could help unify the Democratic Party and give Donald J. Trump nightmares."},{"comment_id":"983924208336363","commenter_b":"America matters. They have been told we are the land of the free.some people here know what free is.if our government would stop the hand outs then and only then we wouldn't have to support them or anybody else...take care of our own first.","commenter_a":"This is the UN top priority to control these flood of people leaving their own country for a better life/safety of their family, and if they make it all the way....The human smuggling organizations like this type of situation and it brings a large revenue to their business all over the globe... We only can hope and pray that all nations will come together try to come up a solutions to stop the displacement of these people of the terrorist activity and senseless killing of innocent people base of their religion.... Here we are, we spent millions or billions in a exploration way out deep in our universe to study a planet that can sustain a human in the near future?...Yet, we have all of these important issues that needs to be fix, and maybe, we make our planet a better place for everyone.... We only can hope and pray ...","post_message":"RIDICULOUS: Over 700 African Illegals Caught in Panama en Route to the United States The number of Africans who have illegally traveled through Panama on their way to the United Sates has more than doubled so far this year. GREAT WALL OF TRUMP PLEASE! @webpagelink"},{"comment_id":"10152870129557093","commenter_b":"Omg this woman is so racist!!! Just watch! Lol @webpagelink","commenter_a":"He doesn't need to apologize! People need to learn how to act! And how to respect higher Authority. Life would be more peaceful if people just learned to act like decent people","post_message":"Attorney for McKinney Cpl. Casebolt said two suicide calls before pool party put him in \"emotional place\" .... said Casebolt apologizes to those offended by his actions.... @webpagelink"},{"comment_id":"10153513797158701","commenter_b":"Snaggleteeth women put up with more bs. Lol gross though!","commenter_a":"I have great teeth, and I cannot even get a date! I always wonder how snaggletooth women like that get a date.......LOL","post_message":"A Georgia woman is accused of going on a violent, drunken rampage after her boyfriend refused her advances."},{"comment_id":"589804961210083","commenter_b":"If they don't like it then they can suck chuck","commenter_a":"Love my Marines.","post_message":"These Marines make huge stand and show Muslims they're not afraid. Love it. We need to spread this and show these Marines we have their back. Do you support our troops?"},{"comment_id":"1279396932093344","commenter_b":"This is why I hate narcan","commenter_a":"Horrible heroin.","post_message":"\"This child can't speak for himself but we are hopeful his story can convince another user to think twice about injecting this poison while having a child in their custody.\""},{"comment_id":"10154000125138132","commenter_b":"That woman is a nut!!!","commenter_a":"Hope he doesn't take them on a nice \"trip\" to Monaco like Kelly Rutherford's ex did.","post_message":"Gavin Rossdale has a special Christmas trip planned for his kids!"}]
