[{"comment_id":"696169153898296","commenter_b":"@username, a new time of patients unable to afford treatment are being kicked out of hospital , letting them stay in the parking lot. Or putting them in a cab, just stranding them anywhere! Has happened many times.","commenter_a":"I had hoped that they would at least do the right thing and replace before they left millions without coverage....plus I read that it's going to cost a huge amount of $$$ to dismantle the Affordable Care Act....I want to know where this is being fiscally responsible????","post_message":"Awful!"},{"comment_id":"10156266292905294","commenter_b":"He was white u racist b*tch","commenter_a":"Probably some ghetto trash. Where is Obama when blacks rob??? Where is he?","post_message":"The Papa John's Pizza regional manager said a man entered the store with a gun and demanded money. A chase began shortly after:"},{"comment_id":"10154150780421028","commenter_b":"@username, she may be immoral and gross TOO but shes not running for president","commenter_a":"Just wondering if NBC will be firing Miley Cyrus from the Voice? There are some really raunchy offensive videos of her out there. Can't imagine why it's ok for her to put that filth out there recently, but he's being punished for something so old.","post_message":"Billy Bush is leaving the \"Today\" show following outrage over the leaked Donald Trump tape, the show's producer says. @webpagelink"},{"comment_id":"1207859512585616","commenter_b":"Kick her out!!!! Dishonorable discharge!!!!","commenter_a":"She should be discharged, and labeled as an undesirable. Her fellow sailors cannot depend on her to have their back in a time of need.","post_message":"A Navy sailor made national news when she decided to film herself not standing for the flag. Now, she's in trouble... here's the swift justice she received. Do you think she got what she had coming to her?"},{"comment_id":"10153666146819099","commenter_b":"Shut up you dumb broad","commenter_a":"Get guns off the street. It's time for stricter gun laws.","post_message":"A 30-year-old wanted criminal with 12 prior incarcerations allegedly shot a 33-year-old NYPD officer in the head in East Harlem, authorities say ----> @webpagelink"},{"comment_id":"10153653886305950","commenter_b":"Shut up, whore.","commenter_a":"The teen should have complied. And his parents did a terrible job.","post_message":"The aggressive confrontation nearly cost the teenager his life."},{"comment_id":"10152565333134071","commenter_b":"Both of them are idiots !","commenter_a":"Legalize it, is the best way to keep it out of minors and kids.","post_message":"#Pot2Blame?"}]
