[{"comment_id":"10154734487368352","commenter_b":"You got that right,unless she's a fool","commenter_a":"When they get that paper he'll want a black woman","post_message":"Browns quarterback Robert Griffin III pictured walking hand-in-hand with a blonde Estonian athlete as reports he is divorcing his wife of three years emerges"},{"comment_id":"512513402270286","commenter_b":"take her ass outside and hang her","commenter_a":"Everything became a talking point of deflecting responsibility to her experts.","post_message":"Rep. Jim Jordan questioned Hillary Clinton about Benghazi attack: “You tell Americans one thing, but your family an entirely different story” WATCH and SPREAD!"},{"comment_id":"600522876804958","commenter_b":"His girls should have to take the test and eat the same crap that Michelle thinks should be served at our schools. They are no more important than my kids are regardless who they are.","commenter_a":"Go ahead you slime bag daddy you","post_message":"Obama just waved this law for his daughters just because he can. No one is above the law. He is a criminal. Do you agree Obama is not above the law?"},{"comment_id":"1094080987337103","commenter_b":"Death to ALL MUSLIMS!","commenter_a":"It's happening all over... @webpagelink","post_message":"This is CHILLING..."},{"comment_id":"779579485508565","commenter_b":"Mia King you are just making things worse. People of all races kill period! I could waste my time looking for articles of blacks killing whites but I'm not trying to keep the racist shit going.","commenter_a":"The TRIBAL ATTACK is alive and well. Took seven (7) FUCKING NEGRAHS to beat up one (1) homeless white man. Put these porch monkies one-on-one and they run like the cowards they are.","post_message":"Dear liberals and the #BlackLivesMatter movement, police and white people are not the problem. This is the problem...Sickening."},{"comment_id":"10153324267994411","commenter_b":"just for the record most women have long skirts in their wardrobes,","commenter_a":"Good decision, if she wants to live in France then she should follow French rules/laws etc and in this case the dress code, the \"its my culture\" card doesn't work in France. Which is a good thing","post_message":"A 15-year-old French Muslim girl was banned from her class for wearing a long skirt reflecting her religious affiliation."},{"comment_id":"10153632745068812","commenter_b":"Get her a feed bag and shut the pig up!","commenter_a":"Yet big oil is in her pocket","post_message":"\"You don't have to be scientist to take on this urgent challenge that threatens us all. You just have to be willing to act,\" she says: @webpagelink"}]
