[{"comment_id":"10154086609949270","commenter_b":"@username I wouldn't scream foul if a woman was captured simply because she's a woman. Don't ASSume that, thanks darling! They take the risk just like any other man serving. You assume that a lot of women would want to jump in to combat roles over the 'safer' ones. Some might, yes. Not all. Just like having the Ranger tab it does not mean you will be in a Ranger regiment. Women are not afforded all paths in leadership like men are. I never said the standards should be lowered, did I? Nope. I VERY CLEARLY said \"If these women could not pass at the lower standards, then they have no business being part of it. So, they didn't make the cut, and yet you're still pissed off? \". Read it again, and again, and again until you understand what I wrote. Should I spell it out in simpler terms? ...","commenter_a":"There goes the military! Fools! They already lowered the standards for SEALs because of their little 5 year project that ended in 2015! They had to lower the standards and give them \"step boxes\" to complete the courses! What a crock of crap! Even at lowering the standards NO FEMALE PASSED! Certain \"jobs\" in the military should be left to the men! Females will put soldiers lives at risk when they get shot, twist an ankle, break a nail or just have a bad case of PMS! This government is ruining everything!","post_message":"The women are the first female soldiers to be accepted into the Special Forces Assessment and Selection and could report to Fort Bragg as early as October."},{"comment_id":"1326442960748782","commenter_b":"She looks too white and pasty...","commenter_a":"Hope she burns to a crisp","post_message":"Kendall Jenner looks sensational as she soaks up the sun (via Daily Mail Celebrity)"},{"comment_id":"10153731561481336","commenter_b":"You're an idiot Elizabeth!","commenter_a":"The shooter was a conservative republican. That seems to be a common theme in mass shootings.","post_message":"One law enforcement official described the shooter as an \"angry young man who was very filled with hate.\""},{"comment_id":"10156281148690725","commenter_b":"The wife knew what was going on","commenter_a":"The non-profit has rules and he \"didn't follow them\" (I guess) so the family should return it. 100 Club should learn by this mistake and not give out money till the ruling is over...Everyone expect the family to put a \"Go-Fund-Me\" page up soon :/","post_message":"An organization that helps the families of officers during times of need is now asking for the substantial donations made to the loved ones of Lt. Joe Gliniewicz to be returned ----> @webpagelink"},{"comment_id":"515781365279110","commenter_b":"I wouldn't give any fucking nigger s dime fuck them blue gum peace of shit","commenter_a":"No way! It has been so long it did not personally affect them. Get over it, and move on.","post_message":"This state just approved a resolution which will require residents to compensate blacks for slavery. Everybody is looking for a handout. Slavery has been abolished for a long time. Do you think you should be required to compensate blacks for slavery?"},{"comment_id":"10154524451224885","commenter_b":"I will guess her assets will be liquidated to pay the girls back.","commenter_a":"Serial killer.... I called it the day it happened. I hope those little girls in Troy get a pay out from the insurance company for their mothers life insurance now!","post_message":"BREAKING: A prosecutor filed charges of first-degree murder and armed criminal action Tuesday against Pamela Hupp in last week's killing of Louis R. Gumpenberger at her home."},{"comment_id":"1271166009570419","commenter_b":"Get some sleep pretty lady","commenter_a":"The story that will never die.","post_message":"The DNA analysis that prompted a Colorado prosecutor to exonerate the family of 6-year-old beauty queen JonBenet Ramsey in her 1996 murder was not as clear cut as she portrayed it at the time, a newspaper reported on Friday."}]
