[{"comment_id":"575480735957321","commenter_b":"I'd rather listen to a milk cow","commenter_a":"Go 3rd Party!","post_message":"Watch the final night Republican Convention live with NPR and PBS NewsHour. Donald Trump accepts the party’s nomination tonight and makes his case to be the nation’s next president. Scheduled speakers include: Brock Mealer, Marsha Blackburn, Mary Fallin, Lisa Shin, Reince Priebus, Peter Thiel, Tom Barrack, Ivanka Trump and Donald Trump."},{"comment_id":"680629115421379","commenter_b":"She needs to just go away already.","commenter_a":"We can let her become president","post_message":"Hillary Clinton slammed Donald J. Trump's \"I'm with you\" proclamation, writing on Twitter, \"Not included: women, African Americans, LGBT people, Muslims, Latinos, immigrants...\""},{"comment_id":"10154145784326130","commenter_b":"Woman should act like woman? Barf, if a woman does not shave her legs she is still a woman and there is nothing wrong with that.","commenter_a":"This is kinda stupid I'm sorry. And why did she make her legs so goddamn hairy in the comics? I'm sure that's how they look in real life. Glad you found someone who wants to date someone with legs as hairy as his lol","post_message":"Nothing weirder than true love."},{"comment_id":"821190501249706","commenter_b":"just his type, they can have fruit loops together","commenter_a":"Yeh but our leader will meet with a woman eating fruit loops in a bathtub! !! POS","post_message":"The White House is FURIOUS with Boehner for breaking protocol! Looks like somebody doesn't like the taste of their own medicine!"},{"comment_id":"10153914495466491","commenter_b":"How is a white woman being racist unbelievable?","commenter_a":"Unbelievable that people would accuse Ellen being a racist","post_message":"Ellen DeGeneres took to social media to respond to the backlash."},{"comment_id":"623412734499592","commenter_b":"Stupid ass mofo","commenter_a":"The next President","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1174215552594104","commenter_b":"This is one time I hope your wrong,Rush! We don't want Hillary as President!","commenter_a":"You just ruined my day, Rush!","post_message":"Everybody is sending me e-mails about Hillary Clinton. Do any of you really, really think she's not going to be the nominee? Come on, let's get serious! There isn't anybody else that's gonna be the Democrat nominee. All of this doesn't mean anything."}]
