[{"comment_id":"863220680381940","commenter_b":"She looks like a he in drag","commenter_a":"If I have to hear one more time how beautiful and glamorous our First Lady is, I'm gonna take a hostage....not that she couldn't be attractive, but her personality pretty much ruins it.....","post_message":"“Michelle Obama looks like she’s part of the cast of...\""},{"comment_id":"897694810421095","commenter_b":"They don't belong here. We are just a safe place until they can outnumber us and overpower us","commenter_a":"She can leave.","post_message":"This is what happened when she refused for the National Anthem. If you don't respect our country, then you can leave. Do you think she should pack her bags?"},{"comment_id":"10154114920114726","commenter_b":"She is an assault magnet!!","commenter_a":"What do Leonardo DiCaprio Congressman Allen West, the NYPD and Students for liberty all have in common? They all had assault charges filed by Michelle Fields......who is Michelle Fields>? The Woman who is claiming she was assaulted by Mr Trump's Campaign manger. Check her background.","post_message":"Even liberal Susan Sarandon thinks Trump is better than Clinton."},{"comment_id":"10153641029539205","commenter_b":"the hell?","commenter_a":"Wow","post_message":"George Zimmerman Goes After Trayvon's Family"},{"comment_id":"10153328109319087","commenter_b":"@username Let the refugees go fight for themselves.","commenter_a":"When are people going to accept that refugees are not terrorists?","post_message":"President Barack Obama still plans to allow 10,000 Syrian refugees into the country over the next year, despite terrorist attacks in Paris, at top aide said Sunday."},{"comment_id":"1923069711254227","commenter_b":"so far 1.5 million people have liked my last comment PERIOD!!!","commenter_a":"My gawd it's an immigrant disrespecting the flag! Shouldn't O'Reilly and Hannity be all over this? Lqtm","post_message":"Oh, how they would SCREAM! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1807825672796282","commenter_b":"If he gets in please let him build that wall to protect our Canadian women and girls from him and His followers.","commenter_a":"This is what I commented on his \"apology\": You literally said: you grab women by the p----. You kiss them and don't even wait. That sir is sexual assault. You should be apologizing for your behavior not your words. And what about the 13 year old who accused you of rape? Your own wife accused you of rape as well and you shut her up in your divorce settlement. You sir are a disgusting misogynist and will say what you need to to deflect the attention from your personal flaws. You are projecting onto Clinton what you've done yourself. And this isn't about Bill Clinton. This is about who should be the next president, you or Hillary. Your past behavior is proof that you don't care about the women of this country, and Hillary has shown she does. Additionally, President Obama yesterday just signed a bipartisan bill that passed the ...","post_message":"For hours on Friday night, the political world waited for the rarest of expressions from Donald J. Trump — a heartfelt apology. What viewers got was anything but."}]
