[{"comment_id":"451811115023381","commenter_b":"#DonaldTrump2016Bitches","commenter_a":"You should be embarrassed acting like a child picking on the other runners. Why can't you just tell people what you would do as president? Can't believe a potential president would act like a child...I thought you were different...","post_message":"Tomorrow is the most important Tuesday in a long time. Vote for me, & together we can stop Trump & win in November."},{"comment_id":"10153752557287093","commenter_b":"Derrick Perez","commenter_a":"You think she passed?","post_message":"OOPS ~ Police believe she was driving too fast and then hit the gas instead of the brake.... @webpagelink"},{"comment_id":"1061033490639256","commenter_b":"We don't have Sharia law in America, so count your blessings and quit squawking. You're only 4-5 % of the population, so don't blame us if you are outnumbered by the straights.","commenter_a":"dont know who she is dont care","post_message":"“Being a gay American, I know what it means to look at the flag and not have it protect all of your liberties,” said soccer player Megan Rapinoe."},{"comment_id":"10154499233438132","commenter_b":"All men have hoes.","commenter_a":"your universal super power What if I told you that you hold the universal super power of anticipating life-altering encounters with strangers... tapping into your unlimited abundance frequency predicting upcoming challenges and lucrative opportunities... and following through on your BIG goals without any hesitation or uncertainty How? You might be wondering... Because you have access to a secret weapon that most don know about: Numerology. You be amazed at the shockingly accurate and revealing information that can be deciphered from nothing more than your name and date of birth. @webpagelink","post_message":"John F. Kennedy's scandalous handwritten love letters have been revealed."},{"comment_id":"10153341236279170","commenter_b":"This guy needs to stay in London. I do not exactly agree with what Pam Geller did, but she was well within her rights. It's just like when the muslims were building their mosque down the street from the 9/11 Memorial. They were within their rights, even though that definitely was the wrong thing and wrong place to put it. Islam has no tolerance and so America should stop being tolerant to Islam.","commenter_a":"So according to the traitor liberals it is fine to offend Jesus Christ but it is wrong to offend Mohammed , only in the bs traitor mind of the socialists this makes sense.","post_message":"If you're one of the people saying we need to rein in the First Amendment so we don't offend Islamists, just watch this VIDEO and know that THIS is what you're trying to coddle."},{"comment_id":"10153063738641135","commenter_b":"Ladies","commenter_a":"Except, it turns out she is not a very kind person either. Her facebook is private now but before this story broke and it was visible, she had posted many things making fun of those with disabilities. She is also appears to be a 9/11 conspiracy theorist. I wish news outlets would look into this before constantly sharing this story.","post_message":"ICYMI: A Michigan mom bought coffee for two women behind her at a Tim Hortons despite insulting comments made about her looks. STORY: @webpagelink"},{"comment_id":"10153535023142522","commenter_b":"fine, let's see what you got","commenter_a":"@username reckon you can make one of these with those design skills of yours?","post_message":"Grill while you chill:"}]
