[{"comment_id":"1279876618745757","commenter_b":"Why tho. She's the one that slept with em. She's a dirty ass hoe and she got caught. If you were the dude and she wanted to bang you you'd probably do the fuckin same","commenter_a":"All you guys are saying he shouldn't whip his ass if you listen to the video he is calling dude out by his name so he obviously knows him which means he probably knows them I'm not gunna lie call me what you want but I'd whip dudes ass too","post_message":"He had rage behind each blow! #WSHH"},{"comment_id":"1336076649746676","commenter_b":"It doesn't bother me at all","commenter_a":"Why does everyone need a day? Doesn't this kind of thing really inadvertently promote bias by constantly bringing up the differences between us all? We are all human and we all have strengths and weaknesses in different varieties this should be a strength among us not a divisive problem. If everyone would stop talking about it so much things would get much better. Make your decisions about people on an individual basis.","post_message":"Today is International Women's Day and to celebrate, we will be posting a series of images commemorating extraordinary women in the field of science that we believe you should have heard of. #WomenYouShouldHaveHeardOf Image courtesy Jewish Chronicle Archives/Heritage-Images."},{"comment_id":"1808417692765360","commenter_b":"Disgusting.. . I'm sure she's a Trumpette....","commenter_a":"Why do you promote this kind of story NBC???? if you promote peace, all of the robots that follow the trends just may jump on the peace bandwagon. They are here!!! That won't change. What we must remember is they are humans. Each of us will reap what we sow.","post_message":"\"Go back to wherever the f*** you come from, lady.\" Watch a woman go on a racist tirade against two Latina shoppers at a JCPenney in Louisville, Kentucky. Read more about the incident: @webpagelink"},{"comment_id":"10152985971730090","commenter_b":"Hillary wouldn't have stayed with bill if he was not president. She lies about every thing . Her lies got 4 good Americans. Killed in Benghazi now she is running for president again. She don't deserve it.","commenter_a":"She didn't do a good job when Bill was in office, what makes you think she could now?","post_message":"Why don't you want Hillary Clinton to be President? @webpagelink"},{"comment_id":"10153894125869205","commenter_b":"Another whiny bitch.","commenter_a":"Hey dummy it's not that you are reporting about him it is you only complain about him. Where as with Hillary you are sold out to her just like Bernie.","post_message":"After getting $2 billion in free advertising from the corporate-controlled media, Donald Trump is now whining about the fact that they’re being super mean to him (by doing nothing more than reporting on what he says.) The Ring of Fire’s Farron Cousins discusses this."},{"comment_id":"1044675162261267","commenter_b":"Now go build my wall","commenter_a":"*You're *Putting","post_message":"Right!? I sure hope so!"},{"comment_id":"437859166374039","commenter_b":"For all the idiots out there who think its a good idea to burn people's shit FOR STARTERS BURN YOUR SHIT NOT OTHERS WHO WORK HARD FOR WHAT THEY HAVE... STOP TRYING TO SAY ITS FOR FREEDOM FOR THE BLACK RACE YOUR MAKING IT WORSE","commenter_a":"please, this country was founded because people rioted when their tea was being taxed LOL.","post_message":"\"This is not protesting, this is not first amendment rights.\""}]
