[{"comment_id":"10154493541114060","commenter_b":"Karolina Kulewicz yeyeee","commenter_a":"Congrats Daniel your city came second again! No shame in being runners up 😂😂","post_message":"1. Melbourne 2. Vienna 3. Vancouver"},{"comment_id":"10152907368938525","commenter_b":"wth this world really sucks or should i say the women who dump their babies suck....","commenter_a":"I would probably adopt it too if i could. How sad but beautiful","post_message":"He was heading to work when he made an unexpected discovery."},{"comment_id":"10154285829964641","commenter_b":"And all of you need to stop sucking this mans dick. He didn't even play today","commenter_a":"Props to Portugal but why does Ronaldo get to be front and center??...let the guy who scored the winning goal get the glory.","post_message":"Portugal gatecrashes France's UEFA EURO 2016 party... and all without Cristiano Ronaldo."},{"comment_id":"10153578491758984","commenter_b":"Let's ban ass holes","commenter_a":"He's the WORLDS biggest idiot,instigator, racist that ever walked the planet... Al you gotta go!","post_message":"Reverend Al Sharpton just announced his huge plan to destroy Kid Rock's concert tour, and it's absolutely sick. Kid Rock will NOT take this lying down. Sharpton has no idea what kind of war he just started."},{"comment_id":"1157612937618557","commenter_b":"Yes we all should judge illegal immigrants as invaders and depot them! good ppl or not they MUST GO","commenter_a":"Color Blind? All Trump has done in his campaign is judge people by there color and culture.","post_message":"Ivanka Trump on the people her father hires: \"He is color blind and gender neutral.” @webpagelink"},{"comment_id":"1550216494995180","commenter_b":"I think Parkinsons...she looks like hell in that picture. Go home Killary and be a grandma","commenter_a":"I don't get the whole thing of her making appearances looking like a crazy cat lady. She's either sick, gone off the deep end, or trying to pull something. I don't know which, but she really just needs to find something else to do. She can still have a full life, but this is over.","post_message":"“As a Democrat, I am frustrated and ashamed. Unlike Hillary Clinton, I realize that America’s history was built not just on its gallant winners but also on its noble losers.” — Bryan Dean Wright, former CIA ops officer and member of the Democratic Party"},{"comment_id":"689624227852673","commenter_b":"They're not ladies either but you don't have a problem with that.","commenter_a":"I agree with British spelling (and actually use it here in the states) except on two accounts- Aluminium and Ladybirds. That's crazy, they're bugs. Ladybugs. They're not birds. Birds eat them. XD","post_message":"The last weekend of October sees ladybirds swarm public spaces, people's homes and ex-footballers."}]
