[{"comment_id":"10154269953567439","commenter_b":"Wouldn't be Muslim refugees if our leader would fight for them . He wants them to spread out and start a war of Islam","commenter_a":"Those Muslims were Barack Obama's son's","post_message":"This woman is brave to come forward and tell this gruesome story. Only one of the five Muslim migrants were apprehended. The other four \"escaped the country.\" Don't believe it. They are being hidden by the Muslim community much the way the Paris jihadis were."},{"comment_id":"925749584134949","commenter_b":"May they name a FEMA camp after you. What a totally ignorant woman you are! Unbelievable!","commenter_a":"You need some solid intelligence. We had these under Bush , he is the one who stated war and depleted the reserve funds. Obama replenished them. I am happy to have such a high IQ, highly educated president with multiple graduate degrees including a Doctorate in Constitutional Law. He even taught it at Harvard. I have worked on secure govt projects . The govt can show power to those in the Middle East . Fox News? keeps the fear mongering going. It has a 20% accuracy rate. The elites are the Koch brothers & Corporate powers. Get a reality check!","post_message":"In case you missed it, here's the top story from Tuesday: The recent exposure of the nationwide Jade Helm 15 exercise has made many people suspicious, and with good reason. Federal crisis exercises have a strange historical tendency to suddenly coincide with very real crisis events. The elites are clearly preparing for something big. When the elites wage war on America, this is how they will do it: They will control public opinion, control the public, isolate population centers, decapitate leadership, and initiate fourth-generation warfare. Crisis is the best weapon the elites have at their disposal, and exercises like Jade Helm show that they may use it in the near term. The defense that defeats crisis is preparation — preparation not just for yourself, but for others around you. War is coming, and while we can’t know the exact timing, we can assume the worst and do our best to ..."},{"comment_id":"1048569925162760","commenter_b":"Prenup is what he needs he doesnt need ladies he see's to try and take His money.. IMO she isnt all that but hey if he likes/loves her... I dont care how much money she has.. Prenup is always the best way to go if your famous.","commenter_a":"Focus on getting the super bowl ring 1st please! If you get her a ring you better get a prenup.. just saying..","post_message":"Seahawks quarterback Russell Wilson hinted on The Dan Patrick Show that he and Ciara could soon be engaged. When asked which would come first, Super Bowl ring or engagement ring, Wilson responded, “hopefully both.” Check out training camp photos here >>kiro.tv/SeahawksCamp"},{"comment_id":"748263168643341","commenter_b":"Trump is a racist bigot who drives fear into weak people just like Hitler #dumpthetrump anti-muslim isn't a political opinion its bigotry. and his anti-hispanic is talk is racism","commenter_a":"America doesn't thrive off fear we don't feed off hate and we will certainly not have a president that represents all that is wrong in this country. Hillary is who we need in charge #dumpdrumpf #imwithher","post_message":"\"I don’t think there is anything more important than working to provide every child in this country and beyond the chance to do what that child is meant to do, because I think every child has a God-given purpose and a God-given potential. That means every child deserves a good teacher and a good school regardless of the zip code that child lives in. That means every child deserves the health care that will keep that child healthy, will deal with whatever befalls him or her. That means that the child’s parents and grandparents deserve good jobs with rising incomes to provide a good, solid life for their son and daughter, for their grandchild.\" —Hillary"},{"comment_id":"1195653430467095","commenter_b":"This woman is trash","commenter_a":"You suck, big time.","post_message":"***FIRESTORM***"},{"comment_id":"959924910733924","commenter_b":"Nonsense don't believe the Hype. why don't you start a campaign to get rid of us Scots? You will be doing us a favour. For the record were not antiEnglish were antiWestminster","commenter_a":"All paid for by us Nice English people No wonder they voted against independent They would be mugs to leave their gravy train","post_message":"How Scotland got RICHER during austerity thanks to English taxpayers"},{"comment_id":"10155009435559910","commenter_b":"Andre Lopez illegal immigrants can't vote. That's a lie","commenter_a":"lollllll \"won by a large electoral college vote\" he CANNOT let it go that he is the BIGGEST LOSER OF THE POPULAR VOTE EVER.","post_message":"WATCH LIVE: President Trump and Canadian PM Justin Trudeau hold a joint press conference."}]
