[{"comment_id":"666187176847797","commenter_b":"Too much butt kissing being done. The pilot and his white privilege remark, the seat mate's skin color even being mentioned, the flight attendant feeling compelled to apologize...oh, brother! This chick needs to put her big girl panties on and if she's a peace loving/seeking person, she'd drop the whole issue.","commenter_a":"So let all muslims boycott United, I will feel much safer with them not being there. Muslims are lower than whale shit.","post_message":"Look what happens when a flight attendant refuses to give a Muslim woman a Diet Coke..."},{"comment_id":"10156550140360354","commenter_b":"WAKE UP AMERICA !","commenter_a":"Go girl!!","post_message":"What in the...?! And no, it's not a joke. It's a REAL lawsuit. Look at the documents..."},{"comment_id":"10153422173110329","commenter_b":"Weird","commenter_a":"@username read all the way through. This is what you're getting.","post_message":"Mom is gonna freak. An elegant homemade gift is just a few easy steps away."},{"comment_id":"10153876447145329","commenter_b":"Attention whore.","commenter_a":"Laura This might help you understand some stuff","post_message":"Is ~everyone~ on Twitter fighting? (via BuzzFeed UK)"},{"comment_id":"10155010773818812","commenter_b":"Cynthia lol ur such an idiot","commenter_a":"Crazy! The country is not in mourning it's thrilled!!!😃😃😃","post_message":"The first post-election \"Saturday Night Live\" didn't open with a sketch spoofing the presidential candidates, nor did it include Alec Baldwin's Donald Trump. Instead, it opened on a somber note."},{"comment_id":"10154366303774749","commenter_b":"British Airways are a really bad airline, I would not trust a child of mine to them!","commenter_a":"If you can afford a top boarding school then you can afford a return ticket. Maximise revenue from those with plenty of disposable income to subsidise economy travel sounds like an excellent way to do things - well done BA.","post_message":"Parents will now have to travel thousands of miles to see off their children."},{"comment_id":"721943014570974","commenter_b":"lol bitches just saying the same shit to get pity and money","commenter_a":"Oh I bet she's a 'liar' too. So many baseless accusations that all sound exactly the same from people who never knew each other. Amazing.","post_message":"A protest was planned at the event."}]
