[{"comment_id":"10154251661998144","commenter_b":"arrest them all","commenter_a":"These people mare a direct threat to our Country and the good honest people in it! Anything goes to move them! I'm fed up!","post_message":"Anti-Trump protesters blocked off an ambulance because they were upset about President Trump's executive orders"},{"comment_id":"1195052803848081","commenter_b":"No more illegals. Go trump","commenter_a":"Trump rocks . Save Americans from drug cartels. Sanctuary citys and organizations promoting murder","post_message":"New polls show Trump is appealing most heavily to a certain kind of Republican voter."},{"comment_id":"1181717725240095","commenter_b":"lol actually u support a murderous witch AKA BENGHAZI BITCH","commenter_a":"TO BAD ALL THE BULLSHIT HE TOLD WAS A LIE.","post_message":"Donald J. Trump just gave the speech of a lifetime... but more importantly, he totally destroyed Hillary Clinton. He put a very special message to Hillary in there that you won't want to miss."},{"comment_id":"543983115775139","commenter_b":"Let them keep walking to wherever they came from","commenter_a":"Let them walk all the way to the muddeled East.","post_message":"Muslim Students Walk Out During National Anthem [VIDEO] If don't want to show your respect for our country, you can leave. Are you appalled by their blatant disrespect?"},{"comment_id":"10157124735195354","commenter_b":"They've no one to blame but themselves.","commenter_a":"Go Trump","post_message":"“Conservatives love to throw conservatives out of conservatism; it’s like an ancestral tic,” Noonan says. “But great political movements should not be run like private clubs. And have the anathemitizers noticed they aren’t in charge anymore? That in the great antiestablishment disruption of 2016 they have been upended, too?”"},{"comment_id":"891587657549689","commenter_b":"Two bullies fightng for power all over the arab both are terrorist","commenter_a":"Saudi arabia please don't do this because you are not killing your enemy you are killing your own brother","post_message":"The Saudi King says his country’s military operations against #Yemen will continue. Three days of airstrikes have killed over 50 people, many of them civilians. What do you think about the attacks on Yemen? Join us on #presstvdebate at 18:33 GMT"},{"comment_id":"843343722394413","commenter_b":"You're wrong. Go in a mosque sometime you'll probably even walk out with your head still attached.","commenter_a":"If we behave in the same fashion as our enemies, we become our enemies.","post_message":"REVENGE: French Attack Mosques And Blow Up A Muslim Kebab Shop Looks like the French have had enough of the Muslims immigrants living there and are fighting back! @webpagelink"}]
