[{"comment_id":"418611591638646","commenter_b":"We need to get rid of the income tax and the IRS and go to a strictly consumption tax. It would force people with hidden income like drug dealers to at least pay taxes on their incomes. It could also rid of us of the earned income tax credit which is nothing more than welfare paid through the income tax system. It is paid to illegal aliens. Welfare payments should be made at the state and local level and not the federal level.","commenter_a":"\"Cooperation between the parties is needed and not multiple threats of vetoes\"... perhaps if the do-nothing GOP actually starts doing something instead of just saying NO all the time then the veto threats would disappear....","post_message":"The President's State of the Union address was uplifting, particularly if one is not aware of the actual facts. The economy is better, but far from good. There is a war on radical Islamic terrorists, although he won't use those terms, and we are far from vanquishing them without an aggressive stance. Tax reform is needed, but not redistribution. Cooperation between the parties is needed and not multiple threats of vetoes. Perhaps someone can play the President's speech back to him and hopefully he will abide by the spirit of his words and not the spirit of his ideology."},{"comment_id":"10153927371866037","commenter_b":"May them leave now and so what... Do they think they can bring down saudi arabia ...! Rubbish","commenter_a":"new begginings for World Friends & Foes...! ( drawing a line in the sands-a dark Red Cloud will come from that part of the world. )","post_message":"Foreign Minister Adel al-Jubeir says that all Iranian diplomats must leave Saudi Arabia within 48 hours."},{"comment_id":"1648962245130424","commenter_b":"find a new dick to suck lol","commenter_a":"What will DiCaprio do?","post_message":"This sounds too good to be true!"},{"comment_id":"10153366601141770","commenter_b":"Where is our freedom of speech??? Keep your rioters away from TRUMP! You all send them with your lies of deceit...so you can have business as usual in Washington! We Americans see right through you...the uneducated don't...or the naive youth..","commenter_a":"what happened to freedom of speech? trump had nothing to do with the violence at his rally in chicago these were paid punks to not let him speek","post_message":"Mitch McConnell told reporters he and Donald J. Trump spoke by phone Tuesday and he encouraged the New York businessman to “condemn” the “violent expressions” at some of his political rallies."},{"comment_id":"10154208108446717","commenter_b":"I want to punch that bitch in her ugly face","commenter_a":"Disgusting.....","post_message":"His sympathy is with the first responders, and not the victims."},{"comment_id":"1858889271057520","commenter_b":"Bitchhhhh","commenter_a":"@username Jayquan Parker @username","post_message":"A woman drove her SUV into a T-Mobile store after she says she couldn't get her cracked iPhone replaced. @webpagelink"},{"comment_id":"10154319616791337","commenter_b":"???????????? LOL ????????????","commenter_a":"Looking forward to Colbert's inevitable rant about this, since he has Cap's shield.","post_message":"PURE FURY! Captain America fans are losing their sh*t over this decision..."}]
