[{"comment_id":"724979780984130","commenter_b":"Let's not forget that the woman also has to spread her legs.","commenter_a":"I have been saying this for years. The whole thing starts when a man can't keep it in his pants. He has no business telling women what they should or shouldn't do.","post_message":"Let me share a piece of myself. Yours truly was abandoned as a newborn by a man who now he is 100% against abortion. I guess me being taken to Arkansas and being raised by an abusive stepfather (and the first few years in a shack with an outhouse and a well for water) was OK. I appreciate that I had a chance at life. But you men who think you can make decisions for women? STFU. Now. ~tiff via Occupy Democrats"},{"comment_id":"10153007024072894","commenter_b":"He dumb why have that baby get close to him if he didn't know for sure if she is his baby he should've got that done first","commenter_a":"Maury would have done it for free","post_message":"Chris Brown Files Petition to Establish Paternity of Daughter Royalty"},{"comment_id":"10153231905295047","commenter_b":"Obama must be stopped, or the Supreme Court is complicit in his wrongful actions.","commenter_a":"Qut saying it, DO IT.","post_message":"When President Obama circumvents Congress to rewrite the law, he's acting more like a king than a President. His illegal Executive overreach must be stopped. Sign and Share our Supreme Court brief to take action: @webpagelink"},{"comment_id":"369671676554460","commenter_b":"Of course we pay for her boobs because we pay for all the boos in Washington","commenter_a":"This is disgusting and she should be kicked out in the cold! Taxpayers pay for this fraud nd sh should be removd from all social welfare programs! He doctor should never be able to bill this type of fraud.","post_message":"This Parasite... Unbelievable."},{"comment_id":"1383067515067050","commenter_b":"Your whore fingertips are getting in the way of you making any sense. Maybe if you'd done anything intelligent with your life instead of studying how to do your hair and makeup you'd see just what a failure to society you are.","commenter_a":"To all the haters, STFU. If you dont like it GTFOO our country, bc WE elected her! USA USA USA!!! We are great and will continue to be great with Hillary leading us.","post_message":"History has been made!"},{"comment_id":"10157076515550354","commenter_b":"Agree . No one uglier or nasty except her daughter !","commenter_a":"Where's my $$$? Ohhhh...she wants online trolls who will say something good about her....my mistake...","post_message":"SURPRISE!"},{"comment_id":"10155284668713268","commenter_b":"Who the fuck cares, did it have anything to do with this country?","commenter_a":"How long before he has a stroke a day realizes he is being uaed","post_message":"\"This is a direct attack on [Pres. Trump's] policies and her [Ivanka Trump's] name,\" Press Sec. Spicer said on Weds. regarding Nordstrom's decision to drop Ivanka Trump's fashion line. @webpagelink"}]
