[{"comment_id":"10153570996910329","commenter_b":"*high five* you guys are awesome! :D","commenter_a":"I'm a proud Christian and I'm ecstatic about this. I'm not even gay. Or American.","post_message":""},{"comment_id":"10153325338244342","commenter_b":"Stfu Lilia Jimrnez....you dumb woman","commenter_a":"So are we going to start killing police, getting revenge and causing a war in our country? Or are we actually going to try and solve these problems between police and the people they are supposed to be trusted to protect.","post_message":"Hundreds of people are expected to attend a prayer walk slated for Sunday night in northwest Harris County to remember Harris County Deputy Darren Goforth. #abc13"},{"comment_id":"1043060679149891","commenter_b":"The hell with Muslims! If you don't like our national anthem, you are free to leave.","commenter_a":"Immigration without assimilation is invasion. Get out!","post_message":"Claiming they are being oppressed..."},{"comment_id":"903300846390748","commenter_b":"Shoot her, her life does not matter here","commenter_a":"All lives matter, but standing on the flag is WRONG","post_message":"REPULSIVE: [VIDEO] WOMAN WALKS ON AMERICAN FLAG AT #BlackLivesMatter PROTEST, As US Service Members In Uniform Turn Their Backs On Her"},{"comment_id":"10154432155426509","commenter_b":"she is a liar","commenter_a":"In the end, She got voted because of her gender. Not saying she is bad, she is decent candidate but this woman thingy got to stop if she truly want to become a great president.","post_message":"\"In my second century, I look forward to seeing a woman president.\" She's 102 years old, and she turned out to her Iowa caucus to support Hillary Clinton: @webpagelink"},{"comment_id":"685959174927994","commenter_b":"No!!! Piss off bitch!!!","commenter_a":"Absolutely not , you moved to America to benefit from American ways of life and you're participating in the American justice system , and you expect to be changed just for you . I don't think so . You shouldn't even be allowed into the court house let alone the court room for reasons of security .","post_message":"This judge just made a controversial decision... Great. We support this judge 100%. Should this woman be allowed to swear on the Quran?"},{"comment_id":"10153918675239170","commenter_b":"Incompetent? Really? Jobless rate record low. Economy back on track. Bin Laden dead. Equal rights for everyone. Health care for everyone. I think you need to reevaluate. Perhaps it is the people who you are getting your facts from who are the incompetent ones. And since they're evidently your only source, I'd say you might want to step up your game.","commenter_a":"He's such an incompetent douchbag. 12 more months, thank God!","post_message":"Probably as close as Obama will ever come to actually admitting it."}]
