[{"comment_id":"691233461036607","commenter_b":"Every \"illegal immigrant should be deported\" good let's start with Malenia Trump","commenter_a":"Every last illegal immigrant in this country should be deported and all charged with a felony for being illegally here. If they come back again, charge the immigrant with two felonies and put them in prison, then deport them again when their sentence is up. If there is a third time for the immigrant to come back, give the natural life sentence. People that come here, should do so legally.","post_message":"Obama deported a record 1.5 million people in his first term."},{"comment_id":"1229197387109219","commenter_b":"Putin to Obama stop protecting Muslims I know Putin he is insane. What do you want from 1st a Muslim then a racist 1/2 black 1/2 white that own family owned slaves. And a bi sexual with a jar of Vaseline in his side table","commenter_a":"And so how is this different from supporting Israel which is pro-pro abortion? How does the GOP electorate square Israel's pro-abortion record with U.S. Southern Christian position on abortion? @webpagelink","post_message":"\"If I told you in 2008 that Barack Obama would negotiate a deal that he acknowledges will fund terrorism, you'd have thought me a conspiracy theorist.\""},{"comment_id":"10154104100243132","commenter_b":"#2. he likes ugly chicks","commenter_a":"Just be happy... The beginnings are the best!","post_message":"New year, new romance for Amy Schumer!"},{"comment_id":"10153831676802377","commenter_b":"Trump and him are a great team and those Trump have lined up will make The A team! Everyone that loves this country has to realize now this Election is about saving this country! Do yourself and loved ones the most important thing and vote Trump! Obama is letting illegals in to vote the Americans have to stand up and fight for their own freedom!","commenter_a":"No he lives in a bubble","post_message":"Following Mike Pence's remarkable performance at the vice-presidential debate, Republicans wish they could swap their presidential candidate as the Indiana governor now appears more promising than Donald Trump, according to Politico."},{"comment_id":"10154075378206336","commenter_b":"@username that's not the law u ding bat.For years the law has been if Cubans can make it here they can stay. They were running to get away from the tyrant and then Castro when he took over. They do not run a cross our boarders. They come by boat through Florida. So as soon as Cubans arrive they are legal","commenter_a":"What an absolute Jerk. The Republican Obama. Clown Prince Trump.","post_message":"Donald J. Trump said he didn’t know if Marco Rubio was eligible to run for president and that “the lawyers have to determine that.”"},{"comment_id":"10153941419749614","commenter_b":"how is she an idiot, Frank? your original post does indeed come across as victim blaming. rapists don't discriminate. it doesn't matter if it's 9pm or 9am - if they wanna rape someone, they will do it. also, this girl was with her father so I'm sure she felt pretty safe to be out after dark.","commenter_a":"Why would they be at a Playground in Brooklyn around 9 p.m.???","post_message":"Update: Police say they have four of the five males in custody in connection with the incident. Original post: New York police are looking for five men who forced a father at gunpoint to leave his teen daughter behind so they could take turns raping her, authorities say. The 18-year-old was with her father at the Osborn Playground in Brooklyn around 9 p.m. Thursday when the brutal gang rape took place, according to NYPD. Authorities released this grainy surveillance video, taken in a bodega before the violent assault, that they say shows the suspected attackers. Police are asking for the public's assistance in identifying them. Read KTLA story here: @webpagelink"},{"comment_id":"1211673908894956","commenter_b":"ROTTEN NO GOOD PIECES OF CRAP, FIRE LESTER HOLT, DAMM LIBERAL , AND RUN HILLARY TOO PRISON WHERE SHE BELONGS.","commenter_a":"If she gives out free college who do these dumb asses thanks whos going to pay for it _ we are","post_message":"A rigged election!!"}]
