[{"comment_id":"10156157123040725","commenter_b":"Keep the illegals out","commenter_a":"I'm glad to get this input.","post_message":"Marco Rubio is weak on illegal immigration and will allow anyone into the country. Has worst attendance record in Senate- rarely there to vote on a bill!"},{"comment_id":"1586029795023236","commenter_b":"all you women who just need to color those grey hairs with Bleach blonde. So Vain.","commenter_a":"Richard Dryfus.....dude...you just lost the majority of your fan base. You must be a Criminal follower!","post_message":"He called Trump small dicked prick a unqualified racist who had for celebrity supporters."},{"comment_id":"513245792199334","commenter_b":"ALL MUSLIM PIGS Get the HELL outa MY country!!!!!!","commenter_a":"Screw you, give her her job back, this is a disgrace to the AMERICAN people! Anyone can make a mistake!","post_message":"A lunch lady was fired for serving pork to a Muslim student. We are in America, give that poor lady her job back. Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"10154223634466770","commenter_b":"She's got great legs","commenter_a":"All these red carpet shows are about is who can have the most revealing, revolting and trashy outfit on! It's rare that there's a decent one, but I guess they're the ones not shown because they aren't revealing enough! Too bad these \"artists\" don't rely on talent!!!","post_message":"We didn't even know they made dresses this short."},{"comment_id":"10154467163611051","commenter_b":"Madonna this is a women who invaded her on body with a cross,scum is all i can say ,yes she should be in jail","commenter_a":"trump does not have moral privilege to call anyone an ugly name, since he owns every ugly name one can muster to describe his repugnant behavior. Madonna does not come close to the names lying trump has called President Obama. Madonna \"tells it like it is\" and that is too much for Right wing nut bags.","post_message":"Donald Trump says he has only one word to describe Madonna."},{"comment_id":"10155320618472668","commenter_b":"@username bigly, hum, never heard that word before. She is a hateful lady, period!","commenter_a":"I thought she was moving? Time to leave loser. It's time to take care of your own run-a-way and drug addicted children!!","post_message":"Following reports that President Trump was upset at seeing Sean Spicer impersonated by a woman on SNL, Rosie O’Donnell has stepped up with an offer to play Steve Bannon on the show."},{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.” Read more here: @webpagelink"}]
