[{"comment_id":"10154047243421990","commenter_b":"Your moms desperate.","commenter_a":"Out of all California, he gets a \"band\" from Hilmar, CA. I'm sure the musicians are talented but...LMAO!","post_message":"Who will be marching in Donald J. Trump's inaugural parade? Here's your answer: @webpagelink"},{"comment_id":"817062668431422","commenter_b":"We are to political and afraid to hurt someones feelings to do anything... when Trump ginally takes the seat yall will see some change","commenter_a":"My tears go to all the fatalities. Rest in peace","post_message":"BREAKING NEWS: Berlin terror attack... At least 12 dead as truck ploughs into Christmas market Full story: @webpagelink"},{"comment_id":"1161479583891497","commenter_b":"BUILD THAT WALL! BUILD THAT WALL! BUILD THAT WALL! #MexicoWillPayOneWayOrTheOther #Trump2016","commenter_a":"Time to just hand out some good old justice and let them be found in a roadside ditch back across the border","post_message":"GROUP OF ILLEGALS GANG RAPE 13-YEAR OLD GIRLS. sickening details: @webpagelink"},{"comment_id":"1073730232720030","commenter_b":"Their all prostitutes, lol","commenter_a":"Mika was raised and programmed to be a prostitute by her father. She's very accommodating when it comes to white politicians and Chinese business men.","post_message":"A hot town hall mic just exposed Trump as the fraud he is."},{"comment_id":"1323967450977057","commenter_b":"Golden showers for a golden girl!!!! LOL!","commenter_a":"He's gonna cry.........all the way to the Whitehouse!!!! LOL!","post_message":"Trump has never looked so pathetic."},{"comment_id":"1570131419945845","commenter_b":"How does someone like this get elected in this day and age? Shame on those that vote for such a disgusting human being. I hope Texas sees the day when most of their women have left the state. This is the opinion of a multiple degreed female with a B.A in Mathematics and a Juris Doctorate","commenter_a":"He's an embarrassment to men as well as women. How in this day and age does someone like this still exist?","post_message":"\"It is the job of a woman to stay at home\" - A real Republican in 2016."},{"comment_id":"888747014505260","commenter_b":"Good way to a straight path to HELL!!","commenter_a":"Awful but God will be the judge. Foolish woman.","post_message":"Pro-abortion Congresswoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb. baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here!@webpagelink"}]
