[{"comment_id":"1011635065552183","commenter_b":"Are you surprised by this woman's corruption? She should be in jail with the other corrupt politicians. Wonder what she'd look like if she didn't have access to plastic surgery for a couple of years.","commenter_a":"this woman should be took out and shot for all the corrupt things she has done ,, and throw in her friend Dirty Harry Reid also ...","post_message":"Here's Nancy Pelosi real \"war on women\""},{"comment_id":"444065119108702","commenter_b":"Please don't come. You would ruin the peace with your complaining.","commenter_a":"Would never go to Texas! Actually none of these states that are so in love with guns!","post_message":"College campuses need books, not weapons."},{"comment_id":"10153759489753812","commenter_b":"How do you know? One year of college did not teach you much","commenter_a":"Creationist heads explode...","post_message":"Researchers in South Africa believe they may have uncovered a brand new “relative” to humans, and they have named the new branch of the family tree Homo naledi.@webpagelink"},{"comment_id":"486025081592014","commenter_b":"I really really want her to go to jail","commenter_a":"This lying bitch only knows how to take care of her greedy self!!!!","post_message":"Hillary Clinton criticizes Republican Donald Trump's tax plan, calling it \"trickle down economics on steroids.\" Do you agree or disagree with Clinton on this?"},{"comment_id":"533363636854216","commenter_b":"if this person had been a white lady, shed be up on charges...black privilege","commenter_a":"Good for her kick his ass","post_message":"After this mom found out her son was rioting, she took immediate action. All the parents in Baltimore should be doing this to their race rioting children. Do you agree her race rioting son got what he had coming?"},{"comment_id":"10156151601990294","commenter_b":"She was underage.... Huge mistake......","commenter_a":"I find it funny that people are actually defending him.... If this was any regular person he would've been considered a pervert, a pedophile, a sick man But who am I kidding, he's a ( white ) cop He's above the law","post_message":"The 17-year-old says the officer only received \"a slap on the wrist.\""},{"comment_id":"10153679249728352","commenter_b":"Pure Evil!!","commenter_a":"SUCH HATEFUL EYES","post_message":"The most hated man in America, 21, smirks as he is hauled away in cuffs and a bullet-proof vest after his arrest ‘for shooting nine people dead at South Carolina church bible study’"}]
