[{"comment_id":"10152705081476519","commenter_b":"And have lots of sex in ur ass ur gonna get raped first","commenter_a":"You might be interested in Googleing why it was banned. Few today would believe the pseudo-science mumbo jumbo presented as fact to Congress. 1) Smoking marijuana will make black men want to rape white girls. That's girls not women. There is ZERO evidence here. 2) Smoking marijuana will make young men more likely to experiment with homosexuality. THAT may be true, but the rest of the presentation turned that simple statement into more of an assertion that it would turn young men gay.","post_message":"\"It is time for us to replace the failed prohibition with a regulatory system that works and let states and municipalities decide for themselves if they want, or don't want, to have legal marijuana within their borders.\""},{"comment_id":"717966465023405","commenter_b":"My condolences.","commenter_a":"That's my boy the day after I brought him home. 💜💜💜","post_message":"Mmmoohmygod."},{"comment_id":"575908422533751","commenter_b":"Kepp telling it girl !","commenter_a":"How true.","post_message":"Meghan McCain says that when Trump makes mistakes with his words \"it offends people sometimes and it can be controversial, but when Hillary makes mistakes, people die. Agree or disagree?"},{"comment_id":"10154534719475695","commenter_b":"She should of just kept her mouth closed. #LessonLearned","commenter_a":"Good!","post_message":"Her employer and Miss Alabama pageant organizers are responding to the video, watched by 600,000 people."},{"comment_id":"975345569191587","commenter_b":"Mr, Dugger wanted a woman with no personality.","commenter_a":"Depends on what viewpoint your looking at. A successful marriage is not solely dependent on sex which is something your husband didn't know or taught to his son","post_message":"Michelle Duggar also says she's saving she and husband, Jim Bob’s, 'intimacy notes' to share with her daughter, Jill. Can you say, “EW!”?"},{"comment_id":"10153632761623984","commenter_b":"Die bitch","commenter_a":"Coward!!!!!!!!!!!","post_message":"After calling out the suspect in this tragic police officer shooting, this city’s top cop dropped a huge truth bomb that could come as a big surprise to advocates of the \"black lives matter” movement. Do you agree with this police chief?"},{"comment_id":"1555472744739839","commenter_b":"Screw them! Go get a job and pay for your own damn food.","commenter_a":"Get off your butt and look for work. In meantime, thank which ever god you pray to for living in a country that gives Food Stamps!!","post_message":"This is outrageous. If you're that picky get a Job and buy whatever you want."}]
