[{"comment_id":"1561742504135313","commenter_b":"Gonna try this for sureeee","commenter_a":"@username yess","post_message":"Making your own crepes is the perfect way to start the weekend. (via Real Simple)"},{"comment_id":"10153327625216833","commenter_b":"She's a puppet","commenter_a":"Seems to me that the police that have been in danger are in the black communities.","post_message":"On March 28, MSNBC Melissa Harris-Perry suggested the push away from gun control and toward expanded gun rightswhich means more armed, law-abiding citizensactually puts police lives in danger."},{"comment_id":"1395648327124620","commenter_b":"You're pretty much a stupid whore. I feel bad for your kids","commenter_a":"WAHT DONT U GET?????????????????SHE IS ILLEGAL.......Rayos has been required to check in with ICE every year since 2008, when she was caught working under a fake Social Security number...................NO ONE EVEN KNEW SHE WAS HERE UNTIL 2008....WAKE UP STUPID AMERICANS","post_message":"The 36-year-old mother of two is among the first undocumented immigrants to be deported under Trump strict new policies."},{"comment_id":"10154743661575470","commenter_b":"@username (Psst. She means white.)","commenter_a":"Finally a decent president out with the trash in with the class","post_message":"INAUGURAL PARADE: Watch President Donald J. Trump take part in the ceremonial parade."},{"comment_id":"10155132618144885","commenter_b":"@username CA would be in a lot less debt if they kept their own revenues. CA ranks as 46/50 in dependent states in the US. They give more than they get.","commenter_a":"What are these liberal agencies and locations going to do without Federal Funding? This is a direct threat from Trump. From what I've seen from him he keeps his word. Places like Chicago are going to be in a world of hurt without federal money.","post_message":"Chicago Public Schools has instructed its principals not to let federal immigration agents inside district buildings without a criminal warrant."},{"comment_id":"907515899315838","commenter_b":"Thought it was Vermont?","commenter_a":"And yet the latest FBI Uniform Crime Report shows that Maine is the safest state in the US. Hmmm...Coincidence?","post_message":"They're quarantining themselves!"},{"comment_id":"476652309189729","commenter_b":"donnnnt wanna hear it..cant stand her...","commenter_a":"Someone should us duck tape over her lips. She takes the cake for the most disgraceful women in the White House ever","post_message":""}]
