[{"comment_id":"1091478814208499","commenter_b":"what a dumb bitch","commenter_a":"Our President has made it ok to be racist again.","post_message":"Doesn't seem like EVERYTHING is racist? According to the New York Times anyway."},{"comment_id":"10154404367061037","commenter_b":"Get a life lady","commenter_a":"When trump loses I wonder what the trump voters that have outed themselves as racists and bullies are going to do, double down or deny it.","post_message":"Is Donald J. Trump's historic presidential run doomed to fail?"},{"comment_id":"894598347242254","commenter_b":"She needs to keep the hell out of our city schools.","commenter_a":"From what I see in this pictire, Moochelle is describing how to succeed in politics the Lewinsky way! ROFLMAO!","post_message":"The Food Police!"},{"comment_id":"10153987186985329","commenter_b":"Fuck off bitch","commenter_a":"Dorotea Lazio Batistoni I'm ded","post_message":"It's finally happened."},{"comment_id":"434665249991403","commenter_b":"Like Ms. Richards said \" get over it\"","commenter_a":"The supreme court has been and is political. It has jettisoned the straight forward and logical meaning of the Constitution in a growing social activism. The concept of heterosexual marriage has been intact from the beginning of historical time...until the present attempts to normalize the homosexual perversion . Legal liasons by contract have always been possible to all persons but the attempts to socially institutionalize and legally legitimize homosexual marriage as an equal and legitimate alternative to heterosexual marriage will never legitimize it. It may legalize it - but unborn baby murder is legal but will never be morally normal nor moral.","post_message":"Rick Santorum thinks that Congress should fight the Supreme Court if the court rules in favor of gay marriage. Is he right or wrong?"},{"comment_id":"599734130175363","commenter_b":"she is such a idiot","commenter_a":"Repeat a lie long enough and loud enough . . . Welcome to Nazi America, 2015","post_message":"Temper, temper, Carly."},{"comment_id":"10153292946061509","commenter_b":"obama is a standerd POS ! muslim bstrd","commenter_a":"This is asinine. Why would he do this, yet absolutely refuse to meet with Benjamin Netanyahu??","post_message":"There were some hard-hitting questions about drones, college education and racial profiling. But he gets those all the time. Let's focus on the weird: @webpagelink"}]
