[{"comment_id":"10155072860698690","commenter_b":"Cedric-Herrou, wherever you're you're my \"Hero\" Blessed are those hands that giveths.","commenter_a":"Diego Dab","post_message":"Farmer Cedric Herrou is standing trial for helping people cross into France, but his actions have made him a local hero."},{"comment_id":"1686987451566043","commenter_b":"@username -- A woman who gets raped didn't choose to have that sex.","commenter_a":"Isn't it great that we have the Government to make decisions about what women can and cannot do with their bodies? I'm so glad we have old, white men who can control our woman parts for us.","post_message":"Indiana Governor Mike Pence signed a bill that bars women from seeking an abortion because the child will be born with a disability, a controversial restriction that is one of the tightest abortion laws in the country."},{"comment_id":"1529182653808525","commenter_b":"yep, paid lazy fucks, how about we let the illegals stay and ship thse shitbags back","commenter_a":"Liberals out to break this country and doing a very good job at it communist or stand together","post_message":"Are you KIDDING!?"},{"comment_id":"10154192939617541","commenter_b":"Agree it's the dumbing down of America....","commenter_a":"He's such a child.. name calling , whining and bullying when he doesn't get his way. That behavior is definitely not what we should expect from our president!","post_message":"Trump says \"Pocahontas is now the face of\" the Democratic party."},{"comment_id":"10154216444386350","commenter_b":"She should have been left the freak!!!","commenter_a":"After 30+ years of cheating and drugs nowwww she finds her inner strength?","post_message":"\"It right for me, because I honestly, at this point today, have no idea what I doing with the rest of my life.\""},{"comment_id":"420582524733009","commenter_b":"No lying Bitch will run this Country!! You will be heavy investigated about all this money you have.","commenter_a":"No they never do on the left !!","post_message":"Is the press giving this enough attention?"},{"comment_id":"451811115023381","commenter_b":"#DonaldTrump2016Bitches","commenter_a":"You should be embarrassed acting like a child picking on the other runners. Why can't you just tell people what you would do as president? Can't believe a potential president would act like a child...I thought you were different...","post_message":"Tomorrow is the most important Tuesday in a long time. Vote for me, & together we can stop Trump & win in November."}]
