[{"comment_id":"1676679282547936","commenter_b":"The women do have a choice... Unless they revolt.","commenter_a":"her crime was that his dinner was served to late by his wife and it was too cold for his liking..... Why would ANY woman marry a Muslim man? .... Even a Muslim woman.......","post_message":""},{"comment_id":"507506722754821","commenter_b":"Who cares what he thinks?","commenter_a":"Is Kanye West Racist,,, he sure acts like it. In one word \"DENIAL\"... And yes Kanye if it was a \"WHITE\" entertainer I would feel the same way. This whole race card is getting played out, BILL COSBY is a rich NARCISSISTIC PREDATOR. Color shouldn't give ANYONE a pass.","post_message":"With just three words, Kanye West succeeded at creating yet another Twitter storm."},{"comment_id":"10153151151584330","commenter_b":"... what does this have to do with this news story?","commenter_a":"Mental illness on the rise. We need to open state mental institutions Nd not close them down. Poor people have no where to turn to and it can effect the innocent.","post_message":"BREAKING: A person died after being hit by a train in Fairfield. Train service in the area has been disrupted --> @webpagelink"},{"comment_id":"1048538675181808","commenter_b":"Grow up yourself...it will not affect her in becoming the next loser female Barry. That was my point!","commenter_a":"So what!","post_message":""},{"comment_id":"10153422515817235","commenter_b":"There are a good number of female cops killing for nothing.. Just look it up.","commenter_a":"Another petulant, controlling, entitled man killing a woman who told him 'no'. I'm really sick of men behaving this way simply because he can't get his own way. Women do not DO this. Why do men?","post_message":"Protecting and serving the hell out of you."},{"comment_id":"10152807038616636","commenter_b":"Muslims are still a small minority in England. They may cause trouble, but they are controllable.","commenter_a":"Message to Islamlist functionalists.... don't fu**k with the British people...if you want war ....you have it !!!! We'll wipe you off the planet !!!","post_message":"Breaking: Isis have warned of ‘even bigger and more bitter’ things to come..."},{"comment_id":"466002853760417","commenter_b":"Screw your health care - you can buy a freaking wall instead America.","commenter_a":"Trump suffers from major PARANOIA....💰💵😎","post_message":"Speaker Paul Ryan on President Trump's executive order to build a wall on the U.S.-Mexico border: \"We're going to pay for it and front the money.\" Watch Greta Van Susteren's full interview with Speaker Ryan. @webpagelink"}]
