[{"comment_id":"876377039127570","commenter_b":"Hopefully the \"treatment\" is the same pain & suffering the little girls had to endure","commenter_a":"There is sex offender treatment in prison?","post_message":"Nicole Vaisey, 26, and her boyfriend, 40-year-old Stephen Howells, admitted that they kidnapped the two Amish girls."},{"comment_id":"504319243082965","commenter_b":"So many of these republiCANTS are using the same old debunked arguments lol Here let's clear up some bullshit and hopefully reach new dialogue on how to possibly prevent further mass shootings: -we've all seen the \"scaring us into dictorship memes\" Our government is corrupt but giving up on how far we've come as a country just to say fuck it let's start a new government here and deal with THAT transition process instead of getting rid of something that Americans are rightfully pissed off keep killing their kids and neighbors. -Yes, when guns are gone crime will still be a thing. Shootings MAY be a thing. Google search the COUNTRY OF AUSTRALIA and stop lying to yourselves. If you have any solutions for stopping all crime please let the class know motherfucker. For now can we ONLY focus on preventable mass shootings? Less guns means less gun related crime, ...","commenter_a":"But they said guns don't kill people!?","post_message":"Who sold this guy his gun?"},{"comment_id":"1864825540399867","commenter_b":"A few years prior: \"did you see the her sleeveless dress?! THE FIRST LADY HAS NO CLASS!\"","commenter_a":"I'll never get over our \"president\" saying he grabs women by the pussies and his supporters just shrugging their shoulders over it","post_message":"Here are five reasons why Trump is the opposite of a Christian. Special thanks to Cindi Brady. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"546390502218196","commenter_b":"WHAT A ASSHOLE. !!!","commenter_a":"He is a Muslim!","post_message":"Obama threatens inprisoning military personnel for defying him. This is outrageous. He is drunk with power. Do you think Obama is a tyrant?"},{"comment_id":"10153860714632098","commenter_b":"Ok people get real speeches are written for them and each one has something from another as their are only so many things that can be said in a speech such as this. No I am not in favor of our politics right now and feel that neither are a good choice for the US. But that aside do we not have more important things to worry about then what a speech writer gave to the wife of a running mate? Move on and let's get things going in a better place for our country, with so many loosing their lives recently I feel this is a low priority. Let's make change for good elect Mickey Mouse. Lol","commenter_a":"Give her a grade F - fail, flunked, fake !","post_message":"Melania Trump accused of plagiarizing Michelle Obama's speech"},{"comment_id":"10153780845375530","commenter_b":"You can look it up!","commenter_a":"Columbus is neither hero nor monster. Indigenous people were screwin' each other over long before Columbus arrived. Don't like Columbus Day? Don't celebrate it.","post_message":"It was not clear when exactly the statue was vandalized. Detroit police were still looking into the incident when contacted."},{"comment_id":"574676589404983","commenter_b":"What a stupid bitch","commenter_a":"She should have seen that nazi meathead Trump fan telling Mexican protestors to make him a burrito. Way more uncivilized than what's happening here. What a stupid statement.","post_message":"She should have seen the \"uncivilized\" civil rights sit-ins that won her the right to be on Fox News."}]
