[{"comment_id":"10153845002233984","commenter_b":"They can both suck deez nuts lol.","commenter_a":"Jeb may not have expected the question, but he handled it well. The conditions underlying the two events were not comparable. Megyn's comparison was a stretch.","post_message":"Megyn Kelly just took Jeb's criticism of Hillary and threw it right back at him with one question he did not see coming... Do you think Megyn was wrong for using this analogy or was it a fair question?"},{"comment_id":"10153442947898908","commenter_b":"This is wrong. I can just tell you it is wrong because of decay and expansion. We know that the universe was something different even if that was just a tiny speck. The way the article reads as if the universe has always been the way it is now and that is not the case. All these bible thumpers who don't understand basic science or astrophysics will use this to try to say God is real.","commenter_a":"the end is the beginning.... the beginning is the end...","post_message":"This is a tough thing to wrap your head around."},{"comment_id":"10154473701808812","commenter_b":"Good for her! This is the American Dream at its finest. All you haters who think this country belongs to you and all immigrants are criminals and steal your jobs can suck it! I was born here and will die for my country if necessary and this is what I will fight for. The right for EVERYONE to pursue life, liberty, and happiness. God bless you little girl!","commenter_a":"This is amazing.","post_message":"Texas high school valedictorian reveals secret in graduation speech: \"I am one of the 11 million undocumented immigrants living in the shadows of the United States.\" @webpagelink"},{"comment_id":"10153248937462235","commenter_b":"Bitch deserves to be skinned","commenter_a":"OK. I read the article. NONE of the animal was wasted. ALL of the beautiful creature fed people. This woman is \"an extreme hunter\" and has made a living at it...tv, radio, etc. WHY SHE WOULD POSE WITH A DEAD AMINAL? BECAUSE SHE DOES IT ALL THE TIME. YUCK.","post_message":"'What must’ve happened to you in your life to make you want to kill a beautiful animal & then lie next to it smiling?' -- Ricky Gervais"},{"comment_id":"1083559065045639","commenter_b":"She would have to pay me to go listen to her garbage.","commenter_a":"Are you listening Mom and Dad?","post_message":"What an incredible waste of both time and money. Blow it on beer, or burn it for warmth. Both better ways to spend your cash. Y'know, since college kids always have an extra three grand lying around."},{"comment_id":"1857171411229870","commenter_b":"Apparently Madonna thinks about blowing a lot.","commenter_a":"She should be arrested for making terroristic threats!","post_message":"Madonna said she \"will not back down.\""},{"comment_id":"488312324683981","commenter_b":"Hmm if firearms are a replacement for a small penis what are females replacing with firearms @username???","commenter_a":"Gun Worship in The United States of Guns is Killing US...","post_message":"SCARY!!"}]
