[{"comment_id":"10153357244917061","commenter_b":"She should be a shame of herself. A doctor, would not want her to treat me.","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"10154467699462675","commenter_b":"Let's be clear to all Trumpicans about at least one thing: not all terrorists are or have been Muslim. America isn't the only country to be attacked by terrorists. Terrorists have one thing they all share, they're Terror-ISTS","commenter_a":"guess what, you should leave too. you are an imagrant. give this country back to its rightful people, the native indian. !!!!!!!!!!!!","post_message":"British Foreign Minister Boris Johnson addresses parliament on President Trump's immigration policy. President Trump's executive order bans U.S. entry to migrants, refugees and green-card holders from seven predominantly Muslim nations."},{"comment_id":"1340551885984265","commenter_b":"Your a believer if you believe what you said, people been saying that crap every election. I know you don't like either nobody does but someone is going to win Who would you rather","commenter_a":"@username I know you won't but watch this....","post_message":"TOTALLY VIRAL --- HOW TRUMP WINS (VIDEO) @webpagelink"},{"comment_id":"10153597569599411","commenter_b":"@Zoran...again, you get a life...we are pretty happy and fine. Not like a poor illegal immigrants as Zoran trying to stay in the west....","commenter_a":"No one should feed barbarian Russian junta fascism invaders.","post_message":""},{"comment_id":"637787356403576","commenter_b":"She's a psychopath","commenter_a":"She's correct. We're living in an era when a significant number of Americans simply refuse to acknowedge facts, or even the existence of facts. It's the populist wave.","post_message":"Hillary Clinton: \"It's now clear that so-called fake news can have real world consequences.\""},{"comment_id":"388912451508467","commenter_b":"This woman won't win the next election.","commenter_a":"Tankes sister","post_message":"Angela Merkel: 'Islam is not the source of terrorism'. Merkel spoke at the Munich Security Conference about why cooperating with predominantly Muslim states is vital."},{"comment_id":"10156088559505294","commenter_b":"In my opinion, the collarbone issue and sleeveless tops or dresses are a bit over the top. The women in most offices I've worked at wore sleeveless dresses and tops that were tasteful and appropriate. Even the women news anchors wear tasteful sleeveless outfits. I don't see a problem with that. I do however agree a dress code should be in place for kids in school. When they get out in the real world, there are rules, and they have to be followed. 48-50 years ago, we had to wear skirts or dresses that touched the floor if kneeled down. If it didn't touch the floor, we had to change. The guys had to wear belts. If they didn't have a belt, they had to pay 50 cents for a piece of masking tape with the word belt on it and tape it to their pants, and they better have ...","commenter_a":"I say all schools should have a dress code and make sure all students adhere to it. It teaches them to accept things in life their not happy about, but rules must be followed.","post_message":"It's back to school time, and we're hearing more stories about dress code violations. Students at one school in Chicago are protesting a rule that they wear only shirts and dresses with sleeves. Click below for more, and tell us: Are dress codes these days fair? Unfair? Do they go too far?"}]
