[{"comment_id":"993863733987432","commenter_b":"Shut up Meg","commenter_a":"If only this call had been made in September 2001.","post_message":"That's probably not the kind of congratulatory phone call Netanyahu wanted."},{"comment_id":"10153776813241336","commenter_b":"Bye-bye!","commenter_a":"Good riddance!","post_message":"Ahmed Mohamed’s family released a statement saying they had accepted a foundation's offer to pay for his high school and college in Doha, Qatar."},{"comment_id":"10154151758449087","commenter_b":"@username Oh, please. Where are the arrests, the charges, the trials? Where are they? When did they happen? Where are the files? The proof? And here's the thing: Bill Clinton is NOT running for president. Whatever did or did not happen in the past is a \"he said, she said\" situation at this point. Or really a \"she said\" situation, and sadly, a LOT of women go after powerful men, married men, etc., and then cry \"rape\" when they don't get what they want. And I say that as a woman who would f**king kill a man who raped me. And once again, Bill Clinton is NOT running for POTUS. Donald Trump is a low-class disgusting creature who should NOT represent this great nation on the world stage.","commenter_a":"Let me know when Trump does something as bad as LEAVE 4 AMERICANS TO DIE..then you will hear my outrage..but you won't hear it over some locker room crap that Trump said.. Toughen up cupcakes..","post_message":"#BREAKING: Mike Pence was reportedly \"beside himself\" after hearing Trump's obscene remarks about women, and Pence's wife was \"furious.\""},{"comment_id":"10153410983047787","commenter_b":"@username, she is an idiot!","commenter_a":"You are an idiot. Climate change causes prostitution I have never heard such a stupid coment.","post_message":"Diversity is our nation’s greatest strength – our currency should reflect that. I’m so glad that the Treasury Department agrees! Which shero would you like to see on #TheNew10?"},{"comment_id":"1359242680802143","commenter_b":"Nope. Her boobs would be bigger.","commenter_a":"She looks amazing, but that belly looks like it's growing a baby","post_message":"Is Jennifer Aniston pregnant at 47?"},{"comment_id":"1195858527119048","commenter_b":"That is what we call \"seasons\" in Texas. LOL","commenter_a":"No it is not. Just look around us fire in one state floods in others and earthquakes in others lakes dying up and animals dying from bad water and no food.","post_message":"This is important."},{"comment_id":"1028137907274272","commenter_b":"I just want to know all you people that are here illegally, if you love it here so much why haven't you went through the process of becoming legal? And if not then bye bye. I mean it's pretty fu**ing simple. Get legal citizenship or get booted back to wherever you came from. You need the United States, the United States doesn't need you.","commenter_a":"It's all fun and games until she gets deported with the rest of us.","post_message":"Meet Miriam Cepeda, a 24-year-old Latina and a self-proclaimed \"Trump girl\" campaigning for Donald J. Trump in Texas, 8 miles from the Mexican border. @webpagelink"}]
