[{"comment_id":"10153882831009714","commenter_b":"The same reason why men need viagra...","commenter_a":"No pregnancy is a choice and it doesn't deserve any special treatment. Women have been pregnant for as long as time and they didn't need special parking, so why do they need them now.","post_message":"What do you think?"},{"comment_id":"838910662903525","commenter_b":"@username Take your temper tantrum elsewhere! Hillary's got this! #HillYes","commenter_a":"LOL JK BUILD THE WALL DEPORT THEM ALL TRUMP 2016","post_message":"I was so moved to receive this honor from Puyallup Tribal leaders."},{"comment_id":"940335786059476","commenter_b":"That's right fuck that dumb cunt!!!","commenter_a":"Michael Lance Kaniala-Ekahi Baldasare-Low Shelbie King @username","post_message":"How to silence Kim Davis supporters who cherry-pick the Bible to discriminate against LGBT Americans. In the comments, tag your friends who need to see this. Video by Occupy Democrats, please LIKE our page!"},{"comment_id":"1317807834918571","commenter_b":"Hillary Clintin is a nasty Woman, I like the sound of that truth.","commenter_a":"TRUMP = TRUTH","post_message":"WATCH LIVE: Donald J. Trump's campaign manager tells Bianna Golodryga about the \"rigged election\" claims."},{"comment_id":"10153386310193869","commenter_b":"Not from NYC... but upstate. Older and forgot spelling.","commenter_a":"Concerto for Horne and Hardart (spelling?)","post_message":"Alex Ross listens to both satirical and serious compositions by Peter Schickele, the man behind the comic persona of P.D.Q. Bach."},{"comment_id":"934017173381331","commenter_b":"You keep having your exercise interrupted by having to go pee. There I said it","commenter_a":"Duh, coffee is a powerful drug, of course things feel better when yer buzzed","post_message":""},{"comment_id":"10153931664823797","commenter_b":"Well..when you look at how Democrats view abortion...5 months ago..that woman could have destroyed that baby through an abortion... .They don't respect life. So why should a Democrat care about how this baby died?","commenter_a":"Democrats would argue that this is not murder as abortion is not murder to them.","post_message":"29-year-old Sharron Braxton has been charged with the fatal suffocation of her 4-month-old son. Prosecutors say Marcus Jr. died after she rolled on top of him in the middle of the night. How very sad. Here's what police say she was doing before she fell asleep:"}]
