[{"comment_id":"10153389055716770","commenter_b":"Wow is she stupid or what. Racist pig.","commenter_a":"Sure we can play with a bad bad boy and you will get bad results","post_message":"A CNN guest argued that her ex-CIA panel-mate was unqualified to talk about ISIS because he's white."},{"comment_id":"10153730594409099","commenter_b":"Who are all these women stuffing their babies in bags?","commenter_a":"Thank god the baby was left somewhere where baby could be found alive unlike all these mothers stuffing them in bags killing them. This was a woman that loved the baby enough not to hurt it. Maybe she was afraid of something like deportation or something else. At least it was at a church not in a dumpster or alley. We don't know the circumstances or her story so lets not be aholes and judge at least someone can raise that baby who wants it.","post_message":"BABY IN A MANGER: A wailing newborn baby was found with its umbilical cord attached inside a nativity scene at a Queens church, police say ----> @webpagelink"},{"comment_id":"10154315361436656","commenter_b":"Shes a bi**h fr","commenter_a":"Let it go nothing or know one is perfect, and we surely can't do what she does on a good day! Let it go... Damn media!","post_message":"\"I'm trying to be a good sport here.\""},{"comment_id":"10154251884613701","commenter_b":"Oh my wow...this bitch right here is why we need to stop immigration...","commenter_a":"It kills me that LGBT wants special rights when they are going against God's Commandments. It's a fact that the LGBT have mental illness, look it up. America was not built on Gay rights. Also what about people of color we are still fighting for our rights in 2016.God commanded that Marriage should be between a man and, a woman. We are living in the last days. Sodom and Gomorrah. You can't say you believe in God when God condemns homosexuality.","post_message":"The 1969 riots at the Stonewall Inn launched the modern gay rights movement and the annual New York City pride parade."},{"comment_id":"10153313566903908","commenter_b":"Like the symbolism...but don't know about using it as a flag...we tend to fly flags when we want to differentiate our selfs from others...this differentiation leads to conflict and destruction...no flag","commenter_a":"I see that beautiful symbol as being interconnected and one. Almost reminds me of the flower of life or a lotus","post_message":"This could become the flag that is used to represent our planet as a whole when we travel to other worlds. It was designed to \"evoke the feeling of global community in people all over the world, reminding us that we all are connected and should take care of our home planet and each other.\" Sacred geometry, anyone?"},{"comment_id":"1800550493547458","commenter_b":"Good idea but im barefoot anyway","commenter_a":"@username would you use it?","post_message":"The iron horseshoe is now a thing of the past."},{"comment_id":"1209227002477386","commenter_b":"Dumb ass bitch","commenter_a":"I feel bad if they were black but if they're white I don't give a fuck because they never care bout us dying","post_message":"#WSHH #Iowa #Police #BreakingNews"}]
