[{"comment_id":"10153949955984454","commenter_b":"Chicks with green dresses","commenter_a":"What is wrong with this pipeline? Pipeline are the safest way to move oil and natural gas. And the least destructive to the environment. Most of the land recuperates in a few years.","post_message":"An expanded Alberta Clipper pipeline could send up to 880,000 barrels per day of toxic oil from Canada's Alberta tar sands into America's heartland even more than #KeystoneXL. Tell Secretary of State John Kerry to block the Alberta Clipper pipeline: @webpagelink"},{"comment_id":"10153935539180399","commenter_b":"They will just be in the restroom with transgender men! Grow up guys!!","commenter_a":"cruzs and trumps kinda guy @webpagelink","post_message":"Cruz said the bills make sense because \"men should not be going to the bathroom with little girls.\""},{"comment_id":"1069087446447636","commenter_b":"Put her on the street .","commenter_a":"She looks flashy","post_message":"The liberal media loved Michelle Obama's tang SOTU dress. Take a guess at how much it cost."},{"comment_id":"10153075316564440","commenter_b":"Sarah, maybe if your homegirl wouldnt act so tough against the cops and complied, she would be alive. she rammed a car towards and now she's dead!","commenter_a":"Wow these damn cops can do what they want that's a damn shame","post_message":"BREAKING: No charges against Denver cops who fatally shot 17-year-old Jessica Hernandez dpo.st/1dSxAU8"},{"comment_id":"10152638370431167","commenter_b":"Skinny, blond, white ladies can't be racist.","commenter_a":"What the...","post_message":"Reminder: This person is still on the payroll at ABC."},{"comment_id":"1069713516429844","commenter_b":"My Father and his family came through Ellis Island. They had to have a sponsor in the United States who guaranteed them a place to live and support until they were self-supporting. They were screened for disease. My Grandmother was almost refused because she was sea-sick for the whole journey. The government officials had to determine that it was only sea-sickness before she was admitted. Now, we have no idea what illnesses are being brought in to OUR Country through all these illegals and obummers immigrants. No wonder illnesses that we have virtually eliminated are cropping up now.","commenter_a":"Absolutely the way that it should be done!","post_message":"America's Freedom Fighters"},{"comment_id":"1407030135990971","commenter_b":"pugsky er uhyggelig","commenter_a":"@username Jeg ønsker mig en bullpug!","post_message":"Lots of adorable, slightly sad faces."}]
