[{"comment_id":"10153679869402629","commenter_b":"Who cares... Let her be a kid!","commenter_a":"good for her","post_message":"Malia Obama. is touring colleges to decide where she will go to school (and maybe play beer pong?) next year."},{"comment_id":"10154152866009575","commenter_b":"@username Maybe she did not know her hair was too long like to cover the screen? Where I live people ask me often to remove my hair from the seat at the bus because is too long so I have to because my hair does not move by itself. It is funny when they realize I am not a woman when I face them lol I say I am sorry and take my hair over my chest. No big deal and sooo what he was trying to watch anyway that was too mad, porn? hahahahaha :)","commenter_a":"People taking pictures and making a stink on social media instead of being an adult and asking someone to do something.","post_message":"An airplane passenger flung her ponytail over the back of her seat, covering the screen of the person behind her. That annoyed person snapped a picture and it's going viral. What are some of your biggest pet peeves?"},{"comment_id":"10152742769151167","commenter_b":"Rihgt Michael...just another Fox News whore","commenter_a":"Speaking as a Jew, I think someone needs to kick Tarantula upside her head.","post_message":"Vile."},{"comment_id":"10153979531201680","commenter_b":"WARNING ! NEVER NEVER HILLARY ! America will have a very dark future /nightmare and dangerous as hell if hillary get elected. Note : RADICAL MUSLIMS, ISIS , TERRORISTS ARE PRAYING FOR HILLARY TO WIN SO THEY CAN DESTROY THIS COUNTRY AND YOU. Transcription of Brain Carn’s Prophetic Word for 2016 “What happened in California would become common place in America, and an event worse than 9/11 is coming to America. The Lord says that Islam has a definite problem. They will never shake this reputation of violence from themselves. Even innocent Muslims will endure hardship and persecution in the future and no longer see America the same. @username Muslims are gonna begin to gather to cities, like Dearborn, Michigan, and form new communities that contain the populous of their presence so as to guard the backlash from White Patriotic America. The Lord says that a witch hunt will be ...","commenter_a":"Says he wants to \"drain the swamp\" but brings out all of the old alligators and crocodiles from years ago-Newt, Rudy and Kellyanne Conway, whose husband was an advisor to Paula Jones!!! Listening to Conway is like listening to someone scratching fingernails on a chalkboard-very annoying!!!!!","post_message":"The race is deadlocked despite a Clinton advantage in early voting."},{"comment_id":"921176444602838","commenter_b":"Bernie or Hillary will destroy the economy with their policies. Plus, they're so weak on immigration and would prefer for the illegal immigrants, who by the way, suck up over 150 billion dollars per year, to stay. Trump is on point with just about everything.","commenter_a":"Michael Luna Can't wait to see what Obama says or these other people just opening the gates to everyone... Donald J. Trump is right on this one, we need to close the border right now...","post_message":"The two men have been training at the base since February and “were screened prior to their arrival in the United States more than a year ago,” according to the statement."},{"comment_id":"10153231905295047","commenter_b":"Obama must be stopped, or the Supreme Court is complicit in his wrongful actions.","commenter_a":"Qut saying it, DO IT.","post_message":"When President Obama circumvents Congress to rewrite the law, he's acting more like a king than a President. His illegal Executive overreach must be stopped. Sign and Share our Supreme Court brief to take action: @webpagelink"},{"comment_id":"10155791972890725","commenter_b":"STFU","commenter_a":"and a lot of people blame the police in one out of five hundred killings. what happen to hope and change under obama?","post_message":"Police say the victim, identified as Vonzell Banks, was likely not the intended target ----> @webpagelink"}]
