[{"comment_id":"1004051086318087","commenter_b":"Hillary is a BIG LIAR","commenter_a":"HILLARY CLINTON 2016!ALL THE WAY TO THE OVAL OFFICE!!","post_message":"With just 100 days until the Iowa caucuses, James, a Hillary for Iowa organizer, is taking over @HillaryClinton on Twitter. Follow along to hear why he’s working hard to elect Hillary: @webpagelink"},{"comment_id":"1661010187498580","commenter_b":"Don't forget Texas borders!","commenter_a":"Focus now on what is at hand Mr. Trump. Put an end to ISIS, erect that wall, and focus on Florida and Canadian borders, lastly boost our economy. You have mentioned these 3 things before which garnered my attention, then my vote. Just give more ways of getting this done. Oh, hate to throw this in but there may be a few executive orders that need immediate attention! TRUMP 2016!","post_message":"Remember, I am self-funding my campaign, the only one in either party. I'm not controlled by lobbyists or special interests-only the U.S.A.!"},{"comment_id":"10153417319160927","commenter_b":"....using plus size models to sell plus size products, what a amazing concept!","commenter_a":"Game over? Looks like the fat lady is singing.","post_message":"Did Facebook fat-shame?"},{"comment_id":"10152952082057452","commenter_b":"Shes beautiful","commenter_a":"So precious!","post_message":"This video of a baby seeing her parents’ faces for the first time after getting glasses will melt your heart: @webpagelink"},{"comment_id":"1120823271280022","commenter_b":"What you actually mean is that all women are idiots","commenter_a":"Proof that republican women are idiots.","post_message":"If we're going to be honest here, the thing that might be most shocking is that ANY women could look at ANY of these candidates in a favorable light."},{"comment_id":"10156429465415354","commenter_b":"Whoopi, you dirty looking bitch Those Islamic Muslim women are in danger of being deported Our female population on the other hand is under threat of gang rape and murder by the Islamic Muslim terrorist.","commenter_a":"Moron...","post_message":"WATCH Whoopi unload on Donald Trump..."},{"comment_id":"948719421835197","commenter_b":"naw, the generation of things now being exposed more like it","commenter_a":"The generation of no personal responsibility.","post_message":"If this tactic works, we're a sicker country than I could have ever imagined."}]
