[{"comment_id":"1044157185605292","commenter_b":"Wikipedia that hoe","commenter_a":"Let's be real, we never went to the moon.. We did not have the technology to go through the Van Allen radiation belt. The astronauts would had been cooked alive.","post_message":""},{"comment_id":"274137179658285","commenter_b":"@username paying for this useless wall? Yeah I know. It must be stopped!","commenter_a":"I wonder how many of these people are willing to take any of it illegals home, feed them, pay their medical bill and totally care for them?","post_message":"LIVE: Protesters gather at JFK Airport in New York in response to Trump's immigration order. A Yellow Springs resident is planning a local protest for Sunday: @webpagelink"},{"comment_id":"10153759226208188","commenter_b":"At least the governors are smart!!! Get a clue Obama!","commenter_a":"Amen!!","post_message":"UPDATE - 17 states now: The Republican governors of Maine, Nebraska, Texas, Arkansas, Arizona, Indiana, Louisiana, Mississippi, Massachusetts, Ohio, North Carolina, Wisconsin, Georgia and Illinois joined their counterparts in Alabama and Michigan in saying they would no longer help settle Syrian refugees. One Democratic governor, Maggie Hassan of New Hampshire, joined them in rejecting Syrian refugees."},{"comment_id":"367420056779622","commenter_b":"she should be in jail","commenter_a":"This is not right","post_message":"THIS is where tax money go..."},{"comment_id":"1728765537410558","commenter_b":"She's a Bitch!","commenter_a":"vanstone is an idiot","post_message":"Oh no... I'm praying for Bindi Irwin."},{"comment_id":"10154680684123797","commenter_b":"Lisa Austin","commenter_a":"Okay, now this stupid game of Chicken is getting out of control! 😡😡 Someone needs to blink or all of the children in Illinois are going to suffer!!😡😡","post_message":"#BREAKING: Chicago Public Schools will not open in the fall if Illinois fails to approve an education budget, CPS CEO Forrest Claypool told the Chicago Tribune Wednesday."},{"comment_id":"1771925833072094","commenter_b":"Well, WE the people are voicing concern about muslim people who leave in US for free and hate us; WE the people.!","commenter_a":"assimilate and don't threaten to kill us or kill us. Or rape us. You're in America. Become American. Eezy peezy.","post_message":"Muslims are voicing concern on social media about a Trump presidency. @webpagelink"}]
