[{"comment_id":"10152894841766636","commenter_b":"So they should ! Sex with a drunken person should never happen !","commenter_a":"It's funny, you could have had drunken sex over there without fear of prosecution. But if that new law comes in over here in the UK? A guy potentially could be charged with rape even though it was consensual at the time?!","post_message":"RIP Shagaluf."},{"comment_id":"10153402345983812","commenter_b":"Women are to careless & I don't try to twist anything!!!This is a 10 year old girl,not an Adult woman..In most cases ppl could prevent getting pregnant but they do NOT!!I do not even see how would be possible for this child to carry a baby to full term..I think if you are old enough to spread your legs you should be responsible enough for the outcome..Like I said this is a baby not an Adult!!Not going to argue the difference!!!","commenter_a":"I'm totally against abortion but in a case like this her being so young she does not need to carry that baby!!","post_message":"10-year-old girl who was allegedly raped and impregnated by her stepfather has been denied an abortion: @webpagelink"},{"comment_id":"10154456330994445","commenter_b":"I'm a female! Hilary needs to stay home and crochet something ya crazy hag","commenter_a":"I notice most of the haters of Hillary are men, you must have Momma issues!","post_message":"President Obama made the case for Hillary Clinton, saying there there's no other person more qualified for the most powerful office in the world. @webpagelink"},{"comment_id":"10153963116971341","commenter_b":"Better one soldier in jail and one terrorist dead then one terrorist in jail and one Israeli dead. That Palestinian is a terrorist who tried to stub innocent civilians.","commenter_a":"A large proportion of the Israeli population supports these extra-judicial killings @webpagelink","post_message":"\"What happened in Hebron does not represent the values of the Israel Defense Forces.\""},{"comment_id":"388733381251257","commenter_b":"ABSOLUTELY YES !","commenter_a":"Real need/ felt need.","post_message":"This could be bad news for some people on food stamps."},{"comment_id":"1875497529335937","commenter_b":"Ann Coulter is a very dumb idiot. I wish she would disappear","commenter_a":"That would keep many of his own people from voting.","post_message":"Fact check! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1152705121429163","commenter_b":"Illegals are voting in our elections.","commenter_a":"Don't you think you should stop asking this question and read the Constitution of the United States dumbass!","post_message":"I Agree!"}]
