[{"comment_id":"1728764820743963","commenter_b":"That lady is just jealous because she is a mean n nasty lady n because she COULDN'T do it she has to be a d-bag....good job Bindi","commenter_a":"People are very cruel. God bless you bindi and your family. You were amazing and your dad was watching you sweetie .","post_message":"Oh no... I'm praying for Bindi Irwin."},{"comment_id":"10156651950690354","commenter_b":"She can have all my babies","commenter_a":"Some poor schlep is going to get this girl pregnant one day and then oooooohhhhhhhh shitttttttt, here comes the crazy. Which brings up a good point. Wear condoms. Knowing is half the battle.","post_message":"Here's the VIDEO that's breaking the Internet today. \"Miami’s Local 10 identified the inebriated girl as second year University of Miami neurology resident Dr. Anjali Ramkissoon.\" **Viewer discretion is advised**"},{"comment_id":"1004626696250624","commenter_b":"Boy is she getting old!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"They show this picture to men who have had an erection for more that 4 hours, works every time!","post_message":"Make sure you let our politicians know that we will not support their abortion friendly policies! Click below to sign your petition to end Roe v. Wade today! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH15&pid=fb122"},{"comment_id":"10153894151651782","commenter_b":"So if people have an issue with racism in this country they should leave?? How dumb","commenter_a":"I'd make sure they get no government grants or assistance! Way to keep division strong!","post_message":"A Massachusetts college says it will remove the American flag from its campus: @webpagelink"},{"comment_id":"10151088515799999","commenter_b":"Such a misogynist!","commenter_a":"I was at Smith College when Maher came and spoke in the late 90s. His contempt for women was palpable. Not a surprise that he feels avuncular towards Milo. Once you accept it is okay to dehumanized one group, it is just a hop skip and jump away from demumanizing anyone.","post_message":"Bill Maher's interview with Milo Yiannopoulos was a mostly chummy affair. Then in a segment that ran after the broadcast, Yiannopoulos attacked transgender people."},{"comment_id":"10156663842160354","commenter_b":"KILL THEM Europe.","commenter_a":"This is what the fool, Obama wants for America .","post_message":"A DOZEN PHOTOS... \"Parents have been advised to keep their children indoors as migrants roam through playgrounds, while on residential streets police wearing riot gear stalk gangs of migrants.\""},{"comment_id":"671356856304361","commenter_b":"Absolutely! Well said @ Nick..","commenter_a":"I think anyone that can actually read and does read about the UN`s actions will know that something is very wrong here, there is corruption at work, right at the top. Their anti Israel bias is painfully obvious in deed and action, compare what they levy against Israel in comparison to every other country under the UN, read some of the insane quotes from Palestinian sympathizing UN members and you will have the naked truth envelop your logical thinking in determining that ulterior motives are at work, insidious schemes are hatching and Israel is in the UN`s sights for dubious reasons. They are utterly obsessed with attacking Israel on the world stage and make not one effort to direct their attention anywhere else. We see the bias, we understand corruption is undermining the very fabric that weaves the tapestry that makes the UN have any credibility in the eyes of ...","post_message":"Israeli sources detail president’s ‘difficult’ 30-minute post-election call to Netanyahu, posit grave scenarios for diplomatic rupture"}]
