[{"comment_id":"10153457336028525","commenter_b":"Brian","commenter_a":"Jose J Torres","post_message":"A cure for diabetes? It could happen, and they've already begun testing it in a small number of diabetic patients. STORY: @webpagelink"},{"comment_id":"1806158626337786","commenter_b":"She has pneumonia like I have the plague! UGH","commenter_a":"Now they're saying she had pneumonia since Friday---yet she did a celebrity fundraiser Friday with no mention of being ill. And if she did have pneumonia since Friday, why wasn't that the first excuse given for her collapse?","post_message":"\"Overheated.\" \"Short circuit.\" These are her and her campaign's own words. If they're using language like this to spin her appearance, what is the reality?"},{"comment_id":"510721549087800","commenter_b":"Ok 1. Lets ask ourselves do they want to destroy capitalism answer (no) 2. Will they take the means of production from the capitalist answer no 3. Do they want to destroy the upper class answer no","commenter_a":"The progressives will next demonize God and Jesus then they'll start pushing multiculturalism and diversity so Ireland get ready","post_message":"\"Abortion has been demonized and criminalized in this country and older generations think there's something really wrong of it... but it's something that should be available to people.\""},{"comment_id":"10153015286404641","commenter_b":"Check out dis video @webpagelink","commenter_a":"Pls. friends click the link and like the photo of cedrick he's good and intelligent student he doesn't have money for his college. your like is to help for his scholarship and share to your friends .. we really need ur help .. just click the Link below .. Please Like Candidate #1 .. Thank you po .. :-) @webpagelink","post_message":"Nigerian voters refuse to be silent in wake of election delays @webpagelink"},{"comment_id":"10154266076039071","commenter_b":"They will be new Amazon GO stores!","commenter_a":"I AM COUNT DRACULA","post_message":"The retail industry is heading into 2017 with a glut of store space."},{"comment_id":"10153835231273984","commenter_b":"If it were any of us, we would be held accountable! This IS her mess!!!","commenter_a":"Fry the bitch! Tired of listening to her lies, and hearing her giggle when she's asked about her emails as if she knows she already got away with murder!","post_message":"WOW. There's no doubt Hillary did NOT want this to get out there. This makes things looks so much worse for her... Do you think Hillary Clinton should be held accountable for her actions?"},{"comment_id":"10153178614619342","commenter_b":"This dude doesn't even capitalize TEXAS or GOD and y'all comment on this???Surely the fear of God sounds so Christian???? LOVE IS LOVE END OF STORY!!!","commenter_a":"texas is a god fearing state.we will not compromise on our faith","post_message":"JUST IN: Texas Attorney General Ken Paxton calls the Supreme Court decision giving same-sex couples the right to marry a \"lawless ruling\" and says state workers can cite their religious objections in denying marriage licenses. STORY --> @webpagelink"}]
