[{"comment_id":"10154468181011833","commenter_b":"What a gal.","commenter_a":"Matt Brown Ivana Wong","post_message":"This grandmother confronted home invaders with the only thing that could level the playing field: a firearm."},{"comment_id":"1167588859974389","commenter_b":"Bo Go Back To Fucking Your Sistermommy","commenter_a":"Isn't that great ! I am happy to see Trump gets that endorsement. Hillary is probably sick with envy but she got an endorsement from BLM...and other terrorist groups.","post_message":"Major Endorsement from our Heroes on the Frontlines..."},{"comment_id":"10153482643681130","commenter_b":"its on your page Joseph Zawistan","commenter_a":"\"Recent graduate initiated hunger strike\"....Lol. Why don't you use your degree and go get a fuckin.job and concentrate on future like you're supposed to do when you graduate.","post_message":"There's been a call for three top Student Senate leaders to resign, and a recent graduate initiated a hunger strike."},{"comment_id":"1949140865300152","commenter_b":"Yo baby daddy work at the post office now? 😩😂 Imani Ave","commenter_a":"MsJackson Ifyounasty i think I would have sprayed them too would you??","post_message":"A postal worker caught on camera appearing to pepper spray three dogs. What happened to the dogs and how did USPS respond? ABC13-Jessica Willey has the details: @webpagelink"},{"comment_id":"1252850228086868","commenter_b":"Hang the bitch","commenter_a":"You all just racist that's why you all up all in trumps ass with his bull so take you all racist ass and do what you do best talk mess about real ppl. Trump going to blow your mind when he turns on you and do what's right","post_message":"Hillary Clinton is desperate these days and has even officially taken to getting down on her knees to beg the American people after Congress announced their next big plans for the corrupt Clinton – and the brutal nature of them has got to have Hillary downright horrified. @webpagelink"},{"comment_id":"10153241233694087","commenter_b":"Which wife??","commenter_a":"He makes good decisions ... look at his wife and his kids ...","post_message":"\"He is who he is,\" Melania Trump said of her husband Donald J. Trump. \"Even if you give him advice, he will maybe take it in, but then he will do it the way he wants to do it. You cannot change a person. Let them be. Let them be the way they are.\""},{"comment_id":"1006897696063097","commenter_b":"Praying for a awesome woman of God and Crouch family.....such seeds she has sown...","commenter_a":"Pamela Houston","post_message":"The TBN family continues to ask for prayers and promises to keep us updated on Jan's condition. #JanCrouch #TBN #stroke"}]
