[{"comment_id":"10152889552848717","commenter_b":"Bringing a gun to a bomb explosion? Okay....","commenter_a":"Save natural causes, racism has directly or indirectly been the cause of death to every single black in this country. Ponder that statement for a minute, because it is the truth. If you are black, eventually racism will most likely lead to the cause of your death, whether it is diet, subsequently health, or murder. The degree of oppression will take its toll. Dying of a natural cause is a luxury that few blacks will enjoy, and by natural cause, I refer to old age only. The degree in which we are hated is only mildly expressed in this video. The odd man out is usually hated with a vengeance, and we been tasked with that role since day one. No matter whom we go to war and help this country fight, once the war is over, our citizenship status becomes less than that of the enemy whom we help ...","post_message":"President Obama's nomination of Loretta Lynch to become the country's first African-American woman attorney general is a historic pick."},{"comment_id":"10153977245641509","commenter_b":"Shirts for everyone!! If women can keep their shirts on, so should men.","commenter_a":"Yes","post_message":"This isn't just about decency, a CNN commentator writes -- it's a small exercise in democracy. What do you think? @webpagelink"},{"comment_id":"1745160079101455","commenter_b":"No, I am convinced she has a serious mental health issue. She lies and lies about lying. She questions your temperament to lead? She is the psycho, literally, staying with her husband solely for political purposes while constantly defending her indefensible record of blatant corruption. And for what? Her relentless pursuit of more power to abuse. Hillary is not mentally fit to lead","commenter_a":"she looks sedated","post_message":"Bad performance with foreign policy \"speech\" yesterday, by Crooked Hillary Clinton! Reading poorly from the telepromter! She doesn't even look presidential!"},{"comment_id":"10153897345459726","commenter_b":"As a man, whenever I hear Hilary's shrill angry voice my blood runs cold. Bernie should be more careful attacking Hilary, she'll wave her wand and turn him into a frog.","commenter_a":"Same old crap.!!!!!!!!!!!!!!!!","post_message":"WATCH: Clinton and Sanders called out for lies!"},{"comment_id":"10153114864642144","commenter_b":"Bitch is a hater","commenter_a":"I don't even care about McCain but to be dismissive about his service to our country is disrespectful. Trump is an asshole.","post_message":"Low, even for Trump"},{"comment_id":"1796936270580308","commenter_b":"She is so low a snake would have to slither over her. #Hillaryforprison www.clintonkaine.com","commenter_a":"Go Hillary ! You have shown us during a most difficult campaign that you don't go low you always go high ! I'm with you and my family as well!!","post_message":"The decision we make in four days will affect our country for decades. hillaryclinton.com/makeaplan Share this if you agree:"},{"comment_id":"870399723007863","commenter_b":"Her and Her Husband are a disgrace to America.period!","commenter_a":"She think it ok i am obama wife","post_message":"Is it her?!"}]
