[{"comment_id":"467133756816336","commenter_b":"That is a disgusting fact. Those people should be ashamed to call themselves 741915279236631s","commenter_a":"That is a shocking testament of liberal standards & ethics!","post_message":"A new poll found 71 percent of Democratic voters believe Hillary Clinton should keep running even if indicted, a view shared by only 30 percent of Republicans. Where do you stand?"},{"comment_id":"1686879181550201","commenter_b":"It had to be a woman. Why couldn't have just come up with a $3 bill. Leave well enough alone.","commenter_a":"Of all the really great black statesman the US has ever produced, wonder why they didn't pick Frederick Douglas, MLK? Oh yeah, they were republicans and Douglas said any black that would vote democratic was an idiot. Of course people are so ignorant now I have read where people have stated the democrats drew up the legislation for the civil rights act, in reality passed by a republican congress with a reluctant Democrat, Johnson signing it. Ignorance abounds","post_message":"BREAKING: OBAMA SUCCESSFULLY WHITEWASHES AMERICAN HISTORY…”Racist” President Andrew Jackson To Be Replaced With Harriet Tubman On $20 Bill"},{"comment_id":"1321737624513912","commenter_b":"So they're not seen as better coders, they're better coders who happen to be women!","commenter_a":"If all 4 of the total androgynous coders had 80%of their code approved, would that mean androgynous coders were superior than both other genders? How about keeping to the science topics, not social engineering propaganda.","post_message":""},{"comment_id":"10154889440018701","commenter_b":"@username I totally agree with you ! So many people are making lame excuses for these kids! They were old enough to be out by themselves with no supervision,THEY MADE THE DECISION to do what they did,which KILLED PEOPLE and DESTROYED HOMES !! I hope the deaths and destruction is imbedded in their minds FOREVER !!! Bad choice of a way to spend your day ya little F***ERS !!!","commenter_a":"As a child a friend and I were playing with fire in a field. We accidentally set a huge bush on fire that could have easily spread out of control had we not had a drink with us. By the grace of god it didn't spread to all the near by homes. We were not trying to burn people's homes down. I think people need to realize that kids don't always think of what could happen. They are children! They will have this on them for the rest of their lives.","post_message":"Two minors have been arrested and accused of starting wildfires that killed 14 people in eastern Tennessee."},{"comment_id":"917503514939106","commenter_b":"Shut up bitch","commenter_a":"Surely another upstanding citizen.","post_message":"BREAKING: New police body cam video reveals the disturbing moment a white cop killed Eric Harris, an unarmed black man in Tulsa, Oklahoma. #EricHarris #BlackLivesMatter"},{"comment_id":"853540474702649","commenter_b":"By the way I don't agree with this either. But just think if people do not hire illegals they couldn't survive here. That is the root problem maybe we should start there.","commenter_a":"States did this not Obama. Do you blame him for everything? If the Cardinals don't win the World Series I'm asking congress to impeached him because it would have to be his fault","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"},{"comment_id":"10154249857386770","commenter_b":"STOP.","commenter_a":"OMG.seriously..and down the toliet bowl we go.swirl, swirl","post_message":"Police officers in a Massachusetts town are no longer allowed to give kids high fives as they enter their elementary school because it reportedly makes illegal immigrants and minority students feel uncomfortable."}]
