[{"comment_id":"1093577714092941","commenter_b":"Same way any comments from Pak regarding Indians and Kashmir are irrelevant.","commenter_a":"We are talking about a region where induviduals will go as far as to hijack airliners and slam them into skyscrapers. They think anybody that doesn't conform to their sick twisted ideology is the Devil.","post_message":"\"In Afghanistan, being lesbian is seen as un-Islamic. If people found out, the result would be death.\""},{"comment_id":"10153202654871107","commenter_b":"Deport all 30M illegal aliens.","commenter_a":"This makes me so angery that our government cant even enforce laws already there, time to replace everyone of our politicians for not doing their jobs and getting caught up with deal making, sick ,sick of it, PUT MORE INS AGENTS ON THE JOB AND GET ALL OF THE ILLEGALS OUT NOW!! and may I add i'm sick of politicians asking for money to do their jobs this includes you Mr. @username!!","post_message":"Our nation now has whole cities and states who stand up and willingly defy federal immigration laws in order to protect illegal immigrants who have broken our nation’s laws. This must end and it must end now. Today, I introduced legislation in U.S. Senate that would cut federal funding to cities and states who refuse to follow our immigration laws. My bill makes it clear, the American people will not stand for cities harboring violent criminals. But I need to know if you are with me. Please sign your \"Enforce Immigration Law\" petition right away, then consider chipping in $20.16 or more to help me spread my message to voters in early primary states."},{"comment_id":"10154460376356955","commenter_b":"Let's get real honest for a minute. WHAT demographic purachased most of the 80 million copies of \"FIfty Shades of Grey\"? White suburan WOMEN. They were ok with the talk about p888y in that book and movie, but are all the sudden appalled at trump's language 11 yrs ago.. As espn football guys would say, \"COME ON MAN\"!","commenter_a":"Funny how all the establishment types who have fought to stop Trump all along, republicans and democrats alike, are the ones most offended by coarse language and not so bothered by corruption and criminal activity.","post_message":"Voters Heckle Paul Ryan, Chant: 'SHAME ON YOU!'..."},{"comment_id":"10155057669604099","commenter_b":"Go away!","commenter_a":"Propaganda News has their disturbed audience...and their days are numbered. They have no one to blame but themselves! Buh-bye!","post_message":"The announcement comes a day after President Donald Trump's spat with the media sharply escalated."},{"comment_id":"1222871987767261","commenter_b":"@username no yo are for supporting that muslim scum","commenter_a":"HES DONE MORE FOR THE USA THEN OBAMA DID IN 8 YRS YOU PPL NEED TO GET A LIFE AND MOVE ON","post_message":"BREAKING NEWS: President Trump holds surprise press conference at the White House"},{"comment_id":"1086347321421796","commenter_b":"Oh my, kicking out the Black Lives Matter people AGAIN during your Atlanta, GA rally. Second time in how many days, Shill? Awww, she loves the Blacks, she sure does, except for when they might just question her. @webpagelink","commenter_a":"I was one of them too! Now I'm a 29 year old man and I'm voting for Hillary!! You had our back and now we have yours!!","post_message":"Eight million kids have healthier lives and brighter futures thanks to the Children’s Health Insurance Program. Connar is one of them."},{"comment_id":"733367520187159","commenter_b":"we need to get these low lifes out of our country","commenter_a":"I am offended by them. I don't want to take them down but can we send them home. I m gladly contribute with the air fair","post_message":"Muslims Make Massive Move To Change The Flag Because It's Offensive If you don't like the flag you can leave. Do you think this is absurd?"}]
