[{"comment_id":"1316028568419930","commenter_b":"What happens if you don't believe in \"God\"? I personally will not end up in hell if I have an abortion, as I don't follow the teachings of any religion. For me, it is my body and if I don't want something growing in my body I will remove it. I have had a miscarriage, and I have my one child. I do not want another child, ever. I can't use birth control, I can't use affordable condoms. If I have sex and I end up with a pregnancy I will have an abortion. Becuase I do not want another child. It is that simple. If we do not watch out we will soon be sent to jail for having a miscarriage, that is the road we are going down. So every female that has ever had a miscarriage needs to stand up and fight for the rights of others, ...","commenter_a":"Sometimes pregnancy happens regardless of how many precautions are taken. Sometime a woman's right to consent is taken from her. Sometimes the pregnancy is a deadly risk for the mother. Sometimes the baby may live a short, painful life or a long painful life. Sometimes a woman does not realize she is pregnant right away. Every time it is her body, her rules.","post_message":"This bill would prohibit abortions after the first detectable fetal heartbeat but many women don' even know they're pregnant that early."},{"comment_id":"1048024048598660","commenter_b":"Disgusting.","commenter_a":"The blessings of new life. I think it's wonderful","post_message":"\"It looks like an alien\""},{"comment_id":"10154712563594203","commenter_b":"We can't give up. Hillary all the way! @webpagelink","commenter_a":"What if I told you...that Trump supporters will continue to follow him blindly no matter what he says or does, and what if I told you Hillary supporters will blindly follow her no matter what she says or does. That is called a nation that has been divided, and conquered. :/","post_message":" in Utah are really conflicted because they believe that Trump is bad, but Hillary is worse.\""},{"comment_id":"1739731709624496","commenter_b":"Dumb racist bitch","commenter_a":"I think she's stupid - like literally too lacking in intelligence to do more than jump onto an under informed, opportunist bandwagon.","post_message":"Don't let the door hit you..."},{"comment_id":"10153476790357490","commenter_b":"Rachelle that the way it was in the day...just saying...thank you for being a stupid bitch!!","commenter_a":"Oh Lord...way back in my day they got an Admin or Medical discharge...if the Navy wanted you to have a baby they would have issued you one with your seabag...","post_message":"MATERNITY LEAVE BOOST, ICYMI – Female sailors to get up to 18 weeks in the year after their baby is born:"},{"comment_id":"1220522774636943","commenter_b":"Lock her up!","commenter_a":"NOTHING TRUMP SAYS CAN CHANGE OUR MINDS WE WILL NOT VOTE FOR TRUMP . TRUMP IS A BASKET CASE . TRUMP IS A CRIMINAL . TRUMP LIES , LIES ,LIES","post_message":"CAST YOUR VOTE: The third and final debate between Hillary Clinton and Donald Trump before Election 2016. Vote for who you believe is winning and see the results LIVE. Vote here: @webpagelink"},{"comment_id":"10154201803933869","commenter_b":"44?","commenter_a":"In fairness, what President hasn't had to pay $25 million to make a massive class action fraud lawsuit go away before assuming office?","post_message":"The election of Donald J. Trump to the Presidency is nothing less than a tragedy for the American republic, David Remnick writes."}]
