[{"comment_id":"10154331830756028","commenter_b":"They both need to be put in population in prison and let be what needs to be done to these two monsters they didn't protect that beautiful innocent baby","commenter_a":"I am beyond sickened by this....death penalty.....","post_message":"In the days before her death, little Leah Brown-Meza suffered multiple injuries to her head, a broken arm and a second-degree burn to the bottom of her foot. Her mother and her mother's boyfriend sat in blue jail uniforms as they listened to the evidence presented against them in court. @webpagelink"},{"comment_id":"1624321510961305","commenter_b":"She's a P I G!","commenter_a":"She has a lot of gall, wearing a crusifix on that neck........","post_message":""},{"comment_id":"1221564884584907","commenter_b":"No one would stalk you, Hillary!","commenter_a":"Well Hillary, I believe you are safe with Donald. He isn't desperate enough to grab yours ! Besides he is a gentleman, not all men are like Bill Clinton.","post_message":"Seriously? So lame..."},{"comment_id":"900759883386314","commenter_b":"Hillary's supporters don't care that she's a sold-out Wall Street neocon. It's weird.","commenter_a":"She is the ONLY person on earth to know how it felt to take that place in history........glad she was the one who knew how to really cherish it for all of us... thanks Hillary... Girl, you rock!","post_message":"When history's in the making, sleep can wait."},{"comment_id":"410883789115113","commenter_b":"I don't understand why they are picking on Trump! If I remember correctly the other candidates said the same thing. They did not want anymore refugees brought into to us but only Trump getts STOMPED for it.. DC is so afraid of him. Go Trump!","commenter_a":"Pot calling the kettle black.","post_message":"Trump is being attacked from all sides. He needs our support. Can we get 70,000 'LIKES' to elect Trump for president?"},{"comment_id":"10153033840709071","commenter_b":"It's screwed up that you assume (be it probaly acurate) that we have not heard of Eritrea.. Why dont people know grography? It's alarming.","commenter_a":"People are leaving in droves so things are obviously not great, however western media outlets have always been incredibly harsh with regards to Eritrea. The ongoing refugee crisis is incredibly sad though. @username, thoughts?","post_message":"The worst regime you've never heard of."},{"comment_id":"775776192555196","commenter_b":"When God or nature grants you a vagina and uterus, you'll have a say in reproductive rights. Until then, NO. You canNOT force your girlfriend to continue an unwanted pregnancy to term, you creep. That's rape.","commenter_a":"So if a father wants his baby a woman can kill it with out his permission I guess a man only has rights to a child when a woman wants his money for the next 18 years rape is the only time abortion is ok if it's not from rape abortion is murder stop sugar coating avoiding responsibility if a woman wants a child and a man doesn't can he force an abortion no woman do not have exclusive rights over children just because you carry it for nine months a child beongs to both male and female hate me if you want to but my child was MURDERED! With out my say!! How is that equality?!","post_message":"Elizabeth Banks, Bellamy Young, and others share abortion stories to #drawtheline."}]
