[{"comment_id":"10155111489782009","commenter_b":"you are crazy lady!","commenter_a":"He has brought ugliness and division.","post_message":"\"He has he has brought smiles to faces.\""},{"comment_id":"1172120832836462","commenter_b":"@username she's a racist. \"Government people\" is code word for white devils. She just want to see them.","commenter_a":"Well how is he planning to build this wall!! Without the native America permission he's trying to build on our land (Tohono O'odham nation) nd again there's gna be another treaty broken","post_message":"President-elect Donald J. Trump says he will move to deport criminal illegal immigrants and still plans to build a wall."},{"comment_id":"10152860083811051","commenter_b":"Rene this country still has racism because some blacks won't let it go and grow up And Larry NOBODY wants this president to stay with him tearing down America and acting like a dictator. Remember what happened to hitler???","commenter_a":"Wtf is OBAMA IF NOT A DISGRACE AND EMBARRASSMENT?????","post_message":"President Obama just said that some Senators have become an embarrassment to the United States. And he didn't stop there."},{"comment_id":"10154276902002908","commenter_b":"Juan. Not one illegal should be in this country. Trump is spot on. If you were in someone's house with a fake ID you would be charged with breaking and entering and impersonation and sent to jail. Illegals should be deported and sent back to their country on the spot just like criminals in America are. It's that simple.","commenter_a":"Plus they do like 32% of the actual work","post_message":""},{"comment_id":"10155065257093984","commenter_b":"There is no doubt Israel or Jews were there first. As far back as 2166 B.C., some say as far back as 4000 B.C.. Arabs or Muslims first recorded being there 853 B.C., Mohammad wasn't born until 570 A.D..... The size of Israel is 12,877 Sq. mi. about the size of New Jersery... The size of Arab, Muslim land is 8,368,272 Sq. mi., and consist of 20 countries. That would be the size of putting together (Texas and Alaskas) 8 times.... Over the years Muslims have attacked Israel, even combining countries to fight Israel and have lost every time to Israel's strong military. During peace talks, Muslims have never given up anything to Israel. Whereas everytime Israel has given up land to Muslims, they have used the land to move closer for attacks against Israel. Muslims do not want peace with Israel. They have said they will not coexist with ...","commenter_a":"NBC is one of the least creditable news sources. The beat goes on ! Time to boycott them.","post_message":"Talk about \"fake news!\" Here's how NBC was just BUSTED in a massive lie designed to make people think less of Israel. Here's what they had to say that has a lot of people outraged... This proves EXACTLY how the mainstream media feels about Israel..."},{"comment_id":"10155319348083132","commenter_b":"Jesus this is absolutely heart wrenching","commenter_a":"Rest in peace","post_message":"The 21-year-old mom is being hailed a hero for her quick-thinking in saving her newborn."},{"comment_id":"10156217952900725","commenter_b":"Illegals only make it harder for the ones who have done it legal. If I were a legal immagrant I would u of be pissed off about the illegals. It's not an easy process and considering the economy I'm wondering if it's worth it to them to try to come in legally. Especially with the liberals making all these empty promises.","commenter_a":"Like if you are voting trump 2016!!","post_message":"The debate last night proved that Hillary is running against the “B” team. She won’t be so lucky when it comes to me!"}]
