[{"comment_id":"10154529341826178","commenter_b":"This may be fun! Hillary won't be debating a politician! I see a house falling on her and watching her toes curl!","commenter_a":"Illegals and dead people voting","post_message":"Mika seems so sure of this...#RNCINCLE"},{"comment_id":"10153061482070326","commenter_b":"I don't care who the media whores are in love with or paid to pretend they are in love with. If people would just vote for who they really want to win, we would beat them. Stop listening to the media tell you no one can beat Hillary.","commenter_a":"Thats because the media no longer represents the people. They want to talk about emails, when most of us are worried about just making it. I wouldn't sit down with you either.","post_message":"This is what Hillary Clinton does NOT do with the media."},{"comment_id":"10153509849905329","commenter_b":"Get a grip lady","commenter_a":"Caitlin didn't choose to be born feeling like she was in the wrong body. She's not getting the award for getting surgery, she's getting the award for standing up in a bigoted, judgmental, harsh world and being her authentic self. She is giving hope and courage to thousands of transgender people all over the world and showing them it's OK to be themselves. Who knows how many people she is saving from suicide by being strong enough to go public and be treated with ridicule, ignorance, and hate. She's making a tremendous impact on the LGBTQA community. Courage comes in all forms. Are only the military and first responders allowed to show courage? Is that the only type of courage we're allowed to recognize? I choose to disagree. Of course Noah is courageous, no one is saying he isn't. Of course every member of our military is courageous, but that ...","post_message":"ESPN confirmed to BuzzFeed News there is no such thing as a “runner-up” to the Arthur Ashe Courage Award."},{"comment_id":"831083283688817","commenter_b":"Just a bunch of fat people eating fat food. No incumbents in 2016 november.","commenter_a":"America runs on Dunkin!!","post_message":"Elizabeth Warren repped Massachusetts by bringing Dunkin' Donuts to the House sit-in."},{"comment_id":"1089311434439529","commenter_b":"This surprised me.....even a blind squirrel finds a nut.","commenter_a":"The view sucks all those asswipes on that show should move to Brussels if trump gets elected..","post_message":"\"I can't believe I’m feeling this way...\""},{"comment_id":"10153492061886337","commenter_b":"Probation and a fine is all she may get. Prison you can't be that ignorant!","commenter_a":"This lady is an idiot, commited at least 3 different Federal Felonies... lol dumb broad. Well there's no Rebel flag in prison so she will be happy.","post_message":"GET TO KNOW Bree Newsome, the woman who climbed the flagpole at South Carolina's capitol building and took down the confederate flag..."},{"comment_id":"10153905231158984","commenter_b":"Idiot. She'll find out how wrong this is some day. It might be hot.","commenter_a":"So sorry to hear this....","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ. This is just disgusting. She has a new movie out. Let's make sure she doesn't make a dime off of us!"}]
