[{"comment_id":"526657100877562","commenter_b":"@username that's why I'm voting Jill Stein.","commenter_a":"I'd rather vote for the one who may have evaded taxes than the one who led the charge on foreign policies that killed millions of people and now possibly could cause WW3 by taunting Russia with the no-fly zone in Syria. But I digress...Jill Stein is who I'm voting for because I don't vote for monsters.","post_message":"So, Trump goes around and says, \"Hey, I'm worth billions, I'm a successful businessman, but I don't pay any taxes. But, you, you make 15 bucks an hour, you pay the taxes, not me.\" That's why people are angry and want real change in this country."},{"comment_id":"10153640013936636","commenter_b":"O questo o un procione non voglio altro siamo io e te li vedi li vedi Dio pinolo?!","commenter_a":"Luca sparati in bocca con me","post_message":"Red pandas have an adorable wrestling competition Via Detroit Zoo"},{"comment_id":"1113874841966859","commenter_b":"Beck, that British English is English English, as in the correct way to speak ENGLISH. ;)","commenter_a":"I’m with everyone else, “Learnt”?","post_message":"How many of these were you taught?"},{"comment_id":"10153563776309170","commenter_b":"Oblowme you are such a disgusting pussy!!!!!!","commenter_a":"Of course he does. Anyone surprised?!?","post_message":"Remember: Nothing is ever his fault. The buck, without fail, stops somewhere else."},{"comment_id":"1277527375611846","commenter_b":"@username, and you KNOW she absolutely will DO it, too!","commenter_a":"This election isn't about picking a president! It's about the Law..Yes the Law!!!!USA Law against Sharia law!! Wake up Americans, don't you Dare be fooled,don't you Dare wear the Americans are stupid label, show all those countries out there that your a brilliant Mind and your family will make a smart choice in votes for your Country and what it stands for! God bless our way of life.Amen","post_message":"Anti-Christian extremists are demanding that senior U.S. military chaplains be investigated and punished for praying in uniform. Sign our petition to fight back. We must defend our brave military chaplains."},{"comment_id":"10154449386136336","commenter_b":"Ban Muslims Now!!","commenter_a":"Open mouth insert foot.","post_message":"Last night on “Hannity,” Mike Pence echoed Donald J. Trump’s call for a temporary ban on immigration from countries where terrorists represent a threat to the United States. @webpagelink"},{"comment_id":"998167890303719","commenter_b":" y ayuda tmbn a Los autistas","commenter_a":"Diego Alberto Rodriguez Pesaresi @username","post_message":"Marijuana can literally stop a seizure in its tracks. Like ATTN: on Facebook."}]
