[{"comment_id":"901304566673644","commenter_b":"A woman's right to KILL her alive yet unborn child!!!","commenter_a":"Save the fetus- starve the child. They're not pro-life, they're pro-birth.","post_message":"Accurate."},{"comment_id":"10153697709133984","commenter_b":"He'd never make it to prison if that was my daughter or granddaughter. But since he will hopefully go to prison, its a shame someone never showed him an illustration on a blackboard about the size of your asshole before prison and the size it is when/if you get out. Maybe he would then have had sense enough not to rape a child. When he goes to prison he's going to find out what real rape is like...good.","commenter_a":"Castration sounds good to me. He wouldn't do it again","post_message":"This sick punk raped a young girl and admitted to it... but the disgusting thing is his absurd excuse. Our country is in deep trouble and this proves it... this little girl did nothing to deserve this."},{"comment_id":"10153296674076323","commenter_b":"i can't deal with her","commenter_a":"@username thought you might find this interesting","post_message":"After Frida Kahlo died in 1954, her husband Diego Rivera shut her belongings in a bathroom at their Mexico City home – then demanded it be locked until 15 years after his death. In fact, the room wasn’t opened until 2004. See the full gallery of what was inside: @webpagelink"},{"comment_id":"10154451087971756","commenter_b":"@username That's exactly the kind of response I would expect from a feminist... You don't want to do any of the heavy lifting. There's no reciprocation on the part of feminists because they only care about themselves. Even if I did respond how you wanted, you wouldn't address any of my points and simply make ad hominem attacks. That's all you people are capable of because you have no critical thinking skills.","commenter_a":"To the men commenting on this post that are shaming other men for being feminists: shame on you. You are just proving the very reason why we, as males, have much to benefit from feminism as well","post_message":"The male activists all face roadblocks. Other men might think it's strange for guys to talk about sexual health in public. Women sometimes resent the idea of men offering them information about their bodies."},{"comment_id":"573866436115635","commenter_b":"She'll stand before God. Wouldn't want to walk in her young shoes","commenter_a":"Jennifer who?","post_message":"She's the biggest actress in the world right now, and Jennifer Lawrence has made an absolutely sickening statement about Christians. This is enough for me to want to boycott her movies from now on."},{"comment_id":"10153184324863984","commenter_b":"One dumb ugly bitch","commenter_a":"Dislike this skag.........","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"1666754860284644","commenter_b":"As a veteran educator with 31 years experience, I am appalled by Betsy DeVos's level of complete and utter incompetence. As a parent of a special needs child, I am alarmed and sickened at her flippant discard of imperative federal laws that protect those that cannot protect themselves. Shame on you, Donald Trump, for promoting her, and shame on you, Betsy DeVos, for accepting a position for which you have zero aptitude.","commenter_a":"Once again Senator Kaine, your questioning along with others brought out that she has NO clue. Our children cannot afford to have this kind of management over their education. Scary!!","post_message":"I worry about the effects of a leader who thinks 'government sucks' on the morale of teachers. Disappointed Betsy DeVos does not support equal accountability and IDEA for all schools getting tax dollars."}]
