[{"comment_id":"486444454879468","commenter_b":"I can't stand her either..","commenter_a":"Yes I will always honor and support the Flag of the United States of America!!","post_message":"Michelle Obama just said something treasonous about the flag. This is ridiculous, that flag is the symbol of the greatest nation on Earth. Do you support the American Flag?"},{"comment_id":"977430998961803","commenter_b":"Europe just \"undid\" what the last Christian Crusades accomplished. All who refuse to convert to islam will soon be put to the sword.","commenter_a":"Europe is not the Europe we knew yesterday, history has been made today. Europe will not longer be Europe it is now a Muslim world. We just lost the wonderful world of Germany, France, Spain, England, Poland, Austria, etc. It's sad, the only one fighting for their country is Hungary and I give them a lot of credit, they don't want to lose their Christian faith. And America is next, we will be taking in thousands but the problem is we don't know if we are getting terrorist or good people. All I can say is God Bless us all,","post_message":"Why are the \"refugees\" mainly fighting age men? Where are the women, children and elderly?"},{"comment_id":"1362278090453725","commenter_b":"GET THE FUCK OUT!","commenter_a":"Send them home","post_message":"Muslims Banning 9/11 Memorial Because It’s Racist. They have no respect for the country we live in. Do you think they are the racists?"},{"comment_id":"10155151298004170","commenter_b":"@username And what disappointed me the most was our President never called for people to work together and come together as a Nation. It was like he wanted the divide! So sad for this nation!!","commenter_a":"I figured this out after his first term. If you believe the media, he did a great job. The numbers don't lie. He did zero except stir up racial divide. That is his legacy.","post_message":"Years in office: Eight. Years with GDP growth of 3 percent or better: Zero. The final report on 2016 seals his fate as a historic failure."},{"comment_id":"10153541693114714","commenter_b":"Why is it YOUR business what she does?","commenter_a":"I don't understand why ppl think that it's okay to die \"their own way\". Any way you slice it, that is suicide.","post_message":"\"When I pass, I do not want her to watch me in pain.\""},{"comment_id":"1142853059119585","commenter_b":"So's my father. Personally, I served a three year tour in the US Army.","commenter_a":"No! George Bush was in the service. But no one knows how he got out.","post_message":"Don't you EVER forget this... nor let these Republican chicken-hawks send your children off to die in wars for profit."},{"comment_id":"1153132958040066","commenter_b":"All 3 should be skinned and decapitated!","commenter_a":"And everyone \"outraged\" are all Vegen, right?!! Where is the outrage for the 100's of 1000's of innocent babies murdered every year???!!!","post_message":"The U.S. tourist who who killed Zimbabwe's beloved lion, Cecil, received global condemnation as news spread. Read more here: @webpagelink"}]
