[{"comment_id":"10153329720368701","commenter_b":"They should drop the drinking age to 18 instead. Only Islamic countries are as strict as the US when it comes to drinking age. Raising the tobacco age will simply result in sneak smoking just like raising the drinking age resulted in binge drinking. Adults need to be adults.","commenter_a":"how about the state legislature concentrate on what it was elected to do: keep a balanced budget and not waste taxpayer money.","post_message":"What do you think, should Oregon and Washington follow suit?"},{"comment_id":"1061821787247406","commenter_b":"fact, king obama ignored our federal immigration laws and gave amnesty to millions of illegal aliens including the illegal that killed Kate steinle. had he enforced our laws and put a stop to san Franciscos sanctuary city policies that woman would be ALIVE today. fact, obama blamed cops before the facts came in about doin their jobs. cops were killed after his comments. had king obama stood up for cops and denounced black violence those cops would be ALIVE! wake up Cynthia. who's to blame for this mess? every MORON that voted twice for king obama. 😡","commenter_a":"so when king obama blames police for doin their jobs and cops get killed it's not king Obama's fault? when king obama allowed illegal aliens to invade our communities and then kill innocent Americans like kate steinle it's not king Obama's fault? you leftest are MORONS and HYPOCRITES. 😄","post_message":"\"People have to understand that hateful rhetoric and words and harassment of doctors and harassment of women going to health centers have real implications.\" -Planned Parenthood President Cecile Richards"},{"comment_id":"10153353653386051","commenter_b":"Get in his ass!","commenter_a":"No more tacos or carne Asada for this loser.","post_message":"This man killed a police officer – and then laughed about it. Here's what happened to him in Texas yesterday. Do you consider this justice served?"},{"comment_id":"10153678796416491","commenter_b":"If its a libby female like killary, she'll be fine on the side of the road ;-)","commenter_a":"Dude. You left a lady on the side of the road. I don't know how you were raised, but someone needs to kick your teeth in.","post_message":"The driver said the woman was “obviously a socialist”"},{"comment_id":"10156198873145354","commenter_b":"Screw Faux News and that bitch Megyn Kelly.","commenter_a":"FOX is decending to a new low leval! I used to have it on all the time but now i will just tune in for one program!","post_message":"We have the intense Twitter exchange between Donald Trump and National Review editor Rich Lowry. Read the tweets!"},{"comment_id":"876377039127570","commenter_b":"Hopefully the \"treatment\" is the same pain & suffering the little girls had to endure","commenter_a":"There is sex offender treatment in prison?","post_message":"Nicole Vaisey, 26, and her boyfriend, 40-year-old Stephen Howells, admitted that they kidnapped the two Amish girls."},{"comment_id":"10154684991066077","commenter_b":"Women are awful","commenter_a":"If it was Chelsea Clinton line every talk show news media blah blah blah would be wearing them...funny Ivanka isnt even a republican.","post_message":"The decision to drop the line, which is owned by the Trump Organization, follows last week’s move by Nordstrom to discontinue sales of evocative Trump’s fashion brand."}]
