[{"comment_id":"10153618824494778","commenter_b":"Lol jk","commenter_a":"At least we don't recruit murders us losing having killed anyone can the patriots say that....stfu period.","post_message":"Last summer, #Redskins Daniel Snyder said during an interview that the team was exploring the possibility of a new stadium. Now they're asking season ticket holders for input."},{"comment_id":"10154551778899411","commenter_b":"@username You are a troll ass bitch.. You are as disgusting as the photo of your ass in your profile.. punk...","commenter_a":"I wouldn't get \"teary\" about it. Lol. Trump is digging his hole deeper and deeper the more he opens his big know nothing mouth! This draft dodger accepted a purple heart from a Vet who \"earned\" it which is as low as you can go. Than after that he kicks a crying baby out of his event. Trump will do himself in without anyones help!","post_message":"Mr. Smith told news.com.au that Mr. Trump's \"fat pig\" comment illustrated a \"darkness in his soul.\""},{"comment_id":"10152997127479330","commenter_b":"Oh my now there going to ban scissors.","commenter_a":"Oh my god scissors are bad the scissors just killed someone ban the scissors","post_message":"A horrifying story out of California… Police say a 15-year-old boy was stabbed to death with a pair of scissors right outside a middle school in LA. Now authorities are trying to figure out what led up to the deadly attack ---> @webpagelink"},{"comment_id":"10153315514576336","commenter_b":"That turbofan jet engine intake is sturdy enough to handle the weight of that woman. Also, her derrière is not going to effect the shape of the intake. It is designed to handle air pressure from 250 knot IAS relative wind that at altitude could be as high as 550 knots TAS. So, what's the big deal? I think the picture looks COOL!!!","commenter_a":"I do not think so. The preconditions are whether the company has the clear policy for it, whether she got enough training of behavior in the company?","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10153642344498132","commenter_b":"You can put lipstick on a pig but, it's still a pig!!","commenter_a":"He looks kind of mean as a woman :(","post_message":"Caitlyn Jenner, can we borrow that mini?"},{"comment_id":"10153092001211037","commenter_b":"Divina there must be some way around this.God it would be a sin to put an animal down for no good reason ! Some Humans are the worse I tell you. Try talking with her when ever she has her bouts. I had one like that too and then again for heavens sake if it's not often then what is the problem she is a dog and that's what they do. Ugg I hope something else gives them reason to move faraway from you.","commenter_a":"Naomi get a pellet/ BB gun pump it 3 times hit that dog a couple time it won't bark anymore. It doesn't break the skin nor leave marks ( I know this for a fact) but will shut them up.","post_message":"A North Seattle woman faced a lawsuit from a neighbor alleging her dog Cawper’s barking was intentionally causing him “profound emotional distress.” The neighbor wound up winning $500,000 by default because she did not challenge his claim. Would you sue your neighbor over a disruptive pet?"},{"comment_id":"10154937889184885","commenter_b":"She hates white people","commenter_a":"Such hateful petty people. A day after celebrating the birth of your savior and half of you aren't following his example in the slightest. You should be ashamed, but I doubt you really are. Michelle Obama is a human being. Just like you and me. What ill will has she done to you, that you would meet her with such contempt? I am no Trump supporter and I worry about his lack of qualification, but I don't say mean, hateful things about his wife. If she is going to work on internet bullying she may need to start with those that support her husband.","post_message":"\"She's made an effort to wear accessible fashion,\" designer Tracy Reese says. \"I think Jackie (Kennedy) was a great role model but she wore a lot of couture, and things that most Americans could not afford.\" Mrs. Obama, she says, has worn both high-end and moderately priced fashion."}]
