[{"comment_id":"1324023564281057","commenter_b":"FUCK YOU FUCK sharia law GO HOME ALLUH FUCKTARDS","commenter_a":"It is so wrong","post_message":"Florida Democrats Approve Bill That Imposes Shariah Law On Women. You can't force your religion on other people. Do you think this wrong?"},{"comment_id":"841765072552278","commenter_b":"Shoot to kill. This is the only way to stop these people","commenter_a":"I support the police, but I do not think that was the time or place for protest...RIP Officer Liu","post_message":"UNREAL: Here The Disgusting Thing Race Rioters Did To The Widow Of Fallen NYPD Officer @webpagelink"},{"comment_id":"557055264492970","commenter_b":"What scum bunnies.","commenter_a":"It should be simple, if you don't vote, then don't complain! But it seems the ones who didn't vote, are the ones crying, whining, rioting and be rude!","post_message":"\"That's sort of amusing,\" Donald J. Trump senior adviser Kellyanne Conway tweeted."},{"comment_id":"10153443482053352","commenter_b":"He knew that bitch was cazey","commenter_a":"Idk what to say bout him, i know personally a man who loves n does for his kids, but his child's mother does not let him take his son ANYWHERE, n will continuously say he sick or he can't go, but always calls when he needs shoes or something and holidays.. So i can't judge him. Also just because ur behind on child support doesn't make u a deadbeat, you can be behind while making payments still!! Its sad what this family has to go thru but not everyone is educated on their parental rights or can afford court! I just feel sorry for the kids n the family.","post_message":"Dad of Kids Found Dead in Freezer Comes Forward #TRENDING"},{"comment_id":"10154018738645736","commenter_b":"Isn't that gorgeous.","commenter_a":"We need some housing Kate Brown.","post_message":"People are still flocking to the Beaver State."},{"comment_id":"10154047129019749","commenter_b":"then they wanna face Russians? :D :P","commenter_a":"Victoria","post_message":"Graduates from Norway's Royal Naval School in Stavanger have shown the Internet they can do more than just march in formation."},{"comment_id":"10152975467087232","commenter_b":"Would you like them to put a gas grill up there! Get a life California your state has more problems to deal with other than a treehouse","commenter_a":"Their property it should be their choice","post_message":"This California family's treehouse is pretty sweet! But a judge ruled it has got to change. DETAILS---> @webpagelink"}]
