[{"comment_id":"10155004778474136","commenter_b":"This woman is a nut case.","commenter_a":"Skimmers...","post_message":"\"I think he is leading himself into that kind of position where folks are beginning to ask what are we going to do and the answer is going to be, eventually, we have to do something about him,\" Maxine Waters waters said of President Donald J. Trump. FULL STORY: @webpagelink"},{"comment_id":"10156293544295354","commenter_b":"@username why don't you move to the UK where you will be safer after all criminals don't have guns because they are illegal there and everyone know criminals obey gun laws .","commenter_a":"I'm a huge 2nd amendment advocate and there are 1000 reasons why the gun control crowd is wrong, but I really don't care for this particular argument. Public people are at more risk than private people to become victims of crime. Any of us can become victims of random crime, stalkers, etc., but overall, the public officials and celebrities draw more risk in that regard. Hillary is so loathesome and widely despised, she probably would have been gone long ago if not for that armed security. I, OTOH, just recently bought my first gun and didn't piss off anyone enough to want to kill me. I like to use that famous Japanese quote in WWII as to why they didn't even consider invading the U.S. - \"Invade the U.S.? Impossible, there's a gun behind every blade of grass\". Our guns keep our nation safer and serve as, I hope, some ...","post_message":"Hillary Clinton: If you truly believe guns don't save lives, why do YOU have armed security protecting YOUR life with guns? We regular folk can't afford to live in million dollar mansions like you and Bill do. Why don't you want us to protect OUR families and children with guns when you use them to protect yours? Signed, AMERICA"},{"comment_id":"678517065647894","commenter_b":"#TRUMPPOTUS Save America from wussies!","commenter_a":"When is NBC going to start posting about the latest Wikileaks stories?","post_message":"\"I regret coming to the Trump support event, and in particular allowing my son to be a part of it,\" one donor said."},{"comment_id":"10154376306546636","commenter_b":"She did? She'll never get out of prison.","commenter_a":"She got off easy for mowing down people terrorist style. Or maybe they got the idea from her idk","post_message":"A woman accused of a deadly crash that claimed four lives during a homecoming parade in Stillwater has accepted a plea deal."},{"comment_id":"10152883601267452","commenter_b":"cat gets hired and I can't as a college graduate.","commenter_a":"Miriam Salinas Lupita Mary Reyes","post_message":"A startup company in Romania has hired a cat as their new communications manager. @webpagelink"},{"comment_id":"10153906891941051","commenter_b":"When you don't treat a woman right - she will do you wrong.","commenter_a":"Wish I had not read this.","post_message":"A man came home early only to find his wife in bed with someone else. The worst part? It was with the absolute last person he'd ever expect to find her in bed with."},{"comment_id":"1004293156333603","commenter_b":"Truth hurts if ou weren't an illegal you wouldn't have taken offense.","commenter_a":"Keep them out the US we have enough problems with illegals already. Deadbeats sucking the economy dry","post_message":"This year, nearly 200,000 people have landed on Greek shores, another 110,000 have arrived by sea to Italy and more than 120,000 by land to Hungary. Germany has just announced that it expects to receive 800,000 asylum applications in 2015."}]
