[{"comment_id":"10153814359479411","commenter_b":"@username I don't have sex with animals unlike yourself.","commenter_a":"A monkey is still a monkey, even if you put a suite on it.","post_message":"Coming soon on RT Documentary - Congo's kings of style."},{"comment_id":"10153933655437098","commenter_b":"Lol imagine you get off work,headed to your car,next thing you see,a perver having sex with your car lol","commenter_a":"The article doesn't make it clear if he owned the van or not?","post_message":""},{"comment_id":"10153725146380667","commenter_b":"no one cares I'm tired of heading about him","commenter_a":"People get punched in the face everyday.","post_message":"“He said he was going to kill me.\""},{"comment_id":"10155442182635615","commenter_b":"Fix that damn grill! She looks like a damn key maker!","commenter_a":"get a new haircut, for starters...","post_message":"What do you think they should do with it?"},{"comment_id":"817179565047318","commenter_b":",the problem is that these companies take too much Shit from their UNRULY customers.Customerst first..What about employees?","commenter_a":"The manager did NOT make the right call which is why they are out of a job!!!! You don't reward bad behavior. Companies don't have certain people to service certain customers!!! You have problem resolution departments or resolution specialist but in this case the customer was the problem!!! Options being \"mam we can certainly deliver your item(s) or we can refund your money but we do not have special delivery people\".","post_message":"The driver says he was told \"you are black, and they don't want you at the house.\""},{"comment_id":"1137553239588633","commenter_b":"I will not vote for Hi$$ary under any circumstances in November. It will not come to that because Bernie will win as he has the people behind him. They have done everything to suppress Bernie but they will fail. If she steals the nomination with the help of the corrupt DNC and the corporate media then please do as I and many other liberal progressives and take the Bernie or bust pledge. It is way past voting for the lesser of two evils. I refuse to be bullied into supporting her when I know that she is basically a GOP lite and if she is nominated we will lose. I will not help her and my vote is not for sale. So if it ever comes to that, I will cast my vote proudly in November for the only candidate that supports me - Bernie Sanders . I will do ...","commenter_a":"I'm not voting for Bernie as much as I like him only because I'm afraid it will be wasted. He's great but I don't believe he'll be elected. I'm going to lose it if Trump gets in","post_message":""},{"comment_id":"762776387211747","commenter_b":"Eu vir isso acho que quinta feira, incrível né❤","commenter_a":"Helton Carlos","post_message":"You can now turn your drawings into real clothing."}]
