[{"comment_id":"10153733130168855","commenter_b":"What an ugly hag.","commenter_a":"Its going to take gallons and gallons of makeup to hide her superficiality...","post_message":"\"Caitlyn Jenner wants attention, and she doesn’t especially care who’s harmed as a result.\""},{"comment_id":"10153331151986336","commenter_b":"Take her out Carly . We need a trustworthy Woman in the whitehouse.","commenter_a":"Thanks for sharing this I will be praying God will greatly use Carly .","post_message":"\"Hillary Clinton has demonstrated over and over again that she is not transparent. She will clearly be the [Democratic] nominee, and somebody must take the fight to her.” – Carly Fiorina"},{"comment_id":"749306348569686","commenter_b":"@username - free cell phones started under Bush administration, food stamps under FDR.. try again.","commenter_a":"He is a real man.Best president with class and a brain. That'swhat make people hate him because he has education . and know how to be humble even when haters come along with silly response. HATERS","post_message":""},{"comment_id":"10153625958496636","commenter_b":"This is why women shouldnt get involved: too emotional. Lets let everyone in...","commenter_a":"The Germans now are having a worse affect on Ireland than nazism did. They are diluting the nation state with mass immigration.70 million muslims from Turkey given visas, austerity and cheap labour frrom countries that should never have been allowed into EU.Dole tourists bleeding us dry . Most importantly our individuality is being merged into a multicultural nightmare","post_message":"Freedom is in decline across the planet"},{"comment_id":"1413445192014321","commenter_b":"You girls are funny!","commenter_a":"Come on! This is his ploy to try and intimidate Clinton and throw her off her game. Who's he going to announce next? Monica Lewinsky as Secretary of State??","post_message":"This couldn't be worse."},{"comment_id":"10152792589201051","commenter_b":"Yes she should get surgery. Just wire her mouth shut","commenter_a":"Well if she would close moth once in awhile and watch what she eats she would not have to have surgery. I know it's the tax payers fault.","post_message":"This teen and her family have just one request for taxpayers."},{"comment_id":"10155415846376509","commenter_b":"Money time you know it","commenter_a":"Vinny","post_message":"New video shows power lines exploding on Merritt Island, Florida, as Hurricane #Matthew lingers just offshore. More footage from Florida as Matthew hits: @webpagelink"}]
