[{"comment_id":"10154816797908812","commenter_b":"There's a pattern here Trump women seem to be dumber than crash dummy's","commenter_a":"She means softer because he hasn't had as many scandals and the extent of those scandals would be scary enough facing the press. I would definitely start coughing if I were in her shoes...she could pretend to faint again just as the van arrives and that way she can be saved from her own embarrassing actions. Being held accountable to the public is not in her best interest.","post_message":"The Trump campaign’s major concern: The candidate’s limited preparation. The Clinton camp’s biggest worry: That Donald J. Trump will be asked softer questions than Hillary Clinton."},{"comment_id":"1425850460773794","commenter_b":"She has obviously got a different understanding of Constitutional law than most citizens!","commenter_a":"Please go eat some cyanide soup...","post_message":"She is not fit for public office. Do you agree?"},{"comment_id":"982612308510776","commenter_b":"@username killary LIED to the FBI, congress and all of America, she's perhaps the BIGGEST LIAR and MOST CORRUPT politician ever in America, she cares for NO ONE but herself and power, wants OPEN BORDERS, over 600 thousand more refugees to come into this country, continue obummers FAILED agenda, supports abortions up until time for birth and you support her. Neither candidate is a good choice but a vote for killary is a vote to destroy America, soon socialism and like obummer she supports the New World Order, please open your eyes and use some common sense before you vote to destroy America","commenter_a":"No, Hillary is not completely rattled. She's going to win in a landslide and is now closing in on a Democrat-controlled congress. You all need to get real, regroup, and try again in 2020. Good luck.","post_message":"Hillary is completely rattled after Trey pulled this out... It's over. No one can hide from him. Let's him know he's not alone. Can we get 30,000 'LIKES' for Trey to bring Hillary to justice?"},{"comment_id":"1096205787130648","commenter_b":"this bitch looks horrible","commenter_a":"He sure doesn't call the Super predators you pos","post_message":"...says the woman who trashed tens of millions of working class Americans."},{"comment_id":"1068974126482547","commenter_b":"@username, that is so true! WHORES ARE NOT WOMEN!","commenter_a":"Obama by far has been the worst president this country has ever had. He put America straight into the crapper. If Hillary gets elected she's going to pull the handle.","post_message":"We need to elect men and women who uphold the Sanctity of Life!"},{"comment_id":"1086205424749133","commenter_b":"where?","commenter_a":"For the most number of angry emoticons sent","post_message":"Watching the world-record-setting longest hoverboard ride."},{"comment_id":"718057805010847","commenter_b":"He looks like he deserved it","commenter_a":"Aimee Lewis @username","post_message":"Good job"}]
