[{"comment_id":"1382411831811576","commenter_b":"No reason to make threats or warn the Racist idiots..........when they start a ruckus, we'll bury them!","commenter_a":"..and people like you want to start a race war. You can't win that one...","post_message":"@webpagelink"},{"comment_id":"10152760483166051","commenter_b":"I guess she rubbed them the wrong way......","commenter_a":"They didn't arrest her but they issued her a citation.","post_message":"Police took one look at the video this girl posted from the Oregon State University library and arrested her immediately."},{"comment_id":"1597744450278312","commenter_b":"Needs the money for Muslim refugees AKA Isis terrorists!","commenter_a":"IF this true, I will be willing to bet that none of those being cut are democrats! JACK","post_message":"Americans will soon find out that they’re not getting the money that they were promised..."},{"comment_id":"738159049657328","commenter_b":"I think that crooked, lying, evil bitch needs to be in prison","commenter_a":"K, this bit%h is really out there! She and her cronies want total power! I pray that God stops her!","post_message":"WOW. People NEED to listen to Hillary's response when asked if an individual's right to bear arms is a constitutional right... Do you think Americans should be scared of a Hillary Clinton presidency?"},{"comment_id":"10153897303435329","commenter_b":"Some girls are bigger than others","commenter_a":"You can open a bottle with any edge. Lighter, desk, door jam, bike pedal","post_message":"How To Open A Bottle With A Cigarette Lighter"},{"comment_id":"10152604943386615","commenter_b":"Ladies*","commenter_a":"It depends on if you see someone at the gym wearing them, or someone at Walmart...","post_message":"Lawmaker says yoga pants should be illegal: @webpagelink"},{"comment_id":"924171167620224","commenter_b":"It has to be big for him to screw this entire nation. Very very sad.","commenter_a":"What do you think this administration has on Justice Roberts that would make him vote twice for a law that is unconstitutional...","post_message":"John Roberts again sides with Obama."}]
