[{"comment_id":"474050886118825","commenter_b":"Good Idea !!!","commenter_a":"If a Muslim man sees a naked woman other than his wife, He must commit suicide. There for, call for a father daughter dance instead of having Easter, have all the Playboy Bunnies show up naked! Problem Solved!","post_message":"Muslims force this school to ban Christian holidays. America is under attack, this is treasonous. 'LIKE' if banning Easter is WRONG!"},{"comment_id":"10153575061332411","commenter_b":"I Won't Vote For Kirk, Either!!!!","commenter_a":"Oh come now, he's a multi-billionaire businessman he knows how to talk nice when he needs to","post_message":"\"Trump has not demonstrated the temperament necessary to assume the greatest office in the world,” Kirk said in a statement."},{"comment_id":"1007448135988608","commenter_b":"Lmao ik ik fr","commenter_a":"Me back in my days with the chancla 😂😂 @username","post_message":"Escape plan master"},{"comment_id":"10153564847120530","commenter_b":"The father had been living in Israel when this divorce started years ago (I believe I read he currently lives in the states though) and left for a two week business trip the day after the kids were sentenced so he obviously has no time for his children that he \"cares so much to have a healthy relationship with\". He's a bad dad, the woman is a bad mom and this judge is a joke.","commenter_a":"She said all you need to know - that this was an EXCEPTIONAL case - and that there was a disgusting pattern of mental abuse/programming by the mother towards the father. Unless you are a family member who has lived through something like this, you have absolutely no idea what damage can be done to the children permanently. In our case, the The fathers children passed away from a unknown heart disease very young, and those children will never get the chance for any kind of reconciliation with him. The mother is a hateful woman, and her daughters now have no relationship with the father's side of the family because of her. The only the kids may EVER have a chance to not be screwed up permanently is by doing this. Blame the parents? What good has that done? There was cause for extreme action here - and the judge ...","post_message":"\"I wanted to do this because of your horrific behavior a long time ago and your dad begged me not to.\""},{"comment_id":"10152936625961491","commenter_b":"She's as brainwashed as the rest of that family. Very sad.","commenter_a":"Why did his wife marry him? WHY????","post_message":"\"What was Duggar’s political value for Family Research Council, his moral example, has now become a cost.\""},{"comment_id":"950334638377899","commenter_b":"Put this bitch in jail","commenter_a":"Clinton should be in Jail.","post_message":"Hillary Clinton says the Republican party's hatred for President Obama crosses political lines and is simply disrespectful. Do you agree with her?"},{"comment_id":"902484503120305","commenter_b":"She will never be a first lady! She spouts her mouth in the wrong direction! Lady you are suppose to set an example for red white black brown or any other color of people in United States! Instead you keep things stirred up, you and your so called husband!!","commenter_a":"Oh, she is the racist. She hate her own kind. Disgusting.","post_message":"Jaw-dropping!"}]
