[{"comment_id":"1782906415286798","commenter_b":"Old bitch","commenter_a":"I have to believe this woman is mentally ill. I can't find any other way to wrap by head around it. I mean can sane people be this cruel?","post_message":"So awful."},{"comment_id":"1142306435836110","commenter_b":"What a piece of shit! And fuck the judge that his mommy and daddy paid off!","commenter_a":"White privilege at its best","post_message":"Man charged of raping 2 unconscious women only gets probation and won't have to register as a sex offender! #WSHH #SMH"},{"comment_id":"10153519316691037","commenter_b":"Disney isn't on my list of good companies either. They are firing Americans and hiring ILLEGALS. Really?","commenter_a":"Whatever happened to statute of limitations? If he did this, I certainly don't condone it, but this was 40 years ago.","post_message":"Disney's decision comes after court documents from 2005 were unsealed"},{"comment_id":"10157534463145354","commenter_b":"Ass holes","commenter_a":"Tell the Lebanese to get the F off","post_message":"Antisemitism mars Rio Olympics... “The 2016 Olympics – a disgrace!!”"},{"comment_id":"10156296694950293","commenter_b":"If all the grandkids reproduce themselves it could happen.","commenter_a":"The will be you soon @username","post_message":"A sweet story this morning. A grandmother hangs nearly 70 stockings on her wall every Christmas. Tell us about the traditions your family has!"},{"comment_id":"956693264446697","commenter_b":"If my 2 daughters were still in school now and this begins I would not send them to public school it would be private or at home its just not safe, I don't have a problem with transgender boys don't belong in giur!s bathrooms and visa versa","commenter_a":"Wow..that's a big problem..!..put a extra bathroom in for Transgender..simple..problem solved..","post_message":"President Obama recently said all public schools must allow transgender students to use the bathroom of their choice. Let us know your thoughts below:"},{"comment_id":"10153622787011336","commenter_b":"Michelle Obama and Obama need to go!","commenter_a":"Both the schooling and the feeding of the children of the USA should remain at the local levels. We don't need an untrained fool to tell us how to raise our kids.","post_message":"Public schools are continuing to serve the federally mandated fruits and vegetables, but a new study claims the fresh produce is going into trash cans more than tummies."}]
