[{"comment_id":"10153291171784203","commenter_b":"Jews and fat women.","commenter_a":"Yeah, bring back the jokes about Gays and Blacks.","post_message":"Why can we all grow up and just let comedians be comedians again?"},{"comment_id":"1191081784242503","commenter_b":"Can't we just put her in jail already?","commenter_a":"Ostensibly, this woman is a public servant whose salary is taxpayer funded. Her bigotry is flagrant and she has chosen to behave in a lawless manner and not serve the public. She is not adhering to her job description and thus is to be held accountable, as are those in the County and Republican Legislature who are condoning this assault on civil rights. Therefore, she, County administrators, and the Legislature need to be served with a large lawsuit.","post_message":""},{"comment_id":"1576836375956014","commenter_b":"And yes, you will pay for that f'n wall!","commenter_a":"Fox apologized to Trump and invited him in May. He is a liar","post_message":"The former president of Mexico, Vicente Fox Quesada, says Donald J. Trump is using his visit to Mexico with President Enrique Peña Nieto to boost his sinking poll numbers. @webpagelink"},{"comment_id":"10154427228206162","commenter_b":"Clearly the women in this case is at fault she bought the cheaper tickets and tried to pull a fast one.","commenter_a":"Leave it to ABC news to make a bigger deal out of a story than what it should be.","post_message":"A mother was devastated after she and her five children were forced off an Amtrak train in the middle of the night. READ MORE: @webpagelink"},{"comment_id":"636474266540179","commenter_b":"She's an idiot!!","commenter_a":"I watched her speech on the live stream and was absolutely blown away. Credit is definitely due to the writer, but Ashley's delivery was perfect. The emotion as well as strength behind those words brought tears to my eyes!","post_message":" am nasty like Susan, Elizabeth, Eleanor, Amelia, Rosa, Gloria, Condoleezza, Sonia, Malala, Michelle, Hillary! Ashley Judd at the Women's March on Washington"},{"comment_id":"988452247844232","commenter_b":"If you have a daughter tell her to free her nipple in public and the pervs will come flocking to take pictures. Which will be legal if in a public space. Maybe you should look up Voyeur on pornhub or something and girls of all ages are being creep'd on.","commenter_a":"These sexist comments are appalling. Especially from the women. Keep letting society tell you what's proper and where your naked parts belong. As long as I'm concerned breast were designed to feed a new born. A man can do whatever the hell he wants but a woman has to be restricted to pretty much anything that might make her comfortable because revealing clothing means she's \"asking for it\" and showing her nipples, which are both called the areola on both men and females by the way, would just make men go into a frenzy. Instead of instilling this belief that breast and skin of women are meant to appeal to the eyes of men, teach men and instill in them self control, consent, and respect for women.","post_message":"Here are the nipples so scandalizing that Facebook won let us show them to you. (To see the uncensored version, click here: @webpagelink) #FreeTheNipple"},{"comment_id":"1561884050498286","commenter_b":"Build the wall !","commenter_a":"Regardless who wins this election... I would NOT live anywhere else but the U.S.A. We may have our differences, but at the end we all work together. It what's makes this country powerful.","post_message":"BREAKING: Hillary Clinton casts her ballot on #ElectionDay in Chappaqua, New York. Full coverage: @webpagelink"}]
