[{"comment_id":"10154066489172994","commenter_b":"Can I suggest a clip?","commenter_a":"Beyond a reasonable doubt. They have him , his gun, and a half dozen witnesses; he even pleaded the 5th. go figure. He wouldn't even get a chance to pray with me. One BULLET to his head, ok , 2 , just to make sure.","post_message":"Body found in a burned-out house in Detroit confirmed to be the mother of the missing 4-year-old girl -- the subject of the Amber Alert sent out this weekend. Police said the injuries were so severe to the second body thought to belong to the daughter that a positive ID could not yet be made. @webpagelink"},{"comment_id":"864523933643860","commenter_b":"Judy. Are you really that stupid? She's a doormat that stayed with a moral less husband for decades just for power. You have low standards.","commenter_a":"Hillary is such a threat to them, they will do anything to hurt her.","post_message":"“Secretary Clinton used one email account when corresponding with anyone, from Department officials to friends to family. A month after she left the Department, Gawker published her email address and so she changed the address on her account.” -Clinton attorney David Kendall"},{"comment_id":"1529182653808525","commenter_b":"yep, paid lazy fucks, how about we let the illegals stay and ship thse shitbags back","commenter_a":"Liberals out to break this country and doing a very good job at it communist or stand together","post_message":"Are you KIDDING!?"},{"comment_id":"1734008936814080","commenter_b":"Kill them all with the wall","commenter_a":"Now time to sue the ones that let this happen","post_message":"Unacceptable..."},{"comment_id":"10155284668713268","commenter_b":"Who the fuck cares, did it have anything to do with this country?","commenter_a":"How long before he has a stroke a day realizes he is being uaed","post_message":"\"This is a direct attack on [Pres. Trump's] policies and her [Ivanka Trump's] name,\" Press Sec. Spicer said on Weds. regarding Nordstrom's decision to drop Ivanka Trump's fashion line. @webpagelink"},{"comment_id":"960437774039688","commenter_b":"Get the delegates and you win.. How would they screw him if he gets the necessary votes?","commenter_a":"If after winning FL, MO, NC and IL, Trump does not get nomination, Rubio and Kasich do not drop out... I with all my family and friends will never vote for GOP.. We will be life time democrat..Trump is better than all GOP candidates , if not trump than Clinton or Bernie is fine for me because GOP does not count out votes as votes... They want to do what they want.. They don't hear our voice...","post_message":"\"Donald Trump is one of the two most talented presidential candidates any of us have covered.” Mark Halperin Bloomberg Politics Managing Director Editor"},{"comment_id":"513918755467368","commenter_b":"Screw that fat ass bitch","commenter_a":"Her and the view should of been gone long ago","post_message":"Joy Behar took a turn attacking the mother of the Benghazi victim. #RNCINCLE"}]
