[{"comment_id":"523969991126914","commenter_b":"That's the whole purpose of the melting pot. To asimilate and not for every culture to impose their beliefs on the rest of the country, loyalty to the people and to the American flag.","commenter_a":"Get them the he'll out of our country !!!","post_message":"A lunch lady was fired for serving pork to a Muslim student. We are in America, give that poor lady her job back. Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"10153368767146694","commenter_b":"Those were not feminists, those were trolls.","commenter_a":"Meh to all the feminist crying. If you hate her characterization, you don't have to force the entire female gender into the issue. Also, the action figure industry is asinine. See how it screwed over Green Lantern TAS and Young Justice.","post_message":"Let's talk about The Avengers' Black Widow problem."},{"comment_id":"10154871308810586","commenter_b":"Oh it was Bakersfield, now I get why it happened.","commenter_a":"Brooke, I bet this is my problem!!","post_message":"“They said it’s just fat, you’re just fat…it’s just fat developing there,” the man said of the benign tumor that doctors now believe likely started due to an ingrown hair."},{"comment_id":"1259707477396285","commenter_b":"@username a much better caption for that sound","commenter_a":"Ali Finneran","post_message":"Once you hear it, you can’t un-hear it. It will be forever with you. Just a warning."},{"comment_id":"821054791362772","commenter_b":"Keep your smug ass out of Texas !! YOU are NOT wanted here !!!","commenter_a":"Barff, She is in it for Hollywood, Wall Street and anyone with money who dumb enough to fall for that LIAR THIEF, DOUCHBAG!!","post_message":"This has to be said. Last night AP declared Hillary Clinton had garnered enough delegates -- by way of super delegates -- to secure the Democrat nomination for president. Everyone is expressing how this is a great historic moment. I agree, it is a historic moment. The new American Socialist Party, once known as the Democrat Party, now has a sitting president and a nominee for president who abandoned Americans to die and lied about it. And to all the detractors who would dismiss this, just think about the mother of Sean Smith widow and orphaned child of Tyrone Woods.and the families of Ambassador Chris Stevens and Glen Doherty. This is not a historic moment for them. It is an indictment of how America rewards the most despicable and abhorrent behavior. This is a sad day for our America -- well, at least for the mindless Kool-aid drinking sycophant followers ..."},{"comment_id":"1043726442390274","commenter_b":"We have our own problems here, send em to other Arab countries","commenter_a":"Not only a great actor, but an absolute class act.","post_message":"\"The show was fantastic, but you left in tears after [Benedict Cumberbatch's] speech. It was very eloquent, emotional, and beautifully put … He gave a 4-letter word to the politicians and said, ‘We’ve got to do something about it.’” - Rachel Martin, audience member"},{"comment_id":"10154273166073445","commenter_b":"Justin Ruffino build that wall!","commenter_a":"Hilarious!","post_message":"Role Reversal. Mexicans Are Smuggling American-Grown Weed South of the Border."}]
