[{"comment_id":"10152700491620779","commenter_b":"Heavens to Betsy, woman. Have you tried Fortitude?","commenter_a":"Thanks @username. I'm currently watching BB. Yes, I really am.","post_message":"Let's face it: We are currently living in the all-you-can-eat-smorgasbord era of TV viewing choices. The downside is that the abundance of stuff at our fingertips also makes it easier for jaw-dropping, mind-expanding small-screen masterpieces to come and go without so much as a peep. From a British gangster thriller to a surreal riff on twentysomething single life, click through for 10 shows you should be watching this year."},{"comment_id":"10153897505943812","commenter_b":"Closing borders will do nothing. Wake up. If they are going to get here, they will. Hell we already have our own killers","commenter_a":"This is going to continue. This will be the US one day. Mark my words. How do we know if some of these refugees coming in are not Isis and just waiting for the word to strike? What do you think now Mr President?? Borders need closed","post_message":"BREAKING: The terror group ISIS today released a statement claiming responsibility for the horrific, apparently coordinated attacks in Paris Friday that killed more than 100 people: @webpagelink"},{"comment_id":"10153481340240575","commenter_b":"This should be a crime!!!!! Go to hell!!!","commenter_a":"This is a BLACK DEVIL HE NEEDS TO BE EXTERMINATED!!!!!","post_message":"The Gateway Pundit - Farrakhan Shouts “Allahu Akbar!” and “White People Deserve to Die” In Latest Sermon (Video)"},{"comment_id":"533146616873631","commenter_b":"She is a racist nigga pig","commenter_a":"Not that he's is so bad give up the race crap","post_message":"I AM SICK AND TIRED OF THIS BS..."},{"comment_id":"885210571612122","commenter_b":"@username i don t oppose military service because it is a viable way of deliveribg values that civil life doest provide However higher education and military should not be related whatsoever That correlation damages both the military and education And if you compare US army with any army in Europe you will see that your army is overproportionated with your needs","commenter_a":"When the army pays you college it is still your taxes that are being spent alongside with the expenses of the army which benefit the gun and army providers who become richer as long as your country keeps uninterruptly wars to feed their greed You prefer the perpretuation of war than the education of your youth and that is sad","post_message":"I can tell it went viral for a few reasons... ;)"},{"comment_id":"1282558331837218","commenter_b":"\"Accidently\" lol fucking worthless Muslim and dumb bitch.","commenter_a":"Lies way less maybe but on a much higher scale lady. Really how does she sleep at night knowing she wants to butt fuck half the country and rape our military. I look at that bitch and I cringe bc she just says hello kindly and you know she is lying.","post_message":"Another day, another Trump lie debunked."},{"comment_id":"1755875524653363","commenter_b":"The real coruption and illegal a tivities existing in this administration are the issues, but you are to cowardly to address them. Payments have already been made for Hillary to continue to play her corrupt anti American game. It is easy for the Clinton crime family to justify their dark Anti American activity. The message to her foreign friends antagonistic to the United States, and those buying positions on our taxpayer payed government payroll; Hillary is still open for bribery. Trying to rationalize their evil destructive behavior is despicable. The present administration and Hillary, studied, we're mentored, and follow the agenda of the most corrupt genocidal ideologies on earth. National Socialism, Communism, and Islam. Combined these ideologies have murdered and plundered close to a billion human beings. So why would any sane person with good intentions follow any of these ideologies? They would not, but the Clinton's do. The death, ...","commenter_a":"I've heard a lot of people say they used to like Beck but now they think he is completely bonkers.!","post_message":"Glenn Beck harshly criticized Breitbart executive Stephen Bannon, who is now the CEO of the Donald Trump campaign, saying that Andrew Breitbart himself is “spinning in his grave.”"}]
