[{"comment_id":"1161299523890076","commenter_b":"overly politically correct, nail on the head!","commenter_a":"he offered no defense...merely doubled down","post_message":"\"I think the big problem this country has is being politically correct. I've been challenged by so many people and I don't frankly have time for total political correctness and to be honest with you this country doesn't have time either.\""},{"comment_id":"10154607163603124","commenter_b":"Awww! You know me","commenter_a":"@username look how cute!","post_message":"Feline stressed? Try to stay paw-sitive! @webpagelink"},{"comment_id":"814458771980512","commenter_b":"Hillary represents the quinteseential establishment politician. Get some newer blood in Washington that hasn't been purchased already. I'm all up for a woman President, just not Clinton.","commenter_a":"Let the voters decide. But I'm going in the direction of a woman at the helm.","post_message":"I guess this Republican double standard is okay because Ted Cruz is white? Obama's grandfather, who raised him, served as a sergeant in the U.S. Army during World War II. From Wikipedia: \"Ted Cruz's father fought for Fidel Castro in the Cuban Revolution when he was 14 years old...\" Image by Occupy Democrats."},{"comment_id":"1660263367594109","commenter_b":"May be we should shove firecracker up their A-- & see how they like it. God bless America","commenter_a":"Awesome. ..thank you...","post_message":"\"If you have the right to burn my flag, then i have the right to kick your ass.\" - Creed Fisher"},{"comment_id":"10153064906873984","commenter_b":"Providing we can sue you - You don't even secure the borders .","commenter_a":"Another Hitler.With his name being Barrack Hussein Obama,what do you expect. He's proud of his name,and being a Muslim.","post_message":"A government in control of all cyber space is slowly taking shape. Consider yourself warned."},{"comment_id":"10150755555864999","commenter_b":"Because Bernie is a threat to their entire way of life.","commenter_a":"You guys are honestly so biased, this is good! I don't want a president who can't go 5 minutes without talking about their bible, and I much prefer a secular president, as does our Constitution with the whole separation of church and state thing. Why do.you have to twist everything in the world into a negative for bernie and positive for hillary.","post_message":"Unlike Hillary Clinton, who states emphatically that she is a Methodist “person of faith,” Bernie Sanders responds to questions about his beliefs by turning the conversation toward political ideals."},{"comment_id":"10153254451090671","commenter_b":"and that's why you women are pathetic ladies should not twist my words around","commenter_a":"most women are less productive as far as in the construction field is concerned but in the construction field I think they are paid the same I don't like working with women every time I do I have to work harder just to keep the same production schedule going","post_message":"Under the new law, an employer must show the “differences in wages are due to factors other than gender, that the factor is job related and reasonable and that these factors, rather than discrimination, account for the difference in pay.”"}]
