[{"comment_id":"609176595931357","commenter_b":"Not shark tale though 😂😂😭😭 Alex McKay @username","commenter_a":"Jasmine Elise","post_message":""},{"comment_id":"10153331203624614","commenter_b":"@username Sure, black bears are much smaller than grizzly bears, and a couple of humans could scare it away","commenter_a":"What I noticed was all the younger guys running and totally leaving the few elderly people behind...shame :/","post_message":"A Montana wildlife official captured video of an unnerving encounter between humans and bears on a bridge in Yellowstone National Park. The footage shows several apparent tourists making a dash to safety after finding themselves a little too close to a black bear sow and her three cubs. No one was injured in the incident, and the animals made their way safely back to the forest, officials said. Read KTLA's story here: @webpagelink"},{"comment_id":"10154607163603124","commenter_b":"Awww! You know me","commenter_a":"@username look how cute!","post_message":"Feline stressed? Try to stay paw-sitive! @webpagelink"},{"comment_id":"888129164543273","commenter_b":"Now before you say.... \"white women do the same things on their shows!!!\"","commenter_a":"Total waste of an article, this list would have certainly dropped down to less than 10 had the writer just said the entire basketball wives franchise, love and hip hop franchise and real housewives etc. instead of going by each show and each city. Dumb","post_message":"‘Sorority Sisters’ Isn’t Alone… 10 Reality Shows That Were A Bad Look For Black Women"},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""},{"comment_id":"1776377852617481","commenter_b":"Looks like he's winning. You're probably going to need to build a wall to keep us out.","commenter_a":"They're going to be the ones building a wall!","post_message":"LOL"},{"comment_id":"866874116779101","commenter_b":"who voted that fugly bitch in ?","commenter_a":"Because she's batshit crazy","post_message":"Watch this! I guarantee it's the STUPIDEST thing you hear all weekend..."}]
