[{"comment_id":"1754857141240693","commenter_b":"@username The trash should be put down !","commenter_a":"They saying there's no tv the food crap and can't go to the gym well you shouldn't do the crime","post_message":"Britain's third biggest prison is in the midst of a riot."},{"comment_id":"487493421441238","commenter_b":"Get these terrorists out of our country.","commenter_a":"This being wrong is minor compared to the knowledge that someone, supposedly an AMERICAN allowed the demand of a group of visitors in our country to undermine one of the pillars of freedom that this country was founded upon. If our observances offend them , then we should at very minimum expect and get quid pro quo, their presence insults us, so leave, and don't come back.","post_message":"Muslims force this school to ban Christian holidays. America is under attack, we need to spread this. Do you agree this is wrong?"},{"comment_id":"10153080401256051","commenter_b":"There is a hog epidemic going on in the U.S. there destroying farms everyday...there's a big need to keep the population down. Quit crying your not the ones who's life's are being destroyed","commenter_a":"The ribs are good .. smokin low and slow.","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"712897555475520","commenter_b":"Yes.. Of course the illegals have been vaccinated.... If their illegal we wouldn't know NOW would we?..... And it doesn't just mean Mexican... It means any child that enters our country illegally.... Plain and simple.....","commenter_a":"So that would be all ilegal children at the very least! Who should not be in our schools anyway!","post_message":"Anyone who hasn't been vaccinated is being told to avoid visiting Disneyland."},{"comment_id":"1022963947726395","commenter_b":"are all lesbians feminists?","commenter_a":"Fat shaming is a hate crime.","post_message":"A disgusting new low."},{"comment_id":"10154739927446037","commenter_b":"Sorry, women ARE voting...lol","commenter_a":"Most pictures are worth a measly thousand words. This one's worth millions. I would never advocate voting for a woman just because she's a woman, but this suggests that might not be a bad idea.","post_message":""},{"comment_id":"1340551885984265","commenter_b":"Your a believer if you believe what you said, people been saying that crap every election. I know you don't like either nobody does but someone is going to win Who would you rather","commenter_a":"@username I know you won't but watch this....","post_message":"TOTALLY VIRAL --- HOW TRUMP WINS (VIDEO) @webpagelink"}]
