[{"comment_id":"874758175906540","commenter_b":"1400 years Muslims have done nothing but murder...Muslims gave humanity the dark ages,Muslims have been murdering and destroying the new body count 750,000,000 and growing..this death cult will and have killed their own it will not matter!","commenter_a":"Don't we all feel better because the NYT supports the great community organizer? Hell, I may just go to work!","post_message":"The only war the Obama administration is fighting is 'the war for American public opinion.'"},{"comment_id":"455416051331721","commenter_b":"Bullish*t. That articulate enough for you?","commenter_a":"If there is one thing that is inescapably true about President Obama compared to the many predecessors that came before he is this: President Obama will be considered by history's standards as the most articulate president to ever occupy the white house! Period!","post_message":"President Obama's last State of the Union address is January 12th—don't miss it. @webpagelink"},{"comment_id":"10156091938520231","commenter_b":"he will hurt New Jersey to get Black woman","commenter_a":"I think they better do it remember what happen at Fort lee Christie did not get his way things was crazy!!!!!!","post_message":"Gov. Christie says Assata Shakur has to \"face justice.\""},{"comment_id":"1387168331361699","commenter_b":"its always the ugly chicks that hate trump... wonder why. lol","commenter_a":"PLEASE HE ISN'T THE PRESIDENT ANY MORE N PEOPLE STILL TALK SHIT. HE N HIS FAMILY WERE THE BEST","post_message":"America's fighter pilots have had enough. They say Barack Obama is helping the Islamic State group, and they have the evidence to prove it... Do you think that the president is helping our most hated enemy?"},{"comment_id":"10153232515139087","commenter_b":"Will she go away now?","commenter_a":"Rosa Parks, Martin Luther King, and Abe Lincoln all fought for equality. Kim Davis is trying to deny equality to people.","post_message":"Kim Davis was compared to Abraham Lincoln, Martin Luther King and Rosa Parks as she was given the \"Cost of Discipleship Award\" by the Family Research Council."},{"comment_id":"876721502518426","commenter_b":"She don' deserve nothing more than 10 years in jail and not a holiday jail for what she has done to this Country she deserve the punishment that she gets","commenter_a":"No! She deserves jail!","post_message":"Hillary Clinton's worst nightmare just became her reality. Days before the election everything crashes. 'LIKE' if you think Hillary deserves justice?"},{"comment_id":"557979804384534","commenter_b":"@username I totally agree, how can she not see that??","commenter_a":"If it makes you feel better, I'm ashamed of your actions too. Disgusting.","post_message":"Jaelyn Young broke down in heavy sobs at sentencing, saying she was ashamed of her actions."}]
