[{"comment_id":"668156923332741","commenter_b":"Oh, so now you speak Spanish? You voodoo witch!","commenter_a":"What does it takes America to see that Obama and Hilary have offered our country very little for the past eight years, good deceptive speeches, pure empty promises, Obama Health Care that every Insurance Company wants to drop because they are loosing so much money, bad immigration system, from one lies and deceptions after another, 400,000,000 American tax dollars for ransom, two more Americans Kidnapped for more ransom money, bad Iran deals and foreign bribes for speech and favors from corrupt foreign leaders, 33,000 deleted government email, deleted and covered up under Hilary skeleton closet because Hilary think she is above the law, deceptions, Hilary lies and cover up about Benghazi, from one lies and deception after another coming from Hilary and Obama to much to list, while our country is falling apart and American Citizens are suffering, our poor minority American Citizens are suffering, getting worse and worse under ...","post_message":"A tan solo 83 días para el día de la elección, Trump contrató a una de las voces más extremistas de la derecha para dirigir su campaña. Este es quien realmente es Trump y queda claro que no va a cambiar."},{"comment_id":"422474541282890","commenter_b":"Bring it on motherfucka","commenter_a":"1490882780941608ing Joseph Cortes @username Matt Flambard Leigh Cramphorn","post_message":"Xbox One vs. Sony PlayStation 4 gaming is finally becoming a reality."},{"comment_id":"1628105883873422","commenter_b":"And your a bitch DANI KAYE","commenter_a":"Sandy if you like him so much. Why don't you just go and live with him at the white house.","post_message":"Tomorrow, we will leave behind a president who has carried himself with quiet dignity for eight years and replace him with a man who is neither quiet nor dignified."},{"comment_id":"10153092364080779","commenter_b":"how about enforcing the laws.....dumb bitch.....","commenter_a":"If I hear gun control one more time... I couldn't feel worse for the families that lost loved ones today, but laws are NOT going to keep law abiding citizens safe from criminals, the mentally ill or those that intend on dying in a blaze of glory.","post_message":"Calling America's epidemic of gun violence \"a political choice we make\" and declaring of the nation's political class, \"we, collectively, are answerable to those families who lose their loved ones because of our inaction,\" President Barack Obama delivered one of the rawest speeches of his presidency today in response to the Umpqua Community College shooting rampage. Read it below."},{"comment_id":"10156011468900354","commenter_b":"Worse than that she made jokes about it, shameless woman.","commenter_a":"say what you will, but she is, always has been, and always will be a liar , crook, theif and a criminal. Just say no to Killary.","post_message":"Hillary's got jokes! About breaking federal law and endangering national security--what a hoot!"},{"comment_id":"10153436831622217","commenter_b":"I never said I sympathized with Rhodes, I'm concerned over how you are passing over Hitler's attrocities if they are nothing. Generally, people who downplay Hitler are anti-Semitic","commenter_a":"Oh my God... if you compared Hitler with Cecil Rhodes, the former is a TODDLER... he killed over 15 million people, kidnapped forced millions into slavery, his statue shouldn't be anywhere for people to remember him, he's not hero or we can have statue of HITLER in Berlin","post_message":"Campaigners say #CecilRhodes represents white supremacy."},{"comment_id":"1245546388827745","commenter_b":"Don't disparage whores.","commenter_a":"Barrasso. It's embarassing to watch these whores. These scumbags have gotten so emboldened they don't even try to hide their crimes.","post_message":"Right after leading the floor debate in support of Scott Pruitt’s nomination to lead the EPA, Sen. John Barrasso attended a high-dollar fundraiser hosted by energy lobbyists."}]
