[{"comment_id":"10154100012033598","commenter_b":"G","commenter_a":"Disgusting, the price of an innocent life","post_message":"Ex-Planned Parenthood Director: They Told Me Every Baby Killed in Abortion Made Them $313.29"},{"comment_id":"10152991347419712","commenter_b":"Good point cutty, still can't stand the guy. Good luck this weekend","commenter_a":"How is this scumbag celebrated?","post_message":"Here are five of Terrell Suggs' greatest chirps about the Patriots and quarterback Tom Brady, a team he doesn't exactly like."},{"comment_id":"425066681021905","commenter_b":"That woman should of been kicked out.","commenter_a":"Look what we just missed- Wendy Rowe Ristine-#noblackfriday #somepeoplejustsuck","post_message":"Look at what a woman just did to a child at a Black Friday Sale."},{"comment_id":"10155131365895231","commenter_b":"Girl preach!","commenter_a":"She will go when He calls her Home...we've all been on Life Support from our Day 1...","post_message":"Prayers for the Houston/Brown family: Bobbi Kristina will reportedly be taken off life support on Feb. 11th to allow her to pass on the same day as Whitney Houston."},{"comment_id":"10153039009502217","commenter_b":"The pussy is slanted trust me","commenter_a":"Tradicional woman japannese, very good","post_message":"Japan really isn't that strange"},{"comment_id":"10154446560569087","commenter_b":"....and you prefer a sexual deviant,foul mouthed fraud who could phucking care less about the working men and woman...this phucking billionaire builds multi million dollar condos and private country clubs that only the very rich could afford....so keep drinking the lumps poison koolaid and watch as America slides into hell...","commenter_a":"What the fuck did you and Obama show us in the last 8 years, other than treason, socialism, and the lack of and balls what so ever.","post_message":"Vice President Biden responds to Trump's tweets: \"Grow up, Donald, grow up. It's time to be an adult.\""},{"comment_id":"1203685899671880","commenter_b":"In America more people are killed by white guys than Muslims","commenter_a":"She is not brave. American people give folks a chance. Muslims do not. She knew what she was doing. Just like the Muslim who shot the police officer yesterday. She shot Trump the same way. She should have stayed away from the rally. It was a Trump Rally. Not a Muslim rally. What did she think would happen. She knew, she used the media and did not fool anyone. She also showed her true colors. Dressed like some person from the 6th century.","post_message":"This woman will restore some of your faith in humanity. Too bad her treatment at the hands of Trump and his reporters will promptly squash it."}]
