[{"comment_id":"1660809704139737","commenter_b":"No. Go away Hillary.","commenter_a":"No Hillairy liar hill itzs in her name add Bill Clinton it says liar on hill ton of bills","post_message":"Hillary Clinton: \"It is with humility, determination and boundless confidence in America's promise that I accept your nomination for President of the United States.\" Watch more here: @webpagelink"},{"comment_id":"1198972140162838","commenter_b":"Well you sure have a funny way of showing your best wishes for our country yourng woman. Respect is due any President, First Lady, VP and his wife. I hope you have learned from the experience.","commenter_a":"Yeah!!!! Why not you leave too. I can do your job! You do that about obama and tell me what happens!","post_message":"Gigi Hadid says her impression of soon-to-be First Lady Melania Trump at the American Music Awards was \"done in good humor.\" @webpagelink"},{"comment_id":"10153478052978984","commenter_b":"This girl is one ignorant PIG !!","commenter_a":"This spoiled brat is headed down the same road as Brittny and Lindsey. She needs prayers not publicity.","post_message":"Pop star Miley Cyrus just said something highly disturbing about Christians. It's especially sad when you consider where she came from..."},{"comment_id":"422053507998163","commenter_b":"After entering into discussions with egocentrics on Abortion, I have concluded the following: 1) Egocentrics callous their minds by clinging to the term fetus. 2) Egocentrics ignore the dictionary primary definition of child, \"1a :an unborn or recently born person\". 3) Egocentrics refuse to acknowledge a child exists until it breaths air. 4) Egocentrics ignore that sexual consent includes consent for sperm and egg to join thereby forming a new human being in the uterus. 5) Egocentrics dehumanize the new human being (child) by hammering the label \"fetus\", completely ignoring the relativity of \" the fetal stage\" development of a child. President Barack Obama told a group that harvesting organs from humans that are killed was and a tradition that needed to stop. He warned of dehumanizing marginal groups of humans and of the problems that arise when are not able to see someone else as a human being.\" Based ...","commenter_a":"No I don't think so","post_message":"Planned Parenthood and the 3% Abortion Myth"},{"comment_id":"10154913521679714","commenter_b":"In the end you can have Nina Dobrev","commenter_a":"Happy the way God made me.","post_message":"This is what \"the most desirable face in the world\" looks like."},{"comment_id":"10156188886135354","commenter_b":"Suzanne, you're a dumb bitch. Shut the fuck up","commenter_a":"Scott walker Mexican Americans legals are against illegals we are with DonaldTrump not because we are Mexicans but this is our country n our children need a better America not free loader hard working for a better America since 1800 hundreds my family been hereover 200 hundreds years we love America we have to be great again my decision n my family DonaldTrump is the great America we need","post_message":"Scott Walker calls for a “limited number of candidates who can offer a positive conservative alternative to the current front-runner.”"},{"comment_id":"1171399196245487","commenter_b":"She's better than me!..step into my personal space uninvited and your eye will get dot!!!","commenter_a":"Where's the guy in the 8 ball jacket when you need him???","post_message":"A racist Trump supporter went ballistic on a black subway passenger in NYC. #MicBrights"}]
