[{"comment_id":"485585728298674","commenter_b":"She is death warmed over!","commenter_a":"Not the first time Nancy has been hit. A face rearrangement could only improve her looks.","post_message":"Greta just kicked Pelosi to the curb... Good. We need more American women like Greta and less like Pelosi. Do you support Greta taking on Pelosi publicly?"},{"comment_id":"10153179690136523","commenter_b":"So that one example involving you makes you come to the idea that lots of females lie..? And the proper way to handle that situation would be to go to the authorities and let them deal with it.","commenter_a":"Lots of girls lie about that stuff it happened to one of me old friends the bitch said he raped her be he really didn't there's lots of girls out there that's are like that","post_message":"19-year-old Owen Labrie, a former student at the elite St. Paul's School, appeared shaken as the verdict was read, at one point nodding his head and reaching for a tissue to wipe tears. At the time of the assault, the accuser was 15 and Labrie was an 18-year-old senior."},{"comment_id":"10155083954441509","commenter_b":"Bernie sanders , Hillary Clinton,barrack Obama , Set out a bobber in the middle of a HUGE democratic lake , And caught a HUGE amount of sucker fish from the Bernie Campaign, just to find out it was a catch and release campaign ! \"Awesome\" Hand the election to Donald J Trump , Cause it's over for the Democrats Thanks Bernie","commenter_a":"HIllary Rodham Clinton is going to be the 45th~! Putin is manipulating the US presidential election as the De Facto Master manipulator behind Wikileaks- exclusively for his Neo-colonial ambitions. Under Trump's erratic, contradictory rhetoric there is disregard for the 1945 Yalta/1949 Armistice Agreements Border Treaties. A new deal with Putin will re-allocate all former USSR-European domains unless they contribute a \"protection-fee\" Mafia-Culture, upsetting the political/ climate balance of the entire planet;-)","post_message":"Protesters chanting “No TPP” disrupt Representative Elijah E. Cummings' speech at the Democratic National Convention in Philadelphia. @webpagelink #DemsInPhilly"},{"comment_id":"10154800678109203","commenter_b":"Stop the Racist Hate!","commenter_a":"Latinos are stupid especially the ones that are voting for the first time and have lived in politically corrupt countries. A vote for corrupt Hillary is throwing away the sacrifice they made to move here.Voting for a party that rigged a primary is a vote for corruption.","post_message":"\"We are the wall that can stop Trump.\" Latino Victory Project spokesman"},{"comment_id":"1233646523418790","commenter_b":"The filthy parasites must get the fuck out of the US","commenter_a":"Both my Great Grandparents immigrated , assimilated, learned English, no gov assistance, raised big families and loved this country for the opportunities & freedom it afforded them. We deserve the right to help those who earn the right to be Americans , but not those who come to take, hate, criticize and try to change America to suit their needs. JFK had it right .. \"ask not what your country can do for , but what you can do for your country \". Our Vets need first consideration when we spend our tax money... ! It's about time to help those who honor this country !","post_message":"Just when you think Trump can't do any better he implements policy like this one that puts AMERICANS FIRST! SHARE & LIKE if you think immigrants should never receive welfare! @webpagelink"},{"comment_id":"10154018713024411","commenter_b":"Antony. I don't represent the US government. The US government doesn't represent me. I don't excuse all of the bad things the crooks who call themselves \"my government\" do. And none of that excuses crimes Israel commits. Including the subversion of my country's government via AIPAC and all of its spies, such as the traitor Jonothan Pollard, and dual-citizen Israeli loyalists in positions of influence and power. If you don't like the crimes my country has commited in the Middle East since 9/11, you can attribute a big part of the blame on Israel and its subversives in the US. Not all, but a big part.","commenter_a":"The excuse is always the same. A missile from Gaza lands harmlessly into the Israeli desert. Israel bombs the hell out of Gaza, killing dozens or hundreds of civilians. When are people going to wake up to this scam. Israeli agents shoot off the missile to provide a pretext for Israel's aggression.","post_message":"URGENT"},{"comment_id":"10153741817406178","commenter_b":"Hillary is an unclassified POS !","commenter_a":"I think he is smoking crack.........","post_message":"Well I suppose all is forgiven now, isn't it?"}]
