[{"comment_id":"10153573726630950","commenter_b":"bitch shut your half dead looking ass up !!!","commenter_a":"I am watching on television and I am seeing a lot of Mexican Flags. This is absolutely unacceptable. Last time I looked, California is still a state in the United States of America. If you want to fly the Mexican Flag, go back to Mexico!","post_message":"WATCH: Protesters are gathering outside of a Donald J. Trump event, shouting chants and clashing with police @webpagelink"},{"comment_id":"10154657445794575","commenter_b":"@username so what your saying is the other 55% or the majority are coming over the border illegally so we do need to build a wall right?","commenter_a":"Help AMERICA first. Like the veterans, homeless and elderly!!!","post_message":"Exodus Refugee Immigration plans to move 60 people from Syria and the Democratic Republic of the Congo to Bloomington next year, starting in March. \"These are the most thoroughly vetted people coming to the United States. We don’t do research into anybody else to this extent,\" said IU Associate Professor Elizabeth Dunn."},{"comment_id":"10153483775401409","commenter_b":"You are a troll anyway. I can tell by looking at your page. Funny thing is you have a picture of the twin towers on your page saying never forget but you want to let illegals stay and I bet are all for the refugee program.","commenter_a":"Its because Trump loves attacking women but not his own. I bet he doesn't treat his wife good at home and only likes his wife and daughter as sex objects to him. He's a disgusting man.","post_message":"Here's how Heidi Cruz responded after Donald Trump threatened to 'spill the beans' on her Tuesday."},{"comment_id":"10152902121277098","commenter_b":"Do you know any white girls from the sticks? Smh!","commenter_a":"White girls from the sticks are certainly the most psychotic!","post_message":""},{"comment_id":"1674023152845757","commenter_b":"Funny","commenter_a":"Idiots!","post_message":"Just take a guess which Democrat Senator said this..."},{"comment_id":"10155247657250294","commenter_b":"Flush her down the toilet","commenter_a":"So very sad.","post_message":"When she was told she couldn't board the plane, police say a Florida woman did the unthinkable."},{"comment_id":"1041013112628492","commenter_b":"COUGH ON ALL YOUR LIES BITCH! THE WRATH OF THE LORD IS COMING FOR HER!","commenter_a":"Is she still alive? Damm she is","post_message":"Well this was just revolting. Clinton cannot stop coughing during speech."}]
