[{"comment_id":"1329933407046113","commenter_b":"Everything, everything she touches is corrupt.","commenter_a":"GREAT READ","post_message":"PATHETIC @webpagelink"},{"comment_id":"10153135004736756","commenter_b":"Henry Gallo- happy belated birthday! You have a lot of styling still to do!","commenter_a":"Great story Joe! Thanks for sharing.","post_message":"Zoe Spawton used to waitress at a café in Berlin where she would see Ali Akdeniz walk by every morning. He caught her eye because of his put-together, plucky apparel. She was so taken by his du jour ensembles she asked to take his picture. It became a daily ritual and the photos form the blog What Ali Wore."},{"comment_id":"937622143000705","commenter_b":"She can't win.","commenter_a":"Republicans are in total disarray! Hillary 2016","post_message":"According to the Washington Post, the four recent resignations have “gutted the core of Carson’s apparatus and left the 63-year-old first-time candidate with only a handful of experienced advisers.”"},{"comment_id":"1813003575594431","commenter_b":"Us white people got to go yuh eard meh","commenter_a":"Were pray tell is this \"white rage\"? I am white and I feel no rage nor the desire to go out in public and carry signs around. I am not happy with where this country is going but I am not out all day every day protesting and tearing things up..oh wait a minute...I work all day.","post_message":"According to a new book by Emory historian Dr. Carol Anderson, many of the struggles faced by the African-American community are the result of \"white rage.\""},{"comment_id":"1797835747132215","commenter_b":"A nasty woman","commenter_a":"This women should never be allowed to moderate another debate ever again, she clearly has an agenda.","post_message":"At Monday’s White House press briefing, ABC’s Martha Raddatz lobbed President Obama a question designed to get him to criticize President-Elect Donald Trump. He refused to humor her request."},{"comment_id":"1241458632577946","commenter_b":"@username I speak the same to everyone. But no one slaps me. And a pussy like you certainly wouldnt be the one to slap me. But as I stated in the original post. Plant some fucking trees if you don't like it.","commenter_a":"Yea and collapse the economy in less than 2 years. Get educated dumb ass. If you care for trees so fucking much then get the fuck off of Facebook and go plant some trees.","post_message":""},{"comment_id":"1788072574740832","commenter_b":"jesus Christ those girls look petrified","commenter_a":"@username @username 😱😱","post_message":"Parents in remote parts of Malawi are sending their daughters to be sexually initiated by local men - called \"hyenas\" - when they reach puberty. Meet Eric, he’s proud of his role as a \"hyena\". Learn more from BBC News Magazine: @webpagelink Listen to the documentary: @webpagelink"}]
