[{"comment_id":"1469983173042150","commenter_b":"#Youcantdefendit #grabthembythepussy #anybodybutTrump","commenter_a":"Folks we should be talking about this Obama care collapse and how our premiums are going up in 2017 by 26% scary . My family can't afford this !!!","post_message":"The story just keeps getting worse, and worse."},{"comment_id":"10153758496148487","commenter_b":"Is the message that youre a whiny little pussy? Roger that.","commenter_a":"We are sending a message to the rednecks and right wing nut cases.","post_message":"\"We join other leaders in our state who are calling for a change in the state flag."},{"comment_id":"1043060679149891","commenter_b":"The hell with Muslims! If you don't like our national anthem, you are free to leave.","commenter_a":"Immigration without assimilation is invasion. Get out!","post_message":"Claiming they are being oppressed..."},{"comment_id":"10152946623505399","commenter_b":"Not even worth her effort!","commenter_a":"As an Alaskan, may I just say, \"O please, Sarah. Please just go away. \"","post_message":"Well then."},{"comment_id":"1321737624513912","commenter_b":"So they're not seen as better coders, they're better coders who happen to be women!","commenter_a":"If all 4 of the total androgynous coders had 80%of their code approved, would that mean androgynous coders were superior than both other genders? How about keeping to the science topics, not social engineering propaganda.","post_message":""},{"comment_id":"982783361781141","commenter_b":"Agreed but those who think she is a liar and a criminal probably won't be swayed regardlees. I think those \"on the fence\" folks will be the factor in the next election not the lemmings who accept whatever is feed to them. My optimism is shaky but I'm hopeful.","commenter_a":"I say, keep it up. Most people will see this for what it is .. a transparent attempt to stop Hillary from becoming President. Anyone who watched the hearing knows she was poised and presidential unlike the GOP committee members. Gowdy was an unknown laughing stock but not he's a famous one.","post_message":"In trying to save his committee and his reputation, Trey Gowdy is now saying that Hillary was the whole problem, rather than admitting that this 'investigation' is a sham. What are your thoughts on his accusation?"},{"comment_id":"897694810421095","commenter_b":"They don't belong here. We are just a safe place until they can outnumber us and overpower us","commenter_a":"She can leave.","post_message":"This is what happened when she refused for the National Anthem. If you don't respect our country, then you can leave. Do you think she should pack her bags?"}]
