[{"comment_id":"10153346238078690","commenter_b":"Still as barbaric as before, that was why it was difficult for Mandela to organized them and fight for free. That is why he has to do it on his own. Animals never changes.","commenter_a":"Free from the ravages of inteligence and absolutely racist !","post_message":"Thousands expected to march in South Africa against attacks on foreigners @webpagelink"},{"comment_id":"1211339922259660","commenter_b":"Love it!!","commenter_a":"Next Congress will be investigating the rape charges against Trump..............right? No? How about the fact that he doesn't pay income taxes.......? How about his dealings with China? No! Wait a minute, this sounds like another witch hunt, fact finding repeat of all the other investigations that Congressional Republicans have tried to have brought against Clinton. I've never seen anything like it.","post_message":"\"You are hereby served.\" Rep. Jason Chaffetz served a subpoena demanding the FBI’s full investigative file on the Hillary Clinton email probe. @webpagelink"},{"comment_id":"424819437642651","commenter_b":"I would be in prison because I would whipped her ass","commenter_a":"Oh, come on,@username, act your age! The girl was clearly in the wrong, but the sub lost the battle when he responded to her as he did. He should have immediately summoned help rather than try to argue with her.","post_message":"I wonder how this student would have been dealt with back in the day."},{"comment_id":"10153184314438984","commenter_b":"This lady is a disgrace to our country. She needs to retire or get voted out so she can get a real life.","commenter_a":"Nancy Pelosi needs to shut up. Who cares what she thinks. She knew what to expect of the speech, stay away. People were there to support the PM not to listen to her senseless sniveling.","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"736942216449300","commenter_b":"The most logical way to deal with the Real ID Act is to stop rewarding illegal activities. The people that make it possible for illegals to get driver's license are the same people who refuse to correct the laws that allow career criminals to run the streets killing cops and our children.","commenter_a":"How about we stop issuing drivers licenses to people that have broken the law and are here illegally? Blaming the current governor for this is absolute stupidity. Blame Richardson and the democrats in Santa Fe, this is all on them!","post_message":"The most logical way to comply with the REAL ID law is for the Governor to agree to a bipartisan plan for a two-tier driver’s license in New Mexico. Republicans and Democrats in the state Senate crafted a compromise last session that would have resolved this issue. The Governor should agree to that compromise. This will address concerns about public safety, meet the requirements of the REAL ID law, and assure that New Mexicans can continue to access federal facilities and airports. @webpagelink"},{"comment_id":"1152822888099590","commenter_b":"Hillary is a liar, a cheat and cares more about money then Americans.","commenter_a":"Another embarrassment p***y grabber to the country...","post_message":"JUST IN: Donald Trump Jr. will be speaking at ASU on Thursday at 2 p.m. MORE: @webpagelink"},{"comment_id":"10150883310494999","commenter_b":"will have to wait to see how many generics fail to work","commenter_a":"There is going to be generic? Why is everyone complaining? This medicine just got way cheaper!","post_message":"The move by Mylan is a common tactic: raising prices before a generic competitor reaches the market, as a sort of final attempt to milk big profits from the brand-name drug."}]
