[{"comment_id":"10152674104515667","commenter_b":"Leave her alone!","commenter_a":"She's not bald, she just had her hair pulled back. But even if she was bald she still looks beautiful.","post_message":"ICYMI: Michelle Obama looked a bit different on Wednesday's episode of \"Jeopardy!\""},{"comment_id":"10154174664018812","commenter_b":"She's repeatedly called black people, \"Super Predators\".","commenter_a":"It is sad what the Clinton machine has done to such a great man. While Blacks were fighting for equal rights in the '60s. Sen. Sanders was on the front lines risking his life while Sen. Clinton was supporting a white supremacist. Most of my fellow Black American brothers and sisters have unfortunately fell for the Clinton scam and it is going to cost us big time.","post_message":"JUST IN: ABC News projects Bernie Sanders will win Nebraska Democratic caucuses."},{"comment_id":"1019570198153414","commenter_b":"She's a Witch!","commenter_a":"@username is showing us what a doucebag he really is. Desperate for people to believe such utter non-sense. Common Sean, the real hurricane is YOU for posting this as you are so full of hot air. lol The truth is \"The Ads were pulled when the news of the hurricane was brought to life not the other way around\" Trying to politicize an unfortunate event is plain evil and you posting this stuff to draw attention in the wrong way is absolutely @username like.. SAD Americans being fool by you.","post_message":"Absolute ghouls."},{"comment_id":"10154153179614445","commenter_b":"She is a female plain and simple dna dont lie!!!!!","commenter_a":"Good sorry but proud of the boys for standing up for their rights...you are a boy not a girl therefore no you shouldnt have the right to be king ...go home and sit in a corner and cry","post_message":"A transgender teen and his peers are protesting their high school’s decision to deny his bid for prom king. Hear Ash’s story: @webpagelink"},{"comment_id":"10153897505943812","commenter_b":"Closing borders will do nothing. Wake up. If they are going to get here, they will. Hell we already have our own killers","commenter_a":"This is going to continue. This will be the US one day. Mark my words. How do we know if some of these refugees coming in are not Isis and just waiting for the word to strike? What do you think now Mr President?? Borders need closed","post_message":"BREAKING: The terror group ISIS today released a statement claiming responsibility for the horrific, apparently coordinated attacks in Paris Friday that killed more than 100 people: @webpagelink"},{"comment_id":"10152884468574877","commenter_b":"Happy birthday you beautiful queen","commenter_a":"Happy Birthday!!!!!","post_message":"We are wishing Lupita Nyong'o HAPPY BIRTHDAY today!! The Academy Award winning actress received her masters degree in acting in 2012 from the Yale School of Drama and in 2014, she was named \"The Most Beautiful Woman\" by People and \"Woman of the Year\" by Glamour. LIKE and SHARE to celebrate!! >>>@webpagelink"},{"comment_id":"1733753426842494","commenter_b":"@username Subtract the illegals and convicted felons that cannot vote those minority numbers are laughable .","commenter_a":"I see Hillary's sheep say Trump will Lose the Latino, Woman, LGBT, Veterans and Blacks votes. I am sure Latinos enjoyed seeing they are called taco bowl voters to the democrats. Women Yeah because Women most likely respect the way Hillary treated women when her husband sexually assaulted them, LGBT yeah because her policies are directly responsible for 49 of there deaths in Orlando and she wants to increase that by 500%, Veterans yeah because every service man/woman wants a women who will abandon them. Blacks yeah because blacks love to be called super predators, The only votes Trump is losing is to brain dead people who care more about a business mans taxes then they do Clinton's proven corruption and lies. and the only polls Trump is losing is broadcast on the same media outlets that have been proven to be corrupt. Watch a Trump rally and then watch ...","post_message":"\"[Hillary Clinton] is bought, controlled and paid for by her donors and special interests.\" Donald J. Trump gave a speech on economic policy this afternoon, saying \"Hillary Clinton will never withdraw from TPP.\""}]
