[{"comment_id":"10153611791381509","commenter_b":"These MEN stand out from the rest. These MEN want there city back. Notice how I capitalize MEN because that's exactly what they are. Black or white it doesn't matter they are sticking up for what they believe in and not backing down no matter what others think of them. These MEN are making a much more powerful statement then all the little thugs running around the street pretending to be billy bad a** that disobey laws and creating acts of domestic terrorism and getting nothing out of it in return. This is a great representation of American pride and power....Stay strong. Respect","commenter_a":"Ijs.... Sounds about right","post_message":"Charred cars and buildings. Hospitalized police officers. Looted and damaged businesses. No school, because it might not be safe for children. That's the stark reality today after a night of riots in Baltimore: @webpagelink"},{"comment_id":"1180802641955155","commenter_b":"Don't let this wicked woman get away !!!!!!","commenter_a":"BETTER LATE THAN NEVER!!!!!!","post_message":"GET HER!"},{"comment_id":"10153780723343984","commenter_b":"the Muslim parents could have kept their brats at home that day and celebrate their butts off.","commenter_a":"Yes","post_message":"Tempers flared after this city's board of education refused to take a day off of school in observance of an Islamic holiday, and these Muslim parents were NOT happy about it. Do you agree with the decision these school officials made?"},{"comment_id":"1628196954146655","commenter_b":"It is in the constitution !!!!","commenter_a":"Yes","post_message":"POLL: Do you support the 2nd Amendment? Comment YES or NO."},{"comment_id":"543880552475480","commenter_b":"Let a family move in with you. We The People are tired of paying high taxes for to pave a way for illegal aliens from any country while our veterans are living in the streets and receiving poor healthcare.","commenter_a":"These people shouldn't be here anyways. I am all for the people that are here illegally staying and becoming residents. Most of these people just want a better life for their kids and they are productive, hard working members of society","post_message":"THIS JUST IN: Donald J. Trump in his first post-election interview said he's willing to deport or incarcerate 2-3 million people in the country illegally who \"are criminal and have criminal records...\""},{"comment_id":"10153468910666037","commenter_b":"Kids from low income communities and families qualify for free college education through goverment grants and programs... some choose to use those programs to better themselves and their famalies... others would rather point fingers and blame others... the only person to point the finger at in a capitalist society is the dude in the mirror because you can truly be anything you wanna be if you want it bad enough...","commenter_a":"This is awesome... more boots on the ground hopefully with the full support of the community and politicians to clean the crime up on the streets of this country... Every single city should follow in their footsteps!!","post_message":"The country's largest police force says it will also hire 400 administrative aides to take over desk jobs, which will free up more officers to walk the streets for community policing."},{"comment_id":"749889551868289","commenter_b":"damn bitch!!!","commenter_a":"Fuck that BITCH she has no authority to do anything the American people own the schools not your ugly f****** Muslim ass you're a disgrace to the American people and funny thing is you're on your way out you and your Muslim Brotherhood m*******f******","post_message":"Michelle Obama Banned Valentines Day In Schools She can't take love away from America's children. Do you think she is a horrible first lady?"}]
