[{"comment_id":"10156250000825354","commenter_b":"This leftist democrat is trying to push the blame to christian Americans. She wants what the democrats want more terrorist here. VOTE OUT ALL DEMOCRATS.","commenter_a":"People, please read the book \"The Seduction of Hellary Rodham, by Brock.","post_message":"Yeah, so, um, this happened..."},{"comment_id":"10153443298156051","commenter_b":"Go to hell","commenter_a":"She a moron. You hate kids then don't work at a day care idiot.","post_message":"A few hours before she began her new job, this mom posted something on her Facebook account. Before she could even get to work, her employers called her and told her not to come in. Decide for yourselves whether she should've been fired."},{"comment_id":"10153422236844877","commenter_b":"Darn shes not even hot. Nappy headed hoe.","commenter_a":"What's crazy is people talking about her knowing she has special needs.","post_message":"Miami woman arrested for dancing naked at Johnny Rockets - in the middle of the afternoon! Find out why her father says she did it. Grio fam, what are your thoughts on his defense?"},{"comment_id":"10153767433373132","commenter_b":"go girl.","commenter_a":"You are the most. Beautiful one there your Hair your. Clothes shoes. You go Rock it Beautiful!!!","post_message":"Counting down the days to New York Fashion Week."},{"comment_id":"10153980272751943","commenter_b":"Why is she smirking???? Are they really that sure that they'll get away with their crimes??","commenter_a":"Hillary has such a ditz as chief of staff? She \"wishes\"? She \"never thought about it\"???? Totally lame-brain in her knowledge regarding working in such a sensitive area...... She plays dumb...","post_message":"Hillary Clinton chief of staff during her time as secretary of state, Cheryl Mills, said she simply never thought about the prospect that some of Clinton private e-mail exchanges wouldn be retained under federal records laws. \"I wish I had thought about that subset,\" Mills said in a deposition released Tuesday by the conservative government transparency group Judicial Watch. \"I wish I had thought about the fact that someone could be nongovernment and records might be not being captured. - via Bloomberg"},{"comment_id":"885152951544454","commenter_b":"I am parra phrasing as I am not really comfortable with the terms \"richer and poorer\" x","commenter_a":"How can she handmake 3000 items a day???","post_message":"Meet the richest seller on Etsy"},{"comment_id":"1179133135441029","commenter_b":"No you're thinking of a dog. Easy mistake to make.","commenter_a":"Wasps bite. They don't sting.","post_message":"And you thought getting stung was bad."}]
