[{"comment_id":"1224318647634888","commenter_b":"@username BUILD THE WALL PUSSY. BYE BYE.","commenter_a":"LOL AYEEEEE","post_message":"Aren't teachers suppose to be the example? #WSHH"},{"comment_id":"10152801044501130","commenter_b":"Mandatory blow jobs. Vomit.","commenter_a":"During womens periods I'm all for mandatory blowjobs and or anal sex","post_message":"The tampon scene, as it’s known, marks an important point in the relationship between Christian Grey and Ana Steele—but it was apparently a little bit too much for an R rating."},{"comment_id":"10152477981607434","commenter_b":"I agree. If she lived in Miami in a luxury condo, she'd probably pay more.","commenter_a":"But- that's not a lot of money when you consider she has no mortgage, no car, no food bills- I mean- I don't want it but....","post_message":"The cost of living like a goddamn queen is high."},{"comment_id":"946471268733575","commenter_b":"Sit down an be quiet Mitt!","commenter_a":"Trump is not my choice, but why do Republicans do this to themselves? And who cares what Mitt Romney thinks - he blew his chance and I do mean blew it!","post_message":"Donald J. Trump fires back at Mitt Romney's claim that there may be a \"bombshell\" in his taxes. @webpagelink"},{"comment_id":"1461062437286833","commenter_b":"Glad he found out before she gave him a STD nasty hoe","commenter_a":"who cares","post_message":"Brutal. (From Elite Daily)"},{"comment_id":"1728764820743963","commenter_b":"That lady is just jealous because she is a mean n nasty lady n because she COULDN'T do it she has to be a d-bag....good job Bindi","commenter_a":"People are very cruel. God bless you bindi and your family. You were amazing and your dad was watching you sweetie .","post_message":"Oh no... I'm praying for Bindi Irwin."},{"comment_id":"983254505089966","commenter_b":"I can't imagine any other first lady doing that. Both of them are not comporting themselves as befitting their roles","commenter_a":"Michelle is no rocket she looks like Ichabod crane","post_message":"What an embarrassment"}]
