[{"comment_id":"10154422800373132","commenter_b":"These women are smart?? Lol OK.","commenter_a":"This show is a flake need to be cancel asap.","post_message":"That's quite the family heirloom, Kim Kardashian West. (via PeopleStyle)"},{"comment_id":"1103808136307925","commenter_b":"Don't explain...just tell her to go, now!","commenter_a":"Why don't these people go now ??? It is no big loss !!!!","post_message":"Someone really, really, really needs to explain to her how this whole process works."},{"comment_id":"10153619663514877","commenter_b":"maybe he got 3 ugly wives.","commenter_a":"he int even cute, so his game must be strong, lol, just divorce the loser, with three wives he will not have an account, hahahah","post_message":"Man charged with being married to three women after second wife catches him on Facebook. Grio fam, what would you do if you found out your spouse was married to someone else via social media? Sound off below!"},{"comment_id":"491494467719874","commenter_b":"What a dumb ignorant Bitch !","commenter_a":"And she's working on some kind of a reality show where she's a \"judge\"??? OMG!!!!!","post_message":"There it is. There’s the stupidest thing she’s ever said."},{"comment_id":"1769177686700867","commenter_b":"Move out of our country then bitch! I'm glad Mike didn't let you carry our flag you traitor!!!!!!!!","commenter_a":"If your ass don't like it here leave you jabroni ass clown","post_message":"Ibtihaj Muhammad - the first American Muslim to compete in the Olympics wearing a hijab - just went on a disgusting rant about how much she hates the United States. This is SICK..."},{"comment_id":"10153231031836051","commenter_b":"Yes, Hillary should have lost her security clearance a long time ago when they first discovered she had breached security with her emails...she should also lose her freedom...she belongs in jail for her crimes. And she will get out lucky if we don't ask for her life as well.","commenter_a":"Hell yess","post_message":"Do you agree or disagree with these intelligence officials?"},{"comment_id":"1034412946618453","commenter_b":"Shut up","commenter_a":"The end of life and nature. I miss to see the destination of these individuals and their satanic groups. #SuicideInTheNameOfFreedom","post_message":"Hopefully more players will be encouraged to come out"}]
