[{"comment_id":"675915449265700","commenter_b":"Muslims are animals,filthy Scum!","commenter_a":"Get rid of all muslims there nothing but problems.","post_message":"Putin just verbally destroyed this Muslim ambassador. He's on a mission to put an end to Muslim brotherhood. Are you glad someone is standing up to ISIS?"},{"comment_id":"10154086939802994","commenter_b":"I will never shop at cvs again until he is rehired","commenter_a":"Go figure if I was him I would have told him take anything you want this job don't pay enough money it's not worth losing my life over","post_message":"Two men hopped the pharmacy counter and tried to rob the CVS. The manager, a trained Army vet, fought them off and took their weapon from them - but they got away. He was rewarded for protecting the store and people inside...with a pink slip."},{"comment_id":"1680552935568119","commenter_b":"#TrumpIsMyPresident #SendAllIllegalsHome for all American Citizens involved & thanks for all law enforcement","commenter_a":"Okay Obama, this is your last chance to speak against guns... oh wait , guns were not used?! Oh darn it! Well let's start trying to ban knives now too.","post_message":"Officials hold a news conference on The Ohio State University campus attack. @webpagelink"},{"comment_id":"10154786029086833","commenter_b":"Arrest her","commenter_a":"While she has her entourage of security with every bit of modern rapid fire","post_message":"So the NRA isn't being \"reasonable\" for defending your individual right to keep a gun in your home for self-defense...yet it's \"reasonable\" to advocate for an Australia-style gun confiscation program? Uh, ok."},{"comment_id":"10152780926180779","commenter_b":"Dude I get it let it go","commenter_a":"Yet how many innocent black men have been killed for no reason other than for being black?","post_message":"Over 15 police officers were injured – six seriously – and over 200 people were arrested as riots broke out in West Baltimore yesterday following the funeral of Freddie Gray. Maryland Governor Larry Hogan declared a state of emergency in the city and requested that Maryland activate its National Guard."},{"comment_id":"10153549615210667","commenter_b":"But not in the women's room with a dress on..","commenter_a":"Wow! Another church minister bites the dust.This is so sickening.","post_message":"Authorities say the two suspects answered online ads specifically offering sex with an underage girl."},{"comment_id":"595073377334106","commenter_b":"In GOD WE TRUST","commenter_a":"Where do we get it","post_message":"July 30th marks the 60th Anniversary of “In God We Trust” being written into law as America’s national motto. Our Motto has been referenced by our Presidents, written on our money, and is in our National Anthem. Although some would like to erase God from the public square, we see this as an opportunity to proudly proclaim that “In God We Trust” is still the bedrock upon which our nation is built. On July 30th, let’s sweep the nation with our National Motto! Hundreds of Thousands of people have already join the One Million Window Campaign Get your sticker today and be a part of the Movement!"}]
