[{"comment_id":"10155255088631037","commenter_b":"Don't hate cause I'm not morbidly obese","commenter_a":"Where are all those kind hearted liberals who are protecting the refugees now?, you all show your true colors you will snub a American Woman just because of the job her dad has.. This is why the DNC is a sinking ship. Just look at all the red republican states now.","post_message":"Did Whoopi Goldberg think this is how Tiffany would react?"},{"comment_id":"10155114924485725","commenter_b":"If he was over 18 she will never get arrested","commenter_a":"I don't think it should be a big deal as long as the young man was over 18 years old. If older men can be with young woman why can't older women be with younger men also?","post_message":"A 38-year-old woman has been charged with having sex with her daughter’s teenage ex-boyfriend, police said. More details, and a photo of the accused ----> @webpagelink"},{"comment_id":"10154993397619254","commenter_b":"Hello from erie pa my is he getting big","commenter_a":"His fur is waterproof.","post_message":"HAPPY FRI-YAY! Eaglet E9 is relaxing in the nest this morning. We can't believe how big E9 is! The eaglet will look more like an eagle as soon as white feathers start coming in :) Where are you watching from? @webpagelink"},{"comment_id":"10154724312199486","commenter_b":"Yes come here and get shot!!! That will have them flooring in!","commenter_a":"Chicago will soon see that President is higher than Mayor...Fucktards!","post_message":"NAILED IT."},{"comment_id":"1246630588734477","commenter_b":"This braindead liberal moron should be put in a cage and shut her stupid mouth","commenter_a":"She's getting fatter and fatter too !! 😎","post_message":"Hit 'LIKE' if you think Whoopi is a complete IMBECILE who has no business being on national TV!!! @webpagelink"},{"comment_id":"10153765289899726","commenter_b":"Come to my house and more than their head will fly out the window. #semperfi","commenter_a":"Now, does Allah have 73 virgins for her too?","post_message":"Bomber's severed head 'flew out the window'"},{"comment_id":"857390540965850","commenter_b":"I resent paying for any illegal immigrant through our tax money...It is fundamentally wrong and immoral to take away from the next generation of real Americans.... Obama is evil......how about taking care of our elderly, our Veterans and our AMERICAN children?","commenter_a":"thanks obama","post_message":"This is insane, no rational government would do this, or am I off base on this one?"}]
