[{"comment_id":"10152779839917093","commenter_b":"Looks like young man, yes respectful,young man was very patient with his mother for not striking her Yes that was courageous of her to find her child and protect him. God bless you guys. I hope you can see that there is so much unspoken love in this video.","commenter_a":"A mom who cares. Very brave woman!","post_message":"Mom finds her son in the middle of the Baltimore riots... many are calling her Mom of the Year for what she does next. @webpagelink"},{"comment_id":"10153605570044205","commenter_b":"I held the door for a woman once and she said \" What you think I can't open my own door?\" Aaaaaaaannnnndddd I quit opening doors for women","commenter_a":"Also this bitch is a joke... i live in texas and shes just a narrowed minded republican raised by republicans... look how much make up she has on... lets guess what she cares about. Gtfo with your nonsense... and dont talk about men not holding doors for girls.... you women killed it. Hardly anyone says thank you... you are basically expecting it but not acknowledging it. So we took it away. Bitches always pointing the finger at men like we are always in the wrong. No fuck you.","post_message":"Alexis Bloomer has taken to social media to give a speech on why her generation is so self-centered."},{"comment_id":"701702956662495","commenter_b":"She should be locked up","commenter_a":"Rusty Shackelford stand by more to come","post_message":"We wanted Hillary Clinton to know we captured all of her best moments from the past year!"},{"comment_id":"10153534824302550","commenter_b":"She wasted our tax dollars on fantasy.","commenter_a":"Why is everyone so negative? A thirteen year old took a state to court. That says alot. Why is it OK for the president to waste money talking about climate change but not her. Get your heads out of your Butts people. She is not the problem, but did try to come up with a solution","post_message":"A judge has ruled against a 13-year-old girl who took North Carolina to court over climate change More ---> @webpagelink"},{"comment_id":"10156577406325231","commenter_b":"Girl tell it.","commenter_a":"Did anyone question how much the late Nancy Reagan spent during her time in the White House, especially on all that expensive china she had to eat off of and let's not even discuss her designer clothing, shoes, and handbags and the country was in a recession then too. Leave these children alone!","post_message":"How about people stop worrying about the price of the first family's clothing?"},{"comment_id":"10153234639738701","commenter_b":"Portland should be really embarrassed","commenter_a":"Really??? With all the real people who have contributed their time and energy to the Parade over the years all they can come up with is a old smelly piece of rug???????????????????","post_message":"Just in case you were starting to think Portland's obsession with the #pdxcarpet was over..."},{"comment_id":"1122936174469300","commenter_b":"That fat lady will sing in the end, just wait","commenter_a":"I'd never vote for ANY republican, but when it comes to one-liners nobody beats Trump. His smack-down of Hugh Hewitt was epic, and Trump argued well taking on both Rubio and Cruz at the same time.","post_message":"Romney insists Trump's reasoning is an excuse."}]
