[{"comment_id":"1254862731220863","commenter_b":"Take your wife to Russia like bernie sanders","commenter_a":"Communist piece a shit. That's what happened in chigago last night communism","post_message":"Bernie Sanders gave an epic response after Donald Trump blamed him for violence at his campaign rally."},{"comment_id":"10153273305921051","commenter_b":"Sick ass Mother fucking Bastard, needs to be castrated and beat to death so he can feel the pain that poor baby felt, it just sickens me to hear of these evil people in the world.","commenter_a":"Convicts will likely shove reality up his ass!","post_message":"This guy did something awful to a 19-month-old girl. Now he's going to face the consequences."},{"comment_id":"10153288258378854","commenter_b":"I'm seeing a lot of CRAP posted by: Sumah Volmarius. Pretty sure she's an OBAMA COMMIE...!!!","commenter_a":"If this is true why haeve w not seen this on the news, this is outragious .","post_message":"New Executive Order: Obama Takes Total Control of Internet: Declares ‘National Cyber Security Emergency’"},{"comment_id":"10153312021701756","commenter_b":"Please Sharon, share sources of actual statistics/studies for this belief. Thanks.","commenter_a":"How about environmental impact? How about helping ourselves? It seems apparent to me that most people truly do not care about animal welfare.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."},{"comment_id":"1790206457902451","commenter_b":"Michele Obama said Hillary can't run her own house, how can she run the White House","commenter_a":"Bring the jobs back. Throw out the Chinese fakes","post_message":"WATCH: Hillary Clinton and Donald J. Trump go head to head in the final presidential debate, live from Las Vegas."},{"comment_id":"10154174646349641","commenter_b":"That is so primitive to cage a living being and then let the others watch the poor thing. This is absolute human lowlesness as I call it, the worst specie in the entire universe for sure ! I hope humans will not go to outer space and colonize other planets and do the same thing what they did on Earth !","commenter_a":"Poor gorilla! Yes I agree the irresponsible parents are at fault for this incident.","post_message":"Ian Redmond, Chairman of The Gorilla Organization, said keepers had other options besides a fatal shot."},{"comment_id":"880526405340442","commenter_b":"Muslims bullying their way into power.","commenter_a":"Get your FREE money making website. No Investment Ever Earn and save on everything... loans, cars, insurance, merchandise, vitamins, hosting almost anything you can imagine, No Investment Required... EVER. @webpagelink","post_message":"The public was allegedly told 'not voting for him was sinful and un-Islamic'"}]
