[{"comment_id":"623412734499592","commenter_b":"Stupid ass mofo","commenter_a":"The next President","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153612983935329","commenter_b":"Where's the fat men in crop tops","commenter_a":"@username this is why buzzfeed is terrible lol. So hypocritical","post_message":"God bless you, Roberto Bolle. God bless the male body and also tights."},{"comment_id":"1114872955238500","commenter_b":"Dumb Bitch","commenter_a":"I'm rich. No I'm trans. No I'm rich. No I'm trans. Ahhh!","post_message":"um... Caitlyn Jenner Donald J. Trump"},{"comment_id":"1029493403807452","commenter_b":"Sanders loss = Trump win. Hillary will be down soon.","commenter_a":"We love you Bernie. We are looking forward to you continuing to lead your movement of love to unite the country and bring more peace to the world.","post_message":"All Americans are horrified, disgusted and saddened by the horrific atrocity in Orlando. At this point we do not know whether this was an act of terrorism, a terrible hate crime against gay people or the act of a very sick person, but we extend our heartfelt condolences to the victims’ families and loved ones and our thoughts are with the injured and the entire Orlando LGBTQ community."},{"comment_id":"974731595926313","commenter_b":"Kyle Francis","commenter_a":"Sarah you wonder why I despair......... Senor Berm Eileen","post_message":"We didn't think the 2016 election could get any more bizarre, but Sarah Palin and Donald J. Trump proved us wrong yesterday."},{"comment_id":"1836282733258652","commenter_b":"cute dirty pig woman...can't call her a 'lady' tho. She's a good match for the Drumpf. oink oink.","commenter_a":"#DumpTrump #FuckKillary","post_message":"Make no mistake, Hillary will do whatever it takes to cover up Bill's transgressions.."},{"comment_id":"10153204052806051","commenter_b":"@username-You are a chicken !!!","commenter_a":"Obama is a terrorists","post_message":"This sign about President Obama is sparking a lot of controversy. Decide for yourselves if it's fair."}]
