[{"comment_id":"10154939979936729","commenter_b":"she belongs behind bars","commenter_a":"Hillary Clinton goes to a gifted-student primary school in New York to talk about the world. After her talk she offers to answer questions from the kids. One little boy puts up his hand. Hillary asks him what his name is. \"Kenny,\" he says. \"And what is your question, Kenny?\" she asks. \"I have three questions,\" he says. \"First -- what happened in Benghazi? \"Second -- why would you run for president if you are not capable of handling two e-mail accounts? \"Third -- what happened to that six billion dollars that went missing while you were Secretary of State?” Just then the bell rings for recess. Hillary tells the students that they will continue after recess. When they resume Hillary says, \"Okay, where were we? Oh, that's right, question time. Who has a question?” A different boy -- little Johnny -- puts his hand up. Hillary points to him ...","post_message":"Yes. She. Did."},{"comment_id":"1344505415570466","commenter_b":"yes 1999 ...only recently explore in earnest","commenter_a":"Actually it was found few years ago.","post_message":""},{"comment_id":"1240488536029680","commenter_b":"Would she use such foul mouth language if so she would be in the gutter with you","commenter_a":"And I really think she would of said \" you're the anti Christ you cunt\" that's what she would of said to hitlary Clinton","post_message":"The late, great Mother Teresa was just sainted, but what she said about Hillary before she died will come as a surprise to a LOT of people. Everyone in America needs to see what she said about Hillary before she died."},{"comment_id":"1110154855687296","commenter_b":"Knock that bitch out!","commenter_a":"@username @username let's fuck his shit up","post_message":"Would you do it? #WSHH"},{"comment_id":"557086307813348","commenter_b":"AHHAH u need a matching one","commenter_a":"@username one for mal","post_message":"That pose though"},{"comment_id":"1766432363594674","commenter_b":"hillary a rothchilds criminal, she has already been selected months ago to be president all the sheep fall for it, see how the rothchilds find it easy to fool the easily lead with their controlled media","commenter_a":"Typical politician, first it's \"I didn't lie,\" then when the evidence piles up her statement quickly changes to \"I misspoke.\" Well, when you put it that way, I suppose you get a free pass...","post_message":"\"So I may have short-circuited it and for that, I, you know, will try to clarify because I think, you know, Chris Wallace and I were probably talking past each other because of course, he could only talk to what I had told the FBI and I appreciated that.\" - Hillary Clinton"},{"comment_id":"10152850866306051","commenter_b":"susie you didnt read so shut up u dumb bitch","commenter_a":"What does the kind of dog have anything to do with insurance.","post_message":"When the insurance company found out what sort of dog this woman had, they told her that her claim would be denied."}]
