[{"comment_id":"10153346413122300","commenter_b":"Victories or defeats in this life are truly not relevant to Christians. Though they should always fight the good fight. As long as I (they) stay true to Gods word. Then I (they) will have the greatest victory. Eternity with God.","commenter_a":"Amen to Marco Rubio, could not have said better. I don't agree with same sex \"marriage\". That's all.","post_message":"“If you think about it, we are at the water’s edge of the argument that mainstream Christian teaching is hate speech,” Rubio told CBN News chief political correspondent David Brody. “Because today we’ve reached the point in our society where if you do not support same-sex marriage you are labeled a homophobe and a hater.”"},{"comment_id":"10153538979824117","commenter_b":"I feel like this world lacks sufficient moons for McAfee to howl at. I hope one day he can find his way home.","commenter_a":"Bye Felicia.","post_message":"Unverifiable accusations of skulduggery aimed at former Gov. Gary Johnson, and competitor John Mcafee says he cannot support the Libertarian Party if Johnson is the nominee."},{"comment_id":"10152912760116491","commenter_b":"Nichole with all respects, no one is entitled to ANYTHING! I simply illustrate that women must figure out exactly what it is they want before complaining about how things are. I purposely let the door close on a woman because I don't always hold it for a guy. Women give me a stink face so often and I tell them it's me treating them equally. Have a woman pay for her own dinner once and see how far you get to having a second date. ... List goes on and on","commenter_a":"I've been to the Middle East. There isn't an American woman alive that can talk to me about oppression by men. Women run this country. They are the reason men wake up in the morning. I feel women in this country have an identity crisis in that they want chilvary but in the same instance they want equality. Men are tough and ravenous towards each other. You want that then don't complain when men treat you as they would a fellow man. (I want to add this doesn't apply to ALL women just the ones it does)","post_message":"Much of what we hear about the plight of American women is false."},{"comment_id":"10153901527564342","commenter_b":"I hope everyone that takes their child there see's this and takes their child out of there...I also hope they shut this place down and arrests that woman","commenter_a":"Their intention was to not hurt the boy yeah OK why didn't they stop when the little boy said it hurt. That's exactly why I do not put my kids in daycare this world is full of stupid people who don't care for our kids. Its not the daycares responsibility to scrub the kids face. Like really. They should face charges I'm sure someone else heard and seen that works with this stupid girl ugh this just really upsets me.","post_message":"The dad wants the daycare to face charges"},{"comment_id":"10153438772266051","commenter_b":"Ignorant bitch.","commenter_a":"Grow up you spoiled brat.","post_message":"It's easy to see why this encounter between a woman going through the McDonald's drive-thru and an employee has gone viral."},{"comment_id":"10153167804586770","commenter_b":"What size cupp is she?","commenter_a":"can't be any worse than Obama.","post_message":"S.E. Cupp: \"I don't know how Trump's surrogates can sleep at night peddling this unconstitutional, un-conservative, and un-American garbage that is, frankly, from a guy that is never going to be president.\""},{"comment_id":"867123823334246","commenter_b":"A woman has the right to decide who and what uses her body just like every other person.","commenter_a":"my rights stop where yours begine and vice versua","post_message":"Unborn babies deserve protection!"}]
