[{"comment_id":"10153816638906336","commenter_b":"They were to busy kissing her big a**s.","commenter_a":"Wonder what kind of \"humor\" the View women shot at Michelle Obama?","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."},{"comment_id":"1063797583686996","commenter_b":"Giant vagina","commenter_a":"@username you","post_message":"It be like that"},{"comment_id":"10155334834981509","commenter_b":"Police ddnt kill here the one who shoot her is her boss to shut her up.. Druglords her in phillipines are afraid now they kill all there people who knows evrything to there bussnes. Cnn researcher maybe now is grade 7 only ahahah","commenter_a":"WTF is going over there? Why isn't this President condemning these murders if he is not then he is in part at blame!","post_message":"The daughter of a runaway British lord has become one of the highest profile victims of the Philippines' war on drugs."},{"comment_id":"807798315963065","commenter_b":"ENOUGH IS ENOUGH, DO YOUR JOB CONGRESS!!!!","commenter_a":"HOW is this legal?","post_message":""},{"comment_id":"10153535338020779","commenter_b":"@username Britney is better","commenter_a":"For anybody who has been to shows like Springsteen , Pearl Jam, Metallica, Pink Floyd, it's mind numbing watching Popular music in 2016.","post_message":"Britney Spears opened the #BBMAs with a career-spanning medley of her hits. Watch below."},{"comment_id":"1217766195006823","commenter_b":"DISGUSTIMG CLASSLESS PIGLETS UNREAL","commenter_a":"Congrats to the left,You've just proven to the world,you don't need Obama to make America look foolish,you can do it all on your own.","post_message":"ClashDaily.com"},{"comment_id":"10153639863228352","commenter_b":"Cover up last thing I want to see is someone's boob while I'm trying to eat!!","commenter_a":"I'm with the lady's it's natural and people need to mind their own business the baby was hungry so mom fed it end of story and ask before posting pictures of people you don't know/ have permission to that's rude and illegal fucking ignorant immature sexist swine","post_message":"New mom is horrified to discover a photo of her breastfeeding shared on Facebook by a disgruntled diner"}]
