[{"comment_id":"10156069283810354","commenter_b":"@Kristin ... \"you serious Clark?\" is a quote from the movie Christmas Vacation : )","commenter_a":"Well, when schools in a Tennessee district are banning the USA flag, why not the gay pride flag?","post_message":"“...police reportedly confiscated a gay pride flag…” Will the Left ban the gay pride flag now?"},{"comment_id":"10153575061332411","commenter_b":"I Won't Vote For Kirk, Either!!!!","commenter_a":"Oh come now, he's a multi-billionaire businessman he knows how to talk nice when he needs to","post_message":"\"Trump has not demonstrated the temperament necessary to assume the greatest office in the world,” Kirk said in a statement."},{"comment_id":"10153192759821519","commenter_b":"Ignorant racist pig.","commenter_a":"You show a black Republican and I show you an Uncle Tom","post_message":"\"Ultimately, he has rejected the legacy and burden of the Black Freedom Struggle...\""},{"comment_id":"10152713641640496","commenter_b":"Amen, Laura ! AMEN.","commenter_a":"Sorry. I disagree. He sounds like a spoiled brat who realized that marriage takes work. Both people have to be willing to work at it. A real marriage is good. Hard sometimes. But good.","post_message":"How many of these do you agree with? @webpagelink"},{"comment_id":"10154316928129740","commenter_b":"Haha I look for radar too","commenter_a":"Driving in the personal car you see a vehicle in oncoming lanes that is definitely speeding.. You check the dash mounted radar that isnt there... Also constantly go to adjust the ghost ear piece off duty.","post_message":"These funny habits that follow you home — even after retirement — prove that officers are never truly off-duty."},{"comment_id":"10152964410961130","commenter_b":"It's Bush's fault Duh","commenter_a":"If they'd have shot him it would be all because he's black & a victim of the evil white man lol","post_message":"Have you seen this man?"},{"comment_id":"10155363897415231","commenter_b":"She's gorgeous!!! You go girl!!!","commenter_a":"Wow!! Gorgeous baby!!!","post_message":"She was bullied because of the color of her skin, but she fought her way through the tough times to now become the recipient of a $10,000 scholarship. @webpagelink"}]
