[{"comment_id":"10153590307723837","commenter_b":"De p***a WTF is wrong with the human race","commenter_a":"@username here's another one to the list","post_message":"DON'T HIRE HER! A baby sitter brought the kids she was watching to help her rob a bank! But why she robbed the bank makes it even worse!!!"},{"comment_id":"1301249303268148","commenter_b":"It wasnt done right then and thats on the doctor, not the procedure, I have spinal epidurals three ot four times a year with no problems.","commenter_a":"Scare mongering!","post_message":"I said 'Yes' to an epidural to ease agony of childbirth ... it left me PARALYSED"},{"comment_id":"1057199377724507","commenter_b":"Sensing feminists being triggered","commenter_a":"What u gone do now @username??? Does Hillary still own y'all? Who y'all gone brain wash now ??? The swamp has been drained it's time for the real Americans to take back this united States we the people are apathetically sick of corruption!!!!","post_message":"Many people did not believe Donald J. Trump could win the election @webpagelink"},{"comment_id":"809439485771743","commenter_b":"no sh-- sherlock, and obummer is running circles around the media....idiots.","commenter_a":"Andrea you are so astute! That is more than obvious, with that clown Kerry doing the negotiating!","post_message":"We could've told you that, Andrea. #Iran"},{"comment_id":"722432601238848","commenter_b":"Idiot bitch","commenter_a":"No clue what-so-ever.","post_message":"She doesn't have a clue, does she? No idea how totally ignorant she sounds. --Andrew"},{"comment_id":"10152886018669091","commenter_b":"Jaaajaj buena idea","commenter_a":"She can move to another planet . I really dont care","post_message":"\"If this happens -- I am moving to Canada. The CEO of a company is getting attention for a controversial Facebook post, where she says that female shouldn't be president.\" Here her reasoning: @webpagelink"},{"comment_id":"10153010169898984","commenter_b":"Truth or not, IMPEACH him now. He is not good for America or for the American people.","commenter_a":"He's another Teflon Politician!!!! Makes no sense!","post_message":"[Best of 2014 Compilation] Back in Feb. 2014, Steven Seagal had some pretty harsh words for Barack Obama. Surprise! There are actually some actors in Hollywood who don't follow the party line..."}]
