[{"comment_id":"1811712189111334","commenter_b":"She is a poor excuse for a women","commenter_a":"News-Flash! When you're talking about liberals, \"best\" is a relative term!","post_message":"THIS is the best the Left can do?!"},{"comment_id":"10153104580856162","commenter_b":"Them mfs is rodents. And the people who house these things are rodents too","commenter_a":"This is why you don't keep rodents as pets. Technically a ferret isnt a rodent but they are classified as meat eating predators. And who leaves a one month old baby un-attended?","post_message":"BABY ATTACKED: A 1-month-old baby lost a large portion of her face when she was attacked by 3 ferrets inside her home FULL STORY: @webpagelink"},{"comment_id":"10154700417126323","commenter_b":" This is why women worldwide have body issues. Because nasty bitches like this one feel it is their duty to mock and body shame. Well shame on her for bringing the world down a notch in my estimation...","commenter_a":"'It's not the person I am' well it is love because you took the picture and posted it. Goes to show beautiful on the outside not at all on the inside.","post_message":"A Playboy model who used social media to body shame a 70-year-old woman at her gym was charged with invasion of privacy by the Los Angeles city prosecutor on Friday."},{"comment_id":"1110154855687296","commenter_b":"Knock that bitch out!","commenter_a":"@username @username let's fuck his shit up","post_message":"Would you do it? #WSHH"},{"comment_id":"10153513325884614","commenter_b":"Brianna Paino","commenter_a":"I was told so it maybe BS. There is no law stating what direction the car is to be pointed. Say backing up in a lane at a stop.","post_message":"Dramatic cellphone video captured a dangerous scene in the Hollywood Hills: an Audi driving backwards for miles on a narrow and windy stretch of Laurel Canyon. Kevin Zanazanian, who shot the video, told KTLA the stunt jeopardized the safety of pedestrians and motorists. He said he recorded it for safety reason. After the video was uploaded to YouTube, the Los Angeles Police Department said it was investigating the incident and working to identify the driver, whose identity remains a mystery. Read KTLA story here: @webpagelink"},{"comment_id":"10152853063786748","commenter_b":"Know what, dude, if you and Obama went to a lunch counter in the deep south in the '50s, you would both stand an equal chance of getting abused and assaulted. And if the right wing scum you shill for ever get back in power, you'll find yourself right back in the 'separate but equal' category tout suite. :P","commenter_a":"right. cause Alan West is the epitome of \"blackness\"","post_message":"Right-wing pundits claim Obama isn't *really* a black American"},{"comment_id":"10154001737221509","commenter_b":"Because marriage is between a man and a woman, look up sodam and gamora","commenter_a":"Why has she not been fired? Seriously, find another job if performing your duties as a PUBLIC SERVANT conflicts with your religious beliefs. BTW, homosexual marriage is NEVER mentioned in the bible.","post_message":"This Kentucky woman is still refusing to issue marriage licenses to same-sex couples on \"God's authority\" -- and in defiance of the Supreme Court. @webpagelink"}]
