[{"comment_id":"10153172623814153","commenter_b":"I don't have compassion because of their careers I have compassion because I'm human","commenter_a":"How many of you would be screaming compassion if he wasn't a cop? And a history of DUI? Please. I have no compassion for anyone who drives drunk or gets into a car with a drunk driver.","post_message":"MVC Records: Officer Pedro Abad Jr., driver in deadly Staten Island crash, had 2013 DUI in Rahway. Read more: @webpagelink"},{"comment_id":"556934131139724","commenter_b":"So your telling me that New York wants refugees even after they experienced 911? I'm going to officially say they are retarded.","commenter_a":"It's not up to the states to determine it.... it just slows the process down, but they can ultimately come to wherever they want so long as the feds allow it...","post_message":"UPDATE: Four additional Governors have said that they are willing to allow Syrian refugees into their states: New York, Oregon, Utah, and Virginia. We simply do not have the ability to adequately vet more than 75,000 incoming refugees. I stand with the 31 Governors who are fighting to keep our nation safe. Contact your Governor today. CURRENTLY ACCEPTING: Colorado Governor John Hickenlooper Phone Number: (303) 866-2885 Facebook: @webpagelink/ Connecticut Governor Dannel Malloy Phone Number: (860) 566-4840 Facebook: @webpagelink/ Delaware Governor: Jack Markell Phone Number: (302) 744-4101 Facebook: @webpagelink Hawaii Governor: David Ige Phone Number: (808) 586-0034 Facebook: @webpagelink/ Pennsylvania Governor: Tom Wolf Phone Number: (717) 787-2500 Facebook: @webpagelink Vermont Governor: Peter Shumlin Phone Number: (802) 828-3333 Facebook: @webpagelink/ Washington Governor: Jay Inslee Phone Number: (360) 902-4111 Facebook: @webpagelink Oregon Governor: Kate Brown Phone Number: (503) 378-4582 Facebook: @webpagelink/ Utah Governor: Gary Herbert Phone Number: (801) 538-1000 Facebook: @webpagelink/ New York ..."},{"comment_id":"982549498449953","commenter_b":"Ladies?","commenter_a":"those Ladies need to get off the air and off of their high horses","post_message":"There's even more to that disgusting segment than we thought..."},{"comment_id":"10153065626180950","commenter_b":"He's a dayum disgrace. Im sure Subway can't believe this saga.Jared is a sicko that needed mental help yrs ago. He failed to get it & now he pays for his sordid fetish. The inmates will love that ass.. Footlong comin for your ass Jared. Ijs !!!! Karma is a bish :(+","commenter_a":"Hope you bring Vaseline for your new job interview jared.","post_message":"JUST IN: Court hearing for ex-Subway spokesman Jared Fogle ends; he \"expects to go to prison,\" his attorney says: @webpagelink"},{"comment_id":"991842820828524","commenter_b":"No it doesn't. Vermont has Constitutional Carry, and Vermont is the safest state in the union. @webpagelink","commenter_a":"Thank you, Governor. The current law works just fine.","post_message":"Governor Maggie Hassan issued the following statement today on Senate Bill 116, repealing the license requirement for carrying a concealed pistol or revolver: “New Hampshire’s current concealed carry permitting law has worked well for nearly a century – ensuring the Second Amendment rights of our citizens while helping to keep the Granite State one of the safest states in the nation. Law enforcement, as well as citizens across New Hampshire, have strong public safety concerns about allowing people to carry concealed guns without a license and oppose removing the protections that the licensing process offers to help ensure that potentially dangerous individuals are not allowed to carry hidden weapons. “Our permitting system gives an important oversight role to local law enforcement, while allowing for appeals through appropriate channels. In his book Live Free or Die, Republican Governor Mel Thomson said that the current permitting process for concealed carry is ‘a ..."},{"comment_id":"950334638377899","commenter_b":"Put this bitch in jail","commenter_a":"Clinton should be in Jail.","post_message":"Hillary Clinton says the Republican party's hatred for President Obama crosses political lines and is simply disrespectful. Do you agree with her?"},{"comment_id":"1009448912521620","commenter_b":"I'm sick of seeing her scrunched up \"end of her world\" face. She and the others like her are the problem. Sorry cupcake, grow up and accept it.","commenter_a":"I dont see how any employer would want to hire these idiot mellinials.they dont think for themselves.they dont research for the trueth basicly you dont want morons working and running your buisiness.","post_message":"Ummm... WHAT?"}]
