[{"comment_id":"1337467809657543","commenter_b":"Actually...now.women will do time for....oh what's that word.... MURDER! Hahahahhahahaha","commenter_a":"Abortion happens. Now if it happens in a sterile clinic with a doctor or in a back alley with a coat hanger, it's still going to happen.","post_message":"The so-called \"heartbeat bill\" approved Tuesday would result in what would be one of the most stringent abortion restrictions in America."},{"comment_id":"10152960138411051","commenter_b":"Good woman","commenter_a":"I would do that too. He deserved to be punished for that horrible incident. Great mom.","post_message":"As soon as this teen's mother saw the pictures that were being circulated, she immediately grabbed him and dragged him to the police station."},{"comment_id":"10153047823716336","commenter_b":"Out of the mouth of babe!","commenter_a":"Someone's gotta tell her!!","post_message":"\"Dear Mrs. Obama, Thank you for trying to make my school lunch better, but you have ruined Taco Tuesday.\""},{"comment_id":"10154204530456037","commenter_b":"Pussy","commenter_a":"Muslim obama has destroy the military.","post_message":"The accused spy, Lieutenant Commander Edward Chieh-Liang Lin, has been in the Navy since 1999 and has won several awards, including two Navy/Marine Corps Commendation Medals."},{"comment_id":"1210892618945831","commenter_b":"Ain't no clan rallies, ain't no alllivesmatter, ain't no trump rallies...none of that bullshit up here ya'll mother fuckers get fucked up up here talking that bullshit. If you ever in the big Apple look me up.","commenter_a":"Edited for narrow minded people who want to pick apart a comment as opposed to seeing the big picture: Why do things like this only get attention when the victim is attractive? When this same thing happens to anyone other than black people, it only gets attention when they are affluent or attractive. This SAME THING happens to white people MORE OFTEN than it does to black people and doesn't get the OVERALL attention it deserves. It's not even a black or white thing at this point. It's about what the main stream media will and will not cover. BLM is BULLSHIT and only service to segregating the people and preventing ALL OF US to come together to address these issues. If we cannot band together and fight the power they are the ones winning while we are killing each other. #knowyourenemy","post_message":"I am literally in tears. Full story: @webpagelink"},{"comment_id":"1007448135988608","commenter_b":"Lmao ik ik fr","commenter_a":"Me back in my days with the chancla 😂😂 @username","post_message":"Escape plan master"},{"comment_id":"890208664347927","commenter_b":"That's a woman^ Meant Selena.!","commenter_a":"Everything is so over sexualized in America. That's what the real problem is. If everyone didn't think of pornography whenever they saw a nipple it wouldn't be such a big deal!","post_message":"#FreeTheNipple is fighting against censorship."}]
