[{"comment_id":"10153963007189160","commenter_b":"@username: Michelle Obama is not an entitled wife she is just an ordinary male in women's clothing. GO TRUMP GO!!!!! America is the land that I love.","commenter_a":"Finally now the truth starts to come out. Hopefully Obama cannot put the spin on this now. Hillary for jail with the rest of her crooked family and Obama and his family also. Especially his entitled wife.","post_message":"Wikileaks is out with more than 1,200 emails from Hillary Clinton's private inbox."},{"comment_id":"10154297442132098","commenter_b":"Wow, that's crazy","commenter_a":"Mie Mie the mystery is solved","post_message":"CONDO FIRE: A massive fire broke out a Concord condominium this afternoon. Story: @webpagelink"},{"comment_id":"1178341715558004","commenter_b":"LOCK HER UP!","commenter_a":"You hate hillary (so do i) but you pick a man that can't beat hillary.. we've got big problems come election time.","post_message":"Donald J. Trump, Sen. Joni Ernst, and others campaign in Iowa at the Iowa senator's second annual Roast and Ride."},{"comment_id":"1158796597473702","commenter_b":"She was having a PRIVATE conversation with her son! It is no one else's business!!!! She quite clearly stated she speaks English!!! Read the article people!!! So stating that immigrants should learn the native language in this situation is redundant!","commenter_a":"We speak many different languages in America.","post_message":"The woman was speaking with her son in Spanish while celebrating his birthday when a stranger interrupted to tell them, \"We speak English in America.\""},{"comment_id":"10154017509764156","commenter_b":"I will keep you in my prayers, Eva. You'll need them.","commenter_a":"California has extremely strict gun laws! Many in violation of Supreme Court orders! Blame the terrorists that did this, not the gun laws! It's obvious no one other than the murderers had a weapon or this would have ended much sooner, with less tragedy!","post_message":"There are no words that can come close to describing the horror of today’s attack in San Bernardino and my heart goes out to the victims and their families. Our only response must be to take immediate action to stop tomorrow’s mass shooting by addressing the gun violence epidemic. Period."},{"comment_id":"1694550140816786","commenter_b":"Misogyny!... misogyny everywhere!","commenter_a":"RIP, Chyna. But in your next life don't be a wrestler and a pornstar. Two terrible choices for a woman.","post_message":"She was known as the \"Ninth Wonder of the World\". #RIPChyna"},{"comment_id":"783948935040375","commenter_b":"I have seen girls wear a lot worse. Actually the dress is beautiful.","commenter_a":"She's beautiful and the dress is fine shame on the teacher for saying such a thing the teacher should have minded her own business !!!","post_message":"Do you have a problem with this dress? This young lady was shamed for wearing this dress to her senior prom. A teacher claimed it was too revealing and said \"Us big girls gotta cover up.\" More: @webpagelink"}]
