[{"comment_id":"10153407697891519","commenter_b":"Hope it's a woman.","commenter_a":"I'd like to hear Feines' opinion on this. I would also like to know what other actors were applying for the part.","post_message":"We're actually embarrassed for everybody involved..."},{"comment_id":"1660809704139737","commenter_b":"No. Go away Hillary.","commenter_a":"No Hillairy liar hill itzs in her name add Bill Clinton it says liar on hill ton of bills","post_message":"Hillary Clinton: \"It is with humility, determination and boundless confidence in America's promise that I accept your nomination for President of the United States.\" Watch more here: @webpagelink"},{"comment_id":"10153580849383812","commenter_b":"I'll be there. Don't know if I'll fit in that box.","commenter_a":"This is just becoming the perfect excuse for some parents to abuse the internet and the kindness of others... What a joke, shame on the parents BY THE WAY, MY birthday is coming up, Im opening an invite to everyone and anyone!!! PO BOX for gifts to follow! LOL","post_message":"Hundreds attend 10-year-old boy's birthday after mom extends open invitation to the Internet when she finds she has no one to invite: \"He was grinning ear-to-ear.\" @webpagelink"},{"comment_id":"10154717771869657","commenter_b":"Moving forward..and having some fun goes along way..Go Trump!! Trump Up!!","commenter_a":"Lol","post_message":"Whiplash."},{"comment_id":"952760784783670","commenter_b":"She is a sad excuse. Why do we care what she says. Why do we care she breathes. Waste of space.","commenter_a":"I've seen prettier horses","post_message":"How much lower can Katie Hopkins go?"},{"comment_id":"1031319243615345","commenter_b":"What?","commenter_a":"What so if the creep has aids the victim can't get justice and if the victim gets drugged and is attacked what happens ??? Maybe you may have not thought this through???????","post_message":"... Seriously, America?"},{"comment_id":"10153994248378132","commenter_b":"Illegals. Not immigrants.","commenter_a":"Ironic to be married to someone with such disdain for immigrants.","post_message":"Barbara Walters says she was surprised by Melania Trump."}]
