[{"comment_id":"10152920542711107","commenter_b":"Yes! Stop her!","commenter_a":"Yes","post_message":"Can you and I get 10,000 more signatures on Facebook? Over 21,000 of you have sent your \"Stop Lynch\" Emergency Fax Petition through Facebook -- and your voice is being heard loud and clear. Momentum is building against her confirmation thanks to your outpouring of opposition. In fact, two previously undecided Republicans announced their intention to vote against her nomination. But you and I can't stop now. As you know, Loretta Lynch has proven herself to be an advocate for the lawless conduct of the Obama administration and not an advocate for the rule of law. That's why I'm counting on you to keep the pressure on and urge my colleagues to vote \"no\" on her confirmation. Sign your \"Stop Lynch\" petition right away!"},{"comment_id":"10153554685766880","commenter_b":"I want TRUMP to build the wall so can make it hold","commenter_a":"At one time owning slaves was constitutional","post_message":"#2. Ending birthright citizenship would be \"clearly unconstitutional.\""},{"comment_id":"912506822117747","commenter_b":"Grow up racist","commenter_a":"Thanks Fox, again you nailed it..","post_message":"Just when you thought #FoxNews couldn't get any crazier... @webpagelink From (Y) Counter Current News - MBD"},{"comment_id":"10153098509611813","commenter_b":"The ACLU doesn't stand for white heterosexual males or gun rights...ever.","commenter_a":"The ACLU stands for dead babies and bombings.","post_message":"The ACLU supports refugees and stands against fear mongering by politicians. @webpagelink #refugeeswelcome"},{"comment_id":"10155252266929411","commenter_b":"Wheres the music coming from?","commenter_a":"77","post_message":"#1917LIVE: The sun sets on the Russian Empire Romanov rule is collapsing. Martial law imposed in #Petrograd. Authorities fear violence can erupt anytime. Russia is like a boiling cauldron, that can explode at any second. Follow #1917LIVE - Retweet the Revolution @webpagelink @webpagelink/ 27.02.2017"},{"comment_id":"528487337334584","commenter_b":"#FUCKTRUMP #FUCKTRUMPLATINOS & YOU","commenter_a":"Latino for Trump! You don't have the explained anything. The system is crooked!","post_message":"STATEMENT REGARDING TRUMP UNIVERSITY It is unfortunate that my comments have been misconstrued as a categorical attack against people of Mexican heritage. I am friends with and employ thousands of people of Mexican and Hispanic descent. The American justice system relies on fair and impartial judges. All judges should be held to that standard. I do not feel that one’s heritage makes them incapable of being impartial, but, based on the rulings that I have received in the Trump University civil case, I feel justified in questioning whether I am receiving a fair trial. Over the past few weeks, I have watched as the media has reported one inaccuracy after another concerning the ongoing litigation involving Trump University. There are several important facts the public should know and that the media has failed to report. Throughout the litigation my attorneys have continually demonstrated that students who participated in Trump University ..."},{"comment_id":"10154188982011954","commenter_b":"illegals only come here for free money ..stop the flow","commenter_a":"Can we cover the 2 million illegals registered to vote?? That has just been proven??","post_message":"Watch LIVE: Press Secretary Sean Spicer briefs reporters after the DHS secretary moved to implement immigration changes ordered by President Donald J. Trump. @webpagelink"}]
