[{"comment_id":"10153354132661320","commenter_b":"Religion is fake!","commenter_a":"He's a fraud sorry","post_message":"\"I can dream as long as I want to. I can believe God as long as I want to. If I wanna believe God for a $65 million plane, you cannot stop me.\" Pastor Creflo Dollar is blasting critics who took him to task for wanting a fancy private jet. Read more: @webpagelink"},{"comment_id":"1657660854509683","commenter_b":"His wife was from Saudi Arabia the home of Isis and bin ladan. She radicalized him! These people mindset are very scary","commenter_a":"Islamic terrorist scumbags.. His wife should never have been admitted into the USA. America has the dumbest immigration policy on earth. Thanks for the 1965 \"turn America into the world's dumping ground \" immigration act teddy Kennedy!! NOT","post_message":"The gunman who turned a holiday party into a mass murder scene with his wife had complained that his co-workers made fun of him."},{"comment_id":"10153931139325695","commenter_b":"Omg poor @username lmao. What a nut job . So should we deport whites for crimes? Since this wasn't really our land to begin with?","commenter_a":"Really disappointed with you, WSB.","post_message":"Our investigation found the number of refugees deported for violent crimes is skyrocketing, and it includes numerous refugees here in Georgia. Today at 5, the numbers that leaders call a \"game changer\" in the Syrian refugee debate."},{"comment_id":"729261537208194","commenter_b":"Not for criminals!!! More sheeple...","commenter_a":"When is everyone going to realize that gun control laws only apply to the law abiding citizen's? Criminals could care less what law is out there that says something is illegal, such as murder, drugs, ect.","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.” Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"939237909458566","commenter_b":"Time to put two carrier groups in the area and drop lots of big fire crackers and line up some goats for the departed cave rats....but that raghead POS that lives in the WHITEHOUSE will do nothing","commenter_a":"Uh....why????","post_message":"BREAKING NEWS:"},{"comment_id":"10153820494546350","commenter_b":"i see Kate in her lol and Will in George","commenter_a":"Princess Charlotte looks like her daddy, adorable.","post_message":"Princess Charlotte has grown so much in six months! We just can't handle the royal cuteness! on.today.com/1IrSwdd"},{"comment_id":"10154103102004170","commenter_b":"hillary is a pig liar","commenter_a":"Despicable HRC is! Oh, so despicable! 👎👎👎👎","post_message":"What kind of First Lady has so little class that she would say something nice about another First Lady, then apologize for saying the nice thing? Oh. Right."}]
