[{"comment_id":"10153227262005667","commenter_b":"@username where do you live? Come on your pry think we don't need crude oil any more either.","commenter_a":"If you think it's cute I will snare one and let you try to pet it. They are vermin and need to be killed or they will take over. Now they just eat your pets, if the numbers get out of control they will come after humans.","post_message":"The animal was spotted entering the baggage claim area and then ran across the ticket check-in area and toward the TSA checkpoint."},{"comment_id":"1194337773935013","commenter_b":"This bitch got the fucking nerve to talk about pollution killing people yet donated money to an army of murdering cowards to support them killing children. Fuck outta here","commenter_a":"Hillary can double that... in a weekend!!","post_message":"\"Pollution kills more people every year than wars, car accidents, and homicides combined.\" -- Arnold Schwarzenegger"},{"comment_id":"10153013352396336","commenter_b":"Once again, an illegal alien!","commenter_a":"sounds like sabo tage to me. maybe even terroristic.","post_message":"\"A brush of death definitely came over me.\" – passenger Joel Bingham As more details emerge in a California train derailment that left dozens injured, investigators say the truck involved was not stuck on the tracks."},{"comment_id":"10155791972890725","commenter_b":"STFU","commenter_a":"and a lot of people blame the police in one out of five hundred killings. what happen to hope and change under obama?","post_message":"Police say the victim, identified as Vonzell Banks, was likely not the intended target ----> @webpagelink"},{"comment_id":"1096493903701292","commenter_b":"suck republican dick, thomas! asshole!","commenter_a":"conservatives will go nuts in: 3, 2, 1...","post_message":"More than time to recognize that Black Lives Matter and there are too many incidents of police officers who believe otherwise."},{"comment_id":"10154148489244060","commenter_b":"@username I just think OUR country needs to find a way for its CITIZENS to be productive, if we want to limit immigration ..just an idea","commenter_a":"You are forgetting that Rodney King was drunk and high on PCP. He also attacked the cops, that is clearly seen on video. White people who are drunk and high on drugs are beaten by the police when they resist arrest too... Please tell all the story of you are going to tell it. As for the Black Lives Matter movement goes, they just increase tension and stir things up. All Lives Matter, end of story. Where are the BLM protesters when two black kids are shot in their front yard in a gang-related shooting and there are no leads in the case? Nowhere. If a white police officer isn't involved, they don't care. They just want headlines, not community building. And that community is all of us, not just one ethnic group.","post_message":"Rodney King, an American taxi driver, was beaten by four LAPD officers after being caught speeding. He suffered a fractured facial bone, a broken right ankle and severe bruising and lacerations. It sparked a global conversation about police brutality; two of the officers were found guilty of violating King’s civil rights on April 16th 1993"},{"comment_id":"987364064653456","commenter_b":"What about the case of the stay at home mom, divorces, etc. where does she fall in your explanation Michael?","commenter_a":"Keep it in your pants or out of your pants until AFTER you finish school. I don't have to pay for your daycare.","post_message":"Juggling the demands of an education with parenting is a reality for over 25% of American college students—and it’s time that we create affordable childcare options for those seeking a degree."}]
