[{"comment_id":"10153123967295329","commenter_b":" ! Paco nooo","commenter_a":"Caffe Con Lechee","post_message":"We all have that That One Co-worker who can't control themselves around cake."},{"comment_id":"10154688029234749","commenter_b":"No, not all woman. Just ugly dogs like yourself","commenter_a":"Because the beard makes them extra ugly and nobody else wants them","post_message":"A little bit of stubble has a whole other meaning though..."},{"comment_id":"572501256275839","commenter_b":"Why aren't people moving to Mexico instead of Canada??? LMAO CAUSE THEY ARE RACIST","commenter_a":"That woman who said women that voted for Trump are dumb was speaking for herselfLast laugh on us that voted for Mr. Trump","post_message":"Donald Trump STUNNED the media with his big win. Here's #2 in the media's stages of grief: ANGER."},{"comment_id":"519430408242325","commenter_b":"What do expect from narcicistic bullies? They steal cheat etc...go figure....most poor folk who steal get arrested..why not trimp chimp rabid rat","commenter_a":"Well it's nice to see how Trumplestiltskin would use Meredith McIver as a scapegoat for that plagiarized speech that dipstick Melanoma Trumplestiltskin gave!! C'mon, surely you can see through the Trumplestiltskins I mean honestly am I the only one!? LOL!!","post_message":"Meredith McIver is listed as a co-author with Donald J. Trump on several of the books he's had his name on spanning more than a decade."},{"comment_id":"795005380646682","commenter_b":"Y'all must be crazy","commenter_a":"Drain the swamp","post_message":"The United Nations resides on American soil, and the U.S. pays about 25% of its budget."},{"comment_id":"10153727755939117","commenter_b":"@username If Trump were a cat, he would be licking his own balls.","commenter_a":"And the Republican leaders of the past, McCain, Romney, and the entire Bush family? They recognize a fraud when they see one and won't even bother attending, endorsing or having anything to do with a bully liberal like Trump.","post_message":"The list of GOP convention speakers includes a bunch of people better known for harshly criticizing Donald J. Trump, in some cases unambiguously pronouncing him unfit for the presidency. They say he's a \"con artist,\" \"narcissist,\" \"bully,\" and \"pathological liar\" whose candidacy is \"a cancer on conservatism.\""},{"comment_id":"968868466550965","commenter_b":"Let's leave tomorrow!","commenter_a":"How do we get his life @username","post_message":"Can we apply?"}]
