[{"comment_id":"10153068492709411","commenter_b":"Thank heavens...............one revolting misogynist pig gone, but alas another is replacing it.","commenter_a":"RIP","post_message":"BREAKING:"},{"comment_id":"418033801654548","commenter_b":"The woman deserves to burn in hell for eternity.","commenter_a":"Zeeeeerooooooooooooooooooo!","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"10153546186781162","commenter_b":"The disturbing replies to this is that people actually think just because she is a woman, she can hit whoever she wants and continue to escalate a fight. Doesn't matter who or what she is. You don't hit people period. Had she not come back in, hit him and continued this, there would have never been a problem.","commenter_a":"I'm all for not putting hands on a woman. But where's this equal opportunity draw the line at? She smacked the taste out dudes mouth. Don't start what you can't finish","post_message":"PANERA ATTACK: A Panera bread manager is fired after he was filmed punching a female employee in the head and knocking her to the ground. WATCH: @webpagelink (Warning: Graphic video)"},{"comment_id":"982212811884970","commenter_b":"This is so outrageous! Homeless Americans, hungry children,and people out of work and these people live like royalty. They need to be gone.","commenter_a":"shameful","post_message":"This was the Obamas eighth Hawaiian family vacation. The trip has become an annual event for the Obamas. To date, Obama and his family travel expenses total at least $85,029,819."},{"comment_id":"1265882336765127","commenter_b":"And yes that woman looks horrible because she over does it ...like I said I wouldn't suggest coming every day for the rest of your life","commenter_a":"Ummm....I am a tanning salon OWNER! You are are misinformed in your information as we all have taken classes about tanning. My mother died of melanoma and never tanned a day in her life we get SOOOOO MANY people with medical conditions who have to tan some of which are young girls. Now they passed the new law in 2014 on minors but we are WIDELY sought out and remained a tanning salon for 17 years!!! You have to educate yourself on it. The media is giving it such a horrible rep just like they do with everything to make you all freak out the exact way u are. If we didn't know what we were talking about then why do we have clients come who beat breast cancer with a doctors note or psoriasis or cystic acne or ms eczema the list goes on. Your body NEEDS vitamin D ...","post_message":"The FDA proposed unprecedented new rules Friday that would bar anyone under 18 from using a tanning booth or sunlamp."},{"comment_id":"10153562770079228","commenter_b":"Lol right^^^?","commenter_a":"Should be fired","post_message":"She complained about protesters blocking rush hour traffic on I-70"},{"comment_id":"606991596121137","commenter_b":"BLUE LIVES MATTER ! AMERICA SAY'S LOAD THEM UP , HEAD THEM OUT ! NO MORE ILLEGAL IMMIGRANTS BY AIR , LAND OR SEA ! NO MORE NICE GUYS , WE NEED THE RIGHT GUY TO GET THIS JOB DONE ! TRUMP IS THE ONLY CANDIDATE THAT WANTS TO DO THIS JOB / THAT CAN DO THIS JOB , VOTE TRUMP ! BUILD THE WALL AND NEVER FORGET WHAT verry husINsein oBUMa , Killery AND THE DEMislamOCRAPS HAVE DONE TO AMERICA ! PASS IT ON !! MAKE AMERICA SAFE AND GREAT AGAIN , IT'S YOUR VOTE FOR TRUMP THAT WILL MAKE AMERICA SAFE AND GREAT AGAIN !!! THERE IS NO PLACE FOR SHARIA LAW ANYWHERE IN AMERICA , THE CONSTITUTION IS THE LAW OF THE LAND EVERYWHERE IN AMERICA !","commenter_a":"Mr. Trump has this vote locked down in Florida ... hopefully the senators will get back to work soon because Mr. @username starts work on day 1... congress would be smart to have legislation ready to go across his desk","post_message":"GOOD MORNING AMERICA! New CBS poll just released. A strong indication that we are on our way to MAKING AMERICA GREAT AGAIN! Lets keep up the momentum, and have a great day!"}]
