[{"comment_id":"10153400467734228","commenter_b":"Why would anyone expect there are appropriate records if baby stealing was happening? Poor women!","commenter_a":"Records are only as good as your charting if it's not written down it didn't happen ! That's law never said it was a good law so a lot could have been left out","post_message":"\"You are trying to kill my character. You`re trying to lie and say I was at one hospital and you can keep up your records that good.\""},{"comment_id":"1301249303268148","commenter_b":"It wasnt done right then and thats on the doctor, not the procedure, I have spinal epidurals three ot four times a year with no problems.","commenter_a":"Scare mongering!","post_message":"I said 'Yes' to an epidural to ease agony of childbirth ... it left me PARALYSED"},{"comment_id":"1179490578805054","commenter_b":"@username Little girl please... You have zero inclination of who I am, where I've been and with whom I've walked. My dad always said, \"Never argue with an unarmed person\". Go away before your feelings get hurt.","commenter_a":"A gentleman named Bill Howell eloquently wrote the below letter. Dear Mr. Trump, It’s taken me a while to realize this and to admit it, but I’m grateful to you. For the past few months I’ve spent a good deal of time lamenting your campaign and the poison it has so effortlessly generated. I’ve watched our country imploding, our public discourse become polluted, our political climate grows ever more corrosive, and wrongly assumed you were to blame. It’s only lately I’ve come to understand that you haven’t manufactured our current national ugliness—you’ve simply revealed it. By saying the irresponsible, mean-spirited, ignorant things you say so freely and so frequently, you’ve given other like-minded people license to do the same. You’ve opened up the floodgates for our corporate sewage to flow fully. People no longer conceal their vile mess, they now revel in it, they broadcast it and retweet it. You’ve ...","post_message":"Trump appears to be ready for victory. Do you think he should win in November?"},{"comment_id":"1811896189089892","commenter_b":"Cause she was lying, and she knows we all know she is a liar!","commenter_a":"Wow.. a fair and unbiased job by Chris Wallace..finally!!...Trump didnt expose her as the lying criminal that she is as much as I hoped Hillary must have had an earpiece she was nodding yes through the whole debate...what a fake! Now lets listen to the corrupt media spin it left when its obvious Trump won.","post_message":"There was no doubt about it..."},{"comment_id":"10154619916723812","commenter_b":"she only made that statement because she's salty that Melania got busted lol.","commenter_a":"Again for those that don't have a clue. A speech writer helps to incorporate your thoughts and feelings on paper. As the article reads Michelle was heavily involved in the speech. Read b4 u comment.","post_message":"The woman who wrote Michelle Obama's DNC speech is currently a senior presidential speechwriter and has been a speechwriter for Hillary Clinton, John Kerry, and more in the past."},{"comment_id":"889430217827633","commenter_b":"@username alright Kim calm down!","commenter_a":"Ellie Metchette @username","post_message":"It will be in 2017 and here is the new teaser trailer. // Stranger Things"},{"comment_id":"461209797400647","commenter_b":"This isn't the dark ages, human beings are starting to accept all people. Perhaps the asswipes on this thread should become more tolerant and stop wasting all their energy on irrational hatred.","commenter_a":"What awesome gay couple would want to be married by a bigoted pastor? There are plenty of other ordained people who will be more than happy to marry a beautiful couple!!! Peace!!","post_message":"Breaking..."}]
