[{"comment_id":"990898310953409","commenter_b":"\"Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you\"","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas. @webpagelink"},{"comment_id":"810137155781996","commenter_b":"If we wouldn't have killed them you would be dead by now","commenter_a":"Jebs brother George gave the go ahead to invade Iraq for something they didn't do leading to the death of over 500'000 innocent civilians. Jebs brother George. Jebs brother.......... Let that sink in. 500'000 men, women and children.","post_message":"The Obama-Clinton-Kerry team's stance towards Israel has been a disgrace. I’ll rebuild this crucial alliance."},{"comment_id":"1284456268283154","commenter_b":"Take her down, NOW! Before the Election!","commenter_a":"Vote Trump! There is just to much evidence of serious corruption to ignore. She is a criminal and a traitor to America!","post_message":"This is the end of Hillary Clinton's campaign, and it's all due to Congressman Jason Chaffetz releasing damning new evidence that will make sure Hillary sees the inside of a jail cell. The FBI isn't ignoring this anymore. Let's get 2,000 shares to prove that America has spoken and we want Hillary behind bars."},{"comment_id":"10154356227669641","commenter_b":"Females have orgasms? ;)","commenter_a":"Is everyone who is reading this so dumb or is it just me? The comments seem to be coming from people in deep sleep. OK for starters let's all read the post in detail again then re-align comments.","post_message":"What is the actual purpose of the female orgasm?"},{"comment_id":"10154147763835329","commenter_b":"She wouldn't understand","commenter_a":"@username do it to Sydney","post_message":"how to know your sibling is on drugs"},{"comment_id":"1391331507694716","commenter_b":"Shut up hoe","commenter_a":"It's really hard to see the rest of us as people when you have to distance yourself with your extreme views and lifestyle to find some amount of self esteem. Keep fooling yourself apparently NBC loves putting you out there to keep poking us in the eye, but we know we are right and you are wrong. That is the standing in America right now.","post_message":"Rachel Maddow was nearly hysterical over Trump's speech. #RNCINCLE"},{"comment_id":"10154654026369160","commenter_b":"HOLLYWOOD ELITES..... TAKE DOWN YOUR WALLS AND YOUR GATES AROUND YOUR MANSIONS. We all want to have the right to walk onto your property, so that we can also enjoy the excessive good life that you live. We want to swim in your pools and relax in your hot tubs..... we want to sleep in your beds and wear your designer clothes.TAKE DOWN YOUR WALLS AND YOUR GATES!","commenter_a":"By the way the police had nothing to do with Nicole Brown and Ron Goldmans deaths. Awful nice of him in a past year how many officers lost their lives while just in their cars and were gunned down, 5 in Dallas protecting protesters against them, and 3 in Baton Rouge. Really thoughtful to attack the police which have been more of victims than offenders in this country.","post_message":"The director of \"O.J.: Made in America\" dedicated his Oscar to Nicole Brown Simpson and Ron Goldman, and then to \"the victims of police violence, police brutality, racially motivated violence and criminal injustice.\""}]
