[{"comment_id":"10155114924485725","commenter_b":"If he was over 18 she will never get arrested","commenter_a":"I don't think it should be a big deal as long as the young man was over 18 years old. If older men can be with young woman why can't older women be with younger men also?","post_message":"A 38-year-old woman has been charged with having sex with her daughter’s teenage ex-boyfriend, police said. More details, and a photo of the accused ----> @webpagelink"},{"comment_id":"10153483912132522","commenter_b":"If only the two big candidates this election were Johnson and Stein. Either of them would be nice.","commenter_a":"Libertarians should all be required to live in Syria for a year. That is essentially what their government is (or lack there of).","post_message":"Gary Johnson and his running mate, Bill Weld, were equally dismissive of \"huckster\" Donald Trump and political status quo. \"The two-party system is a two-party dinosaur, and they're about to come in contact with the comet here,\" said Johnson:"},{"comment_id":"1641203876178008","commenter_b":"God Bless You PRESIDENT DONALD J. Trump","commenter_a":"I called illinois state election they didn't do anything","post_message":"WATCH #LIVE: Donald J. Trump speaks at his second event on #Halloween at a rally in Warren, Michigan."},{"comment_id":"421137708047770","commenter_b":"Lady, you're an idiot!","commenter_a":"Your amazing trying to explain to limited, CNN stupid reporter how dangerous Iran is. Thank god for you! I'd vote 4u any day!","post_message":"ICYMI: I joined The Lead with Jake Tapper to discuss my open letter to the Iranian Government. WATCH:"},{"comment_id":"10153571738266350","commenter_b":"This gotta be the dumbest bitch on this plant","commenter_a":"She has a lot of nerves, respect WHAT! killing the animal is not respect, shooting them with a camera is respect. Love to hunt and after your dead.... I respected her so much!","post_message":"\"Everybody just thinks we're cold-hearted killers, and it's not that. There is a connection with the animal, and just because we hunt them doesn't mean we don't have a respect for them.\""},{"comment_id":"10152957563376770","commenter_b":"she should have already been locked up!...","commenter_a":"She has helped fuel the fire instead of being unbiased like she is supposed to be.","post_message":"A veteran Baltimore prosecutor is blaming state's attorney Marilyn Mosby for contributing to dramatic spike in violent crime that has gripped the city in the aftermath of the Freddie Gray case."},{"comment_id":"1122482747785208","commenter_b":"Nice fat white chick.....the black man's kryptonire....","commenter_a":"\"He shouldn't be golfing he should be working. How dare he.\" Sincerely, Everyone who didn't care when GW Bush did the same thing while he was in office.","post_message":"WATCH: President Barack Obama sinks 40-foot chip shot on 18th hole while on Hawaiian vacation: @webpagelink"}]
