[{"comment_id":"10154189490969497","commenter_b":"Most teen girls are total bitches, even those with cancer.","commenter_a":"they always use a teenage girl for this example but never a teenage boy that does the same thing/worse :P","post_message":"Though the chemotherapy Rachel Fullerton is undergoing often makes her weak, she said she has strived to maintain her typical routine of rolling her eyes and sighing loudly anytime an adult addresses her."},{"comment_id":"10153102018738822","commenter_b":"What is wrong with these women!?","commenter_a":"Dumb fkn bitch","post_message":"A mother has been arrested after she left her baby on the side of the road in Maryland this past weekend."},{"comment_id":"1784975415104883","commenter_b":"Quit talking the talk and walk the walk and prosecute this Bitch already for crying out loud!!!!!! No more POS criminal Clintons in the White House!!!!!!!","commenter_a":"We need to start a new Party, the Constitutional Conservative Party.","post_message":"DML explains about indicting Hillary Clinton for her emails -- what would it do? Plus, little inside info from pollsters who say Trump leading in polls nationally by Tuesday. Watch, share, and if you are new to DML please give this page a LIKE."},{"comment_id":"10153564544001509","commenter_b":"I cannot stand her either.","commenter_a":"I find her extremely obnoxious.","post_message":"Actress Gwyneth Paltrow is trying to live on $29 worth of food for one week as part of the #FoodBankNYCChallenge. See what items she selected: @webpagelink What would you buy for $29 to feed your family for a week? Share your answers in the comments below."},{"comment_id":"924300044274003","commenter_b":"Duh...He's a Liberal!!! He wants Fox to continue pying him, even thought he won't kick his alcohol and drug problem!!!","commenter_a":"Can you send Juan Williams with him?","post_message":"Bob Beckel isn't going to stay silent in the face of a harsh Fox News statement announcing his departure form the network."},{"comment_id":"1142306435836110","commenter_b":"What a piece of shit! And fuck the judge that his mommy and daddy paid off!","commenter_a":"White privilege at its best","post_message":"Man charged of raping 2 unconscious women only gets probation and won't have to register as a sex offender! #WSHH #SMH"},{"comment_id":"1790088647891885","commenter_b":"Lois did you listen to Hillary's speech . It sounded like she didn't know democrats policies or didn't take thousands from PP and believes in term abortion . Oh she forgot thAt, 🇺🇸Trump🇺🇸","commenter_a":"Hillary calling someone corrupt? Wtf kind of drugs is she on? Her and her so called husband are the biggest, most corrupt crooks ever involved in American politics!","post_message":"Donald J. Trump: \"Hillary Clinton may be the most corrupt person ever to seek the presidency of the United States.\""}]
