[{"comment_id":"10153638037189778","commenter_b":"Wait. What?!? Trixie, sorry for not telling you, but I cannot have crazy women, or effeminate looking men stabbing people to death in my hotel.","commenter_a":"@username Donovan Hotel? You never said a thing about it. ;)","post_message":"POLICE NEED YOUR HELP! Police say this person is suspect in the stabbing death of a 30-year-old lawyer in NW DC. Please SHARE to help him/her to justice."},{"comment_id":"10154273453111509","commenter_b":"Same thing is happening here in the US","commenter_a":"This is what happens when the liberal party's refuse to listen to the people. They don't want any more migrants.","post_message":"France's far-right Front National party has made gains in the wake of the #Paris attacks."},{"comment_id":"10154567699055399","commenter_b":"cuts? cuts!? SS gave out a wonderful COLA increase for 2017 of ONLY .03%! That amounts to about $2.00 more per month while Medicare just raised their rates over 149%.....FAIR? It is insanity!","commenter_a":"Full severance packages for Medicare/Social Security recipients and contributors. Give them their money back and kiss them good bye. Get politicians out of the retirement/pension/health plans completely","post_message":"It would, among other things, gradually raise the retirement age from 67 to 69 on Americans 49 or younger at the present."},{"comment_id":"10153204606574342","commenter_b":"If she hate America she need to move","commenter_a":"but, she likes their $$$$$$$$$$$!","post_message":"Ariana Grande says she's sorry for saying \"I hate America\" in a recent video that leaked of her in a doughnut shop."},{"comment_id":"1835870700020882","commenter_b":"Woman belong in the streets, your right...","commenter_a":"Every single person that's out there marching there's 10 that wish they could have","post_message":"From CommonDreams: \"The second day of the Trump administration has seen an unprecedented wave of protests swell across the globe, as the Women's March on Washington and its sister marches on all continents—yes, including Antarctica—fight back against the U.S. president's frightening rhetoric.\""},{"comment_id":"10153565687858984","commenter_b":"JAIL HER","commenter_a":"LIAR like her husband.","post_message":"Hillary’s been caught in another blatant LIE regarding her private email server. In a recent interview, Hillary said she had not been subpoenaed by the Select Committee on Benghazi, but records indicate she was subpoenaed in March 2015. Even the press covered it! Rep. Trey Gowdy won’t tolerate her deceit, and neither will we. Send a message to Rep. Trey Gowdy telling him what you think!"},{"comment_id":"991971067506900","commenter_b":"Islam IS the Problem !!","commenter_a":"That would stop all protests if you take a couple of the looters out!!","post_message":"\"After handing over his ID card, the terrorist stabbed one of the officers in the neck and another one in the upper body.\""}]
