[{"comment_id":"1233538923335820","commenter_b":"Well she can shove it in my face.","commenter_a":"Climb back into your closet. We are sick of all of you being shoved in our faces.😈😈😈😈","post_message":"\"I knew going in that I had the opportunity to make history ...\""},{"comment_id":"10153901120586336","commenter_b":"If the current laws are followed and enforced like they should be then no one who should not own a firearm would be able to buy a firearm from a license FFL Dealer. Read about it on the ATF website","commenter_a":"This will do nothing to stop the criminals from doing what criminals do. It will only hurt law abiding citizens.","post_message":"President Barack Obama is reportedly finalizing a proposal to expand background checks by executive order."},{"comment_id":"521423368048243","commenter_b":"so she condones women being nothing... beaten, raped, stoned for no reason...be told what to do and when to do it.. she should live with them for a while without all her money... become nothing ... not human anymore...","commenter_a":"No she doesn't","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way. What a disgrace. She needs to deported to the Middle East. Do you think Nicole Kidman is a sell out?"},{"comment_id":"10152743535041973","commenter_b":"Women don't wreck things? You should've seen what my first wife did to the cable box!","commenter_a":"Sounds like teenagers at play.","post_message":"Eleven large boulders had been dug out of a steep bank below the trail and pushed down an embankment creating unstable soil, which is vulnerable to erosion from winter rains."},{"comment_id":"10155415365743812","commenter_b":"Alfredo Aguilar This comment","commenter_a":"I see Trump's shipment has arrived. This explains his snorting problem. lol","post_message":"U.S. Coast Guard Cutter Midgett crew offloads more than 13 tons of cocaine at Naval Base San Diego that were seized in 21 separate incidents in the Eastern Pacific Ocean. @webpagelink"},{"comment_id":"992971160795677","commenter_b":"Jean Russ Awwww Jean you're so sweet. But Cruz has just shot himself in the foot again with the phony Obama-Rubio photo shot. What is this guy Cruz doing? Sabotaging his own political aspirations? Digging a hole like a mole; no eyes; no direction; tunneling is a blind panic of a junior Senator?","commenter_a":"I just voted for the best GOP candidate in 32 years! I voted for @username!!!","post_message":"TOMORROW: Join me and Phil Robertson \"The Duck Commander\" in Myrtle Beach or Charleston. RSVP here: tedcruz.org/south-carolina"},{"comment_id":"1597744450278312","commenter_b":"Needs the money for Muslim refugees AKA Isis terrorists!","commenter_a":"IF this true, I will be willing to bet that none of those being cut are democrats! JACK","post_message":"Americans will soon find out that they’re not getting the money that they were promised..."}]
