[{"comment_id":"1419268561466221","commenter_b":"Stop reasoning like an idiot","commenter_a":"Nothing lasts forever...whatever goes up must come down.","post_message":"Serena and Venus Williams are KNOCKED OUT of Rio"},{"comment_id":"1391521917576588","commenter_b":"She is one ugly ape!","commenter_a":"Where is the FBI? Where is homeland security? These idiots are threatening the president of the United States.","post_message":"Nasty Liberal Journalist Asks Why Trump Assassination Is Taking So Long INSTANTLY Blows Up In Her FACE!"},{"comment_id":"1680724472211527","commenter_b":"The falwells have been stealing and lying to americans for years. So it goes without saying thieves run together.","commenter_a":"Fallwell has lost his gourd.","post_message":"What a great honor- the Reverend Jerry Falwell Jr. of Liberty University, one of the most respected religious leaders in our nation, has just endorsed me!"},{"comment_id":"10153961148192869","commenter_b":"such a vile, vile woman.","commenter_a":"I don't understand how any woman that has a daughter could vote for Hillary Clinton, sorry she is the poorest excuse for a champion of women and children that I have ever seen.","post_message":"In the war of the Presidential candidates, Donald Trump has taken some heat for his over-the-top characterizations of Hillary Clinton. Admittedly, this is the first campaign in my memory in which one candidate actually called the other a “monster.” But one woman who finds Hillary’s behavior truly monstrous has finally put her name and face behind that charge. This required courage, not just because it goes against the Clintons --- that’s always a scary thing to do --- but also because it relates to the fact that she was raped at age 12 and Hillary defended the man who raped her. The man pleaded guilty to a lesser charge and spent just a few months in jail. This was early in Hillary’s career, in Arkansas, in her one big courtroom trial. (The defendant had reportedly requested a female lawyer.) Certainly every defendant has the Constitutional right to a legal defense, ..."},{"comment_id":"501241236691320","commenter_b":"Yeah but the bride wore a short white dress with cowboy boots","commenter_a":"Why you live a better life you dope","post_message":"I know I've never had pizza at a wedding... The GOOP | Liz"},{"comment_id":"10154218894306350","commenter_b":"Oooooh Emmmmmm Geeeeeee YES Cara!!","commenter_a":"@username we must try these!","post_message":"Find out when you can buy them!"},{"comment_id":"10153076452609705","commenter_b":"They look overfed. People need to cut back on the amount they feed manatees.","commenter_a":"This is only 40 miles north of my house. Heading up Saturday to see them","post_message":"A storm is coming. A storm of manatees. Prepare."}]
