[{"comment_id":"10155187211337871","commenter_b":"Two out of 54 are not very good odds but we can't give up hope.","commenter_a":"Thoughts to the EDITOR of a Free Press by President Jefferson... \"Perhaps an editor might begin a reformation in some such way as this. Divide his paper into four chapters, heading the 1st, Truths. 2nd, Probabilities. 3rd, Possibilities. 4th, Lies. The first chapter would be very short, as it would contain little more than authentic papers and information from such sources as the editor would be willing to risk his own reputation for their truth. The second would contain what, from a mature consideration of all circumstances, his judgment should conclude to be probably true. This, however, should rather contain too little than too much. The third and fourth should be professedly for those readers who would rather have lies for their money than the blank paper they would occupy.\" --Thomas Jefferson to John Norvell, 1807. ME 11:225","post_message":"\"I hate the press. I hate you especially. But the fact is we need you.\" - Senator John McCain jokes, but stresses the importance of a free press to a democracy, adding that \"the first thing that dictators do is shut down the press.\" Read more: @webpagelink"},{"comment_id":"912964402129948","commenter_b":"Great ideas .. And it would eliminate early voting '","commenter_a":"It's incredible how many people are so patriotic on the 4th of July yet not so much on Election Day!","post_message":"This would be a huge step forward towards restoring the integrity of our democracy."},{"comment_id":"10154305889759312","commenter_b":"Walmart doesn't pay a \"living wage\" either. They can't go get a job at Kmart.","commenter_a":"There are a lot of businesses that do this, why only go after jimmy johns? It's not \"unfair\". What are e in 2nd grade? If you work at Pepsi, you can't work at Coke.","post_message":"The state of Illinois says a practice at Jimmy John's is \"unfair to Illinois workers and bad for Illinois businesses. Do you agree?"},{"comment_id":"10152957252332434","commenter_b":"Next we'll be making adultery illegal, I suppose, because that leads to suicides as well.","commenter_a":"France is fucking ridiculous. You can't outlaw people's religious expression. You can't put people on trial for saying what they think, even if it's racist. It's fascistic and wrong. These aren't Western values.","post_message":"Le Pen compared the public prayer of Muslims to the Nazi invasion of France"},{"comment_id":"1495322403831141","commenter_b":"please God help them find this little man let him be safe please let him go home with his family and friends","commenter_a":"Does anyone know where we meet tomorrow to volunteer to search?","post_message":"KPRC2 Robert Arnold is headed out with a couple of people who are helping with search efforts for Marcus McGhee in Pearland. MORE-->@webpagelink"},{"comment_id":"10156528298190206","commenter_b":"She is treacherous!","commenter_a":"IS THIS TRUE???@username, a Republican candidate president and the former CEO of Hewlett-Packard, presents herself on the campaign trail as a hawk on Iran. She promising to take a hardline on the regime in Tehran. However, during her time as the chief executive of HP, she hundreds of millions of dollars worth of products to Iran through a foreign subsidiary, despite strict U.S. export sanctions, Bloomberg reports.","post_message":"I’ve answered hundreds of questions on the campaign trail. Find videos of my answers here:"},{"comment_id":"483709631819617","commenter_b":"FUCK HER and THEM. NONE of THEM HAVE THE AUTHORITY OR POWER to TAKE OUR GUNS!!!!!!!!","commenter_a":"She wants to dictate just like her husband. Make laws she has no business making, and breaking laws as they see fit.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"}]
