[{"comment_id":"10155847652065354","commenter_b":"Susan Sarandon can go lick a monkey's butt....friggin dingbat.","commenter_a":"Susan Saradon should lick the bottom of a seagull!","post_message":"Susan calls her a \"true American.\" But another celebrity has the guts to call out this pop diva's antics..."},{"comment_id":"1016582615062710","commenter_b":"I bet her tits are as ugly as her face. Just sayin.","commenter_a":"You are absolutely the dumbest white woman I have ever seen.","post_message":"Another day, another crazy comment from the View crew."},{"comment_id":"1137271292959073","commenter_b":"Sexist sad people. You know your mother is a woman!","commenter_a":"Hillary is amazing she is a rock! She doesn't go after fantasies, She will be a president like no other. As a female she will be challenged more harshly. Where is her compassion? Where is her Honesty? Where is her strength? Please don't forget she is already feeling and applying all these quialities!","post_message":"“I will absolutely protect your children, yourself, and try to bring your family back together.\" At the #DemDebate last night, Hillary spoke with the mother of five children who have not seen their father since he was deported three years ago."},{"comment_id":"10158321761725206","commenter_b":"Stupid girl","commenter_a":"She initially said he wasn't armed, but then she started screaming at him \"don't do it\" as she had her camera pointed at the ground. Then she started filming them afterwards trying to cover up the fact that he was threatening the police with the gun.","post_message":"A photo has emerged in social media showing a gun at the feet of Keith Lamont Scott lying on the ground after he was shot by a police officer in Charlotte, NC."},{"comment_id":"10152798547942452","commenter_b":"Upon last survey, they only found ~three smelt in the delta! All the smelt live in temperature controlled tanks at UC Davis... to the tune of about $2.5 million tax payer dollars per year. THE SMELT ARE GONE, no matter what they do in the delta. If it weren't the smelt, another fish or animal would be chosen to take its place. We're suckers... hook, line, and sinker! Israel had severe water shortages too... they are now able to be a water exporter. They built reclamation, desalinization, and now have more than they need. California is building an f'ing bullet train to nowhere! But, what if a smelt got pulled into the desalinization plant intake?","commenter_a":"Maybe if our state government quit selling our water rights to Evian arrowhead dasani etc we wouldn't have this problem","post_message":"BREAKING NEWS: California water regulators adopted sweeping, unprecedented restrictions Tuesday on how people, governments and businesses can use water amid the state's ongoing drought. abc7.la/1QkO1GA"},{"comment_id":"10153070826933701","commenter_b":"hes a fag it","commenter_a":"Nope!","post_message":"Heisman winner Marcus Mariota on the loss of wide receiver Darren Carrington to a failed drug test: \"We'll get another guy that's ready to go.\""},{"comment_id":"1086205424749133","commenter_b":"where?","commenter_a":"For the most number of angry emoticons sent","post_message":"Watching the world-record-setting longest hoverboard ride."}]
