[{"comment_id":"10153191924801051","commenter_b":"really wow is all i can say about most of the post. what i have to say on this. i hope the gangs keeps to themselves and kill eachother off only and not hit any one that is not in gangs and not hit children. this world would be better off with out them and there needs to be an end to the gangs white or black there needs to be an end to them and i hope this would be the end. they need to do this more offtin if it gets rid of the riff rats and drugs and robberys and help brings the streets safer. and we might not have to see anyones butts any more. they really need to pull their paints up. i dont like that my kids has to see such things. total disrespect. the ones that love in peice would love this","commenter_a":"maybe the police should see how many gang banger's they can kill in 1900 day's","post_message":"Two gangs in this city are holding a contest to see how many people they can kill in 100 nights. #100Days100Nights,"},{"comment_id":"1311796595543533","commenter_b":"#DontBoo #VoteHillary #NastyWomenVote","commenter_a":"we are not going backward, we are going forward , Best of luck The world President @username \"I am sick and tired of the negative, dark, divisive, dangerous vision and behaviour of people who support Donald J. Trump","post_message":"Don’t miss out! Join them: hillaryclinton.com/makeaplan"},{"comment_id":"10153187015096051","commenter_b":"Carolyn, have some respect. He is our President after all. President Obama has made America great. We don't need Trump to mess it up.","commenter_a":"Agree. Obama is a joke and think the world knows it. He's like a bad kid. Just had to say something because he's mad. And the rest....thought he was talking about himself. The US does deserve better than him","post_message":"President Obama had some harsh words for Donald Trump today."},{"comment_id":"906985682657621","commenter_b":"She didn't come up with it! If she tries to patent it Nicki Minaj will sue her. Nicki said SHE came up with the word. SMH, that word has been around for 20 years.","commenter_a":"She needs to get a copyright or a patent for the word because people these days will try their best to steal your joy! IJS","post_message":"How Kayla Newman Created “On Fleek” While Her Mom Shopped At Burlington @webpagelink"},{"comment_id":"10152716358611680","commenter_b":"Red herring fallacy and straw man fallacy.","commenter_a":"This is sexist and Politico and the lib media are trying to hide this story. Nice try. @webpagelink","post_message":"Kelley Paul says \"to have that label put on him, that really upset me.\" @webpagelink"},{"comment_id":"10153999197086623","commenter_b":"She needs those basement dwelling super predators!","commenter_a":"PLEASE!!!! Don't let the opinions/directions of others, polls, political analysts and outcome predictions determine your participation in the voting process. Register*… Vote… Exercise your right to be heard! *If you are not registered, in some places you may do so in person up to and through election day. Contact your state government voter organization or @webpagelink for more information.","post_message":"\"There is a platform now. I reflected on the things I've heard her say, commit to and seen in writing, and that's how I came to my decision.\""},{"comment_id":"10153994821081409","commenter_b":"Voting should only be done in person with ID on paper ballots. Who marked that mail in ballot? Who is at the keyboard for online voting? Do you have a repeatable count of the votes? Again, voting in person with ID with paper ballot.","commenter_a":"Voting should be the same in every state, county, city, town, whatever. Mail in ballots should be available to everyone. I think eventually we should go to online voting if we can keep the republicans from tampering with it.","post_message":""}]
