[{"comment_id":"10154092301891028","commenter_b":"she hates clowns","commenter_a":"@username and Leonora Fabio Chavez Don't tell Sarah About this lol","post_message":"Nope. The lore of creepy clowns purportedly trying to lure children into the woods sweeping the Carolinas and Ohio just made it to Tennessee. @webpagelink"},{"comment_id":"10153894447031130","commenter_b":"I'm sure that's very concerning to her. News flash: women aren't interested in your opinion of them.","commenter_a":"She is not attractive or funny to me at all.","post_message":"And Amy Schumer looks fab, of course."},{"comment_id":"10153489348776756","commenter_b":"Only a woman could find something completely fucking trivial to bitch about a great thing.","commenter_a":"#FirstWorldNonProblems","post_message":"\"Can I just passively refuse to pass the beach balls back up until they collect around my feet in one incriminating pool? How coldly can I glare at the people who try to resurrect the beach balls I've silently condemned to the ground?"},{"comment_id":"10153277383852098","commenter_b":"It's not typical. Do you think people don't need to know?","commenter_a":"Wow, sharks are seen in their natural environment!! How shocking!😱😱😱","post_message":"SHARK WARNING: Experts say a school of some 20 great white #sharks was recently spotted by the U.S. Coast Guard off a Bay Area coast. READ MORE ---> @webpagelink"},{"comment_id":"10154903561816320","commenter_b":"maybe you can volunteer to carry luggage to plane and save Us some money sore loser","commenter_a":"Let me guess, he'll insist on using his TRUMP Air instead then charge back the cost to the US government (i.e. taxpayers...). Maybe he can make his daughter Tiffany head flight attendant and get her salaried too","post_message":"BREAKING: President-elect Donald J. Trump says he wants Boeing Company to cancel the order on a new 747 Air Force One for future presidents. At more than $4 Billion, Trump says it's \"ridiculous\" and he \"wants Boeing to make money, but not that much money.\" (AP photo) MORE: @webpagelink"},{"comment_id":"1775585642697945","commenter_b":"The dresses are hideous, in my opinion, but leave that baby ALONE! She's beautiful!","commenter_a":"She ain't that cute now but y'all watch she will be a real life ugly duckling story when she gets older","post_message":"Blue Ivy is getting harassed on the internet again."},{"comment_id":"10153107155889411","commenter_b":"Your mother is a terrorist","commenter_a":"Not all muslims are terorist but all terorists are muslim...","post_message":""}]
