[{"comment_id":"940585612654173","commenter_b":"Aleeyah your FB page is wacked out!! Girl I feel sorry for your kid. Get yourself some help. God don't like ugly!!","commenter_a":"Whitefolks did the same thing to Black Slaves, yes it is demonic and insanity. Look whom and what rule we have been unjustly livong under. The girl is showing the affect of what she was taught and learned from her step forefathers the Slavemasters children.","post_message":"Mother accused of intentionally setting her newborn baby on fire enters a not guilty plea, will undergo a mental health evaluation: @webpagelink"},{"comment_id":"1330647500288610","commenter_b":"Killers should be punished .","commenter_a":"evil","post_message":"The U.S. Fish and Wildlife Service said Thursday that necropsies had ruled out diseases as a cause of the eagles' deaths."},{"comment_id":"945417468827008","commenter_b":"Whomever is behind this un-American idea, should be investigated for insanity and on legal terms. The people (or group) seem not to have any interest in America. Has Obama contaminated this too?","commenter_a":"This maybe a big mistake, he is the only one who is not under control of big labor groups and unions, plus I feel the American people are tried of the same old crap, time for a big change.","post_message":"NOOOOOOOO!!!!"},{"comment_id":"735303209993590","commenter_b":"Goog God.Shouldnt there be a law against ugly girls in bikinis?","commenter_a":"Probably wearing a swimsuit!!!","post_message":"What Chelsea Clinton Was Just Caught Doing Could Destroy Hillary's Campaign This puts Michelle Obama to shame. Do you think Hillary Clinton would make a horrible president?"},{"comment_id":"1100419663375801","commenter_b":"HUMMM correct me if I am wrong, but I believe Hillary sold russia 20 % of our uranium, why would she do that.","commenter_a":"Trump is a Liar, a Cheat and Putin adoring Traitor to his country but, he wants to make America White Again and that's all his supporters care about. He played the Race Purity Card and they said Deal Me In! Since then, nothing has changed their minds and nothing will. He's as corrupt as any politician we've ever seen and they just don't care, because they are just like him. They live their lives without a moral code.","post_message":"Chris Matthews: \"Birtherism is not, has not been, a theory; it has been an insistence of some sort of racial test.\" More from Hardball with Chris Matthews: @webpagelink"},{"comment_id":"10153150400359087","commenter_b":"Oh, she's held to a different standard, alright! Her sh*t don't stink. No matter what she does, she's Hillary Clinton, and she's untouchable. Ask General Petraeus.","commenter_a":"Plain and Simple Hillary needs to be in jail period.","post_message":"“This is not a criminal investigation,” former Rep. Ellen Tauscher (D-Calif.) said. “There’s no question about that. It’s dancing on the head of a pin and frankly partisan politics.”"},{"comment_id":"426421217482473","commenter_b":"Yeah, I can picture this foul-tempered, lying, self-centered Socialist with an executive order pen in her fingers! Makes my blood run cold! There is NO WAY this liying, evil woman should ever get near the White House. She would be a foul-tempered dictator!","commenter_a":"Lowlife!","post_message":"Is Hillary Clinton threatening to betray the constitution?"}]
