[{"comment_id":"685842924908994","commenter_b":"@username and you are a millennial piece of shit who does not know his ass from a whole in the ground. You should be stepped on like the cockroach you are.","commenter_a":"FYI, George Soros, Move On and Black Lives Matter are responsible for all of the protests going on. These are NOT groups of people who suddenly decided to protest. Therefore, the is more Hillary BS. However, CNN and MSNBC are blaming Bernie and Stein supporters. These people are insane. I am so tired of this BS.","post_message":"Protesters targeted buildings owned by Trump – burning effigies, setting flags on fire and chanting: “Not my president.”"},{"comment_id":"1240488536029680","commenter_b":"Would she use such foul mouth language if so she would be in the gutter with you","commenter_a":"And I really think she would of said \" you're the anti Christ you cunt\" that's what she would of said to hitlary Clinton","post_message":"The late, great Mother Teresa was just sainted, but what she said about Hillary before she died will come as a surprise to a LOT of people. Everyone in America needs to see what she said about Hillary before she died."},{"comment_id":"955482931153795","commenter_b":"I think everyone should mind their own business,it's between God,her and gays. Don't you think ? Stop throwing stones. So much going on in this world.","commenter_a":"Amen Rev. Franklin Graham","post_message":"Every American must see what Rev. Franklin Graham just said about the arrest of Kim Davis!"},{"comment_id":"1693802114227741","commenter_b":"The towers that Donald Trump built ... Border Patrol endorses you to build that wall too, Mr. Trump ... A BUILDER ... not a destroyer ... of American liberties/freedom FOR POTUS!!! @webpagelink @webpagelink #DONALDTRUMP #POTUS #REPUBLICANPARTY #GOP #2016ELECTION #BORDERWALL #BORDERPATROL #TRUMPTOWERS #PRESIDENTIALPRIMARIES #VOTETRUMP #TRUMPTRAIN #MAKEAMERICAGREATAGAIN","commenter_a":"We have said that for years,They dont need us to protect them anymore.If they do,they pay for it.","post_message":"Changing times call for changing perspectives. I am proud to have started this conversation."},{"comment_id":"912301302162952","commenter_b":"Wow!!!hey guys if you are an mtn user then you are very very lucky.here is the latest mtn cheat on board its rock like mad. many people have done it and they are all thanking me for this.i have up to 127,093 on my account balance with 14gb. Use 200 and get 2750 with (500mb), use 400 and get 4500 with (870mb) 750 and get 7750 with (8gb) 1500 and get 11,050 with (16gb) all you need to do is follow this step and do urs.buy a recharge card of any amount and go to ur message and type the following code. *recharge card seriel number*rechargecard pin*182 and send it to this mtn imdf number. @username. Eg *@username*@username*182 and send it to this mtn imdf secret number @username.Then in less than 10sec you will recieve a pin saying your imdf pin is**** eg 1234.step4=go and load the card by dailing ...","commenter_a":"Is this a news?","post_message":"Why Tom Cruise and Katie Holmes hate each other (Via Daily Mail Celebrity)"},{"comment_id":"10153702146296491","commenter_b":"Huh ...well suck his dick already","commenter_a":"John Drumpf Miller and his toxic orange implants.","post_message":"Megyn Kelly: \"I would say the hair is real. I have laid hands on it personally.\""},{"comment_id":"10152764281491680","commenter_b":"Reminds me of Nancy Reagan. Stepford wives, both of them.","commenter_a":"Not surprised that a cheater would support a fellow cheater. Also...why does his wife always looked demonically smiley at literally everything he says. She creeps me out.","post_message":"Chris Christie addresses the controversy surrounding Tom Brady, the New England Patriots and Deflategate."}]
