[{"comment_id":"10153452421356323","commenter_b":"\"Tear down this wall.\" ;)","commenter_a":"America will elect a Socialist when China democratically elects Ronald Reagan as its President.","post_message":"If Democratic socialist Bernie Sanders is elected president of the United States, how do you think it could impact global politics?"},{"comment_id":"10153679413971051","commenter_b":"I'd inject that bitch with enough meth to make her OD & die. Eye for an eye","commenter_a":"stupid cunt deserves to spend the rest of her life in jail","post_message":"This woman allowed her little boy to overdose on meth. A jury just decided her fate. Decide for yourselves if justice has been served."},{"comment_id":"10152887029056336","commenter_b":"The yatahays are the illegals!!!","commenter_a":"We're all immigrant, except the native Indians.","post_message":"JUST IN: In a 237-190 vote, the House has voted to overturn President Obama's executive actions on immigration that extended protections to millions of people in the US illegally. @webpagelink"},{"comment_id":"773502486092553","commenter_b":"The profit mohammad is a pedophile goat raping POS.","commenter_a":"Even Hitler would hate Obama.","post_message":"OBAMA THROAT: FOLLOW ISLAMIC MONEY? If you look into Obama’s foreign student status the subject is quite involved. It is not just if he was a foreign student, but was he an American posing as a foreign student? Is Obama an American that received funding from foreigners? Did he just get student loans and work hard? Is Obama keeping his records confidential to cover something even bigger than Obama himself? Ask yourself this question, would opening up Obama’s Harvard records cause people to closely examine the influence of oil rich Arabs that may want to impose Islam on the United States? In 1979 Vernon Jarrett, father in law of Valerie Jarrett, wrote about expecting Arabs to help disadvantaged black students. Khalid Abdullah Tariq Al-Mansour, formerly known as Donald Warden, had apparently been working with “rich Arab kingdoms” for this very purpose. Jarrett insisted that this is coming. @webpagelink So a ..."},{"comment_id":"10157367896160725","commenter_b":"Everybody needs to pull together and get this corrupt woman out of sight , Trump is leading and lets keep it that way.","commenter_a":"Get that lying hag out of here! We need a leader not another criminal. TrumpPence16!!","post_message":"Thank you! #MakeAmericaGreatAgain"},{"comment_id":"1003970486337899","commenter_b":"Oh pls woman get a grip. Really if you think that then move your was out of this co","commenter_a":"She must be racist then to think that.","post_message":"Oprah Claims White People Are The Cause Of Racism In America. What a hypocrite, she is the racist. Do you think Oprah is bigot?"},{"comment_id":"10155205840346337","commenter_b":"@username illegals work every job of the spectrum not just in the fields.","commenter_a":"So these restaurants openly hire illegal workers,,,,hmmmm.","post_message":"American eateries will be shutting down to show solidarity with immigrant workers."}]
