[{"comment_id":"10154305617489205","commenter_b":"Filthy slut!","commenter_a":"The world ends tomorrow","post_message":"Donald Trump Appears At Pre-Inauguration Lincoln Memorial Concert"},{"comment_id":"10154732145028690","commenter_b":"@username he will never be found guilty of those accusations. He's too powerful. That family is too powerful. And when it's the word of the victim against the word of the powerful accused, especially in cases of rape and sexual assault, we all know the public will side with the powerful beloved, charming, charismatic Bill. Especially when his wife is about to win a historic election. This speaks volumes about the rape culture in this country. This is the same story played across this country everyday. This is why so many women remain silent. As someone who values national security and the reputation and values of this country, I can't in good conscience vote for either of these abhorrent people. Trump is the orange muppet love child of Ford Fairlaine and Biff from Back to the Future, and the Clintons are the example of a powerful enterprise who represents ultimate ...","commenter_a":"Bill Clinton isn't up for election, that argument is lame and dead as some are trying to compare these events. What Trump said amounts to sexual assault...\"you grab them by the pu***.\" Trump has been accused many times of sexual assault and rape, with the latest accusation raping a 13 year old girl. If guilty, Trump should be spend the rest of his menial life in prison. Trump is unfit.","post_message":"\"Horrific\", \"sickening\", \"poisonous\" - Donald Trump blasted over lewd and sexually charged comments he made about women @webpagelink"},{"comment_id":"10153915007936336","commenter_b":"TRUMP the first one to say BUILD THE WALL. TRUMP the first one to say DEPORT. TRUMP the first one to say BOMB the hell out of the ISIS Oil Fields. TRUMP the first one to DEMAND LEGAL IMMIGRATION. TRUMP was the ONLY one to say NO refugees from countries that hate America! #TRUMP2016! - the best & ONLY choice to secure America!","commenter_a":"Let me see? Agreements with murdering Cuban communists and Iranian murdering Islamic terrorists. Agreements with such allies only means that they remain our enemies!!!!?","post_message":"Breaking News: The U.S. and Cuba have reached an agreement to resume commercial airlines service."},{"comment_id":"10157252417295354","commenter_b":"TRUMP...Build that wall!","commenter_a":"Ten accused, 3 convicted, 2 still not apprehended. One was going to use his \"Federal Education Aid\" money. Didn't see their citizenship status though. Planned to show ISIS how easily they can cross through our Southern Border. What say critics of a wall or temporary ban of refugees now?","post_message":"They're here."},{"comment_id":"574645872704026","commenter_b":"@username so a woman that let Americans die that's the kind of person you think deserves to be president cause it's gonna be between the 2 think about that witch one is really worse","commenter_a":"Things will change when Trunp is president. The border police will have Trumps support. He'll also will support the Police & our brave service men & women. Vote Trump!","post_message":"Well that was easy..."},{"comment_id":"1350752595003273","commenter_b":"Michelle is beautiful and elegant. However, she isn't even giving Trump a chance. We gave them 8 years. I'm so grateful Clinton lost.","commenter_a":"Good answer Trump","post_message":"During an interview with Oprah Winfrey, first lady Michelle Obama said that there was \"no hope\" under Donald J. Trump. The president-elect didn't sweat it, though... his response was PERFECT. This is why Trump will be such an epic president..."},{"comment_id":"1081696675193718","commenter_b":"Y.e.s. lol","commenter_a":"@username is this the lovely place you worked?","post_message":"Thanks to #KPRC2 viewer Harold K. for this video of a manhole cover flooding outside the Houston Museum of Natural Science. Live coverage --> @webpagelink Radar --> @webpagelink Photos --> @webpagelink"}]
