[{"comment_id":"1078205312195129","commenter_b":"She will walk! MSM will guarantee it.","commenter_a":"She served on the Watergate committee. That's where she got the idea. Hillary did get fired from that commission for lieing. She is the original old crony.","post_message":"Hell, Nixon only erased 18 minutes. Hillary erased literally everything."},{"comment_id":"1812447718973572","commenter_b":"Trump could not be trusted with his own password on Twitter!","commenter_a":"Habeis conseguido que este mas hasta los huevos de los que hablan de Donald que del pato.","post_message":"Only four days until the inauguration! Who will be meeting president-elect Trump today?"},{"comment_id":"1587336334908184","commenter_b":"Fire HER butt.","commenter_a":"Can't stand her anymore. She is a petty, spiteful, conspirator.","post_message":"Should Fox News FIRE Megyn Kelly? YES OR NO:"},{"comment_id":"10158119548295603","commenter_b":"We have to hate ILLEGAL immigrants.... GOT IT!","commenter_a":"Maybe it could be an anti-bullying lesson...? You know, if he says or does anything like he did THOSE OTHER TIMES... That we have recordings and videos of him... Doing horrible things.... And saying horrible things...","post_message":"Thoughts?"},{"comment_id":"935661276474731","commenter_b":"Entitled because men who sit that way feel entitled to the space they take up. If they take up 3 spaces those are two people who are standing that could have been seated. Not only are they denying people access to a seat, these men are making whoever is sitting next to them very uncomfortable. These men have no idea they are doing this, therefore their taking up of incredibly more space than others is more important than others feelings, never mind they feel they are more entitled to take up 3 spaces than 2 more people are entitled to a seat. Did you see the picture from Seattle? Two men were encroaching on this poor girls space! Yes there are other issues in the world but do you see that feminists ALSO pay attention to them as well? We are capable of multiple thoughts you know. And keep in ...","commenter_a":"..... why is this seriously an \"entitlement\" issues? Do you not see how pathetic it is to be upset because of \"spreading \"? For fuck sake, you're criticizing posture, might add well discuss \"man shaving\" why can't a woman shave get fave without feeling ostracized? Or \"man shoing\" why can't shoes be unisex, why are they discriminating against what gender you have to be to wear a pair of shoes? Or my personal favorite \"man shirting\", why are men's buttons put on one side and women's buttons on they other side. Dear god, these misogynistic assholes have gone to far with their shirts... give me a fucking break. This is, by far, the most unflattering and pathetic issue discussed in the feminist movement. Take on real issues and matters that actually affect these everyday women, the glass ceiling, wage differences, rape offenses. Giving time and thought into little things like ...","post_message":"They both spread their legs on the subway, but only one raised eyebrows. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"907515899315838","commenter_b":"Thought it was Vermont?","commenter_a":"And yet the latest FBI Uniform Crime Report shows that Maine is the safest state in the US. Hmmm...Coincidence?","post_message":"They're quarantining themselves!"},{"comment_id":"10153128866595329","commenter_b":"Feminists brats don't want to objectified by men, but flock to articles like these. Hello, double standard. You ladies should be ashamed.","commenter_a":"Thank you!!!!","post_message":""}]
