[{"comment_id":"726130267546926","commenter_b":"Bitch go make me a sandwich hold the mustard.","commenter_a":"I love how a bunch of \"men\" feel so threatened by strong women!!!!","post_message":"Demonstrations took place in England, Ireland, the Netherlands, Italy, Kenya, Mexico, Canada, Brazil, the United States, Australia and many other countries."},{"comment_id":"10154428619792144","commenter_b":"Kimberly, other than Melania Trump, you wouldn't know an illegal immigrant from a U.S citizen if your life depended on it. Get ahold of yourself woman!","commenter_a":"Seriously????? Let it go.....He's done, THANK GOD!!!!!! The end of an ERROR....","post_message":"Thank God."},{"comment_id":"10153045402661336","commenter_b":"Shut up idiot!!!!","commenter_a":"Early Bird gets the cage","post_message":"A Georgia sanitation worker has been sentenced to 30 days in jail for picking up trash too early in the morning."},{"comment_id":"1544946612212472","commenter_b":"Superior to a chimp maybe.......","commenter_a":"He's such a moron! And his father has the nerve to say he has superior genes!","post_message":"What an idiot!"},{"comment_id":"550313591806506","commenter_b":"@username stop trying. Your Hillary will not succeed and if she does she will be taken to jail right after.","commenter_a":"NY press trying to destroy Sanders before the primary? Shocker.. Does anyone really trust any of the media outlets these days? I haven't for almost 10 years..","post_message":"This Bernie Sanders interview did not go as planned..."},{"comment_id":"963694916975312","commenter_b":"Actually, Pro-Life is fighting for the rights of unborn females while Pro-Choice believes that unborn females have no worth. If anybody is hating women, it is those who don't mind if they are killed while still very young.","commenter_a":"go ahead and have your abortion if you want it, but one day the consequences will come back to you, there are consequences to everthing","post_message":"\"People need to know that women have abortions every day and they go on and live their lives”"},{"comment_id":"521423368048243","commenter_b":"so she condones women being nothing... beaten, raped, stoned for no reason...be told what to do and when to do it.. she should live with them for a while without all her money... become nothing ... not human anymore...","commenter_a":"No she doesn't","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way. What a disgrace. She needs to deported to the Middle East. Do you think Nicole Kidman is a sell out?"}]
