[{"comment_id":"1194644643902280","commenter_b":"Build that Wall!!!!!!ðŸ‘ðŸ˜ƒ","commenter_a":"Yes but did anyone die?? CA is full of Illegals.. Probably the judge is as well.. Give em Hell Trump!ðŸ‘","post_message":"U.S. District Judge Gonzalo Curiel in San Diego called for the documents to be released."},{"comment_id":"10155928923344199","commenter_b":"This is the best.","commenter_a":"Breanna Barrick","post_message":"'Church, singing and sex:' That's what this couple says has kept them together for 75 years! More: via.q13fox.com/Xirhe"},{"comment_id":"555784677879905","commenter_b":"They're not looking for life, we are looking for resources, we kill each other for that in this planet. When we find the other resources the inhabitants of set planet will surely deliver our faiths.","commenter_a":"So anti media feel stopping space exploration will solve earths worries? ?Sorry but go the space programs and all the science behind it!","post_message":"Right? Follow us --> The Anti-Media <--"},{"comment_id":"10154592575994062","commenter_b":"Hang these neggos today !!!","commenter_a":"They don't even care that they took someone life, so no one should care when they are giving them the chair","post_message":"TODAY: 4 accused of robbing a Houston restaurant and killing a man are scheduled to appear in court."},{"comment_id":"1310434322356653","commenter_b":"@username you brought the feminism in when you started defending being a hoe","commenter_a":"Only one thing I disagree is he could have waited till the sun came out more to take her and the kids out. I don't blame him for his actions if his busting his ass to provide for her and the kids. If they your kids. Please don't abandon them. And she should be grateful he didn't hurt her. I'm praying they work it out for the kids if their his.","post_message":"He felt the punishment fit the crime. #WSHH #Cheating"},{"comment_id":"10153233109924170","commenter_b":"DEPORT ALL ILLEGALS !!!!!! Put Americans back to work !","commenter_a":"hes an idiot","post_message":"Chuck Schumer is doing his absolute best to play the blame game in regards to his terrible immigration bill. ...And it's all about paving the way for 2016 race-baiting."},{"comment_id":"10157702092900354","commenter_b":"And yet she's still allowed to run for POTUS... And there are still fools who will vote for her","commenter_a":"They thought no one would ever notice .","post_message":"The Clinton Cash Foundation is a $2 Billion Corruption Racket."}]
