[{"comment_id":"712618255553616","commenter_b":"They are giving your money to the illegals.","commenter_a":"Moral standpoint! My husband is on disability because of 2 strokes. He cannot even get a part time job because of his disability. I'm on social security and we both do not make enough to get us through the month. We worked for our social security. It is our money. I hope people who are in the same boat as us will stand up to this major jackass!","post_message":"Trump will slash anything, as long as it doesn't affect HIS wallet."},{"comment_id":"10153820494546350","commenter_b":"i see Kate in her lol and Will in George","commenter_a":"Princess Charlotte looks like her daddy, adorable.","post_message":"Princess Charlotte has grown so much in six months! We just can't handle the royal cuteness! on.today.com/1IrSwdd"},{"comment_id":"579913498825579","commenter_b":"Why not ?","commenter_a":"I want to be a billionaire....you got a problem with that?","post_message":""},{"comment_id":"10153432982041262","commenter_b":"Haha. That was sarcasm.","commenter_a":"Every month is Teacher appreciation week, they only work about 6 months out of the year and get paid for a full year.","post_message":"Tag a teacher that has made a difference in your life."},{"comment_id":"1551588725149374","commenter_b":"Rest in the arms of Jesus little man. The world is praying for your family.","commenter_a":"you are in my prayers little angel. So are your mommy and daddy.","post_message":"Our hearts go out to the family of 2-year-old Nebraskan boy, Lane Graves."},{"comment_id":"1480511455341931","commenter_b":"Definition of Goldigger: A woman who dates men purely to extract money and gifts from men; in particular a woman who strives to marry a wealthy man.","commenter_a":"She only came for the boat. Now she's trying to act like she's not a gold digger. Too late","post_message":"This is the Tinder date from hell"},{"comment_id":"975573942535660","commenter_b":"I'm not American but,I live here and I love to live here!And Hope to be in army or something one day I think dems are so much smarter! Let's go dems!","commenter_a":"brain dead","post_message":"RIGHT ON! Bernie just hit it out of the park at the Democratic debate when asked if he's a capitalist."}]
