[{"comment_id":"486778464846067","commenter_b":"@username Your a FREAKING DUMB EXCUSE FOR A SO CALLED HUMAN BEING!","commenter_a":"What do expect out of a Muslim bitch that won't even place her hand over her heart when National Anthem is sang.","post_message":"Michelle Obama just said something treasonous about the flag. This is ridiculous, that flag is the symbol of the greatest nation on Earth. Do you support the American Flag?"},{"comment_id":"1184855771553940","commenter_b":"I won't be watching @username tonight. I will not be watching that Hag!! Why is @username making such a big deal out of THAT LYING WITCH??","commenter_a":"Here's me not watching","post_message":"\"We know that Russian intelligence services... hacked into the DNC.\" Today on \"Fox News Sunday,\" Hillary Clinton commented on the recent hack and Donald J. Trump's attitude towards Putin."},{"comment_id":"1031214057011772","commenter_b":"Keeps women from cheating lmao","commenter_a":"So, she wants to be registered, heavily taxed, and locked up at night?","post_message":"Pure gold..."},{"comment_id":"1092384094157698","commenter_b":"This is a shame, but not unexpected.","commenter_a":"No backbone!!!","post_message":"Donald Trump's takeover of the GOP is complete."},{"comment_id":"10152796636027217","commenter_b":"where are the women","commenter_a":"Check their passports and visas ...","post_message":""},{"comment_id":"10153111223750779","commenter_b":"@username You're such an, asshole.","commenter_a":"Donald Trump for President","post_message":"Billionaire celebrity G.O.P. presidential candidate Donald J. Trump will host an upcoming episode of Saturday Night Live."},{"comment_id":"10154433599628812","commenter_b":"Good for you, we have got to keep Hillary out of WH we cant take 4 more years of failure!!","commenter_a":"Neither believe in Science/ man made climate change- Disqualified to hold office!!","post_message":"Senior level Trump campaign sources confirm to ABC News that Speaker of the House Paul Ryan will be endorsing presumptive GOP nominee Donald Trump: @webpagelink"}]
