[{"comment_id":"10153119692871130","commenter_b":"ughhh these bitches Emily Lee","commenter_a":"Can't wait!","post_message":"See how far women's rights have come in the first trailer for one of the year's top Oscar contenders: Suffragette, starring Carey Mulligan, Helena Bonham Carter and Meryl Streep."},{"comment_id":"546660998833704","commenter_b":"Yes! Please Do not get into Roe vs. Wade! It is settled law. Let women decide this issue.","commenter_a":"Ben, the worst thing you could do tonight in the debate will be to fall into the liberal media's trap. CNN CNBC and the rest of the liberal media wish to turn this debate unto a boxing rim once again. At the end, it will hurt the Republicans and that is the liberal media's purpose. They intend to make you fight Trump. They want to bring you down, the liberal media though. DO NOT FALL INTO THEIR TRAP!!!!!","post_message":"Thank you for all the kind words of encouragement leading up to the debate tonight. I know I don't stand alone, as We the People stand together to Heal, Inspire and Revive. Please make sure to send me your pictures throughout the day and during the debate at bencarson.com/standwithben!"},{"comment_id":"10154064486021509","commenter_b":"Sure they alienate all woman","commenter_a":"A lot of you folks are so quick to follow the narrative. There has not been a debate in years. Just mud slinging and popularity contests. One thing is true though, the only thing the Clintons should be doing is life in prison. What a dirty dirty dirty duo.","post_message":"Could the GOP's opposition to Planned Parenthood at the #CNNDebate be a general-election vulnerability? Hillary Clinton's top aides seem to think so: @webpagelink"},{"comment_id":"1220652477966511","commenter_b":"LOCK HER UP! LOCK HER UP!","commenter_a":"Lock her up!!!!","post_message":"Live: Donald J. Trump delivers a speech at the VFW National Convention in Charlotte, North Carolina."},{"comment_id":"1286627034690657","commenter_b":"Nope she will lose","commenter_a":"Hillary Clinton the next President of the United States.","post_message":"'WE HAVE A VERY SERIOUS PROBLEM' Hillary Clinton points out a striking divide in the criminal justice system in America during Sunday's NBC News-YouTube #DemDebate. Catch all the highlights here: @webpagelink"},{"comment_id":"10154189944991320","commenter_b":"NO WHITE PEOPLE DO THIS...BLACK AND LATINO....NO CHINESE....NO IRISH....NO ITALIANS.....NO GERMANS....NO SWEDISH...... NO LATVIANS.......BLACK AND HISPANIC PIECES OF S..T","commenter_a":"Try Linden Blvd. and Pennsylvania Ave.","post_message":"The NYPD made its inflexibility clear, dirt bikes and ATVs are illegal in the city, break the law and arrests will be made and the seized vehicle will be destroyed. @webpagelink"},{"comment_id":"1774993129450173","commenter_b":"Ask him about carpet bagging the truth by billionaire media monopoly","commenter_a":"Thanks for discussion very informative","post_message":"Special debate coverage: Amy Goodman and Nermeen Shaikh host a pre-debate roundtable from 8-9PM ET with Kimberlé Williams Crenshaw, Melina Abdullah of Black Lives Matter - Los Angeles, Gyasi Ross, Soraya Chemaly, The Intercept's Lee Fang and Rashid Khalidi, followed by an expanded debate giving third party candidates a chance to respond to town hall questions. Jill Stein of the Green Party joins us from St. Louis starting 10:30PM ET. Tune in at democracynow.org/debate & post questions for our guests using #expandingthedebate."}]
