[{"comment_id":"616770258526486","commenter_b":"Feminists and think is a oxymoron","commenter_a":"I swear liberal women are just craving the fashion culture and using \"civil rights\" as a defense for it. They just want to wear a pretty head scarf because they crave culture.","post_message":"www.EagleRising.com"},{"comment_id":"736610399801339","commenter_b":"Then vote for Jeb the choice of illegal aliens","commenter_a":"We need Trump to win and not another Bush.","post_message":"I'm running with heart and running to win. It¹s time to unite to defeat Hillary Clinton. Watch:"},{"comment_id":"10158323534995594","commenter_b":"Stupid idiot. He is not sending out legal immigrants.","commenter_a":"Closing stores and businesses won't make America Great Again","post_message":"“I feel like I want to put the message out that I am ashamed that I gave him my vote, and I wish I could repeal and replace my vote for him.”"},{"comment_id":"10156266292905294","commenter_b":"He was white u racist b*tch","commenter_a":"Probably some ghetto trash. Where is Obama when blacks rob??? Where is he?","post_message":"The Papa John's Pizza regional manager said a man entered the store with a gun and demanded money. A chase began shortly after:"},{"comment_id":"10153722201678812","commenter_b":"He is a Hero..","commenter_a":"Prayers for family. The boy is a hero","post_message":"Charlie Finlayson had to leave his father and set off alone on a hiking mission to find help: @webpagelink"},{"comment_id":"10153617049593984","commenter_b":"Hillary's a woman chaser to.","commenter_a":"Bill has Always been a Woman chaser... Hillary Must been doing something Wrong... Or she's to busy Scamming People out of their Money.....","post_message":"This woman has struck fear into the hearts of the Clintons for a long time. Now she may have just landed a knockout blow on Hillary... This could be what takes Hillary down. Do your part to make sure that happens by spreading this article to your friends and family."},{"comment_id":"10154262387346509","commenter_b":"What is justice? Isn't it making something \"just\"? If so, how is justice possible in cases where the crime can't be reversed? If someone steals a $100 bill, justice can be had by paying it back to the victim. You can't undo rape, murder, abuse... etc. So then it comes down to punishment, coping, and vengeance. Punishment is negative reinforcement to change someone's behavior. Coping with a problem is minimizing or eliminating the threat. If someone is an immediate threat and won't be considered fit to be in society, that means prison or death. Vengeance is just getting revenge and causing suffering to deal with suffering/pain.","commenter_a":"I hope the suspects are found alive, justice must be served","post_message":"“I heard rapid shooting — just boom, boom, boom …” Eyewitnesses describe the scene of a mass shooting in San Bernardino, California. @webpagelink"}]
