[{"comment_id":"891182254405684","commenter_b":"He has already done a better job than Obama ishani August ,why don't you move to Cuba or the middle east,there you would find out what \"raping \" in a country is all about.do you feel safe with open borders?","commenter_a":"I am just so proud of President Trump, he is keeping his promesses, he is a man of his word. Wait until he gets sworn in, things will start moving for great changes.","post_message":"Do you support our president, Donald Trump? Comment YES or NO."},{"comment_id":"1166185690114851","commenter_b":"I agree Awesome comment thanks :/","commenter_a":"OG gives zero fucks","post_message":"Uber driver loses it after man smokes weed in his car"},{"comment_id":"10153956564519087","commenter_b":"@username She is a corrupt bitch that I would never vote for president.","commenter_a":"That's the only vote that I will give Hillary.","post_message":"According to Twitter, the most retweeted tweet of the third day of the Democratic National Convention was posted by Donald J. Trump."},{"comment_id":"10153201313814255","commenter_b":"How is this even legal?! How do these cretins get to refuse to act on ONE thing because they don't LIKE another?!!!!!","commenter_a":"Geriatric Mutant Ninny Turtle. Competing with Agent Orange to see who is the worst leader in Congress.","post_message":"Thugs."},{"comment_id":"1630541213899658","commenter_b":"I TOTALLY AGREE..........ILLMINATE THEM AS SOON AS POSSIBLE..OR they will do it to YOU first!!!!!!!!!!!!! They DO NOT NEED to be here in the US of A but ONLY TO KILL MORE Americans.shoot first ask questions later.","commenter_a":"Dang, I need to get out of this hell hole state of celebrity librals and move to Texas where leaders are more concerned with the safety of our nation and not the designer dress to wear to the next award party.","post_message":"Get em' Sheriff... This is why you don't mess with Texas."},{"comment_id":"1407030135990971","commenter_b":"pugsky er uhyggelig","commenter_a":"@username Jeg ønsker mig en bullpug!","post_message":"Lots of adorable, slightly sad faces."},{"comment_id":"10153163452101770","commenter_b":"sick thugs","commenter_a":"Good! Time to show respect..","post_message":"Two students who attend a public high school in small-town Tennessee are reportedly spending the first weekend in December in jail because they wore saggy pants to school one too many times."}]
