[{"comment_id":"1812875395612222","commenter_b":"@username......................your a @&$)(:; fool","commenter_a":"Such a BS! Obama made a deal to stop nuclear proliferation. Iran's compliance with our demands lifted the sanctions. So they got THEIR money. Eric Trump is total idiot thinking he knows anything about this matter.","post_message":"\"[President Obama] lied about it. He said that it wasn't ransom money... No different than when he lied about ObamaCare.\" Yesterday on \"Sunday Morning Futures,\" Eric Trump accused President Obama and Hillary Clinton of lying to the American people."},{"comment_id":"10153631849906770","commenter_b":"I can't stand her","commenter_a":"That is why lying Hillary and Obama likes her. They are all LIARS!!!!","post_message":"Rep. Trey Gowdy blasted Attorney General Loretta Lynch on Wednesday, arguing her testimony before Congress was \"a total waste of time and a total disservice to my fellow citizens."},{"comment_id":"396582543845311","commenter_b":"Richard J. Lindner She Did Commit Perjury, Destroyed Evidence Under Subpoena GET OFF THE H-TRAIN","commenter_a":"Repost: Federal Law: Title 18. Section 2071 Can it be any clearer? Former United States Attorney General Michael Mukasey tells MSNBC that not only is Hillary Clinton's private email server illegal, it \"disqualifies\" her from holding any federal office. Such as, say, President of the United States. \"If you do this or that bad thing, you've essentially disqualified yourself as being the leader of the free world,\" said Mukasey, referring to the illegal server and the illegal handling of classified materials. Mukasey specifically points to one federal law, Title 18. Section 2071. For those of us who do not have United States Code committed to memory, here's what it says: (a) Whoever willfully and unlawfully conceals, removes, mutilates, obliterates, or destroys, or attempts to do so, or, with intent to do so takes and carries away any record, proceeding, map, book, paper, document, or other thing, filed or deposited with ...","post_message":"BAM!"},{"comment_id":"10154200210407411","commenter_b":"She has to pay her daddy","commenter_a":"Why doesn't she sue to stop the pay of the Senators/Representatives who's job it is to pass a balanced budget but who haven't done so in almost two years? It seems highly suspect to punish people who do their job but allow those who are unable to complete their primary assigned task to continue to be paid. Again, politics over people. Sad.","post_message":"Illinois Attorney General Lisa Madigan is seeking to stop state worker pay until legislators and Gov. Bruce Rauner approve a spending plan."},{"comment_id":"10153805458826337","commenter_b":"Is that chick is his girl?","commenter_a":"Vanessa Delgado where was this ride when we went damn man that looks cool","post_message":"Watch DeStorm Power escape Call of Duty's Black Ops 3 Shadows Of Evil Ride at Six Flags!"},{"comment_id":"10154984816883797","commenter_b":"I hope this women knows that dying is the easy way out that she is not going to get.","commenter_a":"I utterly despise anyone who would harm and even go so far as to kill a child, ESPECIALLY the parent of the children.","post_message":"BREAKING: A statewide Amber Alert in Indiana has been canceled after a 7-year-old girl and 6-year-old boy were found dead Monday."},{"comment_id":"10153882688173984","commenter_b":"We have created the Immigration Laws for a reason and when needed we have enhanced them to be stricter. Anyone that thinks anyboby that does not come into our country legally should be allowed to stay are Un-American. They are taking Jobs from hard working Americans. There is no excuse to let them stay.","commenter_a":"Even Bill O'Racist recognizes how evil Adolf Trump's plan is...wow","post_message":"Bill O'Reilly thought it was a good idea to try and teach Trump a lesson about his deportation plan - it definitely didn't work out for him... Do you agree with Donald J. Trump on immigration?"}]
