[{"comment_id":"10155187593643352","commenter_b":"Women do the same thing every day...I'm happy for these guys...lol","commenter_a":"He need a damn job like Mary j blidge husband. They some damn bums","post_message":"Do you believe this? Lamar Sally is taking Sherri Shepherd back to court for an additional $75,000 on top of the $4,100 in child support she already gives him every month. What is he smoking? ----> @webpagelink"},{"comment_id":"10153649665288352","commenter_b":"Also he still has a dick so HE is still a man. No woman has a dick and balls","commenter_a":"Kylie is the insensitive one for calling Catilyn her DAD ...","post_message":"KYLIE JENNER CHECKS CHRIS BROWN OVER HIS POST ABOUT HER DAD"},{"comment_id":"1587336334908184","commenter_b":"Fire HER butt.","commenter_a":"Can't stand her anymore. She is a petty, spiteful, conspirator.","post_message":"Should Fox News FIRE Megyn Kelly? YES OR NO:"},{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":" is just it's a wonderful line. I own some of it. I fully I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"10153080990943812","commenter_b":"Scumbag","commenter_a":"Why wasn't the mother given custody ? Custody was given to a parent with mental ssues ? This is not the rest of the story yet . Florida fails aagain and again we hear about more changes. Meanwhile NO ONE is held accountable and a child is dead. Oh well.","post_message":"UPDATE: Attorney says she reported to authorities that father was acting erratically before he allegedly threw 5-year-old girl from bridge to her death in Tampa Bay: @webpagelink"},{"comment_id":"401586413362986","commenter_b":"Cut off her welfare check!","commenter_a":"and they raised a boy? No wonder","post_message":"Michael Brown’s mother decided to show her true nature when she said this..."},{"comment_id":"10153946404822439","commenter_b":"They invited these people into their country. Their circus. Their monkeys. When their country implodes, we must absolutely seal our borders against European refugees. Let them stay home and fight or die. Euronate on them. We don't want their disease, here. We have enough of their kind already.","commenter_a":"Poor refugees, still weak from their flight to Sweden. Let's hope Gustavus Adolphus is not entirely dead yet.","post_message":""}]
