[{"comment_id":"10157168676140293","commenter_b":"Get off it already. There are bigger issues in our country to deal with such as gun control, racism and all these shootings, immigration, abortion, same sex unions, and the list goes on. Not whether or not she used the same words as our current first lady or not. I don't care if she copied the whole speech word for word as long as he can put our country in better shape than out current president and first lady.","commenter_a":"Not her fault...She just read what they gave her.. Don't blame her...","post_message":"Melania Trump's speech last night at the 2016 Republican National Convention is now the subject of a plagiarism controversy. READ why some are saying some of her words were lifted from the current First Lady:"},{"comment_id":"10153981739504091","commenter_b":"Go stick your head in a latrine!","commenter_a":"What did he know about the Clintons?","post_message":"RIP: The star of reality series Ice Road Truckers on HISTORY was killed in a plane crash while he was planning to film a show about recovering plane wrecks."},{"comment_id":"10152823954416130","commenter_b":"Sorry for caring about Charlotte by the way","commenter_a":"If this jerk telling you to get them isn't reason enough NOT to, then I don't know what is...","post_message":"\"The science is, you know, pretty indisputable. We’ve looked at this again and again. There is every reason to get vaccinated, but there aren’t reasons to not.\""},{"comment_id":"10155637604520354","commenter_b":"BO is merely the `uncriticisable blackface` of liberalism. Hillary is much more evil because she knows what she is doing.","commenter_a":"Obama has a plan....and it's working.","post_message":"This is what Obama calls \"defeating ISIS\"?"},{"comment_id":"10155551213935354","commenter_b":"If they kill all the whites who is going to work and pay thier welfare, food stamps, medical bills, and supply thier free housing? If they have to pay bills there won't be any money left over for drugs!","commenter_a":"black nation? you mean like haiti,or africa...or anyplace where they arn't feeding off white people..these freaks should have been extinct a hundred years ago,most are tired of feeding and housing them..","post_message":"SHOCKING...."},{"comment_id":"1640584582874588","commenter_b":"Arnel, stay away from my dog. Haaaaaaaaa!","commenter_a":"We should not reward liars... reject Hillary.","post_message":"“We should not reward people who use inflammatory rhetoric, who use the kind of derogatory comments, whether it's about Muslims, or Mexicans, or women, or people with disabilities, whoever it might be,” Hillary Clinton said, referring to Donald Trump. “That is not a sign of leadership. That's a sign of, you know, showmanship, of desperation, that should be rejected roundly by the American people.”"},{"comment_id":"10157375742785389","commenter_b":"The elections are rigged, may not be ACORN this time, but the MEDIA. Republican elite want to protect NAFTA, TPP and Global trade to keep filling their pockets with billions, Wall Street billionaire CEOs all from both parties are campaigning with criminal Hillary because she will protect Global trade agreements.. TRUMP is the only one who will bring back manufacturing, take back our technology which is now stolen by China as it was by Japan 50 yrs ago,stop letting immigrants invade this country, and stop giving money and our military lives away to build up foreign countries, Honestly, I don't care what he says or how he does it , because the USA has no more chances.WHERE IS CRIMINAL HILLARY GETTING JOB # 1 FOR 1 UNEMPLOYED AMERICAN ???? ,.....AND IT BETTER NOT BE A GOVERNMENT SERVICE JOB,PAID BY TAX MONEY TO CREATE BIGGER GOVERNMENT AND NO REAL UPWARD PROSPERITY ...","commenter_a":"Get used to it. Obama is supporting these terrorist organizations and Hillary will follow!","post_message":"\"We have an existential threat against the American homeland and the American people because of what this administration has done.\" Oliver North said the $400 million given to Iran will not only support terrorism, but will help Iran and North Korea move closer to creating nuclear weapons."}]
