[{"comment_id":"10153464063176509","commenter_b":"Don't correct what I wrote, Gail Mac! Mind your own business. Sarah Palin has no intelligence at all!","commenter_a":"Why her, can you not find someone better with no baggage and have a mother who has no brain.","post_message":"Bristol Palin and Medal of Honor recipient Dakota Meyer are engaged. Meyer, a Marine who received the nation's highest military honor, announced the news on his Instagram account. @webpagelink"},{"comment_id":"10153270679648984","commenter_b":"Get rid of them","commenter_a":"Didn't look bcz I don't care much for trash","post_message":"Holy cow, I did not see this coming! After so many years lurking in the shadows!"},{"comment_id":"10155149699869558","commenter_b":"I just watched two segments of news, that being just a plain old person, it seems to me could be mutually worked out to everyone's benefit. It costs to become a citizen. AND our infrastructure is failing..Why cant' we find how willing these people are to be here by having them work for 2 or 3 months for construction, they could work for 4 hours for free to pay for citizenship, and 4 hours for pay for living expenses, A place to stay would be provided while they go through a 2 or 3 month vetting and so prove they really want to be here and are willing to honestly work for it.","commenter_a":"All you americans opposing trump are thick as hell he trying to save your country leave him alone let him do what is needed i wish we had him back off dont be thick all your lives","post_message":"\"That's not press bias. That's blatant dishonesty... The illegal immigration issue has been set up by the media to demonize Mr. Trump as a racist and a brutalizer of the poor.\" In his Talking Points Memo tonight, Bill O'Reilly ripped the mainstream media coverage of federal immigration officials arresting more than 600 people across at least 11 states last week. MORE: @webpagelink"},{"comment_id":"10159083149270206","commenter_b":"I'll lick your eyeballs #nohomo","commenter_a":"@username do u think this works for pink eye?","post_message":"This woman gets paid to lick people's eyeballs."},{"comment_id":"581422622060041","commenter_b":"Hahaha!! Funny!! \"Blacks are lazy\" \"Super Predators\" \"Heel\" -Hillary Clinton on blacks","commenter_a":"Make America dumb again is his slogan this guy caught on tape making fun of so many people she makes a mistake with emails an everyone losses their minds he's not for the people of different cultures he order his supporters to attack people an they did why are you voting for him that's the real ?","post_message":"With Medal of Honor recipients seated behind him, Donald J. Trump tells supporters: \"They're so much more brave than me. I wouldn't have done what they did. I'm brave in other ways ... I'm financially brave.\" @webpagelink"},{"comment_id":"10158316177600725","commenter_b":"So who was the \"Grown-UP\" the past eight years? We have had the most un-American couple in the White House, so glad to see them go! (It's a shame they will still be in the country.)","commenter_a":"Definitely need a growth up and not a coward. Glad we finally will have one that fits both","post_message":"In one of her final interviews as first lady, Michelle Obama revealed just how much the election has reshaped her view of her husband's administration."},{"comment_id":"1706307999389223","commenter_b":"That girl behind him tho hahahaahahaa","commenter_a":"Really people who cares how he looks!!","post_message":"Ashton Kutcher testifies at Senate hearing on ending modern slavery."}]
