[{"comment_id":"10153546186781162","commenter_b":"The disturbing replies to this is that people actually think just because she is a woman, she can hit whoever she wants and continue to escalate a fight. Doesn't matter who or what she is. You don't hit people period. Had she not come back in, hit him and continued this, there would have never been a problem.","commenter_a":"I'm all for not putting hands on a woman. But where's this equal opportunity draw the line at? She smacked the taste out dudes mouth. Don't start what you can't finish","post_message":"PANERA ATTACK: A Panera bread manager is fired after he was filmed punching a female employee in the head and knocking her to the ground. WATCH: @webpagelink (Warning: Graphic video)"},{"comment_id":"10154512310684726","commenter_b":"her face looks like a duck.","commenter_a":"Liar","post_message":"Tammy Duckworth says they’re all orphans and widows because the men are 'all dead.'"},{"comment_id":"509520402579803","commenter_b":"I see the women back of her. The men look like they have been photo shopped. Or they are pansies and do what their wives tell them to do. Maybe they are cardboard cut outs.","commenter_a":"Ever notice how the Dems always have people behind them when they're making speeches? They must have to promise to cheer a lot and be supportive. One boo and they're carried out by security.","post_message":"\"Donald Trump says I’m playing the woman card. Well you know what I say if fighting for child care, paid leave, and equal pay is playing the woman card – then deal me in!” Moments ago, Hillary Clinton gave a speech responding to Donald J. Trump's criticism."},{"comment_id":"10153196800261051","commenter_b":"Shut up you bitch! !","commenter_a":"I thought for sure she would want to be a Ferguson protester!","post_message":"Michelle Obama was asked a simple question: If you could have any other job in the world, what would it be? Here's her response."},{"comment_id":"1009718899145010","commenter_b":"Well the Wicked Witch odf Washington has looked better noow hasn't she.....TRUMP will save America...For us Mericans. Yall can move to Canada.....","commenter_a":"The dumbing down of America, this is the people we take care of with government assistance, most are not capable of taking care of themselves let alone voting","post_message":"Woah. Donald Trump voters will be the end of America as we know it. Thanks to Mitchell Wiggs for the video. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1248241848569316","commenter_b":"They are coming in on cargo planes in the dead of night and then being bused throughout our country. Once they reach \"refugee\" status they can roam throughout America without any restrictions. Refugee is just a word to make it look right........it is not. Illegals are just criminals and not the best for our country. The new immigrants are not the same that came over after WWII who felt blessed and were willing to be woven into the fabric of America. The new ones are coming for only the money and the Demos are only aiding and abetting them for the votes. Plain and simple.","commenter_a":"Trump is the biggest liar out there. \"We did not discuss paying for the wall\" - Trump \"I made it clear that Mexico will not pay for the wall.\" - Nieto \"Chicago Police told me crime will stop in one week\" - Trump \"We did not discuss stopping crime in one week\" - Chicago PD \"The NFL sent me a letter about the presidential debates\" - Trump \"We did not send any letter to Trump\" - NFL Promises on deportation of illegal immigrants, self-funding of his campaign, no teleprompter, muslim ban, and release of his tax returns, now confirmed LIES. Who still believes conman Trump? #LyingTrump Feel free to share.","post_message":"Donald J. Trump's claim that the federal government has no idea how many undocumented immigrants are in the United States is false."},{"comment_id":"10154318254146509","commenter_b":"Why don't you look back in G W Bush and Klinton to what they did? The difference between Russia and the USA is that the USA never asked for permission to invade any country. They just did what they wanted, and they destroyed the whole country with it's sovereignty. Another difference is - when you sea how these leaders greet \"dictators\" as they call them, with extremely wide hypocritical smile, and after a while the destroy them. Russian leader doesn't smile that much, but you get the feeling that he doesn't substitute his values and he is a person that can be trusted.","commenter_a":"Closed CAPTIONS, please!","post_message":"Five of CNN's correspondents look back at the role of Russia and President Vladimir Putin this year, and what impact there may be in the future. @webpagelink"}]
