[{"comment_id":"1473072332752510","commenter_b":"@username So do God Almighty, do you have a problem with Him also taking care of them? When you stand before Him on JUDGMENT DAY, you are going to be sorry you didn't do anything to help them also. Because God Almighty said, TREAT THEM WITH KINDNESS AND AS A NATIVE (meaning CITIZEN) BORN IN YOUR LAND. I WILL DESTROY ALL WHO TURNS AWAY AN ALIEN(illegal immigrants). I guess your behind is going to FRY big time come JUDGMENT DAY.","commenter_a":"The kids look healthy and happy.. And she taking care of them that's all it matters.","post_message":"EXCLUSIVE: 'I had to kill Octomom to save my life.'"},{"comment_id":"10155205853325354","commenter_b":"She is on the chunky side. Normal for someone that does little exercise, like most @username women.","commenter_a":"ummmm Thats what we call a plus size!!???? NOT a plus size but a normal..average..healthy beauty...","post_message":"Plus sized? Weigh in with your thoughts."},{"comment_id":"10153352792949203","commenter_b":"Woman hating much","commenter_a":"They are very stupid people who deserve no sympathy. I'll bet drug dealers and mafia members get assaulted too.","post_message":"Porn stars are people too."},{"comment_id":"10152638370431167","commenter_b":"Skinny, blond, white ladies can't be racist.","commenter_a":"What the...","post_message":"Reminder: This person is still on the payroll at ABC."},{"comment_id":"1018417158220401","commenter_b":"That wall will not get built under Obama . To bad election voting wasn't today!!","commenter_a":"Need to do this America Wide. And build the wall Now","post_message":"BOOM! TEXAS Infuriated Obama And Illegals With Their Plan To Protect Texans- Mess With Texas @webpagelink"},{"comment_id":"10154005970128967","commenter_b":"I was just about to tag you in this haha","commenter_a":"Jack explains why he wanted out of Star wars :(","post_message":"It's no myth, Harrison Ford and Steven Spielberg are bringing Indiana Jones back."},{"comment_id":"10153993909761491","commenter_b":"A women should be happy she has big tits-men will ne ef stop looking at her","commenter_a":"I got chastised by a femminest about 3 months ago for saying that it was a crime against man","post_message":"\"I chose surgery because of how I felt, not because of what anyone else thought.\""}]
