[{"comment_id":"386555874837702","commenter_b":"You obviously know nothing about the economy or laws or Russia in general...","commenter_a":"Its nice to see that thier prioritizing With all that going on with thier financial collapse and war in the Ukraine They have made driving xdressed a precedent Just curious... How would one know that the driver is a pyromaniac Will he be the one with the lit flare out the window???!!","post_message":"\"At first glance, it already appears absolutely absurd.\""},{"comment_id":"605420972951190","commenter_b":"The god \"them\" illegals.","commenter_a":"No guys. its not the trillions of dollars we spent on Nukes, its the god them illegals taking our tax money. #MakeAmericaGreatAgain","post_message":"The B61-12 gravity bomb is smaller and more accurate than the nuclear weapons we have now, and that has some experts very worried. Watch VICE on HBO tonight at 11PM to learn more about the next nuclear arms race."},{"comment_id":"1056274324413039","commenter_b":"You ladies here are absolutely correct, with your minds guns are for killing, and yes you for sure do not need to own one. If a person thinks that guns are just for killing, they sure as fuck better not own one... Let's start a new asshole list and get some signatures that states, If you are a total fucking idiot that believes guns are just to kill shit, then you do NOT and will NEVER be able to own a gun. :) Hows that ladies better? I broke it down and separated the stupid shit you people come up with. Ok, lets hear whats next,...","commenter_a":"Gun nuts who needs loads of weapons and ammo suffer from paranoia. Paranoia is a mental disease. Any person, especially those with existing mental problems can have a psychotic break any time. People like this are dangerous to the rest of us.","post_message":"Nothing says \"I'm a good Christian American\" more than protesting a priest calling for peace."},{"comment_id":"10152724701755927","commenter_b":"I don't know who he is, but I do not like him.","commenter_a":"And? Who cares what Chris Hayes thinks!","post_message":"Remember this from Chris Hayes?"},{"comment_id":"404025676388694","commenter_b":"Hes a piece of shit its not there country and the middle class has suffered enough from its temp wages and illegal pay for us we cant get all the benefits illegals do we do not qualify lol he just wants votes for liberal Democrats","commenter_a":"At this point ,what difference does it make","post_message":"Is President Obama breaking the law with Immigration Reform measures?"},{"comment_id":"10153527313703525","commenter_b":"You can kiss my dick","commenter_a":"Florida has alot of crazy old out-dated laws that are on the books!! Check it out and you will see!!","post_message":"'SHACKING UP' LAW: As soon as the governor signs the bill, it will no longer be illegal to live with someone you're not married to. STORY: @webpagelink"},{"comment_id":"1623391807964623","commenter_b":"Actually, Trump is the man they long to be. Beyond criticism. His own god. Worshiped for just existing. 1950s America. When white men were gods. We never taught them any better. We never taught them how their government works. We never taught them Humanities. We trained them not to think. So they don't. They feel. And they feel like Trump will make them like him again. White male gods.","commenter_a":"I've been reading through some of the comments of the Trump supporters and they are all pretty consistent. All they care about is that he won and he's now president. Oh, and they continue to trash Obama and Clinton. They care little about anything else. They don't care about the lies, they don't care about the scams, they don't care about the incompetent and self-serving cabinet picks, they don't care about his lack of knowledge of the issues, they don't care about Trump's actual lack of interest in doing the job of president, they don't care about his fascist attitudes, they don't care about his racist and hateful attitudes, they don't care that he's a sexual predator with few morals, they don't care that he's a narcissist and a sociopath, they don't care that he's about to do harm to the future of America, they don't care that the only ...","post_message":"Absolutely pathetic!"}]
