[{"comment_id":"323815704455468","commenter_b":"That's why we need someone who isn't a fool. Lindsey, go home, the adults need to take over.","commenter_a":"He should go home...he's really dumb","post_message":"Lindsey Graham needs to _______________."},{"comment_id":"10155243309639411","commenter_b":"Good @username get all this white people off welfare!","commenter_a":"It's OK , white people it's only for a day. You guys don't have to come off welfare in massive numbers tomorrow to make sure the strawberries get picked!","post_message":"People in Indianapolis joined the nationwide “Day Without Immigrants” movement in an effort to show how critical they are to the U.S. economy and way of life."},{"comment_id":"577421592439857","commenter_b":"I don't believe anything this woman says.","commenter_a":"\"You can always point a finger. But there's three pointing back. Literally, If you point a finger at someone else, three of your fingers are pointing back at you. This also means that you need to stop blaming others and deal with your own issues to help yourself.\"","post_message":"Hillary Clinton and her running mate Tim Kaine have released their tax returns, as her campaign called on Donald J. Trump to do the same."},{"comment_id":"695333573948652","commenter_b":"@username you are wants wrong with lawless America. So let me ask you for a honest answer if that's possible for you. Is she doing this because she cares about USA or just to be first woman president? Honestly now!!!","commenter_a":"You're still more concerned with his words than you are her actions. It's sad that laws only apply to people on the right and left for that matter but not her. You hilliary supporters should be ashamed. How do you sleep at night.","post_message":"This is horrific. We cannot allow this man to become president."},{"comment_id":"1080143312021089","commenter_b":"Yep TRUMP 2016","commenter_a":"Looking forward to him becoming our next president asap.","post_message":""},{"comment_id":"1309577419062434","commenter_b":"Did they have fair trials? Do gays need to be re-educated??","commenter_a":"Leave the man alone in his way Castro was great not a fair leader in terms of his military policy's but he did great things forcuba like healthcare and education!","post_message":"Marco Rubio called it \"embarrassing.\""},{"comment_id":"10153973402646350","commenter_b":"Damn her! So bloody uncooperative.","commenter_a":"Every fortnight I clean out the strainers, wipe under the rubber and run an empty dishwasher on hot with vinegar, bicarbonate and eucalyptus oil. Same for my washing machine.","post_message":"The answer is"}]
