[{"comment_id":"1777641695853675","commenter_b":"Shirley Awalt Tuggle Check this out mama!","commenter_a":"Sidni Schneider Amber Kerstin Brown","post_message":"She's every inch a queen. Victoria, starring Jenna Coleman, Rufus Sewell, and Tom Hughes, premieres January 15th on MASTERPIECE | PBS. Watch a preview:"},{"comment_id":"10154408917183797","commenter_b":"How big is that wall going to be? Lol","commenter_a":"This is why I can't wait for Trump being elected and building a giant wall!!!","post_message":"FLIGHTS TO CUBA: U.S. officials say the United States and Cuba will sign an agreement next week to restart commercial air traffic for the first time in five decades."},{"comment_id":"1025668424151460","commenter_b":"Again son, go fuck yourself, you're nothing but a useless troll :) you understand that, right?","commenter_a":"Hum... hopefully the US and Russia will agree in sharing intels, would be a shame if US troops got bombed by Russia because the US didn't want to tell them where they troops were...","post_message":"Just remember, folks… this is all about ISIS, the big bad boogeyman in the black pajamas, and has nothing to do with Assad's rebound or the influx of Russian special forces troops into Syria. ~Will"},{"comment_id":"805771119613465","commenter_b":"The woman has no class.","commenter_a":"Laura Bush...a REAL FIRST LADY WITH CLASS...not the thing we have now , a disgrace!","post_message":"Laura Bush SLAMS Michelle Obama Right To Her Face In Front Of Everyone. This is awesome. We love her. Can we get 5,000 'LIKES' for Laura Bush?"},{"comment_id":"10153649562025950","commenter_b":"Dan Haggerty could have prob saved both..... but hes dead now. that man loved animals .__.","commenter_a":"It should never even get to the point of having to kill an already endangered animal. The zoo failed this gorilla and the little boy.","post_message":"At one zoo, qualifications include gun-loading skills, twice-annual target-shooting tests and a drill that looks like this:"},{"comment_id":"10153562033956336","commenter_b":"Its not just the issue of illegals crossing the border and the US supporting them. The borders are open to terrorists coming across too and for both issues the bordetd need to be sealed ig we are to save our Country. Trump is right, without borders we don't have a Country.","commenter_a":"Ann Coulter is becoming the Johnny One-Note of 2016. SHUT UP ABOUT IMMIGRATION, ALREADY!!! There are dozens of issues out there that could (should) get your attention but every time I see you on @username you're yapping about immigration.","post_message":"\"The voters keep saying, 'We don't want any more immigration.' That's why Trump is so popular. So pick it up, Republicans.\" Do you agree with Ann Coulter about Donald J. Trump?"},{"comment_id":"1655877784709346","commenter_b":"Oh god between him and Trudeau ? That's not a choice , it's a bloody disaster looking for a place to happen Are there no good political leaders in this nation It would be the Canadian version of Clinton and Trump , to be fair to her she's a lot smarter than Trudeau","commenter_a":"Funny watching all the leftards do the exact same thing they did with trump with labels and lies and thinking we won't have the same results!","post_message":"Kevin O'Leary called Justin Trudeau a \"complete incompetent.\" Read more: @webpagelink"}]
