[{"comment_id":"10153390451923837","commenter_b":"She should have done what the officer said and THEN tried to negotiate. I'm sure he would have let her return or pay for the shoes, but she insisted on pulling away from the officer, flailing and kicking. Officer was in the right.","commenter_a":"Oh well she got her prize for stealing","post_message":"DO THEY GO TOO FAR? Check out the body cam video of a Fla. woman accused of shoplifting being taken down and bloodied by a sheriff's deputy. Was the officer too aggressive? THOUGHTS - HANDLED FINE or WENT TOO FAR?"},{"comment_id":"10153687088042235","commenter_b":"Quit giving him attention...if you quit he will kill himself sooner.","commenter_a":"Georgie got a death wish.","post_message":"Seriously. F this douchebag."},{"comment_id":"10152523937956135","commenter_b":"Only issue is the sand doesn't wash down the drain as easily as salt when winter is over","commenter_a":"Sand is better. We use a salt and sand combo (more sand than salt) in the UP.","post_message":"Ever slide through a cold Interstate at night and wonder how exactly is salt supposed to melt ice?"},{"comment_id":"1221745097868321","commenter_b":"Send her out to pasture","commenter_a":"The dumbest women in the world","post_message":"Pelosi says Clinton only lost because of Comey and the FBI investigation. Do you think Democrats are being sore losers?"},{"comment_id":"1187051574713979","commenter_b":"She don't care why try and make her lower her standards. Melania is a very classy lady and you want her to lower herself and dress down.","commenter_a":"I'm sure she can find another dresser! No big deal!","post_message":"Michelle Obama's favorite designer, a woman who dressed the First Lady for 8 years in a row, just refused to dress Melania Trump. The reason? She isn't tolerant of her despite asking everyone else to be tolerant of her. The self-professed liberal meant to snub the new First Lady -- but she never saw this coming."},{"comment_id":"10153748388188132","commenter_b":"You have lost. Your. Mind. Woman.","commenter_a":"All of you women on here calling her disgusting and gross and saying \"Ewww we don't need to see that,\" are absolutely part of the problem. There are countries where menstrual shamming still occurs and young girls are treated like animals as a result. You may think it's gross because you live in an entitled world where you're treated no differently when you have your period. Educate yourselves before you run your mouth... @webpagelink","post_message":"Thoughts?"},{"comment_id":"10152725934094071","commenter_b":"My manager told me \"if you want my position, you might need more than a Master degree, or probably more than one Master. Plus 10+ years of experience as manager\"... So spare me this story, its not the 80's anymore.","commenter_a":"Ain't that the farkin truth!!","post_message":"You don't have to earn an MBA to become a great manager."}]
