[{"comment_id":"1523513847666621","commenter_b":"Republicans had a smear campaign for him too, beginning with making him out to be a communist, with anti-American rhetoric to prove it. He would've been painted an insider since government is all he knows. They planned to trot out his rape fantasy story as well. Also, Vermont tried and failed it's statewide Healthcare for all system. He was treated with kid gloves compared to what he would've endured against the Trump post-truth machine.","commenter_a":"Sorry, Bill, but half of America already hated her BEFORE she ran. The media and Republicans have been excoriating her for 30 years. SHE NEVER HAD A CHANCE--unlike Bernie, who was almost universally beloved. He would have won. Fault: Democrats","post_message":"In case you missed them, we're counting down the most popular stories on BillMoyers.com during the past year: #9 - The fact is that Hillary Clinton wasn’t unpopular when she announced her decision to run in April 2015. If you look at the Gallup survey in March of 2015, 50 percent of Americans had a favorable impression of Clinton, only 39 percent an unfavorable one. So there was clearly no deep reservoir of Clinton hatred among the general public at the time. On the contrary: Americans liked her; they liked her quite a bit. Hillary Clinton's popularity didn't start to plummet until the press focus turned to her emails."},{"comment_id":"10153400579000329","commenter_b":"He's all yours, ladies lol","commenter_a":"Greg Paul Rachelle Krista","post_message":"His name is Brock O’Hurn and he's the king of man buns."},{"comment_id":"1184765668249575","commenter_b":"Bye bitch","commenter_a":"Please stop giving her attention","post_message":"Poor Sarah, she has a boo-boo and it's all Hillary's fault."},{"comment_id":"10152872155116051","commenter_b":"She is a pig.","commenter_a":"Michelle Obama is a beautiful woman inside and out, and highly intelligent. Unlike most of these commentators!","post_message":"Raven-Symone’s take on Michelle Obama-Planet Of The Apes incident left the cast of The View at a loss for words."},{"comment_id":"10154123509664138","commenter_b":"@username is awesome","commenter_a":"Thank You Fox , great pictures.","post_message":"Our favorite photos of Minneapolis aglow in purple for Prince."},{"comment_id":"10153053075171770","commenter_b":"Yeaaaahhhh... She's much happier having a socialist traitor occupying the WH","commenter_a":"That's what I said about obama, and it's turning out to be true.","post_message":"\"That’s who I want representing my country, somebody politically incorrect. That will just be perfect.\""},{"comment_id":"1677499192511819","commenter_b":"you should post this for the misogynist guys on my link to see ahah","commenter_a":"@username this is exactly what that article you shared the other day was talking about. Is this real life?","post_message":"Donald Trump suggested Hillary Clinton is ahead because she's playing the \"woman's card.\" Not surprisingly, jokes and memes followed, pointing out the strange logic of such a statement."}]
