[{"comment_id":"10158040412050206","commenter_b":"I was thinking that too. Where is the Air Marshal?","commenter_a":"Good on the pilot.... but where the hell are some of the passengers to help??? Seriously....bunch of cowards.","post_message":"This 25-year-old passenger was restrained by a pilot after pushing and threatening a flight attendant on an American Airlines flight into Charlotte, North Carolina. @webpagelink"},{"comment_id":"10153114544546943","commenter_b":"Charge her with something!","commenter_a":"Hilliary has blood of our soldiers on her hands","post_message":" Obama administration including Hillary Clinton and Susan Rice knew immediately that the Benghazi attack was a terrorist attack. The State Department new smoking gun documents put to rest any question about what Hillary Clinton and Susan Rice knew and when they knew it, said Judicial Watch President Tom Fitton. minutes of the attack, the administration, specifically Hillary Clinton, began lying to the American people by blaming an obscure Internet video. No wonder Hillary Clinton is the great destroyer of State Department emails. One can assume that Mrs. Clinton would not have stolen and destroyed emails in violation of law and various court orders if she didn have something to hide. And it shouldn take a federal court order to find out that Hillary Clinton evidently had no clue how the State Department and the FBI responded to terrorist attacks on State Department personnel."},{"comment_id":"10153286761179586","commenter_b":"The same with all Zoo's and not only seaworld. But if he or she is born in a Zoo or seaworld, they will have hard time to survive the real world and maybe die of hunger. So what to do? let them live in seaworld or zoo? kill them now? or let them free so they my die a slow dead of hunger because they never have learn how to hunt and survive?","commenter_a":"Assholes!","post_message":"How much space does an orca at #SeaWorld REALLY have? @webpagelink THIS is why they swim in circles in their tanks. The chart at 0:20 seconds explains it ALL."},{"comment_id":"10153342666393132","commenter_b":"She still is basic!","commenter_a":"He just swerrrved on her! Ayeeee! She needs to remember her roots and remember she was once 'basic'.","post_message":"\"Madonna, you have achieved unbelievable success and while we appreciate your talent and achievement, we expect you to appreciate ours.\""},{"comment_id":"10153195924381130","commenter_b":"I agree.......who the hell cares!! Dumb ass bitch!","commenter_a":"@username @username ...at that point, who the hell cares aye? Lol","post_message":"Do you even wanna know?"},{"comment_id":"10152734015363525","commenter_b":"going to get cold tonight!!","commenter_a":"Wtf...???","post_message":"Road trip to Lakewood Ranch. Who's in?"},{"comment_id":"10153605257703984","commenter_b":"Afraid of the truth RNC they want only those who agree with their lies & deceit. No wants ur RINOS IN OFFICE.","commenter_a":"Sounds like Trump is a threat to Republicans, because he tells the truth? My understanding is all Repubicans should stand together. Go head Republicans, give this election to the Democrats and then whine afterward. All YOU have are empty words and promises and then you cave.","post_message":"I know the Republican Party has made some big mistakes in the past, but this one absolutely blows my mind. People are already saying they're done with the Republican Party after hearing this news. Trump has every right to be furious... Would you stand with Trump over the Republican Party?"}]
