[{"comment_id":"10154192939617541","commenter_b":"Agree it's the dumbing down of America....","commenter_a":"He's such a child.. name calling , whining and bullying when he doesn't get his way. That behavior is definitely not what we should expect from our president!","post_message":"Trump says \"Pocahontas is now the face of\" the Democratic party."},{"comment_id":"10154744706316729","commenter_b":"It's the violent felons and lunatics the legislation is trying to keep the guns away from by closing the loopholes on gun sales. As long as background checks can be skirted, the criminals and mentally ill can buy them at gun shows (in some states but no one checks at state lines!) and over the Internet (easier than you think!). You, being an upstanding citizen of sound mind, are welcome to keep and buy guns.","commenter_a":"But but Hillary and oboozo with their constant armed guards say we don't need to or have a right to defend ourselves when the violent lunatics they want to let out of prison come busting down our doors.","post_message":""},{"comment_id":"10154550088456633","commenter_b":"I don't know HOW she got pregnant, she is such a tease!","commenter_a":"Oliver is pacing more this morning!","post_message":"Will today be the day? When will New York's April the giraffe give birth? More info >> @webpagelink Stream via Animal Adventure Park in New York."},{"comment_id":"10153885650817061","commenter_b":"@username , please take the tin foils off. For Benghazi, blame the Republicans. All of what you are saying about HC is all conspiracy based. EVERY investigation ha cleared her of wrongdoings. She is not perfect, but far better than that lying rapist BIGOT woman hater thief (ask the thousands of people he stiffed out of their money) IDIOT DT.","commenter_a":"Oh...don't mention Indiana! We are not proud that we have idiots voting for him!","post_message":"Sign of the times: Donald J. Trump supporter from Indiana says he's gone to great lengths to protect his yard sign with the candidate's name on it. So far, he says, \"I'm 2 and 0.\""},{"comment_id":"10158299454390206","commenter_b":"Then get the hell out.","commenter_a":"I will pay for the firing squad bullets! Now.","post_message":"Chelsea bombing suspect is apparently a United States-hating homophobe @webpagelink"},{"comment_id":"10154465806735530","commenter_b":"NO! Please God, NO!!!!! Don't come here!","commenter_a":"These comments certainly prove how classy and educated Trump supporters are, lol.","post_message":"Hillary Clinton will be in metro Detroit next week. @webpagelink"},{"comment_id":"10153260713478690","commenter_b":"Scrw U, Scrw Saddam, and Scrw Isis... Saddam killed 300,000 innocent kurdish moslems most of them by mass graving and gassing them, u pathetic peace of scm.","commenter_a":"Sadam was much better than ISIS...","post_message":"The statement said that a lorry loaded with around 20 gas canisters exploded on a highway between the Iraqi city of Mosul and Syria, as Kurdish fighters were being deployed following an offensive against ISIL fighters. @webpagelink"}]
