[{"comment_id":"10152944029886316","commenter_b":"Well that settles it, she paid $600.00 for that?","commenter_a":"no no","post_message":"In recent days, Hillary forces half a department store to shut down just so she could get a $600 haircut in a luxury salon, even as she refuses to engage the very public she is trying to convince to vote for her for president: @webpagelink"},{"comment_id":"10158232325655646","commenter_b":"Didn't one of those illegals walk back in and rape and murder a woman whose husband was a official of the government...This should not be able to happen in this country.","commenter_a":"Surprisingly enough nobody see's the resemblance to how the Jews were being taken during one of the Schutzstaffel's (S.S.) \"routine sweeps\" History Repeats itself my friends! We let it happen!","post_message":"Immigration and Customs Enforcement officials have yet to release details on how many people agents arrested Thursday, but advocates say more than 100 immigrants were taken into custody as ICE conducted home raids in Santa Paula, Oxnard, Van Nuys, Downey and San Bernardino. Those detained were either illegal immigrants with deportation orders but no criminal background, or family members of those sought who were home during the raids and told officials they lacked documentation, according to the Coalition for Humane Immigrant Rights of Los Angeles."},{"comment_id":"10154422219571509","commenter_b":"Guys it's an easy fix. Just vote for whoever is black in any movie that's how they want it","commenter_a":"I never watch that mess anyway. I do love movies but I'm not into Hollywood all patting each other on the back.","post_message":"When it comes to diversity at The Academy Awards, most Americans shrug their shoulders."},{"comment_id":"430918413735174","commenter_b":"No inadiment object kills, ie, knife, gun, car, tire iron. It takes people to pick them up use/drive to kill someone. If y'all did your research, guns are not the leader in killing people. Your wife's Rolling pin is up there. Smh at some of you.","commenter_a":"Just waiting for the \"guns don't kill people\" squad","post_message":"\"More than half the women murdered each year are killed with firearms — and in nearly 75 percent of those deaths, the weapon is a handgun.\" Fault Lines: Death in Plain Sight, tonight at 10pET"},{"comment_id":"10153302995429255","commenter_b":"That is not proven, nor can it be.","commenter_a":"I got the rubella vaccine when I was 27 because that was the one childhood disease I didn't contract. At age 27 my body was able to handle the vaccine. NOW tell me PLEASE how the hell do you think its OK for an hours old baby to get vaccinated for a sexually transmitted disease, and then 48 more by age 18 months? Its seems to me KOS person, you have been bought by big pharma, or you are on a rant. Because this getting tedious","post_message":"A \"perfect storm\" is starting to brew. By Daily Kos user Lib Dem FoP"},{"comment_id":"10153855436966337","commenter_b":"It's a final effort to get her extra viewers lol","commenter_a":"God no! Jim Ian Eric Jesse Omar Eric","post_message":"PRETTY COOL: Do you want to see 'Supergirl' meet up with 'The Flash'?"},{"comment_id":"10152954398027452","commenter_b":"Feminists sure do preach equality until it comes to self-defense.","commenter_a":"The biker needs to be commended on how well he held his composure after being punched more than once by an older man. That Football player that punched a girl needs to take lessons from this guy.","post_message":"Motorcycle meltdown! A driver goes berserk after he says he was cut off by a biker. But what happens next escalates the situation to a dangerous new level that ends in a medical emergency. @webpagelink Is \"driver vs. biker\" road rage getting worse? The confrontation caught on camera. Tonight at 11 from ABC7 Eyewitness News."}]
