[{"comment_id":"843529112375874","commenter_b":"About time someone takes a stand. Great job now everyone else needs to fall in line and do the same.","commenter_a":"Good for them","post_message":"REVENGE: French Attack Mosques And Blow Up A Muslim Kebab Shop Looks like the French have had enough of the Muslims immigrants living there and are fighting back! @webpagelink"},{"comment_id":"1737362022990205","commenter_b":"#fingersinthebootyassbitch","commenter_a":"He looks miserable. ..","post_message":"Kim Kardashian West is reportedly 'annoyed at him for refusing to rest' following 'psychotic break' (Via Daily Mail Celebrity)"},{"comment_id":"10153399487739411","commenter_b":"wrong , Britain has nothing to be ashamed about, its not British people planting bombs and blowing their own kind up, if you haven't got anything useful to say except the usual stereo typical crap then stfu and go away, preferably to the middle east if you think the people are so great. Its funny how people such as yourself preach \"tolerance\", care to show an example of tolerance shown by Islam or its followers","commenter_a":"To that ignorant little britain first shitbag you do not represent my country, Britain is built on the back of slavery, racism and bigoted xenophobic imperialism but today it SHOULD stand for tolerance, cosmopolitanism and living in peace with our collective of ethnicities from all corners of the former empire (Including Wales and ireland, remember when it was fashionable to hate the Irish too, wake up muppet divide and conquer is as old as politics itself.)","post_message":""},{"comment_id":"1339288666111988","commenter_b":"🙄🙄🙄 could have killed thatboy","commenter_a":"@username when @username used to wake us up every morning with his music","post_message":"Peace, love, and coexistence — this Christian man helps Muslims observe their holy month. (via NowThis)"},{"comment_id":"560952214097169","commenter_b":"These mf's white mf's think it's funny","commenter_a":"Whats the story? Video is not working... Someone pm me!!!!","post_message":"#BREAKING: There are reports that a #Chicago school bus driver has been shot in the head in the West Garfield Park neighborhood... @webpagelink"},{"comment_id":"10153828733732235","commenter_b":"LOL ... You people are so screwed up it amazing. You don't have to go to a fracking town to get raped ladies. Just go to any sanctuary city. There will be plenty of Mexicans willing to do the job that no American will do. LOL","commenter_a":"I have read about this .... disgusting .... assaulting women shows cowardice from these men ... shame, shame on them and the legal authorities!!","post_message":"This interview is heartbreaking."},{"comment_id":"1194913097195385","commenter_b":"shame on you that is racist and you being irish you would under stand that do not be like that sarah","commenter_a":"I know his brother Mr Poopoo !","post_message":"Chinese officials detained Ai Weiwei for 81 days and seized his travel documents in 2011, charging him with tax evasion, an accusation he has long denied."}]
