[{"comment_id":"594411744025341","commenter_b":"You probably have one between your legs Shannon!","commenter_a":"Who cares! It's an inanimate object! Ever heard of idolatry? This is it!!!! True followers of Christ don't kneel before a statue, they kneel before the one true God.","post_message":"What does sheer animalistic Muslim hatred against Christians look like? Story below."},{"comment_id":"10154464043803010","commenter_b":"Stfu bitch","commenter_a":"Cop shot the hood who shot him. Case closed. #righteouskill","post_message":"Officers stumbled into a shooting in progress, and a gun battle ensued."},{"comment_id":"969471999775996","commenter_b":"You're stupid lady","commenter_a":"yes! Possessing a gun doesn't make you American. Leaving your pride behind for the safety of others does. European countries are proof gun control is effective.","post_message":"Heartbroken and angry. We must act to stop gun violence, and we cannot wait any longer. Praying for the victims' families in Virginia. -H"},{"comment_id":"10153328594703132","commenter_b":"She needs to just quit. Can't stand her","commenter_a":"Jennifer Lesher","post_message":"\"I do not want to use my comedy to contribute to a culture of unattainable perfectionism and intolerance towards difference.\""},{"comment_id":"1259567494078669","commenter_b":"Just stop the CRYING,We didnt cry when Obama got in.Grow up!!","commenter_a":"Stupid is as stupid does.","post_message":"This just in..."},{"comment_id":"10154231947457411","commenter_b":"You would think they would have heard all the bee's buzzing around up in the attic long before it got to this point. DUH.","commenter_a":"This is common wasps or bees or Lizards I have seen a lot but not this much","post_message":"A Texas homeowner found herself in a sticky situation after calling for help with what she thought was going to be a simple roof repair."},{"comment_id":"10158070336085231","commenter_b":"There is no Muslim Ban. Ban is against potential terrorists not against Muslims.","commenter_a":"This is what discrimination looks like to the Black's, sorry to see another people of color experience this!","post_message":"The American people are putting their money where their mouth's are."}]
