[{"comment_id":"10156660915665354","commenter_b":"The woman should thank Ms Palin for keeping her employed. If she didn't resemble Sarah she wouldn't be working. Since there isn't much talent there.","commenter_a":"Sure, Sarah made Tina famous and rich. But Tina helped do the same for Sarah. I believe Sarah is laughing all the way to the bank....just as much as Tina is. Sarah did look a bit disjointed at the endorsement and Tina jumped on the opportunity to mock her. But Tina....sorry. You failed miserably. Didn't laugh at all. SNL is just sad. Don't watch any longer. The constant right bashing is boring and predictable.","post_message":"You saw this, right?"},{"comment_id":"10154615218080530","commenter_b":"@username-Fequiere Wait, so now black on black violence is due to INEQUALITY????","commenter_a":"When are people going to start protesting the deaths of 9 year old girls executed in Gang warfare in Chicago? It's like we're protesting something that happens 1 time out of 1,000,000. And nobody cares about something that happens like everyday. The media has got the people riled up about a very small issue while ignoring major problems. That's why I don't understand this movement. It's like if the government was repossessing everyone's home and moving them to refugee camps for no reason, but I was protesting the governments estate tax while ignoring people's homes being taken.","post_message":"Does the Michigan Football players' silent protest make you uncomfortable? Does that interrupt your Saturday afternoon of escapism? Sorry. That’s the point. @webpagelink"},{"comment_id":"10154630383678145","commenter_b":"She can Rot in prison too!!! Throw everything you can at her!!","commenter_a":"LOCK HER UP THROW AWAY THE KEY.","post_message":"Officials believe LaKensha Smith-Loyd knows where her uncle, accused cop killer Markeith Loyd, is but she has so far refused to tell them."},{"comment_id":"964810136945374","commenter_b":"Woman is nuts , how did she get the job in the first place?","commenter_a":"I don't think she wants fame. She's taking a stand for what she believes in. Just like everyone else is standing up for what they believe in. Only one that's making her famous is the ones giving her attention. #DRAMASEEKERS","post_message":"Kim Davis's latest attention-grab has blown up in her face."},{"comment_id":"1175985589130223","commenter_b":"Eww she be ugly scary","commenter_a":"why is this infidel a councilwoman in the first place???","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"10153255897157894","commenter_b":"She has a problem period","commenter_a":"Somebody has a problem with authority","post_message":"Azealia Banks Under Investigation for Allegedly Beating Up a Security Guard [Video]"},{"comment_id":"10153330396398812","commenter_b":"I was just about to say- and watch all the females flock to this rich young single male Hahaha","commenter_a":"@username i actually think I'm in love","post_message":"This CEO says executive pay is \"out of whack.\" So, he's going to start earning $70,000, like many of his employees: @webpagelink"}]
