[{"comment_id":"10152844746900667","commenter_b":"Gross looking. Many times, less is more.","commenter_a":"Ugly colors.","post_message":"\"Beautiful things happen when you take pride in yourself. #blackgirlsrock #kyebreaktheinternet,\" the prom queen wrote."},{"comment_id":"1086019278181113","commenter_b":"She's going to crush her opponent into Cheeto Dust. BYE ORANGE FELICIA","commenter_a":"BS","post_message":"Democratic presidential candidate Hillary Clinton will be speaking at an early voting rally in Cincinnati, Ohio."},{"comment_id":"1229522020425442","commenter_b":"I don't know about everyone else but I still think she looks good without make up.","commenter_a":"She's so beautiful! Why would she want to cover up that face? Who would, if they actually thought about it?","post_message":"\"Just a little concealer next time.\""},{"comment_id":"1094512657300125","commenter_b":"@username you know what they say, a slap in the face puts a bitch in her place","commenter_a":"No shit. I don't understand why people have been going nuts that someone was taking their guns away in the first place. That's not the goal. No one's changing 2nd amendment.","post_message":"EVERY American needs to understand this!"},{"comment_id":"10155444687161490","commenter_b":"*how dare she!!!!!","commenter_a":"@username, This ^^","post_message":"Ivanka Trump tweets about the \"importance of women having a seat at the table. @webpagelink"},{"comment_id":"659111814237594","commenter_b":"I hope you both get shot in the head!","commenter_a":"OMG! I can't believe I live in this country!","post_message":"All in the name of fighting tyrannical Obama and his assault on the Second Amendment. -- Robert"},{"comment_id":"481672038690043","commenter_b":"Muslims can all go to hell were they came from,they don't belong in this country","commenter_a":"Time for a million dog March, please don't clean up after your dog's at this March.","post_message":"Muslims are telling Americans what they can and cannot do. They have gone too far with this. We need to stop this madness now. Do you agree Muslim immigrants should abide by our laws?"}]
