[{"comment_id":"1008136642595139","commenter_b":"Not hardly! Idol contestants bring all they've got and lay it all on the line. \"What you see and hear IS what you get\", so that makes it easy to vote for the best. Presidential Candidates. ...... What you see and hear isn't always what you get which makes it very difficult to vote for the better of all the evils.","commenter_a":"I think Obama doesn't have a clue. He thinks we live in a world full of unicorns and rainbows","post_message":"In the unexpected opening act, President Barack Obama said he thinks voting for president \"should be almost as easy as voting on 'American Idol.'\" What do you think?"},{"comment_id":"1469983173042150","commenter_b":"#Youcantdefendit #grabthembythepussy #anybodybutTrump","commenter_a":"Folks we should be talking about this Obama care collapse and how our premiums are going up in 2017 by 26% scary . My family can't afford this !!!","post_message":"The story just keeps getting worse, and worse."},{"comment_id":"10156732658910492","commenter_b":"What is it with older ladies and dislike of bike lanes? @webpagelink","commenter_a":"These ladies probably shouldn't be driving anyway","post_message":"\"New York City is not Amsterdam, it never will be Amsterdam, and that's all there is to it.\""},{"comment_id":"10153224449077293","commenter_b":"If it happens without her name on it, fine, but she still had no right to do what she did up to now and she has to get re-elected which I doubt she will. What she did was wrong and I hope she stays in jail. The nasty hag is going to be rich anyway because there's enough idiots out there to give her $$$.","commenter_a":"Simply put...it doesn't...","post_message":"The question has arisen before."},{"comment_id":"1666670816943719","commenter_b":"Let's help protect the interns at the White House! Keep the Clinton's out!","commenter_a":"I can NO LONGER DRINK TRUMP'S POISON. Stupid me. Anyway, Donald, you are SATAN.","post_message":"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!"},{"comment_id":"10153530026483707","commenter_b":"What have Senators Done??? over 30 some years.. Trump is 1000 percent Correct.","commenter_a":"McCain is a scumbag traitor. He was codenamed \"songbird\" by the NVA when he was a pampered guest at the hanoi hilton. He has done more harm to veterans as a senator than could be believed. He is no true American hero. Piece of filth.","post_message":"Congrats to my daughter Meghan on her new nationally-syndicated show, starting July 20th - very proud of you! Learn more:"},{"comment_id":"10153894125869205","commenter_b":"Another whiny bitch.","commenter_a":"Hey dummy it's not that you are reporting about him it is you only complain about him. Where as with Hillary you are sold out to her just like Bernie.","post_message":"After getting $2 billion in free advertising from the corporate-controlled media, Donald Trump is now whining about the fact that they’re being super mean to him (by doing nothing more than reporting on what he says.) The Ring of Fire’s Farron Cousins discusses this."}]
