[{"comment_id":"1769368463122894","commenter_b":"I mean, I don't know who tf this woman is but I'm guessing she didn't mean it how everyone thinks she meant it","commenter_a":"People have blown what she said way out of proportion. Please read the article and really absorb what she actually said, a lot of people read but don't understand what they are actually reading.","post_message":"What a moron"},{"comment_id":"10153223668067994","commenter_b":"Good. Now I bet she gets the hell out of here and never comes back! So embarrassing!","commenter_a":"Yay!!!!!!!!!","post_message":"Good news!"},{"comment_id":"457954454329149","commenter_b":"and an Ass!","commenter_a":"Bush family is Scum....I'm a Reagan Republican.","post_message":"President George W. Bush dances to music performed by a high school band in New Orleans for the anniversary of Hurricane Katrina. Looks like he still has a spring in his step!"},{"comment_id":"850737528316277","commenter_b":"Does anybody realize the U.S. has 5,525 miles of border with Canada and 1,989 miles with Mexico. Our maritime border includes 95,000 miles of shoreline. How do you propose to secure this border? How do you propose to identify and round up 11 million people and deport them? I would really like to hear your reasoned proposals.","commenter_a":"just do it already.","post_message":"Don't you think we should start enforcing CURRENT immigration laws?"},{"comment_id":"852381858149314","commenter_b":"she is a total ASSHOLE and the biggest racist along with her husband. could just imagine how they are raising the girls.","commenter_a":"The only thing I see that she's done is screw the guy that planned to lie, cheat, steal his way into the white house. She did, he did, and they keep going.","post_message":"INSANE VIDEO: IT’S GRADUATION TIME...AND THAT MEANS IT’S TIME FOR OUR RACIST FIRST LADY To Spew Hateful Lies And Rhetoric About Racist White America And The Mistreatment Of Blacks ***WARNING****It's hard to watch this video filled with lies and anger toward white Americans without feeling like your head is about to explode!"},{"comment_id":"10153589260353822","commenter_b":"Rebecca .... get out of the basement ....","commenter_a":"Requiring people to carry a concealed weapons permit is just another way the government can get your money. Do people actually think that criminals pay to carry a concealed weapon?? No, they don't. I think this is a great law, go WV!!","post_message":"Effective late May, people in West Virginia will be able to legally carry concealed guns in public without permits or training."},{"comment_id":"1721472904763525","commenter_b":"^^^Yet he has no blood on his hands. Killary got that cure little nickname for a reason. Several, in fact.","commenter_a":"We can not and must not settle for Clinton or worse Drumpf. The time is near and we must let everyone know, that If Bernie somehow doesn't win the nomination, we want him to run as a independent so we can put him in the White House. Too many people registered as independent did not have a chance to vote in closed primaries, if they did Clinton would not be leading with pledged delegates. The Democratic Party must be aware that if Bernie runs as an independent there is no chance of Clinton winning anything, so if they don't want Drumpf in the White House they should start backing Bernie now. Because there is no way in hell I'll ever vote for Clinton.","post_message":"Here's the promise I made to you on day one of this campaign: Not only will I fight to protect the working families of this country, but we’re going to build a movement of millions of Americans who are prepared to stand up and fight back. We’re going to take this campaign directly to the people – in town meetings, door to door conversations, on street corners and in social media. Right now we are in Indiana. Tune in live here:"}]
