[{"comment_id":"927281534054105","commenter_b":"He doesn't belong in America!!!! Get out Obama!!!","commenter_a":"He is a traitor and should be impeached.","post_message":"This is seriously outrageous."},{"comment_id":"818359668354610","commenter_b":"Freaken Muslim foreigner.","commenter_a":"Yes","post_message":"Obama Disrespects Our Nation's Police In A SICKENING Way Right After Dallas Shooting He is the worst president in our country's history. Do you think Obama is a disgrace?"},{"comment_id":"1832240316996227","commenter_b":"Since you took the time to report this, why not put the effort to fix it? or educate us how to prevent this? Or are you one of those assholes that like to stir up nonsense to get recognitions?","commenter_a":"When I was young I vowed to kill all the bees. I see my plan is working.","post_message":"Do NOT scroll past this!! ✋✋ Source → @webpagelink #WakeUpCall | #SaveTheBees Join Us: The Free Thought Project"},{"comment_id":"10154630548633132","commenter_b":"Her stepmom Melania looks like Caitlyn Jenner lol","commenter_a":"Not being mean but she reminds me of Miley Cyrus..","post_message":"Donald J. Trump and Marla Maples daughter Tiffany is addressing the nation."},{"comment_id":"10155762960395354","commenter_b":"commands...???...commands what....","commenter_a":"Obama's greatest tool in his propaganda arsenal.","post_message":"Hollywood? Check out what he told supporters...."},{"comment_id":"10153685449009060","commenter_b":"They do. This, in itself, isn't a problem anymore than relying on other countries to buy your goods is a problem.","commenter_a":"Most of the British public are blissfully unaware of this worrying problem. They still think they live in a \"rich\" country.","post_message":"As warning signs flash across the global economy, Britain is a favoured bolthole for skittish investors. But there’s a flipside to this: the country’s huge current-account deficit. Time to worry?"},{"comment_id":"10153255952000950","commenter_b":"Isis days are numbered. They are not long for this world. Believe it or not theres more important fish to fry","commenter_a":"I think he's so creative!! Instead of CNN just cashing in on the money for no good reason - let's do something for those that have done so much for this country! You guys who think this is Mr Trump being cocky or greedy just don't get it...","post_message":"Donald J. Trump is demanding that CNN — the host of the next GOP debate — pay him $5 million dollars to participate, with the proceeds to be donated to veterans."}]
