[{"comment_id":"1014609198628438","commenter_b":"She s the normal one!","commenter_a":"Oh I think this woman should be arrested and taken into custody as she is obviously a sociopath with a gun!!","post_message":""},{"comment_id":"1277469425634935","commenter_b":"Oh yeah she must of smoked weed. Pshhh... don't be a dummy. Ppl don't smoke weed and drive in the wrong lane. If that were to be true millions off Ppl would be headed the wrong way. This lady was off her rocker I highly doubt it's do to weed or alcohol.","commenter_a":"Yeah legalize marijuana... will get more cases of wrong way drivers. But that's okay as long we have our freedom. That was a sarcastic remark. No to drunk driving no to marijuana no to drugs","post_message":"WRONG-WAY DRIVER: It's happened again -- DPS troopers used stop sticks to stop a woman who led them on a wrong-way freeway chase that began in Phoenix and ended in Mesa. Thankfully, no one was injured. STORY: @webpagelink"},{"comment_id":"1146187242090421","commenter_b":"Lordy...I'd wear that brownish ass out...then marry her!","commenter_a":"My opinion is that, it is not nasty, is just a big booty, so whatever.","post_message":"Big booty problems."},{"comment_id":"967763486668466","commenter_b":"Smart, educated women are actually voting for Hillary. Don't fool yourselves.","commenter_a":"What is it about the Democratic platform that is appealing? Higher taxes, weaker security, open borders, murdering babies, a very real risk of WWIII... ya'll must really hate America","post_message":"\"Get this Donald: nasty women are smart, nasty women are tough, and nasty women vote.” —Elizabeth Warren"},{"comment_id":"10153566886509614","commenter_b":"Stupid girls!","commenter_a":"Looks like the liberated those caged pups. :)","post_message":"Two teen girls were caught on surveillance footage stealing two puppies who were still nursing and not yet ready to leave their mother, workers at a pet store in Compton allege. In the video, one girl can be seen leaning over a gate and grabbing a puppy while the other stands by. The alleged theft happened Thursday at Jazmin Pet Supply. this post to alert others. Watch KTLA video here: @webpagelink"},{"comment_id":"1056978507726395","commenter_b":"we Irish and Scottish built it","commenter_a":"Why does she have to keep using the \"I live in a house built by slaves\"? What about the whites, free blacks and immigrants who also helped build the White House? Stop playing the damn slave card already.","post_message":"Warning: Sharing this with your liberal Facebook friends may spontaneously burst bubbles..."},{"comment_id":"1004051086318087","commenter_b":"Hillary is a BIG LIAR","commenter_a":"HILLARY CLINTON 2016!ALL THE WAY TO THE OVAL OFFICE!!","post_message":"With just 100 days until the Iowa caucuses, James, a Hillary for Iowa organizer, is taking over @HillaryClinton on Twitter. Follow along to hear why he’s working hard to elect Hillary: @webpagelink"}]
