[{"comment_id":"547147818822562","commenter_b":"Get rid of every illegal man woman or child then start the legal process maybe this country will fall back together after that","commenter_a":"Buddy, you are so far behind the curve by now, I'm not sure you can hear me shouting backwards. We're past issues of legality. We're past party lines. We're into basic human dignity and the essential morality of how human beings treat each other. Black lists, registration lists, and round ups and mass deportations are all tools of countries where the rule of law has broken down and democratically designed processes have failed - BY DEFINITION. Yes, illegal immigration is a huge issue and yes, there should be systems in place to allow due process of law to happen based on merit and compassion. Targeting entire groups of people and refusing to treat each person as an individual in assessing their rights and needs is the antithesis of our stated democratic ideal. So this mayor speaking out in defiance of the tools of mass oppression is an act of heroism. ...","post_message":"\"This is New York. We are always New York.\""},{"comment_id":"10152691243492217","commenter_b":"@username we're good at sports that don't matter","commenter_a":"Jason Mulford","post_message":"Watch out, Katniss Everdeen."},{"comment_id":"1241124305907597","commenter_b":"Mexicans R not the enemies! The Enemies come with visas on Air planes! They are already here! Keep bringing refugees! From overseas!!","commenter_a":"Trump will secure our borders!","post_message":"The New York Police Department said it dispatched its \"critical response group\" which is equipped with high-powered weapons, and other security to crowded areas of the city."},{"comment_id":"10153255182937452","commenter_b":"Richard Valdez what's up with that street. Last week was the guy and now this. So sad!","commenter_a":"That's what happens when you think cars can fly 😕","post_message":"1 person is dead and another was hospitalized after a head-on collision with a big rig in Gardena."},{"comment_id":"612643332237670","commenter_b":"It's really crazy that some men are coming up with more excuses for this kid","commenter_a":"What, now alcohol is being used as an excuse to rape a girl. People still know right from wrong, drunk or not. Rape is illegal. Justice needs to be served. Disbar that judge, also.","post_message":"The judge, also a Stanford alum, noted that the defendant was intoxicated at the time of the assault."},{"comment_id":"10154502973076756","commenter_b":"@username do u recognize this woman in the pic? She's a Bay Area demonstration machine! I want to BE her!","commenter_a":"Wow.","post_message":"\"[W]e lack confidence that Judge Persky can fairly participate in this upcoming hearing in which a male nurse sexually assaulted an anesthetized female patient.\" -- Santa Clara District Attorney Jeff Rosen"},{"comment_id":"10155399536459199","commenter_b":"Oh ok was wondering how close this happened it didn't specify what a sick man hope they catch him fast.","commenter_a":"Where is Lakewood Commons I live up by Lakewood high school?","post_message":"The man was about 6 feet tall and rode off on a green bicycle after exposing himself to the child."}]
