[{"comment_id":"10154530088657908","commenter_b":"Ginny Gruhler Vanderhoof You are a very dishonest person \"Sanders battled over veterans issues as chairman of the Senate Veterans Affairs Committee from 2013 until early this year, giving him an easy pitch to a crucial voting bloc of veterans, particularly in South Carolina where veterans make up more than 11 percent of the voting-aged population. There stiff competition for these voters, with front-runner Hillary Rodham Clinton wooing them this month during a round table in Nevada. Even the leaders of veterans groups who praise Sanders acknowledge that the 73-year-old Democratic socialist isn an obvious champion for the flag-waving set of former military officers and enlistees. When asked if the Veterans of Foreign Wars, which recognized Sanders with its Congressional Award in March, had ever bestowed the honor on a socialist before, the group Washington executive director, Bob Wallace chuckled a bit. . No. No, said Wallace, a man who ...","commenter_a":"Why does Hillary think she can get anything done? We've seen how the congress works now. Even if the Democrats re-take the Senate, we still won't have the radically gerrymandered House until 2020. It will be nothing but stonewalling until then. That and attempts to repeal the ACA are all the GOP reps remember how to do. Plus, they hate her with the fury of a thousand suns. They'll waste all their time and hundreds of millions of taxpayer dollars investigating her for anything they can think of until they can figure out some way to impeach her as well. She's not getting anything done. But if Bernie is the candidate, and he is able to continue to energize his massive voter base, then suddenly we have a shot at taking the entire congress back and getting something done. Bernie will bring far more folks to the polls than Hillary ...","post_message":""},{"comment_id":"10153717285696509","commenter_b":"Looking better then the women in his home","commenter_a":"Should be on the cover of freaks magazine","post_message":"Caitlyn Jenner is on the cover of Vanity Fair, in an image shot by famed photographer Annie Leibovitz: @webpagelink #CallMeCaitlyn"},{"comment_id":"10154033192724087","commenter_b":"The white trash vote can win you the primary, just not a GE. They don't have enough Electoral votes.","commenter_a":"At this point, should really stop insisting he can't possibly become president. If we lived in a sane world, he wouldn't even be the nominee. But, here he is, and no matter what he does, people continue to support him.","post_message":"\"Donald Trump won’t be our next president come January 20, 2017, and here are 5 reasons why.\""},{"comment_id":"1174084612658964","commenter_b":"They are sex obsessed weak willed bonobos.","commenter_a":"What is the anti gunners obsession with genitals and degeneracy","post_message":"Cocks Not Glocks, the gun control group that literally strapped gigantic dildos to backpacks and made lewd gestures that would get any man thrown in prison, was invited to the White House last week. They actually completed their trip on Friday while I was enjoying my time fishing on the Oregon coast. The Cocks Not Glocks organizers posted their White House trip on all their social media accounts making it a big deal - all while Trump was taking flack for saying the word \"p*ssy.\" Now, as a woman, I have said before that I… [ 224 more words ] @webpagelink"},{"comment_id":"1735235890068335","commenter_b":"Liberals are the TRUE racists......","commenter_a":"The Democratic Party should be so proud of their supporters. Trashing Police Cars, yep, you Democrats are awesome !!! And you wonder why Trump is doing so well, Idiots..","post_message":"WATCH the chaos that erupted in Southern California outside a Donald J. Trump rally where at least 20 people were arrested. @webpagelink"},{"comment_id":"1722122661395846","commenter_b":"White people'n 😂😂😂😂😂😂😂😂","commenter_a":"Just White people..White people'n","post_message":"What...is...this?"},{"comment_id":"10157746035990093","commenter_b":"Megan needs to be Fired! She could always work for the Clinton's.","commenter_a":"That's one lieing women","post_message":"Donna Brazile CANNOT take Megyn Kelly's line of questioning and it's hilariously uncomfortable. She's so CLEARLY lying!"}]
