[{"comment_id":"814799585299285","commenter_b":"Yes me to!! We better not be dumb enough to let another one get in like Hillary Clinton! We can't afford to have her ruin our country and drive it farther into the ground than Obama already has!!","commenter_a":"Can't wait for Obama to leave office","post_message":"President Obama will address the nation tonight. He needs to acknowledge RADICAL ISLAMIC TERRORISM! On Friday night in North Carolina, I was asked what I would say to Obama - at this point:"},{"comment_id":"10156862030995389","commenter_b":"Governor Mike Huckabee said it best....If Ted Cruz isn't guilty of affairs with the five women, then he should bring charges against the National Enquiry. Otherwise, there may be something to it!","commenter_a":"Barf!!","post_message":"Get free tickets for Sean’s EXCLUSIVE event with Donald J. Trump in Milwaukee, Wisconsin MONDAY, April 4th at 5p ET. @webpagelink"},{"comment_id":"10153317099366051","commenter_b":"Caleb I agree. @username you are a fucking Looney toon. Crazy bitch","commenter_a":"She didn't kill him & usually if someone is threatening suicide it's because they're not gonna do it anyway! I have attempted suicide & have suicidal tendencies that I battle everyday but when you get ready to do it you don't inform others you just do it! I think it's bs that she is being charged when he had every opportunity to walk away....he chose to die no matter what she said to him! If you're steady telling me you're gonna kill yourself then I'm gonna tell you to go ahead and stop feeding me your empty threats!","post_message":"Remember the teen who convinced her boyfriend to kill himself? Well, she just got some bad news."},{"comment_id":"10153944005826336","commenter_b":"@username Your cocksucking grandma needs to read the bible!!","commenter_a":"What is this world coming to?!","post_message":"Just a few weeks before Christmas, Labor Commissioner Brad Avakian wiped out the Klein family’s bank accounts – taking nearly $7,000."},{"comment_id":"10154249804566509","commenter_b":"And they say white men can't jump.","commenter_a":"He just proved obama has crappy security. There have been tons of jumpers since obama became president. You would think they would have increased security by now.","post_message":"This photo shows the White House fence jumper in the middle of his attempt to go over the barrier on #Thanksgiving. @webpagelink"},{"comment_id":"10153729819244753","commenter_b":"if miley cyrus is taking her place i will not watch the voice no more, she is trash","commenter_a":"I will no longer watch he voice with Miley Cyrus on it.","post_message":"Christina Aguilera will not return to The Voice for season 11, and ever since the announcement was made official, rumors have swirled, claiming the “Genie In A Bottle” singer’s alleged feud with Gwen Stefani and Blake Shelton may be to blame. In a recent report, it was alleged that Christina Aguilera’s feud with her co-stars had gotten so ugly that she had actually enlisted Miranda Lambert, the ex-wife of Shelton, to help her get back at them. “[Christina Aguilera’s] feud with Stefani is... @webpagelink"},{"comment_id":"10154220777628487","commenter_b":"u rude fuck","commenter_a":"I always find it irritating that a typical response to vegetarians/vegans is something along the lines of \"it's fine as long as you don't push your views on others.\" As a lifelong vegetarian for ethical reasons, I go about my day constantly reminded that the vast majority of the people I encounter are active proponents of what I consider to be systematic violence that trumps the holocaust. Imagine believing that and being expected never to mention it. I actually don't mention it, because I've found that people simply do not give a fuck about the suffering of animals, and it is far too depressing to endure such conversations. But it continues to irritiate me when people say, it's fine, just don't push your views on others.","post_message":"Russell Simmons, founder of Def Jam and author of \"The Happy Vegan\", teaches us how to defend the plant-based diet that many love to hate."}]
