[{"comment_id":"1099350153419328","commenter_b":"Wtf😱 she's going to be a double hoe😜","commenter_a":"Madisan","post_message":"A YouTube star recently revealed that she was born with two vaginas. Check out the interview here:"},{"comment_id":"10152995708842217","commenter_b":"Really perhaps one glass too many some would say Suspicious.....","commenter_a":"Aww 😢💔 poor Cilla..","post_message":"She was sunbathing at her Spanish home when she she stood up, lost her balance and fell"},{"comment_id":"10153994674826051","commenter_b":"What a sick woman!","commenter_a":"I'm disgusted at the thought of such a thing. I hope they sue.","post_message":"This 8-year-old came home from school distraught. His dad asked him what was wrong. The boy explained that the teacher had forced him to stick his head into a bucket. Dad asked: \"What was inside the bucket?\" When his son told him, he snapped."},{"comment_id":"1162663783801971","commenter_b":"I stopped reading at \" good man \" Trump is far far removed from being a good man..","commenter_a":"Trump, regardless of what people who don't even know you say, I believe you're a good man & have good intentions for this country. Don't get sucked into what the government or anyone else wants you to do. You've called on Jesus to be your Lord & Savior & I'm proud of you for that because I know that the moment I did, He changed my life forever. Seek Him & all He is & He will give you all of your hearts desires. He's God, all His riches & glory will never compare to money, just stay focused on the Lord & you've got this! Trust me. He loves you.","post_message":"The spirit is amazing --- thank you to this homeowner in Florida for their support."},{"comment_id":"1806931362926478","commenter_b":"I just can't believe that she uses children for her dirty political TV add. Her latest add children watching Donald Trump . She is the expert lol . Her lenguage puts sailors to shame. She is no Lady never was never will. Poletic is agly we all know that. But to involve children in an add how low can you sink??? I wouldn't let my children or great grand children watch TV dirty Poletic.... The would be in bed for sure not sitting in front of the TV all day long .what kind a mother and grandmother is she we should ask ourselves to use children in her dirty advertising against TRUMP they are children MADAM SECRETARY. SHOULD WE SHOW THE CHILDREN THAT YOU IGNORED THE DESPERATE CRY FOR HELP IN BENGHAZI?? YOU KNEW WAY BEFORE THEY WOULD NEED HELP RIGHT AWAY. WELL WHERE WERE YOU YOU WENT TO BED ...","commenter_a":"He's needs to walk away from the DNC at this point!!! They never had his back why should he have theirs? Stein /Sanders could change this country.","post_message":""},{"comment_id":"10153792660631545","commenter_b":"Just like recent a white women in alexandria,la a manager at canes got stabbed by a black an but do they see us protesting and stuff.come on now","commenter_a":"Why do black people complain about their shootings??? Ever hear about Asians or white people being shot?? Do they protest like you do? Do they get anything specific??? No","post_message":"\"They had him pinned down,\" Abdullah Muflahi told CNN. \"He was out powered. There were two of them and there was one of him, and they were right on top of his chest.\""},{"comment_id":"10153776672201770","commenter_b":"So Is @username","commenter_a":"Who is this Pollyanna? She thinks Hillary is all rainbows and unicorns. You can't put lipstick on a pig.","post_message":"\"She is a real person...\""}]
