[{"comment_id":"10156149703965294","commenter_b":"I'd take her dang license and make her walk because she is so dang stupid!!","commenter_a":"He was doing his job,she was in the wrong ,51 in a 20 school zone.she should have been arrested.feel sorry for the safety of the kids.","post_message":"At first, she pleads for mercy: \"Can you give me a warning please?.... I have so much frozen food in the car.\" But, when the deputy walks to his car and comes back, her attitude changes completely:"},{"comment_id":"1253114871421932","commenter_b":"@username eating pussy 😂😂","commenter_a":"Who refers to going down on a girl as \"giving head\". Wtf kinda gay shit is that... \"yeah I gave her head last night\" wtf","post_message":"Who should go first?! #WSHH"},{"comment_id":"10156899392785725","commenter_b":"Hope she gets jail time","commenter_a":"hillary who shed the blood of innocent American at Libyan embassy. Obama and clinton who created all conflicts possible in America ( income war, gender war, age war, war on women, Race wars) driving wedges among the people. Hillary clinton and bill clinton war on women explained by Roger Stone on youtube","post_message":"As President of the United States of America- I will see to it that the AWARENESS continues -- I will be in a position to immediately handle all of the issues at the VA --- nobody will look after our Veterans --- our heroes, like me. I guarantee that!"},{"comment_id":"1522438461149611","commenter_b":"OMG!! She has loads and loads of BULLSHIT in there!!!","commenter_a":"GOT METH?","post_message":"There's been lots of speculation about what might be ailing Hillary Clinton, if anything. One dental expert took a look inside Hillary's mouth... and almost instantly, he said he knew the condition that's been causing all of her health problems. Could this expert be right?"},{"comment_id":"10153171170386051","commenter_b":"Nasty ugly bitch","commenter_a":"What a sick bitch","post_message":"Police showed up at this woman's home only to find her young grandson naked. They asked him what was going on - and that's when he broke down."},{"comment_id":"1359039877491459","commenter_b":"Muslims are the devil","commenter_a":"What the hell is he. Trying to make things harder for Trump?","post_message":"SICK: While You Celebrated Christmas, Obama Gave FULL CONTROL Of Christian Holy Sites To Muslims"},{"comment_id":"10152861814749753","commenter_b":"Same little bitch.","commenter_a":"How utterly sad and horrifying for the bird and it's owners. It is a proven fact that people who will torture and kill animals have no qualms in \"upgrading\" to humans. These kids need deep and immense counseling while sitting behind bars for about 6 to 10 years","post_message":"Police say this 18-year-old high school football player stole the pet emu from a neighbor's pen, tortured the animal, gouged out its eyes and then beat it to death. How should he be punished?"}]
