[{"comment_id":"10154099616106162","commenter_b":"I thought it was hilarious","commenter_a":"Double standard. If the tables were flipped we wouldn't even be allowed to mention a lack of caucasians without protests and al sharpton crying on tv.","post_message":"What would this year's Best Picture nominees look like with black actors? Chris Rock, Tracy Morgan and Whoopi Goldberg gave us a (hilarious) idea."},{"comment_id":"10153731024366130","commenter_b":"Lmfao girl","commenter_a":"Camellia","post_message":"Contributor Laura A. Jacobs, on Caitlyn Jenner: \"Your visibility has gone from mildly annoying, to problematic, to atrocious, to outright detrimental, and so I ask you, politely: Stop trying to help though the media and public appearances. Please. Stop...\""},{"comment_id":"578813518988176","commenter_b":"He needs to be voted OUT","commenter_a":"Give them his job ! Asshole","post_message":"What do you think?"},{"comment_id":"455416051331721","commenter_b":"Bullish*t. That articulate enough for you?","commenter_a":"If there is one thing that is inescapably true about President Obama compared to the many predecessors that came before he is this: President Obama will be considered by history's standards as the most articulate president to ever occupy the white house! Period!","post_message":"President Obama's last State of the Union address is January 12th—don't miss it. @webpagelink"},{"comment_id":"10153580764828352","commenter_b":"She needs to be done same way but leave her in the fire crazy birch.....stand there and ask her how it feel s and eat snacks in front of her ass she burns","commenter_a":"She look deranged with that crazy psycho stare","post_message":"Woman arrested for burning 8-year-old’s hands over open flame because she ate a snack without permission"},{"comment_id":"10153483204295667","commenter_b":"Nardine","commenter_a":"Robert Taylor","post_message":"Do you see a ghost in this photo? Henry Yau took this photo at the Stanley Hotel, the real-life inspiration for Stephen King's 'The Shining.' Yau says no one was on the stairs."},{"comment_id":"10156637699435354","commenter_b":"Political whore?","commenter_a":"If the polls leaned toward Bhudism, Hillary would relate to Buddhists.She tries to relate herself to whichever way the liberal winds blow. If one doesn't agree they are homophobic, racist or worse...a conservative.","post_message":"Haters gonna hate..."}]
