[{"comment_id":"10154352514741523","commenter_b":"Are you ready for that wall","commenter_a":"And there's Putin Ridin Trump or the other way around","post_message":"\"He's not a bad man. But his ignorance is so profound, so profound.\""},{"comment_id":"571789942944915","commenter_b":"Mentall illness--- the narcissist doing his thing..I only hope the damage he IS going to do is NOT catastrophic.","commenter_a":"Egomaniac?? That is being kind. He is certifiably insane. I am calling all my congressional reps on Jan 21 to demand a mental health evaluation. He is crazy.","post_message":"Trump's 'Twitter feed is remarkably bananas this morning. Something bad must be coming.'"},{"comment_id":"903256166376472","commenter_b":"Where does this B S come from !","commenter_a":"Stupidity","post_message":"Incredible!"},{"comment_id":"1281193278643588","commenter_b":"THAT is what Hillary said she is going to do. People out there are saying she wants to abolish the 2nd amendment...which couldn't be done by anybody.","commenter_a":"Gun Control? How about enforcing the current laws. Statistically less than 25% of the current federal firearms laws & regulations are enforced. If all of them were enforced gun violence would be almost nonexistent.","post_message":"Summer vacation is over, and it's time for Congress to get to work."},{"comment_id":"498469603689886","commenter_b":"This sissy should go into a latino hood, she won't be talking smack for long","commenter_a":"Get outta here.","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING. Enjoy. ~ DG"},{"comment_id":"10153491925881756","commenter_b":"Hey, this sounds like Republican America; an obsession with lady parts.","commenter_a":"Indonesia, defender of morality.","post_message":"The virginity test \"is a measure of morality. There's no other way,\" Gen. Moeldoko said. The test — which, for the record, is scientifically invalid — is internationally regarded as a violation of human rights."},{"comment_id":"608701745929674","commenter_b":"@username-I usually stay out of this topic area since it isn't making a huge impact on my life. However, science has shown that when populations of a certain group go up too high, homosexual bonds do come to play. For instance in Africa way back when, sometimes today, if the village had to many mouths to feed, the men would start mounting each other to prevent population growth. In animals, like dogs or cats, you have some that put off the opposite animals pheromones. For instance we use to have 2 female&spayed cats? The one kept dry humping the other.","commenter_a":"Considering most people don't get a sexual attraction until they hit puberty, how would they even know which students are homosexual unless the students are just acting out because of what they've seen their parents do...","post_message":"Pre-K? REALLY?!"}]
