[{"comment_id":"10153370538292144","commenter_b":"@username She's a Republican.","commenter_a":"Not all republicans are pathological liar but all pathological liars are republican.","post_message":"\"This is not normal political hucksterism. It's a pathological disregard for the truth.\" —Kevin Drum"},{"comment_id":"10153930858301320","commenter_b":"Hoes will be hoes","commenter_a":"Kinda what he gets for being stupid.","post_message":"It was an expensive night. After a night of clubbing Knicks forward Derrick Williams took these two women back to his apartment and they made off with more than $600,000 worth of jewelry. Details: @webpagelink"},{"comment_id":"827081283993961","commenter_b":"Moochele needs to shut her ugly mouth.","commenter_a":"We can't stand her either.","post_message":"Is she serious?"},{"comment_id":"10155104152711323","commenter_b":"Wow how fucking sexist can you get.","commenter_a":"I don't know who any of them are but they are pretty.... boring and vacant looking.","post_message":"'These are the kind of women who take pride in saying things like not into fashion I like style, and by they mean that men like me to wear. They think anyone who criticises Disney fetishisation of princesses is just jealous.'"},{"comment_id":"10153605570044205","commenter_b":"I held the door for a woman once and she said \" What you think I can't open my own door?\" Aaaaaaaannnnndddd I quit opening doors for women","commenter_a":"Also this bitch is a joke... i live in texas and shes just a narrowed minded republican raised by republicans... look how much make up she has on... lets guess what she cares about. Gtfo with your nonsense... and dont talk about men not holding doors for girls.... you women killed it. Hardly anyone says thank you... you are basically expecting it but not acknowledging it. So we took it away. Bitches always pointing the finger at men like we are always in the wrong. No fuck you.","post_message":"Alexis Bloomer has taken to social media to give a speech on why her generation is so self-centered."},{"comment_id":"10153232887939071","commenter_b":"@username she's a bad asss","commenter_a":"Zelal Tas","post_message":"The Canadian model who is fighting ISIS in Syria says the terrorists are all cowards."},{"comment_id":"10155129809471929","commenter_b":"These two ladies. Need to step down they showing how they are. Active. With their mouth","commenter_a":"Crack kills","post_message":"Speechless folks..."}]
