[{"comment_id":"10153212964226336","commenter_b":"Daniel Eskildsen just because this women gave her kid a cookie doesn't mean she fills her kid with junk food.. cookies in my house are a treat to the healthy diets I have my children on..","commenter_a":"Teachers need to worry about teaching and not parenting","post_message":"Cookie crackdown! A preschool teacher sent a note home reprimanding a Colorado mom for packing Oreos in her 5-year-old daughter’s lunch."},{"comment_id":"1060479207341941","commenter_b":"@username you are stupid and Crystal takeaway from drugs looking for help never is to late for live free of drugs jajajaja jajajaja jajajaja.","commenter_a":"Hillary for Iowa the best candidate for president and 2016. Go @username go.","post_message":"5 days to Iowa!"},{"comment_id":"10157094830145354","commenter_b":"@username imagine if all illegals and invaders were deported!","commenter_a":"Will a moat filled with gators and sharks be next? Just make sure the fence has a gate so he can GTFO in a few months.","post_message":""},{"comment_id":"10153521942669369","commenter_b":"Criminals will just buy another brand.","commenter_a":"Good. Maybe less guns on the streets.","post_message":"It's the end of an era."},{"comment_id":"724989260938156","commenter_b":"Honestly I wouldn't blame people for moving to canada if trump got presidency tonette kamakahi-gumapac","commenter_a":"Votefor Trump Happy Easter. Let's spend next Easter with Trump in the White House!","post_message":"Happy Easter to all, have a great day!"},{"comment_id":"10153166532823188","commenter_b":"Women voting for conservatives are the ultimate foolish morons...","commenter_a":"I am a conservative FIRST and there is NO other party to which I can relate...I pray for common sense and decency to prevail but I REFUSE to ALLOW a few bad apples to make me think there is no hope within this party!!","post_message":"It's too late to save it."},{"comment_id":"10154660419633797","commenter_b":"I'm pretty sure Russia is still one up on us!!","commenter_a":"Yup I'm a contributor","post_message":"AMERICANS DRINKING MORE: For the first time in nearly 15 years, everyone around the globe is drinking less alcohol. Except for people in the U.S."}]
