[{"comment_id":"1075179569197597","commenter_b":"Crooked Worthless Hillary for Prison","commenter_a":"You brag about being a grandma on your Facebook page. Why don't you stay at home with your aides? Give your grandkids cookies and milk. America is a great country that influences the world. It needs a strong leader. POTUS is not a position for the weak and feeble.","post_message":"Danny Williams and his wife Leah lost their home after Trump University took advantage of them."},{"comment_id":"10153702607362014","commenter_b":"Heck yes I'll be trying this!","commenter_a":"This makes me think of good luck Charlies Bob-burrito lol","post_message":"It's the hybrid you've always hope for (or quite possibly not)."},{"comment_id":"1778494812377732","commenter_b":"@username, so your point will be valid according to the justifications of the San Bernardino and Paris Massacre victims and their families? How much more American people must die before you realize even 1 terrorist is unacceptable for the sacrifice of our lives just to be nice to foreigners?","commenter_a":"Does anyone remember FDR's ban on Japanese and Jimmy Carter's ban on Iranians? Oh, and they were both Democrats, but Trump is being compared to Hitler for suggesting we ban Muslims. Funny how that works.","post_message":"Skyscrapers. Music. Athletics. Comedy. The list goes on and on ... After Donald J. Trump's recent controversial remarks, here's a look at the United States without the influences of Muslims."},{"comment_id":"939237909458566","commenter_b":"Time to put two carrier groups in the area and drop lots of big fire crackers and line up some goats for the departed cave rats....but that raghead POS that lives in the WHITEHOUSE will do nothing","commenter_a":"Uh....why????","post_message":"BREAKING NEWS:"},{"comment_id":"10153046934697894","commenter_b":"#SaveYourself #hatinAssHoes","commenter_a":"Because she can't find a job doing anything else #shade","post_message":"Dawn Richard Announces She’s a New Spokeswoman for PETA (People for the Ethical Treatment of Animals) [Photo]"},{"comment_id":"10152986560831336","commenter_b":"She belongs on SNL.....She is like a comic...! She is so stupid...!","commenter_a":"And just when you think you've send the bottom of stupid, you find there's even a lower level","post_message":"The key to defeating ISIS is... job opportunities?!"},{"comment_id":"484838455040068","commenter_b":"Yes, ban Sharia Law in the USA","commenter_a":"I hope tsa patted her down throughly to make sure she wasn't carry bombs, I think the whole thing is a set up!","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake. Shariah Law is dangerous, we support the patriots that stand against it. Should Shariah be banned in all 50 states?"}]
