[{"comment_id":"10153487463364203","commenter_b":"Problem is not her parents. Problem is a whacked out white woman desperately wanting to be black.","commenter_a":"It's weird but I wonder why her parents threw her under the bus. Must be something else going on.","post_message":"The NAACP president in Spokane, Washington, has come under investigation after her parents said she been posing as black for years."},{"comment_id":"840225226093860","commenter_b":"Science is proving the bible and religion is a load of rubbish...!","commenter_a":"The Bible is just a story book... Religion is a fable... looking for God is like going into a dark room and looking for a black cat that does not exist ! what religion does to people is brain wash them..","post_message":""},{"comment_id":"10152934177006051","commenter_b":"Stupid Bitch you need your ass whipped","commenter_a":"Karma","post_message":"Even the police were stunned that a teen girl could be so cruel to an elderly woman."},{"comment_id":"10156215776400354","commenter_b":"The grisly death of a human life, which is abortion, has a dedicated, zealous following who treats the death rite in a religious manner. Clearly, there's more at work here then just the convenience of sloppy people. Imagine an America with 19 million more black people, virtually all of which would vote Democrat. Things would be much different. The 55 million human lives lost since '73 would make for a vastly different nation. Democrats commit crimes against humanity in many different ways, and clearly abortion is the most depraved and reprobate of them all.","commenter_a":"They need to harvest her vagina","post_message":"“Planned Parenthood is proud of its limited role in supporting fetal tissue research.”"},{"comment_id":"10152869218796336","commenter_b":"They are illegal!","commenter_a":"Proud of them reporting TRUTH instead of warped pc bs.","post_message":"A California newspaper will continue to use the term \"illegals\" to describe people who enter the U.S. without permission, despite an attack on its building by vandals believed to object to the term."},{"comment_id":"963452387028567","commenter_b":"Judy.. that is a huge part of the problem with the US today.. Dumb parents raising dumber kids. She has NO id ... can not drive nor get married nor get any medical care. How Stupid is that? She gets sick .. just stick her in the dirt right? Great parenting.","commenter_a":"That's amazing. Her parents should be charged with abuse.","post_message":"Her parents never got her a birth certificate or social security number, never took her to a doctor or let her go to school, and now she has no way of proving to the government that she even exists."},{"comment_id":"10153641029539205","commenter_b":"the hell?","commenter_a":"Wow","post_message":"George Zimmerman Goes After Trayvon's Family"}]
