[{"comment_id":"10153361395611107","commenter_b":"Class on the left, and no class on the right. She is just another, inept, liberal, lying skank. I put her in the samne group with that traitor, Hanoi Jane.","commenter_a":"Better yet , hit her at her cankles. Paul/Trump ... Trump/Paul for America, not the establishment","post_message":"Guess who I ran into? Tune in to @CBS now to find out why I think she should forever be precluded from being potus"},{"comment_id":"1058499540933711","commenter_b":"@username ... You love those liars, don't you.","commenter_a":"Women, would you want your children to have Trump as their Teacher? Their Minister? How about as your kids Father? if you said no to any of those, then you don't want Trump as your president either.","post_message":"“And when you’re a star they let you do it,” Trump says. “Grab them by the p---y. You can do anything.”"},{"comment_id":"903353419700080","commenter_b":"She is so nasty looking all the time I bet she stinks","commenter_a":"What is Always wrong with her tongue? Personal hygiene is a must. Can someone tell her to brush it .","post_message":"Awesome!"},{"comment_id":"10153131128315950","commenter_b":"I hope their daughters get pregnant out of Wedlock","commenter_a":"I'm sorry, but your country deserves one more crazy, running it. Welcome Donald!","post_message":"The House voted to block Planned Parenthood's federal funds for a year."},{"comment_id":"963644947039340","commenter_b":"But she is dirty","commenter_a":"She knows women's issues best","post_message":"Watch live as Hillary talks to students at New England College in New Hampshire about the issues on their minds."},{"comment_id":"10154296658174411","commenter_b":"@username Actually, no it wasn't in response to that comment. I wasn't responding to Andy Shitman anyway.","commenter_a":"imagine a group of 4 thousand russian troops on a boat alongside new york..... and then telling the us theyre acting aggressive.. LOL","post_message":"'Russia is acting in an extraordinarily provocative behavior'"},{"comment_id":"10153721033369575","commenter_b":"Karen Crowder what the hell does immigrants have to do with it?!","commenter_a":"What's low gas prices have to do with bed bug's? Are they in the gas?","post_message":""}]
