[{"comment_id":"1324175080956294","commenter_b":"You'd rather vote for Killary That murdering lier. God help us.","commenter_a":"Can't imagine any decent American voting for this clown!! I'm not the biggest Hillary fan but anything is better than this. Use this weekend while we spend time with family and friends to first of encourage people to VOTE. And then let them know the evils this dude is spewing. We've come too far to let this dude take us backwards!!","post_message":"Just when you thought Trump couldn’t get any more racist and misogynist, he manages to lower the bar of human decency."},{"comment_id":"10152965778679641","commenter_b":"Nigeria should not only recall her ambassador but,should ask all indonesians to leave within 7days. Including \"INDOMIE NOODLES\" A Nigerians should stop patrpnizing INDOMIE NOODLES and anything associated with Indonesia","commenter_a":"I guess you better think twice before messing with illegal drugs in Indonesia.","post_message":"Indonesia executes six people, including five foreign nationals, by firing squad; Brazil and the Netherlands recall their ambassadors in response. @webpagelink"},{"comment_id":"1353803527975767","commenter_b":"Lock there asses up!","commenter_a":"Lol look how racist worded the article. If it were a black victim and white captors u know this headline would of been completely different hahaha hypocritical libs","post_message":"Four teenagers tortured a person with disabilities and streamed the horrific attack on Facebook Live. WARNING: Graphic footage."},{"comment_id":"10153000605642060","commenter_b":"The way all states should be.","commenter_a":"When purchasing a firearm in a Louisiana gun shop, a buyer will encounter limited procedural barriers. Louisiana is commonly referred to as a \"gun loving state.\" The only necessary requirement for purchase is a valid driver's license, which can prove the buyer meets the federal age limits: 21 for handguns and 18 for shotguns or rifles. There is no gun permit required to purchase a firearm in the state, nor is a gun license mandatory to detail ownership. Registration of long guns or handguns is also not required under Louisiana law. There are no restrictions on long guns in the state; the only areas where an individual cannot carry a loaded shotgun or rifle are on college campuses, or properties that specifically designate the barring of weapons. Areas such as schools, hospitals, municipalities, and places of worship often disallow carrying privileges. It is also permissible to transport loaded long guns ...","post_message":"Gov. Bobby Jindal believes Louisiana law is strong enough to prevent people with mental illnesses, like the Lafayette shooter, from purchasing a gun."},{"comment_id":"10153845270776167","commenter_b":"Joe make up your mind, can't have it both ways.","commenter_a":"Joe. That's the dumbest lie You've told. And that's sayin somethin","post_message":"Even small children would call this excuse nonsense."},{"comment_id":"888390488018194","commenter_b":"Feminazi bitches","commenter_a":"This program has got to go...what is Disney thinking...stopped watching it long ago....they have become left extremists...they are just like the long time politicians...our view is the one that you people should be thinking...totally out of touch with common people...don't these so called stars get it...we don't care what you think","post_message":"Let's help them pack their bags. Do you want The View gone?"},{"comment_id":"649755178530332","commenter_b":"Please start packing now! Believe me no one will even miss you and your dirty mouth.","commenter_a":"V","post_message":"I guess it's time to say goodbye, and good riddance. 'LIKE' if you support Whoopi leaving the country!"}]
