[{"comment_id":"10153485942076491","commenter_b":"Thanks for the suggestions Mark but I really don't care what yoy think I should be reading.","commenter_a":"He really should narrow that down to a top 10 list. Nobody likes to read that many books.","post_message":"It includes ‘The New Jim Crow’ by Michelle Alexander."},{"comment_id":"1056318254456150","commenter_b":"It's not an illusion. It's fact. Nothing like this has happened in 38 yr. Life comes with no guarantees. Accidents happen!","commenter_a":"Yeah, but I'm sorry . . . Disney has created this illusion of fantasy and safety. The illusion that one can experience fear and threat in a safe environment. In fact, they have made millions (billions) of dollars designed on that premise!","post_message":"\"This is Florida, and it's not uncommon for alligators to be in bodies of water.\""},{"comment_id":"1523980264284296","commenter_b":"I love spinning when your winning !! #MAGA #GBA","commenter_a":"I love how this man thinks and his love for Ameirca. :)","post_message":"I think Donald J. Trump has every intention of revising how everything happens in Washington, in terms of how it happens, how fast it happens, the routes you take to make things happen. If I'm right, it's gonna be fun to watch 'cause people's heads are gonna be spinning trying to catch up with him."},{"comment_id":"10153118055667623","commenter_b":"She's hot!!","commenter_a":"If you have to fight for him then he wasn't yours in the first place. I hope that you're pleased with yourself in hindsight today.","post_message":"A 26-year-old North Carolina woman allegedly stabbed another woman Tuesday night during an argument over a man."},{"comment_id":"10153359529326051","commenter_b":"I would have beat her ignorant ass with a stick too. Hopefully karma hits her with a Mac truck.","commenter_a":"And that is why I dont trust daycares","post_message":"When this woman's 2-year-old son came home with these marks on his leg, she marched down to his school and demanded to see the surveillance footage. Now she's even more outraged."},{"comment_id":"1612302922163164","commenter_b":"No idiots!!!","commenter_a":"No. Sickening. Stop enabling these nuts.","post_message":"Should Germany allow child brides out of respect for Muslim culture?"},{"comment_id":"962171047226860","commenter_b":"She's a loser. She should stay with a loser.","commenter_a":"Well it's about time! Now she and Hillary can be together.","post_message":"Breaking: Huma Abedin announces she's separating from Anthony Weiner one day after husband's new sexts emerge."}]
