[{"comment_id":"1082429571840463","commenter_b":"Sounds like @username sharing a very personal account.","commenter_a":"I agree, but those who refuse to see this analogy... the seriousness or the truth of what is happening to America ... and what to do about it... before it's too late and America is totally unrecognizable... is another story.... the story of the real American history is not being taught for one thing ... the story as in the recent documentary by \"Dinesh Desouza, \"Hillary's America\"... the story of the real America is not being told in the history books or on the campaign trail...and not mentioned once in any of the debates....WHY??? these are the people who need to hear the real American History .... I for one was in shock...to learn the truth... but was blessed and was one of the fortunate ones to \"see\" this documentary... but there are others who are ignorant of this truth ... who are or choose to remain a victim or ...","post_message":""},{"comment_id":"10154403443803338","commenter_b":"Stupid bitch , be serious","commenter_a":"Let me guess....they were ALL shot by white police officers.....","post_message":"Eight kids under age 10 shot in past 28 days, according to CPD."},{"comment_id":"799759520167266","commenter_b":"DONALD TRUMP IS NOT A RACIST HES HIRED ALL NATIONALITIES ALL OVER THE PLACES HE OWNS AND PAYED THEM GOOD AND WAS FAIR TO ALL OF THE PEOPLE WHO WORKED FOR HIM AND HE WILL DEFINITLY MAKE A GREAT PRESIDENT FOR US AMERICANS NO MATTER WHAT RACE THEY ARE ,WERE HILLARY COULD CARE LESS ABOUT US AMERICANS SHE JUST SAYS THINGS TO BLACKS OR WHITES OR ALL OTHER RACES TO GET VOTES JUST LOOK AT HER BACK ROUND AND WHAT DID HILLARY OR OBAMA DO WHILE THEY WERE IN THE WHITE HOUSE FOR US ABSOLUTELY NOTHING BUT BROKEN PROMISES AND THEY GOT RICHER WHILE WE GOT POORER","commenter_a":"HILLARY 2016...","post_message":"REPLAY: Donald Trump at a rally in Wilmington, Ohio."},{"comment_id":"10153516438828487","commenter_b":"Shut up douche bag .","commenter_a":"Everything and everyone is interconnected in this economy. To say the NYSE had a series of computer glitches is to mislead the greater public and further cover up the truths behind the shut down.","post_message":"On Wednesday, technological glitches shut down the New York Stock Exchange and grounded thousands of United Airlines flights."},{"comment_id":"10156512492735354","commenter_b":"Togetherness...as long as all the women keep their mouth shut. Maybe the punchline is exactly what I wrote.","commenter_a":"What does this photo actually say? It says girls are annoying. Girls talk too much. Girls should be seen and not heard. Whatever a girl says is not important. Men do not want to hear what a girl has to say. Little boys have a voice but little girls do not. The husband's voice is more important than his wife's. Seriously? I can't even imagine what kind of \"joke\" they were trying to tell with this photo. This is hardly funny at all. It's not that this is necessarily offensive, it's just frickin' sad, ignorant, and misogynistic. Congratulations to this mother and father...they have essentially taught their daughters a very important lesson as to their place in this world...and that they have NO VOICE!","post_message":"A firestorm of controversy has erupted over a viral Christmas card depicting a man's wife and girls with mouths taped shut..."},{"comment_id":"1539781299650210","commenter_b":"Trump will CRUSH Hillary!!","commenter_a":"if you know Hillary will lose against Trump click like","post_message":"Wendy Long: Trump's 'America First' Platform Will Grow GOP Nationwide."},{"comment_id":"10153366601141770","commenter_b":"Where is our freedom of speech??? Keep your rioters away from TRUMP! You all send them with your lies of deceit...so you can have business as usual in Washington! We Americans see right through you...the uneducated don't...or the naive youth..","commenter_a":"what happened to freedom of speech? trump had nothing to do with the violence at his rally in chicago these were paid punks to not let him speek","post_message":"Mitch McConnell told reporters he and Donald J. Trump spoke by phone Tuesday and he encouraged the New York businessman to “condemn” the “violent expressions” at some of his political rallies."}]
