[{"comment_id":"10150863474824999","commenter_b":"As opposed to when exactly? When was this glorious period of time when everyone spoke the truth?","commenter_a":"the problem these days we do not know who or what to believe, everyone seems to have their own agenda and telling lies is at the top of their agendas.","post_message":"\"Few other countries go to such lengths to deliberately inflict suffering on people seeking safety and freedom.\""},{"comment_id":"10153842554698132","commenter_b":"How about all of the leading men she banged?","commenter_a":"He deserved it for having to put up with her stupidity","post_message":"\"That's actually a common answer believe it or not,\" the host replied. @webpagelink"},{"comment_id":"10154103250631756","commenter_b":"\"Are ya goin' ta prison like my maw??\"","commenter_a":"\"Are you goin' ya prison like my maw??\"","post_message":"Cuteness abounds, but so do questions about whether the kids are plants."},{"comment_id":"396121180569763","commenter_b":"Yes she definitely deserves to lose her license bigoted bitch","commenter_a":"Not only doctor in the world......find a new one...wouldn't want that dr touching my kid.","post_message":"Does the Hippocratic Oath allow for doctors to make this kind of choice?"},{"comment_id":"1100419663375801","commenter_b":"HUMMM correct me if I am wrong, but I believe Hillary sold russia 20 % of our uranium, why would she do that.","commenter_a":"Trump is a Liar, a Cheat and Putin adoring Traitor to his country but, he wants to make America White Again and that's all his supporters care about. He played the Race Purity Card and they said Deal Me In! Since then, nothing has changed their minds and nothing will. He's as corrupt as any politician we've ever seen and they just don't care, because they are just like him. They live their lives without a moral code.","post_message":"Chris Matthews: \"Birtherism is not, has not been, a theory; it has been an insistence of some sort of racial test.\" More from Hardball with Chris Matthews: @webpagelink"},{"comment_id":"985973531519425","commenter_b":"All republicans should stand behind \"the people's \" choice!!!","commenter_a":"Who needs him I hope he gets fired","post_message":"What do you think? Is it too late? @webpagelink"},{"comment_id":"10153564922718984","commenter_b":"I think the Hispanic people think that the U.S. owes them everything. Being a hairdresser I did lots of H/cuts on men. They wanted every hair on their head to be Perfect. It really bothered me when so many men came in the salon just to wait until the H/C was finished. They would bring young girls with them, who could interpret the English language. It was so hard for the young girls to be put in the middle to speak for them & me. This should be a wake up call due to illegal immigrants.","commenter_a":"We all know this!!!","post_message":"This frustrated sheriff just sent a huge message to America that perfectly sums up Donald J. Trump ... his words are going viral and it's easy to see why. What do you think about what this sheriff just said about Trump?"}]
