[{"comment_id":"10153141581576336","commenter_b":"This is because the Tri County area in Mi is one of the largest Muslim areas in the country. I'm sick of it too, this whole scenario is not going to end well for Christians.","commenter_a":"GARBAGE!","post_message":"Students at the University of Michigan successfully petitioned to cancel a campus screening of 'American Sniper' – claiming the film promotes anti-Muslim rhetoric and made them feel unsafe."},{"comment_id":"1000558950003853","commenter_b":"Nope. But I've had enough experience with woman in business to know that they are always looking for some excuse to demand a refund, which they never get.","commenter_a":"this is how women are - always looking to steal back their money.","post_message":"He who pays the piper . . . doesn’t like him drinking"},{"comment_id":"10156637699435354","commenter_b":"Political whore?","commenter_a":"If the polls leaned toward Bhudism, Hillary would relate to Buddhists.She tries to relate herself to whichever way the liberal winds blow. If one doesn't agree they are homophobic, racist or worse...a conservative.","post_message":"Haters gonna hate..."},{"comment_id":"10155023002574740","commenter_b":"Leave that girl alone","commenter_a":"Shepard Smith Reporting Donald Trump President of USA doesn't want the media or anyone announcing his plans to defeat Isys enough already of selling our plans out globally, do like Donald Trump says we're going to take action without letting them know when, stop @username with telling Isys our plans","post_message":"The Office of Government Ethics is asking The White House to investigate Kellyanne Conway over her remarks regarding Ivanka Trump and Nordstrom. @webpagelink"},{"comment_id":"10154942733646873","commenter_b":"Sally Yates we need more of you. Well done.","commenter_a":"We have a dictator as presidentDon't agree with him ,you are fired","post_message":"Sally Yates had said the Justice Department would not defend in court Trump's immigration order."},{"comment_id":"741928785958028","commenter_b":"Stop calling it \"OBAMACARE\"! It's the AFFORDABLE CARE ACT!!!","commenter_a":"The people that voted for Trump knew that this repeal was part of his plan. You voted for him, don't cry now. Suck it up. Unfortunately the ones that didn't vote for him have to suffer too.","post_message":"The American people know that this is a matter of life-or-death, and they're letting Republicans know it."},{"comment_id":"236858020109682","commenter_b":"Get the lady off the pic","commenter_a":"He got in there by something called \"voting\". Just saying","post_message":"LIVE VIDEO: 'Not My Presidents Day' anti-Donald J. Trump protests are happening across the country. WARNING: Viewer discretion is advised"}]
