[{"comment_id":"701702956662495","commenter_b":"She should be locked up","commenter_a":"Rusty Shackelford stand by more to come","post_message":"We wanted Hillary Clinton to know we captured all of her best moments from the past year!"},{"comment_id":"10153986738115667","commenter_b":"She is a joke","commenter_a":"Haters go away","post_message":"\"The American people deserve to get the full and complete facts immediately,\" Clinton said in her first comments about the newly discovered emails. She added that she is \"confident\" the FBI won't change its mind about bringing charges against her."},{"comment_id":"1360158044010314","commenter_b":"Yup :)","commenter_a":"Yes, America will get it right. Our next President will be Donald Trump. I pledge to all the women like me not to listen to the media who wants to portray Mr Trump as being against women, please don't listen to it. Mr Trump will be good to everybody in his administration. He is a fair man.","post_message":"THANK YOU, AMERICA! I love you!"},{"comment_id":"10154583346243855","commenter_b":"Governor Brown will be on the right side of history!","commenter_a":"Big talk now. Let's see how mouthy he is when President Trump and the Congress cut off funds to states who harbor illegal aliens and otherwise defy federal laws. Can't wait to see CA in an even worse budget squeeze. Talk is cheap when others are paying your bills.","post_message":"Thank you, Jerry Brown! Read the full text of the California governor's anti-Trump State of the State address: @webpagelink"},{"comment_id":"10154948296594203","commenter_b":"all the illegals voted too..","commenter_a":"Hillary has 2,017,563 extra votes then Trump. The difference of extra Two Million+ vote which can give a decisive victory to a candidate \"anywhere else in the world\" has ZERO value in America?","post_message":"BREAKING."},{"comment_id":"846780482084872","commenter_b":"You are an ignorant woman.","commenter_a":"This is making me sick, and it. Is a sin in the eyes of the lord.","post_message":"The sailor's boyfriend was nervous he would \"screw it up and fall in the water or something.\""},{"comment_id":"931005183682927","commenter_b":"Send that black bitch back to the jungle baby.. Yeeaaahhh","commenter_a":"Fire her. if she were white, she would already be gone.","post_message":"Sam's Club CEO made some serious anit-white racist comments. She thought it would slide under the radar because it was directed at white people. She was very wrong. Payback that is happening has been brutal and swift and she deserves it. Can we get 5,000 'LIKES' to fire this CEO for racism?"}]
