[{"comment_id":"1047910738660847","commenter_b":"Exactly who would this little girl call if a robber happened to storm into her place of employment and point a gun at her, another employee or patron? Who would she be begging to step in between herself and a threat? Who would be more than willing to lay down his life for her? The answer is the man she refused to serve. I'm glad she lost her job. I hope others learn from her foolish mistake.","commenter_a":"hahahah yes!","post_message":"An Alabama Taco Bell employee who refused to serve police officers has been fired."},{"comment_id":"10153425885744255","commenter_b":"Look, bozo, I suggested 68. It's 66 now. That's two years, not nine. That's my answer. Thanks for the cute little story, though.","commenter_a":"Social security was developed when people rarely lived to be 65. It's stupid to keep it at 65 in this day and age. Bernie is a fool.","post_message":"Damn straight. By Daily Kos user Tool"},{"comment_id":"1393322447348037","commenter_b":"NEVER Hillary!","commenter_a":"Petulant child is what Cruz is. Anyone who still endorses Cruz endorses Hillary Clinton!","post_message":"Comparing the print version of Ted Cruz's RNC speech to the rendition that got him booed off stage really does prove it's all in the delivery."},{"comment_id":"1030052270365446","commenter_b":"If she is afraid her flatulence will be recorded maybe she should stop opening her mouth.","commenter_a":"Up here.... they would call that problem... The Rocky Mountain Quick Step..... apparently it isnt that quick with the carpet bagger of the east","post_message":"\"Sorry.\""},{"comment_id":"10153347624056509","commenter_b":"No.","commenter_a":"Hate crime. obviously","post_message":"Angry family members insist this had nothing to do with a parking spot, and a spokesperson said the suspect had threatened the victims before: @webpagelink What do you think? Share your thoughts in the comments."},{"comment_id":"1178309965526894","commenter_b":"@username I understand and do not disagree with you. I just believe that there is enormous demand for illegal workers by American employers for whatever reasons. That demand is what brings the illegals to this country and no one ever talks about this.","commenter_a":"Donald Trump does not have a problem with Mexican's, or anyone else for that matter. He has a problem, as do I, of illegally crossing the border to make use of our system without going through the proper channels. If you don't also have a problem with that, then this country is doomed.","post_message":"Worker says he took a stand against Donald J. Trump and his immigration policies by hanging a Mexican flag at the Trump International Hotel in Vancouver. \"From the concrete pouring, finishing, drywall, taping, wood forming and general labour, Mexicans were there, building it.\" @webpagelink"},{"comment_id":"10154712267998145","commenter_b":"@username no you're just a pussy","commenter_a":"And the trend has been set. Everybody just open fire at will. Don't worry about those pesky innocent bystanders and there's no need wasting tax dollars on a trial. Apparently stealing is an automatic death sentence. From diapers to Dodges citizens can now act as judge, jury and executioner. Smh.","post_message":"A man shot at least 18 times at someone who had stolen his pickup truck early Monday from an apartment complex, the Winter Garden Police Department said"}]
