[{"comment_id":"1980759552150599","commenter_b":"Or maybe he was trying to check on the deer...i'd kick the deer too if it attacked me. Get over yourselves people","commenter_a":"Looks to me that he was scared and didn't know where he was going....not \"coming back to attack the driver\". LOL! Poor deer!","post_message":"STARTLING: Video shows a deer come back and attack the driver who struck it. But the driver fought back. It happened in Howell, New Jersey. Details: @webpagelink"},{"comment_id":"604349323031583","commenter_b":"You're an idiot. It doesn't matter what book you use to swear I could use The Heir to the Empire by Timothy Zhan and that would be acceptable. This is a secular country not a Christian nation if you want to argue that fact look up the 1st ammendment which is the freedom of religion and freedom from religion in addition to separation of church and state. If she wants to use the Quran let her if you want to use the Bible fine if I want to swear on a star wars book damn those corrupt judges I'm going to swear on my Star Wars book","commenter_a":"No. We use the Bible in this country.","post_message":"Should he have allowed her to take her oath on the Koran?"},{"comment_id":"10153527137233717","commenter_b":"Hell no! The real woman for the job is Hillary! #Hillary2016","commenter_a":"Please support Carly Fiorina tomorrow! Non establishment, proven leadership. Fight against the machine with a level headed conservative. Please support Carly! She needs your help to place in the top 4!","post_message":"Donald J. Trump is holding a rally at the Verizon Wireless Arena in Manchester. Watch live: @webpagelink"},{"comment_id":"1113705405389179","commenter_b":"Why do we have 400,000 permanently disabled Americans? Oh because of the 2,996 people killed and more than 6,000 injured during 9/11? So we lost more Americans in good health because war mongers like Hillary Clinton wanted to strike back? Thanks Hillary for your vote on the Iraq War.","commenter_a":"Thank you, Obama...we love you as a President!","post_message":"Excellent news for 400,000 Americans!"},{"comment_id":"10153049947289170","commenter_b":"From the info I have seen, they have entire areas that could just be surrounded and taken out......all those \"unsafe for non-muslims to enter\" areas......","commenter_a":"At least someone in power will acknowledge these Muslim terrorists need to be taken out! The problem is they have almost completely taken over France at this point. Apparently France has over 750 No-Go zones in which only Muslims are allowed to live and travel in these territories. Sadly the govern has let them take over like this.","post_message":"I guess this was some reality check."},{"comment_id":"10153221269572464","commenter_b":"Yes, Hillary should indeed be going to jail, for life! People were killed because of her. :(","commenter_a":"I think she should be going to trial instead of running for president....","post_message":"We need to restore America’s leadership: @webpagelink"},{"comment_id":"10153292399553984","commenter_b":"He has it coming to him.","commenter_a":"yes I do","post_message":"Obama's big plans have blown up in his face! That's got to hurt... Do you hope Obama finally gets the message?"}]
