[{"comment_id":"886212474747508","commenter_b":"she is a trashy shank","commenter_a":"This guy rips her a new one. Good for you.","post_message":"Michelle Obama has no class, and he sets the record straight!"},{"comment_id":"710336325799525","commenter_b":"U R A STUPID BITCH !!","commenter_a":"Yes she is a well educated lady. She puts family first and shows alot of class. She was a model you don't hear people caalling actresses names for their jobs. She also is a women who knows how to work hard , she understands the immigration system. She also understands the average needs of the normal everyday person.","post_message":"Will Melania Trump make a good First Lady?"},{"comment_id":"10153639993996135","commenter_b":"She is a criminal....wake up!","commenter_a":"Her speech was excellent! Very well spoken and original.","post_message":"What did you think of the First Lady's speech?"},{"comment_id":"919328804793264","commenter_b":"These girls have behaved impeccably!!","commenter_a":"As soon as someone denies being racist, the following lines reveal their bigotry.","post_message":"Once again, we are treated to a massive display of Tea Party \"not-racism.\""},{"comment_id":"10153931727246162","commenter_b":"She deserved it!! Drunk idiot","commenter_a":"Excessive indeed, but I wonder what happened before he tossed her in.","post_message":"North suburban Skokie has agreed to pay $875,000 to a woman who accused a police officer of using excessive force after a DUI arrest: @webpagelink"},{"comment_id":"1602329080072552","commenter_b":"Didn't he say \"it's easy for us to be around this everyday. It's hard for them to adjust after coming back from war\".","commenter_a":"Vote for Hillary...to finish the job on America that Obama started....","post_message":"Trump's message to veterans with PTSD isn't just wrong. It's dangerous. - Jon Comulada"},{"comment_id":"10153779416811509","commenter_b":"I pledge allegiance to the flag of the United States of America......not the flag that fought against it #patriot","commenter_a":"People need education on the history of the flag and the different types of confederate flags. The black confederate flag is the bad one.","post_message":"Mississippi's House Speaker says his \"state's flag has become a point of offense that needs to be removed.\" The Confederate flag appears in the top-left corner. @webpagelink"}]
