[{"comment_id":"10152955255282452","commenter_b":"@username, abortion is legal even in the third trimester.","commenter_a":"How about we teach students and other young girls about birth control (not making it a religious issue) and make it more available to the public so we wouldn't have so many abortions in the first place. I don't like abortion, who the hell does anyways? But we shouldn't ban it. Let's push our efforts into making it as rare as possible instead.","post_message":"Anti-abortion activists on Tuesday released an undercover video showing a senior Planned Parenthood official discussing the disposition of parts from aborted fetuses. @webpagelink"},{"comment_id":"10152822886591130","commenter_b":"SHE* isn't 'dressed up as a woman. She is a fucking woman.","commenter_a":"Hold on a minute here, it's make your mind up here time fella/gal or whatever make & model you wake up wanting to be today as others (me) do mind where you take a piss as kids use these toilets and we need to protect from people who don't even know what sex they are from one toilet visit to the next !!!","post_message":"\"How we go about our business is none of yours.\""},{"comment_id":"629045897266731","commenter_b":"no - if they want to work, they must follow the rules of the company, not shariah law.","commenter_a":"omg,.... to quote Faye, No more 'political correctness' for me. I am getting tired of this \"FAVOR\" at the expense of the average AMERICAN citizen. ANY business ANY where in the USA that refuses to fly the AMERICAN Flag, that honors false Gods.....will not get my business, Period!!!","post_message":"Home Depot Embraces Shariah Law With ‘Muslim Sensitivity Training’. They are submitting to societal pressure. Do you think Shariah Law has no place in America?"},{"comment_id":"459523527541329","commenter_b":"Because so many criminals in this country. That's why I'm so confused why so many foreigners want to come here and live. Just stay in your own country and make it better there.","commenter_a":"Drugs and drug dealing. No good role models. Role models that are drug dealers ,pimps and prostitutes. Ex. Jay zeee. Beyonce, barrack oboma. All thugs. That promote drug use and degrade women.","post_message":"The U.S. incarcerates more people than any other country in the world. One in three African-American males born today are expected to go to jail or prison at some point in their lives."},{"comment_id":"10152907297842507","commenter_b":"look at them idiots......fff","commenter_a":"we need a new classification. White-Black-Latino-Asian-Native American-Loser.","post_message":"Anyone want to weigh in?"},{"comment_id":"10154285827248701","commenter_b":"Trump build that wall!","commenter_a":"Trump will take care of these ghetto rats . They will be leaving the ghettos to find work so they can eat. Instead of waiting for his kids mothers welfare check .","post_message":"He is the second officer to go on trial for the killing of 25-year-old Gray, who died one week after suffering spinal injuries in a police van last year."},{"comment_id":"542298055958487","commenter_b":"That shouldn't come as a suprise.There is alot more where that came from. JAIL HILLARY 2016","commenter_a":"If this was only true. If she is arrested she should be put it with all the other criminals and NO special treatment","post_message":"She looks good in orange..."}]
