[{"comment_id":"10158194484645725","commenter_b":"Dis bitch don't even answer","commenter_a":"@username @username Melissa F Hernandez @username MaFe Ndz We are going to take Matthew to Navy Pier again this year. You guys should come too!","post_message":"Tonight feels like the perfect night to see some holiday lights, don't you think?"},{"comment_id":"10152817810411636","commenter_b":"Hmm yes thats the trouble with war..it creats unstable countries which then lets the door open to yet more evil!","commenter_a":"Don't forget he got rid of Saddam Hussain who was committing genocide to thousands of men women & children..on alnost a daily basis!","post_message":"Surprise, surprise"},{"comment_id":"1048491781950666","commenter_b":"thats the look we give when they let Kellanne dumbass talk..why they ever listen to that dumb blonde i will never understand..","commenter_a":"That is after barfing.","post_message":"So true!"},{"comment_id":"10154917863094654","commenter_b":"Can women join this Club??????","commenter_a":"this is the best!!!","post_message":"Handlers of Pennsylvania's most famous groundhog are set to announce whether the rodent will predict an early spring or six more weeks of winter. More about the legendary Punxsutawney Phil @webpagelink"},{"comment_id":"1100137706687990","commenter_b":"Couldn't she have just not threatened him with scissors? Criminals need to be held to their actions","commenter_a":"Why were the police called? Where is the audio to the video? Why doesn't the video show the shooting? In the video, she is obviously advancing on the officer. And it doesn't matter how big the person is or what they have, a weapon is a weapon.","post_message":"If a 100lb woman makes you fear for your life, perhaps your to much of a coward to be a cop!!"},{"comment_id":"10153208409382093","commenter_b":"She asleep in the kitchen ?","commenter_a":"So just because you invite someone over that person has the right to have sex with you? No means no! And even if she was too drunk to say no, if she never say yes, then it is a freaking no! I didn't know that just because you let someone in your house you're automatically saying \"you can come in my house and rape me :)\"","post_message":"The victim said she woke up to find the suspect forcing himself on her.... so she fought back with what she could find... @webpagelink"},{"comment_id":"10153351807966130","commenter_b":"*you're behind a foolish *woman","commenter_a":"GO GIRL. WE'RE BEHIND YOU!!'","post_message":"Ashley Burnham was the first Canadian and aboriginal contestant to win the Mrs. Universe contest."}]
