[{"comment_id":"10153317099366051","commenter_b":"Caleb I agree. @username you are a fucking Looney toon. Crazy bitch","commenter_a":"She didn't kill him & usually if someone is threatening suicide it's because they're not gonna do it anyway! I have attempted suicide & have suicidal tendencies that I battle everyday but when you get ready to do it you don't inform others you just do it! I think it's bs that she is being charged when he had every opportunity to walk away....he chose to die no matter what she said to him! If you're steady telling me you're gonna kill yourself then I'm gonna tell you to go ahead and stop feeding me your empty threats!","post_message":"Remember the teen who convinced her boyfriend to kill himself? Well, she just got some bad news."},{"comment_id":"700385996818645","commenter_b":"We in America should do that too. The tree is evil, the fruit is isis and radical muslems.","commenter_a":"Thats what they want it makes them stronger. Causes more hate.","post_message":"Muslims are doing everything to stop him, but he won't relent. This might be what they have to do. Do you agree with his movement?"},{"comment_id":"1321956137825394","commenter_b":"Great, I'm off to Havana tomorrow!","commenter_a":"Cahl Denni Sharknado?","post_message":"Every single one of those black dots is a 2-meter-long shark."},{"comment_id":"614898638719277","commenter_b":"She's to stupid to no anything","commenter_a":"Reason for term limits are these two examples of our Representatives being out of touch with reality.","post_message":"So thoroughly unhinged it is impressive."},{"comment_id":"799197103604200","commenter_b":"Um Death, that's a No fucking brainer","commenter_a":"He needs to be in front of a firing squad. He appears to be full of racial hatred.","post_message":"BREAKING: Black Lives Matters Shooter Kills 7, Wounds 30 [VIDEO]. Things are getting out of control. They need to be stopped. What do you think his punishment should be?"},{"comment_id":"711583065610489","commenter_b":"He hates America and the American people, why cant people see that...","commenter_a":"He is a Traitor and Muslim.","post_message":""},{"comment_id":"992971160795677","commenter_b":"Jean Russ Awwww Jean you're so sweet. But Cruz has just shot himself in the foot again with the phony Obama-Rubio photo shot. What is this guy Cruz doing? Sabotaging his own political aspirations? Digging a hole like a mole; no eyes; no direction; tunneling is a blind panic of a junior Senator?","commenter_a":"I just voted for the best GOP candidate in 32 years! I voted for @username!!!","post_message":"TOMORROW: Join me and Phil Robertson \"The Duck Commander\" in Myrtle Beach or Charleston. RSVP here: tedcruz.org/south-carolina"}]
