[{"comment_id":"10153829560109062","commenter_b":"Illegals dont fil lout any forms,","commenter_a":"Who tell him Illegal immigrates do not pay taxes, there are special forms most of them pay by the end of the year simce they know if there a possibility to change their status they will have to show they paid taxes... Ignorance makes people say atupid things... sad!!!","post_message":"What do you think of the sign?"},{"comment_id":"884276841629012","commenter_b":"I'm not for it but I will say this: the government has known and has collected millions of dollars from illegals with fake social security numbers. Republicans and democrats both. To work here the illegals have had to come up with a fake s.s. number and pay on every check. This is a fact. I've seen it, known people who pay into it and will never see a dime from it. Our government is full of lies. They take that money and our legal money and blow it. Like I said I'm not for illegals but don't be blinded any side of the aisle in Washington D.C.","commenter_a":"This ia considered buying votes and that's illegal...but then everything Obama does is illegal. ..STOP HIM","post_message":"Thousands of illegal aliens could begin collecting from Social Security as a direct result of the president’s executive amnesty."},{"comment_id":"962417470484668","commenter_b":"Do with all the locks broken does that mean all these people will soon divorce ?","commenter_a":"Melissa Sheree Lisa Danielle","post_message":"Love 0 Heath and safety 1"},{"comment_id":"10157894599650291","commenter_b":"Every time a Democrat gets in, we lose more of our state and lively hood. Need to cut the head off of that green snake.","commenter_a":"how are you even still in office?...","post_message":"Today President Barack Obama placed the entire Chukchi Sea and the vast majority of the Beaufort Sea off-limits to energy development. The only thing more shocking than this reckless, short-sighted, last-minute gift to the extreme environmental agenda is that President Obama had the nerve to claim he is doing Alaska a favor. President Obama has once again treated the Arctic like a snow globe, ignoring the desires of the people who live, work, and raise a family there. I cannot wait to work with the next administration to reverse this decision."},{"comment_id":"10158010051555354","commenter_b":"I like the way you think. You are a strong ,smart woman. Hillary? Not so much 😎","commenter_a":"That's funny....I'm a woman and I don't feel the least bit threatened by the FBI Investigation. I felt violated when Comey gave her a free ride the first time around - this time, not so much!","post_message":"THIS is the best the Left can do?!"},{"comment_id":"10154480756700399","commenter_b":"I really thought republicans were smart enough to see that Trump was a racist with a corrupt moron compass, and a rapist.... I was wrong the Republican Party just embarrassed the world","commenter_a":"No, there won't be a gap; there'll be a canyon.","post_message":"\"It’ll be just fine. That’s what I do. I do a good job,\" Trump said while discussing his plan to replace Obamacare. \"I know how to do this stuff.\""},{"comment_id":"10153268288138984","commenter_b":"Asshole !","commenter_a":"I bet if the truth were known, he didn't get injured by some machine falling on him. I bet his wife finally had enough of him and beat the devil out of him!!","post_message":"You'll have to read this list to find out what the top worst moments of his career are, but I definitely know what the best moment of his career is... When he finally leaves!!!"}]
