[{"comment_id":"1256330341086427","commenter_b":"I recently read an article where he said he doesn't change diapers and taking care of the kids was his wives' responsibility, so I think it's fair to say he probably has zero understanding of fetal development and pregnancy. This is a man, after all, who called a breastfeeding woman disgusting for needing to pump breast milk. Fun fact-Donald Trump is not the only man who has no idea what he's talking about in this arena. I had a friend who had to explain to a coworker, who was a father of THREE children, that breastfeeding women need to pump at work because they cannot start and stop lactation at will. Guy thought a breastfeeding coworker could just wait until her 8 hour shift was done to start lactating, and was disgusted that she stored her breast milk in the fridge.","commenter_a":"As a C-Section baby myself, I was scratching my head for a good long while after he said that. I don't understand how a seventy-year-old man with five children (and a few grandkids!) could be *that* ignorant of childbirth!","post_message":"“It is, of course, such an absurd thing to say,” one doctor said. “I’m unaware of anyone that’s terminating a pregnancy a few days prior to delivery of a normal pregnancy.”"},{"comment_id":"10153507506919877","commenter_b":"Wendy get a life","commenter_a":"People always get offended when you say that you love dark skinned women. For some reason we have been deemed as \"too masculine\" or \"dirty looking\" or \"just unattractive\" because some how all dark skinned women everywhere are all unattractive *insert eye roll here*. We don't have the standard European features so when people say they love us they get offended and say \"well what about the rest of us?!\". No one said that he wouldn't date other races but he loves dark skinned women. Good for him because we are some beautiful women indeed!","post_message":"Mack Wilds Professes his Love for Dark-Skinned Women...and Wendy Williams Gets...Offended? Watch the clip below. Grio fam, what do you think of the young actor's remarks?"},{"comment_id":"10153707515144778","commenter_b":"Laura, by all means move to Georgia and so you can all the naked men you want.","commenter_a":"A Georgia police officer shot and killed a naked, unarmed man at an apartment complex Monday and this is local news because?","post_message":"A Georgia police officer shot and killed a naked, unarmed man at an apartment complex Monday. What exactly happened is now being debated."},{"comment_id":"10153687651936509","commenter_b":"Dont worry everyone...Jane cant be taken serious. She is a white liberal woman. We all know they are idiots.","commenter_a":"A black man said this...\"Over The Memorial Day weekend. Over 56 people shot in Chicago, 28 shot 9 dead in Baltimore, & the bizarre thing is; They want you to know the 'Police' are the problem in their communities. And I guarantee you they ALLLLLLL called \"911\" asking the \"Police\" for help & assistance when these shootings took place (go figure). A Fool will never recognize his own foolishness.\"- Johnathan Gentry.","post_message":"An outbreak of Memorial Day weekend violence left nine people dead in 29 shootings, according to police and CNN affiliates. What's behind these deaths? @webpagelink"},{"comment_id":"10152908269848855","commenter_b":"That isn't how lesbians do it.","commenter_a":"more and more promotion of sodomy","post_message":"Hooray!"},{"comment_id":"863141660412250","commenter_b":"I can't belive some young women want to pay tons of money for this,keep poppin those Skittles and you'll look like that in no time!","commenter_a":"Sorry but it's hard for me to feel sorry for these customers. One ounce of common sense would tell you....Do not let this person inject me with anything!!","post_message":"Toxic butt ‘doctor’ stuns court with her backside."},{"comment_id":"10153095122281770","commenter_b":"Screw her","commenter_a":"DONALD TRUMP for PRESIDENT","post_message":"Hillary Clinton urged attendees at her Alexandria, Virginia, campaign rally on Friday to “start a competing organization” to the National Rifle Association and join her fight to end the “plague of gun violence.”"}]
