[{"comment_id":"10153766161047217","commenter_b":"Stoning , beheading , kill non believers . No thanks not for me if that's peace then I'm a fairy","commenter_a":"Islam, this outdated cult ,has no place in a 21 century world....the quran is nothing more than a military pamphelt and islam is based on a cry for war to no end....madness......","post_message":"\"It's become much harder for modern women to live here after Friday night.\""},{"comment_id":"10152973439396323","commenter_b":"Yeah they need to give you a time frame to study and work then go back to where you came from. It shouldn't be a forever stay for immigrants. Once they get the freedom to stay for long then they going to start taking over. America is a big example, UK, France are big example of immigtants taking over.","commenter_a":"Well they are angry citizens and they have the right to be angry when their government keep dumping immigrants in their country like that, especially those taliban immigrant who want to take over Europe like they did to Spain in the 11th century. Somebody gotta stand up to it while others are bend over backwards to accept the influx of immigrants floading their homeland. Last I recall Germany is a Dutch land not usa.","post_message":"“We just want Germany to stay German!” The rise of the Pegida party"},{"comment_id":"10156293544295354","commenter_b":"@username why don't you move to the UK where you will be safer after all criminals don't have guns because they are illegal there and everyone know criminals obey gun laws .","commenter_a":"I'm a huge 2nd amendment advocate and there are 1000 reasons why the gun control crowd is wrong, but I really don't care for this particular argument. Public people are at more risk than private people to become victims of crime. Any of us can become victims of random crime, stalkers, etc., but overall, the public officials and celebrities draw more risk in that regard. Hillary is so loathesome and widely despised, she probably would have been gone long ago if not for that armed security. I, OTOH, just recently bought my first gun and didn't piss off anyone enough to want to kill me. I like to use that famous Japanese quote in WWII as to why they didn't even consider invading the U.S. - \"Invade the U.S.? Impossible, there's a gun behind every blade of grass\". Our guns keep our nation safer and serve as, I hope, some ...","post_message":"Hillary Clinton: If you truly believe guns don't save lives, why do YOU have armed security protecting YOUR life with guns? We regular folk can't afford to live in million dollar mansions like you and Bill do. Why don't you want us to protect OUR families and children with guns when you use them to protect yours? Signed, AMERICA"},{"comment_id":"10153659318868797","commenter_b":"You did a great job by taking this dog to the Vet, as well as putting you life at risk from being hit by traffic. And having to pay the bill just for an irresponsible person","commenter_a":"At least someone cared","post_message":"MUST SEE: This puppy was hit while wandering through traffic. A woman stopped to help, and even took the dog to the vet. Then, she held him in her arms as he died. The woman blasted the dog's owner in an angry letter she posted online, and it has since gone viral. Wow, you're going to want to see this:"},{"comment_id":"10156809367690725","commenter_b":"U shush up cactus lady","commenter_a":"STOP, JUST STOP! Trump uses this sad news to advance HIS agenda, and the terrorists use his rhetoric to advance theirs. DONALD TRUMP, JUST SHUT UP!","post_message":"Watch this clip from earlier this year. Time and time again- I have been right about terrorism. It’s time to get tough!"},{"comment_id":"10158293361345725","commenter_b":"Well mother nature must be a murderer because women spontaneously abort all the time. It's called a miscarriage.","commenter_a":"Although I consider myself a Progressive, I have to agree that abortion is murder. That is one thing that I agree with the Republicans. Not because of their political beliefs but me as a human being. Murder is murder and we shouldn't give permission to commit it.","post_message":"Ohio Governor John Kasich has signed a bill imposing a 20-week abortion ban, in a prelude to the broad offensive abortion-rights opponents plan to launch across the nation in January."},{"comment_id":"623307227823727","commenter_b":"She should never be President,God help us if she does","commenter_a":"This whole thing just makes me ill!","post_message":"Crooked Hillary Clinton Lies vs. the FBI: A Tale of Two Press Conferences."}]
