[{"comment_id":"10153877840551337","commenter_b":"I always hated rousey I'm glad her ass got knock the fuck out","commenter_a":"Truth is holly Holm is a real fighter n Dana white thought he picked another easy girl for Ronda to destroy well plan back fired ,Holm is a real fighter and real champion now let's see her n cyborg fight two top fighters Rousey is finished","post_message":"DAMN: Holly Holm didn't hold back with these comments about Ronda Rousey."},{"comment_id":"10153509244088854","commenter_b":"Go home!!","commenter_a":"Don't let the hit you in the behind when you leave","post_message":"Obama Claims He’d Be Treated Better In Europe, Whines About “Names I’m Called” In America..."},{"comment_id":"1019443361412045","commenter_b":"Let's use it to build the fuckin wall","commenter_a":"Twice as much as reported. The other half is getting sold back by corrupt DEA agents. Border Patrol did their job, now DEA will make it tougher for them.","post_message":"Guess high, REAL high."},{"comment_id":"10153625386991179","commenter_b":"@username. Thought you would like this!","commenter_a":"Tracy McElfresh Jesy Anderson","post_message":"Here's another one! Who is the genius behind these?"},{"comment_id":"1100419663375801","commenter_b":"HUMMM correct me if I am wrong, but I believe Hillary sold russia 20 % of our uranium, why would she do that.","commenter_a":"Trump is a Liar, a Cheat and Putin adoring Traitor to his country but, he wants to make America White Again and that's all his supporters care about. He played the Race Purity Card and they said Deal Me In! Since then, nothing has changed their minds and nothing will. He's as corrupt as any politician we've ever seen and they just don't care, because they are just like him. They live their lives without a moral code.","post_message":"Chris Matthews: \"Birtherism is not, has not been, a theory; it has been an insistence of some sort of racial test.\" More from Hardball with Chris Matthews: @webpagelink"},{"comment_id":"10153053075171770","commenter_b":"Yeaaaahhhh... She's much happier having a socialist traitor occupying the WH","commenter_a":"That's what I said about obama, and it's turning out to be true.","post_message":"\"That’s who I want representing my country, somebody politically incorrect. That will just be perfect.\""},{"comment_id":"10154298201954087","commenter_b":"STFU","commenter_a":"He's such a comedian.","post_message":"Lindsey Graham insisted Trump's administration look into the Clinton Foundation with an \"independent view, not a political agenda.\""}]
