[{"comment_id":"10153031435480671","commenter_b":"Soldier on ladies!","commenter_a":"Ricky Myette","post_message":"What do you think about two women graduating from the Army's elite Ranger School?"},{"comment_id":"865498240307419","commenter_b":"She does this for money . She is a witch like her Mom","commenter_a":"I do feel sympathy for Chelsea. She is truly a victim of the unlucky sperm club. She has to defend two people who are seriously flawed while trying to raise her own family. Their lecherous and unlawful behavior are certainly not her fault.","post_message":"Chelsea tried to challenge her, immediately regrets that decision. This woman was forcefully raped by Bill, let's show her some support for god sakes. Can we get 10,000 'LIKES' for her Bravery?"},{"comment_id":"852398211532955","commenter_b":"The DEMOCRAT PARTY IS A DEATH CULT! American deaths do not matter except to attack the Constitution! Democrats and their media mouthpieces HATE Christians, Jews, and conservatives, but support Islam because... ISLAM = DEATH CULT DEMOCRAT PARTY = DEATH CULT (facts): - The Democrat Party has a KNOWN NAZI (Soros) as its key financier and leader. - Fast & Furiously providing weapons to murdering gangs while trying to disarm Americans. - Freeing violent felons to MAIM AND MURDER AMERICANS! - Pushing an open border illegal alien invasion to RAPE AND MURDER AMERICANS, INCLUDING CHILDREN--, then BLOCKING KATE'S LAW which would have reduced all of this! - Treasonous support to fund Iranian terrorism (and nukes). - Ignoring the Islamic RAPE AND MURDEROUS SLAUGHTER OF CHILDREN, WOMEN, AND CHRISTIANS. - Freeing terrorists for a deserting traitor. - Promoting a race war that Satanist Charles Manson would be proud of. - Supporting Planned ...","commenter_a":"It's only been \"home grown\" since you started importing your Muslim brothers into the country.","post_message":"Here it comes..."},{"comment_id":"10153921510965329","commenter_b":"lol i thought this was cute calm down woman","commenter_a":"Alison Wonderland when you tame the mane...","post_message":"can't stop watching this"},{"comment_id":"969458729761266","commenter_b":"Eat a dick,you stupid bitch.I do have personal pictures on my page that's how much you know.","commenter_a":"And you, @username, are an asshole, and so fugly you don't have the balls to post a real pic.","post_message":"Michelle Obama is simply the best First Lady ever."},{"comment_id":"10154330734419087","commenter_b":"Shes a half wit scrub striving for brownie points. Bitch needs to go home and make a peanut butter sandwich and shut the fuck up, we ain't got her candy.","commenter_a":"@username not enough money or incentive","post_message":"#BREAKING: The Green Party is dropping the case spearheaded by Jill Stein to request a recount of the election results in Pennsylvania, citing an inability to pay a $1 million bond required by the court."},{"comment_id":"573047149521906","commenter_b":"God bless White people","commenter_a":"Wow if any of us \"peasants\" had our name attached to an on-going FBI investigation we wouldn't be able to get a job at Seven-eleven. Must be nice being that rich and connected","post_message":"\"This is an active and ongoing investigation.\""}]
