[{"comment_id":"1387674034582344","commenter_b":"@username if i had a girlfriend i probably would not watch porn, but women are picky and i am nothing special.","commenter_a":"BAN PORNOGRAPHY...simple. It is a debauched and at times cruel form of sex and at the moment is fully open to those low-lives whose brain thinks it's fully acceptable to either engage in such ridiculous practices or expect their partners to or inflict it on others. Of course this terrible crime on this poor girl was inflicted by a deviant but the role of watching pornography put fuel to the fire...BAN IT!!!!!!","post_message":"The man who held Elizabeth Smart captive when she was a teenager regularly looked at pornography, which \"just led to him raping me more,\" the now 28-year-old woman says in a new video."},{"comment_id":"10153804113241770","commenter_b":"Wasn't it Hillary yesterday stating that she has always been in favor of strong vetting of refugees? Obviously she sees which way the wind is blowing on that issue, so she's trying to get onboard. Wish she and Obama had been in favor of that when they started letting this evil, diseased crap into the country by the tens of thousands.","commenter_a":"I've always been amused at the people who say you shouldn't profile. But EVERYONE does it on a daily basis. That's a bit of reality for you... Yes to profiling, more stop and frisk.","post_message":"Republican presidential nominee Donald Trump called for profiling techniques to combat U.S. domestic terrorism threats during an appearance on Fox News Monday."},{"comment_id":"924961764238223","commenter_b":"Some companies are specifically recruiting unskilled migrants because they know they can get away with paying them next to nothing! Also these entrepreneurs you speak of often pay such little to their employees so they can get rich themselves!","commenter_a":"70% tax from working people to pay while we have so many lazy unemployed sitting at home seems fair","post_message":"She says injustice and inequality makes her \"as angry as the Hulk\"..."},{"comment_id":"10153902888094726","commenter_b":"Shut up you dopey ass bitch.","commenter_a":"Palin has lost her class. She is foolish supporting Trump and a lady doesn't swear!!! She must think he will choose her for V.P. Not a good idea for Trump!!!","post_message":"WATCH: Sarah Palin: Donald Trump Will Kick ISIS Ass"},{"comment_id":"10154186189827894","commenter_b":"What a bitch","commenter_a":"Real petty","post_message":"Ouch! Sheree Whitfield Responds to Kenya Moore's Chateau Shade: 'My Mother Loves Me' [Video]"},{"comment_id":"10152669093692434","commenter_b":"This girl is always bipping off about something, anything to get attention to her has been ass. All she ever was a girl in the movie and shitty tv show Clueless. She wasn't even the main character. She needs to sit her ass down and take 100 seats.","commenter_a":"She has ruined Clueless for me.","post_message":"“I’m not saying I’m a victim. I’m pissed off. I don’t wanna be a victim.” Stacey Dash is entirely owned by Meredith Viera in an incredibly awkward debate about the wage gap on The Meredith Vieira Show"},{"comment_id":"10153201111658984","commenter_b":"DEPORT ALL OF THEM !!","commenter_a":"And the sad part is that I have no faith this error will ever be fixed.","post_message":"This is just astonishing. I think this revelation will make a lot of people very uneasy..."}]
