[{"comment_id":"1301249303268148","commenter_b":"It wasnt done right then and thats on the doctor, not the procedure, I have spinal epidurals three ot four times a year with no problems.","commenter_a":"Scare mongering!","post_message":"I said 'Yes' to an epidural to ease agony of childbirth ... it left me PARALYSED"},{"comment_id":"981141605287036","commenter_b":"She belongs in a freak show. Why do people do that to their self.","commenter_a":"How disgusting I wouldn't hire you","post_message":"Americas Freedom Fighters"},{"comment_id":"980300718729649","commenter_b":"The 2 trillion plus mentioned was already taxed in the countries their products were sold into! Why is it that our government is the only nation that promotes the idea of US companies paying taxes on products they never sold here? That is pure greed and BS! If our government was really interested in repatriation of those funds they would create a tax environment that encouraged companies to keep their plants and wealth here!","commenter_a":"and the moron we have now is no better and the douch bag is not the answer either","post_message":"We have much bigger problems to worry about. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1015168871918572","commenter_b":"Build the wall","commenter_a":"Bring it on, freight train.","post_message":"RT U.S. Imam “Muslims Have The RIGHT To Take The Property Of FILTHY Christians And Jews” @webpagelink"},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."},{"comment_id":"962171047226860","commenter_b":"She's a loser. She should stay with a loser.","commenter_a":"Well it's about time! Now she and Hillary can be together.","post_message":"Breaking: Huma Abedin announces she's separating from Anthony Weiner one day after husband's new sexts emerge."},{"comment_id":"1584230838542469","commenter_b":"DEPORT the illegal bitch.","commenter_a":"WTF!?","post_message":"In Obama's America, obeying the law and playing by the rules is for suckers."}]
