[{"comment_id":"388626891261906","commenter_b":"Rick have the nerve and turn them in!","commenter_a":"should politicians?","post_message":"This could be bad news for some people on food stamps."},{"comment_id":"10154449540370586","commenter_b":"That's bull learn something we do think for ourselves besides the president of the church knows she is evil educate yourself instead of spreading lies. Most Mormons are voting Trump or another candidate","commenter_a":"Most of the truly faithful Mormons will just vote for whoever church leaders tell them to, just like good little sheep... Both candidates should be in private talks with the church","post_message":"Democratic nominee Hillary Clinton’s campaign has launched “Mormons for Hillary” in an effort to woo people in red-state Utah to vote for her. Is it working?"},{"comment_id":"10153526082496323","commenter_b":"NASA erased 'accidently' the high resolution tapes from the 1st moon landing in the 80's .lol .","commenter_a":"They never went to the moon though","post_message":"Even astronaut Buzz Aldrin had to file travel expenses – for a less than astronomical $33.31."},{"comment_id":"1259514897430388","commenter_b":"I hope the other women in jail rip her to shreds BARE HANDED","commenter_a":"They outta stab her and rip her cords out without painkillers so she cant have any more kids","post_message":"JUST IN: Buckeye mother Andrea Portillo is accused of stabbing her 5-month-old infant to death. MORE: @webpagelink"},{"comment_id":"10153424886503598","commenter_b":"How do you plan a family without having a man involved. What they have encouraged is the prostituition of women both in devaluing young girls and women and when they become pregnant pretending to help. But their motive all along was to take a product that costs them nothing and process it( dissect and distribute) to the highest bidder.) to be used for unimaginable purposes. This philosophy is one of the most vile known to humankind. I know a woman who was told by her father when she was a teenager if you get pregnant you nor the child will be helped by me; she would be disowned. This man was a leader in his church but he had absolutely no Love from Christ in his heart. That is not Father God 'a kind of love. That is the kind of hard hearted ness that allowed these baby slaughterhouses to ...","commenter_a":"Amen","post_message":"After 27 Years of Killing Babies in Abortions, Abortion Clinic in Virginia Shuts Down for Good"},{"comment_id":"1220911264593201","commenter_b":"@username who is illegal stupid!!!","commenter_a":"FINAL, now THAT is something to celebrate because: #BarackObama is a sociopathic liar, a national disgrace, an enemy of the Constitution, racially divisive, a promoter of black genocide by abortion, denies the threat of radical Islam and then supports that threat, a communist sympathizer and a traitor to civilization. That is his legacy.","post_message":"SATURDAY: Watch President Obama's final White House Correspondents' Dinner - LIVE on C-SPAN (TV) and here on C-SPAN's Facebook page. More here: @webpagelink"},{"comment_id":"1034820419922610","commenter_b":"Fuck her","commenter_a":"Oh please she has an easy life it's the soldiers and other people have it hard and uncomfortable not her","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"}]
