[{"comment_id":"823822871141623","commenter_b":"Every intelligent person knows about Hillary what she is. LONG TIME AGO SHE HAVE lost people trust","commenter_a":"YES, I SURE DO!!","post_message":"Once considered for Hillary's VP, this Navy Admiral wants nothing to do with her. Hillary is a criminal and belongs in jail. Do you support this Admiral's act of defiance?"},{"comment_id":"1063488917004194","commenter_b":"Lysha Ewing u r a very bitter woman.","commenter_a":"Stupid cops. To think if it were a black baby they would have walked by","post_message":"Police officers smash window to find fake baby."},{"comment_id":"543331865850763","commenter_b":"WANTS TO KEEP AMERICANS STAGNANT, MOVING BACKWARDS AND PAY HIGHER TAXES TO SUPPORT IMMIGRANTS COMING OVER OUR BORDERS FROM ISIS COUNTRIES TO PUT AMERICANS IN GREAT DANGER, WANTS TO KEEP MINORITIES IN DEMOCRATIC OPPRESSION, POVERTY, JAIL, AND HIGH CRIME, NO FUTURE, WELL WHY NOT VOTE FOR HILARY CLINTON.","commenter_a":"Says the oh so honest Christian man who dumped his wife (who was fighting for her life with cancer in the hospital) for his bimbo secretary after he dumped the first wife because she wasn't pretty enough to be married to a great man like him.","post_message":"\"Donald J. Trump's going to win, because in the end the country's not going to reward big banks and big unions and big bureaucracies and big donors and big corruption by voting for a big liar.\" –Newt Gingrich"},{"comment_id":"1792810264314039","commenter_b":"Encoded in every religion is the belief of the family unit,man and women create children and society moves on. The radical notion that homosexuals can reproduce and create this dynamic is laughable and should not be lauded as some great thing for society. Man and women really do have different roles in society and its quite apparent no matter how society wants to change it. Secondly, racism is flat out wrong but we are doing a damn good job for a country so young with diverse groups of people.Religious freedom made this country and most of its core tenets come from the Christian bible and not the quran or any other text. Churches should be taxed if they become political and held to task on their beliefs in the marketplace. The past 8yrs tried to change America but Americans bit back and won.I am not talking political just basic morality ...","commenter_a":"Let's get rid of tax free status for churches.","post_message":"What a great idea. Let's end the separation of church and state. Let's convert religious organizations into political organizations. Let's funnel dark money funds raised by religious organizations into political campaigns. Let's sanction racism, sexism, homophobia and other forms of discrimination under the guise of \"religious freedom.\" This absurd and unconstitutional idea must not be passed by Congress."},{"comment_id":"10154371662414117","commenter_b":"This will make it easier to build a wall. Then Mexico can invade and get back it's land.","commenter_a":"God I hate my damn State.","post_message":"The people who are pointing to CalExit as a possibility have little grasp of either the demographics of the state, nor its actual finances. It is oblivious to the fact that the non-coastal parts of California are similar to the non-coastal parts of the rest of the United States. It is oblivious to the reality that the state's financial crisis is due to overspending within California and not because they're sending money to D.C."},{"comment_id":"947825155333866","commenter_b":"..i got 99 problems but a bitch ain't one","commenter_a":"Wax off wax on Daniel son !!!!","post_message":"This can't be real"},{"comment_id":"10153476790357490","commenter_b":"Rachelle that the way it was in the day...just saying...thank you for being a stupid bitch!!","commenter_a":"Oh Lord...way back in my day they got an Admin or Medical discharge...if the Navy wanted you to have a baby they would have issued you one with your seabag...","post_message":"MATERNITY LEAVE BOOST, ICYMI – Female sailors to get up to 18 weeks in the year after their baby is born:"}]
