[{"comment_id":"1809165166033201","commenter_b":"You want healthcare get a job why should we pay for others","commenter_a":"You just say it and think it us true???? Lies!!!","post_message":"President Barack Obama holds news conference at The White House ahead of overseas trip. @webpagelink"},{"comment_id":"685743394925463","commenter_b":"Someone just lock her up! Please!","commenter_a":"Hillary needs life","post_message":"The double standard..."},{"comment_id":"10153653685189099","commenter_b":"Go burn your bra somewhere else please","commenter_a":"If she got things done Monica wouldn't have had to step in.","post_message":"Asked whether she's progressive or moderate, Hillary Clinton described herself as a \"progressive\" with \"a long history of getting things done\" @webpagelink #DemDebate"},{"comment_id":"711006379048137","commenter_b":"THERE IS SOMETHING WRONG WITH THIS BRAINLESS MORON...CAN NOT LISTEN TO HER HAVE TO CHANGE THE CHANNELL.....I WISH THEY WOULD NOT PUT HER ON...DISAPOINTED CNN.","commenter_a":"I just cannot listen to her!!","post_message":"No, Donald Trump would NEVER try to draw attention to himself. /smh/ --Andrew"},{"comment_id":"10154092020795950","commenter_b":"Understood but will be a taxpayer nightmare of added security details. I am sure there are comparable private schools in DC.","commenter_a":"Can you imagine if any other President did this? In addition to taking his grown CIVILIAN kids to meetings with foreign leaders. And people are actually defending this...lol","post_message":"America could soon have a long distance FLOTUS."},{"comment_id":"10154028349033812","commenter_b":"@username because I CAN and honestly sick of hearing about that dn women people KILL THERE SELF everyday she's no damn different","commenter_a":"I always knew something was wrong with the story could not understand why","post_message":"Texas trooper who arrested Sandra Bland surrendered to police after being charged with perjury."},{"comment_id":"10154456330994445","commenter_b":"I'm a female! Hilary needs to stay home and crochet something ya crazy hag","commenter_a":"I notice most of the haters of Hillary are men, you must have Momma issues!","post_message":"President Obama made the case for Hillary Clinton, saying there there's no other person more qualified for the most powerful office in the world. @webpagelink"}]
