[{"comment_id":"560286244096415","commenter_b":"Conversion to Christianity. Messing with the Germans so the tribes demolished Rome. (Where we get the word vandalism from... The Vandal tribe.","commenter_a":"Hmmm how did greece burn this year...","post_message":"Does this seem familiar to you?"},{"comment_id":"10154199913475530","commenter_b":"You told me about them n we used to look for my Riverland park","commenter_a":"@username Remember us searching for these when we were kids?! Lol","post_message":"Get outside and train your eyes onto the forest floor. Morel season is on in Michigan."},{"comment_id":"1055064891200649","commenter_b":"Time to take them away before she kills them and why you are at it tie her tubes! Not smart enough to have children!","commenter_a":"Well try her in there for five minutes w/0 her iPhone, mirror and other items you know she thinks are indispensable....don't forget, no designer water, either!!!","post_message":"A Virginia mother left her two children unattended in a hot car, with windows rolled up as she turned herself in for leaving one of the children unattended in a hot car while she went shopping last month."},{"comment_id":"10155045059411037","commenter_b":"NO!!!!!!!!!!!!!","commenter_a":"O come on!! Not her too!!!!","post_message":"Carrie Fisher died Tuesday, and Debbie has been distraught since Carrie's emergency on Friday."},{"comment_id":"10153842177281636","commenter_b":"In other news, unelectable man set to win another election.","commenter_a":"hahahahaha where are the haters now? suckers!","post_message":"BREAKING"},{"comment_id":"905233582940760","commenter_b":"So they can rape your children","commenter_a":"No way","post_message":"Obama Admin Proposes Plan for Americans to \"Adopt\" and \"Sponsor\" Muslim Immigration into the US @webpagelink"},{"comment_id":"10153831851540695","commenter_b":"There are meds for your issues.","commenter_a":"They got to make Room for these Muslims... We Americans get kicked aside or a Boot in the rear.... Getting More Crazy by the day... America has been Captured by the Islamic Nation... Muslims are taking over... Life is about to change in America... to the Worse........","post_message":"Dozens of residents are homeless after being given 60 days to leave. The city says it plans to build high-rise apartments on the land."}]
