[{"comment_id":"10153855979179099","commenter_b":"The wife is the boss in every house hold, where have you been? #Happywifehappylife","commenter_a":"Hope those who do never get another nomination!! Btw Will, grow a set. We can see who's the boss in your house!","post_message":"Will Smith will join wife Jada Pinkett Smith in not attending the Oscars this year. @webpagelink"},{"comment_id":"10153316472741336","commenter_b":"Hell no she shouldn't lose her job, she should of took another pic with her legs wide open !!!","commenter_a":"@username I agree!!","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10153081460312235","commenter_b":"All depends on version and translation","commenter_a":"Guess they didn't make it on the ark ;)","post_message":"If they are in the Bible, they have to be for real. End of story."},{"comment_id":"10153246663015950","commenter_b":"Only in America . Keep the girl scouts all girls and leave the boys alone . If the girls want to do the same stuff as the boys do then create your own stuff for girls only .","commenter_a":"Boy Scouts are so much more organized with better opportunities, I don't blame them one bit! As an adult involved in both, I'd much prefer to be a Boy Scout! Girl Scouts of America need to get their crap together.","post_message":"A group of girls decided they were more interested in what the boys were doing. So, they quit Girl Scouts and started participating in activities alongside a local Boy Scout troop. Now they're fighting to prove they can do the same things boys can."},{"comment_id":"10154182818316943","commenter_b":"WE ALL KNOW WHAT SHE DID WITH THEM!!! TRAITOR","commenter_a":"Breaking Leaders who are above the Law. Oh but what Hillary did isn't wrong... Give us a break. Amazing when American Citizens even a Police Officer was arrested & charged for helping the enemy. But she can do it and not held accountable... Since when did Leaders come under a double standard system. Even other's say for one to commit treason not held accountable. Law & Order a Justice System that's fair & honest...","post_message":"Among the 14,900 federal documents Hillary Clinton is said to have failed to turn over to the State Department in 2014 are some related to the Benghazi attacks, according to Judicial Watch. - via The Daily Caller"},{"comment_id":"1082992428420186","commenter_b":"She will never be in jail","commenter_a":"How can she send people to jail from her prison cell?","post_message":"Dangerous person!"},{"comment_id":"1299289040084712","commenter_b":"It was an independent anti-Trump, Political Action Committee. The chair said she doesn't support Ted Cruz. She is only anti-Trump.","commenter_a":"they attacked Melania first and Trump has as much right as Cruz does to protect his wife. If they don't want to get attacked don't attack him !!","post_message":"Nailed it, Senator."}]
