[{"comment_id":"10154530300669087","commenter_b":"I'm guessing the attorneys general in question are more aware of the law than you, random Facebook commenter.","commenter_a":"The Inadmissible Aliens Act Section 8 - 1182 allows the President to ban any group or nationality from getting Visas. The Law is Legal and on the books since 1952 and used by President Jimmy Carter to ban Iranians in 1979 and Obama in 2011.","post_message":"Virginia’s attorney general has joined other state attorneys general around the country in filing a lawsuit against President Trump over his immigration ban."},{"comment_id":"1761239377456582","commenter_b":"Why won't she just tell the story on camera instead of wasting all that paper? And why were they recording this in the bathroom? And why were two grown women laughing and taking pictures of her in the store? And why the hell didn't her mom beat the living hell out of them? So many damn questions. Wtf..","commenter_a":"People are getting DNA and hormones mixed up as if they are the same or even similar.","post_message":"Transgender teen shares powerful message on bullying: \"We're not a threat. We are just like any other kids. We only want people to accept and love us for who we are.\" @webpagelink"},{"comment_id":"936532806442972","commenter_b":"Is that a bad thing?","commenter_a":"Oh, please. He will become the biggest clown in the clown car.","post_message":"Donald Trump knows what he’s doing in 2016 ..."},{"comment_id":"10153566690418812","commenter_b":"Get those horny chicks out of there.","commenter_a":"This is a good reason why you don't have them in there or serving in combat.","post_message":"One former female corrections officer is providing an insider perspective on forbidden love behind bars: @webpagelink"},{"comment_id":"10154147730689071","commenter_b":"Lol you need help lady","commenter_a":"Good job trump. Keep up the good work. We need to be making more friends. Even if the liberals wanted to go to war with Russia led by Hillary. It's time for a new chapter in diplomacy.","post_message":"\"To be honest with you, the waters here seem like a little bit of a tempest in a teapot. I mean, it's striking to me that President Obama would reach out to a murdering dictator in Cuba and be hailed as a hero...\""},{"comment_id":"1877280792500982","commenter_b":"Hes an alien!!","commenter_a":"Can't hear clearly","post_message":"Paul Ryan is speaking."},{"comment_id":"850014095139630","commenter_b":"Those illegals and Refugees are everywhere,and plenty of them,obama has been busy letting them in the last 8 hills,hillary killed off soldiers[American] and wanted muslims in,guess she wanted to kill babies that was full term so they would not grow up for the usa,,what a mess,in the usa,why don;t they stop all of this junk? This is America?","commenter_a":"So I have posted this many times.... How many of our citizens have to die or be injured before these Far Left Dems understand and see the light! These illegals and Refugees are not good people......","post_message":"John Kasich opened up Ohio's borders to refugees and himself to a tidal wave of Twitter hate..."}]
