[{"comment_id":"542586789241125","commenter_b":"Get off drugs!!! Our economy would crush!!","commenter_a":"Trump is not dropping out you idiots. The best you can hope for is Trump/Carson ticket.","post_message":""},{"comment_id":"834927826574487","commenter_b":"She's a waste of air & space.","commenter_a":"Someone said \"Free stuff\"?","post_message":"You know Queen of the 'Aisle Hogs' Sheila Jackson Lee @JacksonLeeTX18 will be there 10 hours early for her SOTU seat"},{"comment_id":"10153246280989411","commenter_b":"Why there is nobody helping Palestine. Come on Russia or China. Could you plz give Palestine nukes. Let those two countries to finally start playing a little more realistic games.","commenter_a":"So they are trying to destroy them............fuckers...","post_message":"'Israel cannot maintain military control of another people indefinitely.'"},{"comment_id":"10152910753726336","commenter_b":"Reality check!!!!","commenter_a":"REALLY! If you believe this I have beachfront propoerty to sell you in Arizona, can you say \"stupid Americans\"!","post_message":"Do you agree? #SOTU LIVE coverage: @webpagelink"},{"comment_id":"918671201578514","commenter_b":"Death should be her punishment.if not Deport her rotten ass . We don't want her here.evil.","commenter_a":"Behead the Bitch...","post_message":"Muslim Nanny Who Beheaded 4 Year Old Girl Will Not Face Murder Trial Because... This is the world we are living in today people. What do you think her punishment should be?"},{"comment_id":"472562882934292","commenter_b":"She's a want to be Queen A Big Not she's not the first ya got it .","commenter_a":"that woman definitely needs therapy posing as a queen lol dream on woman","post_message":"Michelle tried to do something absurd, but USPS shut her down. Awesome, it's about time someone told her 'no'. Do you support the post office's stand against Michelle?"},{"comment_id":"10153359522561051","commenter_b":"I'd be waiting every day to catch those bitches.","commenter_a":"I hope she caught her in the parking lot.","post_message":"When this woman's 2-year-old son came home with these marks on his leg, she marched down to his school and demanded to see the surveillance footage. Now she's even more outraged."}]
