[{"comment_id":"817971878238235","commenter_b":"WTF. Is she even more stupid then I thought.","commenter_a":"She is so stupid!!Does she have that kind of power or does that have to have congregational approvevl?","post_message":"Big news! What do you think about this?"},{"comment_id":"10154429240061955","commenter_b":"@username Excellent! Praying everyone in our country reads this!!! Please!!!","commenter_a":"I simply cannot understand how BLIND and Ignorant one can be to support Hillary... She is a Career Criminal with blood on her hands! How can people NOT see this? Just do some BASIC research on her. You will be shocked at the amount of evidence against her!","post_message":"'Fact-checking' becomes opinion journalism..."},{"comment_id":"10153704706699170","commenter_b":"She got robbed! She should be #missamerica!","commenter_a":"Well, if their question was addressing 'gun related accidents', she was right on point. However, that was not their aim ( no pun intended) - their 'aim' is to ban weapons period. Their question does not address any of the mitigating circumstances that surround each of the recent incidences of gun violence and they know it. You can see it in the eyes and expressions of the questionners once Miss S.C. gave her answer.","post_message":"Wow. I don't think ANYONE was expecting this... Do you agree with Miss South Carolina's answer?"},{"comment_id":"10153742878600575","commenter_b":"Deport them","commenter_a":"Aren't we all supposed to be brainwashed by the communist media maggots that this is the \"peaceful religion\" ?","post_message":"Muslims blew up city Christmas tree."},{"comment_id":"10153443298156051","commenter_b":"Go to hell","commenter_a":"She a moron. You hate kids then don't work at a day care idiot.","post_message":"A few hours before she began her new job, this mom posted something on her Facebook account. Before she could even get to work, her employers called her and told her not to come in. Decide for yourselves whether she should've been fired."},{"comment_id":"10153227343366770","commenter_b":"Oh them dumb white people they so racist! Sarc","commenter_a":"She looked so stupid. She clearly made a dumb open statement that wasn't true. Obama told her...it didn't stop her from getting a gun. Brain washed White people. You White Republicans vowed a sworn oath to not give anything to Obama before he took office. A sworn oath. Racist haters. A sworn oath. So don't blame the Black guy You hated and conspired before he took office to hate him. Now you act like you don't understand why he used Executive Orders. Dumb racist White supremist. Shes a NRA crash dummy. Wow....Whites really got no common Sense. Natural born Black haters. Trying to make her a hero...SHE SAID NOTHING NUT GOT SHUT DOWN BY OBAMA FOR QUOTING WHITE MEN AROUND HER. LOL. OBAMA GOT THE LAST WORD.","post_message":"Taya Kyle, the widowed wife of Navy SEAL Chris Kyle confronted Barack Obama Thursday at a CNN town hall event on guns Thursday night."},{"comment_id":"1212697888750239","commenter_b":"It's funny how the liberal low information voters want to take guns away from law abiding citizens, as if that will solve anything, yet they don't want to deport the illegal felons and criminals, or prevent them from being able to get guns in the first place; and you don't want to prevent a terrorist organisation that supports ISIS from getting ICBM nukes. Brazil has the world's most strict gun laws, yet people die almost every minute of the day due to gun violence there. You know why? BECAUSE CRIMINALS DON'T OBEY LAWS! That Oregon campus was a gun free zone in an area where open carry is legal. No one would have the guts to go on a shooting spree anywhere but in a gun free zone. Anytime there is a tragedy like thus, the Democrat solution is always more government tyranny. Europe has the same population size as ...","commenter_a":"So I'm sure someone on Facebook will say it's all his fault. Yeah right.","post_message":"A shooting at a school in Oregon is just the latest massacre that President Obama has had to respond to. Read full story: @webpagelink"}]
