[{"comment_id":"10153562067157377","commenter_b":"@username She seems just as evil as Cecile Richards.","commenter_a":"The judge should have had Daleiden executed ,so the people in the clinic could sleep at night.","post_message":"\"This is a huge win for the pro-life movement,\" said Jared Woodfill, an attorney for Daleiden. \"The court recognized that the charges brought by the Harris County District Attorney's Office were flawed from their inception.\""},{"comment_id":"837370303025890","commenter_b":"Your just another Dumb Female","commenter_a":"Slick willy fits him better","post_message":"Just call him Adam."},{"comment_id":"881610245305235","commenter_b":"She is skanky.","commenter_a":"Megyn Kelly is a waste of human potential. A bright and flashy exterior but of little inner substance.","post_message":""},{"comment_id":"1149506871736008","commenter_b":"You're welcome.","commenter_a":"What an embarrassment this guy is. Shameful. smh....","post_message":"President Obama took a jab at the so-called \"birther\" movement on Saturday night while in Kenya, his father's homeland."},{"comment_id":"10154731956548797","commenter_b":"@username - Canadian!","commenter_a":"What the hell is wrong with this city? What is the death toll so far for this month?","post_message":"FATAL STABBING ON RED LINE: CTA Red Line trains are suspended between 35th and Garfield after a woman was stabbed to death on a train Thursday afternoon."},{"comment_id":"10153482590876509","commenter_b":"Yes. GTFO IF YOU DINT SUPPORT ISREAL SND THE USA","commenter_a":"Try again @username..... We still stand behind Israel!","post_message":"Two days after his victory at the polls, Israeli Prime Minister Benjamin Netanyahu has already walked back his disavowal of a two-state solution with Palestinian statehood. @webpagelink"},{"comment_id":"1797648893800416","commenter_b":"Women's bathrooms have in closed stalls get over it.","commenter_a":"I don't do business with Target anyway","post_message":"In the wake of Target's decision to allow men in women's restrooms and changing rooms, the hashtag #BoycottTarget has exploded across social media and trended as high as #1 on U.S. Facebook..."}]
