[{"comment_id":"1368996799860037","commenter_b":"She's an ugly see hag and formerly a man.","commenter_a":"Kellyann is wearing some weird kind of uplift bra in this picture.Her tits actually hand down and get crushed between her thighs. She tires to hide them and never goes to the beach because they are full of zits and varicose veins.","post_message":"LOL"},{"comment_id":"10153812349369170","commenter_b":"\"Hope\" is the refuge of somebody who has nothing substantive upon which to base what he wants to believe.","commenter_a":"Why do Christians continue to believe that they and their beliefs are entitled to special treatment?","post_message":"A group of angry atheists waged war on this town because of a touching veterans memorial. When the townspeople got wind of what was going on, they hit the atheists back HARD. This is awesome!"},{"comment_id":"10152947380749099","commenter_b":"Yes, because women never get pregnant on birth control....","commenter_a":"If women would practice birth control then these horrible things wouldn't happen. Bless their little souls. May God have them in his embrace.","post_message":"A man found two dead fetuses wrapped in a blanket on the street @webpagelink"},{"comment_id":"10153513530884456","commenter_b":"Yeah right. @webpagelink","commenter_a":"I have learned through the years that you initially say what is in your heart. Her statement trying to brush away her post is BS and everyone including herself knows that. Her feelings will not change, she will simply do a better job of hiding them. The commission and the public should call for her resignation.","post_message":"An elected Montgomery County official has released a statement following a controversial post on Facebook, which has sparked outrage among Montgomery County leaders and citizens. @webpagelink"},{"comment_id":"10155602222490354","commenter_b":"I would let my daughter be a part of this group, it has been infiltrated by radical lesbian feminist. Children are not safe with them!!!","commenter_a":"Is this a great country or what?","post_message":"It's not clear how this will affect cookie sales...."},{"comment_id":"1292616690749798","commenter_b":"I need to learn how to do that. You never know when you need to live stream.","commenter_a":"This was one smart woman! Her cool during this was amazing. Streaming it to FB was really smart. If the cops took her phone the record was still there. I hope others follow her example.","post_message":"The aftermath was streamed live on Facebook for the world to see."},{"comment_id":"1055356871225809","commenter_b":"Trump is clearly a tyrant.","commenter_a":"Go, @username! This man will bring down the Republic! He's a barbarian baying at the gates of our Rome. He wants to change the legal system our forefathers died for, deny us freedom of the press and access to unbiased information, encourages racism and discourages free exercise of religion. This will not end well.","post_message":"\"The Post will continue to cover Donald Trump as it has all along-- honorably, honestly, accurately, energetically and unflinchingly,\" Executive Editor Marty Baron said in response."}]
