[{"comment_id":"10153286169819705","commenter_b":"No, they aren't talking about Snow.","commenter_a":"Thanks for the spoiler","post_message":"For once, Game of Thrones didn't kill off a character when it looked like it was going to."},{"comment_id":"1781827275423105","commenter_b":"Go Hillary! You're a rock star!","commenter_a":"Boom!! Mic drop!!","post_message":"EXACTLY! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154151850958271","commenter_b":"Hilary voted for it! So she must have to go to jail. Or does it only work one way?","commenter_a":"Can we focus on how she forgot about our soldiers in Benghazi!","post_message":"We are live discussing tonight's debate. Send your questions!"},{"comment_id":"969471999775996","commenter_b":"You're stupid lady","commenter_a":"yes! Possessing a gun doesn't make you American. Leaving your pride behind for the safety of others does. European countries are proof gun control is effective.","post_message":"Heartbroken and angry. We must act to stop gun violence, and we cannot wait any longer. Praying for the victims' families in Virginia. -H"},{"comment_id":"10154496628933132","commenter_b":"@username she didn't say anything to the girls. She simply gave them a card. If my daughters were acting like spoiled brats I would not mind if someone put them in their place!","commenter_a":"Sorry Helicopter Mom, if I were those girls parents I'd jump down your throat for trying to police the thoughts and opinions of this group of girls, from what it sounds like to me it was the equivalent of a negative review among peers, I for one applaud the young ladies for exercising their First Amendment rights of free speech and I place the mother in question for violating those young ladies personal and intellectual autonomy","post_message":"The author and parenting expert shared the importance of being beautiful both inside and out."},{"comment_id":"1713613852259060","commenter_b":"a matched pair of idiots","commenter_a":"Ain't that the truth!","post_message":"Are you... KIDDING ME!? So sick of Barack Obama & Michelle Obama..."},{"comment_id":"1083559065045639","commenter_b":"She would have to pay me to go listen to her garbage.","commenter_a":"Are you listening Mom and Dad?","post_message":"What an incredible waste of both time and money. Blow it on beer, or burn it for warmth. Both better ways to spend your cash. Y'know, since college kids always have an extra three grand lying around."}]
