[{"comment_id":"917384355021286","commenter_b":"I would love to see Trump/Carson..... Trump because you can't push him around. carson because the man is just smart!","commenter_a":"How does a troll like Trump make America great. When he can't run a business without filing for bankruptcy. You get no I screwed it up and need a do over in politics. Just ask GW Bush. Anyone hear Trumps policy other than he's going to be great. I I don't think so. Let's call him the carnival barker and clown show that he is. And his supporters if you don't like government than don't participate. A vote for a angry clueless egotistical clown won't help America.","post_message":"Republican 2016 frontrunner Donald Trump is a stain on our country. Image by Occupy Democrats."},{"comment_id":"10153607526077452","commenter_b":"What a good citizen! Love this.. Especially with the morons out there who have killed sea life by trying to get a good selfie!","commenter_a":"Hope he finds his mommy 😟","post_message":"A tour guide rescued a young dolphin stranded on a beach. @webpagelink His heroic effort ensured that the dolphin was able to swim another day."},{"comment_id":"10153771650684415","commenter_b":"Wake up!!? Fourty years of Democrats running this country..... Democraps running our country into the ground! EVERY AMERICAN CITIZEN WORKING PAYS 12% of his income to Social Security! Social Security is broke!!! People who have never paid a dime in ..are drawing on it, but they are going to reduce the benefits of those who PAID IN!!! Hmmm.... Only democraps think like that!!! @webpagelink","commenter_a":"Congress makes laws then the Govt turns around and will not enforce them thats why we slowly are losing America to Mexico...our immigration laws are not broken the Govt that will not enforce them is","post_message":"The First Amendment states: 'Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble …' yet despite these constitutional protections, speech-restrictive policies in our nation’s public colleges and universities remain. Today, I sent a letter to 162 public colleges and universities today asking them to update their free speech codes."},{"comment_id":"10154057964035448","commenter_b":"Everyone go to Shannon's blog and tell him to shut the hell up","commenter_a":"Shannon Sharp is one big disappointment. What an ignorant clown he turned out to be. Hasn't a clue...just a great big mouth!!","post_message":"The Left will never learn..."},{"comment_id":"10154473881370329","commenter_b":"Ivan Roy Rasmussen YESS!!!!! Hahahahaha","commenter_a":"Katie KocajSierra Weiner squid ward tortellini","post_message":"\"Am I a pretty girl?\" // SpongeBob SquarePants"},{"comment_id":"10154407674347756","commenter_b":"Muzzie lover go eat crap","commenter_a":"key word temporary oh maybe we republicans should go burn a few cities down now too and a few police cars right! Hmnnn oh thats right we like law and order imagine that.. Good things take time go TRUMP go we have your back...","post_message":"A Federal Appeals court Thursday evening ruled against the Trump Administration’s controversial transportation order, upholding a district court judge’s ruling to block the order."},{"comment_id":"10152844711636167","commenter_b":"Some say brave, real people say KKKOCKSUCKINGWHORE","commenter_a":"What's \" brave\" about cutting seniors earned benefits??","post_message":"Except his plan would be \"terrible\" for the poor and middle class..."}]
