[{"comment_id":"10152936625961491","commenter_b":"She's as brainwashed as the rest of that family. Very sad.","commenter_a":"Why did his wife marry him? WHY????","post_message":"\"What was Duggar’s political value for Family Research Council, his moral example, has now become a cost.\""},{"comment_id":"10153080591266748","commenter_b":"He's a fucking queen.","commenter_a":"Better headline: Tom DeLay urges a complete breakdown in the judicial/governmental structure. Because 'murica.","post_message":"Former GOP House majority leader Tom DeLay urges anti-gay conservatives to stand up to the \"ten\" Supreme Court justices."},{"comment_id":"10154324283638854","commenter_b":"Like they say it for the first time !!! they say it all the time it is their law and authorities are to blame ! There is no way of knowing which Muslim will want to become a martyr by killing who ever their god tells them to kill !!! this religion must be totally banned in a Christian Country !!!","commenter_a":"The Gay community needs to vote for Donald Trump. If you vote for Hillary you can expect more of these infiltrator brought into this country unvetted.","post_message":"VIDEO: Speaker at Orlando Mosque Says Gays Must Die. SPREAD THIS EVERYWHERE!"},{"comment_id":"10156257885050389","commenter_b":"What the hell are they waiting for?? Indict her already !!!","commenter_a":"she sure is aging fast","post_message":""},{"comment_id":"10154167582371770","commenter_b":"LMAO they are their own worst enemy","commenter_a":"Sweet, we probably bought it as taxpayers.","post_message":"Liberals protest Trump by ... setting a Muslim immigrant's limo on fire."},{"comment_id":"10153214662726130","commenter_b":"Mmmm lies","commenter_a":"@username Sezer Yazar Karl Ervine","post_message":"This. Is. Amazing."},{"comment_id":"10153493964774060","commenter_b":"And she could have foiled the whole dastardly plot by wearing a seatbelt!","commenter_a":"it's a shame the British had her murdered...","post_message":"On this day in 1981, Lady Diana Spencer married Prince Charles. At the time, The Economist gushed \"God save the next queen\". It was not to be. Read our obituary from 1997 @webpagelink"}]
