[{"comment_id":"1729670857287408","commenter_b":"HILLARY CLINTON YOUR HONEST, LOVING, CARING CANDIDATE! @webpagelink","commenter_a":"Be patient my precious. Von Clownstick will not win the White House. Hillary will crush him come November. Then all these Dumpsters can slither back to their respective holes. Bye Drumpf.","post_message":"Donald Trump is closer than ever to clinching the GOP nomination. There's only one candidate who has more votes."},{"comment_id":"1068619743164680","commenter_b":"why 'send' them anyplace? Just teach our history & proper methods, uphold the laws of our nation, put teeth n the laws n place, cut off the welfare & they will leave....don't waste any more $ on them....well...maybe a 1-way ticket!","commenter_a":"Gutless flag burner won't show his face Cowards","post_message":"The nerve that Rudy Giuliani touched this week is not merely Obama's anti-Americanism; it is the anti-Americanism of the progressive left."},{"comment_id":"10154715866881077","commenter_b":"A real woman would provide a chicken pot pie, just saying...","commenter_a":"Kiss my what? Real women can provide their own and don't need any man. After all, I have done just fine on my own with my 2 special needs children (because their father wasn't any sort of real man: his moto provide, but beat and refuse basic needs or the right for me to work) That being said real men and woman work together to get through life together. Men nor women are above one another. This billboard only assists in the purpose of one being better than the other and undermine equality, which we have been fighting so hard for.","post_message":"What do you think about this billboard?"},{"comment_id":"10153208409382093","commenter_b":"She asleep in the kitchen ?","commenter_a":"So just because you invite someone over that person has the right to have sex with you? No means no! And even if she was too drunk to say no, if she never say yes, then it is a freaking no! I didn't know that just because you let someone in your house you're automatically saying \"you can come in my house and rape me :)\"","post_message":"The victim said she woke up to find the suspect forcing himself on her.... so she fought back with what she could find... @webpagelink"},{"comment_id":"10155148038011336","commenter_b":"Trump doesn't refute facts in any logical way. He doesn't present evidence to the contrary, just declares that anything negative about him is fake news. Does this not concern any of you?","commenter_a":"Funny how people have forgotten the numerous times Obama called @username out during speeches, press appearances, and other forums. But Trump doing the same thing is suddenly \"horrible\" and shocking...","post_message":"\"He has EVERY RIGHT to call them out.\" On \"FOX & Friends Weekend,\" Herman Cain discussed President Donald J. Trump's often contentious relationship with some in the mainstream media."},{"comment_id":"533146616873631","commenter_b":"She is a racist nigga pig","commenter_a":"Not that he's is so bad give up the race crap","post_message":"I AM SICK AND TIRED OF THIS BS..."},{"comment_id":"1371652822850169","commenter_b":"Shut the fuck up dum bytch","commenter_a":"a policemans job is hard and they have to put up with alot of verbal abuse and it takes alot of self restraint, thats y it is important for the good brave cops who really care about what they do to take pride and turn in the bad cops who do not care or are just burnt out","post_message":"This DJ just said it's time for good cops to start calling out bad cops."}]
