[{"comment_id":"10156197191420354","commenter_b":"A CULT that needs to be extinguished!","commenter_a":"Islam is NOT a religion of peace!!!!!","post_message":"The full statement is SCORCHING..."},{"comment_id":"1034345616576908","commenter_b":"Please. Many women CANNOT use those. I never could. Not everyone is the same dear.","commenter_a":"Ladies....Honestly. Get a menstrual cup. You will hate yourself for not doing it sooner.","post_message":"This should not be a thing"},{"comment_id":"10150959655894999","commenter_b":"f you want a president that - Is a dictator above the law criminal who controls the brainwashing media and FBI Starts a war with Russia, China, Syria because they're not part of NEW WORLD ORDER - Can't be trusted to protect the security of our nations borders, classified information, or lives of our ambassadors and spies - Opens door to Jihad Terrorism and rape culture while our veterans sleep in the streets - Take away your right to protect yourself with a gun from her Isis soldiers she and HUSSIEN created and brought in. - Sells your country to your enemies and gives your enemies nukes - Raise taxes and enslave us while paying our enemies billions - Steals from her charity - \"Loses\" 6 billion of your hard earned taxes money - Defends rapists and bullies the victims - Brainwashes her followers to attack \"deplorables\" and starts fights ...","commenter_a":"I hope you guys will vote for Jill...","post_message":"Our photographers are sharing Election Day scenes from Manhattan, Miami and polling sites across the country. Follow along here: instagram.com/nytimes"},{"comment_id":"1790088647891885","commenter_b":"Lois did you listen to Hillary's speech . It sounded like she didn't know democrats policies or didn't take thousands from PP and believes in term abortion . Oh she forgot thAt, 🇺🇸Trump🇺🇸","commenter_a":"Hillary calling someone corrupt? Wtf kind of drugs is she on? Her and her so called husband are the biggest, most corrupt crooks ever involved in American politics!","post_message":"Donald J. Trump: \"Hillary Clinton may be the most corrupt person ever to seek the presidency of the United States.\""},{"comment_id":"10153253514670329","commenter_b":"please shut the fuck up","commenter_a":"In what world are 12 year olds adults? The entire point of a juvenile justice system is that children are NOT adults in age nor brain development. They need mental health treatment in a correctional facility tailored to children.","post_message":"They face a count of attempted first-degree intentional homicide. (via BuzzFeed News)"},{"comment_id":"10153952900813984","commenter_b":"She should Benin jail!","commenter_a":"How many of those radical Islamic terrorist countries donated to the Hillary fund. She knows they did.","post_message":"Hillary thought she'd jump on the opportunity to steal some attention from the Republicans during the debate, but it did NOT go as planned. Critics immediately fired back and pointed out something hilarious... Is Hillary Clinton one of the last people you would ever want to become president?"},{"comment_id":"10155303364265603","commenter_b":"For exposing corruption and telling the truth...","commenter_a":"He should sue the pants off of Eric Holder.","post_message":"JUST IN: Ferguson Police Chief Tom Jackson resigns, effective March 19. Lt Col. Al Eickhoff will serve as acting chief as the City of Ferguson begins a nationwide search. We will carry the 5:30p press conference LIVE on-air and online. STORY: @webpagelink"}]
