[{"comment_id":"941727655948060","commenter_b":"the reason Trump is doing so well is that most Conservatives like me are sick of the way our country has gone down for the last 7 years..it got worse not better. Veterans treated shamefully especially the wounded in our VA hospitals. THe amount of our money that has been given to terrorist countries that hate us. And the flooding of our country with illegals who are given everything when we have many poor who could use help. Plus we do not know who or what has been coming here. Some that could be dangerous to our citizens and have been..","commenter_a":"Trump!!","post_message":"The Indiana primary may be the end -- and it's THIS WEEK. Make your voice heard by clicking the link & voting now."},{"comment_id":"549044465305156","commenter_b":"You mean illegals who want free shit? Trump 2016 Killary Corrupt and OSUCKO Shitbag for Prison 2016","commenter_a":"To all the Hispanic and women out there, we all need to VOTE!!! Our vote has to be the one that makes the difference of who will be our new President Mrs. Clinton.. lets all make sure that we the piggy, uglys fat black and hispanic show Mr. Trump that we where the ones we the power for him not to be our new President, trust me he will always remember us women.","post_message":"This is Alicia Machado, the former Miss Universe who Trump bullied and harassed, calling her an \"ugly\" \"Miss Piggy\" and \"Miss Housekeeping\" -- just because she is Latina. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"742199012637343","commenter_b":"No sharia law here. Go back where you came from.","commenter_a":"What many have said thy plan to take over the country. CAIR","post_message":"Muslims Trying To Enforce Sharia Law In America Just Got Some Very Bad News [VIDEO] If you are going to live in America, you will have to abide by our laws. Do you think Sharia Law has no place in America?"},{"comment_id":"1756054801276415","commenter_b":"Though what border did the Muslims come ?","commenter_a":"Don't mess with Texas!","post_message":"BREAKING: Texas Lt. Governor Announces That Texas Has Finally Shut Down The Border. It's about time. With or without a wall, we will protect our country. Do you think we need to close our borders to Mexico?"},{"comment_id":"10153177506232885","commenter_b":"Scumbag whore.","commenter_a":"Unwhite Bastards.","post_message":"At a complete loss for words right now! This is absolutely disgusting and an abuse of the right to free speech!"},{"comment_id":"10153730594409099","commenter_b":"Who are all these women stuffing their babies in bags?","commenter_a":"Thank god the baby was left somewhere where baby could be found alive unlike all these mothers stuffing them in bags killing them. This was a woman that loved the baby enough not to hurt it. Maybe she was afraid of something like deportation or something else. At least it was at a church not in a dumpster or alley. We don't know the circumstances or her story so lets not be aholes and judge at least someone can raise that baby who wants it.","post_message":"BABY IN A MANGER: A wailing newborn baby was found with its umbilical cord attached inside a nativity scene at a Queens church, police say ----> @webpagelink"},{"comment_id":"1007015132691568","commenter_b":"They're a success for the home invaders, they don't have to worry about getting shot now.","commenter_a":"Sadly gun crime happens so many time in the USA one wonders why they just don't legislate for firmer gun laws, but then again that will never happen...","post_message":"'America is a financially failing filth farm', he ranted"}]
