[{"comment_id":"1214784961920643","commenter_b":"all these woman marching i wish they would say samething about us senior that can not get out of the house to help fight for our medicare and social security","commenter_a":"Marching in Tucson, AZ!! Yea! Ladies!","post_message":"LIVE NOW: Women's March in D.C., just one day after Trump's inauguration. MORE MARCH INFO: @webpagelink"},{"comment_id":"10153622833731519","commenter_b":"She says what her market wants to hear. She, and all the ilk like her, are just media whores who spout filthy hate and get PAID big bucks for it.","commenter_a":"At least she didn't say that we need to keep the tradition of having only presidents on our currency.","post_message":"Greta Van Susteren nearly gave herself a rage stroke last night..."},{"comment_id":"10156296694950293","commenter_b":"If all the grandkids reproduce themselves it could happen.","commenter_a":"The will be you soon @username","post_message":"A sweet story this morning. A grandmother hangs nearly 70 stockings on her wall every Christmas. Tell us about the traditions your family has!"},{"comment_id":"10153943433408645","commenter_b":"She should go to hell for posting this picture on her profile..","commenter_a":"Maybe because she has a horrible profile picture of someone beheading a cop?!....the same photo the shooter in Dallas had on his Facebook....or maybe not....not condoning either act, just responding to the ridiculous lead in of the article...","post_message":"Lanaydra Williams told FOX 4's Megan Dillard she didn't know where Overland Park was before Thursday night, nor did she know the man who made a threatening Facebook post on a picture of her daughter. The stranger was identified as an Overland Park Police Department officer, and the department apologized to her after firing him on Friday."},{"comment_id":"1217783301639772","commenter_b":"It's new- tella. Stfu","commenter_a":"Some people say nut-ell-uh and he's right. Nutella is absolutely nut-ell-uh. New-tell-uh is wrong.","post_message":"The right way to say 12 brand names you've been mispronouncing your whole life."},{"comment_id":"10153184116079330","commenter_b":"She is just the white female version of what we already have. Time for a woman, yes, but not time one!","commenter_a":"Way to go Hillary - We need a lady in the white house and get rid of the Joker that is there now.","post_message":"Sources tell NBC News that former Secretary of State Hillary Clinton will announce her candidacy for president of the United States \"as early as Sunday.\" ---> nbcnews.to/1FHI9C6"},{"comment_id":"617513011783820","commenter_b":"Bitch stumbles all the time","commenter_a":"She's a friggen Drunk ....!","post_message":"Hillary stumbles boarding plane..."}]
