[{"comment_id":"10153128143973812","commenter_b":"Cows can't even read","commenter_a":"Japanese people have since killed 78% of all Dolphins seen in this video.","post_message":"WATCH: It seems more like a dream as you watch it, but for Alex Rivest, it was reality as he joined a large pod of dolphins off the coast of Hawaii's Big Island. This video was recorded in late December."},{"comment_id":"1384025364955130","commenter_b":"Good god what a shit show........our nations democracy is at risk..ELECTORS DO YOUR JOB AND PROTECT AMERICANS FROM THEMSELVES","commenter_a":"Oh brother....","post_message":"Conway again defending one of Trump's intolerably dangerous views."},{"comment_id":"1524668304213513","commenter_b":"The other egg isn't going to hatch","commenter_a":"did both eggs hatch","post_message":"LIVE: American bald eagles Harriet and her mate, M15, are caring for their newly-hatched eaglet! So cute! (Credit Southwest Florida Eagle Cam)"},{"comment_id":"880499385321632","commenter_b":"100% yes.","commenter_a":"Absolutely","post_message":"Do you approve of this change?"},{"comment_id":"10154134497810575","commenter_b":"I'm so sorry for your lost child. It sad and terrible we are being made to put up with these illegal criminal invaders.","commenter_a":"Hang him and the next ten people who allowed him to be here.","post_message":"NEW YORK GIRL DIES AFTER BEING HIT BY TWICE DEPORTED ILLEGAL ALIEN...."},{"comment_id":"917503514939106","commenter_b":"Shut up bitch","commenter_a":"Surely another upstanding citizen.","post_message":"BREAKING: New police body cam video reveals the disturbing moment a white cop killed Eric Harris, an unarmed black man in Tulsa, Oklahoma. #EricHarris #BlackLivesMatter"},{"comment_id":"2017999998425158","commenter_b":"No. That was Colin Powell.","commenter_a":"Actually, I'd rather see him choose someone like Condoleeza Rice!! She's a highly Intelligent, Accomplished diplomat and a true conservative.. It's my opinion that because of Her past Experience she's emmininty Qualified for the VP. Position.!!.. And could bring much needed strength and unity to Trumps campaign and the Republican party.. It would also help to put to rest the Unfounded accusations against Trump regarding women.. She's also not part of the existing establishment.","post_message":"Would you like to see him as VP?"}]
