[{"comment_id":"711989458991632","commenter_b":"So you are saying if all guns were banned from legal americans the secret service would not need any guns? You obviously are another liberal idiot. Again shit for brains, criminals don't get their weapons legally. They will still get weapons illegally & then what are they going to use against an illegal weapon, throw cans of green beans & peas at them? Throw rocks at them? Why do liberal idiots refuse to understand CRIMINALS DON'T BUY WEAPONS PER SAY AT GUN SHOPS.","commenter_a":"Let's start at the very top and ban those guns that the SService are carrying all around Obama","post_message":"President Obama is taking guns out of all forms of entertainment. This is ridiculous. He can't get away with this. Do you think he is abusing his power to push his propaganda?"},{"comment_id":"10153711983118445","commenter_b":"Better take a look in the mirror you ugly bitch.","commenter_a":"Trump is a pig","post_message":"#Pot Matters: Trump on Drugs"},{"comment_id":"10154185145943132","commenter_b":"Sue happy! These ladies are cracking me up. They have no clue.","commenter_a":"OH so this is how they make a living. Hard work paying off there. Unbelievable.","post_message":"It's always polite to ask permissionjust ask Kendall Jenner."},{"comment_id":"993063080750221","commenter_b":"Biden's coming in! you lose, Hillary.","commenter_a":"backwards is thinking that butchering a live baby in the womb is ok to do.","post_message":"In this week's Facebook Q&A, Hillary took on Jeb’s claim that Democrats use \"free stuff\" to appeal to minorities."},{"comment_id":"10156422552765354","commenter_b":"Mexcans, niggard and white hoes need a good kick in the ass.","commenter_a":"Unbelievable! ! Round their butts up and get them out!!","post_message":"The group chanted “Let them in, Abbott let them in” and “Governor Abbott shame on you.”"},{"comment_id":"10154182818316943","commenter_b":"WE ALL KNOW WHAT SHE DID WITH THEM!!! TRAITOR","commenter_a":"Breaking Leaders who are above the Law. Oh but what Hillary did isn't wrong... Give us a break. Amazing when American Citizens even a Police Officer was arrested & charged for helping the enemy. But she can do it and not held accountable... Since when did Leaders come under a double standard system. Even other's say for one to commit treason not held accountable. Law & Order a Justice System that's fair & honest...","post_message":"Among the 14,900 federal documents Hillary Clinton is said to have failed to turn over to the State Department in 2014 are some related to the Benghazi attacks, according to Judicial Watch. - via The Daily Caller"},{"comment_id":"10155016645768010","commenter_b":"Let's keep in mind the big picture here. Less illegals, the better.","commenter_a":"As we've learned from all his businesses, failures and bankruptcies...he is very good at spending other people's money.","post_message":"He wants to get Mexico to reimburse the U.S."}]
