[{"comment_id":"1554819554825337","commenter_b":"i dont have to even listen , i can tell by how stupid she looks","commenter_a":"Lunatic left.","post_message":"This is downright shameful."},{"comment_id":"962417470484668","commenter_b":"Do with all the locks broken does that mean all these people will soon divorce ?","commenter_a":"Melissa Sheree Lisa Danielle","post_message":"Love 0 Heath and safety 1"},{"comment_id":"10154191515199087","commenter_b":"If Hillary gets elected Bill will be coming to the white house with her lets not repeat history.","commenter_a":"Unfortunately it's not Bill Clinton who's running for the President but it's Hillary Clinton, and Nobody cares what Bill Clinton did.","post_message":"The former reporter came forward today for the first time to accuse Bill Clinton of groping her on multiple occasions."},{"comment_id":"1113637395343398","commenter_b":"Bye Bitch!","commenter_a":"Now that is ridiculous! Waste of time and very presumptuous woman.","post_message":"Fox News host Harris Faulkner is furious that a cute hamster toy bears the same name as her -- and she wants $5 million from the company that created it."},{"comment_id":"1237783792909359","commenter_b":"Now the Muslims are going to come here and outbread us? ....is that their big 1000 yr plan? ....lol","commenter_a":"Tell that to my neighbors in Roanoke,VA that got stabbed this weekend . The terrorist is being investigated by the FBI for terrorism....Only when the national news reported the terrorist attempted to behead not stab the man did the local liberal rag paper update their reporting.","post_message":"The United States faces many threats, but terrorism is not chief among them, according to VP Joe Biden. @webpagelink"},{"comment_id":"10154952151491509","commenter_b":"\"Guns don't kill people. People kill people.\" You think Omar would have killed as many people as he did if he only had a kitchen knife or a baseball bat?","commenter_a":"The NRA are the republicans pimp....","post_message":"\"We're talking about terrorism right now. This isn't about guns.\" Congressman Sean Duffy rebuked House Democrats, who are staging a sit-in for stricter gun control measures."},{"comment_id":"10153705260739218","commenter_b":"All Lives Mater...another life ended and another life over.","commenter_a":"Every man woman and child makes their own decisions in life...don't know the circumstances but he has to deal with the outcome..not his father...prAyers to both families","post_message":"The son of a Baltimore Police Department commander has been charged with murder, sources have confirmed to the 11 News I-Team on Tuesday >> @webpagelink"}]
