[{"comment_id":"10152562554341636","commenter_b":"Time to persecute muslims everywhere.","commenter_a":"I will never support terrorism but I also think we have to respect other people's religions...","post_message":"Ahmed Merabet had raised his hands up in surrender before being shot dead..."},{"comment_id":"515846775249931","commenter_b":"Does she know how ugly she is?","commenter_a":"Why would I care what a celebrity thinks or says.","post_message":"\"Oh, Donald Trump is whining about attention now?\""},{"comment_id":"10153739079978812","commenter_b":"Waste of my energy girl..","commenter_a":"Hillary","post_message":"A new poll produced for ABC News/ Washington Post suggests negative views of Hillary Clinton have jumped since midsummer, while Donald Trump's popularity has grown more polarized along racial and ethnic lines: @webpagelink"},{"comment_id":"680360518742918","commenter_b":"Yeah ted😄,, me and my uncle Malcolm Fisher love ya!!!","commenter_a":"I refused to watch his garage band act but I'll take your word on it!","post_message":"Tonight America saw a powerful demonstration that it is time to move on beyond President Barack Obama. #SOTU2015"},{"comment_id":"10153406887426955","commenter_b":"Can't wait until someone drops a house on Hilary.","commenter_a":"I'm no detective, but my guess would be Hillary, I mean the wicked witch of the east.","post_message":"WHO STOLE DOROTHY'S SLIPPERS?"},{"comment_id":"949119691868046","commenter_b":"@username You cant be this obtuse. It was a joke. Have you seen any of her material? What was disgusting was her response to a KID.","commenter_a":"She's famous, making a great living for herself and it is because of the fans. If she doesn't want attention or people taking pictures of her / with her then she should have chose a different profession. She should be humbled that someone likes her enough to stop her on the street for a picture, not post a picture ridiculing a fan on her instagram for thousands of people to see. Poor taste.","post_message":"Find out what made Amy Schumer put an end to fan pics."},{"comment_id":"10152976505127507","commenter_b":"Kiss my ass!!! Idiot!!!","commenter_a":"NRA go to hell. Enough is enough!!","post_message":"Far too many times. Watch the video here: @webpagelink #CharlestonShooting"}]
