[{"comment_id":"10153268288138984","commenter_b":"Asshole !","commenter_a":"I bet if the truth were known, he didn't get injured by some machine falling on him. I bet his wife finally had enough of him and beat the devil out of him!!","post_message":"You'll have to read this list to find out what the top worst moments of his career are, but I definitely know what the best moment of his career is... When he finally leaves!!!"},{"comment_id":"1372709936105605","commenter_b":"someone should fire up her ass","commenter_a":"DISGUSTING NEWS BARBARIC..","post_message":"WTF IS WRONG WITH THIS CULTURE..."},{"comment_id":"1011733118888805","commenter_b":"Amen to that our children come FIRST","commenter_a":"So sad.","post_message":"We have NO ROOM! We need to take care of Americans first and make our country GREAT Again!~ FOLLOW US---> Freedom Daily"},{"comment_id":"1316028568419930","commenter_b":"What happens if you don't believe in \"God\"? I personally will not end up in hell if I have an abortion, as I don't follow the teachings of any religion. For me, it is my body and if I don't want something growing in my body I will remove it. I have had a miscarriage, and I have my one child. I do not want another child, ever. I can't use birth control, I can't use affordable condoms. If I have sex and I end up with a pregnancy I will have an abortion. Becuase I do not want another child. It is that simple. If we do not watch out we will soon be sent to jail for having a miscarriage, that is the road we are going down. So every female that has ever had a miscarriage needs to stand up and fight for the rights of others, ...","commenter_a":"Sometimes pregnancy happens regardless of how many precautions are taken. Sometime a woman's right to consent is taken from her. Sometimes the pregnancy is a deadly risk for the mother. Sometimes the baby may live a short, painful life or a long painful life. Sometimes a woman does not realize she is pregnant right away. Every time it is her body, her rules.","post_message":"This bill would prohibit abortions after the first detectable fetal heartbeat but many women don' even know they're pregnant that early."},{"comment_id":"1626970717590041","commenter_b":"Just another dumb ass girl.","commenter_a":"Great job to a fellow veteran to set her straight. As a veteran we all lay our lives on the line and people like this little girl has no concept of what that means. It seems to me her family hasn't taught her or the school's she has gone to they need to wake up","post_message":"What an epic response by this Veteran!"},{"comment_id":"10154518732261880","commenter_b":"Make America great again !! Thanks Mexico for the wall","commenter_a":"@username your boy is a fraud","post_message":"Buddy buddy."},{"comment_id":"10153779495443854","commenter_b":"WE ALL DEAD","commenter_a":"is this where the inhabitants of the northern hemisphere exterminate themselves","post_message":"Putin Warnes of Global War"}]
