[{"comment_id":"10156132117065725","commenter_b":"I appreciate you being so kind and politically correct. And you laid out a solid, arguably INDISPUTABLE, case there. But, as you pointed out, this is absolutely willful ignorance, so real facts don't mean anything when talking to a trump supporter. They have a feeling, form a belief from that feeling, and then that feeling morphs into a \"fact\" without any due diligence. And, unfortunately, all of their beliefs stem from feelings of bigotry (irrational hatred of an entire group of people). I'd love to have an honest conversation with a trump supporter about his policies. But they won't, because trump doesn't have any feasible policies, he simply says things are bad or good (which we all have the ability to do). What any trump supporter does when confronted with a lack of actual policy, with his track record of insults and short sighted aggression, is blame someone else somewhere ...","commenter_a":"The man did not make a \"nasty or controversial statement.\" He made a series of absolutely false allegations. Correcting him after he spoke could not possibly have been construed as interfering with his right of free speech; you would have only been interfering with his right to be ignorant. Which, apparently, is a sacred right to some of your supporters. And if somebody had made a series of absolutely false statements about you to the President, yeah, I'm pretty sure he would have corrected them.","post_message":"If someone made a nasty or controversial statement about me to the President, do you really think he would come to my rescue? No chance! If I would have challenged the man, the media would have accused me of interfering with that man's right of free speech. A no win situation!"},{"comment_id":"910598689036384","commenter_b":"You belong down in NO with the rats. You must be proud to live in one of the shittest places on earth. Simple math there's more whites than other races of course its going to be a higher number.","commenter_a":"What choice do they have? They were forced into this public position. They can't exactly say \"please burn these racist institutions to the ground until America really feels our pain\".","post_message":"Freddie Gray’s family asks for calm in Baltimore."},{"comment_id":"10153840278814497","commenter_b":"That would put a LOT of male caucasians over 30 out of country.","commenter_a":"50% Talent competition and 50% swimwear competition.","post_message":"Step 1: Filled-out refugee application materials are thrown onto a large, unorganized pile of folders on a desk at the United States immigration headquarters"},{"comment_id":"844972862206722","commenter_b":"Why don't women have enough sense to take care of there sex life. U play u pay. Use birth control.","commenter_a":"The guy in the photo wants to be aborted NOW!!!","post_message":"“There are thousands of unborn babies who need us to fight.\""},{"comment_id":"10153479746226438","commenter_b":"Nazi feminists, fuck off!","commenter_a":"Why are you showing a picture of this psychotic liar mattress girl who ruined a boys life with a false rape charge? There is no rape culture on college campuses. Rape has declined dramatically over the past decade. There are a lot of false charges of rape by scumbag feminist women though.","post_message":"Unfortunately, the oft-criticized statistic is true."},{"comment_id":"10152784784428145","commenter_b":"Huh!! Woman abuser and she's a dummy for staying with him! Jerk!","commenter_a":"I guess his girlfriend is a little thug to uhh. Wow!! It should be clear now who really was the trouble maker.","post_message":"UPDATE: Zimmerman has posted bond and is out of jail. @webpagelink #wftv A judge set George Zimmerman's bond at $5,000 and ordered him to surrender any firearms. His attorney, Don West, said Zimmerman is accused of throwing a wine bottle at his girlfriend earlier this week. #wftv Reporter Blaine Tolison is live with the latest on #WFTVatNOON"},{"comment_id":"537543736410961","commenter_b":"Elizabeth Warrren for VP on a Sanders/Warren ticket!","commenter_a":"Another socialist","post_message":"“I think that what the Democrats are doing is terrific,” Sen. Elizabeth Warren said. \"We’re out talking about the issues. I look at the Republican debates and the difference between what they’re doing and what the Democrats are doing that really shows who’s on whose side.”"}]
