[{"comment_id":"1154241914613147","commenter_b":"Maybe that dickwad should of been aborted.","commenter_a":"The faux outrage is big with this one. Who gives a crap.","post_message":"“How the hell do you think this joke is OK?”"},{"comment_id":"10153734508783132","commenter_b":"I have often said this...there comes a time when women need to realize this","commenter_a":"Just because you can wear one doesn't mean you should.","post_message":"NENE LEAKES can definitely rock a bikini."},{"comment_id":"10153432969041037","commenter_b":"Liars too?","commenter_a":"History lesson needed here - the NAACP is and always has been open to people of all races/ethnicity for membership and leadership. This story is a non-issue.","post_message":"NAACP's Rachel Dolezal: \"We’re all from the African continent.”"},{"comment_id":"10153432982041262","commenter_b":"Haha. That was sarcasm.","commenter_a":"Every month is Teacher appreciation week, they only work about 6 months out of the year and get paid for a full year.","post_message":"Tag a teacher that has made a difference in your life."},{"comment_id":"10153527313703525","commenter_b":"You can kiss my dick","commenter_a":"Florida has alot of crazy old out-dated laws that are on the books!! Check it out and you will see!!","post_message":"'SHACKING UP' LAW: As soon as the governor signs the bill, it will no longer be illegal to live with someone you're not married to. STORY: @webpagelink"},{"comment_id":"1062577053802042","commenter_b":"She looks like the kind of woman who would beat up a man alright. Man, that face is the stuff of nightmares!","commenter_a":"Domestic violence in the Clinton home?","post_message":"Does Hillary beat up Bill?"},{"comment_id":"563015167220109","commenter_b":"@username. You are Brain dead. Your mother must be so proud that she raised the village idiot. Sure glad you don't live here so we won't have to put up with your stench!!","commenter_a":"Did you hear that the Post Office just recalled their latest stamps? They had pictures of Antonin Scalia on them ... and people couldn't figure out which side to spit on.","post_message":"WOW... he went there!!!"}]
