[{"comment_id":"10153390451923837","commenter_b":"She should have done what the officer said and THEN tried to negotiate. I'm sure he would have let her return or pay for the shoes, but she insisted on pulling away from the officer, flailing and kicking. Officer was in the right.","commenter_a":"Oh well she got her prize for stealing","post_message":"DO THEY GO TOO FAR? Check out the body cam video of a Fla. woman accused of shoplifting being taken down and bloodied by a sheriff's deputy. Was the officer too aggressive? THOUGHTS - HANDLED FINE or WENT TOO FAR?"},{"comment_id":"10154154880759087","commenter_b":"And if Bill's affairs are on the table, so are Melania's published nude photos, including her lesbian poses.","commenter_a":"Stupid people can't even see that their party is in shambles because of this animal. PS- Bill isn't running for President, HRC is. If you're gonna judge spouses for their lack of control or influence in their marriages, then where's your criticism of Melania?","post_message":"\"They will elect Donald Trump and Mike Pence because they know that this is our last chance to keep our nation from plunging over the cliff into an abyss of debt, weakness, and servitude.\""},{"comment_id":"1713716002223281","commenter_b":"@username Bill Clinton is the one that suggested the wall u retard. Plus trump will hold people hiring illegals accountable.","commenter_a":"Yep. Actually, does sound like Trump's current talking points. Someone's a hypocrite. And it's not Trump. #Trump2016!","post_message":"Do you think this sounds a lot like Donald J. Trump? MORE: @webpagelink"},{"comment_id":"809483035820491","commenter_b":"Send her little ass over there to stay and take her ma ma with her","commenter_a":"NO FOR GOD SAKES , NO MORE CLINTON'S.","post_message":"Send Chelsea to Benghazi! Dc Gazette (y)"},{"comment_id":"1151245754895453","commenter_b":"Please like this page and visit this online clothing store and check the available stock. For all kind of Master replica and other beautiful stuff join us here. @webpagelink @webpagelink","commenter_a":"LOVE!!","post_message":"This 12-year-old boy — with no books and no money to get to the library — wanted to read so badly, he read junk mail. That was until his postman and the Internet stepped up to get him some books."},{"comment_id":"975974852420526","commenter_b":"You would lie like that? You and Warren deserve each other!","commenter_a":"We really DO need to declare the GOP a terrorist organization!","post_message":"From today's #MorningReads: GOP Front-Group Targets Warren's Legacy; \"Jihad John\" IDed; and Inside the GOP's Campaign to Defang Federal Gun Laws."},{"comment_id":"1180802641955155","commenter_b":"Don't let this wicked woman get away !!!!!!","commenter_a":"BETTER LATE THAN NEVER!!!!!!","post_message":"GET HER!"}]
