[{"comment_id":"1107371389322608","commenter_b":"The bloke with the pube beard is better looking then mwah? Ok STEVIE WONDER","commenter_a":"Looks like he's put glue on his face and rolled around a barbers floor","post_message":"Hug-me-Muslim ‘threatened to bomb MPs house"},{"comment_id":"10154596744362439","commenter_b":"Shoot that prick.","commenter_a":"so WE GIVE UP ON YOU BASTARD.","post_message":"That's why Europeans have to give up on the EU, if they hope to survive."},{"comment_id":"10153237839494203","commenter_b":"Marxist Feminists are ugly and nasty.","commenter_a":"Would you describe a man as \"testy\", Daily Beast? Thought not.","post_message":" can spin her way out of this. She can explain her way out of this."},{"comment_id":"10153091462652507","commenter_b":"There she goes again, speaking truth to power. And for the poweless. You go, girl!","commenter_a":"Thank you Sen. Watrem","post_message":"Watch Senator Elizabeth Warren crush it on the Senate floor during the debate to defund Planned Parenthood: “Did you fall down, hit your head and think you woke up in the 1950s or the 1890s? Should we call for a doctor?”"},{"comment_id":"1701770233407796","commenter_b":"The Muslims should start their own food chain. They could have whatever Muslim food they wanted. Then Americans could be outraged that they don't have cheeseburgers.","commenter_a":"I agree with these companys","post_message":"There is no reason why they should have to change their business for them. Do you support these food chains?"},{"comment_id":"1238033529550008","commenter_b":"Cute blonde catching giant gator. There's no race problem here, chill out!","commenter_a":"If this \"Aligator\" was black the outcome certainly would have been different!","post_message":"'Godzilla' did not take kindly to being restrained by alligator hunter Christy Kroboth @webpagelink"},{"comment_id":"10153389679411350","commenter_b":"the dirty creep is the one defending a perv family Linda!!!!!!","commenter_a":"Why is this even a question????","post_message":"Should TLC cancel 19 Kids and Counting?"}]
