[{"comment_id":"719757218174186","commenter_b":"So, @username. Please give me a source of information you've taken part of that doesn't promote the hoax. How many articles have you red? How many books? How many documentaries? You know how in a trial both parts are allowed to talk? The jury then have to consider which story makes the most sense and who has the most solid proof. So I take it you've studied both sides thoroughly before you decided it's a crazy tin foil hat theory? I mean, only a huge fool would believe they understood something without reading both sides. And you're not a huge fool now are you?","commenter_a":"Of course not, it's a Globalist hoax to control the world population even more and finance the World Government which is an essential part of the New World Order. The Chinese are in on it of course but don't know why he thought it was their idea specifically","post_message":"-_-"},{"comment_id":"10154313794062464","commenter_b":"Makes sense to me that Hillary would hide all her secrets in bathroom....no one would go in there after her....even if she did wipe her server.....","commenter_a":"Love the boots!!! I hate pink!!!","post_message":"In the Washington Examiner today: “Could Wendy Davis challenge Ted Cruz in 2018?” Add your name to stand with the cowboy boots over the pink running shoes: @webpagelink"},{"comment_id":"1325104020861488","commenter_b":"Both of those nut cases should be locked up and hit with $100,000 bail, third party and charged to the fullest extent. A little jail time should be mixed in with their punishment.","commenter_a":"Even as a woman I would have jumped in. But I'm a Country girl. I can whip ass like a Man. Especially when it comes to someone's life.","post_message":"A Florida police officer saw a car speeding over 100 miles per hour and stopped it on I-75 in Collier County, which the two men inside didn't seem to appreciate. After pulling a little trick before getting out, they began attacking the cop in the street to avoid arrest when they were met with an incredibly perfect dose of karma that they didn't see coming. @webpagelink"},{"comment_id":"880526405340442","commenter_b":"Muslims bullying their way into power.","commenter_a":"Get your FREE money making website. No Investment Ever Earn and save on everything... loans, cars, insurance, merchandise, vitamins, hosting almost anything you can imagine, No Investment Required... EVER. @webpagelink","post_message":"The public was allegedly told 'not voting for him was sinful and un-Islamic'"},{"comment_id":"1921412701405309","commenter_b":"Your daughter is next.","commenter_a":"But had they wasted the dude, they'd be selling shirts with his thug face and calling for a cop lynching.","post_message":"A police officer's body camera captures the moments he and his partner were shot during a traffic stop. More details ---> @webpagelink"},{"comment_id":"10154516833146162","commenter_b":"Ain't no 6ft sumn woman hanging their self in no jail cell miss me with that","commenter_a":"Wow, this tells everyone....NOTHING! I would like to hear... Exactly how Sandra Bland died. Period!!!!!!!","post_message":"An ex-guard admits to falsifying Sandra Bland's jail log... @webpagelink"},{"comment_id":"959924910733924","commenter_b":"Nonsense don't believe the Hype. why don't you start a campaign to get rid of us Scots? You will be doing us a favour. For the record were not antiEnglish were antiWestminster","commenter_a":"All paid for by us Nice English people No wonder they voted against independent They would be mugs to leave their gravy train","post_message":"How Scotland got RICHER during austerity thanks to English taxpayers"}]
