[{"comment_id":"1538307646229359","commenter_b":"Let it burn ...what a dumb bitch...","commenter_a":"Let's see how that works out!","post_message":"What do you think?"},{"comment_id":"10153930605634614","commenter_b":"Women.., please don't fight strangers...,they're not your husbands..,to be arguing all day...","commenter_a":"Only 13 years for her life. Really for someone killing a mother directly in front of her children what really he should of got life for each child plus mom no way appalled.","post_message":"Elizabeth Yanez was stabbed to death in front of her two children in a dispute over a parking space at the Santa Fe Springs swap meet. Her convicted killer, 23-year-old Reggie Cervantes, was sentenced to 13 years in state prison Tuesday for the 2014 attack. doesn make sense to me, nothing makes sense, the woman daughter said after witnessing the brutal attack. a parking space. How am I supposed to go on with my life? Read KTLA's story here: @webpagelink"},{"comment_id":"10153071705477093","commenter_b":"^ Alex I almost did but I knew she as well as many others wouldn't grasp that concept.","commenter_a":"\" AGAINST HATE\" in Dallas,Texas SEPTEMBER 14, 2015- MONDAY At the American Airlines Center At 5:30pm....all those that want to stand against hate are welcomed. march to the... American Airlines Center In Victory Square...from Cathedral of Guadalupe Off Ross St in Downtown. Police Department will be on site but I would like to note that everyone should be very cautious & on guard. There have been reports that peaceful protesters have been attacked by Trump supporters & some dressed like protesters & assult others within the crowd & reported spitting in their faces. Have your groups be alert & camera rolling just in case, if this happens, attackers can be on record & prosecuted! Thank you everyone & remain peaceful yet boldly stand for Justice. Arm & Arm. Wearing Red,White & Blue colors.","post_message":"A \"Dump Trump\" rally is now scheduled ahead of Trump's rally in downtown Dallas tomorrow."},{"comment_id":"10152718223821051","commenter_b":"Shut up cunt","commenter_a":"this can not be","post_message":"Darren Wilson is about to get sucked back into the Michael Brown shooting case."},{"comment_id":"10155602222490354","commenter_b":"I would let my daughter be a part of this group, it has been infiltrated by radical lesbian feminist. Children are not safe with them!!!","commenter_a":"Is this a great country or what?","post_message":"It's not clear how this will affect cookie sales...."},{"comment_id":"10154233852123445","commenter_b":"Eww shut up bitch i do but ive seen u more than her 👊😛","commenter_a":"@username @username @username @username haha hell yea i do !😂😂😂😂","post_message":""},{"comment_id":"744192892380562","commenter_b":"Jerome-- a mole? Are they all?","commenter_a":"Close the borders. With all due respect congressman, only idiots would even consider calling military age men \"refugees.\" Our borders have been poorly managed that it is impossible to tell who has infiltrated my America. Seems that Congress has chosen to remain totally mute on this issue. Obama bashing does not hide the fact that inaction equals compliance.","post_message":"It's frustrating that President Obama refuses to shift his strategy to defeat ISIS. The horrific attacks in Paris are evidence that the current strategy to defeat ISIS is not working. I discussed this earlier today on Fox Business' Varney & Co.. Watch below:"}]
