[{"comment_id":"913202388702552","commenter_b":"For women, there's always danger no matter how much you use your head.","commenter_a":"No danger if you use your head. Crime is down in most of the civilized world. The news cycle is just longer.","post_message":"\"Are you alone?\""},{"comment_id":"1226252880748515","commenter_b":"Simply disgusting to disregard females.","commenter_a":"Carry the baby, but you'll get no health care, no paid maternity leave, no disability if you have complications, no help with diapers, daycare or anything else. And then for extra shits and giggles we'll say that you're a burden on society and need to pull yourself up by the bootstraps.","post_message":"Not content with being a mere robot who repeats the same scripted line over and over during a debate, Marco Rubio demonstrated that he is a cold heartless robot on Sunday."},{"comment_id":"10153373232208984","commenter_b":"Wow!! Such nasty, foul mouth comment from a woman. First Lady has more class than you will ever know.","commenter_a":"Yes we can not wait to get a real first lady again this nasty racist bitch needs to fk off","post_message":"I thought I'd seen every attempt at the race card possible, but this is definitely a new one... Do you look forward to Michelle leaving the White House?"},{"comment_id":"527521687455792","commenter_b":"Don't give her anything free ,I bet she would loose some weight then maybe she will like what she sees,maybe if she was real hungry she would find a job,how about stopping everyone's welfare look what a cost saving that would be and it would help our United States we wouldn't have to feed a bunch of free loaders .","commenter_a":"Oink, Oink !!","post_message":"I couldn be more disgusted by what she saying"},{"comment_id":"1733753426842494","commenter_b":"@username Subtract the illegals and convicted felons that cannot vote those minority numbers are laughable .","commenter_a":"I see Hillary's sheep say Trump will Lose the Latino, Woman, LGBT, Veterans and Blacks votes. I am sure Latinos enjoyed seeing they are called taco bowl voters to the democrats. Women Yeah because Women most likely respect the way Hillary treated women when her husband sexually assaulted them, LGBT yeah because her policies are directly responsible for 49 of there deaths in Orlando and she wants to increase that by 500%, Veterans yeah because every service man/woman wants a women who will abandon them. Blacks yeah because blacks love to be called super predators, The only votes Trump is losing is to brain dead people who care more about a business mans taxes then they do Clinton's proven corruption and lies. and the only polls Trump is losing is broadcast on the same media outlets that have been proven to be corrupt. Watch a Trump rally and then watch ...","post_message":"\"[Hillary Clinton] is bought, controlled and paid for by her donors and special interests.\" Donald J. Trump gave a speech on economic policy this afternoon, saying \"Hillary Clinton will never withdraw from TPP.\""},{"comment_id":"1430173077011648","commenter_b":"Crazy lady!","commenter_a":"Vote Trump all the way to the White House. This country is a business and should be run by a businessman. We have seen what the politicians have done to this country. Trump was self-funded and owes no one. It is time we the people donate to Donald Trump so he is not forced to accept special interest money. I don care how rich he is, he can keep bleeding money, let help him. It should be the American people that Trump owes and not special interest. Go Trump all the way to the White House. Make America Great Again! All aboard the Trump Train! Take America Back from CAIR, MOVE ON, BLM, Muslim Brotherhood and Liberal Terrorist!!!!! Vote Trump, bring jobs to America. Vote Trump if you want to get rid of unfair trade agreements..Save our Country!!!!!!!!!!! Keep out the refugee terrorists!!!! Save our countries jobs!!!! And a side ...","post_message":"Gee, wonder why?"},{"comment_id":"1238572129494342","commenter_b":"You're a typical liberal Asshole ! Try those new laws in Court on those Illegals & Drug dealers & criminals no gun permits !","commenter_a":"can't wait for the State of Jefferson to separate from California and away from Brown and his non concern for America, this guy sucks ass was a loser before but voted in again by losers from other states that just moved to California for welfare and hand outs","post_message":"Gov. Jerry Brown dropped ink Friday on about half of the dozen gun control bills recently placed on his desk, including one requiring background checks for ammunition purchases and another that bans the sale of semiautomatic rifles that use a bullet button to easily detach a magazine."}]
