[{"comment_id":"10153111223750779","commenter_b":"@username You're such an, asshole.","commenter_a":"Donald Trump for President","post_message":"Billionaire celebrity G.O.P. presidential candidate Donald J. Trump will host an upcoming episode of Saturday Night Live."},{"comment_id":"10153114544546943","commenter_b":"Charge her with something!","commenter_a":"Hilliary has blood of our soldiers on her hands","post_message":" Obama administration including Hillary Clinton and Susan Rice knew immediately that the Benghazi attack was a terrorist attack. The State Department new smoking gun documents put to rest any question about what Hillary Clinton and Susan Rice knew and when they knew it, said Judicial Watch President Tom Fitton. minutes of the attack, the administration, specifically Hillary Clinton, began lying to the American people by blaming an obscure Internet video. No wonder Hillary Clinton is the great destroyer of State Department emails. One can assume that Mrs. Clinton would not have stolen and destroyed emails in violation of law and various court orders if she didn have something to hide. And it shouldn take a federal court order to find out that Hillary Clinton evidently had no clue how the State Department and the FBI responded to terrorist attacks on State Department personnel."},{"comment_id":"10154179770204330","commenter_b":"How did this happen,if the Zoo was secured? Just so happens this is a Black child. Had it been a White child,there wouldn't be no complaints. Hypocrites!","commenter_a":"Accidents happen. They do. However, accountability and fault are determined and responsibility for the loss of this priceless animal (financial) should be taken in a court of law.","post_message":"\"Accidents happen.\" That's the response from the mother of the 4-year-old boy who fell into the gorilla exhibit at the Cincinnati Zoo over the weekend, forcing zoo staff to shoot and kill the gorilla. She says too many people are judging her. Thoughts? @webpagelink"},{"comment_id":"10153206865573525","commenter_b":"Stfu!","commenter_a":"'Charged' a police officer with a knife ? And she is still alive ? Oh wait, she is WHITE !","post_message":"HOUSE OF KNIVES: Here's a look at what deputies confiscated from a Hernando County woman's home after she charged at an officer with a knife. Thousands of knives and other weapons, along with fake severed limbs and fake skulls. MORE: @webpagelink"},{"comment_id":"10153731561481336","commenter_b":"You're an idiot Elizabeth!","commenter_a":"The shooter was a conservative republican. That seems to be a common theme in mass shootings.","post_message":"One law enforcement official described the shooter as an \"angry young man who was very filled with hate.\""},{"comment_id":"1070333876354408","commenter_b":"She makes my ears hurt.","commenter_a":"She will say anything and she will lie to America like she's always there","post_message":""},{"comment_id":"10153128143973812","commenter_b":"Cows can't even read","commenter_a":"Japanese people have since killed 78% of all Dolphins seen in this video.","post_message":"WATCH: It seems more like a dream as you watch it, but for Alex Rivest, it was reality as he joined a large pod of dolphins off the coast of Hawaii's Big Island. This video was recorded in late December."}]
