[{"comment_id":"1048920205189554","commenter_b":"@username idiot!!!!","commenter_a":"It's not necessary to test on animals. Their bodies are not like ours.... it means nothing. Do the back study of how useless animal testing is, folks.","post_message":"This is the heart-touching moment 156 beagles are set free from an animal testing facility in India. Credit: Caters TV"},{"comment_id":"729261537208194","commenter_b":"Not for criminals!!! More sheeple...","commenter_a":"When is everyone going to realize that gun control laws only apply to the law abiding citizen's? Criminals could care less what law is out there that says something is illegal, such as murder, drugs, ect.","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.” Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"994006457321423","commenter_b":"She should be drinking it!!","commenter_a":"What are the long term effects on the citizens of Flint Michigan.... Thanks Cher for showing your humanity","post_message":"Cher is doing her part to help out the people of Flint as they continue to deal with city’s water crisis. More than 180,000 bottles of water are being shipped to Flint courtesy of Cher and water company Icelandic Glacial, which pledged to double her donation. DETAILS ----> @webpagelink"},{"comment_id":"10152816296297452","commenter_b":"I hate possums they look like big rats","commenter_a":"Time to burn the house down","post_message":"Can something be totally terrifying and completely cute at the same time? We've seen a lot of \"wild animal in the city\" stories here in Southern California: bears, coyotes, mountain lions... But this could be the wildest. What one L.A. woman found in her closet is lighting the internet on fire. @webpagelink How it got in... how it got out... and the reason it was so angry. Tonight at 11 from ABC7 Eyewitness News. Courtesy: Tara McVicar"},{"comment_id":"10153116909760671","commenter_b":"As they should I would not want men in a women's locker room even if he dresses like a women, just think about how it smells that would be enough for me to wait until there showered.","commenter_a":"Try sending in a transgender reporter, that'll make 'em happy!","post_message":"“I have covered male sporting events all over the world and it took coming to Indianapolis to face my first gender discrimination,” one of the journalists wrote on Twitter. Thoughts?"},{"comment_id":"10154590709007955","commenter_b":"Of course. He has already done a lot for the USA. Keep going President Trump. Pay no attention to the meaningless leftists.","commenter_a":"absolutely","post_message":"Do you think Americans need to give Trump more of a chance to succeed as president?"},{"comment_id":"10153212964226336","commenter_b":"Daniel Eskildsen just because this women gave her kid a cookie doesn't mean she fills her kid with junk food.. cookies in my house are a treat to the healthy diets I have my children on..","commenter_a":"Teachers need to worry about teaching and not parenting","post_message":"Cookie crackdown! A preschool teacher sent a note home reprimanding a Colorado mom for packing Oreos in her 5-year-old daughter’s lunch."}]
