[{"comment_id":"10153921067764203","commenter_b":"@username, But many Women would and I bet You were going to have A lot more Women shooting themselves.","commenter_a":"Yah most women can't find their keys in their purse! As they fumble for the gun, they'll be long gone!","post_message":" new motto may just be you see something, say something. But make sure you packing heat and have good aim."},{"comment_id":"10153269356147452","commenter_b":"@username the Marine Corps taught me nothing. You must be a weapons expert","commenter_a":"So you can hear two people yelling but not a gunshot?","post_message":"BREAKING NEWS: A homicide investigation is underway after one person was found dead following a report of two men yelling in an Alhambra neighborhood, police said. One person is being questioned, and there is no active search for other suspects."},{"comment_id":"10153500362571770","commenter_b":"The world does not have a right to illegally enter the United States. The American people have appealed to Congress for years to secure the southern border so that we could then begin to address the issue of the illegals already in the country. That could have at one time meant some sort of arrangement for them to stay legally. But Congress did nothing because the WSJ, the Chamber of Congress and the business world wanted a supply of illegal, off the books, low wage slaves while others long for a utopian open borders world. It's time to bend our politicians to our will. We need to send the message, secure the borders or pay the price come election day.","commenter_a":"make sure they're all legal!!!","post_message":"A new coalition of Latino groups and labor unions aimed at stopping Donald Trump from becoming president will begin holding voter registration drives at high schools in battleground states."},{"comment_id":"1086256118053035","commenter_b":"So we leave our selves defenseless so that some kid can study underwater fire fighting?","commenter_a":"Spending more money that we don't have, Thank You, so very much!","post_message":"The Perkins Loan Program can be a critical lifeline for many low-income students. I’ve joined 53 of my colleagues, including Senator Robert P. Casey, Jr., in calling for its reauthorization. Learn more below."},{"comment_id":"10155107164375231","commenter_b":"She's about as black as Clarence Thomas.","commenter_a":"She literally is Clueless","post_message":"After remarks about “good girls” and “naughty” women Stacey Dash proves that 'Clueless' is a perpetual state of mind for her."},{"comment_id":"10154204530456037","commenter_b":"Pussy","commenter_a":"Muslim obama has destroy the military.","post_message":"The accused spy, Lieutenant Commander Edward Chieh-Liang Lin, has been in the Navy since 1999 and has won several awards, including two Navy/Marine Corps Commendation Medals."},{"comment_id":"953451111362414","commenter_b":"Feminists are annoying","commenter_a":"I think there all cunts so I suppose I am humanist ha...","post_message":"Tonight, Ed Sheeran performed a song about his love life. Feminist Taylor Swift wants to know why no one called him sexist. #Grammys"}]
