[{"comment_id":"10150710732969999","commenter_b":"@username Under Trump she would probably be stopped from entering the US.","commenter_a":"Now watch Trump dismiss this intelligent young Muslim woman with a bigoted insult as his ignorant fans cheer him on.","post_message":"\"Well, that’s really tragic that you hear these comments which are full of hatred, full of this ideology of being discriminative towards others,\" Malala Yousafzai said in response to Donald J. Trump's remarks on Muslims."},{"comment_id":"10154422219571509","commenter_b":"Guys it's an easy fix. Just vote for whoever is black in any movie that's how they want it","commenter_a":"I never watch that mess anyway. I do love movies but I'm not into Hollywood all patting each other on the back.","post_message":"When it comes to diversity at The Academy Awards, most Americans shrug their shoulders."},{"comment_id":"10153299356731051","commenter_b":"@username IGNORE THE TROLL. NO FRIENDS ..NO SITE..NO BRAINS!!!","commenter_a":"Yes I agree with Trump make this nation great again","post_message":"Donald Trump wants to make America's military so powerful that the whole world will be afraid to challenge us. Would you like to see it happen?"},{"comment_id":"10152973600191336","commenter_b":"Na she's not crazy . Mothers turn super human when someone hurts or almost hurts their kids","commenter_a":"Ok...pretty sure this woman is cray-cray...not a protective mama bear, but whatever","post_message":"A wild police chase in Dallas came to an end thanks to a protective mother."},{"comment_id":"10156227118445354","commenter_b":"And gays, get ready to be tossed off the highest building available. Who let the muslims here. Get ready fools.","commenter_a":"Prepare , you liberal women better bend over and shut your fucking mouth. This is what you asked for.","post_message":"Green light GO!"},{"comment_id":"906985682657621","commenter_b":"She didn't come up with it! If she tries to patent it Nicki Minaj will sue her. Nicki said SHE came up with the word. SMH, that word has been around for 20 years.","commenter_a":"She needs to get a copyright or a patent for the word because people these days will try their best to steal your joy! IJS","post_message":"How Kayla Newman Created “On Fleek” While Her Mom Shopped At Burlington @webpagelink"},{"comment_id":"1830155707222526","commenter_b":"@username ...Well, CA did vote her out...but the rest of America did!!! Oh, HAPPY DAYS!!!","commenter_a":"This \"Deplorable\" American Christian is voting for TRUMP, I live in California and all my neighbors and friends are voting for TRUMP...We are tired of the lies and corruption of career politicians!!!!","post_message":"Matt Walsh: A Clinton win won’t be a victory for women but a victory for corruption."}]
