[{"comment_id":"564505557070656","commenter_b":"😩😩😩","commenter_a":"@username 😩😂😂😂😂","post_message":""},{"comment_id":"996230513733330","commenter_b":"Hillary would then round up JEWS if she could ... Thats been done by HITLER","commenter_a":"How big of a f-----n idiot can some one that is running for office be she is going way to for","post_message":"BREAKING: Hillary Clinton accuses GOP of wanting to implement Nazi tactics."},{"comment_id":"10155781129770329","commenter_b":"The Government shouldn't be funding ANY OF IT, that's the reason it would be discontinued. The Federal Government protects our borders, prosecutes Federal crimes (FBI) and unifies States with Federal Laws under the constitution. That's ALL I WANT THEM TO DO. I support Trump cleaning house on the outrageous spending the Federal Government has been doing for some time. PBS can go back to private funding and telethon like they did when I was a kid. NPR, same idea. They need to raise their own money like any other radio/news outlet. The amount of fees we will begin to charge Mexico for deporting all the people they let cross over will pay for The Wall. In taxes to Mexico for importing goods here. Learn basic Economics and US Government people, geez...","commenter_a":"The best part about PBS, NPR, and those other arts programs that are getting cut is that they actually don't cost that much. So, really, there isn't a lot of money being saved to go towards the idiotic wall that he wants to build.","post_message":""},{"comment_id":"10152554042082623","commenter_b":"Girl bye lol","commenter_a":"It looks like a H.I.M. sticker lol also the pentagram/pentacle is an ancient symbol that represents the great spirit, and the elements air fire earth and water...upside down means nothing as there is no Satan and no Jesus. .... someone needs to read something OTHER THAN THE BIBLE HAHAHA","post_message":"A woman says she snapped a picture as soon as she spotted what she says is a symbol of evil in these school bus brake lights."},{"comment_id":"10153792306655329","commenter_b":"Love watching this grossness!","commenter_a":"Tom Genaway","post_message":"jlskjerssjklrjsl"},{"comment_id":"1626970717590041","commenter_b":"Just another dumb ass girl.","commenter_a":"Great job to a fellow veteran to set her straight. As a veteran we all lay our lives on the line and people like this little girl has no concept of what that means. It seems to me her family hasn't taught her or the school's she has gone to they need to wake up","post_message":"What an epic response by this Veteran!"},{"comment_id":"161828217554597","commenter_b":"Racist bitch","commenter_a":"The racist white ppl that support Trump never show black ppl in a good light!! Never!! @username is the most racist of the right-wing, white supremacist sites!","post_message":"After the Louisiana flood, this man started wondering when the help from Black Lives Matter and Black Panthers would be arriving... The TRUTH is devastating..."}]
