[{"comment_id":"10153252005637235","commenter_b":"Stupid girls","commenter_a":"Racist comments aside their flow is terrible.","post_message":"The girls insist they are not racists or bigots."},{"comment_id":"10153073286297894","commenter_b":"I think the idustry favors her and is partial to her music but there is no room for disrespect to anyone.","commenter_a":"I can't get past \"somewhat respect me\". Either he respects you or not! ByeTaylor","post_message":"Taylor Swift Talks Kanye West in ‘Vanity Fair': I Felt We Couldn’t Be Friends Until He Somewhat Respected Me"},{"comment_id":"10153763080696350","commenter_b":"Of course he is being dismissed.. If he wasn't, there would be another riot. She needs her butt kicked out of school.. Very tired of this..","commenter_a":"This cop was so wrong with is action I am glad he was fired","post_message":"BREAKING: Sources say that the South Carolina deputy seen flipping a student in a classroom will be relieved of duty."},{"comment_id":"971601666302233","commenter_b":"It seems like all the intelligent women with morals have been fired... This show needs to be cancelled!","commenter_a":"Yes","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"10153244744761378","commenter_b":"Stfu","commenter_a":"Stop chasing people in residential communities!","post_message":"DEVELOPING: Police tell Action News officers were chasing a sedan when the driver lost control, hitting several parked cars, trapping one person in the wreckage. It began before 7:00 this morning in Glenolden, Delaware County. @webpagelink"},{"comment_id":"10152860755326051","commenter_b":"way to go Arizona..mebbe the first shot of the Revolution...we MUST abide by the Constitution or it means NOTHING!!","commenter_a":"What does any one expect for any state to follow the president even when he not following the law of the lands that was put there for a reason... His theory is he have a pen n a phone so that gives him the right to over step the government that he has to go through because it's the Law! He hasn't done nothing for me nor my family, all he has done is given my taxes away freely while we struggle.. Nothing he has done has improve my family living not one bit... At the end of the day we don't need his helping hand at all it does us more harm then good for us... If anyone expect any state to follow the president then he needs to lead by example n follow the laws that was put there way before his time n stop acting like the ...","post_message":"This state just passed a bill allowing them to ignore anything President Obama asks them to do. And that’s not even the most controversial part of the bill."},{"comment_id":"1452171914802834","commenter_b":"The only thing Hillary Clinton is going to do is be the 2nd woman to run for president and loose.","commenter_a":"Go Hillary it's an excellent speech","post_message":"\"Now Donald J. Trump says, and this is a quote, 'I know more about ISIS than the generals do….'\" \"No, Donald, you don't.\" Read more of Hillary Clinton's DNC speech: @webpagelink"}]
