[{"comment_id":"10153142231890329","commenter_b":"Also it says 'optional' so parents do what they want regardless. Lots of parents I know say they prefer the class donation as they may not always get a chance to shop or might not know the child well enough to personalise the gift.","commenter_a":"Let me put forth a different perspective: my kids are in classes with 20 odd children in - this is excluding family and family friends who attend the parties. At birthdays if all the class kids attend that's 20 gifts. You are hard pressed to find something cheaper than 10 quid these days and most individual presents cost more so if everyone gives 10 quid it lands up being more affordable for a lot of people, means a lot less clutter in what are often small London homes or apartments, and collectively with say 200 pounds a child can get one substantial gift like a bike or it could go towards something the parents need for their child. I genuinely don't see an issue with this at all and fail to see how this is a middle class issue.","post_message":"Oh, dear. // BuzzFeed UK"},{"comment_id":"563081667216516","commenter_b":"Where the white woman at !!","commenter_a":"Markus please don't allow this on my pic I have very young children One is my 6 month old grandson. And 4 other grand kids. Please help Me out lets work to gather to stay Younger. Love auntie Diana","post_message":""},{"comment_id":"1194670093899735","commenter_b":"Hillary? Really the woman should be in prison.","commenter_a":"The judge is a son of illegal immigrant. @username do your freaking job investigate this judge. I gurantee you he's Hillary Clinton's supporter.","post_message":"U.S. District Judge Gonzalo Curiel in San Diego called for the documents to be released."},{"comment_id":"10152902814047623","commenter_b":"some whites were brought here as slaves cheese whiz","commenter_a":"Well the NAACP is racist but we arent trying take away their heritage or bill of rights","post_message":"Someone scrawled the word “racist” in black paint on a Confederate monument in uptown Charlotte overnight, officials said."},{"comment_id":"1027313147330802","commenter_b":"Jerry, I hadn't thought about Arab nations not taking them for that reason. So-called common wisdom has it that they don't want them because they're potential troublemakers. Your idea makes more (and scarier) sense.","commenter_a":"I don know if anyone realizes what is going on. I always tried to grasp the larger picture; go from the general to the specific and not the other way around. Europe and soon America are under invasion. None of the typical Arab countries have taken the Syrian refugees. Fact. Why? Because they want them to overwhelm the western nations. Infiltrate the society. Surround the culture and change civilization as we know it. At that point, it done. Pretty simple, isn it? Sorry, not if I can help it. Islam is a political movement masquerading as a religion. Smell any coffee?","post_message":"Muslims Tried To Go Big In This U.S. Town, MAD Patriots Shut Them Down (VIDEO) @webpagelink"},{"comment_id":"977430998961803","commenter_b":"Europe just \"undid\" what the last Christian Crusades accomplished. All who refuse to convert to islam will soon be put to the sword.","commenter_a":"Europe is not the Europe we knew yesterday, history has been made today. Europe will not longer be Europe it is now a Muslim world. We just lost the wonderful world of Germany, France, Spain, England, Poland, Austria, etc. It's sad, the only one fighting for their country is Hungary and I give them a lot of credit, they don't want to lose their Christian faith. And America is next, we will be taking in thousands but the problem is we don't know if we are getting terrorist or good people. All I can say is God Bless us all,","post_message":"Why are the \"refugees\" mainly fighting age men? Where are the women, children and elderly?"},{"comment_id":"10154473881370329","commenter_b":"Ivan Roy Rasmussen YESS!!!!! Hahahahaha","commenter_a":"Katie KocajSierra Weiner squid ward tortellini","post_message":"\"Am I a pretty girl?\" // SpongeBob SquarePants"}]
