[{"comment_id":"1112602185474010","commenter_b":"FFFFFFFFFFFFFFFFFFFFFF trump he is a orange bigot! #Ftrump","commenter_a":"trump 2016","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."},{"comment_id":"1284368551656196","commenter_b":"It is true that staying home and taking care of the kids is cheaper but also if both parents are working to meet their needs then they can apply for daycare help to cover daycare instead of staying home and collect food stamps and cash from the government.. I'm a single mother and I was working full time and couldn't afford daycare or a full-time nanny and I did went to get help and they cover the daycare or babysitter cost...some people work half on the books and half off the books just so they can collect government help I see it every day...","commenter_a":"Is taking care of several under school age children not a full time job That mothers are not getting paid for. What should they do . For food .","post_message":"EXACTLY!"},{"comment_id":"417605495104769","commenter_b":"Ummm hmmm. Now ask YOUR grand parents and the rest of YOUR family. Bitch PLEASE lol","commenter_a":"FUCK ALL Y'ALL WHITE AND FAT UGLY MATHERFUCKER! OBAMA OBAMA OBAMA OBAMA OBAMA OBAMA","post_message":"Malia Obama Just Challenged Tiffany Trump, Learns Quick Lesson The Hard Way. You don't mess with the Trump family. Can we get 30,000 'LIKES' for Tiffany Trump?"},{"comment_id":"10154078774989877","commenter_b":"Besides reproduction and parts which aren't anyone's business, nothing in these comments state what makes a woman a woman.","commenter_a":"We should all be okay with this. Two words: Fairness and equality.","post_message":"Spelman College to consider admitting transgender women Grio fam, is it time HBCU's updated their views on gender identity? Sound off below!"},{"comment_id":"1763785047184730","commenter_b":"Nice mouth for a lady?","commenter_a":"and this is supposed to negate every racist, woman hating, derisive thing he's said in the past 9 months???? Fuck off!","post_message":"Do you support Trump?"},{"comment_id":"10153231031836051","commenter_b":"Yes, Hillary should have lost her security clearance a long time ago when they first discovered she had breached security with her emails...she should also lose her freedom...she belongs in jail for her crimes. And she will get out lucky if we don't ask for her life as well.","commenter_a":"Hell yess","post_message":"Do you agree or disagree with these intelligence officials?"},{"comment_id":"1201903546502686","commenter_b":"No way, he works at Wal Mart today. He made something of himself.","commenter_a":"Is she related to the banjo player in \"Deliverance\"???? Same eyes!","post_message":"It’s a shame, but I guess we shouldn’t be surprised by Hillary Clinton’s attempt to politicize another tragedy to advance an anti-gun agenda. As this analysis rightly points out, Oregon has some of the strictest gun laws on the books, and none of these proposed new laws would have stopped these awful shootings in the first place. We all want to stop these senseless tragedies, but using them to push unconstitutional, unrealistic, and ineffective new laws in order to win favor on the left isn’t going to help. I’m a gun owner myself, and I strongly value the rights guaranteed in the Second Amendment. The overwhelming majority of gun owners are law-abiding citizens who strictly follow all applicable state and local regulations. I will oppose any effort to take away the rights of law-abiding American citizens to own firearms."}]
