[{"comment_id":"10154038199220470","commenter_b":"Dang! 2 females! Crazy!!","commenter_a":"@username.. This is the chase we saw","post_message":"#BREAKING: The police chase lasted about a half hour, police say. No one was injured."},{"comment_id":"886338878165958","commenter_b":"Muslim GET OUT!! Allah can't help you in America!","commenter_a":"Or, they could just move to a muslim country.","post_message":"YESSSSSSSS! This totally just made my day...."},{"comment_id":"10153746801086336","commenter_b":"Sure abuser.","commenter_a":"Go to court when you are told to and this won't happen. Simple.","post_message":"\"I have a one-year-old son and I'm trying to take care of him by myself! I'm begging you, please!\" the woman cried to the judge before she was led away."},{"comment_id":"10153564191549270","commenter_b":"Chupacabra, pick up DOD Files hay accurate B 52 bombing during knock out gooks ... evaporated socialists and during First Iraq company","commenter_a":"When the last time bombardier B52 knock out targets accurately .... during .Vietnam... Flight over Chinese and just scare... scare Chinese...","post_message":"\"We conduct B-52 flights in international air space in that part of the world all the time.\""},{"comment_id":"843269965740273","commenter_b":"How do you know it's a woman?","commenter_a":"It's so sad to see how judgmental people are. Opinions are like belly buttons. Everyone has one and they're filled with lint. To call this woman names and degrading her by calling her IT, is shameful. Not everyone lives inside the box or mold of society. \"Free your mind, and the rest will follow!\"","post_message":"Today's culture is damn sickening. This thing is straight from hell and should be sent back. This is ridiculous..not even funny"},{"comment_id":"995165647267071","commenter_b":"Ignorant fucking racist bitch","commenter_a":"Today is the first time I listened to his so-called speech, I usually either hit the mute button or change the channel. I sat through his speech and was dumbfounded...The lies were spewing all over the place, he is such a narcissist and egomaniac I could not believe what I was hearing. I hope and pray that Crooked Hillary, the Benghazi Butcher does not get elected because if she does, we are in for four more years of the same!","post_message":"Simple question: Are you happy or unhappy with the way President Obama has responded to the Orlando attack?"},{"comment_id":"551022975088282","commenter_b":"the only thing i would sacrifice for this transvestite is a bullet.","commenter_a":"What the hell makes her think she can change our constitution? She's a nobody married to a mistake & not worth the oxygen she breaths! & he is a waste of oxygen also.","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"}]
