[{"comment_id":"10156617842095354","commenter_b":"This is just another Obama liar. Do not pay too much attention to her....Someday everything that they have done will come back and bite them in the butt.","commenter_a":"I've got to ask: Is Shultz starting to look more and more like Jar Jar Binks? What's going on there? I must avert my eyes.","post_message":"***FIRESTORM OF DEMOCRAT LIES***"},{"comment_id":"1240086616006505","commenter_b":"Animals r strange voters... They will vote with the Jews.","commenter_a":"Who? Never heard of him.","post_message":"And then he said where he promises to MOVE if Trump DOES win..."},{"comment_id":"10154693491116833","commenter_b":"They know. It doesn't fit their agenda of eliminating ownership.","commenter_a":"When will the liberal anti-gun haters, learn that teaching safety first you will get rid of most of the accidental shootings. It's not the gun it's the person that picks up the gun that is the problem. If you would allow gun safety in the schools, like sex-ed, there would be a lowering in accidental shootings.","post_message":"While Everytown's ad message is all about being and safe with guns, the ad, amazingly, disregards basic fundamentals of safe gun handling. Unlike the National Rifle Association, anti-gun groups don't make actual gun safety training services, for adults and children who want to be and safe with guns available."},{"comment_id":"10154034476612144","commenter_b":"@username you are a freaking trumpette woman which is disgusting. Go away","commenter_a":"Journalist should ask Trump for all his business and private emails when he demands Hillary's. Then point out she has released decades of tax returns and when is he going to pony up like a real candidate. The public has no more right to Hillary's private emails than they do to Trump's.","post_message":"No one is talking about this, but Donald Trump just screwed up and admitted the truth about his taxes."},{"comment_id":"10153373415836130","commenter_b":"That's right.","commenter_a":"They NEVER thought it was a bomb. If they had, why was the school NEVER evacuated? They were racist, bigoted asses who lied when their hatred was bared to public scrutiny","post_message":"The family is “still deciding where he will go next.\""},{"comment_id":"1115555701831927","commenter_b":"Get and keep satan out of the White House!! SAVE AMERICA TRUMP 2016 ALL THE WAY!!!!!!!!!!!","commenter_a":"Done","post_message":"LAUGHABLE: Clinton Press Secretary Gives Conditions Under Which She Will Give A Press Conference Let's just plan on this not happening...EVER!"},{"comment_id":"1813322542237935","commenter_b":"Then what makes her capable of running our country","commenter_a":"Mrs Magoo👹","post_message":"Hillary Clinton tells the public: Don't bring up my health! Then she tells the FBI: My health kept me from remembering the answers to your questions!"}]
