[{"comment_id":"1005938356108252","commenter_b":"She looks like a evil witch","commenter_a":"She is \"special\" she doesn't not have to follow the law.","post_message":"GO TO PRISON!"},{"comment_id":"10153383704554411","commenter_b":"Examples?","commenter_a":"Texas has always been a disaster.","post_message":""},{"comment_id":"10153192759821519","commenter_b":"Ignorant racist pig.","commenter_a":"You show a black Republican and I show you an Uncle Tom","post_message":"\"Ultimately, he has rejected the legacy and burden of the Black Freedom Struggle...\""},{"comment_id":"10153085738765163","commenter_b":"Yep @username. Sophia was a crazy cat lady. Lol","commenter_a":"Renee Rudd","post_message":"SHE WINS. 😂💛😸"},{"comment_id":"10154275464344024","commenter_b":"@username You stfu!","commenter_a":"It's so nice to see that Black Lives Matter to Black People!","post_message":"Two people were killed early this morning, and several others were wounded, in a shooting at a Halloween party in Newburgh, Orange County. Details: @webpagelink"},{"comment_id":"10153287887659614","commenter_b":"Hahahaha @username you made me laugh lol but maybe that's what really happened to these girls too much d*ck sucking lol","commenter_a":"Sucked too many c...ocks ? lol","post_message":"A concerning new trend on social media shows young women trying to imitate the big-lipped pout of 17-year-old reality TV star Kylie Jenner of the Kardashian family. The so-called #KylieJennerChallenge requires suctioning one lips into a shot glass or bottle. Some young women are ending up with painful bruises, photos on Instagram and Twitter show. The challenge could result in injuries to nerves, muscles and trauma to the blood vessels, a plastic surgeon says. Read KTLA's story here: @webpagelink"},{"comment_id":"1170595402996226","commenter_b":"And the world would be a lot better place without your racist, misogynistic ass in it. Twit begone!","commenter_a":"Most admired my ass this stinking bitch allowed 4 people to die she a corrupt lying useless bitch should been in jail or zoo cage right next to the ape in heels","post_message":"Hillary Clinton just won Gallup's \"Most Admired Woman\" poll for the 21st time. Do you admire her?"}]
