[{"comment_id":"1411220458918808","commenter_b":"I honestly think you just don't understand because you have never been through it. Hopefully you never will. It's a tough road as a parent. But My SON JASON is the love of my life!","commenter_a":"why do people with autistic children often talk about \"mourning the death of the child they thought they had\"?? its the same kid. we're not car accidents to be grieved over. we are people.","post_message":"Greg and Maya are doing everything they can to make sure their son with autism is safe, comfortable, and — most of all — happy. Parenting 2.0 | An Upworthy Original Series"},{"comment_id":"10154126600721770","commenter_b":"I agree....classy lady","commenter_a":"Ivanka could hop into a potato sack and make it look good.","post_message":"You couldn't miss Ivanka Trump today."},{"comment_id":"1137036859677480","commenter_b":"She is a nut case","commenter_a":"How many times must we see ..she is done..it's over..and the statement actually be true...","post_message":"BOOM!"},{"comment_id":"10153697633816636","commenter_b":"@username females mature quicker than boys, starting periods as young as 9, some see that as start of womanhood, females have sexual hormones and crushes in early teens so YES it isn't any different... She does need locking up","commenter_a":"I think you mean that she raped the 13 year old boy on an almost daily basis. She is sex offender who groomed then raped her victim, if genders were swapped people would see this monster for what she is and see that the 13 year old is a victim.","post_message":"'I have chills because of this'"},{"comment_id":"1105387789537448","commenter_b":"Truly AMAZING she's still walking free, let alone running for ANY office other than cell block Queen!AND NOW the big 30 minute meeting of billy boy and AG L Lynch in Phoenix while under investigation! DEEP DEEP CORRUPTION","commenter_a":"Using her words when she said\" When Bill left office we were flat broke\". Folks that was less than 12 years ago. Pretty good return on her investments. Instead of President, maybe we should make her the Federal Reserve Chairman.------NOT","post_message":"Allen West Republic @webpagelink"},{"comment_id":"10152608851681636","commenter_b":"we need freedom from jews.","commenter_a":"Mocking the prophet of as violent cult is different to mocking the deaths of 6 million people.","post_message":""},{"comment_id":"10153535805923352","commenter_b":"You dumb wet back bitch and @username you ugly bitch go ahead. Pink monkey bitch","commenter_a":"He is though. What happened to \"freedom of speech\"? Oh it's selective I see.","post_message":"Female middle school teacher forced to resign after telling students that President Obama is a ‘Muslim baby killer’"}]
