[{"comment_id":"907187719304084","commenter_b":"Nope. She shouldn't.","commenter_a":"She shouldn't have to apologize. *kanye shrug* Jay","post_message":"Lindsay Lohan Apologizes For Using The N-Word On Social Media While Referencing New Kanye Song"},{"comment_id":"10154820857971438","commenter_b":"It's got nothing to do with controlling women, it's got to do with being the voice of the silent unborn. Who protects the unborn when they are being ripped apart because the woman who decided to have unprotected sex asks to butcher the unborn. No one has listen to the unborn small scream when they are being tortured inside their mom's womb. Look it up, and after you hear it and see it, you'll realize that a life, no matter how small, MATTERS.","commenter_a":"They don't. It's about control.","post_message":"I am sympathetic to the pro-life argument, but anti-abortion rallies leave me baffled."},{"comment_id":"10153471873556770","commenter_b":"@username - afraid your husband will be deported huh?","commenter_a":"These Clowns are hilarious Dracula aka Cruz and Cruella Devile aka Fiorina ....She was dying for some spotlight....Well she will get if for about another month...Then Bye Bye weirdos","post_message":"During Carly Fiorina’s acceptance speech for running mate with Sen. Ted Cruz, Fiorina sang a made up nursery rhyme to Cruz’s daughters."},{"comment_id":"10155151298004170","commenter_b":"@username And what disappointed me the most was our President never called for people to work together and come together as a Nation. It was like he wanted the divide! So sad for this nation!!","commenter_a":"I figured this out after his first term. If you believe the media, he did a great job. The numbers don't lie. He did zero except stir up racial divide. That is his legacy.","post_message":"Years in office: Eight. Years with GDP growth of 3 percent or better: Zero. The final report on 2016 seals his fate as a historic failure."},{"comment_id":"527878314072059","commenter_b":"Put her in jail!!!!!!","commenter_a":"To recap: Hillary is \"the devil\" and has \"hatred in her heart\" and Trump is going to appoint a special prosecutor to \"put her in jail.\" This is how a democracy slouches into totalitarianism.","post_message":"Your reaction to the second presidential debate?"},{"comment_id":"1776377852617481","commenter_b":"Looks like he's winning. You're probably going to need to build a wall to keep us out.","commenter_a":"They're going to be the ones building a wall!","post_message":"LOL"},{"comment_id":"1018417158220401","commenter_b":"That wall will not get built under Obama . To bad election voting wasn't today!!","commenter_a":"Need to do this America Wide. And build the wall Now","post_message":"BOOM! TEXAS Infuriated Obama And Illegals With Their Plan To Protect Texans- Mess With Texas @webpagelink"}]
