[{"comment_id":"1144826232238207","commenter_b":"There are also many women that have \"potty mouths\" and that too is common knowledge.","commenter_a":"as a woman... I was a bartender for many years and you live in a bubble and you live in denial becasue 85% of men talk like that....BUT...it was all talk...unlike like Bill Clinton. who raped a woman! I believe all the outrage is coming from the liberals who never intended on voting Trump....What sane Republican would say they are now voting for OPEN BORDERS over Trumps 11 year old comment from a man to another man... it is like democrats have moral values all of a sudden! They were words not actions!!","post_message":"Trump's idea of pre-debate prep… BREAKING VIDEO: TRUMP Has Meeting With Women Who Say They Were RAPED, SEXUALLY ASSAULTED By Bill Clinton \"Mr Trump may have said some bad words, but Bill Clinton raped me\""},{"comment_id":"1721472904763525","commenter_b":"^^^Yet he has no blood on his hands. Killary got that cure little nickname for a reason. Several, in fact.","commenter_a":"We can not and must not settle for Clinton or worse Drumpf. The time is near and we must let everyone know, that If Bernie somehow doesn't win the nomination, we want him to run as a independent so we can put him in the White House. Too many people registered as independent did not have a chance to vote in closed primaries, if they did Clinton would not be leading with pledged delegates. The Democratic Party must be aware that if Bernie runs as an independent there is no chance of Clinton winning anything, so if they don't want Drumpf in the White House they should start backing Bernie now. Because there is no way in hell I'll ever vote for Clinton.","post_message":"Here's the promise I made to you on day one of this campaign: Not only will I fight to protect the working families of this country, but we’re going to build a movement of millions of Americans who are prepared to stand up and fight back. We’re going to take this campaign directly to the people – in town meetings, door to door conversations, on street corners and in social media. Right now we are in Indiana. Tune in live here:"},{"comment_id":"628508020691140","commenter_b":"Put her out of the white house","commenter_a":"Michelle Obama is a awesome person she certainly a lady of class.","post_message":"Michelle Obama has just broke the last straw. She should have been kicked out of the White House a long time ago. Do you think Michelle Obama is the worst first lady in history?"},{"comment_id":"1210524342343014","commenter_b":"Maybe she's drunk or high. Don't even look good","commenter_a":"Notice how fb took off the video? CNN reporter admitted Obama paying off the media to only cover bits and pieces of Trump speeches, to keep the media from exposing Hillary's corruption","post_message":"What is wrong with Hillary? She just completely froze AGAIN...her handler had to rush the stage, comfort her, and tell her what to say! WATCH..."},{"comment_id":"10153945249138690","commenter_b":"The Muslims massacring Christians citizens","commenter_a":"She is a Christian with big heart offering kindness and help to the Muslims so would Muslims do the same things to Christians ?","post_message":"When refugees arrive at the Greece-Macedonia border, the smiling face that greets them is that of Gabriela Andreevska. Watch more Al Jazeera Shorts - @webpagelink"},{"comment_id":"386555874837702","commenter_b":"You obviously know nothing about the economy or laws or Russia in general...","commenter_a":"Its nice to see that thier prioritizing With all that going on with thier financial collapse and war in the Ukraine They have made driving xdressed a precedent Just curious... How would one know that the driver is a pyromaniac Will he be the one with the lit flare out the window???!!","post_message":"\"At first glance, it already appears absolutely absurd.\""},{"comment_id":"1125723030801501","commenter_b":"Lord, she's a vile woman.","commenter_a":"Does anyone have the balls to fire this woman for not doing her job. FIRE HER!!!!!","post_message":"Seems Kim Davis may be going back to jail..."}]
