[{"comment_id":"921176444602838","commenter_b":"Bernie or Hillary will destroy the economy with their policies. Plus, they're so weak on immigration and would prefer for the illegal immigrants, who by the way, suck up over 150 billion dollars per year, to stay. Trump is on point with just about everything.","commenter_a":"Michael Luna Can't wait to see what Obama says or these other people just opening the gates to everyone... Donald J. Trump is right on this one, we need to close the border right now...","post_message":"The two men have been training at the base since February and “were screened prior to their arrival in the United States more than a year ago,” according to the statement."},{"comment_id":"1035379929888394","commenter_b":"@username actually if you check the poll aggregates you'll see that Hillary can best Trump.","commenter_a":"Can President Obama become her running mate for her Vice? Or Bill Clinton?","post_message":"The numbers don't lie, but Republicans definitely do."},{"comment_id":"1297641203604631","commenter_b":"She makes me want to throw up.. A big rich phoney.","commenter_a":"She don't make me feel anything. Politics does not dictate what I feel","post_message":""},{"comment_id":"837370303025890","commenter_b":"Your just another Dumb Female","commenter_a":"Slick willy fits him better","post_message":"Just call him Adam."},{"comment_id":"10153577937396162","commenter_b":"I have always said, the best person to fix a budget problem is a single hard working mama! That woman knows how to stretch every last penny to make it count! If you don't need it and don't have the money for it...you DON'T buy it!","commenter_a":"This is why Illinois has a money problem! Corruption and greedy politicians!","post_message":"BREAKING: Former Governor Rod Blagojevich's sentence has been thrown out and he has been awarded a retrial on 5 counts... @webpagelink For the stories you care about - \"Like\" ABC 7 Chicago!"},{"comment_id":"10153655864652217","commenter_b":"Allah the greatest ever 💖💖💖","commenter_a":"“This life is not real. I conquered the world and it did not bring me satisfaction… God gave me this illness to remind me that I’m not number One; He is.” Muhammad Ali You will be missed #Champ #RIP","post_message":"Muhammad Ali was famous for his pre-fight braggadocio, predictions and quips."},{"comment_id":"10153725083142464","commenter_b":"@username YOU'RE A COMPLETE MORON !!","commenter_a":"I remember my thanksgiving in Iraq and the Stan. Prayers for all those away from the families eating thanksgiving in a to-go box","post_message":"Tomorrow and every day, don't forget to say a prayer of Thanksgiving for our men and women in uniform spending the holiday away from home."}]
