[{"comment_id":"10153357244917061","commenter_b":"She should be a shame of herself. A doctor, would not want her to treat me.","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"962229497130510","commenter_b":"LoL","commenter_a":"Hello!?! Everyone has a personal tracking device on them at all times now...it's called a cellphone. They know where you are every second of the day. Even with GPS turned off. They can turn in your camera or mic at will....and they have, do, and will continue to violate your rights with zero accountability.","post_message":"Enjoy your first private phone calls in more than a dozen years. @webpagelink"},{"comment_id":"1311876355490031","commenter_b":"These people should be locked up in cages. We have to be a voice for these poor animals. Set them Free!","commenter_a":"China don't care about shit","post_message":"Tourists take selfies with him"},{"comment_id":"893860944043492","commenter_b":"Theres nothing \"hateful\" about 1) secure the border 2) Enforce the immigration laws. In fact every country, including Mexico, does this. People ARE angry. For good reason. As we see our country being ruined by endless millions of incading illegal aliens.","commenter_a":"Its very simple. 1) Enforce our immigration laws. 2) Secure our borders. By the way, that's how all the other countries try and deal with immigration. The rest of this nonsense is just typical liberal delusions","post_message":"End of a DREAM?"},{"comment_id":"10155061325079575","commenter_b":"Why would he care about dapl? Obviously he has no intention of cleaning up the water issues in Flint, Michigan either. Because who cares about the people of this country and their wellbeing when you're Trump","commenter_a":"They dont want money it is about the water supply and the destruction of it!","post_message":"President Donald J. Trump signed executive actions to advance construction of the Keystone XL and Dakota Access oil pipelines. The projects had previously been blocked by the Obama administration due in part to environmental concerns."},{"comment_id":"878149845586082","commenter_b":":D mu mka kap hernia .. :'(","commenter_a":"Joe Jess","post_message":"This just shouldn't be possible..."},{"comment_id":"1159671620816281","commenter_b":"Why didn't you keep your promise and leave this country? Because you were so sure Hillary was going to win! LOL just please shut up! Get over it! Do you think it you keep going on &. On, things ar going to change? NOT!!!","commenter_a":"Ted danson probably gags thinking of his past. Yes,he used to do the deed with that😁","post_message":"Whoopi definitely gets what she has coming after she made this dim-witted attempt to insult Trump. She so deserves the humiliation. Let's get 5,000 'LIKES' to show that America wants \"The View\" CANCELLED PERMANENTLY! @webpagelink"}]
