[{"comment_id":"10153538979824117","commenter_b":"I feel like this world lacks sufficient moons for McAfee to howl at. I hope one day he can find his way home.","commenter_a":"Bye Felicia.","post_message":"Unverifiable accusations of skulduggery aimed at former Gov. Gary Johnson, and competitor John Mcafee says he cannot support the Libertarian Party if Johnson is the nominee."},{"comment_id":"1027700850605035","commenter_b":"Russia does not need turkey; Turkey are the back stabbers lying pigs!","commenter_a":"But Russia will miss alot if they cut relations wz Turkia","post_message":"Russia's Foreign Minister Sergei Lavrov has rejected the possibility of normalizing relations with Ankara after Turkey downed a Russian warplane inside Syria."},{"comment_id":"10152933844790667","commenter_b":"He probably figured he could demand equality for animals, since now people of same sex can get married. Next, it will be polygamy. Watch the Muslims in the US asking for equality.","commenter_a":"Yep could have gone all day w/o reading this. sick","post_message":"Crawford posted an ad on a popular website soliciting a willing horse owner, according to officials."},{"comment_id":"10153238439315950","commenter_b":"seeing as every single non 1st nations person is an immigrant they need to stfu","commenter_a":"Guess you \"forgot\" to mention yr phony ISIS had 20,000 twit-sites taken out by Annonymous? CIA must be a tad depressed today? Not to worry guy's....it's only REAL NEWS! We can find it anywhere but here. Jokers! Shame on the lot of you!!!","post_message":"UPDATE: More states are saying \"no\" to Syrian refugees in the U.S., call for stricter screening @webpagelink"},{"comment_id":"10153586503151336","commenter_b":"Lmao @username is a pussy cuz a girl made it","commenter_a":"@username @username Cody Wilkerson","post_message":"Two women have made military history by becoming the first female soldiers to complete the U.S. Army's grueling Ranger Course."},{"comment_id":"2070583743040341","commenter_b":"Go Back to your own Country!!!","commenter_a":"What scum is voting these things into office?","post_message":""},{"comment_id":"1009117072471350","commenter_b":"How typical for illegals to play the race card while obviously not understanding the term racist.","commenter_a":"No one in their right mind should support Trump","post_message":"Add Lindsey Graham to the list of Republicans who say they will not support Donald J. Trump."}]
