[{"comment_id":"10153040559681130","commenter_b":"Religion, Kartrashians, J.Lopez, M.Cyrus, and their ilk. Male dicktators ruling./ruining countries...","commenter_a":"I want to see a world without religion or Kardashians.","post_message":"Do you want to see a world without elephants, rhinos or gorillas?"},{"comment_id":"624507887756570","commenter_b":"She's a globalist evil one","commenter_a":"Obama don't put the flag on either!!","post_message":"Did you notice THIS?!?!"},{"comment_id":"10153885822754087","commenter_b":"Lmao.. She's a moron","commenter_a":"@username hysterical","post_message":"Hillary Clinton took things a bit too literally during a recent campaign stop when she read the word “sigh” off her TelePrompTer instead of actually doing one. WATCH:"},{"comment_id":"10153847287078984","commenter_b":"She's a lying bitch","commenter_a":"Yes I Support Grey I agree He is doing what is expected of any Lawyer expected I","post_message":"BOOM! 'Bulldog' Gowdy just welcomed Hillary to the Benghazi Select Committee hearing in a way that probably had her wanting to run and hide. He had his chance to address her right to her face, and he did NOT hold back. Do you support Trey Gowdy's fight to unveil the truth about Benghazi?"},{"comment_id":"552998604866610","commenter_b":"How dare you sir!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Another \"unverified story\" from Dr. Carson. Reporters visited the library and the librarian at the desk does not recall the event at all. Never happened! Carson lied and people died!!!","post_message":""},{"comment_id":"530303733802764","commenter_b":"Today is your Birthday? Well, then Happy Birthday!!!","commenter_a":"Happy birthday! God bless","post_message":"My birthday wish is that our nation would once again recognize God as our leader."},{"comment_id":"1321112227930500","commenter_b":"I reckon there's still a chance he'll be persuaded to step aside, and Pence will be inaugurated on Jan. 20.","commenter_a":"Looking forward to the impeachment.","post_message":"It's official"}]
