[{"comment_id":"10153882907494024","commenter_b":"The monkey bitch and her brood can't be gone soon enough for my taste.","commenter_a":"She complains about the \"house\" she lives in. Is she chained to the wall-?? Just move, bitch-!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"713883512069088","commenter_b":"@username you don't look old enough to know what that women has been doing for the last 40 years.You better hope she isn't the next President she is going to bring in 65,000 more illegal immigrants so when they molest part of your family and the police can't do anything about it. Because she has tied their hands what are you going to do. Blame someone else like she does.","commenter_a":"Why don't the democrat fools stop beating on Trump all the time , They would love for him to drop out then we would have crooked Hillary running every thing, She will never be my president she is the biggest liar on this earth and the lowest scum on this earth ! !","post_message":"Donald J. Trump's campaign chairman Paul Manafort said the report that the GOP nominee asked about using nuclear weapons in a security briefing is \"absolutely not true.\" @webpagelink"},{"comment_id":"10154067213591770","commenter_b":"@username take out Ca and she lost that too illegals told ok to vote by Oblamo","commenter_a":"I'm so fed up with hearing about the \"popular vote\". Our constitution was NOT set up that way, so please stop talking about it. IT DOESN\"T MATTER. Let me break it down for the simpletons. Suppose you live in a homeowners association. If there is an issue, each home has 1 vote, decision is made fairly. However, if it was a \"popular vote\", then each resident would have a say. If you lived by yourself, you'd possibly be outvoted by your neighbors who had a houseful of 5 people, everytime there was a vote. Which would you prefer? That's how our republic is set up: each state has a FAIR vote in electing the president. Forget the popular vote, unless we change the constitution.","post_message":"Liberals did not like what Ann Coulter tweeted."},{"comment_id":"10153527137233717","commenter_b":"Hell no! The real woman for the job is Hillary! #Hillary2016","commenter_a":"Please support Carly Fiorina tomorrow! Non establishment, proven leadership. Fight against the machine with a level headed conservative. Please support Carly! She needs your help to place in the top 4!","post_message":"Donald J. Trump is holding a rally at the Verizon Wireless Arena in Manchester. Watch live: @webpagelink"},{"comment_id":"1414624065217353","commenter_b":"Oh please better vetting will even make the refugees safer. The ban is temporary and no one will die..","commenter_a":"I am against legislation or executive actions that do not have broad support from both sides of the political spectrum.","post_message":"The President's Executive Order against immigrants and refugees is contrary to American values. Do you agree? Take the survey: @webpagelink"},{"comment_id":"10154146270706218","commenter_b":"@username change the fucking tampon","commenter_a":"President Obama and First Lady Michelle are a class act and what a President should act like with intelligence, calmness and responsibility to the American people, not the train wreck we currently have.","post_message":"Do you miss Barack and Michelle Obama?"},{"comment_id":"1607924772836368","commenter_b":"Yes young lady you can , just don't lie to the FBI , don't help rapist do 10 months for raping a 12 year old, don't stay with a man who had many affairs. There Are many women who can be great presidents , Hillary just isn't one.","commenter_a":"Not if you win Hillary! I fear that your election might irrevocably tarnish the idea of female presidency... Bear in mind of course, that we have to deal with a reality where people automatically stereotype and generalise...","post_message":""}]
