[{"comment_id":"1350273158317846","commenter_b":"It's about time this evil and corrupt woman FINALLY gets the justice she deserves!!!","commenter_a":"The corruption is rampant which explains why she could run...and sadly win her party's nomination","post_message":"With just five days to go..."},{"comment_id":"1144542405568548","commenter_b":"@username bull","commenter_a":"Hilary should start a new centrist party for disenfranchised republicans, and the DNC should back Bernie. He stands for unions, while she slept thru Walmart union negotiations and stayed mute. He marched and protested for civil liberties while she was a Goldwater Girl. And the Clintons made shady insider trading deals with Tyson way back in the day to kick start their career. The only thing that makes her a democrat is her stance on women's issues. When it comes to war, trade agreements, corporate welfare, and dark money, she's a republican.","post_message":"\"That's what the American people are saying.\""},{"comment_id":"439236556264638","commenter_b":"Put her in prison where she belongs.","commenter_a":"We need Hillary this country can't survive another repuck in the white house","post_message":"This is INSANE..."},{"comment_id":"10154060269921162","commenter_b":"BANG...! that's all","commenter_a":"Two things that are impossible... To rehabilitate a terrorist or a child molester. Both should be shot on sight...","post_message":"DISTURBING: Thousands of digital images that show children as young as 5 years old engaging in sex acts with adults were found in an Indiana man's home... @webpagelink"},{"comment_id":"975345569191587","commenter_b":"Mr, Dugger wanted a woman with no personality.","commenter_a":"Depends on what viewpoint your looking at. A successful marriage is not solely dependent on sex which is something your husband didn't know or taught to his son","post_message":"Michelle Duggar also says she's saving she and husband, Jim Bob’s, 'intimacy notes' to share with her daughter, Jill. Can you say, “EW!”?"},{"comment_id":"10153082513017169","commenter_b":"Another sold out POS that wants another war. Shoot the c**ksucker.","commenter_a":"Poor outcomes across the board.","post_message":"What does Scott Walker believe? Where the candidate stands on 10 issues (From PBS NewsHour)"},{"comment_id":"1056321874481529","commenter_b":"Why don't you purify yourself in the waters of Lake Minnetonka?\"","commenter_a":"All lives matter","post_message":"Hillary Clinton and Donald Trump face off now in the first presidential debate of the 2016 campaign:"}]
