[{"comment_id":"10153141758042994","commenter_b":"unfortunately my tax dollars go from her welfare check to paying for her prison cell...I have no sympathy for her whatsoever... I feel sorry for her living children..","commenter_a":"Where's daddy? Protector supporter?","post_message":"\"My client has suffered from serious depression, long-term chronic,\" Steve Kaplan said. \"She's also less-than-average in intelligence.\""},{"comment_id":"10153519290756336","commenter_b":"Good He caught Her now She cannot steal Anyone Elses's Identity","commenter_a":"You are a thief ! .... end of story","post_message":"\"You picked the wrong guy.\" FOX 4 News reporter Steve Noviello confronted a woman who allegedly stole his credit card on camera."},{"comment_id":"734527313335610","commenter_b":"Corina doesn't have a head occupying her brain. She doesn't seem to be aware that Jews have been \"occupying\" that region for 4000 years.","commenter_a":"State who creates biggest terror in the world since 1948 doesn't know anything about human rights.","post_message":"Iranian President Hassan Rouhani famously said in 2013 that ethnicities, all religions, even religious minorities, must feel justice..."},{"comment_id":"10153711356708188","commenter_b":"@username I completely agree. I about had a heart attack when Rand Paul supported McConnell over Bevin. I knew then that he was nothing at all like his father and he would never get my vote. This whole thing is reaffirming my belief that I should not vote Republican again. It will never self correct and I will never vote lesser of two evils again. So, now I wait for the third party candidates to get their faces out there. I hope one of them has the fervour of Trump, the Constitutionality of Ron Paul, and the knowledge and heart of Chuck Baldwin. And, no I won't even though Cruz seems to be on the right track, I won't vote for him if he remains a Republican... not that he would EVER get the nomination.","commenter_a":"Did you really need to sneak in a little attack on Rand Paul?","post_message":"Gee, let's see freedom caucus- you asked us to help you kick out the speaker of the house, then you asked us to do our homework on Daniel Webster. You told me that this is who you needed and wanted. I did. I spent hours in conversations, study and prayer because YOU ASKED ME TO. The listeners did too. I put my credibility on the line for you because you asked me to. Then you just pull out and go for the ROMNEY PICK? You told US to stand up and fight. We did. Now YOU sell us out too? Really?!?! The \"fix\" the republic needs is Paul Ryan? The man who never met a bailout he didn't like? A man who asked to be made king? 100% support and you can't vote him out? Your solution is MORE POWER FOR THE SPEAKER?!?!?!? I am quite frankly pissed and I ..."},{"comment_id":"900706196692300","commenter_b":"So, David, share some more of your white Texan wisdom. What is a \"real woman.\" Please, mansplain it to us.","commenter_a":"I still have trouble with why anyone would want to become an elderly woman.","post_message":"\"I think [Bruce] Jenner has a right to do what Jenner wants to do, and the way Jenner wants to do it.\" -Jeffrey Tambor"},{"comment_id":"10153182690520667","commenter_b":"Good grief","commenter_a":"Eric Stewart lol","post_message":"\"This game should not have been played at the airport.\""},{"comment_id":"10153333360391130","commenter_b":"@username, how is she a cheat? Please validate your contention.","commenter_a":"She's a bit of a cheat though and how she treats officials... Great player, not a great person","post_message":"These attacks aren't anything new."}]
