[{"comment_id":"1878310592388061","commenter_b":"Deport this muslim.","commenter_a":"The Quran should not be recognized as","post_message":"First Somali-Muslim Lawmaker Who Married Her Brother Was Just Sworn In, And Americans INSTANTLY Noticed What She Had Her Hand On Top Of! This is ILLEGAL! Sharia is non compliant!"},{"comment_id":"10153864649566336","commenter_b":"God places all sorts of obstacles in our path, so that we may become stronger and have a better understanding of faith.","commenter_a":"Ironic that people are praying for God to bless her, if he could do anything don't you think he would've avoided her getting it at all??????","post_message":"“I hope that I can fight it off,” eight-year-old Chrissy said."},{"comment_id":"10154665799440141","commenter_b":"We need to stand by our country and our values. Anyone who is allowed into the United States needs to be totally vetted first. I'm sorry, all of you \"open-minded\" people, this just makes sense. Because we are 'Merica!!!","commenter_a":"Islam is evil","post_message":"“All over Europe, all over America we have seen the devastation of evil in our time which is radical Islamic terror.\" Sean Hannity hosted this heated panel on the rise of radial Islamic terrorism."},{"comment_id":"10154156171661509","commenter_b":"Who ever used the word 'liberal'? Labels are so 90s. I support Bernie because of his integrity, his consistency and his sincerity. I see none of those qualities in Hillary. I see the opposite in Hillary. I support Bernie because of his policies. Hillary uses too many weasel words when she talks about policy. She likes to leave the door open because she plans to make a hard right as soon as she's elected. She owes too many favors to the banks, corporations and wealthy investors who back her. They need a return on their investment and good ol' Hillary will no doubt deliver the goods.","commenter_a":"The media is dying to have Bush v. Clinton 2.0 so badly but I've never met anyone in person who thinks either of them would make a good president. It's a media manufactured dream match. Both of them would be bad for America but good for ratings. as long As I live I never want to hear the name Bush again and Clinton's got way too much baggage. Policy-wise Hillary is just a kinder face to the same neocon agenda that Bush would be peddling. Sanders is our best hope. Let's stop moving Backwards, let's move forward!","post_message":"Jeb Bush says Hillary Clinton is a \"smart person\" but is \"beatable.\" @webpagelink"},{"comment_id":"10155410892145500","commenter_b":"Arthur, your mother should have swallowed you.","commenter_a":"Once again. ..guns being used against the family...even if its unintentional. ...there are way too many unnecessary guns out there. ...","post_message":"BREAKING TONIGHT: A 9-year-old boy has accidentally shot his 54-year-old grandfather in the woods in Dade City. Story: bit.ly/1GIYKqL"},{"comment_id":"10153124356001336","commenter_b":"IDIOTS PUT IDIOTS IN OUR WHITEHOUSE!!!","commenter_a":"It is not up to obama it is supposed to be congress and senate this is illegal","post_message":"\"Please just give this soldier the dignity of life! We give it to these guys down in Gitmo!\" Montel Williams questioned how Amir Hekmati, a Marine held in Iran's worst prison, is still in captivity while the Obama administration makes a deal with Iran. #FreeAmirNow"},{"comment_id":"1417299944952004","commenter_b":"They are illegal immigrants. Reagan granted amnesty in the 80's and it was to be a one time thing for those already here. Settled once and for all. But they keep coming. And this problem is not just from Hispanics although they make up the majority of inflow. If they couldn't come legally then they shouldn't be here. People have been coming legally for 100 years (like my father and his parents). No excuses. They are breaking the law and need to be deported.","commenter_a":"All he has is big ego","post_message":"Dude! Really??!"}]
