[{"comment_id":"1244207775611835","commenter_b":"That's why she wants to let them all in and use up our benefits and drain it. Enough is enough.","commenter_a":"Well just in case you needed another reason to NOT vote for Hillary here it is. But sadly, this nation is over run with uneducated and uninformed voters who will vote for free stuff that is anything but free to to american taxpayer.","post_message":"Obama used executive actions to grant amnesty to millions of illegal immigrants WITHOUT Congressional approval. Hillary Clinton says she will go EVEN FURTHER!"},{"comment_id":"10153603991313132","commenter_b":"The tiger has been locked behind a cage for who knows how many years and when finally released he stood his ground and protected himself and they kill him for it? Animals no matter how small or what purpose do not belong in cages! Let's put a human in its place and see if they don't come out biting.","commenter_a":"Those animals need to be free not in a cage. Poor tiger, it was instinct. I feel for the man and his family too but it's not the tiger's fault. No zoos, circuses for me.","post_message":"\"It seized him by the throat,\" an eyewitness said."},{"comment_id":"1877280792500982","commenter_b":"Hes an alien!!","commenter_a":"Can't hear clearly","post_message":"Paul Ryan is speaking."},{"comment_id":"1176027829155419","commenter_b":"Smart woman","commenter_a":"Big deal!!! She had a right as an American citizen to vote but who she voted for is no one's business but hers.","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"1299289040084712","commenter_b":"It was an independent anti-Trump, Political Action Committee. The chair said she doesn't support Ted Cruz. She is only anti-Trump.","commenter_a":"they attacked Melania first and Trump has as much right as Cruz does to protect his wife. If they don't want to get attacked don't attack him !!","post_message":"Nailed it, Senator."},{"comment_id":"10154979630864218","commenter_b":"@username That damn Clinton how dare she think she is above the same laws we have to abide by....","commenter_a":"Face it the Democrats failed policies and over regulation aka job killers have finally awoken the American Voters in rural America their the ones truly hurting","post_message":"Maryland remains a deep blue state politically, but President-elect Donald Trump was able to flip white working-class votes in parts of Maryland, including eastern Baltimore County."},{"comment_id":"1071771339501789","commenter_b":"@username Blacks are Americans, so are whites on assistance, and American Latinos. I would rather support 20 million of them than 1 illegal Anchor baby and it's Family. Maybe all those Americans on assistance wouldn't need assistance if the illegals weren't taking the jobs Americans need.","commenter_a":"My mother was a volunteer Pink Lady at the hospital in Weslaco Texas and she verified several times to me that Latinos routinely arrived in labor so they had no time to get back to Mexico. They wanted their babies born in America.","post_message":"Astonishing video proving Donald J. Trump is right... Ten percent of the people born in America today are to children of illegal aliens..."}]
