[{"comment_id":"10153407697891519","commenter_b":"Hope it's a woman.","commenter_a":"I'd like to hear Feines' opinion on this. I would also like to know what other actors were applying for the part.","post_message":"We're actually embarrassed for everybody involved..."},{"comment_id":"10152734752677434","commenter_b":"Lol","commenter_a":"Hmmmm I actually do think he's kinda sketchy re: women. If he's so power to the people, then where was he when Gore or Kerry ran? Just sayin","post_message":"Bernie Sanders wrote an essay in 1972 that mentions rape, and it's weird as hell"},{"comment_id":"10150520192784999","commenter_b":"Muslims are killling every one left and right, with in and out side religion people. They should not live in the well of ignorance and they should accept other cultures. Most of the muslim managed countries are in bad shape, their contribution to the science and technology is zero. All the gulf countries were on donkeys before and now with oil they have money but the cannot compete with any one as they live with women, wine all the time. They fund money to third world country people to kill others and they sit and watch. No religion is bad, all we need is education and awareness.","commenter_a":"Who is #muhammad(PBUH) : He is the one who defended the rights of all humanity 1400 years ago. He defended men's, women's and children rights He commanded and fostered the love between relatives and neighbors.He established a coexistence relationship between Muslims and Non-Muslims He organized the relationship between the members of the family putting duties on sons and daughters towards the parents He fought injustice, called for justice, love, unity and cooperation for the good. He called for helping the needy, visiting the patients, love and exchanging advises between people. He prohibited (by orders from God) bad manners such as stealing, lying, torturing and murdering.He is the one who changed our lives and manners to be better. A Muslim doesn't steal A Muslim doesn't lie A Muslim doesn't drink alcohol. A Muslim doesn't commit adultery A Muslim doesn't cheat A Muslim doesn't kill innocent people A Muslim doesn't harm his ...","post_message":"How governments and other authorities in Mideast countries responded to the new Charlie Hebdo Officiel cover."},{"comment_id":"10153258414916770","commenter_b":"she more democrat liberal pig","commenter_a":"Megyn Kelly shouldn't be permitted to go anywhere near another GOP debate for the rest of her life after the debacle of the last one she was allowed to moderate..The sooner Fox News fires her off into oblivion the better..","post_message":"Donald J. Trump reignites the drama between himself and Megyn Kelly ahead of the January 28th Fox News Republican Debate."},{"comment_id":"10153475201369170","commenter_b":"Unreal. Liberal democrats are NOT AMERICANS!!","commenter_a":"And how many admirals and generals have been \"retired\" for their conservative, pro strong military views during the current administration?","post_message":"How can we have possibly let it get to this point?"},{"comment_id":"10153384667464726","commenter_b":"I can't tell you how little I care about what this silly woman says.","commenter_a":"it,s more convenient being black these days!!!!!!!!!","post_message":"WATCH: Controversy is swirling in Spokane over the local NAACP president. She says she is black but her parents say otherwise..."},{"comment_id":"10156066398495354","commenter_b":"Just can't handle the truth or face reality can you, imagine that, a black playing the race card, what a shocker!","commenter_a":"Ramos may be Hispanic, but he is also rude and disrespectful to the other reporters in the room.","post_message":"Or maybe... because they attacked him first?"}]
