[{"comment_id":"1414587195226950","commenter_b":"2 all the women in pink why not just pack up ur pink panties and move 2 Cuba now that we have relations again I hear it's a paradise.","commenter_a":"GROW UP","post_message":"Female supporters of President Donald Trump aren’t sure why the Women’s March was necessary."},{"comment_id":"914235348632517","commenter_b":"So sad","commenter_a":"He'll claim it was medicinal for his PTSD.","post_message":"Bowe Bergdahl, the U.S. soldier who was released in a prisoner exchange in Afghanistan for five Taliban detainees, wound up in the middle of a pot raid earlier this week @webpagelink"},{"comment_id":"1203529499735652","commenter_b":"Shut the fuck up","commenter_a":"I guess none of you that are bashing Trump know enough history to know that China has a pattern of testing US resolve after every election. (usually between feb and march) Trump brilliantly turned the tables on them. It will be even clearer when she visits trump next month. Chinese government has a mouth that writes checks it can't cash and Trump has called their bluff.","post_message":""},{"comment_id":"1151612978215863","commenter_b":"Nah, Katie. You want to talk about the real world?? Hillary Clinton is the candidate of the \"real world,\" where people DO suffer, most certainly. They are primarily people of color. They are Arabs and Persians living under constant threat of US drones. They are black youth who have been dubbed super-predators by Hillary, who have been beaten and bloodied by the police that she helped arm, and that she helped expand. They are Hondurans and Egyptians and Libyans who have been subjugated by the regimes in their countries, regimes that only exist because we can't seem to keep our fingers out of everyone else's pie. Neoliberal policy has caused more suffering in this world than even Trump promises to bring. Secondly, voting in line with ones genuine ideology is not reprehensible in the slightest. If everyone understood that, maybe we wouldn't be stuck in the two-party, lesser-of-two-evils rut that ...","commenter_a":"Lmao, fat chance on that one. His endorsement solidifies that he has been enveloped into the Democratic Party, where social movements go to die. His most ideologically loyal supporters will be voting for #JillStein, because #NeverHillary , and #NeverTrump","post_message":"Most of the #FeelTheBerners who now say they’ll go third party would otherwise be backing Clinton."},{"comment_id":"501241236691320","commenter_b":"Yeah but the bride wore a short white dress with cowboy boots","commenter_a":"Why you live a better life you dope","post_message":"I know I've never had pizza at a wedding... The GOOP | Liz"},{"comment_id":"1619560758331037","commenter_b":"This bitch needs to be taken down so sick of her throwing other people under the bus she's just as guilty as them. Take her out!","commenter_a":"SHE MAY RUN...BUT YOU DO NOT HAVE TO VOTE FOR HER! THE RED CARPET WAS YANKED OUT FROM UNDER HER BEFORE...IT CAN HAPPEN AGAIN! BENGHAZI MURDERESS IS NOT PRESIDENTIAL MATERIAL!! THE CLINTONS N' OBAMAS ARE FINISHED!!","post_message":"Hillary Clinton MUST be stopped!"},{"comment_id":"10152876069325950","commenter_b":"Enjoy your retirement Bob","commenter_a":"A straight shooter w/ a sense of humor and a poet to boot. Sunday won't be the same. We'll miss you, Bob.","post_message":"Bob Schieffer's 46-year career at CBS ends this morning with the 10:30 a.m. ET broadcast of \"Face the Nation.\" As we say goodbye, here's a lighter reflection with some of his best bloopers across the years."}]
