[{"comment_id":"10153226517872232","commenter_b":"Probably...","commenter_a":"And while all were watching the fight 1 or more were most likely walking out with merchandise","post_message":"CAUGHT ON VIDEO: Several women got into a brawl Friday afternoon inside the popular Rittenhouse Square clothing store, Zara --> @webpagelink"},{"comment_id":"10153134542104705","commenter_b":"Marianne Hutchinson maybe you should move to NZ???","commenter_a":"Merriam Mistlebauer","post_message":"The only thing we have to fear is fear itself.........and spiders."},{"comment_id":"1160837804033382","commenter_b":"This is so STUPID....If you dont like America LEAVE","commenter_a":"National Guard please.","post_message":"Protest in dc"},{"comment_id":"1629129360707510","commenter_b":"she is a piece of trash and nothing can change that","commenter_a":"Who cares","post_message":"This Is Unbelievable!"},{"comment_id":"472703329582291","commenter_b":"How does Trump make Mexico pay for the wall, When America has no authority over Mexico ?","commenter_a":"We need the good people of Florida to Vote Trump!","post_message":"FLORIDA: Early voting is now open! Do not miss this opportunity to #MakeAmericaGreatAgain #Trump2016 Ivanka Trump Find Florida early polling locations: @webpagelink"},{"comment_id":"10153659318868797","commenter_b":"You did a great job by taking this dog to the Vet, as well as putting you life at risk from being hit by traffic. And having to pay the bill just for an irresponsible person","commenter_a":"At least someone cared","post_message":"MUST SEE: This puppy was hit while wandering through traffic. A woman stopped to help, and even took the dog to the vet. Then, she held him in her arms as he died. The woman blasted the dog's owner in an angry letter she posted online, and it has since gone viral. Wow, you're going to want to see this:"},{"comment_id":"1715281765380661","commenter_b":"These adulta should be ashamed of themselves! Hoping whatever league they are in bans them from attending any more games!!!","commenter_a":"What a bunch of degenerate so called parents and adults. Useless to kids and society","post_message":"WATCH: Brawl breaks out between coaches at an under-10 baseball game. The stunned little kids don even know what to do. The video was provided to ABC News by a spectator. @webpagelink"}]
