[{"comment_id":"10153633611351337","commenter_b":"Joey Nicgorski Edward Contreras","commenter_a":"Thank god!","post_message":"POSSIBLE REUNION? Slash reveals that he and Axl Rose are buddies once more. What does this say for the future of Guns N' Roses?"},{"comment_id":"10153194187981600","commenter_b":"It;s not an assault rifle as assault rifles are illegal,","commenter_a":"So, not really sure why there is this distinction of it being an \"assault rifle\" and not...\"He pointed a gun at the officers\"???","post_message":"Officers heard the distinctive sound of a rifle being charged or a round being chambered, they reported."},{"comment_id":"572993952849381","commenter_b":"She needs a stiff dicken","commenter_a":"Such class....................................................NOT!","post_message":"This woman just needs to STFU."},{"comment_id":"1755814751326418","commenter_b":"Not my words but totally agree. Found this on another FBook site. VOTE YOUR CONSCIOUS NOT YOUR PARTY! Don't be influenced & persuaded, been going on far to long. WHY WOULD YOU VOTE FOR HILLARY WHEN.... Most cover ups & lies by a family in America's history. If you are #Gay, why are you voting for Hillary when she wants to bring in 1,000's of refugees that believe all Gays should be executed? Criminalizing Christians who don't believe this? If you are #Black, why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood when they want to abort as many black babies as possible. Exterminate the black race because they are like \"weeds\". Most of those clinics are in Black neighborhoods? If you are a #Christian, why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who dedicated his ...","commenter_a":"Can even stand to listen to her! *wave*","post_message":"Watch: Hillary Clinton speaks during a campaign rally."},{"comment_id":"10154969261836320","commenter_b":"So sad Amen","commenter_a":"Dammm i had no idea","post_message":"We're remembering actress Brittany Murphy who tragically died in Los Angeles on this date in 2009. She was just 32."},{"comment_id":"10153560422922629","commenter_b":"Hell yeah bitch","commenter_a":"This post glorifies violent masculinity.","post_message":"Two apparent members of the U.S. Marine Corps reportedly overpowered and halted the gunman."},{"comment_id":"817070211680479","commenter_b":"Who cares about this slut","commenter_a":"POS","post_message":"“I hate everything about this country.” Rapper Azealia Banks Tells Playboy Why White America Owes Her Reparations… How does someone who makes millions in America get away with saying she hates everything about our country?"}]
