[{"comment_id":"10152932184944753","commenter_b":"BTW wasn't she on her way to see her Bf why not just let him pay for a cab instead of letting her ride on the subway while she's drunk and tired from all of the dancing in the party. I bet most of the people on that car where on the way to work and did not want any problems that early in the AM","commenter_a":"The foo recording is a straight both would've at least socked that lame ass predator","post_message":"What would you do if you witnessed this happening?"},{"comment_id":"10150832975979963","commenter_b":"Something tells me that the Bulletin of Atomic Scientists probably knows more about \"international nuclear weapons relations\" than you do.","commenter_a":"Anyone who thinks that this is \"Trumps fault\" doesn't know much about international nuclear weapons relations and the money exchange that goes with it, be it legal or not. Trump wasn't president then....","post_message":"According to the Doomsday Clock there's an increasing probability that the world will observe nuclear conflict."},{"comment_id":"969099383223240","commenter_b":"Lock her up !","commenter_a":"there were 2 ac130's in Sicily only 2 hours away that would have wiped the attackers from the face of the earth had they been deployed","post_message":"Every American needs to know this before the election!"},{"comment_id":"10153328651014342","commenter_b":"wonder if her phone was busy? congress write the laws why is no one talking about them?","commenter_a":"Well he calls after someone writes the words to say....the deputy was killed on Friday night and this is Monday....","post_message":"Today, President Obama called the widow of fallen Harris County Sheriff's Office Deputy #DarrenGoforth. After that, he released the following statement: \"This afternoon, on my way to Alaska, I called Kathleen Goforth, the widow of Harris County Deputy Sheriff Darren Goforth - a veteran law enforcement officer who was contemptibly shot and killed over the weekend. On behalf of the American people, I offered Mrs. Goforth my condolences, and told her that Michelle and I would keep her and her family in our prayers. I also promised that I would continue to highlight the uncommon bravery that police officers show in our communities every single day. They put their lives on the line for our safety. Targeting police officers is completely unacceptable - an affront to civilized society. As I said in my State of the Union Address, we've got to be able to put ourselves in the shoes of ..."},{"comment_id":"10153208287689087","commenter_b":"@username ... Trump was the topic being discussed. TRUMP didn't start wars.","commenter_a":"Rand Paul.. u r not only a sore loser, u r also a isolationist. We di not want America to be a isolationist nation. We like Trump and his \"make America Great Again\" message. We are REAL Republicans wanting real RESULTS, not words.","post_message":"“The message hasn’t penetrated yet that Donald Trump isn’t one of us. He’s barely a Republican. He’s been a Democrat,\" Rand Paul said. “I think ultimately when voters fully grasp who he is and what he supports, I think they’ll run away with their hair on fire.\""},{"comment_id":"1113788628681311","commenter_b":"I will be voting for a true American who has respect for our military n veterans who's goal is to make America strong again for we the American people n the future of our country n children bring jobs back. close our borders Build the WALL My Vote like many Americans who are sick of our do noting liberal government Will vote Trump Go TRUMP","commenter_a":"Indiana, go vote Trump over lyin' Ted and Kasich! Time to send Donald to the White House. We're tired of all talk and no action politicians! #TRUMPTRAIN","post_message":"Last week we had huge wins in Connecticut, Delaware, Maryland, Pennsylvania and Rhode Island. It has been an amazing week in Indiana. We have traveled all over the state visiting Indianapolis, Evansville, Fort Wayne, Terre Haute, South Bend and beyond. I was endorsed by many sports icons including the legendary coach Bobby Knight, long-time Purdue University Basketball Coach Gene Keady, former Notre Dame Coaches Digger Phelps and Lou Holtz, and actor and former NFL player Fred \"The Hammer\" Williamson. I also received support from many Republican leaders across the country, who believe we will unify the party and defeat Hillary Clinton in the fall. The latest polls indicate this to be true. According to the latest Rasmussen poll, I beat Hillary easily and with your support we can widen this margin and Make America Great Again! It is so important to me to win Indiana. Not only would it solidify ..."},{"comment_id":"1649233105382359","commenter_b":"@username well it doesn't seem to be on the minds of the ones that are. If it was they might not have sex at that moment","commenter_a":"That is nothing to brag about. You should find some other talking points to criticize Trump on. Abortion should be the last thing on a 14 yr old girls mind.","post_message":"Actress Ali Wentworth: When Trump Won My 14-Year-Old Daughter Complained There’d be “No Abortions!”"}]
