[{"comment_id":"1237783792909359","commenter_b":"Now the Muslims are going to come here and outbread us? ....is that their big 1000 yr plan? ....lol","commenter_a":"Tell that to my neighbors in Roanoke,VA that got stabbed this weekend . The terrorist is being investigated by the FBI for terrorism....Only when the national news reported the terrorist attempted to behead not stab the man did the local liberal rag paper update their reporting.","post_message":"The United States faces many threats, but terrorism is not chief among them, according to VP Joe Biden. @webpagelink"},{"comment_id":"10152660516532894","commenter_b":"After u,dumb bitch!","commenter_a":"Girl,run b4 they kill u! Run girl! Run!!!!!","post_message":"Look at God: 26-Year-Old Mother of 4 Quit McDonald's Job to Take Care of Her Disabled Son, Hits $561.4 Million Powerball Jackpot"},{"comment_id":"939835422761174","commenter_b":"Damn...you are still at it? Get off the computer and go talk to the young men whose lives were destroyed. Go peer at those missing eyes. Go stand near the them who lost legs. Listen to the stories of the PTSD stricken. Then come speak this hunger for war. I took an oath to support and defend this constitution. I have great pride when I see little American children stumble to daycare with their backpacks on. I also know, the threat to us doesn't lie in a desert. No donkeys can cross the ocean alive. It's in the profiteers. Those folk who rattle dangers but are too old to pick up arms. Defending our country has been my lifelong business, but I won't say it's been without questioning where the profit is going! Re-read Sodom and Gomorrah. It wasn't about being gay...it was about PRIDE and INHOSPITALITY both of which ...","commenter_a":"You all should do a little research on Trump, did you know that when his father died Trump stole his brother's inheritance and did not get anything to his brothers kids either. He is a greedy bastard. The pathetic part of all of this is that this ignorant population who is supporting him right now think that he is going to do more for them. He doesn't give a rats ass about any of them at all whatsoever. He would structure tax laws and policies that would for their benefit him once he left the White House if he ever made it to presidency. And all those morons who voted for him would sit there with their asses handed to them.","post_message":"LOL! Somewhere, Pres. Obama is rolling on the floor with laughter! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"960437774039688","commenter_b":"Get the delegates and you win.. How would they screw him if he gets the necessary votes?","commenter_a":"If after winning FL, MO, NC and IL, Trump does not get nomination, Rubio and Kasich do not drop out... I with all my family and friends will never vote for GOP.. We will be life time democrat..Trump is better than all GOP candidates , if not trump than Clinton or Bernie is fine for me because GOP does not count out votes as votes... They want to do what they want.. They don't hear our voice...","post_message":"\"Donald Trump is one of the two most talented presidential candidates any of us have covered.” Mark Halperin Bloomberg Politics Managing Director Editor"},{"comment_id":"954958944620884","commenter_b":"all fuckin jerks,","commenter_a":"WORD","post_message":"ClashDaily.com"},{"comment_id":"1875959669293549","commenter_b":"I believe that she should be charged. I wonder if that would have happened if it was a white MALE officer. Just wondering.","commenter_a":"I believe she checked it for a person.","post_message":"BREAKING: Tulsa police officer Betty Shelby has been charged with manslaughter in the first degree. Shelby fatally shot 40-year-old Terence Crutcher"},{"comment_id":"10153359647714138","commenter_b":"Get the place shut down, then sue them for everything.","commenter_a":"Oh no!!","post_message":"When the family didn't hear back from Petco after a few hours they called the store and were told to meet the manager at an animal hospital."}]
