[{"comment_id":"10155934597900354","commenter_b":"And that is why this RINO will loose ..solution enforce ..the ..laws on the books now . Punish companies for violating the law ..make the fine so harsh they will not even think it ..with no jobs the illegals will self deport ...problem solved .in 3 months here is the 3 rd grade math ..20 million illegals ..10 million Americans out of work a high percentage of them are black .just think if 20 millions jobs opened up in the next 3 months ..what would that do for the black community ..IT WOULD HELP SOLVE A LOT OF PROBLEMS .","commenter_a":"Sneaking into a country illegally is NOT an American value either.","post_message":"Okay Jeb"},{"comment_id":"10153308445179342","commenter_b":"You right, had he been a negro, that M.F would be pushing up daisy right about now.","commenter_a":"If he was black I doubt he'd be alive to take pics","post_message":"SUSPECT PHOTO RELEASED: Kevin Daigle, 54, of Lake Charles was arrested for allegedly shooting a trooper in the head during a traffic stop. Charges against Daigle will include attempted murder of a police officer. DETAILS --> @webpagelink"},{"comment_id":"10150959655894999","commenter_b":"f you want a president that - Is a dictator above the law criminal who controls the brainwashing media and FBI Starts a war with Russia, China, Syria because they're not part of NEW WORLD ORDER - Can't be trusted to protect the security of our nations borders, classified information, or lives of our ambassadors and spies - Opens door to Jihad Terrorism and rape culture while our veterans sleep in the streets - Take away your right to protect yourself with a gun from her Isis soldiers she and HUSSIEN created and brought in. - Sells your country to your enemies and gives your enemies nukes - Raise taxes and enslave us while paying our enemies billions - Steals from her charity - \"Loses\" 6 billion of your hard earned taxes money - Defends rapists and bullies the victims - Brainwashes her followers to attack \"deplorables\" and starts fights ...","commenter_a":"I hope you guys will vote for Jill...","post_message":"Our photographers are sharing Election Day scenes from Manhattan, Miami and polling sites across the country. Follow along here: instagram.com/nytimes"},{"comment_id":"10152829564776770","commenter_b":"Go home Clintons","commenter_a":"Bullshit cover up","post_message":"Hillary is secretly a great person, says Clinton campaign"},{"comment_id":"10152992527222507","commenter_b":"You talk to your momma like that with those cocksuckers?","commenter_a":"That bitch been a racist with that shit on top of head suppose to be some hair looks like a hat","post_message":"Explains so much"},{"comment_id":"723294587810406","commenter_b":"Leah sure! Hillary's leaked email referrer's to Mexican's as \"taco bowls\". That says it all right there. Racist as anybody can be.","commenter_a":"Hillary no lo hace un coche de usted . Solo su voto","post_message":"\"Do all the good you can. Measure your life by the positive effect you can have on other people’s lives. Be of service to one another.\" —Tim Kaine"},{"comment_id":"10153619254387439","commenter_b":"You stupid son of a bitch. She will never do a day in jail. Dream on asshole.","commenter_a":"FBI didn't seize a fucking thing, they were voluntarily turned over to the FBI and justice department. Geller is a rotten crotched liar.","post_message":"// google_ad_client = \"ca-pub-@username\"; google_ad_slot = \"@username\"; google_ad_width = 336; google_ad_height = 280; // ]]> // // ]]> Hillary is such a tool for jihad and a knave to her lover pal Huma Abedin, I don t care how this destroyer gets her comeuppance, as long as she does. Like Capone and tax evasion charges. It was hardly the worst of what he did, but it got him put away. She should be sitting in prison for Benghazi, but if this is the best we can do, so be it. Although I hardly trust the DoJ. WASHINGTON As pressure builds on Hillary Clinton to explain her official use of personal email while serving as secretary of state, she faced new complications Tuesday. It was disclosed her top aides are being drawn into a burgeoning federal inquiry and that two emails on her private account have been classified as “Top Secret.” ..."}]
