[{"comment_id":"10154738479449575","commenter_b":"Hanna Mae Klemann there you go","commenter_a":"No","post_message":"Arby's is testing out venison sandwiches at select locations for just a few bucks! Would you try the sandwich?"},{"comment_id":"10153880875017994","commenter_b":"Can't say officer I Didn't see it... Lol","commenter_a":"Sweet","post_message":"This is a pretty \"cool\" pic."},{"comment_id":"10153989923308854","commenter_b":"I hope the refugees stay with Obama... His wife and girls should get what they have planned for woman al over..","commenter_a":"ObamaNation only a socialist democratic liberal would create this program. Bernie Sanders love's this unconditional illegal ruling. $9.000 a year NOT to committ illegal crime. Who says crime doesn't pay. After WIC EBT HUD cash aid free ObamaCare medi medi welfare and food stamps total cost to the taxpayer's is over $50.000 a year. What's the incentive to work.!!!!!!! @webpagelink","post_message":"ISIS Promises to BEHEAD OBAMA and Transform America Into Muslim Province"},{"comment_id":"1469871926366166","commenter_b":"@username...... leave Our country!!!!","commenter_a":"Too late you racist p.o.s. you are hatred and bigotry..","post_message":"\"We will reject bigotry and hatred and oppression in all its forms, and seek a new future built on our common culture and values as one American people.\""},{"comment_id":"10155028093604826","commenter_b":"Use to be entertaining...fun .. a great time to get together with friends...now its just another political platform and a lot of disrespect in the name of freedom of speech. I will be exercising my freedom to not watch it","commenter_a":"Falcons but I won't be watching. Totally lost interest.","post_message":"Question of the Day: Who do you think will win the Super Bowl?"},{"comment_id":"10152727190457452","commenter_b":"This is why women do NOT belong in an all male environment. You uptight B****s can't even take a joke.","commenter_a":"Is she going to use a flag or a kitchen rag?","post_message":"Meet Sarah Thomas, the first woman hired as an NFL official, according to reports. @webpagelink"},{"comment_id":"1513285485378585","commenter_b":"Mmmmmmmhm! I noticed that. Pussy","commenter_a":"How true","post_message":""}]
