[{"comment_id":"533672440152326","commenter_b":"You know that just the stupid negroes . The same ones who will kill their own .","commenter_a":"Who ever is sending the haha face this is not the place ... And you are part of the problem please show respect and leave this page","post_message":"The body of slain Dallas police officer Michael Krol is escorted to the church for his final funeral mass here in Michigan. He will be buried in Southfield later today: More: @webpagelink"},{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."},{"comment_id":"10152535175096813","commenter_b":"Start helping the ppl who are already here. How many Americans are out of work but Obama thinks it's better to hire illegals and give them driver license so they can vote. Yea sounds like he's buying votes for the Democratic party. When a soldier retires from the military where does he go. Shouldn't he have the first pick in a job then someone who crossed the border illegal.","commenter_a":"This was an ideology, not law...come here legally & you'll have no problems!!!!!","post_message":"All of our clients who were locked up in #immigration detention at Artesia are now getting a right to be heard. But there are others who deserve that chance, and aren’t getting it. @webpagelink"},{"comment_id":"544254699096156","commenter_b":"Eat pig shit Muslim","commenter_a":"If we are so disgusting take your slappy ass back to the Middle East. Live in squalor and let your \"men\" rape, beat, torture and starve your dumbasses!!","post_message":"Obama wants us to believe that Muslim Refugees can easily integrate in our Christian Western society, well watch this VIDEO..."},{"comment_id":"10154489395427439","commenter_b":"Ritual genital cutting is wrong regardless of sex.","commenter_a":"Barbaric people. Wouldn't expect anything less from this death cult.","post_message":"The gruesome practice of female genital mutilation is at record highs in America due to the influx of Muslim immigrants. FGM is found only within and adjacent to Muslim communities. The fact is that Muhammad justified it: “A woman used to perform circumcision in Medina. Muhammad said, \"Do not cut severely as that is better for a woman and more desirable for a husband.” (Sunan Abu Dawud 41.5251)."},{"comment_id":"10154336399174342","commenter_b":"🤔 alright hoe😭😭","commenter_a":"@username @username Rest In Peace Damiyah","post_message":"Happy #NationalCatDay Don't be a scaredy-cat! Watch these purr-fect #kittens reenact horror films: @webpagelink"},{"comment_id":"10153121325909411","commenter_b":"in ur ass","commenter_a":"White Americans are terrorists trained by CIA to kill people","post_message":"'We are concerned that attacks against the Muslim community are taking place in a heightened climate of Islamophobia and hatred.' - Sabby Dhalu, an organizer for Stand up to Racism."}]
