[{"comment_id":"10154319204506729","commenter_b":"And this should include Hillary as well. The woman has delusions of grandeur and is a serial liar. These are all distorted mental behaviors and both should be institutionalized.","commenter_a":"Psychosis: Possible symptoms include delusions, hallucinations, talking incoherently, and agitation. The person with the condition usually isn't aware of his or her behavior. Critical: consult a doctor for medical advice","post_message":""},{"comment_id":"10153509891501051","commenter_b":"Oh ya.....that'll stop the criminals from getting illegal guns!","commenter_a":"AGREE all the way","post_message":"Do you agree or disagree with the majority of Americans on this?"},{"comment_id":"10153797502305779","commenter_b":"I wonder how people react to a naked hillary statue where you get to see that bitch in all her glory. Lol. Bet people would respond differently","commenter_a":"Gross!!!! The looks are uncanny!!!!!","post_message":"New naked Donald J. Trump statues appeared today, and now they're legal, backed by a mega-developer of their own."},{"comment_id":"956871837686622","commenter_b":"This mother is insane.","commenter_a":"Not cute or darling...it is ANIMAL ABUSE..this child will grow up not respecting animals or people a a result of mommy's abuse to her and to animals...kids do not know...they have to be taught...","post_message":"This is not “cute” or “playful” or “darling” or “harmless” — it’s ANIMAL ABUSE, indirectly perpetrated by a mother too ignorant to keep her clueless (and ultimately innocent) toddler from treating a LIVING, FEELING creature like an inanimate rag doll. Disgusting…"},{"comment_id":"10154731956548797","commenter_b":"@username - Canadian!","commenter_a":"What the hell is wrong with this city? What is the death toll so far for this month?","post_message":"FATAL STABBING ON RED LINE: CTA Red Line trains are suspended between 35th and Garfield after a woman was stabbed to death on a train Thursday afternoon."},{"comment_id":"10154028893376051","commenter_b":"He is going to build a wall. Send back the goobacks and bomb Isis. Has my vote. If he triples the debt the libtards shouldnt mind. They have no concept of paying bills.","commenter_a":"Does that mean that Trump will put the country in more debt than it has been before him? Does it mean that Trump will instigate a covert plan to arm terrorist nations? Why exactly is that a good thing?","post_message":"Brexit leader Nigel Farage says Donald Trump reminds him of a modern-day Ronald Reagan. Will you be supporting Trump this November?"},{"comment_id":"10154004463969060","commenter_b":"We did, we along with many other countries liberated Europe…you're welcome. But in all serious we have and we continue to do, but we know when we're being played! But you're so busy with statistics, you failed to look over the problem! You need to understand the difference between migrants and refugees! The human catastrophe you're talking about is in Syria, they're refugees (although most are single males - who should be heading in the other direction to fight for there freedom and their families) The majority are economic migrants (for outside the EU), exploiting the current situation - and Germany.","commenter_a":"She does what she thinks it's good for Germany and EU, and not what she thinks would give her more votes!!!!!!! That's the difference!!!!!!!","post_message":"“I don’t have a Plan B,” she said with fighting passion. It is “my damned duty” to find a common path for the EU"}]
