[{"comment_id":"10154272140216336","commenter_b":"You do not agree with me because I want Trump to build the wall, and I want Hillary in jail!","commenter_a":"This clown gave cartoon maps to his citizens to help direct them to places in our border where they could run accross illegaly to work and send money back to Mexico. He's bought by the cartels and Fox is lame for giving him a voice in American politics!","post_message":"\"Pay for the wall? Why? Who is going to pay for the war on trade, the war on China's trade – it's [the] United States.\" Former Mexican President Vicente Fox Quesada said he is \"not for open borders,\" but advocates an \"intelligent and wise\" way to deal with immigration."},{"comment_id":"10153315951826336","commenter_b":"Start the engines and suck her up like a seagull.","commenter_a":"What's wrong this photo? Nothing I can see....","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10157972017965093","commenter_b":"@username Hey moron why couldn't those 3 legged blind goats beat trump.","commenter_a":"They couldn't beat Trump, what makes you think they could beat Clinton. Just asking the question tells me that you still haven't figured out exactly how fed up people are with the Republican leadership. They, and their democratic counterparts are the reason people are crying for term limits.","post_message":"You decide..."},{"comment_id":"1199381900178382","commenter_b":"They were not illegals!!","commenter_a":"#WomenAgainstSessions #LGBTQAgainstSessions #MinoritiesAgainstSessions!!!!","post_message":"WATCH: The Senate Judiciary Committee meets to vote on Attorney General nominee Sen. Jeff Sessions, hours after the firing of the acting attorney general. Read more: @webpagelink"},{"comment_id":"10154708467139575","commenter_b":"@username -AMEN!!!","commenter_a":"There are many people that work on major holidays. I don't know why every year retailers being open on Thanksgiving is a huge deal. First responders, hospitals, airports etc never ever close. Instead of the media always focusing on the negative maybe they should focus on the positive and the people that work these Essential jobs and miss many holidays with there family's.","post_message":"Macy's is staying committed to Thanksgiving Day shopping, saying it will open at 5 p.m. this year. What do you think about this? Will you visit Macy's on Thanksgiving?"},{"comment_id":"10154126114949877","commenter_b":"Off with her head!!!","commenter_a":"If it were my child, the white mother would be in a box today.","post_message":"White Mother Charged w/ Assault for Slapping Black Teen after Screaming N-Word. Watch how it all unfolded and the family's reaction below. Grio fam, can you imagine if this was your child? Sound off!"},{"comment_id":"723294587810406","commenter_b":"Leah sure! Hillary's leaked email referrer's to Mexican's as \"taco bowls\". That says it all right there. Racist as anybody can be.","commenter_a":"Hillary no lo hace un coche de usted . Solo su voto","post_message":"\"Do all the good you can. Measure your life by the positive effect you can have on other people’s lives. Be of service to one another.\" —Tim Kaine"}]
