[{"comment_id":"1747901745468646","commenter_b":"Do the same to that raghead bitch","commenter_a":"Is this true? If it is, she needs to be on death row!","post_message":"Muslim Nanny Who Beheaded 4 Year Old Girl Will Not Face Murder Trial Because... This is the world we are living in today people. What do you think her punishment should be?"},{"comment_id":"1155951624441179","commenter_b":"\"Security concerns\"... Right. It was probably because smiling is illegal.","commenter_a":"Real reason: Mewtwo is in Tehran 😂","post_message":"Iran isn't going to catch them all."},{"comment_id":"10153882688173984","commenter_b":"We have created the Immigration Laws for a reason and when needed we have enhanced them to be stricter. Anyone that thinks anyboby that does not come into our country legally should be allowed to stay are Un-American. They are taking Jobs from hard working Americans. There is no excuse to let them stay.","commenter_a":"Even Bill O'Racist recognizes how evil Adolf Trump's plan is...wow","post_message":"Bill O'Reilly thought it was a good idea to try and teach Trump a lesson about his deportation plan - it definitely didn't work out for him... Do you agree with Donald J. Trump on immigration?"},{"comment_id":"10154449321726729","commenter_b":"Fuck u bitch.. I'm an Obama supporter and wouldn't say no shit.like.that.. FUCK U!","commenter_a":"You know what's amazing about Trump's supporters? They are so cult-like that if Donald Trump raped a little girl, his supporters would insist that's okay. They would say that she was probably asking for it. No true conservative supports Trump.","post_message":"BREAKING: The decision desk has now called the winner of Kansas..."},{"comment_id":"860171507364731","commenter_b":"Wow... really? So sad.. moms please be very careful who u leave ur kids with..","commenter_a":"she looks like she is a... \"few bricks short of a load\"","post_message":"This 18-year-old girl is accused of leaving her little sister in a hot car while her and her friend went shopping for swimsuits. Investigators say the 2-year-old's temperature was already at 100 degrees when she was rescued:"},{"comment_id":"10154041877500586","commenter_b":"Oh really Dan... sounds like Nevia has your panties in a bunch, bc she struck the right nerve.","commenter_a":"Really Fox 13 this is your news let's hear about something that actually matters for once please","post_message":"So how many of your passwords made this list of the worst from 2015? It turns out, longer isn't always better."},{"comment_id":"10153140414189071","commenter_b":"Read previous comments about the difference of Free Climbing and Free Solo climbing.","commenter_a":"Incredible athleticism yes!free climb? not if he's got a rope.","post_message":"What an incredible athlete."}]
