[{"comment_id":"10153899931145575","commenter_b":"Wow, I wonder how many high school graduates are up in here!","commenter_a":"Now his voters will get behind the only true conservative in this race, Ted Cruz. This is not good news for Trump.","post_message":"Breaking: Rubio Drops After Florida Defeat..."},{"comment_id":"10154876629414411","commenter_b":"Ĺol Canada doesn't care. Second biggest land mass on Earth, only 40 million people live here. We will put all the Americant's a few hundred km north west of Alaska. Enjoy the polar bears bitches.","commenter_a":"Please send him to Mars! We Canadians don't need this dickhead in our beautiful country...","post_message":""},{"comment_id":"10153181502489705","commenter_b":"RJ Ring,Brett Alexander,Chandler Hunt","commenter_a":"Victor Trezic Mata","post_message":"Star Wars fans. It has arrived. Rejoice."},{"comment_id":"10155192232363984","commenter_b":"Amen. These Thugs are going Down.","commenter_a":"Thank you Mr. President Donald Trump. I hand it to you for everything your doing for this country and everything your about to do. It's about time we got a president who's looking after his own country first. GOD BLESS you President Trump. Trump train full speed ahead.","post_message":"That didn't take long. This says everything about Donald Trump's presidency..."},{"comment_id":"10156121986485354","commenter_b":"I hope Hillary win cause we need dem stamps","commenter_a":"Since Pelosi has NO integrity then she would not know it and therefore in her little finite mind think Hillary has it, when she doesn't. As a side note, does anyone beside me get physically nauseous and ill when seeing photos of pelosi and hillary???","post_message":"Well this should make everyone feel much better."},{"comment_id":"1159671620816281","commenter_b":"Why didn't you keep your promise and leave this country? Because you were so sure Hillary was going to win! LOL just please shut up! Get over it! Do you think it you keep going on &. On, things ar going to change? NOT!!!","commenter_a":"Ted danson probably gags thinking of his past. Yes,he used to do the deed with that😁","post_message":"Whoopi definitely gets what she has coming after she made this dim-witted attempt to insult Trump. She so deserves the humiliation. Let's get 5,000 'LIKES' to show that America wants \"The View\" CANCELLED PERMANENTLY! @webpagelink"},{"comment_id":"1391127634238463","commenter_b":"You poor Republicans. You are so lost in your stupor that all you can do is harp again and again over Hillary's e-mails. Sure, it was a mistake. But in the final analysis you can not find any harm caused by that. In the mean time just consider the damage caused to our nation by the rigidity caused by the Republican Congress over the past eight years. Your solution is to nominate a man devoid of any moral compass. Thanks Republicans. I can only hope that what rises from the ashes of the Grand Old Party will come closer to Abe's vision and that Rush L. stays buried in the ashes.","commenter_a":"I just do not understand how any true red blooded America could even think about voting for Hillary after her cover up of Benghazi and Emails !! The only thing she has proven is she is a BIG lair and above the law ! She is truly a woman of zero integrity and belongs in prison NOT running for our president !","post_message":"\"It took the socialist to remind us that you supported the trade agreements that cost millions of American jobs and millions of dollars.\" Last night on \"Justice,\" Judge Jeanine Pirro slammed Hillary Clinton over her Wall Street ties, failure to help the Middle Class, and backtracking over her husband's crime bill. @webpagelink"}]
