[{"comment_id":"10154880820226178","commenter_b":"What a shameless woman. You are heartless.","commenter_a":"Kelly A Dee","post_message":"LOL. Martha Raddatz can barely keep it together!"},{"comment_id":"1117284038339327","commenter_b":"Please don't. Why would she want to shame herself in this way?","commenter_a":"will the sausage be halal free?","post_message":"Cue mass exodus from the city centre."},{"comment_id":"10153457449933128","commenter_b":"All is Nestle fault. They should be ban from around the world.","commenter_a":"India is member of BRICS (Brazil, Russia, India, China, South africa) and pro RUSSIA. does it make sense?","post_message":"The FDA issued more warnings about snacks imported from India than any other country this year. One import was blocked because it “appears to consist in whole or in part of a filthy, putrid, or decomposed substance or be otherwise unfit for food.”"},{"comment_id":"10153041862786045","commenter_b":"I also like all those racist flags in your picture reference there.","commenter_a":"What should they expect, the flag does represent slavery and Jim Crow. But I guess folks must cater to the idea that \"Southern Heritage\" must only be represented by the confederate battle flag and not the U.S. flag.","post_message":"Controversy continues to surround the #ConfederateFlag. Two men in Decatur say they were fired from their jobs at Turner Industries because they refused to remove the Confederate Battle Flag from their personal vehicles."},{"comment_id":"10153655201276323","commenter_b":"Ha! Real men have curves, lol!","commenter_a":"The typically sexist depiction of what women want men to be... not what men are.","post_message":"Romance isn't dead, but it is dehydrated. What's it like to be be the hunk on the front of 414 romance novels?"},{"comment_id":"560003900832233","commenter_b":"Dont lose or give up your beliefs or faith..Those who seek to destroy your lives over a cake are the ones with deep rooted hate for anything good..And they want to call themselves victims of bullying..How perverted American have become when they hate their own and embarce filth as good..So busy hating Christians and not seeing that the Government have been taking yours rights away too..Hooray to the Muslims","commenter_a":"What's messed up is these people refused to back a cake for a gay wedding. The couple wasn't discriminated against. The kliens simply didn't want to participate in something they deem as sinful. How is that forcing their beliefs on them. So now they are out of business and the militant intolerant left made it happen. While our backward minded liberal pals are doing their best to persecute Christians at the same time and probably at this very moment Muslim bakers regularly turn away gays. These incidents do get reported but the liberal media refuses to report on them and the militant LGBT stay silent.","post_message":"A Daily Signal Exclusive: Bakers Facing $135K Fine Over Wedding Cake for Same-Sex Couple Speak Out"},{"comment_id":"1172120832836462","commenter_b":"@username she's a racist. \"Government people\" is code word for white devils. She just want to see them.","commenter_a":"Well how is he planning to build this wall!! Without the native America permission he's trying to build on our land (Tohono O'odham nation) nd again there's gna be another treaty broken","post_message":"President-elect Donald J. Trump says he will move to deport criminal illegal immigrants and still plans to build a wall."}]
