[{"comment_id":"1480511455341931","commenter_b":"Definition of Goldigger: A woman who dates men purely to extract money and gifts from men; in particular a woman who strives to marry a wealthy man.","commenter_a":"She only came for the boat. Now she's trying to act like she's not a gold digger. Too late","post_message":"This is the Tinder date from hell"},{"comment_id":"885286484921464","commenter_b":"This woman is delusional.","commenter_a":"Bat shit crazy","post_message":"ClashDaily.com"},{"comment_id":"517994265057820","commenter_b":"she is a pig","commenter_a":"She is an idiot, why does anyone give her the chance to prove it and get her 15seconds of publicity?????","post_message":"Mike Brown's mom just said something infuriating about the two cops who were just shot. This is absolutely disgraceful. No wonder her kid was a thug. Do you agree Mike Brown's mom is totally out of line?"},{"comment_id":"10152976962214205","commenter_b":"Yea, you're right. My comment is stupid, cause it was meant to be. And all you idiots commenting on my stupid comment as if I'm serious lol What's even more ridiculous is \"the police have to do their jobs\". So that's why some ppl get Burger King and walked out of a building (when they've killed 9ppl) and other ppl get choked to death for selling loose cigs, or get shot to death on site for having a toy gun (a 12 year old btw). Or others mysteriously die by being shot in the back while cuffed and in the back of a cop car. Yea cops totally just doing their job by the books. So yea, thanks for \"proving\" me wrong on a comment that was clearly not serious to begin with. You butthurt idiots can shut your dick holsters and relax.","commenter_a":"Prolly told him \"good job son, you played your role perfectly. You did a good job as patsy for your government. Now here's your complimentary Burger King as promised.\"","post_message":"Did you know the cops bought Dylann Roof Burger King AFTER they arrested him? WTF?!"},{"comment_id":"10153869614430329","commenter_b":"She's not even made up of gasses, geez","commenter_a":"We throw the term \"star\" around way too often","post_message":"She tells BuzzFeed News, “I don’t regret it for a second.”"},{"comment_id":"10153513325884614","commenter_b":"Brianna Paino","commenter_a":"I was told so it maybe BS. There is no law stating what direction the car is to be pointed. Say backing up in a lane at a stop.","post_message":"Dramatic cellphone video captured a dangerous scene in the Hollywood Hills: an Audi driving backwards for miles on a narrow and windy stretch of Laurel Canyon. Kevin Zanazanian, who shot the video, told KTLA the stunt jeopardized the safety of pedestrians and motorists. He said he recorded it for safety reason. After the video was uploaded to YouTube, the Los Angeles Police Department said it was investigating the incident and working to identify the driver, whose identity remains a mystery. Read KTLA story here: @webpagelink"},{"comment_id":"1270356769653367","commenter_b":"She is so gross, just sickening!","commenter_a":"Whatever That idiot should move to Mexico","post_message":""}]
