[{"comment_id":"1149843228370020","commenter_b":"1404343676260901house @username","commenter_a":"Chris Weishuhn","post_message":"What happens when you strap a GoPro to a giant sea turtle. Video by the WWF."},{"comment_id":"504319243082965","commenter_b":"So many of these republiCANTS are using the same old debunked arguments lol Here let's clear up some bullshit and hopefully reach new dialogue on how to possibly prevent further mass shootings: -we've all seen the \"scaring us into dictorship memes\" Our government is corrupt but giving up on how far we've come as a country just to say fuck it let's start a new government here and deal with THAT transition process instead of getting rid of something that Americans are rightfully pissed off keep killing their kids and neighbors. -Yes, when guns are gone crime will still be a thing. Shootings MAY be a thing. Google search the COUNTRY OF AUSTRALIA and stop lying to yourselves. If you have any solutions for stopping all crime please let the class know motherfucker. For now can we ONLY focus on preventable mass shootings? Less guns means less gun related crime, ...","commenter_a":"But they said guns don't kill people!?","post_message":"Who sold this guy his gun?"},{"comment_id":"10153100903362061","commenter_b":"She's ugly!!","commenter_a":"Denise has had some work done.","post_message":"Juicy pop news - first photos of Kermit the Frog and his girlfriend Denise have hit the web: @webpagelink - The Muppets ABC"},{"comment_id":"593869030794976","commenter_b":"#killery #neverforget #emailscandal #saudibribes #womandestroyer #liesthroughherteethwithasmile #corrupt #unfitleader","commenter_a":"Headline reads...CLINTON AND TRUMP UNFIT 2B PRESIDENT","post_message":"It was one of the great body slams of presidential politics. Donald is hurting at this moment."},{"comment_id":"1097859700233782","commenter_b":"Thanks! It's true!","commenter_a":"The woman had every right to post on yelp.","post_message":"Last night we told you the story about how a woman who was upset about her treatment by a doctor and gave a bad review on Yelp. That review then led to the doctor filing a lawsuit against her >> @webpagelink"},{"comment_id":"10153206290841037","commenter_b":"And burn all the racist people in America","commenter_a":"burn all the bibles, korans, and any other religious text. They are blights.","post_message":"After being falsely accused of burning a Quran, Farkhunda was beaten, run over with a car and burned before her body was thrown into the Kabul River."},{"comment_id":"10154753068623812","commenter_b":"Send them all back and send Mexico into a Panic Mode. The Wall will be up in no time.","commenter_a":"Maybe he can bring back the auto manufacturing jobs from Mexico, and hire legal citizens, and then the illegals will stop coming. Oh wait. They come here because there are those willing to pay pitiful salaries and no benefits to make a buck.","post_message":"Donald J. Trump has made his promise that Mexico would pay to build a wall along the U.S. border a centerpiece of his proposed immigration policy. But only 13% of voters believe he could deliver on that promise if elected."}]
