[{"comment_id":"10153471883581509","commenter_b":"Can we remove obese women who wear the wrong sized clothing and bathing suits? Tired of seeing leopard print spandex stretched to its capacity, duck faced selfies and moose knuckles. Help me retain my eyesight please FB.","commenter_a":"Or 'dirty' words, children can be confused.","post_message":"Facebook is getting super-specific about what is and isn't allowed on the social network. @webpagelink via CNNMoney"},{"comment_id":"10153215864872235","commenter_b":"She's just making up the rules as she goes along.","commenter_a":"200,000 dollars so they can keep serving shitty pizza! Yay! Everybody wins!","post_message":"Someone needs to drink a big, tall glass of STFU juice at this point."},{"comment_id":"1060964983967782","commenter_b":"I am a woman and I think your ugly Megan","commenter_a":"I think the evidence clearly shows she was moved away. Not beaten or mauled just moved away. Seems like a job hazard to me.","post_message":"\"This is the Trump campaign, where lies are told and then lies are told to cover up the lies, and then finally new lies are told in order to cover up the lies that were told about the lies,\" Ben Shapiro said."},{"comment_id":"10154617085889714","commenter_b":"@username you have a hot wife!","commenter_a":"He dressed as a gypsy gives savvy. This is the bottom for America...","post_message":"Hillary Clinton is “our new president.” Barack Obama is “the greatest president we ever had.” And Donald J. Trump is…. “No comment,” says DJ Khaled. Full interview: @webpagelink"},{"comment_id":"497304097143406","commenter_b":"LEAVE ABE ALONE DIMWITS!","commenter_a":"Leave our money alone","post_message":"First The 20, Now The $5 Bill - Obama Announces More 'Diverse' Face For The Bill Stop it. Leave our money alone. Do you think they should keep honest Abe on the 5$ bill?"},{"comment_id":"482704838584476","commenter_b":"Yea just can't fix stupid... While Obama tries to shove his deal down Americas throat - Iran is laughing at us, buying weapons and building bombs - Better war with them today than tomorrow - Iran has no purpose, no value - Just make it a dust bowl.","commenter_a":"Nuke China & Iran!","post_message":"So, please Obama explain us, how this deal prevent war?"},{"comment_id":"1206621306053557","commenter_b":"Truly this HYPOCRITICAL woman with NO MORAL CONSCIENCE and u hope one day she will be in a Federal Lockup w/ The Clinton CRIME FAMILY along w/ OSAMA OBAMA and they'll have time to know GOD...","commenter_a":"Piss off and die, libtard.","post_message":"WOW..."}]
