[{"comment_id":"10154005218489749","commenter_b":"@username fool","commenter_a":"Galloway is a racist..anti-semite...he needs to be thrown out of any meeting of decent minds.","post_message":"\"This has ruined this evening, as far as I am concerned, it's disgusting,\" one angry attendee said."},{"comment_id":"856527364484863","commenter_b":"@username shut ur dumb-ass up!","commenter_a":"First point of order the car is in the middle of road. Second point yes his hands were raised but he moved to the car and did not stop not typical behavior of a stranded motorist when given an order to stop or asked hey why is your car in the road. Third point the suspension is typical following any ois during an investigation. So is the officer right or wrong if you can make that judment based on clips of an entire interaction with the police you're an idiot, and are part of what's wrong with America as well.","post_message":"GRAPHIC VIDEO: Video released today shows Tulsa police shooting and killing Terence Crutcher, an UNARMED father of 4 and college student for the crime of having his car stall down on the road. His hands are raised shortly before shots are fired. From the helicopter, a cop can be heard on the radio saying, \"That looks like a bad dude, too.\" A federal Justice Department investigation has been launched and the officer who shot him has been suspended. Video by Occupy Democrats, LIKE our page for more. Read more here: @webpagelink"},{"comment_id":"1033609543378017","commenter_b":"Arrested???? WE OWN THIS BUILDING!!!!, and ALL THE GOVEMRNNENT BUILDINGS. BOUGHT, BUILT AND MAINTAINED WITH OUR TAX $$$$$$$$","commenter_a":"Yes!!! #DemocracySpring is currently trending on Facebook!!!","post_message":"The Young Turks live from the Democracy Spring: Sit In. Save Democracy. protest in Washington, District of Columbia - The police are arresting people now."},{"comment_id":"10152768330837452","commenter_b":"Good, then keep them home.","commenter_a":"I will home school my child before I let the state lawmakers tell me what I should and shouldn't inject them with !!!","post_message":"BREAKING NEWS: Lawmakers have approved a bill that would require California schoolchildren to be vaccinated. @webpagelink The proposal would eliminate the state's personal-belief and religious exemptions, so unvaccinated children would not be able to attend public or private schools."},{"comment_id":"10152782539256130","commenter_b":"It would take the entire roll of toilet paper for some women. Hell I go through super plus tampons with a super extra maxi overnight within 2 hours bc I have PCOS. I was homeless and LUCKILY people donated to the shelter and I was usually able to have what I needed. Sometimes I didn't but I would go sit in the day labor office with a bunch of homeless men, I was like the only woman there, while I was on my period, bleeding through my clothes just to go do manual labor all day so I could make $30 to buy what I needed. I fucking hate asshole people.","commenter_a":"Growing up poor, you learn to use other methods. Guess what's free and in bathrooms everywhere? =p","post_message":"Pads and tampons are often what homeless women ask for the most."},{"comment_id":"10154186189827894","commenter_b":"What a bitch","commenter_a":"Real petty","post_message":"Ouch! Sheree Whitfield Responds to Kenya Moore's Chateau Shade: 'My Mother Loves Me' [Video]"},{"comment_id":"735262859947913","commenter_b":"If Melania was one of my students, she would be sitting in my office now for a little chat about plagiarism and the consequences according to school policy. Similar to students in the past, she is defensive and blaming others for her plagiarism.","commenter_a":"And the Deval Patrick 10/15/06 vs President Obama 2/8/16","post_message":"Compare Melania Trump’s speech with Michelle Obama’s 2008 speech. Donald J. Trump campaign denies the speech plagiarizes parts of Michelle Obama's: @webpagelink"}]
