[{"comment_id":"559259350942537","commenter_b":"Lord,bless this precious child, hold this family in your loving arms. In the name of Jesus. Amen","commenter_a":"Sad, she is a pretty young lady! Prayers for Hannah and her family!","post_message":"\"We have all been waiting and praying for a miracle,\" a post on the Facebook page 'Prayers for Hannah Katherine' said. \"We are now waiting for her to join the angels in heaven.\""},{"comment_id":"10153715951406002","commenter_b":"There are not enough words to describe the opinion I have of this woman and the her unspeakable actions.","commenter_a":"In my eyes what she did is not much different than an abortion.","post_message":"A 24-year-old Eastpointe woman who already has three children is charged in connection to the death and abandonment of a newborn who was found at a Roseville recycling center."},{"comment_id":"960199417353864","commenter_b":"You think allowing illegals to become citizens will not increase your \"real problems?\"","commenter_a":"What in the world are those loony Republicans thinking? Oh yeah, it's the \"me, me, me, f**k you!\" mentality that keeps them going. They ignore the real problems of gang wars, poverty, human strife, and persecution in the places where immigrants come from while at the same time, those idiot neocons perpetuate the \"War on Drugs\", \"War on Syria\". and all other unnecessary wars. Those people show no mercy on fellow human beings... Why is it that people remember to hate and separate while struggling to love and unite?","post_message":"Republicans are so eager to see brown-skinned children deported that they're willing to put the entire country at risk in hopes of making it happen."},{"comment_id":"10154298865889099","commenter_b":"Smh","commenter_a":"Jessica Milla","post_message":"\"Her ribs are broken. He beat her ribs and breast saying her milk was useless and she was worthless,\" the woman's mother said. \"He tried to blind her so she couldn't see her baby, he tried to make her deaf so she couldn't hear him crying for her.\" WARNING: Some may find the images in this story disturbing. @webpagelink"},{"comment_id":"1170836056328262","commenter_b":"The last time I posted something about the politics of these bitches, I got dozens of whining bitches, men? and women, extolling on the vitues of these sacks o shit. Piss on 'em. Bring it on bitches!!!!!!!!!!","commenter_a":"GO DIXIE CHICKS--FREEDOM OF SPEACH-TURN TEXAS BLUE--","post_message":"Some Donald J. Trump fans attended this concert wanting to get away from politics and just have a good time listening to music. But then they noticed what the Dixie Chicks has in the background during one number. After that, Trump fans in the audience were absolutely furious... and for good reason. This is sick."},{"comment_id":"10152522515306717","commenter_b":"Trust bitch, more Gays will flock to Nikon, you're obviously a total moron","commenter_a":"Won't be buying anything from that company or my family or friends Adam and eve people not Adam and steve","post_message":"Click here to follow LGBTQ Nation on Twitter: lgbtqn.at/tw"},{"comment_id":"10153545736202014","commenter_b":"You are obviously ignorant to what really goes on behind bars. I hope you have the opportunity to find out one day. You are only one mistake away.","commenter_a":"He is the best thing for Maricopa County in so many ways - everyone needs to experience what it is like when you do not have a Sheriff Joe - it is shear chaos - the prisoners have the power and control - Bless Sheriff Joe and i wish we had more like him . So yes yes yes from me","post_message":"YES or NO: Do you approve of Joe Arpaio's job performance?"}]
