[{"comment_id":"1711137139137823","commenter_b":"@username I've been reading your comments and I can tell you're a Drumpf dwarf you dumb, classless, hillbilly trash you are utterly disgusting don't forget when you take your dump in your out house you can cast your vote for Drumpf at the same time!","commenter_a":"I think it was the movie Animal House..\"fat drunk and stupid is no way to go through life\" maybe you should take the same advice Rosie O'Donnell. You're a classless loud mouth, when Trump becomes President feel free to leave the country, Ill even pay for your ticket","post_message":"Rosie O'Donnell just restarted an epic feud."},{"comment_id":"409710459217248","commenter_b":"Sad she's even allowed in this country & in our schools!","commenter_a":"Sad that she promotes hate.","post_message":"Jewish professor shuts her mouth..."},{"comment_id":"10153321709602217","commenter_b":"shes dissolving the trends in the fashion world","commenter_a":"Nigeria is looking for their 2016 budget","post_message":"She's fronting a campaign called the \"Face of Courage\"."},{"comment_id":"992365204151742","commenter_b":"Since the dawn of evolved time mankind has migrated so that won't stop. I agree the need know who is entering the nation if I remember a European country found that immigrants were part of protest. And terrorist will use this to build cells to attack. However I don't see how Trump will get Gulf States to build security safe zone since the 'fountain is running dry' or maybe he will reignite the polluting of the environment with fossil fuels and take action to get fossils prices back to 110 which will create more bad than good but greedy and gluttony will prosper. His positions may have down sides for any real growth. And I agree that America needs to stop providing bulk funding, to the UN and other, let the world let the new imperialists do it and they, US, rebuild and make the world positive, green, clean and ...","commenter_a":"Republican Party souls have been sold to highest bidders, \"The Sneaky Wolves\". Lincoln Party is officially dead. So sad, Republican primary election is fraud, unfair and rigged, it seems every bigot and racist hiding behind the conservatism came out the closet to poisoned the election process in order to hijacked the Republican Party. I feel sorry for the gullible and naive Republicans who have been mislead, bluffed, lied and manipulated. Trump’s gang for hostile takeover of Republican Party maybe the worst case scenario in the American political history. Thanks a lot media for giving Trump’s gang free ride. Media is sold out to the highest bidders and freedom of press is no longer relevant to corrupt bosses and greedy investors Not again, another Hitler era, never again. @webpagelink Going in and out of building makes a person a Christian no more than going in and out of a barn makes ...","post_message":"“No. I would not allow people to come in from Syria. They’re not vetted properly. They’re moving in by the thousands.” Donald J. Trump reaffirmed his commitment to a ban on Muslims immigrating to the United States, arguing that it is better to build \"safe zones\" in Syria. What do you think?"},{"comment_id":"10154229231904411","commenter_b":"If a woman have every right to show off her body or hair; then why can't she have the right to cover it? I haven't met any veil wearing ladies that have offended me in the least.","commenter_a":"The Golden Rule of Civil Rights is, One Mans Rights End Where Another Mans Rights Begin","post_message":"Awkward: Laurence Rossignol, who is ironically founder of the anti-discrimination organization SOS Racisme, compared Muslim women who wear veils to 'American negroes' who supported slavery"},{"comment_id":"919328804793264","commenter_b":"These girls have behaved impeccably!!","commenter_a":"As soon as someone denies being racist, the following lines reveal their bigotry.","post_message":"Once again, we are treated to a massive display of Tea Party \"not-racism.\""},{"comment_id":"10153062603882235","commenter_b":"What is it about the name Cheney that brings out the stupid? Good God woman shut the hell up and stop sounding like your father. smdh","commenter_a":"Blackface was always intended to degrade. Drag is something else entirely.","post_message":"Mary Cheney — the lesbian daughter of former Vice President Dick Cheney — asked in a Facebook post this week why drag performers are allowed to blur gender lines in their work while society frowns on the form of racial minstrelsy known as “blackface.”"}]
