[{"comment_id":"10153683499520530","commenter_b":"Whore","commenter_a":"DA FAQ??!!! Dump this girl she has no self respect .....she's probably screwing him behind his back","post_message":"He decked the guy after he touched his girlfriend's rear end several times. Now she's upset and wants him to apologize."},{"comment_id":"1496723690352634","commenter_b":"@username he must have grabbed you by the pussy.","commenter_a":"Same day, taken moments earlier before the rain actually stopped.... Trump holding the umbrella for her, meanwhile Obama has someone else holding it.... just saying maybe look into it before looking so biased","post_message":"See the difference?"},{"comment_id":"937893629592518","commenter_b":"men especially infantry like women.. all i can see this now is rape allegations and pregnancy going UP, that and men are biologically inclined to put a women's life first. thus taking away from the mission at hand.","commenter_a":"@username @username intentionally weakening our ground forces. Not because women can't hack it (most can't) but because they will be a distraction for the males and a logistical nightmare.","post_message":"#BREAKING: In a historic decision, the U.S. Secretary of Defense has ordered all military combat positions to be opened to women. STORY: @webpagelink"},{"comment_id":"2191617061063923","commenter_b":"It should be lock that jerk up , wth.","commenter_a":"YES","post_message":"Donald J. Trump just tweeted that those who burn a flag should either lose their citizenship or get a year in jail. Do you agree?"},{"comment_id":"1168375003221975","commenter_b":"This smacks of Naziism!! He is trying to intimidate the minority vote. He is so disgusting and despicable . We must come out in force to stand up to this type of scare tactics!!!!","commenter_a":"Well in my State, of Washington, like many other States, voting is done by mail or can be dropped off at drop boxes for elections only. So will his people be harassing the Postal employees? And for any States that still go to the polls, those State governments better damn well make sure that ALL citizens can get to their polling places unmolested. And if that means with police protection, so be it. Then, charge the GOP for all of the overtime for said protections that will need to be paid.","post_message":"Unable to win, Trump now looks to blocking Hillary voters with an army of deranged volunteers."},{"comment_id":"10153552144846636","commenter_b":"Wow.. boo hoo. There's no \"controversy.\" Just a few crybaby parents who probably don't like soccer. This team is generating money in the Yukon community and also generating money for the school during a time of need. People should be thankful, not critical. This team isn't cutting into the school budget in any way, chill out.","commenter_a":"KFOR you need to get rid of the pop up ads your page uses!! Can't read a complete story or watch a video without getting a redirect to somewhere else. You are the only news station page there are issues with!","post_message":"\"By no means was it ever intended to say hey this is ours now.\""},{"comment_id":"10153700779194062","commenter_b":"No NOT all Latinos are Mexicanos but that would be the first place anyone of that Heritage will head too is that is MEXICO with the quickness !!! You can not hide here in TEXAS we can tell da difference now.. Everybody stands out now a days!!!","commenter_a":"So where is the other guy that was last seen with them now?","post_message":"More: Baytown Police said the bodies were found Thursday afternoon at FM 563 at Eagle Ferry."}]
