[{"comment_id":"1033927403316825","commenter_b":"Good! Hopefully this will deter those damn anti-vaxxers from using Facebook and spreading their total stupidity. One can dream.","commenter_a":"Hip hip hor ehhhh","post_message":"Three cheers for Mark."},{"comment_id":"10158187868175203","commenter_b":"Boo hoo bitch","commenter_a":"The Dems aren't going to stop. They're working their agenda to undermine our Constitutional Republic, the rule of law, and our civil society: @webpagelink","post_message":"Trump defends his travel ban."},{"comment_id":"10154335910931130","commenter_b":"Just a joke? Really? So if you ever get assaulted verbally or sexually it's just a joke?","commenter_a":"Oh please. Hillary laughs at getting a guilty rapist off, what does it matter now, and trump was just making a joke. Get real.","post_message":"Talk about RIGGED!"},{"comment_id":"528487337334584","commenter_b":"#FUCKTRUMP #FUCKTRUMPLATINOS & YOU","commenter_a":"Latino for Trump! You don't have the explained anything. The system is crooked!","post_message":"STATEMENT REGARDING TRUMP UNIVERSITY It is unfortunate that my comments have been misconstrued as a categorical attack against people of Mexican heritage. I am friends with and employ thousands of people of Mexican and Hispanic descent. The American justice system relies on fair and impartial judges. All judges should be held to that standard. I do not feel that one’s heritage makes them incapable of being impartial, but, based on the rulings that I have received in the Trump University civil case, I feel justified in questioning whether I am receiving a fair trial. Over the past few weeks, I have watched as the media has reported one inaccuracy after another concerning the ongoing litigation involving Trump University. There are several important facts the public should know and that the media has failed to report. Throughout the litigation my attorneys have continually demonstrated that students who participated in Trump University ..."},{"comment_id":"1246473882081393","commenter_b":"TURN THEM LOOSE AN PAY THEM TO KILL AMERICANS !!!!","commenter_a":"Go figure that thank you Mr. Obama and miss Killory you guys are doing America so good","post_message":"REVEALED! Minnesota Mall Attacker ID'd As One Of Hillary's Somali Muslim Refugees!"},{"comment_id":"1033663213364148","commenter_b":"@username if there illegal how did they get your job??? I thought illegals couldn't be hired?","commenter_a":"Shut off all immigration, build the wall, get rid of illegal aliens. That in itself should generate a large number of jobs!","post_message":"Fox News had an illegal alien on during the #GOPDebate to ask candidates what they would do with illegal aliens. Shouldn't they be asking them if they would reduce immigration to help American workers?"},{"comment_id":"10153328235374087","commenter_b":"Common ground to Ryan means all his way.","commenter_a":"Ass hole. One of the boys","post_message":"“You know, we have two ears and one mouth,” Paul Ryan said. “We got to use those in that proportion.”"}]
