[{"comment_id":"10153603991313132","commenter_b":"The tiger has been locked behind a cage for who knows how many years and when finally released he stood his ground and protected himself and they kill him for it? Animals no matter how small or what purpose do not belong in cages! Let's put a human in its place and see if they don't come out biting.","commenter_a":"Those animals need to be free not in a cage. Poor tiger, it was instinct. I feel for the man and his family too but it's not the tiger's fault. No zoos, circuses for me.","post_message":"\"It seized him by the throat,\" an eyewitness said."},{"comment_id":"749889551868289","commenter_b":"damn bitch!!!","commenter_a":"Fuck that BITCH she has no authority to do anything the American people own the schools not your ugly f****** Muslim ass you're a disgrace to the American people and funny thing is you're on your way out you and your Muslim Brotherhood m*******f******","post_message":"Michelle Obama Banned Valentines Day In Schools She can't take love away from America's children. Do you think she is a horrible first lady?"},{"comment_id":"1557321691221611","commenter_b":"karma is a bitch at times","commenter_a":"When is it anybody else's business! Tell them to butt out!","post_message":"Way to go mom!!!"},{"comment_id":"10152703267277217","commenter_b":"64% of voters didn't vote for the Conservatives in 2010, so not that popular.","commenter_a":"Best PM ever. Don't even know why the others have bothered...","post_message":"What do you make of David Cameron's cufflinks? Follow our UK election coverage: @webpagelink #GE2015"},{"comment_id":"10155182239718984","commenter_b":"Go to hell BITCH","commenter_a":"Let the criminals out. Let illegals in. Let boys in the girls bathrooms. Condemn police officers. Persecute Christians. Don't care about the veterans. Pervert the children. Kill the unborn. Stomp on and burn the American flag. Accept barbarity in the name of Islam. Protect the Sanctuary cities. Cuddle the lazy. Encourage hate crimes. Destroy properties. That's the liberal way!","post_message":"Nancy Pelosi just dropped a lot of jaws with what she had to say about impeachment. Donald Trump will definitely want to hear about this..."},{"comment_id":"10155104152711323","commenter_b":"Wow how fucking sexist can you get.","commenter_a":"I don't know who any of them are but they are pretty.... boring and vacant looking.","post_message":"'These are the kind of women who take pride in saying things like not into fashion I like style, and by they mean that men like me to wear. They think anyone who criticises Disney fetishisation of princesses is just jealous.'"},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."}]
