[{"comment_id":"10155069293808010","commenter_b":"@username well since trump is saying illegals voted for Hilary!!! I'm being sarcastic you Troll!!","commenter_a":"Oh let me guess they were illegal immigrants 2","post_message":"He operated the scheme for two years from behind bars. He and an accomplice made more than $600,000."},{"comment_id":"10154388991666162","commenter_b":"Stfu!","commenter_a":"Happy birthday you druggie idol you","post_message":"Prince was born on this day in 1958. He would have turned 58 today... @webpagelink"},{"comment_id":"10153727755939117","commenter_b":"@username If Trump were a cat, he would be licking his own balls.","commenter_a":"And the Republican leaders of the past, McCain, Romney, and the entire Bush family? They recognize a fraud when they see one and won't even bother attending, endorsing or having anything to do with a bully liberal like Trump.","post_message":"The list of GOP convention speakers includes a bunch of people better known for harshly criticizing Donald J. Trump, in some cases unambiguously pronouncing him unfit for the presidency. They say he's a \"con artist,\" \"narcissist,\" \"bully,\" and \"pathological liar\" whose candidacy is \"a cancer on conservatism.\""},{"comment_id":"10153543812088812","commenter_b":"She was too busy preaching abstinence.","commenter_a":"did she ever hear of birth control? apparentally not","post_message":"Bristol Palin announces second pregnancy; says she knows it will be \"huge disappointment\" to many: @webpagelink"},{"comment_id":"985326574853829","commenter_b":"Girlfriend you are out of your simple, bigoted, tea bagging mind! Go crawl back under your rock...","commenter_a":"No senator. No SCOUS nominations from this America-hating muslim currently in residence at our White House. No. Never.","post_message":"Today I stood with U.S. Senator Chris Coons in Philadelphia to call on Republicans to do their job and give fair consideration to Chief Judge Merrick Garland. Their obstruction is inconsistent with our duty as senators and bad for our judiciary."},{"comment_id":"607183962802381","commenter_b":"@username then maybe you should move out of America if you can't handle it. Bye Felicia","commenter_a":"Only reason big cities elect her is Bc they are the low life's looking for their hand outs... Guess what?! You'll be returning your Obama phones soon :) haha","post_message":"We’re in New York with Chris Moody and Vanessa Yurkevich who are talking to voters about tonight’s dramatic election results. Any questions? Let us know! #CNNElection #ElectionNight #MyVote"},{"comment_id":"1079326368771039","commenter_b":"Devil women","commenter_a":"that will be a cold day in Hell!","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More ‘Comfortable’. This is just getting ridiculous. Do you think they should keep the cross in our Churches?"}]
