[{"comment_id":"10152864140411051","commenter_b":"She should be afraid not to file for divorce!","commenter_a":"Is time that she buys a gun and it will be the last time that he ever hurts her again.","post_message":"A mom was picking up her children from daycare when, all of a sudden – boom."},{"comment_id":"10152683418148067","commenter_b":"Don't worry. You're 10 times better looking than this homely chick.","commenter_a":"I'm 20 and my biggest accomplishment is not setting the house on fire.","post_message":"While her peers are chatting about boys and clothes, this teen is texting the CEO she hired to run her growing business. @webpagelink"},{"comment_id":"10152721228310047","commenter_b":"This comes from a woman that laughed as she helped a rapist get away with his having raped a young girl... She knew he was guilty, too.","commenter_a":"If all the babies had a right to choose life or death--hmmmmm!","post_message":"Hillary Clinton and the radical Left believe that protecting abortion is even more important than your religious rights. Read & SHARE about attempts to prioritize abortion over First Amendment freedoms."},{"comment_id":"10153547017035950","commenter_b":"There is no excuse for paddling in school. Sounds like mom has serious issues too.","commenter_a":"He has missed 18 days of school, he's got in two fights this week, he spit on a kid and his mother is on the verge of going to jail not only because he has missed school but because of things she does in her personal life. If she doesn't want to be a parent to that child somebody has to be.","post_message":"\"It was not a spanking. It was abuse,\" said the boy's mother."},{"comment_id":"10154019054861509","commenter_b":"White Americans do not recognize anyone else","commenter_a":"American??? Wow, she is so ignorant. Many American citizens came here from other countries speaking another language. English, the American version, is what has been spoken here for many generations. However, we now have many citizens who speak Spanish, Russian, Mandarin, Vietnamese...We are a country of many. Let's stop the ignorance and the Palins of the world.","post_message":"Sarah Palin praised Jeb Bush on speaking Spanish, but said “let's speak American\" to unify the country: @webpagelink"},{"comment_id":"10153709236220927","commenter_b":"I think she was in WAY over her head. I guess she hasn't been a flaming Liberal long enough.","commenter_a":"What's new","post_message":"Moderator Elaine Quijano continually challenged Gov. Pence. #VPDebate"},{"comment_id":"481914358685584","commenter_b":"That chick in the picture is going to fire up a joint , get high , go down and get her welfare check, then crash for a while, then get up and go to a anti-whatever rally and get arrested , then get out on an O/R and go cash her check and go get some more weed and start all over again. Thanks Gov. Brown for making California so great!","commenter_a":"Does that mean about 4 thousand attended?","post_message":"Attendees of the annual 4/20 pot celebration left behind almost 15,000 pounds of trash at the Golden Gate Park. PHOTOS/VIDEO:"}]
