[{"comment_id":"817688164952017","commenter_b":"Chesimard is a scum pig who needs to be extradited back to NJ to finish her punishment.","commenter_a":"And they wonder why there is racism in American. They are the worst and the rest of us are reacting to this sort of crap and the disproportionate numbers of black's in prison. Clean up your own house first and quit committing crimes and we might actually start to listen. Until then FY.","post_message":"[Video] INSANE LIST OF DEMANDS BY BLACK COLLEGE STUDENTS Includes Naming College Hall After Notorious Cop Killer"},{"comment_id":"10153079527196051","commenter_b":"Darwin Award!","commenter_a":"The boy appears to be under the influence.....too bad.","post_message":"This girl thought it would be fun to take selfies while she and her boyfriend were driving. This is what they looked like before the crash. Now check them out after."},{"comment_id":"10153189366828132","commenter_b":"Yes for real!!! That's hilarious.. but just a secret, I do it to. Except when they stare, I sing to them. And they sometimes laugh or look at me like","commenter_a":"I could so see Mervin doing Danielle!","post_message":"This police officer from Dover, Delaware, has some serious moves!"},{"comment_id":"928965170496565","commenter_b":"They where good and did what they meant to do make us laugh, well done ladys","commenter_a":"As a woman seeing women strip down does not make me proud to be a woman. Keeping their clothes on and becoming doctors, lawyers, or a different type of role model would.","post_message":"'You make us proud to be women'"},{"comment_id":"10153285470317994","commenter_b":"Rights? RIGHTS? LOL.","commenter_a":"If the son paid for them he had no right. If he paid for them then the joke was on him.","post_message":"Kurin Keys just got his pair of Air Jordan 11. He also just got his grade card and it wasn't good."},{"comment_id":"991842820828524","commenter_b":"No it doesn't. Vermont has Constitutional Carry, and Vermont is the safest state in the union. @webpagelink","commenter_a":"Thank you, Governor. The current law works just fine.","post_message":"Governor Maggie Hassan issued the following statement today on Senate Bill 116, repealing the license requirement for carrying a concealed pistol or revolver: “New Hampshire’s current concealed carry permitting law has worked well for nearly a century – ensuring the Second Amendment rights of our citizens while helping to keep the Granite State one of the safest states in the nation. Law enforcement, as well as citizens across New Hampshire, have strong public safety concerns about allowing people to carry concealed guns without a license and oppose removing the protections that the licensing process offers to help ensure that potentially dangerous individuals are not allowed to carry hidden weapons. “Our permitting system gives an important oversight role to local law enforcement, while allowing for appeals through appropriate channels. In his book Live Free or Die, Republican Governor Mel Thomson said that the current permitting process for concealed carry is ‘a ..."},{"comment_id":"10154461137273162","commenter_b":"@username is clearly an anthropological & archaeological authority on the issue of Jewish history. Oh, and he was apparently elected to be the Arbiter of Jewish Identity, seeing as he now has the right to decide which Jews belong where","commenter_a":"I'm sorry Bibi - you know bunch of us real Americans LOVE you !!","post_message":"Now he’s “Boo Boo!” Netanyahu! The Israeli Prime Minister Benjamin aka “Bibi” Netanyahu received a chorus of boos from the most American of audiences: New Yorkers who paid exorbitant sums to see the ever sold out smash hit “Hamilton.”"}]
