[{"comment_id":"1169592283127367","commenter_b":"She wears a 12.700.00 oven mitt! And Bulaps sacks look good on her too!! #TRUMP2016","commenter_a":"Ever notice how the Sign for Trump and Pence sound like Trumpets? Could be echoing the arrival of the Four Horsemen.","post_message":"Donald J. Trump, Sen. Joni Ernst, and others campaign in Iowa at the Iowa senator's second annual Roast and Ride."},{"comment_id":"10152896761617293","commenter_b":"and the mob was mad when he called thm out too .... NEXT!! -","commenter_a":"Nothing like calling them as he (and most of the rest of the world) sees 'em!","post_message":"\"Currently, an evil front is being formed against us,\" he said. \"Now the pope has joined this conspiracy.\""},{"comment_id":"10153894447031130","commenter_b":"I'm sure that's very concerning to her. News flash: women aren't interested in your opinion of them.","commenter_a":"She is not attractive or funny to me at all.","post_message":"And Amy Schumer looks fab, of course."},{"comment_id":"903890666313022","commenter_b":"She better bring a big army.","commenter_a":"Well michelle said before she is out of the White House she is going to have guns taken away from the American people","post_message":"Outrageous!"},{"comment_id":"1649233105382359","commenter_b":"@username well it doesn't seem to be on the minds of the ones that are. If it was they might not have sex at that moment","commenter_a":"That is nothing to brag about. You should find some other talking points to criticize Trump on. Abortion should be the last thing on a 14 yr old girls mind.","post_message":"Actress Ali Wentworth: When Trump Won My 14-Year-Old Daughter Complained There’d be “No Abortions!”"},{"comment_id":"10152729868175667","commenter_b":"Oh calm yer tits..it's just fun","commenter_a":"I may stop following USA Today because of this specific post. The guy isn't even old enough to run and you're reporting it like its important, which just means you made a joke out of yourself.","post_message":"President Flame would be a pretty epic name. Just saying."},{"comment_id":"10153847085126162","commenter_b":"Girl stfu ^^^ u dumb. That's not y.","commenter_a":"As long as her son has a decnt funeral, I dont judge her for using donations for what she needed besides funeral expenses. If it was enough for her to buy a house out of the hood Im sure she would have done that too! If she is partying and gloating about thats not cool. But a scandal after tour the death is kind of hard to deal with so...i cast no judgement.","post_message":"9-year-old Tyshawn Lee's mom is accused of spending money donated for her son's funeral expenses on a new car. FULL STORY: @webpagelink"}]
