[{"comment_id":"1371535832866166","commenter_b":"What's wrong with strippers? Lol","commenter_a":"I cant believe you fools who support absolute political corruption.... you will lose your homes and jobs, mark my words, she is Obama part 2, choose wisely sheeple","post_message":"ELECTION DAY: People are casting their ballots across the country today. Have you cast your vote yet? Who do you think will win? Our coverage starts at 4 p.m."},{"comment_id":"713882998713829","commenter_b":"...then get to it...show the American citizens that you politicians have some cajones...IMPEACH the MF'er!!!","commenter_a":"THIS IS THE FIRST TIME IN HISTORY THAT A LEADER OF THE FREE WORLD ISN'T HELD ACCOUNTABLE FOR HIS ACTIONS . AND I WOULD LIKE TO KNOW WHY.","post_message":"The American President... Or Jihadist In A Suit? ⋆ Dc Gazette... @webpagelink"},{"comment_id":"10153033074808837","commenter_b":"To those with negative comments : May your offspring never have any genetic challanges. I'd hate to think of your lack of support to them","commenter_a":"You are a great dad, she must see you as her hero.","post_message":"HOW GREAT IS THIS? A father looking to support his 6-year-old daughter got a tattoo matching the same implant device that she received in her ear."},{"comment_id":"943402869028468","commenter_b":"It is only because all the other politicians want illegal's here. Trump is watching out for the American People!","commenter_a":"It's being said that Mr. Trump is causing problems for the GOP; taking votes from the others. BS! I'm Indy/democrat, and trust me, I'm voting for Mr. Trump! Any other Indy/democrats doing the same?","post_message":"BREAKING"},{"comment_id":"10152906344266717","commenter_b":"#BullShitAssHole","commenter_a":"hater!","post_message":""},{"comment_id":"10153311243783690","commenter_b":"Muslims and Crishtians in Kenya have lived among eachother peacefully. How come we never fight religion for thousands of years and these scam bugs are dividing us and using religion because of their own business. Kenya troops has nothing to do being in Somalia. This terror group kill it's own people. If u disagree with them they will kill you even if u are a Muslim . As amuslim somali man, when I was in Kenya I used to play football with Kenyans and respected eachother. They neve harmed me and I never thought harming them because when we know the value of humanlifes. Kenya government should build county police and protect all university, malls, and give good salary to the police and security intelegence. Iam sorry to say this your police are corrupted. Give your police a good salary so they will protect ur citizens and the country. Ethiopian ...","commenter_a":"Just wondering why only Moslem students were freed!","post_message":"\"I am so worried, I had a son who was among the students trapped inside the college, and since yesterday I have heard nothing,\" said Habel Mutinda, an elderly man, his face streaming with tears. \"I tried to identify his body among those killed... I have to do that before the body goes bad in the heat.. I have been camping overnight, it is really hard, it hurts.\" @webpagelink"},{"comment_id":"10154650140738984","commenter_b":"Lol Thomas.. I always look for that very same sticker.","commenter_a":"They could have lost their job after they bought the car. That also could be their groceries for the month. When I worked at Walmart I would see carts like that and see that a lot of people would buy their monthly groceries at one time. So if you broke the cart down into 4 it really wouldn't be that much.","post_message":"This man noticed a difference between his cart and one in front of him in line at the checkout. What he saw next is royally ticking off Americans everywhere."}]
