[{"comment_id":"10154958123446037","commenter_b":"Go away troll 🤣🤣🤣🤣🤣","commenter_a":"Why should the taxes I pay be used to pay for security for a billionaire that pays no taxes?","post_message":"“New York City taxpayers should not be on the hook for 80 percent of the national bill to protect [Donald J. Trump] and his family’s residence.\""},{"comment_id":"555451794642427","commenter_b":"About 40% of the nation supports Drumpf. The educated States should secede from the Union - ignorant racist are a cancer that needs to be excised.","commenter_a":"Suicide by obstructionist behavior.","post_message":"A lot of discussion has centered around the fact that we might be witnessing the death of the Republican Party. What would that look like?"},{"comment_id":"537397173122691","commenter_b":"Letting illegals into the country","commenter_a":"Is there anything that does not get lefties in an uproar? Anything at all?","post_message":"This photo has San Francisco Leftists in an uproar!"},{"comment_id":"879699705417529","commenter_b":"NO !!!!!! MORE !!!!!! ENFORCE THE LAWS & SEND THE ILLEGALS ALREADY HERE BACK TO \" WHEREVER \" THEY BELONG !!!!! WE NEITHER WANT THEM HERE ,,,, NOR CAN WE AFFORD TO SUPPORT ALL THEY ARE GIVEN !!!!! HELP THE PEOPLE IN AMERICA ,,,,, NOT THE ILLEGALS !!!!!!","commenter_a":"So if we harbor a criminal we go to jail, but providing \"sanctuary\" is different, right? Pffffft. A rose is still a rose....","post_message":"(VIDEO) HILLARY CLINTON'S TWISTED APPROVAL OF SANCTUARY CITIES FOR ILLEGAL ALIENS Stop the invasion!"},{"comment_id":"433149650143409","commenter_b":":)","commenter_a":"done & done","post_message":"\"Work hard, play hard,\" is the lie they want you to buy. #fuckwork"},{"comment_id":"960936923986215","commenter_b":"She is loud!!! Trump!!!","commenter_a":"Now I'm really confused, Trump is not the true conservative, and I thought Palin was.","post_message":"Sarah Palin is ready for someone who can take down ISIS and #MakeAmericaGreatAgain- are you?"},{"comment_id":"1142306435836110","commenter_b":"What a piece of shit! And fuck the judge that his mommy and daddy paid off!","commenter_a":"White privilege at its best","post_message":"Man charged of raping 2 unconscious women only gets probation and won't have to register as a sex offender! #WSHH #SMH"}]
