[{"comment_id":"1324204954284728","commenter_b":"This is the future of the Democratic Party. She's sick .","commenter_a":"Thank goodness she got what she deserved.","post_message":"While out preaching on the sidewalk, a man was shocked to see a woman quickly approaching. Unfortunately, things would take a horrifying turn as the vile woman pulled something from between her legs and decided to gift him with it – but she wouldn’t be laughing just a few short days later. @webpagelink"},{"comment_id":"1044417148951095","commenter_b":"Ignorant bitch","commenter_a":"It's not people like this woman that scare me, it's the people that agree with and support her.","post_message":"Oh, and climate change is a hoax too!"},{"comment_id":"537911889728124","commenter_b":"Public service would be great; picking up road trash; working in the parks; finding real jobs and repaying money bilked from you and me. OR, whatever; probably don't need to put them in already over-crowded prisons; make them work, not get free room and board in jail.","commenter_a":"Yes indeed","post_message":"It's about time! Do you think all welfare abusers should be arrested?"},{"comment_id":"10153273987738984","commenter_b":"Does this F*CKTARD actually think I'll stop saying Thanksgiving? What a moron! Keep poking the bull bitch!!!","commenter_a":"Obama is a Fucking traitor and Muslim Asshole.","post_message":"Seriously Obama? What are you going to take away next? The NFL? Apple Pie?"},{"comment_id":"10153504938416336","commenter_b":"This woman, is what evil looks like. They all must be shut down!!!!!!!!!!!!!!!!!!!!","commenter_a":"Wonder what she would do with video of Charlie boy's gang inside the Tate house? Give them medals? #FreeCharlie!","post_message":"Calif. AG Kamala Harris will use her office’s authority to regulate charity organizations to see if the organization that made the videos violated registration or reporting requirements, or broke any other rules."},{"comment_id":"10155057562030725","commenter_b":"\"Bu-but! If we ban guns evildoers would be unable to buy them!! Rig-Right?\"","commenter_a":"you are so right MR, TRUMP ,","post_message":"If the people so violently shot down in Paris had guns, at least they would have had a fighting chance."},{"comment_id":"1134898503249901","commenter_b":"That's supposed to make me want to vote for her?????????","commenter_a":"From a Bernie Delegate: A hard day for most of us. I have contacts within both campaigns. Here what I was told yesterday and today. Clinton campaign to vote down every concession made to Bernie on the platform if he did not endorse her prior to the convention. Knowing that Superdelegates were not going to switch to his side without something major happening, the best he could do was hold on to the progressive concessions he won for US on the platform. He could not, in good consciousness let the GOP and Trump win, especially when we have a potential half of the Supreme Court Justices that will be replaced within the next 4-8 years. He was looking out for the future of our movement and our nation in this very hard decision he made. This post is not to tell you to vote for Hillary, or to not leave ...","post_message":"In the coming weeks, I will be announcing the creation of successor organizations to carry on the struggle that we have been a part of these past 15 months. I hope you will continue to be involved in fighting to transform America. Our goal will be to advance the progressive agenda that we believe in and to elect like-minded candidates at the federal, state and local levels who are committed to accomplishing our goals."}]
