[{"comment_id":"935501763157349","commenter_b":"Okay. That's more than a bit much. People shouldn't need to spread theirs legs that much. I wish people wouldn't call it man spreading though. I've seen women do it as well, and the name just sounds offensive.","commenter_a":"Frankly unless they refuse to close their legs to let someone sit next to them this is just stupid.","post_message":"They both spread their legs on the subway, but only one raised eyebrows. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10153235598706756","commenter_b":"Its when your chakras are misaligned, or your spirit animal needs a vet. The only treatment is #woofighters","commenter_a":"what exactly is \"psychic damage\"?","post_message":"Maureen Corrigan says the story \"reflects on the unearned power that beauty confers on its recipients; rather less convincingly, it also tries to make a case for the psychic damage of being beautiful in a world that's all too eager to rate women primarily on their looks.\""},{"comment_id":"10155692576378572","commenter_b":"hit her in the ass with the INK","commenter_a":"good riddence to you old girl you will be replaced go join Isis","post_message":"SHE IS ALSO A HILLARY CLINTON SUPPORTER..."},{"comment_id":"10153995580906037","commenter_b":"This is an ugly woman","commenter_a":"This is not a man. This is not a man who will handle such a public failure very well. This is not a man. This is not a man who was courageous enough to participate in the last Republican debate despite Megyn Kelly asking hard questions. This is not a man.","post_message":"In the week leading up to the Iowa caucuses, Donald J. Trump issued more than 120 tweets. He took 16 hours to break the silence after his loss to Ted Cruz ."},{"comment_id":"10153577383622061","commenter_b":"she is an african american woman and can clearly see the hand on the jacket is a white persons hand. Open your eyes","commenter_a":"This has to be photo shopped. The woman has 3 hands. 2 on her face and 1 on his coat. My father was a fireman too, but would not have been allowed to pull a stunt like this!","post_message":"WATCH: Firefighter goes to great heights, literally, to make one stunningly beautiful proposal!"},{"comment_id":"1317571668339082","commenter_b":"Same base of people that have supported him all along - not enough!","commenter_a":"Uhm, Trump is not losing support. Did you not see the amount of people that showed up to his rally today?? You've got to be joking!! He spoke to at least 25K people. And there were still people outside whom the fire Marshall would not allow in!!","post_message":"The National Rifle Association has spent more than $21 million on the presidential race, praising Donald J. Trump and knocking Hillary Clinton."},{"comment_id":"824242924358757","commenter_b":"You must be an ugly Bastard","commenter_a":"No money no love:)","post_message":"Only A Weak Man Would Make A Woman Love Him And Refuse To Love Her Back"}]
