[{"comment_id":"10153330773746336","commenter_b":"Killing America ....... Job by job......","commenter_a":"Good it should not be right to work, should be the best man for the job.","post_message":"“This proposed action by Obama’s Big Labor NLRB is a direct assault on a worker’s fundamental First Amendment right to freedom of association.\" – Greg Mourad, National Right to Work Committee"},{"comment_id":"1113246462026036","commenter_b":"I love being a princess. As you can see from time line Imma pussy","commenter_a":"She uses the same playbook as the very people she supposedly hates. Yet the morons line up behind her, rank and file. 'Murica.","post_message":""},{"comment_id":"10153310344686157","commenter_b":"If she gets droped off by the bus shes to young for you bruh","commenter_a":"If her shoes light up when she walks she is too young for you bro.","post_message":"Investigators believe 23-year-old Estevan Garcia sent naked Instagram photos to a 14-year-old girl. He worked for the Donna school district as a security guard."},{"comment_id":"882454405123315","commenter_b":"Divide and conquer Michelle. This is proof that you and your husband have sent this country back to a time of racial unrest and inequality like never before. I pray our country will soon be able to start healing and undue the damage you two have caused. In 18 more months, we'll be free of this kind of leadership","commenter_a":"She just proved racism towards the whites with every word spoken","post_message":"Michelle Obama is an embarrassment to America. We're ashamed to have her in the White House! WATCH what she just said..."},{"comment_id":"1827543604143155","commenter_b":"That's right, all you chowder-heads SEE and HEAR what you want to. If MALEIFCENT does win, it will be through 100% corruption...but then that doesn't matter as long ad she wins, right? That way all the unemployed, druggie, scumbags can keep up the anarchy. Well, hold on to your backpacks cause there's a shit storm coming, along with rude awakenings.","commenter_a":"Alexis Marie","post_message":"Even this focus group by Fox News's Frank Luntz agrees Hillary CRUSHED Trump. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154362181546077","commenter_b":"Put her in jail","commenter_a":"Go Trump!!","post_message":"Donald Trump rally live in Greeley"},{"comment_id":"10155424694168812","commenter_b":"@username Mexico is important! Why do you have to be so damn nasty??","commenter_a":"I can not way for Mexico start not combating drug dealers and not helping stop immigrants from other countries to reach US, then you will see how important Mexico is as a neighbor.","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"}]
