[{"comment_id":"1072916832798493","commenter_b":"I dont know who's right who's wrong because this is a mourning moment","commenter_a":"God bless President Bush and his wife! Atleast we know they love America! Even Obama's brother knows Barack is a failure, he started isis by withdrawing troops from Iraq and killing Gaddafi! by the way a funeral is a celebration of the person's life morons! The Obama's are an embarrassment!","post_message":"Actions speak a THOUSAND words. Take a look at Michelle's face..."},{"comment_id":"10153487180410667","commenter_b":"@username this couldve been you","commenter_a":"Outstanding young man and a very generous \"Thor \"","post_message":"\"I looked up at my mom and was like, 'ma, do you know who this is?'\""},{"comment_id":"10157403698925354","commenter_b":"This was a public city pool not a water park","commenter_a":"It happened at a water park here,as well, but never made the news?? What I want to know is how the refugees were able to afford the park. I have passes for my family but it is not cheap.","post_message":"IT'S STARTING. ***Report: Massachusetts Syrian 'Refugee' Swimming Pool Sex Attack of 13-Year-Old Girl***"},{"comment_id":"10153064926711770","commenter_b":"Allen, then why is Dr. Carson polling so high?","commenter_a":"Ben Carson keeps making weak, limp statements with Luke warm meaning for any cause he addresses. Instead of political correctness, he has validated Carson correctness! Too weak and lame to be a strong leader for a strong country. I like Mr Carson, but well intentions don't hold water in this crucial period in our country.","post_message":"\"I don’t want to see tyranny occur here,\" Dr. Ben Carson told This Morning, adding that \"we can’t always assume that\" good people will be leading our country."},{"comment_id":"10152948972001051","commenter_b":"You wouldn't see tomorrow if you shot my dog you pussy. I'll put a new asshole in your forehead","commenter_a":"NO DOG should be loose in public, PERIOD. Your loose dog will be neutralized if it approaches me. NO APOLOGY.","post_message":"Some people say the officer handled this situation correctly. Others say it was an overreaction. Decide for yourselves who is right."},{"comment_id":"10154573950249411","commenter_b":"Wow, it's funny how Democrats claim to be the party of love and tolerance but all her supports sound like you, ignorant!","commenter_a":"Way before this his own party should have replaced this dumb ass! And his dumbed down supporters have only remarks about Clinton whenever this ass wipe says and does something outrageously stupid! Shows they have the same low mentality as Trump! Trump doesn't have the smarts or the temperament for this position. Anyone who would want this dummy anywhere near some nuclear button are just as delusional as Trump or just as dumb and sure don't give two shits about this country! Trump will never ever be president of this country and we can look forward to one of the biggest meltdown and temper tantrums from this maggot!","post_message":"Case study: When mainstream media morphs into political activists."},{"comment_id":"1667182103568902","commenter_b":"Obama doesn't like this country or anyone who isn't Muslim. Everything he has done has been to weaken this country. He has opened our doors to terrorists, communists, illegals and Ebola. He has no respect for our military at all. It doesn't take a genius to figure out what he's doing.","commenter_a":"Love Sheriff Clark.","post_message":"Barack Obama is a USELESS president. I am counting down the days till he's gone!"}]
