[{"comment_id":"1390855700937474","commenter_b":"RACIST!","commenter_a":"I can't imagine ever turning down an invitation to the White House no matter what! As an American I would consider it the highest honor!!! Can I go in his place?","post_message":"We know that Brady, Belichick, and Bob Kraft are friendly with President Trump. But one member of the Patriots doesn't seem so keen on going to the White House."},{"comment_id":"1706307999389223","commenter_b":"That girl behind him tho hahahaahahaa","commenter_a":"Really people who cares how he looks!!","post_message":"Ashton Kutcher testifies at Senate hearing on ending modern slavery."},{"comment_id":"1072916832798493","commenter_b":"I dont know who's right who's wrong because this is a mourning moment","commenter_a":"God bless President Bush and his wife! Atleast we know they love America! Even Obama's brother knows Barack is a failure, he started isis by withdrawing troops from Iraq and killing Gaddafi! by the way a funeral is a celebration of the person's life morons! The Obama's are an embarrassment!","post_message":"Actions speak a THOUSAND words. Take a look at Michelle's face..."},{"comment_id":"10153370823461336","commenter_b":"Well Ryan it is better than putting Jenner on the bill","commenter_a":"Megyn Kelly","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"1874042932818866","commenter_b":"She is the mentally unstable one.","commenter_a":"And you should have left by now. We already elected him!","post_message":"Rosie O'Donnell says Trump is mentally unstable, and we have \"less than 3 weeks to stop him America. Do you think her comments are treasonous?"},{"comment_id":"10152854969571051","commenter_b":"Let behead these scumbags..What the F**k is wrong with people..Your parents should get their asses kicked","commenter_a":"Tell me where they live. I'll do the rest...","post_message":"These teens beheaded a puppy with a machete and posted the video to Snapchat. Then they picked up another puppy and did it again. And they didn’t stop there."},{"comment_id":"10153362958101955","commenter_b":"I agree. The Barbarians are within.","commenter_a":"Our own government is the biggest terror threat we've ever had.","post_message":"House Intel Committee Chair: US Is at 'Highest Threat Level We Have Ever Faced'..."}]
