[{"comment_id":"1825065494398013","commenter_b":"the people actually running for president and the SUPPORTERS of those candidates are two different things, dillan.","commenter_a":"The party of old white people is starting to show it's age","post_message":"BREAKING: 'I'm going to run in 2020. For president'"},{"comment_id":"1871694196449652","commenter_b":"Bahaha Anna O'Toole","commenter_a":"Kaylee Parsons-Cordrey Jessica Shoffner k I don't really give a fuck about either of them but ajdvabsjz skz yes","post_message":"The most bromantic sign of the day."},{"comment_id":"1547490425548819","commenter_b":"Hillary is worse than any of that and if elected she would be appointing supreme court justices who are in there for life. It is unfair to say that we need to re evaluate our values because we want some one who can beat her. In the end America as a whole is not voting evangelical prudence and wisdom would say pick any one who can beat her. My one and only comment. Blessings sister...","commenter_a":"Christians who support Trump need to reevaluate their values. I've never heard of Christians supporting a strip club owner who defends Planned Parenthood and doesn't care about marriage, but that's just me. Oh yeah, and swears continually!","post_message":"Editors' Note: The Christian Post has not taken a position on a political candidate before today. We are making an exception because Trump is exceptionally bad and claims to speak for and represent the interests of evangelicals."},{"comment_id":"1990611657665239","commenter_b":"Another vile rapefugee","commenter_a":"death penalty anyone ?? #asktrump","post_message":"Horrifying."},{"comment_id":"10154319616791337","commenter_b":"???????????? LOL ????????????","commenter_a":"Looking forward to Colbert's inevitable rant about this, since he has Cap's shield.","post_message":"PURE FURY! Captain America fans are losing their sh*t over this decision..."},{"comment_id":"10156266292905294","commenter_b":"He was white u racist b*tch","commenter_a":"Probably some ghetto trash. Where is Obama when blacks rob??? Where is he?","post_message":"The Papa John's Pizza regional manager said a man entered the store with a gun and demanded money. A chase began shortly after:"},{"comment_id":"525940174197243","commenter_b":"And that is why we need to vote for Trump...with Cruz you will get an open southern border and amnesty.","commenter_a":"No vote for Cruz, he is a politician, just cannot trust politicians democrat or republican. Politicians will tell you anything to get you to vote for them, they get into office and do not follow thru.","post_message":"Agree or disagree?"}]
