[{"comment_id":"10153170015287690","commenter_b":"Eeewww No girl!!! Hate Snakes","commenter_a":"Margaret thought of your pet at Millies.","post_message":"\"If one got in the house or in the cars, I would have to move.\" One North Texas family fights hundreds of copperheads on their property: @webpagelink"},{"comment_id":"1248206901866985","commenter_b":"Ali Berdai haha","commenter_a":"Alex Bond","post_message":"By Liz Climo."},{"comment_id":"10156270295245354","commenter_b":"Illegals voting in California this should give the liberals some help. GO Trump !!!","commenter_a":"They focus on Gun Control, in the Debate, they will lose the Election","post_message":"Here's what's on deck for tonight's Democrat presidential debate..."},{"comment_id":"10154739043556336","commenter_b":"Did you read her comment, Michael? Kapernick has his rights, we have ours. But our rights aren't as relevant?","commenter_a":"And yet again, we have the right to not patronize the NFL that allows players to disrespect our military, LEO and country.","post_message":"\"If you have the platform to speak up and you choose to do so, then that is your prerogative,” Derek Jeter said."},{"comment_id":"10153834062371337","commenter_b":"You win the Internet today!!!","commenter_a":"Well, maybe when they introduce an HIV vaccine, she can get vaccinated.... Oh, wait...nevermind.","post_message":"Jenny McCarthy is not taking the Charlie Sheen news well..."},{"comment_id":"1073730232720030","commenter_b":"Their all prostitutes, lol","commenter_a":"Mika was raised and programmed to be a prostitute by her father. She's very accommodating when it comes to white politicians and Chinese business men.","post_message":"A hot town hall mic just exposed Trump as the fraud he is."},{"comment_id":"10153271515149087","commenter_b":"Stfu old bitch","commenter_a":"God help America if Hillary or Sanders ever become president","post_message":"Bernie Sanders is leading Hillary Clinton by a stunning 30 points among voters under 30, according to NBC's first post-debate poll."}]
