[{"comment_id":"10153952900813984","commenter_b":"She should Benin jail!","commenter_a":"How many of those radical Islamic terrorist countries donated to the Hillary fund. She knows they did.","post_message":"Hillary thought she'd jump on the opportunity to steal some attention from the Republicans during the debate, but it did NOT go as planned. Critics immediately fired back and pointed out something hilarious... Is Hillary Clinton one of the last people you would ever want to become president?"},{"comment_id":"10153179958482377","commenter_b":"I agree - feed her to pigs and feed the pigs to refugees!","commenter_a":"Feed them to pigs, then send the excrement to Mosques","post_message":"No Muslim mosques have offered to conduct a funeral for the terrorist wife. If not claimed, her body will be cremated at taxpayers' expense but there's more...@webpagelink"},{"comment_id":"1670513393170878","commenter_b":"Hey he's jerking with his shit as lube on his pussy","commenter_a":"Wow it takes like 15 or more cops to take down 1 fucking guys.....pussy as pigs","post_message":"The most glorious thing we have ever seen. #thinblueline Footage from moments ago when protestors shut down HWY 70 near our shop. When the SHTF make sure you have the right SH*T @webpagelink"},{"comment_id":"10154281842244726","commenter_b":"We the people ? ? ? , , , . Give me a break, , , your pigs in a cesspool of immorality . Eat shit and die.","commenter_a":"Hypocrites","post_message":"The Left would call violent protests a ‘hate crime’ if roles were reversed."},{"comment_id":"854169234726517","commenter_b":"How about rapist?","commenter_a":"If trump is despicable, what does that make Hillary ?","post_message":"\"He’s just despicable,\" Letterman said, adding that Donald J. Trump may very well prove the saying that \"anyone can grow up to be president.\""},{"comment_id":"1203183663111217","commenter_b":"STFU","commenter_a":"Nothing Mr. Trump does compares with crimes Hillary and obama have committed.","post_message":"A prominent Republican who supports Donald Trump urged the candidate to start acting like “a potential leader of the United States.”"},{"comment_id":"1126946630726765","commenter_b":"@username accepted money/bribe from the Clinton Campaign/Foundation. Recent documents released from wikileaks show! He is part of the problem and is an enemy of Americans at this point!","commenter_a":"clinton-foundation-invoiceAs you can see, the page from the Accounts Payable Invoice lists 14 names to whom the Clinton Foundation had paid considerable sums of money for suppression: $89,000 to A.C.O.R.N. $42,300 to William (Bill) Ayers: unrepentant former Weather Underground domestic terrorist; early supporter of and like ghostwriter for Barack Obama. $109,000 to @username, the radio show host who was an avid supporter of Ted Cruz during the GOP primaries, and continues to be a diehard opponent of Donald Trump. (See suspended by SiriusXM radio for hinting at Trump assassination) $203,000 to Black Lives Matter. $333,400 to the Black Panthers. $10,000 to Bill Kristol, founder and editor of the conservative magazine The Weekly Standard and, like Beck, is dead set against Trump. (See Kristol declares there will be a 3rd-party candidate against Trump) $80,600 to Monmouth University, presumably the university Polling Institute that conducts political and election public opinion polls. $12,000 ...","post_message":"Must watch."}]
