[{"comment_id":"1757028301196802","commenter_b":"@username more than likely you are a illegal alien .","commenter_a":"Just the thought of having a mother/grandmother in the highest office..refreshing! Go Hillary! Have a great day with your wonderful family!","post_message":"Happy Mother's Day to Charlotte's mom, and my wonderful daughter, Chelsea Clinton."},{"comment_id":"10155469339470093","commenter_b":"NOOOOOOOOOOO!!! PLEASE no!!!!! Idiot progressives!!!","commenter_a":"Why would this NOT piss off everyone in NY who are legal tax paying American citizens??","post_message":"The impossible may soon become possible."},{"comment_id":"10154440259724060","commenter_b":"Bitch i know everything","commenter_a":"@username stay humble","post_message":"Our quote of the day is from English poet Percy Bysshe Shelley"},{"comment_id":"10153646192306880","commenter_b":"They like getting in touch with their feminine side. :)","commenter_a":"I have the man color, slate grey.","post_message":"Let's face it, the \"rose gold\" iPhone 6s is pink."},{"comment_id":"1311726352220443","commenter_b":"Percy Lopez. ...taken to the cleaners, you have been schooled Percy, what's it like being a moron","commenter_a":"The best president ever!! Turned the economy 360 degrees after Bush's administration crashed it to the ground. You have done everything you could to help america Mr president. Your courage, dedication and integrity brought tears of gratitude to so many american people.","post_message":"'I can drink beer at 11.30am and Michelle won’t even know?'"},{"comment_id":"1757186537848800","commenter_b":"BECAUSE SHE IS CROOKED","commenter_a":"Trump for president!","post_message":"\"When you look at the record, and when you look at what [Hillary Clinton's] actually done, when you look at Benghazi, when you look at all the instances over the last multiple decades… I think it fits.\" Donald Trump Jr. reacted to his father’s new nickname for the Democratic presidential candidate — \"Crooked Hillary.\""},{"comment_id":"10153414800625933","commenter_b":"Liars make me sick.","commenter_a":"John, you seem very busy these days, but who is governing Ohio at this time? Do you plan to reimburse the Ohio tax payers ? That would be the right thing to do . You have been eliminated for months. Get back to making Ohio great. Do the job your being paid to do.","post_message":"Let’s Get It Done."}]
