[{"comment_id":"1486825354715718","commenter_b":"Thank you","commenter_a":"The judge then goes through the charges and dismisses the girl, to which she smugly replies, “adios!” He orders her to come back for the way she left, then increases bond for her charges from $5,000 to $10,000. “Are you serious?” the girl asks angrily, before saying “f-- you!” to the judge and storming off. She is then ordered to return again, and the judge becomes furious with her attitude. “Did you say ‘f--- you’? Did you say that?” the judge asks. “Yes sir, I did,” the girl responds. “Oh you did say that?” the judge replies. “I find you in direct criminal contempt. Thirty days in the county jail.” The video from 2013 went viral, with many praising the judge’s decision to punish the girl for her harsh words and attitude towards him.","post_message":"A judge thought he misheard what this teen girl said to him, so he asked her to repeat herself. She did. When he realized he hadn't misheard, the judge issued a response that the teen girl wasn't expecting."},{"comment_id":"991037997658085","commenter_b":"Bitch didn't get cheated, she got outplayed. Sour grapes!","commenter_a":"The American people have had enough I being manipulated by candidates that don't know how to quit when they're beaten. Hey Idon't know where thus 2nd ballot thing comes from but they better knock it off before they a billion pissed off Americans !!","post_message":"CRUZ POACHES NEARLY ALL AZ DELEGATES Jan Brewer: 'I Got Cheated!'..."},{"comment_id":"1213366555426261","commenter_b":"More illegals equates to more democratic votes due to the dreams of entitlements and riches. Look at California (seems to start on the west coast), they are making it as easy as they can to give illegals the opportunity to vote...they even have a few illegals in city government! More democratic votes keep Dems in power, which means more taxes from the middle class which eventually places people closer to poverty...which places more government control over it's citizens...Hence the \"Democratic Agenda\". That \"Agenda\" puts us that much closer to the \"New World Order\"!!! Guess who would be the leaders of the \"New World Order\"?","commenter_a":"#TrumpOnTrumpingOn2016! BREAKING NEWS: \"Reince Priebus, Paul Ryan, Karl Rove, Stealing RNC Donation Money\"! ~ Hon. Roger Stone","post_message":"A country that for generations saw millions of its citizens cross into the U.S. is suddenly telling its southern neighbors they can no longer do the same."},{"comment_id":"1788246978118850","commenter_b":"She is garbage.....","commenter_a":"Your a f*cking idiot. Please leave the country. I'll buy your ticket.","post_message":"During a show in Tampa, Amy Schumer brought an audience member on stage and quizzed him about his decision to vote for Donald J. Trump."},{"comment_id":"1693513877603730","commenter_b":"This is silly. People may not like him me included but who Someone decides to vote for should be there choice and not pushed on them. That's exactly what this would do. I supposed you also felt bad for the Emory students that cried about some chalk?","commenter_a":"Futile","post_message":"#VoteTrumpGetDumped is encouraging women to dump Donald J. Trump supporters because of the way he treats women."},{"comment_id":"729261537208194","commenter_b":"Not for criminals!!! More sheeple...","commenter_a":"When is everyone going to realize that gun control laws only apply to the law abiding citizen's? Criminals could care less what law is out there that says something is illegal, such as murder, drugs, ect.","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.” Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"445713658965481","commenter_b":"Time to start rounding up these radicals. They will destroy everything","commenter_a":"Is time to retaliate! !! A good MUSLIM IS A DEAD MUSLIM. ... kill them all ......","post_message":"A Florida College Student was Brutally Attacked by Five Muslims On Patrol Enforcing Sharia Law. @webpagelink"}]
