[{"comment_id":"10153657767106051","commenter_b":"OMG... A bunch of women who can't stfu!","commenter_a":"This isn't a political website Lorretta so move on.","post_message":"Olivia Newton-John's ex vanished on a fishing trip 10 years ago. Now, more than a decade later, we finally know what happened to him."},{"comment_id":"642366659287246","commenter_b":"Megan, you do a great job for Fox. They are lucky to have you.","commenter_a":"Fair and Balanced?!?!?","post_message":"Megyn Kelly may be getting kicked off the air... FOX needs our support, let's give it to them. Do you support FOX News?"},{"comment_id":"497552493768664","commenter_b":"she can drop dead for all I care","commenter_a":"Irrelevant liberal rhetoric, out of the idiotic blathering mouth of a pitiful bitch who doesn know what damn day it is....","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"10153036402924885","commenter_b":"excuse you? I am so sick of all that we went through when we brought the rams here, and they aren't that great a team to be trying to drum up public support for them again. If you're such a good fan, how bout you follow then to wherever they end up!","commenter_a":"Let 'em GO! Let 'em GO!","post_message":"Details of the plan for a new downtown football stadium were revealed today. Peacock called the project more than a football stadium: \"We are talking about a revitalization of our downtown.\" Take a look and let us know what you think."},{"comment_id":"10152874752876336","commenter_b":"Don't let her have kids exterminate this animal.","commenter_a":"Shoot on sight!","post_message":"Manhunt underway: Police are searching for Hayat Boumeddiene, a suspect in Thursday's murder of a French police officer. Tune in to Fox News Channel for special coverage now."},{"comment_id":"10153200362991943","commenter_b":"Cause she's sn idiot","commenter_a":"obama and his ilk will kill us long before the climate.","post_message":"Why is Obama EPA administrator, Gina McCarthy trying to scare Americans into believing \"Climate Change\" could kill them?"},{"comment_id":"10154739043556336","commenter_b":"Did you read her comment, Michael? Kapernick has his rights, we have ours. But our rights aren't as relevant?","commenter_a":"And yet again, we have the right to not patronize the NFL that allows players to disrespect our military, LEO and country.","post_message":"\"If you have the platform to speak up and you choose to do so, then that is your prerogative,” Derek Jeter said."}]
