[{"comment_id":"693135860835189","commenter_b":"@username you are too old to be so stupid. Old white men are disgusting.","commenter_a":"Clinton is a LOSER. She may win the Democratic nomination but Sanders supporters will NEVER vote for her = she's lost the general election. Sanders can win it either as a Democrat or independent or third party. . Clinton forgot one thing...,she antagonized Sanders supporters so much that even if he begged they would not vote for her. Not a winning game plan.","post_message":"Hillary Clinton knows exactly how to beat Donald Trump, and she has what appears to be a winning game plan. --Andrew"},{"comment_id":"10157269253925500","commenter_b":"and they get paid less than the men! I have to say that these ladies look to be a MUCH stronger group physically than the men.","commenter_a":"Agree!","post_message":"Let's go, Team USA! The women's soccer team looks to be the first to win a World Cup and then Olympic gold in the following year. WATCH LIVE @ 4: @webpagelink"},{"comment_id":"10152869461365927","commenter_b":"\"kill another Fetus now, we don't like Children anyhow\"","commenter_a":"If Republicans supported an organization that murdered 90,000 black babies last year OMG. PP would be the worst place since the death camps of the Nazi's. But godless \"Demon\"crats like Hillary are the true racist as they use PP as a form of population control to keep black birth rates down and the black population under control. Dems have always been the party of hate(KKK) and division, they still are they have just convinced the black race that they are their friends and supporters,,,,, really","post_message":"Planned Parenthood Director of Research Melissa Farrell makes STARTLING statement about dissecting aborted babies ..."},{"comment_id":"1025021754204963","commenter_b":"Will make the perverted staff , horny ?","commenter_a":"Give gun control without rules. Makes a lot of sense. Not. But tell a little girl she can't feel pretty. :(","post_message":"A father bought an adorable dress for his adorable little 5-year-old girl but her school forced her to wear a t-shirt and a pair of jeans because her shoulders were showing and Texas school officials couldn't handle it."},{"comment_id":"544761025684245","commenter_b":"Liars don't smile a lot.","commenter_a":"What Killiary considers a welcome endorsement would be considered a sin and disgrace to any decent human being. Furthermore , what satan's secretary calls the \"extreme\" position of Republican candidates on women's health is really a quite normal position for any one who wants to protect a babies life and quite possibly the life of the mother as well. Of course that position endangers the finances of planned parenthood so naturally Ms. Richards , who would lose her lucrative job if abortion is outlawed, wants to help elect someone who favors her cause. May God have mercy on Clinton, Richards and all like them who promote the culture of death.(MA)","post_message":"The endorsement marks the first time Planned Parenthood has waded into a presidential primary."},{"comment_id":"602931503228475","commenter_b":"I have never heard of or seen a cow attack a person!!! No Good Worthless Muslims!!!","commenter_a":"Those men will burn in hell one day","post_message":"Two Men Were Stabbing a Girl in “Honor Killing” When This Cow DID THIS to Stop Them…"},{"comment_id":"1701604063395144","commenter_b":"Ze pretty ladies","commenter_a":"@username William Joseph.. You boys come get me !","post_message":"So I'm on my way to Germany to get arrested."}]
