[{"comment_id":"626305930908697","commenter_b":"@username Yeah, those toddlers with guns are out of control right now.","commenter_a":"I blame Obama and Bush, Bill and Bush snr for forever labeling all Muslims as terrorists . they didnt know that by doing so they created further hate for Muslims in america and this is the result","post_message":"Kim Kardashian West made her opinion known (via Daily Mail Celebrity)"},{"comment_id":"1527434820649594","commenter_b":"@username she's a cow","commenter_a":"They are like at least 5 articles about Kim Kardashian every day.. Kinda tired of this. She was robbed and shes still rich and has millions in the bank. Its not the end of the world. They are things & news that are MORE important than Kim's life!","post_message":"Kim Kardashian West's friends are rallying around her"},{"comment_id":"472965199559859","commenter_b":"I'd be packing my bags headed for Ecuador.","commenter_a":"If hell freezes over and Trump actually wins the White House, I forecast that the USA will see the largest mass exodus of the intelligentsia class of citizens in the history of our country. Those people capable of using 3-4 syllable words including researchers, doctors, teachers, scientists, and engineers will not be able to stomach the idea of a golden haired baboon driving the nail into the coffin that was once the United States of America. May God have mercy on us.","post_message":"Donald J. Trump: \"Happy #CincoDeMayo...I love Hispanics!\""},{"comment_id":"1179417458812166","commenter_b":"The apple didn't fall far from the tree. She is just as dumb as her momma lol .","commenter_a":"They didn't have a plan besides the same tired failures the current admin did and her daughter is just as fugly as Nancy .","post_message":"Nancy Pelosi's daughter went full-on crazy during this Friday Fox interview..."},{"comment_id":"934315223319642","commenter_b":"Michelle Owen Nyki KiKi 😂😂😂😂","commenter_a":"AHAHAHAGA help","post_message":"Via The Everlasting GOP Stoppers"},{"comment_id":"644827892343831","commenter_b":"If you agree with Mike's comment you're a sexist ignorant shithead. Thanks Mike for demonstrating what sexist assholes think!","commenter_a":"Does anyone know what is considered rape? Rape is one of the most hanus crimes that can be commited. But can anyone really know if rape was commited. Many cases each year happen when 2 people have sex and then the girl just changes her mind and calls it rape. Now i dont know all the details in this case, but maybe this judge knew more than we did.","post_message":"Judge Aaron Persky infamously handed down a sentence of six months jail time to Brock Turner in June."},{"comment_id":"1695404184069071","commenter_b":"She's just a fat old cow","commenter_a":"Getting offended over what a woman with no pants on has to say at a game where men are paid millions to crush each other for a ball....Just wow.","post_message":"Some people didn't notice what was happening during Beyonce's performance last night... but these sheriffs did, and they were appalled. Did you notice what Beyonce did?"}]
