[{"comment_id":"968475119944707","commenter_b":"Man this website is So So So Biased, how can you take a political stance all day long to put down trump(4 to 5 articles a day) trump is this, trump is that, can we even call you a news website anymore??? How much money did the hill team fill your coffers with??? Do you not care about the world?? It's bleeding out in the middleeast :( you completely put out the best prospective candidates bernie, Jill, Gary. You leave trump cuz he doesn't say too many intelligent things but he is more human than any of the Warhawks that's been running the murica for a decade now!!!! Please people we need to spread the truth and love not put people down and dish out hate all day!!! Here's my finger to you Huffington","commenter_a":"put a toothbrush moustache on hillary and then it would be appropriate to yell 'heil hillary!' What is going on in 2016, appears to match severial elements to the 1934 German presidental election. For example: 2016 Democrate liberials ruthlessly beating up on Republican voters. Local Police (Fresno Ca) allowing violence as a policital objective at a Trump event. Propaganda; political acuity against conservative thought and the deceptiveness of 90% the media to sway voters towards hillary. Can anyone define all the promises from this great fuhrer hillary to buy their votes? HEIL HILLARY! Even the Universities and High Schools are exercising power over speech they disagree with. This is a time of struggle 'Kampfjahre.'","post_message":"They really got riled up about his birther-announcement fiasco."},{"comment_id":"739879102780921","commenter_b":"She's biding her time!!!","commenter_a":"Let me offer you, @username, some unsolicited and unqualified advice since I'm not a politician. There is no way you should be neck and neck with Bernie Sanders. But you're playing weak. Go on the attack. Use your willingness to stay in a marriage regardless of your husband's infidelity as a selling point. We all know people make mistakes. Marriages often dissolve over a hint of unfaithfulness and unforgiveness. Only the extremely strong can take a mistake made by a spouse to demonstrate their character. If I'm not mistaken this is Sanders' second wife and 'The Donald' has had three wives and several affairs. How many times have you been married? They can't use President Bill Clinton's infidelity to their advantage, but you can. Who are the people advising you?","post_message":"Jimmy Fallon: Can we do a Snapchat? Hillary: Sure! 👻"},{"comment_id":"1895551420676942","commenter_b":"Its not a muslim ban you morons.....learn facts. The top 5 countries in regaurds to muslim population are still traveling with zero restrictions. Its a 3 month travel ban from the 7 countries with strong terror ties....and 3 months until the fix the problem of Isis slipping through the cracks. And if he is so mean and horrible, what is Obama and the rest of the democrates? Because this \"Ban\" is the exact same one Obama used in 2011 only Obama did it for 6 months...not 3. Please open your eyes before you spew blind hate.","commenter_a":"You are and idiot. Wake your ass up shame Trump has to protect you.","post_message":"Share if YOU stand with Sally Yates, too. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152776711902014","commenter_b":"Swatting twitch users I bet!","commenter_a":"#rekt","post_message":"A 17-year-old teen from Surprise has been arrested for several \"swatting\" incidentsin which she reported fake shootings and bomb threats."},{"comment_id":"903907673040205","commenter_b":"Just leave NOW you RACIST!! Forget Trump!","commenter_a":"leave now","post_message":"If it comes down to Trump and Hillary... Here's a BIG reason to vote for Trump. Take our poll! @webpagelink"},{"comment_id":"593869030794976","commenter_b":"#killery #neverforget #emailscandal #saudibribes #womandestroyer #liesthroughherteethwithasmile #corrupt #unfitleader","commenter_a":"Headline reads...CLINTON AND TRUMP UNFIT 2B PRESIDENT","post_message":"It was one of the great body slams of presidential politics. Donald is hurting at this moment."},{"comment_id":"10152763408026717","commenter_b":"Let's threaten to slit the throat of little bitches, see how this Bitch feels","commenter_a":"Hes gay as well !","post_message":""}]
