[{"comment_id":"10152628736511367","commenter_b":"so leave, gentle lady","commenter_a":"You are not a fair news outfit or discussion platform! You leftist asskisser mother @##$%^^%%^s.","post_message":"\"The only thing we have to fear is ... \" @webpagelink"},{"comment_id":"1225168154206852","commenter_b":"No woman in her right mind would have voted for this man. God help us all.","commenter_a":"Genial","post_message":"'Donald Trump will make our economy great again'"},{"comment_id":"10156281148690725","commenter_b":"The wife knew what was going on","commenter_a":"The non-profit has rules and he \"didn't follow them\" (I guess) so the family should return it. 100 Club should learn by this mistake and not give out money till the ruling is over...Everyone expect the family to put a \"Go-Fund-Me\" page up soon :/","post_message":"An organization that helps the families of officers during times of need is now asking for the substantial donations made to the loved ones of Lt. Joe Gliniewicz to be returned ----> @webpagelink"},{"comment_id":"947324245313643","commenter_b":"Sick witch, heartless.","commenter_a":"Arrested her","post_message":"Police say woman hid body of dead son in trunk of her car. According to police, the boy was last seen in 2004. @webpagelink"},{"comment_id":"10153238705381717","commenter_b":"Yes, well if you're a woman who's into men, that is how it should be. Is there any particular reason you're trying to pick a fight?","commenter_a":"What's next ppl marrying there pets!# Gross..one man and one woman period. DAMM GAYS","post_message":"In case you missed it:"},{"comment_id":"10153007291820667","commenter_b":"yes... weed is as bad as crack. and if they made crack legal, will you or anyone you know start using it? if not why? its legal.... everyone will use it if its legal....","commenter_a":"Crack Cocaine is next! Woo hoo!","post_message":"Cloudy with a chance of pot smoke."},{"comment_id":"10153997571366378","commenter_b":"So glad they got him! That beautiful child did not deserve to get shot. God bless her.","commenter_a":"Why am I still shocked by such brutal events? Such a sweet looking child.","post_message":"#BREAKING: A man has been charged with murder in the shooting death of 8-year-old Gabrielle Carter in Camden, New Jersey. The 18-year-old suspect was arrested Friday morning at a relative's home in Tennessee."}]
