[{"comment_id":"10153312996021167","commenter_b":"He has also said that Muslims need to be deported, whether the are American citizens or not. 😖","commenter_a":"Brokaw makes a false comparison. In the 1940's, many Japanese were US citizens, and living here already. Their internment was a knee-jerk reaction to a very real fear that the Empire would try to invade our country with help from loyalists living here. Today, there is no nation threatening invasion, but rather a rogue terror group looking to radicalize ideological adherents within our borders, and inspire them to randomly murder us. Trump has suggested that we not allow any more people from Middle Eastern areas known as incubators for terrorists UNTIL we have much better means of sorting out the radicals from the legitimate refugees.","post_message":"This is one of the most powerful segments we've ever seen. Tom Brokaw compares Donald Trump's call to bar Muslims from America to Japanese internment, Nazi Germany, McCarthyism, and Jim Crow - and he didn't stop there. This amazing video is well worth taking a moment to watch, via NBC News"},{"comment_id":"10153400579000329","commenter_b":"He's all yours, ladies lol","commenter_a":"Greg Paul Rachelle Krista","post_message":"His name is Brock O’Hurn and he's the king of man buns."},{"comment_id":"10154293209899153","commenter_b":"What do you mean what is happening...It's been going on for thousands of years....There are POS's everywhere","commenter_a":"What is happening too many men are raping these young children, ladies be careful who you have in your home , keep your eyes on your children at all times never leave them with anyone these days it could be your closest to molest these kids...","post_message":"Joseph Genitempo is accused of sexually assaulting an 11-year-old girl. Anyone who may know where he is located is asked to call the Delaware State Police."},{"comment_id":"10153725083142464","commenter_b":"@username YOU'RE A COMPLETE MORON !!","commenter_a":"I remember my thanksgiving in Iraq and the Stan. Prayers for all those away from the families eating thanksgiving in a to-go box","post_message":"Tomorrow and every day, don't forget to say a prayer of Thanksgiving for our men and women in uniform spending the holiday away from home."},{"comment_id":"507506722754821","commenter_b":"Who cares what he thinks?","commenter_a":"Is Kanye West Racist,,, he sure acts like it. In one word \"DENIAL\"... And yes Kanye if it was a \"WHITE\" entertainer I would feel the same way. This whole race card is getting played out, BILL COSBY is a rich NARCISSISTIC PREDATOR. Color shouldn't give ANYONE a pass.","post_message":"With just three words, Kanye West succeeded at creating yet another Twitter storm."},{"comment_id":"1033509070100318","commenter_b":"@username yes you god damn do! Women throw sex parties and drink alcohol through dick straws for Christ sake! Most women are guilty of cheating at some point in their life. That's what we as a species do, we eat and have sex. Like or hate it, men hunt for women and women love it","commenter_a":"I find it very sad that WOMEN are defending it, what the fuck is wrong with you? I'm sorry you feel that you should allow a man to have his way with you. It's sickening.","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153736495329753","commenter_b":"Yes","commenter_a":"Of course he's backing Killary. He's a libtard!","post_message":"Incarcerated hip-hop artist Bobby Shmurda has endorsed Hillary Clinton’s 2016 presidential bid. The 21-year-old leader of the Brooklyn-based GS9 crew is the latest in a string of high-profile hip-hop artists to back the Democratic front-runner, including Snoop Dogg, Pharell and Eminem. According to Shmurda, Clinton is the most suitable candidate to take over the Oval Office in November because of her “strong mind” and empathetic nature. “I’m going for Hillary, man,” he told Vibe. “I like... @webpagelink"}]
