[{"comment_id":"10153846244313984","commenter_b":"Dumb bitch","commenter_a":"Well said Rubio!","post_message":"WOW. Out of all the things she could have been doing, or should have been doing - THIS is what she chooses. It's pretty unreal to think that some people actually want her to become the next POTUS... Do you think it's time for Hillary Clinton to drop out of the 2016 presidential race?"},{"comment_id":"2159179167640729","commenter_b":"Shut up you liberal ugly lying witch that THINKS she's as beautiful as Melania Trump (secretly jealous of her) get off the tv cause no one wants to look at or listen to you skank!","commenter_a":"Boo👀jk😊","post_message":"\"I feel like it was an attempted bullying.\""},{"comment_id":"10154974435358812","commenter_b":"Russian Women For Trump ???","commenter_a":"Well rehearsed lol","post_message":""},{"comment_id":"10157365304615389","commenter_b":"If the Democrats can do it they will try! These are the most evil people I have ever witness! Just like I have said many times it's Good and Evil fighting now! The good (Trump) will win!","commenter_a":"100% yes","post_message":"Question of the Day: In light of Donald J. Trump's comments, do you think the general election could be rigged? Weigh in below."},{"comment_id":"10154743139306508","commenter_b":"She's a liar ....","commenter_a":"The funny thing is the same scenario happened in Egypt four years ago with the Muslim brotherhood president Morsi, when someone beside him was telling him what to say and was caught the very same way Pelosi is caught now. I think same same school, no difference","post_message":"She didn't know people could hear her"},{"comment_id":"10153009294016680","commenter_b":"Why doesn't he run for Lt. Governor and Dog Catcher, while he's at it! 😡","commenter_a":"Who says money can't buy you elections - er, I mean, caucuses. Now he can continue to get paid for doing a job he won't be doing while he is attempting to further his political ambitions.","post_message":"Rand Paul is closer to getting his way. | AP Photo @webpagelink"},{"comment_id":"10153371491386336","commenter_b":"Not American and horrible woman","commenter_a":"Mother Teresa.","post_message":"With your help, #TheNew10 will be decided later this summer."}]
