[{"comment_id":"955289837857113","commenter_b":"How about we start with u lady . What a Moron!","commenter_a":"She should start with herself.","post_message":"(Video) 2 lies woven together to justify depopulating the Earth... Full Story: @webpagelink"},{"comment_id":"10157700515445294","commenter_b":"Educate yourself. So we rather have criminals holding people up at gun point running the street? Robbing innocent hard working people?. We feel bad for the criminals? However, I don't. Much peace and love.","commenter_a":"Well he won't do that again. Glad he won't be terrorizing hard workers anymore. I don't care if he had a drug problem look at all the people he held at gun point the past 3 weeks. Should feel sorry for those who had to be terrified of their life.","post_message":"Police say the robber was suspected of holding up other Cleveland-area CVS stores for opioids."},{"comment_id":"10155466728060354","commenter_b":"Lol...I remember when a female Dem said that recently.","commenter_a":"What will he do about all the women driven to prostitution as a result of global warming?","post_message":"We look forward to your witty comments on this one. The possibilities are endless."},{"comment_id":"10154336325219062","commenter_b":"Bradley Darrell see above message..","commenter_a":"To suggest the Pope has a liberal agenda is just showing ignorance. Conservatives claiming the Pope is pro-gay, pro-abortion, anti-marriage, blah,blah. The Pope has never said he agrees with those things, he has said it's not his place to judge others who have that life style. Just like Jesus would do today. He loves everyone without reservation. Something sorely lacking in today's society.","post_message":"Pope Francis says addressing climate change `can no longer be left to a future generation'"},{"comment_id":"10153091950239205","commenter_b":"IF YOU'RE ILLEGAL ALIENS IN AMERICA, THEN YOU HAVE NO BUSINESS HERE, JUST LIKE MEXICO TREATS AMERICANS! PEOPLE WHO WANT TO COME HERE LEGALLY ARE WELCOMED.","commenter_a":"The mexican solution (Donald Hitler )","post_message":"Donald J. Trump's detailed and foolish immigration plan explained."},{"comment_id":"970408816303922","commenter_b":"John, women don't care what you think is acceptable. Abortion is a legal medical procedure. Women don't need your approval, your acceptance, or your opinion. Do you expect women you've never met to weigh in on your private medical decisions? Of course not! Stop being so arrogant. What isn't acceptable is your flawed thinking that you can control a woman. You can only control yourself.","commenter_a":"\"Birth control\" is a misnomer. If one thinks about it, it signifies controlling an already conceived being. Therefore, i do not embrace birth control. Like stopping birth. I do embrace control prior to the embryo attaching itself to the wall of the uterus. We need to find a name for that.","post_message":"How you REALLY stop unintended pregnancies."},{"comment_id":"10154736430788984","commenter_b":"I think she's loosing her butt and I'm glad!","commenter_a":"So go be a Grandma and get out of the race.","post_message":"It took Hillary Clinton less than 15 words to show her debate strategy in a very clear way. Do you think Donald J. Trump is winning the debate?"}]
