[{"comment_id":"139820166538945","commenter_b":"So next time a woman has a child she doesn't want, wil you take it?","commenter_a":"Thank You, @username. Thank you, for keeping this promise. As you have always been pro-life, this is putting action to those words. #ThankU4speaking4Thebabies","post_message":"Today → House Votes to Protect Taxpayers from Funding Abortion"},{"comment_id":"1452171914802834","commenter_b":"The only thing Hillary Clinton is going to do is be the 2nd woman to run for president and loose.","commenter_a":"Go Hillary it's an excellent speech","post_message":"\"Now Donald J. Trump says, and this is a quote, 'I know more about ISIS than the generals do….'\" \"No, Donald, you don't.\" Read more of Hillary Clinton's DNC speech: @webpagelink"},{"comment_id":"10155125514911178","commenter_b":"hhahahaha disgusting pig!","commenter_a":"Disgusting. ...","post_message":"Can you put a price on human life? Because that's how the morally warped, Hollywood left view abortion."},{"comment_id":"553460564841833","commenter_b":"Isn't Covergirl a brand? Wouldn't saying \"He can't do that\" because of the brand name be like saying girls can't play Gameboy because it has 'boy' in the name? Also, people are making a fuss about a guy appearing as the face of a woman's product, but I didn't see anyone making a fuss about almost naked women appearing on publicity for men's magazines, car's oil, burgers, beer, etc.","commenter_a":"He looks like a girl what are they thinking!!!!!!","post_message":"Oh....my."},{"comment_id":"1177291819033735","commenter_b":"Boy that was a huge crowd! 😂","commenter_a":"Good for you, kid!","post_message":"WATCH: A kid yells \"you suck\" at Ted Cruz. More here: @webpagelink"},{"comment_id":"1754857141240693","commenter_b":"@username The trash should be put down !","commenter_a":"They saying there's no tv the food crap and can't go to the gym well you shouldn't do the crime","post_message":"Britain's third biggest prison is in the midst of a riot."},{"comment_id":"10154228766276523","commenter_b":"All over being asked about a reusable bag?! How is that racist? Crazy woman.","commenter_a":"Wow. Fox 6 is really becoming a rag show. Too bad they used to cover the news.","post_message":"All this -- because she was unhappy after being asked about purchasing a reusable bag at the craft store."}]
