[{"comment_id":"775605039243294","commenter_b":"Experimental Sexual Preference Network - no longer watching this no moral standards network","commenter_a":"I will not be watching any more","post_message":"Leftist ESPN goes all in..."},{"comment_id":"10153270035730779","commenter_b":"Oh! And what about all those potential babies killed when wankers like you spill your seed onto barren ground?! #EverySpermIsSacred","commenter_a":"Forty million dead babies can't be wrong. An entire generatation of Americans has been murdered in the womb.","post_message":"Yes, Martin O'Malley, Bernie Sanders and Hillary Clinton are all pro-choice, but that isn't good enough. Simply promising to veto abortion restrictions passed by a Republican Congress isn't how we protect access to abortion, not when state legislatures are making it increasingly difficult for the most vulnerable women to get one. It's time debate moderators talked about it."},{"comment_id":"1475217105828968","commenter_b":"You do not know what you are talking about! If woman cannot afford birth control then there will be a definate increase in unwanted pregnancy and ultimately more abortions than ever. Its a simple enough eqausion, NO PLANNED PARENTHOOD=NO AFFORDABLE BIRTH CONTROL=MORE ABORTIONS!","commenter_a":"Will never agree stay quite,agree or be agreeable to finance or support an organization that capitalizes on the murder of innocent children. And an organization that preys on the vulnerability of women in a bad situation, that is not women's rights but profit of murderers. It needs to be called what it is. Their profits and funding comes via. death and guilt not education.","post_message":""},{"comment_id":"795005380646682","commenter_b":"Y'all must be crazy","commenter_a":"Drain the swamp","post_message":"The United Nations resides on American soil, and the U.S. pays about 25% of its budget."},{"comment_id":"945724052142706","commenter_b":"Why would anyone vote for Hillary though? She's worse","commenter_a":"How could any Americans ever vote for a bigoted, vulgar, narcissistic billionaire who lies about almost everything and has advanced no policies or arguments other than strong and smart enough to do it. This is what happens when you get voters whose worldview consists of \"The Apprentice\", \"Keeping Up With the Kardashians\" along with \"Fox and Friends\". The masses of stupid going to the polls, very scary indeed.","post_message":"Donald Trump is on the verge of winning the Republican National Committee nomination, as the party plummets into a civil war that could destroy it entirely."},{"comment_id":"910131575844085","commenter_b":"It should NOT be given to illegal aliens #1. It should not be a life time money train #2.","commenter_a":"Unfair.The middle class working people can no longer pay for these people to watch TV all day and do nothing. Now when we die out because of Obamcare.they too will die behind us.","post_message":"Welfare recipients just got hit with some devestating news. The party is coming to crashing halt. Do you think it should be illegal to live off other people's hard work?"},{"comment_id":"10154430815494497","commenter_b":"Also ,,!,, cuz the onion","commenter_a":"Can't believe they would make him do this @username","post_message":"Astronaut Suspects NASA Using Him To Test Space's Effects On Fat People"}]
