[{"comment_id":"1028867523831550","commenter_b":"STFU pussy","commenter_a":"Misunderstood character, he was not some badass Ranger, he was literally some kind of clerk who got brought along at the last minute. To me, this character represents the fears of what the average person would feel in that situation.","post_message":""},{"comment_id":"961966360614126","commenter_b":"I bet Walt Disney rolled over in his grave whenever he's found out what you become you are such a vulgar I can't even use the time lady because ladies do not act like that but I will come help you pack free of charge I don't care what you have and how many boxes how many trucks I will help free of charge just to get you out. And thank you for the promise","commenter_a":"Good","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"10154885110756509","commenter_b":"Build a wall around Connecticut.","commenter_a":"Of course and that is why we love Trump!! He is the only one daring to say the truth!!!","post_message":"\"He's saying what a good amount of people are thinking and don't want to say,\" a Donald J. Trump adviser said."},{"comment_id":"10153454020915329","commenter_b":"My favourite is free spirit - I might go with that one","commenter_a":"Bree Andrijich @username Amy Badock Monique Scott","post_message":"Sport fishing enthusiast?"},{"comment_id":"10156352332210354","commenter_b":"whore.","commenter_a":"Another one that is missing all that gray matter between the ears...","post_message":"Feminist Gloria Steinem is a _________________."},{"comment_id":"10153316007267144","commenter_b":"Why doesn't she ever just answer the questions and stop telling everyone everything else!! Oh yeah, because she is the biggest liar ever!!!!!","commenter_a":"Way to go Hillary Clinton!","post_message":"The whole room joined her. Watch."},{"comment_id":"849566101841798","commenter_b":"Ignore Spenser Jeffery, he's bankrupt, c);-)","commenter_a":"God Bless this wonderful man! God bless his family and many friends. You truly lost a good man. Prayers and all the respect in the world to him and his family!! Please holy father, take this wonderful soul into your loving arms, amen and amen.","post_message":"\"I swear to God I love this city but I wonder if this city loves me,\" slain officer Montrell Jackson wrote on Facebook earlier this month."}]
