[{"comment_id":"923411781030392","commenter_b":"You can see intelligence in many statements and never know the color of the person saying it. If you are suprised when you find out, you need to examine what you find in yourself. Common sense ignores color.","commenter_a":"Why when I read this do I keep seeing the statement \"Black mother\" or \"Black woman\" this is the problem with racism in our country. Let's stop using the color of our skins in small comments like these. I feel like this 1 small step would be a huge step in a direction and future with less focus on skin color and more on humanity.","post_message":"Do you agree with Mom?"},{"comment_id":"999058010215871","commenter_b":"Only palestinian tribe are Jews enemie because predatory tribe wants to grab everything from the Jews Included the History","commenter_a":"It is good you have such a strong army with all the enemys around you! May God be on your side!","post_message":"A beautiful moment full of love and appreciation at the 2016 Jpost Annual Conference. Share this video if you think that the Israel Defense Forces is the greatest army in the world!"},{"comment_id":"255446914877983","commenter_b":"Criminal News Network or Crooked News Network is full of nothing but whiny ass snowflake safety pin wearing nutjob crybabies. #TRUMPWON #MAKEAMERICAGREATAGAIN #DEALWITHIT #SORELOSERS","commenter_a":"It's a ban. He knows it we know it. But that doesn't stop him from spinning the Don's con.","post_message":"CNN just proved that Trump is LYING when he says he’s not banning Muslims. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"595073377334106","commenter_b":"In GOD WE TRUST","commenter_a":"Where do we get it","post_message":"July 30th marks the 60th Anniversary of “In God We Trust” being written into law as America’s national motto. Our Motto has been referenced by our Presidents, written on our money, and is in our National Anthem. Although some would like to erase God from the public square, we see this as an opportunity to proudly proclaim that “In God We Trust” is still the bedrock upon which our nation is built. On July 30th, let’s sweep the nation with our National Motto! Hundreds of Thousands of people have already join the One Million Window Campaign Get your sticker today and be a part of the Movement!"},{"comment_id":"10153589260353822","commenter_b":"Rebecca .... get out of the basement ....","commenter_a":"Requiring people to carry a concealed weapons permit is just another way the government can get your money. Do people actually think that criminals pay to carry a concealed weapon?? No, they don't. I think this is a great law, go WV!!","post_message":"Effective late May, people in West Virginia will be able to legally carry concealed guns in public without permits or training."},{"comment_id":"10153704706699170","commenter_b":"She got robbed! She should be #missamerica!","commenter_a":"Well, if their question was addressing 'gun related accidents', she was right on point. However, that was not their aim ( no pun intended) - their 'aim' is to ban weapons period. Their question does not address any of the mitigating circumstances that surround each of the recent incidences of gun violence and they know it. You can see it in the eyes and expressions of the questionners once Miss S.C. gave her answer.","post_message":"Wow. I don't think ANYONE was expecting this... Do you agree with Miss South Carolina's answer?"},{"comment_id":"861355680627352","commenter_b":"ronan need to go, and joy should replace REV AL at 5pm cst is very very hard to watch his show!!!!!","commenter_a":"did someone from fox come over and take over in charge of show selection as I am with the others why keep Scarborough who belongs over on fox and let these two go....way to lose viewership","post_message":"Ronan Farrow reveals the answer to a big question ... almost."}]
