[{"comment_id":"2109805452578927","commenter_b":"Leave her alone!!","commenter_a":"Rosa","post_message":"World-renowned statistician Stevie Nicks declares a Hillary \"landslide.\" The mathematician also adds: \"Just like the white winged dove...Sings a song...Sounds like she's singing...Ooh ooh ooh.\""},{"comment_id":"1213019208717830","commenter_b":"@username So...a ticket paid for means she can do whatever she wants and not follow rules and regulations. I'm pretty sure it is clearly stated in the paperwork you sign before sailing that you will be left behind if you are not back on the ship on time.","commenter_a":"Horrible. They waited a whole 30 minutes how about waiting til she's back. What if she had been kid napped or in a hospital. No compassion what so ever, makes me sick. If she can see that ship depart they are at fault.","post_message":"A woman looked on with horror as the cruise ship on which she was vacationing left a port in Bahamas, leaving her on the island while her children were on the ship."},{"comment_id":"595052750663656","commenter_b":"So RACIST I used to really like her. Now o can't stand her..","commenter_a":"And we don't want to hear you talkm","post_message":"THE VIEW’S Whoopie Goldberg To Co-Host: “This Is Why Black People Don’t Wanna Talk To White People” [VIDEO]"},{"comment_id":"10153136004245090","commenter_b":"She's an idiot","commenter_a":"She is a liar, sneaky, underhanded, untrustworthy and she needs to answer for Benghazi and the killing of those four innocent men. I hold her and Obama responsible. Would never want someone like this as President.","post_message":"Bottom line: Why don't you want Hillary Clinton to be President? Sound off here: @webpagelink"},{"comment_id":"10156011468900354","commenter_b":"Worse than that she made jokes about it, shameless woman.","commenter_a":"say what you will, but she is, always has been, and always will be a liar , crook, theif and a criminal. Just say no to Killary.","post_message":"Hillary's got jokes! About breaking federal law and endangering national security--what a hoot!"},{"comment_id":"10153216157089087","commenter_b":"Screw Carly the bitch","commenter_a":"She hit the nail on the head with that statement. Problem is that people are so selfish, narcissistic, and apathetic that they don't really LOOK at a person until its too late. Did I mention lazy? Handle problems on the front end and there will be less on the back end. Do you want to elect Carly Fiorina? Or a woman with multiple murders under her belt? Or a hatemongerer? Not my first choice, but I still like her.","post_message":"“The reason I’m running for president is because I don’t want to see hope fading from anyone’s eyes,\" Carly Fiorina said. \"When someone is addicted, you watch them disappear before your eyes.\""},{"comment_id":"477998972394364","commenter_b":"Me too, but sometimes I go overboard and can't keep track of all my comments on the Internet.. So I have to take a break.. Also I get discouraged when people call me names :(","commenter_a":"They didn't say \"get over it.\" They promised to look into it, did so, and concluded that their pop culture reference was fine and that people misconstruing it would be in the minority and no changes needed to be made. Kinda funny how you can spin a story with a contentious headline. Ben & Jerry's seemed concientuous and compassionate here, not combative and dismissive as the headline suggests.","post_message":"These folks became very upset over the name of Ben & Jerry's new ice cream flavor and demanded it be changed. Ben & Jerry's response: Get over it."}]
