[{"comment_id":"10153906891941051","commenter_b":"When you don't treat a woman right - she will do you wrong.","commenter_a":"Wish I had not read this.","post_message":"A man came home early only to find his wife in bed with someone else. The worst part? It was with the absolute last person he'd ever expect to find her in bed with."},{"comment_id":"1114642831881306","commenter_b":"We Can't seem to Pin Point The Problem!!! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The Underwear Bomber was a Muslim The U.S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bali Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Muslims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were Muslims The first World Trade ...","commenter_a":"Where are the women & children ???","post_message":"A sound strategy, considering Obama's strategy is basically, \"You're a bigot if you don't accept Islamization of America.\""},{"comment_id":"1276379159041275","commenter_b":"Thank you for showing the American people what a corrupt lying bitch she is","commenter_a":"I think you should give this guy some kind of a metal for Honor possibly a fruit basket!","post_message":"Ohhhh boy..."},{"comment_id":"707413306095459","commenter_b":"She have a bird on her head?","commenter_a":"Illegal people","post_message":"LIVE NOW: The Phoenix City Council is talking about a proposal that will designate the city as a Sanctuary City. STORY: @webpagelink"},{"comment_id":"1198460870230286","commenter_b":"Women have it Harder then men? Who has to work in construction for his whole life if he doesn't have an good education? men do. Who has can't just suck dick and flash their tits or be a stripper or be a prostitute to get easy money? Men can't. So listen here you ugly fucking single mother in practice bitch you should've been caught in the condom.","commenter_a":"Stop boner shaming! Girls get to flaunt their sexuality. They get to show off their nipples. Then guys have to hide boners. You know how uncomfortable it is to flip a boner into your waist band Only some people breast feed. None of you would be here without a boner FREE THE BONER","post_message":"You! #WSHH"},{"comment_id":"970626379645816","commenter_b":"#Ansab go back to your history, that land is promised land to Israel by God. Israel made mistake coz God told them to kill anybody who will be in that land but due to kindness of Israelites now they are suffering with these Palestians cursed tribe. Land of Canan belongs to Israel coz is promised land","commenter_a":"Palestinians they deserve to be killed by Israel because of their provocation. No mercy to Palestinian death","post_message":"More than 60,000 people in the UK have so far signed the petition calling for Israeli Prime Minister Benjamin Netanyahu to be arrested for war crimes against Palestinians when he pays an official visit to Britain next month. Read here: @webpagelink"},{"comment_id":"10153590500421409","commenter_b":"she is full of herself","commenter_a":"Wow what kind of so called \"FRIEND\" is she. Can't even be happy for Michael. So much drama. Nobody needs a friend like that.","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."}]
