[{"comment_id":"963331227036554","commenter_b":"So could Samsung actually be catching up?","commenter_a":"Eh...not really impressed enough to upgrade from the 6. I'll wait till the 7!","post_message":"Our first look at Apple's new iPhones:"},{"comment_id":"10152829915341130","commenter_b":"What a doll she is!","commenter_a":"I hope you are successful. I love the breed, had one 33 years ago, she was perfect and sweet and love able....don't think she knew she was a Pit. We got her at 6 weeks. She was the runt of the litter and blond. So cute, so smart.....we loved her. Her life cut short, hit by a cAr...our fault, out in country did not think there was enough traffic to leash her for her morning job, one car amd she ran in front of it....I have never forgiven myself. But she had my heart at day one. Good luck with your training🐾🐾","post_message":"\"I don't want her bad behavior to speak for the breed -- rather, to behavioral issues born from neglectful and abusive homes. More than that, though, I don't want her to have any bad behavior. I want her to help fight The Great Pit Bull Bias.\""},{"comment_id":"1145946565440763","commenter_b":"@username Maybe a visit to the Maury show???? That's where all whores go","commenter_a":"It looks like with eight children, some of the fathers should be paying child support, not the government!!","post_message":"GOOD!"},{"comment_id":"10153310405423352","commenter_b":"Girl that's me","commenter_a":"I'm my own team.. Fuck that, once u have a kids, a career and a life them damn friends ain't shit... I'll kick it with all the damn kids","post_message":"Atlanta Woman Says She Was Set Up By Her Bestfriends Who Beat Her And Held Her Hostage For Hours (VIDEO) Be careful who you consider your \"friends\"...So sad, they literally left her for dead."},{"comment_id":"10154326726666729","commenter_b":"None... Technically. I do think they may have accidentally drifted into their waters..","commenter_a":"Why did our sailors surrender and why didn't we have any support for our sailors such as a helicopter? Something isn't right here, this stinks like Benghazi.","post_message":"We REALLY wish we didn't have to show you this, but this is what the results of feckless foreign policy leadership look like..."},{"comment_id":"10153203949426782","commenter_b":"This is complete BS!!! They are illegals!! NOT undocumented.... In Oklahoma you have to prove you are here LEGALLY, not an illegal criminal to get an Oklahoma ID or DL. Sign up for a DL as an illegal and get deported.","commenter_a":"If Americans went to Mexico illegally, they would be thrown in jail, deported, if they're lucky, possibly shot and killed, but I can guarantee they wouldn't be given free medical, free schooling, welfare, jobs, driver's license, etc....all at the tax payer's expense.","post_message":"An Oklahoma City grassroots effort to get undocumented immigrants drivers licenses is gaining momentum."},{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act! Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"}]
