[{"comment_id":"10153735329829205","commenter_b":"Fuck clinton and her globalist allies","commenter_a":"Come on Loretta lynch meets bill Clinton on the Tarmac before the Benghazi report. See the movie 13 hours in Benghazi please don't tell me that every person in that movie was lying about what happened that night. There was no reason why they all resigned? Like you yourself said maybe technically they did nothing wrong but morally ? And who was to blame ? And what happened after ? And let's not forget the laugh. I would never vote or defend the Donald but let's not call a word on cnn anything but spin for Hillary. They have not even reported on the so called technical issues with the voting errors or for what went wrong with Nevada. Seriously do you honestly think that your viewers cannot see through your crap when you are crapping too ?","post_message":"Michael Cohen is one of Donald J. Trump’s top advisors, an a lawyer. He may have just committed libel against Hillary Clinton."},{"comment_id":"10153801598562042","commenter_b":"God this makes me sooo angry I just want to cry and beat the crap out of her. She is a monster and deserves the death penalty!! Rip Little Angel!! 😢","commenter_a":"And That POS is pregnant again","post_message":"DISTURBING DEATH: A mom allegedly punched her 2-year-old repeatedly in the stomach and the child was found dead the next day. What the mother later admitted to police is horrific ..."},{"comment_id":"10153322805023132","commenter_b":"She's still pregnant?","commenter_a":"I read it's a girl","post_message":"Do you think she's having a boy or girl?"},{"comment_id":"10153513797158701","commenter_b":"Snaggleteeth women put up with more bs. Lol gross though!","commenter_a":"I have great teeth, and I cannot even get a date! I always wonder how snaggletooth women like that get a date.......LOL","post_message":"A Georgia woman is accused of going on a violent, drunken rampage after her boyfriend refused her advances."},{"comment_id":"1755814751326418","commenter_b":"Not my words but totally agree. Found this on another FBook site. VOTE YOUR CONSCIOUS NOT YOUR PARTY! Don't be influenced & persuaded, been going on far to long. WHY WOULD YOU VOTE FOR HILLARY WHEN.... Most cover ups & lies by a family in America's history. If you are #Gay, why are you voting for Hillary when she wants to bring in 1,000's of refugees that believe all Gays should be executed? Criminalizing Christians who don't believe this? If you are #Black, why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood when they want to abort as many black babies as possible. Exterminate the black race because they are like \"weeds\". Most of those clinics are in Black neighborhoods? If you are a #Christian, why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who dedicated his ...","commenter_a":"Can even stand to listen to her! *wave*","post_message":"Watch: Hillary Clinton speaks during a campaign rally."},{"comment_id":"10154063115076509","commenter_b":"Wanker !","commenter_a":"Shut up trumponszi","post_message":"\"We have a problem in this country. It's called Muslims,\" a man said at a Donald J. Trump rally. Trump did not appear to correct the man when he alleged that President Barack Obama is Muslim and also not an American. @webpagelink"},{"comment_id":"1806931362926478","commenter_b":"I just can't believe that she uses children for her dirty political TV add. Her latest add children watching Donald Trump . She is the expert lol . Her lenguage puts sailors to shame. She is no Lady never was never will. Poletic is agly we all know that. But to involve children in an add how low can you sink??? I wouldn't let my children or great grand children watch TV dirty Poletic.... The would be in bed for sure not sitting in front of the TV all day long .what kind a mother and grandmother is she we should ask ourselves to use children in her dirty advertising against TRUMP they are children MADAM SECRETARY. SHOULD WE SHOW THE CHILDREN THAT YOU IGNORED THE DESPERATE CRY FOR HELP IN BENGHAZI?? YOU KNEW WAY BEFORE THEY WOULD NEED HELP RIGHT AWAY. WELL WHERE WERE YOU YOU WENT TO BED ...","commenter_a":"He's needs to walk away from the DNC at this point!!! They never had his back why should he have theirs? Stein /Sanders could change this country.","post_message":""}]
