[{"comment_id":"986811718026353","commenter_b":"\"The kids will eat it up, if it's packaged properly Steal a sound and imitate\"","commenter_a":"And thats why i loved him 👊","post_message":"Nirvana's Kurt Cobain is known for being something of a legend in music, but that's not all. In fact, he said some pretty on-point things during his time, especially about rape, bigotry, racism, and feminism."},{"comment_id":"10153932713210950","commenter_b":"@username that's my point. If she wanted to look like a pig she should have stayed on the farm lol","commenter_a":"It wasn't a few pounds, she got fat!! It was her job to maintain an appearance and she failed. If she didn't want to be judged for her appearance then don't enter a beauty pageant. Smh","post_message":"This former Miss Universe says Donald J. Trump's comments about her brought up bad memories from 20 years ago when she gained a few pounds after winning his beauty pageant."},{"comment_id":"10157782729605725","commenter_b":"She's a fake!!","commenter_a":"Mlp","post_message":"An honor to be at the Polish National Alliance in Chicago, Illinois - meeting with & speaking to the Polish American Congress. Thank you!"},{"comment_id":"10153741817406178","commenter_b":"Hillary is an unclassified POS !","commenter_a":"I think he is smoking crack.........","post_message":"Well I suppose all is forgiven now, isn't it?"},{"comment_id":"1397496900343360","commenter_b":"\"I support the racist abortion of millions of black and latino children\", that all I see when I see anyone saying the support Planned Parenthood. Sounds like something close to what Hitler did... eugenics, anyone? Margret Sanger? Big fan of Hitler? Come on, it can't be a coincidence that blacks are encouraged by white PP employees to abort their babies, right? #StopRacistPP #ShutItDown #UGetMoreBensWitKids","commenter_a":"Or took their VIAGRA away. Bet we'd get some action then.","post_message":""},{"comment_id":"992191140821358","commenter_b":"Why? I think she is best in the senate. I also think an all female ticket is unrealistic.","commenter_a":"Clinton/O'Malley would be a good ticket.","post_message":"Hillary Clinton absolutely crushed every single Republican candidate in a recent CNN/ORC poll."},{"comment_id":"1109027105857009","commenter_b":"As the meme says, \"If you don't have a vagina and womb, keep out of mine!\"","commenter_a":"I support Bernie. Because I can't stand either Hillary or Trump. And because he wants Single Payer health care. But the Democrats are insane to support abortion rights. We will ALL be held accountable before God for the murder of our children.","post_message":"We're PROUD to be Democrats. Are YOU?"}]
