[{"comment_id":"10155996223940354","commenter_b":"Take their citizenship away and deport.","commenter_a":"Black trash","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS. Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"820349888068915","commenter_b":"No she does not!","commenter_a":"@username Melinda Caskey @username Angela Fisher Claudia Billings @username","post_message":"Hillary Clinton says she’s tired of Bernie Sanders’s campaign lying about her. The only problem is he’s not lying, she is."},{"comment_id":"864868203550521","commenter_b":"ROFLOL!!!","commenter_a":"I see a white guy in a gold shirt.","post_message":"Photo: 20-year-old Jeffrey Williams, suspect charged in shooting of two police officers in Ferguson, Mo. @webpagelink"},{"comment_id":"1145897778760904","commenter_b":"I have the same solution no matter the skin color......shot them, protect the population from killers.","commenter_a":"Throw him in a cell with a bunch of big angry sex offenders.","post_message":""},{"comment_id":"10153465334273132","commenter_b":"This case may seem cut n dry but so much time has gone by plus they never found his body.. I would not want to be a juror on this case","commenter_a":"They had a convict in prison who was even more than likely this little boy's killer. I think this is why this guy's 'confession' is so questionable. The investigators refused to admit they made a huge mistake, not surprisingly. I don't think they have the right guy, as for the real killer, I believe he died in prison. The whole thing is tragic.","post_message":"The jury has already been deliberating for 11 days."},{"comment_id":"10153245476169087","commenter_b":"F you Bitch !!","commenter_a":"obama with his gay pride lit up the white house for his muslim brothers and he told us how proud that he was to light up the white house for his gay friends","post_message":"“If Donald Trump becomes president, that will be the end of the world,” said Hunger Games actress Jennifer Lawrence said. \"I genuinely believe that reality television has reached the ultimate place where now even [presidential elections] might just be for entertainment.\""},{"comment_id":"970339789709457","commenter_b":"The media doesn't give Dr Carson a fair chance, disgusting and sad!","commenter_a":"All Trump supporters, pls get out and vote! This is a very critical time in America, we need to get back our White House, otherwise we gonna reach the point of no return!","post_message":"GOOD MORNING, America! Thank you for all of your support- in last nights #GOPDebate. If everyone gets out to vote in 2016-- there is no question that we will ALL be MAKING AMERICA GREAT AGAIN- soon enough!"}]
