[{"comment_id":"970236133016859","commenter_b":"Dumber than dumb. She thinks she is a republican because...?","commenter_a":"I'll bet dollars to donuts that she'll still vote republican in the next election. Dimwits gotta be dim......","post_message":"To save Obamacare, we need many, many more people like Erin to come forth."},{"comment_id":"10153591312367217","commenter_b":"The death of the GOP is fun to watch!","commenter_a":"I can explain it in fewer words - sore losers","post_message":"He's the presumptive nominee but not everyone's a fan of The Donald."},{"comment_id":"10153181309551350","commenter_b":"Sebrina Butler cute comments here. Marcella McFadden","commenter_a":"Breast feed, breast feed! Just do it! It's best for the baby's immune system.","post_message":"What do you wish you'd known before you had your baby? Read the top responses so far and join our new TODAY Parenting Team, sponsored by Johnson's Baby, to share your advice. @webpagelink"},{"comment_id":"656793474487890","commenter_b":"Hillary the Felon says Trump is prejudice and she is just telling the same manipulative lies over and over. Mexicans do need to be properly vetted and screened because they are coming from a country knee deep in political corruption and organized crime. This lying fraud is trying to get her voters to think Trump is racist and prejudice but fails to acknowledge the gallons of red blood leaking into mexican streets because GOVERNMENT DISARMED ALL LAW ABIDING CITIZENS. It is NO QUESTION, Hillary wants Australian styled gun abolition, want proof? Ask and you will receive! She fails to acknowledge mexico is sending rapists and drug dealers en masse to deal much like Fidel sent his POW to Miami. There IS NO DOUBT this Felon is going to drag us into a civil war with her ideologies on government. Syrian and muslim refugees who have turned Germany into the brink ...","commenter_a":"#Trump2016 #HillaryForPrison #DNCLeak #DNCWalkout #CrookedHillary #ClintonCorruption #RiggedSystem Debbie Wasserman Schultz was the co-chair of Hillary's 2008 presidential run, where she lost the nomination to Obama. So, in order to lock down the nomination for 2016, Hillary would've had to put Schultz in charge of the DNC and manipulate it from within. In order for this corruption scheme to work, the Clintons would have needed first to, not only get the current DNC chair at the time to step down, but also get them to recommend Schultz for the position. A big request. And the Clintons would have likely needed to promise a powerful favor to that DNC chair, something more prestigious than being head of the Democratic party. So who was that person and what did they get in return? The previous chair of the DNC prior to Debbie Wasserman Schultz was... Tim Kaine. Let that sink in for a ...","post_message":""},{"comment_id":"10155243885678984","commenter_b":"@username excuse me ??? It's the fake news that is treating the president with utter disregard for his office ... they are bought & paid for that's why they say what the liberals are spouting ... makes one SICK !","commenter_a":"Oh boo freakin hoo! Shut the f#&@up all you newsies! You treat the President of the United States like a lowlife scumbag and expect him to kiss your collective asses to make nice! This is Donald Trump and you dummies just don't get it! Be fair and honest and quit making up crap and he will reciprocate! Wake up and smell the coffee!","post_message":"Fox News' Brett Baier just left many viewers speechless. This is going to get Donald Trump's attention..."},{"comment_id":"10157375449970354","commenter_b":"Fuck off you little bitch!","commenter_a":"Its ok. Nobody was listening.","post_message":"Isn't that so thoughtful of Leftists who deride religion to lecture Christians on their faith?"},{"comment_id":"582726195242593","commenter_b":"Omg seems that all woman are becoming liars now ^ smh^ unbelievable","commenter_a":"There are two women Trump doesn't want to tangle with. Elizabeth Warren has forgotten more about economics than he ever knew. And Hillary's foreign policy knowledge is something he will never acquire. She will decimate him in a debate because he will have to be ready to speak on issues, not just make personal attacks. He is so thin skinned that he will self destruct as soon as she holds his feet to the fire. He and his followers don't have a clue. They have demonstrated time and again that when all else fails, thuggery rules. That doesn't win elections once reasonable people make up their minds not to put up with it any more. Now I just hope that reasonable people do that sooner than later. Put him out of his misery as quickly as possible.","post_message":"He's got a problem."}]
