[{"comment_id":"10154464854894087","commenter_b":"Your fucking Scum","commenter_a":"World's Greatest Groper...engraved on the back of the medal.","post_message":"BREAKING: President Obama awarded Vice President Joe Biden with the Presidential Medal of Freedom -- the highest civilian honor -- in the surprise ceremony."},{"comment_id":"10154400322244657","commenter_b":"In your illegal immigration poll Robert? Legal, voting hispanics want them gone.","commenter_a":"It doesn't matter. Now that the GOP candidates are in a pissing contest to see who can be the most xenophobic and racist while restarting the war on women, no Republican candidate has a a shot in 2016","post_message":"Does anyone have enough momentum to unseat Donald J. Trump? See which candidate rose and fell in the new Townhall.com / Hot Air poll:"},{"comment_id":"1721734318116068","commenter_b":"Ean hahaha","commenter_a":"Daniel Howe","post_message":""},{"comment_id":"10153002802946051","commenter_b":"Why do these girls think they can just come and do as they please and disturb ppl....that's good he wacked her off the desk...pinche mocosa pendeja","commenter_a":"Seriously? These kids might as well start applying at the dam circus","post_message":"This student was just sitting there, not taking part in any of the craziness, when one of the dancing girls decided to step forward. It didn't end well."},{"comment_id":"451811115023381","commenter_b":"#DonaldTrump2016Bitches","commenter_a":"You should be embarrassed acting like a child picking on the other runners. Why can't you just tell people what you would do as president? Can't believe a potential president would act like a child...I thought you were different...","post_message":"Tomorrow is the most important Tuesday in a long time. Vote for me, & together we can stop Trump & win in November."},{"comment_id":"10154228766276523","commenter_b":"All over being asked about a reusable bag?! How is that racist? Crazy woman.","commenter_a":"Wow. Fox 6 is really becoming a rag show. Too bad they used to cover the news.","post_message":"All this -- because she was unhappy after being asked about purchasing a reusable bag at the craft store."},{"comment_id":"1409033915841807","commenter_b":"it is her business, she can refuse anyone","commenter_a":"Shouldve kicked the dudes out then shaved her head","post_message":"A Muslim woman went into a local hair stylist and made a shocking demand regarding her religion. It didn't take her long to realize that she had picked the wrong hair stylist... Now, some are saying that this hairdresser went too far. Do you agree?"}]
