[{"comment_id":"1594885237238266","commenter_b":"These dumbasses ran into them in Tampa in Ybor thank God for The Thin Blue Line or those protesters would have had one hell of an ugly day in their life","commenter_a":"Just shows what they are made of! Nothing these crybabies should be kissing the cops asses for saving them lol","post_message":"What happens when whiny anti-Trump protesters interrupt The Few, The Proud, The Marines?"},{"comment_id":"10155736096870231","commenter_b":"Its not about the braids.....its about the #whitegirlsdoItBetter","commenter_a":"What is it called, then, when black women get relaxers to wear their hair straight?","post_message":"The young actress is making sure her comments about appropriation are taken seriously."},{"comment_id":"10156556593115725","commenter_b":"she looks hot","commenter_a":"Nando Martinez - SHE IS A DOCTOR - @username","post_message":"A doctor has been placed on administrative leave after a controversial video showing her violent scuffle with an Uber driver went viral -----> @webpagelink"},{"comment_id":"10153611687931602","commenter_b":"And the fact that a grown woman liked it is equally disgusting. Grow up","commenter_a":"You know who also spoke his mind? ... Hitler.","post_message":"\"Trump? I love everything about him,'' said one voter. \"He speaks his mind and doesn't care if he offends anybody. He's saying, 'This is who I am — take it or leave it.'\""},{"comment_id":"10153805413233352","commenter_b":"There is no such thing as going to far I would do the same shit....I'll kill a little bitch or nigga that lay a had on my child....no matter your age..or gender..daddy got your back....","commenter_a":"And???","post_message":"Shocking moment angry dad ‘tried to run over a group of teens for bullying his 13-year-old daughter’"},{"comment_id":"1734664193415362","commenter_b":"Don't Worry Bernie supporters.. !! Hillary will never win, well never let her ! #FeelTheBern #NotMeUs #HesWithUs","commenter_a":"Hillary is the clear choice for the White House!","post_message":"What a week."},{"comment_id":"10157311512285294","commenter_b":"So... she's not a plagiariser, she's a liar. Guess her and Hillary have something in common after all.","commenter_a":"But didn't Melania say she had no help? Now this? I'm confused I call bull on this one","post_message":"\"I asked to put out this statement because I did not like seeing the way this was distracting from Mr. Trump's historic campaign for president and Melania's beautiful message and presentation.\""}]
