[{"comment_id":"10155316493136509","commenter_b":"She's a putz.","commenter_a":"Kacie Hughes","post_message":"Hillary Clinton: \"The good news is my pneumonia finally got some Republicans interested in women’s health\" @webpagelink"},{"comment_id":"10154150780421028","commenter_b":"@username, she may be immoral and gross TOO but shes not running for president","commenter_a":"Just wondering if NBC will be firing Miley Cyrus from the Voice? There are some really raunchy offensive videos of her out there. Can't imagine why it's ok for her to put that filth out there recently, but he's being punished for something so old.","post_message":"Billy Bush is leaving the \"Today\" show following outrage over the leaked Donald Trump tape, the show's producer says. @webpagelink"},{"comment_id":"10153705912357217","commenter_b":"Morons.","commenter_a":"There needs to be an investigation into the biased remain reporting by the publically owned BBC, a petition is needed to force an investigation by the government that will hopefully result in the breakup and sell off of the corrupt paedophile luvies club and their bully boy licence fee tax collection department too, good riddance!! #ENDBBC!😡","post_message":"EU leaders say the UK must move swiftly to negotiate leaving the organisation bbc.in/euref #BBCShorts"},{"comment_id":"1565531100423273","commenter_b":"WoW... I have never been to the USA, but i fear already for the Afro-americans living there now, after reading this comment (n)","commenter_a":"The ones the cops shoot, is because hey are criminals. Felons with weapons. Threatening others and getting the police called on them. All the others, is just fightin and being dumbasses. White people do that do. White felons and criminals get shot too. But since they are white, no one cares to make a news story.","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"10153296674076323","commenter_b":"i can't deal with her","commenter_a":"@username thought you might find this interesting","post_message":"After Frida Kahlo died in 1954, her husband Diego Rivera shut her belongings in a bathroom at their Mexico City home – then demanded it be locked until 15 years after his death. In fact, the room wasn’t opened until 2004. See the full gallery of what was inside: @webpagelink"},{"comment_id":"403409623179979","commenter_b":"And Hillary with Bill and Chelsia in tow is better. Maybe the icing looks better, but the cake is just as bad and tastes like crap.","commenter_a":"Do you ever wonder which one of the 14 GOP wannabes will get the nod. \"Please forget I'm a Bush, Bush; Mr. Personality Egomaniac Trump; etc. . Fourteen is a long list. I can't keep track. . .","post_message":"\"The crankiness of Scalia's insults run inverse to his intellectual consistency.\" Jon Stewart"},{"comment_id":"1107053186021095","commenter_b":"Woman enjoy sex more than man but how ? I cant beleive that","commenter_a":"Actually women enjoy sex even more than men, so leave them alone. Nature has to reward them more since they have to invest more in the fruits of the sexual act both during pregnancy and after birth.","post_message":"She started the affair when her teenage nephew came to live with her in 2008"}]
