[{"comment_id":"1267032153376522","commenter_b":"What with the Department of Health Services do to \"right size\" the Wisconsin Well Woman Program again if women coming flooding back to the program if the Marketplace goes away?","commenter_a":"How do we make people aware of Ryan's many sleights-of-hands that harm people?","post_message":""},{"comment_id":"10154062692302439","commenter_b":"How will all the \"empowered\" women of America take this? I say there will be a revolt.","commenter_a":"Has the U S stooped so low. No gentlemen, no ladies, no gender. Just human bodies. Numb, mindless zombies.","post_message":"Another gift we can thank the feminists for. Let's see; the epidemic of single motherhood, the breakdown of the American family, the street vernacular of \"bitches and hos,\" the emasculation of men, defense of Islamic misogyny, suppression and oppression, silence on sharia, and the bone-crushing responsibility of one woman being mother, father, breadwinner, chief cook and bottle washer we owe to the feminists. And now this - one can only imagine what the likes of the Islamic State will do to our female soldiers."},{"comment_id":"10154103250631756","commenter_b":"\"Are ya goin' ta prison like my maw??\"","commenter_a":"\"Are you goin' ya prison like my maw??\"","post_message":"Cuteness abounds, but so do questions about whether the kids are plants."},{"comment_id":"10156095135925389","commenter_b":"Donna I believe bush\"s were much better then the Muslim terrorist we have now!","commenter_a":"I do not want Bernie Sanders, Hillary, or Biden!!! Wake up America we need some one who will fix America!!!","post_message":"Question of the Day: Do you think Bernie Sanders can beat Hillary Clinton in Iowa and New Hampshire?"},{"comment_id":"586880071512025","commenter_b":"How about all the hate crimes and murders committed by Muslims? Islam is pure evil. So is Obama & Lynch.","commenter_a":"How many Americans were either killed or injured by Muslims in 2015??????","post_message":" is a pernicious thread that connects the act of violence against a woman wearing a hijab to the assault on a transgender man to ...\""},{"comment_id":"1113246462026036","commenter_b":"I love being a princess. As you can see from time line Imma pussy","commenter_a":"She uses the same playbook as the very people she supposedly hates. Yet the morons line up behind her, rank and file. 'Murica.","post_message":""},{"comment_id":"964810136945374","commenter_b":"Woman is nuts , how did she get the job in the first place?","commenter_a":"I don't think she wants fame. She's taking a stand for what she believes in. Just like everyone else is standing up for what they believe in. Only one that's making her famous is the ones giving her attention. #DRAMASEEKERS","post_message":"Kim Davis's latest attention-grab has blown up in her face."}]
