[{"comment_id":"929829353743480","commenter_b":"Gee, you'd think women would be smart enough to either (a) buy better shoes or (b) switch them out when they start to hurt. I guess not.","commenter_a":"I don't know why people wear them tbf,not if they're uncomfortable","post_message":"Time to switch to flats, ladies!"},{"comment_id":"1230794190274923","commenter_b":"Umm for a free orgasm I bet you would.","commenter_a":"@username how do we get our hands on some of those mushrooms!","post_message":"This fungus can give a woman an instant orgasm."},{"comment_id":"10153916167801178","commenter_b":"Mommas ain't no saints in this passion play either.","commenter_a":"I agree. Black on black crime is so out of control and too many momma's ate losing their children to death. It needs to stop, all drivebys gang shooters need to be prosecuted to the entire law, not just slaps on the wrist.","post_message":"Sheriff Clarke slams Jesse Jackson for refusing to 'talk about the black-on-black crime in South Chicago.'"},{"comment_id":"10154497774003812","commenter_b":"On that show, women would throw their shoes at him.","commenter_a":"Wake up Ellen...","post_message":""},{"comment_id":"10155152380736337","commenter_b":"\"I'm an idiot who has never read a book or even been in a bookstore but I fo sho is gonna post on Facebook all day and show those educated peoples the what for!\" And she says to get a life?","commenter_a":"I literally just had to google who J.K. Rowling is. This person has ZERO impact on me. I find it hilarious that these \"celebrities\" think that they impact our lives in any way, shape and/or form.","post_message":"BURN: J.K. Rowling's latest tweet-spree took no prisoners..."},{"comment_id":"10154975691779859","commenter_b":"Not only NO but hell NO!","commenter_a":"No","post_message":"Should Betsy DeVos be confirmed by the Senate. Although Roy Blunt supports her, local educators and politicians have expressed concerns about her nomination. Vote and then tells us why you support or do not support her in the comments."},{"comment_id":"10155981845940354","commenter_b":"Trump is a media whore. Anyone dumb enough to support him might as well give your vote to Hillary because that is what you asshats are doing NOTHING in Trump's history suggests he is a real conservative. He is just repeating what we say and making republicans look like clowns. His close friend Oprah Winfrey, the person who did more to get Obama elected than anyone else and endorsed by Trump to be vp is ecstatic.","commenter_a":"Hes right pc has got to go. I heard him this morning, if cnn would have allowed him to finish his sentence, he was referring to nose mouth obviously. Typical, cut them off and use it for a soundbite.","post_message":"\"I’ve had lots of men imply that I was unfit for decision-making because maybe I was having my period…\""}]
