[{"comment_id":"1186888831331145","commenter_b":"Hold her in contempt and lock her up.","commenter_a":"What's next stone her.....","post_message":"Her act of resistance has rocked her small Appalachia community 60 miles east of Lexington and made headlines nationwide."},{"comment_id":"10152577391880047","commenter_b":"it is only the beginning of America rising up against it's enemies...all of them...","commenter_a":"This needs to be permanent!","post_message":"BREAKING: Federal court temporarily halts President Obama's illegal Executive action on immigration. Read and Share how the court agreed with our legal arguments in holding this imperial presidency accountable: @webpagelink"},{"comment_id":"10153743132780950","commenter_b":"Fuck you Bitch!!!","commenter_a":"The entire staff cheats on that team !!! Even Bellicheck...fuck the entire Patriots organization!!!!","post_message":"New England Patriots quarterback announces latest move in wake of court rejecting appeal."},{"comment_id":"10153143313576350","commenter_b":"Idiot!","commenter_a":"I think they are all smiling because they didn't know how to react. Maybe a nervous laughter? And they have more class than to be rude...even though he does deserve it!","post_message":"Kanye West had an impromptu moment last night with the TODAY anchors!"},{"comment_id":"10154218056967439","commenter_b":"The ones in the Muslim communities that haven't done anything are still in Stage 1......just wait until they move to Stage 2 & 3....it is in the Quran: @webpagelink","commenter_a":"Cameron what a d-------","post_message":"And do what exactly? Convert? Christianity is not the problem. How many murders, attacks etc will it take for these craven quisling to realize their appeasement and submission is not working? UK PM Cameron: \"Our brothers and sisters who are Muslims, they want our assistance.\" Uh, no they don't."},{"comment_id":"1054288197942749","commenter_b":"Even if that is the case (and that is some BULLSHIT) that is not what the feminist gender gap argument is all about. What happened to you is illegal, what THEY are bitching and whining about is NOT, nor should it ever be.","commenter_a":"And many women support kids on what they earn while the fathers of their children do no pay child support. Talk about discrimination!","post_message":"BOOM!"},{"comment_id":"932499113450014","commenter_b":"That chick in your photo is dating a dick btw.","commenter_a":"Fuck him for treating that person like that. Scumbag.","post_message":"Fuck this guy."}]
