[{"comment_id":"851989354991641","commenter_b":"This is America period,,,all states should ban immediately!","commenter_a":"KEep IT UP","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10152821539741051","commenter_b":"who teaches bulling in school better than teachers?there are people out there that have no business interacting with young people at all. she should be put in the stocks, in school, let her feel what he felt. sue them all back to rubble","commenter_a":"Unbelievable, how could this type of bulling be tolerated? That school needs new policy's.","post_message":"When this woman found out that her grandson had been publicly punished like this, she couldn't believe it."},{"comment_id":"10154088708589087","commenter_b":"Including Melania Trump, she's illegal so vote for Hillary Melania!! LOL!","commenter_a":"the legal immigrants (hispanic and otherwise) should get onboard the Trump train...the illegal immigrants should vote for Hillary.","post_message":"House Hispanic Democrats said Trump is a \"cloud hanging over us\" as they begin celebrating Hispanic Heritage Month."},{"comment_id":"10153139427330329","commenter_b":"Jajajaja es el actor secundario N1","commenter_a":"que wea braaaad.. sale hasta en la sopa el ql ajajja Carolina","post_message":"Here is the new Magic Mike trailer. You're welcome."},{"comment_id":"10152780954836094","commenter_b":"A whore doesn't care who pays them, but whomever pays them calls the shots of the services to be rendered.","commenter_a":"The \"corporate system whores\" can't make treaties with foriegn governments. Only political whores can do that.","post_message":"Within the economics discipline, Joseph Stiglitz has been one of the Trans-Pacific Partnership's most outspoken critics. The Nobel Prize winner in economics recently shared his concerns about the TPP at a community meeting in Queens, New York City."},{"comment_id":"1149506871736008","commenter_b":"You're welcome.","commenter_a":"What an embarrassment this guy is. Shameful. smh....","post_message":"President Obama took a jab at the so-called \"birther\" movement on Saturday night while in Kenya, his father's homeland."},{"comment_id":"10153225867682061","commenter_b":"How can you cut taxes, increase military spending And balance the budget and the only thing going is Obama Care?","commenter_a":"CHILDREN DON'T CHOOSE TO HAVE POOR OR INCOMPETENT PARENTS. FATE GRABS CHILDREN BY THE THROAT AND SAYS, is your life. Poor Child and the Politicians Beneath the greedy iron fist of the Politicians, a ragged, hungry, poor child dwelled Poor Child family tried to climb over poverty restraining wall, but their fragile world collapsed during a cold-blooded eviction from their shoddy shelter Poor Child moved onto a filthy, freezing street, their destitution once again a widespread and noisy public dispute Poor Child body and hope were quickly fading away, tho for their soul, many fellow sufferers continued to wail Politicians and their cronies only cared that reduced assistance and lowered wages for the poor would increase their already huge fortunes Poor Child only wanted, one last chance to be warm, to be dry, to eat. @username","post_message":"WATCH: The #GOPDebate in a minute. More on the debate from last night: abcn.ws/1NJnjrU"}]
