[{"comment_id":"10152606529540950","commenter_b":"Okay says the 21 year old hag","commenter_a":"Old bag","post_message":"Hilary Clinton tweets support for getting children vaccinated @webpagelink"},{"comment_id":"755392124560784","commenter_b":"Happy New year","commenter_a":"Go Bernie..he's the right person for the job!!","post_message":""},{"comment_id":"10154099091458984","commenter_b":"He is another politician and a big lier as well he cheated in the other debate with Ben Carson he will say anything to get a vote and he will owe a million favors for all the lobbyist sending him,all this money","commenter_a":"Why are people at war all the time with a Democrat or a republican let's change this to U.S. political leaders and vote for a person not a party. They always have to make people take sides and it needs to be changed.","post_message":"With the South Carolina primary right around the corner, Ted Cruz is doing his best to diminish Donald Trump's lead. Cruz's latest attack is getting a lot of attention, and it may cause some voters to ditch 'The Donald.' Is Ted Cruz right about Donald Trump?"},{"comment_id":"1241124305907597","commenter_b":"Mexicans R not the enemies! The Enemies come with visas on Air planes! They are already here! Keep bringing refugees! From overseas!!","commenter_a":"Trump will secure our borders!","post_message":"The New York Police Department said it dispatched its \"critical response group\" which is equipped with high-powered weapons, and other security to crowded areas of the city."},{"comment_id":"684790694966567","commenter_b":"He is naturally jumping in the election of this man because he is willingly trying to make this united states and land or\\\\f Muslim's. HE continues to support anything he can by continuing to have open doors for these people and also continues to increase the jobs for them and NOT FOR THE AMERICAN PEOPLE this king of leadership is UNAMERICAN JUST LIKE HE IS.","commenter_a":"No doubt!!","post_message":"Now, it is time for a simple question: Has President Obama launched a political campaign against Prime Minister Netanyahu and his allies? @webpagelink"},{"comment_id":"10153901527564342","commenter_b":"I hope everyone that takes their child there see's this and takes their child out of there...I also hope they shut this place down and arrests that woman","commenter_a":"Their intention was to not hurt the boy yeah OK why didn't they stop when the little boy said it hurt. That's exactly why I do not put my kids in daycare this world is full of stupid people who don't care for our kids. Its not the daycares responsibility to scrub the kids face. Like really. They should face charges I'm sure someone else heard and seen that works with this stupid girl ugh this just really upsets me.","post_message":"The dad wants the daycare to face charges"},{"comment_id":"10158362932045500","commenter_b":"Her water didn't break yet","commenter_a":"Her water did not break","post_message":"BABY WATCH (10am update): Still no baby giraffe yet! When do you think mom April will give birth at Animal Adventure Park? Don't miss anything: @webpagelink"}]
