[{"comment_id":"10153437960854877","commenter_b":"Every woman commenting negatively about Vivica, bet you man or husband would drop you to be with here, you women or old. Her age means nothing when her shape is killing every young girl on this post","commenter_a":"Why is he the bad guy when he's only responding to her messy self knowing he isn't gone let it rest or go!!#SheStupid","post_message":"50 Cent Responds to Vivica A. Fox 'Gay' Comments...and Doesn't Hold Anything Back. Read what 50 had to say below. Grio fam, what's your reaction to 50's comments? Sound off!"},{"comment_id":"1863343793909726","commenter_b":"I hate that woman wit a passion if whoopi was there she will shut her off","commenter_a":"Omarosa is phony as hell. She does not represent Black Americans at all!!! I wish WHOOPI was on set today she would've put her in her place ! Poor joy didn't push hard enough. I don't like Omarosa","post_message":"It wasn't pretty."},{"comment_id":"1038357019610877","commenter_b":"If BERNIE goes Independent, or goes Green, then Good, Hillary is a bitch, a liar, a thief. BERNIE should do anything and everything he can to defeat the nasty bitch. #NeverHillary #BernieSanders2016","commenter_a":"We may still be able to achieve some things of value at the convention. Bernie's current top priority at the convention (as stated in a conference call with his delegates) is to change the Democratic party rules to \"un-rig\" future Democratic primaries so they will be fair to future Democratic party presidential candidates. For him (and our delegates) to have any chance of making future Democratic primaries more fair via votes in the rules committee at the convention, we need to get all our pledged Bernie delegates funded. We are still at risk of losing over 100 pledged Bernie delegate votes, purely due to lack of funds. That's down from over 200 a couple of weeks ago because we have never stopped trying to get them funded. For everyone who is #StillSanders, can you please consider donating $2.70, $5 or $10 (if you can spare a few dollars) to help ...","post_message":"We are building a movement because this country belongs to all of us - not just a handful of billionaires and wealthy campaign contributors. And I'm asking people across the nation to come together and organize an unprecedented grassroots movement."},{"comment_id":"697839387073306","commenter_b":"She should have been arrested months ago!!!! Arrest her now and put her away for good!","commenter_a":"Our Justice Department is corrupt. They will not take appropriate action.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"},{"comment_id":"10153617326474032","commenter_b":"William you have good reasonings, I agree that we need to know who's coming in, but remember that we have some sketchy people who shoot schools and movie theatres here in our own country born and raised. I agree we need to have background checks, but they take a while and that's why they risk their lives to find work and live better lives here. Why would an illegal want to just cross the border to cause havoc? They're here to work. An illegal Mexican can just do that all at home with the money they can make from drug cartel business. Like I said, it doesn't matter where you're from, there is bad in every nation and continent across the world. Even Antarctica. Some penguins are not nice birds.","commenter_a":"Personally, I've lived here my whole life in AZ. I've had more problems with the snow birds than the illegals. Last major bill before 1070 was bullshit. They wasted tax money trying to justify denying EMS to illegals when their own research showed a $240 million dollar surplus brought in by taxes and other monies by illegal immigrants in '06-- even after accounting for the expenditure of 'caring' for them. Here's a thought, how bought we reform and streamline the citizenship process so that people who want to be here and are willing to work here can actually do so and not wait 10 years to get citizenship.","post_message":"For Arizonans, immigration isn't just a campaign issue. Learn what's at stake for all of us at a non-partisan event, #OneNation: Immigration. Get your tickets now: @webpagelink"},{"comment_id":"10153843599995796","commenter_b":"@username - did white privilege cause 360,000 Union soldiers to die fighting to free the slaves?","commenter_a":"Black lives matter is a racist (by definition) organization funded by George Soros to spread a false narrative, agitate and wreak havoc. People who fall for it, like Ms. Hathaway, are never interested in \"having a conversation\".","post_message":"\"I believe the Black Lives Matter movement calls on us to acknowledge our white privilege and its unfairness, to listen to the lived experiences of our darker brothers and sisters and to help them to achieve a world in which people of all shades live in safety,\" Julia Hathaway writes in her OpEd."},{"comment_id":"841765072552278","commenter_b":"Shoot to kill. This is the only way to stop these people","commenter_a":"I support the police, but I do not think that was the time or place for protest...RIP Officer Liu","post_message":"UNREAL: Here The Disgusting Thing Race Rioters Did To The Widow Of Fallen NYPD Officer @webpagelink"}]
