[{"comment_id":"1214194218600606","commenter_b":"Coming from a HoeAssNigga","commenter_a":"Is it a horrible thing that Rihanna is a hoe.","post_message":"\"Is it such a horrible thing that she pretended to be black?\" Rihanna said"},{"comment_id":"10154844264313132","commenter_b":"Sorry katie but i think you are confused between who hillary is and who trump is cuz clearly he was the one interupting her on soo many questions and tring to intimidate her just like he does every other woman but thank goodness she is a strong woman and did not let him get to her lol","commenter_a":"Wow this just goes to prove that hillary is the better candidate hands down. She definately killed trump and i think he got angry and became soo defensive lol she was very prepared and he was not","post_message":"Donald J. Trump says he will release his tax returns when Hillary Clinton releases her deleted emails. @webpagelink"},{"comment_id":"10156550497830354","commenter_b":"It would seem to me that either of the following words would properly describe this situation; Epic... Fail, Fell, Fall.","commenter_a":"Weedoing out the useless.","post_message":"Distracted walking while using an electronic device led one man to a deadly 60-foot fall off a San Diego cliff on Christmas Day..."},{"comment_id":"10153970352414087","commenter_b":"how many lies does that bitch have to tell before your eyes open? Or do you not care, is it all about the vagina's turn in the WH?","commenter_a":"more like clinton being suicidal (can only hope) watching her campaign going down in flames with all her lies","post_message":"\"Longtime ally of Paul Manafort, Trump's campaign manager: 'Manafort not challenging Trump anymore. Mailing it in. Staff suicidal,'\" CNBC reporter John Harwood tweeted."},{"comment_id":"10154133671460950","commenter_b":"There was only 1 person who refused to vote guilty all 12 have to agree, this piece of shit refused to vote guilty. There were 11 people who voted guilty","commenter_a":"Its the south and besides he had an all white jury and he shot the man in cold blood it was caught on camera and the jurors call it a mistrial","post_message":"WATCH: Judy Scott, mother of Walter Scott, reacts to a mistrial being declared in Michael Slager's trial: \"It's not over 'til God says it's over.\" @webpagelink"},{"comment_id":"10155781129770329","commenter_b":"The Government shouldn't be funding ANY OF IT, that's the reason it would be discontinued. The Federal Government protects our borders, prosecutes Federal crimes (FBI) and unifies States with Federal Laws under the constitution. That's ALL I WANT THEM TO DO. I support Trump cleaning house on the outrageous spending the Federal Government has been doing for some time. PBS can go back to private funding and telethon like they did when I was a kid. NPR, same idea. They need to raise their own money like any other radio/news outlet. The amount of fees we will begin to charge Mexico for deporting all the people they let cross over will pay for The Wall. In taxes to Mexico for importing goods here. Learn basic Economics and US Government people, geez...","commenter_a":"The best part about PBS, NPR, and those other arts programs that are getting cut is that they actually don't cost that much. So, really, there isn't a lot of money being saved to go towards the idiotic wall that he wants to build.","post_message":""},{"comment_id":"1376753242362908","commenter_b":"o.k you're can't be racist . how about a whiney , hateful bitch ? yeah ,that suits you better .","commenter_a":"Outrageous!","post_message":"These people are insane."}]
