[{"comment_id":"1393410924025989","commenter_b":"Sam","commenter_a":"They should name the chicks Liberty and Freedom","post_message":"HATCH WATCH CONTINUES: Eagle parents Harriet and M15 have taken turns incubating two eggs. We could have an eaglet hatchling soon. (Video courtesy of Dick Pritchett Real Estate) @webpagelink"},{"comment_id":"10153160535761491","commenter_b":"Shes nowhere close to finny. Shes more along the lines of annoying.","commenter_a":"Non stop coverage of Amy Schumer won't work. She's still not funny.","post_message":"\"Amy and I were creatively made for each other,\" Jennifer Lawrence said."},{"comment_id":"1266458500080562","commenter_b":"These articles consistently show how unbalanced a frightening amount of women are. Cheating should NEVER result in assault or worse. Never.","commenter_a":"Did he learn anything?","post_message":"She shot him in the groin for having an affair"},{"comment_id":"1551325111574622","commenter_b":"This is HER country.","commenter_a":"Now do we really care what this looney tune thinks or if she accepts Trump...if she does not accept him....send her out of the country!","post_message":"No one could have said this better."},{"comment_id":"10153063738641135","commenter_b":"Ladies","commenter_a":"Except, it turns out she is not a very kind person either. Her facebook is private now but before this story broke and it was visible, she had posted many things making fun of those with disabilities. She is also appears to be a 9/11 conspiracy theorist. I wish news outlets would look into this before constantly sharing this story.","post_message":"ICYMI: A Michigan mom bought coffee for two women behind her at a Tim Hortons despite insulting comments made about her looks. STORY: @webpagelink"},{"comment_id":"10156725914675093","commenter_b":"Trump gonna go all the way...There's no stopping the Trump Train!","commenter_a":"I really like watching all you rpublicans running in circles..HA...HA....HA HA!!","post_message":"Other Republicans say we should protect the Constitution. Ted Cruz has actually done it; indeed, it has been the animating passion of his career. Read the full editorial in the link & vote in our poll at the end!"},{"comment_id":"10152804677074342","commenter_b":"Lots of prostitutes in England!!!!","commenter_a":"PROSTITUTES in LAS VEGAS. Stupidity","post_message":"DIARY OF EVIL: A teen has been found guilty of attempting to kill three woman out of 'revenge' and from frustration of not being able to lose his virginity. \"I was planning to murder, mainly women, as an act of revenge because the life they gave me. I'm still a virgin at 17.\" FULL STORY --> @webpagelink"}]
