[{"comment_id":"1841357016150669","commenter_b":"Coming out now? It sure is a convenient time. Why is she reading it?Another thing if Trump was sexually abusing her why did she stay ? Why didn't she leave when he first kissed her. She stayed and he kissed her again. He put his hand on her breast and she still stayed? Give me a break! This woman is big time lying. This never happened!","commenter_a":"So many people are so stupid and are going to vote for Hillary but when she cause a war and all your children are sent to war and dying don't complain.","post_message":"\"I stood up and he came to me and started kissing me open-mouthed as he was pulling me towards him. I walked away and I sat down in a chair.\" - A former contestant on \"The Apprentice\" describes alleged unwanted sexual advancements made by Donald J. Trump. More: @webpagelink"},{"comment_id":"10154837209509657","commenter_b":"Gowdy did you just find out that democraps cant be trusted? I could have told that to you years ago.","commenter_a":"The only thing that will cause changes is to put Hillary Clinton in jail. Make an example of her. Set an example that shows that politicians cannot go around lying and mishandling classified information without dire consequences happening to them. You have got to get that train back up on its tracks.","post_message":"Desperate times call for desperate measures."},{"comment_id":"10154128572736378","commenter_b":"Shouldn't they have to go back home before mommy and daddy lock the basement door","commenter_a":"Wonder if they voted?","post_message":"#BREAKING - Hundreds of protesters are marching through Center City, Philadelphia tonight, near City Hall. They are unhappy with Donald Trump's election. Many of these protesters are local college students, others say they are supporters of former democratic presidential candidate Bernie Sanders. @webpagelink"},{"comment_id":"10154716032249714","commenter_b":"Triggered a feminist. Didn't take long. What benefits will hillary do for you? Decrease tax rates hah funny. Zoe you sound little butt hurt you might need to see proctologist.","commenter_a":"Woah Woah Woah More Democratic Propaganda. Time to settle down @username.","post_message":"\"The first time I doubted my looks and worth was in kindergarten.\""},{"comment_id":"1266627376716224","commenter_b":"No one has said no to immigration, just no to ILLEGAL immigration. And NO to ILLEGAL CRIMINAL immigrants! Wish you people would finally get it.","commenter_a":"white old man...","post_message":"As the son of an immigrant father who came to this country with no money and little education, I understand that our greatest strength is our diversity. We are a nation of people who have come here from every corner of the earth. We practice many religions. We are gay and straight. We are black, white, Latino, Asian American and Native American. Mr. Trump. Your job as president is to bring people together, not divide them up. Support comprehensive immigration reform, not mass deportation."},{"comment_id":"754556321401612","commenter_b":"Tie them by their ankles to a fast moving train!!","commenter_a":"This is the mine set of Muslims. That it's ok . Send their asses back","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News They deserve much worse than this. What do you their punishment should be?"},{"comment_id":"884276841629012","commenter_b":"I'm not for it but I will say this: the government has known and has collected millions of dollars from illegals with fake social security numbers. Republicans and democrats both. To work here the illegals have had to come up with a fake s.s. number and pay on every check. This is a fact. I've seen it, known people who pay into it and will never see a dime from it. Our government is full of lies. They take that money and our legal money and blow it. Like I said I'm not for illegals but don't be blinded any side of the aisle in Washington D.C.","commenter_a":"This ia considered buying votes and that's illegal...but then everything Obama does is illegal. ..STOP HIM","post_message":"Thousands of illegal aliens could begin collecting from Social Security as a direct result of the president’s executive amnesty."}]
