[{"comment_id":"10153853522001336","commenter_b":"Your Governor says yes to more refugees.","commenter_a":"I just found out that approximately 130 Syria refugees are here in PA .","post_message":"“What I want is a watch list. I want surveillance programs. Obviously there are a lot of problems. I want a database for the Syrian refugees that Obama’s gonna let in.” Donald J. Trump went “On the Record’ to clarify his recent comments, emphasizing that he wants to keep track of the Syrian refugees entering the United States, not all U.S. Muslims. @webpagelink"},{"comment_id":"556763161150305","commenter_b":"Steven...do you suck your dad off with that mouth?","commenter_a":"Oh, that's soooo terrible... You think the several thousand people he had killed didn't fear for lives? The ones who were shot, beheaded by chainsaws, scalped & skinned alive, and who had limbs broken and cut off? Extradite Chapo, throw him in ADX Florence for the rest of his life, and admit this bimbo to a psych ward.","post_message":"Emma Coronel: \"I'll follow him wherever because I am in love with him.\""},{"comment_id":"875381432484713","commenter_b":"I dont know about you ladies but I sure dont want to see no 35 year old pop star.","commenter_a":"Kenya once again showed what a messy, ugly, and miserable woman she is. Claudia is Kenya's equally despicable sidekick. Demetria needs to grow a brain of her own. NENE LEAKES showed she is the Queen of RHOA. And Cynthia continues to talk tough, but if someone says boo to her, she will break down in tears when all is said and done. Phaedra was dead wrong for asking Demetria is she had done crack, but Demetria had one of the night's best comebacks with the 'all we have in common is the number 8'!","post_message":"“Your Clit Has Left Your Body!\" Phaedra's Shade, NeNe's Wrath and Claudia's Toes Are Unleashed #RHOA Ep. 10 @webpagelink"},{"comment_id":"1231714623549367","commenter_b":"She will fit in better there, anybody who watched Fox on election night knew how desperately she wanted Hillary to win!","commenter_a":"Good bye bye democratic stooge","post_message":"BREAKING: BUH-BYE MEGYN…The Woman Who Miscalculated Her Power With Viewers Is Leaving FOX To Join Liberal, Anti-Trump NBC"},{"comment_id":"10153519481412377","commenter_b":"She'll just continue to perjure herself if they do and unfortunately with the Obama DOJ behind her, nothing will ever come of it. Miscarriage of justice? You know it.","commenter_a":"This is such bull, it goes on and on and on. If they were going to do something , it would have been done.","post_message":"Agents will probably seek to interview Clinton soon, if they haven't already, former Justice Department officials said."},{"comment_id":"10153591926318984","commenter_b":"She's bitchin because her kids need to eat, where are the 6 daddies at? And where do these people think that money comes from! Get a fucking job!","commenter_a":"TRY AND GET ONE OF THE JOBS THAT OBAMA AND THE DEMOCRATS ARE GIVING THE ILLEGALS THAT ARE COMING OVER THE BORDERS THAT HE WILL NOT CLOSE P.S. ASK OBAMA WHY HES DOING THIS TO YOU DO YOU REALLY THINK HE HELPING YOU AND YOUR FAMILIES IF YOU DO YOU ARE ONE OF THE PEOPLE THE DEMOCRATS SAID HAD. STUPID WRITTEN ON YOUR FOREHEADS ITS TIME FOR YOU PEOPLE TO SMARTEN UP DONT YOU THINK","post_message":"This is simply shocking... Is this what our founders envisioned for America?"},{"comment_id":"10153620760216028","commenter_b":"From the Bible: (who cares about what verse, you know it's in there!) If your own full brother, or your son or daughter, or your beloved wife, or you intimate friend, entices you secretly to serve other gods, whom you and your fathers have not known, gods of any other nations, near at hand or far away, from one end of the earth to the other: do not yield to him or listen to him, nor look with pity upon him, to spare or shield him, but kill him. Your hand shall be the first raised to slay him; the rest of the people shall join in with you","commenter_a":"Quran (2:191-193) - \"And kill them wherever you find them, and turn them out from where they have turned you out. And Al-Fitnah [disbelief or unrest] is worse than killing... but if they desist, then lo! Allah is forgiving and merciful. And fight them until there is no more Fitnah [disbelief and worshipping of others along with Allah] and worship is for Allah alone. But if they cease, let there be no transgression except against Az-Zalimun(the polytheists, and wrong-doers, etc.)\"","post_message":"UPDATE: The death toll has risen to 63 people, with more than 300 others injured. The Pakistani Taliban has claimed responsibility for the suicide attack. BREAKING: At least 52, mostly women and children, were killed and around 150 others were injured when an explosion ripped through a crowded park in the Pakistani city Lahore, a few feet away from children's swings, officials said. @webpagelink"}]
