[{"comment_id":"10152623006528067","commenter_b":"Explain free? Teachers work for free? Colleges get free utilities and maintenance? Books?","commenter_a":"Nothing is free","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"1731231320495188","commenter_b":"Fool","commenter_a":"Now ratify Obama's choice for Supreme Court judge.","post_message":"Backed into a corner, Senate Republicans have given up trying to repeal Obamacare."},{"comment_id":"1146391592075725","commenter_b":"ANOTHER RACIST TO PODIUM","commenter_a":"Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry","post_message":"LIVE: Presidential Nominee Donald J. Trump is in Warren to speak to supporters just 8 days before election day. More info: bit.ly/TrumpvisitsMCC"},{"comment_id":"10154261314153525","commenter_b":"He had it made on Howard channels. Then double crossed hogan with the tapes etc. Dirt bag. How many times can he use the connection with tony Stewart. He is a Howard copy cat with less talent.","commenter_a":"Jimmy","post_message":"JUST IN: Bubba the Love Sponge is off the air in the Tampa market. MORE: @webpagelink"},{"comment_id":"10153292399553984","commenter_b":"He has it coming to him.","commenter_a":"yes I do","post_message":"Obama's big plans have blown up in his face! That's got to hurt... Do you hope Obama finally gets the message?"},{"comment_id":"968868466550965","commenter_b":"Let's leave tomorrow!","commenter_a":"How do we get his life @username","post_message":"Can we apply?"},{"comment_id":"1138154636255284","commenter_b":"YOU are so full of it....I bet women probably leave YOUR sorry ass....YOU have NO CLASS. ...I CAN TELL","commenter_a":"I DON'T believe that...Who would want her....No One....Just her husband and she's lucky he gave her the time of day","post_message":"She was just exposed. This family needs to be booted from the White House. Do you think Michelle Obama is a disgrace?"}]
