[{"comment_id":"10154954307148984","commenter_b":"You're the dumbass,bitch!","commenter_a":"Lol.you dumbasses believe in stump???lol. I hope you get what he gives you lol and more","post_message":"Paul Ryan is shaking things up with this unexpected announcement. He feels so strongly about this, he decided to make his feelings known during Donald Trump's crucial transition period..."},{"comment_id":"1381562928548606","commenter_b":"Ya and they'll have to start paying for water or make their own from sea water. Of course northern Ca, will succeed, so all we will lose is the three out of control cities. Not bad","commenter_a":"3 trillion in debt CUT EM LOOSE","post_message":"Spread this everywhere!"},{"comment_id":"10153557407432964","commenter_b":"Did they really come legally? I think not. America was first inhabited by the Indians. Christopher Columbus discovered this country by chance and we were not invited, so legally I would think not. We took over, slaughtered many Indians in the take over. So please don't go there. If immigrants come to America I agree we need to now come legally and apply for citizenship, but that is not the issue. The issue is the children born here! This is where they were born and with that they are American! Period!","commenter_a":"I'm not sure I agree with that statement because regardless of whether their parents are immigrants, they too have the ability to become Americans. The children who are born in this country are born on American soil and should be considered Americans, just my thoughts. After all we were all once immigrants and at one time even if we ourselves are not immigrants, we were born on American soil from an ancestry of immigrants and for that reason we too are Americans. I agree with many things about you Senator Vitter, but I have to say on this I don't agree.","post_message":"I think it's flat out wrong for children of illegal immigrants to become U.S. citizens just because they were born here, especially when it’s justified using a false technicality of the Constitution. I made this argument in a guest column in USA Today. Read more:"},{"comment_id":"10152629454892894","commenter_b":"She mad @username don't believe that hoe","commenter_a":"Aliah Tamartian Trainer Toi Magee-Taylor","post_message":"Coupled Up? Keke Palmer & August Alsina are Ridin' Around & Gettin' It [Photos]"},{"comment_id":"10153227651945329","commenter_b":"Ikr how dare she maintain a healthy lifestyle, the bitch.","commenter_a":"She can fuck off","post_message":"More like baby washboard, amiright?"},{"comment_id":"10152739505691028","commenter_b":"YEAH!!CONSEQUENCES!!! Let's round up all the Muslims and throw them in camps and just gas them!!!! Because that works out so well for society,you know.","commenter_a":"If they are not savages, what are they then - klilling innocent people? There should be consequences for this!","post_message":"\"Statements like these cause mistrust and fear of Islam and Muslims. It is unbecoming of a public elected official to issue such bigoted statements.\" @webpagelink"},{"comment_id":"1669966499994538","commenter_b":"Dumb. Completely fucking dumb if you vote for her. Please, take her and leave the country.","commenter_a":"WHAT A WEB WE ARE WEAVING , A WOMAN CAN BE PRES. JUST NOT THIS LYING WOMAN,WHO COULD BE PROUD OF HILLARY FOR PRESIDENT.","post_message":"Michelle Obama got emotional when speaking at the Democratic National Convention, as she remarked that \"Because of Hillary Clinton, my daughters...take for granted that a woman can be president.\" @webpagelink"}]
