[{"comment_id":"10153578491758984","commenter_b":"Let's ban ass holes","commenter_a":"He's the WORLDS biggest idiot,instigator, racist that ever walked the planet... Al you gotta go!","post_message":"Reverend Al Sharpton just announced his huge plan to destroy Kid Rock's concert tour, and it's absolutely sick. Kid Rock will NOT take this lying down. Sharpton has no idea what kind of war he just started."},{"comment_id":"900665266646768","commenter_b":"abortions have been going on before obama ever took office","commenter_a":"Abortion is indeed murder, and he is the ring leader behind it all.","post_message":"Eight years with a pro-abortion radical is eight too many. No more pro-aborts in the White House!"},{"comment_id":"369558209835168","commenter_b":"She's going to die","commenter_a":"Lesley has asthma and she wants to come @username Christian Canales @username @username","post_message":"People living in Galena Park are being told to shelter in place because of a sulfur dioxide release at a Pasadena refining system. This is viewer video from Geno Salinas. Story --> @webpagelink"},{"comment_id":"10155647671150354","commenter_b":"She is a racist and a total disgrace!!! She encouraged the thugs to destroy Baltimore; what a LUNATIC!!!","commenter_a":"She also believe that is disrespectful to ask a Liberal a real question and expect it answered with out making a quote that your question is disrespectful to there position. Attention Liberal Politicians: every aspect of your your public life, how you act, what you say and your political views are all fair game in the management of the public safety.","post_message":"What do you think? Was the reporter being rude?"},{"comment_id":"1754772134792927","commenter_b":"@username is voting for hillary just because she is a female","commenter_a":"I can't wait for you to be the next POTUS @username. You've got my vote Madam Secretary. #Imwithher.","post_message":"You saw the Democratic National Convention. Now, watch the never-before-seen footage from backstage:"},{"comment_id":"10153556104221336","commenter_b":"Do skank lives matter?","commenter_a":"Be careful who you get in bed with...","post_message":"After waiting about 20 minutes while the women talked, U.S. Senator Bernie Sanders was pushed away again when he tried to take the microphone back."},{"comment_id":"10153329720368701","commenter_b":"They should drop the drinking age to 18 instead. Only Islamic countries are as strict as the US when it comes to drinking age. Raising the tobacco age will simply result in sneak smoking just like raising the drinking age resulted in binge drinking. Adults need to be adults.","commenter_a":"how about the state legislature concentrate on what it was elected to do: keep a balanced budget and not waste taxpayer money.","post_message":"What do you think, should Oregon and Washington follow suit?"}]
