[{"comment_id":"10154064553747464","commenter_b":"Gaining delegates is part of how you win, especially in an open convention. He'd be crazy *not* to. It's something Trump is learning the hard way.","commenter_a":"Why use every edge known to man Cruz, just have a straight up best man with the most votes win's. You cheapened yourself pandering for delegates, it appeared slimey and desperate. Also why did you go to the border with Beck to hand out welcome boxes to ILLEGALS that were entering our country ILLEGALLY if you really believe in the wall and making already existing ILLEGALS leave this country????","post_message":"Join us on Monday for #CruzOnGMA!"},{"comment_id":"10156574233540725","commenter_b":"I say go to the debate the hell with Megyn Kelly .","commenter_a":"You can get along with Joe Scarborough, Nancy Pelosi, Harry Reid, and not Megyn Kelly.....?","post_message":"Should I do the #GOPdebate?"},{"comment_id":"10153761646217439","commenter_b":"Dorrie America is a christian country. No one has to live under Sharia law unless they desire to participate. Women that are abused need to run to a shelter with their children ASAP.","commenter_a":"Brilliant and brave that Ben Carson would say openly what a majority of Americans are to afraid to say about Islam. Obvious to non-politicians what the incompatibility is all about.","post_message":"Carson is the first presidential candidate ever – or perhaps since Thomas Jefferson – to show a detailed knowledge of Islam and Sharia: “Right now,” he said about the possibility of a Muslim President, “when you have something that is against the rights of women, against the rights of gays, subjugates other religions and a host of things that are not compatible with our Constitution, why in fact would you take that chance?” Brilliant. Contrast those clear and simple and accurate words to the Obama administration’s systematic and deliberate denial of the nature and reality of the jihad threat. The entire Obama response to the jihad is called “Countering Violent Extremism.” Note the glaring absence of any reference to Islam and jihad. Obama is trying to fight a war while pretending that the enemy is other than what he is, or even worse, is nameless, faceless, and bereft of ideology. ..."},{"comment_id":"10153371654068855","commenter_b":"She's just trying to get famous.","commenter_a":"...why can't this bigoted bitch comprehend and accept REALITY?! (well, because she is an ignorant, bigoted, discriminatory and hateful bitch! - and perhaps soon-to-be unemployed, too!!!)... Government Employees Have No Freedom Right To Refuse Service To Same-Sex Couples, Says Americans United Jul 8, 2015 Clerks Must Issue Marriage Licenses To All Qualified Couples, Church-State Watchdog Says Government employees who oppose marriage equality because of their religious beliefs are not entitled to refuse service to same-sex couples, Americans United for Separation of Church and State has informed officials in all 50 states today. In a letter released today, which will be sent to all state attorneys general as well as county clerks in Texas and South Dakota, Americans United explains that with marriage equality now the law of the land, government employees do not have the right to opt out of serving gay couples, because doing so would harm those couples ...","post_message":"You have to do your job, Kim Davis!"},{"comment_id":"10153351201607439","commenter_b":"We the People have our lives going and We the People aren't the ones waging war on other countries. It's the government. They want to go to other countries and spend trillions of our tax dollars on them and try to get those mid east countries to be more civilized. Well, you can't teach a baboon how to talk and you surely can't teach these primitive thinking tribes to be civil. So the only thing they know is to try to rule the world and get the whole world to be on their level. As for that Boston Bomber mother.....your fu*kface son will burn in hell way before your 'people' get a chance to try to burn America down! And you'll be under ground too and will never see America burn. America's too strong of a Nation for that. Even with this Muslim president.","commenter_a":"Hey, your religion aint working.","post_message":"@webpagelink"},{"comment_id":"10153761021059749","commenter_b":"yep! so that they can have all to themselves the beautiful beaches built in Arabian countries by Europeans and practice their 72 virgins rapping galore practices eh?","commenter_a":"There is a simple way to stop ISIL. Kill them, kill their supporters, and don't stop killing until they are neutralized. Chivalrous rules of war are for opponents who will reciprocate. Virtue without reward is foolish. This is NOT a US problem. If the Muslim world objects to ISIL they have one, only one, way to show it. Kill them. That's what war is for. ISIL are winning because they have the guts and the passion (to borrow an Oriana Fallacci phrase) to stay in the fight. Their opponents lose because they are weaklings.","post_message":"\"The glories of Syria are now off-limits to Western visitors, reduced to rubble by Assad and Isil. Now Egypt may suffer a similar fate.\""},{"comment_id":"507278876143443","commenter_b":"Sorry but I do not understand why faces of those son of bitches are hidden! People should know who they are ....","commenter_a":"Cut them off and save them This is why when they become adults they attack humans!!!!!!!!!!! Ps. We should not be entertained at a circus by animals but actual talent of humans. Animals should be left in their habitat!!!!!","post_message":"Have you ever heard a baby bear's spirit break? THIS is the circus."}]
