[{"comment_id":"1875959669293549","commenter_b":"I believe that she should be charged. I wonder if that would have happened if it was a white MALE officer. Just wondering.","commenter_a":"I believe she checked it for a person.","post_message":"BREAKING: Tulsa police officer Betty Shelby has been charged with manslaughter in the first degree. Shelby fatally shot 40-year-old Terence Crutcher"},{"comment_id":"1183538221666206","commenter_b":"Now his mother is going down. Lol","commenter_a":"They have the wrong MAN!! Texas has executed many people because they are known to railroad!! We need to donate to the mans defense.","post_message":"The mother of the suspect in the execution-style killing of Texas sheriff's Deputy Darren H. Goforth said her son can't be the gunman because he was out shopping with her at the time."},{"comment_id":"865107826951175","commenter_b":"Who cares / she's useless","commenter_a":"And, Donald Trump(ish) is not racist, bigoted, arrogant, insensitive, and lacking in political comprehension ???","post_message":"Fauxcahontas."},{"comment_id":"10154376040464641","commenter_b":"making of The Taken 3 (Must watch Unbelievable) @webpagelink","commenter_a":"That's what we should be doing focusing on the dummies in the audience, the cockroaches","post_message":"Donald J. Trump's controversial \"Second Amendment people\" comment made Darrell Vickers' bearded jaw drop."},{"comment_id":"10153757238999411","commenter_b":"Maria J Haloho A slut will be a slut anywhere","commenter_a":"Most Arabs are depraved sexual predators.Anyone who has ever seen Arabs on holiday in a European country can confirm that","post_message":"'Obviously neighbors aren happy about it, but it is what it is'"},{"comment_id":"10152721267846813","commenter_b":"Did feminists put these dumb words in this clown's mouth?","commenter_a":"The problem comes from this institutionalized idea that men are superior to women and therefore can make decisions on behalf of women. It is a systemic problem that as a society we have been fighting externally, but have found challenges how to fight it internally.","post_message":"Should men be able to decide what happens to a woman’s body? Sound off in the comments section! #LetsTalk"},{"comment_id":"10152872089786135","commenter_b":"Nations aren't doing too well and filled with hate, before this law was passed.","commenter_a":"We all know what God does to nations that disobey His word and goes rampant","post_message":"BREAKING: U.S. Supreme Court requires states to recognize marriage between two people of the same sex. LIVE UPDATES: @webpagelink"}]
