[{"comment_id":"10150721680719999","commenter_b":"That's not true @username. There care is every bit as good as ours and not nearly as expensive.","commenter_a":"We need a single payer system. My daughter lives in France, and I'm always impressed with their healthcare. Stress free.","post_message":"Here is the surest way to enjoy the peace of mind that comes with having health insurance: Don’t get sick."},{"comment_id":"10156197191420354","commenter_b":"A CULT that needs to be extinguished!","commenter_a":"Islam is NOT a religion of peace!!!!!","post_message":"The full statement is SCORCHING..."},{"comment_id":"10154700098471323","commenter_b":"All talk of this being an exercise in protecting democracy is simply a smokescreen. This lady is a member of the privileged elite aiming to derail the Brexit we voted for by seeing it completely emasculated to the point where the status quo will be preserved. The bankers and fund managers will never allow ordinary people their freedom. Only the rich are allowed to be free.","commenter_a":"All MPs are Selfserving PARASITES .The People have VOTED DEAL WITH IT .And Start bye getting our Borders sortted and RIP UP ALL EU LAWS Because we never needed them .FACT .And Stop Foreign Aid.We carnt afford it.And Spend the money on the people that need it in the UK..","post_message":"\"Neither the British people nor parliament have, however, voted on what form that leaving should take, or on which fundamental rights will be removed as a result of leaving. Those are questions that can be decided only by our sovereign parliament.\""},{"comment_id":"10153241233694087","commenter_b":"Which wife??","commenter_a":"He makes good decisions ... look at his wife and his kids ...","post_message":"\"He is who he is,\" Melania Trump said of her husband Donald J. Trump. \"Even if you give him advice, he will maybe take it in, but then he will do it the way he wants to do it. You cannot change a person. Let them be. Let them be the way they are.\""},{"comment_id":"10153055222394877","commenter_b":"Wrong! I've awakened with someone riding on my dick..The dick can get hard without you even knowing it... while you're asleep. Duh. Ever heard of a wet dream!","commenter_a":"Rape is rape, no matter the gender of the rapist and they all should get equal servere punishment. She deserves more than 9 months tho.","post_message":"Mother of 3 arrested for breaking into a man's apartment and raping him while he slept. Grio fam, if she was a man do you think her sentencing would have been more severe? Sound off below!"},{"comment_id":"1029144867143578","commenter_b":"@username maybe they should all go to Mexico instead .","commenter_a":"Trump. A habitual liar, narcissist, racist, fascist, five time draft dodger, four time bankruptcy filing, woman hating misogynist, bigoted bully. A man who only has money because he's a vaginal success. (Born into wealth.) A man who represents everything that's wrong with this country. Yet, people will vote for him. The very same individuals who stand to lose the most. Wake up. He only cares about himself.","post_message":"New Jersey Gov. Chris Christie offered up the latest twist of the Republican presidential primary when he endorsed Donald J. Trump on Friday."},{"comment_id":"10153253514670329","commenter_b":"please shut the fuck up","commenter_a":"In what world are 12 year olds adults? The entire point of a juvenile justice system is that children are NOT adults in age nor brain development. They need mental health treatment in a correctional facility tailored to children.","post_message":"They face a count of attempted first-degree intentional homicide. (via BuzzFeed News)"}]
