[{"comment_id":"10154029757858132","commenter_b":"Wow. You ladies are some different kind of stupid","commenter_a":"Breastfeeding in public is fine but cover up, no one wants to see you whip your boob out in the middle of their lunch in a restaurant.","post_message":"This mother refuses to be shamed."},{"comment_id":"1038718286244949","commenter_b":"If you vote democrat you do not think much of your country? Do not ever forget BENGHAZI","commenter_a":"They are a bunch of lowlife communist wanting to destroy the country from the Left wing.","post_message":"ClashDaily.com"},{"comment_id":"10152661116841491","commenter_b":"Thugs are thugs, white or black. Stop acting like it is a racist term, people. These idiots belong in the exact same grouping as the ones in Ferguson and deserve to be treated the exact same way.","commenter_a":"Omar Shtayyeh","post_message":"Columbus Police Department spokeswoman Denise Alex-Bouzounis said that about 8,000 students forced their way into The Horseshoe stadium and tore down a goal post."},{"comment_id":"1279026295523755","commenter_b":"Translation: \"such a nasty woman\"/\"Bitch\"","commenter_a":"I just have to laugh about this because he represents himself so horribly and it just scores points for Hillary. She is tough and takes it like a woman because women are strong and tough!","post_message":"Absolutely deplorable."},{"comment_id":"879108405613069","commenter_b":"He better watch his back. Killery has a lot of time on her hands now.","commenter_a":"Although Comey has a 10 year term, he can be terminated at the Presidents request. He truly needs to go, as well as his assistants. Trump should start with a new regime that will be loyal to the actual rule of law and not a puppet. Thank God lynch is history.","post_message":"James Comey just received the worst news of his life. America demands answers, and you better bet we're going to get them. Do you think Comey needs to come clean?"},{"comment_id":"867123823334246","commenter_b":"A woman has the right to decide who and what uses her body just like every other person.","commenter_a":"my rights stop where yours begine and vice versua","post_message":"Unborn babies deserve protection!"},{"comment_id":"1296306160407617","commenter_b":"I hope that VA dentist is in JAIL!","commenter_a":"No one at the VA loses a job; for any reason. The 2014 fudged wait list debacle resulted in no nurse or lying administrator losing a job or even pay. The VA is a corrupt leviathan in need of elimination. And with my first hand knowledge of the organization, I would put a bullet in my temple before becoming a patient in the system.","post_message":"Absolutely horrific! This department needs to be cleaned out top to bottom, and people need to be punished for letting things get this bad."}]
