[{"comment_id":"10152634515646813","commenter_b":"Mind your own damn uterus, mkay?","commenter_a":"ACLU's \"rape culture\" worship, Rape of the child in the womb with instrumentation. rape to death..","post_message":"VICTORY! Federal judge strikes down law that could have closed #Wisconsin abortion clinics, calling the law “a solution in search of a problem (unless that problem is access to abortion itself).\" @webpagelink"},{"comment_id":"1235978386476227","commenter_b":"someone please give that nasty fat cunt a coupon to jenny criag.","commenter_a":"Get over yourself!! U need to go to the gym","post_message":"Entitled woman claims cashier give her a free drink because her grandmother was a slave. 'LIKE' if this is WRONG!!!!"},{"comment_id":"1705728746332744","commenter_b":"The blacks elected him with help thinking they would have it made financially etc and now more are out of work and on welfare than ever. They have to stay in school and work hard like everyone else to get ahead and blacks don't see it. How do they think you get a position anywhere?","commenter_a":"Absolutely","post_message":"SHARE IF YOU AGREE!"},{"comment_id":"10153939512524087","commenter_b":"@username .... Why would anyone vote for Hilary the war monger ? She stands for nothing that benefits American citizens... all she talks about is illegals and bringing in Muslims... blacks are totally used by her.... She dumps illegals in poor black communities... but will never have Muslims or illegals where she and her friends live.... people like you are a joke.. total fools.. and Trump is not a racist stick that card up your asss... its old used outdated game...","commenter_a":"After Trump loses in the election I wonder what's next for Republicans. Atleast he brung out the closest racist and exposed the Republican party for what it is","post_message":"Prominent Donald J. Trump critic GOP Sen. Jeff Flake had kind words to say about Trump following last night's nomination speech at the Republican convention."},{"comment_id":"10153258325486680","commenter_b":"Dear Airlines:* Dump the male flight attendants. No one wanted them in the first place. Replace all the female flight attendants with young good-looking strippers. They don't even serve food anymore, so what's the loss. The strippers would at least triple the alcohol sales and get a \"party atmosphere\" going in the cabin. And, of course, every businessman in this country would start flying again, hoping to see naked women. Because of the tips, female flight attendants wouldn't need a salary, thus saving even more money. Muslims would be afraid to get on the planes for fear of seeing naked women. Hijackings would come to a screeching halt, and the airline industry would see record revenues. This is definitely a win - win situation if we handle it right -- a golden opportunity to turn a liability into an asset. Why didn't Bush or Obama think of this? Why do ...","commenter_a":"Bernie would trounce him! Trump would get absolutely destroyed! Lmao 😂","post_message":"Donald J. Trump: \"Oh would I love to run against Bernie. That would be a dream come true.\""},{"comment_id":"737091973148047","commenter_b":"Imigrants that come here with four wives and ten kids need to be kicked off welfare they cost tax payers a 100.000 dollars a year per family","commenter_a":"Cut her off.","post_message":"Debbie Merton lives off of government tax money. But it’s what she’s doing NOW that will make you want to punch a wall. Should this woman be cut off from the government?"},{"comment_id":"10154563644004087","commenter_b":"With the illegals being deported Shitlarys vote count drops","commenter_a":"Funny but if you libturds went to Mexico and tried to live and work there illegally you would end up in prison. Libturds want open borders for cheap votes, no matter how much it harms America. See: \"The Reason Trump Got Elected\" for further reference.","post_message":"The Congressional Hispanic Caucus is requesting a meeting with U.S. Immigration and Customs Enforcement after more than 300 undocumented immigrants were arrested in raids over a 48-hour time span."}]
