[{"comment_id":"1438922076159420","commenter_b":"Chill your butthurt bitches lol","commenter_a":"Are you kidding me? You people need to get a life!!!","post_message":"Was it inappropriate?"},{"comment_id":"799759520167266","commenter_b":"DONALD TRUMP IS NOT A RACIST HES HIRED ALL NATIONALITIES ALL OVER THE PLACES HE OWNS AND PAYED THEM GOOD AND WAS FAIR TO ALL OF THE PEOPLE WHO WORKED FOR HIM AND HE WILL DEFINITLY MAKE A GREAT PRESIDENT FOR US AMERICANS NO MATTER WHAT RACE THEY ARE ,WERE HILLARY COULD CARE LESS ABOUT US AMERICANS SHE JUST SAYS THINGS TO BLACKS OR WHITES OR ALL OTHER RACES TO GET VOTES JUST LOOK AT HER BACK ROUND AND WHAT DID HILLARY OR OBAMA DO WHILE THEY WERE IN THE WHITE HOUSE FOR US ABSOLUTELY NOTHING BUT BROKEN PROMISES AND THEY GOT RICHER WHILE WE GOT POORER","commenter_a":"HILLARY 2016...","post_message":"REPLAY: Donald Trump at a rally in Wilmington, Ohio."},{"comment_id":"10153460551006051","commenter_b":"It's nobody's damn business what she does with her home","commenter_a":"He should get out of this woman's property . However by all accounts it is not her home. She could rent it out, she could house a family . It doesn't seem right just to let the house sit there when so many are in need.","post_message":"This guy stole a 70-year-old woman’s home. On Wednesday, a judge decided whether he could keep it."},{"comment_id":"10154735667991756","commenter_b":"Hamas is a disaster, as is Israel's abuse of Palestinians. There are hookworms on two sides, sucking the life-blood out of two peoples.","commenter_a":"Not my monkey, not my circus. Let's keep our dicks tucked away for now.","post_message":"Of 1.9 million Gazans, 1.4 million need humanitarian aid, and the United Nations directly helps 1.1 million. Robert Piper, the U.N.'s humanitarian coordinator for the Palestinian territories is worried Israel's charges against the two aid workers could exacerbate a large aid funding shortage."},{"comment_id":"864879717035938","commenter_b":"Voter fraud will get her elected anyway","commenter_a":"I would like to ask, How many Hilrack supporters have been in the military or had someone they love in the military and how many believe in God. The drive behind the Hilrack campaign is to REMOVE GOD from this country and then she will remove the military. READ \"The battling boys of Bengazhi\" Thats their agenda!!! The aid she gave to them will be repeated with any and all protecters of America. Why do you think all the Clinton money is in Canada???","post_message":"She's done. Please help us spread this. America needs to see it. Do you think Hillary is not fit to be president?"},{"comment_id":"1239053882772316","commenter_b":"@username They are ALL connected. Mcain, Obama, Hellary, Bush. If you think it is the \"other party\" that is bad, then they have been successful at controling your mind. The Dem/Rep thin is a HOAX!! Stop blaming obama. He is terrible, but he is just a puppet! Cut the strings of the puppet masters. vote for the guy they hate! Trump!","commenter_a":"As did the decision to try to overthrow Syria by giving unlimited weapons to \"rebels\" of unknown origin.","post_message":"\"Obama's decision to pull the troops out of Iraq may have helped to create ISIS. As did the decision to disband Saddam's army. As did the decision to invade a country that had nothing to do with 9/11.\" -- Jon Stewart @webpagelink"},{"comment_id":"10153185123243984","commenter_b":"For all the rhetoric and obfuscation, will Gowdy, or anyone else, really have the stones to put this bitch in jail? Lord knows she and many others in this government belong there!","commenter_a":"Please... don't tease me.","post_message":"Trey Gowdy just hit Hillary Clinton with an attack that could end her presidential ambitions... Do you have Trey Gowdy's back?"}]
