[{"comment_id":"833696443343651","commenter_b":"What a sick statement, what a horrible woman!","commenter_a":"Hillary Clinton was awarded the Margaret Sanger award for her abortion stance.","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"917384355021286","commenter_b":"I would love to see Trump/Carson..... Trump because you can't push him around. carson because the man is just smart!","commenter_a":"How does a troll like Trump make America great. When he can't run a business without filing for bankruptcy. You get no I screwed it up and need a do over in politics. Just ask GW Bush. Anyone hear Trumps policy other than he's going to be great. I I don't think so. Let's call him the carnival barker and clown show that he is. And his supporters if you don't like government than don't participate. A vote for a angry clueless egotistical clown won't help America.","post_message":"Republican 2016 frontrunner Donald Trump is a stain on our country. Image by Occupy Democrats."},{"comment_id":"699124226887425","commenter_b":"Bitch","commenter_a":"Show me your certificate proving you are a qualified dietitian. No? Then leave our children's lunches alone.","post_message":"Michelle has sunk to a new low...[READ BELOW]"},{"comment_id":"613597282122381","commenter_b":"You don't see conservatives trying to preserve the right to vote? Of course they are. Why is it perfectly ok in your eyes that we have to prove ourselves to exercise our right to bear arms, but having to have an id to vote is racist? Mass shootings are still a rare occurrence in our country.","commenter_a":"When Obama's secret servicemen are the first to lay down their guns, and he doesn't get shot, I will believe \"gun control\" works.","post_message":"I support it. Do you? Occupy Democrats"},{"comment_id":"10153030669318961","commenter_b":"Yeah, sure pal.","commenter_a":"Mother Jones - HAHAHAHA. That's about as credible as Mother Goose, in other words - a fairy tale.","post_message":"If you have time to read an article today, make it this one on the true costs of gun violence"},{"comment_id":"1811896189089892","commenter_b":"Cause she was lying, and she knows we all know she is a liar!","commenter_a":"Wow.. a fair and unbiased job by Chris Wallace..finally!!...Trump didnt expose her as the lying criminal that she is as much as I hoped Hillary must have had an earpiece she was nodding yes through the whole debate...what a fake! Now lets listen to the corrupt media spin it left when its obvious Trump won.","post_message":"There was no doubt about it..."},{"comment_id":"1027678373922850","commenter_b":"Yes Michael, when an intruder breaks in your home, watch him rape your wife while you blow a whistle. Makes perfect sense. Smh Humans have the right to defend their home and family. I would rather rott in prison, than do nothing.","commenter_a":"Stupid brits. Lol","post_message":"Self-defense is now ILLEGAL in the #UK"}]
