[{"comment_id":"10154005218489749","commenter_b":"@username fool","commenter_a":"Galloway is a racist..anti-semite...he needs to be thrown out of any meeting of decent minds.","post_message":"\"This has ruined this evening, as far as I am concerned, it's disgusting,\" one angry attendee said."},{"comment_id":"1365265100160183","commenter_b":"Joseph, a woman gave birth to a shadow demon in (I think) season 2.","commenter_a":"Its time to give serious thought of graduating this show to the big screen. Follow the same playbook used by the James Bond.","post_message":"All good things must come to an end. Unfortunately, Game of Thrones is one of them."},{"comment_id":"10153464372430667","commenter_b":"Of COURSE you do, feminazi.","commenter_a":"Joe Biden didn't seem to give much credence to Anita Hill. Perhaps he could find a way to remove Clarence Thomas?","post_message":"Part of the pledge: To intervene in situations where consent has not or cannot be given."},{"comment_id":"10153446320724087","commenter_b":"I want a woman too, but not a liar, cheap, and a phony","commenter_a":"Fuck no to Hillary. Hell yeah to Feel the Bern!!","post_message":"“It’s imperative that you vote. I want you to vote for [Hillary Clinton]. It’s time for women to be seen as real equals,” soccer hero Abby Wambach said at an event for the Democratic front-runner. “That is one hell of a badass woman in my opinion.”"},{"comment_id":"1099154366818961","commenter_b":"Hypocrites and parasites all , get them all out now","commenter_a":"Kristian I don't know if you'll catch it","post_message":"#resigncameron demo live in London"},{"comment_id":"1390020544359635","commenter_b":"I would turn the hose on her and spray that STD filled flea bag off my property","commenter_a":"please knock on my door. we have lots of property and a back hoe","post_message":"I would rather ___________ than have Miley Cyrus knock on my door."},{"comment_id":"10155303364265603","commenter_b":"For exposing corruption and telling the truth...","commenter_a":"He should sue the pants off of Eric Holder.","post_message":"JUST IN: Ferguson Police Chief Tom Jackson resigns, effective March 19. Lt Col. Al Eickhoff will serve as acting chief as the City of Ferguson begins a nationwide search. We will carry the 5:30p press conference LIVE on-air and online. STORY: @webpagelink"}]
