[{"comment_id":"10157183746875725","commenter_b":"#TrumpTrain #Women4Trump #MakeAmericaGreatAgain #BuildTheWall #Vets4Trump","commenter_a":"I live in Australia. I would not want them here. But worse would be Trump. I feel sorry for you all. This will be an election of abstention I think. God Help America.","post_message":"It's clear: scandals and controversies follow the Clintons, who will say and do anything to win."},{"comment_id":"10153757247084753","commenter_b":"She needs to stay in prison!!!","commenter_a":"She has been in jail almost 50 years let her go to die a free woman for all you goodie 2 shoes some people deserve a second chance let he who is without sin cast the first stone","post_message":"In shocking news today, Charles Manson follower Leslie Van Houten could be getting out of prison after all this time. Us Magazine shared that Leslie has now been tentatively approved for parole effective today. She has actually been turned down 19 times in the past. Most people know her as the one who wrote the messages on the wall at the murder scene of married couple Leno and Rosemary LaBianca back in 1969. At this time, Leslie Van Houten has been recommended for parole. There is nothing... @webpagelink"},{"comment_id":"10153268969721336","commenter_b":"How stupid r parents...it is not that hard to put this on a tall shelf...what a bunch of dumbasses...","commenter_a":"Survival of the fittest.","post_message":"This year, U.S. poison centers have already logged an average of 31 exposures to laundry pods per day."},{"comment_id":"10152925468786680","commenter_b":"Love is no ones business but the two who found it's bliss.","commenter_a":"Well, you could always just ignore it. Our government seems to be doing that alot lately. Like DC ignoring the Heller case.","post_message":"“It seems like the oppressor is now taking on the mentality of the oppressed.”"},{"comment_id":"10156687877045725","commenter_b":"you are 100% illegal .","commenter_a":"Yeah you've hired illegal immigrants too","post_message":"I’m the only one on this stage who’s hired people. I’ve hired thousands of people! #GOPDebate"},{"comment_id":"10152814329771636","commenter_b":"The LibDems should have fought for a workable PR system when they had the opportunity.","commenter_a":"As much as I don't like the UKIP he is right","post_message":"'I now have to think seriously about my future life, and what I want to do'"},{"comment_id":"10154668593434062","commenter_b":"Yes, and the NFL approved it and promoted it. If you're going to boycott anything it should be NFL products.","commenter_a":"For those that are clueless or ignorant, she endorses and is promoting the black panther party, which is a racist militaristic organization whose motto is literally \"kill whitey\".","post_message":"Online opinions are intense."}]
