[{"comment_id":"1184927621535157","commenter_b":"Obama is an IDIOT! \"Yeah we have Muslim terrorist in this country so now take all the gun away from all the other CITIZENS!\" NO! IMPEACH THIS IDIOT!","commenter_a":"Now you watch yesterday's massacre was intentional. The went to Syria so guess what Obama you ass hole your climate control and gun control is bullshit. Prayers for the Families.","post_message":"Obama responds to the shooting by tightening gun control laws. This is unbelievable. Is Obama incompetent, or just intentionally trying to ruin America?"},{"comment_id":"1600332060187317","commenter_b":"she's a skank...","commenter_a":"Megyn seems to know that whether positive or negative, any publicity is good. Think about this Megyn, apologize to Trump and you'll be a headliner in all the major news outlets. .","post_message":"Megyn Kelly EXPOSED!!"},{"comment_id":"10153206057979312","commenter_b":"Yeah that's why global warming is such a bigger deal than millions of humans getting their head slashed. Good one! You know they will come over here and do the same!","commenter_a":"If the President comes out in favor of it they'll drop the idea like a hot rock.","post_message":"Under the proposed measure, Missouri residents would switch to daylight saving time in March 2017 and never turn their clocks back again. Good idea? Bad idea?"},{"comment_id":"524517941072119","commenter_b":"This is USA .Muslims can eat pork and go to hell.","commenter_a":"Yall think they are pissed now ????? we aint done with them yet, still gotta play Cowboys and Muslims and then those who are left get to play the part of the Mexican Army at our reenactment of the \":Battle of San Jacinto\" although this time we aint takin prisoners ... Remember the Alamo !!!!!!","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy. Let them be angry. This America and if you don't like it, get out. Do you agree that Muslims should assimilate or leave?"},{"comment_id":"10154848659386509","commenter_b":"Disney will think twice about hiring him now","commenter_a":"He deserves it and never should have left his wife for that homewrecker ! His children should appeal anything and everything this tramp wants.","post_message":"A Los Angeles judge has granted Amber Heard a temporary restraining order against husband Johnny Depp."},{"comment_id":"736146246538727","commenter_b":"Big girl had to run!","commenter_a":"It appears the fat lady gave the skinny lady a good beating. She shouldn't have touched her. She appeared to be shielding her head and face as she was pounced on. Then, she gets in her car, probably not thinking rasionaly and overwhelmed by the incident, she blacked out and just lost it. She definitely was not acting in her right mind. She felt shielded in her car and since she couldn't beat them all up, took it to a whole new level. Neither of their actions are justifiable but that big girl needs to be taught a lesson to never ever touch anyone or beat on anyone like that ever again. Clearly, fatso is from the ghetto and couldn't control herself.","post_message":"A parking lot brawl between two women over a parking spot quickly turned into a demolition derby. How could you explain this to your insurance company? // Courtesy: GrindFace TV FULL STORY: @webpagelink"},{"comment_id":"1509437802422806","commenter_b":"All you ladies with your agendas should probably put it to ACTUAL LEGITIMATE use and aim it where it belongs: at your incoming government. I for one, have never just gone around grabbing random pussy or publicly proclaimed that I wanna fuck my own offspring. Actions speak so much louder than your weak ass words. Pick the RIGHT battle, for once!","commenter_a":"Call me crazy, but this dudes most impressive moments happened in a wheelchair on a kids show. So...he's banging an old whore. Whoopity-Do! I don't get and never have gotten the hype. Lol","post_message":"Drake won 2016."}]
