[{"comment_id":"10152515657266717","commenter_b":"Not really applicable but you forgot \"love\" ;)","commenter_a":"Game, Set, Match. Give it up.","post_message":"Join our mailing list for a daily news recap: lgbtqn.at/mail Follow us on Twitter: lgbtqn.at/tw"},{"comment_id":"10154141594486509","commenter_b":"I can't stand Sanders grating voice and Hillary puts me to sleep O'Malley's obnoxious Thank God NCIS is on at 8.","commenter_a":"I wonder if @username will ambush Clinton, like FOX ambushed Trump.","post_message":"Classroom lecture vs. rock concert: Just how different are Bernie Sanders and Hillary Clinton campaign styles? #DemDebate @webpagelink"},{"comment_id":"10153313566903908","commenter_b":"Like the symbolism...but don't know about using it as a flag...we tend to fly flags when we want to differentiate our selfs from others...this differentiation leads to conflict and destruction...no flag","commenter_a":"I see that beautiful symbol as being interconnected and one. Almost reminds me of the flower of life or a lotus","post_message":"This could become the flag that is used to represent our planet as a whole when we travel to other worlds. It was designed to \"evoke the feeling of global community in people all over the world, reminding us that we all are connected and should take care of our home planet and each other.\" Sacred geometry, anyone?"},{"comment_id":"685842924908994","commenter_b":"@username and you are a millennial piece of shit who does not know his ass from a whole in the ground. You should be stepped on like the cockroach you are.","commenter_a":"FYI, George Soros, Move On and Black Lives Matter are responsible for all of the protests going on. These are NOT groups of people who suddenly decided to protest. Therefore, the is more Hillary BS. However, CNN and MSNBC are blaming Bernie and Stein supporters. These people are insane. I am so tired of this BS.","post_message":"Protesters targeted buildings owned by Trump – burning effigies, setting flags on fire and chanting: “Not my president.”"},{"comment_id":"10152478705626990","commenter_b":"I eat a lot of eggs too, but it's just about a dollar or less, so I don't really pay attention to the price increase.","commenter_a":"Eggs are one of the few inexpensive natural proteins ... I'm concerned that this is gonna hit poor families where it hurts the worst :/ just a thought","post_message":"EGG-SPENSIVE! A new California law mandating that hens get more room in their cages, means egg prices are likely to go up --> @webpagelink"},{"comment_id":"10153278870867217","commenter_b":"Some woman wear a hijab out of choice !","commenter_a":"With a Hijaab. . ? 1st education they need. . Is to get out of hijaab slavery m8, , Pls convey this to them","post_message":"\"We want to inspire young girls to stand up for their rights.\""},{"comment_id":"10153296674076323","commenter_b":"i can't deal with her","commenter_a":"@username thought you might find this interesting","post_message":"After Frida Kahlo died in 1954, her husband Diego Rivera shut her belongings in a bathroom at their Mexico City home – then demanded it be locked until 15 years after his death. In fact, the room wasn’t opened until 2004. See the full gallery of what was inside: @webpagelink"}]
