[{"comment_id":"1157169374320401","commenter_b":"I swear not EVERYTHING is racist just because you are offended by it. He isn't anti-immigrant..he is against ILLEGAL immigration and un-vetted refugees. Get the facts straight already","commenter_a":"Go to your safe space and shut up","post_message":"The phrase “is associated with the political campaign of a candidate widely known to voice anti-immigrant and bigoted views.”"},{"comment_id":"717585195090025","commenter_b":"With your logic, then what about all those moms bringing their little boys into women's locker rooms and bathrooms? They have penises and they don't belong there. Send them by themselves into a men's room and wish them good luck with the pedophiles who might be there.","commenter_a":"Just because it happens in YOUR family doesn't mean the whole of the rest of society must have their mores changed because YOUR bro/sis has identity issues. This is not and access issue. This is not and equality issue. This is a PERSONAL issue to approx 1.6 million adults and unless your bro/sis has had their genitals 'fixed' I don't want them wagging about in the locker room with my grand kids and great grands. After the 'fix' is in and they've chemically changed themselves to be more like what they think/want to be, I have less of an issue with it. mym","post_message":"Speaking out."},{"comment_id":"10153092001211037","commenter_b":"Divina there must be some way around this.God it would be a sin to put an animal down for no good reason ! Some Humans are the worse I tell you. Try talking with her when ever she has her bouts. I had one like that too and then again for heavens sake if it's not often then what is the problem she is a dog and that's what they do. Ugg I hope something else gives them reason to move faraway from you.","commenter_a":"Naomi get a pellet/ BB gun pump it 3 times hit that dog a couple time it won't bark anymore. It doesn't break the skin nor leave marks ( I know this for a fact) but will shut them up.","post_message":"A North Seattle woman faced a lawsuit from a neighbor alleging her dog Cawper’s barking was intentionally causing him “profound emotional distress.” The neighbor wound up winning $500,000 by default because she did not challenge his claim. Would you sue your neighbor over a disruptive pet?"},{"comment_id":"10153524671301323","commenter_b":"If they are dangerous, then stay away!","commenter_a":"So is crossing the street. Let's kill all the drivers.","post_message":"“Everybody thinks we’re cold-hearted killers and it’s not that ... Giraffes are very dangerous animals. They could hurt you seriously, very quickly.”"},{"comment_id":"10154471007837577","commenter_b":"They'll come here get a bunch of \"free stuff\", infest our country, infect our people, then go back to where they came from on vacation with all of the money they \"illegally\" obtained. Vile Criminals........Build that WALL!","commenter_a":"Say no to drugs TB","post_message":"Illegals With Drug-Resistant TB Allowed Into US Schools - @webpagelink/ Large amount of illegals entering US with diseases is alarming"},{"comment_id":"10153967226386756","commenter_b":"Don't they have strict gun control laws? The criminals don't follow these laws? Shocking!","commenter_a":"Here are the huge protests over this? Why is the black community not absolutely outraged by this?","post_message":"These stones are a handful of those youths killed in Chicago. Diane Latiker of Kids Off The Block, Inc. (KOB) is trying to keep more names of children off the wall."},{"comment_id":"10154682808296037","commenter_b":"@username. We don't need male genitalia to be smarter than you. Go run along and play, now.","commenter_a":"In his hand against his thigh. Plain as day. Please save and share for the ignorant.","post_message":"Charlotte police release body camera and dashboard videos of fatal shooting of Keith Lamont Scott."}]
