[{"comment_id":"813666455490598","commenter_b":"And she needs to dump her shit in the jungle","commenter_a":"I am so sick of reading about her ,she probably spent more money then all the first lady's in the last few years ,she thinks her shit don't stink now well I got news for her it does .","post_message":"What Michelle Obama Was Just Caught Doing With Her Daughters Will Make You FURIOUS She is the worst First Lady in history. Are you ready for the Obama family to be out the White House?"},{"comment_id":"1796967167212138","commenter_b":"What an idiot!!! Cher became a Chair!!!","commenter_a":"Scum of the earth. Crawl back into your hole.","post_message":"**Irony Alert**"},{"comment_id":"10154911182244714","commenter_b":"This lady is crazy","commenter_a":"Y'all just can't stop hating on a man that has the highest presidential approval rating since Reagan, can you? Higher, actually. If you can't say something nice, don't say anything at all.","post_message":"The First Family is heading west."},{"comment_id":"10152965938402232","commenter_b":"Your so right Geoffrey....why would she purchase a seat, in coach if she had no intention of using it?? So she could board the plane and hope she didnt get caught? That is not the time to have a disscussion about FCC rules!!! She should have a car seat with her....I hope the faa fines her for holding up the plane for over an hour..how many others passengers missed their connections.....just because she has a disability doesn't make her any more important then any other passenger. It seems like NO ONE today wants to follow rules...","commenter_a":"No one is mentioning the fact that they bought the child a seat in coach, and they were resting comfortably in first class. Essentially ignoring the child for the flight.","post_message":"The 3-year-old girl has a debilitating condition in which she is unable to move her arms and legs, or to hold her head up on her own, according to her mother who was holding her daughter on her lap when a flight attendant became \"visibly upset.\" @webpagelink"},{"comment_id":"1044042925655455","commenter_b":"Vote to leave the EU when you get the chance , Europe is lost","commenter_a":"Next a Muslim prime minister","post_message":"Sadiq Khan has been named as The Labour Party's candidate to replace Boris Johnson as Mayor of London"},{"comment_id":"10154031009040329","commenter_b":"I'm crying about all of this all over again!!!!!!!!!!","commenter_a":"Riley","post_message":"People keep telling you “it’s only a show,” but then why does your heart hurt so much?"},{"comment_id":"10153866620387869","commenter_b":"Leave, sissy boy.","commenter_a":"I like @username but I get the impression this is just a propaganda page. Guess I'm out of here.","post_message":""}]
