[{"comment_id":"10153297238001051","commenter_b":"YES","commenter_a":"Yup!","post_message":"The man who murdered a Kentucky police officer on Sunday night has been fatally shot. Do you consider this justice served?"},{"comment_id":"1050080195049016","commenter_b":"another dumb btch","commenter_a":"So Donald Trump you are not the savior we need for this country, I do not think you will bring jobs or prosperity when you do not even pay great wages for people that work for you. I think you are a disaster waiting to happen, you really belong in a reality series not president, I hope the people wake up before you end up our dictator","post_message":"ICYMI: Ivanka Trump took the stage in South Carolina and said, “My father is an incredibly hard worker and he’ll be working for each and every one of you.” (CC: Donald J. Trump, Sean Hannity)"},{"comment_id":"608860039265106","commenter_b":"@username Beautiful? NO!! She's SICK!!","commenter_a":"So real girls will have their dreams of becoming prom queen crushed because this school will more than likely give the award to a man in a dress just so the school can appear to be progressive.","post_message":"\"I'm not going to let anyone discourage me from being who I am.\" 18-year-old Dakota is one of four finalists running for prom queen her Portage, Indiana high school. The transgender teen is becoming an unlikely hero for some."},{"comment_id":"1764917753728484","commenter_b":"Not!!! When she decided to make \"her\" body a home to another human being it stopped being \"her\" body and it became \"their\" body. And as that other human being is incapable of making decisions for itself, that dumb cunt sucking poisons into \"their\" body should be jailed until the other human being is freed. Then the dumb cunt should be put in an air tight room and have the exhaust of a semi pumped into it.","commenter_a":"No,it's not her choice.Since it's obviously to late for an abortion,and she cant' control her substance abuse;she should be incarcerated until the birth of the child.The child should be then taken from her and given the best possible foster care. Hopefully the child is ok.In any case,she should be charged with child endangerment at the very least and remain incarcerated until she's no longer able to reproduce.They should also find the father of this child to find out if he is either complicit in this endangerment or is morally able to care for the child.","post_message":"What do you think? Join Us: The Free Thought Project"},{"comment_id":"10153331151986336","commenter_b":"Take her out Carly . We need a trustworthy Woman in the whitehouse.","commenter_a":"Thanks for sharing this I will be praying God will greatly use Carly .","post_message":"\"Hillary Clinton has demonstrated over and over again that she is not transparent. She will clearly be the [Democratic] nominee, and somebody must take the fight to her.” – Carly Fiorina"},{"comment_id":"762801500520430","commenter_b":"The poor girl just can't make up her mind, if you want to call it that.","commenter_a":"She is an idiot!! Just like most spoiled rich people!","post_message":"Hypocrisy, much?"},{"comment_id":"10154533170793984","commenter_b":"Yeah @username...she's a bully on FB. I'd like to see her ass face to face..I bet @username would be singing a different tune.....lmbo...I love when people grow FB balls....lmao","commenter_a":"The bad news is Trump running in the first place, the good news is he will never occupy the Oval Office.","post_message":"Donald J. Trump just sent a brutal message to all the cronies of Barack Obama hiding out in the federal government... he's about to clean house. It's about time someone did this..."}]
