[{"comment_id":"980167608741328","commenter_b":"Trump should just buy there piss ant country..","commenter_a":"So funny","post_message":"What do you think of the proposal to ban Donald J. Trump from entering Mexico?"},{"comment_id":"10156072867635389","commenter_b":"Ramos was rude but so was Trump.","commenter_a":"Trump of course","post_message":"Question of the Day: Who do you think won last night’s exchange: Jorge Ramos or Donald J. Trump?"},{"comment_id":"1065493480157790","commenter_b":"I hope he is right. We can live well without what Beck represents.","commenter_a":"lol Beck is always good for a laugh","post_message":"Glenn Beck's reaction to the fact that the Supreme Court upheld Obamacare was nothing short of amazing."},{"comment_id":"10153177294431336","commenter_b":"How can a female win the MENS race? Read much?","commenter_a":"That's a female???","post_message":"JUST IN: Lelisa Desisa has won the men's race at The Boston Marathon in an unofficial time of 2 hours, 9 minutes, 17 seconds. It's the second victory for the Ethiopian, who won the marathon in 2013 just hours before the attacks. @webpagelink"},{"comment_id":"10153915589591336","commenter_b":"Russian women are hawt !!!!","commenter_a":"Putin thinks Trump is great Could this mean that we could be friends again with Russia if Trump wins? I think so","post_message":"Donald J. Trump has plenty of admirers, and you can apparently count Russian President Vladimir Putin among them."},{"comment_id":"10153945154891323","commenter_b":"Naser E. Kandjani many nations in Asia and Europe and Africa have million Muslims without conquests or wars and they were just spread by talking through Muslim merchants and travellers in these countries..you can read how Islam spread in east Africa and many Asian countries especially China Indonesia phillipines Malaysia ...all these countries have Muslims though no wars or conquests arrived there ...most Muslim nations today became Muslims without wars","commenter_a":"Anti-islam movements in Europe are treated as any political group and not called terrorist organizations ...What if there were anti Christian organization in any European country ..how will u react to it? Your double standards created extremisim in the whole world...","post_message":"'Islam has failed': Former EDL leader Tommy Robinson brings Pegida to the UK. Tommy Robinson stepped down as leader of the far right English Defence League in 2013. Alongside two former Ukip candidates, he is now setting up the UK arm of Pegida, the pan-European anti-Islam movement. Film-maker Simon Winkler joins Robinson as he prepares for Pegida’s first march in the UK."},{"comment_id":"1656739891212938","commenter_b":"JJ Fuller Jeffrey Kalmonson Jojo Stewart","commenter_a":"Those who are caught in the left/right paradigm are often not ready for critical thought and the unforgiving truth. If you agree please comment (even 2 words) and share! (y)","post_message":"Free minds, free people.. this world needs more of them Follow: The Free Thought Project.com #B2TF"}]
