[{"comment_id":"1787141981532253","commenter_b":"COME ON! Lock this \"thing\" up already!!! People have spent major time in prison doing FAR LESS than she has.","commenter_a":"It honestly doesn't matter to voters or our govt how bad she was and what she did or if she is a criminal. They just don't want Trump so they will be so stupid and vote for her. She is going to win and it will be game over for our nation and sovereignty.","post_message":""},{"comment_id":"1108096825935519","commenter_b":"Lol...dumbass","commenter_a":"Funny.","post_message":"Anybody who holds up a cop car at gunpoint isn't the brightest person in the world. This thug, however, was especially dumb... he didn't see what was behind him. This ended REALLY badly... and it was all caught on video."},{"comment_id":"10152704207984135","commenter_b":"Don't tell me how to live my life, bitch!","commenter_a":"And now on this part of our safari, we see on our right a fat Rino. The gazelle on it's left hasn't to worry, for Rinos are herbivore. This particular Rino, unfortunately, is an omnivore. Watch out, Laura!","post_message":"w/ Laura Ingraham at #CPAC2015"},{"comment_id":"10154047067166756","commenter_b":"I hope you didn't watch the trailer. Lol","commenter_a":"WARNING:This article gives out way to much information.","post_message":"Leonardo DiCaprio was part of a cast that didn't have to fake being freezing or exhausted during the eight winter months spent in the Canadian and Argentine wilderness. Still, all anyone wants to talk about is the bear attack, says NPR film critic Bob Mondello."},{"comment_id":"10154369959116509","commenter_b":"Trump will eat her alive!","commenter_a":"So ... u think u luv Hilary Clinton .... u like Hillary Clinton .. u want to vote for Hillary Clinton ... u r impressed how the liberal media only shows u her smiles ... well.... here is some of her smiles ... enjoy ... @webpagelink","post_message":"Former Rep. Gabby Giffords and her husband Mark Kelly endorse Hillary Clinton on Sunday, she is the only \"candidate for president that has the determination and toughness to stand up to the corporate gun lobby -- and the record to prove it.\""},{"comment_id":"10158220719125203","commenter_b":"Obama allowed illegals to move here, not President Trump. Obama told illegals to vote, not President Trump. During his campaign, President Trump said he was going to build the Wall, and deport illegal immigrants. They were warned. President Trump is not to blame when these criminals are arrested.","commenter_a":"Throw her ass back to Mexico","post_message":"WHOSE fault is this!? ===>"},{"comment_id":"10153701497529740","commenter_b":"Ben what is the answer. I'm sure more violence isn't but then what. Flowers, prayer, a handshake. These people, I use that term loosely, are predators. How do you stop a predator? You can try and take the source of the problem. Drugs for the money and high. Its a start. Not as easy as you might think.","commenter_a":"Tell the felon to STFU. Chicago is out of control. Most of us are not in that city's position. You can't control a city like that unless you show aggressive behavior and make these criminals know you mean business. This might not work in most places but Chicago is falling apart.","post_message":"The highly awarded Cmdr. Glenn Evans who has thrown himself in front of bullets to save fellow officers is now under scrutiny for same aggressive tactics that he's been praised for."}]
