[{"comment_id":"10153222292274877","commenter_b":"She is a woman. End of story.","commenter_a":"Ok this is the dumbest post I've seen by you guys. Trans woman? correct yourself its a trans man and will never be a woman.","post_message":"Body of 25-year-old trans woman found beaten to death in park. She was studying to be a cosmetologist. Get the full details of what happened below. Grio fam, let's keep the victim's family in our thoughts/prayers."},{"comment_id":"10155037130139369","commenter_b":"Sucker","commenter_a":"I'm 51 now and have paid into social security since my first job at 15 years old. I want MY money! Let them try and take our money. They'll have a revolution on their hands!","post_message":"That's $32,000,000,000,000."},{"comment_id":"10152873861987434","commenter_b":"Shit for brains","commenter_a":"Since when did weed start smelling like fish?","post_message":"After pulling Charnesia Corley over for running a stop sign, two Houston deputies held her legs apart and forcibly administered a body cavity search in public—all because her arresting officer suspected she had weed."},{"comment_id":"626305930908697","commenter_b":"@username Yeah, those toddlers with guns are out of control right now.","commenter_a":"I blame Obama and Bush, Bill and Bush snr for forever labeling all Muslims as terrorists . they didnt know that by doing so they created further hate for Muslims in america and this is the result","post_message":"Kim Kardashian West made her opinion known (via Daily Mail Celebrity)"},{"comment_id":"10153044064759456","commenter_b":"That is exactly the thought that went through my head!","commenter_a":"Yet this A**hole gets a $500,000 bond.....whew this judicial system!","post_message":"A Montgomery man is being held on a $1.25 million bond after being arrested for allegedly trafficking methamphetamine. @webpagelink"},{"comment_id":"10153725146380667","commenter_b":"no one cares I'm tired of heading about him","commenter_a":"People get punched in the face everyday.","post_message":"“He said he was going to kill me.\""},{"comment_id":"10154403443803338","commenter_b":"Stupid bitch , be serious","commenter_a":"Let me guess....they were ALL shot by white police officers.....","post_message":"Eight kids under age 10 shot in past 28 days, according to CPD."}]
