[{"comment_id":"1118389778239557","commenter_b":"The question is, \"Is there a discernible difference between \"Radical Muslims\", and Muslims?\" When people close their eyes, get on their magic carpets five time a day and pray to Mecca, it is clear that Islam is the most important thing in their existence. Far above Nationalism, for the country they are in. For our own security, we must stop Muslims from entering this country. In addition, existing Muslims here should be asked and paid handsomely to leave. Finally we should ban all business dealings with Muslims and abandon the Middle East.","commenter_a":"Non't kid yourself islam is all radical at the core.","post_message":"This guy is EXACTLY right about radical Islam. Let's share this everywhere, because you know the media never will."},{"comment_id":"10154151758449087","commenter_b":"@username Oh, please. Where are the arrests, the charges, the trials? Where are they? When did they happen? Where are the files? The proof? And here's the thing: Bill Clinton is NOT running for president. Whatever did or did not happen in the past is a \"he said, she said\" situation at this point. Or really a \"she said\" situation, and sadly, a LOT of women go after powerful men, married men, etc., and then cry \"rape\" when they don't get what they want. And I say that as a woman who would f**king kill a man who raped me. And once again, Bill Clinton is NOT running for POTUS. Donald Trump is a low-class disgusting creature who should NOT represent this great nation on the world stage.","commenter_a":"Let me know when Trump does something as bad as LEAVE 4 AMERICANS TO DIE..then you will hear my outrage..but you won't hear it over some locker room crap that Trump said.. Toughen up cupcakes..","post_message":"#BREAKING: Mike Pence was reportedly \"beside himself\" after hearing Trump's obscene remarks about women, and Pence's wife was \"furious.\""},{"comment_id":"1172100076163796","commenter_b":"Tape the bitches mouth shut and repeatedly butt fuck her","commenter_a":"Cruelty to animals is not OK.","post_message":"The internet is calling for blood after a woman posted a photo of her dog with its mouth duct-taped shut."},{"comment_id":"1128341107201309","commenter_b":"Hillary is a very evil woman.She will do anything for power.","commenter_a":"I would love to see a truly in depth report regarding The Clinton Foundation. I do believe if the truth was revealed about the Clinton's and their corruption that surely more people would not vote for Hillary Clinton.","post_message":"FINALLY!!!"},{"comment_id":"791521404314373","commenter_b":"ENOUGH FREAK SHOW BULLSHIT IF YOU HAVE A COCK YOU USE THE MEN'S ROOM","commenter_a":"That's the Republicans in a nutshell lol. Poverty??? Jobs?? Helping the Poor and Veterans??? FUCK NO!!! we don't have time to do that we have to make Bathroom rules lol","post_message":"Oh no....last time I posted on something like this I hate Liberal hate mail for about a month. So what's your thought on this?"},{"comment_id":"464432047077736","commenter_b":"Bye, Felicia....go to that other planet where NOTHING will be different. ...the More of you we get rid of here, the sooner We can straighten the SHIT YOU CAUSED out","commenter_a":"Secondhand rocket for hire. Use at own risk.","post_message":"Elon Musk called the rocket landing \"absolutely perfect.\""},{"comment_id":"10153270898427217","commenter_b":"Wife is an idiot to allow this! Publicity stunt completely!","commenter_a":"Great job, idiot parents. Way to teach your kids how to be sexist, abusive morons early in life.","post_message":"🎄🎄 Funny or offensive? 🎄🎄"}]
