[{"comment_id":"10153816896676337","commenter_b":"\"Bitch! Now turn the other cheek!\"","commenter_a":"Jesus needs to come back and give this Pastor a firm pimp hand.","post_message":"The Pastor leading the Starbucks red-cup charge got disconnected and laughed at on TV..."},{"comment_id":"10153630301063132","commenter_b":"Did they ever catch those fucktards??","commenter_a":"God Bless her and her family!","post_message":"\"I can't understand why they would want the thrill of hurting me like this, hurting my entire family.\""},{"comment_id":"577283422434663","commenter_b":"Sandra Skolnik THE HILLARY VOTER ARE ,MUSLUMS ,ILEGAL IMAGRANTS, PEOPLE LIVINg in other countrIES silly woman that dont follow other candadits SO HOW DO THEY REALLY KNOW WHAT IS GOING THE WOMAN NEEDS TO BE INCITED SOON","commenter_a":"I'm starting to #FeelTheBern! Bernie Sanders has been consistent with his message throughout his career from climate change to #LGBT rights. @username not only voted in favor of the Iraq war but she also played a large role destabalizing the Middle East in Libya and Syria as Secretary of State. I hope New York, California, Pennsylvania and the remaining states get out and vote for Bernie Sanders before the FBI indicts @username over her mishandling top secret information on her private server. We need honest leadership not warmongers who destroy entire nations with irresponsible policies. Vote for peace! #FeelTheBern #BernieSanders2016","post_message":"It's understandable that Americans are angry. But instead of inciting violence, we should talk about how we’re going to address the challenges we have."},{"comment_id":"10154376259328797","commenter_b":"Trust and believe it's lot more white women chasing black men. Even the ones that fool you into thinking they don't. What I see in the backroom of my job is hilarious! Then they go home and kiss their racist white husbands and little bundles of joy. lol","commenter_a":"A group of disgusting tramps that will suck a black man dry.","post_message":"OFFENSIVE PHOTO: A school district is taking disciplinary action after a photo of students spelling out a racial slur with T-shirts showed up on social media."},{"comment_id":"1713956375559891","commenter_b":"I think ladies should have control over their bodies but what if your mama aborted you","commenter_a":"Bravo Guttier","post_message":"This is AMAZING. The ending is the best part. Share if you agree with Congressman Luis V. Gutierrez and give his page a LIKE! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152844274493525","commenter_b":"Burn the witch!!!!!!!","commenter_a":"good....now put him to sleep!","post_message":"The 30 verdicts for Dzhokhar Tsarnaev in the Boston Marathon bombings trial are as follows: Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty. Guilty."},{"comment_id":"1088448164564744","commenter_b":"MOB VIOLENCE - MUSHY FRAUDULENT L A C K OF LEADERSHIP. VOTE THEM OUT OUT OUT !!!!!!","commenter_a":"Is this what we call, \"Today's Leaders?\"","post_message":"This guy is nuts!"}]
