[{"comment_id":"934017173381331","commenter_b":"You keep having your exercise interrupted by having to go pee. There I said it","commenter_a":"Duh, coffee is a powerful drug, of course things feel better when yer buzzed","post_message":""},{"comment_id":"10153114544546943","commenter_b":"Charge her with something!","commenter_a":"Hilliary has blood of our soldiers on her hands","post_message":" Obama administration including Hillary Clinton and Susan Rice knew immediately that the Benghazi attack was a terrorist attack. The State Department new smoking gun documents put to rest any question about what Hillary Clinton and Susan Rice knew and when they knew it, said Judicial Watch President Tom Fitton. minutes of the attack, the administration, specifically Hillary Clinton, began lying to the American people by blaming an obscure Internet video. No wonder Hillary Clinton is the great destroyer of State Department emails. One can assume that Mrs. Clinton would not have stolen and destroyed emails in violation of law and various court orders if she didn have something to hide. And it shouldn take a federal court order to find out that Hillary Clinton evidently had no clue how the State Department and the FBI responded to terrorist attacks on State Department personnel."},{"comment_id":"871246712910789","commenter_b":"The face of an ugly, pathetic bitch.","commenter_a":"I would never have breast fed my daughter in public. A woman can go to the ladies room or bring a bottle with her when she's out. I think it's distasteful to breastfeed in public.","post_message":"\"I was almost in tears and creating my own wet t-shirt contest by the time I could pump again.\""},{"comment_id":"10152901034836636","commenter_b":"Karina a poopoo head","commenter_a":"Great! Don't terrorize kids! Be the adult. Do your job and treat everyone equally. Don't only attack the black kids.","post_message":"This just in: That Texas officer videotaped outside an pool party has reportedly stepped down from the police force."},{"comment_id":"323815704455468","commenter_b":"That's why we need someone who isn't a fool. Lindsey, go home, the adults need to take over.","commenter_a":"He should go home...he's really dumb","post_message":"Lindsey Graham needs to _______________."},{"comment_id":"10157076515550354","commenter_b":"Agree . No one uglier or nasty except her daughter !","commenter_a":"Where's my $$$? Ohhhh...she wants online trolls who will say something good about her....my mistake...","post_message":"SURPRISE!"},{"comment_id":"1738890906325401","commenter_b":"Why no handcuffs? If i break the law and admit to it I'm no longer culpable? This should be challenged in every courtroom.","commenter_a":"California's Latino population is out of control. There are more Hispanics in California than there are people in 46 other states. 30% of all LEGAL immigrants come from Mexico. It's not \"diversity\" taking over, its misogynistic Hispanic rape culture being dumped on this country, and the democrats don't care how many little girls are raped & murdured and beaten & beheaded and sold into slavery & prostitution as long as they get millions of new voters. The age of consent for sex in Mexico is 12. In their culture it's ok to have sex with children. Not only that, these people are putting themselves in enormous risk, dying in the desert, and then we pay for them when they get here. It's madness! The majority of legal(51%)and illegal(72%) immigrants are on welfare according to the center for immigration studies. The number of immigrants on welfare should be 0! New report ...","post_message":"Note the swipe she took at Donald Trump..."}]
