[{"comment_id":"10153985207391680","commenter_b":"The Deplorables, The Unredeamables won the election tonight. The Media, Hollywood, Academia, Celebrities and the Elected Officials on both sides that have tainted and divided our country with their slanted, elitist opinions have finally been put in their place. This election was never about Donald Trump, it was about the people. Not the people the media falsely reported about and stereotyped. I was at two Trump rallies, these people were black, white, Hispanic, all ages and all races. People who love our country, love our constitution and the principles within it, love God and love and respect all Americans. The silent majority who we're sick and tired of being falsely portrayed as the intolerant ones, being intimidated, called names and told by an arrogant and grossly out of control government and out of touch minority what we were supposed to think, say and do. #WeThePeople #IndependenceDay2016","commenter_a":"This is about Obama, the establishment and MSM picking Clinton over Bernie. Congrats imbecils.","post_message":"Barack Obama's legacy lost on Tuesday night."},{"comment_id":"10155254752442908","commenter_b":"@username Is that right? My life is in order. I am a home owner. I have had the same employer since 1994. I have never been on food stamps or welfare. I never take a vacation. If I do take time off, it is to do chores that has built up around the house. My wife (which also has a job and the same employer for 5 years) and I had 2 children, and raised them to be hard workers. Both my daughter and son in law to be have jobs. My daughter has two jobs. They are not planning on having children until they actually have their life started, and a place to call their own. They both have their own vehicles. Ones they have worked for and were not just given. Compare that to your life. Let me know... Then we can see who has spent their life ...","commenter_a":"Funny how some of these people are using the term 'greedy' to describe the rich, only to say that THEY want more money...face-palm.","post_message":"A few years ago, a $15 minimum wage was considered too radical. But when people see the justice of an idea, it catches fire very quickly."},{"comment_id":"1837044486583115","commenter_b":"Build the wall already and send her back","commenter_a":"this is funny , only because these two willfully ignorant","post_message":"Leftists Attack - Man Harassed For Wearing #BuildTheWall T-shirt SHARE if you WANT TRUMP To Build the WALL! WARNING: Strong Language!"},{"comment_id":"10153396293173525","commenter_b":"@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been \"taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns. STORY: @webpagelink"},{"comment_id":"710565325800712","commenter_b":"Get out","commenter_a":"Just what? About this woman isn't alarming?","post_message":"Muslim picks fight with patriotic cashier, and then this happened. If you don't like our country's flag, you don't have to live here. Can we get 75,000 'LIKES' for this patriot?"},{"comment_id":"894582770641419","commenter_b":"Ship her out","commenter_a":"There is a special place in HELL for Rosie O'Donnell. It seems to me she is living her hell on earth her life has gone so well. Can you remember a movie? TV Show oh the view, did she get canned. What ever happened to that talk show. If I remember correctly she had problems with her own kids. I think they just didn't want anything to do with her. Go get back underneath your rock Rosie!","post_message":""},{"comment_id":"10153916819542426","commenter_b":"How about what Democrat Bill Clinton did for the black people? And how about Hillary supporting his bill and explaining that black people are \"super predators\"? Now we have a problem with unemployment. People are fighting for jobs, and Obama and Clinton want to allow THOUSANDS of immigants in our country to expand the fight over jobs. Illegal Mexicans are being hired before you or I because they are cheaper. Democrats have done none of you any favors.","commenter_a":"Truth. What gets me is that the Dems get elected in these cities then the voters blame Republicans for holding them back. How can someone you did not elect to run your city have any power to hold you back?","post_message":"\"You're living in poverty, your schools are no good, 58% of your youth are unemployed -- what the hell do you have to lose?\""}]
