[{"comment_id":"10153985207391680","commenter_b":"The Deplorables, The Unredeamables won the election tonight. The Media, Hollywood, Academia, Celebrities and the Elected Officials on both sides that have tainted and divided our country with their slanted, elitist opinions have finally been put in their place. This election was never about Donald Trump, it was about the people. Not the people the media falsely reported about and stereotyped. I was at two Trump rallies, these people were black, white, Hispanic, all ages and all races. People who love our country, love our constitution and the principles within it, love God and love and respect all Americans. The silent majority who we're sick and tired of being falsely portrayed as the intolerant ones, being intimidated, called names and told by an arrogant and grossly out of control government and out of touch minority what we were supposed to think, say and do. #WeThePeople #IndependenceDay2016","commenter_a":"This is about Obama, the establishment and MSM picking Clinton over Bernie. Congrats imbecils.","post_message":"Barack Obama's legacy lost on Tuesday night."},{"comment_id":"633419350152037","commenter_b":"Bye, don't come back","commenter_a":"His gravy train parliamentary salary wasn't enough he must have found another income that was better for less hours","post_message":"What's next for David Cameron?"},{"comment_id":"10153136894823145","commenter_b":"Bottom line do what the officer says and don't talk back. The girl kept running her mouth to him. My child would have got in trouble by me for talking back the way she was.","commenter_a":"The only good cop is a dead cop","post_message":"Here's 5 things to know about the Texas officer seen on a viral video breaking up a disturbance at a pool party. #WFTV Watch the video here: @webpagelink"},{"comment_id":"10156550543770389","commenter_b":"Tonya I thought you were referring to refugees especially Syrian ones. My mistake. Sanctuary cities are liberal ridiculousness and need to stop. I don't agree with them at all. I see what you mean about a major delay.","commenter_a":"I am amazed at how Christians can look at Trump and Cruz and not see that Cruz is clearly the choice for POTUS. 'By their fruits you will know them', Matt. 7:16. Very disappointed with Sara Palin and Rev. Falwell; they should know better.","post_message":"Question of the Day: Which Republican do you think will be the best candidate for evangelicals?"},{"comment_id":"2109805452578927","commenter_b":"Leave her alone!!","commenter_a":"Rosa","post_message":"World-renowned statistician Stevie Nicks declares a Hillary \"landslide.\" The mathematician also adds: \"Just like the white winged dove...Sings a song...Sounds like she's singing...Ooh ooh ooh.\""},{"comment_id":"10153371491386336","commenter_b":"Not American and horrible woman","commenter_a":"Mother Teresa.","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"10154713601071336","commenter_b":"For the tape no more no less!","commenter_a":"The sexual assault was words - big deal.","post_message":"Donald J. Trump says accusations of sexual assault may have been started by Hillary Clinton's campaign: \"I didn't even apologize to my wife...because I didn't do anything.\" #Debates2016 #FoxNews2016"}]
