[{"comment_id":"1339369766115783","commenter_b":"There are so many other places to shop.A woman`s dignity is valuable to her self esteem.","commenter_a":"I still think this is another part of Obama's plan to cause unrest and confusion so he can carry on the New World Order Plan. Wake up folks the end is almost here.","post_message":"@webpagelink"},{"comment_id":"10153751890519411","commenter_b":"Fuck Israel baby killers.","commenter_a":"The alleged tens of thousands of “rockets” from Gaza killed how many Israelis so far? How many? Palestine has a legal right of self-defense whether Israel likes it or not. Saying that Israel is a victim is like saying that Hitler acted in self defense. Israel has no more right to Palestine than the Nazis had over Austria, Hungary, Poland, etc... In 2000, 57 Arab and Islamic countries offered full diplomatic recognition of Israel if they returned to 1967 borders. Israel never acknowledged this offer. Israel kills in the name of self defense. US kills in the name of democracy. When they fight back they are called terrorists. When it is said to them: \"Make not mischief on the earth,\" they say: \"We are only peacemakers.\" [Quran 2:11] Isn't this the case today... in the name of Freedom and Democracy! Law of current world Muslims = Guilty (until proven innocent) ...","post_message":"She died of multiple wounds in a hospital after bleeding in the street for 30 minutes."},{"comment_id":"10153647518861350","commenter_b":"This is 100% a mental illness! We would never approve of someone cutting their right hand off b/c they decided they had to be a lefty. So why in the world are we letting these people mutilate themselves?!! It's not about sex it's about the brain. They need help!","commenter_a":"The man with the sign in the background has the heart of the issue correct: girls' rights matter! No way would I want a confused young man using the same bathroom at school as my daughter. These young men and women need help. I have compassion for them because they are confused. Steer them towards counseling and mental health treatment. Caitlyn Jenner isn't a hero. I don't buy the \"if it saves one life\" act. The fact is the majority of suicides in transgenders occur AFTER they've made the devastating and disastrous choice to destroy their own bodies as God created them. They need treatment BEFORE they get to that point, not someone telling them they're fine as a woman when they were born a man or vice versa!","post_message":"\"I'm not the only transgender person at my school, and I won't be the last.\""},{"comment_id":"10153043534789614","commenter_b":"Girl do your thang....U have a beautiful heart and it shows. WOOp","commenter_a":"You know wat, the only reason those guys said those thing is cause the DICKS are to small to please a big beautiful woman. If u agree give me a HELL YEAHHHH!!!!","post_message":"When Kristen Layne decided to sell her junior prom dress on Facebook, she had no idea that some people would respond by criticizing her weight and looks. \"These two men were just saying some very hateful things, just telling me I was fat and that I wasn't beautiful,\" she said. It wasn't long, however, before a number of commenters rallied to the Tennessee teenager's defense. One person posted: \"It's obvious this woman is beautiful, inside and out.\" Another wrote that the dress \"looks absolutely stunning.\" Layne had originally tried selling the gown for $350, but supporters have now raised more than $2,700 to help her buy a new dress for her senior prom. Read KTLA's story here: @webpagelink"},{"comment_id":"794052647345901","commenter_b":"LOL! Laughing mostly because I have a few friends like this guy...","commenter_a":"I believe it's called the \"pass the buck\" syndrome? Pity","post_message":"Image from Of the People, By the People, For the People"},{"comment_id":"881915648510562","commenter_b":"Bitch you wanna get arrested????","commenter_a":"@username we talked about this as well","post_message":"The dark history of why cocaine is illegal... (ATTN: is excited to launch a new series about the history of illegal drugs)."},{"comment_id":"10152777493386130","commenter_b":"Ya. Clearly, women want nothing more than to \"trap\" some real prize catches around here. Give me a break.","commenter_a":"this is great. Now men are less likely to be victims of the tramps who lie about birth control and crazy GFs who try to lock their men in.","post_message":"We're looking at you, gentlemen."}]
