[{"comment_id":"10153502199714087","commenter_b":"If I had any faith in Clinton. Sure. But I don't. So....","commenter_a":"My dream is that Bernie Sanders agrees to run as Hillary Clinton's vice president on the condition that Elizabeth Warren be appointed Secretary of the Treasury and Bernie gets to focus on one main goal: voter turnout! Bernie can build the revolution he's been talking about by getting everyone more involved and then we can pick up some democratic seats this year and take back congress in 2018 with progressive candidates. Bernie's task would be non-partisan voter turnout and involvement supported by a strong democratic machine finding good candidates in local state governments and for congress. This is a long term plan, one that ultimately paves the way for President Warren. Bernie wouldn't get to be president but he would give us a good 16 year trajectory to push progressive policies. Wouldn't that be lovely?","post_message":"“In the last election, the mid-term election, 80 percent of young people didn’t vote,” Bernie Sanders said.“I’m very proud we’re bringing a whole lot of young people into the political process [and] that we’re revitalizing democracy. If we’re going to change America, that’s what we’ve got to do.”"},{"comment_id":"941873945853078","commenter_b":"Stop asking this lady to run. She has an agenda allow her to work it with your support.","commenter_a":"Right on","post_message":"THIS Is why we want Elizabeth Warren to run In 2016!"},{"comment_id":"10152977390881130","commenter_b":"#fatgirlwasted","commenter_a":"@username YASSSSSS!","post_message":"Stoners, rejoice!"},{"comment_id":"10154077625056509","commenter_b":"Keep them out of America !","commenter_a":"Help thousands of Syrian kids and families! Take 30 seconds to sign (and hopefully share) this petition asking the US government to take in 65,000 Syrian refugees.We are almost there...we need your human support! Germany is expected to accept 800,000 refugees this year, while the US has accepted less than 1,500 thus far. Let's do a small part to encourage the U.S. government to be socially responsible. This is a humanitarian crisis and the Syrian refugees have nowhere to go. You can sign no matter where you are from. @webpagelink","post_message":"A call for Dr. Ben Carson to drop out: @webpagelink"},{"comment_id":"10154798019399062","commenter_b":"Russia has been the most proactive but we condemn their actions.... lol","commenter_a":"I wonder how long the leaders of the free world are going to tolerate this without taking the fight to ISIS directly and wiping them out! The scumbags need annihilating!","post_message":"BREAKING: Islamic State group claims responsibility for Brussels attacks, Associated Press reports. READ MORE -> @webpagelink"},{"comment_id":"675517259277271","commenter_b":"And now you know .......the rest of the story","commenter_a":"Good questions","post_message":"Hear, hear!"},{"comment_id":"10152957985436316","commenter_b":"Ignorant bitch. Talk about crime? I haven't heard of an illegal immigrant shooting up an elementary school or a movie theater. Americans are using drugs that's why drugs are trafficked here. Can you read a sociology book and gain better insight into social issues than base your opinions on ignorance?","commenter_a":"and all the anchor babies..they pop out 5 or 6 kids and they have welfare for life, the low life dads beg to stay because his child is \"american citizen\" .. so 1 breeder, 6 kids, 6 dads> IS 14 ILLEGALS ON WELFARE< running drugs, chop shops, gangs...all of this in a 1 bedroom apt in a apt complex that has 500 units... Now much money is being sent down a rat hole????","post_message":"The number of illegal aliens residing and working in the United States now outnumbers Americans who are unemployed and looking for a job, an issue that is certain to be a priority for tens of millions of voters in the 2016 presidential election: @webpagelink"}]
