[{"comment_id":"10153119305979641","commenter_b":"Of course she did. She's corrupt as Hell. Let's elect her president.","commenter_a":"Good for her.","post_message":"Hillary Clinton deleted all emails from her personal server used for official secretary of state business, a Republican lawmaker says. @webpagelink"},{"comment_id":"960454674002831","commenter_b":"I agree and anyone with a brain knew what the little guy was doing. Your business and the buck stops at the top. But Rubio wouldn't know about a business or for that matter what it's like to take a job and show up to work! Only be a puppet whipping boy for the old lifetime old farts on the hill. Look on line about Rubio and pulling strings to help his drug dealing brother in law? Check it out! This is the jurk running for the top office? Or any office! What a joke and a choker! Did I get it right little man that sweets like a pig?","commenter_a":"The true story... Trump did not know the Sub contractor hired the polish workers but settled it anyway and took responsibility even though it was not his doing.. Rubio and Cruz are the con-artists and the liars. Typical politician bull-crap. @webpagelink","post_message":"MARCO-BOT is back!"},{"comment_id":"481193578737889","commenter_b":"After the shit she did she should be quiet people that live in glass houses should not through stones!!!!!","commenter_a":"A great concept and certainly worth attempting. We pray for success and abolishing obamas illegal actions.","post_message":"Sarah Palin is starting a revolution... and Obama's first to go. She's leading the 50 states and we’re right behind her. Do you support Sarah Palin?"},{"comment_id":"1140463419377942","commenter_b":"Oh a gold dress, is that all? I thought maybe her penis was showing through her dress! Ha!","commenter_a":"For what she spent on that dress they could let all of the Afghanistan veterans keep the Enlistment bonuses they received 10 years ago instead of charging them $650 each a month until the entire $10,000 plus interest is paid back!","post_message":"It was Michelle Obama's final state dinner, and the first lady was trying to make a good impression. However, people noticed something wrong with her dress in a big way... now, it's making news everywhere. This is sick... it shows you who the Obama's REALLY are."},{"comment_id":"993063080750221","commenter_b":"Biden's coming in! you lose, Hillary.","commenter_a":"backwards is thinking that butchering a live baby in the womb is ok to do.","post_message":"In this week's Facebook Q&A, Hillary took on Jeb’s claim that Democrats use \"free stuff\" to appeal to minorities."},{"comment_id":"10154473701808812","commenter_b":"Good for her! This is the American Dream at its finest. All you haters who think this country belongs to you and all immigrants are criminals and steal your jobs can suck it! I was born here and will die for my country if necessary and this is what I will fight for. The right for EVERYONE to pursue life, liberty, and happiness. God bless you little girl!","commenter_a":"This is amazing.","post_message":"Texas high school valedictorian reveals secret in graduation speech: \"I am one of the 11 million undocumented immigrants living in the shadows of the United States.\" @webpagelink"},{"comment_id":"10153761760496179","commenter_b":"Olivia Gregg 😅😭😂","commenter_a":"Anna Margaret","post_message":""}]
