[{"comment_id":"1246473882081393","commenter_b":"TURN THEM LOOSE AN PAY THEM TO KILL AMERICANS !!!!","commenter_a":"Go figure that thank you Mr. Obama and miss Killory you guys are doing America so good","post_message":"REVEALED! Minnesota Mall Attacker ID'd As One Of Hillary's Somali Muslim Refugees!"},{"comment_id":"10154308587221323","commenter_b":"Oh stop with this mythology bull, grow up!","commenter_a":"Quran is base of Islam. Quran do not say that homosexuality is pride. GOD bans this type of relation in all abrahamic faiths, but also GOD say that He will punish this sin, people re not allowed to harm gays. They only can make advise. So Sadiq Khan should tell about Quran and not his personal views, abot homoseuxuality, only then muslims will accept him like a muslim.","post_message":"\"The irony of Brexit repercussions is that those good old (or new) British values we bang on about seem to be falling to pieces around our ears. Diversity, unity, respect, equality might sound like cliches on replay – but they do work for us, if we work for them. That’s why approaches like that of Sadiq KhanKhan are so badly needed now. He’s somehow got his act together during a moment of such uncertainty, doubt and disappointment.\""},{"comment_id":"10153534802752217","commenter_b":"It's knowledge obviously. Go look up the definition of Asylum if you are that uneducated @username","commenter_a":"They are all migrants, NOT refugees if they didn't claim asylum in Greece or Turkey for that matter. Your reporter needs educating.","post_message":"More than 11,000 refugees and migrants are camped on the Greek side."},{"comment_id":"1713716002223281","commenter_b":"@username Bill Clinton is the one that suggested the wall u retard. Plus trump will hold people hiring illegals accountable.","commenter_a":"Yep. Actually, does sound like Trump's current talking points. Someone's a hypocrite. And it's not Trump. #Trump2016!","post_message":"Do you think this sounds a lot like Donald J. Trump? MORE: @webpagelink"},{"comment_id":"10153735329829205","commenter_b":"Fuck clinton and her globalist allies","commenter_a":"Come on Loretta lynch meets bill Clinton on the Tarmac before the Benghazi report. See the movie 13 hours in Benghazi please don't tell me that every person in that movie was lying about what happened that night. There was no reason why they all resigned? Like you yourself said maybe technically they did nothing wrong but morally ? And who was to blame ? And what happened after ? And let's not forget the laugh. I would never vote or defend the Donald but let's not call a word on cnn anything but spin for Hillary. They have not even reported on the so called technical issues with the voting errors or for what went wrong with Nevada. Seriously do you honestly think that your viewers cannot see through your crap when you are crapping too ?","post_message":"Michael Cohen is one of Donald J. Trump’s top advisors, an a lawyer. He may have just committed libel against Hillary Clinton."},{"comment_id":"1121854401168903","commenter_b":"Stfu fat bitch","commenter_a":"Is it because they're assholes?","post_message":"They spend their lives eating rotten meat - so why don't they get sick?"},{"comment_id":"812675022209688","commenter_b":"@username, she should have been in jail a long time ago!!","commenter_a":"We need Trump 100%. Clinton is going to do nothing new for the @username people","post_message":"She disagreed with Donald Trump's proposal."}]
