[{"comment_id":"10153078064342994","commenter_b":"we're on that list so maybe. I NEED TO FLUSH SOME ICE","commenter_a":"Alexis Nichole Fortune hoping we close. 😩","post_message":"Our site has the complete list of school closings. Stay warm out there!"},{"comment_id":"537911889728124","commenter_b":"Public service would be great; picking up road trash; working in the parks; finding real jobs and repaying money bilked from you and me. OR, whatever; probably don't need to put them in already over-crowded prisons; make them work, not get free room and board in jail.","commenter_a":"Yes indeed","post_message":"It's about time! Do you think all welfare abusers should be arrested?"},{"comment_id":"10153559486711130","commenter_b":"Shut that slave hole down.","commenter_a":"And another.... 💔","post_message":"This is the third whale that has died this year at the park."},{"comment_id":"10157365304615389","commenter_b":"If the Democrats can do it they will try! These are the most evil people I have ever witness! Just like I have said many times it's Good and Evil fighting now! The good (Trump) will win!","commenter_a":"100% yes","post_message":"Question of the Day: In light of Donald J. Trump's comments, do you think the general election could be rigged? Weigh in below."},{"comment_id":"10153007851971051","commenter_b":"Sick ass bitch!wtf","commenter_a":"Why don't sickos like this get life in prison or death? Rapists and molesters are released to hurt more people? The system is messed up!!!!!","post_message":"This babysitter repeatedly sexually assaulted a little girl. Last week, justice was finally served."},{"comment_id":"10157833652505615","commenter_b":"I think it's really stupid to be laughing at someone trying pretty much entirely on her own to recount an election everyone agrees was not by the book. When calling this election \"not by the book\" is a gross understatement. Forcing recounts in some critical swing states in a situation where the electoral vote and popular vote are completely different is a reasonable endeavor. What's absurd is how much of the establishment is willing to lie back and let this thing happen, then assure us in the same breath nothing truly terrible will come out of this administration because the establishment will prevent it. Actions speak louder than words, and the inaction of pretty much everyone other than Stein, Sanders, and Warren speaks volumes.","commenter_a":"Jill Stein, election spoiler, is going to put that money raised in her own pocket to pay her expenses.","post_message":"This Just In – Just a few hours til deadline..."},{"comment_id":"978050422232298","commenter_b":"NOT A FAN of this pro-Muslim woman PERIOD!!","commenter_a":"She is the new definition of cool. Drop that mic and walk away.","post_message":"Mic drop."}]
