[{"comment_id":"10155089942751037","commenter_b":"Probably a 1% chance I'm wrong, 99% that go clubbing with mom are losers looking for a free ride!","commenter_a":"They'll all end up as Uneducated Ho's, sitting in the corner of a club by themselves when the looks are gone!","post_message":""},{"comment_id":"1816060081994479","commenter_b":"Worst lady","commenter_a":"Healthy lunch...kids that depend on this for their only meal for the day are going home hungry.","post_message":"Vice President Joe Biden calls Michelle Obama the \"finest first lady in history\"."},{"comment_id":"2041329586093459","commenter_b":"@username , good God man, he is not even President yet....give him some time, will you??? SUDDENLY you all expect him To do miracles??? Rome was not built in a day. Was it?? Worry about these HIPPY KIDS making trouble....poor kids didn't get their way and now they have to riot!! Instead of. Being happy that CROOKED HILLARY is finally away from shaking down and stealing from donated money meant for the poor, and sooo much more , they RIOT!!! Go figure....stupid YOUTH. !!!! That is what kids get as a COLLEGE EDUCATION THESE DAYS!!!","commenter_a":"And it took Donald Trump to do it with practically no help from the Republicans at all. John McCain with Sarah Palin couldn't do it 8 years ago, Romney choked 4 years ago when he didn't even mention the Benghazi attack and coverup when it happened less then 2 months before the election 4 years ago. So, Trump took matters into his own hands and won the Presidency - practically all by himself when he was against all odds, while also helping to secure The House and The Senate...!!! The Republicans have no excuse now...!!! But one thing is for sure, the Republicans and the Democrats sure better know who the BOSS is now..! It's time to get down to business for America..!","post_message":"So now we have the House, and now we have the Senate, and now we have the White House -- and now we have no excuses. There aren't any excuses anymore. The Republican Party has been given the full reins of this government in this country, and there is a mandate behind it."},{"comment_id":"1014005318629521","commenter_b":"Mine usually bark at noises or neighborhood dogs. However our Pit will ECHO in the house for 30 minutes when she wants to play. It only annoys us! However my neighbors digs howl for hours and have eaten my fence!","commenter_a":"Dang, what if the family isn't home?","post_message":"DOG BARKING ORDINANCE: Dallas city officials want to cut down on barking dogs. City officials have created an animal ordinance that says it is an offense if a person lets their dog bark for longer than 15 minutes. Would you agree with a similar ordinance in the Houston area? MORE ---> @webpagelink"},{"comment_id":"10153229329259087","commenter_b":"Check out this bitch","commenter_a":"Oh, a little tidbit that maybe Trump supporters don't know: Trump's current wife is a former almost porn star and underwear model for a wife. Yep, just what we want in the FLOTUS! Someone that EVERYONE can know and see what she looks like naked, and on all fours... TRUE","post_message":"GOP presidential front-runner Donald J. Trump went on the offensive on Thursday morning, attacking cable networks for treating him unfairly, slamming several presidential rivals as \"shrill\" and inexperienced, and pushing back on Pope Francis's opinions on climate change and immigration."},{"comment_id":"1339484486080508","commenter_b":"@username YOU ARE NOT SANE! HILLARY CAN'T FIGHT HER WAY OUT OF A PAPER BAG---SHE\"S A TRAITOR TO AMERICA.","commenter_a":"I'm a Trump fan, and these despicable lies about Cruz and the military are an idiot journalist's attempt to be relevant. Credible journalist? NOT! Immaturity at its finest!","post_message":"Mainstream media at it again."},{"comment_id":"10154072479709586","commenter_b":"This is so wrong... Those poor chicks.","commenter_a":"What fking country is that, where?! This is filmed. Why isn't someone there to do something about that?!","post_message":"People actually do this for #Easter. All the babies are just DUMPED in there :("}]
