[{"comment_id":"1004626696250624","commenter_b":"Boy is she getting old!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"They show this picture to men who have had an erection for more that 4 hours, works every time!","post_message":"Make sure you let our politicians know that we will not support their abortion friendly policies! Click below to sign your petition to end Roe v. Wade today! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH15&pid=fb122"},{"comment_id":"10152869218796336","commenter_b":"They are illegal!","commenter_a":"Proud of them reporting TRUTH instead of warped pc bs.","post_message":"A California newspaper will continue to use the term \"illegals\" to describe people who enter the U.S. without permission, despite an attack on its building by vandals believed to object to the term."},{"comment_id":"10154266076039071","commenter_b":"They will be new Amazon GO stores!","commenter_a":"I AM COUNT DRACULA","post_message":"The retail industry is heading into 2017 with a glut of store space."},{"comment_id":"10153009927864586","commenter_b":"Let someone stand on that bitch's head!","commenter_a":"I still cant get over the idea that an organization that euthanized dogs and cats and put them in dumpsters is denouncing anything to do with being cruel to animals. Google the pics... PETA EUTHANIZED ANIMALS","post_message":"ICYMI: Sarah Palin posted a picture of her son STANDING on the family dog & thinks it's totally okay: @webpagelink The most important thing we can teach our children IS COMPASSION. SHARE if you agree!"},{"comment_id":"10153152962811323","commenter_b":"It doesnt apply both ways. It says it does but woman are malicious and always get their own way.","commenter_a":"Good. And what about divorced men who have brought up the children while the wife goes off to make her fortune without contributing to the children's upbringing?","post_message":"\"At last! The supreme court has just rocked the apple cart of unequal divorce. It has pronounced that being a parent is an obligation that lasts. Even if one parent is no longer around, for better or worse their fortunes are inextricably bound together. Particularly if those fortunes are for better.\""},{"comment_id":"1432027056824713","commenter_b":"PUSSY","commenter_a":"Canada doesn't want these idiots any more than we do.","post_message":"Progressives always break their promises."},{"comment_id":"10153387791927690","commenter_b":"Amen. If another female in heat walked by, he'd have been on it. He's safe now. But if both had been fixed, neither would have been out by the road.","commenter_a":"Dogs are indeed wonderful. This is a sad story and an all too common story. However, as is the case in many of these sad stories, the male gets loose to chase a female that is in heat. She gets hit by a car and he refuses to leave her side , not because they were best friends or because he is a loyal friend, but rather because he is fixated on the female in heat. The moral of this sad story should be to have your dogs fixed.","post_message":"A heart-wrenching photo tells the story of a loyal dog found by his friend side Sunday morning in Dallas: @webpagelink"}]
