[{"comment_id":"1354157517952129","commenter_b":"Has Ann never looked in a mirror? She may be a skinny bitch, but look at that horse face of hers. Does anybody see the resemblance? She's got great hair, but hair can't cover up that horse face.","commenter_a":"Man Coulter is a vile excuse for a human being.","post_message":"Yes, really."},{"comment_id":"954144534678601","commenter_b":"Legal immigrants are not citizens so they do not have the right to vote! Educate yourself @username","commenter_a":"So the answer is to let 8 million non tax paying illegal immigrants vote so they can continue to collect government aid. Nice way to F the country up more you idiots.","post_message":"Obama has responded to Trump's hateful rhetoric the best way possible."},{"comment_id":"10154578752917501","commenter_b":"How many actually paid attention and noticed that I was questioning the doctors- NOT THE WOMEN!!!","commenter_a":"I am ever in awe at the things they do at the Clinic. However, I have to wonder at the ethics. Performing a surgery that has major repercussions for the woman involved (anti-rejection meds, etc...) just so she can undergo pregnancy- which has its own set of dangers - seems ethically sketchy. There are so many unwanted children who need homes. Adopt.","post_message":"This is truly amazingThe Cleveland Clinic said the nine-hour surgery was performed on a 26-year-old woman, using a uterus from a deceased donor."},{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act! Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"},{"comment_id":"1687768148176964","commenter_b":"Just love that woman","commenter_a":"Love it","post_message":"YES This is why we LOVE you, Reba McEntire!"},{"comment_id":"10153831984088132","commenter_b":"She's ok with adultery too","commenter_a":"A Christian who was married and divorced what? 3 times? Ok. She certainly doesn't have a problem with divorce but has a problem with gay marriage. The problem with so called \"Christians\" these days is there always seems to be a double standard. Sorry but you can't condemn someone who you deem a sinner when you sin yourself. Shame on her.","post_message":"\"Kim Davis should have never been locked-up for being a Christian,\" said Mike Huckabee."},{"comment_id":"10153433467800950","commenter_b":"Lmfao living in the hood ...Girl u crazy ..","commenter_a":"I don't care how you spin it...I feel for this man...we send our children off to defend a country that doesn't give two shits about the lives of those we send!!! We expect them to come home the same as when they left after killing people and watching theirs friends die...REALLY?! He was a kid who got caught up in and then taken against his will..He suffered years of torture and now we want to punish him more...I'm sorry but that is as wrong as you can get!!!!!","post_message":"In October, the leading GOP candidate called Bergdahl a \"traitor, a no-good traitor, who should have been executed.\""}]
