[{"comment_id":"10152834181476135","commenter_b":"Another feminist circle jerk. You silly basic b*tches need to go take a hike and get off Facebook and tumblr.","commenter_a":"The amount of ignorance in these comments.....","post_message":"Cortney Bogorad says, despite the embarrassment she felt after the incident, she is taking legal action so no one else goes through a similar experience."},{"comment_id":"10154077831881509","commenter_b":"Tell them to eat pork!","commenter_a":"I don't think I have read more ignorant comments than those supporting Ben Carson. Yes, Carson is entitled to his opinion but it shows the complete lack of understanding of the way our nation operates. A man who believes he can pick and choose which laws to obey is not qualified to run as President. Where are all the Christians who were crying about religious liberty? This man wants to take away the religious liberty of a very large portion of those practicing a different religion. A very sad day for America and those haters bashing the Muslim faith.","post_message":"A call for Dr. Ben Carson to drop out: @webpagelink"},{"comment_id":"10153134542104705","commenter_b":"Marianne Hutchinson maybe you should move to NZ???","commenter_a":"Merriam Mistlebauer","post_message":"The only thing we have to fear is fear itself.........and spiders."},{"comment_id":"10153168410293690","commenter_b":"In ind had been an individual liber,on account of each mob should be admit each religion.its actual substance,besides already has recognized via Basic R8s","commenter_a":"Its expected from modi sarkar, as he has the record of massacaring muslims in Gujrat..","post_message":"Are India minorities under attack? Christians and Muslims say the government is not doing enough to protect them from hardline Hindus. But is prime minister Narendra Modi being compromised by his nationalist roots? @webpagelink"},{"comment_id":"452100988313815","commenter_b":"Oprah is on her way out No one watches her American people don't like racist people like her","commenter_a":"I've thought she's been racist for years!!","post_message":"Do You Agree Oprah Is A Racist? Comment 'yes' or 'no'."},{"comment_id":"10154909768331509","commenter_b":"The World knows Obama and Hillary have failed us.","commenter_a":"Trump might use be them, but Hillary will email them to someone..","post_message":"The U.S. president has the power to order a nuclear strike anywhere in the world at any moment -- so choose your next leader carefully, America. (via CNN Opinion)"},{"comment_id":"1524668304213513","commenter_b":"The other egg isn't going to hatch","commenter_a":"did both eggs hatch","post_message":"LIVE: American bald eagles Harriet and her mate, M15, are caring for their newly-hatched eaglet! So cute! (Credit Southwest Florida Eagle Cam)"}]
