[{"comment_id":"10152885774891130","commenter_b":"Someone needs to tell that to most of today's feminists","commenter_a":"True Feminism exhibits equality. Real Feminists are not extremists seeking to belittle others. Liberal or conservative politics have nothing to do with that. Real Feminism exists on a daily basis through all walks of life. It incorporates normal women rising to challenges at work, at home, and in their communities, who expect equal treatment and equal compensation. It's sad that people can be so ignorant to this definition and can only judge radicalism with radical judgement.","post_message":"Long before feminism was a Hollywood buzzword, these films were way before their time."},{"comment_id":"10153763759623812","commenter_b":"Girl, shut up.","commenter_a":"Relax dad, she's not a teen, stupid and sad comment - life is about friends, why confuse a happy loving kid, who loves boys too as friends...","post_message":"This 2-year-old girl is crushed to hear that she can’t have a boyfriend, insists to her dad that she has someone special in her life. Her conviction is intense! @webpagelink"},{"comment_id":"10153648435169705","commenter_b":"Whatever!!!! She's 140 lbs. That's not fat at all. Smfh","commenter_a":"She is definitely not fat","post_message":"Don't ever tell Ronda Rousey what to do with her body."},{"comment_id":"10152687758547093","commenter_b":"That woman has NO business with a baby.","commenter_a":"Wat is happening to these people ADOPT a baby,dam.","post_message":"HORROR: This woman is accused of cutting the baby out a pregnant mom who answered her Craigslist ad for baby clothes... @webpagelink"},{"comment_id":"392884667560081","commenter_b":"Bitch!","commenter_a":"He certainly does, and the GOP deserves a kick in the ass!","post_message":"President Obama deserves a HUGE thank you!"},{"comment_id":"10153555901929087","commenter_b":"GO #TRUMP !!! HECK YEAH...YOU BET!!! THE ONLY ONE WHO WORKS CIRCLES AROUND THE REST, WHO KNOWS EXACTLY HOW TO MAKE AMERICA GREAT AGAIN !!! YOU BET!!!","commenter_a":"Yes, he's a strong Christian who takes on the Pope and walks in the path of Christ, building walls, abusing women and attacking people of other cultures. If this guy's a Christian, I'm Christie Brinkley.","post_message":"\"I'm always audited by the IRS, which I think is very unfair. Maybe because of religion,\" Donald J. Trump said after tonight's #GOPdebate. \"Maybe because of the fact that I am a strong Christian...you see what's happened, you have many religious groups complaining about that.\""},{"comment_id":"10154784324202577","commenter_b":"First Amendment, Bitch!","commenter_a":"nothings going to change you yanks have been played for fools","post_message":"If Donald Trump truly wants to drain the swamp in Washington he must make an example out of this evil corrupt family and send a clear message that he is here to bring about real change."}]
