[{"comment_id":"760923940676233","commenter_b":"This lady is an idiot","commenter_a":"Oh well","post_message":"\"White folks gotta give up something\" - Marissa Jenae Johnson, cofounder of Black Lives Matter"},{"comment_id":"1113814495365780","commenter_b":"@username Illegal immigrants cost taxpayers money and jobs as well as their lives.","commenter_a":"American taxpayers are spending over $130 Billion a year on welfare programs for illegal immigrants and that doesn't include prison for the felons.","post_message":"American taxpayers have already spent billions of dollars on border security, including a 700-mile long physical barrier along the southern border."},{"comment_id":"1795036153889458","commenter_b":"because women dont cheat. lol","commenter_a":"A male will cheat if they want. Tattoos or no tattoos. Plain and simple. I hate how they always try to blame other things instead of a man owning up to being scum","post_message":"Do tattoos do it for you?"},{"comment_id":"10154071724086320","commenter_b":"she is an amazing woman with a wonderful gift of talent","commenter_a":"I loved it","post_message":"Watch and see why everyone was crying after Kelly Clarkson's emotional performance on last night's \"American Idol.\" @webpagelink"},{"comment_id":"1651699668460485","commenter_b":"The deficit has no real meaning re the economy. Look it up.","commenter_a":"A big not for 8 years. What a great vacation they have had. Our country has gone to crap. Glad you enjoyed it. The only thing I have left is change in my pocket.","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"10153292946061509","commenter_b":"obama is a standerd POS ! muslim bstrd","commenter_a":"This is asinine. Why would he do this, yet absolutely refuse to meet with Benjamin Netanyahu??","post_message":"There were some hard-hitting questions about drones, college education and racial profiling. But he gets those all the time. Let's focus on the weird: @webpagelink"},{"comment_id":"612057282315211","commenter_b":"God she's an idiot lmao can't fix a fake blond moment","commenter_a":"This girl has a show? It is cheaper to produce this than real news that impacts people's lives. A little girl with a big mouth is our national dialogue? Cheap.","post_message":"Trevor Noah's performance was a thoughtful invasion, a methodical exploration behind enemy lines."}]
