[{"comment_id":"1859800897573502","commenter_b":"His daughters are no exception .","commenter_a":"50/50 sounds fair","post_message":"Would he let his daughters be drafted?"},{"comment_id":"1113246462026036","commenter_b":"I love being a princess. As you can see from time line Imma pussy","commenter_a":"She uses the same playbook as the very people she supposedly hates. Yet the morons line up behind her, rank and file. 'Murica.","post_message":""},{"comment_id":"10153504938416336","commenter_b":"This woman, is what evil looks like. They all must be shut down!!!!!!!!!!!!!!!!!!!!","commenter_a":"Wonder what she would do with video of Charlie boy's gang inside the Tate house? Give them medals? #FreeCharlie!","post_message":"Calif. AG Kamala Harris will use her office’s authority to regulate charity organizations to see if the organization that made the videos violated registration or reporting requirements, or broke any other rules."},{"comment_id":"10154429543778196","commenter_b":"Better than watching u suck dick in public","commenter_a":"Really maybe he and Putin should just get a room sick of watching them suck face in public","post_message":""},{"comment_id":"633021916884133","commenter_b":"Handler is not someone who the 1st lady would want to meet with. Talk about the trash...","commenter_a":"Chelsea Handler who is a hardcore supporter of Hillary Clinton and a Democrat. She is actually a racist.","post_message":"Wow..."},{"comment_id":"1795036153889458","commenter_b":"because women dont cheat. lol","commenter_a":"A male will cheat if they want. Tattoos or no tattoos. Plain and simple. I hate how they always try to blame other things instead of a man owning up to being scum","post_message":"Do tattoos do it for you?"},{"comment_id":"10155151069049575","commenter_b":"If she can't raise her kid right she should have not ever been pregnant","commenter_a":"Single moms struggling to pay bills and work where she has to work long days just get by on 8.00 dollars an hour with no time left for teenagers out of control who know everything, i vote with helping the mom , the hardest job on any day.","post_message":"Teen who was among five arrested in downtown fights Saturday night admits she needs help. 16-year-old describes it as, \"scariest night\" of her life."}]
