[{"comment_id":"977904432246897","commenter_b":"She is an EVIL woman an not sure why she isn't in JAIL @username!","commenter_a":"Who is that masked woman?","post_message":"It's a very simple question: “Have you seen those very, very controversial videos?”"},{"comment_id":"10154155058901770","commenter_b":"Yep just what I thought!! Gets her hair color from a bottle! And still stupid","commenter_a":"I think melania trump should be taking clothing tips from a real Material Girl","post_message":"Madonna slammed Trump supporters, calling them “lazy and “un-unified.\""},{"comment_id":"498036517054013","commenter_b":"if they have all that money they should go back wehre they came from","commenter_a":"Do not cave in. Do not sell any land to them. Be careful who you sell to that that buyer does not plan to re- sell to them. It is not unreasonable to consider that it is a possibility.","post_message":"STAND YOUR GROUND! Muslim are IRATE that Small Town Colorado Christians Won Sell Them Property to Build a Mosque! Show your support for these Americans who said HELL NO! NOT IN MY BACKYARD!"},{"comment_id":"10153834571832439","commenter_b":"Because we have a pussy in the White house","commenter_a":"Like no!","post_message":"Why? These migrants are coming to our countries from failed, devastated cultures. When and why was it decided that we have to mute and censor our traditions and mores for theirs - a failed society that suffocates and destroys."},{"comment_id":"10153330953062452","commenter_b":"Stay out of this Stephanie Mullins","commenter_a":"Great. Now it'll be legal for California to smell worse than just smog and congestion. ***Disclaimer*** This comment was made in sarcastic jest. If you're offended by this joke, clearly you cannot comprehend sarcasm over the internet. Avoid replying if you're offended. You'll just make yourself look as stupid as the halfbreeds of Offended By Everything 2015. #PSA #TheMoreYouKnow #CalmYourTitsAndTokeYourHits","post_message":"Is California going to pot? The push to legalize recreational marijuana use in the state just got a big boost. The California Medical Association is giving the proposed ballot initiative a big thumbs up. abc7.la/20oIUO6 So, should adults 21 and over be able to buy and smoke weed?"},{"comment_id":"1012583592144355","commenter_b":"and if we stay in toltel control","commenter_a":"More false propagander to try to get us to vote to stay in. The damage has already been done the EU Commission is an unelected, self sustaining, beaurocratic, and vastly overexpensive power crazed clique that will not change its self no matter what this person says. The only way to free ourselves of this shower is to vote to leave!","post_message":"Has the EU meddled too much in the daily lives of its citizens? @webpagelink"},{"comment_id":"908467619212716","commenter_b":"They are idiots. Why have 19 kids? Whats thier motive? This is called incest.","commenter_a":"Let the legal system work the way it should.","post_message":"Is anyone surprised by this?"}]
