[{"comment_id":"679630052167782","commenter_b":"She needs to be deported.","commenter_a":"i think you belong over there","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"1094996023854086","commenter_b":"What an ignorant woman..,","commenter_a":"Beautiful! So glad she will be recognized. This Pope restores a bit of faith in me for the Catholic Church!","post_message":"Mother Teresa of Calcutta, a nun who dedicated her life to helping the poor, will be made a saint of the Roman Catholic Church at a ceremony on Sept. 4, Pope Francis has announced: @webpagelink"},{"comment_id":"10153186576481162","commenter_b":"I'm glad she won't be crushing any more babies.","commenter_a":"I happy 4 her but i want to do it with out surgery","post_message":"HALF-TON NO MORE: She is the woman once dubbed the \"Half Ton Killer,\" accused of killing her nephew by rolling on him with her 1,000-pound frame. But after clearing her name, she has a new lease on life, a smaller body, and is motivating others with her weight loss story. AMAZING TRANSFORMATION---> @webpagelink"},{"comment_id":"10153984867744411","commenter_b":"Saul Mendoza See, even Muslims know that Rapefugees are invaders","commenter_a":"Something is wrong as a muslim i am starting to realize people crossing borders easily are not refugees they are actually invaders , strict action must be taken to control borders","post_message":"Some 20,000 commuters travel from Denmark to Sweden every day"},{"comment_id":"10153708553274071","commenter_b":"@username Andy Lee when should we make the reso?","commenter_a":"Eric","post_message":"We ate live octopus at this NYC restaurant — and it was exhilarating."},{"comment_id":"10155225064836509","commenter_b":"I always wondered how these bathrooms would cleaned. A typical janitor would violate the law twice if he/she cleaned these bathrooms. Or maybe they just don't get cleaned at all","commenter_a":"Hillary's a racist bigot!! She's disgusting! Calling all black people \"Super Predators\" is beyond uncalled for and her beliefs and policies have shown her disdain for the community. Only racists and bigots could support a lying criminal old white lady like her. We arent in the 60s anymore, the \"good 'ol Goldwater\" years are over. Ya know Hillary, you remember saying you were a \"goldwater girl\"?! The same group that opposed the civil rights movement?!!","post_message":"JUST IN: A federal judge has temporarily blocked the University of North Carolina from enforcing the state's so-called \"bathroom bill\" from applying to three transgender plaintiffs."},{"comment_id":"1026050264097061","commenter_b":"illigals should not be able to vote period","commenter_a":"I agree, if sending all illegals back to where they came from will save lives, then do it and to the illegals be damned!!","post_message":"YES!!"}]
