[{"comment_id":"1765571717063636","commenter_b":"@username STFU","commenter_a":"It's so nice to hear a candidate say he loves America and its people. Unlike Obama and Hillary who constantly tell us how horrible and deplorable we are and not fit to wipe their shoes. Vote Trump who would wipe our shoes if asked.","post_message":"An incredible evening in MIAMI, FLORIDA! This is a MASSIVE MOVEMENT. I LOVE YOU! -DJT"},{"comment_id":"10154219660042908","commenter_b":"Yet they try to call themselves the prolife party.The warmongers that they are proves that they aren't.They aren't prolife they are pro birth.The GOP will get us into war with iran and the way donald trump is talking we'll have a border conflict with mexico.","commenter_a":"Still waiting for Bernie to say something about the 700 million dollars congress. spent on defense last year","post_message":"Sadly, people like former vice president Dick Cheney and many of the other neo-cons who pushed us to war in Iraq were not only tragically wrong then, they are wrong now. Unfortunately, these individuals have learned nothing from the results of that disastrous policy and how it destabilized the entire region."},{"comment_id":"1446844205342023","commenter_b":"She needs to STFU!!!","commenter_a":"Why publicly, tho? 😡","post_message":"This woman has some nerve...."},{"comment_id":"1230028840342704","commenter_b":"Not fit to be president. A witch","commenter_a":"From all accounts....Killary Rotten has one of the filthiest mouths in DC. She calls people nasty names and acts like she is insane...which she is. This is what she thinks of everyone in America....she is trying her best to fool as many as she can though.","post_message":"Is Hillary Clinton really a cold-hearted [expletive]? You won't believe her explosive fits of rage, even making her husband Bill bleed, as her astonishing vitriol has just gone public"},{"comment_id":"1027678373922850","commenter_b":"Yes Michael, when an intruder breaks in your home, watch him rape your wife while you blow a whistle. Makes perfect sense. Smh Humans have the right to defend their home and family. I would rather rott in prison, than do nothing.","commenter_a":"Stupid brits. Lol","post_message":"Self-defense is now ILLEGAL in the #UK"},{"comment_id":"1168129036575432","commenter_b":"@username, I'm not voting for Hillary and if you want to call me a monkey you can meet me outside any military base and we can handle this.","commenter_a":"Hillary is an evil narcissist, a pathological liar, a Corporatist, Bilderberg member, the Whore of Wallstreet, Queen of Corruption, & Ultimate Establishment Candidate. The DNC shoved her down our throat & cheated. Her supporters are dumber than NeoCons. Trump being terrible is no excuse for anything she's done. She can go to Hell. We'd rather vote for Jill who has no chance than put our names behind either of the scumbags running.","post_message":"The differences between Hillary Clinton and Donald Trump on the real issues impacting the middle class and working families of this country are very clear."},{"comment_id":"915434395182976","commenter_b":"As a mom myself, I agree with you Ben. How much did she actually ingest if she took a sip and said it tasted funny?","commenter_a":"Clearly this is not cool, but accidents do happen in life. She drank a tiny amount of watered down sangria, not methylated spirits or even vodka. I think the parents are massively over reacting. I would be angry, but come on, a few sips of cheap wine mixed with orange juice is not going to kill a small child.","post_message":"She was rushed to the hospital drunk"}]
