[{"comment_id":"1147470615320800","commenter_b":"For one I'm not a dumb ass.So don't call me names.Im a lady.And I will vote Hillary","commenter_a":"Clinton for president","post_message":"BREAKING: ANONYMOUS Set To Drop MOTHER LODE On Hillary TOMORROW... Here's What We Know [VID] \"EVIDENCE EXPOSING THE LARGEST COVER-UP IN AMERICAN HISTORY!\""},{"comment_id":"1014897985199658","commenter_b":"A FUCKING MEN!!!","commenter_a":"#ALLLIVESMATTER","post_message":"A new low. #BlackLivesMatter"},{"comment_id":"1187509331305594","commenter_b":"She's losing Florida.","commenter_a":"She's losing in national polls !!! Americans don't trust her!!!","post_message":"Let’s think better of each other, and hold together in the face of our challenges—not turn on each other or tear each other down."},{"comment_id":"10156217952900725","commenter_b":"Illegals only make it harder for the ones who have done it legal. If I were a legal immagrant I would u of be pissed off about the illegals. It's not an easy process and considering the economy I'm wondering if it's worth it to them to try to come in legally. Especially with the liberals making all these empty promises.","commenter_a":"Like if you are voting trump 2016!!","post_message":"The debate last night proved that Hillary is running against the “B” team. She won’t be so lucky when it comes to me!"},{"comment_id":"703541823169729","commenter_b":"Both of the girls always look miserable !","commenter_a":"You tell a bunch of things that aren't true . Please people","post_message":"Malia Obama at the center of damning White House scandal. The whole family is a disgrace. This is ridiculous. Do you think the Obama family is the worst presidential family in history?"},{"comment_id":"1051832858188283","commenter_b":"That's why we're in the place we are now,to no where.","commenter_a":"Sure makes some pretty good points","post_message":"This extremely popular \"Bernie\" meme has tens of thousands of likes and shares yet it reflects a SAD reality about young people today and the public education system in America. Watch as we expose the sad truth behind this meme. [READ]"},{"comment_id":"10156227118445354","commenter_b":"And gays, get ready to be tossed off the highest building available. Who let the muslims here. Get ready fools.","commenter_a":"Prepare , you liberal women better bend over and shut your fucking mouth. This is what you asked for.","post_message":"Green light GO!"}]
