[{"comment_id":"10153064926711770","commenter_b":"Allen, then why is Dr. Carson polling so high?","commenter_a":"Ben Carson keeps making weak, limp statements with Luke warm meaning for any cause he addresses. Instead of political correctness, he has validated Carson correctness! Too weak and lame to be a strong leader for a strong country. I like Mr Carson, but well intentions don't hold water in this crucial period in our country.","post_message":"\"I don’t want to see tyranny occur here,\" Dr. Ben Carson told This Morning, adding that \"we can’t always assume that\" good people will be leading our country."},{"comment_id":"10153916819542426","commenter_b":"How about what Democrat Bill Clinton did for the black people? And how about Hillary supporting his bill and explaining that black people are \"super predators\"? Now we have a problem with unemployment. People are fighting for jobs, and Obama and Clinton want to allow THOUSANDS of immigants in our country to expand the fight over jobs. Illegal Mexicans are being hired before you or I because they are cheaper. Democrats have done none of you any favors.","commenter_a":"Truth. What gets me is that the Dems get elected in these cities then the voters blame Republicans for holding them back. How can someone you did not elect to run your city have any power to hold you back?","post_message":"\"You're living in poverty, your schools are no good, 58% of your youth are unemployed -- what the hell do you have to lose?\""},{"comment_id":"10154724331976341","commenter_b":"If you people are to arrogant or ignorant to comprehend the FACT that the land belongs to Israel than you will never get it because YOU DON\"T WANT TO.","commenter_a":"What's the big surprise? Prior to last Friday, Bibi and his gang gave lip service to the two-state solution, willingness to talk with the Pals, preservation of human rights. And did the opposite, much of the time. They don't have to bluff anymore. And by the by, it's strange to hear the man who's tried to bypass the administration for almost all of its eight years, you supported Obama's opponent in 08, talk about underhand tactics.","post_message":"You might think that something actually happened last Friday at the UN, writes David Rosenberg"},{"comment_id":"10153365455244087","commenter_b":"@username , that is BULLSHIT! They purchased the assault rifles they used IN CALIFORNIA!","commenter_a":"No one has lost any rights to guns under Obama. No one has had any guns taken away under Obama. If ONLY the right wing could learn to try to GOVERN instead of just doing things that appeal to their right wing base, that would be just great!","post_message":"“Coming in the wake of the terror attack here in Paris, this horrific murder underscores we are at a time of war,” Sen. Ted Cruz said yesterday. “Whether or not the current administration realizes it or is willing to acknowledge it, our enemies are at war with us.\""},{"comment_id":"933293176705778","commenter_b":"@username have a shitty day bitch","commenter_a":"COPS ARE MURDERERS AND MANIPULATORS","post_message":"It's been called the most gruesome case of police brutality in US history. We will never forget you, Kelly. The civil trial for the cops is about to begin. Latest update here: @webpagelink/ Video by Truth Be Known."},{"comment_id":"10153223186871336","commenter_b":"Lol @username it wouldn't be America without us it would still be Native American land Indian land you call crazy and aliens would still be over in Europe living without sign in famine","commenter_a":"Actually 52-0 if you count all the woman beatings and cheap shots outside of the ring.","post_message":"ICYMI: Floyd Mayweather piled up enough points against Manny Pacquiao to win by unanimous decision in their welterweight title bout last night. Mayweather extended his win record to 48-0, cementing his legacy as the best of his generation."},{"comment_id":"10153183843753188","commenter_b":"Boy if they can do all that in Mexico why are they crossing our borders","commenter_a":"i just came home to Seattle from 10 days in Mexico and it made me think. I think it would be better to be in a country like Mexico if the world went crazy. Those people know how to survive on nothing because they have done it all their lives. They know what to do when the lights go out... they know how to grow food and take care of themselves. I can't even imagine what Seattle would be like if this area was thrown into the same poverty level as Mexico... it would be a mad house!!!","post_message":"I don't watch The Walking Dead like most people..."}]
