[{"comment_id":"1430173077011648","commenter_b":"Crazy lady!","commenter_a":"Vote Trump all the way to the White House. This country is a business and should be run by a businessman. We have seen what the politicians have done to this country. Trump was self-funded and owes no one. It is time we the people donate to Donald Trump so he is not forced to accept special interest money. I don care how rich he is, he can keep bleeding money, let help him. It should be the American people that Trump owes and not special interest. Go Trump all the way to the White House. Make America Great Again! All aboard the Trump Train! Take America Back from CAIR, MOVE ON, BLM, Muslim Brotherhood and Liberal Terrorist!!!!! Vote Trump, bring jobs to America. Vote Trump if you want to get rid of unfair trade agreements..Save our Country!!!!!!!!!!! Keep out the refugee terrorists!!!! Save our countries jobs!!!! And a side ...","post_message":"Gee, wonder why?"},{"comment_id":"10155779429195389","commenter_b":"Yep all she would be is loose end","commenter_a":"She is a real winner, did she think she was gonna hook up with these guys? All she would be is a witness, I cannot fathom how stupid some people are!","post_message":"BREAKING NEWS: New York state prison employee Joyce Mitchell has been arrested on felony charges for providing material assistance to prison escapees, state police say. @webpagelink"},{"comment_id":"1109745385756047","commenter_b":"@username You are a waste of space aren't you darling...😉","commenter_a":"If you have ever been to Paris or London,You would know these are the two most disqusting cities in Europe. These two are stupid !!Glad to see all the comments, and no one has even been there, or has any Idea what shitholes these cities are ! LOL.","post_message":"Donald Trump is officially an international embarrassment. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154440259724060","commenter_b":"Bitch i know everything","commenter_a":"@username stay humble","post_message":"Our quote of the day is from English poet Percy Bysshe Shelley"},{"comment_id":"10152775475131045","commenter_b":"Yes, don't nobody want to mess with this grandma about her grandchildren.","commenter_a":"As a grandparent I cannot Fathom how you could do this. I would protect my children and grandchildren with my last breath","post_message":"Breaking news out of Etowah County tonight. A jury found Joyce Garrard guilty of capital murder in the running death of her 9-year-old granddaughter."},{"comment_id":"865723720214442","commenter_b":"Abortion is murder, and most unwanted pregnancy are related to sin sex with a man they don't love a date of selfish reasons like I am not ready now I am in school or the man runs off or even the man wants her to get one and even beats her.","commenter_a":"There is a planned parenthood in Knoxville that advertises abortions on their website. So why this woman decided to self abort is a puzzle.","post_message":"While attempting to self-abort with a coat hanger, the woman became worried about her own safety. Her boyfriend took her to the hospital where doctors delivered a 24-week-old baby weighing just 1.5 pounds."},{"comment_id":"1775780972691266","commenter_b":"Andrea Lynnette no way in hell.","commenter_a":"To all the people harping about how \"historic\" the DNC nomination is: There is nothing empowering about this, and by saying otherwise, you are setting the next generation of American women up for failure. You're telling them that it's okay to lie, cheat, and steal, so long as it breaks the glass ceiling. You're telling them that it's okay to stand behind an unrepentant philanderer so long as it is politically expeditious. You're telling them that one does not need to take a principled stance on any issue in order to be successful; one only needs to adhere to populist notions. The only way in which last night was historic is in the sense that this marks the first time in American history that a candidate won the nomination under FBI scrutiny. This is also the first time in which an entire political party was caught actively sabotaging a candidate. ...","post_message":"Democratic Party nominates Hillary Clinton. Your reaction?"}]
