[{"comment_id":"1122936174469300","commenter_b":"That fat lady will sing in the end, just wait","commenter_a":"I'd never vote for ANY republican, but when it comes to one-liners nobody beats Trump. His smack-down of Hugh Hewitt was epic, and Trump argued well taking on both Rubio and Cruz at the same time.","post_message":"Romney insists Trump's reasoning is an excuse."},{"comment_id":"990509770989495","commenter_b":"Any organization with 200,00members is not a church.","commenter_a":"This is what gives religion a bad name.","post_message":"Did Jesus Christ need a private jet to spread his word?"},{"comment_id":"10153167804586770","commenter_b":"What size cupp is she?","commenter_a":"can't be any worse than Obama.","post_message":"S.E. Cupp: \"I don't know how Trump's surrogates can sleep at night peddling this unconstitutional, un-conservative, and un-American garbage that is, frankly, from a guy that is never going to be president.\""},{"comment_id":"10152713641640496","commenter_b":"Amen, Laura ! AMEN.","commenter_a":"Sorry. I disagree. He sounds like a spoiled brat who realized that marriage takes work. Both people have to be willing to work at it. A real marriage is good. Hard sometimes. But good.","post_message":"How many of these do you agree with? @webpagelink"},{"comment_id":"1132425910108091","commenter_b":"The Duggars need to be rape themselves so they can experience what is like to be violated only then they will know that is not something you can can forget or forgive and it's even worse when the rapist is a family member that's supposed to protect you.","commenter_a":"Proves they believe girls/women have no value.","post_message":""},{"comment_id":"10152839305921680","commenter_b":"Not this half latino nor his wife and father!","commenter_a":"And Latino will fall for it again.","post_message":"\"As a mother, grandmother, and American, I don’t know how a person can meet these young people ... and think of threatening them and their families with deportation,\" Hillary Clinton said."},{"comment_id":"969471999775996","commenter_b":"You're stupid lady","commenter_a":"yes! Possessing a gun doesn't make you American. Leaving your pride behind for the safety of others does. European countries are proof gun control is effective.","post_message":"Heartbroken and angry. We must act to stop gun violence, and we cannot wait any longer. Praying for the victims' families in Virginia. -H"}]
