[{"comment_id":"10152882517291051","commenter_b":"Just lie a Black woman to get defensive-----you have a crush on him? Michelle won't like it.","commenter_a":"A lot better the Barack Hussein Obama.","post_message":"The next time you meet someone who doesn't like their name, tell them about this guy and remind them that it could be worse."},{"comment_id":"869922156376214","commenter_b":"And this chick got her hair pulled and sat on","commenter_a":"This cop is a asshole point gun on kids wtf!! Is wrong with this pig!! His a punk bitch with a badge!!","post_message":"This cop should be prosecuted to the fullest extent of the law, not let off with a loophole. WTF?!"},{"comment_id":"10154252490299778","commenter_b":"These horrible people who dare believe their status in a car is ever more important than a pedestrian need to be banished from all car transportation for the rest of their born days. If that were my kid, he'd be leaving town ASAP :(","commenter_a":"Get him","post_message":"A man is being sought after he ran over the top of a child and then sped out of the Arlington, McDonald's parking lot."},{"comment_id":"10153359842468984","commenter_b":"Love it .. Good for the Bitch /Bastard","commenter_a":"You can go to hell leave us alone. We don't care what you call it marriage is one man and one woman.","post_message":"You knew this was coming..."},{"comment_id":"10154260147516051","commenter_b":"@username you ignorant bitch !!! If the illegals voted and they can't vote then how did they vote if they are illegals ????dumb ass !!! You racist ass bitch !!!","commenter_a":"The majority of Americans elected Mr Trump. Millions of Clinton votes were cast by illegals who had no right to vote. You people need to respect the process and get over it","post_message":"The majority of Americans dispute Trump's right to rule since he lost the popular vote by almost two million votes. Do you think the candidate who gets the most votes should win?"},{"comment_id":"10154905567876336","commenter_b":"Ok, time for a bragging rights bet: First, it was \"racist and sexist white males,\" then \"fake news,\" and now the Russians. What do you think next week's excuse is going to be from the Dems as to explain Hillary's loss? Aliens? The cast from Duck Dynasty? My guess is that they will say Trump flew in the Aghori Monks, a modern day Monk Order from India that practices cannibalism, to scour the US and feed on Democratic Voters as to deter turnout.","commenter_a":"She lost because she is implicated in so many lies and scandals nobody has time for that.","post_message":"\"The Russians didn't elect Donald J. Trump. America did.\" Today on \"Cashin' In,\" Eric Bolling slammed anti-Trumpers who are searching for excuses as to why Hillary Clinton lost. @webpagelink"},{"comment_id":"10153351373259614","commenter_b":"This woman wants to make decisions for you and for me.....","commenter_a":"Dummy","post_message":"A videotaped gaffe by Rep. Loretta Sanchez has sparked outrage among those who found the comment to be racially offensive. Sanchez, a candidate who wants to replace retiring Senator Barbara Boxer, was speaking at a California Democratic party convention event when she made a stereotypical Native American \"war cry.\" Referring to the difference between Indian Americans and Native Americans, the congresswoman tapped her hand to her mouth. Sanchez's main opponent, Attorney General Kamala Harris, was later asked for her reaction to the gesture. \"I don know what to say to that. That that that shocking,\" said Harris, whose mother is Indian. (Video courtesy of Uduak-Joe Ntuk) Read KTLA's story here: @webpagelink"}]
