[{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"},{"comment_id":"10154221931919199","commenter_b":"Idiot woman.","commenter_a":"At 44, she needs parenting classes! Did you read she's been stopped before for this! Someone call CPS for endangering a child!","post_message":""},{"comment_id":"10153714584104087","commenter_b":"She's a pure Red in disguise.","commenter_a":"The PEOPLE are speaking. She's winning by a lot of votes.. doesn't matter what the internet thinks. Real people are voting, and real people are voting for her.","post_message":"Fresh off a commanding win in New York, Hillary Clinton has a 13-point edge in the biggest state up for grabs in next week's primaries."},{"comment_id":"1032518616814893","commenter_b":"Watch her pop that shit out right in the gym straining to hard","commenter_a":"People are so stuck on looking good they don't even take time out to enjoy being pregnant it's sad and looks nasty!","post_message":"Fitness Model Chontel Duncan Isn't Stopping Her Intense Workout Sessions Even During Her Pregnancy!"},{"comment_id":"10154229231904411","commenter_b":"If a woman have every right to show off her body or hair; then why can't she have the right to cover it? I haven't met any veil wearing ladies that have offended me in the least.","commenter_a":"The Golden Rule of Civil Rights is, One Mans Rights End Where Another Mans Rights Begin","post_message":"Awkward: Laurence Rossignol, who is ironically founder of the anti-discrimination organization SOS Racisme, compared Muslim women who wear veils to 'American negroes' who supported slavery"},{"comment_id":"10153160986369705","commenter_b":"stupid cow","commenter_a":"Nothings more eerie than the words \"AMERICA\" and \"ISRAEL\". No photos needed.","post_message":"These eerie photos show Osama Bin Laden before 9/11."},{"comment_id":"10155553244070354","commenter_b":"Sit your dumb racist ass down and shutup AL shapton and pay the taxes you owe","commenter_a":"Wake up people! States better start secession proceedings. The 10th Amendment: \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\"","post_message":"First he fought the right, then he fought the cops, now Al Sharpton announces his plan to fight his toughest opponent yet: ....The U.S. Constitution."}]
