[{"comment_id":"10154429240061955","commenter_b":"@username Excellent! Praying everyone in our country reads this!!! Please!!!","commenter_a":"I simply cannot understand how BLIND and Ignorant one can be to support Hillary... She is a Career Criminal with blood on her hands! How can people NOT see this? Just do some BASIC research on her. You will be shocked at the amount of evidence against her!","post_message":"'Fact-checking' becomes opinion journalism..."},{"comment_id":"10153896899905579","commenter_b":"Yes...go away!!!","commenter_a":"you go","post_message":"President Obama to extend U.S. Military presence in Afghanistan: Your Thoughts? WATCH statement from President Obama @webpagelink"},{"comment_id":"10152929070861336","commenter_b":"They're still human beings escaping horrible working conditions, some of these people don't even have the education or access to resources to migrate legally. So, our government is going to arrange for them to be able to live in peace and be employed in jobs that most people wouldn't take. And they'll be grateful. Sounds like the rush of immigrants that came over in the 1800's. Maybe you need to chill out instead of being knee-jerk reactionists like the anti-immigration groups from back then.","commenter_a":"Idiots both of them","post_message":"U.S. Attorney General nominee Loretta Lynch said she believed in an illegal immigrant's \"right\" and \"obligation to work\" during Wednesday’s confirmation hearing."},{"comment_id":"1150014275011477","commenter_b":"Will miss this talented actor....such a great sense of humor intertwined in his roles as \"the villain\".","commenter_a":"Quigley Down Under with Tom Selleck","post_message":"JUST IN: British actor Alan Rickman, known for roles in Robin Hood, Harry Potter, Die Hard, more, passes away at 69: @webpagelink"},{"comment_id":"10153047179381323","commenter_b":"Katie price is entitled to exactly the same as everyone else she is a British citizen who pays her taxes so she and her children are entitled to use the Nhs. Maybe we should be concentrating on people who arnt entitled coming to this county just for the benefits and Nhs and maybe the government should be claiming back the millions we loose in this way. I don't expect Katie price or other celebs are a drain on our economy as some people who claim benefits with no intention of ever working.","commenter_a":"The benefit system isn't struggling & costs being cut because of Katie Price, it's struggling because of the generation of freeloaders who see Benefits as a career choice, people who can work & pay taxes but don't; If everyone in this country that can work had the right work ethic we wouldn't be in half the mess we are. I was always brought up benefits are for those who need it for clothes, warmth, food, the essentials - including specialist care for the disabled, people nowadays have full sky packages watched on 50\" tvs, have a social life and go abroad for holidays all from benefits, where's the incentive then to get off their backsides and go to work. Whilst I'm not her biggest fan Katie price pays much more than her fair share in tax, she's a grafter & a worker, her son deserves his benefit rights in return","post_message":"\"This is exactly why universal benefits matter. Defend the right of mothers of disabled children, such as Price, to get help, and it reinforces the rights of everyone else. That’s how society works. Strengthen one pillar and the other gets bolder; weaken one and it won’t be long before they all start to crumble.\""},{"comment_id":"10155345287068132","commenter_b":"She needs to save her nekkidness for JZ.","commenter_a":"Wierdo & shes so over rated meh","post_message":"We're still not over Beyonce's performance! Join us in the comments to let us know what you thought."},{"comment_id":"1295671170453891","commenter_b":"@username they danced!!!","commenter_a":"Winner eats the loser....","post_message":"Yes. Dinosaurs danced."}]
