[{"comment_id":"578535808963586","commenter_b":"Little beaver !","commenter_a":"10208389159192541lol smh","post_message":"Happy Groundhog Day—here's to six more weeks of winter. Thanks to Believing in imaginary friends and fairy tales is outside of my age bracket for sharing."},{"comment_id":"985335071559547","commenter_b":"Scumbag!","commenter_a":"First of all what was the point in having all of this kids man! Now a days 3 or 4 is a lot of kids man. 19 kids is like your freaking crazy! I only watch half of a episode and I change the channel mighty quick. The ones that are going to suffer are their kids.","post_message":"This \"family values\" hypocrite hoped you'd never see these."},{"comment_id":"1099293306823253","commenter_b":"Are you Serious ??/ \"You can keep your doctor \" LIAR Caliphate!","commenter_a":"The Classy president!!. The other side can run there collective mouths about things they have know idea about!!. ignorance is running wild in a America!!!.","post_message":"Gallup approval ratings show that President Obama is the most popular second-term president in recent history. Do you approve of the work Obama is doing in office?"},{"comment_id":"10154251165218984","commenter_b":"He shots he hits he scores, 250bucks for each, thrn charge mexico for the money, sry but see if you can just walk over the border there no you can not, you get arested and jailed asap, but some how the Mexicans and all the others get by Mexicos military hummmmm","commenter_a":"Oh yea Eean, Milo, Jackie, Heather, Cory, Liz, Justin.. Mmmmhhhhm I'm not gonna share on your walls but for those who have children, think of what type of democracy will enable if Sanders or Clinton both Democrat are elected president. To have too share the taxes you earn back for the benefit of others. Don't be naive because a lot abuse the system, which means if you want universal health care and benefits.. The Republican Party has to amend the laws of drug test issued for anyone wanting freebies and living off the cheese the government provides.. Which is I THE TAX PAYER. This revolution crap will end after New York. On another note, Ted Cruz may have a 10 day rant after this upcoming Super Tuesday winning Wisconsin with all delegates.. But Trump will win New York & all the eastern part of nation, and then we're too California! ...","post_message":"This is insane, and it happened right in front of a journalist... Do you think America needs a president with a firm stance on immigration?"},{"comment_id":"697812187045401","commenter_b":"And the women who choose to cover their faces?","commenter_a":"Victory for the woman that are forced to cover their faces. Now they can feel the warmth of the sun, feel alive.","post_message":"Anyone caught will be fined about $541."},{"comment_id":"959266487466433","commenter_b":"O girls have brains too?","commenter_a":"Only frustrated sick person can prefer physical fearure otherwise normal and true men appreciate beauty with brain","post_message":"Men care more about a woman’s brains than her bust, allegedly"},{"comment_id":"1046767232087074","commenter_b":"@username I know that - he promoted that they would all go back intially and has since changed his agenda. He announced it more or less on Hannity last night - please read the comment again. There are AT LEAST 11.5 of illegals in the nation who would not be classified as criminals. And even tho \"they would not be given citizenship\" who does not know the Left's MO - of course the left will push for voting rights. The Left needs an underclass to stay in power. They are building the numbers year after year of voting blocs to keep themselves in power!","commenter_a":"So you are going to let the 11.5 illegals stay in the nation. You say they will not be given citizenship. You must know that most of us on the right are not stupid by now, right? The Marxists will push for their voting rights anyway - and get them w/a song and dance. And there goes the nation. We will never get her back - ever. The Left is delighted. They did it. They stacked the nation in their favor. WHY do you think the wall was never built? RIP USA.","post_message":"Will be on #Hannity @ 10pE on Fox News - discussing various subjects including immigration - if elected, we will #BuildTheWall & enforce our laws! Tune in - as Donald Trump Jr. Joins me with other special guests!"}]
