[{"comment_id":"10153206045164087","commenter_b":"@username I was just about to say the same thing. How can women support that misogynistic pig? It's baffling.","commenter_a":"America will get more of the same if Carson is elected President! America needs someone like Donald Trump to run this country like a business and bring back jobs, repay our massive debts, negotiate better trade deals, revamp or do away with Obamacare. With all do respect to Dr. Carson, he's not the man for this job. He'll get caught up in the Washington gridlock and America will get more of the same!!!","post_message":"Retired neurosurgeon Dr. Ben Carson has surged by double-digits to within striking distance of GOP front-runner Donald Trump according to the latest New York Times/CBS News poll."},{"comment_id":"10154941014182577","commenter_b":"Lies and fear. Lies about money and fear of foreigners. That's it.","commenter_a":"How was Nigel Farage's march?","post_message":""},{"comment_id":"10154162143246756","commenter_b":"@username No, it doesn't. As a woman, you should pay attention to who thinks you aren't able to make decisions about your own body.","commenter_a":"Scalia institutionalized his vicious hatred of women and gay people and his lack of respect for the Constitutional rights of every American. If he didn't want people to speak ill of him after he was dead, he should have lived a different life. He was a hateful man and will be rightly remembered as one. Death doesn't suddenly turn a monster into Winnie the Pooh.","post_message":"Perhaps most of all, Scalia will be remembered for his scathing dissents. He was a reliable conservative, but every once in a while he broke rank."},{"comment_id":"10153321750847439","commenter_b":"LMAO love it! She is a low life who feeds on hatred","commenter_a":"It takes a lot for an atheist such as myself to be bothered enough to come on this page and attack a low life like Geller who has zero intelligence and is followed by a bunch of losers who are the love children of their mothers and uncles, but hey, we all gotta do what we gotta do.","post_message":"Amazing heroes providing security for free speech conference #motoons #AFDI"},{"comment_id":"488461684677745","commenter_b":"There idiots ,this woman can handle a weapon and herself ,and shes beautiful to boot","commenter_a":"beside ,in front,behind shes good from any view, wish she was President ,one smart lady !","post_message":"Controversy erupts after this video of Palin surfaces. Sarah is in trouble. She needs our help. Do you stand behind Sarah Palin?"},{"comment_id":"10154344399454411","commenter_b":"fuck off you bitch American","commenter_a":"Abe out of all should know that you don't complain against your Slave-Masters. You sold yourselves to the Empire, now shut the fuck up and sit the fuck down.","post_message":"Kenneth Shinzato, a 32yo civil employee of the US military base in Okinawa, admitted that he strangled his victim"},{"comment_id":"10153704706699170","commenter_b":"She got robbed! She should be #missamerica!","commenter_a":"Well, if their question was addressing 'gun related accidents', she was right on point. However, that was not their aim ( no pun intended) - their 'aim' is to ban weapons period. Their question does not address any of the mitigating circumstances that surround each of the recent incidences of gun violence and they know it. You can see it in the eyes and expressions of the questionners once Miss S.C. gave her answer.","post_message":"Wow. I don't think ANYONE was expecting this... Do you agree with Miss South Carolina's answer?"}]
