[{"comment_id":"1642997759320670","commenter_b":"What a stupid bitch !","commenter_a":"What a bitch c...t","post_message":"These people need to be BANNED from games forever."},{"comment_id":"10154880669523614","commenter_b":"Let them go there and put up another wall.","commenter_a":"Now there's an idea, send them all there not here. Works for me.","post_message":"Canadian Prime Minister Justin Trudeau's immigration minister has declared an open door policy for immigrants and refugees."},{"comment_id":"704085629782015","commenter_b":"She is Disgusting. Can't stand to look at this woman","commenter_a":"This whole family is a DISGRACE to this Country!","post_message":"Our first lady just disrespected all the white women in our country. She is a hypocrite and a racist. We miss Laura Bush. Do you agree Michelle Obama is a disgrace of a first lady?"},{"comment_id":"10153036751566491","commenter_b":"Your mother is fired","commenter_a":"You're fired!","post_message":"NBC dumps Trump."},{"comment_id":"10154166667183205","commenter_b":"Very well done mr. Congressman, proud to have shaken ur hand once when u visited vegas.","commenter_a":"Thank you! I'm proud of you! great speech! Facts and more facts!","post_message":"I gave a speech this morning on the House Floor welcoming the new leader of the Republican Party to Capitol Hill and showing him what is on the menu in the cafeterias today -- taco salads (the food Republicans eat to show their love for The Hispanics) and strawberries (which almost certainly were picked and packed by undocumented farmworkers), which is a little ironic given that the GOP now wants to deport 11 million people, mostly Latinos, from the U.S."},{"comment_id":"10158475114940354","commenter_b":"Is Melania Trump retarded?","commenter_a":"Uninstalling Obama in... 99.9 % Complete!!","post_message":"Say what?!"},{"comment_id":"10156524668125293","commenter_b":"Tony: I doubt most American wives want to work a job. Friggin stay at home cows!","commenter_a":"weather the job is a career or just to put food in your stomach. Your wages has to match the cost of living and the cost of living is going up and so should the wages. KEEP Protesting it because they are wrong!!!!!!!!!!!!!!!!!!!!!!!!!!!","post_message":"\"He's interfering in other cities' business.\" A bill passed the Alabama House today that would outlaw local minimum wage laws. Tonight, protesters are lining the street in Mountain Brook, the home district of the bill's author. More on the bill at 9:30, more on the protestors at 10."}]
