[{"comment_id":"856436467738235","commenter_b":"Hang her!","commenter_a":"I'm a cabbie and I wish I could catch every person that skips on me","post_message":"A judge told this teen she could either walk 30 miles within 48 hours--or go to jail. She chose the long walk. See what she did below. Do you think the punishment fits the crime?"},{"comment_id":"10153199211227235","commenter_b":"Stupid bitch. Go read the Constitution you're currently wiping your ample ass with.","commenter_a":"Omg! Go away please.","post_message":"GOOD GRIEF!"},{"comment_id":"1181986708533713","commenter_b":"if they don't like it they should leave America. Sure mexico, africa, iran or even canada would take them.","commenter_a":"Exactly! Behavior like this is a major part of why Hillary and her supporters just lost the election! Protesting is good, but not when you're whining about a person who won an election fair and square just because you disagree with them.","post_message":"\"This is not helping.\" One Hillary Clinton supporter in Chicago said he was unhappy with how some of the the anti-Donald J. Trump protests were being carried out @webpagelink"},{"comment_id":"10155037576899268","commenter_b":"So, all wives are prostitutes?","commenter_a":"When you obviously marry a man for his money, what else would you call it. If you sell your soul to the devil, you're a prostitute. After all, no one would want this orange Cheeto if it wasn't for his money.","post_message":"Melania Trump doesn't deserve to be slut-shamed."},{"comment_id":"10153624837111770","commenter_b":"BLM is simply trying to create so much chaos that Marshall Law will be declared and in turn that means that if its declared Obummer will stay in office that's what they want! I have no idea why they want that because he does not care about them he does not care about anyone accept his third world Muslime buddies (no that's not a misspelling they are Muslim slimes)!","commenter_a":"Great! Trapper keeps sticking his foot in his mouth.","post_message":"\"Listen, Jake, I wasn't born last night,\" Police Chief David Brown told CNN's Jake Tapper. \"You ask me a policy question that policy-makers haven't resolved, I'm going to punt and kick it back to you.\" READ MORE: @webpagelink"},{"comment_id":"588870771303502","commenter_b":"He should be deported. Hillary should be charged for her recent money scam","commenter_a":"lmmfao","post_message":"Obama is formally being charged with treason. He is getting it from all angles. Now is our time to push. Should Obama serve time for his crimes?"},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"}]
