[{"comment_id":"485435508313696","commenter_b":"She is a dangerous racist!,","commenter_a":"Yes","post_message":"Oprah is going after white people on live television. The hypocrisy is overwhelming. We need to show her we're not going to stand for this. Do you agree Oprah is a racist?"},{"comment_id":"10153377243163812","commenter_b":"Criminals go to Jail not to a coffin u c u n t","commenter_a":"Never in my entire life did I see so much racism!!! And it's NOT whites against blacks but the other way around!!!! Freddie gray was a criminal as was Michael brown!! Both got what they deserved in my opinion! Both had rap sheets a mile thick! Don't break the law and you won't get arrested! Simple logic! Don't get me wrong in today's society many cops coming are only there for the power but there are more that truly want to make a difference and it's sad when they're charged for trying to remove scum from the streets!","post_message":"BREAKING UPDATE: Warrant issued for arrest of 6 officers in Freddie Gray case; various charges including murder, manslaughter, assault being leveled: @webpagelink"},{"comment_id":"720191621435846","commenter_b":"Peaceful muslims?? What in the hail is that??? They all believe the same! You and all the misguided people who liked your post get to be first in line for beheading!!! Dear lord do some actual research! There is no such thing as a \" peaceful Muslim\"!!!","commenter_a":"If it's true , hats off to them . We have been wanting \" peaceful \" Muslims to stand up to the \"radicals \" , maybe this is a start ????","post_message":""},{"comment_id":"10154043795967061","commenter_b":"The fact that the lady moves so slow is the first reason she should no longer be driving!!!!!!","commenter_a":"Grab her and get her out!! Why so slow Poor lady Car could explode","post_message":"WATCH: Body cam video shows Santa Fe police officer rescuing an 87-year-old woman from a burning car. \"I could have burned to death. @webpagelink"},{"comment_id":"1112699392133505","commenter_b":"Where do the vaginal secretions necessary for intercourse come from then???","commenter_a":"from a biological/anthropology standpoint, there's nowhere for it to come from besides the bladder. you're pissing on people. discussion over.","post_message":"Can women squirt, or is it just pee?"},{"comment_id":"10153399368892964","commenter_b":"I'm sorry but I didn't see a post about the TPA for the last vote or this one coming up probably this next week to put it in...do you think there is a reason for that? Something this important? And nowhere else to post so I would guess that means he doesn't want to hear it. But it's his job, so yes he is going to hear about it whether he wants to or not!","commenter_a":"We need to keep OUR laws and get rid of these fake \"free trade\" treaties that make us beholden to an unelected foreign tribunal that frowns on anything that allows us to favor buying American, calls it unfair and forces us to change our laws or pay through the nose for the privilege of keeping them. You need to STOP this subversive attempt to undermine our Constitution NOW and vote NO on the TPA Revote...this does not need to go to an up or down vote! @webpagelink","post_message":"I successfully added a measure protecting jobs at the Lighthouse for the Blind to the National Defense bill."},{"comment_id":"10154533170793984","commenter_b":"Yeah @username...she's a bully on FB. I'd like to see her ass face to face..I bet @username would be singing a different tune.....lmbo...I love when people grow FB balls....lmao","commenter_a":"The bad news is Trump running in the first place, the good news is he will never occupy the Oval Office.","post_message":"Donald J. Trump just sent a brutal message to all the cronies of Barack Obama hiding out in the federal government... he's about to clean house. It's about time someone did this..."}]
