[{"comment_id":"10153625386991179","commenter_b":"@username. Thought you would like this!","commenter_a":"Tracy McElfresh Jesy Anderson","post_message":"Here's another one! Who is the genius behind these?"},{"comment_id":"935501763157349","commenter_b":"Okay. That's more than a bit much. People shouldn't need to spread theirs legs that much. I wish people wouldn't call it man spreading though. I've seen women do it as well, and the name just sounds offensive.","commenter_a":"Frankly unless they refuse to close their legs to let someone sit next to them this is just stupid.","post_message":"They both spread their legs on the subway, but only one raised eyebrows. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10153326829869170","commenter_b":"then let her and the mayor protect the city, see how good they do against the thugs.","commenter_a":"This whole deal is just so sad, on so many levels. Lots of fault to go around. Lots of blame to be shared.","post_message":"BREAKING NEWS: Baltimore's chief prosecutor says the death of Freddie Gray is a homicide. Six officers are being charged."},{"comment_id":"1262934473727561","commenter_b":"There is no 'weaker' version of the species. Both genders are the same species, just with physical differences.","commenter_a":"12,000 yrs. ago and they're still Lions 😭😭","post_message":"These images are just extraordinary. The cubs were just a few weeks old when they died."},{"comment_id":"751075045025676","commenter_b":"@username I like the guy. He's obviously brilliant, but wasn't on top of his game last night. I'm glad he'll be able to survive it.","commenter_a":"Ben was kinda catatonic at the debate last night. Luckily, the liberal zealot moderators stole the show and the headlines.","post_message":"In 3......2......1.......BOOM!"},{"comment_id":"10153846448114087","commenter_b":"No matter what I will never vote for Hillary!","commenter_a":"If, and that's s big if, she ousts her you can guarantee she'll give/get her some other position of influence and big money either public or private sector.","post_message":"Bernie Sanders has put ousting Democratic National Committee Chairwoman Debbie Wasserman Schultz at the top of his list of demands, putting pressure on Hillary Clinton to get rid of an ally accused by her rival’s supporters of tilting the race in her favor."},{"comment_id":"1325783830806579","commenter_b":"Yeah, you're a whore","commenter_a":"Look at all of the money hungry gold digging hussies in the comment section. ☝️️ @username","post_message":"If you've got some extra money to burn..."}]
