[{"comment_id":"10152902421671378","commenter_b":"She needs to set her asss down ! Cthu","commenter_a":"Ratchet asss fools ! The Baltimore Mayor is INCOMPETENT ! Her dumb az decides to enforce a curfew 24 hours AFTER the riot starts... #blankstare Why hasn't she called The National Guard ???","post_message":"#BREAKING Action News reporter Kenneth Moton is in Baltimore and this is some of what he is seeing this morning."},{"comment_id":"990898310953409","commenter_b":"\"Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you\"","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas. @webpagelink"},{"comment_id":"882254358503349","commenter_b":"My child would be instantly removed!","commenter_a":"Yes it would and yet silence from the sooo offended group.","post_message":"ISLAMIZATION: LA Public School: Teaching Kids Is The One True God (VIDEO) @webpagelink"},{"comment_id":"10154704340591509","commenter_b":"Don't feed the troll people.","commenter_a":"Why didn't this man order a bride from Russia, or a number of countries which pimp put their very ready and willing women.","post_message":"\"When I woke up I didn't know that I was in China.\""},{"comment_id":"760226330784714","commenter_b":"The woman is an MD, right? She is by definition smart. So what happened?","commenter_a":"Welcome to the female version of Ben Carson... So. Damned. Stupid.","post_message":"It’s official now: Jill Stein—and the Green party if it agrees with her—is/are a waste of space. By Daily Kos user BoGardiner"},{"comment_id":"10152886010046051","commenter_b":"Kill them sick people,now we'll have to pay for them to live in prison","commenter_a":"Both of them will burn in hell. Drugs are the most powerful tool of the devil.","post_message":"This mom decided to trade her 11-year-old for something that was a lot more important to her."},{"comment_id":"1195133713860336","commenter_b":"AND WE ARE OFFENDED BY ANYTHING MUSLIM. FEEL OFFENDED, GO HOME!","commenter_a":"Muslims are transgender too. They need a ladies room too.","post_message":"Patriots are pissed over this post. 'LIKE' and 'SHARE' this if you think they should shut the hell up. @webpagelink"}]
