[{"comment_id":"1787974808090517","commenter_b":"When a woman as dumb as a rock has been a Senator, Secy of State, and candidate for president of the USA, my God , makes one wonder how many ignorant people have voted for her.","commenter_a":"awwwww wasn't trained???? They keep saying she's so \"intelligent\" and the most \"Qualified\". Everything about her is BS! The absolute worst Democratic candidate EVER!","post_message":"A senior Department of State official claimed there is no documentation showing former Secretary of State Hillary Clinton ever received training in the proper handling of classified materials, according to a June 30 Department of Justice filing in U.S. District Court."},{"comment_id":"726323540858316","commenter_b":"Meryl shut your hole, no one cares what you have to say. Matter of fact put your money in California and pay their way. You are a dried up old hag from the movies and you didn't get their by yourself. We put you there. Get the hell over it and go get laid. LOL you probably can't even get that.","commenter_a":"Dodo. She will not only in be hibernation but soon will be extinct","post_message":""},{"comment_id":"10153491120417869","commenter_b":"How ironic, mike; YOU are the one that's \"done\". You know what I'm talking about. This was your swan song, buddy.","commenter_a":"All Presidents are natural born to eat the dirt and breathe the air within USA soil ONLY!!! President\\tDOB\\tPlace of Birth George Washington\\tFebruary 22, 1732\\tWestmoreland County, Virginia, British America John Adams\\tOctober 30, 1735\\tQuincy, Massachusetts, British America Thomas Jefferson\\tApril 13, 1743\\tShadwell, Colony of Virginia, British America James Madison\\tMarch 16, 1751\\tPort Conway, Virginia Colony, British America James Monroe\\tApril 28, 1758\\tMonroe Hall, Virginia, British America John Quincy Adams\\tJuly 11, 1767\\tBraintree, Province of Massachusetts Bay Andrew Jackson\\tMarch 15, 1767\\tWaxhaws border region between The Carolinas USA Martin Van Buren\\tDecember 5, 1782\\tKinderhook, New York United States William Henry Harrison\\tFebruary 9, 1773\\tCharles City, Virginia Colony, British America John Tyler\\tMarch 29, 1790\\tCharles City County, Virginia United States James K. Polk\\tNovember 2, 1795\\tPineville, North Carolina United States Zachary Taylor\\tNovember 24, 1784\\tBarboursville, Virginia United States Millard Fillmore\\tJanuary 7, 1800\\tSummerhill, New York United States Franklin Pierce\\tNovember 23, 1804\\tHillsborough, New Hampshire United States James Buchanan\\tApril 23, 1791\\tCove Gap, Pennsylvania United States Abraham Lincoln\\tFebruary ...","post_message":""},{"comment_id":"1544946612212472","commenter_b":"Superior to a chimp maybe.......","commenter_a":"He's such a moron! And his father has the nerve to say he has superior genes!","post_message":"What an idiot!"},{"comment_id":"1493513274041749","commenter_b":"what a whimp","commenter_a":"The people of france must be so hurt by the utterings a man who surrendered his citzenship because he refuses to pay french taxes and became a Russian citzen instead. Comrade Dipstick needs to shut up","post_message":"'France is populated by imbeciles making wine and stinky cheese for tourists'"},{"comment_id":"10153160273727217","commenter_b":"Sorry if that last comment offended anyone.","commenter_a":"Does EVERYONE in Britain get offended by EVERYTHING?","post_message":"\"It brings back trauma for everybody who was attacked by a shark.\""},{"comment_id":"1457021290993798","commenter_b":"Bullshit they need to put her ass in prison","commenter_a":"jesse doesn't want her next to him at the gallows","post_message":"But, but...I thought she was innocent, Jesse?"}]
