[{"comment_id":"10152873861987434","commenter_b":"Shit for brains","commenter_a":"Since when did weed start smelling like fish?","post_message":"After pulling Charnesia Corley over for running a stop sign, two Houston deputies held her legs apart and forcibly administered a body cavity search in public—all because her arresting officer suspected she had weed."},{"comment_id":"10156195156160615","commenter_b":"LMAO! Look at that old Mary!","commenter_a":"Being that he's gay, \"they\" should be \"we\"- \"I don't know why we need special protections.\" Also, \"special\" should be \"the same as\", since lgbts are just asking for the same as everyone else - \"I don't know why we need the same protections as everyone else.\" That's what he said, decoded.","post_message":"\"I don’t know why they feel they need special protections\""},{"comment_id":"10154553975279753","commenter_b":"Aaliyah Johnson","commenter_a":"Gina Anna","post_message":"uh this is amazing Foxes & Friends"},{"comment_id":"1246630588734477","commenter_b":"This braindead liberal moron should be put in a cage and shut her stupid mouth","commenter_a":"She's getting fatter and fatter too !! 😎","post_message":"Hit 'LIKE' if you think Whoopi is a complete IMBECILE who has no business being on national TV!!! @webpagelink"},{"comment_id":"10153759354128352","commenter_b":"She's a slut","commenter_a":"U can tell exactly who the sluts are on this post lol all the women who are defending her..","post_message":"Woman who was ‘slut shamed’ after her public threesome at Calgary Stampede went viral says she has no regrets – in video seen by 3.4million"},{"comment_id":"1649676571963807","commenter_b":"Oh no she didn't, hand of God should of slap her head...","commenter_a":"I'm very proud of you and the stand you are taking for your Savior. Stay strong, and God bless.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"},{"comment_id":"930466986973481","commenter_b":"I believe that the Goverment ( teachers ) should mind their own and stay out of our lives and work on being a better teacher ! It's up to the parent to decide when it is appropriate time to educate the child . Teaching a child inappropriate touching is about the limit that the school should be doing . Nothing else !","commenter_a":"Just be open and honest with your kids about sex. Answer questions, create an environment that allows for discussion and be open minded when they tell you what they think. It's not a bad subject. It's part of life.","post_message":"Would you call this educational plan \"age-inappropriate\"?"}]
