[{"comment_id":"1109262989140148","commenter_b":"Crazy woman- Good match for Trump","commenter_a":"What an imbecilic shallow fool! Has she ever gone a day without knowing where she will sleep for the night or whether she will find a meal before the end of the day? God! Someone just shut her up!","post_message":"\"Knowing that Trump won on [immigration], it should empower you to go ahead and ask the candidates, 'What the heck are you thinking, candidates? What are you thinking when you're going ahead and actually asking for more immigrants, illegal immigrants, welcoming them in, even inducing and seducing immigrants with gift baskets of teddy bears and soccer balls?' \" Sarah Palin said."},{"comment_id":"10153581173261337","commenter_b":"Get fucking jobs you fucking losers ass faggots !!!!!","commenter_a":"I'm pretty sure these people have more money than God! Please don't help them in there time of wrong doings!!","post_message":"DUGGAR DISASTER: After TLC cancelled 19 Kids and Counting, the Duggar family is asking for donations..."},{"comment_id":"10153619794460575","commenter_b":"You can see how they are when they don't get their way they are illegal illegal illegal shoot shoot shoot","commenter_a":"Cant wait for Trump to win and stop these third world demonstrations by illegals that dont belong here","post_message":"Trump refuses to be silenced. . ."},{"comment_id":"10153763759623812","commenter_b":"Girl, shut up.","commenter_a":"Relax dad, she's not a teen, stupid and sad comment - life is about friends, why confuse a happy loving kid, who loves boys too as friends...","post_message":"This 2-year-old girl is crushed to hear that she can’t have a boyfriend, insists to her dad that she has someone special in her life. Her conviction is intense! @webpagelink"},{"comment_id":"827081283993961","commenter_b":"Moochele needs to shut her ugly mouth.","commenter_a":"We can't stand her either.","post_message":"Is she serious?"},{"comment_id":"962417470484668","commenter_b":"Do with all the locks broken does that mean all these people will soon divorce ?","commenter_a":"Melissa Sheree Lisa Danielle","post_message":"Love 0 Heath and safety 1"},{"comment_id":"10152983014636051","commenter_b":"Yes, she should have been suspended. The foul language is not acceptable to use in school or anywhere else.","commenter_a":"i see nothing wrong she answered them in her opinion and where are the profanities? teacher is wrong and so is the school","post_message":"School officials took one look at this 14-year-old girl's answers on her sex-ed quiz and immediately suspended her."}]
