[{"comment_id":"10153369191183984","commenter_b":"Yes it is.The best we can do is try to covert those that are a,ready here. I'm not sure how many would even listen.Its a job for the Holy Spirit. In the mean time we should stop immigration of Muslim population into the USA . When it reaches a certain percentage than there will be major problems. Satan is a master at deception and he came to kill steal and destroy.Jesus came to give life and give it more abundantly .","commenter_a":"OOOOH boy!! are we sitting by and letting this happen before it grows too late? Hell no!!!! Anyone interesting to get rid the prez, say aye!","post_message":"Wow, after watching this, I've got to wonder how this guy can say what he does and get away with it! Unbelievable! Do you think that radical Islam is the threat this woman claims?"},{"comment_id":"1305307819486565","commenter_b":"#DUMPTRUMP NOW!","commenter_a":"TRUMP will have them shot, Obama let them make it with their lives. He's already making plans for Paul Ryan, he has ties to the Mafia and will use them. They will have to get rid of Trump.","post_message":""},{"comment_id":"1077965912287650","commenter_b":"What policy? The only policy she had was to make money for herself!!!","commenter_a":"HILLARY IS DISTURBING","post_message":"...says the Benghazi butcher and the woman who transferred 20% of all U.S. uranium (the stuff used to build nuclear bombs) to Putin's Russia as 9 investors in the deal funneled $145 million to the Clinton Foundation."},{"comment_id":"10157096096500725","commenter_b":"Trump and his supporters can go ahead and choke on a Nigerian cock","commenter_a":"Yet another reason Billy Joel sucks....he's supporting DollHands Donny!","post_message":"Thank you Billy Joel- many friends just told me you gave a very kind shoutout at MSG. Appreciate it- love your music!"},{"comment_id":"700385996818645","commenter_b":"We in America should do that too. The tree is evil, the fruit is isis and radical muslems.","commenter_a":"Thats what they want it makes them stronger. Causes more hate.","post_message":"Muslims are doing everything to stop him, but he won't relent. This might be what they have to do. Do you agree with his movement?"},{"comment_id":"10154827367754197","commenter_b":"@username your a tart.","commenter_a":"Trump's ignorance is astounding. He should stop tweeting narcissistic nonsense and start reading the security briefings. We are the laughing stock of the world now that we elected a buffoon as president. God help us.","post_message":"Donald J. Trump is very upset with the United Nations after a recent vote. Read his comments on WFSB.com and the Channel 3 app. Then, tell us your thoughts on the statements by the president-elect."},{"comment_id":"10153465651246545","commenter_b":"She Have to have police officers to work security. That's a city ordinance. If police don't work the event, her show will get cancelled. I think It will blow over tho and she'll be ok...","commenter_a":"I will say one thing...Police or No Police. The show will go on and will be sold out. So she is winning either way. So for those that are calling her racist. Why would all nationalities join in on the hate monger party and pay for a ticket. IJS","post_message":"The president of the Dallas Police Association said Saturday his group is not calling for a boycott of working security for Beyoncé's May concert at AT&T Stadium. However, he also said he wouldn't be surprised if many Arlington officers chose not to work the event."}]
