[{"comment_id":"1573366636056793","commenter_b":"LOL And people trust this bitch. LOL Good little sheep BBBBAAAAAHHHHH","commenter_a":"Why this isn't on the headline news?","post_message":"She used the racial slur over and over and over..."},{"comment_id":"10153842177281636","commenter_b":"In other news, unelectable man set to win another election.","commenter_a":"hahahahaha where are the haters now? suckers!","post_message":"BREAKING"},{"comment_id":"10153166398548812","commenter_b":"If you want current news coverage, go to the news stations. Not Obama","commenter_a":"where is obama,why he is deadly silence now ?","post_message":"\"My best friend was killed and I don’t know why.\" Chapel Hill Shooting: @webpagelink"},{"comment_id":"10153312021701756","commenter_b":"Please Sharon, share sources of actual statistics/studies for this belief. Thanks.","commenter_a":"How about environmental impact? How about helping ourselves? It seems apparent to me that most people truly do not care about animal welfare.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."},{"comment_id":"10157050332450354","commenter_b":"This bitch is a PSYCHO!!!!!!!!! I am 100% convinced now ( before I couldn't be totally sure ) that those bruises on her forearm were made prior to Cory grabbing her. Corey grabbed her biceps the video shows more likely than her lower arm. She has 0 credibility and will never get a job as a respected journalist again","commenter_a":"You stupid bitch you need to let it go. There was no case and you should be the one arrested. You will be lucky if you can get a job delivering papers. Your a liar just trying to get more than your 15 which by the way is up. You didn't do what you were told to do just like every other common thug that feels they can what ever they want. Now shut up and go home before you make a even bigger ass of yourself","post_message":"“The entire situations just seem to me a little sketchy....\""},{"comment_id":"659614807562431","commenter_b":"I would have left that along time ago. Angree black woman.","commenter_a":"We don't give a shit about their marriage , they are destroying America and need to be kicked out of the White House NOW!!!!!!!!!!!","post_message":"It seems that Michelle and Barack are going there separate ways. How about in the meantime, we find a president who can actually run our country. Do you agree America should divorce the Obamas?"},{"comment_id":"10153985778706955","commenter_b":"@username Cruz will never get my vote ever. So?","commenter_a":"I will never support Ted Cruz, never! #NeverCruz","post_message":"Cruz Still Faces Daunting Math After Win in Wisconsin..."}]
