[{"comment_id":"10154683405811756","commenter_b":"Well what can one expect when they compromise their values to support an incompetent candidate for president for the sake of the Republican Party! I thought you all take an oath to do what's best for our country and the American people. Not sure how Trump could possibly be considered part of this equation!","commenter_a":"@username, what we were talking about","post_message":"It was already a difficult election for down-ballot Republicans, a top campaign aide says. \"The bottom is starting to fall out a little earlier than expected.\""},{"comment_id":"10154173006980950","commenter_b":"No intel has verified that! Please name names & not newspapers","commenter_a":"If Russia hacked the election to favour Trump, then how did Hillary win the popular vote?","post_message":"NEW: Despite Vladimir Putin denials, U.S. intelligence sources confirm hacks and cyber operation of this scale could not have occurred without his blessing, CBS News' Jeff Pegues reports. @webpagelink"},{"comment_id":"10152536753022377","commenter_b":"Pay back is hell Nancy you POS witch..","commenter_a":"tell pelosie to fk off s hes disguisting pos let pic cotton","post_message":"Trending Now..."},{"comment_id":"10153604770703984","commenter_b":"I know that Obama was slow to react. The main reason is the fallen were White and Hispanic soldiers killed by a Islamic terrorist. He has zero respect for our military and would be very happy if all military members that don't support his new direction for this country would resign. We have a President that wants to convert America into a third world country that will allow him to remain its Dictator. Everyone needs to remember the USSR and how it broke up into many small countries that are loaded with the rich leadership and the overtaxed people who just want to live in peace. Russia's streets are ruled by gangs and the mafia. WAKE UP AMERICA!!!","commenter_a":"Obama is some commander in chief NOT!! He should be ashamed! What happened to freedom of speech?","post_message":"What just happened in a crowd of veterans during an Obama speech says a lot about his presidency. The bold veteran who stood up even after he was dragged down is attracting a lot of attention. Do you support what this veteran did?"},{"comment_id":"1088253067851669","commenter_b":"Sure.. The Democratic party will take votes any and all ways possible. Even if it means a threat to National Security. Anybody supporting this refugee program should have mandatory sign for being a host household and paying for ALL clothing and food out of their own pocket. When I bring this up on Gov Tom Wolfes page you can here the crickets chirping. There were a load of dems in support until I said this. Then \"SILENCE\". Why should the MAJORITY of the state who don't want them here have to pay? Incidentally, not all dems want them here niether.","commenter_a":"Obama & Hillary Clinton created this whole refugee problem.","post_message":"Professor: Refugee crisis is result of Obama's Syria policy"},{"comment_id":"624793527653829","commenter_b":"I thought the window sign was funny too.","commenter_a":"Julie! lol","post_message":"If you are a Starbucks customer, you might be a racist... apparently."},{"comment_id":"835204176588028","commenter_b":"Girl really baby get check","commenter_a":"Its that flu you cant shake.","post_message":"Oh my"}]
