[{"comment_id":"10155239406179199","commenter_b":"Wow, you're an a**h**e","commenter_a":"I bet you they're trump supporters.. them","post_message":" still a person, you should still treat me with respect."},{"comment_id":"10153639382745950","commenter_b":"Clever ladies..some of those pre rape drugs put you out for life.","commenter_a":"Good job ladies, we gotta stick together as women or we'll all parish to the hands of the evil ones. May GOD bless them all","post_message":"It doesn't matter if you're a friend or a stranger. When these 3 women noticed a man allegedly slip something into his date's drink, they couldn't just sit there and watch it happen."},{"comment_id":"1372039169498167","commenter_b":"Illegal aliens out of my health care","commenter_a":"Politics is what got you your \"free\" healthcare. We the people are tired of being forced to pay for it, So please feel free to sit down and STFU.","post_message":"HERE IT IS!"},{"comment_id":"10153001285494091","commenter_b":"Why have a trial for this garbage. Execute her already.","commenter_a":"savage.","post_message":"\"Everybody wants to know. Yes, I did kill her. The mother accused of killing her two children and storing their bodies in a freezer yelled in court that she killed them: @webpagelink"},{"comment_id":"710582602423848","commenter_b":"Ann Coulter shows her true colors like Trump. They both need a good dose of DUCK TAPE over their mouths.","commenter_a":"If this wasn't an election year, the Republican's would be silent about what Ann \"the Bigot\" Coulter said. In the past she has said terrible things about Muslims, Blacks, Mexicans & liberal Women & they were silent then !!!","post_message":"Ann Coulter needs to slither back into the snakepit she came from. --Andrew"},{"comment_id":"10154555938529411","commenter_b":"Deeick Foley Kiss my Muslim American ass you scum.","commenter_a":"A failed colonial Zionists nuclear power have learned a lot and definitely exceeded the Hitlers Nazi's regime. Free Palestine. #BDS","post_message":"For those who are 'murdered with a knife in the heart it does not matter if the child is 12 or 15'"},{"comment_id":"10152931717926336","commenter_b":"They have no \"rights\" here in the US -- if they are here illegally they should be deported and if caught coming back into our country they should be put in a hard labor camp for 5 or more years --","commenter_a":"Thats all we need , one more moron!!","post_message":"U.S. Attorney General nominee Loretta Lynch said she believed in an illegal immigrant's \"right\" and \"obligation to work\" during Wednesday’s confirmation hearing."}]
