[{"comment_id":"10154315963468812","commenter_b":"Weed makes you hallucinate now? Yeah let's ask the 2 ladies who have obviously never tried it.","commenter_a":"I still don't understand how marijuana is in the same classification as heroine and LSD, even though it's helping people walk! Meanwhile Oxy is prescribed every day and it's ruining peoples lives...","post_message":"Federal authorities are reviewing the possibility of loosening the classification of marijuana, which is currently in the same class of drugs as heroin and LSD."},{"comment_id":"940585612654173","commenter_b":"Aleeyah your FB page is wacked out!! Girl I feel sorry for your kid. Get yourself some help. God don't like ugly!!","commenter_a":"Whitefolks did the same thing to Black Slaves, yes it is demonic and insanity. Look whom and what rule we have been unjustly livong under. The girl is showing the affect of what she was taught and learned from her step forefathers the Slavemasters children.","post_message":"Mother accused of intentionally setting her newborn baby on fire enters a not guilty plea, will undergo a mental health evaluation: @webpagelink"},{"comment_id":"10154230829439877","commenter_b":"@username that's horrible Florida teachers do get raises the website says the pay is negotiable but I only co-teach so my salary is non negotiable. I suppose it depends on what one perceives as good pay the teacher I work with gets grants and other stipends but she also buys many things. My aunt who's taught for about 11 years in Arkansas buys many items but keeps her recipient for discounts and tax write offs I imagine you don't get nearly back what is put in. I subbed for a little over a year and I found myself buying many items I didn't care to file on my taxes even though the district gives you that option. I understand","commenter_a":"I've worked at many schools many of them teach our babies and cannot stand them this is a fact. I will add I chose my profession after having my well behaved straight A children repeatedly coming home telling me their teacher was mean or did not appreciate their good behavior and Good citizenship. So I began to substitute and get an inside view. 68 job assignments later I saw many teachers that were jaded not just by the lack of parental involvement but by the lack of pay. I think more parents should better discipline and I also believe teachers lacked empathy and understanding. I will add prejudices and biases had a part as well. I really noticed it at mostly white schools that had few Hispanic students and it is truly heart breaking. Therefore, I am pursuing my teaching certification with everything in me to become the/an advocate for ...","post_message":"Who are we allowing to teach our babies?"},{"comment_id":"10153812349369170","commenter_b":"\"Hope\" is the refuge of somebody who has nothing substantive upon which to base what he wants to believe.","commenter_a":"Why do Christians continue to believe that they and their beliefs are entitled to special treatment?","post_message":"A group of angry atheists waged war on this town because of a touching veterans memorial. When the townspeople got wind of what was going on, they hit the atheists back HARD. This is awesome!"},{"comment_id":"1578711192434391","commenter_b":"Oh hell yes lock her up","commenter_a":"Yes","post_message":""},{"comment_id":"1084846008220301","commenter_b":"It's past time for the GOP to get behind Trump as front runner and he is not a racist the black and Mexicans are voting for him because they know the ILLEGALS are taking their jobs and we need that wall for our security and jobs for real Americans nobody wants to live off of welfare and with this core education makes it hard to get a job VOTE TRUMP 2016","commenter_a":"OK Donald and ted, you need to go to your corners and take a breath. When you have settled down you can no longer sit at the adult table. This is why we cannot have nice things, you two acting like very spoiled children. Enough of this infantile acting, are you trying to give this nomination to kasick?","post_message":"Things are about to get REALLY messy..."},{"comment_id":"10154343629676636","commenter_b":"Muslims treat you way better then any Jew would.","commenter_a":"Israelites are the best . shut up you muslim dicks","post_message":"BREAKING"}]
