[{"comment_id":"10153660734489726","commenter_b":"what a mess she is!","commenter_a":"You mean murder!!!","post_message":"WATCH: Goldberg: Planned Parenthood Founded for Abortions"},{"comment_id":"10153323281663854","commenter_b":"Only if she wants to end up 6 ft under, so he can be president again","commenter_a":"They can run together in the yard at Gitmo.","post_message":"NO JOKE: Democrats Are Now Calling for Hillary Clinton to Name Barack Obama as Her Running Mate…"},{"comment_id":"956407617772796","commenter_b":"Really?? No, really. Once again giving twits a bad name!","commenter_a":"Whites freed,WTF How many Northern soldiers had to die for southerners idea that it is ok to enslave others.Sad thing is there's still bands of ignorant racist That still feel the same way now a days.","post_message":"Leave it to two David Barton and Glenn Beck to have a historically inaccurate and completely offensive conversation about race... Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1745647555687410","commenter_b":"Julianne 😂😂","commenter_a":"Lol Luke Hargis you guys need to figure this out before moving out!","post_message":"\"I pay puppy support...\""},{"comment_id":"10153054360324411","commenter_b":"your wicked..i no longer have remorse for your kind....it is a tare...to be pulled up by the roots to be shoveled in a lake of ever lasting fire........you can't raise yourselfs up above nothing but killing......it is of old......you want this earth to yourselves.......its not going to happen...like sands in the hour glass ...........your time is short...","commenter_a":"brain washed .........or is it ..in their seed ?","post_message":"URGENT: Pakistani police use tear gas against anti-#CharlieHebdo protesters near French consulate in Karachi"},{"comment_id":"10153723307413037","commenter_b":"RideAustin doesn't even have an Android app yet. On the other hand, Fare has an app like Uber & Lyft, does the required background checks, offeres a way to schedule an upcoming ride and to choose preferred drivers....and it is all working now...as in this minute. Download the app and use me for a reference: Lynne3. @webpagelink","commenter_a":"Give our City Council a call...maybe they will give you a ride. @webpagelink","post_message":"The company says it will pay for fingerprint checks. Are you likely to give this company a try?"},{"comment_id":"964070213702162","commenter_b":"She is dumb as a fox! Crooked doesnt require brains! Just dishonesty!","commenter_a":"Ha! Ha! Poor Hilary Rotten Clinton!","post_message":"Does anyone know that Crooked Hillary, who tried so hard, was unable to pass the Bar Exams in Washington D.C. She was forced to go elsewhere!"}]
