[{"comment_id":"785040181594590","commenter_b":"Lol...let's put all small business out of business because no skill workers want to get paid what skilled labor is paid..country is going to hell and fast","commenter_a":"I don't think a fast food employee should get $15. Maybe $8 start out and earn your raise, but not $15. If you want to make money in the food industry, become a server. Yeah, we make $2.13 and hr (yes our minimum wage hasn't changed in DECADES) but I work part time for full time pay as I call it. I work 3-5 hr a day which give s plenty of family time and can make $15+ an hr from tips off the table. That is how we pay our bills for those of you who feel tipping is dumb. My $2.13 pays the taxes and the smallest check I've gotten was 10 cents, some don't even get checks.","post_message":"\"We need you out there leading the fight ...\""},{"comment_id":"1318671731495117","commenter_b":"So basically women have no rights to privacy in a woman's bathroom or locker room. So women have no rights in Washington State.","commenter_a":"They make a law for about one hundred (max) people. The Washington government doesn't think much of all the rest of the states people do they. What a waste of time.","post_message":"Big Brother is watching"},{"comment_id":"10156574233540725","commenter_b":"I say go to the debate the hell with Megyn Kelly .","commenter_a":"You can get along with Joe Scarborough, Nancy Pelosi, Harry Reid, and not Megyn Kelly.....?","post_message":"Should I do the #GOPdebate?"},{"comment_id":"10153422363668984","commenter_b":"It was a fake statement, you irrelevant moron of an actress.","commenter_a":"So you find an actress that is stupid. Duh","post_message":"One word -- wow. ADVISORY: This article contains unedited profanity and obscenity that may be offensive to some readers. Do you think Senator Ted Cruz deserves an apology from this actress?"},{"comment_id":"10152734015363525","commenter_b":"going to get cold tonight!!","commenter_a":"Wtf...???","post_message":"Road trip to Lakewood Ranch. Who's in?"},{"comment_id":"10152784784428145","commenter_b":"Huh!! Woman abuser and she's a dummy for staying with him! Jerk!","commenter_a":"I guess his girlfriend is a little thug to uhh. Wow!! It should be clear now who really was the trouble maker.","post_message":"UPDATE: Zimmerman has posted bond and is out of jail. @webpagelink #wftv A judge set George Zimmerman's bond at $5,000 and ordered him to surrender any firearms. His attorney, Don West, said Zimmerman is accused of throwing a wine bottle at his girlfriend earlier this week. #wftv Reporter Blaine Tolison is live with the latest on #WFTVatNOON"},{"comment_id":"10153253016300329","commenter_b":"I can almost guarantee that this lady is nowhere near as big as this dress makes her look. I personally think she looks pretty average. Size 12 or 14. I'm not \"fat\" but I would probably look like that in that dress, thanks to the perfect little human I made. Haha. It just isn't flattering, that doesn't mean anything about her body.","commenter_a":"The dress is not for fat people that is the issue lol","post_message":"ICYMI"}]
