[{"comment_id":"10154480756700399","commenter_b":"I really thought republicans were smart enough to see that Trump was a racist with a corrupt moron compass, and a rapist.... I was wrong the Republican Party just embarrassed the world","commenter_a":"No, there won't be a gap; there'll be a canyon.","post_message":"\"It’ll be just fine. That’s what I do. I do a good job,\" Trump said while discussing his plan to replace Obamacare. \"I know how to do this stuff.\""},{"comment_id":"10153994674826051","commenter_b":"What a sick woman!","commenter_a":"I'm disgusted at the thought of such a thing. I hope they sue.","post_message":"This 8-year-old came home from school distraught. His dad asked him what was wrong. The boy explained that the teacher had forced him to stick his head into a bucket. Dad asked: \"What was inside the bucket?\" When his son told him, he snapped."},{"comment_id":"10152952940506336","commenter_b":"Atheist uses god to make money, praise the atheist!","commenter_a":"God uses atheists to spread his Word! Praise the Lord!","post_message":"Atheist Trevor McKendrick is capitalizing on a religion that he doesn't believe in."},{"comment_id":"10153945489322522","commenter_b":"And more illegal aliens in states Trump won","commenter_a":"If the electoral College didn't exist. There would be no need to campaign outside of New York and California. The election is over. The results are in. Clinton conceded. Trump won. Move on. If America really wanted to elect Clinton, perhaps more Americans should have voted!","post_message":"It's official:"},{"comment_id":"10153363875728352","commenter_b":"We all need a break dumbass bitch but you don't see us throwing our kids out the car !!","commenter_a":"Yep she look like she need a BREAK!","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"834927826574487","commenter_b":"She's a waste of air & space.","commenter_a":"Someone said \"Free stuff\"?","post_message":"You know Queen of the 'Aisle Hogs' Sheila Jackson Lee @JacksonLeeTX18 will be there 10 hours early for her SOTU seat"},{"comment_id":"10153739914549714","commenter_b":"@username I was going to say that. Both are smokin' tho.","commenter_a":"Cara looks like a dude without makeup","post_message":"Richard Madden was pretty critical of Cara Delevingne and her cringeworthy Good Day Sacramento interview."}]
