[{"comment_id":"1195052803848081","commenter_b":"No more illegals. Go trump","commenter_a":"Trump rocks . Save Americans from drug cartels. Sanctuary citys and organizations promoting murder","post_message":"New polls show Trump is appealing most heavily to a certain kind of Republican voter."},{"comment_id":"10154194875640009","commenter_b":"This woman is a black retard, like the retarded black guy that was standing behind her when she spoke about the Kremlin invading KOREA. You let goofballs like this in a leadership position, you'll get a 3rd world country.","commenter_a":"the poor that is","post_message":"ICYMI"},{"comment_id":"10154421194676545","commenter_b":"My tax dollars sometimes pay for things I don't necessarily agree with. It's called living in society. Grow up.","commenter_a":"Defund Planned Parenthood.","post_message":"She will be the keynote speaker at Planned Parenthood of Greater Texas' annual Fort Worth luncheon."},{"comment_id":"1187509331305594","commenter_b":"She's losing Florida.","commenter_a":"She's losing in national polls !!! Americans don't trust her!!!","post_message":"Let’s think better of each other, and hold together in the face of our challenges—not turn on each other or tear each other down."},{"comment_id":"10156170333030354","commenter_b":"I think they just said on Fox and Friends he didn't want to go back to that school. They never reported any of this. The kids dad said he was not going back to that school and the president is involved so probably private school.","commenter_a":"The kid is probably probing...dont trust Muslims","post_message":"Have the media given you the police's side of this story?"},{"comment_id":"10153009343111130","commenter_b":"My mother was too. But her mother was an even bigger bitch, so I got it.","commenter_a":"My mother is a bitch!! There I said it!","post_message":"\"I realized how much the fragility and vulnerability of females is exposed fully in the mother-daughter relationship.\""},{"comment_id":"1111126252261565","commenter_b":"Bigger the caliber smaller the cock.","commenter_a":"Maybe she should just use the dildo then relax a little. Nothing wrong with open carry. All of these other campuses getting shot up didn't allow guns and that didn't work either.","post_message":"If this doesn't get people to pay attention to how ludicrous our gun laws are, I don't know what will. - Eric March"}]
