[{"comment_id":"557979804384534","commenter_b":"@username I totally agree, how can she not see that??","commenter_a":"If it makes you feel better, I'm ashamed of your actions too. Disgusting.","post_message":"Jaelyn Young broke down in heavy sobs at sentencing, saying she was ashamed of her actions."},{"comment_id":"10152475655222434","commenter_b":"This has never happened at a Steel Panther concert, little disappointed. I'm an actress and I've had people fall asleep in the front row... That was pretty funny. Also Erica, if the band were that bothered by it, they would have got security to remove them from the venue","commenter_a":"Matthew Naughton","post_message":"This woman is what the kids would call \"punk rock.\""},{"comment_id":"10154481877908411","commenter_b":"That's why she gets oaid the BIG BUCKS.","commenter_a":"Same to you and your family. Thank you for your sincerity and hard work.","post_message":"Wishing you all a safe & fun celebration as you ring in the new year tonight. Happy New Year!"},{"comment_id":"1218857281537727","commenter_b":"She is still authentically uncorrupted. may she hold on to that and help the US find itself again","commenter_a":"Could please run for president ! Please","post_message":"Education is power and to fight sexism and inequality, Michelle Obama has a message to young girls around the world. (via NowThis)"},{"comment_id":"10153963573598984","commenter_b":"Disgusting stupid females that believe that has brevetted mine","commenter_a":"And this is not their idea of hell a place of lust","post_message":"This Muslim cleric realized that female suicide bombers don't have a whole lot of use for 72 virgins... so he came up with his own reward for these \"martyrs.\" It's even more disgusting than you think it is, too."},{"comment_id":"10153648565856320","commenter_b":"Gather them up like cattle. Send them to Iran or where ever and let them find isis","commenter_a":"Just stop with the protests and move on. If they only knew how ridiculous they look continuing to honor a criminal.","post_message":" recent acts of violence will not be tolerated in a community that has worked so tirelessly over the last year to rebuild and become stronger. - St. Louis County Executive Steve Stenger State of Emergency issued in St. Louis County, Mo., as they prepare for a second night of protests in Ferguson. More Details: @webpagelink"},{"comment_id":"493286290862389","commenter_b":"Now if we could just get her to STAY in Africa. ..and her little pea brained spouse. .","commenter_a":"I believe Hillary and Bill did something similar before they left office, milked the system for all they could and stole hundreds of thousands of dollars worth of White House furniture and art work.","post_message":"First lady Michelle Obama's family trip to Africa, Spain and Morocco to promote her \"Let Girls Learn\" initiative, and cut a CNN documentary on the effort, has already crossed the $1 million mark with many more expenses still to be tabulated. According to the bills that have already come in, Obama, accompanied by an entourage that includes her mom and daughters, has spent about $1.06 million: $512,737 for hotels and $252,471 for limos and transportation. - via Washington Examiner"}]
