[{"comment_id":"517613611762552","commenter_b":"@username must be an ignorant stinking liberal!","commenter_a":"Why can,t we ban liberals ???????","post_message":"Liberals are trying to get rid of one of your favorite snacks. Stop being so sensitive. We need to put a stop to this. Do you agree Liberals pushing their beliefs on you?"},{"comment_id":"671493889666053","commenter_b":"doesn't she have a criminal record??","commenter_a":"What a moron. She's been convicted of shoplifting, and has been on welfare. Everything that comes out of her mouth is a real stretch of the truth, to put it kindly. Another one who wouldn't know the truth if it bit her on the ass.","post_message":"Oy this woman makes my eye twitch. ~tiff"},{"comment_id":"10156411867420354","commenter_b":"@username , NO MORE REFUGEES !! I DO SAY NEVER FORGET WHAT THE islamoCRAPS AND obuma HAVE DONE TO AMERICA ! PROSECUTE obuma & killery FOR TREASON !! DONALD TRUMP/CRUZ 2016 ! AMERICA NEEDS PHOTO I.D. TO VOTE , IDENTIFICATION , FOOD STAMPS , ETC ! TERM LIMITS WITH NO BENEFITS ! DRUG TEST ALL FED. EMPLOYEES AND THOSE COLLECTING WELFARE ! ABOLISH ALL GUN FREE ZONES ! IF YOU AGREE PASS IT ON !","commenter_a":"Political correctness=Nazism","post_message":"When you see the so-called \"politically incorrect\" sign, you'll instantly understand why liberals' heads are exploding...and will want to buy a cupcake from these folks."},{"comment_id":"10156046301859896","commenter_b":"Romona de Araujo Lol lol lol lol lol lol Lol lol lol lol lol lol You think someone who earned a living from porn and NEEDED TO READ A PRAYER...THE MOST COMMON OF PRAYERS... FROM A TELEPROMPTER IS THE VEHICLE TO BRING GOD BACK INTO AMERICA. OMG ...WHAT THE HELL IS WRONG WITH YOU. IN ADDITION, LET ME REMIND YOU THAT SHE HAS MADE A CONSCIOUS DECISION TO REMAIN MARRIED TO A SELF- PROCLAIMED SEXUAL PREDATOR. MY DEAR GOD WAS NOT SMILING DOWN IN APPROVAL AT MELANIA, AS SHE READ RELIGIOUS WORDS OFF A TELEPROMPTER ... HER ATTEMPT TO BRING A PRAYER INTO HER ACT ....OF ATTEMPTING TO CON US INTO BELIEVING SHE IS RELIGIOUS ....WAS A TOTAL DISRESPECT TO THOSE OF US WHO ARE TRULY RELIGIOUS AND HAVE THE LORD'S PRAYER IN OUR HEARTS AND LIVE BY THE WORDS OF THAT PRAYER. FANTASTIC....YOU NEED TO LOOK UP THE WORD ...","commenter_a":"Of course satan and his demons would be offended. I think she was fantastic!! Take God out of any country and it quickly loses it's greatness. It's about time America's bringing Him back.","post_message":"Progressive \"Love\" and \"Tolerance\":"},{"comment_id":"644944732314902","commenter_b":"Yes, she showed America just how much she loves her country, while the SLUT demonstrated her true nature as a racist!","commenter_a":"Never a real fan of Lady Gaga up until now. What a brilliant, beautiful voice. Beyonce should leave the country if she feels she must promote racism.","post_message":"Do you think Lady Gaga did a better job than Beyonce at the Super Bowl?"},{"comment_id":"1080347691985409","commenter_b":"Exactly","commenter_a":"Frankly, no matter whether the women went back to him--maybe they were screwed up emotionally at that time too--he assaulted them. It's the 21st century. Stop trying to drag women through the mud for reporting it. Choking is assault, n'est pas?!","post_message":"\"Nobody close to Jian even pretends he is innocent, and somehow this isn't an issue the women are.\""},{"comment_id":"545444305663576","commenter_b":"She will kill the U S A","commenter_a":"MORE LIES!!! Her horns are really showing out! Gggrrrr","post_message":"Hillary Clinton says that Donald J. Trump's idea of making \"America great again\" is code for \"let's take America backward.\" Thoughts?"}]
