[{"comment_id":"10152653245300671","commenter_b":"Then get off of their butts and go through and jump the hoops just like all of our legal immigrants.","commenter_a":"this is so wrong. Take care of Americans first. Illegal immigration is wrong. I don't care what country or why you came here illegally, if you were a kid you have had plenty of time to do it legally, yet too lazy......","post_message":"The Migration Policy Institute says about 1.2 million people are eligible for the plan under the DACA rules. But now many more would become eligible if the president expands the program to eliminate the age cap. That cap includes a Modesto woman who’s been in the U.S. since she was a teenager. Ron Jones has her story."},{"comment_id":"1805658249719321","commenter_b":"Me muero!!!","commenter_a":"@username tu sueno","post_message":"Watch 23 adorable pandas make their public debut. @webpagelink"},{"comment_id":"1365633703532878","commenter_b":"@username...Such a joke!!! Hillary should just accept it...it's over...Trump won!!!","commenter_a":"“Anyone not willing to accept the results of an election is a danger to democracy.” - Hillary Clinton","post_message":"As Wisconsin prepares for a recount..."},{"comment_id":"1271419419547512","commenter_b":"Lil bitch","commenter_a":"12 jurors acquitted these guys based on the lack of evidence. This had nothing to do with white privilege, they were locked up in solitary confinement while rioters get away with burning down towns.","post_message":"Heavily armed ranchers forcefully occupied a federal building in Oregon, but they got acquitted because white privilege is real."},{"comment_id":"10153702258075779","commenter_b":"Sadly, you're probably right!","commenter_a":"He has been proven over and over to be a business failure, a liar, a walking contradiction, unfit foreign negotiator, bigot, mysoginistist, nuke-happy clown! Does the man have to eat a live baby before people get the hint?","post_message":"We all know for-profit colleges are shady, but how bad can they really get? A former for-profit professor explains why Donald J. Trump's is the worst."},{"comment_id":"1210447342329069","commenter_b":"@username you are the brain washes moron if you believe the bs","commenter_a":"Of course republicans are pissed that Obama got those prisoners freed... They wanted those people to be killed thus becoming martyrs so they could use it as another excuse to go to war... And anything positive Obama does deflates their efforts to talk shit and make him look bad...","post_message":"Things just got VERY awkward for Obama's Iran critics."},{"comment_id":"10153873967388797","commenter_b":"Women want equal treatment. Then cry they don't get special treatment...","commenter_a":"The Man Should be on the Right.","post_message":"WHAT'S WRONG WITH THIS PHOTO? A picture of a couple walking down the sidewalk has sparked a heated debate on social media. What do you think? Here's why people are talking:"}]
