[{"comment_id":"10154996363431337","commenter_b":"We have a incest pedohpile leading USA. The ignorants have come out from their caves.","commenter_a":"At least he'll bring back jobs!- every ignorant trump supporter.","post_message":"Donald J. Trump really shouldn't be tweeting about nuclear weapons..."},{"comment_id":"10153868800692377","commenter_b":"Hillary is a very nasty woman!!!","commenter_a":"He can call her what she is. A nasty woman. And it's just horrible......But she can call all of us deplorables and its ok. Don't be offended.","post_message":"Donald Trump stirred social media ire on Wednesday after he said, \"We have some bad hombres here\" and referred to Hillary Clinton as \"such a nasty woman.\""},{"comment_id":"10154403521603132","commenter_b":"I haven't read the article but I believe he is saying that he feels the death of Prince is a tragic loss as was 9/11. I know I haven't stopped crying since Thursday and I never met the man or knew him other than his movies and music. He was a beautiful soul and will be truly missed. @username take things so out of context it's unreal and always have to make things a issue where they should be no issue. Prince was a sexy, talented, giving man and I know I am devistated and I am a fan that will truly miss him.","commenter_a":"Prince was an amazing human being for so many reasons, but really??? 1) Comparing his, or any singular death, to 9/11 is crazy! 2) Why is this a race issue? It's like saying that only us Minnesotans are truly grieving.","post_message":"Dave Chappelle once impersonated Prince for a now-infamous Chappelle's Show skit."},{"comment_id":"1086019278181113","commenter_b":"She's going to crush her opponent into Cheeto Dust. BYE ORANGE FELICIA","commenter_a":"BS","post_message":"Democratic presidential candidate Hillary Clinton will be speaking at an early voting rally in Cincinnati, Ohio."},{"comment_id":"10153858711711162","commenter_b":"Hell Indianapolis too","commenter_a":"They would get killed in da Chi anyways","post_message":"Illinois will stop accepting Syrian refugees in wake of the Paris Attacks... @webpagelink"},{"comment_id":"10154827367754197","commenter_b":"@username your a tart.","commenter_a":"Trump's ignorance is astounding. He should stop tweeting narcissistic nonsense and start reading the security briefings. We are the laughing stock of the world now that we elected a buffoon as president. God help us.","post_message":"Donald J. Trump is very upset with the United Nations after a recent vote. Read his comments on WFSB.com and the Channel 3 app. Then, tell us your thoughts on the statements by the president-elect."},{"comment_id":"1037969679612623","commenter_b":"Preach it brother!! Racial hangups. More racial tension in this nation since the 1960's. that is a fact. Does every speech have to include how everyone use to be slaves, so down trodden and pitiful. I know alot of blacks. They are smart, educated and are not prisoners of the past. We understand history, we know what happened. But my goodness, dont be so beat down by killary. Dont let her use you. After all, she said, \"blacks are predators and she needs to bring them to heel\". So who has racial hangupsI I'll check back for your answer.","commenter_a":"I realize slaves help build the whitehouse. Whtes also helped build the whitehouse. That would have been a good statement. Like, blacks and whites worked together to build the place where our presidents live. It was a joint effort. But as usual, race baiting and on and on about how slaves had to rise up etc... We have had a potus who has made racial tensions the worst they have been since I was a teenager. How is this unity? How have bama and shelly brought unity to our nation? More rioting in the streets more blacks killing each other, our people are fighting and against each other. So much for the legacy of the first black potus. Now they want a woman to be the nxt black potus.","post_message":"Well said, Kelly Clarkson!"}]
