[{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed. You can't see greatness at the same time you see that."},{"comment_id":"10156229104235354","commenter_b":"Kim more is nothing but a troll. But she needs to shut up and mind her on business. Dumb Limey.","commenter_a":"Piers shut up and stay in England, count all the people been kill in your own country....................................................","post_message":"See his 5 tweets."},{"comment_id":"10153113348589885","commenter_b":"A gun saved mine and my families life one night. Guns save more lives than you know . You disarm innocent people, murders will rise.","commenter_a":"This was a hate crime. We should also talk about gun control. This guy was a gun enthusiast. He killed them execution style. He had power over them. Gun power. Do you think he would have approached them if he didn't have a gun?","post_message":"A crowd gathered Thursday night at St. Louis University to pray for three young Muslims who were shot in the head Tuesday in Chapel Hill, N.C."},{"comment_id":"996230513733330","commenter_b":"Hillary would then round up JEWS if she could ... Thats been done by HITLER","commenter_a":"How big of a f-----n idiot can some one that is running for office be she is going way to for","post_message":"BREAKING: Hillary Clinton accuses GOP of wanting to implement Nazi tactics."},{"comment_id":"1243497535729399","commenter_b":"Who is this angry old lady?","commenter_a":"500,000 Women march on Washington to protest Trump becoming 45th President march today for the moral core of this nation, against which our new president is waging a war, actress America Ferrera told the Washington crowd. ..... for the moral core of this nation - most curious statement ! Both Presidents Jack Kennedy and Bill Clinton were known womanizers - both had long history of doing so Kennedy had his lovers escorted into the White House late at night while Clinton had a young woman intern give him oral sex right in the Oval office ONLY difference was that Kennedy and Clinton were Democrats while Trump is a Republican At the core of the protest is that Trump won the 2016 election in KEY states and the Democrats could not get their vote out in the KEY states Moore, Garry R - Solutions Inc","post_message":"\"Well, good did not win this election. But good will win in the end,\" Madonna delivered a fiery R-rated, anti-Donald J. Trump speech during the #WomensMarch @webpagelink"},{"comment_id":"547874932072371","commenter_b":"This bitch needs to get ready for jail!!!","commenter_a":"I think someone is throwing. Dinner !!","post_message":"WASH POST PAGE ONE SUNDAY: Hillary begins laying plans for White House agenda..."},{"comment_id":"1114940968546374","commenter_b":"One man and one woman, Not 4 men and one woman. Stone her!","commenter_a":"Maybe she have life in prison since she likes jail so much.","post_message":"This is honestly what it's all about..."}]
