[{"comment_id":"10153927132326680","commenter_b":"She is nasty","commenter_a":"I rewound my tv three times when I heard this because I couldn't believe a presidential candidate would actually say something like this.","post_message":"Donald J. Trump to Hillary Clinton: \"Such a nasty woman.\""},{"comment_id":"10154034067333701","commenter_b":"Is that a dude in drag? Or a real girl","commenter_a":"It is a bad eyebrow day.","post_message":"Court documents showed Perry had at least 15 prior criminal convictions, including five felonies and driving violations, along with a felony warrant for ID theft, methamphetamine possession and providing false information to police."},{"comment_id":"10153840747221336","commenter_b":"Let every congressman in Washington put up 10 \"refugees\" each in their own homes. The White House could take care of at least 100 of them. Just keep them out of our towns and cities.","commenter_a":"\"Stupid is as stupid does.\" - Forrest Gump","post_message":"On Monday, Governor Greg Abbott announced that he sent a letter to President Barack Obama saying that Texas will not take any Syrian refugees in light of the Paris attacks."},{"comment_id":"10154274374674445","commenter_b":"Meant north Falmouth not Nana! These txt terms get ahead of me lol!","commenter_a":"Granddaughters & sister-in-law-,law live in E,& Nana Falmouth have to check it out!, saw on local TV Chronicle last night!","post_message":"Chronicle on WCVB Channel 5 is exploring the beauty of Cape Cod. What's your favorite spot to visit each year? Watch live: @webpagelink"},{"comment_id":"10153104489209726","commenter_b":"Bring it bitch","commenter_a":"Think again ! Governors and sheriffs need to lead the people and fight federal corruption and over reach !","post_message":"WATCH: Eric Holder On ISIS: 'I Think We're Winning'"},{"comment_id":"10154137959598701","commenter_b":"Dumb tweaker bitch","commenter_a":"Debbie someone actually fell for it.","post_message":"In Case You Missed It on Good Day Oregon: A contender for world's dumbest criminal. A Texas woman fell for a police department joke: a Facebook post with a warning about meth and heroin \"contaminated with Ebola\"."},{"comment_id":"891587657549689","commenter_b":"Two bullies fightng for power all over the arab both are terrorist","commenter_a":"Saudi arabia please don't do this because you are not killing your enemy you are killing your own brother","post_message":"The Saudi King says his country’s military operations against #Yemen will continue. Three days of airstrikes have killed over 50 people, many of them civilians. What do you think about the attacks on Yemen? Join us on #presstvdebate at 18:33 GMT"}]
