[{"comment_id":"10153394971818984","commenter_b":"She is as stupid as her 2 sons. one is hell now ,, the otherone will follow .","commenter_a":"I wanted him to get life in prison I did not want him to become a martyr","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing... Do you think this Boston bomber got what he deserved?"},{"comment_id":"10153286893164032","commenter_b":"She does not have the authority to get rid of common core. That will have to go through the state legislature and governor. She's all talk with nothing to support her. She truly is an embarrassment to her job and party.","commenter_a":"Bye bye common core. It sucks. The testing needs to stay. But common core needs to be kick-booted out. Talk about lowering self esteem for kids who already struggled before with math. Always a fun time in my house with my 4th grader.","post_message":"#BREAKING: Arizona students would take fewer standardized tests and Common Core standards would be thrown out under a plan just announced by schools chief Diane Douglas. Here's a look at what else she has in mind."},{"comment_id":"1878310592388061","commenter_b":"Deport this muslim.","commenter_a":"The Quran should not be recognized as","post_message":"First Somali-Muslim Lawmaker Who Married Her Brother Was Just Sworn In, And Americans INSTANTLY Noticed What She Had Her Hand On Top Of! This is ILLEGAL! Sharia is non compliant!"},{"comment_id":"10154336382586729","commenter_b":"What a bitch...","commenter_a":"Maybe she could watch it from her prison cell!","post_message":"This woman...SMH"},{"comment_id":"10156802863905354","commenter_b":"She's def a whore! Well said","commenter_a":"Hillary is nothing more than a lying, conniving political whore.","post_message":"REVEALED:"},{"comment_id":"10153487180410667","commenter_b":"@username this couldve been you","commenter_a":"Outstanding young man and a very generous \"Thor \"","post_message":"\"I looked up at my mom and was like, 'ma, do you know who this is?'\""},{"comment_id":"10154007626519456","commenter_b":"Yea, maybe this guy is right...slaves should learn to be free if they feel entitled to it!! Bring back discrimination!","commenter_a":"Isn't the govs job to tell anyone what they have to pay anyone for services. If you don't like what you make, increase your skill set instead of having the gov hold your hand.","post_message":"The bill passed on a 71-31 vote, and will now move to the Alabama Senate."}]
