[{"comment_id":"10154629508429099","commenter_b":"Poor woman, but yet another reason as to why the elderly need to be tested at every license renewal after a certain age","commenter_a":"Poor thing.","post_message":"An 83-year-old woman died after her friend drove over her while backing out of a parking space @webpagelink"},{"comment_id":"10152751952356130","commenter_b":"Stop sending people to Portland! #dontmovetoportland","commenter_a":"Esther Payne","post_message":"Is your city on the list?"},{"comment_id":"589266911222085","commenter_b":"I'll say it to your face, tough guy...but we all know that a pussy like yourself will never deliver!","commenter_a":"A lady I worked with told me the closest thing to a lesbian experience she ever had was kissing, a liberal beta male on a dare!","post_message":"This is just the best!"},{"comment_id":"1329423637100902","commenter_b":"She owns them.","commenter_a":"Ivanka you rock and you are a great representative of a Jewish woman and princcess and MOm . G-d bless you and your family .NOOne has a perfect family and you exemplify derecho eretz.","post_message":"LIBERALS HAVE CONCLUSIVELY PROVEN DURING THEIR ELECTION MELTDOWN THAT THEY ARE THE SCUM OF THE EARTH!"},{"comment_id":"1339410646123872","commenter_b":"Now I'm calling her a turkey! At least she could've let us see the eggs before she got comfortable again","commenter_a":"Somebody say bugs","post_message":"EAGLET WATCH! Getting closer, it could be any time now! We are watching and waiting as mom (Harriet) and dad (M15) take turns incubating the two eggs. Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"10152886018669091","commenter_b":"Jaaajaj buena idea","commenter_a":"She can move to another planet . I really dont care","post_message":"\"If this happens -- I am moving to Canada. The CEO of a company is getting attention for a controversial Facebook post, where she says that female shouldn't be president.\" Here her reasoning: @webpagelink"},{"comment_id":"10154302176821491","commenter_b":"Duchess Aungelique GauBrielle You're officially crazy. Added, this is one man's personal experience as well to be fair...","commenter_a":"In all honesty, this sounds like a disgruntled employee... all of the African Americans employed, & previously employed at Versace... he's the only one to disclose this... people buy into anything where race is concerned. I'm African American, I shop high end... I've definitely experienced Racism while shopping, but I could literally count the incidents. Racism is very real, but it's being used and over used to justify everything! However, if this is true, why did he wait until he was fired to speak up. Also, why have none of the other African American employees past or present come out to support him?","post_message":"The store employees were taught during training to say \"D410\" whenever a black customer entered the store, according to the lawsuit."}]
