[{"comment_id":"10152828817287426","commenter_b":"Omgosh..I am not a violent person..BUT I would beat the Sh** out of that woman....first of all...I NEVER gave into my kids when they threw fits...that's how they learn to NOT get what they want all the time.....This woman is sick sick sick....part of parenting means to not give in..","commenter_a":"@username U seen this uet","post_message":"“There’s nothing wrong with that child, it just needs to be beat,” the woman, who claims to be Kathleen Smith, said in the video."},{"comment_id":"10151088515799999","commenter_b":"Such a misogynist!","commenter_a":"I was at Smith College when Maher came and spoke in the late 90s. His contempt for women was palpable. Not a surprise that he feels avuncular towards Milo. Once you accept it is okay to dehumanized one group, it is just a hop skip and jump away from demumanizing anyone.","post_message":"Bill Maher's interview with Milo Yiannopoulos was a mostly chummy affair. Then in a segment that ran after the broadcast, Yiannopoulos attacked transgender people."},{"comment_id":"10155779429195389","commenter_b":"Yep all she would be is loose end","commenter_a":"She is a real winner, did she think she was gonna hook up with these guys? All she would be is a witness, I cannot fathom how stupid some people are!","post_message":"BREAKING NEWS: New York state prison employee Joyce Mitchell has been arrested on felony charges for providing material assistance to prison escapees, state police say. @webpagelink"},{"comment_id":"482004281990152","commenter_b":"Muslims are breaking our laws. Take down the sign and let muslims know that we have our own laws and as Americans we do not recognize sharia law.","commenter_a":"Shoot them all..","post_message":"First our schools, then our public areas, what's next? 'SHARE' this post, we have to let the nation know what the MSM won't. Do you agree Shariah must be stopped?"},{"comment_id":"10153149917160667","commenter_b":"@username And I should lose my right to own gun's because of what he and a few others have done? Not going to happen.","commenter_a":"We have to stop this hate Americans have towards Muslims all bc of some crazies. I mean heck go read on Christianity through the years and check out what they've done!","post_message":"#HokiesDontHate is being used in a campaign by Muslim students to \"extinguish ignorance\" on campus."},{"comment_id":"10154959437824369","commenter_b":"If I was impregnated by my rapist, I can assure you that I would not be having that child!","commenter_a":"Again, this does not make exceptions for rape. Also, the only people getting abortions at that stage are women whose lives are in danger or something is terrible wrong with the fetus. This is more unnecessary legislation.","post_message":"Abortions would be banned after 20 weeks under a bill Republican lawmakers hoped to pass Wednesday"},{"comment_id":"10153186932521167","commenter_b":"Women who watch faux news confuse me","commenter_a":"Brittany Shelton OMG!","post_message":"We were going to do a \"Top 10 Awful Displays of Sexism on Fox News\" video, but the clips just kept rolling in. Here are 70:"}]
