[{"comment_id":"1029861463715941","commenter_b":"You are wrong about Cruz but, everybody has their own thoughts but if you want a change then start listening to Senator Ted Cruz.","commenter_a":"Who?? Never heard of this guy! Looks like he never heard of a shower? Regardless, I will not vote for Rafael \"Ted\" Cruz, who has only been in this country since 1974!!","post_message":"OFFICIAL ENDORSEMENT... This changes everything!"},{"comment_id":"1229145840456983","commenter_b":"Clinton can't tell the truth! Can't remember her lies ! Gives her daughter 1,000,000$ a year of stolen money gained from corruption even year making Chelsea an accomplice ! As well as an accomplice to her email crimes! Arrest them all 2017!!!! Obama and Clintons open boarder policy and the invasion led by both to destroy America while millions come their way ! A record number of illegal aliens penetrate our wide open borders and manipulate a dysfunctional visa system, the boys now urinate in the girls bathroom if they identify as a female, the growth of Islam in America is unstoppable, the debt is so high the number appears fake, the shrinking of the military is sickening, veterans are killing themselves at alarming rates, the war on cops is an epidemic, we back to segregating college campuses, Obamacare is worse than what we had before it was a law, ...","commenter_a":"Hello she bed IP with people ehp kills hays","post_message":"She is the LAST person in the world who should be lecturing anybody about respecting anybody's rights, with her own HORRIFYING connections..."},{"comment_id":"10154589081180586","commenter_b":"@username YOU ARE A BRAIN DEAD MORON","commenter_a":"Here's the thing- There are plenty of us voting for Hillary, we just don't find the need to scream about it all day long, ya know? And maybe we don't put up signs because we know the kind of needless drama it will start with any childish, loose cannon Trump supporters that happen to come across it... The Hillary supporters are here, we're just too busy working/paying taxes and rocking the good life to yell it from the rooftops everyday...","post_message":"Another national survey shows Hillary Clinton and Donald Trump in a near-even race in the final weekend before Election Day."},{"comment_id":"10153625218767464","commenter_b":"That was their land. The other middle eastern countries opened their jails and put those people there to taunt Israel. Know your history if you're going to insult a Nation using their systemic slaughter as a punch line.","commenter_a":"The genocide of the Jews does not justify hem killing the Palestinians. What's the difference between a cow and the Holocaust? You can't milk a cow for 70 years.","post_message":"I'm proud to stand with PM Benjamin Netanyahu - בנימין נתניהו and the nation of Israel. LIKE if you are too!"},{"comment_id":"10153937473666336","commenter_b":"Michell is NOT a woman.","commenter_a":"PU$$ Y !!!","post_message":"\"You help keep us free. You help keep us strong. Whatever service you're in, whatever branch, we are extraordinarily grateful for everything that you do every single day.\" – President Barack Obama"},{"comment_id":"10154589059624087","commenter_b":"If you look real hard you may find your own identity or Soros'","commenter_a":"Questions: How many states do we have? What was actually written on that red, plastic button your mommy brought to Russia to reset our relationship? Did the crippled man Biden ask to stand up ever...stand up? What exactly is a CORPSEman? Hmmmmm....perhaps you should stfu?","post_message":"\"What happened in Sweden Friday night? Did they catch the Bowling Green Massacre perpetrators?” Chelsea Clinton tweeted."},{"comment_id":"555137491342104","commenter_b":"HELLARY ROTTEN CLINTON IS A SEXUAL PREDATOR AND A RAPIST CRY BABY","commenter_a":"We won fairly and stop saying it was the russians and trump. Stop filling your head with media lies","post_message":"WATCH LIVE: Members of the Electoral College in Texas gather at the statehouse in Austin to vote for the president and vice president of the United States. One Republican elector, Chris Suprun, has revealed his intention to vote for John Kasich instead of Donald J. Trump."}]
