[{"comment_id":"1115117555187217","commenter_b":"Jette de Vries","commenter_a":"Nathalie Baranke","post_message":"If you have a cat you should do this immediately. (Via JukinVideo )"},{"comment_id":"1022963947726395","commenter_b":"are all lesbians feminists?","commenter_a":"Fat shaming is a hate crime.","post_message":"A disgusting new low."},{"comment_id":"775477502501275","commenter_b":"I agree with Mark Colwell.one muslim won't go against the other.they are all for crap..","commenter_a":"Gee, really, and what would they do if he made them angry? Another Dem moron speaks in defense of her Beloved Leader and what she says is as stupid as they both are. How do these people get through even elementary school being this dumb?","post_message":"And this is what Democrats think about terrorists... #facepalm"},{"comment_id":"924764137560927","commenter_b":"Yes, because lesbians can't be impregnated by gays.","commenter_a":"remember as well folks that homosexuality is a societal and evolutionary dead end.","post_message":"“This is something we should be applauding.\""},{"comment_id":"10152776226595047","commenter_b":"stupid anti Christians !","commenter_a":"Can't let them get away with this.","post_message":"General Craig Olson thanked God for his military successes, and asked for prayer for those being deployed at a National Day of Prayer event. Because of his public declaration of his beliefs, an anti-Christian group is demanding he face a court martial. This is outrageous. SIGN & SHARE the petition to fight back: @webpagelink"},{"comment_id":"1403734329688680","commenter_b":"these mobs are planed and paid for by the elites and must be stoped","commenter_a":"These people need to be arrested. This is not peaceful protest. It's criminal.","post_message":"BREAKING: Trump Official RUSHED To Safety After What Mobb of Attackers Just Did To Her Outside Child School"},{"comment_id":"10152965357956336","commenter_b":"Lets face it, the ppl this upsets the most are the females that could never pull it off.","commenter_a":"I think all you who say it's too far are the same ones waiting for fifty shades of grey.","post_message":"Did Sports Illustrated Swimsuit go too far this year?"}]
