[{"comment_id":"881915648510562","commenter_b":"Bitch you wanna get arrested????","commenter_a":"@username we talked about this as well","post_message":"The dark history of why cocaine is illegal... (ATTN: is excited to launch a new series about the history of illegal drugs)."},{"comment_id":"10153462530999255","commenter_b":"The Chinese will be happy to take its place!","commenter_a":"Is that dog shittin in the flag. Thats just wrong just wrong.lol","post_message":"You don't see Nazi memorabilia on the Antiques Roadshow for a reason."},{"comment_id":"10154614760931077","commenter_b":"Only a nasty hateful woman would write this. Pathetic!","commenter_a":"what a nasty hateful woman she is.:(.","post_message":"There were visible awkward moments during the meeting of the two families."},{"comment_id":"10153460687383598","commenter_b":"Wretched evil vile women","commenter_a":"These sick people are going to BURN IN HELL","post_message":"NEW VIDEO: Planned Parenthood official caught selling aborted baby's eyeballs"},{"comment_id":"10153949819826770","commenter_b":"Trump is not against Muslims. He wants Muslims coming into the country right now to be stopped and vetted completely with what is going around in the world. He wants all the law breakers in the country that are illegally gone. And its not just them it means everyone for now till we can get a handle on jihadists trying to come in to the country. What is wrong with that!??","commenter_a":"A woman protesting in New York City just said she was protesting because Trump doesn't represent her beliefs! Well that's why we had an election yesterday and America spoke clear and loud that they were fed up with the way our country was going. The American people are tired of the murder of our unborn children. We voted!! The American people are tired of people who don't work being rewarded while people who do work are being punished. We voted!! The American people are tired of activists judges making new laws without the approval of we the people. We voted!! The American people are tired of foreigners being treated like first class citizens while our veterans needs are put on the back burner. We voted!! The American people are tired of our enemies disrespecting us. We voted!! The American people are tired of our policemen and other law enforcement people ...","post_message":"Asra Nomani is sick of the \"liberal honor brigade\" turning a blind eye to radical Islamic terrorism..."},{"comment_id":"10154362181546077","commenter_b":"Put her in jail","commenter_a":"Go Trump!!","post_message":"Donald Trump rally live in Greeley"},{"comment_id":"10154136530601509","commenter_b":"Ignorant woman!","commenter_a":"Botate a la verga pinche paisana que te deporten por pendeja y regresate a tu pais pinche ignorante andas apoyando a trump y ni hablar ingles sabes se te nota lo paisana desde lejos","post_message":"The Donald J. Trump superfan, \"I saw Mr. Trump only in my dreams\" @webpagelink"}]
