[{"comment_id":"10154015099517885","commenter_b":"So sad i am sure they will love that thight brown hole in prison be a man not a fallower make something of your life","commenter_a":"Then we will finnally get rid of all gang bangers","post_message":"We couldn't make this up even if we tried!"},{"comment_id":"10153482895003908","commenter_b":"Diet is unhealthy less u r a ufc fighter needing to perform at peek potential. Im more ripped than 85% of ufc fighters cause i burn more calories than i ingest..","commenter_a":"Absolutely true!","post_message":"A powerful ad exposes everything that's wrong with the diet industry in just 31 seconds."},{"comment_id":"10153181309551350","commenter_b":"Sebrina Butler cute comments here. Marcella McFadden","commenter_a":"Breast feed, breast feed! Just do it! It's best for the baby's immune system.","post_message":"What do you wish you'd known before you had your baby? Read the top responses so far and join our new TODAY Parenting Team, sponsored by Johnson's Baby, to share your advice. @webpagelink"},{"comment_id":"10154022766707693","commenter_b":"Another idiot spending American tax dollars to pay for illegals to be here with American tax dollars. And when they commit a crime. They will use American tax dollars to house and feed them in jail and to pay for their attorneys.","commenter_a":"😜 I'm sure President Trump is scared...","post_message":"BREAKING: Washington State Attorney General Bob Ferguson announces that he will file a federal lawsuit in response to President Donald J. Trump's travel ban."},{"comment_id":"935633429829739","commenter_b":"No woman EVER asked for it.","commenter_a":"Of course her clothing doesn't mean she wants it. But, if she wears something low cut and is hanging those ta-tas out.... then she should not care, not get mad if guys look at them.","post_message":"Women prove that no matter what they are wearing, they are NEVER 'asking for it'"},{"comment_id":"10153578491758984","commenter_b":"Let's ban ass holes","commenter_a":"He's the WORLDS biggest idiot,instigator, racist that ever walked the planet... Al you gotta go!","post_message":"Reverend Al Sharpton just announced his huge plan to destroy Kid Rock's concert tour, and it's absolutely sick. Kid Rock will NOT take this lying down. Sharpton has no idea what kind of war he just started."},{"comment_id":"1109408939099898","commenter_b":"yaaaassss bitch yasss","commenter_a":"Angela Swartzel Melinda Bailey Mallory Brogli Chelsea Pande Roma Rispoli Kunia Rodrigues Carmel Rae Anne Mellies @username Jackie Smith fucking dyingggg😂😂😂","post_message":"That Voice Over! (Free The Monkey Though)"}]
