[{"comment_id":"10154941014182577","commenter_b":"Lies and fear. Lies about money and fear of foreigners. That's it.","commenter_a":"How was Nigel Farage's march?","post_message":""},{"comment_id":"10154202048116336","commenter_b":"piss off, Dirty Mary. We're having fun!","commenter_a":"Who cares lol. We have terrorist cutting people's heads off and we are freely bringing them HERE to America and your talking about this nonsense? Wow!","post_message":"Miranda Lambert brought a date to the ACM - Academy of Country Music Awards! Lambert, who split with husband Blake Shelton in July, brought her new boyfriend Anderson East. @webpagelink"},{"comment_id":"10154260147516051","commenter_b":"@username you ignorant bitch !!! If the illegals voted and they can't vote then how did they vote if they are illegals ????dumb ass !!! You racist ass bitch !!!","commenter_a":"The majority of Americans elected Mr Trump. Millions of Clinton votes were cast by illegals who had no right to vote. You people need to respect the process and get over it","post_message":"The majority of Americans dispute Trump's right to rule since he lost the popular vote by almost two million votes. Do you think the candidate who gets the most votes should win?"},{"comment_id":"884089625114947","commenter_b":"Well pack up lady!","commenter_a":"And just how they all accuse others of lies. Well i dont see any of their fake asses leaving","post_message":"Hey Barbara, we'll help you pack. See ya, never!"},{"comment_id":"10154609834091336","commenter_b":"I wonder where the laptop and hard drive went?","commenter_a":"Was there ever a doubt Hillary could be trusted. She can't even tell the truth about being sick. She's totally unethical and should never be allowed anywhere near the white house","post_message":"\"Mrs. Clinton delegated her legal security obligations to others. Those obligations to protect official Americans overseas, and especially in Benghazi.\" Gregory Hicks, the former Deputy Chief of Mission for Libya in Hillary Clinton's State Department, said he believes she cannot be trusted with our national security."},{"comment_id":"10153324088600736","commenter_b":"Having a girlfriend costs alot more than a hooker","commenter_a":"You would think that even the ugliest of men can get a girlfriend without having to pay for one...","post_message":"The man showed up at the police station \"much to the bewilderment of those in attendance,\" West Linn police said."},{"comment_id":"10153516438828487","commenter_b":"Shut up douche bag .","commenter_a":"Everything and everyone is interconnected in this economy. To say the NYSE had a series of computer glitches is to mislead the greater public and further cover up the truths behind the shut down.","post_message":"On Wednesday, technological glitches shut down the New York Stock Exchange and grounded thousands of United Airlines flights."}]
