[{"comment_id":"10152474320835927","commenter_b":"The ones I know aren't allowed to voice an opinion.","commenter_a":"The rest can't say anything 'cause they're still in boot camp.","post_message":"Does President Obama deserve this low approval rating for military personnel? Leave a comment... Read More: @webpagelink"},{"comment_id":"10153805413233352","commenter_b":"There is no such thing as going to far I would do the same shit....I'll kill a little bitch or nigga that lay a had on my child....no matter your age..or gender..daddy got your back....","commenter_a":"And???","post_message":"Shocking moment angry dad ‘tried to run over a group of teens for bullying his 13-year-old daughter’"},{"comment_id":"460063127508901","commenter_b":"I bet the GOP hate her since she actually has a heart.","commenter_a":"Well said","post_message":"Wow is right."},{"comment_id":"1095905513769436","commenter_b":"But he couldn't get our marine out of Mexico, anybody had enough","commenter_a":"i do not believe that he was ever a prisoner of the taliban. he was working with them","post_message":"#Bergdahl wasn't just a DESERTER who left our side; he was a DEFECTOR who joined the other side!"},{"comment_id":"1136778326378278","commenter_b":"Mizo I am not shia. But i am sure shia love this place aswell I can never imagine they can do this cowardly act it is time to hug each other regardless of there beleive let Allah to decide and guide us all the ryt path. I am in the favor of a united muslims across the world regardless of there beleive. Muslims getting butchered across the world. Innocent children women are getting bombed every single day. For God sake be united. May Allah protect all the muslims across the world.","commenter_a":"inshallah everything would be alright because the Angels of Allah look after our prophet house so I have suggest to King of Saudi to whip Shia from Saudi Arabia to somewhere else","post_message":"It exploded near the Prophet's Mosque, one of Islam's holiest sites. Update at 23:00 BST: Interior ministry has confirmed four security officers have been killed and five others injured."},{"comment_id":"1145540435508072","commenter_b":"No job , 6 kids , no husband . Stop !","commenter_a":"Waited in line for six hours if you would've been working kids would've ate","post_message":"Entitlement Mentality: Welfare Recipients React to Food Stamps Being Cancelled. This shows everything wrong with the entitlement mentality."},{"comment_id":"10153285470317994","commenter_b":"Rights? RIGHTS? LOL.","commenter_a":"If the son paid for them he had no right. If he paid for them then the joke was on him.","post_message":"Kurin Keys just got his pair of Air Jordan 11. He also just got his grade card and it wasn't good."}]
