[{"comment_id":"10156049439790725","commenter_b":"because we know how to build stuff that's why..... Why u think Latinos rule the construction industry?? Lol... Really building a wall huh? Who u guys going to get to build the wall?","commenter_a":"What about the fence the Mexicans put up to keep People from Guadamalia out> If it works for them why not for us??","post_message":"For those that don’t think a wall (fence) works, why don’t they suggest taking down the fence around the White House? Foolish people!"},{"comment_id":"10153757238999411","commenter_b":"Maria J Haloho A slut will be a slut anywhere","commenter_a":"Most Arabs are depraved sexual predators.Anyone who has ever seen Arabs on holiday in a European country can confirm that","post_message":"'Obviously neighbors aren happy about it, but it is what it is'"},{"comment_id":"10153352524191179","commenter_b":"B**ches","commenter_a":"No class!...it really starts at home","post_message":"Arizona high school students' racism even offends Arizona"},{"comment_id":"1726500120946412","commenter_b":"I'm not really sure why anyone would vote for that scandal ridden woman, but hey you got this little buddy.","commenter_a":"I did vote for U.S. Senator Bernie Sanders to win, but I not upset that my choice did not win, no, I let Democracy decide on that, and I am proud to vote for Hillary as our first female president. Everyone Rock the Vote!","post_message":"So much for party unity."},{"comment_id":"10153866620387869","commenter_b":"Leave, sissy boy.","commenter_a":"I like @username but I get the impression this is just a propaganda page. Guess I'm out of here.","post_message":""},{"comment_id":"10153086832391051","commenter_b":"She looks like she is fat enough to go to HELL, sweathog","commenter_a":"Well damn i'm moving over there wht","post_message":"This woman killed someone. She says she doesn't belong in jail for one reason and one reason only."},{"comment_id":"10153478399867993","commenter_b":"Do it already.","commenter_a":"What are you waiting for? Her to be elected???","post_message":"Judge suspects ‘bad faith’ from Obama administration on Hillary Clinton emails, threatens subpoena to force former Secretary of State to turn over entire email account."}]
