[{"comment_id":"1095090630555419","commenter_b":"Leave then lol i did","commenter_a":"Chicago is the worse place to live it's sad I fear for my child and don't want her outside because there's so many shootings each day","post_message":"WOMAN SHOT AT STOP LIGHT: A 24-year-old woman has been shot multiple times while at a stop light at 71st & Wentworth in the Englewood neighborhood. It happened just after 11 p.m. The car she was driving ended up coming to a stop in a grassy lot with its driver side window shot out. She is being treated at Christ Hospital in Oak Lawn where Diane Pathieu ABC7 joins us live with the latest."},{"comment_id":"1388401547878144","commenter_b":"They ain't people fuck em and their cars","commenter_a":"Even if its a serious rush it doesnt give them the right to fkin hammer through like that, imo. Yes they should move over more than they do, but to run into every car they can is idiotic. Shows the disrespect of people even if some may be the enemy, everyone isnt","post_message":"More throwbacks at > Afghanistan Combat Footage - Funker530 You think you know road rage? ~Josh"},{"comment_id":"1012689648797790","commenter_b":"Lmao she getting that good shit. 😂😂😂😂😂","commenter_a":"Leslley Santana Raudel Flores","post_message":"She's not ready for a tattoo"},{"comment_id":"1183538221666206","commenter_b":"Now his mother is going down. Lol","commenter_a":"They have the wrong MAN!! Texas has executed many people because they are known to railroad!! We need to donate to the mans defense.","post_message":"The mother of the suspect in the execution-style killing of Texas sheriff's Deputy Darren H. Goforth said her son can't be the gunman because he was out shopping with her at the time."},{"comment_id":"712497285538613","commenter_b":"Islamists radicals are killing muslims every day in irak, syria etc! Its about thousand and thousand and for no reason! Israel, when attacked, its only to defend itself! As any country would do!","commenter_a":"Jewish extremists burned a kid alive too. Just stating a simple fact.","post_message":"Netanyahu: ISIS burns people alive, Iran hangs them in city squares"},{"comment_id":"1011733118888805","commenter_b":"Amen to that our children come FIRST","commenter_a":"So sad.","post_message":"We have NO ROOM! We need to take care of Americans first and make our country GREAT Again!~ FOLLOW US---> Freedom Daily"},{"comment_id":"10153253749121800","commenter_b":"Heard this on 98 rock on way to work....halliarous!","commenter_a":"Masoud Jalali","post_message":"\"To be clear, a guy on CNN just said, 'Hey, if people are looking for news, I'm sure they can find it somewhere.'\" -- Jon Stewart"}]
