[{"comment_id":"10153160535761491","commenter_b":"Shes nowhere close to finny. Shes more along the lines of annoying.","commenter_a":"Non stop coverage of Amy Schumer won't work. She's still not funny.","post_message":"\"Amy and I were creatively made for each other,\" Jennifer Lawrence said."},{"comment_id":"960454674002831","commenter_b":"I agree and anyone with a brain knew what the little guy was doing. Your business and the buck stops at the top. But Rubio wouldn't know about a business or for that matter what it's like to take a job and show up to work! Only be a puppet whipping boy for the old lifetime old farts on the hill. Look on line about Rubio and pulling strings to help his drug dealing brother in law? Check it out! This is the jurk running for the top office? Or any office! What a joke and a choker! Did I get it right little man that sweets like a pig?","commenter_a":"The true story... Trump did not know the Sub contractor hired the polish workers but settled it anyway and took responsibility even though it was not his doing.. Rubio and Cruz are the con-artists and the liars. Typical politician bull-crap. @webpagelink","post_message":"MARCO-BOT is back!"},{"comment_id":"10153689322651162","commenter_b":"Typical female cant let another female live. Lol","commenter_a":"Stupid a@@! She probably walks faster than the Barbie Jeep.","post_message":"WOW: A 20-year-old college student's license was suspended when she was busted for a DUI... So she decided to get around campus on a Barbie Jeep instead: @webpagelink"},{"comment_id":"971095776261096","commenter_b":"#CottonCancer","commenter_a":"NO! I don`t even like Corn when it is too sweet,so i know i would not like fruit that is...and it cannot be good for us.","post_message":"Yes, \"cotton candy\" grapes are a thing."},{"comment_id":"10152979046217690","commenter_b":"Hoes","commenter_a":"Looks like that abstinence only thing isn't working out so well.","post_message":"At least 20 cases of chlamydia have been reported at a small West Texas high school. @webpagelink"},{"comment_id":"800358286665935","commenter_b":"Shutup you cornballs","commenter_a":"Fundamentalists linear thinking both secular and religious can't enter the narrative. A generation that cannot discern connotations and denotations. We are in an intellectual and spiritual decline. Stupid stupid mobs","post_message":"This thug should have just obeyed the damn law! Read why Jesus lived in a police state: @webpagelink Crimes he committed: illegal fishing, loitering and homelessness, feeding people without a permit, not caring about paying taxes, whipping corrupt bankers, inciting insurrection, claiming to be above the empire."},{"comment_id":"788206447982585","commenter_b":"The trump train is heading for the trump wall. toot toot.","commenter_a":"Hurry Hillary call Wall Street call @username call AL Sharpton because your gunna need all the help you can get. The Trump Train is rolling straight for the White House !!!","post_message":"Hillary Clinton and her allies are preparing for the fight against Donald J. Trump."}]
