[{"comment_id":"495141487277558","commenter_b":"And you do? Cause your so fucken righteous and enlightened?? Get the fuck out of here it's called war we didn't start it but we damn sure finished it fuck them! They killed our people, we killed theirs.","commenter_a":"So your all saying they blew up a few ships of ours and that justifies nuking a whole city your all a bunch of in breed morons that lack logic and intelligence and have no awareness of the real world around you","post_message":"Since the bombs were dropped, the U.S. government, U.S. high school history texts, and the American public have asserted that dropping the bombs was necessary. But is that really the case?"},{"comment_id":"10153648598172894","commenter_b":"Where's your daughter? Dummy","commenter_a":"Shes already A Mother. Didn't she give her first daughter Away?? 🙈🐸🐸🐸☕☕☕☕","post_message":"Confirmed: Janet Jackson IS Pregnant, Expecting First Child with Husband Wissam Al Mana"},{"comment_id":"887531464615283","commenter_b":"Sorry Derek grammar police ! What a bitch seriously piss off","commenter_a":"This is why they have gay wrights and the rebel flag in the news to distract u from this been trying to tell u police state !!","post_message":"This story is going viral right now. Read the details of the case and ruling and you'll understand why. @webpagelink From (Y) Counter Current News - MBD"},{"comment_id":"1049253181797877","commenter_b":"So HRC YOU WILL NEVER WIN CALIFORNIA @webpagelink","commenter_a":"Hillary,we want you back at the White House!!","post_message":""},{"comment_id":"909973475802498","commenter_b":"When someone becomes president, their immediate family (wife and kids) need to be a good influence on the rest of the country.","commenter_a":"I'm for legalization personally. But until it is I follow the law.","post_message":"Oops?"},{"comment_id":"10154071724086320","commenter_b":"she is an amazing woman with a wonderful gift of talent","commenter_a":"I loved it","post_message":"Watch and see why everyone was crying after Kelly Clarkson's emotional performance on last night's \"American Idol.\" @webpagelink"},{"comment_id":"10154778794215470","commenter_b":"@username Get her to California!","commenter_a":"All I know is that my American dream was quite shattered when I was thrown out of my job after three decades because I was labeled \"old\" (over 50) and insurance premiums were too high, so I was replaced by four cheap employees. Who was protesting for me? Middle class dreams have been more than shattered - we are the poor working ourselves to death to pay for the poor that don't want to work?","post_message":"\"My story will be much like others who dedicated their lives to their dream — the American dream — and whose intentions and lives were turned upside-down on Friday without notice or reason.\""}]
