[{"comment_id":"1786411671679890","commenter_b":"Fucker","commenter_a":"@username sheep bitch","post_message":"100% accurate!"},{"comment_id":"10153408842481162","commenter_b":"Beautiful and God BLESS you both!!!","commenter_a":"Wonderful","post_message":"BEST. GIFT. EVER! Steven Turner Jr. was set to walk across the stage at his high school graduation, when there was a pause in the ceremony. \"I got really worried and nervous, I thought she forgot my name,\" Turner said. But on stage there was more than his diploma waiting for him. His mom, Petty Officer 2nd Class Vera Turner, surprised him with open arms. She had been deployed with the Navy for the past 9 months, and returned home just in time to see her son graduate. FULL STORY: @webpagelink"},{"comment_id":"541079112748211","commenter_b":"Well then lady's better take another look at HiLAIRy nothing respectable there","commenter_a":"Both Hillary & Donald Trumpet don't belong as our President! Trumpet definetely can't be our President. He's full of so much anger & rage! Lord help us all! And, with Hillary, we risk open borders & even bigger issues with illegal immigrants! Our poor country doesn't stand a chance with either candidates! I don't trust either candidates!","post_message":"WATCH: Undecided voters describe Donald J. Trump and Hillary Clinton's debate performance in one word. #FoxNews2016 #Debates2016 How would you describe their performances? @webpagelink"},{"comment_id":"870966692926187","commenter_b":"GIRL BYE","commenter_a":"I don't blame her for not wanting to call him. She hasn't spoken to him for a reason. Probably the same reason why Lisa Bonet and God knows how many other members from the cast have not! She should not have been fired for that.","post_message":"Keisha Knight Pulliam Fired From Celebrity Apprentice For Not Contacting Bill Cosby For Fundraiser @webpagelink"},{"comment_id":"222401854833654","commenter_b":"Build the wall","commenter_a":"Say it to mexico, who build the wall with...? u know the answer, and it turned up very good, no illegal immigration and less crime , Israel built the wall too, and no muslims terrorist attack, bulgaria and hungary have kinda wall/fence, and no attacks, there you go...","post_message":"Those who don't know history are doomed to repeat it Details: @webpagelink #BerlinWall | #TrumpsGreatWall Join Us The Free Thought Project"},{"comment_id":"1181889591889575","commenter_b":"Disgusting, disrespectful pigs. They should kiss the ground they walk on and be grateful to be here instead of the hellhole they came from. However, maybe they should go back. They laugh at us, the stupid Americans that clothe and feed them not to mention housing and oh yes, the free education!!!!! Filthy people.","commenter_a":"Go away...","post_message":"A Muslim family is going viral in a bad way after they made a SHOCKING move while the National Anthem played... this is NOT good. Now that the video is out, they probably wish they had never done this..."},{"comment_id":"10154014597174203","commenter_b":"Lise stfu","commenter_a":"How about a story on the hundreds of black-on-black murders in Chicago every year...","post_message":"He planned to bomb black churches and Jewish synagogues."}]
