[{"comment_id":"538992992891961","commenter_b":"Girls are just mean....need to face murder charges....they need the death penalty....need to be tried as adults","commenter_a":"They should all get life","post_message":"Three high school girls in Delaware are facing criminal charges over the fatal beating of a classmate inside a school bathroom last month. What could have caused them to do this?"},{"comment_id":"10153727750436336","commenter_b":"You do realize that without spiders the world would be overrun with bugs which do a lot of damage to the earth if not contained","commenter_a":"This happened to me before when I was a kid, I was riding my bike branch hit me by my ear. Felt something weird went to the bathroom spider came out half way to say \"hi\" then went back in when I screamed for mommy. Went to the doctors then I lay down and the spider came out itself! And yes I killed it with my bare hands!!","post_message":"Each attempt doctors made to remove the spider caused it to react violently, but they eventually were able to subdue the insect with medicine and pull it out with tweezers."},{"comment_id":"10153465651246545","commenter_b":"She Have to have police officers to work security. That's a city ordinance. If police don't work the event, her show will get cancelled. I think It will blow over tho and she'll be ok...","commenter_a":"I will say one thing...Police or No Police. The show will go on and will be sold out. So she is winning either way. So for those that are calling her racist. Why would all nationalities join in on the hate monger party and pay for a ticket. IJS","post_message":"The president of the Dallas Police Association said Saturday his group is not calling for a boycott of working security for Beyoncé's May concert at AT&T Stadium. However, he also said he wouldn't be surprised if many Arlington officers chose not to work the event."},{"comment_id":"970626379645816","commenter_b":"#Ansab go back to your history, that land is promised land to Israel by God. Israel made mistake coz God told them to kill anybody who will be in that land but due to kindness of Israelites now they are suffering with these Palestians cursed tribe. Land of Canan belongs to Israel coz is promised land","commenter_a":"Palestinians they deserve to be killed by Israel because of their provocation. No mercy to Palestinian death","post_message":"More than 60,000 people in the UK have so far signed the petition calling for Israeli Prime Minister Benjamin Netanyahu to be arrested for war crimes against Palestinians when he pays an official visit to Britain next month. Read here: @webpagelink"},{"comment_id":"669424226515949","commenter_b":"lol anybody can change it to anybody wiki is less secure than pussy around trump","commenter_a":"Ben Ellison thought you might like this","post_message":"So, this happened yesterday."},{"comment_id":"1565531100423273","commenter_b":"WoW... I have never been to the USA, but i fear already for the Afro-americans living there now, after reading this comment (n)","commenter_a":"The ones the cops shoot, is because hey are criminals. Felons with weapons. Threatening others and getting the police called on them. All the others, is just fightin and being dumbasses. White people do that do. White felons and criminals get shot too. But since they are white, no one cares to make a news story.","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"1400391526679146","commenter_b":"I was at fort Wainwright... Fucking miserable place no doubt (it was -37 when that pic was taken)","commenter_a":"Thank you for all you do!!","post_message":"I remember hoping I'd get frostbite so my chain of command would get an ass chewing. This is about as miserable as it gets. ~Will"}]
