[{"comment_id":"10153801376773822","commenter_b":"Sean Hile lol","commenter_a":"Chelsea Nichole","post_message":"Burgers, Wings, and Country music... A taste of Nashville is set to move into #Pittsburgh's North Shore."},{"comment_id":"10153454248817377","commenter_b":"That is very wired how has Trump got millions more votes than Lyin' ted? Why does Trump almost have a 290 delegate lead? Why Has Trump won most States? Why does Trump only need 53% of remaining delegates to get to 1237 delegates and Lyin' Ted need all but 50 delegates or 92% of the remaining delegates? You may also want to got to real clear politics and recheck your poll.","commenter_a":"Contrary to the media narratives -New York is not the center of the Country - so, It is not a big deal to win your home state. The cheer leaders want other Northeastern States to fall in line behind New York. Conservatives believe that the voters in other Northeastern States have a mind of their own. This is also not a big deal win for Trump because of the all the votes cast for both the Democrats and Republicans running in the NY Primary, only 20% of the Vote went to Trump, even with his, so called, big victory... Which makes it clear that no Republican running is likely to win NY in the General Election. So - this Primary has very little significance for who should be the nominee.","post_message":"Donald J. Trump on New York Primary win:"},{"comment_id":"589266911222085","commenter_b":"I'll say it to your face, tough guy...but we all know that a pussy like yourself will never deliver!","commenter_a":"A lady I worked with told me the closest thing to a lesbian experience she ever had was kissing, a liberal beta male on a dare!","post_message":"This is just the best!"},{"comment_id":"1185050781573456","commenter_b":"This lady is nothing but pure Evil","commenter_a":"Same ole same ole.","post_message":"A top official was just discovered dead... he was scheduled to testify against Hillary Clinton in an up coming corruption case. Our thoughts and prayers go out to his family...this is just terrible."},{"comment_id":"10153874849832439","commenter_b":"I heard her spine landed on top of police car. Best news I heard today! Rot in hell psychotic bitch!","commenter_a":"Can she blow herself up again, with all her brethren with her?","post_message":"Hmmm, is she making the (Eiffel tower) peace sign? Islam is peace, brother. The good news is -- she's dead. The bad news is Obama wants to bring these 'widows' and 'children' like the refugee Boston bombers to our shores. This savage tried to lure police within detonation range by crying \"help me, help me\" before blowing herself up."},{"comment_id":"10152821450821519","commenter_b":"I don't read/post/view links. So if you're responding to me on fb, a simple original thought will suffice. Thanks!","commenter_a":"Yes! Agreed. We should punish and penalize those who are responsible for providing employment opportunities for tens of thousands. Everyone in America should work for government. #sarcasm","post_message":"\"It’s hard to see how anyone can possibly believe that the Republican Party, which fetishizes low taxes for the rich above all other priorities, truly cares about wealth inequality...\""},{"comment_id":"10153217092086943","commenter_b":"Heads need to roll for this and indictments handed down. My what our government has come to. Nothing but self serving law breaking idiots.","commenter_a":"@username is relentless about getting to the truth. They work for the people by continuing to tirelessly go after these corrupt polititions and agencies in our government who some how think they are above the law. Congress has caved into the stall tactics by this corrupt administrations Justice dept, Irs, and State Dept. Thanks @username.","post_message":"This is from an Investor's Business Daily editorial yesterday: \"Thanks to a band of lawyers called Judicial Watch, and no thanks at all to the mainstream press, we are learning about a shady October 2010 meeting between former IRS official Lois Lerner, Justice Department officials and the FBI.\""}]
