[{"comment_id":"10155319348083132","commenter_b":"Jesus this is absolutely heart wrenching","commenter_a":"Rest in peace","post_message":"The 21-year-old mom is being hailed a hero for her quick-thinking in saving her newborn."},{"comment_id":"10153451961173717","commenter_b":"Jamie Woods well we don't have any respect or trust in the lying liberals democRATS..who believes in killing unborn babies and selling their body parts, nor allowing illegals into our country so they can suck the life out of America by getting on welfare and to kill,also not support our troops..democrats only care about their own pockets..","commenter_a":"he isnt any worse then the other ones that are running at least TRUMP tells the truth doesnt mince words doesnt try and manipulate and cheat his way through and election.","post_message":"Skywriters stole the show at the 127th Rose Parade in California on Friday, dashing out a message for Donald Trump just as the last float left the gate. \"America is great! Trump is disgusting,\" were the words dotted clearly across the sky on what appe..."},{"comment_id":"10153314267037434","commenter_b":"\"Just fly to the UK, no biggie\" except this woman couldn't raise the money to fly to the UK and pay for the procedure that others get for free, and so she ended up in the above situation. \"Fly to the UK, prpblem solved!\" Easy to be callous and glib when its some other poor sucker's life and you're ignorant of the facts, isn't it?","commenter_a":"Yay, Ireland. I live in terror of an unwanted pregnancy because of this kind of insanity. :/","post_message":"Had the woman been living anywhere else in the United Kingdom, she would not have seen a courtroom. However, abortion remains illegal in Northern Ireland."},{"comment_id":"10153202664107217","commenter_b":"Pmsl yes, parallel parking to the extreme","commenter_a":"@username u do this with jim?","post_message":"Now that's a nifty bit of parking 🚙 @webpagelink Footage: Guinness World Records"},{"comment_id":"726384220793520","commenter_b":"Mostly things that happen bad in this country always happen in Texas are with someone from Texas","commenter_a":"That kinda stuff goes on all the time in Texas","post_message":"Terrible."},{"comment_id":"10153667196560090","commenter_b":"She should be in Jail period!!!","commenter_a":"No. Send her to Prison","post_message":"Keep Hillary Clinton out of the White House!"},{"comment_id":"409403839241497","commenter_b":"The tea baggers mistresses have abortions too.","commenter_a":"It's funny how the party of limited govt wants the govt in every OBGYN office in America. Sounds like big govt to me. Teabaggers, why not just attach cameras to every uterus to make sure women are doing what you say at all times? The tea party lunacy and hypocrisy is too much. I don't like abortion but it is legal and what others do is no one else's business. You ass backwards tea baggers seem to forget that your southern women have abortions too.","post_message":"He went too far."}]
