[{"comment_id":"10155485619961509","commenter_b":"Hillary is. Not a woman! She is a devil!","commenter_a":"Trump: Nobody has more respect for women than me, believe me.... 20 mins to Hilary \"What a Nasty woman\", this clown is the biggest joke ever.","post_message":"Hillary Clinton, citing Bernie Sanders, calls Donald J. Trump \"the most dangerous person in modern history to have run for president.\" @webpagelink"},{"comment_id":"585702171625401","commenter_b":"REAL MEN FOLLOW THROUGH WITH PROMISES MADE REGARDLESS OF WHO OBJECTS!!!","commenter_a":"Well fuck you too!","post_message":"Do you side with Garth Brooks? or DONALD TRUMP? Comment your answer below!"},{"comment_id":"468369446686969","commenter_b":"I believe these things are available in Africa where they can be real African's.","commenter_a":"We already know, they want to sit home doing nothing mooching on working people, make love and have babies to get more government checks, and get fried on dope.","post_message":"An all black student group, 'Being Black', is threatening violence if their demands are not met. We're tired of Al Sharpton, Eric Holder, and Obama's race baiting! Who agrees?"},{"comment_id":"948395698606028","commenter_b":"Karma's a b**** and so is Hillary Deplorable Hillary LIES MATTER Pay for play Lining her pockets","commenter_a":"It was not a mistake...it is who she is. Angry bitter vindictive with money and power. Glad she was feeling enough pressure to be who she always was. A spiteful mean spirited person","post_message":"When you are president, you are president of all the people."},{"comment_id":"10153198007713203","commenter_b":"Poor babies. Why do moms do this....May God for give us all. This needs to stop","commenter_a":"May God have mercy on the world.","post_message":"I left Planned Parenthood after seeing ‘perfectly formed’ quadruplets aborted: former abortion worker"},{"comment_id":"1240054509382884","commenter_b":"my state of AZ just paid a 3 million dollar fine to a private prison because it did not keep it filled to 97%.....they lock up undocumented immigrants for 6 months on the taxpayer dime before deporting them.","commenter_a":"When taxpayer money is given to private corporations to house prisoners we end up with the highest prison population in the world. That is not a coincidence at all. We taxpayers, the People, are paying for the subjugation and torment of a large portion of our population. Mostly a minority inmate population, I might add. It's just wrong no matter how you look at it.","post_message":"The U.S. has more people in jail than any other country on earth. To my mind, it makes a lot more sense to invest in jobs and education than in jails and incarceration. Our job: end the war on drugs, end private prisons and pass real criminal justice reform."},{"comment_id":"10153017975939205","commenter_b":"Well you'll have to fuck off back to Europe then, cunts !","commenter_a":"I worship Ana.....Every square inch...","post_message":"Who knew Jesus was against immigration!"}]
