[{"comment_id":"10153286881669641","commenter_b":"Suck my metaphorical dick @username","commenter_a":"Apparently people are paying more for cooking... Tess O' Connor @username","post_message":"Wealthy millennial women are more likely to make at least as much -- if not more -- than their husbands: cnnmon.ie/1HNES88"},{"comment_id":"10155501213150354","commenter_b":"New campaign slogan: A burrito in every pot and a hooker in every bed...Vote for Hillary","commenter_a":"Why not, Hillary has been a pro at f**king everybody.","post_message":"Bill Clinton hits the jackpot."},{"comment_id":"499187636938483","commenter_b":"Send her sorry ass back to the jungle with her relatives.","commenter_a":"Come and get them you POS!!!","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"1250923198278313","commenter_b":"Another add payed for by the Clintons","commenter_a":"What happened to the American people deciding who will represent us. I'm so tired of this political old timers dictating our path","post_message":"“[Donald J. Trump] is a dangerous demagogue completely unsuited to the responsibilities of a United States president.” - Bruce Kovner, who has donated nearly $3 million to the Republican party"},{"comment_id":"10153446320724087","commenter_b":"I want a woman too, but not a liar, cheap, and a phony","commenter_a":"Fuck no to Hillary. Hell yeah to Feel the Bern!!","post_message":"“It’s imperative that you vote. I want you to vote for [Hillary Clinton]. It’s time for women to be seen as real equals,” soccer hero Abby Wambach said at an event for the Democratic front-runner. “That is one hell of a badass woman in my opinion.”"},{"comment_id":"10153801598562042","commenter_b":"God this makes me sooo angry I just want to cry and beat the crap out of her. She is a monster and deserves the death penalty!! Rip Little Angel!! 😢","commenter_a":"And That POS is pregnant again","post_message":"DISTURBING DEATH: A mom allegedly punched her 2-year-old repeatedly in the stomach and the child was found dead the next day. What the mother later admitted to police is horrific ..."},{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""}]
