[{"comment_id":"10155186975350809","commenter_b":"Great idea, I might even watch the show if they did that. However it will never happen. That would mean doing what you're preaching and Hollywood is the least likely group to do that . It's fine to give to charities at a safe distance, make photo ops with your body guards right outside the shot, but this would be invasive to their gilded lifestyle. So expect more of the same lectures from the podium and not much else.","commenter_a":"really @username???! @username?? Please!!!! Give me a break","post_message":"Conservative Hollywood actor Robert Davi throws down the gauntlet and calls Leftist Hollywood out on its hypocrisy with an incredible challenge: invite illegals and refugees to the Oscars and your private parties or admit you're a racist! Enjoy this delicious read..."},{"comment_id":"10153910838991336","commenter_b":"And slap her face!","commenter_a":"Bless her heart...","post_message":"Carly Fiorina says tech companies need to be asked “to bring the best and brightest, the most recent technology to the table.” #GOPDebate"},{"comment_id":"10154917565918690","commenter_b":"how about stop raping women and build some toilets?","commenter_a":"Great job ....we feel proud of our national anthem..haters ...f****k offf","post_message":"\"The time has come, the citizens of the country realise that they live in a nation and are duty bound to show respect to the national anthem. @webpagelink"},{"comment_id":"10153382839234312","commenter_b":"No not sisters I read THEIR blog. Girls visiting - NOT SISTERS.","commenter_a":"No charges were filed. He was a minor. The girls were not his sisters! MOVE ON!","post_message":"Josh Duggar apologized Thursday and abruptly resigned his job at the Family Research Council in Washington, one of the leading conservative groups fighting abortion and gay marriage among other causes."},{"comment_id":"10153101645216615","commenter_b":"Common Core teaches math comprehension. It teaches students how to comprehend math rather than just memorizing tables. It also teaches students different ways to do math in their heads. I love the \"its dumbing down students\" argument. You, as an adult, cant do it or unferstand, your child can... yet this is making THEM dumber? Sounds to me like its an ego thing. How about you sit there and learn with your child instead of just complaining about it. Take the time to try to actually understand what your child is learning. Why would any parent not want their child to be smarter than they are... why would any parent argue and complain about something that will make their child smarter simply because the parent isnt smart enough to understand it. I have a High School education, no college degree, and i can still understand common core math. Why cant ...","commenter_a":"I love how people bash Common Core without ANY understanding of it at all. I mean, zero comprehension. \"Fox News told me it was bad so it's bad.\"","post_message":"This has been trending -- one dad blasted Common Core with the check he wrote to his child's school."},{"comment_id":"1034069336638599","commenter_b":"Cruz cannot win Ohio, Florida, New York, California, he cannot possibly win the presidency losing these key states. He only has a chance winning Texas as a key state.","commenter_a":"If Kasich and Cruz can't win in the primary how can they win the election? If the people don't want them now why would we want them later? It's not that hard to understand is it?","post_message":"Donald J. Trump on Ted Cruz and John Kasich: “Honestly Sean, they should both drop out.” Do you agree?"},{"comment_id":"10153634972561350","commenter_b":"She looks good to me. Very feminine. I like it when ladies dress nice in the workplace.","commenter_a":"I mean, I'm just saying as a former JCP employee, but during our training it was made really clear that nobody was allowed to wear shorts, male or female. We were given a packet with what was okay to wear and what wasn't. The dress code is established before you even start working, so I don't really see the problem with them sending her home.","post_message":"This woman says she was sent home for wearing these shorts to work -- which she purchased in the store's career style section."}]
