[{"comment_id":"1168129036575432","commenter_b":"@username, I'm not voting for Hillary and if you want to call me a monkey you can meet me outside any military base and we can handle this.","commenter_a":"Hillary is an evil narcissist, a pathological liar, a Corporatist, Bilderberg member, the Whore of Wallstreet, Queen of Corruption, & Ultimate Establishment Candidate. The DNC shoved her down our throat & cheated. Her supporters are dumber than NeoCons. Trump being terrible is no excuse for anything she's done. She can go to Hell. We'd rather vote for Jill who has no chance than put our names behind either of the scumbags running.","post_message":"The differences between Hillary Clinton and Donald Trump on the real issues impacting the middle class and working families of this country are very clear."},{"comment_id":"10153712087136336","commenter_b":"That teacher should be ashamed of herself she is just a bully!!!","commenter_a":"So very, very sad. The teacher should be fired.","post_message":"Lloyd's mother, Nyesha Terry, found him seated at a desk away from other students wearing a trash bag a teacher had turned into a poncho."},{"comment_id":"10153189366828132","commenter_b":"Yes for real!!! That's hilarious.. but just a secret, I do it to. Except when they stare, I sing to them. And they sometimes laugh or look at me like","commenter_a":"I could so see Mervin doing Danielle!","post_message":"This police officer from Dover, Delaware, has some serious moves!"},{"comment_id":"1709971309289981","commenter_b":"How can you like these ignorant witches","commenter_a":"only reason l watch it, for Whoopee and Joy, still very good and stimulating\\\\","post_message":"The View just dug their own grave, FINALLY! Cancel this show now."},{"comment_id":"10154211018961337","commenter_b":"Hot chick","commenter_a":"Dont agree rob schneider is funny in some movies","post_message":"WHOA, sorry Rob Schneider and Jennifer Love Hewitt (and all the other actors on this list)..."},{"comment_id":"10154339117992619","commenter_b":"THERE JOINING ISIS WILL LIBERATE THEM FROM ALL THERE PROBLEMS","commenter_a":"SO YOUR POINT IS ????","post_message":"A transsexual man and his gay female friend, have left to join ISIS, unaware that ISIS publicly executes gay people by throwing them off buildings and stoning them."},{"comment_id":"943180705778182","commenter_b":"It's a ROCKET SHIP.... Feel the Bernie Ship!","commenter_a":"All I can say is Wow","post_message":"Bernie Sanders closes in on Hillary Clinton in a big way in this \"shocking\" new New Hampshire poll. Watch more here: @webpagelink"}]
