[{"comment_id":"10153974541414575","commenter_b":"Poor pup glad he's doing well now just hope he finds a family asap","commenter_a":"How bad is Peyton hurt, I'm looking for a small dog, but low maintenance, I'm disabled my self an single","post_message":"Peyton the dog was found horribly injured along a Kentucky highway after being attacked by a coyote or large dog and hit by a car. Now, thanks to a local rescue group, he's getting much-needed medical care."},{"comment_id":"10153147409408812","commenter_b":"Terry is trollin trollin trollin, stfu","commenter_a":"2 billion years....lol make fun of me for believing in Santa Claus but you keep believing we could possibly ever know something was 2 billion years old.","post_message":"Scientists: Bacteria discovered that hasn't evolved in 2,000,000,000 years: @webpagelink"},{"comment_id":"1813003575594431","commenter_b":"Us white people got to go yuh eard meh","commenter_a":"Were pray tell is this \"white rage\"? I am white and I feel no rage nor the desire to go out in public and carry signs around. I am not happy with where this country is going but I am not out all day every day protesting and tearing things up..oh wait a minute...I work all day.","post_message":"According to a new book by Emory historian Dr. Carol Anderson, many of the struggles faced by the African-American community are the result of \"white rage.\""},{"comment_id":"10154246472810695","commenter_b":"I thought poppies grew from the earth","commenter_a":"Plz worry about the heroine statistics that are rising and rising. And stop giving people life in prison for a plant that grows in gods green earth.","post_message":"This family-friendly Easter event took a pretty surprising turn."},{"comment_id":"1095662820489119","commenter_b":"She's God Damn Trash! Nasty white cunt!","commenter_a":"This is a prime example older white people are the most racist people in America the older white the younger generation is not like the old white generation they raise the kids to be racist this just don't make no sense but she got a dose of her own medicine because the world is not hateful like she is and she's in her last days she's going to die a old racist woman she have to answer to God she's trash in my book","post_message":"A black girl was harassed by an older white woman while selling candy outside a California Target for $1. But, there’s a twist. Jay Lopez, a customer at Target, saw the woman berating the girl & intervened. Restoring your faith in humanity, Lopez bought the remainder of the sweets. VIDEO---> @webpagelink"},{"comment_id":"10153337404314454","commenter_b":"Just be thankful that our atmosphere isn't filled with Volcanic ash from a bunch of volcanoes erupting.... We could go into a hundred year mini Ice Age.","commenter_a":"The earth will one day shake humans off like fleas off a dog. But how sad we couldn't have done better.","post_message":"Using data collected by NASA satellites, researchers have found that more than 1/3 of the world's largest aquifers are drying up faster than they being replenished."},{"comment_id":"10153083493211336","commenter_b":"Exactly. Bills must be payed no matter what.","commenter_a":"This is awful...was he not paying the bill? Because just because we are deployed doesn't mean we stop paying bills....I certainly pay all of mine while I'm deployed..","post_message":"Despite laws in place to protect troops, retired Sgt. Charles Beard's car was repossessed while he was serving in Iraq."}]
