[{"comment_id":"542505495955041","commenter_b":"@username you're a racist bitch. I hope you rot in hell.","commenter_a":"He was mentally ill he suffered from PTSD . Isn't that what they say when the white boys do it?","post_message":"Dallas Shooting Suspect Identified as 25-Year-Old Army Veteran Micah Xavier Johnson"},{"comment_id":"1683253511914514","commenter_b":"@username Trump & FOX NEWS have Greatly Exaggerated This Issue The Lying About the Protesters IS On TV Footage & They Still FLAT-OUT LIE.... Why is Fox NEWS Saying it was Violent Protestors, The Media Was there you can See Who are the Aggressors it was the Trump Supporter, but the Trump Supporters Started Sucker Punches Again, Most of the protestors inside were young White Girl with locked armed, the Protesters Outside were very peacefully walking around Outside with their signs until the Inside Trump Supporters Went Out Side & started Yelling & Pushing Protesters, it's on CNN. Trump Calls CNN & Tell them they were violently attacking, He Ran Off as soon as he saw there was more than one Protestor there's Footage...Trump Lies & Exaggerates everything 1000 Times Fold !! TRUMP Wants to Turn Our Military INTO Brainless Terrorist Animals To Beat ISIS, Our Military Has Rules & ...","commenter_a":"After tonights Chicago thuggery, trump will probably win every state voting on Tuesday in a landslide lol","post_message":"Marco Rubio is urging Republicans in Ohio to vote for Gov. John Kasich in order to prevent Donald J. Trump from winning, according to published reports and comments from his own people."},{"comment_id":"10153123243420950","commenter_b":"Love that show!","commenter_a":" and still my favorite show","post_message":"Betty White is the lone survivor of the cast; RIP Bea Arthur, who played sensible Dorothy Zbornak, Estelle Getty, who portrayed Dorothy's mother Sophia Petrillo, and Rue McClanahan, who played the sultry Blanche Devereaux. The show lives on, though."},{"comment_id":"10155398572138797","commenter_b":"The man never said it doesnt happen in the white community. But its not \"white history month\" he was pertaining to this month and what the race can do to honor their dedicated month. He did not say anything about tje white people not killing. Oh wait thought blacks killing blacks is justified right? The constant drive bys and convictions is oj because of your race? How about we say how about all the ghetto gang bangers and the wanna bes stop killing to honor this month whether black or white a thug is a freaking thug. Whites killing whites needs to stop also but we do not have a month dedicated to our history whether it be polish irish English. We will take gary and Chicago and all the mindless killing what race is it primarily? Oh wait its ok or white people's fault.","commenter_a":"I have an idea maybe for Black History Month. The young black kids can stop killing each other. But of course that won't happen.","post_message":"BLACK HISTORY MONTH: Today, and all month long, join us in celebrating the achievements, culture and contributions from black Americans across U.S. history."},{"comment_id":"10154114920114726","commenter_b":"She is an assault magnet!!","commenter_a":"What do Leonardo DiCaprio Congressman Allen West, the NYPD and Students for liberty all have in common? They all had assault charges filed by Michelle Fields......who is Michelle Fields>? The Woman who is claiming she was assaulted by Mr Trump's Campaign manger. Check her background.","post_message":"Even liberal Susan Sarandon thinks Trump is better than Clinton."},{"comment_id":"392535437595004","commenter_b":"What a misogynistic jerk!","commenter_a":"WTF? what a loser! how is this guy in politics? what a loser!","post_message":"No, there's no GOP war on women."},{"comment_id":"1495140610505964","commenter_b":"Candace Richerson what about roger Ailes? He's a jerk. So what","commenter_a":"The truth hurts doesn't it!??!!! She is well armed with actual facts. Unlike the people who speak for Trump: the sexual haraser, the racist, the bully and the Ukraine employee - But you Trumpets go right ahead and support the guy who loves Putin. Every Hitler needs a Mussolini.","post_message":"Sen. Elizabeth Warren calls Donald J. Trump a \"small, insecure money-grubber\" during her first solo campaign appearance for Hillary Clinton. Read more: @webpagelink"}]
