[{"comment_id":"10155204940516337","commenter_b":"Well, those compys had gotten away before the story even started.","commenter_a":"I prefer the way the book ended.","post_message":"THE ORIGINAL ENDING of Jurassic Park might blow your mind..."},{"comment_id":"518916724963287","commenter_b":"Is she holding a sex toy???!!!!!","commenter_a":"I cannot believe facebook has stuped so low to put this kind of crap on their page, I'm thinking it might be time to leave.","post_message":"THIS IS DISGUSTING..."},{"comment_id":"429016630556711","commenter_b":"Fuck off cunt slut ...","commenter_a":"Why is the cuffed woman running? If she woulda kept her cuffed ass where it needed to be she'd be fine","post_message":"This cop was too lazy to run after the woman so he tasered her causing her muscles to lock up. She fell, hit her head and later died from injuries. What do you think of this case?"},{"comment_id":"1019443361412045","commenter_b":"Let's use it to build the fuckin wall","commenter_a":"Twice as much as reported. The other half is getting sold back by corrupt DEA agents. Border Patrol did their job, now DEA will make it tougher for them.","post_message":"Guess high, REAL high."},{"comment_id":"916530445075740","commenter_b":"GET OUT !","commenter_a":"Unbelievable.","post_message":"OUTRAGEOUS: People Stomping On American Flag In #Hashtag Challenge Support For Self-Proclaimed Against White People (VIDEOS) @webpagelink"},{"comment_id":"1738340076416341","commenter_b":"Women can be President too 21 Century America ,,,","commenter_a":"Vote Trump to end the Clinton Crime Cartel as we know it.","post_message":"Mike Pence \"signed an abortion law so extreme and so dangerous that even pro-life Republican women in the Indiana legislature spoke out and voted against it.\""},{"comment_id":"800309873404645","commenter_b":"16-years ago America watched as the Clintons packed their moving vans with about $200K of stolen furnishing and valuables from the White House and drove away, finally removing a large stench of corruption and sleaze from our nation's capital. We'd be insane to allow them back. TRUMP-2016 MAKE AMERICA GREAT AGAIN!!!","commenter_a":"Counter punch...she has a glass jaw. (email, poor sec of state, another Obama)","post_message":"Crooked Hillary Clinton is spending a fortune on ads against me. I am the one person she doesn't want to run against. Will be such fun!"}]
