[{"comment_id":"10154010909024916","commenter_b":"I said it first along time ago. Its better for her to be Sanders VP then Hillary's. Two women running is dicey for guy voters. Plus hillary is too conservative for Elizabeth. it wouldn't work. Just Sanders/Warren. and secret service knows they would work to protect them the same as blacks running for president.","commenter_a":"Elizabeth Warren would make a great Vice-President and the next great President after Bernie!","post_message":""},{"comment_id":"1521502694809851","commenter_b":"And once again we don't riot , block busy streets and and make up bullshit like a certain group of people--- absolutely this is murder and a hate crime!!","commenter_a":"absolutely","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news. No riots, no protests, no media coverage. Do you think he should be charged with a hate crime?"},{"comment_id":"10152734752677434","commenter_b":"Lol","commenter_a":"Hmmmm I actually do think he's kinda sketchy re: women. If he's so power to the people, then where was he when Gore or Kerry ran? Just sayin","post_message":"Bernie Sanders wrote an essay in 1972 that mentions rape, and it's weird as hell"},{"comment_id":"602931503228475","commenter_b":"I have never heard of or seen a cow attack a person!!! No Good Worthless Muslims!!!","commenter_a":"Those men will burn in hell one day","post_message":"Two Men Were Stabbing a Girl in “Honor Killing” When This Cow DID THIS to Stop Them…"},{"comment_id":"846780482084872","commenter_b":"You are an ignorant woman.","commenter_a":"This is making me sick, and it. Is a sin in the eyes of the lord.","post_message":"The sailor's boyfriend was nervous he would \"screw it up and fall in the water or something.\""},{"comment_id":"1612078455751826","commenter_b":"She wouldn't recognize the truth if it hit her in the face","commenter_a":"Hillary tells it like it is, OH that's terrible take it back, Donald Trump supposedly tells like it is, oh, he's so refreshing to have some one not pc and speaks their mind. F#@K all you people, you're nuts!!!. I really hate she seemed to walk it back, because it's the truth.Donald Trumps supporters are all eating out of the same trough.","post_message":"Mike Pence responds to Hillary Clinton's comment that \"half\" of Donald J. Trump's supporters are a \"basket of deplorables\": \"They are Americans and they deserve your respect.\" @webpagelink"},{"comment_id":"10153008307071130","commenter_b":"Justifying double standards while still playing the perpetual victim. Yay modern feminism.","commenter_a":"Are we not gonna talk about how a 50+ year old lady forced herself on a 20 something guy? Because if it was the other way around, I'm sure you'd have milked it every possible way.","post_message":"In the ongoing saga of things brands should never tweet..."}]
