[{"comment_id":"10154478839956636","commenter_b":"@username without god, noone can hear you get shot. Your worldview is wuite hopeless. Without god, who will punish evil ppl then evil has won. Rofl","commenter_a":"They found the remains of velociraptor Jesus used to ride on.","post_message":"Incredible"},{"comment_id":"971601666302233","commenter_b":"It seems like all the intelligent women with morals have been fired... This show needs to be cancelled!","commenter_a":"Yes","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"658627524300508","commenter_b":"Just the way I want them! You have your work cut out for you with Remi your Boston Terrier.","commenter_a":"@username both your dog's made the list","post_message":"What's the laziest dog breed?"},{"comment_id":"10154823227721162","commenter_b":"Africa still enslaves it's own people, but ok white people are the problem hahaha","commenter_a":"The kicker of the team is a black female this is clearly raciest read the article people ...you would be offened to if you where made fun of in such a manner comparing you to a gorilla but its funny and people are too sensitive because its not directed to you or your race #facebookBigots","post_message":"RACIST POST? The photo shows a white young woman hugging someone in a gorilla suit."},{"comment_id":"496116510576642","commenter_b":"There are no virgins they rape them all","commenter_a":"Kill them all and let them find Allah and the virgins","post_message":"SICKOS!"},{"comment_id":"935434433239352","commenter_b":"She sure don't know how to talk right lol. She should be mad she left the house looking half ass dressed. Look like she rolled outta bed and didn't bother to fix her face or hair.","commenter_a":"I tell you this ...you come to this neck of the woods and that bitch would be laid out lol ...and to all them punk ass people who didn't speak up are as much of a pussy bitch made ass punk who probably have kids the same as them ...people need to stfu and let people be ! .... The bitch talking aint perfect either so who is she to talk ! ...bitch ....sit down no one is god and cant judge ...so stop judging !","post_message":"This is the harsh reality so many trans people face every single day. #MicBrights"},{"comment_id":"583392381839036","commenter_b":"No Mexican's aren't the only ones. All illegal immigration must be stopped. However Mexican's are the vast majority of illegals and our shared border is the place to start to stop it.","commenter_a":"Illegals come here from Mexico looking for a better life yet they want to turn the U.S. into Mexico...freakin' crazy, and stupid!","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"}]
