[{"comment_id":"10154256753938701","commenter_b":"ONLY IN AMERICA RACIST GET REWARDED","commenter_a":"Regardless of if you think the shooting was justified or not this is just callous and tacky. He honestly makes me feel ill.","post_message":"UPDATE: The gun listing has been taken down from the auction site."},{"comment_id":"10153461331093635","commenter_b":"Do you know common law as well as you think you know the Bible? Courts of common law MAKE law. While Congress enacts statutes, the courts write case law. So, let's put to rest the ERROR that courts don't make law. If you don't believe me, find me the statute in your state that defines the elements of slander. The decision in Obergefell doesn't require that you do anything, unless you are a marriage officiant, so I don't see how you can refuse to obey the decision.","commenter_a":"The Supreme Court \"ruling\" is NOT the Law! It's only the insane opinion of 5 corrupt arrogant judges that think they can wield more authority than God Almighty!","post_message":"No Gay Marriage in Alabama, Chief Justice Roy Moore Says"},{"comment_id":"1127007594082684","commenter_b":"Hell yes, round em up & send em back in those pink boxers.","commenter_a":"HE 's the best man for the job","post_message":"ClashDaily.com"},{"comment_id":"540716409449985","commenter_b":"they screwed up their country, and all they want is to screw up the rest of the countries","commenter_a":"Hell No !","post_message":"COMING SOON in your city and town..."},{"comment_id":"903300846390748","commenter_b":"Shoot her, her life does not matter here","commenter_a":"All lives matter, but standing on the flag is WRONG","post_message":"REPULSIVE: [VIDEO] WOMAN WALKS ON AMERICAN FLAG AT #BlackLivesMatter PROTEST, As US Service Members In Uniform Turn Their Backs On Her"},{"comment_id":"10153223808830927","commenter_b":"IS IT A DONT PAY TAXES PROTEST","commenter_a":"It gives the bum a purpose in life to boycott something, anything! Bless his pathetic excuse for a heart!","post_message":"Why is Rev. Sharpton urging people not to watch the Oscars this Sunday?"},{"comment_id":"10155037125378459","commenter_b":"Hey the angry ex wife is back!!!!!","commenter_a":"You know when there is a big headline telling you the absolute truth about anything on social media that you are in for a load of bullshit.","post_message":"The Truth About Oprah Winfrey Oprah Winfrey meets in secret with THE MOST evil men and women in the world every year and is given talking points to push on her audience..."}]
