[{"comment_id":"10153828594101135","commenter_b":"Ignorance at its best","commenter_a":"losers go back to the burbs","post_message":"Supporters of Donald Trump are gathering for a \"flash mob\" on the Wayne State University campus - where Hillary Clinton is scheduled to speak later this afternoon."},{"comment_id":"1247598538653217","commenter_b":"Cheap wages and NO regulations. So tell us, what's unreasonable? Are the international businesses really hurting that bad? Oh, right, it's the \"shareholders\" that are burdened","commenter_a":"Government caused the exodus of manufacturing. 35% corporate tax, EPA regulations, inflated wages, high energy costs. Don't let government fix anything. All they do is break things.","post_message":"Too many working families in the Midwest have been left behind because of the outsourcing of American jobs. I led a letter with Rep. Debbie Dingell and 24 other colleagues to urge Congressional Leadership to expand opportunities in manufacturing communities harmed by outsourcing. It is critical Congress takes immediate action to jumpstart the economic prosperity of our communities."},{"comment_id":"10153401968107411","commenter_b":"GOOD..,TIRED OF SMELLING DOG POOP ON A HOT SUMMER DAY we have filthy nasty neighbors with too many dogs...they don't clean the poop and it FEEDS RATS PEOPLE...","commenter_a":"Esoj Ornelas","post_message":"Mayor Emanuel and several Chicago aldermen are proposing a new ordinance that calls on property owners to clean their lots daily to keep them free of feces -- or face fines up to $500."},{"comment_id":"1658663710820319","commenter_b":"The Obama presidency wasn't a failure. Facts suck if your opinion differs, but it doesn't mean you get to have your very own truth.","commenter_a":"After seeing our FLOTUS on Oprah and seeing once again her \"attempt\" to divide our nation.... She had me thinking.. It was nearly nine long years ago that Michelle Obama stated, \"for the first time in my adult life I am proud of my country because it feels like hope is finally making a comeback.” After nearly eight years of failed policies, I feel I can nearly say the same.... For the first time in eight years, I am proud of my country because it feels like hope is finally making a comeback.”","post_message":"As First Lady Michelle Obama prepares to depart The White House, here's a look back at the moments that made her go viral. Watch more here: @webpagelink"},{"comment_id":"10153896899905579","commenter_b":"Yes...go away!!!","commenter_a":"you go","post_message":"President Obama to extend U.S. Military presence in Afghanistan: Your Thoughts? WATCH statement from President Obama @webpagelink"},{"comment_id":"10152910753726336","commenter_b":"Reality check!!!!","commenter_a":"REALLY! If you believe this I have beachfront propoerty to sell you in Arizona, can you say \"stupid Americans\"!","post_message":"Do you agree? #SOTU LIVE coverage: @webpagelink"},{"comment_id":"10152914682658598","commenter_b":"So do women.","commenter_a":"Weak! Some guys need to man up and become responsible","post_message":"Man Kills His Own Unborn Child After He Secretly Puts Abortion Pill in Girlfriend’s Drink"}]
