[{"comment_id":"606144009518781","commenter_b":"She didn't get the revenge my butt would have gotten......I would have burned the house with him IN it chained to the bed.","commenter_a":"I agree that he should have been inside too bad that's cruel and unusual punishment. What kind of person does something like that to a child?!?!! Happens all the time unfortunately :( Exactly why I don't let my kids our of my sight, too many crazies in the world.","post_message":"The only thing better would have been if he was inside. ;)"},{"comment_id":"526657100877562","commenter_b":"@username that's why I'm voting Jill Stein.","commenter_a":"I'd rather vote for the one who may have evaded taxes than the one who led the charge on foreign policies that killed millions of people and now possibly could cause WW3 by taunting Russia with the no-fly zone in Syria. But I digress...Jill Stein is who I'm voting for because I don't vote for monsters.","post_message":"So, Trump goes around and says, \"Hey, I'm worth billions, I'm a successful businessman, but I don't pay any taxes. But, you, you make 15 bucks an hour, you pay the taxes, not me.\" That's why people are angry and want real change in this country."},{"comment_id":"10154874885608796","commenter_b":"Drain the swamp!","commenter_a":"Yates used no integrity because she took an oath of office to obey the law. Same as Lynch did. Both should have been fired no just one of them.","post_message":"Former Attorney General Loretta Lynch praised now-fired acting Attorney General Sally Yates for her “unshakable integrity” in refusing to defend President Donald Trump’s executive order putting a pause on travel from terror-ridden countries."},{"comment_id":"1113637395343398","commenter_b":"Bye Bitch!","commenter_a":"Now that is ridiculous! Waste of time and very presumptuous woman.","post_message":"Fox News host Harris Faulkner is furious that a cute hamster toy bears the same name as her -- and she wants $5 million from the company that created it."},{"comment_id":"10153606210716509","commenter_b":"she should have given him a stone cold stuner","commenter_a":"We need more moms like this!!","post_message":"What do you think of this mom's actions? Taking matters into her own hands, her son got a heavy dose of discipline on live TV: @webpagelink"},{"comment_id":"10155347376155389","commenter_b":"She certainly is a cow!","commenter_a":"I would vote for a dead cow before id vote for her. Oh I forgot she is one.","post_message":"It's your turn to answer Sean's Question of the Day! Will the growing list of scandals hurt Hillary Clinton if she runs for president?"},{"comment_id":"10153442006357061","commenter_b":"Sometimes a girl just needs help getting all gorgeous for the day.","commenter_a":"Ahhhh. The small amount of time this took will pay dividends in the future to this little gem. We should all make investments like this.","post_message":"Deputy helps 2-year-old toddler put her pants on after she calls 911 while struggling to get dressed. \"I'm just grateful for the deputy and her kind, wonderful heart.\""}]
