[{"comment_id":"10154411705371336","commenter_b":"@username Did you purposefully neglect the part that this is what happened in every parts of the Earth? They did the same thing with the Aborigines here in Australia, when Arabs invaded Constantinople and established Istanbul...smh","commenter_a":"She is one of the few Christian celebrities. God Bless Her. Amen this nation was founded on Judeo-Christian values.","post_message":"Candace Cameron Bure is grateful to be living in the USA because \"we have the ability to love God here.\""},{"comment_id":"10153880836367994","commenter_b":"EXPELL THE HOE S FOR LIFE , LET THEM WORK THE STREETS","commenter_a":"All I got to say is we need to bring back discipline back in the schools I would of never In a million yrs ever thought about hitting a teacher I think these kids need to b put in jail disgusting how these kids are now a day","post_message":"Those who work at Detroit Public Schools say this was \"teacher baiting\" -- and that this isn't the first time they've seen it happen: @webpagelink"},{"comment_id":"1266458500080562","commenter_b":"These articles consistently show how unbalanced a frightening amount of women are. Cheating should NEVER result in assault or worse. Never.","commenter_a":"Did he learn anything?","post_message":"She shot him in the groin for having an affair"},{"comment_id":"854726854659317","commenter_b":"Build the wall","commenter_a":"The Donald has done it again @username","post_message":"I don't have time for political correctness and neither does this country. Donald J. Trump"},{"comment_id":"10153205504771336","commenter_b":"You need to get the Fffff out there's you are useless Lady or what ever you are. You are a disgrace.","commenter_a":"Recall this mayor!","post_message":"“I never said, nor would I ever say, that we are giving people space to destroy our city. So my words should not be twisted.” Mayor Stephanie Rawlings-Blake spoke to reporters moments ago amid growing violence and chaos tonight in #Baltimore."},{"comment_id":"1764684433799515","commenter_b":"Class all the way !! Just think they want to make America great again !!","commenter_a":"Boring & hard to understand","post_message":"It was truly an honor to introduce my wife, Melania Trump last night. Her speech and demeanor were absolutely incredible. Very proud! #GOPConvention"},{"comment_id":"1466659373354088","commenter_b":"@username <<<america needs more folks that think like this guy... dude you such teach classes to these bigot trump supporters","commenter_a":"Protestors are chanting \"Black Lives Matter\" as they set fires, fire weapons and attack police with bricks but BLM leadership will say they don't represent \"the movement\". Yes, this IS your movement. No one respects you. You defend criminals, make martyrs of cop killers and have the gall to act like these violent protests don't speak for you?","post_message":"A large crowd turned out after Milwaukee police shot and killed what they said was an armed suspect earlier in the day."}]
