[{"comment_id":"1309577419062434","commenter_b":"Did they have fair trials? Do gays need to be re-educated??","commenter_a":"Leave the man alone in his way Castro was great not a fair leader in terms of his military policy's but he did great things forcuba like healthcare and education!","post_message":"Marco Rubio called it \"embarrassing.\""},{"comment_id":"10153503664933132","commenter_b":"Kourtney hasn't helped things along with Scott. If she thinks enough of him to be with him unless he's a horrible snored and she can't get any sleep her place is in bed with her husband! I love kourtney the most but I think shes too controlling. Scott is using his parents death as an excuse for anything he does wrong and that's not right either. But in my opinion Scott is gorgeous!","commenter_a":"They do make cute kids","post_message":"Cute alert!"},{"comment_id":"10156390568200354","commenter_b":"Then why has socialism worked anywhere ??????","commenter_a":"No.","post_message":"\"...the word ‘socialist’ has become a dirty word.\""},{"comment_id":"481872515336662","commenter_b":"She's doing a great job! Leave her alone! You look half as good as she does, you wouldn't have a problem!","commenter_a":"She is great and a real threat to the liberals and they will go after her.","post_message":"Liberals are after Megyn Kelly after she falls victim to wardrobe malfunction. She is in trouble, we need to show her we have her back. Can we get 20,000 'LIKES' for Megyn Kelly?"},{"comment_id":"1757645291122332","commenter_b":"@username or because the people who own the farms/fields can get away with paying illegals less money than legal citizens. Lived in a farming town and saw it happen all the time. I have no problems with anyone coming here legally, paying taxes and doing everything else American citizens do.","commenter_a":"This video only proves that we need Trump. Every statistic stated was \"illegal\" immigrants working in our country. I honestly thought it was a joke. Time for Americans to start working again and quit hiring illegals to do the jobs.","post_message":"If Donald Trump's immigration plan came true, the results would be scary. See the biggest immigration myths here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"10153122527121051","commenter_b":"Freedom bitch do something about call for help911 ..","commenter_a":"Hey Gonzalez: take your ass back to Mexico since you think you should fly the American flag upside down and the Mexican flag next and in equal position to the American flag. I was born in Cuba but will never fly a Cuban flag. I am an American and there is only one flag for me. You want to disrespect my flag and fly that rag of yours, go the hell back. BTW, you think there is racism against Mexicans, look at the way you act and then see if you can come up with any reasons American citizens might have a problem with Mexicans.","post_message":"An outraged military veteran took one look at this man's flag display and intervened. Soon after, he got a visit from the police"},{"comment_id":"762801500520430","commenter_b":"The poor girl just can't make up her mind, if you want to call it that.","commenter_a":"She is an idiot!! Just like most spoiled rich people!","post_message":"Hypocrisy, much?"}]
