[{"comment_id":"1703634343208850","commenter_b":"Demo's must be high on something, another unquaified and under accomplished democrat running for the highest office in the land. Jail is where she belongs.","commenter_a":"Clinton should be in jail!!!!","post_message":"Sen. Jeanne Shaheen says there's no question Hillary Clinton is the most qualified candidate in the presidential race. Would you like to see Clinton become America's next president?"},{"comment_id":"1014820688580048","commenter_b":"Time for muslims to take their a$$e$ back where they came from","commenter_a":"That's the national anthem. If you aren't willing to be An American than go home! And take the stinking socialist with you. You can take the atheists and the Mexicans.","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays @webpagelink"},{"comment_id":"728623440630942","commenter_b":"Adam , undocumented immigrants pay billions in taxes.","commenter_a":"The wall we take longer than 4 years to build. He won't get re-Elected and the wall won't be finished. Then us tax payers will be stuck paying for it.","post_message":"U.S. taxpayers will foot the bill for the wall, at least initially."},{"comment_id":"468340716665733","commenter_b":"I suppose those of you refusing to vote for him because of vaccinations would rather live in a socialist regime under Hillary.","commenter_a":"Yes!!!","post_message":"Will you stand with me. Together we can take our country back! @webpagelink"},{"comment_id":"10153163452101770","commenter_b":"sick thugs","commenter_a":"Good! Time to show respect..","post_message":"Two students who attend a public high school in small-town Tennessee are reportedly spending the first weekend in December in jail because they wore saggy pants to school one too many times."},{"comment_id":"10153725968361717","commenter_b":"Stupid women....","commenter_a":"IF THEY ARE REFUSING TO DO THEIR JOB ( I do NOT care how fucking religious you are) IF YOU ARE NOT DOING YOUR DAMN JOB YOU WERE ELECTED, HIRED, OR NOMINATED FOR YOU WILL BE FORCIBLY REMOVED FROM OFFICE! GOT IT ASSHOLES? Or didn't your religion TEACH you that ASSHOLE!","post_message":"Like Kim Davis, the Wyoming judge has cited religious beliefs in her refusal to marry same-sex couples."},{"comment_id":"10153620531441157","commenter_b":"Their just upset because she's not Hispanic!","commenter_a":"terriorist at its finest","post_message":"Islamic State claimed responsibility."}]
