[{"comment_id":"10152804036658145","commenter_b":"I disagree... there are less and less males signing up to become priests ...Ireland of all places had 1 ..yes that is right 1 ordained priest last year...they either open the doors to the females soon or people will have to do their own masses...","commenter_a":"I kind of believe this Pope Francis might be very welcoming to having female priests...Congrats on reaching your life long dream...","post_message":"CORRECTION: While the woman was ordained through a non-denominational church, and she considers herself Catholic, the Catholic Diocese has not responded to WFTV's story and she has not been ordained by the Catholic Church. Rita Lucey says she faces excommunication from the Catholic Church, but would rather fulfill her lifelong dream of becoming a priest."},{"comment_id":"10155605168240968","commenter_b":"Lock Em up!","commenter_a":"Liberals suck!","post_message":"\"If you see your friends or family falling into the chasm of cable news, perhaps parental lock is right for you.\""},{"comment_id":"10155111489782009","commenter_b":"you are crazy lady!","commenter_a":"He has brought ugliness and division.","post_message":"\"He has he has brought smiles to faces.\""},{"comment_id":"1176200455772763","commenter_b":"She know foreign policy like my pet cockroach!","commenter_a":"Trump likes to do things on the cheap ,with Carson, Palin and Bachman stupid doesn't cost much.","post_message":"This is the same woman who thinks the United Nations is going to institute a One World Government and that Barack Obama is the Antichrist."},{"comment_id":"817688164952017","commenter_b":"Chesimard is a scum pig who needs to be extradited back to NJ to finish her punishment.","commenter_a":"And they wonder why there is racism in American. They are the worst and the rest of us are reacting to this sort of crap and the disproportionate numbers of black's in prison. Clean up your own house first and quit committing crimes and we might actually start to listen. Until then FY.","post_message":"[Video] INSANE LIST OF DEMANDS BY BLACK COLLEGE STUDENTS Includes Naming College Hall After Notorious Cop Killer"},{"comment_id":"484149281775652","commenter_b":"Get rid of him and his fat AZZ wife!","commenter_a":"Yes","post_message":"VIDEO: Kanye West cries racism after Beyonce loses... Kanye is a fool and a cancer, let's ban him from America. Do you agree Kanye should be banned from America?"},{"comment_id":"1768726713375361","commenter_b":"I agree tone down a little and let her hang herself.!!!!!","commenter_a":"I think Trump would be the best of the 2 evils, but with all his smart remarks it looks like he is trying to help Hillary. He needs to tone down and run on his own platform and let her hang herself.","post_message":"YES!!"}]
