[{"comment_id":"10152792589201051","commenter_b":"Yes she should get surgery. Just wire her mouth shut","commenter_a":"Well if she would close moth once in awhile and watch what she eats she would not have to have surgery. I know it's the tax payers fault.","post_message":"This teen and her family have just one request for taxpayers."},{"comment_id":"1036501259720547","commenter_b":"If illegals are going to remain here what difference does it make?","commenter_a":"Trump/Cruz will have my vote.... but if Trump is not on the ballot......don't expect me to cast one","post_message":"Ted Cruz explains why he thinks \"2016 is going to be an incredible year.\""},{"comment_id":"10153151151584330","commenter_b":"... what does this have to do with this news story?","commenter_a":"Mental illness on the rise. We need to open state mental institutions Nd not close them down. Poor people have no where to turn to and it can effect the innocent.","post_message":"BREAKING: A person died after being hit by a train in Fairfield. Train service in the area has been disrupted --> @webpagelink"},{"comment_id":"10153243710196523","commenter_b":"Give her ass the death penalty!!!!!","commenter_a":"Poor angel baby...rip. Your POS mother should now get the death penalty. Horrible!!!!!!!!","post_message":"A 33-year-old woman has been charged with murder in the death of her newborn baby girl after the child was allegedly thrown from the 7th floor window of an apartment building."},{"comment_id":"10153117785839440","commenter_b":"close your trap you negative nancy!","commenter_a":"Who cares- nuggets are less than irrelevant.","post_message":"Denver Nuggets selected Emmanuel Mudiay with seventh pick of the NBA Draft @webpagelink"},{"comment_id":"1651699668460485","commenter_b":"The deficit has no real meaning re the economy. Look it up.","commenter_a":"A big not for 8 years. What a great vacation they have had. Our country has gone to crap. Glad you enjoyed it. The only thing I have left is change in my pocket.","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"442004659257462","commenter_b":"Go home!","commenter_a":"The only thing that fat slob would bring to the White House is big-Big-Big Plate to feed his fat ass off of.","post_message":"Will Chris Christie's tough political style work in the White House?"}]
