[{"comment_id":"1087981781280741","commenter_b":"This has nothing to do with \"political correctness\" and everything to do with the agenda of those who wish to bring this country to its knees. Offend Who? Immigrants - legal and illegal? Muslims? Persons like George Soros? These are schools being attacted; our children, our countries highest symbol.","commenter_a":"How can u even think of not flying our flag anywhere in this country. If u have no respect for our flag get the heck out of my USA.","post_message":"Old Glory just got banned from High School football games for the most despicable reason imaginable. What do you think about this and how should students and their parents react?"},{"comment_id":"10155205840346337","commenter_b":"@username illegals work every job of the spectrum not just in the fields.","commenter_a":"So these restaurants openly hire illegal workers,,,,hmmmm.","post_message":"American eateries will be shutting down to show solidarity with immigrant workers."},{"comment_id":"10153635664936717","commenter_b":"Lock her up! Oh wait she's careless just like Hillary!","commenter_a":"At this point, this is just funny.","post_message":"Here she goes again..."},{"comment_id":"10153632761623984","commenter_b":"Die bitch","commenter_a":"Coward!!!!!!!!!!!","post_message":"After calling out the suspect in this tragic police officer shooting, this city’s top cop dropped a huge truth bomb that could come as a big surprise to advocates of the \"black lives matter” movement. Do you agree with this police chief?"},{"comment_id":"10153621477392293","commenter_b":"Holy crap. Did you even read it?","commenter_a":"UCMJ does prohibit frat w subordinates. This was NOT RAPE. Rape is not consensual. She was consenting then because he pulled away? She claims rape?? Not fair. If she wanted to be an officer then suck it up buttercup.","post_message":"A Naval Academy teacher fights to prove he’s innocent of sexual misconduct. Then a lost cell phone is found."},{"comment_id":"10154236838279228","commenter_b":"Very interesting.","commenter_a":"EricBlakeburn Olivia Kesselring","post_message":"A UFO incident near St. Louis captured worldwide attention 15 years ago. Many of the witnesses were police officers."},{"comment_id":"10153465235771316","commenter_b":"I guess the woman in this pic is borderline retarded...","commenter_a":"They can store more farts too so that's good","post_message":"Women with larger behinds are healthier and more intelligent, study finds: @webpagelink"}]
