[{"comment_id":"10158040412050206","commenter_b":"I was thinking that too. Where is the Air Marshal?","commenter_a":"Good on the pilot.... but where the hell are some of the passengers to help??? Seriously....bunch of cowards.","post_message":"This 25-year-old passenger was restrained by a pilot after pushing and threatening a flight attendant on an American Airlines flight into Charlotte, North Carolina. @webpagelink"},{"comment_id":"10153944195789456","commenter_b":"Wht a woman will do against their children over a man. Smfh","commenter_a":"They should be stoned to death!! Wasting bullets on them is too humane....","post_message":"HORRIBLE: A 3-year-old was found duct taped in a trash bag in a closet in Arizona, and was surrounded by feces. Here’s the disgusting reason the suspect allegedly hid the child:"},{"comment_id":"10153492061886337","commenter_b":"Probation and a fine is all she may get. Prison you can't be that ignorant!","commenter_a":"This lady is an idiot, commited at least 3 different Federal Felonies... lol dumb broad. Well there's no Rebel flag in prison so she will be happy.","post_message":"GET TO KNOW Bree Newsome, the woman who climbed the flagpole at South Carolina's capitol building and took down the confederate flag..."},{"comment_id":"595288380595755","commenter_b":"We just had 2 bombings and a knifing involving these peaceful refugees after NOW RECEIVING OVER 10,000 of them and this idiot is still trying to sell them coming into our country! Well Obama you won't be in office next year and Trump is our mouth piece \" no vetting no refugees \" WE DONT WANT ANYMORE OF THIS CULTURE , ask Merkle in Germany about them, she said if she could go back and change her decision she would not have taken these Muslims in!!!!!!!!!","commenter_a":"He's wrong.........we have citizens right here that need our help first and foremost.","post_message":"President Obama says turning away refugees based on background or religion \"would be reinforcing terrorist propaganda.\" Agree or disagree?"},{"comment_id":"1178194115526177","commenter_b":"That's her idea of building America?","commenter_a":"Hillary supports blm and black panthers in that they say kill all whites and cops. And riots, looters, arsonists, and cop haters are all ok with Hillary.","post_message":"It's being called \"a monumentally stupid comment,\" and that's among the remarks we can print. You simply won't believe how Bernie Sanders is \"feeling the Bern\" from his own fans after saying white people don't know this one thing"},{"comment_id":"10153556298696130","commenter_b":"Hillary is a woman","commenter_a":"Trump isn't letting the terrorist in.. your boy Obama is and his right hand man hillary..","post_message":"This Donald J. Trump supporter reminds us that nobody has a monopoly on terror."},{"comment_id":"941299175911870","commenter_b":"Trio does not exist.. Just close borders of USA. And Americans go home please.. .","commenter_a":"But why? Much as I hate usa n what it stands for, what it does n how it treats my fellow african brethren, I still don't want it to cease to exist. What kind of sick minds wish such a thing? I'ld understand if z nazis felt zat way, for if it weren't for z Russians nazism would've triumphed, God knows for how long!!! But, why usa? Is my theory of kkk/nazi/zionists existence n zer devious work at z root of things once again? For me z 'trio' are one n z same!!!","post_message":"A top official in Moscow says Washington’s aspiration is to see Russia cease to exist as a country."}]
