[{"comment_id":"10153742106021167","commenter_b":"The smartest bag of dicks!","commenter_a":"Wow you people are about as smart as a bag of dicks..","post_message":"Conservatives are now demanding the FBI director explain to them why their fantasy version of the email “scandal” doesn’t match his factual one."},{"comment_id":"10154430644149411","commenter_b":"Wow and the racism starts. Why am illegal cause I have a latino last name? That's exactly the type of ignorance Trump types bring to the table. Also white pride has far deeper roots tied to hatred in this country. If anything you just proved my point. When KKK have rallies it's freedom and of speech. But if latino or black communities have groups such as black panters it an extremist hate group. You people are really stupid because your racism.is exactly what is creating the modern resistance. So keep on hating and bring more peope to my side..what you think after centuries of white dominance we wouldn't eventually get tired of that shit and start fighting back?","commenter_a":"Look here's what it is. The same people that like Trump ate the same people that make Obama watermelon jokes. It's all about white privilege for you guys. What's really behind Trump's popularity is the fear that white people's dominance is being threatened. \"But Ray,\" you'll say, \" there are plenty of minorities that support Trump. \" to which I say, that the US has done an excellent job of scrubbing away people's culture and heritage and whos propaganda has thoroughly brainwashed people into extremely nationalism. Cause guess what there are plenty of white people that are against Trump as well. Face it. Trump's entire campaign is based on xenophobia and white pride may ad well be his slogan.","post_message":"'It's also to show solidarity with all the people he has tried to harass and point out we are still here and not going anywhere'"},{"comment_id":"1069713516429844","commenter_b":"My Father and his family came through Ellis Island. They had to have a sponsor in the United States who guaranteed them a place to live and support until they were self-supporting. They were screened for disease. My Grandmother was almost refused because she was sea-sick for the whole journey. The government officials had to determine that it was only sea-sickness before she was admitted. Now, we have no idea what illnesses are being brought in to OUR Country through all these illegals and obummers immigrants. No wonder illnesses that we have virtually eliminated are cropping up now.","commenter_a":"Absolutely the way that it should be done!","post_message":"America's Freedom Fighters"},{"comment_id":"1231833570240008","commenter_b":"We voted for Obama twice now we are racist. A lot of african's and Hispanics voted for Trump. If Hillary would have been a better candidate and visited the states Trump won she would be president.","commenter_a":"And you're saying that the BLM, BLACK PANTHERS are any different. This shows how blind that you are","post_message":"\"These white Americans tuck their heads under cone-shaped hats and American flags ... training their guns on the unarmed, the innocent, the scared ...\""},{"comment_id":"10153365455244087","commenter_b":"@username , that is BULLSHIT! They purchased the assault rifles they used IN CALIFORNIA!","commenter_a":"No one has lost any rights to guns under Obama. No one has had any guns taken away under Obama. If ONLY the right wing could learn to try to GOVERN instead of just doing things that appeal to their right wing base, that would be just great!","post_message":"“Coming in the wake of the terror attack here in Paris, this horrific murder underscores we are at a time of war,” Sen. Ted Cruz said yesterday. “Whether or not the current administration realizes it or is willing to acknowledge it, our enemies are at war with us.\""},{"comment_id":"10153711356708188","commenter_b":"@username I completely agree. I about had a heart attack when Rand Paul supported McConnell over Bevin. I knew then that he was nothing at all like his father and he would never get my vote. This whole thing is reaffirming my belief that I should not vote Republican again. It will never self correct and I will never vote lesser of two evils again. So, now I wait for the third party candidates to get their faces out there. I hope one of them has the fervour of Trump, the Constitutionality of Ron Paul, and the knowledge and heart of Chuck Baldwin. And, no I won't even though Cruz seems to be on the right track, I won't vote for him if he remains a Republican... not that he would EVER get the nomination.","commenter_a":"Did you really need to sneak in a little attack on Rand Paul?","post_message":"Gee, let's see freedom caucus- you asked us to help you kick out the speaker of the house, then you asked us to do our homework on Daniel Webster. You told me that this is who you needed and wanted. I did. I spent hours in conversations, study and prayer because YOU ASKED ME TO. The listeners did too. I put my credibility on the line for you because you asked me to. Then you just pull out and go for the ROMNEY PICK? You told US to stand up and fight. We did. Now YOU sell us out too? Really?!?! The \"fix\" the republic needs is Paul Ryan? The man who never met a bailout he didn't like? A man who asked to be made king? 100% support and you can't vote him out? Your solution is MORE POWER FOR THE SPEAKER?!?!?!? I am quite frankly pissed and I ..."},{"comment_id":"1836845559870004","commenter_b":"She doesn't deserve to be nominated.. What a laugh..","commenter_a":"Her expressions are the worst.... From her constant head nodding to her wide eyed expressions. And what's worse is when she opens that mouth of hers to spew out a constant stream of lies...","post_message":"Balloons are released to celebrate the official nomination of Hillary Clinton & Tim Kaine."}]
