[{"comment_id":"873971869318028","commenter_b":"You can hack those toys so easily","commenter_a":"Junior Marquina Perez & @username I WAS NOT ABLE TO SEE YOUR REPLY :'(","post_message":"Do your kids like the Minions? One family did a double take after hearing their 5-year-old daughter's McDonald's Happy Meal Minion toy speak:"},{"comment_id":"807798315963065","commenter_b":"ENOUGH IS ENOUGH, DO YOUR JOB CONGRESS!!!!","commenter_a":"HOW is this legal?","post_message":""},{"comment_id":"10150849465384999","commenter_b":"Canada only lets rich Asians in obsessed with money!","commenter_a":"Keep letting Hordes of Immigrants into Europe!!!...Same goes for the U.S. of A., Canada & Australia!!!","post_message":"Victims of the terror attack on Bastille Day were honored on Friday in Nice, Paris, Rome, New York and Moscow."},{"comment_id":"10153818538521519","commenter_b":"She's ok with a total asshole who may blow up the world though apparently","commenter_a":"Her son did NOT even work for the State Department, he worked for the the CIA. Her comments and opinions about Hillary are completely irrelevant.","post_message":"Pat Smith at RNC: Hillary Clinton \"deserves to be in stripes\"..."},{"comment_id":"10154098504122541","commenter_b":"Omg you. Are too much really","commenter_a":"Ugh, putting my faith in Mike Pence to save us from Trump? Lose Lose situation. Pence is actually scarier, he just tweets less. Hmm, decisions lol","post_message":"Let's talk about the 25th Amendment."},{"comment_id":"1863241907237719","commenter_b":"You better not get one or I'm on your ass like a black cock!!","commenter_a":"Lamar Dent Damon Hardison","post_message":"Roast sessions all day! #WSHH"},{"comment_id":"10153346238078690","commenter_b":"Still as barbaric as before, that was why it was difficult for Mandela to organized them and fight for free. That is why he has to do it on his own. Animals never changes.","commenter_a":"Free from the ravages of inteligence and absolutely racist !","post_message":"Thousands expected to march in South Africa against attacks on foreigners @webpagelink"}]
