[{"comment_id":"10153874849832439","commenter_b":"I heard her spine landed on top of police car. Best news I heard today! Rot in hell psychotic bitch!","commenter_a":"Can she blow herself up again, with all her brethren with her?","post_message":"Hmmm, is she making the (Eiffel tower) peace sign? Islam is peace, brother. The good news is -- she's dead. The bad news is Obama wants to bring these 'widows' and 'children' like the refugee Boston bombers to our shores. This savage tried to lure police within detonation range by crying \"help me, help me\" before blowing herself up."},{"comment_id":"10152710610321051","commenter_b":"Many Americans dont' have enough to while this couple seems to be eating too much - thanks to benefits they are not entitled to!","commenter_a":"Wrong!!!!","post_message":"A couple that lives off benefits because they’re too obese to work got another gift from taxpayers."},{"comment_id":"10153540366322061","commenter_b":"It's not. But I've never seen it happen. Making laws to protect the rights of others is NOT discrimination. Even if you find the laws offensive.","commenter_a":"So why is it alright to discriminate against Christians?","post_message":"Charles Barkley pushing the NBA to move the All-Star game from North Carolina due to state's so-called \"anti-LGBT\" law. \"As a black person, I against any form of discrimination.\" @webpagelink"},{"comment_id":"1313943068640455","commenter_b":"Ol bitch ass!!! Now come love on meeeee","commenter_a":"@username Amber Nicole yo ass lol","post_message":"Her mood swings are real!"},{"comment_id":"10153190438888812","commenter_b":"Plus many red states consider sand and salt a slippery slope toward Socialism.","commenter_a":"All the Yankees talking about \"that isn't snow!\" Must not realize how right they are. It's ice. It's infinitely more dangerous and icy in the south than it ever gets in the north.","post_message":"WATCH: \"It's over\" -- Snow and ice are still triggering dangerous, cringeworthy conditions on roads in much of the eastern US, including this Huntsville, Alabama, neighborhood - ABC News Weather"},{"comment_id":"1025902810798360","commenter_b":"@username you are crooked and You are a loser. You are a complete disgrace. You will not make America great again. You have no idea what you are doing. You are a complete idiot. Do us all a favor and drop out. Stop spreading hate. The only reason your rich is because you got money from your father. you are going to make America a laughing stock. please reply to this message. Be a man and reply to my message. Debate me. don't be a chicken.","commenter_a":"@username you are crooked and You are a loser. You are a complete disgrace. You will not make America great again. You have no idea what you are doing. You are a complete idiot. Do us all a favor and drop out. Stop spreading hate. The only reason your rich is because you got money from your father. you are going to make America a laughing stock. please reply to this message. Be a man and reply to my message. Debate me. don't be a chicken.","post_message":"Thank you for the incredible amount of support last night- San Jose, California. I love you all - we will deal with the thugs & criminals -- we will build the wall --- and Mexico will pay for it!"},{"comment_id":"10154230629253854","commenter_b":"trump will take her down,no one will take orders from a lier.","commenter_a":"Go make cookies Hillary.","post_message":"Hillary Clinton Orders Liberal Media to Get Tough on Trump (VIDEO)"}]
