[{"comment_id":"710448769145701","commenter_b":"I tell these slouches to pull up there pants.","commenter_a":"Someone told me that came from prison and meant you want to get fucked in the ass ?","post_message":"Two thugs had the pleasure of living in a jail cell for a few days. This is great. Do you think all thugs with sagging pants should be arrested?"},{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"},{"comment_id":"896989227005981","commenter_b":"How much longer are we going to let this jackass destroy OUR country","commenter_a":"Will they cover whitr slaves also...or will they remain color blind???? NEVER HAPPEN ON AMERICAN SOIL WOTHOUT ANOTHER CIVIL WAR........JUST WHAT OBAMA WANTS...DIVIDE AND CONQUER","post_message":"Wait. WHAT?!"},{"comment_id":"1033670103395908","commenter_b":"If I looked like Debbie, I would be a liberal to. Democrats know they got messed up looking chicks.","commenter_a":"Can we have at least 10 debates?","post_message":"Chair of the DNC Debbie Wasserman Schultz is taking your questions about the Democratic debate. What would you like to ask? Leave your questions in the comments, and we'll post Rep. Wasserman Shultz's answers in a follow-up tomorrow!"},{"comment_id":"1171597936185008","commenter_b":"Says the white woman. Lmfao","commenter_a":"It's time for big changes? It's not a change to use racism as a command to get to the top despite our achievements. Jada Pinkett Smith, the talentless half black lady whose name is only known based on the celebrity of her husband. This cause needs a new spokesperson, perhaps a black celebrity with some actual talent worthy of an Oscar.","post_message":"“It’s time for big changes.”"},{"comment_id":"1128841157202139","commenter_b":"You STUPID, STUPID WOMAN. NO we as you call us\" White Folks\"are NOT going to stop saying ALL LIVES MATTER!!!. That is in no way a RACIST comment. In fact it is a very true comment. Where does all this stupidity come from. You need to read your BIBLE & pray long & hard before you start spouting these comments.","commenter_a":"NOT THE SHARPEST KNIFE IN THE DRAWER !!!!!","post_message":""},{"comment_id":"1745816418974356","commenter_b":"This woman's head is bad.","commenter_a":"That's the problem, she just let 4 Americans die, you idiot.","post_message":"Whoopi Goldberg: Gee, so sorry that you find the deaths of innocent Americans \"boring.\" But for the rest of America, we find the Benghazi massacre reprehensible and unforgivable. And on behalf of the families who can never see or hug their loved ones ever again, We the People demand transparency, honesty, and justice. So get over yourself and your need for constant amusement, Whoopi. Hillary lied, Americans died. Signed, We the People"}]
