[{"comment_id":"10154647559481323","commenter_b":"The woman will never listen","commenter_a":"The public are not - a certain part of it are while the majority supports it.","post_message":"\"People aren’t stupid. They may want less immigration – but not at any cost. The stupidity was a referendum campaign that boiled everything down to that one issue. But people don’t think just one thing, they have many views and priorities: when the facts change, they tend to change their minds.\""},{"comment_id":"10154152289921957","commenter_b":"The woman is brainwashed!","commenter_a":"Why are these Muslims out of their country, If they're not happy with our system & law if they all go back where sharia law Is permitted everyone will be happy. Just go back and let the world be happy ,the rest of the world doesn't want sharia law. Don't go to other countries & try to convert to your beliefs, we are not interested at all, go back to your world. .","post_message":"The Women's March organizer thinks Trump is going to be oppressive to women and minorities.... as she fearlessly defends Sharia Law."},{"comment_id":"1150660831667337","commenter_b":"@username shut up fatass hoe","commenter_a":"America was built on hate! Just ask the Indians.... oh wait it's hard to find any because the white man almost killed off the whole entire race for land?? Land that was never theirs?? Land that is foreign to them? Oh and we are the savages?","post_message":"Good question #Philippines #WSHH"},{"comment_id":"10152912675916051","commenter_b":"smith you ain't a pimple on my ass. Your pissed because everything I said is true. And I hope you need a cop and they make a stop on the way. Your not in my tax bracket, you don't have any skills ( unless having the government feed and house your little bastards ). All you good at is living off other people and their money. Your nothing but a waste of skin. Get a life and a job. Your the POS loser. And I can see you never served your country either, have you bitch?","commenter_a":"They said they filmed it. Were the hell is the rest of the film. It's funny they only show the cop saying something. What was said and what happened up to that time????","post_message":"When the guy in the car asked why he was being arrested, the officer didn't miss a beat: \"Because I feel like arresting you.\""},{"comment_id":"918831531585696","commenter_b":"Abd the dems preach tolerance but are hnwilling to be tolerant.","commenter_a":"Democrat,s = cult being lead by a zombie . Set devour America","post_message":"Just in..."},{"comment_id":"613516002130239","commenter_b":"Women wear ties","commenter_a":"Men are expected to wear ties, that's also sexist.","post_message":"Nicola Thorp says she was laughed at for asking if a male colleague was expected to wear heels too. 👠👠"},{"comment_id":"10153032074653145","commenter_b":"How date she!!","commenter_a":"'Stupid is as stupid does' Glad there's one less pea size brain off the streets. She and others with that type of violent ideas should be dealt with accordingly. Enough of thugs who think they can spread such animosity in a country with so many opportunities to do something positive, enough!!","post_message":" thought about shooting every white cop I see in the head..\" That's part of a Facebook post that got this mother arrested #WFTV"}]
