[{"comment_id":"10153476026331509","commenter_b":"ladies ... let me increase ur chances looool","commenter_a":"Looks like I'll be dead earlier than I thought lol","post_message":"Being alone and feeling lonely increases your chances of early death by roughly 30%, researchers say. Simply being in the presence of others may not be enough: @webpagelink via CNN Health"},{"comment_id":"963164673751396","commenter_b":"Or, why do we have money to support refugees but not vets or social security?","commenter_a":"because welfare has got our money","post_message":"Americas Freedom Fighters"},{"comment_id":"10152814329771636","commenter_b":"The LibDems should have fought for a workable PR system when they had the opportunity.","commenter_a":"As much as I don't like the UKIP he is right","post_message":"'I now have to think seriously about my future life, and what I want to do'"},{"comment_id":"10154582886013725","commenter_b":"Go away and have another affair with the maid. You have your nerve. You embarrassed your whole family!","commenter_a":"If trumps doing what he said I hope all you moron trump supporters cozy up 15 billion for the wall that you ignorant assholes and trump are foolish enough to build. Doubt that right so stfu scumbags.","post_message":"Arnold Schwarzenegger says Trump is completely embarrassing the United States on the world's stage right now. Is he right?"},{"comment_id":"1078994498821381","commenter_b":"This is OHBLOWME's army!!","commenter_a":"Obama has blood on his hands","post_message":"BATON ROUGE KILLER'S SOCIAL MEDIA Bought Into Obama's Anti-Cop \"JUSTICE\" Rhetoric [Video] Obama is heard by people like this killer...blood on Obama's hands!"},{"comment_id":"1949140865300152","commenter_b":"Yo baby daddy work at the post office now? 😩😂 Imani Ave","commenter_a":"MsJackson Ifyounasty i think I would have sprayed them too would you??","post_message":"A postal worker caught on camera appearing to pepper spray three dogs. What happened to the dogs and how did USPS respond? ABC13-Jessica Willey has the details: @webpagelink"},{"comment_id":"956407617772796","commenter_b":"Really?? No, really. Once again giving twits a bad name!","commenter_a":"Whites freed,WTF How many Northern soldiers had to die for southerners idea that it is ok to enslave others.Sad thing is there's still bands of ignorant racist That still feel the same way now a days.","post_message":"Leave it to two David Barton and Glenn Beck to have a historically inaccurate and completely offensive conversation about race... Shared by Occupy Democrats, LIKE our page for more!"}]
