[{"comment_id":"1710328329254279","commenter_b":"@username they are too stupid to listen.....republicans are turning into the lowest pond scum.....shit for brains","commenter_a":"I don't like the media. They don't publish the news unless it goes there way.","post_message":"WHOA This is going to start a RIOT... Obama deserves to be in JAIL!"},{"comment_id":"10154101126057680","commenter_b":"That's why we as black folk don't claim her ass! She can take a seat over there with O.J. and Tiger Woods!","commenter_a":"She is going straight to hell for stating people will BOW DOWN to that clown. Who talks like that????? OMG! Sad part about it ... she's oh, so serious. smh This chick needs to be mentally evaluated. Clearly, the elevator doesn't reach the top floor in that screwed up head of hers. Delusional is an understatement! She is so embarrassing ... :(","post_message":"Omarosa Injured at the White House, Reportedly Rushed to the Hospital on a Stretcher"},{"comment_id":"10153293825958132","commenter_b":"Yes, she's milado so she needs to stop.","commenter_a":"She's black and white..so this always confuses me. I guess you can pick your race when it suits you.","post_message":"Halle Berry admits she's \"disappointed\" that no other black women have won the top acting prize."},{"comment_id":"10152799476958598","commenter_b":"she is so un educated on what abortion is!!","commenter_a":"I beg to differ...","post_message":"What???"},{"comment_id":"10154846804139411","commenter_b":"Goat fucking muslims","commenter_a":"Stupid curry eating Hindus","post_message":"'Not in the spirit of a Sport'"},{"comment_id":"10153386535509099","commenter_b":"What shame. Thought most grown women are maternal. I was right \"MOST\" not all.","commenter_a":"Maybe we should stay home with our babies.","post_message":"A hidden nanny cam captured more alleged abuse against the 3-year-old girl and 1-year-old twins @webpagelink"},{"comment_id":"465274473632508","commenter_b":"Goddamn witches..","commenter_a":"Animals.","post_message":"This is the first time they have beheaded civilian females."}]
