[{"comment_id":"10154405827009170","commenter_b":"Two evil sisters!","commenter_a":"Goofy the fake indian with Chief \"Lie to your face\" Clinton!","post_message":"Lord help us if we have to listen to these two for the next 4-8 years..."},{"comment_id":"10152909457852869","commenter_b":"*morons* there is not an \"a\" in the word and you do not use an apostrophe in a plural. Have a nice day!","commenter_a":"Please do not compare the rattlesnake to Islamic Jihad. The rattlesnake believes in live and let live. Leave them alone and the rattlesnake will leave you alone!","post_message":"What do Islamic Jihad and rattlesnakes have in common? You don't negotiate with them, you don't feed them...you take their heads off before they bite you. WATCH and SHARE..."},{"comment_id":"1226253117412922","commenter_b":"White peoples God George Soros funds these riots !","commenter_a":"If there is any one in the car, it is also attempted murder, and MUST be prosecuted.","post_message":"Nails it!"},{"comment_id":"10153411171720950","commenter_b":"Ron, please stop being materialistic with cheap cars. Are you trying to intimidate or impress your FB friends? Bad taste, Sir.","commenter_a":"Trump Supporters are not motivated by fears, we're motivated by FED UP! We're tired of our voices being stifled and the liberals/media doing all they can to take our freedom of speech! This time we WILL have the last word! <3 Common Sense Approach! TRUMP! 2016","post_message":"Donald J. Trump: \"We love Nevada!\" Watch his full victory speech after projected GOP caucus win."},{"comment_id":"10152635472271770","commenter_b":"she's a glorified prostitute. complains about the johns, but keeps taking her clothes off and taking the money","commenter_a":"and the money....","post_message":"Except for the freedom of speech, apparently."},{"comment_id":"10154022766707693","commenter_b":"Another idiot spending American tax dollars to pay for illegals to be here with American tax dollars. And when they commit a crime. They will use American tax dollars to house and feed them in jail and to pay for their attorneys.","commenter_a":"😜 I'm sure President Trump is scared...","post_message":"BREAKING: Washington State Attorney General Bob Ferguson announces that he will file a federal lawsuit in response to President Donald J. Trump's travel ban."},{"comment_id":"10153516705331337","commenter_b":"I'm sorry but what did he expect...how sad that I grew up.on this family show N all his family n friends stood by him while he lied","commenter_a":"Bye asshole.","post_message":"FALL FROM GRACE: The Bill Cosby saga continues as word has broke that the comedian's talent agency has cut ties with him over his sexual allegations..."}]
