[{"comment_id":"1010063709005886","commenter_b":"Don't ask questions.....get them out !! We don't want those barbarians here !! They have proven they can't live in a civilized world .....they try forcing there garbage on everyone !! I refuse to live like these monsters !!!! Deport obama along with his muslime scums !!","commenter_a":"Its about time! He had relocated OVER 353k muslims since he entered offc. NO CHRISTIANS - he left them to be slaughtered by his isis comrades. All of these relocated muslims r all on welfare and considered ILLEGALS. Living off the backs of 741915279236631s they hate.","post_message":"Finally, the GOP is getting serious about asking questions about Barack Obama colonizing America with Muslim Refugees!"},{"comment_id":"1005002076233312","commenter_b":"We do but not you please.","commenter_a":"She doesn't have a heart","post_message":"Do you agree with Hillary Clinton? #SCPrimary"},{"comment_id":"484838455040068","commenter_b":"Yes, ban Sharia Law in the USA","commenter_a":"I hope tsa patted her down throughly to make sure she wasn't carry bombs, I think the whole thing is a set up!","post_message":"She walked on the plane wearing her Hijab, boy was that a mistake. Shariah Law is dangerous, we support the patriots that stand against it. Should Shariah be banned in all 50 states?"},{"comment_id":"1056978507726395","commenter_b":"we Irish and Scottish built it","commenter_a":"Why does she have to keep using the \"I live in a house built by slaves\"? What about the whites, free blacks and immigrants who also helped build the White House? Stop playing the damn slave card already.","post_message":"Warning: Sharing this with your liberal Facebook friends may spontaneously burst bubbles..."},{"comment_id":"10152600779162217","commenter_b":"How is it funny how we'll let an aeroplane be controlled by a computer, when we all know of the very high general standard of trained pilots we have flying our passenger aeroplanes who are there too? Just thought I'd point out one of the stupidest thing I've ever heard.","commenter_a":"I didn't think it would be long before we had driverless cars. I am a terrible driver so this would suit me right down to the ground.","post_message":"Driverless pods, set to hit the streets of UK cities, are unveiled for the first time. Would you be able to relax and trust technology to take you for a ride? @webpagelink"},{"comment_id":"10153519481412377","commenter_b":"She'll just continue to perjure herself if they do and unfortunately with the Obama DOJ behind her, nothing will ever come of it. Miscarriage of justice? You know it.","commenter_a":"This is such bull, it goes on and on and on. If they were going to do something , it would have been done.","post_message":"Agents will probably seek to interview Clinton soon, if they haven't already, former Justice Department officials said."},{"comment_id":"10153366601141770","commenter_b":"Where is our freedom of speech??? Keep your rioters away from TRUMP! You all send them with your lies of deceit...so you can have business as usual in Washington! We Americans see right through you...the uneducated don't...or the naive youth..","commenter_a":"what happened to freedom of speech? trump had nothing to do with the violence at his rally in chicago these were paid punks to not let him speek","post_message":"Mitch McConnell told reporters he and Donald J. Trump spoke by phone Tuesday and he encouraged the New York businessman to “condemn” the “violent expressions” at some of his political rallies."}]
