[{"comment_id":"10153891492220575","commenter_b":"A DISGUSTING IDIOT RACIST TRADER WOMAN","commenter_a":"WHO HIRED HER RUBIO OR CRUZ?","post_message":"Surprise! So-called \"Trump supporter\" is a far left Union activist!!"},{"comment_id":"10153031435480671","commenter_b":"Soldier on ladies!","commenter_a":"Ricky Myette","post_message":"What do you think about two women graduating from the Army's elite Ranger School?"},{"comment_id":"10152954398027452","commenter_b":"Feminists sure do preach equality until it comes to self-defense.","commenter_a":"The biker needs to be commended on how well he held his composure after being punched more than once by an older man. That Football player that punched a girl needs to take lessons from this guy.","post_message":"Motorcycle meltdown! A driver goes berserk after he says he was cut off by a biker. But what happens next escalates the situation to a dangerous new level that ends in a medical emergency. @webpagelink Is \"driver vs. biker\" road rage getting worse? The confrontation caught on camera. Tonight at 11 from ABC7 Eyewitness News."},{"comment_id":"10154411481819062","commenter_b":"Or the reverse at movie theaters. How will women react when a bunch of not-women get in line in front of them while the men's restroom has nobody in it?","commenter_a":"So he/she's will get to sit on the can in the Women's rest room. Well turn about is fair play, women using the men's room when there is a line at sporting events. How will men react when they are standing at the urinal and a woman walks by heading for the toilet stall?","post_message":"HAPPENING TODAY: In about an hour, business leaders are expected to reveal their plans to support the Houston equal rights ordinance."},{"comment_id":"10154190292923908","commenter_b":"My balls itch !","commenter_a":"perhaps they learned something from mother nature, (she fights back) with a swift justice. earthquake anyone else ;) it's time to rethink the old ways and start a new, where nature comes first <3","post_message":"Good..."},{"comment_id":"10153234463025779","commenter_b":"Amazing political argument Mark. You've persuaded me to support Trump with your carefully worded statement.","commenter_a":"Biff Trump is a Joke..","post_message":"It started out as a joke: Donald Trump running for president! What better way to spoof the thinness of the Republican field than to shove a bombastic reality star with orange hair, a sixth-grade vocabulary and no behavioral filter onto the GOP debate stage. But, as Matt Taibbi writes, the joke turned ugly fast."},{"comment_id":"607183962802381","commenter_b":"@username then maybe you should move out of America if you can't handle it. Bye Felicia","commenter_a":"Only reason big cities elect her is Bc they are the low life's looking for their hand outs... Guess what?! You'll be returning your Obama phones soon :) haha","post_message":"We’re in New York with Chris Moody and Vanessa Yurkevich who are talking to voters about tonight’s dramatic election results. Any questions? Let us know! #CNNElection #ElectionNight #MyVote"}]
