[{"comment_id":"1858889271057520","commenter_b":"Bitchhhhh","commenter_a":"@username Jayquan Parker @username","post_message":"A woman drove her SUV into a T-Mobile store after she says she couldn't get her cracked iPhone replaced. @webpagelink"},{"comment_id":"10153736495329753","commenter_b":"Yes","commenter_a":"Of course he's backing Killary. He's a libtard!","post_message":"Incarcerated hip-hop artist Bobby Shmurda has endorsed Hillary Clinton’s 2016 presidential bid. The 21-year-old leader of the Brooklyn-based GS9 crew is the latest in a string of high-profile hip-hop artists to back the Democratic front-runner, including Snoop Dogg, Pharell and Eminem. According to Shmurda, Clinton is the most suitable candidate to take over the Oval Office in November because of her “strong mind” and empathetic nature. “I’m going for Hillary, man,” he told Vibe. “I like... @webpagelink"},{"comment_id":"10153699809290496","commenter_b":"Haha their wives might...lol","commenter_a":"As long as they bring home the gold, who cares??","post_message":"Three members of Team USA basketball reportedly ended up in a high-end brothel, but it was an apparent misunderstanding: @webpagelink"},{"comment_id":"10152982403506051","commenter_b":"Good grief....is she for real? She willingly showed up at his house to engage in sex with whom she was gullible enough to think was a male model... Really?????????? She DOESN'T have a leg to stand on in court... STUPID does as STUPID is...smh","commenter_a":"She had to be incredibly stupid and he is a douchebag","post_message":"A woman thought she had been chatting online with this man. They met in a dark hotel room and she wore a blindfold while they got intimate. When she took it off, she saw someone she wasn't expecting."},{"comment_id":"1183772531660175","commenter_b":"However, he will be a much better President for the nation then fumbling Obama. Rather have competent than classy.","commenter_a":"I agree","post_message":"AMEN."},{"comment_id":"10155450012565354","commenter_b":"Common Women are not going to waste 2000/yr on themselves. That is uncommon disposable income.","commenter_a":"You are not close to \"the common woman,\" if you refer to her as \"the common woman.\"","post_message":"Gwyneth is quickly becoming our favorite celebrity."},{"comment_id":"736002233211226","commenter_b":"She is such a wonderful bitch isn't she!?!!!","commenter_a":"I like Karma.","post_message":""}]
