[{"comment_id":"1835870700020882","commenter_b":"Woman belong in the streets, your right...","commenter_a":"Every single person that's out there marching there's 10 that wish they could have","post_message":"From CommonDreams: \"The second day of the Trump administration has seen an unprecedented wave of protests swell across the globe, as the Women's March on Washington and its sister marches on all continents—yes, including Antarctica—fight back against the U.S. president's frightening rhetoric.\""},{"comment_id":"719541998236378","commenter_b":"Happy birthday keesh!!!? Love you and am so proud of all of you Guy's","commenter_a":"40,000 likes, is that going to help?","post_message":"Putin is firing on all fronts after news of a Russian plane being shot down. Russia is doing good work. Can we get 40,000 ‘LIKES’ for Putin bombing Syria?"},{"comment_id":"1117284038339327","commenter_b":"Please don't. Why would she want to shame herself in this way?","commenter_a":"will the sausage be halal free?","post_message":"Cue mass exodus from the city centre."},{"comment_id":"10153720423624312","commenter_b":"Thank you. I let my daughter go camping!","commenter_a":"Poor parenting skill for letting her daughter go camping, wow he is delusional.","post_message":"Shirley Fortner, 70, has re-lived the night of her daughter death five times during five prior parole hearings. Bret Arbuckle killed Angela Lyn Fortner in rural Ash Grove, Mo., in 1989."},{"comment_id":"1116556865104033","commenter_b":"ignorant bitch, we are ALL immigrants!!!! VOTE HER OUT & VOTE STRAIGHT BLUE, FEEL THE BERN!!!!!!!!!!!","commenter_a":"When is the last time the republicans filled a bill about anything that would benefit the American people? These fools are of limited intelligence to be sure. Please people vote Blue every chance you get.","post_message":"Republicans are now setting their sights on our librarians."},{"comment_id":"10152813699938145","commenter_b":"R u ok, smiling with a chainsaw in your hand.","commenter_a":"I know this guy. He's out of his mind","post_message":"Daytona Beach police are hoping you share this picture. They're looking for Allen Phillip Fike. They say he may be armed with an AK-47 and has threatened to kill officers if they approach. Fike is wanted on several outstanding warrants. He could be driving a white Toyota Camry."},{"comment_id":"10153104489209726","commenter_b":"Bring it bitch","commenter_a":"Think again ! Governors and sheriffs need to lead the people and fight federal corruption and over reach !","post_message":"WATCH: Eric Holder On ISIS: 'I Think We're Winning'"}]
