[{"comment_id":"920858977949524","commenter_b":"Hillary is a whore!","commenter_a":"What does this say about Hillary Clinton?","post_message":"BREAKING - Hillary Clinton's Sex Scandal"},{"comment_id":"1656739891212938","commenter_b":"JJ Fuller Jeffrey Kalmonson Jojo Stewart","commenter_a":"Those who are caught in the left/right paradigm are often not ready for critical thought and the unforgiving truth. If you agree please comment (even 2 words) and share! (y)","post_message":"Free minds, free people.. this world needs more of them Follow: The Free Thought Project.com #B2TF"},{"comment_id":"927400923975122","commenter_b":"Lol. Kinda harder for a white person to flee the country. Try again. If your illegal then you are ILLEGAL. Their is no right about it.","commenter_a":"For all of you saying if the man who caused this accident was an \"illegal\" or \"undocumented\" man, what if the victims were illegal? Is that going to change how tragic and sad this is? Jeez, you would think the older the wiser but it seems to be the older the dumber and ignorant","post_message":"MCSO: \"ONE OF THE WORST DUI CRASHES WE'VE EVER INVESTIGATED.\" 5 A-M Sunday morning, Sheriff's deputies say 23 year old Cesar Villanueva, driving a white truck, slammed into the back of a Honda waiting at a stoplight in Avondale. The impact virtually destroyed the car. The young man and woman in the Honda were pronounced dead at the scene near Avondale Blvd. & MC 85. Detectives say Villanueva was speeding and was impaired. He is in custody. Details at 5."},{"comment_id":"763624153793368","commenter_b":"@username..Bye Felicia, go suck an egg","commenter_a":"I would waited until he falls asleep, and pull me a loreana bobbitt ...get a Surgical scapple do a nice clean quick slice, get me some tweezers and carry it and throw it on the freeway, and let someone run over it. it ain't big anyway. second scenario, get some super glue and glue his little hands to his little tilwinkle!","post_message":"Did you catch this moment from Melania Trump at the inauguration? Via In The Know"},{"comment_id":"1252850228086868","commenter_b":"Hang the bitch","commenter_a":"You all just racist that's why you all up all in trumps ass with his bull so take you all racist ass and do what you do best talk mess about real ppl. Trump going to blow your mind when he turns on you and do what's right","post_message":"Hillary Clinton is desperate these days and has even officially taken to getting down on her knees to beg the American people after Congress announced their next big plans for the corrupt Clinton – and the brutal nature of them has got to have Hillary downright horrified. @webpagelink"},{"comment_id":"10156020385660725","commenter_b":"#FameWhoresDo","commenter_a":"Brooke the has been dethroned...","post_message":"A new celebrity has claimed the top spot on Instagram, setting a record on the social media site ----> @webpagelink"},{"comment_id":"10152543335115933","commenter_b":"Amen!!","commenter_a":"Leave our kids alone! GET RID OF COMMON CORE!","post_message":"It's about time we get college costs under control, and I'm glad to have Ohio's college and university presidents on board as we move to make it happen."}]
