[{"comment_id":"889430217827633","commenter_b":"@username alright Kim calm down!","commenter_a":"Ellie Metchette @username","post_message":"It will be in 2017 and here is the new teaser trailer. // Stranger Things"},{"comment_id":"10155514073390354","commenter_b":"Oh darn...NOT!!! Good riddance!! Hopes they ALL go up in flames. Enjoy those virgins, buttholes!!!","commenter_a":"Another dead terrorist, WOO HOO!!! KILL THEM ALL, LET GOD SORT THEM OUT!","post_message":"Height: 5'11\" Chest: 40\" Waist: 32 Currently Not Available for Bookings"},{"comment_id":"10152879630121336","commenter_b":"Shes got her hands full.","commenter_a":"Blessings","post_message":"A Montana woman gave birth to a set of identical triplet boys in early December, a rare occurrence — especially without the aid of fertility drugs. @webpagelink"},{"comment_id":"10154778794215470","commenter_b":"@username Get her to California!","commenter_a":"All I know is that my American dream was quite shattered when I was thrown out of my job after three decades because I was labeled \"old\" (over 50) and insurance premiums were too high, so I was replaced by four cheap employees. Who was protesting for me? Middle class dreams have been more than shattered - we are the poor working ourselves to death to pay for the poor that don't want to work?","post_message":"\"My story will be much like others who dedicated their lives to their dream — the American dream — and whose intentions and lives were turned upside-down on Friday without notice or reason.\""},{"comment_id":"10154408526388352","commenter_b":"Boobs are for food NOT fun!!!","commenter_a":"Well that was mean","post_message":"'Step outside and button up': Judge blasts mother and kicks her out of courtroom for breastfeeding her eight-month-old son during custody hearing"},{"comment_id":"1439319502750684","commenter_b":"Scum","commenter_a":"When will your congress do it's job and imprison that traitorest SOB???","post_message":"A horrified nation learned this week that President Obama handed over $1.7 billion in cash to the terror masters of Iran..."},{"comment_id":"10153542667459087","commenter_b":"Liberal democrats won't be happy until every city in this country looks like this..","commenter_a":"Trump could tell a Muslims being shot with bullets dipped in pigs blood story and his support will continue to grow.","post_message":"“He took 50 bullets and he dipped them in pig’s blood,” Donald J. Trump said. “And he had his men load his rifles and he lined up the fifty people, and they shot 49 of those people. And the 50th person, he said, ‘You go back to your people and you tell them what happened.’ And for 25 years there wasn’t a problem.” WATCH:"}]
