[{"comment_id":"10153293825958132","commenter_b":"Yes, she's milado so she needs to stop.","commenter_a":"She's black and white..so this always confuses me. I guess you can pick your race when it suits you.","post_message":"Halle Berry admits she's \"disappointed\" that no other black women have won the top acting prize."},{"comment_id":"10156520680400354","commenter_b":"Atheists can suck my balls.","commenter_a":"Why do all the liberal atheists shit on Christianity on this page so often? Why don't you dis Islam? Why not any other religion? It's pretty pathetic that you join a conservative page with one intent, to act like complete dicks to anyone with a conservative or a Christian belief. Are you trolls being paid?","post_message":"Not EVERYONE is afraid to stand up and be counted..."},{"comment_id":"1774184492816291","commenter_b":"@username racist idiot.","commenter_a":"NO WAY! No one else should be added to Mt. Rushmore, but especially not Obama! There are a lot better President's that could have been added, but not him!","post_message":"Obama's Face To Be Inserted Into Mt. Rushmore. Don't mess with this national monument. Do you think Obama's face does not deserve to be up there?"},{"comment_id":"1365633703532878","commenter_b":"@username...Such a joke!!! Hillary should just accept it...it's over...Trump won!!!","commenter_a":"“Anyone not willing to accept the results of an election is a danger to democracy.” - Hillary Clinton","post_message":"As Wisconsin prepares for a recount..."},{"comment_id":"10156192968210354","commenter_b":"This witch has lied, cheated and crooked everything she come in contact with in Washington.....she deserves to be in prison but not as long as the democrats up hold her, she will continue to get away with everything.","commenter_a":"Obombass will back Biden but only if obombass can vice president..... dictator","post_message":"***BREAKING*** \"...raises the possibility that the Democratic presidential candidate’s correspondence eventually could become public.\""},{"comment_id":"10152699530401051","commenter_b":"This brittany chick needs her head examined.","commenter_a":"He was born male, he died male. No matter what he felt,","post_message":"These parents faced nonstop criticism after their teen committed suicide by walking in front of a tractor trailer. Now they’re speaking out."},{"comment_id":"1275765532466713","commenter_b":"THIS IS WHAT america going to get if hillery elected .. this Muslim imam funded to Hillary clinton campaign.@webpagelink.. have a great islamic future for Americans","commenter_a":"thie is a foto shop pic trump u moron","post_message":"ANY FELLOW JEW VOTING FOR CLINTON IS A DISGRACE TO OUR PEOPLE!"}]
