[{"comment_id":"10156715004010354","commenter_b":"Lord forbid she have a mind of her own.","commenter_a":"How totally racist is that !","post_message":"The NAACP Image Awards is ________________."},{"comment_id":"10155469339470093","commenter_b":"NOOOOOOOOOOO!!! PLEASE no!!!!! Idiot progressives!!!","commenter_a":"Why would this NOT piss off everyone in NY who are legal tax paying American citizens??","post_message":"The impossible may soon become possible."},{"comment_id":"10153187675581336","commenter_b":"Obviously the Muslim student. If she doesn't want to watch it go get a coffee or do something else. I mean I don't like certain movies but instead of causing a ruckus I just don't go see it. Remember...we do live in a FREE country.","commenter_a":"We're just going to let them dictate to us what we can watch in our own country!?!","post_message":"President of the University of Maryland College Republicans: \"This isn't a racist film. It's about a decorated American war hero who [risked] his life for you and me and all the viewers.\""},{"comment_id":"10155610147785389","commenter_b":"Maybe we all need too draw more Cartoons/dont like it leave our Country.If we went to there Muslin Country they cut your head off are take your body parts for opening your mouth,so i think we all need too fight back too these ugly Muslin who think they are going too rule America and kill us for nothing.All they are Communist and they are brought in too our Country too destroy ,let them destroy there own.Lock these borders and stop letting them build camps too close too us.","commenter_a":"The Lamestream media are sell outs to this great Republic, and therefore deserve nothing but disdain from all true patriots.","post_message":"Question of the Day: Is the mainstream media wrong for criticizing Pamela Geller, instead of the radical Islamists?"},{"comment_id":"10153927537756350","commenter_b":"Glad she isn't winning the contest. Shallow personality and spoiled.","commenter_a":"He didn't need to interview her and ask for an apology, when he already did the same night the mistake happened. She's a spoiled brat looking for attention, and of course Steve Harvey is the way. What it bothers me more, is the fact that he and his family has been threatened, and the media still paying attention to her, she's greddy! #getoverit #sorelosers","post_message":"See Steve Harvey come face-to-face with Miss Colombia Ariadna Gutierrez, the contestant he accidentally crowned Miss Universe."},{"comment_id":"1078205312195129","commenter_b":"She will walk! MSM will guarantee it.","commenter_a":"She served on the Watergate committee. That's where she got the idea. Hillary did get fired from that commission for lieing. She is the original old crony.","post_message":"Hell, Nixon only erased 18 minutes. Hillary erased literally everything."},{"comment_id":"10154813371927787","commenter_b":"Hate to tell you, but Nordstrom is an American company..","commenter_a":"President Trump daughter will make it even more with us American women behind her.. I will not be buying from these companies any longer....I buy American and I Support American...","post_message":"Press Secretary Sean Spicer weighs in on Nordstrom dropping Ivanka Trump's fashion line. is a direct attack on [President Donald J. Trump's] policies and [Ivanka's] name. @webpagelink"}]
