[{"comment_id":"1051832858188283","commenter_b":"That's why we're in the place we are now,to no where.","commenter_a":"Sure makes some pretty good points","post_message":"This extremely popular \"Bernie\" meme has tens of thousands of likes and shares yet it reflects a SAD reality about young people today and the public education system in America. Watch as we expose the sad truth behind this meme. [READ]"},{"comment_id":"10150953576709999","commenter_b":"I know plenty of women who do this kind of thing in their little girl circles. It's just ridiculous that men get penalized for acting this way and women can do the same thing and nothing happen. This nation is full of reverse racism and reverse sexism. The things women say to each other in private can be just as dirty as what men say. On that note. TRUMP2016!","commenter_a":"Ivy League males can be pigs too. Well done. Now can we please raise the bar for male behavior ? Starting with the one running for office, by kicking his chauvinistic but off and continuing with everyone else, please ?","post_message":"A 9-page document contained photos and numeric ratings of female players at Harvard University in sexually explicit terms."},{"comment_id":"10153315723671336","commenter_b":"God's hands sand feet here on earth. Do it for the least of these","commenter_a":"This is an American.","post_message":"Since Christmas, 28-year-old Nic Martinez has traveled along the East Coast in a 25-foot trailer re-fitted as a barbershop. Along the way, he stops and cuts hair for veterans and the homeless. #ProudAmerican"},{"comment_id":"550108651839249","commenter_b":"rip Borat","commenter_a":"@username SO PUMPED this actually looks lit","post_message":"Winter is coming, to Kazakhstan. // Game of Thrones"},{"comment_id":"10156364820535615","commenter_b":"Best liars contest? Hmmm... Now, I'm not saying that he hasn't told his fair share of lies throughout his life. Who hasn't? But, have you heard of a woman named Hillary? She'd have no problems at all winning that contest. Not just winning, but OBLITERATING the competition.","commenter_a":"Glad to see half of Americans are smart enough to realize that. We've come a long way when it comes to equal rights and racism. Let's not go backwards and throw all of that way. Donald Trump is not a good candidate for President !!!","post_message":""},{"comment_id":"1195653430467095","commenter_b":"This woman is trash","commenter_a":"You suck, big time.","post_message":"***FIRESTORM***"},{"comment_id":"1778455155709145","commenter_b":"Didn't \"us\" apes breastfeed your people? Lol...Some people were too lazy to breastfeed their own damn babies. Got some of that ape milk in ya'll system still from slavery!! 😏","commenter_a":"Black guy deserved it stupid black idiot not being racist being honest the black guy should have kept his mouth shut why was he at the Donald trump convention if he did not like Donald trump black retard","post_message":"The 78-year-old white man accused of punching a black protester in the face at a Donald Trump rally in North Carolina made his first court appearance on Wednesday. If found guilty, how would you punish him?"}]
