[{"comment_id":"10154335459871509","commenter_b":"Bret, insults show a lack of intelligence, but continue.","commenter_a":"10 Reasons for Supporting Trump 1. Donald Trump is immune to special interest lobbying because he has accepted no donations or special interest money. No other candidate can make this claim. 2. Trump knows how to negotiate. No one builds an international business empire the size of Trump without being able to win at the negotiating table. 3. Donald Trump is an executive. The President of the United States is the Chief Executive Officer of our nation. We don need a policy expert or a legislator we need someone who knows how to run an organization. Trump is the only candidate who has a proven record as a successful executive on a large scale. 4. Trump is a man who tells the truth. He may not always say it in the most polished way, but our country has had enough suave liars. It is time for some straight forward honesty. ...","post_message":"Emotional scenes at Vancouver airport."},{"comment_id":"10153931664823797","commenter_b":"Well..when you look at how Democrats view abortion...5 months ago..that woman could have destroyed that baby through an abortion... .They don't respect life. So why should a Democrat care about how this baby died?","commenter_a":"Democrats would argue that this is not murder as abortion is not murder to them.","post_message":"29-year-old Sharron Braxton has been charged with the fatal suffocation of her 4-month-old son. Prosecutors say Marcus Jr. died after she rolled on top of him in the middle of the night. How very sad. Here's what police say she was doing before she fell asleep:"},{"comment_id":"10154433599628812","commenter_b":"Good for you, we have got to keep Hillary out of WH we cant take 4 more years of failure!!","commenter_a":"Neither believe in Science/ man made climate change- Disqualified to hold office!!","post_message":"Senior level Trump campaign sources confirm to ABC News that Speaker of the House Paul Ryan will be endorsing presumptive GOP nominee Donald Trump: @webpagelink"},{"comment_id":"10156899433320354","commenter_b":"If you're a f****** illegal mexican, get the hell out!","commenter_a":"Illegal immigrants built part of this country cause people like Trumpet hired them! All of a sudden they're bad? Screw you all! Im proud to be a fucking Mexican!","post_message":"“[O]ne party has made it okay to say you can hate people, you can spit on them.” What would you like to tell Julieta Garibay? WATCH:"},{"comment_id":"10150600601724999","commenter_b":"A woman is whatever she wants to be. That's kinda the point of feminism.","commenter_a":"For a group - women - who have been arguing for decades that they shouldn't be reduced to their reproductive organs so they can have more opportunities in life that have NOTHING to do reproduction, it's pretty ironic when those same people say someone can't be a woman because she doesn't have the proper bits or experiences with those bits.","post_message":"People who haven’t lived their whole lives as women shouldn’t get to define us. Read on in The New York Times Opinion."},{"comment_id":"850397761665128","commenter_b":"I'm a 20 year retired air force vet and a woman and this kind of treatment is common among the other sex","commenter_a":"In fairness. I wonder if the person thought the parking space was ONLY for physically wounded vet. Just saying. I agree the person was wrong. Vets come in all sizes, shapes, colors and gender. We all served. In AL we can even get the word VET on our drivers lic now. Just new.","post_message":"WOW! What do you think about the note left for this woman?"},{"comment_id":"10153335992009071","commenter_b":"Malia Young-Williams","commenter_a":"Omar Kashmir","post_message":"We tried Shake Shack’s new Chick-fil-A killer."}]
