[{"comment_id":"618134845039685","commenter_b":"It's about time, defund them and get them out of the country.","commenter_a":"Make it so! Move this anti-American institution offshore!","post_message":"Have Obama and the UN finally gone too far?"},{"comment_id":"1068974126482547","commenter_b":"@username, that is so true! WHORES ARE NOT WOMEN!","commenter_a":"Obama by far has been the worst president this country has ever had. He put America straight into the crapper. If Hillary gets elected she's going to pull the handle.","post_message":"We need to elect men and women who uphold the Sanctity of Life!"},{"comment_id":"10154242157722690","commenter_b":"@username oh yes she is. No way would a women just go Willy Nilly about massive death. We are big on keeping people safe. He twits bc someone put him down. Just think if a country pisses him off.","commenter_a":"We have two people running for office that are both out for themselves. Ones going to court Nov 28th on a fraud case for his fraud school then we have one about email server. I mean come on we don't have a great choice! They both SUCK!","post_message":"FBI to reopen Hillary Clinton email investigation after additional emails were discovered as part of a separate investigation."},{"comment_id":"1009601765755554","commenter_b":"Brandon Douglas just remember this. This was a rigged election and the only ones that lost are us by excepting the way things.","commenter_a":"Don't give up Bernie! People still believe in you as being the right pick. Stand up and fight for the Presidency! People will back you!","post_message":""},{"comment_id":"1700674326840051","commenter_b":"Leave our flag alone!","commenter_a":"Leave it alone!","post_message":"Men and women have died defending our flag, don't mess with it. Do you think the flag should be left alone?"},{"comment_id":"10153996062974203","commenter_b":"Take them all out by any means necessary, they are enemies of this country.","commenter_a":"In other reports, Ammon has told those left at the refuge to give up and go home. Why should they just get to go home, as if nothing happened and they hadn't done anything wrong. Every last one of them should be charged with crimes of all sorts.","post_message":"They're not going anywhere."},{"comment_id":"1729018337314031","commenter_b":"Hello everyone,my name is sandra from the united state,getting my lover back was what I least expected and could never imagine,my lover and I were together for five years,but all of a sudden he changed completely and turned away from me and I had no idea what was going on,I tried asking him why but he refused to tell me what the problem was,as time went on he sought for a breakup,I was so worried and confused but I never gave up on him until I met an old friend of mine who had a similar problem,she told me about a spell caster called alakijaoogun who helped her situation,I never used to believe in spell casting in my entire life because I never taught it could work for me but to my greatest surprise it got me a positive result and I was able to get my lover back,even after ...","commenter_a":"i think she has thrush","post_message":"Miley Cyrus delivered quite a statement to Donald Trump..."}]
