[{"comment_id":"10153093023857293","commenter_b":"Ha Ha Ha!","commenter_a":"the Republican brand has been damaged long before Trump! He is just icing on the top!","post_message":"The head of the Republican National Committee wants Donald J. Trump to tone it down."},{"comment_id":"718057805010847","commenter_b":"He looks like he deserved it","commenter_a":"Aimee Lewis @username","post_message":"Good job"},{"comment_id":"1400391526679146","commenter_b":"I was at fort Wainwright... Fucking miserable place no doubt (it was -37 when that pic was taken)","commenter_a":"Thank you for all you do!!","post_message":"I remember hoping I'd get frostbite so my chain of command would get an ass chewing. This is about as miserable as it gets. ~Will"},{"comment_id":"10152785056866051","commenter_b":"how dumb are these women","commenter_a":"WTH!","post_message":"This prisoner impregnated not one, not two, not three, but four prison guards."},{"comment_id":"1008881259209071","commenter_b":"America is in bad shape and people can't see it. I don't understand why they are for Hillary. She can't do a thing but lie. She will do nothing for poor and middle class. How do people not see this? ?? I am amazed at how stupid people are thinking life will be better with her doing what Obama has for 8 years. Bankrupting America and millions of Americans. WHAT has she done FOR America? ?? More. ..what has she done TO America? The red states will get it right I hope. If only the people in the swing states would come to their senses.","commenter_a":"Yep, you said it right, power and money, but wait , they want your votes too, hahahahahaha hahahahahaha hahahahahaha, I am not stupid, Hillary is not getting my vote","post_message":"\"The Clintons are greedy. They love money. They love money so much they've been accused of ignoring ethics and, very likely, laws to rake in more and more money.\" – Eric Bolling @webpagelink"},{"comment_id":"1157612937618557","commenter_b":"Yes we all should judge illegal immigrants as invaders and depot them! good ppl or not they MUST GO","commenter_a":"Color Blind? All Trump has done in his campaign is judge people by there color and culture.","post_message":"Ivanka Trump on the people her father hires: \"He is color blind and gender neutral.” @webpagelink"},{"comment_id":"10153643564026051","commenter_b":"She shouldn't be out!! WTH","commenter_a":"I don't think so","post_message":"A mom who killed her 3 kids is now demanding custody of her new children."}]
