[{"comment_id":"1299985666689108","commenter_b":"typical woman sexism","commenter_a":"Almost every man I know that gets the flu is a big baby about it and stays home to be pampered and relax, while women who get sick continue with their daily routine of kids and work and household duties, so, ppft. Women still get it worse!","post_message":"Turns out, cold ad flu viruses might actually be worse for men after all."},{"comment_id":"10153847730226336","commenter_b":"Those widows aren't afraid to strap on a vest and blow innocent people to pieces ...#mrpresident","commenter_a":"He could never win a debate with Cruz.","post_message":""},{"comment_id":"490217177839688","commenter_b":"YOU BITCHES DON'T MISS ANY WELFARE MEALS DO YOU!","commenter_a":"Only thw Daily Dummies would bring more media attention to something like this. Learn the legal system who iduots. This guy wasn't guilty ever and the rest of Baltimore now knows it too.","post_message":"Baltimore city residents expressed disappointment in response to the city circuit court Monday finding a police officer not guilty in connection to the death of Freddie Gray."},{"comment_id":"10152721228310047","commenter_b":"This comes from a woman that laughed as she helped a rapist get away with his having raped a young girl... She knew he was guilty, too.","commenter_a":"If all the babies had a right to choose life or death--hmmmmm!","post_message":"Hillary Clinton and the radical Left believe that protecting abortion is even more important than your religious rights. Read & SHARE about attempts to prioritize abortion over First Amendment freedoms."},{"comment_id":"10153743824977093","commenter_b":"Ain't no snake ever hurt no one. My niece Becky got bit by a dog","commenter_a":"Am glad y'all found this snake","post_message":"UPDATE: The missing king cobra has been found. That time your deadly pet snake escaped the house.. bit.ly/2bPTSGW"},{"comment_id":"10154051337399411","commenter_b":"Are you sane, woman?","commenter_a":"A scientific theory is a well-substantiated explanation of some aspect of the natural world that is acquired through the scientific method and repeatedly tested and confirmed through observation and experimentation.","post_message":"If you have proof: bring it. If you do not: acknowledge openly that you have theory perhaps a well-honed, much loved theory, but a theory nonetheless. (Op-Edge by Sam Gerrans)"},{"comment_id":"1760085394239423","commenter_b":"Is there anything we can actually wear without people and animals being exploited ???","commenter_a":"LETS CONTINUE SPREADING THIS PLEASE!!! IS OUR RESPONSABILITY TO STOP IT!","post_message":"BREAKING VICTORY! UNITED COLORS OF BENETTON announced they will BAN ANGORA after just 24 HOURS into #PETA campaign: @webpagelink THIS is why you should care."}]
