[{"comment_id":"1243601928984608","commenter_b":"Speak for yourself, Bertha. Don't pretend you speak for the majority of women because you sure as hell don't!","commenter_a":"Don't have the right to impose their beliefs on others.. huh? Well, then the religious right should stop right there...","post_message":"Ted Cruz’s tour de transphobia has embraced a new extreme position."},{"comment_id":"10154156972868984","commenter_b":"ONE MORE TIME TO ALL OF YOU WHO BELIEVE THAT ALL OF US ARE INNOCENT OF EVERYTHING UNTIL WE ARE CHARGED AND THEN FOUND GUILTY IN A COURT OF LAW! IF THIS WAS YOU, A FAMILY MEMBER OR A FRIEND WOULD YOU GO SCREAMING JAIL THE SOB OR BITCH? OUR JUDICIAL SYSTEM IS BASED ON \"THE wPRESUMPTION IF INNOCENCE\" THAT ASSUMPTION PROTECTS ALL OF US FROM BEING JAILED WITHOUT DUE PROCESS! A FEW OF YOU BRING UP GENERAL PETREAUS, HE WAS A GREAT GENERAL AND IS AN HONORABLE MAN BUT HE PLEAD GUILTY OF ALL CHARGES INCLUDING DIVULGING HIGHLY CLASSIFIED INFORMATION TO HIS BIOGRAPHER WHOM HE WAS ALSO HAVING AN AFFAIR WITH. HILLARY HAS DENIED ALL CHARGES, WHICH IS ALSO HER LEGAL RIGHT UNDER OUR SYSTEM OF JUSTICE, AND NOW THE DOJ IN CONCERT WITH WHATEVER THE FBI CAN DERIVE FROM THEIR INVESTIGATION MUST PROVE THAT SHE IS GUILTY IN ...","commenter_a":"Dems are majority lawyers. Lawyers believe that if lies are stated long enough, they're perceived as truth and once a statement is made, it can't be undone. You can never un-ring the bell. She will continue to lie until way after she's indicted.","post_message":"Hillary Clinton just keeps digging herself deeper with this one... Is she your absolute LAST choice for president?"},{"comment_id":"1393467647339928","commenter_b":"Yep, that is exactly what I believe!","commenter_a":"I was a democrat and anti gun, after I saw San Barnadino I changed my opinion .rump is right if we had few people in that work place gun straped around their hip bullets would have go the other way too. We could have kill those radical fanatics right there and the death toll of Americans would have been much less. I can guarantee that.","post_message":"BREAKING: NRA endorses Donald Trump at national convention"},{"comment_id":"10153907295491680","commenter_b":"@username your a bitter woman","commenter_a":"Another classless moron that thinks sexual abuse is ok 👌 way to go Rush, you are pathetic","post_message":"\"Men brag,\" Rush Limbaugh said on his long-running radio show."},{"comment_id":"10153478399867993","commenter_b":"Do it already.","commenter_a":"What are you waiting for? Her to be elected???","post_message":"Judge suspects ‘bad faith’ from Obama administration on Hillary Clinton emails, threatens subpoena to force former Secretary of State to turn over entire email account."},{"comment_id":"10155756776370615","commenter_b":"Refused. By Faux News? Well, it is official, her fifteen minutes are over.","commenter_a":"One sick puppy","post_message":""},{"comment_id":"611652445656331","commenter_b":"USE'N The Words \"Protect & Serve\" Is An Excape For Majority Of Ths Police Officers Who Shoot & Kill Inoscent' Civilians ... SMH* It Is A Shame ...Need To Weed -Out The B.A.D. - POLICE OFFICERS Sister Asiyah Hensley Ka'Bah Brother Abdul Azim Ka'Bah","commenter_a":"Thank you for standing up and stating the truth","post_message":"\"These shooters aren't my brothers in blue, they're murderers.\" - Rep. Andre Carson, a former law enforcement officer, joined other members of the Congressional Black Caucus to condemn the recent police shootings of Alton Sterling and Philando Castile Read more: @webpagelink"}]
