[{"comment_id":"602611366596109","commenter_b":"She needs to shave her pits.....ugh, she's so nasty!!!","commenter_a":"remember...she is a singer, she is a singer, she is a singer,.....","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'. This is unacceptable, we stand against Miley 100%. Do you agree Miley should be kicked out of the country?"},{"comment_id":"692872167570028","commenter_b":"It's NOT A WOMAN!!","commenter_a":"Moron nuts ops HeShe got balls . Sick , sick , sick . Woman of the year ? Bull crap ,disgusting , insulting to all women in the world . Hmmmmm maybe he should be castrated then but he will still be the same , a mangoman hehehe .","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"10153460551006051","commenter_b":"It's nobody's damn business what she does with her home","commenter_a":"He should get out of this woman's property . However by all accounts it is not her home. She could rent it out, she could house a family . It doesn't seem right just to let the house sit there when so many are in need.","post_message":"This guy stole a 70-year-old woman’s home. On Wednesday, a judge decided whether he could keep it."},{"comment_id":"10153480378764071","commenter_b":"The only reason I stick with BI! The comments are classic! Love it.","commenter_a":"These comments are killing me!!! 😂😂😂","post_message":"The pricier your brand, the better customer service you provide."},{"comment_id":"10153590950708145","commenter_b":"You can turn it off though.","commenter_a":"Ever tried to uninstall Facebook? YOU CAN'T!!!!","post_message":"Apparently, Facebook wants its Messenger app to take over your phone."},{"comment_id":"10153475441185329","commenter_b":"Bologna on stage lights sounds familiar.","commenter_a":"@username, I assume you have already done this many of times.","post_message":"This is how real men grill."},{"comment_id":"660327817491130","commenter_b":"I love that woman !!!","commenter_a":"Read the artical..Where does Obama himself go after Sarah's family? What did I miss? I do not like Obama, (even saying his name makes me shudder) but I do not like miss information. What I read was the IRS is going after her dad.","post_message":"Obama is now targeting Sarah Palin's family, but she's not backing down. Way to go Sarah. We love you and your family, God bless. Can we get 30,000 'LIKES' for Sarah Palin?"}]
