[{"comment_id":"10155755235340725","commenter_b":"U mean I have to marry ur ass!? Ugh","commenter_a":"Patti McGough, let's meet at Daley center on tuesday.","post_message":"#BREAKING: Supreme Court rules all gay couples have a constitutional right to marry-----> @webpagelink"},{"comment_id":"1813691558875997","commenter_b":"FU lying bitch","commenter_a":"She's fill of crap","post_message":"Hillary Clinton says people are \"concerned\" by Trump's \"divisive rhetoric\" and he needs to be stopped \"conclusively.\" Is she right?"},{"comment_id":"10155010955881350","commenter_b":"I need that hippo.","commenter_a":"Sydney Elise Harville","post_message":"WATCH: Make your Monday better with this hippo waddle. @webpagelink"},{"comment_id":"10153134052206770","commenter_b":"They haven't earned my country or my freedoms. Let them go back and earn them in their own country. We did.","commenter_a":"Scold the 57-58 Arab nations who REFUSE to take ANY. There must be some reason they're so adamant we'd be fools not to follow their led. And stupid to be swyed by a hoard of malcontents. Have yo shown ANY appreciation to those countries who have given you free access A RESOUNDING NO. That Homeland Security is aware of the risks, and still continues is disgraceful.","post_message":"The largest Arab American civil rights organization in the United States is alarmed because 31 state governors have said they will refuse entry to Syrian refugees in their states."},{"comment_id":"10150604575769999","commenter_b":"Why do you suppose all those things are necessary for women? Come on, think!","commenter_a":"Overcoming the confidence gap? Thanks for your concern NYT but I'm doing just fine. I'm so sick of people telling me how disadvantaged I am as a woman. Women get alimony, the children, special scholarship opportunities, special mentorship opportunities, special conferences, support groups for violence against women, priority disembarking off the titanic, the seats on the crowed bus, and the list continues... Let's face it, men are disadvantaged now.","post_message":"While men often overvalue their strengths, women too frequently undervalue theirs. Call it a continuing confidence gap."},{"comment_id":"2041329586093459","commenter_b":"@username , good God man, he is not even President yet....give him some time, will you??? SUDDENLY you all expect him To do miracles??? Rome was not built in a day. Was it?? Worry about these HIPPY KIDS making trouble....poor kids didn't get their way and now they have to riot!! Instead of. Being happy that CROOKED HILLARY is finally away from shaking down and stealing from donated money meant for the poor, and sooo much more , they RIOT!!! Go figure....stupid YOUTH. !!!! That is what kids get as a COLLEGE EDUCATION THESE DAYS!!!","commenter_a":"And it took Donald Trump to do it with practically no help from the Republicans at all. John McCain with Sarah Palin couldn't do it 8 years ago, Romney choked 4 years ago when he didn't even mention the Benghazi attack and coverup when it happened less then 2 months before the election 4 years ago. So, Trump took matters into his own hands and won the Presidency - practically all by himself when he was against all odds, while also helping to secure The House and The Senate...!!! The Republicans have no excuse now...!!! But one thing is for sure, the Republicans and the Democrats sure better know who the BOSS is now..! It's time to get down to business for America..!","post_message":"So now we have the House, and now we have the Senate, and now we have the White House -- and now we have no excuses. There aren't any excuses anymore. The Republican Party has been given the full reins of this government in this country, and there is a mandate behind it."},{"comment_id":"10153130571029726","commenter_b":"Is that considered a rhetorical question? I think you know, and I'll add that all those girls need to be caged.","commenter_a":"Animals.","post_message":"VIDEO RAW footage of 4 teens viciously beating a girl in Brooklyn McDonald's as a crowd cheers them on. Why do parts of society cheer and take pleasure from this type of sheer brutality?"}]
