[{"comment_id":"1018549428199222","commenter_b":"Deport all of them before they have greater numbers!","commenter_a":"“The thing about Muslims that you should realize, is that they do not assimilate. Islamists don’t adapt to the existing culture of the host country, they simply try to force citizens of that country to conform to their beliefs or suffer the consequences,” wrote Diana Spirit. 1. @webpagelink 2. @webpagelink 3. @webpagelink","post_message":"MUSLIM IMAM: Be Compassionate...Kill Gays [Video]"},{"comment_id":"594130970711496","commenter_b":"She a commie in bad clothing","commenter_a":"I'm just wonderin......Does she feel \"tyred\" these days??","post_message":"Hillary Clinton says people are \"concerned\" by Trump's \"divisive rhetoric\" and he needs to be stopped \"conclusively.\" Is she right?"},{"comment_id":"1205011436232276","commenter_b":"Hahaja pornhub and fat bitches fighting over fooood lmfao","commenter_a":"@username #14 😂. That's Steve","post_message":"Enjoy This Week's Vine Comp! #WSHH #Vine #Compilation"},{"comment_id":"10153706783614218","commenter_b":"Go suck you mother","commenter_a":"Judge Barry williams came to his decision based on fear of rioting and unrest...thats not how the justice system is supposed to work you cant be bullied by a bunch of idiots in the streets chanting lies","post_message":"#BREAKING #FreddieGray Judge denies motion to dismiss charges against 6 police officers in death of Freddie Gray. He also denied a motion for State's Attorney Marilyn Mosby to recuse herself. Follow live updates: @webpagelink READ more here: @webpagelink"},{"comment_id":"723294587810406","commenter_b":"Leah sure! Hillary's leaked email referrer's to Mexican's as \"taco bowls\". That says it all right there. Racist as anybody can be.","commenter_a":"Hillary no lo hace un coche de usted . Solo su voto","post_message":"\"Do all the good you can. Measure your life by the positive effect you can have on other people’s lives. Be of service to one another.\" —Tim Kaine"},{"comment_id":"522564217947920","commenter_b":"Lmao 😂😂😂","commenter_a":"Sanders is turning into John Kasich, showing up to places and losing.","post_message":"\"We're in it until the convention,\" she said."},{"comment_id":"10153328651014342","commenter_b":"wonder if her phone was busy? congress write the laws why is no one talking about them?","commenter_a":"Well he calls after someone writes the words to say....the deputy was killed on Friday night and this is Monday....","post_message":"Today, President Obama called the widow of fallen Harris County Sheriff's Office Deputy #DarrenGoforth. After that, he released the following statement: \"This afternoon, on my way to Alaska, I called Kathleen Goforth, the widow of Harris County Deputy Sheriff Darren Goforth - a veteran law enforcement officer who was contemptibly shot and killed over the weekend. On behalf of the American people, I offered Mrs. Goforth my condolences, and told her that Michelle and I would keep her and her family in our prayers. I also promised that I would continue to highlight the uncommon bravery that police officers show in our communities every single day. They put their lives on the line for our safety. Targeting police officers is completely unacceptable - an affront to civilized society. As I said in my State of the Union Address, we've got to be able to put ourselves in the shoes of ..."}]
