[{"comment_id":"10153197093266051","commenter_b":"She a idiot","commenter_a":"Agree","post_message":"Nancy Pelosi says President Obama's Iran deal is simply brilliant. Agree or disagree with her?"},{"comment_id":"10154714016861509","commenter_b":"Now how is that wall going to work?","commenter_a":"Carlos","post_message":"It even had its own elevator."},{"comment_id":"1538307646229359","commenter_b":"Let it burn ...what a dumb bitch...","commenter_a":"Let's see how that works out!","post_message":"What do you think?"},{"comment_id":"10154307345026729","commenter_b":"I am a liberal and I totally agree with the poster, so why are you irritated with liberals; your reasoning doesn't make sense to me.","commenter_a":"Or becoming traitors and taking over federal buildings!","post_message":"This will definitely irritate liberals and the \"coexist\" crowd"},{"comment_id":"10154208649726770","commenter_b":"She needs to go so she can do no more damage","commenter_a":"She will be dumped her country is tired of Muslims ruining their country raping their women","post_message":"Merkel's party is second in polls for the first time since 2010"},{"comment_id":"861215140607271","commenter_b":"Alex, it wasn't proven to be false. Please cite the \"proof\".","commenter_a":"I respect you Senior Airman but your comparing Ron Paul & Jessie Ventura to the killer as \"typical\", is absolutely ludicrous. I don't even know where to start I'm so disappointed.","post_message":"EXPOSED: Chris Kyle Killer Didn Have PTSD, Was A Typical Anti-War Punk Like Bradley Manning. I like to know if Routh or his family had any contact with Jesse Ventura in the days before he murdered Chris Kyle. Allen West and Walid Shoebat are also trying to sort out if his anti-war beliefs had graduated to jihadi sympathizing or... #americansniper #dallasobserver #guns @webpagelink"},{"comment_id":"10156350810355354","commenter_b":"Deport these little bastards ASAP","commenter_a":"and the dems what these people in this country!","post_message":"Brace yourselves. Amnesty activists just launched a VIDEO that EVERY American should WATCH..."}]
