[{"comment_id":"262360004194462","commenter_b":"It's a bad photoshop job","commenter_a":"Ewww !! Haha","post_message":"TELL US IN THE COMMENTS!"},{"comment_id":"10153731561481336","commenter_b":"You're an idiot Elizabeth!","commenter_a":"The shooter was a conservative republican. That seems to be a common theme in mass shootings.","post_message":"One law enforcement official described the shooter as an \"angry young man who was very filled with hate.\""},{"comment_id":"10152628736511367","commenter_b":"so leave, gentle lady","commenter_a":"You are not a fair news outfit or discussion platform! You leftist asskisser mother @##$%^^%%^s.","post_message":"\"The only thing we have to fear is ... \" @webpagelink"},{"comment_id":"717073721816539","commenter_b":"She is nothing but a bitch and a liar.","commenter_a":"Hillary for Prison 2016","post_message":"Hillary tried to damage Trump’s reputation by spreading this rumor. She is disgusting. Comment ‘yes’ if you think Hillary should be punished. Can we get 30,000 ‘LIKES’ for Donald Trump? [VIDEO]"},{"comment_id":"10156735133795354","commenter_b":"Yes, but they do not work, they are LAZY","commenter_a":"That would cost more too , plus how many on welfare due to injury taking pain medicine gonna be positive anyway ? Big mess","post_message":"***SHOULDN'T WELFARE APPLICANTS BE DRUG-TESTED LIKE EVERYONE ELSE?***"},{"comment_id":"10152872619506336","commenter_b":"Real simple solution to all of this. Remove these people from all Western Countries. And NEVER allow them in ever again. End of all problems.","commenter_a":"Had her and let her walk right past them, idiots!","post_message":"French authorities are conducting a countrywide manhunt for 26-year-old Hayat Boumeddiene, a suspect in Thursday's murder of a French policewoman. Police said Boumeddiene should be considered dangerous and potentially armed."},{"comment_id":"10153598011598812","commenter_b":"She is like.... Told you to stay away from those blonde white bitc... lol","commenter_a":"With his mommy right beside him worried about where her money is going to come from now","post_message":"Former FSU quarterback says \"I totally should have walked away\" after video surfaces showing him punching woman in the face."}]
