[{"comment_id":"1109626375800280","commenter_b":"Yup! They are afraid of her!","commenter_a":"Hillary is a joke","post_message":"\"They are afraid of me!\" - Hillary Clinton"},{"comment_id":"547147818822562","commenter_b":"Get rid of every illegal man woman or child then start the legal process maybe this country will fall back together after that","commenter_a":"Buddy, you are so far behind the curve by now, I'm not sure you can hear me shouting backwards. We're past issues of legality. We're past party lines. We're into basic human dignity and the essential morality of how human beings treat each other. Black lists, registration lists, and round ups and mass deportations are all tools of countries where the rule of law has broken down and democratically designed processes have failed - BY DEFINITION. Yes, illegal immigration is a huge issue and yes, there should be systems in place to allow due process of law to happen based on merit and compassion. Targeting entire groups of people and refusing to treat each person as an individual in assessing their rights and needs is the antithesis of our stated democratic ideal. So this mayor speaking out in defiance of the tools of mass oppression is an act of heroism. ...","post_message":"\"This is New York. We are always New York.\""},{"comment_id":"10153353453448132","commenter_b":"She is a brat !","commenter_a":"I love her ! Hopefully she doesn't become a total brat","post_message":"AMAZING!"},{"comment_id":"10156410445115354","commenter_b":"Rebecca the clan was founded in 1865....u ignorant slut....","commenter_a":"If this paper had any business sense and compassion, they would fire that guy.","post_message":"When you see the CARTOON mocking Republican Gov-elect Matt Bevin's adopted children from Ethiopia, just remind yourself: it's only racist when attacks are against Democrats, not Republicans."},{"comment_id":"1745001682421383","commenter_b":"Just when I think I had seen stupid, I look at a news feed like this, and all you libtards take stupid to a whole new level. All you lazy Daisy's don't want Trump in because your welfare checks will go away, and a you illegals will be deported home to build that WALL!!!!","commenter_a":"Trump is hammering her, love it! All she can do is smile & laugh because she has nada","post_message":"\"I will release my tax returns – against my lawyer's wishes – when she releases her 33,000 emails that have been deleted.\" Donald J. Trump hit at Hillary Clinton's email issue in the first presidential debate. #Debates2016 @webpagelink"},{"comment_id":"431677547020539","commenter_b":"Filthy muslims ,deport or tag &bag'em .","commenter_a":"That is disgusting.","post_message":"This is disgusting — would YOU want to use a sink someone had washed their feet in?"},{"comment_id":"10154615218080530","commenter_b":"@username-Fequiere Wait, so now black on black violence is due to INEQUALITY????","commenter_a":"When are people going to start protesting the deaths of 9 year old girls executed in Gang warfare in Chicago? It's like we're protesting something that happens 1 time out of 1,000,000. And nobody cares about something that happens like everyday. The media has got the people riled up about a very small issue while ignoring major problems. That's why I don't understand this movement. It's like if the government was repossessing everyone's home and moving them to refugee camps for no reason, but I was protesting the governments estate tax while ignoring people's homes being taken.","post_message":"Does the Michigan Football players' silent protest make you uncomfortable? Does that interrupt your Saturday afternoon of escapism? Sorry. That’s the point. @webpagelink"}]
