[{"comment_id":"1049253181797877","commenter_b":"So HRC YOU WILL NEVER WIN CALIFORNIA @webpagelink","commenter_a":"Hillary,we want you back at the White House!!","post_message":""},{"comment_id":"1723680187844156","commenter_b":"she is CRAY cray crazzzyyy","commenter_a":"@username ton 2 cents plottale la dessus please","post_message":"On Tuesday’s “The View”, Hillary claimed that a child, on its due date, just before delivery, has no constitutional rights. Are you serious? I believe that life begins at conception and that abortion takes the life of an innocent human being. And I’ve heard all the arguments from the left before, but this idea that a baby on its due date still has no constitutional rights? That really takes the cake."},{"comment_id":"1648797488740697","commenter_b":"Sadie is a lady Miley is a joke!!","commenter_a":"LOVE LOVE LOVE!","post_message":"America needs more Sadie Robertson and less Miley Cyrus."},{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump. Just who are these hooligans? Lee Stranahan investigates..."},{"comment_id":"10153081460312235","commenter_b":"All depends on version and translation","commenter_a":"Guess they didn't make it on the ark ;)","post_message":"If they are in the Bible, they have to be for real. End of story."},{"comment_id":"10153842022041336","commenter_b":"@username. You are a blooming idiot fool!!","commenter_a":"Too egotistical! He will never resign but, he will go down in history as the most Anti-American and incompetent man ever to reside in Our White House without doubt!!","post_message":"“We are in World War III,” Michael Goodwin said on 'The Real Story.' “And if America is not going to lead, who is?”"},{"comment_id":"10156256559580354","commenter_b":"Sure she will, and we will all be getting shot by the crazy people who get guns illegally","commenter_a":"And how many guards does she have!! And I bet we paying for them!!!!","post_message":"Hillary pledges her assault on 2nd Amendment freedoms."}]
