[{"comment_id":"10154358631096943","commenter_b":"Put her in jail with her boss","commenter_a":"So..yeah.. Legit question here @webpagelink/ So yeah can we?? If this were a case involving weed or oil on national historic sites or someone's private lands etc the Feds would be KNEE DEEP in it!! Or at the very least CA's electoral points be split 50/50!","post_message":"This is serious. We are investigating now."},{"comment_id":"1685289261757038","commenter_b":"So true. She needs disarm them!!","commenter_a":"not just disarm, but \"quickly\"","post_message":"Hillary said that guns don't keep you safe. If she really believes that she should demand that her heavily armed bodyguards quickly disarm!"},{"comment_id":"10153268288138984","commenter_b":"Asshole !","commenter_a":"I bet if the truth were known, he didn't get injured by some machine falling on him. I bet his wife finally had enough of him and beat the devil out of him!!","post_message":"You'll have to read this list to find out what the top worst moments of his career are, but I definitely know what the best moment of his career is... When he finally leaves!!!"},{"comment_id":"10154151758449087","commenter_b":"@username Oh, please. Where are the arrests, the charges, the trials? Where are they? When did they happen? Where are the files? The proof? And here's the thing: Bill Clinton is NOT running for president. Whatever did or did not happen in the past is a \"he said, she said\" situation at this point. Or really a \"she said\" situation, and sadly, a LOT of women go after powerful men, married men, etc., and then cry \"rape\" when they don't get what they want. And I say that as a woman who would f**king kill a man who raped me. And once again, Bill Clinton is NOT running for POTUS. Donald Trump is a low-class disgusting creature who should NOT represent this great nation on the world stage.","commenter_a":"Let me know when Trump does something as bad as LEAVE 4 AMERICANS TO DIE..then you will hear my outrage..but you won't hear it over some locker room crap that Trump said.. Toughen up cupcakes..","post_message":"#BREAKING: Mike Pence was reportedly \"beside himself\" after hearing Trump's obscene remarks about women, and Pence's wife was \"furious.\""},{"comment_id":"1194644643902280","commenter_b":"Build that Wall!!!!!!👍😃","commenter_a":"Yes but did anyone die?? CA is full of Illegals.. Probably the judge is as well.. Give em Hell Trump!👍","post_message":"U.S. District Judge Gonzalo Curiel in San Diego called for the documents to be released."},{"comment_id":"10154003076373812","commenter_b":"Actually women STFU if you can't take the heat dont attack....he has just as much right as her","commenter_a":"When it comes to women, Donald should just STFU.","post_message":"Donald Trump ramps up his attacks against Hillary Clinton and former Pres. Bill Clinton: \"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!\""},{"comment_id":"10155010955881350","commenter_b":"I need that hippo.","commenter_a":"Sydney Elise Harville","post_message":"WATCH: Make your Monday better with this hippo waddle. @webpagelink"}]
