[{"comment_id":"10154770919726037","commenter_b":"There isn't any suspense. I think we all know what Trump's reaction will be when he loses...","commenter_a":"He answered truthfully. We'll wait and see. It was a gotcha question for which there is no correct answer.","post_message":"“I’ll keep you in suspense.” - Donald J. Trump"},{"comment_id":"10153027652339753","commenter_b":"If a woman forces her self on a man it's rape","commenter_a":"How the hell does a woman rape a man? I have never understood this concept. Especially when he's \"asleep.\"","post_message":"She was pregnant with her third baby when she committed the alleged rape. But would her sentence have been tougher if she were a man? @webpagelink"},{"comment_id":"949815198400996","commenter_b":"@username China built a 13,000 foot wall over 2000 years ago. You don't believe we can build a 1000 foot wall? --- I live in California and illegal immigration is a huge problem that you clearly don't understand. Please take some time to do some research. Let's Make America Great Again!!! Cheers for Trump!!!","commenter_a":"Sir Newt may be one of your best choices as a Vp, he knows the political game better than most and is not the typical establishment guy, his IQ is also very high, I hope he is on your short list, to at least find a spot on your cabinet","post_message":"Via Newt Gingrich: Donald Trump's foreign policy speech is about putting AMERICA FIRST! I had been calling for an overhaul of the foreign policy establishment at the State Department since at least April 2003, when I gave a speech at the American Enterprise Institute calling for completely transforming the Department. And I first warned that America had “gone off a cliff” in Iraq in December 2003........"},{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?! This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES. They sound so terrified. :("},{"comment_id":"1011521052257456","commenter_b":"SHOWA. I would say if you didn't think it could happen again, it's happening again.","commenter_a":"INVADERS don't assimilate!!!","post_message":"Unreal. Stupid public schools ... celebrating the subjugation of women."},{"comment_id":"1130006897113975","commenter_b":"Get out of America then","commenter_a":"It is a sad day in America. One of the most disgusting men in in our country won the election. I am so sickened by the citizens who would cast their vote for such an evil man. Do they really feel he is person to speak for us as a nation. I find him so repulsive by his words and actions.","post_message":"THESE 23 HOLLYWOOD IDIOTS PROMISED TO MOVE IF TRUMP WINS..... LET'S HOLD THEM TO IT"},{"comment_id":"10152767059646519","commenter_b":"She is not a stripper!","commenter_a":"Really? Praising a stripper mom? You lost me today, @username.","post_message":"Go mom!"}]
