[{"comment_id":"10154237826833010","commenter_b":"So no women has ever done the same thing right? Smh","commenter_a":"My son-in-law, a sheriff's deputy, once got a call about a baby in a car seat in a car in the parking lot of a \"gentlemen club\" translation - strip club!! The cops found the father inside getting a lap dance. He was supposed to be caring for his child while his wife, a doctor, worked the night shift at the hospital. What a father :( What a husband :(","post_message":"This week in North Hollywood."},{"comment_id":"10153373033325667","commenter_b":"I love boobs, now thats something worth fighting for!!","commenter_a":"With so many violent movies and video games around, no wonder real killings are becoming an 'accepted' part of society. Children can easily watch something in which a person is shot (often without flinching), but God forbid a woman breastfeeds her baby in public...","post_message":"No motive for the shooting was given and police said they were still looking for two gunmen."},{"comment_id":"759110204189419","commenter_b":"@username Don't come to America, lol","commenter_a":"Here's a counterpoint. If you un-sexualize all body parts no one will want sex as, hey that's just a hand and that a boob and that a....Well maybe this is what we need then to decrease the enlarged...population, LOL! Truth is, I don't respect anyone who sells themselves. Even a little bit.","post_message":"Women everywhere are freeing the nipple but Facebook doesn't want us to show it. #MicCheckDaily"},{"comment_id":"10156415559120354","commenter_b":"This woman.. Needs to be sent to a Muslim refugee camp ... What a sorry idiot ...","commenter_a":"Bill should be running for president","post_message":"“56% of Americans believe that the Syrian refugees have odds that are at values — their values are at odds with our values. That may not be wrong. If you are in this religion, you probably do have values that are at odds. This is what liberals don’t want to recognize.\""},{"comment_id":"10153242859546636","commenter_b":"i agree women want equal rights go to prison for murder they will get treated these ams as men","commenter_a":"Send Teresa May then!","post_message":"Satire died on Friday 20 November 2015"},{"comment_id":"10153357248947061","commenter_b":"silly girl","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"10156141485930725","commenter_b":"How does DNA on her body prove it was rape???","commenter_a":"DNA was found on her body. Is this not enough? Oh, I forgot. He is a sport star.","post_message":"More than six weeks after news broke that Patrick Kane was under investigation for an allegation of assault, findings from a rape kit conducted on the alleged victim have been revealed ----> @webpagelink"}]
