[{"comment_id":"10152995985561130","commenter_b":"shes such an ass!","commenter_a":"@username lol","post_message":"What the..."},{"comment_id":"892287504157347","commenter_b":"America is lost. We haven't won a war since 1945. When did it start? November 1950 when the American X Corps retreated from North Korea during the Battle of Chosin Reservoir. It was spun as a victory. Look who owns North Korea today. Yes! We lost. Harry S Truman was our Democrat president. We are losing peeps! You are getting your welfare checks, but for how much longer? We have aborted away our labor and armed forces. We are importing Islamic labor. (LOL!) Remember this date: 27 November 1950. It's the date the Chinese crossed the Yalu River and began our long, slow decline ...","commenter_a":"if they want to fly their flag go back to your own country, this is America their is only one flag and that is the American flag","post_message":"If the NAACP can have the Confederate flag, which is part of the heritage of THIS country, taken down in places coast to coast, should flags that belong to other nation´s cultures be allowed if they cause strife? Read More: @webpagelink"},{"comment_id":"1157767754287378","commenter_b":"This is the most ridiculous thing I have ever heard. NC, doesn't need this Administration deciding this issue for them! This administration is quick to bully states to legalize Gay marriage, overriding the will of the majority of people, bullying states to fall in line with their LGBT agenda. Counting the days til this administration crumbles.","commenter_a":"With all the crap that is going on and she chooses to fight this battle?","post_message":"“This is about the dignity and the respect that we accord our fellow citizens, and the laws that we as a people and as a country have enacted to protect them.” Attorney General Loretta Lynch formally announced that the The United States Department of Justice is filing a federal civil-rights lawsuit against the state of North Carolina, Gov. Pat McCrory, the North Carolina Dept. of Public Safety and the University of North Carolina over the state’s controversial “bathroom law.”"},{"comment_id":"533308460200216","commenter_b":"If you are Gay, Why are you voting for Hillary when she wants to bring in thousands of refugees that believe all Gays should be executed? If you are Black, Why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood who want to abort as many black babies as possible? Exterminate the black race because they are like \"weeds\". (Margaret Sanger quote) Most of those clinics are in Black neighborhoods. If you are a Christian, Why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who dedicated his book 'Rules for Radicals' to Lucifer (the Devil)? She says he was, and still is her mentor. If you are a Veteran, in the Military, or closely related to a Military member, Why are you voting for Hillary when she left those men to die in Benghazi and had the nerve ...","commenter_a":"Why can't we have all candidates for a debate? 1-2% should be enough for them to take the stage. Do you guys agree?","post_message":"What questions do you have about the elections? We're in CNN's Election Center with CNN Politics Executive Editor Rachel Smolkin and Political Director David Chalian. #CNNElection #ElectionDay"},{"comment_id":"744192892380562","commenter_b":"Jerome-- a mole? Are they all?","commenter_a":"Close the borders. With all due respect congressman, only idiots would even consider calling military age men \"refugees.\" Our borders have been poorly managed that it is impossible to tell who has infiltrated my America. Seems that Congress has chosen to remain totally mute on this issue. Obama bashing does not hide the fact that inaction equals compliance.","post_message":"It's frustrating that President Obama refuses to shift his strategy to defeat ISIS. The horrific attacks in Paris are evidence that the current strategy to defeat ISIS is not working. I discussed this earlier today on Fox Business' Varney & Co.. Watch below:"},{"comment_id":"991210200940830","commenter_b":"DUMB-DUMB-DUMB WOMAN","commenter_a":"What a ghastly hag!","post_message":"She's not the only woman to make such a painfully ignorant comment. Just last week, a German Mayor made a very similar remark. Click here to read what she had to say about Muslim immigrant rapists, and how women in Germany can prevent rape: @webpagelink"},{"comment_id":"10152570511717212","commenter_b":"Tiu wull be my wife","commenter_a":"He has a wife? And a kid? There is hope for us all! WTF? Freak!","post_message":"A man is in Oklahoma City police custody after a standoff early Friday morning. According to police, the man could be heard yelling about a number of issues including what happened in Ferguson, Missouri, and about his wife and kids."}]
