[{"comment_id":"10154490897799657","commenter_b":"That bitch wants your guns so she wont get shot.","commenter_a":"she is brain damaged","post_message":"How far is Hillary willing to go to get your guns?"},{"comment_id":"728722383954381","commenter_b":"this shit sad most if not all terrorist are from s Arabia and suni.. it hasn't even been 1 Iranian terrorist. and they fund ppl to defend they city that's not called funding terrorist. fuck trump AZ a U.S. citizen. I'm a shame of this racis country. that's why I fucking moved. fuck that bitch and his racis face. let that bitch try to come fuck w iran and see what happens. wer not Iraq or Syria. none of that. we strong. and we got them nukes and Russia and China fuck w us. let Israel bitch ass make move😎fuck Israel and s Arabia","commenter_a":"Should be interesting to see this brought up in Surpreme Court...","post_message":"The Muslim (country) ban."},{"comment_id":"425066681021905","commenter_b":"That woman should of been kicked out.","commenter_a":"Look what we just missed- Wendy Rowe Ristine-#noblackfriday #somepeoplejustsuck","post_message":"Look at what a woman just did to a child at a Black Friday Sale."},{"comment_id":"903353419700080","commenter_b":"She is so nasty looking all the time I bet she stinks","commenter_a":"What is Always wrong with her tongue? Personal hygiene is a must. Can someone tell her to brush it .","post_message":"Awesome!"},{"comment_id":"10155802536765354","commenter_b":"Hope she goes to jail!","commenter_a":"Sad","post_message":"\"I’m not about to be on no scene 10 minutes doing CPR.\""},{"comment_id":"10156625671370354","commenter_b":"Dork....","commenter_a":"He's a black man who don't no shit about running a country","post_message":"“I’m a black man who sometime wears his hat on backwards,” Obama said. And the rest is, well, you'll see..."},{"comment_id":"933409340029740","commenter_b":"Go back to Mexico we don't want you here","commenter_a":"She's just sorry she got caught and is afraid that her American-bashing, honest statement that was caught on-tape will ruin her career...as it should! She's nothing!","post_message":"Pop star Ariana Grande has issued a second apology, this time on video, after being caught on camera saying she had \"hate\" for America. \"I feel like the apology I posted, I kind of missed my opportunity to actually sincerely apologize...\""}]
