[{"comment_id":"10153837082186130","commenter_b":"Just like a woman - fickle and gossipy.","commenter_a":"I'd like to see a woman president too. The right woman president. Someone so awesome she makes everyone wonder why we waited so long for that woman. I don't think we've found that woman yet.","post_message":"It's not neccessarily an endorsement for Hillary Clinton, but..."},{"comment_id":"1250106475030208","commenter_b":"There actually is a move to get women to sign up for the draft right now (though it won't matter because there will likely never be another draft) But you wouldn know about that because the draft is one of the only things meninists have to bitch about. But","commenter_a":"Why arent feminists fight for equal representation in sanitation? Or equal representation is crab fishing? Or equal representation in the draft. Women should sign up for the draft #genderequality","post_message":"\"But in order to help, those of us who do understand have to know what women are up against.\""},{"comment_id":"10153124003659312","commenter_b":"Did you forget there also was Barry Bonds and others? And yes, there was McGuire! This is old and it happened over 10 yrs ago! Move On!","commenter_a":"Handcuff needs to be in handcuffs for picking the Patriots cheaters! Lol","post_message":"This morning, Handcuff, one of several dogs rescued recently by local law enforcement, made his St. Louis television debut with Rene Knott, to make his pick of a winner in today's Super Bowl. See who he picked and then call Stray Rescue to inquire about adopting him. (314) 771-6121 @webpagelink"},{"comment_id":"588380568016902","commenter_b":"NO, they just want to shove another \"change\" down our throats!!! I am so sick of this. We don't have the money to make such a change. If anything put her on something else but DO NOT MAKE CHANGES!!!!! Do you Dems think money grows on trees?? I am not paying for nor will I ever use a $20.00 again if this is done!!!","commenter_a":"So who made this decision?","post_message":"OH HAPPY DAY!"},{"comment_id":"892607410865802","commenter_b":"As far as an analogy, this is not \"I don't agree with you so I get to beat you.\" This was more like \"you're an abusive boss and I will not be quiet about it.\"","commenter_a":"I find it funny how these pro Trumpers freak out and say how violent Bernie supporters are when in reality it is Trump's hate filled rhetoric that instigates this reaction. God help us all.","post_message":"Californians are having none of Donald Trump's bigoted hate speech."},{"comment_id":"1194670093899735","commenter_b":"Hillary? Really the woman should be in prison.","commenter_a":"The judge is a son of illegal immigrant. @username do your freaking job investigate this judge. I gurantee you he's Hillary Clinton's supporter.","post_message":"U.S. District Judge Gonzalo Curiel in San Diego called for the documents to be released."},{"comment_id":"10157413216720594","commenter_b":"Mom's instinct to protect their young.. Right or wrong.","commenter_a":"I say let the son alone and send his parents to jail for a long time for raising and protecting a rapist son. Whatever this parents are doing is making their son believe he did not do anything wrong.","post_message":"It makes a powerful statement about a parent's will to stand by a child who is morally culpable and has committed a crime."}]
