[{"comment_id":"1727453857514316","commenter_b":"@username,just like your husbands grandparents came in the 30s,my grandparents also came here but in1907 and came threw Eli's Island LEGALLY which was harder to do in 1907 ..so there is no excuse for some coming here illegally today,none what so ever!!","commenter_a":"Trump wants illegals gone and so do I. My dad came to this country legally and at age 65 is still going strong. My brothers are so fortunate and blessed that my parents have given us this opportunity to make something out of ourselves. Seeing illegals demand stuff and act like they deserve things we Americans worked hard for burns me up inside. Illegals have no rights to anything and should be deported and forced to go through legal channels to attain citizenship like other immigrants. We need a wall or a stronger more secure border and absolutely no amnesty for these criminals","post_message":"\"Donald Trump is not a racist.\" Today, in front of Trump Tower, Donald J. Trump supporter Pastor Mark Burns fought back after an illegal immigrant activist tried to shout him down."},{"comment_id":"10156924134420725","commenter_b":"@username The Wall Is Coming and Mexico Will Pay. No More Hand Outs To Mexico It's Time Mexico Starts Taking Care Of Their Own!!! Donald J Trump President of the United States of America and American People 2016!!!","commenter_a":"Don't Forget: DONALD TRUMP WANTS TO BANG HIS DAUGHTER.","post_message":""},{"comment_id":"10155009134559411","commenter_b":"So why can't they do the same over here when the terrorists return","commenter_a":"Danes are fucked-up in the head except her. Brave and lovely lady ! You should run for whatever kind of Governmental election and you`d do very well. All the best to you .","post_message":""},{"comment_id":"557979804384534","commenter_b":"@username I totally agree, how can she not see that??","commenter_a":"If it makes you feel better, I'm ashamed of your actions too. Disgusting.","post_message":"Jaelyn Young broke down in heavy sobs at sentencing, saying she was ashamed of her actions."},{"comment_id":"10155818590289657","commenter_b":"Democrats always want more. They're parasites .","commenter_a":"Who cares what the democrats want. I am so tired of them making demands. They are nothing more then a pack of bullies and I am tired of them. They should try to fix themselves rather than telling other people how to think.","post_message":"\"Ridiculous shame.\""},{"comment_id":"10154146270706218","commenter_b":"@username change the fucking tampon","commenter_a":"President Obama and First Lady Michelle are a class act and what a President should act like with intelligence, calmness and responsibility to the American people, not the train wreck we currently have.","post_message":"Do you miss Barack and Michelle Obama?"},{"comment_id":"447409202129260","commenter_b":"She is the best candidate!","commenter_a":"Dear God deliver us from this evil!","post_message":"Slap Yo'self! www.eaglerising.com"}]
