[{"comment_id":"753368658095076","commenter_b":"Some people should not be allowed to breed, let alone having these many kids. Birth control should have avoided all these tragedies. Imagine the mental damage done to the remaining children.","commenter_a":"\"F\" er...period.IF...this is true...","post_message":"She confronted the father of one of her kids in court."},{"comment_id":"1335775503144117","commenter_b":"Very well said, @username! Plus, people just didn't vote in the primaries enough. It was a simple matter of numbers. But he's still out there and I'm hopeful for 2020!","commenter_a":"i was a die hard Bernie supporter, but I would like to know the truth. Was Bernie placed in the primaries to gain the young vote knowing he would drop out only to hopefully hand the votes over to Hillary. Was he truly conspired against by the DNC or as this post says why didn't he stand up to his constituents? What went wrong Bernie, can you please tell the ones who like me, wrote you in on the ballot even though you weren't registered aS a write in. Your true believers.","post_message":"If you don't have the guts to face your constituents, you shouldn't be in the United States Congress. If you need police at the town hall meetings, that's fine, have police at the meetings, have security at the meetings. But don't use that as an excuse to run away from your constituents after you support repealing the Affordable Care Act, doing away with protections for pre-existing conditions. If you're going to do all those things, answer the questions your constituents have."},{"comment_id":"10154251884613701","commenter_b":"Oh my wow...this bitch right here is why we need to stop immigration...","commenter_a":"It kills me that LGBT wants special rights when they are going against God's Commandments. It's a fact that the LGBT have mental illness, look it up. America was not built on Gay rights. Also what about people of color we are still fighting for our rights in 2016.God commanded that Marriage should be between a man and, a woman. We are living in the last days. Sodom and Gomorrah. You can't say you believe in God when God condemns homosexuality.","post_message":"The 1969 riots at the Stonewall Inn launched the modern gay rights movement and the annual New York City pride parade."},{"comment_id":"1015033255223089","commenter_b":"Tariq doesn't represent the real moderate Islam at all! I am Muslim and I do advocate humans rights no matter what sexuality, religion or colour they are","commenter_a":"I dont like ISIS but they did a very good job by killing the gay... Same sex is not permitted in any Heavenly Religion","post_message":"Blindfolded, bound and brutally murdered"},{"comment_id":"10152884468574877","commenter_b":"Happy birthday you beautiful queen","commenter_a":"Happy Birthday!!!!!","post_message":"We are wishing Lupita Nyong'o HAPPY BIRTHDAY today!! The Academy Award winning actress received her masters degree in acting in 2012 from the Yale School of Drama and in 2014, she was named \"The Most Beautiful Woman\" by People and \"Woman of the Year\" by Glamour. LIKE and SHARE to celebrate!! >>>@webpagelink"},{"comment_id":"10153154951847994","commenter_b":"Finally a judge with a brain! you go girl! They should get life but sadly they will have some tear jerking defense and will probably get ten years.","commenter_a":"Wow, this was compelling!!!","post_message":"A judge is furious over the death of a little child -- and she let the suspects hear it. She says watching their police interview footage was more like watching a cable TV show. Read more about the case here: @webpagelink"},{"comment_id":"10152676681972507","commenter_b":"Not to mention that anti-semitic statements are illegal in France.","commenter_a":"In France you pick up 8 year old kids for what they said in school. I don't care how nationalistic you can get over this, this shows the French authorities are massive hypocrites when it comes to 'Freedom of 'Speech.","post_message":"He's 8."}]
