[{"comment_id":"10153882831009714","commenter_b":"The same reason why men need viagra...","commenter_a":"No pregnancy is a choice and it doesn't deserve any special treatment. Women have been pregnant for as long as time and they didn't need special parking, so why do they need them now.","post_message":"What do you think?"},{"comment_id":"10154108644646178","commenter_b":"This is where GWB, Dickhead Cheney and all those racist MURDERER Cops belongs. They are the real MURDERERS !!!","commenter_a":"Stupidity abounds in the liberal media. Wake up folks!","post_message":"\"Well, actually, again, if you are a terrorist you belong in Guantanamo Bay. That where they should stay....\""},{"comment_id":"1313910325313867","commenter_b":"Some body give me one logical reason to have women in combat.","commenter_a":"There are some exceptional women who can and have performed well. However, truth in science shows overall. Men hold up better. Women break down faster. So many things women do better. Leave the grunt work to us grunts.","post_message":"When will \"the party of science\" accept the truths that science tells us?"},{"comment_id":"10153333368109705","commenter_b":"Maybe more like 12, but the whole \"space age\" thing they started with \"i\" everything is tired. Heck, even their naming scheme. About the only difference today is they do most things in aluminum instead of white plastic, but it still has the same design queues. But who can blame them? When you have so many people branded to buy your products without blinking, change would be scary.","commenter_a":"Let's hope so. Apples design has been stale & stagnant for the last 15 years. For a company who is lauded for it's design, I can't believe It's gone this long without some fresh blood or new design ideas.","post_message":"Jony Ive just got promoted to Apple's C-suite. Here's why it might be his first step toward the exit door."},{"comment_id":"916527265110193","commenter_b":"Rhyno - NO, dems did not control congress for the majority of Bush's presidency, you guys are so clueless..... it's the fault of those that pushed and developed it and demonized those not supporting it...... republicans did it, that pinch your cheeks thing again.....","commenter_a":"It is republicans that have forced Obama to keep the worst parts of the surveillance program going and to make it even more evasive. It is republican that created and pushed the surveillance state down our throats..... and they dare to point the finger at others for THEIR fascists policy.......","post_message":"“Such expansive development of government repositories of formerly private records would be an unprecedented contraction of the privacy expectations of all Americans,” the ruling said."},{"comment_id":"10153639863228352","commenter_b":"Cover up last thing I want to see is someone's boob while I'm trying to eat!!","commenter_a":"I'm with the lady's it's natural and people need to mind their own business the baby was hungry so mom fed it end of story and ask before posting pictures of people you don't know/ have permission to that's rude and illegal fucking ignorant immature sexist swine","post_message":"New mom is horrified to discover a photo of her breastfeeding shared on Facebook by a disgruntled diner"},{"comment_id":"577421592439857","commenter_b":"I don't believe anything this woman says.","commenter_a":"\"You can always point a finger. But there's three pointing back. Literally, If you point a finger at someone else, three of your fingers are pointing back at you. This also means that you need to stop blaming others and deal with your own issues to help yourself.\"","post_message":"Hillary Clinton and her running mate Tim Kaine have released their tax returns, as her campaign called on Donald J. Trump to do the same."}]
