[{"comment_id":"1036028619826340","commenter_b":"Keep walking it back Donald, pretty soon the wall will be some bushes and a couple signs","commenter_a":"Dump Trump","post_message":"I have never liked the media term 'mass deportation' - but we must enforce the laws of the land!"},{"comment_id":"10154081618264087","commenter_b":"There's nothing wrong with her we all saw her open a jar of pickles","commenter_a":"Selfish move since her so called Pneumonia is very contagious . She was in a crowd, she hugged a small child. Not a good thing when you have Pneumonia.Just another lie, how can you believe anything the Clintons or their Clown say.","post_message":"\"I think it shows that she's not one who likes to call in sick.\""},{"comment_id":"10156205584795354","commenter_b":"Right, blacks and immigrants are the problem. It was a white kid who went into a black church and shot and killed 9 blacks while they worshiped. It was a white kid who went into the Sandy Hook Elementary School and shot and killed 20 children while they were trying to learn. He also shot and killed 6 educators who were trying to teach the days lessons. It was a white man who went into a theatre in Lo. and killed people while they were watching a movie for enjoyment. It was a white man who went into the theatre in Co. and shot and killed people who were out for a night of entertainment.","commenter_a":"If people like her wouldn't say dumb shit like this, then most of the \"white people\" wouldn't be racist towards blacks. They just keep it going instead of trying to get to the problem, causing more anger and violence from within everyone.","post_message":"“Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.”"},{"comment_id":"1062925700414568","commenter_b":"ruthless assholes w/$$ that want more $$ and have far right wing values!","commenter_a":"What idiot thought privatizing prisons was a good idea? Whoever it was... That's where they belong!","post_message":"Next time someone says we're a free country, have them read this."},{"comment_id":"10154387073057894","commenter_b":"Bitch she would get demoted hard !","commenter_a":"Good! Let Honda go, she has no relevance on the show! @username","post_message":"NeNe Leakes and Kim Zolciak-Biermann in Talks for a FULL-TIME Return to 'The Real Housewives of Atlanta' for Season 10"},{"comment_id":"10155298164813132","commenter_b":"This dumb broad just made her ignorance known.","commenter_a":"@username Kenya Hall I'm waiting for Riri to read her to filth.","post_message":"Azealia Banks shared several Instagram posts and a video attacking Rihanna for her post about Trump's immigration ban."},{"comment_id":"10152836781859117","commenter_b":"Couldnt agree more. My sister had to go take a nursing exam the day after her 6 year old son died. Then missed the following exam for his funeral and had to make up the days the following weekend. If this bitch wants sympathy she can look in the dictionary between shit and syphilis.","commenter_a":"She is full of shit and her so called \"crippling anxiety\" is also a mound of shit.","post_message":"Brace yourselves for what might be the most frivolous higher education lawsuit of the century."}]
