[{"comment_id":"1312435595456367","commenter_b":"Meeee and babe lmao I feel bad for you on Saturday","commenter_a":"Maria LMAO","post_message":"Yo Chill"},{"comment_id":"1719312091654441","commenter_b":"It sure can happen. We'll see.","commenter_a":"Trump beats Hillary??? Never going to happen. He's too much of a loose cannon.","post_message":"Hillary Has Dark Secrets, Dick Morris Reveals Dick Morris says Trump can defeat Hillary. \"She will lie and cheat at every turn,\" Morris says, \"But Trump needs a new strategy.\" Morris reveals it in his new \"Armageddon: How Trump Can Beat Hillary.\" Get the book here: @webpagelink"},{"comment_id":"1363588373682001","commenter_b":"She should be a circus act, a walking talking pig!","commenter_a":"She's such a pig! She's irrelevant and is desperately attempting to retain some sort of notability. Yeah Rosie you and your big disgusting mouth will be remembered for the hateful words you've inflicted on society. Nice going!! I'm pretty sure you're own adopted kids figured you out and want nothing to do with you!? Very telling!","post_message":"Her tweet of a video questioning whether his young son, Barron, is autistic is nothing short of bullying."},{"comment_id":"10154043300342577","commenter_b":"All women do!!","commenter_a":"is it just me, or has this woman got the most annoying voice in the world? I just wanna punch her in the face","post_message":"Hillary Clinton's Greatest Hits! Vol:1- infowars.com/show"},{"comment_id":"10153245787992507","commenter_b":"I never liked that women .","commenter_a":"She is Just not a good person ......","post_message":"Ann Coulter brought knives to a gun fight on The View."},{"comment_id":"10155022062873984","commenter_b":"Support the Gaines-not the pastor!","commenter_a":"Yes I stand for u chip and joanne","post_message":"'Fixer Upper' stars Chip and Joanna Gaines are being targeted by the media for their church's support of traditional marriage. Liberals are trying to destroy the Gaines family, and now they need your support more than ever. Stand behind Chip and Joanna Gaines and fight the liberal media by signing this petition!"},{"comment_id":"420582524733009","commenter_b":"No lying Bitch will run this Country!! You will be heavy investigated about all this money you have.","commenter_a":"No they never do on the left !!","post_message":"Is the press giving this enough attention?"}]
