[{"comment_id":"10152627692760950","commenter_b":"cathie stickna in your butt","commenter_a":"weird President","post_message":"President Barack Obama makes a few funny faces and uses a selfie stick in a new BuzzFeed video — and some politicians aren't happy about it."},{"comment_id":"10153946118774071","commenter_b":"He is a #WhinyLittleBitch","commenter_a":"If he is not blaming it on the Mexicans, the women, the Muslims, the Democrats, the media or the moderator, it's the microphone. My God what a crybaby. I think Donald need a diaper change 😂","post_message":"Clinton slams Trump's debate performance: 'Anyone who complains about the microphone is not having a good night.'"},{"comment_id":"864050243704778","commenter_b":"We should have spoken up about the poor quality of the American diet sooner. GMO food & MSG should have been outlawed!","commenter_a":"TRADUCTION ARCHI NULE","post_message":"Well?"},{"comment_id":"10153199958166051","commenter_b":"The bitch is lucky to be alive","commenter_a":"Why sue the apt for our own stupidity??? You don't block windows with any furniture you know in case of FIRES!!!! Geeze what a stupid smuck","post_message":"This woman fell out of bed, though an open window and three stories down to the hard ground below. Now she's suing."},{"comment_id":"490217177839688","commenter_b":"YOU BITCHES DON'T MISS ANY WELFARE MEALS DO YOU!","commenter_a":"Only thw Daily Dummies would bring more media attention to something like this. Learn the legal system who iduots. This guy wasn't guilty ever and the rest of Baltimore now knows it too.","post_message":"Baltimore city residents expressed disappointment in response to the city circuit court Monday finding a police officer not guilty in connection to the death of Freddie Gray."},{"comment_id":"10153311243783690","commenter_b":"Muslims and Crishtians in Kenya have lived among eachother peacefully. How come we never fight religion for thousands of years and these scam bugs are dividing us and using religion because of their own business. Kenya troops has nothing to do being in Somalia. This terror group kill it's own people. If u disagree with them they will kill you even if u are a Muslim . As amuslim somali man, when I was in Kenya I used to play football with Kenyans and respected eachother. They neve harmed me and I never thought harming them because when we know the value of humanlifes. Kenya government should build county police and protect all university, malls, and give good salary to the police and security intelegence. Iam sorry to say this your police are corrupted. Give your police a good salary so they will protect ur citizens and the country. Ethiopian ...","commenter_a":"Just wondering why only Moslem students were freed!","post_message":"\"I am so worried, I had a son who was among the students trapped inside the college, and since yesterday I have heard nothing,\" said Habel Mutinda, an elderly man, his face streaming with tears. \"I tried to identify his body among those killed... I have to do that before the body goes bad in the heat.. I have been camping overnight, it is really hard, it hurts.\" @webpagelink"},{"comment_id":"10150636075789999","commenter_b":"Lmao is this satire","commenter_a":"@username remember when we were talking about this at work the other day","post_message":"The tyranny of \"resting bitch face\" is real."}]
