[{"comment_id":"1065479603531539","commenter_b":"Only more proof that you can't fix stupid! Who gives a damn what these idiots think? I sure don't.","commenter_a":"To heck with DC's","post_message":"The last time they did this, thousands of their CDs were destroyed..."},{"comment_id":"896653263722173","commenter_b":"Why is she getting away with this lawless behavior?","commenter_a":"told ya!","post_message":"HILLARY CLINTON HANDS OVER A BLANK SERVER TO THE FBI Slick Grifter..."},{"comment_id":"1169496993094128","commenter_b":"Girl, you nuts.","commenter_a":"Don't believe everything you read, folks...apparently Nate Silver got a call from Washington, telling him to \"fix\" his poll numbers from last week. Trump is trumping HRC, and the media is lying to us all. Shoulda picked Bernie when they had the chance. #stillsanders #neverhillary #electionfraud #dnc","post_message":"Our latest polls-only election forecast gives Donald Trump an 17% chance to win the presidency. Polls-plus puts it at 24%"},{"comment_id":"10153665753806336","commenter_b":"That was THEN! This is NOW! The law of the land NOW is all that matters! Let go of the past and get with what needs to be done now! NO more illegals. I don't care if they are baby's or adults, they have to go back! They don't belong here period!! Stop saying we are all here illegally too, it makes it clear you think it is ok for these things to happen. I see most of your last names are hispanic.","commenter_a":"The correct term is illegal alien not illegal immigrant...read the constitution..those people have no rights here and neither do those born here from illegal aliens...the constitution says they are not citizens of this country.","post_message":"Border Patrol officers near San Diego noticed that the driver, a U.S. citizen, was acting weird, so they used imaging technology to inspect the car."},{"comment_id":"895880550545124","commenter_b":"An actual woman.","commenter_a":"This is a weak argument.","post_message":"Maybe liberals should have thought about how much they wanted to focus on Michelle and Melania's speeches before they started losing their minds. With so many people looking at the speeches this was gonna happen."},{"comment_id":"116808422164651","commenter_b":"Illegal immigration must first be brought under control. Only then can we regulate all immigration and I doing do Skylake washes to naturally as the flood of cheap labor is ended.","commenter_a":"END THE DRUGS COMING IN US ! WE'RE IN BIG TROUBLE WITH DRUG ADDICTION","post_message":"BORDER WALL: President Donald J. Trump is expected to sign an executive action today to jump start construction of the border wall that he promised would be built during his campaign. MORE: @webpagelink"},{"comment_id":"10154455008597509","commenter_b":"Andre Ceasar","commenter_a":"Brittany Benoit, Jade Walker","post_message":"Take a look at the friends who you have outgrown, who you don’t talk to anymore, who makes no effort to see you. Focus on the friends who matter most."}]
