[{"comment_id":"10153263550734205","commenter_b":"Sure @username","commenter_a":"Not every Muslim is a terrorist, but most terrorist are Muslim. It's science.","post_message":"Man Bullies Muslim At Town Hall"},{"comment_id":"1055649497786607","commenter_b":"I have been doing some serious thinking on this. I have always been pro second amendment, but maybe it is time to take a look at this from another direction. I propose we start here and see how this new gun control thing works. I propose that all people convicted of felonies be banned from owning/possessing firearms. All convicted felons should be made to turn in the guns the legally own now. Once we have all of those, lets move to people convicted of misdemeanor crimes of violence, like assault, sexual battery and so on. Lets get all those criminals that currently legally owning guns to turn those in. I figure it will take a year or so for all these people to disarm and turn in their guns and then we can see if we are having a positive impact on violent gun crimes. If so, then we can ...","commenter_a":"What don't the gun grabbers understand, if you take every gun out of every house hold we have no defense against the bad guys with the guns because they don't give a shit about the laws to start with...","post_message":""},{"comment_id":"10154242244603635","commenter_b":"\"I agree you can still do all those things.\" So then you were making things up before. Glad we got that straightened out. \"I've known of kids getting suspend from school for praying before they ate lunch\" If that actually happened, the school involved broke the law. \"Employees were not allowed to say Merry Christmas it was happy holidays. She told me that.\" Right, because saying \"happy holidays\" is more inclusive. Of course, while not on the job, she was completely allowed to say \"Merry Christmas\" to her heart's content. \"There has been a huge change in this country for the last 25 years of Christianity being slowly phased out by our government.\" Not really. Christianity has never been part of our government, since it's not supposed to be. The first amendment makes that clear.","commenter_a":"I guess this is another step on kicking God out of this country.","post_message":"Indiana city renames Good Friday \"Spring Holiday\" to be more inclusive"},{"comment_id":"10153092045117756","commenter_b":"there is no place around here seems like most females prefer dating sites i think","commenter_a":"screw dating sites they dont work","post_message":""},{"comment_id":"1304540879566920","commenter_b":"If Gwyneth puts it in Goop, it's not a feminist thing, lol","commenter_a":"This is a feminist thing, eh?","post_message":"Don't put herbs in your vagina, for goodness sake. Your womb doesn't need a freaking detox."},{"comment_id":"954186131315786","commenter_b":"Her being revealing? Do you think she picked out the dress herself and made a conscious choice to show her nipples?","commenter_a":"To be so revealing when so young is certainly extremely questionable moral territory.","post_message":"Too young?"},{"comment_id":"10154190661067541","commenter_b":"Now that's an ugly women","commenter_a":"Bannon you are a lot better looking than that thing in the left.","post_message":"Steve Bannon has a doppelganger, and her name is Rosie O'Donnell."}]
