[{"comment_id":"10152960734572014","commenter_b":"They need to leave them alone! Stay out of our business in az this is our state Feds!!!","commenter_a":"These horses must be left alone! They cause zero harm, and countless amounts of pleasure to all who see them! Using the logic of \"public safety\" then why haven't all the bears in our National Parks been removed???? I had an uncle when I was very young who worked for the Forest Service. I'm sure this would shocked by this action.","post_message":"Arizona Governor Doug Ducey has voiced his support for leaving the wild horses where they are."},{"comment_id":"10153698942976350","commenter_b":"Not everyone has reconstruction surgery. It is hard to find a bra that holds the prosthetic breast without it going sideways so you end up looking off. I opt for a sports bra most days as I have one breast.","commenter_a":"I love Stella!","post_message":"\"We wanted to bring something feminine and beautiful into a bra that is taboo.\""},{"comment_id":"1039629819427046","commenter_b":"Americans could get jobs if they'd get off their fat asses and go to school. All these uneducated Trailer Trash need to go back and graduate 3rd grade.","commenter_a":"We have Americans that are finding it hard to find work because of the flooding of all the refugees just think that will be 50000 more Americans that won't be getting a job because they will","post_message":"BREAKING: Two Iraqi refugees in the U.S. were arrested on Thursday for supporting terrorist groups in the Middle East. The FBI Director has repeatedly said that the U.S. does not have the ability to thoroughly screen refugees for terrorist ties."},{"comment_id":"10153606624740667","commenter_b":"How's that gun free country law working out for them now ?? President Carter band Iranian Muslims during the hostage crisis & deported over 20,000 Iranian students, Iran is a Islam Islamic nation. Democrat's never called him a racist. US immigration Laws cover religious test for immigrants !! The AR 15 is not a military assault rifle & not fit for hunting deer or elk by some hunting laws, it's a singal shot gun !! Some pistol clips holds 15 rounds of ammo !! PS: Hillary is on record in support of a wall on US Mexican border !!","commenter_a":"So sad. :(","post_message":"BREAKING: Jo Cox has died."},{"comment_id":"574645872704026","commenter_b":"@username so a woman that let Americans die that's the kind of person you think deserves to be president cause it's gonna be between the 2 think about that witch one is really worse","commenter_a":"Things will change when Trunp is president. The border police will have Trumps support. He'll also will support the Police & our brave service men & women. Vote Trump!","post_message":"Well that was easy..."},{"comment_id":"10153914495466491","commenter_b":"How is a white woman being racist unbelievable?","commenter_a":"Unbelievable that people would accuse Ellen being a racist","post_message":"Ellen DeGeneres took to social media to respond to the backlash."},{"comment_id":"952483414832934","commenter_b":"Don't tag me in anything, slut-shamer.","commenter_a":"Lyssa","post_message":"The details of the next season of American Horror Story are terrifying..."}]
