[{"comment_id":"10154066489172994","commenter_b":"Can I suggest a clip?","commenter_a":"Beyond a reasonable doubt. They have him , his gun, and a half dozen witnesses; he even pleaded the 5th. go figure. He wouldn't even get a chance to pray with me. One BULLET to his head, ok , 2 , just to make sure.","post_message":"Body found in a burned-out house in Detroit confirmed to be the mother of the missing 4-year-old girl -- the subject of the Amber Alert sent out this weekend. Police said the injuries were so severe to the second body thought to belong to the daughter that a positive ID could not yet be made. @webpagelink"},{"comment_id":"555784677879905","commenter_b":"They're not looking for life, we are looking for resources, we kill each other for that in this planet. When we find the other resources the inhabitants of set planet will surely deliver our faiths.","commenter_a":"So anti media feel stopping space exploration will solve earths worries? ?Sorry but go the space programs and all the science behind it!","post_message":"Right? Follow us --> The Anti-Media <--"},{"comment_id":"10153723307413037","commenter_b":"RideAustin doesn't even have an Android app yet. On the other hand, Fare has an app like Uber & Lyft, does the required background checks, offeres a way to schedule an upcoming ride and to choose preferred drivers....and it is all working now...as in this minute. Download the app and use me for a reference: Lynne3. @webpagelink","commenter_a":"Give our City Council a call...maybe they will give you a ride. @webpagelink","post_message":"The company says it will pay for fingerprint checks. Are you likely to give this company a try?"},{"comment_id":"238983709893436","commenter_b":"Assholes. Shame on them...they got their education...the Hell with our future!","commenter_a":"pride in ownership republicans push education backwards.","post_message":"Was YOUR senator one of them? Spread their shame!"},{"comment_id":"520161724799271","commenter_b":"Illinois State law Requires When a firearm is sold or transferred, the buyer is required to present their FOID card. This applies to private sales between individuals as well as to sales by Federal Firearms License (FFL) holders.[7] For firearm sales by an FFL holder, or at a gun show, the seller must perform an automated dial-up check with the State Police, to verify that the FOID card is valid, and to redo the background check of the buyer.[4] This additional checking is known as the Firearm Transfer Inquiry Program (FTIP).[8] For private sales not at a gun show, the seller must also verify the buyer's FOID card with the state police, and receive a transfer approval number, either via a web site or with a phone.. Once again the Anti_ Gun posters cannot get the story straight even if they tried.","commenter_a":"So glad we have Universal Background Checks! Next time the criminal will do a Universal Background Check before he beats the victim and steals all the other guns. You know so he is somehow legal?","post_message":"Before leaving, his attackers also took his gun safe and ammo. -Linda"},{"comment_id":"10152879295577623","commenter_b":"A lot of girls are...","commenter_a":"Worst part is...SHE looks like she was cute,pre meth...","post_message":"A man and woman from North Carolina were arrested in Louisiana and face charges of manufacturing meth."},{"comment_id":"10152880805672377","commenter_b":"Worried ???? then I suggest she better get her BUTT in gear and start letting us know what HER AGENDA is !!!!!","commenter_a":"Go Betnie, GO. We need candidates that are not corrupt and money grabbers without all of the baggage the Queen carries. Someone who has the interest if the country in mind not self- aggrandisement.","post_message":"Hillary Clinton's campaign is \"worried about\" the challenge being posed by Sen. Bernie Sanders, whose popularity and poll numbers are continuing to grow."}]
