[{"comment_id":"949815198400996","commenter_b":"@username China built a 13,000 foot wall over 2000 years ago. You don't believe we can build a 1000 foot wall? --- I live in California and illegal immigration is a huge problem that you clearly don't understand. Please take some time to do some research. Let's Make America Great Again!!! Cheers for Trump!!!","commenter_a":"Sir Newt may be one of your best choices as a Vp, he knows the political game better than most and is not the typical establishment guy, his IQ is also very high, I hope he is on your short list, to at least find a spot on your cabinet","post_message":"Via Newt Gingrich: Donald Trump's foreign policy speech is about putting AMERICA FIRST! I had been calling for an overhaul of the foreign policy establishment at the State Department since at least April 2003, when I gave a speech at the American Enterprise Institute calling for completely transforming the Department. And I first warned that America had “gone off a cliff” in Iraq in December 2003........"},{"comment_id":"10153227343366770","commenter_b":"Oh them dumb white people they so racist! Sarc","commenter_a":"She looked so stupid. She clearly made a dumb open statement that wasn't true. Obama told her...it didn't stop her from getting a gun. Brain washed White people. You White Republicans vowed a sworn oath to not give anything to Obama before he took office. A sworn oath. Racist haters. A sworn oath. So don't blame the Black guy You hated and conspired before he took office to hate him. Now you act like you don't understand why he used Executive Orders. Dumb racist White supremist. Shes a NRA crash dummy. Wow....Whites really got no common Sense. Natural born Black haters. Trying to make her a hero...SHE SAID NOTHING NUT GOT SHUT DOWN BY OBAMA FOR QUOTING WHITE MEN AROUND HER. LOL. OBAMA GOT THE LAST WORD.","post_message":"Taya Kyle, the widowed wife of Navy SEAL Chris Kyle confronted Barack Obama Thursday at a CNN town hall event on guns Thursday night."},{"comment_id":"1816060081994479","commenter_b":"Worst lady","commenter_a":"Healthy lunch...kids that depend on this for their only meal for the day are going home hungry.","post_message":"Vice President Joe Biden calls Michelle Obama the \"finest first lady in history\"."},{"comment_id":"947304708651886","commenter_b":"I agree ,however the woman has he ultimate protection! POLITICAL PRIVILEGE!!","commenter_a":"then WHY isn't he requesting it/","post_message":"The pressure is growing..."},{"comment_id":"1163610097050858","commenter_b":"So you would prefer a lying heartless uncaring self serving witch? Who tried to play down her predator husband's affairs.","commenter_a":"Trump is only for Trump and now the Republican Party is his new trophy...Good Luck GOP....I am out of there for good","post_message":"More great content from our friends over at Team Trump!"},{"comment_id":"10153183843753188","commenter_b":"Boy if they can do all that in Mexico why are they crossing our borders","commenter_a":"i just came home to Seattle from 10 days in Mexico and it made me think. I think it would be better to be in a country like Mexico if the world went crazy. Those people know how to survive on nothing because they have done it all their lives. They know what to do when the lights go out... they know how to grow food and take care of themselves. I can't even imagine what Seattle would be like if this area was thrown into the same poverty level as Mexico... it would be a mad house!!!","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"10155106719593132","commenter_b":"She probably was in on it. What woman in her right mind would move in with a man whose wife mysteriously \"disappeared\" just 2 months prior? Both had to know she wasn't coming back.","commenter_a":"Girlfriend needs to be scared now. Similar to the Lacy Peterson case. Very sad!!","post_message":"Elizabeth Sullivan appeared to have vanished two years ago without a trace."}]
