[{"comment_id":"1721472904763525","commenter_b":"^^^Yet he has no blood on his hands. Killary got that cure little nickname for a reason. Several, in fact.","commenter_a":"We can not and must not settle for Clinton or worse Drumpf. The time is near and we must let everyone know, that If Bernie somehow doesn't win the nomination, we want him to run as a independent so we can put him in the White House. Too many people registered as independent did not have a chance to vote in closed primaries, if they did Clinton would not be leading with pledged delegates. The Democratic Party must be aware that if Bernie runs as an independent there is no chance of Clinton winning anything, so if they don't want Drumpf in the White House they should start backing Bernie now. Because there is no way in hell I'll ever vote for Clinton.","post_message":"Here's the promise I made to you on day one of this campaign: Not only will I fight to protect the working families of this country, but we’re going to build a movement of millions of Americans who are prepared to stand up and fight back. We’re going to take this campaign directly to the people – in town meetings, door to door conversations, on street corners and in social media. Right now we are in Indiana. Tune in live here:"},{"comment_id":"1538803016422900","commenter_b":"EVIL WOMAN!","commenter_a":"WHAT IS THAT, AN ALBINO MONKEY????????","post_message":"Did Hillary Clinton get her money's worth?"},{"comment_id":"983924208336363","commenter_b":"America matters. They have been told we are the land of the free.some people here know what free is.if our government would stop the hand outs then and only then we wouldn't have to support them or anybody else...take care of our own first.","commenter_a":"This is the UN top priority to control these flood of people leaving their own country for a better life/safety of their family, and if they make it all the way....The human smuggling organizations like this type of situation and it brings a large revenue to their business all over the globe... We only can hope and pray that all nations will come together try to come up a solutions to stop the displacement of these people of the terrorist activity and senseless killing of innocent people base of their religion.... Here we are, we spent millions or billions in a exploration way out deep in our universe to study a planet that can sustain a human in the near future?...Yet, we have all of these important issues that needs to be fix, and maybe, we make our planet a better place for everyone.... We only can hope and pray ...","post_message":"RIDICULOUS: Over 700 African Illegals Caught in Panama en Route to the United States The number of Africans who have illegally traveled through Panama on their way to the United Sates has more than doubled so far this year. GREAT WALL OF TRUMP PLEASE! @webpagelink"},{"comment_id":"10155810026285725","commenter_b":"Now Mr Trump you know as well as I do Obobblehead is a backstroker, he says one thing and then does another, then tries to back stroke to cover his lies","commenter_a":"Finally someone who thinks like a REAL American!! You have our vote.","post_message":"Make our borders strong and stop illegal immigration. Even President Obama agrees-"},{"comment_id":"1190551201025975","commenter_b":"You can now add Tucson to the list of sanctuary city's. We should recall the city supervisors. Our southern border is now wide open. There want to increase the city sales tax to take care of the influx of illegals.","commenter_a":"Has anyone else noticed that whether the terrorist attack is in Europe or America, the police and other authorities already know about the terrorist? Just asking.","post_message":"The Berlin attacker was a refugee and known terrorism suspect, and Germany still didn't deport him! How will this affect Donald Trump's America? Your hosts: Christopher Bedford, Katie Frates and Saagar Enjeti."},{"comment_id":"1414587195226950","commenter_b":"2 all the women in pink why not just pack up ur pink panties and move 2 Cuba now that we have relations again I hear it's a paradise.","commenter_a":"GROW UP","post_message":"Female supporters of President Donald Trump aren’t sure why the Women’s March was necessary."},{"comment_id":"10154622487769342","commenter_b":"Ignorance. Many Americans with family there. Not your brothers/sisters? Or don't they count?","commenter_a":"Fall out from whom? Iran saying Americans aren't welcome there? Darn. Or is it the shrieking protestors? Tiresome.","post_message":"Legal residents and visa-holders were being denied entry Saturday to the U.S. under the Trump action."}]
