[{"comment_id":"1813003575594431","commenter_b":"Us white people got to go yuh eard meh","commenter_a":"Were pray tell is this \"white rage\"? I am white and I feel no rage nor the desire to go out in public and carry signs around. I am not happy with where this country is going but I am not out all day every day protesting and tearing things up..oh wait a minute...I work all day.","post_message":"According to a new book by Emory historian Dr. Carol Anderson, many of the struggles faced by the African-American community are the result of \"white rage.\""},{"comment_id":"1008831639165859","commenter_b":"Evil, vile woman.","commenter_a":"POS!","post_message":"Never forget..."},{"comment_id":"1013838895312830","commenter_b":"That's what girls get, cause they want to grow up fast n experience sex.... Don't blame the man... They r just man... Like a dog give him a bone n he would eat it no matter what...","commenter_a":"Sadly this happens a lot. My neighbors daughter was 14 with a 22 year old. Her parents knew. Let her go to the beach with him, let him stay the night ect.. then they broke up and he broke her heart. The parents put him jail. He now has to register as a sex offender for life. : (","post_message":"FUGITIVE WANTED: The Dickinson Police Department is looking for a 24-year-old man accused of sexually assaulting a 14-year-old. Authorities say they have been unable to locate Joshua Dwight Blair at his residence or last known place of employment. If you know any information about his whereabouts, you are asked to call police or Crime Stoppers. MORE ---> @webpagelink"},{"comment_id":"10152876069325950","commenter_b":"Enjoy your retirement Bob","commenter_a":"A straight shooter w/ a sense of humor and a poet to boot. Sunday won't be the same. We'll miss you, Bob.","post_message":"Bob Schieffer's 46-year career at CBS ends this morning with the 10:30 a.m. ET broadcast of \"Face the Nation.\" As we say goodbye, here's a lighter reflection with some of his best bloopers across the years."},{"comment_id":"10153664452407183","commenter_b":"Very good comment !!!","commenter_a":"Mr. Robertson you do know that the Bible is a compilation of 66 books and letters written by more than 40 authors during a period of approximately 1,500 years. Its original text was communicated in just three languages. The Bible's authors were very human and may have been inspired by what they understood to be God's words, thoughts, actions. These 40 individuals came from various walks of life. Moses was probably the most educated, while the others were shepherds who became the King of Israel (David), farmers, fisherman and warriors. These earliest accounts were handed on from generation to generation in songs, narratives, and poetry. In those early societies there was no writing as yet and people passed on these oral accounts and with that the stories are exaggerated, changed, misrepresented, and contradictions, so we admit the humans creating the bible were not infallible or God is bi-polar. The creation ...","post_message":"Who knew that being kind to gays was a death sentence?"},{"comment_id":"10152957013791336","commenter_b":"It's NOT HEALTHY to break into their homes or rob them or attempt To hurt their families......","commenter_a":"Why are all Americans so obsessed with guns, it's not healthy.","post_message":"Bonnie and Clyde's infamous pistols of choice — What are they worth? Find out tonight at 8:30p ET on Fox News Channel. (via Strange Inheritance)"},{"comment_id":"1138154636255284","commenter_b":"YOU are so full of it....I bet women probably leave YOUR sorry ass....YOU have NO CLASS. ...I CAN TELL","commenter_a":"I DON'T believe that...Who would want her....No One....Just her husband and she's lucky he gave her the time of day","post_message":"She was just exposed. This family needs to be booted from the White House. Do you think Michelle Obama is a disgrace?"}]
