[{"comment_id":"649071821906476","commenter_b":"THATS WRONG WITH THIS WORLD! Let her whipr children!","commenter_a":"Next time the boys won't be so lucky. Somebody just might get killed.","post_message":"Louisiana mother arrested after allegedly whipping her three children as punishment for breaking into a neighbor's home. \"I never could imagine that trying to be a good mother would end me up in jail.\""},{"comment_id":"1249598461784360","commenter_b":"Illegal go home","commenter_a":"Why doesn't anyone show compassion? They lost their mother, they are grieving. How would u feel? Instead they act like she is a criminal for wanting her kids to have a future no matter what happened to her.","post_message":"LIVE VIDEO: The family of the Valley mother who was detained and deported under President Donald J. Trump's immigration executive order speaks outside of ICE headquarters in Phoenix. STORY: @webpagelink"},{"comment_id":"10153745675114641","commenter_b":"The most beautiful mistake in history. It was like a fairy tale that came true. Both ladies got a chance to win. They are all winners.","commenter_a":"Que estUpido!","post_message":"The moment when Steve Harvey crowned the wrong Miss Universe. Full story: @webpagelink"},{"comment_id":"1916311915262611","commenter_b":"Wrong country? Or city? Please, do not behave yourselves wiser than Asians or Muslims. It's a sin. We have to love each nation regardless their colour, religion, geographic location.","commenter_a":"Pithy Vann that sucks","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"981667418562042","commenter_b":"CNN commies hiding the truth and denighing the facts.","commenter_a":"Lemon is such a a a I can't find an insulting enough word. Help!","post_message":"VIDEO: CNN Instantly Ends Segment When Pro-Trump Latina Says This About Donald @webpagelink"},{"comment_id":"10153576684991323","commenter_b":"Life is harder for women? That's why they live longer on average than their male counterparts? :p Please. That generalisation is painful to read.","commenter_a":"\"... an air of misogyny among her predominantly male colleagues...\" Basically, trivial nonsense that women want to incessantly complain about as always. Guess what: circles of female friends/colleagues will ALSO make misandrist comments about their boyfriends and men in general. The difference? Their remarks are treated as levities and never deemed sexist, whereas men are pilloried for supposed misogyny. Double standards, anyone? Woman to her friends: 'No, I don't do any DIY. I get my man to do that!' (Socially acceptable). Man to his friends: 'No, I don't do any house cleaning. I get my woman to do that!' (Misogynistic).","post_message":"Sometimes leaving a job is easier than standing up to sexism – so what can women do about it?"},{"comment_id":"10152700473451051","commenter_b":"Better to stay single. Plan to meet in a well lit public location. Women don't pick up or be picked up.","commenter_a":"I tried this one time! Never again! He scared me!","post_message":"It started out as an ordinary date between two people who met online. It ended very violently."}]
