[{"comment_id":"10152700491620779","commenter_b":"Heavens to Betsy, woman. Have you tried Fortitude?","commenter_a":"Thanks @username. I'm currently watching BB. Yes, I really am.","post_message":"Let's face it: We are currently living in the all-you-can-eat-smorgasbord era of TV viewing choices. The downside is that the abundance of stuff at our fingertips also makes it easier for jaw-dropping, mind-expanding small-screen masterpieces to come and go without so much as a peep. From a British gangster thriller to a surreal riff on twentysomething single life, click through for 10 shows you should be watching this year."},{"comment_id":"714279835348897","commenter_b":"More trigger happy pigs.","commenter_a":"Better to be tried by twelve than carried by six. Today's cops are not the cool headed officers of old. They are post 911 trigger happy thugs who think Johny Jihad is around ever corner. DO NOT CALL KEYSTONE COPS until the threat is gone or dead and your guns are put away.","post_message":"A Huntsville woman seemed to have been perfectly justified in firing upon a violent ex who walked through a restraining order. Whether she was a threat when she turned towards responding officers with the shotgun still in her hands is under investigation."},{"comment_id":"1187655654624295","commenter_b":"You couldn't even please your husband, what makes you think you can please us? #NeverHillary","commenter_a":"Nice","post_message":"In the presence of practical, tactical brilliance at Hamilton: An American Musical."},{"comment_id":"10154126600721770","commenter_b":"I agree....classy lady","commenter_a":"Ivanka could hop into a potato sack and make it look good.","post_message":"You couldn't miss Ivanka Trump today."},{"comment_id":"10154619916723812","commenter_b":"she only made that statement because she's salty that Melania got busted lol.","commenter_a":"Again for those that don't have a clue. A speech writer helps to incorporate your thoughts and feelings on paper. As the article reads Michelle was heavily involved in the speech. Read b4 u comment.","post_message":"The woman who wrote Michelle Obama's DNC speech is currently a senior presidential speechwriter and has been a speechwriter for Hillary Clinton, John Kerry, and more in the past."},{"comment_id":"988396247881207","commenter_b":"She should have walked with a pig","commenter_a":"So stupid.","post_message":"Woman Hitchhiked Through The Middle East To Prove Muslims Are Peaceful. What They Did Next..."},{"comment_id":"1744752812466666","commenter_b":"He can't he has to pay for all of Obama's muslims he let in here during his presidency. Also, all the illegals. Unless we get rid of all the illegals there is no money.. Oh and the muslims that Obama let in here..LOL","commenter_a":"Mr. @username, Like where you're going. I would 1st Cut Welfare 100% and give it all to the Vets, they have earned it. Close the border and start kicking out un-documented, non tax paying illegals. Bring jobs back to the U.S.A, and repeal oshitcare. Also free up the 2nd A. If you Hate this Country Ask the Government for a ONE WAY TICKET to anywhere in the world. Free of charge.","post_message":"A NATION WITHOUT BORDERS IS NOT A NATION AT ALL. WE MUST HAVE A WALL. THE RULE OF LAW MATTERS! -DJT"}]
