[{"comment_id":"10152969053772293","commenter_b":"Well scumbags cat got your tongue","commenter_a":"It is not racism.It is about illegal bangladeshis entering every bordering country. Half of Bangladesh is in India. Burma or Malaysia are not like India.These Bangladeshis create all sorts problems from drug peddling, to prostitution, thievery, robberies, kidnapping & rapes. Recently bangladeshis raped a 70 year old nun at a church.","post_message":"A tragedy no one wants to own."},{"comment_id":"10156240783770389","commenter_b":"It was painful to watch! How annoying is Bernie??! Good Lord!!","commenter_a":"#PresidentTrump","post_message":"Dumb, dumber, and dumbest?"},{"comment_id":"10158293361345725","commenter_b":"Well mother nature must be a murderer because women spontaneously abort all the time. It's called a miscarriage.","commenter_a":"Although I consider myself a Progressive, I have to agree that abortion is murder. That is one thing that I agree with the Republicans. Not because of their political beliefs but me as a human being. Murder is murder and we shouldn't give permission to commit it.","post_message":"Ohio Governor John Kasich has signed a bill imposing a 20-week abortion ban, in a prelude to the broad offensive abortion-rights opponents plan to launch across the nation in January."},{"comment_id":"10153543812088812","commenter_b":"She was too busy preaching abstinence.","commenter_a":"did she ever hear of birth control? apparentally not","post_message":"Bristol Palin announces second pregnancy; says she knows it will be \"huge disappointment\" to many: @webpagelink"},{"comment_id":"1025935160778053","commenter_b":"Women with body ink graffitti make excellent role models","commenter_a":"Why do you report articles from other countries like this? I'm sure if you applied yourself you could find your own sources of pathetic losers to post about.","post_message":"This welfare leech is getting $1,700 a month in benefits... and that's not the shocking thing. She had the GALL to complain about it. You know, if she's so unhappy with it, the taxpayers who provided it would be more than happy to take their money back..."},{"comment_id":"1249874218366089","commenter_b":"Same here, can't stand that witch!","commenter_a":"I'll watch O'Reilly and Hannity but I haven't watched Kelly since the fox debate and never will again","post_message":"TONIGHT: Fox News Channel is live until 2a ET with post-debate reaction. Don’t miss special coverage from Bill O'Reilly, Megyn Kelly and Sean Hannity. #GOPDebate Details: @webpagelink Live blog: @webpagelink"},{"comment_id":"10154941514794062","commenter_b":"Say what you like.. Hoe, no talent.. Her bank account says otherwise. Carry on","commenter_a":"The only fame she has is singing with her legs apart and if it wasn't for that she wouldn't have any fans.","post_message":"Good news for Beyonce fans!"}]
