[{"comment_id":"970468323009697","commenter_b":"@username PLEASE vote for Hillary she is on her way out, just ask Biden, ask Obama, ask Bernie, ask the FBI. So plz do us a favor and vote for her, she will need something to read in jail and your voting ballot will be perfect.","commenter_a":"She might have a college plan but how could she do it from jail?","post_message":"How much could your family save with Hillary’s college plan? In Oklahoma, a family earning $75,000 per year could save $22,300."},{"comment_id":"10154498360755958","commenter_b":"You mean the Virginia Mary who gave birth to JESUS. I highly doubt that is the reason for the hijab..when many women rose up in the middle east against wearing it.","commenter_a":"I am amazed and sickened by the racist comments posted here. She is a doctor working in America saving American lives. She can wear whatever she chooses because this is America. Wow...","post_message":"\"I'm so happy to be back here in Cleveland.\" The Cleveland Clinic resident who was forced out of the U.S. under President Trump's executive order is back home and speaking out for the first time."},{"comment_id":"10154336382586729","commenter_b":"What a bitch...","commenter_a":"Maybe she could watch it from her prison cell!","post_message":"This woman...SMH"},{"comment_id":"10153112350927908","commenter_b":"That is no good, that is not acceptable.","commenter_a":"I'm afraid Netanyahu's alternative, as well as that of many Republicans, is to bomb Iran's possible weapons sites--not the solution I'm hoping for!!","post_message":""},{"comment_id":"1764917753728484","commenter_b":"Not!!! When she decided to make \"her\" body a home to another human being it stopped being \"her\" body and it became \"their\" body. And as that other human being is incapable of making decisions for itself, that dumb cunt sucking poisons into \"their\" body should be jailed until the other human being is freed. Then the dumb cunt should be put in an air tight room and have the exhaust of a semi pumped into it.","commenter_a":"No,it's not her choice.Since it's obviously to late for an abortion,and she cant' control her substance abuse;she should be incarcerated until the birth of the child.The child should be then taken from her and given the best possible foster care. Hopefully the child is ok.In any case,she should be charged with child endangerment at the very least and remain incarcerated until she's no longer able to reproduce.They should also find the father of this child to find out if he is either complicit in this endangerment or is morally able to care for the child.","post_message":"What do you think? Join Us: The Free Thought Project"},{"comment_id":"10154299911443128","commenter_b":"40K Cubans today 100K Muslims yesterday.","commenter_a":"I'm sorry, but this old man is as stupid as they come if he really thinks we, as Americans, are buying this inflammatory rhetoric. Get real. Maybe he forgets how or just wants to go the way of his candidate down to LA LA land. Bon Voyage! ;-)","post_message":"Oil billionaire T. Boone Pickens, who endorsed presumptive GOP nominee Donald Trump, is planning to host a fundraising event for the pro-Trump super PAC next month."},{"comment_id":"581504818688172","commenter_b":"we are \"nasty women\" and we vote!","commenter_a":"Your mother always said that you were a disappointment and a nasty little creep.","post_message":"The conviction of an Iraqi refugee plotting to blow up the Houston Galleria is exactly why I've been pushing so hard to immediately suspend the refugee program from terrorist hotspots. The current program is a Trojan Horse allowing ISIS and other terrorist groups an open invitation into the U.S."}]
