[{"comment_id":"10152980958545399","commenter_b":"This may help. My feelings as a Christian points me to my Lord and Savior as a fighter. It points me to the man who once in loneliness, surrounded only by a few followers, recognized these Jews for what they were and summoned men to fight against them and who, God's truth! was greatest not as a sufferer but as a fighter. In boundless love as a Christian and as a man I read through the passage which tells us how the Lord at last rose in His might and seized the scourge to drive out of the Temple the brood of vipers and adders. How terrific was His fight for the world against the Jewish poison. To-day, after two thousand years, with deepest emotion I recognize more profoundly than ever before in the fact that it was for this that He had to shed His blood upon the Cross. ...","commenter_a":"Just what was the religion of the people loading Jews into ovens in Europe?","post_message":"\"When you take Christianity, Judaism, Hinduism, Buddhism, whatever, their combined killings in the name of religion -- well that number would be zero.\""},{"comment_id":"465989180258329","commenter_b":"HELL NO FUCK THAT BITCH","commenter_a":"I wouldn't take them if they were free.","post_message":"Will You Refuse To Buy These Stamps?! Comment 'yes' or 'no'."},{"comment_id":"10152884720337217","commenter_b":"Humans suck 😕","commenter_a":"Man. The death of all animals, plants, and everything else. I swear. Smdh.","post_message":"The tiger that mauled a man to death after escaping from a flooded zoo in Georgia has been shot dead. (Footage from Georgia Ministry of Internal Affairs)"},{"comment_id":"10153199702710095","commenter_b":"We'll soon be seeing the kids wearing these shirts. Happens every election. Thanks for helping to clothe the poor in Africa and South America.","commenter_a":"Please take the time to read my little rant! And the article! Monday morning trash x 2 floors.. Plus 6 bathrooms to wipe up and make presentable, a floor and a half to sweep and mop, vacuum 1 study room, then I can begin in my own bathrooms according to schedule.. Ive mopped my half of 5th and finished up there about to sweep and mop my own whole floor.. All for $7.57 an hour.. Oh and I left our the part about the beer poured all over the floor near and in back of fifth floor trash cans.. Im not usually a complainer and I really feel sorry for the people that have been here longer than me. Pack the students in and don't worry these petty people will clean up whatever the students can throw at them.. I was also promised a raise after 6 months of my ...","post_message":"New Jindal for President shirts are available. Buy one today."},{"comment_id":"10154285934165575","commenter_b":"Bet Hillary can't do that!","commenter_a":"You knew it was coming....THE DANCING DONALD! Lol","post_message":"THIS COULD SPELL DISASTER FOR CROOKED HILLARY...."},{"comment_id":"923764651058995","commenter_b":"I've officially had it, I want Muslims in Muslim countries period not here...","commenter_a":"It was going to happen sooner or later. Might as well start it now.","post_message":"RT Khalilah Sabra: Muslims to Start a Revolution in America"},{"comment_id":"10153224178386336","commenter_b":"You cannot deport american citizens out of america, it makes no sense. lol","commenter_a":"Gather them up and ship them out of the country. Anyone who doesn't respect America should leave. No one is asking them to stay.","post_message":"A new social media \"challenge\" is encouraging people across the country to disrespect and stomp on the American flag."}]
