[{"comment_id":"1171652696248712","commenter_b":"You used the word \"was\" almost every other sentence and, rest assured, you took advantage of her \"used to be\" caring & living and giving up her career for her, like a dog. But doggier....she \"kept\" you. She got you back. By completely NOT ANYTHING like what you thought you married. She's an evil, money-hungry, evil, liar, in a position in government she shouldn't even be a janitor that empties her garbage can, ugly (well, she's always been ugly) and a moral-less female. So I guess it does end up how it should be in the end. She should sit in jail the rest of her life. You two are the epitome if what a marriage should not ever be. And you sound proud! You're both despicable.","commenter_a":"Terri Bock","post_message":"\"I married my best friend. I was still in awe after more than four years of being around [Hillary Clinton] at how smart and strong and loving and caring she was.\" – President Bill Clinton"},{"comment_id":"1513285485378585","commenter_b":"Mmmmmmmhm! I noticed that. Pussy","commenter_a":"How true","post_message":""},{"comment_id":"10153575061332411","commenter_b":"I Won't Vote For Kirk, Either!!!!","commenter_a":"Oh come now, he's a multi-billionaire businessman he knows how to talk nice when he needs to","post_message":"\"Trump has not demonstrated the temperament necessary to assume the greatest office in the world,” Kirk said in a statement."},{"comment_id":"10153971100801600","commenter_b":"If we won when I was a kid my parents would have kept me out. My son deserved to be there... I was more than happy to take him!","commenter_a":"Shouldn't of had school","post_message":"The numbers are in. Should parents have taken kids out of school for the parade?"},{"comment_id":"1799169303666092","commenter_b":"I'm still waiting to hear how sexual relations not involving vaginal Intercourse is not responsible and can't prevent pregnancy if you aren't ready for a child. Allllll ears, lol. Time to find a safe place for you, you can't handle the truth.","commenter_a":"I am 66 years old and I am sick and tired of old white men trying to rule my reproductive life and that of my daughter, and now of my granddaughter. NOT ON MY WATCH.","post_message":"Do you agree with Rachel Maddow? We definitely do."},{"comment_id":"10154335910931130","commenter_b":"Just a joke? Really? So if you ever get assaulted verbally or sexually it's just a joke?","commenter_a":"Oh please. Hillary laughs at getting a guilty rapist off, what does it matter now, and trump was just making a joke. Get real.","post_message":"Talk about RIGGED!"},{"comment_id":"10152676390231519","commenter_b":"I always come across people who like to talk shit while hiding their face. Typical","commenter_a":"Mentioning Faux News isn't a \"liberal\" thing. The ones who mention it are humane, educated, not ignorant and are not racist. That's not \"liberal.\" People that watch Faux News other than for the laughs are both ignorant and racist. Period. They also hate democracy, hate poor people and hate minorities - I.e., they are thuggish punks. Wear your badges proud, you cowardly fascist creeps!","post_message":"This could end Brian Williams' career..."}]
