[{"comment_id":"10154881965660575","commenter_b":"Want to be loved I guess","commenter_a":"Is it just me: or is she looking at you like a Stepford Wife ?","post_message":"Barbara Bush: “We believe that every person has the right to live a healthy, dignified life.”..."},{"comment_id":"1792973144264831","commenter_b":"Come on Virginia We all know that Donald Trump is going to be president so let's rally behind him","commenter_a":"Those who vote for Crooked Hillary, are also crooked with a hidden agenda! TRUMP 2016!","post_message":"Terrific news in Virginia. Thank you for your tremendous support! I have a lot of amazing memories in Virginia - and I look forward to campaigning with you in the general!"},{"comment_id":"1370953329605967","commenter_b":"She can start any day....","commenter_a":"@username maybe Jerry will do this to Eddie someday soon. 😐","post_message":"The only thing that can calm this grumpy toddler is her love for her baby sister: @webpagelink"},{"comment_id":"10153914215895950","commenter_b":"Go fuck your cousin you wrong turn hillbilly bitch","commenter_a":"11 kids 10 women(I can only imagine what they look like...) there'll be no problem finding pallbearers for this one...Goodbye & Good Luck...","post_message":"Police say Walker, a.k.a. Shawty Lo, may have been the victim of a hit and run."},{"comment_id":"523357894521457","commenter_b":"She would be the worst ever.","commenter_a":"The people that will vote for Hillary, see nothing wrong with all his sex scandles.......... it dosen't faze them !","post_message":"Bill Clinton's promiscuous behavior could ruin Hillary's chances. Excellent. Help us spread this and make sure she never get's into office. Do you agree that Hillary would be a terrible president?"},{"comment_id":"10153936646970329","commenter_b":"The American government steals from us and treat its American citizens like crap.","commenter_a":"Everyone's shit scared of the Americans cause they lie, are arrogant, have big weapons, invade any country and are religion obsessed. Same as Islam extremists. The thing they say they hate.","post_message":"Including some disturbing news for America..."},{"comment_id":"883164491718973","commenter_b":"She is evil & a liar!!!","commenter_a":"She's a bigger liar than her husband and he lied to the Supreme Court and got away with it","post_message":"We must STOP HILLARY!"}]
