[{"comment_id":"1538803016422900","commenter_b":"EVIL WOMAN!","commenter_a":"WHAT IS THAT, AN ALBINO MONKEY????????","post_message":"Did Hillary Clinton get her money's worth?"},{"comment_id":"704085629782015","commenter_b":"She is Disgusting. Can't stand to look at this woman","commenter_a":"This whole family is a DISGRACE to this Country!","post_message":"Our first lady just disrespected all the white women in our country. She is a hypocrite and a racist. We miss Laura Bush. Do you agree Michelle Obama is a disgrace of a first lady?"},{"comment_id":"891611624218799","commenter_b":"That attitude is what spoiled immoral girls, who got caught up in this SEXUAL REVOLUTION\" and forgetting that sex is for married people, and it also leads to pregnancy. They figure,,so what,,if I get pregnant,,I'll just kill my own baby,,,no problem,,,BUT I bet when these young women,,grow older, and marry and THEN do have a child,,,they have guilt like they never knew before.","commenter_a":"Close your legs, ya skank.","post_message":"Um, what? Killing a baby doesn't \"end a pregnancy,\" it just makes someone the mother of a dead baby."},{"comment_id":"10152882564604024","commenter_b":"This chick def. has mental issues like Julie stated. You need to know when to just not add fuel to her fire. Who knows what she would've done if this argument escalated.","commenter_a":"I've been taking NYC subway all my life and this is rare and far between. The vast majority of people are actually pretty nice. I hate watching these things because it makes us look really bad to outsiders. There are over 8 million people in this city, of course you're going to get a few bad ones, it's just the odds. Please don't judge us all based on a few..","post_message":"If you witness this fight, would you try to settle it? How?"},{"comment_id":"10154158954704641","commenter_b":"Good luck!!! Wonderful! !","commenter_a":"This is the guy that we need to operate our military","post_message":"He's been attending community college part-time since he was 7."},{"comment_id":"10153301288059411","commenter_b":"Yeh the Danish who's having sex with dogs are Muslims too. Many US states still legalize animal sex until today. Bow down to your ziojew masters and shag some horses","commenter_a":"Jews been making porno videos using American girls and animals ( dogs, horses) for centuries now. Disgusting vermin","post_message":"No more animal brothels"},{"comment_id":"10153080591266748","commenter_b":"He's a fucking queen.","commenter_a":"Better headline: Tom DeLay urges a complete breakdown in the judicial/governmental structure. Because 'murica.","post_message":"Former GOP House majority leader Tom DeLay urges anti-gay conservatives to stand up to the \"ten\" Supreme Court justices."}]
