[{"comment_id":"10152949428967061","commenter_b":"who freaking cares,she need to get her tubes tied !","commenter_a":"none of anyone's business....really don't care....","post_message":"Bristol Palin announces second pregnancy; says she knows it will be \"huge disappointment\" to many: @webpagelink"},{"comment_id":"1309663882411384","commenter_b":"Thank you! Someone with a little logic about the abortion! It should not be tax payer funded and it should NoT be past 12 weeks and it should not be used just because some idiot woman didn't use birth control and doesn't wanna deal with the consequences of her actions !","commenter_a":"I can not believe that abortion is a right to be discussed in 2016. It is a womans right to decide! It is our bodies!! As long as it happens before the 12th week...but women need to use their head and not use this as birthcontrol! Protect yourself if you don't want a kid! As I said, it is 2016 and we do have many types of birthcontrol!","post_message":"Obama's last stand"},{"comment_id":"10152694778793717","commenter_b":"Colebrook....-38","commenter_a":"Berlin -22","post_message":"We're looking for your best guesses for the coldest spot overnight tonight in New Hampshire. Comment below with your guess for the town and temperature, and Kevin Skarupa will reveal who was right Thursday morning!"},{"comment_id":"879699705417529","commenter_b":"NO !!!!!! MORE !!!!!! ENFORCE THE LAWS & SEND THE ILLEGALS ALREADY HERE BACK TO \" WHEREVER \" THEY BELONG !!!!! WE NEITHER WANT THEM HERE ,,,, NOR CAN WE AFFORD TO SUPPORT ALL THEY ARE GIVEN !!!!! HELP THE PEOPLE IN AMERICA ,,,,, NOT THE ILLEGALS !!!!!!","commenter_a":"So if we harbor a criminal we go to jail, but providing \"sanctuary\" is different, right? Pffffft. A rose is still a rose....","post_message":"(VIDEO) HILLARY CLINTON'S TWISTED APPROVAL OF SANCTUARY CITIES FOR ILLEGAL ALIENS Stop the invasion!"},{"comment_id":"492953910886489","commenter_b":"I don't feel sorry for her. She had the right to marry four times. Fuck that bitch hope they fine her into poverty and hope she gets her ass tossed by a big butch inmate","commenter_a":"just give her a different job already","post_message":"Are you angry at the anti-gay clerk? Us too. But we also pity her."},{"comment_id":"736942216449300","commenter_b":"The most logical way to deal with the Real ID Act is to stop rewarding illegal activities. The people that make it possible for illegals to get driver's license are the same people who refuse to correct the laws that allow career criminals to run the streets killing cops and our children.","commenter_a":"How about we stop issuing drivers licenses to people that have broken the law and are here illegally? Blaming the current governor for this is absolute stupidity. Blame Richardson and the democrats in Santa Fe, this is all on them!","post_message":"The most logical way to comply with the REAL ID law is for the Governor to agree to a bipartisan plan for a two-tier driver’s license in New Mexico. Republicans and Democrats in the state Senate crafted a compromise last session that would have resolved this issue. The Governor should agree to that compromise. This will address concerns about public safety, meet the requirements of the REAL ID law, and assure that New Mexicans can continue to access federal facilities and airports. @webpagelink"},{"comment_id":"1390819424294656","commenter_b":"Esta es la barbaridad de el aborto La Nina nacio viva, y la dejaron morir.Dios va a traer juicio , sobre todos los que derraman sangre inocente.","commenter_a":"That's not an abortion,that's disgraceful","post_message":""}]
