[{"comment_id":"10153642078228132","commenter_b":"So sad for them.","commenter_a":"Nathaniel Gaytan","post_message":"EXCLUSIVE: It's the end of the road for Ben Affleck and Jennifer Garner."},{"comment_id":"10153794749431336","commenter_b":"She's been dogging scandal since the 70's shady person and that's probably going to be our next president.. Not because she's the best for the job, because she's a woman","commenter_a":"Clinton, will never be president of the USA, NEVER...","post_message":"George E. Pataki on Hillary Clinton’s server scandal. #GOPDeabte @webpagelink"},{"comment_id":"1701604063395144","commenter_b":"Ze pretty ladies","commenter_a":"@username William Joseph.. You boys come get me !","post_message":"So I'm on my way to Germany to get arrested."},{"comment_id":"1089911127716025","commenter_b":"Another illiterate ass wipe that can't get over having to share her country with people that don't look like her... Try moving to Russia, bitch.","commenter_a":"I just wonder how long she can tread water.","post_message":"The kids were just playing in the water..."},{"comment_id":"1580958245270761","commenter_b":"Charlie Shumate Kind of like how everyone has been brainwashed into becoming a queer, race mixer, feminine male... Man how the times have changed for the worst..","commenter_a":"Rachael Isabella too real though","post_message":"\"We need only go back to Hitler's Germany to see that it can happen to anybody. Anyone can become dissociated to the point where they are not seeing what is happening in front of their eyes.\""},{"comment_id":"10154936291493088","commenter_b":"> I don't know why it's impossible to believe it will happen again. Shane Those that are better informed than you are agreeing on this, big time, using measurements, not belief. You can't use your logic&belief on things that have happened over millions of years with this, that has happened over a range of 50 years. Keep reading up on this because you're getting very close.","commenter_a":"While I won't support any of Donald's nominations, I think climate change has always been around, long long before humans. And much longer still before the industrial era. The earth has been a waste land before, and it's also been a water world. I don't know why it's impossible to believe it will happen again.","post_message":"I will vote NO on the nominations of Scott Pruitt to be EPA Administrator and Rick Perry to be Secretary of Energy. The scientific community is virtually unanimous. Climate change is real, it is caused by human activity and it is already causing devastating problems in this country and around the world. We need an EPA Administrator and a Secretary of Energy who are prepared to stand up to the fossil fuel industry and their short term profits, and lead the fight to transform our energy system away from fossil fuels to energy efficiency and sustainable energies. In discussing these issues with Mr. Pruitt and Mr. Perry I found no evidence to believe that they are prepared to do that."},{"comment_id":"10153055349059170","commenter_b":"Nah he's not Indian. Fake birth certificate. He wants his muslim army to overtake America.","commenter_a":"Bobby has it right. He's a great Patriot. Would make a great president.","post_message":"To those who want to silence talk of God - because they're afraid of how it will affect election outcomes - reconsider your priorities. Looks like Bobby Jindal has this right. (And in no way did he mean what is critic here thinks he meant.)"}]
