[{"comment_id":"985543698152769","commenter_b":"This old lady sounds like she's craving for big nigga dick :)","commenter_a":"See ya bitch... Cracker ass Cracker!","post_message":"Like housemother like house sons."},{"comment_id":"10153685759487439","commenter_b":"Lets ban all Muslims and Idiots like u that have no more brains cause u do to much drugs and u are just as evil as them.","commenter_a":"Ban all Mosques and Muslims from all western civilization.","post_message":"A member of the Iraqi Christian community in Michigan wrote to alert me of a proposed mega-mosque going up in a Chaldean Christian community in Michigan. How frightening it must be to them when their Chaldean brethren in Iraq and Syria are being systematically cleansed from their centuries-old homelands under Muslim rule. The genocide of the Chaldean Christians accompanied by this:"},{"comment_id":"10153480430267483","commenter_b":"I bet the sissy SOB would have never talked to a man that way.","commenter_a":"More businesses need to be like this. Its 2016 for heaven's sake. No one should be treated less than anyone else.","post_message":"\"Due to privacy laws, we are limited in what we can share, but in a situation in which a customer verbally abuses another customer or a Regions associate, we close that customer's account,\" a Regions Bank spokesperson said."},{"comment_id":"1699015597030344","commenter_b":"A no vote IS a vote - for the candidate you least want.","commenter_a":"Adding or not adding the next Scalia to the Court seems like something that will have pretty wide implications for the next couple decades.","post_message":"\"I'm not interested anymore. I don't see any immediate, significant changes happening. I don't see voting as a means to an end.\""},{"comment_id":"10155137822548984","commenter_b":"@username hold your breath you retarded bitch and see witch comes first.","commenter_a":"He has done more in one or two days against ISIS, than Obummer had done in 8 years! On the other hand Obummer has done more to help ISIS and Iran in eight years than all countries combined!","post_message":"General James 'Mad Dog' Mattis just showed everyone why Donald Trump chose him to be secretary of defense. ISIS is in for a rude awakening..."},{"comment_id":"10153124003659312","commenter_b":"Did you forget there also was Barry Bonds and others? And yes, there was McGuire! This is old and it happened over 10 yrs ago! Move On!","commenter_a":"Handcuff needs to be in handcuffs for picking the Patriots cheaters! Lol","post_message":"This morning, Handcuff, one of several dogs rescued recently by local law enforcement, made his St. Louis television debut with Rene Knott, to make his pick of a winner in today's Super Bowl. See who he picked and then call Stray Rescue to inquire about adopting him. (314) 771-6121 @webpagelink"},{"comment_id":"10153166398548812","commenter_b":"If you want current news coverage, go to the news stations. Not Obama","commenter_a":"where is obama,why he is deadly silence now ?","post_message":"\"My best friend was killed and I don’t know why.\" Chapel Hill Shooting: @webpagelink"}]
