[{"comment_id":"1775585642697945","commenter_b":"The dresses are hideous, in my opinion, but leave that baby ALONE! She's beautiful!","commenter_a":"She ain't that cute now but y'all watch she will be a real life ugly duckling story when she gets older","post_message":"Blue Ivy is getting harassed on the internet again."},{"comment_id":"10153227586230047","commenter_b":"He did the right thing","commenter_a":"No","post_message":"While serving overseas, Sergeant Martland intervened to protect a child from sexual abuse. He deserves to be honored for this heroic action, not punished. Sign and Share our petition to fully reinstate Sergeant Martland: @webpagelink"},{"comment_id":"10154767294838812","commenter_b":"she or her family must be here illegal...u guys go back to where u came from and come back the right way..","commenter_a":"Someone please throw a bucket of water on this witch!!!!","post_message":"Hillary Clinton: \"What would Ronald Reagan say about a Republican nominee who attacks America's generals and heaps praise on Russia's president? I think we know the answer.\" @webpagelink"},{"comment_id":"10153658403039726","commenter_b":"OK !! There are 42,000,000 illegals in this country, squatting out \"anchor babies\" like cockroaches---WHAT\"S HIS PLAN.","commenter_a":"Carsons' stand on illegal aliens is almost as bad as obamas. Vote what's best for America---Trump.","post_message":"WATCH: Carson Jokes: I Heard Trump Dropped Out!"},{"comment_id":"10153620225172377","commenter_b":"She is actually a feminazi and against our Second Amendment!","commenter_a":"Why would it be political, she's a republican hack. And is it remotely possible that he could be a sexual harasser.","post_message":"Newsmax CEO Christopher Ruddy says former Fox News host Gretchen Carlson lawsuit alleging Roger Ailes, the influential network chairman, sexually harassed her, simply doesn’t seem right. Ruddy writes: \"Interesting all of this is percolating in the middle of the most important election in modern times. I am not saying the allegations have a political angle. But the timing seems suspicious.\""},{"comment_id":"470654633125117","commenter_b":"She wants he balls back","commenter_a":"Yes. One way ticket to kenya","post_message":"Michelle is turning 51, and you'll never believe what gift she wants. We have a good idea, how about a trip back to Kenya for her whole family? Anyone agree?"},{"comment_id":"10154691859089778","commenter_b":"Smart enough to know that it's people like Trump that make the world go round. It takes the 1% to contribute the 99% of us that couldn't keep the economy a float without there financial support or contributions to the economy. What is ruining our economy is supporters like yourselves who probably believe in giving the minorities a place to stand in the bread line while they send there un-taxed & undocumented earnings home to there families living like royalty on the backs of the mighty American dollar. While the rest of registered documented citizens pay our taxes to make America great. I am all for immigrants who are here legally and lawfully it's you stupid idiots who support the system in the blind to allow otherwise.","commenter_a":"Racist people are coming out the woodworks. They are attacking Donald Trumps campaigned because they are to stupid to understand the truths of our Society. To stupid to understand simple economics, taxes and laws. They result to violence and idiotic actions. Because they are to stupid to see what's right and wrong!","post_message":"Protests erupted during a Donald Trump rally in Chicago, forcing him to cancel the rally. @webpagelink"}]
