[{"comment_id":"1267200936634248","commenter_b":"Childhood whooping cough measles mumps etc","commenter_a":"There is no mention of what vaccinations it is about, only that it will be forced. I don't really see this article as useful to anyone lol","post_message":"No jabs, no benefits."},{"comment_id":"10154346047721336","commenter_b":"The also gave us mass production cigarettes, fast food, obesity, lung cancer and heart disease. Yeah!!!","commenter_a":"Think about the differences in the 18 year old people now-a-days compared to then. Can you see your 16 year old neighbor going to the recruitment office to try to lie about his age to enlist? They're called \"The Greatest Generation\" for a reason. We'd have everyone trying to sue the government for various reasons rather than fighting. It is a different world we live in, with different core values in the newer generations. Even the older generations are wasting their time debating bathroom rights... THESE kids knew what was important, and were willing to give all for their beliefs. I can't salute them enough, or honor them enough, or thank them enough. And having served overseas for the majority of my time in the service, and living in Germany, I was fortunate enough to see just what the older generation of Germans felt for these people who did so ...","post_message":"We remember, and give thanks. #DDay"},{"comment_id":"10154100012033598","commenter_b":"G","commenter_a":"Disgusting, the price of an innocent life","post_message":"Ex-Planned Parenthood Director: They Told Me Every Baby Killed in Abortion Made Them $313.29"},{"comment_id":"10153231020785933","commenter_b":"@username you are so wrong girl !","commenter_a":"#Kasich 4Us#...Kasich is a good man and a honest man who is humble enough to recognize God in his life and the need for him in the country once again,hes a man with all of the experience who learned from one of our best presidents Ronald Reagan...and he KNOWS how to lead this country in the direction that it needs to go to become great and LEAD the world as we once did...lets do something right in this country for once and VOTE KASICH!!","post_message":"It's our time to unite the country. New Hampshire, it's your time to vote for a leader who can do it. #Kasich4Us #fitn"},{"comment_id":"10154100932456968","commenter_b":"Has Steve Bannon taken over the POTUS Twitter account?","commenter_a":"Suggest that Trump and co. start keeping their mouths shut and start listening to America.","post_message":"He also threatened federal funds to UC Berkeley."},{"comment_id":"10156996522130354","commenter_b":"I will not vote for Ryan ... he is a socialist....","commenter_a":"Yep!","post_message":"TED CRUZ: PEOPLE WILL ‘REVOLT’ IF NOMINEE NOT ME OR TRUMP..."},{"comment_id":"1724892717782853","commenter_b":"We are in America! Speak English woman! Lol","commenter_a":"@username they read my post!","post_message":"\"Hail Hydra\" are two words no one ever expected Captain America to say."}]
