[{"comment_id":"10153368981378812","commenter_b":"As past wars have told us, you can ONLY stop violence with violence, these people need to be shot down","commenter_a":"You can't stop violence with violence.","post_message":"BREAKING UPDATE: Baltimore Police: At least 7 officers injured in clashes -- 1 is \"unresponsive,\" some have broken bones; mob has surrounded and destroyed a police cruiser -- LATEST: @webpagelink LIVE: @webpagelink"},{"comment_id":"10157700515445294","commenter_b":"Educate yourself. So we rather have criminals holding people up at gun point running the street? Robbing innocent hard working people?. We feel bad for the criminals? However, I don't. Much peace and love.","commenter_a":"Well he won't do that again. Glad he won't be terrorizing hard workers anymore. I don't care if he had a drug problem look at all the people he held at gun point the past 3 weeks. Should feel sorry for those who had to be terrified of their life.","post_message":"Police say the robber was suspected of holding up other Cleveland-area CVS stores for opioids."},{"comment_id":"1385974011422625","commenter_b":"Yet Hillary and bill take in millions in her fraudulent Clinton foundation. They take millions from foreign governments and in return she grants them government cobtracts","commenter_a":"Of course not.","post_message":"Donald J. Trump likely won't reveal how much money he makes, or how much he pays in taxes until after the election."},{"comment_id":"1098350870176382","commenter_b":"All ILLEGAL immigrants are criminals. Come here legally and I will welcome you with open arms and warm smile.","commenter_a":"anyone with common sense knows that all immigrants aren't criminals, just like all whites aren't bigots, all blacks aren't ignorant, and all hispanics aren't lazy.","post_message":"ICE program focused on ‘national security’ detains immigrants with zero criminal convictions."},{"comment_id":"10156605912540389","commenter_b":"They offered it to me!!! What a crock!! We can't have another Clinton in the WH......","commenter_a":"For someone so smart what a waste of a brain. Just greed Is what motivates her.","post_message":"Even the left is calling this one of her worst moments."},{"comment_id":"1357303384289688","commenter_b":"Well how black do you have to be to be considered black... Since you have a PHD in biology","commenter_a":"\"If celebrating my roots and culture during Black History Month made anyone uncomfortable, those feelings were there long before a video and long before me,\" - Beyonce I totally agree!","post_message":"\"I'm an artist and I think the most powerful art is usually misunderstood.\""},{"comment_id":"10153422547304138","commenter_b":"I watched it go down from the top of the parking ramp it was a woman cop that chased him down #Girlpower","commenter_a":"Haha scary I live on that intersection thank god I'm moving","post_message":"Not every day an inmate escapes in your neighborhood."}]
