[{"comment_id":"10152831288276636","commenter_b":"Terrible woman screaming like that I'm glad she was sacked","commenter_a":"If it doesn't affect your pay don't let it affect your day let star bucks hire security you getting pay regardless you sell coffee and straw LESSON \"I WILL NEVER BE JOBS WORTH AGAIN\"","post_message":"\"Give me the straw, give me the straw, give me the straw, give me the straw... call the cops.\""},{"comment_id":"595073377334106","commenter_b":"In GOD WE TRUST","commenter_a":"Where do we get it","post_message":"July 30th marks the 60th Anniversary of “In God We Trust” being written into law as America’s national motto. Our Motto has been referenced by our Presidents, written on our money, and is in our National Anthem. Although some would like to erase God from the public square, we see this as an opportunity to proudly proclaim that “In God We Trust” is still the bedrock upon which our nation is built. On July 30th, let’s sweep the nation with our National Motto! Hundreds of Thousands of people have already join the One Million Window Campaign Get your sticker today and be a part of the Movement!"},{"comment_id":"614898638719277","commenter_b":"She's to stupid to no anything","commenter_a":"Reason for term limits are these two examples of our Representatives being out of touch with reality.","post_message":"So thoroughly unhinged it is impressive."},{"comment_id":"431677547020539","commenter_b":"Filthy muslims ,deport or tag &bag'em .","commenter_a":"That is disgusting.","post_message":"This is disgusting — would YOU want to use a sink someone had washed their feet in?"},{"comment_id":"10153655047616130","commenter_b":"When someone makes those comments, they will learn what my bitch face REALLY looks like!","commenter_a":"Everyone: Are you okay? Everyone: You look tired. Everyone: You look upset. Everyone: You look confused. Everyone: Are you mad at me? Everyone: Why are you mad at me? Me: IT'S JUST MY FACE!!!!! This has been an accurate description on what it's like to live with Resting Bitch Face.","post_message":"Scientists say resting bitch face is real."},{"comment_id":"10152826258466051","commenter_b":"I hope the bitch gets life","commenter_a":"Got what you deserve","post_message":"First she stole this cancer-stricken man’s dog. Then she had him euthanized."},{"comment_id":"1466659373354088","commenter_b":"@username <<<america needs more folks that think like this guy... dude you such teach classes to these bigot trump supporters","commenter_a":"Protestors are chanting \"Black Lives Matter\" as they set fires, fire weapons and attack police with bricks but BLM leadership will say they don't represent \"the movement\". Yes, this IS your movement. No one respects you. You defend criminals, make martyrs of cop killers and have the gall to act like these violent protests don't speak for you?","post_message":"A large crowd turned out after Milwaukee police shot and killed what they said was an armed suspect earlier in the day."}]
