[{"comment_id":"10153998219462169","commenter_b":"Please email this to every teacher, parent, and administrator in the nation.","commenter_a":"This is garbage! We have nothing left to encourage positive behaviors or discipline!","post_message":"Column: Hey teachers, please stop using behavior charts. Here’s why (From PBS NewsHour)"},{"comment_id":"714166885416447","commenter_b":"Most evil woman on the planet","commenter_a":"Only Crooked Hillary -she has to be the worst possessed women in the world of power and money -remember when they left the White House they were broke -now worth 250 Million-go figure","post_message":"A troubling taste of how the Clinton machine operates..."},{"comment_id":"962133447168441","commenter_b":"Ok first of all don't try to tell me there was no raiping in euroup until the emigrants got there it's just the fact that a raipest is a raipest no matter where he is so you shouldn't go around saying imegrants are raipests hide your wives and kids I mean grow up dude","commenter_a":"Imagine if an immigrant did the same thing in Europe. I guess the title (and the comments) would be totally different!!","post_message":"A tourist has captured spectacular views from the top of a pyramid he illegally scaled in Egypt. (Video credit: Caters TV.)"},{"comment_id":"492953910886489","commenter_b":"I don't feel sorry for her. She had the right to marry four times. Fuck that bitch hope they fine her into poverty and hope she gets her ass tossed by a big butch inmate","commenter_a":"just give her a different job already","post_message":"Are you angry at the anti-gay clerk? Us too. But we also pity her."},{"comment_id":"10153660734489726","commenter_b":"what a mess she is!","commenter_a":"You mean murder!!!","post_message":"WATCH: Goldberg: Planned Parenthood Founded for Abortions"},{"comment_id":"10153987793981320","commenter_b":"She is such a bimbo","commenter_a":"They have to be kidding! She is a joke! Tina Fey would do a better job!","post_message":"Sarah Palin has officially endorsed Donald Trump for President, but does it matter? Thoughts?"},{"comment_id":"10154432726796320","commenter_b":"Another white woman mad","commenter_a":"Oh let's not forget how a caucasian family looked away from there child in Disney and the alligator got him(🙏🏾) did they drag his parents threw the news talking about their backgrounds? Nooooooo but a African American child falls in a gorilla pit and they put his fathers picture up and he wasn't even around!!!!","post_message":"In a dramatic image, a protester is grabbed by police officers in riot gear after she refused to leave the road in front of the the Baton Rouge Police Department Headquarters on Saturday. She has been identified by multiple media outlets as Ieshia Evans, 35, a nurse and mother of a 5-year-old boy. (AP Photo/Max Becherer)"}]
