[{"comment_id":"10154282373471636","commenter_b":"@username the uk intends on putting it's own citizens first. .to achieve this we intend to control the flow of immigration here ( not close them) the problem with the EU free movement is that the poorer member citizens prefer to go and live in the more welthiest members causing a flood in the labour market. .all other countries outside the uk have this policy","commenter_a":"They realise they can't risk all the british emigrants in the EU, the majority of them being pensioners, returning to the uk and putting a financial and physical strain on things like the health service.","post_message":"Excellent"},{"comment_id":"1499576316724205","commenter_b":"Leave now. You are discase","commenter_a":"CANT WAIT","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"1068067499964996","commenter_b":"That's why it's called a Meltdown. Theoretically it is not supposed to stop until it reaches the center of the Earth. This may be a bit far fetched, though. Alien blood ain't got nothin' on a meltdown.","commenter_a":"Lennie","post_message":"Operators of the Fukushima nuclear power plant have identified a gaping hole in a reactor containment vessel, which has resulted in a drastic spike in radiation levels."},{"comment_id":"834927826574487","commenter_b":"She's a waste of air & space.","commenter_a":"Someone said \"Free stuff\"?","post_message":"You know Queen of the 'Aisle Hogs' Sheila Jackson Lee @JacksonLeeTX18 will be there 10 hours early for her SOTU seat"},{"comment_id":"10153470128239497","commenter_b":"Get outta here!","commenter_a":"Strange new cult forming under my guidance 😈","post_message":"\"Somehow, the account management team has forged a society all its own.\""},{"comment_id":"10154799380074486","commenter_b":"Suck it up, cupcake.","commenter_a":"The Feminist Movement emasculated men and created this generation of Pajama Boys.","post_message":"Spot on."},{"comment_id":"1008364749198946","commenter_b":"But the only way to stop a bad baby with a gun is with a good baby with a gun!","commenter_a":"My Hero","post_message":"BOOM!"}]
