[{"comment_id":"982212811884970","commenter_b":"This is so outrageous! Homeless Americans, hungry children,and people out of work and these people live like royalty. They need to be gone.","commenter_a":"shameful","post_message":"This was the Obamas eighth Hawaiian family vacation. The trip has become an annual event for the Obamas. To date, Obama and his family travel expenses total at least $85,029,819."},{"comment_id":"974467552593717","commenter_b":"Fuck this cunt","commenter_a":"Love you Barbara...","post_message":"Senator Barbara Boxer, in 20 minutes, gave the BEST smackdown to the GOP I have ever seen -- calls them a \"national disgrace,\" and tells them to end their \"hostage\" taking of the DHS because of their \"hatred for the president.\""},{"comment_id":"10154100012033598","commenter_b":"G","commenter_a":"Disgusting, the price of an innocent life","post_message":"Ex-Planned Parenthood Director: They Told Me Every Baby Killed in Abortion Made Them $313.29"},{"comment_id":"10153479746226438","commenter_b":"Nazi feminists, fuck off!","commenter_a":"Why are you showing a picture of this psychotic liar mattress girl who ruined a boys life with a false rape charge? There is no rape culture on college campuses. Rape has declined dramatically over the past decade. There are a lot of false charges of rape by scumbag feminist women though.","post_message":"Unfortunately, the oft-criticized statistic is true."},{"comment_id":"10152978726794342","commenter_b":"Yep that's some more B.S. All of the jobs that illegals are here taking were done by American citizens before you came. Your comment is without any truth whatsoever!!!","commenter_a":"All this jobs yall dnt do the hispanic race does !","post_message":""},{"comment_id":"10153631849906770","commenter_b":"I can't stand her","commenter_a":"That is why lying Hillary and Obama likes her. They are all LIARS!!!!","post_message":"Rep. Trey Gowdy blasted Attorney General Loretta Lynch on Wednesday, arguing her testimony before Congress was \"a total waste of time and a total disservice to my fellow citizens."},{"comment_id":"412948288893465","commenter_b":"An ugly skank. . . . living off tax payer money!!!","commenter_a":"POS !","post_message":"They just exposed the disgusting hotel bill Michelle Obama ran up in Cambodia... this is inexcusable. Hardworking Americans deserve better than her."}]
