[{"comment_id":"10154000125138132","commenter_b":"That woman is a nut!!!","commenter_a":"Hope he doesn't take them on a nice \"trip\" to Monaco like Kelly Rutherford's ex did.","post_message":"Gavin Rossdale has a special Christmas trip planned for his kids!"},{"comment_id":"775973422593235","commenter_b":"Absolutely, she should be in prison anyway not headed to highest position in America","commenter_a":"Elated!","post_message":"BUSTED: Hillary Clinton Was Just Caught Read Handed For Being Linked To... This actually might stop her from running. Would you be happy if she had to back out of the race?"},{"comment_id":"10153933838211756","commenter_b":"Feminazis will not be happy either way","commenter_a":"I don't think Super Girl is all that great. You have to have special, super powers to be a strong, useful woman? Not a good role model in my opinion.","post_message":"One bright spot: Strong female-centric shows like \"Supergirl,\" \"Quantico\" and \"Blindspot\" are doing well."},{"comment_id":"1227002650653096","commenter_b":"The LATIN EMPIRE AWAKENS! They realize that Republicans will get them into American class warfare!","commenter_a":"Latino Republicans? Does such an animal exist?","post_message":"Latino Republicans are mounting a pushback against the more conservative wing of their party."},{"comment_id":"10153184013859255","commenter_b":"ThankYou","commenter_a":"Who was it that said \"You have to have some intelligence to realize how stupid you are\"? No intelligence on display with those who still believe in the KKK. Haters and bigots.","post_message":"Another day in post-racial America."},{"comment_id":"507285912795322","commenter_b":"God will show his hand and these creatures will be taken away to their doom.","commenter_a":"Take off the masks ladies!","post_message":"ISIS just made a huge move against America. This is unacceptable. Spread this post, we need to fight back. Do you agree ISIS should be wiped off the Earth?"},{"comment_id":"10154096879120329","commenter_b":"Girl buy a shirt that will fit","commenter_a":"Jenny","post_message":"Anyone who says they made it into adulthood unscathed is either lucky AF or a liar."}]
