[{"comment_id":"1628196954146655","commenter_b":"It is in the constitution !!!!","commenter_a":"Yes","post_message":"POLL: Do you support the 2nd Amendment? Comment YES or NO."},{"comment_id":"10153225477750736","commenter_b":"The show pits women against each other and promotes dangerous stereotypes and archaic gender roles. It isn't entertainment and this isn't news.","commenter_a":"Leann Allisgood","post_message":"ICYMI: Lauren Bushnell, the flight attendant from West Linn, got another rose during 'The Bachelor' in The Bahamas, but not until she swam with unruly pigs first:"},{"comment_id":"10155143983283010","commenter_b":"GIRL WHY YOU MUFASA","commenter_a":"Ben Rotherham GAMBI AS SIMBA THIS IS NOT A DRILL","post_message":"James Earl Jones is reprising the role of Mufasa, and Donald Glover is taking on Simba."},{"comment_id":"612078075583452","commenter_b":"She did it before. Why not now ?","commenter_a":"She is reg","post_message":"If you listen closely to yesterday's debate, you can hear a very clear whisper. It was easily picked up by the microphone - but some people still missed it. Here - listen closely."},{"comment_id":"1781827275423105","commenter_b":"Go Hillary! You're a rock star!","commenter_a":"Boom!! Mic drop!!","post_message":"EXACTLY! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1905981339634270","commenter_b":"O, yea...nothing to do with what a shit candidate Hillary was or the DNC rigging the primary...it's all stupid, racist, immigrant hating, uneducated fools...still don't get it do you. Bullying people you don't agree with by \"being offended\" and calling names lost y'all the election. Try a conversation without inviting your hate first, and stop listening to the alphabet news hate and fear mongers.","commenter_a":"Laura Dittmann watch this. I tell you wutttttt lol","post_message":"Donald Trump's own voters fell for a giant lie. -- Trae Crowder"},{"comment_id":"10153750514111336","commenter_b":"Why isn't the media reporting on the violent acts being perpetrated by these muslim 'refugees' in Europe? Shouldn't Americans know the type of filth Obastard wants to bring to the US?","commenter_a":"The religion of peace strikes again.","post_message":"“I was taken by three men,” the murdered Syrian woman reportedly said. “Ever since that time my family has regarded me as unclean... They say that I deserve to die.”"}]
