[{"comment_id":"10153243017991336","commenter_b":"Thjey Used to Hang/Lynch MF Niggerrs like that before !!!!!! Where is the Klan !!!!!","commenter_a":"and Black people want respect....frigen Animals","post_message":"UPDATE: A third suspect has now been arrested after the shooting prompted a statewide manhunt. The suspects accused of killing two Mississippi police officers in the line of duty were reportedly arrested early this morning."},{"comment_id":"750686755029933","commenter_b":"She's a racist","commenter_a":"I guess this only applies to black women since she declared \"Black girls rock\" instead of ALL GIRLS ROCK","post_message":"The \"Barack Obama\" move didn't go over so well."},{"comment_id":"10155410892145500","commenter_b":"Arthur, your mother should have swallowed you.","commenter_a":"Once again. ..guns being used against the family...even if its unintentional. ...there are way too many unnecessary guns out there. ...","post_message":"BREAKING TONIGHT: A 9-year-old boy has accidentally shot his 54-year-old grandfather in the woods in Dade City. Story: bit.ly/1GIYKqL"},{"comment_id":"10155546384855192","commenter_b":"Don't worry God would not choose an unworthy Woman to Have His Child. People no matter how much they serve Christ can still go through very hard times. He didn't say because you love Him, and serve Him that life would be easy.","commenter_a":"First of all to those that say praying won't help them.....You better understand that they don't worship God, or believe Jesus Christ died for their sins. Maybe that is why their world was shaken. God isn't playing. These are the end times. They need to stop the things they do, and accept Jesus Christ in their hearts.","post_message":"The death toll from Nepal's earthquake soared past 3,700 Monday and rescue workers are still struggling to reach two days after the disaster."},{"comment_id":"1017645858352192","commenter_b":"This she bitch should be locked up.","commenter_a":"Every one knows what to expect from you. Nothing good.","post_message":"ClashDaily.com"},{"comment_id":"867123823334246","commenter_b":"A woman has the right to decide who and what uses her body just like every other person.","commenter_a":"my rights stop where yours begine and vice versua","post_message":"Unborn babies deserve protection!"},{"comment_id":"935532149828645","commenter_b":"No refugees immigtants.We're your great great.oh Grandparents Irish immigrant ?","commenter_a":"NO REFUGEES, NONE ! We Americans do not need more problems in our country. Stop them, am I CLEAR ?","post_message":"Our nation has always been welcoming, but we can’t let terrorists take advantage of our compassion. We should not bring Syrian refugees into this country unless we can be 100 percent confident that they are not here to do us harm."}]
