[{"comment_id":"10153206684663855","commenter_b":"F LA! No bears or real men only these fake ass roided out bitches","commenter_a":"Where did they get the inspiration for those haircuts ... :-)","post_message":"Love these pics!"},{"comment_id":"1159811677403083","commenter_b":"The white chic yells her ancestors owned their ass, and then yells black people don't belong in America. Huh. So when. Her ancestors bought the black people and SHIPPED them to America, the black people should go back to Africa? REALLY??! WOW. Unreal...smh... KKK at its finest!","commenter_a":"more a condemnation of them and their ancestors than the person they directed this filth at","post_message":"This is just wrong."},{"comment_id":"10153861308944087","commenter_b":"@username and u so fucking stupid","commenter_a":"The sad part is people in this country seriously think she is worth voting for...","post_message":"#BREAKING: A federal judge blocked Judicial Watch’s effort to begin interviewing State Department officials under oath and collecting evidence as part of a lawsuit over Hillary Clinton’s private emails."},{"comment_id":"10154293209899153","commenter_b":"What do you mean what is happening...It's been going on for thousands of years....There are POS's everywhere","commenter_a":"What is happening too many men are raping these young children, ladies be careful who you have in your home , keep your eyes on your children at all times never leave them with anyone these days it could be your closest to molest these kids...","post_message":"Joseph Genitempo is accused of sexually assaulting an 11-year-old girl. Anyone who may know where he is located is asked to call the Delaware State Police."},{"comment_id":"10154202595341178","commenter_b":"MIKA needs to SHUT UP! Just vote in HILLARY Mika. that is who your candidate is isn't it?","commenter_a":"Anything for ratings!!!","post_message":"MSNBC host has MAJOR tantrum on live TV! #TTT16"},{"comment_id":"10153493676581770","commenter_b":"Them bitches will kill you quick as their men.its their belief.","commenter_a":"It's about time!","post_message":"A collection of brave individuals acting on behalf of a little-known non-profit is running daring operations to free Islamic State sex slaves, including literally cutting the chains binding a woman to a bed."},{"comment_id":"1349045918521792","commenter_b":"You have a lot of names there Laurren.. The typical liberal feminist skank.. Way to go","commenter_a":"Just a suggestion for you @username people. If you dislike Trump and hate that he won a fair election then I suggest you retreat into your safe space for the next 4 years (at least). Shouldn't cause you too many problems as you probably don't have jobs anyway.","post_message":"This website is going viral, and Trump is not happy. You know what to do!"}]
