[{"comment_id":"10154752862228941","commenter_b":"No Weapon formed against us shall prosper...witches have absolutely no power over men of God","commenter_a":"These people are not REAL witches. They do not know what they are doing and only will cause harm to themselves. Real witches look to help and heal. What they put out comes back three fold. These people are just plain evil and should not be considered as witches.","post_message":"The forms of protests against President Donald J. Trump are just getting weirder and weirder..."},{"comment_id":"1309394412429310","commenter_b":"Cameron, it is obvious that you are not a Student of Roman Empire History. One of the last accepted practices, prior to the down fall was homosexuality and everything associated with it. The Citizens of Rome lost direction, they became more interested in Entertainment and the Entertainers that the health of the Nation. Want to know more, it is available","commenter_a":"Roman civilization didn't have God they worshiped abunch of gods and mainly themselves and there the longest most prosperous civilization in history","post_message":""},{"comment_id":"866645046728578","commenter_b":"an amazing climb","commenter_a":"Liam Boggans","post_message":"Gnarly pictures reveal the toll taken on El Capitan conquerors' hands"},{"comment_id":"1128870593839354","commenter_b":"They not are migrants ffs, They are invaders. When will our government's wake the duck up!!!","commenter_a":"These people are deranged.... Catch them and give them an immediate death sentence............Shut all the boarders..... Keep filth out to protect our own...","post_message":"Migrant rape fears spread across Europe"},{"comment_id":"1152094041550315","commenter_b":"This is Trump he's racist or rapists he brings crime and does drugs is insane and sometimes maybe nice but lies all the time! He only hooks up with foreign women probably keeps them in the basement until needed no American woman would ever marry him no matter how much money he has!","commenter_a":"Make America great again by getting rid of Trump! Check out the smile on that white boys face makes me sick and I'm white! Trump is nothing but a trouble maker and an embarrassment for America! Do any of his supporters listen to him I mean really listen and heed what he says and does?? I doubt it must be mental illness","post_message":"The laughter of the Trump supporters will haunt you."},{"comment_id":"1323967450977057","commenter_b":"Golden showers for a golden girl!!!! LOL!","commenter_a":"He's gonna cry.........all the way to the Whitehouse!!!! LOL!","post_message":"Trump has never looked so pathetic."},{"comment_id":"10156478047465231","commenter_b":"Her lips are gorgeous","commenter_a":"Somebody is jealous of this beautiful lips!!! :* :* :*","post_message":"Some people just don't know how to cope when they see beautiful melanin and full lips."}]
