[{"comment_id":"472497066265507","commenter_b":"I believe she had a choice before the seed got mixed. so don't start the problem in the middle start at the beginning...","commenter_a":"AMEN","post_message":"Every woman is entitled to control over her own body."},{"comment_id":"10153328261067093","commenter_b":"****Illegal immigrants.","commenter_a":"It's funny y'all keep talking about Democrats. I guess y'all are the same incompetent people that voted for Bush twice. Donald Trump has his head up his anus. He doesn't know the first thing about running a country. Let me guess he had y'all at Wall? He would build one to stop immigrants. All immigrants aren't bad they just want a better life. LeRhonda Flowers","post_message":"A resident of a tiny island in Canada is rolling out the welcome mat if Americans want to flee after Election Day.... @webpagelink"},{"comment_id":"1118654024897515","commenter_b":"Chemo is poison!","commenter_a":"Nicole, how insensitive can you get? Chemo? with all of the cancer survivors and sufferers fighting their disease with GOOD lifesaving chemo? Hope you never need CHEMO. Trump is not CHEMO. He IS POISON.","post_message":"“The Trump supporters see Trump as political chemo. He may be toxic. He may kill every healthy cell in the bloodstream. But he is the only cure for the cancer that is Washington establishment.” - Nicolle Wallace"},{"comment_id":"10153080591266748","commenter_b":"He's a fucking queen.","commenter_a":"Better headline: Tom DeLay urges a complete breakdown in the judicial/governmental structure. Because 'murica.","post_message":"Former GOP House majority leader Tom DeLay urges anti-gay conservatives to stand up to the \"ten\" Supreme Court justices."},{"comment_id":"1632303213733906","commenter_b":"This dumb chick is over reacting","commenter_a":"Yeah! No thanks your husband has already broken America","post_message":"One first lady has already lost to Donald Trump... could Michelle win in 2020?? @webpagelink"},{"comment_id":"10153086762191438","commenter_b":"Besides there no such thing as a attractive Democrat woman!","commenter_a":"Boils down to primal fear in Liberals, Hillary is toast and Warren is way to Marxist except for the hard Left....and Liberalism doesn't sale to Americans....Cruz has a great message and the Left knows it...see the exact same responses on other Leftists sites...you can smell the wet panties and fear....","post_message":"Ted Cruz has no chance of becoming president."},{"comment_id":"1792810264314039","commenter_b":"Encoded in every religion is the belief of the family unit,man and women create children and society moves on. The radical notion that homosexuals can reproduce and create this dynamic is laughable and should not be lauded as some great thing for society. Man and women really do have different roles in society and its quite apparent no matter how society wants to change it. Secondly, racism is flat out wrong but we are doing a damn good job for a country so young with diverse groups of people.Religious freedom made this country and most of its core tenets come from the Christian bible and not the quran or any other text. Churches should be taxed if they become political and held to task on their beliefs in the marketplace. The past 8yrs tried to change America but Americans bit back and won.I am not talking political just basic morality ...","commenter_a":"Let's get rid of tax free status for churches.","post_message":"What a great idea. Let's end the separation of church and state. Let's convert religious organizations into political organizations. Let's funnel dark money funds raised by religious organizations into political campaigns. Let's sanction racism, sexism, homophobia and other forms of discrimination under the guise of \"religious freedom.\" This absurd and unconstitutional idea must not be passed by Congress."}]
