[{"comment_id":"1011118955590810","commenter_b":"This woman has to go, she is crazy :(","commenter_a":"Yes, it's about the continued spread of the lefts fourth Reich! Whose ultimate leader, Satan, must be proud! Hillary, Bernie, Obama and his flunkies all cut from the same deprived mindset!","post_message":"PAY ATTENTION “This action is about a great deal more than just bathrooms,” Loretta Lynch declared."},{"comment_id":"1754805464735210","commenter_b":"You are a dumb whore","commenter_a":"I don't know if she's the MOST qualified (Al Gore), but she's way more qualified than the joke running on the Republican side.","post_message":"Obama: Hillary Clinton is the most qualified presidential candidate in history Just weeks after pledging his support for Hillary Clinton President Barack Obama has said the former Secretary of State is the best possible candidate ever for the White House. Do you agree?"},{"comment_id":"10154092020795950","commenter_b":"Understood but will be a taxpayer nightmare of added security details. I am sure there are comparable private schools in DC.","commenter_a":"Can you imagine if any other President did this? In addition to taking his grown CIVILIAN kids to meetings with foreign leaders. And people are actually defending this...lol","post_message":"America could soon have a long distance FLOTUS."},{"comment_id":"10156931883630294","commenter_b":"Next he goin dangle his white hoe","commenter_a":"I pray for that poor pup, hope they freaking charge this POS to the fullest extent allowed by law, poor thing!!","post_message":"The suspect turned himself in after feeling the pressure on social media."},{"comment_id":"975170995873379","commenter_b":"Boo you whore","commenter_a":"She's still a total train wreck? What change?","post_message":"This medicine changes the life of anyone that uses it."},{"comment_id":"1195052803848081","commenter_b":"No more illegals. Go trump","commenter_a":"Trump rocks . Save Americans from drug cartels. Sanctuary citys and organizations promoting murder","post_message":"New polls show Trump is appealing most heavily to a certain kind of Republican voter."},{"comment_id":"10153512316881130","commenter_b":"Classy old gal she is....lmao","commenter_a":"I don't know about that if your kid is old enough to eat real food with a spoon its time to take them off the tit.","post_message":"\"There's no difference in me feeding my baby with my breast than you feeding yourself with a spoon.\""}]
