[{"comment_id":"10153509581416350","commenter_b":"DO NOT BUY ANYMORE OF HER CDS! DO NOT DOWNLOAD ANYMORE OF HER MUSIC! BOYCOTT HER LITTLE SMART ASS AND DISRESPECTFUL PUNK ASS THAT SHE IS!!!!","commenter_a":"America is HATING YOU....grab some brains!!!!","post_message":"Ariana Grande took to Twitter to explain the controversial video."},{"comment_id":"979742035426993","commenter_b":"Send this JEW to ISREAL , they don't Belong in the USA !!","commenter_a":"What an idiot and people are ACT voting for him","post_message":"COMMUNIST LUNATIC Bernie Sanders Just Called For Total Gun Confiscation! @webpagelink"},{"comment_id":"10156273080720389","commenter_b":"She's a gutless wonder!","commenter_a":"good for you rudy.now call out the queen of liars abad tell her this country does not need a corrupt murdereer of ameicans in bengazi...","post_message":"In Case You Missed It: Rudy can be a little blunt sometimes."},{"comment_id":"555638054626774","commenter_b":"monkey bitch","commenter_a":"Seriously? Get a life! This is none of your concern....","post_message":"After this Obama staffer quit, he leaked something disturbing secret about Michelle. This is a joke. She needs to be kicked out of the White House. Do you agree Michelle Obama is a disgrace?"},{"comment_id":"10152955255282452","commenter_b":"@username, abortion is legal even in the third trimester.","commenter_a":"How about we teach students and other young girls about birth control (not making it a religious issue) and make it more available to the public so we wouldn't have so many abortions in the first place. I don't like abortion, who the hell does anyways? But we shouldn't ban it. Let's push our efforts into making it as rare as possible instead.","post_message":"Anti-abortion activists on Tuesday released an undercover video showing a senior Planned Parenthood official discussing the disposition of parts from aborted fetuses. @webpagelink"},{"comment_id":"10155246322201509","commenter_b":"Hillary will only do what pads her pockets and feathers her own nest...","commenter_a":"Trump Newest Hat Says \"The Low Educated Loves Me\" #TrumpIsAnIdiot!","post_message":"Nope, the newest Donald J. Trump hat isn't a parody."},{"comment_id":"10152933128350671","commenter_b":"That's because when you were younger they weren't mixing the vaccination like cocktail drinks.","commenter_a":"I'm 45 year old hot all my vacs as a child and I'm ok","post_message":"The Senate on Monday reaffirmed the bill striking California's personal belief exemption for immunizations on a 24-14 vote."}]
