[{"comment_id":"1792810264314039","commenter_b":"Encoded in every religion is the belief of the family unit,man and women create children and society moves on. The radical notion that homosexuals can reproduce and create this dynamic is laughable and should not be lauded as some great thing for society. Man and women really do have different roles in society and its quite apparent no matter how society wants to change it. Secondly, racism is flat out wrong but we are doing a damn good job for a country so young with diverse groups of people.Religious freedom made this country and most of its core tenets come from the Christian bible and not the quran or any other text. Churches should be taxed if they become political and held to task on their beliefs in the marketplace. The past 8yrs tried to change America but Americans bit back and won.I am not talking political just basic morality ...","commenter_a":"Let's get rid of tax free status for churches.","post_message":"What a great idea. Let's end the separation of church and state. Let's convert religious organizations into political organizations. Let's funnel dark money funds raised by religious organizations into political campaigns. Let's sanction racism, sexism, homophobia and other forms of discrimination under the guise of \"religious freedom.\" This absurd and unconstitutional idea must not be passed by Congress."},{"comment_id":"10153226517872232","commenter_b":"Probably...","commenter_a":"And while all were watching the fight 1 or more were most likely walking out with merchandise","post_message":"CAUGHT ON VIDEO: Several women got into a brawl Friday afternoon inside the popular Rittenhouse Square clothing store, Zara --> @webpagelink"},{"comment_id":"10156072867635389","commenter_b":"Ramos was rude but so was Trump.","commenter_a":"Trump of course","post_message":"Question of the Day: Who do you think won last night’s exchange: Jorge Ramos or Donald J. Trump?"},{"comment_id":"980167608741328","commenter_b":"Trump should just buy there piss ant country..","commenter_a":"So funny","post_message":"What do you think of the proposal to ban Donald J. Trump from entering Mexico?"},{"comment_id":"10154461137273162","commenter_b":"@username is clearly an anthropological & archaeological authority on the issue of Jewish history. Oh, and he was apparently elected to be the Arbiter of Jewish Identity, seeing as he now has the right to decide which Jews belong where","commenter_a":"I'm sorry Bibi - you know bunch of us real Americans LOVE you !!","post_message":"Now he’s “Boo Boo!” Netanyahu! The Israeli Prime Minister Benjamin aka “Bibi” Netanyahu received a chorus of boos from the most American of audiences: New Yorkers who paid exorbitant sums to see the ever sold out smash hit “Hamilton.”"},{"comment_id":"472703329582291","commenter_b":"How does Trump make Mexico pay for the wall, When America has no authority over Mexico ?","commenter_a":"We need the good people of Florida to Vote Trump!","post_message":"FLORIDA: Early voting is now open! Do not miss this opportunity to #MakeAmericaGreatAgain #Trump2016 Ivanka Trump Find Florida early polling locations: @webpagelink"},{"comment_id":"10153996390124071","commenter_b":"@username STOP ALL WELFARE PROGRAMS AND WE WILL NOT BE FINE! THERE WILL BE MORE MENTAL HEALTH ISSUES, MORE DRUG ISSUES, MORE CRIME, MORE HOMELESSNESS, MORE TRAUMA.. THAT IS NOT THE ANSWER BUT IF THERE WAS A LIVING WAGE PUT IN PLACE WE WOULD HAVE LESS PEOPLE ON WELFARE THAT IS A GIVEN. TOO EASY..","commenter_a":"Velocity of Money: I think it's quite simple if you look at something called velocity of money. What does that mean? That is the money that gets spent back into the economy. When you have the top 1% getting money, they spend 5-10% of what they earn. When you have the lower end of the economy getting money, they spend 100-110% of what they earn. Since we are a consumer economy this will be good for business in the long term. Not for the people getting the $15 per hour.","post_message":"An economist explains why Clinton’s plan to raise the minimum wage to $15 might be 'too much, too quickly.'"}]
