[{"comment_id":"501283103409637","commenter_b":"I'll bet this ungrateful Liberal enjoys the freedom that our military & constitution provide her !!!","commenter_a":"The original blonde joke. No offense meant for conservative blondes or any blonde with good sense.","post_message":""},{"comment_id":"651982771617164","commenter_b":"SEND HER BACK TO WHERE EVER SHE CAME FROM ! LET HER WHINE ALL THE WAY HOME !","commenter_a":"Yap she's crazy..go home.","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In... This must be some kind of sick joke. Do you think she has completely lost her mind?"},{"comment_id":"1227346460655830","commenter_b":"This bitch is an idiot.. lol","commenter_a":"Really? Trump wants to end Social Security, Medicare, Medicaid, Food Stamps, and Obamacare! Voting Democrat is the only way to stay alive!","post_message":""},{"comment_id":"10153615979136336","commenter_b":"The screams of protest would wake the dead if that happened.......even after the muslims get they demands met!!! This is a true blight on America!!!","commenter_a":"Should be open to all faiths. Can you imagine the liberal outrage if it was a Christian prayer room?","post_message":"\"How loud do you think the objections would be today if they spent $250,000 in taxpayer money to build a new prayer room exclusively for evangelical Christians?\" – Rev. Franklin Graham"},{"comment_id":"10154622487769342","commenter_b":"Ignorance. Many Americans with family there. Not your brothers/sisters? Or don't they count?","commenter_a":"Fall out from whom? Iran saying Americans aren't welcome there? Darn. Or is it the shrieking protestors? Tiresome.","post_message":"Legal residents and visa-holders were being denied entry Saturday to the U.S. under the Trump action."},{"comment_id":"10156412412225354","commenter_b":"Fire the hoe","commenter_a":"I guess they suspended her because her job, if she is actually a reporter, is just that, report the news and don't add to it or shade it with your opinion. If you want to share your opinion get a job as an editorial writer but don't pretend to be a reporter if that is what you would rather do.","post_message":"What liberal media bias? That's just a figment of your fevered rightwing imaginations."},{"comment_id":"10152694140572452","commenter_b":"Joanna Funes wtf lol","commenter_a":"Ewww I mean it this for real? Nikki Deleon Lexi Richman Ashleigh Gray","post_message":"WHAT'S THAT SMELL? Burger King announced Wednesday that it will soon be selling a Whopper-scented perfume @webpagelink"}]
