[{"comment_id":"10154121936472894","commenter_b":"Yes... trip his ass!","commenter_a":"I don't understand why some dudes so quick to wanna shoot at other dudes over money & drugs.. BUT NO ONE HAS SHOT THIS FOOL YET! Some thug nigga, PLEASE COME BE MVP. Make that sacrifice. 😂😂😂😂","post_message":"George Zimmerman Kicked Out of a Bar After Calling the Manager a Ni*ger Lover"},{"comment_id":"10153953005567464","commenter_b":"Norma Pickford love your BS where you get it from? @webpagelink","commenter_a":"I trust you to do the right thing for America and the workers of America. Don't weaken. You keep doing your part and I will keep praying to the Lord to bless us with yo uh in the Whitehouse","post_message":"Politico reports Obama's Department of Labor is using H-1B foreign workers while many Americans are jobless. That is wrong. The H-1B visa program is broken and I have a plan to fix it: @webpagelink"},{"comment_id":"10153020222586051","commenter_b":"No apology for this little lady. She is too ignorant to understand who made sacrifices for her to have the privilege of saying the Pledge! Maybe she should return from whence her ancestors came from a place where I'm sure the reason they left was because they didn't have the freedoms they came to the U.S.A. to enjoy!!","commenter_a":"After all we all should be praying.","post_message":"The teacher told this girl that she had to stand up for the Pledge of Allegiance. The girl's response: No."},{"comment_id":"1098620013533448","commenter_b":"This is AMERICA AND AMERICANS should be able to fly OUR FLAG any time and any place in America we want to and if some foreigners don't like it then they can get the hell out of America now.","commenter_a":"The school should be ashamed. This is America and the flag is the symbol of freedom. Whoever is the leader of this school should be fired and never allowed to work in the school system again","post_message":"EPIC! The School Said The Flags Off Your Truck, His Response Set Em Straight (VIDEO) This is America! Don't like it then leave!"},{"comment_id":"898473566912365","commenter_b":"@Patty Royer, please do not breed. America already has enough mouth breathing inbred idiots and you, madame, and I use that in it's professional sense, Are their Queen.","commenter_a":"And the Republicans encourage this kind of person.","post_message":"No surprise at all. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152933391727061","commenter_b":"Someone call this woman a waaaaambulance!","commenter_a":"pumping is nosey - and a private matter......Maybe the airlines should have a private area for moms to nurse and pump.. My daughter travels and breast feeds and she has never pumped on the plane. She pumps before she leaves. BUT maybe it reallyl is time for the airlines to make areas for feeding and pumping.","post_message":"Mother claims male flight attendant relegated her to lavatory after denying request to pump breast milk in back of plane: @webpagelink"},{"comment_id":"10154770919726037","commenter_b":"There isn't any suspense. I think we all know what Trump's reaction will be when he loses...","commenter_a":"He answered truthfully. We'll wait and see. It was a gotcha question for which there is no correct answer.","post_message":"“I’ll keep you in suspense.” - Donald J. Trump"}]
