[{"comment_id":"906985682657621","commenter_b":"She didn't come up with it! If she tries to patent it Nicki Minaj will sue her. Nicki said SHE came up with the word. SMH, that word has been around for 20 years.","commenter_a":"She needs to get a copyright or a patent for the word because people these days will try their best to steal your joy! IJS","post_message":"How Kayla Newman Created “On Fleek” While Her Mom Shopped At Burlington @webpagelink"},{"comment_id":"1075404492512556","commenter_b":"WTF was with that woman?!? She's just sitting in there? She should have been out of there so fast and getting those kids out. He had to keep yelling to get her out???? What a Moron. And they just stand there Casually once out??? I might be kissing the kids out of Gratitude that they were alive and Thanking the Officer that saved them. There is something Seriously WRONG with these women.","commenter_a":"So are they the baby sitters? They sure shouldn't be parents!","post_message":"Dramatic footage shows two women and two children being rescued by California Highway Patrol officer after their car catches fire."},{"comment_id":"865465356933659","commenter_b":"But you DIDN'T worry when YOU went after Trump. NOW you're worried? I guess the old Texas saying is true: Your alligator mouth over loaded your mocking bird butt. TUFF SHIT. DEAL WITH IT.","commenter_a":"Oh, please. She'd do just about anything to Mr Trump to denounce him. You need another job, or stop putting your own opinions on your show. Get a life. I used to like you, but I'm not a fan of yours anymore","post_message":"Megyn Kelly tells Mediaite she worries that “someone’s gonna hurt me in the presence of my children.”"},{"comment_id":"10154349136059203","commenter_b":"Then you would be sexually assaulting a sexual assaulter","commenter_a":"If I ever saw this piece of shit in the street, I'd kick him in the nuts. He's a disgusting animal","post_message":"As if this could get any sicker."},{"comment_id":"10153218890796336","commenter_b":"^ baseball, hockey, and wrestling","commenter_a":"Should white people riot the NFL Draft?? 95% black were drafted last night","post_message":"JUST IN: Five of the six Baltimore police officers charged in the death of Freddie Gray are in custody, according to Mayor Stephanie Rawlings-Blake. @webpagelink"},{"comment_id":"10153204606574342","commenter_b":"If she hate America she need to move","commenter_a":"but, she likes their $$$$$$$$$$$!","post_message":"Ariana Grande says she's sorry for saying \"I hate America\" in a recent video that leaked of her in a doughnut shop."},{"comment_id":"586245841541886","commenter_b":"Murders need to go to prison!!!","commenter_a":"Thank you Dr Carson","post_message":""}]
