[{"comment_id":"10153949955984454","commenter_b":"Chicks with green dresses","commenter_a":"What is wrong with this pipeline? Pipeline are the safest way to move oil and natural gas. And the least destructive to the environment. Most of the land recuperates in a few years.","post_message":"An expanded Alberta Clipper pipeline could send up to 880,000 barrels per day of toxic oil from Canada's Alberta tar sands into America's heartland even more than #KeystoneXL. Tell Secretary of State John Kerry to block the Alberta Clipper pipeline: @webpagelink"},{"comment_id":"1179437002118415","commenter_b":"How about black miss America ,didn't see any white girls","commenter_a":"Isn't BET racist because there's no white people nominated? Why do they have the right to protest the Oscars while holding black only awards programs?","post_message":"Disgusting! Actor Spews Anti-White Racism At BET Awards CROWD GOES WILD (VIDEO) I've never seen such clear racism be allowed on TV before, wow. Lets get 1000 SHARES if you AGREE BET is a RACIST network"},{"comment_id":"633021916884133","commenter_b":"Handler is not someone who the 1st lady would want to meet with. Talk about the trash...","commenter_a":"Chelsea Handler who is a hardcore supporter of Hillary Clinton and a Democrat. She is actually a racist.","post_message":"Wow..."},{"comment_id":"10153881139329456","commenter_b":"Not Thugs , WORTHLESS TRASH!!!!! \\b","commenter_a":"Look all you people who argue what a thug is. Those two are thugs.","post_message":"Missouri police say the 2-year-old was left alone in his crib for 38 hours and reportedly died from hyperthermia."},{"comment_id":"1209844019025849","commenter_b":"But she will claim , its someone elses fault and she knows nothing !","commenter_a":"Better watch himself or he will have an accident like all the others!!","post_message":"WATCH: Romanian hacker \"Guccifer\" tells Fox News he easily breached then-Secretary of State Hillary Clinton's email server. @webpagelink"},{"comment_id":"1265882336765127","commenter_b":"And yes that woman looks horrible because she over does it ...like I said I wouldn't suggest coming every day for the rest of your life","commenter_a":"Ummm....I am a tanning salon OWNER! You are are misinformed in your information as we all have taken classes about tanning. My mother died of melanoma and never tanned a day in her life we get SOOOOO MANY people with medical conditions who have to tan some of which are young girls. Now they passed the new law in 2014 on minors but we are WIDELY sought out and remained a tanning salon for 17 years!!! You have to educate yourself on it. The media is giving it such a horrible rep just like they do with everything to make you all freak out the exact way u are. If we didn't know what we were talking about then why do we have clients come who beat breast cancer with a doctors note or psoriasis or cystic acne or ms eczema the list goes on. Your body NEEDS vitamin D ...","post_message":"The FDA proposed unprecedented new rules Friday that would bar anyone under 18 from using a tanning booth or sunlamp."},{"comment_id":"864428380327492","commenter_b":"Ruth, you're an idiot.","commenter_a":"Just proves they hate women and wish we were their slaves ... can't believe we have to fight for human rights for women still .. please tell me why anyone voted for this disaster","post_message":"Republicans will move to strip all federal funding for Planned Parenthood as part of the process to dismantle Obamacare, House Speaker Paul Ryan said"}]
