[{"comment_id":"10153630936701955","commenter_b":"Idiots are using it for crack and other illegal substances !","commenter_a":"What a shitty headline. The doctors put him in a coma, not the e-cig. Drudge should have had more sense than to repost such drivel.","post_message":"Man In Coma After E-Cigarette Blows Up In His Face..."},{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":" is just it's a wonderful line. I own some of it. I fully I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"493286290862389","commenter_b":"Now if we could just get her to STAY in Africa. ..and her little pea brained spouse. .","commenter_a":"I believe Hillary and Bill did something similar before they left office, milked the system for all they could and stole hundreds of thousands of dollars worth of White House furniture and art work.","post_message":"First lady Michelle Obama's family trip to Africa, Spain and Morocco to promote her \"Let Girls Learn\" initiative, and cut a CNN documentary on the effort, has already crossed the $1 million mark with many more expenses still to be tabulated. According to the bills that have already come in, Obama, accompanied by an entourage that includes her mom and daughters, has spent about $1.06 million: $512,737 for hotels and $252,471 for limos and transportation. - via Washington Examiner"},{"comment_id":"837415593047972","commenter_b":"what a lying hag she associates herself above everyone no matter color!!!!!!!","commenter_a":"Excuse me, is Hillary Clinton talking about humility ? - What a joke !","post_message":"Give me a break!"},{"comment_id":"1065696356784708","commenter_b":"and it is not round","commenter_a":"So the planet isn't flat.","post_message":"Find out what the world really looks like."},{"comment_id":"10153396181678908","commenter_b":"Good morning through Facebbok","commenter_a":"Beth Bethy Lockwood","post_message":" are confirming the health benefits of meat-free eating. Nowadays, plant-based eating is recognized as not only nutritionally sufficient but also as a way to reduce the risk for many chronic illnesses. Harvard Medical School"},{"comment_id":"1674023152845757","commenter_b":"Funny","commenter_a":"Idiots!","post_message":"Just take a guess which Democrat Senator said this..."}]
