[{"comment_id":"10156406946480354","commenter_b":"She'll be a thief til her last breath!!!!!!!!!!!!!!!","commenter_a":"Hillary Clinton is a corrupt, old, nasty glory seeker.","post_message":"\"Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" Hillary Clinton is a _________________."},{"comment_id":"1262054097174477","commenter_b":"Ann coulter is a real bitch period","commenter_a":"You are one Bitter woman and no one in your life to love or who loves you. I know being 52 is hard but please dont take out your bitterness on other people. They are passionate in their believes. Let them be and go find yourself a man. it will help I promise.","post_message":"Controversial conservative figure Ann Coulter took to Twitter on Thursday, attacking protesters who continue to reject president-elect Donald J. Trump ."},{"comment_id":"1241837469190442","commenter_b":"@username was gonna say too :/.. probably bhs...","commenter_a":"Tim","post_message":"Ready to play during recess? Sit on the bench at this school, and you'll find friends in no time. (via CBC Saskatoon)"},{"comment_id":"555840684604224","commenter_b":"Look how christianity views woman it's almost as bad","commenter_a":"What confuses me is why women would want to stay in this horrific religion that view women and children less than animal's. Mohammed is dead he isn't coming back !!!","post_message":"Spread this..."},{"comment_id":"10154219660042908","commenter_b":"Yet they try to call themselves the prolife party.The warmongers that they are proves that they aren't.They aren't prolife they are pro birth.The GOP will get us into war with iran and the way donald trump is talking we'll have a border conflict with mexico.","commenter_a":"Still waiting for Bernie to say something about the 700 million dollars congress. spent on defense last year","post_message":"Sadly, people like former vice president Dick Cheney and many of the other neo-cons who pushed us to war in Iraq were not only tragically wrong then, they are wrong now. Unfortunately, these individuals have learned nothing from the results of that disastrous policy and how it destabilized the entire region."},{"comment_id":"10153069537647293","commenter_b":"lol holly you do realize \"lust\" existed before the legalization, right? plenty of both gay and straight couples letting lust \"win\" on a regular basis. the legalization of same-sex marriage allows same-sex couples in LOVE to get married. so yes, love wins.","commenter_a":"Give it up haters. Love won. You lost.","post_message":"\"This is no time for fear or outrage or politicizing. We see that we are strangers and exiles in American culture.\""},{"comment_id":"1704317133188732","commenter_b":"What's he going to sound like when he is eight? Just unreal! God Bless you buddy, keep it up","commenter_a":"Wow now that's something you don't ever see or hear unbelievable so beautiful never would of thought a 4 year old could sing like that.I think singing is in the future for this young child.","post_message":"Oh MY! This little guy knows his Dolly Parton."}]
