[{"comment_id":"473460069511240","commenter_b":"Tell the goat F to get out of our country","commenter_a":"Kudos to you Clint Eastwood ... !!!","post_message":"Muslims want Clint Eastwood's head, but he's not backing down. This is outrageous, let's show him we have his back. Can we get 10,000 'LIKES' for Clint Eastwood?"},{"comment_id":"10154331232125530","commenter_b":"Lol frfr and I would have them together honey","commenter_a":"@username they should put U in charge","post_message":"Fire up, Detroit Lions fans! Cheerleaders will be on the field soon!"},{"comment_id":"10153601667565329","commenter_b":"Wtf buzzfeed? That chick with her fingers under her eyelids?!","commenter_a":"My leg spasms like that too. It's nasty!","post_message":"No. No you can not."},{"comment_id":"1213366555426261","commenter_b":"More illegals equates to more democratic votes due to the dreams of entitlements and riches. Look at California (seems to start on the west coast), they are making it as easy as they can to give illegals the opportunity to vote...they even have a few illegals in city government! More democratic votes keep Dems in power, which means more taxes from the middle class which eventually places people closer to poverty...which places more government control over it's citizens...Hence the \"Democratic Agenda\". That \"Agenda\" puts us that much closer to the \"New World Order\"!!! Guess who would be the leaders of the \"New World Order\"?","commenter_a":"#TrumpOnTrumpingOn2016! BREAKING NEWS: \"Reince Priebus, Paul Ryan, Karl Rove, Stealing RNC Donation Money\"! ~ Hon. Roger Stone","post_message":"A country that for generations saw millions of its citizens cross into the U.S. is suddenly telling its southern neighbors they can no longer do the same."},{"comment_id":"1033670103395908","commenter_b":"If I looked like Debbie, I would be a liberal to. Democrats know they got messed up looking chicks.","commenter_a":"Can we have at least 10 debates?","post_message":"Chair of the DNC Debbie Wasserman Schultz is taking your questions about the Democratic debate. What would you like to ask? Leave your questions in the comments, and we'll post Rep. Wasserman Shultz's answers in a follow-up tomorrow!"},{"comment_id":"10153471218374270","commenter_b":"What ever happened to OPSEC!","commenter_a":"What does that do? Piss them off?","post_message":"Big deal."},{"comment_id":"10158293361345725","commenter_b":"Well mother nature must be a murderer because women spontaneously abort all the time. It's called a miscarriage.","commenter_a":"Although I consider myself a Progressive, I have to agree that abortion is murder. That is one thing that I agree with the Republicans. Not because of their political beliefs but me as a human being. Murder is murder and we shouldn't give permission to commit it.","post_message":"Ohio Governor John Kasich has signed a bill imposing a 20-week abortion ban, in a prelude to the broad offensive abortion-rights opponents plan to launch across the nation in January."}]
