[{"comment_id":"10153260031480095","commenter_b":"Please remove the ones that are already here and close our state's borders to all of them. This is a matter of defense, not of immigration.","commenter_a":"#LetThemInBobby Rescind your order! You are an embarrassment and I am ashamed of you.","post_message":"I just signed an Executive Order instructing state agencies to take all available steps to stop the relocation of Syrian refugees to Louisiana. The Obama administration continues to fail to provide critical information to state government or local authorities and has intentionally kept our state in the dark about their irresponsible refugee relocation plans. This is a matter of national security and a matter of Louisiana’s security. I will do everything in my power to stop this from happening."},{"comment_id":"1765102733707241","commenter_b":"What a pig","commenter_a":"Mariana Vilella","post_message":"Hillary Clinton: \"It's just awfully good that someone with the temperament of Donald Trump is not in charge of the law in our country.\" Donald J. Trump: \"Because you'd be in jail.\""},{"comment_id":"10153179149615399","commenter_b":"Most Conservative Women act childish.","commenter_a":"Right wing conservative instigator botox bitch.","post_message":"Actually, it's really not."},{"comment_id":"10156364820535615","commenter_b":"Best liars contest? Hmmm... Now, I'm not saying that he hasn't told his fair share of lies throughout his life. Who hasn't? But, have you heard of a woman named Hillary? She'd have no problems at all winning that contest. Not just winning, but OBLITERATING the competition.","commenter_a":"Glad to see half of Americans are smart enough to realize that. We've come a long way when it comes to equal rights and racism. Let's not go backwards and throw all of that way. Donald Trump is not a good candidate for President !!!","post_message":""},{"comment_id":"10153656654198598","commenter_b":"I guess Margaret Sanger and her biggest admirer, Hillary, are accomplishing their evil goals!","commenter_a":"Whoa! That is alarming.","post_message":"More Black Babies in New York City are Aborted Than Born Alive"},{"comment_id":"419941198130475","commenter_b":"Yes, Yes, she is a ruthless women!","commenter_a":"Youll keep up the good work","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"},{"comment_id":"10154298865889099","commenter_b":"Smh","commenter_a":"Jessica Milla","post_message":"\"Her ribs are broken. He beat her ribs and breast saying her milk was useless and she was worthless,\" the woman's mother said. \"He tried to blind her so she couldn't see her baby, he tried to make her deaf so she couldn't hear him crying for her.\" WARNING: Some may find the images in this story disturbing. @webpagelink"}]
