[{"comment_id":"10152965357956336","commenter_b":"Lets face it, the ppl this upsets the most are the females that could never pull it off.","commenter_a":"I think all you who say it's too far are the same ones waiting for fifty shades of grey.","post_message":"Did Sports Illustrated Swimsuit go too far this year?"},{"comment_id":"731413603663114","commenter_b":"Build the wall, those here illegally on good status, offer citizenship, if no, they go. Those in our prisons, bye bye, gone. Immigration problem solved.","commenter_a":"The Republican politicians not following through on campaign promises and general fecklessness is what brought about Trump's popularity, not just the immigration problem. Trump was willing to bring up the illegals when the others were not.","post_message":"Meghan McCain warned Donald J. Trump of softening his stance on illegal immigration. Do you agree or disagree with her comments? @webpagelink"},{"comment_id":"10153217617761460","commenter_b":"Gays have no right to call it Marriage .","commenter_a":"I dont like, or approve of same sex marriage, however we all have a DIVINE right to choose how to live our lives. What that means is, if one chooses to go against the 'rules' then that is on them. Its called \"free will\". I would advise against it according to my own spiritual belief's...but I have no right to take it any further than that with a non-believer. Its a touchy subject! We all have a gay person in our lives somewhere that we love, we may not like or agree with this life-style, and we do have a right to \"voice\" that, but that is where the right ends, and the rights of the gay person start...I only wish now the gays would see where THEIR rights end when dealing with those of us that are Not gay, and we do have Divine & Constitutional to disagree, but ...","post_message":"Marriage should be defined as it has always been. This is the ideal for raising children and is good for society. But while Americans are deeply divided on this issue, we should be able to agree that a Supreme Court decision would only exacerbate that division. Like the Roe v. Wade decision in 1973, a Supreme Court ruling that overturns state laws on marriage would do nothing to end the debate about marriage, but would instead prolong it. Full statement here: @webpagelink"},{"comment_id":"990875947619544","commenter_b":"Such an evil, self-serving, grandstanding waste of oxygen!","commenter_a":"Wasn't he born in Canada?","post_message":"At least he's fighting imaginary foes, this time."},{"comment_id":"966636103398507","commenter_b":"Racism is alive and well and all the race baiters are enjoying tearing this country apart.","commenter_a":"This country is screwed up,this is what happens when people are as divided as modern day white people are. Who are the whites of these days owns slaves or would want to own anybody. The bible says u cannot enter into heaven if u don't forgive the ones who wronged u,yet some raise hell about a hundred years ago.what about the tribes in africa who captured weaker tribes and sold them to slave traders never her about that from the fame hunters.what about the poor whites who were treated the same and had to work all week for slab bacon,6 ears corn.","post_message":"RIDICULOUS: I can't figure this one out! Americans need to get their acts straight and realize who really protects them. LIKE our PAGE! www.facebook.com/Briankolfage"},{"comment_id":"10153014611669138","commenter_b":"\"Land of the free\"? Should be able to go where ever the hell we like! A sign isn't going to stop me","commenter_a":"Sheesh. Just did this last year and yeah it was slippery but everyone knew you did it at your own risk. As for the stairs being closed well you could step over the chain they put to block it. I'm actually taking my boyfriend in the next couple weeks since he's never been.","post_message":"\"The Park Board is disappointed that local media is encouraging this behavior by covering it without explaining that it is dangerous and illegal.\""},{"comment_id":"10153541693114714","commenter_b":"Why is it YOUR business what she does?","commenter_a":"I don't understand why ppl think that it's okay to die \"their own way\". Any way you slice it, that is suicide.","post_message":"\"When I pass, I do not want her to watch me in pain.\""}]
