[{"comment_id":"10153326464497235","commenter_b":"She is definitely a jerk. And that's putting it nicely. lol","commenter_a":"all they needed to do was let her call someone to prevent his suicide. a tragedy when regulations trump basic moral values.","post_message":"She says a Southwest Airlines flight attendant slapped the phone out of her hands ..."},{"comment_id":"1562827943734753","commenter_b":"That woman on the right is a moron!!! (Red top).","commenter_a":"Fuck you lieing democrats your nominee is trash n war with Russia will happen if she's elected even Russia's president believes so","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"1311726352220443","commenter_b":"Percy Lopez. ...taken to the cleaners, you have been schooled Percy, what's it like being a moron","commenter_a":"The best president ever!! Turned the economy 360 degrees after Bush's administration crashed it to the ground. You have done everything you could to help america Mr president. Your courage, dedication and integrity brought tears of gratitude to so many american people.","post_message":"'I can drink beer at 11.30am and Michelle won’t even know?'"},{"comment_id":"10157066156885389","commenter_b":"Listen... Im pro-Trump and agree with a vast majority of his political stances; however, this wall fallacy is a dream.... a wall doesn't stop illegal entry, it only causes illegal entry to evolve. Initiating an armed presence is one of the most effective ways of mitigating unlawful entry by immigrants.","commenter_a":"Trump wants to rename USA to UST United States of Trump lol","post_message":"“We’re going to build a wall and it’s going to be a real wall… And it’s going to look beautiful because some day they’re going to call it ‘The Trump Wall.’” – Donald J. Trump at a rally in New Mexico"},{"comment_id":"10156742886720354","commenter_b":"Maybe they will accept the migrants destined for the USA.","commenter_a":"Good luck. You can have ours tooo","post_message":"The government of Canada has ordered its military to draw up plans for migrant camps that will allow more than 6,000 Muslims to be housed on a long-term basis at several Canadian Forces Bases...."},{"comment_id":"10153157386338984","commenter_b":"MUSLIM ASSHOLES","commenter_a":"@username:(. Not all blacks are Freeloaders. You are being Racist I hope you don't teach that to your Grandchildren's. What about the Bushes when they were in WH and they traveled around the world,that was ok right. And you Republican want another fucking Bush in office.","post_message":"Outrageous. This makes my stomach churn. I think we should make HIM pay up... Do you think Obama should be impeached?"},{"comment_id":"10153051967106130","commenter_b":"Aqua man? Bitch please.","commenter_a":"\"Do you have a minute to hear about our lord and savior Jesus Christ?\"","post_message":"YIKES."}]
