[{"comment_id":"10152882517291051","commenter_b":"Just lie a Black woman to get defensive-----you have a crush on him? Michelle won't like it.","commenter_a":"A lot better the Barack Hussein Obama.","post_message":"The next time you meet someone who doesn't like their name, tell them about this guy and remind them that it could be worse."},{"comment_id":"698823633563273","commenter_b":"Well then stop her. Isn't that your job?","commenter_a":"Yes a female Eric Holder,","post_message":"GOP leadership should stop the Loretta Lynch nomination by not reporting it to the floor for a vote. We must reject lawlessness, outright."},{"comment_id":"10154359999193132","commenter_b":"She is bigger in size for sure","commenter_a":"Even though he won, I think La'Porsha is going to be a bigger star. We haven't seen the last of her. :-)","post_message":"Congratulations to the fifteenth (and final!) winner of American Idol!"},{"comment_id":"369489863429570","commenter_b":"Ship her out ban her from AMERICA","commenter_a":"I agree she should be arrested","post_message":"President Trump says Madonna is 'disgusting' and a 'disgrace' to America because she said she wanted to blow up the White House. Agree or disagree?"},{"comment_id":"10154090805807869","commenter_b":"She deserves nothing!","commenter_a":"My friend said Hillary has worked her entire life to be president, so she deserves it. Working to further ones career whilst providing no service, accomplishing nothing, and harming others is exactly who I don't want.","post_message":""},{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed. You can't see greatness at the same time you see that."},{"comment_id":"828004503968344","commenter_b":"The world is better off for her decision. Her kids wouldnt only be stupid...they'd be ugly as hell too!","commenter_a":"Damn good thing she doesn't want children. We don't need more idiots like her. Just imagine how brain dead her offspring would be.","post_message":"Liberals are repulsive Dc Gazette (y)"}]
