[{"comment_id":"404872436304464","commenter_b":"Pieces of shit like her need to be culled, slowly an painfully.","commenter_a":"Now I've heard everything. Hurry up with the \"Big Payday,\" Lord.","post_message":"A woman and her cop husband were at a bar for a drink before she got on the road and ran over three teenagers riding their bikes. Now she is suing the boy's family for the \"trauma\" she was put through by hitting and killing one boy and permanently injuring two others."},{"comment_id":"10153129046736051","commenter_b":"The border is broken and Obama wants everyone to come on in. Breakdown between law enforcement agencies. I agree with Trump. Build a damn wall. I live in a border city. Luckily we don't have a big problem but now we have to worry about middle eastern people.","commenter_a":"That's a Dad who will have nightmares the rest of his life! May God be with him. What a beautiful young woman! What the hell is wrong with our country?","post_message":"This woman's dad had his arm around her when they heard the pop. As she collapsed on the ground, he could hear her repeat the same thing over and over again: \"Dad, help me, help me.\""},{"comment_id":"10153134315811336","commenter_b":"I don't believe a word she says along with that piece of trash ruining our country.","commenter_a":"Would that be illegal voters or the type that is human scum?","post_message":"Clinton's goal, according to two people close to her organization, is to make her second run for The White House more about voters and less about herself."},{"comment_id":"10154407674347756","commenter_b":"Muzzie lover go eat crap","commenter_a":"key word temporary oh maybe we republicans should go burn a few cities down now too and a few police cars right! Hmnnn oh thats right we like law and order imagine that.. Good things take time go TRUMP go we have your back...","post_message":"A Federal Appeals court Thursday evening ruled against the Trump Administration’s controversial transportation order, upholding a district court judge’s ruling to block the order."},{"comment_id":"10154301833998487","commenter_b":"The onus should be on the Jewish men: if they believe that women should not be swimming with them, then the men will just have to find someplace to swim.","commenter_a":"No. Your religion is your problem. If the pool wants to allow certain groups, including religious groups, to reserve the pool for certain blocks of time (like a water fitness class), that would be okay.","post_message":"Should city pools accommodate women whose religious beliefs forbid them to swim in front of men?"},{"comment_id":"1785689904981470","commenter_b":"I'm considered a minority, but I will NEVER support a lying pandering corrupt person no matter the gender. Many of us are onto her regardless of her pandering. I hope that bottle of hot sauce that she carries in her bag at all times, helps her because she's going to need it. I'm happy she dodged sniper fire in Bosnia, but at this point, \"What difference does it make?\"","commenter_a":"Women and minorities will elect Hillary. We do not need an inexperienced, ignorant, unpatriotic misogynist as President. He isn't even familiar with the Constitution or how our system of government works and he is a horrible human being who brags about not paying taxes, crushing small business, defaulting on loans and being sexually attracted to his daughter. It is hard to imagine someone less qualified being nominated but then he ran against a group of people without a clue.","post_message":"After their hard-fought primary battle in 2008, President Obama asked Hillary to serve as his secretary of state. Here's what foreign policy experts and world leaders think about her four years as America's chief diplomat:"},{"comment_id":"693135860835189","commenter_b":"@username you are too old to be so stupid. Old white men are disgusting.","commenter_a":"Clinton is a LOSER. She may win the Democratic nomination but Sanders supporters will NEVER vote for her = she's lost the general election. Sanders can win it either as a Democrat or independent or third party. . Clinton forgot one thing...,she antagonized Sanders supporters so much that even if he begged they would not vote for her. Not a winning game plan.","post_message":"Hillary Clinton knows exactly how to beat Donald Trump, and she has what appears to be a winning game plan. --Andrew"}]
