[{"comment_id":"10153342666393132","commenter_b":"She still is basic!","commenter_a":"He just swerrrved on her! Ayeeee! She needs to remember her roots and remember she was once 'basic'.","post_message":"\"Madonna, you have achieved unbelievable success and while we appreciate your talent and achievement, we expect you to appreciate ours.\""},{"comment_id":"10153033026636336","commenter_b":"She should have let him back on","commenter_a":"Somebody better contact Social Services about that bus driver! He let a child walk 1/2 mile alone!","post_message":"An Indianapolis mother is outraged after her 6-year-old son was forced to walk home a half-mile through knee-deep snow after a bus driver dropped him off at the wrong stop and wouldn't let him back on."},{"comment_id":"10152982642761336","commenter_b":"Where are the sires of these brooding mares? I know they are out making many more welfare babies! Really!","commenter_a":"Let me clear this up for y'all make it real simple. I grew up in Jackson and the school is in the heart of the ghetto. I am talking section 8 housing, five homeless shelters with in a five block radius of each other. This is the part of town most people don't like to be in after dark. Most of the children you will run into at the school will be children of welfare brood mares. Jacksonville is very lenient on getting welfare and other government assistance, so a lot of welfare babies are born and never taught respect or manners. Most of the people living in the zip codes surrounding the school have six to eight children and are on welfare and any government assistance they can be on. So schools are over crowded and under staffed. Also these parents are either not going to care or get ...","post_message":"A Florida kindergarten teacher has been suspended without pay after she videotaped a boy beating other students on three occasions."},{"comment_id":"901335433248814","commenter_b":"It's time for YOU to answer AMERICA about BENGHAZI !! The four AMERICANS that lost their lives are on your clock and hands !!! It's time for YOU to answer AMERICA !! WHERE YOUR MILLIONS CAME FROM !! IT IS TIME FOR YOU TO TELL THE TRUTH ABOUT YOUR EMAIL CRIMES !! IT IS TIME FOR YOU TO ALLOW THIS COUNTRY TO BE MORAL AGAIN !!!","commenter_a":"If you are against he NRA, then you are for gun confiscation.","post_message":"“This has gone on too long and its time the entire country stand up against the NRA.”"},{"comment_id":"10154012959875329","commenter_b":"I was going to tag my bff, and a couple of them made cringe a bit because u do then, but Jesus, that's a real bitch. I must be just a mini bitch.","commenter_a":"Wow I thought I was a judgmental bitch until I read this. Good to know I'm not that bad!","post_message":"You judge everything."},{"comment_id":"10154800990580575","commenter_b":"Lock her up.","commenter_a":"Terroristic Threat","post_message":"This Has Got To Stop..."},{"comment_id":"1022294177808818","commenter_b":"Just normal housewife.","commenter_a":"Meat grinder, feed hogs, use poop for fertilizer, only positive outcome...","post_message":"Not even a little tiny bit sad over this. Nope."}]
