[{"comment_id":"10154271893261336","commenter_b":"He should deport the freeloaders and criminals. There are a lot of nice people out there who want to work and be a part of America","commenter_a":"Trump just told CNN he is for a raise to the minimum wage. I am waiting for Trump to say he will not deport the 11 Million undocumented immigrants he promised his rightwing base. Look for that next week.","post_message":"After emerging as the presumptive GOP nominee following a major victory in Indiana, Donald J. Trump is responding to questions about whether he'd choose John Kasich as his running mate. Don't miss Trump tonight on \"The O'Reilly Factor\" starting at 8p ET."},{"comment_id":"1629129360707510","commenter_b":"she is a piece of trash and nothing can change that","commenter_a":"Who cares","post_message":"This Is Unbelievable!"},{"comment_id":"10155178808719411","commenter_b":"she so fine would have her sit on my tongue on the day lee","commenter_a":"Ok, so protests are Ok but protesting against the former protest is \"not Okay\".. Double standards imo.","post_message":""},{"comment_id":"10153649421859138","commenter_b":"Why would you post such a thing Dan??? Wtf?","commenter_a":"Meanwhile in Chicago this weekend, more people were gunned down by those whose lives matter. But let's not protest that.","post_message":"The Twin Cities Marathon went on today without major disruptions, and police did not make any arrests."},{"comment_id":"10153088777412994","commenter_b":"Dan Bedford Hmm lol","commenter_a":"It was destiny.","post_message":"They've walked down the aisle together twice, but have only been married once."},{"comment_id":"10154388349554657","commenter_b":"Put the witch on a stick and burn her.","commenter_a":"Should be incarserating her.","post_message":"It is the political story that just won’t go away for Hillary Rodham Clinton:"},{"comment_id":"10154302176821491","commenter_b":"Duchess Aungelique GauBrielle You're officially crazy. Added, this is one man's personal experience as well to be fair...","commenter_a":"In all honesty, this sounds like a disgruntled employee... all of the African Americans employed, & previously employed at Versace... he's the only one to disclose this... people buy into anything where race is concerned. I'm African American, I shop high end... I've definitely experienced Racism while shopping, but I could literally count the incidents. Racism is very real, but it's being used and over used to justify everything! However, if this is true, why did he wait until he was fired to speak up. Also, why have none of the other African American employees past or present come out to support him?","post_message":"The store employees were taught during training to say \"D410\" whenever a black customer entered the store, according to the lawsuit."}]
