[{"comment_id":"10158187868175203","commenter_b":"Boo hoo bitch","commenter_a":"The Dems aren't going to stop. They're working their agenda to undermine our Constitutional Republic, the rule of law, and our civil society: @webpagelink","post_message":"Trump defends his travel ban."},{"comment_id":"817688164952017","commenter_b":"Chesimard is a scum pig who needs to be extradited back to NJ to finish her punishment.","commenter_a":"And they wonder why there is racism in American. They are the worst and the rest of us are reacting to this sort of crap and the disproportionate numbers of black's in prison. Clean up your own house first and quit committing crimes and we might actually start to listen. Until then FY.","post_message":"[Video] INSANE LIST OF DEMANDS BY BLACK COLLEGE STUDENTS Includes Naming College Hall After Notorious Cop Killer"},{"comment_id":"1122771727815880","commenter_b":"I wouldn't want that pussy fighting next to me.","commenter_a":"Draft Dodging Coward","post_message":"Donald Trump is just another Republican chicken-hawk. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154566967589369","commenter_b":"She should have got the 11 yrs!","commenter_a":"5 years? That's it? Someone please give her real sentence when she gets to prison.","post_message":"Lethal doses of heroin and fentanyl were found in the body of 14-month-old Annabella Sagstetter last May."},{"comment_id":"10154948296594203","commenter_b":"all the illegals voted too..","commenter_a":"Hillary has 2,017,563 extra votes then Trump. The difference of extra Two Million+ vote which can give a decisive victory to a candidate \"anywhere else in the world\" has ZERO value in America?","post_message":"BREAKING."},{"comment_id":"10156463625885354","commenter_b":"She needs to go blow Bill, be the best use of her mouth in YEARS!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Kiss my butt u dumb idiot if someone had a gun some of those people might not be dead","post_message":"Hillary Clinton is a Fact-Free Zone."},{"comment_id":"1188535021166526","commenter_b":"This is ridiculous! Impeach her and be done with this !","commenter_a":"\"Just because 5 Supreme Court judges make a ruling, it not a law,\" said Kim Davis's 4th and evidently very well-read husband","post_message":"Kentucky clerk Kim Davis’ husband Joe says his wife will never resign and calls out the judge who ordered her behind bars. @webpagelink"}]
