[{"comment_id":"10153212114294087","commenter_b":"You're a vile fucking stupid bitch.","commenter_a":"this Pope is insane he's the worst one ever he says blasphemous stuff no wonder that idiot Obama ass licker biden likes him","post_message":"Joe Biden: \"I admire Pope Francis deeply and I'm excited about his upcoming visit. Pope Francis has become a moral rudder for the world on some of the most important issues of our time, from inequality to climate change.\""},{"comment_id":"10152949521626051","commenter_b":"she is not a mother no mother puts a man before her kids . sick bitch","commenter_a":"Wonderful Mom!!!! She should be locked up !!!!","post_message":"Every night this little girl has to lock her bedroom door so that the child molester who lives with her mother can't get to her."},{"comment_id":"1208679672504821","commenter_b":"She is the most disrespectful woman in the world","commenter_a":"How sick","post_message":"IN CASE YOU MISSED THIS YESTERDAY: @webpagelink"},{"comment_id":"10153599468079024","commenter_b":"Obnoxious establishment audience. Am I watching Jerry Springer folks?","commenter_a":"can you have the audience quit with the noise, so we can actually hear the questions being asked? it's rude","post_message":"Republican presidential hopefuls take the stage in South Carolina as CBS hosts the ninth GOP debate tonight. Watch live here: @webpagelink. Read the latest updates on CBS New York: @webpagelink"},{"comment_id":"1081603935229468","commenter_b":"#I'mwithHer Go Girl all the way to the white House!!!.","commenter_a":"Hilary Clinton, vote for the most qualified candidate for president 2016","post_message":"This is not a single issue country. We need to address racial inequality as well as economic inequality."},{"comment_id":"10154373849503299","commenter_b":"Said all of us in January of 2009!","commenter_a":"Very good Mr. Claar!","post_message":"\"Had we understood just how clueless they were, the election result might not have been so shocking.\""},{"comment_id":"10153996062974203","commenter_b":"Take them all out by any means necessary, they are enemies of this country.","commenter_a":"In other reports, Ammon has told those left at the refuge to give up and go home. Why should they just get to go home, as if nothing happened and they hadn't done anything wrong. Every last one of them should be charged with crimes of all sorts.","post_message":"They're not going anywhere."}]
