[{"comment_id":"10153193599506770","commenter_b":"I think Audrey had her brain aborted !","commenter_a":"Will she have an abortion since Grandma Hillary wants everybody to have abortions.","post_message":"Hillary's going to be a grandma again."},{"comment_id":"522564217947920","commenter_b":"Lmao 😂😂😂","commenter_a":"Sanders is turning into John Kasich, showing up to places and losing.","post_message":"\"We're in it until the convention,\" she said."},{"comment_id":"1521185254588608","commenter_b":"You're talking dt supporters, wd you expect anything else?? RFLMAO!!","commenter_a":"Honest to god this is the dumbest shit I've ever seen.","post_message":"Starbucks is probably guffawing over how effective this isn’t."},{"comment_id":"10158117739325594","commenter_b":"Don't worry Stacey, I will be wearing leggings to your baby shower. Those count as pants, right?","commenter_a":"@username, @username, Elena Fraga","post_message":"Groups of people arrive at the Powell Street station — without pants — as part of the \"No Pants Subway Ride\" event. Read the full story: @webpagelink"},{"comment_id":"10153845002233984","commenter_b":"They can both suck deez nuts lol.","commenter_a":"Jeb may not have expected the question, but he handled it well. The conditions underlying the two events were not comparable. Megyn's comparison was a stretch.","post_message":"Megyn Kelly just took Jeb's criticism of Hillary and threw it right back at him with one question he did not see coming... Do you think Megyn was wrong for using this analogy or was it a fair question?"},{"comment_id":"10153763731329170","commenter_b":"Of course Obama and the Democrats will send them to Texas. That conservative state must stand their ground against the onslaught of terror on America.","commenter_a":"They are stuffing them into Texas in an effort to change us from conservative to liberal","post_message":"This shocking map shows exactly where Islamic extremism is festering within the United States... Has this scourge reached your community yet?"},{"comment_id":"10153626364206600","commenter_b":"I was TAUGHT the same thing you were taught growing up catholic but instead of just taking someone's word for it I decided to go read Gods word for myself and guess what? There are several people in the bible that God forgave for murder. Instead of just taking what your priest says and running with you you shoujd go read the bible and see what GOD sYs about it. It the end it's His opinion that counts.","commenter_a":"Murder is a sin.....abortion is murder. I have no respect for this pope.","post_message":"Pope Francis has made a major change in the way the Catholic Church treats women who have had an abortion."}]
