[{"comment_id":"1026349820770159","commenter_b":"@username holy shit","commenter_a":"Ashton Thalia Buzash Kaitlyn Mckinnon Heba Syed @username Joshua Miller Quinton Chaz I apologize for the weirdness of this but it's also kind of interesting","post_message":"WARNING: Graphic Content"},{"comment_id":"10155980506710725","commenter_b":"@username. I see why you love her lol","commenter_a":"Whoopee","post_message":"What do Amy Schumer and Judd Apatow do when they find themselves stumbling into an Irish wedding? They make the most of it, of course! Watch the wedding crashing incident, all caught on video ----> @webpagelink"},{"comment_id":"10153992942406316","commenter_b":"what is the life span of a fruit fly??","commenter_a":"Wayna Biggs","post_message":"Truvia sweetener a powerful pesticide, kills fruit flies in less than a week..."},{"comment_id":"591215384344977","commenter_b":"Wash your mouth lady!","commenter_a":"Ummm it's not a white thing, it's a hygiene thing.....","post_message":"Imagine if a Republican had said this about Black people...... They'd be destroyed."},{"comment_id":"1019752221480019","commenter_b":"@username then leave!!!!","commenter_a":"Trump does not represent most people in America and he certainly does not represent me. He may be in office 4 years, but I can guarantee you he will not be in another 4 years after that. We will have war in America because of this!","post_message":"President Barack Obama and President-elect Donald J. Trump just met for the first time — and this is what happened. @webpagelink"},{"comment_id":"10156091487575389","commenter_b":"They're socialists, not Americans. They should be deported with the illegals.","commenter_a":"I think they would vote for Hitler if he ran as a democrat. SO many in this country have no concept of reality any more.","post_message":"Question of the Day: Do you think Bernie Sanders can beat Hillary Clinton in Iowa and New Hampshire?"},{"comment_id":"1063488917004194","commenter_b":"Lysha Ewing u r a very bitter woman.","commenter_a":"Stupid cops. To think if it were a black baby they would have walked by","post_message":"Police officers smash window to find fake baby."}]
