[{"comment_id":"10154526330973352","commenter_b":"I also stated that this evil woman deserves prison because she knew damn well what she was doing!!!","commenter_a":"This isn't mental health issue. She knew what she did was wrong as she hid the bodies. That's not mental health issues. First thing everyone wants to make of horrible crimes like this is that It's mental health issues. Bull shit. This woman knew what she was doin so call it what it is....it's EVIL. She is an evil woman who got tired of being a mom and decided to kill her children. No empathy for this murderer. Call it what it is. There are just evil people in the world sometimes. Not mental health impairments every time a parent murders their child. She needs to rot to death in a jail.","post_message":"Pictured: The 'pregnant' Phoenix mom, 29, and her three young sons that she 'stabbed to death before stuffing their dismembered bodies in a closet and suitcase and trying to kill herself'"},{"comment_id":"10154258956738352","commenter_b":"Congratulations. Amazing lady.","commenter_a":"Twins!","post_message":""},{"comment_id":"10156735133795354","commenter_b":"Yes, but they do not work, they are LAZY","commenter_a":"That would cost more too , plus how many on welfare due to injury taking pain medicine gonna be positive anyway ? Big mess","post_message":"***SHOULDN'T WELFARE APPLICANTS BE DRUG-TESTED LIKE EVERYONE ELSE?***"},{"comment_id":"10155768590015557","commenter_b":"Lmao they must be the fugliest bunch of prostitutes in the planet. A darn shame for whoever plugged in that","commenter_a":"I'd rather do the 5 knuckle shuffle. Gross. Just legalize it, better quality.","post_message":"'It's been a problem around here for awhile,' Reading resident says following an undercover sting that resulted in the arrests of eight women on prostitution charges. More on the story in a live report from WFMZ's Ryan Hughes on #69News at 5:30."},{"comment_id":"829662497101615","commenter_b":"prizon don't send them back , they will just return and do it again, either way we will be paying tax dollars for them so I would rather do it for them being in jail instead of welfare and what ever else obama is giving them.","commenter_a":"Now take away their real name and give them a number, prison number that is","post_message":"OBAMA’S ILLEGAL ALIENS ARRESTED IN MISSISSIPPI FOR IDENTITY THEFT! #NoAmnesty Just spread this like wildfire Dean James Americas Freedom Fighters"},{"comment_id":"10154416884633908","commenter_b":"Jesus's favorite car was a Christler.","commenter_a":"True","post_message":""},{"comment_id":"785803421556302","commenter_b":"GREAT!!! MAKE HER LIVE BY OUR LAWS!!!","commenter_a":"Yes sir jail or take that crap off , its disrespectful !!!","post_message":"Judge Throws Muslim Woman In Jail For Refusing To Remove Headscarf In Court. If you can't obey our laws, you go to jail. Do you think she had this coming?"}]
