[{"comment_id":"10153275718534726","commenter_b":"Sometimes really rebellious kids need a bad scare, and yes, they should be afraid of cops. It's societies way of dealing with bad people. It's the people that don't fear cops that I worry about.","commenter_a":"good","post_message":"@webpagelink"},{"comment_id":"10154101126057680","commenter_b":"That's why we as black folk don't claim her ass! She can take a seat over there with O.J. and Tiger Woods!","commenter_a":"She is going straight to hell for stating people will BOW DOWN to that clown. Who talks like that????? OMG! Sad part about it ... she's oh, so serious. smh This chick needs to be mentally evaluated. Clearly, the elevator doesn't reach the top floor in that screwed up head of hers. Delusional is an understatement! She is so embarrassing ... :(","post_message":"Omarosa Injured at the White House, Reportedly Rushed to the Hospital on a Stretcher"},{"comment_id":"10152924363976130","commenter_b":"I picture the admin of this page, a fat whiney crazy feminist that hates life because the wine ran out, and because a man opened a door for her.","commenter_a":"How many women believe everything that men tell them?","post_message":"\"Generally speaking, we (men) do not believe things when they're told to us by women.\""},{"comment_id":"1025373750832154","commenter_b":"@username, nope, not voting for her, either.","commenter_a":"The Trump train is full speed ahead. Get on board the Trump train. You will get run over. It is full speed ahead to making America great again. Mr. Trump for president 2016!!!!","post_message":"America is proud to stand shoulder-to-shoulder with a free & independent UK. We stand together as friends, as allies, & as a people with a shared history."},{"comment_id":"10152959541546519","commenter_b":"But it's totally cool that the white women told the black kids to go back to their Section 8 housing, right? Ugh.","commenter_a":"I truly wish people would read the whole story before commenting. This was one of 2 cops (until backup arrived) who had just been charged by dozens of young adults and teens. He has every right to fear for his safety...AND he has every right to restrain a \"kid\" who is illegally trespassing in a gated community and trying to run every chance she gets.","post_message":"This cop picked the wrong kid to harass and abuse..."},{"comment_id":"10154192939617541","commenter_b":"Agree it's the dumbing down of America....","commenter_a":"He's such a child.. name calling , whining and bullying when he doesn't get his way. That behavior is definitely not what we should expect from our president!","post_message":"Trump says \"Pocahontas is now the face of\" the Democratic party."},{"comment_id":"10152884720337217","commenter_b":"Humans suck 😕","commenter_a":"Man. The death of all animals, plants, and everything else. I swear. Smdh.","post_message":"The tiger that mauled a man to death after escaping from a flooded zoo in Georgia has been shot dead. (Footage from Georgia Ministry of Internal Affairs)"}]
