[{"comment_id":"1058949000851488","commenter_b":"Of course it would. My God you people with your guns. Enough already.","commenter_a":"None of the proposed legislation would have saved a single life... this is all political theater and a cover for the Democrat's failed foreign policy.","post_message":"Senator Chris Murphy: \"I'm mortified by today's vote, but I'm not surprised by it. We learned in the months after Sandy Hook that the NRA has a vice-like grip on this place. Even when 90% of the American public wants change.\" Full video here: @webpagelink"},{"comment_id":"1616469018618909","commenter_b":"Trending: Obama's Fault Racism Gun Violence Marines holding umbrellas Climate change (that is simultaneously not real) ISIS Al Queda Hot days Cold days Rainy days The economy Abortion rate Teen pregnancy rate Hurricanes Tsunamis Butterflies that flap their wings and cause Tsunamis Terror attacks in Paris Russia attacking Ukraine North Korea hating everyone Syrian Refugees Illegal Immigration Muslims Christians hating Muslims Cops \"fearing for their lives\" #BlackLivesMatter Fox News hatred The wealthy 1% Everyone else Fantastic Four being a horrible movie _________ Fill in the blank.","commenter_a":"I don't see how you blame our first African American president for racists coming out of the wood work.","post_message":"Barack Obama is seen as one of America's most racially polarizing presidents, numerous polls show. So will tensions ease once his term ends? #RaceAndReality"},{"comment_id":"441828512816456","commenter_b":"You're not fucking kidding.Damn sum bitches,making us all look bad.fuck them @username.I plan to fuck with them every day and at every turn without mercy.","commenter_a":"Tear them a new ass @username","post_message":"EXACTLY! CNN's Jake Tapper just SHREDDED Trump for banning them and other mainstream news outlets from the White House press briefings. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153708332298984","commenter_b":"Omg. Women bitching. Grow up","commenter_a":"i will always agree with Dana...............jan","post_message":"These woman got into a debate so intense, there was only one way for Megyn Kelly to cool them off... Do you agree with Dana Loesch?"},{"comment_id":"508999315933206","commenter_b":"Well done Doc! I too wish you had more airtime, but we that follow you know!","commenter_a":"You are my 2nd favorite candate running. Would be 1st if not for you shaking hands and smiling with Al, Sharpton! Al Sharton!!!' What good can he possibly do for you?!!!!","post_message":"A leader listens when the American people speak. Unfortunately, our stage was filled with plenty of rhetoric and shouting politicians. I want We the People to know I hear you. Although I didn’t have much time to share my common sense solutions with you on stage, I look forward to continuing my clear, concise vision with the American people as I did tonight. Even more, it’s clear that the people were listening – we gained over 100,000 friends and patriots on Facebook during the debate. I am humbled by our over 400,000 Twitter followers that made us the Most Mentioned candidate on Twitter during the debate. We the People are fighting for freedom, and tonight is proof that the American people are winning."},{"comment_id":"10154458181463128","commenter_b":"Everyone is scared in America because there are so many guns. We need commonsense gun control ASAP. We need to vote out all politicians that oppose commonsense gun reform and get this issue addressed","commenter_a":"The cop is clearly nervous as hell. His voice is cracking and his gun is shaking terribly. To me, this is proof cops just aren't trained enough to identify true threats and staying calm under extreme pressures. He shot this guy in fear. Period. He should be charged for murder. I am absolutely terrified of cops and it shouldn't be that way.","post_message":"\"Police just shot my boyfriend for no apparent reason\": A police officer fatally shot a man in a car with a woman and a child, an official said. Authorities are looking into reports that the aftermath was live-streamed on Facebook."},{"comment_id":"10154126600721770","commenter_b":"I agree....classy lady","commenter_a":"Ivanka could hop into a potato sack and make it look good.","post_message":"You couldn't miss Ivanka Trump today."}]
