[{"comment_id":"10154034476612144","commenter_b":"@username you are a freaking trumpette woman which is disgusting. Go away","commenter_a":"Journalist should ask Trump for all his business and private emails when he demands Hillary's. Then point out she has released decades of tax returns and when is he going to pony up like a real candidate. The public has no more right to Hillary's private emails than they do to Trump's.","post_message":"No one is talking about this, but Donald Trump just screwed up and admitted the truth about his taxes."},{"comment_id":"477887179066242","commenter_b":"That is so sick why would anyone want abort a unborn baby must one that already born i'll tell you who a sick mf that's who","commenter_a":"They have abortions like it's nothing, no big deal. I used to work with a woman that loudly explained to 2 co-workers how her Dr gave her some pills. She took the pills over a weekend and when she went to the bathroom the fetus fell out. I couldn't believe what I was hearing and was stunned. Made life seem cheap.","post_message":"This is INSANE...STOP THEM NOW! PLEASE SHARE TO EXPOSE THEM!"},{"comment_id":"10153883162778145","commenter_b":"Illegals cannot vote","commenter_a":"she has a point nobody likes having to pay for others but more than 50% of US citizens are on government assistance and probably all of the illegals that's why the democrats keep trying to make it easier for felons and illegals to vote , you know they will vote for the party giving stuff away","post_message":"The profanity-laden video was uploaded to YouTube and has sparked headlines and heated discussions on social media. You can watch it here:"},{"comment_id":"985606431474778","commenter_b":"@username, I understand what you're saying. I'm supporting Ben Carson for potus. But with all the voter fraud, illegals voting Hillary will be president. That scares the crap out of me.","commenter_a":"Sadly, I fear she will be our next POTUS. It's a bad, bad time in America.","post_message":"This is so sad."},{"comment_id":"1094565510598452","commenter_b":"This is what should happen to Debbie Wasserman Schultz - #PutThatWassholeInPrison","commenter_a":"More like its time for you to take what's yours. Go out on stage and be prepared to accept the nomination please. I hope you pull an FDR. I can't bear to see Clinton win after what wikileaks showed.","post_message":"In the State of New York 3 million Independent voters could not participate in the Democratic nominee. It's time for open primaries."},{"comment_id":"10152639354152093","commenter_b":"Beautiful, what breed?","commenter_a":"Zeus is a big fan of the ice! #PuppysFirstIceStorm","post_message":"Ice storms are better with your best bud… #PuppysFirstIceStorm (photo: Dawn Lankford Morton) Latest updates: @webpagelink Tuesday closings/delays: @webpagelink"},{"comment_id":"1109626375800280","commenter_b":"Yup! They are afraid of her!","commenter_a":"Hillary is a joke","post_message":"\"They are afraid of me!\" - Hillary Clinton"}]
