[{"comment_id":"10153232515139087","commenter_b":"Will she go away now?","commenter_a":"Rosa Parks, Martin Luther King, and Abe Lincoln all fought for equality. Kim Davis is trying to deny equality to people.","post_message":"Kim Davis was compared to Abraham Lincoln, Martin Luther King and Rosa Parks as she was given the \"Cost of Discipleship Award\" by the Family Research Council."},{"comment_id":"881160988599592","commenter_b":"let her keep diggin that hole","commenter_a":"Why would anyone bother to talk to her about them, they know she will just lie, lie and oh did i say this? She lies!!!","post_message":"Do you care? Clinton Camp: Nobody cares about the Hillary Clinton email scandal @webpagelink"},{"comment_id":"950976811609844","commenter_b":"Yes!!! Although these women should be considered normal size and healthy... Definitely not 'plus size'... Sick of all the labelling... How 'bout healthy, happy and active?!","commenter_a":"I don't care what anyone else thinks. I think she looks great. But I think the more important question is \"How does her personality, intelligence, etc. compare with her looks?\"","post_message":"So excited for The Official Ashley Graham Fan Page, the first \"plus-size\" model to have an ad in Sports Illustrated! AND for Robyn Lawley, who's the first \"plus-size\" Swimsuit Issue model! Here's why that's so exciting."},{"comment_id":"1746177368955196","commenter_b":"she's full of it","commenter_a":"WTF this is what she said in her tweet: For the record, my book \"Settle for More\" does not suggest Trump had any debate Qs in advance, nor do I believe that he did. -","post_message":"MEGYN's LATEST CLAIM. @webpagelink"},{"comment_id":"10153620969383352","commenter_b":"Girl people have no life!!!","commenter_a":"He's having a separate party for her idiots!!!","post_message":"CHRIS BROWN SKIPS ROYALTY'S FIRST BIRTHDAY PARTY TO BE IN MIAMI. SOURCE SAYS HE DIDN'T GET HER A GIFT OR HELP PAY FOR CHUCK E. CHEESE EITHER!"},{"comment_id":"10153036681682235","commenter_b":"You bitch I hope he shoots you right between your eyes.","commenter_a":"it is a sick movie about a truly sick man who was used by his government. Instead of treating his sickness they increased it and used it to kill.","post_message":"Fox News host gets off on killing."},{"comment_id":"10154104100243132","commenter_b":"#2. he likes ugly chicks","commenter_a":"Just be happy... The beginnings are the best!","post_message":"New year, new romance for Amy Schumer!"}]
