[{"comment_id":"1015872441856793","commenter_b":"She needs to be shown the door","commenter_a":"Go to mslsd with Rachel Madcow. Starting to look like her anyway.","post_message":"Is this the end of Megyn Kelly on Fox News?"},{"comment_id":"10153808852885950","commenter_b":"She Looks Like A Damn Meth Whore!","commenter_a":"The doctor should have never inseminated an old hag like this, i am 40 and have suffered two losses and it's so hard to adopt and this psycho bitch was allowed to keep these kids...will her doctor keep doing this and letting her have more innocent babies... Poor baby May She RIP","post_message":"The 13-day-old died inside the van where her mother had left the children for 38 minutes while she visited a cellphone store, police say."},{"comment_id":"10157442603035389","commenter_b":"Omg not shoplifting. Oh the outrage. Shut up pussy","commenter_a":"ARE YOU SHOCKED.....this from.a guy who picks katrina (reality TV star who was shop lifting ) as his spokesman and this woman has been caught several times trying to defend and excuse the lies and bogus claims he has made. THIS IS WHAT HE DOES.....THIS IS ALL ONE REALITY T.V. SHOW and you people have so much hatred and stubbornness that you allow this without question. Care for yourself more to question this man. You can hate hilarious clinton all you want, but that doesn't mean drop your guard down on trump. He will destroy the integrity of our country 10 times more. Bring Rand Paul back!","post_message":""},{"comment_id":"508257596043081","commenter_b":"His wife destroyed that college but gave herself $200k severance pay. They are crooks","commenter_a":"If Sanders were to be nominated and elected in Nov, big problem is that he has not raised money, or campaigned for, congressional Democratic candidates. In other words, Sanders will be no better off than Obama has been if he can't get enough members of Congress to pass his initiatives.","post_message":"The attacks are going to get more unhinged."},{"comment_id":"1181685188533567","commenter_b":"This picture is missing a muzzle for that big mouth!","commenter_a":"Her eye bags and pouchy cheeks disappear somewhat when her mouth is open like this. But then you see her overbite and buck teeth.","post_message":"It's happening!"},{"comment_id":"10152902121277098","commenter_b":"Do you know any white girls from the sticks? Smh!","commenter_a":"White girls from the sticks are certainly the most psychotic!","post_message":""},{"comment_id":"1772911969633181","commenter_b":"Trump says they can come back legally. Why deport them?","commenter_a":"Try this Clinton: Little girl: \" Does my family have to go back to wherever?.\" Clinton: I'm afraid you do, you see your parents are criminals.\" Little girl: \"Criminals?\" Clinton: \" Yes your parents came into this country, illegally, they broke the law.\" Little girl: My parents are criminals? Don't bad people go to jail? At school the teacher, told us you belong in jail. Is that true?: Clinton: Just like your parents, only if I get caught\" Little Girl \" Oh Clinton I want to grow up to be just like you. Circumvent the law, lie, cheat, steal. I'll vote Democrat forever.","post_message":""}]
