[{"comment_id":"687141811427171","commenter_b":"Impeach her husband and she'll go away with him!","commenter_a":"Look who's being bossy now!","post_message":"Michelle Running Campaign To Ban ‘Offensive’ Word From English Language. She has completely lost it. Do you find Michelle Obama offensive?"},{"comment_id":"10153253284026756","commenter_b":"i like to read porn not watch it as much","commenter_a":"Meanwhile, people are praising a movie about a creepy, abusive man who likes to manipulate women into believing they want to be treated like emotional and sexual slaves.","post_message":"In which the vice president manages to invade all of our personal spaces, simultaneously."},{"comment_id":"10156761367765354","commenter_b":"quit giving her the time of day!!!","commenter_a":"Who knew behind the mask was a racist cop hating jerk, I heard Kanye needs some $$$$ since you gave the black panthers so much why don't you give $$$$$ to another cop hating jerk so he can lavish Kim.","post_message":""},{"comment_id":"10154126600721770","commenter_b":"I agree....classy lady","commenter_a":"Ivanka could hop into a potato sack and make it look good.","post_message":"You couldn't miss Ivanka Trump today."},{"comment_id":"10153994398911341","commenter_b":"@username tutsis have no link to Israel,,,, Until the 60 s and the palestinian/antisemite propaganda, Palestine was considered as where the jews came from, before ww2 antisemites were shouting at jews to \" Go back to Palestine\"...","commenter_a":"6 millions zionists certainly not because a lot wanted to stay in their own country ... but after WWII ... a lot were seduced by the zionist propaganda. Holocaust was accelering factor of the zionist project already busy in the 20's and 30's with help of british, Rotschild bank and even nazi's (1933 haavara agreement)","post_message":" school education system only tells you about Anne Frank and the six million Zionists that were killed by Hitler."},{"comment_id":"10152742769151167","commenter_b":"Rihgt Michael...just another Fox News whore","commenter_a":"Speaking as a Jew, I think someone needs to kick Tarantula upside her head.","post_message":"Vile."},{"comment_id":"1788499241368226","commenter_b":"Right. She has breasts. Ducks don't have breasts.","commenter_a":"Talks like a duck... looks like a duck... acts like a duck... must be a fucking duck","post_message":"Police Forcibly Remove Woman From Ladies Restroom Because She \"Looked Like a Man\" - is this what #MakeAmericaGreatAgain looks like?"}]
