[{"comment_id":"10152888128321051","commenter_b":"Black white green. Wtf ever. Cant affort birth control. Then you can't afford kids.","commenter_a":"White women have babies too...not just black women.No-one should have children that they can't take care of,no matter what color you are!!---- i see that there are so many opinions about this post. I wasn't making this a race issue just stating my opinion.This country we call America is full of hate.We all can see this by all the name calling. It's a strange thing that some of you say it's not about race.anytime someone make a comment that doesn't support your views you call them a racist. I am not a racist i just can't stand people who continue to put my people down. I had to add these comments after i read the comments of so much hate. God made us all. The color of all our skin God made. So take your complaints to Him. It really makes me so sad that some people can treat others ...","post_message":"This state is about to ban low income single mothers from having any more children for 5 years."},{"comment_id":"10155487456986509","commenter_b":"Hillary is a baby killer.","commenter_a":"He was completely right on everything he called a disaster. The biggest disaster of all was the video proving that she and her campaign incited the violence at his rallies. Perhaps using the word rigged is an oversimplification, but for Christ's sake, she's guilty if inciting riotous behavior. Vote Trump, as middle finger to the corruption in government.","post_message":"- Aleppo - Hillary Clinton's tax plan - Obamacare ...and more things that Donald J. Trump called a \"disaster\" at the final #debate. @webpagelink"},{"comment_id":"10153759226208188","commenter_b":"At least the governors are smart!!! Get a clue Obama!","commenter_a":"Amen!!","post_message":"UPDATE - 17 states now: The Republican governors of Maine, Nebraska, Texas, Arkansas, Arizona, Indiana, Louisiana, Mississippi, Massachusetts, Ohio, North Carolina, Wisconsin, Georgia and Illinois joined their counterparts in Alabama and Michigan in saying they would no longer help settle Syrian refugees. One Democratic governor, Maggie Hassan of New Hampshire, joined them in rejecting Syrian refugees."},{"comment_id":"10153065116958984","commenter_b":"He does it for money, he don't give a damn about the Blacks on the street shooting there brothers and sisters or he would be here trying to straighten them out. But let a white or police officer doing the shooting and he will be there starting trouble. He is pregistist .","commenter_a":"This guy is a real Jackass","post_message":"Seriously Al? You must be joking... Is it about time for Al Sharpton to give it a rest?"},{"comment_id":"1025935160778053","commenter_b":"Women with body ink graffitti make excellent role models","commenter_a":"Why do you report articles from other countries like this? I'm sure if you applied yourself you could find your own sources of pathetic losers to post about.","post_message":"This welfare leech is getting $1,700 a month in benefits... and that's not the shocking thing. She had the GALL to complain about it. You know, if she's so unhappy with it, the taxpayers who provided it would be more than happy to take their money back..."},{"comment_id":"10154076651981955","commenter_b":"She needs... Wait for it... To be ARMED. That jackass would think twice about that move if she was packin a pc....cmon ladies.. Do NOT be this asshole's next victim","commenter_a":"Horrible black bastard, should be shot! 100 times!","post_message":"WARNING THIS WILL MAKE YOU FURIOUS"},{"comment_id":"1370922502927793","commenter_b":"If she could somehow flood NYC with illegal aliens then yes, she could be the next mayor.","commenter_a":"Gitmo for Life for High Treason and we aren't talking emails","post_message":"After winning New York with 1.7 million more votes than Trump, could Hillary's next move be mayor of the Big Apple?"}]
