[{"comment_id":"445713658965481","commenter_b":"Time to start rounding up these radicals. They will destroy everything","commenter_a":"Is time to retaliate! !! A good MUSLIM IS A DEAD MUSLIM. ... kill them all ......","post_message":"A Florida College Student was Brutally Attacked by Five Muslims On Patrol Enforcing Sharia Law. @webpagelink"},{"comment_id":"925264027533346","commenter_b":"So skinny women aren't real?","commenter_a":"oh look real women","post_message":"Large ladies in lingerie are No Angels"},{"comment_id":"10153782670984838","commenter_b":"Then why are they acting like children when they run around sleeping with random people getting pregnant when they don't want a baby in the first place? So yes those women are children since they don't know how to have safe sex.","commenter_a":"Absolutely ridiculous!! Women are not children.","post_message":"A bill that would impose a 24-hour waiting period on women seeking an abortion is headed to Republican Gov. Rick Scott."},{"comment_id":"1329933407046113","commenter_b":"Everything, everything she touches is corrupt.","commenter_a":"GREAT READ","post_message":"PATHETIC @webpagelink"},{"comment_id":"1085472271464242","commenter_b":"If they are on there with consent, are actually single, or are polyamorous, this breech will not hurt any relationship. But this site advertises directly to cheaters.","commenter_a":"How many users on am are there with full consent of their partners? How many are actually single? How many are polyamorous? These things you don't know, and here you are cheering on this invasion of privacy for all am users, because you don't align morally with a subset of users. This kind of punishment never goes away, and that is especially a problem for those who don't deserve it.","post_message":"Will this hack be the one to get people to care about digital privacy?"},{"comment_id":"494247850741172","commenter_b":"Good. That's all we need is illegal aliens in the military. They shouldn't even be in the country. Let them get in line......My grandparents did.","commenter_a":"As a democrat, you shouldn't give a damn whether I like it or not, as long as you got off your ass and did something without the president having to force you into passing some type of immigration bill.If you think the president did something illegal!! It's because you set on your ass and forced him to do something that he really didn't want to do.","post_message":"The final version of the legislation stripped out language that would have asked the Pentagon to consider allowing young immigrants who came to the country illegally as children to become eligible for service in the military."},{"comment_id":"10154121489376350","commenter_b":"She's wearing lipstick","commenter_a":"Can we ignore the makeup issue for a second and talk about the fact a 42-year-old just wrote a book telling us how to age? 42? Girl, you've only just begun to age, check back in your 60s and we'll talk.","post_message":"Gorgeous, Cameron Diaz!"}]
