[{"comment_id":"10153348611360950","commenter_b":"And he got arrested? For what? Bitch probably asked for it","commenter_a":"NEEDLE TIME NOW. Not 50 years later.","post_message":"Officials believe the 19-year-old suspect was upset over \"a bad breakup\" with the victim's teen daughter. Police say he confronted the mother as she was leaving her car, shot her multiple times and then went inside her home and fatally shot a dog."},{"comment_id":"1007076626015699","commenter_b":"Yes they need to hire them back and get rid of the illegals that took there place ...what needs to be done is the illegals need to be shipped out of this country we don't need them not do we want them","commenter_a":"they need to hire them back","post_message":"Trump also criticized Marco Rubio for sponsoring the \"I-Squared\" bill that would TRIPLE the number of H-1B foreign visa holders in the U.S."},{"comment_id":"10154321620193188","commenter_b":"When are women going to start taking responsibility for their choices?","commenter_a":"Does this mean @username is going to stop telling women what to do with their bodies?","post_message":"While we may disagree on specific issues, if we stop trying to control each others’ lives, those issues (for the most part) become irrelevant."},{"comment_id":"1797835747132215","commenter_b":"A nasty woman","commenter_a":"This women should never be allowed to moderate another debate ever again, she clearly has an agenda.","post_message":"At Monday’s White House press briefing, ABC’s Martha Raddatz lobbed President Obama a question designed to get him to criticize President-Elect Donald Trump. He refused to humor her request."},{"comment_id":"10155263002346162","commenter_b":"we have a lyin' idiot Donald Duck, willing to bet with any one, end of this idiot presidency we will have recession, Trump will drive our bus thru cliff","commenter_a":"How can he block news orgs from a 'press' briefing? Are they not 'the press?'","post_message":"JUST IN: White House blocks news organizations from press briefing...@webpagelink"},{"comment_id":"592725884246871","commenter_b":"She looks like the devil","commenter_a":"She is definitely easier on the eyes than the current one or the wicked witch running for pres","post_message":"Would Melania Trump be a good First Lady?"},{"comment_id":"1720672154848520","commenter_b":"@username yes I'm voting for Hillary","commenter_a":"Vote for Hillary and you're voting for corruption. Vote for Trump and you're voting to make America great again!","post_message":"'Get of the fence' and VOTE TRUMP; ' at least he's like us!' - Robert Jeffress (pastor)"}]
