[{"comment_id":"10154553926556729","commenter_b":"Shes an ugly bitch","commenter_a":"I think her and Fiorina fell out of the same tree.","post_message":"Thank you, President Obama!"},{"comment_id":"10153814451294203","commenter_b":"Rebecca shut up","commenter_a":"Nicki Minaj's dad was a financial executive. She's not exactly on Lil Kim's level. Plus she attacks Taylor swift and Miley. These kids are 10 years+ younger than her. It's a little pathetic","post_message":"\"You in videos with black men, and you bringing out black women on your stages, but you don want to know how black women feel about something that so important?\""},{"comment_id":"1076328745721469","commenter_b":"I got bafar as well","commenter_a":"Woooow @username","post_message":"This is really, really weird. Check out the explanation here: bit.ly/1bRZ7nn Via by AsapSCIENCE."},{"comment_id":"1097574603596883","commenter_b":"Lol those mother fucks love my ankles","commenter_a":"Ruben Yunv Castillo","post_message":"Why do they torment me and leave everyone else alone?!"},{"comment_id":"1776428082627538","commenter_b":"I pray to God that people who think she would be a good president, realize how wrong they are. I don't know that Trump would be good, but so far he seems better to me than her. Sadly the Libertarian candidate has too many views that are not on par with me and it is in the areas that matter most to me. Trump shares my stance on all of the issues that have come out thus far.","commenter_a":"TRUMP....you better not bail on us man. You're our only hope!!!","post_message":"Hillary Clinton Finally Tells The Truth: Pledges She Will Raise Taxes On Middle Class"},{"comment_id":"10153988549981130","commenter_b":"Why did you even read it WOMAN!?","commenter_a":"I think this tops the most pointless \"article\" I've ever read!","post_message":"Even Jay Z knew to get out of the way."},{"comment_id":"10153106076119255","commenter_b":"We have so many publications on both side that are mudslingers with out facts--about time both sides clean up their act and print thing to promote and support","commenter_a":"@username only wants to stir the pot recently!","post_message":"They were insiders. Home grown. Godly. Our neighbors, friends, and kin. People like us. By Bill Moyers"}]
