[{"comment_id":"699124226887425","commenter_b":"Bitch","commenter_a":"Show me your certificate proving you are a qualified dietitian. No? Then leave our children's lunches alone.","post_message":"Michelle has sunk to a new low...[READ BELOW]"},{"comment_id":"416198871873795","commenter_b":"I think those are pictures of women there supposed to be in capes ridiculous","commenter_a":"Why do so many pictures of ISIS soldiers depict them in clothing that would be of the worst kind for combat? Might as well give them a cape.","post_message":"ISIL’s Al-Khanssaa Brigade, an all-women fighting group, says women should only leave the house to practice medicine, teach or study religion"},{"comment_id":"1175128772557320","commenter_b":"This one nah woman?","commenter_a":"You didn't lose because you're a woman. You lost because of all the horrible things you did. Trump might have said a couple bad things, but you did many bad things. You spend our enemies money bashing him and he funded himself. I can't wait till he's in office and saying Merry Christmas is ok again and don't have to worry about offending someone for saying it. He WILL make America great again. GOD bless him.","post_message":"Scripture tells us: Let us not grow weary in doing good, for in due season, we shall reap, if we do not lose heart."},{"comment_id":"10152691933545950","commenter_b":"You look like a crooked bitch","commenter_a":"Yeah and what they are going to do give him the death penalty.....dam sure won't let him walk like they do those crooked a** cops","post_message":"A suspect has been arrested in the shooting of two police officers in Ferguson, Mo."},{"comment_id":"10153780029707232","commenter_b":"And until the punishment is worse people will keep doing it! Idiots","commenter_a":"Wow! he only got tickets.. texting and talking while driving is just like ( being under the influence) he could of killed someone.","post_message":"A driver who was texting on his cellphone crashed into a Delaware home, causing major damage, according to police. STORY HERE: @webpagelink"},{"comment_id":"1008831639165859","commenter_b":"Evil, vile woman.","commenter_a":"POS!","post_message":"Never forget..."},{"comment_id":"1240054509382884","commenter_b":"my state of AZ just paid a 3 million dollar fine to a private prison because it did not keep it filled to 97%.....they lock up undocumented immigrants for 6 months on the taxpayer dime before deporting them.","commenter_a":"When taxpayer money is given to private corporations to house prisoners we end up with the highest prison population in the world. That is not a coincidence at all. We taxpayers, the People, are paying for the subjugation and torment of a large portion of our population. Mostly a minority inmate population, I might add. It's just wrong no matter how you look at it.","post_message":"The U.S. has more people in jail than any other country on earth. To my mind, it makes a lot more sense to invest in jobs and education than in jails and incarceration. Our job: end the war on drugs, end private prisons and pass real criminal justice reform."}]
