[{"comment_id":"10153711356708188","commenter_b":"@username I completely agree. I about had a heart attack when Rand Paul supported McConnell over Bevin. I knew then that he was nothing at all like his father and he would never get my vote. This whole thing is reaffirming my belief that I should not vote Republican again. It will never self correct and I will never vote lesser of two evils again. So, now I wait for the third party candidates to get their faces out there. I hope one of them has the fervour of Trump, the Constitutionality of Ron Paul, and the knowledge and heart of Chuck Baldwin. And, no I won't even though Cruz seems to be on the right track, I won't vote for him if he remains a Republican... not that he would EVER get the nomination.","commenter_a":"Did you really need to sneak in a little attack on Rand Paul?","post_message":"Gee, let's see freedom caucus- you asked us to help you kick out the speaker of the house, then you asked us to do our homework on Daniel Webster. You told me that this is who you needed and wanted. I did. I spent hours in conversations, study and prayer because YOU ASKED ME TO. The listeners did too. I put my credibility on the line for you because you asked me to. Then you just pull out and go for the ROMNEY PICK? You told US to stand up and fight. We did. Now YOU sell us out too? Really?!?! The \"fix\" the republic needs is Paul Ryan? The man who never met a bailout he didn't like? A man who asked to be made king? 100% support and you can't vote him out? Your solution is MORE POWER FOR THE SPEAKER?!?!?!? I am quite frankly pissed and I ..."},{"comment_id":"10153606624740667","commenter_b":"How's that gun free country law working out for them now ?? President Carter band Iranian Muslims during the hostage crisis & deported over 20,000 Iranian students, Iran is a Islam Islamic nation. Democrat's never called him a racist. US immigration Laws cover religious test for immigrants !! The AR 15 is not a military assault rifle & not fit for hunting deer or elk by some hunting laws, it's a singal shot gun !! Some pistol clips holds 15 rounds of ammo !! PS: Hillary is on record in support of a wall on US Mexican border !!","commenter_a":"So sad. :(","post_message":"BREAKING: Jo Cox has died."},{"comment_id":"10156951068070725","commenter_b":"Americans will decide not illegals. Get ready for Trump.","commenter_a":"Mexicans all the way","post_message":"WOW! Great poll. Fox News just released their new GOP national poll - THANK YOU AMERICA! Lets MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153473976261438","commenter_b":"Shut the fuck up attention whore","commenter_a":"Trump for president. Enough is enough, its time to get tough. Make America great again.","post_message":"What if Trump's polling ceiling is much higher than we thought?"},{"comment_id":"1032739630099842","commenter_b":"Bigotry must be confronted every time it raises it's ugly head. Shamefull Republicans","commenter_a":"Newsflash! Only God can judge. These so-called phony 'christians' will go to hell before anyone else....","post_message":"A Florida church and anti-gay pastor saw a quick backlash from residents of the community after putting up a hateful anti-gay sign."},{"comment_id":"373714942816800","commenter_b":"these two remind me of demons..... boy are they in for a surprise on judgement day... I will pray for them.........they are so misguided........","commenter_a":"It is my understanding that there are some Seal team guys in the middle east that would like these guys to come and visit....and they will be glad to indoctrinate you about how things work in their part of the world...please make a reservation as soon as possible.","post_message":"Bill Maher joins Michael Moore in the war against Chris Kyle..."},{"comment_id":"863341973762056","commenter_b":"It's not s scheduled White House speech. It's an impromptu get together organized by Boehner.","commenter_a":"I can't wait until the Republicans find out the Benjamin Netanyahu is not a Christian.","post_message":"Dozens of Democrats are skipping Netanyahu's speech -- including Senator Elizabeth Warren."}]
