[{"comment_id":"10152789526371130","commenter_b":"I think her father is a proud lesbian.","commenter_a":"well this little girl is just over the top.. do you think her father is proud? I think not..","post_message":"\"I've been pegged with the word insensitivity. It's just how I've been sensitized and the tone I chose.\""},{"comment_id":"10153410983047787","commenter_b":"@username, she is an idiot!","commenter_a":"You are an idiot. Climate change causes prostitution I have never heard such a stupid coment.","post_message":"Diversity is our nation’s greatest strength – our currency should reflect that. I’m so glad that the Treasury Department agrees! Which shero would you like to see on #TheNew10?"},{"comment_id":"10153203503306130","commenter_b":"Funny how people attack Obama's character then defend this guy, it's very revealing really.","commenter_a":"Donald Trump scares you because he'll take away all your free stuff! Donald Trump scares you because he believes in working hard to get what you need, what you want. He will fix America and you will continue to whine and cry about your \"entitlements\" being taken away! Suck it up and go to work America!","post_message":"See a map of the world through The Donald’s eyes."},{"comment_id":"1272474692787949","commenter_b":"She looks very ill, mentally, emotionally, physically and spiritually.","commenter_a":"Fuckin mental!","post_message":"WHY. WON'T. YOU. LEAVE? You're like that nasty drunk chick who won't leave the party after it's OVER."},{"comment_id":"10153365714833352","commenter_b":"Stupid bitch!","commenter_a":"Mental illness is real...","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"10153128873081051","commenter_b":"What a crazy bitch that is","commenter_a":"Some people shouldn't be allowed to breed.","post_message":"This man was worried when his girlfriend took off with their baby, but he tried to remain calm. Then he noticed the text messages she had sent him. That's when restraint went out the window and he called 911."},{"comment_id":"1152822888099590","commenter_b":"Hillary is a liar, a cheat and cares more about money then Americans.","commenter_a":"Another embarrassment p***y grabber to the country...","post_message":"JUST IN: Donald Trump Jr. will be speaking at ASU on Thursday at 2 p.m. MORE: @webpagelink"}]
