[{"comment_id":"10153575411863132","commenter_b":"I don't think she did either...","commenter_a":"I Don't believe she killed him...he was negligible to wearing proper gear... he took a big chance and lost his life... just plain STUPID! Shame :(","post_message":"\"I certainly would not be out on the Hudson River in 47-degree water without a dry suit on, that's asking for trouble.\""},{"comment_id":"703541823169729","commenter_b":"Both of the girls always look miserable !","commenter_a":"You tell a bunch of things that aren't true . Please people","post_message":"Malia Obama at the center of damning White House scandal. The whole family is a disgrace. This is ridiculous. Do you think the Obama family is the worst presidential family in history?"},{"comment_id":"10157948531130206","commenter_b":"Lol now only Muslim men beat their girlfriends???? Come on all races n religions of coward men beat n sometimes even murder their wives/girlfriends. Sorry this happened to you. But plz don't try to make it sound like he beat u only cuz he was Muslim......","commenter_a":"This is just sad. I use to have a muslim boyfriend who would always hit me and I left him faster than a rocket ship.","post_message":"Qandeel Baloch was known for her raunchy social media posts that challenged social norms in Pakistan."},{"comment_id":"10153771956525428","commenter_b":"@username He is beholden to we the people and he just said he isn't showing up for his interview..","commenter_a":"Trump just lost the election skipping debate.","post_message":"What is the meaning behind Trump long-lasting surge in the polls?"},{"comment_id":"10153364221881336","commenter_b":"Hey, when you choose to try to make your family into some kind of viral internet sensation, be prepared for the backlash.","commenter_a":"Hahah I think it's cute","post_message":"Did these parents take their family photo shoot too far?"},{"comment_id":"10152944029886316","commenter_b":"Well that settles it, she paid $600.00 for that?","commenter_a":"no no","post_message":"In recent days, Hillary forces half a department store to shut down just so she could get a $600 haircut in a luxury salon, even as she refuses to engage the very public she is trying to convince to vote for her for president: @webpagelink"},{"comment_id":"10154375998138145","commenter_b":"Some women get pregnant and have babies only to blackmail the father of the baby . 5 min sex with a crazy chick get you scrued for lifetime","commenter_a":"REVOKE her parent card!!! right now before anything happens to that baby. I will gladly adopt","post_message":"She got 2 months in jail, but could have faced 5 years in prison. The baby now lives with his grandmother."}]
