[{"comment_id":"10153310405423352","commenter_b":"Girl that's me","commenter_a":"I'm my own team.. Fuck that, once u have a kids, a career and a life them damn friends ain't shit... I'll kick it with all the damn kids","post_message":"Atlanta Woman Says She Was Set Up By Her Bestfriends Who Beat Her And Held Her Hostage For Hours (VIDEO) Be careful who you consider your \"friends\"...So sad, they literally left her for dead."},{"comment_id":"10153123243420950","commenter_b":"Love that show!","commenter_a":" and still my favorite show","post_message":"Betty White is the lone survivor of the cast; RIP Bea Arthur, who played sensible Dorothy Zbornak, Estelle Getty, who portrayed Dorothy's mother Sophia Petrillo, and Rue McClanahan, who played the sultry Blanche Devereaux. The show lives on, though."},{"comment_id":"10153844148480579","commenter_b":"Only when they try to use it as the basis of their platform or legislation. Then it is a big negative.","commenter_a":"Media Silent As Muslims Ethnically Cleanse 60,000 Christians In Philippines By: Daniel Greenfield When thousands of Muslims become refugees, then you can’t get the media to shut up about it for weeks. Thousands of Muslim migrants... jewsnews.co.il","post_message":"Do you consider religion when evaluating a candidate?"},{"comment_id":"1753089554908587","commenter_b":"Race has nothing to do with him being a dumbass.","commenter_a":"and he owes over 10.000.000 to creditors in US","post_message":"Kanye West is finally leaving. Thank the lord. We don't want him anyway. Can we get 5,000 'LIKES' to have Kanye leave for good!"},{"comment_id":"10155110249450294","commenter_b":"She got caught in the moment ... She looks like she's on drugs!!! This b!tch ain't news worthy...","commenter_a":"I saw it also and I took it that she was comforting her BF and they were both distressed about what just happened in the game. I remember it was a tense time","post_message":"Ohio State Buckeyes won the game ... but here's the six seconds from last night's Sugar Bowl that everyone is talking about today. What is happening in this video?!"},{"comment_id":"1220297847993003","commenter_b":"174742062548592helle Simons, she had the ability to dispense medicine to stop their suffering and didn't. That makes her a monster.","commenter_a":"I think this article is written very poorly and from a single minded view . Being Saint does not mean that you are perfect as no one is . It means you have strived all their lives to fulfill Christ mission and to serve God . If you don't believe in the church values and mission then why do you care who we canonize? Also when it comes to caring for people with a large organization things are much more complicated . There are many people who max out on pain killers and still feel pain in the hospitals. So when it comes to pain meds that are very valuable and they may not work why administer them ? In places like Calcutta it is not just a question of money but also transportation . They in fact hold more money then they need to but I very well doubt ...","post_message":"Is Mother Teresa a saint or an expertly-managed brand?"},{"comment_id":"902972626429153","commenter_b":"This has nothing to do with muslims.Shut up!","commenter_a":"give muslims a planet and they'd still not be satisfied","post_message":"The barbarism continues"}]
