[{"comment_id":"1295671170453891","commenter_b":"@username they danced!!!","commenter_a":"Winner eats the loser....","post_message":"Yes. Dinosaurs danced."},{"comment_id":"904790836280638","commenter_b":"Absolutely","commenter_a":"Obama care","post_message":"What's fair is fair! Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"410359492488277","commenter_b":"It's simple women why treat guys like crap then want to be with him poor guy didn't get none for years and this happen f all the women in the world cause if he look like Enrique Iglesias you will give it to him if he was in the street another story","commenter_a":"10 year in jail for him, at this age, is life imprisonment.","post_message":"If convicted, Bill Cosby faces up to 10 years in jail and a $25,000 fine."},{"comment_id":"1789421224648085","commenter_b":"Ohio RED","commenter_a":"Trump 2016 #MAGA vote","post_message":"Donald Trump rallies at Michigan"},{"comment_id":"892287504157347","commenter_b":"America is lost. We haven't won a war since 1945. When did it start? November 1950 when the American X Corps retreated from North Korea during the Battle of Chosin Reservoir. It was spun as a victory. Look who owns North Korea today. Yes! We lost. Harry S Truman was our Democrat president. We are losing peeps! You are getting your welfare checks, but for how much longer? We have aborted away our labor and armed forces. We are importing Islamic labor. (LOL!) Remember this date: 27 November 1950. It's the date the Chinese crossed the Yalu River and began our long, slow decline ...","commenter_a":"if they want to fly their flag go back to your own country, this is America their is only one flag and that is the American flag","post_message":"If the NAACP can have the Confederate flag, which is part of the heritage of THIS country, taken down in places coast to coast, should flags that belong to other nation´s cultures be allowed if they cause strife? Read More: @webpagelink"},{"comment_id":"1064358433623633","commenter_b":"TRUMP GO back TO Hell","commenter_a":"Can these idiots be any more reprehensible?! The Repugs care only about the top 1%.","post_message":"The right's hostility toward the working poor is now front and center."},{"comment_id":"602171783246943","commenter_b":"I think he is a prick he makeing the country he inn charge with killing off his own people as black. And look at what they saying on here about him he needs to send two b52 bombers and carpet bomb all these evil peope o. Here calling him names lol","commenter_a":"I'm ready!","post_message":"\"The American People must be willing to call Barack Obama what He is in order to Defeat Him\""}]
