[{"comment_id":"10153387791927690","commenter_b":"Amen. If another female in heat walked by, he'd have been on it. He's safe now. But if both had been fixed, neither would have been out by the road.","commenter_a":"Dogs are indeed wonderful. This is a sad story and an all too common story. However, as is the case in many of these sad stories, the male gets loose to chase a female that is in heat. She gets hit by a car and he refuses to leave her side , not because they were best friends or because he is a loyal friend, but rather because he is fixated on the female in heat. The moral of this sad story should be to have your dogs fixed.","post_message":"A heart-wrenching photo tells the story of a loyal dog found by his friend side Sunday morning in Dallas: @webpagelink"},{"comment_id":"10156550543770389","commenter_b":"Tonya I thought you were referring to refugees especially Syrian ones. My mistake. Sanctuary cities are liberal ridiculousness and need to stop. I don't agree with them at all. I see what you mean about a major delay.","commenter_a":"I am amazed at how Christians can look at Trump and Cruz and not see that Cruz is clearly the choice for POTUS. 'By their fruits you will know them', Matt. 7:16. Very disappointed with Sara Palin and Rev. Falwell; they should know better.","post_message":"Question of the Day: Which Republican do you think will be the best candidate for evangelicals?"},{"comment_id":"943180705778182","commenter_b":"It's a ROCKET SHIP.... Feel the Bernie Ship!","commenter_a":"All I can say is Wow","post_message":"Bernie Sanders closes in on Hillary Clinton in a big way in this \"shocking\" new New Hampshire poll. Watch more here: @webpagelink"},{"comment_id":"10153676106271636","commenter_b":"Jaysus.. its 2016 and still people believe this is real... all the people in these prank videos are in on it... are we just going to ignore that? And for the record I have seen tons of videos of girls clipping guys' crotches with paperclips and pouring hot sauce over them in the name of prank .. these videos are cutely dubbed \"bf/gf pranks\" what the hell?","commenter_a":"What a F**CKING idiot...","post_message":"It's been branded misogynistic"},{"comment_id":"10153134052206770","commenter_b":"They haven't earned my country or my freedoms. Let them go back and earn them in their own country. We did.","commenter_a":"Scold the 57-58 Arab nations who REFUSE to take ANY. There must be some reason they're so adamant we'd be fools not to follow their led. And stupid to be swyed by a hoard of malcontents. Have yo shown ANY appreciation to those countries who have given you free access A RESOUNDING NO. That Homeland Security is aware of the risks, and still continues is disgraceful.","post_message":"The largest Arab American civil rights organization in the United States is alarmed because 31 state governors have said they will refuse entry to Syrian refugees in their states."},{"comment_id":"1266833826777136","commenter_b":"I think this is the only remaining British cultural heritage??it should be nurtured and taken good care of.","commenter_a":"It's ceremonial !","post_message":"The campaign's gaining thousands of supporters"},{"comment_id":"10153631849906770","commenter_b":"I can't stand her","commenter_a":"That is why lying Hillary and Obama likes her. They are all LIARS!!!!","post_message":"Rep. Trey Gowdy blasted Attorney General Loretta Lynch on Wednesday, arguing her testimony before Congress was \"a total waste of time and a total disservice to my fellow citizens."}]
