[{"comment_id":"10152910071581130","commenter_b":"@username, cry me a River. You don't see that those women keep on having babies that they can't take care of and are sold into prostitution. Oh, but im wrong for believing in controlling the problem. And no bitch, I got my tubes cut and burned, because I dont believe in having more then what I can take care of.","commenter_a":"Since they don't have protection & clearly can't afford children why not find alternatives to intercourse? Or maybe idk use some self control & abstain from sex altogether? They are consenting adult women fully aware of the possible outcome/consequences of their choices. Only people I feel sorry for are those babies born into a piss poor life because they have SELFISH parents.","post_message":"“Sharing a bed is fine, it’s okay to share and be all together. But it’s tough because what if the person next to you is sick? What if they pass that illness on to you and your baby?”"},{"comment_id":"1168788129800109","commenter_b":"******TRUMP..... 2016 **** DESTROY ISLAM AMEN....pass the ammo \"SWIPER NO SWIPING\" *no illegals voting Quote..DORA THE EXPLORER *BLACK LIVES MuRDER ...jokes","commenter_a":"Lol She should have to wear a lie detector at all time....that zaps her when she fibbs","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"1004293156333603","commenter_b":"Truth hurts if ou weren't an illegal you wouldn't have taken offense.","commenter_a":"Keep them out the US we have enough problems with illegals already. Deadbeats sucking the economy dry","post_message":"This year, nearly 200,000 people have landed on Greek shores, another 110,000 have arrived by sea to Italy and more than 120,000 by land to Hungary. Germany has just announced that it expects to receive 800,000 asylum applications in 2015."},{"comment_id":"1242932969112927","commenter_b":"shes a nigga","commenter_a":"the origin of dream locks is india; not africa, not jamaica, not america. that girl is ignorant.","post_message":"Black student filmed confronting white student because of his hairstyle"},{"comment_id":"10155041928809187","commenter_b":"Good please for ICE to pick up a bunch of illegals.","commenter_a":"i wish mexico would close its borders an treat american they way they treat illegal just for one day","post_message":"We are Live outside City Hall, where protesters are rallying as part of a nationwide demonstration called 'A Day Without Immigrants' to speak out against recent ICE crackdowns, and showing the impact that immigrants have on the community."},{"comment_id":"10153199547146130","commenter_b":"Woman in front of the man is just perfect though.","commenter_a":"I noticed. I hated the woman behind the man. And her stupid hair cut.","post_message":"We can't believe we never noticed this before."},{"comment_id":"10153070699666028","commenter_b":"Cuz ur DUMB","commenter_a":"No vote here !!!!","post_message":"\"I have a great relationship with the Mexican people\": Donald Trump tells NBC in an interview that \"there's nothing to apologize for\" regarding his comments made about Mexican immigrants last month. He says he believes he will win the Latino vote. \"I will create jobs and the Latinos will have jobs that they don't have right now. And I will win that vote.\" @webpagelink"}]
