[{"comment_id":"564066700424981","commenter_b":"She's a cunt.","commenter_a":"Please, it's time to serve her!","post_message":"It's about time!"},{"comment_id":"10154496837959170","commenter_b":"Only LAZY UNEDUCATED PEOPLE BELIEVE IN A LYING WHITE WOMAN-hillary.","commenter_a":"BOOM killary!","post_message":"Hillary promises to continue Obama's economic policies. The latest results of those policies came out this morning. Splat!"},{"comment_id":"1661010187498580","commenter_b":"Don't forget Texas borders!","commenter_a":"Focus now on what is at hand Mr. Trump. Put an end to ISIS, erect that wall, and focus on Florida and Canadian borders, lastly boost our economy. You have mentioned these 3 things before which garnered my attention, then my vote. Just give more ways of getting this done. Oh, hate to throw this in but there may be a few executive orders that need immediate attention! TRUMP 2016!","post_message":"Remember, I am self-funding my campaign, the only one in either party. I'm not controlled by lobbyists or special interests-only the U.S.A.!"},{"comment_id":"10154480088981636","commenter_b":"female subjugation, taught from birth, how disgusting","commenter_a":"I hope they wear something to let people know they are the police","post_message":"Brilliant"},{"comment_id":"10153984867744411","commenter_b":"Saul Mendoza See, even Muslims know that Rapefugees are invaders","commenter_a":"Something is wrong as a muslim i am starting to realize people crossing borders easily are not refugees they are actually invaders , strict action must be taken to control borders","post_message":"Some 20,000 commuters travel from Denmark to Sweden every day"},{"comment_id":"1162763547153229","commenter_b":"Betty White Anyone born after 1507 in America is a NATIVE AMERICAN... Those born before 1507 were not NATIVE AMERICANS.. This land mass was not named America until 1507... So Betty White, you are a NATIVE AMERICAN if you were born in America..","commenter_a":"Iwelcome to America, Ahmad Al-Abboud. I hope you, like many refugees, find the American dream!","post_message":"Ahmad al-Abboud, a Syrian refugee who recently relocated to Kansas City, discusses his harrowing ordeal. Watch more: @webpagelink"},{"comment_id":"10153807891284062","commenter_b":"He served our country well and is our Founding Father.","commenter_a":"Only one problem with having to be a dead president. Ben Franklin was never president.","post_message":"Which of these women would you like to see on the $20, if any?"}]
