[{"comment_id":"10157601256035594","commenter_b":"I don't know who you are hanging out with but you should protect your pussy...","commenter_a":"Hillary calls Trump supporters deplorable... yet a Hillary supporter does this, this disgusting attempt at a 'protest'. This is more foul than the WORDS Trump spoke.","post_message":"“Dear Mr. Trump, I’m not able to mail you my actual p----, so I’ve included the next best thing. Cheers, Emily.”"},{"comment_id":"1766321223645256","commenter_b":"If you are gay why are you voting for Hillary when she wants to bring in millions of refugees that believe gays should be executed? If you are Black, why are you voting for Hillary when she defends Planned Parenthood and admires Margaret Sanger, who wanted to abort as many black babies as possible and exterminate the black race because they are like \"weeds.\" Most of those clinics are in Black neighborhoods. If you are a Woman, how can you vote for Hillary when she has buried all of Bill's rape victims under the rug. As an attorney, Hillary also defended the rapist of a 12-year old girl and laughed about it later. She plays the woman-card and acts entitled; implying that she deserves your vote merely because of her sex. How is that gender neutral? If you have are a Miner, Steelworker or have a Factory job, why are ...","commenter_a":"He did not say because of how they prey! This is Dem spin! KILLARY only is concerned with illegals and refugee''s Get that big dem base full of those needing your handouts!! Does not matter if some want to kill us Really our money, but once it get to DC it's their money!! Her motto should be just give me your I WILL MAKE THE DEMOCRATS!!!! This country is going down fast!! Bombings, beheading, murders etc And our president is worried about where someone should PEE !! Big world leader! OBAMA A TOTAL JOKE!!","post_message":"\"In this great nation, where our founders put a fundamental principle forward of religious freedom, [Donald J. Trump] says ban all Muslims, don't let certain people into our America because of how they pray.\" What do you think of Sen. Cory Booker's comments about Donald Trump at the #DNC?"},{"comment_id":"10153724479619614","commenter_b":"i hope that women go to jail for murder","commenter_a":"This person is not even human. She is garbage","post_message":"A New York woman who once worked for child protective services is accused of throwing her newborn daughter to her death from a seventh-floor window. Officials say the baby, her umbilical cord still attached, was alive when she was tossed from the building. Jennifer Berry, 33, was charged Tuesday with second-degree murder and manslaughter. The medical examiner says the little girl died from multiple blunt-force injuries consistent with a fall. Read KTLA's story here: @webpagelink"},{"comment_id":"1409547482430213","commenter_b":"I will cut that bee-och","commenter_a":"And your boo Jennifer","post_message":"WE CANNOT HANDLE THIS."},{"comment_id":"10154056167770329","commenter_b":"For Christ's sake lady give it a rest!!! Please get yourself fixed and do my reproduce we don't anymore people like you. And if you've already reproduced I pray for your children. Now kindly fuck off and go find someone else to annoy. Seriously anyone else. The other girl got the message why can't you??","commenter_a":"So stupid. Blackface doesn't make someone racist.","post_message":"IMPORTANT REMINDER: It's never okay to wear blackface!"},{"comment_id":"10153246663015950","commenter_b":"Only in America . Keep the girl scouts all girls and leave the boys alone . If the girls want to do the same stuff as the boys do then create your own stuff for girls only .","commenter_a":"Boy Scouts are so much more organized with better opportunities, I don't blame them one bit! As an adult involved in both, I'd much prefer to be a Boy Scout! Girl Scouts of America need to get their crap together.","post_message":"A group of girls decided they were more interested in what the boys were doing. So, they quit Girl Scouts and started participating in activities alongside a local Boy Scout troop. Now they're fighting to prove they can do the same things boys can."},{"comment_id":"1044884802218658","commenter_b":"exactly...if they don't want to procreate, they get it from somewhere else...LOL","commenter_a":"Now wait a minute! I thought they only had sex to procreate!","post_message":"Finally! A \"Christian\" guide to dealing with the \"sexual immorality\" of a wife refusing to give her husband sex-on-demand without a \"legitimate\" physical or mental health reason!"}]
