[{"comment_id":"995560767160480","commenter_b":"Why should he not? The more knowledegable of us that bother to read and comprehend what we read knows full well obummer's allegiance is with his muslim homeland.","commenter_a":"The tyranny in this country almost makes everyone speechless Wake up America Hillary is just an extension of Obama policies","post_message":"Not only did this Syrian immigrant cheer 9/11, in April 2013 she told me to \"go fuc k yourself\" after I called the Boston bombing jihad. This is who Obama assigns to keep us safe. Who is going to keep us safe from this savage?"},{"comment_id":"10153573991208132","commenter_b":"Officer Donahue is a true hero","commenter_a":"My cat Quacks too!","post_message":"So. Many. Feelings."},{"comment_id":"10154038920644091","commenter_b":"Ladies! Do your thang...","commenter_a":"he can save me any day. 😍","post_message":"One thankful New Yorker expressed his gratitude to the NYPD and New York City Fire Department (FDNY) with free coffee and treats."},{"comment_id":"10153758333227217","commenter_b":"A loose federation or republic please girls. also please get rid of our constitutional monarchy.","commenter_a":"Oh No nae anither ane","post_message":"Will there be a second referendum on Scottish independence? \"As far as I'm concerned, the Scottish people had their vote - they voted in 2014 - and a very clear message came through,\" says new PM Theresa May. #Indyref2"},{"comment_id":"806491062782835","commenter_b":"Its funny the democratic party started the Confederate nation and fought to keep slavery. Robert byrd retired in 2010 a Democrat longest serving politician in history and was active member of the klan. Imagine all yhr bills he voted on due to his racist views. Alot of the Democrats knew he was a klan member and said nothing. Pull some ones opinions off line and use them to your benefits but truth is your being lied to but 99% of politicians and the first to speak up you all attack.lol just like o malley saying all lives matter and Democrats attacked him for that. Yet alone he is democrat himself. Get it through your heads we are done with the hypocrits and lies and political correctness","commenter_a":"Can someone please explain to me who they are polling to get Trump in the lead?","post_message":"And yes, it's really his number."},{"comment_id":"1778494812377732","commenter_b":"@username, so your point will be valid according to the justifications of the San Bernardino and Paris Massacre victims and their families? How much more American people must die before you realize even 1 terrorist is unacceptable for the sacrifice of our lives just to be nice to foreigners?","commenter_a":"Does anyone remember FDR's ban on Japanese and Jimmy Carter's ban on Iranians? Oh, and they were both Democrats, but Trump is being compared to Hitler for suggesting we ban Muslims. Funny how that works.","post_message":"Skyscrapers. Music. Athletics. Comedy. The list goes on and on ... After Donald J. Trump's recent controversial remarks, here's a look at the United States without the influences of Muslims."},{"comment_id":"10154717771869657","commenter_b":"Moving forward..and having some fun goes along way..Go Trump!! Trump Up!!","commenter_a":"Lol","post_message":"Whiplash."}]
