[{"comment_id":"10153625218767464","commenter_b":"That was their land. The other middle eastern countries opened their jails and put those people there to taunt Israel. Know your history if you're going to insult a Nation using their systemic slaughter as a punch line.","commenter_a":"The genocide of the Jews does not justify hem killing the Palestinians. What's the difference between a cow and the Holocaust? You can't milk a cow for 70 years.","post_message":"I'm proud to stand with PM Benjamin Netanyahu - בנימין נתניהו and the nation of Israel. LIKE if you are too!"},{"comment_id":"10154721377651320","commenter_b":"Don't forget Al Sharpton hanging there too.. shes a joke!","commenter_a":"Really ? So how do you handle having Jay Z in the Whitehouse with the crap that comes out of his mouth that he makes money off. Shaken to your bones ?","post_message":"Thoughts?"},{"comment_id":"10153988463481077","commenter_b":"If this is true, shame on her! She should be charged too!","commenter_a":"So she knew about it before it happened?","post_message":"Mateen's current wife told the FBI that she was with him when he bought ammunition and a holster, and that she once drove him to Pulse because he wanted to scope it out."},{"comment_id":"10153446505791130","commenter_b":"I prefer the Wicked Witch is dead!","commenter_a":"Olha, Fer Montano!","post_message":"A songwriting expert reveals the reason."},{"comment_id":"10154063535716813","commenter_b":"Can I grab your pussy?","commenter_a":"I am so grateful for the @username and it's willingness to take a stand. I don't always agree with it's position, but I am always thankful for its existence and its hard work.","post_message":"ACLU Legal Director David Cole's closing remarks at Sen. Jeff Sessions’ confirmation hearing for attorney general. \"If someone applying to intern for one of your offices had as many questions in his record as Sen. Sessions has: racist comments, unethical conduct, padding of his resume, you would not hire him — absent the most thorough investigation and inquiry, if then. Sen. Sessions is not seeking to be an intern. He’s nominated to be the most powerful law enforcement officer in the nation.\""},{"comment_id":"10152998486166680","commenter_b":"BRAVO TO TRUMP!!!! We LOVE your IMMIGRATION POLICY!!! But, you \"must\" repeal the 1965 Immigration Policy to make sure things go back to normal!! Those who use the \"RACE CARD\" and cll names are really part of the problem!! Place them on \"BLOCK\"!! Of course they will rant and scream racism, because that is the very tool and threat they use that they are so used to getting their own way with! THEY are also destroying this Country! What is unconstitutional is what is being done NOW! Deporting ILLEGALS is the LAW!!! The LEFT are out in droves to slander, to name call, to label, to smear, to relentlessly attack all supporters of Trump and anyone else who is trying to save this Country!","commenter_a":"2016 TRUMP FOR PRESIDENT 2016","post_message":"Donald J. Trump's three-principle plan: “1. A nation without borders is not a nation. There must be a wall across the southern border. 2. A nation without laws is not a nation. Laws passed in accordance with our Constitutional system of government must be enforced. 3. A nation that does not serve its own citizens is not a nation. Any immigration plan must improve jobs, wages and security for all Americans.”"},{"comment_id":"1015033255223089","commenter_b":"Tariq doesn't represent the real moderate Islam at all! I am Muslim and I do advocate humans rights no matter what sexuality, religion or colour they are","commenter_a":"I dont like ISIS but they did a very good job by killing the gay... Same sex is not permitted in any Heavenly Religion","post_message":"Blindfolded, bound and brutally murdered"}]
