[{"comment_id":"10153955448341350","commenter_b":"She's a cold, calculating bitch.","commenter_a":"From her big warm embracing feminine heart ... are you kidding me? Voting for Hillary because she is a woman, makes no sense at all.","post_message":"\"I want my president of the United States to make decisions on my behalf based on her experience, her command, her intelligence, and from her big, warm, embracing, feminine heart.\""},{"comment_id":"693773307470374","commenter_b":"What a pig!!!","commenter_a":"Disgusting, just like his jackass friend! I guess that's how money talks.","post_message":"SPEECHLESS."},{"comment_id":"10153081460312235","commenter_b":"All depends on version and translation","commenter_a":"Guess they didn't make it on the ark ;)","post_message":"If they are in the Bible, they have to be for real. End of story."},{"comment_id":"491909840999596","commenter_b":"These are dangerous ragheads. I say,get them out if our country","commenter_a":"They want muslims areas fine we should have MORE NON-muslims areas!","post_message":"A Texas shopping center posted a sign that have Muslims outraged. It's about time someone stood up to them, we support them. Do you support their stand against Muslims?"},{"comment_id":"10153218783658869","commenter_b":"No inspired because I do not look up to her.","commenter_a":"Antes de ver a una mujer en la Casa Blanca, la clase política americana es capaz de buscar lo inexistente, y si hay hay que crearlo, de crea.","post_message":"Hillary Clinton cannot appear too strong without risking her likability ratings; she cannot appear too vulnerable without her credibility suffering. Herein lies her dilemma."},{"comment_id":"904059146360453","commenter_b":"She is earning her check! hahahahha WTF! I just can't with this crazy woman!","commenter_a":"Maybe she's trying to help Hilary??","post_message":"Donald J. Trump campaign manager Kellyanne Conway said she wished her candidate had more opportunities to debate and would \"be willing to do another one if somehow they can squeeze it in.\""},{"comment_id":"10152543335115933","commenter_b":"Amen!!","commenter_a":"Leave our kids alone! GET RID OF COMMON CORE!","post_message":"It's about time we get college costs under control, and I'm glad to have Ohio's college and university presidents on board as we move to make it happen."}]
