[{"comment_id":"10155858980760354","commenter_b":"Bitch has no morals !","commenter_a":"Do the world a favor and stop breathing!!!!!!!!","post_message":"Really?"},{"comment_id":"10156094611905354","commenter_b":"I hate that shit eatin' grin he gets after he's screwed us one more time. I'll be so glad when we don't have to look at his ugly mug and that bitch he is married to.","commenter_a":"That slimy weasel traitor grin makes me sick.","post_message":"Congrats, Democrats. You will soon own it now and forever."},{"comment_id":"10154344335198181","commenter_b":"And the public has every right to show their displeasure by not supporting a corrupt regime...","commenter_a":"He's stupid","post_message":"The White House Press Secretary Sean Spicer on Pres. Donald J. Trump's tweet criticizing Nordstrom after decision to no longer carry Ivanka Trump's clothing brand: \"This was less about his family's business than an attack on his daughter.\" @webpagelink"},{"comment_id":"963311450392051","commenter_b":"WILL MR. TRUMP STAY AHEAD ?! - @webpagelink","commenter_a":"Iiar liar pantsuit on fire.","post_message":"Hillary has been a champion for everyday families her whole life. That's why she's running for president."},{"comment_id":"10154070918229330","commenter_b":"And that moron idiot Trump??? His posture is dangerous.... Anyone who thinks otherwise is misinformed and reckless, to say the least","commenter_a":"MY TWO CENTS - To all the people who love politics. I can’t predict the future but let’s take a hypothetical in which Donald Trump is the presumptive nominee. Let’s take it one step further and say for this narrative that he runs against Hillary Clinton. I think the race to be POTUS will be close, and irrespective of who wins, can you imagine of what Donald Trump is going to do with all the dirt on Hillary Clinton. She and her husband amassed a 200 million dollar fortune while in political office. If they both worked their entire lives for the government, they couldn’t make that kind of money, let alone have it in the bank. That didn’t go unnoticed. She got a $650,000 for a 45 minute speech from a “bank,” but swears she will kick their butts to the curb (yeah right). Her email server was used ...","post_message":"Nearly 8,000 people are expected to gather at the Convention Center when Donald Trump makes his way to Hartford tonight. @webpagelink"},{"comment_id":"10155165115483010","commenter_b":"Preach it lady!","commenter_a":"It's the parking lots and the teenagers. I don't care to fight with people vying for a parking spot or those backing out without looking and those who think they can drive at freeway speed in a parking lot. The kids! I know they love to hang out where they can see and be seen, but I don't like their fresh mouths and their \"It's all about me\" attitudes. Their parents didn't teach them how to be respectful.","post_message":"Department stores are struggling."},{"comment_id":"1303184443111138","commenter_b":"People check when you read this and other comments if your name is being used factilously by the Republican party to make statements in your name for Don the Con. Please watch.","commenter_a":"You sound like school children arguing on a playground. Little school children. This is what you got from the first presidential debate. Hillary did not do well if all you have to talk about is her accusation that Trump called some woman miss piggy.","post_message":"\"If any women was about to let go anything that he said in the past, this is not going to be it.\" - Morning Joe's Mika Brzezinski reacts to Donald J. Trump's remarks about ex-Miss Universe Alicia Machado's weight"}]
