[{"comment_id":"428518377308118","commenter_b":"Please don't breed.","commenter_a":"But what if I just want to pee in the girls bathroom? You mean my behavior and emotions don't drive the judicial system? #keepyourdick","post_message":"In 19 countries in Europe, transgender people are forced to undergo surgery and sterilization in order to legally change their gender."},{"comment_id":"1760085394239423","commenter_b":"Is there anything we can actually wear without people and animals being exploited ???","commenter_a":"LETS CONTINUE SPREADING THIS PLEASE!!! IS OUR RESPONSABILITY TO STOP IT!","post_message":"BREAKING VICTORY! UNITED COLORS OF BENETTON announced they will BAN ANGORA after just 24 HOURS into #PETA campaign: @webpagelink THIS is why you should care."},{"comment_id":"1163296670367051","commenter_b":"Oooooo","commenter_a":"@username @username ummm they airways served alcohol. Unless they are talking about Webster","post_message":"Chuck E. Cheese's: Where a mom can be a mom! The family-friendly chain is hoping to lure in millennial parents by adding beer and wine to the menu."},{"comment_id":"788040247961250","commenter_b":"you were pounced on by women....","commenter_a":"I feel so sorry for him. When did we as a people become so cynical, unfeeling, intolerant and belittling. He made an old person's mistake - we old farts are often out of sync with the modern culture - it's not a crime. Did anybody consult the women he worked with before they dumped him??","post_message":"\"They haven’t even bothered to ask for my side of affairs.\""},{"comment_id":"1755875524653363","commenter_b":"The real coruption and illegal a tivities existing in this administration are the issues, but you are to cowardly to address them. Payments have already been made for Hillary to continue to play her corrupt anti American game. It is easy for the Clinton crime family to justify their dark Anti American activity. The message to her foreign friends antagonistic to the United States, and those buying positions on our taxpayer payed government payroll; Hillary is still open for bribery. Trying to rationalize their evil destructive behavior is despicable. The present administration and Hillary, studied, we're mentored, and follow the agenda of the most corrupt genocidal ideologies on earth. National Socialism, Communism, and Islam. Combined these ideologies have murdered and plundered close to a billion human beings. So why would any sane person with good intentions follow any of these ideologies? They would not, but the Clinton's do. The death, ...","commenter_a":"I've heard a lot of people say they used to like Beck but now they think he is completely bonkers.!","post_message":"Glenn Beck harshly criticized Breitbart executive Stephen Bannon, who is now the CEO of the Donald Trump campaign, saying that Andrew Breitbart himself is “spinning in his grave.”"},{"comment_id":"10153187015096051","commenter_b":"Carolyn, have some respect. He is our President after all. President Obama has made America great. We don't need Trump to mess it up.","commenter_a":"Agree. Obama is a joke and think the world knows it. He's like a bad kid. Just had to say something because he's mad. And the rest....thought he was talking about himself. The US does deserve better than him","post_message":"President Obama had some harsh words for Donald Trump today."},{"comment_id":"10152735928791680","commenter_b":"Of course. I know there is no way Hillary's home had anywhere near the \"Defense in depth\" that the government has. She decided to run her job from her less secure home. She brought it upon herself. ISPs and private servers are hackers easiest and most favorite targets, especially the traffic to and from. Take an IT course sometime. This info is taught at the basic level.","commenter_a":"Democrats can be mean brainwashed SOBs: @webpagelink","post_message":"Louisiana Gov. Bobby Jindal took his socially conservative message Thursday straight into the belly of the liberal beast: the New York Times’ opinion pages."}]
