[{"comment_id":"10152889213814071","commenter_b":"I'm gon die Miranda Hill Allie Lorimor","commenter_a":"Anfal Alkhalaf","post_message":"Listen to your dentist."},{"comment_id":"1100594890039116","commenter_b":"Hillary would've crapped herself... oh wait she probably already did...","commenter_a":"Another fake attempt 2 lure in sympathetic voters?","post_message":"Trump’s top aides baselessly pushed the idea that it was an assassination attempt."},{"comment_id":"10154038979953279","commenter_b":"Very simple by democratically changing the Congress /Senate, and local states governments with stateswomen /men that supports Bernie's and we the people's agenda. If you think outside the subjugated status quo box where you live it is possible to allocate the economic resources where we want it to be instead of for example spending trillions on wars and then passing a debt bill to we the people so we paid more to wall street. Simple enough. We can even pass legislation specifying since that Iraq war was illegal due to lies for greed we can write off that illegal debt and don't paid to wall street. Hmm just brain storming the possibilities once we change the Congress, Senate, and Bernie is our POTUS. Just follow THE PANAMA PAPERS.","commenter_a":"Hillary is Cynical. But we the people know who the real champion for the 99% working class wealth producers is. Only Bernie Sanders is genuine and legit to the people. #NotHer15 #berniesanders #latinosforbernie #bernieorbust #creditgoestobernie","post_message":"\"I’m supporting Bernie Sanders because he says no to fracking. I’m supporting Bernie Sanders because we do need a single-payer healthcare system that takes care of everyone. And that is not a pipe dream.\" - Rosario Dawson"},{"comment_id":"550108651839249","commenter_b":"rip Borat","commenter_a":"@username SO PUMPED this actually looks lit","post_message":"Winter is coming, to Kazakhstan. // Game of Thrones"},{"comment_id":"10153620225172377","commenter_b":"She is actually a feminazi and against our Second Amendment!","commenter_a":"Why would it be political, she's a republican hack. And is it remotely possible that he could be a sexual harasser.","post_message":"Newsmax CEO Christopher Ruddy says former Fox News host Gretchen Carlson lawsuit alleging Roger Ailes, the influential network chairman, sexually harassed her, simply doesn’t seem right. Ruddy writes: \"Interesting all of this is percolating in the middle of the most important election in modern times. I am not saying the allegations have a political angle. But the timing seems suspicious.\""},{"comment_id":"10152934156123067","commenter_b":"Molested. Josh should not have Molested his sisters or any other person.","commenter_a":"Josh should not have touched his sisters.","post_message":"\"If I could build a time machine, this wouldn't have come out in the first place,\" Washington County Attorney Steve Zega told CNNMoney. @webpagelink"},{"comment_id":"10154242244603635","commenter_b":"\"I agree you can still do all those things.\" So then you were making things up before. Glad we got that straightened out. \"I've known of kids getting suspend from school for praying before they ate lunch\" If that actually happened, the school involved broke the law. \"Employees were not allowed to say Merry Christmas it was happy holidays. She told me that.\" Right, because saying \"happy holidays\" is more inclusive. Of course, while not on the job, she was completely allowed to say \"Merry Christmas\" to her heart's content. \"There has been a huge change in this country for the last 25 years of Christianity being slowly phased out by our government.\" Not really. Christianity has never been part of our government, since it's not supposed to be. The first amendment makes that clear.","commenter_a":"I guess this is another step on kicking God out of this country.","post_message":"Indiana city renames Good Friday \"Spring Holiday\" to be more inclusive"}]
