[{"comment_id":"1025021754204963","commenter_b":"Will make the perverted staff , horny ?","commenter_a":"Give gun control without rules. Makes a lot of sense. Not. But tell a little girl she can't feel pretty. :(","post_message":"A father bought an adorable dress for his adorable little 5-year-old girl but her school forced her to wear a t-shirt and a pair of jeans because her shoulders were showing and Texas school officials couldn't handle it."},{"comment_id":"922774087855770","commenter_b":"And my favorite flavor of boot is the one I'd plant square in your ass for being such a pussy...sir.","commenter_a":"SO, he converted to Islam a couple months ago and he is talking about oppression in America!!!!! He is some kind of stupid ignoramus.","post_message":"You thought him not standing was bad? This is FAR WORSE."},{"comment_id":"1336076649746676","commenter_b":"It doesn't bother me at all","commenter_a":"Why does everyone need a day? Doesn't this kind of thing really inadvertently promote bias by constantly bringing up the differences between us all? We are all human and we all have strengths and weaknesses in different varieties this should be a strength among us not a divisive problem. If everyone would stop talking about it so much things would get much better. Make your decisions about people on an individual basis.","post_message":"Today is International Women's Day and to celebrate, we will be posting a series of images commemorating extraordinary women in the field of science that we believe you should have heard of. #WomenYouShouldHaveHeardOf Image courtesy Jewish Chronicle Archives/Heritage-Images."},{"comment_id":"10153156333212093","commenter_b":"Agree @username, I appreciate your candor.","commenter_a":"I would have to say too bad. There are reasons why adoption laws are written the way they are. Just because various individuals attempted to circumvent the prior marriage laws to gain legal status instead of going about the legal routes and legal boundaries others have until the recent decision on same sex unions, is not a good enough reason to change the laws surrounding adoption and the laws against adoptive parents becoming involved with adopted children. Do they think they are the only \"couple\" who have this issue. There are countless stories of parents who adopted a child, got divorced, and one of the \"parents\" wanting to change the legal definition of the legal parent-child relationship. How about you made your bed when you tried to circumvent the laws to get around state and federal laws regarding things like insurance eligibility, income tax deductions, ect., just because there are ...","post_message":"Roland and Nino want to get married now that same-sex marriage has been legalized. The only catch is that they are already legally father and adopted son... @webpagelink"},{"comment_id":"1172600979417284","commenter_b":"She is nothing. Melanie has class!","commenter_a":"Cruz is a desperate man and a liar and will do anything !!! Go Trump!!","post_message":""},{"comment_id":"731070983658177","commenter_b":"Can all 43 women be lying? Even a broken clock is right twice a day!","commenter_a":"Those kind of girls set women back a million years by falsifying there allegations. They are the main reason why real rape victims get shunned and re-victimized.","post_message":"The comedian's glittery career has taken a huge hit."},{"comment_id":"1849864471907247","commenter_b":"Oh yea, he needs another wife. Loser!","commenter_a":"Too soon!","post_message":"As no surprise, Gwen Stefani said yes!"}]
