[{"comment_id":"479805008868046","commenter_b":"Asshole!","commenter_a":"Stop the nonsense! We need people with some brain power addressing these issues because this comment is the most idiotic I have heard!","post_message":"Victim blaming is NEVER ok."},{"comment_id":"1025668424151460","commenter_b":"Again son, go fuck yourself, you're nothing but a useless troll :) you understand that, right?","commenter_a":"Hum... hopefully the US and Russia will agree in sharing intels, would be a shame if US troops got bombed by Russia because the US didn't want to tell them where they troops were...","post_message":"Just remember, folks… this is all about ISIS, the big bad boogeyman in the black pajamas, and has nothing to do with Assad's rebound or the influx of Russian special forces troops into Syria. ~Will"},{"comment_id":"467950796728834","commenter_b":"Don't deport them-KILL THEM! They will only return if we don't . Simple truth","commenter_a":"He'll yes. Send them back were they came from. We are running out of bed sheets. Lol","post_message":"Do You Support Muslim Deportation In The United States? Comment 'yes' or 'no'."},{"comment_id":"1970418399684565","commenter_b":"Gorgeous dress","commenter_a":"Horrible dress","post_message":"Politics made it to the Grammys!"},{"comment_id":"685959174927994","commenter_b":"No!!! Piss off bitch!!!","commenter_a":"Absolutely not , you moved to America to benefit from American ways of life and you're participating in the American justice system , and you expect to be changed just for you . I don't think so . You shouldn't even be allowed into the court house let alone the court room for reasons of security .","post_message":"This judge just made a controversial decision... Great. We support this judge 100%. Should this woman be allowed to swear on the Quran?"},{"comment_id":"223405771457676","commenter_b":"Greg Allen Bitch was prob Bisexual🤣 There's alot of them women running around claiming they gay when they lowkey bi. Hell the woman I messed with was prob Bi on the low!","commenter_a":"To each their own.. Who cares if she wanna be a stud.. Lol y'all niggas mad that her broad prolly look better than yours.. And you are born with a dick.. lmfao.. Let this person be whatever they want, ain't hurting me or my pockets fam..","post_message":"Crazy difference... #YoungMA #WSHH"},{"comment_id":"10154865700468256","commenter_b":"Aaaaaaannnnndddd just fortifying my position even more!! Lmfao!","commenter_a":"I sit back, a giggle my butt off at all these liberals grasping at straws to stop Donald Trump. Such hypocrites, because just 8 years ago when Obama was elected, they were so critical of the \"birther\" cries from conservatives...... I guess when your horse loses the race, you go chasing unicorns!!","post_message":"Pressure on members of the electoral college to select someone other than Donald Trump has grown dramatically - and noisily - in recent weeks, causing some to waver ahead of the Monday vote."}]
