[{"comment_id":"1019119028118150","commenter_b":"Majority of the worlds wealth belongs to Caucasians. It's not news anymore.","commenter_a":"Wow lost all respect for this station. Seriously? I know there is more important news that doesn't have to deal with comparing races.","post_message":"Report: Whites have 12 times the wealth of blacks See study--> @webpagelink"},{"comment_id":"710582602423848","commenter_b":"Ann Coulter shows her true colors like Trump. They both need a good dose of DUCK TAPE over their mouths.","commenter_a":"If this wasn't an election year, the Republican's would be silent about what Ann \"the Bigot\" Coulter said. In the past she has said terrible things about Muslims, Blacks, Mexicans & liberal Women & they were silent then !!!","post_message":"Ann Coulter needs to slither back into the snakepit she came from. --Andrew"},{"comment_id":"771398419667869","commenter_b":"Do not trust this corrupt bitch she will promise everything Bernie says so we will back her !Bernie or bust never Hillary she can not be trusted","commenter_a":"#Bernieorbust #NeverHillary #Hillarigged #IndictHillary #RIPDNC #Demexit","post_message":"Thanks to millions of people across the country, we have the most progressive platform in the history of the Democratic Party. Thank you! And while we have made great progress advancing the important issues that brought millions into the political process, the fight is just beginning."},{"comment_id":"10153399487739411","commenter_b":"wrong , Britain has nothing to be ashamed about, its not British people planting bombs and blowing their own kind up, if you haven't got anything useful to say except the usual stereo typical crap then stfu and go away, preferably to the middle east if you think the people are so great. Its funny how people such as yourself preach \"tolerance\", care to show an example of tolerance shown by Islam or its followers","commenter_a":"To that ignorant little britain first shitbag you do not represent my country, Britain is built on the back of slavery, racism and bigoted xenophobic imperialism but today it SHOULD stand for tolerance, cosmopolitanism and living in peace with our collective of ethnicities from all corners of the former empire (Including Wales and ireland, remember when it was fashionable to hate the Irish too, wake up muppet divide and conquer is as old as politics itself.)","post_message":""},{"comment_id":"995560767160480","commenter_b":"Why should he not? The more knowledegable of us that bother to read and comprehend what we read knows full well obummer's allegiance is with his muslim homeland.","commenter_a":"The tyranny in this country almost makes everyone speechless Wake up America Hillary is just an extension of Obama policies","post_message":"Not only did this Syrian immigrant cheer 9/11, in April 2013 she told me to \"go fuc k yourself\" after I called the Boston bombing jihad. This is who Obama assigns to keep us safe. Who is going to keep us safe from this savage?"},{"comment_id":"10153951391170579","commenter_b":"We have millions of people on welfare because Illegals are doing the jobs they are qualified for...we can use guest workers legally if we need more workers...I don't see us the US needing them though","commenter_a":"The republicans are certainly changing their tune on immigration. But they have no choice. Nobody in their right mind believes that we can deport all illegal immigrants without devastating our economy and millions of families. Even Trump admitted that they could come right back, a weak attempt to lessen the blow of his ridiculous plan. Yet another win for Bernie Sanders, who has no need to flip on issues to garner support.","post_message":"Your takeaway from the 4th Republican Presidential Debate?"},{"comment_id":"10154451446444614","commenter_b":"Good that is what she gets. She is a cruel person","commenter_a":"She needs to be criminally charged and have to register as a sex offender.","post_message":"Dani Mathers has been banned from all LA Fitness gyms after she took a photo of a woman inside a locker room and posted it on social media with disparaging comments about her body."}]
