[{"comment_id":"10153737959512623","commenter_b":"Girl one lady is so about to make me go in lmbo","commenter_a":"It's not about air... They weren't even allowed to open the windows, there was no airflow, the kids came off drenched in sweat and crying.","post_message":"Some parents are upset with a local school system after they say their kids got off the bus \"drenched in sweat\" and crying. A school system spokesperson said some of the parents' claims were \"less than accurate.\""},{"comment_id":"686707531519825","commenter_b":"Don't bother coming back here bitch ! if you do , they need to hang ya.","commenter_a":"Keep her.","post_message":"A woman who left home to join ISIS just got served up some karma. Good. Anyone supporting ISIS is a traitor to America. Click 'LIKE' if you agree!"},{"comment_id":"10153292946061509","commenter_b":"obama is a standerd POS ! muslim bstrd","commenter_a":"This is asinine. Why would he do this, yet absolutely refuse to meet with Benjamin Netanyahu??","post_message":"There were some hard-hitting questions about drones, college education and racial profiling. But he gets those all the time. Let's focus on the weird: @webpagelink"},{"comment_id":"1523513847666621","commenter_b":"Republicans had a smear campaign for him too, beginning with making him out to be a communist, with anti-American rhetoric to prove it. He would've been painted an insider since government is all he knows. They planned to trot out his rape fantasy story as well. Also, Vermont tried and failed it's statewide Healthcare for all system. He was treated with kid gloves compared to what he would've endured against the Trump post-truth machine.","commenter_a":"Sorry, Bill, but half of America already hated her BEFORE she ran. The media and Republicans have been excoriating her for 30 years. SHE NEVER HAD A CHANCE--unlike Bernie, who was almost universally beloved. He would have won. Fault: Democrats","post_message":"In case you missed them, we're counting down the most popular stories on BillMoyers.com during the past year: #9 - The fact is that Hillary Clinton wasn’t unpopular when she announced her decision to run in April 2015. If you look at the Gallup survey in March of 2015, 50 percent of Americans had a favorable impression of Clinton, only 39 percent an unfavorable one. So there was clearly no deep reservoir of Clinton hatred among the general public at the time. On the contrary: Americans liked her; they liked her quite a bit. Hillary Clinton's popularity didn't start to plummet until the press focus turned to her emails."},{"comment_id":"1017645858352192","commenter_b":"This she bitch should be locked up.","commenter_a":"Every one knows what to expect from you. Nothing good.","post_message":"ClashDaily.com"},{"comment_id":"985335071559547","commenter_b":"Scumbag!","commenter_a":"First of all what was the point in having all of this kids man! Now a days 3 or 4 is a lot of kids man. 19 kids is like your freaking crazy! I only watch half of a episode and I change the channel mighty quick. The ones that are going to suffer are their kids.","post_message":"This \"family values\" hypocrite hoped you'd never see these."},{"comment_id":"1091369127608289","commenter_b":"Tired of hearing about this stupid bitch too","commenter_a":"I don't care what she does.....she is the black Jane Fonda as far as I am concerned.","post_message":"Beyonce is backtracking from her racist Super Bowl 50 performance about as quickly as she can... now see who's being blamed for one of the most despicable aspects of her performance. This seems WAY too coincidental... Beyonce needs to step up and take responsibility."}]
