[{"comment_id":"1000962836629860","commenter_b":"Then they need to take ownership of the word terrorists.That is what republicans in congress are. They need accept responsibility for the violence in this country.","commenter_a":"Morons","post_message":"While they sell fear to the American people to get reelected, they sell themselves to the gun lobby."},{"comment_id":"10154403370309170","commenter_b":"She needs to go bye","commenter_a":"We're doomed!","post_message":"You have got to be kidding me. We actually elected people who believe stuff like this?"},{"comment_id":"10153035493893822","commenter_b":"Gross. She needs to go back.","commenter_a":"Why isn't she in jail?","post_message":"Connellsville woman charged for having sex with a 14 year old boy. The boy actually dated the woman's late daughter, who died back in June of 2014."},{"comment_id":"1120933471338794","commenter_b":"Lol","commenter_a":"These uneducated hillbillies dont care because they cant afford to buy a trailer anyway...","post_message":"Millions upon millions of his poorest voters just got terrible news."},{"comment_id":"438679209798098","commenter_b":"What a stupid cunt.","commenter_a":"I'm in love with this guy.","post_message":"Tomi Lahren fails to see Lady Gaga's subtle political message and still uses it to rip on Beyoncé. + Hasan Piker is heartbroken Tomi never hit him up when she came out for Bill Maher."},{"comment_id":"854169234726517","commenter_b":"How about rapist?","commenter_a":"If trump is despicable, what does that make Hillary ?","post_message":"\"He’s just despicable,\" Letterman said, adding that Donald J. Trump may very well prove the saying that \"anyone can grow up to be president.\""},{"comment_id":"10153366169796336","commenter_b":"This chick is STUPID!!!!!!","commenter_a":"Now all the blacks who have been passing themselves off as white will come forward to get media attention!","post_message":"\"She's been white all the way up until 2011, when she started to change the way she looked with the clothes she wore.\" Rachel Dolezal's brother joined \"The Kelly File\" to address his sister's recent claims to reporters."}]
