[{"comment_id":"874917705876659","commenter_b":"people need guns to protect them selves from this sort of scum. is this copper stil walking?","commenter_a":"I smell a wrongful death suit with a nice pay out cooking","post_message":"This is CRAZY! A unarmed boy's last moments were caught on bodycam, just before he was SHOT & KILLED by a TRIGGER HAPPY COP! Of course the cop will not be charged for any crimes. Blood boiling VIDEO: @webpagelink"},{"comment_id":"10152869949930796","commenter_b":"I once had a panhandler tell me he was a wounded veteran who couldn't find work. Knowing that there are many homeless veterans (a shame of it's own that needs addressing) I decided to ask about his service record, branch, MOS, duty station, etc. Being from a military family, and having served myself, I quickly noticed that his story was bogus. Point being, many of these guys are fakes. BPD wasn't shaming anybody, just pointing this fact out.","commenter_a":"No apology necessary! Thank you for keeping us informed.","post_message":"“They are using the power of the written word and incorporating fear to get you to think the worst of your fellow man,” activist Pat LaMarche wrote of the Bangor Maine Police Department in a paper she handed out Monday by the police station."},{"comment_id":"1125682197501441","commenter_b":"I hope so, I heard today we have the most immigrants in the USA!!! I'm furious!!!","commenter_a":"I'm not happy with Michigan!!!!","post_message":"Team Hillary is full freak out mode...needs massive knockout punch in tonight's Debate of the Century to stop Trump momentum..."},{"comment_id":"10154611817649087","commenter_b":"Diana , sthu . Don't call me names . We went through 8 years of that black racist pos muslim traitor obama . Now we get a real American President that wants to help America and people like you don't even give him a chance . So crawl back under your rock and take obama with ya .","commenter_a":"So many liberals . I mean clueless liberals . With obama and hillary we would have been a 3rd world muslim country in no time . STHU and give Trump a chance . He's done more for America in weeks that obama did in 8 years .","post_message":"\"It's apparent that President Trump is clueless when it comes to nuclear weapons.\""},{"comment_id":"10155894213345354","commenter_b":"Hillary is a cunt!","commenter_a":"Killary is the epitome of all the ills of this world rolled into 1 savage stinking carcass.","post_message":"Short memory!"},{"comment_id":"1067324623308009","commenter_b":"Why should anyone get special benefits for being married?","commenter_a":"I am for the government getting out of the marriage business","post_message":"While we celebrated the right of same-sex marriage finally being nationally recognized, Republicans began to lose their minds."},{"comment_id":"1323274761102106","commenter_b":"Hillary is for WALL STREET, BIG BANKS and CORPORATE WELFARE!!!! Bernie was right!!! Don't let her steal our COUNTRY🇺🇸#NEVERHILLARY","commenter_a":"I think it's great that the majority of America is holding him accountable for being a sexual predator.","post_message":"Hillary Clinton is leading Donald J. Trump by 15 points in Virginia, up 8 points from two weeks ago."}]
