[{"comment_id":"1734577893461739","commenter_b":"clinton continues to LIE- wikileaks has proved that-she should be in jail.","commenter_a":"His comeback sounded like something a 3 year old would say","post_message":"Hillary Clinton: \"Well that's because [Putin would] rather have a puppet as president of the United States.\" Donald J. Trump: \"No puppet, no puppet. You're the puppet.\" @webpagelink"},{"comment_id":"1642912372619537","commenter_b":"Very nice & her tiara stayed on!!!","commenter_a":"Awesome","post_message":"These two turned up the HEAT!"},{"comment_id":"10153246280989411","commenter_b":"Why there is nobody helping Palestine. Come on Russia or China. Could you plz give Palestine nukes. Let those two countries to finally start playing a little more realistic games.","commenter_a":"So they are trying to destroy them............fuckers...","post_message":"'Israel cannot maintain military control of another people indefinitely.'"},{"comment_id":"1438922076159420","commenter_b":"Chill your butthurt bitches lol","commenter_a":"Are you kidding me? You people need to get a life!!!","post_message":"Was it inappropriate?"},{"comment_id":"1444717595538546","commenter_b":"It not over until it get to the highest court! Just hope we don't allow this time to allow the bad guys get something in the USA! It will not be the rights fault! But as always the left will blame the right, anyway! :(","commenter_a":"This is why America is in this shape, getting a president that would actually work toward putting Americans first is/will be thwarted at every turn.....","post_message":"Appeals court denies DOJ's request to reinstate travel ban"},{"comment_id":"1811712189111334","commenter_b":"She is a poor excuse for a women","commenter_a":"News-Flash! When you're talking about liberals, \"best\" is a relative term!","post_message":"THIS is the best the Left can do?!"},{"comment_id":"10153174947101545","commenter_b":"So what's your excuse then casey?! Bahahaha!!! Mama was drinking when she was pregnant with you?!","commenter_a":"Now she and her followers will claim that she was jailed for being a christian, as opposed to a bigot hiding behind Christianity.","post_message":"A Kentucky county clerk was found in contempt of court Thursday for her refusal to issue marriage licenses in wake of the Supreme Court decision to allow gays to wed."}]
