[{"comment_id":"10155159081916159","commenter_b":"And those immigrants came into are country legally . These SOB coming in now are not. Your so dumb","commenter_a":"So much hate coming from a country that was built by immigrants. You wouldn't be anything without the contributions of so many people from other nations. SAD!","post_message":"Protestors rally in NYC for Muslim and immigrant rights"},{"comment_id":"10155802536765354","commenter_b":"Hope she goes to jail!","commenter_a":"Sad","post_message":"\"I’m not about to be on no scene 10 minutes doing CPR.\""},{"comment_id":"10154356809342654","commenter_b":"DEPORTATE ALL IMMIGRANTS ILLEGAL! God Bless US .","commenter_a":"All the people walking there equals one mexican party or quince lmfao","post_message":"Immigrants who work at dozens of restaurants around Washington, D.C. are participating in the Without Immigrants protest. We're live at Pizzeria Paradiso (Dupont Circle) where managers are trying to get by without their employees AND we're live at the site where protesters are organizing."},{"comment_id":"10153578934943984","commenter_b":"Really. Yall have to ask??? Stupid crap and a shame people think of HIM as courage. SAD. However HIS timing was planned just at the right time for the supreme courts decision.","commenter_a":"What a joke.","post_message":"Wow. Immediately after the ESPYs it became clear to those paying attention that ESPN made a big mistake. I'm pretty sure ESPN never saw this coming when they decided to give Jenner the Arthur Ashe Courage Award. Do you think ESPN was wrong to give this award to Jenner?"},{"comment_id":"10153190313663984","commenter_b":"Get the bitch away from our kids school's.","commenter_a":"She fills up on bananas! Hard to keep her out of the tree!","post_message":"Ouch - Michelle Obama will not be happy to hear this. Are you sick and tired of the Obamas telling us all how to live?"},{"comment_id":"10157367896160725","commenter_b":"Everybody needs to pull together and get this corrupt woman out of sight , Trump is leading and lets keep it that way.","commenter_a":"Get that lying hag out of here! We need a leader not another criminal. TrumpPence16!!","post_message":"Thank you! #MakeAmericaGreatAgain"},{"comment_id":"10152899469751130","commenter_b":"Women tearing women down. This is why we can never have nice things.","commenter_a":"The face and stance totally remind me of the gorillas at the zoo lol.","post_message":"Do not f**k with Ronda."}]
