[{"comment_id":"10153263925251990","commenter_b":"@username hubby leaves for work and I wake up","commenter_a":"Jackie Owens @username-Hernandez @username","post_message":"JUST IN: The CHP says two people were struck by blow darts while walking on the Golden Gate Bridge --> @webpagelink We will have more on this story in our News at 11 p.m."},{"comment_id":"10153802989025927","commenter_b":"If you are here legally you have nothing to fear, stop listening to liberals who pander fear...If you are here illegally than yes, you might wanna vacate before being made to leave...This is not a hard concept, it's quite simple, if you are here illegally leave and immigrate back legally, if you are here legally ...What are you worrying about?","commenter_a":"If these people want to engage in disrespecting this country by burning the American Flag and demonstrating allegiance to another the authorities should round them up and deposit them in that country they love so much. This is getting to be far far too common and needs to be stopped. They can go to these countries they love so much and demonstrate and destroy things there","post_message":"PROFESSOR: am getting many heartfelt notes from students who are in shock over the election returns and , rightly or wrongly for their families ..."},{"comment_id":"510871105704596","commenter_b":"great man spreading peace, love, and equality.","commenter_a":"Evil wolf in sheeps clothing","post_message":"What are your thoughts on Pope Francis?"},{"comment_id":"1179133135441029","commenter_b":"No you're thinking of a dog. Easy mistake to make.","commenter_a":"Wasps bite. They don't sting.","post_message":"And you thought getting stung was bad."},{"comment_id":"1029601670427380","commenter_b":"Waiting for Drumpf to deport his first and third wife. Apparently jobs aren't the only thing he likes to outsource.","commenter_a":"Kurt Schultz think you may enjoy. Just saying. Miss you, partner","post_message":"Trevor unpacks Donald Trump's response to the mass shooting in Orlando. @webpagelink"},{"comment_id":"10154902832777235","commenter_b":"Fuck that old bitch. She has probably done the same shit a million times.","commenter_a":"She came from pigselvania, lol","post_message":"This jolly little elf of a person is just brimming over with holiday cheer!"},{"comment_id":"1106399449450800","commenter_b":"Have you ever been fired or refused a job because you had a cough?! If this is the best you can do you should throw in your white sheet and accept defeat.","commenter_a":"Notice how her hair is different in all 3 of the pictures and her clothes are different in the two pictures that show her clothes. Who changes their hair and clothes several times while on a plane? Another made up story without corroboration by the right wing nuts from @username.","post_message":"WATCH:"}]
