[{"comment_id":"1183171455046239","commenter_b":"Who is she to decide who the child should live with","commenter_a":"I just read another story that he had reversed his decision, probably due to pressure from above.","post_message":"SOUND OFF: Judge believes a child is better off with a heterosexual couple."},{"comment_id":"10152865609926336","commenter_b":"That is insane.what is wrong with her.father","commenter_a":"It's obvious the parents are watching. But, I wouldn't have chanced that. You never know when a preditor will change it's mind and attack. If it had decided to attack and start constricting around the child, they may have had trouble getting it off before it did harm, even with them watching. I don't think the child here is being abused or neglected, that obvious in the film. With all animals, things can go very wrong, very quickly.","post_message":"This video footage of a 14-month-old girl playing with the family pet might make you a little nervous."},{"comment_id":"960454674002831","commenter_b":"I agree and anyone with a brain knew what the little guy was doing. Your business and the buck stops at the top. But Rubio wouldn't know about a business or for that matter what it's like to take a job and show up to work! Only be a puppet whipping boy for the old lifetime old farts on the hill. Look on line about Rubio and pulling strings to help his drug dealing brother in law? Check it out! This is the jurk running for the top office? Or any office! What a joke and a choker! Did I get it right little man that sweets like a pig?","commenter_a":"The true story... Trump did not know the Sub contractor hired the polish workers but settled it anyway and took responsibility even though it was not his doing.. Rubio and Cruz are the con-artists and the liars. Typical politician bull-crap. @webpagelink","post_message":"MARCO-BOT is back!"},{"comment_id":"10154238918214411","commenter_b":"truth hurts huh","commenter_a":"Republicans are nothing but Bible toting A HOLES who care nothing for other people you know that the party is a minority why you ask because the only way these jerks get elected is because of voter apathy if everybody would vote the Republican jerks would dry up and blow away","post_message":"Cheer up Republicans. The presidential race may be a mess, but you controlling state legislatures..."},{"comment_id":"10153313439013984","commenter_b":"Sick bitch...you go girl..to hell","commenter_a":"She fed the hungry so all you people that have never been hungry think about that you idiots some people don't know what its like to have an empty belly so you go girl","post_message":"The disgusting hatred from the left never ceases to amaze me. Do you support this young woman?"},{"comment_id":"10153259731496615","commenter_b":"They are grown women they knew exactly what they were doing","commenter_a":"Stop calling these Ppl victims they knew what they were doing everyone knows Cosby is married what type of woman will got to a hotel room for drinks with a married man they had their own agenda miss me with that victim bs","post_message":"BREAKING: Bill Cosby has been charged with sexually assaulting a woman in Pennsylvania more than a decade ago. @webpagelink"},{"comment_id":"10153792660631545","commenter_b":"Just like recent a white women in alexandria,la a manager at canes got stabbed by a black an but do they see us protesting and stuff.come on now","commenter_a":"Why do black people complain about their shootings??? Ever hear about Asians or white people being shot?? Do they protest like you do? Do they get anything specific??? No","post_message":"\"They had him pinned down,\" Abdullah Muflahi told CNN. \"He was out powered. There were two of them and there was one of him, and they were right on top of his chest.\""}]
