[{"comment_id":"10154837209509657","commenter_b":"Gowdy did you just find out that democraps cant be trusted? I could have told that to you years ago.","commenter_a":"The only thing that will cause changes is to put Hillary Clinton in jail. Make an example of her. Set an example that shows that politicians cannot go around lying and mishandling classified information without dire consequences happening to them. You have got to get that train back up on its tracks.","post_message":"Desperate times call for desperate measures."},{"comment_id":"1063797583686996","commenter_b":"Giant vagina","commenter_a":"@username you","post_message":"It be like that"},{"comment_id":"10154102446149749","commenter_b":"@username, STFU and go lick the pope's ass ..","commenter_a":"Well why doesn't the Catholic Church hand over some of its many billions and do something about it and relax their pathetic view on contraception No wonder there are so many of them","post_message":"The Pope laments Europe's handling of the influx of migrants and refugees fleeing war and persecution."},{"comment_id":"1217766195006823","commenter_b":"DISGUSTIMG CLASSLESS PIGLETS UNREAL","commenter_a":"Congrats to the left,You've just proven to the world,you don't need Obama to make America look foolish,you can do it all on your own.","post_message":"ClashDaily.com"},{"comment_id":"1159085570778138","commenter_b":"No the Great Wall did not work. Mongols had no problem getting over it.","commenter_a":"Nothing But Crap. Christie came out strong when he was elected Governor but it's been all down hill since. Why talk about Brady, not even his State. As for the wall, it worked for thousands of years for China. Plus it's a hell of a lot cheaper than what it is costing us in welfare, medical, food stamps, crime, law enforcement, prisons..... Put the people collecting welfare to work, take the young men like the CCC and WPA days. Bring our military home and build the wall.","post_message":"“Please, please, please do not fall for the idea that we are going to build a wall along the entire 2,000-mile border of the United States and Mexico ... It’s not feasible. It’s not practical. It’s too expensive. And by the way, I’ve never seen a fence or a wall that if a human being wanted to get over or around it that they couldn’t.”"},{"comment_id":"1515851598455693","commenter_b":"That's ok i love the 6 i have","commenter_a":"I REALLY HATE TATTOOS BUT THIS IS GOOD","post_message":"It's not just about the conversation — it's about providing tangible support and help too."},{"comment_id":"1039851232779934","commenter_b":"Leave the poor girl along. ..she's retarded","commenter_a":"No. She has been lied about for years!! Republicans can't stand a strong woman with brains!! Gotta tear them down. They prefer mindless, brainless twits like Michelle Bachman and Sarah Palin.","post_message":"Answer with a simple 'yes' or 'no': Is Hillary Clinton corrupt?"}]
