[{"comment_id":"848280508611132","commenter_b":"Bye bye illegal parasites. Free ride is over. Self Deport before you're kicked out kicking and screaming.","commenter_a":"Donald Trump is the man. It's time to rid America of career politicians, and put someone in the White House that genuinely loves their country.","post_message":"820,000 crimes committed by illegal immigrants, here in America. Guess what! NOT WHEN I AM YOUR PRESIDENT! I can assure you of that! We will BUILD THE WALL- and Mexico is going to pay for it!"},{"comment_id":"10154019054861509","commenter_b":"White Americans do not recognize anyone else","commenter_a":"American??? Wow, she is so ignorant. Many American citizens came here from other countries speaking another language. English, the American version, is what has been spoken here for many generations. However, we now have many citizens who speak Spanish, Russian, Mandarin, Vietnamese...We are a country of many. Let's stop the ignorance and the Palins of the world.","post_message":"Sarah Palin praised Jeb Bush on speaking Spanish, but said “let's speak American\" to unify the country: @webpagelink"},{"comment_id":"914820658566958","commenter_b":"Let Syrian refugees move in with her! Let's see how she will put up.","commenter_a":"Idiot they always go straight to only thing they know gun control","post_message":"[AUDIO] Democrat Congresswoman Wants More Gun Control After Paris Attacks"},{"comment_id":"10153853099981680","commenter_b":"Abedin: she \"could not use a computer\" So much for Hillary being the great email mastermind.","commenter_a":"Ok, so what!! There is no federal statute that prohibits this! There is an executive rule, which if this article is true the Executive who created said rule exempted by communicating with Clintons private email. That said using a pseudonym may create legal issues for Obama that have never been thought about by lawmakers","post_message":"#Breaking: Obama used a pseudonym in emails with Clinton, FBI documents reveal @webpagelink"},{"comment_id":"10153509849905329","commenter_b":"Get a grip lady","commenter_a":"Caitlin didn't choose to be born feeling like she was in the wrong body. She's not getting the award for getting surgery, she's getting the award for standing up in a bigoted, judgmental, harsh world and being her authentic self. She is giving hope and courage to thousands of transgender people all over the world and showing them it's OK to be themselves. Who knows how many people she is saving from suicide by being strong enough to go public and be treated with ridicule, ignorance, and hate. She's making a tremendous impact on the LGBTQA community. Courage comes in all forms. Are only the military and first responders allowed to show courage? Is that the only type of courage we're allowed to recognize? I choose to disagree. Of course Noah is courageous, no one is saying he isn't. Of course every member of our military is courageous, but that ...","post_message":"ESPN confirmed to BuzzFeed News there is no such thing as a “runner-up” to the Arthur Ashe Courage Award."},{"comment_id":"10157024443115354","commenter_b":"But you'll let your politicians scrub the term \"illegal alien\" from your laws!!! Just another step towards amnesty!!!","commenter_a":"We began a WRITE IN campaign for Donald Trump in Colorado. We will show America we can not only Recall Libtard Legislator's who go after our Gun Rights, we will also go after Fascists hidden in the GOP.","post_message":"Colorado Republicans OUTRAGED..."},{"comment_id":"10154424174381162","commenter_b":"It's the Ocean. Dangerous animals live there. Leavem alone","commenter_a":"Or he could have just left it alone and the family move to a safer place? Sounds so unnecessary...","post_message":"A dad celebrating Father's Day wrestling an alligator on a beach before it's able to attack his family and others. FULL STORY: @webpagelink"}]
