[{"comment_id":"10153686445776336","commenter_b":"Any illegal here who has family Who is here legally, the LEGAL family should be hit with a fine/special additional tax to pay for their illegal family here!","commenter_a":"Deport illegals! And all the money that are spending for them should be given to our vets!! Trump is the one who cares about Americans!","post_message":"\"Right now — and you know it — we have illegal immigrants that are treated better, by far, than our veterans.\" – Donald J. Trump (via Fox Business)"},{"comment_id":"817971878238235","commenter_b":"WTF. Is she even more stupid then I thought.","commenter_a":"She is so stupid!!Does she have that kind of power or does that have to have congregational approvevl?","post_message":"Big news! What do you think about this?"},{"comment_id":"1006897696063097","commenter_b":"Praying for a awesome woman of God and Crouch family.....such seeds she has sown...","commenter_a":"Pamela Houston","post_message":"The TBN family continues to ask for prayers and promises to keep us updated on Jan's condition. #JanCrouch #TBN #stroke"},{"comment_id":"10153725740586336","commenter_b":"Who Cares. He's a Conservative Rapist","commenter_a":"Keep him on the other side of the Trump Wall.","post_message":"Police say Paul Jackson and his older brother, Vance Roberts, kidnapped prostitutes, drove them to Roberts' home and held them captive for days."},{"comment_id":"466095273584336","commenter_b":"Good maybe that will keep a lot of those liberals and illegals out of the rest of America.","commenter_a":"Have it your way Jerry...","post_message":"Liberal California Governor Jerry Brown: ‘If Trump Wins, we’ll build a wall around California’"},{"comment_id":"10153500362571770","commenter_b":"The world does not have a right to illegally enter the United States. The American people have appealed to Congress for years to secure the southern border so that we could then begin to address the issue of the illegals already in the country. That could have at one time meant some sort of arrangement for them to stay legally. But Congress did nothing because the WSJ, the Chamber of Congress and the business world wanted a supply of illegal, off the books, low wage slaves while others long for a utopian open borders world. It's time to bend our politicians to our will. We need to send the message, secure the borders or pay the price come election day.","commenter_a":"make sure they're all legal!!!","post_message":"A new coalition of Latino groups and labor unions aimed at stopping Donald Trump from becoming president will begin holding voter registration drives at high schools in battleground states."},{"comment_id":"1063700283715505","commenter_b":"No more illegals","commenter_a":"Keep legal immigrant families together. I have so many waiting in the Philippines waiting to legally come. The other illegals can wait to be legal like the rest or let all immigrants come to USA.","post_message":"The Supreme Court’s deadlocked ruling on immigration leaves families like Karla’s under the threat of deportation. We need a president that will fight to keep families together, not tear them apart."}]
