[{"comment_id":"1115743115130630","commenter_b":"No Jay Reed, it doesn't offend me because, undocumented immigrants pay taxes, create business, and help the country's economy. Undocumented immigrants don't obtain unexpected or desabilty benefit even when they pay to the programs.","commenter_a":"California has no place for this disgusting xenophobic individual. Dump Donald Trump where he belongs. .the trash Dump.","post_message":"Protesters smashed a police cruiser and at least one fight broke out after Donald J. Trump's rally in Southern California Thursday night."},{"comment_id":"1745001682421383","commenter_b":"Just when I think I had seen stupid, I look at a news feed like this, and all you libtards take stupid to a whole new level. All you lazy Daisy's don't want Trump in because your welfare checks will go away, and a you illegals will be deported home to build that WALL!!!!","commenter_a":"Trump is hammering her, love it! All she can do is smile & laugh because she has nada","post_message":"\"I will release my tax returns – against my lawyer's wishes – when she releases her 33,000 emails that have been deleted.\" Donald J. Trump hit at Hillary Clinton's email issue in the first presidential debate. #Debates2016 @webpagelink"},{"comment_id":"1801737773446077","commenter_b":"Hell no stupid BITCH","commenter_a":"That's what this country is all about- Idiots supporting idiots!","post_message":"President Obama called Hillary Clinton the most qualified presidential candidate ever. Do you agree?"},{"comment_id":"544174485780052","commenter_b":"Go to hell. She won. Petulance Is ugly.","commenter_a":"Bernie supporters had been saying for at least the last year prior to the election that if we get $hillary as the Dem nominee, we get Trump as the next president. We fucking told you so, America. We said this, and it happened. For the record it doesn't feel good, and the vast majority of us wish harder than anything that we could have been wrong about this. No one is gloating; we're pissed.","post_message":"Supporters of Bernie Sanders never got their chance to prove if their candidate could have defeated now President-elect Donald J. Trump."},{"comment_id":"10153155797009205","commenter_b":"Kill the whole breed .","commenter_a":"Always have your concealed firearm in case one of these beasts attack.","post_message":"Pit Bulls Maul Multiple Men [GRAPHIC]"},{"comment_id":"10153661436973352","commenter_b":"She just ain't shit","commenter_a":"I dont get it.. She was turning herself in to be locked up?!? And left the kids in the car......","post_message":"Mother caught leaving 1- and 6-year-old children in a hot car…while she was turning herself into police for doing the SAME thing last month. SHOULD THEY TAKE HER KIDS AWAY FROM HER?"},{"comment_id":"10153409867621051","commenter_b":"Where is your neighborhood bitch I'll be there with bells on think it's a game","commenter_a":"You darkies try and pull a stunt like that in my neighborhood , you'd be leaving in a body bag . KKK TIME !!","post_message":"Beating this teen girl senseless wasn't enough for these women. They also decided to leave a special message on her forehead."}]
