[{"comment_id":"1107023316031416","commenter_b":"@username white people have committed more rapes and drug transactions than mexicans","commenter_a":"This is what leadership looks like - he's going right into the heart of the democrat plantation, not because of the votes, but because he cares, and he believes that everyone deserves to have the opportunity to prosper and live in safety.","post_message":"\"Christian faith is not the past, but the present and the future. Make it stronger.\" Moments ago in Detroit, Donald J. Trump spoke to the Great Faith Ministries International Church, calling the African American faith community \"one of God's greatest gifts to America and to its people.\""},{"comment_id":"1256330341086427","commenter_b":"I recently read an article where he said he doesn't change diapers and taking care of the kids was his wives' responsibility, so I think it's fair to say he probably has zero understanding of fetal development and pregnancy. This is a man, after all, who called a breastfeeding woman disgusting for needing to pump breast milk. Fun fact-Donald Trump is not the only man who has no idea what he's talking about in this arena. I had a friend who had to explain to a coworker, who was a father of THREE children, that breastfeeding women need to pump at work because they cannot start and stop lactation at will. Guy thought a breastfeeding coworker could just wait until her 8 hour shift was done to start lactating, and was disgusted that she stored her breast milk in the fridge.","commenter_a":"As a C-Section baby myself, I was scratching my head for a good long while after he said that. I don't understand how a seventy-year-old man with five children (and a few grandkids!) could be *that* ignorant of childbirth!","post_message":"“It is, of course, such an absurd thing to say,” one doctor said. “I’m unaware of anyone that’s terminating a pregnancy a few days prior to delivery of a normal pregnancy.”"},{"comment_id":"859046174191636","commenter_b":"she sucks like spike lee","commenter_a":"why is it important that she was a black female director? is it not good enough to be the Best Director?","post_message":"\"I do think it was a snub. But, I do believe she’s the first black female director whose film was nominated for an Oscar, so that’s already been history making.\" - Director Yoruba Richen on \"Selma\" and Ava DuVernay"},{"comment_id":"497513650439215","commenter_b":"Bitch","commenter_a":"Well then ll blacks are racist even if they don't use the Cracker word!!!","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"1152822888099590","commenter_b":"Hillary is a liar, a cheat and cares more about money then Americans.","commenter_a":"Another embarrassment p***y grabber to the country...","post_message":"JUST IN: Donald Trump Jr. will be speaking at ASU on Thursday at 2 p.m. MORE: @webpagelink"},{"comment_id":"10154012429911509","commenter_b":"Shut-up and go away!!","commenter_a":"Hi i am Ellie I am 17 years old hot Girl want to some Love able friend I live in USA Follow me I will Follow you Back Like me And make me friend <3 :D <3","post_message":"In Malibu, people call the cops on other people just for sitting on the beach. It's been going on for decades. Last weekend, we put access to beach property to the test. @webpagelink"},{"comment_id":"1329933407046113","commenter_b":"Everything, everything she touches is corrupt.","commenter_a":"GREAT READ","post_message":"PATHETIC @webpagelink"}]
