[{"comment_id":"10154735667991756","commenter_b":"Hamas is a disaster, as is Israel's abuse of Palestinians. There are hookworms on two sides, sucking the life-blood out of two peoples.","commenter_a":"Not my monkey, not my circus. Let's keep our dicks tucked away for now.","post_message":"Of 1.9 million Gazans, 1.4 million need humanitarian aid, and the United Nations directly helps 1.1 million. Robert Piper, the U.N.'s humanitarian coordinator for the Palestinian territories is worried Israel's charges against the two aid workers could exacerbate a large aid funding shortage."},{"comment_id":"1529265630712432","commenter_b":"This lady is a nut job and probably has some deep issues that she needs to work on.","commenter_a":"#DavePirnerProblems","post_message":"\"You're saying that I can't have a hairstyle because of your culture? Why?\" the man, who is white, says in the video. \"Because it's my culture,\" says the woman, who is black."},{"comment_id":"1771925833072094","commenter_b":"Well, WE the people are voicing concern about muslim people who leave in US for free and hate us; WE the people.!","commenter_a":"assimilate and don't threaten to kill us or kill us. Or rape us. You're in America. Become American. Eezy peezy.","post_message":"Muslims are voicing concern on social media about a Trump presidency. @webpagelink"},{"comment_id":"10154917656616509","commenter_b":"People, here the moronic trump plan : deport Americans from America! Ban Americans immigration from state to state. Unless you're a Caucasian with 'orange paint' on your face, then you must wear a badge to show who you are! That's the moronic trump have plans for America!","commenter_a":"So many people dead and Obama plays politics and slams Trump, Whats Obamas plan to stop this, He dont have one, Trump has one","post_message":"President Barack Obama on use of the term \"radical Islam\": \"What exactly would using this label accomplish?\" @webpagelink"},{"comment_id":"10153003088197377","commenter_b":"It will be a huge shake up.","commenter_a":"Now they talking I guess they are coming out of there dream closets, they better rally around him and make this country great again.#Trump/Cruz.","post_message":"Newt Gingrich says Donald Trump is capable of winning not only the Republican presidential nomination."},{"comment_id":"1713956375559891","commenter_b":"I think ladies should have control over their bodies but what if your mama aborted you","commenter_a":"Bravo Guttier","post_message":"This is AMAZING. The ending is the best part. Share if you agree with Congressman Luis V. Gutierrez and give his page a LIKE! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153518895070326","commenter_b":"And who believes her??? This must be a \"Clinton Joke\".","commenter_a":"the old scritch she does know how to lie though,,and has lots of crooked schemes up her sleeve","post_message":""}]
