[{"comment_id":"10152871405466717","commenter_b":"I remember seeing this it really touched my heart loved it!!! And those moms can suck it!","commenter_a":"Moms... eat shit and die! Hypocritical, bigoted ass-holes..... 1,000,000 Moms = about 12 homophobic morons!","post_message":""},{"comment_id":"10152760483166051","commenter_b":"I guess she rubbed them the wrong way......","commenter_a":"They didn't arrest her but they issued her a citation.","post_message":"Police took one look at the video this girl posted from the Oregon State University library and arrested her immediately."},{"comment_id":"10154115994939369","commenter_b":"The thugs will make their way over to this mall too.","commenter_a":"This must be for everyone who wants to shop at Easton, but are tired of all the thugs that are there on the weekend.","post_message":"Not all neighbors and nearby businesses are happy about the new mall."},{"comment_id":"10152778407223445","commenter_b":"No argument, no facts, just a loud mouth bitch thinking she's right bc of some stupid ass parents. She keeps saying free access, bitch it's already accessible, just gotta know who to call. 2chainz wins this conversation piece every time.","commenter_a":"Idiot-ass","post_message":"UPDATED: Nancy Grace admits defeat in #pot debate with 2 Chainz?: @webpagelink"},{"comment_id":"10153861308944087","commenter_b":"@username and u so fucking stupid","commenter_a":"The sad part is people in this country seriously think she is worth voting for...","post_message":"#BREAKING: A federal judge blocked Judicial Watch’s effort to begin interviewing State Department officials under oath and collecting evidence as part of a lawsuit over Hillary Clinton’s private emails."},{"comment_id":"1030052270365446","commenter_b":"If she is afraid her flatulence will be recorded maybe she should stop opening her mouth.","commenter_a":"Up here.... they would call that problem... The Rocky Mountain Quick Step..... apparently it isnt that quick with the carpet bagger of the east","post_message":"\"Sorry.\""},{"comment_id":"10153238417336717","commenter_b":"Like regular hetero marriage is such a fountain of virtue. LOL","commenter_a":"What a nice slap in the face for marriage equality. They say they dont care what anyone thinks....I think they look like whores, when's number 4 coming?","post_message":"In case you missed it:"}]
