[{"comment_id":"907187719304084","commenter_b":"Nope. She shouldn't.","commenter_a":"She shouldn't have to apologize. *kanye shrug* Jay","post_message":"Lindsay Lohan Apologizes For Using The N-Word On Social Media While Referencing New Kanye Song"},{"comment_id":"1270876669600008","commenter_b":"Jean Miche","commenter_a":"We aren't. Some may be.","post_message":"Why is a fear of spiders so common?"},{"comment_id":"1221931671171728","commenter_b":"Whst dumb lady","commenter_a":"No that really is your heart. If she can feel remorse for people shot by cops but not cops shot by people she's just a horrible person. Own it and don't try to dance around it by saying you feel guilty when you don't, I'd respect that more.","post_message":"“I am dealing with a bit of guilt because I don’t feel sad for the officers that lost their lives and I know that’s not really my heart,” James said in the video."},{"comment_id":"10153371654068855","commenter_b":"She's just trying to get famous.","commenter_a":"...why can't this bigoted bitch comprehend and accept REALITY?! (well, because she is an ignorant, bigoted, discriminatory and hateful bitch! - and perhaps soon-to-be unemployed, too!!!)... Government Employees Have No Freedom Right To Refuse Service To Same-Sex Couples, Says Americans United Jul 8, 2015 Clerks Must Issue Marriage Licenses To All Qualified Couples, Church-State Watchdog Says Government employees who oppose marriage equality because of their religious beliefs are not entitled to refuse service to same-sex couples, Americans United for Separation of Church and State has informed officials in all 50 states today. In a letter released today, which will be sent to all state attorneys general as well as county clerks in Texas and South Dakota, Americans United explains that with marriage equality now the law of the land, government employees do not have the right to opt out of serving gay couples, because doing so would harm those couples ...","post_message":"You have to do your job, Kim Davis!"},{"comment_id":"10152535175096813","commenter_b":"Start helping the ppl who are already here. How many Americans are out of work but Obama thinks it's better to hire illegals and give them driver license so they can vote. Yea sounds like he's buying votes for the Democratic party. When a soldier retires from the military where does he go. Shouldn't he have the first pick in a job then someone who crossed the border illegal.","commenter_a":"This was an ideology, not law...come here legally & you'll have no problems!!!!!","post_message":"All of our clients who were locked up in #immigration detention at Artesia are now getting a right to be heard. But there are others who deserve that chance, and aren’t getting it. @webpagelink"},{"comment_id":"1325194690833614","commenter_b":"People need to slow down","commenter_a":"I hope this guy gets a huge fine and jail time. He could have killed someone.","post_message":"A driver was not injured after this violent crash that landed on Seattle's Burke-Gilman Trail. Gary Horcher shares the story >> @webpagelink"},{"comment_id":"1196543867052750","commenter_b":"This bitch is hilarious, please keep validating all of the stereotypes of a trump supporters! Please wipe your mouth there is shit everywhere!","commenter_a":"Wow we got some really stupid people on here first let me say I'm pre-med graduated with honors I have served as an EMT and probably took care of you idiots in the o.r apparently your lobotomy didn't work we are smart people and educated people the dumb ones are the ones that think he's wasting his time trying to save assholes like you","post_message":"Someone shared a meme featuring an Adolf Hitler quote attributed to Donald Trump -- and his supporters ate it up!"}]
