[{"comment_id":"10153910519885695","commenter_b":"What a pig.","commenter_a":"He should be castrated .","post_message":"Jared Fogle's attorneys asked a judge for leniency, saying he is \"profoundly sorry.\""},{"comment_id":"10150690692729999","commenter_b":"Maybe this can cut back on oil use?","commenter_a":"They should never have entertained the idea of the pipeline in the first place. Sending that dirty oil through our country was a really bad idea.","post_message":"Barack Obama has rejected the request to build the Keystone XL pipeline, saying it \"would not make a meaningful longterm contribution to our economy.\""},{"comment_id":"10153135798986323","commenter_b":"oh no Claire Leivers you are being invaded by more vikings!","commenter_a":"Martin Theander ...thoughts ?","post_message":"A bridge too far?"},{"comment_id":"10153549578273984","commenter_b":"Kims a whore so who cares","commenter_a":"If killing people make me happy, should I go around and do it? No. I hate when people say, do what makes YOU happy. Hmm. That can apply to a lot of things which are wrong. We should do what makes the Lord happy.","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with... Do you side with Megyn Kelly on this one?"},{"comment_id":"880543368756744","commenter_b":"@username ok women let karma take care of me .","commenter_a":"I hope the teen's parents pay for everything for what this family went through. Yes it is the parents fault for not controlling their little shits.","post_message":"The husband of the Ohio woman left brain damaged after teens threw a rock through the windshield of her moving car has committed suicide."},{"comment_id":"10153046800841717","commenter_b":"Thats one stupid bitch.","commenter_a":"Ok, now it should be the electric chair! This woman is a menace to society and to the rule of democratic law. What a pity she is incapable of learning new skills like other related species! Lol...next she wll have her own TV show!","post_message":""},{"comment_id":"1091478814208499","commenter_b":"what a dumb bitch","commenter_a":"Our President has made it ok to be racist again.","post_message":"Doesn't seem like EVERYTHING is racist? According to the New York Times anyway."}]
