[{"comment_id":"503378786489136","commenter_b":"She is nothing but a bigot. Keep her locked up until she complies","commenter_a":"Do the right thing. Spread hate in the name of Jesus and shield your bigory with the bible. Claim you are a christian to defend your sorrid past to justify issuing your twisted moral judgment on others. Yes than you will be a twisted evangelical christian spreading the hate of your chosen religion.","post_message":"Who is the clerk in the middle of the same-sex marriage debate?"},{"comment_id":"10153570546732464","commenter_b":"I am sure that this wont just amount to more talk from you and that you will actually do something. Yeah right.","commenter_a":"GO TED, GO\"!!!!!","post_message":"Our first priority should be stopping a bad #IranDeal that jeopardizes the lives of Americans: www.stoptheirandeal.com"},{"comment_id":"10153894921947217","commenter_b":"French problem they let them in","commenter_a":"Why you guys can't reports on the Massacre that taking place in Congo Beni region in Thr DRc","post_message":"The BBC's Richard Galpin was with protesters in Calais. Truckers, shop owners, farmers and police are blocking the motorway to the port and channel tunnel demanding the government find a solution to the problems caused by the migrant camp nearby. #FacebookLive"},{"comment_id":"10154634366371729","commenter_b":"so now we support the lazy mongrels","commenter_a":"FLORIDA EVEN BETTER, NO INCOME TAX LOW SALES TAX AND NO COMMUNISTS.","post_message":"Of course they're moving to Texas!"},{"comment_id":"502672606580208","commenter_b":"Skinny African","commenter_a":"Chris, paddy maybe?","post_message":"Yes, marijuana gives you the munchies...but it can also make you thinner. Learn more here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"10153641231211337","commenter_b":"More like a Cabbage Patch doll had sex with that weird chick who snorts Ajax in Up in Smoke.","commenter_a":"Amy Schumer looks like Reece Witherspoon had a baby with the Pillsbury Dough Boy","post_message":"PERFECT: Amy Schumer was ready when someone compared her to the American Gothic lady..."},{"comment_id":"10154460376356955","commenter_b":"Let's get real honest for a minute. WHAT demographic purachased most of the 80 million copies of \"FIfty Shades of Grey\"? White suburan WOMEN. They were ok with the talk about p888y in that book and movie, but are all the sudden appalled at trump's language 11 yrs ago.. As espn football guys would say, \"COME ON MAN\"!","commenter_a":"Funny how all the establishment types who have fought to stop Trump all along, republicans and democrats alike, are the ones most offended by coarse language and not so bothered by corruption and criminal activity.","post_message":"Voters Heckle Paul Ryan, Chant: 'SHAME ON YOU!'..."}]
