[{"comment_id":"928293913874616","commenter_b":"Brain dead liberals.Why would you want to force someone to marry you?","commenter_a":"What makes anyone think that someone would want the clergy in your faith to perform their ceremony if they did not believe in it. Two people in love that want to get married would never choose someone to marry them that was not accepting of them. There are many other clergy accepting out there. Not all WANT religious rites. Civil ceremonies performed are the legal ones that count. Not one person (straight or gay) can get married in the church without that civil license first. People are getting totally out of hand on this. The church is going to do what they want anyway. What really counts is marriage is legal for all.","post_message":"Wow."},{"comment_id":"10153755876406337","commenter_b":"Fuck that hoe","commenter_a":"So I guess they're never ever ever getting back together","post_message":"IT'S OVER: Taylor Swift allegedly dumped Calvin Harris because of an, ahem, \"massage\"..."},{"comment_id":"809196999209345","commenter_b":"you are so full of it jeb - and you don't stand a chance. even insane republicans are done with the bushes. what's the policy on a presidential candidate's brother being a wanted war criminal????","commenter_a":"I am saying \"boo,\" not \"boo Jeb,\" though I AM booing Jeb. Boo!","post_message":"Most passionate moments of #DemDebate are always about who will ban more guns and who will give the gov't more control over your health care."},{"comment_id":"10153649562025950","commenter_b":"Dan Haggerty could have prob saved both..... but hes dead now. that man loved animals .__.","commenter_a":"It should never even get to the point of having to kill an already endangered animal. The zoo failed this gorilla and the little boy.","post_message":"At one zoo, qualifications include gun-loading skills, twice-annual target-shooting tests and a drill that looks like this:"},{"comment_id":"10154301833998487","commenter_b":"The onus should be on the Jewish men: if they believe that women should not be swimming with them, then the men will just have to find someplace to swim.","commenter_a":"No. Your religion is your problem. If the pool wants to allow certain groups, including religious groups, to reserve the pool for certain blocks of time (like a water fitness class), that would be okay.","post_message":"Should city pools accommodate women whose religious beliefs forbid them to swim in front of men?"},{"comment_id":"1393293527430364","commenter_b":"Run us over girl. I'd love to have universal healthcare and lose this moron in command.","commenter_a":"All of this it's so true I've said this exact thing to you @username being Canadian fucking rocks 🇨🇦🇨🇦🇨🇦 y'all could learn a bunch from us if you could see past the orange dildo standing in front of you guys.","post_message":""},{"comment_id":"1173361852693721","commenter_b":"Oh oh, look out behind Hillary, she has her gass again, and gives it up to everyone on stage.","commenter_a":"Liar Hillary she just can understand that lying is not normal well I guess it is for her and Bill and Obama and her Party.","post_message":"Donald J. Trump is calling Hillary Clinton a liar, openly calling her a liar for making up that story about his being a recruitment video for ISIS. He's now demanding an apology for her lies."}]
