[{"comment_id":"10154455210992577","commenter_b":"Mite as well. Hillary going to rig it so why not lol","commenter_a":"If the biggest criminal in the world doesn't want all that competition from Hillary who can blame him?","post_message":""},{"comment_id":"1056274324413039","commenter_b":"You ladies here are absolutely correct, with your minds guns are for killing, and yes you for sure do not need to own one. If a person thinks that guns are just for killing, they sure as fuck better not own one... Let's start a new asshole list and get some signatures that states, If you are a total fucking idiot that believes guns are just to kill shit, then you do NOT and will NEVER be able to own a gun. :) Hows that ladies better? I broke it down and separated the stupid shit you people come up with. Ok, lets hear whats next,...","commenter_a":"Gun nuts who needs loads of weapons and ammo suffer from paranoia. Paranoia is a mental disease. Any person, especially those with existing mental problems can have a psychotic break any time. People like this are dangerous to the rest of us.","post_message":"Nothing says \"I'm a good Christian American\" more than protesting a priest calling for peace."},{"comment_id":"10153937537377894","commenter_b":"No wonder she's an Ex","commenter_a":"Wait. So she is saying he disrespected the flag, what he is doing is wrong, and after all of that she has the nerve to say he needs to be humble? The stupid ass Star Spangled Banner is NOT the Pledge of fucking Allegiance, first of all. I wish people would recognize that. Second, draft dodging is ILLEGAL, you \"allegedly\" advised Muhammad to do that and now you want to split hairs about the \"right way to protest\"? Third, how is he not humble and if he wasn't why should he be? Muhammad Ali famously talked all types of shit now she telling a nigga to humble himself, bih, go away.","post_message":"Girl, Bye! Muhammad Ali’s Ex-Wife Says Colin Kaepernick Should ‘Get Off His High Horse and Humble Himself’"},{"comment_id":"1177291819033735","commenter_b":"Boy that was a huge crowd! 😂","commenter_a":"Good for you, kid!","post_message":"WATCH: A kid yells \"you suck\" at Ted Cruz. More here: @webpagelink"},{"comment_id":"10154491672598843","commenter_b":"Nice but ignorant..just because it looks nice doesn't mean it is. Well if we're going to have a March about saving babies, we must teach to save wome and men. Teach women knowlage of self worth not through sex to have standars. Teach men to stick around and train this child up. Their are far to many women who trust in the wrong Ideas about relationships and sex. A comunity of ignorance instead of in the scools teaching to waite and young girls to choose a good partner who is consistent. Also have father's taking responsibility instead of running off and leaving women to fend for themselves. Child support isn't always enforced, if she has no family, if she is in poverty look at where plan pearenthood is located in the getto where the poor is and if you think the CPS system isn't filled up over populated, better look ...","commenter_a":"However, they left behind lots of litter for someone else to clean up. How thoughtful.","post_message":""},{"comment_id":"10153005489041770","commenter_b":"And who says this female is not a partisan hack?","commenter_a":"This woman is an enemy to our country.","post_message":"\"There’s nothing more important to me as a Jew to ensure Israel’s existence is there throughout our generations.\""},{"comment_id":"1752390171683339","commenter_b":"Well if you like being killed because your a woman so be it but not here in the US stay in your own free country an kill all you want just not here","commenter_a":"She has to be in the running for the Idiot of The Year Award, she has my vote.","post_message":"You have got to be kidding me. Get this liberal trash off the air. Do you think this is racist and ignorant?"}]
