[{"comment_id":"1159671620816281","commenter_b":"Why didn't you keep your promise and leave this country? Because you were so sure Hillary was going to win! LOL just please shut up! Get over it! Do you think it you keep going on &. On, things ar going to change? NOT!!!","commenter_a":"Ted danson probably gags thinking of his past. Yes,he used to do the deed with that😁","post_message":"Whoopi definitely gets what she has coming after she made this dim-witted attempt to insult Trump. She so deserves the humiliation. Let's get 5,000 'LIKES' to show that America wants \"The View\" CANCELLED PERMANENTLY! @webpagelink"},{"comment_id":"1390855700937474","commenter_b":"RACIST!","commenter_a":"I can't imagine ever turning down an invitation to the White House no matter what! As an American I would consider it the highest honor!!! Can I go in his place?","post_message":"We know that Brady, Belichick, and Bob Kraft are friendly with President Trump. But one member of the Patriots doesn't seem so keen on going to the White House."},{"comment_id":"1276342415734510","commenter_b":"Well they didn't because Peter Falk hadn't even been born yet.","commenter_a":"I VOTE FOR THE AMERICAN INDIANS.TELL ME WHY DID THE EUROPEANS KILL THE NATIVES ,IF THEY WERE BARBARIC THEY WOULD HAVE KILLED COLUMBO AND BURNED HIS SHIPS.","post_message":""},{"comment_id":"1753098654934241","commenter_b":"I'm not making this Woman commit suicide, and I'm not the one to stop her.","commenter_a":"Jump bitch.","post_message":"She wants to end her own life."},{"comment_id":"10153713889518869","commenter_b":"this particular immigrant is a whore.......you dont get a pass for being an immigrant......","commenter_a":"an Immigrant bar whore toy bought by Donald....the end.","post_message":"The couple's courtship story is as chaste as its backdrop is louche: Donald saw Melania at an event, he asked her for number, but Donald had arrived with another woman—so Melania refused. He persisted."},{"comment_id":"1735673330034205","commenter_b":"the last thing this world needs is a liar like Hillary Clinton","commenter_a":"Hillary, we don't need any more of your failures! you've proven thru experience that you cannot lead anything!","post_message":"\"'Diversity' has come to mean that you have to be accepting of every different thing but you cannot, in any way, celebrate a traditional viewpoint.\" – Mike Huckabee"},{"comment_id":"438679209798098","commenter_b":"What a stupid cunt.","commenter_a":"I'm in love with this guy.","post_message":"Tomi Lahren fails to see Lady Gaga's subtle political message and still uses it to rip on Beyoncé. + Hasan Piker is heartbroken Tomi never hit him up when she came out for Bill Maher."}]
