[{"comment_id":"1270991109602974","commenter_b":"You are full of BS. Damm Obama imported these terrorists and should be charged and prosecuted!","commenter_a":"It doesn't matter what kind of statement Trump makes if it's not from the heart and just words he thinks people want to hear it meant nothing at all. When our PresidentObama sends his condolences and express his deepest regrets it is from the heart. Trump on the other hand is only putting on a show to try to make President Obama look bad because that is what all the Repugs do!! Won't work!!!","post_message":"This is what a real leader does!"},{"comment_id":"10153378230871770","commenter_b":"You have to be a special gentile stupid to call the protesters racist.read the Talmud you stupid bastards.","commenter_a":"I think I seen that dude on delliverance movie","post_message":"Violent anti-Israel protests broke out at the American Israel Public Affairs Committee’s annual conference in Washington, D.C. on Sunday."},{"comment_id":"10155729304999638","commenter_b":"Trump is another Hitler in the making! Shame on all those Americans who brought him into power!!! Wonder what his next steps will be - Muslim concentration camps!?","commenter_a":"Hey Donald does this sound familiar! \"An evil exists that threatens every man, woman, and child of this great nation. We must take steps to ensure our domestic security and protect our homeland.\" -Hitler Racist big Donald and his racist supporters all deserve to go to hell!","post_message":"Donald J. Trump's controversial \"Muslim ban\" just hit a major legal roadblock."},{"comment_id":"10152885011267507","commenter_b":"Woman put up with it because we are use to it. Woman are also so busy and have not prioritized changing this. Women will eventually say enough of this nonsense and put a stop to it for good. It is only a matter of time.","commenter_a":"Women in other developed countries are getting treated better ! Why do American women take this abuse ? No paid maternity leave , no paid sick leave , no paid or very meager paid leave , WTH is wrong with American women demand it and demand it now!!!","post_message":"Let's be good to our mothers today and EVERY DAY!"},{"comment_id":"10155435763498812","commenter_b":"I","commenter_a":"@username pretty horseys","post_message":"WATCH: When a donkey struggles to get over a fence at a non-profit animal protection sanctuary in Italy, he gets a helping hoof. @webpagelink"},{"comment_id":"10157170758630354","commenter_b":"This woman is psychotic.","commenter_a":"She's fucking disgusting to look at! A professional con artist like the Obama's and the privilege Clinton's they all should get tarred and featured in public !","post_message":"Want nightmares? WATCH:"},{"comment_id":"10153344147357439","commenter_b":"Lol is that where Muslims come from? Wow didn't know that!","commenter_a":"Send them back to Egypt.","post_message":"DC Area Professor To Catholic University: Too Many Crosses On Campus For Muslim Students To Pray @webpagelink Anywhere American law and Islamic law conflict, it's American law the inevitably has to give way. These demands for special accommodation are everywhere. Hertz, Heinz, Costco, IKEA, Target, Wal-mart, Disneyland, McDonalds and hundreds of others have all been in the cross-hairs. Islamic demands and the ensuing lawsuits in order to impose sharia...."}]
