[{"comment_id":"483709631819617","commenter_b":"FUCK HER and THEM. NONE of THEM HAVE THE AUTHORITY OR POWER to TAKE OUR GUNS!!!!!!!!","commenter_a":"She wants to dictate just like her husband. Make laws she has no business making, and breaking laws as they see fit.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"944837115644330","commenter_b":"No way trump will win this election! Most white, asian, african american and latinos will unite on november and bit the heck out of trump! Never will vote for a someone that makes fun of disable, a rapist, a liar and a PSYCHO!","commenter_a":"The audacity of your campaign sickness me to my core :/ . You and your minions are the \"deplorables\" . All you that support these monsters should be ashamed of yourselves! #Trump2016","post_message":"If Donald J. Trump becomes president, how can we guarantee that he'll choose America's security over his own financial interests?"},{"comment_id":"960936923986215","commenter_b":"She is loud!!! Trump!!!","commenter_a":"Now I'm really confused, Trump is not the true conservative, and I thought Palin was.","post_message":"Sarah Palin is ready for someone who can take down ISIS and #MakeAmericaGreatAgain- are you?"},{"comment_id":"10153617326474032","commenter_b":"William you have good reasonings, I agree that we need to know who's coming in, but remember that we have some sketchy people who shoot schools and movie theatres here in our own country born and raised. I agree we need to have background checks, but they take a while and that's why they risk their lives to find work and live better lives here. Why would an illegal want to just cross the border to cause havoc? They're here to work. An illegal Mexican can just do that all at home with the money they can make from drug cartel business. Like I said, it doesn't matter where you're from, there is bad in every nation and continent across the world. Even Antarctica. Some penguins are not nice birds.","commenter_a":"Personally, I've lived here my whole life in AZ. I've had more problems with the snow birds than the illegals. Last major bill before 1070 was bullshit. They wasted tax money trying to justify denying EMS to illegals when their own research showed a $240 million dollar surplus brought in by taxes and other monies by illegal immigrants in '06-- even after accounting for the expenditure of 'caring' for them. Here's a thought, how bought we reform and streamline the citizenship process so that people who want to be here and are willing to work here can actually do so and not wait 10 years to get citizenship.","post_message":"For Arizonans, immigration isn't just a campaign issue. Learn what's at stake for all of us at a non-partisan event, #OneNation: Immigration. Get your tickets now: @webpagelink"},{"comment_id":"10156256559580354","commenter_b":"Sure she will, and we will all be getting shot by the crazy people who get guns illegally","commenter_a":"And how many guards does she have!! And I bet we paying for them!!!!","post_message":"Hillary pledges her assault on 2nd Amendment freedoms."},{"comment_id":"10153899395243701","commenter_b":"Please take time to familiarize yourself with actual case law on this subject. Anyone under the influence of drugs or alcohol cannot legally consent to any sexual act. It makes no difference if she got that way voluntarily or involuntarily. YOU CANNONT CONSENT IF YOU ARE IMPAIRED. This is called rape","commenter_a":"I question this case also .... According to the accuser, Cosby urged her to take pills and to drink wine...... Urged her to do so??!!! So she did it to herself! I highly doubt an educated woman would take pills and drink in a room with one man without knowing the out come!! Personal responsibility is what all these people are not understanding! Read more: @webpagelink","post_message":"JUST IN: Bill Cosby has now officially been charged with sexual assault more than a decade after a woman told police the comedian drugged and violated her at his home near Philadelphia."},{"comment_id":"483898831770072","commenter_b":"@username Whoa, calm down woman.","commenter_a":"They could just import it from Iran. I wonder what's stopping that great deal?","post_message":"Italian caviar, that is."}]
