[{"comment_id":"10150742367724999","commenter_b":"Yes Debra! Preach","commenter_a":"What?!! Do you really think young women voters can ignore that Hillary chose a MONSANTO lobbyist as her campaign manager? We'll wait for Elizabeth Warren, thank you very much. In the meantime- Senator Sanders is our Mr. Clean.","post_message":"Hillary Clinton's older feminist supporters had a message for young women who are not backing her candidacy: Shame on you. Update: Gloria Steinem later said she \"misspoke.\""},{"comment_id":"1118917194866740","commenter_b":"Thanks for stating this. I'm a follower of Christ and so glad you get it about Tebow.","commenter_a":"I'm not a Tebow fan, or a Florida Gators fan, or religious. But I never understood the hate directed at what seems to me to be a decent human being that threw his actions has shown hes willing to help anyone. Funny my fellow Athiest scream about this man \"shoving his faith in our face!\" Don't seem to mind shoving their Athiest views down everyone else's throat.","post_message":"\"The goal of this book was if you pick it up with your head down, you finish the book with your head held high knowing that God has an awesome plan for your life, you matter, and you're important -- and that's a bigger identity than anything that the world could ever offer.\" — Tim Tebow on his new book \"Shaken\""},{"comment_id":"1220141934692263","commenter_b":"Most hard working Latino's are no different than any other American that love their country. They want good jobs and a dependable future that illegals won't take their jobs. If they vote for Hillary they know their jobs will be gone. Either by illegal immigration, Middle East immigration or bad trade agreements that will move their jobs overseas. @webpagelink","commenter_a":"Love it.. No only I don't want him for my daughter I don't want him for my sons Trump is bully bully should never be rewarded.. I'm voting blue don't matter who, because Red is to dangerous to give my vote too","post_message":"According to Hillary Clinton's team, the intention of the ad is to show the effect Donald J. Trump's \"hateful rhetoric towards women is having on our daughters.\""},{"comment_id":"851657764869646","commenter_b":"Keep on keeping on...........read the Bible verse EVERY DAY! If the atheists/muslims don't like it then let them leave!!!!!","commenter_a":"good-for-this-principal-","post_message":"YES! This school won't bend to the whims of #atheists! This is how they stuck it to #FFRF:"},{"comment_id":"988452247844232","commenter_b":"If you have a daughter tell her to free her nipple in public and the pervs will come flocking to take pictures. Which will be legal if in a public space. Maybe you should look up Voyeur on pornhub or something and girls of all ages are being creep'd on.","commenter_a":"These sexist comments are appalling. Especially from the women. Keep letting society tell you what's proper and where your naked parts belong. As long as I'm concerned breast were designed to feed a new born. A man can do whatever the hell he wants but a woman has to be restricted to pretty much anything that might make her comfortable because revealing clothing means she's \"asking for it\" and showing her nipples, which are both called the areola on both men and females by the way, would just make men go into a frenzy. Instead of instilling this belief that breast and skin of women are meant to appeal to the eyes of men, teach men and instill in them self control, consent, and respect for women.","post_message":"Here are the nipples so scandalizing that Facebook won let us show them to you. (To see the uncensored version, click here: @webpagelink) #FreeTheNipple"},{"comment_id":"10153549578273984","commenter_b":"Kims a whore so who cares","commenter_a":"If killing people make me happy, should I go around and do it? No. I hate when people say, do what makes YOU happy. Hmm. That can apply to a lot of things which are wrong. We should do what makes the Lord happy.","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with... Do you side with Megyn Kelly on this one?"},{"comment_id":"879108405613069","commenter_b":"He better watch his back. Killery has a lot of time on her hands now.","commenter_a":"Although Comey has a 10 year term, he can be terminated at the Presidents request. He truly needs to go, as well as his assistants. Trump should start with a new regime that will be loyal to the actual rule of law and not a puppet. Thank God lynch is history.","post_message":"James Comey just received the worst news of his life. America demands answers, and you better bet we're going to get them. Do you think Comey needs to come clean?"}]
