[{"comment_id":"10153650702998984","commenter_b":"The evil corrupt white witch.","commenter_a":"It's about time,","post_message":"All I can say is wow. I didn't think this was ever going to happen, but here it is. Hillary has to be terrified right about now... Are you glad the FBI is taking action against Hillary?"},{"comment_id":"948666735231933","commenter_b":"Wow, no misogyny going on here (heavy sarcasm).","commenter_a":"More from man hating feminist jackasses. Keep your legs shut, or demand the guy who stick his dick in you wears a condom. Not that complicated.","post_message":"Patients would also be required to get counseling on celibacy as a valid life choice."},{"comment_id":"1133405013362371","commenter_b":"She looks that way from years of only having a tiny withered Cheeto to satisfy her","commenter_a":"Why does every picture of Melanie look constipated or disgusted. Her eyes are always squinted, and her lips are always tight. I mean it is not a happy look. This is not a rant because she is female, and it is not a comment on her worth or attractiveness. It is a comment on how people show expression in their face. She doesn't look happy at all.","post_message":"Could you imagine the right-wing reaction if the Obamas did this?"},{"comment_id":"10154765929828812","commenter_b":"That retort would demand a Breathalyzer test immediately in any Protective Custody or Dangerous-ness to the public situation. The man is incapable of formulating a complete and comprehensible sentence in English. Does he, maybe speak English a second language like some immigrants do? I've watched people get detained/PCd for less. He's going to lead the free world. We have illuminated the planet with a new low in the dummie-ing down of America.","commenter_a":"One temper tantrum away from WWIII","post_message":"Donald J. Trump says he \"could tell\" from intelligence officials' \"body language\" they were unhappy Pres. Barack Obama \"did not follow what they were recommending.\""},{"comment_id":"10153131128315950","commenter_b":"I hope their daughters get pregnant out of Wedlock","commenter_a":"I'm sorry, but your country deserves one more crazy, running it. Welcome Donald!","post_message":"The House voted to block Planned Parenthood's federal funds for a year."},{"comment_id":"10152785786292434","commenter_b":"All women can give you something. A headache, an empty wallet, herpes etc.","commenter_a":"Everyone has chlamydia. But Norway's a nice place to catch it.","post_message":"Well it certainly got my attention."},{"comment_id":"1797949110492327","commenter_b":"Shut up","commenter_a":"LYING HAG!!!!","post_message":"Hillary Clinton speaks during a voter registration event."}]
