[{"comment_id":"10156996522130354","commenter_b":"I will not vote for Ryan ... he is a socialist....","commenter_a":"Yep!","post_message":"TED CRUZ: PEOPLE WILL ‘REVOLT’ IF NOMINEE NOT ME OR TRUMP..."},{"comment_id":"10153542197218984","commenter_b":"This wouldn't be my daughter. First, they are in your country not theirs. They need to assimilate. This is why Muslims are taking over Europe. Read the book, \"While Europe Slept!\" Once we get a Christian president in the USA, the Muslims here will go back to their cubby holes. The Muslim president we have are giving them a very false sense of security.","commenter_a":"Unbelievable. They don't want to follow American customs, go back to wherever you came from.","post_message":"This school just ordered parents to make sure their daughters made Muslims happy in a sick way... this is full-on surrender. Spread this story... your children's school could be next!"},{"comment_id":"791518854323422","commenter_b":"@username She won't even make it out of 2016 before being arrested!!","commenter_a":"When I voted in Virginia on 10/13/2016, they never checked my ID. Just sayin folks .................. better watch these cheating people .... just in case!!!!!","post_message":"Live Now: Donald J. Trump speaks at a rally in Johnstown, Pennsylvania."},{"comment_id":"10154007626519456","commenter_b":"Yea, maybe this guy is right...slaves should learn to be free if they feel entitled to it!! Bring back discrimination!","commenter_a":"Isn't the govs job to tell anyone what they have to pay anyone for services. If you don't like what you make, increase your skill set instead of having the gov hold your hand.","post_message":"The bill passed on a 71-31 vote, and will now move to the Alabama Senate."},{"comment_id":"1265414436832359","commenter_b":"SHAME ON THOSE ASSHOLES","commenter_a":"Alabama - the best argument in favor of mandatory abortion.","post_message":"From Restricting the right to vote to using $1.8 million to renovate his beach house, Republican Governor of Alabama now sinks to a new low with awarding his staff with $73, 405 raises after blocking a minimum wage increase in Birmingham."},{"comment_id":"1701496370115384","commenter_b":"GET OUT OF OUR home & go back to hell where u belong!","commenter_a":"yes!","post_message":"16 U.S. States Come Together To Ban Shariah Law It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10154526330973352","commenter_b":"I also stated that this evil woman deserves prison because she knew damn well what she was doing!!!","commenter_a":"This isn't mental health issue. She knew what she did was wrong as she hid the bodies. That's not mental health issues. First thing everyone wants to make of horrible crimes like this is that It's mental health issues. Bull shit. This woman knew what she was doin so call it what it is....it's EVIL. She is an evil woman who got tired of being a mom and decided to kill her children. No empathy for this murderer. Call it what it is. There are just evil people in the world sometimes. Not mental health impairments every time a parent murders their child. She needs to rot to death in a jail.","post_message":"Pictured: The 'pregnant' Phoenix mom, 29, and her three young sons that she 'stabbed to death before stuffing their dismembered bodies in a closet and suitcase and trying to kill herself'"}]
