[{"comment_id":"10154902832777235","commenter_b":"Fuck that old bitch. She has probably done the same shit a million times.","commenter_a":"She came from pigselvania, lol","post_message":"This jolly little elf of a person is just brimming over with holiday cheer!"},{"comment_id":"10153855259970329","commenter_b":"So the same saying goes if a female swimmer ... participated with the same enthusiasm. .. in a common wealth games ... yeah menstural blood after all ain't unhygienic. .. its holy","commenter_a":"It's not about it being shameful, it's about it being a private thing. Like going to the bathroom is a private thing.","post_message":"“We’re the ones having a period and we’re the ones having to pretend it doesn’t exist.\""},{"comment_id":"1193969757300354","commenter_b":"I'm not a supporter of either, and race has nothing to do with it. So for you to bring it up makes you the racist. Watch TV, read the newspapers... There are increases numbers of illegals coming across our borders (Chinese were the latest reported in increased numbers over Mexican border), so it makes no difference where they are from, but where they are coming in through! California's politics is way out of whack with the rest of the country, and the demographics show which and where. That demographic could be put up across the country on every state and the trend would probably be the similar.","commenter_a":"more welfare& illegals more clinton... go figure!","post_message":"Sanders performed better than Clinton in California's northern, rural counties, which also tend to be whiter than the rest of the state."},{"comment_id":"10155131365895231","commenter_b":"Girl preach!","commenter_a":"She will go when He calls her Home...we've all been on Life Support from our Day 1...","post_message":"Prayers for the Houston/Brown family: Bobbi Kristina will reportedly be taken off life support on Feb. 11th to allow her to pass on the same day as Whitney Houston."},{"comment_id":"1331908300162530","commenter_b":"This is disgusting, disgrace to America this never happen before, DJ.T is disgrace for our America, so dangerous wild animal.","commenter_a":"He is right! We unfortunately live amongst animals!!","post_message":"Trump said organized 'thugs' shut down his First Amendment rights in Chicago"},{"comment_id":"10154307369739099","commenter_b":"Well a attack on citizens is a attack on all of us as well punk","commenter_a":"So DeBlasio you're still going to give criminals a free pass you hypocrite ?","post_message":"\"An attack on our police is an attack on all of us,\" Mayor de Blasio said @webpagelink"},{"comment_id":"853169931483995","commenter_b":"The article isnt dissing Melania, it's reflecting on a direct quote where Trump said giving Ivanna control of a business property was the end of his marriage, and he learned he didn't want a wife who was ambitious, who worked, because that meant she didn't focus 100% on him. Which is sexist af. But he wants his daughter to be an Ivanna, so ... also hypocritical. Should women be successful in business or not, according to Trump? Are successful woman attractive to men like Trump. Read the article, it's not made up.","commenter_a":"Such an interesting article Christine Johnson!!! I find it all fascinating, will be so interesting to be around in Nov - when the country decides! Hope to see u tomorrow? Ax","post_message":"The Trump family embodies a very old sexist hypocrisy: men who want one thing for their wives and another for their children. Read in The New York Times Opinion Section."}]
