[{"comment_id":"10154739009466337","commenter_b":"I say extract the bitch the bitch that's in you that complains about characters of fiction switching ethnicities","commenter_a":"I say cast a white dude. Because it's cool to switch race's of established characters now right?","post_message":"BLADE'S RETURN? Marvel hopes so..."},{"comment_id":"903840716398977","commenter_b":"Nestle can suck my balls","commenter_a":"Rick Rule","post_message":""},{"comment_id":"10152949847416615","commenter_b":"A job well done champ!!","commenter_a":"I need some of that cashola","post_message":"The New Castle Police Department says K9 Champ was instrumental in locating the $15K that was hidden throughout the residence..."},{"comment_id":"1017113771678485","commenter_b":"@username no dont get mad because Hillary is a corporate puppet slave and black people dont like her!!!","commenter_a":"Sorry black folks don't like Hillary","post_message":"Speeches, selfies and heart-to-hearts: A look inside Hillary's recent events in African American communities."},{"comment_id":"10153530016051051","commenter_b":"@username So the child who was raped matters less than a nonsentient parasite?","commenter_a":"I am pro-life but in a case like this, there is no reason on the earth that this 10 YEARS old girl should have to endure any of this, and if anyone says other wise they need to have their heads examined, Rape is never, ever, the victims fault and if that results in pregnancy she should most deff be able to end the life of the baby. In other things abortion is still the womans choice and she and she alone decides weather or not to carry the baby, no one else has the right to say yes no or maybe on the situation at hand including the father, it is not his body that has to go through any of the complications. while i am Pro-Life and think that they should choose to let the baby live and give it up for adoption, i would never, ever tell ...","post_message":"A 10-year-old girl was raped and impregnated by her own father. Now she has learned whether or not she can terminate the pregnancy."},{"comment_id":"10153458857456107","commenter_b":"Keep them out.","commenter_a":"As an avid, long-time, supporter of your campaign (I mean... I was hoping you'd run for president back in '04), I am very disappointed to see you taking this fearful and outdated stance. Isis doesn't need refugees to sneak into our country, they have the internet.","post_message":"Today I introduced a bill that calls for an immediate moratorium on visas for refugees. My bill will also stop all refugees as well as others from obtaining visas to immigrate, visit, or study in the U.S. from about 30 countries that have significant jihadist movements. This bill will be paid for with a special tax on arms sales to any of these countries. Read more here: @webpagelink"},{"comment_id":"10153156704581051","commenter_b":"So what should he have done? If a chick is crazy like this chances are she isn't just gonna let him walk away. Men can be abused to and it's never right her ass is exactly where it should be.","commenter_a":"What kind of wimp does a guy have to be to call the police because his girl friend slapped his sensitive little face, and hurt his widdle feelings.","post_message":"This woman set up a secret camera to keep an eye on her boyfriend. When she reviewed the footage and saw what he was doing while she was gone, she snapped."}]
