[{"comment_id":"726384220793520","commenter_b":"Mostly things that happen bad in this country always happen in Texas are with someone from Texas","commenter_a":"That kinda stuff goes on all the time in Texas","post_message":"Terrible."},{"comment_id":"10155092552983797","commenter_b":"I'd rather have all those than Depression :D Wait, you said, \"CORRECTion\"... how do we even know the Bible is correct? Bible stated Jesus is white.. we know that's false. He's Black. The Bible is a contradiction to other verses and such.","commenter_a":"Really??? Lol! Side effects for birth control for women- Intermenstrual spotting. ... Nausea. ... Breast tenderness. ... Headaches. ... Weight gain. ... Mood changes. ... Missed periods. ... Decreased libido. And thats just the 10 common side effects.","post_message":"The shot seemed to be as effective as other forms of contraception, but the men complained of side effects like acne and mood swings..."},{"comment_id":"10154607163603124","commenter_b":"Awww! You know me","commenter_a":"@username look how cute!","post_message":"Feline stressed? Try to stay paw-sitive! @webpagelink"},{"comment_id":"10153691446913984","commenter_b":"Trey what the bitch in jail","commenter_a":"Someone should call that witch on the carpet. She's a corrupt liar, but I guess that I am supposed to be OK with that because she is a Liberal.","post_message":"Looks like Hillary Clinton just got another piece of bad news, and it's from one of her least-favorite people. 'Bulldog' Gowdy is hot on the trail! Do you support Trey Gowdy's fight to hold Hillary accountable?"},{"comment_id":"10154432895041973","commenter_b":"everytime i have to wait for TOO LONG ...i'd rather do it myself","commenter_a":"Yaaaayyyyyyy.... So tired of waiting to have some poor guy out in the cold, heat and/or rain to come pump my gas. And no, I haven't had someone offer to wash my windshield or check the oil since I moved here 17 years ago.","post_message":"You might be pumping your own gas soon if you head out to rural Oregon."},{"comment_id":"1160655937308596","commenter_b":"Many Muslim women are sick of being told what they are and what they can be from western women who have no clue about their culture, that's why Muslim Feminism had to develop on its own instead being part of the bigger movement, _that's_ sad if you ask me. Feminism should be about equality not about following one group of women's notion about what you should look, feel or talk like.","commenter_a":"I'm seeing a lot of diversity in the Muslim community about the concept of World Hijab Day (non-Muslim women wearing the hijab for a day in solidarity). Would love to get your thoughts on whether it's cultural appropriation, or upholding the more conservative aspects of your faith. I did participate last year, but not sure if I will again.","post_message":"Her \"Ask a Muslim\" booth was a huge success! - Parker Molloy"},{"comment_id":"10154276902002908","commenter_b":"Juan. Not one illegal should be in this country. Trump is spot on. If you were in someone's house with a fake ID you would be charged with breaking and entering and impersonation and sent to jail. Illegals should be deported and sent back to their country on the spot just like criminals in America are. It's that simple.","commenter_a":"Plus they do like 32% of the actual work","post_message":""}]
