[{"comment_id":"10153080591266748","commenter_b":"He's a fucking queen.","commenter_a":"Better headline: Tom DeLay urges a complete breakdown in the judicial/governmental structure. Because 'murica.","post_message":"Former GOP House majority leader Tom DeLay urges anti-gay conservatives to stand up to the \"ten\" Supreme Court justices."},{"comment_id":"1201515593201525","commenter_b":"Sad as it is. As often as this stuff happens and these woman still don't learn","commenter_a":"Update she was found dead and the man who did it is in custody. ;( RIP>","post_message":"UPDATE: Human remains found in a recycling bin have been tentatively identified as the missing Renton mother, Seattle police said. A suspect was arrested in Snohomish County. DETAILS >> kiro.tv/Renton-Mother"},{"comment_id":"822921484411860","commenter_b":"Run him out of America or sent him to Islam for good !","commenter_a":"Absolutely YES! Police are bound by laws and orders that do not allow any other real form of expressive protest. This sends the message loud and clear. It is also a great honor of solid support to the murdered officer whose Mayor helped provide the hostile environment in which this officer was murdered.","post_message":"Was this the right move?"},{"comment_id":"1227002650653096","commenter_b":"The LATIN EMPIRE AWAKENS! They realize that Republicans will get them into American class warfare!","commenter_a":"Latino Republicans? Does such an animal exist?","post_message":"Latino Republicans are mounting a pushback against the more conservative wing of their party."},{"comment_id":"10153736667641350","commenter_b":"She lost","commenter_a":"Crap weazel !!!!","post_message":"The woman felt her nephew was negligent for giving her an enthusiastic hug."},{"comment_id":"10153433467800950","commenter_b":"Lmfao living in the hood ...Girl u crazy ..","commenter_a":"I don't care how you spin it...I feel for this man...we send our children off to defend a country that doesn't give two shits about the lives of those we send!!! We expect them to come home the same as when they left after killing people and watching theirs friends die...REALLY?! He was a kid who got caught up in and then taken against his will..He suffered years of torture and now we want to punish him more...I'm sorry but that is as wrong as you can get!!!!!","post_message":"In October, the leading GOP candidate called Bergdahl a \"traitor, a no-good traitor, who should have been executed.\""},{"comment_id":"10153784446624203","commenter_b":"@username-She answers questions, she just doesn't give you, narrative you want hear-why should she. It amazes me, the vagina remark! Must be nice to have 240 years of men. Too bad it's not you electing, the first male President. Try reversing that and how would that feel? Oh and a lot our Male Presidents, haven't been real Winners. CONgress mostly MALE-mostly FAIL!","commenter_a":"Clinton is dead in the water. Mass media is bought and paid for. Sanders for President!","post_message":"\"Hillary Clinton may have trounced the men at Tuesday debate, but 2016 isn likely to be the year we get our first woman commander in chief.\""}]
