[{"comment_id":"10155847652065354","commenter_b":"Susan Sarandon can go lick a monkey's butt....friggin dingbat.","commenter_a":"Susan Saradon should lick the bottom of a seagull!","post_message":"Susan calls her a \"true American.\" But another celebrity has the guts to call out this pop diva's antics..."},{"comment_id":"950959664958199","commenter_b":"She's a skunk","commenter_a":"Jackie Kennedy is turning in her grave.","post_message":"Michelle Obama Makes Rap Video: YoYo! Only Way To Succeed Is To \"Go to college!\""},{"comment_id":"1214194218600606","commenter_b":"Coming from a HoeAssNigga","commenter_a":"Is it a horrible thing that Rihanna is a hoe.","post_message":"\"Is it such a horrible thing that she pretended to be black?\" Rihanna said"},{"comment_id":"662069217316990","commenter_b":"Sorry Bitches !!! Go to jail !!","commenter_a":"Yes!!yes!!!!!yes!!! that;s a shame!! just think?? if that was your mom! or dad????","post_message":"These thugs tortured nursing home patients for an insane reason. These two are monsters. Let's lock them up and throw away the key. Do you agree these thugs should do life?"},{"comment_id":"10152739817385047","commenter_b":"Signed! Stop abortions!!!!!","commenter_a":"Lord I pray that Congress will do the right thing here & save these babies. In Jesus' name I pray amen","post_message":"Late-term abortion is being put to a vote this Wednesday in Congress—potentially putting a stop to abortion at and after 20-weeks gestation. Sign & Share this critical petition to tell Congress to defend life: @webpagelink"},{"comment_id":"508254089382552","commenter_b":"It's cheaper in the long run to deport them now.america can't continue to feed ,clothe,and give free everything to these people.Damn it our vets and needy in america should come first.","commenter_a":"We don't , and they don't assimilate ..","post_message":"NO."},{"comment_id":"851989354991641","commenter_b":"This is America period,,,all states should ban immediately!","commenter_a":"KEep IT UP","post_message":"It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"}]
