[{"comment_id":"1140463419377942","commenter_b":"Oh a gold dress, is that all? I thought maybe her penis was showing through her dress! Ha!","commenter_a":"For what she spent on that dress they could let all of the Afghanistan veterans keep the Enlistment bonuses they received 10 years ago instead of charging them $650 each a month until the entire $10,000 plus interest is paid back!","post_message":"It was Michelle Obama's final state dinner, and the first lady was trying to make a good impression. However, people noticed something wrong with her dress in a big way... now, it's making news everywhere. This is sick... it shows you who the Obama's REALLY are."},{"comment_id":"1830155707222526","commenter_b":"@username ...Well, CA did vote her out...but the rest of America did!!! Oh, HAPPY DAYS!!!","commenter_a":"This \"Deplorable\" American Christian is voting for TRUMP, I live in California and all my neighbors and friends are voting for TRUMP...We are tired of the lies and corruption of career politicians!!!!","post_message":"Matt Walsh: A Clinton win won’t be a victory for women but a victory for corruption."},{"comment_id":"10154095575861051","commenter_b":"Hillary ain't sending no one back she'll let the whole world here, terrorists included","commenter_a":"I just hope that when Hillary wins she will issue a deportation order for Ted's old man.and sends his goofy ass back to Cuba.","post_message":"Ted Cruz says Trump would absolutely be a better president than Hillary Clinton, so he'll be casting his vote for him this November. Do you feel the same way?"},{"comment_id":"10154114920114726","commenter_b":"She is an assault magnet!!","commenter_a":"What do Leonardo DiCaprio Congressman Allen West, the NYPD and Students for liberty all have in common? They all had assault charges filed by Michelle Fields......who is Michelle Fields>? The Woman who is claiming she was assaulted by Mr Trump's Campaign manger. Check her background.","post_message":"Even liberal Susan Sarandon thinks Trump is better than Clinton."},{"comment_id":"10154910667241162","commenter_b":"We both like thick @username, but for some strange reason she wanna be thin.","commenter_a":"Demetrius DaInfluence Hardy and @username told y'all it was debatable.","post_message":"We all agree that Chicago has the best pizza - but the debate in our newsroom is over deep dish or thin crust. What your pick? Our Hungry Hound did some research for you: @webpagelink"},{"comment_id":"1012583592144355","commenter_b":"and if we stay in toltel control","commenter_a":"More false propagander to try to get us to vote to stay in. The damage has already been done the EU Commission is an unelected, self sustaining, beaurocratic, and vastly overexpensive power crazed clique that will not change its self no matter what this person says. The only way to free ourselves of this shower is to vote to leave!","post_message":"Has the EU meddled too much in the daily lives of its citizens? @webpagelink"},{"comment_id":"10157992746740594","commenter_b":"@username if I'm going to make my mother get up in the middle of the night and travel four states to feed me she better be bringing more than a hot pocket.","commenter_a":"This is great, this is just what you liberal snowflakes need to cope with reality. It's nice that Google is providing portable \"safe-spaces\" for tomorrow's Captains of State Dependency.","post_message":"Turn photos of Donald Trump into adorable kittens with this Chrome extension."}]
