[{"comment_id":"456612701195977","commenter_b":"Try shutting your mouth and your legs , bitch !","commenter_a":"yep a free ticket to Africa","post_message":"Should Blacks Be Compensated For Slavery? Comment 'yes' or 'no'."},{"comment_id":"1056647814370639","commenter_b":"Let's be honest. HE is not confused. HE is still a MALE. And absolutely a disgrace.","commenter_a":"NO, are you kidding me?","post_message":"Do you agree with MAC's decision? Yes or no?"},{"comment_id":"394094587445502","commenter_b":"No they are everything that is wrong with our world now!! We need to remove them from America!!","commenter_a":"Desert is calling. ...","post_message":"“You Are Everything That is Wrong in America”"},{"comment_id":"10155272434600652","commenter_b":"Testing. Testing. Forgive the interruption, but -- big surprise! -- something is all screwed up with my Facebook News Feed/Pages Feed and I read a suggestion that I should comment to get things to show up again.","commenter_a":"I can sum up the cause of China's rise in four words: \"American wants cheap crap.\"","post_message":"How to think about China's phenomenal rise:"},{"comment_id":"10153945644022061","commenter_b":"@username because the wife wouldn't lie right?","commenter_a":"Speak children...\"Out of the mouths of babes!!! All of the racist and fearful cops should be out of the streets and sitting behind a desk (not having to deal with the public). A lack of respect is found in all groups of people and that still is not an excuse to slaughter a certain group. Americans kill, so should terrorists groups kill us??? Should animals attack people because they kill them for sport or make them zoo exhibits?","post_message":"TAKING A STAND: Kids of Charlotte spoke out at a city council meeting about their fear of the recent violence in their hometown: @webpagelink"},{"comment_id":"633021916884133","commenter_b":"Handler is not someone who the 1st lady would want to meet with. Talk about the trash...","commenter_a":"Chelsea Handler who is a hardcore supporter of Hillary Clinton and a Democrat. She is actually a racist.","post_message":"Wow..."},{"comment_id":"712691792254732","commenter_b":"Nothing going to happen to the bitch, cannot wait for her and Mr Muslim to be out of White House....","commenter_a":"The American people were fools to ever put them in the White House . Now we have to find a way to get them the hell out","post_message":"Michelle Obama facing hug charges after being enveloped in lawsuit. Good it's about time. She couldn't get away with this. Do you think Michelle Obama is a criminal?"}]
