[{"comment_id":"1354102041270105","commenter_b":"BUILD THAT WALL!!!!!!!","commenter_a":"The racist bigots Trump supporters would love as many Mexican families as possible to die. Pretty sad! That's why I'm with her!!","post_message":"A son migrated to the U.S. from Mexico, to help his parents survive by sending back money. But part of Donald J. Trump's immigration policy could threaten that support, and the lifeline of an entire town. (In a statement to CNN, the Trump campaign maintains building a wall is the right solution, but did not address money transfers directly.)"},{"comment_id":"739722056160975","commenter_b":"Really tom? We are just providing facts, pull your head out of the sand, wake up,,,, sheesh","commenter_a":"it is NOT clear the killer was targeting christians....lying about this for your political purposes is irresponsible at the least. In fact, of the few facts, which have been confirmed about this awful incedent....among the most prominent is that the killer, himself was a christian...Also, that he describes himself as a \"conservative republican\" and that he was obsessed with mass-shootings. Stop lying to advance your political agenda...it's actually a big part of the gun disease gripping this nation.","post_message":"Made me want to cry."},{"comment_id":"731413603663114","commenter_b":"Build the wall, those here illegally on good status, offer citizenship, if no, they go. Those in our prisons, bye bye, gone. Immigration problem solved.","commenter_a":"The Republican politicians not following through on campaign promises and general fecklessness is what brought about Trump's popularity, not just the immigration problem. Trump was willing to bring up the illegals when the others were not.","post_message":"Meghan McCain warned Donald J. Trump of softening his stance on illegal immigration. Do you agree or disagree with her comments? @webpagelink"},{"comment_id":"1086347321421796","commenter_b":"Oh my, kicking out the Black Lives Matter people AGAIN during your Atlanta, GA rally. Second time in how many days, Shill? Awww, she loves the Blacks, she sure does, except for when they might just question her. @webpagelink","commenter_a":"I was one of them too! Now I'm a 29 year old man and I'm voting for Hillary!! You had our back and now we have yours!!","post_message":"Eight million kids have healthier lives and brighter futures thanks to the Children’s Health Insurance Program. Connar is one of them."},{"comment_id":"1058387144217814","commenter_b":"Best part, Karen, they probably don't even make minimum wage, if they're paid at all! Little Hitler Youth!","commenter_a":"Wowzer... I see the RNC interns are working through the weekend, copying and pasting their GOP talking points. Working hard to keep women, minorities, the poor, our LGBT brothers & sisters and immigrants under their jackboots 24/7. Shameful.","post_message":"It’s 2016. The days of dismissing the pay gap as a \"women's issue\" are over."},{"comment_id":"10154885110756509","commenter_b":"Build a wall around Connecticut.","commenter_a":"Of course and that is why we love Trump!! He is the only one daring to say the truth!!!","post_message":"\"He's saying what a good amount of people are thinking and don't want to say,\" a Donald J. Trump adviser said."},{"comment_id":"10155037576899268","commenter_b":"So, all wives are prostitutes?","commenter_a":"When you obviously marry a man for his money, what else would you call it. If you sell your soul to the devil, you're a prostitute. After all, no one would want this orange Cheeto if it wasn't for his money.","post_message":"Melania Trump doesn't deserve to be slut-shamed."}]
