[{"comment_id":"969277346429620","commenter_b":"Women only have X chromosomes.","commenter_a":"Those babies will never be normal. You need X and Y chromosomes. This is going to be sad.","post_message":"Humanity may have crossed a treacherous threshold as Researchers led by an Indian-origin scientist, have shown that stem cells from the skin of two adults of the same sex can be used to make human egg and sperm cells. What this means is, there is no longer a need for the opposite sex to “create Life”. What could possibly go wrong with “Playing God” and altering the creation of Life? #daysofnoah"},{"comment_id":"864523933643860","commenter_b":"Judy. Are you really that stupid? She's a doormat that stayed with a moral less husband for decades just for power. You have low standards.","commenter_a":"Hillary is such a threat to them, they will do anything to hurt her.","post_message":"“Secretary Clinton used one email account when corresponding with anyone, from Department officials to friends to family. A month after she left the Department, Gawker published her email address and so she changed the address on her account.” -Clinton attorney David Kendall"},{"comment_id":"420003978124197","commenter_b":"She's getting back what she deserves ! Treasonous witch !","commenter_a":"She's a loser","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"},{"comment_id":"1178660005508189","commenter_b":"You're a dumb cow lol grow the fuck up","commenter_a":"She is a stupid mom, not the way she feeding the baby, where or when, the way she treat the baby after feeding, you stupid cow, be more gently, you don't have to punch the baby back so bad,","post_message":"Why doesn't she just go into the bathroom to breastfeed her baby? Her answer is perfect. A video by Jess Blank, with special thanks to Rachelvfitness."},{"comment_id":"1178310438875078","commenter_b":"Now we have to feed, clothe and house this murdering POS! Like the other 60 million illegal aliens aren't enough! Mexico's corrupt government couldn't keep track of him! Take him out to the desert and open fire!","commenter_a":"Get a rope!","post_message":"DRUG KINGPIN heading our way (until he escapes, of course) details: @webpagelink"},{"comment_id":"388912451508467","commenter_b":"This woman won't win the next election.","commenter_a":"Tankes sister","post_message":"Angela Merkel: 'Islam is not the source of terrorism'. Merkel spoke at the Munich Security Conference about why cooperating with predominantly Muslim states is vital."},{"comment_id":"1758718481082543","commenter_b":"Illegal aliens should not be allowed to have drivers licenses. They should not be allowed to vote, should not get Social Security which they did not work for, should not get food stamps, welfare or any other type of financial assistance. If one of us went to their country, would be get financial assistance? No way! So why should they expect it here in the US, when we have seniors, veterans, children, homeless in need!","commenter_a":"More than WRONG !!!!!","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"}]
