[{"comment_id":"10153322835227994","commenter_b":"Sounds like something fishy. The devils monster wouldn't kill my kids before me.","commenter_a":"Don't strollers have brakes on the back I don't know this story is impossible to believe","post_message":"So sad. Her 18-month-old twins were killed."},{"comment_id":"10153836785761350","commenter_b":"Lady do you even know.what the truth is? Doesnt seem like it","commenter_a":"Trump is the ONLY one telling the truth and saying like it is,,,,,,Obama just lies,,,,","post_message":"\"We have a whole bunch of Americans, Trump supporters and his support I think will grow after this moment who feel that no one is telling them the truth and no one is saying what is obvious to them.\""},{"comment_id":"722398331226681","commenter_b":"Miley Cyrus is so gross. She's going to be a washed up disgusting old lady if she makes it that far.","commenter_a":"Who would believe anything that raunchy ugly thing says anyway ?","post_message":"Class act, that Cyrus!"},{"comment_id":"10152879384712894","commenter_b":"She's stupid what more do you expect","commenter_a":"This heifer is trying to get a job...nonsense!!!","post_message":"Raven-Symone Doesn’t Think Harriet Tubman Should Be on the $20 Bill [Video]"},{"comment_id":"10153451761433701","commenter_b":"That is NOT a tranny yo gooF! WOWO!! how do you not know a drag queen when you see one.. and btw... he would knock you out for identifying him inappropriately. so your surround sound is broken Debbie","commenter_a":"Seriously posting this in that manner is bullying. Wild interview? About to go viral? More like a compassionate individual & who cares what she looks like or which way she swings.","post_message":"It's a story about a bad crash in Mississippi, but the animated eye witness is stealing the spotlight. This is one wild interview that's about to go viral. Take a look"},{"comment_id":"10153488869101636","commenter_b":"I am nothing close to a conspiracy theorist, but doing what I did in the military, I seen how cut throat people could be. Especially if they are scared that information will get out there that will harm them. I'm not saying that anybody did tamper with his breaks, all I am saying is that it is possible. Nobody cut his break line obviously because he would of known, but had some drilled a pin hole in a brake line or reservoir, then sealed it to make sure it didn't leak out while sitting stationary. Then as he leaves the drive way he is still able to brake because there is fluid there to press the caliper in, but it breaks the seal and starts to leak out and he could use the brakes so long that the hydraulic fluid is still able to pressure the system. By the time ...","commenter_a":"I am just throwing it out there but Im pretty sure if his brakes had been tampered with he would have known it after the first stop sign or stop light after he started his car.... They dont pick and choose when to work and when not to work when tampered with","post_message":"Police say the data box from Aubrey McClendon's vehicle registered what was happening just seconds before the crash."},{"comment_id":"10153661567171336","commenter_b":"This thug lady needs whatever the cops want to do to handle thugs","commenter_a":"So breaking the law is okay, right @username?","post_message":""}]
