[{"comment_id":"1186141524764191","commenter_b":"That is right they would have convicted her already .","commenter_a":"IF there was anything to charge Hillary Clinton for related to Benghazi or her emails, (or anything else Fox Entertainment lies about) then wouldn't you think, after a decade of trying to convict her of something, the Republicans would have done it by now. There is NO basis to convict her of any wrong doing. The Republicans have lied about her for years and I'm sure they will continue. In the meantime I won't vote for anyone as repulsive as Donald Trump. He will, in my opinion, destroy this Country and our reputation around the World.","post_message":"How does this make ANY sense? From CNN: \"Donald Trump may say he's concerned about the little guy, but his tax plan would give the wealthy far bigger breaks than the middle class or working Americans. The Top 1% would see a whopping $275,250 reduction in their federal tax bill, or 17.5% of their after-tax income.\""},{"comment_id":"10154065483921770","commenter_b":"Welfare mothers make better lovers","commenter_a":"So does America. America doesn't revolve around the Clintons as they think it does . America is sick of them","post_message":"Even MSNBC is sick of hearing the Clintons' excuses: \"Seriously. Nobody cares. The game’s over. They lost.\""},{"comment_id":"10152661116841491","commenter_b":"Thugs are thugs, white or black. Stop acting like it is a racist term, people. These idiots belong in the exact same grouping as the ones in Ferguson and deserve to be treated the exact same way.","commenter_a":"Omar Shtayyeh","post_message":"Columbus Police Department spokeswoman Denise Alex-Bouzounis said that about 8,000 students forced their way into The Horseshoe stadium and tore down a goal post."},{"comment_id":"609176595931357","commenter_b":"Not shark tale though 😂😂😭😭 Alex McKay @username","commenter_a":"Jasmine Elise","post_message":""},{"comment_id":"10153497941541130","commenter_b":"Exactly, because feminism is about equality","commenter_a":"The funny thing is, if the ad said men are preferred, the women would be yelling sexism. Women are preferred? Sexism.","post_message":"\"The position requires filling in the responsibilities of a receptionist, so female candidates are preferred.\""},{"comment_id":"1792831500973232","commenter_b":"Fucking Pussy","commenter_a":"Nice, so with the looming threat of another cold war, you guys will be able to cover the war with Russia when it happens! :D","post_message":"Signs are pointing to Madam President."},{"comment_id":"10153767545206002","commenter_b":"My son still has school.","commenter_a":"Schools need a coordinated web site saying exactly what are close or open..","post_message":"Bitter cold has closed schools not already on Winterbreak. School Closings: @webpagelink #Local4Today"}]
