[{"comment_id":"1016327315093412","commenter_b":"It is long overdue that a woman is president, and more (sane) women are in Congress. Just don't think Hillary is deserving .","commenter_a":"Sorry, but it is time,long over due for a woman to start running this country. Look at the other countries that are run by women, get smart and vote Hillary Clinton in, she is very smart and she has Bill with her. So Bill had a woman under his desk,who cares. He wasn't sexually frustrated,if only the last 3 presidents had a woman under his desk,we would have a better run country. Now I'm not saying men should cheat, but a blow job from some stupid ass hussey, wouldn't hurt.","post_message":"It's time. Thank you, Winning Democrats!"},{"comment_id":"963331227036554","commenter_b":"So could Samsung actually be catching up?","commenter_a":"Eh...not really impressed enough to upgrade from the 6. I'll wait till the 7!","post_message":"Our first look at Apple's new iPhones:"},{"comment_id":"10153893248952293","commenter_b":"That's only for white guys.","commenter_a":"Just give him a slap on the wrist and let him go. Same as always.","post_message":"Police began looking for the 40-year-old after finding her 3-year-old daughter wandering alone in a Baton Rouge parking lot near her mother’s abandoned vehicle."},{"comment_id":"10154674259718941","commenter_b":"Shuttle up Hillary","commenter_a":"Does she see this as a chance to get more bribes? If not, this will pass.","post_message":"Hillary Clinton: \"I stand with the people gathered across the country tonight defending our values & our Constitution. This is not who we are.\""},{"comment_id":"10152792589201051","commenter_b":"Yes she should get surgery. Just wire her mouth shut","commenter_a":"Well if she would close moth once in awhile and watch what she eats she would not have to have surgery. I know it's the tax payers fault.","post_message":"This teen and her family have just one request for taxpayers."},{"comment_id":"10152815775186680","commenter_b":"she looks like Michelle Duggar!","commenter_a":"She wants ANOTHER wasted 15 minutes...go away...","post_message":"“There is no way that she did not know what was going on, that women were being abused and accosted by her husband,” Jones said."},{"comment_id":"586488074867632","commenter_b":"There needs to be at a 10 yr moratorium on any immigration!! From 1920-1965 there was no immigration whatsoever. The reason was: from around 1889-1920 there were 14 million immigrated allowed into the USA & the Govt said they needed to get acclimated & learn English, to become Americans. This needs to start again!!","commenter_a":"None we are full up","post_message":"Currently, the U.S. allows 1 Million legal immigrants every year. New poll of voters found most want the number cut at least by half. What do you think?"}]
