[{"comment_id":"1162468617182722","commenter_b":"The magic number is 2026, half of 4051 . Bernie gets to that number the superdelegates have to support him.","commenter_a":"Bernie could win every state from here on out and Hilary would still be leading in the polls and delegate count. ..","post_message":"Hillary Clinton's margin narrows to just 6 points over rival Bernie Sanders."},{"comment_id":"10156340474870354","commenter_b":"The Failed LIE of Multiculturalism is KILLING America. Low IQ Aborigines cannot uphold the Personal Responsibility DEMANDED. See Baltimore, DC, St Louis and Ghetto after Ghetto!","commenter_a":"Yes, yes!","post_message":"“I believe our country’s biggest threats come from within, from failing to address our incredible fiscal irresponsibility, by allowing our populous to become enemies with each other, stirring up hatred and strife within our country, by allowing education to take a second seat, by giving a lot of lip service but not actually taking care of it.\""},{"comment_id":"1325194690833614","commenter_b":"People need to slow down","commenter_a":"I hope this guy gets a huge fine and jail time. He could have killed someone.","post_message":"A driver was not injured after this violent crash that landed on Seattle's Burke-Gilman Trail. Gary Horcher shares the story >> @webpagelink"},{"comment_id":"2191617061063923","commenter_b":"It should be lock that jerk up , wth.","commenter_a":"YES","post_message":"Donald J. Trump just tweeted that those who burn a flag should either lose their citizenship or get a year in jail. Do you agree?"},{"comment_id":"1551588725149374","commenter_b":"Rest in the arms of Jesus little man. The world is praying for your family.","commenter_a":"you are in my prayers little angel. So are your mommy and daddy.","post_message":"Our hearts go out to the family of 2-year-old Nebraskan boy, Lane Graves."},{"comment_id":"992365204151742","commenter_b":"Since the dawn of evolved time mankind has migrated so that won't stop. I agree the need know who is entering the nation if I remember a European country found that immigrants were part of protest. And terrorist will use this to build cells to attack. However I don't see how Trump will get Gulf States to build security safe zone since the 'fountain is running dry' or maybe he will reignite the polluting of the environment with fossil fuels and take action to get fossils prices back to 110 which will create more bad than good but greedy and gluttony will prosper. His positions may have down sides for any real growth. And I agree that America needs to stop providing bulk funding, to the UN and other, let the world let the new imperialists do it and they, US, rebuild and make the world positive, green, clean and ...","commenter_a":"Republican Party souls have been sold to highest bidders, \"The Sneaky Wolves\". Lincoln Party is officially dead. So sad, Republican primary election is fraud, unfair and rigged, it seems every bigot and racist hiding behind the conservatism came out the closet to poisoned the election process in order to hijacked the Republican Party. I feel sorry for the gullible and naive Republicans who have been mislead, bluffed, lied and manipulated. Trump’s gang for hostile takeover of Republican Party maybe the worst case scenario in the American political history. Thanks a lot media for giving Trump’s gang free ride. Media is sold out to the highest bidders and freedom of press is no longer relevant to corrupt bosses and greedy investors Not again, another Hitler era, never again. @webpagelink Going in and out of building makes a person a Christian no more than going in and out of a barn makes ...","post_message":"“No. I would not allow people to come in from Syria. They’re not vetted properly. They’re moving in by the thousands.” Donald J. Trump reaffirmed his commitment to a ban on Muslims immigrating to the United States, arguing that it is better to build \"safe zones\" in Syria. What do you think?"},{"comment_id":"1457667300971814","commenter_b":"Or fire her!","commenter_a":"I am ashamed of NBC. Rather than addressing the crude and disputable comment by one of your employees, you just champion Chelsea. Do the right thing fire Katie Rich and issue and apology","post_message":"\"Barron Trump deserves the chance every child does - to be a kid.\""}]
