[{"comment_id":"509999849159970","commenter_b":"So you live in England and wanna talk about raping places for centuries? Bitch please you would be speaking German in we don't not come to Europe and save you bitches.","commenter_a":"He ain't a Muslim, no outrage #Murica","post_message":"DEVELOPING: The search for the suspected gunman continues this morning."},{"comment_id":"10153729476553433","commenter_b":"Why oh why does she lie so?","commenter_a":"Both parties are dead, the American Political System is dead. We need a complite overall. Let's start by Bernie and go from there!!! Two things need to happen A major bring out the vote campaing.....Bernie need to win by a landslide If that is not enough we need to come out into the streets by the millions and demand justice....even the day of the convention.....send a clear message that we are not going to take it anymore!!! THE AMERICAN PEOPLE ARE READY FOR A REVOLUTION TOGETHER WE WILL WIN BERNIE SANDERS 2016 President for ALL People The only choice #Bernie 2016 #FeelTheBern #WeWillWin","post_message":"Carly Fiorina said Gens. Petraeus, McChrystal, Mattis, Keane, Flynn all \"retired early because they told President Obama things that he didn’t want to hear.\" Well, Gen. John Keane retired in 2003, for starters. @webpagelink"},{"comment_id":"10154627536394203","commenter_b":"And Hillary is in a self-serving line person all my God where are you woman you're in dreamland what are you smoking","commenter_a":"The man is entirely self-serving. His ego is his God. Bravo to Rev. Timmons for putting him in his place.","post_message":"Donald J. Trump's latest target? Rev. Faith Green Timmons of Bethel United Methodist Church."},{"comment_id":"1819660061616257","commenter_b":"Let me guess...She will be Secretary of Mental Health...F*cking Lunatic...","commenter_a":"OMFG","post_message":"WOW. We are officially an international embarrassment..."},{"comment_id":"10158604415035206","commenter_b":"@username The woman can speak five languages... get a grip","commenter_a":"I have never said anything negative about Barack Hussein Obama's wife, but since that's gonna be the new norm for the liberal lunatics, let me just say this. Melanie Trump has more class in her little finger than Michelle Obama ever had or ever will have. But just look at all the jealous women who are putting her down and all the worthless men with mangina's who are putting her down. You people are pathetic.","post_message":"“Melania will be an excellent first lady who will take Slovenian values of generosity, loyalty and trust to the United States and the world,\" said one fan from Melania's hometown."},{"comment_id":"571795269654273","commenter_b":"Leave America","commenter_a":"Move to Syria.","post_message":"Here you go, peeps! If you're stumped for ideas check the comment section... they have plenty! @webpagelink"},{"comment_id":"10153259767028132","commenter_b":"Go back to stinky Bay City!","commenter_a":"Who cares about Madonna. She looked horrible at the Grammys and she has no room to talj","post_message":"Madonna is not a Fifty Shades of Grey fan."}]
