[{"comment_id":"916527265110193","commenter_b":"Rhyno - NO, dems did not control congress for the majority of Bush's presidency, you guys are so clueless..... it's the fault of those that pushed and developed it and demonized those not supporting it...... republicans did it, that pinch your cheeks thing again.....","commenter_a":"It is republicans that have forced Obama to keep the worst parts of the surveillance program going and to make it even more evasive. It is republican that created and pushed the surveillance state down our throats..... and they dare to point the finger at others for THEIR fascists policy.......","post_message":"“Such expansive development of government repositories of formerly private records would be an unprecedented contraction of the privacy expectations of all Americans,” the ruling said."},{"comment_id":"10154303024133132","commenter_b":"Shut up, Maggie.","commenter_a":"It's not nice to be wearing such nice clothes to cuba when those people have nothing! They looked scaredto be their in my opinion.","post_message":"Sasha and Malia Obama delivering a healthy dose of style inspiration while in Cuba! (via PeopleStyle)"},{"comment_id":"1379882718715731","commenter_b":"Illiterate angry white trash lady. #sad","commenter_a":"They lost the election because they rigged their nomination and backed the wrong candidate","post_message":"TheBlaze's Dana Loesch explains why Democrats lost the election at the Conservative Political Action Conference (CPAC) 2017. See more Dana @ theblaze.com/dana-loesch"},{"comment_id":"10155009134559411","commenter_b":"So why can't they do the same over here when the terrorists return","commenter_a":"Danes are fucked-up in the head except her. Brave and lovely lady ! You should run for whatever kind of Governmental election and you`d do very well. All the best to you .","post_message":""},{"comment_id":"595246650649268","commenter_b":"You're not a woman... so we don't expect you to get it...","commenter_a":"what brand of dope is she smoking? Seems to be effective in blocking reality","post_message":"\"I think [Trump] would be very good for women’s issues.\" - Caitlyn Jenner"},{"comment_id":"1008364749198946","commenter_b":"But the only way to stop a bad baby with a gun is with a good baby with a gun!","commenter_a":"My Hero","post_message":"BOOM!"},{"comment_id":"882098448492244","commenter_b":"I think this witch would sell her own Daughter for a ticket into the white House . How many Free rides will this traitor Promise to illegal criminals to get her to her socialist/communistic palace . ??????","commenter_a":"NO NO NO .DO NOT ELECT THIS PERSON.","post_message":"Hillary can't keep track of what she says!"}]
