[{"comment_id":"10152865807076051","commenter_b":"This was set up by this girl and her friends - she made sure her friend was there with the video going b4 she hit the other girl-she needs to be put away for a long time and have her sorry ass beat in prison and see what a REAL asskicking is. I hope the victim doesn't get scared and not proceed with the charges.","commenter_a":"we can thank our president and people like al sharpton for all of this they have done as much as possible to entice race wars!!!","post_message":"A girl was at the park with her little brother when all of a sudden they were attacked. The little boy tried to stop the beating – but that just drew him into the line of fire."},{"comment_id":"713883512069088","commenter_b":"@username you don't look old enough to know what that women has been doing for the last 40 years.You better hope she isn't the next President she is going to bring in 65,000 more illegal immigrants so when they molest part of your family and the police can't do anything about it. Because she has tied their hands what are you going to do. Blame someone else like she does.","commenter_a":"Why don't the democrat fools stop beating on Trump all the time , They would love for him to drop out then we would have crooked Hillary running every thing, She will never be my president she is the biggest liar on this earth and the lowest scum on this earth ! !","post_message":"Donald J. Trump's campaign chairman Paul Manafort said the report that the GOP nominee asked about using nuclear weapons in a security briefing is \"absolutely not true.\" @webpagelink"},{"comment_id":"10154754635023352","commenter_b":"Bridgette,u r s/o but ur lettin dem bitches knw wat it is.","commenter_a":"Her vagina is probably getting dry and can't keep up with him anymore..jk","post_message":"It’s over! Jennifer Lopez, 47, splits from toyboy Casper Smart, 29, after five years together"},{"comment_id":"10153469277832093","commenter_b":"You know right off the back it wasn't a girl bc the rims aren't scraped from the curb lol","commenter_a":"Jeffrey id say that his parking skills are top notch.","post_message":"File this under the 'smart criminals' tab. @webpagelink"},{"comment_id":"1036464773060661","commenter_b":"Their idiots!!","commenter_a":"Keyword: Care. Democrats generally care for the American people, Republicans only care for their special interest groups, their corporate friends, and anyone else that can boost the thickness of their wallets. Conservative is a joke... conserve what? Anything that helps them and not the the country as a whole.","post_message":"ZING!"},{"comment_id":"10157370299475725","commenter_b":"@username Here in the Houston area too. This is wrong. Build the wall!!!!","commenter_a":"I thank God for Mr.Trump, being I live here on the border in the San Diego area, we need to take our country back, illegals are everywhere, coming up here to have there baby's. its so wrong! Please help us","post_message":"This is a MOVEMENT - to take back our country! We are going to go non-stop -- all the way up to November 8, 2016 --- and beginning in January 17th, we are going to MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"836649156384109","commenter_b":"he s a crook","commenter_a":"Shake hands then shoot the f'er in the head.","post_message":"Rahm Emanuel just wants to be friends with Chicago unions"}]
