[{"comment_id":"444043602465820","commenter_b":"Look at her satanic pointed teeth!","commenter_a":"Not surprising, coming from stupid, I mean her.","post_message":"Democrat Leader says Her Kids Weren't Human Beings while in Her Womb!"},{"comment_id":"1171441452907864","commenter_b":"@username really Dems are racist?name a dem that wants to deport all Mexicans then get back to me..","commenter_a":"Good thing no one cares what Little Marco has to say. I'm sure Trump has no need for losers as VP either!","post_message":"In a statement on Facebook, Marco Rubio said he has no interest in being Donald J. Trump’s running mate and put VP rumors to rest."},{"comment_id":"849893008534609","commenter_b":"Donna Lee Hendee is it A law in Mexico that they speak Spanish ? Is it a law in Germany that they speak German? We have so many laws that are already not enforced what are they going to do arrest people that don't speak English. Sounds a little ridiculous to me.","commenter_a":"I thought it already was. What school did this idiot go to? Anyone that was born here should already know this. So we need a law to make this politically correct ....go for it and if it doesn't pass anyone that didn't vote for it should be deported to the country that speaks the language of their choice.","post_message":"He is going to make this the official language of our country. This is ridiculous. We stand behind him. 'LIKE' if you support him!"},{"comment_id":"1383945224964701","commenter_b":"Go away lady","commenter_a":"She definitely needs a half dozen chill pills....","post_message":"Sen. Elizabeth Warren has taken to Twitter to attack what she calls presumptive Republican presidential nominee Donald Trump's toxic stew of hatred insecurity."},{"comment_id":"10153994656339714","commenter_b":"I'm sure God told her. ;-)","commenter_a":"And how would Carly know how the Clinton's feel about each other. PLUS -- what good for the country was Carly's statement suppose to serve??? It sure didn't make me want to vote for her. We don't need more petty.","post_message":"Carly Fiorina had it out for Hillary Clinton at last night's #GOPDebate."},{"comment_id":"994492227347127","commenter_b":"Where is sound. Its just like showing a 360 picture.","commenter_a":"Watching from Yorkshire","post_message":"We were live at the demolition of one of the UK's tallest buildings. The Grain power station in Kent came down at approximately 11:00BST. Do you live in the area? Were you happy or sad to see it go? (Skip to 10 minutes in for the demolition moment)"},{"comment_id":"1215546011816966","commenter_b":"This is still AMERICA. MOST OF US STILL. BELIEVE AND HAVE LET OUR CONSTITUTION , BILL OF RIGHTS AND AMENDMENTS. WORKING IN THIS COUNTRY. YOU DONT LIKE THOSE LAWS OF OUR LAND. YOU ARE NOT A TRUE AMERICAN. SO YOU HAVE NO SAY. BECAUSE YOU HAVE NOT PASSED THE LAWS OF IMMIGRATION TO BE A CITIZEN OF THIS UNITED STATES OF AMERICA. AND JUST BECAUSE YOU ARE BORN HERE DOES NOT. GIVE YOU THE RIGHT. TO UNDO OUR LAWS. IT IS BREAKING THOSE LAWS TO DO SO","commenter_a":"Bimbo has been drinking the koolaid","post_message":"This is ABSURD."}]
