[{"comment_id":"10157254857370354","commenter_b":"Punch that Bitch","commenter_a":"If he had a background like that, other wives would come forward. She wasn't going to get alimony...hummmm","post_message":"The latest twist..."},{"comment_id":"1330647500288610","commenter_b":"Killers should be punished .","commenter_a":"evil","post_message":"The U.S. Fish and Wildlife Service said Thursday that necropsies had ruled out diseases as a cause of the eagles' deaths."},{"comment_id":"10153105889332235","commenter_b":"Oh no! Someone stole my vagina!","commenter_a":"\"Like she'd protect her purse or phone\" not even touching the objectification of a woman's anatomy there, but yeah let's make it legal to steal those too, that'll stop people stealing them. Am I right!?!?!","post_message":"Just. Wow."},{"comment_id":"10154434933517690","commenter_b":"@username, she's a girl. Not a he. SHE!!!","commenter_a":"Myb6 year old saw this news story, not understanding the word transgender at all. He said \"That's mean them, I don't think God would like that\" The fact is kids don't fully understand the transgender thing. This little boy included. But if he wants to be included as a boy, then let him. The other boys don't have to know. This is like excluding a girl from football or something.","post_message":"The family of an 8-year-old New Jersey boy says he was kicked out of Cub Scouts because he is transgender, a move that could open a new front in the debate over discrimination in Scouting."},{"comment_id":"10153780029707232","commenter_b":"And until the punishment is worse people will keep doing it! Idiots","commenter_a":"Wow! he only got tickets.. texting and talking while driving is just like ( being under the influence) he could of killed someone.","post_message":"A driver who was texting on his cellphone crashed into a Delaware home, causing major damage, according to police. STORY HERE: @webpagelink"},{"comment_id":"543745795816000","commenter_b":"We need to start carrying bacon with us and when they disrespect an American Bitch slap them with the bacon.","commenter_a":"Yes,yes! Or send their butts back! We don't want them here!","post_message":"This Fox News reporter was absolutely disrespected by these Muslims. They are out of control. If Muslims are going to live in our country they need to learn some manners. Do you agree Muslims have to assimilate or get out?"},{"comment_id":"10156244248180354","commenter_b":"Stop importing the pigs and it wont be","commenter_a":"Learn English","post_message":"Obama's New America..."}]
