[{"comment_id":"1539276206088035","commenter_b":"Yes,They Love to spend Our Money !","commenter_a":"That's what dems do,,,,spend money they don't have ,,,,,","post_message":"I'm perhaps the best fundraiser for the Democrats. If you want to separate Democrats from their money, tell them that I'm on the march. Tell them that I'm responsible something, and they will start writing checks for money that they don't even have."},{"comment_id":"1163296670367051","commenter_b":"Oooooo","commenter_a":"@username @username ummm they airways served alcohol. Unless they are talking about Webster","post_message":"Chuck E. Cheese's: Where a mom can be a mom! The family-friendly chain is hoping to lure in millennial parents by adding beer and wine to the menu."},{"comment_id":"10153979531201680","commenter_b":"WARNING ! NEVER NEVER HILLARY ! America will have a very dark future /nightmare and dangerous as hell if hillary get elected. Note : RADICAL MUSLIMS, ISIS , TERRORISTS ARE PRAYING FOR HILLARY TO WIN SO THEY CAN DESTROY THIS COUNTRY AND YOU. Transcription of Brain Carn’s Prophetic Word for 2016 “What happened in California would become common place in America, and an event worse than 9/11 is coming to America. The Lord says that Islam has a definite problem. They will never shake this reputation of violence from themselves. Even innocent Muslims will endure hardship and persecution in the future and no longer see America the same. @username Muslims are gonna begin to gather to cities, like Dearborn, Michigan, and form new communities that contain the populous of their presence so as to guard the backlash from White Patriotic America. The Lord says that a witch hunt will be ...","commenter_a":"Says he wants to \"drain the swamp\" but brings out all of the old alligators and crocodiles from years ago-Newt, Rudy and Kellyanne Conway, whose husband was an advisor to Paula Jones!!! Listening to Conway is like listening to someone scratching fingernails on a chalkboard-very annoying!!!!!","post_message":"The race is deadlocked despite a Clinton advantage in early voting."},{"comment_id":"10153366308391336","commenter_b":"Ewww! What a scanky hoe!","commenter_a":"I bet they didn't even use condoms... - Don't they care about STD's on DEATH ROW or in Maximum Security?","post_message":"Shepard Smith reported that Joyce Mitchell, the prison worker accused of helping two convicted murders escape from Clinton Correctional Facility, reportedly had sexual relationships with both killers."},{"comment_id":"927473010672643","commenter_b":"@username this has made my day!! When are you and Rene coming to visit I miss you guys!!!!","commenter_a":"Eyes bigger than stomach? 😜","post_message":"That's the most metal thing I ever heard. \\\\m/"},{"comment_id":"1556887964609272","commenter_b":"People need to come in our country the right way. Obama wants to flood our country with illegals.","commenter_a":"Poor you Ted Cruz! You and Trump are almost the same thing!! But, there is a little difference! Do you know why Trump is leading the GOP? Because he is white, and you Cruz, you dont, not for the racist republicans! You has been descriminated for them too! You and Trump never will be president of this country!","post_message":"Ted Cruz on illegal immigration: “The federal government is doing a horrible job of securing the border. It’s utterly failing.”"},{"comment_id":"10155018018037311","commenter_b":"You should not judge unless you walk in their shoes, there are many reasons why they come in and stay illegally, majority work harder then any one born here to make ends meet. They do not get freebies, unless someone is kind and help them. 90% of them just come here to work and work harder then most people. People just talk out of ignorance","commenter_a":"It's too bad all these snowflakes can't distinguish between Immigrants and ILLEGAL Immigrants. The United States has always welcomed legal immigrants who want to come to this country, embrace the culture and make a contribution to the success of this country. We do not welcome people who come like thieves in the night, vote illegally, steal social security benefits, use our schools and hospitals and commit a disproportionate amount of crime. Big Difference. PASS IT ON!!!","post_message":"It calls for immigrants across the country to not attend work, not open their businesses, not spend money or even send their kids to school."}]
