[{"comment_id":"1909759522584421","commenter_b":"Isn't that Gail, Oprah's secret girlfriend ? She's a racist along with Oprah.","commenter_a":"Go back to Oprah!","post_message":"CBS acted like #BlackLivesMatter's personal PR group."},{"comment_id":"10158198305710206","commenter_b":"Exactly why women shouldn't be police officers!!","commenter_a":"Hodor.","post_message":"Nice try!"},{"comment_id":"10153202664107217","commenter_b":"Pmsl yes, parallel parking to the extreme","commenter_a":"@username u do this with jim?","post_message":"Now that's a nifty bit of parking 🚙 @webpagelink Footage: Guinness World Records"},{"comment_id":"1170752382944790","commenter_b":"You can choose at any time not to have sex. Women don't have that luxury when it comes to their menstrual cycle.","commenter_a":"So? We pay sales tax on condoms?","post_message":"Forty U.S. states apply sales tax to menstrual products. via GlobalPost"},{"comment_id":"933455743437871","commenter_b":"no first do their time in prison then be deported","commenter_a":"They should be put in jail for years and when their old, deport them. That is if they make it in jail at all.","post_message":"ClashDaily.com"},{"comment_id":"10156022193165294","commenter_b":"That's incredible o be married that long. Now people marry 15-20 years and that's it. I hope to live this long and still have my husband around. This is what young couples should be using as example, If you can be married that long, theres nothing that can break you!","commenter_a":"Many yrs ago my grandparents were in same room at the hospital though, normally its two female or two male in ea room . It is very nice to keep them together.","post_message":"\"Because they were on the orthopedic surgical floor, none of those rooms have double occupancy so they couldn’t be together, and it was clearly breaking their hearts.”"},{"comment_id":"10153941213411162","commenter_b":"Lacey why are women lazy for not changing their last name? You should speak for yourself only.","commenter_a":"isnt her name Erica Crosby.. ijs.., she was his wife.... right","post_message":"HUSBAND PLEADS GUILTY: Kyle Crosby, 29, has pleaded guilty to murdering his wife who went missing on New Year Eve, 2014. Erica Crippen body was found March 17. As part of a plea deal, charges against Crosby mother have been dropped. FULL STORY: @webpagelink"}]
