[{"comment_id":"10150815152779999","commenter_b":"Hahah Welcome to the team","commenter_a":"@username :P","post_message":"Hold the Door. Hold the Door. Hold the Door. Hold the Door. (Hold off on reading this recap until you've watched the most recent episode of \"Game of Thrones.\")"},{"comment_id":"742612555896157","commenter_b":"We need women unless you enjoy cocks in your ass","commenter_a":"FINALLY WE CAN GET RID OF THE PLAGUE CALLED WOMEN","post_message":"The infants were carried to full term, and seem to have no health problems."},{"comment_id":"10153931664823797","commenter_b":"Well..when you look at how Democrats view abortion...5 months ago..that woman could have destroyed that baby through an abortion... .They don't respect life. So why should a Democrat care about how this baby died?","commenter_a":"Democrats would argue that this is not murder as abortion is not murder to them.","post_message":"29-year-old Sharron Braxton has been charged with the fatal suffocation of her 4-month-old son. Prosecutors say Marcus Jr. died after she rolled on top of him in the middle of the night. How very sad. Here's what police say she was doing before she fell asleep:"},{"comment_id":"10154312646744726","commenter_b":"For those confused about how an attack like the one in Orlando, Florida, could happen, I'll try to catch you up: Barack Obama's #1 goal has been to turn this nation into an Islamic wasteland. To that end, he appointed Hillary Clinton to be his dirty-dealing Secretary of State, in order to funnel military grade weapons to a then very inchoate ISIS. Hillary Clinton decided that it was appropriate for her to set up a fake Canadian charity, the Clinton Global Initiative, so that she could accept donations from dangerous nations, in return for personal political favors from the Secretary of State. This is the very definition of treason. However, Hillary didn't want anyone to have a paper trail of all her crooked dealings, so she set up a private email server in an attempt to thwart Freedom of Information Act requests. Barack Obama is now protecting Hillary, because he's ...","commenter_a":"It's truly disgusting and disturbing to use a massacre to push a political agenda. It was an Islamic terrorist attack now it's been used by democrats for an anti gun campaign, sickening.","post_message":"Liberals immediately urge gun control measures as terror link emerges in Orlando shooting"},{"comment_id":"10152932791740528","commenter_b":"That was before we had so many illegals that thought they deserved the same rights as legal citizens","commenter_a":"You register to vote when you turn 18 or renew you drivers license. Some older citizens have not had a license in years. Many poor don't have vehicles and don't need licenses. Direct deposit and ATM's have changed the way we bank thus eliminating the need for ID. The fact that many don't have birth certificates to get an ID or can't afford to go get both if they were born in the city of Detroit, but you need an ID to get a birth certificate. If you were born out of state good luck, it is so hard to get one, without an ID, it is almost impossible. It is a vicious circle and many just stop trying to jump through the hoops to get an ID, thus, they just don't vote even though they are on the registry to be able to. I remember just walking in and ...","post_message":"On this day in 1965, while thousands marched from Selma to Montgomery, President Lyndon B. Johnson urged Congress to pass the Voting Rights Act. Today, the law has been gutted by the Supreme Court, and we need to fix it. Every American deserves the right to vote and to have their vote counted."},{"comment_id":"745372418902804","commenter_b":"Throw the Illegals out. Send them all to Germany and have Merkel deal with them!","commenter_a":"Why the smirks???? Like saying I know something you don't know.","post_message":"Austrian police says 6,500 people crossed into the country on Saturday, with the number predicted to rise to 10,000; most en route to Germany"},{"comment_id":"1257226684318485","commenter_b":"Thank god Hillary did not get in she is to dangerous to our constitutional rights. And you know nothing of our constitution or you would know how dangerous Hillary really is. I don't think anybody that is not a American has a right to who we have as a president. Now it's time to make everything great and get along for all of Americans based on the constitution where it all started and will stay.","commenter_a":"If GOD could erase USA right now he would do it, i have no doubt. Trump is a living nightmare, and the American people are in the rollercoaster of stupidity right now. God don bless America...","post_message":"Things are not looking good on Wall Street"}]
