[{"comment_id":"10153747063291336","commenter_b":"I agree with him we don't need any more illegal Mexicans in the US","commenter_a":"Even dead Trump is making money! Trump 2016!","post_message":"A former NYPD commissioner is warning Donald J. Trump to not take the purported threat lightly."},{"comment_id":"10154480088981636","commenter_b":"female subjugation, taught from birth, how disgusting","commenter_a":"I hope they wear something to let people know they are the police","post_message":"Brilliant"},{"comment_id":"710336325799525","commenter_b":"U R A STUPID BITCH !!","commenter_a":"Yes she is a well educated lady. She puts family first and shows alot of class. She was a model you don't hear people caalling actresses names for their jobs. She also is a women who knows how to work hard , she understands the immigration system. She also understands the average needs of the normal everyday person.","post_message":"Will Melania Trump make a good First Lady?"},{"comment_id":"10154103059341509","commenter_b":"LMAO He will never menstruate or go through menopause LOL","commenter_a":"His NAME is BRUCE Jenner. Will he give up his medal, because he won those medals as a Man","post_message":"A judge has granted a petition allowing Caitlyn Jenner to officially change her name and gender. @webpagelink"},{"comment_id":"10153559970697093","commenter_b":"@username you shut up.","commenter_a":"See how good it feels to see good black hard working men...and the children have no hate for them big black men see hatred is taught we are not born with it. Love this interaction this should be a wake up call to any one steriotyping.","post_message":"Apparently they get this excited every pickup day... they're now good friend with the garbage men... @webpagelink"},{"comment_id":"1313221025411316","commenter_b":"Big ear bitch stfu","commenter_a":"Keep resisting arrest dumbasses 👌🏼... If you do what your told you'll be fine If not well then that's yo fucken fault Don't try to fight them , especially against a lot of cops.., that's retared your gonna lose If your rights are violated then take them to court. 😮👌🏼. Hopefully you guys learned something from this video","post_message":"Where the officers being too aggressive? #WSHH"},{"comment_id":"10153931613802093","commenter_b":"I hope they carve him really good in TDC.","commenter_a":"What a motherf**king piece of s**t thug. Die, a**hole! Yeah, I'm pissed.","post_message":"BREAKING: Gustavo Zavala-Garcia has officially been charged with capital murder in the death of 10-year-old Kayla Gomez-Orozco. His bond has been set at $10 million. bit.ly/2fwFjd0"}]
