[{"comment_id":"1054883167923762","commenter_b":"What a dumb bitch.","commenter_a":"And this hack wants to be President?....Are Americans that blind and stupid ????","post_message":"“I’m going to be talking to white people, we’re the ones who have to start listening to the legitimate cries coming from our African-American fellow citizens,” said Hillary Clinton."},{"comment_id":"10153042151741680","commenter_b":"Aww, she don't like jail, maybe , I love being able to use this line right now, maybe if she wouldn't break the law, she wouldn't be in jail. Isn't that the line republicans always use.","commenter_a":"Davis is being duped by her attorney. As long as she refuses neither to resign her office nor to do her job, her attorney is the only person who's winning. She is a pawn.","post_message":"The controversy swirling around Kentucky county clerk Kim Davis is not letting up."},{"comment_id":"10154674259718941","commenter_b":"Shuttle up Hillary","commenter_a":"Does she see this as a chance to get more bribes? If not, this will pass.","post_message":"Hillary Clinton: \"I stand with the people gathered across the country tonight defending our values & our Constitution. This is not who we are.\""},{"comment_id":"789272967888144","commenter_b":"If you're here illegally you need to get the fuck out . Don't care how old you are or how long you've been here","commenter_a":"Kill yourself Santorum , you have no purpose and you spread the disease of hate.","post_message":"Santorum... Santorum... That name sounds vaguely familiar... But why?"},{"comment_id":"1180816798605996","commenter_b":"Our babies are so talented and intelligent","commenter_a":"Aram Kc Julia McLeod Ayling","post_message":"Happy International Cat Day!"},{"comment_id":"10153752215990575","commenter_b":"Better yet, deport them each and every one ASAP !!!","commenter_a":"Shoot everyone of them no more rape","post_message":"Good question!"},{"comment_id":"10153443482053352","commenter_b":"He knew that bitch was cazey","commenter_a":"Idk what to say bout him, i know personally a man who loves n does for his kids, but his child's mother does not let him take his son ANYWHERE, n will continuously say he sick or he can't go, but always calls when he needs shoes or something and holidays.. So i can't judge him. Also just because ur behind on child support doesn't make u a deadbeat, you can be behind while making payments still!! Its sad what this family has to go thru but not everyone is educated on their parental rights or can afford court! I just feel sorry for the kids n the family.","post_message":"Dad of Kids Found Dead in Freezer Comes Forward #TRENDING"}]
