[{"comment_id":"1075271249191177","commenter_b":"Surprise bitch","commenter_a":"Isso te lembra algo? Matheus 😂😂😂","post_message":"\"I see you.\" ~Will More combat footage at > Afghanistan Combat Footage - Funker530"},{"comment_id":"10153195924381130","commenter_b":"I agree.......who the hell cares!! Dumb ass bitch!","commenter_a":"@username @username ...at that point, who the hell cares aye? Lol","post_message":"Do you even wanna know?"},{"comment_id":"10153645226755399","commenter_b":"Totally feeding ISIS everything they want. Playing right into their hands. What a naive jerk. ISIS loves Trump.","commenter_a":"Hum. ISIS launches attacks in order to provoke a backlash against Muslims in the West in order radicalize them. Trump follows the ISIS playbook perfectly calling for an entire raft of outlandish actions against Muslims in America: ISIS Mission Accomplished. Donald Trump: ISIS Agent #1","post_message":"The GOP presidential frontrunner just went there."},{"comment_id":"10153659405156955","commenter_b":"Stupid bitch","commenter_a":"She look ignorant.... Brainless!","post_message":"VIDEO: Student Leading College Protest / Walkouts and Demanding FREE College Gets Destroyed on TV..."},{"comment_id":"10153605782047522","commenter_b":"@username THE MORALS OF THE DEMOCRATIC PARTY AND IT'S FOLLOWERS HAVE RESORTED TO THE MOST LOWLY TO SPEAK IN PUBLIC...LENA DUNHAM SPOKE AT DNC CONVENTION. SHE ALSO WROTE A BOOK AND HEREIN IS A PASSAGE...NASTY...NASTY...GIRL...In the book, Lena Dunham describes an incident during her childhood in which she leaned down between her sister legs and spread open her vagina, saying the behavior did not alarm her mother and was the spectrum of things I did. At another point, she writes that she would try to bribe her sister with candy for a kiss on the lips, joking that a sexual predator might do to woo a small suburban girl I was trying.","commenter_a":"Not surprised. The media has been so bias lately, Clinton doesnt even need the DNC. She has the press. The hatred for this man by the media is astounding. The globalist and globalism will do anything, say anything, to remain in power.","post_message":"The latest in the polls:"},{"comment_id":"10155018976064170","commenter_b":"The most classless woman and family I have ever seen. Good riddance.","commenter_a":"This is also fake news. There is no sign like that. Bye Herman.","post_message":"I'm sure Michelle will find some hope in that nice house they're about to move into."},{"comment_id":"10154456330994445","commenter_b":"I'm a female! Hilary needs to stay home and crochet something ya crazy hag","commenter_a":"I notice most of the haters of Hillary are men, you must have Momma issues!","post_message":"President Obama made the case for Hillary Clinton, saying there there's no other person more qualified for the most powerful office in the world. @webpagelink"}]
