[{"comment_id":"972471592821368","commenter_b":"Don't beleave this is west point?","commenter_a":"yes they are acting like beyonce,stupid","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"10153119305979641","commenter_b":"Of course she did. She's corrupt as Hell. Let's elect her president.","commenter_a":"Good for her.","post_message":"Hillary Clinton deleted all emails from her personal server used for official secretary of state business, a Republican lawmaker says. @webpagelink"},{"comment_id":"10154319204506729","commenter_b":"And this should include Hillary as well. The woman has delusions of grandeur and is a serial liar. These are all distorted mental behaviors and both should be institutionalized.","commenter_a":"Psychosis: Possible symptoms include delusions, hallucinations, talking incoherently, and agitation. The person with the condition usually isn't aware of his or her behavior. Critical: consult a doctor for medical advice","post_message":""},{"comment_id":"10153880836367994","commenter_b":"EXPELL THE HOE S FOR LIFE , LET THEM WORK THE STREETS","commenter_a":"All I got to say is we need to bring back discipline back in the schools I would of never In a million yrs ever thought about hitting a teacher I think these kids need to b put in jail disgusting how these kids are now a day","post_message":"Those who work at Detroit Public Schools say this was \"teacher baiting\" -- and that this isn't the first time they've seen it happen: @webpagelink"},{"comment_id":"10156049439790725","commenter_b":"because we know how to build stuff that's why..... Why u think Latinos rule the construction industry?? Lol... Really building a wall huh? Who u guys going to get to build the wall?","commenter_a":"What about the fence the Mexicans put up to keep People from Guadamalia out> If it works for them why not for us??","post_message":"For those that don’t think a wall (fence) works, why don’t they suggest taking down the fence around the White House? Foolish people!"},{"comment_id":"1287108874642473","commenter_b":"OF COURSE OBAMA`S AND HILLARY PAY CHECK FROM SAUDI ARAB IS GETTING BIGGER BY SECOND , IMAGINE WHEN THIS HYENA BRING MORE OBAMA`S ANGEL REFUGEES... HOW BIG HER CHECK WILL BE..? HYENA CLINTON WILL NEVER SUFFER MUSLIN VIOLENCE , SURROUNDED BY HEAVY ARM BODYGUARDS , OK...WHAT ABOUT YOUR FAMILY..? IF OBAMA`S GANGSTERS TAKE OUR GUNS ...HOW WE ARE GOING TO PROTECT OURS FAMILIES...? WORKING HARDER IN ORDER TO FEED OBAMA`S ISLAM ORPHANS & WIDOWS ANGELS OR BLACKANIMALMATTER OR ILLEGALS ,...DEMOCRATS SLAVERING THE PLANET FOR ISLAM ...NOT SEE IT YET ...SERIOUSLY ..? CHECK HOW MANY PEOPLE ARE ON WELFARE OR FOOD STAMPS ..","commenter_a":"Who is the mayor?","post_message":"\"If you go 15 miles from downtown you will find communities that don't have water or sewer yet.\""},{"comment_id":"10154133671460950","commenter_b":"There was only 1 person who refused to vote guilty all 12 have to agree, this piece of shit refused to vote guilty. There were 11 people who voted guilty","commenter_a":"Its the south and besides he had an all white jury and he shot the man in cold blood it was caught on camera and the jurors call it a mistrial","post_message":"WATCH: Judy Scott, mother of Walter Scott, reacts to a mistrial being declared in Michael Slager's trial: \"It's not over 'til God says it's over.\" @webpagelink"}]
