[{"comment_id":"922010884502919","commenter_b":"If the perpetrator uses a handgun we get ban handguns, if he uses a magazine fed we get ban those, shotgun we get ban those, folding stalk we get ban those, black finish looks scary and military looking, we got to ban those! Where does it stop? We have millions of knives (problem in Japan) baseball bats, and cars in the U.S.! All can be used to do mass killing! Let us all be honest and cut the BS out of this subject! Gun free zones=shooting fish in a barrel! When POTUS and celebrities give up armed protection then they can give their opinion!","commenter_a":"As soon as all the criminals and government in the us get rid of all their weapons then we can talk about law abiding people curbing their guns. Until then you have completely missed the point of owning a gun for self defense. And BTW Roof got the gun illegally!!!!!! Writer doesn't understand what the word criminal means.","post_message":"COMMENTARY: Why you need to rethink some of your gun arguments. Agree?"},{"comment_id":"10153252345186990","commenter_b":"Roger Morris it is Justin Bieber!","commenter_a":"Lisset Medina","post_message":"#SB50 SIGHTING: Justin Bieber spotted taking pictures with fans in San Francisco. @webpagelink Have you spotted any Super Bowl celebs yet? Tell us below! [Via @JBCrewdotcom]"},{"comment_id":"1115803781778734","commenter_b":"True, God's judgement may happen just like in Sodom and Gomorah,, Because guy marriage is wickedness,,,","commenter_a":"The rath of God, is not some thing, they want to play with.","post_message":""},{"comment_id":"10153377992812426","commenter_b":"Typical female...never satisfied.","commenter_a":"Wish he'd do something else other than banning microbeads","post_message":"Thanks, Obama! ;) More than 8 trillion microbeads were entering the country’s aquatic habitats daily; the volume was enough to coat the surface of 300 tennis courts every day -- according to a Sept. study."},{"comment_id":"10154589059624087","commenter_b":"If you look real hard you may find your own identity or Soros'","commenter_a":"Questions: How many states do we have? What was actually written on that red, plastic button your mommy brought to Russia to reset our relationship? Did the crippled man Biden ask to stand up ever...stand up? What exactly is a CORPSEman? Hmmmmm....perhaps you should stfu?","post_message":"\"What happened in Sweden Friday night? Did they catch the Bowling Green Massacre perpetrators?” Chelsea Clinton tweeted."},{"comment_id":"938755412831598","commenter_b":"If she's a white lady, I'm a white lady.","commenter_a":"I am surprised she still has those white teeth in her mouth wow.","post_message":"Let's be honest. If this woman was black, she wouldn't be smiling for a cute little mugshot...because she'd most likely be dead now. #WhitePrivilege"},{"comment_id":"10154007252811770","commenter_b":"It's like they forget that these idiot elitists make up 1% of the population and those of us who are her \"deplorables\" pretty much loathe Miley, Gaga (she makes me gag), Madonna and the rest of her low class disgusting amoral favs. These truly deplorable people have the OPPOSITE effect on decent hard working people and especially those who love God.","commenter_a":"Bull. bull. bull. SHE'S THE QUEEN OF CORRUPTION!!!!!!How the libtards don't get this is beyond me???Nasty woman.","post_message":"It's a real wonder how Lady Gaga didn't win the election for Hillary"}]
