[{"comment_id":"10154688029234749","commenter_b":"No, not all woman. Just ugly dogs like yourself","commenter_a":"Because the beard makes them extra ugly and nobody else wants them","post_message":"A little bit of stubble has a whole other meaning though..."},{"comment_id":"10155319935565294","commenter_b":"No! Our kids are getting more stupid every passing day! They NEED ALL the education they can get!!! :)","commenter_a":"No","post_message":"Should schools switch to a four-day week? Tell us what you think."},{"comment_id":"10158320001025294","commenter_b":"I agree!! If your DNA IS ON THE VICTIM..SPEEDY DEATH!!","commenter_a":"I beleive in crimes like this. Should be Swift justice if you're found guilty nothing less then the death penalty and in a short period of time 3 days fir greiveing for convicts family and then serve sentence out!","post_message":"The suspect is a registered sex offender. \"Our investigators didn’t stop. The culmination of their efforts is the arrest of a person who we need to make sure never touches our streets again,\" said Cleveland's police chief as he announced an arrest in the case."},{"comment_id":"1015160651860508","commenter_b":"@username go be stupid with your blond friends elsewhere","commenter_a":"If the little brat would have respected the teachers authority in the first place the cop wouldn't have even needed to be there.","post_message":"No matter how smarmy some snot-nosed teenager might be, even if she’s burning off the teacher’s time, the class time and her own time, there’s never a moment in which it’s appropriate for a law enforcement officer to try out his best WWE moves in order to bring her to heel — even if she takes a swing at him. @webpagelink"},{"comment_id":"10154531059061337","commenter_b":"Well there's the fact she acts like a cheap whore","commenter_a":"Really what is wrong with Miley Cyrus..? She got some serious issues & needs help...","post_message":"SHOWING OFF: Miley Cyrus didn't hesitate to full on make out with her Victoria's Secret girlfriend, despite the watchful eye of the paparazzi..."},{"comment_id":"1075067075943468","commenter_b":"@username when did Trump date any black women?","commenter_a":"This is just the beginning, folks. Racism has been given the green light as of last Tuesday night. smgdh","post_message":"\"It will be refreshing to have a classy, beautiful, dignified First Lady in The White House. I'm tired of seeing a Ape in heels.\""},{"comment_id":"10153436086986509","commenter_b":"She's a crooked, unethical liar.","commenter_a":"Hillary Clinton seems to irritate all Republicans. I don't understand their problem is it because she's strong, smart, not afraid to speak her mind?","post_message":"While Hillary Clinton isn't the first secretary of state to use a private email address, she is the first to exclusively use a private account during her tenure: @webpagelink"}]
