[{"comment_id":"894598347242254","commenter_b":"She needs to keep the hell out of our city schools.","commenter_a":"From what I see in this pictire, Moochelle is describing how to succeed in politics the Lewinsky way! ROFLMAO!","post_message":"The Food Police!"},{"comment_id":"10153621396858352","commenter_b":"Look little girl you came out me with your dumb ass statement, you the one feel some type of way bitch because gow I feel and what I know. Now I understand your 16......young and dumb like I said","commenter_a":"Oh let me guess....its not about race, her people's have money.....yea right, its all about race and for those dum ass white people who says its not......go eat a dick.....this some bullshit","post_message":"Parents’ fury after girl, 16, who killed three friends in crash while driving SUV without a license is ordered to write an ESSAY instead of serving jail time"},{"comment_id":"1031319243615345","commenter_b":"What?","commenter_a":"What so if the creep has aids the victim can't get justice and if the victim gets drugged and is attacked what happens ??? Maybe you may have not thought this through???????","post_message":"... Seriously, America?"},{"comment_id":"1170528036314405","commenter_b":"She knows she can't do it. She has to bring her husband in to do it for her. I guess we are not ready for a woman President.","commenter_a":"Hillary says she will appoint Bill to run the economy. We've seen the Clintons in action together before in the Whiter House. We call that getting two crooks for the price of one.","post_message":"The Clinton Foundation's business relationship with 20 foreign governments raises real questions about her judgment. Simply put, Crooked Hillary is in no position to be President of the United States of America."},{"comment_id":"10153762734254087","commenter_b":"All this woman does is lie her ass off 24/7","commenter_a":"Republican Hypocrisy !!","post_message":"FBI Director James Comey dismissed Hillary Clinton's claim that his agency's probe into her private email server was a routine “security inquiry,\" telling reporters \"I'm not familiar with the term 'security inquiry.'\""},{"comment_id":"515071932006619","commenter_b":"you make a good argument eugene. historically the philistines controlled the coast of israel. the jews the interior. but after the romans any historian would agree the jews were not a player in the region. after 2000 years i think the claim of europeans to the region is moot. its like me saying i should have land in ireland taken from my ancestors by the english,or land in france taken by the catholics. its not valid and if the united states funded a military machine to take back those places i think it might be wrong.. prior to world war 2 the jewish population in palestine was a distinct minority. the subjugation of the place by european jews was rubber stamped by the west but never ok with the people of that place or any country near it. israel currently recieves billions from the american taxpayer to operate their apartheid ...","commenter_a":"that mosque was in palestine. europeans invaded the country,committed genocide to steal it and now you sit on a high horse and judge the indigenous people it was stolen from because you are ignorant of history or a hypocritical shill.","post_message":"Such extremism isn’t limited to out-of-the-way mosques where radical clerics operate in the shadows. It is occurring in mainstream and leading mosques world-wide, including at one of the most important religious institutions in Islam, the Al Aqsa mosque in Jerusalem."},{"comment_id":"1300544240024109","commenter_b":"She'll be kissing a whole lot of ass in jail","commenter_a":"The bitch lost - America knows she is a lying bitch now she has to kiss his ass to try to keep her out of jail","post_message":"It's over."}]
