[{"comment_id":"1569194983095765","commenter_b":"Immigrants need to assimilate","commenter_a":"I feel sorry for this woman, she is so ignorant. The capability of her brain being able to handle one language and one culture is probably the siza if a pea.","post_message":"A woman captured on video yelling racial slurs at a Spanish-speaking woman as they waited in line at a JCPenney store will be \"permanently banned\" from the mall where the incident took place once she is identified, Jefferson Mall officials say."},{"comment_id":"1179053782134909","commenter_b":"Yes and he is ASS!","commenter_a":"IDIOT","post_message":"Kanye West Claims He’s Tougher Than A US Soldier. Wow, how disrespectful. He must be kidding. Do you think Kanye West is a disgrace?"},{"comment_id":"10153637483924714","commenter_b":"White people rock!!!","commenter_a":"^^^when the police start killing your people and getting away with it then you tell how how to protest/feel #nojusticenopeace","post_message":"Philosopher and activist Dr. Cornel West was arrested during a demonstration outside the Saint Louis federal courthouse."},{"comment_id":"1835427256744336","commenter_b":"Lock her up already!","commenter_a":"It's not important how many people are there what's important is how many VOTE BLUE!!!!!!!!!!! These two ladies have have more integrity in one finger than all of you HATERS.","post_message":"WATCH LIVE: FLOTUS Michelle Obama and Hillary Clinton campaign side-by-side in NC."},{"comment_id":"1340506826002077","commenter_b":"Not me kick the muslims baxk to there own countries","commenter_a":"Why don't you go eat a goat turd sandwich and drop dead","post_message":"This is the congressman that stated the Islamization of America can't be stopped..."},{"comment_id":"10153217105611336","commenter_b":"Nah he's just a pussy","commenter_a":"If I were on the Baltimore police force I would walk off the job","post_message":"JUST IN: Five of the six Baltimore police officers charged in the death of Freddie Gray are in custody, according to Mayor Stephanie Rawlings-Blake. @webpagelink"},{"comment_id":"565467440308215","commenter_b":"And here ya go, they will bite the hands that feed them .. dumbass .","commenter_a":"What about our children who live on the streets and homeless families in America!!","post_message":"He was wrong! What happened next..."}]
