[{"comment_id":"10154496006728689","commenter_b":"@username I guess you're right with your saying!!","commenter_a":"Many people are saying.....not me, but many people. They might be right. I haven't fully investigated it yet, so I don't know,, but from what I'm hearing from many people........Things, I've heard things. Lot's of things. Not so good things...many bad things,I don't know, but it's what I'm hearing lately, from many people. They could be right. And then what? These things I've heard, from many people. Could be trouble...We're in trouble, folks.","post_message":"WATCH: Donald J. Trump: If Hillary Clinton gets to pick her US Supreme Court judges, \"nothing you can do, folks — although the 2nd Amendment people, maybe there is. I don't know.\" Read full story: @webpagelink"},{"comment_id":"10154219660042908","commenter_b":"Yet they try to call themselves the prolife party.The warmongers that they are proves that they aren't.They aren't prolife they are pro birth.The GOP will get us into war with iran and the way donald trump is talking we'll have a border conflict with mexico.","commenter_a":"Still waiting for Bernie to say something about the 700 million dollars congress. spent on defense last year","post_message":"Sadly, people like former vice president Dick Cheney and many of the other neo-cons who pushed us to war in Iraq were not only tragically wrong then, they are wrong now. Unfortunately, these individuals have learned nothing from the results of that disastrous policy and how it destabilized the entire region."},{"comment_id":"10153374833224497","commenter_b":"I miss that trashy bitch.","commenter_a":"whatever happened to amber richardson?","post_message":"\"I had some great drugs in my day, but seeing my baby for the first time? I wouldn trade that for all the ecstasy in the world.\""},{"comment_id":"480644502060144","commenter_b":"Illegal !!!! Burning the flag should be a crime!!!","commenter_a":"It will not happen but this group needs to be labeled a hate group","post_message":"Do you think burning the flag is an example of free speech or should it be illegal in the US?"},{"comment_id":"10153897345459726","commenter_b":"As a man, whenever I hear Hilary's shrill angry voice my blood runs cold. Bernie should be more careful attacking Hilary, she'll wave her wand and turn him into a frog.","commenter_a":"Same old crap.!!!!!!!!!!!!!!!!","post_message":"WATCH: Clinton and Sanders called out for lies!"},{"comment_id":"10153978384659726","commenter_b":"There is a new Wave in America, it's the Blue Collar Wave and it's about to wash away an entire Establishment. The Media says we're dummies and Racist for Standing up to the Establishment and Riding that #TrumpTrain all the way to the White House to Make America Great Again. I say let the Blue Collar Wave wash them away.","commenter_a":"Perhaps but regardless, Obama is a POS.....","post_message":"WATCH: Obama: I'm not a 'big government, crazy liberal'"},{"comment_id":"10153095051856770","commenter_b":"\"please everyone\" stop paying attention to the talking pig.","commenter_a":"AMY you need to get out of your dad's shadow. He's an idiot. Just look at the death rate in every city the has very strick gun laws. If we did not count them in death by guns the United States would have the lowest death by fire arms than any other nation.","post_message":"Amy Schumer continues to advocate for stricter gun laws after a man opened fire and killed two people during a July screening of her movie “Trainwreck.”"}]
