[{"comment_id":"10153497941541130","commenter_b":"Exactly, because feminism is about equality","commenter_a":"The funny thing is, if the ad said men are preferred, the women would be yelling sexism. Women are preferred? Sexism.","post_message":"\"The position requires filling in the responsibilities of a receptionist, so female candidates are preferred.\""},{"comment_id":"1160371997392384","commenter_b":"She made us women proud!","commenter_a":"Proud of you, and I don't even know you! I spend a lot of time in Florida although I don't live there. If I ever encountered Scott, I'd like to think I'd tell him off, perhaps not so 'eloquently'!","post_message":"\"In some ways this is about me and my personal interaction, but it's also about all of us who are having to live under the reign of Governor Scott.\" - Cara Jennings"},{"comment_id":"10153459242386409","commenter_b":"That will teach him to open his big Mouth !!","commenter_a":"This is ridiculous","post_message":"A murderer serving three life terms for killing three people saw two more decades added to his sentence after a Washington State parole board considering his request for early release felt his crimes called for a harsher punishment."},{"comment_id":"10153331203624614","commenter_b":"@username Sure, black bears are much smaller than grizzly bears, and a couple of humans could scare it away","commenter_a":"What I noticed was all the younger guys running and totally leaving the few elderly people behind...shame :/","post_message":"A Montana wildlife official captured video of an unnerving encounter between humans and bears on a bridge in Yellowstone National Park. The footage shows several apparent tourists making a dash to safety after finding themselves a little too close to a black bear sow and her three cubs. No one was injured in the incident, and the animals made their way safely back to the forest, officials said. Read KTLA's story here: @webpagelink"},{"comment_id":"949815198400996","commenter_b":"@username China built a 13,000 foot wall over 2000 years ago. You don't believe we can build a 1000 foot wall? --- I live in California and illegal immigration is a huge problem that you clearly don't understand. Please take some time to do some research. Let's Make America Great Again!!! Cheers for Trump!!!","commenter_a":"Sir Newt may be one of your best choices as a Vp, he knows the political game better than most and is not the typical establishment guy, his IQ is also very high, I hope he is on your short list, to at least find a spot on your cabinet","post_message":"Via Newt Gingrich: Donald Trump's foreign policy speech is about putting AMERICA FIRST! I had been calling for an overhaul of the foreign policy establishment at the State Department since at least April 2003, when I gave a speech at the American Enterprise Institute calling for completely transforming the Department. And I first warned that America had “gone off a cliff” in Iraq in December 2003........"},{"comment_id":"10152736436045496","commenter_b":"negative much?","commenter_a":"Where was the GoFundMe started for her? She lost her job after having a gun shoved in her face, did anyone start a fundraiser? If they did was the link shared? Hundreds of thousands of dollars raised in the name of hate and not one single penny raised for a working MARRIED mother who valued her life over a companies money. Yep, this is indeed a \"Christian Nation\".","post_message":"The pregnant Popeyes manager, who was fired less than 36 hours after a robbery, has been offered her job back. See more: @webpagelink Would you go back to work for the restaurant?"},{"comment_id":"10153244318929726","commenter_b":"Why work when you can live off the taxpayer???","commenter_a":"This is so true in IT.","post_message":"Former IT Manager Exposes Ugly truth on so called \"Shortage\" of American Workers"}]
