[{"comment_id":"10154674259718941","commenter_b":"Shuttle up Hillary","commenter_a":"Does she see this as a chance to get more bribes? If not, this will pass.","post_message":"Hillary Clinton: \"I stand with the people gathered across the country tonight defending our values & our Constitution. This is not who we are.\""},{"comment_id":"10154211018961337","commenter_b":"Hot chick","commenter_a":"Dont agree rob schneider is funny in some movies","post_message":"WHOA, sorry Rob Schneider and Jennifer Love Hewitt (and all the other actors on this list)..."},{"comment_id":"10156202756245354","commenter_b":"@username, lol, I'm doing just fine sitting here on the beach. Awful life? Bitch please.","commenter_a":"How much did the Pope's dress cost?","post_message":"Pro-Tip: When bashing capitalism is your brand, it's best not to wear dresses that cost $2,300.00."},{"comment_id":"10155769419940231","commenter_b":"My thought is this Ladies; the occurrences, that we are know seeing unfold are strategic! I hope that you will agree that the system has removed a majority of our \"Black\" men who would physically engage in battle with the injustices. They are being removed from society and that weakens us as a people. They are imprisoned for a greater length of time, killed in unlawful ways right in our faces (bullets in the back, strangled and held by more than one, ect...). A great majority of our women are now out and about alone and really can not defend themselves physically against the powers that be! In addition I see more \"Black\" women, more than ever going to be the next victims of murder. This leaves our children more venerable than ever before!","commenter_a":"It would of not been like that if a man was in the car with her!","post_message":"It may not be in the way that she thought she would, but she has, indeed, changed history."},{"comment_id":"10153275718534726","commenter_b":"Sometimes really rebellious kids need a bad scare, and yes, they should be afraid of cops. It's societies way of dealing with bad people. It's the people that don't fear cops that I worry about.","commenter_a":"good","post_message":"@webpagelink"},{"comment_id":"1306172506079052","commenter_b":"@username if immigrants want to come to America and live the American Dream they should work for it. Trump isn't against immigration he is against ILLEGAL undocumented immigrants. If u want to come here, come the right way.","commenter_a":"And when a pregnant illegal comes here and has a baby born here that baby is a citizen and then that baby is able to get welfare food stamps housing WIC fuel assist etc... All while the mom is an illegal but cuz child is born here it's entitled WAKE UP AMERICA","post_message":"Donald J. Trump responded Monday to the worst terror attack on U.S. soil since 9/11 with a tough call to clamp down on Muslim immigration. @webpagelink"},{"comment_id":"10153711983118445","commenter_b":"Better take a look in the mirror you ugly bitch.","commenter_a":"Trump is a pig","post_message":"#Pot Matters: Trump on Drugs"}]
