[{"comment_id":"10154952151491509","commenter_b":"\"Guns don't kill people. People kill people.\" You think Omar would have killed as many people as he did if he only had a kitchen knife or a baseball bat?","commenter_a":"The NRA are the republicans pimp....","post_message":"\"We're talking about terrorism right now. This isn't about guns.\" Congressman Sean Duffy rebuked House Democrats, who are staging a sit-in for stricter gun control measures."},{"comment_id":"10153814122893984","commenter_b":"I think if gay couples have to go to another office in another county, then their taxes should follow where they get services. I'm sure if Kim's paycheck was affected by how many licenses she issued then her religious beliefs would't be as important.","commenter_a":"Hey, wait a minute.....where's the outrage towards the Muslim bakeries (several) who refused service to gay couples planning weddings because of their religious beliefs? And why did the Muslim Target store cashier get an allowance to her job description to specify items she refused to ring up for a customer when they wanted to purchase a bottle of wine? And why did the Muslim flight attendant (<----surreal, isn't it?) get a religious liberty allowance to her job description by refusing to serve alcohol to a passenger? Yeah, okay. Had Kim been a Muslim, this narrative would have flipped to sympathize on the side of religious liberty. But she's not Muslim. She's just a Christian adhering to her religious rights, and in a respectful way, might I add. Respectful. Take a page, all you vulgar-mouthed, whiny, double standard hypocrites. It is what it is: religious liberty. Further, as stated in the ...","post_message":"The letters from Kim Davis that were just uncovered could drastically change how people think about this case. Do you stand with Kim Davis?"},{"comment_id":"10152838085232014","commenter_b":"That woman is not a mother. A mother loving, nurturing, protective. That woman is a disgrace. She should never get those precious babies back.","commenter_a":"What's wrong with these people leaving their kids in cars alone o in apartments....seriously people stop having kids or don't have them at all if you're not going to be responsible.","post_message":"Police say a Phoenix mom left her two babies alone in an apartment with a bathtub full of water, a switchblade in reach, and an open door to the third-floor balcony."},{"comment_id":"10156996522130354","commenter_b":"I will not vote for Ryan ... he is a socialist....","commenter_a":"Yep!","post_message":"TED CRUZ: PEOPLE WILL ‘REVOLT’ IF NOMINEE NOT ME OR TRUMP..."},{"comment_id":"767374910062356","commenter_b":"Yes!","commenter_a":"Lord help us she is just like Obama.","post_message":"Can we PLEASE learn from last time?"},{"comment_id":"10153452535630399","commenter_b":"Your attempt at cleverness comes off as fairly moronic.","commenter_a":"Obama should go to China........he might love being with his fellow Commies so much he Might not want to come back....","post_message":"Scott Walker takes on...Chinese economics."},{"comment_id":"1582705788695822","commenter_b":"Hillary Will be President!!","commenter_a":"Liar. Killer. Cold hearted, some one please drop a house on her","post_message":"Thank you, California!"}]
