[{"comment_id":"539015142953445","commenter_b":"Scum of the earth all of them! !!","commenter_a":"But they're a Religion of Peace!","post_message":"These guys are SCUM!!!"},{"comment_id":"10152983460914342","commenter_b":"Good to hear","commenter_a":"When my grandmother got very sick we put her in a nursing home it was bad they make people thing it was the best place ever but it was not after my grandmother passed away that was the only day i saw my grandmother nice and clean ,(.... but now after my dads stroke we have him in a nursing skill facility and is the best of all i being into is call Grace Care here in katy is super clean nurses are super nice the whole staff is very friendly my dads loves this place the way they treat their patients is absolutely amazing i will recommend this place to anyone!!!!!!","post_message":"\"Most people don't realize how expensive this care can be until a parent or family member needs it...and then it's a real shock.\""},{"comment_id":"472703329582291","commenter_b":"How does Trump make Mexico pay for the wall, When America has no authority over Mexico ?","commenter_a":"We need the good people of Florida to Vote Trump!","post_message":"FLORIDA: Early voting is now open! Do not miss this opportunity to #MakeAmericaGreatAgain #Trump2016 Ivanka Trump Find Florida early polling locations: @webpagelink"},{"comment_id":"992434430797029","commenter_b":"That woman needs to be locked up in the nearest lunatic asylum.","commenter_a":"Pathetic & scary scenario is these lunatics own guns! She probably packs a gun in her Walmart plastic purse! When these nut jobs escalate as she did, back up & run!","post_message":"Something tells me this nut is a Tea Partier."},{"comment_id":"10154199913475530","commenter_b":"You told me about them n we used to look for my Riverland park","commenter_a":"@username Remember us searching for these when we were kids?! Lol","post_message":"Get outside and train your eyes onto the forest floor. Morel season is on in Michigan."},{"comment_id":"10150715134694999","commenter_b":"@username Illegal immigrants steal roughly 9 billion dollars worth of resources reserved for American citizens every year. Deporting them per our existing laws will save us a ton of money...any more brain busters?","commenter_a":"What's even more appalling is that he's polling at 39% of Republican + Republican-leaning registered voters in the latest CNN poll. ...What does this say about our country and how folks want our supposed leaders to behave? What is this acceptance of ongoing crass commentary? ...And what happened to equanimity and professionalism?","post_message":"Donald J. Trump called Hillary Clinton's mid-debate bathroom break \"disgusting.\" Frank Bruni says it's \"the rare man-child who finds that worthy of ridicule.\" Read on in The New York Times Opinion Section."},{"comment_id":"509999849159970","commenter_b":"So you live in England and wanna talk about raping places for centuries? Bitch please you would be speaking German in we don't not come to Europe and save you bitches.","commenter_a":"He ain't a Muslim, no outrage #Murica","post_message":"DEVELOPING: The search for the suspected gunman continues this morning."}]
