[{"comment_id":"10153439531452235","commenter_b":"Bitch is bucking for re-election.","commenter_a":"As Governor, I would think she had the power to do so on her orders.","post_message":"WHOA!"},{"comment_id":"10153408065894087","commenter_b":"Think all of you are missing the point. Women does it , Throw the book at her !!!!!!! Guy does it , oh yeah no problem .","commenter_a":"All these criminals need to go down, Hillary included","post_message":"Congressional Republicans are largely brushing off the news Defense Secretary Ash Carter used his personal email to conduct business at the Pentagon, in stark contrast to the scrutiny that has fallen on Hillary Clinton."},{"comment_id":"472965199559859","commenter_b":"I'd be packing my bags headed for Ecuador.","commenter_a":"If hell freezes over and Trump actually wins the White House, I forecast that the USA will see the largest mass exodus of the intelligentsia class of citizens in the history of our country. Those people capable of using 3-4 syllable words including researchers, doctors, teachers, scientists, and engineers will not be able to stomach the idea of a golden haired baboon driving the nail into the coffin that was once the United States of America. May God have mercy on us.","post_message":"Donald J. Trump: \"Happy #CincoDeMayo...I love Hispanics!\""},{"comment_id":"10155053775333984","commenter_b":"Maybe someone should shove a fork up your ass bitch","commenter_a":"I hope the government is checking the silverware and other furnishings of the WH before the Obamas leave...... we all remember what happened when the last democrat family left the White House.......","post_message":"As the Obamas leave the White House, Congress has some bad news for them... and this time, they're delivering it to MICHELLE Obama. See the bad news they have for the first lady while she's on her way out the door..."},{"comment_id":"1039200399433046","commenter_b":"What were her parents thinking? I never left either of my children unattended in a car. That could have killed their most precious thing in the world. It is crazy to leave your child unattended in a car at such a tender age. I applaud the rescuers.","commenter_a":"Stupid people shouldn't breed.","post_message":"HOT CAR TODDLER RESCUE>> From Michelle Millman: This just breaks my heart for this little girl trapped in a hot car. A woman broke a car's window in Kansas after seeing a toddler trapped inside. Police say a couple left the girl while they shopped! Sadly, the woman says the parents seemed to care only about the damaged car."},{"comment_id":"1110991635663754","commenter_b":"All he did was that march. And she's scared? She worked under Obama for years! Goodness sake you're a liar","commenter_a":"He should....he's been a supporter of equality his entire career....Hillary has not!! Hillary is the dost kind of candidate...she will switch up her position just to look good...Bernie Sanders marched with Dr. King...Hillary is terrified of black people....fake a%%","post_message":"Here's how Bernie Sanders may be starting to crack the crucial demographic of Democratic voters."},{"comment_id":"1119120924851115","commenter_b":"You're a misogynistic prick who probably doesn't get laid often. Go masturbate or something.","commenter_a":"Aww poor babies couldn't handle a wittle emotional turbulence? Fuck you, you are such testicles (in lieu of pussies, which can actually take quite a pounding).","post_message":"Depression, muscle pain, mood swings, acne, and changes in libido – sound familiar?"}]
