[{"comment_id":"1069291126441959","commenter_b":"WHEN DO WHITE PEOPLE GET TO TAKE THE COUNTRY BACK.......","commenter_a":"Rest well","post_message":"One of the Dallas police officers killed in the sniper attack has been identified as DART Officer Brent Thompson, 43. He is the first Dallas Area Rapid Transit officer to be killed in the line of duty. \"Our hearts are broken,\" DART spokesperson Morgan Lyons said in a statement. \"We have received countless expressions of support and sympathy from around the world through the evening. We are grateful for every message.\""},{"comment_id":"1488225507869622","commenter_b":"LOSER !!!","commenter_a":"Good should have done that long time ago","post_message":"HAHA! He's FIRED!"},{"comment_id":"10154008998213797","commenter_b":"Whites wouldn't understand discrimination lol you sound stupid how about the jews they were white how about the Irish when they came to America they were white what about any German that came over after ww2 they were white now tell me again how ur comments are relevant","commenter_a":"It's not like she labeled their ticket with racial slurs. I guess I don't see what the big deal is. If the waitress had put \"white couple\" on a ticket, no one would care.","post_message":"WAITRESS LABELS CUSTOMERS: Kimberli Wilson went out to eat, and when the bill came, she couldn't believe what was written at the top. The waitress labeled her table by race. Here's what happened when she confronted the manager:"},{"comment_id":"1113471052062455","commenter_b":"Spot on Allen West ... that's Donald Trump","commenter_a":"\"I want to raise a generation of young people who are devoid of conscience, imperious, relentless, and cruel.\" - Adolf Hitler Obama and Hillary read this and are following it. Hillary did her college thesis on this topic. Now you can add Bernie Sanders to the mix. From Alinsky's Book, \"Rules For Radicals\": How To Create A Socialist State by Saul Alinsky There are 8 levels of control that must be obtained before you are able to create a social state. **The first is the most important.* *1) Healthcare Control healthcare and you control the people* *2) Poverty Increase the Poverty level as high as possible, poor people are easier to control and will not fight back if you are providing everything for them to live.* *3) Debt Increase the debt to an unsustainable level. That way you are able to increase taxes, and this will produce more poverty.* *4) ...","post_message":"Allen West Republic @webpagelink"},{"comment_id":"10153988463481077","commenter_b":"If this is true, shame on her! She should be charged too!","commenter_a":"So she knew about it before it happened?","post_message":"Mateen's current wife told the FBI that she was with him when he bought ammunition and a holster, and that she once drove him to Pulse because he wanted to scope it out."},{"comment_id":"10153957745968132","commenter_b":"wow pretty stupid its not like the jungle book jeez idiot she should be caged","commenter_a":"Who the hell in the PEOPLE staff is in charge of the facebook page that writes obsurd comments?? What the hell is terrifying about this situation?? Nothing! She was a moron that snuck into a zoo and decided to pet it. She got what was coming to her. Terrifying..would be if it's normal business hours and a tiger came out of its cage.","post_message":"This is so terrifying!"},{"comment_id":"979482032090033","commenter_b":"I hope they fire this liberal girl.","commenter_a":"What do we expect from a company whose owner and chief executive is arrogant and unChristian!They just follow their leader. hope that more people boycott Starbucks. There are better coffee and cheaoer ones out there.","post_message":"Starbucks seems to be on a roll lately, and not in a good way! Should conservatives stay away from Starbucks?"}]
