[{"comment_id":"10155157065294749","commenter_b":"Jade Louise Caswell can we go to chicken house again Sunday pls","commenter_a":"Jade Louise Caswell","post_message":"\"He pointed a gun at her head, demanding that she give him a nugget.\""},{"comment_id":"10153250521056509","commenter_b":"It's not just FL, horrible people live everywhere...","commenter_a":"Why does so much f*d up sh*t happen in Florida!?!?","post_message":"A 5-year-old Florida girl was killed after her father tossed her off a bridge from his car, police said Thursday. @webpagelink"},{"comment_id":"1149041588518531","commenter_b":"I'm a nasty woman too. FUCK DEPLORABLE INC.","commenter_a":"I guess I'm just a nasty woman!!!","post_message":"I don't think this is what Donald Trump expected to happen."},{"comment_id":"10153196800261051","commenter_b":"Shut up you bitch! !","commenter_a":"I thought for sure she would want to be a Ferguson protester!","post_message":"Michelle Obama was asked a simple question: If you could have any other job in the world, what would it be? Here's her response."},{"comment_id":"10153630936701955","commenter_b":"Idiots are using it for crack and other illegal substances !","commenter_a":"What a shitty headline. The doctors put him in a coma, not the e-cig. Drudge should have had more sense than to repost such drivel.","post_message":"Man In Coma After E-Cigarette Blows Up In His Face..."},{"comment_id":"10153763731329170","commenter_b":"Of course Obama and the Democrats will send them to Texas. That conservative state must stand their ground against the onslaught of terror on America.","commenter_a":"They are stuffing them into Texas in an effort to change us from conservative to liberal","post_message":"This shocking map shows exactly where Islamic extremism is festering within the United States... Has this scourge reached your community yet?"},{"comment_id":"10154529062833132","commenter_b":"Your son probably won't even know what's going on unless he's seen the first one. Gtfo with your nonsense lady. I hope your son grows up to be a better adult then you.","commenter_a":"Cant they just leave the kids movie alone? Kid's dont need to see that. My son isn't going to see the movie now. I swear the gays have to take over","post_message":"Ellen DeGeneres is addressing the issue some people had after the recent Finding Dory trailer."}]
