[{"comment_id":"10152945596811336","commenter_b":"most schools require children to be up to date on vaccines - if you want to enroll kids in school it has to be done. But it does need to be a parent's decision- there might be extenuating circumstances where they chose not to.","commenter_a":"When commenting on a liberals post, check your grammar and punctuation carefully because that's the only comeback they've got.","post_message":"Sen. Rand Paul got a booster shot just a day after he injected himself into the national vaccine debate: @webpagelink"},{"comment_id":"424495247675070","commenter_b":"No, it's us white people's fault................we don't give them enough !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Right on!","post_message":"Could Bill O'Reilly be causing more harm than good by saying this?"},{"comment_id":"1812875395612222","commenter_b":"@username......................your a @&$)(:; fool","commenter_a":"Such a BS! Obama made a deal to stop nuclear proliferation. Iran's compliance with our demands lifted the sanctions. So they got THEIR money. Eric Trump is total idiot thinking he knows anything about this matter.","post_message":"\"[President Obama] lied about it. He said that it wasn't ransom money... No different than when he lied about ObamaCare.\" Yesterday on \"Sunday Morning Futures,\" Eric Trump accused President Obama and Hillary Clinton of lying to the American people."},{"comment_id":"10152857545591051","commenter_b":"They all need to be sent over with Isis! If you don't like this country, get the hell out!!!!!","commenter_a":"Agree with @username.","post_message":"More than 1,200 people, including a lot of prominent professors, just signed a letter to ban the American flag. Here are all their names and the schools they’re from."},{"comment_id":"1172261136143561","commenter_b":"iPhone 7 will murder Note 7, with its 720p display and 2000 mAh battery. *Slow claps*","commenter_a":"Verge commenters won't like to admit verge is now defending samsuck. Looks like Samsung paid Verge, the iPhone 7 will murder this on benchmarks AS IT ALWAYS DOES","post_message":"Seriously, everybody chill."},{"comment_id":"10153062363276162","commenter_b":"Black women are much more violent than all other women combined!!! Actually, violence is the worst among blacks. So stop saying there are bad in all races.. WE ALL KNOW THERE ARE BAD PEOPLE IN ALL RACES.. but the fact is that more blacks commit crimes than all other races combined.. WHY? WHY???? WHY????????","commenter_a":"Just the blacks stealing again. They'll catch them.. eventually as always.. then when they fight the cops, they'll complain that the cops used unnecessary force again.","post_message":"SMASH & GRAB: Thieves smashed a stolen car through the windows of a Best Buy in Lincoln Park early this morning. Officials aren't sure how much was stolen, but no one was injured in the break-in. FULL STORY: @webpagelink"},{"comment_id":"1363588373682001","commenter_b":"She should be a circus act, a walking talking pig!","commenter_a":"She's such a pig! She's irrelevant and is desperately attempting to retain some sort of notability. Yeah Rosie you and your big disgusting mouth will be remembered for the hateful words you've inflicted on society. Nice going!! I'm pretty sure you're own adopted kids figured you out and want nothing to do with you!? Very telling!","post_message":"Her tweet of a video questioning whether his young son, Barron, is autistic is nothing short of bullying."}]
