[{"comment_id":"1209908089068937","commenter_b":"Stay strong","commenter_a":"Wow what nasty humans out there!!! Thank you so much to those of you that have some understanding of what I went through..","post_message":"A truly incredible transformation (Via Daily Mail Australia)"},{"comment_id":"880543368756744","commenter_b":"@username ok women let karma take care of me .","commenter_a":"I hope the teen's parents pay for everything for what this family went through. Yes it is the parents fault for not controlling their little shits.","post_message":"The husband of the Ohio woman left brain damaged after teens threw a rock through the windshield of her moving car has committed suicide."},{"comment_id":"10154984816883797","commenter_b":"I hope this women knows that dying is the easy way out that she is not going to get.","commenter_a":"I utterly despise anyone who would harm and even go so far as to kill a child, ESPECIALLY the parent of the children.","post_message":"BREAKING: A statewide Amber Alert in Indiana has been canceled after a 7-year-old girl and 6-year-old boy were found dead Monday."},{"comment_id":"1575163439454943","commenter_b":"Thank God for this smart young man I hope he can get thru to these thugs who have done this.","commenter_a":"I tip my hat to this young man who certainly possesses a depth of wisdom and pray he and many more like minded can be first to reach out in some way that only he and others are acceptable for the larger purpose TALKING to others about the failure that they have caused but need to turn back to!!!!","post_message":"One Milwaukee resident has a message for rioters destroying his community. And it completely DEFIES the liberal media's narrative."},{"comment_id":"1207103952642966","commenter_b":"I'm a democratic and I don't like gay people at all I mean at all.","commenter_a":"I thought she was with the Inquisition.","post_message":"Kentucky clerk Kim Davis, a longtime Democrat, says she is switching to the Republican Party because she feels abandoned by Democrats in her fight against same-sex marriage."},{"comment_id":"10153715953211336","commenter_b":"America can't wait for these 'Rug Rats' to grow up. We need action NOW.","commenter_a":"Very true!!","post_message":"ICYMI: Dr. Ben Carson said that fiscal irresponsibility is ruining the future for younger generations. What do you think? More from the GOP candidates at the Values Voter Summit: @webpagelink"},{"comment_id":"10154359999193132","commenter_b":"She is bigger in size for sure","commenter_a":"Even though he won, I think La'Porsha is going to be a bigger star. We haven't seen the last of her. :-)","post_message":"Congratulations to the fifteenth (and final!) winner of American Idol!"}]
