[{"comment_id":"408767239311570","commenter_b":"@username, you are an idiot, we DON'T live in a democracy, our founding fathers set up a constitutional republic to keep \"mob rule\" from ever ruling. What do you suppose will happen when 51% of voters all vote for free stuff??? What needs to happen is we need stricter voting laws. No felons can vote, nbody that recieves public governmenet assitance can vote. Rules lile this would EXTEND the life of our country. People who think like you ARE what's wrong with AMerica","commenter_a":"None of them can be trusted but seem to get elected anyway!","post_message":""},{"comment_id":"10154126114949877","commenter_b":"Off with her head!!!","commenter_a":"If it were my child, the white mother would be in a box today.","post_message":"White Mother Charged w/ Assault for Slapping Black Teen after Screaming N-Word. Watch how it all unfolded and the family's reaction below. Grio fam, can you imagine if this was your child? Sound off!"},{"comment_id":"992371087511918","commenter_b":"So she is only part Native American because you think they must have been raped? Um.. I am part Native American because my great grandmother was savagely raped by a Native American, so please tell me how innocent and peaceful they were. And yes illegals now are a different story. Whether you like it or not, when Europeans came here it was a hostile takeover. There was a war. Which the Native Americans lost. So if illegals want to wage war, than they can bring it on. If not, they can go the he'll home to whatever country they came from. I honestly don't care which country it is.","commenter_a":"If Native Americans had @username \"Illegal European scumbags have yet again raided local villages, they crashed their boats into our shores, raped our women and children and then killed them for not turning into Christianity..\" #Talk about several overdue sentences","post_message":"Margarito Quintero didn’t have a license and was in the United States illegally. He was previously arrested and deported in 2008."},{"comment_id":"10154569592984497","commenter_b":"@username GO FUCK YOUR MOTHER","commenter_a":"Mom really in love with new fat penis-shaped exotic veggie.","post_message":"\"Carol from book club told me about it and sent me a recipe to cook it in a skillet.\""},{"comment_id":"10156651164980551","commenter_b":"Dame this women looks alot like Natily wood","commenter_a":"Mine, too!","post_message":""},{"comment_id":"10153226407581770","commenter_b":"Evil scum bags. Send them back!","commenter_a":"Strategically this suicide!","post_message":"When the politicians said \"Refugees Welcome,\" did they know they'd be welcoming a rape culture as well?"},{"comment_id":"10156555816055354","commenter_b":"A radical muslim wants to kill you. A moderate muslim wants a radical muslim to kill you.","commenter_a":"Wake up and smell the coffee.","post_message":"This is what we're up against, gang..."}]
