[{"comment_id":"1229197387109219","commenter_b":"Putin to Obama stop protecting Muslims I know Putin he is insane. What do you want from 1st a Muslim then a racist 1/2 black 1/2 white that own family owned slaves. And a bi sexual with a jar of Vaseline in his side table","commenter_a":"And so how is this different from supporting Israel which is pro-pro abortion? How does the GOP electorate square Israel's pro-abortion record with U.S. Southern Christian position on abortion? @webpagelink","post_message":"\"If I told you in 2008 that Barack Obama would negotiate a deal that he acknowledges will fund terrorism, you'd have thought me a conspiracy theorist.\""},{"comment_id":"10155031331646320","commenter_b":"You are on my prayer list.","commenter_a":"Stay strong","post_message":"Detective Steven McDonald was hospitalized earlier today after suffering a heart attack. Our thoughts and prayers are with the McDonald family. A former U.S. Navy hospital corpsman and third generation police officer, Steven McDonald was shot three times in the line of duty on July 12, 1986. The shooting left him quadriplegic. Several months after his injuries, he said that he had forgiven the 15 year-old who had shot him."},{"comment_id":"10152796636027217","commenter_b":"where are the women","commenter_a":"Check their passports and visas ...","post_message":""},{"comment_id":"10154886210018984","commenter_b":"If you assholes would only enforce our freaking laws there would be no need for the wall!","commenter_a":"The US can do anything when it puts it's people to work. Understandably, a physical wall can not be built in certain areas but our very brilliant problem solvers will find solutions for that. OBAMA never wanted to secure the border. Trump will turn loose the ingenuity of AMERICANS & the job will be done.","post_message":"The Republican Party is not wasting ANY time. Right after Donald Trump defeated Hillary, the GOP let everyone know where it stands on the wall..."},{"comment_id":"10153541693114714","commenter_b":"Why is it YOUR business what she does?","commenter_a":"I don't understand why ppl think that it's okay to die \"their own way\". Any way you slice it, that is suicide.","post_message":"\"When I pass, I do not want her to watch me in pain.\""},{"comment_id":"714217398680845","commenter_b":"Kill all the bad muslims!!","commenter_a":"Muslim POS","post_message":"And he's wasting no time launching his attack..."},{"comment_id":"10153353453448132","commenter_b":"She is a brat !","commenter_a":"I love her ! Hopefully she doesn't become a total brat","post_message":"AMAZING!"}]
