[{"comment_id":"842641039186009","commenter_b":"Do that to me, and I would turn you into a girl!","commenter_a":"What a bunch of cowards that's what we need not","post_message":"Here's the 'poor refugees' just looking for a 'better life' as they piss on women. Check this out... @webpagelink"},{"comment_id":"10153757238999411","commenter_b":"Maria J Haloho A slut will be a slut anywhere","commenter_a":"Most Arabs are depraved sexual predators.Anyone who has ever seen Arabs on holiday in a European country can confirm that","post_message":"'Obviously neighbors aren happy about it, but it is what it is'"},{"comment_id":"1193174800771119","commenter_b":"@username and deport them","commenter_a":"Sounds to me like she's taken some pages out of Hitlers book: Meine Kaumph. Don't know if that is spelled right, but you get the idea. And I wonder how she'll feel about it when she reaches 80. (if she ever does).","post_message":"What's up with leftists having no problem 'taking people out'?"},{"comment_id":"10154134010956323","commenter_b":"Be careful, please. Chose a president because she is woman is sexism. Here in Brazil we already had our first woman president, and this brought to us hope about a better country, but now she is under impeachment process due responsibility crimes made and allowed by her. This not means that women are worst than men, au contraire, I have been working with many managers, directors and executives women and found professionals better than men. Point is, be careful with WHO is the woman you are choosing.","commenter_a":"No.","post_message":"\"Following a decisive victory in New York and with her path to the presidency ever-more surefooted, the possibility of the first female president is sinking in. And whatever your feelings about Hillary Clinton as the vessel for this achievement, it’s an extraordinary one.\""},{"comment_id":"1168639523214582","commenter_b":"Just another paid for asshole who got caught with his dick in his mouth. Now disbar this worthless piece of shit and scum.","commenter_a":"You cannot believe the media at all they're just liars liars and Liars and they make up s*** and tell it like it's real you can't believe nothing they say think or do and as far as thinking I think they're incapable of thinking anything they're being paid to Railroad this guy and they're going to do it for the money","post_message":"The judge in Donald J. Trump's Trump University case was just HUMILIATED... here's why he just had to undo his own ruling. This shows exactly why he shouldn't be on this case... it's time for him to recuse himself."},{"comment_id":"221003188363637","commenter_b":"@username And worse!!!! No wonder she needs to shop!","commenter_a":"Wait wait wait...I thought Trump's doctor told us that if elected, Trump would be the fittest, healthiest man to ever serve as President! You mean I was lied to about Trump???","post_message":"TELL US IN THE COMMENTS!"},{"comment_id":"710582602423848","commenter_b":"Ann Coulter shows her true colors like Trump. They both need a good dose of DUCK TAPE over their mouths.","commenter_a":"If this wasn't an election year, the Republican's would be silent about what Ann \"the Bigot\" Coulter said. In the past she has said terrible things about Muslims, Blacks, Mexicans & liberal Women & they were silent then !!!","post_message":"Ann Coulter needs to slither back into the snakepit she came from. --Andrew"}]
