[{"comment_id":"1100335149996537","commenter_b":"White people crossing the border are rapist and murderers","commenter_a":"I wish there was some way for me to give him a lift to Mexico","post_message":"Happening right now, police in upstate New York are going door-to-door, hunting for one remaining escaped prisoner from a maximum security prison. The two escaped nearly two weeks ago. The other was shot and killed by police earlier today. Much more tonight at 10."},{"comment_id":"10152680682100950","commenter_b":"Taniesha","commenter_a":"Wow","post_message":"The police officers who discovered the 18-month-old girl dangling in a car seat inside the submerged car said they heard a mysterious voice begging for help: \"Someone said 'help me' inside that car.\" Another officer also heard the voice: \"(It) wasn't just in our heads.\""},{"comment_id":"10152950499076130","commenter_b":"What a joke. Handcuffs is what she should be wearing","commenter_a":"SANDERS 2016","post_message":"Are you?"},{"comment_id":"858528920935448","commenter_b":"Sarah Dingle, how do you (or any Arabs or Muslims) have the courage to speak of apartheid when ISLAMIC COUNTRIES ARE WELL-KNOWN FOR THEIR GENDER-SEGREGATED SOCIEITES? That really laughable!","commenter_a":"If any Country refuses to compete in a friendly or qualifying tournament or bans others for racial reasons. They should be banned from all worldwide competitions! This is 2015!! Time to stop the hate against Israel!!","post_message":"Israel judokas were not allowed to compete in Abu Dhabi with the Israel flag on their judo uniform."},{"comment_id":"10153046800841717","commenter_b":"Thats one stupid bitch.","commenter_a":"Ok, now it should be the electric chair! This woman is a menace to society and to the rule of democratic law. What a pity she is incapable of learning new skills like other related species! Lol...next she wll have her own TV show!","post_message":""},{"comment_id":"10153830861505695","commenter_b":"It is much safer at sea then it is to remain in port.","commenter_a":"Praying they're found. Since the owners and the captain of the ship knew the path of the hurricane, why was it allowed to leave the port or at the very least why wasn't it rerouted?","post_message":"Loved ones aren't giving up hope, despite a life ring being found."},{"comment_id":"424819437642651","commenter_b":"I would be in prison because I would whipped her ass","commenter_a":"Oh, come on,@username, act your age! The girl was clearly in the wrong, but the sub lost the battle when he responded to her as he did. He should have immediately summoned help rather than try to argue with her.","post_message":"I wonder how this student would have been dealt with back in the day."}]
