[{"comment_id":"717073721816539","commenter_b":"She is nothing but a bitch and a liar.","commenter_a":"Hillary for Prison 2016","post_message":"Hillary tried to damage Trump’s reputation by spreading this rumor. She is disgusting. Comment ‘yes’ if you think Hillary should be punished. Can we get 30,000 ‘LIKES’ for Donald Trump? [VIDEO]"},{"comment_id":"10154194875640009","commenter_b":"This woman is a black retard, like the retarded black guy that was standing behind her when she spoke about the Kremlin invading KOREA. You let goofballs like this in a leadership position, you'll get a 3rd world country.","commenter_a":"the poor that is","post_message":"ICYMI"},{"comment_id":"1209490769090378","commenter_b":"Hillary is no lady she is more of a whore.","commenter_a":"We've already learned that this lady is a huge liar. What she says, and what she can do, are 2 different things. Obama just got blocked, so, hopefully this we won't have to worry about it and Trump will just be elected. Fingers crossed.","post_message":"DON'T let this woman be elected!!! @webpagelink"},{"comment_id":"593396500847956","commenter_b":"Hillary Clinton may or may not be Chuck Norris in drag #bitchesgetshitdone","commenter_a":"Hilary may or may not have killed a man with her bare hands in a NOLA speakeasy. In 1983 or 1991. #ComeySpeak","post_message":"Both the left and the right have criticized FBI director James Comey for how remarkably vague his letter was."},{"comment_id":"10153598011598812","commenter_b":"She is like.... Told you to stay away from those blonde white bitc... lol","commenter_a":"With his mommy right beside him worried about where her money is going to come from now","post_message":"Former FSU quarterback says \"I totally should have walked away\" after video surfaces showing him punching woman in the face."},{"comment_id":"952811251478596","commenter_b":"@username how about you go fuck yourself","commenter_a":"Wow, while I agree that both parties are leading us down a rabbit hole. The fact is we have two parties that lead us in this country. The democrats have a criminal and a socialist as front runners in their campaign. So I have no alternative but to endorse the republican party. If my friend that liked this post feels that makes me anti American then I guess we don't know each other as well as I thought.","post_message":"This HAS to be said. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"591571124359879","commenter_b":"@username : Educate yourself on the economy No wall it would cost over 530 billion in trade between US and Mexico costing over a million lost jobs in US alone and cause more than 3 states to go bankrupt. You may get a new fortified entry program but no wall.","commenter_a":"Trump failure to get Mexico to back down makes him look like the man who can't makes deals even with friends instead He was laid out and embarrassed by President Nieto of Mexico right from the beginning when they talked about the wall and was told Nexico would not pay for the wall , Nieto put Trump in his place so bad that Trump said they did not talk about payment of the wall . Trump was so embarrassed that on his flight back to US he changed his speech for the Arizona rally . This is a sign of a Man who can't control his emotions and would and could lead us into a Nuclear War .","post_message":"Government access and favors will no longer be for sale, and important email records will no longer be deleted and digitally altered! -DJT"}]
