[{"comment_id":"10154589081180586","commenter_b":"@username YOU ARE A BRAIN DEAD MORON","commenter_a":"Here's the thing- There are plenty of us voting for Hillary, we just don't find the need to scream about it all day long, ya know? And maybe we don't put up signs because we know the kind of needless drama it will start with any childish, loose cannon Trump supporters that happen to come across it... The Hillary supporters are here, we're just too busy working/paying taxes and rocking the good life to yell it from the rooftops everyday...","post_message":"Another national survey shows Hillary Clinton and Donald Trump in a near-even race in the final weekend before Election Day."},{"comment_id":"1341394042564599","commenter_b":"so lets make america so scary and violent for them that they won't want to stay here. america is a big fat sow that they will feed off of till she dies","commenter_a":"Nice mike","post_message":"TheBlaze news update with Sara Gonzales"},{"comment_id":"10153029967097014","commenter_b":"She's a weirdo","commenter_a":"Amy Lunsford JUST DO IT","post_message":"At first glance, the text messages appear to show a disturbing case of cyberbullying: one teen urging another to kill himself. But this was no bully. They were from a 17-year-old girl to her boyfriend, whom she called the love of her life. \"You can't think about it. You just have to do it. You said you were gonna do it. Like I don't get why you aren't\""},{"comment_id":"10153201550225329","commenter_b":"I agree she thought she untied the cloak and when they pulled she realized it was not untied so it was a mistake and I doubted anyone will get blamed for it.","commenter_a":"Because of my job, I saw the Brit Awards here in the US. What people DID NOT SEE (unless you live in the UK) is the fact that she did her entire performance. She may not have been able to dance to the best of her ability because of what happened, but she made it throughout the end.","post_message":"Poor Madonna"},{"comment_id":"10154754813479369","commenter_b":"She is ALL Talk!!! A PERFECT Politician!","commenter_a":"I can't wait until he is prosecuted for all of the crimes he has committed. Will that happen? With a just justice system it will.","post_message":"Trump to Clinton: 'You'd be in jail' if I was in charge."},{"comment_id":"10154005970128967","commenter_b":"I was just about to tag you in this haha","commenter_a":"Jack explains why he wanted out of Star wars :(","post_message":"It's no myth, Harrison Ford and Steven Spielberg are bringing Indiana Jones back."},{"comment_id":"10155208446069411","commenter_b":"Islam... set your clock back to 7th century as a women you will get a lot of respect....from those goat..f......wake up...woman","commenter_a":"Allah snickerbar...blowing up","post_message":"Fire is believed to be caused by an 'electrical problem' - @RemyBuisine on Twitter"}]
