[{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation. It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation. Read the whole story at Reverb Press HERE: @webpagelink"},{"comment_id":"908989295805078","commenter_b":"She was discriminatory to Israel in her tweet islamaphibia Israel. The middle east wants us wiped out! She is lucky she is in the USA where she can say what she wants as a woman in her country she would be stoned for the same accusation. Get over yourself lady!!!!!!","commenter_a":"Better yet, just stay home","post_message":"\"This discriminatory and disgusting behavior.\""},{"comment_id":"960199417353864","commenter_b":"You think allowing illegals to become citizens will not increase your \"real problems?\"","commenter_a":"What in the world are those loony Republicans thinking? Oh yeah, it's the \"me, me, me, f**k you!\" mentality that keeps them going. They ignore the real problems of gang wars, poverty, human strife, and persecution in the places where immigrants come from while at the same time, those idiot neocons perpetuate the \"War on Drugs\", \"War on Syria\". and all other unnecessary wars. Those people show no mercy on fellow human beings... Why is it that people remember to hate and separate while struggling to love and unite?","post_message":"Republicans are so eager to see brown-skinned children deported that they're willing to put the entire country at risk in hopes of making it happen."},{"comment_id":"10153178962341833","commenter_b":"Oh and not to mention we wouldn't have lasted a day against the British without guns.","commenter_a":"People just don't get the fact that we are still a democracy after 240 years in part because we as a population have the constitutional right to be armed. Let's see how long we would have lasted otherwise.","post_message":"Thank you for helping us reach 4.2 Million LIKES on Facebook! Like and Share the news with your friends!"},{"comment_id":"963164673751396","commenter_b":"Or, why do we have money to support refugees but not vets or social security?","commenter_a":"because welfare has got our money","post_message":"Americas Freedom Fighters"},{"comment_id":"10154160102065047","commenter_b":"GET US OUT OF THE UNITED NATIONS; THEY ARE NOT STANDING UP FOR 'BASIC HUMAN RIGHTS' FOR THESE WOMEN AND CHILDREN UNDER ISLAMIC RULE. WHY? THEY ARE RUN BY ISLAM NOW. GET THE UN OUT OF THE USA.","commenter_a":"Why do so many Americans support and justify this abomination???? The number of Islamic apologists is nauseating!","post_message":"Little girls in northern Kenya are being brutally tortured and enslaved. They're forced to marry men as old as their father or grandfather. Sign our urgent petition to demand an end to this evil practice."},{"comment_id":"10153845002233984","commenter_b":"They can both suck deez nuts lol.","commenter_a":"Jeb may not have expected the question, but he handled it well. The conditions underlying the two events were not comparable. Megyn's comparison was a stretch.","post_message":"Megyn Kelly just took Jeb's criticism of Hillary and threw it right back at him with one question he did not see coming... Do you think Megyn was wrong for using this analogy or was it a fair question?"}]
