[{"comment_id":"10154251674646636","commenter_b":"O don't back benefit sanctions , however if your gonna make a living out of claiming benefits do the job right , simple as","commenter_a":"He has a sighted carer (his brother) who opens all his mail and should have done it. Obviously they had never requested braille correspondence. So on that aspect I (for once) can't fault the DSS however to not reinstate the money after they appealed the decision is just ridiculous.","post_message":"Awful"},{"comment_id":"10153221748849087","commenter_b":"@username,where are you from?? You pig!! Photoshop your KKK outfit on your daddy...hahahahahaha","commenter_a":"IT WAS YOU, OBAMA who spoke these words at an Islamic dinner - \"I am one of you.\" IT WAS YOU, OBAMA who on ABC News referenced - \"My Muslim faith.\" IT WAS YOU, OBAMA who gave $100 million in U.S. taxpayer funds to re-build foreign mosques. IT WAS YOU, OBAMA who wrote that in the event of a conflict -\"I will stand with the Muslims.\" IT WAS YOU, OBAMA who assured the Egyptian Foreign Minister that - \"I am a Muslim.\" IT WAS YOU, OBAMA who bowed in submission before the Saudi King. IT WAS YOU, OBAMA who sat for 20 years in a Liberation Theology Church condemning Christianity and professing Marxism. IT WAS YOU, OBAMA who exempted Muslims from penalties under Obamacare that the rest of us have to pay. IT WAS YOU, OBAMA who purposefully omitted - \"endowed by our Creator\" - from your recitation of The ...","post_message":"“I do not believe Sharia is consistent with the Constitution of this country,” Dr. Ben Carson told The Hill. “Muslims feel that their religion is very much a part of your public life and what you do as a public official, and that’s inconsistent with our principles and our Constitution.”"},{"comment_id":"575908422533751","commenter_b":"Kepp telling it girl !","commenter_a":"How true.","post_message":"Meghan McCain says that when Trump makes mistakes with his words \"it offends people sometimes and it can be controversial, but when Hillary makes mistakes, people die. Agree or disagree?"},{"comment_id":"10153750514111336","commenter_b":"Why isn't the media reporting on the violent acts being perpetrated by these muslim 'refugees' in Europe? Shouldn't Americans know the type of filth Obastard wants to bring to the US?","commenter_a":"The religion of peace strikes again.","post_message":"“I was taken by three men,” the murdered Syrian woman reportedly said. “Ever since that time my family has regarded me as unclean... They say that I deserve to die.”"},{"comment_id":"1236189426462383","commenter_b":"#ImNotWithHer","commenter_a":"You mean Hillary campaign staffers posing as sanders supporters","post_message":"Bernie Sanders supporters have taken to Twitter to reluctantly express support for Hillary Clinton using the unenthusiastic hashtag #GirlIGuessImWithHer."},{"comment_id":"10155450012565354","commenter_b":"Common Women are not going to waste 2000/yr on themselves. That is uncommon disposable income.","commenter_a":"You are not close to \"the common woman,\" if you refer to her as \"the common woman.\"","post_message":"Gwyneth is quickly becoming our favorite celebrity."},{"comment_id":"1242854355764972","commenter_b":"WHO THE F^CK ARE YOU ANYWAYS GO LEAVE NOW MAKE AMERICA GREAT BY ALL YOU BUTT F^CKING TRAITORS LEAVE","commenter_a":"good by trash","post_message":"Looks like we're going to need a second Trump Train...one that takes all these people south of the border..."}]
