[{"comment_id":"10155095813944203","commenter_b":"KEEP IT UP DEMS!!!👍🗽🇺🇸","commenter_a":"There should also be a petition to all cable carriers to remove FOX from their channel line up as this network is a danger to America. Tell advertiser to boycott FOX.","post_message":" misled the Congress and he misled the American people."},{"comment_id":"10155496447630603","commenter_b":"What's it going to be? Pick your switch? The belt?","commenter_a":"Did someone call scan","post_message":"This mother saw her son on TV throwing rocks at police, so she went to the rioting scene, found him and let him have it for taking part in the violence, according to local reports. @webpagelink"},{"comment_id":"10156350810355354","commenter_b":"Deport these little bastards ASAP","commenter_a":"and the dems what these people in this country!","post_message":"Brace yourselves. Amnesty activists just launched a VIDEO that EVERY American should WATCH..."},{"comment_id":"1132646906806453","commenter_b":"That hoe lowkey clean 😂","commenter_a":"Alexis Herrera Heberth Perez Johan Ramirez Luis Olmos Epi Benitez @username bet I won't 😂","post_message":"Too much sauce"},{"comment_id":"10153073286297894","commenter_b":"I think the idustry favors her and is partial to her music but there is no room for disrespect to anyone.","commenter_a":"I can't get past \"somewhat respect me\". Either he respects you or not! ByeTaylor","post_message":"Taylor Swift Talks Kanye West in ‘Vanity Fair': I Felt We Couldn’t Be Friends Until He Somewhat Respected Me"},{"comment_id":"838910662903525","commenter_b":"@username Take your temper tantrum elsewhere! Hillary's got this! #HillYes","commenter_a":"LOL JK BUILD THE WALL DEPORT THEM ALL TRUMP 2016","post_message":"I was so moved to receive this honor from Puyallup Tribal leaders."},{"comment_id":"10153748697767629","commenter_b":"If white women didn't flunk every black and Latino out we might have the blacks in college and in education that we need.","commenter_a":"When are we going to start making teachers uncomfortable and scared? its a white, more privileged profession with more time off. Especially at the college level. Shouldn't they fear being shot in the head too? Thankfully we are getting guns on college campuses so that all authority can be radically challenged with an in your face confrontation. The Russian left has always known the power of confronting authority so I'm glad America is catching up. War and Revolution baby! Just like the founding fathers intended.","post_message":"This is beautiful."}]
