[{"comment_id":"10154088708589087","commenter_b":"Including Melania Trump, she's illegal so vote for Hillary Melania!! LOL!","commenter_a":"the legal immigrants (hispanic and otherwise) should get onboard the Trump train...the illegal immigrants should vote for Hillary.","post_message":"House Hispanic Democrats said Trump is a \"cloud hanging over us\" as they begin celebrating Hispanic Heritage Month."},{"comment_id":"1737362022990205","commenter_b":"#fingersinthebootyassbitch","commenter_a":"He looks miserable. ..","post_message":"Kim Kardashian West is reportedly 'annoyed at him for refusing to rest' following 'psychotic break' (Via Daily Mail Celebrity)"},{"comment_id":"10156429465415354","commenter_b":"Whoopi, you dirty looking bitch Those Islamic Muslim women are in danger of being deported Our female population on the other hand is under threat of gang rape and murder by the Islamic Muslim terrorist.","commenter_a":"Moron...","post_message":"WATCH Whoopi unload on Donald Trump..."},{"comment_id":"1769553679939796","commenter_b":"Those assholes responsible, should be in jail.","commenter_a":"Clueless in government or politics,draft dodger and buy politicians,insulting others or winning moron only will make a sorry Clown.😀PLEASE GROW UP LEARN THE RULES OF THE GAME INSTED OF USED YOUR MONEY TO MANUFACTURE HATS IN CHINA. 🇺🇸","post_message":"This isn't how democracy is supposed to work! Donald J. Trump is absolutely ANGRY over what Ted Cruz just did to him in Colorado. Do you think he has a right to be angry?"},{"comment_id":"1574345245925141","commenter_b":"Hillary is a superpredator of immigrants and minorities. Bill is a superDUPERpredator of young women. She panders to Muslims who kill gays and rape women. Hypocrite superpredator. Ouch...","commenter_a":"We Americans know trump is weak. Trumps first trip to Mexico was a failure. He came to lie to American people just hours after the visit. Shame trump","post_message":"Thank you - Conservative Party of New York State. An honor to receive your endorsement! Together, we will MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10155295844155354","commenter_b":"And you should get absolutely NOTHING if you are here illegally.","commenter_a":"If you did not go through the proper legal channels to enter this country, you are illegal and your ass should be deported!","post_message":"NYC's New Illegal Alien ID Program Includes Free Membership to 33 Top NY Venues, Including the Metropolitan Museum of Art."},{"comment_id":"10153620225172377","commenter_b":"She is actually a feminazi and against our Second Amendment!","commenter_a":"Why would it be political, she's a republican hack. And is it remotely possible that he could be a sexual harasser.","post_message":"Newsmax CEO Christopher Ruddy says former Fox News host Gretchen Carlson lawsuit alleging Roger Ailes, the influential network chairman, sexually harassed her, simply doesn’t seem right. Ruddy writes: \"Interesting all of this is percolating in the middle of the most important election in modern times. I am not saying the allegations have a political angle. But the timing seems suspicious.\""}]
