[{"comment_id":"10154160211386336","commenter_b":"Stfu feminist","commenter_a":"Thank you @username for backing Megyn Kelly. If the cry babies can't take the hard questions, they can watch the lamestream stations.","post_message":"Unbelievable. (Via: ViralHog)"},{"comment_id":"10154596744362439","commenter_b":"Shoot that prick.","commenter_a":"so WE GIVE UP ON YOU BASTARD.","post_message":"That's why Europeans have to give up on the EU, if they hope to survive."},{"comment_id":"499007870289793","commenter_b":"She's an ass. She's not an elected official. Tell her to stuff it.","commenter_a":"Go away Michelle.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153806132721051","commenter_b":"@username How is going to all those with the wars he's going to start increasing taxes on the middle income and lowering it on the rich. Building a wall where's that money coming from? not Mexico. Putting a 35% tariff on goods from China. Good move Trump and the China and other countries do the same to us. How about that lost American jobs?. You don't think Mexico buys from us? What about machinery, minerals, autos, trucks and military equipment anf farming equipment.","commenter_a":"Interestingly Trump praised all of Obama's policies. Now he says he's done a terrible job. He praised Hillary's job performance as Senator and Secretary of State and endorsed her for POTUS, now he calls her incompetent. Hmm. Should we really elect someone with such horrible judgement?","post_message":"In an interview today, Donald Trump said President Obama has done a \"terrible job\" in office and has allowed countries to take advantage of America. Is he right?"},{"comment_id":"704402909750287","commenter_b":"1st lady my ass","commenter_a":"She destroyed the school lunch program. Absolutely destroyed it...","post_message":"Michelle Obama gets blind sided with this devastating blow, it's over. No one cares about her. She is a disgrace. Are you tired of hearing about Michelle Obama?"},{"comment_id":"10153328594703132","commenter_b":"She needs to just quit. Can't stand her","commenter_a":"Jennifer Lesher","post_message":"\"I do not want to use my comedy to contribute to a culture of unattainable perfectionism and intolerance towards difference.\""},{"comment_id":"10152655147557267","commenter_b":"Plain english","commenter_a":"No bill should be over ten pages long, nothing else added and in plain English a fifth grader could read","post_message":"I voted ‘no’ on final passage of H.R. 240, the Department of Homeland Security Appropriations Act of 2015, which was ultimately stripped of provisions to stop the President’s executive action on immigration. Read my full statement here: @webpagelink #idpol"}]
