[{"comment_id":"10153309975398128","commenter_b":"Rich girl with bad credit","commenter_a":"Let us all shed a tear for the rich girl...","post_message":"Even the daughter of the CEO of the largest U.S. mortgage lender found it hard to buy a home in one of the country’s hottest housing markets."},{"comment_id":"10153314569635950","commenter_b":"Lol yup","commenter_a":"Trump is great at selling fear. Notice how there is almost a \"Trump's fear of the week\" going on? He's great at pitching things and selling himself. Republican voters are eating this up because they like to be scared because they love having an excuse to fight someone or something. Go ahead and cling to your guns and foam at the mouth screaming about the next conspiracy,. I'm over here sipping coffee and watching the GOP sink like the Titanic.","post_message":"\"I don't like anything having to do with changing our Second Amendment. We have plenty of rules and regulations.\""},{"comment_id":"10153591407472293","commenter_b":"So youre saying,sir , that you may agree with some of their values and not be aware that you do because of conditionally environmental blindness.","commenter_a":"We're seeing some of the results of Donald Trump's subpar education. He makes up for his lack of intelligence with bluster, but in the end it won't serve him or our country well. Next Trump will boast that he will make the trains run on time.","post_message":"Donald J. Trump's responses quickly prompted criticism from his Republican rivals and others."},{"comment_id":"10153417590345329","commenter_b":"Nah,cause then feminists will bitch.","commenter_a":"Stop that already! Or make MomBodies a thing!","post_message":"DadBody goals right here via Leonardo DiCaprio."},{"comment_id":"10154264238746509","commenter_b":"We have been since before 9/11, WTC was hit twice by them","commenter_a":"No we are not at war......but we do have a cancer growing that needs to be eradicated !!!!","post_message":"U.S. Senator Ted Cruz said Thursday that the deadly mass shooting in San Bernardino, California, shows that the country is \"at war.\""},{"comment_id":"958480264190210","commenter_b":"From this little shrimp? He couldn't lick his lips!","commenter_a":"The high-water-mark of this idiot's journalistic career was his appearance on \"My Name Is Earl.\"","post_message":"It is amazing that Fox keeps Geraldo around. He does this childish stuff all the time."},{"comment_id":"1093577714092941","commenter_b":"Same way any comments from Pak regarding Indians and Kashmir are irrelevant.","commenter_a":"We are talking about a region where induviduals will go as far as to hijack airliners and slam them into skyscrapers. They think anybody that doesn't conform to their sick twisted ideology is the Devil.","post_message":"\"In Afghanistan, being lesbian is seen as un-Islamic. If people found out, the result would be death.\""}]
