[{"comment_id":"10153106240459586","commenter_b":"Thank you for choosing adoption! <3","commenter_a":"Precious baby!! I have four rescued pets and must stop but it breaks my heart every time I see these posts..","post_message":"DON'T BREED OR BUY WHILE SHELTER DOGS DIE. @webpagelink CC: American Kennel Club & Westminster Kennel Club Dog Show SHARE if you ALWAYS #AdoptDontBuy!"},{"comment_id":"10157614671450293","commenter_b":"Time to take car keys. Hope this turns out well.","commenter_a":"He may of said screw it and is partying in the infield at dega . Lol . But serious note hope yall find him safe","post_message":"Have you seen this man? He was last seen driving to Coldwater, Ala. to see his son. CLICK to see if you recognize him, and please contact police if you have any information:"},{"comment_id":"10153699809290496","commenter_b":"Haha their wives might...lol","commenter_a":"As long as they bring home the gold, who cares??","post_message":"Three members of Team USA basketball reportedly ended up in a high-end brothel, but it was an apparent misunderstanding: @webpagelink"},{"comment_id":"10153142102307144","commenter_b":"DUMB ASS!","commenter_a":"What about soldiers lost in Iraq?","post_message":"Holy crap."},{"comment_id":"10152976248907232","commenter_b":"I am guessing both Pamela and Leslie are cop wives, or just like giving cops free head","commenter_a":"You know what boggles my mind is how they are here to protect and to serve but it goes both ways here .. they are paid by our tax $ to protect and to serve and yes there job is a hard job but at the end of the day these ppl are just like anyone of us ppl of the streets but I'm confused as to why if little mikey off the block killed somebody beat somebody or whichever would get a he'll of lot of years in prison and cops who are supposed to be here to protect and serve us would get a slap on the wrist or a leave of absence and paid .. so in reality we are all not treated the same by the system but let's just keep being blinded to the matter it has nothing to do with race it has to ...","post_message":"Thousands of demonstrators stood on sidewalks in Delaware County to show their support for law enforcement. STORY HERE: @webpagelink"},{"comment_id":"551488165033429","commenter_b":"Wendy is my bitch","commenter_a":"@username wendy is the most annoying motherfucker. Bitch always has something to say, never intelligently or well spoken, and always speak out of her ass. SHHHHHHHHHHHHHHHHHH.","post_message":"This is how you shut down breastfeeding shamers. Read more about Alyssa Milano's activism here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"10153266523095927","commenter_b":"Should have BABY MURDERER on the FRONT of that DRESS!!","commenter_a":"DISGUSTING!!","post_message":"Dress is part of a social media campaign that encourages women to share \"POSITIVE STORIES about their abortion experience ...\""}]
