[{"comment_id":"10153134052206770","commenter_b":"They haven't earned my country or my freedoms. Let them go back and earn them in their own country. We did.","commenter_a":"Scold the 57-58 Arab nations who REFUSE to take ANY. There must be some reason they're so adamant we'd be fools not to follow their led. And stupid to be swyed by a hoard of malcontents. Have yo shown ANY appreciation to those countries who have given you free access A RESOUNDING NO. That Homeland Security is aware of the risks, and still continues is disgraceful.","post_message":"The largest Arab American civil rights organization in the United States is alarmed because 31 state governors have said they will refuse entry to Syrian refugees in their states."},{"comment_id":"10154493195323132","commenter_b":"@username Do you believe everything that you read on the interwebs? And why are you so gung ho about defending Schumer? Or are you simply into fat chicks?","commenter_a":"Is anyone here a marine biologist? We have a beached whale on our hands!","post_message":"Amy Schumer, Kate Hudson and Goldie Hawn are the epitome of squad goals on their Hawaiian vacation."},{"comment_id":"1049397791786635","commenter_b":"Oh yes let's hope it's true!!","commenter_a":"Danni Fiebig @username","post_message":"The Bachelor Australia may have just given it away (via Daily Mail Australia)"},{"comment_id":"10153189307188352","commenter_b":"I Understand hw U feel. U will ask d Grace frm God 2 give U a woman,I mean a \"Virtous Woman\". God wil give U a Good woman as a Wife. Remember d Bible says, He who finds a Wife,finds a good thing n Obtain Favour frm God. U jst av to b HAppy wit Urslf.","commenter_a":"How is that when everything you are she just crap on me rip my heart out and then go to our church act like I don't even exist understand how you can say you love me 1 minute and then say you don't want to be with me the next and all I hear from people is get over it and just move on wow so easy to say I am not a man that has the gift of words to woo a woman love one forsake all others that is how I was raised","post_message":"Breakups hurt, but losing someone who doesn't respect and appreciate you is actually a gain, not a loss."},{"comment_id":"10153078285427217","commenter_b":"Melissa single mum? yep you can talk you trollop.","commenter_a":"Doesnt look to Australian to me. i wonder if she speaks english?.","post_message":"Thousands set out to #lightthedark 🔦"},{"comment_id":"10153214662726130","commenter_b":"Mmmm lies","commenter_a":"@username Sezer Yazar Karl Ervine","post_message":"This. Is. Amazing."},{"comment_id":"10153378576094087","commenter_b":"*you're","commenter_a":"your a SKANK!!!","post_message":"First Lady Michelle Obama and SNL player Jay Pharoah spit a sick bunch of dope rhymes in a new CollegeHumor rap video about how awesome it is to go to college. WATCH:"}]
