[{"comment_id":"10153523815251636","commenter_b":"This Guy is a Catholic Hater. Think women are 2nd class humans. Would kill all LGBT if he gets the chance. Yet he's pretending to be the victim. Oh and always blame Israel.","commenter_a":"How many people will have the iraqi flag on their profile? More selective outrage from ..........","post_message":"More as we get it"},{"comment_id":"1719312091654441","commenter_b":"It sure can happen. We'll see.","commenter_a":"Trump beats Hillary??? Never going to happen. He's too much of a loose cannon.","post_message":"Hillary Has Dark Secrets, Dick Morris Reveals Dick Morris says Trump can defeat Hillary. \"She will lie and cheat at every turn,\" Morris says, \"But Trump needs a new strategy.\" Morris reveals it in his new \"Armageddon: How Trump Can Beat Hillary.\" Get the book here: @webpagelink"},{"comment_id":"969277346429620","commenter_b":"Women only have X chromosomes.","commenter_a":"Those babies will never be normal. You need X and Y chromosomes. This is going to be sad.","post_message":"Humanity may have crossed a treacherous threshold as Researchers led by an Indian-origin scientist, have shown that stem cells from the skin of two adults of the same sex can be used to make human egg and sperm cells. What this means is, there is no longer a need for the opposite sex to “create Life”. What could possibly go wrong with “Playing God” and altering the creation of Life? #daysofnoah"},{"comment_id":"10152654360726636","commenter_b":"Dirty women, women in India are cleaner.. LOL","commenter_a":"Ewwwwwwww no way! Everyday girl me!","post_message":"One in three have gone three days without washing..."},{"comment_id":"10156907192725594","commenter_b":"He is currently behind, I am not suggesting that he is not. What I am pointing out is that EVERY SINGLE POLL gives him a much wider lead over Trump than Hillary's lead. Most importantly in swing states. Who cares that Hillary won most of the Southern states, they are not going blue. Bernie won in most of the swing states and he polls dramatically better than her over Trump in those states. He may be losing the primaries, it is probable even. However if the point of this article is that Trump is such a threat to the presumptive Democratic nominee and we need to not be distracted by the primaries than it is fair to say, who is the better candidate to defeat Trump? Maybe for the sake of unity and defeating Trump, Hillary should bow out. You know, for the common good.","commenter_a":"I think we need to start asking the question is it time for Clinton to bow out of the race. Because if our main yardstick is not letting Trump be president all the polls are pretty clear, Sanders is our best bet.","post_message":"Yet Bernie Sanders is having none of it, frequently telling the thousands of supporters who attend his rallies that he still has a narrow path to the nomination."},{"comment_id":"10153538645367232","commenter_b":"Yous are CRAZY, certainly it HAD to ALWAYS be a GHETTO, NO one would ruin a neighborhood ;)","commenter_a":"What Camden used to look like before the take over.","post_message":"Females attack woman with pole on South Jersey street in broad daylight and it was caught on camera: WATCH THE VIDEO => @webpagelink"},{"comment_id":"10153306545444575","commenter_b":"Its hard to trust the justice system when everyone isn't treated equally","commenter_a":"I'm sure anyone could argue \"what the parent should have/have not been doing\"... It only takes a quick look away for something like a car accident or a child to run out in the street to happen. What's unfortunate , is that we as people, don't trust the justice system when we face situations as such and feel the need to take matters in our own hands. Praying for both of the families in this loss.","post_message":"A driver and his teen passenger were shot and killed by an unknown gunman while talking with police. Right before the shooting the driver hit and killed a toddler who ran into the street. “Today is not a good day — when an infant can lose his life, and then someone, a Good Samaritan tries to do the right thing and then all of a sudden a tragedy occurs,” said a city official."}]
