[{"comment_id":"10154954307148984","commenter_b":"You're the dumbass,bitch!","commenter_a":"Lol.you dumbasses believe in stump???lol. I hope you get what he gives you lol and more","post_message":"Paul Ryan is shaking things up with this unexpected announcement. He feels so strongly about this, he decided to make his feelings known during Donald Trump's crucial transition period..."},{"comment_id":"10153090995473984","commenter_b":"They both need to be jailed or shot as the traitors they are!","commenter_a":"Dems must be psycho after all she has had to do with the deaths of Stevens etc she thinks SHE should run for POTUS! The audacity of entitiled politicians is RUDE!!","post_message":"She probably thought she had gotten away with it. Not so fast, Hillary... Should she face criminal charges for this?"},{"comment_id":"10153500482753598","commenter_b":"nothing that comes out of this woman's mouth is ever true!!!!!","commenter_a":"She is an idiot..","post_message":"Hillary Clinton Claims “All of Us Want to Fund Planned Parenthood”"},{"comment_id":"10153507506919877","commenter_b":"Wendy get a life","commenter_a":"People always get offended when you say that you love dark skinned women. For some reason we have been deemed as \"too masculine\" or \"dirty looking\" or \"just unattractive\" because some how all dark skinned women everywhere are all unattractive *insert eye roll here*. We don't have the standard European features so when people say they love us they get offended and say \"well what about the rest of us?!\". No one said that he wouldn't date other races but he loves dark skinned women. Good for him because we are some beautiful women indeed!","post_message":"Mack Wilds Professes his Love for Dark-Skinned Women...and Wendy Williams Gets...Offended? Watch the clip below. Grio fam, what do you think of the young actor's remarks?"},{"comment_id":"512513402270286","commenter_b":"take her ass outside and hang her","commenter_a":"Everything became a talking point of deflecting responsibility to her experts.","post_message":"Rep. Jim Jordan questioned Hillary Clinton about Benghazi attack: “You tell Americans one thing, but your family an entirely different story” WATCH and SPREAD!"},{"comment_id":"1309577419062434","commenter_b":"Did they have fair trials? Do gays need to be re-educated??","commenter_a":"Leave the man alone in his way Castro was great not a fair leader in terms of his military policy's but he did great things forcuba like healthcare and education!","post_message":"Marco Rubio called it \"embarrassing.\""},{"comment_id":"10152694220270736","commenter_b":"She doesn't have a soul.","commenter_a":"I'll be dead because of you then crashing sounds pretty intentional to me. How this person can even consider entertaining not guilty is beyond me. May the terror and the guilt of this tragedy eat her soul.","post_message":""}]
