[{"comment_id":"1068539523183857","commenter_b":"How can you support Hillary she lier and a crook! Trump trying to make a better America for all Americans. Hillary trying to make a better America for Hillary.","commenter_a":"Another libertard","post_message":"Actress Rosie Perez: “I really, honestly, want to understand how can you support someone who said such racist comments, who said such hateful comments,”"},{"comment_id":"1817145371836310","commenter_b":"@username MY BAD...I THOUGHT YOU WERE A WOMAN...NOW I UNDERSTAND...","commenter_a":"Yep. She got mitch slapped, and now she's gnashing teeth. I can't thank you enough mitch. Bravo. I thought you were a spineless rhino, and you probably are, but this is brilliant.","post_message":"Elizabeth Warren took to Facebook Live after being silenced on the Senate floor for quoting a 1986 letter by Coretta Scott King. Now, supporters are rallying behind her with #ShePersisted. @webpagelink"},{"comment_id":"10154376127101509","commenter_b":"Unemployment has been the highest it's ever been under his presidency. It has just recently declined...ever since republicans took control of congress. Hmmm @webpagelink","commenter_a":"He is the worst president in the history of this once great nation. Bush is a close second. Those two have done more to destroy personal liberty and prosperity than any presidents before them. Obama is such a hypocrite. Scolding this country about division between races and religion when he has done more to divide this country than anyone in history. I need a shower after that garbage.","post_message":"President Barack Obama presents \"four big questions that we as a country have to answer \" during his State of the Union address. #SOTU updates: @webpagelink"},{"comment_id":"10153037800452434","commenter_b":"@username So yeah... indeed! That is a bit ironic, ain't it? I'm not republican either, I'm against the two party system, but anyway you're so right.. cracked me up.","commenter_a":"\"the Republican Muslim Coalition\" ....really?","post_message":"\"WHAT UP BITCH\" -this hijab"},{"comment_id":"1230028840342704","commenter_b":"Not fit to be president. A witch","commenter_a":"From all accounts....Killary Rotten has one of the filthiest mouths in DC. She calls people nasty names and acts like she is insane...which she is. This is what she thinks of everyone in America....she is trying her best to fool as many as she can though.","post_message":"Is Hillary Clinton really a cold-hearted [expletive]? You won't believe her explosive fits of rage, even making her husband Bill bleed, as her astonishing vitriol has just gone public"},{"comment_id":"1747275395512005","commenter_b":"@username if it isn't Mr. Trump YOU will be voting in Hillary","commenter_a":"The only thing that needs to change is HIM OUT OF THE WHITE HOUSE.","post_message":"Obama says \"we\" need to pray for the \"strength to change.\" It's yet another of his disgusting refusals to acknowledge the realities we face."},{"comment_id":"10154709341603984","commenter_b":"Jealous bitch","commenter_a":"Could it be Mark Cuban is trying to get Trump to look like he would sell his party out for similar money Hillary has taken? :Edited, nah he needs to find a way to ruin Trump. He is looking for a weakness to exploit. I'm sure of it.","post_message":"Billionaire Mark Cuban just stunned everyone with a jaw-dropping offer for Donald J. Trump that NO ONE expected. There's something he wants the Republican candidate to do, and he's willing to give something massive in return..."}]
