[{"comment_id":"10153089785921491","commenter_b":"Ah , the range of a true lady.","commenter_a":"Love everything about her, even though I'm now aware of an intimate and amusing detail of which I had't really given much thought.","post_message":"Interviewers, beware: do not mess with Amy Schumer."},{"comment_id":"999021020109368","commenter_b":"This is legislature that should ONLY be debated and decided BY WOMEN!!","commenter_a":"mayam merouane ok @username","post_message":"What a brave woman"},{"comment_id":"1852101905022122","commenter_b":"trump is nasty","commenter_a":"I still can't vote for either of them...","post_message":"WATCH: Hillary Clinton and Donald J. Trump go head to head in the final presidential debate, live from Las Vegas."},{"comment_id":"10154984225302300","commenter_b":"Dee you are what's wrong with white people...","commenter_a":"Those darn white people attacking blacks.. oh wait.. this was black on black crime. Guess there won't be any riots over it.","post_message":"UPDATED: Eight people now confirmed shot Monday afternoon during a Martin Luther King Jr. celebration at a Northwest Miami-Dade Park, according to police."},{"comment_id":"1239053882772316","commenter_b":"@username They are ALL connected. Mcain, Obama, Hellary, Bush. If you think it is the \"other party\" that is bad, then they have been successful at controling your mind. The Dem/Rep thin is a HOAX!! Stop blaming obama. He is terrible, but he is just a puppet! Cut the strings of the puppet masters. vote for the guy they hate! Trump!","commenter_a":"As did the decision to try to overthrow Syria by giving unlimited weapons to \"rebels\" of unknown origin.","post_message":"\"Obama's decision to pull the troops out of Iraq may have helped to create ISIS. As did the decision to disband Saddam's army. As did the decision to invade a country that had nothing to do with 9/11.\" -- Jon Stewart @webpagelink"},{"comment_id":"10153278870867217","commenter_b":"Some woman wear a hijab out of choice !","commenter_a":"With a Hijaab. . ? 1st education they need. . Is to get out of hijaab slavery m8, , Pls convey this to them","post_message":"\"We want to inspire young girls to stand up for their rights.\""},{"comment_id":"10154532714726162","commenter_b":"England, and yes it is my city is run by the labour party","commenter_a":"Where's white live matter, oh wait their not black","post_message":"A father and his two sons have been charged with molesting three young girls in their home... @webpagelink"}]
