[{"comment_id":"10153232276610496","commenter_b":"Fire them, then keep your doors locked.................that is exactly why they do not need to be in this country.","commenter_a":"Not showing up for 3 days to work with no explanation...how is that part of religious freedom...that many accomodationa are not made for Christians...and if Christians prayed in front of Muslims at the same workplace, Muslims would say they were offended...kind of one sided thinking ...","post_message":"\"Prayer is the first priority to every Muslim. We can sustain without a job, but we cannot sustain without prayer.\""},{"comment_id":"10153846825321336","commenter_b":"We need him gone he don't give a damm about anything go home you muslim","commenter_a":"Obama is aiding and abetting the enemy. He is a traitor and should get what he deserves as such.","post_message":"“If you were waiting to hear a U.S. president say, 'I feel your pain' or…'it’s them or us,' that is not what you just heard.” – Bill Hemmer on President Barack Obama's speech on the Paris attacks @webpagelink"},{"comment_id":"963452387028567","commenter_b":"Judy.. that is a huge part of the problem with the US today.. Dumb parents raising dumber kids. She has NO id ... can not drive nor get married nor get any medical care. How Stupid is that? She gets sick .. just stick her in the dirt right? Great parenting.","commenter_a":"That's amazing. Her parents should be charged with abuse.","post_message":"Her parents never got her a birth certificate or social security number, never took her to a doctor or let her go to school, and now she has no way of proving to the government that she even exists."},{"comment_id":"1023824300991761","commenter_b":"Women's loos can be more festy","commenter_a":"My bathroom in my house is open to anyone who can flush. Unisex bathrooms would end this issue","post_message":"In case you missed it: Trans people need to use the restroom just like anyone else. Why do some people have to make such a big deal about it?"},{"comment_id":"10154430815494497","commenter_b":"Also ,,!,, cuz the onion","commenter_a":"Can't believe they would make him do this @username","post_message":"Astronaut Suspects NASA Using Him To Test Space's Effects On Fat People"},{"comment_id":"809439485771743","commenter_b":"no sh-- sherlock, and obummer is running circles around the media....idiots.","commenter_a":"Andrea you are so astute! That is more than obvious, with that clown Kerry doing the negotiating!","post_message":"We could've told you that, Andrea. #Iran"},{"comment_id":"1301129679938665","commenter_b":"Would it be ok if you calmed your titties and stopped being such a butthurt faggot?","commenter_a":"(Cough) tarnak farm friendly fire incident (cough)","post_message":"Sometimes it's not the enemy you need to worry about. ~Will"}]
