[{"comment_id":"10152957563376770","commenter_b":"she should have already been locked up!...","commenter_a":"She has helped fuel the fire instead of being unbiased like she is supposed to be.","post_message":"A veteran Baltimore prosecutor is blaming state's attorney Marilyn Mosby for contributing to dramatic spike in violent crime that has gripped the city in the aftermath of the Freddie Gray case."},{"comment_id":"605420972951190","commenter_b":"The god \"them\" illegals.","commenter_a":"No guys. its not the trillions of dollars we spent on Nukes, its the god them illegals taking our tax money. #MakeAmericaGreatAgain","post_message":"The B61-12 gravity bomb is smaller and more accurate than the nuclear weapons we have now, and that has some experts very worried. Watch VICE on HBO tonight at 11PM to learn more about the next nuclear arms race."},{"comment_id":"10153493306391636","commenter_b":"Kd Ray what Arabs have to do with this?","commenter_a":"And Michigan shooter who drove uber said the app told him to kill people, mental illness comes in different shapes, this lady is terribly ill, not because she's Muslim!","post_message":"Horrific"},{"comment_id":"10153720554479330","commenter_b":"Exactly Kathy!! Lets duct tape her mouth shut!!!","commenter_a":"Good!! Can we duct tape her mouth!?!? I don't care that she made a post after this one saying that she was trying to make a point and that the dog stopped barking, no excuses and the dog was probably scared that the human he trusted would do this again!! She needs to be held accountable for this!!","post_message":"UPDATE: Police in Florida plan to speak with the person behind this viral Facebook post. So many calls reporting it as animal abuse have flooded into police departments from Connecticut to Florida that they've had to call in extra workers. --> @webpagelink"},{"comment_id":"10153273987738984","commenter_b":"Does this F*CKTARD actually think I'll stop saying Thanksgiving? What a moron! Keep poking the bull bitch!!!","commenter_a":"Obama is a Fucking traitor and Muslim Asshole.","post_message":"Seriously Obama? What are you going to take away next? The NFL? Apple Pie?"},{"comment_id":"952261771573668","commenter_b":"You don't have to like Trump to have your PUSSY groped!","commenter_a":"I'm telling ya people, you dont have to like Trump personally but you all have to get out there to vote for him to stop this stuff. Its unreal. Its almost like we are living in 1960's Soviet Union.","post_message":"This makes me sick..."},{"comment_id":"1138008016249439","commenter_b":"Hillary is a corrupt liar","commenter_a":"Bernie is accepting the will of the majority of democrats, and throwing his support behind an amazing woman who will make an astounding President.","post_message":"Bernie Sanders and Hillary Clinton campaign in Portsmouth, NH. Full video here: @webpagelink"}]
