[{"comment_id":"1142990589094021","commenter_b":"ugly women","commenter_a":"what are you animals?.....in britian?......wth!","post_message":"'Still not asking for it'"},{"comment_id":"10153552343052452","commenter_b":"What a shitbag","commenter_a":"These people have no shame... very sad..","post_message":"An Alhambra homeowner caught a package thief in the act and recorded the woman as she tried to swipe two boxes from his porch. Police are now searching for the culprit. abc7.la/1Wt5Auf"},{"comment_id":"10154414222354087","commenter_b":"Get used to it. Welcome to Trump's America.","commenter_a":"So? We've been hearing that North Korea has nukes, is building nukes for years... Whatever... Their society and economy is so fragile a major earthquake would send them back to the dark ages...","post_message":"A top North Korean official who recently defected to South Korea says the country is racing to develop nuclear weapons \"at all costs\" by the end of 2017."},{"comment_id":"1209227002477386","commenter_b":"Dumb ass bitch","commenter_a":"I feel bad if they were black but if they're white I don't give a fuck because they never care bout us dying","post_message":"#WSHH #Iowa #Police #BreakingNews"},{"comment_id":"10154874885608796","commenter_b":"Drain the swamp!","commenter_a":"Yates used no integrity because she took an oath of office to obey the law. Same as Lynch did. Both should have been fired no just one of them.","post_message":"Former Attorney General Loretta Lynch praised now-fired acting Attorney General Sally Yates for her “unshakable integrity” in refusing to defend President Donald Trump’s executive order putting a pause on travel from terror-ridden countries."},{"comment_id":"697812187045401","commenter_b":"And the women who choose to cover their faces?","commenter_a":"Victory for the woman that are forced to cover their faces. Now they can feel the warmth of the sun, feel alive.","post_message":"Anyone caught will be fined about $541."},{"comment_id":"1147292828682585","commenter_b":"Go to Hell Bitch!","commenter_a":"Her earrings are real classy. Hah!","post_message":"The Black Lives Matter crowd gets crazier every single day. Now the woman who co-founded the group says that \"white folks\" need to make a special sacrifice to everyone else. You won't believe what whites are supposed to give up..."}]
