[{"comment_id":"480993755358552","commenter_b":"She must be from NYC she can go to hell","commenter_a":"Screw her","post_message":"This Democratic congresswoman from New York just announced her plan to reduce gun violence. I wonder how it will be received."},{"comment_id":"10152573528821717","commenter_b":"Greg Abbott in Texas! POS!","commenter_a":"He really is quite the Gov, is there a secret contest between him and Walker to who can screw a state more?","post_message":"Click here to follow LGBTQ Nation on Twitter: lgbtqn.at/tw"},{"comment_id":"10154192939617541","commenter_b":"Agree it's the dumbing down of America....","commenter_a":"He's such a child.. name calling , whining and bullying when he doesn't get his way. That behavior is definitely not what we should expect from our president!","post_message":"Trump says \"Pocahontas is now the face of\" the Democratic party."},{"comment_id":"579913498825579","commenter_b":"Why not ?","commenter_a":"I want to be a billionaire....you got a problem with that?","post_message":""},{"comment_id":"631712173663014","commenter_b":"Illegals should not have the right to vote.","commenter_a":"Trump is the answer our country needs at this point in time. I have a feeling that this election in November will bring record number of voters -- what I don't agree with is that illegals have the right to vote. That is why the Democrats are pushing this because otherwise they will lose. Voting should only be for US citizens. Looking forward to a better and greater America come January 2017. #Trump/Pence.","post_message":"Watch: This was the highest-scored moment of the entire 2016 Republican National Convention, and it happened during Donald J. Trump’s speech as he addressed the corruption surrounding Hillary Clinton. @webpagelink"},{"comment_id":"10153641179393132","commenter_b":"I agree. She's a scam artist. But other women don't think women do that apparently...","commenter_a":"This woman is a monster in female skin. Let me generalize by saying that she makes you all look bad.","post_message":"\"He thought he owned her.\""},{"comment_id":"10153779416811509","commenter_b":"I pledge allegiance to the flag of the United States of America......not the flag that fought against it #patriot","commenter_a":"People need education on the history of the flag and the different types of confederate flags. The black confederate flag is the bad one.","post_message":"Mississippi's House Speaker says his \"state's flag has become a point of offense that needs to be removed.\" The Confederate flag appears in the top-left corner. @webpagelink"}]
