[{"comment_id":"690670874378549","commenter_b":"God I know! All those gay people marrying will turn back straight! Let's hope this works!","commenter_a":"It will take years to undo all the harm that is being done now. We have laws that we should respect and stand by.","post_message":"Even though the Supreme Court made clear in United States v. Windsor that the federal government should defer to state \"choices about who may be married,\" the Obama Administration has disregarded state marriage laws enacted by democratically-elected legislatures to uphold traditional marriage. I support traditional marriage and we should reject attempts by the Obama Administration to force same-sex marriage on all 50 states. The State Marriage Defense Act helps safeguard the ability of states to preserve traditional marriage for their citizens."},{"comment_id":"1429289687105057","commenter_b":"I'm going to beat your ass why you do that to me sis lmao","commenter_a":"Omg sis imagine this! VVanesha Williams","post_message":"This is the incredible moment a mother gives birth to her baby son - in a groundbreaking delivery procedure."},{"comment_id":"521485418039751","commenter_b":"Caitlyn Jenner is a repudlicrat.","commenter_a":"Who wants a killer around them and yes HE killed someone","post_message":"'Transphobic'... Republican-hating... CONFUSION!!!"},{"comment_id":"10153605674442042","commenter_b":"They will just go somewhere else, maybe near you?","commenter_a":"I have lived in jersey city for 30years and i left six years ago....those buildings need to go...it housed alot of violent ppl....and drugs","post_message":"KABOOM! Watch the dramatic implosion of three 62-year-old Jersey City public housing buildings as the city makes room for pricier pads. READ MORE: @webpagelink"},{"comment_id":"10153720190262894","commenter_b":"She'll always be a ghetto bitch from Chicago","commenter_a":"Read this shit @username gold diggin bitch","post_message":"Wiz Khalifa and Amber Rose Finalize Their Divorce, Hit the Strip Club Together [Video]"},{"comment_id":"10152998005499753","commenter_b":"Woman you have no clue.","commenter_a":"I think this mom did the right thing with her son. She is a hero to me and I for one would have done the very same thing. This columnist is way off base here and I think she needs to shut it.","post_message":"Toya Graham smacked her son and dragged him away from the Baltimore riots. Now a columnist is ridiculing her and those who support her for the \"abuse.\" @webpagelink"},{"comment_id":"527065960815030","commenter_b":"Her loss Tim!","commenter_a":"May God bless Tim Tebow you don't need her keep the faith God has a special woman for you","post_message":"God Bless Tim Tebow"}]
