[{"comment_id":"850014095139630","commenter_b":"Those illegals and Refugees are everywhere,and plenty of them,obama has been busy letting them in the last 8 hills,hillary killed off soldiers[American] and wanted muslims in,guess she wanted to kill babies that was full term so they would not grow up for the usa,,what a mess,in the usa,why don;t they stop all of this junk? This is America?","commenter_a":"So I have posted this many times.... How many of our citizens have to die or be injured before these Far Left Dems understand and see the light! These illegals and Refugees are not good people......","post_message":"John Kasich opened up Ohio's borders to refugees and himself to a tidal wave of Twitter hate..."},{"comment_id":"674562089401036","commenter_b":"The asshole cant do it","commenter_a":"Yes because the jails are full of Muslims. And what other matters does he have more important. What an absolute joke a president sticks his nose in these matters. Time for the states to push back.","post_message":"Obama administration has decided that they are going to ban pork products. This is just getting ridiculous. They need to come back to reality. Do you think the Obama administration is out of control?"},{"comment_id":"10153464911441438","commenter_b":"And What was the point of that weak made up story? if a girl offers a blow job for a ride and decides not to give it, you're still not allowed to rape her. You can tell her to get the fuck out of your car, but no absolutely nothing in her behavior made her deserving of rape. Even if she got in the car ass naked.","commenter_a":"Sexual consent: latent sexism, in the flesh. Hey, bitches, I heard there is a drunk girl on the corner who doesn't want to walk home. Because she is an entitled whore, you taught her that it was ok because whatever she feels is more important than fact, she decides to solicit a random passerby in a car. \"I'll give you a blowjob for a ride,\" are her words. Yet, that interaction, with all of its attendant suggestions & latent sexism & the very fact that it would not have happened without HER initiative, is somehow NOT her responsibility. That's the latently sexist, bullshit truth of femifucktardism & all of you self raping bleeding gashes. 90% of the time, anyway. Protect me because I'm a whore with a bleeding gash and I have to have protection because of the biologically driven imperative, but don't hold me responsible for ANY of my ...","post_message":"Owen Labrie is guilty of sexual assault, but not rape. What?"},{"comment_id":"972471592821368","commenter_b":"Don't beleave this is west point?","commenter_a":"yes they are acting like beyonce,stupid","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"1194657977239103","commenter_b":"Yep theirs just as maney glacers now as their was then . But their smaller now then they were then. The Artic ice cap is smaler now then it was then and the Anartic is doing somthing with large chunks braking off.So I guess you all know more then the people that study the weather Maybe almost as much as you know about doing your job in stead of taking money to lie","commenter_a":"The whole global warming crap is a lie its away for rich people to gouge the world for more wealth","post_message":"This is going to upset a lot of people!"},{"comment_id":"918539948208123","commenter_b":"I say we hand this trifling hoe to ISIS","commenter_a":"Another oxygen water","post_message":"DISRESPECT for our military and nations heroes is out of control. This is straight up disgraceful! READ HERE---> @webpagelink/ HONOR CHRIS KYLE!"},{"comment_id":"10153282671259087","commenter_b":"@username We, obviously, are not idiots. Kinda shows with other comments. I have a fgreat idea, let's let all the illegals move in with you. Open your arms, and say welcome!!!!!","commenter_a":"Facts that can't be argued about Donald Trump. The man has been under attack since the day he announced. He has exposed how special interest groups, lobbyists and campaign donations corrupt our government admitting he himself has purchased favors. He has exposed media to be the bias self-serving thing they are. We've seen that he is right. Trump has told us what needs to happen to turn this country around. It's the cold hard truth. Trump has spent decades negotiating billion dollar deals with the toughest business minds on the planet and come out on top huge. Bankruptcy? Never has Trump gone bankrupt. He has over decades purchased failing businesses and used bankruptcy laws to restructure those and prevented those from failing. But 4 out of hundreds? Let's say 100. That is a 96% success rate. What experience does he have? He has dealt with politicians, world leaders and perfected ...","post_message":"“If anyone else was in Trump’s position they’d be viewed as the inevitable nominee,” said one former Reagan administration official who supports Donald J. Trump. “I have never seen a group of people so obtuse as to what is going on outside of Washington that they feel comfortable writing Trump off. They’re finally just now coming to the realization that he’s going to win.”"}]
