[{"comment_id":"10152817810411636","commenter_b":"Hmm yes thats the trouble with war..it creats unstable countries which then lets the door open to yet more evil!","commenter_a":"Don't forget he got rid of Saddam Hussain who was committing genocide to thousands of men women & children..on alnost a daily basis!","post_message":"Surprise, surprise"},{"comment_id":"10153181309551350","commenter_b":"Sebrina Butler cute comments here. Marcella McFadden","commenter_a":"Breast feed, breast feed! Just do it! It's best for the baby's immune system.","post_message":"What do you wish you'd known before you had your baby? Read the top responses so far and join our new TODAY Parenting Team, sponsored by Johnson's Baby, to share your advice. @webpagelink"},{"comment_id":"795518530581327","commenter_b":"There is definitely something wrong with this lady...","commenter_a":"Bully like Hily Holbrook from \"The Help\" except for the racism.","post_message":"I can't stop laughing.....at HER."},{"comment_id":"10153105313784203","commenter_b":"Speaking of Obama not attending a rally in France, how about Bush, Cheney, and other Conservatives not attending the 9/11 memorial in their own country @webpagelink","commenter_a":"Unlike the communists digging up Kathy Griffin and Margaret Cho, Jay is actually funny.","post_message":"Why the hell do Republicans love Jay Leno so much?"},{"comment_id":"10153108119036037","commenter_b":"We should have been more selective when your ancestors came over.","commenter_a":"Towels and curtains have a purpose in the USA curtains go on windows and towels go in closet.s neither go on our heads ... if you wanna live love and respect ur traditional values then go enjoy them In your country not cram them in the face of good hard working American s","post_message":"Police in North Carolina say they are still investigating possible motives for the killing of three Muslim college students, whose relatives are pressing for hate crime charges against the alleged shooter. Legal experts, however, say a hate crime case could be difficult to prove. @webpagelink"},{"comment_id":"2109805452578927","commenter_b":"Leave her alone!!","commenter_a":"Rosa","post_message":"World-renowned statistician Stevie Nicks declares a Hillary \"landslide.\" The mathematician also adds: \"Just like the white winged dove...Sings a song...Sounds like she's singing...Ooh ooh ooh.\""},{"comment_id":"392884667560081","commenter_b":"Bitch!","commenter_a":"He certainly does, and the GOP deserves a kick in the ass!","post_message":"President Obama deserves a HUGE thank you!"}]
