[{"comment_id":"10153068492709411","commenter_b":"Thank heavens...............one revolting misogynist pig gone, but alas another is replacing it.","commenter_a":"RIP","post_message":"BREAKING:"},{"comment_id":"945524792158383","commenter_b":"Kill all the white people, then they will only have each other to blame and kill. Brilliant!","commenter_a":"Idiots","post_message":"[Watch] New Black Panther Party Urging Blacks to Get Ready to Kill for a Black Nation"},{"comment_id":"10153185971496955","commenter_b":"shoot the illegals","commenter_a":"...and they wonder why we don't trust the police...!","post_message":"California Deputies Are Taped Beating Man in Bizarre Desert Horse Chase... 'Ugly'..."},{"comment_id":"10154335392498812","commenter_b":"learn the law because you look like an idiot. TRANSGENDER people can use the bathroom, not men like you and I. I cant just say oh I want to go pee in the ladies room. that isn't how it works. I have a friend who is transgender and her license now says female. she looks like a female. should she go into the mens room? the law is for people like that, not just people who decide today to go in the opposite sex bathroom.","commenter_a":"I won't be listening to them anymore!!! Transgender people are not the only ones with rights,,,if you're a man who wants to use the ladies room get a sex change ....Liberalism is ruining our country,,,,what was a constitutional republic is turning into a socialist hell hole","post_message":"Pearl Jam cancels North Carolina concert, calling HB2 law \"a despicable piece of legislation that encourages discrimination.\" @webpagelink"},{"comment_id":"10154071724086320","commenter_b":"she is an amazing woman with a wonderful gift of talent","commenter_a":"I loved it","post_message":"Watch and see why everyone was crying after Kelly Clarkson's emotional performance on last night's \"American Idol.\" @webpagelink"},{"comment_id":"876377039127570","commenter_b":"Hopefully the \"treatment\" is the same pain & suffering the little girls had to endure","commenter_a":"There is sex offender treatment in prison?","post_message":"Nicole Vaisey, 26, and her boyfriend, 40-year-old Stephen Howells, admitted that they kidnapped the two Amish girls."},{"comment_id":"1048961388493889","commenter_b":"@username and what do you mean by Americans pay for illegals not you I am an American last I checked","commenter_a":"I don't know what your being told but Obama has more people deported than any other president. ...I see it constantly in the Hispanic news channels","post_message":"CIS found that criminal prosecutions for immigration offenses have dropped 36% over the last five years and due to sanctuary cities policies, the detention of illegal aliens in jails is down by two-thirds."}]
