[{"comment_id":"10153373033325667","commenter_b":"I love boobs, now thats something worth fighting for!!","commenter_a":"With so many violent movies and video games around, no wonder real killings are becoming an 'accepted' part of society. Children can easily watch something in which a person is shot (often without flinching), but God forbid a woman breastfeeds her baby in public...","post_message":"No motive for the shooting was given and police said they were still looking for two gunmen."},{"comment_id":"10153619254387439","commenter_b":"You stupid son of a bitch. She will never do a day in jail. Dream on asshole.","commenter_a":"FBI didn't seize a fucking thing, they were voluntarily turned over to the FBI and justice department. Geller is a rotten crotched liar.","post_message":"// google_ad_client = \"ca-pub-@username\"; google_ad_slot = \"@username\"; google_ad_width = 336; google_ad_height = 280; // ]]> // // ]]> Hillary is such a tool for jihad and a knave to her lover pal Huma Abedin, I don t care how this destroyer gets her comeuppance, as long as she does. Like Capone and tax evasion charges. It was hardly the worst of what he did, but it got him put away. She should be sitting in prison for Benghazi, but if this is the best we can do, so be it. Although I hardly trust the DoJ. WASHINGTON As pressure builds on Hillary Clinton to explain her official use of personal email while serving as secretary of state, she faced new complications Tuesday. It was disclosed her top aides are being drawn into a burgeoning federal inquiry and that two emails on her private account have been classified as “Top Secret.” ..."},{"comment_id":"10153114280311037","commenter_b":"Obama called isis JV team and gave Iraq back to isis ... Soldiers died for nothing .. Iraq had nothing to do with 9-11","commenter_a":"Probably a bullet. Unfortunately","post_message":"Tomorrow, President Obama will host a summit on \"Countering Violent Extremism\" - focusing on the root causes of extremism and find ways to stop young people from joining terrorist groups. What do you think is the solution?"},{"comment_id":"10154094490463984","commenter_b":"Thanks to our neighbors to the north..it would appear they are much wiser than we are. If this racist carp is going to end, it must end on both sides. I truly believe there are far FAR more black racist than white in the USA today. I also do NOT believe the blacks want racism to stop, that as a whole have too much to lose.....","commenter_a":"Can we just get this racist woman off social network already! Tired of seeing and hearing about her!","post_message":"Fresh off her race-baiting Super Bowl 50 performance, Beyoncé was about to head up to a huge concert in Toronto. However, a Canadian official just hit the singer with BRUTAL bad news... She never saw this coming... she should have, though."},{"comment_id":"10152986560831336","commenter_b":"She belongs on SNL.....She is like a comic...! She is so stupid...!","commenter_a":"And just when you think you've send the bottom of stupid, you find there's even a lower level","post_message":"The key to defeating ISIS is... job opportunities?!"},{"comment_id":"10154662767663188","commenter_b":"Absolutely Michael! No Jake herrin Idiots like You are ruining this country!","commenter_a":"Sick of your BS Beck and I don't need your critique on any of this! He cleaned her clock and your whining butt just doesn't like it. If we lose this country it's because of idiots like you Beck!","post_message":"This was Donald Trumps best Performance in the debate. BUT remember the only goal is to ADD undecided voters. Charles Krauthammer just called Trumps performance Political Suicide. He is right. He was winning and then it began to break apart. They both have sealed their core long ago. Tonight was the last chance to bring the women that have been lost or questioning. Those Reagan democrats who worry about foreign policy, Russia or temperament. First 30 minutes were strong for him. He had some good lines and looked (at times) well informed. He had a great open borders section. While I cringed in the gun debate and abortion section. On the second Amendment Rubio, Cruz or almost any other candidate would have cleaned her clock when she spoke about 12 toddlers shooting people in DC. His pro choice response On partial birth abortion was the weakest I have ever heard. ..."},{"comment_id":"10153705260739218","commenter_b":"All Lives Mater...another life ended and another life over.","commenter_a":"Every man woman and child makes their own decisions in life...don't know the circumstances but he has to deal with the outcome..not his father...prAyers to both families","post_message":"The son of a Baltimore Police Department commander has been charged with murder, sources have confirmed to the 11 News I-Team on Tuesday >> @webpagelink"}]
