[{"comment_id":"10153816646376336","commenter_b":"They think that are comedians!:) seriously??? They are not funny at all! These women on the view are ugly and boring! I am still at a loss who watches this show?","commenter_a":"Let's don't get started about people's looks .","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."},{"comment_id":"891579364198188","commenter_b":"You're right. It just seems women are more selective.","commenter_a":"How about guys? It is not just all women!","post_message":"Well this is horrifying. (via The Huffington Post)"},{"comment_id":"1100039356678391","commenter_b":"Worthless; wait, that's an insult to worthless people......","commenter_a":"what an idiot the reason for this is all the race baiting he and Sharpton an d Holder and his other mouth pieces have preached and preached while they comdemn America.","post_message":"What happened in Ferguson, New York City? Doesn't matter where it is, it's the result of slavery. It is the result, lingering effects of slavery, Jim Crow."},{"comment_id":"1390094244343935","commenter_b":"I hope she does. Even easier for Trump to win","commenter_a":"No I don't. There are other qualified people.","post_message":"Want to see Elizabeth Warren on Hillary Clinton's White House ticket? It might not be so easy."},{"comment_id":"10153178962341833","commenter_b":"Oh and not to mention we wouldn't have lasted a day against the British without guns.","commenter_a":"People just don't get the fact that we are still a democracy after 240 years in part because we as a population have the constitutional right to be armed. Let's see how long we would have lasted otherwise.","post_message":"Thank you for helping us reach 4.2 Million LIKES on Facebook! Like and Share the news with your friends!"},{"comment_id":"471664429690804","commenter_b":"THERE IS NO PLACE IN AMERICA for SHARIAH LAW !!!, Not Now... NOT EVER.. IF those people want their own laws.. GO BACK where YOU came from... Never to Return !!!....Close our country to ALL Muslims, those who are here, send them packing back where they came from !!!","commenter_a":"OK Here we go again... we are going to let muslim religious practice in government owned facilities but not Christian or Jewish? No prayer or religious organizations (Christian Athletes Association, for example) allowed for anyone in public schools, but exceptions for muslims? They can have time for prayer and muslim student organizations in school, but we are not to have prayers at student events? Come on SCOTUS ... what the heck is going on? We now have separate rules for muslims? Unbelievable. If the muslim inmate can grow a beard then anyone should be able to do it. They are becoming a government sponsored and endorsed religion. They even provide prayer rugs and call to prayer at gitmo. The state shall establish no religion.","post_message":"The Supreme Court just made a shocking ruling on Shariah Law. We must voice ourselves publicly, Shariah Law has no place in America. Do you agree Shariah should be banned?"},{"comment_id":"1693513877603730","commenter_b":"This is silly. People may not like him me included but who Someone decides to vote for should be there choice and not pushed on them. That's exactly what this would do. I supposed you also felt bad for the Emory students that cried about some chalk?","commenter_a":"Futile","post_message":"#VoteTrumpGetDumped is encouraging women to dump Donald J. Trump supporters because of the way he treats women."}]
