[{"comment_id":"904059146360453","commenter_b":"She is earning her check! hahahahha WTF! I just can't with this crazy woman!","commenter_a":"Maybe she's trying to help Hilary??","post_message":"Donald J. Trump campaign manager Kellyanne Conway said she wished her candidate had more opportunities to debate and would \"be willing to do another one if somehow they can squeeze it in.\""},{"comment_id":"979572065469181","commenter_b":"They need to pay taxes!","commenter_a":"If you bunch of socialist morons would adopt the fair tax it would do away with this along with the burdensome irs but yall don't want real answers just partisan socialist big govt","post_message":"It's time for them to start paying their fair share."},{"comment_id":"10154390206939342","commenter_b":"Racism is at an all time high in this country and ignorant people have no shame when expressing their hate nor do they seem to understand that social media is the best place to go viral and get fired, keep em coming.","commenter_a":"This guy is a dirtbag and should be removed from office immediately.","post_message":"Parents want a school board member to be removed after a picture of him dressed in blackface hit social media."},{"comment_id":"633419350152037","commenter_b":"Bye, don't come back","commenter_a":"His gravy train parliamentary salary wasn't enough he must have found another income that was better for less hours","post_message":"What's next for David Cameron?"},{"comment_id":"912344515551025","commenter_b":"Illegals are taking jobs we Americans can't or won't take...","commenter_a":"Well I like Cruz...a lot. My husband and I both voted for him. He's a true conservative and defender of the constitution....","post_message":"Ted Cruz voiced his strong opposition to President Barack Obama's lax enforcement of our nation's immigration laws, arguing that his policies have led America down a path of economic turmoil. @webpagelink"},{"comment_id":"10153278538947293","commenter_b":"Mark no I meant auto, you just need a permit which is easy to get in Oregon","commenter_a":"For most of you who have never heard of Roseburg and are assuming that ucc and \"Umpqua\" are gun free areas...1: You are ignorant.. 2: Umpqua isn't a city it's a forrest that spans way farther than Roseburg and 3: Off the top of my head, I can think of at least 10 public places (that are NOT shooting ranges) in a 5 mile radius of ucc that people normally goto to discharge their automatic weapons.","post_message":"A U.S. official has identified the gunman in the Oregon community college mass shooting as Chris Harper Mercer."},{"comment_id":"588976734614882","commenter_b":"She couldn't sexually satisfy ol slick willy either","commenter_a":"Don't want her in the War Room...Remember Benghazi!!!","post_message":"Ahead of President Obama's speech to the Democratic National Convention tonight, The White House released excerpts touting Hillary Clinton's experience."}]
