[{"comment_id":"1277480212306141","commenter_b":"Yeah, she's a racist.","commenter_a":"STOp THE HAte","post_message":"CLAREMONT COLLEGES “Students Of Color” REFUSE To Live With Whites: “I don’t want to live with any white folks”…”Don’t see how this is racist at all”"},{"comment_id":"759924327531478","commenter_b":"Just showing up is prolblem for me. Trash that is all she is","commenter_a":"Yes","post_message":"You Won't Believe What Hillary Clinton Was Caught Doing During Nancy Reagan's Funeral This is really does speak volumes to what kind of person she really is. Do you think Hillary Clinton would make a terrible president?"},{"comment_id":"970626379645816","commenter_b":"#Ansab go back to your history, that land is promised land to Israel by God. Israel made mistake coz God told them to kill anybody who will be in that land but due to kindness of Israelites now they are suffering with these Palestians cursed tribe. Land of Canan belongs to Israel coz is promised land","commenter_a":"Palestinians they deserve to be killed by Israel because of their provocation. No mercy to Palestinian death","post_message":"More than 60,000 people in the UK have so far signed the petition calling for Israeli Prime Minister Benjamin Netanyahu to be arrested for war crimes against Palestinians when he pays an official visit to Britain next month. Read here: @webpagelink"},{"comment_id":"10154176527056770","commenter_b":"Shut up and crawl back in your hole.","commenter_a":"He's a creep for saying that!","post_message":"'Avengers' director Joss Whedon made a lot of outlandish comments on Ivanka Trump and Jared Kushner."},{"comment_id":"1628105883873422","commenter_b":"And your a bitch DANI KAYE","commenter_a":"Sandy if you like him so much. Why don't you just go and live with him at the white house.","post_message":"Tomorrow, we will leave behind a president who has carried himself with quiet dignity for eight years and replace him with a man who is neither quiet nor dignified."},{"comment_id":"1642472956011827","commenter_b":"Hillary Clinton is against Christ and she is for anything illegal immigrants bring her money. .","commenter_a":"What would you have us call them, Hillary? They are in our country illegal,,,duh.","post_message":"Hillary Clinton says the term \"illegal immigrant\" is offensive and shouldn't be used. Is she right, or is this political correctness gone too far?"},{"comment_id":"720191621435846","commenter_b":"Peaceful muslims?? What in the hail is that??? They all believe the same! You and all the misguided people who liked your post get to be first in line for beheading!!! Dear lord do some actual research! There is no such thing as a \" peaceful Muslim\"!!!","commenter_a":"If it's true , hats off to them . We have been wanting \" peaceful \" Muslims to stand up to the \"radicals \" , maybe this is a start ????","post_message":""}]
