[{"comment_id":"10154400322244657","commenter_b":"In your illegal immigration poll Robert? Legal, voting hispanics want them gone.","commenter_a":"It doesn't matter. Now that the GOP candidates are in a pissing contest to see who can be the most xenophobic and racist while restarting the war on women, no Republican candidate has a a shot in 2016","post_message":"Does anyone have enough momentum to unseat Donald J. Trump? See which candidate rose and fell in the new Townhall.com / Hot Air poll:"},{"comment_id":"10154283345199032","commenter_b":"No: Get out of the U.S. or shut up!","commenter_a":"Who cares? Really?","post_message":"Among the popular vote, Clinton has a strong lead."},{"comment_id":"10153534266495399","commenter_b":"We don't need him and take little Mexico with you","commenter_a":"And he's supposed to be the \"smart\" one?","post_message":"Asked to clarify, Jeb said, \"Things happen all the time. Things. Is that better?\""},{"comment_id":"10154351189226051","commenter_b":"Lmao nope 😅","commenter_a":"Christine you didn't get this one did you! 😂","post_message":"When these parents took the doll out of the box, they were surprised at what they saw. Take a look for yourself and see if it's worthy of the controversy."},{"comment_id":"1766049700310185","commenter_b":"She better look deeply into Muslim beliefs and get used to sexual assaults because these heathens think it's their right","commenter_a":"The White House is warning Trump not to retaliate against her. Is that a red line? They going to write a mean letter to him if he does?","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."},{"comment_id":"10154446560569087","commenter_b":"....and you prefer a sexual deviant,foul mouthed fraud who could phucking care less about the working men and woman...this phucking billionaire builds multi million dollar condos and private country clubs that only the very rich could afford....so keep drinking the lumps poison koolaid and watch as America slides into hell...","commenter_a":"What the fuck did you and Obama show us in the last 8 years, other than treason, socialism, and the lack of and balls what so ever.","post_message":"Vice President Biden responds to Trump's tweets: \"Grow up, Donald, grow up. It's time to be an adult.\""},{"comment_id":"10153585908813984","commenter_b":"See it turning into a Muslim state.lets wipe out all history.","commenter_a":"This is the stupidest bluff I have ever heard! Deny the NAACP and all they can do is hurt themselves. What's next? B.E.T. threatening to go off the air?","post_message":"The NAACP just made a stunning demand about this historical monument... this is shocking move. Nobody thought they would go this far... What do you think about the NAACP's demand?"}]
