[{"comment_id":"221003188363637","commenter_b":"@username And worse!!!! No wonder she needs to shop!","commenter_a":"Wait wait wait...I thought Trump's doctor told us that if elected, Trump would be the fittest, healthiest man to ever serve as President! You mean I was lied to about Trump???","post_message":"TELL US IN THE COMMENTS!"},{"comment_id":"10154991489419726","commenter_b":"Oh please! Maybe she'll move to Syria and we'll never hear from her again!","commenter_a":"loser.","post_message":"Her Instagram has us thinking she might..."},{"comment_id":"1728765537410558","commenter_b":"She's a Bitch!","commenter_a":"vanstone is an idiot","post_message":"Oh no... I'm praying for Bindi Irwin."},{"comment_id":"1569991603060963","commenter_b":"Oprah is a piece of shit.","commenter_a":"Ignorant celebrity","post_message":"It's all about the win for 'your side'."},{"comment_id":"10153306477369586","commenter_b":"Bunch of dumb asses.","commenter_a":"this is sick","post_message":"Yes, those are real dead cats. :( Oklahoma high school students posted this disturbing video on Facebook. Wait until you see how the teacher was involved. HELP STOP THIS: @webpagelink"},{"comment_id":"10154627182156509","commenter_b":"287877634908162s, as a native (Blackfoot) I encourage you to stay out of 'our' business. Immigrant......","commenter_a":"Does @username cares even a bit about Sanders? All this channel talks about is Donald Trump.","post_message":"This is the decade when Donald J. Trump thinks America was great."},{"comment_id":"1178194115526177","commenter_b":"That's her idea of building America?","commenter_a":"Hillary supports blm and black panthers in that they say kill all whites and cops. And riots, looters, arsonists, and cop haters are all ok with Hillary.","post_message":"It's being called \"a monumentally stupid comment,\" and that's among the remarks we can print. You simply won't believe how Bernie Sanders is \"feeling the Bern\" from his own fans after saying white people don't know this one thing"}]
