[{"comment_id":"10154805040466037","commenter_b":"WTF!!!!! You're the hypocrite. Vote for Hillary a baby killer","commenter_a":"Dumb heartless trump, there are civilians....women and children in Mosul. They need to get out before attacking the place. Hmmmm there's something called \"war crime\" if u attack recklessly as ur suggesting innocent lives will be lost... It funny how u don't support necessary abortion to save a mother's life but ur happy to kill many innocent civilians... Trump = fool bigly","post_message":"“We gave them months of notice. U.S. is looking so dumb. VOTE TRUMP and WIN AGAIN!”"},{"comment_id":"10150791998559999","commenter_b":"They are thieves!","commenter_a":"The cable industry as a whole is pretty much a monopoly. #Comcast","post_message":"In an unusual step, President Obama singled out cable set-top boxes as an outdated symbol of corporate power over consumers."},{"comment_id":"10154141594486509","commenter_b":"I can't stand Sanders grating voice and Hillary puts me to sleep O'Malley's obnoxious Thank God NCIS is on at 8.","commenter_a":"I wonder if @username will ambush Clinton, like FOX ambushed Trump.","post_message":"Classroom lecture vs. rock concert: Just how different are Bernie Sanders and Hillary Clinton campaign styles? #DemDebate @webpagelink"},{"comment_id":"975974852420526","commenter_b":"You would lie like that? You and Warren deserve each other!","commenter_a":"We really DO need to declare the GOP a terrorist organization!","post_message":"From today's #MorningReads: GOP Front-Group Targets Warren's Legacy; \"Jihad John\" IDed; and Inside the GOP's Campaign to Defang Federal Gun Laws."},{"comment_id":"457639131093334","commenter_b":"Fuck her","commenter_a":"She doesn't even have the power to shut down a lemonade stand.","post_message":"Will You Cave To Michelle And Only Eat Where She Wants? Comment 'yes' or 'no'."},{"comment_id":"10152878720003645","commenter_b":"Great american baboons","commenter_a":"There is something inherently wrong in the black community to promote this type of group violence. But then will cry racism at a drop of a hat...it is these very images that create the negative image of blacks. We are our own worst enemies not the \"white man\"...","post_message":" tenacity of placing something on video to shoot a young lady being beat down by six or seven young women is ludicrous in our community."},{"comment_id":"10154592575994062","commenter_b":"Hang these neggos today !!!","commenter_a":"They don't even care that they took someone life, so no one should care when they are giving them the chair","post_message":"TODAY: 4 accused of robbing a Houston restaurant and killing a man are scheduled to appear in court."}]
