[{"comment_id":"964264026942026","commenter_b":"I luv u tooo bitch","commenter_a":"That is fucked Up... But so entertaining...","post_message":"Details → @webpagelink Police The Police (Y)"},{"comment_id":"1562788604027088","commenter_b":"Time to block all idiots. Bye @username.","commenter_a":"Ohh come on!! You cannot compare between them!!seriously!!! REAGAN!!!! And you want to know why? Because he was for \"We the people\"!! Hand down!!! Climton signed NAFTA.... Huge disaster for our country!!! And please do not get me started on Hillary!!!","post_message":"Who was the better president: Ronald Reagan or Bill Clinton?"},{"comment_id":"1139906406032404","commenter_b":"you are an idiot!! AND STOP KILLING ANIMALS!! They have souls too you creep!!","commenter_a":"Ok. So release the previous 5 years. That will provide an accurate picture of what to expect when the audited returns are ready for release.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"10152947380749099","commenter_b":"Yes, because women never get pregnant on birth control....","commenter_a":"If women would practice birth control then these horrible things wouldn't happen. Bless their little souls. May God have them in his embrace.","post_message":"A man found two dead fetuses wrapped in a blanket on the street @webpagelink"},{"comment_id":"1083798354993969","commenter_b":"You're an ignorant cunt Rosie","commenter_a":"Sell yall anything and then yall prounce on it. He ain't sided with humility that's his only thing he can do to them white bois. As a black police officer he can't beatem, rough them up, shootem, killem like they do \"somebody's\" people. That's for sure a death sentence then.","post_message":"When a KKK member suffered a heat stroke at the hate rally in Columbia, a black police officer put aside his personal feelings and sided with humanity."},{"comment_id":"692872167570028","commenter_b":"It's NOT A WOMAN!!","commenter_a":"Moron nuts ops HeShe got balls . Sick , sick , sick . Woman of the year ? Bull crap ,disgusting , insulting to all women in the world . Hmmmmm maybe he should be castrated then but he will still be the same , a mangoman hehehe .","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"10154128932095579","commenter_b":"Domestic terrorists! Red neck spoiled Yahoo's, not patriots by any means.","commenter_a":"When I think of \"Terrorists\" I think of malicious intent to do harm\". When I think of \"Domestic Terrorists\" I think of the same, but the suspect/aggressor is from within. A \"rotten apple in the barrel\", if you will. When I think of patriots fighting for principles as defined by the Constitution, I think of statements like the ones that these people are making in Burns. I'm not saying that what is going on here is right, warranted, and just, but I am saying that (if their story is true) then we absolutely need be paying attention and asking 'why would the Fed Gov need to use strong arm, mafioso tactics to squeeze/coerce people of of their own lands'', and why are we allowing them to get away with it'? Take a close look at the mission statements of the Sierra club, Agenda 21, etc. Then go look your grand ...","post_message":"Rep. Greg Walden (R-OR) spoke on the House floor for over 24 minutes on the armed standoff in Oregon. Here is the closing 5 minutes of his remarks. Watch the complete video of his remarks here: @webpagelink"}]
