[{"comment_id":"10154303006941636","commenter_b":"Ted I'm pretty sure that the home grown rapist far out weighs the immigrant/refugee rapist...all you people blaming all crime on immigrants and refugees must have been living in lala land cos I can't speak for Sweden but all of those crimes were in the U.K. Way before this flood of people hit britains shores","commenter_a":"Nothing to do with wanting their sovereignty back and not being dictated to by unelected EU bureaucrats? Good grief, this page is a shocker!","post_message":"According to a new study"},{"comment_id":"1252586078101378","commenter_b":"close the borders is THAT step you @$$hole","commenter_a":"Yeah he may need to stop staging them, its transparent that since hes been in office we have had the highest amoumt of mass shootings ever, and seems it happens around the time he wants to push for more gun control. Is it me or am i going nuts.","post_message":"Knowing nothing about the causes of the #SanBernardinoShooting, Obama issues his mindless chant for more gun control. cnn.it/1Xzyg5u"},{"comment_id":"10153874605884270","commenter_b":"Jagdeep Singh Jagge sir, you need to study english literature. Also, Japan is/would be a US ally over China. You can not live in the past. Basing a country's actions on what happened nearly 100 years ago now is folly. The world and possible battlefield is ever changing.","commenter_a":"Japan technology is far ahead thn china, just they don't showof or not interested in military anymore after world war2(japan use less than 1% of his gfp for military).","post_message":"There has been a dramatic increase in sorties for the Japanese in the past year."},{"comment_id":"10154451087971756","commenter_b":"@username That's exactly the kind of response I would expect from a feminist... You don't want to do any of the heavy lifting. There's no reciprocation on the part of feminists because they only care about themselves. Even if I did respond how you wanted, you wouldn't address any of my points and simply make ad hominem attacks. That's all you people are capable of because you have no critical thinking skills.","commenter_a":"To the men commenting on this post that are shaming other men for being feminists: shame on you. You are just proving the very reason why we, as males, have much to benefit from feminism as well","post_message":"The male activists all face roadblocks. Other men might think it's strange for guys to talk about sexual health in public. Women sometimes resent the idea of men offering them information about their bodies."},{"comment_id":"483898831770072","commenter_b":"@username Whoa, calm down woman.","commenter_a":"They could just import it from Iran. I wonder what's stopping that great deal?","post_message":"Italian caviar, that is."},{"comment_id":"10153994674826051","commenter_b":"What a sick woman!","commenter_a":"I'm disgusted at the thought of such a thing. I hope they sue.","post_message":"This 8-year-old came home from school distraught. His dad asked him what was wrong. The boy explained that the teacher had forced him to stick his head into a bucket. Dad asked: \"What was inside the bucket?\" When his son told him, he snapped."},{"comment_id":"10154587626459411","commenter_b":"holding a sign for 20 minutes ,","commenter_a":"Mishelle obama cares for them, #bring back our girls :D","post_message":"'No one cares for us'"}]
