[{"comment_id":"10153216503482507","commenter_b":"I guess the gloves are coming off, the fourth reich is just about ready to emerge. When is that wall to Mexico scheduled?","commenter_a":"Evil","post_message":"Wow. Just wow."},{"comment_id":"1043659032366340","commenter_b":"Yeah yeah @username, it's airheads like yourself what Trump needs to screw up everything in your country. I will build that wall so that people like you can't come into Mexico","commenter_a":"Look at what Mr. Trump is doing to America as a candidate, dividing it, making everybody fight betweeen each others. Imagine what he would do as president...","post_message":"People could be heard screaming, and Donald J. Trump ducked his head, grabbing his podium with both hands before backing away."},{"comment_id":"683458785174693","commenter_b":"No Whoopie it's the exact OPPOSITE!!!! We did our homework on Corrupt Lying Criminal Killary Clinton and her open border policies and that's exactly why we voted TRUMP!!! Dumbass Racist!","commenter_a":"You didn't do yours.","post_message":"Whoopi Goldberg just scolded millions of Americans on The View. Apparently if you voted for Trump, it's because you \"didn't do your homework\" on Hillary."},{"comment_id":"1379882718715731","commenter_b":"Illiterate angry white trash lady. #sad","commenter_a":"They lost the election because they rigged their nomination and backed the wrong candidate","post_message":"TheBlaze's Dana Loesch explains why Democrats lost the election at the Conservative Political Action Conference (CPAC) 2017. See more Dana @ theblaze.com/dana-loesch"},{"comment_id":"10152670445845927","commenter_b":"Give that money to the Border Patrol, and arm them to convince aids-ridden latinos to stay on their side of the fence !","commenter_a":"Sick! No matter how sinful humans try to avoid the consequences of this horrible sin, God's word (Romans 1:26,27) assures that they will receive in their bodies the automatic payment for their wrong. God doesn't lie and He never fails.","post_message":"The study is to find the best ways to convince gay Latino men to wear condoms and get tested for HIV."},{"comment_id":"10153512388783812","commenter_b":"She is not dark skinned!!! I sorry she is screwed up!","commenter_a":"Love her tan. What's her secret? Lol","post_message":"A timeline of Rachel Dolezal's transition from a young white girl with blond hair to a darker-skinned leader in the country’s oldest civil rights organization: @webpagelink"},{"comment_id":"10153620225172377","commenter_b":"She is actually a feminazi and against our Second Amendment!","commenter_a":"Why would it be political, she's a republican hack. And is it remotely possible that he could be a sexual harasser.","post_message":"Newsmax CEO Christopher Ruddy says former Fox News host Gretchen Carlson lawsuit alleging Roger Ailes, the influential network chairman, sexually harassed her, simply doesn’t seem right. Ruddy writes: \"Interesting all of this is percolating in the middle of the most important election in modern times. I am not saying the allegations have a political angle. But the timing seems suspicious.\""}]
