[{"comment_id":"10153729476553433","commenter_b":"Why oh why does she lie so?","commenter_a":"Both parties are dead, the American Political System is dead. We need a complite overall. Let's start by Bernie and go from there!!! Two things need to happen A major bring out the vote campaing.....Bernie need to win by a landslide If that is not enough we need to come out into the streets by the millions and demand justice....even the day of the convention.....send a clear message that we are not going to take it anymore!!! THE AMERICAN PEOPLE ARE READY FOR A REVOLUTION TOGETHER WE WILL WIN BERNIE SANDERS 2016 President for ALL People The only choice #Bernie 2016 #FeelTheBern #WeWillWin","post_message":"Carly Fiorina said Gens. Petraeus, McChrystal, Mattis, Keane, Flynn all \"retired early because they told President Obama things that he didn’t want to hear.\" Well, Gen. John Keane retired in 2003, for starters. @webpagelink"},{"comment_id":"870513306380610","commenter_b":"Seriously?!?!?!?","commenter_a":"So the hackers can have even more access to our personal information? Great.","post_message":"The Postal Service is testing a \"notification\" service that emails you photos of the envelopes of your mail."},{"comment_id":"10153086528067061","commenter_b":"Ban idiots. Not guns","commenter_a":"\"Guns aren't the problem - people are\"..nope, stupid freaking people being allowed to get guns seems to be the problem...and it needs to be addressed and remedied. People suck more every dang day","post_message":"DEVELOPING: TV station says reporter and photographer dead after gunman opens fire during live report in Virginia. What we know so far: @webpagelink"},{"comment_id":"10153118428724641","commenter_b":"Those blood sucker should come to Malaysia to joining in our corrupt club here without fear... They really stupid because Malaysia only protect the corrupt rich...","commenter_a":"Must be getting ready for something if they want more people back to their country.","post_message":"150 corrupt Chinese officials may be hiding in the U.S. And China wants them back cnnmon.ie/1M6Of5q"},{"comment_id":"10153939182654060","commenter_b":"There are no women in a yakuza clan.","commenter_a":"Curiously -- nothing is said about females role in the family🔮","post_message":"In 2011 a Belgian photographer was allowed entry into one of Japan’s Yakuza families. Over two years, he captured the lives of those living in the underworld"},{"comment_id":"10154529341826178","commenter_b":"This may be fun! Hillary won't be debating a politician! I see a house falling on her and watching her toes curl!","commenter_a":"Illegals and dead people voting","post_message":"Mika seems so sure of this...#RNCINCLE"},{"comment_id":"10153658403039726","commenter_b":"OK !! There are 42,000,000 illegals in this country, squatting out \"anchor babies\" like cockroaches---WHAT\"S HIS PLAN.","commenter_a":"Carsons' stand on illegal aliens is almost as bad as obamas. Vote what's best for America---Trump.","post_message":"WATCH: Carson Jokes: I Heard Trump Dropped Out!"}]
