[{"comment_id":"10154376449396636","commenter_b":"Sorry but the open door immigration you referred to doesnt apply to North Africans. No African countries are in the EU.","commenter_a":"I don't think the opinions of someone who has ruined an entire continent with her open door immigration policy are worth listening to....","post_message":"Strong words"},{"comment_id":"1365633703532878","commenter_b":"@username...Such a joke!!! Hillary should just accept it...it's over...Trump won!!!","commenter_a":"“Anyone not willing to accept the results of an election is a danger to democracy.” - Hillary Clinton","post_message":"As Wisconsin prepares for a recount..."},{"comment_id":"10153071085836051","commenter_b":"Kill that bitch!!!!","commenter_a":"Hell hath no fury, right? Sick, sick, sick.","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"10153061482070326","commenter_b":"I don't care who the media whores are in love with or paid to pretend they are in love with. If people would just vote for who they really want to win, we would beat them. Stop listening to the media tell you no one can beat Hillary.","commenter_a":"Thats because the media no longer represents the people. They want to talk about emails, when most of us are worried about just making it. I wouldn't sit down with you either.","post_message":"This is what Hillary Clinton does NOT do with the media."},{"comment_id":"888390488018194","commenter_b":"Feminazi bitches","commenter_a":"This program has got to go...what is Disney thinking...stopped watching it long ago....they have become left extremists...they are just like the long time politicians...our view is the one that you people should be thinking...totally out of touch with common people...don't these so called stars get it...we don't care what you think","post_message":"Let's help them pack their bags. Do you want The View gone?"},{"comment_id":"10155209654718974","commenter_b":"Donald J. Trump 3 mins Statement Regarding Recent Executive Order Concerning Extreme Vetting is a proud nation of immigrants and we will continue to show compassion to those fleeing oppression, but we will do so while protecting our own citizens and border. America has always been the land of the free and home of the brave. We will keep it free and keep it safe, as the media knows, but refuses to say. My policy is similar to what President Obama did in 2011 when he banned visas for refugees from Iraq for six months. The seven countries named in the Executive Order are the same countries previously identified by the Obama administration as sources of terror. To be clear, this is not a Muslim ban, as the media is falsely reporting. This is not about religion - this is about terror and keeping our country safe. There are over ...","commenter_a":"Stay strong","post_message":"We're at Portland International Airport for the second day of the #nobanpdx protest against Donald Trump's executive order on immigration."},{"comment_id":"10152843821379440","commenter_b":"And what teams did you watch in the playoffs","commenter_a":"peyton manning and the broncos superbowl 50 champions :)","post_message":"Peyton Manning and Denver Broncos are working on revising his contract, which could explain why there's been a perceived delay in him formally announcing his intention to return in 2015. dpo.st/1LJlYy4"}]
