[{"comment_id":"10154295592708132","commenter_b":"A woman's ribs shouldn't show like that. That is not a healthy body.","commenter_a":"I think she looks great - no doubt about that but remember she has access to so may resources such as chefs, nutritionist, top motivating trainers, laser tightening, etc. Not to mention there is definitely not a daily 9-5 job in her day and don't forget adding in a few nannies to help out as well. All of these resources help alleviate stress and carve out time for you to focus on yourself. All that alone is a great cocktail for motivation.","post_message":"Spring has sprung for Britney Spears!"},{"comment_id":"10154147763835329","commenter_b":"She wouldn't understand","commenter_a":"@username do it to Sydney","post_message":"how to know your sibling is on drugs"},{"comment_id":"10153123341393433","commenter_b":"If the GOP and Faux news had been fighting the ACA every step of the way it would have probably met expectations. I have a neighbor that continually puts Obamacare down but when questioned on specifics she doesn't know anything about it.","commenter_a":"Survivor - Republican Nomination Edition! See the candidates squirm at questions about evolution! See them deny climate change! See them lambast Obama and try desperately not to even mildly criticize each other! See them try to criticize Jeb Bush while lusting after his millions! See them scurry and grovel for billionaire dollars! See them coordinate-not-coordinate with their PAC's! Watch as they kiss the ring of Sheldon and the behinds of the Koch's! See them on their knees begging and groveling for your vote! See them slap each other silly in the final rounds! See them bow out, tails between their legs, defiantly trying to sound manly and tough! See them in the green room, crying and sobbing and wailing... Oh wait, that's when they're on stage. See them try and start a war with Iran! See them argue about who gives Bibi the best blowjob! See them trying to be ...","post_message":"Did the health care law kill jobs? Does everyone have access to coverage? Monday marks the fifth anniversary of Obamacare, so here's a look at the predictions that were right and that ones that missed their mark. bit.ly/1HbvOsO"},{"comment_id":"10154075378206336","commenter_b":"@username that's not the law u ding bat.For years the law has been if Cubans can make it here they can stay. They were running to get away from the tyrant and then Castro when he took over. They do not run a cross our boarders. They come by boat through Florida. So as soon as Cubans arrive they are legal","commenter_a":"What an absolute Jerk. The Republican Obama. Clown Prince Trump.","post_message":"Donald J. Trump said he didn’t know if Marco Rubio was eligible to run for president and that “the lawyers have to determine that.”"},{"comment_id":"10152955356009071","commenter_b":"I know I said LMAO, but really hit me up... could use the help. ;-)","commenter_a":"Dear anyone... please contact me if you're up for some pro bono work to sharpen your skills! Lmao!","post_message":"It's a known fact that hacking makes money. But how much money?"},{"comment_id":"10153465147033812","commenter_b":"Don't worry about turning white in the White House, your dumbass isn't even gonna make it in there you dumb twit!","commenter_a":"No your a has been go home","post_message":""},{"comment_id":"10153526773721350","commenter_b":"Those hips are MALE hips!","commenter_a":"She look so stunning & beautiful tonight","post_message":"Caitlyn Jenner shared some very powerful words from the podium."}]
