[{"comment_id":"10154527914443690","commenter_b":"Wolves under the goat skins are those who invaded their countries; not them; refugees!","commenter_a":"They are terrorist not refugees, two years from now their host community will be destroy....","post_message":"\"Failure to address serious abuses appears to be a deliberate policy to deter further asylum seekers from arriving in the country by boat.\""},{"comment_id":"1036339909720353","commenter_b":"Skye Waters Maite Roman","commenter_a":"You guys just love to look down your noses at others. Yes, it is an incorrect viewpoint, but ridicule is for idiots and children.","post_message":""},{"comment_id":"616683421873704","commenter_b":"I do too, Hillary won that election! They stole it and tainted our votes.","commenter_a":"Not my President impeach impeach impeach","post_message":"Share if you do too! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"517019608487085","commenter_b":"Hell no, they can NOT stay! They are all guilty of a criminal offence. They are here ILLEGALLY, you dumb...","commenter_a":"The only path they should get is the road to the border where they would be deported.","post_message":"\"For the 11 and a half million who are here illegally, if they've not committed a crime since they've been here, I would give them a path to legalization.\" Today on \"Fox News Sunday,\" John Kasich discussed immigration."},{"comment_id":"10154467163611051","commenter_b":"Madonna this is a women who invaded her on body with a cross,scum is all i can say ,yes she should be in jail","commenter_a":"trump does not have moral privilege to call anyone an ugly name, since he owns every ugly name one can muster to describe his repugnant behavior. Madonna does not come close to the names lying trump has called President Obama. Madonna \"tells it like it is\" and that is too much for Right wing nut bags.","post_message":"Donald Trump says he has only one word to describe Madonna."},{"comment_id":"10153197426077377","commenter_b":"I like you Ted but I want the migrants to assimilate into the US and the simple fact is the migrants from Mexico and Central and South America do that very well... we are them and they are us... get string borders but work out something so those that are hardworking people who make our country a better place can stay.","commenter_a":"Canada Cruz is an Amnesty supporter.","post_message":"Ted Cruz — \"I think Jeb Bush has been very honest, he's been very candid about his support for amnesty.\""},{"comment_id":"10154392654096509","commenter_b":"Hotel California!!!!","commenter_a":"my prayers ...rest in peace","post_message":"Glenn Frey played guitar and keyboard and took lead vocal duties for the Eagles on tunes like \"Take it Easy\" and \"Tequila Sunrise.\" What's your favorite song from the band?"}]
