[{"comment_id":"605117769694222","commenter_b":"WE DONT BUY IVORY PERIOD!!! WE NEED TO BOYCOTT CHINA ESPECIALLY AND DONT EVEN BUY DOLLAR STORE THINGS THAT ARE MADE IN CHINA!!! IVE BEEN TO HONGKONG AND TAIWAN IN 87. SAW MEGA IVORY BACK THEN👿💔👹 FOR SALE! NOTHING HAS CHANGED! CHINA HAS NO PUNISHMENT! AFRICAN COUNTRIES NO TRADE PUNISHMENT! EVENTUALLY THE COUNTRIES IN AFRICA WILL STARVE OUT IF WE BOYCOTT TOURISM!!!","commenter_a":"Every country involved in the purchase of animal products from Africa as well as gaming in Africa are the reason why we have this problem. It's not only Africa's problem this is a world wide issue. Next time you hear a piano play or go to the pub to play some billiards question what they are made of. Ivory poaching legally ended in 1989, but the demand will always be there and countries like China and Japan will always buy their way through these bans as long as we keep buying tacky souvenirs from Asia containing Ivory. Education is the key, we have to take an interest and ask what is the item I'm about to purchase made from? This is what we can do to reduce the demand of items made from threatened species.","post_message":"Poachers, beware. These dogs are coming for you from the air. @webpagelink"},{"comment_id":"965004330186413","commenter_b":"@username you are indeed a stupid bitch.","commenter_a":"Yes letting out a shit ton of animals out into an environment where they will overpopulate and have to be hunted anyway. Great job fanatics. I'm not at all pro fur, but true activists don't do those things.","post_message":"Seen 'em?"},{"comment_id":"1028722620528934","commenter_b":"Much better than the lying Hillary or senile Bernie!","commenter_a":"And the other morons will vote for Trump.","post_message":"Americas Freedom Fighters"},{"comment_id":"10154042161636910","commenter_b":"USA Vets, homeless, the disabled! All of our own meaning legal USA citizens need to be taken care of FIRST. That's what we pay into. Get rid of who is faking it also.","commenter_a":"9th Circuit Court of Appeals issued a decision backing an earlier decision by a federal district court judge in Washington State that put President Trump national security Executive order affecting seven countries that harbor terrorists on hold. Activist Judges intruded into areas reserved by the Constitution powers which unambiguously gives constitutional powers to the President. That is why the 9th Circuit ruling is so fundamentally wrong by assuming the power of the President. It is the 9th Circuit that violated the Constitution under the Separation of Powers with its ruling. The fact is that President Trump clearly has the constitutional and statutory authority to issue this order. It is clear: radical Islamic terrorists are at war with America. President Trump order is a proper and constitutional way to protect America. Again, the directives contained in the President Executive Order are closely tethered to discretionary powers vested in the Executive Branch ...","post_message":"A MAJOR SETBACK FOR PRESIDENT TRUMP: The 9TH Circuit Court of Appeals has ruled unanimously against reinstating Trump's travel ban. Do you agree with the ruling? @webpagelink"},{"comment_id":"10155602222490354","commenter_b":"I would let my daughter be a part of this group, it has been infiltrated by radical lesbian feminist. Children are not safe with them!!!","commenter_a":"Is this a great country or what?","post_message":"It's not clear how this will affect cookie sales...."},{"comment_id":"895447730553834","commenter_b":"You can both GFYS , typical ignorant trash","commenter_a":"Fuck the Oneida nation","post_message":"Mayor Patrick O'Connor said the long-time village seal shows a historic wrestling match between village founder Hugh White and an Oneida Indian that figured into good relations between early settlers and the Oneidas."},{"comment_id":"1523513847666621","commenter_b":"Republicans had a smear campaign for him too, beginning with making him out to be a communist, with anti-American rhetoric to prove it. He would've been painted an insider since government is all he knows. They planned to trot out his rape fantasy story as well. Also, Vermont tried and failed it's statewide Healthcare for all system. He was treated with kid gloves compared to what he would've endured against the Trump post-truth machine.","commenter_a":"Sorry, Bill, but half of America already hated her BEFORE she ran. The media and Republicans have been excoriating her for 30 years. SHE NEVER HAD A CHANCE--unlike Bernie, who was almost universally beloved. He would have won. Fault: Democrats","post_message":"In case you missed them, we're counting down the most popular stories on BillMoyers.com during the past year: #9 - The fact is that Hillary Clinton wasn’t unpopular when she announced her decision to run in April 2015. If you look at the Gallup survey in March of 2015, 50 percent of Americans had a favorable impression of Clinton, only 39 percent an unfavorable one. So there was clearly no deep reservoir of Clinton hatred among the general public at the time. On the contrary: Americans liked her; they liked her quite a bit. Hillary Clinton's popularity didn't start to plummet until the press focus turned to her emails."}]
