[{"comment_id":"1792520417642435","commenter_b":"Darlene is a freaking moon bat low life from Mars. Leave the scum alone.","commenter_a":"desroy Clinton, do not hold back, destroy this criminal.","post_message":"Crooked Hillary Clinton wants to essentially abolish the 2nd Amendment. No gun owner can ever vote for Clinton!"},{"comment_id":"10154465845766162","commenter_b":"This is different, this girl has some evil in her!!","commenter_a":"Huh? Well that's just stupid. I tell you to jump off a cliff, and you do it... You're the idiot.","post_message":"A teenager who sent her boyfriend dozens of text messages encouraging him to take his own life and told him to \"get back in\" a truck filled with carbon monoxide fumes must stand trial for involuntary manslaughter: @webpagelink"},{"comment_id":"735262859947913","commenter_b":"If Melania was one of my students, she would be sitting in my office now for a little chat about plagiarism and the consequences according to school policy. Similar to students in the past, she is defensive and blaming others for her plagiarism.","commenter_a":"And the Deval Patrick 10/15/06 vs President Obama 2/8/16","post_message":"Compare Melania Trump’s speech with Michelle Obama’s 2008 speech. Donald J. Trump campaign denies the speech plagiarizes parts of Michelle Obama's: @webpagelink"},{"comment_id":"1263330063738211","commenter_b":"WE ARE STRONGER TO-GET-HER AWAY FROM POTUS! #NeverHillary #DrainTheSwamp","commenter_a":"Seeing you, Obama, your husband and the rest of the democrat crooks, liars and thieves in prison for life or the hanging post!!!!!","post_message":""},{"comment_id":"10153466375525575","commenter_b":"She got her 15 minutes of fame. Should go dance on a pole now! What a ho!","commenter_a":"Magan sure isn't winning any thing after Howard strearn show about her sex life and now these pictures are coming out of Her.","post_message":"The Gateway Pundit - Donald Trump Builds on Lead After First Debate – Ted Cruz Surges to Second"},{"comment_id":"10153901527564342","commenter_b":"I hope everyone that takes their child there see's this and takes their child out of there...I also hope they shut this place down and arrests that woman","commenter_a":"Their intention was to not hurt the boy yeah OK why didn't they stop when the little boy said it hurt. That's exactly why I do not put my kids in daycare this world is full of stupid people who don't care for our kids. Its not the daycares responsibility to scrub the kids face. Like really. They should face charges I'm sure someone else heard and seen that works with this stupid girl ugh this just really upsets me.","post_message":"The dad wants the daycare to face charges"},{"comment_id":"919474584812263","commenter_b":"She's in the white one percent of income earners selling darkness for light, propaganda and bullshit spewing pays well in America, the scary black men are race baiting ha","commenter_a":"To paraphrase the great Nelson Mandela: \"We are not less life loving than you are.\"","post_message":"Why didn't she have the same concerns about American Sniper?"}]
