[{"comment_id":"10153014301039205","commenter_b":"@alex you're fucken stupid saying illegals don't have a place in the U.S. We ALL are fucken immigrants idiot , what about the Chinese gangs and Russian mobs ? What about them ? What about the KKK and other racial groups who commit crimes ? It's not just us MEXICANS who are illegal it's EVERYONE , If anything the natives founded this land and the rest are immigrants .. Smdh","commenter_a":"Who's fucking side are y'all on? Trump may not be the nicest kid on the block but we are talking about a Drug Lord in a very dangerous drug cartel. Is yalls hatred that much for Trump that you support a drug cartel boss killing him?","post_message":"The FBI is now protecting Donald J. Trump"},{"comment_id":"10153080401256051","commenter_b":"There is a hog epidemic going on in the U.S. there destroying farms everyday...there's a big need to keep the population down. Quit crying your not the ones who's life's are being destroyed","commenter_a":"The ribs are good .. smokin low and slow.","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"10156120260300354","commenter_b":"Fry his sorry butt !","commenter_a":"Firing squad","post_message":"The appropriate punishment for Bowe Bergdahl is ________________."},{"comment_id":"10153320376007042","commenter_b":"All five females was arrested","commenter_a":"That poor girl. I hope the person who attacked her gets arrested.","post_message":"A 17-year-old girl viciously attacked inside a Brooklyn McDonald's is speaking out about the brutal assault for the first time. @webpagelink"},{"comment_id":"10153142231890329","commenter_b":"Also it says 'optional' so parents do what they want regardless. Lots of parents I know say they prefer the class donation as they may not always get a chance to shop or might not know the child well enough to personalise the gift.","commenter_a":"Let me put forth a different perspective: my kids are in classes with 20 odd children in - this is excluding family and family friends who attend the parties. At birthdays if all the class kids attend that's 20 gifts. You are hard pressed to find something cheaper than 10 quid these days and most individual presents cost more so if everyone gives 10 quid it lands up being more affordable for a lot of people, means a lot less clutter in what are often small London homes or apartments, and collectively with say 200 pounds a child can get one substantial gift like a bike or it could go towards something the parents need for their child. I genuinely don't see an issue with this at all and fail to see how this is a middle class issue.","post_message":"Oh, dear. // BuzzFeed UK"},{"comment_id":"437108856413709","commenter_b":"He will CERTAINLY BE BETTER THAN THE MORON IN THE WHITE HOUSE NOW!","commenter_a":"Agree","post_message":"\"I will be the greatest jobs president that God ever created\". Agree or disagree?"},{"comment_id":"1060233254031678","commenter_b":"I have a question, I received an email from the bernie sanders.com saying i did not have a party preference but to request a democratic ballot. i did get a democratic ballot. this is my first time voting and was wonder if that's what it actually meant?","commenter_a":"I like how honest Bernie is. The Democrats sold that clean coal fantasy for years, and Clinton is still trying to sell it. Heck, she said natural gas is a \"bridge fuel\" when, renewable can replace most energy needs. When a candidate who sold fracking to the world, and supports \"clean coal\" gets environmental group endorcements. That candidate is the establishment. Because nothing else makes any damn sense.","post_message":"Safe fracking is like clean coal, pure fiction. Fracking pollutes water, degrades air quality and worsens climate change. No amount of regulation can make it safe."}]
