[{"comment_id":"1034412946618453","commenter_b":"Shut up","commenter_a":"The end of life and nature. I miss to see the destination of these individuals and their satanic groups. #SuicideInTheNameOfFreedom","post_message":"Hopefully more players will be encouraged to come out"},{"comment_id":"10155333457725354","commenter_b":"Besides all this...Clinton looks like she needs a facelift! She definitely has not aged well. With all the worries she's had I can see why she looks like this...","commenter_a":"No integrity","post_message":"MELTDOWN: Hillary's Disastrous Press Conference..."},{"comment_id":"924642210962167","commenter_b":"What a dumbass!","commenter_a":"No political enemy of this country could have done more to destroy it then the Republican party has done over the past 30+ years. They have nothing to offer our citizens but hatred & fraud. Neither Russia nor China could have planned it better. These evil people have taken a strong, compassionate country & turned into the laughing stock of the rest of the free world. All they really want is to have us pay for & die for their desire to make war all the time. It's time we figured out that these \"straight\" (maybe) white men are truly impotent & can only declare their\"manliness\" by making war on everyone rlse, including you & I. If there is such a thing as the \"anti-Christ\", it has come in the form of the Teapublicans, not just one person. They are sickening & digusting.","post_message":"Too true. Image by Occupy Democrats, LIKE our page for more."},{"comment_id":"1115332378507619","commenter_b":"Shame on you Arizona. This is the doing of ALL your citizens. I have spent a lot of time in Southern Arizona - at one time I would have retired near Tucson when we arefnished traveling. Not any more. Shame on you.","commenter_a":"Conservatives want to go to war with ISIS because they are destroying ancient sites but have absolutely no qualms about destroying our own indigenous holy places","post_message":"Should it be legal for Congress to give away ancient Apache holy land to a foreign-owned mining company? Represent.Us has the scoop."},{"comment_id":"859046174191636","commenter_b":"she sucks like spike lee","commenter_a":"why is it important that she was a black female director? is it not good enough to be the Best Director?","post_message":"\"I do think it was a snub. But, I do believe she’s the first black female director whose film was nominated for an Oscar, so that’s already been history making.\" - Director Yoruba Richen on \"Selma\" and Ava DuVernay"},{"comment_id":"745823678941543","commenter_b":"get her out","commenter_a":"Bye dumbass!","post_message":"Whoopi Goldberg To Leave The Country For THIS Awesome Reason It's about time. We don't want you here anyway. Can we get 30,000 'LIKES' to have Whoopi leave the country?"},{"comment_id":"1591380840922039","commenter_b":"Legal Mexicans will stay,illegals will get deported..as it should be!!!","commenter_a":"Mexicans broke the fence at the border to come here illeagally, breaking the American immigration laws, so they should pay for the new repaired version (aka the wall) Copy & paste and share this comment if you agree, that way we can support Trump by making him look good.","post_message":"Wow, Mexico sounds like they're literally in the Apprentice boardroom with @Donald J. Trump pleading for him not to fire them. THIS is what it looks like when you've got a president who refuses to back down. It's a new day for America!"}]
