[{"comment_id":"476652309189729","commenter_b":"donnnnt wanna hear it..cant stand her...","commenter_a":"Someone should us duck tape over her lips. She takes the cake for the most disgraceful women in the White House ever","post_message":""},{"comment_id":"10157068560150354","commenter_b":"When you ignorant fucking blacks start acting like black lives matter, maybe then I'll start to believe that black lives matter. Until that happens, and I doubt it ever will, keep killing each other and SHUT THE FUCK UP. Your BLM movement is a FUCKING JOKE;nothing more than LOW LIFE, FUCKING ANIMALS.","commenter_a":"I HOPE THIS IS AN ISOLATED INCIDENT. FOR THOSE WHO STOOD BY AND WATCHED, MAY THE SAME HAPPEN TO YOU.","post_message":"A shocking Chicago video reveals the horrifying death of 32-year-old Marques Gaines..."},{"comment_id":"10152856224956051","commenter_b":"Ban them from the USA!!!!!","commenter_a":"These f***ing traitors need to have their asses strung up on the flag pole !!! Wtf is happening to our country!! What a bunch of sorry worthless stupid f***ing liberals!!.. S*** is fixin to hit the fan!.. Do they actually think we're just going to sit back n let them continue their disrespect??","post_message":"More than 1,200 people, including a lot of prominent professors, just signed a letter to ban the American flag. Here are all their names and the schools they’re from."},{"comment_id":"1362278090453725","commenter_b":"GET THE FUCK OUT!","commenter_a":"Send them home","post_message":"Muslims Banning 9/11 Memorial Because It’s Racist. They have no respect for the country we live in. Do you think they are the racists?"},{"comment_id":"905390669594112","commenter_b":"@username you must have a patheticly small one if it turns into an innie","commenter_a":"If you have an innie, use the women's. If you have an outie, use the men's. That's not difficult.","post_message":"BREAKING: The Supreme Court just ruled on their first transgender case..."},{"comment_id":"10153106240459586","commenter_b":"Thank you for choosing adoption! <3","commenter_a":"Precious baby!! I have four rescued pets and must stop but it breaks my heart every time I see these posts..","post_message":"DON'T BREED OR BUY WHILE SHELTER DOGS DIE. @webpagelink CC: American Kennel Club & Westminster Kennel Club Dog Show SHARE if you ALWAYS #AdoptDontBuy!"},{"comment_id":"10153974538694228","commenter_b":"Wow. Two uneducated racists here.....Jean and Gary! Shame on you both!","commenter_a":"You can thank Trump for perpetuating this problem.","post_message":" Muslim? All of you should die! The man yelled from his car. He then went inside for his gun. Police are seeking hate crime charges."}]
