[{"comment_id":"10154093094596756","commenter_b":"Yes that's it Alissa, it is \"hidden on purpose\" but you supposedly know this secret and post it on Facebook...yet it is hidden? How, just HOW do you make that thinking work in your mind?","commenter_a":"They just lie with confidence and no facts and figures. The economy is worse than when Obama came to power? Are you serious? The whole banking system had crumbled and TARP funds had to be injected. Lehman Brothers had closed down. Merrill and Bear Stearns were sold, housing was plummeting, unemployment was rising, stock market had crashed, sentiment was pessimistic. Now that we are all good - yep let's not give anyone credit where it is due.","post_message":"If you missed last night's GOP debate, here's a recap in 100 words."},{"comment_id":"10153140087886037","commenter_b":"@username I have a friend who works as an ICE agent and their hands are often tied when getting rid of criminals and they already deport the serious criminals.","commenter_a":"My mother-in-law went through the process legally and in November she took the oath. She took the process seriously, learning US history, learning english, and working hard to pay the fees. Freely handing out citizenship is an insult to those who went through the process legally. Laws are put in place for a reason, we cant pick and choose which ones we follow. And the President can't be allowed to give millions of people citizenship when it goes against our laws. I don't care if the president is Democrat or Republican, this is not legal.","post_message":"Confident Obama predicts success in immigration appeal, has message for millions facing possible deportation @webpagelink"},{"comment_id":"10153434470306323","commenter_b":"Vahan alko tanssijalkaa vipattaa :D","commenter_a":"Nora ootkos tanssinut taas?","post_message":"Five passengers were injured after a train derailed at Mumbai's Churchgate station on Sunday. CCTV shows the local passenger train crashing into the barriers and partly mounting the platform. Officials have blamed human error for the incident."},{"comment_id":"470909953099585","commenter_b":"Every state should step up and protect our America, muslims can keep their beliefs to themselves, ban Shariah Law in all 50 states!!!","commenter_a":"WTF","post_message":"Muslims trying to force Shariah Law on Alabama just got owned. Good. We won't stand for Shariah Law in America. Do you agree this should happen in all 50 states?"},{"comment_id":"10153758333227217","commenter_b":"A loose federation or republic please girls. also please get rid of our constitutional monarchy.","commenter_a":"Oh No nae anither ane","post_message":"Will there be a second referendum on Scottish independence? \"As far as I'm concerned, the Scottish people had their vote - they voted in 2014 - and a very clear message came through,\" says new PM Theresa May. #Indyref2"},{"comment_id":"1734664193415362","commenter_b":"Don't Worry Bernie supporters.. !! Hillary will never win, well never let her ! #FeelTheBern #NotMeUs #HesWithUs","commenter_a":"Hillary is the clear choice for the White House!","post_message":"What a week."},{"comment_id":"829720727076952","commenter_b":"Where all snakes live","commenter_a":"The fall of Ramadi to ISIS demonstrate Obama's success.","post_message":"Must be a comfortable rock the White House is living under..."}]
