[{"comment_id":"10155205840346337","commenter_b":"@username illegals work every job of the spectrum not just in the fields.","commenter_a":"So these restaurants openly hire illegal workers,,,,hmmmm.","post_message":"American eateries will be shutting down to show solidarity with immigrant workers."},{"comment_id":"10153440735091130","commenter_b":"We don't want to hear any more about this ugly, perverted, faggot drag queen.","commenter_a":"Done w Huff Post","post_message":"Stunning!"},{"comment_id":"10152565333134071","commenter_b":"Both of them are idiots !","commenter_a":"Legalize it, is the best way to keep it out of minors and kids.","post_message":"#Pot2Blame?"},{"comment_id":"1109262989140148","commenter_b":"Crazy woman- Good match for Trump","commenter_a":"What an imbecilic shallow fool! Has she ever gone a day without knowing where she will sleep for the night or whether she will find a meal before the end of the day? God! Someone just shut her up!","post_message":"\"Knowing that Trump won on [immigration], it should empower you to go ahead and ask the candidates, 'What the heck are you thinking, candidates? What are you thinking when you're going ahead and actually asking for more immigrants, illegal immigrants, welcoming them in, even inducing and seducing immigrants with gift baskets of teddy bears and soccer balls?' \" Sarah Palin said."},{"comment_id":"10153010022651770","commenter_b":"They boy that was trying to force the little girl in the bathroom was asked why did you do that ,an the boy said ,thats what daddy does to mommy !!!!","commenter_a":"Little kids are not mature enough to determine if they are transgender. They have been brainwashed.","post_message":"Miraloma Elementary principal Sam Bass said the bathroom change is because between six and eight students have decided they are transgender, or are tomboys."},{"comment_id":"10154629508429099","commenter_b":"Poor woman, but yet another reason as to why the elderly need to be tested at every license renewal after a certain age","commenter_a":"Poor thing.","post_message":"An 83-year-old woman died after her friend drove over her while backing out of a parking space @webpagelink"},{"comment_id":"10152809314113645","commenter_b":"It SHOULDN'T MATTER SHE IS A MURDERER !!!!!'","commenter_a":"murder charge now!!!","post_message":"Sad update to pass along, family tells FOX 4 that a teenage girl who was critically injured last Friday after being hit by a car was taken off of life support today."}]
