[{"comment_id":"952967998077006","commenter_b":"Ahhhh...NOOOOOOO! AMERICA WILL NEVER!","commenter_a":"I'm paying less thanks obamacare!","post_message":"Republicans won't ever admit the success of Obamacare. As with all of the Presidents winning policies, they prefer to ignore facts and spread lies."},{"comment_id":"10153767198963690","commenter_b":"@username it is not just three countries being destroyed, all the countries in Europe to which the refugees are going will be destroyed economically, culturally, life as they know it will never be the same.","commenter_a":"Saddam a cde to be missed, a last Iraqis leader","post_message":"\"There are plenty of Iraqis for whom Saddam is a nightmare that they never want to see again. His legacy here, though, is complicated. It's not as simple as 'Dictator Bad, Democracy Good,' as the architects of the Iraq war would have you believe.\" Al Jazeera's Imran Khan, in Baghdad, filed this Reporter's Note."},{"comment_id":"1115332378507619","commenter_b":"Shame on you Arizona. This is the doing of ALL your citizens. I have spent a lot of time in Southern Arizona - at one time I would have retired near Tucson when we arefnished traveling. Not any more. Shame on you.","commenter_a":"Conservatives want to go to war with ISIS because they are destroying ancient sites but have absolutely no qualms about destroying our own indigenous holy places","post_message":"Should it be legal for Congress to give away ancient Apache holy land to a foreign-owned mining company? Represent.Us has the scoop."},{"comment_id":"10153367741477411","commenter_b":"Good. Disgusting woman","commenter_a":"I say she probably didn't know anything about it! My sisters ex husband was a cop and she knew nothing about the \"dirty deeds done dirt cheap\"!","post_message":"Fox Lake lieutenant Joe Gliniewicz's widow Melodie faces several conspiracy charges as well as charges on money laundering and the misuse of charitable funds."},{"comment_id":"1014897985199658","commenter_b":"A FUCKING MEN!!!","commenter_a":"#ALLLIVESMATTER","post_message":"A new low. #BlackLivesMatter"},{"comment_id":"10153347711966680","commenter_b":"And from your own site @webpagelink","commenter_a":"No one has ever really cared what David Duke says so people don't need to flare up over his nonsense.","post_message":"Former KKK grand wizard David Duke on Donald J. Trump: “He’s meant a lot for the human rights of European Americans.”"},{"comment_id":"10153279079299170","commenter_b":"With so many illnesses she has claimed, she must be unhealthy in the brain!! We already have one of those we don't need another one!!","commenter_a":"islamofascists have no respect for women, including Barry O. How could they have any respect for Hillary?","post_message":"If Hillary's such a precious little snowflake that Rand Paul is supposed to treat her with kid gloves, how is she supposed to deal with Putin, ISIS, The Norks, Iran, Asaad, Cuba, China, etc?"}]
