[{"comment_id":"10152974957394641","commenter_b":"shame on u black woman.","commenter_a":"They will mit with Muhammed in hell enjoy the fire","post_message":"Saudi Arabia has announced the successor to the throne: cnn.it/1t3xpeS"},{"comment_id":"10154154880759087","commenter_b":"And if Bill's affairs are on the table, so are Melania's published nude photos, including her lesbian poses.","commenter_a":"Stupid people can't even see that their party is in shambles because of this animal. PS- Bill isn't running for President, HRC is. If you're gonna judge spouses for their lack of control or influence in their marriages, then where's your criticism of Melania?","post_message":"\"They will elect Donald Trump and Mike Pence because they know that this is our last chance to keep our nation from plunging over the cliff into an abyss of debt, weakness, and servitude.\""},{"comment_id":"1401866033180478","commenter_b":"Well said!","commenter_a":"Only took mass shootings for something to be done! Stop illegal aliens from getting jobs here, no papers=no jobs or sending our money to help other countries when we have plenty of homelessness & poverty here in our own country. Fix this country first b4 you try to fix others.. Children here need help just like across the world, we have Veteran's dieing & sleeping on streets, starving people & animals everywhere. And the only way something is ever done is when there's some sorta tragedy. The whole state (country) is in need of change. We need to correct us b4 we try to help others.","post_message":"WATCH LIVE: Gov. Rick Scott is in Orlando giving a briefing on the Florida Department of Law Enforcement's counterterrorism efforts. Gov. Scott wants to spend $6 million to increase the number of agents dedicated to fighting terror: on.wtsp.com/2j4OSzV"},{"comment_id":"10153197426077377","commenter_b":"I like you Ted but I want the migrants to assimilate into the US and the simple fact is the migrants from Mexico and Central and South America do that very well... we are them and they are us... get string borders but work out something so those that are hardworking people who make our country a better place can stay.","commenter_a":"Canada Cruz is an Amnesty supporter.","post_message":"Ted Cruz — \"I think Jeb Bush has been very honest, he's been very candid about his support for amnesty.\""},{"comment_id":"10153993909761491","commenter_b":"A women should be happy she has big tits-men will ne ef stop looking at her","commenter_a":"I got chastised by a femminest about 3 months ago for saying that it was a crime against man","post_message":"\"I chose surgery because of how I felt, not because of what anyone else thought.\""},{"comment_id":"692747934208970","commenter_b":"If illegal aliens must be allowed into our colleges, they should be charged twice the tuition as out-of-state students, with no eligibility for any financial aid, and any courses that legal aliens are taking in order to obtain citizenship be mandatory.","commenter_a":"He'll no!","post_message":"Do you think illegal aliens have a right to attend taxpayer funded public universities?"},{"comment_id":"10153155555711051","commenter_b":"sick bitch!!!!!!!!!!!!!!!!!!! Nancy P","commenter_a":"Are these women brain dead ??? Do they think they won't get caught????","post_message":"A teacher was arrested after the authorities found out what she had been doing to a student. Now she wants her bond reduced. Initially the request was going to be rejected - then she presented her reason."}]
