[{"comment_id":"1381562928548606","commenter_b":"Ya and they'll have to start paying for water or make their own from sea water. Of course northern Ca, will succeed, so all we will lose is the three out of control cities. Not bad","commenter_a":"3 trillion in debt CUT EM LOOSE","post_message":"Spread this everywhere!"},{"comment_id":"953345841476863","commenter_b":"that same lie every fuckin time. let me guess. Cherokee. fuck that shit. bitch is lying. and she's just another white racist tryna curve us from the truth. you're nice shit don't fly around me. I'm gonna bring out the racist in you for everyone to see if you keep on. let's play","commenter_a":"I rarely hear a white person say either of these things, and if anything I hear blacks alday long say go back to Mexico to Spanish Americans","post_message":"We're waiting..."},{"comment_id":"1147833905269371","commenter_b":"No, thickhead, enough of YOU is enough!!","commenter_a":"@username if the guns are taken away from good citizens they will be more killing than you every seen before my my where is your common sence!!!!!","post_message":"@webpagelink"},{"comment_id":"542034032653843","commenter_b":"Dumb ass","commenter_a":"Right....looks who is racist Obama... You! Who is BSing Whom?","post_message":"Obama just told the entire world that we have racist cops. He has absolutely no respect for the hardworking people that make this country work. Do you agree is a complete embarrassment to our country?"},{"comment_id":"10154992608754723","commenter_b":"Enter with a Visa is legal so what exactly are you talking about. This woman held in JFK work for US ARMY for 10 years in Iraq and this is how she gets paid.","commenter_a":"Cut this out, you want to come to America come in legally like my parents and siblings did. Be willing to work hard and respect American vslues","post_message":"Protesters gather at JFK airport to fight the refugee ban and detainment of refugees."},{"comment_id":"10154880634893984","commenter_b":"Move out!","commenter_a":"So, who packs there bags first","post_message":"Just as Trump begins to defy the odds, Hollywood is losing it in an unforgettable way..."},{"comment_id":"834047250056984","commenter_b":"NO MORE ILLEGALS IN THIS COUNTRY ON WELFARE!","commenter_a":"Ladies and gentlemen, the next president of the United States, Donald Trump. Trump train all the way to the white house!!!! #trump2016","post_message":"Thank you Illinois! #SuperTuesday #MakeAmericaGreatAgain #Trump2016"}]
