[{"comment_id":"1717305195178742","commenter_b":"@username Did you smoke crack before your post? Americans can be Asians. Using your logic, Latinos and Latinas can't be Americans either. And all blacks would be African. Also, those nations are far from being heterogeneous like ours.","commenter_a":"Yes Asian men are not portrayed in a very nice light especially in american media. however, I find many Asian men to be attractive. love the facial structures and there is nothing like a guy with a sword.","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"718057805010847","commenter_b":"He looks like he deserved it","commenter_a":"Aimee Lewis @username","post_message":"Good job"},{"comment_id":"10153215864872235","commenter_b":"She's just making up the rules as she goes along.","commenter_a":"200,000 dollars so they can keep serving shitty pizza! Yay! Everybody wins!","post_message":"Someone needs to drink a big, tall glass of STFU juice at this point."},{"comment_id":"10153847287078984","commenter_b":"She's a lying bitch","commenter_a":"Yes I Support Grey I agree He is doing what is expected of any Lawyer expected I","post_message":"BOOM! 'Bulldog' Gowdy just welcomed Hillary to the Benghazi Select Committee hearing in a way that probably had her wanting to run and hide. He had his chance to address her right to her face, and he did NOT hold back. Do you support Trey Gowdy's fight to unveil the truth about Benghazi?"},{"comment_id":"1733461333592333","commenter_b":"Build that wall! ! !","commenter_a":"Deport them all","post_message":"Democrats gave undocumented immigrants and their concerns a featured role on the first day of the Democratic National Convention, drawing sharp contrasts with Donald J. Trump and his hardline proposals on immigration."},{"comment_id":"10153049947289170","commenter_b":"From the info I have seen, they have entire areas that could just be surrounded and taken out......all those \"unsafe for non-muslims to enter\" areas......","commenter_a":"At least someone in power will acknowledge these Muslim terrorists need to be taken out! The problem is they have almost completely taken over France at this point. Apparently France has over 750 No-Go zones in which only Muslims are allowed to live and travel in these territories. Sadly the govern has let them take over like this.","post_message":"I guess this was some reality check."},{"comment_id":"10154700098471323","commenter_b":"All talk of this being an exercise in protecting democracy is simply a smokescreen. This lady is a member of the privileged elite aiming to derail the Brexit we voted for by seeing it completely emasculated to the point where the status quo will be preserved. The bankers and fund managers will never allow ordinary people their freedom. Only the rich are allowed to be free.","commenter_a":"All MPs are Selfserving PARASITES .The People have VOTED DEAL WITH IT .And Start bye getting our Borders sortted and RIP UP ALL EU LAWS Because we never needed them .FACT .And Stop Foreign Aid.We carnt afford it.And Spend the money on the people that need it in the UK..","post_message":"\"Neither the British people nor parliament have, however, voted on what form that leaving should take, or on which fundamental rights will be removed as a result of leaving. Those are questions that can be decided only by our sovereign parliament.\""}]
