[{"comment_id":"1341308765907356","commenter_b":"Al Franken was a terrible comedian and an even worse senator. What a worthless piece of crap!","commenter_a":"Ouch!","post_message":"Stuart Smalley never had a chance."},{"comment_id":"702990689891509","commenter_b":"Vote for trump.he is going to kick.the illegals out of the.u.s.","commenter_a":"It Obamas fault.......#feelthebern","post_message":"Donald Trump was just stabbed in the back by the GOP. This is cut throat. Do you still support Trump?"},{"comment_id":"1139514676096919","commenter_b":"#TrumpThatBitch","commenter_a":"Hillary is dirt","post_message":"Hillary Clinton and Donald Trump clashed repeatedly over the economy, tax cuts for the wealthy and ISIS in the first of three highly anticipated presidential debates. Read KTLA's story here: @webpagelink"},{"comment_id":"477998972394364","commenter_b":"Me too, but sometimes I go overboard and can't keep track of all my comments on the Internet.. So I have to take a break.. Also I get discouraged when people call me names :(","commenter_a":"They didn't say \"get over it.\" They promised to look into it, did so, and concluded that their pop culture reference was fine and that people misconstruing it would be in the minority and no changes needed to be made. Kinda funny how you can spin a story with a contentious headline. Ben & Jerry's seemed concientuous and compassionate here, not combative and dismissive as the headline suggests.","post_message":"These folks became very upset over the name of Ben & Jerry's new ice cream flavor and demanded it be changed. Ben & Jerry's response: Get over it."},{"comment_id":"10156637699435354","commenter_b":"Political whore?","commenter_a":"If the polls leaned toward Bhudism, Hillary would relate to Buddhists.She tries to relate herself to whichever way the liberal winds blow. If one doesn't agree they are homophobic, racist or worse...a conservative.","post_message":"Haters gonna hate..."},{"comment_id":"10154315963468812","commenter_b":"Weed makes you hallucinate now? Yeah let's ask the 2 ladies who have obviously never tried it.","commenter_a":"I still don't understand how marijuana is in the same classification as heroine and LSD, even though it's helping people walk! Meanwhile Oxy is prescribed every day and it's ruining peoples lives...","post_message":"Federal authorities are reviewing the possibility of loosening the classification of marijuana, which is currently in the same class of drugs as heroin and LSD."},{"comment_id":"10153453475573128","commenter_b":"To let the criminals' partnered officials pirate settlements to fill RICO crime established deficits AS the CRIMINALS declare exemptions on the fines, PRESERVES THEIR RIGHT TO THE CRIMINALLY GAINED CAPITAL, as the RICO mechanisms are left destroying the citizens WHO ARE NOT MADE RIGHT. They STILL lose the paid into asset/taxes.","commenter_a":"What is more egregious than a racket on our assets and THEN OUR WEALTH/earnings used to STEAL the racketeered assets WHILE the bank uses OUR wealth to outsource, exploit economic refugees, and MARKET RIG for decades? Citizen-taxpayers FORCED TO ASSUME market control(free market) destruction as RISK, as criminals assume racketeered assets, margins, and government. That is TEXTBOOK Weimar-Gangster Statism for which the criminal interests MUST be prosecuted and the assets/capital RETURNED to us as citizens and to our economy.","post_message":"A decade after homeowners used a soaring real-estate market to go on a borrowing binge against their own properties, many are now falling behind on payments."}]
