[{"comment_id":"10156121986485354","commenter_b":"I hope Hillary win cause we need dem stamps","commenter_a":"Since Pelosi has NO integrity then she would not know it and therefore in her little finite mind think Hillary has it, when she doesn't. As a side note, does anyone beside me get physically nauseous and ill when seeing photos of pelosi and hillary???","post_message":"Well this should make everyone feel much better."},{"comment_id":"1107115119405265","commenter_b":"I've heard more sense coming from a crack head","commenter_a":"Can't these people realize somebody is going to have to pay for \"free school\"?","post_message":"ClashDaily.com"},{"comment_id":"782624725204041","commenter_b":"SJ Shang dumbshit, the topic is how the allegedly peace-loving Muslims treat their kids. We have enough problems with idiots shooting each other in the US, we don't need more sand monkeys doing the same, whats so hard to understand about that? But you want to digress, fine. Americans desperately want to have dope legalized, to make themselves feel good. 80% of Americans are overweight, because they are lazy, they love to pop and abuse prescription pills and illegal drugs. They don't drink and drive responsibly, insist on texting while driving and play Candy Crush on the job. They refuse to live within their means, balance a checkbook. The last thing they need is one more useless addiction, and yet they whine and yammer about their right to be high .\"Dope fixes everything. If we smoked dope nobody would die from cancer anymore\"","commenter_a":"But we don't want Obama to address white Christian American murderers of children here because he might take our guns. Seems legit.","post_message":"I want a REAL president to step in and take these bastards out once and for all..."},{"comment_id":"10154449540370586","commenter_b":"That's bull learn something we do think for ourselves besides the president of the church knows she is evil educate yourself instead of spreading lies. Most Mormons are voting Trump or another candidate","commenter_a":"Most of the truly faithful Mormons will just vote for whoever church leaders tell them to, just like good little sheep... Both candidates should be in private talks with the church","post_message":"Democratic nominee Hillary Clinton’s campaign has launched “Mormons for Hillary” in an effort to woo people in red-state Utah to vote for her. Is it working?"},{"comment_id":"10154040024789160","commenter_b":"If you got a dick,,,, GO F- - K yourself","commenter_a":"Go sway","post_message":"It's Barack Obama's 55th birthday. What's your birthday message for him? (AP Photo)"},{"comment_id":"1640584582874588","commenter_b":"Arnel, stay away from my dog. Haaaaaaaaa!","commenter_a":"We should not reward liars... reject Hillary.","post_message":"“We should not reward people who use inflammatory rhetoric, who use the kind of derogatory comments, whether it's about Muslims, or Mexicans, or women, or people with disabilities, whoever it might be,” Hillary Clinton said, referring to Donald Trump. “That is not a sign of leadership. That's a sign of, you know, showmanship, of desperation, that should be rejected roundly by the American people.”"},{"comment_id":"737426566424213","commenter_b":"Good Lord, this woman doesn't have a clue.","commenter_a":"Michelle Marjan","post_message":"Betsy DeVos, Trump nominee for Secretary of Education, is remarkably unqualified for the job. Full video: @webpagelink"}]
