[{"comment_id":"10153486383431037","commenter_b":"So how many cops takes to capture one guy?","commenter_a":"Tantiana Valentina","post_message":"MORE DETAILS: Second escaped prisoner shot by police, in custody and taken to hospital"},{"comment_id":"978190742237455","commenter_b":"Hillary will win in 2016!","commenter_a":"Hillary 2016!","post_message":"“I should have used two accounts—one for personal, one for work related emails. That was a mistake, I’m sorry about that, I take responsibility, and I’m trying to be as transparent as I possibly can.” -Hillary on ABC World News Tonight with David Muir"},{"comment_id":"10152866241386094","commenter_b":"So what planet will the money mongers move to when this planet will not support human life?","commenter_a":"...while not witnessing the irony of the capitalist market as the driver of climate change… says nothing of the oil gas, mining, food industry's culpability in this mass earth murder","post_message":"Planetary distress has become the new normal."},{"comment_id":"10155183414820725","commenter_b":"A whole alot of whores","commenter_a":"He's an attention whore!","post_message":"Remember when Kanye interrupted Taylor Swift at the 2009 Video Music Awards? Well, he rushed the Grammy stage last night, showing off his sense of humor and impeccable timing: @webpagelink"},{"comment_id":"10154236838279228","commenter_b":"Very interesting.","commenter_a":"EricBlakeburn Olivia Kesselring","post_message":"A UFO incident near St. Louis captured worldwide attention 15 years ago. Many of the witnesses were police officers."},{"comment_id":"10153556104221336","commenter_b":"Do skank lives matter?","commenter_a":"Be careful who you get in bed with...","post_message":"After waiting about 20 minutes while the women talked, U.S. Senator Bernie Sanders was pushed away again when he tried to take the microphone back."},{"comment_id":"869514233108326","commenter_b":"Wendy please get an education","commenter_a":"And yet they are doing the same to the Palestinians","post_message":"'I could have faced a bullet for kissing Mengele's boots.'"}]
