[{"comment_id":"538992992891961","commenter_b":"Girls are just mean....need to face murder charges....they need the death penalty....need to be tried as adults","commenter_a":"They should all get life","post_message":"Three high school girls in Delaware are facing criminal charges over the fatal beating of a classmate inside a school bathroom last month. What could have caused them to do this?"},{"comment_id":"10153092001211037","commenter_b":"Divina there must be some way around this.God it would be a sin to put an animal down for no good reason ! Some Humans are the worse I tell you. Try talking with her when ever she has her bouts. I had one like that too and then again for heavens sake if it's not often then what is the problem she is a dog and that's what they do. Ugg I hope something else gives them reason to move faraway from you.","commenter_a":"Naomi get a pellet/ BB gun pump it 3 times hit that dog a couple time it won't bark anymore. It doesn't break the skin nor leave marks ( I know this for a fact) but will shut them up.","post_message":"A North Seattle woman faced a lawsuit from a neighbor alleging her dog Cawper’s barking was intentionally causing him “profound emotional distress.” The neighbor wound up winning $500,000 by default because she did not challenge his claim. Would you sue your neighbor over a disruptive pet?"},{"comment_id":"10152999450927439","commenter_b":"This is so out of hand! what the hell are they afraid of! get them out!","commenter_a":"Muslim Brotherhood terrorists","post_message":""},{"comment_id":"874881595880596","commenter_b":"Doesnt matter what they get The blacks or most of them would whine and complain about something!","commenter_a":"Lets just go back to the old days of segregation if that's what they want and they all can ride in the back of the bus","post_message":"“Whites Not Allowed” This is the public education system in Obama’s America."},{"comment_id":"828705883906152","commenter_b":"Trump for me all the way! We can't have Hillary. Socialism whatever","commenter_a":"Donald Trump is what we need not another stupid politician. Wake up people stop being so bling of the BS from Hillary, Cruz, Rubio. Those candidates are a joke. We need America back agin the strong country that once was until Obama and now Hillary, please the woman is a liar and a joke. She gets away with everything. Wake. Up America Trump will bring this country back, AMEN!","post_message":"Positive change is not going to come from someone such as Donald J. Trump. He is running for the wrong reasons, nothing good comes out from him. @webpagelink"},{"comment_id":"516585565198690","commenter_b":"Leave America, why are you here? Go back where you belong, we don't want you.","commenter_a":"Ship them all back to the hell hole they came from. We don't need or want them.","post_message":"This state just voted to ban Islamic laws… Good. We won't stand for Shariah in America and neither should you. Do you support banning Islamic laws in all 50 states?"},{"comment_id":"10153107155889411","commenter_b":"Your mother is a terrorist","commenter_a":"Not all muslims are terorist but all terorists are muslim...","post_message":""}]
