[{"comment_id":"10153197495351378","commenter_b":"Why Yall want her to get charged so bad , ..Focus On them Cop killers niggaz","commenter_a":"Thats really strange... Ive never even heard that song!!","post_message":"VIDEO: A woman slammed on her brakes and then stepped out of her car while it was still moving in a bizarre crash caught on a dashboard camera. @webpagelink"},{"comment_id":"10154480088981636","commenter_b":"female subjugation, taught from birth, how disgusting","commenter_a":"I hope they wear something to let people know they are the police","post_message":"Brilliant"},{"comment_id":"10153394561766336","commenter_b":"Only one I see judging is you","commenter_a":"Her Christian mother must be so proud. This is why you don't preach and judge. Once you put yourself out there, you are now the target to being judged.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child. “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"557193267780477","commenter_b":"KEEP GOING TED!!!!","commenter_a":"Wooo! Hooo! Colorado!...We stand with Ben!","post_message":""},{"comment_id":"10154725381070579","commenter_b":"You may want to look into Stein or Johnson... Hillary is a corrupt habitual liar and anyone that does not see it, is not the sharpest knife in the drawer...","commenter_a":"I'm a United States Army Veteran and I'm With Her. Trump's complete failure to understand basic foreign policy concepts, his relationship with Putin, and his out-of-control ego are a one-way trip into a third world war. His kind of \"leadership\" is the last thing America needs. Clinton isn't perfect but she's better than any of the other candidates today.","post_message":"Active & Retired Military: Your choice in 2016?"},{"comment_id":"10156091938520231","commenter_b":"he will hurt New Jersey to get Black woman","commenter_a":"I think they better do it remember what happen at Fort lee Christie did not get his way things was crazy!!!!!!","post_message":"Gov. Christie says Assata Shakur has to \"face justice.\""},{"comment_id":"967763486668466","commenter_b":"Smart, educated women are actually voting for Hillary. Don't fool yourselves.","commenter_a":"What is it about the Democratic platform that is appealing? Higher taxes, weaker security, open borders, murdering babies, a very real risk of WWIII... ya'll must really hate America","post_message":"\"Get this Donald: nasty women are smart, nasty women are tough, and nasty women vote.” —Elizabeth Warren"}]
