[{"comment_id":"1499858063367275","commenter_b":"Fleas carry disease such as plague. They're not safer than the flea meds!","commenter_a":"This is why I don't use any flea medication on my dogs, it's more dangerous for them than the fleas and my dogs have NEVER had fleas","post_message":"It's a dog chew so powerful that one dose can kill fleas and ticks for three months. Tonight on KIRO 7 News at 5 p.m., hear from people who say the flea medicine is responsible for the death or sickness of their dogs."},{"comment_id":"10157197688465354","commenter_b":"I hope the Police Officers NEVER help her out again!!","commenter_a":"That bitch looks like she is having seizures when she dances! Prince way, way, way better","post_message":"~~UPROAR~~"},{"comment_id":"1105112639584987","commenter_b":"She's an embarrassment to all intelligent women","commenter_a":"Get over your love affair with Trump. It's not happening and @username looks super pathetic.","post_message":"Here's what happened in Iowa, according to Donald J. Trump."},{"comment_id":"10153394425273352","commenter_b":"What a racist, ignorant bitch!! THE MAN WAS BLACK!!!!! Smh","commenter_a":"If this was a Black person who did this it would not be the same these white people make there own law when they break the law .what a Shame.you all get away from man ,But Y'ALL Didn't get away from God pls.","post_message":"Mother breaks down in court after her ex-husband is cleared of strangling to death their 4-year-old son because he was SLEEPWALKING when he did it"},{"comment_id":"1054929361214588","commenter_b":"She* is a woman.","commenter_a":"Sorry Siri, but according to his DNA, he's still Bruce! A rose by any other name.....","post_message":"Siri knows Caitlyn's name and she's going to correct anyone who forgets."},{"comment_id":"1368414533215688","commenter_b":"GOD bless them! I HATE cigarettes and the trillions of the non-biodegradable butts that filthy our planet and its waterways.","commenter_a":"Fine them sons of bitches. Why should they be above the law.","post_message":"Thoughts?"},{"comment_id":"10152833954741051","commenter_b":"Here we go with those damn pit bulls again. They should be banned from the United States","commenter_a":"Show any dog love & they'll be loving..!! Shame on the owner for not providing that..!! Now a dog that could've been a great pet gets euthanized & the poor lady gets hurt. Lose/lose situation...","post_message":"This woman was taking part in the Ice Bucket Challenge in her backyard when, all of a sudden, all hell broke loose."}]
