[{"comment_id":"1099154366818961","commenter_b":"Hypocrites and parasites all , get them all out now","commenter_a":"Kristian I don't know if you'll catch it","post_message":"#resigncameron demo live in London"},{"comment_id":"1768726713375361","commenter_b":"I agree tone down a little and let her hang herself.!!!!!","commenter_a":"I think Trump would be the best of the 2 evils, but with all his smart remarks it looks like he is trying to help Hillary. He needs to tone down and run on his own platform and let her hang herself.","post_message":"YES!!"},{"comment_id":"1648962245130424","commenter_b":"find a new dick to suck lol","commenter_a":"What will DiCaprio do?","post_message":"This sounds too good to be true!"},{"comment_id":"1117028848356591","commenter_b":"An illegal can not vote. Period. God only knows what other conspiracy theories you are listening to","commenter_a":"Another Liberal Lie!!!! Did she make a statement or pose a question? \"If 45% of Americans pay no taxes, should they be aloud to vote?\" They are reaching They are losing and they know it They are getting desperate No choices Lying Old Woman Communist Old Man","post_message":"She has lost her damn mind."},{"comment_id":"789272967888144","commenter_b":"If you're here illegally you need to get the fuck out . Don't care how old you are or how long you've been here","commenter_a":"Kill yourself Santorum , you have no purpose and you spread the disease of hate.","post_message":"Santorum... Santorum... That name sounds vaguely familiar... But why?"},{"comment_id":"10152719503449117","commenter_b":"Don't these pigs have any REAL criminals to hunt down???","commenter_a":"Boy that's a basket of snarls","post_message":"Why the sex lives of teens should be subject to school discipline is suspect enough, but it's extra perplexing what interest the government has in such matters."},{"comment_id":"10153967226386756","commenter_b":"Don't they have strict gun control laws? The criminals don't follow these laws? Shocking!","commenter_a":"Here are the huge protests over this? Why is the black community not absolutely outraged by this?","post_message":"These stones are a handful of those youths killed in Chicago. Diane Latiker of Kids Off The Block, Inc. (KOB) is trying to keep more names of children off the wall."}]
