[{"comment_id":"1640983469535980","commenter_b":"Speak for yourself. You've been in your spot for years, tell us something you have done. LADY, clean out from under your doorstep before you start criticizing someone else.","commenter_a":"Your a sick women","post_message":"Pelosi on Republicans: \"They pray in church on Sunday, and prey on everyone the rest of the week.\""},{"comment_id":"1089911127716025","commenter_b":"Another illiterate ass wipe that can't get over having to share her country with people that don't look like her... Try moving to Russia, bitch.","commenter_a":"I just wonder how long she can tread water.","post_message":"The kids were just playing in the water..."},{"comment_id":"10152536753022377","commenter_b":"Pay back is hell Nancy you POS witch..","commenter_a":"tell pelosie to fk off s hes disguisting pos let pic cotton","post_message":"Trending Now..."},{"comment_id":"1044884802218658","commenter_b":"exactly...if they don't want to procreate, they get it from somewhere else...LOL","commenter_a":"Now wait a minute! I thought they only had sex to procreate!","post_message":"Finally! A \"Christian\" guide to dealing with the \"sexual immorality\" of a wife refusing to give her husband sex-on-demand without a \"legitimate\" physical or mental health reason!"},{"comment_id":"10153668516697235","commenter_b":"She said my country...woman your kind is European.","commenter_a":"Have you noticed that that Trump supporters always have that crazed. I just crapped myself look in their eyes.","post_message":"This is NUTS!"},{"comment_id":"10154846980595575","commenter_b":"Only thing to say is, the political don't really give a rats as about our country or its people unless the are profiting from it.only Americans that care will change this type of bulls hit .America infrastructure is need of desired repairs. Let's take care of America before refugees","commenter_a":"There should be no money sent to this governor who chose to use the money for criminal reasons. You just can't do that!","post_message":"Instead of fixing the dam, Gov. Brown spent $25 billion per year on illegals!"},{"comment_id":"1065756060184114","commenter_b":"Scums they are.","commenter_a":"So not only do Republicans want to send our children to war while Bernie wants to send them to college, they now want our soldiers to suffer longer so they can continue their attempts to bash Obama and destroy our great country. These Republicans need to be put in a POW camp until after the election. Scum of the Earth!","post_message":"This is absolutely disgraceful."}]
