[{"comment_id":"10153260713478690","commenter_b":"Scrw U, Scrw Saddam, and Scrw Isis... Saddam killed 300,000 innocent kurdish moslems most of them by mass graving and gassing them, u pathetic peace of scm.","commenter_a":"Sadam was much better than ISIS...","post_message":"The statement said that a lorry loaded with around 20 gas canisters exploded on a highway between the Iraqi city of Mosul and Syria, as Kurdish fighters were being deployed following an offensive against ISIL fighters. @webpagelink"},{"comment_id":"1505750879440568","commenter_b":"@username...you\"re a stupid girl.","commenter_a":"I really feel like if the voting system was trustworthy Trump would win. His crowds are just insane and people are so enthusiastic about him. However, I don't trust the system and I'm scared to death that she will win because it will be rigged. I am literally terrified of the possibility that she could be our president. I have legit anxiety about it.","post_message":"The election was supposed to be over months ago. But certainly this week it was not supposed to be in question. Hillary should have been... They're already planning inaugural balls and all the other trappings that go with victory. This is not where they wanted to be, and with the possibility Trump could win, they are in abject panic. And it's being demonstrated on TV."},{"comment_id":"10154677372708145","commenter_b":"Everyone who voted for trump should come together and pay for that wall if y'all want it so bad . So y'all can't stop crying ...Trump gonna pay to build it with yall money next president gonna knock it down. Have a good day","commenter_a":"Our POTUS... Treating this like he's on an episode of celebrity apprentice and needs ratings. We are screwed beyond belief...","post_message":"BREAKING: The decision comes after Donald J. Trump tweeted the meeting should be canceled if Mexico won't pay for a border wall."},{"comment_id":"1617460714934208","commenter_b":"Hopefully she'll waste away and go away","commenter_a":"Apparently not","post_message":"Since she's not moving to Canada, Dunham could always try eating all that crow."},{"comment_id":"10153027990406130","commenter_b":"I'd add not to be shy about calling your OB for more pain meds, especially after multiple c-sections. They're not surprised, it's actually common. I wish I would have called sooner than suffer unnecessarily.","commenter_a":"I've had 6 c-sections.. 3 of which were After a long labor. While laughing and/or coughing is painful for the 1st day, that's about the worst of it, I never took pain meds after... The first one I might call 'rough'- but the other 5 were not bad at all. #5 was 6 weeks early and I had to pump milk and walk to the nursery (she needed the heat light) every 2 hours to feed her, it really wasn't that bad.","post_message":"Congratulations! Your ab muscles are completely non-existent now. The good news: Your arms are gonna get buff."},{"comment_id":"10154162897758855","commenter_b":"@username I was fondled by an obnoxious straight woman at a bachelorette party at a gay bar. She would not stop. I grabbed her hands and she told me never to put my hands on a woman. She was thrown out of the bar","commenter_a":"What gay man would touch a woman's crotch and breasts..? That doesn't add up in the least... Also what about all the sexual harassment done by straight women to gay men? Are we going to completely ignore that?","post_message":"What role do gay men have in sexual harassment?"},{"comment_id":"1191302950909160","commenter_b":"Time for the Trump wall","commenter_a":"we don't care that much where they come from, we only care to DEPORT them ASAP","post_message":"UNREAL! Look how many illegals from other countries are now coming in through Mexico!! WHERE they are from is ALARMING! @webpagelink"}]
