[{"comment_id":"756693807767590","commenter_b":"Ian","commenter_a":"Joshua","post_message":"...bruh"},{"comment_id":"1179053782134909","commenter_b":"Yes and he is ASS!","commenter_a":"IDIOT","post_message":"Kanye West Claims He’s Tougher Than A US Soldier. Wow, how disrespectful. He must be kidding. Do you think Kanye West is a disgrace?"},{"comment_id":"10153186192812550","commenter_b":"Oh @username its so sad. First of a talking back is not a threat. Second if he wanted to arrest her , he did not need to throw her on the ground & pull her hair. Those kids were running up to save their friend & I would have done the same thing. Third she was all ready sitting down , it was no need to push her head down in the dirt & sit on her. Apparently the kids were invited by a guest. They didn't start the fight at the party some old ladies started it.","commenter_a":"Absolutely NOT! 1.The video is incomplete. 2. The cops appeared to be outnumbered at least 4:1 3. He did not use lethal force. He restrained an individual who was not obeying his directive. 4. When another individual came from behind him; he did as any police officer would and drew their weapon. He then quickly holstered it when the threat was lessened. 5. If these kids showed proper respect for law enforcement; this would have been a different story.","post_message":"Call for cop to be fired after pool party video @webpagelink"},{"comment_id":"1206849516074767","commenter_b":"Call Hillary what you want, I don't care about her emails, she is better than that piece of Shit Trump","commenter_a":"Can he get any worst?","post_message":"\"Forget politics; he is a disgusting human being.\" - Thomas Friedman"},{"comment_id":"10152705081476519","commenter_b":"And have lots of sex in ur ass ur gonna get raped first","commenter_a":"You might be interested in Googleing why it was banned. Few today would believe the pseudo-science mumbo jumbo presented as fact to Congress. 1) Smoking marijuana will make black men want to rape white girls. That's girls not women. There is ZERO evidence here. 2) Smoking marijuana will make young men more likely to experiment with homosexuality. THAT may be true, but the rest of the presentation turned that simple statement into more of an assertion that it would turn young men gay.","post_message":"\"It is time for us to replace the failed prohibition with a regulatory system that works and let states and municipalities decide for themselves if they want, or don't want, to have legal marijuana within their borders.\""},{"comment_id":"763624153793368","commenter_b":"@username..Bye Felicia, go suck an egg","commenter_a":"I would waited until he falls asleep, and pull me a loreana bobbitt ...get a Surgical scapple do a nice clean quick slice, get me some tweezers and carry it and throw it on the freeway, and let someone run over it. it ain't big anyway. second scenario, get some super glue and glue his little hands to his little tilwinkle!","post_message":"Did you catch this moment from Melania Trump at the inauguration? Via In The Know"},{"comment_id":"10153360842296162","commenter_b":"Hope they enjoy their 72 male virgins.","commenter_a":"Fuckkkkkkkkkkkk Muhammed!!!!!","post_message":"COP SAVED LIVES: The officer who returned fire at two men who shot assault rifles outside an event displaying cartoons of the Prophet Mohammad \"saved lives,\" according to authorities @webpagelink"}]
