[{"comment_id":"10155757585249829","commenter_b":"Why not boycott Budweiser simply because it is not good beer?","commenter_a":"Melania???????","post_message":"Trump supporters on social media were furious: \"Never drinking Budweiser you should respect the AMERICAN president instead you mock with liberal propaganda.\""},{"comment_id":"694905427350625","commenter_b":"@username do you have special \"illegal spotting\" glasses? How do you know who's here legally & who isn't? Can you just look at people and tell or what? It's ok for them to fight in the army but because they're \"illegal\", they shouldn't be able to live here. Illegal immigrants aren't the problem, racists are","commenter_a":"I'm a Mexican who lives in Mexico, I had to say that before someone comments that I should be deported. Let me tell you that WE, you and us, are not enemies, yet your federal government, and Trump have treated us like such. The point is that some of us even share family living in both sides. I do have lots of American friends who I care for and respect greatly. I do also know that the majority of Americans are decent, honest, hardworking, generous, and God loving people. I am not against you neither most of my fellow country men are. I ask you from the bottom of my heart and trying to appeal to your reason and kindness not to let all this crazy stuff mess with our relationship as fellow humans and as good neighbors. We are friends and family. Let's keep it like that. Thanks for ...","post_message":"We certainly have. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1845364932419184","commenter_b":"Little girl go sit down and shut the hell up.","commenter_a":"she is an bitter root from the tree","post_message":"Not a good choice of words, Bristol."},{"comment_id":"10153983597909726","commenter_b":"ugliest face on the planet,put the bitch in shackles","commenter_a":"It puts them under oath and on the record and if any take the 5th it'll hurt Hillary even more, especially with Independents and Undecideds.","post_message":"Hillary Clinton's aides will be questioned on emails by the U.S. State Department. Will this make any difference?"},{"comment_id":"1414146828610887","commenter_b":"If he can't deal with everyday life maybe he should be committed to a facility that can help him. In other words he is nuts.","commenter_a":"Oh boo hoo, here is a tissue, grew up your in college time to man up","post_message":"College Kid Demands Counseling After Being 'Traumatized' By Seeing The Confederate Flag Sticker Our society is getting out of control. Do you think this is ridiculous?"},{"comment_id":"10153927371866037","commenter_b":"May them leave now and so what... Do they think they can bring down saudi arabia ...! Rubbish","commenter_a":"new begginings for World Friends & Foes...! ( drawing a line in the sands-a dark Red Cloud will come from that part of the world. )","post_message":"Foreign Minister Adel al-Jubeir says that all Iranian diplomats must leave Saudi Arabia within 48 hours."},{"comment_id":"1782129565361138","commenter_b":"@username SHES tying her hair up so it doesn't get in the way of the dick she about to suck bc she dosent wanna verbally apologise","commenter_a":"@username I don't get this, explain?","post_message":"Apology accepted"}]
