[{"comment_id":"1879681238919909","commenter_b":"And these kind of people are what supported Hillary. No concern for the law, just like her.","commenter_a":"Animals.","post_message":"“What’s happening to America?” said David Wilcox, as he showed his wounds inflicted by the mob. “You’re supposed to be able to vote in peace! It’s supposed to be part of our democracy. And what happened is, I vote for somebody, and I get beaten, robbed, and my car stolen, and I have no way of getting my wife to and from work safe anymore,” he told the Chicago Tribune’s news crew."},{"comment_id":"867346193401426","commenter_b":"US American’s must again flush ALL these scurvy republiCon knaves from the once sacred halls of our Government…just like our Grandparents HAD to TAKE BACK AMERICA 86 years ago. CLEAN THE LATRINE…IN 2016! VOTE BLUE","commenter_a":"I can only assume God had a long talk with him last night ,or someone hit him over the head with a two by four.I hope it was God those two by fours realy hurt.","post_message":"Even a broken clock is right twice a day. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"902128633188334","commenter_b":"I talked to my next door neighbors about the illegals. They were very verbally upset with the illegals. You see their whole family was born in Mexico and they all moved to Oklahoma Legally. The man told me it took them almost 12 years to get the whole family here. BUT they could have paid smugglers and had them all here in 2 years. They hate the illegals also. They said they give the rest of the Mexicans a bad rep.","commenter_a":"Welcome and thank you for doing it the right way","post_message":"Americas Freedom Fighters"},{"comment_id":"1101281803258742","commenter_b":"Bite me bitch. Ever heard of auto correct.","commenter_a":"This came from the Advocate (our local paper) and I am sharing it because it is exactly how most of us feel about Trump. The Media just doesn't get it....they can't believe that people are so angry that they can no longer be manipulated! Millions of trump supporters feel this way about Donald J. Trump..... \"We don't care if the guy swears... or how many times he's been married...or who he voted for, or what his income tax return shows. We want the problems fixed. Yes he's an egomaniac, but we don't care. We know he's not a racist, or bad to women, or all the other things the liberal media is trying to label him with. We know he's raised a good family, and that says a lot about him. The country is a mess because politicians suck, the Republican Party is two faced & gutless, and illegals are ...","post_message":"Even this focus group by Fox News's Frank Luntz agrees Hillary CRUSHED Trump. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"898221040294675","commenter_b":"Kill the mother fucker","commenter_a":"I would put a shotgun up his ass and let the trigger fly!","post_message":"Multiple Choice Quiz time, kiddies. I chose option 'C'. What about you? @webpagelink"},{"comment_id":"694905427350625","commenter_b":"@username do you have special \"illegal spotting\" glasses? How do you know who's here legally & who isn't? Can you just look at people and tell or what? It's ok for them to fight in the army but because they're \"illegal\", they shouldn't be able to live here. Illegal immigrants aren't the problem, racists are","commenter_a":"I'm a Mexican who lives in Mexico, I had to say that before someone comments that I should be deported. Let me tell you that WE, you and us, are not enemies, yet your federal government, and Trump have treated us like such. The point is that some of us even share family living in both sides. I do have lots of American friends who I care for and respect greatly. I do also know that the majority of Americans are decent, honest, hardworking, generous, and God loving people. I am not against you neither most of my fellow country men are. I ask you from the bottom of my heart and trying to appeal to your reason and kindness not to let all this crazy stuff mess with our relationship as fellow humans and as good neighbors. We are friends and family. Let's keep it like that. Thanks for ...","post_message":"We certainly have. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152820989551615","commenter_b":"I would be putting her inappropriately dressed (?) fat butt right out of the \"prom.\" She LOOKS like a moderately dressed hooker! Maybe that is closer to the truth than one might think.","commenter_a":"Wouldn't be necessary if the CHILDREN and their PARENTS actually knew how to dress appropriately.","post_message":"“You can't put ten pounds of mud into a five pound bag.\" One parent is threatening to sue for sexual harassment over a school handout about the dress code for graduation. It’s a story we’re talking about this morning on Channel 11. @webpagelink"}]
