[{"comment_id":"10153465147033812","commenter_b":"Don't worry about turning white in the White House, your dumbass isn't even gonna make it in there you dumb twit!","commenter_a":"No your a has been go home","post_message":""},{"comment_id":"567332390082204","commenter_b":"The dumbest woman in America alive .","commenter_a":"What a goofy broad.","post_message":"What are they going to call it, Mount Dumb-Dumb? -Conover"},{"comment_id":"989708387731249","commenter_b":"Are these women that butt ugly they need to completely cover up","commenter_a":"The people that thinks this is right need to wake up","post_message":"NO Sharia in America!"},{"comment_id":"10153333476251770","commenter_b":"My father is an immigrant from France, I lived 15 miles from the border of Mexico for ten years, I love the Mexican people and so does Trump, don't you see??? People who are in the legal process are being cut in line by illegals. Illegals ruin your wage rates, take your jobs, use our governments program resources. By shutting the border down deporting the illegals the Mexican Americans will get the wage they deserve! As acting, legal tax paying citizens!","commenter_a":"Because the legal Latinos want jobs. The illegal compete and lower the wage rate and that affects the legals ability to make a decent wage.","post_message":"Donald J. Trump beat out his Republican rivals in America's most Latin city Tuesday."},{"comment_id":"1218923861503062","commenter_b":"I wonder if this woman realizes what a joke she is. Department of Justice my butt. She has ruined any respect she may have had from the American people. What she may not realize is the Clinton's would leave her holding the bag if it covered their tracks!","commenter_a":"We don't need Attorney Generals that don't represent WeThePeople and the truth.","post_message":"Loretta Lynch, Attorney General can't seem to get her story straight about Hillary Clinton. This is what it looks like when your career crumbles right in front of you. Let's get 2,000 SHARES to show that we don't need CROOKS in office!"},{"comment_id":"10155599554315354","commenter_b":"Why are we still seeing this crazy whore.","commenter_a":"Sure she's an idiot...but can't she practice the religion of her choice wihout scrutiny?","post_message":"Raised Catholic....dabbled in Kabbalah...and now this... ...Check it out."},{"comment_id":"10153465142866037","commenter_b":"Regina just stfu. Idc","commenter_a":"who cares. its their country their rules. i dont see why people like to police other countries because they find their practices to be disgusting. no different than people consuming pigs, goats, cows and chicken. don like it? donate other possible food sources then. if not stfu","post_message":"\"There are all sorts of cultural norms about what you can eat; you eat turkey, so why are you trying to force us to not eat dog meat?\""}]
