[{"comment_id":"10153883162778145","commenter_b":"Illegals cannot vote","commenter_a":"she has a point nobody likes having to pay for others but more than 50% of US citizens are on government assistance and probably all of the illegals that's why the democrats keep trying to make it easier for felons and illegals to vote , you know they will vote for the party giving stuff away","post_message":"The profanity-laden video was uploaded to YouTube and has sparked headlines and heated discussions on social media. You can watch it here:"},{"comment_id":"10154048103696409","commenter_b":"Hey Betty eat a dick","commenter_a":"Lovely Family ! May God continue His Blessings on them!","post_message":""},{"comment_id":"10153505584229705","commenter_b":"Martin Besson","commenter_a":"Fatima Tanner Daniel Robson these hotels!!","post_message":"So bizarre!"},{"comment_id":"600522876804958","commenter_b":"His girls should have to take the test and eat the same crap that Michelle thinks should be served at our schools. They are no more important than my kids are regardless who they are.","commenter_a":"Go ahead you slime bag daddy you","post_message":"Obama just waved this law for his daughters just because he can. No one is above the law. He is a criminal. Do you agree Obama is not above the law?"},{"comment_id":"10152660515486813","commenter_b":"Maybe , but I am not a damn Liberal pussy.","commenter_a":"Too f'ng bad , play stupid games , win stupid prizes . Its not a resort.","post_message":"HORROR in Georgia Prisons. ACLU's David Fathi sheds light on how America needs to twist the lens and reflect on how we treat those within the criminal justice system. @webpagelink"},{"comment_id":"10153281917270090","commenter_b":"And what does that have to do with what his stand on immigration has cost all tax payers!","commenter_a":"Illegal immigrants!","post_message":"All of the above! Choose Obama's #1 failure as president: @webpagelink"},{"comment_id":"1716998008555343","commenter_b":"Me too. Can't concentrate at work","commenter_a":"Sleep in peace. You will be missed.","post_message":"This is what it sounds like when doves cry... #RIPPrince Prince"}]
