[{"comment_id":"1786796021584513","commenter_b":"Pathetic human being","commenter_a":"You are wasting your time.","post_message":"Madonna said she \"will not back down.\""},{"comment_id":"10153500362571770","commenter_b":"The world does not have a right to illegally enter the United States. The American people have appealed to Congress for years to secure the southern border so that we could then begin to address the issue of the illegals already in the country. That could have at one time meant some sort of arrangement for them to stay legally. But Congress did nothing because the WSJ, the Chamber of Congress and the business world wanted a supply of illegal, off the books, low wage slaves while others long for a utopian open borders world. It's time to bend our politicians to our will. We need to send the message, secure the borders or pay the price come election day.","commenter_a":"make sure they're all legal!!!","post_message":"A new coalition of Latino groups and labor unions aimed at stopping Donald Trump from becoming president will begin holding voter registration drives at high schools in battleground states."},{"comment_id":"409710459217248","commenter_b":"Sad she's even allowed in this country & in our schools!","commenter_a":"Sad that she promotes hate.","post_message":"Jewish professor shuts her mouth..."},{"comment_id":"10153176047249255","commenter_b":"His wife should also go to jail .","commenter_a":"Such a self proclaimed victim.","post_message":"This story gets crazier every hour."},{"comment_id":"555507287934896","commenter_b":"I'll flip it back and not shop there until the board fires her","commenter_a":"Time to switch to Costco.","post_message":"What do you think of this?"},{"comment_id":"10153231329598855","commenter_b":"She probably extored enough money to live off of so her job is nothing. What a narrow minded turd.","commenter_a":"WONDERFUL! Now if we can get all local, state and federal gay bashing employees to follow suit, possibly the USA will no longer be looked upon as the greatest hate nation on the face of the planet.","post_message":"She'd rather give up her job than grant marriage licenses to same-sex couples."},{"comment_id":"10153400709859474","commenter_b":"she will not tell the truth...","commenter_a":"What difference does it make","post_message":"Breaking: Hillary Clinton to testify before Trey Gowdy and the Benghazi Select Committee. Share to demand the truth!"}]
