[{"comment_id":"578481392330649","commenter_b":"THEY LOOK SO FOOL OF IT.....SSSSSSSSSSSSSSSSSSS","commenter_a":"Pot, meet Kettle...","post_message":"“One of the greatest frauds in modern electoral history is Donald J. Trump pretending to be an outsider.\" Tonight on “Hannity,” Ted Cruz said that Trump is part of the establishment because he funded liberal Democrats for years."},{"comment_id":"10154029757858132","commenter_b":"Wow. You ladies are some different kind of stupid","commenter_a":"Breastfeeding in public is fine but cover up, no one wants to see you whip your boob out in the middle of their lunch in a restaurant.","post_message":"This mother refuses to be shamed."},{"comment_id":"10156899433320354","commenter_b":"If you're a f****** illegal mexican, get the hell out!","commenter_a":"Illegal immigrants built part of this country cause people like Trumpet hired them! All of a sudden they're bad? Screw you all! Im proud to be a fucking Mexican!","post_message":"“[O]ne party has made it okay to say you can hate people, you can spit on them.” What would you like to tell Julieta Garibay? WATCH:"},{"comment_id":"10153212325922293","commenter_b":"Throw her off a tall skyscraper. She can't be rehabbed in jail. Ease the tax payers burden.","commenter_a":"Pure evil!","post_message":"“[If the police] read my messages with him I’m done. His family will hate me and I can go to jail.”"},{"comment_id":"464836607049445","commenter_b":"She is a hoe simple as that... stop giving hoes attention ..","commenter_a":"You know, If it weren't for facebook, I wouldn't even know who these weirdos are. I am proud to say Ive never seen them anywhere else. I wont ever use brainspace on any television shows that contain such nonscense","post_message":"“I don't do drugs, I hardly drink, I've never committed a crime —and yet I'm a bad role model for being proud of my body?” Kim Kardashian West came out defending nude pictures she posted on social media."},{"comment_id":"10152910274569091","commenter_b":"Lmao I wonder what gave him away... The eyes?","commenter_a":"@username lol","post_message":"This man was arrested smuggling 18 pounds of marijuana in his checked bags at LaGuardia Airport: @webpagelink"},{"comment_id":"10153238484143984","commenter_b":"Screw the bitch and her lying ass husband.","commenter_a":"Move out bitch","post_message":"People are furious, and I can understand why. Do you think Michelle is an out of touch First Lady?"}]
