[{"comment_id":"624793527653829","commenter_b":"I thought the window sign was funny too.","commenter_a":"Julie! lol","post_message":"If you are a Starbucks customer, you might be a racist... apparently."},{"comment_id":"521423368048243","commenter_b":"so she condones women being nothing... beaten, raped, stoned for no reason...be told what to do and when to do it.. she should live with them for a while without all her money... become nothing ... not human anymore...","commenter_a":"No she doesn't","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way. What a disgrace. She needs to deported to the Middle East. Do you think Nicole Kidman is a sell out?"},{"comment_id":"488312324683981","commenter_b":"Hmm if firearms are a replacement for a small penis what are females replacing with firearms @username???","commenter_a":"Gun Worship in The United States of Guns is Killing US...","post_message":"SCARY!!"},{"comment_id":"891529944370915","commenter_b":"Yes I'm still for Trump! Put this women in prison. Stupid Women Lost & she conceded.","commenter_a":"Yes","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"10153253016300329","commenter_b":"I can almost guarantee that this lady is nowhere near as big as this dress makes her look. I personally think she looks pretty average. Size 12 or 14. I'm not \"fat\" but I would probably look like that in that dress, thanks to the perfect little human I made. Haha. It just isn't flattering, that doesn't mean anything about her body.","commenter_a":"The dress is not for fat people that is the issue lol","post_message":"ICYMI"},{"comment_id":"1323629084344227","commenter_b":"and pretty much any woman could be a better president than Hillary.","commenter_a":"Not only can a woman be president but Hillary can be a better president than most men in fact the only MAN that can be a better president than her IS Bernie","post_message":"Stay classy, Bernie fans!"},{"comment_id":"10156552982575354","commenter_b":"Colorado? Thats stupid of a migration....I am disapointed california was a great republican state being ruined by demoxratic liptards","commenter_a":"Enough said - California: soooo fucking broke no thanks to Democratic ignorance. A liberal virus that occupied the west. All these liberal fucktards are moving to Colorado with their shitty habits, a virus that will continue to spread.","post_message":"A worthless piece of paper anymore?"}]
