[{"comment_id":"1191540644208167","commenter_b":"Two lesbians using sperm, fornication and evil","commenter_a":"Does this mean the she he cheated on the female? I mean someone had to party load in that right?","post_message":"Fernando Machado and Diane Rodríguez announced their pregnancy, believed to be the first of its kind in South America, on social media."},{"comment_id":"10152902421671378","commenter_b":"She needs to set her asss down ! Cthu","commenter_a":"Ratchet asss fools ! The Baltimore Mayor is INCOMPETENT ! Her dumb az decides to enforce a curfew 24 hours AFTER the riot starts... #blankstare Why hasn't she called The National Guard ???","post_message":"#BREAKING Action News reporter Kenneth Moton is in Baltimore and this is some of what he is seeing this morning."},{"comment_id":"750686755029933","commenter_b":"She's a racist","commenter_a":"I guess this only applies to black women since she declared \"Black girls rock\" instead of ALL GIRLS ROCK","post_message":"The \"Barack Obama\" move didn't go over so well."},{"comment_id":"936127749836940","commenter_b":"And system fail too","commenter_a":"Sel Taylor","post_message":"I Just Got a Computer Chip Implanted In My Hand — and The Rest of The World Won’t Be Far Behind"},{"comment_id":"10153661567171336","commenter_b":"This thug lady needs whatever the cops want to do to handle thugs","commenter_a":"So breaking the law is okay, right @username?","post_message":""},{"comment_id":"1393941760623890","commenter_b":"Just like they blocked Obama?","commenter_a":"It's a shame that Democrat voters don't vote on issues such as jobs, the economy, and security... They vote for the candidate who has the most celebrity backing... Low info voters.","post_message":"Lady Gaga criticized Melania Trump for saying she wants to end cyber-bullying if she becomes first lady. @webpagelink"},{"comment_id":"403409623179979","commenter_b":"And Hillary with Bill and Chelsia in tow is better. Maybe the icing looks better, but the cake is just as bad and tastes like crap.","commenter_a":"Do you ever wonder which one of the 14 GOP wannabes will get the nod. \"Please forget I'm a Bush, Bush; Mr. Personality Egomaniac Trump; etc. . Fourteen is a long list. I can't keep track. . .","post_message":"\"The crankiness of Scalia's insults run inverse to his intellectual consistency.\" Jon Stewart"}]
