[{"comment_id":"10153664693511336","commenter_b":"Until Obama resigns she stays","commenter_a":"I'm sorry Governor Huckabee chose to support this action. She is a public official and her religious beliefs can not interfere with her professional responsibilities and duties. Is this how he would respond if he was Prresident of the U.S.? I'm disappointed in you Governor. She should resign her position if she is unwilling to comply with the law!","post_message":"Gov. Mike Huckabee joined Fox & Friends this morning to discuss his support of Kentucky county clerk Kim Davis, and why he believes she's remaining \"steadfast\" to her beliefs."},{"comment_id":"1033609543378017","commenter_b":"Arrested???? WE OWN THIS BUILDING!!!!, and ALL THE GOVEMRNNENT BUILDINGS. BOUGHT, BUILT AND MAINTAINED WITH OUR TAX $$$$$$$$","commenter_a":"Yes!!! #DemocracySpring is currently trending on Facebook!!!","post_message":"The Young Turks live from the Democracy Spring: Sit In. Save Democracy. protest in Washington, District of Columbia - The police are arresting people now."},{"comment_id":"837415593047972","commenter_b":"what a lying hag she associates herself above everyone no matter color!!!!!!!","commenter_a":"Excuse me, is Hillary Clinton talking about humility ? - What a joke !","post_message":"Give me a break!"},{"comment_id":"10153093570621955","commenter_b":"Lying old hag","commenter_a":"The queen of the American Communist Party, oops, I mean liberals...","post_message":"WSJ: HILLARY TO ANNOUNCE NEXT MONTH..."},{"comment_id":"10153912277130329","commenter_b":"We should exile this dumb bitch to Syria!","commenter_a":"I rather vote for Kanye than for trump","post_message":"Kanye West revealed he would be running for president during last night's MTV VMAs."},{"comment_id":"10153715993757293","commenter_b":"Make it a felony to hire anyone illegal","commenter_a":"I've watched illegal immigrants take construction jobs from my fellow Americans for years. Build the wall.","post_message":"In a two-page memo to The Washington Post, Donald J. Trump detailed his plan to force Mexico to pay for a border wall"},{"comment_id":"799759520167266","commenter_b":"DONALD TRUMP IS NOT A RACIST HES HIRED ALL NATIONALITIES ALL OVER THE PLACES HE OWNS AND PAYED THEM GOOD AND WAS FAIR TO ALL OF THE PEOPLE WHO WORKED FOR HIM AND HE WILL DEFINITLY MAKE A GREAT PRESIDENT FOR US AMERICANS NO MATTER WHAT RACE THEY ARE ,WERE HILLARY COULD CARE LESS ABOUT US AMERICANS SHE JUST SAYS THINGS TO BLACKS OR WHITES OR ALL OTHER RACES TO GET VOTES JUST LOOK AT HER BACK ROUND AND WHAT DID HILLARY OR OBAMA DO WHILE THEY WERE IN THE WHITE HOUSE FOR US ABSOLUTELY NOTHING BUT BROKEN PROMISES AND THEY GOT RICHER WHILE WE GOT POORER","commenter_a":"HILLARY 2016...","post_message":"REPLAY: Donald Trump at a rally in Wilmington, Ohio."}]
