[{"comment_id":"10153199211227235","commenter_b":"Stupid bitch. Go read the Constitution you're currently wiping your ample ass with.","commenter_a":"Omg! Go away please.","post_message":"GOOD GRIEF!"},{"comment_id":"10152475655222434","commenter_b":"This has never happened at a Steel Panther concert, little disappointed. I'm an actress and I've had people fall asleep in the front row... That was pretty funny. Also Erica, if the band were that bothered by it, they would have got security to remove them from the venue","commenter_a":"Matthew Naughton","post_message":"This woman is what the kids would call \"punk rock.\""},{"comment_id":"847139551999340","commenter_b":"You can get rid of your living organism in your uterus all you want to and in 5 states up to 40 weeks. . It still doesn't take away from the fact that you chose to end this living organisms life. Basic biology hun","commenter_a":"Question: A six week old BABY and a six week old EMBRYO are about to be thrown from a very tall building. You can only save one. Which one would you choose?","post_message":"Isn't this amazing?"},{"comment_id":"659111814237594","commenter_b":"I hope you both get shot in the head!","commenter_a":"OMG! I can't believe I live in this country!","post_message":"All in the name of fighting tyrannical Obama and his assault on the Second Amendment. -- Robert"},{"comment_id":"10152920092525736","commenter_b":"Because I dive in pussy. No fecal flakes on my","commenter_a":"Because they know what they're doing is wrong & disgusting.","post_message":"41% of transgender people try to kill themselves, compared with 4.6% of the general public, according to a study."},{"comment_id":"10153564798429614","commenter_b":"Don't crucify this jesus but put his head on a rope and pull him on a tall tree. Hope am communicating?","commenter_a":"Another senseless act of violence, may the victims RIP","post_message":"Two parents were killed and their daughter wounded when they stopped to help a man who appeared to be having car trouble on a road inside a Montana reservation. When the family approached Jesus Deniz Mendoza, he pulled out a gun and ordered them out of their car, the surviving daughter said. He then told them to walk away from their car. As they turned to leave, the daughter heard a gunshot. She looked back and saw her father lying in the road, she said. The next shot killed her mother. The third shot hit her in the back. Mendoza said he the victims because he was getting tired of waiting around, and because the daughter laughed at him, the criminal complaint says. Read KTLA's story here: @webpagelink"},{"comment_id":"985973531519425","commenter_b":"All republicans should stand behind \"the people's \" choice!!!","commenter_a":"Who needs him I hope he gets fired","post_message":"What do you think? Is it too late? @webpagelink"}]
