[{"comment_id":"1118046224877704","commenter_b":"If her lips are moving SHE is lying!!","commenter_a":"looks like the daily shot of botox is overdue","post_message":"Mrs. Clinton is out accusing the Republicans once again of plotting voter fraud, and she is making this allegation in front of African-American audiences."},{"comment_id":"788216704618375","commenter_b":"Sure he is Jewish but how could a man of his intellect believe the cartoon that created this shithole country?","commenter_a":"Put on your yarmulka even though it's not Chanukah....welcome to Israel.","post_message":"Welcome to Israel, Jerry Seinfeld 😍😍😍"},{"comment_id":"1713613852259060","commenter_b":"a matched pair of idiots","commenter_a":"Ain't that the truth!","post_message":"Are you... KIDDING ME!? So sick of Barack Obama & Michelle Obama..."},{"comment_id":"10154238918214411","commenter_b":"truth hurts huh","commenter_a":"Republicans are nothing but Bible toting A HOLES who care nothing for other people you know that the party is a minority why you ask because the only way these jerks get elected is because of voter apathy if everybody would vote the Republican jerks would dry up and blow away","post_message":"Cheer up Republicans. The presidential race may be a mess, but you controlling state legislatures..."},{"comment_id":"10154662767663188","commenter_b":"Absolutely Michael! No Jake herrin Idiots like You are ruining this country!","commenter_a":"Sick of your BS Beck and I don't need your critique on any of this! He cleaned her clock and your whining butt just doesn't like it. If we lose this country it's because of idiots like you Beck!","post_message":"This was Donald Trumps best Performance in the debate. BUT remember the only goal is to ADD undecided voters. Charles Krauthammer just called Trumps performance Political Suicide. He is right. He was winning and then it began to break apart. They both have sealed their core long ago. Tonight was the last chance to bring the women that have been lost or questioning. Those Reagan democrats who worry about foreign policy, Russia or temperament. First 30 minutes were strong for him. He had some good lines and looked (at times) well informed. He had a great open borders section. While I cringed in the gun debate and abortion section. On the second Amendment Rubio, Cruz or almost any other candidate would have cleaned her clock when she spoke about 12 toddlers shooting people in DC. His pro choice response On partial birth abortion was the weakest I have ever heard. ..."},{"comment_id":"10153810770121336","commenter_b":"A woman who associates with a child abuser (most especially her own child's abuser) should not be allowed on television ! Creepy woman !","commenter_a":"Nope - why? She broke?","post_message":"Will you watch?"},{"comment_id":"1777641695853675","commenter_b":"Shirley Awalt Tuggle Check this out mama!","commenter_a":"Sidni Schneider Amber Kerstin Brown","post_message":"She's every inch a queen. Victoria, starring Jenna Coleman, Rufus Sewell, and Tom Hughes, premieres January 15th on MASTERPIECE | PBS. Watch a preview:"}]
