[{"comment_id":"10154187252849657","commenter_b":"You are a very, very, very silly little women with no wisdom at all, and I doubt you ever had any. You are to old to think the way you do with lousy liberal logic.","commenter_a":"What I do understand is this, man is supposed to be smarter now than then, but yet the present man cannot product a document like the constitution. Isn't it sad that they are trying to destroy it because man cannot write a constitution now. The reason they can't is because they are not GOD fearing, like the founding fathers were.","post_message":""},{"comment_id":"10153255366409205","commenter_b":"You still had a chance to recognize the genders and learned from them, yes you are lucky that child is not!","commenter_a":"Justice! How about the child? Without father and stock at the house with 2 mothers? What kind of justice is this. Most of us grow up with family mother and father on site and easy for u to say is justified!","post_message":"JUSTICE! Lesbian Couple Gets Their Child Back"},{"comment_id":"473460069511240","commenter_b":"Tell the goat F to get out of our country","commenter_a":"Kudos to you Clint Eastwood ... !!!","post_message":"Muslims want Clint Eastwood's head, but he's not backing down. This is outrageous, let's show him we have his back. Can we get 10,000 'LIKES' for Clint Eastwood?"},{"comment_id":"1870709889833499","commenter_b":"And what about those born with both genitals ?","commenter_a":"A person that has the female organ is female, and a person that has the male organ is a male, END OF THE CASE. Next please: ''The Kardashians Still Fighting Over a Pudding''","post_message":"Meet the cover girl who used to be a boy"},{"comment_id":"10154126600721770","commenter_b":"I agree....classy lady","commenter_a":"Ivanka could hop into a potato sack and make it look good.","post_message":"You couldn't miss Ivanka Trump today."},{"comment_id":"10153905060581051","commenter_b":"the house is full of fuckin whores,stop the bullshit,do something for the ppl that sent your sorry asses up there.","commenter_a":"they cannot help themselves... how bout investigatin' some jobs fellas","post_message":"House leaders officially filed a motion today to investigate Hillary Clinton for lying under oath to the FBI. Do you think she's guilty?"},{"comment_id":"961665563922802","commenter_b":"Lady, stop proving your ignorance","commenter_a":"if its a fairy tale explain how what and when where we got on this planet? we are aliens for god made us in his image not a fairy tale i have seen too much that i cannot explain that was unnatural to the human eye not to know its a fact there is a god and angels to go along with him so they should just wake up and smell the coffee","post_message":"Well.... this could put a damper on the tent revival."}]
