[{"comment_id":"1112602185474010","commenter_b":"FFFFFFFFFFFFFFFFFFFFFF trump he is a orange bigot! #Ftrump","commenter_a":"trump 2016","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."},{"comment_id":"552998604866610","commenter_b":"How dare you sir!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Another \"unverified story\" from Dr. Carson. Reporters visited the library and the librarian at the desk does not recall the event at all. Never happened! Carson lied and people died!!!","post_message":""},{"comment_id":"10153238274816107","commenter_b":"Counseled women*","commenter_a":"Thank you Rand! The only one who stands for the people!","post_message":"Thanks to your continued pressure, this morning I'm pleased to announce that I've secured a commitment to have a vote on my bill to defund Planned Parenthood before the August recess! I pushed hard all weekend long to vote on defunding Planned Parenthood. My campaign sent out millions of emails mobilizing patriots like you to join this critical fight. It worked. I believe right now you are seeing the impact one man who's willing to stand for something can make in Washington, D.C. with the backing of millions of good folks like you. But now our job gets even tougher. Please call your U.S. Senators at (202) 224-3121 and insist they \"Stand with Rand\" and vote for my bill to defund Planned Parenthood. And please let me know you've got my back by adding your name as a Citizen Co-Sponsor: @webpagelink"},{"comment_id":"821054791362772","commenter_b":"Keep your smug ass out of Texas !! YOU are NOT wanted here !!!","commenter_a":"Barff, She is in it for Hollywood, Wall Street and anyone with money who dumb enough to fall for that LIAR THIEF, DOUCHBAG!!","post_message":"This has to be said. Last night AP declared Hillary Clinton had garnered enough delegates -- by way of super delegates -- to secure the Democrat nomination for president. Everyone is expressing how this is a great historic moment. I agree, it is a historic moment. The new American Socialist Party, once known as the Democrat Party, now has a sitting president and a nominee for president who abandoned Americans to die and lied about it. And to all the detractors who would dismiss this, just think about the mother of Sean Smith widow and orphaned child of Tyrone Woods.and the families of Ambassador Chris Stevens and Glen Doherty. This is not a historic moment for them. It is an indictment of how America rewards the most despicable and abhorrent behavior. This is a sad day for our America -- well, at least for the mindless Kool-aid drinking sycophant followers ..."},{"comment_id":"588768447914861","commenter_b":"Good night bitches","commenter_a":"Well if ur dumb enough to punch urself in the face then ur dumb enough to not know Trump is the MAN and Hillary needs to be hung for treason and letting our people die in Bengazi","post_message":"For those who missed: @webpagelink"},{"comment_id":"1278741865525899","commenter_b":"@username dese bitch jam cuz","commenter_a":"🤘🏼OUS🚀ON","post_message":"Slim Thug's new joint \"King\" off the new album, \"Hogg Life, Vol 4: American King\"! #WSHH #SlimThug #Exclusive"},{"comment_id":"1354769341225150","commenter_b":"How'd you like this one -60% of the USA. illegal population resides in the Golden State. That is one of many reasons why our politicians support this crap! Frankly, that is one reason why our state taxes are incredibly high and the other is bad management without accountability. We also have a disproportionate amount of refugees getting relocated here and illegals residing in our prisons.","commenter_a":"Californians are beyond reasoning!!! They refuse to obey a national law on harboring illegal aliens, and yet have the gall to ask for funding to support those illegals they are harboring!!! NO FEDERAL FUNDS SHOULD GO TO CALIFORNIA UNTIL THEY DEPORT THE ILLEGALS THEY ARE HARBORING!!!!!","post_message":"I can't believe they asked for THIS!"}]
