[{"comment_id":"10154218056967439","commenter_b":"The ones in the Muslim communities that haven't done anything are still in Stage 1......just wait until they move to Stage 2 & 3....it is in the Quran: @webpagelink","commenter_a":"Cameron what a d-------","post_message":"And do what exactly? Convert? Christianity is not the problem. How many murders, attacks etc will it take for these craven quisling to realize their appeasement and submission is not working? UK PM Cameron: \"Our brothers and sisters who are Muslims, they want our assistance.\" Uh, no they don't."},{"comment_id":"892166267491828","commenter_b":"Why always Iran?","commenter_a":"Erdogan is a disgrace to Turkish people.","post_message":"Iran has summoned Turkey's charge d’affaires to hear Tehran's protest against Turkish President Recep Tayyip Erdogan's “improper” remarks regarding the Islamic Republic's alleged regional ambitions. Read more: @webpagelink"},{"comment_id":"10157734459025354","commenter_b":"Bill can't wait to be in Las Vegas were the hookers are like running water! I did not have sexual relations with those hookers!","commenter_a":"The real deplorables are the 40 something % of true idiots that are still backing the Clintons- Trump people are fed up taxpayers-","post_message":"If she's \"feeling great\" as Team Hillary claims, why isn't she campaigning? What is going on? And why can't these two ever tell the truth?!"},{"comment_id":"10153520838606051","commenter_b":"She needs to go to prison, too. Hope they sterile her so she can't bring anymore babies into this world for her husband","commenter_a":"Your husband should be on death row, and never see the light of day. To murder an innocent baby shows the cowardice and evil in his heart. He can't be allowed to live...he's a threat to society. One question...how can you defend his actions? He MURDERED your BABY...absolutely disgusting, both of you.","post_message":"This woman's husband was fed up with his son crying so he hit him so hard that it killed him. Now, she has one message for all the people criticizing her husband."},{"comment_id":"10157519592720206","commenter_b":"Lol You're aware this is in America. Not illegal here.","commenter_a":"It's actually illegal for major super markets to charge for a plastic bag because for example say tescos they can't charge you because your advitizing tescos through the bags also store laws are to provide bags for customers not well not sell them to us","post_message":"Get ready to pay 5 cents for a plastic bag."},{"comment_id":"872561492840104","commenter_b":"Just STFU!!!!","commenter_a":"You know he's an imbecile when he says the president should b e like a rapist,drugger of the unsuspecting; Bill Cosby","post_message":"\"America's Mayor\" wades back into the fray."},{"comment_id":"10153784576082439","commenter_b":"Yes nazi ideology wasn't rooted in Christianity , any person watching the military channel knows that, they were obsessed with the occult . I believe Islam , and I'm not alone is the new nazi. Same crap Nazis spewed, we are peaceful, trust us . But worse , almost all western leaders except Putin and couple Baltic states are not buying it . You'll see, next world war will be because of Islam","commenter_a":"We are doomed. I'm hoping I get cancer and die before Muslims raise the Isis flag at the Whitehouse, I'm a vet and will for go my veteran cemetery burial as Muslims will dig us all up, toss us aside and build mosques on these honored hallowed grounds!","post_message":"Anywhere American mores and law conflict with Islamic law and supremacism, it's American mores that must give way. Ripping out pews? It's sacrilege."}]
