[{"comment_id":"10155998790520294","commenter_b":"No!!! I'll pass on swimming in everyone's pee and who knows what else lol. Germ infestation!","commenter_a":"I want to do this","post_message":"Would you take a ride on this 800 foot water slide? A few thousand people in Akron are!"},{"comment_id":"1322497724487878","commenter_b":"Lolololol congratulations trumplinas, you played yourself","commenter_a":"It's going to be just like the wall. Everyone will have insurance but you have it pay for it now and somehow we will be paid back later.","post_message":"He says all Americans will be \"beautifully covered.\""},{"comment_id":"586880071512025","commenter_b":"How about all the hate crimes and murders committed by Muslims? Islam is pure evil. So is Obama & Lynch.","commenter_a":"How many Americans were either killed or injured by Muslims in 2015??????","post_message":" is a pernicious thread that connects the act of violence against a woman wearing a hijab to the assault on a transgender man to ...\""},{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"},{"comment_id":"1229197387109219","commenter_b":"Putin to Obama stop protecting Muslims I know Putin he is insane. What do you want from 1st a Muslim then a racist 1/2 black 1/2 white that own family owned slaves. And a bi sexual with a jar of Vaseline in his side table","commenter_a":"And so how is this different from supporting Israel which is pro-pro abortion? How does the GOP electorate square Israel's pro-abortion record with U.S. Southern Christian position on abortion? @webpagelink","post_message":"\"If I told you in 2008 that Barack Obama would negotiate a deal that he acknowledges will fund terrorism, you'd have thought me a conspiracy theorist.\""},{"comment_id":"1903950129833878","commenter_b":"@username It was stolen! Putin and Trump stole the election, doesn't your little brain understand this. A foreign dictator stole our election so that this con-man could be manipulated by an evil russian. Read!!","commenter_a":"Then come on Democrats, let's shut down America! Trump cannot make it to the White House!","post_message":"No doubt! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154286126010326","commenter_b":"Hillary was lost in the past , she didn't care about the milleniels and helped destroy the base. Bernie is the future and was ignored by the filthy rich who are more Republican like than ever. Republicans were endorsing her.","commenter_a":"Eyes on the prize folks. Blue is going to be a tag team extraordinaire. We know the goal, it's not about who is the leader, it must be all of our blue and all of us.","post_message":""}]
