[{"comment_id":"10154905567876336","commenter_b":"Ok, time for a bragging rights bet: First, it was \"racist and sexist white males,\" then \"fake news,\" and now the Russians. What do you think next week's excuse is going to be from the Dems as to explain Hillary's loss? Aliens? The cast from Duck Dynasty? My guess is that they will say Trump flew in the Aghori Monks, a modern day Monk Order from India that practices cannibalism, to scour the US and feed on Democratic Voters as to deter turnout.","commenter_a":"She lost because she is implicated in so many lies and scandals nobody has time for that.","post_message":"\"The Russians didn't elect Donald J. Trump. America did.\" Today on \"Cashin' In,\" Eric Bolling slammed anti-Trumpers who are searching for excuses as to why Hillary Clinton lost. @webpagelink"},{"comment_id":"10154189944991320","commenter_b":"NO WHITE PEOPLE DO THIS...BLACK AND LATINO....NO CHINESE....NO IRISH....NO ITALIANS.....NO GERMANS....NO SWEDISH...... NO LATVIANS.......BLACK AND HISPANIC PIECES OF S..T","commenter_a":"Try Linden Blvd. and Pennsylvania Ave.","post_message":"The NYPD made its inflexibility clear, dirt bikes and ATVs are illegal in the city, break the law and arrests will be made and the seized vehicle will be destroyed. @webpagelink"},{"comment_id":"10153079527196051","commenter_b":"Darwin Award!","commenter_a":"The boy appears to be under the influence.....too bad.","post_message":"This girl thought it would be fun to take selfies while she and her boyfriend were driving. This is what they looked like before the crash. Now check them out after."},{"comment_id":"1982433335149738","commenter_b":"Beyonce is good in showing off her booty and that's about it .","commenter_a":"Agreed with Santana. Her performance was too visual artistic and address to a very narrow audience....it was not too much a vocal challenge or a singing performance in the true sense. This characterize her style over all.","post_message":"Carlos Santana: Beyoncé is not a singer, with all respect to her"},{"comment_id":"10156129057215389","commenter_b":"Uhh...nope!!!...I was born also...but not today!","commenter_a":"Yes, it might cost her a lot like not greeting to be president.","post_message":"Question of the Day: Do you believe Hillary Clinton is really sorry about her server scandal?"},{"comment_id":"10154451087971756","commenter_b":"@username That's exactly the kind of response I would expect from a feminist... You don't want to do any of the heavy lifting. There's no reciprocation on the part of feminists because they only care about themselves. Even if I did respond how you wanted, you wouldn't address any of my points and simply make ad hominem attacks. That's all you people are capable of because you have no critical thinking skills.","commenter_a":"To the men commenting on this post that are shaming other men for being feminists: shame on you. You are just proving the very reason why we, as males, have much to benefit from feminism as well","post_message":"The male activists all face roadblocks. Other men might think it's strange for guys to talk about sexual health in public. Women sometimes resent the idea of men offering them information about their bodies."},{"comment_id":"10153615779772452","commenter_b":"Fake IDs are already illegal. It's a third degree felony.","commenter_a":"17 and in a nightclub? Maybe now we should BAN fake ID'S. Should of never been there!","post_message":"One of the youngest victims of the #OrlandoShooting was 18-year-old Akyra Murray, a recent graduate of West Catholic Preparatory High School in Philadelphia. She graduated third in her class just last week. She was in Florida to celebrate her graduation and visit her brother."}]
