[{"comment_id":"10153014667776955","commenter_b":"I lived in NY, not the first blizzard or the last...whats different now is the libtards have forced energy production to stagnate or decline while the population increased - aka people are going to freeze to death in their own homes. This is just nature being nature. Lets not make something out of nothing.","commenter_a":"Good place for it.","post_message":"BLIZZARD WATCH NYC, BOSTON HISTORIC"},{"comment_id":"10153782670984838","commenter_b":"Then why are they acting like children when they run around sleeping with random people getting pregnant when they don't want a baby in the first place? So yes those women are children since they don't know how to have safe sex.","commenter_a":"Absolutely ridiculous!! Women are not children.","post_message":"A bill that would impose a 24-hour waiting period on women seeking an abortion is headed to Republican Gov. Rick Scott."},{"comment_id":"10154189776881130","commenter_b":"I'm ready, bitch.","commenter_a":"Not reading the article--no time for it. But to pass along, a commentator on CNN today said that the Clintons operate from a stance of self - righteousness, thus they cant see what they're doing is oh so wrong. Hit it on the head! Two major party candidates, to major flawed choices!","post_message":"If Hillary Clinton wins in November, brace yourselves."},{"comment_id":"1182026965223689","commenter_b":"Those Redumblicans are getting worse everyday!","commenter_a":"He deserves what he got !","post_message":"Here's some more of those \"family values.\""},{"comment_id":"1010634062332044","commenter_b":"They are illegal they deserve nothing.","commenter_a":"Obamina will destroy America before he/she lives the building ,unless you beat him to it","post_message":"ENTITLED ILLEGALS: It Now A Crime To Deny Illegal Aliens Tuition Benefits That Most American Don Get @webpagelink"},{"comment_id":"10153597568671770","commenter_b":"What is different with her from other females?","commenter_a":"Wonder what his wife thinks about that . He just wants attention . Think he is obsessed with Taylor !!!!! Or just trying to piss you off .","post_message":"She is mad..."},{"comment_id":"10152847470758869","commenter_b":"that's pure BS... ok, Stewart is above the silly vampire stories here, but Binoche is one class above her throughout the film ... and in general","commenter_a":"I haven't seen the film, but I highly doubt that Binoche is nondescript: her screen 'presence' is astounding.","post_message":"“It is [Stewart], rather than Binoche, who lingers in your mind when the film is over.”"}]
