[{"comment_id":"1073645179326169","commenter_b":"^^^boom^^^","commenter_a":"Christian's don't commit Adultery Hypocrites Do God is Revealing what is done in the Dark. Nothing is hidden from God","post_message":"DEVELOPING: Possibly Millions More Christians Have Committed Adultery Using Ashley Madison Than Previously Thought. #FallingAway #AshleyMadison"},{"comment_id":"10152808314825736","commenter_b":"Hope everyone has their General Lee from \"The Dukes of Hazard\" cause you can't buy one from amazon, ebay or etsy now!","commenter_a":"Confederate flags have just become collectable.","post_message":"More retailers, including Amazon and eBay, joined Walmart to remove rebel-flagged items from their shelves and websites."},{"comment_id":"10155216029445500","commenter_b":"Coyotes are indigenous to our state all states. They were driven put west because of our industrialization. Now they have learned how to co- exist with man and have migrated to the east again. Warning - maybe coyotes will make owners stop using this awful leashes the retract and maybe we as a society will begin to respect all animals better . Coyotes are as afraid of is as we are of them bit put a tractable leash on a small dig ad watch an eagle , hawk or coyote take it. Adjust your human responses and behav avoid","commenter_a":"The.coyotes have a human problem. Keep your pets inside. We were the ones who came and stole the land they called home. You have to attempt to keep in mind they are there and adjust a little","post_message":"HEADS UP: Pasco residents say coyotes wandering the streets have been killing their pets. It's almost \"pup\" season, so they travel and hunt more. Here's what you should do if you see a coyote: @webpagelink"},{"comment_id":"10150959655894999","commenter_b":"f you want a president that - Is a dictator above the law criminal who controls the brainwashing media and FBI Starts a war with Russia, China, Syria because they're not part of NEW WORLD ORDER - Can't be trusted to protect the security of our nations borders, classified information, or lives of our ambassadors and spies - Opens door to Jihad Terrorism and rape culture while our veterans sleep in the streets - Take away your right to protect yourself with a gun from her Isis soldiers she and HUSSIEN created and brought in. - Sells your country to your enemies and gives your enemies nukes - Raise taxes and enslave us while paying our enemies billions - Steals from her charity - \"Loses\" 6 billion of your hard earned taxes money - Defends rapists and bullies the victims - Brainwashes her followers to attack \"deplorables\" and starts fights ...","commenter_a":"I hope you guys will vote for Jill...","post_message":"Our photographers are sharing Election Day scenes from Manhattan, Miami and polling sites across the country. Follow along here: instagram.com/nytimes"},{"comment_id":"10154090150895329","commenter_b":"OMFG she's such a bitch...","commenter_a":"@username STRUGGLE SO REAL","post_message":"\"I will bleed on everything you love.\""},{"comment_id":"10154278344319497","commenter_b":"Also @username","commenter_a":"Melissa Tim @username","post_message":""},{"comment_id":"10152963839226051","commenter_b":"What is going on with these ungrateful wretches. They act worse than animals.Shut down the frat houses, they are all acting disrespectful","commenter_a":"cut their dicks off the young punks.","post_message":"Things just went from bad to worse for the frat boys who spit on wounded veterans and their service dogs before urinating on the American flag."}]
