[{"comment_id":"10152896761617293","commenter_b":"and the mob was mad when he called thm out too .... NEXT!! -","commenter_a":"Nothing like calling them as he (and most of the rest of the world) sees 'em!","post_message":"\"Currently, an evil front is being formed against us,\" he said. \"Now the pope has joined this conspiracy.\""},{"comment_id":"10153703339506509","commenter_b":"Hillary will be in jail before she ever becomes president!","commenter_a":"the entire republican party is a joke","post_message":"Rick Santorum officially announces that he's running for president. @webpagelink"},{"comment_id":"1230028840342704","commenter_b":"Not fit to be president. A witch","commenter_a":"From all accounts....Killary Rotten has one of the filthiest mouths in DC. She calls people nasty names and acts like she is insane...which she is. This is what she thinks of everyone in America....she is trying her best to fool as many as she can though.","post_message":"Is Hillary Clinton really a cold-hearted [expletive]? You won't believe her explosive fits of rage, even making her husband Bill bleed, as her astonishing vitriol has just gone public"},{"comment_id":"10154156141525470","commenter_b":"Just have her carry bacon with her if she's in one of those \"gun-free\" zones.","commenter_a":"Wow! How scary is that! Pray to keep this family safe.","post_message":"A St. Louis area woman who is reportedly on an ISIS hit-list said an FBI agent came to her home and told her to “arm up” because she is a potential target. A Special Agent with the FBI on Wednesday came to April Agers’ front door, knocked and delivered the startling news. Agers is on an ISIS hit-list."},{"comment_id":"645397708975441","commenter_b":"Wow, does he have any world facts available to him?","commenter_a":"My 15 year old answered the question","post_message":"This is just laughable."},{"comment_id":"10153611687931602","commenter_b":"And the fact that a grown woman liked it is equally disgusting. Grow up","commenter_a":"You know who also spoke his mind? ... Hitler.","post_message":"\"Trump? I love everything about him,'' said one voter. \"He speaks his mind and doesn't care if he offends anybody. He's saying, 'This is who I am — take it or leave it.'\""},{"comment_id":"10156915494530231","commenter_b":"Black woman=weapon of black mass destruction. -END","commenter_a":"Yeah, this dude SHOULD NOT marry you. If you're more concerned about him spending thousands of dollars on some stupid ring (a token of a totally outdated custom that was invented by DeBeers in the first place to sell diamonds that Africans have to DIE to mine) then you are with your relationship -- he should look elsewhere for someone who isn't a shallow golddigger.","post_message":"Here are a few tips if you find yourself in this situation. #AskDemetria"}]
