[{"comment_id":"943402869028468","commenter_b":"It is only because all the other politicians want illegal's here. Trump is watching out for the American People!","commenter_a":"It's being said that Mr. Trump is causing problems for the GOP; taking votes from the others. BS! I'm Indy/democrat, and trust me, I'm voting for Mr. Trump! Any other Indy/democrats doing the same?","post_message":"BREAKING"},{"comment_id":"10154341575671729","commenter_b":"Not a charge will be brought against this bitch","commenter_a":"How much worse does it have to get? Will a corrupt government be able to bury all the evidence? If Hillary survives the latest, democracy is finished.","post_message":"The hits just keep on coming..."},{"comment_id":"1346170432096021","commenter_b":"@username What makes you think it's civilized? Is it the fact that mankind is about to lose it head (literally) to religious beliefs by people that still throw stones and rape like cavemen! I see your education come from ''acadamia\"! Which is also still in the dark ages!","commenter_a":"@username Nutt, a researcher at Imperial College, had to crowdfund this LSD study. He calls LSD research \"the worst censorship of science there has ever been.\" Read more: @webpagelink","post_message":"For the first time ever, scientists scanned a brain on LSD using modern technology. What they saw was a more \"unified brain.\""},{"comment_id":"1043155299071968","commenter_b":"She is disgusting.","commenter_a":"She's scummy just ignore her 5% I Q","post_message":"JENNIFER LAWRENCE Recalls Attending Same Concert As Trump: “I was adamant on finding him and then making a video of me going, ‘Hey Trump, f*ck you!’” [VIDEO]"},{"comment_id":"555451794642427","commenter_b":"About 40% of the nation supports Drumpf. The educated States should secede from the Union - ignorant racist are a cancer that needs to be excised.","commenter_a":"Suicide by obstructionist behavior.","post_message":"A lot of discussion has centered around the fact that we might be witnessing the death of the Republican Party. What would that look like?"},{"comment_id":"1473072332752510","commenter_b":"@username So do God Almighty, do you have a problem with Him also taking care of them? When you stand before Him on JUDGMENT DAY, you are going to be sorry you didn't do anything to help them also. Because God Almighty said, TREAT THEM WITH KINDNESS AND AS A NATIVE (meaning CITIZEN) BORN IN YOUR LAND. I WILL DESTROY ALL WHO TURNS AWAY AN ALIEN(illegal immigrants). I guess your behind is going to FRY big time come JUDGMENT DAY.","commenter_a":"The kids look healthy and happy.. And she taking care of them that's all it matters.","post_message":"EXCLUSIVE: 'I had to kill Octomom to save my life.'"},{"comment_id":"10153104771426051","commenter_b":"That woman is whack a doodle!","commenter_a":"Get a real life.","post_message":"This mom took one look at her daughter's Christening cake and immediately demanded an apology from the cake shop."}]
