[{"comment_id":"10153221007429575","commenter_b":"Lmao. Guess who isn't surprised. I just wish I was there. There'd be holes in some stupid flat brim hats.","commenter_a":"Where's Jackson? Where's Sharpton? Where's Eric Holder? Where's the NAACP? Where's the constant 24/7 national news coverage? Oh wait, the attackers were black and the victims were white? Well in that case, move along, no big deal, nothing to see here.","post_message":"\"Their children and grandchildren were running around while we were fighting and they don’t know what’s going on and there’s blood everywhere.\" A party at an Ohio Chuck E. Cheese's got out of control after the store manager told guests the photo booth wasn't working."},{"comment_id":"10154066613342908","commenter_b":"It already IS that way. I'm all for him too, but he's big moneys' worst enemy.","commenter_a":"Tell 'em like it is, Bernie!!!","post_message":""},{"comment_id":"10155205853325354","commenter_b":"She is on the chunky side. Normal for someone that does little exercise, like most @username women.","commenter_a":"ummmm Thats what we call a plus size!!???? NOT a plus size but a normal..average..healthy beauty...","post_message":"Plus sized? Weigh in with your thoughts."},{"comment_id":"10155487456986509","commenter_b":"Hillary is a baby killer.","commenter_a":"He was completely right on everything he called a disaster. The biggest disaster of all was the video proving that she and her campaign incited the violence at his rallies. Perhaps using the word rigged is an oversimplification, but for Christ's sake, she's guilty if inciting riotous behavior. Vote Trump, as middle finger to the corruption in government.","post_message":"- Aleppo - Hillary Clinton's tax plan - Obamacare ...and more things that Donald J. Trump called a \"disaster\" at the final #debate. @webpagelink"},{"comment_id":"1272205819459623","commenter_b":"Trash. Sex film that she herself leaked and a nude photo? No!","commenter_a":"I agree with Bette Midler for once.","post_message":"\"Kim Kardashian tweeted a nude selfie today. If Kim wants us to see a part of her we've never seen, she's gonna have to swallow the camera.\" - Bette Midler"},{"comment_id":"10153891492220575","commenter_b":"A DISGUSTING IDIOT RACIST TRADER WOMAN","commenter_a":"WHO HIRED HER RUBIO OR CRUZ?","post_message":"Surprise! So-called \"Trump supporter\" is a far left Union activist!!"},{"comment_id":"511283065698315","commenter_b":"But she looks like she has taken lots of dicks in her ass/mouth then made out with you","commenter_a":"But he will walk away with no punishment because USA is Saudi arabias little bitch","post_message":"That's a lot of drugs."}]
