[{"comment_id":"10154380784584877","commenter_b":"And this lady is Exhibit A.","commenter_a":"Maybe way back in the day... Im not trying to be funny but women of a certain background look good till about 35 and then start to look haggish","post_message":"People are still coming out of the woodworks to stake their claim on Prince's estate."},{"comment_id":"997862486926485","commenter_b":"She also set up a GoFundMe account. It's a publicity stunt to make money. She's a nasty person","commenter_a":"She showed she had class. Love this story.","post_message":"Two women called this mom a \"whale\" because of her size, what she did next is truly remarkable: @webpagelink"},{"comment_id":"1122482747785208","commenter_b":"Nice fat white chick.....the black man's kryptonire....","commenter_a":"\"He shouldn't be golfing he should be working. How dare he.\" Sincerely, Everyone who didn't care when GW Bush did the same thing while he was in office.","post_message":"WATCH: President Barack Obama sinks 40-foot chip shot on 18th hole while on Hawaiian vacation: @webpagelink"},{"comment_id":"10153292448497235","commenter_b":"Dear, ditzy Megan does her best to serve her corporate owners and their agendas. Sorry, that leaves no room for accurate reporting.","commenter_a":"Never liked Kelley she lies all of the time. Looks so smug.","post_message":"\"Fair and Balanced,\" huh?"},{"comment_id":"822069341254814","commenter_b":"Two egocentric over weight idiots !","commenter_a":"The best news I have heard for I would have voted for Christie and Trump I know can get us back on track for our money and bill problems. way to go Christie hope you make vice President what a great team you two would make for America.","post_message":"Thank you Governor Chris Christie! It is time to MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153221093818433","commenter_b":"Yeah, because the media doesn't owe Mitt Romney and his family an apology....","commenter_a":"Expose the liars. I am glad he did it!","post_message":"\"I had a mission,\" Pfeifer said. \"I am sick of reading bull- - - -. I am sick of lies. I am sick of people’s lives being destroyed.\" ow.ly/MnI5N from PunditFact"},{"comment_id":"10153425462103271","commenter_b":"When is she to be put in a mental institution for the rest of her life, if I had a family member killed I would come after her, she is probably in hiding by now. If a woman wants an abortion THAT IS HER RIGHT TO DO SO.","commenter_a":"This is how far out these repubs go to make themselves look good to their GOP base.","post_message":"WEIGH IN: In a Facebook post, JoAnn Windholz calls Planned Parenthood a \"culprit\" and \"the true instigator.\" Read the full statement. Your thoughts?"}]
