[{"comment_id":"10154876629414411","commenter_b":"Ĺol Canada doesn't care. Second biggest land mass on Earth, only 40 million people live here. We will put all the Americant's a few hundred km north west of Alaska. Enjoy the polar bears bitches.","commenter_a":"Please send him to Mars! We Canadians don't need this dickhead in our beautiful country...","post_message":""},{"comment_id":"10154317818991336","commenter_b":"F*** Donald Trump's daughter she a hoe and she look like sid from the ice age BOIIIIIIIIIIIIIIIIII","commenter_a":"The one Trump said he'd sleep with if she wasn't his daughter . What a sick disgusting man","post_message":"Ivanka Trump is a natural!"},{"comment_id":"10153580091211601","commenter_b":"This Bit*h has a special place reserved for her in hell.","commenter_a":"HELL IS WAITING FOR HER","post_message":"In a Washington Post feature on Planned Parenthood, Cecile Richards, President of the nation’s largest abortion chain, says every abortion restriction in this nation must be challenged and removed."},{"comment_id":"1369207093090488","commenter_b":"The woman is pure evil","commenter_a":"It's time for women to shine, it's Been over due. I'm so proud a women is going to be the next President of the United States 2016 for the 20th century","post_message":"LIVE: Democratic Presidential nominee Hillary Clinton speaks at Democratic National Convention."},{"comment_id":"10153477964755575","commenter_b":"I'm in true awe at how people react to situations. I am physically sick at what these murderers are doing and GETTING AWAY WITH IT. What kind of people are we to sit back and let the government ruin our lives. You saw, as Americans, how much power we have when Megyn Kelly attacked Donald J. Trump. Why aren't we furious about ISIS and demanded our government eliminate them all. obama has done an excellent job on turning American people against one another an will continue to do so as long as WE allow it. Its time people. Stand up and voice your opinion and tell obama that this is WRONG. WE have the Power......Use it.","commenter_a":"This crap needs to be stopped, let the Marines do it...","post_message":"The Gateway Pundit - ISIS Kidnaps Priest, Kills Him, Cuts Him into Pieces, Packs Him in Box and Sends Him Back Home"},{"comment_id":"10153147282168701","commenter_b":"Shut up Leah Jesus Christ.","commenter_a":"GUILT BY ASSOCIATION! I GUESS IN AMERICA YOU CAN BE HELD RESPONSIBLE FOR WHAT OTHERS DO, I THOUGHT YOU WHERE INOCENT UNTIL PROVEN GUILTY, BUT THE WHORES OF SOCIETY-AKA THE NEW STATIONS, REPORTERS, OREGONIAN, HAVE TRIED, COVICTED, AND SENTENCED A MAN FOR CRIMES HIS GIRLFRIEND COMMITTED, SOME PRIOR TO THEM EVEN MEETING BUT SOME HOW IT IS HIS CRIME, SHAME ON YOU WHORES!!!!","post_message":"Here's the full resignation letter from Gov. John Kitzhaber, who says: \"I understand that I have become a liability to the very institutions and policies to which I have dedicated my career and, indeed, my entire adult life.\""},{"comment_id":"10155182405833984","commenter_b":"The only sane thing this woman has said in years","commenter_a":"YES !!","post_message":"Nancy Pelosi just dropped a lot of jaws with what she had to say about impeachment. Donald Trump will definitely want to hear about this..."}]
