[{"comment_id":"1694550140816786","commenter_b":"Misogyny!... misogyny everywhere!","commenter_a":"RIP, Chyna. But in your next life don't be a wrestler and a pornstar. Two terrible choices for a woman.","post_message":"She was known as the \"Ninth Wonder of the World\". #RIPChyna"},{"comment_id":"1156100184429437","commenter_b":"This woman is for Trump","commenter_a":"It was really disgusting watching how Fox News joined the rest of the \"Left-stream\" media last night in savoring Ted Cruz's Wisconsin win. Megyn Kelly & co. continually dissected the voters by pointing out that \"Trump was losing the appeal of woman voters.\" \"That Wisconsin voters were educated and paid very close attention to details!\" How sad. Never in my life have I witnessed how the GOP could deliberately try & take down one of their own while leading the attacks against Mr. Trump in their on-going crusade \"to stop Trump!\" This is very disturbing. Cruz and that nasally annoying voice of his was carrying on as though he transformed this presidential race when in fact it was Mr. Trump who initiated the anti-establishment hostility from the moment he threw his hat in the presidential ring. Cruz is a GOP plant as is Kasich.","post_message":"THE EXPANSION OF TERROR is so much worse than what we'd like to admit, a new report out of the EU confirms: @webpagelink"},{"comment_id":"10153163216675950","commenter_b":"What...like it's hard?! #illegallyblonde","commenter_a":"This nonsense is in the same category as the Nobel Peace Prize nonsense. Victory is awarded by decree. Neoliberals in higher education are waging an aggressive campaign to destroy meritocracy.","post_message":"\"There are few teams we are prouder of having lost a debate to than the phenomenally intelligent and articulate team we faced this weekend,\" students on the Harvard team wrote."},{"comment_id":"1766432363594674","commenter_b":"hillary a rothchilds criminal, she has already been selected months ago to be president all the sheep fall for it, see how the rothchilds find it easy to fool the easily lead with their controlled media","commenter_a":"Typical politician, first it's \"I didn't lie,\" then when the evidence piles up her statement quickly changes to \"I misspoke.\" Well, when you put it that way, I suppose you get a free pass...","post_message":"\"So I may have short-circuited it and for that, I, you know, will try to clarify because I think, you know, Chris Wallace and I were probably talking past each other because of course, he could only talk to what I had told the FBI and I appreciated that.\" - Hillary Clinton"},{"comment_id":"10155094693558628","commenter_b":"Yes! Illegal is illegal. He is enforcing laws that have been ignored far too long! If they want to be here then do it the right way and not look to us to support them!!!","commenter_a":"No","post_message":"Like Opposing Views for more!"},{"comment_id":"10154939979936729","commenter_b":"she belongs behind bars","commenter_a":"Hillary Clinton goes to a gifted-student primary school in New York to talk about the world. After her talk she offers to answer questions from the kids. One little boy puts up his hand. Hillary asks him what his name is. \"Kenny,\" he says. \"And what is your question, Kenny?\" she asks. \"I have three questions,\" he says. \"First -- what happened in Benghazi? \"Second -- why would you run for president if you are not capable of handling two e-mail accounts? \"Third -- what happened to that six billion dollars that went missing while you were Secretary of State?” Just then the bell rings for recess. Hillary tells the students that they will continue after recess. When they resume Hillary says, \"Okay, where were we? Oh, that's right, question time. Who has a question?” A different boy -- little Johnny -- puts his hand up. Hillary points to him ...","post_message":"Yes. She. Did."},{"comment_id":"10153440735091130","commenter_b":"We don't want to hear any more about this ugly, perverted, faggot drag queen.","commenter_a":"Done w Huff Post","post_message":"Stunning!"}]
