[{"comment_id":"10154299169246051","commenter_b":"@username u would suck D. Chump dick if u had a chance. What a brain dead sheep u are.","commenter_a":"He's being practical. People were thinking it would be like the Great Wall of China, not realistic. He's still going to protect the country and secure the borders.","post_message":"Donald Trump just announced his giant wall isn't happening after all - and the reason has people outraged."},{"comment_id":"10153414800625933","commenter_b":"Liars make me sick.","commenter_a":"John, you seem very busy these days, but who is governing Ohio at this time? Do you plan to reimburse the Ohio tax payers ? That would be the right thing to do . You have been eliminated for months. Get back to making Ohio great. Do the job your being paid to do.","post_message":"Let’s Get It Done."},{"comment_id":"10154081618264087","commenter_b":"There's nothing wrong with her we all saw her open a jar of pickles","commenter_a":"Selfish move since her so called Pneumonia is very contagious . She was in a crowd, she hugged a small child. Not a good thing when you have Pneumonia.Just another lie, how can you believe anything the Clintons or their Clown say.","post_message":"\"I think it shows that she's not one who likes to call in sick.\""},{"comment_id":"10155355195265354","commenter_b":"At least she kept it in country","commenter_a":"Hillary has went to panic mode dragging old hack Carville out, he's been out of it for a long time. Selling snakeskin boots an alligator hats now days. Back on Hillary payroll with a bunch of brand new excuses and lies.","post_message":"WATCH: James Carville Accidentally Admit Hillary Clinton Tried to Evade Congress With Secret Email #Oops!"},{"comment_id":"1786349714946678","commenter_b":"Lol! She is a lunatic!","commenter_a":"She is a racist huh?","post_message":"Former Arkansas Gov. Mike Huckabee asked Monday if House Minority Leader Nancy Pelosi is racist after she said Housing and Urban Development Secretary nominee Ben Carson is \"disturbingly unqualified.\""},{"comment_id":"1257226684318485","commenter_b":"Thank god Hillary did not get in she is to dangerous to our constitutional rights. And you know nothing of our constitution or you would know how dangerous Hillary really is. I don't think anybody that is not a American has a right to who we have as a president. Now it's time to make everything great and get along for all of Americans based on the constitution where it all started and will stay.","commenter_a":"If GOD could erase USA right now he would do it, i have no doubt. Trump is a living nightmare, and the American people are in the rollercoaster of stupidity right now. God don bless America...","post_message":"Things are not looking good on Wall Street"},{"comment_id":"10153988549981130","commenter_b":"Why did you even read it WOMAN!?","commenter_a":"I think this tops the most pointless \"article\" I've ever read!","post_message":"Even Jay Z knew to get out of the way."}]
