[{"comment_id":"10153687651936509","commenter_b":"Dont worry everyone...Jane cant be taken serious. She is a white liberal woman. We all know they are idiots.","commenter_a":"A black man said this...\"Over The Memorial Day weekend. Over 56 people shot in Chicago, 28 shot 9 dead in Baltimore, & the bizarre thing is; They want you to know the 'Police' are the problem in their communities. And I guarantee you they ALLLLLLL called \"911\" asking the \"Police\" for help & assistance when these shootings took place (go figure). A Fool will never recognize his own foolishness.\"- Johnathan Gentry.","post_message":"An outbreak of Memorial Day weekend violence left nine people dead in 29 shootings, according to police and CNN affiliates. What's behind these deaths? @webpagelink"},{"comment_id":"10153092200332869","commenter_b":"Mrs.Clinton will never be president and a Democrat will not get the presidential office. Either republicans or the third party is getting the presidential office. I do not accept the same-sex marriage.","commenter_a":"So proud of Gov Huckabee's strong stand against same sex marriage. Sets him apart from others who shun the issue. Will be a strong president!!","post_message":"Governor Huckabee was on Fox News tonight to discuss the Supreme Court's divided ruling on gay marriage, and the need to reject judicial tyranny and protect religious liberty. WATCH ⬇️"},{"comment_id":"10153785925861130","commenter_b":"So disgusting! Foot kiss'n Catholics just turn my stomach.","commenter_a":"Some people on this post are so stupid. Read the bible that is if you can read. Jesus washed feet. And the pope is just trying to be as Christ like as he can be. Some of you really need to follow his example. That is if you are not to ignorant","post_message":"Pope Francis says regardless of religion, we're all \"children of the same God.\""},{"comment_id":"1115305561859305","commenter_b":"And this so called wall would cost Americans billions of dollars. We can't afford that. No one can force Mexico to pay for it. And what about the water ways and the mountians? How will you put the wall on those?","commenter_a":"The WALL will seriously squelch the drug cartels, crime will decrease and the land value will increase, - It's called tough love, if we continue with open borders California will collapse, we flat-out can't afford it anymore, we're broke. Mexico has the best land in the world.","post_message":"\"Es una amiga nuestra de mucho antes y de siempre\". —Congresista Luis Gutiérrez sobre Hillary Clinton"},{"comment_id":"10152982959796130","commenter_b":"AMEN!","commenter_a":"Every member of Congress should do the same","post_message":"The #FoodBankNYCChallenge is meant to raise awareness about hunger and the struggle to live on such a limited budget."},{"comment_id":"10156161317710354","commenter_b":"the American police would be arrested for this.","commenter_a":"\"....it became clear to German authorities that a significant number of migrants they were trying to process were NOT Syrian refugees...\" They finally came to that conclusion?","post_message":"Chanting \"ALLAH HU AKBAR”...Pelting Police with Giant Rocks...MORE... Follow Breitbart London for up-to-the-minute breaking coverage of the migrant crisis..."},{"comment_id":"10153862572524369","commenter_b":"I have pretty extensive vocabulary and definitely don't need to use slang so by all means generalize and assume that we all say it...it's sad people are really this stupid.","commenter_a":"If they want the racial slurs to go away, they need to stop saying them as well. It's a double standard.","post_message":"Student groups have complained for months of racial slurs and other slights on the overwhelmingly white campus. Now, more than two dozen players say they're staying on the bench until the university's president is removed due to his \"negligence toward marginalized students' experience.\""}]
