[{"comment_id":"720191621435846","commenter_b":"Peaceful muslims?? What in the hail is that??? They all believe the same! You and all the misguided people who liked your post get to be first in line for beheading!!! Dear lord do some actual research! There is no such thing as a \" peaceful Muslim\"!!!","commenter_a":"If it's true , hats off to them . We have been wanting \" peaceful \" Muslims to stand up to the \"radicals \" , maybe this is a start ????","post_message":""},{"comment_id":"10154441251316756","commenter_b":"Dousing has been around for a long time.","commenter_a":"Funny how those diving rods never find the plumbing or septic tanks..","post_message":"Our reporter says the rods she was holding \"forcefully cross[ed],\" without her moving them. She doesn't know how it happened."},{"comment_id":"10158321761725206","commenter_b":"Stupid girl","commenter_a":"She initially said he wasn't armed, but then she started screaming at him \"don't do it\" as she had her camera pointed at the ground. Then she started filming them afterwards trying to cover up the fact that he was threatening the police with the gun.","post_message":"A photo has emerged in social media showing a gun at the feet of Keith Lamont Scott lying on the ground after he was shot by a police officer in Charlotte, NC."},{"comment_id":"10153014301039205","commenter_b":"@alex you're fucken stupid saying illegals don't have a place in the U.S. We ALL are fucken immigrants idiot , what about the Chinese gangs and Russian mobs ? What about them ? What about the KKK and other racial groups who commit crimes ? It's not just us MEXICANS who are illegal it's EVERYONE , If anything the natives founded this land and the rest are immigrants .. Smdh","commenter_a":"Who's fucking side are y'all on? Trump may not be the nicest kid on the block but we are talking about a Drug Lord in a very dangerous drug cartel. Is yalls hatred that much for Trump that you support a drug cartel boss killing him?","post_message":"The FBI is now protecting Donald J. Trump"},{"comment_id":"690501341083047","commenter_b":"We don't have to deport them all. 1. Enact extremely harsh prison sentences and fines for their employers. 2. Cut off all government entitlements to them, including drivers licenses. 3. Open service centers South of the border specializing in United States work permits for any company needing cheap foreign labor. Said employer would be responsible for all housing , food , transportation costs and hospitalization. The only way to get a job here would be to sign up in Mexico! Then wait just like the rest of the world has to. Enact those measures and most will self-deport! Those who don't are criminals and harshly dealt with! All anchor babies should be stripped of citizenship and also deported. Enough of these criminal aliens!","commenter_a":"What George Lopez said ain't much better than what Trump said! They are both wrong! This country was built by immigrants and most of them came here illegally including the white man! The only Americans are the native Americans everyone else is an immigrant! Native Americans didn't invite immigrants here! So don't fool yourselves! White man came here illegally! Massacred native Americans brought black slaves illegally and now have a problem with Mexicans! What a joke! Mexicans don't come here to take your jobs! They do the jobs that your too lazy to do and won't do them! White people go to these countries to get there labor and no one says nothing about that!","post_message":"Ummm ok?"},{"comment_id":"10153072162137144","commenter_b":"It was defacing State property. No matter how she feels there are laws. She was right to be arrested.","commenter_a":"Yay for this righteous woman !!","post_message":"Brava! #freeBree"},{"comment_id":"712497285538613","commenter_b":"Islamists radicals are killing muslims every day in irak, syria etc! Its about thousand and thousand and for no reason! Israel, when attacked, its only to defend itself! As any country would do!","commenter_a":"Jewish extremists burned a kid alive too. Just stating a simple fact.","post_message":"Netanyahu: ISIS burns people alive, Iran hangs them in city squares"}]
