[{"comment_id":"10156250000825354","commenter_b":"This leftist democrat is trying to push the blame to christian Americans. She wants what the democrats want more terrorist here. VOTE OUT ALL DEMOCRATS.","commenter_a":"People, please read the book \"The Seduction of Hellary Rodham, by Brock.","post_message":"Yeah, so, um, this happened..."},{"comment_id":"1352088188153471","commenter_b":"So Trump is going to run the country so great but can't keep tabs on his own tower? ( a case he was guilty in) it's not even about that though, it's more his hypocrisy and saying he'll bring jobs back when he's hiring illegals.","commenter_a":"This showed me how Cruz an rubio are like.senators who are liars.Trump is the only one to make America great again.","post_message":"One word: FINALLY."},{"comment_id":"10154429240061955","commenter_b":"@username Excellent! Praying everyone in our country reads this!!! Please!!!","commenter_a":"I simply cannot understand how BLIND and Ignorant one can be to support Hillary... She is a Career Criminal with blood on her hands! How can people NOT see this? Just do some BASIC research on her. You will be shocked at the amount of evidence against her!","post_message":"'Fact-checking' becomes opinion journalism..."},{"comment_id":"908796952508643","commenter_b":"@username, I think the big difference is that a brain dead person has NO CHANCE of neurological recovery. The same cannot be said for the vast majority of fetuses. A young fetus does have brain waves, does have a heart beat, and if left alone, an excellent chance of normal neurological function. We certainly would not be discontinuing life support in this situation on an older person.","commenter_a":"Women already have more access to healthcare than men. Show me a government funded chain of facilities specifically there for prostate cancer treatment. At any rate, cutting a living human out of a woman's body isn't healthcare and the living child certainly doesn't have a choice to be murdered or not during an abortion.","post_message":"When you tell a woman that she cannot control her own body, that’s extremism. Let's say it loud and clear: women control their bodies, not the government."},{"comment_id":"10158514408340354","commenter_b":"@username first Trump wasn't ever going to win. Then he would never build a wall. Then Mex will never pay us back... See where this is going, fk nuts?","commenter_a":"A wall is a slab of steel reinforced concrete buried in dirt This man builds skyscrapers for a living What did those neanderthals think was going to happen lol","post_message":"WOW. WATCH:"},{"comment_id":"10153662465839714","commenter_b":"Am I the only one who gets the joke?","commenter_a":"Mr trump, explain to me why something in the constitution is unconstitutional?","post_message":"Donald J. Trump continues to defend his controversial immigration plan."},{"comment_id":"236462700148781","commenter_b":"I heard he won by a lot and everyone is happy. Next please","commenter_a":"Dagmar! Free Press just means that they can't be censored or jailed! He doesn't have to speak to the press! No ....NO VIOLATION OF THE 1ST!!","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."}]
