[{"comment_id":"737426566424213","commenter_b":"Good Lord, this woman doesn't have a clue.","commenter_a":"Michelle Marjan","post_message":"Betsy DeVos, Trump nominee for Secretary of Education, is remarkably unqualified for the job. Full video: @webpagelink"},{"comment_id":"1876818559213436","commenter_b":"If NFL can't support National Anthem, then we can't support NFL or anyone else that can't support the Anthem.","commenter_a":"Back to Africa with him!","post_message":"NFL National Anthem Protests Sink TV Ratings To Five-Year Low Week Six!!! They had the chance to make things better but are allowing thugs to dictate their business.... KEEP BOYCOTTING!!! MAKE THEM PAY!"},{"comment_id":"1278741865525899","commenter_b":"@username dese bitch jam cuz","commenter_a":"🤘🏼OUS🚀ON","post_message":"Slim Thug's new joint \"King\" off the new album, \"Hogg Life, Vol 4: American King\"! #WSHH #SlimThug #Exclusive"},{"comment_id":"1149894398400704","commenter_b":"Another flip flop by trump,,he once said she would be a great president,,he's pro choice,,he says he's going to deport all illegals,Obama has deported more illegals then any president & it doesn't make any difference,,they just come right back,,Hillary is the only hope we have for the average American,,","commenter_a":"Never killery","post_message":"Trump has no problem with the idea of having a female president in America -- as long as it isn't Hillary Clinton. Do you feel the same way?"},{"comment_id":"502143199967560","commenter_b":"I wouldn't even give her the Cleveland steamer","commenter_a":"That's a face you could donkey punch.","post_message":"She makes it official!"},{"comment_id":"696169153898296","commenter_b":"@username, a new time of patients unable to afford treatment are being kicked out of hospital , letting them stay in the parking lot. Or putting them in a cab, just stranding them anywhere! Has happened many times.","commenter_a":"I had hoped that they would at least do the right thing and replace before they left millions without coverage....plus I read that it's going to cost a huge amount of $$$ to dismantle the Affordable Care Act....I want to know where this is being fiscally responsible????","post_message":"Awful!"},{"comment_id":"10154462885161636","commenter_b":"The frequency of rape is not higher amongst Muslim migrants Red.","commenter_a":"3 white men gang rape a 15 year old boy while the country is worried about banning Muslims. Unbelievable","post_message":"At a fetish party"}]
