[{"comment_id":"10152683418148067","commenter_b":"Don't worry. You're 10 times better looking than this homely chick.","commenter_a":"I'm 20 and my biggest accomplishment is not setting the house on fire.","post_message":"While her peers are chatting about boys and clothes, this teen is texting the CEO she hired to run her growing business. @webpagelink"},{"comment_id":"10153116557673812","commenter_b":"The problem here is that if there wasn't such a demand for these young females by perverts this wouldn't exist. You are sick to lust a 14 yr old as a grown man.","commenter_a":"My heart goes out to this mother!","post_message":"WATCH: A mother in a desperate search for her missing 15-year-old daughter is overwhelmed with emotion when journalist Nicholas Kristof searches for and quickly finds her being advertised explicitly online – A Path Appears: Tonight on Nightline / Monday on PBS -- MORE: @webpagelink"},{"comment_id":"10154120407252908","commenter_b":"attaboy Davies pass the buck.","commenter_a":"I've been trying to figure out why someone would be a Republican and for the life of me I just can't find an answer.","post_message":""},{"comment_id":"1109554819065528","commenter_b":"Bitch please,","commenter_a":"To everyone hating on Superman, you don't have shit.","post_message":""},{"comment_id":"10152577391880047","commenter_b":"it is only the beginning of America rising up against it's enemies...all of them...","commenter_a":"This needs to be permanent!","post_message":"BREAKING: Federal court temporarily halts President Obama's illegal Executive action on immigration. Read and Share how the court agreed with our legal arguments in holding this imperial presidency accountable: @webpagelink"},{"comment_id":"995263523875544","commenter_b":"And u look like what came out of my anus this morning, except not as attractive...","commenter_a":"Her face looks like the whole butt!","post_message":"Rosie O’Donnell unloads on Donald Trump..."},{"comment_id":"10153542667459087","commenter_b":"Liberal democrats won't be happy until every city in this country looks like this..","commenter_a":"Trump could tell a Muslims being shot with bullets dipped in pigs blood story and his support will continue to grow.","post_message":"“He took 50 bullets and he dipped them in pig’s blood,” Donald J. Trump said. “And he had his men load his rifles and he lined up the fifty people, and they shot 49 of those people. And the 50th person, he said, ‘You go back to your people and you tell them what happened.’ And for 25 years there wasn’t a problem.” WATCH:"}]
