[{"comment_id":"948395698606028","commenter_b":"Karma's a b**** and so is Hillary Deplorable Hillary LIES MATTER Pay for play Lining her pockets","commenter_a":"It was not a mistake...it is who she is. Angry bitter vindictive with money and power. Glad she was feeling enough pressure to be who she always was. A spiteful mean spirited person","post_message":"When you are president, you are president of all the people."},{"comment_id":"10153354138131680","commenter_b":"Any evidence statistically of that. Or is that what you think as a HRC supporter. Also I voted for Obama and I support Sanders this election.","commenter_a":"Her decision is very unpopular in Hawaii. Hawai'i Democrats are Obama Democrats. I would expect that she will face a primary challenge as a result.","post_message":"\"I’ve decided I cannot remain neutral and sit on the sidelines any longer.\""},{"comment_id":"822359307886042","commenter_b":"It was meant for this baby to live","commenter_a":"God directed that Officer to the area. He is Hero","post_message":"A newborn girl thought to be only 36 to 48 hours old was found alive in Compton on Friday. The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed. Detectives are now asking anyone with information to come forward. this post to alert others. Read KTLA story here: @webpagelink"},{"comment_id":"944616275579231","commenter_b":"I don't see why modesty should be offensive to anyone but I do understand why nudity can be offensive or uncomfortable. I think in a respectful, civilized environment you find compromise. which I think we did for a very long time. Now everyone wants to right to be offensive while retaining the right not to be offended.","commenter_a":"I've never understood why people are offended by nudity. It's just a human body ffs everyone has one!","post_message":"Not sure I'd have the nerve, but it looks kinda freeing. - Maz Ali"},{"comment_id":"10153687088042235","commenter_b":"Quit giving him attention...if you quit he will kill himself sooner.","commenter_a":"Georgie got a death wish.","post_message":"Seriously. F this douchebag."},{"comment_id":"10153728879938701","commenter_b":"Ugh, that's her opinion.....she is free to say it.","commenter_a":"President Obama please stay in DC.. We do not want to hear about your stupid gun control. You are NOT welcome in Oregon. You only care about One thing and that's you.","post_message":"JUST IN: President Obama will meet privately with the families of Umpqua Community College shooting victims on Friday."},{"comment_id":"1766321223645256","commenter_b":"If you are gay why are you voting for Hillary when she wants to bring in millions of refugees that believe gays should be executed? If you are Black, why are you voting for Hillary when she defends Planned Parenthood and admires Margaret Sanger, who wanted to abort as many black babies as possible and exterminate the black race because they are like \"weeds.\" Most of those clinics are in Black neighborhoods. If you are a Woman, how can you vote for Hillary when she has buried all of Bill's rape victims under the rug. As an attorney, Hillary also defended the rapist of a 12-year old girl and laughed about it later. She plays the woman-card and acts entitled; implying that she deserves your vote merely because of her sex. How is that gender neutral? If you have are a Miner, Steelworker or have a Factory job, why are ...","commenter_a":"He did not say because of how they prey! This is Dem spin! KILLARY only is concerned with illegals and refugee''s Get that big dem base full of those needing your handouts!! Does not matter if some want to kill us Really our money, but once it get to DC it's their money!! Her motto should be just give me your I WILL MAKE THE DEMOCRATS!!!! This country is going down fast!! Bombings, beheading, murders etc And our president is worried about where someone should PEE !! Big world leader! OBAMA A TOTAL JOKE!!","post_message":"\"In this great nation, where our founders put a fundamental principle forward of religious freedom, [Donald J. Trump] says ban all Muslims, don't let certain people into our America because of how they pray.\" What do you think of Sen. Cory Booker's comments about Donald Trump at the #DNC?"}]
