[{"comment_id":"10153915589591336","commenter_b":"Russian women are hawt !!!!","commenter_a":"Putin thinks Trump is great Could this mean that we could be friends again with Russia if Trump wins? I think so","post_message":"Donald J. Trump has plenty of admirers, and you can apparently count Russian President Vladimir Putin among them."},{"comment_id":"10154709341603984","commenter_b":"Jealous bitch","commenter_a":"Could it be Mark Cuban is trying to get Trump to look like he would sell his party out for similar money Hillary has taken? :Edited, nah he needs to find a way to ruin Trump. He is looking for a weakness to exploit. I'm sure of it.","post_message":"Billionaire Mark Cuban just stunned everyone with a jaw-dropping offer for Donald J. Trump that NO ONE expected. There's something he wants the Republican candidate to do, and he's willing to give something massive in return..."},{"comment_id":"539030936307389","commenter_b":"@username you're not paying for my uterus. Lol.","commenter_a":"So, Kaine, a Roman Catholic, has a moral conflict with his faith when it comes to the death penalty (killing criminals) but no qualm whatsoever promoting the killing of unborn babies?","post_message":"Mike Pence is a good man who had a strong performance tonight. This evening Tim Kaine demonstrated that he would serve as just another enabler of the failed Obama-Clinton policies that have hurt our economy, taken away our freedom, and weakened our security. The choice for Americans is clear. We cannot afford a third term of President Obama, and Clinton-Kaine would only continue the disastrous policies of the last eight years."},{"comment_id":"1677499192511819","commenter_b":"you should post this for the misogynist guys on my link to see ahah","commenter_a":"@username this is exactly what that article you shared the other day was talking about. Is this real life?","post_message":"Donald Trump suggested Hillary Clinton is ahead because she's playing the \"woman's card.\" Not surprisingly, jokes and memes followed, pointing out the strange logic of such a statement."},{"comment_id":"10153354510959714","commenter_b":"He technically could put kids in danger. His fans tend to be a bit over the top. One of those fan girls could and would easily shove someone out of their way to get near him without any thought given to whether or not the person they just shoved is ok.","commenter_a":"OMG I'm not a fan of the guy but u all are over reacting...putting the kids i danger seriously...how...he is not a terrorist he a singer...u all need to get a life...","post_message":"Justin Bieber totally crashed a prom, you guys."},{"comment_id":"10152783223285667","commenter_b":"I wondered what happened to the bikes. Bike sale soon????","commenter_a":"Yes and they have confiscated over 150 bikes..Bikers are pissed off","post_message":"Some of the dead and wounded may have been shot by officers responding to the bedlam, a Waco police spokesman said."},{"comment_id":"292042534545715","commenter_b":"Ur so dead and sure its ur bear belly","commenter_a":"It's @username's butt ;)","post_message":"What could it be?"}]
