[{"comment_id":"1157727034250343","commenter_b":"Bunch of scum bags","commenter_a":"Spin, spin, spin, is that all we get today ?","post_message":"CBS journalist ADMITS it's their job to protect Hillary Clinton's past."},{"comment_id":"876721502518426","commenter_b":"She don' deserve nothing more than 10 years in jail and not a holiday jail for what she has done to this Country she deserve the punishment that she gets","commenter_a":"No! She deserves jail!","post_message":"Hillary Clinton's worst nightmare just became her reality. Days before the election everything crashes. 'LIKE' if you think Hillary deserves justice?"},{"comment_id":"513245792199334","commenter_b":"ALL MUSLIM PIGS Get the HELL outa MY country!!!!!!","commenter_a":"Screw you, give her her job back, this is a disgrace to the AMERICAN people! Anyone can make a mistake!","post_message":"A lunch lady was fired for serving pork to a Muslim student. We are in America, give that poor lady her job back. Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"1701770233407796","commenter_b":"The Muslims should start their own food chain. They could have whatever Muslim food they wanted. Then Americans could be outraged that they don't have cheeseburgers.","commenter_a":"I agree with these companys","post_message":"There is no reason why they should have to change their business for them. Do you support these food chains?"},{"comment_id":"964259683612268","commenter_b":"get them the hell out of our usa we dont want them here,take that scumbag obama with you.","commenter_a":"Probably headed to the Democrat Registration Office.","post_message":"Oy vey."},{"comment_id":"870513306380610","commenter_b":"Seriously?!?!?!?","commenter_a":"So the hackers can have even more access to our personal information? Great.","post_message":"The Postal Service is testing a \"notification\" service that emails you photos of the envelopes of your mail."},{"comment_id":"10150664369884999","commenter_b":"Rule of thumb: Economists don't generally have armies at their disposal to help overthrow democratic governments who oppose their \"theories.\"","commenter_a":"You'd think true conservatives would be happy about the expansion of rights (gay marriage) and making sure everyone chips in on the healthcare system everyone uses (Obamacare). I guess they're not conservatives, just simple Republicans.","post_message":"The way some Republicans tell it, America is a pretty awful place these days."}]
