[{"comment_id":"10154302176821491","commenter_b":"Duchess Aungelique GauBrielle You're officially crazy. Added, this is one man's personal experience as well to be fair...","commenter_a":"In all honesty, this sounds like a disgruntled employee... all of the African Americans employed, & previously employed at Versace... he's the only one to disclose this... people buy into anything where race is concerned. I'm African American, I shop high end... I've definitely experienced Racism while shopping, but I could literally count the incidents. Racism is very real, but it's being used and over used to justify everything! However, if this is true, why did he wait until he was fired to speak up. Also, why have none of the other African American employees past or present come out to support him?","post_message":"The store employees were taught during training to say \"D410\" whenever a black customer entered the store, according to the lawsuit."},{"comment_id":"1004765479656630","commenter_b":"That's no lady. Bigger dick than Barry.","commenter_a":"Disgraceful First Lady","post_message":"Hot diggity dog..."},{"comment_id":"1229861343720720","commenter_b":"She would govern effectively by not selling out, like HRC did decades ago and like Sanders never did during his campaign. #JillNotShill","commenter_a":"I have liked her page.I'm trying to research her. I have ave some reservations. If she were to win how could she govern effectively? With zero green party reps and senators to assist her. For the green party to be effective we would need down ticket victories also. I don't like Hillary Clinton! I absolutely fear Donald Trump. Voting green in 2000 gave us GWB. That is NOT debatable those that don't accept that are just in denial. Jill's platform is in accordance with my beliefs. I do think that her promise to put Snowden on her cabinet is pure pandering. That troubles me. Voting my conscience would be horrible if it means a Trump presidency.NOTHING COULD BE WORSE! !!","post_message":"Dr. Cornel West on the morally bankrupt DNC Platform: \"There's no way for me, as a human being, a teacher & a citizen - if we can't say a word about TPP, if we can't talk about Medicare for All explicitly, if the greatest prophetic voice dealing with impending ecological catastrophe can hardly win a vote, & if we can't even acknowledge occupation as something that's real for a slice of humanity... there's no way in good conscience I could say 'take it to the next stage!' I wasn't raised like that. That's not my calling. I'm just being truthful. It'd be a violation of my own limited sense of moral integrity and spiritual conscience. That's how I roll.\""},{"comment_id":"1043726442390274","commenter_b":"We have our own problems here, send em to other Arab countries","commenter_a":"Not only a great actor, but an absolute class act.","post_message":"\"The show was fantastic, but you left in tears after [Benedict Cumberbatch's] speech. It was very eloquent, emotional, and beautifully put … He gave a 4-letter word to the politicians and said, ‘We’ve got to do something about it.’” - Rachel Martin, audience member"},{"comment_id":"10155605168240968","commenter_b":"Lock Em up!","commenter_a":"Liberals suck!","post_message":"\"If you see your friends or family falling into the chasm of cable news, perhaps parental lock is right for you.\""},{"comment_id":"10154303703286178","commenter_b":"You sound like a feminist bro.","commenter_a":"So does this mean only woman can understand how to run a home ? What a CROOKED crock of chit HILLARY !","post_message":""},{"comment_id":"474902102708278","commenter_b":"Suck a dick cnn","commenter_a":"The Dallas Police Officers were not killed by BLM members, but by an ex military man who was involved with ISIS! Pay attention!!! So much hate in this state. Disgusting. Thankful for the police protection here and their professional attitude. Stay safe all !","post_message":"We're in Phoenix, Arizona, where residents have gathered at City Hall to protest police violence and the recent shootings in Minnesota and Louisiana. (Source: CBS 5 AZ - KPHO/KTVK)"}]
