[{"comment_id":"10153060645251350","commenter_b":"And you'd win a beauty contest for sure ...","commenter_a":"She's so ugly. She has a mouth the size of a horses mouth","post_message":"What do you think: Is this a subtle pregnancy announcement or just a cute silly photo from Beyonce?"},{"comment_id":"10153040394173984","commenter_b":"She needs to resign","commenter_a":"Starting with Obama","post_message":"This is downright despicable. Wait until you see how she's associated with Obama... Do you support removing this racist politician from office?"},{"comment_id":"633021916884133","commenter_b":"Handler is not someone who the 1st lady would want to meet with. Talk about the trash...","commenter_a":"Chelsea Handler who is a hardcore supporter of Hillary Clinton and a Democrat. She is actually a racist.","post_message":"Wow..."},{"comment_id":"10154589081180586","commenter_b":"@username YOU ARE A BRAIN DEAD MORON","commenter_a":"Here's the thing- There are plenty of us voting for Hillary, we just don't find the need to scream about it all day long, ya know? And maybe we don't put up signs because we know the kind of needless drama it will start with any childish, loose cannon Trump supporters that happen to come across it... The Hillary supporters are here, we're just too busy working/paying taxes and rocking the good life to yell it from the rooftops everyday...","post_message":"Another national survey shows Hillary Clinton and Donald Trump in a near-even race in the final weekend before Election Day."},{"comment_id":"667865053404073","commenter_b":"No! She's a witch and that's her night out!","commenter_a":"She's a joke!!","post_message":"Michelle Obama wants to destroy Halloween for kids across America. There is no chance that we will let her take Halloween away from our kids. Do you think Michelle Obama is a joke?"},{"comment_id":"10154122931756756","commenter_b":"Ugly, spoiled killer.","commenter_a":"The apple didn't fall far from that tree.","post_message":"In a video released by Mexico's immigration institute, an expressionless Ethan Couch is shown being led into a truck and placed on a plane at a Mexico City airport."},{"comment_id":"1625393254140954","commenter_b":"This guy is a certified idiot!","commenter_a":"This Cummings punk is the king of demegogoury. The only person I find more dispicable is Chucky Schumer.","post_message":"The Democrats have been parodies of themselves for so long they fell for another parody."}]
