[{"comment_id":"1318403084859330","commenter_b":"They wont be missed","commenter_a":"Awwww!","post_message":"There are some deaths that don't make us cry."},{"comment_id":"10153831550149474","commenter_b":"I don't believe my dog trust Hillary","commenter_a":"I remember she slapped her husband's face at the White House. Lol.","post_message":"Simple. Share if you agree."},{"comment_id":"10154500349722994","commenter_b":"Yes! If someone is wrong they should pay!! Thank you hun. Wish I wouldn't have settled because I probably wouldve gotten more going to court! Never settle sweetheart 👍💯","commenter_a":"This happened to me before but by the time I found out it was pillaged, dash kit, sounds, Windows missing. I went to court and sued DPD they settled out of court.","post_message":"Andrew Carter has been walking, riding his bike and taking the bus for nearly two years now - unaware his stolen car had been recovered the entire time."},{"comment_id":"944616275579231","commenter_b":"I don't see why modesty should be offensive to anyone but I do understand why nudity can be offensive or uncomfortable. I think in a respectful, civilized environment you find compromise. which I think we did for a very long time. Now everyone wants to right to be offensive while retaining the right not to be offended.","commenter_a":"I've never understood why people are offended by nudity. It's just a human body ffs everyone has one!","post_message":"Not sure I'd have the nerve, but it looks kinda freeing. - Maz Ali"},{"comment_id":"10154414222354087","commenter_b":"Get used to it. Welcome to Trump's America.","commenter_a":"So? We've been hearing that North Korea has nukes, is building nukes for years... Whatever... Their society and economy is so fragile a major earthquake would send them back to the dark ages...","post_message":"A top North Korean official who recently defected to South Korea says the country is racing to develop nuclear weapons \"at all costs\" by the end of 2017."},{"comment_id":"10153499378776051","commenter_b":"all women are crazy","commenter_a":"Dummy. He should have just gone home and find a girlfriend that is not crazy.","post_message":"This man's girlfriend and ex-girlfriend jumped into a river to force him to choose which one he loved more. Well, he made his choice."},{"comment_id":"1270876669600008","commenter_b":"Jean Miche","commenter_a":"We aren't. Some may be.","post_message":"Why is a fear of spiders so common?"}]
