[{"comment_id":"10153025214071051","commenter_b":"I can't tell you how many cars my body has stopped that wouldve hit a lady otherwise","commenter_a":"The man always walks on the street side of a woman. That's manly eticat !","post_message":"A woman posted this photo with the caption, “I'm sure half of you guys don't even know what's wrong with this picture” alongside it. Well, she was right."},{"comment_id":"10154254205206179","commenter_b":"Yes, the man who was accused of racism 30 years ago despite being a legal champion of civil rights when it mattered, showing he can actually put personal beliefs aside and do his job when it counts. Can't have someone like that as attorney general. He might actually enforce the law.","commenter_a":"She knows the rules. . She was warned. . She broke the rule. . She was disciplined. . The rules are arcane, but then crying cause y'all don't get your way, well please! #growuppeople","post_message":""},{"comment_id":"1221564884584907","commenter_b":"No one would stalk you, Hillary!","commenter_a":"Well Hillary, I believe you are safe with Donald. He isn't desperate enough to grab yours ! Besides he is a gentleman, not all men are like Bill Clinton.","post_message":"Seriously? So lame..."},{"comment_id":"894913557210733","commenter_b":"That's a very good question. They should have been the first to do that, And Arizona as well. But I don't think we can save lower California. The illegals think they own it anyway........","commenter_a":"ok texas needs to do this fast","post_message":"AND He needs our help!"},{"comment_id":"10153155797009205","commenter_b":"Kill the whole breed .","commenter_a":"Always have your concealed firearm in case one of these beasts attack.","post_message":"Pit Bulls Maul Multiple Men [GRAPHIC]"},{"comment_id":"943252975710162","commenter_b":"I feel like singing. We say grace we say ma'am if ya ain't in to that we don't give a dam. Were from north california and south alabam and little towns all. Around this land. But on a serious note. Being politically correct has made our country weak. Made our children bad and taught them mom and dad will save me no matter what. And yes I do support trump. I'm against illegal immigration and gun control.","commenter_a":"If she would have been taught respect for authority at home this wouldn't have happened true thug trash.","post_message":"Some reasons why Officer Ben Fields should be fired immediately."},{"comment_id":"10154552857806955","commenter_b":"How is Hillary performing vs. Obama?","commenter_a":"This is it America. This is our last chance, the alternatives are most unsettling.","post_message":"FLORIDA SHOCK: TRUMP OUTPERFORMS ROMNEY BY 130,000 IN EARLY VOTING!"}]
