[{"comment_id":"1010634062332044","commenter_b":"They are illegal they deserve nothing.","commenter_a":"Obamina will destroy America before he/she lives the building ,unless you beat him to it","post_message":"ENTITLED ILLEGALS: It Now A Crime To Deny Illegal Aliens Tuition Benefits That Most American Don Get @webpagelink"},{"comment_id":"1882169925350064","commenter_b":"she needs 2 take a step back! She also needs 2 learn 2 RESPECT OTHER PEOPLE,S OPINIONS! If she doesn't like it here...LEAVE!","commenter_a":"Get rid of her. She's a real Bitch. Jeanie","post_message":"Whoopi Goldberg just crossed the line when she said this about Trump's children. She just got taught a lesson she'll never forget. Should Whoopi be kicked off the air?"},{"comment_id":"734527313335610","commenter_b":"Corina doesn't have a head occupying her brain. She doesn't seem to be aware that Jews have been \"occupying\" that region for 4000 years.","commenter_a":"State who creates biggest terror in the world since 1948 doesn't know anything about human rights.","post_message":"Iranian President Hassan Rouhani famously said in 2013 that ethnicities, all religions, even religious minorities, must feel justice..."},{"comment_id":"10153437960854877","commenter_b":"Every woman commenting negatively about Vivica, bet you man or husband would drop you to be with here, you women or old. Her age means nothing when her shape is killing every young girl on this post","commenter_a":"Why is he the bad guy when he's only responding to her messy self knowing he isn't gone let it rest or go!!#SheStupid","post_message":"50 Cent Responds to Vivica A. Fox 'Gay' Comments...and Doesn't Hold Anything Back. Read what 50 had to say below. Grio fam, what's your reaction to 50's comments? Sound off!"},{"comment_id":"10154043300342577","commenter_b":"All women do!!","commenter_a":"is it just me, or has this woman got the most annoying voice in the world? I just wanna punch her in the face","post_message":"Hillary Clinton's Greatest Hits! Vol:1- infowars.com/show"},{"comment_id":"10153111223750779","commenter_b":"@username You're such an, asshole.","commenter_a":"Donald Trump for President","post_message":"Billionaire celebrity G.O.P. presidential candidate Donald J. Trump will host an upcoming episode of Saturday Night Live."},{"comment_id":"10154467754523010","commenter_b":"@username .... Look who's talking?! Trump got his mistress pregnant, that's were his second daughter came from. Malania said, in her plagiarized speech, that she Trump had been together 18yrs....Trump was still married to wife number two at that time! Children with three different women!!!!! Can you imagine what the Republicans would be saying, if that was Hillary?! Hypocrites!!","commenter_a":"He and Bill should hang out since they both cheated on their wives multiple times. Nothing like knocking up the maid. #NeverHillary #ImAgainstHer #VoteTrump","post_message":"Not quite hasta la vista to the Republican party."}]
