[{"comment_id":"10153898128831509","commenter_b":"Stay home until your baby is weaned? Seriously stop! If you want to live some backwards, 1950s lifestyle, you go right ahead. While you're at it, why don't you just keep your opinions to yourself, since that's what a nice housewife would do, right? Give me a break. This misogynist refused to give her a break. There is also nothing to be modest about when it comes to breast feeding or pumping. Maybe you're the one who should work on modesty when you're over there over sexualizing a part of the female anatomy that is meant to help sustain life.","commenter_a":"She should have Left the room To Pump! Really Embarrassing for the female and males in a business Meeting! Have you no Modesty or even Selfrespect ! Stay home till your baby is weaned !!","post_message":"Donald J. Trump's attorney says Trump's language wasn't about her decision to pump breast milk, but solely on where she chose to do it: @webpagelink"},{"comment_id":"10153668004231037","commenter_b":"Good they can all go to jail with her too","commenter_a":"America is a sick country","post_message":"About 300 people gathered outside of the Kentucky jail on Saturday to show support for Kim Davis."},{"comment_id":"10153324235171051","commenter_b":"Since some of you females here want to crucify the father let me be the first to defend him. The child was the one that is being held, not the father. They have enough evidence to hold him and charge the kid. We don't know what kind of man the father was or what custody agreement him and the mother had. The child is the one being charge and we should leave it like that until something new comes out.","commenter_a":"Where is the father of the fetus & how far along was she? Nobody noticed the front door open on Friday or Saturday? A single mother living in that house? They said the kid had been missing a couple days as well but their news broadcast says the boy disappeared after his mothers death. What was he doing there? How did he get there? The neighbor & sister both say the boy was a good kid, good grades, non trouble maker and she was a great mother who loved & protected her family. Almost all pregnant women who die, do so at the hands of the baby's father.","post_message":"This pregnant woman was killed by the one person she trusted most in the world."},{"comment_id":"10153148405249753","commenter_b":"Fuck you again bitch and fuck your manner too. Don't come to teach about manner. My mama only said \" baby, respect everyone before get that respect back.\" My mama is better than yours.","commenter_a":"Everyone shall be respected the American's rules because we are living in America, not your or mines, so lady get that into your head.","post_message":"The Dearborn Police Department has been slapped with a lawsuit after a Muslim woman says that she was ordered to remove her hijab, or headscarf, for her booking photo after she was arrested."},{"comment_id":"10153692556453984","commenter_b":"Had she told the tuth to begin with she probably would be our next pres!!!","commenter_a":"Absolutely","post_message":"Looks like Hillary Clinton just got another piece of bad news, and it's from one of her least-favorite people. 'Bulldog' Gowdy is hot on the trail! Do you support Trey Gowdy's fight to hold Hillary accountable?"},{"comment_id":"812894658799894","commenter_b":"GI, Hillary, go.","commenter_a":"Hillary is a strong woman and won't tolerate any Republican CRAP.","post_message":"This is Hillary in full badass mode. You may not love her, but you should love her passion!"},{"comment_id":"533363636854216","commenter_b":"if this person had been a white lady, shed be up on charges...black privilege","commenter_a":"Good for her kick his ass","post_message":"After this mom found out her son was rioting, she took immediate action. All the parents in Baltimore should be doing this to their race rioting children. Do you agree her race rioting son got what he had coming?"}]
