[{"comment_id":"1269429443084021","commenter_b":"I prefer the lady in the center.","commenter_a":"I bet I can tell you which one sells the most copies haha.","post_message":"For the first time ever, there are three different Sports Illustrated Swimsuit covers – representing women of all shapes and sizes. @webpagelink"},{"comment_id":"10154122931756756","commenter_b":"Ugly, spoiled killer.","commenter_a":"The apple didn't fall far from that tree.","post_message":"In a video released by Mexico's immigration institute, an expressionless Ethan Couch is shown being led into a truck and placed on a plane at a Mexico City airport."},{"comment_id":"10153210442256336","commenter_b":"Good!! Put that b!tch in jail....","commenter_a":"Were they on Hillary Clinton's server?","post_message":"A Treasury Department watchdog has recovered roughly 6,400 emails from Lois Lerner and turned them over to Congress – reviving the investigation into the IRS targeting of conservative groups."},{"comment_id":"1589075444729621","commenter_b":"To keep the Marxist Corrupt Hillary out!","commenter_a":"Why should anyone care what a theologian thinks about a political choice?","post_message":"ICYMI: Theologian Wayne Grudem lays out the moral case for voting Trump."},{"comment_id":"10153631849906770","commenter_b":"I can't stand her","commenter_a":"That is why lying Hillary and Obama likes her. They are all LIARS!!!!","post_message":"Rep. Trey Gowdy blasted Attorney General Loretta Lynch on Wednesday, arguing her testimony before Congress was \"a total waste of time and a total disservice to my fellow citizens."},{"comment_id":"598276743693951","commenter_b":"Wow. What a racist pig..","commenter_a":"You serve SATAN !!!! You are a very poor excuse for a human !","post_message":"CNN host Fareed Zakaria calls for jihad rape of white women"},{"comment_id":"10153183452347490","commenter_b":"The photographer is a WOMAN!","commenter_a":"I have 3 perspectives on this photo: as a PO in charge of the flag, it is against flag etiquette. As a Navy retiree, we need more people to support our militaries and this photo he is a defender of our country and our families. As a photographer this has no words to express how beautifully this photo turned out.","post_message":"THOUSANDS RALLY AROUND PHOTO -- Navy vet and photographer says she's getting more support, and business, after her photo of a baby cradled in the flag made national news:"}]
