[{"comment_id":"914583611910394","commenter_b":"Trump is right about illegal immigrants. Our government has committed treason by leaving the borders open.","commenter_a":"Give em a right and then a left upper cut ,don't quit,you have em on the ropes...","post_message":"Hot off the press!"},{"comment_id":"10153767545206002","commenter_b":"My son still has school.","commenter_a":"Schools need a coordinated web site saying exactly what are close or open..","post_message":"Bitter cold has closed schools not already on Winterbreak. School Closings: @webpagelink #Local4Today"},{"comment_id":"1235978386476227","commenter_b":"someone please give that nasty fat cunt a coupon to jenny criag.","commenter_a":"Get over yourself!! U need to go to the gym","post_message":"Entitled woman claims cashier give her a free drink because her grandmother was a slave. 'LIKE' if this is WRONG!!!!"},{"comment_id":"10152888128321051","commenter_b":"Black white green. Wtf ever. Cant affort birth control. Then you can't afford kids.","commenter_a":"White women have babies too...not just black women.No-one should have children that they can't take care of,no matter what color you are!!---- i see that there are so many opinions about this post. I wasn't making this a race issue just stating my opinion.This country we call America is full of hate.We all can see this by all the name calling. It's a strange thing that some of you say it's not about race.anytime someone make a comment that doesn't support your views you call them a racist. I am not a racist i just can't stand people who continue to put my people down. I had to add these comments after i read the comments of so much hate. God made us all. The color of all our skin God made. So take your complaints to Him. It really makes me so sad that some people can treat others ...","post_message":"This state is about to ban low income single mothers from having any more children for 5 years."},{"comment_id":"10157136269005354","commenter_b":"Her brother got the gold mine, and we got the shaft. They all knew that, I think these Washington creeps all shared the pot.","commenter_a":"Restore coal mining, open the pipeline, open oil drilling on public lands, and make America Energy independent.","post_message":"****HILLARY CLINTON'S BROTHER BAGGED A GOLD MINE IN HAITI, AND HILLARY GAVE AMERICAN COAL WORKERS THE SHAFT****"},{"comment_id":"10153072162137144","commenter_b":"It was defacing State property. No matter how she feels there are laws. She was right to be arrested.","commenter_a":"Yay for this righteous woman !!","post_message":"Brava! #freeBree"},{"comment_id":"1322864184423514","commenter_b":"Tear down their tereorist head quarters that's what all mosque's are . And deport them all","commenter_a":"good on you Donald deport them all","post_message":"TRUMP IS GOING TO CLEAN UP THE INSANITY THAT HAS BECOME AMERICA!"}]
