[{"comment_id":"948419235220194","commenter_b":"If she wont follow the dress code I wonder what other codes she would break...Be compliant or be gone !!","commenter_a":"How refreshing !! Parts of this country is still the U.S.A.","post_message":"Ohio Police Takes BOLD Stand Against Islam After Offended Muslim Woman Issues Threat @webpagelink"},{"comment_id":"485585728298674","commenter_b":"She is death warmed over!","commenter_a":"Not the first time Nancy has been hit. A face rearrangement could only improve her looks.","post_message":"Greta just kicked Pelosi to the curb... Good. We need more American women like Greta and less like Pelosi. Do you support Greta taking on Pelosi publicly?"},{"comment_id":"10153982122994071","commenter_b":"Stfu","commenter_a":"No, no they shouldn't ... this is a classic example of over extending and away from your core business. The ramp up time is too long and the others can fill the gap fast. They need to stick to immediate delivery systems.","post_message":"Amazon.com is coming for the grocery industry."},{"comment_id":"10153344423053701","commenter_b":"Is that all you got, being a Grammer police. Yeah have fun with your dike ass girlfriend loser.","commenter_a":"Schools need to start teaching high school kids some kind of trade. So if they decides not to go to collage they still have a skill.","post_message":"\"Our schools are the anchors of our community,\" said Portland Mayor Charlie Hales."},{"comment_id":"10152991332957377","commenter_b":"He is a lot weaker. Building a WAll is a lot cheaper then paying for all the illegals and their so called benefits!","commenter_a":"jeb cant carry his own state.","post_message":"Jeb Bush fights back..."},{"comment_id":"10153243017991336","commenter_b":"Thjey Used to Hang/Lynch MF Niggerrs like that before !!!!!! Where is the Klan !!!!!","commenter_a":"and Black people want respect....frigen Animals","post_message":"UPDATE: A third suspect has now been arrested after the shooting prompted a statewide manhunt. The suspects accused of killing two Mississippi police officers in the line of duty were reportedly arrested early this morning."},{"comment_id":"1796967167212138","commenter_b":"What an idiot!!! Cher became a Chair!!!","commenter_a":"Scum of the earth. Crawl back into your hole.","post_message":"**Irony Alert**"}]
