[{"comment_id":"10153421775308352","commenter_b":"oh you beat me to it....damn,are those tits real","commenter_a":"I'd raid her too, looking like that!","post_message":"Police raid pot club of Alaskan reporter who quit her job live on air to fight for legalized weed, after reports surfaced of illegal marijuana sales"},{"comment_id":"950004335054969","commenter_b":"She loves him..get over it!","commenter_a":"I sure hope he makes a full recovery, not only for his kids and himself, so that gold digging piece of garbage he is still legally married to cannot get a dime of his money. It is disgusting how she is sitting at his bedside just waiting on him to die because everyone knows she does not give a crap about him. The Kardashians are a cancer that needs to be eradicated.","post_message":"#PrayForLamar Lamar Odom gives his family and friends a sign of hope after awaking from a coma. The gesture is sure to warm your heart. Meanwhile, Lisa Morales, the mother of his two children speaks out on Odom’s early improvements. FOR THE LATEST ----> @webpagelink"},{"comment_id":"10153728879938701","commenter_b":"Ugh, that's her opinion.....she is free to say it.","commenter_a":"President Obama please stay in DC.. We do not want to hear about your stupid gun control. You are NOT welcome in Oregon. You only care about One thing and that's you.","post_message":"JUST IN: President Obama will meet privately with the families of Umpqua Community College shooting victims on Friday."},{"comment_id":"1146187242090421","commenter_b":"Lordy...I'd wear that brownish ass out...then marry her!","commenter_a":"My opinion is that, it is not nasty, is just a big booty, so whatever.","post_message":"Big booty problems."},{"comment_id":"992191140821358","commenter_b":"Why? I think she is best in the senate. I also think an all female ticket is unrealistic.","commenter_a":"Clinton/O'Malley would be a good ticket.","post_message":"Hillary Clinton absolutely crushed every single Republican candidate in a recent CNN/ORC poll."},{"comment_id":"10153158889713837","commenter_b":"Yes, where kids have easier access to that stuff...*smh*","commenter_a":"Thank goodness. Maybe the tide is turning. Where nothing has been off limits, fortunately Playboy has made the decision to no longer contribute to the filth that saturates the marketplace.","post_message":"NO MORE NUDES! Playboy magazine has announced that it will eliminate nude pictures from its pages. But it's OK, you only read it for the articles, right?"},{"comment_id":"10153994821081409","commenter_b":"Voting should only be done in person with ID on paper ballots. Who marked that mail in ballot? Who is at the keyboard for online voting? Do you have a repeatable count of the votes? Again, voting in person with ID with paper ballot.","commenter_a":"Voting should be the same in every state, county, city, town, whatever. Mail in ballots should be available to everyone. I think eventually we should go to online voting if we can keep the republicans from tampering with it.","post_message":""}]
