[{"comment_id":"10152821539741051","commenter_b":"who teaches bulling in school better than teachers?there are people out there that have no business interacting with young people at all. she should be put in the stocks, in school, let her feel what he felt. sue them all back to rubble","commenter_a":"Unbelievable, how could this type of bulling be tolerated? That school needs new policy's.","post_message":"When this woman found out that her grandson had been publicly punished like this, she couldn't believe it."},{"comment_id":"1346770152082702","commenter_b":"Robert Best then take ur bitch cockservative ass 2 bed.....damn!!!!","commenter_a":"Sadly the same dimwits that voted for Trump still aren't listening...","post_message":"Trump has shoved his foot in his mouth once again."},{"comment_id":"1212525308785662","commenter_b":"HILLARY GOING TO PRISON. NA NA NA NA NA!","commenter_a":"Trump Pence 2016 Make America Great Again","post_message":"On Friday, FBI Director James Comey bowed to partisan pressure and released a vague and inappropriate letter to Congress that only serves to give Republicans a new line of attack against Hillary. Here's what we've learned from news reports: The emails may not have been to or from Hillary. The emails weren’t even ever on her server. The FBI case has not been re-opened. HFA Press Secretary Brian Fallon breaks it down."},{"comment_id":"10153491925881756","commenter_b":"Hey, this sounds like Republican America; an obsession with lady parts.","commenter_a":"Indonesia, defender of morality.","post_message":"The virginity test \"is a measure of morality. There's no other way,\" Gen. Moeldoko said. The test — which, for the record, is scientifically invalid — is internationally regarded as a violation of human rights."},{"comment_id":"10155024905873487","commenter_b":"Yes, but I am going out swinging. My representatives are getting letters, resistors are getting encouragement, all entreating those who swear to protect and defend the constitution are getting my support. I grew up when you did...and felt the same way. We are to be tested. Our Republic will need yo stand. So I will too. Join us!","commenter_a":"Good-bye halcyon days of growing up in the U.S. in the sixties and seventies. Worst shock of my life was 2008. I had always, unconditionally, believed that FDR's reforms were indissoluble, absolute, perfect. Now I don't trust anything; if there is money to be made, no perfidy is too great to be inflicted upon Joe Lunchbucket and me. It was a great experiment, but the protections against the avaricious that were put in place were not strong enough.","post_message":" don think Richard Nixon even comes to close to the level of corruption we already know about Trump."},{"comment_id":"10152955255282452","commenter_b":"@username, abortion is legal even in the third trimester.","commenter_a":"How about we teach students and other young girls about birth control (not making it a religious issue) and make it more available to the public so we wouldn't have so many abortions in the first place. I don't like abortion, who the hell does anyways? But we shouldn't ban it. Let's push our efforts into making it as rare as possible instead.","post_message":"Anti-abortion activists on Tuesday released an undercover video showing a senior Planned Parenthood official discussing the disposition of parts from aborted fetuses. @webpagelink"},{"comment_id":"10153946118774071","commenter_b":"He is a #WhinyLittleBitch","commenter_a":"If he is not blaming it on the Mexicans, the women, the Muslims, the Democrats, the media or the moderator, it's the microphone. My God what a crybaby. I think Donald need a diaper change 😂","post_message":"Clinton slams Trump's debate performance: 'Anyone who complains about the microphone is not having a good night.'"}]
