[{"comment_id":"10153861358541680","commenter_b":"@username killary has had her head inside hitlers butt","commenter_a":"He'd tap that","post_message":"President Bill Clinton and Melania Trump greet one another before the first presidential debate begins."},{"comment_id":"1231833570240008","commenter_b":"We voted for Obama twice now we are racist. A lot of african's and Hispanics voted for Trump. If Hillary would have been a better candidate and visited the states Trump won she would be president.","commenter_a":"And you're saying that the BLM, BLACK PANTHERS are any different. This shows how blind that you are","post_message":"\"These white Americans tuck their heads under cone-shaped hats and American flags ... training their guns on the unarmed, the innocent, the scared ...\""},{"comment_id":"10154523489186336","commenter_b":"This must be an attempt to try and dig yourselves out of the hole you're in.","commenter_a":"If you want to know what is really happening in the world bypass FOX and CNN, and go to alternative news sources. You will be amazed to see how much the American news media ignores. We are all living in the dark.","post_message":"Now more than ever, viewers are turning to Fox News Channel – Most Watched, Most Trusted!"},{"comment_id":"10153798319264087","commenter_b":"fuck you. she didn't do shit when people called for help in libya. she sucks-and she hassled girls bill raped","commenter_a":"he cares about Americans. I always vote democrat, but not any more. i will vote for Bernie in june-but he don't have a chance-ill vote for Trump against that lying bitch","post_message":"“What I’m going to do is I want to focus on 15 or so states because we have to win, and I want my energy to be put in the states where it could go either way,\" Donald J. Trump said. \"And we’re going to play heavy, as an example, in California. No other Republican would, they wouldn’t even go to dinner in California. They wouldn’t do it.”"},{"comment_id":"952261771573668","commenter_b":"You don't have to like Trump to have your PUSSY groped!","commenter_a":"I'm telling ya people, you dont have to like Trump personally but you all have to get out there to vote for him to stop this stuff. Its unreal. Its almost like we are living in 1960's Soviet Union.","post_message":"This makes me sick..."},{"comment_id":"10152844746900667","commenter_b":"Gross looking. Many times, less is more.","commenter_a":"Ugly colors.","post_message":"\"Beautiful things happen when you take pride in yourself. #blackgirlsrock #kyebreaktheinternet,\" the prom queen wrote."},{"comment_id":"953914171315722","commenter_b":"I do agree that woman look proactive in these yoga suits. I always wear a long shirt over mine. Why cant these young women use some common sense.","commenter_a":"I am not responsible for someone else's thoughts.","post_message":"This woman's response to the idea that women should dress in a way that prevents men from having lustful thoughts is both amazing and hilarious:"}]
