[{"comment_id":"1065756060184114","commenter_b":"Scums they are.","commenter_a":"So not only do Republicans want to send our children to war while Bernie wants to send them to college, they now want our soldiers to suffer longer so they can continue their attempts to bash Obama and destroy our great country. These Republicans need to be put in a POW camp until after the election. Scum of the Earth!","post_message":"This is absolutely disgraceful."},{"comment_id":"10156142090560594","commenter_b":"I know","commenter_a":"Go back to Brooooooooklyn. Where you belong.","post_message":"If we can't have San Francisco Giants postseason wins, this is the next best thing."},{"comment_id":"1091470624223610","commenter_b":"I beg the differ sir! Here's one for Trump!! I want at first, but as this plays out, he is the only out sider I trust!!","commenter_a":"You are so wrong again. Stop you are losing all credibility. Your own hate for Trump, is going to be the end for you.","post_message":"\"You're damn right.\""},{"comment_id":"10153483472878188","commenter_b":"How can he even be called a woman when he still has his man parts?","commenter_a":"I cannot phantom bestowing the Arthur Ashe Award to this person that has done nothing to deserve it. nOTHING","post_message":""},{"comment_id":"10155065257093984","commenter_b":"There is no doubt Israel or Jews were there first. As far back as 2166 B.C., some say as far back as 4000 B.C.. Arabs or Muslims first recorded being there 853 B.C., Mohammad wasn't born until 570 A.D..... The size of Israel is 12,877 Sq. mi. about the size of New Jersery... The size of Arab, Muslim land is 8,368,272 Sq. mi., and consist of 20 countries. That would be the size of putting together (Texas and Alaskas) 8 times.... Over the years Muslims have attacked Israel, even combining countries to fight Israel and have lost every time to Israel's strong military. During peace talks, Muslims have never given up anything to Israel. Whereas everytime Israel has given up land to Muslims, they have used the land to move closer for attacks against Israel. Muslims do not want peace with Israel. They have said they will not coexist with ...","commenter_a":"NBC is one of the least creditable news sources. The beat goes on ! Time to boycott them.","post_message":"Talk about \"fake news!\" Here's how NBC was just BUSTED in a massive lie designed to make people think less of Israel. Here's what they had to say that has a lot of people outraged... This proves EXACTLY how the mainstream media feels about Israel..."},{"comment_id":"1109408939099898","commenter_b":"yaaaassss bitch yasss","commenter_a":"Angela Swartzel Melinda Bailey Mallory Brogli Chelsea Pande Roma Rispoli Kunia Rodrigues Carmel Rae Anne Mellies @username Jackie Smith fucking dyingggg😂😂😂","post_message":"That Voice Over! (Free The Monkey Though)"},{"comment_id":"1173361852693721","commenter_b":"Oh oh, look out behind Hillary, she has her gass again, and gives it up to everyone on stage.","commenter_a":"Liar Hillary she just can understand that lying is not normal well I guess it is for her and Bill and Obama and her Party.","post_message":"Donald J. Trump is calling Hillary Clinton a liar, openly calling her a liar for making up that story about his being a recruitment video for ISIS. He's now demanding an apology for her lies."}]
