[{"comment_id":"10154424174381162","commenter_b":"It's the Ocean. Dangerous animals live there. Leavem alone","commenter_a":"Or he could have just left it alone and the family move to a safer place? Sounds so unnecessary...","post_message":"A dad celebrating Father's Day wrestling an alligator on a beach before it's able to attack his family and others. FULL STORY: @webpagelink"},{"comment_id":"1689857144590196","commenter_b":"I say do it, and take it even further....stop immigration altogether until a proper vetting system is implemented!!!","commenter_a":"It is unAmerican and wrong to have different rules for people of another religion. Have we really come to this? We are a free nation of fearless people, this is an insult to our national character. Trump would use that fear to further his own short term goals and incidentally the long term goal of ISIS to drive a wedge between Muslims and the rest of the world.","post_message":"Republican candidates are set to take the stage tomorrow for the final #GOPDebate of 2015. So, what do Donald J. Trump's friends think of his proposal to ban Muslim immigration to the U.S.?"},{"comment_id":"10153292448497235","commenter_b":"Dear, ditzy Megan does her best to serve her corporate owners and their agendas. Sorry, that leaves no room for accurate reporting.","commenter_a":"Never liked Kelley she lies all of the time. Looks so smug.","post_message":"\"Fair and Balanced,\" huh?"},{"comment_id":"10153906233727522","commenter_b":"Hillary is so obese she looks pregnant in that photo!","commenter_a":"What a bull crap fake news article. Dont blame the constitution for running a more flawed candidate.","post_message":"It's possible to win the Electoral College while winning only 22 percent of the national popular vote."},{"comment_id":"10155137822548984","commenter_b":"@username hold your breath you retarded bitch and see witch comes first.","commenter_a":"He has done more in one or two days against ISIS, than Obummer had done in 8 years! On the other hand Obummer has done more to help ISIS and Iran in eight years than all countries combined!","post_message":"General James 'Mad Dog' Mattis just showed everyone why Donald Trump chose him to be secretary of defense. ISIS is in for a rude awakening..."},{"comment_id":"999172976798392","commenter_b":"Corruption in the state department is at an all-time high.","commenter_a":"Where does obeying law fall in this action? Do you collectively feel above the law and justified in defying it? Perhaps a bit of prison time and being branded as felons for the rest of your miserable entitled life will bring you back to your senses.","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"10153778649078854","commenter_b":"This witch should have been fried after being tried!","commenter_a":"a bullet does not cost much and in this case it would definitely improve the penal figures.","post_message":"Mother Sentenced to 25 Years in Prison After She Presented an FBI Informant with a Disturbing Offer"}]
