[{"comment_id":"10153196392273984","commenter_b":"Hey Stupid! Thanksgiving is a day of thanks not a stupid holiday for your illegals and muslin buddies. Let it be! Stop destroying this country.","commenter_a":"Can we get rid of him, NOW!! Outrage doesn't even begin to describe this!! Leave things be!!","post_message":"Unbelievable. There's no way Americans are going to stand for this... Are you outraged?"},{"comment_id":"10153471115269087","commenter_b":"If i was Trump i would stay away from that dumb broad.","commenter_a":"GO PRESIDENT TRUMP 2016!!!!!!","post_message":"You’ve also said, “She can pick winners!'\" Bristol Palin said of her mother Sarah Palin. \"I hope you’re right, and that she endorses Donald J. Trump today for President.\""},{"comment_id":"1427245267295499","commenter_b":"Half a gallon of milk. $2.50, a box of cereal can be found for under $5 in your local hood supermarket lol come on people, don't be this stupid. Don't be the person who goes out for $7 cereal.","commenter_a":"If it comes with refills, I'm in!","post_message":"It better be a gr-r-reat bowl of cereal."},{"comment_id":"621998441316699","commenter_b":"Sadly many get all their\"information\" from the globalist owned main Street media........the sheep are being led to slaughter!!!!!!","commenter_a":"The problem is, NO BODY WHO SUPPORTS HILLARY CARES!!! The amount of hard evidence, current criminal offenses is mind boggling... but her supporters just don't care... she shouldn't even be allowed to run...","post_message":"Uh oh..."},{"comment_id":"829720727076952","commenter_b":"Where all snakes live","commenter_a":"The fall of Ramadi to ISIS demonstrate Obama's success.","post_message":"Must be a comfortable rock the White House is living under..."},{"comment_id":"1008378105905084","commenter_b":"She has more than a few screws loose!!!!","commenter_a":"Which Koran.","post_message":"Nancy Pelosi Quotes Mohammed and Pushes Islam at the National Prayer Breakfast"},{"comment_id":"10153191924801051","commenter_b":"really wow is all i can say about most of the post. what i have to say on this. i hope the gangs keeps to themselves and kill eachother off only and not hit any one that is not in gangs and not hit children. this world would be better off with out them and there needs to be an end to the gangs white or black there needs to be an end to them and i hope this would be the end. they need to do this more offtin if it gets rid of the riff rats and drugs and robberys and help brings the streets safer. and we might not have to see anyones butts any more. they really need to pull their paints up. i dont like that my kids has to see such things. total disrespect. the ones that love in peice would love this","commenter_a":"maybe the police should see how many gang banger's they can kill in 1900 day's","post_message":"Two gangs in this city are holding a contest to see how many people they can kill in 100 nights. #100Days100Nights,"}]
