[{"comment_id":"1264843663556103","commenter_b":"Christianity will not be dead, extremist Islam will keep it from dying and drying out. BTW atheist here.","commenter_a":"Because \"Christmas break\" is very Biblical. -.- I am so sick of these people hijacking God and MY Faith for their asshattery and hate. It's repulsive and they are such an embarrassment. And this is why Christianity will be dead in the US within the next 50-75 years.","post_message":"This kind of ignorance has no business influencing school children."},{"comment_id":"10153322465354575","commenter_b":"That's no lady.","commenter_a":"F that lady","post_message":"A veterinarian posted this picture on Facebook with the caption: \"My first bow kill, lol. The only good feral tomcat is one with an arrow through it's head! Vet of the year award ... Gladly accepted.\" The cat was a family pet named Tiger, and now she could face charges."},{"comment_id":"10156146620705354","commenter_b":"Europe","commenter_a":"It's probably too late for Europe. It's not too late for the USA, but economically and socially we are following Europe's example.","post_message":"\"Islam Will Be the Death of Europe\""},{"comment_id":"10154964534141337","commenter_b":"@username so then why is everyone so butthurt about other immigrants coming in? What's done is done, they got in, the end","commenter_a":"An awful lot of illegally immigrated Europeans happy to see him deported on this page. Maybe you Mofos would be better off learning your native tongue, I know us Natives would love to see your cave dwelling, disease spreading barbarians back to where you emigrated from.","post_message":"Documenting the heartbreaking and unbelievable deportation of South Korean man Adam Crapser"},{"comment_id":"10153796772929411","commenter_b":"They kill civilians anywhere they go. Worse butchers then IS nearly..","commenter_a":"Terrible.","post_message":"US special operations analysts investigated #Kunduz hospital for days prior to the deadly October 3 attack, describing it as a base of operations for a Pakistani agent coordinating Taliban activities, despite despite repeated pleas by the MSF."},{"comment_id":"1267016713333785","commenter_b":"Spanish and Latina aren't synonyms- Latina=a woman from Latin America. Spanish is from Spain. Jsyk !","commenter_a":"It's not really a stereotype when the cleaning industry is dominated by a majority of Latina woman. But I agree Latina women shouldn't be isolated to only this role, Spanish women work in a wide range of fields including healthcare, law and science. Many of these women have gone on to play great roles that where not maids. You start from the bottom.","post_message":"It's time to stop casting Latinas as hot-headed, sexy, maids."},{"comment_id":"456327834562277","commenter_b":"They are a matched set, failed business woman and failed politician.","commenter_a":"As for CARLY supporting Cruz SHE wants the VP spot and this is her ONLY chance! Tying herself to Cruz who will allow lying, half truths, whatever it takes to get into OUR White House! Carly Fiorina said BEFORE this establishment endorsement, that she found it that fellow candidate Sen. Ted Cruz, didn renounce his dual citizenship until 2014, and that Cruz one thing in the drawing rooms of Manhattan, and another thing in the living rooms of Iowa ! NOW it seems, Cruz brokered a deal with Carly AND SHE WAS BOUGHT! Talk about a SHILL Fiorina is a TOTAL GOP ESTABLISHMENT SHILL!","post_message":""}]
