[{"comment_id":"1248206901866985","commenter_b":"Ali Berdai haha","commenter_a":"Alex Bond","post_message":"By Liz Climo."},{"comment_id":"10152885011267507","commenter_b":"Woman put up with it because we are use to it. Woman are also so busy and have not prioritized changing this. Women will eventually say enough of this nonsense and put a stop to it for good. It is only a matter of time.","commenter_a":"Women in other developed countries are getting treated better ! Why do American women take this abuse ? No paid maternity leave , no paid sick leave , no paid or very meager paid leave , WTH is wrong with American women demand it and demand it now!!!","post_message":"Let's be good to our mothers today and EVERY DAY!"},{"comment_id":"977838925598355","commenter_b":"Yes!","commenter_a":"Yes","post_message":"What do you think? Ferguson? Baltimore? Black Lives Matter? We've never seen so much division!"},{"comment_id":"10152869949930796","commenter_b":"I once had a panhandler tell me he was a wounded veteran who couldn't find work. Knowing that there are many homeless veterans (a shame of it's own that needs addressing) I decided to ask about his service record, branch, MOS, duty station, etc. Being from a military family, and having served myself, I quickly noticed that his story was bogus. Point being, many of these guys are fakes. BPD wasn't shaming anybody, just pointing this fact out.","commenter_a":"No apology necessary! Thank you for keeping us informed.","post_message":"“They are using the power of the written word and incorporating fear to get you to think the worst of your fellow man,” activist Pat LaMarche wrote of the Bangor Maine Police Department in a paper she handed out Monday by the police station."},{"comment_id":"593055850861224","commenter_b":"AmandaSmith I understand but people wake up in Florida and sometimes find Alligators walking in their yards or in the bottom of their swimming pools. Disney World was actually built around swamps. Yes they altered the swamps and created the lagoon but it has always had alligators in it. Sorry a toddler died because of the lack of understanding of that fact.","commenter_a":"Give me a break. My 7 year old heard about this and the first thing she said is \"why would they go near the water? It's Florida! Everyone knows there are alligators in Florida!\". We are from Wisconsin.","post_message":"A case against Walt Disney World would hinge on whether or not the resort knew about the alligators living in the resort's Seven Seas Lagoon."},{"comment_id":"817764698322138","commenter_b":"What Melissa said !!","commenter_a":"You know if everyone hates you, you must be doing something RIGHT. Trump isn't an ASS KISSER.","post_message":"\"I understand why he got angry. She was asking insulting questions.\""},{"comment_id":"606144009518781","commenter_b":"She didn't get the revenge my butt would have gotten......I would have burned the house with him IN it chained to the bed.","commenter_a":"I agree that he should have been inside too bad that's cruel and unusual punishment. What kind of person does something like that to a child?!?!! Happens all the time unfortunately :( Exactly why I don't let my kids our of my sight, too many crazies in the world.","post_message":"The only thing better would have been if he was inside. ;)"}]
