[{"comment_id":"10154768873318132","commenter_b":"First off who the hell is she ? I've never even heard of her . Lol like seriously what does she do ? Furthermore nobody really cares about her opinion because it's a very poor one. More important things going on in the world then you crying about someone not hitting on you he probably doesn't even know who she is","commenter_a":"It seemed pretty clear to me that she was poking fun at herself, talking about her own feeling, not bashing the athlete in any way. Can everyone just relax and remember that everyone is entitled to their opinions and their own insecurities and maybe, just maybe, not twist every single thing that anyone says into something offensive? Geeeeeeeez!","post_message":"Lena Dunham is setting the record straight on her comments about NFL star Odell Beckham Jr."},{"comment_id":"1100594890039116","commenter_b":"Hillary would've crapped herself... oh wait she probably already did...","commenter_a":"Another fake attempt 2 lure in sympathetic voters?","post_message":"Trump’s top aides baselessly pushed the idea that it was an assassination attempt."},{"comment_id":"10154204530456037","commenter_b":"Pussy","commenter_a":"Muslim obama has destroy the military.","post_message":"The accused spy, Lieutenant Commander Edward Chieh-Liang Lin, has been in the Navy since 1999 and has won several awards, including two Navy/Marine Corps Commendation Medals."},{"comment_id":"10153080990943812","commenter_b":"Scumbag","commenter_a":"Why wasn't the mother given custody ? Custody was given to a parent with mental ssues ? This is not the rest of the story yet . Florida fails aagain and again we hear about more changes. Meanwhile NO ONE is held accountable and a child is dead. Oh well.","post_message":"UPDATE: Attorney says she reported to authorities that father was acting erratically before he allegedly threw 5-year-old girl from bridge to her death in Tampa Bay: @webpagelink"},{"comment_id":"1088954241145047","commenter_b":"To all the women bitching","commenter_a":"He paid 50,000 for it! It's his! You big fat sissys!","post_message":"The identity of the American man who lured a treasured African lion out of a national park, shot it, stalked it for two days, then beheaded and skinned the animal, has been revealed. He's a dentist from Minnesota."},{"comment_id":"10154199374772894","commenter_b":"Women need to stop playing themselves. He only wants money on his books.","commenter_a":"Well it's the thought that count.. At least she know that and accept it for what it is... But some of these hoes don't know bout that tho","post_message":"ICYMI: Apollo Nida Gave His New Fiancée an Engagement Ring Made Out of Paper Towels [Photos]"},{"comment_id":"10153775888041756","commenter_b":"Some of these countries send their boys to war as young as age 6. That's gendercide too. And a much more painful form of it. Like in Sparta where they would kill the boys if they didn't have a warrior's body. Male disposability exists throughout the world including the West. And it persists regardless of the sex of the leader. The Queens of England ruled half the world for long periods of time but it was still the men who were disposable. I would never expect the mass media to address that. Not for another hundred years that is.","commenter_a":"Those are going to be some very unhappy boys.","post_message":"Technology has enabled even the poorest of countries to boost the ratio of boys over girls. One expert even goes so far as to use the term \"culling\" when talking about what's going on in these countries — a word otherwise reserved for describing the removal of undesirable animals from the herd."}]
