[{"comment_id":"644569865731305","commenter_b":"Robert, no one on earth has even 1 trillion dollars. Bill Gates according to Wikipedia is the richest man on earth with a net worth of 75 billion dollars.","commenter_a":"I know that Trump is not for just one race. Trump is for all races. If you will just vote for him you will find out he will be for every one in American.And he believes in GOD. GOD bless Trump.","post_message":"MEDIA BLACKS OUT..."},{"comment_id":"902087636648479","commenter_b":"She needs to pack it up and leave!","commenter_a":"Please take her off Facebook I cannot stand looking at her","post_message":"Whoopi Goldberg has done it time and time again. She really needs to learn her place. Do you think she's gone too far?"},{"comment_id":"10153022390127217","commenter_b":"Stupid, sexy, popular flanders !","commenter_a":"@username 👍🏽","post_message":"Let's hear some noise for Okilly Dokilly"},{"comment_id":"10153521942669369","commenter_b":"Criminals will just buy another brand.","commenter_a":"Good. Maybe less guns on the streets.","post_message":"It's the end of an era."},{"comment_id":"10152980624100667","commenter_b":"Not.","commenter_a":"The Ross Perot of the 21st century :/","post_message":"Donald Trump declined to rule out a third-party presidential bid Thursday if he loses the Republican nomination. \"I will not make the pledge at this time,\" Trump said at the start of the GOP prime-time debate."},{"comment_id":"1260485777320174","commenter_b":"I can't wait for President elect Donald Trump to take office and start tossing out the undocumented illegals..........I hope this joker is the first to go.","commenter_a":"that is so sick they should kick them all out","post_message":"BOOM! (WATCH)"},{"comment_id":"1265882336765127","commenter_b":"And yes that woman looks horrible because she over does it ...like I said I wouldn't suggest coming every day for the rest of your life","commenter_a":"Ummm....I am a tanning salon OWNER! You are are misinformed in your information as we all have taken classes about tanning. My mother died of melanoma and never tanned a day in her life we get SOOOOO MANY people with medical conditions who have to tan some of which are young girls. Now they passed the new law in 2014 on minors but we are WIDELY sought out and remained a tanning salon for 17 years!!! You have to educate yourself on it. The media is giving it such a horrible rep just like they do with everything to make you all freak out the exact way u are. If we didn't know what we were talking about then why do we have clients come who beat breast cancer with a doctors note or psoriasis or cystic acne or ms eczema the list goes on. Your body NEEDS vitamin D ...","post_message":"The FDA proposed unprecedented new rules Friday that would bar anyone under 18 from using a tanning booth or sunlamp."}]
