[{"comment_id":"10153515397661509","commenter_b":"Race and gender identity are two totally different issues lol","commenter_a":"That's disrespectful. If it had been a white person doing a racist joke. There would be no question if he crossed the line.","post_message":"Do you think Jamie Foxx crossed the line? Many viewers of the iHeartRadio Music Awards weren't too happy about his Bruce Jenner joke: @webpagelink"},{"comment_id":"10153035493893822","commenter_b":"Gross. She needs to go back.","commenter_a":"Why isn't she in jail?","post_message":"Connellsville woman charged for having sex with a 14 year old boy. The boy actually dated the woman's late daughter, who died back in June of 2014."},{"comment_id":"10152691243492217","commenter_b":"@username we're good at sports that don't matter","commenter_a":"Jason Mulford","post_message":"Watch out, Katniss Everdeen."},{"comment_id":"10153071085836051","commenter_b":"Kill that bitch!!!!","commenter_a":"Hell hath no fury, right? Sick, sick, sick.","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"10153255280801336","commenter_b":"You can't fix stupid. She was stupid before she went to college or she wouldn't have come out that way!","commenter_a":"Lol GW created ISIS... yeah, and Obama is the best President we've ever had. I think you should get a refund for your college tuition, because it's not working...","post_message":"College student to Jeb Bush: \"Your brother created ISIS.\""},{"comment_id":"10154668593434062","commenter_b":"Yes, and the NFL approved it and promoted it. If you're going to boycott anything it should be NFL products.","commenter_a":"For those that are clueless or ignorant, she endorses and is promoting the black panther party, which is a racist militaristic organization whose motto is literally \"kill whitey\".","post_message":"Online opinions are intense."},{"comment_id":"433149650143409","commenter_b":":)","commenter_a":"done & done","post_message":"\"Work hard, play hard,\" is the lie they want you to buy. #fuckwork"}]
