[{"comment_id":"925455207491820","commenter_b":"Buzz off Kim and take Kanye with you. Both of you suck....","commenter_a":"Wasn't it Paris Hilton that didn't know what Wal-Mart was?","post_message":"Here's how Kim Kardashian responded when asked to react to Megyn Kelly calling her look \"enhanced.\""},{"comment_id":"577340679100840","commenter_b":"If you don't leave america it will be the end of us","commenter_a":"Yeah. We've survived Obama. Barely.","post_message":"And that's not all he said either..."},{"comment_id":"10152816643679877","commenter_b":"She don't need to she's not Muslim","commenter_a":"They would criticize her either way. If she wore it, they would be hollering about how she supports terrorists, then the ignorant right wing tea party types would link it to Obama being a Muslim.","post_message":"Oh boy, they're coming for Michelle Obama for not wearing a headscarf in Saudi Arabia. Read more about her critics below. Grio fam, this seems foul to us. What do you think?"},{"comment_id":"10153200362991943","commenter_b":"Cause she's sn idiot","commenter_a":"obama and his ilk will kill us long before the climate.","post_message":"Why is Obama EPA administrator, Gina McCarthy trying to scare Americans into believing \"Climate Change\" could kill them?"},{"comment_id":"905233582940760","commenter_b":"So they can rape your children","commenter_a":"No way","post_message":"Obama Admin Proposes Plan for Americans to \"Adopt\" and \"Sponsor\" Muslim Immigration into the US @webpagelink"},{"comment_id":"10153471115269087","commenter_b":"If i was Trump i would stay away from that dumb broad.","commenter_a":"GO PRESIDENT TRUMP 2016!!!!!!","post_message":"You’ve also said, “She can pick winners!'\" Bristol Palin said of her mother Sarah Palin. \"I hope you’re right, and that she endorses Donald J. Trump today for President.\""},{"comment_id":"10153796202658797","commenter_b":"I sure am glad this lady didnt work at a bank....","commenter_a":"really?? you're going to fire a pregnant employee for being robbed? how dumb and stupid and idiotic can they be? are they blind and deaf SHE JUST GOT FREAKIN ROBBED. i say sue them dumbasses","post_message":"YOU'RE FIRED! Marissa works at a fast food place. She’s 5 months pregnant. Imagine her terror when a gunman jumped the counter and demanded money. He got away with nearly $400. But Marissa says the store blames her. They gave her a choice: She can pay back the money or lose her job. But the store has a very different story:"}]
