[{"comment_id":"1068356466583942","commenter_b":"Chris clown is a pussy ass retard all this motherfucking bitch can do is beat on women","commenter_a":"Asswipe","post_message":"Chris Brown Threatens Trump And The Police: ‘Black People, Go Together 40, 50 Deep’ ⋆ UFP NEWS @webpagelink"},{"comment_id":"1369207093090488","commenter_b":"The woman is pure evil","commenter_a":"It's time for women to shine, it's Been over due. I'm so proud a women is going to be the next President of the United States 2016 for the 20th century","post_message":"LIVE: Democratic Presidential nominee Hillary Clinton speaks at Democratic National Convention."},{"comment_id":"465155073666373","commenter_b":"Tax and spend.....are investments in our society.","commenter_a":"The problem with liberals they preach their beliefs and are hypocrites. Look at All Gore with his huge carbon footprint. Yes science is real and climate change is real this coming from a conservative but unless we get our house in order this country won't survive. The answer from liberals is a carbon tax. Let's see gas and electricity go through the roof and see the gap between the rich, middle-class and poor widen even deeper. You have to live what you preach and ultimately politicians are out only for themselves. There poor decisions impact the masses and we all need to wakeup. The problem with liberals is they think everyone who doesn't believe exactly like them are bigots or racists and there is no compromise. Tax and spend is not the answer the rich just find new ways to hide it and the middle class families keep falling into ...","post_message":"More proof they can't deal with facts."},{"comment_id":"10157357339200354","commenter_b":"Nope don't thonk so. We the people have spoken.","commenter_a":"I think billy needs to brexit.","post_message":"If at first you don't succeed..."},{"comment_id":"10157069343155354","commenter_b":"@username that is exactly what I said she would be the second biggest mistake","commenter_a":"It is about time all realize all that comes out of his mouth are lies he has seven more months to tear our country apart I saw this before his first election do not make the same mistake twice to vote for Hillary she is a continuation of Obama and if she gets in the only way we can restore our fore fathers Constitution is through force I am a Veteran and will stand by the oath I took at enlistment to defend the Constitution against all enemies foreign or domestic so help me God do not screw with my country","post_message":"Obama is a global rock star no more..."},{"comment_id":"10153292448497235","commenter_b":"Dear, ditzy Megan does her best to serve her corporate owners and their agendas. Sorry, that leaves no room for accurate reporting.","commenter_a":"Never liked Kelley she lies all of the time. Looks so smug.","post_message":"\"Fair and Balanced,\" huh?"},{"comment_id":"10152522515306717","commenter_b":"Trust bitch, more Gays will flock to Nikon, you're obviously a total moron","commenter_a":"Won't be buying anything from that company or my family or friends Adam and eve people not Adam and steve","post_message":"Click here to follow LGBTQ Nation on Twitter: lgbtqn.at/tw"}]
