[{"comment_id":"10153326562398812","commenter_b":"Oh really? If that had been me, or any other black woman in this country, our black asses would have been thrown under the Jail the first time it happened and my children would have been taken from me with no chance of hardly seeing them let alone getting them back! They would charge me with felony endanderment also! But these two ol'birds get a second chance to do it and even have entitled it 'Free Range Parenting'! Ain't that somethin'! Exploring their independence would happen when they are of the age of independence. If you still write them off on your taxes, you are responsible for them! And just what are these wonderful parents doing while these babies are at the park and walking alone through town for any demented minded criminal to snatch?? SMH! I tell you, it must be nice to live by your own laws and ...","commenter_a":"So it's now a crime for parents to let their kids go to the park? What are they suppose to do put them on a leash and take them out for walkies.","post_message":"UPDATE: 2 Maryland \"free range\" children taken into custody again: @webpagelink"},{"comment_id":"10156237549955231","commenter_b":"Apples and oranges. American problem vs not America's problem","commenter_a":"White Christians have committed more acts of terrorism in America than Muslims. Some of you are clearly stupid & misinformed","post_message":"It doesn't help that Trump has been \"fanning the flames\" with his anti-Muslim talk."},{"comment_id":"10154569293118132","commenter_b":"Her eyes are evil!!","commenter_a":"I think she was beautiful. This story has haunted me since it broke. Her and her daughters seemingly had a lot of love for each other. This is so tragic and so sad.","post_message":"5 things you need to know about Christy Byrd Sheats, the Texas mother who shot and killed her two daughters. (Via People True Crime)"},{"comment_id":"828004503968344","commenter_b":"The world is better off for her decision. Her kids wouldnt only be stupid...they'd be ugly as hell too!","commenter_a":"Damn good thing she doesn't want children. We don't need more idiots like her. Just imagine how brain dead her offspring would be.","post_message":"Liberals are repulsive Dc Gazette (y)"},{"comment_id":"10153707555079753","commenter_b":"She racist trash","commenter_a":"She's a racist pig white lives matter she needs to move to Canada allso","post_message":"Apparently, Beyonce was only getting started when she hit the Super Bowl halftime show with the debut of her new song “Formation.” On Saturday, one of Beyonce’s fan clubs, The BeyHive Team, announced that she will be putting together another music video with the help of the parents of Trayvon Martin, Mike Brown and Tamir Rice according to The Grio. Rice, Martin and Brown have all become familiar faces in the Black Lives Matter Movement. According to reports, Beyonce’s new music video will... @webpagelink"},{"comment_id":"10153370823461336","commenter_b":"Well Ryan it is better than putting Jenner on the bill","commenter_a":"Megyn Kelly","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"1778455155709145","commenter_b":"Didn't \"us\" apes breastfeed your people? Lol...Some people were too lazy to breastfeed their own damn babies. Got some of that ape milk in ya'll system still from slavery!! 😏","commenter_a":"Black guy deserved it stupid black idiot not being racist being honest the black guy should have kept his mouth shut why was he at the Donald trump convention if he did not like Donald trump black retard","post_message":"The 78-year-old white man accused of punching a black protester in the face at a Donald Trump rally in North Carolina made his first court appearance on Wednesday. If found guilty, how would you punish him?"}]
