[{"comment_id":"1264161686965709","commenter_b":"Sounds like the brides need to chill the hell out lol i would rather go on a awesome honeymoon then spend that kinda money just to walk to a isle... But that's just me and I'm a very different kinda women.","commenter_a":"Retarded....","post_message":"And about $16,000 of that is for the venue alone... STORY: @webpagelink"},{"comment_id":"756120254539294","commenter_b":"Dont \"let\" her leave America, MAKE IT LEAVE AMERICA! !!","commenter_a":"I thought Rosie was leaving?","post_message":"It's no secret that Rosie O'Donnell and Donald J. Trump don't like each other very much. But what she just did took things WAY too far..."},{"comment_id":"10153807572957169","commenter_b":"@username , so all women should quit tomorrow and stay home with their kids. Yeah, that would work out well.","commenter_a":"No, they are not even close to equally important. Your job raising your kid is far more important.","post_message":"It’s time we acknowledge that working parents have two jobs — the one at work and the one at home — and both are equally important to our economy (From PBS NewsHour)"},{"comment_id":"677448822404448","commenter_b":"These women are idiots!!!!!!!!!!","commenter_a":"OMG!!!","post_message":"\"We finally have this god that's going to come down and help us all.\" Here's what two \"Trumpettes\" think about Donald J. Trump's Twitter rant against former Miss Universe Alicia Machado. Watch more: @webpagelink"},{"comment_id":"1820350008207308","commenter_b":"She will sell us out to the highest Middle Eastern bidder","commenter_a":"GIVE US A LIKE! -----> @username your TRUSTED Conservative News","post_message":"TRUMP LIVE! Donald J. Trump Rally in Sioux City, IA Like us for TRUSTED conservative news---> Freedom Daily"},{"comment_id":"10152973600191336","commenter_b":"Na she's not crazy . Mothers turn super human when someone hurts or almost hurts their kids","commenter_a":"Ok...pretty sure this woman is cray-cray...not a protective mama bear, but whatever","post_message":"A wild police chase in Dallas came to an end thanks to a protective mother."},{"comment_id":"10153600653569062","commenter_b":"Usa, invaded my country,so they have to clear the mess that's,they did over there then we'll back","commenter_a":"All you Muslim loving people need to move to a Muslim country and enjoy your Muslims.","post_message":"Your thoughts on this? Roughly two dozen sign-wielding protesters repeatedly tried to vocally overpower speakers at Texas Muslim Capitol Day."}]
