[{"comment_id":"10153373232208984","commenter_b":"Wow!! Such nasty, foul mouth comment from a woman. First Lady has more class than you will ever know.","commenter_a":"Yes we can not wait to get a real first lady again this nasty racist bitch needs to fk off","post_message":"I thought I'd seen every attempt at the race card possible, but this is definitely a new one... Do you look forward to Michelle leaving the White House?"},{"comment_id":"10152865946012293","commenter_b":"Married men have to make more. There are others to provide for.","commenter_a":"Jamal Barcillano :)","post_message":"Marriage appears to transform men’s approach to work and the way employers treat them."},{"comment_id":"10153602966152217","commenter_b":"@username what a silly girl.","commenter_a":"Because corruption in Nigeria is a way of life practised at all levels of society and to suggest a correlation between corruption in Nigeria and in Westminster is fatuous and ridiculous, that's why.","post_message":"Why is David Cameron \"lecturing\" Nigeria and Afghanistan on corruption when Tory MPs are being investigated for potential electoral fraud? That's the question raised by the Scottish National Party's Angus Robertson. @webpagelink #PMQs"},{"comment_id":"10154567902453812","commenter_b":"Another Illegal Alien Speaks","commenter_a":"He's gonna sue again and ask for emergency federal money again!","post_message":"Texas Gov. Greg Abbott sustained \"extensive second- and third-degree burns\" on both legs and could miss next week's Republican National Convention."},{"comment_id":"10155891268485354","commenter_b":"Don't give a Shi# what race you are do something like this and it should be automatic death penalty!!!!!","commenter_a":"I'm surprised you can say \"black\" gangs. any one that can do that to another human should be swiftly executed for their absolute worthlessness to society.","post_message":"The gang of 6 forced \"the male victim to watch as his female companion was gang raped.\""},{"comment_id":"10153281993713132","commenter_b":"She's beautiful, they would make a great couple","commenter_a":"What!?!?! Noris Lizbeth Robles","post_message":"But don't expect them to open up about their maybe-relationship any time soon. #Oscars"},{"comment_id":"962133447168441","commenter_b":"Ok first of all don't try to tell me there was no raiping in euroup until the emigrants got there it's just the fact that a raipest is a raipest no matter where he is so you shouldn't go around saying imegrants are raipests hide your wives and kids I mean grow up dude","commenter_a":"Imagine if an immigrant did the same thing in Europe. I guess the title (and the comments) would be totally different!!","post_message":"A tourist has captured spectacular views from the top of a pyramid he illegally scaled in Egypt. (Video credit: Caters TV.)"}]
