[{"comment_id":"10153093023857293","commenter_b":"Ha Ha Ha!","commenter_a":"the Republican brand has been damaged long before Trump! He is just icing on the top!","post_message":"The head of the Republican National Committee wants Donald J. Trump to tone it down."},{"comment_id":"10153840747221336","commenter_b":"Let every congressman in Washington put up 10 \"refugees\" each in their own homes. The White House could take care of at least 100 of them. Just keep them out of our towns and cities.","commenter_a":"\"Stupid is as stupid does.\" - Forrest Gump","post_message":"On Monday, Governor Greg Abbott announced that he sent a letter to President Barack Obama saying that Texas will not take any Syrian refugees in light of the Paris attacks."},{"comment_id":"10154134010956323","commenter_b":"Be careful, please. Chose a president because she is woman is sexism. Here in Brazil we already had our first woman president, and this brought to us hope about a better country, but now she is under impeachment process due responsibility crimes made and allowed by her. This not means that women are worst than men, au contraire, I have been working with many managers, directors and executives women and found professionals better than men. Point is, be careful with WHO is the woman you are choosing.","commenter_a":"No.","post_message":"\"Following a decisive victory in New York and with her path to the presidency ever-more surefooted, the possibility of the first female president is sinking in. And whatever your feelings about Hillary Clinton as the vessel for this achievement, it’s an extraordinary one.\""},{"comment_id":"1777641695853675","commenter_b":"Shirley Awalt Tuggle Check this out mama!","commenter_a":"Sidni Schneider Amber Kerstin Brown","post_message":"She's every inch a queen. Victoria, starring Jenna Coleman, Rufus Sewell, and Tom Hughes, premieres January 15th on MASTERPIECE | PBS. Watch a preview:"},{"comment_id":"1157767754287378","commenter_b":"This is the most ridiculous thing I have ever heard. NC, doesn't need this Administration deciding this issue for them! This administration is quick to bully states to legalize Gay marriage, overriding the will of the majority of people, bullying states to fall in line with their LGBT agenda. Counting the days til this administration crumbles.","commenter_a":"With all the crap that is going on and she chooses to fight this battle?","post_message":"“This is about the dignity and the respect that we accord our fellow citizens, and the laws that we as a people and as a country have enacted to protect them.” Attorney General Loretta Lynch formally announced that the The United States Department of Justice is filing a federal civil-rights lawsuit against the state of North Carolina, Gov. Pat McCrory, the North Carolina Dept. of Public Safety and the University of North Carolina over the state’s controversial “bathroom law.”"},{"comment_id":"10152892433531051","commenter_b":"What about the elderly and the disabled you stupid bitch.","commenter_a":"If you don't have Children, You shouldn't be drawing food Stamps!!\"","post_message":"This state just kicked 9,000 people off food stamps."},{"comment_id":"1197376426946372","commenter_b":"Closed minds are amazing to watch!","commenter_a":"Derogatory terms are part of their playbook. I'd repost this but for that in the title.","post_message":""}]
