[{"comment_id":"533221760173934","commenter_b":"If this CRAP ever does fly,WE the PEOPLE,aka The Government,aka TAX PAYERS,will be SUED by LEGAL IMMIGRANTS who became CITIZENS for a HEFTY PRICE($650 per or better)wanting their money BACK because these CRIMINALS got in for FREE and remain on the TAX PAYERS TEAT...Check the story on he IRS scandle of earned income tax credit for the illegals collecting on kids(nieces.nephews,kids)IN MEXICO...They are aware(news station expose')& claime it's up to congress to close the \"loopholes\"...","commenter_a":"a vow of silence would be greatly appreciated by all career politicians and family dynasty politics","post_message":"\"The people at the heart of this issue are children, parents, families, DREAMers. They have names, and hopes and dreams that deserve to be respected\" - Hillary Clinton"},{"comment_id":"10153907733031002","commenter_b":"I don't believe she \"deserved\" it at all. I also agree that a man that size obviously has other options to restrain someone. These girls need to realize these men aren't their daddy, brother, uncle.. They don't know how they are going to react, so they need to keep their hand to themselves. Neither party was right here.","commenter_a":"She Wasn't out of pocket. Just Because she was waiting for her brother that gave him the right to grab her up like she was an issue. This is a grown man, you don't punch a teenager on the face like she a man. He had no right to ever touch her, her brother was just trying to protect his sister, as he should.. PEOPLE are out of control.","post_message":"A mother is demanding answers after her daughter was punched during a heated exchange at a skating rink."},{"comment_id":"10154196330336770","commenter_b":"Beverly your character flaw is showing again! You need to get a job at disney oh I forgot your not a foreigner# you need to get a hobby!","commenter_a":"He isn't coming cause Trump plans to change the Visa programs so Disney will not be able to bring over cheaper labor and have Americans train their replacement anymore.","post_message":"Are you buying his reason?"},{"comment_id":"945496635572234","commenter_b":"She is selling us out to the Arabians","commenter_a":"Butcher of Benghazi","post_message":"WATCH LIVE: Hillary Clinton addresses a crowd in Miami to talk Zika virus"},{"comment_id":"10153315079826680","commenter_b":"Women are voting for her because she's the most qualified and she's been speaking up for us her whole political career. Not because we're shamed or bullied into it.#Imwithher","commenter_a":"And join her in hell","post_message":"POLITICO's Roger Simon says: It's a strange world when women are being shamed into voting for Clinton."},{"comment_id":"10156352332210354","commenter_b":"whore.","commenter_a":"Another one that is missing all that gray matter between the ears...","post_message":"Feminist Gloria Steinem is a _________________."},{"comment_id":"1214784961920643","commenter_b":"all these woman marching i wish they would say samething about us senior that can not get out of the house to help fight for our medicare and social security","commenter_a":"Marching in Tucson, AZ!! Yea! Ladies!","post_message":"LIVE NOW: Women's March in D.C., just one day after Trump's inauguration. MORE MARCH INFO: @webpagelink"}]
