[{"comment_id":"388738841314410","commenter_b":"Go home , get out of USA !","commenter_a":"GOAT HUMPERS","post_message":"Muslim Leaders Show How ALL Muslims really think...."},{"comment_id":"1129043100469880","commenter_b":"There is a woman out there thirsting for this man","commenter_a":"@username LOL","post_message":"He wants to be \"the complete father,\" and he's doing it one braid at a time. A video by Jess Blank."},{"comment_id":"10156669278135354","commenter_b":"Evil disgusting whore","commenter_a":"GRANNY couldn't tell the difference between LOVE and KINDNESS if her life depended on it!!! Her own husband had to go find love in someone else's arms cause she knows NOTHING about love!!!!!","post_message":"There was no \"love and kindness\" in Hillary's lies about Benghazi. It wasn't \"love and kindness\" when Hillary transferred 20% of US uranium to Russia for $145 Million in Clinton Foundation cash. \"Love and kindness\" don't describe her treatment of Bill's sex victims. Exposing US secrets through your server and destroying emails isn't \"love and kindness.\""},{"comment_id":"10154404367061037","commenter_b":"Get a life lady","commenter_a":"When trump loses I wonder what the trump voters that have outed themselves as racists and bullies are going to do, double down or deny it.","post_message":"Is Donald J. Trump's historic presidential run doomed to fail?"},{"comment_id":"1624969957723265","commenter_b":"That poor little girl. Her mother could have killed her driving around while heavily intoxicated. She clearly had time to buy and drink alcohol but not make sure there was food in the house???","commenter_a":"Don't have any sympathy for a mother that drives drunk with a child in the car. She could have killed her or someone you love. She should lose custody of the child.","post_message":"If you have blood flowing through your veins this video should make you furious! Watch it HERE: @webpagelink"},{"comment_id":"10153475441185329","commenter_b":"Bologna on stage lights sounds familiar.","commenter_a":"@username, I assume you have already done this many of times.","post_message":"This is how real men grill."},{"comment_id":"10153910482357464","commenter_b":"We don't need another illegal immigrant running our country!! Vote for Trump","commenter_a":"We don't need another Obama in office be smart!! Vote for Trump","post_message":"Spoke with Hugh Hewitt yesterday on the eve of the Nevada caucuses. You can hear the discussion here: @webpagelink"}]
