[{"comment_id":"10153515225917994","commenter_b":"Then leave the country!!!!","commenter_a":"Another flag that represents racism and hatred.","post_message":"Confederate flags: History or discrimination?"},{"comment_id":"636474266540179","commenter_b":"She's an idiot!!","commenter_a":"I watched her speech on the live stream and was absolutely blown away. Credit is definitely due to the writer, but Ashley's delivery was perfect. The emotion as well as strength behind those words brought tears to my eyes!","post_message":" am nasty like Susan, Elizabeth, Eleanor, Amelia, Rosa, Gloria, Condoleezza, Sonia, Malala, Michelle, Hillary! Ashley Judd at the Women's March on Washington"},{"comment_id":"952483414832934","commenter_b":"Don't tag me in anything, slut-shamer.","commenter_a":"Lyssa","post_message":"The details of the next season of American Horror Story are terrifying..."},{"comment_id":"1358265534191667","commenter_b":"She is an ignorant cunt and let some one break into her house and use it up and then she will change her mind","commenter_a":" .. . The problem is not guns. It is hearts without G-o-d. It is homes without discipline. It is schools without p-r-a-y-e-r. It is courts without justice. It is Obama willful destruction of the economy and good jobs, families to flourish. It is Obama directive to not enforce gun laws, giving himself the perfect excuse to label guns as the problem. Right out of the Marxist Playbook. HE is the problem. HE is the greatest traitor in the history of human civilization.","post_message":"The founder of Moms Demand Action for Gun Sense in America says she's done wallowing in disappointment following Donald Trump's victory last week."},{"comment_id":"10154677372708145","commenter_b":"Everyone who voted for trump should come together and pay for that wall if y'all want it so bad . So y'all can't stop crying ...Trump gonna pay to build it with yall money next president gonna knock it down. Have a good day","commenter_a":"Our POTUS... Treating this like he's on an episode of celebrity apprentice and needs ratings. We are screwed beyond belief...","post_message":"BREAKING: The decision comes after Donald J. Trump tweeted the meeting should be canceled if Mexico won't pay for a border wall."},{"comment_id":"1019570198153414","commenter_b":"She's a Witch!","commenter_a":"@username is showing us what a doucebag he really is. Desperate for people to believe such utter non-sense. Common Sean, the real hurricane is YOU for posting this as you are so full of hot air. lol The truth is \"The Ads were pulled when the news of the hurricane was brought to life not the other way around\" Trying to politicize an unfortunate event is plain evil and you posting this stuff to draw attention in the wrong way is absolutely @username like.. SAD Americans being fool by you.","post_message":"Absolute ghouls."},{"comment_id":"10156136666730725","commenter_b":"@username..so the Democrats will bring in foreigners who despise us and our way of life. Yes that will certainly help.","commenter_a":"Why are we not taking care of our homeless veterans better first?","post_message":"BREAKING: Secretary of State John Kerry says the U.S. will significantly increase the number of worldwide refugees it takes in over the next two years to help ease the Syrian refugee crisis ----> @webpagelink"}]
