[{"comment_id":"10154107303310286","commenter_b":"This has been my home longer than it's been yours.","commenter_a":"Go home","post_message":"#BREAKING: Organizers estimate around 250,000 people flooded the streets for the Women's March on Chicago – more than three times the expected attendance. Details: nbcchi.com/eWVXidj"},{"comment_id":"1569194983095765","commenter_b":"Immigrants need to assimilate","commenter_a":"I feel sorry for this woman, she is so ignorant. The capability of her brain being able to handle one language and one culture is probably the siza if a pea.","post_message":"A woman captured on video yelling racial slurs at a Spanish-speaking woman as they waited in line at a JCPenney store will be \"permanently banned\" from the mall where the incident took place once she is identified, Jefferson Mall officials say."},{"comment_id":"1142904239055165","commenter_b":"Cruz wants to stop illegal immigration. He or Trump will basically rescind all this lawless president's entire presidency in the first month.","commenter_a":"Don't bet on it. Remember, Cruz though he has his good points, he still \"wears the Republican & Special Interests chain\" he forged by accepting campaign contributions. Also, remember fort 7 long, long, long years...he didn't constatnly call for John Boehner (sober?) to call for The House Sergeant-at-Arms to arrest \"Barry O from Honolulu\" for multiple counts of High Treason, violation of The Presidential Oath of Office, failing to defend The Constitution, and counts of U.S. Treasuyr Embezzlement of Funds to illegally fund bogas business startups that failed, disappeared, and the money disappeared as well.","post_message":""},{"comment_id":"10153190438888812","commenter_b":"Plus many red states consider sand and salt a slippery slope toward Socialism.","commenter_a":"All the Yankees talking about \"that isn't snow!\" Must not realize how right they are. It's ice. It's infinitely more dangerous and icy in the south than it ever gets in the north.","post_message":"WATCH: \"It's over\" -- Snow and ice are still triggering dangerous, cringeworthy conditions on roads in much of the eastern US, including this Huntsville, Alabama, neighborhood - ABC News Weather"},{"comment_id":"473513952773114","commenter_b":"She lied about her heritage stealing the opportunity from someone truly deserving and you thought she was principled. Lieing Hillary, Crooked Hiawatha!","commenter_a":"All it sealed was the fact that the vote I thought I'd be casting for Elizabeth Warren in 2020 will have to be cast elsewhere. Then Candidate Obama nailed it in 2008 when he said Hillary Clinton will change nothing, but say anything. A few pressers with Elizabeth Warren won't convince me that Hillary Clinton has suddenly become more progressive. It will just let me know that Elizabeth Warren isn't as principled as I had hoped and thought.","post_message":"Locked hand-in-hand in Ohio, Hillary Clinton and Elizabeth Warren sealed a powerful alliance Monday that could help unify the Democratic Party and give Donald J. Trump nightmares."},{"comment_id":"950475968345485","commenter_b":"she is fuking fat end off...","commenter_a":"I'm sorry, but fat people are NOT hot, sexy, or beautiful. Just ask a obese persons heart how healthy it is.","post_message":"'I want to challenge society's perception of beauty' - Tess Holliday"},{"comment_id":"1203529499735652","commenter_b":"Shut the fuck up","commenter_a":"I guess none of you that are bashing Trump know enough history to know that China has a pattern of testing US resolve after every election. (usually between feb and march) Trump brilliantly turned the tables on them. It will be even clearer when she visits trump next month. Chinese government has a mouth that writes checks it can't cash and Trump has called their bluff.","post_message":""}]
