[{"comment_id":"1011579805549158","commenter_b":"Just wait til that fat bitch is refused her insulin because her fat, meat eating ass offends a pharmacists sincerely held religious beliefs.","commenter_a":"Think that woman having a dead fetus inside of her would have been a bigger problem. that can lead to a serious infection. the drugs she was prescribed was not to induce an abortion but to remove a fetus which had already died","post_message":"Straight, white Christian men run the world and they don't care who they have to hurt so that doesn't change."},{"comment_id":"10154321620193188","commenter_b":"When are women going to start taking responsibility for their choices?","commenter_a":"Does this mean @username is going to stop telling women what to do with their bodies?","post_message":"While we may disagree on specific issues, if we stop trying to control each others’ lives, those issues (for the most part) become irrelevant."},{"comment_id":"10153722777028822","commenter_b":"if that female can do it and make it big go for it i would like to see it","commenter_a":"Its bound to happen because they are plentiful and killing it in the minors and its just a matter of time before one breaks into the big leagues. Smh...","post_message":"What do you think? Do you agree with Pittsburgh Pirates manager Clint Hurdle?"},{"comment_id":"10154735959309575","commenter_b":"How fatherly of him to want to murder his kids along with himself. SMH! This world is SICK.","commenter_a":"for the children and the family God bless them","post_message":"A 1-year-old boy and a 3-year-old boy survived after their dad threw them off a 100-foot bridge during a murder-suicide attempt. They suffered concussions but were awake and conscious when police arrived."},{"comment_id":"575985222606198","commenter_b":"Yes","commenter_a":"More money to waist.","post_message":"Do you support a lottery in Alabama?"},{"comment_id":"10153457248972464","commenter_b":"0NE VOTO OVER 2/3 DO OK DEAL (WE THE POEPLE DO) WILL KICK YOU OUT IF YOU VOTO FOR IT NO RETIREMENT PUT YOU IN obamacare !!!!! TRUMP 12016","commenter_a":"Ted, this is one thing that you are exactly correct on !","post_message":"The #IranDeal is a catastrophic mistake. Help stop it: @webpagelink"},{"comment_id":"10153490224540950","commenter_b":"Trump","commenter_a":"Who Cares Vote Trump","post_message":"Ted Cruz's wife was caught in the crossfire this week between her husband and Donald J. Trump. But she said she's \"not worried\" about Trump spilling the beans about her past. Take a peek:"}]
