[{"comment_id":"10154142250393132","commenter_b":"Ugh. Disgusting human being. She should be on the sex offender registry.","commenter_a":"You woman are the epitomy of stupid!","post_message":"Grace Riedlinger, 21, is charged with capturing an image of nudity without consent."},{"comment_id":"1635226930076425","commenter_b":"Take those women.","commenter_a":"I hope they do leave...","post_message":"We might have to pay another country to take them..."},{"comment_id":"1117807908334921","commenter_b":"@username Where is she from?","commenter_a":"Well what did you expect! Trump doesn't trust immigrants","post_message":"Donald J. Trump's peek at Melania Trump's ballot inspired a flood of jokes"},{"comment_id":"1552538175033296","commenter_b":"bitch i had to work and my husband had to work get off your fcking ass bitch and nobody needs 15 kids that doesnt have a job thats why this fcking foodstamps got to stop","commenter_a":"GET A JOB LOSER !!!","post_message":"This is why we need LESS welfare handouts."},{"comment_id":"1005484162805096","commenter_b":"That only applies to people who follow invisible friends.","commenter_a":"With all due respect I won't be taking advise from any Catholic leader when it comes to kids and sex. Religion does not, ever dictate what I do or my children do with their bodies.","post_message":"\"While the vaccination program is not inherently wrong, parents need to make an informed decision and communicate it in a way that can serve to strengthen their child in the virtue of chastity and reinforce her appreciation of abstinence as the only truly healthy choice.''"},{"comment_id":"1084321754934235","commenter_b":"Get the hell out and sell the house.","commenter_a":"I'm literally crying right now hahaha","post_message":"Police in Sydney told the man neighbors heard death threats, screams and the crash of furniture being flung around."},{"comment_id":"10153118055667623","commenter_b":"She's hot!!","commenter_a":"If you have to fight for him then he wasn't yours in the first place. I hope that you're pleased with yourself in hindsight today.","post_message":"A 26-year-old North Carolina woman allegedly stabbed another woman Tuesday night during an argument over a man."}]
