[{"comment_id":"876721502518426","commenter_b":"She don' deserve nothing more than 10 years in jail and not a holiday jail for what she has done to this Country she deserve the punishment that she gets","commenter_a":"No! She deserves jail!","post_message":"Hillary Clinton's worst nightmare just became her reality. Days before the election everything crashes. 'LIKE' if you think Hillary deserves justice?"},{"comment_id":"10153322688803132","commenter_b":"I hope she drops dead now in the pits of hell for what she did to this poor girl!","commenter_a":"How stupid can people get ???","post_message":"\"She's going to run till I tell her to stop. She's gonna learn ... I don't play with her.\""},{"comment_id":"10156094611905354","commenter_b":"I hate that shit eatin' grin he gets after he's screwed us one more time. I'll be so glad when we don't have to look at his ugly mug and that bitch he is married to.","commenter_a":"That slimy weasel traitor grin makes me sick.","post_message":"Congrats, Democrats. You will soon own it now and forever."},{"comment_id":"824287517608590","commenter_b":"Let's go get em Ron. Steve is on his way to pick you up with mike bike","commenter_a":"I knew it!","post_message":"Well..."},{"comment_id":"825278590901728","commenter_b":"And 11 million illegal aliens","commenter_a":"Please just go away, Cruz. You have nothing good to add to our country!","post_message":"“You cannot win a war against radical Islamic terrorism with an administration that is unwilling to utter the words radical Islamic terrorism.” - Ted Cruz"},{"comment_id":"1835870700020882","commenter_b":"Woman belong in the streets, your right...","commenter_a":"Every single person that's out there marching there's 10 that wish they could have","post_message":"From CommonDreams: \"The second day of the Trump administration has seen an unprecedented wave of protests swell across the globe, as the Women's March on Washington and its sister marches on all continents—yes, including Antarctica—fight back against the U.S. president's frightening rhetoric.\""},{"comment_id":"10154344335198181","commenter_b":"And the public has every right to show their displeasure by not supporting a corrupt regime...","commenter_a":"He's stupid","post_message":"The White House Press Secretary Sean Spicer on Pres. Donald J. Trump's tweet criticizing Nordstrom after decision to no longer carry Ivanka Trump's clothing brand: \"This was less about his family's business than an attack on his daughter.\" @webpagelink"}]
