[{"comment_id":"10155320618472668","commenter_b":"@username bigly, hum, never heard that word before. She is a hateful lady, period!","commenter_a":"I thought she was moving? Time to leave loser. It's time to take care of your own run-a-way and drug addicted children!!","post_message":"Following reports that President Trump was upset at seeing Sean Spicer impersonated by a woman on SNL, Rosie O’Donnell has stepped up with an offer to play Steve Bannon on the show."},{"comment_id":"10154603806201037","commenter_b":"You mean like your people did to the INDIANS","commenter_a":"If Mexico and Mexicans hate him so much, they are free to go back to their cesspool and stop raping the American welfare system!","post_message":"“[Donald J. Trump] is not welcome to Mexico. By 130 million people, we don’t like him. We don’t want him. We reject his message.\""},{"comment_id":"10153062363276162","commenter_b":"Black women are much more violent than all other women combined!!! Actually, violence is the worst among blacks. So stop saying there are bad in all races.. WE ALL KNOW THERE ARE BAD PEOPLE IN ALL RACES.. but the fact is that more blacks commit crimes than all other races combined.. WHY? WHY???? WHY????????","commenter_a":"Just the blacks stealing again. They'll catch them.. eventually as always.. then when they fight the cops, they'll complain that the cops used unnecessary force again.","post_message":"SMASH & GRAB: Thieves smashed a stolen car through the windows of a Best Buy in Lincoln Park early this morning. Officials aren't sure how much was stolen, but no one was injured in the break-in. FULL STORY: @webpagelink"},{"comment_id":"10153994248378132","commenter_b":"Illegals. Not immigrants.","commenter_a":"Ironic to be married to someone with such disdain for immigrants.","post_message":"Barbara Walters says she was surprised by Melania Trump."},{"comment_id":"852381858149314","commenter_b":"she is a total ASSHOLE and the biggest racist along with her husband. could just imagine how they are raising the girls.","commenter_a":"The only thing I see that she's done is screw the guy that planned to lie, cheat, steal his way into the white house. She did, he did, and they keep going.","post_message":"INSANE VIDEO: IT’S GRADUATION TIME...AND THAT MEANS IT’S TIME FOR OUR RACIST FIRST LADY To Spew Hateful Lies And Rhetoric About Racist White America And The Mistreatment Of Blacks ***WARNING****It's hard to watch this video filled with lies and anger toward white Americans without feeling like your head is about to explode!"},{"comment_id":"1774993129450173","commenter_b":"Ask him about carpet bagging the truth by billionaire media monopoly","commenter_a":"Thanks for discussion very informative","post_message":"Special debate coverage: Amy Goodman and Nermeen Shaikh host a pre-debate roundtable from 8-9PM ET with Kimberlé Williams Crenshaw, Melina Abdullah of Black Lives Matter - Los Angeles, Gyasi Ross, Soraya Chemaly, The Intercept's Lee Fang and Rashid Khalidi, followed by an expanded debate giving third party candidates a chance to respond to town hall questions. Jill Stein of the Green Party joins us from St. Louis starting 10:30PM ET. Tune in at democracynow.org/debate & post questions for our guests using #expandingthedebate."},{"comment_id":"10154357996114203","commenter_b":"innocent guns. why do we ban drugs such as cocaine? if the entire responsibility is on the abuser","commenter_a":"line up Americans arguing what the definition of assault rifle is.","post_message":"Conan O'Brien: \"I am a father of two, I like to believe I have a shred of common sense, and I simply do not understand why anybody in this country is allowed to purchase and own a semiautomatic assault rifle. It makes no sense to me. These are weapons of war, and they have no place in civilian life.\""}]
