[{"comment_id":"10153302995429255","commenter_b":"That is not proven, nor can it be.","commenter_a":"I got the rubella vaccine when I was 27 because that was the one childhood disease I didn't contract. At age 27 my body was able to handle the vaccine. NOW tell me PLEASE how the hell do you think its OK for an hours old baby to get vaccinated for a sexually transmitted disease, and then 48 more by age 18 months? Its seems to me KOS person, you have been bought by big pharma, or you are on a rant. Because this getting tedious","post_message":"A \"perfect storm\" is starting to brew. By Daily Kos user Lib Dem FoP"},{"comment_id":"969099383223240","commenter_b":"Lock her up !","commenter_a":"there were 2 ac130's in Sicily only 2 hours away that would have wiped the attackers from the face of the earth had they been deployed","post_message":"Every American needs to know this before the election!"},{"comment_id":"418399244951783","commenter_b":"People Conroling People , Money Conroling people , Paper controlling people , hu? Paper seems to be more in control here , get ready for a tree farm congress , congress: wants more trees , People: why, Congress: environmentally safe ecosystem, People: yeh, Congress: Money money money","commenter_a":"Seems legit.","post_message":"Lobbyists and politicians getting together, and yet it's the people who get screwed."},{"comment_id":"1231324976946036","commenter_b":"If people believe there are only peace loving Mexican people crossing the southern borders then they think there are no muslim terrorists entering with them....all with fake I.d. All borders need to be shut down ...and shut tight . Let the round up and deportation begin . If they kill...they should pay the death price .","commenter_a":"Build the fence...run electricity through it and man with machine guns . Don't bother even trying to clear these people. They do not want to assimulate into any culture. There is a tent city sitting empty for them to go to...but they can't raise shit there so they are not happy there because there are no luxurious places to visit nor anyone to demand that all their wants and desires are going to be catered to. Deport the ones that are there after your fence is finished.","post_message":"Norway has been one of the European nations hit hardest by the refugee crisis. Instead of lying down about it, they've introduced an EPIC plan to stop the refugee influx... and it will make Donald J. Trump a very proud man."},{"comment_id":"825004334282616","commenter_b":"do that and u'll have gallstone in ur bladder","commenter_a":"Dose this truly work?","post_message":""},{"comment_id":"10153181502489705","commenter_b":"RJ Ring,Brett Alexander,Chandler Hunt","commenter_a":"Victor Trezic Mata","post_message":"Star Wars fans. It has arrived. Rejoice."},{"comment_id":"649171271940118","commenter_b":"So how many times would we pay for the same illegals to be deported again and again and again","commenter_a":"Yes deport all the illegals that are in Our Country, if they can't come in our Country legally then they don't belong here, the illegals are nothing but a drain on our economy, with welfare, food stamps, medical housing and transportation which Obummer is giving them all, and Bankrupting our Country, all at the tax payers expense. I feel that they should have been deported long ago and not allowed to come back into the US since they came in illegally in the first place and those that have done this they should never also be allowed to try for Citizenship to The United States...","post_message":"Donald Trump just showed everyone how much illegals really cost. Enough is enough. Send them all back! Do you agree all illegals should be deported?"}]
