[{"comment_id":"881160988599592","commenter_b":"let her keep diggin that hole","commenter_a":"Why would anyone bother to talk to her about them, they know she will just lie, lie and oh did i say this? She lies!!!","post_message":"Do you care? Clinton Camp: Nobody cares about the Hillary Clinton email scandal @webpagelink"},{"comment_id":"380847572097124","commenter_b":"This piss-ant compared himself to MLK!!! That's their mentality; he's blinded by hate. Typical rightwing idiocy!","commenter_a":"Idiot.","post_message":"Today is not the day for this nonsense."},{"comment_id":"10153253318118188","commenter_b":"I don't see women chomping at the bit to be garbage men, roughnecks, boilermakers, crab fishers, or construction workers.","commenter_a":"She's a joke!","post_message":"ICYMI:"},{"comment_id":"1326722587387039","commenter_b":"Lock her up!","commenter_a":"These people man!","post_message":"Guess what her alias is..."},{"comment_id":"10154249016409170","commenter_b":"She's a soft spoken HACK!","commenter_a":"Bam, i love the dems motto, vote early and often. How is this right. Another star for NC. Good job","post_message":"Usually Democrats can play the race card with no consequences. Not this time."},{"comment_id":"699418583582053","commenter_b":"Jaye you're a perfect example of a dumb blonde .....","commenter_a":"What in the heck did Obama do to deserve impeachment!!!! People are just RIDICULOUS!!!!!","post_message":"Obama's college records were finally publicized and what they say... This is exactly what he has been trying to cover up for so many years. Do you think Obama should be impeached?"},{"comment_id":"10153607526077452","commenter_b":"What a good citizen! Love this.. Especially with the morons out there who have killed sea life by trying to get a good selfie!","commenter_a":"Hope he finds his mommy 😟","post_message":"A tour guide rescued a young dolphin stranded on a beach. @webpagelink His heroic effort ensured that the dolphin was able to swim another day."}]
