[{"comment_id":"10153730231431337","commenter_b":"Because women should only pursue careers that focus on their looks, right?","commenter_a":"Fxxx her kickboxing career shes georgus","post_message":"TOO BIG? This MMA fighter's \"12-pound\" breasts are ruining her fighting career..."},{"comment_id":"1404580556268355","commenter_b":"Highly inappropriate for her to attack a child like that. Grow up, woman!","commenter_a":"What's wrong with feeding a dog some vanilla ice cream? I seriously don't get it","post_message":"Said he 'already looked like a f****** d*******'"},{"comment_id":"10153778934267098","commenter_b":"Told to put her phone diwn, LOL","commenter_a":"In other news, the NBA just suspended Ayesha Curry for Game 7.","post_message":"Twitter goes crazy over Ayesha Curry's tweet..."},{"comment_id":"10158142280770293","commenter_b":"A bankrupt city full of criminals... we will stay in Shelby county and spend our tax dollars in Shelby county... will not spend a dime there","commenter_a":"Hopefully they will lose all Federal funding for not following the Federal law. They need to be concerning themselves with NOT being in the top ten places that are unsafe.","post_message":"#BREAKING: The Birmingham City Council took a position on the travel ban by passing a sanctuary city resolution this afternoon. READ more on this developing story >>"},{"comment_id":"10155155813577642","commenter_b":"Yes my last name is Perez, so what. My family and I aren't afraid because they did it the right way when coming over, they obeyed the law! No matter what ones last name is we are all immigrants, but there is a difference between immigrants and illegal immigrants. So sad that many people people don't realize the difference like yourself.","commenter_a":"What part do you all not understand or haven't read??? She entered the United States illegally November 2015!!!! Judge ordered her out of the US on January 26th. She broke the law!!! Yes it's sad that she MAY have a brain tumor but even the doctors have said they aren't for sure that it's cancerous. Doctors have cleared her medically to be discharged from the hospital in a stable condition! She had a medical episode on February 11th but once again got discharged from the hospital! So what makes this case \"non humane\" that you all speak of?!?!? She has broken the law, she has gotten medical help and was released from a medical team outside the detention center. Nothing inhumane going on!","post_message":"An undocumented 26-year-old woman from El Salvador who has a brain tumor was moved from a hospital to an ICE detention center in Texas."},{"comment_id":"10153931613802093","commenter_b":"I hope they carve him really good in TDC.","commenter_a":"What a motherf**king piece of s**t thug. Die, a**hole! Yeah, I'm pissed.","post_message":"BREAKING: Gustavo Zavala-Garcia has officially been charged with capital murder in the death of 10-year-old Kayla Gomez-Orozco. His bond has been set at $10 million. bit.ly/2fwFjd0"},{"comment_id":"10156878121275551","commenter_b":"She will infest the White House with her crabs.","commenter_a":"No way, I would vote for a homeless veteran first.","post_message":"Patriot Update"}]
