[{"comment_id":"10153875721181770","commenter_b":"She is sipping Hillary juice.","commenter_a":"Nancy Pelosi IS a train wreck - so I would expect nothing less!","post_message":"Nancy Pelosi's Sunday morning interview on CNN was an absolute train wreck..."},{"comment_id":"533141560209757","commenter_b":"Brainwashed stupid women!!!!!!!","commenter_a":"Let them go back to the country they came from if they want to wear their Burkas","post_message":"This Muslim woman refused to remove her veil, then something awesome happened. Good. There's no room for fanatical Islamic culture in the US. Do you support a Burka ban?"},{"comment_id":"10154477709641729","commenter_b":"True","commenter_a":"Hillary is power hungry and Bernie is actually a communist . Both don't care about the American people.","post_message":"They'd best heed the writing on the wall."},{"comment_id":"10152944080940950","commenter_b":"You cant tell he has an accent?what a bitch!","commenter_a":"I know law enforcement still search for david sweat and richard matt 20 days after escape from Clinton Correctional Facility. I know correctional officer Gene Palmer has already arrested for possible help to david sweat and richard matt escape from prison. I say correctional officer, prison workers and prison staff never help to some inmates escape from prison. If correctional officer, prison workers and prison staff help to some inmates escape from prison and could be arrested add prosecutor attorney will announce charged against correctional officer, prison worker and prison staff.","post_message":"A guard charged in the New York prison escape \"knows that he made a mistake,\" his lawyer says: @webpagelink"},{"comment_id":"10154003017405575","commenter_b":"Liberal bitch!!","commenter_a":"The entire Clinton family needs to take their millions and go home and stay there.","post_message":"This should be a wake up call to the #NeverTrumpers. They're coming after your guns."},{"comment_id":"1797835747132215","commenter_b":"A nasty woman","commenter_a":"This women should never be allowed to moderate another debate ever again, she clearly has an agenda.","post_message":"At Monday’s White House press briefing, ABC’s Martha Raddatz lobbed President Obama a question designed to get him to criticize President-Elect Donald Trump. He refused to humor her request."},{"comment_id":"1247749101912765","commenter_b":"It's so well done!","commenter_a":"@username Martha Elizabeth","post_message":"Periodic pumpkins!"}]
