[{"comment_id":"606606769472505","commenter_b":"Karma's a bitch!","commenter_a":"not that I don't think this would be a good thing, but what's shown isn't likely. Unless this particular suicide bomber killed himself without using the bomb he was wearing, that bomb has been used. somebody would have had to put the scraps of his body into a new wearable bomb for this to happen... without anyone noticing.","post_message":"Video: This funeral for a suicide bomber is about to take a MAJOR unexpected turn for these terrorists. Karma?"},{"comment_id":"10158194484645725","commenter_b":"Dis bitch don't even answer","commenter_a":"@username @username Melissa F Hernandez @username MaFe Ndz We are going to take Matthew to Navy Pier again this year. You guys should come too!","post_message":"Tonight feels like the perfect night to see some holiday lights, don't you think?"},{"comment_id":"10152815775186680","commenter_b":"she looks like Michelle Duggar!","commenter_a":"She wants ANOTHER wasted 15 minutes...go away...","post_message":"“There is no way that she did not know what was going on, that women were being abused and accosted by her husband,” Jones said."},{"comment_id":"1684200761639665","commenter_b":"Like I said, she looks like an old hag.","commenter_a":"My gosh, she only 49 years old and looks much older.","post_message":"Kellyanne Conway breaks out her bathing suit as she manages to sneak away from Team Trump for a brief family vacation"},{"comment_id":"10155187211337871","commenter_b":"Two out of 54 are not very good odds but we can't give up hope.","commenter_a":"Thoughts to the EDITOR of a Free Press by President Jefferson... \"Perhaps an editor might begin a reformation in some such way as this. Divide his paper into four chapters, heading the 1st, Truths. 2nd, Probabilities. 3rd, Possibilities. 4th, Lies. The first chapter would be very short, as it would contain little more than authentic papers and information from such sources as the editor would be willing to risk his own reputation for their truth. The second would contain what, from a mature consideration of all circumstances, his judgment should conclude to be probably true. This, however, should rather contain too little than too much. The third and fourth should be professedly for those readers who would rather have lies for their money than the blank paper they would occupy.\" --Thomas Jefferson to John Norvell, 1807. ME 11:225","post_message":"\"I hate the press. I hate you especially. But the fact is we need you.\" - Senator John McCain jokes, but stresses the importance of a free press to a democracy, adding that \"the first thing that dictators do is shut down the press.\" Read more: @webpagelink"},{"comment_id":"517613611762552","commenter_b":"@username must be an ignorant stinking liberal!","commenter_a":"Why can,t we ban liberals ???????","post_message":"Liberals are trying to get rid of one of your favorite snacks. Stop being so sensitive. We need to put a stop to this. Do you agree Liberals pushing their beliefs on you?"},{"comment_id":"963644947039340","commenter_b":"But she is dirty","commenter_a":"She knows women's issues best","post_message":"Watch live as Hillary talks to students at New England College in New Hampshire about the issues on their minds."}]
