[{"comment_id":"1229197387109219","commenter_b":"Putin to Obama stop protecting Muslims I know Putin he is insane. What do you want from 1st a Muslim then a racist 1/2 black 1/2 white that own family owned slaves. And a bi sexual with a jar of Vaseline in his side table","commenter_a":"And so how is this different from supporting Israel which is pro-pro abortion? How does the GOP electorate square Israel's pro-abortion record with U.S. Southern Christian position on abortion? @webpagelink","post_message":"\"If I told you in 2008 that Barack Obama would negotiate a deal that he acknowledges will fund terrorism, you'd have thought me a conspiracy theorist.\""},{"comment_id":"1162763547153229","commenter_b":"Betty White Anyone born after 1507 in America is a NATIVE AMERICAN... Those born before 1507 were not NATIVE AMERICANS.. This land mass was not named America until 1507... So Betty White, you are a NATIVE AMERICAN if you were born in America..","commenter_a":"Iwelcome to America, Ahmad Al-Abboud. I hope you, like many refugees, find the American dream!","post_message":"Ahmad al-Abboud, a Syrian refugee who recently relocated to Kansas City, discusses his harrowing ordeal. Watch more: @webpagelink"},{"comment_id":"10156182407910354","commenter_b":"Will they be put in jail for raping, beheading, burning live people? I think I need some pigs running around my yard.","commenter_a":"Since this treason is all being done by the commie DemocRats lets dump them all into the DemocRat run city's . Chicago, Detroit , Boston, Philly, New York , San Fran, etc. How about a 90% tax on all liberals.","post_message":"You just KNEW this was coming, didn't you?"},{"comment_id":"10153283124151316","commenter_b":"Blackie Chan where does a gorilla get his protein? The gorilla does not eat any meat, This beast can throw a 200lb man across the street with one arm....maybe dark greens.....","commenter_a":"What's your protein source?","post_message":"Man says raw food diet has made him 'almost superhuman'... @webpagelink"},{"comment_id":"10153015286404641","commenter_b":"Check out dis video @webpagelink","commenter_a":"Pls. friends click the link and like the photo of cedrick he's good and intelligent student he doesn't have money for his college. your like is to help for his scholarship and share to your friends .. we really need ur help .. just click the Link below .. Please Like Candidate #1 .. Thank you po .. :-) @webpagelink","post_message":"Nigerian voters refuse to be silent in wake of election delays @webpagelink"},{"comment_id":"10155219757361159","commenter_b":"They should be deported and he should be in prison.","commenter_a":"So............your entire family is full of criminals and you're going on television to identify them right before we finally start enforcing the immigration laws in this country? Definitely stupid enough to be a Democrat.","post_message":"\"They got a false Social Security card, they got a false identification, they got a false driver license prior to us passing AB 60, they got a false green card, he admitted."},{"comment_id":"10153156704581051","commenter_b":"So what should he have done? If a chick is crazy like this chances are she isn't just gonna let him walk away. Men can be abused to and it's never right her ass is exactly where it should be.","commenter_a":"What kind of wimp does a guy have to be to call the police because his girl friend slapped his sensitive little face, and hurt his widdle feelings.","post_message":"This woman set up a secret camera to keep an eye on her boyfriend. When she reviewed the footage and saw what he was doing while she was gone, she snapped."}]
