[{"comment_id":"1192472137454872","commenter_b":"they will have to change the toillets in the White House after this thing used them!! Please change the toilets at least for Melania!!","commenter_a":"It shows her manhood lol","post_message":"SHAMEFUL!!"},{"comment_id":"1062046730518522","commenter_b":"Hillary To Prison!","commenter_a":"You have my vote, @username. As a United States senator and a cabinet secretary, you learned how to compromise and work with your rivals. With you, we know what we are getting authentic experience.","post_message":"I got into this race because I want to improve the lives of all Americans—and I’m going to continue to work my heart out. I hope you’ll join me. Onward to Iowa. -H"},{"comment_id":"1552138465081005","commenter_b":"How does she not get dissy","commenter_a":"Matthew Boyd","post_message":"This record-breaking teenage gymnast is showing the world her incredible tumbling talent."},{"comment_id":"10154312293629330","commenter_b":"She's a lying murderer","commenter_a":"God help us if he wins!","post_message":"Donald Trump has been officially nominated as the Republican candidate for president at the GOP convention in Cleveland ---> @webpagelink"},{"comment_id":"10153880836367994","commenter_b":"EXPELL THE HOE S FOR LIFE , LET THEM WORK THE STREETS","commenter_a":"All I got to say is we need to bring back discipline back in the schools I would of never In a million yrs ever thought about hitting a teacher I think these kids need to b put in jail disgusting how these kids are now a day","post_message":"Those who work at Detroit Public Schools say this was \"teacher baiting\" -- and that this isn't the first time they've seen it happen: @webpagelink"},{"comment_id":"1911868089040262","commenter_b":"Who are they surveying because not all people thinks Asians aren't hot","commenter_a":"Kyan Khalil Khalili-Broojeni heyy","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"10154103517111178","commenter_b":"Tell the truth its because you give all illegal aliens full medical care.","commenter_a":"They say 17 million people are enrolled so if it cost that much then scrap it","post_message":"Truer words have never been spoken by the president."}]
