[{"comment_id":"814269158659286","commenter_b":"Oh really!","commenter_a":"My sister became an alcohol by drinking at home, the drink prepared by her husband before he went out with other women.","post_message":"Some point to our liberty in Christ, but is it wisdom to consume alcohol? One pastor sounds off."},{"comment_id":"10153042151741680","commenter_b":"Aww, she don't like jail, maybe , I love being able to use this line right now, maybe if she wouldn't break the law, she wouldn't be in jail. Isn't that the line republicans always use.","commenter_a":"Davis is being duped by her attorney. As long as she refuses neither to resign her office nor to do her job, her attorney is the only person who's winning. She is a pawn.","post_message":"The controversy swirling around Kentucky county clerk Kim Davis is not letting up."},{"comment_id":"1206849516074767","commenter_b":"Call Hillary what you want, I don't care about her emails, she is better than that piece of Shit Trump","commenter_a":"Can he get any worst?","post_message":"\"Forget politics; he is a disgusting human being.\" - Thomas Friedman"},{"comment_id":"1766049700310185","commenter_b":"She better look deeply into Muslim beliefs and get used to sexual assaults because these heathens think it's their right","commenter_a":"The White House is warning Trump not to retaliate against her. Is that a red line? They going to write a mean letter to him if he does?","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."},{"comment_id":"10153499292339714","commenter_b":"Since when are \"weak\" and \"helpless\" feminine traits?","commenter_a":"Worst thing to say to a boy according to my son is \"clean your room\". He wants to be called a \"man\" and he's 7 and proud of it. People need to get over this emotional craps. Boys will eventually be men. I think the worst thing you could say is \"woman up\".","post_message":"How do we socialize boys differently?"},{"comment_id":"1062046730518522","commenter_b":"Hillary To Prison!","commenter_a":"You have my vote, @username. As a United States senator and a cabinet secretary, you learned how to compromise and work with your rivals. With you, we know what we are getting authentic experience.","post_message":"I got into this race because I want to improve the lives of all Americans—and I’m going to continue to work my heart out. I hope you’ll join me. Onward to Iowa. -H"},{"comment_id":"1118742268187889","commenter_b":"ISLAM AND SHARIA LAW SHOULD BE BANNED FROM AMERICA PERIOD! THE MEMBERS OF THE OBAMA ADMINISTRATION NEED TO ALL BE REMOVED BY CONGRESS FOR TRYING TO TAKE OVER AMERICA THROUGH ISLAMIC RELIGION! PEOPLE LIKE OBAMA, HILLARY, LYNCH, HOLDER, GARLAND ARE ALL WORKING TO FORCE ISLAMIC BS UPON THIS COUNTRY! WE HAVE SECRETLY BEEN INVADED BY THESE POS TRAITORS AIMING TO BRING DOWN THE U.S. THROUGH ISLAM!","commenter_a":"finally a State with some b---s","post_message":"CELEBRATE!! VICTORY! South Carolina House Passes Bill Excluding Sharia Law From State Courts! THEY TOLD MUSLIMS HELL NO!"}]
