[{"comment_id":"1800766070155339","commenter_b":"#NeverHillary #Hillaryforprison","commenter_a":"we are all trapped","post_message":"Hillary Clinton just became the first female presidential nominee of a major party. Here's the reaction on the floor."},{"comment_id":"1330647500288610","commenter_b":"Killers should be punished .","commenter_a":"evil","post_message":"The U.S. Fish and Wildlife Service said Thursday that necropsies had ruled out diseases as a cause of the eagles' deaths."},{"comment_id":"1118654024897515","commenter_b":"Chemo is poison!","commenter_a":"Nicole, how insensitive can you get? Chemo? with all of the cancer survivors and sufferers fighting their disease with GOOD lifesaving chemo? Hope you never need CHEMO. Trump is not CHEMO. He IS POISON.","post_message":"“The Trump supporters see Trump as political chemo. He may be toxic. He may kill every healthy cell in the bloodstream. But he is the only cure for the cancer that is Washington establishment.” - Nicolle Wallace"},{"comment_id":"619645721526492","commenter_b":"I bet this woman also looks good with clothes on (y)","commenter_a":"Please don't take any advise from the Kardashian's. Look at their lives, they have no right to give out advice","post_message":"Would you contour your bum? We're trying out the 3D tan loved by Kim Kardashian West and Olympia Valance"},{"comment_id":"529104973953410","commenter_b":"She's a scummy fat chick!","commenter_a":"MS. PIGGY.","post_message":"We can do this America. ...If we just unite, we can make this happen."},{"comment_id":"1830155707222526","commenter_b":"@username ...Well, CA did vote her out...but the rest of America did!!! Oh, HAPPY DAYS!!!","commenter_a":"This \"Deplorable\" American Christian is voting for TRUMP, I live in California and all my neighbors and friends are voting for TRUMP...We are tired of the lies and corruption of career politicians!!!!","post_message":"Matt Walsh: A Clinton win won’t be a victory for women but a victory for corruption."},{"comment_id":"10152788140495950","commenter_b":"She did the right thing. Can't imagine how disappointed in her son she must have felt at that moment.","commenter_a":"I am so on board with what this mother did. She cared!","post_message":""}]
