[{"comment_id":"10154858585008797","commenter_b":"If they are here illegal. they are just deported . That's why I care if they are here illegal!! they'll just come back in to commit more crimes..","commenter_a":"How many are legal citizens","post_message":"GANG BUST: After nearly three years of undercover investigation, a total of 96 felony charges have been filed against 16 gang members."},{"comment_id":"10153253514670329","commenter_b":"please shut the fuck up","commenter_a":"In what world are 12 year olds adults? The entire point of a juvenile justice system is that children are NOT adults in age nor brain development. They need mental health treatment in a correctional facility tailored to children.","post_message":"They face a count of attempted first-degree intentional homicide. (via BuzzFeed News)"},{"comment_id":"10153205504771336","commenter_b":"You need to get the Fffff out there's you are useless Lady or what ever you are. You are a disgrace.","commenter_a":"Recall this mayor!","post_message":"“I never said, nor would I ever say, that we are giving people space to destroy our city. So my words should not be twisted.” Mayor Stephanie Rawlings-Blake spoke to reporters moments ago amid growing violence and chaos tonight in #Baltimore."},{"comment_id":"10153052484116491","commenter_b":"GTFO illegals","commenter_a":"And he shouldn't! Go TRUMP! Out with those freeloading illegals!","post_message":"Even after losing a slew of business partners, including Macy's, NASCAR and NBC."},{"comment_id":"1271408779539022","commenter_b":"You girls are hilarious 😘😘","commenter_a":"Marijoe!!!!","post_message":"The whole thing is very ~Mermaid goth.~"},{"comment_id":"10154094997078132","commenter_b":"don't reproduce...","commenter_a":"Jus had my babies let me put my fake lashes in n do my makeup for the pic..","post_message":"The only thing keeping Jaeyln and Luis apart is a year."},{"comment_id":"10153326464497235","commenter_b":"She is definitely a jerk. And that's putting it nicely. lol","commenter_a":"all they needed to do was let her call someone to prevent his suicide. a tragedy when regulations trump basic moral values.","post_message":"She says a Southwest Airlines flight attendant slapped the phone out of her hands ..."}]
