[{"comment_id":"10155832964064062","commenter_b":"But you're gonna pay for that wall?? Here's some facts no fake or false ones where are you getting your info?? Russia? @webpagelink @webpagelink And if you make that much good for you hire trumps tax attorney trump hasn't paid for taxes you're crying about in 20 years, It'll help offset the insurance cost. I'm sure you can afford it.. And again democracy is majority of the vote as for the illegitimate vote why don't you believe the fact it was tampered with to make trump win? Guess 2+2 never equals 4 ..he won with little more than 25% of actual registered voters now tell me how that works?? As for God's being in government it's expressly written to be kept out by our founding fathers ..called separation of church and state.","commenter_a":"I feel sorry for the people who actually believe in him. They need God in their lives, seems as nothing in this earth can convince them they are being screwed lied to and alienating half of the world. Keep drinking that kool aid let's see what shambles we are left in.","post_message":"President-elect Donald Trump defended a plan this morning that would see the U.S. initially pay for a border wall with Mexico and be reimbursed at a later date."},{"comment_id":"1023824300991761","commenter_b":"Women's loos can be more festy","commenter_a":"My bathroom in my house is open to anyone who can flush. Unisex bathrooms would end this issue","post_message":"In case you missed it: Trans people need to use the restroom just like anyone else. Why do some people have to make such a big deal about it?"},{"comment_id":"833696443343651","commenter_b":"What a sick statement, what a horrible woman!","commenter_a":"Hillary Clinton was awarded the Margaret Sanger award for her abortion stance.","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"10157544751020354","commenter_b":"wasn't lady gaga also a crack fiend before she made shitty music and supported domestic terrorists?","commenter_a":"No one gives a shit what the fucking rich liberal is said.","post_message":"Here are Lady Gaga's tweets supporting the BLM radicals..."},{"comment_id":"10153160273727217","commenter_b":"Sorry if that last comment offended anyone.","commenter_a":"Does EVERYONE in Britain get offended by EVERYTHING?","post_message":"\"It brings back trauma for everybody who was attacked by a shark.\""},{"comment_id":"10153687019896800","commenter_b":"Maybe abortion opponents could just focus on those things that actually reduce abortions. The #1 cause of abortion is unplanned pregnancy. Universal coverage for birth control has done a great job of reducing abortions in other countries. Equal pay guarantees also work - mothers in this country experience a greater wage gap than childless women. Job protection is an issue here. Women in this country still experience job loss solely because of pregnancy. And, child support is a huge problem here. Civilized countries pay custodial parents child support, and THEN collect it from the non-custodial parent. Knowing that you can afford to feed, house, and clothe a child is a factor when deciding whether to continue a pregnancy.","commenter_a":"If these conservatives really wanted to prevent abortions -- they should be handing out birth control like it was candy. After all, if you prevent an unwanted pregnancy you automatically prevent the need for an abortion. But I guess that kind of logic is beyond the comprehension of most conservatives. Considering the conservatives are trying to restrict or elimiminate access to birth control as well -- I don't think this is about preventing abortions at all. It seems like it's about a group of morally uptight religious busybodies going around poking their noses into other people's private matters and wanting to have total control over those people's lives.","post_message":"Trevor encourages abortion opponents to extend their pro-life stance beyond fetuses."},{"comment_id":"10152902566136336","commenter_b":"Don't worry she will burn ....hell has a special place for people like her !","commenter_a":"Burn her too","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."}]
