[{"comment_id":"10153086832391051","commenter_b":"She looks like she is fat enough to go to HELL, sweathog","commenter_a":"Well damn i'm moving over there wht","post_message":"This woman killed someone. She says she doesn't belong in jail for one reason and one reason only."},{"comment_id":"10154649448359369","commenter_b":"She's a disaster with poor judgement to boot","commenter_a":"I trust her judgement in situations like this! She has a better understanding how things work internationally than Trump!","post_message":"She says Donald Trump created a \"diplomatic incident.\""},{"comment_id":"10153931664823797","commenter_b":"Well..when you look at how Democrats view abortion...5 months ago..that woman could have destroyed that baby through an abortion... .They don't respect life. So why should a Democrat care about how this baby died?","commenter_a":"Democrats would argue that this is not murder as abortion is not murder to them.","post_message":"29-year-old Sharron Braxton has been charged with the fatal suffocation of her 4-month-old son. Prosecutors say Marcus Jr. died after she rolled on top of him in the middle of the night. How very sad. Here's what police say she was doing before she fell asleep:"},{"comment_id":"10153552144846636","commenter_b":"Wow.. boo hoo. There's no \"controversy.\" Just a few crybaby parents who probably don't like soccer. This team is generating money in the Yukon community and also generating money for the school during a time of need. People should be thankful, not critical. This team isn't cutting into the school budget in any way, chill out.","commenter_a":"KFOR you need to get rid of the pop up ads your page uses!! Can't read a complete story or watch a video without getting a redirect to somewhere else. You are the only news station page there are issues with!","post_message":"\"By no means was it ever intended to say hey this is ours now.\""},{"comment_id":"10154917863094654","commenter_b":"Can women join this Club??????","commenter_a":"this is the best!!!","post_message":"Handlers of Pennsylvania's most famous groundhog are set to announce whether the rodent will predict an early spring or six more weeks of winter. More about the legendary Punxsutawney Phil @webpagelink"},{"comment_id":"10152980624100667","commenter_b":"Not.","commenter_a":"The Ross Perot of the 21st century :/","post_message":"Donald Trump declined to rule out a third-party presidential bid Thursday if he loses the Republican nomination. \"I will not make the pledge at this time,\" Trump said at the start of the GOP prime-time debate."},{"comment_id":"10153207313881770","commenter_b":"She has always been a liberal idiot so send them all to her house","commenter_a":"An actress whose biggest claim to fame is getting nailed by Frankenfurter","post_message":"Susan Sarandon is now likening Syrian refugees to Jesus."}]
