[{"comment_id":"1539781299650210","commenter_b":"Trump will CRUSH Hillary!!","commenter_a":"if you know Hillary will lose against Trump click like","post_message":"Wendy Long: Trump's 'America First' Platform Will Grow GOP Nationwide."},{"comment_id":"10157168676140293","commenter_b":"Get off it already. There are bigger issues in our country to deal with such as gun control, racism and all these shootings, immigration, abortion, same sex unions, and the list goes on. Not whether or not she used the same words as our current first lady or not. I don't care if she copied the whole speech word for word as long as he can put our country in better shape than out current president and first lady.","commenter_a":"Not her fault...She just read what they gave her.. Don't blame her...","post_message":"Melania Trump's speech last night at the 2016 Republican National Convention is now the subject of a plagiarism controversy. READ why some are saying some of her words were lifted from the current First Lady:"},{"comment_id":"10156776105275354","commenter_b":"Difference between American and European women...","commenter_a":"And we pay $260 billion a year for our government.","post_message":"CHAOS IN AMERICA'S STREETS..."},{"comment_id":"10152961665786336","commenter_b":"Why would any of you morons disagree with Dr. Carson? As long as kids get vaccinated and as long as adults have already been vaccinated this Country can be protected from these diseases. Time for Obama to guarantee that anyone illegal immigrant be vaccinated...","commenter_a":"Just another reason why we need to CLOSE the borders, ENFORCE the laws already on the books and DEPORT all illegals. That means, NO AMNESTY for anyone.","post_message":"Fox News Sunday EXCLUSIVE: Dr. Ben Carson joins Chris Wallace with his stance on the vaccine debate and his plans for 2016. Check your local listings or tune in to Fox News Channel at 2p and 6p ET."},{"comment_id":"10155178808719411","commenter_b":"she so fine would have her sit on my tongue on the day lee","commenter_a":"Ok, so protests are Ok but protesting against the former protest is \"not Okay\".. Double standards imo.","post_message":""},{"comment_id":"10154594345964749","commenter_b":"@username leave arab countries ask you governments to stop killing people there . and the immigrants will go back","commenter_a":"I think the comment has to be taken into context... Looking at Hungary's demographics, Muslims don't even account for 0.1% of the population. The politician is probably representative of the general public mood there. Although in a more colourful tone!","post_message":"The Hungarian politician was described as “a sad old man full of hate” and his comment was branded as “disgusting”."},{"comment_id":"1251904504850405","commenter_b":"scum. I hope someone cuts your dick off. Then you can really be a women. Until then stay in your own damn bathroom and leave us women alone. One of these days yours is coming.!!!!!!!!!!!!!!!!","commenter_a":"single occupancy facilities is the only sensible answer. But that ain't good enough for the terminally aggrieved.","post_message":"👏 👏 👏 (via The Huffington Post)"}]
