[{"comment_id":"1686671934920265","commenter_b":"Hey Vincent, your situated right next to the greatest country of the world and your country is in shambles!! That alone tells us how F'ed up you and your country / society is. You'd think there would be something positive your country would pick up to your benefit. Fix your dump and make it so great and build a wall to keep us out. We'd appreciate it. Asshole!!","commenter_a":"Just put a tax on any money going back to Mexico or central America. Build that Wall Mr Trump.","post_message":"EX MEX PREX: 'NOT PAYING FOR FUC*ING WALL'"},{"comment_id":"1101281803258742","commenter_b":"Bite me bitch. Ever heard of auto correct.","commenter_a":"This came from the Advocate (our local paper) and I am sharing it because it is exactly how most of us feel about Trump. The Media just doesn't get it....they can't believe that people are so angry that they can no longer be manipulated! Millions of trump supporters feel this way about Donald J. Trump..... \"We don't care if the guy swears... or how many times he's been married...or who he voted for, or what his income tax return shows. We want the problems fixed. Yes he's an egomaniac, but we don't care. We know he's not a racist, or bad to women, or all the other things the liberal media is trying to label him with. We know he's raised a good family, and that says a lot about him. The country is a mess because politicians suck, the Republican Party is two faced & gutless, and illegals are ...","post_message":"Even this focus group by Fox News's Frank Luntz agrees Hillary CRUSHED Trump. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1586029795023236","commenter_b":"all you women who just need to color those grey hairs with Bleach blonde. So Vain.","commenter_a":"Richard Dryfus.....dude...you just lost the majority of your fan base. You must be a Criminal follower!","post_message":"He called Trump small dicked prick a unqualified racist who had for celebrity supporters."},{"comment_id":"875538442502852","commenter_b":"Absolutely, illegal is illegal and alien is alien!!!!!","commenter_a":"There is no reason they can't do that legally","post_message":"Don't you agree this is ridiculous?"},{"comment_id":"10154739009466337","commenter_b":"I say extract the bitch the bitch that's in you that complains about characters of fiction switching ethnicities","commenter_a":"I say cast a white dude. Because it's cool to switch race's of established characters now right?","post_message":"BLADE'S RETURN? Marvel hopes so..."},{"comment_id":"10155024905873487","commenter_b":"Yes, but I am going out swinging. My representatives are getting letters, resistors are getting encouragement, all entreating those who swear to protect and defend the constitution are getting my support. I grew up when you did...and felt the same way. We are to be tested. Our Republic will need yo stand. So I will too. Join us!","commenter_a":"Good-bye halcyon days of growing up in the U.S. in the sixties and seventies. Worst shock of my life was 2008. I had always, unconditionally, believed that FDR's reforms were indissoluble, absolute, perfect. Now I don't trust anything; if there is money to be made, no perfidy is too great to be inflicted upon Joe Lunchbucket and me. It was a great experiment, but the protections against the avaricious that were put in place were not strong enough.","post_message":" don think Richard Nixon even comes to close to the level of corruption we already know about Trump."},{"comment_id":"10153542396586336","commenter_b":"A third term would be so awesome. Obama could really clean everything up. Do away with guns and churches- and make EVERYBODY git GAY MARRIED! yupyupyup....","commenter_a":"I don't even listen to the guy bc all he does is lie and spew gutter trash. He's an embarrassment. I'm waiting for that executive order where he can \"order\" himself to have a 3rd term! Wonder if those neutered GOP \"leaders\" will actually do anything then or just \"say\" they will! They are all sickening!","post_message":"Do you agree with Charles Krauthammer?"}]
