[{"comment_id":"10152793900772452","commenter_b":"Bad women drivers! ;)","commenter_a":"Who the hell runs over a motorcyclist and does not have a clue that they hit someone????! Thank god the other drivers made her stop FINALLY!!!","post_message":"The dramatic rescue of a motorcyclist who had been dragged underneath a truck on the eastbound 91 Freeway was caught on video. abc7.la/1EK2HcY The video was submitted to Eyewitness News by viewer Byron Holeman who used the #ABC7Eyewitness."},{"comment_id":"1338050419567745","commenter_b":"Ladies don't behave like that..","commenter_a":"Why are they so darned angry? It doesn't make sense.","post_message":"LIBERAL YOUNG LADY GOES ON RAMPAGE & DESTROYS TRUMP TABLE at COLLEGE (video) @webpagelink"},{"comment_id":"10153602906656509","commenter_b":"You can buy them too.","commenter_a":"I think she means she wants to make a lot of money. Those GEDs aren't cheap.","post_message":"Is America ready for #marijuana moguls? Follow one young couple's journey as they attempt to franchise legal marijuana @webpagelink #HighProfits"},{"comment_id":"1806158626337786","commenter_b":"She has pneumonia like I have the plague! UGH","commenter_a":"Now they're saying she had pneumonia since Friday---yet she did a celebrity fundraiser Friday with no mention of being ill. And if she did have pneumonia since Friday, why wasn't that the first excuse given for her collapse?","post_message":"\"Overheated.\" \"Short circuit.\" These are her and her campaign's own words. If they're using language like this to spin her appearance, what is the reality?"},{"comment_id":"1105423922847469","commenter_b":"Bitchhhh","commenter_a":"@username best of the world's ladies !!!!","post_message":"This isn't who we are, and it also isn't how we keep America safe."},{"comment_id":"1449993195026187","commenter_b":"And we don't give a fuck about your racist ass!","commenter_a":"there are those of us who have nothing to \"get the F over\" because we don't give a \"F\" WHO or WHAT your granddaughter LIKES or doesn't like.","post_message":""},{"comment_id":"10153002038827894","commenter_b":"She has a disrespectful spirit lol","commenter_a":"@username I am still laughing 😂","post_message":"Coko of SWV Throws Shade at K. Michelle & Tamar Braxton's BET Awards Performance, K. Michelle Claps Back 'You're at Home!'"}]
