[{"comment_id":"1478284585520531","commenter_b":"@username At least he loves and respects Americans, which clearly you are not....Does not have the blood on his hands like Hillary of 114 people and counting.....Maybe you want him to destroy us, but, when he does you'll be right there with us all...Let all these illegals come live with you!!!","commenter_a":"This has got to stop!!!! Please read the following.. John Miech *Here is something to think about**, and why so many Americans support Donald Trump !!* (This information has all been checked, then double checked... it is 100% Correct.) That's why there is such an alarm within US government, since Trump's statement about temporary suspension of migration of Muslims to US till US authorities make sure there is a proper concept of safe penetration of US territory. People are stunned to learn that the head of the U.S. CIA is a Muslim! Do hope this wakes up some! You mean until it hits you like a ton of bricks read it again, until you understand! We now have a Muslim government. @username, current head of the CIA converted to Islam while stationed in Saudi Arabia. Obama's top adviser, Valerie Jarrett, is a Muslim who was born in Iran where her ...","post_message":"Do you know what the actual percentage of money the Clinton Foundation has raised that they donate so far to charity is? It's like 5%."},{"comment_id":"657748434349749","commenter_b":"CANCEL the game, go to half time show, then go home. Terminate the remainder of football season. Have each player turn in his jersey...","commenter_a":"I WOULD LOVE TO SEE AN ENTIRE STADIUM WALK AWAY FROM THIS CRAP...","post_message":"The entire team decided to pay tribute to Kaepernick and take a knee during the National Anthem. Guess how that worked out for them."},{"comment_id":"1832240316996227","commenter_b":"Since you took the time to report this, why not put the effort to fix it? or educate us how to prevent this? Or are you one of those assholes that like to stir up nonsense to get recognitions?","commenter_a":"When I was young I vowed to kill all the bees. I see my plan is working.","post_message":"Do NOT scroll past this!! ✋✋ Source → @webpagelink #WakeUpCall | #SaveTheBees Join Us: The Free Thought Project"},{"comment_id":"10153070699666028","commenter_b":"Cuz ur DUMB","commenter_a":"No vote here !!!!","post_message":"\"I have a great relationship with the Mexican people\": Donald Trump tells NBC in an interview that \"there's nothing to apologize for\" regarding his comments made about Mexican immigrants last month. He says he believes he will win the Latino vote. \"I will create jobs and the Latinos will have jobs that they don't have right now. And I will win that vote.\" @webpagelink"},{"comment_id":"10154712267998145","commenter_b":"@username no you're just a pussy","commenter_a":"And the trend has been set. Everybody just open fire at will. Don't worry about those pesky innocent bystanders and there's no need wasting tax dollars on a trial. Apparently stealing is an automatic death sentence. From diapers to Dodges citizens can now act as judge, jury and executioner. Smh.","post_message":"A man shot at least 18 times at someone who had stolen his pickup truck early Monday from an apartment complex, the Winter Garden Police Department said"},{"comment_id":"10154282562893797","commenter_b":"Get rid of her dumb A S S","commenter_a":"Have her arrested and charged her for treason!","post_message":"BAN OVERTURNED: A school principal banned Santa, Thanksgiving and the Pledge of Allegiance at her school. However, the Department of Education wasn't having any of that. And now, some have started an online petition to remove Eujin Jaela Kim as principal."},{"comment_id":"10154315361436656","commenter_b":"Shes a bi**h fr","commenter_a":"Let it go nothing or know one is perfect, and we surely can't do what she does on a good day! Let it go... Damn media!","post_message":"\"I'm trying to be a good sport here.\""}]
