[{"comment_id":"1037969679612623","commenter_b":"Preach it brother!! Racial hangups. More racial tension in this nation since the 1960's. that is a fact. Does every speech have to include how everyone use to be slaves, so down trodden and pitiful. I know alot of blacks. They are smart, educated and are not prisoners of the past. We understand history, we know what happened. But my goodness, dont be so beat down by killary. Dont let her use you. After all, she said, \"blacks are predators and she needs to bring them to heel\". So who has racial hangupsI I'll check back for your answer.","commenter_a":"I realize slaves help build the whitehouse. Whtes also helped build the whitehouse. That would have been a good statement. Like, blacks and whites worked together to build the place where our presidents live. It was a joint effort. But as usual, race baiting and on and on about how slaves had to rise up etc... We have had a potus who has made racial tensions the worst they have been since I was a teenager. How is this unity? How have bama and shelly brought unity to our nation? More rioting in the streets more blacks killing each other, our people are fighting and against each other. So much for the legacy of the first black potus. Now they want a woman to be the nxt black potus.","post_message":"Well said, Kelly Clarkson!"},{"comment_id":"959924910733924","commenter_b":"Nonsense don't believe the Hype. why don't you start a campaign to get rid of us Scots? You will be doing us a favour. For the record were not antiEnglish were antiWestminster","commenter_a":"All paid for by us Nice English people No wonder they voted against independent They would be mugs to leave their gravy train","post_message":"How Scotland got RICHER during austerity thanks to English taxpayers"},{"comment_id":"10155182239718984","commenter_b":"Go to hell BITCH","commenter_a":"Let the criminals out. Let illegals in. Let boys in the girls bathrooms. Condemn police officers. Persecute Christians. Don't care about the veterans. Pervert the children. Kill the unborn. Stomp on and burn the American flag. Accept barbarity in the name of Islam. Protect the Sanctuary cities. Cuddle the lazy. Encourage hate crimes. Destroy properties. That's the liberal way!","post_message":"Nancy Pelosi just dropped a lot of jaws with what she had to say about impeachment. Donald Trump will definitely want to hear about this..."},{"comment_id":"10153826114722994","commenter_b":"What about them lying women. Who spred there legs to get bill money. I still respect bill. I still watch he's show.. get on the man who allowed them underage girls to come into that mansion..","commenter_a":"If the press and police will get over their prejudice and look at white males the way to they do black males as suspects, it would be a lot of white children alive today! \" They deserve a voice too! It's no coincidence, that these types of crimes don't get the scrutiny, they deserve. This is why child kidnappings, molesters, underground child porn rings, Internet pedophiles, thrive in suburbia, because they're white. R.I.P! Little one, the press will catch on sooner or later. The way I feel about inner city children dying by bullets in Detroit, is the same way I feel about suburban children dying at the hands of a kidnapper. They all deserve to live.....","post_message":"11-year-old Jacob Wetterling vanished in October 1989 while riding his bike. Almost 26 years to the day, police in Minnesota say they have a person of interest - and it was someone they looked at just days after he disappeared."},{"comment_id":"1032023936930784","commenter_b":"Dear God if people did this to the Obama girls everyone would be pissed","commenter_a":"Sick freaking guy that Spinola..Ugh.","post_message":"Oh, Hell no..."},{"comment_id":"1218857281537727","commenter_b":"She is still authentically uncorrupted. may she hold on to that and help the US find itself again","commenter_a":"Could please run for president ! Please","post_message":"Education is power and to fight sexism and inequality, Michelle Obama has a message to young girls around the world. (via NowThis)"},{"comment_id":"861355680627352","commenter_b":"ronan need to go, and joy should replace REV AL at 5pm cst is very very hard to watch his show!!!!!","commenter_a":"did someone from fox come over and take over in charge of show selection as I am with the others why keep Scarborough who belongs over on fox and let these two go....way to lose viewership","post_message":"Ronan Farrow reveals the answer to a big question ... almost."}]
