[{"comment_id":"1231536326885822","commenter_b":"She's not getting in the White House !","commenter_a":"The real sad thing is that Hillary won this election a long time ago with lies , blackmail, payoffs etc. The list goes n and on. She and her party are so dangerous and I fear our world will never recover from her.","post_message":"SHADY KAINE @webpagelink"},{"comment_id":"10156372463505354","commenter_b":"OMG that laugh of hers is so annoying and she is a ugly old bitch! Carley is so much more a women than Hillary could ever be and much more knowledge than the old hag. She let four Americans die in Benghazi she should not even be able to run for President and her emails and her and Bills Clinton foundation fiasco I could go on !","commenter_a":"She is sick","post_message":"*DEMOCRATS' WAR ON WOMEN* Remember how the liberal media EXPLODED when a questioner asked Trump about \"Muslim Obama\"? Well, look at THIS..."},{"comment_id":"10153860760766135","commenter_b":"You are so right.","commenter_a":"It was not a mistake, it is business as usual at Detroit Animal Control.","post_message":"\"As a result of a computer status error, a tragic and unacceptable euthanasia was authorized.\" -- Detroit Animal Control"},{"comment_id":"10153431961096130","commenter_b":"Look what she made him do!","commenter_a":"I was NEVER a fan of Johnny Fraud!","post_message":"Johnny told police that his girlfriend was both “a little mad” at him and “a little bit intoxicated.”"},{"comment_id":"10155711262144657","commenter_b":"Yep!","commenter_a":"He already does......see Trumpsters have always had a direction to Trump.....we do not CNN Clinton news nerwork or any other left stream bias pieces of crap. This way we get the info before lamestream media manipulates it.","post_message":"Calm down, everyone."},{"comment_id":"10153725740586336","commenter_b":"Who Cares. He's a Conservative Rapist","commenter_a":"Keep him on the other side of the Trump Wall.","post_message":"Police say Paul Jackson and his older brother, Vance Roberts, kidnapped prostitutes, drove them to Roberts' home and held them captive for days."},{"comment_id":"10155243309639411","commenter_b":"Good @username get all this white people off welfare!","commenter_a":"It's OK , white people it's only for a day. You guys don't have to come off welfare in massive numbers tomorrow to make sure the strawberries get picked!","post_message":"People in Indianapolis joined the nationwide “Day Without Immigrants” movement in an effort to show how critical they are to the U.S. economy and way of life."}]
