[{"comment_id":"1056647814370639","commenter_b":"Let's be honest. HE is not confused. HE is still a MALE. And absolutely a disgrace.","commenter_a":"NO, are you kidding me?","post_message":"Do you agree with MAC's decision? Yes or no?"},{"comment_id":"1277480212306141","commenter_b":"Yeah, she's a racist.","commenter_a":"STOp THE HAte","post_message":"CLAREMONT COLLEGES “Students Of Color” REFUSE To Live With Whites: “I don’t want to live with any white folks”…”Don’t see how this is racist at all”"},{"comment_id":"499187636938483","commenter_b":"Send her sorry ass back to the jungle with her relatives.","commenter_a":"Come and get them you POS!!!","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10154490537796509","commenter_b":"Hillary will not even go on FoxNews because she is afraid of the questions. Trump is on every liberal channel.","commenter_a":"Very good luck for Hillary clinton...MY she beat all her contestants...especially Donald Trump...","post_message":"Donald J. Trump's campaign attributed the decision to pre-existing campaign engagements, but it's likely to reignite discussion about the longstanding feud with Fox News and with Megyn Kelly."},{"comment_id":"10153623967716323","commenter_b":"This is the best thing ever said. Ever.","commenter_a":"Uniting all parts of Yorkshire could be a bad idea. If it took our fancy we could go game of thrones on your arse!","post_message":"\"Pit a bunch of Yorkshire folk against outsiders and they’ll all chunter on about how chuffing brilliant God’s Own County is. Put a Bradfordian, a Sheffielder, a Yorkie and a Leeds lad in the same room, however, and they’ll argue about their football teams, the relative quality of their beer, the beauty of their landscape and women, and everything in between. Often all that will unite them is a shared disdain for Hull.\" Full disclosure: Helen Pidd is from Lancashire."},{"comment_id":"737985369668440","commenter_b":"Madwoman as bad as Obama, she must be Satan's tool...","commenter_a":"Angel of death!","post_message":"By BI\" She wants to recruit even more African and Balkan Muslims to fill positions as doctors and electrical engineers. Notice the stunned looks on the people who are listening to this rubbish. @webpagelink"},{"comment_id":"10154836635824916","commenter_b":"Yeah, he's almost as bad as Hillary! Why would anybody ever vote for either of those criminals!","commenter_a":"Of course. . . . The man is a business man being sued, up one side and down the other. He lied, often in the same speech. . . . He says wgatever pops into his head.","post_message":"It's going to be a rough four years for progressives, but Trump fans aren't headed toward happiness either."}]
