[{"comment_id":"10150565402804999","commenter_b":"Please don't vote for her just because she's a woman.There are plenty of good women out there to vote for.","commenter_a":"Anyone who votes for her is showing support for terrorism and the killing of US personnel","post_message":"“I’m running for president,” Hillary Clinton said with a smile near the end of a two-minute video."},{"comment_id":"1071771339501789","commenter_b":"@username Blacks are Americans, so are whites on assistance, and American Latinos. I would rather support 20 million of them than 1 illegal Anchor baby and it's Family. Maybe all those Americans on assistance wouldn't need assistance if the illegals weren't taking the jobs Americans need.","commenter_a":"My mother was a volunteer Pink Lady at the hospital in Weslaco Texas and she verified several times to me that Latinos routinely arrived in labor so they had no time to get back to Mexico. They wanted their babies born in America.","post_message":"Astonishing video proving Donald J. Trump is right... Ten percent of the people born in America today are to children of illegal aliens..."},{"comment_id":"10156036197975293","commenter_b":"I don't get it. If a woman pulls her breast out in public it's illegal. I a man looks at her breast he's a perv. So why dose a woman want to breast feed in public.","commenter_a":"It's awesome","post_message":"A picture of some soldiers breastfeeding has gone viral. READ the story and let us know what you think."},{"comment_id":"10153602966152217","commenter_b":"@username what a silly girl.","commenter_a":"Because corruption in Nigeria is a way of life practised at all levels of society and to suggest a correlation between corruption in Nigeria and in Westminster is fatuous and ridiculous, that's why.","post_message":"Why is David Cameron \"lecturing\" Nigeria and Afghanistan on corruption when Tory MPs are being investigated for potential electoral fraud? That's the question raised by the Scottish National Party's Angus Robertson. @webpagelink #PMQs"},{"comment_id":"1103808136307925","commenter_b":"Don't explain...just tell her to go, now!","commenter_a":"Why don't these people go now ??? It is no big loss !!!!","post_message":"Someone really, really, really needs to explain to her how this whole process works."},{"comment_id":"950601424986485","commenter_b":"It is none of your concern if a person has an abortion, mind your own business!","commenter_a":"if a woman is too careless/stupid to not have 'protected' sex, then she gives up her right to murder an innocent child! BE A RESPONSIBLE PERSON not a murderer!!!!","post_message":"An excellent idea!"},{"comment_id":"1100490033318081","commenter_b":"Suck it up b**ch","commenter_a":"I thought this family was rich. What gives?","post_message":"Hardly 5 star quality... \"She explained a slight bit of displeasure about her accommodations and I explained to her this a jail, not a resort.\" -Sheriff Anderson @webpagelink"}]
