[{"comment_id":"850932761669644","commenter_b":"Send her over better yet send her kids not mine","commenter_a":"I hate to break this to some people but the only Americans that are there any legitimate threat from Isis are the Americans were going to be sending over there..... Somehow Obama has managed to kill over 10,000 Isis fighters by dropping bombs without one single American military casualty..... Why change the game plan now?","post_message":"Do you agree with Rep. Barbara Lee?"},{"comment_id":"1473072332752510","commenter_b":"@username So do God Almighty, do you have a problem with Him also taking care of them? When you stand before Him on JUDGMENT DAY, you are going to be sorry you didn't do anything to help them also. Because God Almighty said, TREAT THEM WITH KINDNESS AND AS A NATIVE (meaning CITIZEN) BORN IN YOUR LAND. I WILL DESTROY ALL WHO TURNS AWAY AN ALIEN(illegal immigrants). I guess your behind is going to FRY big time come JUDGMENT DAY.","commenter_a":"The kids look healthy and happy.. And she taking care of them that's all it matters.","post_message":"EXCLUSIVE: 'I had to kill Octomom to save my life.'"},{"comment_id":"1487031254643822","commenter_b":"Stupid? Of course they are. These are the women that will vote for Hillary for one reason only. Because she's a woman.","commenter_a":"The stupidity of some Americans gas gotten it of hand. Grow up baby cakes.","post_message":"Sorry Wonder Woman, feminists hate you because you have big boobs."},{"comment_id":"822359307886042","commenter_b":"It was meant for this baby to live","commenter_a":"God directed that Officer to the area. He is Hero","post_message":"A newborn girl thought to be only 36 to 48 hours old was found alive in Compton on Friday. The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed. Detectives are now asking anyone with information to come forward. this post to alert others. Read KTLA story here: @webpagelink"},{"comment_id":"10153123096616770","commenter_b":"They'll leave on their own !","commenter_a":"Send back the illegals!","post_message":"Donald J. Trump wants a “deportation force” to remove the illegal immigrants currently living in the United States."},{"comment_id":"10153573726630950","commenter_b":"bitch shut your half dead looking ass up !!!","commenter_a":"I am watching on television and I am seeing a lot of Mexican Flags. This is absolutely unacceptable. Last time I looked, California is still a state in the United States of America. If you want to fly the Mexican Flag, go back to Mexico!","post_message":"WATCH: Protesters are gathering outside of a Donald J. Trump event, shouting chants and clashing with police @webpagelink"},{"comment_id":"891579364198188","commenter_b":"You're right. It just seems women are more selective.","commenter_a":"How about guys? It is not just all women!","post_message":"Well this is horrifying. (via The Huffington Post)"}]
