[{"comment_id":"10156550140360354","commenter_b":"WAKE UP AMERICA !","commenter_a":"Go girl!!","post_message":"What in the...?! And no, it's not a joke. It's a REAL lawsuit. Look at the documents..."},{"comment_id":"1103020493078450","commenter_b":"@username and Donald Trump's wife is a illegal alien what's your point","commenter_a":"Can somebody explain this to me. Donald Trump just had a physical done and all of his stats are great for 70-year-old man. But yet factor in the draft he couldn't pass a physical exam. Did he get more healthy in the last 50 years? No I don't think so. And it wasn't because of a physical disability. Because right after he dodge the draft he just went to college and play physical sports such as tennis squash and football. So now the medical Side of the argument is contradicting 50 years later. The physical part of it is completely out of the question at the time of the draft because of the sports he played right after he dodged a war. So what other excuse is there to keep you out of the draft? Please somebody answer this question. And these veterans today deserve to hear the answer to ...","post_message":"After four days spent recovering from pneumonia, Hillary Clinton returns to the campaign trail, chats with reporters aboard her plane @webpagelink"},{"comment_id":"10153489348776756","commenter_b":"Only a woman could find something completely fucking trivial to bitch about a great thing.","commenter_a":"#FirstWorldNonProblems","post_message":"\"Can I just passively refuse to pass the beach balls back up until they collect around my feet in one incriminating pool? How coldly can I glare at the people who try to resurrect the beach balls I've silently condemned to the ground?"},{"comment_id":"1067333573359551","commenter_b":"Latinos with Hillary!!","commenter_a":"Thank you Hillary for running and you've got our votes!","post_message":"This is a moment when we all need to stand together. Watch live as Hillary speaks on the terrorist attack in Orlando."},{"comment_id":"1210447342329069","commenter_b":"@username you are the brain washes moron if you believe the bs","commenter_a":"Of course republicans are pissed that Obama got those prisoners freed... They wanted those people to be killed thus becoming martyrs so they could use it as another excuse to go to war... And anything positive Obama does deflates their efforts to talk shit and make him look bad...","post_message":"Things just got VERY awkward for Obama's Iran critics."},{"comment_id":"161828217554597","commenter_b":"Racist bitch","commenter_a":"The racist white ppl that support Trump never show black ppl in a good light!! Never!! @username is the most racist of the right-wing, white supremacist sites!","post_message":"After the Louisiana flood, this man started wondering when the help from Black Lives Matter and Black Panthers would be arriving... The TRUTH is devastating..."},{"comment_id":"861215140607271","commenter_b":"Alex, it wasn't proven to be false. Please cite the \"proof\".","commenter_a":"I respect you Senior Airman but your comparing Ron Paul & Jessie Ventura to the killer as \"typical\", is absolutely ludicrous. I don't even know where to start I'm so disappointed.","post_message":"EXPOSED: Chris Kyle Killer Didn Have PTSD, Was A Typical Anti-War Punk Like Bradley Manning. I like to know if Routh or his family had any contact with Jesse Ventura in the days before he murdered Chris Kyle. Allen West and Walid Shoebat are also trying to sort out if his anti-war beliefs had graduated to jihadi sympathizing or... #americansniper #dallasobserver #guns @webpagelink"}]
