[{"comment_id":"10153081516228822","commenter_b":"Eliza sounds like she's the one going to hell.","commenter_a":"Why is this topic constantly being forced down our throats","post_message":"It was a historic day for marriage equality in the US -- and Pittsburghers had a lot to say."},{"comment_id":"1239839009369460","commenter_b":"@username is a wetback that's gonna be deported.","commenter_a":"When the immigrants - illegal or not - leave the USA, be prepared to clean your own toilets. Americans are lazy. Plain and sheer.","post_message":"Under the Eisenhower program, immigrants inside the U.S. were rounded up and deported to remote places, resulting in deaths and criticism of human rights abuses."},{"comment_id":"10154406219790329","commenter_b":"She's taking the piss out of men who try to compensate for their little sausages, get it now?","commenter_a":"Jacqueline Boggs","post_message":"\"My vagina just sneezed, judging from my underwear.\""},{"comment_id":"10157648853630389","commenter_b":"I cannot stand this woman! She's an evil individual!","commenter_a":"I think Hillary is in for a very soul awakening! God did not choose and Call a man, Donald J. Trump, to lose! Donald J. Trump, answered God's Call, he did not have to do this! God is still in Control and this is God's Creation, not the Clintons, BHO, Soros, the big bankers, or any government! Look at all of the corruption & evil that has been EXPOSED TO THE LIGHT AND HAS BEEN GOING ON FOR YEARS & YEARS AND GOD KNEW IT!!! Life is like a tapestry, we see the underside, the messy side, but God sees the finished beautiful side and knows the reasoning behind every stitch. We have repented and we have asked God to save this country, ask and it shall be given! Deuteronomy 32:35 'Vengeance is Mine, and retribution, In due time their foot will slip; For the day of their calamity is ...","post_message":""},{"comment_id":"1666670816943719","commenter_b":"Let's help protect the interns at the White House! Keep the Clinton's out!","commenter_a":"I can NO LONGER DRINK TRUMP'S POISON. Stupid me. Anyway, Donald, you are SATAN.","post_message":"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!"},{"comment_id":"10153692809021694","commenter_b":"\"there are people who care enough to find you\" Riverrrrrr??? D:","commenter_a":"@username :0","post_message":"We have so many questions, but we won't have to wait long for answers!"},{"comment_id":"1007076626015699","commenter_b":"Yes they need to hire them back and get rid of the illegals that took there place ...what needs to be done is the illegals need to be shipped out of this country we don't need them not do we want them","commenter_a":"they need to hire them back","post_message":"Trump also criticized Marco Rubio for sponsoring the \"I-Squared\" bill that would TRIPLE the number of H-1B foreign visa holders in the U.S."}]
