[{"comment_id":"950976811609844","commenter_b":"Yes!!! Although these women should be considered normal size and healthy... Definitely not 'plus size'... Sick of all the labelling... How 'bout healthy, happy and active?!","commenter_a":"I don't care what anyone else thinks. I think she looks great. But I think the more important question is \"How does her personality, intelligence, etc. compare with her looks?\"","post_message":"So excited for The Official Ashley Graham Fan Page, the first \"plus-size\" model to have an ad in Sports Illustrated! AND for Robyn Lawley, who's the first \"plus-size\" Swimsuit Issue model! Here's why that's so exciting."},{"comment_id":"10154836635824916","commenter_b":"Yeah, he's almost as bad as Hillary! Why would anybody ever vote for either of those criminals!","commenter_a":"Of course. . . . The man is a business man being sued, up one side and down the other. He lied, often in the same speech. . . . He says wgatever pops into his head.","post_message":"It's going to be a rough four years for progressives, but Trump fans aren't headed toward happiness either."},{"comment_id":"906483276114592","commenter_b":"Oh shut up Jindal you backward cretin. The world's views have changed and long overdue. I am glad to see that people can choose to marry whomever they want. We all live on this planet and all should be able to marry who they choose.","commenter_a":"Separation of Church & State! What part of that doesn't this fundamentalist christian rube understand?","post_message":"“I hold the view that has been the consensus in our country for over two centuries: that marriage is between one man and one woman. \" -Gov. Bobby Jindal"},{"comment_id":"1047100888663716","commenter_b":"She's an embarrassment to womanhood.","commenter_a":"This woman is always putting her foot in her mouth. She's right up there with Sara Palin.","post_message":"Watch her crash and burn."},{"comment_id":"10153774153353145","commenter_b":"hello your in AMERICA","commenter_a":"If this sign dictated what language I spoke at home or with my friends, I would take offense. But if this sign was at work, I think it is appropriate to expect English. You shouldn't be off carrying on non-work related conversations anyway, English or not.","post_message":"English only? Many Hispanics who use the Deltona Community Center took offense to this sign. How would you feel if your job tried to enforce this rule? The organization said the sign was necessary for safety reasons. @webpagelink"},{"comment_id":"10154466561263701","commenter_b":"Shawna you just said what I'm thinking!!!","commenter_a":"Reading these comments show that the majority is against her, read a trump article and the majority is in favor of him. If she wins we will know how truly corrupt our election system is.","post_message":"What did you think of Hillary Clinton's DNC speech?"},{"comment_id":"867761519952633","commenter_b":"Illegals can get drivers licenses in NC.....no problemo! Dumb!","commenter_a":"Illegals can drive drunk but I can't. Now that's discrimination. Lol","post_message":"BREAKING: Leaked Document Reveals SICKENING Order Obama Just Issued To Border Agents President Barack Obama has issued a new order for the Border Patrol not to arrest drunk drivers because driving while impaired is not a federal crime. The notice, With Alcohol-Impaired Drivers, directed the 4,000 U.S. Border Agents in the Tucson... #arrest #borderpatrol #drunk @webpagelink"}]
