[{"comment_id":"10155024202814703","commenter_b":"America has American terrorist's as well. Why no effort on banning them, or shipping them out of our Country???","commenter_a":"Bet you never thought you would see planes crash intentionally into buildings either","post_message":"Thoughts?"},{"comment_id":"1065627820160413","commenter_b":"I like Hillary because she will help the illegals... Republicans are against illegals claiming 20-30 kids on their tax refunds from other countries, it's on you tube tax refunds for illegals...","commenter_a":"I am voting for @username it is time for woman to take charge. She will accomplish the Mission.....","post_message":"\"To Democrats around the country...I urge you to raise your own voices this year by voting for the person who shares your values and who will fight tirelessly for you and your family. I know, for me, that candidate is Hillary Clinton.\" —Senator Kirsten Gillibrand"},{"comment_id":"1404580556268355","commenter_b":"Highly inappropriate for her to attack a child like that. Grow up, woman!","commenter_a":"What's wrong with feeding a dog some vanilla ice cream? I seriously don't get it","post_message":"Said he 'already looked like a f****** d*******'"},{"comment_id":"10154608110303701","commenter_b":"She's a real winner. Just block her idiot ass.","commenter_a":"Good hes a pos","post_message":"A Sherwood man is being charged with manslaughter for a crash that killed a 2-year-old in Deschutes County, according to police."},{"comment_id":"10153629166689170","commenter_b":"I bet Herman has watched this a 1000 times","commenter_a":"You mean to say that I have to save this so I can show my lil boy when he gets older the travesty that happened and the wrongs performed by these terrible women, it won't be easy but it's for future reference , thank you Libs for bringing this horrible video to our attention or no one would have known about it hahahaha","post_message":"The left does not want you to ever watch this video because it's \"hyper-feminine\" and not diverse or something. So even though we've embedded it here, don't watch it!"},{"comment_id":"1166954960025334","commenter_b":"You are so right. All this is her own doing.","commenter_a":"Why didn't Hillary say, I have heard the question? Shows character of Hillary.","post_message":"CNN FIRES BLACK DEM Party Chair: New Wikileaks Email Exposes SECOND Question Donna Brazile Gave To Crooked Hillary In Advance Of Debate"},{"comment_id":"10153395340948984","commenter_b":"She's the one who put the hatred for America in his heart, she should be deported immediately!","commenter_a":"Give her the same!!!","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing... Do you think this Boston bomber got what he deserved?"}]
