[{"comment_id":"1231833570240008","commenter_b":"We voted for Obama twice now we are racist. A lot of african's and Hispanics voted for Trump. If Hillary would have been a better candidate and visited the states Trump won she would be president.","commenter_a":"And you're saying that the BLM, BLACK PANTHERS are any different. This shows how blind that you are","post_message":"\"These white Americans tuck their heads under cone-shaped hats and American flags ... training their guns on the unarmed, the innocent, the scared ...\""},{"comment_id":"10153475441185329","commenter_b":"Bologna on stage lights sounds familiar.","commenter_a":"@username, I assume you have already done this many of times.","post_message":"This is how real men grill."},{"comment_id":"647292048744709","commenter_b":"Only think Muslim country doesnt provide is Security Reason for us to move USA !","commenter_a":"There is a renewed campaign that's getting a lot of attention to get the Equal Rights Amendment (ERA) into the U.S. Constitution. Many candidates talk about their support for fair treatment of women, and this amendment would provide a fundamental guarantee of equal rights. If elected, will you actively support the ERA? #GOPDebate","post_message":"Don Lemon is taking you through the latest in Facebook trends ahead of tonight's #GOPDebate. Have questions? Ask him anything!"},{"comment_id":"1342533789196332","commenter_b":"It's all the evil devil and god. God controls everything so all Christian's say. So he was obviously murdering babies in Syria with an American fleg while satana Satana was makin googoo sing good lol. It's the devil but. Fuk away aff to your backward bible ye balloons and leave the rest the world out your hilariously illogical book of fairytales. Batter still. Get one your mates to stab you in the eyeball so you get t meet Jesus sooner and save us having to see an read your hilarious pish from the days before people could read. Pol","commenter_a":"They all signed in blood, sold they're souls! Devils!","post_message":"Someone Removed Background Music From Lady Gaga’s Superbowl Show, And It’ll Give You Goosebumps"},{"comment_id":"1742914335970564","commenter_b":"Where are we going to put all these people . ???? I just have not seem many pictures of great families knocking on our countr's door but mostly young to middle age men with anger and mean expression written all over their faces . How will we cope ????","commenter_a":"Noooooo","post_message":"That's a 550% increase!"},{"comment_id":"10153111712291491","commenter_b":"Respectfully disagree. I like my women a pretty delicate flowers, but that's just me.","commenter_a":"She might be the all around inside/outside sexiest female of the 21st century!","post_message":"Ronda Rousey's next opponent: the box office."},{"comment_id":"1451058244908937","commenter_b":"Deport illegals!!","commenter_a":"Florida for Trump!","post_message":"LIVE Trump! DRAIN THE SWAMP FOLLOW US for Conservative news!---> Freedom Daily Donald J. Trump Donald Trump For President #maga"}]
