[{"comment_id":"1284672578275634","commenter_b":"The woman is Wacko !!","commenter_a":"And so are the Subpoenas!","post_message":"Six weeks after the election, email leaks are plaguing Hillary Clinton."},{"comment_id":"726722780803193","commenter_b":"Bloody Tim with all his Facebook profiles!","commenter_a":"Tim Duurland @username Adam Burns Tim Duurland","post_message":"This \"smart table\" could be the future of ping pong."},{"comment_id":"10154692333454203","commenter_b":"EAT ME ASSHOLES!","commenter_a":"Dallas Lavalley","post_message":"This is how Donald J. Trump treats women."},{"comment_id":"10150858432674999","commenter_b":"She s a crook and a liar","commenter_a":"Hillary is going to make a great president. Very much looking forward to seeing who she adds to the supreme court. Nice to see a woman deciding how American culture will be defined for our children and children's children. She's going to shape society for hundreds of millions of Americans. We love you #hillaryclinton","post_message":"\"There has never been a man or a woman — not me, not Bill, nobody — more qualified than Hillary Clinton to serve as president of the United States of America,\" President Obama said. Read more: @webpagelink"},{"comment_id":"1393941760623890","commenter_b":"Just like they blocked Obama?","commenter_a":"It's a shame that Democrat voters don't vote on issues such as jobs, the economy, and security... They vote for the candidate who has the most celebrity backing... Low info voters.","post_message":"Lady Gaga criticized Melania Trump for saying she wants to end cyber-bullying if she becomes first lady. @webpagelink"},{"comment_id":"10154286409446800","commenter_b":"That's pussy shit. And we agreed on 2","commenter_a":"Jami Hugo Omar Oliver","post_message":"Tonight at 11/10c on The Daily Show: #NationalHandshakeDay, a Brexit update and most important, Jessica Williams’ final show."},{"comment_id":"1242932969112927","commenter_b":"shes a nigga","commenter_a":"the origin of dream locks is india; not africa, not jamaica, not america. that girl is ignorant.","post_message":"Black student filmed confronting white student because of his hairstyle"}]
