[{"comment_id":"800309873404645","commenter_b":"16-years ago America watched as the Clintons packed their moving vans with about $200K of stolen furnishing and valuables from the White House and drove away, finally removing a large stench of corruption and sleaze from our nation's capital. We'd be insane to allow them back. TRUMP-2016 MAKE AMERICA GREAT AGAIN!!!","commenter_a":"Counter punch...she has a glass jaw. (email, poor sec of state, another Obama)","post_message":"Crooked Hillary Clinton is spending a fortune on ads against me. I am the one person she doesn't want to run against. Will be such fun!"},{"comment_id":"10153348375511756","commenter_b":"Women are just as capable of destroying the infrastructure of poorer countries leading to the suffering and death of millions of innocent people as men are.","commenter_a":"No women on front line.","post_message":"Cpl. Jasmine Abrego is just 5 feet 1 inches tall. She left her job as a Marine clerical worker to train for the infantry and, as she puts it, \"kick bad guys' butts.\" \"Mentally it's just being strong, you just get stronger,\" she says. \"You just push yourself through it, that's what I've been doing.\""},{"comment_id":"1334924336529627","commenter_b":"@username that's great except sometimes the child is tricked by a family friend, a coach, a counselor, etc... people that don't appear to be creeps. I'd like to help children see the signs, know what type of lies these predators tell them, and know how to get help if it's a family member or someone else. Killing the perpetrators after the fact will do nothing for the victims. Especially this little girl... she's already dead","commenter_a":"When I was young and in school we had the D.A.R.E program, trying to educate youth about drugs and help us make good decisions not to do them. We need a program now to educate our children on sexual predators, how to watch out for them, to be aware of how they manipulate, etc and where they can call for help and a safe harbor. I would happily volunteer to speak at any school. We need to protect these children and let them know they are not alone and that where someone may have failed them, we will not.","post_message":"Awful"},{"comment_id":"1222800194406675","commenter_b":"we want some in the NW!!!","commenter_a":"Noooooooooooooooo","post_message":"Millions of Americans woke to chilly temperatures Saturday, and many could see (gulp) snow before the weekend is over."},{"comment_id":"10153739431762235","commenter_b":"Maybe if more men were any good in bed the women might enjoy it. 90% of men are terrible in bed. Stop putting it on women.","commenter_a":"Horrifying","post_message":"There's so much wrong with this, I don't know where to start ..."},{"comment_id":"10154086609949270","commenter_b":"@username I wouldn't scream foul if a woman was captured simply because she's a woman. Don't ASSume that, thanks darling! They take the risk just like any other man serving. You assume that a lot of women would want to jump in to combat roles over the 'safer' ones. Some might, yes. Not all. Just like having the Ranger tab it does not mean you will be in a Ranger regiment. Women are not afforded all paths in leadership like men are. I never said the standards should be lowered, did I? Nope. I VERY CLEARLY said \"If these women could not pass at the lower standards, then they have no business being part of it. So, they didn't make the cut, and yet you're still pissed off? \". Read it again, and again, and again until you understand what I wrote. Should I spell it out in simpler terms? ...","commenter_a":"There goes the military! Fools! They already lowered the standards for SEALs because of their little 5 year project that ended in 2015! They had to lower the standards and give them \"step boxes\" to complete the courses! What a crock of crap! Even at lowering the standards NO FEMALE PASSED! Certain \"jobs\" in the military should be left to the men! Females will put soldiers lives at risk when they get shot, twist an ankle, break a nail or just have a bad case of PMS! This government is ruining everything!","post_message":"The women are the first female soldiers to be accepted into the Special Forces Assessment and Selection and could report to Fort Bragg as early as October."},{"comment_id":"10153341159307411","commenter_b":"It will happen. We've cowered to idiots. Time to be unpoloticaly correct. We Americans are fed up. Obama and bush did nothing. Hillary is evil. We need shorter sidewalks and taller fences. These people are evil.","commenter_a":"Those isis fools try and scare people with talk like KKK,Trump,and the Republican party,pay attention and listen it's all the same act.","post_message":"A group of ISIS supporters has threatened to take down Facebook and Twitter -- as well as their leaders."}]
