[{"comment_id":"775776192555196","commenter_b":"When God or nature grants you a vagina and uterus, you'll have a say in reproductive rights. Until then, NO. You canNOT force your girlfriend to continue an unwanted pregnancy to term, you creep. That's rape.","commenter_a":"So if a father wants his baby a woman can kill it with out his permission I guess a man only has rights to a child when a woman wants his money for the next 18 years rape is the only time abortion is ok if it's not from rape abortion is murder stop sugar coating avoiding responsibility if a woman wants a child and a man doesn't can he force an abortion no woman do not have exclusive rights over children just because you carry it for nine months a child beongs to both male and female hate me if you want to but my child was MURDERED! With out my say!! How is that equality?!","post_message":"Elizabeth Banks, Bellamy Young, and others share abortion stories to #drawtheline."},{"comment_id":"1075762019148635","commenter_b":"I want that :)","commenter_a":"Alli Rauscher","post_message":"Piper the abandoned pig just got a new home (and a new best friend)! Via The Dodo"},{"comment_id":"1067333573359551","commenter_b":"Latinos with Hillary!!","commenter_a":"Thank you Hillary for running and you've got our votes!","post_message":"This is a moment when we all need to stand together. Watch live as Hillary speaks on the terrorist attack in Orlando."},{"comment_id":"1020710211322060","commenter_b":"Alexcea Erini Apostolakis bod","commenter_a":"I think the poor girl should be left alone","post_message":"The birthday festivities never end for Kylie Jenner (via Daily Mail Celebrity)"},{"comment_id":"1221649794521715","commenter_b":"Thats not how a hoe talks to a pimp literally in this case","commenter_a":"He's just trying to cover his own butt.....","post_message":"The owner of the Nevada brothel where Lamar Odom was found unconscious says Khloe Kardashian's publicist has asked him to stop speaking to the media — a request that made him furious."},{"comment_id":"10152698246092293","commenter_b":"Obama is SCARED His Funding of these TERRORISTS, will have to STOP!","commenter_a":"Obama was right not to go.","post_message":"\"We agree that we should have sent someone with a higher profile in addition to the ambassador to France.\""},{"comment_id":"843269965740273","commenter_b":"How do you know it's a woman?","commenter_a":"It's so sad to see how judgmental people are. Opinions are like belly buttons. Everyone has one and they're filled with lint. To call this woman names and degrading her by calling her IT, is shameful. Not everyone lives inside the box or mold of society. \"Free your mind, and the rest will follow!\"","post_message":"Today's culture is damn sickening. This thing is straight from hell and should be sent back. This is ridiculous..not even funny"}]
