[{"comment_id":"10153960643118984","commenter_b":"Just take ur stinking ass and ir ugly ass women with u","commenter_a":"You all need to vote ... get rid of this crap ....","post_message":"I can't imagine what this woman must have felt when this Muslim cab driver did this... Do you support this judge's decision?"},{"comment_id":"10152931413566491","commenter_b":"Love how in America, its the land of free ONLY if you don't go against the status quo or what's defined as \"normal.\" I'm a straight dude, and guess what? When it comes to gay people, I mind my own business. I support the human right to love, so long as no one is hurt. I just wish minding one's business was actually expressed by the many who love to use it for themselves only.","commenter_a":"Obviously there are a lot of Christians or Islamists or whatever commenting on here with a ton of negativity about this. Being a Christian myself, God does not teach us to hate on people for choosing to marry the same sex. He teaches us to love others amd treat them fairly. Give your head a shake people.","post_message":"After the historic Ireland vote, here's where else gay marriage is legal."},{"comment_id":"10154567902453812","commenter_b":"Another Illegal Alien Speaks","commenter_a":"He's gonna sue again and ask for emergency federal money again!","post_message":"Texas Gov. Greg Abbott sustained \"extensive second- and third-degree burns\" on both legs and could miss next week's Republican National Convention."},{"comment_id":"10153619223127042","commenter_b":"My condolences to the family","commenter_a":"Kristopher Jadoo omg","post_message":"BREAKING: New details have emerged about an entire New Jersey family found dead at a burned home."},{"comment_id":"1704317133188732","commenter_b":"What's he going to sound like when he is eight? Just unreal! God Bless you buddy, keep it up","commenter_a":"Wow now that's something you don't ever see or hear unbelievable so beautiful never would of thought a 4 year old could sing like that.I think singing is in the future for this young child.","post_message":"Oh MY! This little guy knows his Dolly Parton."},{"comment_id":"694257180764860","commenter_b":"Oh please, these people are untouchable or she would have had in jail a long time ago.","commenter_a":"Throw her off the face of the earth along with Obama. .that would be the best thing for this country","post_message":"Insider information surfaces that will ruin Hillary's career forever. She's finished. Let's spread this. Can we get 30,000 'LIKES' to keep Hillary out of office forever?"},{"comment_id":"10154493231947235","commenter_b":"That's if she lucky..now don't get me wrong,I never hit a woman,but this bitch would've caught a 1989 Mike Tyson uppercut to da jaw at best case scenario lol","commenter_a":"Why can't I see none of these people...man I'm telling you,if that was my daughter she was talking to,her fucking head would've been in her mailbox","post_message":"What an absolutely HORRIBLE person"}]
