[{"comment_id":"1778254899059301","commenter_b":"Someone take care of Bernie so Lizzi shuts her piehole, please.","commenter_a":"Lester Holt seems to be giving Hillary longer time to speak than Donald!!","post_message":"TheDC presents the first debate between Hillary Clinton and Donald Trump. Starting at 9:00PM ET."},{"comment_id":"10152823422866636","commenter_b":"There are desperate people with no job because of (mental) illness. There are enough jobs, but a lot of people don't want them. So immigrants take them and the 'jobseekers\" can blame them.","commenter_a":"We don't ask them to come here and risk life and limb doing so. Why exactly should we have them or even want them.","post_message":"Britain does not stack up well in comparison with other EU member states..."},{"comment_id":"10153512316881130","commenter_b":"Classy old gal she is....lmao","commenter_a":"I don't know about that if your kid is old enough to eat real food with a spoon its time to take them off the tit.","post_message":"\"There's no difference in me feeding my baby with my breast than you feeding yourself with a spoon.\""},{"comment_id":"10154800990580575","commenter_b":"Lock her up.","commenter_a":"Terroristic Threat","post_message":"This Has Got To Stop..."},{"comment_id":"894090494050894","commenter_b":"This girl is a sore loser ,,, she rather have Trump as the next potus. That is scary","commenter_a":"I'm disgusted that the potential first female nominee of the Democratic Party (as Jill Stein is the first female nominee of a major political party) will have gotten there through a rigged election process, a purchased dnc, a fraudulent charitable foundation, numerous voter fraud allegations all while under investigation by the FBI. As horrific an individual as Trump is, he won the nomination far and square. He didn't cheat. The GOP didn't rigged the process for him. He appealed to the base, and won. That is the beauty and consequence of true democracy. A man like Trump deserves to win if he is honestly elected by the majority of Americans. The country will then reap what they sewed. Hillary however, through her lies, corrupt politics, money laundering through taking advantage of the horrific Supreme Court Citizens United decision, and unwavering allegiance to the banks and financial systems who almost destroyed ...","post_message":"To every little girl who dreams big: Yes, you can be anything you want—even president. Tonight is for you."},{"comment_id":"784480358346621","commenter_b":"The whores knew what they went to Mr. Cosby room for money and sex. I say they didn't get pay they got laid .","commenter_a":"My lord there is a lot of racists here!","post_message":"We can only dream! Cheney masterminded a war based on lies to funnel $37 billion in no-bid contracts to his \"former\" defense contractor company, Halliburton. When will his time be up? Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10157350648655354","commenter_b":"Even if this woman is a prostitute...does that make it OK for the \"boy's club\"?????","commenter_a":"Wasn't that long ago if a girl did this it wasn't bragged about. It was an embarrassment to herself and family. I'm not that old and I think it's disgusting, and she should be cited for it.","post_message":"+++SHOCK+++ OAKLAND POLICE SEX SCANDAL WIDENS... WATCH:"}]
