[{"comment_id":"10152577498117623","commenter_b":"Just. ..whatever you do....please don't refer to her as female,","commenter_a":"I couldn't care less who marries whom, who lives with whom, who bangs whom...my question is. .how did that goofy masochistic idiot find 4 women dumb enough to want to be involved with him.","post_message":"A big announcement for the world's highest-profile polygamist. Kody Brown, of TLC's \"Sister Wives,\" has divorced his first wife in order to marry his fourth..."},{"comment_id":"1370641286340188","commenter_b":"HE is transitioning. This FEMALE is taking a hormone that naturally occurs in both sexes bud. The hormone treatments are meant to change the development of certain features. Nails, hair, masculine chest, skin tone, fingers etc. Workout drinks for women such as, pre workout, come with testosterone for added boosts. Now, there are specific weight categories to ensure fairness. There is a woman that goes to my gym, I overheard her say she weighs 150lbs. She can bench as much as me. She can squat more than me. It's all about the work and dedication you put into your day and routine.","commenter_a":"Testosterone. Why SHE, shouldn't have been allowed to compete against boys or girls. Period.","post_message":"He didn't back down."},{"comment_id":"10155578716975354","commenter_b":"Wouldn't it be nice if if \"christians\" practiced what they preach?","commenter_a":"Good on him, but you know he's gonna die soon.","post_message":"“I think this is the first time in history a leading Middle Eastern religious leader has embraced the forms of popular culture to advance the Christian message of love and hope,” WATCH THE VIDEO"},{"comment_id":"10154358631096943","commenter_b":"Put her in jail with her boss","commenter_a":"So..yeah.. Legit question here @webpagelink/ So yeah can we?? If this were a case involving weed or oil on national historic sites or someone's private lands etc the Feds would be KNEE DEEP in it!! Or at the very least CA's electoral points be split 50/50!","post_message":"This is serious. We are investigating now."},{"comment_id":"10152962676067060","commenter_b":"ASSclown !","commenter_a":"Mitch, Moon the coon's little boy people are begging to have their streets fixed, once you remove the monuments your murder rate and black on black crime will disappear.You are a special kind of stupid","post_message":"WATCH: Mitch Landrieu's full Confederate monuments speech he delivered to the City Council today."},{"comment_id":"631016783743523","commenter_b":"Another white college educated female here!!!","commenter_a":"Donald Trump will not become president of the United States, because Americans understand that togetherness trumps divisiveness, and that love trumps hatred.","post_message":"Join me in in Philadelphia - LETS MAKE AMERICA SAFE AND GREAT AGAIN! GOD BLESS AMERICA!! -DJT"},{"comment_id":"10153650702998984","commenter_b":"The evil corrupt white witch.","commenter_a":"It's about time,","post_message":"All I can say is wow. I didn't think this was ever going to happen, but here it is. Hillary has to be terrified right about now... Are you glad the FBI is taking action against Hillary?"}]
