[{"comment_id":"10153206865573525","commenter_b":"Stfu!","commenter_a":"'Charged' a police officer with a knife ? And she is still alive ? Oh wait, she is WHITE !","post_message":"HOUSE OF KNIVES: Here's a look at what deputies confiscated from a Hernando County woman's home after she charged at an officer with a knife. Thousands of knives and other weapons, along with fake severed limbs and fake skulls. MORE: @webpagelink"},{"comment_id":"913906465331025","commenter_b":"Bernie, please keep THEIR laws off OUR bodies. #BERNIESANDERS","commenter_a":"The government only cares because it's the life of another tax payer. It's the basic human right of the individual.","post_message":"I understand that not everyone agrees on this issue but my view is that a woman has the right to make decisions regarding her own body, not the United States government."},{"comment_id":"10153629166689170","commenter_b":"I bet Herman has watched this a 1000 times","commenter_a":"You mean to say that I have to save this so I can show my lil boy when he gets older the travesty that happened and the wrongs performed by these terrible women, it won't be easy but it's for future reference , thank you Libs for bringing this horrible video to our attention or no one would have known about it hahahaha","post_message":"The left does not want you to ever watch this video because it's \"hyper-feminine\" and not diverse or something. So even though we've embedded it here, don't watch it!"},{"comment_id":"10155452479610725","commenter_b":"I would vote for you","commenter_a":"Yes Yes positive steps move forward not backwards","post_message":"For America to be strong again, the ways of politicians must be put in the past. Let’s Make America Great Again!"},{"comment_id":"674719889350666","commenter_b":"these Muslims. should. be kept out our country there Radical. persecutors. of real born am Americans. they hate us","commenter_a":"The","post_message":"Khizr Khan's speech at the Democratic National Convention has made the pocket Constitution a best seller."},{"comment_id":"934872919883382","commenter_b":"Did you listen to how Oklahoma handled the questions? She is no fake Barbie. Women can be beautiful and smart.","commenter_a":"Eeeeew, another fake blond Barbie miss USA. Miss Texas should have won .","post_message":"Wow."},{"comment_id":"10154311772481694","commenter_b":"Just when I stop thinking of him as Vern Schillinger.","commenter_a":"Geez. He must pull the plow at Farmers Insurance","post_message":"Commissioner Gordon is apparently way more into fitness than J. Jonah Jameson."}]
