[{"comment_id":"1003938939663251","commenter_b":"we didnt send anyone, go kill yor bankers they fuck up your country, wait they already fucked up i guess","commenter_a":"Next wedding come over to Greece you son of bitches to feed all the illegal migrants that you send us!!!!!!!","post_message":"This is such a great story!"},{"comment_id":"10154156972868984","commenter_b":"ONE MORE TIME TO ALL OF YOU WHO BELIEVE THAT ALL OF US ARE INNOCENT OF EVERYTHING UNTIL WE ARE CHARGED AND THEN FOUND GUILTY IN A COURT OF LAW! IF THIS WAS YOU, A FAMILY MEMBER OR A FRIEND WOULD YOU GO SCREAMING JAIL THE SOB OR BITCH? OUR JUDICIAL SYSTEM IS BASED ON \"THE wPRESUMPTION IF INNOCENCE\" THAT ASSUMPTION PROTECTS ALL OF US FROM BEING JAILED WITHOUT DUE PROCESS! A FEW OF YOU BRING UP GENERAL PETREAUS, HE WAS A GREAT GENERAL AND IS AN HONORABLE MAN BUT HE PLEAD GUILTY OF ALL CHARGES INCLUDING DIVULGING HIGHLY CLASSIFIED INFORMATION TO HIS BIOGRAPHER WHOM HE WAS ALSO HAVING AN AFFAIR WITH. HILLARY HAS DENIED ALL CHARGES, WHICH IS ALSO HER LEGAL RIGHT UNDER OUR SYSTEM OF JUSTICE, AND NOW THE DOJ IN CONCERT WITH WHATEVER THE FBI CAN DERIVE FROM THEIR INVESTIGATION MUST PROVE THAT SHE IS GUILTY IN ...","commenter_a":"Dems are majority lawyers. Lawyers believe that if lies are stated long enough, they're perceived as truth and once a statement is made, it can't be undone. You can never un-ring the bell. She will continue to lie until way after she's indicted.","post_message":"Hillary Clinton just keeps digging herself deeper with this one... Is she your absolute LAST choice for president?"},{"comment_id":"434449293346332","commenter_b":"Oh Cheryl chill out","commenter_a":"Anyone who thinks this is ok and there is at least one person here, (@username, seems to think so) is an idiot.","post_message":"When a student couldn't pay for her lunch, school officials decided to do this with the food instead."},{"comment_id":"10156346245355354","commenter_b":"She should have been body shamed. What body she has that is.","commenter_a":"How about just a useless cunt?","post_message":"READ what anti-America donut-licker Ariana Grande wrote. Genuine pain from being 'body shamed'? Or shameless PR stunt to gain sympathy?"},{"comment_id":"1588290287878104","commenter_b":"Russia is THE ENEMY because the DoD NEEDS to create a paper tiger to keep the world's most bloated military budget fat. Stay conned. Iran is also a made up enemy.","commenter_a":"We are with you President Obama, if you could have run it would have been a third majority vote and we wouldn't all be afraid of what is to come. Russia is our advisary not our friend, stupid people. Thank you for the eight years you have had to put up with the worst Congress in history.","post_message":"In addition, sanctions will be placed on Russia’s two leading intelligence services."},{"comment_id":"464836607049445","commenter_b":"She is a hoe simple as that... stop giving hoes attention ..","commenter_a":"You know, If it weren't for facebook, I wouldn't even know who these weirdos are. I am proud to say Ive never seen them anywhere else. I wont ever use brainspace on any television shows that contain such nonscense","post_message":"“I don't do drugs, I hardly drink, I've never committed a crime —and yet I'm a bad role model for being proud of my body?” Kim Kardashian West came out defending nude pictures she posted on social media."},{"comment_id":"1271975762826442","commenter_b":"You guys are so right & prosperous blacks had their own black slaves too. Our troublemaker-in-chief is keeping this going, stirring up strife so he can cry Marshal Law & keep his seat in our White House. We're in big trouble folks but most people don't even know that. Keepin' on puter & cell phone games, partying, gettin' high & working 2 jobs just to keep the bills paid. The average person has no time to protest & make trouble but we have the government paying people to not work so THEY have lots of time. It's how barry wants it to be.","commenter_a":"Loretta, Sadly, you're an intricate part of the problem. Just another old racist white person that cannot and/or will not recognize the murder of our young Black men by white racist police officers. Your kind will always find an excuse to somehow blame the victim...the evidence be Damn!","post_message":""}]
