[{"comment_id":"10153752557287093","commenter_b":"Derrick Perez","commenter_a":"You think she passed?","post_message":"OOPS ~ Police believe she was driving too fast and then hit the gas instead of the brake.... @webpagelink"},{"comment_id":"10154553975279753","commenter_b":"Aaliyah Johnson","commenter_a":"Gina Anna","post_message":"uh this is amazing Foxes & Friends"},{"comment_id":"1365633703532878","commenter_b":"@username...Such a joke!!! Hillary should just accept it...it's over...Trump won!!!","commenter_a":"“Anyone not willing to accept the results of an election is a danger to democracy.” - Hillary Clinton","post_message":"As Wisconsin prepares for a recount..."},{"comment_id":"1774855949444875","commenter_b":"Really are we surprised??? He has been committing political suicide for over a week now and handing it to Hillary with the comments about over weight women, his tax evasion, and then of all things to attack the vets???? Pitiful win if you ask me and sad that she is not winning with a landslide.","commenter_a":"Pence is going rogue! :):) He's pulling a Sarah Palin....he's running in 2020! :):):)","post_message":"A new poll in one key battleground state shows Donald J. Trump's campaign facing some trouble ..."},{"comment_id":"1414146828610887","commenter_b":"If he can't deal with everyday life maybe he should be committed to a facility that can help him. In other words he is nuts.","commenter_a":"Oh boo hoo, here is a tissue, grew up your in college time to man up","post_message":"College Kid Demands Counseling After Being 'Traumatized' By Seeing The Confederate Flag Sticker Our society is getting out of control. Do you think this is ridiculous?"},{"comment_id":"10153318242754087","commenter_b":"I'm not a gynecologist, but I know a cunt when I see one.","commenter_a":"Bernie doesn't accept SuperPAC money, yes, which is very honorable. But he still takes money from unions. Trump is the only candidate who is self-funding his campaign.","post_message":"“I’m voting for Bernie Sanders, because he doesn’t take any corporate money,” said undefeated UFC champion Ronda Rousey. “I don’t think politicians should be allowed to take money for their campaigns from outside interests.”"},{"comment_id":"952585388112135","commenter_b":"That is true @username however they will find no virgins on the other side.","commenter_a":"only way to deal with those ISIS thugs.","post_message":"“A tall bearded man emerged and drew a long knife...He began addressing the crowd and slapping the father and his son around the head and kicking them onto the floor.” That's when three shots rang out."}]
