[{"comment_id":"1096108950465633","commenter_b":"Let em go and then build a wall around it so they stay gone","commenter_a":"I say let them go. Pull all the military bases and all the government jobs and everything that belongs to the United States of America, and that includes the dollar. Then round up all of the other Racists and Dumb Shits who blame all their trouble on Obama when it was Bush and the Republican majoritys falt and send them down to the new nation of Texas where they can be happy ever after. The United States will be better for it too.","post_message":"The majority of Texas Trump supporters say they'd rather secede from the U.S. than live under Hillary Clinton as president. Do you feel the same way?"},{"comment_id":"614198468735487","commenter_b":"They died due to your lack of investigation! !!!!! Say it it was a terror attack. We MUST STOP THE MUSLIMS COMING IN.","commenter_a":"So sad","post_message":"FBI – Federal Bureau of Investigation Director Comey and Deputy Attorney General Yates brief on the latest in the Orlando shooting investigation. @webpagelink"},{"comment_id":"922572661194216","commenter_b":"Yep, she's illegal.","commenter_a":"Karma people, Karma! What you put out towards an innocent child will come back to you and it's well deserved.","post_message":"Ivanka Trump announced the arrival of Theodore James Kushner on Twitter."},{"comment_id":"10153780150441509","commenter_b":"That's nasty","commenter_a":"Shave your freakin pits.","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"},{"comment_id":"10154408526388352","commenter_b":"Boobs are for food NOT fun!!!","commenter_a":"Well that was mean","post_message":"'Step outside and button up': Judge blasts mother and kicks her out of courtroom for breastfeeding her eight-month-old son during custody hearing"},{"comment_id":"1169592283127367","commenter_b":"She wears a 12.700.00 oven mitt! And Bulaps sacks look good on her too!! #TRUMP2016","commenter_a":"Ever notice how the Sign for Trump and Pence sound like Trumpets? Could be echoing the arrival of the Four Horsemen.","post_message":"Donald J. Trump, Sen. Joni Ernst, and others campaign in Iowa at the Iowa senator's second annual Roast and Ride."},{"comment_id":"1136778326378278","commenter_b":"Mizo I am not shia. But i am sure shia love this place aswell I can never imagine they can do this cowardly act it is time to hug each other regardless of there beleive let Allah to decide and guide us all the ryt path. I am in the favor of a united muslims across the world regardless of there beleive. Muslims getting butchered across the world. Innocent children women are getting bombed every single day. For God sake be united. May Allah protect all the muslims across the world.","commenter_a":"inshallah everything would be alright because the Angels of Allah look after our prophet house so I have suggest to King of Saudi to whip Shia from Saudi Arabia to somewhere else","post_message":"It exploded near the Prophet's Mosque, one of Islam's holiest sites. Update at 23:00 BST: Interior ministry has confirmed four security officers have been killed and five others injured."}]
