[{"comment_id":"10155769419940231","commenter_b":"My thought is this Ladies; the occurrences, that we are know seeing unfold are strategic! I hope that you will agree that the system has removed a majority of our \"Black\" men who would physically engage in battle with the injustices. They are being removed from society and that weakens us as a people. They are imprisoned for a greater length of time, killed in unlawful ways right in our faces (bullets in the back, strangled and held by more than one, ect...). A great majority of our women are now out and about alone and really can not defend themselves physically against the powers that be! In addition I see more \"Black\" women, more than ever going to be the next victims of murder. This leaves our children more venerable than ever before!","commenter_a":"It would of not been like that if a man was in the car with her!","post_message":"It may not be in the way that she thought she would, but she has, indeed, changed history."},{"comment_id":"10153952652862293","commenter_b":"I guess you are happy with the Clinton globalist international crime family in the White House (along with the money laundering Clinton Foundation). She will continue to ship your jobs overseas (she supports NAFTA and the TPP), promote open borders that bring in criminals and support unlimited immigration of Muslims bringing Sharia Law and terrorism. Maybe you could then move to a \"no go zone.\" Ask Europeans (and the people in Dearborn, Michigan) how that is working for them?","commenter_a":"How is it not completely obvious to anyone with two eyes that this family is a bunch of con artists? Literally nothing they say is true. And half the country wants to give the most important job on the planet to this guy? Amazing.","post_message":"Eric Trump said he could not name a single instance when his father had given such a gift."},{"comment_id":"492601187597128","commenter_b":"Again radicalism get rid of these people and do not give in to thier demands","commenter_a":"Wasn't bacon on the menu when he started working there???? And KFC just suspends him????? I think we've found a new weapon......pork bombs!!","post_message":"Muslim worker threatens this customer, but he stands his ground. Good. He didn't do anything wrong, we support this American customer. Do you agree this Muslim worker should be deported?"},{"comment_id":"10153260713478690","commenter_b":"Scrw U, Scrw Saddam, and Scrw Isis... Saddam killed 300,000 innocent kurdish moslems most of them by mass graving and gassing them, u pathetic peace of scm.","commenter_a":"Sadam was much better than ISIS...","post_message":"The statement said that a lorry loaded with around 20 gas canisters exploded on a highway between the Iraqi city of Mosul and Syria, as Kurdish fighters were being deployed following an offensive against ISIL fighters. @webpagelink"},{"comment_id":"10152884720337217","commenter_b":"Humans suck 😕","commenter_a":"Man. The death of all animals, plants, and everything else. I swear. Smdh.","post_message":"The tiger that mauled a man to death after escaping from a flooded zoo in Georgia has been shot dead. (Footage from Georgia Ministry of Internal Affairs)"},{"comment_id":"10152628736511367","commenter_b":"so leave, gentle lady","commenter_a":"You are not a fair news outfit or discussion platform! You leftist asskisser mother @##$%^^%%^s.","post_message":"\"The only thing we have to fear is ... \" @webpagelink"},{"comment_id":"588380568016902","commenter_b":"NO, they just want to shove another \"change\" down our throats!!! I am so sick of this. We don't have the money to make such a change. If anything put her on something else but DO NOT MAKE CHANGES!!!!! Do you Dems think money grows on trees?? I am not paying for nor will I ever use a $20.00 again if this is done!!!","commenter_a":"So who made this decision?","post_message":"OH HAPPY DAY!"}]
