[{"comment_id":"10152572021501680","commenter_b":"Jew haters","commenter_a":"This is not the United States of Israel.","post_message":"Israeli officials rushed to meetings on Capitol Hill, trying to calm a furor created by Benjamin Netanyahu’s planned speech. It didn’t work. @webpagelink"},{"comment_id":"10153031617927217","commenter_b":"Nope, women can't","commenter_a":"Can they pee standing up?","post_message":"While the two women will graduate this week, they will not serve in the US Army's 75th Ranger Regiment. The US military has yet to lift a ban on women serving in the fighting force."},{"comment_id":"10153726432609087","commenter_b":"I'll buy her plane ticket","commenter_a":"Bye","post_message":"“I know a lot of people have been threatening to do this, but I really will,” Lena Dunham said about moving to Canada if Donald Trump is elected president."},{"comment_id":"10154208001624497","commenter_b":"an improper whore","commenter_a":"I'd recommend an 8 ball of crack and a proper whore","post_message":"\"Every reasonable alternative has been examined and exhausted; every rational avenue, from acupuncture to chocolate, explored to no avail.\""},{"comment_id":"1040961739305022","commenter_b":"Thats right. He you dont like it then get the hell out of MY COUNTRY","commenter_a":"I do want my country back...America...the land of the free from sea to shining sea, from mountain to desert...I want it all back, all the beauty and peace and sweat and hard work that we Americans have given this land...I want it back...my America...not some version that obammer thinks it is...not his America...my America..and if that offends anyone, that is just too damn bad.","post_message":"Americas Freedom Fighters"},{"comment_id":"10156663817835294","commenter_b":"That nasty women needs mandatory life in prison. Piece of garbage","commenter_a":"She didn't give the baby up! She left it in the toilet to die. That's not surrendering that poor baby.","post_message":"The police are releasing the photo and the video to bring awareness to California’s safe surrender law, which allows any newborn under 72 hours old to be surrendered without criminal charges."},{"comment_id":"10153877660438812","commenter_b":"Wow, you're just full of fear. They're just people that want to use the bathroom. Get over yourself. No one wants to look at you or your ugly daughter anyway","commenter_a":"This just in! All teenage boys are claiming to be trans to gain access to girls' locker rooms.","post_message":"The DOE says an Illinois school district is violating the rights of a trans student by denying her access to the girls' locker room."}]
