[{"comment_id":"678568942333684","commenter_b":"Muslims do like goats.","commenter_a":"Surely the king has more class than to let Hillary sit on his face !","post_message":"Hillary Clinton was just caught doing absolutely sickening with the Saudi King. She is not to be trusted. This is filthy. Do you think Hillary Clinton would make a terrible president?"},{"comment_id":"1121854401168903","commenter_b":"Stfu fat bitch","commenter_a":"Is it because they're assholes?","post_message":"They spend their lives eating rotten meat - so why don't they get sick?"},{"comment_id":"1188867387819383","commenter_b":"how about just stopping illegal immigration which brought it here in the first place","commenter_a":"Running a high powered fan inside, facing your entry door might help as you come in and out and might help them from entering your home and any that might be clinging to you!","post_message":"ZIKA is FOR REAL and it hits more than just PREGNANT LADIES @webpagelink"},{"comment_id":"1444717595538546","commenter_b":"It not over until it get to the highest court! Just hope we don't allow this time to allow the bad guys get something in the USA! It will not be the rights fault! But as always the left will blame the right, anyway! :(","commenter_a":"This is why America is in this shape, getting a president that would actually work toward putting Americans first is/will be thwarted at every turn.....","post_message":"Appeals court denies DOJ's request to reinstate travel ban"},{"comment_id":"10153983597909726","commenter_b":"ugliest face on the planet,put the bitch in shackles","commenter_a":"It puts them under oath and on the record and if any take the 5th it'll hurt Hillary even more, especially with Independents and Undecideds.","post_message":"Hillary Clinton's aides will be questioned on emails by the U.S. State Department. Will this make any difference?"},{"comment_id":"1079856352035375","commenter_b":"Wow","commenter_a":"White and gold","post_message":"o.O"},{"comment_id":"10154958123446037","commenter_b":"Go away troll 🤣🤣🤣🤣🤣","commenter_a":"Why should the taxes I pay be used to pay for security for a billionaire that pays no taxes?","post_message":"“New York City taxpayers should not be on the hook for 80 percent of the national bill to protect [Donald J. Trump] and his family’s residence.\""}]
