[{"comment_id":"10153674546377293","commenter_b":"Belief structure is the exact same thing. Splitting hairs to rationalize your views.","commenter_a":"They got a point. It's not a religion by definition, but it's a belief system. Praying affects the individual doing it; only those offended are the people that can't stand the sight of it. They hate, if you will. Equality means just that, though. Can't restrict one group only.","post_message":"“This is very scary,\" a parent wrote."},{"comment_id":"10153174947101545","commenter_b":"So what's your excuse then casey?! Bahahaha!!! Mama was drinking when she was pregnant with you?!","commenter_a":"Now she and her followers will claim that she was jailed for being a christian, as opposed to a bigot hiding behind Christianity.","post_message":"A Kentucky county clerk was found in contempt of court Thursday for her refusal to issue marriage licenses in wake of the Supreme Court decision to allow gays to wed."},{"comment_id":"1240086616006505","commenter_b":"Animals r strange voters... They will vote with the Jews.","commenter_a":"Who? Never heard of him.","post_message":"And then he said where he promises to MOVE if Trump DOES win..."},{"comment_id":"10153590178129497","commenter_b":"You sons of bitches !","commenter_a":"Fearless!","post_message":"Via ClickHole:"},{"comment_id":"10152813780680950","commenter_b":"Kill the devil baby it comes from a rapist. The seed of evil grows within her.","commenter_a":"EVERYONE SHOULD REMEMBER U WERE ALL A FETUS AT ONE POINT TOO, MAYBE SOMEONE DEBATED ABORTIONING U WHEN THEY WERE PREGNANT, BUY UR HERE!!! I BET ALL U PEOPLE ARE AGAINST THE DEATH PENALTY TOO.....DAMN HYPOCRITS DONT WANT TO KILL AN ADULT BUT U WANT TO KILL A BABY!?!?!?!?","post_message":"In Paraguay, abortions are banned in all cases — even rape — except when the mother's life is in danger."},{"comment_id":"10153618573248984","commenter_b":"@username ANOTHER IDIOT FOLLOWER","commenter_a":"ANYONE WHO SUPPORTS HIM IS A ASSHOLE","post_message":"Trump is tearing it up! This is sure to make his haters absolutely livid. Do you support Donald Trump?"},{"comment_id":"1220141934692263","commenter_b":"Most hard working Latino's are no different than any other American that love their country. They want good jobs and a dependable future that illegals won't take their jobs. If they vote for Hillary they know their jobs will be gone. Either by illegal immigration, Middle East immigration or bad trade agreements that will move their jobs overseas. @webpagelink","commenter_a":"Love it.. No only I don't want him for my daughter I don't want him for my sons Trump is bully bully should never be rewarded.. I'm voting blue don't matter who, because Red is to dangerous to give my vote too","post_message":"According to Hillary Clinton's team, the intention of the ad is to show the effect Donald J. Trump's \"hateful rhetoric towards women is having on our daughters.\""}]
