[{"comment_id":"10153117633836051","commenter_b":"I think Cindy is jealous cuz her double wide doesn't have a closet! And Barbara, don't join the dumbass train, I clearly cannot teach this old dog new tricks, but if she has the right to call people queer then I have the right to call her stuff, correct?","commenter_a":"Shame on the Queers.","post_message":"A CNN host went on a lengthy rant about spotting an ISIS flag at a gay pride event this weekend. There's just one problem."},{"comment_id":"10155226667000579","commenter_b":"Then you better understand that and take help from the one aligned closest to you which includes conservatives of all races.","commenter_a":"White males are the least served segment in British education.","post_message":"British Prime Minister Theresa May: \"I am pleased that I am able to meet President Trump so early in his administration.That is a sign of the strength of the special relationship between the United Kingdom and the United States of America.\" Full video of Primer Minister's Questions here: @webpagelink"},{"comment_id":"1807404516198292","commenter_b":"STOP THIS CRAP!","commenter_a":"Bs","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"949029821890932","commenter_b":"@username Before you vote for Clinton remember this. a vote for her is vote for a another kilo of heroin across an open border polluting Americans and contributing to more crime.","commenter_a":"If you are privileged enough so that a Trump presidency doesn't matter to you, vote against him for the many people he will take advantage of if he wins.","post_message":"Most Americans, regardless of their political views, do not want to see us go backwards, and are not going to be supporting a candidate for president who has made bigotry the cornerstone of his campaign."},{"comment_id":"507182816138965","commenter_b":"ATTN clueless bitch.....shove it!","commenter_a":"ATTN: ATHEISTS: Get a head start and go straight to hell which is where you will end.. Satan is waiting for you....","post_message":"Christian principle under heavy fire from atheists after he did this. He's in serious trouble. Let's show him our support. Do you support this Christian principle?"},{"comment_id":"1506151063011899","commenter_b":"REAL AMERICANS guns will only be taken over their dead bodies.","commenter_a":"Let's see, how many honest, law abiding gun owners, did not commit a crime with a gun, yesterday. Or ever, for that matter. If the government takes your guns, the next thing that they will take, is you.","post_message":"Exploiting tragedy while surrounded by ARMED guards. Hypocrisy much, Obama?"},{"comment_id":"10153312130831051","commenter_b":"its a MUTE SUBJECT!!! THERES NOT ONE RUNNING FOR PRESIDENT ... AMERICANS ARE SICK OF THIS CRAP !!!!!!!!!!!","commenter_a":"I would beleive Mr Carson anyday over Obama or any of his men......","post_message":"The Obama administration just slammed Ben Carson for saying America shouldn’t elect a Muslim president. Who do you think is right here: Carson or the Obama administration?"}]
