[{"comment_id":"813461822117937","commenter_b":"Dream on billary Jr.","commenter_a":"Donald Trump for president thank you Jesus 2016","post_message":"Chelsea Clinton: Scalia’s Out of the Way, so now we can gut the Second Amendment @webpagelink"},{"comment_id":"1132428533502348","commenter_b":"I think they should be deported back to Mexico. There here because Obama wants more democratic votes. He is now trying to give them rights to vote. A lot of Hispanic legals who work hard are against them.","commenter_a":"This should anger all Americans!! BUILD THAT WALL TRUMP!!!!","post_message":"This firefighter and 2 kids were just killed... if that weren't infuriating enough, wait til you see WHO murdered them. This is EXACTLY what Donald J. Trump has been talking about..."},{"comment_id":"10154739009466337","commenter_b":"I say extract the bitch the bitch that's in you that complains about characters of fiction switching ethnicities","commenter_a":"I say cast a white dude. Because it's cool to switch race's of established characters now right?","post_message":"BLADE'S RETURN? Marvel hopes so..."},{"comment_id":"941252249248581","commenter_b":"Oh Bill, you handsome devil...lol, NOT!!!","commenter_a":"It couldn't happen to a more deserving bunch of lying propagandists Hell Bent on fomenting Hate, Racial War & Spewing Male Bovine Feces.","post_message":"Fox News has enlisted two of their biggest twits to play the victim card and accuse Dish Network of censorship as the battle between the two rages on for a fourth straight week."},{"comment_id":"404872436304464","commenter_b":"Pieces of shit like her need to be culled, slowly an painfully.","commenter_a":"Now I've heard everything. Hurry up with the \"Big Payday,\" Lord.","post_message":"A woman and her cop husband were at a bar for a drink before she got on the road and ran over three teenagers riding their bikes. Now she is suing the boy's family for the \"trauma\" she was put through by hitting and killing one boy and permanently injuring two others."},{"comment_id":"10153209724819575","commenter_b":"You guys do understand that chickenpox is much worse and more dangerous to adults than children, right? And what about those babies who are too young to be immunized? The point is to vaccinate your children so that diseases like \"only chickenpox\" can be eradicated!","commenter_a":"OH MY GOD ITS THE END OF THE WORLD! Fear porn at it's finest.","post_message":"Carmel Clay Schools sent a letter to parents explaining that cases of chickenpox had been confirmed. The school system has not revealed the amount of confirmed cases."},{"comment_id":"10153351201607439","commenter_b":"We the People have our lives going and We the People aren't the ones waging war on other countries. It's the government. They want to go to other countries and spend trillions of our tax dollars on them and try to get those mid east countries to be more civilized. Well, you can't teach a baboon how to talk and you surely can't teach these primitive thinking tribes to be civil. So the only thing they know is to try to rule the world and get the whole world to be on their level. As for that Boston Bomber mother.....your fu*kface son will burn in hell way before your 'people' get a chance to try to burn America down! And you'll be under ground too and will never see America burn. America's too strong of a Nation for that. Even with this Muslim president.","commenter_a":"Hey, your religion aint working.","post_message":"@webpagelink"}]
