[{"comment_id":"965007433534716","commenter_b":"2 pussy's","commenter_a":"Freya Mistry Rayan Mistry","post_message":"Donald Trump and Jeb Bush are fighting over who is tougher. What do you think?"},{"comment_id":"685959174927994","commenter_b":"No!!! Piss off bitch!!!","commenter_a":"Absolutely not , you moved to America to benefit from American ways of life and you're participating in the American justice system , and you expect to be changed just for you . I don't think so . You shouldn't even be allowed into the court house let alone the court room for reasons of security .","post_message":"This judge just made a controversial decision... Great. We support this judge 100%. Should this woman be allowed to swear on the Quran?"},{"comment_id":"893629520678836","commenter_b":"Hi, what do you mean their own kind?","commenter_a":"Why are they attacking their own kind?!","post_message":"At least 37 people have been killed during a #Saudi airstrike on a dairy plant in western #Yemen."},{"comment_id":"10153533383913145","commenter_b":"Ur an idiot. I blame your parents for that!","commenter_a":"I blame Obama for this guy.","post_message":"A Kissimmee doctor accused of sexually battering a patient could reopen his practice today. If he does so, it will be with some restrictions. A live report coming up at 7 a.m. on Eyewitness News This Morning on TV27 WRDQ."},{"comment_id":"10153348375511756","commenter_b":"Women are just as capable of destroying the infrastructure of poorer countries leading to the suffering and death of millions of innocent people as men are.","commenter_a":"No women on front line.","post_message":"Cpl. Jasmine Abrego is just 5 feet 1 inches tall. She left her job as a Marine clerical worker to train for the infantry and, as she puts it, \"kick bad guys' butts.\" \"Mentally it's just being strong, you just get stronger,\" she says. \"You just push yourself through it, that's what I've been doing.\""},{"comment_id":"10154393915434170","commenter_b":"They will find other ways !","commenter_a":"Guess the \"New World Order\" has been reordered....all the elites that envisioned a single Global Society can pretty much shove that right where it belongs!! :)","post_message":"The elites are having a meltdown, but the people of Britain have spoken. We've got the reaction from Donald J. Trump as well."},{"comment_id":"1766049700310185","commenter_b":"She better look deeply into Muslim beliefs and get used to sexual assaults because these heathens think it's their right","commenter_a":"The White House is warning Trump not to retaliate against her. Is that a red line? They going to write a mean letter to him if he does?","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."}]
