[{"comment_id":"1628546037432509","commenter_b":"Go get those evil men!","commenter_a":"Exactly... Agree with you @username!!","post_message":"WHOA! This weapon is like something out of the Iron Man movie..."},{"comment_id":"602611366596109","commenter_b":"She needs to shave her pits.....ugh, she's so nasty!!!","commenter_a":"remember...she is a singer, she is a singer, she is a singer,.....","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'. This is unacceptable, we stand against Miley 100%. Do you agree Miley should be kicked out of the country?"},{"comment_id":"947714872011958","commenter_b":"Thereeeesss Billl---","commenter_a":"This is just an endorsement for trump.. it has nothing to do with Cruz.. Why is it that everything to do with t rump is exaggerated , or just outright lies ? Every time he opens his mouth the stooges have to run around for three days explaining \"what he meant to say\"? he didn't mean women should be jailed for abortions, he meant they should be celebrated.. he didn't mean mexicans were rapists he was talking about \"the bad ones\".. he didn't mean single payer health care he meant government paid health care.. he didn't mean to call Carson a child molester he equivocated that he was LIKE a child molester.. He didn't mean to hire all those immigrants for his hotel, he meant to say Americans are lazy and won't take the low paying jobs.. He didn't mean to imply that his wife is just a \"piece of ...","post_message":"Ted Cruz is having a hard time with Latinos for one EPIC reason. When I heard it, I couldn't stop cheering! All aboard the Donald J. Trump train! Do you think Ted is finished?"},{"comment_id":"10154529100646323","commenter_b":"@username..tanks, anti-missile system or cannons are completely useless in civil war in a country where anybody and everybody can have a gun. And when government doesn't know who has it. There's a reason America in a last century (and before) was the safest place to live in the world. Totaling all the murders in 20th century USA is 10-20 times safer than S. America, Africa, Europe or Asia. Thanks to 2nd Amendment in our Constitution.","commenter_a":"It is odd how right-wing custodians of patriotism have a problem with Kapernick regarding the anthem but hardly emit a peep when scores of people are killed by lunatics with guns who take advantage of that great piece of antediluvian legislation otherwise known as the Second Amendment.","post_message":"\"Declining to stand and laud that country until these outrageous, deadly imbalances are repaired – until our flag actually does represent everyone – is perfectly reasonable. America gets my unreserved, hand-on-heart patriotism when it earns it.\""},{"comment_id":"10153086762191438","commenter_b":"Besides there no such thing as a attractive Democrat woman!","commenter_a":"Boils down to primal fear in Liberals, Hillary is toast and Warren is way to Marxist except for the hard Left....and Liberalism doesn't sale to Americans....Cruz has a great message and the Left knows it...see the exact same responses on other Leftists sites...you can smell the wet panties and fear....","post_message":"Ted Cruz has no chance of becoming president."},{"comment_id":"1005938356108252","commenter_b":"She looks like a evil witch","commenter_a":"She is \"special\" she doesn't not have to follow the law.","post_message":"GO TO PRISON!"},{"comment_id":"1458627227490636","commenter_b":"We refused to take Germanies Immigrants & the Nazi's killed 6 Million! Racist, Bigots still lurk in all corners of OUR Country!","commenter_a":"^5","post_message":"State Department figures show that 2,340 Syrian refugees arrived last month in the United States."}]
