[{"comment_id":"10153536148652426","commenter_b":"That's sad! Lawyers can find many ways of getting people out of trouble. Bet the girl didn't show remorse or learn an important lesson.","commenter_a":"Ok, fine people for smoking around children. Then let's raise the fines for texting and driving and add fines for talking and driving. These fines can be used to further aid in our children's education. But most important-people can use their lessons they learned in driver's ed such as using a turn signal and stopping at a stop sign.","post_message":"Should smokers be fined for smoking in cars with kids? A - Yes B - No"},{"comment_id":"1121161091293379","commenter_b":"I thought she was 100","commenter_a":"Nick Foley @username @username bruh.. lol this is about to be mom","post_message":"A man named Sidomejo from Indonesia has documents that claim he was born in 1870 – which may mean he is 146 years old."},{"comment_id":"1304540879566920","commenter_b":"If Gwyneth puts it in Goop, it's not a feminist thing, lol","commenter_a":"This is a feminist thing, eh?","post_message":"Don't put herbs in your vagina, for goodness sake. Your womb doesn't need a freaking detox."},{"comment_id":"1135459499799639","commenter_b":"END THIS EVIL INBRED FERAL ISLAMIST BARBARIAN DEATH CULT NOW, WHEREVER IT EXISTS!!","commenter_a":"Vote Trump and we won't have this problem.","post_message":" correctness is putting America in danger and it's time to take action and protect our country!"},{"comment_id":"10153639382745950","commenter_b":"Clever ladies..some of those pre rape drugs put you out for life.","commenter_a":"Good job ladies, we gotta stick together as women or we'll all parish to the hands of the evil ones. May GOD bless them all","post_message":"It doesn't matter if you're a friend or a stranger. When these 3 women noticed a man allegedly slip something into his date's drink, they couldn't just sit there and watch it happen."},{"comment_id":"10154363624237501","commenter_b":"This is getting Old. What will she want next a Movie? This lady is a $$$$ hungry Biotch","commenter_a":"Why oh why do you continue to post this?","post_message":"As testimony comes in and new evidence is provided, has your opinion about the shooting changed over time?"},{"comment_id":"587167334791713","commenter_b":"Stand with her point of view, and share her perceptions with your friends! @webpagelink","commenter_a":"I am with hillary","post_message":"One candidate delivers catchy lines—the other delivers results. Add your name to say you're with Hillary. #DemDebate"}]
