[{"comment_id":"499057813618132","commenter_b":"just a rich, fat, black bitch","commenter_a":"Sick idiot","post_message":"Oprah is going after white people on live television. The hypocrisy is overwhelming. We need to show her we're not going to stand for this. Do you agree Oprah is a racist?"},{"comment_id":"931007510269923","commenter_b":"You Don't Hit a Woman,You Turn and Walk Away !!","commenter_a":"Will someone please beat this woman beater up and take away his nfl career.","post_message":"Florida State University quarterback De’Andre Johnson is charged with misdemeanor battery."},{"comment_id":"1019570198153414","commenter_b":"She's a Witch!","commenter_a":"@username is showing us what a doucebag he really is. Desperate for people to believe such utter non-sense. Common Sean, the real hurricane is YOU for posting this as you are so full of hot air. lol The truth is \"The Ads were pulled when the news of the hurricane was brought to life not the other way around\" Trying to politicize an unfortunate event is plain evil and you posting this stuff to draw attention in the wrong way is absolutely @username like.. SAD Americans being fool by you.","post_message":"Absolute ghouls."},{"comment_id":"10152961665786336","commenter_b":"Why would any of you morons disagree with Dr. Carson? As long as kids get vaccinated and as long as adults have already been vaccinated this Country can be protected from these diseases. Time for Obama to guarantee that anyone illegal immigrant be vaccinated...","commenter_a":"Just another reason why we need to CLOSE the borders, ENFORCE the laws already on the books and DEPORT all illegals. That means, NO AMNESTY for anyone.","post_message":"Fox News Sunday EXCLUSIVE: Dr. Ben Carson joins Chris Wallace with his stance on the vaccine debate and his plans for 2016. Check your local listings or tune in to Fox News Channel at 2p and 6p ET."},{"comment_id":"10154036323171337","commenter_b":"Rat face versus Moron","commenter_a":"Fuck Kanye. He's the biggest skank that ever was.","post_message":"WHOA! Did Taylor Swift just drop a whole lot of shade on Kanye West??"},{"comment_id":"435485493243158","commenter_b":"Criminals don't get one...why require them for law abiding citizens","commenter_a":"i cannot believe how brainwashed and idiotic everyone is, you actually believe concealing more weapons, allowing no permits and actually believing it is the right thing to do because its in your constitution is fucking ridiculous, lets see how many more kids are massacred in schools now that shooters can conceal their weapons","post_message":"Good idea?"},{"comment_id":"1661665617421412","commenter_b":"Ignorant dick shouldn't of been running his mouth and chest bumping him. No pity","commenter_a":"Why was the reporter saying \"F you\" to the agent? Why did the agent feel such a response was needed? Enjoy the circus.","post_message":"A photographer was choked and slammed to the ground by a Secret Service agent during a Donald Trump rally in Virginia today. @webpagelink"}]
