[{"comment_id":"10153018871246130","commenter_b":"Lesbian porn is boring. Girls that don't have the slightest clue as to how to thrust their hips.","commenter_a":"Men say \"fucking disgusting\" then get their morning jerk off to lesbian porn.","post_message":"How adorable is this?"},{"comment_id":"10153577937396162","commenter_b":"I have always said, the best person to fix a budget problem is a single hard working mama! That woman knows how to stretch every last penny to make it count! If you don't need it and don't have the money for it...you DON'T buy it!","commenter_a":"This is why Illinois has a money problem! Corruption and greedy politicians!","post_message":"BREAKING: Former Governor Rod Blagojevich's sentence has been thrown out and he has been awarded a retrial on 5 counts... @webpagelink For the stories you care about - \"Like\" ABC 7 Chicago!"},{"comment_id":"1752390171683339","commenter_b":"Well if you like being killed because your a woman so be it but not here in the US stay in your own free country an kill all you want just not here","commenter_a":"She has to be in the running for the Idiot of The Year Award, she has my vote.","post_message":"You have got to be kidding me. Get this liberal trash off the air. Do you think this is racist and ignorant?"},{"comment_id":"10153384836141756","commenter_b":"And they're thin from getting anal leakage from eating all that spam!","commenter_a":"And they are still thinner!","post_message":"South Koreans eat three times as much Spam per capita as Americans. Customers buy it in bulk packages and as fancy holiday gift boxes. \"It's a luxury that really has kind of cemented itself in Korean society,\" says the president of a food tour company in Seoul."},{"comment_id":"1407030135990971","commenter_b":"pugsky er uhyggelig","commenter_a":"@username Jeg ønsker mig en bullpug!","post_message":"Lots of adorable, slightly sad faces."},{"comment_id":"10152609366937093","commenter_b":"Stfuh","commenter_a":"What a disrespectful jerk! You're lucky Saul that she didn't arrest you right there on live TV. You don't put your hands on an officer PERIOD!","post_message":"RAW & UNCUT: A sheriff's deputy didn't like where FOX 4 News reporter Saul Garza was standing during his live shot this AM.... then this happened.... @webpagelink"},{"comment_id":"769219589888459","commenter_b":"i have been there over and over the last time a mexican woman tried to give my mother her baby beged my mother to take the child this is a fact and sad but if mexico is so great then way are so many comming to America","commenter_a":"Who would want to move to Mexico? In dire stress, a person could find better options than that Anti American, drug cartel controlled country. Funny how they are so anti American, but so many scramble to get here huh? The citizens of Mexico don't even want to live there, and I can't say I blame them.","post_message":"Americas Freedom Fighters"}]
