[{"comment_id":"710336325799525","commenter_b":"U R A STUPID BITCH !!","commenter_a":"Yes she is a well educated lady. She puts family first and shows alot of class. She was a model you don't hear people caalling actresses names for their jobs. She also is a women who knows how to work hard , she understands the immigration system. She also understands the average needs of the normal everyday person.","post_message":"Will Melania Trump make a good First Lady?"},{"comment_id":"10153255897157894","commenter_b":"She has a problem period","commenter_a":"Somebody has a problem with authority","post_message":"Azealia Banks Under Investigation for Allegedly Beating Up a Security Guard [Video]"},{"comment_id":"10152880338496636","commenter_b":"Says the white woman...","commenter_a":"Personally I think if the tribes want it built, the tribes should pay for it. It doesn't bother me one bit sitting unfinished and there are so many other things the state could spend the money on. How about paying our teachers a decent wage.","post_message":"You probably driven by this empty building. It had thousands of dollars poured into it, but it still sits as an empty shell. Thanks to a bill Gov. Mary Fallin signed, that may be changing soon."},{"comment_id":"10155216029445500","commenter_b":"Coyotes are indigenous to our state all states. They were driven put west because of our industrialization. Now they have learned how to co- exist with man and have migrated to the east again. Warning - maybe coyotes will make owners stop using this awful leashes the retract and maybe we as a society will begin to respect all animals better . Coyotes are as afraid of is as we are of them bit put a tractable leash on a small dig ad watch an eagle , hawk or coyote take it. Adjust your human responses and behav avoid","commenter_a":"The.coyotes have a human problem. Keep your pets inside. We were the ones who came and stole the land they called home. You have to attempt to keep in mind they are there and adjust a little","post_message":"HEADS UP: Pasco residents say coyotes wandering the streets have been killing their pets. It's almost \"pup\" season, so they travel and hunt more. Here's what you should do if you see a coyote: @webpagelink"},{"comment_id":"557077507818161","commenter_b":"Take her ass down","commenter_a":"We owe Nixon an apology. Watergate was nothing compared to this.","post_message":"BREAKING..."},{"comment_id":"10153761694679705","commenter_b":"well lets say i know more","commenter_a":"did ya know they have votes to local reps to say the same as the usa does not likely","post_message":"Direct mail service was cut in 1963 at the height of Cold War tensions."},{"comment_id":"1134554249934436","commenter_b":"Lol. She is a democrat. I hope you never wander into a voting booth","commenter_a":"We must stop the democrats and Hillarys war on women and the unborn!","post_message":"Every dollar goes toward making sure Donald J. Trump never becomes president."}]
