[{"comment_id":"544768002395182","commenter_b":"No election has ever seen such sore losers! And they were accusing Trump of this type of behavior if he lost.","commenter_a":"what a jerk and pathetic American---","post_message":"He's crossed a line."},{"comment_id":"714166885416447","commenter_b":"Most evil woman on the planet","commenter_a":"Only Crooked Hillary -she has to be the worst possessed women in the world of power and money -remember when they left the White House they were broke -now worth 250 Million-go figure","post_message":"A troubling taste of how the Clinton machine operates..."},{"comment_id":"10153619254387439","commenter_b":"You stupid son of a bitch. She will never do a day in jail. Dream on asshole.","commenter_a":"FBI didn't seize a fucking thing, they were voluntarily turned over to the FBI and justice department. Geller is a rotten crotched liar.","post_message":"// google_ad_client = \"ca-pub-@username\"; google_ad_slot = \"@username\"; google_ad_width = 336; google_ad_height = 280; // ]]> // // ]]> Hillary is such a tool for jihad and a knave to her lover pal Huma Abedin, I don t care how this destroyer gets her comeuppance, as long as she does. Like Capone and tax evasion charges. It was hardly the worst of what he did, but it got him put away. She should be sitting in prison for Benghazi, but if this is the best we can do, so be it. Although I hardly trust the DoJ. WASHINGTON As pressure builds on Hillary Clinton to explain her official use of personal email while serving as secretary of state, she faced new complications Tuesday. It was disclosed her top aides are being drawn into a burgeoning federal inquiry and that two emails on her private account have been classified as “Top Secret.” ..."},{"comment_id":"10153992942406316","commenter_b":"what is the life span of a fruit fly??","commenter_a":"Wayna Biggs","post_message":"Truvia sweetener a powerful pesticide, kills fruit flies in less than a week..."},{"comment_id":"1281193278643588","commenter_b":"THAT is what Hillary said she is going to do. People out there are saying she wants to abolish the 2nd amendment...which couldn't be done by anybody.","commenter_a":"Gun Control? How about enforcing the current laws. Statistically less than 25% of the current federal firearms laws & regulations are enforced. If all of them were enforced gun violence would be almost nonexistent.","post_message":"Summer vacation is over, and it's time for Congress to get to work."},{"comment_id":"582726195242593","commenter_b":"Omg seems that all woman are becoming liars now ^ smh^ unbelievable","commenter_a":"There are two women Trump doesn't want to tangle with. Elizabeth Warren has forgotten more about economics than he ever knew. And Hillary's foreign policy knowledge is something he will never acquire. She will decimate him in a debate because he will have to be ready to speak on issues, not just make personal attacks. He is so thin skinned that he will self destruct as soon as she holds his feet to the fire. He and his followers don't have a clue. They have demonstrated time and again that when all else fails, thuggery rules. That doesn't win elections once reasonable people make up their minds not to put up with it any more. Now I just hope that reasonable people do that sooner than later. Put him out of his misery as quickly as possible.","post_message":"He's got a problem."},{"comment_id":"10157662056330405","commenter_b":"Kasich is a sore loser..used to like him but after he lost the race for president he has gotten to be a sour sore loser..","commenter_a":"Good job, Governor! Wish there were more like you that agree to support what the PEOPLE want! My governor, Kasich, wrote in 80 year old John McCain for a president, wth! He's a disgrace!!!","post_message":"Great to rally a huge crowd in Eau Claire for Donald Trump, Mike Pence, Ron Johnson, and the entire Republican ticket."}]
