[{"comment_id":"10153985778706955","commenter_b":"@username Cruz will never get my vote ever. So?","commenter_a":"I will never support Ted Cruz, never! #NeverCruz","post_message":"Cruz Still Faces Daunting Math After Win in Wisconsin..."},{"comment_id":"1681608915392702","commenter_b":"@username it made it to the internet via facebook / twitter etc , not sure about the mainstreeam","commenter_a":"with innocent doctors inside","post_message":"Pretty much sums it up... The Free Thought Project.com (Y)"},{"comment_id":"544254699096156","commenter_b":"Eat pig shit Muslim","commenter_a":"If we are so disgusting take your slappy ass back to the Middle East. Live in squalor and let your \"men\" rape, beat, torture and starve your dumbasses!!","post_message":"Obama wants us to believe that Muslim Refugees can easily integrate in our Christian Western society, well watch this VIDEO..."},{"comment_id":"10154044965451717","commenter_b":"The school I taught at had GSA. Admin discovered they HAD to allow it because they had FCA (Fellowship of Christian Athletes). Best use of irony. If a school has a non-curricular club it must allow other non-curricular clubs on campus. Federal law!","commenter_a":"When I was in high school we had one, he next year we got a new principal and he shut it down","post_message":"The ACLU says the ruling strengthens the rights of middle school students, putting them on the same level as high school students."},{"comment_id":"1067324623308009","commenter_b":"Why should anyone get special benefits for being married?","commenter_a":"I am for the government getting out of the marriage business","post_message":"While we celebrated the right of same-sex marriage finally being nationally recognized, Republicans began to lose their minds."},{"comment_id":"10153187675581336","commenter_b":"Obviously the Muslim student. If she doesn't want to watch it go get a coffee or do something else. I mean I don't like certain movies but instead of causing a ruckus I just don't go see it. Remember...we do live in a FREE country.","commenter_a":"We're just going to let them dictate to us what we can watch in our own country!?!","post_message":"President of the University of Maryland College Republicans: \"This isn't a racist film. It's about a decorated American war hero who [risked] his life for you and me and all the viewers.\""},{"comment_id":"10153748697767629","commenter_b":"If white women didn't flunk every black and Latino out we might have the blacks in college and in education that we need.","commenter_a":"When are we going to start making teachers uncomfortable and scared? its a white, more privileged profession with more time off. Especially at the college level. Shouldn't they fear being shot in the head too? Thankfully we are getting guns on college campuses so that all authority can be radically challenged with an in your face confrontation. The Russian left has always known the power of confronting authority so I'm glad America is catching up. War and Revolution baby! Just like the founding fathers intended.","post_message":"This is beautiful."}]
