[{"comment_id":"990159621088681","commenter_b":"Party affiliation is not THE ISSUE & what you should be voting on here Is Making America BETTER, PROSPEROUS & SAFER. IF YOU WANT MORE LIES..MORE CORRUPTION ...MORE $$$$$$$ GIVEN TO THE MIDDLE EAST...MORE WEAPONS SUPPLIED TO THE RADICAL GROUPS....MORE ILLEGALS COMING IN... MORE MURDERS..SANCTUARY CITIES... ...VOTE HILLARY.. YOU are the SHEEP. THE UNION HAS MADE YOU FOLLOWERS. SOUNDS LIKE MOST UAW MEMBERS ARE WISING UP. LOCAL 909 MEMBERS HAVE. EDUCATE YOURSELVES. WATCH: CLINTON CASH HILLARY THE MOVIE HILLARY'S AMERICA 13 HOURS READ: GUILTY AS SIN PARTNERS IN CRIME CRISIS OF CHARACTER ....and so much more... Investigate the CLINTON FOUNDATION.. HOW THEY HELPED (LOL) HAITI. They stole billionsof donations from these poor people. CLINTONS ARE FULL OF LIES. THEY MUST NOT BE TRUSTED! !! HILLARY CLINTON IS A WICKED WOMAN..for those who follow LOUIS FARRAKHAN, he States this fact, he also states how obama has failed his people. Look it ...","commenter_a":"Out of all the people in this work and these two clowns are the only choice","post_message":"Donald J. Trump is speaking this afternoon at Macomb Community College in Warren."},{"comment_id":"10152633763458525","commenter_b":"So because somebody disagrees with you they lack common sense. That's very adult of you.","commenter_a":"And people say that pot doesn't hurt anyone.... That's two deaths due to pot sales just during the holiday season. Pot hurts....even kills.","post_message":"They are just 15 and 16."},{"comment_id":"10154858585008797","commenter_b":"If they are here illegal. they are just deported . That's why I care if they are here illegal!! they'll just come back in to commit more crimes..","commenter_a":"How many are legal citizens","post_message":"GANG BUST: After nearly three years of undercover investigation, a total of 96 felony charges have been filed against 16 gang members."},{"comment_id":"946471268733575","commenter_b":"Sit down an be quiet Mitt!","commenter_a":"Trump is not my choice, but why do Republicans do this to themselves? And who cares what Mitt Romney thinks - he blew his chance and I do mean blew it!","post_message":"Donald J. Trump fires back at Mitt Romney's claim that there may be a \"bombshell\" in his taxes. @webpagelink"},{"comment_id":"1521502694809851","commenter_b":"And once again we don't riot , block busy streets and and make up bullshit like a certain group of people--- absolutely this is murder and a hate crime!!","commenter_a":"absolutely","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news. No riots, no protests, no media coverage. Do you think he should be charged with a hate crime?"},{"comment_id":"938755412831598","commenter_b":"If she's a white lady, I'm a white lady.","commenter_a":"I am surprised she still has those white teeth in her mouth wow.","post_message":"Let's be honest. If this woman was black, she wouldn't be smiling for a cute little mugshot...because she'd most likely be dead now. #WhitePrivilege"},{"comment_id":"498325633682650","commenter_b":"Latino political organizations need to get their voters in large numbers to make sure that ASSHOLE doesn't get in office!","commenter_a":"I am not a Republican. I am not a fan of any of these idiots running. But Trump has got to go . People are gonna get hurt, innocent people. Look at the monsters he has as his security detail that will swing at anyone for no reason and now this with his supporters. The media has to stop covering him. Take away all the attention he is getting. Maybe cover him when something intelligent comes out of his mouth, which so far has been nothing. This man can say whatever he want but we are a democracy, we have a government and he rant about all he wants to do but he can't do it alone. There are 3 branches of government. I know that he has veto power but then we would be calling him Dictator Trump not President Trump. He is a egotistical classless piece of shit.","post_message":"It's getting worse."}]
