[{"comment_id":"1725694384382380","commenter_b":"Where have you been sweet thing? We have been giving black people reparations for decades. Who do you think has been putting money into your welfare accounts all these years? Come to me for reparations and your welfare will be permanently cancelled.","commenter_a":"They can kiss my white non-slavery butt","post_message":"All White People Owe Us Reparations, 'If You Don't Give It, We Are Coming To Take It' [VIDEO] They are demanding that we give them money for their ancestors slavery. Will you pay African Americans reparations?"},{"comment_id":"10153593606745575","commenter_b":"@username That would require the removal of the colored beast as well as the illegals as they are responsible for 49/50 murders in NYC ofr instance. 96% of all crimes in that city and a whopping 98% of all gun assaults. Liberal American preaches these two species are to be housed, fed, clothed, educated and given the best medical treatment in return for their confusion between acting civilized and acting like animals.","commenter_a":"You women need to vote Republican or this will become common.","post_message":""},{"comment_id":"10154103059341509","commenter_b":"LMAO He will never menstruate or go through menopause LOL","commenter_a":"His NAME is BRUCE Jenner. Will he give up his medal, because he won those medals as a Man","post_message":"A judge has granted a petition allowing Caitlyn Jenner to officially change her name and gender. @webpagelink"},{"comment_id":"1043158469105219","commenter_b":"That's the spirit. Women, don't let anything keep you from making sandwiches!","commenter_a":"Suck it up buttercup,not everyone likes tattoos..","post_message":"'I don't understand how tattoos can stop me from making a sandwich'"},{"comment_id":"10153329525229203","commenter_b":"It's called Sharia Law and it's practiced in Muslim Country's where Women are considered worthless property.","commenter_a":"Alexis A Massey","post_message":"In Nigeria, violence a husband for the purpose of correcting his wife is considered lawful."},{"comment_id":"1184449068295865","commenter_b":"A greedy witch !","commenter_a":"Clinton just wants votes she doesn't care about the American People","post_message":"“He used every word in the book. Can you imagine if I said that?” asked Donald J. Trump."},{"comment_id":"1225168154206852","commenter_b":"No woman in her right mind would have voted for this man. God help us all.","commenter_a":"Genial","post_message":"'Donald Trump will make our economy great again'"}]
