[{"comment_id":"10153316472741336","commenter_b":"Hell no she shouldn't lose her job, she should of took another pic with her legs wide open !!!","commenter_a":"@username I agree!!","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."},{"comment_id":"10153451961173717","commenter_b":"Jamie Woods well we don't have any respect or trust in the lying liberals democRATS..who believes in killing unborn babies and selling their body parts, nor allowing illegals into our country so they can suck the life out of America by getting on welfare and to kill,also not support our troops..democrats only care about their own pockets..","commenter_a":"he isnt any worse then the other ones that are running at least TRUMP tells the truth doesnt mince words doesnt try and manipulate and cheat his way through and election.","post_message":"Skywriters stole the show at the 127th Rose Parade in California on Friday, dashing out a message for Donald Trump just as the last float left the gate. \"America is great! Trump is disgusting,\" were the words dotted clearly across the sky on what appe..."},{"comment_id":"1179053782134909","commenter_b":"Yes and he is ASS!","commenter_a":"IDIOT","post_message":"Kanye West Claims He’s Tougher Than A US Soldier. Wow, how disrespectful. He must be kidding. Do you think Kanye West is a disgrace?"},{"comment_id":"1850461285187986","commenter_b":"If hillary clinton introduced herself to me as Hillary Clinton I wouldn't beleive her.","commenter_a":"#alwaysHillary","post_message":"Hillary Clinton holds a rally in the battleground state of North Carolina."},{"comment_id":"535176933316799","commenter_b":"give them hell Mr Trump,she makes me sick everytime i look at her","commenter_a":"Enough of these two !","post_message":"The heat-seeking Trump tweet you just HAVE to see..."},{"comment_id":"1060479207341941","commenter_b":"@username you are stupid and Crystal takeaway from drugs looking for help never is to late for live free of drugs jajajaja jajajaja jajajaja.","commenter_a":"Hillary for Iowa the best candidate for president and 2016. Go @username go.","post_message":"5 days to Iowa!"},{"comment_id":"10153196939420047","commenter_b":"Remove yourself from The United States of America. You Don'T America's Ways. LEAVE!!!","commenter_a":"It probably should be removed. Does a nation that promotes the murder of the unborn and celebrates a counterfeit\"marriage\" trust in the one, true God who has revealed Himself in Scripture? Nope. Meaningless words that don't impress the God of all creation at all. Repent and believe the Gospel.","post_message":"Avowed atheist Michael Newdow is at it again. He's just filed a federal lawsuit demanding that \"In God We Trust\" be removed from U.S. currency. We must remain vigilant in defending the Constitution from yet another assault on our religious heritage."}]
