[{"comment_id":"455564827957330","commenter_b":"So then maybe, when girls get pregnant and don't want to keep it, @username, you will take them?","commenter_a":"I wish it wasn't legal. There is nothing whatsoever \"OK\" about killing an unborn baby and justifying it as \"a woman's choice\". Women's rights and women's health issues have nothing to do with killing a baby. Albeit legal, it's a complete disgrace. But you're right - no tax monies should support it!","post_message":"Abortion is legal, but taxpayers shouldn’t have to pay for it. @webpagelink"},{"comment_id":"10155086722556323","commenter_b":"@username Will it be a big, beautiful wall?","commenter_a":"I can see the 'Jungle' camps with the immigrants around the NI border already :)","post_message":"Ireland prime minister has warned that avoiding a post-Brexit border is now vital for the republic national interest."},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"},{"comment_id":"10153994821081409","commenter_b":"Voting should only be done in person with ID on paper ballots. Who marked that mail in ballot? Who is at the keyboard for online voting? Do you have a repeatable count of the votes? Again, voting in person with ID with paper ballot.","commenter_a":"Voting should be the same in every state, county, city, town, whatever. Mail in ballots should be available to everyone. I think eventually we should go to online voting if we can keep the republicans from tampering with it.","post_message":""},{"comment_id":"10154038278856990","commenter_b":"My prayers and condolences for the family. Heartbreaking.","commenter_a":"This is horrible.... I am not sure what escalated it into him putting one guy in a headlock and then getting stabbed by the 2nd guy, but I really feel for his family. All those babies will never be able to experience a completely happy Christmas again. :(","post_message":"A father-of-four went to Target to buy gifts for his children on Christmas Eve, but was stabbed to death as his 4-year-old son watched. A witness said the victim confronted a pair of men who were allegedly playing vulgar music in the toy section. @webpagelink"},{"comment_id":"485707381619842","commenter_b":"Shariah Law is \"TORTURE OF WOMEN\". It demands that women be covered from the top of their heads to their toes. HOW STUPID is that. But this is just a small portion of the TORTURE. We are America. We will NOT HAVE SHARIAH LAW. BB","commenter_a":"No sharia !!!!!!!!!!","post_message":"Enough is enough. It's time we as Americans stand up and say 'NO' to Shariah Law. Spread the word and SHARE, we need people aware of radicals in this country. Do you agree Shariah Law should be banned from America?"},{"comment_id":"10153960643118984","commenter_b":"Just take ur stinking ass and ir ugly ass women with u","commenter_a":"You all need to vote ... get rid of this crap ....","post_message":"I can't imagine what this woman must have felt when this Muslim cab driver did this... Do you support this judge's decision?"}]
