[{"comment_id":"10153035493893822","commenter_b":"Gross. She needs to go back.","commenter_a":"Why isn't she in jail?","post_message":"Connellsville woman charged for having sex with a 14 year old boy. The boy actually dated the woman's late daughter, who died back in June of 2014."},{"comment_id":"10154969618344726","commenter_b":"muslim migrants.","commenter_a":"And people wonder why nationalistic skinheads are on the rise in that country.","post_message":"One poll finds German women no longer feel safe."},{"comment_id":"10155391516626729","commenter_b":"make the bitch donate it to charities or homeless people","commenter_a":"Green Party = Communist, it is all about the money","post_message":"Probably the objective all along."},{"comment_id":"10154204530456037","commenter_b":"Pussy","commenter_a":"Muslim obama has destroy the military.","post_message":"The accused spy, Lieutenant Commander Edward Chieh-Liang Lin, has been in the Navy since 1999 and has won several awards, including two Navy/Marine Corps Commendation Medals."},{"comment_id":"10155934597900354","commenter_b":"And that is why this RINO will loose ..solution enforce ..the ..laws on the books now . Punish companies for violating the law ..make the fine so harsh they will not even think it ..with no jobs the illegals will self deport ...problem solved .in 3 months here is the 3 rd grade math ..20 million illegals ..10 million Americans out of work a high percentage of them are black .just think if 20 millions jobs opened up in the next 3 months ..what would that do for the black community ..IT WOULD HELP SOLVE A LOT OF PROBLEMS .","commenter_a":"Sneaking into a country illegally is NOT an American value either.","post_message":"Okay Jeb"},{"comment_id":"1105112639584987","commenter_b":"She's an embarrassment to all intelligent women","commenter_a":"Get over your love affair with Trump. It's not happening and @username looks super pathetic.","post_message":"Here's what happened in Iowa, according to Donald J. Trump."},{"comment_id":"10153722201678812","commenter_b":"He is a Hero..","commenter_a":"Prayers for family. The boy is a hero","post_message":"Charlie Finlayson had to leave his father and set off alone on a hiking mission to find help: @webpagelink"}]
