[{"comment_id":"542298055958487","commenter_b":"That shouldn't come as a suprise.There is alot more where that came from. JAIL HILLARY 2016","commenter_a":"If this was only true. If she is arrested she should be put it with all the other criminals and NO special treatment","post_message":"She looks good in orange..."},{"comment_id":"960663503945907","commenter_b":"If you don't love her(America) then leave now !","commenter_a":"Good bye Felicia!","post_message":"U.S. students jump off deep end: Renounce America Now it's official. Many American students want to have nothing to do with the U.S., and they're pressing for this astonishing action."},{"comment_id":"10153396181678908","commenter_b":"Good morning through Facebbok","commenter_a":"Beth Bethy Lockwood","post_message":" are confirming the health benefits of meat-free eating. Nowadays, plant-based eating is recognized as not only nutritionally sufficient but also as a way to reduce the risk for many chronic illnesses. Harvard Medical School"},{"comment_id":"1891157881114099","commenter_b":"that's something you would need to record lol","commenter_a":"@username this would be something you would do lol","post_message":"Now that's a f.d up prank. #WSHH"},{"comment_id":"10153744728059087","commenter_b":"And, to all of the pissy whiney Clinton supporters who complain about how \"mean\" Bernie has been to Hillary by his pointing out true negative aspects of her record--if Clinton prevails, Trump will decimate her and Bernie will never look so good to them.","commenter_a":"I call...bullshit. Bernie","post_message":"\"I sense some great deal of momentum, I sense some great victories coming,\" Bernie Sanders said after his stunning upset victory in Indiana. \"I think we can pull off one of the great political upsets in the history of the United States and in fact become the nominee for the Democratic Party and once we secure that position, I have absolute confidence that we are gonna defeat Donald Trump in the general election.\""},{"comment_id":"10153433467800950","commenter_b":"Lmfao living in the hood ...Girl u crazy ..","commenter_a":"I don't care how you spin it...I feel for this man...we send our children off to defend a country that doesn't give two shits about the lives of those we send!!! We expect them to come home the same as when they left after killing people and watching theirs friends die...REALLY?! He was a kid who got caught up in and then taken against his will..He suffered years of torture and now we want to punish him more...I'm sorry but that is as wrong as you can get!!!!!","post_message":"In October, the leading GOP candidate called Bergdahl a \"traitor, a no-good traitor, who should have been executed.\""},{"comment_id":"10153338669186323","commenter_b":"^That hyperbolic Feminazi your mother warned you about","commenter_a":"Yeah! It's Natalie PortMAN not Natalie PortWOMAN","post_message":"“It’s a very female thing of being afraid to say: ‘I’m the boss, and this is how I want it.’”"}]
