[{"comment_id":"10153625958496636","commenter_b":"This is why women shouldnt get involved: too emotional. Lets let everyone in...","commenter_a":"The Germans now are having a worse affect on Ireland than nazism did. They are diluting the nation state with mass immigration.70 million muslims from Turkey given visas, austerity and cheap labour frrom countries that should never have been allowed into EU.Dole tourists bleeding us dry . Most importantly our individuality is being merged into a multicultural nightmare","post_message":"Freedom is in decline across the planet"},{"comment_id":"10155456219056509","commenter_b":"Both are adulterous stalkers.","commenter_a":"Trump is lying about his own words he says he didn't do what these women say but on tape he brags he did. What a liar, lying Trump calls himself a liar. LOL","post_message":"For some women, Donald J. Trump's denial of wrongdoing has made them feel compelled to speak out"},{"comment_id":"1570144263286969","commenter_b":"AMEN. Michele sure didn't/doesn't get it!","commenter_a":"I agree","post_message":"\"There is one crucial sentiment Donald Trump’s Slovenian born wife certainly didn’t copy from Obama’s — the inherent pride of being an American citizen.\""},{"comment_id":"10153725083142464","commenter_b":"@username YOU'RE A COMPLETE MORON !!","commenter_a":"I remember my thanksgiving in Iraq and the Stan. Prayers for all those away from the families eating thanksgiving in a to-go box","post_message":"Tomorrow and every day, don't forget to say a prayer of Thanksgiving for our men and women in uniform spending the holiday away from home."},{"comment_id":"1875497529335937","commenter_b":"Ann Coulter is a very dumb idiot. I wish she would disappear","commenter_a":"That would keep many of his own people from voting.","post_message":"Fact check! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152823954416130","commenter_b":"Sorry for caring about Charlotte by the way","commenter_a":"If this jerk telling you to get them isn't reason enough NOT to, then I don't know what is...","post_message":"\"The science is, you know, pretty indisputable. We’ve looked at this again and again. There is every reason to get vaccinated, but there aren’t reasons to not.\""},{"comment_id":"1321956137825394","commenter_b":"Great, I'm off to Havana tomorrow!","commenter_a":"Cahl Denni Sharknado?","post_message":"Every single one of those black dots is a 2-meter-long shark."}]
