[{"comment_id":"10155300892045354","commenter_b":"Pompous ass!!!","commenter_a":"the blank is \"Delta Sierra\"","post_message":"Watch this incredible video and then fill in the blank: \"John Kerry is a _________.\""},{"comment_id":"1194670093899735","commenter_b":"Hillary? Really the woman should be in prison.","commenter_a":"The judge is a son of illegal immigrant. @username do your freaking job investigate this judge. I gurantee you he's Hillary Clinton's supporter.","post_message":"U.S. District Judge Gonzalo Curiel in San Diego called for the documents to be released."},{"comment_id":"10153814640313701","commenter_b":"He needs to be locked up and the key thrown away!","commenter_a":"Not to judge people on appearances, but I would seriously reconsider allowing my kid to be alone with the likes of that creep!","post_message":"A court document states that Toman admitted to sexually abusing a girl when she was between the ages of 11 and 17."},{"comment_id":"1247936331966085","commenter_b":"So tired of explaining this exact sad truth.","commenter_a":"Learn the difference.","post_message":"It was clear from the start the criticism wasn't about the flag."},{"comment_id":"531497917040788","commenter_b":"What a Dixie chick.....","commenter_a":"Dope head","post_message":"Tim Mcgraw fans shocked after he bowed down to Obama in this sickening way. Sorry Tim, you lost our business forever. Will continue to support Tim Mcgraw after he did this?"},{"comment_id":"1089512117777571","commenter_b":"YEP CLINTON RAN TO CANADA","commenter_a":"Blame Carter. If he hadn't pardoned Clinton for draft dodging we wouldn't be in this pickle.","post_message":"SHOCKING VIDEO: US Marine Booed, Removed From Clinton Rally For Asking Legitimate Question WATCH THIS! @webpagelink"},{"comment_id":"10153888535289160","commenter_b":"Donald Trump our only hope for Americans. Illegals should go home and work on making their own country great.","commenter_a":"Donald Trump for President United States of America","post_message":"Trump \"has a right\" to question if Trump U judge is fair the former AG claimed."}]
