[{"comment_id":"10153491721731337","commenter_b":"He's the biggest Dick","commenter_a":"Rock Star? Don't you have to be able to play an instrument? And sing? If not, then I'm the biggest rock star!","post_message":"SHOTS FIRED: Kanye West claimed to be \"THE GREATEST LIVING ROCK STAR.\" The Who responded perfectly..."},{"comment_id":"507285912795322","commenter_b":"God will show his hand and these creatures will be taken away to their doom.","commenter_a":"Take off the masks ladies!","post_message":"ISIS just made a huge move against America. This is unacceptable. Spread this post, we need to fight back. Do you agree ISIS should be wiped off the Earth?"},{"comment_id":"10154501796200861","commenter_b":"A form of The old bait and switch. ....I don't feel sorry for the jewelry store...you knew better","commenter_a":"I'm not saying profiling works every time but it would of worked this time","post_message":"Do you know any of these men? Police need your help."},{"comment_id":"10154102342209607","commenter_b":"Melania trump was a model","commenter_a":"And my question is why do we care? We elected a man with no political experience and our soon to be First Lady have nude pics floating around on the internet....I mean at this point does it matter if his family moves in? Everything about this is...unconventional lol.","post_message":"QUESTION OF THE DAY Do you think Melania and Barron Trump should move into the White House in January? Tell us your thoughts and they may appear live on Fox45 Morning News."},{"comment_id":"709741415860770","commenter_b":"She's about one stupid fucking bitch.","commenter_a":"Nancy, Nancy, Nancy: you've been in theHouse/government too long !!Time for you to resign!!!","post_message":"Liberal logic: Taxpayers don't fund abortions, they fund the organization (Planned Parenthood) that performs the abortions. This is liberal, pro-abortion double-speak at it's worst."},{"comment_id":"10152594286750779","commenter_b":"I hope she never gets a boob job","commenter_a":"Did she trademark small breasts as well?","post_message":"If you want to \"Party Like It's 1989\" to \"This Sick Beat,\" you better ask Taylor Swift's permission first. The pop star has trademarked those phrases – along with \"'Cause We Never Go Out of Style,\" \"Could Show You Incredible Things\" and \"Nice to Meet You, Where You Been?\" – with the U.S. government."},{"comment_id":"10153100567617464","commenter_b":"get rid of her","commenter_a":"She's bad news , she's dangerous to the good people of America!!","post_message":"Read and SHARE my new op-ed: Republicans must oppose Loretta Lynch — or lose all credibility on lawlessness: @webpagelink #StopLorettaLynch"}]
