[{"comment_id":"10154517651704166","commenter_b":"Ash, Nc","commenter_a":"Hi from","post_message":"Mother of son hit with books at school speaks out"},{"comment_id":"485687248279822","commenter_b":"The problem is when she decided to do this job the law was different. Leave her alone. Why should she be penalized for her beliefs?","commenter_a":"she, does not want to work....so go home lady","post_message":"If you can't do your job, maybe you shouldn't have it..."},{"comment_id":"1081603935229468","commenter_b":"#I'mwithHer Go Girl all the way to the white House!!!.","commenter_a":"Hilary Clinton, vote for the most qualified candidate for president 2016","post_message":"This is not a single issue country. We need to address racial inequality as well as economic inequality."},{"comment_id":"1325194690833614","commenter_b":"People need to slow down","commenter_a":"I hope this guy gets a huge fine and jail time. He could have killed someone.","post_message":"A driver was not injured after this violent crash that landed on Seattle's Burke-Gilman Trail. Gary Horcher shares the story >> @webpagelink"},{"comment_id":"902649573193973","commenter_b":"And the nasty muslims rape goats","commenter_a":"There are police outside Catholic services in NYC right now. And Jewish services. But not allowed at mosques because it's insulting.","post_message":"“If you've got nothing going on [in mosques] but a beautiful religious service, why in His name would you not want to have police officers?” – Rudy Giuliani reacts to the #OrlandoShooting and Donald J. Trump's push for more surveillance"},{"comment_id":"10153226407581770","commenter_b":"Evil scum bags. Send them back!","commenter_a":"Strategically this suicide!","post_message":"When the politicians said \"Refugees Welcome,\" did they know they'd be welcoming a rape culture as well?"},{"comment_id":"10154391312414614","commenter_b":"I think these pro illegals group should pay the billions it's costing Americans, show their support that way......","commenter_a":"Annndd I don't care.","post_message":"\"We wanted to point out that while he seems to think he can say what he likes in one place and not hear about it elsewhere, he is wrong,\" said one Scottish protester, referring to Trump's controversial comments about Mexican immigrants. point of the flag is to show solidarity with the Mexicans and every other group that Trump has decried, derided, insulted and tried to marginalize, said David Milne, a member of the Tripping Up Trump campaign."}]
