[{"comment_id":"10154608695637994","commenter_b":"These girls are exactly why we have insecure girls in high starving themselves! There are consequences to your actions! I bet she ain't laughing now!","commenter_a":"I was just wondering what happened with this.","post_message":"Playboy model Dani Mathers could face prosecution for posting a photo of a naked woman, without her knowledge, in the locker room of an LA Fitness. Mather posted a photo of the naked woman in July to her Snapchat with the caption, I can unseen this, then you can either. Do you think she should spend some time in jail?"},{"comment_id":"1193851514016933","commenter_b":"You losers already get my money in taxes. I pay for your food stamps and slow check every month!","commenter_a":"We wuz kangs","post_message":"Just in time for Christmas!"},{"comment_id":"908657265920023","commenter_b":"I remember when NASCAR used to be a great sport. You screwed it up Brian. You should've a politician. You took a gold mine and destroyed it. Take a look at the last Bristol race.","commenter_a":"Stopped watching Nascar when Dale died, not surprised at all.","post_message":"Will NASCAR fans support NASCAR chief Brian France's \"behind the scenes\" political efforts on behalf of the transgender bathroom movement?"},{"comment_id":"1737156569841341","commenter_b":"Me too, streamed. He handled disrupters well.","commenter_a":"Loved it, not like being there but watched it live. Trump you are predestined to be our next President.","post_message":"I LOVE YOU NEW YORK! Thank you for a terrific night, ALBANY! LETS GET OUT & VOTE TRUMP next Tuesday, April 19th -- and lets WIN, BIG LEAGUE!"},{"comment_id":"10153946404822439","commenter_b":"They invited these people into their country. Their circus. Their monkeys. When their country implodes, we must absolutely seal our borders against European refugees. Let them stay home and fight or die. Euronate on them. We don't want their disease, here. We have enough of their kind already.","commenter_a":"Poor refugees, still weak from their flight to Sweden. Let's hope Gustavus Adolphus is not entirely dead yet.","post_message":""},{"comment_id":"1739956166245053","commenter_b":"Tommy @username lol","commenter_a":"@username 😉","post_message":"Sharing just in case, can't hurt :)"},{"comment_id":"10152628059135667","commenter_b":"Dear Bill, are you having relations with that women?","commenter_a":"How can they release something they dont have.","post_message":"\"I want the public to see my email,\" Clinton tweeted."}]
