[{"comment_id":"10150583091169999","commenter_b":"Smart girl","commenter_a":"Tara Hosseini Chanelle Felder Curtis","post_message":"“A Bush was trying to blame ISIS on Obama’s foreign policy — it was hilarious.” Check out our sister page The New York Times Politics and Washington for more."},{"comment_id":"10154917656616509","commenter_b":"People, here the moronic trump plan : deport Americans from America! Ban Americans immigration from state to state. Unless you're a Caucasian with 'orange paint' on your face, then you must wear a badge to show who you are! That's the moronic trump have plans for America!","commenter_a":"So many people dead and Obama plays politics and slams Trump, Whats Obamas plan to stop this, He dont have one, Trump has one","post_message":"President Barack Obama on use of the term \"radical Islam\": \"What exactly would using this label accomplish?\" @webpagelink"},{"comment_id":"10153162222096051","commenter_b":"I think it should be done in private. What's a woman going to do just flop it out in front of everybody","commenter_a":"You can breast feed in public without your boobs hanging out.","post_message":"This woman was shopping at her local Target when she noticed that the store had left a special message to its customers."},{"comment_id":"1717801081829837","commenter_b":"Crazy lady.","commenter_a":"go Killery.","post_message":"Is this hypocritical? WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"10154647842874197","commenter_b":"KHILLARY HAS ROBBED ALL OF US. BILLIONS OF DOLLARS IN HER COFFERS!!! TAKE THEIR MONEY AND GET OUT OF THE US!!!","commenter_a":"He won't save it he will get what he wants at your expense lol","post_message":"WATCH LIVE: Donald Trump speaks in North Carolina."},{"comment_id":"10154153182021519","commenter_b":"The joke is going to be on the fools who think Trump is bringing their jobs back.","commenter_a":"... . : get uses to it, the next four years is going to be the Donald Trump Aion of the dead-letter-literal-interpretation Christian religious right fundamentalists. The poor rust-belt have-nots put Trump in office because of neoliberalism global economics And the religious right put Trump in the White House , because They want Supreme Court judges to turn back abortion and gay rights etc. . And neoliberal Wall Street buddy's of Trump will get what they want , deregulation for Wall Street and tax cuts. The right wing is in the candy store and everything is free . Like I said; the next political reality show startes after November. ~~~ ~","post_message":"Ted Cruz in the Supreme Court sounds like a nightmare."},{"comment_id":"1168639523214582","commenter_b":"Just another paid for asshole who got caught with his dick in his mouth. Now disbar this worthless piece of shit and scum.","commenter_a":"You cannot believe the media at all they're just liars liars and Liars and they make up s*** and tell it like it's real you can't believe nothing they say think or do and as far as thinking I think they're incapable of thinking anything they're being paid to Railroad this guy and they're going to do it for the money","post_message":"The judge in Donald J. Trump's Trump University case was just HUMILIATED... here's why he just had to undo his own ruling. This shows exactly why he shouldn't be on this case... it's time for him to recuse himself."}]
