[{"comment_id":"10153187094616636","commenter_b":"Typical Welsh comments !!!","commenter_a":"Hoog cheats by throwing himself to the ground in an attempt to get a South African player a yellow card or worse. Not a word of aplogy from the player, coach or former players. Why is it the Scots are such bad losers.?","post_message":"Gavin Hastings said the sight of Joubert leaving the pitch was \"the worst thing I have seen on a rugby field in a very long time\""},{"comment_id":"10153183802333188","commenter_b":"\"The walking dead\" are serving as most of our representatives in Washington, take a good look next time someone speaks to the Congress.","commenter_a":"Why do you think it's so good? It prepares us for what we might expect in a SHTF scenario.","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"10152738013846135","commenter_b":"I didn't even know there were still idiots who thought like this....holy crap. What is WRONG with people?!","commenter_a":"Blacks got their way again!!!!!!!","post_message":"Today's Baltimore Orioles game was the first ever game to be played without fans. It led to some crazy pictures! PHOTO GALLERY: @webpagelink"},{"comment_id":"10156583768975389","commenter_b":"Build #TRUMPWALL","commenter_a":"Google Trends data shows Donald Trump was the most searched candidate during the debate, both in Iowa and across the country.","post_message":""},{"comment_id":"1329308387112427","commenter_b":"Muslims just can't adapt to modern society. Their value system is based on lower less evolved emotions and weaker minds","commenter_a":"Simple solution leave go back to where you came from","post_message":"DO THEY EVER STOP WHINING?"},{"comment_id":"10153635664936717","commenter_b":"Lock her up! Oh wait she's careless just like Hillary!","commenter_a":"At this point, this is just funny.","post_message":"Here she goes again..."},{"comment_id":"536487383205696","commenter_b":"Here's some facts for you Gerry - I NEVER want to be someone's \"arm candy\", I will NEVER marry for money and I don't have relationships with people because of the way they look. I do agree with you when you say we are our worst enemies, but that doesn't give you the right to generalise all women. Unless you're happy to be lumped with the guys that are shallow and only date women with big breasts","commenter_a":"Who the hell cares if she is pregnant? unfortunately women are their own worst enemies, happy to be arm candy of some of the most groteste males alive,providing they are millionaires, fact!","post_message":"Jennifer Anniston has said we’ll be the first to know if she's pregnant. Writing for The Huffington Post, the actor blasted the “sport-like scrutiny” she lives under, saying it’s indicative of society’s warped view of women which sets a dangerous example for girls."}]
