[{"comment_id":"10154472400523645","commenter_b":"Pisses me off as much as a person on death row getting a heart transplant. Only in California","commenter_a":"I thought convicts were entitled to three squares, dental, and health care, not wants. How could the state be legally required to pay for it? this operation had nothing to do with his health. Just because he believed he was a woman? Well how many of the inmates believe they are innocent? Shall we bow to their wants and beliefs?","post_message":"Shiloh Heavenly Quine - convicted of first-degree murder, kidnapping and robbery for ransom - had the surgery in San Francisco on Thursday. She will reportedly be moved to a women prison after leaving the hospital. The state was legally required to pay for the operation."},{"comment_id":"1676227239104065","commenter_b":"What a pig","commenter_a":"Suck it buttercup had your crap 8 years give us 4","post_message":"How classless can you get?"},{"comment_id":"10154145784326130","commenter_b":"Woman should act like woman? Barf, if a woman does not shave her legs she is still a woman and there is nothing wrong with that.","commenter_a":"This is kinda stupid I'm sorry. And why did she make her legs so goddamn hairy in the comics? I'm sure that's how they look in real life. Glad you found someone who wants to date someone with legs as hairy as his lol","post_message":"Nothing weirder than true love."},{"comment_id":"10155095813944203","commenter_b":"KEEP IT UP DEMS!!!👍🗽🇺🇸","commenter_a":"There should also be a petition to all cable carriers to remove FOX from their channel line up as this network is a danger to America. Tell advertiser to boycott FOX.","post_message":" misled the Congress and he misled the American people."},{"comment_id":"10152826020480927","commenter_b":"It;s simple sex, between a man and a woman burns calories.","commenter_a":"CRAZY","post_message":"Remember, these are your taxes at work."},{"comment_id":"10153291228751037","commenter_b":"He's not abandoning his kids. He's still their for them.","commenter_a":"It's too bad he didn't do it before making all of his children.","post_message":"#BruceJenner’s ex-wife knew about his plan to transition decades ago"},{"comment_id":"1287415054614429","commenter_b":"@username If SCOTUS is majority conservative, and I'm sure it will be, they won't overturn any of this because they don't care about the wellbeing of this country or its people.","commenter_a":"Wanna bet? First, women have been ending pregnancies for millenia and nothing the Kentucky Legislature can do about that. Second, with Roe V Wade the law of the land, any attempts to ban abortion will be overturned. Third, the so-called \"pro-lifers\" will not always be in total control of Kentucky and what this Legislature might pass can just as easily be thrown out.","post_message":"For the first time in 95 years, Republicans took total control over the Kentucky state government this week and immediately moved to strip rights from women and workers."}]
