[{"comment_id":"10152826020480927","commenter_b":"It;s simple sex, between a man and a woman burns calories.","commenter_a":"CRAZY","post_message":"Remember, these are your taxes at work."},{"comment_id":"10153428723486636","commenter_b":"no thank you","commenter_a":"No wonder @username is no longer going to print-regurgitating 8 month old articles without cause to is pretty embarrassing.","post_message":"The WHAT?"},{"comment_id":"10155239406179199","commenter_b":"Wow, you're an a**h**e","commenter_a":"I bet you they're trump supporters.. them","post_message":" still a person, you should still treat me with respect."},{"comment_id":"10153646192306880","commenter_b":"They like getting in touch with their feminine side. :)","commenter_a":"I have the man color, slate grey.","post_message":"Let's face it, the \"rose gold\" iPhone 6s is pink."},{"comment_id":"980526942073728","commenter_b":"Don't forget Mexicans I'm white.. had four kids ,a lazy ass dead beat American wouldn't pay child support on ,I met a 22 year old Mexican illegal I was 29 ..4 kids this man married me raised my four kids we had two of our own so 6 kids to raise Got my first home got his papers fixed got a home in Mexico My soul mate best friend passed away at age 47 working his self to death for his kids so build your damn wall Trump., IF ...you get president there are good men from Mexico I had the best","commenter_a":"What gets me is if people don't like Hillary Clinton then why do you come to @username. Others don't want to hear from Donald Frump supporters.The man is nothing but a racist,bigot,moron, and an idiot.And that's just being nice! Bill Maher gave Mr. Frump the perfect name. Whiney Little Bitch because that's all he does.Hillary will take him down and win. Just my opinion.","post_message":"BOOM! And there you have it! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154073966458837","commenter_b":"Getting pregnant for most chicks doesn't cost anything ! Save a few bucks and don't buy a condom .......","commenter_a":"Omg! I'm really trying to understand her thought process at that time, but really can't! Some people have no brains and should never reproduce! There are so many women out here that are dying to be able to birth a child and you have pos ppl like this. Smfh!!!","post_message":"SHOPPING MOM ARRESTED - A Florida mom was arrested after leaving her 4-month-baby in an unlocked car while she went holiday shopping."},{"comment_id":"1294109124000954","commenter_b":"Not crazy just tired mostly gonna watch YouTube and eventually fall asleep","commenter_a":"Americas doomed if trump becomes president same can be said about hilary just sayin","post_message":"Glenn Beck caught his listeners off guard today with THIS massive announcement. He's been one of Donald Trump's harshest critics, and no one thought that this would happen."}]
