[{"comment_id":"10156429465415354","commenter_b":"Whoopi, you dirty looking bitch Those Islamic Muslim women are in danger of being deported Our female population on the other hand is under threat of gang rape and murder by the Islamic Muslim terrorist.","commenter_a":"Moron...","post_message":"WATCH Whoopi unload on Donald Trump..."},{"comment_id":"10155866233724199","commenter_b":"@username trump wives were here illegally before became citizens , your an immigrant just like these people. The were properly vetted and that's a fact . S maybe you should go back where your from and see how fast you live after setting on one foot .","commenter_a":"IF YOU ARE NOT HERE LEGALLY THEN GET OUT ! WE HAVE LAWS AND THEY ARE GOING TO BE ENFORCED !","post_message":"Governor Jay Inslee reacts to President Trump's immigration ban. \"The unjustifiable chaos and cruelty caused by President Trump executive order is now on full display, right now at Sea-Tac airport.\" More: @webpagelink"},{"comment_id":"10155691016515354","commenter_b":"She actually spoke about how she respected the woman who hated blacks and called basically for their removal!! Ya right, she supports her own money making agenda, let's go conservatives and keep this creepy crook out of \"OUR HOUSE\"!!","commenter_a":"Now the Democrat liberals are trying to get criminal minds to help enforce their power! Criminals joining criminals. Wake up folks !! Crooks for crooks!","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.” If she didn't want it to expire, she could have driven once or twice since 1996..."},{"comment_id":"10153565125016162","commenter_b":"Evil. What is so sick about our world is that moms and dads kill their babies every day by the thousands. It's called abortion. We should be as offended and grieved at the kids killed in the womb and out of the womb.","commenter_a":"Typical crackhead POS!!!! He should commit suicide.","post_message":"CHARGED: Young parents arrested after newborn found to have 20 fractures, police say: @webpagelink"},{"comment_id":"512998138876699","commenter_b":"We certainly need to close our borders, so these warmongering murdering Isis people don't creep in, for that is what they plan to do. We need to do that immediately! The infiltration of this violence is not needed here.","commenter_a":"We need to stand united with the world on this issue of terrorism. We are not doing enough and hundreds of thousands have died already.","post_message":"To the people of France, we stand united with you and all of France is on our hearts and in our prayers. If history has taught us anything, it proves we must remain vigilant against such cowardly, terrorist attacks. America can lead, and we have the strength to do so, but currently lack the leadership. My hope is that our national leaders grasp why so many Americans, including myself, want the Border secured so that we not only deal with the issue of illegal immigration but we also ensure terrorists do not cross our border to do us harm. Never has the old adage been more true: The World is safer when America is Strong: Our People know it, Our Allies know it, and most importantly, Our Enemies know it."},{"comment_id":"455564827957330","commenter_b":"So then maybe, when girls get pregnant and don't want to keep it, @username, you will take them?","commenter_a":"I wish it wasn't legal. There is nothing whatsoever \"OK\" about killing an unborn baby and justifying it as \"a woman's choice\". Women's rights and women's health issues have nothing to do with killing a baby. Albeit legal, it's a complete disgrace. But you're right - no tax monies should support it!","post_message":"Abortion is legal, but taxpayers shouldn’t have to pay for it. @webpagelink"},{"comment_id":"1199877433404302","commenter_b":"Neither. I refuse to vote for a disgusting womanizer who cares nothing about this country and I also refuse to vote for a woman who has covered up her husband's sexual assaults and has allowed troops and ambassadors to die on her watch. They are both liars and cheats and I will pray for this country everyday until either one of them is finally out of office.","commenter_a":"Hillary Clinton","post_message":"Women Voters Only: Your Choice for President?"}]
