[{"comment_id":"10154799760844641","commenter_b":"Stop being such a yes woman","commenter_a":"Lol!!! It's Obama fault that a Multinational move jobs overseas!!!! Lol Let's blame Obama for the KKK, Osama, Sunspots, AIDS, making it late to work, and etc..... Daddy Trump is going to fix everything.... hahahhahahaha","post_message":"Some Rexnord workers said they felt left behind by President-elect Donald J. Trump"},{"comment_id":"821129384591070","commenter_b":"Big whoop. The lady could sneeze, and the Left would twist it into a controversy!","commenter_a":"Some people are just so unhappy in their own lives they have to try and make others just as miserable. Get over yourself and get a REAL life!","post_message":"Sarah Palin kicks off 2015 with a little controversy..."},{"comment_id":"10158155475600615","commenter_b":"Man baby. Strong women make them crazy.","commenter_a":"No surprise! We might respect the office of the President, but that's not \"carte blanche\" for Trump to do whatever pleases his whim.","post_message":"Check out these images from Women's Marches around the world."},{"comment_id":"10154292885141037","commenter_b":"She will never get this vote!","commenter_a":"Democrat Hillary is most qualified, most knowledgeable, and most well informed. Please vote her. Thank. Socialist Bernie and his wife Jane dumped nuclear waste in America where poor Latino people live. Never vote for him Thanks. America: Never ever Trump please. Trump insulted men and women all and sundry.","post_message":"Mitt Romney is “very distraught about” Donald J. Trump, an adviser said. “He thinks Trump is this vulgar, dangerous, principle-less, value-less opportunist — putting it mildly.”"},{"comment_id":"10154346331578812","commenter_b":"I love the sons of Diana and Charles.. The babies are as sweet as can be..long live the queen","commenter_a":"So cute x","post_message":"Prince George is allowed to stay up 15 minutes past his bedtime to meet the Obamas at Kensington Palace dinner."},{"comment_id":"1060964983967782","commenter_b":"I am a woman and I think your ugly Megan","commenter_a":"I think the evidence clearly shows she was moved away. Not beaten or mauled just moved away. Seems like a job hazard to me.","post_message":"\"This is the Trump campaign, where lies are told and then lies are told to cover up the lies, and then finally new lies are told in order to cover up the lies that were told about the lies,\" Ben Shapiro said."},{"comment_id":"1754512868165576","commenter_b":"Hillary will follow him ..........because she also wants Muslim invasion in United states.","commenter_a":"Barack Obama is the worst president ever in the history of the United States of America","post_message":"\"I fully expect by tomorrow morning that President Obama will ... give a press conference in which he'll explain that the problem is too many trucks. If only we had truck regulation then we wouldn't have problems like Nice, because it is trucks that are dangerous.\" – Newt Gingrich"}]
