[{"comment_id":"514982215334916","commenter_b":"With all the illegal immigrants crossing our borders daily, we have no control over the diseases they are bringing into the country, diseases that were eradicated here,thanks to vaccines. If there is even a small chance my child could be exposed to diphtheria, whooping cough, or the measles, or polio, you can believe I will do whatever I can to protect them from these horrendous diseases. If you want to play Russian Roulette with those chances, that is up to you.","commenter_a":"Thanks for taking the time to let us see who you really are. I am more and more impressed by you each day.","post_message":"Each night I try and carve out some time to answer questions from my friends on Facebook. You can submit your questions by sending them to me via email at AskBen@BenCarson.com. I am out in Jackson, Wyoming tonight and my, is it pretty out here. The first question tonight is one I see comments on occasionally. It is from Devon and it is about childhood vaccinations. Devon, as you know, I spent my life with a Pediatric specialty. As a Pediatric Neurologist, I feel I have a very solid understanding of the developing brain of a child. Devon as you know, my life's work was in a pediatric specialty, caring for 15,000 children to ensure that they could live full, productive, and healthy lives. I can assure you that I would never advocate for a treatment for children without fully knowing that it is safe and in the best interest ..."},{"comment_id":"10154230629253854","commenter_b":"trump will take her down,no one will take orders from a lier.","commenter_a":"Go make cookies Hillary.","post_message":"Hillary Clinton Orders Liberal Media to Get Tough on Trump (VIDEO)"},{"comment_id":"1083445358398358","commenter_b":"She needs to give up the madness. She isn't accomplishing anything. Well..... except getting more votes for Trump.","commenter_a":"She is foul mouth pig, has not been funny in years and the sooner she move to Canada the better...","post_message":"WOW...Rosie just outdid herself. Do you agree with Trump?"},{"comment_id":"611879509002628","commenter_b":"She was already insane!","commenter_a":"Whay too much PIE HOLE. Cuss at me, and your Freedom of speech, goes right out the window!!! Maybe she should resort to plan \"B\". Get a M/F'in JOB!!","post_message":"This welfare leech absolutely lost it when she couldn't get change with her EBT card. How pathetic. You cannot live off the hard work of other people. Are you tired of welfare leeches stealing your money?"},{"comment_id":"10155496447630603","commenter_b":"What's it going to be? Pick your switch? The belt?","commenter_a":"Did someone call scan","post_message":"This mother saw her son on TV throwing rocks at police, so she went to the rioting scene, found him and let him have it for taking part in the violence, according to local reports. @webpagelink"},{"comment_id":"10155187211337871","commenter_b":"Two out of 54 are not very good odds but we can't give up hope.","commenter_a":"Thoughts to the EDITOR of a Free Press by President Jefferson... \"Perhaps an editor might begin a reformation in some such way as this. Divide his paper into four chapters, heading the 1st, Truths. 2nd, Probabilities. 3rd, Possibilities. 4th, Lies. The first chapter would be very short, as it would contain little more than authentic papers and information from such sources as the editor would be willing to risk his own reputation for their truth. The second would contain what, from a mature consideration of all circumstances, his judgment should conclude to be probably true. This, however, should rather contain too little than too much. The third and fourth should be professedly for those readers who would rather have lies for their money than the blank paper they would occupy.\" --Thomas Jefferson to John Norvell, 1807. ME 11:225","post_message":"\"I hate the press. I hate you especially. But the fact is we need you.\" - Senator John McCain jokes, but stresses the importance of a free press to a democracy, adding that \"the first thing that dictators do is shut down the press.\" Read more: @webpagelink"},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx \" you big dummy \"","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."}]
