[{"comment_id":"554182668075021","commenter_b":"What lower wages, you mean lower taxes. If you don't want to birth a child, just keep those nasty little knees together","commenter_a":"They are poor, jobless and believe the American dream is dead because they are stupid enough to keep being tricked into voting democrat.","post_message":"Last year was the first time that millennials surpassed baby boomers and Gen-Xers to become the largest voting demographic in the US."},{"comment_id":"10153134851981316","commenter_b":"Go away kardashian of the transgender world","commenter_a":"Lol. Worthless","post_message":"Feminists now attacking political correctness after Caitlyn Jenner honored by Glamour as Woman of the Year: @webpagelink"},{"comment_id":"10152634515646813","commenter_b":"Mind your own damn uterus, mkay?","commenter_a":"ACLU's \"rape culture\" worship, Rape of the child in the womb with instrumentation. rape to death..","post_message":"VICTORY! Federal judge strikes down law that could have closed #Wisconsin abortion clinics, calling the law “a solution in search of a problem (unless that problem is access to abortion itself).\" @webpagelink"},{"comment_id":"10153509581416350","commenter_b":"DO NOT BUY ANYMORE OF HER CDS! DO NOT DOWNLOAD ANYMORE OF HER MUSIC! BOYCOTT HER LITTLE SMART ASS AND DISRESPECTFUL PUNK ASS THAT SHE IS!!!!","commenter_a":"America is HATING YOU....grab some brains!!!!","post_message":"Ariana Grande took to Twitter to explain the controversial video."},{"comment_id":"1097574603596883","commenter_b":"Lol those mother fucks love my ankles","commenter_a":"Ruben Yunv Castillo","post_message":"Why do they torment me and leave everyone else alone?!"},{"comment_id":"10156036512370294","commenter_b":"Why doesn't she just create her own page?","commenter_a":"U r beautiful don't forget that","post_message":"'We recommend that you avoid focusing on certain body parts...' A mother and blogger who suffers from a chronic skin disorder that affects her face wanted to post a photo of herself without make-up to teach others about her disease. Facebook said no:"},{"comment_id":"908359942543967","commenter_b":"I'd love to meet and spit in her face. What a sick bitch","commenter_a":"Beast","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"}]
