[{"comment_id":"10153822220001162","commenter_b":"She needs to die a horrible death","commenter_a":"Her parents must be very proud of how their daughter turned out.","post_message":"BUSTED: The \"Baby Doll\" drug lord, Ana Marie Hernandez, is arrested in Mexico for allegedly running a cocaine pipeline to Chicago --> @webpagelink"},{"comment_id":"10155083954441509","commenter_b":"Bernie sanders , Hillary Clinton,barrack Obama , Set out a bobber in the middle of a HUGE democratic lake , And caught a HUGE amount of sucker fish from the Bernie Campaign, just to find out it was a catch and release campaign ! \"Awesome\" Hand the election to Donald J Trump , Cause it's over for the Democrats Thanks Bernie","commenter_a":"HIllary Rodham Clinton is going to be the 45th~! Putin is manipulating the US presidential election as the De Facto Master manipulator behind Wikileaks- exclusively for his Neo-colonial ambitions. Under Trump's erratic, contradictory rhetoric there is disregard for the 1945 Yalta/1949 Armistice Agreements Border Treaties. A new deal with Putin will re-allocate all former USSR-European domains unless they contribute a \"protection-fee\" Mafia-Culture, upsetting the political/ climate balance of the entire planet;-)","post_message":"Protesters chanting “No TPP” disrupt Representative Elijah E. Cummings' speech at the Democratic National Convention in Philadelphia. @webpagelink #DemsInPhilly"},{"comment_id":"1237059042980790","commenter_b":"He's got my vote. illegals get out","commenter_a":"Trump is a racist POS!!!","post_message":"There may be a lot of other games out there that look similar, but Call of Duty is still in a class of its own."},{"comment_id":"1062730680414093","commenter_b":"Donald trump can't even get 35% registered republicans Please do the math Trump can't win a general Election. You remember my words I'm not being nasty\" just call it in the know. You will find out I'm correct.","commenter_a":"This is for all of my fellow Florida voters. I just received my mail in ballot. Donald Trump is on the very bottom of the list, so please be careful and select him.","post_message":""},{"comment_id":"10154307546211509","commenter_b":"Joking? Missing a punch line...","commenter_a":"Fox News: Thug tries to jump on three girls, and bullets stopped him. Bill O'reily: What was he trying to do to those three girls before the bullets? We're just asking questions.","post_message":"15-year-old Zaveon Dobson was shot and killed after he jumped in to shield three girls from gunfire. @webpagelink"},{"comment_id":"10154933648690695","commenter_b":"Stay in your lane lady","commenter_a":"I keep saying this and I will say it again ... why arent people protesting their brothers killing each other every night? Where are the Black lives matter groups? Or is that just when it involves a white man or police officer because I'm confused. I'm pissed that this man can't even go out in Atlanta to celebrate his new job! Why arent more people mad about this???!!!! Please tell me. They should have been looking up to this man for having his priorities straight! #alllivesmatter #theviolencehastostop #getyourneighborinorder","post_message":"Mitchell Mormon Jr. was celebrating a new job when police say someone shot and killed him."},{"comment_id":"598181650332929","commenter_b":"If this is a representation of the caliber of people America is attracting we're in trouble. It's obvious that we seem to attract a large criminal element, and what does that say about America??? It says we're soft on immigration and soft on criminals, it also says that our Social Services are out of control and way too generous. Trust me these illegals KNOW that they well be given everything for free !!!! and that they can yell Police brutality and that they can do anything they want and get anything they want...welcome to liberal socialism..","commenter_a":"Pigs go to market","post_message":"I agree!"}]
