[{"comment_id":"10154489395427439","commenter_b":"Ritual genital cutting is wrong regardless of sex.","commenter_a":"Barbaric people. Wouldn't expect anything less from this death cult.","post_message":"The gruesome practice of female genital mutilation is at record highs in America due to the influx of Muslim immigrants. FGM is found only within and adjacent to Muslim communities. The fact is that Muhammad justified it: “A woman used to perform circumcision in Medina. Muhammad said, \"Do not cut severely as that is better for a woman and more desirable for a husband.” (Sunan Abu Dawud 41.5251)."},{"comment_id":"10152991347419712","commenter_b":"Good point cutty, still can't stand the guy. Good luck this weekend","commenter_a":"How is this scumbag celebrated?","post_message":"Here are five of Terrell Suggs' greatest chirps about the Patriots and quarterback Tom Brady, a team he doesn't exactly like."},{"comment_id":"10154114920114726","commenter_b":"She is an assault magnet!!","commenter_a":"What do Leonardo DiCaprio Congressman Allen West, the NYPD and Students for liberty all have in common? They all had assault charges filed by Michelle Fields......who is Michelle Fields>? The Woman who is claiming she was assaulted by Mr Trump's Campaign manger. Check her background.","post_message":"Even liberal Susan Sarandon thinks Trump is better than Clinton."},{"comment_id":"10156625898105354","commenter_b":"Boo hoo whiney bitch. !","commenter_a":"Wow these lady must see through smoking glasses","post_message":"\"B**ch commits! That’s the hashtag.”"},{"comment_id":"1255997957800290","commenter_b":"Drop her ass off after 😂","commenter_a":"At least he was a gentleman and took you to dinner after.","post_message":"Separate bills please. #WSHH"},{"comment_id":"10156710754945093","commenter_b":"I dont think so!Murderous old hag!","commenter_a":"Everyone should know she is the liar, news video proves it.","post_message":"This woman knows no shame."},{"comment_id":"910779442445965","commenter_b":"YES THAT IS WHAT WE SPEAK. THE ILLEGALS CAN LEARN IF THEY HAVE A BRAIN OR FIGURE STUFF OUT FOR THEMSELVES. THEY CAME HERE NOW THEY CAN FOLLOW THE LAWS OR START Walking or swimming. either way learn or leave.","commenter_a":"Yes to english","post_message":"He wants to make this this official language of our country. People are up in arms. Do you think he's right?"}]
