[{"comment_id":"1578711192434391","commenter_b":"Oh hell yes lock her up","commenter_a":"Yes","post_message":""},{"comment_id":"598047807050178","commenter_b":"@webpagelink/ maybe you should wake up","commenter_a":"This action taken against this marine n my opinion is shameful n should b a wake up call 2 the AMERICAN people !!!! WAKE UP AMERICA !!!","post_message":"Marine Arrested For Saying THIS About Obama [VIDEO]"},{"comment_id":"584112685109576","commenter_b":"Nah that was Sanders @username. Hillary will lead us into an even more corporate America with a short economy and allow foreign threats to come in while the middle class die and Hillary and the elite get richer and richer.","commenter_a":"Clinton will lead us into corruption, loss of independence and freedo,... she will lead us into a socialist communist state bowing to russia and north korea. Vote Trump and save our future.","post_message":"If you've ever wondered what Hillary's like as a friend, you could ask Janelle."},{"comment_id":"1257959987602294","commenter_b":"You are completely ignoring many of the issues such as the inequality in wages between men and women, the dearth of equality in positions of power such as government and business, and, many other issues which have been a problem for many years. Most murders of women are by men as are rapes. Women are often expected to wear short skirts and behave in what men deem a \"feminine\" way on TV and in many businesses. An excellent example is Fox news.","commenter_a":"I think this poem/speech misses a huge issue and ignores the obvious. Humans as a whole are failing. This isn't just a man's issue. I see, daily, women tearing other women down. Calling them the same things you hear. It is a problem from all sides. We have failed to raise children with respect, love, and caring. That is the issue. To suggest it is only males is dishonest. We should accept it is a societal issue and not a male/female issue.","post_message":"She’s a “dangerous\" woman because she dares to speak her mind in an online community that openly harasses, disparages, and threatens women. Warning: contains strong language. (via Agnes Török Poetry)"},{"comment_id":"521423368048243","commenter_b":"so she condones women being nothing... beaten, raped, stoned for no reason...be told what to do and when to do it.. she should live with them for a while without all her money... become nothing ... not human anymore...","commenter_a":"No she doesn't","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way. What a disgrace. She needs to deported to the Middle East. Do you think Nicole Kidman is a sell out?"},{"comment_id":"1043808669085644","commenter_b":"Thankfully she kept her mouth shut and performed and the liberals are pissed? She's a liberal! It amazes me how they are quick to crucify her for making the decision to simply perform, keep some class during the halftime show unlike that ghetto trash bitch Beyonce","commenter_a":"The Hamilton cast members rocked just as hard as Gaga, and I loved their amendment.","post_message":"This is just sad..."},{"comment_id":"10153163546666336","commenter_b":"I bet those racist pigs were cheering.","commenter_a":"I guess Al Sharpton and Jessie Jackson missed this news story...","post_message":"UPDATE: A third man has been charged with sexually assaulting a woman during spring break in Panama City Beach, Florida, that was captured on cellphone video, authorities said."}]
