[{"comment_id":"1143835818981314","commenter_b":"I love the books. I have them all except the 3rd one.","commenter_a":"Tell them to send to the literacy centers ,people will buy them from the literacy centers to keep them running or they can build a literacy in the U.K. for the people there.","post_message":"A charity bookshop in Wales is begging people to stop donating \"Fifty Shades of Grey\" after becoming overwhelmed with hundreds of copies of E.L James' steamy novel."},{"comment_id":"10154347897121375","commenter_b":"Fernando Barbosa god I hate this bitch","commenter_a":"@username \"dirty Muslim who'd piss of daddy\" literally us to every white guy","post_message":"This viral rant on #WomensMarch is riddled with fake outrage and hypocrisy where she complains about women complaining."},{"comment_id":"10153271978657411","commenter_b":"White trash.","commenter_a":"I don't really care.","post_message":"HAPPY BIRTHDAY, #FLOTUS! First Lady Michelle Obama is celebrating her 52nd birthday today!"},{"comment_id":"10154660100050575","commenter_b":"Is she one of those nasty girls with nasty feet","commenter_a":"Funny how Americans don't like crooks","post_message":"Oh, my!!"},{"comment_id":"10153620225172377","commenter_b":"She is actually a feminazi and against our Second Amendment!","commenter_a":"Why would it be political, she's a republican hack. And is it remotely possible that he could be a sexual harasser.","post_message":"Newsmax CEO Christopher Ruddy says former Fox News host Gretchen Carlson lawsuit alleging Roger Ailes, the influential network chairman, sexually harassed her, simply doesn’t seem right. Ruddy writes: \"Interesting all of this is percolating in the middle of the most important election in modern times. I am not saying the allegations have a political angle. But the timing seems suspicious.\""},{"comment_id":"649755178530332","commenter_b":"Please start packing now! Believe me no one will even miss you and your dirty mouth.","commenter_a":"V","post_message":"I guess it's time to say goodbye, and good riddance. 'LIKE' if you support Whoopi leaving the country!"},{"comment_id":"10153223186871336","commenter_b":"Lol @username it wouldn't be America without us it would still be Native American land Indian land you call crazy and aliens would still be over in Europe living without sign in famine","commenter_a":"Actually 52-0 if you count all the woman beatings and cheap shots outside of the ring.","post_message":"ICYMI: Floyd Mayweather piled up enough points against Manny Pacquiao to win by unanimous decision in their welterweight title bout last night. Mayweather extended his win record to 48-0, cementing his legacy as the best of his generation."}]
