[{"comment_id":"1212525308785662","commenter_b":"HILLARY GOING TO PRISON. NA NA NA NA NA!","commenter_a":"Trump Pence 2016 Make America Great Again","post_message":"On Friday, FBI Director James Comey bowed to partisan pressure and released a vague and inappropriate letter to Congress that only serves to give Republicans a new line of attack against Hillary. Here's what we've learned from news reports: The emails may not have been to or from Hillary. The emails weren’t even ever on her server. The FBI case has not been re-opened. HFA Press Secretary Brian Fallon breaks it down."},{"comment_id":"992725720849341","commenter_b":"Who cares what they want........I hope every single one of those sniveling, useless, A-holes leave!!!!","commenter_a":"Who cares","post_message":"They really don't want Donald Trump to be president."},{"comment_id":"10153322465354575","commenter_b":"That's no lady.","commenter_a":"F that lady","post_message":"A veterinarian posted this picture on Facebook with the caption: \"My first bow kill, lol. The only good feral tomcat is one with an arrow through it's head! Vet of the year award ... Gladly accepted.\" The cat was a family pet named Tiger, and now she could face charges."},{"comment_id":"10152634515646813","commenter_b":"Mind your own damn uterus, mkay?","commenter_a":"ACLU's \"rape culture\" worship, Rape of the child in the womb with instrumentation. rape to death..","post_message":"VICTORY! Federal judge strikes down law that could have closed #Wisconsin abortion clinics, calling the law “a solution in search of a problem (unless that problem is access to abortion itself).\" @webpagelink"},{"comment_id":"563542197162994","commenter_b":"Dear black lady: it's stupid to do either example you gave. Way to drink the cool aid.","commenter_a":"Yesterday in Charlotte (As per Charlotte Police Chief--He's Black)Black man exits car with a gun in his hand, told to drop weapon and refuses....shot by a black police officer. Gun recovered....not a book. Stop the false narrative! Stop the Madness!!","post_message":"At least 12 officers and 5 demonstrators were injured in protests in Charlotte after a black man was shot and killed by police. Video shows protesters destroying a marked police vehicle."},{"comment_id":"1143835818981314","commenter_b":"I love the books. I have them all except the 3rd one.","commenter_a":"Tell them to send to the literacy centers ,people will buy them from the literacy centers to keep them running or they can build a literacy in the U.K. for the people there.","post_message":"A charity bookshop in Wales is begging people to stop donating \"Fifty Shades of Grey\" after becoming overwhelmed with hundreds of copies of E.L James' steamy novel."},{"comment_id":"10153894447031130","commenter_b":"I'm sure that's very concerning to her. News flash: women aren't interested in your opinion of them.","commenter_a":"She is not attractive or funny to me at all.","post_message":"And Amy Schumer looks fab, of course."}]
