[{"comment_id":"1185050781573456","commenter_b":"This lady is nothing but pure Evil","commenter_a":"Same ole same ole.","post_message":"A top official was just discovered dead... he was scheduled to testify against Hillary Clinton in an up coming corruption case. Our thoughts and prayers go out to his family...this is just terrible."},{"comment_id":"10152628736511367","commenter_b":"so leave, gentle lady","commenter_a":"You are not a fair news outfit or discussion platform! You leftist asskisser mother @##$%^^%%^s.","post_message":"\"The only thing we have to fear is ... \" @webpagelink"},{"comment_id":"10154285889541350","commenter_b":"Congrats Dylan and Savannah must be something in the water up there. Have a great day to all of you guys. From Georgia","commenter_a":"Good morning","post_message":"Join our weekend TODAY anchors for their first Facebook Live Q&A! Comment below with any questions you have for a chance to have them answered live!!"},{"comment_id":"484366015087312","commenter_b":"They are all racist. They all hate white people. Yet they couldn't live without white people. Infact if it wasnt for white americans they would still be enslaved around the world. This country didnt start slavery, it was white americans that put an end to slavery around the world. its all they have is the slave thing without it they would have to evolve or take responsibly for thier inability to evolve .","commenter_a":"Why can't President Obama be impeached?","post_message":"National controversy after Juan Williams says something shocking. Juan is racist, plain and simple. Do you think FOX should fire Juan Williams?"},{"comment_id":"1009175035805692","commenter_b":"Thanks god being a feminist is hip again!","commenter_a":"Sweet","post_message":"A 12-year-old feminist named Olivia wrote Hillary this brave, heartwarming letter. Olivia 2040, anybody?"},{"comment_id":"902972626429153","commenter_b":"This has nothing to do with muslims.Shut up!","commenter_a":"give muslims a planet and they'd still not be satisfied","post_message":"The barbarism continues"},{"comment_id":"10153574901357217","commenter_b":"Pete Bayliss Yes i no , the Muslims from the Middle east are taking over the World. we have more trouble with the Muslims from the Middle east then any other race of people here in Australia they are born hatters and want to kill us the free World , they give all the good Muslim people a bad name","commenter_a":"This is very sad but its WAR , and all kind of people get killed in WARS. we the World needs to get rid of ISIS no matter what it takes and innocent people are going to die while doing this . i hate Putin but he is the only one doing the best Jb in getting rid of ISIS.","post_message":"\"There will be no more doctors in Syria.\""}]
