[{"comment_id":"756073464525834","commenter_b":"The best part about all these whining Christians & their rhetoric to defend Christ against a money hungry corporation(which bye strives to destroy mom& pop coffee shops) when ppl are already starving to death or hooked up on drugs. Your Christmas was actually started by Constantine, centered around & similar to pagan holidays to make the transition to Christianity easier. Constantine was actually a pagan until his death bed to where he rejoiced unto God and saved his soul. Why don't you silly Christians who so vehemently judge and live so unlike jesus did do some research on the Christmas tree... It's also pagan, right down to the star on top to the ornaments around it. America was founded on freedom of religion, but that only seems to apply if it's Christian. And yes, the indigenous natives were massacred by bible carrying spaniards, priests, English, Dutch etc. It doesn't matter ...","commenter_a":"This is my last bit about the god forsaken red cups (no pun intended), and thats it. And please read before commenting. Starbucks, is not \"catering to people outside this country\"... Starbucks is a free enterprise, and not obligated to tell you Merry Christmas, in fact, they are not obligated to even do something for the holidays. There are many born and raised here with different faiths and they ALL believe in god, just not Christmas. For example the Jewish believe in God whole heartedly, just not Jesus, which Christmas is about. They also celebrate Hanukkah this time of year. Christianity is not even the first religion in this country, and Christians came here and slaughtered the indiginous for not being Christian, so it's not surprising they still don't accept other religions or respect them. That being said, businesses SHOULD absolutely have the right to say Merry Christmas If they ...","post_message":"Oops doesn't really cover it."},{"comment_id":"10153021008650326","commenter_b":"Creepy man-woman!","commenter_a":"LOSER","post_message":""},{"comment_id":"10154709341603984","commenter_b":"Jealous bitch","commenter_a":"Could it be Mark Cuban is trying to get Trump to look like he would sell his party out for similar money Hillary has taken? :Edited, nah he needs to find a way to ruin Trump. He is looking for a weakness to exploit. I'm sure of it.","post_message":"Billionaire Mark Cuban just stunned everyone with a jaw-dropping offer for Donald J. Trump that NO ONE expected. There's something he wants the Republican candidate to do, and he's willing to give something massive in return..."},{"comment_id":"814269158659286","commenter_b":"Oh really!","commenter_a":"My sister became an alcohol by drinking at home, the drink prepared by her husband before he went out with other women.","post_message":"Some point to our liberty in Christ, but is it wisdom to consume alcohol? One pastor sounds off."},{"comment_id":"10154674259718941","commenter_b":"Shuttle up Hillary","commenter_a":"Does she see this as a chance to get more bribes? If not, this will pass.","post_message":"Hillary Clinton: \"I stand with the people gathered across the country tonight defending our values & our Constitution. This is not who we are.\""},{"comment_id":"10155050203774369","commenter_b":"It wouldn't have meant a thing if Hillary didn't lie to the congressional hearing. She's the one that committed perjury and gave Russia the opportunity. .","commenter_a":"All I can say if they didn't have anything to hide, why so angry?","post_message":"The 2016 U.S. election was NOT the first to be the object of \"malicious cyber activity,\" Barack Obama said."},{"comment_id":"10154528365584342","commenter_b":"@username. Kim kardashian has done nothing in her life compared to Trump. Except suck like 10 ninjas dikks.","commenter_a":"Haha, once again ch. 13 is being biased. Haven't y'all seen all the libtards going unhinged on social media. Or commie elected democrat officials too. Democrats are the ones talking non stop about the results of the election. And calling president elect Trump not their president. Now that's un-American and petty.","post_message":"One expert blames it on Trump's insecurity from losing the popular vote. Others say it's just Trump being Trump."}]
