[{"comment_id":"1544982162188475","commenter_b":"That's why I have your wife come over","commenter_a":"Yeah it changes kids it doesn't make them limp wristed liberals who don't know which gender they are . It makes them tuff , learn how to solve problems with others and gives them confidence!","post_message":"The more head blows a child sustained, the more changes were seen in their brain tissue, according to the study released Monday."},{"comment_id":"1326442960748782","commenter_b":"She looks too white and pasty...","commenter_a":"Hope she burns to a crisp","post_message":"Kendall Jenner looks sensational as she soaks up the sun (via Daily Mail Celebrity)"},{"comment_id":"10154583346243855","commenter_b":"Governor Brown will be on the right side of history!","commenter_a":"Big talk now. Let's see how mouthy he is when President Trump and the Congress cut off funds to states who harbor illegal aliens and otherwise defy federal laws. Can't wait to see CA in an even worse budget squeeze. Talk is cheap when others are paying your bills.","post_message":"Thank you, Jerry Brown! Read the full text of the California governor's anti-Trump State of the State address: @webpagelink"},{"comment_id":"1341394042564599","commenter_b":"so lets make america so scary and violent for them that they won't want to stay here. america is a big fat sow that they will feed off of till she dies","commenter_a":"Nice mike","post_message":"TheBlaze news update with Sara Gonzales"},{"comment_id":"1180801771932078","commenter_b":"Thugs v thugs - time for trump to go","commenter_a":"This should get Trump even more votes, they are showing their true character!! Violence and Thugs....the Bernie and Hillary supporters, \"Democrats\"!!","post_message":"GRAMMY WINNER URGES BLACK MOBS TO PROVOKE TRUMP VOTERS 'See what they do then. Keep touching us, motherf----r'"},{"comment_id":"1214214798614861","commenter_b":"From Chris (Author of this article) he mentioned \"dangerous batteries\". Well what did you know the whole world is putting blames on a company instead of the provider. Talented consumers indeed. Personally the problem probably lies with the performance output and the batteries supplying the phone. Note 7 is a heavy powerhorse so... overexerting the battery could damage it.","commenter_a":"This is worst than the BlackBerry disaster.","post_message":"BREAKING: Samsung ends production of the Galaxy Note 7."},{"comment_id":"1615187908768322","commenter_b":"She is big piece of shit","commenter_a":"Oprah will have to answer to God , I believe Judas turned his back on Jesus . Oprah will have her day","post_message":"WHOA! Take her off TV."}]
