[{"comment_id":"10153949050391037","commenter_b":"One word: uneducated","commenter_a":"Trump has had my vote from the start to finish ... Nothing anyone says can \" change \" my mind .... We need a business person in the seat to lead not be a tyrant.","post_message":"“During anxious times, it can be tempting to follow the siren call of the angriest voices. We must resist that temptation,\" Nikki Haley said."},{"comment_id":"611126095746235","commenter_b":"That's less people for Iran to jail and then demand ransom money for.","commenter_a":"Yeah they want to kill us but they want to take our money first good riddens who the hell would want to go there with those barbarians","post_message":"New post (Cancel your vacation plans: Iran bans US citizens, says US ban is \"obvious insult to the Islamic world\") has been published on Jihad Watch"},{"comment_id":"1028137907274272","commenter_b":"I just want to know all you people that are here illegally, if you love it here so much why haven't you went through the process of becoming legal? And if not then bye bye. I mean it's pretty fu**ing simple. Get legal citizenship or get booted back to wherever you came from. You need the United States, the United States doesn't need you.","commenter_a":"It's all fun and games until she gets deported with the rest of us.","post_message":"Meet Miriam Cepeda, a 24-year-old Latina and a self-proclaimed \"Trump girl\" campaigning for Donald J. Trump in Texas, 8 miles from the Mexican border. @webpagelink"},{"comment_id":"10153573613391037","commenter_b":"An interesting job for our President on how to get these kids off the street at night and up in the morning to go to school.","commenter_a":"If it's done the right way!!!!","post_message":"The president says helping America's minority youth and making sure young people have the opportunity to succeed is \"an economic imperative.\" Liz Goodwin details the push behind the My Brother's Keeper initiative."},{"comment_id":"794416220665090","commenter_b":"Eat a dick.","commenter_a":"One word...SCHMUCK","post_message":"PA President demands bodies of ‘martyrs’ killed in recent attacks, says Israeli public ‘deceived’ by leaders"},{"comment_id":"537465956461211","commenter_b":"You are a total BS'er bitch ...","commenter_a":"Total billshit. I am part owner of a restaurant and we don't have this problem. We have health care for all employees and it didn't hurt our bottom line. The owner is just greedy and doesn't care about the employees.","post_message":" don have that kind of money. So instead of 50 or 60 people without health care, we have 50 or 60 people that aren employed anymore. It makes no sense."},{"comment_id":"10152725766556636","commenter_b":"I know of at least one Christian religion that forbids voting. There's only a big deal being made about it because it's Islam. Having said that, I don't know what else this preacher has said.","commenter_a":"So voting is something that happend 1400 yrs ago.","post_message":"Apparently it's a 'sin'..."}]
