[{"comment_id":"10153820420328816","commenter_b":"they are whores","commenter_a":"without the John Doe investigation we never find out the Walker's deputy cheif of staff steels $50,000 from a Veterns organization, Walker and his bunch are the worse kind of pigs.","post_message":"Scott Walker signed legislation Friday curtailing the ability of district attorneys to use the John Doe law to launch investigations like the probes they have conducted of his campaign and his aides and associates."},{"comment_id":"10153640608237217","commenter_b":"All rights should be removed from these benefit shoppers. Refugees have an easy passage, it is only benefit shoppers that get into a boat. Look at the streets of Germany and Sweden now. Full of parasites loafing around with no intention of getting a job. The come for a free ride and have no intention of contributing.","commenter_a":"Almost all of the migrants in the Mediterranean are coming from Sub-Saharan Africa, who have no excuse to join Europe. It's been highlighted that most refugees from Libya (in civil war) have travelled to Egypt or Tunisia, instead of Europe. Even worse, they're just doing it for economic benefit (trying to get deep into Europe eg. Germany etc)","post_message":"The deaths are the result of three shipwrecks off the Libyan coast, UNHCR, the UN Refugee Agency says."},{"comment_id":"975573942535660","commenter_b":"I'm not American but,I live here and I love to live here!And Hope to be in army or something one day I think dems are so much smarter! Let's go dems!","commenter_a":"brain dead","post_message":"RIGHT ON! Bernie just hit it out of the park at the Democratic debate when asked if he's a capitalist."},{"comment_id":"10156995809880354","commenter_b":"Someone needs to tell that ugly old bitch to put some fucking clothes on.","commenter_a":"I have respect for this woman. She isn't funny and she is without class.","post_message":"Chelsea Handler's thirst for attention is seemingly unquenchable..."},{"comment_id":"10153941098352439","commenter_b":"pigs.","commenter_a":"Simple solution. Send them back home where they can pound sand. Better still, why doesnt even one affluent opulent oil rich middle eastern lingdpm take thrm in? Why not? Hypocracy. In Abu Dabi that even have free good stugfs gor those that don't have....","post_message":"In the wake of jihad slaughter, Western leaders and media elites hand-wring and rail over \"fear of reprisals\" against Muslims and islamofauxbia - myths to distract and defend the Islamic faith. When, in fact, it is antisemitic incidents that are at record levels. Anti-Jewish attacks are daily now. No one says anything about that because it is largely Islamic Jew-hatred. Respect it."},{"comment_id":"1298762416842950","commenter_b":"Actually W paints pretty darn decent pictures.","commenter_a":"nobody expected Bush to paint like a 5th grader. Okay, yeah we did.","post_message":"Don't expect him to stay home and take up painting."},{"comment_id":"1329423637100902","commenter_b":"She owns them.","commenter_a":"Ivanka you rock and you are a great representative of a Jewish woman and princcess and MOm . G-d bless you and your family .NOOne has a perfect family and you exemplify derecho eretz.","post_message":"LIBERALS HAVE CONCLUSIVELY PROVEN DURING THEIR ELECTION MELTDOWN THAT THEY ARE THE SCUM OF THE EARTH!"}]
