[{"comment_id":"1065116426845174","commenter_b":"She's thick. And frankly looks weird with the stretch marks photoshopped out.","commenter_a":"Ashley Graham, the model is size 16. She's NOT EVEN PLUS SIZE. That's what's wrong!!","post_message":"You decide..."},{"comment_id":"512454232283082","commenter_b":"To the person who said go back to Africa.... Pack your bags too & head back to Europe! Cuz white ppl ain't native to this land either. Dummy!","commenter_a":"Not worthy of my ear wax!","post_message":"Hip-hop legend Q-Tip is here talking about race and policing in America. Leave your questions in the comments."},{"comment_id":"10153506552374342","commenter_b":"She looks like a freaking man","commenter_a":"Looks like a dude","post_message":"We're getting our first look at the female shooter in Wednesday's tragedy in #SanBerardino."},{"comment_id":"1131647630206805","commenter_b":"I know. He's been promoting terrorism all throughout his presidency. The liberals are dead set on destroying this country. Obama is'nt even a citizen of this country. All of his records are sealed.","commenter_a":"This pos along with the president who endorses cair need to be locked up or shipped off to a Muslim country where they won't have any problems getting along with their fellow Muslim brothers. Muslims commit more atrocities than any other religion in the world and she has the nerve to call our servicemen and women murderers. This organization is a terrorist group and should be disbanded and everyone of them deported!!!!","post_message":"This is guaranteed to be the most vile and despicable thing you see all day..."},{"comment_id":"10153512778925667","commenter_b":"Life is like a camera. Just focus on what's important, capture the good times, develop from the negatives, and if things don't turn out take another shot.","commenter_a":"They should put him in the same cell as Clinton.","post_message":"Martin Shkreli could face additional criminal charges."},{"comment_id":"1224398304283560","commenter_b":"I'm not here to judge anybody but whoever has the experiences will ultimately become the President. It's a done deal and nobody can deprive a woman of what she is duely qualified for . Our next president of United iiiStates of America is president @username.","commenter_a":"Kitty cat ? Lolololol So Republicans want a pig who assaults women as the next president of the mighty US of A","post_message":"This is horrific. We cannot allow this man to become president."},{"comment_id":"949410461745800","commenter_b":"well said Bonnie","commenter_a":"I am from Middle East and full face cover has nothing to do with Islam, it is clearly oppression of woman. Disgusting. Those who say this is freedom of choice or religion should also be sympathetic to Nazi insignia or brutality","post_message":"What do you think?"}]
