[{"comment_id":"10153559486711130","commenter_b":"Shut that slave hole down.","commenter_a":"And another.... 💔","post_message":"This is the third whale that has died this year at the park."},{"comment_id":"1107945392631847","commenter_b":"Even though the Stupid bitch cuts my sandwiches diagonally.","commenter_a":"Bernie is in my dead pool. Die Bernie... The sooner the better!!!","post_message":"Here's actor Mark Ruffalo and director Matthew Cooke on why Bernie Sanders is the right candidate at the right time. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153600166447217","commenter_b":"^That is a true life goal","commenter_a":"@username And we're sat here watching tv and being casual XD","post_message":"Life goals."},{"comment_id":"10153352792949203","commenter_b":"Woman hating much","commenter_a":"They are very stupid people who deserve no sympathy. I'll bet drug dealers and mafia members get assaulted too.","post_message":"Porn stars are people too."},{"comment_id":"10154502973076756","commenter_b":"@username do u recognize this woman in the pic? She's a Bay Area demonstration machine! I want to BE her!","commenter_a":"Wow.","post_message":"\"[W]e lack confidence that Judge Persky can fairly participate in this upcoming hearing in which a male nurse sexually assaulted an anesthetized female patient.\" -- Santa Clara District Attorney Jeff Rosen"},{"comment_id":"10153882150921545","commenter_b":"Hahaha. Your an idiot lady!","commenter_a":"appalled by the comments on this article. this was a TEENAGE GIRL who was groomed and manipulated by ISIS agents via social media to leave her family to join them, not some mastermind terrorist who deserves to die. she is as much a victim as anyone else who has been killed by ISIS.","post_message":"ITV News reported Thursday that Sultana is thought to have been killed in May when a Russian warplane dropped a bomb on her accommodation in Raqqa, the de facto capital of the Islamic State"},{"comment_id":"10153771650684415","commenter_b":"Wake up!!? Fourty years of Democrats running this country..... Democraps running our country into the ground! EVERY AMERICAN CITIZEN WORKING PAYS 12% of his income to Social Security! Social Security is broke!!! People who have never paid a dime in ..are drawing on it, but they are going to reduce the benefits of those who PAID IN!!! Hmmm.... Only democraps think like that!!! @webpagelink","commenter_a":"Congress makes laws then the Govt turns around and will not enforce them thats why we slowly are losing America to Mexico...our immigration laws are not broken the Govt that will not enforce them is","post_message":"The First Amendment states: 'Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble …' yet despite these constitutional protections, speech-restrictive policies in our nation’s public colleges and universities remain. Today, I sent a letter to 162 public colleges and universities today asking them to update their free speech codes."}]
