[{"comment_id":"1725328477744790","commenter_b":"A blow job from what you call an ugly woman is still a blow job. We drank, screwed, and partied in cemeteries when I was a teenager.","commenter_a":"Cemetary, huh? Could be 'cause the kid didn't wanta be seen anywhere with such an ugly woman.........","post_message":"Police say that an officer caught 49-year-old Kelly Aldinger in the act with a 17-year-old student at Easton Cemetery."},{"comment_id":"1082992428420186","commenter_b":"She will never be in jail","commenter_a":"How can she send people to jail from her prison cell?","post_message":"Dangerous person!"},{"comment_id":"1174271395944428","commenter_b":"The real Hillary afraid that the porn industry wont donate money to her or maybe they have some film!","commenter_a":"Perhaps under the advice from Bubba, he's planning ahead! Lol","post_message":"Hillary Clinton refused to sign a pledge Monday that would protect children from exploitation by the porn industry."},{"comment_id":"10153181655947452","commenter_b":"Said the hipster wannabe as he hangs out at Starbucks thinking it improves his social status.","commenter_a":"Anybody who goes to Starbucks is an idiot. At Christmas or any other time of year.","post_message":"#MerryChristmasStarbucks: Starbucks' new design for its iconic red holiday cups has some customers feeling less than cheery, with one man saying the company \"removed Christmas from the cups because they hate Jesus.\""},{"comment_id":"564066700424981","commenter_b":"She's a cunt.","commenter_a":"Please, it's time to serve her!","post_message":"It's about time!"},{"comment_id":"1336076649746676","commenter_b":"It doesn't bother me at all","commenter_a":"Why does everyone need a day? Doesn't this kind of thing really inadvertently promote bias by constantly bringing up the differences between us all? We are all human and we all have strengths and weaknesses in different varieties this should be a strength among us not a divisive problem. If everyone would stop talking about it so much things would get much better. Make your decisions about people on an individual basis.","post_message":"Today is International Women's Day and to celebrate, we will be posting a series of images commemorating extraordinary women in the field of science that we believe you should have heard of. #WomenYouShouldHaveHeardOf Image courtesy Jewish Chronicle Archives/Heritage-Images."},{"comment_id":"10152762362423645","commenter_b":"smh...","commenter_a":"Marlo","post_message":"Wow. That must have been a strange night. Kurt Busch testifies that his ex-girlfriend is a 'trained assassin' who returned from a mission in blood-splattered gown."}]
