[{"comment_id":"10153091950239205","commenter_b":"IF YOU'RE ILLEGAL ALIENS IN AMERICA, THEN YOU HAVE NO BUSINESS HERE, JUST LIKE MEXICO TREATS AMERICANS! PEOPLE WHO WANT TO COME HERE LEGALLY ARE WELCOMED.","commenter_a":"The mexican solution (Donald Hitler )","post_message":"Donald J. Trump's detailed and foolish immigration plan explained."},{"comment_id":"10153465334273132","commenter_b":"This case may seem cut n dry but so much time has gone by plus they never found his body.. I would not want to be a juror on this case","commenter_a":"They had a convict in prison who was even more than likely this little boy's killer. I think this is why this guy's 'confession' is so questionable. The investigators refused to admit they made a huge mistake, not surprisingly. I don't think they have the right guy, as for the real killer, I believe he died in prison. The whole thing is tragic.","post_message":"The jury has already been deliberating for 11 days."},{"comment_id":"10153190678386116","commenter_b":"this is why we dont let kids vote","commenter_a":"Little misdirected President can't do anything until the GOP congress recognizes there is a problem......","post_message":"Wow."},{"comment_id":"936977403012167","commenter_b":"If they are illegal, how can they vote ?? Just askin'","commenter_a":"Hell no","post_message":"More than 1 in 3 Americans believes illegal aliens should have the right to vote in U.S. elections, a figure buoyed by the majority of Democratic voters who favor the idea. @webpagelink"},{"comment_id":"10156408466705354","commenter_b":"This woman is so disgusting! I can't even stomach accidentally surfing and the view is on for the second it takes for me to change it!","commenter_a":"Don't watch that show. Should be taken off and replaced with Mr. Roger's Neighborhood reruns.","post_message":"Maybe they should open every show with a preemptive apology for all the mind-blowingly stupid things they're sure to say. VIDEO below of their latest..."},{"comment_id":"1828581784096492","commenter_b":"You can be my snowflake anytime brother❤ the majority","commenter_a":"Snowflake. Go ahead. You can call me a snowflake. I don’t mind. In fact, I kind of like it. A snowflake travels through the atmosphere molded by the climate and emerges as a distinct crystal. Shaped by its environment but maintaining a steady path to become grounded on this earth. I am not the only snowflake. There are 65 million of us and together we are a blizzard. A sustained storm enveloping everything it its path. Clearing the air and blanketing the earth in a fine powder. Covering over the dirt and the grime along with strong winds exposing corruption, bigotry, misogyny, nepotism & cronyism. 65 million snowflakes are an avalanche. Once triggered, we are unstoppable. Accelerating rapidly and gaining strength. Overcoming all resistance. Scouring the landscape and hauling away the detritus and the scum. Leaving no place for prejudice and hatred to gain a foothold. Tearing down walls and ...","post_message":"Robert de Niro just said it ALL about Trump! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1413445192014321","commenter_b":"You girls are funny!","commenter_a":"Come on! This is his ploy to try and intimidate Clinton and throw her off her game. Who's he going to announce next? Monica Lewinsky as Secretary of State??","post_message":"This couldn't be worse."}]
