[{"comment_id":"10153557407432964","commenter_b":"Did they really come legally? I think not. America was first inhabited by the Indians. Christopher Columbus discovered this country by chance and we were not invited, so legally I would think not. We took over, slaughtered many Indians in the take over. So please don't go there. If immigrants come to America I agree we need to now come legally and apply for citizenship, but that is not the issue. The issue is the children born here! This is where they were born and with that they are American! Period!","commenter_a":"I'm not sure I agree with that statement because regardless of whether their parents are immigrants, they too have the ability to become Americans. The children who are born in this country are born on American soil and should be considered Americans, just my thoughts. After all we were all once immigrants and at one time even if we ourselves are not immigrants, we were born on American soil from an ancestry of immigrants and for that reason we too are Americans. I agree with many things about you Senator Vitter, but I have to say on this I don't agree.","post_message":"I think it's flat out wrong for children of illegal immigrants to become U.S. citizens just because they were born here, especially when it’s justified using a false technicality of the Constitution. I made this argument in a guest column in USA Today. Read more:"},{"comment_id":"161828217554597","commenter_b":"Racist bitch","commenter_a":"The racist white ppl that support Trump never show black ppl in a good light!! Never!! @username is the most racist of the right-wing, white supremacist sites!","post_message":"After the Louisiana flood, this man started wondering when the help from Black Lives Matter and Black Panthers would be arriving... The TRUTH is devastating..."},{"comment_id":"1118814734807982","commenter_b":"174742062548592helle Tenney let it first be understood I can care less for evil feminist. My point is why go to a frat house that is known for Alcohol drugs and loose women having sex up stairs, when you know inappropriate things always happen in places like that. Secondly, I'm sure she was there drinking in an unsafe environment but I don't condone anyone being raped but we should ask ourselves why the Hell do women keep going to places that are historically unsafe for women? Lastly, women lie so much about rape and other things that no one knows when they are telling the truth. There has been several times when men have been falsely accused of rape and we found out later that she was just trying to cover up the fact that she decided to sleep with the whole football team at once. I see the police reports ...","commenter_a":"Ok but why was she even there in the first place?!!!!!! Why do girls go into Frat houses?!!!!","post_message":"Sexual assault on US college campuses is a major problem and we can't ignore it any longer. In an exclusive interview, US Vice President Joe Biden outlines how he's leading the charge to change the way we fight this epidemic by going straight to the source. Get the full experience at mic.com/enough"},{"comment_id":"741677189266873","commenter_b":"Really Rubio you must have a small dick. I feel sorry for your wife.","commenter_a":"Grow up, ! You are acting like a middle school boy.that is why you won't get anywhere","post_message":"Uncool. A new Rubio low...."},{"comment_id":"861353807244021","commenter_b":"she's a nut fix her she don't need any more kids keep her in prison to the max time","commenter_a":"Kill the witch or let me at her. Wtf! 😡","post_message":"WARNING: The details in this story are extremely graphic. A 26-year-old Missouri mother was sentenced to 25 years in prison for the horrific death of her 4-month-old daughter. @webpagelink"},{"comment_id":"10153286881869197","commenter_b":"the mother better be caring about who next door than what on facebook the people she see everyday","commenter_a":"That not discipline that torture and making a mockery of her child in front of the world what if she cause harm to herself mom can discipline at home not on Facebook","post_message":"VIRAL VIDEO: A 13-year-old girl secretly posted racy photos to #Facebook. Check out what her mother did when she found out: @webpagelink What do you think? Too harsh... or effective punishment?"},{"comment_id":"1642472956011827","commenter_b":"Hillary Clinton is against Christ and she is for anything illegal immigrants bring her money. .","commenter_a":"What would you have us call them, Hillary? They are in our country illegal,,,duh.","post_message":"Hillary Clinton says the term \"illegal immigrant\" is offensive and shouldn't be used. Is she right, or is this political correctness gone too far?"}]
