[{"comment_id":"10153243300499087","commenter_b":"She's a flaming idiot","commenter_a":"She is one sick BITCH !!!!","post_message":"\"I am a devout, practicing Catholic. I’m a mother of five children. When my baby was born, my fifth child, my oldest was six. I think I know more about this subject than you, with all due respect,\" Nancy Pelosi told a CNS News reporter. WATCH:"},{"comment_id":"10153990406082293","commenter_b":"@username apparently you believe so easily what Hillary says. She is a vicious Evil woman who cares about Money and Power and no one else. I have been around for all the Hillary Scandals and every one of them will be coming back at her during the next few months. I don't know how this woman can sleep at night for what she has done.","commenter_a":"She has been held to a higher standard. Republicans have spent decades trying to pull her down. #ImWithHer","post_message":"Hillary Clinton's honesty problem is growing."},{"comment_id":"1231714623549367","commenter_b":"She will fit in better there, anybody who watched Fox on election night knew how desperately she wanted Hillary to win!","commenter_a":"Good bye bye democratic stooge","post_message":"BREAKING: BUH-BYE MEGYN…The Woman Who Miscalculated Her Power With Viewers Is Leaving FOX To Join Liberal, Anti-Trump NBC"},{"comment_id":"10153129658039255","commenter_b":"Bring him down and send the drunk home!","commenter_a":"The dems and the President shoul not give in to his blackmail. Let them shut down DHS, send the National Guard and Reserve to the airports and train stations. Cancel planes and trains as necessary, especially those leaving out of or returning to DC. Let the seditionists suffer for as long as it takes...","post_message":"This is as good a time as any to bring him down."},{"comment_id":"10153321750847439","commenter_b":"LMAO love it! She is a low life who feeds on hatred","commenter_a":"It takes a lot for an atheist such as myself to be bothered enough to come on this page and attack a low life like Geller who has zero intelligence and is followed by a bunch of losers who are the love children of their mothers and uncles, but hey, we all gotta do what we gotta do.","post_message":"Amazing heroes providing security for free speech conference #motoons #AFDI"},{"comment_id":"10153400709859474","commenter_b":"she will not tell the truth...","commenter_a":"What difference does it make","post_message":"Breaking: Hillary Clinton to testify before Trey Gowdy and the Benghazi Select Committee. Share to demand the truth!"},{"comment_id":"10153782445088984","commenter_b":"Interesting that this is the same city where the Muslims tried to impose Sharia law and got shut down by the mayor, a woman at that!","commenter_a":"This whole thing looks like it was aset up from the beginning, but too many people are jumping to conclusions before the facts are out ...","post_message":"The mayor of Irving, Texas -- the home of the Muslim \"bomb-clock\" boy -- just came forward with a shocking statement about the boy and his family. What she revealed shows exactly what's going on here. This was a setup from the first, and this mayor refuses to stay quiet about it. She needs our support."}]
