[{"comment_id":"1774993129450173","commenter_b":"Ask him about carpet bagging the truth by billionaire media monopoly","commenter_a":"Thanks for discussion very informative","post_message":"Special debate coverage: Amy Goodman and Nermeen Shaikh host a pre-debate roundtable from 8-9PM ET with Kimberlé Williams Crenshaw, Melina Abdullah of Black Lives Matter - Los Angeles, Gyasi Ross, Soraya Chemaly, The Intercept's Lee Fang and Rashid Khalidi, followed by an expanded debate giving third party candidates a chance to respond to town hall questions. Jill Stein of the Green Party joins us from St. Louis starting 10:30PM ET. Tune in at democracynow.org/debate & post questions for our guests using #expandingthedebate."},{"comment_id":"662547200602525","commenter_b":"When she is burning in hell she will want to change her mind.. buy the way. Put some damn clothes on you look like a tramp.","commenter_a":"She is so gross!","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'. This is unacceptable, we stand against Miley 100%. Do you agree Miley should be kicked out of the country?"},{"comment_id":"662343567228023","commenter_b":"Great Woman!","commenter_a":"Wonderful tribute","post_message":"I wanted to highlight a few women in my life who inspire me every day. My wife, Columba, for her work to curb domestic violence and for so much more. My mother, Barbara, who has been a tireless advocate for literacy for a quarter century and Toni Jennings, who was a fantastic partner and Lt. Governor of Florida. These women are all examples of what can be achieved when we #LeanInTogether"},{"comment_id":"1069713516429844","commenter_b":"My Father and his family came through Ellis Island. They had to have a sponsor in the United States who guaranteed them a place to live and support until they were self-supporting. They were screened for disease. My Grandmother was almost refused because she was sea-sick for the whole journey. The government officials had to determine that it was only sea-sickness before she was admitted. Now, we have no idea what illnesses are being brought in to OUR Country through all these illegals and obummers immigrants. No wonder illnesses that we have virtually eliminated are cropping up now.","commenter_a":"Absolutely the way that it should be done!","post_message":"America's Freedom Fighters"},{"comment_id":"962229497130510","commenter_b":"LoL","commenter_a":"Hello!?! Everyone has a personal tracking device on them at all times now...it's called a cellphone. They know where you are every second of the day. Even with GPS turned off. They can turn in your camera or mic at will....and they have, do, and will continue to violate your rights with zero accountability.","post_message":"Enjoy your first private phone calls in more than a dozen years. @webpagelink"},{"comment_id":"1296712253679455","commenter_b":"Domestic Terrorists should be punished to the full extent of the law.","commenter_a":"Bundy, it's time to pay the piper !","post_message":""},{"comment_id":"10154910667241162","commenter_b":"We both like thick @username, but for some strange reason she wanna be thin.","commenter_a":"Demetrius DaInfluence Hardy and @username told y'all it was debatable.","post_message":"We all agree that Chicago has the best pizza - but the debate in our newsroom is over deep dish or thin crust. What your pick? Our Hungry Hound did some research for you: @webpagelink"}]
