[{"comment_id":"10156429610305354","commenter_b":"No \"Refugees\" from Muslim countries!","commenter_a":"Kill all 15 on the spit","post_message":"So much for Obama's crackerjack \"vetting\" process..."},{"comment_id":"10154102342209607","commenter_b":"Melania trump was a model","commenter_a":"And my question is why do we care? We elected a man with no political experience and our soon to be First Lady have nude pics floating around on the internet....I mean at this point does it matter if his family moves in? Everything about this is...unconventional lol.","post_message":"QUESTION OF THE DAY Do you think Melania and Barron Trump should move into the White House in January? Tell us your thoughts and they may appear live on Fox45 Morning News."},{"comment_id":"544761025684245","commenter_b":"Liars don't smile a lot.","commenter_a":"What Killiary considers a welcome endorsement would be considered a sin and disgrace to any decent human being. Furthermore , what satan's secretary calls the \"extreme\" position of Republican candidates on women's health is really a quite normal position for any one who wants to protect a babies life and quite possibly the life of the mother as well. Of course that position endangers the finances of planned parenthood so naturally Ms. Richards , who would lose her lucrative job if abortion is outlawed, wants to help elect someone who favors her cause. May God have mercy on Clinton, Richards and all like them who promote the culture of death.(MA)","post_message":"The endorsement marks the first time Planned Parenthood has waded into a presidential primary."},{"comment_id":"1354934454518383","commenter_b":"She's disgusting!","commenter_a":"Hillary ! Explain to this young girl why you support second trimester abortions ( ripping the body out limb at a time up to Five minutes before natural birth ) I'm not with that !!!","post_message":"This team has so much to be proud of. Whatever happens tonight, thank you for everything."},{"comment_id":"10153701497529740","commenter_b":"Ben what is the answer. I'm sure more violence isn't but then what. Flowers, prayer, a handshake. These people, I use that term loosely, are predators. How do you stop a predator? You can try and take the source of the problem. Drugs for the money and high. Its a start. Not as easy as you might think.","commenter_a":"Tell the felon to STFU. Chicago is out of control. Most of us are not in that city's position. You can't control a city like that unless you show aggressive behavior and make these criminals know you mean business. This might not work in most places but Chicago is falling apart.","post_message":"The highly awarded Cmdr. Glenn Evans who has thrown himself in front of bullets to save fellow officers is now under scrutiny for same aggressive tactics that he's been praised for."},{"comment_id":"10153661436973352","commenter_b":"She just ain't shit","commenter_a":"I dont get it.. She was turning herself in to be locked up?!? And left the kids in the car......","post_message":"Mother caught leaving 1- and 6-year-old children in a hot car…while she was turning herself into police for doing the SAME thing last month. SHOULD THEY TAKE HER KIDS AWAY FROM HER?"},{"comment_id":"1277480212306141","commenter_b":"Yeah, she's a racist.","commenter_a":"STOp THE HAte","post_message":"CLAREMONT COLLEGES “Students Of Color” REFUSE To Live With Whites: “I don’t want to live with any white folks”…”Don’t see how this is racist at all”"}]
