[{"comment_id":"1208679672504821","commenter_b":"She is the most disrespectful woman in the world","commenter_a":"How sick","post_message":"IN CASE YOU MISSED THIS YESTERDAY: @webpagelink"},{"comment_id":"913202388702552","commenter_b":"For women, there's always danger no matter how much you use your head.","commenter_a":"No danger if you use your head. Crime is down in most of the civilized world. The news cycle is just longer.","post_message":"\"Are you alone?\""},{"comment_id":"594411744025341","commenter_b":"You probably have one between your legs Shannon!","commenter_a":"Who cares! It's an inanimate object! Ever heard of idolatry? This is it!!!! True followers of Christ don't kneel before a statue, they kneel before the one true God.","post_message":"What does sheer animalistic Muslim hatred against Christians look like? Story below."},{"comment_id":"10154663245784657","commenter_b":"Who wants to watch a liar. He is so delusional, he should have been removed from office years ago. Except Congress has no spine !","commenter_a":"Heard one from this 'fella, you've heard them all !!! Only said \"I\" 84 times in this one, --- he's gettin' better ???","post_message":"Obama, the celebrity president, may not be as popular as he thinks he is."},{"comment_id":"1015232928526293","commenter_b":"will someone call the home and tell them a resident is out running loose?","commenter_a":"makes no sense, idiot","post_message":"Nancy Pelosi identified what she called the \"three G's\" – reasons why white males favor Donald J. Trump over Hillary Clinton. @webpagelink"},{"comment_id":"10154333518999641","commenter_b":"It's about time america should have their own female leader, if they truly wanted a real change, that lady touch would make a real difference for a great nation to reach further.","commenter_a":"VOTE FOR HiLLARY CLINTON 2016 . Hillary for America","post_message":"\"We just put the biggest crack in that glass ceiling yet.” - Hillary Clinton appears via satellite at DNC in hat-tip to history @webpagelink"},{"comment_id":"1528594670781352","commenter_b":"Death penalty. Nothing less. Deporting them isn't going to change anything. They'll be back and will do this again.","commenter_a":"I love Obama","post_message":"If we don't have a border, we don't have a country. I want people to come in LEGALLY and follow the laws of our great country!"}]
