[{"comment_id":"717743675080590","commenter_b":"shes an ugly cunt that smells of camel piss","commenter_a":"Who is she ? Shariah ! Who's she? @username David A Doran","post_message":"FINALLY, We are taking back our country from the entitled Muslims that Obama let do whatever they want and try to tell us what to do!! SHARE if you agree that Sharia Law should NEVER be allowed in America!!!"},{"comment_id":"1036436079751842","commenter_b":"Now that's a face only a mother could love!!!! What a mutha!!!","commenter_a":"BS!","post_message":"UNREAL: Thug Rapper Calls For Presidential Candidate To Be Slaughtered- Media Silent (LISTEN) Could you imagine if a white guy did this to candidate Obama? @webpagelink"},{"comment_id":"950475968345485","commenter_b":"she is fuking fat end off...","commenter_a":"I'm sorry, but fat people are NOT hot, sexy, or beautiful. Just ask a obese persons heart how healthy it is.","post_message":"'I want to challenge society's perception of beauty' - Tess Holliday"},{"comment_id":"10153378828583984","commenter_b":"Yes","commenter_a":"Yes","post_message":"The Obama Administration’s pattern of rubber stamping these cases has significantly increased this percentage in the US. Do you support securing our border?"},{"comment_id":"10152995429007507","commenter_b":"So you won't procreate?","commenter_a":"Ha-ha.","post_message":"Clock started...."},{"comment_id":"10153442006357061","commenter_b":"Sometimes a girl just needs help getting all gorgeous for the day.","commenter_a":"Ahhhh. The small amount of time this took will pay dividends in the future to this little gem. We should all make investments like this.","post_message":"Deputy helps 2-year-old toddler put her pants on after she calls 911 while struggling to get dressed. \"I'm just grateful for the deputy and her kind, wonderful heart.\""},{"comment_id":"10154001737221509","commenter_b":"Because marriage is between a man and a woman, look up sodam and gamora","commenter_a":"Why has she not been fired? Seriously, find another job if performing your duties as a PUBLIC SERVANT conflicts with your religious beliefs. BTW, homosexual marriage is NEVER mentioned in the bible.","post_message":"This Kentucky woman is still refusing to issue marriage licenses to same-sex couples on \"God's authority\" -- and in defiance of the Supreme Court. @webpagelink"}]
