[{"comment_id":"10152950876076130","commenter_b":"They're such bitches.","commenter_a":"Emma Green @username","post_message":"\"I cleaned the counter for you.\""},{"comment_id":"829662497101615","commenter_b":"prizon don't send them back , they will just return and do it again, either way we will be paying tax dollars for them so I would rather do it for them being in jail instead of welfare and what ever else obama is giving them.","commenter_a":"Now take away their real name and give them a number, prison number that is","post_message":"OBAMA’S ILLEGAL ALIENS ARRESTED IN MISSISSIPPI FOR IDENTITY THEFT! #NoAmnesty Just spread this like wildfire Dean James Americas Freedom Fighters"},{"comment_id":"985543698152769","commenter_b":"This old lady sounds like she's craving for big nigga dick :)","commenter_a":"See ya bitch... Cracker ass Cracker!","post_message":"Like housemother like house sons."},{"comment_id":"10153495487996770","commenter_b":"It's never a joke untill they come for you, then you want to cry, I'm just joking. So is that prison cell dumbass.","commenter_a":"This is just another instance, where Obama should be stepping up to this kind of talk!","post_message":"A #BLM sympathizer posted \"Death to all White Cops\" on Facebook but was completely unprepared for what immediately happened next. Then she did something even dumber!"},{"comment_id":"466299333581093","commenter_b":"You sound like a true liberal","commenter_a":"Philip Sjostrom","post_message":""},{"comment_id":"10154011043376615","commenter_b":"@username fighting for these POS muslims till the end. Listen hag, why dont you leave for Somalia and see how that works out 4 you. Liberal hag!!!!","commenter_a":"The hate and racism on here is disgusting! Most of you don't even know what's happened, you're just ready to jump in with your white supremacist rhetoric. Makes me sick.","post_message":"WATCH LIVE: Officials are providing an update on the victims in the attack at The Ohio State University. WPXI Aaron Martin is in Columbus and will have the latest developments on Channel 11 News at 5:00. MORE DETAILS: on.wpxi.com/OSUAttack"},{"comment_id":"1799616930271434","commenter_b":"Liar!","commenter_a":"The more she says it the less I believe it.","post_message":"\"Certainly my meeting with President Bill Clinton raises questions and concerns.\" Attorney General Loretta Lynch says says she will accept the recommendations of the FBI on whether to pursue charges against Hillary Clinton."}]
