[{"comment_id":"10153818246882293","commenter_b":"Leave it to mysoginists to make the case for feminists better than any feminist could.","commenter_a":"Women, get over it! You are way too thin-skinned, take yourselves too seriously, and get offended at the drop of a hat. Loosen up and quit being so tight-assed.","post_message":"If 75 percent of women told researchers they view Trump unfavorably, who is it that backs Trump?"},{"comment_id":"10153255952000950","commenter_b":"Isis days are numbered. They are not long for this world. Believe it or not theres more important fish to fry","commenter_a":"I think he's so creative!! Instead of CNN just cashing in on the money for no good reason - let's do something for those that have done so much for this country! You guys who think this is Mr Trump being cocky or greedy just don't get it...","post_message":"Donald J. Trump is demanding that CNN — the host of the next GOP debate — pay him $5 million dollars to participate, with the proceeds to be donated to veterans."},{"comment_id":"10154064032541509","commenter_b":"Because Muslims should NEVER be president of the USA period!","commenter_a":"So what if Obama is Muslim? And then what!?","post_message":"Donald J. Trump under fire for not challenging anti-Muslim comment from a supporter: @webpagelink"},{"comment_id":"635476119976300","commenter_b":"And we are apparently buying her cigarettes for her, good for nothing jackass. Where are the FATHERS, let those suckers pay for their babies they fathered!","commenter_a":"Deport !","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"788216704618375","commenter_b":"Sure he is Jewish but how could a man of his intellect believe the cartoon that created this shithole country?","commenter_a":"Put on your yarmulka even though it's not Chanukah....welcome to Israel.","post_message":"Welcome to Israel, Jerry Seinfeld 😍😍😍"},{"comment_id":"10153046136906615","commenter_b":"make her take a leave of absense...without pay. If she wins, pay her retroactive.","commenter_a":"She will not resign. The minute she does. The Commonwealth will no longer be responsible for her attorney's fees. Conversely, this charade may turn into a \"where there is smoke, there is fire\" ordeal. Also thinking when she goes down. She is taking people with her, yet I believe the \"machine\" will do their best to mitigate future collateral damage!","post_message":"JUST IN via WPXI Joe Holden -- Pennsylvania's attorney general has been ordered to trial on all charges including perjury, obstruction..."},{"comment_id":"1193969757300354","commenter_b":"I'm not a supporter of either, and race has nothing to do with it. So for you to bring it up makes you the racist. Watch TV, read the newspapers... There are increases numbers of illegals coming across our borders (Chinese were the latest reported in increased numbers over Mexican border), so it makes no difference where they are from, but where they are coming in through! California's politics is way out of whack with the rest of the country, and the demographics show which and where. That demographic could be put up across the country on every state and the trend would probably be the similar.","commenter_a":"more welfare& illegals more clinton... go figure!","post_message":"Sanders performed better than Clinton in California's northern, rural counties, which also tend to be whiter than the rest of the state."}]
