[{"comment_id":"10154446560569087","commenter_b":"....and you prefer a sexual deviant,foul mouthed fraud who could phucking care less about the working men and woman...this phucking billionaire builds multi million dollar condos and private country clubs that only the very rich could afford....so keep drinking the lumps poison koolaid and watch as America slides into hell...","commenter_a":"What the fuck did you and Obama show us in the last 8 years, other than treason, socialism, and the lack of and balls what so ever.","post_message":"Vice President Biden responds to Trump's tweets: \"Grow up, Donald, grow up. It's time to be an adult.\""},{"comment_id":"783948935040375","commenter_b":"I have seen girls wear a lot worse. Actually the dress is beautiful.","commenter_a":"She's beautiful and the dress is fine shame on the teacher for saying such a thing the teacher should have minded her own business !!!","post_message":"Do you have a problem with this dress? This young lady was shamed for wearing this dress to her senior prom. A teacher claimed it was too revealing and said \"Us big girls gotta cover up.\" More: @webpagelink"},{"comment_id":"10154789481757235","commenter_b":"@username Pls don't compare Trump to pigs. Pigs are wonderful.","commenter_a":"Fantastic job, Trump Team. Scare the crap out of everyone, then disavow. Keystone Kops got nothing on you.","post_message":"AWKWARD!"},{"comment_id":"10153852304249160","commenter_b":"Trump deport this foreigner","commenter_a":"Obama and Hillary need to get out of Washington & Politics period!..both are criminals and traitors to the American people!.they can take that communist Sanders with them. Trump 2016","post_message":"Hillary Clinton's numbers are collapsing."},{"comment_id":"10153186576481162","commenter_b":"I'm glad she won't be crushing any more babies.","commenter_a":"I happy 4 her but i want to do it with out surgery","post_message":"HALF-TON NO MORE: She is the woman once dubbed the \"Half Ton Killer,\" accused of killing her nephew by rolling on him with her 1,000-pound frame. But after clearing her name, she has a new lease on life, a smaller body, and is motivating others with her weight loss story. AMAZING TRANSFORMATION---> @webpagelink"},{"comment_id":"1768726713375361","commenter_b":"I agree tone down a little and let her hang herself.!!!!!","commenter_a":"I think Trump would be the best of the 2 evils, but with all his smart remarks it looks like he is trying to help Hillary. He needs to tone down and run on his own platform and let her hang herself.","post_message":"YES!!"},{"comment_id":"1813669392186653","commenter_b":"I believe the only way to stop 5.O Is to kill em all Or stop bitch in, the popo gotta Gun n they Evil law,,Bt every nigga in the hood can shoot back,so kill em before they kill one u","commenter_a":"America you're gone so far.","post_message":""}]
