[{"comment_id":"1789421224648085","commenter_b":"Ohio RED","commenter_a":"Trump 2016 #MAGA vote","post_message":"Donald Trump rallies at Michigan"},{"comment_id":"459815194143521","commenter_b":"I personally just don't give a shit. They can walk around naked as a jay bird for all I care. But I'll bet other women would be the ones that bitch the loudest.","commenter_a":"this means that we can have video games and movies with naked women in them ??","post_message":"Female nipples are causing an internet storm & here's why: #FreeTheNipple"},{"comment_id":"10153648565856320","commenter_b":"Gather them up like cattle. Send them to Iran or where ever and let them find isis","commenter_a":"Just stop with the protests and move on. If they only knew how ridiculous they look continuing to honor a criminal.","post_message":" recent acts of violence will not be tolerated in a community that has worked so tirelessly over the last year to rebuild and become stronger. - St. Louis County Executive Steve Stenger State of Emergency issued in St. Louis County, Mo., as they prepare for a second night of protests in Ferguson. More Details: @webpagelink"},{"comment_id":"10152954070746336","commenter_b":"She is an idiot","commenter_a":"More hot air.","post_message":"In a speech at the The Brookings Institution on Friday, Obama's National Security Adviser Susan Rice said while ISIS is dangerous, it is not a threat of \"existential nature\" like World War II or the Cold War. @webpagelink What do you think of her comments?"},{"comment_id":"10153840856185950","commenter_b":"Luckily that woman is not running @username, I wouldn't vote for her either!","commenter_a":"If you believe this false report you're an idiot. If you vote for Hillary Clinton you're an idiot. After all these lies and scandals surrounding this woman I can't see too many bright people voting for her. Trump's going to be our President!!!!!!","post_message":"Hillary Clinton's expansive lead is due to support from women and non-white voters, according to the survey."},{"comment_id":"1114872955238500","commenter_b":"Dumb Bitch","commenter_a":"I'm rich. No I'm trans. No I'm rich. No I'm trans. Ahhh!","post_message":"um... Caitlyn Jenner Donald J. Trump"},{"comment_id":"10154018738645736","commenter_b":"Isn't that gorgeous.","commenter_a":"We need some housing Kate Brown.","post_message":"People are still flocking to the Beaver State."}]
