[{"comment_id":"467385036785410","commenter_b":"Bitch shut the fuck up and close your dam legs and get a job Iike everyone else does","commenter_a":"No. I worked for more than 30 years before making $15.00 an hour.","post_message":"Should Blacks Be Compensated For Slavery? Comment 'yes' or 'no'."},{"comment_id":"10153369157063984","commenter_b":"Fire them all and make new hires sign a contract that if they are caught stealing anything they will pay back double the amount of the theft. The citizens work hard for their money and it is the taxes they pay that keeps those in Washington working.","commenter_a":"Hey, as long as they're paying for their gambling and \"adult entertainment\" out of their own pockets, well..... that's between them and God! But, if I'm paying for any part of it, then \"nail them to the wall\"!!!","post_message":"This has got to be a big embarrassment, and they probably thought they'd gotten away with it..."},{"comment_id":"822921484411860","commenter_b":"Run him out of America or sent him to Islam for good !","commenter_a":"Absolutely YES! Police are bound by laws and orders that do not allow any other real form of expressive protest. This sends the message loud and clear. It is also a great honor of solid support to the murdered officer whose Mayor helped provide the hostile environment in which this officer was murdered.","post_message":"Was this the right move?"},{"comment_id":"363912913812223","commenter_b":"This LOSER should not even be in this country!!!!!!","commenter_a":"I say disarm the cops on the same day that this turd becomes a vegitarian!","post_message":"Michael Moore Demands Cops Disarm!"},{"comment_id":"1775780972691266","commenter_b":"Andrea Lynnette no way in hell.","commenter_a":"To all the people harping about how \"historic\" the DNC nomination is: There is nothing empowering about this, and by saying otherwise, you are setting the next generation of American women up for failure. You're telling them that it's okay to lie, cheat, and steal, so long as it breaks the glass ceiling. You're telling them that it's okay to stand behind an unrepentant philanderer so long as it is politically expeditious. You're telling them that one does not need to take a principled stance on any issue in order to be successful; one only needs to adhere to populist notions. The only way in which last night was historic is in the sense that this marks the first time in American history that a candidate won the nomination under FBI scrutiny. This is also the first time in which an entire political party was caught actively sabotaging a candidate. ...","post_message":"Democratic Party nominates Hillary Clinton. Your reaction?"},{"comment_id":"904311766324849","commenter_b":"How do dicks like this get rich?","commenter_a":"Wow, what a dick!","post_message":"All I can say is that this guy is a total douche. What's your response to this video?"},{"comment_id":"10153259644748984","commenter_b":"Counting the days when that POS Imam con black theologist of hate is out of our WH!","commenter_a":"Can you say\" concealed carry\"?","post_message":"Let's hope police catch this creep and wipe that cocky smile off his face!"}]
