[{"comment_id":"10155208349228690","commenter_b":"JEWS also believes in exactly the same GOD we worship,,,the one and only,,,,,They call him Hashem,,,,and have other name in Hebrew,,,,ISLAM allows MUSLIMS to EAT koshered MEAT ,,or animals slaughtered by Jewish rituals,,because they also recite name of our / their GOD,,,,,so this MEANS ,,Islam has accomadated both MUSLIMS JEWS christians to LIVE side by SIDE,,,understood,,but ones who LIE may NEVEr admit this,,,","commenter_a":"They steal their land, they're destroying their houses, they're spoiling their olivers, they're arresting children and abuse them, they're using chemical weapons against them, they're isolating them, making them starving, they're bombing hospitals, ... And they're blaming palestinians for throwing them stones and hating them ! Should they give you flowers?! Go ahead Palestinians! May Allah bless youuu","post_message":"Eshaq Abu Jibneh suffered the injuries in a brutal attack in a West Jerusalem public square last summer, belatedly recognised by Israeli authorities as a hate crime."},{"comment_id":"10153059465629614","commenter_b":"Just because u are a police dose not mean that u have the right to break the laws n u say that police need a break well who give use a break","commenter_a":"She doesn't no her traffic sings lo hahaha","post_message":"A sheriff deputy is under investigation after cell phone video showed her getting into a patrol car that was parked in a disabled parking space at a Circle K store in Sacramento. always park in handicap when you not on a call? A man can be heard saying in the video. allowed to get breaks, the deputy replies. The Sacramento undersheriff said he was disappointed and that punishment could range anywhere from documented counseling all the way to termination. Watch KTLA video here: @webpagelink"},{"comment_id":"1032739630099842","commenter_b":"Bigotry must be confronted every time it raises it's ugly head. Shamefull Republicans","commenter_a":"Newsflash! Only God can judge. These so-called phony 'christians' will go to hell before anyone else....","post_message":"A Florida church and anti-gay pastor saw a quick backlash from residents of the community after putting up a hateful anti-gay sign."},{"comment_id":"1157727034250343","commenter_b":"Bunch of scum bags","commenter_a":"Spin, spin, spin, is that all we get today ?","post_message":"CBS journalist ADMITS it's their job to protect Hillary Clinton's past."},{"comment_id":"10153619223127042","commenter_b":"My condolences to the family","commenter_a":"Kristopher Jadoo omg","post_message":"BREAKING: New details have emerged about an entire New Jersey family found dead at a burned home."},{"comment_id":"563542197162994","commenter_b":"Dear black lady: it's stupid to do either example you gave. Way to drink the cool aid.","commenter_a":"Yesterday in Charlotte (As per Charlotte Police Chief--He's Black)Black man exits car with a gun in his hand, told to drop weapon and refuses....shot by a black police officer. Gun recovered....not a book. Stop the false narrative! Stop the Madness!!","post_message":"At least 12 officers and 5 demonstrators were injured in protests in Charlotte after a black man was shot and killed by police. Video shows protesters destroying a marked police vehicle."},{"comment_id":"10155041928809187","commenter_b":"Good please for ICE to pick up a bunch of illegals.","commenter_a":"i wish mexico would close its borders an treat american they way they treat illegal just for one day","post_message":"We are Live outside City Hall, where protesters are rallying as part of a nationwide demonstration called 'A Day Without Immigrants' to speak out against recent ICE crackdowns, and showing the impact that immigrants have on the community."}]
