[{"comment_id":"939636916071768","commenter_b":"She's a whore? @username you are a crude, ignorant troll.","commenter_a":"The first real scientific post-debate poll results are out and they are great news for Hillary Clinton. According to the just released Huffington Post/YouGov poll, 55% say Clinton won the debate as compared to just 22% who said Sanders did. Furthermore, 52% in the national poll now say they want Clinton to be the nominee, up from 44% prior to the debate. All in all, a great result that matches the media's assessment of who won the debate, our next President, Hillary Clinton!","post_message":"Larry David is Bernie Sanders."},{"comment_id":"1709358782672403","commenter_b":"Poor Hillary. Somebody here has mercy for her? What will do happy to Clinton? She needs an oily dildo to be happy again!","commenter_a":"Mr. Trump please get back to talking about jobs and the border problems and ignore the pundits like Matthews. You need to talk more about Cruz being an insider too. That is not stressed enough in your campaign. You can win but have to talk about what the average American is worried about. God Bless you. I will be voting for you in Pennsylvania.","post_message":"Wait until I do not have to take on 16 candidates at once. I will be Hillary's worst nightmare! We are going to WIN!!"},{"comment_id":"10153373033325667","commenter_b":"I love boobs, now thats something worth fighting for!!","commenter_a":"With so many violent movies and video games around, no wonder real killings are becoming an 'accepted' part of society. Children can easily watch something in which a person is shot (often without flinching), but God forbid a woman breastfeeds her baby in public...","post_message":"No motive for the shooting was given and police said they were still looking for two gunmen."},{"comment_id":"10153349843651051","commenter_b":"She's a stupid bitch","commenter_a":"Aunt Jen, your a money hungry twat.","post_message":"This aunt is suing her 12-year-old nephew for $127,000 over a hug."},{"comment_id":"1193851514016933","commenter_b":"You losers already get my money in taxes. I pay for your food stamps and slow check every month!","commenter_a":"We wuz kangs","post_message":"Just in time for Christmas!"},{"comment_id":"10153877660438812","commenter_b":"Wow, you're just full of fear. They're just people that want to use the bathroom. Get over yourself. No one wants to look at you or your ugly daughter anyway","commenter_a":"This just in! All teenage boys are claiming to be trans to gain access to girls' locker rooms.","post_message":"The DOE says an Illinois school district is violating the rights of a trans student by denying her access to the girls' locker room."},{"comment_id":"10153150400359087","commenter_b":"Oh, she's held to a different standard, alright! Her sh*t don't stink. No matter what she does, she's Hillary Clinton, and she's untouchable. Ask General Petraeus.","commenter_a":"Plain and Simple Hillary needs to be in jail period.","post_message":"“This is not a criminal investigation,” former Rep. Ellen Tauscher (D-Calif.) said. “There’s no question about that. It’s dancing on the head of a pin and frankly partisan politics.”"}]
