[{"comment_id":"10154083377471433","commenter_b":"Good keep your foreign diseases in your own countries","commenter_a":"Oh you mean the country that out right said ....\"Death to America\"??? WHO CARES!!!!","post_message":"BREAKING NEWS: Iran suggests it will limit issuing visas to American tourists in retaliation for President Donald Trump's ban on refugees from Muslim-majority countries."},{"comment_id":"402875396503722","commenter_b":"silly sarah sure is a pompus bitch","commenter_a":"Rather look at her vs Billary! What a pompous bitch!","post_message":"Sarah Palin had some strong views on Hillary Clinton's email accounts. Is this as big an issue as she claims?"},{"comment_id":"10153078951184255","commenter_b":"Soon...","commenter_a":"This is a problem for men too. Imagine the state taking your testes and telling you what you can do with them.","post_message":"American women, in states both red and blue, have been detained, imprisoned, and even forced to undergo unwanted surgery because they have been guilty of being pregnant."},{"comment_id":"10153206057979312","commenter_b":"Yeah that's why global warming is such a bigger deal than millions of humans getting their head slashed. Good one! You know they will come over here and do the same!","commenter_a":"If the President comes out in favor of it they'll drop the idea like a hot rock.","post_message":"Under the proposed measure, Missouri residents would switch to daylight saving time in March 2017 and never turn their clocks back again. Good idea? Bad idea?"},{"comment_id":"10153387831771336","commenter_b":"It's like when people are drowning we add more water.","commenter_a":"No stricter gun laws won't work. I know!!! Let's keep throwing more guns into the mix! More guns and LESS strict gun laws will definitely solve this!","post_message":"\"If it can happen in church, it can happen anywhere, so there’s no answer to it. You can't predict when evil's gonna show up.\" – Toby Keith"},{"comment_id":"10154145520606770","commenter_b":"Never, they're pigs. Tell them to oink off.","commenter_a":"When did they stop calling women like Kim who have no decency or moral compass pigs?","post_message":"The outfits that Kim Kardashian and Kendall Jenner wore were absolutely stunning."},{"comment_id":"10150715134694999","commenter_b":"@username Illegal immigrants steal roughly 9 billion dollars worth of resources reserved for American citizens every year. Deporting them per our existing laws will save us a ton of money...any more brain busters?","commenter_a":"What's even more appalling is that he's polling at 39% of Republican + Republican-leaning registered voters in the latest CNN poll. ...What does this say about our country and how folks want our supposed leaders to behave? What is this acceptance of ongoing crass commentary? ...And what happened to equanimity and professionalism?","post_message":"Donald J. Trump called Hillary Clinton's mid-debate bathroom break \"disgusting.\" Frank Bruni says it's \"the rare man-child who finds that worthy of ridicule.\" Read on in The New York Times Opinion Section."}]
