[{"comment_id":"1495644530464502","commenter_b":"Trump !! Hillary can't swim!!","commenter_a":"Butt wipe","post_message":"Watch Nebraska Senator Ben Sasse's speech LIVE to close out this year's #RSG16!"},{"comment_id":"10152639623811680","commenter_b":"Illegals do vote. @webpagelink","commenter_a":"Not against legal citizens from voting. It is fraud and illegals voting. You took an oath. You should be against it also.","post_message":"Sen. Bernie Sanders: “An absolute disgrace for Republicans in the year 2015 to work overtime to deny people the basic right to vote.”"},{"comment_id":"10153463322016051","commenter_b":"Too sick! This woman might wear Christian symbols at Christmastime !","commenter_a":"There is no meshing between our God and theirs-the Holy Bible is our guide and law-we are inclusive but stand on firm ground!","post_message":"This evangelical Christian school just suspended a tenured professor for expressing solidarity with Muslims. And they didn't stop there. Decide for yourselves if the school behaved correctly. (Via VICE News)"},{"comment_id":"10154250951204641","commenter_b":"Ok, u say it's a choice so that person chose to have unprotected sex and got prego. Who's fault is that. That child didn't ask to be killed because of their parent made a choice to not put a condominium on. The consequence of having unprotected sex is a baby. If u don't want to have a baby don't have sex. Abortion us an e cause to not take respinsibilty for ur actions. Abortion isn't safe. It leaves scared emotionally.","commenter_a":"If you don't want an abortion fine, but who the hell are you to tell another person who is getting a safe procedure by professionals what they can or can not do to there bodies? What if someone was raped, low financial income, mentally unstable, or if the pregnancy was unsafe for mother and baby? Explain that to your petty beliefs of striping women of he right TO THEIR OWN BODIES!!","post_message":"The 5-3 ruling is the most significant decision from the U.S. Supreme Court on abortion in two decades and could serve to deter other states from passing so-called \"clinic shutdown\" laws."},{"comment_id":"369671676554460","commenter_b":"Of course we pay for her boobs because we pay for all the boos in Washington","commenter_a":"This is disgusting and she should be kicked out in the cold! Taxpayers pay for this fraud nd sh should be removd from all social welfare programs! He doctor should never be able to bill this type of fraud.","post_message":"This Parasite... Unbelievable."},{"comment_id":"10154121076339342","commenter_b":"You are sick! Abortion should not be an option, period!","commenter_a":"There are so many people who would love to have kids and can't. But monsters like this get that blessing and go and kill their kids. This world is so effed up.","post_message":"Chilling new details about how a mother allegedly took each of her kids into the bathtub, and took their lives."},{"comment_id":"212919912399673","commenter_b":"Karishma Bisheshar @username guys do ul remember this song...","commenter_a":"So sweet!","post_message":"You're my Honeybunch, Sugarplum Pumpy-umpy-umpkin, You're my Sweetie Pie You're my Cuppycake, Gumdrop Snoogums-Boogums, You're the Apple of my Eye And I love you so and I want you to know That I'll always be right here And I love to sing sweet songs to you Because you are so dear.. <3"}]
