[{"comment_id":"929340743844610","commenter_b":"Unfortunately, it will only get worse if lying, cheating, Hillary gets in the White House. God Bless us all.","commenter_a":"Time can't pass fast enough until he is gone and out of office!! He is such a disgrace to this great nation!!! I would love to see him locked up for all of his crimes that he has commented on the people!! TRUMP is the only hope we have...Hillary will be even worse than Obama!!!","post_message":"Obama Admin Gives Homeless Vets The Finger; Housing Illegals at Military Base Instead.... Obama is like Colin Kaepernick... Hates America, Hates our Flag and HATES the people in the US Military who defend it. Then Cries racism at every corner while becoming RICH from it."},{"comment_id":"501450786646182","commenter_b":"Hey Edi, if some tramp wants to have sex with any worthless punk she can hook up with, is it \"choice\" or is it irresponsibility?","commenter_a":"She not only has the right to control her own body...she has the responsibility...I know that is a bad word in the dem vocabulary, but responsibility means preventing the pregnancy...we know what causes that these days","post_message":"Do you think women should have the right to chose?"},{"comment_id":"1713218088954908","commenter_b":"@username when have I blamed Muslims for everything? I am so sorry you think that but you have a right to your opinion. I do not hate Muslims I hate that there are Muslim extremist that are going against Israel and want to take what is theirs and deny them their rights. God gave them Israel and Jerusalem is their capital city. Muslims do not worship our God and they want to kill those that do not worship their God. So?","commenter_a":"Amen!! What a terrible screwed up country this is. Need more God in it and less evil. Who cares if the unwanted Muslims are offended ?? Go back to where you came from!","post_message":""},{"comment_id":"415787422087411","commenter_b":"Many more American waiting for jobs now, so if your illegal, then bye, bye. If your immigrants better get back to work, that is what you came to America for.","commenter_a":"Carol Johnson","post_message":"#DayWithoutImmigrants: Immigrants across the country are expected to stay home from school and work today to show how critical they are to the U.S. economy and way of life."},{"comment_id":"10153004550474411","commenter_b":"U shts invaded our lands. Ur the problem.","commenter_a":"ban the Muslim black garbage bags","post_message":""},{"comment_id":"1132568873502832","commenter_b":"Dont know. You went baiit an switch. Its about keeping these men out. Want more? @webpagelink","commenter_a":"To keep men pedophiles out womens bathrooms? Yes. I agree!","post_message":"How does this make ANY sense? Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153382769757411","commenter_b":"I don't know who you've been talking to but it seems to me that America has been supporting the illegal Mexicans for quite a while and we have been paying for it with our tax dollars! So now people are angry because there is no money in our checking accounts because the government is taking it to pay for all the refugees and the illegals that is using our system! We have no country without a border, we have no country if everybody comes in that wants to! without doing it properly! Now is the time to take our country back and get it out of the true terrorist hands, that is in our government and has been for past several years, using the people to their advantage!","commenter_a":"People should protest all of Donald Trump's rallies and stop this man before he gets out of control. America does not need to return to the days of racism and prejudice to be \"great again\". I can't imagine Donald Trump as President of the United States. Everything will be one big reality show for him and he will be the host who gets to fire whoever gets in his way. His supporters are exhibiting the same attitude and acting like they are judge and jury treating protesters as if they should be deemed as Enemy Combatants who do not have rights. Donald Trump has stated that if he becomes President of the United States that he would wage war against Mexico in order to recuperate the cost to build his wall. Racism is his underlying motive. Just like when Hitler waged war against the Jews. His sole ambition to gain ...","post_message":"\"Donald Trump has created a toxic environment. And the toxic environment has allowed his supporters and those who sometimes seek confrontation to come together in violence.\" John Kasich today blasted Donald J. Trump for \"preying on the fears\" of Americans. Both Kasich and Marco Rubio suggested they may not support Trump should he become the GOP nominee. Story: @webpagelink"}]
