[{"comment_id":"809196999209345","commenter_b":"you are so full of it jeb - and you don't stand a chance. even insane republicans are done with the bushes. what's the policy on a presidential candidate's brother being a wanted war criminal????","commenter_a":"I am saying \"boo,\" not \"boo Jeb,\" though I AM booing Jeb. Boo!","post_message":"Most passionate moments of #DemDebate are always about who will ban more guns and who will give the gov't more control over your health care."},{"comment_id":"10153026987796051","commenter_b":"I hope that bitch never gets out alive from prison that poor little baby how can anyone do that to a baby much less a mother it makes me sick I want to knock the crap out of her that baby could not defend herself and the pain it must of went true","commenter_a":"Disgusting! Horrific, she is supposed to be her daughters biggest protector!!","post_message":"Even the police were caught a little off guard when they saw the pictures this woman had of her infant daughter."},{"comment_id":"10153352043126756","commenter_b":"Not a chance until the millions of illegal parasites are returned and hospitals offer them nothing.","commenter_a":"America is for real fucked up. You pride yourself on being a democracy yet you tolerate this kind of crap. Why aren't you all in the streets raising hell? No other first world country would allow a system like this.","post_message":"At the end of her life, MaryLou's family owed $100,000 for her medical bills, after insurance. This is how they struggled to manage both the care and the cost of cancer."},{"comment_id":"906680809367341","commenter_b":"She is trailer park trash.","commenter_a":"Michelle has no class, she doesn't even look like a First Lady. In fact, she's not even First Lady material.","post_message":"This is EPIC"},{"comment_id":"1033663213364148","commenter_b":"@username if there illegal how did they get your job??? I thought illegals couldn't be hired?","commenter_a":"Shut off all immigration, build the wall, get rid of illegal aliens. That in itself should generate a large number of jobs!","post_message":"Fox News had an illegal alien on during the #GOPDebate to ask candidates what they would do with illegal aliens. Shouldn't they be asking them if they would reduce immigration to help American workers?"},{"comment_id":"668156923332741","commenter_b":"Oh, so now you speak Spanish? You voodoo witch!","commenter_a":"What does it takes America to see that Obama and Hilary have offered our country very little for the past eight years, good deceptive speeches, pure empty promises, Obama Health Care that every Insurance Company wants to drop because they are loosing so much money, bad immigration system, from one lies and deceptions after another, 400,000,000 American tax dollars for ransom, two more Americans Kidnapped for more ransom money, bad Iran deals and foreign bribes for speech and favors from corrupt foreign leaders, 33,000 deleted government email, deleted and covered up under Hilary skeleton closet because Hilary think she is above the law, deceptions, Hilary lies and cover up about Benghazi, from one lies and deception after another coming from Hilary and Obama to much to list, while our country is falling apart and American Citizens are suffering, our poor minority American Citizens are suffering, getting worse and worse under ...","post_message":"A tan solo 83 días para el día de la elección, Trump contrató a una de las voces más extremistas de la derecha para dirigir su campaña. Este es quien realmente es Trump y queda claro que no va a cambiar."},{"comment_id":"10152602794417894","commenter_b":"smh bitch can do better","commenter_a":"I am totally okay with this. David Ramos @username","post_message":"Coupled Up? Rihanna Reportedly Spotted Making Out with Leonardo DiCaprio at the Playboy Mansion"}]
