[{"comment_id":"10154308698454607","commenter_b":"Do these liberal protesters have jobs!!!!!!","commenter_a":"The US is being ridiculed by idiotic liberals who are obviously clueless on what President Trump is doing, protecting Americans!!! I live less than 20 miles away from that radical Islamic terrorist attack in San Bernardino, where 14 innocent people were murdered!! It's not Trump's fault that our government is so corrupted and does not have an immigration accountability system to know who exactly is entering our country! There are Isis training camps all over the United States! If you don't believe me Google it!!! There is an Islamic training camp less than 10 miles away. They are spreading like a disease everywhere! Last year local law enforcement caught 16 radical Islamic Muslims training near the a river bed all of them had AK-47's!!! All of them are now being investigated by FBI! 5 of which are on the top 10 most wanted list!!! Do you want to know why ...","post_message":""},{"comment_id":"10153324235171051","commenter_b":"Since some of you females here want to crucify the father let me be the first to defend him. The child was the one that is being held, not the father. They have enough evidence to hold him and charge the kid. We don't know what kind of man the father was or what custody agreement him and the mother had. The child is the one being charge and we should leave it like that until something new comes out.","commenter_a":"Where is the father of the fetus & how far along was she? Nobody noticed the front door open on Friday or Saturday? A single mother living in that house? They said the kid had been missing a couple days as well but their news broadcast says the boy disappeared after his mothers death. What was he doing there? How did he get there? The neighbor & sister both say the boy was a good kid, good grades, non trouble maker and she was a great mother who loved & protected her family. Almost all pregnant women who die, do so at the hands of the baby's father.","post_message":"This pregnant woman was killed by the one person she trusted most in the world."},{"comment_id":"1352088188153471","commenter_b":"So Trump is going to run the country so great but can't keep tabs on his own tower? ( a case he was guilty in) it's not even about that though, it's more his hypocrisy and saying he'll bring jobs back when he's hiring illegals.","commenter_a":"This showed me how Cruz an rubio are like.senators who are liars.Trump is the only one to make America great again.","post_message":"One word: FINALLY."},{"comment_id":"10153238705381717","commenter_b":"Yes, well if you're a woman who's into men, that is how it should be. Is there any particular reason you're trying to pick a fight?","commenter_a":"What's next ppl marrying there pets!# Gross..one man and one woman period. DAMM GAYS","post_message":"In case you missed it:"},{"comment_id":"10153993909761491","commenter_b":"A women should be happy she has big tits-men will ne ef stop looking at her","commenter_a":"I got chastised by a femminest about 3 months ago for saying that it was a crime against man","post_message":"\"I chose surgery because of how I felt, not because of what anyone else thought.\""},{"comment_id":"10153391212533984","commenter_b":"Dumb ass!!!","commenter_a":"Another actor who thinks his opinion matters to anyone with an IQ over that of a houseplant....sooooo sorry George, but you really should stick to acting.","post_message":"This might lose George a few fans. What's worse than announcing he'll give this candidate 'whatever they want,' was the claim he made about a scandal that surrounds this particular 2016 hopeful..."},{"comment_id":"977838925598355","commenter_b":"Yes!","commenter_a":"Yes","post_message":"What do you think? Ferguson? Baltimore? Black Lives Matter? We've never seen so much division!"}]
