[{"comment_id":"10154089645681336","commenter_b":"Seriously Paula??? Smh! Pathetic!","commenter_a":"It's lice. We all got it in the 70's while in school. It's not life threatening. So it's harder to kill. If it's bad, I agree with shaving the head. It's hair. It will grow back. On average hair grows an inch per month. You can't stop kids from being kids and rolling around on the ground or jumping into leaves. So they get lice. Deal with it.","post_message":"What can you do if your child is affected?"},{"comment_id":"1739262919647781","commenter_b":"Hilary is a Republican. She votes like one on war and trade deals. I can find examples if you would like","commenter_a":"Dear Democrats. Bernie Sanders is \"not\" a Democrat. Bernie applied as a conscientious objector in the Vietnam war and did until he was too old to be drafted. In July 1985, Bernie Sanders traveled to Nicaragua, where he attended an event that one wire report dubbed an -U.S. rally. In 1981, he won a shocking victory by only 10 votes to become mayor of Vermont largest city, Burlington. Sanders was elected on a socialist platform and led a mayoral administration that he boasted was radical than any other in the country. And he had a vision! Sanders believed his work in Burlington could spread socialism throughout America. In April 1985, the Los Angeles Times published a lengthy interview with Sanders in which he outlined his plan to spark change. That is exactly what he is trying to do now. Show a tiny bit of his plan and drastically change America ...","post_message":"Back-to-back poll results suggest that Hillary Clinton is on the cusp of a pivotal victory that would help her regain momentum after a string of embarrassing defeats and that would deliver a blow to Bernie Sanders as the two Democrats gear up for the final stretch of voting."},{"comment_id":"1106399449450800","commenter_b":"Have you ever been fired or refused a job because you had a cough?! If this is the best you can do you should throw in your white sheet and accept defeat.","commenter_a":"Notice how her hair is different in all 3 of the pictures and her clothes are different in the two pictures that show her clothes. Who changes their hair and clothes several times while on a plane? Another made up story without corroboration by the right wing nuts from @username.","post_message":"WATCH:"},{"comment_id":"927400923975122","commenter_b":"Lol. Kinda harder for a white person to flee the country. Try again. If your illegal then you are ILLEGAL. Their is no right about it.","commenter_a":"For all of you saying if the man who caused this accident was an \"illegal\" or \"undocumented\" man, what if the victims were illegal? Is that going to change how tragic and sad this is? Jeez, you would think the older the wiser but it seems to be the older the dumber and ignorant","post_message":"MCSO: \"ONE OF THE WORST DUI CRASHES WE'VE EVER INVESTIGATED.\" 5 A-M Sunday morning, Sheriff's deputies say 23 year old Cesar Villanueva, driving a white truck, slammed into the back of a Honda waiting at a stoplight in Avondale. The impact virtually destroyed the car. The young man and woman in the Honda were pronounced dead at the scene near Avondale Blvd. & MC 85. Detectives say Villanueva was speeding and was impaired. He is in custody. Details at 5."},{"comment_id":"1494215257285326","commenter_b":"If ur here illegally you got to go. 100%.","commenter_a":"If you're here legally and ICE knocks at your door: Answer and say hello, you haven't broken the law so you have nothing to fear.","post_message":"ICE raids have resumed in several cities under the Trump administration, continuing to tear immigrant families apart and put whole communities in the target hairs. Thankfully, more and more people are getting aware and awake, and are hitting the streets to protect undocumented communities and protest raids, mass detentions, and deportations. Activists in many cities are holding \"know your rights\" trainings over the next several days - get involved in your city, and join the movement to protect immigrants and their families!"},{"comment_id":"10152863339776491","commenter_b":"Just think all the traffic that's been through her!! Her germs have germs!!","commenter_a":"Can you imagine being the one that has to kiss those lips? Ugh. I mean uuuugggghh!","post_message":"\"Every time I say something that’s extremely truthful out loud, it literally breaks the Internet.\""},{"comment_id":"10153430194047042","commenter_b":"To answer your question politically I don't like Hilary and I don't believe I would care for her personally either.","commenter_a":"How did Americans become so Dumb? No matter what kind of Facts you show them they will still support this Fool of a President.There is a Health Care Crisis is Puerto Rico yet they love this Fool.Israel will soon be whipped off the map by Iran yet Jews Love this President.Not a single Latin family has been untouched by this Man and his Policies yet we are about to elect someone worst Hilary.The Mexicans don't understand that there being used like a mule to further a democratic Political agenda.The president could have made millions of illegals legal yet there left in limbo and now he is gonna lecture us on race relations when he is the most divisive of Presidents..","post_message":"\"RACISM, WE ARE NOT CURED OF IT\": President Barack Obama used the n-word to make a point about the reality of racism in America."}]
