[{"comment_id":"917384355021286","commenter_b":"I would love to see Trump/Carson..... Trump because you can't push him around. carson because the man is just smart!","commenter_a":"How does a troll like Trump make America great. When he can't run a business without filing for bankruptcy. You get no I screwed it up and need a do over in politics. Just ask GW Bush. Anyone hear Trumps policy other than he's going to be great. I I don't think so. Let's call him the carnival barker and clown show that he is. And his supporters if you don't like government than don't participate. A vote for a angry clueless egotistical clown won't help America.","post_message":"Republican 2016 frontrunner Donald Trump is a stain on our country. Image by Occupy Democrats."},{"comment_id":"10156282182225354","commenter_b":"Why are they even getting licenses??","commenter_a":"Lord, don't even let me go there, cause my head will explode............","post_message":"Illegal immigrant activists complain that Colorado's illegals aren't getting their driver's licenses issued quick enough. Seriously..."},{"comment_id":"10154038089667293","commenter_b":"Unlikely? Really?","commenter_a":"I live abroad, and there is no escaping questions about Donald Trump on an almost daily basis. I'm often asked directly, \"He's not actually going to be President, though, is he? Can he be? Why are people supporting him?\" They think Americans have lost their minds, and there's tangible concern about what his presidency could mean for the world. Fortunately, I keep FiveThirtyEight handy and can show them how unlikely (currently) his election is, but American democracy has taken a huge (yuge?) credibility hit regardless.","post_message":"When your vacation turns into a lesson in \"Trump-splaining.\""},{"comment_id":"10153014667776955","commenter_b":"I lived in NY, not the first blizzard or the last...whats different now is the libtards have forced energy production to stagnate or decline while the population increased - aka people are going to freeze to death in their own homes. This is just nature being nature. Lets not make something out of nothing.","commenter_a":"Good place for it.","post_message":"BLIZZARD WATCH NYC, BOSTON HISTORIC"},{"comment_id":"1193174800771119","commenter_b":"@username and deport them","commenter_a":"Sounds to me like she's taken some pages out of Hitlers book: Meine Kaumph. Don't know if that is spelled right, but you get the idea. And I wonder how she'll feel about it when she reaches 80. (if she ever does).","post_message":"What's up with leftists having no problem 'taking people out'?"},{"comment_id":"612057282315211","commenter_b":"God she's an idiot lmao can't fix a fake blond moment","commenter_a":"This girl has a show? It is cheaper to produce this than real news that impacts people's lives. A little girl with a big mouth is our national dialogue? Cheap.","post_message":"Trevor Noah's performance was a thoughtful invasion, a methodical exploration behind enemy lines."},{"comment_id":"496072593916654","commenter_b":"send them to the toilets they came from","commenter_a":"Unless the Muslims can \"Swear allegiance\" to America, practice / observe their faith, while respecting & protecting the rights of Non-Muslims...YES, DEPORT THEM!","post_message":"Chaos ensues after Norway starts deporting Muslims. Norway made a brave move, now the rest of the world needs to follow their example. Do You Support Muslim Deportation In The United States?"}]
