[{"comment_id":"10153538979824117","commenter_b":"I feel like this world lacks sufficient moons for McAfee to howl at. I hope one day he can find his way home.","commenter_a":"Bye Felicia.","post_message":"Unverifiable accusations of skulduggery aimed at former Gov. Gary Johnson, and competitor John Mcafee says he cannot support the Libertarian Party if Johnson is the nominee."},{"comment_id":"10156323559275294","commenter_b":"I will respond honestly. I am on the fence with medicinal use. Not sure it needs to be legalized for this purpose but not totally against it. I am totally against recreational usage because the bad outweighs any benefits in my opinion. I do not see it helping the economy or benefitting society at all. Plus the 10 only benefitted from the bill did not help and it should be a law only not a change to the constitution.","commenter_a":"To everyone that voted no I want a legit response on to what was so wrong with amendment???","post_message":"Issue 3, which would have legalized marijuana in Ohio, was voted down by a nearly two to one margin yesterday -- but officials with Responsible Ohio say the fight isn't over. Click below for more, including a complete list of election results:"},{"comment_id":"968475119944707","commenter_b":"Man this website is So So So Biased, how can you take a political stance all day long to put down trump(4 to 5 articles a day) trump is this, trump is that, can we even call you a news website anymore??? How much money did the hill team fill your coffers with??? Do you not care about the world?? It's bleeding out in the middleeast :( you completely put out the best prospective candidates bernie, Jill, Gary. You leave trump cuz he doesn't say too many intelligent things but he is more human than any of the Warhawks that's been running the murica for a decade now!!!! Please people we need to spread the truth and love not put people down and dish out hate all day!!! Here's my finger to you Huffington","commenter_a":"put a toothbrush moustache on hillary and then it would be appropriate to yell 'heil hillary!' What is going on in 2016, appears to match severial elements to the 1934 German presidental election. For example: 2016 Democrate liberials ruthlessly beating up on Republican voters. Local Police (Fresno Ca) allowing violence as a policital objective at a Trump event. Propaganda; political acuity against conservative thought and the deceptiveness of 90% the media to sway voters towards hillary. Can anyone define all the promises from this great fuhrer hillary to buy their votes? HEIL HILLARY! Even the Universities and High Schools are exercising power over speech they disagree with. This is a time of struggle 'Kampfjahre.'","post_message":"They really got riled up about his birther-announcement fiasco."},{"comment_id":"10152972519324753","commenter_b":"This bitch","commenter_a":"Nathan Perez @username omg","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"1265882336765127","commenter_b":"And yes that woman looks horrible because she over does it ...like I said I wouldn't suggest coming every day for the rest of your life","commenter_a":"Ummm....I am a tanning salon OWNER! You are are misinformed in your information as we all have taken classes about tanning. My mother died of melanoma and never tanned a day in her life we get SOOOOO MANY people with medical conditions who have to tan some of which are young girls. Now they passed the new law in 2014 on minors but we are WIDELY sought out and remained a tanning salon for 17 years!!! You have to educate yourself on it. The media is giving it such a horrible rep just like they do with everything to make you all freak out the exact way u are. If we didn't know what we were talking about then why do we have clients come who beat breast cancer with a doctors note or psoriasis or cystic acne or ms eczema the list goes on. Your body NEEDS vitamin D ...","post_message":"The FDA proposed unprecedented new rules Friday that would bar anyone under 18 from using a tanning booth or sunlamp."},{"comment_id":"1772911969633181","commenter_b":"Trump says they can come back legally. Why deport them?","commenter_a":"Try this Clinton: Little girl: \" Does my family have to go back to wherever?.\" Clinton: I'm afraid you do, you see your parents are criminals.\" Little girl: \"Criminals?\" Clinton: \" Yes your parents came into this country, illegally, they broke the law.\" Little girl: My parents are criminals? Don't bad people go to jail? At school the teacher, told us you belong in jail. Is that true?: Clinton: Just like your parents, only if I get caught\" Little Girl \" Oh Clinton I want to grow up to be just like you. Circumvent the law, lie, cheat, steal. I'll vote Democrat forever.","post_message":""},{"comment_id":"10153092200332869","commenter_b":"Mrs.Clinton will never be president and a Democrat will not get the presidential office. Either republicans or the third party is getting the presidential office. I do not accept the same-sex marriage.","commenter_a":"So proud of Gov Huckabee's strong stand against same sex marriage. Sets him apart from others who shun the issue. Will be a strong president!!","post_message":"Governor Huckabee was on Fox News tonight to discuss the Supreme Court's divided ruling on gay marriage, and the need to reject judicial tyranny and protect religious liberty. WATCH ⬇️"}]
