[{"comment_id":"10157942641385354","commenter_b":"Horseshit. Grow a set wussie. You give me a bad name.","commenter_a":"Danika Pearson","post_message":"Wake Up, Gun Owners. This is No Joke."},{"comment_id":"10154583346243855","commenter_b":"Governor Brown will be on the right side of history!","commenter_a":"Big talk now. Let's see how mouthy he is when President Trump and the Congress cut off funds to states who harbor illegal aliens and otherwise defy federal laws. Can't wait to see CA in an even worse budget squeeze. Talk is cheap when others are paying your bills.","post_message":"Thank you, Jerry Brown! Read the full text of the California governor's anti-Trump State of the State address: @webpagelink"},{"comment_id":"10152948972001051","commenter_b":"You wouldn't see tomorrow if you shot my dog you pussy. I'll put a new asshole in your forehead","commenter_a":"NO DOG should be loose in public, PERIOD. Your loose dog will be neutralized if it approaches me. NO APOLOGY.","post_message":"Some people say the officer handled this situation correctly. Others say it was an overreaction. Decide for yourselves who is right."},{"comment_id":"10153378197295950","commenter_b":"go home please","commenter_a":"When will she realize she is in the wrong party for the rights of women and minorities?","post_message":"\"I have battled breast cancer,\" Fiorina voice says in the ad as clips of the candidate at various campaign events play out. \"I have buried a child. I have read my Bible. I know the value of life.\""},{"comment_id":"894618207261542","commenter_b":"yes i reject it and this ass too","commenter_a":"YES.","post_message":"Where do you stand? Vote here and make your voice heard."},{"comment_id":"10153633238805575","commenter_b":"Get those monsters outta here!","commenter_a":"Oh who did not see this coming? Remember in Greece all the guns that were found? This is not refugees this is trying to take over send them back!!!","post_message":"This is frightening."},{"comment_id":"10154388991666162","commenter_b":"Stfu!","commenter_a":"Happy birthday you druggie idol you","post_message":"Prince was born on this day in 1958. He would have turned 58 today... @webpagelink"}]
