[{"comment_id":"10153874605884270","commenter_b":"Jagdeep Singh Jagge sir, you need to study english literature. Also, Japan is/would be a US ally over China. You can not live in the past. Basing a country's actions on what happened nearly 100 years ago now is folly. The world and possible battlefield is ever changing.","commenter_a":"Japan technology is far ahead thn china, just they don't showof or not interested in military anymore after world war2(japan use less than 1% of his gfp for military).","post_message":"There has been a dramatic increase in sorties for the Japanese in the past year."},{"comment_id":"1089911127716025","commenter_b":"Another illiterate ass wipe that can't get over having to share her country with people that don't look like her... Try moving to Russia, bitch.","commenter_a":"I just wonder how long she can tread water.","post_message":"The kids were just playing in the water..."},{"comment_id":"10153854800096955","commenter_b":"@username loooooooool u stupid Americans are cute. Have fun finding water in 5 years 😜","commenter_a":"You should have to have a comprehensive background check before anyone can just buy a knife and close the knife show loop hole . Problem solved !","post_message":"NYC Residents On Edge After 3 Slashing Attacks In Less Than 48 Hours..."},{"comment_id":"1738783449718030","commenter_b":"Lmfaoooo she's just so fed up","commenter_a":"The teacher at 52 seconds hung her head low like \"these mfs here \" Ty1253184741396567","post_message":"Move over, #MannequinChallenge. The #TrumpsComingChallenge is sending students fleeing @webpagelink"},{"comment_id":"1284368551656196","commenter_b":"It is true that staying home and taking care of the kids is cheaper but also if both parents are working to meet their needs then they can apply for daycare help to cover daycare instead of staying home and collect food stamps and cash from the government.. I'm a single mother and I was working full time and couldn't afford daycare or a full-time nanny and I did went to get help and they cover the daycare or babysitter cost...some people work half on the books and half off the books just so they can collect government help I see it every day...","commenter_a":"Is taking care of several under school age children not a full time job That mothers are not getting paid for. What should they do . For food .","post_message":"EXACTLY!"},{"comment_id":"963452387028567","commenter_b":"Judy.. that is a huge part of the problem with the US today.. Dumb parents raising dumber kids. She has NO id ... can not drive nor get married nor get any medical care. How Stupid is that? She gets sick .. just stick her in the dirt right? Great parenting.","commenter_a":"That's amazing. Her parents should be charged with abuse.","post_message":"Her parents never got her a birth certificate or social security number, never took her to a doctor or let her go to school, and now she has no way of proving to the government that she even exists."},{"comment_id":"10155031331646320","commenter_b":"You are on my prayer list.","commenter_a":"Stay strong","post_message":"Detective Steven McDonald was hospitalized earlier today after suffering a heart attack. Our thoughts and prayers are with the McDonald family. A former U.S. Navy hospital corpsman and third generation police officer, Steven McDonald was shot three times in the line of duty on July 12, 1986. The shooting left him quadriplegic. Several months after his injuries, he said that he had forgiven the 15 year-old who had shot him."}]
