[{"comment_id":"591548094329175","commenter_b":"No, let her coach womens sports.","commenter_a":"Ridiculous. Why even keep score and give everyone a super bowl ring.","post_message":"Should females be installed as coaches on every NFL team?"},{"comment_id":"671356856304361","commenter_b":"Absolutely! Well said @ Nick..","commenter_a":"I think anyone that can actually read and does read about the UN`s actions will know that something is very wrong here, there is corruption at work, right at the top. Their anti Israel bias is painfully obvious in deed and action, compare what they levy against Israel in comparison to every other country under the UN, read some of the insane quotes from Palestinian sympathizing UN members and you will have the naked truth envelop your logical thinking in determining that ulterior motives are at work, insidious schemes are hatching and Israel is in the UN`s sights for dubious reasons. They are utterly obsessed with attacking Israel on the world stage and make not one effort to direct their attention anywhere else. We see the bias, we understand corruption is undermining the very fabric that weaves the tapestry that makes the UN have any credibility in the eyes of ...","post_message":"Israeli sources detail president’s ‘difficult’ 30-minute post-election call to Netanyahu, posit grave scenarios for diplomatic rupture"},{"comment_id":"10153109676116051","commenter_b":"Fire the bitch","commenter_a":"UNBELIEVABLE ,THEY SHOULD BE CHARGED WITH THAT POOR LITTLE BABY DEATH,PRAYERS FOR THE FAMILY","post_message":"This EMT was dispatched to a home where an 8-month-old baby desperately needed assistance. The family was begging for help at this point. The EMT had a different plan, though."},{"comment_id":"1164429520340491","commenter_b":"Trump wont pursue this any more than the Clinton Foundation because it just drives a bigger wedge between the parties and does nothing positive as far as unifying them.. its a new administration and we are starting from scratch....all of us like it or not","commenter_a":"Damn well better, 4 good men dead because of this Bastard, and that other POS that rides around on a fuckin Broom!!🖕🏿💀💥💥🔫😜😳","post_message":"HOW is it that Obama STILL has not had to answer questions about the terror attack that took place in 2012 in Benghazi? Do you think Trumps Justice Dept. will make him? @webpagelink"},{"comment_id":"10153526773721350","commenter_b":"Those hips are MALE hips!","commenter_a":"She look so stunning & beautiful tonight","post_message":"Caitlyn Jenner shared some very powerful words from the podium."},{"comment_id":"10154361772367061","commenter_b":"As someone who lives in Lumberton I think we need to thank a lot of people for all they did. People came from other towns and cities with food and other things that were badly needed during this time. I understand these ladies went above and beyond and for that I applaud them. But we should not forget all the other people that helped and are still here helping. While the kids are a very important part of our community there are still people working to rebuild what has taken them a lifetime to obtain. I just want to thank all the people who were here when we were at our worst.","commenter_a":"Very cool","post_message":"WATCH: Educators in Lumberton, NC, hit hard by Hurricane Matthew, get $50,000, a brand new playground and funds to rebuild 16 parks! @webpagelink"},{"comment_id":"593055850861224","commenter_b":"AmandaSmith I understand but people wake up in Florida and sometimes find Alligators walking in their yards or in the bottom of their swimming pools. Disney World was actually built around swamps. Yes they altered the swamps and created the lagoon but it has always had alligators in it. Sorry a toddler died because of the lack of understanding of that fact.","commenter_a":"Give me a break. My 7 year old heard about this and the first thing she said is \"why would they go near the water? It's Florida! Everyone knows there are alligators in Florida!\". We are from Wisconsin.","post_message":"A case against Walt Disney World would hinge on whether or not the resort knew about the alligators living in the resort's Seven Seas Lagoon."}]
