[{"comment_id":"1156989694324963","commenter_b":"Fuk that NIG GERR BITCH","commenter_a":"SHE IS A HORRIBLE HUMAN PERIOD","post_message":"Michelle Obama Banned Valentines Day In Schools She can't take love away from America's children. Do you think she is a horrible first lady?"},{"comment_id":"1529182653808525","commenter_b":"yep, paid lazy fucks, how about we let the illegals stay and ship thse shitbags back","commenter_a":"Liberals out to break this country and doing a very good job at it communist or stand together","post_message":"Are you KIDDING!?"},{"comment_id":"1249598461784360","commenter_b":"Illegal go home","commenter_a":"Why doesn't anyone show compassion? They lost their mother, they are grieving. How would u feel? Instead they act like she is a criminal for wanting her kids to have a future no matter what happened to her.","post_message":"LIVE VIDEO: The family of the Valley mother who was detained and deported under President Donald J. Trump's immigration executive order speaks outside of ICE headquarters in Phoenix. STORY: @webpagelink"},{"comment_id":"961148523904901","commenter_b":"Every female I pursued that said \"No, I am not interested in more than being friends\" at some point had sexual relations with me and enjoyed it after I kept pursuing her in ways she WAS responsive to! some women want gifts and loads of flattery before they say. When they dont want to be friends, I stop pursuing them, until then its their choice to hang or not. The only clause is when they ended up being lesbian women!","commenter_a":"No means No! Some people don't get it. If someone is not interested in you move on.","post_message":"After a 14-year-old girl told her mom that a boy was aggressively pursuing her at school, her mom, a clinical sexologist and video blogger, decided to post a video to the boy on YouTube. >>@webpagelink"},{"comment_id":"10153792156382439","commenter_b":"I would be pulling my children out of that school and looking for a different country to live in... preferably muslim free....","commenter_a":"Sounds a lot like how they kicked of the 3rd Reich.","post_message":"As part of a school project, German children are required to cook and clean and change the bed linens for refugees. The host country becomes subservient to the invaders. A letter written by the Schleswig-Holstein Ministry of Education and Vocational Training, says “pupils will spend a day in a transit accommodation and help for example, fix up as beds as well as help in the collection of donations.“"},{"comment_id":"1011665845530135","commenter_b":"Cassandra is a fox!","commenter_a":"She is beautiful, and yes, I think it's a step in the right direction, but she is NOT plus sized! I am a plus sized woman.","post_message":"PLUS-SIZED MODEL: Model Robyn Lawley just became the first plus-sized model to snag a page in Sports Illustrated's swimsuit edition. Do you think it's a step in the right direction for the modeling industry? Or is it sending the wrong message?"},{"comment_id":"10154999301374411","commenter_b":"@username Fck off white trash","commenter_a":"Good. Cheats shouldn't prosper.","post_message":""}]
