[{"comment_id":"606686526157968","commenter_b":"@username I'm coming to rape and murder ur whole family","commenter_a":"Why not use that time, money, and tech to sniff out cancer, instead of destroying addicts lives by throwing them in a cell with rapists and murders?","post_message":"It's so powerful, it had to be calibrated in the pristine air of Antarctica — one of the few places in the world where it would read true zero."},{"comment_id":"10155365024480354","commenter_b":"Loony witch....","commenter_a":"if you don't like it here LEAVE. There are plenty of non whites that are racists and fat and you seem to ne a racist yourself lady","post_message":"\"All the people who are crunched into the middle of America, the real fat and meat of America, are these racist conservative white people who live on their farms.”"},{"comment_id":"10153434193979138","commenter_b":"Time to ban women..","commenter_a":"Women are crazy!","post_message":"DEVELOPING- A St. Paul woman has been taken into custody after her boyfriend was stabbed to death this morning"},{"comment_id":"418611591638646","commenter_b":"We need to get rid of the income tax and the IRS and go to a strictly consumption tax. It would force people with hidden income like drug dealers to at least pay taxes on their incomes. It could also rid of us of the earned income tax credit which is nothing more than welfare paid through the income tax system. It is paid to illegal aliens. Welfare payments should be made at the state and local level and not the federal level.","commenter_a":"\"Cooperation between the parties is needed and not multiple threats of vetoes\"... perhaps if the do-nothing GOP actually starts doing something instead of just saying NO all the time then the veto threats would disappear....","post_message":"The President's State of the Union address was uplifting, particularly if one is not aware of the actual facts. The economy is better, but far from good. There is a war on radical Islamic terrorists, although he won't use those terms, and we are far from vanquishing them without an aggressive stance. Tax reform is needed, but not redistribution. Cooperation between the parties is needed and not multiple threats of vetoes. Perhaps someone can play the President's speech back to him and hopefully he will abide by the spirit of his words and not the spirit of his ideology."},{"comment_id":"970318416341964","commenter_b":"Airbrushed and retouched photos set unrealistic goals for women, and set us up to believe that we are JUST NOT GOOD ENOUGH. Since we can't ever achieve \"the look\" that we see in ads, we are consistently striving it, and so continue to buy more cosmetics than we need. Pictures and articles like this are absolutely necessary if women are to ever claim their power as more than objects.","commenter_a":"News Flash! Most of us know what people look like in real life. This story is useless.","post_message":"These pictures are everything cosmetic companies DON'T want you to know."},{"comment_id":"10153491570891336","commenter_b":"I don't want that scum anywhere near my home.","commenter_a":"Considering I don't have an auto dishwasher, Obama can be my dish washer anytime.","post_message":"Counterproductive? New Obama administration regulations are meant to boost dishwasher efficiency, but industry experts say it'll result in greater water usage."},{"comment_id":"1159620574116477","commenter_b":"Why doesn't she leave, to many people here anyway.","commenter_a":"American is great, but we all have to remember who we got this great country from the great American Indians they should be the only ones who can say who can stay and can't.","post_message":"This whiny Home Depot employee is going viral in all the wrong ways after a man's photo caught what was on her hat... this is disgusting. The employees of this Home Depot store clearly don't want our money, so let's make sure they don't get it."}]
