[{"comment_id":"10153889494331438","commenter_b":"I just don't understand how people who vote for these whackjobs can imagine living in the world that they want to create. Talk about a hellhole..","commenter_a":"Ted Cruz's campaign statement that \"Muslim neighborhoods\" should be patrolled and militarized is possibly the least American thing I have read today. Land of the free, home of the brave? Nope, not so much because those brown people scare me! And who determines how many Muslims in one neighborhood is enough to warrant this police state attention? I live in a very nice neighborhood and although I don't know for sure (you can't tell someone's religion by looking, folks) there are possibly 4 or 5 Muslim families in my little 2 mile square housing tract. Would that qualify as a \"Muslim neighborhood\"? Jesus, these guys are scary. Bomb, kill, torture, create Muslim ghettos inside the United States. Ugh!","post_message":"Ted Cruz and Donald Trump have particularly harsh responses to the Brussels attacks."},{"comment_id":"1451058244908937","commenter_b":"Deport illegals!!","commenter_a":"Florida for Trump!","post_message":"LIVE Trump! DRAIN THE SWAMP FOLLOW US for Conservative news!---> Freedom Daily Donald J. Trump Donald Trump For President #maga"},{"comment_id":"717585195090025","commenter_b":"With your logic, then what about all those moms bringing their little boys into women's locker rooms and bathrooms? They have penises and they don't belong there. Send them by themselves into a men's room and wish them good luck with the pedophiles who might be there.","commenter_a":"Just because it happens in YOUR family doesn't mean the whole of the rest of society must have their mores changed because YOUR bro/sis has identity issues. This is not and access issue. This is not and equality issue. This is a PERSONAL issue to approx 1.6 million adults and unless your bro/sis has had their genitals 'fixed' I don't want them wagging about in the locker room with my grand kids and great grands. After the 'fix' is in and they've chemically changed themselves to be more like what they think/want to be, I have less of an issue with it. mym","post_message":"Speaking out."},{"comment_id":"10154185935155779","commenter_b":"Minus the \"away\"","commenter_a":"Easy. U2. 9/11-victims' names scrolling through 'Where the Streets Have No Name'....that was not a performance, it was an event...every type of emotion, right on stage.","post_message":"There is no gig in music like the Super Bowl halftime show. You have 12 minutes to justify your legend. And with the Big Game set for this Sunday, what better time to rank the halftime shows from worst to best."},{"comment_id":"899984393370316","commenter_b":"Muslims offend me so throw them out","commenter_a":"Perhaps if the Muslims are so unhappy w/ their environment they might want to go home where they won't have to deal w/ such inconveniences. Furthermore, I hope the Smith family doesn't give up their spare lot. I'm so sick of the non-Muslim world walking on egg shells for these folks. I doubt their mother country would give on one issue to accommodate my American, Christian values if I had the misfortune to relocate to their country. Why are we constantly caving to these folks!?","post_message":"Pathetic! (MUST READ)"},{"comment_id":"10153762734254087","commenter_b":"All this woman does is lie her ass off 24/7","commenter_a":"Republican Hypocrisy !!","post_message":"FBI Director James Comey dismissed Hillary Clinton's claim that his agency's probe into her private email server was a routine “security inquiry,\" telling reporters \"I'm not familiar with the term 'security inquiry.'\""},{"comment_id":"1261955857213973","commenter_b":"Sounds good....illegal alien it is.","commenter_a":"It's illegal alien. As in not from this country. An immigrant is one who has applied for entry into this country legally before they left their home port/border.","post_message":"USC Professor Warns Students, Don’t Use Term “Illegal Immigrant” On Final"}]
