[{"comment_id":"10152880805672377","commenter_b":"Worried ???? then I suggest she better get her BUTT in gear and start letting us know what HER AGENDA is !!!!!","commenter_a":"Go Betnie, GO. We need candidates that are not corrupt and money grabbers without all of the baggage the Queen carries. Someone who has the interest if the country in mind not self- aggrandisement.","post_message":"Hillary Clinton's campaign is \"worried about\" the challenge being posed by Sen. Bernie Sanders, whose popularity and poll numbers are continuing to grow."},{"comment_id":"1723680187844156","commenter_b":"she is CRAY cray crazzzyyy","commenter_a":"@username ton 2 cents plottale la dessus please","post_message":"On Tuesday’s “The View”, Hillary claimed that a child, on its due date, just before delivery, has no constitutional rights. Are you serious? I believe that life begins at conception and that abortion takes the life of an innocent human being. And I’ve heard all the arguments from the left before, but this idea that a baby on its due date still has no constitutional rights? That really takes the cake."},{"comment_id":"10153255897157894","commenter_b":"She has a problem period","commenter_a":"Somebody has a problem with authority","post_message":"Azealia Banks Under Investigation for Allegedly Beating Up a Security Guard [Video]"},{"comment_id":"555638054626774","commenter_b":"monkey bitch","commenter_a":"Seriously? Get a life! This is none of your concern....","post_message":"After this Obama staffer quit, he leaked something disturbing secret about Michelle. This is a joke. She needs to be kicked out of the White House. Do you agree Michelle Obama is a disgrace?"},{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: \"This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.\" Watch complete press conference here: @webpagelink"},{"comment_id":"1233016690120338","commenter_b":"I would say #NeverHillary. Write in Bernie OR anybody else. The woman is so corrupt.","commenter_a":"\"Superprepared warrior\" is absolutely nothing you should be proud of. You're a disgrace to world peace and America. America will never elect someone as insidiously corrupt as you. Hope the FBI comes knocking soon!!!","post_message":"“On April 19, New York Democrats will have unusual say over the party’s nominee. They have in Clinton a superprepared warrior realist... By choosing Clinton, Empire State Dems would powerfully signal that the party has gotten real about achieving long-sought goals.” —New York Daily News nydn.us/1Vn9bcK"},{"comment_id":"10154212192071955","commenter_b":"Stupid troll whore","commenter_a":"TRUMP!!! lets see. he thinks SADDAM HUSSAIN is great!! makes fun of people with medical problems! AMERICANS wages are to high !! P.O.W.S are losers!! he is a draft dodger!! will not show AMERICA his taxes!! he did say women are bimbos pigs!! he has so for 3500 lawsuits against him not paying his employees!! all of his products are made in other countries!! he flip flops more than a fish out of water! said he will be self funding now he has his tin cup out!! he is the king of bankruptcy!! Donnie only cares about Donnie and his golf courses!! TRUMP NEVER!!! OHIO FOR HILLARY!!!","post_message":"ISIS KILLS 5,200 IN MONTH"}]
