[{"comment_id":"10153797525542183","commenter_b":"@username No it was the racist Obama that started this long before Trump was running for president. He wants to incite the Blacks to get them out and vote Democrat so he had to get the media to claim Blacks were being killed by cops. The only thing he left out was they were Black criminals attacking cops that were being killed.","commenter_a":"Obama is the poster boy for the \"Black Lives Matter\" racists. Obama started this along with his media puppets to get Blacks to vote Democrat. The Democrats do not care how many cops or law abiding Blacks have to die to get and keep their power.","post_message":"Don't expect a word of this to sink in with those suffering from ODS."},{"comment_id":"675106442643073","commenter_b":"Well, you are just a stupid BITCH! What say you now?","commenter_a":"that would be you Warren and you're a loon.","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"10153097402831748","commenter_b":"Michael Savage you are an ignorant swine prejudice d Jewish imigrant not worthy of comment. You are inciting racial war!","commenter_a":"And you may as well be...oh hell-I can't think of anyone that I want to insult that badly. You are in your very own camp of What-the-hell??","post_message":"Michael Savage asserts \"[Obama] may as well be Charles Manson” for inciting racial tension in America."},{"comment_id":"1680724472211527","commenter_b":"The falwells have been stealing and lying to americans for years. So it goes without saying thieves run together.","commenter_a":"Fallwell has lost his gourd.","post_message":"What a great honor- the Reverend Jerry Falwell Jr. of Liberty University, one of the most respected religious leaders in our nation, has just endorsed me!"},{"comment_id":"1198460870230286","commenter_b":"Women have it Harder then men? Who has to work in construction for his whole life if he doesn't have an good education? men do. Who has can't just suck dick and flash their tits or be a stripper or be a prostitute to get easy money? Men can't. So listen here you ugly fucking single mother in practice bitch you should've been caught in the condom.","commenter_a":"Stop boner shaming! Girls get to flaunt their sexuality. They get to show off their nipples. Then guys have to hide boners. You know how uncomfortable it is to flip a boner into your waist band Only some people breast feed. None of you would be here without a boner FREE THE BONER","post_message":"You! #WSHH"},{"comment_id":"10153332905444726","commenter_b":"you ladies have silly opinions","commenter_a":"Who in the world is this guy? Why does anyone care what he says? Why isn't he doing something. Instead f criticizing, why isn't he doing something?!!!!","post_message":"WATCH: Byron Allen Calls Obama a White President in Black Face"},{"comment_id":"906483276114592","commenter_b":"Oh shut up Jindal you backward cretin. The world's views have changed and long overdue. I am glad to see that people can choose to marry whomever they want. We all live on this planet and all should be able to marry who they choose.","commenter_a":"Separation of Church & State! What part of that doesn't this fundamentalist christian rube understand?","post_message":"“I hold the view that has been the consensus in our country for over two centuries: that marriage is between one man and one woman. \" -Gov. Bobby Jindal"}]
