[{"comment_id":"1502468899813234","commenter_b":"You mean his other bitch. First bitch is Michelle. Lol","commenter_a":"If you listen you can here Louisiana's governor kissing Obama's ass cause he is afraid Obama will sic his bitch Killery on him and he will suddenly \"commit suicide\" or die in s plane crash,\\\\","post_message":"Oh, it's okay if OBAMA doesn't visit Louisiana when they're dealing with massive floods..."},{"comment_id":"1112383468868962","commenter_b":"So she's been here illegally since 1993........of course she'd vote for a criminal.","commenter_a":"If Facebook was not a thrown for liberals, and they removed news pages for being one sided, this would be the smoking gun","post_message":"She survived the holocaust — and years later, she’s getting her citizenship so she can vote for Hillary Clinton @webpagelink"},{"comment_id":"1116440755118842","commenter_b":"O the transcripts, that was so lame lady. #LameLady","commenter_a":"Bernie did well as always I believe him. I'd like to remind he Secretary you have to win the primary first. I'm checking out now, I just can't stand to listen to her. I don't believe her I don't trust her.","post_message":"For updates from the #DemTownHall in Nevada, check out our liveblog: @webpagelink"},{"comment_id":"10155295844155354","commenter_b":"And you should get absolutely NOTHING if you are here illegally.","commenter_a":"If you did not go through the proper legal channels to enter this country, you are illegal and your ass should be deported!","post_message":"NYC's New Illegal Alien ID Program Includes Free Membership to 33 Top NY Venues, Including the Metropolitan Museum of Art."},{"comment_id":"10153036681682235","commenter_b":"You bitch I hope he shoots you right between your eyes.","commenter_a":"it is a sick movie about a truly sick man who was used by his government. Instead of treating his sickness they increased it and used it to kill.","post_message":"Fox News host gets off on killing."},{"comment_id":"10153138059356336","commenter_b":"Why women think they have to expose most all of their boobs is beyond me. Not sexy at all, just crude and tasteless","commenter_a":"Need to prove it? Does not \"represent\" anybody.","post_message":"\"I decided that I wanted to do it not only to represent myself as a professional athlete and a golfer, but to represent just all women athletes in general.\" LPGA golfer Lexi Thompson appeared on 'Fox & Friends' to address criticism of her controversial \"GolfDigest\" cover photo."},{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral. Shared by Occupy Democrats, LIKE our page for more!"}]
