[{"comment_id":"10153409867621051","commenter_b":"Where is your neighborhood bitch I'll be there with bells on think it's a game","commenter_a":"You darkies try and pull a stunt like that in my neighborhood , you'd be leaving in a body bag . KKK TIME !!","post_message":"Beating this teen girl senseless wasn't enough for these women. They also decided to leave a special message on her forehead."},{"comment_id":"834047250056984","commenter_b":"NO MORE ILLEGALS IN THIS COUNTRY ON WELFARE!","commenter_a":"Ladies and gentlemen, the next president of the United States, Donald Trump. Trump train all the way to the white house!!!! #trump2016","post_message":"Thank you Illinois! #SuperTuesday #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."},{"comment_id":"10153521942669369","commenter_b":"Criminals will just buy another brand.","commenter_a":"Good. Maybe less guns on the streets.","post_message":"It's the end of an era."},{"comment_id":"905390669594112","commenter_b":"@username you must have a patheticly small one if it turns into an innie","commenter_a":"If you have an innie, use the women's. If you have an outie, use the men's. That's not difficult.","post_message":"BREAKING: The Supreme Court just ruled on their first transgender case..."},{"comment_id":"10152947380749099","commenter_b":"Yes, because women never get pregnant on birth control....","commenter_a":"If women would practice birth control then these horrible things wouldn't happen. Bless their little souls. May God have them in his embrace.","post_message":"A man found two dead fetuses wrapped in a blanket on the street @webpagelink"},{"comment_id":"10152734015363525","commenter_b":"going to get cold tonight!!","commenter_a":"Wtf...???","post_message":"Road trip to Lakewood Ranch. Who's in?"}]
