[{"comment_id":"1128902297147109","commenter_b":"go home...STFU!","commenter_a":"Kasich you are an idiot!!!!!","post_message":"John Kasich said of the idea: \"It doesn't feel right.\""},{"comment_id":"10154134849200695","commenter_b":"Sorry that you have to know the pain :( if you want to follow along like my page @username Walks ..I'll be posting updates there along the way","commenter_a":"I am walking across America this year in honor of my sister who died of an overdose. I am going from Delaware to California and telling people about this epidemic and about Good Samaritan laws that protect people from going to jail if they call 911 for help when they see someone overdosing. @webpagelink","post_message":"A powerful new drug is triggering a spike in overdose deaths in Atlanta & across Georgia. Where the pills are coming from and the urgent warning from experts at the CDC, today at 5."},{"comment_id":"1576359559329284","commenter_b":"She's enabled men her entire life! Her big weakness ... Last thing we need is a woman enabler running America.","commenter_a":"Did she really just compare Donald trump to native Americans going off the reservation?","post_message":"Hillary Clinton brushes off Donald J. Trump's sometimes personal attacks against her as him being \"off the reservation\" — something she said she has experience with. @webpagelink"},{"comment_id":"10157069343155354","commenter_b":"@username that is exactly what I said she would be the second biggest mistake","commenter_a":"It is about time all realize all that comes out of his mouth are lies he has seven more months to tear our country apart I saw this before his first election do not make the same mistake twice to vote for Hillary she is a continuation of Obama and if she gets in the only way we can restore our fore fathers Constitution is through force I am a Veteran and will stand by the oath I took at enlistment to defend the Constitution against all enemies foreign or domestic so help me God do not screw with my country","post_message":"Obama is a global rock star no more..."},{"comment_id":"10153229329259087","commenter_b":"Check out this bitch","commenter_a":"Oh, a little tidbit that maybe Trump supporters don't know: Trump's current wife is a former almost porn star and underwear model for a wife. Yep, just what we want in the FLOTUS! Someone that EVERYONE can know and see what she looks like naked, and on all fours... TRUE","post_message":"GOP presidential front-runner Donald J. Trump went on the offensive on Thursday morning, attacking cable networks for treating him unfairly, slamming several presidential rivals as \"shrill\" and inexperienced, and pushing back on Pope Francis's opinions on climate change and immigration."},{"comment_id":"10156232321860354","commenter_b":"Go make us a sandwich bitch!","commenter_a":"Ah shit","post_message":"Get ready. Here it comes..."},{"comment_id":"460063127508901","commenter_b":"I bet the GOP hate her since she actually has a heart.","commenter_a":"Well said","post_message":"Wow is right."}]
