[{"comment_id":"1022294177808818","commenter_b":"Just normal housewife.","commenter_a":"Meat grinder, feed hogs, use poop for fertilizer, only positive outcome...","post_message":"Not even a little tiny bit sad over this. Nope."},{"comment_id":"10153483775401409","commenter_b":"You are a troll anyway. I can tell by looking at your page. Funny thing is you have a picture of the twin towers on your page saying never forget but you want to let illegals stay and I bet are all for the refugee program.","commenter_a":"Its because Trump loves attacking women but not his own. I bet he doesn't treat his wife good at home and only likes his wife and daughter as sex objects to him. He's a disgusting man.","post_message":"Here's how Heidi Cruz responded after Donald Trump threatened to 'spill the beans' on her Tuesday."},{"comment_id":"10153112992879753","commenter_b":"How extremely sad... :( and the parents were to take CARE of her. The boy should be taken away...","commenter_a":"they need to be charge my grandson only has to say his ear hurt and it time to do something they are painful so put them away","post_message":"One-year-old Hope Delozier died from an ear infection because she couldn't count on the two people she should have mattered to the most. BS excuses. @webpagelink"},{"comment_id":"10153834090031336","commenter_b":"The true face of Islam! This is what the Quran says about non Muslims! Quran 2:191 Slay the unbelievers wherever you find them; qurann:3:28 Muslims must not take the infidels as friends; quran 3:85 Any relegion other than Islam is not accepteble; quran 8:12 Maim and crucify the infidels idf they criticize Islam; quran: 8:12 Terrorize and behead those who believe in scriptures other than the Qur'an; qurann 8:60 Muslims must master all weapons to terrorize the infidels; quran 8:65 The unbelievers are stupid; urge the Muslims to fight them; quran: When oppertunity arises kill the infidels wherever you find them; quran 9:30 the jews and Christians are perverts. Quran 9:123 make war on the infidels living in your neighborhood; quran 22:19 Punish the unbelievers with garments of fire, hooked iron rods, boiling water, melt their skin and bellies; quran 47:4 Do not hanker for peace with the infidels, behead ...","commenter_a":"Hey Obama keep bringing your Muslim brothers here in America so we can have the same thing done here at home! (The Syrian refugees mixed in with the terrorists) RIP to the innocent souls","post_message":"Breaking News Update: At least 100 people have reportedly been killed inside the Bataclan concert hall in Paris. @webpagelink"},{"comment_id":"1041072545948147","commenter_b":"You look like a witch already","commenter_a":"this the third post i've seen with this baby and all the \"after\" babies are different babies...the jig is up!!! i'm starting to suspect the witchcraft claim is true...this baby has changed to even 3 different complexions and facial features or somebody has nothing to do by come up with lies to make themselves feel righteous!!!!","post_message":"A little positivity out of a horrible situation 🙏 Baby Hope, who was found starving on a street in Nigeria after he was abandoned by his family over accusations of witchcraft, makes extraordinary improvements since he was helped by Danish aid Anja Ringgren Lovén."},{"comment_id":"1056318254456150","commenter_b":"It's not an illusion. It's fact. Nothing like this has happened in 38 yr. Life comes with no guarantees. Accidents happen!","commenter_a":"Yeah, but I'm sorry . . . Disney has created this illusion of fantasy and safety. The illusion that one can experience fear and threat in a safe environment. In fact, they have made millions (billions) of dollars designed on that premise!","post_message":"\"This is Florida, and it's not uncommon for alligators to be in bodies of water.\""},{"comment_id":"10153307590149087","commenter_b":"Bitch got a face like a monkeys nut sack....to friggin ugly to be president","commenter_a":"Of course....he rocks!","post_message":"A poll of Iowa voters found Dr. Ben Carson decisively defeating Hillary Clinton in a hypothetical general election matchup."}]
