[{"comment_id":"1129911067026242","commenter_b":"Well said my friend....well said!! Megan Kelly WILL tear them apart...no doubt about it!","commenter_a":"Oh trust me they are in for a rude awaking during this interview. Big mistake if they think it will be a walk in the park. Megyn Kelly will rip them a new one. She is awesome at her job and takes no prisoners. Fox News is the only station not on Obama's payroll. ( not that this has anything to do with him) but it's the only news station were you can expect to hear the truth!!!! Love Megyn and Fox!!","post_message":""},{"comment_id":"1710328329254279","commenter_b":"@username they are too stupid to listen.....republicans are turning into the lowest pond scum.....shit for brains","commenter_a":"I don't like the media. They don't publish the news unless it goes there way.","post_message":"WHOA This is going to start a RIOT... Obama deserves to be in JAIL!"},{"comment_id":"1427245267295499","commenter_b":"Half a gallon of milk. $2.50, a box of cereal can be found for under $5 in your local hood supermarket lol come on people, don't be this stupid. Don't be the person who goes out for $7 cereal.","commenter_a":"If it comes with refills, I'm in!","post_message":"It better be a gr-r-reat bowl of cereal."},{"comment_id":"1233839776660853","commenter_b":"Bet they sold a lot of papers....","commenter_a":"Couldn't care less.","post_message":"NYPOST runs naked pics of Trump's wife... again"},{"comment_id":"10154168585709726","commenter_b":"She will be worse and any of the others. Idiots","commenter_a":"Whoever gets the nomination could run a brilliant series of ads about Hillary's War on Women.","post_message":"Abortion rights group looks to spend big to secure Clinton victory in November."},{"comment_id":"10154133671460950","commenter_b":"There was only 1 person who refused to vote guilty all 12 have to agree, this piece of shit refused to vote guilty. There were 11 people who voted guilty","commenter_a":"Its the south and besides he had an all white jury and he shot the man in cold blood it was caught on camera and the jurors call it a mistrial","post_message":"WATCH: Judy Scott, mother of Walter Scott, reacts to a mistrial being declared in Michael Slager's trial: \"It's not over 'til God says it's over.\" @webpagelink"},{"comment_id":"1067594940000226","commenter_b":"#DumpTrump","commenter_a":"The ultra right wing justices that have been appointed to the court over the past 5 decades have done more harm then all the republican obstructionism. Obama needs to fill the seat ASAP with someone who will defend Roe v Wade, and keep the EPA on track to clean up our air and water for once and for all.","post_message":"Republican hypocrisy in a nutshell... Thanks to Democratic Underground."}]
