[{"comment_id":"522124781280810","commenter_b":"And a thug!!!","commenter_a":"He's a terrorist.","post_message":"Police say they \"don't have any information on this individual's mentality, or his ideas or ideology.\""},{"comment_id":"707413306095459","commenter_b":"She have a bird on her head?","commenter_a":"Illegal people","post_message":"LIVE NOW: The Phoenix City Council is talking about a proposal that will designate the city as a Sanctuary City. STORY: @webpagelink"},{"comment_id":"1143510442327091","commenter_b":"I will personally go to the Springs to make sure this woman is defeated in her next election period!","commenter_a":"Time for her resignation!","post_message":"“The true instigator of this violence and all violence at any Planned Parenthood facility is Planned Parenthood themselves.\""},{"comment_id":"1280473441987748","commenter_b":"Why is it that when someone makes a valid point. He or she is told to leave. His country was solely built on the backs of slaves. Leave a country you built. How bout leave a country you stole","commenter_a":"Don't like or agree then leave the country if shit offends you... like mama said I'm pretty sure the grass isn't greener on the other side but your more than welcome to check if ya don't like it here just don't let the door hit ya in the ass on the way out ....","post_message":"Massive respect to Colin Kaepernick for having the courage to speak out!!"},{"comment_id":"1045180198948491","commenter_b":"Yeah @username all seemingly Noble reasons however... Trump is a sleazebag so regardless of whatever Noble reasons you may have... The end result is still the same. Let me explain to you about how Germany does things. They have what's called social democracy. Everybody gets Healthcare everybody gets an education not just the wealthy. Donnie's cabinet controls more wealth then 95% of the country and you honestly believe he is going to do what's best for America. You're a bigger fool than I could have imagined","commenter_a":"You people are more ridiculous than I ever imagine... What are you think she's going to do privatize public education... The woman barely has a clue as to how the education system works in the first place she has no real understanding of Education in general and yet she's going to revolutionize education in America... Sure she is... Another far-right right hair-brained scheme to put dollars in somebody's pocket","post_message":"Ignore the noise!"},{"comment_id":"1225058540866079","commenter_b":"Got to Hell Nancy Pelosi! You are lost.","commenter_a":"Brain damaged fool! You're a disgrace!","post_message":"The American people should know: central to the Ryan budget is voucherizing Medicare and cutting Medicaid. Seniors have a lot to lose."},{"comment_id":"10153770425869153","commenter_b":"You can't possibly be that stupid Christine ....","commenter_a":"just read where radical islamic muslims will come in with Syrian refugees so yes I agree with Trump","post_message":"What are your thoughts on Donald Trump's comments?"}]
