[{"comment_id":"1407318236234112","commenter_b":"@username seek help and do it quickly!","commenter_a":"@username is under investigation by the FBI, she should not be allowed to run for President or own a gun or have people hired by her having guns there are laws against organized crime and she should be put on a no fly list, but because the Government is corrupted and is allowing Hillary to sell favors to Americas enemies which is Treason she'll get away with it.","post_message":"A great day to hit the campaign trail in Ohio with Elizabeth Warren."},{"comment_id":"991233837660061","commenter_b":"Fuck them, go back to the shit hole you crawled out of.","commenter_a":"If our culture offends u get out!","post_message":"First bacon, then bikinis, then beer and now sports fans should watch their ... wardrobe selection so not to offend The Religion Of Peace? @webpagelink"},{"comment_id":"1495082587178156","commenter_b":"Its not a city...its King County....so it wouldn't be the city that pays itd be king county...","commenter_a":"How big would the fine be if a private corporation had done this? Make the city pay that! This should never happen to our waters. (edit added: I was mistaken in my initial post. King County is responsible for the treatment plant, not Seattle).","post_message":"Roughly 100 million gallons of untreated sewage and rainwater has dumped into the Puget Sound after an equipment failure at a sewage plant near Discovery Park. >> kiro.tv/SewageIntoSound For a report on KIRO 7 News at 5, Graham Johnson is finding out what’s being done to get the plant working again. Watch on-air or kiro.tv/LiveNews"},{"comment_id":"10153208287689087","commenter_b":"@username ... Trump was the topic being discussed. TRUMP didn't start wars.","commenter_a":"Rand Paul.. u r not only a sore loser, u r also a isolationist. We di not want America to be a isolationist nation. We like Trump and his \"make America Great Again\" message. We are REAL Republicans wanting real RESULTS, not words.","post_message":"“The message hasn’t penetrated yet that Donald Trump isn’t one of us. He’s barely a Republican. He’s been a Democrat,\" Rand Paul said. “I think ultimately when voters fully grasp who he is and what he supports, I think they’ll run away with their hair on fire.\""},{"comment_id":"1156042484488515","commenter_b":"Amen.....She is a disaster ... vote Trump!!!","commenter_a":"Mr. Hannity. you can talk this forever and they will not change. It is sad really. Appreciate your efforts and continue with your hard work exposing what is wrong with politicians. All of them!","post_message":"\"It's a choice between Donald J. Trump, a candidate who says he'll drain the swamp in Washington and bring about real change, or Hillary Clinton, the most corrupt career politician who's ever run for this office.\" – Sean Hannity"},{"comment_id":"10153216213261717","commenter_b":"Skars the reason people are so upset is because the bitch is a fucking lesbian for god sakes","commenter_a":"caitlyn jenner may be transgender but she doesnt believe in same sex marriage. she isnt an insparation at all. shes a selfish bitch","post_message":"Caitlyn Jenner prays with fervently antigay preacher"},{"comment_id":"10153641029539205","commenter_b":"the hell?","commenter_a":"Wow","post_message":"George Zimmerman Goes After Trayvon's Family"}]
