[{"comment_id":"1336076649746676","commenter_b":"It doesn't bother me at all","commenter_a":"Why does everyone need a day? Doesn't this kind of thing really inadvertently promote bias by constantly bringing up the differences between us all? We are all human and we all have strengths and weaknesses in different varieties this should be a strength among us not a divisive problem. If everyone would stop talking about it so much things would get much better. Make your decisions about people on an individual basis.","post_message":"Today is International Women's Day and to celebrate, we will be posting a series of images commemorating extraordinary women in the field of science that we believe you should have heard of. #WomenYouShouldHaveHeardOf Image courtesy Jewish Chronicle Archives/Heritage-Images."},{"comment_id":"10152967857461519","commenter_b":"Yeah, I am sure all the female open carriers/ gun owners are using firearms to compensate for their small penis'","commenter_a":"Tari, have you ever actually read the second amendment? It calls for a WELL-REGULATED militia. Not just any white supremecist or Al Qaida operative who goes to a gun show. In Vermont you have fewer urban areas. It is like saying nobody gets mugged on a row boat. I am a gun owner and I really wish that buttholes like you and these NRA pimps with your illiterate interpretation of the second amendment would go help someone else. Ammosexuals are giving responsible gun owners a bad name.","post_message":"\"A law requiring people to apply for a permit before buying a handgun helped Connecticut quietly reduce its firearm-related homicide rate by 40 percent.\" Imagine how many lives could be saved if other states passed similar laws."},{"comment_id":"222401854833654","commenter_b":"Build the wall","commenter_a":"Say it to mexico, who build the wall with...? u know the answer, and it turned up very good, no illegal immigration and less crime , Israel built the wall too, and no muslims terrorist attack, bulgaria and hungary have kinda wall/fence, and no attacks, there you go...","post_message":"Those who don't know history are doomed to repeat it Details: @webpagelink #BerlinWall | #TrumpsGreatWall Join Us The Free Thought Project"},{"comment_id":"456764181180829","commenter_b":"Looking at that ugly bitch may stop people from going to McDonald's","commenter_a":"Ooh i just lost my appetite. Why would McDonalds allow this. She is so BSD about anything dealing with food and nutrition","post_message":"Would You Refuse To Eat An 'Obama' Burger? Comment 'yes' or 'no'."},{"comment_id":"10155016645768010","commenter_b":"Let's keep in mind the big picture here. Less illegals, the better.","commenter_a":"As we've learned from all his businesses, failures and bankruptcies...he is very good at spending other people's money.","post_message":"He wants to get Mexico to reimburse the U.S."},{"comment_id":"10153383817802061","commenter_b":"Super cute","commenter_a":"Dad's are important too","post_message":"WATCH: Heartwarming and powerful new message with NFL's DeAngelo Williams, Jason Witten and Ben Watson on spending time with daughters, as they do their hair and bond with them."},{"comment_id":"10153000556273855","commenter_b":"You're the most ignorant bitch here so far. Congratulations on stepping back two centuries.","commenter_a":"If a Christtian owned biz loses business for serving gays, it has the right to say, hey guys, dont take it personal, i need to make a living...go elsewhere. WTF U MEAN I CANNOT REFUSE SERVICE? THE ONLY PEOPLE I CANNOT REFUSE SERVICE IS TO BLACKS DUE TO SLAVERY AND BLSCKS BEING OUSTED AS AMERICANS SIMPLY BECAUSE OF SKIN color. Sexual stuff...can be a challenge to many. Leave people alone. Ask them to leave you alone. By the way - imFOR gay union, but not in a church.","post_message":"First Yelp, now Angie's List!"}]
