[{"comment_id":"10152522515306717","commenter_b":"Trust bitch, more Gays will flock to Nikon, you're obviously a total moron","commenter_a":"Won't be buying anything from that company or my family or friends Adam and eve people not Adam and steve","post_message":"Click here to follow LGBTQ Nation on Twitter: lgbtqn.at/tw"},{"comment_id":"10153658944994726","commenter_b":"Hillary grow up and stop the whining!You are worth $2 millions! or billions?","commenter_a":"What a Dumbell","post_message":"WATCH: Hillary: I’m an ‘Outsider Candidate’"},{"comment_id":"10153033026636336","commenter_b":"She should have let him back on","commenter_a":"Somebody better contact Social Services about that bus driver! He let a child walk 1/2 mile alone!","post_message":"An Indianapolis mother is outraged after her 6-year-old son was forced to walk home a half-mile through knee-deep snow after a bus driver dropped him off at the wrong stop and wouldn't let him back on."},{"comment_id":"10154267425314160","commenter_b":"Another nasty woman on the side of evil...GOOD WINS","commenter_a":"and you are Madeline Not So Bright","post_message":"\"There is a great term the Soviets used to use.\""},{"comment_id":"1366518346740365","commenter_b":"Emilie Frost & your not even ginger anymore","commenter_a":"....","post_message":"Fans of Prince Harry and Ed Sheeran will be celebrating soon!"},{"comment_id":"1130006897113975","commenter_b":"Get out of America then","commenter_a":"It is a sad day in America. One of the most disgusting men in in our country won the election. I am so sickened by the citizens who would cast their vote for such an evil man. Do they really feel he is person to speak for us as a nation. I find him so repulsive by his words and actions.","post_message":"THESE 23 HOLLYWOOD IDIOTS PROMISED TO MOVE IF TRUMP WINS..... LET'S HOLD THEM TO IT"},{"comment_id":"402875396503722","commenter_b":"silly sarah sure is a pompus bitch","commenter_a":"Rather look at her vs Billary! What a pompous bitch!","post_message":"Sarah Palin had some strong views on Hillary Clinton's email accounts. Is this as big an issue as she claims?"}]
