[{"comment_id":"1321112227930500","commenter_b":"I reckon there's still a chance he'll be persuaded to step aside, and Pence will be inaugurated on Jan. 20.","commenter_a":"Looking forward to the impeachment.","post_message":"It's official"},{"comment_id":"10153745927208635","commenter_b":"So did these heterosexuals just go about Christians with strong beliefs just to cause trouble? @webpagelink","commenter_a":"It is funny how LGBT people seem to go after christians with strong beliefs in this area just to cause trouble.","post_message":"Wyoming Supreme Court may dismiss Judge Ruth Neely for refusing to preform gay marriage due to her religious beliefs"},{"comment_id":"1095662820489119","commenter_b":"She's God Damn Trash! Nasty white cunt!","commenter_a":"This is a prime example older white people are the most racist people in America the older white the younger generation is not like the old white generation they raise the kids to be racist this just don't make no sense but she got a dose of her own medicine because the world is not hateful like she is and she's in her last days she's going to die a old racist woman she have to answer to God she's trash in my book","post_message":"A black girl was harassed by an older white woman while selling candy outside a California Target for $1. But, there’s a twist. Jay Lopez, a customer at Target, saw the woman berating the girl & intervened. Restoring your faith in humanity, Lopez bought the remainder of the sweets. VIDEO---> @webpagelink"},{"comment_id":"549834655207114","commenter_b":"These women are child abusers. Where is child protection?","commenter_a":"Yes !","post_message":"These two lesbians are trying to play god with their son. This is the world we are living in today. Do you think this is wrong?"},{"comment_id":"550108651839249","commenter_b":"rip Borat","commenter_a":"@username SO PUMPED this actually looks lit","post_message":"Winter is coming, to Kazakhstan. // Game of Thrones"},{"comment_id":"10153590307723837","commenter_b":"De p***a WTF is wrong with the human race","commenter_a":"@username here's another one to the list","post_message":"DON'T HIRE HER! A baby sitter brought the kids she was watching to help her rob a bank! But why she robbed the bank makes it even worse!!!"},{"comment_id":"10153850610670575","commenter_b":"We will see...won't we? Vote Trump and Mexico will pay for the wall. All the others will not put up a wall. All the other candidates don't care about how many drugs are coming across the borders to ruin America and her children. Trump 2016.","commenter_a":"If he doesn't check his tone, he'll be out there with shovel in hand building the well.","post_message":"Maybe not you sir, but Mexico is paying for it!"}]
