[{"comment_id":"10153330405506130","commenter_b":"Exactly. Plus her job is simply to determine if a couple qualify for marriage under the law, not to marry them. She isn't advocating gay marriage by signing the licenses, her signature simply states they are lawfully allowed to wed. Her fucking religious views don't even apply to her job, the fucktard! She is simply trying to use religion to justify her bigoted attempt to judge others and not do her job. She is an employee of her state/county, and bound to the law. If she wants to have her religious views dictate her job she needs to be a clerk for a church. Then she can be a bigot all she wants.","commenter_a":"She is a public servant...to serve ALL the people...not just the ones she agrees with...there's a little thing called \"separation of church and state\"...","post_message":"\"We cannot be held hostage to the theatrics of religious extremists.\""},{"comment_id":"989796557698481","commenter_b":"Women aren't human beings?","commenter_a":"women will die?????? really???? this is incredible... what about how many BABIES HUMAN BEINGS will die???????????","post_message":"Breaking ranks"},{"comment_id":"1169884533107797","commenter_b":"Google William Jennings Bryan or Dixiecrats. Tories and Confederates were conservatives too. Wrong side of history since day one.","commenter_a":"The first black senator and congressman were Republicans :)","post_message":"Only one black woman has ever served in the Senate. Will that change this year?"},{"comment_id":"10153117013549740","commenter_b":"We wouldn't have any thugs!","commenter_a":"Good idea","post_message":"\"We need to get around this idea that you can resist arrest. You can’t. You just can’t do it. It results in potential injuries to the officer, to the suspect. And we need to change that, and the way to change that is to start penalties for it.\""},{"comment_id":"10153492886881973","commenter_b":"I gave up.","commenter_a":"Could you make the article even less readable on a mobile?","post_message":"Our pop culture reporter didn't think \"Spotlight\" deserved Best Picture last night, so he went back to give us his picks from the past 40 years."},{"comment_id":"447409202129260","commenter_b":"She is the best candidate!","commenter_a":"Dear God deliver us from this evil!","post_message":"Slap Yo'self! www.eaglerising.com"},{"comment_id":"480993755358552","commenter_b":"She must be from NYC she can go to hell","commenter_a":"Screw her","post_message":"This Democratic congresswoman from New York just announced her plan to reduce gun violence. I wonder how it will be received."}]
