[{"comment_id":"10153231329598855","commenter_b":"She probably extored enough money to live off of so her job is nothing. What a narrow minded turd.","commenter_a":"WONDERFUL! Now if we can get all local, state and federal gay bashing employees to follow suit, possibly the USA will no longer be looked upon as the greatest hate nation on the face of the planet.","post_message":"She'd rather give up her job than grant marriage licenses to same-sex couples."},{"comment_id":"1528594670781352","commenter_b":"Death penalty. Nothing less. Deporting them isn't going to change anything. They'll be back and will do this again.","commenter_a":"I love Obama","post_message":"If we don't have a border, we don't have a country. I want people to come in LEGALLY and follow the laws of our great country!"},{"comment_id":"10155910391265725","commenter_b":"Take America back. STOP buying crap from other countries.","commenter_a":"DONALD TRUMP: Speaking what everyone is thinking. TAKE AMERICA BACK.","post_message":"Wow, some new and even greater polls-- thank you!"},{"comment_id":"10152704207984135","commenter_b":"Don't tell me how to live my life, bitch!","commenter_a":"And now on this part of our safari, we see on our right a fat Rino. The gazelle on it's left hasn't to worry, for Rinos are herbivore. This particular Rino, unfortunately, is an omnivore. Watch out, Laura!","post_message":"w/ Laura Ingraham at #CPAC2015"},{"comment_id":"998169870194483","commenter_b":"Dicks","commenter_a":"How the hell does anyone defend this crap?","post_message":"Their Orwellian alternative to paid family leave -->"},{"comment_id":"10152949428967061","commenter_b":"who freaking cares,she need to get her tubes tied !","commenter_a":"none of anyone's business....really don't care....","post_message":"Bristol Palin announces second pregnancy; says she knows it will be \"huge disappointment\" to many: @webpagelink"},{"comment_id":"10154100012033598","commenter_b":"G","commenter_a":"Disgusting, the price of an innocent life","post_message":"Ex-Planned Parenthood Director: They Told Me Every Baby Killed in Abortion Made Them $313.29"}]
