[{"comment_id":"1159055580820855","commenter_b":"China Eddie, we western women have a CHOICE to wear what we want when we want, unlike you poor suckerers who must obay. You poor poor deluded fools.","commenter_a":"Islam will reform when they relinquish women from its oppression","post_message":"Mothers and wives pose in the embroidered boreghehs that some start wearing from the age of nine"},{"comment_id":"1401080203318363","commenter_b":"Well eventually there will come a day of reckoning.","commenter_a":"Notice how these people claim to be Christian meanwhile they do the opposite of what Christians do & they dislike true Christians as much ad they do people of other faiths, they quote the bible to support their homophobia but they don't except & love people who are different, like God says that they should","post_message":"This is absolutely deplorable."},{"comment_id":"10155208446069411","commenter_b":"Islam... set your clock back to 7th century as a women you will get a lot of respect....from those goat..f......wake up...woman","commenter_a":"Allah snickerbar...blowing up","post_message":"Fire is believed to be caused by an 'electrical problem' - @RemyBuisine on Twitter"},{"comment_id":"895683467194573","commenter_b":"He's not crazy, his mother had him tested!","commenter_a":"I know he's an idiot","post_message":"President Paul?"},{"comment_id":"10152922353911051","commenter_b":"Someone should dangle her nasty evil ass with their hands around her fu****g neck!!!! evil bitch","commenter_a":"I'm sure the mom had a tight grip on the child when she did that. In saying that I'm hoping the kid was being punished for doing something really fucking stupid for her to take it that far","post_message":"Neighbors couldn't believe that a mother would do something like this to her young son."},{"comment_id":"10153606624740667","commenter_b":"How's that gun free country law working out for them now ?? President Carter band Iranian Muslims during the hostage crisis & deported over 20,000 Iranian students, Iran is a Islam Islamic nation. Democrat's never called him a racist. US immigration Laws cover religious test for immigrants !! The AR 15 is not a military assault rifle & not fit for hunting deer or elk by some hunting laws, it's a singal shot gun !! Some pistol clips holds 15 rounds of ammo !! PS: Hillary is on record in support of a wall on US Mexican border !!","commenter_a":"So sad. :(","post_message":"BREAKING: Jo Cox has died."},{"comment_id":"10153079679845950","commenter_b":"What a dumb ignorant bitch","commenter_a":"When it's not your turn, it's NOT your turn! That is how press conferences work people!!! TRUMP 2016 :)","post_message":"JUST NOW: Donald J. Trump tells reporter Jorge Ramos to sit down, has him escorted from press conference: \"Go back to Univision!\" \"You can not deport 11 million people,\" he yells: @webpagelink"}]
