[{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.” Read more here: @webpagelink"},{"comment_id":"577340679100840","commenter_b":"If you don't leave america it will be the end of us","commenter_a":"Yeah. We've survived Obama. Barely.","post_message":"And that's not all he said either..."},{"comment_id":"947304708651886","commenter_b":"I agree ,however the woman has he ultimate protection! POLITICAL PRIVILEGE!!","commenter_a":"then WHY isn't he requesting it/","post_message":"The pressure is growing..."},{"comment_id":"1107974842571087","commenter_b":"She lies and lies and lies and lies and . . .","commenter_a":"I AM SO DISAPPOINTED BY YOUR NEW JOB DR BEN CARSON , YOU WERE BETTER AROUND WHITE COAT....[...]","post_message":"Is anyone surprised?"},{"comment_id":"849416281771667","commenter_b":"Not all women are evil feminists... Only feminists are evil...","commenter_a":"Abortion was legal by common law we brought with us from England at the very beginning of this country, the 1600's, women could abort up until quickening using herbs, falls, punches to the stomach, abortion potions were big business and freely advertised. The Founders did nothing to change this either. Try Googling the history of abortion in the US.","post_message":"Pretty much."},{"comment_id":"10153310344686157","commenter_b":"If she gets droped off by the bus shes to young for you bruh","commenter_a":"If her shoes light up when she walks she is too young for you bro.","post_message":"Investigators believe 23-year-old Estevan Garcia sent naked Instagram photos to a 14-year-old girl. He worked for the Donna school district as a security guard."},{"comment_id":"930466986973481","commenter_b":"I believe that the Goverment ( teachers ) should mind their own and stay out of our lives and work on being a better teacher ! It's up to the parent to decide when it is appropriate time to educate the child . Teaching a child inappropriate touching is about the limit that the school should be doing . Nothing else !","commenter_a":"Just be open and honest with your kids about sex. Answer questions, create an environment that allows for discussion and be open minded when they tell you what they think. It's not a bad subject. It's part of life.","post_message":"Would you call this educational plan \"age-inappropriate\"?"}]
