[{"comment_id":"422474541282890","commenter_b":"Bring it on motherfucka","commenter_a":"1490882780941608ing Joseph Cortes @username Matt Flambard Leigh Cramphorn","post_message":"Xbox One vs. Sony PlayStation 4 gaming is finally becoming a reality."},{"comment_id":"10153183802333188","commenter_b":"\"The walking dead\" are serving as most of our representatives in Washington, take a good look next time someone speaks to the Congress.","commenter_a":"Why do you think it's so good? It prepares us for what we might expect in a SHTF scenario.","post_message":"I don't watch The Walking Dead like most people..."},{"comment_id":"10156577406325231","commenter_b":"Girl tell it.","commenter_a":"Did anyone question how much the late Nancy Reagan spent during her time in the White House, especially on all that expensive china she had to eat off of and let's not even discuss her designer clothing, shoes, and handbags and the country was in a recession then too. Leave these children alone!","post_message":"How about people stop worrying about the price of the first family's clothing?"},{"comment_id":"10155959716910725","commenter_b":"One last word....Yes AMERICA is gonna start showing her TRUE COLORS AGAIN!! Prepare!!","commenter_a":"For the first time in many MANY YEARS, my wife and I think we may very well take our country back!! GO TRUMP!!!","post_message":"We must stop the crime and killing machine that is illegal immigration. Rampant problems will only get worse. Take back our country!"},{"comment_id":"10152805783329342","commenter_b":"Kristine Bak","commenter_a":"It's been ALWAYS happening ....everywhere","post_message":"WARNING FOR PET OWNERS: There's a growing trend called dog flipping; someone takes your dog and then tries to sell it, and it is happening right here in Houston. FULL STORY ---> @webpagelink"},{"comment_id":"1707925176144398","commenter_b":"The shemale will sit alone","commenter_a":"He has no right to assume that the people who have died from gun violence would not have wanted to be able to carry That they might have been AGAINST gun free zones.. It's again his agenda if one of my family members had been one lost to these acts of violence I would demand that they NOT SPEAK ON THEIR BEHALF...THAT THE PRESIDENT make reference to the fact that he DOES NOT SPEAK for ALL CITIZENS","post_message":"The Obamas never miss an opportunity to shamelessly politicize an event. At the next State of the Union, Michelle Obama will be sitting next to an empty chair; and the outrageous reason why will have you shaking your head... Are you glad this will be Obama's final State of the Union?"},{"comment_id":"522124781280810","commenter_b":"And a thug!!!","commenter_a":"He's a terrorist.","post_message":"Police say they \"don't have any information on this individual's mentality, or his ideas or ideology.\""}]
