[{"comment_id":"1482924058407143","commenter_b":"lol you're a joke. Dude I'm older than you! But thanks for the compliment!","commenter_a":"Are you serious???? I'm black and this is sooooo ridiculous!!! It is NOT racist! I hate Neegan more than I hate this shirt....because I don't hate the shirt...at all...actually I might buy it! #TWD","post_message":"People are accusing this The Walking Dead T-shirt of being racist — is it? yhoo.it/2kMGla0"},{"comment_id":"10156907192725594","commenter_b":"He is currently behind, I am not suggesting that he is not. What I am pointing out is that EVERY SINGLE POLL gives him a much wider lead over Trump than Hillary's lead. Most importantly in swing states. Who cares that Hillary won most of the Southern states, they are not going blue. Bernie won in most of the swing states and he polls dramatically better than her over Trump in those states. He may be losing the primaries, it is probable even. However if the point of this article is that Trump is such a threat to the presumptive Democratic nominee and we need to not be distracted by the primaries than it is fair to say, who is the better candidate to defeat Trump? Maybe for the sake of unity and defeating Trump, Hillary should bow out. You know, for the common good.","commenter_a":"I think we need to start asking the question is it time for Clinton to bow out of the race. Because if our main yardstick is not letting Trump be president all the polls are pretty clear, Sanders is our best bet.","post_message":"Yet Bernie Sanders is having none of it, frequently telling the thousands of supporters who attend his rallies that he still has a narrow path to the nomination."},{"comment_id":"10152554042082623","commenter_b":"Girl bye lol","commenter_a":"It looks like a H.I.M. sticker lol also the pentagram/pentacle is an ancient symbol that represents the great spirit, and the elements air fire earth and water...upside down means nothing as there is no Satan and no Jesus. .... someone needs to read something OTHER THAN THE BIBLE HAHAHA","post_message":"A woman says she snapped a picture as soon as she spotted what she says is a symbol of evil in these school bus brake lights."},{"comment_id":"10154714016861509","commenter_b":"Now how is that wall going to work?","commenter_a":"Carlos","post_message":"It even had its own elevator."},{"comment_id":"1142026852548536","commenter_b":"Hillary is done!! all thanks to Gucifer 2.0!!! Ding dong the witch is dead, the wicked witch @webpagelink","commenter_a":"hahaha..my grandsons are proud of hillary clinton for her campaign for president..they think donald trump is a bully and bigot..says a lot for a 16 year old and 12 year old!","post_message":"A lot has changed in the past two and a half decades. But the things we’re fighting for remain the same."},{"comment_id":"10156202756245354","commenter_b":"@username, lol, I'm doing just fine sitting here on the beach. Awful life? Bitch please.","commenter_a":"How much did the Pope's dress cost?","post_message":"Pro-Tip: When bashing capitalism is your brand, it's best not to wear dresses that cost $2,300.00."},{"comment_id":"779312755503344","commenter_b":"How about in the best interest of the Muslims, they don't belong here.","commenter_a":"why do we need them here??? what benefit are they to America??? wtf....","post_message":"Is Paul Ryan in our country's interests?"}]
