[{"comment_id":"884338575001603","commenter_b":"Good Riddance to Hillary Clinton!!!","commenter_a":"It's about damn time!","post_message":""},{"comment_id":"1075067075943468","commenter_b":"@username when did Trump date any black women?","commenter_a":"This is just the beginning, folks. Racism has been given the green light as of last Tuesday night. smgdh","post_message":"\"It will be refreshing to have a classy, beautiful, dignified First Lady in The White House. I'm tired of seeing a Ape in heels.\""},{"comment_id":"1193174800771119","commenter_b":"@username and deport them","commenter_a":"Sounds to me like she's taken some pages out of Hitlers book: Meine Kaumph. Don't know if that is spelled right, but you get the idea. And I wonder how she'll feel about it when she reaches 80. (if she ever does).","post_message":"What's up with leftists having no problem 'taking people out'?"},{"comment_id":"1705740913046354","commenter_b":"Bitch!","commenter_a":"Go whoop, go now.","post_message":"Oh my gosh, I can't believe Whoopi Goldberg said this. Cancel The View right now."},{"comment_id":"1220652477966511","commenter_b":"LOCK HER UP! LOCK HER UP!","commenter_a":"Lock her up!!!!","post_message":"Live: Donald J. Trump delivers a speech at the VFW National Convention in Charlotte, North Carolina."},{"comment_id":"994057867406695","commenter_b":"3 americans tried to blow up a mosque in Kansas. No coverage here","commenter_a":"This is why we should NOT bring anymore refugees here and should return the ones that are here. We NEED to take care of our Americans first!","post_message":"An Iraqi refugee who planned to blow up two malls in Houston pleaded guilty to trying to help ISIS. @webpagelink"},{"comment_id":"1008404635861662","commenter_b":"Nasty ass bitches!","commenter_a":"Breastfeeding should be done in private. For God's sake this is an industrialized country. People should not be displaying public nudity (displaying breasts) while feeding a child. Yes it is natural to feed children breast milk. But have common decency about it!","post_message":"These defiant moms just occupied a food court to stand up for breastfeeding in public."}]
