[{"comment_id":"10153365745456749","commenter_b":"playing to the media.. he has done more to MAKE it happen again than anyone in history","commenter_a":"ALLAHU AKBAR!!!! #MMBR #M23BR","post_message":"\"In memory of those we lost, we resolved to shape a world where events like those of September 11, 2001, could never happen again, and we see this unbreakable spirit live on every day across America.\" —President Obama"},{"comment_id":"1188696831170787","commenter_b":"Because they're redneck, uneducated, bible thumping, gun grabbing Trump supporters who own arsenals, and the desire to kill a living being just eats at them so they kill innocent animals. Because that's what republican Jesus would do!","commenter_a":"They must have been upset that their sisters wouldn't fuck them... #NationalTrailerPark #YallQaeda","post_message":"Gun violence also affects those who have no voice to speak against it."},{"comment_id":"10152839305921680","commenter_b":"Not this half latino nor his wife and father!","commenter_a":"And Latino will fall for it again.","post_message":"\"As a mother, grandmother, and American, I don’t know how a person can meet these young people ... and think of threatening them and their families with deportation,\" Hillary Clinton said."},{"comment_id":"10153233297426336","commenter_b":"They come over here illegally an you birch about it so you shouldn't celebrate there customs from there country here go back there an live don't do it here","commenter_a":"You can celebrate any way you want....","post_message":"\"I do not think it is the props that are wrong, it is forgetting that this is actually a part of the Mexican heritage.\" Olga Gonzalez, a Northwestern University undergrad from Mexico, takes a nuanced look at Americans' celebration of Cinco de Mayo."},{"comment_id":"963452387028567","commenter_b":"Judy.. that is a huge part of the problem with the US today.. Dumb parents raising dumber kids. She has NO id ... can not drive nor get married nor get any medical care. How Stupid is that? She gets sick .. just stick her in the dirt right? Great parenting.","commenter_a":"That's amazing. Her parents should be charged with abuse.","post_message":"Her parents never got her a birth certificate or social security number, never took her to a doctor or let her go to school, and now she has no way of proving to the government that she even exists."},{"comment_id":"1041807992526339","commenter_b":"Bitch please!","commenter_a":"he was 14. he admitted it freely (nobody knew or said anything or asked him, he just did the right thing) and he was treated and has no reoffended. If it was your 14 year old son, better yet, shall I name all the 12, 13 and 14 year olds I went to school with that groped me??? Maybe one IS you kid","post_message":"One of Josh Duggar's relatives stepped up to the plate to defend the Right's favorite child molester by claiming that ANYONE would molest kids if there were no consequences and the right opportunity."},{"comment_id":"860902143955854","commenter_b":"That woman is a melodramatic idiot.","commenter_a":"Hey Nancy! Pot IS illegal and it STILL didn't stop him from giving it to his daughter! Legalize it already. Lets save Mexico from gang violence, free up the prisons, and start bringing in tax dollars from paper rolls and business sales. Enough is enough!","post_message":"What's YOUR take on the legalization of marijuana? @webpagelink #Pot2Blame?"}]
