[{"comment_id":"1303998932977651","commenter_b":"Your a straight up pussy for that one. News flash dumbass your girls a ho","commenter_a":"A \"real nigga\" dont sneak shit..look like he aint wake dude up till bout the 5th punch..weak shit 😂😂","post_message":"He beat his a$$! #WSHH"},{"comment_id":"10153445067641051","commenter_b":"She is a selfish bitch with no sense of humor for leaving him.","commenter_a":"I don't blame her. What a shame that he had to get drunk! Now suffer whatever it takes to get rid of other!!!","post_message":"This wife took one look at the tattoo her husband decided to get and immediately kicked him out of the house."},{"comment_id":"10152987213175090","commenter_b":"She is a liar!!","commenter_a":"'What difference does it make'!","post_message":"Why don't you want Hillary Clinton to be President? @webpagelink"},{"comment_id":"10153560422922629","commenter_b":"Hell yeah bitch","commenter_a":"This post glorifies violent masculinity.","post_message":"Two apparent members of the U.S. Marine Corps reportedly overpowered and halted the gunman."},{"comment_id":"10153736667641350","commenter_b":"She lost","commenter_a":"Crap weazel !!!!","post_message":"The woman felt her nephew was negligent for giving her an enthusiastic hug."},{"comment_id":"10153026987796051","commenter_b":"I hope that bitch never gets out alive from prison that poor little baby how can anyone do that to a baby much less a mother it makes me sick I want to knock the crap out of her that baby could not defend herself and the pain it must of went true","commenter_a":"Disgusting! Horrific, she is supposed to be her daughters biggest protector!!","post_message":"Even the police were caught a little off guard when they saw the pictures this woman had of her infant daughter."},{"comment_id":"984815688241627","commenter_b":"She is the best lying POS that know!","commenter_a":"She is the best","post_message":"“If you want a president who will tell you everything that’s wrong with America and who’s to blame for it, you’ve got plenty of other choices.…But if you want a president who will listen to you, work her heart out to make your life better, and together to build a stronger, fairer, better country—then you’re lookin’ at her.\" — Hillary today at the New Hampshire Democratic Party State Convention"}]
