[{"comment_id":"10152475655222434","commenter_b":"This has never happened at a Steel Panther concert, little disappointed. I'm an actress and I've had people fall asleep in the front row... That was pretty funny. Also Erica, if the band were that bothered by it, they would have got security to remove them from the venue","commenter_a":"Matthew Naughton","post_message":"This woman is what the kids would call \"punk rock.\""},{"comment_id":"10153243017991336","commenter_b":"Thjey Used to Hang/Lynch MF Niggerrs like that before !!!!!! Where is the Klan !!!!!","commenter_a":"and Black people want respect....frigen Animals","post_message":"UPDATE: A third suspect has now been arrested after the shooting prompted a statewide manhunt. The suspects accused of killing two Mississippi police officers in the line of duty were reportedly arrested early this morning."},{"comment_id":"10153196584554091","commenter_b":"Go marry donkey who cares","commenter_a":"As a Christian..I feel she's out of order...do your job!...and let God deal with anything else.","post_message":"She told the couples and activists that her office is continuing to deny the licenses \"under God's authority.\""},{"comment_id":"1003970486337899","commenter_b":"Oh pls woman get a grip. Really if you think that then move your was out of this co","commenter_a":"She must be racist then to think that.","post_message":"Oprah Claims White People Are The Cause Of Racism In America. What a hypocrite, she is the racist. Do you think Oprah is bigot?"},{"comment_id":"841833905948136","commenter_b":"What utter rubbish, it's the same beautiful country i have loved all my life & watched change under EU dictatorship & when my 88yr old father says \" this isn't what we fought for \" i know we've done the right thing , please don't panic people after a bumpy ride calm & Great Britain will be restored","commenter_a":"Spengler predicted this.","post_message":"\"This is not the country it was yesterday. That place has gone forever.\""},{"comment_id":"10154403443803338","commenter_b":"Stupid bitch , be serious","commenter_a":"Let me guess....they were ALL shot by white police officers.....","post_message":"Eight kids under age 10 shot in past 28 days, according to CPD."},{"comment_id":"10153414020695950","commenter_b":"A nebulizer doesn't even come CLOSE to the amount of power required for a VENTILATOR. Lady, are you freaking SERIOUS?","commenter_a":"Hope the family uses their blessing wisely now keep the lights off when not in use teach kids to open blinds for lighting in the day ...it's time people learn to turn things off when not in use to keep from having a bill u can't pay ....this firefighter was a true blessing","post_message":"After firefighters arrived at the house for a non-emergency medical call, they learned that one of the family's children requires a full-time ventilator to breathe. But the house no longer had electricity because the parents fell behind on payments, so one firefighter decided to light up the home with generosity."}]
