[{"comment_id":"10152610651920667","commenter_b":"This girl is beautiful. Mrs. Rancic is just trying to make herself relevant by saying idiotic ridiculous comments. Amazing what people will do to try and get noticed.","commenter_a":"E! Should cancel the show, before they cause more trouble for them selves","post_message":"In dishing about all the red carpet looks on E!'s Fashion Police, Giuliana Rancic cracked that Zendaya probably \"smells like patchouli oil ... or weed.\" And an angry Zendaya took to Twitter to say there is a \"fine line between what is funny and what is disrespectful.\""},{"comment_id":"480644502060144","commenter_b":"Illegal !!!! Burning the flag should be a crime!!!","commenter_a":"It will not happen but this group needs to be labeled a hate group","post_message":"Do you think burning the flag is an example of free speech or should it be illegal in the US?"},{"comment_id":"10155583130286509","commenter_b":". Unlike Obama, Trump has control of congress and can appoint to the Supreme court due to the opening. Obama never had that amount of power. Plus Obama was a moron. Trump needs to build that wall. Trump needs to build camps and round up all illegals that can be found. Put them in internment camps till they can be removed to their country of origin. Or just put them in prison like he said for 5 years if they come in the country illegally. We have our president now like the minorities had Obama.","commenter_a":"It is not Van Jones' job to correct people to take away their fears. It is the Trump camp's job to do so. Don't tell people when to feel afraid and when not. You have to make them feel safe and welcome. Donald Trump is the President now. Now he has to do his job for ALL.","post_message":"\"You need to back off.\" CNN's Van Jones exchanged hot words with a Donald J. Trump supporter who argued Jones ought to repudiate fears among protesters that a Trump administration would create camps for illegal immigrants. @webpagelink"},{"comment_id":"10153518895070326","commenter_b":"And who believes her??? This must be a \"Clinton Joke\".","commenter_a":"the old scritch she does know how to lie though,,and has lots of crooked schemes up her sleeve","post_message":""},{"comment_id":"10153573991208132","commenter_b":"Officer Donahue is a true hero","commenter_a":"My cat Quacks too!","post_message":"So. Many. Feelings."},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"},{"comment_id":"1845364932419184","commenter_b":"Little girl go sit down and shut the hell up.","commenter_a":"she is an bitter root from the tree","post_message":"Not a good choice of words, Bristol."}]
