[{"comment_id":"10153858591813279","commenter_b":"Clinton is a republicrat! When will people realize she is only \"progressive\" when it comes to lining the pockets of Wall Street, big corporations & the ultra rich?","commenter_a":"\"When [Clinton] says let talk about issues and let look forward, what she really saying is let not talk about my campaign financing, or my policy history, because it won bear the scrutiny my new, new, new progressive brand demands.\"Look, let get this straight. It wasn't very long ago when Hillary Clinton favored the TPP, the Keystone XL Pipeline and the death penalty. She also opposed gay marriage and reinstating Glass-Steagall. Her foreign policy is closer to the neocons who got us into Iraq (which she voted for) than what the American people favor. She flipped on immigration, gun control, and NAFTA. That not progressive. She attributes her changes towards progressivism to as a result of information. But as Politico points out, for most of these issues, there was no new information. For example, what changed on gay marriage, other than public opinion? It also begs a question: if Sanders ...","post_message":"The most heated exchange during last night's MSNBC Democratic presidential debate began after Bernie Sanders accused Hillary Clinton of being part of the political establishment."},{"comment_id":"10153153963941336","commenter_b":"***SCHEXNAYDER SPEAKS ON: HILLIARY*** ========================================= Is that the same Hil-liar-y who was fired from the Watergate Staff? The same weasel who could not find Rose Law Firm records for years? The same shrill potty mouth who said “I don’t recall” 23 times under oath to avoid answering? The same feminist who stayed with a known 30 year serial adulterer, bold liar and pure slime ball? Who lied and trashed women abused by her horndog perjurer hubby? Who wrote the book on arrogance with refusals and rants? Who, at the very minimum, enabled Benghazi? It is! And her 2015 slime update…HRC had an ILLEGAL private server for her State Dept. e mail! Hillary won't take questions -- at event honoring journalism... Drama over e-mail intensifies... Committee: 'Scheme To Conceal'... Violated 'clear-cut' State Dept. rules... Clinton Internal Cable Banned Use! Team Evaded Records With Instant Message... FLASHBACK: Hillary Bashes Bush Officials for ...","commenter_a":"It is obvious that @username and the other main stream media are supporting Hillary. After all, how many times do the public have to be told that she is running. It is apparent that you all are anxious to keep her name in the public eye.","post_message":"BREAKING NEWS: Hillary Clinton announces 2016 presidential campaign. @webpagelink"},{"comment_id":"598276743693951","commenter_b":"Wow. What a racist pig..","commenter_a":"You serve SATAN !!!! You are a very poor excuse for a human !","post_message":"CNN host Fareed Zakaria calls for jihad rape of white women"},{"comment_id":"1499576316724205","commenter_b":"Leave now. You are discase","commenter_a":"CANT WAIT","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"10153921510965329","commenter_b":"lol i thought this was cute calm down woman","commenter_a":"Alison Wonderland when you tame the mane...","post_message":"can't stop watching this"},{"comment_id":"1274781525895650","commenter_b":"A+ student in everything but Math... Since I finished school 20 yrs ago I've never had to use Algebra...not even once.. It depends on your career, I guess..","commenter_a":"If you're too dumb to pass algebra, then you shouldn't be allowed to graduate High School. Then, you should be forced to live the rest of your life working at Wal-Mart with all the other people that couldn't pass algebra...or even worse, be a Fox News contributor.","post_message":"The willingness with which these people embrace ignorance is baffling."},{"comment_id":"10153784576082439","commenter_b":"Yes nazi ideology wasn't rooted in Christianity , any person watching the military channel knows that, they were obsessed with the occult . I believe Islam , and I'm not alone is the new nazi. Same crap Nazis spewed, we are peaceful, trust us . But worse , almost all western leaders except Putin and couple Baltic states are not buying it . You'll see, next world war will be because of Islam","commenter_a":"We are doomed. I'm hoping I get cancer and die before Muslims raise the Isis flag at the Whitehouse, I'm a vet and will for go my veteran cemetery burial as Muslims will dig us all up, toss us aside and build mosques on these honored hallowed grounds!","post_message":"Anywhere American mores and law conflict with Islamic law and supremacism, it's American mores that must give way. Ripping out pews? It's sacrilege."}]
