[{"comment_id":"989113651145780","commenter_b":"Well I don't consider myself religious just because I have a relationship with god. I am Christian. The lord is my savior.","commenter_a":"sigh....","post_message":""},{"comment_id":"10156176044470354","commenter_b":"I think the women of the View are ignorant. Their 15 minutes has been up years ago !!!!!!!!!!!!!!!!!","commenter_a":"These women are a bunch of assclowns... They mean nothing and I can't wait for the day they need a nurse then they will be eating their words and asking for your help... SMH...","post_message":"The #NursesUnite movement is mobilizing against liberal co-hosts of \"The View\" Joy Behar and Michelle Collins. But now, new arrogant and elitist behind-the-scenes comments are coming to light and sparking further uproar with nurses across America..."},{"comment_id":"10153754020631337","commenter_b":"Little Crybaby Bitches....aww","commenter_a":"Mets fans are always crying.","post_message":"'AN ABSOLUTE SCUMBAG': Folks were not happy with Chase Utley's slide against the New York Mets, to the point that they almost went too far..."},{"comment_id":"848836128595379","commenter_b":"Eat shit loser!","commenter_a":"No one has won any war against Afghanis.It is history.","post_message":"When you're on a mission to defeat the Taliban, but fly fishing is life. ~Josh"},{"comment_id":"10153092888622507","commenter_b":"I like planned parenthood because it will finally rid all the blacks from the US","commenter_a":"Woman, can you say Obama care? You dems rammed it down my throat saying it would take care of all medical needs. Aren't women part of this? Why should I help pay for obamacare and planned parent hood too!","post_message":"Watch Senator Elizabeth Warren crush it on the Senate floor during the debate to defund Planned Parenthood: “Did you fall down, hit your head and think you woke up in the 1950s or the 1890s? Should we call for a doctor?”"},{"comment_id":"914542602012252","commenter_b":"Communist asses back to Europe? That's a pretty racist thing to say isn't it. That's like me telling you to take your racist american hating ass back to africa","commenter_a":"The black community should be ashamed of backing this criminal","post_message":"People are going to EXPLODE on Fox."},{"comment_id":"10152869949930796","commenter_b":"I once had a panhandler tell me he was a wounded veteran who couldn't find work. Knowing that there are many homeless veterans (a shame of it's own that needs addressing) I decided to ask about his service record, branch, MOS, duty station, etc. Being from a military family, and having served myself, I quickly noticed that his story was bogus. Point being, many of these guys are fakes. BPD wasn't shaming anybody, just pointing this fact out.","commenter_a":"No apology necessary! Thank you for keeping us informed.","post_message":"“They are using the power of the written word and incorporating fear to get you to think the worst of your fellow man,” activist Pat LaMarche wrote of the Bangor Maine Police Department in a paper she handed out Monday by the police station."}]
