[{"comment_id":"10152756009211051","commenter_b":"Could be..Better than that leaching piece of whale dung..","commenter_a":"You Brits can have her...","post_message":"People in Saudi Arabia are livid with Michelle Obama for one very specific reason."},{"comment_id":"603331946483748","commenter_b":"So youre telling me that it is 100% real meat used from unwasted products, mixed with water and natural ingredients such as salt and mustard? This doesnt make me want to not eat hot dogs atall it actually makes me feel less wasteful about eating them. The thing about Veganism that gets me is the end game. What happens if vegans get their way, and the millions upon millions of domesticated dairy cows, chickens, pigs etc no longer have any reason to be farmed? We cant release them into the wild - too many diseases both ways. They wouldn't be farmed anymore - there wont be enough farmers if they cant make money. They can't be milked - many cows will die as they have developed the need to be milked. Sheeps need to be shaun, bees need to be kept. The result is essentially a sterilization of many species ...","commenter_a":"That is disgusting !","post_message":"Before you eat that hot dog this #MemorialDayWeekend"},{"comment_id":"10153542319922629","commenter_b":"Do you job or get the hell out of the way. She should have been fired weeks ago when she first refused to do the job she is being paid to do.","commenter_a":"a woman that has been married 3 times is turning down marriage licenses... go figure","post_message":"Citing religious beliefs (as opposed to, say, deep-seated, bigoted hangups), the county clerk refuses to treat gay people as equal to straight people."},{"comment_id":"1528186400555160","commenter_b":"Thank you!","commenter_a":"THE FREEDOM OF THE PRESS is more basic to the RIGHTS of Americans than; the right to bear arms to defend. When the constitution was written it took two conventions to come up with ten amendments, BUT the first amendment was the same not changed and was readily adopted as others were still being picked and discussed. THE BILL OF RIGHTS Amendment I Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the PRESS; or the right of the people peaceably to assemble, and to petition the government for a redress of grievances","post_message":"Sean Hannity wants to destroy freedom of the press by punishing any news outlet that told the ugly truth about Donald Trump."},{"comment_id":"1026765060695063","commenter_b":"I'd whip her so hard she could only us that middle finger to rub her sore butt.","commenter_a":"No presents .........","post_message":"Utterly hilarious 10-year old drama! [Read below]"},{"comment_id":"1495082587178156","commenter_b":"Its not a city...its King County....so it wouldn't be the city that pays itd be king county...","commenter_a":"How big would the fine be if a private corporation had done this? Make the city pay that! This should never happen to our waters. (edit added: I was mistaken in my initial post. King County is responsible for the treatment plant, not Seattle).","post_message":"Roughly 100 million gallons of untreated sewage and rainwater has dumped into the Puget Sound after an equipment failure at a sewage plant near Discovery Park. >> kiro.tv/SewageIntoSound For a report on KIRO 7 News at 5, Graham Johnson is finding out what’s being done to get the plant working again. Watch on-air or kiro.tv/LiveNews"},{"comment_id":"10153641179393132","commenter_b":"I agree. She's a scam artist. But other women don't think women do that apparently...","commenter_a":"This woman is a monster in female skin. Let me generalize by saying that she makes you all look bad.","post_message":"\"He thought he owned her.\""}]
