[{"comment_id":"10153610824739087","commenter_b":"So, I guess u rather lying, murderous Hillary to get the nomination.","commenter_a":"They don't have to support the nominee anymore than we have to! If Old butthole lips Trump gets the nomination you can bet I'll write my candidate in!","post_message":"“We have candidates who believe that they’re on the pathway to grabbing all the delegates for the nomination. Whether it’s posturing or whatever, I expect that they’ll eventually support the nominee,\" said RNC chairman Reince Priebus. \"We’ve always been able to come together before.”"},{"comment_id":"10152801050747377","commenter_b":"Not in favor with illegals, but let's not forget that we are here illegal too, the Indians are the only people here legally!","commenter_a":"Let's raise the percentage point!","post_message":"56 percent are against granting amnesty to 5 million illegal immigrants currently living in the United States."},{"comment_id":"597418893776211","commenter_b":"@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"10153596201678984","commenter_b":"Absolutely Support him. He has every right to refuse and shouldn't be forced to preform a same sex marriage if it's against his beliefs!!","commenter_a":"I am supporting the judge who didn't marry the same-sex couple. If gays and lesbians demand justice they also should let those who differ in thought the same right to practice what they believe instead, of trying to force someone to commit something that goes against what they belief..","post_message":"This judge's response has him in hot water. You'll be surprised when you learn his background, then when you see who stepped in for him -- you'll be even more surprised. A totally backwards scenario from what you'd expect... Do you support what this judge did?"},{"comment_id":"10153771956525428","commenter_b":"@username He is beholden to we the people and he just said he isn't showing up for his interview..","commenter_a":"Trump just lost the election skipping debate.","post_message":"What is the meaning behind Trump long-lasting surge in the polls?"},{"comment_id":"10153885822754087","commenter_b":"Lmao.. She's a moron","commenter_a":"@username hysterical","post_message":"Hillary Clinton took things a bit too literally during a recent campaign stop when she read the word “sigh” off her TelePrompTer instead of actually doing one. WATCH:"},{"comment_id":"10153797525542183","commenter_b":"@username No it was the racist Obama that started this long before Trump was running for president. He wants to incite the Blacks to get them out and vote Democrat so he had to get the media to claim Blacks were being killed by cops. The only thing he left out was they were Black criminals attacking cops that were being killed.","commenter_a":"Obama is the poster boy for the \"Black Lives Matter\" racists. Obama started this along with his media puppets to get Blacks to vote Democrat. The Democrats do not care how many cops or law abiding Blacks have to die to get and keep their power.","post_message":"Don't expect a word of this to sink in with those suffering from ODS."}]
