[{"comment_id":"10153619223127042","commenter_b":"My condolences to the family","commenter_a":"Kristopher Jadoo omg","post_message":"BREAKING: New details have emerged about an entire New Jersey family found dead at a burned home."},{"comment_id":"1649233105382359","commenter_b":"@username well it doesn't seem to be on the minds of the ones that are. If it was they might not have sex at that moment","commenter_a":"That is nothing to brag about. You should find some other talking points to criticize Trump on. Abortion should be the last thing on a 14 yr old girls mind.","post_message":"Actress Ali Wentworth: When Trump Won My 14-Year-Old Daughter Complained There’d be “No Abortions!”"},{"comment_id":"10150715134694999","commenter_b":"@username Illegal immigrants steal roughly 9 billion dollars worth of resources reserved for American citizens every year. Deporting them per our existing laws will save us a ton of money...any more brain busters?","commenter_a":"What's even more appalling is that he's polling at 39% of Republican + Republican-leaning registered voters in the latest CNN poll. ...What does this say about our country and how folks want our supposed leaders to behave? What is this acceptance of ongoing crass commentary? ...And what happened to equanimity and professionalism?","post_message":"Donald J. Trump called Hillary Clinton's mid-debate bathroom break \"disgusting.\" Frank Bruni says it's \"the rare man-child who finds that worthy of ridicule.\" Read on in The New York Times Opinion Section."},{"comment_id":"10153696500960575","commenter_b":"Shoot this mother fucker.","commenter_a":"Hey you are invited to my next BBQ all the pig you can eat","post_message":"More tolerance and love from the Religion of Peace."},{"comment_id":"1019874124772308","commenter_b":"Not just Islam but all religions. Ban religions not humans","commenter_a":"Yes it is, and we need to remember what the Spanish Catholics did to the Native Americans, and what the \"Christian\" Protestands did to the \"Christian\" Quakers. Religion is not the issue here. It's hostility.","post_message":"Trump supporters should remember our OWN history before they foolishly suggest we should ban all Muslims from entering the country. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"546390502218196","commenter_b":"WHAT A ASSHOLE. !!!","commenter_a":"He is a Muslim!","post_message":"Obama threatens inprisoning military personnel for defying him. This is outrageous. He is drunk with power. Do you think Obama is a tyrant?"},{"comment_id":"621998441316699","commenter_b":"Sadly many get all their\"information\" from the globalist owned main Street media........the sheep are being led to slaughter!!!!!!","commenter_a":"The problem is, NO BODY WHO SUPPORTS HILLARY CARES!!! The amount of hard evidence, current criminal offenses is mind boggling... but her supporters just don't care... she shouldn't even be allowed to run...","post_message":"Uh oh..."}]
