[{"comment_id":"1076420105745487","commenter_b":"But will that maggot go to Chicago?nope, why cause they are not Muslims!!!","commenter_a":"How sad that these voices will not be heard. It does not go along with Obama's agenda. The black race is being set up. He would rather get 13 percent of a country, pissed off at 87 percent of a country. It is a setup for failure folks.","post_message":"WATCH Black Chicago Residents Blame Obama For Crime And Joblessness: “He needs to resign”"},{"comment_id":"707988442725067","commenter_b":"Then they need to leave this country.","commenter_a":"This really makes me angry....","post_message":"The court has just ruled against the American flag. This is un-American. We stand for the flag forever and always. Can we get 30,000 'LIKES' for the American flag?"},{"comment_id":"544254699096156","commenter_b":"Eat pig shit Muslim","commenter_a":"If we are so disgusting take your slappy ass back to the Middle East. Live in squalor and let your \"men\" rape, beat, torture and starve your dumbasses!!","post_message":"Obama wants us to believe that Muslim Refugees can easily integrate in our Christian Western society, well watch this VIDEO..."},{"comment_id":"10154429812461051","commenter_b":"Damage fags","commenter_a":"Impeach Trump","post_message":"The World Bank claims Trump could be the best thing to ever happen to the American economy. Do you think they're right?"},{"comment_id":"929207217205367","commenter_b":"It's up to the voters! United we will not let her get away with this! she's another OJ Simpson in my book....","commenter_a":"I sure hope so. This makes me sick. She is above the law. This is so shameful and just so wrong. Unbelievable.","post_message":"Today, the FBI admitted that Hillary Clinton endangered the American people—and confirmed that the worst things any of us imagined about Hillary’s email server were true. FBI Director James Comey concluded that Clinton was “extremely careless” in handling our nation’s secrets. He admitted that no reasonable person could have believed putting these emails on a private server was at all appropriate or acceptable. He admitted that 110 emails on the server were classified at the time they were sent—showing that Hillary not only lied, but knowingly endangered national security as Secretary of State. He admitted that Hillary deleted work-related emails before turning them over to the State Department, despite her claims otherwise. And most shocking, Mr. Comey even admitted that it’s likely foreign governments hacked her emails--and that our adversaries could know critical secrets about the U.S. government because of Hillary’s actions. But when you’re a Clinton, none of this ..."},{"comment_id":"575908422533751","commenter_b":"Kepp telling it girl !","commenter_a":"How true.","post_message":"Meghan McCain says that when Trump makes mistakes with his words \"it offends people sometimes and it can be controversial, but when Hillary makes mistakes, people die. Agree or disagree?"},{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.” Read more here: @webpagelink"}]
