[{"comment_id":"10153398427016336","commenter_b":"And Never - Ever - try to make a woman choose between you or her horse! She will most certainly ride off into the sunset w/ o you!","commenter_a":"Ladies, Never make a man choose between you and his kids or his dog! You will lose every time if he is a real man!","post_message":"Faced with the \"it's me or the dog\" decision, a Virginia man chose his beagle."},{"comment_id":"10153278538947293","commenter_b":"Mark no I meant auto, you just need a permit which is easy to get in Oregon","commenter_a":"For most of you who have never heard of Roseburg and are assuming that ucc and \"Umpqua\" are gun free areas...1: You are ignorant.. 2: Umpqua isn't a city it's a forrest that spans way farther than Roseburg and 3: Off the top of my head, I can think of at least 10 public places (that are NOT shooting ranges) in a 5 mile radius of ucc that people normally goto to discharge their automatic weapons.","post_message":"A U.S. official has identified the gunman in the Oregon community college mass shooting as Chris Harper Mercer."},{"comment_id":"686077748183930","commenter_b":"so many fucking idiots in america, cant you arseholes get your shit together and just kill each other off ?","commenter_a":"He needs to normalize his fucking hair. I can't trust someone who can't accept the painful fact that his hair is gone. Fucker has been lying to himself for years. Perfect example of his personality.","post_message":"Putin talked to reporters over the weekend about his first phone call with Donald Trump..."},{"comment_id":"10154013196294411","commenter_b":"Oh with hijab!absolutely she cover herself from you rapist pornographers.","commenter_a":"Americans should be blessed with islam for taking them to the right path","post_message":"They have always seen Iraq as a threat because it has the great potential to be a great regional independent power in its own right. (Op-Edge by Dan Glazebrook)"},{"comment_id":"10154724331976341","commenter_b":"If you people are to arrogant or ignorant to comprehend the FACT that the land belongs to Israel than you will never get it because YOU DON\"T WANT TO.","commenter_a":"What's the big surprise? Prior to last Friday, Bibi and his gang gave lip service to the two-state solution, willingness to talk with the Pals, preservation of human rights. And did the opposite, much of the time. They don't have to bluff anymore. And by the by, it's strange to hear the man who's tried to bypass the administration for almost all of its eight years, you supported Obama's opponent in 08, talk about underhand tactics.","post_message":"You might think that something actually happened last Friday at the UN, writes David Rosenberg"},{"comment_id":"902087636648479","commenter_b":"She needs to pack it up and leave!","commenter_a":"Please take her off Facebook I cannot stand looking at her","post_message":"Whoopi Goldberg has done it time and time again. She really needs to learn her place. Do you think she's gone too far?"},{"comment_id":"885067018227393","commenter_b":"Moms should go to a socialist country where their values are the norm","commenter_a":"Cops are too agressive and think they are always the kings and you can't tell them anything, and they dont know the laws.","post_message":"Moms want out of America!"}]
