[{"comment_id":"10153719914114060","commenter_b":"these immigrants dont have a chance getting on the housing market","commenter_a":"Dave Thompson","post_message":"“People feel rich today thanks to these crazy prices.” Swedish house prices"},{"comment_id":"10158155070740206","commenter_b":".. And why is anyone still endorsing hillary clinton?","commenter_a":"so the NYP takes a run at Ryan Lochte for lying but gives crooked Clinton a walk ? hmmmmm","post_message":"Liar liar, swim trunks on fire. @webpagelink"},{"comment_id":"546417122231127","commenter_b":"You're so racist it's sick. Tell that to the kids who can't go to school because they can build multimillion dollar stadiums or provide tourist attractions all while shutting down schools. You grew up a sheltered white girl. I already know.","commenter_a":"They lack the testicular fortitude to do this on a Saturday night around 2 Am in Miami 's Liberty City or Overtown or in front of Snoop Dog's house in LA. Instead they go on a Sunday afternoon, when this office is closed. I see nothing but loudmouth cowards with missing teeth and bad clothes.","post_message":"White Lives Matter group protests outside of the NAACP in Houston's third ward! #WSHH #NAACP #Houston #WhiteLivesMatter #BlackLivesMatter #AllLivesMatter"},{"comment_id":"10154836011454641","commenter_b":"Muslims should be exterminated..ambassadors of evil!","commenter_a":"And now he funds terrorism, giving weapons to the same people that have just been found to of made a mass grave in Aleppo of civilians. Scumbag.","post_message":"He was broke after running a losing campaign, his credit card was declined and he was quickly losing hope on pursuing a career in politics."},{"comment_id":"10153899755279218","commenter_b":"Ridiculous!!! That's y some of these mother fu#$&@# go around and do what the hell they want to do because of the justice system really lay these fuc&%$@ down do to them what they are doing to others give them the death chair it just doesn't make any sense to me...eye for an eye I don't care if its my family u did the crime u do the time I believe in 2nd chances some deserve it and some don't plain and simple","commenter_a":"K she looks HIGH AS HELL in her mugshot. Shorty clearly has a problem. Her baby should go to someone who cares, someone who will love her forever. There's no way I would let the child stay with this woman.","post_message":"MOM GUILTY: Sandra McClary, 26, pleaded guilty to reckless endangerment of her child, Anne Arundel County prosecutors said. Police said McClary's 2-month-old daughter was found in a carrier on the side of the road late July 4 in Pasadena. READ MORE: >> @webpagelink"},{"comment_id":"10154554439281602","commenter_b":"@username you must be a very lonely man","commenter_a":"The metal scrap yard is located on the same street as the historic Colt Factory. To pretend they had no knowledge of it's origin is BS. They should be fined and held accountable. I lived across the street from this monument for two years and while the area does have its issues, there is no reason to bash Hartford. There is a multitude of beautiful and historical architecture to see in that area if you are willing to get out of your car. Many state and local residents have worked long and hard to have the Colt area designated as a National Park. This is a slap in the face to a city that is trying to restore some remnants of it's former glory. Take the tour - learn a little history and have an appreciation for some of the treasures in our own back yard.","post_message":"\"When I first saw it, it almost made you want to cry.\""},{"comment_id":"10153155550251051","commenter_b":"Oh Erika bitch still has vagina","commenter_a":"HUGE.....SORRY ISRAEL...OUR PRESIDENT IS SETTING US UP FOR WAR....SORRY HES SUCH AN EVIL P.O.S....an i for one stand with my people an Israel....suk it obama....rot!!!!!","post_message":"Israel came out and called President Obama's nuclear deal with Iran a big mistake. Here's how they're going to respond to it. Do you agree or disagree with the idea that the Iran deal is a mistake?"}]
