[{"comment_id":"10153811229123433","commenter_b":"1. Hardly \"record\" when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is \" record\"?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing \"record\" abortions. @webpagelink"},{"comment_id":"10154169581782042","commenter_b":"@username dude are you serious?","commenter_a":"It will be shared with other waitress as a group in the restaurant where she most likely get $200 if there are 5 people working and 15 % to bar back #restaurantlife","post_message":"When an 18-year-old waitress saw a customer talking to her boss, she feared she had done something wrong. What happened next brought her to tears."},{"comment_id":"10154012959875329","commenter_b":"I was going to tag my bff, and a couple of them made cringe a bit because u do then, but Jesus, that's a real bitch. I must be just a mini bitch.","commenter_a":"Wow I thought I was a judgmental bitch until I read this. Good to know I'm not that bad!","post_message":"You judge everything."},{"comment_id":"1308041469292102","commenter_b":"Yet he never put anyone first ever in his life. You are believing a con man who is very good at conning people like you!","commenter_a":"All of this hate, all of this rage, against one man because he want to make this country great again, says a lot about those who want to stop him, and should be even more of a reason why Americans should vote for him, because he wants to put us first - I think that's a great idea.","post_message":"Show insiders told the AP that Donald J. Trump rated female contestants by the size of their breasts and talked about which ones he'd like to have sex with."},{"comment_id":"1015321351850138","commenter_b":"Obama has been working on changes to second amendment....all we need is more of the same...no way!!!","commenter_a":"Get over it....Hillary wants to take away oil field jobs and our guns too...no way she'll get my vote!","post_message":"\"I say that I will beat her easier than beating some of the people that I've just won [against.]\" Donald J. Trump hit at Hillary Clinton's record and explained why he believes women will vote for him. @webpagelink"},{"comment_id":"999172976798392","commenter_b":"Corruption in the state department is at an all-time high.","commenter_a":"Where does obeying law fall in this action? Do you collectively feel above the law and justified in defying it? Perhaps a bit of prison time and being branded as felons for the rest of your miserable entitled life will bring you back to your senses.","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"10153109185578812","commenter_b":"I hope people know the women in Iowa aren't all like her.","commenter_a":"I'm from Iowa. So embarrassing!","post_message":"The Republican Response to #SOTU2015: Who is Joni Ernst?"}]
