[{"comment_id":"1788499241368226","commenter_b":"Right. She has breasts. Ducks don't have breasts.","commenter_a":"Talks like a duck... looks like a duck... acts like a duck... must be a fucking duck","post_message":"Police Forcibly Remove Woman From Ladies Restroom Because She \"Looked Like a Man\" - is this what #MakeAmericaGreatAgain looks like?"},{"comment_id":"538555889666037","commenter_b":"SHE IS NOT A SMART WOMAN","commenter_a":"She fails at everything'. We need #Trump2016","post_message":"She NEVER learns..."},{"comment_id":"10154121076339342","commenter_b":"You are sick! Abortion should not be an option, period!","commenter_a":"There are so many people who would love to have kids and can't. But monsters like this get that blessing and go and kill their kids. This world is so effed up.","post_message":"Chilling new details about how a mother allegedly took each of her kids into the bathtub, and took their lives."},{"comment_id":"10152768793527377","commenter_b":"I am white and I criticize him because he is an nut. I voted for Obama twice and decry racism. Much of the criticism toward Obama was WAY over the top that NO white guy with the same basic Democrat policies would have faced. The fact that Snopes had to crerate a whole separate page dedicated to just the massive amount of fake viral emails smearing Obama and outright lying with claims so outrageous that any snae person would immediately question but Conservatives swallowed hoook, line and sinker because of their hateful, irrational, racist bias says it all","commenter_a":"He's a good man and could be a good leader , Vice President too!","post_message":"Black “mascot,” “court jester,” “minstrel show”? Tucker says about Dr. Carson."},{"comment_id":"10154478022181973","commenter_b":"I was looking at the protest videos of the inauguration and in a couple of clips I saw ppl with anarchists gear on vandalizing those businesses so I don't like it when the media on both sides of the aisle says it's only one group causing something.","commenter_a":"I WANT A ANSWER LIBERALS. WHY HIDE YOUR FACE? I BET I WON'T GET ONE.","post_message":"During the \"Not My Presidents Day\" rally, bike-mounted officers pushed the crowd out of the street and a standoff ensued, with police in riot gear keeping the protesters to the sidewalks. Then, as the protesters stood by and chanted, police charged in and grabbed several people, dragging them from the crowd before they were handcuffed and put in waiting police vans. Read more here: @webpagelink"},{"comment_id":"606144009518781","commenter_b":"She didn't get the revenge my butt would have gotten......I would have burned the house with him IN it chained to the bed.","commenter_a":"I agree that he should have been inside too bad that's cruel and unusual punishment. What kind of person does something like that to a child?!?!! Happens all the time unfortunately :( Exactly why I don't let my kids our of my sight, too many crazies in the world.","post_message":"The only thing better would have been if he was inside. ;)"},{"comment_id":"464688210388426","commenter_b":"Well yeah, I too would rather YOU be MORBIDLY OBESE and therefore die early........mental midgets like you guys just should NOT reproduce !","commenter_a":"Different if had medical problems, just being lazy isn't one","post_message":"Should This Family Be Taken Off Welfare? Comment 'yes' or 'no'."}]
