[{"comment_id":"10158298295275206","commenter_b":"@username Memisevic you want to be a victim so bad. Girl go lay down.","commenter_a":"This is exactly why NFL players are doing what they are doing, and you are pissed at them!?","post_message":"“We saw that Terence did not have any weapon. Terence did not make any sudden movements. We saw that Terence was not being belligerent.”"},{"comment_id":"1155027644532693","commenter_b":"ignorants are eating Donald shit with lying pence","commenter_a":"NEW RULE : MAKE GRABBING PUSSY GREAT AND SAFE AGAIN.....LYING PENCE IS DONE FROM EATING DONALD SHIT .....BREAKING NEWS : HURRICANE DONALD DUMB IS ENDING THE PRESIDENTIAL RACE AND IT IS MORE POWERFUL THAN MATTHEW HURRICANE .... PAUL RYAN AND THE RNC CHAIR WASHED THEIR SMALL HANDS FROM DONALD DUMB AFTER WATCHING DUMB TRUMP PUSSY GRABBER CLIP ..... THE RACE IS OVER ...CONGRATULATION I ANNOUNCE .HILLARY CLINTON IS THE PRESIDENT OF USA ,,DONALD JOKE DUMB HIJACKED REPUBLICAN PARTY (LINCOLN AND REGAN PARTY ) LIKE ISIS HIJACKED ISLAM AND KKK HIJACKED CHRISTIANITY ,, I AM CALLING FOR COMPLETE SHUT DOWN OF DONALD JOKE DUMB FROM TALKING TO ANY WOMAN UNTIL WE FIGURE OUT WHAT THE HELL IS GOING ON .INCLUDING DEBATING WITH PRESIDENT Hillary Clinton","post_message":"She wants textbooks changed."},{"comment_id":"1081603935229468","commenter_b":"#I'mwithHer Go Girl all the way to the white House!!!.","commenter_a":"Hilary Clinton, vote for the most qualified candidate for president 2016","post_message":"This is not a single issue country. We need to address racial inequality as well as economic inequality."},{"comment_id":"10153058951371045","commenter_b":"send her to Hollywood she can act!! send to JAIL!!!!!!","commenter_a":"It seemed like a pretty fake cry to me, you know that baby was there just sorry she got caught!","post_message":" God. Oh God. I can believe I did that. Oh my God. My husband going to kill me. Oh my God! That's the reaction police body cameras caught when a frantic mother was confronted for leaving her 1-year-old daughter in a sweltering van parked in an Oklahoma Wal-Mart parking lot."},{"comment_id":"10153829014724091","commenter_b":"Does the witch have pizza","commenter_a":"Sounds like trump","post_message":"We're under a Tornado Watch -- checking in with Lee Goldberg on what we can expect."},{"comment_id":"10152925844701336","commenter_b":"Yay!!! Nice yes one girl!!","commenter_a":"I've read the back of the book... And I hate to break it to ya, but the Christians win!!","post_message":"ISIS has released a new beheading video which includes a direct threat against President Obama."},{"comment_id":"10154399468414411","commenter_b":"Herna Suryani Fuck you you dumb cunt ..israel was given the land at the end of the 2nd world war in 1947..and all you have done since ,,is kill.. steal ...bitch..and moan.. so FUCK YOU CUNT !!!","commenter_a":"The ongoing 'Palestinian' terror attacks towards innocent Israeli citizens, leave Israel with no other choice. Israel must take tough decisions in order to protect its citizens and prevent the next terror attacks. 'palestinians' always choose terrorism over peace. Sadly","post_message":"This step will 'only increase the sense of injustice and frustration felt by Palestinians' - UN official"}]
