[{"comment_id":"1148960128472164","commenter_b":"Beat the whore","commenter_a":"Ok idiot, lets say this girl had no idea he was married and after realizing how dumb you are, he leaves you bcz he knows deep down that he is to blame not the girl....","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."},{"comment_id":"10153312996021167","commenter_b":"He has also said that Muslims need to be deported, whether the are American citizens or not. 😖","commenter_a":"Brokaw makes a false comparison. In the 1940's, many Japanese were US citizens, and living here already. Their internment was a knee-jerk reaction to a very real fear that the Empire would try to invade our country with help from loyalists living here. Today, there is no nation threatening invasion, but rather a rogue terror group looking to radicalize ideological adherents within our borders, and inspire them to randomly murder us. Trump has suggested that we not allow any more people from Middle Eastern areas known as incubators for terrorists UNTIL we have much better means of sorting out the radicals from the legitimate refugees.","post_message":"This is one of the most powerful segments we've ever seen. Tom Brokaw compares Donald Trump's call to bar Muslims from America to Japanese internment, Nazi Germany, McCarthyism, and Jim Crow - and he didn't stop there. This amazing video is well worth taking a moment to watch, via NBC News"},{"comment_id":"10153656714955575","commenter_b":"Well Baltimore is already torn up for them!!! Wonder what the blacks think about them coming.","commenter_a":"Obama is bringing Mexicans and Syrians in to train them. Terrorist that kill with weed whips","post_message":"Baltimore politicians defying logic once again. . . ."},{"comment_id":"10152746450450326","commenter_b":"They are the real terrorists. They need to be stopped.","commenter_a":"Why should they have anything to say about what we do... We don't tell these evil men what to do.","post_message":""},{"comment_id":"1723680187844156","commenter_b":"she is CRAY cray crazzzyyy","commenter_a":"@username ton 2 cents plottale la dessus please","post_message":"On Tuesday’s “The View”, Hillary claimed that a child, on its due date, just before delivery, has no constitutional rights. Are you serious? I believe that life begins at conception and that abortion takes the life of an innocent human being. And I’ve heard all the arguments from the left before, but this idea that a baby on its due date still has no constitutional rights? That really takes the cake."},{"comment_id":"10153437960854877","commenter_b":"Every woman commenting negatively about Vivica, bet you man or husband would drop you to be with here, you women or old. Her age means nothing when her shape is killing every young girl on this post","commenter_a":"Why is he the bad guy when he's only responding to her messy self knowing he isn't gone let it rest or go!!#SheStupid","post_message":"50 Cent Responds to Vivica A. Fox 'Gay' Comments...and Doesn't Hold Anything Back. Read what 50 had to say below. Grio fam, what's your reaction to 50's comments? Sound off!"},{"comment_id":"728722383954381","commenter_b":"this shit sad most if not all terrorist are from s Arabia and suni.. it hasn't even been 1 Iranian terrorist. and they fund ppl to defend they city that's not called funding terrorist. fuck trump AZ a U.S. citizen. I'm a shame of this racis country. that's why I fucking moved. fuck that bitch and his racis face. let that bitch try to come fuck w iran and see what happens. wer not Iraq or Syria. none of that. we strong. and we got them nukes and Russia and China fuck w us. let Israel bitch ass make move😎fuck Israel and s Arabia","commenter_a":"Should be interesting to see this brought up in Surpreme Court...","post_message":"The Muslim (country) ban."}]
