[{"comment_id":"1693365440922113","commenter_b":"We need to take back our country from these liberal Morons! How dare they: your rights STOP where ours begin!","commenter_a":"Funded by MUSLIM BROTHERHOOD to divide & conquer!","post_message":"Black Lives Matter supporters spat and stood on the American flag outside a Donald J. Trump rally Sunday."},{"comment_id":"692454430859640","commenter_b":"WE have NOT gotten the message!!!","commenter_a":"we got the message a long time ago...when will corporations take care of their responsabilities","post_message":"Gray Whale Dies Bringing Us A Message The Entire World Should See"},{"comment_id":"10154047358589641","commenter_b":"But same time they let undocumented emigrants to enter their countries. This is why Europe never will be united.","commenter_a":"Crazy! Why do we want to go to Europe anyway when we have so much to explore and see in the great USA !","post_message":"The European Union is considering requiring Americans and Canadians to apply for visas, even if they only want to come for a short vacation."},{"comment_id":"10153723307413037","commenter_b":"RideAustin doesn't even have an Android app yet. On the other hand, Fare has an app like Uber & Lyft, does the required background checks, offeres a way to schedule an upcoming ride and to choose preferred drivers....and it is all working now...as in this minute. Download the app and use me for a reference: Lynne3. @webpagelink","commenter_a":"Give our City Council a call...maybe they will give you a ride. @webpagelink","post_message":"The company says it will pay for fingerprint checks. Are you likely to give this company a try?"},{"comment_id":"10153871207061336","commenter_b":"No dear, Hillary Clinton was First Lady, a US Senator and Secretary of State. This little nobody was never anything close. Glad to help you. Leave the comedy to the professionals.","commenter_a":"This little nobody from Arkansas with no job is still making noise? LOL!","post_message":"\"That's one of the frustrating things about this president – he always tries to make it that he has the moral authority and everybody else is wrong.\" This morning on \"FOX & Friends Weekend,\" presidential candidate Mike Huckabee slammed President Barack Obama's approach to policy disagreements. @webpagelink"},{"comment_id":"10153505176486051","commenter_b":"I disagree with every thing she says, such a liar","commenter_a":"I hope she does get the dem. nom. that way repub. are guaranteed a win.","post_message":"Hillary Clinton believes Americans should wholeheartedly reject Trump's rhetoric on Muslims and immigrants. Do you agree or disagree?"},{"comment_id":"10154134238584411","commenter_b":"Mohammad IIyas, u must be annoyed abt the fact how we kill those Porkistani pigs trying to cross our border every day. Feel pity for u being born in such a disgraceful country where the the administration controlled by radical Jihadis. I believe Pakistan fought four wars with India and all of them was lost by Pakistan with great humility. Thank us, that we left the land we captured during 1965 war, or else your dad would have been fucking your mom on Indian soil, and you would hv been born in India with Indian passport.. and then still if you would have spoken against our country, we would hv sent you to your 72 virgins without appointment.","commenter_a":"India need such subs @username","post_message":"The sub disarmament is estimated to cost some 28 million rubles (about $ 400,000)"}]
