[{"comment_id":"10153238439315950","commenter_b":"seeing as every single non 1st nations person is an immigrant they need to stfu","commenter_a":"Guess you \"forgot\" to mention yr phony ISIS had 20,000 twit-sites taken out by Annonymous? CIA must be a tad depressed today? Not to worry guy's....it's only REAL NEWS! We can find it anywhere but here. Jokers! Shame on the lot of you!!!","post_message":"UPDATE: More states are saying \"no\" to Syrian refugees in the U.S., call for stricter screening @webpagelink"},{"comment_id":"10153506474399342","commenter_b":"She's one of these \"innocent\" women that our cretin in the White House wants to allow in the US.","commenter_a":"What a mutt. I hope they shot her in that ugly face of hers.","post_message":"We're getting our first look at the female shooter in Wednesday's tragedy in #SanBerardino."},{"comment_id":"10154099893448132","commenter_b":"all she has to do is prove it, Will she?","commenter_a":"This is so pathetic!","post_message":"Donald J. Trump and Megyn Kelly have quite a history."},{"comment_id":"10153545304972452","commenter_b":"Happy mothers day mom, have a cheeseburger, see ya later!","commenter_a":"was it on a friday ?","post_message":"When they both went for the cheeseburger, investigators said Benjamin Middendorf had enough and shot his brother."},{"comment_id":"1301887483185054","commenter_b":"@username : Colossians 3:18 Wives, submit yourselves unto your own husbands, as it is fit in the Lord. 1 Timothy 2:11-15 Let the woman learn in silence with all subjection. But I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence. For Adam was first formed, then Eve. And Adam was not deceived, but the woman being deceived was in the transgression. Notwithstanding she shall be saved in childbearing. Titus 2:4-5 Teach the young women to be ... obedient to their own husbands, that the word of God be not blasphemed. 1 Peter 3:1 Likewise, ye wives, be in subjection to your own husbands.","commenter_a":"Well... how is this a surprise? Their bible backs up this ideology and states women are lesser creatures, that their only value is their ability to produce offspring and see to their husband's needs. That's all women are to conservative Christians- breeding stock.","post_message":"If you’re a woman you’re likely going to want to deck this a**hole for what he just said."},{"comment_id":"10154743139306508","commenter_b":"She's a liar ....","commenter_a":"The funny thing is the same scenario happened in Egypt four years ago with the Muslim brotherhood president Morsi, when someone beside him was telling him what to say and was caught the very same way Pelosi is caught now. I think same same school, no difference","post_message":"She didn't know people could hear her"},{"comment_id":"1800084686916109","commenter_b":"Since 1952 Muslims are here ILLEGALLY. They need to get the hell out.","commenter_a":"Dear Democrats and Liberals, I'm noticing that a lot of you aren't graciously accepting the fact that your candidate lost. In fact you seem to be posting even more hateful things about those of us who voted for Trump. Some of you are apparently \"triggered\". Because you are posting how \"sick\" you feel about the results. How did this happen you ask. You created \"us\" when you attacked our freedom of speech. You created \"us\" when you attacked our right to bear arms. You created \"us\" when you attacked our Christian beliefs. You created \"us\" when you constantly referred to us as racists. You created \"us\" when you constantly called us xenophobic. You created \"us\" when you told us to get on board or get out of the way. You created \"us\" when you forced us to buy health care and then financially penalized us for not participating. You created ...","post_message":"President-elect Donald J. Trump​, Melania Trump, Speaker Paul Ryan​ and VP-elect Mike Pence​ meet at Capitol Hill."}]
