[{"comment_id":"1362884163768725","commenter_b":"A grown ass man, with a meme of a \"butthurt report\" ,shows the intelligents of trump supporters. Trump supporters and memes go hand and hand.","commenter_a":"I did not see any bitching when Obama was elected, all you cultural marxists can fill up your \"safe\" spaces and fill out butthurt reports, not that anyone cares for you snowflakes","post_message":"Whether you support trump, hate him, or don't care either way — you need to see this:"},{"comment_id":"662013840614058","commenter_b":"Give Texas back to Mexico!","commenter_a":"How ignorant. It is against the law. I would hope that the sane people in Texas vote these idiots out of office as soon as they can.","post_message":"This time they may actually do it...."},{"comment_id":"1158183760868319","commenter_b":"Ya cause your a pussy","commenter_a":"Thanks Delta & united Airlines for the great work. U got my business.","post_message":"Humane Society's president said Delta \"has set a great example.\" \"No airline should provide a get-away vehicle for the theft of Africa's wildlife by these killers.\""},{"comment_id":"1326473630726439","commenter_b":"To be successful in today's Republican Party you have to push a potent mix of craziness and meanness.","commenter_a":"The rise of the evangelical politician. The moderate and liberal republicans moved to the Democratic party and the conservative Christian moved to the Republican party. This was all in the 50's-70's there was a great migration because the majority of the Republicans didnt like the move in the direction to conservative ideals so they moved to the Democratic side. So your Democrat is actually your Republicans pre evangelical","post_message":""},{"comment_id":"10154269648496509","commenter_b":"The Old Testament also says if a woman is on her period she needs to live in a hut.","commenter_a":"What kind of gun would jesus own?","post_message":"Las Vegas Assemblywoman Michele Fiore is drawing cheers and jeers for making firearms a family affair in this holiday card. @webpagelink"},{"comment_id":"10154739009466337","commenter_b":"I say extract the bitch the bitch that's in you that complains about characters of fiction switching ethnicities","commenter_a":"I say cast a white dude. Because it's cool to switch race's of established characters now right?","post_message":"BLADE'S RETURN? Marvel hopes so..."},{"comment_id":"1802126320030739","commenter_b":"I still say his daughter should be charged with inciting a riot! All damages, and the protester that was killed. I still think she was doing all of this to get a paycheck from the city. No difference between her and Browns momma in Ferguson Missouri. Remember her jumping up and down on somebody's car screaming \"Burn this mother*ucker down\" referring to the city! Was she charged? Hell no, I still wonder if she got paid ? Bitch should have been buried under the jail.","commenter_a":"Ah, more clickbait. Headline: Dash Cam Footage Released. Story: Police are not releasing the dash camera footage because..... Gotta love the manipulative lies in these article headlines that these sites put out just so they can get paid per click to the site.","post_message":"Riots have critically wounded one already and now it's proven he had a gun, not a book..."}]
