[{"comment_id":"10155092552983797","commenter_b":"I'd rather have all those than Depression :D Wait, you said, \"CORRECTion\"... how do we even know the Bible is correct? Bible stated Jesus is white.. we know that's false. He's Black. The Bible is a contradiction to other verses and such.","commenter_a":"Really??? Lol! Side effects for birth control for women- Intermenstrual spotting. ... Nausea. ... Breast tenderness. ... Headaches. ... Weight gain. ... Mood changes. ... Missed periods. ... Decreased libido. And thats just the 10 common side effects.","post_message":"The shot seemed to be as effective as other forms of contraception, but the men complained of side effects like acne and mood swings..."},{"comment_id":"10154296658174411","commenter_b":"@username Actually, no it wasn't in response to that comment. I wasn't responding to Andy Shitman anyway.","commenter_a":"imagine a group of 4 thousand russian troops on a boat alongside new york..... and then telling the us theyre acting aggressive.. LOL","post_message":"'Russia is acting in an extraordinarily provocative behavior'"},{"comment_id":"1143200309023611","commenter_b":"Neither is \"snakeshit ted\"","commenter_a":"Rubio is not going to make it!","post_message":"Pressure on Rubio to pull off win in Nevada"},{"comment_id":"1145897778760904","commenter_b":"I have the same solution no matter the skin color......shot them, protect the population from killers.","commenter_a":"Throw him in a cell with a bunch of big angry sex offenders.","post_message":""},{"comment_id":"10153483912132522","commenter_b":"If only the two big candidates this election were Johnson and Stein. Either of them would be nice.","commenter_a":"Libertarians should all be required to live in Syria for a year. That is essentially what their government is (or lack there of).","post_message":"Gary Johnson and his running mate, Bill Weld, were equally dismissive of \"huckster\" Donald Trump and political status quo. \"The two-party system is a two-party dinosaur, and they're about to come in contact with the comet here,\" said Johnson:"},{"comment_id":"10156022193165294","commenter_b":"That's incredible o be married that long. Now people marry 15-20 years and that's it. I hope to live this long and still have my husband around. This is what young couples should be using as example, If you can be married that long, theres nothing that can break you!","commenter_a":"Many yrs ago my grandparents were in same room at the hospital though, normally its two female or two male in ea room . It is very nice to keep them together.","post_message":"\"Because they were on the orthopedic surgical floor, none of those rooms have double occupancy so they couldn’t be together, and it was clearly breaking their hearts.”"},{"comment_id":"1234184189935923","commenter_b":"Júlia, por favor, não vire uma crazy cat lady!","commenter_a":"Se encontró una asociación entre tenencia de gatos a temprana edad y desarrollo de trastornos siquiátricos en la adultez. Según el journal of schizophrenia research. Doble de probabilidad de desarrollar esquizofrenia, post infección por Toxoplasma gondii. (Por arañazo de gato) Cuidado con quedar como la vieja de los simpson. Paulina Santander","post_message":"A parasite common in house cats has been linked to mental illness."}]
