[{"comment_id":"1475217105828968","commenter_b":"You do not know what you are talking about! If woman cannot afford birth control then there will be a definate increase in unwanted pregnancy and ultimately more abortions than ever. Its a simple enough eqausion, NO PLANNED PARENTHOOD=NO AFFORDABLE BIRTH CONTROL=MORE ABORTIONS!","commenter_a":"Will never agree stay quite,agree or be agreeable to finance or support an organization that capitalizes on the murder of innocent children. And an organization that preys on the vulnerability of women in a bad situation, that is not women's rights but profit of murderers. It needs to be called what it is. Their profits and funding comes via. death and guilt not education.","post_message":""},{"comment_id":"10154530300669087","commenter_b":"I'm guessing the attorneys general in question are more aware of the law than you, random Facebook commenter.","commenter_a":"The Inadmissible Aliens Act Section 8 - 1182 allows the President to ban any group or nationality from getting Visas. The Law is Legal and on the books since 1952 and used by President Jimmy Carter to ban Iranians in 1979 and Obama in 2011.","post_message":"Virginia’s attorney general has joined other state attorneys general around the country in filing a lawsuit against President Trump over his immigration ban."},{"comment_id":"10152869949930796","commenter_b":"I once had a panhandler tell me he was a wounded veteran who couldn't find work. Knowing that there are many homeless veterans (a shame of it's own that needs addressing) I decided to ask about his service record, branch, MOS, duty station, etc. Being from a military family, and having served myself, I quickly noticed that his story was bogus. Point being, many of these guys are fakes. BPD wasn't shaming anybody, just pointing this fact out.","commenter_a":"No apology necessary! Thank you for keeping us informed.","post_message":"“They are using the power of the written word and incorporating fear to get you to think the worst of your fellow man,” activist Pat LaMarche wrote of the Bangor Maine Police Department in a paper she handed out Monday by the police station."},{"comment_id":"1990611657665239","commenter_b":"Another vile rapefugee","commenter_a":"death penalty anyone ?? #asktrump","post_message":"Horrifying."},{"comment_id":"420582524733009","commenter_b":"No lying Bitch will run this Country!! You will be heavy investigated about all this money you have.","commenter_a":"No they never do on the left !!","post_message":"Is the press giving this enough attention?"},{"comment_id":"575161529335569","commenter_b":"That sick women will never be fine ! Who you kidding !","commenter_a":"Why is this such a big deal? After some rest, and antibiotics she will be fine.","post_message":"Is Hillary Clinton just run down, or is it more serious?"},{"comment_id":"907221015981906","commenter_b":"what woman would fantasize about being gang raped?","commenter_a":"And is that because that's his fantasy","post_message":"When Democratic presidential contender Bernie Sanders was 30-years-old, he wrote that women fantasize about being gang-raped. His office did not immediately respond to a request for comment from TheBlaze."}]
