[{"comment_id":"543331865850763","commenter_b":"WANTS TO KEEP AMERICANS STAGNANT, MOVING BACKWARDS AND PAY HIGHER TAXES TO SUPPORT IMMIGRANTS COMING OVER OUR BORDERS FROM ISIS COUNTRIES TO PUT AMERICANS IN GREAT DANGER, WANTS TO KEEP MINORITIES IN DEMOCRATIC OPPRESSION, POVERTY, JAIL, AND HIGH CRIME, NO FUTURE, WELL WHY NOT VOTE FOR HILARY CLINTON.","commenter_a":"Says the oh so honest Christian man who dumped his wife (who was fighting for her life with cancer in the hospital) for his bimbo secretary after he dumped the first wife because she wasn't pretty enough to be married to a great man like him.","post_message":"\"Donald J. Trump's going to win, because in the end the country's not going to reward big banks and big unions and big bureaucracies and big donors and big corruption by voting for a big liar.\" –Newt Gingrich"},{"comment_id":"10153606624740667","commenter_b":"How's that gun free country law working out for them now ?? President Carter band Iranian Muslims during the hostage crisis & deported over 20,000 Iranian students, Iran is a Islam Islamic nation. Democrat's never called him a racist. US immigration Laws cover religious test for immigrants !! The AR 15 is not a military assault rifle & not fit for hunting deer or elk by some hunting laws, it's a singal shot gun !! Some pistol clips holds 15 rounds of ammo !! PS: Hillary is on record in support of a wall on US Mexican border !!","commenter_a":"So sad. :(","post_message":"BREAKING: Jo Cox has died."},{"comment_id":"940190486114130","commenter_b":"What a fucking shitbag","commenter_a":"Bill Clinton was President and the Commander in Chief during part of my time in the National Guard. I had no respect for him as a man but had I ever encountered him I would have rendered proper military courtesy out of respect for the office of the President. When you put on the uniform you mo longer get to pick and choose.","post_message":"HA! She should've thought twice..."},{"comment_id":"848324611946507","commenter_b":"Actually I spent a number of years in special ops in the military, we called guys like you \"Dinky Daos\".","commenter_a":"ISIS thanks Senator Cruz for supporting their strategy to create a war of religions.","post_message":"The Obama Administration has no foolproof vetting process, and this is tantamount to rolling out a welcome mat for terrorists to this country. Congressman Jeff Duncan and I have together introduced legislation that would empower states to use their Tenth Amendment authority to opt out of the national refugee resettlement program. Our legislation requires the federal government to inform states of its intent to settle aliens within their borders, and allows governors to reject those aliens if a governor believes that the refugee presents a security risk. Our children’s safety tomorrow depends on our ability to secure America today."},{"comment_id":"10154652833671336","commenter_b":"BUILD THE WALL!!!","commenter_a":"let's end this by voting for trump","post_message":"A man who allegedly killed two people and kidnapped a third one over the weekend in the Dallas area had been deported three times to Mexico in the last two decades, immigration officials said on Wednesday."},{"comment_id":"10153512557096130","commenter_b":"LOL!!! NO SEX. WOMAN LISTEN TO MAN. YOU MADE OF RIB. SHUT UP. NO WORDS. BE SLAVE. yay the bible...-.-","commenter_a":"Well, I suppose human nature, being what it is, things won't change much for the better. However, if people would follow some of the teachings of the Holy Bible, regardless of their personal religious beliefs, the need for Planned Parenthood would pretty much go away.","post_message":"Enough is enough."},{"comment_id":"10150583091169999","commenter_b":"Smart girl","commenter_a":"Tara Hosseini Chanelle Felder Curtis","post_message":"“A Bush was trying to blame ISIS on Obama’s foreign policy — it was hilarious.” Check out our sister page The New York Times Politics and Washington for more."}]
