[{"comment_id":"10153114280311037","commenter_b":"Obama called isis JV team and gave Iraq back to isis ... Soldiers died for nothing .. Iraq had nothing to do with 9-11","commenter_a":"Probably a bullet. Unfortunately","post_message":"Tomorrow, President Obama will host a summit on \"Countering Violent Extremism\" - focusing on the root causes of extremism and find ways to stop young people from joining terrorist groups. What do you think is the solution?"},{"comment_id":"10153173329758984","commenter_b":"Wolves in sheep's clothing.","commenter_a":"Watch Yer back,Sheriff Joe,Yer dealin with Snakes...","post_message":"Look out, Obama. The sheriff's in town. Do you support what Sheriff Joe Arpaio just did to stop Obama's amnesty?"},{"comment_id":"593055850861224","commenter_b":"AmandaSmith I understand but people wake up in Florida and sometimes find Alligators walking in their yards or in the bottom of their swimming pools. Disney World was actually built around swamps. Yes they altered the swamps and created the lagoon but it has always had alligators in it. Sorry a toddler died because of the lack of understanding of that fact.","commenter_a":"Give me a break. My 7 year old heard about this and the first thing she said is \"why would they go near the water? It's Florida! Everyone knows there are alligators in Florida!\". We are from Wisconsin.","post_message":"A case against Walt Disney World would hinge on whether or not the resort knew about the alligators living in the resort's Seven Seas Lagoon."},{"comment_id":"10153585291913132","commenter_b":"The only reason 14-16 is a plus size model is because of fashion magazines. She is a NORMAL size model. That is average size.","commenter_a":"The woman depicted in this picture is a \"plus sized\" model and she's drop dead gorgeous! I wish they would STOP trying to glamorize Tess Holiday... she's pretty and if she truly feels good about herself being morbidly obese and unhealthy then good for her, but she's sending the wrong message!","post_message":"\"All women need to do to get a bikini body is to put a bikini on.\" - Tess Holliday"},{"comment_id":"1411212282241061","commenter_b":"That's DIRECTED To YOU Mr Joe Biden. .oh my mistake. .mr. Joe bishop!","commenter_a":"Trump is still a fraud and will always be! Go Ted Cruz 2016!","post_message":"The #NeverTrump movement has been around longer than you'd expect."},{"comment_id":"10153096865294614","commenter_b":"Adorable, precious, blessed by God! What a wonderful father & lucky to have this special little boy in his life! That woman is disgusting & I agree with another comment that she should have her tubes severed forever & never be allowed to have a child, not even adopted!","commenter_a":"Thank you everybody for sharing all the beautiful pictures of your wonderful and special family members, they are truly a blessing on this earth. I work in an Adult Foster Care home and we have cared for Downs Syndrome of all ages. Due to rapid decline in health recently, two of my special guys have left this earth to be angels. I cannot explain the special spark that they put in my heart when I was with them. I will never understand how people can be so heartless. God Bless Leo and his amazing father!","post_message":"After this baby mom abandoned him because he was born with Down syndrome, his father stepped in to raise the son he calls and as a single dad. Leo Forrest was born in Armenia last month. Upon learning of the genetic condition, his mother and her family gave up on the child. They also told Samuel Forest he would no longer be welcome in their home if they decided to keep him, according to a GoFundMe page set up to help Forrest and the baby. Faced with a difficult choice -- his wife or his infant son the new father chose Leo. She has since filed for divorce, he says. Forrest is returning to Auckland, New Zealand, where he is originally from, to raise the baby. Read KTLA story here: @webpagelink"},{"comment_id":"1774184492816291","commenter_b":"@username racist idiot.","commenter_a":"NO WAY! No one else should be added to Mt. Rushmore, but especially not Obama! There are a lot better President's that could have been added, but not him!","post_message":"Obama's Face To Be Inserted Into Mt. Rushmore. Don't mess with this national monument. Do you think Obama's face does not deserve to be up there?"}]
