[{"comment_id":"626305930908697","commenter_b":"@username Yeah, those toddlers with guns are out of control right now.","commenter_a":"I blame Obama and Bush, Bill and Bush snr for forever labeling all Muslims as terrorists . they didnt know that by doing so they created further hate for Muslims in america and this is the result","post_message":"Kim Kardashian West made her opinion known (via Daily Mail Celebrity)"},{"comment_id":"10153009343111130","commenter_b":"My mother was too. But her mother was an even bigger bitch, so I got it.","commenter_a":"My mother is a bitch!! There I said it!","post_message":"\"I realized how much the fragility and vulnerability of females is exposed fully in the mother-daughter relationship.\""},{"comment_id":"10156170430735354","commenter_b":"Women don't need men any longer. They hate men. They have each other, the feminist lesbian agenda, invetro fertilization and high tech sex toys. All they need are man farms for harvesting sperm.","commenter_a":"Truer words.........","post_message":"\"...academics and feminists are terrified and calling for them to be banned.\""},{"comment_id":"10153140940574205","commenter_b":"Perfection!","commenter_a":"Lol... Reminds me of the Mandelbaums on Seinfeld. \"You think you're better than me?\"","post_message":"In an effort to show how tough they are, Vladimir Putin and Dmitri Medvedev have released an exercise video."},{"comment_id":"1427245267295499","commenter_b":"Half a gallon of milk. $2.50, a box of cereal can be found for under $5 in your local hood supermarket lol come on people, don't be this stupid. Don't be the person who goes out for $7 cereal.","commenter_a":"If it comes with refills, I'm in!","post_message":"It better be a gr-r-reat bowl of cereal."},{"comment_id":"481872515336662","commenter_b":"She's doing a great job! Leave her alone! You look half as good as she does, you wouldn't have a problem!","commenter_a":"She is great and a real threat to the liberals and they will go after her.","post_message":"Liberals are after Megyn Kelly after she falls victim to wardrobe malfunction. She is in trouble, we need to show her we have her back. Can we get 20,000 'LIKES' for Megyn Kelly?"},{"comment_id":"1543012149092242","commenter_b":"Awww you pathetic little slut... Let me guess, yo baby daddy is black....","commenter_a":"Its funny because in the 5th grade i refused to stand for the flag, 5th grade and i already knew this country was crap and lacked concern for its citizens. My friends grandfather was a vet from vietnam and she refused to stand for the flag out of how this country treated its troops. And she had every right and justification. You guys are missing the meaning behind the flag, you cannot just take the good of a country and claim thats all the country is. There is injustice that is constantly being negated by people like you, and those in these comments, simply because you haven't experienced it. Get over yourself and your terrible nationalistic views about a country that couldnt care less about you. Reality is reality, that flag represents a government that openly allows racism to grow and continue in our judicial and enforcement systems.","post_message":"This store owner planned a signing event with Brandon Marshall but when Marshall protested the national anthem, the owner cancelled the event immediately... but what the owner did next is going viral. Good for this owner... he's a true patriot."}]
