[{"comment_id":"10153499378776051","commenter_b":"all women are crazy","commenter_a":"Dummy. He should have just gone home and find a girlfriend that is not crazy.","post_message":"This man's girlfriend and ex-girlfriend jumped into a river to force him to choose which one he loved more. Well, he made his choice."},{"comment_id":"1594885237238266","commenter_b":"These dumbasses ran into them in Tampa in Ybor thank God for The Thin Blue Line or those protesters would have had one hell of an ugly day in their life","commenter_a":"Just shows what they are made of! Nothing these crybabies should be kissing the cops asses for saving them lol","post_message":"What happens when whiny anti-Trump protesters interrupt The Few, The Proud, The Marines?"},{"comment_id":"10154269953567439","commenter_b":"Wouldn't be Muslim refugees if our leader would fight for them . He wants them to spread out and start a war of Islam","commenter_a":"Those Muslims were Barack Obama's son's","post_message":"This woman is brave to come forward and tell this gruesome story. Only one of the five Muslim migrants were apprehended. The other four \"escaped the country.\" Don't believe it. They are being hidden by the Muslim community much the way the Paris jihadis were."},{"comment_id":"10150889945159999","commenter_b":"Another great day for Mr Trump and another day Mrs. Clinton lost. Meeting with the Mexican President first and finding common ground, while she stays home and refuses to speak to the American people. Mexico will pay for the wall. It is in their best interest to keep American thugs and murderers out of Mexico","commenter_a":"If the real Native Americans take up this mantra we're all in trouble. D","post_message":"The photo-op allowed Donald J. Trump to please his nativist base and humiliate Mexico at the same time, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"1169952976350143","commenter_b":"Nope. I have worked in Criminal Court, and this was battery.","commenter_a":"Yup","post_message":"POLL: Should charges be dropped against Donald Trump's campaign manager Corey Lewandowski? (VOTE NOW)"},{"comment_id":"1036464773060661","commenter_b":"Their idiots!!","commenter_a":"Keyword: Care. Democrats generally care for the American people, Republicans only care for their special interest groups, their corporate friends, and anyone else that can boost the thickness of their wallets. Conservative is a joke... conserve what? Anything that helps them and not the the country as a whole.","post_message":"ZING!"},{"comment_id":"912381755524744","commenter_b":"Cruz no need for explanation,ur vote wud be insignificant bc she is still the AG.Drop dead!","commenter_a":"We don't want Ted Cruz","post_message":"Ted Cruz was the only senator to miss the vote."}]
