[{"comment_id":"1025935160778053","commenter_b":"Women with body ink graffitti make excellent role models","commenter_a":"Why do you report articles from other countries like this? I'm sure if you applied yourself you could find your own sources of pathetic losers to post about.","post_message":"This welfare leech is getting $1,700 a month in benefits... and that's not the shocking thing. She had the GALL to complain about it. You know, if she's so unhappy with it, the taxpayers who provided it would be more than happy to take their money back..."},{"comment_id":"10154005970128967","commenter_b":"I was just about to tag you in this haha","commenter_a":"Jack explains why he wanted out of Star wars :(","post_message":"It's no myth, Harrison Ford and Steven Spielberg are bringing Indiana Jones back."},{"comment_id":"891611624218799","commenter_b":"That attitude is what spoiled immoral girls, who got caught up in this SEXUAL REVOLUTION\" and forgetting that sex is for married people, and it also leads to pregnancy. They figure,,so what,,if I get pregnant,,I'll just kill my own baby,,,no problem,,,BUT I bet when these young women,,grow older, and marry and THEN do have a child,,,they have guilt like they never knew before.","commenter_a":"Close your legs, ya skank.","post_message":"Um, what? Killing a baby doesn't \"end a pregnancy,\" it just makes someone the mother of a dead baby."},{"comment_id":"10152705081476519","commenter_b":"And have lots of sex in ur ass ur gonna get raped first","commenter_a":"You might be interested in Googleing why it was banned. Few today would believe the pseudo-science mumbo jumbo presented as fact to Congress. 1) Smoking marijuana will make black men want to rape white girls. That's girls not women. There is ZERO evidence here. 2) Smoking marijuana will make young men more likely to experiment with homosexuality. THAT may be true, but the rest of the presentation turned that simple statement into more of an assertion that it would turn young men gay.","post_message":"\"It is time for us to replace the failed prohibition with a regulatory system that works and let states and municipalities decide for themselves if they want, or don't want, to have legal marijuana within their borders.\""},{"comment_id":"10154530300669087","commenter_b":"I'm guessing the attorneys general in question are more aware of the law than you, random Facebook commenter.","commenter_a":"The Inadmissible Aliens Act Section 8 - 1182 allows the President to ban any group or nationality from getting Visas. The Law is Legal and on the books since 1952 and used by President Jimmy Carter to ban Iranians in 1979 and Obama in 2011.","post_message":"Virginia’s attorney general has joined other state attorneys general around the country in filing a lawsuit against President Trump over his immigration ban."},{"comment_id":"791521404314373","commenter_b":"ENOUGH FREAK SHOW BULLSHIT IF YOU HAVE A COCK YOU USE THE MEN'S ROOM","commenter_a":"That's the Republicans in a nutshell lol. Poverty??? Jobs?? Helping the Poor and Veterans??? FUCK NO!!! we don't have time to do that we have to make Bathroom rules lol","post_message":"Oh no....last time I posted on something like this I hate Liberal hate mail for about a month. So what's your thought on this?"},{"comment_id":"10153306477369586","commenter_b":"Bunch of dumb asses.","commenter_a":"this is sick","post_message":"Yes, those are real dead cats. :( Oklahoma high school students posted this disturbing video on Facebook. Wait until you see how the teacher was involved. HELP STOP THIS: @webpagelink"}]
