[{"comment_id":"10153512316881130","commenter_b":"Classy old gal she is....lmao","commenter_a":"I don't know about that if your kid is old enough to eat real food with a spoon its time to take them off the tit.","post_message":"\"There's no difference in me feeding my baby with my breast than you feeding yourself with a spoon.\""},{"comment_id":"1110994785663439","commenter_b":"All Hillary does is pander and shift her views to what's convenient for her.","commenter_a":"Democrats should Support Democrats , Bernie isn't a Democrat only in convenience, Playing basketball doesn't and shouldn't mean you support Minorities, where you live is who you are and in Vermont Bernie is 91% White?","post_message":"JUST IN: The Congressional Black Caucus PAC endorses Hillary Clinton for president."},{"comment_id":"644827892343831","commenter_b":"If you agree with Mike's comment you're a sexist ignorant shithead. Thanks Mike for demonstrating what sexist assholes think!","commenter_a":"Does anyone know what is considered rape? Rape is one of the most hanus crimes that can be commited. But can anyone really know if rape was commited. Many cases each year happen when 2 people have sex and then the girl just changes her mind and calls it rape. Now i dont know all the details in this case, but maybe this judge knew more than we did.","post_message":"Judge Aaron Persky infamously handed down a sentence of six months jail time to Brock Turner in June."},{"comment_id":"1071384586215885","commenter_b":"No, she's just a crazy bitch.","commenter_a":"This is silly. A healthy lifestyle stops Cancer 90% of the time . The other 10% is the govt and environment","post_message":""},{"comment_id":"1923125384575450","commenter_b":"All of them are nasty ass bitches","commenter_a":"These trump people are so ridiculous they would spin a shit sandwich Trump fed them by claiming it's full of protein because of the nutz in it","post_message":"LOL! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1832396510332680","commenter_b":"Should we really call it entertainment..I call it junk","commenter_a":"Why do you suppose Liberals love the entertainment biz and wanted control over it..it's one of their mainstream vehicles to get their agenda across...so much for entertainment anymore..","post_message":"“The music industry suffered a melt down on national television during the American Music Awards – launching into unhinged, profane tirades directed at President-elect Donald Trump and his wife, Melania,” Todd Starnes writes."},{"comment_id":"1137271292959073","commenter_b":"Sexist sad people. You know your mother is a woman!","commenter_a":"Hillary is amazing she is a rock! She doesn't go after fantasies, She will be a president like no other. As a female she will be challenged more harshly. Where is her compassion? Where is her Honesty? Where is her strength? Please don't forget she is already feeling and applying all these quialities!","post_message":"“I will absolutely protect your children, yourself, and try to bring your family back together.\" At the #DemDebate last night, Hillary spoke with the mother of five children who have not seen their father since he was deported three years ago."}]
