[{"comment_id":"1197755483636319","commenter_b":"oh look a trump impersonator ! If you don't agree with him your a PIG!! a LOSER a total Disgusting human beings!! We're going to make America grate and get my red hats from China yea it going to be grate! They both suck but I trust her with the nations safety and economic well being . He can't get it wrong! It's not like he can claim chapter 11 to get out of paying his bills? Right Einstein!! Lol","commenter_a":"Some People think being president is always being right! about everything you do or try to do! It's not that simple. Back seat driving is easy , but when your responsibility is keep America as safe as possible and the world. Some things will not always go right. You guys are the haters The Republican Party of No","post_message":"It's funny because it's true."},{"comment_id":"10153119692871130","commenter_b":"ughhh these bitches Emily Lee","commenter_a":"Can't wait!","post_message":"See how far women's rights have come in the first trailer for one of the year's top Oscar contenders: Suffragette, starring Carey Mulligan, Helena Bonham Carter and Meryl Streep."},{"comment_id":"10152609366937093","commenter_b":"Stfuh","commenter_a":"What a disrespectful jerk! You're lucky Saul that she didn't arrest you right there on live TV. You don't put your hands on an officer PERIOD!","post_message":"RAW & UNCUT: A sheriff's deputy didn't like where FOX 4 News reporter Saul Garza was standing during his live shot this AM.... then this happened.... @webpagelink"},{"comment_id":"10155159081916159","commenter_b":"And those immigrants came into are country legally . These SOB coming in now are not. Your so dumb","commenter_a":"So much hate coming from a country that was built by immigrants. You wouldn't be anything without the contributions of so many people from other nations. SAD!","post_message":"Protestors rally in NYC for Muslim and immigrant rights"},{"comment_id":"474933522694941","commenter_b":"No! We don't want any more of these people!","commenter_a":"AHH HELL NOO!!","post_message":"60,000? Can you imagine how many terrorists among them?"},{"comment_id":"817062668431422","commenter_b":"We are to political and afraid to hurt someones feelings to do anything... when Trump ginally takes the seat yall will see some change","commenter_a":"My tears go to all the fatalities. Rest in peace","post_message":"BREAKING NEWS: Berlin terror attack... At least 12 dead as truck ploughs into Christmas market Full story: @webpagelink"},{"comment_id":"10153721560403984","commenter_b":"We are protected by the Constitution. Christians founded this country. Gay people are harrassing HER, as there are dozens of other local offices that are issuiing these licenses for them. She is defending her faith and beliefs, not harrassing others. Do away with freedom of religion, and America is nothing.","commenter_a":"500%","post_message":"County Clerk Kim Davis has found herself at the center of a national firestorm after refusing to issue gay marriage licenses, even after the Supreme Court's decision. She's even being dragged to court herself, but she refuses to back down. Do you stand with Kim Davis?"}]
