[{"comment_id":"10153119305979641","commenter_b":"Of course she did. She's corrupt as Hell. Let's elect her president.","commenter_a":"Good for her.","post_message":"Hillary Clinton deleted all emails from her personal server used for official secretary of state business, a Republican lawmaker says. @webpagelink"},{"comment_id":"1171597936185008","commenter_b":"Says the white woman. Lmfao","commenter_a":"It's time for big changes? It's not a change to use racism as a command to get to the top despite our achievements. Jada Pinkett Smith, the talentless half black lady whose name is only known based on the celebrity of her husband. This cause needs a new spokesperson, perhaps a black celebrity with some actual talent worthy of an Oscar.","post_message":"“It’s time for big changes.”"},{"comment_id":"10152976985741636","commenter_b":"some clothes are made smaller then others, i can buy jeans at one store that are size 14 i can go too another store that has jeans that are size 14, the same day and there too tight so my point is sometimes different stores vary greatly in size so you have to wear bigger sizes because of how they are made","commenter_a":"the problem with this story is this....the young girl was NOT directing her comment at anyone but the shirt itself. I am a larger sized woman and have done the same thing when I found clothes that were super large. It's not a slight to those who are larger than me and I'm sure it wasn't meant that way by this girl. If you are that sensitive by your size, then stay at home or do something about it. I have been called names my whole life because I'm not a size 2 or even a size 12. What others think of my size is none of my business. If they allow my \"size\" determine whether they want to know me or not, I don't care. It's their loss. I'm pretty freakin' awesome once you get to know me. I like me. I'm confident in who I am on the ...","post_message":"A photographer is getting a lot of attention after a picture in a dressing room went viral."},{"comment_id":"10154858734646002","commenter_b":"@username I was shocked at the same thought, why would Disney have a man made Lake that wasn't somehow protected from alligators with a border fence ?!?! We've been there, never thought about alligators because it's Disney, they have safety rules and barriers everywhere.","commenter_a":"So let me get this straight ... Another parent is not watching their child in an area where it clearly says NO SWIMMING so now we are killing alligators for feeding in their habitat where once again it SAYS NO SWIMMING!! What is wrong with people ?!","post_message":"\"We have been to Yellowstone and encountered grizzly bears, but this is just freaky.\""},{"comment_id":"10153369790181770","commenter_b":"SHES A WITCH!!!","commenter_a":"hillary is an idiot , how could anyone vote for someone so evil, she has to be stopped","post_message":"Clinton thinks everything is fantastic at the U.S.-Mexico border."},{"comment_id":"828695877229020","commenter_b":"I would of kicked someone ass if that was my kids","commenter_a":"Jessica Bates daaammm","post_message":"The children were 4-6 years old."},{"comment_id":"10153556232516162","commenter_b":"Wtf","commenter_a":"Merdith V Marin","post_message":"WHAT THE HAY? Caught on video by undercover cops, Michael Crawford told investigators that for 35 years he's been traveling the country having sex with horses... @webpagelink"}]
