[{"comment_id":"1656175608015779","commenter_b":"You go girl get the pig rapist","commenter_a":"Another one 😂","post_message":"WATCH LIVE: Donald J. Trump to face lawsuit from woman alleging sexual misconduct."},{"comment_id":"10154666136846833","commenter_b":"I'm thankful there isn't enough police to stop all crime! Because then we would be living in a police state!","commenter_a":"There is one more Woman who Had a gun to protect her Family, but a lot of Americans who will never be Able to protect there Family's for not owning a Gun. They live in a elusion of Safety that the Police have enough manpower to Protect them. Unfortunate there will never be enough Law enforce Officers to protect everyone. It is up to you to Protect yourself as much as possible.","post_message":"If three intruders break into your home and hold your spouse at gunpoint, what would you do? This Florida woman was faced with that dire scenario last week. Thankfully, she was able to run to the bedroom and grab her own firearm to end the ordeal and save her husband."},{"comment_id":"1772911969633181","commenter_b":"Trump says they can come back legally. Why deport them?","commenter_a":"Try this Clinton: Little girl: \" Does my family have to go back to wherever?.\" Clinton: I'm afraid you do, you see your parents are criminals.\" Little girl: \"Criminals?\" Clinton: \" Yes your parents came into this country, illegally, they broke the law.\" Little girl: My parents are criminals? Don't bad people go to jail? At school the teacher, told us you belong in jail. Is that true?: Clinton: Just like your parents, only if I get caught\" Little Girl \" Oh Clinton I want to grow up to be just like you. Circumvent the law, lie, cheat, steal. I'll vote Democrat forever.","post_message":""},{"comment_id":"737985369668440","commenter_b":"Madwoman as bad as Obama, she must be Satan's tool...","commenter_a":"Angel of death!","post_message":"By BI\" She wants to recruit even more African and Balkan Muslims to fill positions as doctors and electrical engineers. Notice the stunned looks on the people who are listening to this rubbish. @webpagelink"},{"comment_id":"1801403630131591","commenter_b":"WHEN SHE STEALS THE HAITIANS FOR HER DAUGHTER' S WEDDING, GOD SAVE AMERICA !! LOSER CRIMINAL HITLARY Nutjobs!!","commenter_a":"It feels like Hunger games in here with all the trash talks and the media coverage ... May the odds be ever in your favor ma'am","post_message":"Share this if you know someone who needs to see it. hillaryclinton.com/locate"},{"comment_id":"10153853522001336","commenter_b":"Your Governor says yes to more refugees.","commenter_a":"I just found out that approximately 130 Syria refugees are here in PA .","post_message":"“What I want is a watch list. I want surveillance programs. Obviously there are a lot of problems. I want a database for the Syrian refugees that Obama’s gonna let in.” Donald J. Trump went “On the Record’ to clarify his recent comments, emphasizing that he wants to keep track of the Syrian refugees entering the United States, not all U.S. Muslims. @webpagelink"},{"comment_id":"1065493480157790","commenter_b":"I hope he is right. We can live well without what Beck represents.","commenter_a":"lol Beck is always good for a laugh","post_message":"Glenn Beck's reaction to the fact that the Supreme Court upheld Obamacare was nothing short of amazing."}]
