[{"comment_id":"588476011355911","commenter_b":"I've actually flushed stuff better looking than this retarded skank!","commenter_a":"Why don't you leave like you said you would?","post_message":"Loud mouth Whoopi and her co-hosts are making serious unfounded accusations and demanding Trump step down. Let's get 5,000 'SHARES' & 'LIKES' to show that Whoopi is the one that America wants to see \"STEP DOWN!!!\""},{"comment_id":"516541241803803","commenter_b":"@username then you should stfu!!","commenter_a":"If he violated a voting law, he should go to jail! Oh, wait! He was a drug dealer, had people killed, is a rapist, lied under oath, sold military information to China,.... STILL WALKING FREE!","post_message":"Do you think Bill Clinton should go to jail for this?"},{"comment_id":"10154160102065047","commenter_b":"GET US OUT OF THE UNITED NATIONS; THEY ARE NOT STANDING UP FOR 'BASIC HUMAN RIGHTS' FOR THESE WOMEN AND CHILDREN UNDER ISLAMIC RULE. WHY? THEY ARE RUN BY ISLAM NOW. GET THE UN OUT OF THE USA.","commenter_a":"Why do so many Americans support and justify this abomination???? The number of Islamic apologists is nauseating!","post_message":"Little girls in northern Kenya are being brutally tortured and enslaved. They're forced to marry men as old as their father or grandfather. Sign our urgent petition to demand an end to this evil practice."},{"comment_id":"10154017509764156","commenter_b":"I will keep you in my prayers, Eva. You'll need them.","commenter_a":"California has extremely strict gun laws! Many in violation of Supreme Court orders! Blame the terrorists that did this, not the gun laws! It's obvious no one other than the murderers had a weapon or this would have ended much sooner, with less tragedy!","post_message":"There are no words that can come close to describing the horror of today’s attack in San Bernardino and my heart goes out to the victims and their families. Our only response must be to take immediate action to stop tomorrow’s mass shooting by addressing the gun violence epidemic. Period."},{"comment_id":"10153010796814586","commenter_b":"Stop the dog slaughter. Stop killing,our animals. MONSTERS!!!","commenter_a":"Sigurd Rognan","post_message":"Dogs are speaking out for their friends being KILLED FOR LEATHER in China & sold all over the world. SHARE if you never WEAR your BEST FRIEND! JOIN THE MOVEMENT: @webpagelink #DogLeather [By posting your photo on Facebook, tagging PETA & using the hashtag #DogLeather, you are acknowledging that you have read & agree to our terms of submission: @webpagelink"},{"comment_id":"984289534964128","commenter_b":"Easy. Stop all benefits to foreigners.","commenter_a":"Foolishly, in October 2014 Italy left-wing government became the first European Union country to decriminalise illegal immigration and deploy its navy at huge expense to save migrants crossing the narrow Sicilian channel in open boats from North Africa (Libya mainly) in order to bring them to Italy and thus the European Union where most remain. The policy change, driven by a perverted mix of human decency and political correctness, was pure folly: it has acted as a green light to wannabe boat people everywhere, whose numbers soar as the chaos in Africa and the Middle East escalates. The result is an exodus of biblical proportions out of Africa and the Middle East into Europe. The Welfare System in Britain and Ireland is the main attraction for these illegals. Action needs to be taken now to STOP this Exodus!!!!!","post_message":"Forget the Greek crisis or Britain's referendum, this wave of migrant's is Europe's biggest threat"},{"comment_id":"10156340474870354","commenter_b":"The Failed LIE of Multiculturalism is KILLING America. Low IQ Aborigines cannot uphold the Personal Responsibility DEMANDED. See Baltimore, DC, St Louis and Ghetto after Ghetto!","commenter_a":"Yes, yes!","post_message":"“I believe our country’s biggest threats come from within, from failing to address our incredible fiscal irresponsibility, by allowing our populous to become enemies with each other, stirring up hatred and strife within our country, by allowing education to take a second seat, by giving a lot of lip service but not actually taking care of it.\""}]
