[{"comment_id":"10154874885608796","commenter_b":"Drain the swamp!","commenter_a":"Yates used no integrity because she took an oath of office to obey the law. Same as Lynch did. Both should have been fired no just one of them.","post_message":"Former Attorney General Loretta Lynch praised now-fired acting Attorney General Sally Yates for her “unshakable integrity” in refusing to defend President Donald Trump’s executive order putting a pause on travel from terror-ridden countries."},{"comment_id":"10154828234334714","commenter_b":"No vote Hillary & she have problem health. Prison Hillary.","commenter_a":"I'D EVERYONE!!!! don the con has his sheep voting twice three times in some places!!!","post_message":"Democrats will seek court action to preemptively block potential voter harassment from Republican poll watchers."},{"comment_id":"10154889301650180","commenter_b":"Mine must have Bluetooth capability or something... every time I use it for lane changing, the car behind me speeds up to block me... weird!","commenter_a":"Oh so there not decorations for the holidays? Because it seems that's the only time I see people really using them","post_message":"Indiana State Trooper films hilarious PSA about this major vehicle safety feature called a \"turn signal.\" @webpagelink"},{"comment_id":"576869582486929","commenter_b":"BULLSHIT !","commenter_a":"And who's to pay for the insurance? Oh forgot the WORKING CLASS WITH TAX THAT'S WHO!!!!","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"},{"comment_id":"1774184492816291","commenter_b":"@username racist idiot.","commenter_a":"NO WAY! No one else should be added to Mt. Rushmore, but especially not Obama! There are a lot better President's that could have been added, but not him!","post_message":"Obama's Face To Be Inserted Into Mt. Rushmore. Don't mess with this national monument. Do you think Obama's face does not deserve to be up there?"},{"comment_id":"10154013744111378","commenter_b":"Facepalm! So because we have rapists in this country, we should import more?","commenter_a":"No more refugees! Too many of them seem to be mentally ill.","post_message":"Olango arrived in the U.S. in 1991 as a refugee from Uganda."},{"comment_id":"924764137560927","commenter_b":"Yes, because lesbians can't be impregnated by gays.","commenter_a":"remember as well folks that homosexuality is a societal and evolutionary dead end.","post_message":"“This is something we should be applauding.\""}]
