[{"comment_id":"10153311065101167","commenter_b":"Three words: Token. Black. Woman.","commenter_a":"Why does anyone care what Stacey Dash has to say?","post_message":"Today on live TV on two separate programs, Fox News called Obama a \"total pussy\" who doesn't \"give a shit\" about terrorism:"},{"comment_id":"711006379048137","commenter_b":"THERE IS SOMETHING WRONG WITH THIS BRAINLESS MORON...CAN NOT LISTEN TO HER HAVE TO CHANGE THE CHANNELL.....I WISH THEY WOULD NOT PUT HER ON...DISAPOINTED CNN.","commenter_a":"I just cannot listen to her!!","post_message":"No, Donald Trump would NEVER try to draw attention to himself. /smh/ --Andrew"},{"comment_id":"1084846008220301","commenter_b":"It's past time for the GOP to get behind Trump as front runner and he is not a racist the black and Mexicans are voting for him because they know the ILLEGALS are taking their jobs and we need that wall for our security and jobs for real Americans nobody wants to live off of welfare and with this core education makes it hard to get a job VOTE TRUMP 2016","commenter_a":"OK Donald and ted, you need to go to your corners and take a breath. When you have settled down you can no longer sit at the adult table. This is why we cannot have nice things, you two acting like very spoiled children. Enough of this infantile acting, are you trying to give this nomination to kasick?","post_message":"Things are about to get REALLY messy..."},{"comment_id":"10153232887939071","commenter_b":"@username she's a bad asss","commenter_a":"Zelal Tas","post_message":"The Canadian model who is fighting ISIS in Syria says the terrorists are all cowards."},{"comment_id":"10153583167657623","commenter_b":"Tyler Hart","commenter_a":"Christine Striano","post_message":"A derailed train is blocking a number of intersections in Randleman after a number of train cars went off the tracks."},{"comment_id":"1261804000541268","commenter_b":"WHy do you follow him?","commenter_a":"The word \"voter\" isn't in the constitution Bernie. You lost man..too out of touch","post_message":"Hillary Clinton won the popular vote for President by almost 3 million votes. Donald Trump will be inaugurated as the next President. That doesn't make sense for a democracy. The electoral college system needs to be changed."},{"comment_id":"10153750734644369","commenter_b":"Ya, and you will go after corrupt windbags in D.C next? It looks good on paper, but it wont happen. There are laws in place that wont allow this to happen. Take the LLC for example, go after the company but cant get the person. But then again, when did laws ever apply to this administration.","commenter_a":"They need a home now!!","post_message":"It is a \"significant scaling up\" of the U.S. commitment to accept refugees from Syria."}]
