[{"comment_id":"10153242088138132","commenter_b":"Pretty sure you have to have virgin hair","commenter_a":"Well I just got my hair colored and cut. I'm sure it will be on the front page by Monday. Hehe","post_message":"Love it or leave it?"},{"comment_id":"1252133991511641","commenter_b":"Hillary Clinton for the next president","commenter_a":"Just like President Obama said, if his own campaign can't even trust him with a simple tweet, then why should we trust him with the nuclear codes? #VoteBlue","post_message":"Donald J. Trump's peek at Melania Trump's ballot inspired a flood of jokes"},{"comment_id":"10156331027250354","commenter_b":"She's an idiot!!","commenter_a":"She's not speaking for me that's BS","post_message":"Does she speak for you?"},{"comment_id":"10154264238746509","commenter_b":"We have been since before 9/11, WTC was hit twice by them","commenter_a":"No we are not at war......but we do have a cancer growing that needs to be eradicated !!!!","post_message":"U.S. Senator Ted Cruz said Thursday that the deadly mass shooting in San Bernardino, California, shows that the country is \"at war.\""},{"comment_id":"10152878720003645","commenter_b":"Great american baboons","commenter_a":"There is something inherently wrong in the black community to promote this type of group violence. But then will cry racism at a drop of a hat...it is these very images that create the negative image of blacks. We are our own worst enemies not the \"white man\"...","post_message":" tenacity of placing something on video to shoot a young lady being beat down by six or seven young women is ludicrous in our community."},{"comment_id":"986959091402697","commenter_b":"Your wife?","commenter_a":"Twat","post_message":"The poll shows a 10.7 point lead among likely voters over Trump."},{"comment_id":"10156857801965093","commenter_b":"Who will women vote for if Trump and Clinton are both running in the Fall?","commenter_a":"Maybe America have more young vaginas thann old vaginas!","post_message":"It's hard to believe America's first female Presidential front-runner is doing THIS badly among women."}]
