[{"comment_id":"10152932791740528","commenter_b":"That was before we had so many illegals that thought they deserved the same rights as legal citizens","commenter_a":"You register to vote when you turn 18 or renew you drivers license. Some older citizens have not had a license in years. Many poor don't have vehicles and don't need licenses. Direct deposit and ATM's have changed the way we bank thus eliminating the need for ID. The fact that many don't have birth certificates to get an ID or can't afford to go get both if they were born in the city of Detroit, but you need an ID to get a birth certificate. If you were born out of state good luck, it is so hard to get one, without an ID, it is almost impossible. It is a vicious circle and many just stop trying to jump through the hoops to get an ID, thus, they just don't vote even though they are on the registry to be able to. I remember just walking in and ...","post_message":"On this day in 1965, while thousands marched from Selma to Montgomery, President Lyndon B. Johnson urged Congress to pass the Voting Rights Act. Today, the law has been gutted by the Supreme Court, and we need to fix it. Every American deserves the right to vote and to have their vote counted."},{"comment_id":"1008748529146158","commenter_b":"And you are a pussy","commenter_a":"Your not a hunter if your using a gun, your a murderer.","post_message":":("},{"comment_id":"720325791491332","commenter_b":"Josiee, you write like a whore. Are you?","commenter_a":"Screw the Muslims if they do not like our christian message go back to where you came from","post_message":"Trump is in deep trouble after sending out a beautiful message to his supporters. We stand with him. Can we get 40,000 ‘LIKES’ for Donald Trump?"},{"comment_id":"10154770811534411","commenter_b":"come on now David, gotta bring the muslims into it. Bet your a fucking Tory, or one of those ukip nazis. Away and take your face for a shite","commenter_a":"@username being one of media that show Russia is not a problem in Syria after its jets bombs and kill thousands of women and children,Killing by bombing is still an act of terrorism and should not be favoured,just fool those who see one side of the coin and they dont want the truth to prevail","post_message":"'There is a hysteria which is being organised by politicians and the media against Russia to see Russia as the only problem in Syria'"},{"comment_id":"949119691868046","commenter_b":"@username You cant be this obtuse. It was a joke. Have you seen any of her material? What was disgusting was her response to a KID.","commenter_a":"She's famous, making a great living for herself and it is because of the fans. If she doesn't want attention or people taking pictures of her / with her then she should have chose a different profession. She should be humbled that someone likes her enough to stop her on the street for a picture, not post a picture ridiculing a fan on her instagram for thousands of people to see. Poor taste.","post_message":"Find out what made Amy Schumer put an end to fan pics."},{"comment_id":"10154533631771756","commenter_b":"Well, it's not final yet, but research has shown that kids in 3rd world countries have fewer food allergies because they have had hookworm infections. The hookworm releases enzymes that actully turn off parts of your dna that determine food allergies and other autoimmune diseases. It's in the worm's best interest to keep the host able to eat many things so that the worm can enjoy them, too.","commenter_a":"Tina Pak","post_message":"A research powerhouse attempts to solve the huge mystery of why food allergies have been skyrocketing in recent years."},{"comment_id":"1363879910298702","commenter_b":"Yeah! Stupid Sheep","commenter_a":"Love Bernie Sanders! #feelthebern","post_message":"Bernie Sanders was cheered for like a rock star during his surprise visit to a Verizon picket line in Brooklyn today. Read full story: @webpagelink"}]
