[{"comment_id":"507182816138965","commenter_b":"ATTN clueless bitch.....shove it!","commenter_a":"ATTN: ATHEISTS: Get a head start and go straight to hell which is where you will end.. Satan is waiting for you....","post_message":"Christian principle under heavy fire from atheists after he did this. He's in serious trouble. Let's show him our support. Do you support this Christian principle?"},{"comment_id":"223405771457676","commenter_b":"Greg Allen Bitch was prob Bisexual🤣 There's alot of them women running around claiming they gay when they lowkey bi. Hell the woman I messed with was prob Bi on the low!","commenter_a":"To each their own.. Who cares if she wanna be a stud.. Lol y'all niggas mad that her broad prolly look better than yours.. And you are born with a dick.. lmfao.. Let this person be whatever they want, ain't hurting me or my pockets fam..","post_message":"Crazy difference... #YoungMA #WSHH"},{"comment_id":"10154147730689071","commenter_b":"Lol you need help lady","commenter_a":"Good job trump. Keep up the good work. We need to be making more friends. Even if the liberals wanted to go to war with Russia led by Hillary. It's time for a new chapter in diplomacy.","post_message":"\"To be honest with you, the waters here seem like a little bit of a tempest in a teapot. I mean, it's striking to me that President Obama would reach out to a murdering dictator in Cuba and be hailed as a hero...\""},{"comment_id":"419941198130475","commenter_b":"Yes, Yes, she is a ruthless women!","commenter_a":"Youll keep up the good work","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"},{"comment_id":"10153545736202014","commenter_b":"You are obviously ignorant to what really goes on behind bars. I hope you have the opportunity to find out one day. You are only one mistake away.","commenter_a":"He is the best thing for Maricopa County in so many ways - everyone needs to experience what it is like when you do not have a Sheriff Joe - it is shear chaos - the prisoners have the power and control - Bless Sheriff Joe and i wish we had more like him . So yes yes yes from me","post_message":"YES or NO: Do you approve of Joe Arpaio's job performance?"},{"comment_id":"10154135528287541","commenter_b":"Cops can not go around just asking people to show their ID without them committing a crime or breaking the Law!!!","commenter_a":"The Police needs to know and learn what the Law actually states!!! Because what they did is against the Law... American Citizens do have Rights!!! If they oppose to it or not!!! The cops should not be above the Law!!!","post_message":"They Tasered a black man in the face who was actually a part of their team."},{"comment_id":"10152682791936167","commenter_b":"The thing that pisses me off is he gets paid for his bullshit!","commenter_a":"That rules him out.","post_message":"How Rush Limbaugh talks about female politicians:"}]
