[{"comment_id":"634863706677709","commenter_b":"Yes absolutely. ...you are on our soil...you NOW live by our laws...if you don't like that LEAVE....","commenter_a":"Yes she has to obey the law's of this land, or be deported","post_message":"Muslim Refuse To Remove Head Covering For Officers – Gets Brutal Wakeup Call. Should of listen to authority. Do you think everyone should have to obey they law, regardless of religion?"},{"comment_id":"1120798904674131","commenter_b":"#NeverCrookedHillary #HillaryTheLiar","commenter_a":"If taxes will pay for it, and I pay taxes, shouldn't this read \"How much money will Hillary's plan cost you?\"","post_message":"Whether you already have student loan debt or you're preparing to go to school, Hillary's college plan can help you save money. Find out how much using our new calculator: hrc.io/2cH4yGX"},{"comment_id":"10154059836575667","commenter_b":"follow please Happiness is not that owns everything you see beautiful, but happiness can see all of its holdings beautifu","commenter_a":"What a nitwit, well good for him, a felony record for life, he earned it and deserves it !!! Hope he gets at least a year to boot !!","post_message":"Will the man who destroyed Donald Trump's star on the Hollywood Walk of Fame go to jail?"},{"comment_id":"10155104140119497","commenter_b":"Build that wall, watch all the libs fall on ground kicking ...priceless..let the shit show begin...popcorn anyone?","commenter_a":"I thought the Onion was supposed to be funny.","post_message":"How The Border Wall Will Be Built"},{"comment_id":"10153033840709071","commenter_b":"It's screwed up that you assume (be it probaly acurate) that we have not heard of Eritrea.. Why dont people know grography? It's alarming.","commenter_a":"People are leaving in droves so things are obviously not great, however western media outlets have always been incredibly harsh with regards to Eritrea. The ongoing refugee crisis is incredibly sad though. @username, thoughts?","post_message":"The worst regime you've never heard of."},{"comment_id":"10153649800077894","commenter_b":"Such a hateful bitch","commenter_a":"So Janet Jackson cancels her tour, gets pregnant and then has the nerve to drop a new video that was basic as all get out......Janet will see you after the baby because 2016 is not for you.","post_message":"Janet Jackson – Dammn Baby [New Video]"},{"comment_id":"1428416493869569","commenter_b":"She, that was a woman officer","commenter_a":"watched the video again lucky nobody was shot what people need to remember officers have a family too they want to go home in one piece he should have drawn his weapon but he still would have been the bad white cop","post_message":"MUST WATCH: Two people face assault charges following a wild brawl with a police officer in Nashville."}]
