[{"comment_id":"532673453589901","commenter_b":"Linda are you drunk? Your comment makes no sense. Girl get yourself together.","commenter_a":"If he does not support Obama he should not have to speak to him. It's a free country so far.","post_message":"Obama is outraged after Tom Brady made an epic stand against him. This is amazing. We have is back, let's show him our support. Can we get 10,000 'LIKES' for Tom Brady's stand against Obama?"},{"comment_id":"10153459295185927","commenter_b":"A radical MUSLIM!!!! Keep searching granny at the airport.","commenter_a":"We do NOT NEED gun regulation. We need ARAB regulation!!!! And we need HEARTS rehabilitated more than ANYTHING!!! We need GOD put back into our country!!! And along with God put back into every American's heart, we need a GUN put into every American's HAND!!!!!!!!!!!","post_message":"UN Human Rights Chief Zeid Ra al Hussein: the United States, however, there are hundreds of millions of guns in circulation"},{"comment_id":"10154800367722293","commenter_b":"@username Human rights should always supersede law otherwise we are no better than the Muslim extremists we criticize so much (for good reason). Yes, we need to have strict immigration laws but due to our decades of non-existence of it due to the fact that we can profit from it, people shouldn't be punished and exceptions to the rule would exist. There are undocumented people who have been here all their lives, kids who know no other home than here and good tax paying people. Criminals - yes get them out. Instead of a wall use technology and more man power at the border. Create temporary work visa give. By employer, families who are working and are not a burden to the system can stay. There are better ways.","commenter_a":"\"let us all unite. Let us fight for a new world - a decent world that will give men a chance to work - that will give youth a future and old age a security. By the promise of these things, brutes have risen to power. But they lie! They do not fulfill that promise. They never will! Dictators free themselves but they enslave the people! Now let us fight to fulfill that promise! Let us fight to free the world - to do away with national barriers - to do away with greed, with hate and intolerance. Let us fight for a world of reason, a world where science and progress will lead to all men happiness. Soldiers! in the name of democracy, let us all unite!\" - Charlie Chaplin, \"The Great Dictator\" (1940).","post_message":"Trump vow of mass deportations could soon become a reality."},{"comment_id":"1776428082627538","commenter_b":"I pray to God that people who think she would be a good president, realize how wrong they are. I don't know that Trump would be good, but so far he seems better to me than her. Sadly the Libertarian candidate has too many views that are not on par with me and it is in the areas that matter most to me. Trump shares my stance on all of the issues that have come out thus far.","commenter_a":"TRUMP....you better not bail on us man. You're our only hope!!!","post_message":"Hillary Clinton Finally Tells The Truth: Pledges She Will Raise Taxes On Middle Class"},{"comment_id":"1878310592388061","commenter_b":"Deport this muslim.","commenter_a":"The Quran should not be recognized as","post_message":"First Somali-Muslim Lawmaker Who Married Her Brother Was Just Sworn In, And Americans INSTANTLY Noticed What She Had Her Hand On Top Of! This is ILLEGAL! Sharia is non compliant!"},{"comment_id":"388258684695759","commenter_b":"We all need to ban to gather and kick all Muslims out of this country they have no say so in this country if they want say so they need to go back to their own country this is United States of America not Mohammed country","commenter_a":"You damn right. All states should do this","post_message":"It's time that all the states do the same..."},{"comment_id":"10153472925796336","commenter_b":"Oh, what a surprise, Jackie is an ignorant b*tch offering her uninformed, sexist opinion.","commenter_a":"Everyone is so concerned with making sure winny people feelings don't get hurt by legalizing gay marriage and taking down flags but the real important stuff like the murder of baby's everyday is last on their agenda.. ban abortion and all these little hoes will be forced to used condoms. . If you get raped, , i understand it's a sad thing but don't kill the baby. .the baby didn't ask for it. Have the baby then give it up for adoption. . But it's an innocent baby. . Stop committing murder. .","post_message":"“I’m saying there ought to be some humanity and respect for the dignity of a potential life.” – Megyn Kelly on last night's 'The Kelly File'"}]
