[{"comment_id":"10152751952356130","commenter_b":"Stop sending people to Portland! #dontmovetoportland","commenter_a":"Esther Payne","post_message":"Is your city on the list?"},{"comment_id":"832375306811018","commenter_b":"Fire her, is this what she is teaching kids? She need to teach the prisoners not the kids!","commenter_a":"What an idiot teacher, she should be suspended and never get anymore money !!","post_message":"An elementary school teacher has been suspended for having her 3rd-grade students write \"get well\" letters to an inmate convicted of killing a police officer. What would you do if your child was in that classroom?"},{"comment_id":"905767619489994","commenter_b":"Yeah...I gotta BITCH with a BITCH that like BITCHES!!! LMAO 😂 😂 😂","commenter_a":"@username @username lmao I'm dead 😂😂💀 the comments","post_message":"When your ex asks about getting back together"},{"comment_id":"10154222975181336","commenter_b":"Throw Megyn Kelly up and over #TrumpWall and into Mexico!","commenter_a":"This is supposed to be a cutting edge news story? I am really disappointed with Megan Kelly. Every episode is guests who trash Trump. Megan always has guests on that attack Donald about women. It is her agenda. it is disingenuous.","post_message":"TONIGHT on The Kelly File: In an exclusive interview, Ted Cruz's wife, Heidi Cruz, speaks out about Donald J. Trump's retweet of an unflattering photo of her: \"I think we have a pattern of behavior here ... when Donald Trump is falling behind.\" Don't miss the entire interview with much more at 9p ET. @webpagelink"},{"comment_id":"1629129360707510","commenter_b":"she is a piece of trash and nothing can change that","commenter_a":"Who cares","post_message":"This Is Unbelievable!"},{"comment_id":"904212379645518","commenter_b":"These thugs and hoodlums should be arrested .","commenter_a":"Thugs","post_message":"He Wasn't Ready!"},{"comment_id":"1803705829897591","commenter_b":"@username and she wasn't wrong. They are deplorable.","commenter_a":"I am a Hillary supporter but instead of casting blame she should've been a better candidate. She should've visited more cities and counties and not just the ones that she thought would've secured her the election. She shouldn't have insulted the American people and expect that they were going to magically convert to her side by debating Trump. Yes, the FBI director and the emails definitely contributed towards her loss but maybe if she didn't have major corporations and banks and foreign countries on her payroll she would've won. Edit: To everybody saying that I'm not a real Hillary supporter or that I'm a troll/not a real person. I voted for Hillary so if that doesn't show my support then I don't know what will. Because just like you can love/support your children/parents but not agree with some of their beliefs or with some of the things they do, you ...","post_message":"Breaking News: Hillary Clinton cast blame for her loss on a decision by James Comey, the FBI chief, to revive an email inquiry ahead of the election."}]
