[{"comment_id":"1030585200364962","commenter_b":"DON'T TRUST HER ... Obama and Hillary want to rescue 200,000 Muslims. This is the same two that couldn't rescue four Americans in Benghazi. ... #VoteTrump2016","commenter_a":"Hillary's background If you happen to see the Bill Clinton 5-minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware. A person who was there for most of their presidency and knows them better than just about anyone has listed a few corrections. Bill says: \"In law school, Hillary worked on legal services for the poor.\" The facts are: Hillary's main extra-curricular activity in law school was helping the Black Panthers, on trial in Connecticut for torturing and killing a federal agent. She went to court every day as part of a law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: \"Hillary spent a year after graduation working on a children's rights project for poor kids.\" The facts are: Hillary interned with Bob Truehaft, the ...","post_message":"Hoy, el Departamento del Trabajo acaba de anunciar nuevas reglas laborales que garantizarán el pago de horas extras a trabajadores que ganan hasta $913 dólares a la semana o $47,476 al año. Esto es más del doble que el límite pasado de $455 a la semana. Hillary: \"Aplaudo al presidente Obama y al Secretario del Trabajo, Pérez, por estas reglas sobre horas extras laborales, las cuales levantarán a trabajadores a nivel nacional y ayudará a que los salarios aumenten nuevamente para las familias trabajadoras. Durante el primer año de la implementación de estas reglas, millones de trabajadores adicionales serán elegibles para el pago de horas extras, finalmente cobrando totalmente por las horas que le dedican a sus trabajos... Nadie que trabaje 40 horas a la semana debería tener que mantener una familia en la pobreza”."},{"comment_id":"948931958516352","commenter_b":"Somebody exterminate these animals !!!","commenter_a":"Just run their fat black asses over because black lives do not matter - at least not to black people so why should I give a flyin' fuk about 'em.","post_message":"Merry Christmas from Hillary, Barack, and Black Lives Matter!"},{"comment_id":"10156520680400354","commenter_b":"Atheists can suck my balls.","commenter_a":"Why do all the liberal atheists shit on Christianity on this page so often? Why don't you dis Islam? Why not any other religion? It's pretty pathetic that you join a conservative page with one intent, to act like complete dicks to anyone with a conservative or a Christian belief. Are you trolls being paid?","post_message":"Not EVERYONE is afraid to stand up and be counted..."},{"comment_id":"10153498381391523","commenter_b":"Someone needs to throw this evil bitch out of a car. The same way she did to these innocent pups.","commenter_a":"Awe poor baby","post_message":"A woman let three dogs out of her vehicle and sped off on Farmlane Drive in Slinger -- with the dogs chasing after her. Now, police are searching for answers. Please spread the word."},{"comment_id":"1011931832233204","commenter_b":"They don't really care about fetuses either. If they did, they'd be storming fertility clinics, demanding that leftover embryos be implanted in someone's uterus. No, this whole thing is about controlling women.","commenter_a":"The Republicans & Right Wing Christians are trying to take woman back to the 50's. Women should know their place, sit down & shut up.","post_message":"After seeing all the pro-lifers cheer the attack on Planned Parenthood yesterday, it's time to remind ourselves of how they really feel about human life. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153895768928132","commenter_b":"Showing your butt in public doesn't empower women. It's the opposite. It shows women as sex objects. It shows little girls that is ok to post pictures of them naked. It shows those real woman with curves that if they don't look like that, they are not\"normal\".","commenter_a":"Beautiful!","post_message":"You rock, Demi Lovato!"},{"comment_id":"1371535832866166","commenter_b":"What's wrong with strippers? Lol","commenter_a":"I cant believe you fools who support absolute political corruption.... you will lose your homes and jobs, mark my words, she is Obama part 2, choose wisely sheeple","post_message":"ELECTION DAY: People are casting their ballots across the country today. Have you cast your vote yet? Who do you think will win? Our coverage starts at 4 p.m."}]
