[{"comment_id":"10153924016401130","commenter_b":"Oh grow up all of you. Why should she need to put a cover over her breasts. You put a cover over your mind and give thanks that mothers can feed portably whilst not being excluded. I'm sure you can train your mind to manage to view a pair of breasts as a feeding devise and look at how your own mind processes this function. Women relinquish enough do to our biology - can't we at least feed and belong at the same time?","commenter_a":"She should have stayed home. Not her day.","post_message":"Now THIS is a cool mom. 😎"},{"comment_id":"10153899755279218","commenter_b":"Ridiculous!!! That's y some of these mother fu#$&@# go around and do what the hell they want to do because of the justice system really lay these fuc&%$@ down do to them what they are doing to others give them the death chair it just doesn't make any sense to me...eye for an eye I don't care if its my family u did the crime u do the time I believe in 2nd chances some deserve it and some don't plain and simple","commenter_a":"K she looks HIGH AS HELL in her mugshot. Shorty clearly has a problem. Her baby should go to someone who cares, someone who will love her forever. There's no way I would let the child stay with this woman.","post_message":"MOM GUILTY: Sandra McClary, 26, pleaded guilty to reckless endangerment of her child, Anne Arundel County prosecutors said. Police said McClary's 2-month-old daughter was found in a carrier on the side of the road late July 4 in Pasadena. READ MORE: >> @webpagelink"},{"comment_id":"10154358631096943","commenter_b":"Put her in jail with her boss","commenter_a":"So..yeah.. Legit question here @webpagelink/ So yeah can we?? If this were a case involving weed or oil on national historic sites or someone's private lands etc the Feds would be KNEE DEEP in it!! Or at the very least CA's electoral points be split 50/50!","post_message":"This is serious. We are investigating now."},{"comment_id":"10154620951999714","commenter_b":"Phelps and Beyonce can go both choke on razor blades.","commenter_a":"And more","post_message":"Beyoncé, Britney Spears, Rihanna, Michael Phelps and more! #VMAs2016"},{"comment_id":"10155295092495579","commenter_b":"Liar!","commenter_a":"Zero evidence that Russia had any influence in our elections , period. The only people that believe this are the liberals that hate Trump.","post_message":"President Trump: \"To be honest, I inherited a mess. It's a mess. At home and abroad. A mess.\" Watch full news conference here: @webpagelink"},{"comment_id":"10154622487769342","commenter_b":"Ignorance. Many Americans with family there. Not your brothers/sisters? Or don't they count?","commenter_a":"Fall out from whom? Iran saying Americans aren't welcome there? Darn. Or is it the shrieking protestors? Tiresome.","post_message":"Legal residents and visa-holders were being denied entry Saturday to the U.S. under the Trump action."},{"comment_id":"1129680070463931","commenter_b":"I don't know where you get this clump of cells thing... maybe in the beginning... before a mother even knows she's pregnant, but by the time they would know that fetus reacts to pain and sounds (especially it's mother's voice)... fairly quickly it dreams... science has shown this... putting religion aside... before the end of the 1st trimester it is a living being and respirates like any other human (just gets its oxygen and nutrition differently). Much more than a lump of cells. At 18-22 week the child can be born and live a normal life 9 time s out of 10 even if the mother's life is in danger at this point there is no more dangers to birth over abortion. On top of that... healthy infants get adopted by people that want them...","commenter_a":"This has nothing whatsoever to do with humane treatment. It's another attempt at shaming the woman for making her own personal choice and finding a way to punish her. This is also another ill-fated attempt at giving a fetus, a few cells, personhood. A fetus nor a clump of cells can be made to be treated as a once living, breathing human being, nor should it be treated as such. As soon as these \"lawmakers\" can dictate that, it's a short road to personhood, to claiming murder and denying a woman a choice and having autonomy over her own body.","post_message":"About 35,000 public comments poured into the Texas Health and Human Services Commission about the rule change."}]
