[{"comment_id":"10153391212533984","commenter_b":"Dumb ass!!!","commenter_a":"Another actor who thinks his opinion matters to anyone with an IQ over that of a houseplant....sooooo sorry George, but you really should stick to acting.","post_message":"This might lose George a few fans. What's worse than announcing he'll give this candidate 'whatever they want,' was the claim he made about a scandal that surrounds this particular 2016 hopeful..."},{"comment_id":"10155984439405354","commenter_b":"She's gross and needs to go away. Now.","commenter_a":"She's making too much money telling bad jokes.","post_message":"Schumer did not mention that the shooting during her movie took place in a theater with a total gun ban–**100 percent gun control**."},{"comment_id":"10153676106271636","commenter_b":"Jaysus.. its 2016 and still people believe this is real... all the people in these prank videos are in on it... are we just going to ignore that? And for the record I have seen tons of videos of girls clipping guys' crotches with paperclips and pouring hot sauce over them in the name of prank .. these videos are cutely dubbed \"bf/gf pranks\" what the hell?","commenter_a":"What a F**CKING idiot...","post_message":"It's been branded misogynistic"},{"comment_id":"10153163380586336","commenter_b":"ANIMAL! wait is that Obama's son??","commenter_a":"Hang em on national TV.","post_message":"UPDATE: A third man has been charged with sexually assaulting a woman during spring break in Panama City Beach, Florida, that was captured on cellphone video, authorities said."},{"comment_id":"10153499292339714","commenter_b":"Since when are \"weak\" and \"helpless\" feminine traits?","commenter_a":"Worst thing to say to a boy according to my son is \"clean your room\". He wants to be called a \"man\" and he's 7 and proud of it. People need to get over this emotional craps. Boys will eventually be men. I think the worst thing you could say is \"woman up\".","post_message":"How do we socialize boys differently?"},{"comment_id":"10153945154891323","commenter_b":"Naser E. Kandjani many nations in Asia and Europe and Africa have million Muslims without conquests or wars and they were just spread by talking through Muslim merchants and travellers in these countries..you can read how Islam spread in east Africa and many Asian countries especially China Indonesia phillipines Malaysia ...all these countries have Muslims though no wars or conquests arrived there ...most Muslim nations today became Muslims without wars","commenter_a":"Anti-islam movements in Europe are treated as any political group and not called terrorist organizations ...What if there were anti Christian organization in any European country ..how will u react to it? Your double standards created extremisim in the whole world...","post_message":"'Islam has failed': Former EDL leader Tommy Robinson brings Pegida to the UK. Tommy Robinson stepped down as leader of the far right English Defence League in 2013. Alongside two former Ukip candidates, he is now setting up the UK arm of Pegida, the pan-European anti-Islam movement. Film-maker Simon Winkler joins Robinson as he prepares for Pegida’s first march in the UK."},{"comment_id":"10154341575671729","commenter_b":"Not a charge will be brought against this bitch","commenter_a":"How much worse does it have to get? Will a corrupt government be able to bury all the evidence? If Hillary survives the latest, democracy is finished.","post_message":"The hits just keep on coming..."}]
