[{"comment_id":"10153982122994071","commenter_b":"Stfu","commenter_a":"No, no they shouldn't ... this is a classic example of over extending and away from your core business. The ramp up time is too long and the others can fill the gap fast. They need to stick to immediate delivery systems.","post_message":"Amazon.com is coming for the grocery industry."},{"comment_id":"1681683485379770","commenter_b":"That should be a crime leave OUR money alone I'm sad to see this .don't we have rights what was this country built on!!!","commenter_a":"Why !!!!!! Muslims ????? Why !!!!! They need to remove there burkka and all the drag queen garb all the poof ta\"s wear !!!!!!!!","post_message":"\"In God We Trust\" To Be Removed From The Dollar Bill Leave the dollar alone. Are country was built on Christian beliefs. Do you think they should leave 'In God We Trust\" on the dollar bill?"},{"comment_id":"1835870700020882","commenter_b":"Woman belong in the streets, your right...","commenter_a":"Every single person that's out there marching there's 10 that wish they could have","post_message":"From CommonDreams: \"The second day of the Trump administration has seen an unprecedented wave of protests swell across the globe, as the Women's March on Washington and its sister marches on all continents—yes, including Antarctica—fight back against the U.S. president's frightening rhetoric.\""},{"comment_id":"758333967690514","commenter_b":"Pure, unadulterated ignorance. Lots of it going around. That guard shut them down","commenter_a":"Some people have no respect. So sad.","post_message":"These two men laughed at a military memorial. This guard shut them up without hesitation. Do you hate disrespectful people like that?"},{"comment_id":"1113705405389179","commenter_b":"Why do we have 400,000 permanently disabled Americans? Oh because of the 2,996 people killed and more than 6,000 injured during 9/11? So we lost more Americans in good health because war mongers like Hillary Clinton wanted to strike back? Thanks Hillary for your vote on the Iraq War.","commenter_a":"Thank you, Obama...we love you as a President!","post_message":"Excellent news for 400,000 Americans!"},{"comment_id":"718386484926627","commenter_b":"But as soon as they hit 18, they're prostitutes? Crazy how one second can change the definition... #ijs","commenter_a":"Please don't call under age girls child prostitutes. They are victims of being sold to sex traffickers, or kidnapped. They are victims, not prostitutes.","post_message":"It wasn't all fun and games on Super Sunday."},{"comment_id":"755708104563829","commenter_b":"And what happened when bush was president. This woman is going to do what's best for our country","commenter_a":"Didn't isis grow under her watch, and lybia burn. Nothing was accomplished while she was secretary of state.","post_message":"There's one candidate who's ready to be Commander-in-Chief on Day One."}]
