[{"comment_id":"10153064490042483","commenter_b":"Funny @username nowhere in your meme is there a picture of the woman you would force to become an incubator.","commenter_a":"Conservatives aren't pro life, they are just pro birth. They defund welfare and unemployment programs, don't support universal heathcare, want to deport \"anchor babies\" and so on. They need to stop pretending they care so much for unborn lives","post_message":"\"The federal government and several courts have made clear that a state cannot kick Planned Parenthood out of its Medicaid program simply because Planned Parenthood provides abortion,\" said Susan Watson, executive director of the ACLU of Alabama."},{"comment_id":"941252249248581","commenter_b":"Oh Bill, you handsome devil...lol, NOT!!!","commenter_a":"It couldn't happen to a more deserving bunch of lying propagandists Hell Bent on fomenting Hate, Racial War & Spewing Male Bovine Feces.","post_message":"Fox News has enlisted two of their biggest twits to play the victim card and accuse Dish Network of censorship as the battle between the two rages on for a fourth straight week."},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."},{"comment_id":"10153091643525496","commenter_b":"This woman is unreal and needs to get a life!!!","commenter_a":"Bet he won't be excited to see her any more! What kind of aunt does that! She should be ashamed!!","post_message":"The woman says her nephew, whose mother died last year, was so excited to see her arriving at his birthday party that he caused her to break her wrist: @webpagelink"},{"comment_id":"10157124735195354","commenter_b":"They've no one to blame but themselves.","commenter_a":"Go Trump","post_message":"“Conservatives love to throw conservatives out of conservatism; it’s like an ancestral tic,” Noonan says. “But great political movements should not be run like private clubs. And have the anathemitizers noticed they aren’t in charge anymore? That in the great antiestablishment disruption of 2016 they have been upended, too?”"},{"comment_id":"1054929361214588","commenter_b":"She* is a woman.","commenter_a":"Sorry Siri, but according to his DNA, he's still Bruce! A rose by any other name.....","post_message":"Siri knows Caitlyn's name and she's going to correct anyone who forgets."},{"comment_id":"10152854969571051","commenter_b":"Let behead these scumbags..What the F**k is wrong with people..Your parents should get their asses kicked","commenter_a":"Tell me where they live. I'll do the rest...","post_message":"These teens beheaded a puppy with a machete and posted the video to Snapchat. Then they picked up another puppy and did it again. And they didn’t stop there."}]
