[{"comment_id":"10153618680301336","commenter_b":"I don't agree with what happened to Mr Ramos but I emphatically want the illegals sent packing and our borders fortified!","commenter_a":"Moron","post_message":"ICYMI: Univision anchor Jorge Ramos told Megyn Kelly that Donald J. Trump's immigration plan is full of empty promises. What do you think? @webpagelink"},{"comment_id":"10154805040466037","commenter_b":"WTF!!!!! You're the hypocrite. Vote for Hillary a baby killer","commenter_a":"Dumb heartless trump, there are civilians....women and children in Mosul. They need to get out before attacking the place. Hmmmm there's something called \"war crime\" if u attack recklessly as ur suggesting innocent lives will be lost... It funny how u don't support necessary abortion to save a mother's life but ur happy to kill many innocent civilians... Trump = fool bigly","post_message":"“We gave them months of notice. U.S. is looking so dumb. VOTE TRUMP and WIN AGAIN!”"},{"comment_id":"1413133632042756","commenter_b":"I believe that the adult in this circumstances escalated the situation. Wrong to trample someone's lawn, wrong approach to correct the problem. Two wrongs do not make a right.","commenter_a":"That's not true Media saying wrong stuff The off duty officer was right When kids jump on him Then he fire to scare the kids He was waiting for on duty officers to arrived","post_message":"Horrifying new footage shows an off-duty cop shooting a gun at a group of teens in Anaheim, CA. It's going viral and sparking protests."},{"comment_id":"10156750651870551","commenter_b":"Any one who eats pizza with a folk should get out of the country .WHAT A DOUCHEBAG","commenter_a":"He's a loser! Go down the tubes! And another one bites the dust!","post_message":""},{"comment_id":"10153344764512235","commenter_b":"When racists attack children and/or make them cry, it makes me positively homicidal. I have HAD it with these people. What have they done for American society? Hell, what have they done for our SPECIES? Name ONE thing, America.","commenter_a":"The nurse needs to be fired!","post_message":"Wow. Just wow."},{"comment_id":"1313910325313867","commenter_b":"Some body give me one logical reason to have women in combat.","commenter_a":"There are some exceptional women who can and have performed well. However, truth in science shows overall. Men hold up better. Women break down faster. So many things women do better. Leave the grunt work to us grunts.","post_message":"When will \"the party of science\" accept the truths that science tells us?"},{"comment_id":"10153162222096051","commenter_b":"I think it should be done in private. What's a woman going to do just flop it out in front of everybody","commenter_a":"You can breast feed in public without your boobs hanging out.","post_message":"This woman was shopping at her local Target when she noticed that the store had left a special message to its customers."}]
