[{"comment_id":"10155018976064170","commenter_b":"The most classless woman and family I have ever seen. Good riddance.","commenter_a":"This is also fake news. There is no sign like that. Bye Herman.","post_message":"I'm sure Michelle will find some hope in that nice house they're about to move into."},{"comment_id":"10152943147236680","commenter_b":"Nowadays we have male, female and family bathrooms!!! If you can't hold it in look for a tree!!!","commenter_a":"There's a term called friendly fire...","post_message":"The senior member of the Senate Armed Services Committee opposes the plan announced last week by the Pentagon to allow transgender troops to serve in the military, saying “it wouldn’t work.”"},{"comment_id":"1041807992526339","commenter_b":"Bitch please!","commenter_a":"he was 14. he admitted it freely (nobody knew or said anything or asked him, he just did the right thing) and he was treated and has no reoffended. If it was your 14 year old son, better yet, shall I name all the 12, 13 and 14 year olds I went to school with that groped me??? Maybe one IS you kid","post_message":"One of Josh Duggar's relatives stepped up to the plate to defend the Right's favorite child molester by claiming that ANYONE would molest kids if there were no consequences and the right opportunity."},{"comment_id":"998045550284803","commenter_b":"i i think trump should have an abortion and have his you know w hat removed along with his tongue","commenter_a":"Is he going to waterboard women too?","post_message":"BREAKING:"},{"comment_id":"10153724163922452","commenter_b":"A black woman would have been acting up and resisting the officers. Did you SEE how the lady DID NOT act stupid? She OBEYED. It's really that simple.","commenter_a":"If this was an African American she would have been roughly handled, beaten b/4 forcefully taken into custody ..#basedonwhat #how #ihaveseenthemdoonTV# God please help us...Amen","post_message":"A woman led authorities on a chase through Los Angeles, Orange and San Diego counties that lasted more than two hours. @webpagelink"},{"comment_id":"1012583592144355","commenter_b":"and if we stay in toltel control","commenter_a":"More false propagander to try to get us to vote to stay in. The damage has already been done the EU Commission is an unelected, self sustaining, beaurocratic, and vastly overexpensive power crazed clique that will not change its self no matter what this person says. The only way to free ourselves of this shower is to vote to leave!","post_message":"Has the EU meddled too much in the daily lives of its citizens? @webpagelink"},{"comment_id":"1585875914805484","commenter_b":"Yer yer yer no one beleavs it","commenter_a":"Melissa Saucedo","post_message":"She claims Donald J. Trump 'groped her butt' because she 'looked like a younger Melania'"}]
