[{"comment_id":"10153084604971162","commenter_b":"Oh dear Lord I put this woman in your hands,we don't know her situation,we should not judge her..please Lord find her a place to lay her head protect her let her see the truth which is you..break her chains Lord,I saw in this article that she has a alcohol problem..break these chains Lord...I pray for all involved..in Jesus name amen","commenter_a":"That's sad!! Someone should get her some help like a shelter.","post_message":"WOMAN \"EVICTED\" FROM WALMART: A 45-year-old woman had been living inside Walmart for days before employees noticed her on the store's security cameras. VIDEO: @webpagelink"},{"comment_id":"10154419778931077","commenter_b":"I'm a female and even I like your thinking! Lol","commenter_a":"My god people would rather be trapped in the house with in laws all day!?! Got to have some place to go to get away! As long as some places are open then we can all go to the bar and strip club and still be able to make the wives believe we were at Walmart the whole time and couldn't buy anything because it was all sold out. :)","post_message":"Do you think stores should be closed on Thanksgiving?"},{"comment_id":"10154471007837577","commenter_b":"They'll come here get a bunch of \"free stuff\", infest our country, infect our people, then go back to where they came from on vacation with all of the money they \"illegally\" obtained. Vile Criminals........Build that WALL!","commenter_a":"Say no to drugs TB","post_message":"Illegals With Drug-Resistant TB Allowed Into US Schools - @webpagelink/ Large amount of illegals entering US with diseases is alarming"},{"comment_id":"496072593916654","commenter_b":"send them to the toilets they came from","commenter_a":"Unless the Muslims can \"Swear allegiance\" to America, practice / observe their faith, while respecting & protecting the rights of Non-Muslims...YES, DEPORT THEM!","post_message":"Chaos ensues after Norway starts deporting Muslims. Norway made a brave move, now the rest of the world needs to follow their example. Do You Support Muslim Deportation In The United States?"},{"comment_id":"10154499233438132","commenter_b":"All men have hoes.","commenter_a":"your universal super power What if I told you that you hold the universal super power of anticipating life-altering encounters with strangers... tapping into your unlimited abundance frequency predicting upcoming challenges and lucrative opportunities... and following through on your BIG goals without any hesitation or uncertainty How? You might be wondering... Because you have access to a secret weapon that most don know about: Numerology. You be amazed at the shockingly accurate and revealing information that can be deciphered from nothing more than your name and date of birth. @webpagelink","post_message":"John F. Kennedy's scandalous handwritten love letters have been revealed."},{"comment_id":"10153779416811509","commenter_b":"I pledge allegiance to the flag of the United States of America......not the flag that fought against it #patriot","commenter_a":"People need education on the history of the flag and the different types of confederate flags. The black confederate flag is the bad one.","post_message":"Mississippi's House Speaker says his \"state's flag has become a point of offense that needs to be removed.\" The Confederate flag appears in the top-left corner. @webpagelink"},{"comment_id":"10152902566136336","commenter_b":"Don't worry she will burn ....hell has a special place for people like her !","commenter_a":"Burn her too","post_message":"A New Jersey woman who authorities say put her newborn baby in the middle of a road and set the child on fire was charged with murder."}]
