[{"comment_id":"1190828210956634","commenter_b":"Ist: ENFORCE THE IMMIGRATION LAWS, forbidding businesses from hiring ILLEGALS & H1B workers; 2d: DEPORT THE FAKE MUSIM \"refugees\"; 3rd: BUILD THAT WALL!!! 4th: BEGIN DEPORTATION OF ALL ILLEGAL ALIENS! That's enough for the first day. Most of our problems can be solved just by ending ILLEGAL IMMIGRATION!","commenter_a":"RESIGN....","post_message":"GREATEST QUESTION: @webpagelink"},{"comment_id":"10154120407252908","commenter_b":"attaboy Davies pass the buck.","commenter_a":"I've been trying to figure out why someone would be a Republican and for the life of me I just can't find an answer.","post_message":""},{"comment_id":"10154335098801002","commenter_b":"Amy... are you serious?!?! IQ test?!? A lot of criminals have high IQ's when tested! It has NOTHING AT ALL TO DO WITH IQ! It has EVERYTHING to do with COMMONSENSE!!","commenter_a":"Why is she being charged it was completely the guns fault lol","post_message":"CHARGES: A woman who fired her gun at suspected shoplifters in a Home Depot parking lot has been charged."},{"comment_id":"1115714755184548","commenter_b":"@username DUMBF TRUMP BUILDING HIS OWN WALL BECAUSE MEXICAN PRESIDENT SENT HIS ASS PACKING.","commenter_a":"Smart women.. COUNTRY COMES FIRST. LET'S VOTE BLUE IN NOVEMBER. HILLARY NEXT PRESIDENT OF THE UNITED STATES OF AMERICA.","post_message":"This is just too good!"},{"comment_id":"10154373849503299","commenter_b":"Said all of us in January of 2009!","commenter_a":"Very good Mr. Claar!","post_message":"\"Had we understood just how clueless they were, the election result might not have been so shocking.\""},{"comment_id":"10158501274630389","commenter_b":"Put her back in prison or deport her.","commenter_a":"She has all the qualifications to head up the DNC or Planned Parenthood.","post_message":"Despicable."},{"comment_id":"10153152736641955","commenter_b":"Who was her IASO? Who was responsible for patching and maintenance? Who setup the firewalls and data encryption? Put this bitch in jail!!","commenter_a":"U can still, get it back.","post_message":"HILLARY 'WIPED HER SERVER CLEAN'"}]
