[{"comment_id":"10153543031078812","commenter_b":"If you are crossing borders illegally... You broke the law, entered our country without proper credentials and then I'm suppose to foot the bill? Hell no, if I have to follow the rules, then so should the ILLEGAL immigrants!!!","commenter_a":"In my opinion he offended not only #mexicans but all imigrantes that have to cross any border w/ USA. MY RESPECT to anyone that comes to the USA trying to have a better life.","post_message":"NEW: Univision dropping Miss USA pageant and cutting all business ties with Donald Trump over comments about Mexican immigrants: @webpagelink"},{"comment_id":"1144826232238207","commenter_b":"There are also many women that have \"potty mouths\" and that too is common knowledge.","commenter_a":"as a woman... I was a bartender for many years and you live in a bubble and you live in denial becasue 85% of men talk like that....BUT...it was all talk...unlike like Bill Clinton. who raped a woman! I believe all the outrage is coming from the liberals who never intended on voting Trump....What sane Republican would say they are now voting for OPEN BORDERS over Trumps 11 year old comment from a man to another man... it is like democrats have moral values all of a sudden! They were words not actions!!","post_message":"Trump's idea of pre-debate prep… BREAKING VIDEO: TRUMP Has Meeting With Women Who Say They Were RAPED, SEXUALLY ASSAULTED By Bill Clinton \"Mr Trump may have said some bad words, but Bill Clinton raped me\""},{"comment_id":"987873944592566","commenter_b":"She willl burn in Hell","commenter_a":"you have that right @username,I wonder if she ever thought how she got here on earth??","post_message":"Pro-abortion Congresswoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb. baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"1201604966547026","commenter_b":"Mortified to be in the vicinity of a penis? Why? You wouldn't be mortified surrounded by vaginas. Why is one suddenly more shocking than another? There's probably at least one lesbian I a crowded changing room and there's a good chance that the transgender woman prefers men. I understand being on guard I do. But not why a bit of dangling body parts suddenly makes that person mortifying to be seen by.","commenter_a":"Ok, I'm sure I will be shot down for this. Firstly, I don't think anyone likes communal changing areas, certainly not anyone I've ever met. I don't think the general issue with this is because you are transgender, although that puts a different slant on it. I don't think many people are happy getting their wobbly bits (of whatever kind!) out in front of strangers in a changing room. I'm sure you've experienced a lot of challenges in terms of getting where you are today and feeling comfortable in your body. I'm sure you have faced threats of and maybe actual physical violence. What I think you may need to bear in mind is that you don't know the 'journeys' of the other changing room users. Maybe they have experienced sexual violence. Maybe they have massive hang-ups about their body for whatever reason. Or whatever. Maybe they are religious. Maybe ...","post_message":"Four things I do to survive the gym locker room because I'm trans. - Parker Molloy"},{"comment_id":"10154741052673812","commenter_b":"Angela, your an idiot","commenter_a":"I love the comments so far. These folks probably have no idea that we have the largest prison population in the world filled with non violent offenders.","post_message":"NEW: Pres. Barack Obama grants commutation of sentences to 111 individuals. He's now commuted sentences for 673 people - more than the past 10 presidents combined. abcn.ws/2bPG0zc"},{"comment_id":"10153898128831509","commenter_b":"Stay home until your baby is weaned? Seriously stop! If you want to live some backwards, 1950s lifestyle, you go right ahead. While you're at it, why don't you just keep your opinions to yourself, since that's what a nice housewife would do, right? Give me a break. This misogynist refused to give her a break. There is also nothing to be modest about when it comes to breast feeding or pumping. Maybe you're the one who should work on modesty when you're over there over sexualizing a part of the female anatomy that is meant to help sustain life.","commenter_a":"She should have Left the room To Pump! Really Embarrassing for the female and males in a business Meeting! Have you no Modesty or even Selfrespect ! Stay home till your baby is weaned !!","post_message":"Donald J. Trump's attorney says Trump's language wasn't about her decision to pump breast milk, but solely on where she chose to do it: @webpagelink"},{"comment_id":"10154017510261336","commenter_b":"I NEVER SEE THIS KIND OF PLANNED HATE TO DONALD TRUMP OR DOCTOR CARSON AND NOT TO OBAMA OR SOCIALIST ILL SANDERS OR HYENA CLINTON... NOBODY IN CNN OR ISLAM PAY MEDIAS NEVER ASK DEMOCRATS... WHAT SOCIALIST COUNTRY IS DOING BETTER THE U.S.A. ....WE DON`T NEED SOCIALISM OR ISLAM LAWS ,,SOCIALISM LEECHES SUCK CAPITALISM LIKE CUBA FOR 65 YEARS SUCKING FLORIDA MONEY TO CUBAN GOVERNMENT AND PEOPLE ...WHAT A ZOMBIES IGNORANT DEMOCRATS ARE ....NOW EVERYBODY CAN SEE THE FUTURE IF TRUMP WIN THE WHITE HOUSE... BUT NOBODY CAN IMAGINE OR SUGGEST THE DESTRUCTION THAT MUSLIM LEADER OBAMA ALREADY DONE IT ..OBAMA`S ACTION ALWAYS BENEFITS HIS RACE ISLAM ,SOCIALISM ,BLACK CRIMINALS ,OUR MONEY SEND TO HELP ALL PLANET BUT NOT THE TAX PAYERS....OUR CONSTITUTION IS BY FAR THE BEST GIFT TO HUMANS FREEDOM ....AND CAN YOU BELIEVE ME I`M NOT GETTING PAY FOR DOING THIS I CALL THIS THE POWER OF ...","commenter_a":"And the lobbyists and special interest groups Bush, Trump 2016","post_message":"Jeb Bush said to defeat radical Islam, we \"shouldn't have the warfighters have their arms tied behind their backs.\" Do you agree? #GOPDebate"}]
