[{"comment_id":"1243601928984608","commenter_b":"Speak for yourself, Bertha. Don't pretend you speak for the majority of women because you sure as hell don't!","commenter_a":"Don't have the right to impose their beliefs on others.. huh? Well, then the religious right should stop right there...","post_message":"Ted Cruz’s tour de transphobia has embraced a new extreme position."},{"comment_id":"10154095809901094","commenter_b":"Only aliens would do what they are doing, along with stopping any alternative or sustainable agendas, fuel sources.","commenter_a":"Of course. Alien agenda. They are terraforming the planet for the tall greys. Chemtrails have the make up chemically for their perfect atmosphere. Pumping it into the earth with fracking etc. Polluting the oceans. Terraforming the planet. Goal is set for 2029. Decrease the human population to 500,000. Believe it or not this is the plan. The NWO/'Globalist' agenda IS the alien agenda. Total take over. Out of the shadows","post_message":"US Navy documents reveal plans to inject 20,000 tons of heavy metals, plastics and other highly toxic compounds over the next two decades into the oceans where it conducts its war games."},{"comment_id":"942143152490588","commenter_b":"where are the feminists.. i mean the ones born with a vagina ?","commenter_a":"I'd be curious as to how the feminists view this. A transgender winning against women. Interesting point about puberty made by Rousey.","post_message":"Let's be real, she makes a good point..."},{"comment_id":"1495140610505964","commenter_b":"Candace Richerson what about roger Ailes? He's a jerk. So what","commenter_a":"The truth hurts doesn't it!??!!! She is well armed with actual facts. Unlike the people who speak for Trump: the sexual haraser, the racist, the bully and the Ukraine employee - But you Trumpets go right ahead and support the guy who loves Putin. Every Hitler needs a Mussolini.","post_message":"Sen. Elizabeth Warren calls Donald J. Trump a \"small, insecure money-grubber\" during her first solo campaign appearance for Hillary Clinton. Read more: @webpagelink"},{"comment_id":"10155028895888010","commenter_b":"@username this isn't a Democracy. It's a Constitutional Republic. BIG difference.","commenter_a":"I think the LA Times is confused. There is a difference between an attack and a response to an attack. I'm not saying Trump never attacks people...I know he does. But several times now I've seen Trump's responses described as attacks (ie Meryl Streep).","post_message":"The president-elect was responding to criticism."},{"comment_id":"1015490965174099","commenter_b":"It takes a woman to clean up a big mess! I think she can do this!","commenter_a":"As usual, I am sure this is Not a accurate statement, as you have to factor in suicide and accidental shootings.","post_message":"Since the last #DemDebate, nearly 3,000 people have died from gun violence in the United States. It's time to act."},{"comment_id":"760226330784714","commenter_b":"The woman is an MD, right? She is by definition smart. So what happened?","commenter_a":"Welcome to the female version of Ben Carson... So. Damned. Stupid.","post_message":"It’s official now: Jill Stein—and the Green party if it agrees with her—is/are a waste of space. By Daily Kos user BoGardiner"}]
