[{"comment_id":"10153330405506130","commenter_b":"Exactly. Plus her job is simply to determine if a couple qualify for marriage under the law, not to marry them. She isn't advocating gay marriage by signing the licenses, her signature simply states they are lawfully allowed to wed. Her fucking religious views don't even apply to her job, the fucktard! She is simply trying to use religion to justify her bigoted attempt to judge others and not do her job. She is an employee of her state/county, and bound to the law. If she wants to have her religious views dictate her job she needs to be a clerk for a church. Then she can be a bigot all she wants.","commenter_a":"She is a public servant...to serve ALL the people...not just the ones she agrees with...there's a little thing called \"separation of church and state\"...","post_message":"\"We cannot be held hostage to the theatrics of religious extremists.\""},{"comment_id":"567332390082204","commenter_b":"The dumbest woman in America alive .","commenter_a":"What a goofy broad.","post_message":"What are they going to call it, Mount Dumb-Dumb? -Conover"},{"comment_id":"10153445067641051","commenter_b":"She is a selfish bitch with no sense of humor for leaving him.","commenter_a":"I don't blame her. What a shame that he had to get drunk! Now suffer whatever it takes to get rid of other!!!","post_message":"This wife took one look at the tattoo her husband decided to get and immediately kicked him out of the house."},{"comment_id":"10152858693731336","commenter_b":"And those countries don't have 30 million illegals and a lazy spoon feed group like we do either!","commenter_a":"No one had actually spoken to a Canadian. They have to wait in hallways for a room. They go to Mexico for medicine and dental. So how is it better. Trust me I have dealt with a lot of them who come to the US to get care. This information comes from the Canadians themselves because they purchase travelers insurance from various American Insurance Co so they can come here. If you have not lived in Canada don't talk about their healthcare you don't know about it.","post_message":"What could a Republican alternative to ObamaCare look like? “We could try freedom for a while,” Sen. Rand Paul said."},{"comment_id":"1730400360525702","commenter_b":"White people are gross","commenter_a":"God... trump is going to get us all killed.","post_message":"Hey, at least they're being honest about it. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"428518377308118","commenter_b":"Please don't breed.","commenter_a":"But what if I just want to pee in the girls bathroom? You mean my behavior and emotions don't drive the judicial system? #keepyourdick","post_message":"In 19 countries in Europe, transgender people are forced to undergo surgery and sterilization in order to legally change their gender."},{"comment_id":"1692723517682991","commenter_b":"One of you crazy ladies is from Texas.","commenter_a":"Realism is not what I see coming from most of HRC's supporters. There are some extremely hard to admit, and in fact, frightening facts that I think we have all tried to glaze over for years. In Bernie Sanders we have got a candidate that is addressing those facts. Climate Change is real, most democrats are no longer climate change deniers, but I feel like the real threats are being overlooked. For example, droughts are happening all over the United States. We are quickly depleting our fresh water aquifers. When one factors Fracking into this, we are willfully allowing our government to destroy more of our fresh water systems. HRC cannot denounce Fracking. Now, before you think that article that spells out how much HRC is taking in campaign contributions from the fossil fuel industry is another Republican smear tactic, note that it is by Greenpeace. She has to go. ...","post_message":"\"We can open the door to every person in this country again.\" —President Bill Clinton"}]
