[{"comment_id":"10153466611918635","commenter_b":"Amen","commenter_a":"Amen, aleluya","post_message":""},{"comment_id":"1087968054553877","commenter_b":"your e next president!","commenter_a":"Sic'em Bernie !","post_message":""},{"comment_id":"236889993435379","commenter_b":"What a lousy excuse of a woman! You do not speak for me!","commenter_a":"What the hell was that","post_message":"Holy mother of batsh*t!"},{"comment_id":"1210892618945831","commenter_b":"Ain't no clan rallies, ain't no alllivesmatter, ain't no trump rallies...none of that bullshit up here ya'll mother fuckers get fucked up up here talking that bullshit. If you ever in the big Apple look me up.","commenter_a":"Edited for narrow minded people who want to pick apart a comment as opposed to seeing the big picture: Why do things like this only get attention when the victim is attractive? When this same thing happens to anyone other than black people, it only gets attention when they are affluent or attractive. This SAME THING happens to white people MORE OFTEN than it does to black people and doesn't get the OVERALL attention it deserves. It's not even a black or white thing at this point. It's about what the main stream media will and will not cover. BLM is BULLSHIT and only service to segregating the people and preventing ALL OF US to come together to address these issues. If we cannot band together and fight the power they are the ones winning while we are killing each other. #knowyourenemy","post_message":"I am literally in tears. Full story: @webpagelink"},{"comment_id":"10153980272751943","commenter_b":"Why is she smirking???? Are they really that sure that they'll get away with their crimes??","commenter_a":"Hillary has such a ditz as chief of staff? She \"wishes\"? She \"never thought about it\"???? Totally lame-brain in her knowledge regarding working in such a sensitive area...... She plays dumb...","post_message":"Hillary Clinton chief of staff during her time as secretary of state, Cheryl Mills, said she simply never thought about the prospect that some of Clinton private e-mail exchanges wouldn be retained under federal records laws. \"I wish I had thought about that subset,\" Mills said in a deposition released Tuesday by the conservative government transparency group Judicial Watch. \"I wish I had thought about the fact that someone could be nongovernment and records might be not being captured. - via Bloomberg"},{"comment_id":"965394473500060","commenter_b":"That's what happens when unqualified people get put in jobs, for fear of hurting someone's feelings!!!!!","commenter_a":"THIS WAS PLANNED , THIS IS HOW NEGRO'S GET RICH !!! I HAVE SAID THIS MANY TIMES BEFORE !!! DUMMY'S","post_message":"A New York City firefighter who was allowed to graduate from the New York City Fire Department (FDNY) training academy despite failing physical fitness tests is now on medical leave after less than two weeks on the job."},{"comment_id":"1757186537848800","commenter_b":"BECAUSE SHE IS CROOKED","commenter_a":"Trump for president!","post_message":"\"When you look at the record, and when you look at what [Hillary Clinton's] actually done, when you look at Benghazi, when you look at all the instances over the last multiple decades… I think it fits.\" Donald Trump Jr. reacted to his father’s new nickname for the Democratic presidential candidate — \"Crooked Hillary.\""}]
