[{"comment_id":"1446844205342023","commenter_b":"She needs to STFU!!!","commenter_a":"Why publicly, tho? 😡","post_message":"This woman has some nerve...."},{"comment_id":"574645872704026","commenter_b":"@username so a woman that let Americans die that's the kind of person you think deserves to be president cause it's gonna be between the 2 think about that witch one is really worse","commenter_a":"Things will change when Trunp is president. The border police will have Trumps support. He'll also will support the Police & our brave service men & women. Vote Trump!","post_message":"Well that was easy..."},{"comment_id":"10153057265651051","commenter_b":"Freaking gross! Got what she deserved!","commenter_a":"Sick","post_message":"Some people say this principal deserves the death penalty after what she made a 2-year-old and 5-year-old do. Decide for yourselves if that’s true."},{"comment_id":"10154421194676545","commenter_b":"My tax dollars sometimes pay for things I don't necessarily agree with. It's called living in society. Grow up.","commenter_a":"Defund Planned Parenthood.","post_message":"She will be the keynote speaker at Planned Parenthood of Greater Texas' annual Fort Worth luncheon."},{"comment_id":"10154111404003132","commenter_b":"They have it bad because Americans won't allow sharia law be submit to cower to Islam . Imagine that we refuse to stupid as the EU had been . OMG we want Muslims to be tested exactly as any other religion here . The nerve of us to refuse to cower grovel to Illegal immigrants or Islam . Imagine that wanting all to assimilate to Our laws ways traditions under our flag only if it offends you LEAVE go to Saudis Iranians enjoy sharia laws","commenter_a":"I didn't read anything about her being molested or disrespected. Maybe she went to the wrong rally? And who the hell says that a muslim woman should be more respected than anyone else? I don't care that she came in peace. As long as she left in one piece. I am sick of these muslims acting that everyone hates them. Some of us are just tired of their fictitious victimizations. There are real people in this country that have been victimized. Lets focus on them, instead of some nut job that is staging a silent protest because she wants to be special.","post_message":"\"I was not afraid of these people, because I truly believe that the decent people would have stood up and not permitted that,\" she said."},{"comment_id":"10153731024366130","commenter_b":"Lmfao girl","commenter_a":"Camellia","post_message":"Contributor Laura A. Jacobs, on Caitlyn Jenner: \"Your visibility has gone from mildly annoying, to problematic, to atrocious, to outright detrimental, and so I ask you, politely: Stop trying to help though the media and public appearances. Please. Stop...\""},{"comment_id":"639520732905172","commenter_b":"Just the bitch she's always been","commenter_a":"Thank goodness she doesn't have her period any more at least now the women don't have to claim her gender what ever that is now. I agree with @username. I suppose when Buddy Borberly called her a bull dyke is a fair description.","post_message":"Rosie O’Donnell wants to go head to head with Trump by wiping this on peoples' faces. This is absolutely ridiculous. She should be ashamed of herself. Do you think Rosie O’Donnell needs to keep her nose out of politics?"}]
