[{"comment_id":"553460564841833","commenter_b":"Isn't Covergirl a brand? Wouldn't saying \"He can't do that\" because of the brand name be like saying girls can't play Gameboy because it has 'boy' in the name? Also, people are making a fuss about a guy appearing as the face of a woman's product, but I didn't see anyone making a fuss about almost naked women appearing on publicity for men's magazines, car's oil, burgers, beer, etc.","commenter_a":"He looks like a girl what are they thinking!!!!!!","post_message":"Oh....my."},{"comment_id":"1035379929888394","commenter_b":"@username actually if you check the poll aggregates you'll see that Hillary can best Trump.","commenter_a":"Can President Obama become her running mate for her Vice? Or Bill Clinton?","post_message":"The numbers don't lie, but Republicans definitely do."},{"comment_id":"1147558291982624","commenter_b":"@username like to talk shit behind a keyboard like a little bitch!","commenter_a":"White on white crime 👀","post_message":"Sick: 26 year old man gets caught trying to meet a 15 year old boy! #WSHH"},{"comment_id":"1085651791446290","commenter_b":"I say shut them down. There are many clinics for health reason, but NOT abortions! We need to STOP abortions (murder)!","commenter_a":"health screenings,fine..but why do our taxes have to pay for birthcontrol??Tell me again, I don't understand....","post_message":"Americans want funding for women's health."},{"comment_id":"1437658776254148","commenter_b":"Go home burn your drunk","commenter_a":"Think its time we start saving the tax payers money and get all these corrupt career politicians out of office! These hearing are a waste of money when the system is rigged for them when they pick people like Lynch! She was picked solely on how she could withstand what she went through! Trump is real change! America needs these corrupt politician gone!","post_message":"\"Together we have begun a political revolution to transform America and that revolution continues,\" Sanders said in his endorsement of Clinton."},{"comment_id":"1744224175810403","commenter_b":"Stupid girls lol","commenter_a":"Jeen Russel how dumbs lool 😂","post_message":""},{"comment_id":"703522563139507","commenter_b":"She's just jealous ,because she has NEVER looked this good in her whole life ,just saying !!!","commenter_a":"What country did rosie post that from...I bet she stares at that pic. all night...","post_message":"OUTRAGE...! Rosie posts naked photo of Melania when comparing her to other First Ladies. WARNING: Nudity"}]
