[{"comment_id":"10153618680301336","commenter_b":"I don't agree with what happened to Mr Ramos but I emphatically want the illegals sent packing and our borders fortified!","commenter_a":"Moron","post_message":"ICYMI: Univision anchor Jorge Ramos told Megyn Kelly that Donald J. Trump's immigration plan is full of empty promises. What do you think? @webpagelink"},{"comment_id":"10153678565299062","commenter_b":"*** Important","commenter_a":"Support tradition marriage","post_message":"SHOWDOWN: Officials and lawmakers continue to clash over same-sex marriage debate in Austin."},{"comment_id":"10153694586758132","commenter_b":"More than that! They would make her CEO due to affirmative action. Come on now!","commenter_a":"I wonder if a black woman decided to be white would she get a vanity fair interview? #whiteprivilege","post_message":"The latest from Rachel Dolezal."},{"comment_id":"988329747869113","commenter_b":"she should be arrested for making false statement, amd be fired from her job. This crab is getting old.","commenter_a":"She lied","post_message":"WOW this lady...shamelessly LIED about her entire encounter with the Police Officers..and here's the proof! What a fool."},{"comment_id":"1114612235259607","commenter_b":"So wait, now they don't WANT jobs? All this time they've been saying they want equal opportunity and a piece of the pie. Clearly, this group do sent want to work for it. They just want a free piece of pie. Give me a break! At least those inside the church get it. The Democrats have kept blacks down for decades and more but the fools outside just can't see beyond their hate.","commenter_a":"Democrats always wanted all black not to progress so they can pen them for their vote every election for a hand out then abandon them for 3 to 4 years.And the cycle goes on and on.","post_message":"DETROIT POLICE FORCED To Call Out BOMB SQUAD To Protect Trump From Hillary Supporters Offended By Speech About Bringing Jobs Back To Blacks…Faith I don't remember seeing a bomb squad when Hillary recently visited Detroit… @webpagelink"},{"comment_id":"10153178614619342","commenter_b":"This dude doesn't even capitalize TEXAS or GOD and y'all comment on this???Surely the fear of God sounds so Christian???? LOVE IS LOVE END OF STORY!!!","commenter_a":"texas is a god fearing state.we will not compromise on our faith","post_message":"JUST IN: Texas Attorney General Ken Paxton calls the Supreme Court decision giving same-sex couples the right to marry a \"lawless ruling\" and says state workers can cite their religious objections in denying marriage licenses. STORY --> @webpagelink"},{"comment_id":"10153435267083352","commenter_b":"Sick woman!","commenter_a":"Grr.","post_message":"Lady Sets Out to Murder Two Moms, Take Their Babies, Then Tell Her Former Man That the Kids Are Twins From Him Her Scheme Goes Horribly Wrong and One Baby Dies"}]
