[{"comment_id":"10156574233540725","commenter_b":"I say go to the debate the hell with Megyn Kelly .","commenter_a":"You can get along with Joe Scarborough, Nancy Pelosi, Harry Reid, and not Megyn Kelly.....?","post_message":"Should I do the #GOPdebate?"},{"comment_id":"1157609597663965","commenter_b":"Go Grab your mother's Pussy","commenter_a":"Dumb a$$ people - looking to start a war here on our home land - won't be happy until they do - hope they are truly ready for it - and hope they know what that will really mean.","post_message":"BREAKING: A massive protest of President-Elect Donald Trump is happening in downtown Chicago. It started outside the Trump Tower and is growing @webpagelink"},{"comment_id":"10156350810355354","commenter_b":"Deport these little bastards ASAP","commenter_a":"and the dems what these people in this country!","post_message":"Brace yourselves. Amnesty activists just launched a VIDEO that EVERY American should WATCH..."},{"comment_id":"776537535808625","commenter_b":"Bitter and jealous? Suck an A.","commenter_a":"you look like you eat porridge for breakfast from a silver spoon, bro","post_message":"The waiters had a little fun with me this AM. #nailsforbreakfast"},{"comment_id":"10153424886503598","commenter_b":"How do you plan a family without having a man involved. What they have encouraged is the prostituition of women both in devaluing young girls and women and when they become pregnant pretending to help. But their motive all along was to take a product that costs them nothing and process it( dissect and distribute) to the highest bidder.) to be used for unimaginable purposes. This philosophy is one of the most vile known to humankind. I know a woman who was told by her father when she was a teenager if you get pregnant you nor the child will be helped by me; she would be disowned. This man was a leader in his church but he had absolutely no Love from Christ in his heart. That is not Father God 'a kind of love. That is the kind of hard hearted ness that allowed these baby slaughterhouses to ...","commenter_a":"Amen","post_message":"After 27 Years of Killing Babies in Abortions, Abortion Clinic in Virginia Shuts Down for Good"},{"comment_id":"1137787319581255","commenter_b":"She is a disgrace!","commenter_a":"\"When Democrats win, America wins.\" 😂","post_message":"Everything about the Clintons is fake, including Hillary's faux-Southern accent—listen! #Hillary2016"},{"comment_id":"10153328261067093","commenter_b":"****Illegal immigrants.","commenter_a":"It's funny y'all keep talking about Democrats. I guess y'all are the same incompetent people that voted for Bush twice. Donald Trump has his head up his anus. He doesn't know the first thing about running a country. Let me guess he had y'all at Wall? He would build one to stop immigrants. All immigrants aren't bad they just want a better life. LeRhonda Flowers","post_message":"A resident of a tiny island in Canada is rolling out the welcome mat if Americans want to flee after Election Day.... @webpagelink"}]
