[{"comment_id":"1213366555426261","commenter_b":"More illegals equates to more democratic votes due to the dreams of entitlements and riches. Look at California (seems to start on the west coast), they are making it as easy as they can to give illegals the opportunity to vote...they even have a few illegals in city government! More democratic votes keep Dems in power, which means more taxes from the middle class which eventually places people closer to poverty...which places more government control over it's citizens...Hence the \"Democratic Agenda\". That \"Agenda\" puts us that much closer to the \"New World Order\"!!! Guess who would be the leaders of the \"New World Order\"?","commenter_a":"#TrumpOnTrumpingOn2016! BREAKING NEWS: \"Reince Priebus, Paul Ryan, Karl Rove, Stealing RNC Donation Money\"! ~ Hon. Roger Stone","post_message":"A country that for generations saw millions of its citizens cross into the U.S. is suddenly telling its southern neighbors they can no longer do the same."},{"comment_id":"10154419778931077","commenter_b":"I'm a female and even I like your thinking! Lol","commenter_a":"My god people would rather be trapped in the house with in laws all day!?! Got to have some place to go to get away! As long as some places are open then we can all go to the bar and strip club and still be able to make the wives believe we were at Walmart the whole time and couldn't buy anything because it was all sold out. :)","post_message":"Do you think stores should be closed on Thanksgiving?"},{"comment_id":"10153177506232885","commenter_b":"Scumbag whore.","commenter_a":"Unwhite Bastards.","post_message":"At a complete loss for words right now! This is absolutely disgusting and an abuse of the right to free speech!"},{"comment_id":"10153495840691051","commenter_b":"Then don't post it online and she should mind her own business.","commenter_a":"People should also mind their own business","post_message":"This woman says her child *isn't* too old to be breastfed. Decide for yourselves if that's true."},{"comment_id":"10154009145851336","commenter_b":"She needs to rot in hell","commenter_a":"Problem is she's been in the public eye for way too long!!!","post_message":"“She is a good, smart, tough person who cares deeply about this country, and she has been in the public eye for a long time and in a culture in which new is always better,\" President Barack Obama said about Hillary Clinton. Do you agree?"},{"comment_id":"645079822349263","commenter_b":"Get Him the Hell out of the White House!!!!!","commenter_a":"Yeah no! Maybe make some toilet paper with his face on it","post_message":"Obama is trying change our countries money. He has absolutely no right to even consider this change. Do you think Obama deserves to have his face on a dollar bill?"},{"comment_id":"1103187606428737","commenter_b":"More words of wisdom from the vastly intelligent mind of Pelosi, or liberals say the darndest things.","commenter_a":"idiot","post_message":"www.EagleRising.com"}]
