[{"comment_id":"10152921328085950","commenter_b":"Wow, Janet Fix, your comment just proves how uninformed you are. Or are you just trying to be obnoxious?","commenter_a":"lol If its Michelle Obama I'm asking for two fives.","post_message":"Move over, Alexander Hamilton... A woman is about to replace you on the $10 bill."},{"comment_id":"1756054801276415","commenter_b":"Though what border did the Muslims come ?","commenter_a":"Don't mess with Texas!","post_message":"BREAKING: Texas Lt. Governor Announces That Texas Has Finally Shut Down The Border. It's about time. With or without a wall, we will protect our country. Do you think we need to close our borders to Mexico?"},{"comment_id":"10153667196560090","commenter_b":"She should be in Jail period!!!","commenter_a":"No. Send her to Prison","post_message":"Keep Hillary Clinton out of the White House!"},{"comment_id":"10153648565856320","commenter_b":"Gather them up like cattle. Send them to Iran or where ever and let them find isis","commenter_a":"Just stop with the protests and move on. If they only knew how ridiculous they look continuing to honor a criminal.","post_message":" recent acts of violence will not be tolerated in a community that has worked so tirelessly over the last year to rebuild and become stronger. - St. Louis County Executive Steve Stenger State of Emergency issued in St. Louis County, Mo., as they prepare for a second night of protests in Ferguson. More Details: @webpagelink"},{"comment_id":"882098448492244","commenter_b":"I think this witch would sell her own Daughter for a ticket into the white House . How many Free rides will this traitor Promise to illegal criminals to get her to her socialist/communistic palace . ??????","commenter_a":"NO NO NO .DO NOT ELECT THIS PERSON.","post_message":"Hillary can't keep track of what she says!"},{"comment_id":"10154517046780329","commenter_b":"Not bad, but these sudden death quizzes are pretty f***ing unpopular. I would have hoped y'all would have gotten the point.","commenter_a":"Mike Snee","post_message":"There are 20 questions, but as soon as you get one wrong, you LOSE. (via BuzzFeed Quiz)"},{"comment_id":"10152876671446336","commenter_b":"Lol really woman. I think its sweet","commenter_a":"Davetra Fleary","post_message":"Twenty years ago, Brittney Husbyn and Briggs Fussy walked down the aisle as flower girl and ring bearer at a wedding. Saturday, they did it again… only this time as bride and groom."}]
