[{"comment_id":"533141560209757","commenter_b":"Brainwashed stupid women!!!!!!!","commenter_a":"Let them go back to the country they came from if they want to wear their Burkas","post_message":"This Muslim woman refused to remove her veil, then something awesome happened. Good. There's no room for fanatical Islamic culture in the US. Do you support a Burka ban?"},{"comment_id":"10155981845940354","commenter_b":"Trump is a media whore. Anyone dumb enough to support him might as well give your vote to Hillary because that is what you asshats are doing NOTHING in Trump's history suggests he is a real conservative. He is just repeating what we say and making republicans look like clowns. His close friend Oprah Winfrey, the person who did more to get Obama elected than anyone else and endorsed by Trump to be vp is ecstatic.","commenter_a":"Hes right pc has got to go. I heard him this morning, if cnn would have allowed him to finish his sentence, he was referring to nose mouth obviously. Typical, cut them off and use it for a soundbite.","post_message":"\"I’ve had lots of men imply that I was unfit for decision-making because maybe I was having my period…\""},{"comment_id":"127551884528757","commenter_b":"@username she was female","commenter_a":"She got what she asked for. Had she left room between her and the vehicle in front of her, she would have had adequate time to take evasive action to avoid the mattress and been able to maintain control of her vehicle. Both trucks were traveling at a reasonable and prudent speed. The ford was passim the semi safely. She grew impatient. Ford took evasive action, maintained control of his vehicle. She was tailgating and did not have time to take evasive action SAFELY. Over corrected and lost control of her vehicle. She is 100% at fault. There is no negligence on either driver. Her car is obviously totaled hopefully she carries collision coverage. She will also be paying for the damage to the semi. Hope she has enough liability. I am a claims adjuster. I explain this to people allllllllll day. She was impatient, and now she will have ...","post_message":"TAILGATING GONE WRONG: Watch as a car that was tailgating another vehicle on the I-10 ends up ramming into a semi-truck and flipping in the air. Luckily, the driver and her cat were not severely injured."},{"comment_id":"10153782445088984","commenter_b":"Interesting that this is the same city where the Muslims tried to impose Sharia law and got shut down by the mayor, a woman at that!","commenter_a":"This whole thing looks like it was aset up from the beginning, but too many people are jumping to conclusions before the facts are out ...","post_message":"The mayor of Irving, Texas -- the home of the Muslim \"bomb-clock\" boy -- just came forward with a shocking statement about the boy and his family. What she revealed shows exactly what's going on here. This was a setup from the first, and this mayor refuses to stay quiet about it. She needs our support."},{"comment_id":"1662312500687681","commenter_b":"She can leave now!","commenter_a":"Thats the best news I've heard all day. !","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"482616358589904","commenter_b":"You mean white again. Lol. Hillary 2016!","commenter_a":"I am voting for Donald J. Trump to make America great again #trump2016","post_message":"\"That's it, that's the end of America.\""},{"comment_id":"10153030925550927","commenter_b":"She'll starve.","commenter_a":"Go back to sex worker ... Your jokes are not funny ....","post_message":"Comedian Margaret Cho admits she was once a \"sex worker,\" says \"There's no shame in it. ...\" But she didn't stop there!"}]
