[{"comment_id":"10153068896931323","commenter_b":"Real Women Have Pulses.","commenter_a":"All this \"Men like curves\" stuff is crap. Most men will fuck anything with a pulse.","post_message":"\"There is no better way to celebrate and show off than by donning a bikini. When the #CurvesinBikinis ad in Sports Illustrated is released, the world will be watching and they’ll like what they see.\""},{"comment_id":"595073377334106","commenter_b":"In GOD WE TRUST","commenter_a":"Where do we get it","post_message":"July 30th marks the 60th Anniversary of “In God We Trust” being written into law as America’s national motto. Our Motto has been referenced by our Presidents, written on our money, and is in our National Anthem. Although some would like to erase God from the public square, we see this as an opportunity to proudly proclaim that “In God We Trust” is still the bedrock upon which our nation is built. On July 30th, let’s sweep the nation with our National Motto! Hundreds of Thousands of people have already join the One Million Window Campaign Get your sticker today and be a part of the Movement!"},{"comment_id":"10153391027640950","commenter_b":"THEY DONT WANT CONTROL FOLKS.","commenter_a":"CBS, you need to get control of that audience, they really are ruining the debate. I want to listen to the candidates, not to cheers and jeers","post_message":"Marco Rubio to Ted Cruz: I don’t know how you know what I said on Univision because you don’t speak Spanish. Immediately, Cruz responds…in Spanish @webpagelink"},{"comment_id":"1039031896153505","commenter_b":"How many immigrants do you personally know? I'm guessing none","commenter_a":"Every one of you idiots came from immigrants","post_message":"The immigrant population in the U.S. is more than 4 TIMES what it was in 1970."},{"comment_id":"1142990589094021","commenter_b":"ugly women","commenter_a":"what are you animals?.....in britian?......wth!","post_message":"'Still not asking for it'"},{"comment_id":"10153931678551523","commenter_b":"You can't fix stupid! This bitch is flat out ignorant","commenter_a":"She's the same sister that said to take all the violence to the suburbs, but yet she condemns it. Lmao Yeah, condemns it when it's in her part of town, but to hell with the rest of the city and surrounding areas.","post_message":"One-on-one with the sister of Sylville Smith. She spoke exclusively with FOX6's A.J. Bayatpour on Monday. @webpagelink"},{"comment_id":"10154590275170586","commenter_b":"Which wife is she again?","commenter_a":"It takes a real woman to critize Melanie Trump. She is elligant. She will make a better First Lady than Bill Clinton will make. She hasn't hurt anyone. How can you even mention her name.","post_message":"Lady Gaga has joined the chorus of those criticizing Melania Trump days after the would-be first lady gave a speech decrying bullying online."}]
