[{"comment_id":"1257260354293992","commenter_b":"You are illegal go away","commenter_a":"Oh yeah more guns to START shooting over the least thing or person ASSumed to be Muslim....................","post_message":"\"If more good people had concealed carry permits then we could end those Muslims before they walked in killing,\" Jerry Falwell Jr. said Friday."},{"comment_id":"666105456853575","commenter_b":"This wench should go back to hell .... <3","commenter_a":"She sounds poorly educated. Does she know what a bigot Sharia Law is on women and gays??","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"1167192579994034","commenter_b":"Hi joannie.","commenter_a":"Yet John Calvin believed and taught that murdering a baby in the womb was an act of the god that he worshiped. That god is the cause of everything including sin.","post_message":"Amen!"},{"comment_id":"10153656233196756","commenter_b":"Kerry Hayes Bryan Hayes James Cadillac Cardarelli told ya","commenter_a":"What?!... Well, I like \"Las Mananitas\" better anyway","post_message":"Ever wonder why you so rarely hear \"Happy Birthday to You\" on TV or the big screen? Turns out that, while it may be one of the most recognized songs in the English language, its copyright is also owned by a music publisher. So, if you're going to sing those famous strains on screen, you'd better be prepared to fork over some cash."},{"comment_id":"10154406577771051","commenter_b":"Ray >Melania isn't even from the US can't speak English an is a HOE!!!!!","commenter_a":"There is nothing wrong with her dress.","post_message":"This photo of Melania Trump sparked serious backlash after people noticed one thing about her dress."},{"comment_id":"10153513194301157","commenter_b":"Sorry kill traders Isis is out to kill innocent people that trader should lie down 6 feet under","commenter_a":"13 year veteran, can't trust anyone anymore!","post_message":"A Washington D.C. Metro Transit Police officer has been charged for trying to provide material support to ISIS."},{"comment_id":"767530393325420","commenter_b":"If employers are fined and punished who hire illegals and no welfare benefits were given to illegals, they'd have no incentive to be in the US and they go home..","commenter_a":"Senate Democrats need to stop being obstructionists!!! Keep up the good work Congressman.","post_message":"If Senate Democrats aren't happy with the House-passed #DHS funding bill, then they should allow debate & amendments-- that is how our government is supposed to work. I fear that Senate Democrats are playing politics with America's national security in an effort to protect the President's unconstitutional #executiveaction and to protect themselves from having to go on the record with their pro-#amnesty positions. #DontShutDownOurSecurity"}]
