[{"comment_id":"10153348176116336","commenter_b":"I agree, some women go buy the biggest bag purse in addition to the over stuffed carry on.","commenter_a":"What they need to do is ENFORCE their rules now! I've seen people get on with HUGE carry ons! Just saying!!","post_message":"Will you buy new luggage if the world's airlines change their carry-on requirements? (via Fox Business)"},{"comment_id":"10153768028339614","commenter_b":"Lol Olivia you sound butthurt or does truth hurt as Ben Carson state all black lives matter not just criminals","commenter_a":"Where's the black lives matter people at? Or is only white on black that matters","post_message":"An anti-violence advocate is now paralyzed after being shot in the back during an attempted robbery, and the teenager arrested was supposed to attend one of his speeches on reducing juvenile crime rates. The Cal Poly Pomona student turned his life around after a criminal history beginning at the age of 12 and facing abuse in foster care. But while in Georgia to share his message of peace, Semaj Clark was shot. won be able to walk anymore, and that hurts me, but it not going to stop be from doing what I got to do, he said tearfully from his hospital bed in Georgia, where he continues to recover. Watch KTLA video here: @webpagelink"},{"comment_id":"867088560054064","commenter_b":"A SMART WOMAN....not that stupid one!","commenter_a":"Ann Coulter","post_message":"There’s a growing movement to have a female hero replace Andrew Jackson on the $20 bill."},{"comment_id":"950976811609844","commenter_b":"Yes!!! Although these women should be considered normal size and healthy... Definitely not 'plus size'... Sick of all the labelling... How 'bout healthy, happy and active?!","commenter_a":"I don't care what anyone else thinks. I think she looks great. But I think the more important question is \"How does her personality, intelligence, etc. compare with her looks?\"","post_message":"So excited for The Official Ashley Graham Fan Page, the first \"plus-size\" model to have an ad in Sports Illustrated! AND for Robyn Lawley, who's the first \"plus-size\" Swimsuit Issue model! Here's why that's so exciting."},{"comment_id":"915633041826559","commenter_b":"Nah she just pays for herself. Greedy money grabbing witch.","commenter_a":"And so............she pays her female staff less thrn her male staff. GOOD job hillary","post_message":"Equal pay isn't a women’s issue. It's a family issue. It's an American economic issue."},{"comment_id":"10153468718801130","commenter_b":"Classy women.","commenter_a":"Gorgeous young women!","post_message":"\"They're not trying to look older than they are.\""},{"comment_id":"867487780024323","commenter_b":". #TooChickenToDebate #ChickenTrump #ChickenShitTrump #ChickenHillary #ChickenShitHillary","commenter_a":"God bless you for being you Hillary.","post_message":"\"I have fought for the rights of women and girls here at home and around the world. It really maters whether women are treated with respect and equality, because when we do that, we are all better off, our economy is better off, our democracy is better off.\" —Hillary"}]
