[{"comment_id":"10153784446624203","commenter_b":"@username-She answers questions, she just doesn't give you, narrative you want hear-why should she. It amazes me, the vagina remark! Must be nice to have 240 years of men. Too bad it's not you electing, the first male President. Try reversing that and how would that feel? Oh and a lot our Male Presidents, haven't been real Winners. CONgress mostly MALE-mostly FAIL!","commenter_a":"Clinton is dead in the water. Mass media is bought and paid for. Sanders for President!","post_message":"\"Hillary Clinton may have trounced the men at Tuesday debate, but 2016 isn likely to be the year we get our first woman commander in chief.\""},{"comment_id":"10155711262144657","commenter_b":"Yep!","commenter_a":"He already does......see Trumpsters have always had a direction to Trump.....we do not CNN Clinton news nerwork or any other left stream bias pieces of crap. This way we get the info before lamestream media manipulates it.","post_message":"Calm down, everyone."},{"comment_id":"10153078064342994","commenter_b":"we're on that list so maybe. I NEED TO FLUSH SOME ICE","commenter_a":"Alexis Nichole Fortune hoping we close. 😩","post_message":"Our site has the complete list of school closings. Stay warm out there!"},{"comment_id":"1175985589130223","commenter_b":"Eww she be ugly scary","commenter_a":"why is this infidel a councilwoman in the first place???","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"1149314588454636","commenter_b":"Ban them from the U.S.","commenter_a":"No","post_message":"The saga continues..."},{"comment_id":"714918215322687","commenter_b":"BUILD THE WALL","commenter_a":"Trump/Pence 2016... Enough of corrupt establishment politicians.","post_message":"Live: Donald J. Trump holds a rally in Manchester, New Hampshire."},{"comment_id":"671041439725180","commenter_b":"Cause she's crooked","commenter_a":"Come on North Carolina !!!!! Don't let us down!!!","post_message":"Live Now: Donald J. Trump speaks at a rally in Concord, NC."}]
