[{"comment_id":"10153322465354575","commenter_b":"That's no lady.","commenter_a":"F that lady","post_message":"A veterinarian posted this picture on Facebook with the caption: \"My first bow kill, lol. The only good feral tomcat is one with an arrow through it's head! Vet of the year award ... Gladly accepted.\" The cat was a family pet named Tiger, and now she could face charges."},{"comment_id":"10156899433320354","commenter_b":"If you're a f****** illegal mexican, get the hell out!","commenter_a":"Illegal immigrants built part of this country cause people like Trumpet hired them! All of a sudden they're bad? Screw you all! Im proud to be a fucking Mexican!","post_message":"“[O]ne party has made it okay to say you can hate people, you can spit on them.” What would you like to tell Julieta Garibay? WATCH:"},{"comment_id":"555063404660130","commenter_b":"That is right stop and look at what separation of State and church really is it was there to protect the church.","commenter_a":"@username is the ideal photocopy/ carbon copy of the fore fathers vision for America dream as a POTUS!!! BenCarsonWin!! GodWin!!! The Operation Heal!!! Inspire!!! Revive!!! The revival had begun, don't be left behind!!! Onward ever, backward never!!!","post_message":"You, Lord, keep my lamp burning; my God turns my darkness into light. (Psalm 18:28) We must not close our eyes when evil presents itself, for we allow darkness to abound -- it is only with open eyes that we can see His truth and calming presence. Revealed in the midst of chaos, He stands beside us as we stand with each other. With Him, together, we will be made stronger. -Ben"},{"comment_id":"1259466750760461","commenter_b":"@username=republitard shitbag","commenter_a":"Really? Last I checked, this is still Obama's America...... Next year you can call it Trump's but for now it's ALL Obama......","post_message":"Welcome to Donald Trump’s America."},{"comment_id":"10153533859861615","commenter_b":"Get that creep off the streets, love that area. People are so sick.","commenter_a":"Diane Fickley Pesci","post_message":"“(He) blocked her so she couldn’t go any further that way and says, ‘Hey, want to have a good time?’” NOW ON CHANNEL 11 MORNING NEWS: A man is being questioned in connection with an attempted luring of a teenage girl -- in the parking lot of South Hills Village Mall. Hear what she and her mom did to help police track him down."},{"comment_id":"10154152289921957","commenter_b":"The woman is brainwashed!","commenter_a":"Why are these Muslims out of their country, If they're not happy with our system & law if they all go back where sharia law Is permitted everyone will be happy. Just go back and let the world be happy ,the rest of the world doesn't want sharia law. Don't go to other countries & try to convert to your beliefs, we are not interested at all, go back to your world. .","post_message":"The Women's March organizer thinks Trump is going to be oppressive to women and minorities.... as she fearlessly defends Sharia Law."},{"comment_id":"995140990545649","commenter_b":"terrible how must the parents feel xxx","commenter_a":"SICK!!!!!!!","post_message":"She drives off with the baby's pram still wedged in her bumper"}]
