[{"comment_id":"10153620969383352","commenter_b":"Girl people have no life!!!","commenter_a":"He's having a separate party for her idiots!!!","post_message":"CHRIS BROWN SKIPS ROYALTY'S FIRST BIRTHDAY PARTY TO BE IN MIAMI. SOURCE SAYS HE DIDN'T GET HER A GIFT OR HELP PAY FOR CHUCK E. CHEESE EITHER!"},{"comment_id":"10156750651870551","commenter_b":"Any one who eats pizza with a folk should get out of the country .WHAT A DOUCHEBAG","commenter_a":"He's a loser! Go down the tubes! And another one bites the dust!","post_message":""},{"comment_id":"1747485088840690","commenter_b":"On god all these bitches do is tattoo they brows and date niggas who still rock dickies and cortez I live an hour away from Clovis","commenter_a":"Man pussy can't be that scarce in NM","post_message":"WTH: New Mexico mother and son face jail time for incest! #NewMexico #Incest"},{"comment_id":"611652445656331","commenter_b":"USE'N The Words \"Protect & Serve\" Is An Excape For Majority Of Ths Police Officers Who Shoot & Kill Inoscent' Civilians ... SMH* It Is A Shame ...Need To Weed -Out The B.A.D. - POLICE OFFICERS Sister Asiyah Hensley Ka'Bah Brother Abdul Azim Ka'Bah","commenter_a":"Thank you for standing up and stating the truth","post_message":"\"These shooters aren't my brothers in blue, they're murderers.\" - Rep. Andre Carson, a former law enforcement officer, joined other members of the Congressional Black Caucus to condemn the recent police shootings of Alton Sterling and Philando Castile Read more: @webpagelink"},{"comment_id":"10153619643270329","commenter_b":"Jordan Selph","commenter_a":"Jackie Hollander","post_message":"Bastille Day, As Told By Sloths"},{"comment_id":"1776736589270843","commenter_b":"People don't care it shows what our country has become. Hillary will get plenty of votes","commenter_a":"Charged with 24 counts of fraud and still got 39% of vote. Unbelievable","post_message":"So long, farewell..."},{"comment_id":"968043416588740","commenter_b":"I don't think the majority of people in England would believe any of this rubbish any more than you or I","commenter_a":"The danger of this kind of journalism is the Anti Scottish fervour that it builds up in England. English nationalism is not the civic nationalism that we are trying to achieve in Scotland. The feathers of the establishment have been rattled by,first the referendum, and then the GE. The audacity as the Mail sees it is for Scotland to be ungrateful subsidy junkies who have sent 56 SNP MPs to Westminster to represent their constituents. To carry on this vilification that Cameron promoted during the GE campaign, only months after love bombing Scotland, is to let a Genie out of a bottle that won't go back in. The union could and should end in an agreement between too friendly nations who share an island by the voting power of the people of Scotland, and not by this ever increasing acrimony fostered by the English press. It's a dangerous and unprincipled ...","post_message":"Did the Scottish National Party (SNP) hound Charles Kennedy to his death?"}]
