[{"comment_id":"1330647500288610","commenter_b":"Killers should be punished .","commenter_a":"evil","post_message":"The U.S. Fish and Wildlife Service said Thursday that necropsies had ruled out diseases as a cause of the eagles' deaths."},{"comment_id":"415787422087411","commenter_b":"Many more American waiting for jobs now, so if your illegal, then bye, bye. If your immigrants better get back to work, that is what you came to America for.","commenter_a":"Carol Johnson","post_message":"#DayWithoutImmigrants: Immigrants across the country are expected to stay home from school and work today to show how critical they are to the U.S. economy and way of life."},{"comment_id":"10153129788220667","commenter_b":"No one cares that he lived and no one would care if he died","commenter_a":"Really?? Who cares?!?!??!!!","post_message":"He is in significantly better shape than when he was rushed to a Las Vegas medical facility after a three-day binge at a Nevada brothel."},{"comment_id":"707988442725067","commenter_b":"Then they need to leave this country.","commenter_a":"This really makes me angry....","post_message":"The court has just ruled against the American flag. This is un-American. We stand for the flag forever and always. Can we get 30,000 'LIKES' for the American flag?"},{"comment_id":"1152081494853966","commenter_b":"Well if men are allowed to use ladies rooms why didn't he just go in and guard her stall there. Maybe he didn't feel like a mommie that day.","commenter_a":"I don't shop at target, so...no big deal","post_message":"WOW! Father Guards the Door While Daughter Uses Target Restroom..Then This Happens. (VIDEO)"},{"comment_id":"934685129905679","commenter_b":"I am a feminist and proud of it.","commenter_a":"This is feminism.","post_message":"Ellen Page has a point here, ya know... Thanks for the photo, MTV Act!"},{"comment_id":"1585670881742175","commenter_b":"DRAIN THE SWAMP","commenter_a":"END THE CORRUPTION!","post_message":"WATCH LIVE: Donald Trump campaigns in Golden, Colorado before he comes to Phoenix."}]
