[{"comment_id":"968475119944707","commenter_b":"Man this website is So So So Biased, how can you take a political stance all day long to put down trump(4 to 5 articles a day) trump is this, trump is that, can we even call you a news website anymore??? How much money did the hill team fill your coffers with??? Do you not care about the world?? It's bleeding out in the middleeast :( you completely put out the best prospective candidates bernie, Jill, Gary. You leave trump cuz he doesn't say too many intelligent things but he is more human than any of the Warhawks that's been running the murica for a decade now!!!! Please people we need to spread the truth and love not put people down and dish out hate all day!!! Here's my finger to you Huffington","commenter_a":"put a toothbrush moustache on hillary and then it would be appropriate to yell 'heil hillary!' What is going on in 2016, appears to match severial elements to the 1934 German presidental election. For example: 2016 Democrate liberials ruthlessly beating up on Republican voters. Local Police (Fresno Ca) allowing violence as a policital objective at a Trump event. Propaganda; political acuity against conservative thought and the deceptiveness of 90% the media to sway voters towards hillary. Can anyone define all the promises from this great fuhrer hillary to buy their votes? HEIL HILLARY! Even the Universities and High Schools are exercising power over speech they disagree with. This is a time of struggle 'Kampfjahre.'","post_message":"They really got riled up about his birther-announcement fiasco."},{"comment_id":"608701745929674","commenter_b":"@username-I usually stay out of this topic area since it isn't making a huge impact on my life. However, science has shown that when populations of a certain group go up too high, homosexual bonds do come to play. For instance in Africa way back when, sometimes today, if the village had to many mouths to feed, the men would start mounting each other to prevent population growth. In animals, like dogs or cats, you have some that put off the opposite animals pheromones. For instance we use to have 2 female&spayed cats? The one kept dry humping the other.","commenter_a":"Considering most people don't get a sexual attraction until they hit puberty, how would they even know which students are homosexual unless the students are just acting out because of what they've seen their parents do...","post_message":"Pre-K? REALLY?!"},{"comment_id":"1149041588518531","commenter_b":"I'm a nasty woman too. FUCK DEPLORABLE INC.","commenter_a":"I guess I'm just a nasty woman!!!","post_message":"I don't think this is what Donald Trump expected to happen."},{"comment_id":"1043808669085644","commenter_b":"Thankfully she kept her mouth shut and performed and the liberals are pissed? She's a liberal! It amazes me how they are quick to crucify her for making the decision to simply perform, keep some class during the halftime show unlike that ghetto trash bitch Beyonce","commenter_a":"The Hamilton cast members rocked just as hard as Gaga, and I loved their amendment.","post_message":"This is just sad..."},{"comment_id":"10155934597900354","commenter_b":"And that is why this RINO will loose ..solution enforce ..the ..laws on the books now . Punish companies for violating the law ..make the fine so harsh they will not even think it ..with no jobs the illegals will self deport ...problem solved .in 3 months here is the 3 rd grade math ..20 million illegals ..10 million Americans out of work a high percentage of them are black .just think if 20 millions jobs opened up in the next 3 months ..what would that do for the black community ..IT WOULD HELP SOLVE A LOT OF PROBLEMS .","commenter_a":"Sneaking into a country illegally is NOT an American value either.","post_message":"Okay Jeb"},{"comment_id":"1735235890068335","commenter_b":"Liberals are the TRUE racists......","commenter_a":"The Democratic Party should be so proud of their supporters. Trashing Police Cars, yep, you Democrats are awesome !!! And you wonder why Trump is doing so well, Idiots..","post_message":"WATCH the chaos that erupted in Southern California outside a Donald J. Trump rally where at least 20 people were arrested. @webpagelink"},{"comment_id":"469071613283419","commenter_b":"she b a back stabber","commenter_a":"She fits in with Sharpton an Jackson","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"}]
