[{"comment_id":"10155037576899268","commenter_b":"So, all wives are prostitutes?","commenter_a":"When you obviously marry a man for his money, what else would you call it. If you sell your soul to the devil, you're a prostitute. After all, no one would want this orange Cheeto if it wasn't for his money.","post_message":"Melania Trump doesn't deserve to be slut-shamed."},{"comment_id":"10154092058261636","commenter_b":"Did you have to turn on you \"English APP\" to type that?","commenter_a":"Gross! And Then he said: \" I will be dating her in ten years\". His own words","post_message":"She was having none of it"},{"comment_id":"592897514209538","commenter_b":"That'll get a lot of these men shot in the ladies room !!! Hey ladies , keep shooting till you're sure they're dead","commenter_a":"A bunch of idiots!","post_message":"A bill to repeal a rule allowing transgender individuals in Washington state to use public bathrooms based on their gender identity has cleared a state Senate committee."},{"comment_id":"10153627829156336","commenter_b":"Who really cares about the name?!!!! Native Americans care about protecting Mother Earth!!!! Get rid of the Pipeline!!","commenter_a":"How about leaving the mountains name alone and concentrate on more important priorities.","post_message":"President Barack Obama is restoring the name of the tallest North American mountain peak – Mt. McKinley in Alaska – to the native Alaskan name of “Denali,” the White House said today. @webpagelink"},{"comment_id":"10156215776400354","commenter_b":"The grisly death of a human life, which is abortion, has a dedicated, zealous following who treats the death rite in a religious manner. Clearly, there's more at work here then just the convenience of sloppy people. Imagine an America with 19 million more black people, virtually all of which would vote Democrat. Things would be much different. The 55 million human lives lost since '73 would make for a vastly different nation. Democrats commit crimes against humanity in many different ways, and clearly abortion is the most depraved and reprobate of them all.","commenter_a":"They need to harvest her vagina","post_message":"“Planned Parenthood is proud of its limited role in supporting fetal tissue research.”"},{"comment_id":"671041439725180","commenter_b":"Cause she's crooked","commenter_a":"Come on North Carolina !!!!! Don't let us down!!!","post_message":"Live Now: Donald J. Trump speaks at a rally in Concord, NC."},{"comment_id":"1056318254456150","commenter_b":"It's not an illusion. It's fact. Nothing like this has happened in 38 yr. Life comes with no guarantees. Accidents happen!","commenter_a":"Yeah, but I'm sorry . . . Disney has created this illusion of fantasy and safety. The illusion that one can experience fear and threat in a safe environment. In fact, they have made millions (billions) of dollars designed on that premise!","post_message":"\"This is Florida, and it's not uncommon for alligators to be in bodies of water.\""}]
