[{"comment_id":"10153724479619614","commenter_b":"i hope that women go to jail for murder","commenter_a":"This person is not even human. She is garbage","post_message":"A New York woman who once worked for child protective services is accused of throwing her newborn daughter to her death from a seventh-floor window. Officials say the baby, her umbilical cord still attached, was alive when she was tossed from the building. Jennifer Berry, 33, was charged Tuesday with second-degree murder and manslaughter. The medical examiner says the little girl died from multiple blunt-force injuries consistent with a fall. Read KTLA's story here: @webpagelink"},{"comment_id":"964810136945374","commenter_b":"Woman is nuts , how did she get the job in the first place?","commenter_a":"I don't think she wants fame. She's taking a stand for what she believes in. Just like everyone else is standing up for what they believe in. Only one that's making her famous is the ones giving her attention. #DRAMASEEKERS","post_message":"Kim Davis's latest attention-grab has blown up in her face."},{"comment_id":"1736088283296773","commenter_b":"And women!","commenter_a":"Shout out to CFD and their brave men and women that r serving","post_message":"BREAKING: A massive fire is burning in Chicago's Lake View Neighborhood. At least 3 buildings are engulfed in flames. A BIG shout out to the CFD for their incredible work."},{"comment_id":"10153434124594032","commenter_b":"@username illegals aren't just Mexican stop being ignorant.","commenter_a":"I'm on the fence about this, the immigrants being lazy living off the state should be taken back. BUT the hard workers doing what they can taking care of their families should not be bothered!!!","post_message":"#BREAKING: The deportation operation by U.S. Immigration and Customs Enforcement would begin as soon as next month, the report said. UPDATE: DHS plan to raid Central American immigrants draws criticism. Details: @webpagelink"},{"comment_id":"952967998077006","commenter_b":"Ahhhh...NOOOOOOO! AMERICA WILL NEVER!","commenter_a":"I'm paying less thanks obamacare!","post_message":"Republicans won't ever admit the success of Obamacare. As with all of the Presidents winning policies, they prefer to ignore facts and spread lies."},{"comment_id":"10153575076007411","commenter_b":"He was probably lured in by a crazy lady offering him pizza","commenter_a":"Susie Gollehon","post_message":"UPDATE: The boy has been found safe Police in Glen Ellyn are searching for a missing 12-year-old boy who was last seen riding his bike Monday. Story: @webpagelink"},{"comment_id":"10153465175281162","commenter_b":"Unbelievable the number of ignorant do gooders on here. If you never handled pigs how can you say what is the best way to do it? if ya pick up a pig like a puppy it will struggle and squeal and put up a fight. but if ya hold it by a hind led it will settle down and let you handle it. The trucks they are on have multiple floors so yes you can get a lot of pigs on there, if they were less densely packed there would have been more mortality. and yes air can circulate. All you planet saver that think vegans are going to save the world, How much fossil fuel, fertilizer, herbicides, pesticides, and other pollutants, are produced in the growing and harvesting of what you eat.","commenter_a":"Jamie Hall","post_message":"A semitrailer carrying 2,200 piglets overturned on a highway. Watch as emergency crews rushed to wrangle the pigs -- > @webpagelink"}]
