[{"comment_id":"10153237839494203","commenter_b":"Marxist Feminists are ugly and nasty.","commenter_a":"Would you describe a man as \"testy\", Daily Beast? Thought not.","post_message":" can spin her way out of this. She can explain her way out of this."},{"comment_id":"510102432525283","commenter_b":"What a dumbass!","commenter_a":"Well duh!!! I thought everyone knew the all you can eat means is all YOU, just you, only you, your stomach, can hold, I didn't realize that there were ppl stupid enough to think they could go into a restaurant and get the all you can eat whatever and feed 5 or 6 of your friends on YOUR all YOU can eat ....are ppl really out there that are that stupid ? If so for the love of God spay and neuter them so as to prevent them from bringing more ridiculously stupid ignorant ppl into this world","post_message":"The Denny's workers here repeatedly tried to explain the rules about all-you-can-eat-pancakes to this lady - and that's when she completely snapped."},{"comment_id":"10152658419777894","commenter_b":"Girl Bye!! Bitch Please!! #DelusionalWhore","commenter_a":"Get her life....","post_message":"Say What Now? Joseline Hernandez Says She 'Knows for a Fact' that Cookie Lyon from 'Empire' is Based On Her [Video]"},{"comment_id":"10152653959642894","commenter_b":"my wifey cnt marry ciara's nigga #loveTINASHE","commenter_a":"hmmmmm \"HOW MANY TIMES\" we gonna hear that lie....I love Tinashe but when I found this out...lost so much respect for her. You know it's gotta be true....if you listen to \"How many times\" you know it...and....Ciara been hurt too many times so....she just gonna leave her baby daddy for NO REASON? Oh.....ok","post_message":"Tinashe Denies Rumors That She's Dating Future, Says It's '100% Made Up and Untrue'"},{"comment_id":"10153212325922293","commenter_b":"Throw her off a tall skyscraper. She can't be rehabbed in jail. Ease the tax payers burden.","commenter_a":"Pure evil!","post_message":"“[If the police] read my messages with him I’m done. His family will hate me and I can go to jail.”"},{"comment_id":"1069240676520375","commenter_b":"I'm confident Mr. Trump is the answer to America's future. With Obama (or Clinton) . . . America had no future. God Bless President Elect Trump.","commenter_a":"Depends on whom U ask?! Do not TRUST him. He will NOT b under a microscope as Pres. Obama was. He will NOT make America great...agn This country will never UNIFIED....","post_message":"Yes or no: Will Donald Trump be a good president?"},{"comment_id":"10154307782959205","commenter_b":"ummm i dont think thats the chant they should be using.. wrong march","commenter_a":"Choppy feed. :/","post_message":""}]
