[{"comment_id":"10155832964064062","commenter_b":"But you're gonna pay for that wall?? Here's some facts no fake or false ones where are you getting your info?? Russia? @webpagelink @webpagelink And if you make that much good for you hire trumps tax attorney trump hasn't paid for taxes you're crying about in 20 years, It'll help offset the insurance cost. I'm sure you can afford it.. And again democracy is majority of the vote as for the illegitimate vote why don't you believe the fact it was tampered with to make trump win? Guess 2+2 never equals 4 ..he won with little more than 25% of actual registered voters now tell me how that works?? As for God's being in government it's expressly written to be kept out by our founding fathers ..called separation of church and state.","commenter_a":"I feel sorry for the people who actually believe in him. They need God in their lives, seems as nothing in this earth can convince them they are being screwed lied to and alienating half of the world. Keep drinking that kool aid let's see what shambles we are left in.","post_message":"President-elect Donald Trump defended a plan this morning that would see the U.S. initially pay for a border wall with Mexico and be reimbursed at a later date."},{"comment_id":"10154196330336770","commenter_b":"Beverly your character flaw is showing again! You need to get a job at disney oh I forgot your not a foreigner# you need to get a hobby!","commenter_a":"He isn't coming cause Trump plans to change the Visa programs so Disney will not be able to bring over cheaper labor and have Americans train their replacement anymore.","post_message":"Are you buying his reason?"},{"comment_id":"10153677956363961","commenter_b":"@username Yes, those stupid one.","commenter_a":"In case you haven't notice, Tom, Obama has given the \"middle finger\" to Americans since he's been in office, always going against the will of the majority. We'll remember you when your term is up.","post_message":"Proud to help secure a new federal grant to improve public transit and fix traffic lights in 10 Connecticut towns"},{"comment_id":"10153157400746130","commenter_b":"I gained a lot of weight on women food.","commenter_a":"Savanna Bailey","post_message":"\"I quickly learned that food 'for women' just isn’t enough food. It's designed to starve you.\""},{"comment_id":"1110991635663754","commenter_b":"All he did was that march. And she's scared? She worked under Obama for years! Goodness sake you're a liar","commenter_a":"He should....he's been a supporter of equality his entire career....Hillary has not!! Hillary is the dost kind of candidate...she will switch up her position just to look good...Bernie Sanders marched with Dr. King...Hillary is terrified of black people....fake a%%","post_message":"Here's how Bernie Sanders may be starting to crack the crucial demographic of Democratic voters."},{"comment_id":"884338575001603","commenter_b":"Good Riddance to Hillary Clinton!!!","commenter_a":"It's about damn time!","post_message":""},{"comment_id":"10156574233540725","commenter_b":"I say go to the debate the hell with Megyn Kelly .","commenter_a":"You can get along with Joe Scarborough, Nancy Pelosi, Harry Reid, and not Megyn Kelly.....?","post_message":"Should I do the #GOPdebate?"}]
