[{"comment_id":"918671201578514","commenter_b":"Death should be her punishment.if not Deport her rotten ass . We don't want her here.evil.","commenter_a":"Behead the Bitch...","post_message":"Muslim Nanny Who Beheaded 4 Year Old Girl Will Not Face Murder Trial Because... This is the world we are living in today people. What do you think her punishment should be?"},{"comment_id":"636098806550073","commenter_b":"#FuckDonaldTrump","commenter_a":"You people are celebrating this? He has not done anything to you. Anyone applauding a man loosing a fortune for standing up for his beliefs is soiling their own humanity. By ruining his life, you are staining your own soul. All of you are behaving much worse than anything you are accusing him of (falsely I might add). Those lambasting him are the ugly ones. I have seen much more vulgar behavior from the anti-trump crowd than anything that has been used as ammunition against him, true or not (most of it is false).","post_message":"The numbers say that Trump casinos, stores, and golf courses have suffered most."},{"comment_id":"1661010187498580","commenter_b":"Don't forget Texas borders!","commenter_a":"Focus now on what is at hand Mr. Trump. Put an end to ISIS, erect that wall, and focus on Florida and Canadian borders, lastly boost our economy. You have mentioned these 3 things before which garnered my attention, then my vote. Just give more ways of getting this done. Oh, hate to throw this in but there may be a few executive orders that need immediate attention! TRUMP 2016!","post_message":"Remember, I am self-funding my campaign, the only one in either party. I'm not controlled by lobbyists or special interests-only the U.S.A.!"},{"comment_id":"10153767932239411","commenter_b":"Anna Tagintseva shut your mouth bitch","commenter_a":"I know those Chinese universities are bullshiting all the time and yet @username believed it. And someone believe that China will go against US with the help from Russia? Come on, China and US need each other, while Russia will have to stand back and watch.","post_message":"'The increasing pro-active position by China is built on increasing sophisticated and powerful military technology in China defense and military sector. This factor makes US increasingly worried.' - Xin Zhang, Research Fellow at East China Normal University. (Op-Ed)"},{"comment_id":"1090391007723817","commenter_b":"Arrest the bum and let him drink the water","commenter_a":"A shame","post_message":"The city has confirmed 200 cases and 9,000 exposures to lead poisoning in kids under age 6."},{"comment_id":"564066700424981","commenter_b":"She's a cunt.","commenter_a":"Please, it's time to serve her!","post_message":"It's about time!"},{"comment_id":"10154332394779607","commenter_b":"How dare she!","commenter_a":"Democrats cow-tow to any and all unions especially ones tied to government. Follow the money. The only choice they like is abortion.","post_message":"\"Rather than merely enjoying her billions and donating money to fashionable causes, she poured money, time, and energy into education reform with a particular focus on the least economically advantaged...\""}]
