[{"comment_id":"766826556749286","commenter_b":"pigs","commenter_a":"Thug scum! Their families should suffer for the suffering they've caused others!","post_message":"So disturbing."},{"comment_id":"10153457248972464","commenter_b":"0NE VOTO OVER 2/3 DO OK DEAL (WE THE POEPLE DO) WILL KICK YOU OUT IF YOU VOTO FOR IT NO RETIREMENT PUT YOU IN obamacare !!!!! TRUMP 12016","commenter_a":"Ted, this is one thing that you are exactly correct on !","post_message":"The #IranDeal is a catastrophic mistake. Help stop it: @webpagelink"},{"comment_id":"1152993574758066","commenter_b":"Trump is the person this country needs. He is not a politician, he is a hard nosed businessman. The borders should have been closed a long time ago, illegals need to go, refugees need to find another country to bleed for free stuff. I am so sick of the politically correct government we have now, none of them have common sense. After 9-11 we should have turned that place into a parking lot just like we did to Japan during ww2.","commenter_a":"Anyone who plans on voting for that lying, cheating, snake called hillary just needs to stay home. She should be on her way to prison for the email scandal and benghazzi. This proves that government is fixed. Besides nobody wants to see bill again ( he don't even know what sex is).","post_message":"Michelle Obama says she wants a president who knows issues \"cannot be boiled down to 140 characters.\""},{"comment_id":"10152991347419712","commenter_b":"Good point cutty, still can't stand the guy. Good luck this weekend","commenter_a":"How is this scumbag celebrated?","post_message":"Here are five of Terrell Suggs' greatest chirps about the Patriots and quarterback Tom Brady, a team he doesn't exactly like."},{"comment_id":"10153997969131770","commenter_b":"No we want our WALL","commenter_a":"I bet she does. I want the wall right now.","post_message":"Mexico foreign affairs minister says her dream is OPEN BORDERS, with no walls."},{"comment_id":"10155017567319628","commenter_b":"That's a lie Muslim DID NOT HELP BUILD AMERICA","commenter_a":"that is wrong, they (muslims) had no part in building America.","post_message":"Ohio State University is now teaching students that Muslims helped build America"},{"comment_id":"1099154366818961","commenter_b":"Hypocrites and parasites all , get them all out now","commenter_a":"Kristian I don't know if you'll catch it","post_message":"#resigncameron demo live in London"}]
