[{"comment_id":"428518377308118","commenter_b":"Please don't breed.","commenter_a":"But what if I just want to pee in the girls bathroom? You mean my behavior and emotions don't drive the judicial system? #keepyourdick","post_message":"In 19 countries in Europe, transgender people are forced to undergo surgery and sterilization in order to legally change their gender."},{"comment_id":"749120498611861","commenter_b":"Ghetto trashy bitch.","commenter_a":"TELL ME WHO IS RACIST,,HE WAS A GENTLEMEN..I WOULD HAVE SLAPED HER ASS","post_message":"RACIST: Welfare Queen Attacks Man For Being White, Watch What Happens Next [VIDEO] Racebaiters will never say anything about this. What would you do in this situation?"},{"comment_id":"10153315079826680","commenter_b":"Women are voting for her because she's the most qualified and she's been speaking up for us her whole political career. Not because we're shamed or bullied into it.#Imwithher","commenter_a":"And join her in hell","post_message":"POLITICO's Roger Simon says: It's a strange world when women are being shamed into voting for Clinton."},{"comment_id":"10156259154010354","commenter_b":"Well, she won't have to worry so much about those tax breaks she was looking for in America. Now she has not reason to stay here.","commenter_a":"You hate America and Republicans, well, that's fine, we won't bother to see your movies.","post_message":"The America hater's new movie is hemorrhaging cash..."},{"comment_id":"10154614760931077","commenter_b":"Only a nasty hateful woman would write this. Pathetic!","commenter_a":"what a nasty hateful woman she is.:(.","post_message":"There were visible awkward moments during the meeting of the two families."},{"comment_id":"1577140392594063","commenter_b":"She is not human, I look at her and see lie lie lie lie lie","commenter_a":"She has NO. SHAME. Once again, it's ALL about HER.","post_message":"Hillary Clinton slammed Republicans while talking about her health during a speech today."},{"comment_id":"1372039169498167","commenter_b":"Illegal aliens out of my health care","commenter_a":"Politics is what got you your \"free\" healthcare. We the people are tired of being forced to pay for it, So please feel free to sit down and STFU.","post_message":"HERE IT IS!"}]
