[{"comment_id":"1718830391702540","commenter_b":"Obama does not want to destroy it because he is part of it.","commenter_a":"Bill O'Reilly.the American. People should pay more attention what's going on around them. Train are self too be more open minded. These terrorists attracts are not going away. It's. Up too the America people too prevent these attracts. How. , communication system set up by naborhoods, friends. Basically by listing. You feel some one a subspect , call (911). Alearkness is the best defences. Maybe. So.","post_message":"Bill O'Reilly said America is under attack, and \"just because they don't use tanks and planes doesn't mean it isn't war. It is.\""},{"comment_id":"917358028382410","commenter_b":"off with her head!","commenter_a":"Behead here to.","post_message":" ordered me to kill child"},{"comment_id":"10154022766707693","commenter_b":"Another idiot spending American tax dollars to pay for illegals to be here with American tax dollars. And when they commit a crime. They will use American tax dollars to house and feed them in jail and to pay for their attorneys.","commenter_a":"😜 I'm sure President Trump is scared...","post_message":"BREAKING: Washington State Attorney General Bob Ferguson announces that he will file a federal lawsuit in response to President Donald J. Trump's travel ban."},{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"},{"comment_id":"10154901503909641","commenter_b":"From our childhood we used to draw it on our notebook hoping for good fortune and will continue I dun care what the world says","commenter_a":"James Higgins-Durnan","post_message":"Conal Footwear apologized and recalled a line of boots after a viral image showed they left swastika imprints @webpagelink"},{"comment_id":"10152912093186749","commenter_b":"PUKE.","commenter_a":"PUKE","post_message":"This Valentine's Day, Nicholas and Dylan are finally able to celebrate their legal marriage. This is progress. @webpagelink"},{"comment_id":"10153389361142061","commenter_b":"Lady Gaga, great job.","commenter_a":"Oh Yes She Did!!","post_message":"Lady Gaga absolutely crushed her performance of the national anthem at Super Bowl 50. @webpagelink"}]
