[{"comment_id":"520161724799271","commenter_b":"Illinois State law Requires When a firearm is sold or transferred, the buyer is required to present their FOID card. This applies to private sales between individuals as well as to sales by Federal Firearms License (FFL) holders.[7] For firearm sales by an FFL holder, or at a gun show, the seller must perform an automated dial-up check with the State Police, to verify that the FOID card is valid, and to redo the background check of the buyer.[4] This additional checking is known as the Firearm Transfer Inquiry Program (FTIP).[8] For private sales not at a gun show, the seller must also verify the buyer's FOID card with the state police, and receive a transfer approval number, either via a web site or with a phone.. Once again the Anti_ Gun posters cannot get the story straight even if they tried.","commenter_a":"So glad we have Universal Background Checks! Next time the criminal will do a Universal Background Check before he beats the victim and steals all the other guns. You know so he is somehow legal?","post_message":"Before leaving, his attackers also took his gun safe and ammo. -Linda"},{"comment_id":"10153195924381130","commenter_b":"I agree.......who the hell cares!! Dumb ass bitch!","commenter_a":"@username @username ...at that point, who the hell cares aye? Lol","post_message":"Do you even wanna know?"},{"comment_id":"10153104580856162","commenter_b":"Them mfs is rodents. And the people who house these things are rodents too","commenter_a":"This is why you don't keep rodents as pets. Technically a ferret isnt a rodent but they are classified as meat eating predators. And who leaves a one month old baby un-attended?","post_message":"BABY ATTACKED: A 1-month-old baby lost a large portion of her face when she was attacked by 3 ferrets inside her home FULL STORY: @webpagelink"},{"comment_id":"10153580849383812","commenter_b":"I'll be there. Don't know if I'll fit in that box.","commenter_a":"This is just becoming the perfect excuse for some parents to abuse the internet and the kindness of others... What a joke, shame on the parents BY THE WAY, MY birthday is coming up, Im opening an invite to everyone and anyone!!! PO BOX for gifts to follow! LOL","post_message":"Hundreds attend 10-year-old boy's birthday after mom extends open invitation to the Internet when she finds she has no one to invite: \"He was grinning ear-to-ear.\" @webpagelink"},{"comment_id":"1160749183945110","commenter_b":"Lol, the next president will be Hillary!","commenter_a":"One of candidate from these group will be the next president of United of America. The name of that candidate is ......................... ?","post_message":"Here's what some of the candidates have been up to."},{"comment_id":"1935250666534672","commenter_b":"How about i kick you instead?","commenter_a":"Look like they're from the bloody Purge","post_message":"... But refuse to quit because they 'love the limelight'."},{"comment_id":"10157147438325354","commenter_b":"Mariah, pull your panties out of your crack.","commenter_a":"LOL Calvin Klein clothing. Made for dainty feminine pajama boys with no shoulders and 24\" waists.","post_message":"Kendall Jenner, the lurid Calvin Klein PHOTOS, and the major PR backlash..."}]
