[{"comment_id":"10153964560712885","commenter_b":"are you fucking dump lock that bitch UP!!!!!!!!","commenter_a":":( :( not cool","post_message":""},{"comment_id":"1628105883873422","commenter_b":"And your a bitch DANI KAYE","commenter_a":"Sandy if you like him so much. Why don't you just go and live with him at the white house.","post_message":"Tomorrow, we will leave behind a president who has carried himself with quiet dignity for eight years and replace him with a man who is neither quiet nor dignified."},{"comment_id":"10154056074359749","commenter_b":"Your a hoe lets be honest","commenter_a":"Hope u keep some pics for your kids to see when they grow","post_message":"\"I am a mother. I am a wife, a sister, a daughter, an entrepreneur and I am allowed to be sexy.\""},{"comment_id":"10153646418046770","commenter_b":"Me too...bad ole' white Cain and Trump lovin' women...shame on us...NOT!","commenter_a":"Love you Herman Cane! Oh, wait, you are black and I am racist! Isn't that what they say! Oh well, I love you, Dr Ben, Allen West! I guess I can be racist some other day!","post_message":"The Cain Train is Back in the Station - Herman Cain is back again live on day 2 of Trump's Convention"},{"comment_id":"10154434142778822","commenter_b":"The new laws in place are great for addicts but not so much for those experiencing post-op pain. Again, everyone is paying the price for addiction.","commenter_a":"There are legal opiate drugs and you don't get refills.","post_message":"Opioid addiction is an epidemic in our region and throughout the country. The numbers are preliminary, but deaths from drug overdoses have hit another all-time high in the region in 2016… and the crisis is showing no signs of slowing down."},{"comment_id":"10154369959116509","commenter_b":"Trump will eat her alive!","commenter_a":"So ... u think u luv Hilary Clinton .... u like Hillary Clinton .. u want to vote for Hillary Clinton ... u r impressed how the liberal media only shows u her smiles ... well.... here is some of her smiles ... enjoy ... @webpagelink","post_message":"Former Rep. Gabby Giffords and her husband Mark Kelly endorse Hillary Clinton on Sunday, she is the only \"candidate for president that has the determination and toughness to stand up to the corporate gun lobby -- and the record to prove it.\""},{"comment_id":"10153782383018984","commenter_b":"Yes I agree with the teacher. With the country like it is, how did she know it was not a bomb. Thank, to her for keeping our students safe. I wish they would all go back to there own Country .","commenter_a":"Just wanting to get more free money. They need to kick the whole damn family out of the country.","post_message":"There's already plenty of controversy and speculation surrounding the case of the 14-year-old boy Ahmed Mohamed, who brought his clock to school - and now what his family just did is taking it all one step further, Do you still stand by this school's decision to call the authorities?"}]
