[{"comment_id":"10153245476169087","commenter_b":"F you Bitch !!","commenter_a":"obama with his gay pride lit up the white house for his muslim brothers and he told us how proud that he was to light up the white house for his gay friends","post_message":"“If Donald Trump becomes president, that will be the end of the world,” said Hunger Games actress Jennifer Lawrence said. \"I genuinely believe that reality television has reached the ultimate place where now even [presidential elections] might just be for entertainment.\""},{"comment_id":"10154596759964166","commenter_b":"Only applies to men though... Women can murder their babies. Just ask killery","commenter_a":"What is \"feticide\" ?","post_message":"JUST IN: The man accused of killing a pregnant teacher and dumping her body has bonded out of jail. His bond was set at $500,000."},{"comment_id":"10154186189827894","commenter_b":"What a bitch","commenter_a":"Real petty","post_message":"Ouch! Sheree Whitfield Responds to Kenya Moore's Chateau Shade: 'My Mother Loves Me' [Video]"},{"comment_id":"1181717725240095","commenter_b":"lol actually u support a murderous witch AKA BENGHAZI BITCH","commenter_a":"TO BAD ALL THE BULLSHIT HE TOLD WAS A LIE.","post_message":"Donald J. Trump just gave the speech of a lifetime... but more importantly, he totally destroyed Hillary Clinton. He put a very special message to Hillary in there that you won't want to miss."},{"comment_id":"10154144133589060","commenter_b":"@username I agree. She's one big mess. But they will elect her. Everyone loves a winner","commenter_a":"Lets make no mistake - Hillary has LOTS and LOTS of experience with many, many, many male (and some woman) leaders.","post_message":"Sanders espouses bold positions; Clinton talks about the world leaders she has met"},{"comment_id":"1354102041270105","commenter_b":"BUILD THAT WALL!!!!!!!","commenter_a":"The racist bigots Trump supporters would love as many Mexican families as possible to die. Pretty sad! That's why I'm with her!!","post_message":"A son migrated to the U.S. from Mexico, to help his parents survive by sending back money. But part of Donald J. Trump's immigration policy could threaten that support, and the lifeline of an entire town. (In a statement to CNN, the Trump campaign maintains building a wall is the right solution, but did not address money transfers directly.)"},{"comment_id":"800436556756837","commenter_b":"And for what he's done to military, vets... Americans! Bringing illegals and terrorists into our country to kill us!!!!","commenter_a":"Yes! Obama should be put in prison for intentionally violating the law and for threatening others, who do enforce the law, with being punished for that enforcement.","post_message":"This Federal Judge Just Took Down Obama For Betraying America. We need more people in this country who will stand up against him. Do you support this judge?"}]
