[{"comment_id":"10153764153724117","commenter_b":"Hey you fucker","commenter_a":"It's simply beyond comprehension how anybody can even entertain the drivel that spews forth from his vapid-short-sentence-narcissistic mouth. (And disclaimer for the inevitable butthurt Repubs, Clinton isn't any more trustworthy. Happy now?)","post_message":"Donald J. Trump is selling skepticism about the democratic process because he does not believe in it himself."},{"comment_id":"1594885237238266","commenter_b":"These dumbasses ran into them in Tampa in Ybor thank God for The Thin Blue Line or those protesters would have had one hell of an ugly day in their life","commenter_a":"Just shows what they are made of! Nothing these crybabies should be kissing the cops asses for saving them lol","post_message":"What happens when whiny anti-Trump protesters interrupt The Few, The Proud, The Marines?"},{"comment_id":"1207587629262246","commenter_b":"Yeah they're adorable haha, the way they move :D","commenter_a":"@username they are so cute lol","post_message":"<3 penguins Watch the full video here: bit.ly/1Fxpjfk Video by John Downer Productions. Music composed by Will Gregory. Video edited by Matthew Gordon."},{"comment_id":"1315430658535467","commenter_b":"Hell yes! Build your wall and Get Over It!","commenter_a":"Could you guys please move on from this and actually report news.","post_message":"He's the \"Hamilton\" actor who gave a holier-than-thou speech to Vice President-elect Mike Pence at a performance of the play in New York City last week. Now, sick tweets have emerged that show the kind of person that Brandon V. Dixon REALLY is, and it's definitely not the kind of thing he wanted out there..."},{"comment_id":"783731095008773","commenter_b":"Because illegals are the only ones driving without insurance right... please i bet more illegals have insurnace on their vechile then citizens for the fact they want no problem with authority","commenter_a":"Idiot","post_message":"Should dreamer's driver's licenses include the label \"non-citizen\" on them? The debate over that question is heating up after a rookie lawmaker tweeted about an upcoming bill he's working on."},{"comment_id":"10152976962214205","commenter_b":"Yea, you're right. My comment is stupid, cause it was meant to be. And all you idiots commenting on my stupid comment as if I'm serious lol What's even more ridiculous is \"the police have to do their jobs\". So that's why some ppl get Burger King and walked out of a building (when they've killed 9ppl) and other ppl get choked to death for selling loose cigs, or get shot to death on site for having a toy gun (a 12 year old btw). Or others mysteriously die by being shot in the back while cuffed and in the back of a cop car. Yea cops totally just doing their job by the books. So yea, thanks for \"proving\" me wrong on a comment that was clearly not serious to begin with. You butthurt idiots can shut your dick holsters and relax.","commenter_a":"Prolly told him \"good job son, you played your role perfectly. You did a good job as patsy for your government. Now here's your complimentary Burger King as promised.\"","post_message":"Did you know the cops bought Dylann Roof Burger King AFTER they arrested him? WTF?!"},{"comment_id":"10154395372381656","commenter_b":"@username let me guess you stand on a corner and watch to see if there anyone putting up a sign after you park legal must work for city and help a 5 man team screw in a light bulb....","commenter_a":"Don't park in a tow zone and you'll be fine. lol.","post_message":"\"None of us has been arrested for stealing,\" he said."}]
