[{"comment_id":"994807880648616","commenter_b":"Is that a fly?","commenter_a":"Della Blake","post_message":"This design student created his own 3D braces for only $60, and his teeth never looked better. (via NowThis)"},{"comment_id":"990789407625962","commenter_b":"In coming President~Trump ^ seek and destroy all opposition within our borders and outside our borders VOTE TRUMP","commenter_a":"These and all jehadic Muslims are evil and need to be killed period.","post_message":"Who saw this coming? [Read below]"},{"comment_id":"1686671934920265","commenter_b":"Hey Vincent, your situated right next to the greatest country of the world and your country is in shambles!! That alone tells us how F'ed up you and your country / society is. You'd think there would be something positive your country would pick up to your benefit. Fix your dump and make it so great and build a wall to keep us out. We'd appreciate it. Asshole!!","commenter_a":"Just put a tax on any money going back to Mexico or central America. Build that Wall Mr Trump.","post_message":"EX MEX PREX: 'NOT PAYING FOR FUC*ING WALL'"},{"comment_id":"881610245305235","commenter_b":"She is skanky.","commenter_a":"Megyn Kelly is a waste of human potential. A bright and flashy exterior but of little inner substance.","post_message":""},{"comment_id":"1376905028996190","commenter_b":"Once you build the real fence, you will also be a target of terrorist!","commenter_a":"Hypocrisy","post_message":"The agency said it intends to begin building a “taller, stronger” fence to protect the White House grounds by 2018. via NBC Washington"},{"comment_id":"1222871987767261","commenter_b":"@username no yo are for supporting that muslim scum","commenter_a":"HES DONE MORE FOR THE USA THEN OBAMA DID IN 8 YRS YOU PPL NEED TO GET A LIFE AND MOVE ON","post_message":"BREAKING NEWS: President Trump holds surprise press conference at the White House"},{"comment_id":"1738376596301641","commenter_b":"She wants you to lick it for her ! Lol","commenter_a":"Someone should tell her to lick her butt hole like a dog and mind her own dam business !","post_message":"Hillary Clinton told a group of supporters on Wednesday that America has \"too many guns.\" Yes, that's right. The presidential candidate who claims to respect the Second Amendment is upset that Americans own more guns than she is ok with."}]
