[{"comment_id":"10154403521603132","commenter_b":"I haven't read the article but I believe he is saying that he feels the death of Prince is a tragic loss as was 9/11. I know I haven't stopped crying since Thursday and I never met the man or knew him other than his movies and music. He was a beautiful soul and will be truly missed. @username take things so out of context it's unreal and always have to make things a issue where they should be no issue. Prince was a sexy, talented, giving man and I know I am devistated and I am a fan that will truly miss him.","commenter_a":"Prince was an amazing human being for so many reasons, but really??? 1) Comparing his, or any singular death, to 9/11 is crazy! 2) Why is this a race issue? It's like saying that only us Minnesotans are truly grieving.","post_message":"Dave Chappelle once impersonated Prince for a now-infamous Chappelle's Show skit."},{"comment_id":"10154798019399062","commenter_b":"Russia has been the most proactive but we condemn their actions.... lol","commenter_a":"I wonder how long the leaders of the free world are going to tolerate this without taking the fight to ISIS directly and wiping them out! The scumbags need annihilating!","post_message":"BREAKING: Islamic State group claims responsibility for Brussels attacks, Associated Press reports. READ MORE -> @webpagelink"},{"comment_id":"10153249437958701","commenter_b":"What about whores?","commenter_a":"Taking offers on souls in exchange for this perfect diamond. Virgins get first preference.","post_message":"It's a 100-carat diamond, considered by experts to be \"perfect,\" and it's going on sale. Watch the full story, later tonight."},{"comment_id":"10153640608237217","commenter_b":"All rights should be removed from these benefit shoppers. Refugees have an easy passage, it is only benefit shoppers that get into a boat. Look at the streets of Germany and Sweden now. Full of parasites loafing around with no intention of getting a job. The come for a free ride and have no intention of contributing.","commenter_a":"Almost all of the migrants in the Mediterranean are coming from Sub-Saharan Africa, who have no excuse to join Europe. It's been highlighted that most refugees from Libya (in civil war) have travelled to Egypt or Tunisia, instead of Europe. Even worse, they're just doing it for economic benefit (trying to get deep into Europe eg. Germany etc)","post_message":"The deaths are the result of three shipwrecks off the Libyan coast, UNHCR, the UN Refugee Agency says."},{"comment_id":"10154066489172994","commenter_b":"Can I suggest a clip?","commenter_a":"Beyond a reasonable doubt. They have him , his gun, and a half dozen witnesses; he even pleaded the 5th. go figure. He wouldn't even get a chance to pray with me. One BULLET to his head, ok , 2 , just to make sure.","post_message":"Body found in a burned-out house in Detroit confirmed to be the mother of the missing 4-year-old girl -- the subject of the Amber Alert sent out this weekend. Police said the injuries were so severe to the second body thought to belong to the daughter that a positive ID could not yet be made. @webpagelink"},{"comment_id":"884581044987387","commenter_b":"If one wants buy-in from white people, blowing off white people who have had similar experiences seems extremely counterproductive.","commenter_a":"i think it's racist that it's subtle racism is only being committed by a white person in the panel. the comic itself is subtly racist.","post_message":"Let's agree to fix this."},{"comment_id":"992434430797029","commenter_b":"That woman needs to be locked up in the nearest lunatic asylum.","commenter_a":"Pathetic & scary scenario is these lunatics own guns! She probably packs a gun in her Walmart plastic purse! When these nut jobs escalate as she did, back up & run!","post_message":"Something tells me this nut is a Tea Partier."}]
