[{"comment_id":"10154539572188433","commenter_b":"@username ignores taped audio/video proof if it exposes negative info about Killary!","commenter_a":"I don't understand how Drumpf can stand up in front of the American people and continue spewing his blatant lies. He should know that he can't get away with it. If he doesn't, he's no more intelligent than his dumb deplorable supporters.","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"},{"comment_id":"915434395182976","commenter_b":"As a mom myself, I agree with you Ben. How much did she actually ingest if she took a sip and said it tasted funny?","commenter_a":"Clearly this is not cool, but accidents do happen in life. She drank a tiny amount of watered down sangria, not methylated spirits or even vodka. I think the parents are massively over reacting. I would be angry, but come on, a few sips of cheap wine mixed with orange juice is not going to kill a small child.","post_message":"She was rushed to the hospital drunk"},{"comment_id":"10157357339200354","commenter_b":"Nope don't thonk so. We the people have spoken.","commenter_a":"I think billy needs to brexit.","post_message":"If at first you don't succeed..."},{"comment_id":"962133447168441","commenter_b":"Ok first of all don't try to tell me there was no raiping in euroup until the emigrants got there it's just the fact that a raipest is a raipest no matter where he is so you shouldn't go around saying imegrants are raipests hide your wives and kids I mean grow up dude","commenter_a":"Imagine if an immigrant did the same thing in Europe. I guess the title (and the comments) would be totally different!!","post_message":"A tourist has captured spectacular views from the top of a pyramid he illegally scaled in Egypt. (Video credit: Caters TV.)"},{"comment_id":"10153380669974135","commenter_b":"you again? really , go away you angry negative bitter woman!","commenter_a":"Why don't you open you wallet and pay NJ back for the money you stole from them for your bridegate \"investigation\" and your campaign expenses. Oh, don't forget $82,000 for hot dogs and beer at the ball games.","post_message":"I opened my heart to you"},{"comment_id":"1312058212172984","commenter_b":"Pandering witch.","commenter_a":"We're going to miss Michelle!","post_message":"“Como saben, estamos en medio del Mes de la Herencia Hispana. En las aulas por todo el país los niños aprenderán sobre Dolores Huerta y César Chávez… Julián y Joaquín Castro y la jueza Sotomayor… Roberto Clemente y Laurie Hernández… Gloria Estefan y Lin-Manuel Miranda e innumerables latinos más. Nombres que conocemos y nombres que tal vez no conozcamos, pero que han enriquecido a este país por generaciones. Si eres mexicano, puertorriqueño, cubano, latinoamericano o afrolatino… si tu familia acaba de llegar o ha estado aquí antes de que los Estados Unidos existiera… no eres un extraño. No eres un intruso. Ustedes son nuestros vecinos, nuestros colegas, nuestros amigos y nuestras familias. Ustedes hacen a nuestro país más fuerte, más inteligente, más creativo. Quiero que sepan que yo los entiendo y estoy con ustedes. Y una y otra vez hemos visto que cuando invertimos en la comunidad ─ cuando hacemos ..."},{"comment_id":"1029493403807452","commenter_b":"Sanders loss = Trump win. Hillary will be down soon.","commenter_a":"We love you Bernie. We are looking forward to you continuing to lead your movement of love to unite the country and bring more peace to the world.","post_message":"All Americans are horrified, disgusted and saddened by the horrific atrocity in Orlando. At this point we do not know whether this was an act of terrorism, a terrible hate crime against gay people or the act of a very sick person, but we extend our heartfelt condolences to the victims’ families and loved ones and our thoughts are with the injured and the entire Orlando LGBTQ community."}]
