[{"comment_id":"10153060785906519","commenter_b":"Hillary covered up for him all those years in AR because she knew he was going to be president. The wives of predators who cover up for them are almost as guilty as the offender. She only cares about one thing...power.","commenter_a":"Y'all still talking about Clinton and consensual sex. Oh I get it Hillary's running, so y'all need to bring that up again. Never mind that it isn't relevant! Or are we blaming Hillary for a spouse that strays?","post_message":"\"The actual facts of the matter are that Bill Clinton was a serial abuser of working-class women–he had exploited that power differential even in Arkansas...\""},{"comment_id":"10154166342376717","commenter_b":"FUCK HER","commenter_a":"I think Caitlyn is a fake I mean if she was a true Transgender she would've turned her back on trump a long time ago","post_message":"The transgender reality star and former Olympian is believed to have accepted the invitation and is looking for a plus-one to accompany her."},{"comment_id":"10153814122893984","commenter_b":"I think if gay couples have to go to another office in another county, then their taxes should follow where they get services. I'm sure if Kim's paycheck was affected by how many licenses she issued then her religious beliefs would't be as important.","commenter_a":"Hey, wait a minute.....where's the outrage towards the Muslim bakeries (several) who refused service to gay couples planning weddings because of their religious beliefs? And why did the Muslim Target store cashier get an allowance to her job description to specify items she refused to ring up for a customer when they wanted to purchase a bottle of wine? And why did the Muslim flight attendant (<----surreal, isn't it?) get a religious liberty allowance to her job description by refusing to serve alcohol to a passenger? Yeah, okay. Had Kim been a Muslim, this narrative would have flipped to sympathize on the side of religious liberty. But she's not Muslim. She's just a Christian adhering to her religious rights, and in a respectful way, might I add. Respectful. Take a page, all you vulgar-mouthed, whiny, double standard hypocrites. It is what it is: religious liberty. Further, as stated in the ...","post_message":"The letters from Kim Davis that were just uncovered could drastically change how people think about this case. Do you stand with Kim Davis?"},{"comment_id":"476672599181287","commenter_b":"Speaking of closet queens... overreact much, Michael???","commenter_a":"This is one of the reasons that many on the right hate him. They believe that when people are treated equally, they (personally) are somehow diminished.","post_message":"President Obama highlights why the Kenyan \"non-issue\" of LGBT rights is an issue."},{"comment_id":"10153624837111770","commenter_b":"BLM is simply trying to create so much chaos that Marshall Law will be declared and in turn that means that if its declared Obummer will stay in office that's what they want! I have no idea why they want that because he does not care about them he does not care about anyone accept his third world Muslime buddies (no that's not a misspelling they are Muslim slimes)!","commenter_a":"Great! Trapper keeps sticking his foot in his mouth.","post_message":"\"Listen, Jake, I wasn't born last night,\" Police Chief David Brown told CNN's Jake Tapper. \"You ask me a policy question that policy-makers haven't resolved, I'm going to punt and kick it back to you.\" READ MORE: @webpagelink"},{"comment_id":"10153107155889411","commenter_b":"Your mother is a terrorist","commenter_a":"Not all muslims are terorist but all terorists are muslim...","post_message":""},{"comment_id":"800436556756837","commenter_b":"And for what he's done to military, vets... Americans! Bringing illegals and terrorists into our country to kill us!!!!","commenter_a":"Yes! Obama should be put in prison for intentionally violating the law and for threatening others, who do enforce the law, with being punished for that enforcement.","post_message":"This Federal Judge Just Took Down Obama For Betraying America. We need more people in this country who will stand up against him. Do you support this judge?"}]
