[{"comment_id":"10153229988242293","commenter_b":"And who would that lady be? Certainly not this four times married adulterous who're?","commenter_a":"It takes lady to show the world what TRUE VALUES are; and how STAND UP in those VALUES ...!!","post_message":"Kim Davis entered the Carter County Detention Center under cover of night five days ago. She emerged to Survivor’s “Eye of the Tiger.”"},{"comment_id":"10156697390890354","commenter_b":"I wouldnt be a cop there for any amount of money. I say, disband the police, send those trained officer where they are really needed...and let the animals rape, rob and kill each other. Liberalism worked so well in all the other major inner cities (Detroit - a decaying liberal sh*t hole, Philly, East St. Louis, etc...), let Berkley have a peek at reality.","commenter_a":"--- I recommend abolishing 'UC Irvine\"----much more accomplished----","post_message":"You're not going to believe what they say in their demands letter. As you read it, just remind yourself that these are tomorrow's college educated \"leaders.\""},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."},{"comment_id":"1382661791756865","commenter_b":"Somebody pleass shut this fatass up.","commenter_a":"some day little fat man someone is going to shut your mouth when you talk about things u don't know anything about.u are just mouthing off cause u want to be a big ass --- hum you already have a big ass --- so get off President Trumps back. he is only do what he needs to do to keep America safe","post_message":"Michael Moore always finds a way to be even more classless than he was minutes before! That seems to be his only real talent."},{"comment_id":"10153679866377217","commenter_b":"She was vile","commenter_a":"She was rude!","post_message":"\"I'm in favour of migration, I simply want to control the numbers\" - Vote Leave's Michael Gove tells BBC Question Time audience. @webpagelink #bbcqt #EUref"},{"comment_id":"10154558927621323","commenter_b":"Sex is a biological need. If I'm in a relationship, I am entitled to sex. If she won't provide, I can find someone who will. Using sex as a weapon against men is ABUSE.","commenter_a":"Problem is there are too many uptight women out there. Articles like this don't help either. 'Intimacy'. Words like that make sex sound like some mythical state of enlightenment that we are trying to achieve. When the fact is its just some good old hard core fucking. Get all the mind fuck thoughts out your head and get sucking or licking and you'll soon get into it. We've had hard core porn for years now showing us how to get down and dirty with it so stop making a big deal about it. And if all else fails there's prostitutes who can do the job for you so just sub contract it out and let your partner get some for a change instead of walking round like a sex starved idiot.","post_message":"\"Drink is not the answer.\""},{"comment_id":"1277527375611846","commenter_b":"@username, and you KNOW she absolutely will DO it, too!","commenter_a":"This election isn't about picking a president! It's about the Law..Yes the Law!!!!USA Law against Sharia law!! Wake up Americans, don't you Dare be fooled,don't you Dare wear the Americans are stupid label, show all those countries out there that your a brilliant Mind and your family will make a smart choice in votes for your Country and what it stands for! God bless our way of life.Amen","post_message":"Anti-Christian extremists are demanding that senior U.S. military chaplains be investigated and punished for praying in uniform. Sign our petition to fight back. We must defend our brave military chaplains."}]
