[{"comment_id":"327851404005511","commenter_b":"Trump supported assault weapon ban","commenter_a":"And you guys don't have an enemies list? Apparently, Trump is at the top of your list. You really have to quit with the Hitler and Facist rhetoric. All that does is make me want to vote for Trump even more.","post_message":"Erick Erickson, you said it. Fascists and tyrants always have enemies lists."},{"comment_id":"10155547019200389","commenter_b":"Once again jay you are incorrect as Cheney resigned from Hali when he became VP. As you say google it","commenter_a":"We need to do the same with Bush and Chaney for the Iraq war","post_message":"Egyptian criminal court sentenced ousted Islamist President Mohammed Morsi to 20 years in prison on charges linked to the killing of protesters in 2012."},{"comment_id":"10155064205902178","commenter_b":"Don't they know it's a \"shark free zone\"! This method works for criminals who take heed to gun free notices.","commenter_a":"Joe Daniel","post_message":"An 11-year-old boy was bitten by a shark off the coast of North Carolina yesterday, the second incident in as many weeks. >>>wral.com/@username"},{"comment_id":"10157170758630354","commenter_b":"This woman is psychotic.","commenter_a":"She's fucking disgusting to look at! A professional con artist like the Obama's and the privilege Clinton's they all should get tarred and featured in public !","post_message":"Want nightmares? WATCH:"},{"comment_id":"10153194214264411","commenter_b":"That goes to zionist jews pigs from europe","commenter_a":"it's very important to distinguish between real Muslims and crazy fanatics who preach radical Islam. They just hide behind pseudo faith in God to do terrible things...","post_message":""},{"comment_id":"10154030120894877","commenter_b":"waaaaaa look at us! we are terrible parents! we make bad decisions and get back men killed with our ignorance! yayyyyy! black men, you are lucky to escape the wombs of these criminal producing welfare brood mares!","commenter_a":"Very nice to see Americans giving these women love and support. Their bravery and commitment to honor their sons is wonderful to see.","post_message":"‘Mothers of the Movement’ deliver staggering testimony of loss, hope at DNC Grio fam, what did you think of their appearance? Watch the full clip and share your thoughts below."},{"comment_id":"1546688018681408","commenter_b":"If we are about to start following the Bible, can we get this woman to shut her mouth first ??","commenter_a":"I'd pay money to see the look on her face at the innoguration.","post_message":"\"Okay, Hillary, now that Donald J. Trump is looking to help you heal and help the nation heal, would it be fair to say – to use your own words – 'It's time to give Donald Trump his chance to lead'?\" – Judge Jeanine Pirro @webpagelink"}]
