[{"comment_id":"1105423922847469","commenter_b":"Bitchhhh","commenter_a":"@username best of the world's ladies !!!!","post_message":"This isn't who we are, and it also isn't how we keep America safe."},{"comment_id":"10153778649078854","commenter_b":"This witch should have been fried after being tried!","commenter_a":"a bullet does not cost much and in this case it would definitely improve the penal figures.","post_message":"Mother Sentenced to 25 Years in Prison After She Presented an FBI Informant with a Disturbing Offer"},{"comment_id":"1006601726066242","commenter_b":"It is her own fault due to not following the rules- do not get closer then 25 yards!!!","commenter_a":"Stupid people, I do enjoy them.","post_message":"Pictured: Moment bison selfie went all wrong"},{"comment_id":"878303132360263","commenter_b":"Just like your whore mother.","commenter_a":"That's no lady. It's a MAN !!","post_message":"Here's the ugly truth about MOOCHELLE. This is disgusting. Do you think Michelle is the worst first lady in history? Comment 'yes' or 'no'!"},{"comment_id":"10153394971818984","commenter_b":"She is as stupid as her 2 sons. one is hell now ,, the otherone will follow .","commenter_a":"I wanted him to get life in prison I did not want him to become a martyr","post_message":"The mother of condemned Boston Marathon bomber just made a chilling threat to America following her son's sentencing... Do you think this Boston bomber got what he deserved?"},{"comment_id":"10153048928789071","commenter_b":"We have to build a wall...","commenter_a":"@username gute Nacht murica","post_message":"A Univision reporter gets kicked out of a Trump event"},{"comment_id":"10154071183936336","commenter_b":"#obamaville #EVILislam #muslimBrotherhood. #NOmoreDemocrats #SouthCarolinaForTRUMP!","commenter_a":"There is either more to the story or it's the usual Obamma admin ways.","post_message":"\"After acting to protect a child from sexual assault from an Afghan commander, SFC Martland was punished and could be kicked out of the military at any time,\" said Jay Sekulow, of the American Center for Law and Justice."}]
