[{"comment_id":"788288661319908","commenter_b":"Why is it that all of Trump's picks sound like great material for an Onion article?","commenter_a":"Sickening! The u.s.a. Is about to become an embarrassment","post_message":"Every single appointment is scarier and scarier."},{"comment_id":"10154479449143271","commenter_b":"Happens to every girl.","commenter_a":"LoL OMG! When I was 14 I lived off of 14th and Pierce by Casa Bonita....and had to catch the bus on Colfax for school. If I would have reported every dude who cat called, they would have needed a daily report for me alone on the news. I'm really not trying to down play the fact that this guy could have been a weirdo but this seems a little extreme.","post_message":"Keep an eye out, Colorado. This man reportedly tried to follow the girls home after they ran away from him."},{"comment_id":"10153066527856336","commenter_b":"Please woman go troll somewhere else","commenter_a":"Poor guy","post_message":"Bristol Palin is engaged to Medal of Honor recipient Dakota Meyer – the Kentucky native is credited with saving the lives of 36 Marines, Army soldiers and Afghan soldiers."},{"comment_id":"1877847435771618","commenter_b":"Hopefully she'll keel over and die.","commenter_a":"not so easy to back track in our modern age of electronics","post_message":"FRAIL LOOKING HILLARY HITS TRUMP FOR CALLING NYC ATTACK 'BOMBINGS' -- AFTER DOING THE SAME..."},{"comment_id":"913906465331025","commenter_b":"Bernie, please keep THEIR laws off OUR bodies. #BERNIESANDERS","commenter_a":"The government only cares because it's the life of another tax payer. It's the basic human right of the individual.","post_message":"I understand that not everyone agrees on this issue but my view is that a woman has the right to make decisions regarding her own body, not the United States government."},{"comment_id":"512998138876699","commenter_b":"We certainly need to close our borders, so these warmongering murdering Isis people don't creep in, for that is what they plan to do. We need to do that immediately! The infiltration of this violence is not needed here.","commenter_a":"We need to stand united with the world on this issue of terrorism. We are not doing enough and hundreds of thousands have died already.","post_message":"To the people of France, we stand united with you and all of France is on our hearts and in our prayers. If history has taught us anything, it proves we must remain vigilant against such cowardly, terrorist attacks. America can lead, and we have the strength to do so, but currently lack the leadership. My hope is that our national leaders grasp why so many Americans, including myself, want the Border secured so that we not only deal with the issue of illegal immigration but we also ensure terrorists do not cross our border to do us harm. Never has the old adage been more true: The World is safer when America is Strong: Our People know it, Our Allies know it, and most importantly, Our Enemies know it."},{"comment_id":"10154672636522994","commenter_b":"Not me Jonathon. I hate anything pumpkin","commenter_a":"Generalizing entire groups of people works both ways. Don't assume all black men are criminals, don't assume all cops are bad, don't assume all white girls like pumpkin spice, all black women are angry, all white men are drunks or that all Asians can't drive. Just be nice to other people.","post_message":"What started as a daughter's effort to plan a retirement party for her police officer father turned into so much more."}]
