[{"comment_id":"10154369386141509","commenter_b":"Why are they racist? Because we want to deport illegal immigrants like every single country in the world? So the whole world is racist except for American liberal sissy's? Mexico deports all illegals so by your standards they're racist. England is racist. China is racist. Maybe your just a puppet?","commenter_a":"This won't sit well with the racist elements of the Republican party. Cruz is saying what I thought all along, the Republican party will never round up anyone. It's an election ploy with base voters.","post_message":"Texas Sen. Ted Cruz does not plan to authorize a special force to deport the undocumented immigrants currently in the country, he told CNN's Jake Tapper, setting up a policy contrast with Donald J. Trump. @webpagelink"},{"comment_id":"536032629890369","commenter_b":"suck a dick","commenter_a":"@username du o daniel","post_message":"Piper the abandoned pig has a new home and a new best mate (via The Dodo)"},{"comment_id":"10156653866510725","commenter_b":"Has anyone seen the documentary \"Cartel Land\" available on Netflix? Serious people we need an individual to build that wall. The Mexican/So.American border needs to be secure. We need Trump!!!","commenter_a":"#makeamericagreatagain","post_message":"GOOD MORNING! Put me to work for America- and I assure you that WE will MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"687141811427171","commenter_b":"Impeach her husband and she'll go away with him!","commenter_a":"Look who's being bossy now!","post_message":"Michelle Running Campaign To Ban ‘Offensive’ Word From English Language. She has completely lost it. Do you find Michelle Obama offensive?"},{"comment_id":"10154290934583258","commenter_b":"She started it!!!","commenter_a":"Elizabeth, do not respond to Trump! Why are u engaging in this? It is beneath u.","post_message":"Donald J. Trump and Elizabeth Warren lobbed insults again on Twitter Wednesday."},{"comment_id":"1037567749698799","commenter_b":"Facebook is trying to silence him tonite","commenter_a":"Completely cut off","post_message":"Watch Live: Donald J. Trump holds a rally in Sterling Heights, Michigan."},{"comment_id":"1253114871421932","commenter_b":"@username eating pussy 😂😂","commenter_a":"Who refers to going down on a girl as \"giving head\". Wtf kinda gay shit is that... \"yeah I gave her head last night\" wtf","post_message":"Who should go first?! #WSHH"}]
