[{"comment_id":"10158446067150354","commenter_b":"You little queer. I think my grandkids could fuck you up, fag!","commenter_a":"You won't stand a chance asshole come on bring it I'll save a hospital Bed it's waiting on you fucking RACIST RAT","post_message":"The shutdown of MILO event at UC Davis may be a preview of what to expect at next week inauguration of Donald Trump. Just who are these hooligans? Lee Stranahan investigates..."},{"comment_id":"920944947962651","commenter_b":"soo then Michael is right , those other species of plants are no good , , chop em down & replace them with hemp.","commenter_a":"they need to fix this, and they can, if every person in China planted even just one tree, imagine :) Jude","post_message":"This documentary film went wildly viral with over 200 million views in it's first week online. Now Chinese officials are afraid that you'll see it too."},{"comment_id":"10155599554315354","commenter_b":"Why are we still seeing this crazy whore.","commenter_a":"Sure she's an idiot...but can't she practice the religion of her choice wihout scrutiny?","post_message":"Raised Catholic....dabbled in Kabbalah...and now this... ...Check it out."},{"comment_id":"10156195156160615","commenter_b":"LMAO! Look at that old Mary!","commenter_a":"Being that he's gay, \"they\" should be \"we\"- \"I don't know why we need special protections.\" Also, \"special\" should be \"the same as\", since lgbts are just asking for the same as everyone else - \"I don't know why we need the same protections as everyone else.\" That's what he said, decoded.","post_message":"\"I don’t know why they feel they need special protections\""},{"comment_id":"10156248973870354","commenter_b":"that bitch!","commenter_a":"i was sexually harassed by Ashley Judd, she had her way with me, then tossed me aside","post_message":"When will liberal Hollywood stop its War on Women?"},{"comment_id":"484149281775652","commenter_b":"Get rid of him and his fat AZZ wife!","commenter_a":"Yes","post_message":"VIDEO: Kanye West cries racism after Beyonce loses... Kanye is a fool and a cancer, let's ban him from America. Do you agree Kanye should be banned from America?"},{"comment_id":"1329423637100902","commenter_b":"She owns them.","commenter_a":"Ivanka you rock and you are a great representative of a Jewish woman and princcess and MOm . G-d bless you and your family .NOOne has a perfect family and you exemplify derecho eretz.","post_message":"LIBERALS HAVE CONCLUSIVELY PROVEN DURING THEIR ELECTION MELTDOWN THAT THEY ARE THE SCUM OF THE EARTH!"}]
