[{"comment_id":"735303209993590","commenter_b":"Goog God.Shouldnt there be a law against ugly girls in bikinis?","commenter_a":"Probably wearing a swimsuit!!!","post_message":"What Chelsea Clinton Was Just Caught Doing Could Destroy Hillary's Campaign This puts Michelle Obama to shame. Do you think Hillary Clinton would make a horrible president?"},{"comment_id":"10154307546211509","commenter_b":"Joking? Missing a punch line...","commenter_a":"Fox News: Thug tries to jump on three girls, and bullets stopped him. Bill O'reily: What was he trying to do to those three girls before the bullets? We're just asking questions.","post_message":"15-year-old Zaveon Dobson was shot and killed after he jumped in to shield three girls from gunfire. @webpagelink"},{"comment_id":"10153563956586519","commenter_b":"Hello??? It is time for you poor ladies to start being your own role model. Stop whining.","commenter_a":"Sooooooo, losing weight is selling out now? You damned if you do, damned if you don't.","post_message":"\"I’m left longing for stories about fat women that don’t tumble off the wrong side of that thin tightrope between laughing with and laughing at...\""},{"comment_id":"10153095086985496","commenter_b":"I ain't never seen a man look like her from the neck down. Really???","commenter_a":"Just don't get how people beating the crap out of each is a sport and other makes them role models, I always taught my kids not to fight.","post_message":"The reaction may surprise you (then again, it might not): @webpagelink"},{"comment_id":"10153379588172377","commenter_b":"TRUMP vs HILLARY?? Trump Illegals out, creates jobs - Hillary Illegals left here, job losses? Trump build a wall, welcome new legal citizens and make them pay taxes. Hillary let em stay and use all our stuff for free. No wall ?? Trump going to bring companies back to America - Hillary could care less ? Trump supports all woman's programs, equal pay and job growth. Hillary supports only women's programs that give to her foundation and supports habitual adultery from her husband?? Trump support our allies in the Middle East & make new deals - Hillary does not support our allies and no new deals? Trump get rid of Obama care and have open insurance plans that people are allowed to pick from - Hillary supports Obama care and it will literally bankrupt itself in 3 more years ? Trump protecting other countries with our military & now earning ...","commenter_a":"why would Obama do that? His hero is Bil Ayers, terrorist bomber.","post_message":"President Obama should have insisted on Cuba returning a group of fugitives accused of killing police officers."},{"comment_id":"10154268994748822","commenter_b":"Assclown fool","commenter_a":"I'm so proud to have this man as my governor and I'm ashamed of the Pennsylvanians (some of whom are commenting here) who are racists and religious bigots. Thank you Governor Wolf for representing ALL Pennsylvanians (even the ignorant ones) and for protecting our children!","post_message":"NEW: Gov. Tom Wolf's administration released a response plan after recent incidents involving racism and religious intolerance in Pennsylvania schools."},{"comment_id":"1328494547175243","commenter_b":"Join a lots of OTHERS, -- WHO could put up with that WOMAN. Send \" HER \" to JAIL.","commenter_a":"Good girl, Judge! Way to go! You are the best!","post_message":"“It’s the kind of locker room and frat house talk that personally infuriates me. But guess what? I still, without a doubt, support [Donald J. Trump].\" Watch Judge Jeanine Pirro's full opening statement."}]
