[{"comment_id":"196351097508558","commenter_b":"Ginger ass snowflake whiny bitch","commenter_a":"You have the right to be a dumbass ya crybaby snowflakes","post_message":"While Republicans stick to zero solutions and plenty of petty insults, the rest of us are hard at work rescuing our democracy from dictator Trump. Video by Occupy Democrats. LIKE our page for more."},{"comment_id":"1921686894724985","commenter_b":"Looks like paid protesters to me....LOL ...Your here with no papers take your happy azz home.....","commenter_a":"Arrested all","post_message":"Protests at the RNC in Cleveland - \"A Human Wall\""},{"comment_id":"10154467699462675","commenter_b":"Let's be clear to all Trumpicans about at least one thing: not all terrorists are or have been Muslim. America isn't the only country to be attacked by terrorists. Terrorists have one thing they all share, they're Terror-ISTS","commenter_a":"guess what, you should leave too. you are an imagrant. give this country back to its rightful people, the native indian. !!!!!!!!!!!!","post_message":"British Foreign Minister Boris Johnson addresses parliament on President Trump's immigration policy. President Trump's executive order bans U.S. entry to migrants, refugees and green-card holders from seven predominantly Muslim nations."},{"comment_id":"10153326829869170","commenter_b":"then let her and the mayor protect the city, see how good they do against the thugs.","commenter_a":"This whole deal is just so sad, on so many levels. Lots of fault to go around. Lots of blame to be shared.","post_message":"BREAKING NEWS: Baltimore's chief prosecutor says the death of Freddie Gray is a homicide. Six officers are being charged."},{"comment_id":"454539224670672","commenter_b":"After we bomb the hell out of them , before we put the truss in harms way, and have other countries fighting to. We are close to bankruptcy like Greece, we should not do it alone.","commenter_a":"Should be an option but not the only one. Tired of these numbskulls. So ready to use other people's blood but not their own The Bush family did that, the Obama. Ass did it even he said was not. Clinton did it. If The Saudis want to keep their kingdom let them do it, if the Turks want their country let them invest their oeople, Jordanians, yemens. AND STOP ALL IMIGRATION INTO THE USA","post_message":"Donald Trump wants to send more US ground troops to fight ISIS. Do you agree or disagree with his plan?"},{"comment_id":"10154953238254497","commenter_b":"Cthulhu. Keeping it super old school.","commenter_a":"@username Cthulhu or FSM?","post_message":" haste, before His Holiness is torn asunder by the dark horror."},{"comment_id":"1051832858188283","commenter_b":"That's why we're in the place we are now,to no where.","commenter_a":"Sure makes some pretty good points","post_message":"This extremely popular \"Bernie\" meme has tens of thousands of likes and shares yet it reflects a SAD reality about young people today and the public education system in America. Watch as we expose the sad truth behind this meme. [READ]"}]
