[{"comment_id":"1324023564281057","commenter_b":"FUCK YOU FUCK sharia law GO HOME ALLUH FUCKTARDS","commenter_a":"It is so wrong","post_message":"Florida Democrats Approve Bill That Imposes Shariah Law On Women. You can't force your religion on other people. Do you think this wrong?"},{"comment_id":"10155047061111336","commenter_b":"what a bunch of bullcrap everyonr can get s social security number legal or not","commenter_a":"Wow that hurt my brain to watch. He says illegal immigrants contributed billions of dollars in taxes and social security 😂😂😂😂 you cant do that if you dont have a social security number and if your here illegally you dont have one. So how exactly is illegal immigrants doing anything for our nation except burding all of our systems and taking jobs from american citizens.....","post_message":" do you have a Social Security card to be in this country? How do you have a Social Security number? ICYMI: \"Angel Mom\" Laura Wilkerson and undocumented immigrant Jose Antonio Vargas clashed over President Donald J. Trump's executive orders on illegal immigration. @webpagelink"},{"comment_id":"10153190313663984","commenter_b":"Get the bitch away from our kids school's.","commenter_a":"She fills up on bananas! Hard to keep her out of the tree!","post_message":"Ouch - Michelle Obama will not be happy to hear this. Are you sick and tired of the Obamas telling us all how to live?"},{"comment_id":"10153234463025779","commenter_b":"Amazing political argument Mark. You've persuaded me to support Trump with your carefully worded statement.","commenter_a":"Biff Trump is a Joke..","post_message":"It started out as a joke: Donald Trump running for president! What better way to spoof the thinness of the Republican field than to shove a bombastic reality star with orange hair, a sixth-grade vocabulary and no behavioral filter onto the GOP debate stage. But, as Matt Taibbi writes, the joke turned ugly fast."},{"comment_id":"645119115621270","commenter_b":"GET A JOB BITCH!","commenter_a":"Who's going to pay . . . .? YOU ARE!!!!!","post_message":"America.....someday."},{"comment_id":"1730400360525702","commenter_b":"White people are gross","commenter_a":"God... trump is going to get us all killed.","post_message":"Hey, at least they're being honest about it. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153308250786770","commenter_b":"Even if a guy is into that, I can't imagine him liking those freaky legs.","commenter_a":"If he wants to live as a woman, that's on him, but could someone please tell him if he's going to wear short skirts to put on pantyhose? His legs are ugly & weird looking.","post_message":"\"That will always haunt me,\" Caitlyn Jenner said."}]
