[{"comment_id":"10156340474870354","commenter_b":"The Failed LIE of Multiculturalism is KILLING America. Low IQ Aborigines cannot uphold the Personal Responsibility DEMANDED. See Baltimore, DC, St Louis and Ghetto after Ghetto!","commenter_a":"Yes, yes!","post_message":"“I believe our country’s biggest threats come from within, from failing to address our incredible fiscal irresponsibility, by allowing our populous to become enemies with each other, stirring up hatred and strife within our country, by allowing education to take a second seat, by giving a lot of lip service but not actually taking care of it.\""},{"comment_id":"940104752760731","commenter_b":"She's above the law,obviously","commenter_a":"What the hell is going on that this person can trash our national security and still be running for office when she should be in prison! Martha Stewart went to prison for less crimes!!","post_message":"A leaked email from 2014 shows Hillary Clinton reportedly wrote to then-Obama counselor John Podesta that Saudi Arabia and Qatar are funding ISIS. @webpagelink"},{"comment_id":"1166911916662170","commenter_b":"Quit being a girl!!!!!!!!!","commenter_a":"People should remember that clearly there are innocent people in both jails and prisons. How would you like to be an innocent person in jail or prison, getting beaten up....with people cheering on further for you to be additionally brutalized?","post_message":"Inmates at New York's Clinton Correctional Facility say they were beaten, choked and slammed against walls by guards seeking information after 2 convicted killers escaped."},{"comment_id":"10154074583926159","commenter_b":"However Cruz is a natural born citizen always has been always will","commenter_a":"Absolutely....Cruz is the true conservative and is a constitutional scholar. Trump is all BS and bluster.","post_message":"Would you watch?"},{"comment_id":"10153275884859877","commenter_b":"Pigs don't eat pizza.","commenter_a":"It sounds pretty delicious but obviously racist.","post_message":"NY pizzeria apologizes for promoting racist ‘Pic-a-Nika’ pizza - but some of those ingredients are suspect. Grio fam, what do you think of the owner's response to the backlash? Do we believe his explanation for the \"mistake\"?"},{"comment_id":"10153828733732235","commenter_b":"LOL ... You people are so screwed up it amazing. You don't have to go to a fracking town to get raped ladies. Just go to any sanctuary city. There will be plenty of Mexicans willing to do the job that no American will do. LOL","commenter_a":"I have read about this .... disgusting .... assaulting women shows cowardice from these men ... shame, shame on them and the legal authorities!!","post_message":"This interview is heartbreaking."},{"comment_id":"1689857144590196","commenter_b":"I say do it, and take it even further....stop immigration altogether until a proper vetting system is implemented!!!","commenter_a":"It is unAmerican and wrong to have different rules for people of another religion. Have we really come to this? We are a free nation of fearless people, this is an insult to our national character. Trump would use that fear to further his own short term goals and incidentally the long term goal of ISIS to drive a wedge between Muslims and the rest of the world.","post_message":"Republican candidates are set to take the stage tomorrow for the final #GOPDebate of 2015. So, what do Donald J. Trump's friends think of his proposal to ban Muslim immigration to the U.S.?"}]
