[{"comment_id":"821190501249706","commenter_b":"just his type, they can have fruit loops together","commenter_a":"Yeh but our leader will meet with a woman eating fruit loops in a bathtub! !! POS","post_message":"The White House is FURIOUS with Boehner for breaking protocol! Looks like somebody doesn't like the taste of their own medicine!"},{"comment_id":"913170958829660","commenter_b":"@username Now suck on that and go vote for that murderer her name is clinton.","commenter_a":"No i don't support ending it ,it is a aganist the law they should be lock up.","post_message":""},{"comment_id":"1754805464735210","commenter_b":"You are a dumb whore","commenter_a":"I don't know if she's the MOST qualified (Al Gore), but she's way more qualified than the joke running on the Republican side.","post_message":"Obama: Hillary Clinton is the most qualified presidential candidate in history Just weeks after pledging his support for Hillary Clinton President Barack Obama has said the former Secretary of State is the best possible candidate ever for the White House. Do you agree?"},{"comment_id":"421180878069520","commenter_b":"^^ this idiot supports sanctuary cities and providing safe harbor to illegal alien criminals","commenter_a":"Hillary belongs in prison.","post_message":"More than $400 million has poured into the presidential race so far."},{"comment_id":"10153653064325575","commenter_b":"Please get rid of this POS","commenter_a":"100% pathetic - Trump 2016 !","post_message":"Talk about OUT OF TOUCH!"},{"comment_id":"10155028093604826","commenter_b":"Use to be entertaining...fun .. a great time to get together with friends...now its just another political platform and a lot of disrespect in the name of freedom of speech. I will be exercising my freedom to not watch it","commenter_a":"Falcons but I won't be watching. Totally lost interest.","post_message":"Question of the Day: Who do you think will win the Super Bowl?"},{"comment_id":"10152538895247014","commenter_b":"Suck his dick already","commenter_a":"I bet his pay didn't get any cuts","post_message":"In his state budget proposal, Gov. Doug Ducey announced some big cuts to the state's universities. Now, the Board of Regents responds."}]
