[{"comment_id":"10154015266906028","commenter_b":"Clearly you have ignored the riots that occur when sports teams win. Those are primarily white. It's incredibly difficult to understand any point you're trying to make, simply because you make no sense. @webpagelink","commenter_a":"Cops die on a daily basis stopping crime and just because there is some bad cops you assume all of them are bad ? What are you doing San Francisco 49ers Colin Kaepernick what are you doing to keep people safe or stopping crime ?","post_message":"After some fans took to social media to burn the jersey of the embattled quarterback because he refused to stand during the national anthem, photos of Colin Kaepernick's socks have surfaced and riled people up again. @webpagelink"},{"comment_id":"10153495487996770","commenter_b":"It's never a joke untill they come for you, then you want to cry, I'm just joking. So is that prison cell dumbass.","commenter_a":"This is just another instance, where Obama should be stepping up to this kind of talk!","post_message":"A #BLM sympathizer posted \"Death to all White Cops\" on Facebook but was completely unprepared for what immediately happened next. Then she did something even dumber!"},{"comment_id":"10154530088657908","commenter_b":"Ginny Gruhler Vanderhoof You are a very dishonest person \"Sanders battled over veterans issues as chairman of the Senate Veterans Affairs Committee from 2013 until early this year, giving him an easy pitch to a crucial voting bloc of veterans, particularly in South Carolina where veterans make up more than 11 percent of the voting-aged population. There stiff competition for these voters, with front-runner Hillary Rodham Clinton wooing them this month during a round table in Nevada. Even the leaders of veterans groups who praise Sanders acknowledge that the 73-year-old Democratic socialist isn an obvious champion for the flag-waving set of former military officers and enlistees. When asked if the Veterans of Foreign Wars, which recognized Sanders with its Congressional Award in March, had ever bestowed the honor on a socialist before, the group Washington executive director, Bob Wallace chuckled a bit. . No. No, said Wallace, a man who ...","commenter_a":"Why does Hillary think she can get anything done? We've seen how the congress works now. Even if the Democrats re-take the Senate, we still won't have the radically gerrymandered House until 2020. It will be nothing but stonewalling until then. That and attempts to repeal the ACA are all the GOP reps remember how to do. Plus, they hate her with the fury of a thousand suns. They'll waste all their time and hundreds of millions of taxpayer dollars investigating her for anything they can think of until they can figure out some way to impeach her as well. She's not getting anything done. But if Bernie is the candidate, and he is able to continue to energize his massive voter base, then suddenly we have a shot at taking the entire congress back and getting something done. Bernie will bring far more folks to the polls than Hillary ...","post_message":""},{"comment_id":"994057867406695","commenter_b":"3 americans tried to blow up a mosque in Kansas. No coverage here","commenter_a":"This is why we should NOT bring anymore refugees here and should return the ones that are here. We NEED to take care of our Americans first!","post_message":"An Iraqi refugee who planned to blow up two malls in Houston pleaded guilty to trying to help ISIS. @webpagelink"},{"comment_id":"1250106475030208","commenter_b":"There actually is a move to get women to sign up for the draft right now (though it won't matter because there will likely never be another draft) But you wouldn know about that because the draft is one of the only things meninists have to bitch about. But","commenter_a":"Why arent feminists fight for equal representation in sanitation? Or equal representation is crab fishing? Or equal representation in the draft. Women should sign up for the draft #genderequality","post_message":"\"But in order to help, those of us who do understand have to know what women are up against.\""},{"comment_id":"1162368457165867","commenter_b":"CORRUPT - I GUESS CLINTON HAS SOMETHING ON YOU!! KARMA - I HOPE PEOPLE SEE THROUGH YOUR CONSPIRACY FOR HILLARY.... I AM GOING TO CALL TO BOYCOTT UTAH","commenter_a":"who, whit ,where ??","post_message":"Could Evan McMullin be the next President of the United States? Full story: @webpagelink"},{"comment_id":"1105423922847469","commenter_b":"Bitchhhh","commenter_a":"@username best of the world's ladies !!!!","post_message":"This isn't who we are, and it also isn't how we keep America safe."}]
