[{"comment_id":"10153076452609705","commenter_b":"They look overfed. People need to cut back on the amount they feed manatees.","commenter_a":"This is only 40 miles north of my house. Heading up Saturday to see them","post_message":"A storm is coming. A storm of manatees. Prepare."},{"comment_id":"1390094244343935","commenter_b":"I hope she does. Even easier for Trump to win","commenter_a":"No I don't. There are other qualified people.","post_message":"Want to see Elizabeth Warren on Hillary Clinton's White House ticket? It might not be so easy."},{"comment_id":"975573942535660","commenter_b":"I'm not American but,I live here and I love to live here!And Hope to be in army or something one day I think dems are so much smarter! Let's go dems!","commenter_a":"brain dead","post_message":"RIGHT ON! Bernie just hit it out of the park at the Democratic debate when asked if he's a capitalist."},{"comment_id":"10153626364206600","commenter_b":"I was TAUGHT the same thing you were taught growing up catholic but instead of just taking someone's word for it I decided to go read Gods word for myself and guess what? There are several people in the bible that God forgave for murder. Instead of just taking what your priest says and running with you you shoujd go read the bible and see what GOD sYs about it. It the end it's His opinion that counts.","commenter_a":"Murder is a sin.....abortion is murder. I have no respect for this pope.","post_message":"Pope Francis has made a major change in the way the Catholic Church treats women who have had an abortion."},{"comment_id":"10154131291436756","commenter_b":"Dinosaurs eat man. Woman inherits the Earth.","commenter_a":"God creates Dinosaurs. God destroys Dinosaurs. God creates Man. Man destroys God. Man creates Dinosaurs.","post_message":"\"God made man, man rejected God, and God won't stop chasing man until he wins him back. And that's the simple story of God\" — the very story Franklin aims to tell with his music, without all the rules of religion."},{"comment_id":"918831531585696","commenter_b":"Abd the dems preach tolerance but are hnwilling to be tolerant.","commenter_a":"Democrat,s = cult being lead by a zombie . Set devour America","post_message":"Just in..."},{"comment_id":"1803705829897591","commenter_b":"@username and she wasn't wrong. They are deplorable.","commenter_a":"I am a Hillary supporter but instead of casting blame she should've been a better candidate. She should've visited more cities and counties and not just the ones that she thought would've secured her the election. She shouldn't have insulted the American people and expect that they were going to magically convert to her side by debating Trump. Yes, the FBI director and the emails definitely contributed towards her loss but maybe if she didn't have major corporations and banks and foreign countries on her payroll she would've won. Edit: To everybody saying that I'm not a real Hillary supporter or that I'm a troll/not a real person. I voted for Hillary so if that doesn't show my support then I don't know what will. Because just like you can love/support your children/parents but not agree with some of their beliefs or with some of the things they do, you ...","post_message":"Breaking News: Hillary Clinton cast blame for her loss on a decision by James Comey, the FBI chief, to revive an email inquiry ahead of the election."}]
