[{"comment_id":"10154298865889099","commenter_b":"Smh","commenter_a":"Jessica Milla","post_message":"\"Her ribs are broken. He beat her ribs and breast saying her milk was useless and she was worthless,\" the woman's mother said. \"He tried to blind her so she couldn't see her baby, he tried to make her deaf so she couldn't hear him crying for her.\" WARNING: Some may find the images in this story disturbing. @webpagelink"},{"comment_id":"943135932412822","commenter_b":"Shake those lady lumps","commenter_a":"Hump on a Hump!!!","post_message":"He denounces the idea of marital rape as 'made up by European people'"},{"comment_id":"1826145551000226","commenter_b":"What the hell are they trying to accomplish??? They are so delusional... and if he is not your president get out!!! Christianity went out the window when we put a Muslim in over 8 yrs ago...","commenter_a":"If you dont like it move up north.free everything up there","post_message":"Anti-Donald Trump protesters marched downtown Denver Thursday night. (WARNING: This was a live feed and there may be profanity)"},{"comment_id":"1005002076233312","commenter_b":"We do but not you please.","commenter_a":"She doesn't have a heart","post_message":"Do you agree with Hillary Clinton? #SCPrimary"},{"comment_id":"1300941689949097","commenter_b":"She is to evil to regret anything !","commenter_a":"Angela merkel is romancing with muslims. She will regret later","post_message":"CAN THERE BE A DUMBER COUNTRY ON THIS PLANET?"},{"comment_id":"10154021550142377","commenter_b":"I see three women who should no longer be Senators!","commenter_a":"We have our own problems to solve. stop sticking your noses were they do not belong !! No other nation has made this kind of statement !!! $6Tril we spent and we have nothing except dead soldiers !!!","post_message":"Republican Sens. John McCain and Lindsey Graham have issued a blistering condemnation of the failure of the United States to act to prevent the slaughter of hundreds of thousands of people in Syria."},{"comment_id":"10154254205206179","commenter_b":"Yes, the man who was accused of racism 30 years ago despite being a legal champion of civil rights when it mattered, showing he can actually put personal beliefs aside and do his job when it counts. Can't have someone like that as attorney general. He might actually enforce the law.","commenter_a":"She knows the rules. . She was warned. . She broke the rule. . She was disciplined. . The rules are arcane, but then crying cause y'all don't get your way, well please! #growuppeople","post_message":""}]
