[{"comment_id":"519056438282649","commenter_b":"cair can go to hell","commenter_a":"Our country. .USA..AMERICA","post_message":"PLEASE SHARE AND HELP PROTECT OUR VETERANS!"},{"comment_id":"1069182599857726","commenter_b":"Fine, you'll never get another cent! You bitch or butch or Satan worshiper!","commenter_a":"Their coffee tastes like shit anyway.","post_message":"Starbucks CEO takes hard stand. They just lost our business forever. Will you go somewhere else to get your coffee from now on?"},{"comment_id":"606991596121137","commenter_b":"BLUE LIVES MATTER ! AMERICA SAY'S LOAD THEM UP , HEAD THEM OUT ! NO MORE ILLEGAL IMMIGRANTS BY AIR , LAND OR SEA ! NO MORE NICE GUYS , WE NEED THE RIGHT GUY TO GET THIS JOB DONE ! TRUMP IS THE ONLY CANDIDATE THAT WANTS TO DO THIS JOB / THAT CAN DO THIS JOB , VOTE TRUMP ! BUILD THE WALL AND NEVER FORGET WHAT verry husINsein oBUMa , Killery AND THE DEMislamOCRAPS HAVE DONE TO AMERICA ! PASS IT ON !! MAKE AMERICA SAFE AND GREAT AGAIN , IT'S YOUR VOTE FOR TRUMP THAT WILL MAKE AMERICA SAFE AND GREAT AGAIN !!! THERE IS NO PLACE FOR SHARIA LAW ANYWHERE IN AMERICA , THE CONSTITUTION IS THE LAW OF THE LAND EVERYWHERE IN AMERICA !","commenter_a":"Mr. Trump has this vote locked down in Florida ... hopefully the senators will get back to work soon because Mr. @username starts work on day 1... congress would be smart to have legislation ready to go across his desk","post_message":"GOOD MORNING AMERICA! New CBS poll just released. A strong indication that we are on our way to MAKING AMERICA GREAT AGAIN! Lets keep up the momentum, and have a great day!"},{"comment_id":"10153005489041770","commenter_b":"And who says this female is not a partisan hack?","commenter_a":"This woman is an enemy to our country.","post_message":"\"There’s nothing more important to me as a Jew to ensure Israel’s existence is there throughout our generations.\""},{"comment_id":"1195653430467095","commenter_b":"This woman is trash","commenter_a":"You suck, big time.","post_message":"***FIRESTORM***"},{"comment_id":"10152920542711107","commenter_b":"Yes! Stop her!","commenter_a":"Yes","post_message":"Can you and I get 10,000 more signatures on Facebook? Over 21,000 of you have sent your \"Stop Lynch\" Emergency Fax Petition through Facebook -- and your voice is being heard loud and clear. Momentum is building against her confirmation thanks to your outpouring of opposition. In fact, two previously undecided Republicans announced their intention to vote against her nomination. But you and I can't stop now. As you know, Loretta Lynch has proven herself to be an advocate for the lawless conduct of the Obama administration and not an advocate for the rule of law. That's why I'm counting on you to keep the pressure on and urge my colleagues to vote \"no\" on her confirmation. Sign your \"Stop Lynch\" petition right away!"},{"comment_id":"934884219913515","commenter_b":"@username they were not prostitutes. Those were his pimps.","commenter_a":"TRUMPS ASS LOOKS BETTER THAN RUBIO'S FACE. RUBIO IS A DAMN SWEATHOG!!!!!","post_message":"Marco Rubio mocks Donald Trump's face..."}]
