[{"comment_id":"10153323281663854","commenter_b":"Only if she wants to end up 6 ft under, so he can be president again","commenter_a":"They can run together in the yard at Gitmo.","post_message":"NO JOKE: Democrats Are Now Calling for Hillary Clinton to Name Barack Obama as Her Running Mate…"},{"comment_id":"10153722838823984","commenter_b":"Pussy breath","commenter_a":"Through the key away","post_message":"A federal judge has ordered Kim Davis to remain in a jail cell until she agrees to issue marriage licenses to same-sex couples. The state is holding a metaphorical gun to her head, yet all she has done is stand firm in her conviction that marriage is between one man and one woman. Stand with us and sign the petition for Kim Davis to be released from jail immediately!"},{"comment_id":"10153617872056636","commenter_b":"Islam isn't but a lot of it's exponents use it as an excuse to kill.","commenter_a":"No religion is peaceful, it divides opinions which leads to violence.","post_message":"Show this next time someone claims Islam is violent"},{"comment_id":"1703284416593951","commenter_b":"Cruz pussy fake!","commenter_a":"Not true and you know it.","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"},{"comment_id":"10158155475600615","commenter_b":"Man baby. Strong women make them crazy.","commenter_a":"No surprise! We might respect the office of the President, but that's not \"carte blanche\" for Trump to do whatever pleases his whim.","post_message":"Check out these images from Women's Marches around the world."},{"comment_id":"1724806041088528","commenter_b":"@username don't be angry at @username because your ignorant.","commenter_a":"And THAT is why we need @username more than ever. With a life-long career of public service, having been a successful Senator and Secretary of State, and more than tough enough to continue the legacy of Obama, no one is more qualified. #Hillary2016!","post_message":"“The presidency is not an entry-level position.”"},{"comment_id":"10153088515381336","commenter_b":"Withdraw so we can finance the terrorist to attack isis....","commenter_a":"Oh, the ones he referred to as JV?","post_message":"President Obama is expected to announce in the coming days a modified plan on U.S. troop withdrawal in Afghanistan to help the country’s new government fight the Taliban and other emerging insurgent groups."}]
