[{"comment_id":"1784144245187941","commenter_b":"Oh shut up!","commenter_a":"If African Americans don't understand that they're being exploited and used for their votes by this woman, well then they'll get what they deserve after they elect her, a lot of nothing! So sad to see them falling for this. She's using a black rapper to pull in votes, amongst other things. Using a group of people for a vote is so wrong, nothing more. She's disgusting to do this.","post_message":"Hillary Clinton quotes Jay-Z during Cleveland rally: “Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.” Read more here: @webpagelink"},{"comment_id":"846327085437336","commenter_b":"How any woman could vote republican(step ford) is beyond me, but they need to turn off Fox and Friends. Lol","commenter_a":"I STAND WITH RAND! I am a woman that has worked hard to build a career and strong skill set and I have no complaints about my salary. I earn what I deserve based on what I have done for MYSELF. Women are not inferior, stop acting like it!","post_message":"Ugh. Senator Rand Paul announced his bid for the White House, and he's one of the most anti-woman politicians out there. If he thinks the war on women is over, he just doesn't get it."},{"comment_id":"1025383310891326","commenter_b":"Domestic terrorists!","commenter_a":"We need to bring the military to go against the Black Panthers they are a militant extremist group they are all converted over to Muslim and don't we have a problem with radicalized Muslims same as Isis this is a military action but of course we have a Muslim president that will do absolutely nothing but shift to new gun control","post_message":"Not a good sign."},{"comment_id":"367438390047230","commenter_b":"Devora Sexton and you are a cheap whore","commenter_a":"If a man's children and wife are a measure of him, Trump is a hell of a guy.","post_message":"Another reason Dems are terrified..."},{"comment_id":"10154232027346491","commenter_b":"Tom....amen","commenter_a":"PRESIDENT DONALD TRUMP, PRESIDENT OF THE UNITED STATES OF AMERICA...EVEN THOUGH obama DIVIDED MORE THAN ANY SITTING PRESIDENT... SHOW YOUR BIAS time mag...THAT'S WHY YOUR PART OF HISTORY, AND NOT FOR THE PRESENT !!!!","post_message":"How TIME Person of the Year runner up Beyoncé went from pop star to political force. @webpagelink"},{"comment_id":"10153350173059255","commenter_b":"Isn't that one of their anchorwomen?","commenter_a":"Most \"Sex Obsessed\" persons constanty ruminate about avoiding and policing sex.","post_message":"Really, guys?"},{"comment_id":"10153638033307377","commenter_b":"dumb@$$","commenter_a":"Sooooo, did Michelle Obama use any words that Laura Bush used? Hmmm a good listen.","post_message":"Bill Kristol, editor of The Weekly Standard, has delivered an eleventh-hour pep talk to Republicans."}]
