[{"comment_id":"981436531916095","commenter_b":"This is also the reason women live longer lol","commenter_a":"Why is it always men!?? Lol just proves us women are the wiser more clever sex","post_message":"Why you should never play with swords"},{"comment_id":"967879999960507","commenter_b":"Mr. Trump she is saying anything to get the Latino vote. She doesn't give 2 cents about any of those people.","commenter_a":"That's just insane!!!!!","post_message":"Do you believe that Hillary Clinton now wants Obamacare for illegal immigrants? She should spend more time taking care of our great Vets!"},{"comment_id":"10156475967855231","commenter_b":"@username That's nothing to brag about or feel proud of. Just makes you a parental fail.","commenter_a":"Art is seems to be tge type of jerk who would disown his gay child. Especially, a male child.","post_message":"He apologized, but let's be for real: does he really mean it?"},{"comment_id":"10154152289921957","commenter_b":"The woman is brainwashed!","commenter_a":"Why are these Muslims out of their country, If they're not happy with our system & law if they all go back where sharia law Is permitted everyone will be happy. Just go back and let the world be happy ,the rest of the world doesn't want sharia law. Don't go to other countries & try to convert to your beliefs, we are not interested at all, go back to your world. .","post_message":"The Women's March organizer thinks Trump is going to be oppressive to women and minorities.... as she fearlessly defends Sharia Law."},{"comment_id":"10153376841020329","commenter_b":"Lel bc cats was one of them","commenter_a":"Madeleine Chetcuti @username @username 33...","post_message":"Break a leg!"},{"comment_id":"536032629890369","commenter_b":"suck a dick","commenter_a":"@username du o daniel","post_message":"Piper the abandoned pig has a new home and a new best mate (via The Dodo)"},{"comment_id":"632124420311470","commenter_b":"Of all the garbage o n tv every night and they r bitching about this, cmon really! This right here is the reason we need to get rid of the shit in govt","commenter_a":"That's funny, Liberals complaining about a woman uncrossing her legs When has this been an issue for them? This is why liberalism equals hypocrite.","post_message":"Liberals want FOX News taken down after yet another wardrobe malfunction. This is ridiculous. FOX News hosts are classy, we support them! Do you support ALL FOX News hosts?"}]
