[{"comment_id":"10153190678386116","commenter_b":"this is why we dont let kids vote","commenter_a":"Little misdirected President can't do anything until the GOP congress recognizes there is a problem......","post_message":"Wow."},{"comment_id":"869514233108326","commenter_b":"Wendy please get an education","commenter_a":"And yet they are doing the same to the Palestinians","post_message":"'I could have faced a bullet for kissing Mengele's boots.'"},{"comment_id":"1137036859677480","commenter_b":"She is a nut case","commenter_a":"How many times must we see ..she is done..it's over..and the statement actually be true...","post_message":"BOOM!"},{"comment_id":"1129911067026242","commenter_b":"Well said my friend....well said!! Megan Kelly WILL tear them apart...no doubt about it!","commenter_a":"Oh trust me they are in for a rude awaking during this interview. Big mistake if they think it will be a walk in the park. Megyn Kelly will rip them a new one. She is awesome at her job and takes no prisoners. Fox News is the only station not on Obama's payroll. ( not that this has anything to do with him) but it's the only news station were you can expect to hear the truth!!!! Love Megyn and Fox!!","post_message":""},{"comment_id":"467018143488766","commenter_b":"Liz...please shut up and go help your sexual victims","commenter_a":"Why don't we just ban Muslims from the military","post_message":"Should Christianity Be Banned To Please Muslims? Comment 'yes' or 'no'."},{"comment_id":"1793816267524585","commenter_b":"Amy you should be ashamed for trying to get people to vote for that criminal!!! The things she's going to do to our country aren't going to effect you because you have money !!!","commenter_a":"I'd be much more concerned if I voted for someone who was indited and convicted of high crimes against the United States and humanity!","post_message":"\"Your voting history is public record.\""},{"comment_id":"10152929906987377","commenter_b":"Kendal , another stupid liberal !","commenter_a":"You're OUT, Bobby..!","post_message":"Bobby Jindal is calling for tougher gun laws."}]
