[{"comment_id":"10155891268485354","commenter_b":"Don't give a Shi# what race you are do something like this and it should be automatic death penalty!!!!!","commenter_a":"I'm surprised you can say \"black\" gangs. any one that can do that to another human should be swiftly executed for their absolute worthlessness to society.","post_message":"The gang of 6 forced \"the male victim to watch as his female companion was gang raped.\""},{"comment_id":"10153915045317434","commenter_b":"And like she's trying to get the fuck away.","commenter_a":"Am I the only one who thinks the second pic looks like he is going down on her? Oy!","post_message":"Enjoy some underwater pregnancy announcement pictures."},{"comment_id":"10156555816055354","commenter_b":"A radical muslim wants to kill you. A moderate muslim wants a radical muslim to kill you.","commenter_a":"Wake up and smell the coffee.","post_message":"This is what we're up against, gang..."},{"comment_id":"10153506145308690","commenter_b":"and one manyetanyahu or whatever is his name of israel","commenter_a":"Arrest Bush , Cheney , Blair , Rumsfeld and all the WarCriminals !","post_message":"\"I wanted SA to arrest #Bashir. Not because of ICC, but more to see the shock and fear in the eyes of all the other African leaders.\""},{"comment_id":"1392748740784870","commenter_b":"Uh, he mowed down 100's of people. Definition of terrorist. Congrats on breeding and raising a supreme loser of the highest magnitude. Obviously he got his stupidity from you, seeing as you don't know terrorism when it sprung from your loins.","commenter_a":"Why did ISIS wait long before declaring the attack !! because it was not an ISIS member !!","post_message":"Family of killer insist he's 'not a terrorist'"},{"comment_id":"10153232887939071","commenter_b":"@username she's a bad asss","commenter_a":"Zelal Tas","post_message":"The Canadian model who is fighting ISIS in Syria says the terrorists are all cowards."},{"comment_id":"10153435267083352","commenter_b":"Sick woman!","commenter_a":"Grr.","post_message":"Lady Sets Out to Murder Two Moms, Take Their Babies, Then Tell Her Former Man That the Kids Are Twins From Him Her Scheme Goes Horribly Wrong and One Baby Dies"}]
