[{"comment_id":"1487874397904733","commenter_b":"A vote for stein is a vote for trump. Besides,google her. She is no prize!","commenter_a":"If any Bernie supporter will support Trump after reading this, they were never a Bernie supporter. If they say they will vote for Stein, they are not a Bernie supporter. Bernie was an independent. He got into this race as a democrat because he said A 3RD PARTY CANDIDATE CANNOT WIN.","post_message":"Wow, he went there."},{"comment_id":"10153366169796336","commenter_b":"This chick is STUPID!!!!!!","commenter_a":"Now all the blacks who have been passing themselves off as white will come forward to get media attention!","post_message":"\"She's been white all the way up until 2011, when she started to change the way she looked with the clothes she wore.\" Rachel Dolezal's brother joined \"The Kelly File\" to address his sister's recent claims to reporters."},{"comment_id":"10154045189272169","commenter_b":"Farmers are already having trouble finding people to work. A lot of illegals have left this country and Americans won't do the work, so there are places that crops are just sitting and going to waste.","commenter_a":"Illegal workers should go back to their own country.","post_message":"Farmers markets are everywhere. But do laborers see benefits? (From PBS NewsHour)"},{"comment_id":"1702569516701619","commenter_b":"Soetoro the ineligibles wife did do that! But why are the D traitors who condone it with NFL players so upset??","commenter_a":"Oh yeah would of never heard the end of it.","post_message":"Oh, how they would SCREAM! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1353412211336912","commenter_b":"Women outlive men because they don't marry women!","commenter_a":"Good grief, it's been known for eons that women have greater endurance, etc., etc. I'm reminded of a book written in the 1950s by noted anthropologist Ashley-Montagu, entitled \"The Natural Superiority of Women.\" The male anatomy excels in only one area: upper body strength, a left-over from prehistoric humans. Ashley-Montagu is not by any means the first to recognize and write about this. It should be obvious to anyone, really, when you recognize that, despite the physical ravages of child-bearing, women live longer than men.","post_message":"Questions about Clinton’s health just won’t go away — partly because they fit so neatly with longstanding sexist tropes about women’s weakness."},{"comment_id":"10154296566836491","commenter_b":"Cristina Cojocaru","commenter_a":"I can do this.","post_message":"Prepare to be amazed."},{"comment_id":"10152876898775496","commenter_b":"Prayers for her son and family!!! The county and the contractors should be held responsible! There's no way a lifeguard should have his job if he can't swim or perform CPR! Ridiculous!","commenter_a":"Obviously the lifeguards should be able to swim and perform CPR but my question is more for the Mother ... Don't depend on other people to keep your kid safe in a pool ... That is your job as his parent ... Why are you do quick to blame another for your lack of responsibility in this? Just another story of needing to blame someone else ...","post_message":"\"The lifeguard told him that they couldn't swim to him, they didn't know how to swim, and one said that he didn't know CPR,\" See more: @webpagelink"}]
