[{"comment_id":"396542397200035","commenter_b":"And that's why Racism is continuing on!","commenter_a":"RACISM IS ALIVE AND WELL! However, I DON'T CARE. PEOPLE OF COLOR ARE MOVING UP! YEP! Moving on up. 👍👍🇺🇸😛","post_message":"One of the most dangerous myths about hatred of black people is that it will disappear on its own. Dylann Roof was born in 1994."},{"comment_id":"1339484486080508","commenter_b":"@username YOU ARE NOT SANE! HILLARY CAN'T FIGHT HER WAY OUT OF A PAPER BAG---SHE\"S A TRAITOR TO AMERICA.","commenter_a":"I'm a Trump fan, and these despicable lies about Cruz and the military are an idiot journalist's attempt to be relevant. Credible journalist? NOT! Immaturity at its finest!","post_message":"Mainstream media at it again."},{"comment_id":"1069291126441959","commenter_b":"WHEN DO WHITE PEOPLE GET TO TAKE THE COUNTRY BACK.......","commenter_a":"Rest well","post_message":"One of the Dallas police officers killed in the sniper attack has been identified as DART Officer Brent Thompson, 43. He is the first Dallas Area Rapid Transit officer to be killed in the line of duty. \"Our hearts are broken,\" DART spokesperson Morgan Lyons said in a statement. \"We have received countless expressions of support and sympathy from around the world through the evening. We are grateful for every message.\""},{"comment_id":"10153277843683352","commenter_b":"LMFAOOOOOOO black women stay losing","commenter_a":"Nothing is wrong with being ghetto and loud, you just gotta know when to show it!","post_message":"LADIES IF YOU'RE ALONE OR WITH A SORRY MAN! HERE'S WHY‼️‼️ #VALENTINES"},{"comment_id":"909973475802498","commenter_b":"When someone becomes president, their immediate family (wife and kids) need to be a good influence on the rest of the country.","commenter_a":"I'm for legalization personally. But until it is I follow the law.","post_message":"Oops?"},{"comment_id":"589266911222085","commenter_b":"I'll say it to your face, tough guy...but we all know that a pussy like yourself will never deliver!","commenter_a":"A lady I worked with told me the closest thing to a lesbian experience she ever had was kissing, a liberal beta male on a dare!","post_message":"This is just the best!"},{"comment_id":"10152869949930796","commenter_b":"I once had a panhandler tell me he was a wounded veteran who couldn't find work. Knowing that there are many homeless veterans (a shame of it's own that needs addressing) I decided to ask about his service record, branch, MOS, duty station, etc. Being from a military family, and having served myself, I quickly noticed that his story was bogus. Point being, many of these guys are fakes. BPD wasn't shaming anybody, just pointing this fact out.","commenter_a":"No apology necessary! Thank you for keeping us informed.","post_message":"“They are using the power of the written word and incorporating fear to get you to think the worst of your fellow man,” activist Pat LaMarche wrote of the Bangor Maine Police Department in a paper she handed out Monday by the police station."}]
