[{"comment_id":"1504505429602215","commenter_b":"Screw Obama and the muslim horse he rode in on.","commenter_a":"first time i,ve seen odummer with his head out of his obummer.","post_message":"The first marine national monument..."},{"comment_id":"10152573528821717","commenter_b":"Greg Abbott in Texas! POS!","commenter_a":"He really is quite the Gov, is there a secret contest between him and Walker to who can screw a state more?","post_message":"Click here to follow LGBTQ Nation on Twitter: lgbtqn.at/tw"},{"comment_id":"10154091586819160","commenter_b":"@username @webpagelink","commenter_a":"lets see BLM carry guns and shoot police and beat up on whites. Burn our flag and want to separarte from the union. These guy protested without hurting anyone and had our american flag with them. even the policeman felt safe with them around. BIG DIFFERENCE.","post_message":"Despite carrying assault rifles, the group says it didn't mean to \"start any problems.\""},{"comment_id":"10156296694950293","commenter_b":"If all the grandkids reproduce themselves it could happen.","commenter_a":"The will be you soon @username","post_message":"A sweet story this morning. A grandmother hangs nearly 70 stockings on her wall every Christmas. Tell us about the traditions your family has!"},{"comment_id":"1088954241145047","commenter_b":"To all the women bitching","commenter_a":"He paid 50,000 for it! It's his! You big fat sissys!","post_message":"The identity of the American man who lured a treasured African lion out of a national park, shot it, stalked it for two days, then beheaded and skinned the animal, has been revealed. He's a dentist from Minnesota."},{"comment_id":"10152558711931770","commenter_b":"When was the last time the Climate beheaded, butchers and burned to death with gas someone?","commenter_a":"what a goof","post_message":"The president compares climate change with ISIS..."},{"comment_id":"10153227996393812","commenter_b":"And feminazis want to be equal. Smfh","commenter_a":"Men can be abused too...","post_message":"\"Why is it so hard to see black and blue?\" #TheDress being used to fight back against domestic violence: @webpagelink"}]
