[{"comment_id":"10154083377471433","commenter_b":"Good keep your foreign diseases in your own countries","commenter_a":"Oh you mean the country that out right said ....\"Death to America\"??? WHO CARES!!!!","post_message":"BREAKING NEWS: Iran suggests it will limit issuing visas to American tourists in retaliation for President Donald Trump's ban on refugees from Muslim-majority countries."},{"comment_id":"1260055474038645","commenter_b":"Wonder who will pay her and the teachers salaries, and provide security and law enforcement if all the \"white people\" leave","commenter_a":"Have you seen it ? They can have it.","post_message":"Chicago Teachers Union Karen Lewis This City belongs” To Black People And Not White People."},{"comment_id":"1766246316922622","commenter_b":"@username don't be nervous I'll only use My 2nd Amendment if you were to try to come into my home & try to harm my Family. I'm a nice guy. Now you're saying that other country's are doing just fine without Guns? Lol NO NO NO!!! Do you see what the hell is going on in Europe with the Muslim invasion or did you forget to Mention that part? The Europeans are telling us NOT to ever give up our GOD Giving Right of the 2nd Amendment. There homes are being invaded there women & children are being Raped & the FUKIN Government are sitting back & watching it all OH & they now have a Muslim PM. Something doesn't smell right wouldn't you agree? Just like I said they take your guns so when they come like they're doing now in Europe you won't be able to defend yourself. ...","commenter_a":"You gun loving Americans are so funny. I will bet all I have, that if one of you ever find yourself in a situation like the one this douche bag is referring to, which 99,9 to 100 % of you never will, you and your gun won't do anything but piss your pants. Guns would not have stopped this, nor any other terrorist attack, just like guns isn't stopping anything in your country, quite the opposite in fact. You won't see european people from Copenhagen, Paris, Brussels or any other high risk cities demand a right to carry guns, because we don't want to, because we know it don't work and because we are not stupid. Trump is a freaking idiot and sadly many of you Americans are brainwashed and scared so easily. I really really hate using the over used and annoying word, sheep, but that is what you ...","post_message":"At the National Rifle Association convention, Donald J. Trump said the Paris attacks may not have happened if people had guns to take down the terrorists. @webpagelink"},{"comment_id":"10153828127059749","commenter_b":"\"...coming to a fridge near you.\" No! No it's not! I don't associate with those they of people!","commenter_a":"George had this idea decades ago in form of Pudding skin singles :D","post_message":"We have reached new culinary lows."},{"comment_id":"10154125251399726","commenter_b":"Trump quick build the wall!!! Try to stop them. There is nothing wrong with Ford investing where they want. It's a great big world. We used to lead it and WELCOME business and capitalism and now we just take and tax to DEATH. Maybe if Mexico has something like Ford, creating jobs, it could slow off the illegal immigrants.","commenter_a":"then tax the vehicles made in that plant","post_message":"Ford announced Tuesday that it is investing $1.6 billion to build a new plant in San Luis Potosi, Mexico."},{"comment_id":"1120443904657696","commenter_b":"Google Michael L. Robinson. Transvestite.","commenter_a":"Should say make the First Lady a LADY again. Take that Michael. Obama perpetrated the greatest fraud against America ever and will get away with it. You watch.","post_message":"Is this cartoon offensive?"},{"comment_id":"1707955089264613","commenter_b":"We have an American president now-thank god","commenter_a":"I wonder how quick INS would offer a job to an immigrant that came to this country LEGALLY? I'll be more than happy to deport the illegals.","post_message":"Entitled Immigrants Protesting Trump Are PISSED After They Just Got NASTY Surprise When They Showed Up To Work Today!"}]
