[{"comment_id":"10152999450927439","commenter_b":"This is so out of hand! what the hell are they afraid of! get them out!","commenter_a":"Muslim Brotherhood terrorists","post_message":""},{"comment_id":"1280033575423027","commenter_b":"She didn't say anything that hasn't been said before.","commenter_a":"The trouble with Trump is he doesn't his rallies long enough to study for the job he is trying to get elected to which is so important. Hillary has the experience plus she takes off for a few days to study what is going on in this country and around the world. Hillary gets an A+ and is definitely ready to take over the Oval Office on day one. Go Hillary!","post_message":"Another right-wing conspiracy bites the dust."},{"comment_id":"10156270295245354","commenter_b":"Illegals voting in California this should give the liberals some help. GO Trump !!!","commenter_a":"They focus on Gun Control, in the Debate, they will lose the Election","post_message":"Here's what's on deck for tonight's Democrat presidential debate..."},{"comment_id":"10153746372034607","commenter_b":"Lock them all up!","commenter_a":"But there is people out there committing crimes, just showing the blue and white power","post_message":"Police have corrected the total number of people arrested during the protests on Friday night to four people. Those individuals were arrested after they refused to move from the roads during demonstrations."},{"comment_id":"10153354510959714","commenter_b":"He technically could put kids in danger. His fans tend to be a bit over the top. One of those fan girls could and would easily shove someone out of their way to get near him without any thought given to whether or not the person they just shoved is ok.","commenter_a":"OMG I'm not a fan of the guy but u all are over reacting...putting the kids i danger seriously...how...he is not a terrorist he a singer...u all need to get a life...","post_message":"Justin Bieber totally crashed a prom, you guys."},{"comment_id":"1086205424749133","commenter_b":"where?","commenter_a":"For the most number of angry emoticons sent","post_message":"Watching the world-record-setting longest hoverboard ride."},{"comment_id":"10153199582481336","commenter_b":"IF YOUR BLACK YOU ARE FOR OBAMA AND NOT FOR OUR LAWS!!!! INVESTIGATE HILLARY CLINTON AND BENGHAZI AND ALL HER PAY OFFS AS SECRETARY OF STATE!! THIS WOMEN SHOULD BE IN JAIL AND YOU KNOW IT!!!!!!!","commenter_a":"Is she qualified? Or is it a race thing.... As the usual poop that osamabama does???? Really America, when will you take back your country? When he's given everything to the enemy, the one he won't name????","post_message":"“We can restore trust and faith, both in our laws and in those of us who enforce them.” Moments ago, Loretta Lynch was sworn in as the 83rd U.S. attorney general – the first African American woman to assume the position. @webpagelink"}]
