[{"comment_id":"610453139087868","commenter_b":"Fuck that arrogant asshole","commenter_a":"I hate this motherfucker.","post_message":"You piece of garbage."},{"comment_id":"10153003248257383","commenter_b":"And boot bitches like you.","commenter_a":"I wonder how many of you bitching about Audie Murphy are going to do something about getting him a day. He did a good job, told a good story, and Texas is proud of him. Get your panties out of a bunch and carry on.","post_message":"There is now an official 'Chris Kyle Day' in Texas."},{"comment_id":"10153015715557452","commenter_b":"Why leave him alone???? He is an admitted rapist! !!!!","commenter_a":"Leave Pill Cosby Alone.","post_message":"Three more women who were allegedly sexually assaulted by Bill Cosby came forward during a press conference Wednesday, bringing the number of accusers up to nearly 50. abc7.la/1N4Pq51"},{"comment_id":"10153618006223721","commenter_b":"But it all depends on your reason to carry. Most women who would carry a knife in their bra wouldn't need it because they can normally defend themselves better than most blokes.","commenter_a":"One more place to put my knife! Sweet. Sometimes I like to carry a couple, one in the pocket, one on the necklace and now a surprise bobbie blade heck yes! Though this was certainly a man's idea as no woman would go \"lets put something sharp next to my breasts and have it not be an underwire. This is going to be a selling point for women's active wear.\" When in the high thigh sheath for when I wear a mini skirt coming out? Not all skirts have pockets you know.","post_message":"Activewear with an extra punch. (via Glamour)"},{"comment_id":"495130020646953","commenter_b":"So work overtime so you can afford your eggs. Whining like a menstruating bitch with sand in her vagina isn't going to improve the situation.","commenter_a":"Fuck you MCdickbags watch egg inflation. Then this will make natural farm raised local eggs like $25 a carton","post_message":"McDonald's currently uses around 4 percent of all the eggs produced in the United States each year, around 2 billion eggs total."},{"comment_id":"10153458308386336","commenter_b":"He'll build housing for the illegals on it.","commenter_a":"this man should be named adolph hitler.","post_message":"Despite Republican resistance, Pres. Obama announced the creation of three national monuments, encompassing more than a million acres of protected sites in Nevada, Texas and California."},{"comment_id":"960686434063090","commenter_b":"Get her outta here!","commenter_a":"Take her off the air she is a bigot also joy you can see the hate in her face when President Trump is mentioned","post_message":"Whoopi Goldberg has been relentlessly gunning for Trump. He's had enough, and so has America. Should Whoopi Goldberg be kicked off TV forever?"}]
