[{"comment_id":"10155262254115725","commenter_b":"Well he's a she.","commenter_a":"I don't care what he does.","post_message":"Flash Survey: Does Hillary Clinton's use of a personal email account to conduct Secretary of State business hurt her potential presidential run? Vote here ---> @webpagelink"},{"comment_id":"867487780024323","commenter_b":". #TooChickenToDebate #ChickenTrump #ChickenShitTrump #ChickenHillary #ChickenShitHillary","commenter_a":"God bless you for being you Hillary.","post_message":"\"I have fought for the rights of women and girls here at home and around the world. It really maters whether women are treated with respect and equality, because when we do that, we are all better off, our economy is better off, our democracy is better off.\" —Hillary"},{"comment_id":"560003900832233","commenter_b":"Dont lose or give up your beliefs or faith..Those who seek to destroy your lives over a cake are the ones with deep rooted hate for anything good..And they want to call themselves victims of bullying..How perverted American have become when they hate their own and embarce filth as good..So busy hating Christians and not seeing that the Government have been taking yours rights away too..Hooray to the Muslims","commenter_a":"What's messed up is these people refused to back a cake for a gay wedding. The couple wasn't discriminated against. The kliens simply didn't want to participate in something they deem as sinful. How is that forcing their beliefs on them. So now they are out of business and the militant intolerant left made it happen. While our backward minded liberal pals are doing their best to persecute Christians at the same time and probably at this very moment Muslim bakers regularly turn away gays. These incidents do get reported but the liberal media refuses to report on them and the militant LGBT stay silent.","post_message":"A Daily Signal Exclusive: Bakers Facing $135K Fine Over Wedding Cake for Same-Sex Couple Speak Out"},{"comment_id":"741677189266873","commenter_b":"Really Rubio you must have a small dick. I feel sorry for your wife.","commenter_a":"Grow up, ! You are acting like a middle school boy.that is why you won't get anywhere","post_message":"Uncool. A new Rubio low...."},{"comment_id":"10152750349506130","commenter_b":"Wow your a dumb bitch","commenter_a":"All these comments about donating the dress are so retarded. If a bride can't afford a dress she shouldn't be having a wedding. There's enough poor people getting married and procreating which is gross lol get your own dress and she can do whatever the hell she wants with hers","post_message":"\"I knew that a pity party was the farthest thing from what I wanted or needed.\""},{"comment_id":"10155182239718984","commenter_b":"Go to hell BITCH","commenter_a":"Let the criminals out. Let illegals in. Let boys in the girls bathrooms. Condemn police officers. Persecute Christians. Don't care about the veterans. Pervert the children. Kill the unborn. Stomp on and burn the American flag. Accept barbarity in the name of Islam. Protect the Sanctuary cities. Cuddle the lazy. Encourage hate crimes. Destroy properties. That's the liberal way!","post_message":"Nancy Pelosi just dropped a lot of jaws with what she had to say about impeachment. Donald Trump will definitely want to hear about this..."},{"comment_id":"992725720849341","commenter_b":"Who cares what they want........I hope every single one of those sniveling, useless, A-holes leave!!!!","commenter_a":"Who cares","post_message":"They really don't want Donald Trump to be president."}]
