[{"comment_id":"1252850228086868","commenter_b":"Hang the bitch","commenter_a":"You all just racist that's why you all up all in trumps ass with his bull so take you all racist ass and do what you do best talk mess about real ppl. Trump going to blow your mind when he turns on you and do what's right","post_message":"Hillary Clinton is desperate these days and has even officially taken to getting down on her knees to beg the American people after Congress announced their next big plans for the corrupt Clinton – and the brutal nature of them has got to have Hillary downright horrified. @webpagelink"},{"comment_id":"1803705829897591","commenter_b":"@username and she wasn't wrong. They are deplorable.","commenter_a":"I am a Hillary supporter but instead of casting blame she should've been a better candidate. She should've visited more cities and counties and not just the ones that she thought would've secured her the election. She shouldn't have insulted the American people and expect that they were going to magically convert to her side by debating Trump. Yes, the FBI director and the emails definitely contributed towards her loss but maybe if she didn't have major corporations and banks and foreign countries on her payroll she would've won. Edit: To everybody saying that I'm not a real Hillary supporter or that I'm a troll/not a real person. I voted for Hillary so if that doesn't show my support then I don't know what will. Because just like you can love/support your children/parents but not agree with some of their beliefs or with some of the things they do, you ...","post_message":"Breaking News: Hillary Clinton cast blame for her loss on a decision by James Comey, the FBI chief, to revive an email inquiry ahead of the election."},{"comment_id":"10153639899983132","commenter_b":"She didnt make the show! Nene thought the show revolved around her, she cant handle the truth!","commenter_a":"Well that show won't last without her, I will not watch anymore.","post_message":"EXCLUSIVE: NENE LEAKES is leaving the Real Housewives of Atlanta but teases an exciting new project: \"I'm actually going to be doing a new primetime television show with a big legend.\" @webpagelink"},{"comment_id":"10152776078426051","commenter_b":"Bet she's sorry after all those dollars were raised for his support. Selfish woman.","commenter_a":"Too bad that she thinks more of her secondary family then she does your husband in her own child","post_message":"Remember the woman who forced her husband to choose between her and a baby with Down syndrome? Well, here she is."},{"comment_id":"909973475802498","commenter_b":"When someone becomes president, their immediate family (wife and kids) need to be a good influence on the rest of the country.","commenter_a":"I'm for legalization personally. But until it is I follow the law.","post_message":"Oops?"},{"comment_id":"1557321691221611","commenter_b":"karma is a bitch at times","commenter_a":"When is it anybody else's business! Tell them to butt out!","post_message":"Way to go mom!!!"},{"comment_id":"10156556593115725","commenter_b":"she looks hot","commenter_a":"Nando Martinez - SHE IS A DOCTOR - @username","post_message":"A doctor has been placed on administrative leave after a controversial video showing her violent scuffle with an Uber driver went viral -----> @webpagelink"}]
