[{"comment_id":"1181986708533713","commenter_b":"if they don't like it they should leave America. Sure mexico, africa, iran or even canada would take them.","commenter_a":"Exactly! Behavior like this is a major part of why Hillary and her supporters just lost the election! Protesting is good, but not when you're whining about a person who won an election fair and square just because you disagree with them.","post_message":"\"This is not helping.\" One Hillary Clinton supporter in Chicago said he was unhappy with how some of the the anti-Donald J. Trump protests were being carried out @webpagelink"},{"comment_id":"10153475368683984","commenter_b":"What in the hell is wrong with people like her. She should be deported fro America after serving appropriate jail time.","commenter_a":"Big shock.","post_message":"I can't believe THIS is what parents had their children doing while protesting the Texas pool-party incident... Shocking... Do you think what these parents did was outrageous?"},{"comment_id":"984777404931920","commenter_b":"Our weak border has made Mexico Drug Cartel stronger and made Mexico's government weak with corruption. Mexico has some of the most beautiful beaches in the world that are controlled by some of the most deadliest drug cartels. Mexico is losing billions in tourism because of the Cartel. Mexico is a culturally rich country that is being destroyed by these drug cartels. By building this wall it will help both the Mexican and the American economies by stopping drug trade. The Cartels will lose many because supply will be cut of and Mexico will gain strength. 95% of illegal drugs that come across the border will be stopped by a wall. It will in turn save our communities and our youth. Our youth will be able to flourish instead of turning to drugs. Americans will no longer have to depend on Liberal Politicians asking for help, they will be able ...","commenter_a":"Take away handouts and people committing welfare fraud and put them to work. Seems like there's quit a bit of places hiring where I live. I do believe trump is our our hope and is the best choice for president. Bernie is a joke and Hillary is a liar.","post_message":"I will bring our jobs back to the U.S., and keep our companies from leaving. Nobody else can do it. Our economy will \"sing\" again."},{"comment_id":"749889551868289","commenter_b":"damn bitch!!!","commenter_a":"Fuck that BITCH she has no authority to do anything the American people own the schools not your ugly f****** Muslim ass you're a disgrace to the American people and funny thing is you're on your way out you and your Muslim Brotherhood m*******f******","post_message":"Michelle Obama Banned Valentines Day In Schools She can't take love away from America's children. Do you think she is a horrible first lady?"},{"comment_id":"10154791254721756","commenter_b":"And cue the superficial bitch...","commenter_a":"He's ugly as fuuuuck though. Great actor though... Turkey neck goes gobble gobble","post_message":"\"It's a perfect role,\" Jeffrey Tambor says. \"... I thought I was gonna do Lear, but I'm gonna do Maura.\" Season 3 of Transparent comes out on Friday."},{"comment_id":"10153130276219071","commenter_b":"Want to know who fought against any and all mental health checks for firearm purchases? The ACLU and liberal groups...that's right...the ones screaming the most about \"guns\" are the ones with \"Blood on their hands\".","commenter_a":"All these gun nuts won't even consider the possibility of mandating thorough background checks before purchasing a gun. That's all that is necessary in my view. Instead they keep covering their ears and screaming \"taking away our guns won't change anything\". People wanting better gun control legislation don't necessarily want to take away normal/healthy/stable/non-criminals ability to purchase guns, we just don't want any psycho to be able to walk into any store and purchase a gun in 5 minutes.","post_message":"He says he's shocked that his son owned 14 firearms."},{"comment_id":"10155711262144657","commenter_b":"Yep!","commenter_a":"He already does......see Trumpsters have always had a direction to Trump.....we do not CNN Clinton news nerwork or any other left stream bias pieces of crap. This way we get the info before lamestream media manipulates it.","post_message":"Calm down, everyone."}]
