[{"comment_id":"902389386549543","commenter_b":"She is a fkn disgrace! #hilliaryforprison","commenter_a":"To all of you considering a third party vote or staying at home, facts show what that did in 2000. It gave us GEORGE BUSH. Remember Florida? Bush-2,912,790; Gore-2,912,253; Nader-97,488; Buchanan/Foster-17,484. Do the math. Please tell me, what good did that do? Are we way ahead of where we were 16 years ago? You know what Bush did. He appointed John Roberts and Clarence Thomas to the Supreme Court, gave us Iraq, Isisl and the Middle East, tax breaks for millionaires, FEMA during Katrina, the Great recession and the road to Trump. Read what \"Art of the Deal\" writer Tony Schwartz has to say about Trump and realize that it's better to have Hillary in charge while you use your outrage to build a party around progressives like Elizabeth Warren and Jeff Merkley. The unfortunate truth is, if you don't vote for Clinton/Kaine this year, we'll have Trump/Pence next year. ...","post_message":"\"Let’s go make history and elect Hillary Clinton the 45th president of the United States!\" —Tim Kaine"},{"comment_id":"10153471883581509","commenter_b":"Can we remove obese women who wear the wrong sized clothing and bathing suits? Tired of seeing leopard print spandex stretched to its capacity, duck faced selfies and moose knuckles. Help me retain my eyesight please FB.","commenter_a":"Or 'dirty' words, children can be confused.","post_message":"Facebook is getting super-specific about what is and isn't allowed on the social network. @webpagelink via CNNMoney"},{"comment_id":"875381432484713","commenter_b":"I dont know about you ladies but I sure dont want to see no 35 year old pop star.","commenter_a":"Kenya once again showed what a messy, ugly, and miserable woman she is. Claudia is Kenya's equally despicable sidekick. Demetria needs to grow a brain of her own. NENE LEAKES showed she is the Queen of RHOA. And Cynthia continues to talk tough, but if someone says boo to her, she will break down in tears when all is said and done. Phaedra was dead wrong for asking Demetria is she had done crack, but Demetria had one of the night's best comebacks with the 'all we have in common is the number 8'!","post_message":"“Your Clit Has Left Your Body!\" Phaedra's Shade, NeNe's Wrath and Claudia's Toes Are Unleashed #RHOA Ep. 10 @webpagelink"},{"comment_id":"1084748028260016","commenter_b":"@username like they said there would never be a GREAT WALL OF CHINA. There will be a wall!!!!!","commenter_a":"Oh my god, people keep talking about Trump's \"wall\" as if it's an actual thing. It's not a thing. It will never be a thing. It's just a distraction so people don't ask him about real issues that he has no answers for!","post_message":"\"At the start of my conversation with Donald Trump I made it clear that Mexico will not pay for the wall,\" Mexican President Enrique Peña Nieto tweeted in Spanish from his official account."},{"comment_id":"1004794989572137","commenter_b":"Bruno stfu you POG bitch","commenter_a":"Wtf is going on here? Don't you have pride and respect for the uniform you wear, for the veterans that fought many battles wearing that same uniform HOLY FUCK!","post_message":"The new Army drill and ceremony standard. #thanksobama ~Will"},{"comment_id":"689624227852673","commenter_b":"They're not ladies either but you don't have a problem with that.","commenter_a":"I agree with British spelling (and actually use it here in the states) except on two accounts- Aluminium and Ladybirds. That's crazy, they're bugs. Ladybugs. They're not birds. Birds eat them. XD","post_message":"The last weekend of October sees ladybirds swarm public spaces, people's homes and ex-footballers."},{"comment_id":"10153761646217439","commenter_b":"Dorrie America is a christian country. No one has to live under Sharia law unless they desire to participate. Women that are abused need to run to a shelter with their children ASAP.","commenter_a":"Brilliant and brave that Ben Carson would say openly what a majority of Americans are to afraid to say about Islam. Obvious to non-politicians what the incompatibility is all about.","post_message":"Carson is the first presidential candidate ever – or perhaps since Thomas Jefferson – to show a detailed knowledge of Islam and Sharia: “Right now,” he said about the possibility of a Muslim President, “when you have something that is against the rights of women, against the rights of gays, subjugates other religions and a host of things that are not compatible with our Constitution, why in fact would you take that chance?” Brilliant. Contrast those clear and simple and accurate words to the Obama administration’s systematic and deliberate denial of the nature and reality of the jihad threat. The entire Obama response to the jihad is called “Countering Violent Extremism.” Note the glaring absence of any reference to Islam and jihad. Obama is trying to fight a war while pretending that the enemy is other than what he is, or even worse, is nameless, faceless, and bereft of ideology. ..."}]
