[{"comment_id":"10154190661067541","commenter_b":"Now that's an ugly women","commenter_a":"Bannon you are a lot better looking than that thing in the left.","post_message":"Steve Bannon has a doppelganger, and her name is Rosie O'Donnell."},{"comment_id":"10154662722072619","commenter_b":"Stupid woman.","commenter_a":"Total anti-semitic bitch; She would march the Jews to the ovens if she could.","post_message":"Swedish FM drew outrage in Israel when she linked the terror attacks in Paris and the feelings of Palestinians."},{"comment_id":"10152903748937507","commenter_b":"Women really hate unborn children.","commenter_a":"Republicans really hate women!","post_message":"Sure, let's put pregnant women in jail. That sounds like an effective use of taxpayer dollars."},{"comment_id":"1205428982807783","commenter_b":"Actually our laws are being ignored, all illegals by law are to be deported and anyone who employs them face prison time if the current laws were enforced","commenter_a":"DONALD TRUMP It is a shame that a billionaire ...regardless of politics or party ...can walk in, fund himself and blackmail the political process.... Is this the future of our country only self-funded billionaires can run for president from now on? If that is the case then this is no longer a republic and we are no longer operating through a democratic process TRUMP'S IGNORANCE on the world stage will begin to be seen now. JUST WHAT DOES THIS MAN KNOW? He knows how to conduct business and DIRTY business deals He knows how to declare bankruptcy He knows how to be a GOOD ANCHOR HUSBAND who takes young women the age of his daughter who are NOT CITIZENS and provide them with $$$$$ and a pathway to citizenship... THAT IS WHAT HE KNOWS TRUMP continues to show the world what a racist pig he is SANTORM and CRUZ and ...","post_message":""},{"comment_id":"10155187026858984","commenter_b":"I caught the statements that's she was making. I'm glad she wasn't as blatantly shoving her opinion down people's throats as Beyonce did. I applaud her professionalism but I still find her and her music repulsive. On a separate issue, how does get eaten alive for her unoriginality? It's like she can't decide who she wants to rip off more, madonna or David Bowie.","commenter_a":"Anyone who knows the meaning behind This Land is Your Land knew she made a political statement. I don't think that was very many trump voters, though. Her subtlety is what was appreciated by them because they likely missed it and it allowed them to enjoy the show.","post_message":"Of all of the things Lady Gaga could have done during her Super Bowl halftime show, this was perhaps the most shocking... and the most unexpected."},{"comment_id":"1160749183945110","commenter_b":"Lol, the next president will be Hillary!","commenter_a":"One of candidate from these group will be the next president of United of America. The name of that candidate is ......................... ?","post_message":"Here's what some of the candidates have been up to."},{"comment_id":"10154493541114060","commenter_b":"Karolina Kulewicz yeyeee","commenter_a":"Congrats Daniel your city came second again! No shame in being runners up 😂😂","post_message":"1. Melbourne 2. Vienna 3. Vancouver"}]
