[{"comment_id":"10153095051856770","commenter_b":"\"please everyone\" stop paying attention to the talking pig.","commenter_a":"AMY you need to get out of your dad's shadow. He's an idiot. Just look at the death rate in every city the has very strick gun laws. If we did not count them in death by guns the United States would have the lowest death by fire arms than any other nation.","post_message":"Amy Schumer continues to advocate for stricter gun laws after a man opened fire and killed two people during a July screening of her movie “Trainwreck.”"},{"comment_id":"442004659257462","commenter_b":"Go home!","commenter_a":"The only thing that fat slob would bring to the White House is big-Big-Big Plate to feed his fat ass off of.","post_message":"Will Chris Christie's tough political style work in the White House?"},{"comment_id":"10153236342649255","commenter_b":"What can you expect from a LIAR!","commenter_a":"That's why I dislike Christians their not trustworthy.","post_message":"Lies. All of it."},{"comment_id":"1487251671334957","commenter_b":"That bitch could stick her face in dough and make gorilla cookies !!","commenter_a":"No matter what she wears it looks like it came off the rack at Walmart and she looks like aunt Esther. The only problem is us taxpayers are paying the big bucks for her to look like a curtain hanging over a big black window","post_message":"I'm SICK of my hard-earned tax dollars funding their lavish lifestyles!"},{"comment_id":"1544777802496810","commenter_b":"i smell a rat and it's not trump and his wife. ignore them,","commenter_a":"Are we still talking about this? Oh Glenn, you've lost your way!","post_message":"She has been done a grave disservice by somebody."},{"comment_id":"10150607537004999","commenter_b":"Each act of terrorism has its own agenda. Define the act.","commenter_a":"A hate crime is an act against someone or a group of people based on their gender, race, sexual orientation or religion. Terrorism is an attack in which the victims are not relevant to the agenda. Terrorism is a statement normally made towards a government, a hate crime is a statement towards the victim, it's personal. For me I think a hate crime is more horrific, to hunt and kill someone for being who they are. Terrorism is more of an act of a coward, a hail marry pass.","post_message":"\"Why can’t we own up to the fact that hate crimes are just another form of terrorism, perhaps the worst, since they target the weak among us?\" Read on in The New York Times Opinion."},{"comment_id":"10153542197218984","commenter_b":"This wouldn't be my daughter. First, they are in your country not theirs. They need to assimilate. This is why Muslims are taking over Europe. Read the book, \"While Europe Slept!\" Once we get a Christian president in the USA, the Muslims here will go back to their cubby holes. The Muslim president we have are giving them a very false sense of security.","commenter_a":"Unbelievable. They don't want to follow American customs, go back to wherever you came from.","post_message":"This school just ordered parents to make sure their daughters made Muslims happy in a sick way... this is full-on surrender. Spread this story... your children's school could be next!"}]
