[{"comment_id":"1038927489460337","commenter_b":"As for your statement about businesses being free to do what they want, I very respectfully suggest that you read some civil rights history. Businesses used to post signs such as \"Help Wanted--Irish Need Not Apply\" or of course Jim Crow laws. Would you seriously be okay with the return of Jim Crow? Businesses have discriminated in horribly blatant ways. Up until just a few years ago women weren't allowed to be members of all sorts of organizations even though there was nothing about the organization that was impossible for women (they were mostly golf and country clubs). We've had 50 years of the Civil Rights Act which people seem happy to toss out the window. If that were to happen, you yourself could easily be discriminated against with no recourse. Please read some civil rights history and see what incredibly horrible things were said and done to decent, hard-working ...","commenter_a":"I thought a private business owner reserved the right to refuse service to anyone for any reason. We have a sign up at work that says exactly that. I may think his is a dumb reason (even though to him it is not), but he is a private business owner operating on private property and should have the right to do business with whomever he wishes, and not do business with whomever he doesn't wish to do business with. That being said, I wonder what he'd say if he tried to go into a diner for lunch and saw a sign that said \"No Christians allowed.\"","post_message":"A Florida gun supply owner says his store is now a “Muslim-free zone” -- after the deadly shooting in Tennessee. Here's what an American-Islamic group had to say in response: kiro.tv/GunStore What do you think of the owner's actions?"},{"comment_id":"10154422219571509","commenter_b":"Guys it's an easy fix. Just vote for whoever is black in any movie that's how they want it","commenter_a":"I never watch that mess anyway. I do love movies but I'm not into Hollywood all patting each other on the back.","post_message":"When it comes to diversity at The Academy Awards, most Americans shrug their shoulders."},{"comment_id":"1033391136683934","commenter_b":"Dee I'm not a violent women, however I would love to bitch slap you. Sorry but I'm tired of idiots like Dee. Yes Dee it's called artificial insemination. I highly doubt anyone doing this would get an abortion.","commenter_a":"That MOTHER LOVING USED ASS WIPE thinks EVERYONE should WORSHI{_ HIS GODDESS, Ayn Rand, and that EVERYONE should be SELF-SUFFICIENT. Oh yeah, He is ADDICTED to TAXPAYER-FINANCED salary and TAXPAYER-FINSANCED health care. HIS ROTTEN KIDS would STARVE if he weren't a USELESS, WORTHLESS MOOCHEZR. Maybe HE would like to pay for all of the unwanted pregnancies.","post_message":"Did Speaker Ryan just go there on Planned Parenthood?"},{"comment_id":"1708300706077756","commenter_b":"Not true! The muslims were the problem then and they were stopped because the world won't lie down and let them take over.","commenter_a":"Even if this was completely true. That justifies what muslims are doing now. In this modern day & age. I truly believe this guy wants to destroy AMERICA.","post_message":"A complete fabrication. The crusades were carried out as a direct response to Islamic aggression. This is a 1400 year old problem..."},{"comment_id":"1203821629704699","commenter_b":"@username anybody can suck dick! It takes a real woman to recive the education that Michelle Obama obtained. Only because shes black? You mad cuz a black first lady has done what your mother couldn't do for this country! PLEASE! Haven't you heard in the news? Melania Trump won't even set foot in The White House. HAHAHAHAHAHAHAHA. and FYI! I mastered 3 foreign languages.","commenter_a":"Is she still ashamed to live in America? Where's MELANIA!!!!!","post_message":"Are you proud to have Michelle Obama as America's First Lady?"},{"comment_id":"10154578752917501","commenter_b":"How many actually paid attention and noticed that I was questioning the doctors- NOT THE WOMEN!!!","commenter_a":"I am ever in awe at the things they do at the Clinic. However, I have to wonder at the ethics. Performing a surgery that has major repercussions for the woman involved (anti-rejection meds, etc...) just so she can undergo pregnancy- which has its own set of dangers - seems ethically sketchy. There are so many unwanted children who need homes. Adopt.","post_message":"This is truly amazingThe Cleveland Clinic said the nine-hour surgery was performed on a 26-year-old woman, using a uterus from a deceased donor."},{"comment_id":"1539146466096818","commenter_b":"😁😁","commenter_a":"I am starting to think this entire administration was homeschooled by Betsy DeVos.","post_message":"Her (lack of) explanation left Matt Lauer flabbergasted."}]
