[{"comment_id":"10153671007817452","commenter_b":"@username if ur really going to have a discussion please don't start with \"then how is it that...\" When you focus on the trees rather than the forest, ur def lost. If you haven't done research on average income, crimes by income, distribution of resources to low income, then this is above your level of comprehension. Start with census and BJS","commenter_a":"“If Black Lives Matter was truly concerned about black lives, they’d be concerned about black crime.”","post_message":"From Atlanta to Phoenix, to right here in L.A., protests are growing across the nation after this week's deadly officer-involved shootings. But not everyone is happy that protesters have hit the streets less than 24 hours after the Dallas bloodbath that left 5 police officers dead and 7 others wounded. Tonight the tense scenes from coast to coast - at 11 from ABC7 Eyewitness News. @webpagelink"},{"comment_id":"1013896902039895","commenter_b":"News flash, illegals don't have state ID's or driver's licenses therefore they couldn't be auto registered to vote. Another case of a republican who pretends to be smart.","commenter_a":"So illegals can vote too? dirty liberals","post_message":"A victory for voting rights!"},{"comment_id":"10158604415035206","commenter_b":"@username The woman can speak five languages... get a grip","commenter_a":"I have never said anything negative about Barack Hussein Obama's wife, but since that's gonna be the new norm for the liberal lunatics, let me just say this. Melanie Trump has more class in her little finger than Michelle Obama ever had or ever will have. But just look at all the jealous women who are putting her down and all the worthless men with mangina's who are putting her down. You people are pathetic.","post_message":"“Melania will be an excellent first lady who will take Slovenian values of generosity, loyalty and trust to the United States and the world,\" said one fan from Melania's hometown."},{"comment_id":"764116903756422","commenter_b":"@username I don't see you birthing a baby out of your pee hole.","commenter_a":"I see all of these people shaming women for having an abortion, but it takes two. The woman just has to walk around with the evidence. So many are so quick to hold up signs and protest against a woman's choice yet we have so many unwanted children waiting to be adopted. Caring for children doesn't stop at a fetus. If you're going to protest and shame a woman for making, for some a very difficult choice, how about you go through an adoption process, pay for children's education and medical, etc. If you're not out there trying to adopt unwanted children, then you really shouldn't be shaming a woman for having an abortion or taking her right to choose. Perhaps if people and the government put this much attention toward education, and giving equal opportunities to all, we would have more successful people and less unplanned pregnancies.","post_message":"\"Women's health and rights are now one of the first casualties of the Trump administration.\""},{"comment_id":"10153364359422411","commenter_b":"Female castration","commenter_a":"What do they do about the women?","post_message":"A Republican from Alabama has introduced a bill that would require sex offenders to pay for their own surgical castration before being released from state custody."},{"comment_id":"499057813618132","commenter_b":"just a rich, fat, black bitch","commenter_a":"Sick idiot","post_message":"Oprah is going after white people on live television. The hypocrisy is overwhelming. We need to show her we're not going to stand for this. Do you agree Oprah is a racist?"},{"comment_id":"10154047243421990","commenter_b":"Your moms desperate.","commenter_a":"Out of all California, he gets a \"band\" from Hilmar, CA. I'm sure the musicians are talented but...LMAO!","post_message":"Who will be marching in Donald J. Trump's inaugural parade? Here's your answer: @webpagelink"}]
