[{"comment_id":"10153200362991943","commenter_b":"Cause she's sn idiot","commenter_a":"obama and his ilk will kill us long before the climate.","post_message":"Why is Obama EPA administrator, Gina McCarthy trying to scare Americans into believing \"Climate Change\" could kill them?"},{"comment_id":"1032567170171905","commenter_b":"Remove her ass from the team.","commenter_a":"We are glad you are unhappy here... Please feel free to hightail it home!!! You are an embarrassment to our country!!!","post_message":"Ibtihaj Muhammad - the first American Muslim to compete in the Olympics wearing a hijab - just went on a disgusting rant about how much she hates the United States. This is SICK..."},{"comment_id":"10155070762506037","commenter_b":"But the person doing the watching had intentions maybe","commenter_a":"Something sounds like she wondered off but someone had been watching her.","post_message":""},{"comment_id":"1022535797795443","commenter_b":"hahaha good one, and accurate.","commenter_a":"I flushed something more qualified than both of them this morning.","post_message":"LOL..."},{"comment_id":"1779395119015202","commenter_b":"So women have been successfully doing this for how long? Most cases of extreme pain can be resolved medically and if not that's why we accrue roughly 8 hours of sick time per month at standard full time jobs One cannot expect businesses to experience this loss of productivity and still want to retain female workers","commenter_a":"Emily Lynn Bowman","post_message":"(Note: Look at the women in the back left of this photo.)"},{"comment_id":"10153262313634497","commenter_b":"Alan there's no way for Cubans to legally immigrate to the US.","commenter_a":"Ted Cruz the Canadian born of a Cuban and an American that doesn't like immigrants.","post_message":"Texas senator Ted Cruz announced Monday that he will run for president in 2016. Here is what you should know about the first-term senator:"},{"comment_id":"10153247018494087","commenter_b":"Bad cars cause people to die so do the bad guns!","commenter_a":"Yes it is Donald! The libs are too stupid to realize it! Look at Chicago, the more gun control, the more shootings.","post_message":"“The gun laws have nothing to do with this,” Donald J. Trump said. “This isn't guns, this is about really mental illness. And I feel very strongly about it.\""}]
