[{"comment_id":"1028722620528934","commenter_b":"Much better than the lying Hillary or senile Bernie!","commenter_a":"And the other morons will vote for Trump.","post_message":"Americas Freedom Fighters"},{"comment_id":"953377128015374","commenter_b":"Should if ate a snickers","commenter_a":"Of course it has gone viral.","post_message":"A 21-year-old was charged with beating her so-called friend unconscious over a hamburger. (Graphic warning: Video includes fight)>> kiro.tv/HamburgerBeating “I’m more hurt emotionally than physically.\""},{"comment_id":"10156520680400354","commenter_b":"Atheists can suck my balls.","commenter_a":"Why do all the liberal atheists shit on Christianity on this page so often? Why don't you dis Islam? Why not any other religion? It's pretty pathetic that you join a conservative page with one intent, to act like complete dicks to anyone with a conservative or a Christian belief. Are you trolls being paid?","post_message":"Not EVERYONE is afraid to stand up and be counted..."},{"comment_id":"1727548687496080","commenter_b":"HILLARY CLINTON IS AN ARROGANT NARCISSISTIC SOCIOPATHIC LIAR AND VERY EVIL WOMAN !!","commenter_a":"Time will tell","post_message":"We'll see what ends up happening..."},{"comment_id":"718386484926627","commenter_b":"But as soon as they hit 18, they're prostitutes? Crazy how one second can change the definition... #ijs","commenter_a":"Please don't call under age girls child prostitutes. They are victims of being sold to sex traffickers, or kidnapped. They are victims, not prostitutes.","post_message":"It wasn't all fun and games on Super Sunday."},{"comment_id":"10152882517291051","commenter_b":"Just lie a Black woman to get defensive-----you have a crush on him? Michelle won't like it.","commenter_a":"A lot better the Barack Hussein Obama.","post_message":"The next time you meet someone who doesn't like their name, tell them about this guy and remind them that it could be worse."},{"comment_id":"939497619530050","commenter_b":"She is a she!!!!!","commenter_a":"People can't see that this is a case of mental illness. I'm all for freedom of expression, but this is a cry for help.","post_message":"He calls it beautiful. You might call it disturbing. He removed his ears, tattooed the whites of his eyes, and did lots more in his transformation from Robert Hernandez to Tiamat, the Dragon Lady."}]
