[{"comment_id":"10156238965050354","commenter_b":"Hillary isn't change She is Washington She is the establishment Everything that is wrong with America Is what Hillary represents!!!!!!","commenter_a":"Are lawmakers going to allow themselves to be sued when a citizen is killed because they can't protect themselves?","post_message":"DEVELOPING..."},{"comment_id":"10153932069946523","commenter_b":"Lana Gonzalez @username I changed it just for you guys feel better now","commenter_a":"This is irrelevant and does not Justify his life being taken !!!","post_message":"Bryan Polcyn - FOX6 Investigators - did a little digging on the criminal past of Sylville Smith. Take a look."},{"comment_id":"10153212114294087","commenter_b":"You're a vile fucking stupid bitch.","commenter_a":"this Pope is insane he's the worst one ever he says blasphemous stuff no wonder that idiot Obama ass licker biden likes him","post_message":"Joe Biden: \"I admire Pope Francis deeply and I'm excited about his upcoming visit. Pope Francis has become a moral rudder for the world on some of the most important issues of our time, from inequality to climate change.\""},{"comment_id":"1362231057136004","commenter_b":"Why should prayer bother an atheist? Bc deep down they know that God is real.","commenter_a":"Keep standing up for God, no matter what anyone says.","post_message":""},{"comment_id":"10154838337948797","commenter_b":"Mask? How did a hijab become a mask?","commenter_a":"Religious garment is to be used at church. As she lives in America she must take off the mask, is better for her to wear a miniskirt on this hot weather","post_message":"SOUND OFF: A woman wearing a hijab was asked to leave a Family Dollar store because of her Muslim face veil. When she protested that it was a religious garment, the manager explained that it is a high-crime area and the store gets \"robbed a lot. Was the store manager right in kicking her out? How would you have handled the situation? The best responses will go on air!"},{"comment_id":"10152954070746336","commenter_b":"She is an idiot","commenter_a":"More hot air.","post_message":"In a speech at the The Brookings Institution on Friday, Obama's National Security Adviser Susan Rice said while ISIS is dangerous, it is not a threat of \"existential nature\" like World War II or the Cold War. @webpagelink What do you think of her comments?"},{"comment_id":"10153306552824087","commenter_b":"Good question Eli Richardson Why do straight liberal females have a problem with men using their facilities?","commenter_a":"Even though that has never happened in the couple hundred cities that already have such protections. My city (also in Texas) has had it for 6 years, never a single issue. It's pure hate of trans people. It's transphobia that drives countless people to suicide. It's unacceptable.","post_message":"The Houston Equal Rights Ordinance became better known by detractors as the “bathroom ordinance,” after opponents warned that some protections related to the use of public bathrooms would allow sexual predators to go into women’s bathrooms."}]
