[{"comment_id":"10152522846320163","commenter_b":"She look real old","commenter_a":"I understand you wanna be different usher but pleases you should've stayed with Chili at least she's older but don't look it.","post_message":"It’s Official: Usher is engaged to longtime girlfriend Grace Miguel... check out her gorgeous ring here @webpagelink"},{"comment_id":"1415259475160745","commenter_b":"Nobody hates better than feminists.","commenter_a":"The hate is real from the Internet warriors lol. So many people driven by hate... I wonder if poked if they would ooze black.","post_message":"Is this what a feminist looks like?"},{"comment_id":"990509770989495","commenter_b":"Any organization with 200,00members is not a church.","commenter_a":"This is what gives religion a bad name.","post_message":"Did Jesus Christ need a private jet to spread his word?"},{"comment_id":"10153633737712464","commenter_b":"Go Cruz go. Tell the facts and let the media put a liberal spin on it. Planned Parenthood was meant to be racist by stopping more poor from the welfare rolls. \"HA!!!!\" They will say,\"It was an attempt to keep the Black Community from expanding the Voters Rights', or something like that. That's why Planned Parenthood buildings are in poor economic ares and not down the street from the $600,000-2 million dollar homes. Don't have to waste the fuel bills on buses that far out. Economics for the city. See it's not about lives. IF \"BLACK LIVES MATTER\", why is there even a dialogue about the killing of souls.","commenter_a":"Smarti - I aam not really interested in PP and I am sure you are looking up everything you can find to repudiate what Cruz says. Good for you if you think PP is on the up and up. I just don't understand paying all that money when it is not a gov operation. If it is a private business - great - let them fund themselves, don't use our money to help pay$ 600,000 salaries along without mentioning all the other expenses. I read $1.2 mil spent on things other than women's health. I really don't care about that stuff. I am more interested in what is going on in Syria etc.","post_message":"It says something about just how corrupt this administration is that there is not a soul on earth that believes the Obama Justice Department would even begin to investigate Planned Parenthood."},{"comment_id":"10152850999936813","commenter_b":"One thing that strikes me is how people obsess with the LGBT. For some reason it's \"all the Gay's fault\". If only we could get rid of them, all our world's social problems will be solved. NOTICE: YOU DO NOT SEE SIGNS SAYING: \"ADULTERERS/CHEATERS, WIFE BEATERS, ADDICTS, RAPISTS, CHILD MOLESTERS, LIARS, THIEVES, TERRORISTS, CORRUPT POLITICIANS & PASTORS WILL NOT BE SERVED OR ARE NOT WELCOME IN THIS STORE\". NONE! It's always the Gays....","commenter_a":"Actually let small businesses post these types of signs. This tells me to take my dollars elsewhere!","post_message":"Tennessee hardware store owner hangs a “no gays” sign in the front window. It's 2015, not the 1950's. @webpagelink"},{"comment_id":"10155026342853147","commenter_b":"She is a slob","commenter_a":"Clueless no talent idiot.","post_message":"Pop star Pink attacked President Donald Trump for “stripping our humanity away”"},{"comment_id":"1024646927570802","commenter_b":"What RUBBISH!","commenter_a":"Reality is that even if you consider it a minor incident, which it appears to be, the trumpster and his campaign manager lied about it, and are still doing so. He doesn't apologize. He doesn't ask for forgiveness. See a pattern?","post_message":"WATCH: Florida police have released surveillance video showing the incident between Donald J. Trump's campaign manager Corey Lewandowski and reporter Michelle Fields. Trump's campaign issued a statement calling Lewandowski “absolutely innocent” after he was charged with misdemeanor battery. @webpagelink"}]
