[{"comment_id":"486290274888721","commenter_b":"Bernie sit yo old ass down u is not gonna win nother","commenter_a":"it's beneficial being educated in this!","post_message":"There is a BIG difference!"},{"comment_id":"10154780331641072","commenter_b":"Nm wait for her to have this baby lmfao","commenter_a":"Exactly Kelly","post_message":"Giraffe Watch: Is today the day? April the giraffe at Animal Adventure Park is expecting a calf anytime. More: on.kgw.com/aprilgiraffe"},{"comment_id":"1183868738313543","commenter_b":"I'd rather have my daughter use the restroom with these people:","commenter_a":"Before you know it they will be in your kids public restroom if they aren't already, thanks to the new laws.","post_message":"UPDATE: The Winter Haven Police Department arrested 22-year-old Adam Timothy Tharp after he was caught flashing a 7-year-old girl at a Polk County library."},{"comment_id":"10155178808719411","commenter_b":"she so fine would have her sit on my tongue on the day lee","commenter_a":"Ok, so protests are Ok but protesting against the former protest is \"not Okay\".. Double standards imo.","post_message":""},{"comment_id":"10154465806735530","commenter_b":"NO! Please God, NO!!!!! Don't come here!","commenter_a":"These comments certainly prove how classy and educated Trump supporters are, lol.","post_message":"Hillary Clinton will be in metro Detroit next week. @webpagelink"},{"comment_id":"1552392261455878","commenter_b":"You forgot to show the filthy, disgusting women in vagina costumes.","commenter_a":"I'm sick of vagina.","post_message":"Congratulations to the women marching around the world today. We will not go back to the days when women had to risk their lives to end a pregnancy. The decision to have an abortion must remain one for a woman, not the government. And we will not go backward to a time before Planned Parenthood, when millions of women had no access to birth control or cancer screenings. We must go forward to ensure full reproductive justice for all women."},{"comment_id":"10153750780819062","commenter_b":"Why would you trust two gals that looked like that for anything cosmetic?","commenter_a":"Hope they catch them","post_message":"Police have issued arrest warrants for two people in connection to the death of a woman who police say received injections of a substance in her buttocks in a botched cosmetic procedure."}]
