[{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"},{"comment_id":"1745001682421383","commenter_b":"Just when I think I had seen stupid, I look at a news feed like this, and all you libtards take stupid to a whole new level. All you lazy Daisy's don't want Trump in because your welfare checks will go away, and a you illegals will be deported home to build that WALL!!!!","commenter_a":"Trump is hammering her, love it! All she can do is smile & laugh because she has nada","post_message":"\"I will release my tax returns – against my lawyer's wishes – when she releases her 33,000 emails that have been deleted.\" Donald J. Trump hit at Hillary Clinton's email issue in the first presidential debate. #Debates2016 @webpagelink"},{"comment_id":"1019119028118150","commenter_b":"Majority of the worlds wealth belongs to Caucasians. It's not news anymore.","commenter_a":"Wow lost all respect for this station. Seriously? I know there is more important news that doesn't have to deal with comparing races.","post_message":"Report: Whites have 12 times the wealth of blacks See study--> @webpagelink"},{"comment_id":"10152767059646519","commenter_b":"She is not a stripper!","commenter_a":"Really? Praising a stripper mom? You lost me today, @username.","post_message":"Go mom!"},{"comment_id":"10152722362786680","commenter_b":"Shut up","commenter_a":"NO","post_message":"\"I think presidents have the right to pick their team.\""},{"comment_id":"10153003248257383","commenter_b":"And boot bitches like you.","commenter_a":"I wonder how many of you bitching about Audie Murphy are going to do something about getting him a day. He did a good job, told a good story, and Texas is proud of him. Get your panties out of a bunch and carry on.","post_message":"There is now an official 'Chris Kyle Day' in Texas."},{"comment_id":"10155243309639411","commenter_b":"Good @username get all this white people off welfare!","commenter_a":"It's OK , white people it's only for a day. You guys don't have to come off welfare in massive numbers tomorrow to make sure the strawberries get picked!","post_message":"People in Indianapolis joined the nationwide “Day Without Immigrants” movement in an effort to show how critical they are to the U.S. economy and way of life."}]
