[{"comment_id":"10153369191183984","commenter_b":"Yes it is.The best we can do is try to covert those that are a,ready here. I'm not sure how many would even listen.Its a job for the Holy Spirit. In the mean time we should stop immigration of Muslim population into the USA . When it reaches a certain percentage than there will be major problems. Satan is a master at deception and he came to kill steal and destroy.Jesus came to give life and give it more abundantly .","commenter_a":"OOOOH boy!! are we sitting by and letting this happen before it grows too late? Hell no!!!! Anyone interesting to get rid the prez, say aye!","post_message":"Wow, after watching this, I've got to wonder how this guy can say what he does and get away with it! Unbelievable! Do you think that radical Islam is the threat this woman claims?"},{"comment_id":"10155691016515354","commenter_b":"She actually spoke about how she respected the woman who hated blacks and called basically for their removal!! Ya right, she supports her own money making agenda, let's go conservatives and keep this creepy crook out of \"OUR HOUSE\"!!","commenter_a":"Now the Democrat liberals are trying to get criminal minds to help enforce their power! Criminals joining criminals. Wake up folks !! Crooks for crooks!","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.” If she didn't want it to expire, she could have driven once or twice since 1996..."},{"comment_id":"992230870799703","commenter_b":"Naw...she's right and yet...people keep fuckin around with white people. Get smart. Leave the crazy bastards alone. Duh.","commenter_a":"Jason, maybe whites should stop shooting up their own movie theaters and schools. And show me evidence of blacks attacking police officers. I suggest you worry and take out your own trash before you start with racist bullshit. Serial killers, rapist and mass murders Mostly white.","post_message":"Rebel Wilson's usually so funny so this awful joke about police and black lives came as a huge shock. #VMAs #BlackLivesMatter"},{"comment_id":"10154197437622426","commenter_b":"It's reality, white suburban women. It's not fair but it's a fact. If you're so concerned why don't you go down to Hillside Court and walk the kids home from the bus stop.","commenter_a":"School need more money but kids have 300$ shoes .500$ phones and say look at me and wonder why this happens.","post_message":"The robbers, described by police as young adults, threatened to beat-up the student if he did not take off his shoes and hand them over."},{"comment_id":"10153101656568717","commenter_b":"You call that a women?","commenter_a":"I was always taught that women are to be loved honored and respected. So she hit him any Real man would have walked away and let the cops handle it","post_message":"This video may be hard to watch. Officials in Florida released surveillance video of Florida State University quarterback De'Andre Johnson punching a woman in the face: @webpagelink Johnson was dismissed by the team today: @webpagelink"},{"comment_id":"884089625114947","commenter_b":"Well pack up lady!","commenter_a":"And just how they all accuse others of lies. Well i dont see any of their fake asses leaving","post_message":"Hey Barbara, we'll help you pack. See ya, never!"},{"comment_id":"527521687455792","commenter_b":"Don't give her anything free ,I bet she would loose some weight then maybe she will like what she sees,maybe if she was real hungry she would find a job,how about stopping everyone's welfare look what a cost saving that would be and it would help our United States we wouldn't have to feed a bunch of free loaders .","commenter_a":"Oink, Oink !!","post_message":"I couldn be more disgusted by what she saying"}]
