[{"comment_id":"10154462885161636","commenter_b":"The frequency of rape is not higher amongst Muslim migrants Red.","commenter_a":"3 white men gang rape a 15 year old boy while the country is worried about banning Muslims. Unbelievable","post_message":"At a fetish party"},{"comment_id":"1317807834918571","commenter_b":"Hillary Clintin is a nasty Woman, I like the sound of that truth.","commenter_a":"TRUMP = TRUTH","post_message":"WATCH LIVE: Donald J. Trump's campaign manager tells Bianna Golodryga about the \"rigged election\" claims."},{"comment_id":"10154846980595575","commenter_b":"Only thing to say is, the political don't really give a rats as about our country or its people unless the are profiting from it.only Americans that care will change this type of bulls hit .America infrastructure is need of desired repairs. Let's take care of America before refugees","commenter_a":"There should be no money sent to this governor who chose to use the money for criminal reasons. You just can't do that!","post_message":"Instead of fixing the dam, Gov. Brown spent $25 billion per year on illegals!"},{"comment_id":"913594125361987","commenter_b":"Go ahead vote for her! Stink up America some more you fools!","commenter_a":"She's right, we can't let a Republican in the White House. Vote Blue and support whichever candidate wins the Democratic nomination. I happen to think Hillary has a better chance of beating any Republican, but Bernie as our president would be awesome too.","post_message":"YES! Whether you're a Bernie or Hillary supporter, there's no denying the debate audience really loved Hillary's closing remarks. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153648874092060","commenter_b":"You made Nola.com Michelle!","commenter_a":"Tammy, we should have gone to target last night instead!","post_message":"Metairie Target shoppers got a little help with last-minute Father's Day shopping last night from a special guest – New Orleans Saints Quarterback Drew Brees."},{"comment_id":"1022130381169318","commenter_b":"CUMMING are stupid brats !","commenter_a":"OMG what a crock","post_message":"Come on..."},{"comment_id":"10157139733295354","commenter_b":"\"Lets bring in 1000's of Muslim refugees\" Sincerely, Libtards of America","commenter_a":"Have you seen this on BBC today ?????When Donald J. Trump offered to make Sadiq Khan an \"exception\" to his ban on Muslims travelling to the US, here's how the new London Mayor responded.","post_message":"***BREAKING***"}]
