[{"comment_id":"1181726388516881","commenter_b":"Yep, infidelity has nothing to do with a woman's looks. It's opportunity.","commenter_a":"Been there done that ....it sickens me even the prettiest girls get cheated on which tells me that it is not about how good you look,how skinny you are, or even how rich you are you see how when they make their minds up and don't want to work at fixing anything well we need to stop giving second chances too.","post_message":"Check out what Keshia had to say about the lie that was their relationship. What do you think of her comments?"},{"comment_id":"1688508021436310","commenter_b":"FIRE HER!!! She is a THUG!!!! DISGUSTING!!!!!!","commenter_a":"Fire her sorry hamburger flipping butt!","post_message":"This girl belongs in jail."},{"comment_id":"10153659617321323","commenter_b":"What about the kids, which is the entire point of the article?","commenter_a":"Just one big difference here. Kyle has asked for privacy, and presumably won't be going voluntarily onto TV shows to discuss his divorce. The people that appear on his show do so voluntarily, so are obviously less concerned about privacy for their issues. Stop trying to compare the two. Theirs no hypocracy here.","post_message":"\"What does Jeremy Kyle think is more likely: that a child’s parent or parents appearing on his show will constitute a mere 49 minutes in their childhood, or that its ripples will magnify that car-crash public event enormously – grotesquely – into something that cannot fail to be formative, and endlessly repercussive in its damage?\""},{"comment_id":"1068900079796837","commenter_b":"Right on..","commenter_a":"Guitar picks of course, a pick pocket!","post_message":"Who knew? (via HuffPost Canada Style)"},{"comment_id":"10153980064333132","commenter_b":"Keep the refugees out of America or we are next!!!!!!","commenter_a":"So said we pray for them.Trudeau open your eye to seeIf you bringing 25.000 refugees and Canada will be next","post_message":"#PrayForParis"},{"comment_id":"10153134542104705","commenter_b":"Marianne Hutchinson maybe you should move to NZ???","commenter_a":"Merriam Mistlebauer","post_message":"The only thing we have to fear is fear itself.........and spiders."},{"comment_id":"10154992177868905","commenter_b":"It really is better to have a world view. Try it some time.","commenter_a":"BBC has really gone down the tubes! Stick with news from your own country and leave ours alone!","post_message":"Watch LIVE: Latest Trump news, talking deportation and anti-Semitism. Get your questions to us in the comments section..."}]
