[{"comment_id":"368323690022592","commenter_b":"Who is this woman","commenter_a":"She is political posturing... Wants to be first Female President. (Well first elected. Hillery was first. Michelle ib second Unelected)","post_message":"Good God, Mr. President, we were once known as the leader of the free world, standing for what is right! You must not let America’s sacrifices be in vain. When will you learn that actions speak louder than your words?”"},{"comment_id":"10156915494530231","commenter_b":"Black woman=weapon of black mass destruction. -END","commenter_a":"Yeah, this dude SHOULD NOT marry you. If you're more concerned about him spending thousands of dollars on some stupid ring (a token of a totally outdated custom that was invented by DeBeers in the first place to sell diamonds that Africans have to DIE to mine) then you are with your relationship -- he should look elsewhere for someone who isn't a shallow golddigger.","post_message":"Here are a few tips if you find yourself in this situation. #AskDemetria"},{"comment_id":"720191621435846","commenter_b":"Peaceful muslims?? What in the hail is that??? They all believe the same! You and all the misguided people who liked your post get to be first in line for beheading!!! Dear lord do some actual research! There is no such thing as a \" peaceful Muslim\"!!!","commenter_a":"If it's true , hats off to them . We have been wanting \" peaceful \" Muslims to stand up to the \"radicals \" , maybe this is a start ????","post_message":""},{"comment_id":"1582705788695822","commenter_b":"Hillary Will be President!!","commenter_a":"Liar. Killer. Cold hearted, some one please drop a house on her","post_message":"Thank you, California!"},{"comment_id":"10153469428757144","commenter_b":"Those beautiful little WHITE girls are gonna be so bummed out when they come to understand that THEY are the minority. All that was missing in their routine was the Zeig Heil!","commenter_a":"\"Tomorrow Belongs to Me\"","post_message":"The internet is freaking out about this video. Watch it and you'll understand why."},{"comment_id":"788206447982585","commenter_b":"The trump train is heading for the trump wall. toot toot.","commenter_a":"Hurry Hillary call Wall Street call @username call AL Sharpton because your gunna need all the help you can get. The Trump Train is rolling straight for the White House !!!","post_message":"Hillary Clinton and her allies are preparing for the fight against Donald J. Trump."},{"comment_id":"10153110921541378","commenter_b":"Very glad the child's okay and I hope that scare woke up that woman to f****** reality","commenter_a":"How do you forget your CHILD in the car.","post_message":"DRAMATIC VIDEO: After allegedly leaving her 1-year-old alone in a hot car, a woman is confronted and a bystander incorrectly tells her that the child has died. That moment was caught on video:"}]
