[{"comment_id":"10158320001025294","commenter_b":"I agree!! If your DNA IS ON THE VICTIM..SPEEDY DEATH!!","commenter_a":"I beleive in crimes like this. Should be Swift justice if you're found guilty nothing less then the death penalty and in a short period of time 3 days fir greiveing for convicts family and then serve sentence out!","post_message":"The suspect is a registered sex offender. \"Our investigators didn’t stop. The culmination of their efforts is the arrest of a person who we need to make sure never touches our streets again,\" said Cleveland's police chief as he announced an arrest in the case."},{"comment_id":"1864825540399867","commenter_b":"A few years prior: \"did you see the her sleeveless dress?! THE FIRST LADY HAS NO CLASS!\"","commenter_a":"I'll never get over our \"president\" saying he grabs women by the pussies and his supporters just shrugging their shoulders over it","post_message":"Here are five reasons why Trump is the opposite of a Christian. Special thanks to Cindi Brady. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1772774552977135","commenter_b":"These women are hypocrites.","commenter_a":"So explain to me how Trump is horrible because he was talking to another man in private about a women who cares get over it you crybabies. I'm sure she liked it too","post_message":"BREAKING: Protesters have gathered in front of the Trump Tower on Michigan Ave. They're holding graphic signs referencing Donald Trump's lewd comments about women. No arrests so far. MORE: @webpagelink"},{"comment_id":"1138154636255284","commenter_b":"YOU are so full of it....I bet women probably leave YOUR sorry ass....YOU have NO CLASS. ...I CAN TELL","commenter_a":"I DON'T believe that...Who would want her....No One....Just her husband and she's lucky he gave her the time of day","post_message":"She was just exposed. This family needs to be booted from the White House. Do you think Michelle Obama is a disgrace?"},{"comment_id":"10156866881005231","commenter_b":"Porsha Williams (Dish Nation)should be next.loud mouth and Crazy.Don't take the Club to you Job. Stop Emphacizeing and Profileing your rear end Porsha.Professsionalism evidently is not in your vocabulary. You are not the only woman with a big butt.Its most likely paid for anyway.","commenter_a":"All that smacking her mouth waveing her hand poping her fingers and all that darn yelling in the mic.Enough!Don't take the Club to your JOB.","post_message":"Did the leader of the 'Tamartian army' get the boot?"},{"comment_id":"10154503562599138","commenter_b":"Dawn breaking over Lake Pepin Lake City, MN 6/9/16","commenter_a":"Watching the sunrise everyday on my way to work","post_message":"It's a call for pictures showing what you love about Minnesota. Show us animals, people and moments that show off what's so great about our state and we'll feature some on the Fox 9 morning news!"},{"comment_id":"10154038979953279","commenter_b":"Very simple by democratically changing the Congress /Senate, and local states governments with stateswomen /men that supports Bernie's and we the people's agenda. If you think outside the subjugated status quo box where you live it is possible to allocate the economic resources where we want it to be instead of for example spending trillions on wars and then passing a debt bill to we the people so we paid more to wall street. Simple enough. We can even pass legislation specifying since that Iraq war was illegal due to lies for greed we can write off that illegal debt and don't paid to wall street. Hmm just brain storming the possibilities once we change the Congress, Senate, and Bernie is our POTUS. Just follow THE PANAMA PAPERS.","commenter_a":"Hillary is Cynical. But we the people know who the real champion for the 99% working class wealth producers is. Only Bernie Sanders is genuine and legit to the people. #NotHer15 #berniesanders #latinosforbernie #bernieorbust #creditgoestobernie","post_message":"\"I’m supporting Bernie Sanders because he says no to fracking. I’m supporting Bernie Sanders because we do need a single-payer healthcare system that takes care of everyone. And that is not a pipe dream.\" - Rosario Dawson"}]
