[{"comment_id":"675517259277271","commenter_b":"And now you know .......the rest of the story","commenter_a":"Good questions","post_message":"Hear, hear!"},{"comment_id":"1181986708533713","commenter_b":"if they don't like it they should leave America. Sure mexico, africa, iran or even canada would take them.","commenter_a":"Exactly! Behavior like this is a major part of why Hillary and her supporters just lost the election! Protesting is good, but not when you're whining about a person who won an election fair and square just because you disagree with them.","post_message":"\"This is not helping.\" One Hillary Clinton supporter in Chicago said he was unhappy with how some of the the anti-Donald J. Trump protests were being carried out @webpagelink"},{"comment_id":"10153278657786336","commenter_b":"Nice to meet you as well Sherrell.","commenter_a":"White lives matter too","post_message":"Police believe Daron Dylon Wint – the suspect in the D.C. quadruple murder – may be in Brooklyn, New York. DETAILS: @webpagelink"},{"comment_id":"10158362932045500","commenter_b":"Her water didn't break yet","commenter_a":"Her water did not break","post_message":"BABY WATCH (10am update): Still no baby giraffe yet! When do you think mom April will give birth at Animal Adventure Park? Don't miss anything: @webpagelink"},{"comment_id":"517589811698946","commenter_b":"No it is a religious theme park what is wrong people want to let Muslims in our schools and force our American children to learn there karen but they don't want a Mural of God in a theme park .","commenter_a":"Freedom of speech. Don't like it go to another country.","post_message":"A theme park in Orlando with a Christian message was challenged by the Freedom From Religion Foundation over a mural that could be seen on the highway."},{"comment_id":"1683253511914514","commenter_b":"@username Trump & FOX NEWS have Greatly Exaggerated This Issue The Lying About the Protesters IS On TV Footage & They Still FLAT-OUT LIE.... Why is Fox NEWS Saying it was Violent Protestors, The Media Was there you can See Who are the Aggressors it was the Trump Supporter, but the Trump Supporters Started Sucker Punches Again, Most of the protestors inside were young White Girl with locked armed, the Protesters Outside were very peacefully walking around Outside with their signs until the Inside Trump Supporters Went Out Side & started Yelling & Pushing Protesters, it's on CNN. Trump Calls CNN & Tell them they were violently attacking, He Ran Off as soon as he saw there was more than one Protestor there's Footage...Trump Lies & Exaggerates everything 1000 Times Fold !! TRUMP Wants to Turn Our Military INTO Brainless Terrorist Animals To Beat ISIS, Our Military Has Rules & ...","commenter_a":"After tonights Chicago thuggery, trump will probably win every state voting on Tuesday in a landslide lol","post_message":"Marco Rubio is urging Republicans in Ohio to vote for Gov. John Kasich in order to prevent Donald J. Trump from winning, according to published reports and comments from his own people."},{"comment_id":"645079822349263","commenter_b":"Get Him the Hell out of the White House!!!!!","commenter_a":"Yeah no! Maybe make some toilet paper with his face on it","post_message":"Obama is trying change our countries money. He has absolutely no right to even consider this change. Do you think Obama deserves to have his face on a dollar bill?"}]
