[{"comment_id":"10153221269572464","commenter_b":"Yes, Hillary should indeed be going to jail, for life! People were killed because of her. :(","commenter_a":"I think she should be going to trial instead of running for president....","post_message":"We need to restore America’s leadership: @webpagelink"},{"comment_id":"1764590997115642","commenter_b":"Melanie can say she wrote her speech speaks what pea brain she have.","commenter_a":"Maybe because she copied it down in her own handwriting she THINKS she wrote it!","post_message":"WOW – Melania Trump’s plagiarism scandal just got even more interesting... Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154094490463984","commenter_b":"Thanks to our neighbors to the north..it would appear they are much wiser than we are. If this racist carp is going to end, it must end on both sides. I truly believe there are far FAR more black racist than white in the USA today. I also do NOT believe the blacks want racism to stop, that as a whole have too much to lose.....","commenter_a":"Can we just get this racist woman off social network already! Tired of seeing and hearing about her!","post_message":"Fresh off her race-baiting Super Bowl 50 performance, Beyoncé was about to head up to a huge concert in Toronto. However, a Canadian official just hit the singer with BRUTAL bad news... She never saw this coming... she should have, though."},{"comment_id":"1721466568134277","commenter_b":"SHE IS A HITLER","commenter_a":"What an idiot","post_message":"Was this a good idea?"},{"comment_id":"635677536633830","commenter_b":"Demons","commenter_a":"@username read the top comment 😂😂😂","post_message":"Name it! #WSHH"},{"comment_id":"835588663194002","commenter_b":"As I was reading this article and the comments it evoked, which as a believer I support 100%, this thought came to me - what's to prevent a Godless government from forcing churches to perform gay marriage ceremonies much as they've strong armed bakeries and wedding venues?","commenter_a":"They will have to be married @ the Justice of the Peace. You can't force ministers, priests, rabbis, etc to marry them.","post_message":"The Supreme Court's decision on same-sex marriage doesn't change anything. The position of the Bible on marriage is not negotiable. #marriage #SupremeCourt"},{"comment_id":"1069182599857726","commenter_b":"Fine, you'll never get another cent! You bitch or butch or Satan worshiper!","commenter_a":"Their coffee tastes like shit anyway.","post_message":"Starbucks CEO takes hard stand. They just lost our business forever. Will you go somewhere else to get your coffee from now on?"}]
