[{"comment_id":"10153670788291320","commenter_b":"This post just made my morning. You hit the nail on the head !!!!","commenter_a":"That family just needs to rent a van, pile into it, pick up the Kardashians and drive away!","post_message":"Disgraced reality TV star Josh Duggar was reportedly among the 32 million users of the adultery website, AshleyMadison.com. According to Gawker, Duggar, a married father of four, paid nearly $1,000 during his two-year subscription. His name, address and sexual preferences, and that of millions others, were posted online Tuesday night by a group of hackers. More: @webpagelink (AP photo)"},{"comment_id":"10153249235547894","commenter_b":"here Sharnise Nisec Brown since you are behind on the times lol Lauren Payton Katrina Elizabeth","commenter_a":"Zanehya Rayshaun Corleone","post_message":"Exclusive: K. Michelle Opens Up About Her Relationship with Idris Elba and Backlash from Black Women: ‘The Women I Fight For Have Been The Women That Attack Me’ [Video]"},{"comment_id":"10153580246221636","commenter_b":"Where we going? X","commenter_a":"@username when that degrees done, emigrate xx","post_message":"It's getting more and more expensive being a student"},{"comment_id":"10153365745456749","commenter_b":"playing to the media.. he has done more to MAKE it happen again than anyone in history","commenter_a":"ALLAHU AKBAR!!!! #MMBR #M23BR","post_message":"\"In memory of those we lost, we resolved to shape a world where events like those of September 11, 2001, could never happen again, and we see this unbreakable spirit live on every day across America.\" —President Obama"},{"comment_id":"1226487637389708","commenter_b":"Just remember when your ass gets beat up coming to my town... U started this shit. I bet your wife's dick is bigger than yours","commenter_a":"Hillary gonna win.....trump will be doomed....after his rape case and so many other Court appearances he will be in jail along with the other republicans...","post_message":"CAN'T WAIT!"},{"comment_id":"10152639623811680","commenter_b":"Illegals do vote. @webpagelink","commenter_a":"Not against legal citizens from voting. It is fraud and illegals voting. You took an oath. You should be against it also.","post_message":"Sen. Bernie Sanders: “An absolute disgrace for Republicans in the year 2015 to work overtime to deny people the basic right to vote.”"},{"comment_id":"941357532590662","commenter_b":"Yes, @username. Why don't we force all the women to wear burka. I hope yours fit you well. You probably need it.","commenter_a":"Every picture she has she has her cleavage out! Then blames the men for the 'unwanted attention'!!!","post_message":"She reported them to police because she said it made her walk to work an 'awful experience'"}]
