[{"comment_id":"10153357248947061","commenter_b":"silly girl","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"10153153444601051","commenter_b":"Go ahead baby girl google dat, ill wait.... Lol","commenter_a":"This Latina is a trump supporter.","post_message":"We went to the Donald Trump protest this week to speak to his supporters and critics. Here's what they had to say. Do you agree or disagree with Trump when it comes to immigration?"},{"comment_id":"1241511662632276","commenter_b":"Send his ass to jail","commenter_a":"Send him to jail","post_message":"This thug-in-training tried to act tough by sucker punching this white 12-year-old boy with a pair of brass knuckles. Too bad for him the District Attorney didn't think his brutal assault was as funny as he did... Now he's going to see what the real word is like! SHARE and let us know what you think should happen to this thug-in-training! @webpagelink"},{"comment_id":"10154360980241336","commenter_b":"I would rather see the winner of the Miss USA pageant as president than that nasty skank Hillary","commenter_a":"That's because most Miss USA contestants are a whole lot smarter than Hillary.","post_message":"Thoughts?"},{"comment_id":"10150524320899999","commenter_b":"So once again punish people who are trying to help themselves","commenter_a":"Un-American","post_message":"Millions of families may need to rethink their approach to college savings."},{"comment_id":"10153882150921545","commenter_b":"Hahaha. Your an idiot lady!","commenter_a":"appalled by the comments on this article. this was a TEENAGE GIRL who was groomed and manipulated by ISIS agents via social media to leave her family to join them, not some mastermind terrorist who deserves to die. she is as much a victim as anyone else who has been killed by ISIS.","post_message":"ITV News reported Thursday that Sultana is thought to have been killed in May when a Russian warplane dropped a bomb on her accommodation in Raqqa, the de facto capital of the Islamic State"},{"comment_id":"907290132700573","commenter_b":"Grossly misinformed woman, too.","commenter_a":"You reap what you sow, so when your harvest comes in, don't be crying cause it ain't what you wanted. You sow perversion & corruption, you will reap your harvest.","post_message":"Will marriage equality really kill people, cause 900,000 abortions and undermine heterosexual men?"}]
