[{"comment_id":"1216236868472563","commenter_b":"I'm all for it and We will let Yall have all of our democrats too","commenter_a":"Can we please please please have a vote on splitting the united states into the union and confederate states? Let the confederate states figure out first hand what \"do nothing\" politics really does. The north is already outperforming the south in money and academics, and they aren't so cruel either, but the south will never admit their shortcomings ever and at this point they are just a huge drag.","post_message":"The plan relies on individual tax credits to allow people to buy coverage from private insurers."},{"comment_id":"507285912795322","commenter_b":"God will show his hand and these creatures will be taken away to their doom.","commenter_a":"Take off the masks ladies!","post_message":"ISIS just made a huge move against America. This is unacceptable. Spread this post, we need to fight back. Do you agree ISIS should be wiped off the Earth?"},{"comment_id":"853235784752651","commenter_b":"Too bad there aren't more moms like her.","commenter_a":"I love that she is wearing bright yellow...for all to see.","post_message":""},{"comment_id":"10153554685766880","commenter_b":"I want TRUMP to build the wall so can make it hold","commenter_a":"At one time owning slaves was constitutional","post_message":"#2. Ending birthright citizenship would be \"clearly unconstitutional.\""},{"comment_id":"10152765716636028","commenter_b":"What an effen B-tch I see why he cheated on her weird @$$","commenter_a":".","post_message":"\"That's what you get for cheating on me,\" said a woman who allegedly lured her ex to a drug house where a group of men robbed him at gunpoint, according to a judge. @webpagelink"},{"comment_id":"10155316493136509","commenter_b":"She's a putz.","commenter_a":"Kacie Hughes","post_message":"Hillary Clinton: \"The good news is my pneumonia finally got some Republicans interested in women’s health\" @webpagelink"},{"comment_id":"10153517844123984","commenter_b":"They needed to know.","commenter_a":"This is the most retarded thing anyone has ever posted on faceboook.","post_message":"Mega-church TV pastor Joel Osteen just made a sickening announcement about Muslims... Spread this absolutely everywhere... the REAL Joel Osteen needs to be exposed. Do you agree that Osteen is a fraud?"}]
