[{"comment_id":"954144534678601","commenter_b":"Legal immigrants are not citizens so they do not have the right to vote! Educate yourself @username","commenter_a":"So the answer is to let 8 million non tax paying illegal immigrants vote so they can continue to collect government aid. Nice way to F the country up more you idiots.","post_message":"Obama has responded to Trump's hateful rhetoric the best way possible."},{"comment_id":"967744473282082","commenter_b":"Hillary, american people need your talented and exposure,","commenter_a":"Hillary, is key to solving, american problems,","post_message":"What we’ve seen too much of in the last few years is a spate of people who have reached for a gun before they really figured out what was going on. They’ve been much too eager to use that gun—we’ve seen it with policing and we’ve seen it with civilians. With police, first and foremost, they need to be trained and held accountable and disciplined in a way that prevents the reaction that we’ve seen way too much of. And with civilians—a lot of these “stand your ground” laws need to be rewritten. If you have to defend yourself, OK. But look at some of the instances we’ve had—Trayvon Martin, and too many more. Nobody should want to create circumstances in which innocent, unarmed people are killed—either by law enforcement or by civilians wielding guns. We’ve got to figure out how to deal with that."},{"comment_id":"10156681132085354","commenter_b":"They could have a no-gravity policy, that wouldn't be real either. There are no gun-free zones in Oregon. The end.","commenter_a":"@username lies to low-information conservatives: Umpqua Community College was not a gun-free zone. No college policy overrode state law. There were students present that day with concealed weapons. The right perpetuates this lie because the truth undermines their \"it's always a gun-free zone!!\" narrative. @webpagelink","post_message":"Do YOU live in one of these 8 states? **Is #6 a little surprising?"},{"comment_id":"1375821949123925","commenter_b":"Love and agree with your comment Sandy","commenter_a":"Will not stand for the disrespect and I'm totally disgusted by the inept commissioner. He wanted to fine players wanting to support something positive, Cowboys supporting the 6 policeman killed, but pats Kaepernick and his followers on the back. The entire NFL is ass backwards and I was a huge fan","post_message":"NFL says rating are down because of Trump and 2016 headlines. I think not. Read my op-ed + TAKE OUR POLL: @webpagelink"},{"comment_id":"1824233217832680","commenter_b":"Yep! I saw what DT paid for in this campaign, thousands and thousands of his campaign signs , thru WV, Ohio, Mi. Drove it many times from NC due to a deaths in my family. I couldn't believe how many I saw and where they were. Really in the oddest of places too. Someone was paid to put them up.","commenter_a":"I love my Affordable health Care, it has saved my life. It's very important to have coverage for everyone in our country. You never know when you my need it. The health care conglomerate has made it expensive, big Pharm etc..etc.. not OUR President! What he did was great for this nation, and yes I would tweak a few things but all-in-all we need this for a healthy people!","post_message":"Your experience with the Affordable Care Act? #ACA"},{"comment_id":"1119860174747403","commenter_b":"I don't need friend like that... Whend they go to my home they got everything and more.. and whend I go to they shiet hold I have to wayting.. I don f think so... don't invite me no more.. I got my own park in my house.. .. is my house and I live here. Jajajajaja... fucking IDIOTS...","commenter_a":"Lydia Taylor lol so you 😂😂😂","post_message":"The struggle"},{"comment_id":"1628546037432509","commenter_b":"Go get those evil men!","commenter_a":"Exactly... Agree with you @username!!","post_message":"WHOA! This weapon is like something out of the Iron Man movie..."}]
