[{"comment_id":"10152750349506130","commenter_b":"Wow your a dumb bitch","commenter_a":"All these comments about donating the dress are so retarded. If a bride can't afford a dress she shouldn't be having a wedding. There's enough poor people getting married and procreating which is gross lol get your own dress and she can do whatever the hell she wants with hers","post_message":"\"I knew that a pity party was the farthest thing from what I wanted or needed.\""},{"comment_id":"876721502518426","commenter_b":"She don' deserve nothing more than 10 years in jail and not a holiday jail for what she has done to this Country she deserve the punishment that she gets","commenter_a":"No! She deserves jail!","post_message":"Hillary Clinton's worst nightmare just became her reality. Days before the election everything crashes. 'LIKE' if you think Hillary deserves justice?"},{"comment_id":"10154325210061336","commenter_b":"Let's just deport him. I'm sure that he has learned his lesson and he will never come back. (Sarcasm) Seriously, just shoot him. He's a criminal non citizen, here illegally. He shouldn't be entitled to any of the protections that our constitution affords us and neither should any other illegal immigrants that further engage in criminal activity.","commenter_a":"It may happen more then you can imagine!!","post_message":"Rene Ortiz Quintana, 69, took the identity of Ruben J. Gallardo – who has been dead since 1994 – to get Social Security, VA and other Federal, state and local benefits since 2012."},{"comment_id":"1075762019148635","commenter_b":"I want that :)","commenter_a":"Alli Rauscher","post_message":"Piper the abandoned pig just got a new home (and a new best friend)! Via The Dodo"},{"comment_id":"908989295805078","commenter_b":"She was discriminatory to Israel in her tweet islamaphibia Israel. The middle east wants us wiped out! She is lucky she is in the USA where she can say what she wants as a woman in her country she would be stoned for the same accusation. Get over yourself lady!!!!!!","commenter_a":"Better yet, just stay home","post_message":"\"This discriminatory and disgusting behavior.\""},{"comment_id":"10153212964226336","commenter_b":"Daniel Eskildsen just because this women gave her kid a cookie doesn't mean she fills her kid with junk food.. cookies in my house are a treat to the healthy diets I have my children on..","commenter_a":"Teachers need to worry about teaching and not parenting","post_message":"Cookie crackdown! A preschool teacher sent a note home reprimanding a Colorado mom for packing Oreos in her 5-year-old daughter’s lunch."},{"comment_id":"10153948150211680","commenter_b":"Someone has butt hurt, I'll keep licking my windows while you keep hoping for your 72 virgins.","commenter_a":"Is Trump seriously just now realizing his supporters are a bunch of window-licking water heads? Donald, you are talking to the craziest people in the country. You could literally take off your shoe mid-speech, hold it up to your ear, say you’re getting a call from Batman and they would be quiet until you hung up your shoe.","post_message":"Donald J. Trump: \"Premiums are going to go up at 116%...Unless I get elected, in which case, you won't have to worry about it.\""}]
