[{"comment_id":"1025902810798360","commenter_b":"@username you are crooked and You are a loser. You are a complete disgrace. You will not make America great again. You have no idea what you are doing. You are a complete idiot. Do us all a favor and drop out. Stop spreading hate. The only reason your rich is because you got money from your father. you are going to make America a laughing stock. please reply to this message. Be a man and reply to my message. Debate me. don't be a chicken.","commenter_a":"@username you are crooked and You are a loser. You are a complete disgrace. You will not make America great again. You have no idea what you are doing. You are a complete idiot. Do us all a favor and drop out. Stop spreading hate. The only reason your rich is because you got money from your father. you are going to make America a laughing stock. please reply to this message. Be a man and reply to my message. Debate me. don't be a chicken.","post_message":"Thank you for the incredible amount of support last night- San Jose, California. I love you all - we will deal with the thugs & criminals -- we will build the wall --- and Mexico will pay for it!"},{"comment_id":"10154666136846833","commenter_b":"I'm thankful there isn't enough police to stop all crime! Because then we would be living in a police state!","commenter_a":"There is one more Woman who Had a gun to protect her Family, but a lot of Americans who will never be Able to protect there Family's for not owning a Gun. They live in a elusion of Safety that the Police have enough manpower to Protect them. Unfortunate there will never be enough Law enforce Officers to protect everyone. It is up to you to Protect yourself as much as possible.","post_message":"If three intruders break into your home and hold your spouse at gunpoint, what would you do? This Florida woman was faced with that dire scenario last week. Thankfully, she was able to run to the bedroom and grab her own firearm to end the ordeal and save her husband."},{"comment_id":"10153963573598984","commenter_b":"Disgusting stupid females that believe that has brevetted mine","commenter_a":"And this is not their idea of hell a place of lust","post_message":"This Muslim cleric realized that female suicide bombers don't have a whole lot of use for 72 virgins... so he came up with his own reward for these \"martyrs.\" It's even more disgusting than you think it is, too."},{"comment_id":"752331831534238","commenter_b":"This guy is DANGEROUS!!! USA will not be a safe place if this ass hole wins. countries like RUSSIA! Will declared WAR on USA. He is thinking to pressure MEXICO to pay for a wall base in WAR!!! Mexico has many ALLIES! WWIII Don't make a bad decision people!","commenter_a":"He is the devil","post_message":"Watch Trump directly contradict himself — watch more here: @webpagelink"},{"comment_id":"1365265100160183","commenter_b":"Joseph, a woman gave birth to a shadow demon in (I think) season 2.","commenter_a":"Its time to give serious thought of graduating this show to the big screen. Follow the same playbook used by the James Bond.","post_message":"All good things must come to an end. Unfortunately, Game of Thrones is one of them."},{"comment_id":"10153608579386509","commenter_b":"Girl bye","commenter_a":"a young man's throat was crushed and spine severed in police custody BUT detached politicians who left their grand wizard costume at home are blaming Obama. unsure emoticon #smokescreens #distractions","post_message":"Some 2,000 National Guard troops and more than 1,000 law enforcement officers will be on duty tonight in Baltimore, Gov. Larry Hogan says. @webpagelink"},{"comment_id":"10153648963644203","commenter_b":"I assure you, Hillary has more political experience than ALL the male candidates. Her being female just makes it better. You men who hate powerful females are gonna be maaaaad! lol","commenter_a":"I think so. It's equally difficult to imagine what Hillary Clinton's appeal to anyone, women included, is.","post_message":"\"Being a woman does not give you the right to be the next president. Whether you Carly Fiorina or Hillary Clinton. It going to be your campaign that matters.\""}]
