[{"comment_id":"10153700802697235","commenter_b":"Untrue. Unfair. The DC snipers were/are referred to as mentally ill, not as \"thugs.\" I can't think of another black mass shooter offhand. Most U.S. mass shootings are either non-blacks with histories of mental illness, or gang/drug related shootings committed by blacks.","commenter_a":"It's because he was white. That's why now it's about mental illness next week a black kid will be a thug or a menace to society","post_message":"This is a big lie we're always told so that we can avoid talking about the obvious -- GUNS."},{"comment_id":"10153472169705667","commenter_b":"Such a wonderful thing to do.","commenter_a":"Thank you, may the Lord Bless you and your family","post_message":"Napster founder Sean Parker's cash infusion is the largest ever for cancer immunotherapy"},{"comment_id":"1551588725149374","commenter_b":"Rest in the arms of Jesus little man. The world is praying for your family.","commenter_a":"you are in my prayers little angel. So are your mommy and daddy.","post_message":"Our hearts go out to the family of 2-year-old Nebraskan boy, Lane Graves."},{"comment_id":"10155137005061037","commenter_b":"Most illegals come here by not wading a river.","commenter_a":"Trump supporters are more worry about illegals than of terrorists what a sad world dnt forget that criminals come of all races and not just cause your brown skin means your from mexico Natives,Mexicans,Italians share the same skin color","post_message":"He once referred to it as “The Great Wall of Trump.”"},{"comment_id":"10153188794046680","commenter_b":"And @username get that male organ out of your mouth.","commenter_a":"@username just how would have more gun control laws have prevented this last shooting? California has already the most stringent gun control laws on the books.","post_message":"A day after the shooting massacre in California, Republican presidential contenders were utterly unapologetic about their opposition to new gun-control laws."},{"comment_id":"221003188363637","commenter_b":"@username And worse!!!! No wonder she needs to shop!","commenter_a":"Wait wait wait...I thought Trump's doctor told us that if elected, Trump would be the fittest, healthiest man to ever serve as President! You mean I was lied to about Trump???","post_message":"TELL US IN THE COMMENTS!"},{"comment_id":"10153059346813525","commenter_b":"Stacey Panarelli","commenter_a":"If you read the whole story, the girl was able to free the dog and it came back to help her when she was in danger! What a HERO, Awesome dog that gave its life to save hers. About it being off leash, how many of us at a park take a pet off leash to fetch a ball or play or whatever? Have a HEART!!! I cant imagine what they are going through and its terrible those kids and Haze`s family watched in horror. My prayers and heart go out to them!!!!! Haze youre a hero dog!!!!","post_message":"\"By the time I got on the bank with 'Haze,' the gator is eyeing both of us.\" www.myfoxtampabay.com/story/@username/gator-snags-dog-on-hillsborough-river-as-family-watches-in-horror"}]
