[{"comment_id":"10153273305921051","commenter_b":"Sick ass Mother fucking Bastard, needs to be castrated and beat to death so he can feel the pain that poor baby felt, it just sickens me to hear of these evil people in the world.","commenter_a":"Convicts will likely shove reality up his ass!","post_message":"This guy did something awful to a 19-month-old girl. Now he's going to face the consequences."},{"comment_id":"10153992655564740","commenter_b":"Both groups are basically the same and it's sad that people can't or won't stand up and think for themselves.","commenter_a":"Story was after the 30 protesters souround the 6 kkk and begin getting violent the 6 defended themselves... 4 of the 6 were arrested... Wtf is going on here.","post_message":"Anaheim police have said “one or two” self-described KKK members have been seen in the city in the last two years."},{"comment_id":"10152968983250736","commenter_b":"What law didn't he follow?","commenter_a":"Judges should follow the law.","post_message":"The judge who hung this photo of Adolf Hitler in the Marion County Courthouse hired a lawyer who advised Citizens United to represent him."},{"comment_id":"948371528584407","commenter_b":"They will never be Americans .. They are all murders and need to go home..","commenter_a":"His typical BS. Lie Muslims. Don't belong here !!!","post_message":"Do you think there was anything wrong in saying this?"},{"comment_id":"10153409459121051","commenter_b":"What a bunch of cowards. The black girls are bigger then the white and it takes 6 of them to whip one white girl. They are just trash and need to go to jail","commenter_a":"Let's take them and whip their ass","post_message":"Beating this teen girl senseless wasn't enough for these women. They also decided to leave a special message on her forehead."},{"comment_id":"10157268817905551","commenter_b":"not NO more BITCH!!! your goin DOWN!!!","commenter_a":"Take him out and watch what happens especially when his refugees and rioters, illegals dont get paid","post_message":"Emails Prove that the Real Leader of the Democrat Party is George Soros"},{"comment_id":"715065121964948","commenter_b":"Good luck competing with India and China for FDI by multinational corporations. Unless you guys are okay with working for <US$1 an hour.","commenter_a":"Correct me if I'm wrong, cost of living will rise and NHS is at serious risk........... As far as I can see we're in real trouble!","post_message":"Is #Dexit on the cards? Could Denmark follow Britain? Paul Adams was in Copenhagen where there are already calls for a similar #EURef. You put your questions to him and Eurosceptic Danish pollster Erik Høgh-Sørensen. #FacebookLive"}]
