[{"comment_id":"10152784029667093","commenter_b":"Apparently, Valerie loves being inbred too!","commenter_a":"If you're white you're right.","post_message":"Parker Co. teen accepts a plea deal, avoids life in prison... @webpagelink"},{"comment_id":"874645565991108","commenter_b":"Crista..isn't funny how she can write songs about all her ex boyfriends, and that's cool..but she's off limits???LOL..","commenter_a":"Kanye West..These cat's are crazy..LOL...if you are so \"untalented\" then why are they so worried about a song..not REAL life..a song..WORDS on a piece of paper..that have no relevance to their life..i'm about to get a lot of hate i bet..that's cool..but before you tell me i'm wrong people..how many of you own the Marshall Mathers C.D.?? it sold millions of copies..or have bought any Eminem album since?? so, those were just funny celebrity mentions?? but now it's serious?? people need to relax..","post_message":"In a new song, Kanye West speculates he might still have sex with Taylor Swift."},{"comment_id":"10156722273625354","commenter_b":"I hope the whole crowd good her sorry ass.","commenter_a":"And who allows them their STAGE? Disgustingly racial, anti police and presidential common, ticket of 8 yrs. Ugh! Don't buy their future stage!","post_message":"***BLACK PANTHER PARTY SUPPORTER AND BLM RADICAL DONOR BEYONCE OWES AMERICA'S POLICE, ARMED FORCES, & VETERANS AN APOLOGY***"},{"comment_id":"10154456212209060","commenter_b":"Have yall seen an uncircumcised vagina? Yikes","commenter_a":",,,,yea but have yall seen an uncircumcised penis???? Yikes","post_message":"If men can become astrophysicists or master carpenters, surely they can learn to wash? Campaigners are fighting the perception that the benefits of circumcision outweigh the risks"},{"comment_id":"10153126452213854","commenter_b":"Yep, idiots. Gays will lose more than their heads from muslims.","commenter_a":"Good luck with that","post_message":""},{"comment_id":"10154493907103352","commenter_b":"Amen and thank you Lord","commenter_a":"Amen","post_message":""},{"comment_id":"555137491342104","commenter_b":"HELLARY ROTTEN CLINTON IS A SEXUAL PREDATOR AND A RAPIST CRY BABY","commenter_a":"We won fairly and stop saying it was the russians and trump. Stop filling your head with media lies","post_message":"WATCH LIVE: Members of the Electoral College in Texas gather at the statehouse in Austin to vote for the president and vice president of the United States. One Republican elector, Chris Suprun, has revealed his intention to vote for John Kasich instead of Donald J. Trump."}]
