[{"comment_id":"10153351260137439","commenter_b":"Go home to your rodent pit ugly woman","commenter_a":"Why did they come to the USA? To bring death? Shame yourself Mother of Satan.","post_message":"@webpagelink"},{"comment_id":"10153401168701130","commenter_b":"Pussy ... no balls...","commenter_a":"Char Marsh","post_message":"President Obama is a little too used to reacting to shootings. Video: NowThis"},{"comment_id":"924961764238223","commenter_b":"Some companies are specifically recruiting unskilled migrants because they know they can get away with paying them next to nothing! Also these entrepreneurs you speak of often pay such little to their employees so they can get rich themselves!","commenter_a":"70% tax from working people to pay while we have so many lazy unemployed sitting at home seems fair","post_message":"She says injustice and inequality makes her \"as angry as the Hulk\"..."},{"comment_id":"671356856304361","commenter_b":"Absolutely! Well said @ Nick..","commenter_a":"I think anyone that can actually read and does read about the UN`s actions will know that something is very wrong here, there is corruption at work, right at the top. Their anti Israel bias is painfully obvious in deed and action, compare what they levy against Israel in comparison to every other country under the UN, read some of the insane quotes from Palestinian sympathizing UN members and you will have the naked truth envelop your logical thinking in determining that ulterior motives are at work, insidious schemes are hatching and Israel is in the UN`s sights for dubious reasons. They are utterly obsessed with attacking Israel on the world stage and make not one effort to direct their attention anywhere else. We see the bias, we understand corruption is undermining the very fabric that weaves the tapestry that makes the UN have any credibility in the eyes of ...","post_message":"Israeli sources detail president’s ‘difficult’ 30-minute post-election call to Netanyahu, posit grave scenarios for diplomatic rupture"},{"comment_id":"1362983927059832","commenter_b":"Found the \"run the USA into the ground\" voter.","commenter_a":"In a close election, to falsely broadcast that a candidate \"faces indictment\" is an act of sedition, especially when they know their viewers are hungry to believe such a ridiculous lie and would eat it up. Absolute treachery!","post_message":"In fact, Baier said, after checking with his sources, there is no evidence at this time for either statement."},{"comment_id":"10154984225302300","commenter_b":"Dee you are what's wrong with white people...","commenter_a":"Those darn white people attacking blacks.. oh wait.. this was black on black crime. Guess there won't be any riots over it.","post_message":"UPDATED: Eight people now confirmed shot Monday afternoon during a Martin Luther King Jr. celebration at a Northwest Miami-Dade Park, according to police."},{"comment_id":"863141660412250","commenter_b":"I can't belive some young women want to pay tons of money for this,keep poppin those Skittles and you'll look like that in no time!","commenter_a":"Sorry but it's hard for me to feel sorry for these customers. One ounce of common sense would tell you....Do not let this person inject me with anything!!","post_message":"Toxic butt ‘doctor’ stuns court with her backside."}]
