[{"comment_id":"622739101214748","commenter_b":"Yes, what has she done in her young life to deserve a 900,000 dollar a year job? Oh ya, she works at mommy and daddy's \"foundation\", sorry, money laundering facility!","commenter_a":"Is she billys daughrer or NOT","post_message":"Multiple Choice Quiz time, kiddies! Which answer did you chose? A or B? @webpagelink"},{"comment_id":"894582770641419","commenter_b":"Ship her out","commenter_a":"There is a special place in HELL for Rosie O'Donnell. It seems to me she is living her hell on earth her life has gone so well. Can you remember a movie? TV Show oh the view, did she get canned. What ever happened to that talk show. If I remember correctly she had problems with her own kids. I think they just didn't want anything to do with her. Go get back underneath your rock Rosie!","post_message":""},{"comment_id":"10153846825321336","commenter_b":"We need him gone he don't give a damm about anything go home you muslim","commenter_a":"Obama is aiding and abetting the enemy. He is a traitor and should get what he deserves as such.","post_message":"“If you were waiting to hear a U.S. president say, 'I feel your pain' or…'it’s them or us,' that is not what you just heard.” – Bill Hemmer on President Barack Obama's speech on the Paris attacks @webpagelink"},{"comment_id":"1787974808090517","commenter_b":"When a woman as dumb as a rock has been a Senator, Secy of State, and candidate for president of the USA, my God , makes one wonder how many ignorant people have voted for her.","commenter_a":"awwwww wasn't trained???? They keep saying she's so \"intelligent\" and the most \"Qualified\". Everything about her is BS! The absolute worst Democratic candidate EVER!","post_message":"A senior Department of State official claimed there is no documentation showing former Secretary of State Hillary Clinton ever received training in the proper handling of classified materials, according to a June 30 Department of Justice filing in U.S. District Court."},{"comment_id":"10152842669910779","commenter_b":"Feminazi alert","commenter_a":"Why aren't you showing her as an athlete, instead of an object? Such utter bullshit.","post_message":"She’s “a beast.” The “most dominant athlete alive.” The “greatest athlete” UFC president Dana White has ever worked with. But what’s her life really like? And how did she go from living in her car to being MMA’s unstoppable force? Erik Hedegaard tangles with Ronda Rousey. Click through to read the full feature."},{"comment_id":"1046767232087074","commenter_b":"@username I know that - he promoted that they would all go back intially and has since changed his agenda. He announced it more or less on Hannity last night - please read the comment again. There are AT LEAST 11.5 of illegals in the nation who would not be classified as criminals. And even tho \"they would not be given citizenship\" who does not know the Left's MO - of course the left will push for voting rights. The Left needs an underclass to stay in power. They are building the numbers year after year of voting blocs to keep themselves in power!","commenter_a":"So you are going to let the 11.5 illegals stay in the nation. You say they will not be given citizenship. You must know that most of us on the right are not stupid by now, right? The Marxists will push for their voting rights anyway - and get them w/a song and dance. And there goes the nation. We will never get her back - ever. The Left is delighted. They did it. They stacked the nation in their favor. WHY do you think the wall was never built? RIP USA.","post_message":"Will be on #Hannity @ 10pE on Fox News - discussing various subjects including immigration - if elected, we will #BuildTheWall & enforce our laws! Tune in - as Donald Trump Jr. Joins me with other special guests!"},{"comment_id":"470527006471213","commenter_b":"This lady thinks she is the president,this too shall pass just like her food for the kids at lunch time.","commenter_a":"I still want to know who elected the bitch","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"}]
