[{"comment_id":"10153977245641509","commenter_b":"Shirts for everyone!! If women can keep their shirts on, so should men.","commenter_a":"Yes","post_message":"This isn't just about decency, a CNN commentator writes -- it's a small exercise in democracy. What do you think? @webpagelink"},{"comment_id":"1139514676096919","commenter_b":"#TrumpThatBitch","commenter_a":"Hillary is dirt","post_message":"Hillary Clinton and Donald Trump clashed repeatedly over the economy, tax cuts for the wealthy and ISIS in the first of three highly anticipated presidential debates. Read KTLA's story here: @webpagelink"},{"comment_id":"455564827957330","commenter_b":"So then maybe, when girls get pregnant and don't want to keep it, @username, you will take them?","commenter_a":"I wish it wasn't legal. There is nothing whatsoever \"OK\" about killing an unborn baby and justifying it as \"a woman's choice\". Women's rights and women's health issues have nothing to do with killing a baby. Albeit legal, it's a complete disgrace. But you're right - no tax monies should support it!","post_message":"Abortion is legal, but taxpayers shouldn’t have to pay for it. @webpagelink"},{"comment_id":"10153609424211130","commenter_b":"Does she have penis yet?","commenter_a":"No one likes the murdering bitch... she is no friend of the LGBT and most us want her to go away.","post_message":"Caitlyn Jenner has a clever idea for how to beat Ricky Gervais at his own game."},{"comment_id":"10152889552848717","commenter_b":"Bringing a gun to a bomb explosion? Okay....","commenter_a":"Save natural causes, racism has directly or indirectly been the cause of death to every single black in this country. Ponder that statement for a minute, because it is the truth. If you are black, eventually racism will most likely lead to the cause of your death, whether it is diet, subsequently health, or murder. The degree of oppression will take its toll. Dying of a natural cause is a luxury that few blacks will enjoy, and by natural cause, I refer to old age only. The degree in which we are hated is only mildly expressed in this video. The odd man out is usually hated with a vengeance, and we been tasked with that role since day one. No matter whom we go to war and help this country fight, once the war is over, our citizenship status becomes less than that of the enemy whom we help ...","post_message":"President Obama's nomination of Loretta Lynch to become the country's first African-American woman attorney general is a historic pick."},{"comment_id":"10153296243781130","commenter_b":"So if this chick had aids and she was bleeding all over, that's cool right?","commenter_a":"And in the meantime virtually no attention was paid to the actual winner of the women's race, Tigist Tufa. Instead the media focuses on this woman and her disgusting stunt. Why am I not at all surprised that Huff Post jumped on the bandwagon.","post_message":"\"Periods are here to stay, and our generation has the power to put this conversation on the map today in order to blow through stigma.\""},{"comment_id":"1554819554825337","commenter_b":"i dont have to even listen , i can tell by how stupid she looks","commenter_a":"Lunatic left.","post_message":"This is downright shameful."}]
