[{"comment_id":"555840684604224","commenter_b":"Look how christianity views woman it's almost as bad","commenter_a":"What confuses me is why women would want to stay in this horrific religion that view women and children less than animal's. Mohammed is dead he isn't coming back !!!","post_message":"Spread this..."},{"comment_id":"10153278780012217","commenter_b":"Cats.... Some cats have the devil inside them.","commenter_a":"Not only dogs... All animals r best friends... Its only human who hates","post_message":"Man's best friend."},{"comment_id":"1722190664688272","commenter_b":"Go back to your Country!","commenter_a":"Then get the hell out of our country.. go back to your country so you can smell camel s***","post_message":"Muslims Throw Fit Over Odor From Bacon, Then THIS Happened Do you love the smell of bacon? @webpagelink"},{"comment_id":"1859387827662515","commenter_b":"Why is she not in prison????? Any other American citizen would have been hauled off immediately!!!!!!!!!!!!!","commenter_a":"Can't she just go away?","post_message":"SHE'S B-A-A-A-CKKKK!!! Hillary Makes Crazy Video Calling Leftist Troops To Join Radicals In FIGHT Against Trump…\"KEEP FIGHTING!\" [VIDEO] That whole crazy eye thing doesn't appear to be getting any better…"},{"comment_id":"10153561426376135","commenter_b":"we know this lady is","commenter_a":"Why would I answer those stupid questions to see this story? WXYZ are you crazy?","post_message":"In 2015, in Troy, she was charged with assault and battery. She later pled to disorderly person and, two weeks ago, she was ordered to pay a $500 fine and attend anger management."},{"comment_id":"1615187908768322","commenter_b":"She is big piece of shit","commenter_a":"Oprah will have to answer to God , I believe Judas turned his back on Jesus . Oprah will have her day","post_message":"WHOA! Take her off TV."},{"comment_id":"1271408779539022","commenter_b":"You girls are hilarious 😘😘","commenter_a":"Marijoe!!!!","post_message":"The whole thing is very ~Mermaid goth.~"}]
