[{"comment_id":"10155037576899268","commenter_b":"So, all wives are prostitutes?","commenter_a":"When you obviously marry a man for his money, what else would you call it. If you sell your soul to the devil, you're a prostitute. After all, no one would want this orange Cheeto if it wasn't for his money.","post_message":"Melania Trump doesn't deserve to be slut-shamed."},{"comment_id":"1195300027229716","commenter_b":"Nope, they would be saying who wants a whore for president. Very hypocritical.","commenter_a":"If Trump is so rich, why can't he afford better concealer? I mean damn, look at him in this picture.","post_message":"GREAT question!"},{"comment_id":"491494467719874","commenter_b":"What a dumb ignorant Bitch !","commenter_a":"And she's working on some kind of a reality show where she's a \"judge\"??? OMG!!!!!","post_message":"There it is. There’s the stupidest thing she’s ever said."},{"comment_id":"10153409459121051","commenter_b":"What a bunch of cowards. The black girls are bigger then the white and it takes 6 of them to whip one white girl. They are just trash and need to go to jail","commenter_a":"Let's take them and whip their ass","post_message":"Beating this teen girl senseless wasn't enough for these women. They also decided to leave a special message on her forehead."},{"comment_id":"10158198305710206","commenter_b":"Exactly why women shouldn't be police officers!!","commenter_a":"Hodor.","post_message":"Nice try!"},{"comment_id":"10153594866289641","commenter_b":"Ignore these followers of ayesha exploiter. their book says its good to drink camel piss and have sex with a goat.. dont mind these illegitimates children of arab savages","commenter_a":"WTF.....I know so many Hindus who drink cow's milk. ...n why shouldn't they eat beef. ...totally nonsense. .","post_message":"In Hinduism, cows are deemed sacred and their killing a sin."},{"comment_id":"10153997229702042","commenter_b":"You ladies don't have knees or you like the attention... Knee to the groin!!","commenter_a":"Get him off the streets","post_message":"Police are looking for this man who allegedly groped and rubbed his groin against a subway rider on the train. \"SHARE\" this post to help police find this man."}]
