[{"comment_id":"1792151467673200","commenter_b":"Right a true nasty woman!","commenter_a":"The only \"educational\" facet in Rosie is her nastiness! Period.","post_message":"Rosie O'Donnell says she posted a tweet questioning whether Donald Trump's 10-year-old son is autistic because she found it \"educational.\""},{"comment_id":"403409623179979","commenter_b":"And Hillary with Bill and Chelsia in tow is better. Maybe the icing looks better, but the cake is just as bad and tastes like crap.","commenter_a":"Do you ever wonder which one of the 14 GOP wannabes will get the nod. \"Please forget I'm a Bush, Bush; Mr. Personality Egomaniac Trump; etc. . Fourteen is a long list. I can't keep track. . .","post_message":"\"The crankiness of Scalia's insults run inverse to his intellectual consistency.\" Jon Stewart"},{"comment_id":"1178660005508189","commenter_b":"You're a dumb cow lol grow the fuck up","commenter_a":"She is a stupid mom, not the way she feeding the baby, where or when, the way she treat the baby after feeding, you stupid cow, be more gently, you don't have to punch the baby back so bad,","post_message":"Why doesn't she just go into the bathroom to breastfeed her baby? Her answer is perfect. A video by Jess Blank, with special thanks to Rachelvfitness."},{"comment_id":"1250456418323110","commenter_b":"Wonder what he or she was gonna tell on Clinton. What does that make now 4or5.","commenter_a":"How many more?","post_message":"DEAD!"},{"comment_id":"975170995873379","commenter_b":"Boo you whore","commenter_a":"She's still a total train wreck? What change?","post_message":"This medicine changes the life of anyone that uses it."},{"comment_id":"10153842554698132","commenter_b":"How about all of the leading men she banged?","commenter_a":"He deserved it for having to put up with her stupidity","post_message":"\"That's actually a common answer believe it or not,\" the host replied. @webpagelink"},{"comment_id":"1211673908894956","commenter_b":"ROTTEN NO GOOD PIECES OF CRAP, FIRE LESTER HOLT, DAMM LIBERAL , AND RUN HILLARY TOO PRISON WHERE SHE BELONGS.","commenter_a":"If she gives out free college who do these dumb asses thanks whos going to pay for it _ we are","post_message":"A rigged election!!"}]
