[{"comment_id":"10154063535716813","commenter_b":"Can I grab your pussy?","commenter_a":"I am so grateful for the @username and it's willingness to take a stand. I don't always agree with it's position, but I am always thankful for its existence and its hard work.","post_message":"ACLU Legal Director David Cole's closing remarks at Sen. Jeff Sessions’ confirmation hearing for attorney general. \"If someone applying to intern for one of your offices had as many questions in his record as Sen. Sessions has: racist comments, unethical conduct, padding of his resume, you would not hire him — absent the most thorough investigation and inquiry, if then. Sen. Sessions is not seeking to be an intern. He’s nominated to be the most powerful law enforcement officer in the nation.\""},{"comment_id":"10154016611014087","commenter_b":"I agree but Jill can't win. It'd be impossible. So Hillary because of the Supreme Court","commenter_a":"\"The dems candidate is a disgusting violent criminal who should be locked up\" - every republican. \"The Republicans candidate is a disgusting violent criminal who should be locked up\" - every Democrat. \"You both are right\" - every sane person in the country #jillnothill","post_message":"Minnesotans have not voted in a Republican at the presidential level since Richard Nixon's landslide victory in 1972."},{"comment_id":"10153565687858984","commenter_b":"JAIL HER","commenter_a":"LIAR like her husband.","post_message":"Hillary’s been caught in another blatant LIE regarding her private email server. In a recent interview, Hillary said she had not been subpoenaed by the Select Committee on Benghazi, but records indicate she was subpoenaed in March 2015. Even the press covered it! Rep. Trey Gowdy won’t tolerate her deceit, and neither will we. Send a message to Rep. Trey Gowdy telling him what you think!"},{"comment_id":"10154028893376051","commenter_b":"He is going to build a wall. Send back the goobacks and bomb Isis. Has my vote. If he triples the debt the libtards shouldnt mind. They have no concept of paying bills.","commenter_a":"Does that mean that Trump will put the country in more debt than it has been before him? Does it mean that Trump will instigate a covert plan to arm terrorist nations? Why exactly is that a good thing?","post_message":"Brexit leader Nigel Farage says Donald Trump reminds him of a modern-day Ronald Reagan. Will you be supporting Trump this November?"},{"comment_id":"10153236305609342","commenter_b":"You have a brown child, she can easily be in the same boat!","commenter_a":"Hopefully her family can let her rest in peace and find a new cash cow to milk..","post_message":"JUST IN -- The 11-page report released Friday corroborates findings detailed a day earlier by Waller County officials. Warning: Some details are graphic."},{"comment_id":"10153148405249753","commenter_b":"Fuck you again bitch and fuck your manner too. Don't come to teach about manner. My mama only said \" baby, respect everyone before get that respect back.\" My mama is better than yours.","commenter_a":"Everyone shall be respected the American's rules because we are living in America, not your or mines, so lady get that into your head.","post_message":"The Dearborn Police Department has been slapped with a lawsuit after a Muslim woman says that she was ordered to remove her hijab, or headscarf, for her booking photo after she was arrested."},{"comment_id":"10153178614619342","commenter_b":"This dude doesn't even capitalize TEXAS or GOD and y'all comment on this???Surely the fear of God sounds so Christian???? LOVE IS LOVE END OF STORY!!!","commenter_a":"texas is a god fearing state.we will not compromise on our faith","post_message":"JUST IN: Texas Attorney General Ken Paxton calls the Supreme Court decision giving same-sex couples the right to marry a \"lawless ruling\" and says state workers can cite their religious objections in denying marriage licenses. STORY --> @webpagelink"}]
