[{"comment_id":"10154001964165329","commenter_b":"yep these girls need to be fitted properly and get the right size!","commenter_a":"Dude half of them are in the wrong size & the VS bra featured isn't a push up, it has all over padding. This makes me want to give them all personalized lingerie sessions / lessons","post_message":"Do push-up bras actually work? And if they do, do they make us feel any better?"},{"comment_id":"1109027105857009","commenter_b":"As the meme says, \"If you don't have a vagina and womb, keep out of mine!\"","commenter_a":"I support Bernie. Because I can't stand either Hillary or Trump. And because he wants Single Payer health care. But the Democrats are insane to support abortion rights. We will ALL be held accountable before God for the murder of our children.","post_message":"We're PROUD to be Democrats. Are YOU?"},{"comment_id":"445713658965481","commenter_b":"Time to start rounding up these radicals. They will destroy everything","commenter_a":"Is time to retaliate! !! A good MUSLIM IS A DEAD MUSLIM. ... kill them all ......","post_message":"A Florida College Student was Brutally Attacked by Five Muslims On Patrol Enforcing Sharia Law. @webpagelink"},{"comment_id":"10153864923562490","commenter_b":"Women do not belong on boats or in combat this is just common sense and has everything to do with sex...","commenter_a":"Being a navy veteran, I don't agree with this. They already had a court martial case where enlisted male sailors were tried for taking pictures of female officer submariners showering....","post_message":"First enlisted women report for duty to sub force in early 2016."},{"comment_id":"10155808489605968","commenter_b":"Exactly.","commenter_a":"Of course they knew.","post_message":"KEY POINT: \"The current and former officials said that although they believed that Pence was misled about the contents of Flynn’s communications with the Russian ambassador, they couldn’t rule out that Flynn was acting with the knowledge of others in the transition.\""},{"comment_id":"370446236477004","commenter_b":"Take the bastards OUT!","commenter_a":"Time for drone, and Hell Fire missles.","post_message":"Is your state on the list?"},{"comment_id":"10153157386338984","commenter_b":"MUSLIM ASSHOLES","commenter_a":"@username:(. Not all blacks are Freeloaders. You are being Racist I hope you don't teach that to your Grandchildren's. What about the Bushes when they were in WH and they traveled around the world,that was ok right. And you Republican want another fucking Bush in office.","post_message":"Outrageous. This makes my stomach churn. I think we should make HIM pay up... Do you think Obama should be impeached?"}]
