[{"comment_id":"10154380784584877","commenter_b":"And this lady is Exhibit A.","commenter_a":"Maybe way back in the day... Im not trying to be funny but women of a certain background look good till about 35 and then start to look haggish","post_message":"People are still coming out of the woodworks to stake their claim on Prince's estate."},{"comment_id":"10153080181251519","commenter_b":"Like StepFord Wives.. Im ashamed that A Women could trash and allow other sisters to have their rights taken away!!","commenter_a":"How can these people especially GOP WOMEN accept that party????","post_message":"Megyn Kelly slams Trump for calling women ‘fat pigs,’ ‘dogs,’ ‘slobs,’ and ‘disgusting animals'... and he laughs -- and so does the GOP crowd."},{"comment_id":"560003900832233","commenter_b":"Dont lose or give up your beliefs or faith..Those who seek to destroy your lives over a cake are the ones with deep rooted hate for anything good..And they want to call themselves victims of bullying..How perverted American have become when they hate their own and embarce filth as good..So busy hating Christians and not seeing that the Government have been taking yours rights away too..Hooray to the Muslims","commenter_a":"What's messed up is these people refused to back a cake for a gay wedding. The couple wasn't discriminated against. The kliens simply didn't want to participate in something they deem as sinful. How is that forcing their beliefs on them. So now they are out of business and the militant intolerant left made it happen. While our backward minded liberal pals are doing their best to persecute Christians at the same time and probably at this very moment Muslim bakers regularly turn away gays. These incidents do get reported but the liberal media refuses to report on them and the militant LGBT stay silent.","post_message":"A Daily Signal Exclusive: Bakers Facing $135K Fine Over Wedding Cake for Same-Sex Couple Speak Out"},{"comment_id":"10154173554642061","commenter_b":"We are all called on to help our fellow man","commenter_a":"Nice guy!!!","post_message":"School bus driver, who is a U.S. Army veteran, noticed one of his students was crying when he boarded the bus, so he bought 10 sets of gloves and hats for that boy and other kids in need. \"No one wants a kid to suffer like that.\" @webpagelink"},{"comment_id":"10156258730695725","commenter_b":"Come to grand junction","commenter_a":"medias are crooks ...liars liars and liars gooooo trump you still got my vote and my whole family","post_message":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair #GOPdebate!"},{"comment_id":"828114997284754","commenter_b":"Can goats give consent?","commenter_a":"Polygamy is next. Then incest not far behind. Chris you gonna marry a goat?","post_message":"BREAKING"},{"comment_id":"10152886398966378","commenter_b":"She makes me sick!!!!! And look at her with the big smile on her face,I'd like to smack the sh-- out of her!!!!! Loose your license!!!!","commenter_a":"Put an arrow through her head!","post_message":"NEW DEVELOPMENT: The case of a veterinarian fired over a Facebook post of a cat with an arrow through its head is heading to the DA for charges."}]
