[{"comment_id":"10153472333633352","commenter_b":"So how do you teach your girls how to be in a stable relationship?","commenter_a":"I have 3 daughters & until they grow up, no man will harm them under my roof. I sacrifice my dating a man or finding a love, so they can always feel safe. I won't allow a man to enter my life until my task is finished!","post_message":"Woman Murdered by Boyfriend After She Allegedly Asks Him If He Assaulted Her Daughter in a Sexual Manner – Daughter Also Murdered, Then Man Takes Own Life."},{"comment_id":"10153254451090671","commenter_b":"and that's why you women are pathetic ladies should not twist my words around","commenter_a":"most women are less productive as far as in the construction field is concerned but in the construction field I think they are paid the same I don't like working with women every time I do I have to work harder just to keep the same production schedule going","post_message":"Under the new law, an employer must show the “differences in wages are due to factors other than gender, that the factor is job related and reasonable and that these factors, rather than discrimination, account for the difference in pay.”"},{"comment_id":"10153092280824270","commenter_b":"Was your clothing allowance enough to buy everything? If it was, DoD finance screwed up AGAIN and will correct that issue shortly. They apologize for any inconveniences this may have caused.","commenter_a":"Not sure why people are complaining about buying them. That's what a CLOTHING ALLOWANCE is for. It's nothing new. We had to buy our own ACU's too when they came out. I used my Star Card to get a couple sets and then paid myself back with my clothing allowance. Pretty simple.","post_message":"Soldiers can start buying the newest camo pattern on July 1 – the one that looks strikingly similar to what soldiers have been wearing in Afghanistan for years."},{"comment_id":"10154006446451680","commenter_b":"She is a joke.","commenter_a":"Making sure this cult leader doesn't get away with anything and Elizabeth Warren is one tough woman. Good for her.","post_message":"\"The American people understand the revolving door,\" Elizabeth Warren said. \"They're really sick of it.\""},{"comment_id":"10153322805023132","commenter_b":"She's still pregnant?","commenter_a":"I read it's a girl","post_message":"Do you think she's having a boy or girl?"},{"comment_id":"1032772820091472","commenter_b":"And white people killing white people. America is a violent country. One man can't change that! Sad, isn't it","commenter_a":"If he was still alive it still be the same thing black people killing black people so yea everything is the same thing it do not matter","post_message":"Absolutely!"},{"comment_id":"10156478047465231","commenter_b":"Her lips are gorgeous","commenter_a":"Somebody is jealous of this beautiful lips!!! :* :* :*","post_message":"Some people just don't know how to cope when they see beautiful melanin and full lips."}]
