[{"comment_id":"10152750349506130","commenter_b":"Wow your a dumb bitch","commenter_a":"All these comments about donating the dress are so retarded. If a bride can't afford a dress she shouldn't be having a wedding. There's enough poor people getting married and procreating which is gross lol get your own dress and she can do whatever the hell she wants with hers","post_message":"\"I knew that a pity party was the farthest thing from what I wanted or needed.\""},{"comment_id":"10153252005637235","commenter_b":"Stupid girls","commenter_a":"Racist comments aside their flow is terrible.","post_message":"The girls insist they are not racists or bigots."},{"comment_id":"10153954425955329","commenter_b":"Hahahaha her get away!","commenter_a":"@username, Jane Archer, @username, @username, can you please pleeeease do this with Poppi, Ricky, Harlou and Max?!?!?! HILARIOUS!","post_message":"brb gonna go test my dog's loyalty"},{"comment_id":"10153395749836336","commenter_b":"Well what if I said I'm tired of boarder jumpers and we need a 50' tall concrete wall put up to keep them out cuz I'm tired of dealing with them. But I do love Mexicans. I mean all of it. I love the ppl just don't care as much for those who try to come to the states illegally.","commenter_a":"I'm totally on Trump's side here. The U.S. does need to end its TPA with ALL FOREIGN COUNTRIES! Regardless of how the ppl feel. Mexico is taking this offensively because they know that Trump will keep his word, he will stop doing business with them, he will put up a wall to stop immigration and Mexico doesn't want to deal with losing our money and then having to take care of all of their people who have illegally made a life in the states and are sent back to their homeland. I think the U.S. should do as Canada does and anyone who wants to become a citizen should have a sponsor.","post_message":"“I’m going to have to sue Univision now.” Moments ago, Donald J. Trump reacted to Univision dropping the Miss USA pageant after his comments on Mexico. @webpagelink"},{"comment_id":"10155225064836509","commenter_b":"I always wondered how these bathrooms would cleaned. A typical janitor would violate the law twice if he/she cleaned these bathrooms. Or maybe they just don't get cleaned at all","commenter_a":"Hillary's a racist bigot!! She's disgusting! Calling all black people \"Super Predators\" is beyond uncalled for and her beliefs and policies have shown her disdain for the community. Only racists and bigots could support a lying criminal old white lady like her. We arent in the 60s anymore, the \"good 'ol Goldwater\" years are over. Ya know Hillary, you remember saying you were a \"goldwater girl\"?! The same group that opposed the civil rights movement?!!","post_message":"JUST IN: A federal judge has temporarily blocked the University of North Carolina from enforcing the state's so-called \"bathroom bill\" from applying to three transgender plaintiffs."},{"comment_id":"1792831500973232","commenter_b":"Fucking Pussy","commenter_a":"Nice, so with the looming threat of another cold war, you guys will be able to cover the war with Russia when it happens! :D","post_message":"Signs are pointing to Madam President."},{"comment_id":"10154133671460950","commenter_b":"There was only 1 person who refused to vote guilty all 12 have to agree, this piece of shit refused to vote guilty. There were 11 people who voted guilty","commenter_a":"Its the south and besides he had an all white jury and he shot the man in cold blood it was caught on camera and the jurors call it a mistrial","post_message":"WATCH: Judy Scott, mother of Walter Scott, reacts to a mistrial being declared in Michael Slager's trial: \"It's not over 'til God says it's over.\" @webpagelink"}]
