[{"comment_id":"931007510269923","commenter_b":"You Don't Hit a Woman,You Turn and Walk Away !!","commenter_a":"Will someone please beat this woman beater up and take away his nfl career.","post_message":"Florida State University quarterback De’Andre Johnson is charged with misdemeanor battery."},{"comment_id":"740770189446892","commenter_b":"Close all the borders already!!! Damn Obama!!","commenter_a":"Hang that Mo**ey!","post_message":"BREAKING: Muslim Teen Refugee Charged With Murder For Beating 97 Yr Old WWII Veteran To Death This is what happens if we let refugees into our country. This needs to stop. Do you agree we should close our borders?"},{"comment_id":"691444044379507","commenter_b":"Hate Crime.. All of these black criminals are Racists","commenter_a":"This is bullshit! There's hundreds of incidents happening everyday! Want to be fair put them all up everyday!","post_message":"A white father and son were killed by two black teens and there are no riots. The media is completely one sided. Race Baiters are the problem. Do you agree Al Sharpton is the problem not the solution?"},{"comment_id":"699418583582053","commenter_b":"Jaye you're a perfect example of a dumb blonde .....","commenter_a":"What in the heck did Obama do to deserve impeachment!!!! People are just RIDICULOUS!!!!!","post_message":"Obama's college records were finally publicized and what they say... This is exactly what he has been trying to cover up for so many years. Do you think Obama should be impeached?"},{"comment_id":"10154209676831336","commenter_b":"Carolyn Ann Banet shut up hoe","commenter_a":"Women are dangerous, no matter what species!","post_message":"Yikes!"},{"comment_id":"766826556749286","commenter_b":"pigs","commenter_a":"Thug scum! Their families should suffer for the suffering they've caused others!","post_message":"So disturbing."},{"comment_id":"10158098122215192","commenter_b":"The Crusades need to happen again in Europe @username. Run out the same invaders once more.","commenter_a":"They should add terrorism to those charges. Just because he is not a muslim, doesnt mean he isnt a terrorist. He sure comes off as a muslim in appearance though. Could be a muslim convert. FBI and other authorities just doesnt want to tell us!","post_message":"Esteban Santiago, 26, was charged with an act of violence at an international airport resulting in death - which carries a maximum punishment of execution."}]
