[{"comment_id":"465155073666373","commenter_b":"Tax and spend.....are investments in our society.","commenter_a":"The problem with liberals they preach their beliefs and are hypocrites. Look at All Gore with his huge carbon footprint. Yes science is real and climate change is real this coming from a conservative but unless we get our house in order this country won't survive. The answer from liberals is a carbon tax. Let's see gas and electricity go through the roof and see the gap between the rich, middle-class and poor widen even deeper. You have to live what you preach and ultimately politicians are out only for themselves. There poor decisions impact the masses and we all need to wakeup. The problem with liberals is they think everyone who doesn't believe exactly like them are bigots or racists and there is no compromise. Tax and spend is not the answer the rich just find new ways to hide it and the middle class families keep falling into ...","post_message":"More proof they can't deal with facts."},{"comment_id":"10153261514799586","commenter_b":"There is no hope for trash like her, none. Evil cannot be cured by any medical means, can not be rehabbed by any therapy or therapists; its bone deep imbedded and what creates their DNA. The ONLY means of eradicating this evil is to permanently remove their existence from inhabiting the earth. Once removed, incinerate the physical carcass so there is absolutely no way of the evil occupying an ounce of space ever again, starting with animal and child predators of all existences such as this female beast.","commenter_a":"Word","post_message":"SHARE if you wonder the same thing. CC: Ricky Gervais #BanHunting"},{"comment_id":"10154169581782042","commenter_b":"@username dude are you serious?","commenter_a":"It will be shared with other waitress as a group in the restaurant where she most likely get $200 if there are 5 people working and 15 % to bar back #restaurantlife","post_message":"When an 18-year-old waitress saw a customer talking to her boss, she feared she had done something wrong. What happened next brought her to tears."},{"comment_id":"1056321337718549","commenter_b":"Racist bitch!!","commenter_a":"republicans say they are not scientists. Then they should keep their mouths shut about science.","post_message":""},{"comment_id":"10153445067641051","commenter_b":"She is a selfish bitch with no sense of humor for leaving him.","commenter_a":"I don't blame her. What a shame that he had to get drunk! Now suffer whatever it takes to get rid of other!!!","post_message":"This wife took one look at the tattoo her husband decided to get and immediately kicked him out of the house."},{"comment_id":"1808975196000308","commenter_b":"This news is pretty old. ..... hanging on by a thread NBC","commenter_a":"Chris El Paisitahh","post_message":"The painter who turned Donald Trump's penis into a viral sensation says she's received death threats and alleges one Trump supporter punched her."},{"comment_id":"10153808334131337","commenter_b":"Y should people have to log out of FB cause they don't like her?","commenter_a":"If you don't like her and don't like hearing about her then I don't know keep scrolling, log out of Facebook, go on about your life!","post_message":"Oh, sure, Kim Kardashian West..."}]
