[{"comment_id":"862139507221510","commenter_b":"Obama and Trump should get along splendidly then.","commenter_a":"Hillary is running a close second or maybe she is in first place.","post_message":"Yes he is! Do you agree with Trump?"},{"comment_id":"10154083377471433","commenter_b":"Good keep your foreign diseases in your own countries","commenter_a":"Oh you mean the country that out right said ....\"Death to America\"??? WHO CARES!!!!","post_message":"BREAKING NEWS: Iran suggests it will limit issuing visas to American tourists in retaliation for President Donald Trump's ban on refugees from Muslim-majority countries."},{"comment_id":"846327085437336","commenter_b":"How any woman could vote republican(step ford) is beyond me, but they need to turn off Fox and Friends. Lol","commenter_a":"I STAND WITH RAND! I am a woman that has worked hard to build a career and strong skill set and I have no complaints about my salary. I earn what I deserve based on what I have done for MYSELF. Women are not inferior, stop acting like it!","post_message":"Ugh. Senator Rand Paul announced his bid for the White House, and he's one of the most anti-woman politicians out there. If he thinks the war on women is over, he just doesn't get it."},{"comment_id":"10154162666938812","commenter_b":"Omg Hillary is a lier and got Americans killed! She only admits lieing when completely and totally caught","commenter_a":"Hillary should win Not that dumb Trump","post_message":"JUST IN: American Samoa Democratic Party says Hillary Clinton has won Democratic caucus. abcn.ws/1L42Yyx"},{"comment_id":"1009873989035649","commenter_b":"Is this bitch right about anything she should go back into hiding","commenter_a":"FAIL!!!","post_message":"Joy Behar calls out Carly Fiorina. Is she right?"},{"comment_id":"568744853313807","commenter_b":"Take her welfare away from her and force her 2 get a job!","commenter_a":"Their parents must be total Pieces of shlt","post_message":"Did this idiot DESERVE this?"},{"comment_id":"10153123506246770","commenter_b":"I have zero respect for someone who marries a low-IQ maid.","commenter_a":"But he is more concerned about foreigners who break our laws than citizens! See ya!","post_message":"Danny Diaz, campaign manager for Republican presidential candidate Jeb Bush, told The Daily Caller that Bush opposes abortion and would not promote it as president."}]
