[{"comment_id":"1233646523418790","commenter_b":"The filthy parasites must get the fuck out of the US","commenter_a":"Both my Great Grandparents immigrated , assimilated, learned English, no gov assistance, raised big families and loved this country for the opportunities & freedom it afforded them. We deserve the right to help those who earn the right to be Americans , but not those who come to take, hate, criticize and try to change America to suit their needs. JFK had it right .. \"ask not what your country can do for , but what you can do for your country \". Our Vets need first consideration when we spend our tax money... ! It's about time to help those who honor this country !","post_message":"Just when you think Trump can't do any better he implements policy like this one that puts AMERICANS FIRST! SHARE & LIKE if you think immigrants should never receive welfare! @webpagelink"},{"comment_id":"847481612018670","commenter_b":"Kick them out of the country,they do not deserve to live here! DEPORT!","commenter_a":"Deport them to Iran.","post_message":"OUTRAGEOUS: Little Muslim Rats At Public School Walk Out When NATIONAL ANTHEM Plays Do you agree they should be deported?! Share this EVERYWHERE if you do! @webpagelink"},{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"},{"comment_id":"999662090090320","commenter_b":"@username True enough, but do you know how RARE it is for a woman to change her mind?!!","commenter_a":"It takes a strong woman to change her mind! Thanks, @username for evolving to take a public stand for LGBT equality.","post_message":"“No future generation of LGBT Americans should live in a country that doesn’t embrace their full and equal rights.” hrc.io/1G7BhCp"},{"comment_id":"704368863070943","commenter_b":"He covered the swamp with scum!!","commenter_a":"Tge ma is a F-ing Con-artist!!","post_message":"Did Trump \"drain the swamp\" like he promised during the campaign? Vote below! LIKE Occupy Democrats for more anti-Trump content!"},{"comment_id":"860902143955854","commenter_b":"That woman is a melodramatic idiot.","commenter_a":"Hey Nancy! Pot IS illegal and it STILL didn't stop him from giving it to his daughter! Legalize it already. Lets save Mexico from gang violence, free up the prisons, and start bringing in tax dollars from paper rolls and business sales. Enough is enough!","post_message":"What's YOUR take on the legalization of marijuana? @webpagelink #Pot2Blame?"},{"comment_id":"1584230838542469","commenter_b":"DEPORT the illegal bitch.","commenter_a":"WTF!?","post_message":"In Obama's America, obeying the law and playing by the rules is for suckers."}]
