[{"comment_id":"10155786065335329","commenter_b":"I sincerely hope you don't have children or grandchildren. Do not reproduce. You know who needs serious psychological help? People who are so close minded that they can't see out their \"perfect little bubble\" and judge anyone and everyone different than them. I love my generation because we are some accepting individuals. We want equality for all because WE ARE ALL HUMAN!! why does it matter to YOU personally what genitals someone has/wants. Who they lay down with behind closed doors. Why is considered \"crazy\" for the parents to support THEIR child's dreams and aspirations. Like got damn lady. Worry about your own snatch and keep your negativity to yourself. ✌💚","commenter_a":"Wow that family needs serious psychiatric help.","post_message":"\"By four, Samuel broke out in hives when we tried to cut his hair, and at five he told us, through tears, that he wanted to burn his face off because it wasn a girl face.\""},{"comment_id":"475643605893567","commenter_b":"Why not hit I would if she did that to me","commenter_a":"First up, this woman is NO lady!","post_message":"This lady just messed with the wrong 73 year-old."},{"comment_id":"10154500485544062","commenter_b":"So the one girl should go back to Chicago? That's where she was born so that's her home.","commenter_a":"Assimilate, dump your hateful evil religion; or maybe you should go back wherever 'home' is.","post_message":"What would you have done in this situation?"},{"comment_id":"10153061886448188","commenter_b":"Show this to Omuslim in the White House, and remind him how EVIL his Muslim Terrorist pals are!","commenter_a":"The Quran says for them to kill all non believers of Allah......the ones that do not are called hypocrites .....why would anyone say this is not Islam? Quran (9:73) - \"O Prophet! strive hard against the unbelievers and the hypocrites and be unyielding to them; and their abode is hell, and evil is the destination.\" Dehumanizing those who reject Islam, by reminding Muslims that unbelievers are merely firewood for Hell, makes it easier to justify slaughter. It also explains why today's devout Muslims have little regard for those outside the faith.","post_message":"We as a company have aired or released many horrible images in our short tenure as a media outlet, none of which have risen to the level of depravity of the images of Lt. Muath Al-Kaseasbeh’s death. We had chosen not to release these images out of respect for the victim, his family and his countrymen, but also because we do not wish to spread fear and the message of psychopathic killers. This morning, I, as the owner and operator of TheBlaze, have changed my mind. After looking at the images again, I believe it is important for the world to see them. We have been lured into a poppy field where we have fallen fast asleep as grave danger quickly approaches. It is time to wake up. This is the enemy of all mankind. Make no mistake, this is a global jihad and it has everything to do with ..."},{"comment_id":"1080670505276592","commenter_b":"Unbelievable! This is going to backfire on them. ut makes them look pretty disgusting. Did they use children because the parents can't speak English?","commenter_a":"Bet our tax dollars are paying for those braces leeches","post_message":"Foul-mouthed kids yell at Donald Trump in new campaign"},{"comment_id":"10153792156382439","commenter_b":"I would be pulling my children out of that school and looking for a different country to live in... preferably muslim free....","commenter_a":"Sounds a lot like how they kicked of the 3rd Reich.","post_message":"As part of a school project, German children are required to cook and clean and change the bed linens for refugees. The host country becomes subservient to the invaders. A letter written by the Schleswig-Holstein Ministry of Education and Vocational Training, says “pupils will spend a day in a transit accommodation and help for example, fix up as beds as well as help in the collection of donations.“"},{"comment_id":"10154450699361323","commenter_b":"Umm... because she's a woman!","commenter_a":".On what grounds does such a person NOT rather enter in the MALE-items?....","post_message":"\"It is unquestionably a sensitive and complicated issue and one that has arisen many times at the Olympics and other sporting competitions where it has been alleged that male athletes have attempted to compete as women or, in Caster Semenya’s case, that a woman has an intersex condition, which provides an alleged unfair advantage.\""}]
