[{"comment_id":"1360158044010314","commenter_b":"Yup :)","commenter_a":"Yes, America will get it right. Our next President will be Donald Trump. I pledge to all the women like me not to listen to the media who wants to portray Mr Trump as being against women, please don't listen to it. Mr Trump will be good to everybody in his administration. He is a fair man.","post_message":"THANK YOU, AMERICA! I love you!"},{"comment_id":"551369591720287","commenter_b":"She is a disgrace to every First Lady America ever had, not to mention every woman in America. neither she or her husband know their ass from their elbow.","commenter_a":"They need to be GONE !!!!!!!!","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"10153080990943812","commenter_b":"Scumbag","commenter_a":"Why wasn't the mother given custody ? Custody was given to a parent with mental ssues ? This is not the rest of the story yet . Florida fails aagain and again we hear about more changes. Meanwhile NO ONE is held accountable and a child is dead. Oh well.","post_message":"UPDATE: Attorney says she reported to authorities that father was acting erratically before he allegedly threw 5-year-old girl from bridge to her death in Tampa Bay: @webpagelink"},{"comment_id":"1713613852259060","commenter_b":"a matched pair of idiots","commenter_a":"Ain't that the truth!","post_message":"Are you... KIDDING ME!? So sick of Barack Obama & Michelle Obama..."},{"comment_id":"908467619212716","commenter_b":"They are idiots. Why have 19 kids? Whats thier motive? This is called incest.","commenter_a":"Let the legal system work the way it should.","post_message":"Is anyone surprised by this?"},{"comment_id":"1166767616720554","commenter_b":"@username - Deceit + Greed = Hillary Clinton.","commenter_a":"Here is what a Real Poll looks like in America. Please take the Time to Read.. A Total of 50,000 people Polled in 50 States.... PG Farnsworth We have just completed our own poll since we cannot get factual information from the mainstream media!! We called 1000 homes in each of the 50 states and asked basic questions on the economy, terrorism, immigration and presidential pick. Economy was the number one factor that Americans are concerned about and terrorism was number two. Presidential pick was Trump by a large percentage. Trump 33478 votes 67% Clinton 9788 Votes 19% Undecided or other 6739 votes 13% My friends and I are all Graduate students from all walks of life we meet to discuss stuff. 13 people who like and have served in the Military. It took us most of two weeks to be sure our calls were to all people and not ...","post_message":"U.S. Department of State reports show that 2,340 Syrian refugees arrived last month in the United States."},{"comment_id":"964264026942026","commenter_b":"I luv u tooo bitch","commenter_a":"That is fucked Up... But so entertaining...","post_message":"Details → @webpagelink Police The Police (Y)"}]
