[{"comment_id":"1144808412242519","commenter_b":"Keep them from working, take away their freebies and they will go back home on their own. Arrest the Gangster Types and deport them, then Build That Wall.","commenter_a":"He should be in jail with killary!","post_message":"A 4-4 tie decision by the Supreme Court upholds the lower courts decision and blocks President Obama's executive action on immigration (#DAPA). This means NO WORK PERMITS for the 4-5 million illegal aliens affected."},{"comment_id":"1313980255294149","commenter_b":"this woman simply cannot be a fisrt lady.. Why doesn't trump talk about deporting her ass?","commenter_a":"I am sure he didn't marry her for her to speak. When I think of all the haters who said Michelle Obama had no class (ridiculous), I wonder if they will be thrilled with FLOTUS, Melania Trump.","post_message":"Ha."},{"comment_id":"1740459202903983","commenter_b":"SHE IS A FELT POINT SPOILED BITCH THAT HAS NEVER WORKED A DAY IN HER LIFE","commenter_a":"Having second and third generation entitled political hacks like Pelosi is what breeds assholes like Trump. In the end, Karma is a bitch. This country can do better.","post_message":"Nancy Pelosi blasted her Republican colleagues for not taking action on gun control, saying after every shooting there is a moment of silence, which means nothing without action. Pelosi states \"a moment of silence just left there is a moment of denial.\" Do you agree?"},{"comment_id":"10154339117992619","commenter_b":"THERE JOINING ISIS WILL LIBERATE THEM FROM ALL THERE PROBLEMS","commenter_a":"SO YOUR POINT IS ????","post_message":"A transsexual man and his gay female friend, have left to join ISIS, unaware that ISIS publicly executes gay people by throwing them off buildings and stoning them."},{"comment_id":"10156255636920354","commenter_b":"At least admit you got beat up by thugs...","commenter_a":"To bad the band did not hit him in his lying liberal mouth.","post_message":"Things are about to get VERY interesting..."},{"comment_id":"10154191985279497","commenter_b":"Your a bitch","commenter_a":"obamas a piece of dog shit","post_message":" no need to be nervous; it a nice place, and I sure everyone will be very friendly to you. Barack Obama"},{"comment_id":"10153123905806800","commenter_b":"What??!!! A telling point, if in jest, that she made her own rules!","commenter_a":"Sorry, John. I usually love your stuff, but you missed the point on this one. As someone who used to have a government email account, this is a big deal. Every government employee must have one, and to access most government systems, you need to use it. This allows those emails to be captured as part of the public record. This is significant enough that it's caused me to reevaluate my support for her. I see two major issues: 1. I can't imagine the hurdles and hoops her staffers had to jump through to make this happen. And it wasn't like it made things easier for Hillary. Several high-ranking people I worked for had a government email account and hardly ever read it. Their staff checked their emails and passed on the ones they needed to know about (like just about any high-ranking person in a company). This just put ...","post_message":"\"Is that against the law not to have an email account? It seems less of a scandal and more of like a nerd snap. 'Oh, she so old she doesn't even have an official email account!'\" -- Jon Stewart ►Watch the episode: @webpagelink"}]
