[{"comment_id":"1111506915536985","commenter_b":"there always must be some mother Theresa online who will even justify leg surgery of mosquito..","commenter_a":"It's gonna be a waste of money to save that snake. Save it for someone who really needs surgery.","post_message":"That looks uncomfortable."},{"comment_id":"10154038278856990","commenter_b":"My prayers and condolences for the family. Heartbreaking.","commenter_a":"This is horrible.... I am not sure what escalated it into him putting one guy in a headlock and then getting stabbed by the 2nd guy, but I really feel for his family. All those babies will never be able to experience a completely happy Christmas again. :(","post_message":"A father-of-four went to Target to buy gifts for his children on Christmas Eve, but was stabbed to death as his 4-year-old son watched. A witness said the victim confronted a pair of men who were allegedly playing vulgar music in the toy section. @webpagelink"},{"comment_id":"1276379159041275","commenter_b":"Thank you for showing the American people what a corrupt lying bitch she is","commenter_a":"I think you should give this guy some kind of a metal for Honor possibly a fruit basket!","post_message":"Ohhhh boy..."},{"comment_id":"1680724472211527","commenter_b":"The falwells have been stealing and lying to americans for years. So it goes without saying thieves run together.","commenter_a":"Fallwell has lost his gourd.","post_message":"What a great honor- the Reverend Jerry Falwell Jr. of Liberty University, one of the most respected religious leaders in our nation, has just endorsed me!"},{"comment_id":"588476011355911","commenter_b":"I've actually flushed stuff better looking than this retarded skank!","commenter_a":"Why don't you leave like you said you would?","post_message":"Loud mouth Whoopi and her co-hosts are making serious unfounded accusations and demanding Trump step down. Let's get 5,000 'SHARES' & 'LIKES' to show that Whoopi is the one that America wants to see \"STEP DOWN!!!\""},{"comment_id":"10153606210716509","commenter_b":"she should have given him a stone cold stuner","commenter_a":"We need more moms like this!!","post_message":"What do you think of this mom's actions? Taking matters into her own hands, her son got a heavy dose of discipline on live TV: @webpagelink"},{"comment_id":"1546996122269558","commenter_b":"They should kill all the illegal immigrants.","commenter_a":"Cute he Looks Like A Real nice Guy?? Surprised Yo Mama Didn't pardon Him","post_message":"Texas Executes Illegal Immigrant Murderer, Despite Protests From Mexico. Good riddance. The world will be a better place. Do you think he deserved the death sentence?"}]
