[{"comment_id":"504319243082965","commenter_b":"So many of these republiCANTS are using the same old debunked arguments lol Here let's clear up some bullshit and hopefully reach new dialogue on how to possibly prevent further mass shootings: -we've all seen the \"scaring us into dictorship memes\" Our government is corrupt but giving up on how far we've come as a country just to say fuck it let's start a new government here and deal with THAT transition process instead of getting rid of something that Americans are rightfully pissed off keep killing their kids and neighbors. -Yes, when guns are gone crime will still be a thing. Shootings MAY be a thing. Google search the COUNTRY OF AUSTRALIA and stop lying to yourselves. If you have any solutions for stopping all crime please let the class know motherfucker. For now can we ONLY focus on preventable mass shootings? Less guns means less gun related crime, ...","commenter_a":"But they said guns don't kill people!?","post_message":"Who sold this guy his gun?"},{"comment_id":"10153483045518812","commenter_b":"She just wanted to be a hoe","commenter_a":"Is she right or is she wrong? If the male students have some privileges, so should the female students.","post_message":"High school graduate, who says she was penalized for what she said teachers and administrators described as “distracting” clothes, uses yearbook quote to strike back at school dress code: @webpagelink"},{"comment_id":"10153451111339087","commenter_b":"@username, Keep telling yourself that!! She doent have a chance, get over it already, find yourself a job!! Killary for PRISON!!!","commenter_a":"Screw Hillary and Bill, they are criminals and I don't like either of them!","post_message":"“Hillary Clinton is my candidate for President of the United States. She is best positioned to continue the progress made by President Obama on a range of issues -- from strengthening our economy to making the right investments in our infrastructure to common-sense gun safety laws to ensuring a fair criminal justice system,” Transportation Secretary Anthony Foxx said."},{"comment_id":"605420972951190","commenter_b":"The god \"them\" illegals.","commenter_a":"No guys. its not the trillions of dollars we spent on Nukes, its the god them illegals taking our tax money. #MakeAmericaGreatAgain","post_message":"The B61-12 gravity bomb is smaller and more accurate than the nuclear weapons we have now, and that has some experts very worried. Watch VICE on HBO tonight at 11PM to learn more about the next nuclear arms race."},{"comment_id":"1068974126482547","commenter_b":"@username, that is so true! WHORES ARE NOT WOMEN!","commenter_a":"Obama by far has been the worst president this country has ever had. He put America straight into the crapper. If Hillary gets elected she's going to pull the handle.","post_message":"We need to elect men and women who uphold the Sanctity of Life!"},{"comment_id":"1166947526658609","commenter_b":"I am a Democrat and I will not vote for this woman!","commenter_a":"the bride of frankenfood. no mercy.","post_message":"Is she in trouble?"},{"comment_id":"10153633737712464","commenter_b":"Go Cruz go. Tell the facts and let the media put a liberal spin on it. Planned Parenthood was meant to be racist by stopping more poor from the welfare rolls. \"HA!!!!\" They will say,\"It was an attempt to keep the Black Community from expanding the Voters Rights', or something like that. That's why Planned Parenthood buildings are in poor economic ares and not down the street from the $600,000-2 million dollar homes. Don't have to waste the fuel bills on buses that far out. Economics for the city. See it's not about lives. IF \"BLACK LIVES MATTER\", why is there even a dialogue about the killing of souls.","commenter_a":"Smarti - I aam not really interested in PP and I am sure you are looking up everything you can find to repudiate what Cruz says. Good for you if you think PP is on the up and up. I just don't understand paying all that money when it is not a gov operation. If it is a private business - great - let them fund themselves, don't use our money to help pay$ 600,000 salaries along without mentioning all the other expenses. I read $1.2 mil spent on things other than women's health. I really don't care about that stuff. I am more interested in what is going on in Syria etc.","post_message":"It says something about just how corrupt this administration is that there is not a soul on earth that believes the Obama Justice Department would even begin to investigate Planned Parenthood."}]
