[{"comment_id":"10152816607284877","commenter_b":"Girl you better zoom in! Boom","commenter_a":"Yet not a word about the lady in black. They can all kick rocks!","post_message":"Oh boy, they're coming for Michelle Obama for not wearing a headscarf in Saudi Arabia. Read more about her critics below. Grio fam, this seems foul to us. What do you think?"},{"comment_id":"1178660005508189","commenter_b":"You're a dumb cow lol grow the fuck up","commenter_a":"She is a stupid mom, not the way she feeding the baby, where or when, the way she treat the baby after feeding, you stupid cow, be more gently, you don't have to punch the baby back so bad,","post_message":"Why doesn't she just go into the bathroom to breastfeed her baby? Her answer is perfect. A video by Jess Blank, with special thanks to Rachelvfitness."},{"comment_id":"10153432969041037","commenter_b":"Liars too?","commenter_a":"History lesson needed here - the NAACP is and always has been open to people of all races/ethnicity for membership and leadership. This story is a non-issue.","post_message":"NAACP's Rachel Dolezal: \"We’re all from the African continent.”"},{"comment_id":"1155027644532693","commenter_b":"ignorants are eating Donald shit with lying pence","commenter_a":"NEW RULE : MAKE GRABBING PUSSY GREAT AND SAFE AGAIN.....LYING PENCE IS DONE FROM EATING DONALD SHIT .....BREAKING NEWS : HURRICANE DONALD DUMB IS ENDING THE PRESIDENTIAL RACE AND IT IS MORE POWERFUL THAN MATTHEW HURRICANE .... PAUL RYAN AND THE RNC CHAIR WASHED THEIR SMALL HANDS FROM DONALD DUMB AFTER WATCHING DUMB TRUMP PUSSY GRABBER CLIP ..... THE RACE IS OVER ...CONGRATULATION I ANNOUNCE .HILLARY CLINTON IS THE PRESIDENT OF USA ,,DONALD JOKE DUMB HIJACKED REPUBLICAN PARTY (LINCOLN AND REGAN PARTY ) LIKE ISIS HIJACKED ISLAM AND KKK HIJACKED CHRISTIANITY ,, I AM CALLING FOR COMPLETE SHUT DOWN OF DONALD JOKE DUMB FROM TALKING TO ANY WOMAN UNTIL WE FIGURE OUT WHAT THE HELL IS GOING ON .INCLUDING DEBATING WITH PRESIDENT Hillary Clinton","post_message":"She wants textbooks changed."},{"comment_id":"1769553679939796","commenter_b":"Those assholes responsible, should be in jail.","commenter_a":"Clueless in government or politics,draft dodger and buy politicians,insulting others or winning moron only will make a sorry Clown.😀PLEASE GROW UP LEARN THE RULES OF THE GAME INSTED OF USED YOUR MONEY TO MANUFACTURE HATS IN CHINA. 🇺🇸","post_message":"This isn't how democracy is supposed to work! Donald J. Trump is absolutely ANGRY over what Ted Cruz just did to him in Colorado. Do you think he has a right to be angry?"},{"comment_id":"1251860331547386","commenter_b":"She probably cheated..can't blame him","commenter_a":"Seems like all the guys in Berlin are pussies","post_message":"Cold blooded! #WSHH"},{"comment_id":"1245131405583109","commenter_b":"Hillary said she carries hot sauce with her to pander to blacks and said they are predators. New leaked emails said that democrats were making fun of black women names. Yep that's what the democrats think about you. You have been played","commenter_a":"all he really concentrated on is how the speakers totally dogged him out....lol...I loved it but thats all he heard...he didnt hear them talk about Isis...he didnt see them bring up 4 star generals..he didnt hear a thing about what Kareem Abdul- Jabbar said...he didnt see the father of a Muslim man who fought and was killed while serving in our armed forces...he didnt hear them address Black Lives Matter and the Police...he didnt hear them talk about our criminal justice system...so t makes me wonder what convention was he watching..","post_message":"\"They're not talking about radical Islamic terrorism. They're not talking about borders where people just pour across. They're not talking about the crime,\" - Donald J. Trump"}]
