[{"comment_id":"10153076397462452","commenter_b":"Yikes!!! Kill it with fire before it rapes again.","commenter_a":"Why do child molesters look so child molestery?","post_message":"A former drama teacher at Sycamore Junior High School in Anaheim has been arrested on child molestation and child pornography charges. @webpagelink"},{"comment_id":"10154290325745496","commenter_b":"Excuse me I'm not a racist I didn't like Clinton either so you just showed your true colors the left always does. I didn't vote for Obama but I sure was praying for the change he promised and boy we sure got it but it was nothing he promised so suck it","commenter_a":"All these liberals like to say Trump started the hate no I believe Obama started it 8 years ago","post_message":"Wondering what the blue ribbon is all about? Here: @webpagelink"},{"comment_id":"756073464525834","commenter_b":"The best part about all these whining Christians & their rhetoric to defend Christ against a money hungry corporation(which bye strives to destroy mom& pop coffee shops) when ppl are already starving to death or hooked up on drugs. Your Christmas was actually started by Constantine, centered around & similar to pagan holidays to make the transition to Christianity easier. Constantine was actually a pagan until his death bed to where he rejoiced unto God and saved his soul. Why don't you silly Christians who so vehemently judge and live so unlike jesus did do some research on the Christmas tree... It's also pagan, right down to the star on top to the ornaments around it. America was founded on freedom of religion, but that only seems to apply if it's Christian. And yes, the indigenous natives were massacred by bible carrying spaniards, priests, English, Dutch etc. It doesn't matter ...","commenter_a":"This is my last bit about the god forsaken red cups (no pun intended), and thats it. And please read before commenting. Starbucks, is not \"catering to people outside this country\"... Starbucks is a free enterprise, and not obligated to tell you Merry Christmas, in fact, they are not obligated to even do something for the holidays. There are many born and raised here with different faiths and they ALL believe in god, just not Christmas. For example the Jewish believe in God whole heartedly, just not Jesus, which Christmas is about. They also celebrate Hanukkah this time of year. Christianity is not even the first religion in this country, and Christians came here and slaughtered the indiginous for not being Christian, so it's not surprising they still don't accept other religions or respect them. That being said, businesses SHOULD absolutely have the right to say Merry Christmas If they ...","post_message":"Oops doesn't really cover it."},{"comment_id":"981909798535164","commenter_b":"No, I don't think he have to.","commenter_a":"No","post_message":"Bernie Sanders doesn't talk very much about faith beyond saying he's culturally Jewish. Jimmy Kimmel asked him, point blank, if he believes in God, and he framed his answer in a rather unique way. Do you think a president must have a belief in a god to be a good leader?"},{"comment_id":"10150721680719999","commenter_b":"That's not true @username. There care is every bit as good as ours and not nearly as expensive.","commenter_a":"We need a single payer system. My daughter lives in France, and I'm always impressed with their healthcare. Stress free.","post_message":"Here is the surest way to enjoy the peace of mind that comes with having health insurance: Don’t get sick."},{"comment_id":"517994265057820","commenter_b":"she is a pig","commenter_a":"She is an idiot, why does anyone give her the chance to prove it and get her 15seconds of publicity?????","post_message":"Mike Brown's mom just said something infuriating about the two cops who were just shot. This is absolutely disgraceful. No wonder her kid was a thug. Do you agree Mike Brown's mom is totally out of line?"},{"comment_id":"10153483912132522","commenter_b":"If only the two big candidates this election were Johnson and Stein. Either of them would be nice.","commenter_a":"Libertarians should all be required to live in Syria for a year. That is essentially what their government is (or lack there of).","post_message":"Gary Johnson and his running mate, Bill Weld, were equally dismissive of \"huckster\" Donald Trump and political status quo. \"The two-party system is a two-party dinosaur, and they're about to come in contact with the comet here,\" said Johnson:"}]
