[{"comment_id":"502672606580208","commenter_b":"Skinny African","commenter_a":"Chris, paddy maybe?","post_message":"Yes, marijuana gives you the munchies...but it can also make you thinner. Learn more here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"1701200686777335","commenter_b":"Gun laws will not effect non-American \"Crazy\" residents taking advantage of our Freedoms.","commenter_a":"What do you think the USA has done all over the planet.....we have bombed and killed thousands upon thousands of innocents and we are the victims? I think not","post_message":"“They want to blow up our country. They want to blow up our cities. They want to knock down our buildings, and [Pres. Barack Obama’s] worried about global warming. We have somebody that’s not in touch.” – Donald J. Trump"},{"comment_id":"10156267037025354","commenter_b":"Why are illegals allowed to have a drivers license? Utter insanity!","commenter_a":"Jerry Brown is a putz! He should have been out of politics decades ago. Look at California. It's a disaster.","post_message":"It's starting."},{"comment_id":"10154007626519456","commenter_b":"Yea, maybe this guy is right...slaves should learn to be free if they feel entitled to it!! Bring back discrimination!","commenter_a":"Isn't the govs job to tell anyone what they have to pay anyone for services. If you don't like what you make, increase your skill set instead of having the gov hold your hand.","post_message":"The bill passed on a 71-31 vote, and will now move to the Alabama Senate."},{"comment_id":"10153394444588984","commenter_b":"Reminds me of a script from Steinfeld when Kramer tryed to lie and win his lawsuit which he lost. What a pair they are. Wonder how she got the money for the trip? .","commenter_a":"So the Apple doesn't fall far from the tree huh ??? Lmaooo good one lol","post_message":"Shakedown artist Al Sharpton’s eldest child wants damages for “loss of quality of life,\" but looking at her recent photos, something seems a little fishy about the claim... Are you glad to see the younger Sharpton outed for this?"},{"comment_id":"10152850762031748","commenter_b":"Whose boobs is he reaching for? :)","commenter_a":"This is beyond bizarre!","post_message":"Religious Right pundit claims Satan is using gay rights to persecute Christian athletes"},{"comment_id":"1023160814385680","commenter_b":"Pussy bitch","commenter_a":"Fuck that! If that fuckin dog was comin at me is shoot the cunt too! No questions asked! Why risk your life for someone's untrained mutt!!","post_message":"The difference between firefighters and cops. Coward → @webpagelink Filming Cops (Y) via Cop Logic (Y)"}]
