[{"comment_id":"1459625230716396","commenter_b":"Send them home!","commenter_a":"Who's with me ?? BUILD the W. A. L. L.","post_message":"Deport them all, President Trump"},{"comment_id":"751075045025676","commenter_b":"@username I like the guy. He's obviously brilliant, but wasn't on top of his game last night. I'm glad he'll be able to survive it.","commenter_a":"Ben was kinda catatonic at the debate last night. Luckily, the liberal zealot moderators stole the show and the headlines.","post_message":"In 3......2......1.......BOOM!"},{"comment_id":"10152902421671378","commenter_b":"She needs to set her asss down ! Cthu","commenter_a":"Ratchet asss fools ! The Baltimore Mayor is INCOMPETENT ! Her dumb az decides to enforce a curfew 24 hours AFTER the riot starts... #blankstare Why hasn't she called The National Guard ???","post_message":"#BREAKING Action News reporter Kenneth Moton is in Baltimore and this is some of what he is seeing this morning."},{"comment_id":"1137553239588633","commenter_b":"I will not vote for Hi$$ary under any circumstances in November. It will not come to that because Bernie will win as he has the people behind him. They have done everything to suppress Bernie but they will fail. If she steals the nomination with the help of the corrupt DNC and the corporate media then please do as I and many other liberal progressives and take the Bernie or bust pledge. It is way past voting for the lesser of two evils. I refuse to be bullied into supporting her when I know that she is basically a GOP lite and if she is nominated we will lose. I will not help her and my vote is not for sale. So if it ever comes to that, I will cast my vote proudly in November for the only candidate that supports me - Bernie Sanders . I will do ...","commenter_a":"I'm not voting for Bernie as much as I like him only because I'm afraid it will be wasted. He's great but I don't believe he'll be elected. I'm going to lose it if Trump gets in","post_message":""},{"comment_id":"10157702092900354","commenter_b":"And yet she's still allowed to run for POTUS... And there are still fools who will vote for her","commenter_a":"They thought no one would ever notice .","post_message":"The Clinton Cash Foundation is a $2 Billion Corruption Racket."},{"comment_id":"1787974808090517","commenter_b":"When a woman as dumb as a rock has been a Senator, Secy of State, and candidate for president of the USA, my God , makes one wonder how many ignorant people have voted for her.","commenter_a":"awwwww wasn't trained???? They keep saying she's so \"intelligent\" and the most \"Qualified\". Everything about her is BS! The absolute worst Democratic candidate EVER!","post_message":"A senior Department of State official claimed there is no documentation showing former Secretary of State Hillary Clinton ever received training in the proper handling of classified materials, according to a June 30 Department of Justice filing in U.S. District Court."},{"comment_id":"611126095746235","commenter_b":"That's less people for Iran to jail and then demand ransom money for.","commenter_a":"Yeah they want to kill us but they want to take our money first good riddens who the hell would want to go there with those barbarians","post_message":"New post (Cancel your vacation plans: Iran bans US citizens, says US ban is \"obvious insult to the Islamic world\") has been published on Jihad Watch"}]
