[{"comment_id":"1272205819459623","commenter_b":"Trash. Sex film that she herself leaked and a nude photo? No!","commenter_a":"I agree with Bette Midler for once.","post_message":"\"Kim Kardashian tweeted a nude selfie today. If Kim wants us to see a part of her we've never seen, she's gonna have to swallow the camera.\" - Bette Midler"},{"comment_id":"10154298408534060","commenter_b":"Actually, it's incredibly efficient for what it is.","commenter_a":"All meat is a waste of energy and thus unsustainable.","post_message":"Human consumption of farmed fish has overtaken that of beef. In fact, aquaculture may be the only way to supply mankind with enough protein in the future"},{"comment_id":"10152767581187061","commenter_b":"Big deal. She is and always will be a pedophile","commenter_a":"She taught him in second grade??!!! How outrageous is that??!! And what about her 4 children that she already had? Not a word about them!! So wrong!!!","post_message":"Mary and Vili are still together and about to celebrate their 10th wedding anniversary. Their 2 daughters are now older than Vili when the affair started: @webpagelink"},{"comment_id":"1808417692765360","commenter_b":"Disgusting.. . I'm sure she's a Trumpette....","commenter_a":"Why do you promote this kind of story NBC???? if you promote peace, all of the robots that follow the trends just may jump on the peace bandwagon. They are here!!! That won't change. What we must remember is they are humans. Each of us will reap what we sow.","post_message":"\"Go back to wherever the f*** you come from, lady.\" Watch a woman go on a racist tirade against two Latina shoppers at a JCPenney in Louisville, Kentucky. Read more about the incident: @webpagelink"},{"comment_id":"536178543246730","commenter_b":"Meg Whitman is a disgrace and a lousy CEO.Bitch needs to shut the hell up.","commenter_a":"She's a fool","post_message":"SICK & SHAMEFUL"},{"comment_id":"10155605832169657","commenter_b":"Lock her up","commenter_a":"When you see it written out like this, it is nothing short of stunning. Clinton emails. Trump admitting sexual assault. Clinton emails. Trump charity fraud. Clinton emails. Trump calls for nuclear proliferation. Clinton emails. Trump calls for national stop and frisk. Clinton emails. Trump violates trade embargo with Cuba. Clinton emails. Trump sued over Trump U fraud. Clinton emails. Trump bribes DA. Clinton emails. Trump doesn't pay taxes for 20 years. Clinton emails. Trump employs campaign manager involved in illegal corruption with Russia. Clinton emails. Trump calls for ban of an entire religion from entering US. Clinton emails. Trump lied about support for Iraq War over and over in debate. Clinton emails. Trump in court for rape of a minor. Clinton emails. Trump unaware of Russia's Crimea occupation. Clinton emails. Trump unaware of situation in Syria. Clinton emails. Trump penalized for racist housing discrimination. Clinton emails. Trump files for bankruptcy ...","post_message":"Hillary wants you to believe that there's nothing to see."},{"comment_id":"1072091946219346","commenter_b":"Loooool she's just a hoe","commenter_a":"@username its that deep","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."}]
