[{"comment_id":"10152887029056336","commenter_b":"The yatahays are the illegals!!!","commenter_a":"We're all immigrant, except the native Indians.","post_message":"JUST IN: In a 237-190 vote, the House has voted to overturn President Obama's executive actions on immigration that extended protections to millions of people in the US illegally. @webpagelink"},{"comment_id":"388626891261906","commenter_b":"Rick have the nerve and turn them in!","commenter_a":"should politicians?","post_message":"This could be bad news for some people on food stamps."},{"comment_id":"10153186932521167","commenter_b":"Women who watch faux news confuse me","commenter_a":"Brittany Shelton OMG!","post_message":"We were going to do a \"Top 10 Awful Displays of Sexism on Fox News\" video, but the clips just kept rolling in. Here are 70:"},{"comment_id":"10153844148480579","commenter_b":"Only when they try to use it as the basis of their platform or legislation. Then it is a big negative.","commenter_a":"Media Silent As Muslims Ethnically Cleanse 60,000 Christians In Philippines By: Daniel Greenfield When thousands of Muslims become refugees, then you can’t get the media to shut up about it for weeks. Thousands of Muslim migrants... jewsnews.co.il","post_message":"Do you consider religion when evaluating a candidate?"},{"comment_id":"10153706337066694","commenter_b":"Point out the sarcasm in your original statement. You SUCK at humor AND sarcasm.","commenter_a":"Yes, because we should assume \"diets\" were a thing because bitches could bake bread....","post_message":"Deal with it, paleo dieters."},{"comment_id":"591571124359879","commenter_b":"@username : Educate yourself on the economy No wall it would cost over 530 billion in trade between US and Mexico costing over a million lost jobs in US alone and cause more than 3 states to go bankrupt. You may get a new fortified entry program but no wall.","commenter_a":"Trump failure to get Mexico to back down makes him look like the man who can't makes deals even with friends instead He was laid out and embarrassed by President Nieto of Mexico right from the beginning when they talked about the wall and was told Nexico would not pay for the wall , Nieto put Trump in his place so bad that Trump said they did not talk about payment of the wall . Trump was so embarrassed that on his flight back to US he changed his speech for the Arizona rally . This is a sign of a Man who can't control his emotions and would and could lead us into a Nuclear War .","post_message":"Government access and favors will no longer be for sale, and important email records will no longer be deleted and digitally altered! -DJT"},{"comment_id":"1595363807421142","commenter_b":"Hilary is a huge bitch","commenter_a":"Yes.///","post_message":"Hillary Clinton said today that Donald Trump's erratic temperament and lack of experience make him unfit to be president. Is she right?"}]
