[{"comment_id":"10154253294384486","commenter_b":"Jack, this heartless bitch is worse than an animal","commenter_a":"make no mistake,this is an animal","post_message":"Only 12,000 more signatures needed...."},{"comment_id":"10153206472131636","commenter_b":"Well said. If someone wants to dress from head to toe in black I have no problem with it, but full face coverage I find offensive and frightening. You can't read the expressions of a person with their face covered. Is it male or female? It's not necessary and definitely should be banned in the UK.","commenter_a":"There's a difference between Muslims who just wear the hijab (headscarf) and the niqab (face veil). The latter is simply cultural and is an import from Saudi Arabia and other countries that oppress woman (husbands don't like other men looking at their wives so will often make them wear one ) There is nothing in the Quran that says a woman has to wear one. I spend a lot of time in the Middle East and when in Rome and all that. It's not appropriate to have the niqab in our open society. British people might be tolerant but they don't have to be about absolutely everything. Women who wear the niqab segregate themselves from society. It's a barrier. The French have banned it and some other European countries have done the same. Britain should too. And before people start waving the \"islamophobic\" card. I happen to know a lot ...","post_message":"Staggeringly"},{"comment_id":"10157139733295354","commenter_b":"\"Lets bring in 1000's of Muslim refugees\" Sincerely, Libtards of America","commenter_a":"Have you seen this on BBC today ?????When Donald J. Trump offered to make Sadiq Khan an \"exception\" to his ban on Muslims travelling to the US, here's how the new London Mayor responded.","post_message":"***BREAKING***"},{"comment_id":"10153106111768717","commenter_b":"Ha Ariana Grande get out of America and don't come back and American people should boy cot all her music","commenter_a":"Well if she can lick donuts then it is the shop's problem in leaving them where she can do this, so the shop should be the ones facing criminal charges.....","post_message":"A doughnut shop owner wants Ariana Grande to face criminal charges for licking and spitting on doughnuts -- @webpagelink"},{"comment_id":"10153229988242293","commenter_b":"And who would that lady be? Certainly not this four times married adulterous who're?","commenter_a":"It takes lady to show the world what TRUE VALUES are; and how STAND UP in those VALUES ...!!","post_message":"Kim Davis entered the Carter County Detention Center under cover of night five days ago. She emerged to Survivor’s “Eye of the Tiger.”"},{"comment_id":"712854462154600","commenter_b":"Abe Foxman is a puppet and does NOT speak for most intelligent Jews!!","commenter_a":"We should HOUND their offices and call and support OREN","post_message":"“In the days leading up to the forthcoming release of a memoir of his experiences as Israel’s Ambassador to the US, Michael Oren appears to be using the very legitimate and sharp policy disagreements between Israel and the US as an insensitive and unjustified attack on the president,” Foxman said in a statement. “We hope that Ambassador Oren will walk back these unjustified attacks.\" -- ADADL - Anti-Defamation League Abe Foxman"},{"comment_id":"928293913874616","commenter_b":"Brain dead liberals.Why would you want to force someone to marry you?","commenter_a":"What makes anyone think that someone would want the clergy in your faith to perform their ceremony if they did not believe in it. Two people in love that want to get married would never choose someone to marry them that was not accepting of them. There are many other clergy accepting out there. Not all WANT religious rites. Civil ceremonies performed are the legal ones that count. Not one person (straight or gay) can get married in the church without that civil license first. People are getting totally out of hand on this. The church is going to do what they want anyway. What really counts is marriage is legal for all.","post_message":"Wow."}]
