[{"comment_id":"10154436464143931","commenter_b":"The wall will stop a lot of illegal aliens because they don't usually go thru tunnels. The tunnels are for drugs. They don't want a lot of people knowing where the tunnels are because if the people get caught they will snitch on the tunnels location. That's why they use the tunnels for drugs not people","commenter_a":"The drugs are smuggled thru tunnels underground.","post_message":"A wall would do little, if anything, to stop the flow of illegal drugs - the majority of which are actually smuggled though checkpoints."},{"comment_id":"10153779495443854","commenter_b":"WE ALL DEAD","commenter_a":"is this where the inhabitants of the northern hemisphere exterminate themselves","post_message":"Putin Warnes of Global War"},{"comment_id":"10154160813994657","commenter_b":"She is a criminal","commenter_a":"She's a disgrace, so are the people that support this nonsense","post_message":"Playing by her own rules?"},{"comment_id":"1160354710653984","commenter_b":"@username Strong action on car deaths, prescription deaths self infliction, immigrants have lower crime rates on average.","commenter_a":"But there are far fewer murders Committed with ARs than with handguns.","post_message":"Its use has taken the worst direction."},{"comment_id":"10153674136304641","commenter_b":"true... we just cant equate these refugees with terrorists.","commenter_a":"Its not about religion you fool! It's about your country's safety! Get that through your head!","post_message":"U.S. President Barack Obama's harshest remarks were for Texas Sen. Ted Cruz."},{"comment_id":"10154083249768984","commenter_b":"you bitch you took away something that is all American and turned it into a race baiter bunch of bullshit you and jazeeee suck please move","commenter_a":"behind the sheriffs all the way! DISGUSTING, RACIST, C!","post_message":"When these sheriffs saw what Beyonce was doing in front of the biggest TV audience of the year, they knew there was only one thing they could do... Do you support these sheriffs?"},{"comment_id":"10154220777628487","commenter_b":"u rude fuck","commenter_a":"I always find it irritating that a typical response to vegetarians/vegans is something along the lines of \"it's fine as long as you don't push your views on others.\" As a lifelong vegetarian for ethical reasons, I go about my day constantly reminded that the vast majority of the people I encounter are active proponents of what I consider to be systematic violence that trumps the holocaust. Imagine believing that and being expected never to mention it. I actually don't mention it, because I've found that people simply do not give a fuck about the suffering of animals, and it is far too depressing to endure such conversations. But it continues to irritiate me when people say, it's fine, just don't push your views on others.","post_message":"Russell Simmons, founder of Def Jam and author of \"The Happy Vegan\", teaches us how to defend the plant-based diet that many love to hate."}]
