[{"comment_id":"10155043885602908","commenter_b":"Move out of Big Blue high tax, high cost of living Commifornia. Problem solved.","commenter_a":"$7.25/hr equates to about $1250 a month before taxes. After taxes let's say $1000. I live in a studio apartment in CA and it's $885/mo. So $115 remains for 4 weeks of food, utilities, transportation to and from the job? Get real, America. Especially for a family even $15/hr would be a stretch, but it'd be better.","post_message":"It is a national disgrace that millions of full-time workers are living in poverty and millions more are forced to work two or three jobs just to pay their bills. A job must lift workers out of poverty, not keep them in it. The current federal minimum wage of $7.25 an hour is a starvation wage and must be raised to a living wage."},{"comment_id":"1275842862475459","commenter_b":"Might have to tell family to leave Italy and come here as refugees","commenter_a":"You don't have to be a genius to see that's happening now. Send them all to the middle east","post_message":"EU admit immigration will destroy European values"},{"comment_id":"541079112748211","commenter_b":"Well then lady's better take another look at HiLAIRy nothing respectable there","commenter_a":"Both Hillary & Donald Trumpet don't belong as our President! Trumpet definetely can't be our President. He's full of so much anger & rage! Lord help us all! And, with Hillary, we risk open borders & even bigger issues with illegal immigrants! Our poor country doesn't stand a chance with either candidates! I don't trust either candidates!","post_message":"WATCH: Undecided voters describe Donald J. Trump and Hillary Clinton's debate performance in one word. #FoxNews2016 #Debates2016 How would you describe their performances? @webpagelink"},{"comment_id":"898473566912365","commenter_b":"@Patty Royer, please do not breed. America already has enough mouth breathing inbred idiots and you, madame, and I use that in it's professional sense, Are their Queen.","commenter_a":"And the Republicans encourage this kind of person.","post_message":"No surprise at all. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154504498488655","commenter_b":"@username You can tell 84Lumber just how much we don't need illegal immigration: www.84Lumber. com","commenter_a":"Hmmm if they wanted to show people on the path to becoming legal Americans, why didn't they show them going to the embassy and applying for a visa? Some dramatic music while they fill out paperwork","post_message":"Who didn't see right through that?"},{"comment_id":"10153322754305667","commenter_b":"On an earlier USA today post the majority were celebrating a mans death. I used the word moron it was deleted and USA today had me banned from FB for seven days see a lot worse then that.","commenter_a":"I have been noticing that on comments sections of news articles on Facebook regarding the death of Supreme Court Justice Antonin Scalia, it is the Bernie Sanders supporters/Bernie Bros who are celebrating the death of the late Supreme Court justice. I may have disagreed with his ideology and beliefs, but that is not a reason to celebrate and be happy of someone's death. Says a lot about the mentality of many Berniebots... especially the younger generations.","post_message":"In 1986, he was nominated by President Reagan to the Supreme Court. His confirmation that year made him the first Italian American justice."},{"comment_id":"1563567157272928","commenter_b":"Stupid ass motherfucker","commenter_a":"way to go rosie, now evryone knows why trump treats you like he does. you usless POS. Done let the door hit you in the ass on the way out. if Canada doesnt want you, please dont come back","post_message":"Rosie O'Donnell just restarted an epic feud."}]
