[{"comment_id":"1076817779005244","commenter_b":"We'd have a beautiful First Lady!","commenter_a":"Don't want her or him","post_message":"If Melania Trump succeeds Michelle Obama as First Lady, she may trace her road to the White House back to 1987 and a chance encounter in the capital of her native Slovenia. Find out more about Melania: @webpagelink"},{"comment_id":"577340679100840","commenter_b":"If you don't leave america it will be the end of us","commenter_a":"Yeah. We've survived Obama. Barely.","post_message":"And that's not all he said either..."},{"comment_id":"10150574072889999","commenter_b":"Exactly, politicians and police could learn a lot from thisman","commenter_a":"this is how a real man behaves - God Bless you Mr. Taylor","post_message":"Malcolm Taylor, a Baltimore city bus driver, was watching the riots unfold on television, and saw some of the players he coaches in youth football among the rioters. He gathered 15 friends, including some church pastors, and went to the riots near Mondawmin Mall to try to calm things down."},{"comment_id":"10153330396398812","commenter_b":"I was just about to say- and watch all the females flock to this rich young single male Hahaha","commenter_a":"@username i actually think I'm in love","post_message":"This CEO says executive pay is \"out of whack.\" So, he's going to start earning $70,000, like many of his employees: @webpagelink"},{"comment_id":"10154846804139411","commenter_b":"Goat fucking muslims","commenter_a":"Stupid curry eating Hindus","post_message":"'Not in the spirit of a Sport'"},{"comment_id":"1916311915262611","commenter_b":"Wrong country? Or city? Please, do not behave yourselves wiser than Asians or Muslims. It's a sin. We have to love each nation regardless their colour, religion, geographic location.","commenter_a":"Pithy Vann that sucks","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"1036060346447359","commenter_b":"No. They're asking for 80million guns to be pointed at their stupid ignorant ugly faces.","commenter_a":"Are they asking for another wounded knee?","post_message":" never seen anything like it, Cleveland resident Sheila Rodriguez told Fox News Latino. everyone is gathered in one place and everyone attention is focused on one place, a lot of things can happen."}]
