[{"comment_id":"2130174917081223","commenter_b":"He is better off with out the old hag!","commenter_a":"Hell of a man","post_message":""},{"comment_id":"10152841074616051","commenter_b":"I am woman...hear me roar!!!","commenter_a":"Love my Hillary!!!","post_message":"A judge said that Hillary Clinton’s e-mail violations are punishable by jail time."},{"comment_id":"737985369668440","commenter_b":"Madwoman as bad as Obama, she must be Satan's tool...","commenter_a":"Angel of death!","post_message":"By BI\" She wants to recruit even more African and Balkan Muslims to fill positions as doctors and electrical engineers. Notice the stunned looks on the people who are listening to this rubbish. @webpagelink"},{"comment_id":"1022963947726395","commenter_b":"are all lesbians feminists?","commenter_a":"Fat shaming is a hate crime.","post_message":"A disgusting new low."},{"comment_id":"705870246236573","commenter_b":"Muslim Bakeries also refuse same sex marriage cakes as well it was done under cover and yet No Punishment!","commenter_a":"Yet Muslims can get out of delivering beer on religious grounds and awarded damages. Seems Christians are not afforded the same religious protection.","post_message":"A sweet slice of JUSTICE!"},{"comment_id":"10154027837914087","commenter_b":"Must be polling illegals...","commenter_a":"BOGUS BULLSHIT.","post_message":"Hillary Clinton leads Donald Trump by nearly double digits in New Mexico."},{"comment_id":"10153768028339614","commenter_b":"Lol Olivia you sound butthurt or does truth hurt as Ben Carson state all black lives matter not just criminals","commenter_a":"Where's the black lives matter people at? Or is only white on black that matters","post_message":"An anti-violence advocate is now paralyzed after being shot in the back during an attempted robbery, and the teenager arrested was supposed to attend one of his speeches on reducing juvenile crime rates. The Cal Poly Pomona student turned his life around after a criminal history beginning at the age of 12 and facing abuse in foster care. But while in Georgia to share his message of peace, Semaj Clark was shot. won be able to walk anymore, and that hurts me, but it not going to stop be from doing what I got to do, he said tearfully from his hospital bed in Georgia, where he continues to recover. Watch KTLA video here: @webpagelink"}]
