[{"comment_id":"1601162620179200","commenter_b":"Idiot. Build a wall","commenter_a":"Go back to Europe white folks... This is are land","post_message":"We're at a \"wall\" of taco trucks -- a protest in front of Trump International Hotel in Las Vegas ahead of tonight's final presidential debate."},{"comment_id":"956693264446697","commenter_b":"If my 2 daughters were still in school now and this begins I would not send them to public school it would be private or at home its just not safe, I don't have a problem with transgender boys don't belong in giur!s bathrooms and visa versa","commenter_a":"Wow..that's a big problem..!..put a extra bathroom in for Transgender..simple..problem solved..","post_message":"President Obama recently said all public schools must allow transgender students to use the bathroom of their choice. Let us know your thoughts below:"},{"comment_id":"10153464372430667","commenter_b":"Of COURSE you do, feminazi.","commenter_a":"Joe Biden didn't seem to give much credence to Anita Hill. Perhaps he could find a way to remove Clarence Thomas?","post_message":"Part of the pledge: To intervene in situations where consent has not or cannot be given."},{"comment_id":"1737156569841341","commenter_b":"Me too, streamed. He handled disrupters well.","commenter_a":"Loved it, not like being there but watched it live. Trump you are predestined to be our next President.","post_message":"I LOVE YOU NEW YORK! Thank you for a terrific night, ALBANY! LETS GET OUT & VOTE TRUMP next Tuesday, April 19th -- and lets WIN, BIG LEAGUE!"},{"comment_id":"889005157864717","commenter_b":"I remember the \" summer of love\". I hope I don't experience \"the summer of hate\". If you're looking for a change, this is the wrong guy for the job.","commenter_a":"He is not the establishment.","post_message":"Donald Trump Supporters: Why Are You Supporting Trump?"},{"comment_id":"10152876898775496","commenter_b":"Prayers for her son and family!!! The county and the contractors should be held responsible! There's no way a lifeguard should have his job if he can't swim or perform CPR! Ridiculous!","commenter_a":"Obviously the lifeguards should be able to swim and perform CPR but my question is more for the Mother ... Don't depend on other people to keep your kid safe in a pool ... That is your job as his parent ... Why are you do quick to blame another for your lack of responsibility in this? Just another story of needing to blame someone else ...","post_message":"\"The lifeguard told him that they couldn't swim to him, they didn't know how to swim, and one said that he didn't know CPR,\" See more: @webpagelink"},{"comment_id":"441930219322192","commenter_b":"Jail this pervert!","commenter_a":"Creep","post_message":"Conservatives are bending over backwards trying to defend the Duggars. Gross!"}]
