[{"comment_id":"10153534824302550","commenter_b":"She wasted our tax dollars on fantasy.","commenter_a":"Why is everyone so negative? A thirteen year old took a state to court. That says alot. Why is it OK for the president to waste money talking about climate change but not her. Get your heads out of your Butts people. She is not the problem, but did try to come up with a solution","post_message":"A judge has ruled against a 13-year-old girl who took North Carolina to court over climate change More ---> @webpagelink"},{"comment_id":"540716409449985","commenter_b":"they screwed up their country, and all they want is to screw up the rest of the countries","commenter_a":"Hell No !","post_message":"COMING SOON in your city and town..."},{"comment_id":"1020212581369220","commenter_b":"Ahahahah shut up bitch! :-*","commenter_a":"S ja ta td percebido ;)","post_message":""},{"comment_id":"10153161231757411","commenter_b":"She should have thrown herself out the window!","commenter_a":"Saven Haven laws.... she could've just walked to the nearest church, hospital, police station etc and said \"Here\" as she handed over the baby and walked away ..... so heartbreaking !","post_message":"Woman charged with killing her newborn baby, after throwing it out of an 8th floor window in Chicago's Uptown neighborhood. Full story: @webpagelink"},{"comment_id":"10153306712306323","commenter_b":"Women are garbage collectors in the US. I've worked with a woman in construction 25 years ago in construction. I quit that job, and got an easier one. She remained, lol. I don't mind Feminism, I think it's something that needs to exist. I just don't like the internet clusters of nutjobs, who believe if you smile or say \"hello\" to a woman, you are promoting rape culture-whatever the fuck that is. These types of Feminists are useless. They need to fuck off.","commenter_a":"According to 2010 BLS data, the following jobs contain 1 percent female workers or less: boiler making, brick masonry, stonemasonry, septic tank servicing, sewer pipe cleaning and working with reinforcing iron and rebar. Maybe the reason female workers aren't in these occupations is that too many are in other occupations. Females are 97 percent of preschool and kindergarten teachers, 80 percent of social workers, 82 percent of librarians and 92 percent of dietitians and nutritionists and registered nurses. Women have demanded more professorships, seats in congress and chairs in the boardroom, but have never complained that there were not enough female garbage collectors, waste water treatment workers, plumbers, welders, pipe fitters, coal miners, truck drivers, brick masons an block masons, lumberjacks, oil rig workers, well drillers, surveyors, longshoremen, construction workers, landscapers, sheet metal workers, HVAC repair persons, meat packers, high rise window washers, car mechanics, iron workers or any physically ...","post_message":"\"Philip Zimbardo is one of the first people undergraduate psychologists learn about. His prison experiment in the basement of Stanford University showed a darker side of humanity. He now tells us that there are fewer men than women at college, stating that positive discrimination is now needed to increase the numbers of men at university, but this is because ‘one reason you go to college is to find a guy’. Not only are these kinds of views horribly sexist and outdated, they’re also far too simplistic.\""},{"comment_id":"10153404952670399","commenter_b":"Women see him and spontaneously abort.","commenter_a":"Cherry picking keeps religion alive.","post_message":"Way, way too much information."},{"comment_id":"10153864649566336","commenter_b":"God places all sorts of obstacles in our path, so that we may become stronger and have a better understanding of faith.","commenter_a":"Ironic that people are praying for God to bless her, if he could do anything don't you think he would've avoided her getting it at all??????","post_message":"“I hope that I can fight it off,” eight-year-old Chrissy said."}]
