[{"comment_id":"973167082706082","commenter_b":"Its funny, we cant have stricter gun laws becuz criminals will still find a way to get access to guns but we need to figure out a way to have stricter border patrol laws as if the illegals wont try find another way into the country lmao the logic the people have now a days haha","commenter_a":"There's something wrong with American culture, not gun control laws. New York has more stringent gun laws than Canada but has about twice the number of killings via guns. It isn't the weapons, it's the people.","post_message":"This is a conversation we need to be having."},{"comment_id":"10152738013846135","commenter_b":"I didn't even know there were still idiots who thought like this....holy crap. What is WRONG with people?!","commenter_a":"Blacks got their way again!!!!!!!","post_message":"Today's Baltimore Orioles game was the first ever game to be played without fans. It led to some crazy pictures! PHOTO GALLERY: @webpagelink"},{"comment_id":"10153894921947217","commenter_b":"French problem they let them in","commenter_a":"Why you guys can't reports on the Massacre that taking place in Congo Beni region in Thr DRc","post_message":"The BBC's Richard Galpin was with protesters in Calais. Truckers, shop owners, farmers and police are blocking the motorway to the port and channel tunnel demanding the government find a solution to the problems caused by the migrant camp nearby. #FacebookLive"},{"comment_id":"10153438712476636","commenter_b":"Good start but we need a lot tougher laws for the sex offenders especially the pedophiles and rapists.... If there is a country to deport them to then fine, if they are British I think we should start new colonies on the barren islands around the uk.","commenter_a":"Hear hear.....send them all home,BLAGGING no good scumbags. Thank god a bit of sense at last they have been taking the k Piss of our system too long","post_message":"Exclusive: Theresa May's response to the uncovering of sex abuse gangs"},{"comment_id":"578813518988176","commenter_b":"He needs to be voted OUT","commenter_a":"Give them his job ! Asshole","post_message":"What do you think?"},{"comment_id":"10153122527121051","commenter_b":"Freedom bitch do something about call for help911 ..","commenter_a":"Hey Gonzalez: take your ass back to Mexico since you think you should fly the American flag upside down and the Mexican flag next and in equal position to the American flag. I was born in Cuba but will never fly a Cuban flag. I am an American and there is only one flag for me. You want to disrespect my flag and fly that rag of yours, go the hell back. BTW, you think there is racism against Mexicans, look at the way you act and then see if you can come up with any reasons American citizens might have a problem with Mexicans.","post_message":"An outraged military veteran took one look at this man's flag display and intervened. Soon after, he got a visit from the police"},{"comment_id":"10153692085070950","commenter_b":"There was a story not long ago of the White House sending out a million Green Cards to illegals. About a year ago there was a story on Obama sending out a million US citizen applications to green card holders.","commenter_a":"The story CBS did on Brexit tonight was horribly biased. The reporter all but predicted the end of the world (Communism). How better to get America to join the EU, than to bring us to our knees with Obama flooding the homeland with Mexican and south American (illegal alien) nationals? Low skilled labor and low information voters go together like Obama and Muslims. A match made in economic and cultural Hell.","post_message":"U.K.'s withdrawal from the European Union is already causing economic and political upheaval -- so what happens next?"}]
