[{"comment_id":"1059501164087223","commenter_b":"a little racists are we? I don't see any white ladies up there dancing with her.","commenter_a":"nope didn't see it,...who is beyonce?","post_message":"Not so subtle."},{"comment_id":"1080515501999587","commenter_b":"Not going to stoop to your low, Rebio.","commenter_a":"Sounds like Rubio is gay. Wants to be in the bohemian group. Where all the rich billionaire and American leaders go and have a gay feast and worship something called mule. No woman are allowed.","post_message":"He went there..."},{"comment_id":"891336577589705","commenter_b":"Americans, protect your selves!","commenter_a":"Thanks Obama","post_message":"Click to see these alarming new numbers..."},{"comment_id":"10154030392435329","commenter_b":"Hahahaha this is so us","commenter_a":"This is like 95% us! @username","post_message":"♫ People, let me tell you about my best friend. ♫"},{"comment_id":"10152876050286680","commenter_b":"@username is a RACIST!","commenter_a":"It's amazing how anyone like the ultimate pre-millennial distributionist, Neocon, evangelical, can spout his bilge and people think he's accomplished something. If Cruz is the best this nation can do, we are done. We don't need pontificating, and pandering to Christian values. We need leadership, a complete change in course to get our government working for the people again. I don't see it happening. Cruz belongs at a shatuaqwa tent, not the Oval Office. He cost us 24 billion in a phony shut down, could care less about health care for the middle class or poor, voted against Veterans benefits increases and VA spending. He's a charlatan, and the Elmer Gantry of the GOP.","post_message":"Ted Cruz killed it at the conference of social conservatives. And Marco Rubio fell flat."},{"comment_id":"10153460687383598","commenter_b":"Wretched evil vile women","commenter_a":"These sick people are going to BURN IN HELL","post_message":"NEW VIDEO: Planned Parenthood official caught selling aborted baby's eyeballs"},{"comment_id":"10152724871896045","commenter_b":"She wasn't spanked. She was whipped with a STUDDED belt.","commenter_a":"I wouldn't shame my kid in that way but there's nothing wrong with a spanking. Spare the rod spoil the child. If you don't guide them as parents they don't learn.","post_message":"A Florida woman is charged with child abuse after she sent her daughter to school with a t-shirt shaming her about bad grades. It's what the school noticed after giving the girl a new shirt to wear that got the mother arrested."}]
