[{"comment_id":"10152725766556636","commenter_b":"I know of at least one Christian religion that forbids voting. There's only a big deal being made about it because it's Islam. Having said that, I don't know what else this preacher has said.","commenter_a":"So voting is something that happend 1400 yrs ago.","post_message":"Apparently it's a 'sin'..."},{"comment_id":"542727622584484","commenter_b":"she need to go home back where she came from","commenter_a":"They all look like robbers and murderers with that shit on there head.","post_message":"This Muslim woman was just kicked out of the mall because of this. If you can't follow the rules, you can't shop here. Do you think Muslims should obey the rules or leave?"},{"comment_id":"1455671454485613","commenter_b":"I thought alcohol is not allowed in their religion of peace.","commenter_a":"Drunk and drugged? Classic!","post_message":"The Rabbi looks like a natural at Jew Jitsu..."},{"comment_id":"10154151850958271","commenter_b":"Hilary voted for it! So she must have to go to jail. Or does it only work one way?","commenter_a":"Can we focus on how she forgot about our soldiers in Benghazi!","post_message":"We are live discussing tonight's debate. Send your questions!"},{"comment_id":"10155326860884199","commenter_b":"lmao, and this woman is fit to be President? People have lost their everlasting minds!","commenter_a":"Hillary sucks","post_message":"Hillary Clinton is speaking at the Congressional Hispanic Caucus Institute."},{"comment_id":"1329933407046113","commenter_b":"Everything, everything she touches is corrupt.","commenter_a":"GREAT READ","post_message":"PATHETIC @webpagelink"},{"comment_id":"975168282518593","commenter_b":"Better be sure. Our us h hospital are not allowing this.....What. If. Patient wants non Islamic nurse. Because is this practice?","commenter_a":"STOP with the offending of muslims.....this is the United States of America...land of the free.... Who gives a crap if your offended....","post_message":"Whoa!"}]
