[{"comment_id":"10150578591129999","commenter_b":"she has class","commenter_a":"Sexy","post_message":"Jennifer Lawrence in Dior couture at the Met Gala. See more photos: @webpagelink Credit: Josh Haner/ The New York Times"},{"comment_id":"10153901527564342","commenter_b":"I hope everyone that takes their child there see's this and takes their child out of there...I also hope they shut this place down and arrests that woman","commenter_a":"Their intention was to not hurt the boy yeah OK why didn't they stop when the little boy said it hurt. That's exactly why I do not put my kids in daycare this world is full of stupid people who don't care for our kids. Its not the daycares responsibility to scrub the kids face. Like really. They should face charges I'm sure someone else heard and seen that works with this stupid girl ugh this just really upsets me.","post_message":"The dad wants the daycare to face charges"},{"comment_id":"935669179891807","commenter_b":"Go Home. U. Brain dead Muslim parasite Abraham sand blasters","commenter_a":"Go back to the Middle East where it's a Holy War USA doesn't want that crap here","post_message":"This Texas mayor wasn't about to let fundamentalist Muslims set up a Shariah court in her town, so a bunch of angry Muslims demanded she surrender. What she hit them with next was NOT what they were hoping for..."},{"comment_id":"862688910457525","commenter_b":"Women is just as bad","commenter_a":"Ryan selfish & sexism pig!!!!","post_message":"Ryan Giggs' brother: 'He never even apologised'."},{"comment_id":"10154716628348812","commenter_b":"Cynthia, please please do not vote or reproduce.","commenter_a":"Republicans are throwing everything at Hillary trying to see if it will stick. They know they will lose the election in November, and this is the only way they can come up with crap to try to cast doubt on her campaign. It is not America's fault that the only person representing their party is a certified lunatic. :D","post_message":"The various iterations of the Clinton Foundation are coming under scrutiny as Hillary Clinton runs for The White House."},{"comment_id":"1141292965963756","commenter_b":"There is evil everywhere in all religions! This is a slap in all Christian faces whether they are right, left, or middle! It's just another example of a sick individual taking advantage of others!","commenter_a":"I was in the BIG HOUSE for 2 months long ago and I have to tell ya, some of the queens in there started to look pretty good. Damn Did I just say that?","post_message":"And another \"family-values\" hypocrite bites the dust."},{"comment_id":"1737362022990205","commenter_b":"#fingersinthebootyassbitch","commenter_a":"He looks miserable. ..","post_message":"Kim Kardashian West is reportedly 'annoyed at him for refusing to rest' following 'psychotic break' (Via Daily Mail Celebrity)"}]
