[{"comment_id":"10153222909878132","commenter_b":"Why do women ALWAYS havevto comment on other women's hair..ugh","commenter_a":"sienna looks better as a brunette.","post_message":"\"She just understood. We just connected. It's been a tremendous blessing.\""},{"comment_id":"10154178082379726","commenter_b":"Yea and less than that are for your boy Cruz, and even less than that (way less) for Kasich. What is your point. Look who got 60% of the third largest state (NY) and watch where he is in the primary's tonight.","commenter_a":"For me, I hope Trump supporters realize he is only getting about 37-39 % of Republican votes on the average. I'm not talking about the one national poll that has him at 50%, I'm talking about the current raw, known facts, of these primaries. Nearly 2/3 of Republican voters want other than Trump.","post_message":"It's begun — even his fiercest critics are resigned to Trump's likely nomination."},{"comment_id":"10153370538292144","commenter_b":"@username She's a Republican.","commenter_a":"Not all republicans are pathological liar but all pathological liars are republican.","post_message":"\"This is not normal political hucksterism. It's a pathological disregard for the truth.\" —Kevin Drum"},{"comment_id":"988561661229838","commenter_b":"F*^king disgusting!!!","commenter_a":"Disgrace as president.","post_message":"President Barack Obama and First Lady Michelle Obama paid less than two minutes of respect to the late Antonin Scalia while the Justice lies in repose at the Supreme Court."},{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"},{"comment_id":"10154500349722994","commenter_b":"Yes! If someone is wrong they should pay!! Thank you hun. Wish I wouldn't have settled because I probably wouldve gotten more going to court! Never settle sweetheart 👍💯","commenter_a":"This happened to me before but by the time I found out it was pillaged, dash kit, sounds, Windows missing. I went to court and sued DPD they settled out of court.","post_message":"Andrew Carter has been walking, riding his bike and taking the bus for nearly two years now - unaware his stolen car had been recovered the entire time."},{"comment_id":"966472163391020","commenter_b":"They won't last very long if they show up here!","commenter_a":"Already here","post_message":"Nothing but a change in leadership can stop this."}]
