[{"comment_id":"1178310438875078","commenter_b":"Now we have to feed, clothe and house this murdering POS! Like the other 60 million illegal aliens aren't enough! Mexico's corrupt government couldn't keep track of him! Take him out to the desert and open fire!","commenter_a":"Get a rope!","post_message":"DRUG KINGPIN heading our way (until he escapes, of course) details: @webpagelink"},{"comment_id":"884379288251594","commenter_b":"Sexy diva girl","commenter_a":"Nache Mishell","post_message":"[Watch] ABC Unveils Sneak Peeks For The Return Of TGIT @webpagelink Speaking of good TV...who's ready for Scandal and HTGAWM?"},{"comment_id":"10152960759722377","commenter_b":"this traitor could add votes from the foreign countries that paid her bribe money to her and bills family charity, like she will add the illegals vote here in the US when the election rolls around","commenter_a":"#ClintonResign","post_message":"The former secretary of state is looking for a more aggressive way to increase her poll numbers."},{"comment_id":"10152727190457452","commenter_b":"This is why women do NOT belong in an all male environment. You uptight B****s can't even take a joke.","commenter_a":"Is she going to use a flag or a kitchen rag?","post_message":"Meet Sarah Thomas, the first woman hired as an NFL official, according to reports. @webpagelink"},{"comment_id":"10154190292923908","commenter_b":"My balls itch !","commenter_a":"perhaps they learned something from mother nature, (she fights back) with a swift justice. earthquake anyone else ;) it's time to rethink the old ways and start a new, where nature comes first <3","post_message":"Good..."},{"comment_id":"10153460908891680","commenter_b":"Len Williams Carver Hillary is a SHILL for Wall Street and the Big banks. Do you need a road map to follow the money?? 3 speeches for $675,000 from Goldman Sachs and you don;t find that troubling??? She said she would release those transcripts then reneged on her promise. So she LIED again! A Clinton trait! #BernieSanders","commenter_a":"Apparently to her a democrat is someone who switches their mind on same sex marriage, fracking, corporate executives, and Middle Eastern Wars all over the course of 10 years #Bernie2016","post_message":"LISTEN: New Off Message with Glenn Thrush - Hillary Clinton sits down with Glenn Thrush following a campaign event in Syracuse, New York. The former secretary of state compares Donald Trump to foreign demagogues and says she's not even sure her primary opponent is a Democrat. SUBSCRIBE: @webpagelink"},{"comment_id":"1765571717063636","commenter_b":"@username STFU","commenter_a":"It's so nice to hear a candidate say he loves America and its people. Unlike Obama and Hillary who constantly tell us how horrible and deplorable we are and not fit to wipe their shoes. Vote Trump who would wipe our shoes if asked.","post_message":"An incredible evening in MIAMI, FLORIDA! This is a MASSIVE MOVEMENT. I LOVE YOU! -DJT"}]
