[{"comment_id":"1079856352035375","commenter_b":"Wow","commenter_a":"White and gold","post_message":"o.O"},{"comment_id":"10152709124101545","commenter_b":"And a healthy sex life;) lol love u baby!!!","commenter_a":"Me and @username have been married 13 years.... Trust, communication, honesty, & endless love... Agree on things, if you don't, work it out. Don't keep money from each other, if your having problems sit down and go over your financial obligations. Set a budget. Go to parent conferences together to understand your child's growth and development ... That simple","post_message":"Do you know the secret to a long and happy marriage? We want to hear from couples who’ve been married 25 years or longer to get advice on making it work. Comment below, and we may reach out to you for an interview."},{"comment_id":"10154557994494087","commenter_b":"She is a lunatic! Ugh","commenter_a":"Jeff Sessions was that racist that prosecuted the KKK and has many black friends who defend him, yet Senator Warren throws the racist term around while pretending to be a native American? I don't get it. If you just hate someone just say it. Calling him a racist simply makes Ms Warren a racist and someone who stole from native Americans in order to further her financial coffers. You ma'am have Skelton's in your closet, live in a glass house yet you cast the first stone. Remember those HS days and your words Senator Warren.","post_message":"Elizabeth Warren: “Consider this MY warning: We won’t be silent. We will speak out. And we WILL persist.”"},{"comment_id":"10153600653569062","commenter_b":"Usa, invaded my country,so they have to clear the mess that's,they did over there then we'll back","commenter_a":"All you Muslim loving people need to move to a Muslim country and enjoy your Muslims.","post_message":"Your thoughts on this? Roughly two dozen sign-wielding protesters repeatedly tried to vocally overpower speakers at Texas Muslim Capitol Day."},{"comment_id":"1674023152845757","commenter_b":"Funny","commenter_a":"Idiots!","post_message":"Just take a guess which Democrat Senator said this..."},{"comment_id":"10153632745068812","commenter_b":"Get her a feed bag and shut the pig up!","commenter_a":"Yet big oil is in her pocket","post_message":"\"You don't have to be scientist to take on this urgent challenge that threatens us all. You just have to be willing to act,\" she says: @webpagelink"},{"comment_id":"10154830329021830","commenter_b":"wow what shit if a celb said something worth hearing then ok fine but most are just fucked up losers that cry for attention","commenter_a":"Anthony Turner","post_message":"Ashton Kutcher Helps Reiterate Why Tomi Lahren & Co Are Full Of Shit"}]
