[{"comment_id":"10155254792200354","commenter_b":"Which college did she attend? Was a waste of money.","commenter_a":"We don't need Work Place Violence. They need OUT of U.S.","post_message":"She actually stands by her statement that ISIS terrorists just need...job opportunities. Watch the insane VIDEO below."},{"comment_id":"934872919883382","commenter_b":"Did you listen to how Oklahoma handled the questions? She is no fake Barbie. Women can be beautiful and smart.","commenter_a":"Eeeeew, another fake blond Barbie miss USA. Miss Texas should have won .","post_message":"Wow."},{"comment_id":"10153523101282169","commenter_b":"They don't have a wall...just go....and demand your rights....lol","commenter_a":"@username, you are cool water in a desert of ignorance. Please don't think we are all so ignorant of our world.","post_message":""},{"comment_id":"1052489598132806","commenter_b":"A vote for Brad Thor is a vote for lying Hilary!","commenter_a":"beck cares about MONEY & POWER.he has to keep this mess up to TRY and stay in the limelight. just STOP-we want to WIN in nov. TRUMP 2016","post_message":"#Thor2016"},{"comment_id":"10150886165499999","commenter_b":"feminists are pro-islam, so of course this concerns them","commenter_a":"What does that word 'feminism* do here? Feminism does not say what you should or should not wear. Some feminists may have delusions of what is best for some, but it is still not the feminism itself, what people belive or does not belive.","post_message":"Our top 10 comments of the week."},{"comment_id":"631712173663014","commenter_b":"Illegals should not have the right to vote.","commenter_a":"Trump is the answer our country needs at this point in time. I have a feeling that this election in November will bring record number of voters -- what I don't agree with is that illegals have the right to vote. That is why the Democrats are pushing this because otherwise they will lose. Voting should only be for US citizens. Looking forward to a better and greater America come January 2017. #Trump/Pence.","post_message":"Watch: This was the highest-scored moment of the entire 2016 Republican National Convention, and it happened during Donald J. Trump’s speech as he addressed the corruption surrounding Hillary Clinton. @webpagelink"},{"comment_id":"1282558331837218","commenter_b":"\"Accidently\" lol fucking worthless Muslim and dumb bitch.","commenter_a":"Lies way less maybe but on a much higher scale lady. Really how does she sleep at night knowing she wants to butt fuck half the country and rape our military. I look at that bitch and I cringe bc she just says hello kindly and you know she is lying.","post_message":"Another day, another Trump lie debunked."}]
