[{"comment_id":"1081910365238548","commenter_b":"Your moms twat","commenter_a":"Donald Trump is a maggot-ridden crapsplatter from a syphillitic pink-assed baboon.","post_message":"Trump's new ad is directed at... a) George Lucas b) Princess Leia c) President Obama"},{"comment_id":"1107945392631847","commenter_b":"Even though the Stupid bitch cuts my sandwiches diagonally.","commenter_a":"Bernie is in my dead pool. Die Bernie... The sooner the better!!!","post_message":"Here's actor Mark Ruffalo and director Matthew Cooke on why Bernie Sanders is the right candidate at the right time. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154126114949877","commenter_b":"Off with her head!!!","commenter_a":"If it were my child, the white mother would be in a box today.","post_message":"White Mother Charged w/ Assault for Slapping Black Teen after Screaming N-Word. Watch how it all unfolded and the family's reaction below. Grio fam, can you imagine if this was your child? Sound off!"},{"comment_id":"1016709065044307","commenter_b":"Camille Valdez I don't think nothing would of happened if she was there unless she a trouble maker","commenter_a":"Cesar Chavez beginning down 9 days and not going to that school and it's Mexicans vs. blacks that's what it is there's going to be War","post_message":"#ALERT Police are at the scene of Cesar Chavez HS where several fights have broken out."},{"comment_id":"10153766161047217","commenter_b":"Stoning , beheading , kill non believers . No thanks not for me if that's peace then I'm a fairy","commenter_a":"Islam, this outdated cult ,has no place in a 21 century world....the quran is nothing more than a military pamphelt and islam is based on a cry for war to no end....madness......","post_message":"\"It's become much harder for modern women to live here after Friday night.\""},{"comment_id":"10157322113810354","commenter_b":"She is the spitting image of miss piggy. Shut up bitch","commenter_a":"@username keep this irrelevant fat slam pig off my feed, k?","post_message":"Amy Schumer: you know what Americans are \"sickened\" by? We dumb, poor, working class folk are \"sickened\" by rich, elitist, Leftist \"celebrities\" who can afford to live in million dollar homes with high-end security and bodyguards lecturing us for protecting our families and children. Sorry, Amy Schumer, that we can't afford to live in a gated mansion with state of the art alarm systems. But your pal Obama destroyed the American economy. So spare us the lectures!"},{"comment_id":"10152817676244877","commenter_b":"Wonderful woman","commenter_a":"RIP Queen of Gospel Music.","post_message":"ON THIS DAY IN HISTORY: On January 27 1972, The Queen of Gospel, Mahalia Jackson passed away at age 60. She became one of the most influential gospel singers in the world and was heralded internationally as a singer and civil rights activist. LIKE and SHARE to remember the Queen of Gospel!! >>@webpagelink"}]
