[{"comment_id":"1047903455266183","commenter_b":"I wish you would get an education, maybe you wouldn't say such stupid things Douglas","commenter_a":"Lmao. what a joke. So the economy is better, Because the middle class people are working 2 jobs to make what they were making before Obama and to pay for more expansive healthcare? The people have strengthened the economy,not politicians, through hard work and much sacrifice. I am sure the \"rich\" are happy, anyway.It works for them.","post_message":"We have to defend the progress we’ve made and build an economy that works for everyone—not just those at the top."},{"comment_id":"944616275579231","commenter_b":"I don't see why modesty should be offensive to anyone but I do understand why nudity can be offensive or uncomfortable. I think in a respectful, civilized environment you find compromise. which I think we did for a very long time. Now everyone wants to right to be offensive while retaining the right not to be offended.","commenter_a":"I've never understood why people are offended by nudity. It's just a human body ffs everyone has one!","post_message":"Not sure I'd have the nerve, but it looks kinda freeing. - Maz Ali"},{"comment_id":"10154018738645736","commenter_b":"Isn't that gorgeous.","commenter_a":"We need some housing Kate Brown.","post_message":"People are still flocking to the Beaver State."},{"comment_id":"10153719523799138","commenter_b":"What is,wrong w people???? If they have,an \"urge\" can't they have,any self control! !! Haven't people heard of video surveillance? ? Makes me wonder what else they've done that hasn't been detected...","commenter_a":"It's too bad that the media gets a hold of these stories and everybody believes them. That's not to say it didn't happen. Some children do lie about these things.","post_message":"The teaching assistant has been taken into police custody and is no longer an employee at St. Louis Park Public Schools."},{"comment_id":"10153341682339575","commenter_b":"Thank God for careless criminals.This case was able to be solved quickly because of it.","commenter_a":"I hope satan meet this scumbag at the gates of hell RIP beautiful young lady","post_message":"UPDATE: Bloomington Police confirm they have reopened the investigation into the disappearance of Lauren Spierer. This comes after the arrest of Messel in the murder of Hannah Wilson. Police will investigate any links between the two cases."},{"comment_id":"1539146466096818","commenter_b":"😁😁","commenter_a":"I am starting to think this entire administration was homeschooled by Betsy DeVos.","post_message":"Her (lack of) explanation left Matt Lauer flabbergasted."},{"comment_id":"10154179770204330","commenter_b":"How did this happen,if the Zoo was secured? Just so happens this is a Black child. Had it been a White child,there wouldn't be no complaints. Hypocrites!","commenter_a":"Accidents happen. They do. However, accountability and fault are determined and responsibility for the loss of this priceless animal (financial) should be taken in a court of law.","post_message":"\"Accidents happen.\" That's the response from the mother of the 4-year-old boy who fell into the gorilla exhibit at the Cincinnati Zoo over the weekend, forcing zoo staff to shoot and kill the gorilla. She says too many people are judging her. Thoughts? @webpagelink"}]
