[{"comment_id":"908359942543967","commenter_b":"I'd love to meet and spit in her face. What a sick bitch","commenter_a":"Beast","post_message":"Pro-abortion Congresswoman and DNC Chairwoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"10154126092428132","commenter_b":"So sorry to hear your loss and prayers goes out to you and your family God bless","commenter_a":"Prayers for your brother so sorry.","post_message":"The news comes just a day after Celine Dion lost her husband, Rene Angelil, to the disease."},{"comment_id":"969458729761266","commenter_b":"Eat a dick,you stupid bitch.I do have personal pictures on my page that's how much you know.","commenter_a":"And you, @username, are an asshole, and so fugly you don't have the balls to post a real pic.","post_message":"Michelle Obama is simply the best First Lady ever."},{"comment_id":"795518530581327","commenter_b":"There is definitely something wrong with this lady...","commenter_a":"Bully like Hily Holbrook from \"The Help\" except for the racism.","post_message":"I can't stop laughing.....at HER."},{"comment_id":"10153311243783690","commenter_b":"Muslims and Crishtians in Kenya have lived among eachother peacefully. How come we never fight religion for thousands of years and these scam bugs are dividing us and using religion because of their own business. Kenya troops has nothing to do being in Somalia. This terror group kill it's own people. If u disagree with them they will kill you even if u are a Muslim . As amuslim somali man, when I was in Kenya I used to play football with Kenyans and respected eachother. They neve harmed me and I never thought harming them because when we know the value of humanlifes. Kenya government should build county police and protect all university, malls, and give good salary to the police and security intelegence. Iam sorry to say this your police are corrupted. Give your police a good salary so they will protect ur citizens and the country. Ethiopian ...","commenter_a":"Just wondering why only Moslem students were freed!","post_message":"\"I am so worried, I had a son who was among the students trapped inside the college, and since yesterday I have heard nothing,\" said Habel Mutinda, an elderly man, his face streaming with tears. \"I tried to identify his body among those killed... I have to do that before the body goes bad in the heat.. I have been camping overnight, it is really hard, it hurts.\" @webpagelink"},{"comment_id":"1015046351849709","commenter_b":"Science BITCH","commenter_a":"Carlos","post_message":"Sorry folks."},{"comment_id":"10156429610305354","commenter_b":"No \"Refugees\" from Muslim countries!","commenter_a":"Kill all 15 on the spit","post_message":"So much for Obama's crackerjack \"vetting\" process..."}]
