[{"comment_id":"10153609424211130","commenter_b":"Does she have penis yet?","commenter_a":"No one likes the murdering bitch... she is no friend of the LGBT and most us want her to go away.","post_message":"Caitlyn Jenner has a clever idea for how to beat Ricky Gervais at his own game."},{"comment_id":"1746066945644780","commenter_b":"Sickening","commenter_a":"If Hillary wins we are fucked. All will end for this once dear nation. Adios America this nation is now a dump China & Russia are the leading nations now. Deceiving Hillary is going to backstab everyone. She will do anything to get your vote but at the end you will see her lies.","post_message":"Does Trump's violent rhetoric and bigotry remind you of something? Let's take a look back at history and find out... Big thanks to Marianne DeMarco for making this video."},{"comment_id":"1109554819065528","commenter_b":"Bitch please,","commenter_a":"To everyone hating on Superman, you don't have shit.","post_message":""},{"comment_id":"1015110755212120","commenter_b":"Stand tall Hillary!","commenter_a":"We got your back @username our next president of the United States of America !","post_message":"Send Hillary a message of support as she heads into the #DemDebate."},{"comment_id":"10150664369884999","commenter_b":"Rule of thumb: Economists don't generally have armies at their disposal to help overthrow democratic governments who oppose their \"theories.\"","commenter_a":"You'd think true conservatives would be happy about the expansion of rights (gay marriage) and making sure everyone chips in on the healthcare system everyone uses (Obamacare). I guess they're not conservatives, just simple Republicans.","post_message":"The way some Republicans tell it, America is a pretty awful place these days."},{"comment_id":"1281317941894705","commenter_b":"she is crazy in the head","commenter_a":"No","post_message":"So apparently everyone that doesn't support Hillary Clinton is just being juvenile, according to Streisand."},{"comment_id":"1009028342550450","commenter_b":"She is having them killed","commenter_a":"Hell yes she is responsible for that","post_message":"BREAKING: Another Clinton Associate Set To Testify Against Hillary Found Dead There's no way this is a coincidence. America deserves to know the truth. Do you think Hillary is responsible for this?"}]
