[{"comment_id":"1169496993094128","commenter_b":"Girl, you nuts.","commenter_a":"Don't believe everything you read, folks...apparently Nate Silver got a call from Washington, telling him to \"fix\" his poll numbers from last week. Trump is trumping HRC, and the media is lying to us all. Shoulda picked Bernie when they had the chance. #stillsanders #neverhillary #electionfraud #dnc","post_message":"Our latest polls-only election forecast gives Donald Trump an 17% chance to win the presidency. Polls-plus puts it at 24%"},{"comment_id":"10152768330837452","commenter_b":"Good, then keep them home.","commenter_a":"I will home school my child before I let the state lawmakers tell me what I should and shouldn't inject them with !!!","post_message":"BREAKING NEWS: Lawmakers have approved a bill that would require California schoolchildren to be vaccinated. @webpagelink The proposal would eliminate the state's personal-belief and religious exemptions, so unvaccinated children would not be able to attend public or private schools."},{"comment_id":"1419671894761590","commenter_b":"Serves the liberal illegal lovers right.","commenter_a":"Moron","post_message":"Liberal Governor Just Caught Stealing $115 Million, Who He Gave It To That Will Piss You Off!"},{"comment_id":"10154200210407411","commenter_b":"She has to pay her daddy","commenter_a":"Why doesn't she sue to stop the pay of the Senators/Representatives who's job it is to pass a balanced budget but who haven't done so in almost two years? It seems highly suspect to punish people who do their job but allow those who are unable to complete their primary assigned task to continue to be paid. Again, politics over people. Sad.","post_message":"Illinois Attorney General Lisa Madigan is seeking to stop state worker pay until legislators and Gov. Bruce Rauner approve a spending plan."},{"comment_id":"10154021550142377","commenter_b":"I see three women who should no longer be Senators!","commenter_a":"We have our own problems to solve. stop sticking your noses were they do not belong !! No other nation has made this kind of statement !!! $6Tril we spent and we have nothing except dead soldiers !!!","post_message":"Republican Sens. John McCain and Lindsey Graham have issued a blistering condemnation of the failure of the United States to act to prevent the slaughter of hundreds of thousands of people in Syria."},{"comment_id":"1163032473715499","commenter_b":"I hope Trump builds a wall 200 ft tall to keep these loosers out!!!!!!","commenter_a":"did the donald get him deported yet??","post_message":"Worker says he took a stand against Donald J. Trump and his immigration policies by hanging a Mexican flag at the Trump International Hotel in Vancouver. \"From the concrete pouring, finishing, drywall, taping, wood forming and general labour, Mexicans were there, building it.\""},{"comment_id":"10153540366322061","commenter_b":"It's not. But I've never seen it happen. Making laws to protect the rights of others is NOT discrimination. Even if you find the laws offensive.","commenter_a":"So why is it alright to discriminate against Christians?","post_message":"Charles Barkley pushing the NBA to move the All-Star game from North Carolina due to state's so-called \"anti-LGBT\" law. \"As a black person, I against any form of discrimination.\" @webpagelink"}]
