[{"comment_id":"10154531059061337","commenter_b":"Well there's the fact she acts like a cheap whore","commenter_a":"Really what is wrong with Miley Cyrus..? She got some serious issues & needs help...","post_message":"SHOWING OFF: Miley Cyrus didn't hesitate to full on make out with her Victoria's Secret girlfriend, despite the watchful eye of the paparazzi..."},{"comment_id":"10153572562143645","commenter_b":"the woman must have a strong heart...I would have had a heart attack and expired right then and there!!","commenter_a":"I would have been spooked","post_message":"This furry creature gave an elderly woman a rude awakening when she found it curled up on her chest."},{"comment_id":"1115555701831927","commenter_b":"Get and keep satan out of the White House!! SAVE AMERICA TRUMP 2016 ALL THE WAY!!!!!!!!!!!","commenter_a":"Done","post_message":"LAUGHABLE: Clinton Press Secretary Gives Conditions Under Which She Will Give A Press Conference Let's just plan on this not happening...EVER!"},{"comment_id":"10153787356025667","commenter_b":"Hello pretty lady","commenter_a":"Here's a fact for you Ms. Arnaud: Have you ever heard of Robert Byrd? Hillary considered him a close friend and mentor. Do some research.","post_message":"Hillary Clinton gave one of her strongest rebukes against Donald Trump at a speech in Reno, Nevada. @webpagelink"},{"comment_id":"212919912399673","commenter_b":"Karishma Bisheshar @username guys do ul remember this song...","commenter_a":"So sweet!","post_message":"You're my Honeybunch, Sugarplum Pumpy-umpy-umpkin, You're my Sweetie Pie You're my Cuppycake, Gumdrop Snoogums-Boogums, You're the Apple of my Eye And I love you so and I want you to know That I'll always be right here And I love to sing sweet songs to you Because you are so dear.. <3"},{"comment_id":"10154110742322439","commenter_b":"Cowards !! Stay to fight for your country !! You are Iran's puppets !!","commenter_a":"No problem. Enlist them in the French Foreign Legion - minimum 12 year enlistment; send them to Corsica for Basic and Combat training, and then deploy them to Libya to fight ISIS.","post_message":""},{"comment_id":"10153707450494218","commenter_b":"I DONT CARE if he was Sellings DRUGS or Selling His MOTHERRRRR These Six Police Officers TOOK A LIFEEEEEEE PPL.. ANd for that They Shall SUFFERThat's IT That's ALLLLL","commenter_a":"No justice for the 6 officers who were doing their job. What do we have police officers for? That needs to be explained..... Mr. Gray was a drug dealer plus numerous other things. Baltimore wants to keep drugs in their streets it seems! My thoughts only and Mr. Gray, well he would have gone to prison if he lived I hope.","post_message":"#BREAKING #FreddieGray Judge denies motion to dismiss charges against 6 police officers in death of Freddie Gray. He also denied a motion for State's Attorney Marilyn Mosby to recuse herself. Follow live updates: @webpagelink READ more here: @webpagelink"}]
