[{"comment_id":"1043808669085644","commenter_b":"Thankfully she kept her mouth shut and performed and the liberals are pissed? She's a liberal! It amazes me how they are quick to crucify her for making the decision to simply perform, keep some class during the halftime show unlike that ghetto trash bitch Beyonce","commenter_a":"The Hamilton cast members rocked just as hard as Gaga, and I loved their amendment.","post_message":"This is just sad..."},{"comment_id":"10153715951406002","commenter_b":"There are not enough words to describe the opinion I have of this woman and the her unspeakable actions.","commenter_a":"In my eyes what she did is not much different than an abortion.","post_message":"A 24-year-old Eastpointe woman who already has three children is charged in connection to the death and abandonment of a newborn who was found at a Roseville recycling center."},{"comment_id":"10154931623678812","commenter_b":"Everytime i check most people that like trump are not from the United States like yourself from Australia you moron","commenter_a":"Trump is much more liked on all social media then Clinton the media is clearly lying with these polls","post_message":"Hillary Clinton has vaulted to a double-digit advantage in the inaugural ABC News 2016 election tracking poll, boosted by broad disapproval of Donald J. Trump on two controversial issues: His treatment of women and his reluctance to endorse the election’s legitimacy."},{"comment_id":"1849864471907247","commenter_b":"Oh yea, he needs another wife. Loser!","commenter_a":"Too soon!","post_message":"As no surprise, Gwen Stefani said yes!"},{"comment_id":"10153641804123487","commenter_b":"\"Staying Power\"....\"Explodes\"....Politics is so sexual.","commenter_a":"Who cares about the xenophobe clown? Why don't you cover the candidate with more real ideas: @webpagelink","post_message":"The GOP is doing some soul searching.."},{"comment_id":"611652445656331","commenter_b":"USE'N The Words \"Protect & Serve\" Is An Excape For Majority Of Ths Police Officers Who Shoot & Kill Inoscent' Civilians ... SMH* It Is A Shame ...Need To Weed -Out The B.A.D. - POLICE OFFICERS Sister Asiyah Hensley Ka'Bah Brother Abdul Azim Ka'Bah","commenter_a":"Thank you for standing up and stating the truth","post_message":"\"These shooters aren't my brothers in blue, they're murderers.\" - Rep. Andre Carson, a former law enforcement officer, joined other members of the Congressional Black Caucus to condemn the recent police shootings of Alton Sterling and Philando Castile Read more: @webpagelink"},{"comment_id":"10153432042256051","commenter_b":"Those poor people deserve a better life I heard they throw their children in the garbage because they're girls","commenter_a":"Taking misogynists whose lives revolve around subjugation of women is a bad idea. Honor killings and selling daughters are both illegal in America. Thank God.","post_message":"Here's why President Obama says accepting Syrian refugees is the ultimate American thing to do. Do you agree with his message?"}]
