[{"comment_id":"10153605576555796","commenter_b":"Then why is she a waitress.Dumb ass.","commenter_a":"Maybe if he didn't by guns , his idiot wife wouldn't have to waitress. He's such a friggen looser.","post_message":"Gov. Paul LePage said his reaction whenever the debate begins anew is to head to a sporting goods store. “Every time there’s a big gun battle about one of these incidents, I go buy a gun,” LePage said to applause from the audience. “I have a big safe of them. I have five that I bought and I haven’t shot them.”"},{"comment_id":"10154319616791337","commenter_b":"???????????? LOL ????????????","commenter_a":"Looking forward to Colbert's inevitable rant about this, since he has Cap's shield.","post_message":"PURE FURY! Captain America fans are losing their sh*t over this decision..."},{"comment_id":"10154272601268525","commenter_b":"How stupid are those girls...their on camera now...lol","commenter_a":"Shane Ornelas","post_message":"HULK HOGAN ROBBED: Not even the iconic wrestler's home is safe from holiday package thieves! STORY: fox10phoenix.com/entertainment/@username-story"},{"comment_id":"10153507200311336","commenter_b":"Cool end abortion I'll send all the mothers that can't afford to take care of their kids to you.","commenter_a":"Amen! I can't believe people are so desensitized to what is happening all around us. It is our duty as human beings to stand against this, which is actual murder. Abortion is wrong at any point and specifically aborting a baby at 24 weeks, the same time they can live out of the womb is just completely inhumane and murderous.","post_message":"ICYMI: \"Destroying innocent life and harvesting human organs is beyond barbaric -- it is unimaginably immoral, grotesque, and evil,\" writes 2016 presidential contender Gov. Mike Huckabee."},{"comment_id":"699261006928857","commenter_b":"Hey Amber suck dick","commenter_a":"That was here plan NOT to help kids eat healthy but to sto kids from eating and she did a good job of it, come on Read between the lines. smh","post_message":"BYE BYE! Congress Releases SOME MASSIVE Bad News To Michelle On Her Way Out of The White House!"},{"comment_id":"10153927371866037","commenter_b":"May them leave now and so what... Do they think they can bring down saudi arabia ...! Rubbish","commenter_a":"new begginings for World Friends & Foes...! ( drawing a line in the sands-a dark Red Cloud will come from that part of the world. )","post_message":"Foreign Minister Adel al-Jubeir says that all Iranian diplomats must leave Saudi Arabia within 48 hours."},{"comment_id":"10152619988623525","commenter_b":"With lots of glitter...","commenter_a":"So, what will the bathroom towels have on them??????","post_message":"UPDATE: Hillsborough County Clerk Pat Frank says the office is ready to issue same-sex marriage licenses Tuesday morning, and she has reserved the park across from the office for potential crowds. \"I was hoping Judge Hinkle would revisit it and he's made it extremely clear now that it applies to every clerk in the state, that the ban against gay marriage is void...it never existed.\" MORE: @webpagelink"}]
