[{"comment_id":"10153611687931602","commenter_b":"And the fact that a grown woman liked it is equally disgusting. Grow up","commenter_a":"You know who also spoke his mind? ... Hitler.","post_message":"\"Trump? I love everything about him,'' said one voter. \"He speaks his mind and doesn't care if he offends anybody. He's saying, 'This is who I am — take it or leave it.'\""},{"comment_id":"1238572129494342","commenter_b":"You're a typical liberal Asshole ! Try those new laws in Court on those Illegals & Drug dealers & criminals no gun permits !","commenter_a":"can't wait for the State of Jefferson to separate from California and away from Brown and his non concern for America, this guy sucks ass was a loser before but voted in again by losers from other states that just moved to California for welfare and hand outs","post_message":"Gov. Jerry Brown dropped ink Friday on about half of the dozen gun control bills recently placed on his desk, including one requiring background checks for ammunition purchases and another that bans the sale of semiautomatic rifles that use a bullet button to easily detach a magazine."},{"comment_id":"10154414222354087","commenter_b":"Get used to it. Welcome to Trump's America.","commenter_a":"So? We've been hearing that North Korea has nukes, is building nukes for years... Whatever... Their society and economy is so fragile a major earthquake would send them back to the dark ages...","post_message":"A top North Korean official who recently defected to South Korea says the country is racing to develop nuclear weapons \"at all costs\" by the end of 2017."},{"comment_id":"1369450476431551","commenter_b":"take your Muslim BS and shove it !","commenter_a":"The current jews inhabiting Israel now are not the descendants of Prophets Jacob/Israel. . The true descendants of Prophet Israel moved to Egypt and they inhabit Egypt currently.. do not forge the history","post_message":"WHO SAYS THERE IS NO GOOD NEWS IN THE WORLD?"},{"comment_id":"10154732730043132","commenter_b":"BUT is he jewish?!","commenter_a":"Daniel Foisset","post_message":"It looks like Aly Raisman has plans for after Rio!"},{"comment_id":"1661235427481336","commenter_b":"We need the wall Canada has a wall but i forgot all the famers might lose there free lador","commenter_a":"hahaha... a very accurate comparison! Lol.","post_message":"\"On Feb. 9, we trust New Hampshire Republicans will send 'Biff Trump' back to somewhere — anywhere but on the road to the most important elective office in the United States at a most crucial time for this nation.\""},{"comment_id":"1214784961920643","commenter_b":"all these woman marching i wish they would say samething about us senior that can not get out of the house to help fight for our medicare and social security","commenter_a":"Marching in Tucson, AZ!! Yea! Ladies!","post_message":"LIVE NOW: Women's March in D.C., just one day after Trump's inauguration. MORE MARCH INFO: @webpagelink"}]
