[{"comment_id":"10154528365584342","commenter_b":"@username. Kim kardashian has done nothing in her life compared to Trump. Except suck like 10 ninjas dikks.","commenter_a":"Haha, once again ch. 13 is being biased. Haven't y'all seen all the libtards going unhinged on social media. Or commie elected democrat officials too. Democrats are the ones talking non stop about the results of the election. And calling president elect Trump not their president. Now that's un-American and petty.","post_message":"One expert blames it on Trump's insecurity from losing the popular vote. Others say it's just Trump being Trump."},{"comment_id":"10153040559681130","commenter_b":"Religion, Kartrashians, J.Lopez, M.Cyrus, and their ilk. Male dicktators ruling./ruining countries...","commenter_a":"I want to see a world without religion or Kardashians.","post_message":"Do you want to see a world without elephants, rhinos or gorillas?"},{"comment_id":"10152997685931336","commenter_b":"Now we have the iic ( idiots in charge ) fighting the isis. Stop talking about it and just do it.","commenter_a":"I hope isis dont watch tv...","post_message":"A U.S. military official has outlined plans to retake the key Iraq city of Mosul from ISIS terrorists as early as April, but the move has swiftly drawn criticism that the Pentagon is revealing too much information. @webpagelink"},{"comment_id":"1015110755212120","commenter_b":"Stand tall Hillary!","commenter_a":"We got your back @username our next president of the United States of America !","post_message":"Send Hillary a message of support as she heads into the #DemDebate."},{"comment_id":"10154692333454203","commenter_b":"EAT ME ASSHOLES!","commenter_a":"Dallas Lavalley","post_message":"This is how Donald J. Trump treats women."},{"comment_id":"10153000267696130","commenter_b":"Fire her sorry hateful ass!","commenter_a":"She was only suspended for a week WITH PAY. Hopefully ESPN decides to fire her after that week. You can fix bad teeth and weight gain... You can't fix being that ugly on the inside.","post_message":"How can people say things like this?"},{"comment_id":"853235784752651","commenter_b":"Too bad there aren't more moms like her.","commenter_a":"I love that she is wearing bright yellow...for all to see.","post_message":""}]
