[{"comment_id":"10156202756245354","commenter_b":"@username, lol, I'm doing just fine sitting here on the beach. Awful life? Bitch please.","commenter_a":"How much did the Pope's dress cost?","post_message":"Pro-Tip: When bashing capitalism is your brand, it's best not to wear dresses that cost $2,300.00."},{"comment_id":"10156220417230354","commenter_b":"Funny how they brought in women who said because of Planned Parenthood they were able to get breat exams. She admitted Planned Parenthood had no mammogram machine! All they do is feel the breast then refer you to an imaging center! Obamacare covers this. Obamacare covers birth control pills as well. Take your pill, no need for an abortion.","commenter_a":"Obamacare (paid by our Taxes) covers all women's health issues and problems - why is Planned Parenthood (which name indicates planning to become a parent) even needed. Women use PP for birth control - seems like double taxation to the taxpayers.","post_message":"Running a human meat grinder and selling human baby parts is lucrative work. And YOUR hard-earned tax dollars help pay for it all!"},{"comment_id":"10152853063786748","commenter_b":"Know what, dude, if you and Obama went to a lunch counter in the deep south in the '50s, you would both stand an equal chance of getting abused and assaulted. And if the right wing scum you shill for ever get back in power, you'll find yourself right back in the 'separate but equal' category tout suite. :P","commenter_a":"right. cause Alan West is the epitome of \"blackness\"","post_message":"Right-wing pundits claim Obama isn't *really* a black American"},{"comment_id":"10153504055809024","commenter_b":"If she is that ugly let her hide.","commenter_a":"It dies offend me that someone would hate women so much to do this to them","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1003873189632434","commenter_b":"When you take into account what these 2 young men did taking beer from a grocery store well there's going to be consequences plus swinging a skate board well the Police have to do something...I wish I were standing holding a sign I Support the Police Department !!","commenter_a":"I hate to say this but the store video does not lie. Now hopefully they'll release the bodycam video too. Now would be a great time to prove just how successful those are.","post_message":"The Olympia police officer who shot two men last week has given his account of what happened to investigators, and the department isn't releasing information. More than 100 people packed city hall tonight demanding immediate changes in police accountability >> @webpagelink"},{"comment_id":"10154295592708132","commenter_b":"A woman's ribs shouldn't show like that. That is not a healthy body.","commenter_a":"I think she looks great - no doubt about that but remember she has access to so may resources such as chefs, nutritionist, top motivating trainers, laser tightening, etc. Not to mention there is definitely not a daily 9-5 job in her day and don't forget adding in a few nannies to help out as well. All of these resources help alleviate stress and carve out time for you to focus on yourself. All that alone is a great cocktail for motivation.","post_message":"Spring has sprung for Britney Spears!"},{"comment_id":"1020710211322060","commenter_b":"Alexcea Erini Apostolakis bod","commenter_a":"I think the poor girl should be left alone","post_message":"The birthday festivities never end for Kylie Jenner (via Daily Mail Celebrity)"}]
