[{"comment_id":"10152865609926336","commenter_b":"That is insane.what is wrong with her.father","commenter_a":"It's obvious the parents are watching. But, I wouldn't have chanced that. You never know when a preditor will change it's mind and attack. If it had decided to attack and start constricting around the child, they may have had trouble getting it off before it did harm, even with them watching. I don't think the child here is being abused or neglected, that obvious in the film. With all animals, things can go very wrong, very quickly.","post_message":"This video footage of a 14-month-old girl playing with the family pet might make you a little nervous."},{"comment_id":"1107974842571087","commenter_b":"She lies and lies and lies and lies and . . .","commenter_a":"I AM SO DISAPPOINTED BY YOUR NEW JOB DR BEN CARSON , YOU WERE BETTER AROUND WHITE COAT....[...]","post_message":"Is anyone surprised?"},{"comment_id":"458641870995513","commenter_b":"Can't stand this idiot...she has always been a crude, rude, big mouthed jerk. I don't find her humor funny, never have and never will. She does things like this just to try to be relevant and she will never be relevant. Hopefully she will also leave America with the rest of these so called celebrities if Trump gets elected.","commenter_a":"Idiot!!!!!","post_message":"Sarah Silverman is a _____________."},{"comment_id":"10152741968547894","commenter_b":"Eboney Are u Sure. We can only go by what she said. Bitch lied on Memphis, she is a bitch that would have taken it further. She was hurt because he would not marry her ass. Haven't heard about her going to any more Domestic Violence charities or events. What is that about. Her butts hurt.","commenter_a":"I remember when that \"beef\" started.. Tamar didn't start it.. She made a comment about Toya living her fairy tale and K Michelle thought it was in regards to her being a liar and she went in.. K Michelle's response called her a muppet and said that she preferred Toni.. So she can't play that Newton's Law card.. K Michelle is known for being a bully.. Just like Tamar is known for being the Shade Queen!! I think they should fight about it 😒 or let it go and be friends.. #JustMyOpinion","post_message":"Tamar Braxton Breaks Down in Tears Over K. Michelle's Hurtful 'Muppet' Comments, K. Michelle Responds [Photo + Video]"},{"comment_id":"1121293104578213","commenter_b":"A girl?!?? Good at a SPORT?!? Better insult her appearance!!","commenter_a":"Talking bout that horse face","post_message":"WNBA star Elena Delle Donne shared her free-throw secret and the encouraging words that drive her. - Erin Canty"},{"comment_id":"10152874635857894","commenter_b":"There's a reason she can't get and keep a man.","commenter_a":"Rob Spencer","post_message":"The Wife of Kenya Moore’s ‘Millionaire Matchmaker’ Boyfriend Speaks Out: ‘She Knew He Was Seeing Somebody!’"},{"comment_id":"10153218783658869","commenter_b":"No inspired because I do not look up to her.","commenter_a":"Antes de ver a una mujer en la Casa Blanca, la clase política americana es capaz de buscar lo inexistente, y si hay hay que crearlo, de crea.","post_message":"Hillary Clinton cannot appear too strong without risking her likability ratings; she cannot appear too vulnerable without her credibility suffering. Herein lies her dilemma."}]
