[{"comment_id":"10152659193766680","commenter_b":"Not for the people in charge.","commenter_a":"They're right, our presidential debate system is broken.","post_message":"The group aims to make it easier for independent candidates to get a coveted spot on the national stage in the fall of 2016."},{"comment_id":"10154120855527908","commenter_b":"So California can just take water from somewhere else? I thought they already did that... And destroyed the water source. Humans can adapt and migrate with little effort. To dry? Move.","commenter_a":"How about we build a water pipeline instead? Ample areas of the country have excess while others are in drought. The worst that happens if it leaks a little is some flowers or trees grow :)","post_message":""},{"comment_id":"474050886118825","commenter_b":"Good Idea !!!","commenter_a":"If a Muslim man sees a naked woman other than his wife, He must commit suicide. There for, call for a father daughter dance instead of having Easter, have all the Playboy Bunnies show up naked! Problem Solved!","post_message":"Muslims force this school to ban Christian holidays. America is under attack, this is treasonous. 'LIKE' if banning Easter is WRONG!"},{"comment_id":"10153341236279170","commenter_b":"This guy needs to stay in London. I do not exactly agree with what Pam Geller did, but she was well within her rights. It's just like when the muslims were building their mosque down the street from the 9/11 Memorial. They were within their rights, even though that definitely was the wrong thing and wrong place to put it. Islam has no tolerance and so America should stop being tolerant to Islam.","commenter_a":"So according to the traitor liberals it is fine to offend Jesus Christ but it is wrong to offend Mohammed , only in the bs traitor mind of the socialists this makes sense.","post_message":"If you're one of the people saying we need to rein in the First Amendment so we don't offend Islamists, just watch this VIDEO and know that THIS is what you're trying to coddle."},{"comment_id":"1098705460221855","commenter_b":"@username, you are for Hillary because she is all for bringing others like you here. When you come here, what did you get given to you???? I know you didn't come here with your own money, food, clothing, transportation, etcetera.... It's one thing when people came to this country because they had the hunger for the \"American dream.\" All of the immigrants coming into our country NOW, are money grubbing leaches. They don't respect our values, our flag, and don't care to make this country better.... Just to suck off uncle Sam's teet. I don't WANT to buy health insurance!!!!! WHY should I have to??!! What kind of freedom is THAT???? I think YOU need to do YOUR research!!","commenter_a":"We are taught at schools of what @username did for all American,especially The affordable Health cards. I believe that she will make tramandous change if elected. TRUMP is all set to be Casino manager. That's all.","post_message":"This is really happening—Donald Trump just officially accepted the Republican nomination for president. Share this if you agree: We can't let him anywhere near the White House."},{"comment_id":"574645872704026","commenter_b":"@username so a woman that let Americans die that's the kind of person you think deserves to be president cause it's gonna be between the 2 think about that witch one is really worse","commenter_a":"Things will change when Trunp is president. The border police will have Trumps support. He'll also will support the Police & our brave service men & women. Vote Trump!","post_message":"Well that was easy..."},{"comment_id":"10156732658910492","commenter_b":"What is it with older ladies and dislike of bike lanes? @webpagelink","commenter_a":"These ladies probably shouldn't be driving anyway","post_message":"\"New York City is not Amsterdam, it never will be Amsterdam, and that's all there is to it.\""}]
