[{"comment_id":"10153829560109062","commenter_b":"Illegals dont fil lout any forms,","commenter_a":"Who tell him Illegal immigrates do not pay taxes, there are special forms most of them pay by the end of the year simce they know if there a possibility to change their status they will have to show they paid taxes... Ignorance makes people say atupid things... sad!!!","post_message":"What do you think of the sign?"},{"comment_id":"10154941514794062","commenter_b":"Say what you like.. Hoe, no talent.. Her bank account says otherwise. Carry on","commenter_a":"The only fame she has is singing with her legs apart and if it wasn't for that she wouldn't have any fans.","post_message":"Good news for Beyonce fans!"},{"comment_id":"10154082717346037","commenter_b":"You're an old hag and a criminal","commenter_a":"Hilary for president of America 2016!","post_message":"Hillary Clinton and Ted Cruz have received the most funding from the groups so far."},{"comment_id":"10154411481819062","commenter_b":"Or the reverse at movie theaters. How will women react when a bunch of not-women get in line in front of them while the men's restroom has nobody in it?","commenter_a":"So he/she's will get to sit on the can in the Women's rest room. Well turn about is fair play, women using the men's room when there is a line at sporting events. How will men react when they are standing at the urinal and a woman walks by heading for the toilet stall?","post_message":"HAPPENING TODAY: In about an hour, business leaders are expected to reveal their plans to support the Houston equal rights ordinance."},{"comment_id":"1081910365238548","commenter_b":"Your moms twat","commenter_a":"Donald Trump is a maggot-ridden crapsplatter from a syphillitic pink-assed baboon.","post_message":"Trump's new ad is directed at... a) George Lucas b) Princess Leia c) President Obama"},{"comment_id":"1049396555150863","commenter_b":"I thought you made a great partner to clint in fight movies rest in peace Jeff","commenter_a":"I like him. He was a good supporting actor. Underrated, in my opinion.","post_message":"Actor Geoffrey Lewis, known for his long working relationship with Clint Eastwood and for a slew of roles in television and film, has died at age 79. @webpagelink"},{"comment_id":"966131710165214","commenter_b":"The people Hitler was fighting nare in control of America now.#GoZioniost#FickZionoistPuppets","commenter_a":"Hillary and Obama are a cancer to our country.","post_message":"Is it happening again? Join Us: The Free Thought Project"}]
