[{"comment_id":"10154230629253854","commenter_b":"trump will take her down,no one will take orders from a lier.","commenter_a":"Go make cookies Hillary.","post_message":"Hillary Clinton Orders Liberal Media to Get Tough on Trump (VIDEO)"},{"comment_id":"10153648874092060","commenter_b":"You made Nola.com Michelle!","commenter_a":"Tammy, we should have gone to target last night instead!","post_message":"Metairie Target shoppers got a little help with last-minute Father's Day shopping last night from a special guest – New Orleans Saints Quarterback Drew Brees."},{"comment_id":"1698523013768491","commenter_b":"Women making decisions over a man's body","commenter_a":"It's not for fucking cosmetic reasons. It's for hygiene and it prevent a large amount of penile infections.","post_message":"Y'all should probably still stop cutting baby's dicks for cosmetic reasons though."},{"comment_id":"10153003636601167","commenter_b":"Conspiracy--Huh,,,, Just MORE REPUBLICAN,,,LIES !!!!!------Why don\"t republicans want \" Regular Americans \" to have Obamacare ( ACA) ?????--HATE for the BLACK MAN, in the White House !!!!! Republicans,, STILL INSIST,,,,Racism Doesn\"t Exist ---YEA,,RIGHT !!!","commenter_a":"Not again \".,(;#!!:#$,:that Damn Obama. Lol","post_message":"LOL."},{"comment_id":"10154743661575470","commenter_b":"@username (Psst. She means white.)","commenter_a":"Finally a decent president out with the trash in with the class","post_message":"INAUGURAL PARADE: Watch President Donald J. Trump take part in the ceremonial parade."},{"comment_id":"1377352988951720","commenter_b":"@username ok naked girl","commenter_a":"Chaos? Not really, just a bunch of virtue signaling, brainwashed and hypocritical snowflakes doing their stunt... Stop this nonsense, people support Trump!","post_message":""},{"comment_id":"10153428606317042","commenter_b":"Hell NO. They invited the idiot with the gun","commenter_a":"Yes.. including the idiot that set everything into motion causing the cancellation of the biggest time of their lives.. they could of ACCOMMODATED THEM INTO A ROYAL SWEET OR BALLROOM. ..I MEAN AT THE ASTORIA ...IM SURE THEY,SPENT A PRETTY PENNY. TRAUMATIZED AS WELL. SUE EVERYONE ... Not the doorman.... They were suppose to have a \"Dream Wedding and honeymoon\" ........ . Seriously.....","post_message":"COUPLE SUES HOTEL: The couple whose wedding was canceled after an accidental shooting in the Waldorf Astoria New York is filing a multimillion dollar lawsuit against the hotel. Do you think they should sue?"}]
