[{"comment_id":"1359888287387770","commenter_b":"Stupid silly bitches","commenter_a":"And this is who women follow?","post_message":"SADLY, LIBERALS ARE TOO STUPID TO REALIZE WHAT THIS SIGNAL MEANS!"},{"comment_id":"1236473219748126","commenter_b":"The police did what they needed to do. Woman was out of control","commenter_a":"Yes. NOT because of race, NOT because she is a woman, because she is resisting arrest. Have your day in court and don't try to get your justice in the street. It's just that simple.","post_message":"This Black Lives Thug Chick Gets Her FACE SLAMMED Into the Concrete... But after watching the video did she deserve it? We say yes! You decide! (VIDEO)"},{"comment_id":"10155505963450354","commenter_b":"What about the other female that had a hold of the flag?","commenter_a":"Brava patriot.","post_message":"“I was just going over there to pick up the flag off the ground.\""},{"comment_id":"921881311183439","commenter_b":"Obama go home to Kenya. Illegals go back to countries you came from. Need to help our own not illegals who drain our economy and increase our national debt......","commenter_a":"Dumbama suck donkey dic","post_message":"Will you accept Obama's latest \"order\"?"},{"comment_id":"519056438282649","commenter_b":"cair can go to hell","commenter_a":"Our country. .USA..AMERICA","post_message":"PLEASE SHARE AND HELP PROTECT OUR VETERANS!"},{"comment_id":"1738373569725506","commenter_b":"Nasty bitch!","commenter_a":"Thief don't need to words","post_message":"This should be interesting....ClashDaily.com"},{"comment_id":"10153302910759087","commenter_b":"But the sheep love the Queen of BS and her Lies, Hillary the evil millionaire theft by deception. and lair","commenter_a":"Carly doesn't back down from a fight. I would NEVER go on that show after that BS. She's a better woman than I!","post_message":"“My message to the ladies of ‘The View’ is, ‘man-up,’” Carly Fiorina said. “The Obama administration, for example, has been bad for women. Planned Parenthood is harvesting body parts. If you don’t like those facts and those messages, than man up and debate me on them. Don’t sink to talking about my face.”"}]
