[{"comment_id":"902999723068783","commenter_b":"The ones he just released did return to the battlefield and for a traitor that is a fact ! Stop with Bush,","commenter_a":"Impeach him now ! Sending prisoners to the battle field is treason !","post_message":"The WORST!"},{"comment_id":"10152817810411636","commenter_b":"Hmm yes thats the trouble with war..it creats unstable countries which then lets the door open to yet more evil!","commenter_a":"Don't forget he got rid of Saddam Hussain who was committing genocide to thousands of men women & children..on alnost a daily basis!","post_message":"Surprise, surprise"},{"comment_id":"10154014597174203","commenter_b":"Lise stfu","commenter_a":"How about a story on the hundreds of black-on-black murders in Chicago every year...","post_message":"He planned to bomb black churches and Jewish synagogues."},{"comment_id":"10153572562143645","commenter_b":"the woman must have a strong heart...I would have had a heart attack and expired right then and there!!","commenter_a":"I would have been spooked","post_message":"This furry creature gave an elderly woman a rude awakening when she found it curled up on her chest."},{"comment_id":"10152683402245667","commenter_b":"She must like getting stuff for free.","commenter_a":"He's republican. Enuff said. Lost my vote.","post_message":"Marco Rubio has \"something\" important to say."},{"comment_id":"836581726388456","commenter_b":"I've always respected women.","commenter_a":" declare to you today that you shall surely perish. You will not prolong your days in the land where you are crossing the Jordan to enter and possess it. 19\"I call heaven and earth to witness against you today, that I have set before you life and death, the blessing and the curse. So choose life in order that you may live, you and your descendants, 20by loving the LORD your God, by obeying His voice, and by holding fast to Him; for this is your life and the length of your days, that you may live in the land which the LORD swore to your fathers, to Abraham, Isaac, and Jacob, to give them.\" Now you anti's are taking the Bible out of context.....","post_message":"Powerful words to live by."},{"comment_id":"10156528764475594","commenter_b":"shut up, entitled lady","commenter_a":"Wow! A plethora of opinions...negativity abounds! What happened to \"if you can't say anything nice, don't say it at all\". I usually don't post but...","post_message":"#BREAKING: According to a report, Scalia arrived at the ranch Friday and attended a private party. When he did not appear for breakfast, a person associated with the ranch went to his room and found a body."}]
