[{"comment_id":"10158575805875354","commenter_b":"We also need to find and prosecute people with fake social security numbers. Illegals have admitted to buying them.","commenter_a":"Then pass voter ID laws in every state. I understand not wanting to spend money but I am tired of this arguement every election. I want to have peace of mind knowing that it is only We the people voting.","post_message":"Senate Majority Leader Mitch McConnell (R-KY) said he would not spend federal funds investigating voter fraud in the 2016 election..."},{"comment_id":"10153443453313145","commenter_b":"It's not the agents it's the folks who can't seem to follow simple instructions or get grumpy when asked to do what everyone else has to.","commenter_a":"I fly weekly and it is always slow. Putting the tourist with five kids in pre check just slows it down even more. Nothing at OIA is for the business traveler only the tourists. Wish I had a choice of airports","post_message":"A study of the speed with which TSA agents get passengers through security lines at Orlando International Airport shows that times aren't what airport officials want to see. So how have you're experiences at OIA been?"},{"comment_id":"10153233936119170","commenter_b":"Yes, she belongs there. Always enjoyed this show and hae a good laugh at some stupid people.","commenter_a":"Fodder for \"World's Dumbest Drivers\".","post_message":"Behold a video of the worst parking job in human history. Newsworthy? Probably not. Hilarious? Definitely."},{"comment_id":"10154111974819726","commenter_b":"check out her multiple lies prior to this...this chick is no journalist","commenter_a":"I can believe a liberal reporter pulling this nonsense stunt, but not someone from Breitbart! Conservative commentators have lost all respect from me if theyre going to pull these moves against anyone.","post_message":"WATCH: The now infamous video of Trump's campaign manager Corey Lewandowski allegedly grabbing Michelle Fields. What do you think happened?"},{"comment_id":"1529182653808525","commenter_b":"yep, paid lazy fucks, how about we let the illegals stay and ship thse shitbags back","commenter_a":"Liberals out to break this country and doing a very good job at it communist or stand together","post_message":"Are you KIDDING!?"},{"comment_id":"10155254792200354","commenter_b":"Which college did she attend? Was a waste of money.","commenter_a":"We don't need Work Place Violence. They need OUT of U.S.","post_message":"She actually stands by her statement that ISIS terrorists just need...job opportunities. Watch the insane VIDEO below."},{"comment_id":"10153638977331336","commenter_b":"Who said I only talked to one? I only mentioned ONE conversation","commenter_a":"Their apology means nothing if the employee was not fired immediately.","post_message":"The Pembroke Pines Police Department says that a uniformed officer was refused service at an Arby's simply for being a police officer."}]
