[{"comment_id":"10155024905873487","commenter_b":"Yes, but I am going out swinging. My representatives are getting letters, resistors are getting encouragement, all entreating those who swear to protect and defend the constitution are getting my support. I grew up when you did...and felt the same way. We are to be tested. Our Republic will need yo stand. So I will too. Join us!","commenter_a":"Good-bye halcyon days of growing up in the U.S. in the sixties and seventies. Worst shock of my life was 2008. I had always, unconditionally, believed that FDR's reforms were indissoluble, absolute, perfect. Now I don't trust anything; if there is money to be made, no perfidy is too great to be inflicted upon Joe Lunchbucket and me. It was a great experiment, but the protections against the avaricious that were put in place were not strong enough.","post_message":" don think Richard Nixon even comes to close to the level of corruption we already know about Trump."},{"comment_id":"10153010796814586","commenter_b":"Stop the dog slaughter. Stop killing,our animals. MONSTERS!!!","commenter_a":"Sigurd Rognan","post_message":"Dogs are speaking out for their friends being KILLED FOR LEATHER in China & sold all over the world. SHARE if you never WEAR your BEST FRIEND! JOIN THE MOVEMENT: @webpagelink #DogLeather [By posting your photo on Facebook, tagging PETA & using the hashtag #DogLeather, you are acknowledging that you have read & agree to our terms of submission: @webpagelink"},{"comment_id":"1109745385756047","commenter_b":"@username You are a waste of space aren't you darling...😉","commenter_a":"If you have ever been to Paris or London,You would know these are the two most disqusting cities in Europe. These two are stupid !!Glad to see all the comments, and no one has even been there, or has any Idea what shitholes these cities are ! LOL.","post_message":"Donald Trump is officially an international embarrassment. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1211339922259660","commenter_b":"Love it!!","commenter_a":"Next Congress will be investigating the rape charges against Trump..............right? No? How about the fact that he doesn't pay income taxes.......? How about his dealings with China? No! Wait a minute, this sounds like another witch hunt, fact finding repeat of all the other investigations that Congressional Republicans have tried to have brought against Clinton. I've never seen anything like it.","post_message":"\"You are hereby served.\" Rep. Jason Chaffetz served a subpoena demanding the FBI’s full investigative file on the Hillary Clinton email probe. @webpagelink"},{"comment_id":"945524792158383","commenter_b":"Kill all the white people, then they will only have each other to blame and kill. Brilliant!","commenter_a":"Idiots","post_message":"[Watch] New Black Panther Party Urging Blacks to Get Ready to Kill for a Black Nation"},{"comment_id":"1124522294289594","commenter_b":"Well to be fair, she didn't do a very good job raising you.","commenter_a":"@@username, You watch what you say about my mother you no good peice of garbage!!!!!!!","post_message":"Would you do this if you saw a dog trapped in a hot car? A new Ohio law makes it perfectly legal."},{"comment_id":"10153434645860329","commenter_b":"no, #4 killllllled me. so funny.","commenter_a":"Matt Megan Freeman @username Megan KellyThis is actually the funniest thing I've read in a while.","post_message":"LOL"}]
