[{"comment_id":"10153228481536519","commenter_b":"Which means no one should have sex with her, dumb ass.","commenter_a":"Oh jeez these comments are sick! Yeah teach your girls to watch how much they drink (and get help if they can't control themselves).and situational awareness. BUT this girl was still raped. Those men are still guilty. If someone is that wasted they crash a bike into your house, you sure as hell don't have consent to sleep with them. If someone is passed out on a couch, you don't have an open invitation to rape them. You people need help","post_message":"\"The truth is... I don’t know the exact number of times I was sexually assaulted.\""},{"comment_id":"1147292828682585","commenter_b":"Go to Hell Bitch!","commenter_a":"Her earrings are real classy. Hah!","post_message":"The Black Lives Matter crowd gets crazier every single day. Now the woman who co-founded the group says that \"white folks\" need to make a special sacrifice to everyone else. You won't believe what whites are supposed to give up..."},{"comment_id":"10153633611351337","commenter_b":"Joey Nicgorski Edward Contreras","commenter_a":"Thank god!","post_message":"POSSIBLE REUNION? Slash reveals that he and Axl Rose are buddies once more. What does this say for the future of Guns N' Roses?"},{"comment_id":"1255997957800290","commenter_b":"Drop her ass off after 😂","commenter_a":"At least he was a gentleman and took you to dinner after.","post_message":"Separate bills please. #WSHH"},{"comment_id":"1801403630131591","commenter_b":"WHEN SHE STEALS THE HAITIANS FOR HER DAUGHTER' S WEDDING, GOD SAVE AMERICA !! LOSER CRIMINAL HITLARY Nutjobs!!","commenter_a":"It feels like Hunger games in here with all the trash talks and the media coverage ... May the odds be ever in your favor ma'am","post_message":"Share this if you know someone who needs to see it. hillaryclinton.com/locate"},{"comment_id":"789227971267780","commenter_b":"She's no lady !!!","commenter_a":"I am a democrat, yes a liberal and I have nothing but respect for our law enforcement officers. This young lady has a bad attitude and needs to learn respect. He did his job. No one is entitled.","post_message":"Obama Support Gives Cop Serious Attitude, Immediately Get’s What She Deserves [VIDEO]. Wow, she just made the biggest mistake of her life. Do you support our men and women in blue?"},{"comment_id":"10153377992812426","commenter_b":"Typical female...never satisfied.","commenter_a":"Wish he'd do something else other than banning microbeads","post_message":"Thanks, Obama! ;) More than 8 trillion microbeads were entering the country’s aquatic habitats daily; the volume was enough to coat the surface of 300 tennis courts every day -- according to a Sept. study."}]
