[{"comment_id":"10157375449970354","commenter_b":"Fuck off you little bitch!","commenter_a":"Its ok. Nobody was listening.","post_message":"Isn't that so thoughtful of Leftists who deride religion to lecture Christians on their faith?"},{"comment_id":"962481017216016","commenter_b":"@username I do not believe God condoned offering children to the fire as is abortion. the dogs ate jezebel. hillery was lucky, so far.","commenter_a":"YOU can't be a christian and vote for Hillary but it is all over, Hillary lost.","post_message":"Apostate “Pastor” Tony Campolo says Christians Should Vote for Hillary @webpagelink"},{"comment_id":"455232604658620","commenter_b":"Hillary Clinton!!!","commenter_a":"Bernie Sanders!!!","post_message":"Listening is always better."},{"comment_id":"10152844746900667","commenter_b":"Gross looking. Many times, less is more.","commenter_a":"Ugly colors.","post_message":"\"Beautiful things happen when you take pride in yourself. #blackgirlsrock #kyebreaktheinternet,\" the prom queen wrote."},{"comment_id":"853540474702649","commenter_b":"By the way I don't agree with this either. But just think if people do not hire illegals they couldn't survive here. That is the root problem maybe we should start there.","commenter_a":"States did this not Obama. Do you blame him for everything? If the Cardinals don't win the World Series I'm asking congress to impeached him because it would have to be his fault","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"},{"comment_id":"10154065834906323","commenter_b":"Britain has more than enough/too many home grown criminals, that's very true. So what kind of imbecile would want to import more? eg: 1,000 immigrants. 999 workers/1 criminal. That's one too many. How to stop the criminal entering? Let none in. How simple is that?","commenter_a":"I didn't know all UK citizens were perfect law abiding citizens. Those who live in glass houses ... The important stat is crimes per person, EU citizen vs UK citizen, but that'll probably be inconvenient for the leave campaign as most EU immigrants are educated, employed, and tax paying.","post_message":"A dossier of murders and rapes committed by 50 EU citizens in Britain has been published by leading out campaign group Vote Leave, in a move described by critics as “scaremongering of the worst kind”."},{"comment_id":"10153720423624312","commenter_b":"Thank you. I let my daughter go camping!","commenter_a":"Poor parenting skill for letting her daughter go camping, wow he is delusional.","post_message":"Shirley Fortner, 70, has re-lived the night of her daughter death five times during five prior parole hearings. Bret Arbuckle killed Angela Lyn Fortner in rural Ash Grove, Mo., in 1989."}]
