[{"comment_id":"970339789709457","commenter_b":"The media doesn't give Dr Carson a fair chance, disgusting and sad!","commenter_a":"All Trump supporters, pls get out and vote! This is a very critical time in America, we need to get back our White House, otherwise we gonna reach the point of no return!","post_message":"GOOD MORNING, America! Thank you for all of your support- in last nights #GOPDebate. If everyone gets out to vote in 2016-- there is no question that we will ALL be MAKING AMERICA GREAT AGAIN- soon enough!"},{"comment_id":"10154586302758822","commenter_b":"Nobody hire ur nasty bitch ass","commenter_a":"Kdka u must b gettn pressure from ur execs to push all this liberal garbage ur only local news i watch but its gettn harder and harder to watch","post_message":"Have you noticed a drastic spike in Insulin costs? What gives? Is there anything you can do about it? #KDKA-TV News at 5:45"},{"comment_id":"10153574405058352","commenter_b":"No lesson learned. Maybe she wore her moms shoes because she could not afford a pair of her own","commenter_a":"She should have stayed down and took those shoes OFF and kept it movin","post_message":"Lesson learned! Moment girl graduating from high school wobbles for 12 SECONDS in platform heels before crashing to ground"},{"comment_id":"1760085394239423","commenter_b":"Is there anything we can actually wear without people and animals being exploited ???","commenter_a":"LETS CONTINUE SPREADING THIS PLEASE!!! IS OUR RESPONSABILITY TO STOP IT!","post_message":"BREAKING VICTORY! UNITED COLORS OF BENETTON announced they will BAN ANGORA after just 24 HOURS into #PETA campaign: @webpagelink THIS is why you should care."},{"comment_id":"10153676230638984","commenter_b":"Hillary u r one dumb fucking bitch.u have to treat every race equal. An the man in the interview I have a question for you. (WERE U BORN IN AFRICA AND IF U WERE NOT THEN U R A BLACK AMERICAN.","commenter_a":"Where is the surprise in this? She's always been a radical.","post_message":"While Black Lives Matter is disruptively crashing other candidates' events, they're getting treated to behind the scenes meetings at Hillary Clinton events. Thank goodness this was captured on camera... Spread this video so everyone can see the real Hillary in action..."},{"comment_id":"10153141257132490","commenter_b":"Seems like it's the only thing they are worried about .. LEAVE THEM BE. focus time and energy elsewhere. Geeeeesh!!!!!!","commenter_a":"For god sakes leave the uniforms alone!! They are fine as is.","post_message":"YOUR TAKE: CRACKERJACKS -- It's taken a decade to develop new service dress white and blue uniforms. Do you really need both types of crackerjacks? Send your thoughts to staff writer Mark D. Faram at mfaram@navytimes.com:"},{"comment_id":"1051374008255409","commenter_b":"Oh please. half a million is chump change to those guys. BUY A CLUE.","commenter_a":"People, We're talking about Goldman Sachs here. Don't think for an instant that they'd shell our half a million with no expected returns on their \"investment\". Besides, hillary said she'll look into releasing those transcripts. so I'll hold my breath until I see them(getting a little lightheaded tho\")","post_message":"Another lie about Hillary Clinton goes down in flames."}]
