[{"comment_id":"10154198707121636","commenter_b":"You British slaves deserve this Royal domination and humiliation!! The King plus Queen rules slaves are always slaves!!","commenter_a":"The point is that the royal family could easily afford to pay for the renovations themselves. We have no money for the NHS, but plenty for this? How is that in any way fair?","post_message":"Money well spent?"},{"comment_id":"10153755312209170","commenter_b":"These people have no understanding of history. Idiots","commenter_a":"Stupid on steroids.","post_message":"Because dumping tea into the harbor is exactly the same as smashing a window and grabbing a new flatscreen for yourself."},{"comment_id":"10153771956525428","commenter_b":"@username He is beholden to we the people and he just said he isn't showing up for his interview..","commenter_a":"Trump just lost the election skipping debate.","post_message":"What is the meaning behind Trump long-lasting surge in the polls?"},{"comment_id":"10152577391880047","commenter_b":"it is only the beginning of America rising up against it's enemies...all of them...","commenter_a":"This needs to be permanent!","post_message":"BREAKING: Federal court temporarily halts President Obama's illegal Executive action on immigration. Read and Share how the court agreed with our legal arguments in holding this imperial presidency accountable: @webpagelink"},{"comment_id":"10152767581187061","commenter_b":"Big deal. She is and always will be a pedophile","commenter_a":"She taught him in second grade??!!! How outrageous is that??!! And what about her 4 children that she already had? Not a word about them!! So wrong!!!","post_message":"Mary and Vili are still together and about to celebrate their 10th wedding anniversary. Their 2 daughters are now older than Vili when the affair started: @webpagelink"},{"comment_id":"1733106183573180","commenter_b":"Liar, murderer and thief! Hang that bitch.","commenter_a":"She is such a P.O.S. lol, if there is nothing to hide then why not release them, it's ridiculous! No one is asking for others transcripts, just her's because she is a proven liar...anyone supporting this woman needs to really see the truth and stop denying what she really is.","post_message":"During last night's debate, CNN moderator asked Hillary three times why she won't release transcripts of her speeches to Wall Street banks if there's nothing that she's trying to hide from voters. Do you think Hillary Clinton is hiding something in those speeches?"},{"comment_id":"10152639354152093","commenter_b":"Beautiful, what breed?","commenter_a":"Zeus is a big fan of the ice! #PuppysFirstIceStorm","post_message":"Ice storms are better with your best bud… #PuppysFirstIceStorm (photo: Dawn Lankford Morton) Latest updates: @webpagelink Tuesday closings/delays: @webpagelink"}]
