[{"comment_id":"10154651718054203","commenter_b":"@username So afraid of smart, strong women that it's pathetic. #madampresident Get used to it, prick.","commenter_a":"They're desparate at this point. Killary's ship is sinking fast, and when Trump smokes her on Monday it will seal the deal.","post_message":"Take a deep breath."},{"comment_id":"10154655136218984","commenter_b":"Makes you wonder why she's riding in a van! Not very comfortable and certainly not presidential.","commenter_a":"Not a Hillary fan but have you ever tried getting out of one of those van back seats?","post_message":"There's some new footage of Hillary Clinton making the rounds, and it's exactly what her campaign does NOT want America to see. Here's what happened to Hillary when she tried to get out of a van. This confirms a lot of things that we'd feared about the Democrat nominee..."},{"comment_id":"1265882336765127","commenter_b":"And yes that woman looks horrible because she over does it ...like I said I wouldn't suggest coming every day for the rest of your life","commenter_a":"Ummm....I am a tanning salon OWNER! You are are misinformed in your information as we all have taken classes about tanning. My mother died of melanoma and never tanned a day in her life we get SOOOOO MANY people with medical conditions who have to tan some of which are young girls. Now they passed the new law in 2014 on minors but we are WIDELY sought out and remained a tanning salon for 17 years!!! You have to educate yourself on it. The media is giving it such a horrible rep just like they do with everything to make you all freak out the exact way u are. If we didn't know what we were talking about then why do we have clients come who beat breast cancer with a doctors note or psoriasis or cystic acne or ms eczema the list goes on. Your body NEEDS vitamin D ...","post_message":"The FDA proposed unprecedented new rules Friday that would bar anyone under 18 from using a tanning booth or sunlamp."},{"comment_id":"1281508448553159","commenter_b":"She probably have a better shot at playing the Wisconsin lottery !","commenter_a":"Man sues Crispy Cream because the blueberry doughnuts don't have the same nutrients as blueberries.","post_message":"Yeah, she's totally got a shot at winning."},{"comment_id":"864666960316353","commenter_b":"I know! Power to the feminists. But that would make me feel dirty .","commenter_a":"Grace Te Moananui @username","post_message":"Armpit Hair Is Trending, And It’s A Step Forward For Women Everywhere"},{"comment_id":"10153803162214456","commenter_b":"There is a big difference between a legal immigrant and an illegal alien. Ivana trump was a legal immigrant.","commenter_a":"Thanks JENNIFER...this is what I am seeing and hearing. No matter how brash everyone thinks Donald Trump is...we have incompetent leadership in this country...I agree with him...","post_message":"BREAKING NEWS: French police have issued a wanted notice with a photo of a man suspected in the Paris attacks."},{"comment_id":"10153075666953812","commenter_b":"Inhuman barbarism was the assassination in Paris. Please accept honest condolence to families.","commenter_a":"Prayers for all!!","post_message":"BREAKING: French president: 12 dead in \"terrorist operation\" on Paris-based satirical magazine: @webpagelink"}]
