[{"comment_id":"10154600060589641","commenter_b":"Because you never listen properly. Listen closely and you will learn. Building a wall. ..you got it right. That's one policy. it has to do with immigration. That's very big. Walls keep people and things out or in. Keep illegals out. Citizens, can now get the jobs the illegals had and spend that money in their country , instead of it being spent in another country. That's one in a nutshell. That is an economic principal. And it's a big one. It has a trickle down effect. There are many more policies that he has articulated. Learn them a2live.","commenter_a":"I am not an American, but I have one question to the Trump Supporters who thinks that CNN is bias... What Plans does Trump has to make America Great Again? Because since I started following the primaries to the last debate the one thing that I have ever heard from this Man is Building the Wall at the borders. The rest of the things from economy to foreign policies he says we are going to figure that out. By the way he says it is not good to give your agenda to your competitors. Is that the bases under which Donald is going to make America great again? Leaders are voted for their ideas and policies, how much healthcare they can provide, how much education they can give, what can they do with the GDP, etc. but this man knows just nothing. Shame to the Trump supporters!!! I would disowned ...","post_message":"Hillary Clinton: \"What we want to do is replenish the Social Security trust fund...\" Donald J. Trump: \"Such a nasty woman.\""},{"comment_id":"10154476724188352","commenter_b":"On God I'll beat this hoe up!! Sick twisted bitch","commenter_a":"Wth","post_message":"Toddlers found chained up in Texas yard covered in hundreds of wounds are now in an 'excellent' foster home and are 'eating like they have never seen food before'"},{"comment_id":"1610662465894059","commenter_b":"And she should be out of a job.","commenter_a":"Yes","post_message":"\"These hands clean the rooms every single day for Mr. Trump so he can be rich.\" Meet the Trump workers who are not voting for Donald J. Trump @webpagelink"},{"comment_id":"10153759226208188","commenter_b":"At least the governors are smart!!! Get a clue Obama!","commenter_a":"Amen!!","post_message":"UPDATE - 17 states now: The Republican governors of Maine, Nebraska, Texas, Arkansas, Arizona, Indiana, Louisiana, Mississippi, Massachusetts, Ohio, North Carolina, Wisconsin, Georgia and Illinois joined their counterparts in Alabama and Michigan in saying they would no longer help settle Syrian refugees. One Democratic governor, Maggie Hassan of New Hampshire, joined them in rejecting Syrian refugees."},{"comment_id":"10153679672384586","commenter_b":"Cunts","commenter_a":"Aaron Andrew Bantoft this made me physically cry","post_message":"Imagine being alive for just ONE day... And then THIS happens, just because you were born male :("},{"comment_id":"10152995075029342","commenter_b":"A lot of women think they have to \"eat for two\" which they don't and that gets out of hand.","commenter_a":"People will never be happy. If a woman gains 100 lbs during pregnancy, people will \"OMG THATS SO UNHEALTHY! \" BUT, someone who is healthy and in shape, people are still gonna have a problem with it. What I think it is, alot of women get extremely fat and think it's ok. They use pregnancy as an excuse to over eat. This woman CHOSE to stay fit and there is nothing wrong with that. Kudos to her!","post_message":"Sarah Stage, the internet-famous pregnant model, finally gave birth on Tuesday to an unexpectedly large baby boy:"},{"comment_id":"970145053025967","commenter_b":"Remember: it's all politics ...and about votes. The GOP is garnering for the 'jewish' vote in 2016.","commenter_a":"Talk about shooting yourself in the foot...! Between this \"journalist\", Boehner, and Bibi, the court of public opinion may not be so kind. Obama will most likely rise above the pettiness, but like he said, there WILL be consequences. He is after all the actual elected President of the United States.","post_message":"Conservatives and Pro-Israel groups are now actively undermining the US President. This is about as un-American as it gets."}]
