[{"comment_id":"970527739636683","commenter_b":"Didn't notice the theme until I read the headline, after inspecting the goods.","commenter_a":"I don't see any injured vets? just hotness!!","post_message":"\"I'm not giving them back their confidence. They already have it.\""},{"comment_id":"1048024048598660","commenter_b":"Disgusting.","commenter_a":"The blessings of new life. I think it's wonderful","post_message":"\"It looks like an alien\""},{"comment_id":"10154828234334714","commenter_b":"No vote Hillary & she have problem health. Prison Hillary.","commenter_a":"I'D EVERYONE!!!! don the con has his sheep voting twice three times in some places!!!","post_message":"Democrats will seek court action to preemptively block potential voter harassment from Republican poll watchers."},{"comment_id":"10155143983283010","commenter_b":"GIRL WHY YOU MUFASA","commenter_a":"Ben Rotherham GAMBI AS SIMBA THIS IS NOT A DRILL","post_message":"James Earl Jones is reprising the role of Mufasa, and Donald Glover is taking on Simba."},{"comment_id":"10155768590015557","commenter_b":"Lmao they must be the fugliest bunch of prostitutes in the planet. A darn shame for whoever plugged in that","commenter_a":"I'd rather do the 5 knuckle shuffle. Gross. Just legalize it, better quality.","post_message":"'It's been a problem around here for awhile,' Reading resident says following an undercover sting that resulted in the arrests of eight women on prostitution charges. More on the story in a live report from WFMZ's Ryan Hughes on #69News at 5:30."},{"comment_id":"10154376306546636","commenter_b":"She did? She'll never get out of prison.","commenter_a":"She got off easy for mowing down people terrorist style. Or maybe they got the idea from her idk","post_message":"A woman accused of a deadly crash that claimed four lives during a homecoming parade in Stillwater has accepted a plea deal."},{"comment_id":"1179437002118415","commenter_b":"How about black miss America ,didn't see any white girls","commenter_a":"Isn't BET racist because there's no white people nominated? Why do they have the right to protest the Oscars while holding black only awards programs?","post_message":"Disgusting! Actor Spews Anti-White Racism At BET Awards CROWD GOES WILD (VIDEO) I've never seen such clear racism be allowed on TV before, wow. Lets get 1000 SHARES if you AGREE BET is a RACIST network"}]
