[{"comment_id":"1104084689647932","commenter_b":"Proabably referring to the 2 black dudes answering the question. If they were rappers they would have bitches and Bentleys haha. These are just 2 really baked or really stupid men. That's it nothing more.","commenter_a":"This how stupid these rapper are today, but if you ask him how much for half of kush he would quote you to the penny. Wow","post_message":"Is That Your Final Answer?"},{"comment_id":"828705883906152","commenter_b":"Trump for me all the way! We can't have Hillary. Socialism whatever","commenter_a":"Donald Trump is what we need not another stupid politician. Wake up people stop being so bling of the BS from Hillary, Cruz, Rubio. Those candidates are a joke. We need America back agin the strong country that once was until Obama and now Hillary, please the woman is a liar and a joke. She gets away with everything. Wake. Up America Trump will bring this country back, AMEN!","post_message":"Positive change is not going to come from someone such as Donald J. Trump. He is running for the wrong reasons, nothing good comes out from him. @webpagelink"},{"comment_id":"10152660515486813","commenter_b":"Maybe , but I am not a damn Liberal pussy.","commenter_a":"Too f'ng bad , play stupid games , win stupid prizes . Its not a resort.","post_message":"HORROR in Georgia Prisons. ACLU's David Fathi sheds light on how America needs to twist the lens and reflect on how we treat those within the criminal justice system. @webpagelink"},{"comment_id":"1116491755058348","commenter_b":"This is great! Pam Sept Hill, Janet Blessinger Gleason, Kandace Herring and Colleen Lafferty Wilson did you see?","commenter_a":"Terri Andrews Joanna Tugwell. We so need to print this X","post_message":"More of this, please!"},{"comment_id":"1126946630726765","commenter_b":"@username accepted money/bribe from the Clinton Campaign/Foundation. Recent documents released from wikileaks show! He is part of the problem and is an enemy of Americans at this point!","commenter_a":"clinton-foundation-invoiceAs you can see, the page from the Accounts Payable Invoice lists 14 names to whom the Clinton Foundation had paid considerable sums of money for suppression: $89,000 to A.C.O.R.N. $42,300 to William (Bill) Ayers: unrepentant former Weather Underground domestic terrorist; early supporter of and like ghostwriter for Barack Obama. $109,000 to @username, the radio show host who was an avid supporter of Ted Cruz during the GOP primaries, and continues to be a diehard opponent of Donald Trump. (See suspended by SiriusXM radio for hinting at Trump assassination) $203,000 to Black Lives Matter. $333,400 to the Black Panthers. $10,000 to Bill Kristol, founder and editor of the conservative magazine The Weekly Standard and, like Beck, is dead set against Trump. (See Kristol declares there will be a 3rd-party candidate against Trump) $80,600 to Monmouth University, presumably the university Polling Institute that conducts political and election public opinion polls. $12,000 ...","post_message":"Must watch."},{"comment_id":"10153045091301336","commenter_b":"YOU CAN BET YOUR LAST PENNY THAT MR OBOMO HAS HIS GUNS, PLURAL..SHOULD THEIR CHILDREN BE REMOVED, ALL THOSE THAT ARE MAKING THESE LAWS ..HOW ABOUT REMOVING THEIR CHILDREN, THEY ARE IN DANGER IF THERE IS A KNIFE IN THE KITCHEN..OH THEY WANT OUR GUNS..WE MUST STOP THIS NOW..THE CRIMINAL WILL NEVER GIVE UP THEIRS. THEY ARE STOLEN SO NOONE KNOWS UNTIL THEY ARE SHOT SO,THEY CAN ROB THEM.WE HAVE THE MOST STUPID THINGS TO OBJECT THOSE CHILDREN BEING LOVED AND CARED FOR..GET THAT LAWYER AND SHOW THEM YOU HAVE RIGHTS..GO GET THOSE LITTLE ONES WHO ARE NEEDING YOUR LOVE..PLEASE AMERICANS STAND UP FOR THESE PEOPLES DILEMMAS . DEMAND THEY GET THOSE BABIES..GOD BLESS THEM TOTALLY !","commenter_a":"well we better not let foster parents that have a car,knife, prescription drugs,dogs,plastic bags,power tools,bow and arrows,swimmimg pools etc., cause all of theses items can kill!! Get real!!!! The government is trying so hard to take our guns away from us !!! They don't care about these children!! They just want control of our guns and they don't care if children have to stay in orphanages with no hope of having a family to love them!!","post_message":"“I want to help some of these children that don’t have the luxury of a family to love them. Everyone deserves to be loved and cared for.” Valerie and Brian Wilson were denied their request to serve as foster parents because they have legal concealed-carry permits. WATCH more from their interview on 'FOX & Friends Weekend': @webpagelink"},{"comment_id":"1258250390858975","commenter_b":"She's trash too,","commenter_a":"No jobs or their boss refuses to buy group health insurance and a heavy extra tax next year for not having health insurance. All those young healthy folks need to buy premiums so the insurance companies keep up their profits.","post_message":""}]
