[{"comment_id":"1011931832233204","commenter_b":"They don't really care about fetuses either. If they did, they'd be storming fertility clinics, demanding that leftover embryos be implanted in someone's uterus. No, this whole thing is about controlling women.","commenter_a":"The Republicans & Right Wing Christians are trying to take woman back to the 50's. Women should know their place, sit down & shut up.","post_message":"After seeing all the pro-lifers cheer the attack on Planned Parenthood yesterday, it's time to remind ourselves of how they really feel about human life. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"771242182992562","commenter_b":"A couple of missals would take care of this problem.","commenter_a":"Hey where are the nasty sharks when you need them?","post_message":"Let's get rid of these scum bags already! @webpagelink"},{"comment_id":"10153168898035950","commenter_b":"Says the jaded soul. We still love you.","commenter_a":"He really thinks his opinion really matters. I hope and pray to God he loses really bad so he can get off his arrogance. He is a very insecure man. You can see how he talks and communicates his body language very insecure man. His life is a big lie and is willing to say what it takes to take the country down. Amazing some coat see right through him. Must not be very bright people.","post_message":"The secret to real estate mogul Donald Trump's popularity in this election season has eluded pundits, pollsters, the Republican establishment, and really, everyone else. \"Honestly it's my looks,\" Trump said before a rally in Atlanta on Saturday. \"I'm very handsome. That's the only thing I can think of right now\""},{"comment_id":"1155384687884221","commenter_b":"That's what you get for working for him.....I wonder if he ever payed the little girls who sang and danced for him for a rally","commenter_a":"Trumps motto : if you're stupid enough to trust me you get what you deserve.","post_message":"If you work for Trump, you're going to get burned."},{"comment_id":"1309577419062434","commenter_b":"Did they have fair trials? Do gays need to be re-educated??","commenter_a":"Leave the man alone in his way Castro was great not a fair leader in terms of his military policy's but he did great things forcuba like healthcare and education!","post_message":"Marco Rubio called it \"embarrassing.\""},{"comment_id":"10153270797394342","commenter_b":".","commenter_a":"Climate change. The earth is warmer than it has ever been, which means bacteria, viruses, diseases, all have the perfect breeding ground to multiply in larger numbers than we have ever seen before.","post_message":"LEGIONNAIRES' DISEASE LATEST: As New York City grapples with its worst-ever outbreak of Legionnaires' disease, health experts are trying to understand why reported cases of the illness have risen across the country in recent years."},{"comment_id":"955377877852075","commenter_b":"Most corrupt woman in American history.","commenter_a":"Hillary is not only the MOST QUALIFIED candidate for president, she is an American shero. She has done and continues to do so much for our country and its people. I know she will create jobs, equality and so much more. Go Hillary, go!!","post_message":"Hillary has spent her entire life standing up for kids and families. That's why she's running for president. Watch one of our first TV ads of the 2016 campaign:"}]
