[{"comment_id":"1088253067851669","commenter_b":"Sure.. The Democratic party will take votes any and all ways possible. Even if it means a threat to National Security. Anybody supporting this refugee program should have mandatory sign for being a host household and paying for ALL clothing and food out of their own pocket. When I bring this up on Gov Tom Wolfes page you can here the crickets chirping. There were a load of dems in support until I said this. Then \"SILENCE\". Why should the MAJORITY of the state who don't want them here have to pay? Incidentally, not all dems want them here niether.","commenter_a":"Obama & Hillary Clinton created this whole refugee problem.","post_message":"Professor: Refugee crisis is result of Obama's Syria policy"},{"comment_id":"1093577714092941","commenter_b":"Same way any comments from Pak regarding Indians and Kashmir are irrelevant.","commenter_a":"We are talking about a region where induviduals will go as far as to hijack airliners and slam them into skyscrapers. They think anybody that doesn't conform to their sick twisted ideology is the Devil.","post_message":"\"In Afghanistan, being lesbian is seen as un-Islamic. If people found out, the result would be death.\""},{"comment_id":"10153166532823188","commenter_b":"Women voting for conservatives are the ultimate foolish morons...","commenter_a":"I am a conservative FIRST and there is NO other party to which I can relate...I pray for common sense and decency to prevail but I REFUSE to ALLOW a few bad apples to make me think there is no hope within this party!!","post_message":"It's too late to save it."},{"comment_id":"10154035810956130","commenter_b":"I just see this on my feed that's sort of dress I wear to a nightclub in Not gonna put her down as i hate bitchness but maybe she could of gone with something little more elegant and saved this dress for a night out","commenter_a":"Before I read it I'm going to take a guess and say it was other women who were \"shaming\" her Oh I was right, although I wasn't surprised. Said it a thousand times. Women's biggest critics and women themselves.","post_message":"It's unfortunate that women can face sexist backlash from other women."},{"comment_id":"10154880634893984","commenter_b":"Move out!","commenter_a":"So, who packs there bags first","post_message":"Just as Trump begins to defy the odds, Hollywood is losing it in an unforgettable way..."},{"comment_id":"1522859634396359","commenter_b":"\"Liberalism is a mental disorder\"...Dr Michael Savage. That woman is not fit to be that precious little boy's mother!","commenter_a":"I cannot watch this. This monster (mother) is horrible and I cannot imagine how frightened this little child was. She deserved to be punished.","post_message":"Imagine how the media would have been all over this story if the mother had been a Trump supporter furious at his defeat. And this story still hasn't made out of Houston. It's still just a local story."},{"comment_id":"998702053501364","commenter_b":"Prison. He can still rape again without a tongue.","commenter_a":"Jail the bastard","post_message":"He lost his tongue. Is that punishment enough or should he go to jail as well? [Read below]"}]
