[{"comment_id":"10153278870867217","commenter_b":"Some woman wear a hijab out of choice !","commenter_a":"With a Hijaab. . ? 1st education they need. . Is to get out of hijaab slavery m8, , Pls convey this to them","post_message":"\"We want to inspire young girls to stand up for their rights.\""},{"comment_id":"10153614298213812","commenter_b":"muslims are animals","commenter_a":"They need to do this to all Muslims so they can't breed....gfu","post_message":"Experts say the ancient practice is not officially linked to religion in any way: @webpagelink"},{"comment_id":"10153186192812550","commenter_b":"Oh @username its so sad. First of a talking back is not a threat. Second if he wanted to arrest her , he did not need to throw her on the ground & pull her hair. Those kids were running up to save their friend & I would have done the same thing. Third she was all ready sitting down , it was no need to push her head down in the dirt & sit on her. Apparently the kids were invited by a guest. They didn't start the fight at the party some old ladies started it.","commenter_a":"Absolutely NOT! 1.The video is incomplete. 2. The cops appeared to be outnumbered at least 4:1 3. He did not use lethal force. He restrained an individual who was not obeying his directive. 4. When another individual came from behind him; he did as any police officer would and drew their weapon. He then quickly holstered it when the threat was lessened. 5. If these kids showed proper respect for law enforcement; this would have been a different story.","post_message":"Call for cop to be fired after pool party video @webpagelink"},{"comment_id":"10153602906656509","commenter_b":"You can buy them too.","commenter_a":"I think she means she wants to make a lot of money. Those GEDs aren't cheap.","post_message":"Is America ready for #marijuana moguls? Follow one young couple's journey as they attempt to franchise legal marijuana @webpagelink #HighProfits"},{"comment_id":"1305307819486565","commenter_b":"#DUMPTRUMP NOW!","commenter_a":"TRUMP will have them shot, Obama let them make it with their lives. He's already making plans for Paul Ryan, he has ties to the Mafia and will use them. They will have to get rid of Trump.","post_message":""},{"comment_id":"10154228766276523","commenter_b":"All over being asked about a reusable bag?! How is that racist? Crazy woman.","commenter_a":"Wow. Fox 6 is really becoming a rag show. Too bad they used to cover the news.","post_message":"All this -- because she was unhappy after being asked about purchasing a reusable bag at the craft store."},{"comment_id":"10153106240459586","commenter_b":"Thank you for choosing adoption! <3","commenter_a":"Precious baby!! I have four rescued pets and must stop but it breaks my heart every time I see these posts..","post_message":"DON'T BREED OR BUY WHILE SHELTER DOGS DIE. @webpagelink CC: American Kennel Club & Westminster Kennel Club Dog Show SHARE if you ALWAYS #AdoptDontBuy!"}]
