[{"comment_id":"853718148092962","commenter_b":"Hope she goes to prison.","commenter_a":"She should pay it back and go to jail","post_message":"So long, farewell..."},{"comment_id":"485435508313696","commenter_b":"She is a dangerous racist!,","commenter_a":"Yes","post_message":"Oprah is going after white people on live television. The hypocrisy is overwhelming. We need to show her we're not going to stand for this. Do you agree Oprah is a racist?"},{"comment_id":"10153327649961943","commenter_b":"She should be in Prison As well as ALL the rest of that bunch!","commenter_a":"$170,000 is a really hefty pension for the shaft of Obammy's challengers by the crooks in he IRS . AND her boss is still there covering up the evidence !!!","post_message":"This material shows that the IRS cover-up began years ago. We now have smoking-gun proof that top officials in the Obama IRS unlawfully harassed taxpayers just to keep them from complaining to Congress about IRS targeting and abuse. Please SHARE!"},{"comment_id":"1754762228138614","commenter_b":"If you think things are bad now if Hillary get in a wall, illegal immigrants and whatever you want talk about are going to be the very least of your (our) problems. She will destroy anything and anyone plus she will cheat, lie and steal and never think twice about it! She not even be in the running! If she gets in everybody better run like hell!","commenter_a":"Actually, Clinton was talking ABOUT trump since trump HIRED illegal immigrants! Clinton didn't put anyone down when stating this. Every president/candidate has said this. It's how and what you say that make a difference. Trump wouldn't be called a racist etc. If he didn't put a whole country/religion down with name calling. There's a HUGE difference between what bill said and what trump says. Whoever can't see that needs help...","post_message":"Do you think this sounds a lot like Donald J. Trump? MORE: @webpagelink"},{"comment_id":"10155653992935389","commenter_b":"Obama's clusterf*ck !","commenter_a":"@username, I do not think either one of them have any care at all about this.","post_message":"Question of the Day: Do President Obama and Hillary Clinton owe the families of fallen troops an apology for pulling out of Iraq?"},{"comment_id":"10153255280801336","commenter_b":"You can't fix stupid. She was stupid before she went to college or she wouldn't have come out that way!","commenter_a":"Lol GW created ISIS... yeah, and Obama is the best President we've ever had. I think you should get a refund for your college tuition, because it's not working...","post_message":"College student to Jeb Bush: \"Your brother created ISIS.\""},{"comment_id":"879108405613069","commenter_b":"He better watch his back. Killery has a lot of time on her hands now.","commenter_a":"Although Comey has a 10 year term, he can be terminated at the Presidents request. He truly needs to go, as well as his assistants. Trump should start with a new regime that will be loyal to the actual rule of law and not a puppet. Thank God lynch is history.","post_message":"James Comey just received the worst news of his life. America demands answers, and you better bet we're going to get them. Do you think Comey needs to come clean?"}]
