[{"comment_id":"1150014275011477","commenter_b":"Will miss this talented actor....such a great sense of humor intertwined in his roles as \"the villain\".","commenter_a":"Quigley Down Under with Tom Selleck","post_message":"JUST IN: British actor Alan Rickman, known for roles in Robin Hood, Harry Potter, Die Hard, more, passes away at 69: @webpagelink"},{"comment_id":"1555472744739839","commenter_b":"Screw them! Go get a job and pay for your own damn food.","commenter_a":"Get off your butt and look for work. In meantime, thank which ever god you pray to for living in a country that gives Food Stamps!!","post_message":"This is outrageous. If you're that picky get a Job and buy whatever you want."},{"comment_id":"10153943433408645","commenter_b":"She should go to hell for posting this picture on her profile..","commenter_a":"Maybe because she has a horrible profile picture of someone beheading a cop?!....the same photo the shooter in Dallas had on his Facebook....or maybe not....not condoning either act, just responding to the ridiculous lead in of the article...","post_message":"Lanaydra Williams told FOX 4's Megan Dillard she didn't know where Overland Park was before Thursday night, nor did she know the man who made a threatening Facebook post on a picture of her daughter. The stranger was identified as an Overland Park Police Department officer, and the department apologized to her after firing him on Friday."},{"comment_id":"10154105407999166","commenter_b":"We are getting sick of black crap. Whites will start an uprising. Just wait","commenter_a":"If it was any other student you would be in an uproar...relax! He was wrong and you know it. We don't need this in schools. If they don't protect the safety of students, can you imagine what they would be up against. You don't wait til something happens then act. Let's think like adults here. This is 2016 not the 50s.","post_message":"JUST IN: Police say they have charged this Clemson student after he admitted to posting comments on a popular social media app, comments like \"let's do the Clemson protesters what Ohio did to the Kent State student protesters 40 years ago.\" He said he did it to \"make people mad\"."},{"comment_id":"917503514939106","commenter_b":"Shut up bitch","commenter_a":"Surely another upstanding citizen.","post_message":"BREAKING: New police body cam video reveals the disturbing moment a white cop killed Eric Harris, an unarmed black man in Tulsa, Oklahoma. #EricHarris #BlackLivesMatter"},{"comment_id":"10153359842468984","commenter_b":"Love it .. Good for the Bitch /Bastard","commenter_a":"You can go to hell leave us alone. We don't care what you call it marriage is one man and one woman.","post_message":"You knew this was coming..."},{"comment_id":"1081267351952171","commenter_b":"@username WHO IS TRUMP RACIST TO....I WANT AN ANSWER....IF YOU ARE GOING TO SAY IT AND BELIEVE IT THEN YOU CAN TELL THE REST OF US","commenter_a":"Why would anyone vote for her after everything she's done has been exposed? She is not for the American people. Benghazi was enough for me to say #nohillary her plans to continue Obamacare, my vote is a NO, setting up a private server in her home where classified information on an unsecured server putting OUR safety at risk (then lying about it) that's a No. Claims she will fight for the children out of one side of her mouth and supporting late term abortion out of the other. #notwithher. The Clinton foundation taking donations from countries that abuse their woman and children, yet she believes in equality for women?? No way , never ever Hillary. Donald J. Trump for POTUS!!!","post_message":"\"She’s going to open the borders, pack the Supreme Court and you are not going to have the same country. Maybe you like that, maybe you don’t. But we’re not going back to the status quo, period. And so Republicans need to understand if Trump loses, it is a new America, OK? A lot is on the line, whether you like him or not. That is real.”"}]
