[{"comment_id":"574676589404983","commenter_b":"What a stupid bitch","commenter_a":"She should have seen that nazi meathead Trump fan telling Mexican protestors to make him a burrito. Way more uncivilized than what's happening here. What a stupid statement.","post_message":"She should have seen the \"uncivilized\" civil rights sit-ins that won her the right to be on Fox News."},{"comment_id":"511461792370480","commenter_b":"The bitch will do as she always does: LIE, and the Establishment will protect her and not have an indictment. It's sad the way this country would rather have a corrupt person with a rap sheet longer than her arm, get away with everything she and Willie have done. Anyone: Google \"Clinton Chronicles\".","commenter_a":"Moot point... Hillary will get crushed by the FBI.","post_message":"Donald Trump says he would crush Hillary Clinton in a general election. Do you think he's right?"},{"comment_id":"1007314029311396","commenter_b":"You stay where ur at and fight ur own dirtiness.... we dont owe u nothing!","commenter_a":"\"We have to reject any politics that targets people because of race or religion\" For brighter future, Americans can't afford Trump to walk into the Oval Office!","post_message":""},{"comment_id":"10152763408026717","commenter_b":"Let's threaten to slit the throat of little bitches, see how this Bitch feels","commenter_a":"Hes gay as well !","post_message":""},{"comment_id":"673333352791257","commenter_b":"It is VACCINATED children getting the measles from the illegals.","commenter_a":"There will be more diseases brought in that we have eradicated ! They can't let in all these refugees and not face the problem!!!","post_message":"Illegal immigrants have been bringing a special 'gift' with them when they cross the borders. This is terrifying!"},{"comment_id":"10153287604604753","commenter_b":"but she took the oath of offce before the Federal government made the ruling.","commenter_a":"She is an Apostolic Christian. According to #17 in the Apostolic Christian Church's Statement of Faith \"Governmental authority is respected and obeyed. Members serve in a non-combatant status in the military. Oaths are not taken, but truth is affirmed.\" With that being said, she violated her religious beliefs when she took the oath of office, and is violating her beliefs again by disobeying the law and court orders. Source: @webpagelink","post_message":"Kim Davis is reportedly unwilling to resign her position at the court until she is permitted to deny marriage licenses to gay couples on the grounds of her sincerely held religious beliefs. This means the clerk is planning to stay behind bars until someone grants her requests. Her lawyer, Mat Staver, spoke to reporters outside Carter County Detention Center on Friday."},{"comment_id":"1768583180066710","commenter_b":"suckass","commenter_a":"This man wants to get us another 1.3 trillion up in deficit","post_message":"WATCH LIVE: Donald Trump campaign rally in Waukesha"}]
