[{"comment_id":"1703284416593951","commenter_b":"Cruz pussy fake!","commenter_a":"Not true and you know it.","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"},{"comment_id":"1065493480157790","commenter_b":"I hope he is right. We can live well without what Beck represents.","commenter_a":"lol Beck is always good for a laugh","post_message":"Glenn Beck's reaction to the fact that the Supreme Court upheld Obamacare was nothing short of amazing."},{"comment_id":"10154151850958271","commenter_b":"Hilary voted for it! So she must have to go to jail. Or does it only work one way?","commenter_a":"Can we focus on how she forgot about our soldiers in Benghazi!","post_message":"We are live discussing tonight's debate. Send your questions!"},{"comment_id":"987010284749083","commenter_b":"oh i would get me a few mini pigs i can have 3 here in my town in town. then i would put pig crap on the lawn all around my home i would be so mean. if i could hear them i would call the cops everytime make it a real pain","commenter_a":"Dope, I'd have pork on the grill and my guns loaded and pointed right at it. A sign saying come and get it, your choice on which one you want","post_message":"What would YOU do if you were put in this situation? Choose one of the two options! @webpagelink"},{"comment_id":"944373212266686","commenter_b":"Planned Parenthoods primary function is abortion. Enough said. Defund it.","commenter_a":"Only 3% of Planned Parenthood's funding goes to providing abortion. None of that money comes from taxpayers. Defunding Planned Parenthood means defunding millions of dollars in preventive care, cancer screening, contraception (which reduces abortion), STI screening, and other such essential services. I'm pro-choice, but if you guys have such a problem with abortion, why don't you just campaign to force Planned Parenthood to stop providing abortion services and leave everything else intact?","post_message":"Wow."},{"comment_id":"1253938284627180","commenter_b":"Your mom's a joke","commenter_a":"Because vag isn't gonna pound itself........","post_message":"From an evolutionary perspective, men are a really bad idea. So why do they exist?"},{"comment_id":"906670476046247","commenter_b":"And you just said you are not for choice. You care less for the hungry And homeless. You want them killed. You want them to have no choice. Giving money to kill the child of someone who really wants to keep their child but can't because you gave money to have it murdered instead of giving money to her to help her with her choice to keep her child. Yeah. Pro abort!!!! Force abort!!!! Force te 11 year old against her will. Give money to murder mills to force a helpless woman have no other option because people like you pay to kill her child and not help support it.","commenter_a":"Stop Death Camps For The Unborn!!! Abortionists Are No Better Then Murderers!!!!!","post_message":""}]
