[{"comment_id":"10153204485844087","commenter_b":"Lucky!!! I wish I could have gone.. And TO ALL LIBERALS. I'll end with this.. Yall say if you're not natives to shut up about immigration. Tell you what, when the Mexicans conquer the land like the Europeans, they can have it. When they conquer and claim. Good luck.","commenter_a":"What a fun rally. Sold out and packed American Airlines center. It was beautiful. So beautiful, in fact, they may rename it the Trump center.","post_message":"\"I'm not going anywhere and we're not going anywhere,\" Donald J. Trump told a packed American Airlines Center in Dallas, where an estimated 20,000 rallied. \"We are killing it. They mentioned a little while ago about the silent majority — it's back. And it's not silent. Maybe we should call it the noisy, aggressive, wanting-to-win majority.\""},{"comment_id":"10155398572138797","commenter_b":"The man never said it doesnt happen in the white community. But its not \"white history month\" he was pertaining to this month and what the race can do to honor their dedicated month. He did not say anything about tje white people not killing. Oh wait thought blacks killing blacks is justified right? The constant drive bys and convictions is oj because of your race? How about we say how about all the ghetto gang bangers and the wanna bes stop killing to honor this month whether black or white a thug is a freaking thug. Whites killing whites needs to stop also but we do not have a month dedicated to our history whether it be polish irish English. We will take gary and Chicago and all the mindless killing what race is it primarily? Oh wait its ok or white people's fault.","commenter_a":"I have an idea maybe for Black History Month. The young black kids can stop killing each other. But of course that won't happen.","post_message":"BLACK HISTORY MONTH: Today, and all month long, join us in celebrating the achievements, culture and contributions from black Americans across U.S. history."},{"comment_id":"10150583091169999","commenter_b":"Smart girl","commenter_a":"Tara Hosseini Chanelle Felder Curtis","post_message":"“A Bush was trying to blame ISIS on Obama’s foreign policy — it was hilarious.” Check out our sister page The New York Times Politics and Washington for more."},{"comment_id":"10156334612930354","commenter_b":"P.S. \"Illegals\" cannot vote.","commenter_a":"Good for Hungary for putting up the fence. It is their country and they have every right to protect it from any invaders. It's too bad our Golfer-in-Chief and the rest of the liberals don't feel the same concern for our country. They don't want to stop illegals because of the votes they can bring. 'Bleeding Hearts\" are a really sick bunch of people.","post_message":"This can't be right... Obama--who lives in a home surrounded by a fence--says border fences don't work. How can this be?!"},{"comment_id":"500542473482734","commenter_b":"What's so crazy is that these people's ancestors were probably poor farmers! VERY few southerners owned slaves - only the richest - but they convinced the dumb farmers to go to war for them. Learn some history rednecks!","commenter_a":"Your ancestors didn't own a thing in their lives. They didn't own black people then and now. If someone did not willingly agree to become your slave it means you did not own them. They are their person. Unless they make An argreement with you as similar to terms of employment then you do not own then. All sales of slaves are void because you can't sell a human as property or goods. God already said Let My People Go... And so be it that was the end of slavery and should have remain that why. I'm sure if all Black people go back to Africa and the Caribbean and keep allot our wealth their and all white people move back to Europe without our riches we would still be more wealthy than you because you would knocking on our doors for our oil, gold, diamond and anything of value ...","post_message":"HOLY CRAP."},{"comment_id":"10153352043126756","commenter_b":"Not a chance until the millions of illegal parasites are returned and hospitals offer them nothing.","commenter_a":"America is for real fucked up. You pride yourself on being a democracy yet you tolerate this kind of crap. Why aren't you all in the streets raising hell? No other first world country would allow a system like this.","post_message":"At the end of her life, MaryLou's family owed $100,000 for her medical bills, after insurance. This is how they struggled to manage both the care and the cost of cancer."},{"comment_id":"987364064653456","commenter_b":"What about the case of the stay at home mom, divorces, etc. where does she fall in your explanation Michael?","commenter_a":"Keep it in your pants or out of your pants until AFTER you finish school. I don't have to pay for your daycare.","post_message":"Juggling the demands of an education with parenting is a reality for over 25% of American college students—and it’s time that we create affordable childcare options for those seeking a degree."}]
