[{"comment_id":"10153444828331770","commenter_b":"Ignorant blacks thugs","commenter_a":"G.U.N. ?","post_message":"\"Man, I got that sh*t on camera, bro!\""},{"comment_id":"10153101171403417","commenter_b":"Put sheldon Silver in JAIL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"I wonder why it seems that so many Americans take homeland security so lightly?","post_message":"Last night on CNN, I discussed the impact of #Blizzard2015 on Long Island as well as security concerns after a drone crashed on White House grounds. Watch: @webpagelink"},{"comment_id":"10153071601427434","commenter_b":"Some black women are hot","commenter_a":"You KNOW it was provable, terrible, and criminal when the nearly all white, all male jury found him guilty. Even they were horrified enough.","post_message":"A jury has found Daniel Holtzclaw guilty on 18 of the 36 charges he faced for allegedly assaulting at least 13 black women. He faces up to 263 years in prison."},{"comment_id":"10153538645367232","commenter_b":"Yous are CRAZY, certainly it HAD to ALWAYS be a GHETTO, NO one would ruin a neighborhood ;)","commenter_a":"What Camden used to look like before the take over.","post_message":"Females attack woman with pole on South Jersey street in broad daylight and it was caught on camera: WATCH THE VIDEO => @webpagelink"},{"comment_id":"10153461345971130","commenter_b":"Arrogant bitch. Who does she think she is? Shut up and go back to whatever latin dump you crawled out of.","commenter_a":"Coreena Christensen could agree any more!!! perfectly said","post_message":""},{"comment_id":"1092357044118639","commenter_b":"Except the assholes wouldnt drown. They'd just move to your neighborhood. I'd rather have them where they are right now.","commenter_a":"So basically where all the assholes in the U.S. live would be underwater. Anyway we can make this happen overnight?","post_message":"Would your city survive? What would Earth look like?"},{"comment_id":"1036060346447359","commenter_b":"No. They're asking for 80million guns to be pointed at their stupid ignorant ugly faces.","commenter_a":"Are they asking for another wounded knee?","post_message":" never seen anything like it, Cleveland resident Sheila Rodriguez told Fox News Latino. everyone is gathered in one place and everyone attention is focused on one place, a lot of things can happen."}]
