[{"comment_id":"10153780658736350","commenter_b":"@username I have no clue what you are talking about but let me clue you and those like you in on something .... we wonder why kids are shooting up schools and bully each other to death when all they have to do is look at ignorance like you for an example. Sit behind a computer screen and throw insults around like you are all important. You get on a thread and bash a new born baby and his parents that take care of them selves and don't do anything what so ever to you and the likes of you. Instead of passing over a story you don't want to be a part of you get on threads and be an ugly soul and bully people that are happy for this couple or any couple that lovingly gives birth to a much loved and wanted baby. Since you brought up ...","commenter_a":"People have babies everyday! Women birth children under horrible circumstances... Alone .. In poverty ... How about focusing on that instead of these irrelevant people!!","post_message":"Congratulations, Jessa Seewald and Ben Seewald!"},{"comment_id":"10153990601334726","commenter_b":"Joel Gillespie One thing to have hired them (via a contractor) totally another to hand them citizenship. Maybe if Rubio and his fellow politicians would secure the border enforce immigration laws there would not be illegals for hire.","commenter_a":"hilarious that Rubio is the one that said Trump misspelled Choked and he didn't... Rubio was wrong","post_message":"WATCH: Rubio Mocks Trump, Reads Misspelled Mean Tweets, 'Friends Don't Let Friends Vote For Con Artists'"},{"comment_id":"676882525784251","commenter_b":"STOP IT !","commenter_a":"When did this actually happen? Yikes...............","post_message":"An oil spill the size of Manhattan is devastating the Gulf of Mexico, and nobody's talking about it. #MicBrights"},{"comment_id":"10153008628783721","commenter_b":"of course I'm involved!","commenter_a":"Sara Kasperski are you involved? I know Shia is...","post_message":"The watchers become the watched."},{"comment_id":"10155823678825354","commenter_b":"SUCK a Long donkey Eva ..","commenter_a":"She knows nothing about Hitler but she can run her mouth","post_message":"Desperate..."},{"comment_id":"10153680623219087","commenter_b":"@username Why should the gun industry be the only industry in our country to be granted blanket immunity?","commenter_a":"Ah yes, @username ready to go with its latest Bernie slam piece right after he wins Wisconsin and right after they post an article praising Hillary's graceful concession. Quality, non-agenda-filled journalism, lads and ladies.","post_message":"\"Shame on you, @BernieSanders try living one hour of our lives. Love, the #SandyHook Principal's Daughter,\" Erica Smegielski tweeted with links to the front page of Wednesday’s New York Daily News, with a headline reading: Bernie’s Sandy Hook Shame."},{"comment_id":"10153142102307144","commenter_b":"DUMB ASS!","commenter_a":"What about soldiers lost in Iraq?","post_message":"Holy crap."}]
