[{"comment_id":"10156866881005231","commenter_b":"Porsha Williams (Dish Nation)should be next.loud mouth and Crazy.Don't take the Club to you Job. Stop Emphacizeing and Profileing your rear end Porsha.Professsionalism evidently is not in your vocabulary. You are not the only woman with a big butt.Its most likely paid for anyway.","commenter_a":"All that smacking her mouth waveing her hand poping her fingers and all that darn yelling in the mic.Enough!Don't take the Club to your JOB.","post_message":"Did the leader of the 'Tamartian army' get the boot?"},{"comment_id":"848324611946507","commenter_b":"Actually I spent a number of years in special ops in the military, we called guys like you \"Dinky Daos\".","commenter_a":"ISIS thanks Senator Cruz for supporting their strategy to create a war of religions.","post_message":"The Obama Administration has no foolproof vetting process, and this is tantamount to rolling out a welcome mat for terrorists to this country. Congressman Jeff Duncan and I have together introduced legislation that would empower states to use their Tenth Amendment authority to opt out of the national refugee resettlement program. Our legislation requires the federal government to inform states of its intent to settle aliens within their borders, and allows governors to reject those aliens if a governor believes that the refugee presents a security risk. Our children’s safety tomorrow depends on our ability to secure America today."},{"comment_id":"1248206901866985","commenter_b":"Ali Berdai haha","commenter_a":"Alex Bond","post_message":"By Liz Climo."},{"comment_id":"10153845270776167","commenter_b":"Joe make up your mind, can't have it both ways.","commenter_a":"Joe. That's the dumbest lie You've told. And that's sayin somethin","post_message":"Even small children would call this excuse nonsense."},{"comment_id":"10153580246221636","commenter_b":"Where we going? X","commenter_a":"@username when that degrees done, emigrate xx","post_message":"It's getting more and more expensive being a student"},{"comment_id":"1033224813385043","commenter_b":"My favorite lesbians work at Home Depot............","commenter_a":"I think my favorite part is that the guy was uncomfortable that gay men were running a hair salon. What? Don't you know that's where gay men come from? Salons and interior decorating warehouses. (Edit: Apparently I need to state that I am a lesbian and an activist and this is a joke poking fun at the stereotype. If you're offended by this, I suggest you take your efforts and make a change instead of complaining on an internet post.)","post_message":"*slow clap*"},{"comment_id":"427873120742228","commenter_b":"hiliary could disapear forever and I reilly do not think she would be missed.Bill would be happy .The country would be a lot safer .Not to mention all those people who overheard something her loud mouth said would not have to die.A lot of people have died in her wake.EVIL EVIL EVIL WOMAN if thats what you want to call her.","commenter_a":"F#!#hillary","post_message":"Donald J. Trump has demanded Hillary Clinton apologize for making claims about him and ISIS propaganda that turned out to be false. Hillary's campaign just responded without holding anything back... Do you support Trump over Hillary?"}]
