[{"comment_id":"10154047559291770","commenter_b":"Jail her","commenter_a":"hope they CHARGE HER","post_message":"Muslim woman lied about subway attack by Donald Trump supporters."},{"comment_id":"10156397389135354","commenter_b":"@username .. Martin.. better yet go fuck your Obama loving Momma..","commenter_a":"Obama is anti american ... he wants the rest of the anti americans to come and invade us.. he has decleared war on americans..","post_message":"WATCH Trump explain his plan, and why he opposes Obama's Syrian \"refuge\" scheme..."},{"comment_id":"10153715195470736","commenter_b":"NO>>NO..these are always a waste of tax payers money and benefit Corps...and I don't want MORE people here..","commenter_a":"NO!!! no no!!! such a waste.","post_message":"Would you want Oregon to host the summer Olympics in 2028?"},{"comment_id":"937893629592518","commenter_b":"men especially infantry like women.. all i can see this now is rape allegations and pregnancy going UP, that and men are biologically inclined to put a women's life first. thus taking away from the mission at hand.","commenter_a":"@username @username intentionally weakening our ground forces. Not because women can't hack it (most can't) but because they will be a distraction for the males and a logistical nightmare.","post_message":"#BREAKING: In a historic decision, the U.S. Secretary of Defense has ordered all military combat positions to be opened to women. STORY: @webpagelink"},{"comment_id":"10153472333633352","commenter_b":"So how do you teach your girls how to be in a stable relationship?","commenter_a":"I have 3 daughters & until they grow up, no man will harm them under my roof. I sacrifice my dating a man or finding a love, so they can always feel safe. I won't allow a man to enter my life until my task is finished!","post_message":"Woman Murdered by Boyfriend After She Allegedly Asks Him If He Assaulted Her Daughter in a Sexual Manner – Daughter Also Murdered, Then Man Takes Own Life."},{"comment_id":"10153685759487439","commenter_b":"Lets ban all Muslims and Idiots like u that have no more brains cause u do to much drugs and u are just as evil as them.","commenter_a":"Ban all Mosques and Muslims from all western civilization.","post_message":"A member of the Iraqi Christian community in Michigan wrote to alert me of a proposed mega-mosque going up in a Chaldean Christian community in Michigan. How frightening it must be to them when their Chaldean brethren in Iraq and Syria are being systematically cleansed from their centuries-old homelands under Muslim rule. The genocide of the Chaldean Christians accompanied by this:"},{"comment_id":"10154596759964166","commenter_b":"Only applies to men though... Women can murder their babies. Just ask killery","commenter_a":"What is \"feticide\" ?","post_message":"JUST IN: The man accused of killing a pregnant teacher and dumping her body has bonded out of jail. His bond was set at $500,000."}]
