[{"comment_id":"10153900591048812","commenter_b":"You mean creation of George W Bush and Cheney.","commenter_a":"You go France! I wish our president was like yours. We need to destroy this creation of Obama. But firstly we must impeach our muslim-terrorist president!","post_message":"TARGET ISIS: French fighter jets take off on mission to strike ISIS targets in Syria; at least 20 bombs were dropped on ISIS’s de facto capital in Raqqa. @webpagelink Video: Defense.gouv"},{"comment_id":"10157197688465354","commenter_b":"I hope the Police Officers NEVER help her out again!!","commenter_a":"That bitch looks like she is having seizures when she dances! Prince way, way, way better","post_message":"~~UPROAR~~"},{"comment_id":"10156425606485725","commenter_b":"Lol Caitlyn Jenner beat you as Most Fascinating Person. Lol Loser","commenter_a":"This is a cool post Donald ! I haul livestock so unfortunate'ly wasn't able to watch the show ! Really cool you post the neatest stuff!!!","post_message":"You do not want to miss Barbara Walters 10 Most Fascinating People of 2015 tonight at 9:30pmE on ABC! ENJOY!"},{"comment_id":"10152751952356130","commenter_b":"Stop sending people to Portland! #dontmovetoportland","commenter_a":"Esther Payne","post_message":"Is your city on the list?"},{"comment_id":"10152958936935927","commenter_b":"You can bet if she was muslim, her actions would be perfectly justified ....they wouldn't jail her or tell her to get another job !!!!!!!","commenter_a":"The governor has the power to quietly transfer her people..he choose instead to jail her, its ridiculous..Muslims in the MTA in NYC refused to do their job based on religion reasons, it never even made the news and they were quietly transferred...not jailed. It was worked out quietly and amicably, yet this woman they choose to jail. The governor should be asked why he choose to make an example of her...","post_message":"WATCH: Governor Huckabee - \"You're telling me that you cannot make an accommodation for an elected Democrat county clerk from Rowan County, Kentucky?\""},{"comment_id":"10153641231211337","commenter_b":"More like a Cabbage Patch doll had sex with that weird chick who snorts Ajax in Up in Smoke.","commenter_a":"Amy Schumer looks like Reece Witherspoon had a baby with the Pillsbury Dough Boy","post_message":"PERFECT: Amy Schumer was ready when someone compared her to the American Gothic lady..."},{"comment_id":"958986307470162","commenter_b":"Beware, ladies!","commenter_a":"There's zero evidence supporting that he was filming her. The only harassment caught on film was of the women berating a man. This guy will have a great lawsuit for slander against her.","post_message":"This woman just gave a street harasser a taste of his own medicine."}]
