[{"comment_id":"1400391526679146","commenter_b":"I was at fort Wainwright... Fucking miserable place no doubt (it was -37 when that pic was taken)","commenter_a":"Thank you for all you do!!","post_message":"I remember hoping I'd get frostbite so my chain of command would get an ass chewing. This is about as miserable as it gets. ~Will"},{"comment_id":"10152965938402232","commenter_b":"Your so right Geoffrey....why would she purchase a seat, in coach if she had no intention of using it?? So she could board the plane and hope she didnt get caught? That is not the time to have a disscussion about FCC rules!!! She should have a car seat with her....I hope the faa fines her for holding up the plane for over an hour..how many others passengers missed their connections.....just because she has a disability doesn't make her any more important then any other passenger. It seems like NO ONE today wants to follow rules...","commenter_a":"No one is mentioning the fact that they bought the child a seat in coach, and they were resting comfortably in first class. Essentially ignoring the child for the flight.","post_message":"The 3-year-old girl has a debilitating condition in which she is unable to move her arms and legs, or to hold her head up on her own, according to her mother who was holding her daughter on her lap when a flight attendant became \"visibly upset.\" @webpagelink"},{"comment_id":"10154103250631756","commenter_b":"\"Are ya goin' ta prison like my maw??\"","commenter_a":"\"Are you goin' ya prison like my maw??\"","post_message":"Cuteness abounds, but so do questions about whether the kids are plants."},{"comment_id":"10153882831009714","commenter_b":"The same reason why men need viagra...","commenter_a":"No pregnancy is a choice and it doesn't deserve any special treatment. Women have been pregnant for as long as time and they didn't need special parking, so why do they need them now.","post_message":"What do you think?"},{"comment_id":"10153302995429255","commenter_b":"That is not proven, nor can it be.","commenter_a":"I got the rubella vaccine when I was 27 because that was the one childhood disease I didn't contract. At age 27 my body was able to handle the vaccine. NOW tell me PLEASE how the hell do you think its OK for an hours old baby to get vaccinated for a sexually transmitted disease, and then 48 more by age 18 months? Its seems to me KOS person, you have been bought by big pharma, or you are on a rant. Because this getting tedious","post_message":"A \"perfect storm\" is starting to brew. By Daily Kos user Lib Dem FoP"},{"comment_id":"10154917565918690","commenter_b":"how about stop raping women and build some toilets?","commenter_a":"Great job ....we feel proud of our national anthem..haters ...f****k offf","post_message":"\"The time has come, the citizens of the country realise that they live in a nation and are duty bound to show respect to the national anthem. @webpagelink"},{"comment_id":"10153308250786770","commenter_b":"Even if a guy is into that, I can't imagine him liking those freaky legs.","commenter_a":"If he wants to live as a woman, that's on him, but could someone please tell him if he's going to wear short skirts to put on pantyhose? His legs are ugly & weird looking.","post_message":"\"That will always haunt me,\" Caitlyn Jenner said."}]
