[{"comment_id":"1354573844595375","commenter_b":"wELL LET THEM TERRORIZE THEM AND THIER FAMILIES AND LET'S SEE HOW QUICK SHE REPEATS THIS ASSINIGNE REMARK","commenter_a":"Send these twits over there to give them love and hugs.","post_message":"Oh brother!"},{"comment_id":"10150802483299999","commenter_b":"Takes one to know one.","commenter_a":"Takes one to know one!","post_message":"Ted Cruz called Donald J. Trump a “pathological liar\" and a “narcissist at a level I don’t think this country has ever seen.”"},{"comment_id":"542586789241125","commenter_b":"Get off drugs!!! Our economy would crush!!","commenter_a":"Trump is not dropping out you idiots. The best you can hope for is Trump/Carson ticket.","post_message":""},{"comment_id":"10156170430735354","commenter_b":"Women don't need men any longer. They hate men. They have each other, the feminist lesbian agenda, invetro fertilization and high tech sex toys. All they need are man farms for harvesting sperm.","commenter_a":"Truer words.........","post_message":"\"...academics and feminists are terrified and calling for them to be banned.\""},{"comment_id":"10153134132200933","commenter_b":"Adan the total pussy.","commenter_a":"Kasich is the best up there by far","post_message":"Check out Gov. Kasich's opening statement from tonight's #GOPDebate."},{"comment_id":"1693513877603730","commenter_b":"This is silly. People may not like him me included but who Someone decides to vote for should be there choice and not pushed on them. That's exactly what this would do. I supposed you also felt bad for the Emory students that cried about some chalk?","commenter_a":"Futile","post_message":"#VoteTrumpGetDumped is encouraging women to dump Donald J. Trump supporters because of the way he treats women."},{"comment_id":"10155365024480354","commenter_b":"Loony witch....","commenter_a":"if you don't like it here LEAVE. There are plenty of non whites that are racists and fat and you seem to ne a racist yourself lady","post_message":"\"All the people who are crunched into the middle of America, the real fat and meat of America, are these racist conservative white people who live on their farms.”"}]
