[{"comment_id":"10154028349033812","commenter_b":"@username because I CAN and honestly sick of hearing about that dn women people KILL THERE SELF everyday she's no damn different","commenter_a":"I always knew something was wrong with the story could not understand why","post_message":"Texas trooper who arrested Sandra Bland surrendered to police after being charged with perjury."},{"comment_id":"1736087096643244","commenter_b":"She can dig as much dirt as she wants. We all see right through her. What a loser.","commenter_a":"Lied and busted on national tv","post_message":"Alicia Machado blames Donald Trump for her two eating disorders..."},{"comment_id":"1692723517682991","commenter_b":"One of you crazy ladies is from Texas.","commenter_a":"Realism is not what I see coming from most of HRC's supporters. There are some extremely hard to admit, and in fact, frightening facts that I think we have all tried to glaze over for years. In Bernie Sanders we have got a candidate that is addressing those facts. Climate Change is real, most democrats are no longer climate change deniers, but I feel like the real threats are being overlooked. For example, droughts are happening all over the United States. We are quickly depleting our fresh water aquifers. When one factors Fracking into this, we are willfully allowing our government to destroy more of our fresh water systems. HRC cannot denounce Fracking. Now, before you think that article that spells out how much HRC is taking in campaign contributions from the fossil fuel industry is another Republican smear tactic, note that it is by Greenpeace. She has to go. ...","post_message":"\"We can open the door to every person in this country again.\" —President Bill Clinton"},{"comment_id":"1199679816751446","commenter_b":"@Jim. that sucks! But does not eliminate Trump. We need to get Muslim Terrorist Lovers and their people out before we start on removing the money grabers!","commenter_a":"Who much money are you making Mitch, to allow the Obama's Muslims Terrorist Groups, mainly \"The Brotherhood\", to get more weapons and other support? You are supposed to be stopping this, not helping it! You are already helping Obama, not our Country, by you and Ryan allowing him to much spending money to begin with, now you are screwing us again! You'll get your's as soon as Trump or Cruz are President, there will be some Audit's taking place to stop what you and Obama are now doing!","post_message":"Truly terrifying!"},{"comment_id":"10156866881005231","commenter_b":"Porsha Williams (Dish Nation)should be next.loud mouth and Crazy.Don't take the Club to you Job. Stop Emphacizeing and Profileing your rear end Porsha.Professsionalism evidently is not in your vocabulary. You are not the only woman with a big butt.Its most likely paid for anyway.","commenter_a":"All that smacking her mouth waveing her hand poping her fingers and all that darn yelling in the mic.Enough!Don't take the Club to your JOB.","post_message":"Did the leader of the 'Tamartian army' get the boot?"},{"comment_id":"10152933128350671","commenter_b":"That's because when you were younger they weren't mixing the vaccination like cocktail drinks.","commenter_a":"I'm 45 year old hot all my vacs as a child and I'm ok","post_message":"The Senate on Monday reaffirmed the bill striking California's personal belief exemption for immunizations on a 24-14 vote."},{"comment_id":"865723720214442","commenter_b":"Abortion is murder, and most unwanted pregnancy are related to sin sex with a man they don't love a date of selfish reasons like I am not ready now I am in school or the man runs off or even the man wants her to get one and even beats her.","commenter_a":"There is a planned parenthood in Knoxville that advertises abortions on their website. So why this woman decided to self abort is a puzzle.","post_message":"While attempting to self-abort with a coat hanger, the woman became worried about her own safety. Her boyfriend took her to the hospital where doctors delivered a 24-week-old baby weighing just 1.5 pounds."}]
