[{"comment_id":"705870246236573","commenter_b":"Muslim Bakeries also refuse same sex marriage cakes as well it was done under cover and yet No Punishment!","commenter_a":"Yet Muslims can get out of delivering beer on religious grounds and awarded damages. Seems Christians are not afforded the same religious protection.","post_message":"A sweet slice of JUSTICE!"},{"comment_id":"10154327927746336","commenter_b":"Only thing that needs a brain is u Hernandez as u can't even spell my name which is right infront of u.. Thank God Trump is getting rid of all u illegals.","commenter_a":"Please refer to him as President Trump.. Thank u.","post_message":"This morning, Donald J. Trump tweeted out a message for Memorial Day."},{"comment_id":"10152925277511336","commenter_b":"Let it go, let it go!","commenter_a":"WELL YOU FORGOT TO MENTION THE SNOW THAT WE HAD IN wc/PA.","post_message":"JUST IN: Travel bans in New York and New Jersey have been lifted. Blizzard predictions that kept millions of people home are now being downgraded. @webpagelink Time-lapse video taken Tuesday morning shows a deserted Times Square:"},{"comment_id":"587852428063303","commenter_b":"@username WOMEN ARE THE FIRST TEACHERS OF MEN","commenter_a":"Amusing that Trump is too dim-witted to debate real issues affecting our country. Hahaha Republicans! Ready for Hillary 2016!","post_message":"Trump thinks attacking Hillary's marriage will save him. He'll soon find out how wrong he is."},{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"},{"comment_id":"10153524671301323","commenter_b":"If they are dangerous, then stay away!","commenter_a":"So is crossing the street. Let's kill all the drivers.","post_message":"“Everybody thinks we’re cold-hearted killers and it’s not that ... Giraffes are very dangerous animals. They could hurt you seriously, very quickly.”"},{"comment_id":"10153099385609255","commenter_b":"Of course there is climate change. It's been jumping around forever.","commenter_a":"The animals are a bit smarter than the scientists and they live in the weather not a lab","post_message":"Happy Groundhog Day—here's to six more weeks of winter. Thanks to Believing in imaginary friends and fairy tales is outside of my age bracket for sharing."}]
