[{"comment_id":"1579440092351045","commenter_b":"@webpagelink What Fox News doesn't tell you about #muslimlivesmattertoo","commenter_a":"I will never ever vote for someone as abominable as Trump! After four decades of voting GOP- I am done.Never Trump!","post_message":"'In spite of all the criticisms and vitriol being heaped upon Mr. Trump by Washington’s political elites, he has neither wavered nor sold his soul to the devil of Washington politics. Instead he has remained faithful, true and honest'"},{"comment_id":"10153527137233717","commenter_b":"Hell no! The real woman for the job is Hillary! #Hillary2016","commenter_a":"Please support Carly Fiorina tomorrow! Non establishment, proven leadership. Fight against the machine with a level headed conservative. Please support Carly! She needs your help to place in the top 4!","post_message":"Donald J. Trump is holding a rally at the Verizon Wireless Arena in Manchester. Watch live: @webpagelink"},{"comment_id":"1242328489179018","commenter_b":"Sick bitch. I hope she chokes to near death and has a fucking stroke. I don't hate people but this pos. needs to disappear for good.","commenter_a":"Wow, is everyone scared of killery ? Geeze really ? Oops, forgot about the Clinton Mafia and all the dead bodies in their wake. Maybe they have reason to be.","post_message":"After months of pressure, the mainstream media has finally begun asking questions about Hillary Clinton's health. Just as they do, however, Hillary and her people have made a SICK threat to all of them... and it could mean that the truth stays hidden from America."},{"comment_id":"10152850866306051","commenter_b":"susie you didnt read so shut up u dumb bitch","commenter_a":"What does the kind of dog have anything to do with insurance.","post_message":"When the insurance company found out what sort of dog this woman had, they told her that her claim would be denied."},{"comment_id":"10153761694679705","commenter_b":"well lets say i know more","commenter_a":"did ya know they have votes to local reps to say the same as the usa does not likely","post_message":"Direct mail service was cut in 1963 at the height of Cold War tensions."},{"comment_id":"10154188598828405","commenter_b":"he is fighting to get your gun","commenter_a":"Thank you Rep. Lewis!! From a mother, military spouse and small business owner - I'm happy to see democrats fighting to keep us safe! #goodtrouble","post_message":"On July 5th, we're going to continue to push, to pull, to stand up, and if necessary, to sit down. Don't give up. Don't give in. Keep the faith, and keep your eyes on the prize. #goodtrouble"},{"comment_id":"1581294075496417","commenter_b":"Kiss my white ass","commenter_a":"If we give them reparations will they go to school and get a job and stop whining?","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery. Never in a million years. That is old history. Will you compensate blacks for slavery?"}]
