[{"comment_id":"684212015075058","commenter_b":"@username Your mom was penetrated 3 or 4 times in one day by a cave dweller","commenter_a":"The source file was on whitehouse.gov when they originally released it. I downloaded it, simply opened it in photoshop, and all of the layers were still accessible. I was able to remove words, dates, signatures and even fragments of words where they pieced them together. It was a complete fumble on their part.","post_message":"I thought this was just a conspiracy theory. But it actually happened today. #fakepresident? Edit: No we have not been hijacked, and our mods have diverse political opinions. This was from AP and tons of other sources both left and right, definitely not fake. Heavy was the most neutral we could find."},{"comment_id":"10153321750847439","commenter_b":"LMAO love it! She is a low life who feeds on hatred","commenter_a":"It takes a lot for an atheist such as myself to be bothered enough to come on this page and attack a low life like Geller who has zero intelligence and is followed by a bunch of losers who are the love children of their mothers and uncles, but hey, we all gotta do what we gotta do.","post_message":"Amazing heroes providing security for free speech conference #motoons #AFDI"},{"comment_id":"10152850762031748","commenter_b":"Whose boobs is he reaching for? :)","commenter_a":"This is beyond bizarre!","post_message":"Religious Right pundit claims Satan is using gay rights to persecute Christian athletes"},{"comment_id":"10153985207391680","commenter_b":"The Deplorables, The Unredeamables won the election tonight. The Media, Hollywood, Academia, Celebrities and the Elected Officials on both sides that have tainted and divided our country with their slanted, elitist opinions have finally been put in their place. This election was never about Donald Trump, it was about the people. Not the people the media falsely reported about and stereotyped. I was at two Trump rallies, these people were black, white, Hispanic, all ages and all races. People who love our country, love our constitution and the principles within it, love God and love and respect all Americans. The silent majority who we're sick and tired of being falsely portrayed as the intolerant ones, being intimidated, called names and told by an arrogant and grossly out of control government and out of touch minority what we were supposed to think, say and do. #WeThePeople #IndependenceDay2016","commenter_a":"This is about Obama, the establishment and MSM picking Clinton over Bernie. Congrats imbecils.","post_message":"Barack Obama's legacy lost on Tuesday night."},{"comment_id":"10153519416973812","commenter_b":"God rest their souls! That sicko should rot in hell!","commenter_a":"R.I.P god bless this good people.","post_message":"These are the 9 people who lost their lives after a gunman opened fire during a bible study at a Charleston church: @webpagelink"},{"comment_id":"10154507086148984","commenter_b":"She was instructed to keep her hands on the dash...smh","commenter_a":"Not even surprised by this video, their false narratives always fall apart.. And instead of rendering aid to her boyfriend she continues to record, can't be more self-centered than that.","post_message":"Right after Philando Castile was identified as the man killed by police, people started talking about what a wonderful guy he was. But we've found video of what he was caught doing to a helpless child before he was killed, and it will make you sick. Don't expect to hear about this anywhere but here..."},{"comment_id":"783781558433266","commenter_b":"That's the truth! Their acting like that's what they won't so people think their real. Lol! Their both scared and they should be! Trump the only one can beat Hillary or sanders!","commenter_a":"Move on.org, BLM and now Bernie supporters, are all DOMESTIC TERRORIST GROUPS OF AMERICA. They all need to he arrested! This is not protesting, this is organized violence!","post_message":"The last person that Hillary or Bernie want to run against is Donald Trump --- and that is fact!"}]
