[{"comment_id":"10153325338244342","commenter_b":"Stfu Lilia Jimrnez....you dumb woman","commenter_a":"So are we going to start killing police, getting revenge and causing a war in our country? Or are we actually going to try and solve these problems between police and the people they are supposed to be trusted to protect.","post_message":"Hundreds of people are expected to attend a prayer walk slated for Sunday night in northwest Harris County to remember Harris County Deputy Darren Goforth. #abc13"},{"comment_id":"961148523904901","commenter_b":"Every female I pursued that said \"No, I am not interested in more than being friends\" at some point had sexual relations with me and enjoyed it after I kept pursuing her in ways she WAS responsive to! some women want gifts and loads of flattery before they say. When they dont want to be friends, I stop pursuing them, until then its their choice to hang or not. The only clause is when they ended up being lesbian women!","commenter_a":"No means No! Some people don't get it. If someone is not interested in you move on.","post_message":"After a 14-year-old girl told her mom that a boy was aggressively pursuing her at school, her mom, a clinical sexologist and video blogger, decided to post a video to the boy on YouTube. >>@webpagelink"},{"comment_id":"10153045091301336","commenter_b":"YOU CAN BET YOUR LAST PENNY THAT MR OBOMO HAS HIS GUNS, PLURAL..SHOULD THEIR CHILDREN BE REMOVED, ALL THOSE THAT ARE MAKING THESE LAWS ..HOW ABOUT REMOVING THEIR CHILDREN, THEY ARE IN DANGER IF THERE IS A KNIFE IN THE KITCHEN..OH THEY WANT OUR GUNS..WE MUST STOP THIS NOW..THE CRIMINAL WILL NEVER GIVE UP THEIRS. THEY ARE STOLEN SO NOONE KNOWS UNTIL THEY ARE SHOT SO,THEY CAN ROB THEM.WE HAVE THE MOST STUPID THINGS TO OBJECT THOSE CHILDREN BEING LOVED AND CARED FOR..GET THAT LAWYER AND SHOW THEM YOU HAVE RIGHTS..GO GET THOSE LITTLE ONES WHO ARE NEEDING YOUR LOVE..PLEASE AMERICANS STAND UP FOR THESE PEOPLES DILEMMAS . DEMAND THEY GET THOSE BABIES..GOD BLESS THEM TOTALLY !","commenter_a":"well we better not let foster parents that have a car,knife, prescription drugs,dogs,plastic bags,power tools,bow and arrows,swimmimg pools etc., cause all of theses items can kill!! Get real!!!! The government is trying so hard to take our guns away from us !!! They don't care about these children!! They just want control of our guns and they don't care if children have to stay in orphanages with no hope of having a family to love them!!","post_message":"“I want to help some of these children that don’t have the luxury of a family to love them. Everyone deserves to be loved and cared for.” Valerie and Brian Wilson were denied their request to serve as foster parents because they have legal concealed-carry permits. WATCH more from their interview on 'FOX & Friends Weekend': @webpagelink"},{"comment_id":"1047100888663716","commenter_b":"She's an embarrassment to womanhood.","commenter_a":"This woman is always putting her foot in her mouth. She's right up there with Sara Palin.","post_message":"Watch her crash and burn."},{"comment_id":"10153257961321162","commenter_b":"They should crucify her.","commenter_a":"Wtf people come on!!","post_message":"DEVELOPING: The bodies of two children, ages 11 and 14, were found dead in a freezer, and the mother is being held as a person of interest @webpagelink"},{"comment_id":"505614509629101","commenter_b":"Kendra Alison and Edward Michael Davila. The story continues.....","commenter_a":"Alison Anderson! Ann DuBay!","post_message":"Announcing the news today, his attorney tweeted in all-caps: \"WE WON A NEW TRIAL FOR ADNAN SYED!!!\""},{"comment_id":"1234345436618217","commenter_b":"They had a class on how to not rape women? Send the raping muslims home","commenter_a":"Stupid girl, wait until it happens to her or someone close to her, then she will change her tune.","post_message":"Watch as Red Cross spokeswoman cautions that this is just an isolated incident involving a teen who just didn't know any better...."}]
