[{"comment_id":"10153668088332452","commenter_b":"Ain't that near McD's and the bus station we were chillin at? @username","commenter_a":"Why are Latinos protesting? I don't see blacks protesting when a Latino is killed by a cop? 😒","post_message":"UPDATE: Video shows the chaotic scene as protesters scramble for cover as snipers open fire during marches in downtown Dallas. @webpagelink Eleven officers were shot and five killed."},{"comment_id":"1250130898332398","commenter_b":"Fuck off bitch!","commenter_a":"I voted for Bernie. I'm voting for whoever stops that White Nationalist Donald Trump. If Bernie is voting Hillary, so am I.","post_message":"Bernie just put the nail in the coffin for the Trump campaign. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1209227002477386","commenter_b":"Dumb ass bitch","commenter_a":"I feel bad if they were black but if they're white I don't give a fuck because they never care bout us dying","post_message":"#WSHH #Iowa #Police #BreakingNews"},{"comment_id":"517159568465923","commenter_b":"Actually Humphrey already had it wrapped up","commenter_a":"One of the saddest days in our nation's history. I have no doubt he would've won the nomination and the election. I was only 12, but remember it like it was yesterday.","post_message":"RFK's loss still being felt."},{"comment_id":"1297466373615674","commenter_b":"HOW CAN ANYONE VOTE FOR THIS WOMAN WHO IS SO BLATANTLY FOR THE SUPER RICH !","commenter_a":"GO BERNIE !!! YES ... we surely need to implement a nationwide ban on this problem will destroy our only livable planet, Hillary support fracking... That's totally unacceptable and she is unfit to be pres.","post_message":"Fracking is a reckless, destructive and expensive practice and we must put an end to it all over this country. Add your name to say you support preventing the worst effects of climate change through the Keep it in the Ground Act."},{"comment_id":"991971067506900","commenter_b":"Islam IS the Problem !!","commenter_a":"That would stop all protests if you take a couple of the looters out!!","post_message":"\"After handing over his ID card, the terrorist stabbed one of the officers in the neck and another one in the upper body.\""},{"comment_id":"942501505798873","commenter_b":"just burn the lying btch","commenter_a":"She needs to be in prison for the next 30 years or longer.","post_message":"Good grief, Hillary Clinton..."}]
