[{"comment_id":"10152995429007507","commenter_b":"So you won't procreate?","commenter_a":"Ha-ha.","post_message":"Clock started...."},{"comment_id":"10153572018825695","commenter_b":"Yeah, it's like a 10 hour trip from here.","commenter_a":"@username we need to plan a trip there and check this out. Me you and Jason Snyder","post_message":"TRENDING: One lucky woman discovered the fifth largest diamond ever found at an Arkansas state park. @webpagelink"},{"comment_id":"10153286169819705","commenter_b":"No, they aren't talking about Snow.","commenter_a":"Thanks for the spoiler","post_message":"For once, Game of Thrones didn't kill off a character when it looked like it was going to."},{"comment_id":"10155152380736337","commenter_b":"\"I'm an idiot who has never read a book or even been in a bookstore but I fo sho is gonna post on Facebook all day and show those educated peoples the what for!\" And she says to get a life?","commenter_a":"I literally just had to google who J.K. Rowling is. This person has ZERO impact on me. I find it hilarious that these \"celebrities\" think that they impact our lives in any way, shape and/or form.","post_message":"BURN: J.K. Rowling's latest tweet-spree took no prisoners..."},{"comment_id":"936764406358981","commenter_b":"what tits. he was smelling her fart","commenter_a":"\"Joe stop staring at my tits, thanks.\" ~ Hillary","post_message":"Can you imagine? Talk about our country going to hell in a handbasket…"},{"comment_id":"1218857281537727","commenter_b":"She is still authentically uncorrupted. may she hold on to that and help the US find itself again","commenter_a":"Could please run for president ! Please","post_message":"Education is power and to fight sexism and inequality, Michelle Obama has a message to young girls around the world. (via NowThis)"},{"comment_id":"10155345287068132","commenter_b":"She needs to save her nekkidness for JZ.","commenter_a":"Wierdo & shes so over rated meh","post_message":"We're still not over Beyonce's performance! Join us in the comments to let us know what you thought."}]
