[{"comment_id":"10156429465415354","commenter_b":"Whoopi, you dirty looking bitch Those Islamic Muslim women are in danger of being deported Our female population on the other hand is under threat of gang rape and murder by the Islamic Muslim terrorist.","commenter_a":"Moron...","post_message":"WATCH Whoopi unload on Donald Trump..."},{"comment_id":"948827975173732","commenter_b":"Alright, Rosa! Good for you and good for Latina women!","commenter_a":"Yes @username with the Latin vote you will be our president 2016 yeaaaa","post_message":"Hillary stands up for Planned Parenthood—and women's rights."},{"comment_id":"10153540366322061","commenter_b":"It's not. But I've never seen it happen. Making laws to protect the rights of others is NOT discrimination. Even if you find the laws offensive.","commenter_a":"So why is it alright to discriminate against Christians?","post_message":"Charles Barkley pushing the NBA to move the All-Star game from North Carolina due to state's so-called \"anti-LGBT\" law. \"As a black person, I against any form of discrimination.\" @webpagelink"},{"comment_id":"10153990315029062","commenter_b":"So sad.......where are the parents???","commenter_a":"Seriously? the kids are really that dumb/stupid......those grades are apalling......what did the students/teachers do from the start of the school year until now?","post_message":"Monroe demanded the HISD Superintendent Terry Grier immediately step down."},{"comment_id":"10156250000825354","commenter_b":"This leftist democrat is trying to push the blame to christian Americans. She wants what the democrats want more terrorist here. VOTE OUT ALL DEMOCRATS.","commenter_a":"People, please read the book \"The Seduction of Hellary Rodham, by Brock.","post_message":"Yeah, so, um, this happened..."},{"comment_id":"10153206229641336","commenter_b":"You Carol, are a Goddess if you can swallow that orange whole! Puh-tow!","commenter_a":"Great. We need someone like him. He gets my vote.","post_message":"Vermont Senator Bernie Sanders is set to announce his decision to run for the Democratic nomination for the presidency as soon as Thursday, according to multiple reports. @webpagelink"},{"comment_id":"10155360412381509","commenter_b":"She's a nasty looking monkwy","commenter_a":"Michelle Obama is the most elegant, intelligent and intellectual First Lady's ever to grace the White House. This family will be missed!! God bless them!","post_message":"Over the past eight years, former President George W. Bush and First Lady Michelle Obama have been seen becoming increasingly chummy."}]
