[{"comment_id":"10153937473666336","commenter_b":"Michell is NOT a woman.","commenter_a":"PU$$ Y !!!","post_message":"\"You help keep us free. You help keep us strong. Whatever service you're in, whatever branch, we are extraordinarily grateful for everything that you do every single day.\" – President Barack Obama"},{"comment_id":"10154429812461051","commenter_b":"Damage fags","commenter_a":"Impeach Trump","post_message":"The World Bank claims Trump could be the best thing to ever happen to the American economy. Do you think they're right?"},{"comment_id":"1054779971229141","commenter_b":"Shes just crabby because no one will rape her","commenter_a":"And thank here for elevating race hatred to a new high!","post_message":"Ann Coulter actually said Hispanic immigrants were responsible for the \"browning of America.\""},{"comment_id":"10153327625216833","commenter_b":"She's a puppet","commenter_a":"Seems to me that the police that have been in danger are in the black communities.","post_message":"On March 28, MSNBC Melissa Harris-Perry suggested the push away from gun control and toward expanded gun rightswhich means more armed, law-abiding citizensactually puts police lives in danger."},{"comment_id":"10153222902488645","commenter_b":"@username dont worry about those nails.... worry about that mouth full of yellow teeth.... nasty","commenter_a":"Who cares? The dude is old as hell and WWE is for red necks.","post_message":"Hulk Hogan claims that he resigned from the WWE in the wake of the release of the transcript in which he used racial slurs, while the pro wrestling company says he was fired. Either way, all mention of him has been scrubbed from the WWE's website."},{"comment_id":"1478284585520531","commenter_b":"@username At least he loves and respects Americans, which clearly you are not....Does not have the blood on his hands like Hillary of 114 people and counting.....Maybe you want him to destroy us, but, when he does you'll be right there with us all...Let all these illegals come live with you!!!","commenter_a":"This has got to stop!!!! Please read the following.. John Miech *Here is something to think about**, and why so many Americans support Donald Trump !!* (This information has all been checked, then double checked... it is 100% Correct.) That's why there is such an alarm within US government, since Trump's statement about temporary suspension of migration of Muslims to US till US authorities make sure there is a proper concept of safe penetration of US territory. People are stunned to learn that the head of the U.S. CIA is a Muslim! Do hope this wakes up some! You mean until it hits you like a ton of bricks read it again, until you understand! We now have a Muslim government. @username, current head of the CIA converted to Islam while stationed in Saudi Arabia. Obama's top adviser, Valerie Jarrett, is a Muslim who was born in Iran where her ...","post_message":"Do you know what the actual percentage of money the Clinton Foundation has raised that they donate so far to charity is? It's like 5%."},{"comment_id":"10153315514576336","commenter_b":"That turbofan jet engine intake is sturdy enough to handle the weight of that woman. Also, her derrière is not going to effect the shape of the intake. It is designed to handle air pressure from 250 knot IAS relative wind that at altitude could be as high as 550 knots TAS. So, what's the big deal? I think the picture looks COOL!!!","commenter_a":"I do not think so. The preconditions are whether the company has the clear policy for it, whether she got enough training of behavior in the company?","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."}]
