[{"comment_id":"10153811054249749","commenter_b":"Werent immigrants. They'd flown over to do this and some other jobs then planned to go back.","commenter_a":"Citizens arrest. Very good. Nice to see some black citizens using their fitness and strength to uphold the law. A good image for black people worldwide... Estonian immigrant eh? Well, well, I would contend it's a moot point whether or not he's 'enriched' the UK. He certainly is trying very hard to 'enrich' himself, although I think he should consider another profession to be honest... ;-)","post_message":"Police release CCTV footage showing members of the public in Leeds tackling an armed jewellery thief and pinning him until police arrived."},{"comment_id":"10153177506232885","commenter_b":"Scumbag whore.","commenter_a":"Unwhite Bastards.","post_message":"At a complete loss for words right now! This is absolutely disgusting and an abuse of the right to free speech!"},{"comment_id":"1857128867864045","commenter_b":"What about the insane amount of lying going on in the White House right now? I haven't heard you talking about that.","commenter_a":"So lame.","post_message":"Please check out our 2nd Facebook live town hall right here!"},{"comment_id":"10152820989551615","commenter_b":"I would be putting her inappropriately dressed (?) fat butt right out of the \"prom.\" She LOOKS like a moderately dressed hooker! Maybe that is closer to the truth than one might think.","commenter_a":"Wouldn't be necessary if the CHILDREN and their PARENTS actually knew how to dress appropriately.","post_message":"“You can't put ten pounds of mud into a five pound bag.\" One parent is threatening to sue for sexual harassment over a school handout about the dress code for graduation. It’s a story we’re talking about this morning on Channel 11. @webpagelink"},{"comment_id":"10153003088197377","commenter_b":"It will be a huge shake up.","commenter_a":"Now they talking I guess they are coming out of there dream closets, they better rally around him and make this country great again.#Trump/Cruz.","post_message":"Newt Gingrich says Donald Trump is capable of winning not only the Republican presidential nomination."},{"comment_id":"10153564922718984","commenter_b":"I think the Hispanic people think that the U.S. owes them everything. Being a hairdresser I did lots of H/cuts on men. They wanted every hair on their head to be Perfect. It really bothered me when so many men came in the salon just to wait until the H/C was finished. They would bring young girls with them, who could interpret the English language. It was so hard for the young girls to be put in the middle to speak for them & me. This should be a wake up call due to illegal immigrants.","commenter_a":"We all know this!!!","post_message":"This frustrated sheriff just sent a huge message to America that perfectly sums up Donald J. Trump ... his words are going viral and it's easy to see why. What do you think about what this sheriff just said about Trump?"},{"comment_id":"1116898208348184","commenter_b":"She's the prime example of a \"nasty\" woman","commenter_a":"As if anything this trash had to say matters!! She's disgusting herself!! I mean she's into animals and champagne bottles!! Hello!! Need I say more. Madonna , you're far from a woman if virtue!!! Lmao","post_message":"Madonna slammed Donald Trump, claiming that he 'hates people of Color and Women and is Anti-Semitic.'"}]
