[{"comment_id":"2081524555405540","commenter_b":"SHUT THE F UP! People like you are the Cause!","commenter_a":"You are a complete fool. America needs to bring God back into our nation. Then senseless killings and hatred would cease. All life matters.","post_message":"Here are Lena Dunham's TWEETS about \"White Americans\" in the wake of Alton Sterling's death..."},{"comment_id":"1756788254541132","commenter_b":"Calmate gueys!","commenter_a":"I'm Mexican. 100% computer engineer. I break 115k a year. Lol. I guess I did take a white man's job!","post_message":"WATCH: Immigration protesters from the Puente Human Rights Movement shut down a portion of Central Ave in Phoenix, near McDowell. They're upset with today's Supreme Court decision that overturns President Obama's plan to protect illegal immigrants whose children were born in this country."},{"comment_id":"10157043455730206","commenter_b":"May God keep you stronger, Celine","commenter_a":"So sorry for your loss!","post_message":"Celine's brother Daniel had been battling cancer of the the throat, tongue and brain."},{"comment_id":"10154067213591770","commenter_b":"@username take out Ca and she lost that too illegals told ok to vote by Oblamo","commenter_a":"I'm so fed up with hearing about the \"popular vote\". Our constitution was NOT set up that way, so please stop talking about it. IT DOESN\"T MATTER. Let me break it down for the simpletons. Suppose you live in a homeowners association. If there is an issue, each home has 1 vote, decision is made fairly. However, if it was a \"popular vote\", then each resident would have a say. If you lived by yourself, you'd possibly be outvoted by your neighbors who had a houseful of 5 people, everytime there was a vote. Which would you prefer? That's how our republic is set up: each state has a FAIR vote in electing the president. Forget the popular vote, unless we change the constitution.","post_message":"Liberals did not like what Ann Coulter tweeted."},{"comment_id":"10152653959642894","commenter_b":"my wifey cnt marry ciara's nigga #loveTINASHE","commenter_a":"hmmmmm \"HOW MANY TIMES\" we gonna hear that lie....I love Tinashe but when I found this out...lost so much respect for her. You know it's gotta be true....if you listen to \"How many times\" you know it...and....Ciara been hurt too many times so....she just gonna leave her baby daddy for NO REASON? Oh.....ok","post_message":"Tinashe Denies Rumors That She's Dating Future, Says It's '100% Made Up and Untrue'"},{"comment_id":"840187412685267","commenter_b":"How about no sex till your married. No need for pills or protection. Problem solved","commenter_a":"you can't fool Mother Nature","post_message":"New commentary from Matt Walsh on birth control. \"Where is the feminist outrage when you need it?\""},{"comment_id":"10153389679411350","commenter_b":"the dirty creep is the one defending a perv family Linda!!!!!!","commenter_a":"Why is this even a question????","post_message":"Should TLC cancel 19 Kids and Counting?"}]
