[{"comment_id":"691233461036607","commenter_b":"Every \"illegal immigrant should be deported\" good let's start with Malenia Trump","commenter_a":"Every last illegal immigrant in this country should be deported and all charged with a felony for being illegally here. If they come back again, charge the immigrant with two felonies and put them in prison, then deport them again when their sentence is up. If there is a third time for the immigrant to come back, give the natural life sentence. People that come here, should do so legally.","post_message":"Obama deported a record 1.5 million people in his first term."},{"comment_id":"10153104771426051","commenter_b":"That woman is whack a doodle!","commenter_a":"Get a real life.","post_message":"This mom took one look at her daughter's Christening cake and immediately demanded an apology from the cake shop."},{"comment_id":"10154449540370586","commenter_b":"That's bull learn something we do think for ourselves besides the president of the church knows she is evil educate yourself instead of spreading lies. Most Mormons are voting Trump or another candidate","commenter_a":"Most of the truly faithful Mormons will just vote for whoever church leaders tell them to, just like good little sheep... Both candidates should be in private talks with the church","post_message":"Democratic nominee Hillary Clinton’s campaign has launched “Mormons for Hillary” in an effort to woo people in red-state Utah to vote for her. Is it working?"},{"comment_id":"889632651227311","commenter_b":"She's a dingbat","commenter_a":"Way to meny Hillary lovers. Hate Sarah only because she is a conservative.","post_message":"Trump comes forward with huge announcement about Sarah Palin... You're going to love this. She is a true patriot and will serve our country. Can we get 10,000 'LIKES' for Sarah Palin?"},{"comment_id":"10153947557669753","commenter_b":"Police and your government bosses, STOP PREYING ON BLACK PEOPLE LIKE HUNTING WILD GAME AND SHOOTING US TO KILL!!!","commenter_a":"She is crying a hell of a lot more now that she is being interviewed than when sitting next to a dying man with her child in a car... Still say something fishy about the whole situation","post_message":"Police scanner recordings obtained by a local Minneapolis news station reveals that St. Anthony police officers pulled over Philando Castile not because of a busted tail light but because he looked similar to a robbery suspect due to his “wide nose.” The startling dispatch recording indicates that not only was Castile seemingly racially profiled for his “wide nose”, his girlfriend says that officers lied when they claimed the stop was for a tail light that was out as the tail light was seen... @webpagelink"},{"comment_id":"10154858559120259","commenter_b":"Good! I hope they lock that bitch up for as long as they can!","commenter_a":"Time for prison.","post_message":"Student Nikki Yovino claimed she was raped by two football players, both of whom lost their scholarships and maintained the sex was consensual. Now, Yovino admits it was a lie designed to gain sympathy from another man she liked. She now faces charges that could bring 5 years in prison if convicted."},{"comment_id":"10153617326474032","commenter_b":"William you have good reasonings, I agree that we need to know who's coming in, but remember that we have some sketchy people who shoot schools and movie theatres here in our own country born and raised. I agree we need to have background checks, but they take a while and that's why they risk their lives to find work and live better lives here. Why would an illegal want to just cross the border to cause havoc? They're here to work. An illegal Mexican can just do that all at home with the money they can make from drug cartel business. Like I said, it doesn't matter where you're from, there is bad in every nation and continent across the world. Even Antarctica. Some penguins are not nice birds.","commenter_a":"Personally, I've lived here my whole life in AZ. I've had more problems with the snow birds than the illegals. Last major bill before 1070 was bullshit. They wasted tax money trying to justify denying EMS to illegals when their own research showed a $240 million dollar surplus brought in by taxes and other monies by illegal immigrants in '06-- even after accounting for the expenditure of 'caring' for them. Here's a thought, how bought we reform and streamline the citizenship process so that people who want to be here and are willing to work here can actually do so and not wait 10 years to get citizenship.","post_message":"For Arizonans, immigration isn't just a campaign issue. Learn what's at stake for all of us at a non-partisan event, #OneNation: Immigration. Get your tickets now: @webpagelink"}]
