[{"comment_id":"10154522869261051","commenter_b":"The only thing Melania will do as first lady is give free head and hand jobs","commenter_a":"He can't handle being President is a joke just like his supporters he is being a reality show president","post_message":"This is not what Donald Trump wanted to hear today."},{"comment_id":"1331853210182520","commenter_b":"Yay fast food workers making more money then military let's go.","commenter_a":"I hope everyone that vote yes on this realizes that wage increase comes from somewhere and it isn't going to be from your employers share of the profits. So when you get laid off, loose your paid vacation or other benefits.... you only have yourself to blame.","post_message":"PROP 206 ON A MINIMUM WAGE INCREASE HAS PASSED!"},{"comment_id":"483898831770072","commenter_b":"@username Whoa, calm down woman.","commenter_a":"They could just import it from Iran. I wonder what's stopping that great deal?","post_message":"Italian caviar, that is."},{"comment_id":"10152908270740927","commenter_b":"Forced motherhood?! Are they frigging kidding me?! Nobody forced them to have sex unless they were raped. So stop with the ridiculous posters!","commenter_a":"Just who is forcing these women to get pregnant? No one is forcing \"Motherhood\". Try and show some responsibility if you are going to have sex.","post_message":"It's no surprise that Satanists support Planned Parenthood, but what is SURPRISING is how they showed that support ..."},{"comment_id":"1005120462832757","commenter_b":"and for that she deserves what amounts to life in prison?","commenter_a":"Ummm she took abortion pills and left her baby in a dumpster, then took herself to the hospital.","post_message":"\"What this prosecution makes clear is... abortion being recriminalized in America\""},{"comment_id":"10154730532542042","commenter_b":"yetanother photo u tag me in with the rachetness 😂😂😂 are we sure this one is also a she?","commenter_a":"@username wah do she eye 😂😂😂😂😂😂😑😑😑😑😑","post_message":"The New Jersey hairstylist said her client was unhappy with her services -- so she pepper sprayed the woman in the face."},{"comment_id":"890262117675915","commenter_b":"When ur young u can wear them, and let's face it, men are men. The girls should be proud they can wear them, and too bad dudes. Let's start a men's line LOL.","commenter_a":"Who is proposing the prevention of girls wearing shorts in Summer? I hadn't heard anything about that.","post_message":"There's no excuse."}]
