[{"comment_id":"10153717285696509","commenter_b":"Looking better then the women in his home","commenter_a":"Should be on the cover of freaks magazine","post_message":"Caitlyn Jenner is on the cover of Vanity Fair, in an image shot by famed photographer Annie Leibovitz: @webpagelink #CallMeCaitlyn"},{"comment_id":"10150977696104999","commenter_b":"No, the representation in the Senate is not of the people, but of the states. Each state has two Senators. That's equal representation. If you want representation of the people, you're looking in the wrong chamber.","commenter_a":"It is a very good thing that urban power centres cannot set the taxes of their rural neighbours. If they could the rural producers would become slaves and would have no quality of life in the pursuit of urban consumers actively destroying rural methods of negotiation. This is NOT a failing of the system, it is exactly why the system is in place. It is a good thing that farmers are not economic slaves of nearby cities.","post_message":"In the U.S. Senate, the least populous states are now more overrepresented than ever before."},{"comment_id":"1878063365760713","commenter_b":"All illegals have committed crimes, hence the term ILLEGAL!!!","commenter_a":"Trump is more concerned with illegals that have committed crimes and securing the borders if you think Trump is going to round up all the immigrants like cattle and send them packing then you haven't been paying attention to the news","post_message":"“There is a long tradition in American law enforcement of not breaking into churches in order to arrest someone unless the person is wanted for an act of violence,” Judge Andrew Napolitano said."},{"comment_id":"513245792199334","commenter_b":"ALL MUSLIM PIGS Get the HELL outa MY country!!!!!!","commenter_a":"Screw you, give her her job back, this is a disgrace to the AMERICAN people! Anyone can make a mistake!","post_message":"A lunch lady was fired for serving pork to a Muslim student. We are in America, give that poor lady her job back. Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"956693264446697","commenter_b":"If my 2 daughters were still in school now and this begins I would not send them to public school it would be private or at home its just not safe, I don't have a problem with transgender boys don't belong in giur!s bathrooms and visa versa","commenter_a":"Wow..that's a big problem..!..put a extra bathroom in for Transgender..simple..problem solved..","post_message":"President Obama recently said all public schools must allow transgender students to use the bathroom of their choice. Let us know your thoughts below:"},{"comment_id":"983699055080206","commenter_b":"Stay out of the bedroom of married women.","commenter_a":"Yes because of his sorry voice and music, put your money where your loud mouth is west, take on a navy seal and see what happens to your sorry arse. Then let them send you to pakistan and see what happens, I bet body bag for you","post_message":"DELUSIONAL! Kanye thinks he's tougher than an American soldier. 'LIKE' if you think Kanye West is just a completely idiotic LOSER. [Read below] @webpagelink"},{"comment_id":"10155525671531002","commenter_b":"@username It is my business when it is my tax dollars going to feed you .","commenter_a":"If you can eat it and drink it why is it anyone's business what you buy. I don't care and by the way, congress uses a food budget bigger than anyone that has food stamps can we say what they are allowed to use it for?","post_message":"A recent U.S. Department of Agriculture report on food stamps found soft drinks account for 5 percent of dollars spent on food."}]
