[{"comment_id":"10153407342318352","commenter_b":"I meant, Beast-like BITCH.","commenter_a":"Nothing these beasts say even shocks me anymore.","post_message":"'I just don't like the black kids': Middle school vice principal is suspended after being filmed making outrageous comment on camera"},{"comment_id":"10153029967097014","commenter_b":"She's a weirdo","commenter_a":"Amy Lunsford JUST DO IT","post_message":"At first glance, the text messages appear to show a disturbing case of cyberbullying: one teen urging another to kill himself. But this was no bully. They were from a 17-year-old girl to her boyfriend, whom she called the love of her life. \"You can't think about it. You just have to do it. You said you were gonna do it. Like I don't get why you aren't\""},{"comment_id":"1710140202573363","commenter_b":"I know it will be hard for Trump to send back all of the illegals, but he'll try his damdest. I hope he goes after the ones that are draining our system and leaves the ones that are hard working and honest people with good families not asking for handouts. Once we get rid of all the sponges in this country then we only have to deal with the riff raff , junkie americans that we already have to support!!","commenter_a":"Hallo everyone economy is getting worse because of Obama's and Bush's stupid policy so we need to make great world with Donald Trump.No to unlegal immigration no to Islam","post_message":"The economy is bad and getting worse-almost ZERO growth this quarter. Nobody can beat me on the economy (and jobs). MAKE AMERICA GREAT AGAIN"},{"comment_id":"10156192968210354","commenter_b":"This witch has lied, cheated and crooked everything she come in contact with in Washington.....she deserves to be in prison but not as long as the democrats up hold her, she will continue to get away with everything.","commenter_a":"Obombass will back Biden but only if obombass can vice president..... dictator","post_message":"***BREAKING*** \"...raises the possibility that the Democratic presidential candidate’s correspondence eventually could become public.\""},{"comment_id":"10154040024789160","commenter_b":"If you got a dick,,,, GO F- - K yourself","commenter_a":"Go sway","post_message":"It's Barack Obama's 55th birthday. What's your birthday message for him? (AP Photo)"},{"comment_id":"904173296345590","commenter_b":"For the amount it too severe a sentence","commenter_a":"YES!!!!!","post_message":"Weldon Angelos is serving a 55-year-term for the sale of about $1,000 of marijuana. By the time he's out, he'll be in his 70s."},{"comment_id":"10152848964136051","commenter_b":"Hang the little bastards.","commenter_a":"I know @username 😞","post_message":"First these teens attacked an 87-year-old woman. Then they raped her. And then they poured bleach down her throat."}]
