[{"comment_id":"10153615979136336","commenter_b":"The screams of protest would wake the dead if that happened.......even after the muslims get they demands met!!! This is a true blight on America!!!","commenter_a":"Should be open to all faiths. Can you imagine the liberal outrage if it was a Christian prayer room?","post_message":"\"How loud do you think the objections would be today if they spent $250,000 in taxpayer money to build a new prayer room exclusively for evangelical Christians?\" – Rev. Franklin Graham"},{"comment_id":"1008831639165859","commenter_b":"Evil, vile woman.","commenter_a":"POS!","post_message":"Never forget..."},{"comment_id":"784480358346621","commenter_b":"The whores knew what they went to Mr. Cosby room for money and sex. I say they didn't get pay they got laid .","commenter_a":"My lord there is a lot of racists here!","post_message":"We can only dream! Cheney masterminded a war based on lies to funnel $37 billion in no-bid contracts to his \"former\" defense contractor company, Halliburton. When will his time be up? Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1123835504398528","commenter_b":"Fuck that stupid ass","commenter_a":"You are a complete asshole if you think this is a political issue IS AN AMERICAN issue and every single one of us should have a problem with this!","post_message":"So if we want the truth, that makes us disloyal? Bullsh*t! --Andrew"},{"comment_id":"481914358685584","commenter_b":"That chick in the picture is going to fire up a joint , get high , go down and get her welfare check, then crash for a while, then get up and go to a anti-whatever rally and get arrested , then get out on an O/R and go cash her check and go get some more weed and start all over again. Thanks Gov. Brown for making California so great!","commenter_a":"Does that mean about 4 thousand attended?","post_message":"Attendees of the annual 4/20 pot celebration left behind almost 15,000 pounds of trash at the Golden Gate Park. PHOTOS/VIDEO:"},{"comment_id":"556934131139724","commenter_b":"So your telling me that New York wants refugees even after they experienced 911? I'm going to officially say they are retarded.","commenter_a":"It's not up to the states to determine it.... it just slows the process down, but they can ultimately come to wherever they want so long as the feds allow it...","post_message":"UPDATE: Four additional Governors have said that they are willing to allow Syrian refugees into their states: New York, Oregon, Utah, and Virginia. We simply do not have the ability to adequately vet more than 75,000 incoming refugees. I stand with the 31 Governors who are fighting to keep our nation safe. Contact your Governor today. CURRENTLY ACCEPTING: Colorado Governor John Hickenlooper Phone Number: (303) 866-2885 Facebook: @webpagelink/ Connecticut Governor Dannel Malloy Phone Number: (860) 566-4840 Facebook: @webpagelink/ Delaware Governor: Jack Markell Phone Number: (302) 744-4101 Facebook: @webpagelink Hawaii Governor: David Ige Phone Number: (808) 586-0034 Facebook: @webpagelink/ Pennsylvania Governor: Tom Wolf Phone Number: (717) 787-2500 Facebook: @webpagelink Vermont Governor: Peter Shumlin Phone Number: (802) 828-3333 Facebook: @webpagelink/ Washington Governor: Jay Inslee Phone Number: (360) 902-4111 Facebook: @webpagelink Oregon Governor: Kate Brown Phone Number: (503) 378-4582 Facebook: @webpagelink/ Utah Governor: Gary Herbert Phone Number: (801) 538-1000 Facebook: @webpagelink/ New York ..."},{"comment_id":"10153072331466051","commenter_b":"This woman is nuts and needs put away for a long time. How crewel!","commenter_a":"These people are so evil !!! what is this world coming to","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."}]
