[{"comment_id":"800358286665935","commenter_b":"Shutup you cornballs","commenter_a":"Fundamentalists linear thinking both secular and religious can't enter the narrative. A generation that cannot discern connotations and denotations. We are in an intellectual and spiritual decline. Stupid stupid mobs","post_message":"This thug should have just obeyed the damn law! Read why Jesus lived in a police state: @webpagelink Crimes he committed: illegal fishing, loitering and homelessness, feeding people without a permit, not caring about paying taxes, whipping corrupt bankers, inciting insurrection, claiming to be above the empire."},{"comment_id":"824287517608590","commenter_b":"Let's go get em Ron. Steve is on his way to pick you up with mike bike","commenter_a":"I knew it!","post_message":"Well..."},{"comment_id":"1158459407522812","commenter_b":"Liberal ay, so telling you that Trump broke the pledge first, makes him a liberal.","commenter_a":"Why don't you Trump people shut the hell up about Cruz, and focus on Killary for a change?","post_message":"I agree with Phil Robertson \"The Duck Commander\"!"},{"comment_id":"10153563956586519","commenter_b":"Hello??? It is time for you poor ladies to start being your own role model. Stop whining.","commenter_a":"Sooooooo, losing weight is selling out now? You damned if you do, damned if you don't.","post_message":"\"I’m left longing for stories about fat women that don’t tumble off the wrong side of that thin tightrope between laughing with and laughing at...\""},{"comment_id":"10153837082186130","commenter_b":"Just like a woman - fickle and gossipy.","commenter_a":"I'd like to see a woman president too. The right woman president. Someone so awesome she makes everyone wonder why we waited so long for that woman. I don't think we've found that woman yet.","post_message":"It's not neccessarily an endorsement for Hillary Clinton, but..."},{"comment_id":"10153635902876130","commenter_b":"Lol. Why do they even give them their name in print. If we ignore them they will hopefully go away...🙄","commenter_a":"Geesh, what an unimpressive list. Was this even worth an article?","post_message":"They all think Donald J. Trump is \"that guy\" for America."},{"comment_id":"847481612018670","commenter_b":"Kick them out of the country,they do not deserve to live here! DEPORT!","commenter_a":"Deport them to Iran.","post_message":"OUTRAGEOUS: Little Muslim Rats At Public School Walk Out When NATIONAL ANTHEM Plays Do you agree they should be deported?! Share this EVERYWHERE if you do! @webpagelink"}]
