[{"comment_id":"10153706992631955","commenter_b":"Let's bpmb those fagots.","commenter_a":"The machine that makes invincible passports! We must take it for the empire!","post_message":"ISIS May Have Passport Printing Machine..."},{"comment_id":"842641039186009","commenter_b":"Do that to me, and I would turn you into a girl!","commenter_a":"What a bunch of cowards that's what we need not","post_message":"Here's the 'poor refugees' just looking for a 'better life' as they piss on women. Check this out... @webpagelink"},{"comment_id":"10152655147557267","commenter_b":"Plain english","commenter_a":"No bill should be over ten pages long, nothing else added and in plain English a fifth grader could read","post_message":"I voted ‘no’ on final passage of H.R. 240, the Department of Homeland Security Appropriations Act of 2015, which was ultimately stripped of provisions to stop the President’s executive action on immigration. Read my full statement here: @webpagelink #idpol"},{"comment_id":"1079856352035375","commenter_b":"Wow","commenter_a":"White and gold","post_message":"o.O"},{"comment_id":"1152030998150262","commenter_b":"You wouldn't believe it even if it was released. You'd say it was staged. Let the girl rip.","commenter_a":"How about releasing ALL the footage of her before , DURING , and AFTER her untimely murder!!! Its easy to let America view when she was alive. BS!!","post_message":"\"This video should demonstrate that people who are out there going through a lot of trouble to spread lies and mis-truths on Waller County — we are not going to stand idly by and allow that to happen.\""},{"comment_id":"481872515336662","commenter_b":"She's doing a great job! Leave her alone! You look half as good as she does, you wouldn't have a problem!","commenter_a":"She is great and a real threat to the liberals and they will go after her.","post_message":"Liberals are after Megyn Kelly after she falls victim to wardrobe malfunction. She is in trouble, we need to show her we have her back. Can we get 20,000 'LIKES' for Megyn Kelly?"},{"comment_id":"10154406577771051","commenter_b":"Ray >Melania isn't even from the US can't speak English an is a HOE!!!!!","commenter_a":"There is nothing wrong with her dress.","post_message":"This photo of Melania Trump sparked serious backlash after people noticed one thing about her dress."}]
