[{"comment_id":"10154385658569197","commenter_b":"@username good one","commenter_a":"They should cancel all outdoor activities in sports .. Those poor kids too hot for them","post_message":"It's 9am and the heat index is already at nearly 100! What are you doing to stay cool today?"},{"comment_id":"904059146360453","commenter_b":"She is earning her check! hahahahha WTF! I just can't with this crazy woman!","commenter_a":"Maybe she's trying to help Hilary??","post_message":"Donald J. Trump campaign manager Kellyanne Conway said she wished her candidate had more opportunities to debate and would \"be willing to do another one if somehow they can squeeze it in.\""},{"comment_id":"10153342829529170","commenter_b":"Then STOP Them, enough already!!!","commenter_a":"homegrown terrorist and a president that wants Americans Disarmed.......YEA, THAT'LL WORK!","post_message":"If you're a liberal claiming ISIS doesn't exist inside the US, Barack Obama's own FBI Director has a message for you...."},{"comment_id":"600515870151925","commenter_b":"I'd say the dog has reached that point because it is being handled incorrectly. I'd put a spot light on the Obamas for not treating the dog properly and training their girls on how to treat the dog. Dogs don't lash out just like that. It would have to have been constantly mishandled. Like that stupid heavy jewellery around the neck for instance.","commenter_a":"I don't think they need to sue, if he takes financial responsibility for the cost of the injuries.","post_message":"Should they soak the Obamas for big bucks? (Or at least some sort of political favor?) Wealth being spread around. That the Obama way, isn it?"},{"comment_id":"1738314809766910","commenter_b":"She should have moved here...we don't know who she is","commenter_a":"no matter what happened, she is the one who took the decision (??!) to take her own life. Unfortunately, she seemed a desperate and lost soul...","post_message":"Screenshots and soundbites from the video were mocked by Italian social media users and YouTubers."},{"comment_id":"1326473630726439","commenter_b":"To be successful in today's Republican Party you have to push a potent mix of craziness and meanness.","commenter_a":"The rise of the evangelical politician. The moderate and liberal republicans moved to the Democratic party and the conservative Christian moved to the Republican party. This was all in the 50's-70's there was a great migration because the majority of the Republicans didnt like the move in the direction to conservative ideals so they moved to the Democratic side. So your Democrat is actually your Republicans pre evangelical","post_message":""},{"comment_id":"677448822404448","commenter_b":"These women are idiots!!!!!!!!!!","commenter_a":"OMG!!!","post_message":"\"We finally have this god that's going to come down and help us all.\" Here's what two \"Trumpettes\" think about Donald J. Trump's Twitter rant against former Miss Universe Alicia Machado. Watch more: @webpagelink"}]
