[{"comment_id":"10152767669722217","commenter_b":"100' wall? It will keep out all the green eyed monsters!","commenter_a":"After the last couple of days, I feel it's time to throw my hat into the political ring. I'm forming a new party. The Free England From London Party. We have one proposal. To turn the M25 into a hundred foot wall and fill it with concrete. I'm not sure how we're gonna pay for it, so we're the same as all the other parties, however, I reckon a few Poles and Kurds will do it quite cheap and we could recycle bits of London to make the wall. Who's with me?","post_message":"Spotted any quirky campaign #GE2015 pics? Share yours in the comment section below or via haveyoursay@bbc.co.uk"},{"comment_id":"1066274426802142","commenter_b":"I have $10 that says that first woman in that video doesn't know how to spell diligence.","commenter_a":"Just a bunch of ignorant fear mongers, there is much more violence fine by people that sound and look just like them than any Muslims within the states.","post_message":"Did Donald Trump alienate his supporters by calling for a ban on Muslims entering the United States? NBC News asked attendees of Trump's rally in South Carolina what they thought. Watch more: @webpagelink"},{"comment_id":"10153668516697235","commenter_b":"She said my country...woman your kind is European.","commenter_a":"Have you noticed that that Trump supporters always have that crazed. I just crapped myself look in their eyes.","post_message":"This is NUTS!"},{"comment_id":"10155445943810725","commenter_b":"Sadly though it still happened :(","commenter_a":"Everyone who leaves their child with anyone should have a nanny cam.","post_message":"Nanny cam video reveals horrific new details on how a babysitter tortured a 3-year-old girl (Warning: Disturbing content)-----> @webpagelink"},{"comment_id":"10153420150224087","commenter_b":"jeanne ruzzin: Ivana is a big woman and anyone who tried to push her around would surely regret it.","commenter_a":"Donald Trump, serial adulterer. Brutally assaulted Ivana and paid her off. Talks constantly about wanting to bang his daughter. Meanwhile, Hillary has been a faithful spouse, who had every right to choose whatever she wanted in the wake of her husband's cheating. Figures The Donald would stoop to #VictimBlaming.","post_message":"“If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women’s card on me, she’s wrong!” Donald J. Trump tweeted."},{"comment_id":"10154242655245470","commenter_b":"@username bush got much much more killed. Both are evil.","commenter_a":"Wasn't there a war going on? You all are concerned about her supposedly lying and 4 military personnel died? Any concern about weapons of mass destruction lie GW Bush told and has been responsible for 7000 deaths?","post_message":"The suit claims the victims' deaths \"were directly and proximately caused by the negligent and reckless actions of Defendant Clinton.\""},{"comment_id":"1159085570778138","commenter_b":"No the Great Wall did not work. Mongols had no problem getting over it.","commenter_a":"Nothing But Crap. Christie came out strong when he was elected Governor but it's been all down hill since. Why talk about Brady, not even his State. As for the wall, it worked for thousands of years for China. Plus it's a hell of a lot cheaper than what it is costing us in welfare, medical, food stamps, crime, law enforcement, prisons..... Put the people collecting welfare to work, take the young men like the CCC and WPA days. Bring our military home and build the wall.","post_message":"“Please, please, please do not fall for the idea that we are going to build a wall along the entire 2,000-mile border of the United States and Mexico ... It’s not feasible. It’s not practical. It’s too expensive. And by the way, I’ve never seen a fence or a wall that if a human being wanted to get over or around it that they couldn’t.”"}]
