[{"comment_id":"771242182992562","commenter_b":"A couple of missals would take care of this problem.","commenter_a":"Hey where are the nasty sharks when you need them?","post_message":"Let's get rid of these scum bags already! @webpagelink"},{"comment_id":"10153854800096955","commenter_b":"@username loooooooool u stupid Americans are cute. Have fun finding water in 5 years 😜","commenter_a":"You should have to have a comprehensive background check before anyone can just buy a knife and close the knife show loop hole . Problem solved !","post_message":"NYC Residents On Edge After 3 Slashing Attacks In Less Than 48 Hours..."},{"comment_id":"154804301701173","commenter_b":"Here we go again with the silly questions by the press , get the popcorn out","commenter_a":"We don't like racists","post_message":"LIVE: White House Press Secretary Sean Spicer's daily briefing. Topics include the economy, domestic policy agenda, transgender bathroom policy, state's rights and the Supreme Court."},{"comment_id":"10153845002233984","commenter_b":"They can both suck deez nuts lol.","commenter_a":"Jeb may not have expected the question, but he handled it well. The conditions underlying the two events were not comparable. Megyn's comparison was a stretch.","post_message":"Megyn Kelly just took Jeb's criticism of Hillary and threw it right back at him with one question he did not see coming... Do you think Megyn was wrong for using this analogy or was it a fair question?"},{"comment_id":"1601468970152449","commenter_b":"Victoria SD you stupid bitch","commenter_a":"If only Khan talked about Islamic terrorist attacks as much as he talks about DJT - using his son's death to score points for a flawed ideology! Damage control!","post_message":"Khizr Khan, the father of a slain Muslim soldier, says Donald Trump is \"incapable of empathy.\""},{"comment_id":"10153054434811051","commenter_b":"So sorry he killed himself. The creeps that haunted him should all be rounded up and put in jail.","commenter_a":"Well I hope those bullies are proud of themselves. ...they know who they are and they all have blood on their hands. KIDS.... BE CAREFUL WHO YOU BULLY....THAT PERSON MAY BE YOUR BOSS SOMEDAY! In school everything that happens seems like its life altering end of the world BS. Guess what....it's just high school....life goes on....nothing is worse than suicide. ...sometimes the worst thing that happens turns out to be the best thing.","post_message":"This boy loved hunting and trapping, and other students made fun of him all the time for it. He just couldn't fit in with them. Eventually it became too much."},{"comment_id":"1003938939663251","commenter_b":"we didnt send anyone, go kill yor bankers they fuck up your country, wait they already fucked up i guess","commenter_a":"Next wedding come over to Greece you son of bitches to feed all the illegal migrants that you send us!!!!!!!","post_message":"This is such a great story!"}]
