[{"comment_id":"10151088515799999","commenter_b":"Such a misogynist!","commenter_a":"I was at Smith College when Maher came and spoke in the late 90s. His contempt for women was palpable. Not a surprise that he feels avuncular towards Milo. Once you accept it is okay to dehumanized one group, it is just a hop skip and jump away from demumanizing anyone.","post_message":"Bill Maher's interview with Milo Yiannopoulos was a mostly chummy affair. Then in a segment that ran after the broadcast, Yiannopoulos attacked transgender people."},{"comment_id":"1227346460655830","commenter_b":"This bitch is an idiot.. lol","commenter_a":"Really? Trump wants to end Social Security, Medicare, Medicaid, Food Stamps, and Obamacare! Voting Democrat is the only way to stay alive!","post_message":""},{"comment_id":"812675022209688","commenter_b":"@username, she should have been in jail a long time ago!!","commenter_a":"We need Trump 100%. Clinton is going to do nothing new for the @username people","post_message":"She disagreed with Donald Trump's proposal."},{"comment_id":"10153993699771756","commenter_b":"@username And you do realize the husband who was carried out the attacks was an American citizen, not refugees. In fact no refugees have ever carried out attacks. But by all means you go ahead and keep screaming about refugees, the terrorist just love you doing exactly as they wish.","commenter_a":"So Texas went from an idiot governor, to a mostly corrupt governor, to an insane one?","post_message":"Texas and the federal government have taken their power struggle over Syrian refugees to federal court."},{"comment_id":"1109626375800280","commenter_b":"Yup! They are afraid of her!","commenter_a":"Hillary is a joke","post_message":"\"They are afraid of me!\" - Hillary Clinton"},{"comment_id":"1142904239055165","commenter_b":"Cruz wants to stop illegal immigration. He or Trump will basically rescind all this lawless president's entire presidency in the first month.","commenter_a":"Don't bet on it. Remember, Cruz though he has his good points, he still \"wears the Republican & Special Interests chain\" he forged by accepting campaign contributions. Also, remember fort 7 long, long, long years...he didn't constatnly call for John Boehner (sober?) to call for The House Sergeant-at-Arms to arrest \"Barry O from Honolulu\" for multiple counts of High Treason, violation of The Presidential Oath of Office, failing to defend The Constitution, and counts of U.S. Treasuyr Embezzlement of Funds to illegally fund bogas business startups that failed, disappeared, and the money disappeared as well.","post_message":""},{"comment_id":"517159568465923","commenter_b":"Actually Humphrey already had it wrapped up","commenter_a":"One of the saddest days in our nation's history. I have no doubt he would've won the nomination and the election. I was only 12, but remember it like it was yesterday.","post_message":"RFK's loss still being felt."}]
