[{"comment_id":"10155192232363984","commenter_b":"Amen. These Thugs are going Down.","commenter_a":"Thank you Mr. President Donald Trump. I hand it to you for everything your doing for this country and everything your about to do. It's about time we got a president who's looking after his own country first. GOD BLESS you President Trump. Trump train full speed ahead.","post_message":"That didn't take long. This says everything about Donald Trump's presidency..."},{"comment_id":"1017113771678485","commenter_b":"@username no dont get mad because Hillary is a corporate puppet slave and black people dont like her!!!","commenter_a":"Sorry black folks don't like Hillary","post_message":"Speeches, selfies and heart-to-hearts: A look inside Hillary's recent events in African American communities."},{"comment_id":"10152602794417894","commenter_b":"smh bitch can do better","commenter_a":"I am totally okay with this. David Ramos @username","post_message":"Coupled Up? Rihanna Reportedly Spotted Making Out with Leonardo DiCaprio at the Playboy Mansion"},{"comment_id":"1184256164945951","commenter_b":"Feminists are the worst lays!!!","commenter_a":"You are lame and you shouting that you're a lesbian is boring. Try something beneficial? Go suck a big one.","post_message":"You can't make this stuff up, folks!"},{"comment_id":"10152909977971051","commenter_b":"I agree kaelyn! Things like this should be an eye for an eye with this sick twisted woman!!","commenter_a":"I think 9 yrs is not enough but she should get the same treatment she gave her son. Pour boiling water on her starve her. And trekking police she was a troubled child cuz of her crack head mother is a tactic to get out of more jail time!!! Pour baby I feel for the kids","post_message":"This woman was embarrassed by her 9-year-old son’s disability – so she decided to torture him."},{"comment_id":"684314941708338","commenter_b":"You pussy","commenter_a":"A vote for Trump is a blatant vote for racism. I'm so embarrassed at the people who support such hatred.","post_message":"Skywriters' message for Donald J. Trump: \"America is great. Trump is disgusting,\""},{"comment_id":"10153344147357439","commenter_b":"Lol is that where Muslims come from? Wow didn't know that!","commenter_a":"Send them back to Egypt.","post_message":"DC Area Professor To Catholic University: Too Many Crosses On Campus For Muslim Students To Pray @webpagelink Anywhere American law and Islamic law conflict, it's American law the inevitably has to give way. These demands for special accommodation are everywhere. Hertz, Heinz, Costco, IKEA, Target, Wal-mart, Disneyland, McDonalds and hundreds of others have all been in the cross-hairs. Islamic demands and the ensuing lawsuits in order to impose sharia...."}]
