[{"comment_id":"893880777331086","commenter_b":"\"I kill ithith and bite their ears off\"","commenter_a":"I hope when he talks he doesn't sound like Mike Tyson or something. That would be a let down. LOL","post_message":"Yeah. That dude is pretty intimidating. ANGEL OF DEATH: Axe Wielding Militia Commander is Striking Fear Into ISIS Fighters"},{"comment_id":"10154561841344203","commenter_b":"What a dumb bitch.","commenter_a":"😷","post_message":" worship for him is like the people of North Korea worship their Dear Leaderblind loyalty.\" Ann Coulter"},{"comment_id":"1023160814385680","commenter_b":"Pussy bitch","commenter_a":"Fuck that! If that fuckin dog was comin at me is shoot the cunt too! No questions asked! Why risk your life for someone's untrained mutt!!","post_message":"The difference between firefighters and cops. Coward → @webpagelink Filming Cops (Y) via Cop Logic (Y)"},{"comment_id":"10153066062681770","commenter_b":"She will say anything to get people to vote for her!","commenter_a":"I wouldn't back her as dog catcher, the dogs never did anything to me, I like dogs. Can't stand Hitley.","post_message":"Hillary Clinton claims the National Rifle Association takes an “absolutist” stance on gun rights, comparing it to “the Iranians and Communists.”"},{"comment_id":"1768726713375361","commenter_b":"I agree tone down a little and let her hang herself.!!!!!","commenter_a":"I think Trump would be the best of the 2 evils, but with all his smart remarks it looks like he is trying to help Hillary. He needs to tone down and run on his own platform and let her hang herself.","post_message":"YES!!"},{"comment_id":"10154212889868822","commenter_b":"2 fecking idiots!!! That is all I have to say!","commenter_a":"Just look how dangerous Pittsburgh has become in itself!! There are murders every single day and crime is most def on the rise!! Jobs are scarce unless you want to work part time in fast food or at a gas station","post_message":"Boston Mayor Marty Walsh joined Pittsburgh Mayor Bill Peduto for breakfast before hitting the campaign trail to drum up support for Hillary Clinton ."},{"comment_id":"1415440468755532","commenter_b":"Embarrassing shows some English women are ,more than stupid!!! What a PRATshe is , excuse the pun!!!","commenter_a":"These stories are not the norm. As a Brit I have been shocked & saddened at the attitude of the Brits post Brexit. If you are foolish enough to believe that the newspapers print stories that represent the situation of most refugees then you really are foolish. Yes stories like this happen, they always have. But for many this is not their situation.","post_message":"‘He is doing this to take citizenship'"}]
