[{"comment_id":"10153402936366636","commenter_b":"It's funny lads, the women is clearly having a bit of fun. You all must be really fun at parties.","commenter_a":"Dad could be doing house duties as well. We can not say he does nothing at this house by watching a Video. I think the purpose of this is to show how this super-mom is capable of dealing with the 4 kids, multi-tasking, having patience, having the gentle touch, etc..","post_message":"We can't stop watching this video of a mum getting her four kids ready in record time"},{"comment_id":"10153108575014726","commenter_b":"Obama working to hamstring America from fighting the Jihad @webpagelink","commenter_a":"obama is an appeaser and weakling","post_message":"WATCH: The Netanyahu speech that is throwing Obama off his game!"},{"comment_id":"1210524342343014","commenter_b":"Maybe she's drunk or high. Don't even look good","commenter_a":"Notice how fb took off the video? CNN reporter admitted Obama paying off the media to only cover bits and pieces of Trump speeches, to keep the media from exposing Hillary's corruption","post_message":"What is wrong with Hillary? She just completely froze AGAIN...her handler had to rush the stage, comfort her, and tell her what to say! WATCH..."},{"comment_id":"10154479545156320","commenter_b":"Because of a speech. Sheeeesh","commenter_a":"What an amazing speech by everyone last night at the convention.I really think Hilary Clinton will be the President of the United States of America.","post_message":"12 years after rising to national prominence at the 2004 DNC, President Barack Obama took to the convention stage to try to bolster Hillary Clinton's candidacy to succeed him. #DemsinPhilly"},{"comment_id":"10154124888373812","commenter_b":"The jobs that illegal immigrents work in this country are jobs that, #1 citizens of this country are unwilling to work and #2 jobs that employers are not willing to pay a fair wage for. That's where this country needs to start. We can build a wall that anyone who wants to cross will and does.","commenter_a":"13 million might get you just under a mile of fence.....and I'm not talking chain link. Trump would be first in line to throw in his overpriced bid.","post_message":"President Bill Clinton tells Donald J. Trump supporter “If you want to build a wall along the Rio Grande and spend $13 million, then you should follow him like Moses into the Promised Land.”"},{"comment_id":"10153881139329456","commenter_b":"Not Thugs , WORTHLESS TRASH!!!!! \\b","commenter_a":"Look all you people who argue what a thug is. Those two are thugs.","post_message":"Missouri police say the 2-year-old was left alone in his crib for 38 hours and reportedly died from hyperthermia."},{"comment_id":"10153206045164087","commenter_b":"@username I was just about to say the same thing. How can women support that misogynistic pig? It's baffling.","commenter_a":"America will get more of the same if Carson is elected President! America needs someone like Donald Trump to run this country like a business and bring back jobs, repay our massive debts, negotiate better trade deals, revamp or do away with Obamacare. With all do respect to Dr. Carson, he's not the man for this job. He'll get caught up in the Washington gridlock and America will get more of the same!!!","post_message":"Retired neurosurgeon Dr. Ben Carson has surged by double-digits to within striking distance of GOP front-runner Donald Trump according to the latest New York Times/CBS News poll."}]
