[{"comment_id":"10153252345186990","commenter_b":"Roger Morris it is Justin Bieber!","commenter_a":"Lisset Medina","post_message":"#SB50 SIGHTING: Justin Bieber spotted taking pictures with fans in San Francisco. @webpagelink Have you spotted any Super Bowl celebs yet? Tell us below! [Via @JBCrewdotcom]"},{"comment_id":"10152639623811680","commenter_b":"Illegals do vote. @webpagelink","commenter_a":"Not against legal citizens from voting. It is fraud and illegals voting. You took an oath. You should be against it also.","post_message":"Sen. Bernie Sanders: “An absolute disgrace for Republicans in the year 2015 to work overtime to deny people the basic right to vote.”"},{"comment_id":"1735755160025201","commenter_b":"Hopefully I can get there before someone builds a wall around our entire country!","commenter_a":"I feel so sorry for you Americans!! Come in up to Canada we can have a beer and chat about your presidential candidates lol","post_message":"Donald J. Trump accuses President Obama of being 'the founder of ISIS'... then calls Hillary Clinton the 'co-founder.' @webpagelink"},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":" Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."},{"comment_id":"10153932713210950","commenter_b":"@username that's my point. If she wanted to look like a pig she should have stayed on the farm lol","commenter_a":"It wasn't a few pounds, she got fat!! It was her job to maintain an appearance and she failed. If she didn't want to be judged for her appearance then don't enter a beauty pageant. Smh","post_message":"This former Miss Universe says Donald J. Trump's comments about her brought up bad memories from 20 years ago when she gained a few pounds after winning his beauty pageant."},{"comment_id":"951284658242208","commenter_b":"She dished it out now she should be ready to take some of her own medicine, she purposely attacked Trump and and don't blame trump for no taking crap from her at all. None of what she did was professional.","commenter_a":"Megan Kelly was quite obviously biased against Trump. She was a horrible moderator as well...just horrible. I thought she ruined the entire debate. It was not really a debate at all any way. What a joke.","post_message":"Donald J. Trump declares war on Megyn Kelly after #GOPDebate."},{"comment_id":"10153809111181336","commenter_b":"You will feel it when your movies plays to less than half the audience shows up..","commenter_a":"IDIOT","post_message":"Quentin Tarantino has finally responded to the firestorm that’s been brewing since he criticized police officers at a rally last weekend, and he says he won't be \"intimidated.”"}]
