[{"comment_id":"10156653866510725","commenter_b":"Has anyone seen the documentary \"Cartel Land\" available on Netflix? Serious people we need an individual to build that wall. The Mexican/So.American border needs to be secure. We need Trump!!!","commenter_a":"#makeamericagreatagain","post_message":"GOOD MORNING! Put me to work for America- and I assure you that WE will MAKE AMERICA SAFE & GREAT AGAIN!"},{"comment_id":"10156317776015354","commenter_b":"Stupid ass!!!!","commenter_a":"Sounds like a plan to me.","post_message":"“No surprise that someone who makes a living glorifying crime and violence is a cop-hater, too.” MORE..."},{"comment_id":"918539948208123","commenter_b":"I say we hand this trifling hoe to ISIS","commenter_a":"Another oxygen water","post_message":"DISRESPECT for our military and nations heroes is out of control. This is straight up disgraceful! READ HERE---> @webpagelink/ HONOR CHRIS KYLE!"},{"comment_id":"10156932201230389","commenter_b":"Good answer. She is a sellout.","commenter_a":"NOT EVEN HONEST TO THE PEOPLE THAT PAY HER?","post_message":"David Webb: “Do you think Hillary Clinton’s honest?” Answer: “I think she’s honest to the people who pay her.” MORE: @webpagelink"},{"comment_id":"10153930605634614","commenter_b":"Women.., please don't fight strangers...,they're not your husbands..,to be arguing all day...","commenter_a":"Only 13 years for her life. Really for someone killing a mother directly in front of her children what really he should of got life for each child plus mom no way appalled.","post_message":"Elizabeth Yanez was stabbed to death in front of her two children in a dispute over a parking space at the Santa Fe Springs swap meet. Her convicted killer, 23-year-old Reggie Cervantes, was sentenced to 13 years in state prison Tuesday for the 2014 attack. doesn make sense to me, nothing makes sense, the woman daughter said after witnessing the brutal attack. a parking space. How am I supposed to go on with my life? Read KTLA's story here: @webpagelink"},{"comment_id":"519010834890623","commenter_b":"This article was July 2013","commenter_a":"That's story has been out for years - when is he actually gonna do it?","post_message":"Actor Johnny Depp wants to purchase the historical landmark Wounded Knee and gift it back to the Native American people."},{"comment_id":"875277045852257","commenter_b":"You are a woman your body is naturally designed to bear children. It is worse when you make the choice to get pregnant.","commenter_a":"Most pro-aborts know there is an actual baby being killed. 99 percent of them have never had an abortion, yet have no problem telling others it's perfectly okay to have one. Pro-aborts are sick people.","post_message":"When was the last time you saw a baby announcement like this?"}]
