[{"comment_id":"1260055474038645","commenter_b":"Wonder who will pay her and the teachers salaries, and provide security and law enforcement if all the \"white people\" leave","commenter_a":"Have you seen it ? They can have it.","post_message":"Chicago Teachers Union Karen Lewis This City belongs” To Black People And Not White People."},{"comment_id":"10153336853341518","commenter_b":"Remember these two Stones Tablets were made to represent apart from commandments written on them. The first Stone Tablet represented the sin bearin Messiah who was to be born in the Holy Land in Canaan and the second Stone Tablet was to represent Messiah the KING who who was to be born in the Holy Land hidden in Africa. These Stone Tablets are buried in different places in Africa and they are Two Shrines of my God.","commenter_a":"Who cares? This is the problem with Judaism today; the discussion is over minutiae and not substance. People are ignorant regarding the mitzvot and the Chief Rabbinate is concerning themselves with this?","post_message":"The Israeli Chief Rabbinate has cut the arches off the 10 Commandments. (We want your comments, but please first read the actual and complete article and not just the Facebook excerpt. See link below...) ------------ Shalom Bear has published \"Squaring the Circle\" on JewishPress.com. @webpagelink"},{"comment_id":"1012583592144355","commenter_b":"and if we stay in toltel control","commenter_a":"More false propagander to try to get us to vote to stay in. The damage has already been done the EU Commission is an unelected, self sustaining, beaurocratic, and vastly overexpensive power crazed clique that will not change its self no matter what this person says. The only way to free ourselves of this shower is to vote to leave!","post_message":"Has the EU meddled too much in the daily lives of its citizens? @webpagelink"},{"comment_id":"494885290693351","commenter_b":"Say what you will, but she has the right to stick with her belief.","commenter_a":"For one, she's not crazy, for two, Congress has to pass the laws,and no law was passed for her to grant marriage licenses to gays. Gods law, IS LAW","post_message":"One side has got to give in. Right?"},{"comment_id":"1242854355764972","commenter_b":"WHO THE F^CK ARE YOU ANYWAYS GO LEAVE NOW MAKE AMERICA GREAT BY ALL YOU BUTT F^CKING TRAITORS LEAVE","commenter_a":"good by trash","post_message":"Looks like we're going to need a second Trump Train...one that takes all these people south of the border..."},{"comment_id":"459815194143521","commenter_b":"I personally just don't give a shit. They can walk around naked as a jay bird for all I care. But I'll bet other women would be the ones that bitch the loudest.","commenter_a":"this means that we can have video games and movies with naked women in them ??","post_message":"Female nipples are causing an internet storm & here's why: #FreeTheNipple"},{"comment_id":"10154458181463128","commenter_b":"Everyone is scared in America because there are so many guns. We need commonsense gun control ASAP. We need to vote out all politicians that oppose commonsense gun reform and get this issue addressed","commenter_a":"The cop is clearly nervous as hell. His voice is cracking and his gun is shaking terribly. To me, this is proof cops just aren't trained enough to identify true threats and staying calm under extreme pressures. He shot this guy in fear. Period. He should be charged for murder. I am absolutely terrified of cops and it shouldn't be that way.","post_message":"\"Police just shot my boyfriend for no apparent reason\": A police officer fatally shot a man in a car with a woman and a child, an official said. Authorities are looking into reports that the aftermath was live-streamed on Facebook."}]
