[{"comment_id":"1159186317427836","commenter_b":"Yep I pay almost $400 a month and have a $3800 deductible and so far haven't had anything covered except well visit:( my parents pay thousands for coverage now. The money has to come from somewhere.","commenter_a":"How can this be wrong? Why are so many Americans so disdainful toward ObamaCare? I don't get it?","post_message":"“It wasn’t about Democrats or Republicans, it was about our values as Americans...” A touching reminder from one American to another. (via NowThis)"},{"comment_id":"418116258312969","commenter_b":"Heaven help us if voter fraud (no picture ID) elects this incompetent lady","commenter_a":"Zero chance","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"10153559970697093","commenter_b":"@username you shut up.","commenter_a":"See how good it feels to see good black hard working men...and the children have no hate for them big black men see hatred is taught we are not born with it. Love this interaction this should be a wake up call to any one steriotyping.","post_message":"Apparently they get this excited every pickup day... they're now good friend with the garbage men... @webpagelink"},{"comment_id":"10154455210992577","commenter_b":"Mite as well. Hillary going to rig it so why not lol","commenter_a":"If the biggest criminal in the world doesn't want all that competition from Hillary who can blame him?","post_message":""},{"comment_id":"10154503562599138","commenter_b":"Dawn breaking over Lake Pepin Lake City, MN 6/9/16","commenter_a":"Watching the sunrise everyday on my way to work","post_message":"It's a call for pictures showing what you love about Minnesota. Show us animals, people and moments that show off what's so great about our state and we'll feature some on the Fox 9 morning news!"},{"comment_id":"912381755524744","commenter_b":"Cruz no need for explanation,ur vote wud be insignificant bc she is still the AG.Drop dead!","commenter_a":"We don't want Ted Cruz","post_message":"Ted Cruz was the only senator to miss the vote."},{"comment_id":"1695404184069071","commenter_b":"She's just a fat old cow","commenter_a":"Getting offended over what a woman with no pants on has to say at a game where men are paid millions to crush each other for a ball....Just wow.","post_message":"Some people didn't notice what was happening during Beyonce's performance last night... but these sheriffs did, and they were appalled. Did you notice what Beyonce did?"}]
