[{"comment_id":"10153349233138855","commenter_b":"When are they just going to go in with hand cuffs and arrest this ##%!% non law abiding public servant? Enough already! Find a new freaking job in the private sector. Chick Fil A, Hobby Lobby, would embrace her tenacity...","commenter_a":"SHe works for the government FIRED her. If she were in the service and disobeyed an order she would be court martialed. FIRED HER NOW!","post_message":"But, she's the one being persecuted. Right?"},{"comment_id":"1252850228086868","commenter_b":"Hang the bitch","commenter_a":"You all just racist that's why you all up all in trumps ass with his bull so take you all racist ass and do what you do best talk mess about real ppl. Trump going to blow your mind when he turns on you and do what's right","post_message":"Hillary Clinton is desperate these days and has even officially taken to getting down on her knees to beg the American people after Congress announced their next big plans for the corrupt Clinton – and the brutal nature of them has got to have Hillary downright horrified. @webpagelink"},{"comment_id":"1231187963602033","commenter_b":"Hell yed","commenter_a":"I was told that these people that get these free cell phones, they get not 1 cell phone but 4 phones each. I asked how can that be? He told me that they have all these different programs and they apply for them all. It's insane. I say stop the cell phones!!!!!! Cannot wait. Such waste of our, the taxpayers money.","post_message":"Boom! PLEASE LIKE and SHARE The President Donald J. Trump page for all the latest Trump related news! 100percentfedup.com"},{"comment_id":"949558251844940","commenter_b":"All them women on the house wives shows","commenter_a":"@username Giselle Relleta","post_message":"Are you wearing dead animals on your EYELASHES?"},{"comment_id":"10152788140495950","commenter_b":"She did the right thing. Can't imagine how disappointed in her son she must have felt at that moment.","commenter_a":"I am so on board with what this mother did. She cared!","post_message":""},{"comment_id":"10154170781271491","commenter_b":"Oh I bet \"she\" can run alright .. run out of the white house next year take her kids and Obama with \"her\"","commenter_a":"What a beautiful,sane & facts ridden reply !","post_message":"Just because one Obama is preparing to vacate the Oval Office that doesn’t mean everyone in his family has to follow suit."},{"comment_id":"975573942535660","commenter_b":"I'm not American but,I live here and I love to live here!And Hope to be in army or something one day I think dems are so much smarter! Let's go dems!","commenter_a":"brain dead","post_message":"RIGHT ON! Bernie just hit it out of the park at the Democratic debate when asked if he's a capitalist."}]
