[{"comment_id":"10152783958260667","commenter_b":"You need to wake up lady !","commenter_a":"They are not public property. They are her private emails. You are all so crazy about your rights but not anyone else's. They were on a private server that had more security than her work emails. You need to take a cold shower.","post_message":"Looks like those who want a look at Hillary Clinton's emails have a long wait ahead of them."},{"comment_id":"621306871404081","commenter_b":"TruDat","commenter_a":"I do not like Chris Cuomo I quit watching CNN and ABC because of garbage just like this we need to vote them out with not giving them a minute of our time. All Chris is concerned with is his desperate search to find something to attack any republican for but especially our our President Elect if you don't agree with his liberal view he will try to destroy and humiliate you Kellyanne has class and courage to face such an excuse for a reporter if I was her he wouldn't get five seconds of my time.i don't understand what makes him think that is just his President because as my President I feel he has a right to tweet about his opinions and I like seeing what his opinions are.","post_message":"Kellyanne Conway embarrassed CNN's Chris Cuomo for obsessing over Donald J. Trump's tweets..."},{"comment_id":"10153744728059087","commenter_b":"And, to all of the pissy whiney Clinton supporters who complain about how \"mean\" Bernie has been to Hillary by his pointing out true negative aspects of her record--if Clinton prevails, Trump will decimate her and Bernie will never look so good to them.","commenter_a":"I call...bullshit. Bernie","post_message":"\"I sense some great deal of momentum, I sense some great victories coming,\" Bernie Sanders said after his stunning upset victory in Indiana. \"I think we can pull off one of the great political upsets in the history of the United States and in fact become the nominee for the Democratic Party and once we secure that position, I have absolute confidence that we are gonna defeat Donald Trump in the general election.\""},{"comment_id":"10153709236220927","commenter_b":"I think she was in WAY over her head. I guess she hasn't been a flaming Liberal long enough.","commenter_a":"What's new","post_message":"Moderator Elaine Quijano continually challenged Gov. Pence. #VPDebate"},{"comment_id":"10153491120417869","commenter_b":"How ironic, mike; YOU are the one that's \"done\". You know what I'm talking about. This was your swan song, buddy.","commenter_a":"All Presidents are natural born to eat the dirt and breathe the air within USA soil ONLY!!! President\\tDOB\\tPlace of Birth George Washington\\tFebruary 22, 1732\\tWestmoreland County, Virginia, British America John Adams\\tOctober 30, 1735\\tQuincy, Massachusetts, British America Thomas Jefferson\\tApril 13, 1743\\tShadwell, Colony of Virginia, British America James Madison\\tMarch 16, 1751\\tPort Conway, Virginia Colony, British America James Monroe\\tApril 28, 1758\\tMonroe Hall, Virginia, British America John Quincy Adams\\tJuly 11, 1767\\tBraintree, Province of Massachusetts Bay Andrew Jackson\\tMarch 15, 1767\\tWaxhaws border region between The Carolinas USA Martin Van Buren\\tDecember 5, 1782\\tKinderhook, New York United States William Henry Harrison\\tFebruary 9, 1773\\tCharles City, Virginia Colony, British America John Tyler\\tMarch 29, 1790\\tCharles City County, Virginia United States James K. Polk\\tNovember 2, 1795\\tPineville, North Carolina United States Zachary Taylor\\tNovember 24, 1784\\tBarboursville, Virginia United States Millard Fillmore\\tJanuary 7, 1800\\tSummerhill, New York United States Franklin Pierce\\tNovember 23, 1804\\tHillsborough, New Hampshire United States James Buchanan\\tApril 23, 1791\\tCove Gap, Pennsylvania United States Abraham Lincoln\\tFebruary ...","post_message":""},{"comment_id":"10153667196560090","commenter_b":"She should be in Jail period!!!","commenter_a":"No. Send her to Prison","post_message":"Keep Hillary Clinton out of the White House!"},{"comment_id":"953112161448505","commenter_b":"Women.Stop having sex without condoms....","commenter_a":"Women. Stop having sex with Republicans.","post_message":"Sen. Elizabeth Warren has a powerful message for the Republicans that just voted to defund Planned Parenthood. Pass it on! Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"}]
