[{"comment_id":"10153208730274087","commenter_b":"Let the woman seeking one pay for it in full from her own money. No insurance & no public funds.","commenter_a":"Not so. Defunding PP will not end abortion until the USSC overturns Roe vs Wade. If Defunded..the government funding would simply be re-allocating taxpayer dollars to approximately 13,500 Women's Health centers across the country, (ones who actually own a mammogram machine & provide prenatal care, & ambulatory care--which PP does not do at all.) Planned Parenthood is breaking the law: delivering 2nd term babies to cut the organs out for resale & killing them outside the womb. If you have not watched the videos (exposing this on film), then you are being negligent of the truth. Plus PP helps Human Traffickers & pays cover up millions for mothers deaths on the abortion table. Women deserve better. I dare anyone on this thread to call PP to schedule a mammogram..or a prenatal checkup..they will say, \"we do not provide those services.\" If this is really about women's health..women deserve better than ...","post_message":"Cutting off Planned Parenthood’s funding would result in a net savings of $235 million over a decade, while also resulting in “several thousand” unplanned births that would drive up government costs elsewhere, the nonpartisan Congressional Budget Office reported."},{"comment_id":"10153124356001336","commenter_b":"IDIOTS PUT IDIOTS IN OUR WHITEHOUSE!!!","commenter_a":"It is not up to obama it is supposed to be congress and senate this is illegal","post_message":"\"Please just give this soldier the dignity of life! We give it to these guys down in Gitmo!\" Montel Williams questioned how Amir Hekmati, a Marine held in Iran's worst prison, is still in captivity while the Obama administration makes a deal with Iran. #FreeAmirNow"},{"comment_id":"10154917863094654","commenter_b":"Can women join this Club??????","commenter_a":"this is the best!!!","post_message":"Handlers of Pennsylvania's most famous groundhog are set to announce whether the rodent will predict an early spring or six more weeks of winter. More about the legendary Punxsutawney Phil @webpagelink"},{"comment_id":"10154549448869342","commenter_b":"That's not her!","commenter_a":"She ain't gangster now lmao","post_message":"Police became aware of a \"disturbing video\" on Facebook Live showing an adult man being bound and beaten."},{"comment_id":"10154984225302300","commenter_b":"Dee you are what's wrong with white people...","commenter_a":"Those darn white people attacking blacks.. oh wait.. this was black on black crime. Guess there won't be any riots over it.","post_message":"UPDATED: Eight people now confirmed shot Monday afternoon during a Martin Luther King Jr. celebration at a Northwest Miami-Dade Park, according to police."},{"comment_id":"1403734329688680","commenter_b":"these mobs are planed and paid for by the elites and must be stoped","commenter_a":"These people need to be arrested. This is not peaceful protest. It's criminal.","post_message":"BREAKING: Trump Official RUSHED To Safety After What Mobb of Attackers Just Did To Her Outside Child School"},{"comment_id":"10153605674442042","commenter_b":"They will just go somewhere else, maybe near you?","commenter_a":"I have lived in jersey city for 30years and i left six years ago....those buildings need to go...it housed alot of violent ppl....and drugs","post_message":"KABOOM! Watch the dramatic implosion of three 62-year-old Jersey City public housing buildings as the city makes room for pricier pads. READ MORE: @webpagelink"}]
