[{"comment_id":"10153308267139641","commenter_b":"Give her a million and send her on her way.","commenter_a":"Probably be on ID How I almost got away with it","post_message":"Russia's richest man faces $7 billion divorce bill: @webpagelink"},{"comment_id":"10155439911848797","commenter_b":"Poor Natalie. I almost feel sorry for her. Must suck being a triggered, fragile little snowflake.","commenter_a":"They should scalp the scumbag and hang his head at the entrance of the protesters so everyone knows what's going to happen to you if you try to harm people in a peaceful demonstration","post_message":"Instead of going around the crowd, the driver went right into it."},{"comment_id":"10154037628650672","commenter_b":"Even the illegal/undocumented immigrants are human beings. Everyone deserves a chance at safety.","commenter_a":"This doesn't effect law abiding citizens!!! Immigrants are safe!!! People who are here illegally are the problem!","post_message":"Mayor Bill de Blasio is addressing the media in the wake of President Donald Trump's executive order to strip federal funding for so-called sanctuary cities."},{"comment_id":"1847896892115179","commenter_b":"And what about the interface of other devices?","commenter_a":"There is no break through. It has always been there. Anyone heard of Tesla? Um hello...","post_message":""},{"comment_id":"10154298408534060","commenter_b":"Actually, it's incredibly efficient for what it is.","commenter_a":"All meat is a waste of energy and thus unsustainable.","post_message":"Human consumption of farmed fish has overtaken that of beef. In fact, aquaculture may be the only way to supply mankind with enough protein in the future"},{"comment_id":"10154292885141037","commenter_b":"She will never get this vote!","commenter_a":"Democrat Hillary is most qualified, most knowledgeable, and most well informed. Please vote her. Thank. Socialist Bernie and his wife Jane dumped nuclear waste in America where poor Latino people live. Never vote for him Thanks. America: Never ever Trump please. Trump insulted men and women all and sundry.","post_message":"Mitt Romney is “very distraught about” Donald J. Trump, an adviser said. “He thinks Trump is this vulgar, dangerous, principle-less, value-less opportunist — putting it mildly.”"},{"comment_id":"10153983597909726","commenter_b":"ugliest face on the planet,put the bitch in shackles","commenter_a":"It puts them under oath and on the record and if any take the 5th it'll hurt Hillary even more, especially with Independents and Undecideds.","post_message":"Hillary Clinton's aides will be questioned on emails by the U.S. State Department. Will this make any difference?"}]
