[{"comment_id":"10154043419071336","commenter_b":"First, voter fraud exists. People have gone to jail for it. And for every 1 person caught, you know there are more who aren't caught. And yes, foreign nationals who broke our laws to come here ARE less trustworthy, THEY BROKE OUR LAWS. We have enough home grown US haters and uninformed voters, we don't need to add people here illegally to the mix. They have no right to vote. If we can't ensure legal elections we are not protecting our sovereignty. Add that to unsecured borders and there is no USA any more. Try going to Mexico (or any country) illegally, see if they welcome you and let you chose their leaders. We are not bad people for wanting the same protections in our country that other countries offer their citizens.","commenter_a":"You mean undocumented democratic voters, right? CA has now given the right to vote to illegals. Supposedly in local races only. Who really believes that BS? What safeguards are in place to prevent them from voting in national races? None. And allowing them to vote in the first place is against the constitution. Just like illegals holding office is against the constitution. I shudder to think that CA's PC crap will pour into other states.","post_message":"\"We believe that this new law increases safety on California roads by putting licensed drivers behind the steering wheel,\" a spokesman for the California Department of Motor Vehicles said."},{"comment_id":"1227002650653096","commenter_b":"The LATIN EMPIRE AWAKENS! They realize that Republicans will get them into American class warfare!","commenter_a":"Latino Republicans? Does such an animal exist?","post_message":"Latino Republicans are mounting a pushback against the more conservative wing of their party."},{"comment_id":"10152843821379440","commenter_b":"And what teams did you watch in the playoffs","commenter_a":"peyton manning and the broncos superbowl 50 champions :)","post_message":"Peyton Manning and Denver Broncos are working on revising his contract, which could explain why there's been a perceived delay in him formally announcing his intention to return in 2015. dpo.st/1LJlYy4"},{"comment_id":"238983709893436","commenter_b":"Assholes. Shame on them...they got their education...the Hell with our future!","commenter_a":"pride in ownership republicans push education backwards.","post_message":"Was YOUR senator one of them? Spread their shame!"},{"comment_id":"10152628059135667","commenter_b":"Dear Bill, are you having relations with that women?","commenter_a":"How can they release something they dont have.","post_message":"\"I want the public to see my email,\" Clinton tweeted."},{"comment_id":"10152865807076051","commenter_b":"This was set up by this girl and her friends - she made sure her friend was there with the video going b4 she hit the other girl-she needs to be put away for a long time and have her sorry ass beat in prison and see what a REAL asskicking is. I hope the victim doesn't get scared and not proceed with the charges.","commenter_a":"we can thank our president and people like al sharpton for all of this they have done as much as possible to entice race wars!!!","post_message":"A girl was at the park with her little brother when all of a sudden they were attacked. The little boy tried to stop the beating – but that just drew him into the line of fire."},{"comment_id":"10153352792949203","commenter_b":"Woman hating much","commenter_a":"They are very stupid people who deserve no sympathy. I'll bet drug dealers and mafia members get assaulted too.","post_message":"Porn stars are people too."}]
