[{"comment_id":"10155804568635725","commenter_b":"Tell Andre ignorant ass to just go kill himself!! You never hit a girl you shine!","commenter_a":"Lmao attacking him?? it's a Football f**** player against a girl. Did u not see how she threw that punch lmao how is a grown ass man/athlete gonna look w that argument on court?? Lol and why didn't he leave her alone after she seemed to push him away?? Cuz she said the N word!!! Ha so it all makes sense now!!! Oh my god someone bring the guillotine!!! Not the N word!! Bring all the rappers too!!! This is an injustice!!! Lol","post_message":"Florida State University quarterback De'Andre Johnson is telling his side of the story of the now-viral video where he is seen punching a woman in the face at a campus bar, including what he says the woman said to him right before the attack ----> @webpagelink"},{"comment_id":"10153305796441162","commenter_b":"Hilary you go girl love you. Women, remember Jane Burn? She were a woman Mayor, lets get Mrs. Clinton for President. We made it with a black President, lets get get Mrs. Clinton in.","commenter_a":"Hillary Clinton for President 2016, all the way!!!!","post_message":"HILLARY 2016? It's officialHillary Clinton is running for President, and she's already considered a front-runner. We have the full story coming up on our 5:00 news. Tune in to ABC 7 Eyewitness News or watch LIVE at @webpagelink"},{"comment_id":"10153615563223812","commenter_b":"Well some people family don't care","commenter_a":"(rolling eyes) if she was white and was found hung in a cell, no one would say a word.","post_message":"While Sandra Bland's family and supporters have been calling for an independent investigation into her death, the DA plans to release the dash-cam footage from her arrest: @webpagelink"},{"comment_id":"1028860963867355","commenter_b":"The bitch needs to shut up all she knows how to do is ly","commenter_a":"Lying again","post_message":"Senator Elizabeth Warren went after Donald Trump, slamming him as a \"thin-skinned, racist bully\" and \"proven failure\" who is only \"qualified to be fraudster-in-chief.\" What do you think about her comments?"},{"comment_id":"10153234485277293","commenter_b":"That's hard work for women","commenter_a":"Women must stay home and have babies that is strongest work in the world","post_message":"The research raises the question of whether the Marine Corps may press to keep the infantry and Special Operations, in particular, closed to women."},{"comment_id":"1083906904965768","commenter_b":"Girl, it was a woman who slapped the horse (read the article, John :) )","commenter_a":"Guy must have thought he was Alex Karras or something. Now draw and quarter the worthless skid-mark.","post_message":"BUSTED"},{"comment_id":"1071556556193998","commenter_b":"So true , I love this","commenter_a":"It all starts within by releasing denial, accepting where we are, and then seeing what opportunities are there. <3","post_message":""}]
