[{"comment_id":"754556321401612","commenter_b":"Tie them by their ankles to a fast moving train!!","commenter_a":"This is the mine set of Muslims. That it's ok . Send their asses back","post_message":"Group Of Muslim Migrants That Gang Raped 16 Year Old White Girl Get Devastating News They deserve much worse than this. What do you their punishment should be?"},{"comment_id":"971595456226551","commenter_b":"there is a problem with a Black man being president and not standing for a black man, or a white man!! but only standing for illegals and Terrorist!!! thats what should be bombed!!! leave white babies or any babies out of it!! SPILLING INNOCENT BLOOD MAKES YOU JUST AS LOW AND WRONG AS WHAT IS HAPPENING NOW!!!","commenter_a":"I will gladly Kill you for the White Nation!!!","post_message":"(Audio) A war cry... @webpagelink"},{"comment_id":"10153798319264087","commenter_b":"fuck you. she didn't do shit when people called for help in libya. she sucks-and she hassled girls bill raped","commenter_a":"he cares about Americans. I always vote democrat, but not any more. i will vote for Bernie in june-but he don't have a chance-ill vote for Trump against that lying bitch","post_message":"“What I’m going to do is I want to focus on 15 or so states because we have to win, and I want my energy to be put in the states where it could go either way,\" Donald J. Trump said. \"And we’re going to play heavy, as an example, in California. No other Republican would, they wouldn’t even go to dinner in California. They wouldn’t do it.”"},{"comment_id":"10153467160786323","commenter_b":"All I am saying is there is a lot of Muslim women who use to wear more colourful suits dresses in this country who are now covering themselves up in black!","commenter_a":"I remember the days when asian women proudly wore their beautiful coloured saris and gold bangles. We have only seen this change of dress code of wearing the Hijab and Burka since 9/11.","post_message":"\"I am wearing the hijab because I want to. Not because I am forced to. Yes, really.\""},{"comment_id":"1283553535022959","commenter_b":"Ryan got a totally cushy job.","commenter_a":"Aleks Evans","post_message":"LOL! Not helping anyone, Ryan!! SHARE if you agree! (Hat tip to The Christian Left)"},{"comment_id":"1455415254518218","commenter_b":"Define \"innocent\", please. Then I will explain to you the meaning of \"idiot\"","commenter_a":"The problem is that the conservative corporate controlled media has turned the conversation away from the police killing unarmed innocent citizens to this nonsense about kaepernick not standing. Where is the outrage against the police killing hundreds of innocent people?","post_message":"Megan Rapinoe said it was an intentional move to support 49ers' Colin Kaepernick"},{"comment_id":"662069217316990","commenter_b":"Sorry Bitches !!! Go to jail !!","commenter_a":"Yes!!yes!!!!!yes!!! that;s a shame!! just think?? if that was your mom! or dad????","post_message":"These thugs tortured nursing home patients for an insane reason. These two are monsters. Let's lock them up and throw away the key. Do you agree these thugs should do life?"}]
