[{"comment_id":"1219604621413341","commenter_b":"A very large dick","commenter_a":"I was born and raised on Ohio and this man embarrasses me","post_message":"Here's a clue: She's not a 62-year-old man, but that's not all. It gets worse. Much, much worse."},{"comment_id":"539015142953445","commenter_b":"Scum of the earth all of them! !!","commenter_a":"But they're a Religion of Peace!","post_message":"These guys are SCUM!!!"},{"comment_id":"10154194396888010","commenter_b":"Says a woman who has a child... but who only wants people who look like her and have money like her to have opportunities, though. #privilege","commenter_a":"This can't be serious? They want to provide State-finder childcare, too? And, preschool? Every study I read says the current system of young elementary school is failing kids (too much time in seats, not enough art and play, etc.) and the solution is to start them even earlier? Free childcare, free preschool, free K-12, and Bernie wants free college. Where does it end?","post_message":"The goal: free preschool and affordable daycare for all."},{"comment_id":"539636529560260","commenter_b":"She should be in jail","commenter_a":"NO FU*K YOU liberal artist Abby Martin !","post_message":"Liberal artist slams Chris Kyle with this t-shirt, but that's not even the worst part. This is awful. He was a true patriot who protected our country. Let's show his family our support. Can we get 20,000 'LIKES' for Chris Kyle?"},{"comment_id":"915434395182976","commenter_b":"As a mom myself, I agree with you Ben. How much did she actually ingest if she took a sip and said it tasted funny?","commenter_a":"Clearly this is not cool, but accidents do happen in life. She drank a tiny amount of watered down sangria, not methylated spirits or even vodka. I think the parents are massively over reacting. I would be angry, but come on, a few sips of cheap wine mixed with orange juice is not going to kill a small child.","post_message":"She was rushed to the hospital drunk"},{"comment_id":"1773091102960388","commenter_b":"FBI Director Comey states that \"There is no evidence that Hillary Clinton lied\".","commenter_a":"I'm not a Republican by any stretch of the imagination, but at least we can find some common ground on the Hillary Clinton issue. It's completely insane that the DNC has supported her this whole time. She, along with Bush and Cheney, need to be in jail. Let's stop allowing these people on both sides to be above the law.","post_message":"The Director of National Intelligence should deny Hillary Clinton access to classified information given how she so recklessly handled it as Secretary of State."},{"comment_id":"1329423637100902","commenter_b":"She owns them.","commenter_a":"Ivanka you rock and you are a great representative of a Jewish woman and princcess and MOm . G-d bless you and your family .NOOne has a perfect family and you exemplify derecho eretz.","post_message":"LIBERALS HAVE CONCLUSIVELY PROVEN DURING THEIR ELECTION MELTDOWN THAT THEY ARE THE SCUM OF THE EARTH!"}]
