[{"comment_id":"1121293104578213","commenter_b":"A girl?!?? Good at a SPORT?!? Better insult her appearance!!","commenter_a":"Talking bout that horse face","post_message":"WNBA star Elena Delle Donne shared her free-throw secret and the encouraging words that drive her. - Erin Canty"},{"comment_id":"10153885822754087","commenter_b":"Lmao.. She's a moron","commenter_a":"@username hysterical","post_message":"Hillary Clinton took things a bit too literally during a recent campaign stop when she read the word “sigh” off her TelePrompTer instead of actually doing one. WATCH:"},{"comment_id":"10152779839917093","commenter_b":"Looks like young man, yes respectful,young man was very patient with his mother for not striking her Yes that was courageous of her to find her child and protect him. God bless you guys. I hope you can see that there is so much unspoken love in this video.","commenter_a":"A mom who cares. Very brave woman!","post_message":"Mom finds her son in the middle of the Baltimore riots... many are calling her Mom of the Year for what she does next. @webpagelink"},{"comment_id":"1291488564240340","commenter_b":"Sorry but she is an unhinged dingbat.","commenter_a":"I'm concerned after reading today's Buzzfeed Report that the now well publicized 1986 letter by Coretta @username was not made a part of the Record then (in apparent subterfuge by Committee Chair Throm Thurmand ?). Now Sen. McConnell, by invoking Rule 19 may well have prevented the inclusion of this letter in the official record once again, in spite of the continued publicity it has received during the hearing. Our History is thus written by the \"Vicors\". Maybe it is still possible to insert that letter into the official Record of the Debates.","post_message":"I’m deeply disappointed that the Senate voted to confirm Jeff Sessions as Attorney General tonight. Deeply disappointed that the Senate confirmed an AG whose record does not show he will faithfully and fairly enforce the law. Thanks to you, everyone now knows the concerns that Coretta Scott King had about Jeff Sessions. Concerns that millions of people still have. There’s no Rule 19 to silence me from talking about Jeff Sessions anymore. So let me say loudly and clearly: This is just the beginning. If Jeff Sessions turns a blind eye while Donald Trump violates the Constitution or breaks the law, he'll hear from all of us. If Jeff Sessions makes even the tiniest attempt to bring his racism, sexism, and bigotry into the Justice Department, he'll hear from all of us. And you better believe every Senator who voted to put Jeff Sessions’s radical hatred into the Justice Department ..."},{"comment_id":"10154113063315950","commenter_b":"@username wrong. Polls showed Hillary winning the ELECTORAL vote. Wanna try again delusional one? #ShesNotYourPresidentAndNeverWillBe #GetOverIt #SoreLoser","commenter_a":"Polls Smolls! Haven't we learn anything when it comes to \"polls\"?! Bwhahahaha!","post_message":"Barack Obama has a 50 percent approval rating heading into his final months in office, a new poll found Monday."},{"comment_id":"10154534719475695","commenter_b":"She should of just kept her mouth closed. #LessonLearned","commenter_a":"Good!","post_message":"Her employer and Miss Alabama pageant organizers are responding to the video, watched by 600,000 people."},{"comment_id":"10152513756410927","commenter_b":"e is talking about his leader Satan","commenter_a":"Ha! The blind leading the blind. Schmuck. “This I say therefore, and testify in the Lord, that ye henceforth walk not as other Gentiles walk, in the vanity of their mind, Having the understanding darkened, being alienated from the life of God through the ignorance that is in them, because of the blindness of their heart:” Ephesians 4:17-18","post_message":"Obama says he has sought God's guidance in leading nation..."}]
