[{"comment_id":"915924881775941","commenter_b":"The buildings were resisting arrest, so they were executed!","commenter_a":"Justified. Those buildings and people around were obviously obstructing justice.","post_message":"More trigger happy cops? Time to unarm the cops? What do you think? Via: Police The Police <-- (y) Follow this page!"},{"comment_id":"1033904696677262","commenter_b":"it's good that there is surveillance even watching midwives, and exposing this crazy cow is also good, but I just feel that this might start a trend of uploading horrendous abuse videos. The media should try to hide the identities of poor kids like this baby. She definitely needs shooting a few times at least.","commenter_a":"I have not seen the video nor do I want to. Y on earth is it here for everyone to see!? What is there to gain from displaying a horrific video of a child being abused? The story should be published but when this poor child grows up and sees that this video has been seen by millions how do u think he/she will feel? Hope this cow rots in hell.","post_message":"WARNING: GRAPHIC VIDEO"},{"comment_id":"10153105200194497","commenter_b":"I couldn't stand this chick.","commenter_a":"Tom Lombard","post_message":"From our sister publication: \"Next Week On ClickHole\""},{"comment_id":"10153014301039205","commenter_b":"@alex you're fucken stupid saying illegals don't have a place in the U.S. We ALL are fucken immigrants idiot , what about the Chinese gangs and Russian mobs ? What about them ? What about the KKK and other racial groups who commit crimes ? It's not just us MEXICANS who are illegal it's EVERYONE , If anything the natives founded this land and the rest are immigrants .. Smdh","commenter_a":"Who's fucking side are y'all on? Trump may not be the nicest kid on the block but we are talking about a Drug Lord in a very dangerous drug cartel. Is yalls hatred that much for Trump that you support a drug cartel boss killing him?","post_message":"The FBI is now protecting Donald J. Trump"},{"comment_id":"10155209080925652","commenter_b":"mast! :D","commenter_a":"Ashay Gangwar @username check this out!","post_message":"These maps offer the most enjoyable route, not the fastest:"},{"comment_id":"1101969979880290","commenter_b":"@username and @username You are both aware that faith is not a verifiable thing,correct? You also don't need religion to have the emotion of faith in something. My goodness...where do you people get your educations?","commenter_a":"Pretty happy we have the technology to make this happen. Thanks to the doctors for their experirnce and service. god has nothing to do with this surgery how about you thank the heros the doctors.","post_message":"After over 26 hours of a remarkable surgery, the moment when the parents saw one of their conjoined twins separate for the first time. The twins, Anias and Jadon were successfully separated after being born conjoined at the head 13 months ago. #JadonAndAnias. @webpagelink"},{"comment_id":"1022015544612032","commenter_b":"lol these pansies lmao","commenter_a":"Trump is a honest president Obama and Clinton's can go way impeach Obama.","post_message":"BREAKING: Hillary Supporters Threaten To Kill Trump Electors Oath Keepers Response Is EPIC Electors are getting death threats from Hillary's and Obama's THUGS. That's TREASON! Support the Oath Keepers!"}]
