[{"comment_id":"10153866507862144","commenter_b":"So this is just one more example of her poor judgment. It seems like every single chance she gets, she uses poor judgment. How can people want someone who CONSTANTLY displays terrible judgment to be president?!","commenter_a":"She admitted she was careless. Careless is not a crime. She's not stupid and would never send material that would endanger national security. And she won't be using a private server as President, that's for sure!","post_message":"FINALLY."},{"comment_id":"1784321135174854","commenter_b":"No you not voting makes you a hypocrite","commenter_a":"I am so done with this mentality.","post_message":"\"...the oppressor isn't going to allow you to vote your way out of your oppression.\" Colin Kaepernick explains why he didn't vote."},{"comment_id":"563542197162994","commenter_b":"Dear black lady: it's stupid to do either example you gave. Way to drink the cool aid.","commenter_a":"Yesterday in Charlotte (As per Charlotte Police Chief--He's Black)Black man exits car with a gun in his hand, told to drop weapon and refuses....shot by a black police officer. Gun recovered....not a book. Stop the false narrative! Stop the Madness!!","post_message":"At least 12 officers and 5 demonstrators were injured in protests in Charlotte after a black man was shot and killed by police. Video shows protesters destroying a marked police vehicle."},{"comment_id":"10154054531268984","commenter_b":"shes a bitch, and has over inflated the facts and and did not do the research in her questions it was all edited as thats what the media does they piece the words together to suit them sick of of all news media they do not report anything truth anymore just the lies they try to make into thier own little fantasy world to get them in the spotlights of the media world ........","commenter_a":"M KELLY IS A LOW-CLASS BITCH","post_message":"Megyn Kelly was in the middle of her live TV show when news broke that Donald Trump would officially be skipping the Fox News GOP debate. Talk about a captivating moment of live television... Do you think Donald J. Trump made the right decision?"},{"comment_id":"10155175533915389","commenter_b":"Looks evil. Tired of the liberal PC bull :poop: that is going to end up killing good people. Maybe if the Terrorist went after liberals only..they wouldn't be in a hurry to let these murders free. Starting with Washington please","commenter_a":"What is this world becoming","post_message":"The United States Department of Justice said a former Al Qaeda operative was released last week from a federal prison prior to completing his 15-year sentence because of “time served.”"},{"comment_id":"10153273987738984","commenter_b":"Does this F*CKTARD actually think I'll stop saying Thanksgiving? What a moron! Keep poking the bull bitch!!!","commenter_a":"Obama is a Fucking traitor and Muslim Asshole.","post_message":"Seriously Obama? What are you going to take away next? The NFL? Apple Pie?"},{"comment_id":"390922764595794","commenter_b":"Amen","commenter_a":"Amen","post_message":""}]
