[{"comment_id":"903890666313022","commenter_b":"She better bring a big army.","commenter_a":"Well michelle said before she is out of the White House she is going to have guns taken away from the American people","post_message":"Outrageous!"},{"comment_id":"1183868738313543","commenter_b":"I'd rather have my daughter use the restroom with these people:","commenter_a":"Before you know it they will be in your kids public restroom if they aren't already, thanks to the new laws.","post_message":"UPDATE: The Winter Haven Police Department arrested 22-year-old Adam Timothy Tharp after he was caught flashing a 7-year-old girl at a Polk County library."},{"comment_id":"861355680627352","commenter_b":"ronan need to go, and joy should replace REV AL at 5pm cst is very very hard to watch his show!!!!!","commenter_a":"did someone from fox come over and take over in charge of show selection as I am with the others why keep Scarborough who belongs over on fox and let these two go....way to lose viewership","post_message":"Ronan Farrow reveals the answer to a big question ... almost."},{"comment_id":"10156784755310354","commenter_b":"Fly on your Broomstick Hillary!!","commenter_a":"The fact that she has not been indicted by now with the mountain of evidence stacked against her is proof that it will NEVER happen, folks.","post_message":"There is zero irony in this story."},{"comment_id":"10153568531759705","commenter_b":"Umm for reals...","commenter_a":"10154509258848856Eva Sellers Uhm, clearly they missed the Jammie era.","post_message":"What's the sexiest decade of sleepwear?"},{"comment_id":"10154306553151729","commenter_b":"@username then you should be glad that we want to stay out of it, dumbass! Unless you want us to go back to our 1940s mindset and you won't have anything but a glass parking lot over there.","commenter_a":"They have been fighting over there for centuries. Stay out of it let them finish each other off.","post_message":"This is very serious folks."},{"comment_id":"1155155194501829","commenter_b":"Get over it. There are two different justice systems, if not more; operating within one....","commenter_a":"white privilege","post_message":""}]
