[{"comment_id":"1006229472770134","commenter_b":"You seem a lovely Christian...","commenter_a":"Scum bag,evil,man!! He's a Muslim running America,funding ISIS","post_message":"'Welcome home, Mr President'"},{"comment_id":"10153828733732235","commenter_b":"LOL ... You people are so screwed up it amazing. You don't have to go to a fracking town to get raped ladies. Just go to any sanctuary city. There will be plenty of Mexicans willing to do the job that no American will do. LOL","commenter_a":"I have read about this .... disgusting .... assaulting women shows cowardice from these men ... shame, shame on them and the legal authorities!!","post_message":"This interview is heartbreaking."},{"comment_id":"10153591407472293","commenter_b":"So youre saying,sir , that you may agree with some of their values and not be aware that you do because of conditionally environmental blindness.","commenter_a":"We're seeing some of the results of Donald Trump's subpar education. He makes up for his lack of intelligence with bluster, but in the end it won't serve him or our country well. Next Trump will boast that he will make the trains run on time.","post_message":"Donald J. Trump's responses quickly prompted criticism from his Republican rivals and others."},{"comment_id":"10155024202814703","commenter_b":"America has American terrorist's as well. Why no effort on banning them, or shipping them out of our Country???","commenter_a":"Bet you never thought you would see planes crash intentionally into buildings either","post_message":"Thoughts?"},{"comment_id":"1125870684199336","commenter_b":"If just like to see her run away!","commenter_a":"Please, NO !","post_message":"Would you like to see Michelle Obama run for office one day?"},{"comment_id":"10156383221255354","commenter_b":"I can face God and not fear my fate if all muslims are eradicated from the earth. This is only the first of many attacks and I feel not a single muslim can be trusted. Call it racism, call it profiling or plain ol fashion hatred but they all are the enemy to the rest of us and their death is our only option.","commenter_a":"War involves two sides! Until we realize the Muslims are at war with us, we will continue to lose!","post_message":"\"This is war.\""},{"comment_id":"10153167321611519","commenter_b":"Appealing still to fear & hate.","commenter_a":"Dislike!","post_message":"This is why he's shooting to the top of GOP polls..."}]
