[{"comment_id":"10155605168240968","commenter_b":"Lock Em up!","commenter_a":"Liberals suck!","post_message":"\"If you see your friends or family falling into the chasm of cable news, perhaps parental lock is right for you.\""},{"comment_id":"2035328873360726","commenter_b":"Touch my wife and you're a dead goat-humping mf.","commenter_a":"So this must be why American women want muslims in our country?","post_message":"SHARIA LAW BEATING Of Woman Captured On Cell Phones By Cheering Crowd…Woman Savagely Lashed With Cane By Masked Men…Screams In Pain Before Collapsing The smiling women in the large crowd is almost equally disturbing… ***WARNING***VIDEO IS VERY GRAPHIC And DISTURBING!"},{"comment_id":"940585612654173","commenter_b":"Aleeyah your FB page is wacked out!! Girl I feel sorry for your kid. Get yourself some help. God don't like ugly!!","commenter_a":"Whitefolks did the same thing to Black Slaves, yes it is demonic and insanity. Look whom and what rule we have been unjustly livong under. The girl is showing the affect of what she was taught and learned from her step forefathers the Slavemasters children.","post_message":"Mother accused of intentionally setting her newborn baby on fire enters a not guilty plea, will undergo a mental health evaluation: @webpagelink"},{"comment_id":"1048961388493889","commenter_b":"@username and what do you mean by Americans pay for illegals not you I am an American last I checked","commenter_a":"I don't know what your being told but Obama has more people deported than any other president. ...I see it constantly in the Hispanic news channels","post_message":"CIS found that criminal prosecutions for immigration offenses have dropped 36% over the last five years and due to sanctuary cities policies, the detention of illegal aliens in jails is down by two-thirds."},{"comment_id":"1437463806270353","commenter_b":"Can Hillary come to Texas?","commenter_a":"We don't care much for you here in Houston either, Trump. Just wanted to let you know that before you get down here and make ya self at home","post_message":"Heading to Houston, Texas now -- just informed that two police officers in Fort Worth have been shot. Please join me in keeping them in your thoughts and prayers this evening."},{"comment_id":"1362606120446523","commenter_b":"I heard about that. Those kid's were way out of bounds for doing that. But I assure you, no citizens of the United States of America are being threatened of being deported. Only illegal immigrants of any color, race or religion. Its already the law. It has been for a long time. Its just not been enforced properly. The media tries to spend it in to hate. Its not hate, although there is anger for what were allowing to happen to our country. I personally only hate terrorist. No matter where they come from. Thats why we need to band together all American citizens. We have band together against a corrupt government, illegal immigration and these terrorists. Foreign and demestic. If we can't come to terms with that as a people. See it for what it is. Than im afaid all is lost.","commenter_a":"No they don't. You continue to try and make it about Trump. It does however have a lot to do with you. The media and the government. This is your( collectively) propaganda. To continue to divide. Its not working. Not for the majority. People listen please. They are lying to you. To push their naritive. If you actually listen to Trump. Not just the out of context sound bites they feed you. He and people who support him want unity more than anything else. For America. Then we can focus on everyone else. But we have a serious problem at home to deal with first. We have to let white, black, left, right and what ever else America go!! And realize we the people. All the people. We the people of this great nation are on the same team. Thats what we are missing. Everyone is more concerned with their ...","post_message":"This is just sad."},{"comment_id":"10153217406773812","commenter_b":"You dont seem like the kinda girl that could shoot a dog more the poisening type.","commenter_a":"Nope nope nope. A dog bites my kid and he's lucky to die by gun.","post_message":"Man charged after shooting, killing family dog that bit 4-year-old boy: @webpagelink"}]
