[{"comment_id":"935669179891807","commenter_b":"Go Home. U. Brain dead Muslim parasite Abraham sand blasters","commenter_a":"Go back to the Middle East where it's a Holy War USA doesn't want that crap here","post_message":"This Texas mayor wasn't about to let fundamentalist Muslims set up a Shariah court in her town, so a bunch of angry Muslims demanded she surrender. What she hit them with next was NOT what they were hoping for..."},{"comment_id":"947324245313643","commenter_b":"Sick witch, heartless.","commenter_a":"Arrested her","post_message":"Police say woman hid body of dead son in trunk of her car. According to police, the boy was last seen in 2004. @webpagelink"},{"comment_id":"10153845314569024","commenter_b":"This is a wake up call. Ban these type of stores underneath the rail. Build a wall around it.","commenter_a":"Cuomo & DeBlasio told their agents to not answer questions??","post_message":"Do you think the city ought to be doing more to keep overhead rail infrastructure secure?"},{"comment_id":"1241511662632276","commenter_b":"Send his ass to jail","commenter_a":"Send him to jail","post_message":"This thug-in-training tried to act tough by sucker punching this white 12-year-old boy with a pair of brass knuckles. Too bad for him the District Attorney didn't think his brutal assault was as funny as he did... Now he's going to see what the real word is like! SHARE and let us know what you think should happen to this thug-in-training! @webpagelink"},{"comment_id":"910291425675761","commenter_b":"Throw her out of the white house.","commenter_a":"let the book burnings begin..then kristellnacht...then relocation camps","post_message":"Are you at all surprised by this?"},{"comment_id":"1212661252101912","commenter_b":"Lmfao bitch","commenter_a":"@username and you can't even do 5 seconds LOL","post_message":"A policeman just planked for 8 hours and broke the Guinness World Record."},{"comment_id":"1156100184429437","commenter_b":"This woman is for Trump","commenter_a":"It was really disgusting watching how Fox News joined the rest of the \"Left-stream\" media last night in savoring Ted Cruz's Wisconsin win. Megyn Kelly & co. continually dissected the voters by pointing out that \"Trump was losing the appeal of woman voters.\" \"That Wisconsin voters were educated and paid very close attention to details!\" How sad. Never in my life have I witnessed how the GOP could deliberately try & take down one of their own while leading the attacks against Mr. Trump in their on-going crusade \"to stop Trump!\" This is very disturbing. Cruz and that nasally annoying voice of his was carrying on as though he transformed this presidential race when in fact it was Mr. Trump who initiated the anti-establishment hostility from the moment he threw his hat in the presidential ring. Cruz is a GOP plant as is Kasich.","post_message":"THE EXPANSION OF TERROR is so much worse than what we'd like to admit, a new report out of the EU confirms: @webpagelink"}]
