[{"comment_id":"10154783600566336","commenter_b":"Did the first plagiarize too?","commenter_a":"Trump talked about immigrants, but first he should deport his own wife who is not even american and come here illegally","post_message":"History Quiz: Can you guess the first?"},{"comment_id":"1788323888048645","commenter_b":"SouthernBox Blues But why are the prisons full? Getting rid of the illegal aliens from them would help. If the little jackasses need to be locked up, do it. Just like Sheriff Joe, put them in a tent.","commenter_a":"Its time for Chicago to clean house . From the dirty politicians all the way down to these street thugs .","post_message":"WATCH: 71-year-old man shot while watering lawn; new Chicago shooting sparks outrage: @webpagelink"},{"comment_id":"10156091000625354","commenter_b":"White Trash ...Bastard .... Hoe Bag.... She has Evil Eyes.....Ugly Bitch.....!!!!!!..","commenter_a":"That's this fat slobs 2 seconds of fame, congrats your grandkids will tell stories","post_message":"Here's what we're dealing with, folks…"},{"comment_id":"10154349136059203","commenter_b":"Then you would be sexually assaulting a sexual assaulter","commenter_a":"If I ever saw this piece of shit in the street, I'd kick him in the nuts. He's a disgusting animal","post_message":"As if this could get any sicker."},{"comment_id":"1788499241368226","commenter_b":"Right. She has breasts. Ducks don't have breasts.","commenter_a":"Talks like a duck... looks like a duck... acts like a duck... must be a fucking duck","post_message":"Police Forcibly Remove Woman From Ladies Restroom Because She \"Looked Like a Man\" - is this what #MakeAmericaGreatAgain looks like?"},{"comment_id":"511461792370480","commenter_b":"The bitch will do as she always does: LIE, and the Establishment will protect her and not have an indictment. It's sad the way this country would rather have a corrupt person with a rap sheet longer than her arm, get away with everything she and Willie have done. Anyone: Google \"Clinton Chronicles\".","commenter_a":"Moot point... Hillary will get crushed by the FBI.","post_message":"Donald Trump says he would crush Hillary Clinton in a general election. Do you think he's right?"},{"comment_id":"10155083980414203","commenter_b":"April BABIES have NO REALITY according to YOU! THAT IS WHAT IS CRAZY. I don't listen to insane lunatics April.","commenter_a":"Thank you Pence for deciding what women can do with their bodies. When the time comes, if it hasn't already, that you need Viagra or any other penile disfunction medication or treatment, we will decide if you can get your dick pills or not. Oh and, fuck you Pence!!","post_message":"Today was a Mike Pence crowd."}]
