[{"comment_id":"1579440092351045","commenter_b":"@webpagelink What Fox News doesn't tell you about #muslimlivesmattertoo","commenter_a":"I will never ever vote for someone as abominable as Trump! After four decades of voting GOP- I am done.Never Trump!","post_message":"'In spite of all the criticisms and vitriol being heaped upon Mr. Trump by Washington’s political elites, he has neither wavered nor sold his soul to the devil of Washington politics. Instead he has remained faithful, true and honest'"},{"comment_id":"10153314569635950","commenter_b":"Lol yup","commenter_a":"Trump is great at selling fear. Notice how there is almost a \"Trump's fear of the week\" going on? He's great at pitching things and selling himself. Republican voters are eating this up because they like to be scared because they love having an excuse to fight someone or something. Go ahead and cling to your guns and foam at the mouth screaming about the next conspiracy,. I'm over here sipping coffee and watching the GOP sink like the Titanic.","post_message":"\"I don't like anything having to do with changing our Second Amendment. We have plenty of rules and regulations.\""},{"comment_id":"1713686355585143","commenter_b":"Stick it bitch.","commenter_a":"They came into office with 1 are 3 million they now have 12 to 20 more million...Don't tell me she's not getting paid...","post_message":"Are you... KIDDING ME!? So sick of Barack Obama & Michelle Obama..."},{"comment_id":"10154688029234749","commenter_b":"No, not all woman. Just ugly dogs like yourself","commenter_a":"Because the beard makes them extra ugly and nobody else wants them","post_message":"A little bit of stubble has a whole other meaning though..."},{"comment_id":"10153519290756336","commenter_b":"Good He caught Her now She cannot steal Anyone Elses's Identity","commenter_a":"You are a thief ! .... end of story","post_message":"\"You picked the wrong guy.\" FOX 4 News reporter Steve Noviello confronted a woman who allegedly stole his credit card on camera."},{"comment_id":"10153296497591519","commenter_b":"@username No, I kiss your mother with that mouth.","commenter_a":"Racist Republican Religious Lying Christian Coward Party.","post_message":"\"Religions are not all the same, with some being more peaceful than others...\""},{"comment_id":"1538313829806168","commenter_b":"I am not paying you shit I had nothing to do with era so fuck you and for your stupid information the Dutch started the slave trade.but I can tell you come to my house I can guarantee you will have a bad day","commenter_a":"Not only no but Hell No","post_message":"All White People Owe Us Reparations, 'If You Don't Give It, We Are Coming To Take It' [VIDEO] They are demanding that we give them money for their ancestors slavery. Will you pay African Americans reparations?"}]
