[{"comment_id":"10156809367690725","commenter_b":"U shush up cactus lady","commenter_a":"STOP, JUST STOP! Trump uses this sad news to advance HIS agenda, and the terrorists use his rhetoric to advance theirs. DONALD TRUMP, JUST SHUT UP!","post_message":"Watch this clip from earlier this year. Time and time again- I have been right about terrorism. It’s time to get tough!"},{"comment_id":"1371377862955264","commenter_b":"@username once a fraud always a fraud","commenter_a":"When will you people STOP this lunacy .. And that is WHAT it is.. He did NOT become a BILLIONAIRE by being stupid.. He WON the election. GET OVER IT SNOWFLAKE","post_message":"We need to stop giving this psychopath any ideas..."},{"comment_id":"10152905378740736","commenter_b":"Shes an idiot..lmao","commenter_a":"Send him home to Mexico please.","post_message":"Two young girls told security at an H&M store that the man was positioning his phone under women's skirts."},{"comment_id":"1792520417642435","commenter_b":"Darlene is a freaking moon bat low life from Mars. Leave the scum alone.","commenter_a":"desroy Clinton, do not hold back, destroy this criminal.","post_message":"Crooked Hillary Clinton wants to essentially abolish the 2nd Amendment. No gun owner can ever vote for Clinton!"},{"comment_id":"10152922886022377","commenter_b":"Lock her up and throw away the key!!!","commenter_a":"Her mug shot will be her best picture.","post_message":"Criminal charges coming soon for Hillary Clinton?"},{"comment_id":"1150660831667337","commenter_b":"@username shut up fatass hoe","commenter_a":"America was built on hate! Just ask the Indians.... oh wait it's hard to find any because the white man almost killed off the whole entire race for land?? Land that was never theirs?? Land that is foreign to them? Oh and we are the savages?","post_message":"Good question #Philippines #WSHH"},{"comment_id":"10153683930231323","commenter_b":"@username No, your country has still resposibilities coming from your good age of colonialism and be honest to your self: IS are nothing else than organised crime and don't be so stupid to believe, that an group of organised crime needs \"illegal immigrants\" to spread the business. BTW: find out where the largest number of historical artefacts from the middle east, coming with an unclear origin, are traded? Don't be surprised when you find out that it is London and you you can easily find out, that it is business of billionGBP earning. Why do you think IS is destroying historical sites? So, all this happens under the control of your government, right in your neighbourhood...","commenter_a":"The people were on their way and Germany take action to relief all surrounding countries, who where not able to cope with a minor percentage of the people floating their countries. Yes, it is not easy, but Germany helps a lot of people and countries and yes, it is a massive task, but we (you and me and our governments...) have to deal with it.Why? Because we are causing the situations, why the people have to flee and have seek for shelter. So, I am living in Hamburg, my borough is called \"Bahrenfeld\" and we have a polpulation 23.000 people. Currently we have 3.200 refugee living here. And I can hardly understand, why a country, which has caused and initilized a lot of the current wars in the middle east, in order to earn oil money ----NO---- to fight terrorism (hahaaa), refuses to take part in the resposibility...Yes, my dear ...","post_message":"“Sometimes the smugglers arrive in the middle of the night and drop underage refugees off at the service station. The police call my child protection officer at 3am, who has to go to them, and if no accommodation can be found, he often ends up taking them home with him.\""}]
