[{"comment_id":"744192892380562","commenter_b":"Jerome-- a mole? Are they all?","commenter_a":"Close the borders. With all due respect congressman, only idiots would even consider calling military age men \"refugees.\" Our borders have been poorly managed that it is impossible to tell who has infiltrated my America. Seems that Congress has chosen to remain totally mute on this issue. Obama bashing does not hide the fact that inaction equals compliance.","post_message":"It's frustrating that President Obama refuses to shift his strategy to defeat ISIS. The horrific attacks in Paris are evidence that the current strategy to defeat ISIS is not working. I discussed this earlier today on Fox Business' Varney & Co.. Watch below:"},{"comment_id":"1756054801276415","commenter_b":"Though what border did the Muslims come ?","commenter_a":"Don't mess with Texas!","post_message":"BREAKING: Texas Lt. Governor Announces That Texas Has Finally Shut Down The Border. It's about time. With or without a wall, we will protect our country. Do you think we need to close our borders to Mexico?"},{"comment_id":"1258751664191586","commenter_b":"i bet she can harvest a lot of trees on minecraft","commenter_a":"Look little bittt i wana see you actually fight some one as good","post_message":"Nice with the hands. #WSHH #Boxing"},{"comment_id":"964183830350156","commenter_b":"Somebody give that girl a sammich!","commenter_a":"Kellyanne looks like she is about to physically break down. I would feel sorry for her, but she brings this entirety upon herself.","post_message":"\"'Alternative facts' are not facts. They're falsehoods.\" Sean Spicer, Conway, and Trump tried to lie about the size of the inauguration crowd, but Chuck Todd didn't let them get away with it. Shared by Occupy Democrats, LIKE our page for more! Video from Meet the Press."},{"comment_id":"10153465168796162","commenter_b":"She shouldn't have said anything. Should not have been on social media while working.","commenter_a":"It's not racist it's just ignorant, she could have just said these rude people","post_message":"Brookfield Zoo responds after an employee posted what some may call a racist comment on social media... @webpagelink"},{"comment_id":"10153810948993717","commenter_b":"Hillary wants to secure our border now - #TrumpWall - @webpagelink","commenter_a":"Great........I wonder which town he plans on hurting this time, forcing the tax payers to pay for his visit, and extra police security while he's here weather they like it or not....glad to see our state has a say in it......","post_message":"Donald Trump will be back in the Granite State on Monday: @webpagelink"},{"comment_id":"10153181458311336","commenter_b":"leave her with isis now she has become an enemy of this state..to bring her back is only to have join other nuts that are here to do harm to alll ..she wanted to go be with them well let her learn what she goin into maybe that will open other women eyes what isis is about SEX AND RAPE","commenter_a":"Peaceful muslims.","post_message":"\"This is worse than losing the life of a child,\" a spokesman for the parents said."}]
