[{"comment_id":"10153186576481162","commenter_b":"I'm glad she won't be crushing any more babies.","commenter_a":"I happy 4 her but i want to do it with out surgery","post_message":"HALF-TON NO MORE: She is the woman once dubbed the \"Half Ton Killer,\" accused of killing her nephew by rolling on him with her 1,000-pound frame. But after clearing her name, she has a new lease on life, a smaller body, and is motivating others with her weight loss story. AMAZING TRANSFORMATION---> @webpagelink"},{"comment_id":"1740170942902081","commenter_b":"Yeah! Say that to UN! They should go to thoses places rather than bothering Philippines!","commenter_a":"Philippine leader must have nothing better to do... He just want to become famous for a little bit...Do you want to see humans right violations every day? Do you want to see people getting kill by the government? Do you really want to help people because humans right violations?? Go to Cuba!!! Go to Venezuela!!!!!move to Central America!!!! You idiot!!!","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"10153181309551350","commenter_b":"Sebrina Butler cute comments here. Marcella McFadden","commenter_a":"Breast feed, breast feed! Just do it! It's best for the baby's immune system.","post_message":"What do you wish you'd known before you had your baby? Read the top responses so far and join our new TODAY Parenting Team, sponsored by Johnson's Baby, to share your advice. @webpagelink"},{"comment_id":"1129314157104004","commenter_b":"WAKE UP PEOPLE PLEASE","commenter_a":"I did hit like on purpose it was an accident.","post_message":"**Terrorist attack on US Soil! This just in!**"},{"comment_id":"10153707986556491","commenter_b":"Brainless sheep! I like that","commenter_a":"Fabulous, great sense of humor and brains; trump is the icon of decadence under a cheap (very cheap) speech, only brainless sheeps follow him.","post_message":"“I have built a papier-mâché wall for Mexico. It costs $17.99. Fabulous!”"},{"comment_id":"10150802483299999","commenter_b":"Takes one to know one.","commenter_a":"Takes one to know one!","post_message":"Ted Cruz called Donald J. Trump a “pathological liar\" and a “narcissist at a level I don’t think this country has ever seen.”"},{"comment_id":"866645046728578","commenter_b":"an amazing climb","commenter_a":"Liam Boggans","post_message":"Gnarly pictures reveal the toll taken on El Capitan conquerors' hands"}]
