[{"comment_id":"10153933427867235","commenter_b":"Shouldn't she be looking for baby daddy #3 instead of being an idiot?","commenter_a":"Barstool--shut up and go try to figure out who your latest baby daddy is.","post_message":"She said, ‘Not everyone gets a trophy.’"},{"comment_id":"10153422515817235","commenter_b":"There are a good number of female cops killing for nothing.. Just look it up.","commenter_a":"Another petulant, controlling, entitled man killing a woman who told him 'no'. I'm really sick of men behaving this way simply because he can't get his own way. Women do not DO this. Why do men?","post_message":"Protecting and serving the hell out of you."},{"comment_id":"1354573844595375","commenter_b":"wELL LET THEM TERRORIZE THEM AND THIER FAMILIES AND LET'S SEE HOW QUICK SHE REPEATS THIS ASSINIGNE REMARK","commenter_a":"Send these twits over there to give them love and hugs.","post_message":"Oh brother!"},{"comment_id":"957334017635027","commenter_b":"He actually was not shackled. Its amazing how many people read cop blocks statement and dont even watch video or just flat out imagine what your seeing all because cop block intentionally manipulated you.","commenter_a":"Look, whatever the guy was arrested for, it doesn't make it right for that cop to beat on him. Even with the guy getting in the cops face and yelling. It doesn't make it right. The fucking guy is shackled. Cops aren't gods! They have no right to pass judgment and treat you like an animal.","post_message":"POLICE BRUTALITY caught on video! Is anyone REALLY going to try to justify this? From (Y) Counter Current News - MBD"},{"comment_id":"10153086528067061","commenter_b":"Ban idiots. Not guns","commenter_a":"\"Guns aren't the problem - people are\"..nope, stupid freaking people being allowed to get guns seems to be the problem...and it needs to be addressed and remedied. People suck more every dang day","post_message":"DEVELOPING: TV station says reporter and photographer dead after gunman opens fire during live report in Virginia. What we know so far: @webpagelink"},{"comment_id":"10153066110302144","commenter_b":"No, No, No, No, No... You're in OUR HOUSE!","commenter_a":"americans welcome kenya....that kind of hecklessness cant be accepted","post_message":"\"Listen, you're in my house. You're not gonna get a good response from me by interrupting me like this. I'm sorry. No, no, no, no, no. Shame on you. You shouldn't be doing this.\""},{"comment_id":"10154403631241509","commenter_b":"Soooo she will be participating in the great invasion Day for sure then..you people are true life devils and still till this day it shows......GO BACK TO THE CAUCASUS MOUNTAINS !!!","commenter_a":"She's clearly in love haha with money","post_message":"Mariah Carey is set to marry an Australian billionaire."}]
