[{"comment_id":"1090710841025167","commenter_b":"Sanders' wife was not known for \"fiscal responsibility while president of Burlington\" as she allegedly overstated pledge donations while filing a loan with the Burlington Diocese of the Catholic Church and forced them to reportedly eat a loss of up to $2 million. Sanders and Wife Accused of Mishandling Campaign Money @webpagelink","commenter_a":"🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸 🇺🇸🇺🇸Donald Trump For President 2016/2020","post_message":"Iowa may not be on \"Cruz\" control..."},{"comment_id":"10153347624056509","commenter_b":"No.","commenter_a":"Hate crime. obviously","post_message":"Angry family members insist this had nothing to do with a parking spot, and a spokesperson said the suspect had threatened the victims before: @webpagelink What do you think? Share your thoughts in the comments."},{"comment_id":"10154187969491615","commenter_b":"@username 99.9% could be prevented if the women had any morals....","commenter_a":"I hope everyone marching plans on adopting a kid or two. If your so concerned with the baby being born, you should actively participate in rasing it.seeing as the parents dont want to or they would have an abortion. So please sign up at the front entrance and take your unwanted child when you leave. Thanks for keeping kids outta foster homes and orphanages.","post_message":"This year is a historic one as Vice President Mike Pence is spoke during the march. It is the first time a president or vice president has taken part in the March for Life. _____________ UPDATE: (1:35 p.m.) The livestream has ended. Full story on.wpxi.com/MarchForLife"},{"comment_id":"10153328109319087","commenter_b":"@username Let the refugees go fight for themselves.","commenter_a":"When are people going to accept that refugees are not terrorists?","post_message":"President Barack Obama still plans to allow 10,000 Syrian refugees into the country over the next year, despite terrorist attacks in Paris, at top aide said Sunday."},{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"1687479528205826","commenter_b":"You can come to America if you do it legally if you want to go over the wall if there was a wall yes shoot to kill. That will be a deterrent to stop other illegals from trying to do it.","commenter_a":"Yes and shoot to kill anyone crossing from Mexico to the USA","post_message":"Yes, I do!"},{"comment_id":"10153762734254087","commenter_b":"All this woman does is lie her ass off 24/7","commenter_a":"Republican Hypocrisy !!","post_message":"FBI Director James Comey dismissed Hillary Clinton's claim that his agency's probe into her private email server was a routine “security inquiry,\" telling reporters \"I'm not familiar with the term 'security inquiry.'\""}]
