[{"comment_id":"10154477709641729","commenter_b":"True","commenter_a":"Hillary is power hungry and Bernie is actually a communist . Both don't care about the American people.","post_message":"They'd best heed the writing on the wall."},{"comment_id":"10152861667311045","commenter_b":"I don't agree with abortion, but when you have an abortion the baby dies, it's suffering is over. Women who do drugs while they are pregnant can cause problems for these children their entire lives. And we foot the bill for it. They should be charged, never given their kids back and the law should stop having these double standards. And if they didn't cause their kids damage then they still did the equivalent of putting a gun to its head and playing Russian roulette, which would also be child endangerment and child abuse.","commenter_a":"Does anybody find it ironic that they can be charged for exposing their unborn babies to drugs while it is legal for them to kill/abort those same babies? Either unborn babies are people with rights or they aren't. Odd how \"the law\" can have it both ways.","post_message":"Two Shoals women are charged with exposing their children to drugs. Both women are pregnant, and are in the community corrections program. Investigators say the two failed mandatory drug tests."},{"comment_id":"10154159417163797","commenter_b":"Y u hating? Stop trippin & stop actin like a jealous punk. Man, sometimes these women can be straight up fools and want to try ruin something that is a gift for a couple that wanted something so bad and finally god gave that gift. Ezella, being a punk gets u nowhere. Shut up and complain about ur own life princess if u wanna be such a negative Nancy","commenter_a":"He's not crying because he's happy, he's crying because that's his 9th kid & he already owes 30k in arrears. 😈😼🙈🙉🙊","post_message":"TEARS OF JOY: A video of a man bursting into tears when he learns his wife is pregnant is warming hearts all over the Internet. Watch Here:"},{"comment_id":"1020710211322060","commenter_b":"Alexcea Erini Apostolakis bod","commenter_a":"I think the poor girl should be left alone","post_message":"The birthday festivities never end for Kylie Jenner (via Daily Mail Celebrity)"},{"comment_id":"497623757113047","commenter_b":"He doesn't lie almost as much as his father. Considering his age, he and his father are even in the lying department.","commenter_a":"I'd like to have that much nothing.","post_message":"Eric Trump lies almost as much as his father. --Andrew"},{"comment_id":"627774310707730","commenter_b":"Kathleen, you're an illegal alien","commenter_a":"This is very offensive. 1) I am well educated- I even completed a College degree. 2) I am not a racist or a bigot. 3) I love America Deeply and believe in her core principals. I am voting for Trump. I voted for him in the primary's and I will vote for him at the national level if he makes the ballot. I have been a registered Republican Since GW was voted in Office. Now I can agree that Mr Donald Trump can at times speak without discernment; however it is my opinion rather my belief that he is best suited for the position given the day and age we live in. You can not practice Islam without shariah law- they go hand in hand. It surprises me that persons with liberal views- LGBT- Freedom and separation of Church and state- Equality for all races- ages and gender- would open ...","post_message":"Yep."},{"comment_id":"740023432800293","commenter_b":"That is just an act! She could use some for real but that isn't going to happen!","commenter_a":"Your dead soul of an ass shouldn't have constitutional rights either you f*#king hag. Isn't it time for you to leave? Lucifer has GOT to be worried about where his ugly little daughter ran off to.","post_message":"Where's that \"love and kindness\" Hillary is always lecturing Americans about?"}]
