[{"comment_id":"10154209676831336","commenter_b":"Carolyn Ann Banet shut up hoe","commenter_a":"Women are dangerous, no matter what species!","post_message":"Yikes!"},{"comment_id":"10152976534071955","commenter_b":"Bonehead stole Christmas and gave it to the illegals.","commenter_a":"POS!!!","post_message":"PAYBACK: BOEHNER FOES BOOTED FROM POSTS"},{"comment_id":"10153419431089024","commenter_b":"Strange? No. Normal. These two are NOT our Allies.","commenter_a":"they're called \"handlers\", making sure their government's contributions are used wisely.","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10154693491116833","commenter_b":"They know. It doesn't fit their agenda of eliminating ownership.","commenter_a":"When will the liberal anti-gun haters, learn that teaching safety first you will get rid of most of the accidental shootings. It's not the gun it's the person that picks up the gun that is the problem. If you would allow gun safety in the schools, like sex-ed, there would be a lowering in accidental shootings.","post_message":"While Everytown's ad message is all about being and safe with guns, the ad, amazingly, disregards basic fundamentals of safe gun handling. Unlike the National Rifle Association, anti-gun groups don't make actual gun safety training services, for adults and children who want to be and safe with guns available."},{"comment_id":"1375821949123925","commenter_b":"Love and agree with your comment Sandy","commenter_a":"Will not stand for the disrespect and I'm totally disgusted by the inept commissioner. He wanted to fine players wanting to support something positive, Cowboys supporting the 6 policeman killed, but pats Kaepernick and his followers on the back. The entire NFL is ass backwards and I was a huge fan","post_message":"NFL says rating are down because of Trump and 2016 headlines. I think not. Read my op-ed + TAKE OUR POLL: @webpagelink"},{"comment_id":"985323948188437","commenter_b":"Islam should not be in our school systems st all!!!!😯😯😯😯😯","commenter_a":"I don't think that our children need to know a lot about Islam. I think that our children need to be taught about our God - be they Christian or Jewish - also, they need to salute the flag and be educated to know that our men and women have sacrificed so much in order for us to be free.","post_message":"U.S. DEPARTMENT OF EDUCATION: Teachers Should Incorporate Islam In More Subjects"},{"comment_id":"1034412946618453","commenter_b":"Shut up","commenter_a":"The end of life and nature. I miss to see the destination of these individuals and their satanic groups. #SuicideInTheNameOfFreedom","post_message":"Hopefully more players will be encouraged to come out"}]
