[{"comment_id":"470527006471213","commenter_b":"This lady thinks she is the president,this too shall pass just like her food for the kids at lunch time.","commenter_a":"I still want to know who elected the bitch","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"762801500520430","commenter_b":"The poor girl just can't make up her mind, if you want to call it that.","commenter_a":"She is an idiot!! Just like most spoiled rich people!","post_message":"Hypocrisy, much?"},{"comment_id":"10154618806016336","commenter_b":"WHY THE IRAN DEAL IS A MONEY LAUNDERING SCHEME CREATED BY THE CLINTONS AND CARRIED OUT BY OBAMA: Our economy is worth billions if not trillions of dollars, annually. The Clintons are incensed at Americans and think they are trolls or deplorable or predators or worthless. What the Clintons really desire is to add to their greedy pot of wealth built on the backs of slaves; modern day, contemporary slavery which includes a melting pot of all races. TRUTH: Hillary's economic plan seeks to further these greedy ambitions of gain and puts all of America and every American citizen at risk. By allowing an influx of immigrants including the 11 million (maybe astronomically more) to stay illegally, unconstitutionally, your wages will decrease or stagnate while your costs of living rise: You will be forced to compete with these new immigrants for housing, your prices on everyday purchases will rise, over ...","commenter_a":"Trump founded Racist Birtherism","post_message":"A senior ISIS leader was killed earlier this month in a precision strike near the Syrian city of Raqqa, a U.S. official told Fox News."},{"comment_id":"810137155781996","commenter_b":"If we wouldn't have killed them you would be dead by now","commenter_a":"Jebs brother George gave the go ahead to invade Iraq for something they didn't do leading to the death of over 500'000 innocent civilians. Jebs brother George. Jebs brother.......... Let that sink in. 500'000 men, women and children.","post_message":"The Obama-Clinton-Kerry team's stance towards Israel has been a disgrace. I’ll rebuild this crucial alliance."},{"comment_id":"1432027056824713","commenter_b":"PUSSY","commenter_a":"Canada doesn't want these idiots any more than we do.","post_message":"Progressives always break their promises."},{"comment_id":"864428380327492","commenter_b":"Ruth, you're an idiot.","commenter_a":"Just proves they hate women and wish we were their slaves ... can't believe we have to fight for human rights for women still .. please tell me why anyone voted for this disaster","post_message":"Republicans will move to strip all federal funding for Planned Parenthood as part of the process to dismantle Obamacare, House Speaker Paul Ryan said"},{"comment_id":"10153133818461491","commenter_b":"Feminazis are the worst. Impossible to be around.","commenter_a":"Lame. I support women and women rights. But, the so-called feminism movement is not attempting equal rights, rather, they think women are superior to men. Everything about the femisnism movement is ironic and does more harm than good.","post_message":"Stephen Colbert is a feminist."}]
