[{"comment_id":"1353532451354276","commenter_b":"Said the blond headed, blue-eyed white woman.","commenter_a":"I am so sorry if this happens, your fear, only because your skin is darker than mine. But I kinda think all of this has happened to white skinned people as well. If we could all walk argh nd inside out we would see assholes right up and recognise good when we see it. Its not about race for everyone. Some of us see us all as people!!!","post_message":"This man shares his haunting testimony: He too is afraid of being killed by the police. (via KevOnStage)"},{"comment_id":"1164891623572953","commenter_b":"No Obama, is a Muslim and I say screw all Muslims!! Trust No Muslim Ever!! Remove all Muslims from the United States. Trump, 2016, for 8 years!!!!","commenter_a":"Hell NO","post_message":"Another Muslim Holiday, And another Speech From Obama Greeting Them... Obama said he sides, with Muslims, maybe he should side with America FIRST! Do you side with muslims? take our poll!"},{"comment_id":"10153018871246130","commenter_b":"Lesbian porn is boring. Girls that don't have the slightest clue as to how to thrust their hips.","commenter_a":"Men say \"fucking disgusting\" then get their morning jerk off to lesbian porn.","post_message":"How adorable is this?"},{"comment_id":"666551896811325","commenter_b":"Nah send the atheists and liberals and dems over to beg for coexistence. Please !!!","commenter_a":"I want all liberals to go meet isis and propose there coexist mantra. All of them! Now please!","post_message":"I am begging liberals to understand this!"},{"comment_id":"1054288197942749","commenter_b":"Even if that is the case (and that is some BULLSHIT) that is not what the feminist gender gap argument is all about. What happened to you is illegal, what THEY are bitching and whining about is NOT, nor should it ever be.","commenter_a":"And many women support kids on what they earn while the fathers of their children do no pay child support. Talk about discrimination!","post_message":"BOOM!"},{"comment_id":"10154029757858132","commenter_b":"Wow. You ladies are some different kind of stupid","commenter_a":"Breastfeeding in public is fine but cover up, no one wants to see you whip your boob out in the middle of their lunch in a restaurant.","post_message":"This mother refuses to be shamed."},{"comment_id":"10152777855631717","commenter_b":"Totally disgusting, the bastard should be locked up for life!","commenter_a":"Are you serious? Time to pull them off the bench!","post_message":""}]
