[{"comment_id":"1754483651501060","commenter_b":"When they take our gun rights away, what are we to protect ourselves with when evil terrorist get guns off the black market? And don't people see that more people are killed by drugs and drunk driving in America than by people shooting others? They just want to take our rights away!!!","commenter_a":"Barbaric!!","post_message":"Watch Rep. Louie Gohmert shout \"radical Islam\" at House Democrats who were staging a sit-in on gun control. @webpagelink"},{"comment_id":"927281534054105","commenter_b":"He doesn't belong in America!!!! Get out Obama!!!","commenter_a":"He is a traitor and should be impeached.","post_message":"This is seriously outrageous."},{"comment_id":"10154480756700399","commenter_b":"I really thought republicans were smart enough to see that Trump was a racist with a corrupt moron compass, and a rapist.... I was wrong the Republican Party just embarrassed the world","commenter_a":"No, there won't be a gap; there'll be a canyon.","post_message":"\"It’ll be just fine. That’s what I do. I do a good job,\" Trump said while discussing his plan to replace Obamacare. \"I know how to do this stuff.\""},{"comment_id":"1071265242982572","commenter_b":"Do NOT be BLINDED people for it won't be long before they find a way to seize everyone's guns- THAT'S WHAT THIS IS TRULY ABOUT- SMH","commenter_a":"You are representing terrorists","post_message":"Attorneys for the family of Keith Lamont Scott hold a news conference."},{"comment_id":"1787494751536145","commenter_b":"Such a whiner just give me a bottle of wine so I can shut the hell up","commenter_a":"Compared to what we have had the last eight years if Nixon was running I'd vote for him","post_message":"Clinton's running mate says Trump is even worse than President Nixon because he won't release his tax returns. Is he right?"},{"comment_id":"10153949955984454","commenter_b":"Chicks with green dresses","commenter_a":"What is wrong with this pipeline? Pipeline are the safest way to move oil and natural gas. And the least destructive to the environment. Most of the land recuperates in a few years.","post_message":"An expanded Alberta Clipper pipeline could send up to 880,000 barrels per day of toxic oil from Canada's Alberta tar sands into America's heartland even more than #KeystoneXL. Tell Secretary of State John Kerry to block the Alberta Clipper pipeline: @webpagelink"},{"comment_id":"10153509849905329","commenter_b":"Get a grip lady","commenter_a":"Caitlin didn't choose to be born feeling like she was in the wrong body. She's not getting the award for getting surgery, she's getting the award for standing up in a bigoted, judgmental, harsh world and being her authentic self. She is giving hope and courage to thousands of transgender people all over the world and showing them it's OK to be themselves. Who knows how many people she is saving from suicide by being strong enough to go public and be treated with ridicule, ignorance, and hate. She's making a tremendous impact on the LGBTQA community. Courage comes in all forms. Are only the military and first responders allowed to show courage? Is that the only type of courage we're allowed to recognize? I choose to disagree. Of course Noah is courageous, no one is saying he isn't. Of course every member of our military is courageous, but that ...","post_message":"ESPN confirmed to BuzzFeed News there is no such thing as a “runner-up” to the Arthur Ashe Courage Award."}]
