[{"comment_id":"1786615071570542","commenter_b":"Send them to Cuba , please. We do not want them.","commenter_a":"We dont really care what you think John Legend!! Why dont you, Colin, Beyonce, Kanye, Will & Barbara & all the other negative so-called celebrities move to Canada or Cuba & give us Americans a friggin break!!","post_message":"Singer John Legend also tweeted that the Star Spangled Banner is \"weak.\" @webpagelink"},{"comment_id":"10154083249768984","commenter_b":"you bitch you took away something that is all American and turned it into a race baiter bunch of bullshit you and jazeeee suck please move","commenter_a":"behind the sheriffs all the way! DISGUSTING, RACIST, C!","post_message":"When these sheriffs saw what Beyonce was doing in front of the biggest TV audience of the year, they knew there was only one thing they could do... Do you support these sheriffs?"},{"comment_id":"10154517988145329","commenter_b":"Stfu!!","commenter_a":"@username I found a picture of me when I wake up in the morning.","post_message":"??? (via So Relatable)"},{"comment_id":"420582524733009","commenter_b":"No lying Bitch will run this Country!! You will be heavy investigated about all this money you have.","commenter_a":"No they never do on the left !!","post_message":"Is the press giving this enough attention?"},{"comment_id":"882901261808481","commenter_b":"Wow. It's just a military organization, and not a very good one. Your fear is irrational and betrays you, allows you to be easily manipulated.","commenter_a":"Ok. These are Islamic extremists who believe that death in the service to their religion is the highest honor they can achieve. I'm fairly certain they've got some kind of contingency plan in place in event that their current leaders achieve \"martyrdom\". I'm just going to put that out there. \"We've killed more of their leaders\". So what? They want to die. They're promised 74 virgins in the afterlife. I'm absolutely positive there are plans in effect to appoint successors to those leaders who are destroyed.","post_message":"U.S.-led forces have killed 10 Islamic State leaders in air strikes, including individuals linked to the Paris attacks."},{"comment_id":"10154931929434641","commenter_b":"Lickass, lickass, lickass from Sri Lanka.","commenter_a":"CNN offered a lot of 'fake news; and 'alternative facts' about Hillary and \"fake polls\" showing her victory.... Mainstream media has lost its credibility.... You cannot stop Trump getting elected in 2020 either","post_message":"\"Alternative facts aren't facts, they are falsehoods.\" - Chuck Todd In an interview on NBC's \"Meet the Press,\" Trump senior adviser Kellyanne Conway said White House press secretary Sean Spicer's false claims about the size of the crowd at President Donald J. Trump 's inauguration were \"alternative facts,\""},{"comment_id":"1212525308785662","commenter_b":"HILLARY GOING TO PRISON. NA NA NA NA NA!","commenter_a":"Trump Pence 2016 Make America Great Again","post_message":"On Friday, FBI Director James Comey bowed to partisan pressure and released a vague and inappropriate letter to Congress that only serves to give Republicans a new line of attack against Hillary. Here's what we've learned from news reports: The emails may not have been to or from Hillary. The emails weren’t even ever on her server. The FBI case has not been re-opened. HFA Press Secretary Brian Fallon breaks it down."}]
