[{"comment_id":"605117769694222","commenter_b":"WE DONT BUY IVORY PERIOD!!! WE NEED TO BOYCOTT CHINA ESPECIALLY AND DONT EVEN BUY DOLLAR STORE THINGS THAT ARE MADE IN CHINA!!! IVE BEEN TO HONGKONG AND TAIWAN IN 87. SAW MEGA IVORY BACK THEN👿💔👹 FOR SALE! NOTHING HAS CHANGED! CHINA HAS NO PUNISHMENT! AFRICAN COUNTRIES NO TRADE PUNISHMENT! EVENTUALLY THE COUNTRIES IN AFRICA WILL STARVE OUT IF WE BOYCOTT TOURISM!!!","commenter_a":"Every country involved in the purchase of animal products from Africa as well as gaming in Africa are the reason why we have this problem. It's not only Africa's problem this is a world wide issue. Next time you hear a piano play or go to the pub to play some billiards question what they are made of. Ivory poaching legally ended in 1989, but the demand will always be there and countries like China and Japan will always buy their way through these bans as long as we keep buying tacky souvenirs from Asia containing Ivory. Education is the key, we have to take an interest and ask what is the item I'm about to purchase made from? This is what we can do to reduce the demand of items made from threatened species.","post_message":"Poachers, beware. These dogs are coming for you from the air. @webpagelink"},{"comment_id":"10154906449059657","commenter_b":"@username, no pics of yourself on your fb? why? you one of those fugly women trump wont touch? or maybe 1 of the low enducated he loves so much for your vote? poor liberal feminist, no body wants you.","commenter_a":"Yes, we all know that. It came from Rubio....why does the media always think that people are complete idiots? We can read, you know. There are tons of legit sites to go to, besides mainstream propaganda sites....","post_message":"Contradicts what his boss is saying..."},{"comment_id":"10153678136737217","commenter_b":"You are falling into the hands of the extreme right wing portraying themselves as, \"for the working class.\"","commenter_a":"Voting out because the EU is corrupt. This country full and we should trade with the world. And I don't wont to be under a dictatorship . If it was not for the dedication of the doctors and nurses the NHS cant cope with demand .schools need a teacher. And two teaching assistants .not enough. Housing. And foreign criminals cant besent back","post_message":"What does Brexit mean? And who will be able to vote? Nine days before #EUref, here's a guide about some of the key questions."},{"comment_id":"10153706992631955","commenter_b":"Let's bpmb those fagots.","commenter_a":"The machine that makes invincible passports! We must take it for the empire!","post_message":"ISIS May Have Passport Printing Machine..."},{"comment_id":"993063080750221","commenter_b":"Biden's coming in! you lose, Hillary.","commenter_a":"backwards is thinking that butchering a live baby in the womb is ok to do.","post_message":"In this week's Facebook Q&A, Hillary took on Jeb’s claim that Democrats use \"free stuff\" to appeal to minorities."},{"comment_id":"963694916975312","commenter_b":"Actually, Pro-Life is fighting for the rights of unborn females while Pro-Choice believes that unborn females have no worth. If anybody is hating women, it is those who don't mind if they are killed while still very young.","commenter_a":"go ahead and have your abortion if you want it, but one day the consequences will come back to you, there are consequences to everthing","post_message":"\"People need to know that women have abortions every day and they go on and live their lives”"},{"comment_id":"10153983597909726","commenter_b":"ugliest face on the planet,put the bitch in shackles","commenter_a":"It puts them under oath and on the record and if any take the 5th it'll hurt Hillary even more, especially with Independents and Undecideds.","post_message":"Hillary Clinton's aides will be questioned on emails by the U.S. State Department. Will this make any difference?"}]
