[{"comment_id":"10153606515353132","commenter_b":"She was annoying to watch.","commenter_a":"Brandi was the only person who made the show entertaining #BadMoveBravo","post_message":"Will you miss Brandi on The Real Housewives of Beverly Hills?"},{"comment_id":"1213366555426261","commenter_b":"More illegals equates to more democratic votes due to the dreams of entitlements and riches. Look at California (seems to start on the west coast), they are making it as easy as they can to give illegals the opportunity to vote...they even have a few illegals in city government! More democratic votes keep Dems in power, which means more taxes from the middle class which eventually places people closer to poverty...which places more government control over it's citizens...Hence the \"Democratic Agenda\". That \"Agenda\" puts us that much closer to the \"New World Order\"!!! Guess who would be the leaders of the \"New World Order\"?","commenter_a":"#TrumpOnTrumpingOn2016! BREAKING NEWS: \"Reince Priebus, Paul Ryan, Karl Rove, Stealing RNC Donation Money\"! ~ Hon. Roger Stone","post_message":"A country that for generations saw millions of its citizens cross into the U.S. is suddenly telling its southern neighbors they can no longer do the same."},{"comment_id":"10153067823099411","commenter_b":"My respected fellow u explain very nicely like a poet and blame to muslim now one question who attack on Afghanistan who is killing innocent people in Pakistan by drawn attacks who is killing Muslims in burma. who is killing Muslims in Africa,and one thing listen Islam is the religion of peace not terror first study islam than make justice infront of me 10 cristians got Islam its not the issue main point is that dont try to impose religion war make the world peaceful place not hell thank you","commenter_a":"Copy and paste this on ALL muslim stories! Flood them with the truth! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Muslims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were ...","post_message":"Hundreds of thousands have flooded the streets of Chechen capital of Grozny in a rally against the publication of the Prophet Muhammad by Charlie Hebdo magazine. The demo, dubbed to Prophet Mohammed, was organized by region clerics and united muslims from various regions of Russia."},{"comment_id":"10153986690345329","commenter_b":"Sebastian Franklin my hand on the way to the clippers game on the bus","commenter_a":"@username you","post_message":"You're not alone."},{"comment_id":"960686434063090","commenter_b":"Get her outta here!","commenter_a":"Take her off the air she is a bigot also joy you can see the hate in her face when President Trump is mentioned","post_message":"Whoopi Goldberg has been relentlessly gunning for Trump. He's had enough, and so has America. Should Whoopi Goldberg be kicked off TV forever?"},{"comment_id":"10153539858966943","commenter_b":"Remove them all and start over!!!' No one connected in anyway to ANY family ties whatsoever should be allowed to remain in office ... Mass re-election for both democrats and republicans!!! These people are not American to continue sabotaging the hard working people of America! I don't go to work to pay tax to support ILLEGAL aliens!!!!","commenter_a":"take care of our unemployed that you as president have created then you might leave a legacy dumbass","post_message":"Next week the U.S. Equal Employment Opportunity Commission will sign a deal with Ecuador to Ecuadorian nationals with information, guidance and access to education and training resources to help them exercise their workplace rights. SHARE if you think the federal government should help American workers - not foreign workers!"},{"comment_id":"10153776630979714","commenter_b":"Woman here. Would never get an abortion myself, but don't want to impose my beliefs on others so if others want to abort, go ahead. I do not feel the American tax payers should have to fund others abortions, though.","commenter_a":"You have no place to discuss abortion or planned parenthood unless you are a female.... If you're a man, shut the hell up because most of you cant even tell me how many days are in between menstral cycles.","post_message":"Do you, Lena Dunham."}]
