[{"comment_id":"10153556232516162","commenter_b":"Wtf","commenter_a":"Merdith V Marin","post_message":"WHAT THE HAY? Caught on video by undercover cops, Michael Crawford told investigators that for 35 years he's been traveling the country having sex with horses... @webpagelink"},{"comment_id":"10153519311713984","commenter_b":"you do see there is a white girl sating beside her and a couple of white boys with phones videoing they need to have there butts kicked","commenter_a":"This president is ramping up the racial discord for a reason, and it's not going to be good.","post_message":"A white woman was holding her toddler and minding her own business... but then this black teenager saw her and did something awful. The entire scene was caught on video... can you guess why Al Sharpton isn't saying anything about this?"},{"comment_id":"10152906344266717","commenter_b":"#BullShitAssHole","commenter_a":"hater!","post_message":""},{"comment_id":"10153722896533690","commenter_b":"How Iran can Accept refugees while Iran is very poor country and its people are migrating to Europe","commenter_a":"Europe is christian place so send rufugees there,, iran is a shia muslim country, so send refugees there. Why don't you send these refugees to sunni dominating countries like pakistan, turkey??????","post_message":"Opinion: \"Of the more than four million Syrian refugees, almost half of them, the largest concentration, have gone to Turkey. In addition to Turkey, Camp Zaatari in Jordan has received tens of thousands of Syrian refugees. There are also Syrian and other refugees scattered throughout the Arab and Muslim world, particularly in Lebanon. There is one glaring case of a Muslim country that is heavily involved in Syria but has yet to accept a single Syrian refugee, and that is the Islamic Republic of Iran.\" Hamid Dabashi, Hagop Kevorkian Professor of Iranian Studies and Comparative Literature at Columbia University, writes for Al Jazeera."},{"comment_id":"1649676571963807","commenter_b":"Oh no she didn't, hand of God should of slap her head...","commenter_a":"I'm very proud of you and the stand you are taking for your Savior. Stay strong, and God bless.","post_message":"Teacher Demands Christian Boy Surrender His Bible, He Says No, See What Happens Next Good for him. Let's show this young Christian our support. Can we get 30,000 'LIKES' for his refusal to surrender his bible?"},{"comment_id":"10153562599204087","commenter_b":"#DumpTrump","commenter_a":"cruz your a fool the media has been trying to destroy trump and help you. cruz you are stupid","post_message":"“Every accusation you raised is incorrect,” Ted Cruz told Fox News host Chris Wallace when asked about his campaign’s role in spreading falsehoods about rival Ben Carson in Iowa. “I appreciate you reading the Donald Trump attack file on that.”"},{"comment_id":"1624969957723265","commenter_b":"That poor little girl. Her mother could have killed her driving around while heavily intoxicated. She clearly had time to buy and drink alcohol but not make sure there was food in the house???","commenter_a":"Don't have any sympathy for a mother that drives drunk with a child in the car. She could have killed her or someone you love. She should lose custody of the child.","post_message":"If you have blood flowing through your veins this video should make you furious! Watch it HERE: @webpagelink"}]
