[{"comment_id":"10152966322040047","commenter_b":"CRIMINAL","commenter_a":"Next they sell them for food ingrediants!!","post_message":"Planned Parenthood continues to defend its ghastly operations. Abortionists have confessed to changing their practices in order to harvest more body parts. Sign and Share our petition - demand that Congress further investigate the abortion giant and end the sale of babies' body parts."},{"comment_id":"606394809493701","commenter_b":"Wish they would come here n do that to woman who use lil kids as weapons against their Dads .","commenter_a":"Christians werent complaining when they wiped out the indians or burned people in the south","post_message":"Show this a liberal."},{"comment_id":"10152906344266717","commenter_b":"#BullShitAssHole","commenter_a":"hater!","post_message":""},{"comment_id":"1015490965174099","commenter_b":"It takes a woman to clean up a big mess! I think she can do this!","commenter_a":"As usual, I am sure this is Not a accurate statement, as you have to factor in suicide and accidental shootings.","post_message":"Since the last #DemDebate, nearly 3,000 people have died from gun violence in the United States. It's time to act."},{"comment_id":"10152945596811336","commenter_b":"most schools require children to be up to date on vaccines - if you want to enroll kids in school it has to be done. But it does need to be a parent's decision- there might be extenuating circumstances where they chose not to.","commenter_a":"When commenting on a liberals post, check your grammar and punctuation carefully because that's the only comeback they've got.","post_message":"Sen. Rand Paul got a booster shot just a day after he injected himself into the national vaccine debate: @webpagelink"},{"comment_id":"981141605287036","commenter_b":"She belongs in a freak show. Why do people do that to their self.","commenter_a":"How disgusting I wouldn't hire you","post_message":"Americas Freedom Fighters"},{"comment_id":"10153899931145575","commenter_b":"Wow, I wonder how many high school graduates are up in here!","commenter_a":"Now his voters will get behind the only true conservative in this race, Ted Cruz. This is not good news for Trump.","post_message":"Breaking: Rubio Drops After Florida Defeat..."}]
