[{"comment_id":"1133469633342492","commenter_b":"Women's bathrooms have that too bc some haven't mastered the art of hovering. Then add on period stuff.","commenter_a":"Joke's on you, pal. Men's public bathrooms are usually pretty disgusting.","post_message":"This. Is. AMAZING."},{"comment_id":"1809962622565411","commenter_b":"Yeah, they need to kill all of them. If only they would turn our troops loose, so they could get the job done.","commenter_a":"Go for it.","post_message":"U.S. Pilots Bomb ISIS, Killing 40 Jihadists. They need to be destroyed. Do you support our troops?"},{"comment_id":"1279396932093344","commenter_b":"This is why I hate narcan","commenter_a":"Horrible heroin.","post_message":"\"This child can't speak for himself but we are hopeful his story can convince another user to think twice about injecting this poison while having a child in their custody.\""},{"comment_id":"10153757618426336","commenter_b":"You're a complete @$$hole !","commenter_a":"Hey Campus Employee where are you going to? I'm going to Disneyworld (Suckers!!!)","post_message":"Kathryn Thompson, who works the night shift at an on-campus coffee shop, has always dreamed of taking her autistic grandson to Walt Disney World."},{"comment_id":"10153492097934170","commenter_b":"Two F'n losers.","commenter_a":"There is a serious lack of testicular fortitude between those two!","post_message":"I'm very disappointed in the King v. Burwell ruling, but we shouldn't be relying on the courts to get rid of ObamaCare anyway. Here are the guys who need to do it."},{"comment_id":"714918215322687","commenter_b":"BUILD THE WALL","commenter_a":"Trump/Pence 2016... Enough of corrupt establishment politicians.","post_message":"Live: Donald J. Trump holds a rally in Manchester, New Hampshire."},{"comment_id":"971579579554776","commenter_b":"Trump.. love him","commenter_a":"The hugs he remembers were on September 11th? I believe what rand Paul was talking about was when New Jersey got slammed with a hurricane and he was thanking Obama for sending assistance so quickly. That isn't anything more than being an adult professional. Something 99% of republicans are incapable of being.","post_message":"ICYMI: Here are the top moments you were talking about during the #GOPDebate. Who do YOU think won? @webpagelink"}]
