[{"comment_id":"10152850866306051","commenter_b":"susie you didnt read so shut up u dumb bitch","commenter_a":"What does the kind of dog have anything to do with insurance.","post_message":"When the insurance company found out what sort of dog this woman had, they told her that her claim would be denied."},{"comment_id":"10153279079299170","commenter_b":"With so many illnesses she has claimed, she must be unhealthy in the brain!! We already have one of those we don't need another one!!","commenter_a":"islamofascists have no respect for women, including Barry O. How could they have any respect for Hillary?","post_message":"If Hillary's such a precious little snowflake that Rand Paul is supposed to treat her with kid gloves, how is she supposed to deal with Putin, ISIS, The Norks, Iran, Asaad, Cuba, China, etc?"},{"comment_id":"1202509189764740","commenter_b":"It's always about me Me ME!","commenter_a":"cause i aint dead and after 38 years you cannot make me a beater to be dead after 38 years and with mama rosa's paperwork","post_message":"One thing he doesn't say, is \"victory.\""},{"comment_id":"10153221947888984","commenter_b":"I pray Bibi wins. I believe he will, because if the Lord is on your side, who can stand against you?","commenter_a":"Please vote wisely Israel; the world needs Bibi to lead in the fight against Iranian nukes. Our administration won't, so we need you to lead the free world.","post_message":"It's down to the wire in Israel, as anti-Bibi Obama keeps a close eye on critical elections there. Do you support Bibi Netanyahu?"},{"comment_id":"10154590709007955","commenter_b":"Of course. He has already done a lot for the USA. Keep going President Trump. Pay no attention to the meaningless leftists.","commenter_a":"absolutely","post_message":"Do you think Americans need to give Trump more of a chance to succeed as president?"},{"comment_id":"10153143993045329","commenter_b":"That poor girl would eat both of you.","commenter_a":"@username @username Gerard Bravo 'Plus size' is where it's at.","post_message":""},{"comment_id":"10154075665287377","commenter_b":"Denounce your US Citizenship,,proclaim illegal alien status anf receive FREE Medical from the Government!!!!","commenter_a":"Can't repeal it fast enough for me! My own insurance costs went up 700 bucks once Obamacare kicked in. Seems I'm paying for some family that can't afford their own insurance. Well... I can't afford their insurance either!","post_message":"Sen. Rand Paul slammed the Affordable Care Act, also known as Obamacare, saying Congress will, \"as its first course of action, vote to repeal Obamacare. It cannot happen soon enough.\""}]
