[{"comment_id":"1011635065552183","commenter_b":"Are you surprised by this woman's corruption? She should be in jail with the other corrupt politicians. Wonder what she'd look like if she didn't have access to plastic surgery for a couple of years.","commenter_a":"this woman should be took out and shot for all the corrupt things she has done ,, and throw in her friend Dirty Harry Reid also ...","post_message":"Here's Nancy Pelosi real \"war on women\""},{"comment_id":"766086360248608","commenter_b":"Because he hits women! He is no man!","commenter_a":"This punk need to be behind bars in jail lock him up.","post_message":"Rapper Chris Brown Blasts Trump And Police: \"F*** Trump And F*** The Pigs\" This punk needs to learn some respect. Can we get 30,000 'LIKES' to have him deported?"},{"comment_id":"10152865807076051","commenter_b":"This was set up by this girl and her friends - she made sure her friend was there with the video going b4 she hit the other girl-she needs to be put away for a long time and have her sorry ass beat in prison and see what a REAL asskicking is. I hope the victim doesn't get scared and not proceed with the charges.","commenter_a":"we can thank our president and people like al sharpton for all of this they have done as much as possible to entice race wars!!!","post_message":"A girl was at the park with her little brother when all of a sudden they were attacked. The little boy tried to stop the beating – but that just drew him into the line of fire."},{"comment_id":"1633238976976440","commenter_b":"Debate is good!!! It means they're taking an interest in politics! I don't agree with the shirt but how can you be a 'free country' and yet ban a tshirt ? The teen has a right to free speech","commenter_a":"No keep it on, this is a good learning experience for them to do research and compile facts to rebut the shirt. In fact if she wants to wear that shirt she should have to make a presentation showing fax and citations from non-biased source is why she thinks it's true!","post_message":"The teen said she was asked to take the shirt off after it sparked a debate in class."},{"comment_id":"10153834062371337","commenter_b":"You win the Internet today!!!","commenter_a":"Well, maybe when they introduce an HIV vaccine, she can get vaccinated.... Oh, wait...nevermind.","post_message":"Jenny McCarthy is not taking the Charlie Sheen news well..."},{"comment_id":"10152513756410927","commenter_b":"e is talking about his leader Satan","commenter_a":"Ha! The blind leading the blind. Schmuck. “This I say therefore, and testify in the Lord, that ye henceforth walk not as other Gentiles walk, in the vanity of their mind, Having the understanding darkened, being alienated from the life of God through the ignorance that is in them, because of the blindness of their heart:” Ephesians 4:17-18","post_message":"Obama says he has sought God's guidance in leading nation..."},{"comment_id":"1226253117412922","commenter_b":"White peoples God George Soros funds these riots !","commenter_a":"If there is any one in the car, it is also attempted murder, and MUST be prosecuted.","post_message":"Nails it!"}]
