[{"comment_id":"1072924802728530","commenter_b":"So your saying, that I'd have a needle put in my eye for something that wouldn't be used since I sleep when it's able to use.... interesting....","commenter_a":"@username .. hackers never stop ... xD","post_message":"Who wants to be able to see in the dark?"},{"comment_id":"10153029424263445","commenter_b":"You're a stupid ass welfare bitch. I can tell by your reaction","commenter_a":"Fuck you. You can't dictate what people do with their money. Plus, how do you know they don't have a kid with an awful disorder that benefit from pot? Your ignorance is showing. Check your privilege.","post_message":"ICYMI - Colorado Bans Use of EBT Cards at #Pot Shops"},{"comment_id":"10154836011454641","commenter_b":"Muslims should be exterminated..ambassadors of evil!","commenter_a":"And now he funds terrorism, giving weapons to the same people that have just been found to of made a mass grave in Aleppo of civilians. Scumbag.","post_message":"He was broke after running a losing campaign, his credit card was declined and he was quickly losing hope on pursuing a career in politics."},{"comment_id":"10153340865359087","commenter_b":"MONEY KEEPS U OUT OF JAIL QUILTY OR NOT u can make bail u are out","commenter_a":"Don't want to go to prison, don't break the law. It's that simple!","post_message":"“It is wrong for corporations to be making profits from the incarcerations of their fellow Americans,” Bernie Sanders said. “I want to see incentives to get people out of jail or prevent people from going into jail.”"},{"comment_id":"484296231775664","commenter_b":"Leave alone!","commenter_a":"Our flag is fine the way it is. If you don't like you may leave. Be careful the door doesn't hit you in the butt on your way out.","post_message":"Men and women have died defending our flag, don't mess with it. Do you think the flag should be left alone?"},{"comment_id":"1241511662632276","commenter_b":"Send his ass to jail","commenter_a":"Send him to jail","post_message":"This thug-in-training tried to act tough by sucker punching this white 12-year-old boy with a pair of brass knuckles. Too bad for him the District Attorney didn't think his brutal assault was as funny as he did... Now he's going to see what the real word is like! SHARE and let us know what you think should happen to this thug-in-training! @webpagelink"},{"comment_id":"10152923328206051","commenter_b":"Screw you bitch.","commenter_a":"It don't count it was just a dog.","post_message":"This guy knew his injured neighbor couldn’t take her dog out for a walk, so he offered to. While the two were out, he killed it with an ax. Guess how much jail time he got. Wrong. Less."}]
