[{"comment_id":"1675801449377863","commenter_b":"Better yet: Buh bye racist ahole!","commenter_a":"Buh bye, racist!","post_message":"Serves him right."},{"comment_id":"496205537248565","commenter_b":"@username OK crazy lady, you might need some medication","commenter_a":"I'm a full supporter of Bernie but I'm guessing he is done?? If so I'll have to support Clinton. One I support Democrats. Two. Trump is a disgusting fraud who makes us look horrible. So if it comes down to Clinton and trump VOTE CLINTON!!!","post_message":"Thank you, Ohio."},{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"10153312839004203","commenter_b":"No way she's a stupid bitch","commenter_a":"You'd rather have Rand Paul , Jeb Bush or Ted Effing Cruz? Really? GO HILL!","post_message":"This is it."},{"comment_id":"1183208918440780","commenter_b":"Stupid women. I'm one but Savannah is a regular person, comfortable in who she is. Why must she have makeup on after just having a baby. I'm not going to criticize her for that. Some people just don't know where their nose ends. Leave peoples' business alone. Who are you to make it your business?","commenter_a":"Seriously? People care whether or not she's wearing makeup? Giving birth is one of God's greatest gifts and I doubt He - nor Savannah's precious baby- cares about her beauty routine.","post_message":"\"We don't need any 'tips' on how to look good without makeup. We all look good without makeup. We just don't realize it until we realize what life is truly about.\""},{"comment_id":"10155132618144885","commenter_b":"@username CA would be in a lot less debt if they kept their own revenues. CA ranks as 46/50 in dependent states in the US. They give more than they get.","commenter_a":"What are these liberal agencies and locations going to do without Federal Funding? This is a direct threat from Trump. From what I've seen from him he keeps his word. Places like Chicago are going to be in a world of hurt without federal money.","post_message":"Chicago Public Schools has instructed its principals not to let federal immigration agents inside district buildings without a criminal warrant."},{"comment_id":"1003748633011864","commenter_b":"Gurmeet.... YOUR POINT IS MOOT.","commenter_a":"Things that make you go Hmmmm???? Curious how some women would vote for a candidate, that said he would date his own daughter if they weren't related. And said he was waiting fro her breasts and ass to blossom when she was younger.","post_message":"In one of his most overt efforts to reach out to the critical Latino voting bloc, the presumptive Republican presidential nominee Donald Trump wants to address a meeting of influential evangelical Hispanics this weekend hoping to draw their support this November. Do you believe this gesture is sincere?"}]
