[{"comment_id":"870207206369309","commenter_b":"Congress won't pass it tho, cause big business wants those workers. The chicken and meat processing plants especially. This is by far the best way to stop so many illegals coming, but don't hold your breath till it happens","commenter_a":"Who are the other 39%. I'd like to report them to ISIS...","post_message":"71% of voters said they would be in favor of Congress passing a law making it illegal for businesses to hire illegal aliens. Don't you agree?"},{"comment_id":"1630541213899658","commenter_b":"I TOTALLY AGREE..........ILLMINATE THEM AS SOON AS POSSIBLE..OR they will do it to YOU first!!!!!!!!!!!!! They DO NOT NEED to be here in the US of A but ONLY TO KILL MORE Americans.shoot first ask questions later.","commenter_a":"Dang, I need to get out of this hell hole state of celebrity librals and move to Texas where leaders are more concerned with the safety of our nation and not the designer dress to wear to the next award party.","post_message":"Get em' Sheriff... This is why you don't mess with Texas."},{"comment_id":"1598021397151640","commenter_b":"At least God is doing something to help with the immigration problem.","commenter_a":"He is a wonderful god","post_message":"WHOA!"},{"comment_id":"386555874837702","commenter_b":"You obviously know nothing about the economy or laws or Russia in general...","commenter_a":"Its nice to see that thier prioritizing With all that going on with thier financial collapse and war in the Ukraine They have made driving xdressed a precedent Just curious... How would one know that the driver is a pyromaniac Will he be the one with the lit flare out the window???!!","post_message":"\"At first glance, it already appears absolutely absurd.\""},{"comment_id":"10154234015931337","commenter_b":"You poor ignorant cunts...","commenter_a":"Howard Stern's Face is a roast all in it's own. Those giant dentures, cheap wig, and dick nose.","post_message":"FROM GIRALDO TO JESELNIK... These are the most vicious roast takedowns of all-time.'Comedy Knockout' premieres tomorrow on truTV at 10:30/9:30c. @webpagelink #ad"},{"comment_id":"10153171170386051","commenter_b":"Nasty ugly bitch","commenter_a":"What a sick bitch","post_message":"Police showed up at this woman's home only to find her young grandson naked. They asked him what was going on - and that's when he broke down."},{"comment_id":"524517941072119","commenter_b":"This is USA .Muslims can eat pork and go to hell.","commenter_a":"Yall think they are pissed now ????? we aint done with them yet, still gotta play Cowboys and Muslims and then those who are left get to play the part of the Mexican Army at our reenactment of the \":Battle of San Jacinto\" although this time we aint takin prisoners ... Remember the Alamo !!!!!!","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy. Let them be angry. This America and if you don't like it, get out. Do you agree that Muslims should assimilate or leave?"}]
