[{"comment_id":"10154037628650672","commenter_b":"Even the illegal/undocumented immigrants are human beings. Everyone deserves a chance at safety.","commenter_a":"This doesn't effect law abiding citizens!!! Immigrants are safe!!! People who are here illegally are the problem!","post_message":"Mayor Bill de Blasio is addressing the media in the wake of President Donald Trump's executive order to strip federal funding for so-called sanctuary cities."},{"comment_id":"10154099616106162","commenter_b":"I thought it was hilarious","commenter_a":"Double standard. If the tables were flipped we wouldn't even be allowed to mention a lack of caucasians without protests and al sharpton crying on tv.","post_message":"What would this year's Best Picture nominees look like with black actors? Chris Rock, Tracy Morgan and Whoopi Goldberg gave us a (hilarious) idea."},{"comment_id":"907290132700573","commenter_b":"Grossly misinformed woman, too.","commenter_a":"You reap what you sow, so when your harvest comes in, don't be crying cause it ain't what you wanted. You sow perversion & corruption, you will reap your harvest.","post_message":"Will marriage equality really kill people, cause 900,000 abortions and undermine heterosexual men?"},{"comment_id":"1191540644208167","commenter_b":"Two lesbians using sperm, fornication and evil","commenter_a":"Does this mean the she he cheated on the female? I mean someone had to party load in that right?","post_message":"Fernando Machado and Diane Rodríguez announced their pregnancy, believed to be the first of its kind in South America, on social media."},{"comment_id":"10154374594014087","commenter_b":"All other respectable women","commenter_a":"don't grab your pussy hahaha I dought there is a worry there.","post_message":"\"After months of attacks against women and minorities, women grab back.\""},{"comment_id":"807798315963065","commenter_b":"ENOUGH IS ENOUGH, DO YOUR JOB CONGRESS!!!!","commenter_a":"HOW is this legal?","post_message":""},{"comment_id":"588976734614882","commenter_b":"She couldn't sexually satisfy ol slick willy either","commenter_a":"Don't want her in the War Room...Remember Benghazi!!!","post_message":"Ahead of President Obama's speech to the Democratic National Convention tonight, The White House released excerpts touting Hillary Clinton's experience."}]
