[{"comment_id":"10153383704554411","commenter_b":"Examples?","commenter_a":"Texas has always been a disaster.","post_message":""},{"comment_id":"10153279079299170","commenter_b":"With so many illnesses she has claimed, she must be unhealthy in the brain!! We already have one of those we don't need another one!!","commenter_a":"islamofascists have no respect for women, including Barry O. How could they have any respect for Hillary?","post_message":"If Hillary's such a precious little snowflake that Rand Paul is supposed to treat her with kid gloves, how is she supposed to deal with Putin, ISIS, The Norks, Iran, Asaad, Cuba, China, etc?"},{"comment_id":"1805658249719321","commenter_b":"Me muero!!!","commenter_a":"@username tu sueno","post_message":"Watch 23 adorable pandas make their public debut. @webpagelink"},{"comment_id":"1324340430958054","commenter_b":"God will certainly Judge the U.S. for how this country decides to judge and treat people from other countries.","commenter_a":"It's not a forever ban. This is to send a message that we will not let the slightest possibly of another attack. And that if this is the only way then we will do it. We do not hate Muslims. We hate murders.","post_message":"SOUND OFF: President Trump has made a lot of changes this week, and his most recent executive order dealt with immigration. What do you think about his new policies?"},{"comment_id":"1851627945062122","commenter_b":"Rosie would hate it if her wife has a pic out there like Melania's and she were compared to other lesbians, just saying","commenter_a":"Rosie lacks any semblance of class... what a hateful, mean thing to do. Thank you God that Trump is our next president! This left wing ugliness is hard to take..","post_message":"OUTRAGE...! Rosie O'Donnell TWEETS naked photo of Melania Trump when comparing her to other First Lady photos. WARNING: Nudity. @webpagelink"},{"comment_id":"10153200627856130","commenter_b":"She is to good for him","commenter_a":"Hence the \"quiet moment\" part of that headline. Gotta be all up in everyone else's business.","post_message":"The estranged couple were photographed sitting on a beach step outside their Baker's Bay private resort on July 3."},{"comment_id":"1213019208717830","commenter_b":"@username So...a ticket paid for means she can do whatever she wants and not follow rules and regulations. I'm pretty sure it is clearly stated in the paperwork you sign before sailing that you will be left behind if you are not back on the ship on time.","commenter_a":"Horrible. They waited a whole 30 minutes how about waiting til she's back. What if she had been kid napped or in a hospital. No compassion what so ever, makes me sick. If she can see that ship depart they are at fault.","post_message":"A woman looked on with horror as the cruise ship on which she was vacationing left a port in Bahamas, leaving her on the island while her children were on the ship."}]
