[{"comment_id":"10154693491116833","commenter_b":"They know. It doesn't fit their agenda of eliminating ownership.","commenter_a":"When will the liberal anti-gun haters, learn that teaching safety first you will get rid of most of the accidental shootings. It's not the gun it's the person that picks up the gun that is the problem. If you would allow gun safety in the schools, like sex-ed, there would be a lowering in accidental shootings.","post_message":"While Everytown's ad message is all about being and safe with guns, the ad, amazingly, disregards basic fundamentals of safe gun handling. Unlike the National Rifle Association, anti-gun groups don't make actual gun safety training services, for adults and children who want to be and safe with guns available."},{"comment_id":"552998604866610","commenter_b":"How dare you sir!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Another \"unverified story\" from Dr. Carson. Reporters visited the library and the librarian at the desk does not recall the event at all. Never happened! Carson lied and people died!!!","post_message":""},{"comment_id":"10153741817406178","commenter_b":"Hillary is an unclassified POS !","commenter_a":"I think he is smoking crack.........","post_message":"Well I suppose all is forgiven now, isn't it?"},{"comment_id":"969099383223240","commenter_b":"Lock her up !","commenter_a":"there were 2 ac130's in Sicily only 2 hours away that would have wiped the attackers from the face of the earth had they been deployed","post_message":"Every American needs to know this before the election!"},{"comment_id":"10156964298475557","commenter_b":"Unbelievable that she is allowed to be running for president if I did what she did they would have found me guilty and thrown the key away!! To think she could be our president, omg!!","commenter_a":"Political game playing and media bias. This woman should be in prison. Not on a pedestal. She is as corrupt as they come. Why are people so stupid?","post_message":"Hillary Clinton will become the first woman to top a presidential ticket after securing enough commitments Monday from delegates to become the presumptive Democratic nominee, The Associated Press reported."},{"comment_id":"1111126252261565","commenter_b":"Bigger the caliber smaller the cock.","commenter_a":"Maybe she should just use the dildo then relax a little. Nothing wrong with open carry. All of these other campuses getting shot up didn't allow guns and that didn't work either.","post_message":"If this doesn't get people to pay attention to how ludicrous our gun laws are, I don't know what will. - Eric March"},{"comment_id":"10153913650358010","commenter_b":"Male, female, you are still a crazy bitch.","commenter_a":"Bill Clinton is the WHITE BILL COSBY and she is a LIAR","post_message":"We're 309 days away from Election Day."}]
