[{"comment_id":"619645721526492","commenter_b":"I bet this woman also looks good with clothes on (y)","commenter_a":"Please don't take any advise from the Kardashian's. Look at their lives, they have no right to give out advice","post_message":"Would you contour your bum? We're trying out the 3D tan loved by Kim Kardashian West and Olympia Valance"},{"comment_id":"10153480820949726","commenter_b":"Skank whore.","commenter_a":"That song is getting a little old hillary...just like you","post_message":"WATCH: Hillary Clinton targets Wall Street!"},{"comment_id":"1169952976350143","commenter_b":"Nope. I have worked in Criminal Court, and this was battery.","commenter_a":"Yup","post_message":"POLL: Should charges be dropped against Donald Trump's campaign manager Corey Lewandowski? (VOTE NOW)"},{"comment_id":"10153101645216615","commenter_b":"Common Core teaches math comprehension. It teaches students how to comprehend math rather than just memorizing tables. It also teaches students different ways to do math in their heads. I love the \"its dumbing down students\" argument. You, as an adult, cant do it or unferstand, your child can... yet this is making THEM dumber? Sounds to me like its an ego thing. How about you sit there and learn with your child instead of just complaining about it. Take the time to try to actually understand what your child is learning. Why would any parent not want their child to be smarter than they are... why would any parent argue and complain about something that will make their child smarter simply because the parent isnt smart enough to understand it. I have a High School education, no college degree, and i can still understand common core math. Why cant ...","commenter_a":"I love how people bash Common Core without ANY understanding of it at all. I mean, zero comprehension. \"Fox News told me it was bad so it's bad.\"","post_message":"This has been trending -- one dad blasted Common Core with the check he wrote to his child's school."},{"comment_id":"10154285827248701","commenter_b":"Trump build that wall!","commenter_a":"Trump will take care of these ghetto rats . They will be leaving the ghettos to find work so they can eat. Instead of waiting for his kids mothers welfare check .","post_message":"He is the second officer to go on trial for the killing of 25-year-old Gray, who died one week after suffering spinal injuries in a police van last year."},{"comment_id":"10153623967716323","commenter_b":"This is the best thing ever said. Ever.","commenter_a":"Uniting all parts of Yorkshire could be a bad idea. If it took our fancy we could go game of thrones on your arse!","post_message":"\"Pit a bunch of Yorkshire folk against outsiders and they’ll all chunter on about how chuffing brilliant God’s Own County is. Put a Bradfordian, a Sheffielder, a Yorkie and a Leeds lad in the same room, however, and they’ll argue about their football teams, the relative quality of their beer, the beauty of their landscape and women, and everything in between. Often all that will unite them is a shared disdain for Hull.\" Full disclosure: Helen Pidd is from Lancashire."},{"comment_id":"971472706302942","commenter_b":"That's where she belongs! That's where she belongs! That's where she belongs! That's where she belongs! LOCK HER UP!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"More Wikileaks revelations: 1) Ted Cruz allegedly asked the DNC for MONEY to help fund his delegate fight in Cleveland (specifically: Eric Bennett to and from Ken Cuccinelli, R-Virginia working with Ted Cruz and the DNC to undermine the delegate selection before the convention). Working to push through rules changes in the rules committee and working to flip bound delegates against the rules and state law. All co-ordinated with the DNC. 2) Jake Tapper of CNN allegedly colluded with the DNC. They gave him questions to ask his interview guests. 3) Chuck Todd of NBC allegedly was also colluding with the DNC and put pressure on others at the network to go easy on Democrats at the DNC’s request. 4) The New York Times allegedly co hosted parties with the DNC. This is against the law. 5) Hillary Clinton allegedly setup a slush fund through the DNC to launder donor ...","post_message":"Live Now: Jesse Watters and Brian Kilmeade are here at the Facebook Live Lounge from the Democratic National Convention and they're taking your questions! Comment below:"}]
