[{"comment_id":"1231549493587943","commenter_b":"Hang her in the public square!","commenter_a":"We need term limits.","post_message":"Liberalism is a MENTAL disorder. Look what the Liberal tinkerpots are seeking to tear down now. BTW, nice glasses Babs!"},{"comment_id":"1040430382659049","commenter_b":"they are getting to close for comfort. she will play the stroke card any day now.","commenter_a":"She looks like a wore out old saddle bag.","post_message":"Hillary, EXPOSED!"},{"comment_id":"967744473282082","commenter_b":"Hillary, american people need your talented and exposure,","commenter_a":"Hillary, is key to solving, american problems,","post_message":"What we’ve seen too much of in the last few years is a spate of people who have reached for a gun before they really figured out what was going on. They’ve been much too eager to use that gun—we’ve seen it with policing and we’ve seen it with civilians. With police, first and foremost, they need to be trained and held accountable and disciplined in a way that prevents the reaction that we’ve seen way too much of. And with civilians—a lot of these “stand your ground” laws need to be rewritten. If you have to defend yourself, OK. But look at some of the instances we’ve had—Trayvon Martin, and too many more. Nobody should want to create circumstances in which innocent, unarmed people are killed—either by law enforcement or by civilians wielding guns. We’ve got to figure out how to deal with that."},{"comment_id":"10154105541082093","commenter_b":"Yea man! Go Donald. Get rid of the illegals. I can't wait","commenter_a":"Jeff Sessions = KKK! Another good ole boy for Donald trump...","post_message":"They held up hand signs saying, \"Go Jeffie Boy!\" and \"KKK\" ... The Alabama Republican was rejected for a federal judgeship 30 years ago amid accusations of racial insensitivity... @webpagelink"},{"comment_id":"761832037248738","commenter_b":"The Dell was your first mistake buy a Mac or a HP","commenter_a":"Bubba killed the jukebox last night...","post_message":"\"Man Kills His Computer.\""},{"comment_id":"10152847056142411","commenter_b":"Bill","commenter_a":"Its because Chicago is ran by a bunch of idiots.","post_message":"Have you ever witnessed a utility company ripping up a street or sidewalk that had recently been repaved? Chicago has a department that's supposed to coordinate schedules between the city and utilities. But it's not working as well as it should - and that means taxpayer money is being wasted. Dan Ponce reports: @webpagelink"},{"comment_id":"10152788140495950","commenter_b":"She did the right thing. Can't imagine how disappointed in her son she must have felt at that moment.","commenter_a":"I am so on board with what this mother did. She cared!","post_message":""}]
