[{"comment_id":"10153546375818352","commenter_b":"The number of times I v had little boys say shit 2 me when I ll be working down the road and the thing is I m not over weight , things like oh the face is nice but the ass ain't all that , and I m like hello I m fucking right here , what if women done that or did that oh yeah his face look good but he got no gains or he got small feet he must have a small u know what . Obviously like I said they r little boys what do they know their opinion don't matter , but to be so publicly commentated on is not what any women deserves or wants , me personally when I get in da gym it's for me and plus if my size 10 jeans r getting tight I got to do what I got ...","commenter_a":"Nothing wrong with a little extra. Love yourself no matter what size!","post_message":"Woman creates ‘thin’ and ‘fat’ online dating profiles using size 10 and size 18 snaps… to find out if men REALLY prefer skinny girls"},{"comment_id":"10154743661575470","commenter_b":"@username (Psst. She means white.)","commenter_a":"Finally a decent president out with the trash in with the class","post_message":"INAUGURAL PARADE: Watch President Donald J. Trump take part in the ceremonial parade."},{"comment_id":"1734577893461739","commenter_b":"clinton continues to LIE- wikileaks has proved that-she should be in jail.","commenter_a":"His comeback sounded like something a 3 year old would say","post_message":"Hillary Clinton: \"Well that's because [Putin would] rather have a puppet as president of the United States.\" Donald J. Trump: \"No puppet, no puppet. You're the puppet.\" @webpagelink"},{"comment_id":"10153256342071336","commenter_b":"Thank you.","commenter_a":"Good! He deserves it!","post_message":"Breaking News: Jury sentences convicted Boston Marathon bomber Dzhokhar Tsarnaev to death."},{"comment_id":"10150862465429999","commenter_b":"Here, here.","commenter_a":"The truth in the matter is that Washington is all about who has power and control of the agendas, no matter how awful their candidate. Withdrawing support from Awful Trump means conceding power to awful Hillary and the equally awful Democrats. The only way to break this power struggle is to elect more third party candidates that will force our elected public servants to compromise for the benefit of the American People.","post_message":"It's time for John McCain and other Republican leaders to set an example for their party by withdrawing support for Donald J. Trump, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"10153499378776051","commenter_b":"all women are crazy","commenter_a":"Dummy. He should have just gone home and find a girlfriend that is not crazy.","post_message":"This man's girlfriend and ex-girlfriend jumped into a river to force him to choose which one he loved more. Well, he made his choice."},{"comment_id":"10154156972868984","commenter_b":"ONE MORE TIME TO ALL OF YOU WHO BELIEVE THAT ALL OF US ARE INNOCENT OF EVERYTHING UNTIL WE ARE CHARGED AND THEN FOUND GUILTY IN A COURT OF LAW! IF THIS WAS YOU, A FAMILY MEMBER OR A FRIEND WOULD YOU GO SCREAMING JAIL THE SOB OR BITCH? OUR JUDICIAL SYSTEM IS BASED ON \"THE wPRESUMPTION IF INNOCENCE\" THAT ASSUMPTION PROTECTS ALL OF US FROM BEING JAILED WITHOUT DUE PROCESS! A FEW OF YOU BRING UP GENERAL PETREAUS, HE WAS A GREAT GENERAL AND IS AN HONORABLE MAN BUT HE PLEAD GUILTY OF ALL CHARGES INCLUDING DIVULGING HIGHLY CLASSIFIED INFORMATION TO HIS BIOGRAPHER WHOM HE WAS ALSO HAVING AN AFFAIR WITH. HILLARY HAS DENIED ALL CHARGES, WHICH IS ALSO HER LEGAL RIGHT UNDER OUR SYSTEM OF JUSTICE, AND NOW THE DOJ IN CONCERT WITH WHATEVER THE FBI CAN DERIVE FROM THEIR INVESTIGATION MUST PROVE THAT SHE IS GUILTY IN ...","commenter_a":"Dems are majority lawyers. Lawyers believe that if lies are stated long enough, they're perceived as truth and once a statement is made, it can't be undone. You can never un-ring the bell. She will continue to lie until way after she's indicted.","post_message":"Hillary Clinton just keeps digging herself deeper with this one... Is she your absolute LAST choice for president?"}]
