[{"comment_id":"10153831797228132","commenter_b":"She is not doing her job!","commenter_a":"I love all these comments","post_message":"\"Kim Davis should have never been locked-up for being a Christian,\" said Mike Huckabee."},{"comment_id":"1120443904657696","commenter_b":"Google Michael L. Robinson. Transvestite.","commenter_a":"Should say make the First Lady a LADY again. Take that Michael. Obama perpetrated the greatest fraud against America ever and will get away with it. You watch.","post_message":"Is this cartoon offensive?"},{"comment_id":"10155182239718984","commenter_b":"Go to hell BITCH","commenter_a":"Let the criminals out. Let illegals in. Let boys in the girls bathrooms. Condemn police officers. Persecute Christians. Don't care about the veterans. Pervert the children. Kill the unborn. Stomp on and burn the American flag. Accept barbarity in the name of Islam. Protect the Sanctuary cities. Cuddle the lazy. Encourage hate crimes. Destroy properties. That's the liberal way!","post_message":"Nancy Pelosi just dropped a lot of jaws with what she had to say about impeachment. Donald Trump will definitely want to hear about this..."},{"comment_id":"1050293421764665","commenter_b":"Good thing? To leave 20 million with no health care? Who are you? Scrooge? Let the excess population die? WWJD. I will not battle here.","commenter_a":"I am a constituent of yours. Let me tell you how hard I am going to work to make sure you are never re-elected! How dare you dismantle the ACA in the late night sessions. How dare you de fund the UN!","post_message":"This was John Kerry and President Obama taking a slap at Israel. I think most Americans believe that the United Nations has become more anti-Semitic, more anti-Israeli. We're going to stop the US money to the UN until we get this fixed."},{"comment_id":"1253721481351661","commenter_b":"whoop, found some time capsules","commenter_a":"Chris Lloyd","post_message":"According to a new study, there are two massive structures, located around 2,896 kilometers below the planet’s surface – one below the Pacific Ocean and the other beneath the Atlantic Ocean."},{"comment_id":"10152801050747377","commenter_b":"Not in favor with illegals, but let's not forget that we are here illegal too, the Indians are the only people here legally!","commenter_a":"Let's raise the percentage point!","post_message":"56 percent are against granting amnesty to 5 million illegal immigrants currently living in the United States."},{"comment_id":"1678604362359824","commenter_b":"@username how about i fuck your wife?","commenter_a":"Ah yes, Israel defending themselves against the crazed islamists wanting to destroy the country and kill all the jews. This page is turning into a progressive shitehole full of regressive thinking. NASTY.","post_message":"Literally the biggest assholes on the planet."}]
