[{"comment_id":"10154917656616509","commenter_b":"People, here the moronic trump plan : deport Americans from America! Ban Americans immigration from state to state. Unless you're a Caucasian with 'orange paint' on your face, then you must wear a badge to show who you are! That's the moronic trump have plans for America!","commenter_a":"So many people dead and Obama plays politics and slams Trump, Whats Obamas plan to stop this, He dont have one, Trump has one","post_message":"President Barack Obama on use of the term \"radical Islam\": \"What exactly would using this label accomplish?\" @webpagelink"},{"comment_id":"1652752338307075","commenter_b":"Wow what a dumb bitch. She's also so stupid that she thinks all Muslims are from other countries. That's funny. Pretty sure my Muslim aunt was born and raised American and so are her children!","commenter_a":"LOL They must be Muslim, people are loosing their minds, they come to a western country, because they don't like there Muslim rules, now they want to change things hear. Can we petition to Ban all Muslims???? Maybe they are color blind!!!!!","post_message":"Students sign petition to ban the song \"White Christmas.\" This is how crazy political correctness is on campuses today!"},{"comment_id":"10155297083883132","commenter_b":"Kimberly, you're obviously not paying attention. That's exactly what's happening. Also, the acts of past presidents don't take away from how terrible this is. Everything is quicker now. It's on fb as soon as it happens and people are less lax then they were to speak their minds. Don't act as if no one cared before. That directed to all the \"people losing their minds\" comments.","commenter_a":"So Trump bans certain people from entering the country and people lose their minds? Obama murdered how many women and children in those same exact countries using bombs and no one bats an eye? Funny how that works.","post_message":" one warned me when I was leaving, no one cared what will happen to my dog or my job or my life there, she said. one told me what I should do with my car that is still parked at the airport parking. Or what to do with my house and all my belongings. They didn say it with words but with their actions, that my life doesn matter. Everything I worked for all these years doesn matter."},{"comment_id":"1166767616720554","commenter_b":"@username - Deceit + Greed = Hillary Clinton.","commenter_a":"Here is what a Real Poll looks like in America. Please take the Time to Read.. A Total of 50,000 people Polled in 50 States.... PG Farnsworth We have just completed our own poll since we cannot get factual information from the mainstream media!! We called 1000 homes in each of the 50 states and asked basic questions on the economy, terrorism, immigration and presidential pick. Economy was the number one factor that Americans are concerned about and terrorism was number two. Presidential pick was Trump by a large percentage. Trump 33478 votes 67% Clinton 9788 Votes 19% Undecided or other 6739 votes 13% My friends and I are all Graduate students from all walks of life we meet to discuss stuff. 13 people who like and have served in the Military. It took us most of two weeks to be sure our calls were to all people and not ...","post_message":"U.S. Department of State reports show that 2,340 Syrian refugees arrived last month in the United States."},{"comment_id":"10154059836575667","commenter_b":"follow please Happiness is not that owns everything you see beautiful, but happiness can see all of its holdings beautifu","commenter_a":"What a nitwit, well good for him, a felony record for life, he earned it and deserves it !!! Hope he gets at least a year to boot !!","post_message":"Will the man who destroyed Donald Trump's star on the Hollywood Walk of Fame go to jail?"},{"comment_id":"1689272294667942","commenter_b":"@username Bernie raises money for the party too! You didn't hear that right at all. None of Hillary's money goes to Bernie, that would be ridiculously counter productive. Duh! Both Bernie, and Hillary do raise funds for the rest of the Democratic party. This is done, to insure more Democrats get elected. That way we won't have another lame duck president. Bernie still as a very good chance, and with all the controversy, Hillary, and supporters, may have just crossed the line! Don't count chickens before they are hatched! Be ready to vote blue, no matter who the nominee. On that note, I'm voting for Bernie, it's the right choice for the majority of Americans. The wealthy don't mean a damn thing to me, as most of them feel the same about us.","commenter_a":"Wise words my ass. How can you even sit there and tell us to join together with the blatant fuckery Shillary Clinton is doing. The voter suppression. Not releasing her transcripts. Her lies. She's a corporate slug that doesn't even deserve to be in office or the government. She's as bad as the republicans. The worst part is she would probably lose to the republican nominee and y'all keep trying to shove her down our throat. What the hell are we voting for if the DNC is just gonna cheat us. Bernie or bust.","post_message":"Wise words from Robert Reich. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"992971160795677","commenter_b":"Jean Russ Awwww Jean you're so sweet. But Cruz has just shot himself in the foot again with the phony Obama-Rubio photo shot. What is this guy Cruz doing? Sabotaging his own political aspirations? Digging a hole like a mole; no eyes; no direction; tunneling is a blind panic of a junior Senator?","commenter_a":"I just voted for the best GOP candidate in 32 years! I voted for @username!!!","post_message":"TOMORROW: Join me and Phil Robertson \"The Duck Commander\" in Myrtle Beach or Charleston. RSVP here: tedcruz.org/south-carolina"}]
