[{"comment_id":"10153659427149087","commenter_b":"@username Yeah, I've been to a few strip clubs in my life. Good looks though don't mean a girl can perform.","commenter_a":"It's the old emperor with no clothes on eyesight ... The schmuck can't see. He can't even see that his wife is a little hoish, not just the adulterous sex while he was married to his prior wife, but the many pictures like the one I've got in my downloads of a Melania Drumpf doing full frontal nudity, with a wet soapy body, wet hair, seductive pout, and a hand over her crotch doing the two finger simulated insertion. Ha, he can see everybody else and their blemishes .... and talk about them ad nauseum in the most insulting and revolting fashion, but he can't see his naked self .. nor, ha, his naked wife.","post_message":"\"Wow, Corey Lewandowski, my campaign manager and a very decent man, was just charged with assaulting a reporter,\" Donald J. Trump tweeted. \"Look at tapes-nothing there!\" WATCH THE VIDEO HERE:"},{"comment_id":"1311191442237531","commenter_b":"Pretty lady","commenter_a":"Same thing happened to me but without the note.","post_message":"'Found this on the floor of a bar about a year ago. Hope you don mind...'"},{"comment_id":"10153014667776955","commenter_b":"I lived in NY, not the first blizzard or the last...whats different now is the libtards have forced energy production to stagnate or decline while the population increased - aka people are going to freeze to death in their own homes. This is just nature being nature. Lets not make something out of nothing.","commenter_a":"Good place for it.","post_message":"BLIZZARD WATCH NYC, BOSTON HISTORIC"},{"comment_id":"494998494021091","commenter_b":"Probably because nobody wants to get that shit all over their car. I know I wouldn't.","commenter_a":"Diane Abramson, seriously, how has nobody \"accidentally\" run over Cruz in a crosswalk yet?","post_message":"The man behind Donald J. Trump's Muslim ban is on Ted Cruz's list of trusted experts."},{"comment_id":"10155319935565294","commenter_b":"No! Our kids are getting more stupid every passing day! They NEED ALL the education they can get!!! :)","commenter_a":"No","post_message":"Should schools switch to a four-day week? Tell us what you think."},{"comment_id":"1065254780239751","commenter_b":"Yes he did !!!","commenter_a":"Good idea. Take questions submitted by the public and picked randomly. Put each at a table with a mic. Turn off the mic when two minutes is up.","post_message":"It wasn’t pretty. More like a street fight than boxing, but Trump fearlessly took the game straight to Hillary and made the next 30 days about her repeated lies and corruption and not his disgusting comments of 11 years ago. He often reminded people why he won the primaries by unapologetically hitting at failed policies of the elites and establishment from both parties. Trump needed to show contrast and he did. He is more a chain saw than a scalpel, but his cuts drew blood. And it’s time to get rid of the so-called moderators. Get a big clock and let the candidates go to the stage and take turns and get rid of the media personalities who want to debate the candidates. My advice to “moderators?” If you want to debate, become a candidate. Trump won the debate. That much I know."},{"comment_id":"704085629782015","commenter_b":"She is Disgusting. Can't stand to look at this woman","commenter_a":"This whole family is a DISGRACE to this Country!","post_message":"Our first lady just disrespected all the white women in our country. She is a hypocrite and a racist. We miss Laura Bush. Do you agree Michelle Obama is a disgrace of a first lady?"}]
