[{"comment_id":"10153286881669641","commenter_b":"Suck my metaphorical dick @username","commenter_a":"Apparently people are paying more for cooking... Tess O' Connor @username","post_message":"Wealthy millennial women are more likely to make at least as much -- if not more -- than their husbands: cnnmon.ie/1HNES88"},{"comment_id":"10153131166411051","commenter_b":"Muslims, get out of our country, go to where you are sickheaded and treat others like dirt..we don't want you here..you are sick and so disrespected..we can't stand you or your way of thinking.","commenter_a":"I'll continue to do things the way I normaly do. If you are offended by it then that's you're problem.","post_message":"A woman's painting was rejected because it might offend some Muslims. Decide for yourselves if there's anything wrong with the image."},{"comment_id":"906483276114592","commenter_b":"Oh shut up Jindal you backward cretin. The world's views have changed and long overdue. I am glad to see that people can choose to marry whomever they want. We all live on this planet and all should be able to marry who they choose.","commenter_a":"Separation of Church & State! What part of that doesn't this fundamentalist christian rube understand?","post_message":"“I hold the view that has been the consensus in our country for over two centuries: that marriage is between one man and one woman. \" -Gov. Bobby Jindal"},{"comment_id":"1868221936741025","commenter_b":"@username STUART BAILLIE IS RIGHT. AL SHARPTON IS THE ONLY MORON THAT LOST WEIGHT. ROSIE AND WHOOPI WILL NEED AN AIRBUS TO LEAVE HERE. THEY WILL HAVE TO MAKE A CUSTOMIZED GAS TANK TO HOLD ENOUGH FUEL TO GET IT OFF THE GROUND. NASA HAS ITS WORK CUT OUT FOR SURE. MAYBE THE ENTERPRISE USED ON STAR TREK WOULD WORK. BEAM THEM UP SCOTTIE. WARP 10","commenter_a":"I thought this fat fucking pig was leaving the country if Trump won. Just another piece of shit liar that won't leave as promised.","post_message":"Rosie O'Donnell has a new job."},{"comment_id":"10153060785906519","commenter_b":"Hillary covered up for him all those years in AR because she knew he was going to be president. The wives of predators who cover up for them are almost as guilty as the offender. She only cares about one thing...power.","commenter_a":"Y'all still talking about Clinton and consensual sex. Oh I get it Hillary's running, so y'all need to bring that up again. Never mind that it isn't relevant! Or are we blaming Hillary for a spouse that strays?","post_message":"\"The actual facts of the matter are that Bill Clinton was a serial abuser of working-class women–he had exploited that power differential even in Arkansas...\""},{"comment_id":"1146546865428217","commenter_b":"Melania doesn't even know where she is right now...","commenter_a":"Yep preparation H.","post_message":"Donald Trump and Hillary Clinton attend the Al Smith Dinner in New York"},{"comment_id":"10153399487739411","commenter_b":"wrong , Britain has nothing to be ashamed about, its not British people planting bombs and blowing their own kind up, if you haven't got anything useful to say except the usual stereo typical crap then stfu and go away, preferably to the middle east if you think the people are so great. Its funny how people such as yourself preach \"tolerance\", care to show an example of tolerance shown by Islam or its followers","commenter_a":"To that ignorant little britain first shitbag you do not represent my country, Britain is built on the back of slavery, racism and bigoted xenophobic imperialism but today it SHOULD stand for tolerance, cosmopolitanism and living in peace with our collective of ethnicities from all corners of the former empire (Including Wales and ireland, remember when it was fashionable to hate the Irish too, wake up muppet divide and conquer is as old as politics itself.)","post_message":""}]
