[{"comment_id":"1988963441329253","commenter_b":"LOL I never ever listen to any of her crap music.","commenter_a":"Thats right America! Keep giving your money to hollywood libs! Making them millionaires! She and her thug hubby laughing all the way to the bank...","post_message":"***FIRESTORM*** An online #BoycottBeyonce campaign to boycott Beyoncé and her music has picked up steam since the pop star performed a controversial tribute to the Black Panthers during the Super Bowl halftime show on Sunday....Developing..."},{"comment_id":"10154218894306350","commenter_b":"Oooooh Emmmmmm Geeeeeee YES Cara!!","commenter_a":"@username we must try these!","post_message":"Find out when you can buy them!"},{"comment_id":"10150971534884999","commenter_b":"The thrust for stories to prove a Trump presidency will embolden bigots is so great right now, people are faking hate crimes.","commenter_a":"\"RISE IN HATE CRIMES\" -If 'Murican media is anything like Toronto's , they are rigorously hunting down stories that fit the appropriate narrative of the day.","post_message":"Kids are at risk of getting the message that racism and harassment are OK, Emily Bazelon writes in The New York Times Opinion Section."},{"comment_id":"10152958677570927","commenter_b":"If it was that bad! Why isn't the border fence leaning toward the South! Someone will gladly take your number!","commenter_a":"Another stupid comment from the Peanut gallery","post_message":""},{"comment_id":"10153650702998984","commenter_b":"The evil corrupt white witch.","commenter_a":"It's about time,","post_message":"All I can say is wow. I didn't think this was ever going to happen, but here it is. Hillary has to be terrified right about now... Are you glad the FBI is taking action against Hillary?"},{"comment_id":"10157177074000354","commenter_b":"And she will continue where he leaves off","commenter_a":"We've had more terrorist attacks on our soil during the Obama administration than on GW Bush's watch. I think Obama is doing a fine job of recruiting terrorists.","post_message":"So the basis of Hillary Clinton's corrupt candidacy is that she is more popular with terrorists? WATCH:"},{"comment_id":"1359039877491459","commenter_b":"Muslims are the devil","commenter_a":"What the hell is he. Trying to make things harder for Trump?","post_message":"SICK: While You Celebrated Christmas, Obama Gave FULL CONTROL Of Christian Holy Sites To Muslims"}]
