[{"comment_id":"10153038783201717","commenter_b":"She is absolutely ridiculous","commenter_a":"Dude she had how many warnings to do her job and she refused? Did the judge think that putting her in jail then taking her out would scare her into doing her job now? I highly doubt she's gonna get out and be like \"oh yea imma start issuing out these licenses now, even tho its against my religious beliefs\" pffft fat chance.. -_- I'm so sick of this bitch","post_message":""},{"comment_id":"1364548750229953","commenter_b":"Anything above .22 caliber is illegal expect where permitted by law, and by law I mean hunting clubs that bend the rules. Open carrying is restricted to law officials only. But yeah that sure stopped the cartels from getting their hands on em","commenter_a":"What about bad/psychotic people with gun permits and guns purchased legally? The system is a joke... How can you really determine good/bad ppl...","post_message":"The Dallas police chief says he is concerned about open carry laws. \"We don't know who the good guy is versus who the bad guy is if everybody starts shooting,\" he said."},{"comment_id":"10154407865186636","commenter_b":"Not by quite a wide margin however. How much Norbert get? 47% was it? It's already getting dangerous","commenter_a":"Austrians rejected the Far-Right, let's hope the French do the same, otherwise Europe will become a more dangerous place.","post_message":"Elections take place in April"},{"comment_id":"10158155070740206","commenter_b":".. And why is anyone still endorsing hillary clinton?","commenter_a":"so the NYP takes a run at Ryan Lochte for lying but gives crooked Clinton a walk ? hmmmmm","post_message":"Liar liar, swim trunks on fire. @webpagelink"},{"comment_id":"1078994498821381","commenter_b":"This is OHBLOWME's army!!","commenter_a":"Obama has blood on his hands","post_message":"BATON ROUGE KILLER'S SOCIAL MEDIA Bought Into Obama's Anti-Cop \"JUSTICE\" Rhetoric [Video] Obama is heard by people like this killer...blood on Obama's hands!"},{"comment_id":"10154198707121636","commenter_b":"You British slaves deserve this Royal domination and humiliation!! The King plus Queen rules slaves are always slaves!!","commenter_a":"The point is that the royal family could easily afford to pay for the renovations themselves. We have no money for the NHS, but plenty for this? How is that in any way fair?","post_message":"Money well spent?"},{"comment_id":"621998441316699","commenter_b":"Sadly many get all their\"information\" from the globalist owned main Street media........the sheep are being led to slaughter!!!!!!","commenter_a":"The problem is, NO BODY WHO SUPPORTS HILLARY CARES!!! The amount of hard evidence, current criminal offenses is mind boggling... but her supporters just don't care... she shouldn't even be allowed to run...","post_message":"Uh oh..."}]
