[{"comment_id":"10156899433320354","commenter_b":"If you're a f****** illegal mexican, get the hell out!","commenter_a":"Illegal immigrants built part of this country cause people like Trumpet hired them! All of a sudden they're bad? Screw you all! Im proud to be a fucking Mexican!","post_message":"“[O]ne party has made it okay to say you can hate people, you can spit on them.” What would you like to tell Julieta Garibay? WATCH:"},{"comment_id":"1680942268839646","commenter_b":"@username..you're a fucking racist bitch!","commenter_a":"I would like to see in the White House, a president with love for this country. Hasn't been one there for over 7 years now.","post_message":"Would you like to see these two move in to the White House next January?"},{"comment_id":"1170311373061915","commenter_b":"Bitch, YOU'VE been punked and you're too stupid to grasp that fact!!!","commenter_a":"Will has a right to do what he wants to do.!!!!!!!!!! Who the f- -k does Trump think he is?!!!!!!!!!!!! It's time he kept his trap shut.!!!!!","post_message":"Brilliantly played, George Will!"},{"comment_id":"10154412077781323","commenter_b":"Italy isn't doing anything, yeah neither is Nigeria, or the Nigerian women that are the madams of these places.","commenter_a":"Italy allowing this to happen in plain sight. It's blatant and brazen and on the roads in broad daylight. The country should be in uproar, but no one does anything about it, not the government, not the vatican.....shameful.","post_message":"Thousands of women and girls are being trafficked to Italy from Nigeria, into a life of forced prostitution. Abused and desperately vulnerable, they have a champion in Princess Okokon, who was herself trafficked from Nigeria in 1999. Okokon fled her captors, and, with her husband, set up the NGO Piam Onlus Asti. Together they have helped hundreds of women in Asti and Sicily to escape their traffickers, giving them refuge and support."},{"comment_id":"942143152490588","commenter_b":"where are the feminists.. i mean the ones born with a vagina ?","commenter_a":"I'd be curious as to how the feminists view this. A transgender winning against women. Interesting point about puberty made by Rousey.","post_message":"Let's be real, she makes a good point..."},{"comment_id":"1703284416593951","commenter_b":"Cruz pussy fake!","commenter_a":"Not true and you know it.","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"},{"comment_id":"10153124758876336","commenter_b":"Inappropriate.","commenter_a":"This says she's not a very good golfer and is not really serious about golf as a vocation. Bet she gets a lot of offers for sex though.","post_message":"This week, \"GolfDigest\" unveiled a head-turning shot of one of golf's top young female stars, Lexi Thompson. What do you think of the controversial cover?"}]
