[{"comment_id":"556934131139724","commenter_b":"So your telling me that New York wants refugees even after they experienced 911? I'm going to officially say they are retarded.","commenter_a":"It's not up to the states to determine it.... it just slows the process down, but they can ultimately come to wherever they want so long as the feds allow it...","post_message":"UPDATE: Four additional Governors have said that they are willing to allow Syrian refugees into their states: New York, Oregon, Utah, and Virginia. We simply do not have the ability to adequately vet more than 75,000 incoming refugees. I stand with the 31 Governors who are fighting to keep our nation safe. Contact your Governor today. CURRENTLY ACCEPTING: Colorado Governor John Hickenlooper Phone Number: (303) 866-2885 Facebook: @webpagelink/ Connecticut Governor Dannel Malloy Phone Number: (860) 566-4840 Facebook: @webpagelink/ Delaware Governor: Jack Markell Phone Number: (302) 744-4101 Facebook: @webpagelink Hawaii Governor: David Ige Phone Number: (808) 586-0034 Facebook: @webpagelink/ Pennsylvania Governor: Tom Wolf Phone Number: (717) 787-2500 Facebook: @webpagelink Vermont Governor: Peter Shumlin Phone Number: (802) 828-3333 Facebook: @webpagelink/ Washington Governor: Jay Inslee Phone Number: (360) 902-4111 Facebook: @webpagelink Oregon Governor: Kate Brown Phone Number: (503) 378-4582 Facebook: @webpagelink/ Utah Governor: Gary Herbert Phone Number: (801) 538-1000 Facebook: @webpagelink/ New York ..."},{"comment_id":"1776428082627538","commenter_b":"I pray to God that people who think she would be a good president, realize how wrong they are. I don't know that Trump would be good, but so far he seems better to me than her. Sadly the Libertarian candidate has too many views that are not on par with me and it is in the areas that matter most to me. Trump shares my stance on all of the issues that have come out thus far.","commenter_a":"TRUMP....you better not bail on us man. You're our only hope!!!","post_message":"Hillary Clinton Finally Tells The Truth: Pledges She Will Raise Taxes On Middle Class"},{"comment_id":"10154739927446037","commenter_b":"Sorry, women ARE voting...lol","commenter_a":"Most pictures are worth a measly thousand words. This one's worth millions. I would never advocate voting for a woman just because she's a woman, but this suggests that might not be a bad idea.","post_message":""},{"comment_id":"1698726270383299","commenter_b":"@username I DON'T KNOW WHAT YOU ARE SMOKING OR DRINKING BUT EVERY SINGLE DAY HE LAYS OUT POLICY....1. CLOSED BORDER, 2. DEPORT ILLEGALS, 3, BUILD A WALL. 4 HEALTH INSURANCE OVER STATE LINES SO IT IS COMPETITIVE. 5. BUILD THE MILITARY...6. IMMEDIATELY DEFEAT ISIS...7 SMART TRADE NOT JUST FREE TRADE WHICH BROKE THE COUNTRY..8. CUT TAXES FOR MIDDLE CLASS..9...TAX COMPANIES GOING OUTSIDE THE USA TO MANUFACTURE AND SELL HERE WITH NO PENALTY. 10. SMALLER GOVERNMENT, TRIM COSTS, AND WASTE. 11. PLACE CONSERVATIVE JUDGES ON SC...HE WILL NAME THE CHOICES BEFORE ELECTION 12. PRO LIFE...13.NO SALARY FOR HIMSELF 14. EDUCATION BACK TO THE STATES...NO MORE COMMON CORE...I GO ON BUT YOU NEED TO PAY ATTENTION AND STOP SPOUTING LIES....YES ONCE HE GETS IN...THE PENTAGON AND OTHERS WILL GIVE HIM INFO HE DOES NOT YET HAVE ACCESS TO...BECAUSE OF THAT NEW INFO, HE MAY HAVE TO ALTER THINGS SOME...THAT'S TRUE OF EVERY ...","commenter_a":"Yeah. Donny Trump and his lackeys DO NOT get to redefine what a conservative is. Many many real conservatives have fought hard, long battles over the decades to pull this nation back onto the constitutional rails advocating for founding principles. This fight has always been against politicians of the democrat party and republican establishment put there in part with Donny Trump donations. Where was Donny when some were standing tall against amnesty? Where was Donny when some were fighting Obamacare? Where was Donny when some were fighting to get Planned Parenthood defunded? Where was Donny when a certain someone was fighting the unconstitutional DC gun ban? Where was Donny when average citizens were having their homes confiscated by local governments so rich people could use them instead............... He was on the other side, or silent......because it didn't benefit him personally to be on the right side. Trumpers are for a ...","post_message":"Dana Loesch unloads: \"She made it personal first — I’m just doing it the Trump way: you come at me, I’ll come back at you three times as hard. You like it now?\""},{"comment_id":"850731841652961","commenter_b":"Another inbred rightwing BITCH! lmao.. Throw her to the lions! :) I wouldn't wipe my ass with the satanic black book of lies she learns from.. \"C-NT!","commenter_a":"One ugly MF !!!","post_message":"Her lawyer says it's not about bigotry. She says it's about her faith. But bigotry comes in many forms, and she's using her faith to justify it:"},{"comment_id":"10153052484116491","commenter_b":"GTFO illegals","commenter_a":"And he shouldn't! Go TRUMP! Out with those freeloading illegals!","post_message":"Even after losing a slew of business partners, including Macy's, NASCAR and NBC."},{"comment_id":"1154135184625068","commenter_b":"@username,get that trailer cleaned up woman!","commenter_a":"Fake","post_message":"\"Donald Trump’s birther event is the greatest trick he’s ever pulled\""}]
