[{"comment_id":"533363636854216","commenter_b":"if this person had been a white lady, shed be up on charges...black privilege","commenter_a":"Good for her kick his ass","post_message":"After this mom found out her son was rioting, she took immediate action. All the parents in Baltimore should be doing this to their race rioting children. Do you agree her race rioting son got what he had coming?"},{"comment_id":"1328494547175243","commenter_b":"Join a lots of OTHERS, -- WHO could put up with that WOMAN. Send \" HER \" to JAIL.","commenter_a":"Good girl, Judge! Way to go! You are the best!","post_message":"“It’s the kind of locker room and frat house talk that personally infuriates me. But guess what? I still, without a doubt, support [Donald J. Trump].\" Watch Judge Jeanine Pirro's full opening statement."},{"comment_id":"10154308587221323","commenter_b":"Oh stop with this mythology bull, grow up!","commenter_a":"Quran is base of Islam. Quran do not say that homosexuality is pride. GOD bans this type of relation in all abrahamic faiths, but also GOD say that He will punish this sin, people re not allowed to harm gays. They only can make advise. So Sadiq Khan should tell about Quran and not his personal views, abot homoseuxuality, only then muslims will accept him like a muslim.","post_message":"\"The irony of Brexit repercussions is that those good old (or new) British values we bang on about seem to be falling to pieces around our ears. Diversity, unity, respect, equality might sound like cliches on replay – but they do work for us, if we work for them. That’s why approaches like that of Sadiq KhanKhan are so badly needed now. He’s somehow got his act together during a moment of such uncertainty, doubt and disappointment.\""},{"comment_id":"376409252547369","commenter_b":"She is a looser","commenter_a":"THUMBS DOWN!! Pitiful excuse for a human being. Hard-working Americans don't get $112,000 in benefits. THIS IS SO WRONG. Stop the money and see what she does.","post_message":"One more Welfare Moocher..."},{"comment_id":"10153396181678908","commenter_b":"Good morning through Facebbok","commenter_a":"Beth Bethy Lockwood","post_message":" are confirming the health benefits of meat-free eating. Nowadays, plant-based eating is recognized as not only nutritionally sufficient but also as a way to reduce the risk for many chronic illnesses. Harvard Medical School"},{"comment_id":"10153939182654060","commenter_b":"There are no women in a yakuza clan.","commenter_a":"Curiously -- nothing is said about females role in the family🔮","post_message":"In 2011 a Belgian photographer was allowed entry into one of Japan’s Yakuza families. Over two years, he captured the lives of those living in the underworld"},{"comment_id":"10152817930862169","commenter_b":"Because vaccines are no longer mandatory and with all the immigrants coming into the country are bringing the diseases and worse into America. And our govt doesn't give a crap.","commenter_a":"bandwagon idiocy","post_message":"Tonight on FRONTLINE: How the Disneyland measles outbreak has redrawn the battle lines in the bitter vaccine war. @webpagelink See it at 10/9c"}]
