[{"comment_id":"940335786059476","commenter_b":"That's right fuck that dumb cunt!!!","commenter_a":"Michael Lance Kaniala-Ekahi Baldasare-Low Shelbie King @username","post_message":"How to silence Kim Davis supporters who cherry-pick the Bible to discriminate against LGBT Americans. In the comments, tag your friends who need to see this. Video by Occupy Democrats, please LIKE our page!"},{"comment_id":"10153512557096130","commenter_b":"LOL!!! NO SEX. WOMAN LISTEN TO MAN. YOU MADE OF RIB. SHUT UP. NO WORDS. BE SLAVE. yay the bible...-.-","commenter_a":"Well, I suppose human nature, being what it is, things won't change much for the better. However, if people would follow some of the teachings of the Holy Bible, regardless of their personal religious beliefs, the need for Planned Parenthood would pretty much go away.","post_message":"Enough is enough."},{"comment_id":"631016783743523","commenter_b":"Another white college educated female here!!!","commenter_a":"Donald Trump will not become president of the United States, because Americans understand that togetherness trumps divisiveness, and that love trumps hatred.","post_message":"Join me in in Philadelphia - LETS MAKE AMERICA SAFE AND GREAT AGAIN! GOD BLESS AMERICA!! -DJT"},{"comment_id":"10154298408534060","commenter_b":"Actually, it's incredibly efficient for what it is.","commenter_a":"All meat is a waste of energy and thus unsustainable.","post_message":"Human consumption of farmed fish has overtaken that of beef. In fact, aquaculture may be the only way to supply mankind with enough protein in the future"},{"comment_id":"1738890906325401","commenter_b":"Why no handcuffs? If i break the law and admit to it I'm no longer culpable? This should be challenged in every courtroom.","commenter_a":"California's Latino population is out of control. There are more Hispanics in California than there are people in 46 other states. 30% of all LEGAL immigrants come from Mexico. It's not \"diversity\" taking over, its misogynistic Hispanic rape culture being dumped on this country, and the democrats don't care how many little girls are raped & murdured and beaten & beheaded and sold into slavery & prostitution as long as they get millions of new voters. The age of consent for sex in Mexico is 12. In their culture it's ok to have sex with children. Not only that, these people are putting themselves in enormous risk, dying in the desert, and then we pay for them when they get here. It's madness! The majority of legal(51%)and illegal(72%) immigrants are on welfare according to the center for immigration studies. The number of immigrants on welfare should be 0! New report ...","post_message":"Note the swipe she took at Donald Trump..."},{"comment_id":"10154399903958797","commenter_b":"Idiots!!","commenter_a":"And then people wonder why they are shot. First responders should be licensed to carry and use if needed.","post_message":"WHO DOES THAT?! Two people have been charged with scratching and hitting paramedics on a Red Line platform in the South Loop Sunday night. Officials say the suspects walked up and hit the responders in the face and body before spitting in their faces."},{"comment_id":"10154151629042507","commenter_b":"Says the white bitch with a job and a Beamer....Dorothy saloum.....ha-ha!","commenter_a":"Hey @username liberals, Thanksgiving looks like gratitude. It's all about money to you socialists.","post_message":"If you have $50,000 you can join them."}]
