[{"comment_id":"10154828234334714","commenter_b":"No vote Hillary & she have problem health. Prison Hillary.","commenter_a":"I'D EVERYONE!!!! don the con has his sheep voting twice three times in some places!!!","post_message":"Democrats will seek court action to preemptively block potential voter harassment from Republican poll watchers."},{"comment_id":"616683421873704","commenter_b":"I do too, Hillary won that election! They stole it and tainted our votes.","commenter_a":"Not my President impeach impeach impeach","post_message":"Share if you do too! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1377352988951720","commenter_b":"@username ok naked girl","commenter_a":"Chaos? Not really, just a bunch of virtue signaling, brainwashed and hypocritical snowflakes doing their stunt... Stop this nonsense, people support Trump!","post_message":""},{"comment_id":"10155880374735354","commenter_b":"It sickens me to know that we let Muslim terrorist cowards like that stay in this country under the protection of religious freedom while we tell the Marines and the rest of the armed forces that we don't trust them enough to have a weapon around a civilian population. Ship those goat fuckers out and give our boys some firepower.","commenter_a":"I will always honor them and all that do sooo much to feel us free God Bless","post_message":"Know Their Names, Honor Their Lives. Semper Fi."},{"comment_id":"941357532590662","commenter_b":"Yes, @username. Why don't we force all the women to wear burka. I hope yours fit you well. You probably need it.","commenter_a":"Every picture she has she has her cleavage out! Then blames the men for the 'unwanted attention'!!!","post_message":"She reported them to police because she said it made her walk to work an 'awful experience'"},{"comment_id":"517132878459126","commenter_b":"Right under this post is an article that says blue nation review gives Hillary Clinton her own media wing.","commenter_a":"But the Word of God is in our heart, never to be taken away, Glory to God","post_message":"The numbers are undeniable."},{"comment_id":"10153698942976350","commenter_b":"Not everyone has reconstruction surgery. It is hard to find a bra that holds the prosthetic breast without it going sideways so you end up looking off. I opt for a sports bra most days as I have one breast.","commenter_a":"I love Stella!","post_message":"\"We wanted to bring something feminine and beautiful into a bra that is taboo.\""}]
