[{"comment_id":"10152716358611680","commenter_b":"Red herring fallacy and straw man fallacy.","commenter_a":"This is sexist and Politico and the lib media are trying to hide this story. Nice try. @webpagelink","post_message":"Kelley Paul says \"to have that label put on him, that really upset me.\" @webpagelink"},{"comment_id":"1264747770240434","commenter_b":"where are you people getting married? That's way tooo much for a wedding.","commenter_a":"save that money for a down payment on a starter home. have a small personal wedding. in the longrun no one is going to remember crystal chandeliers, wine glasses or the color of the bridesmaid dresses. only you. in 35 years your husband won't remember that----only the credit card bills. Have a wonderful time no matter what you do.","post_message":"And about $16,000 of that is for the venue alone... STORY: @webpagelink"},{"comment_id":"10153563127821680","commenter_b":"Gotta love how she tries to spin this. No other SOS ever had a orivate, unsecured server in their house. Morning Joe shows her lie repeatedly. @webpagelink She needs to drop out. Even Politifact.com found her statement to be a lie. @webpagelink/ #NeverHillary #BernieOrBust","commenter_a":"I lied and I'm going to lie some more.. Hillary2016","post_message":"\"There may be reports that come out, but nothing has changed,\" Hillary Clinton said. \"It's the same story.\" Read more: politi.co/1P0pUQK"},{"comment_id":"10154980459782235","commenter_b":"I would suspect it was an operation right out of the Kremlin. If so it's an act of war.","commenter_a":"C span has confirmed it happened and operating right now under the theory that it was an internal routing problem on their end. They advised they will update if they find out anything different happened.","post_message":"What the hell just happened?"},{"comment_id":"1686671934920265","commenter_b":"Hey Vincent, your situated right next to the greatest country of the world and your country is in shambles!! That alone tells us how F'ed up you and your country / society is. You'd think there would be something positive your country would pick up to your benefit. Fix your dump and make it so great and build a wall to keep us out. We'd appreciate it. Asshole!!","commenter_a":"Just put a tax on any money going back to Mexico or central America. Build that Wall Mr Trump.","post_message":"EX MEX PREX: 'NOT PAYING FOR FUC*ING WALL'"},{"comment_id":"10152924972954342","commenter_b":"No the mother didn't give meth to the baby, the baby was born with it in its system meaning the mother used drugs while pregnant, she had the baby at home so they wouldn't test her or the baby BC when they come up positive CPS will take the child away","commenter_a":"...and exactly where was he going with this baby?? These crack heads now days are BOLD","post_message":"Police say this confessed drug addict was caught on camera smuggling his 2-day-old baby out of the hospital in a plastic bag. He was stopped by hospital staff after triggering an alarm and putting the hospital on lock down - but no one ever looked inside the bag he was carrying and they let him go."},{"comment_id":"10153129788220667","commenter_b":"No one cares that he lived and no one would care if he died","commenter_a":"Really?? Who cares?!?!??!!!","post_message":"He is in significantly better shape than when he was rushed to a Las Vegas medical facility after a three-day binge at a Nevada brothel."}]
