[{"comment_id":"10153316443579170","commenter_b":"God, she is a worthless person!","commenter_a":"Sicker than sick.","post_message":"All you Bible believers better change the way you think! The queen-in-waiting has spoken!"},{"comment_id":"612643332237670","commenter_b":"It's really crazy that some men are coming up with more excuses for this kid","commenter_a":"What, now alcohol is being used as an excuse to rape a girl. People still know right from wrong, drunk or not. Rape is illegal. Justice needs to be served. Disbar that judge, also.","post_message":"The judge, also a Stanford alum, noted that the defendant was intoxicated at the time of the assault."},{"comment_id":"10153424220937106","commenter_b":"If it happened in my county, I'd make the complaint myself and have no problem with people putting one in their yards, on their business , our at their church. It just doesn't belong on government property.","commenter_a":"Would be interesting to know if the person who contacted the anti God group has neighbors with these signs in their yard! Can only hope!!","post_message":"It is outrageous that some would aim to divide a community over a banner that has been proudly displayed since Sept. 11, 2001. I commend the Pittsburg community for rejecting this decision and I stand with them. The Constitution guarantees a right to freedom of religion, not freedom from religion. This banner is not only an expression of faith, but of love for country. Expressions of patriotism, faith, and community should be welcome in our society and I have contacted USPS officials to express my concerns about their decision and to request their reconsideration. If the local post office branch is unwilling to display the banner, then I would be proud to hang it at my own office in Pittsburg."},{"comment_id":"480221218832838","commenter_b":"Kevin, if you look at Christine's profile, I would say all of her ancestors were not white... And you just backed up what I said about the white man thinking they could own the land. I believe that baffled the Natives. How could you own Mother Earth?","commenter_a":"Jesus WAS!!!!! A LIBERAL, you right-wing nuts!!!","post_message":""},{"comment_id":"1236473219748126","commenter_b":"The police did what they needed to do. Woman was out of control","commenter_a":"Yes. NOT because of race, NOT because she is a woman, because she is resisting arrest. Have your day in court and don't try to get your justice in the street. It's just that simple.","post_message":"This Black Lives Thug Chick Gets Her FACE SLAMMED Into the Concrete... But after watching the video did she deserve it? We say yes! You decide! (VIDEO)"},{"comment_id":"10152984478206130","commenter_b":"That woman looks so pissed in every photo I have seen of her lol","commenter_a":"There is no \"key\" to living a longer than average life span. It's all about good genetics and being healthy","post_message":"“I feel good. I don’t feel sick. I’m still trying to do the right thing is all.”"},{"comment_id":"10154376127101509","commenter_b":"Unemployment has been the highest it's ever been under his presidency. It has just recently declined...ever since republicans took control of congress. Hmmm @webpagelink","commenter_a":"He is the worst president in the history of this once great nation. Bush is a close second. Those two have done more to destroy personal liberty and prosperity than any presidents before them. Obama is such a hypocrite. Scolding this country about division between races and religion when he has done more to divide this country than anyone in history. I need a shower after that garbage.","post_message":"President Barack Obama presents \"four big questions that we as a country have to answer \" during his State of the Union address. #SOTU updates: @webpagelink"}]
