[{"comment_id":"10152734752671051","commenter_b":"Unbelievable! some women should not children and she is one. Discipline begins at home.","commenter_a":"Needs a good ole fashion spankin.","post_message":"This 11-year-old boy is responsible for a fifth of the crime in his town – and his mother knows exactly who to blame for that."},{"comment_id":"10154318254146509","commenter_b":"Why don't you look back in G W Bush and Klinton to what they did? The difference between Russia and the USA is that the USA never asked for permission to invade any country. They just did what they wanted, and they destroyed the whole country with it's sovereignty. Another difference is - when you sea how these leaders greet \"dictators\" as they call them, with extremely wide hypocritical smile, and after a while the destroy them. Russian leader doesn't smile that much, but you get the feeling that he doesn't substitute his values and he is a person that can be trusted.","commenter_a":"Closed CAPTIONS, please!","post_message":"Five of CNN's correspondents look back at the role of Russia and President Vladimir Putin this year, and what impact there may be in the future. @webpagelink"},{"comment_id":"497552493768664","commenter_b":"she can drop dead for all I care","commenter_a":"Irrelevant liberal rhetoric, out of the idiotic blathering mouth of a pitiful bitch who doesn know what damn day it is....","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"10152910753726336","commenter_b":"Reality check!!!!","commenter_a":"REALLY! If you believe this I have beachfront propoerty to sell you in Arizona, can you say \"stupid Americans\"!","post_message":"Do you agree? #SOTU LIVE coverage: @webpagelink"},{"comment_id":"1719601761432898","commenter_b":"Similar... squeeze out a parasite living off the host....","commenter_a":"I don't know which news item is more intriguing - this, or Kim Kardashian's wanting a divorce from Kanye West. It's so hard to keep up, with so much happening these days.","post_message":"Oh no. (from Elite Daily)"},{"comment_id":"1008404635861662","commenter_b":"Nasty ass bitches!","commenter_a":"Breastfeeding should be done in private. For God's sake this is an industrialized country. People should not be displaying public nudity (displaying breasts) while feeding a child. Yes it is natural to feed children breast milk. But have common decency about it!","post_message":"These defiant moms just occupied a food court to stand up for breastfeeding in public."},{"comment_id":"10152947208161336","commenter_b":"There's a chic that would still date this guy, that's news!","commenter_a":"He proved himself to be an a** years ago.","post_message":"Lance Armstrong crashed his SUV into two parked cars after a night of partying and then let his girlfriend take the blame, according to police."}]
