[{"comment_id":"10152565333134071","commenter_b":"Both of them are idiots !","commenter_a":"Legalize it, is the best way to keep it out of minors and kids.","post_message":"#Pot2Blame?"},{"comment_id":"10153744728059087","commenter_b":"And, to all of the pissy whiney Clinton supporters who complain about how \"mean\" Bernie has been to Hillary by his pointing out true negative aspects of her record--if Clinton prevails, Trump will decimate her and Bernie will never look so good to them.","commenter_a":"I call...bullshit. Bernie","post_message":"\"I sense some great deal of momentum, I sense some great victories coming,\" Bernie Sanders said after his stunning upset victory in Indiana. \"I think we can pull off one of the great political upsets in the history of the United States and in fact become the nominee for the Democratic Party and once we secure that position, I have absolute confidence that we are gonna defeat Donald Trump in the general election.\""},{"comment_id":"812675022209688","commenter_b":"@username, she should have been in jail a long time ago!!","commenter_a":"We need Trump 100%. Clinton is going to do nothing new for the @username people","post_message":"She disagreed with Donald Trump's proposal."},{"comment_id":"10154020630826636","commenter_b":"@username however... that's detracting from my point! My original comment was about the UK's inability to prosecute migrant sex offenders!","commenter_a":"The only problem people in the uk have with immigrants, new British, Muslims etc... is the lack of police prosecution and \"special treatment\" minority groups get. There are an estimated 1 million cases of Islamic grooming, which've been swept under the carpet, by social services or went uninvestigated by police because of fear of being branded racist! That's not just some \"bigoted\" or \"islamphobic\" propaganda.. that's the reality of people living in a heavily Muslim populated area! The problem isn't with immigrants or non white Christian Brits... it's the lack of ability to deal with the crime coming from their community's by the authorities!","post_message":"Ironic?"},{"comment_id":"10154660794741756","commenter_b":"Shut Up Clown!","commenter_a":"If Venus or Serena were caught using this stuff they would have been stripped of everything!! Those double standards.Lol","post_message":"\"If it's not banned, athletes will use it.\""},{"comment_id":"10152775426692217","commenter_b":"The US has millions of illegal Mexicans to care for, sorry we're full.","commenter_a":"Am sure Canada and USA will come forward and agree to accept these poor immigrants. These countries unlike our crowded little island have plenty of space to accommodate these poor souls, tho having said that Scotland is pretty sparse.","post_message":"Video shows the moment migrants are rescued from a boat in the Mediterranean @webpagelink"},{"comment_id":"10153746372034607","commenter_b":"Lock them all up!","commenter_a":"But there is people out there committing crimes, just showing the blue and white power","post_message":"Police have corrected the total number of people arrested during the protests on Friday night to four people. Those individuals were arrested after they refused to move from the roads during demonstrations."}]
