[{"comment_id":"1721734318116068","commenter_b":"Ean hahaha","commenter_a":"Daniel Howe","post_message":""},{"comment_id":"1826661334287644","commenter_b":"These two comments made me laugh out loud!","commenter_a":"I didn't see Elizabeth Warren in there...","post_message":"Can you imagine seeing this in the distance? Unbelievable..."},{"comment_id":"10154888986680579","commenter_b":"Build that wall..","commenter_a":"Where will he get the money if he cuts taxes with our huge debt? Borrow it?","post_message":"Military Only: Your choice for 2016?"},{"comment_id":"799386623536836","commenter_b":"I guess those two hundred people needed to find a safe place?","commenter_a":"Come to St. Petersburg...right across the bay!!! We're much smarter HERE!","post_message":"\"Of course, we're in Florida, you're going to boo.\" - Amy Schumer after being booed for making jokes about Donald J. Trump"},{"comment_id":"1318881848134860","commenter_b":"Suck it up Buttercup","commenter_a":"Good , If the press would stay neutral, as they should, and report only factual information, instead of just what creates more drama, then they'd get the respect they want.","post_message":"For a year and a half, the press smeared, attacked, and belittled Middle Americans supporting Trump. Now they want respect? Sorry, that's a two way street."},{"comment_id":"10153528018151717","commenter_b":"She really most likely break the toilet seat when she sat and clog the toilet anyway....best she go to Wall mart to do her business anyway cause she will fit in so much better being in her own element.","commenter_a":"This doesn't have anything to do with being fat, and she isn't mentally ill. She is suffering from an illusion, and that is anyone gives a rat's ass about her opinion. I don't even think she can afford to shop at Target, and if she did she'd pay for it with food stamps. Her kids get free lunch at school, and are probably on state Medicaid. Point being, she is depending on the government to sustain her lifestyle of having as many no-neck young'uns as she can have. Probably only has sex in order to procreate and we are screwed up. I wonder what her white trash, holy roller agenda is all about?","post_message":"A serious kook attack has been captured on video."},{"comment_id":"662069217316990","commenter_b":"Sorry Bitches !!! Go to jail !!","commenter_a":"Yes!!yes!!!!!yes!!! that;s a shame!! just think?? if that was your mom! or dad????","post_message":"These thugs tortured nursing home patients for an insane reason. These two are monsters. Let's lock them up and throw away the key. Do you agree these thugs should do life?"}]
