[{"comment_id":"1069291126441959","commenter_b":"WHEN DO WHITE PEOPLE GET TO TAKE THE COUNTRY BACK.......","commenter_a":"Rest well","post_message":"One of the Dallas police officers killed in the sniper attack has been identified as DART Officer Brent Thompson, 43. He is the first Dallas Area Rapid Transit officer to be killed in the line of duty. \"Our hearts are broken,\" DART spokesperson Morgan Lyons said in a statement. \"We have received countless expressions of support and sympathy from around the world through the evening. We are grateful for every message.\""},{"comment_id":"1747485088840690","commenter_b":"On god all these bitches do is tattoo they brows and date niggas who still rock dickies and cortez I live an hour away from Clovis","commenter_a":"Man pussy can't be that scarce in NM","post_message":"WTH: New Mexico mother and son face jail time for incest! #NewMexico #Incest"},{"comment_id":"586880071512025","commenter_b":"How about all the hate crimes and murders committed by Muslims? Islam is pure evil. So is Obama & Lynch.","commenter_a":"How many Americans were either killed or injured by Muslims in 2015??????","post_message":" is a pernicious thread that connects the act of violence against a woman wearing a hijab to the assault on a transgender man to ...\""},{"comment_id":"1107644279295319","commenter_b":"I don't agree and what she did is wrong. But Trump can suggesting banning all Muslims from the USA and get away with it?","commenter_a":"Strange but when these muslims say and do the same things..Nothing happens....WHY...","post_message":"The devout Christian has been ordered to do community service"},{"comment_id":"10153845002233984","commenter_b":"They can both suck deez nuts lol.","commenter_a":"Jeb may not have expected the question, but he handled it well. The conditions underlying the two events were not comparable. Megyn's comparison was a stretch.","post_message":"Megyn Kelly just took Jeb's criticism of Hillary and threw it right back at him with one question he did not see coming... Do you think Megyn was wrong for using this analogy or was it a fair question?"},{"comment_id":"773429869426968","commenter_b":"This is why the crooked libs are trying to let illegals vote. Another law breaking move. Criminals. That's what libs are.","commenter_a":"He is a waffler. Stop the insanity. Everyday. He takes a different stand. Go away. Please","post_message":"Trump's rally in Phoenix, Arizona immediately made headlines all over the country - and there's 10 big reasons why..."},{"comment_id":"10154124888373812","commenter_b":"The jobs that illegal immigrents work in this country are jobs that, #1 citizens of this country are unwilling to work and #2 jobs that employers are not willing to pay a fair wage for. That's where this country needs to start. We can build a wall that anyone who wants to cross will and does.","commenter_a":"13 million might get you just under a mile of fence.....and I'm not talking chain link. Trump would be first in line to throw in his overpriced bid.","post_message":"President Bill Clinton tells Donald J. Trump supporter “If you want to build a wall along the Rio Grande and spend $13 million, then you should follow him like Moses into the Promised Land.”"}]
