[{"comment_id":"10152984814394641","commenter_b":"Ban Islam!","commenter_a":"if you Arrest Jihadist, you are hurting religious sentiments of Muslims. Beware!","post_message":"Five men arrested in France, accused of belonging to jihadist cell that was recruiting young people, authorities say."},{"comment_id":"10153358285837439","commenter_b":"Well done Mr. Abbott! He should go one step further and ban/kick out ALL Muslims from the great continent of Australia!","commenter_a":"I am Australian and applaud this action by Tony Abbot. He is a staunch Catholic Christian, and a former Rhodes scholar who from what I,ve heard him say is aware of the fascist doctrines of Islam. Why other Western leaders insist on appeasement of Islam and jihadists is incomprehensible. And more importantly, suicidal.","post_message":"@webpagelink"},{"comment_id":"1574345245925141","commenter_b":"Hillary is a superpredator of immigrants and minorities. Bill is a superDUPERpredator of young women. She panders to Muslims who kill gays and rape women. Hypocrite superpredator. Ouch...","commenter_a":"We Americans know trump is weak. Trumps first trip to Mexico was a failure. He came to lie to American people just hours after the visit. Shame trump","post_message":"Thank you - Conservative Party of New York State. An honor to receive your endorsement! Together, we will MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10154432726796320","commenter_b":"Another white woman mad","commenter_a":"Oh let's not forget how a caucasian family looked away from there child in Disney and the alligator got him(🙏🏾) did they drag his parents threw the news talking about their backgrounds? Nooooooo but a African American child falls in a gorilla pit and they put his fathers picture up and he wasn't even around!!!!","post_message":"In a dramatic image, a protester is grabbed by police officers in riot gear after she refused to leave the road in front of the the Baton Rouge Police Department Headquarters on Saturday. She has been identified by multiple media outlets as Ieshia Evans, 35, a nurse and mother of a 5-year-old boy. (AP Photo/Max Becherer)"},{"comment_id":"10153223808830927","commenter_b":"IS IT A DONT PAY TAXES PROTEST","commenter_a":"It gives the bum a purpose in life to boycott something, anything! Bless his pathetic excuse for a heart!","post_message":"Why is Rev. Sharpton urging people not to watch the Oscars this Sunday?"},{"comment_id":"10153948150211680","commenter_b":"Someone has butt hurt, I'll keep licking my windows while you keep hoping for your 72 virgins.","commenter_a":"Is Trump seriously just now realizing his supporters are a bunch of window-licking water heads? Donald, you are talking to the craziest people in the country. You could literally take off your shoe mid-speech, hold it up to your ear, say you’re getting a call from Batman and they would be quiet until you hung up your shoe.","post_message":"Donald J. Trump: \"Premiums are going to go up at 116%...Unless I get elected, in which case, you won't have to worry about it.\""},{"comment_id":"10153079679845950","commenter_b":"What a dumb ignorant bitch","commenter_a":"When it's not your turn, it's NOT your turn! That is how press conferences work people!!! TRUMP 2016 :)","post_message":"JUST NOW: Donald J. Trump tells reporter Jorge Ramos to sit down, has him escorted from press conference: \"Go back to Univision!\" \"You can not deport 11 million people,\" he yells: @webpagelink"}]
