[{"comment_id":"10153520838606051","commenter_b":"She needs to go to prison, too. Hope they sterile her so she can't bring anymore babies into this world for her husband","commenter_a":"Your husband should be on death row, and never see the light of day. To murder an innocent baby shows the cowardice and evil in his heart. He can't be allowed to live...he's a threat to society. One question...how can you defend his actions? He MURDERED your BABY...absolutely disgusting, both of you.","post_message":"This woman's husband was fed up with his son crying so he hit him so hard that it killed him. Now, she has one message for all the people criticizing her husband."},{"comment_id":"590616211130377","commenter_b":"Let her go live in one then.","commenter_a":"Deluded to the point of madness","post_message":"Nancy Pelosi Has To Be The Stupidest Person To Ever Walk The Planet!"},{"comment_id":"10156094482870354","commenter_b":"Throw that fat stank ass pig in the pen!","commenter_a":"She deserves the same","post_message":"***UPDATE***"},{"comment_id":"10154457609673812","commenter_b":"#RIP @MuhammadAli #MuhammadAli #TheGreatest @webpagelink","commenter_a":"RIP and praying for your family","post_message":"BREAKING: Boxing legend Muhammad Ali has passed away at age 74, according to family spokesperson. @webpagelink"},{"comment_id":"10155295092495579","commenter_b":"Liar!","commenter_a":"Zero evidence that Russia had any influence in our elections , period. The only people that believe this are the liberals that hate Trump.","post_message":"President Trump: \"To be honest, I inherited a mess. It's a mess. At home and abroad. A mess.\" Watch full news conference here: @webpagelink"},{"comment_id":"10153639993996135","commenter_b":"She is a criminal....wake up!","commenter_a":"Her speech was excellent! Very well spoken and original.","post_message":"What did you think of the First Lady's speech?"},{"comment_id":"10152805783329342","commenter_b":"Kristine Bak","commenter_a":"It's been ALWAYS happening ....everywhere","post_message":"WARNING FOR PET OWNERS: There's a growing trend called dog flipping; someone takes your dog and then tries to sell it, and it is happening right here in Houston. FULL STORY ---> @webpagelink"}]
