[{"comment_id":"483709631819617","commenter_b":"FUCK HER and THEM. NONE of THEM HAVE THE AUTHORITY OR POWER to TAKE OUR GUNS!!!!!!!!","commenter_a":"She wants to dictate just like her husband. Make laws she has no business making, and breaking laws as they see fit.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"256034241501428","commenter_b":"Hahah aww","commenter_a":"@username it'll be belated but you'll get it lol","post_message":"Pretty much #ValentinesDay #WSHH"},{"comment_id":"10153129588721051","commenter_b":"Bitch, the only person rotting is you.","commenter_a":"The US has went to hell. Gays allowed, and 10 Commandments comes down. Shameful.","post_message":"Should this Ten Commandments statue stay up?"},{"comment_id":"735262859947913","commenter_b":"If Melania was one of my students, she would be sitting in my office now for a little chat about plagiarism and the consequences according to school policy. Similar to students in the past, she is defensive and blaming others for her plagiarism.","commenter_a":"And the Deval Patrick 10/15/06 vs President Obama 2/8/16","post_message":"Compare Melania Trump’s speech with Michelle Obama’s 2008 speech. Donald J. Trump campaign denies the speech plagiarizes parts of Michelle Obama's: @webpagelink"},{"comment_id":"1505750879440568","commenter_b":"@username...you\"re a stupid girl.","commenter_a":"I really feel like if the voting system was trustworthy Trump would win. His crowds are just insane and people are so enthusiastic about him. However, I don't trust the system and I'm scared to death that she will win because it will be rigged. I am literally terrified of the possibility that she could be our president. I have legit anxiety about it.","post_message":"The election was supposed to be over months ago. But certainly this week it was not supposed to be in question. Hillary should have been... They're already planning inaugural balls and all the other trappings that go with victory. This is not where they wanted to be, and with the possibility Trump could win, they are in abject panic. And it's being demonstrated on TV."},{"comment_id":"10153119045143145","commenter_b":"You are actually showing your colors, stop trying this woman about race card when it was all about race.","commenter_a":"She was stupid and uncooperative. Why didn't she just do what they asked her instead of acting like a complete assh*le.","post_message":"This woman got into a road rage argument in a school parking lot. Then this is what happened when police arrived. #WFTV WATCH THE VIDEO: @webpagelink"},{"comment_id":"1757028301196802","commenter_b":"@username more than likely you are a illegal alien .","commenter_a":"Just the thought of having a mother/grandmother in the highest office..refreshing! Go Hillary! Have a great day with your wonderful family!","post_message":"Happy Mother's Day to Charlotte's mom, and my wonderful daughter, Chelsea Clinton."}]
