[{"comment_id":"10153783158317894","commenter_b":"Where do you find women naturally shaped like that without intense waist training?","commenter_a":"I do question if she's had work but there are woman shaped like that in life actually. Not all women have that tire around their waist. Only reason I question her because her butt never changes size despite increasing or loosing weight and mine definitely does.","post_message":"Kim Kardashian Claps Back at ‘M.I.L.F. $’ Photoshop Accusations: ‘F*ckYoPhotoshop’ [Photos + Video]"},{"comment_id":"10156238965050354","commenter_b":"Hillary isn't change She is Washington She is the establishment Everything that is wrong with America Is what Hillary represents!!!!!!","commenter_a":"Are lawmakers going to allow themselves to be sued when a citizen is killed because they can't protect themselves?","post_message":"DEVELOPING..."},{"comment_id":"548865588651254","commenter_b":"How touching❤️","commenter_a":"Love this and will remember when choosing between Home Depot and Lowes!","post_message":"This disabled vet was having trouble finding a job because of his service dog — so Lowe's hired them both."},{"comment_id":"10153881891966782","commenter_b":"I think you ladies are missing the point of the story","commenter_a":"Here let me help you pay attention Army=soldier Navy=sailor Marine corps=marines Air force=AIRMAN you're welcome get it straight","post_message":"A Kirtland Air Force Base soldier and his wife are getting a lot of attention for something they posted online. @webpagelink"},{"comment_id":"10155456219056509","commenter_b":"Both are adulterous stalkers.","commenter_a":"Trump is lying about his own words he says he didn't do what these women say but on tape he brags he did. What a liar, lying Trump calls himself a liar. LOL","post_message":"For some women, Donald J. Trump's denial of wrongdoing has made them feel compelled to speak out"},{"comment_id":"10154746027261350","commenter_b":"He's the Man!","commenter_a":"@username thought you'd appreciate this story.","post_message":"WATCH: 8 years. Over 2 million photos. White House photographer Pete Souza has captured some amazing moments during President Obama time in office. @webpagelink"},{"comment_id":"10153137359278717","commenter_b":"Yeah. It's so good because her employees are rubbing their private parts in your food.","commenter_a":"Lol! Good for her. The restaurant is so small, that I'm sure the other patrons were thankful for that. Btw she has GREAT food at her diner.","post_message":"The owner of Marcy's Diner in Portland, Maine says she doesn't regret yelling at a crying child despite the bad reviews she's been getting on Facebook: @webpagelink"}]
