[{"comment_id":"10153013319096336","commenter_b":"Alison, your a sad sad little mind young women. I sure hope you're raising your children better than you. SMDH #m0r0n #Gruber #StickAndStones #TruthHurts #ByeBye #LordGiveMeStrenthFromStupidPeople","commenter_a":"I knew as soon as I heard it was a \"produce truck\"","post_message":"\"A brush of death definitely came over me.\" – passenger Joel Bingham As more details emerge in a California train derailment that left dozens injured, investigators say the truck involved was not stuck on the tracks."},{"comment_id":"10153158889713837","commenter_b":"Yes, where kids have easier access to that stuff...*smh*","commenter_a":"Thank goodness. Maybe the tide is turning. Where nothing has been off limits, fortunately Playboy has made the decision to no longer contribute to the filth that saturates the marketplace.","post_message":"NO MORE NUDES! Playboy magazine has announced that it will eliminate nude pictures from its pages. But it's OK, you only read it for the articles, right?"},{"comment_id":"10152610651920667","commenter_b":"This girl is beautiful. Mrs. Rancic is just trying to make herself relevant by saying idiotic ridiculous comments. Amazing what people will do to try and get noticed.","commenter_a":"E! Should cancel the show, before they cause more trouble for them selves","post_message":"In dishing about all the red carpet looks on E!'s Fashion Police, Giuliana Rancic cracked that Zendaya probably \"smells like patchouli oil ... or weed.\" And an angry Zendaya took to Twitter to say there is a \"fine line between what is funny and what is disrespectful.\""},{"comment_id":"1390819424294656","commenter_b":"Esta es la barbaridad de el aborto La Nina nacio viva, y la dejaron morir.Dios va a traer juicio , sobre todos los que derraman sangre inocente.","commenter_a":"That's not an abortion,that's disgraceful","post_message":""},{"comment_id":"10153665410768352","commenter_b":"Where is that bitch I want to slap that Bitch","commenter_a":"So sad ...so many stories lately of mother's loosing their minds....it would be really nice if dad's would start manning up and helping more.","post_message":"A Hungry 5-Year-Old Dials 911 Pleading For Food After His Mom Abandoned Him And A 10-Month-Old Baby At Home Alone"},{"comment_id":"10153703496814087","commenter_b":"#Notwithher #FrackyouHillary","commenter_a":"Hillary is all about terminating babies","post_message":"“I want to say something about this, since we’re talking about the Supreme Court and what’s at stake,” Hillary Clinton said at last night's Democratic debate. \"We've had eight debates before, this is our ninth,” Clinton said. “We've not had one question about a woman's right to make her own decisions about reproductive health care. Not one question.”"},{"comment_id":"546417122231127","commenter_b":"You're so racist it's sick. Tell that to the kids who can't go to school because they can build multimillion dollar stadiums or provide tourist attractions all while shutting down schools. You grew up a sheltered white girl. I already know.","commenter_a":"They lack the testicular fortitude to do this on a Saturday night around 2 Am in Miami 's Liberty City or Overtown or in front of Snoop Dog's house in LA. Instead they go on a Sunday afternoon, when this office is closed. I see nothing but loudmouth cowards with missing teeth and bad clothes.","post_message":"White Lives Matter group protests outside of the NAACP in Houston's third ward! #WSHH #NAACP #Houston #WhiteLivesMatter #BlackLivesMatter #AllLivesMatter"}]
