[{"comment_id":"10154504498488655","commenter_b":"@username You can tell 84Lumber just how much we don't need illegal immigration: www.84Lumber. com","commenter_a":"Hmmm if they wanted to show people on the path to becoming legal Americans, why didn't they show them going to the embassy and applying for a visa? Some dramatic music while they fill out paperwork","post_message":"Who didn't see right through that?"},{"comment_id":"864428380327492","commenter_b":"Ruth, you're an idiot.","commenter_a":"Just proves they hate women and wish we were their slaves ... can't believe we have to fight for human rights for women still .. please tell me why anyone voted for this disaster","post_message":"Republicans will move to strip all federal funding for Planned Parenthood as part of the process to dismantle Obamacare, House Speaker Paul Ryan said"},{"comment_id":"10152975606714205","commenter_b":"Oh me and Lamar was talkin bout it all day lol","commenter_a":"Nae you hear about this??","post_message":"Rapper Rick Ross arrested after pistol-whipping a man."},{"comment_id":"10154331232125530","commenter_b":"Lol frfr and I would have them together honey","commenter_a":"@username they should put U in charge","post_message":"Fire up, Detroit Lions fans! Cheerleaders will be on the field soon!"},{"comment_id":"1570144263286969","commenter_b":"AMEN. Michele sure didn't/doesn't get it!","commenter_a":"I agree","post_message":"\"There is one crucial sentiment Donald Trump’s Slovenian born wife certainly didn’t copy from Obama’s — the inherent pride of being an American citizen.\""},{"comment_id":"10154826794495673","commenter_b":"@username is the picture of white privilege. Southern white belle. She was raised that way. She can't help it that she was taught to not think for herself and be afraid of being touched by a black person.","commenter_a":"HELL NO!!! This black racist woman is a poor excuse as a human being, she would only use and abuse the American people just as her failure of a husband did. No more Obama's or Clinton's should be allowed near The White House!!","post_message":"Do you think Michelle Obama could make a good president some day?"},{"comment_id":"10153792306655329","commenter_b":"Love watching this grossness!","commenter_a":"Tom Genaway","post_message":"jlskjerssjklrjsl"}]
