[{"comment_id":"10154787098266438","commenter_b":"@username exactly, many of the \"1%ers\" are pro choice liberals, they can fund it.","commenter_a":"Just goes to prove, don't make women angry. We don't get even, we get revenge. Elected officials had no idea what they did. This is just a start. With Elizabeth Warren, Bernie Sanders, Schumer, and many others we will take our rights back. Ryan and Trump need to be scared, very scared.","post_message":"Huge crowds everywhere from D.C. to New York to Chicago to LA to Memphis to Nashville to Raleigh to Denver to Idaho ..."},{"comment_id":"1015377538499586","commenter_b":"Once they gain a hold in our political system does anyone think they won't usher in Sharia Law? Incompatible with our Democratic Republic!","commenter_a":"When Islam got started it destroyed what was decent in the Middle East. It's incompatible with anything.","post_message":"\"Do you think, fundamentally, Muslims from the Middle East are incompatible with American democracy?”"},{"comment_id":"1650734271857952","commenter_b":"Fk her old dying ass","commenter_a":"This heifer is so predictable...\\\\","post_message":"Wasting no time..."},{"comment_id":"10153014611669138","commenter_b":"\"Land of the free\"? Should be able to go where ever the hell we like! A sign isn't going to stop me","commenter_a":"Sheesh. Just did this last year and yeah it was slippery but everyone knew you did it at your own risk. As for the stairs being closed well you could step over the chain they put to block it. I'm actually taking my boyfriend in the next couple weeks since he's never been.","post_message":"\"The Park Board is disappointed that local media is encouraging this behavior by covering it without explaining that it is dangerous and illegal.\""},{"comment_id":"10155225064836509","commenter_b":"I always wondered how these bathrooms would cleaned. A typical janitor would violate the law twice if he/she cleaned these bathrooms. Or maybe they just don't get cleaned at all","commenter_a":"Hillary's a racist bigot!! She's disgusting! Calling all black people \"Super Predators\" is beyond uncalled for and her beliefs and policies have shown her disdain for the community. Only racists and bigots could support a lying criminal old white lady like her. We arent in the 60s anymore, the \"good 'ol Goldwater\" years are over. Ya know Hillary, you remember saying you were a \"goldwater girl\"?! The same group that opposed the civil rights movement?!!","post_message":"JUST IN: A federal judge has temporarily blocked the University of North Carolina from enforcing the state's so-called \"bathroom bill\" from applying to three transgender plaintiffs."},{"comment_id":"10153126452213854","commenter_b":"Yep, idiots. Gays will lose more than their heads from muslims.","commenter_a":"Good luck with that","post_message":""},{"comment_id":"753368658095076","commenter_b":"Some people should not be allowed to breed, let alone having these many kids. Birth control should have avoided all these tragedies. Imagine the mental damage done to the remaining children.","commenter_a":"\"F\" er...period.IF...this is true...","post_message":"She confronted the father of one of her kids in court."}]
