[{"comment_id":"1044706655577881","commenter_b":"She know she be giving up the boot-Tay lmao","commenter_a":"This isn't even news! Yes fox 10 just post BS stories that are none of our business....","post_message":"SOUND OFF: This is Chelsea. She's 20, lives in Florida, and travels the world with men she meets online... on their dime. She says there's no pressure to do anything other than hang out with these men. What do you think? Let us know, and we'll share your comments on FOX 10 Arizona Morning!"},{"comment_id":"10153383817802061","commenter_b":"Super cute","commenter_a":"Dad's are important too","post_message":"WATCH: Heartwarming and powerful new message with NFL's DeAngelo Williams, Jason Witten and Ben Watson on spending time with daughters, as they do their hair and bond with them."},{"comment_id":"1832396510332680","commenter_b":"Should we really call it entertainment..I call it junk","commenter_a":"Why do you suppose Liberals love the entertainment biz and wanted control over it..it's one of their mainstream vehicles to get their agenda across...so much for entertainment anymore..","post_message":"“The music industry suffered a melt down on national television during the American Music Awards – launching into unhinged, profane tirades directed at President-elect Donald Trump and his wife, Melania,” Todd Starnes writes."},{"comment_id":"10152833954741051","commenter_b":"Here we go with those damn pit bulls again. They should be banned from the United States","commenter_a":"Show any dog love & they'll be loving..!! Shame on the owner for not providing that..!! Now a dog that could've been a great pet gets euthanized & the poor lady gets hurt. Lose/lose situation...","post_message":"This woman was taking part in the Ice Bucket Challenge in her backyard when, all of a sudden, all hell broke loose."},{"comment_id":"2159179167640729","commenter_b":"Shut up you liberal ugly lying witch that THINKS she's as beautiful as Melania Trump (secretly jealous of her) get off the tv cause no one wants to look at or listen to you skank!","commenter_a":"Boo👀jk😊","post_message":"\"I feel like it was an attempted bullying.\""},{"comment_id":"10154383392767894","commenter_b":"These two witches are beholding to special interests!!! Drain the swamp!!!!","commenter_a":"did not help ...","post_message":"These two Republican senators voted against Betsy DeVos."},{"comment_id":"10153636723007507","commenter_b":"^This is feminism. Mmmmm smell the equality!","commenter_a":"You know what? Doctors have been ignoring women's pain as imaginary forever. Everything is not about race.","post_message":"The need to constantly reiterate black humanity—because that’s what this comes down to—is both fatiguing, and frankly, infuriating."}]
