[{"comment_id":"10153676761856623","commenter_b":"I just don't understand how people would want to vote for this lying deceitful person with a terrible plot up her sleeve! She is a lying snake! Now I'm not saying a support trump either but this lady is just flat out terrible!","commenter_a":"I also keep two calendars, one for business one for personal stuff.","post_message":"Hillary Clinton kept two calendars when she was secretary of state — one for the public, but another that included meetings with political donors and loyalists, Wall Street bankers and Clinton Foundation contributors."},{"comment_id":"10153489123235496","commenter_b":"Spay her quick","commenter_a":"When in the hell are we going to sterilize these sows. After the second child tie a women's tubes. That way she can be with as many as she wants, but tax dollars aren't supporting her & her brood!!!!!","post_message":"The woman was taken into custody Friday after deputies found eight children at her residence in conditions described as 'as bad as it gets.'"},{"comment_id":"10152884212556636","commenter_b":"I'm just waiting for the first comment to blame the feminazi conspiracy to neuter us poor downtrodden beta males...","commenter_a":"That would be defined as sexist. People are supposed to be interviewed based on experience, education,","post_message":"'Can you wear more make up next time?'..."},{"comment_id":"10153666146819099","commenter_b":"Shut up you dumb broad","commenter_a":"Get guns off the street. It's time for stricter gun laws.","post_message":"A 30-year-old wanted criminal with 12 prior incarcerations allegedly shot a 33-year-old NYPD officer in the head in East Harlem, authorities say ----> @webpagelink"},{"comment_id":"10153203883521717","commenter_b":"I was raped by two women when I was 5 years old","commenter_a":"InB4 feminists saying men can't be raped.","post_message":"Human trafficker who forced men to have sex for 20 hours every day gets 11 years in prison"},{"comment_id":"10153742106021167","commenter_b":"The smartest bag of dicks!","commenter_a":"Wow you people are about as smart as a bag of dicks..","post_message":"Conservatives are now demanding the FBI director explain to them why their fantasy version of the email “scandal” doesn’t match his factual one."},{"comment_id":"775509592583157","commenter_b":"@username they are home how about the real immigrants go home for a change ?","commenter_a":"Illegals come here from Mexico looking for a better life yet they want to turn the U.S. into Mexico...freakin' crazy, and stupid!","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"}]
