[{"comment_id":"10154220777628487","commenter_b":"u rude fuck","commenter_a":"I always find it irritating that a typical response to vegetarians/vegans is something along the lines of \"it's fine as long as you don't push your views on others.\" As a lifelong vegetarian for ethical reasons, I go about my day constantly reminded that the vast majority of the people I encounter are active proponents of what I consider to be systematic violence that trumps the holocaust. Imagine believing that and being expected never to mention it. I actually don't mention it, because I've found that people simply do not give a fuck about the suffering of animals, and it is far too depressing to endure such conversations. But it continues to irritiate me when people say, it's fine, just don't push your views on others.","post_message":"Russell Simmons, founder of Def Jam and author of \"The Happy Vegan\", teaches us how to defend the plant-based diet that many love to hate."},{"comment_id":"1642335606053552","commenter_b":"It's a shame what Obama has done...","commenter_a":"We'll See If You Mock Jesus When He Returns For All Us CHRISTIANS! CHRISTIANS Are Praying for You Obama.......","post_message":"Wow. Thank you for defending Christians David Cameron."},{"comment_id":"1004765479656630","commenter_b":"That's no lady. Bigger dick than Barry.","commenter_a":"Disgraceful First Lady","post_message":"Hot diggity dog..."},{"comment_id":"1576359559329284","commenter_b":"She's enabled men her entire life! Her big weakness ... Last thing we need is a woman enabler running America.","commenter_a":"Did she really just compare Donald trump to native Americans going off the reservation?","post_message":"Hillary Clinton brushes off Donald J. Trump's sometimes personal attacks against her as him being \"off the reservation\" — something she said she has experience with. @webpagelink"},{"comment_id":"831982023505806","commenter_b":"This woman needs to take the beam out of her eye before plucking the speck out of mine.","commenter_a":"The key point is she CHOOSES what to wear. So long as it is her choice, and not forced upon her, that's fine.","post_message":"Christian mom explains why she decided to stop wearing leggings:"},{"comment_id":"10153460908891680","commenter_b":"Len Williams Carver Hillary is a SHILL for Wall Street and the Big banks. Do you need a road map to follow the money?? 3 speeches for $675,000 from Goldman Sachs and you don;t find that troubling??? She said she would release those transcripts then reneged on her promise. So she LIED again! A Clinton trait! #BernieSanders","commenter_a":"Apparently to her a democrat is someone who switches their mind on same sex marriage, fracking, corporate executives, and Middle Eastern Wars all over the course of 10 years #Bernie2016","post_message":"LISTEN: New Off Message with Glenn Thrush - Hillary Clinton sits down with Glenn Thrush following a campaign event in Syracuse, New York. The former secretary of state compares Donald Trump to foreign demagogues and says she's not even sure her primary opponent is a Democrat. SUBSCRIBE: @webpagelink"},{"comment_id":"1887850284608044","commenter_b":"She was obviously impaired with alcohol, Thats how these freaks work!!!","commenter_a":"But the teen is also partly to be blamed. Knowing very well he is a disturbed 40 something dude who worships satan, how can u be ignorant on the values of his life. Why dint u just stay away from this monster as he wld embody all things evil that which is the hallmark of satan n the devil.","post_message":"Jailed for nine years"}]
