[{"comment_id":"10156409017440354","commenter_b":"Hillary is a stupid c*** and anybody who votes for her is a f****** moron.","commenter_a":"@webpagelink George Soros is the money and the monster backing them all!","post_message":"Don't ask questions. Just trust Hillary."},{"comment_id":"10153403140121037","commenter_b":"If she looks like that at 65, I want some of what ever she got hahahahaha","commenter_a":"getting paid to be in the media daily ? yeah nervous about something","post_message":"Watch the full video: Katie Couric speaks with Vanity Fair writer Buzz Bissinger and stylist Jessica Diehl about #CaitlynJenner's groundbreaking cover story."},{"comment_id":"1681683485379770","commenter_b":"That should be a crime leave OUR money alone I'm sad to see this .don't we have rights what was this country built on!!!","commenter_a":"Why !!!!!! Muslims ????? Why !!!!! They need to remove there burkka and all the drag queen garb all the poof ta\"s wear !!!!!!!!","post_message":"\"In God We Trust\" To Be Removed From The Dollar Bill Leave the dollar alone. Are country was built on Christian beliefs. Do you think they should leave 'In God We Trust\" on the dollar bill?"},{"comment_id":"10153200958788837","commenter_b":"?","commenter_a":"That cop needs to be arrested for having an illegal \"agresive breed\"","post_message":"PUPPY THROWN - Local 10's Michael Seiden has the latest on a poor little puppy that was thrown from a passing car right near the North Miami Beach Police Department"},{"comment_id":"1246630588734477","commenter_b":"This braindead liberal moron should be put in a cage and shut her stupid mouth","commenter_a":"She's getting fatter and fatter too !! 😎","post_message":"Hit 'LIKE' if you think Whoopi is a complete IMBECILE who has no business being on national TV!!! @webpagelink"},{"comment_id":"10154884648408984","commenter_b":"The old saying ...behind a good man is a great women.... nothing wrong with that","commenter_a":"Very impressive - I have watched her handle exceptionally tough and even hostile interviews exceptionally well. Great job!","post_message":"Trump's campaign manager, Kellyanne Conway, is the very first woman to run a victorious presidential campaign. After the election, she reveals why Trump chose her..."},{"comment_id":"10153633420073132","commenter_b":"Keep up with the misogyny","commenter_a":"These are the lowest life, vilest example of human being that exist today. And that's the best that I can say about them.","post_message":"\"We aren't sisters, we never were. We just dated the same guy at the same damn time.\" - Kendra Wilkinson on Holly Madison"}]
