[{"comment_id":"10153742106021167","commenter_b":"The smartest bag of dicks!","commenter_a":"Wow you people are about as smart as a bag of dicks..","post_message":"Conservatives are now demanding the FBI director explain to them why their fantasy version of the email “scandal” doesn’t match his factual one."},{"comment_id":"10153481286598984","commenter_b":"Let's get this evil son of ? Out of office","commenter_a":"Wake up America Obama has an agenda and he is working it!","post_message":"This DHS agent just admitted the truth about Obama's disturbing agenda... so Obama sent his officials to do something terrible to her DAUGHTER. What do you think?"},{"comment_id":"10153097012535329","commenter_b":"Lauren Youssef","commenter_a":"Lily, Marielle we need this!","post_message":"BuzzFeed Life can confirm that these delightful Oreos are VERY REAL AND VERY GOOD."},{"comment_id":"1005120462832757","commenter_b":"and for that she deserves what amounts to life in prison?","commenter_a":"Ummm she took abortion pills and left her baby in a dumpster, then took herself to the hospital.","post_message":"\"What this prosecution makes clear is... abortion being recriminalized in America\""},{"comment_id":"10155119419651320","commenter_b":"Looks pumping","commenter_a":"THE ISSUE IS NOOOOTTTTT MUSLIM!!!!!","post_message":"Democrats hold an anti-Trump protest in Washington D.C."},{"comment_id":"1357245971012470","commenter_b":"I prefer her to LEAVE!!!","commenter_a":"The way you get around those problems young lady is to loudly speak out against radical Islam, disavow any sympathy for them or their cause, encourage other like minded Muslims to do the same. That's how you stop the American people from associating you with them. Or you could just leave the country.","post_message":"She joins CNN's Costello to trash Trump after his victory..."},{"comment_id":"10153223808830927","commenter_b":"IS IT A DONT PAY TAXES PROTEST","commenter_a":"It gives the bum a purpose in life to boycott something, anything! Bless his pathetic excuse for a heart!","post_message":"Why is Rev. Sharpton urging people not to watch the Oscars this Sunday?"}]
