[{"comment_id":"870207206369309","commenter_b":"Congress won't pass it tho, cause big business wants those workers. The chicken and meat processing plants especially. This is by far the best way to stop so many illegals coming, but don't hold your breath till it happens","commenter_a":"Who are the other 39%. I'd like to report them to ISIS...","post_message":"71% of voters said they would be in favor of Congress passing a law making it illegal for businesses to hire illegal aliens. Don't you agree?"},{"comment_id":"1786910708245530","commenter_b":"She is a liar !!","commenter_a":"Imagine a Trump led America With a vision to make us great, Builder, businessman, father, With a leader, fighter trait. Imagine factories buzzing, Oil flowing out of the ground, Coal miners packing their lunches, People talking about jobs they've found. Soldiers, sailors, airmen, marines, Showered with Presidential Pride, Strong and able to keep us safe, Respected and feared worldwide. Imagine a really, really big wall, With a big, beautiful door, Swings one way to put out the bad, The other to let in the good. ISIS not even a JV team, Russian Bear back in its cage, Iran decided to take a new deal, Israel safe from all rage. Imagine a man of integrity, A man the world will respect, A man who will fill the office With all the honor we expect. Imagine a Trump led America With a vision to make us Great, Imagine a Trump led America ...","post_message":"FACT-CHECK:"},{"comment_id":"10153571319289342","commenter_b":"¡¡¡¡Omg esta cara voy a poner si ganó !!!!","commenter_a":"Will Htx Larisa Valcy Brian Valcy Jovannii N Juliet Mendoza Luisao Roberto Galvez @username Beldy Salvador","post_message":"$400 MILLION POWERBALL JACKPOT: Are you planning on buying a Powerball ticket this week? With the potential jackpot now standing at $400 million, this Wednesday drawing could be one of the largest in U.S. history. While you're dreaming of how you'll spend your winnings, here's a look at the 10 largest U.S. lottery jackpots: #abc13"},{"comment_id":"10153723682667144","commenter_b":"It makes perfect sense to the Grand Ol' Party. Women should just kept their legs shut. Duh.","commenter_a":"Geeze, who would have guessed that access to birth control would result in lower pregnancy rates.","post_message":"An all-time low!"},{"comment_id":"1183411145055216","commenter_b":"Wake up Hillary will destroy trump","commenter_a":"Trump is walking all over Hillary. Polls showing her ahead i do not believe.","post_message":"Dorothy Woods, whose husband Ty Woods was one of the four Americans killed in the 2012 Benghazi terror attack, says that Hillary Clinton's track record proves that the Democratic nominee believes rules don't apply to her. @webpagelink"},{"comment_id":"954338344712964","commenter_b":"Idiot she has no place in the white house","commenter_a":"When her Secret Service Protectors lay down their guns, I will lay down mine.","post_message":"Hillary Clinton made the case for the United States to implement tougher restrictions on gun purchases following the terror attack in Orlando. @webpagelink"},{"comment_id":"10152579324632093","commenter_b":"especially coming from a girl who's spent plenty of time barefoot in the kitchen pregnant...","commenter_a":"That's what makes Texas so awesome.... everyone here knows their place..","post_message":"Same topic... different take. A man claims a bakery discriminated against his religious beliefs by refusing to make an anti-gay cake. @webpagelink"}]
