[{"comment_id":"10152784784428145","commenter_b":"Huh!! Woman abuser and she's a dummy for staying with him! Jerk!","commenter_a":"I guess his girlfriend is a little thug to uhh. Wow!! It should be clear now who really was the trouble maker.","post_message":"UPDATE: Zimmerman has posted bond and is out of jail. @webpagelink #wftv A judge set George Zimmerman's bond at $5,000 and ordered him to surrender any firearms. His attorney, Don West, said Zimmerman is accused of throwing a wine bottle at his girlfriend earlier this week. #wftv Reporter Blaine Tolison is live with the latest on #WFTVatNOON"},{"comment_id":"10153941098352439","commenter_b":"pigs.","commenter_a":"Simple solution. Send them back home where they can pound sand. Better still, why doesnt even one affluent opulent oil rich middle eastern lingdpm take thrm in? Why not? Hypocracy. In Abu Dabi that even have free good stugfs gor those that don't have....","post_message":"In the wake of jihad slaughter, Western leaders and media elites hand-wring and rail over \"fear of reprisals\" against Muslims and islamofauxbia - myths to distract and defend the Islamic faith. When, in fact, it is antisemitic incidents that are at record levels. Anti-Jewish attacks are daily now. No one says anything about that because it is largely Islamic Jew-hatred. Respect it."},{"comment_id":"10153833805055329","commenter_b":"@username Jordani SIM!!!","commenter_a":":') @username @username Sam Powers","post_message":"Right in the feels. Hayao Miyazaki"},{"comment_id":"1169496993094128","commenter_b":"Girl, you nuts.","commenter_a":"Don't believe everything you read, folks...apparently Nate Silver got a call from Washington, telling him to \"fix\" his poll numbers from last week. Trump is trumping HRC, and the media is lying to us all. Shoulda picked Bernie when they had the chance. #stillsanders #neverhillary #electionfraud #dnc","post_message":"Our latest polls-only election forecast gives Donald Trump an 17% chance to win the presidency. Polls-plus puts it at 24%"},{"comment_id":"1168639523214582","commenter_b":"Just another paid for asshole who got caught with his dick in his mouth. Now disbar this worthless piece of shit and scum.","commenter_a":"You cannot believe the media at all they're just liars liars and Liars and they make up s*** and tell it like it's real you can't believe nothing they say think or do and as far as thinking I think they're incapable of thinking anything they're being paid to Railroad this guy and they're going to do it for the money","post_message":"The judge in Donald J. Trump's Trump University case was just HUMILIATED... here's why he just had to undo his own ruling. This shows exactly why he shouldn't be on this case... it's time for him to recuse himself."},{"comment_id":"10154042620823717","commenter_b":"Go away and take your predator husband with you.","commenter_a":"UPDATE: Hillary Clinton has expressed regret for calling 'half' of Donald J. Trump supporters 'deplorables.' \"Last night I was 'grossly generalistic,' and that's never a good idea. I regret saying 'half' -- that was wrong.\" @webpagelink","post_message":"UPDATE: Hillary Clinton has expressed regret for calling 'half' of Trump supporters 'deplorables.' \"Last night I was 'grossly generalistic,' and that's never a good idea. I regret saying 'half' -- that was wrong.\" @webpagelink --- Donald J. Trump and Republicans quickly pounced on the remarks, which drew comparisons to President Obama's comments about clinging to \"guns and religion\" at a 2008 campaign fundraiser and Mitt Romney's \"47 percent\" remark in 2012. @webpagelink"},{"comment_id":"10154456212209060","commenter_b":"Have yall seen an uncircumcised vagina? Yikes","commenter_a":",,,,yea but have yall seen an uncircumcised penis???? Yikes","post_message":"If men can become astrophysicists or master carpenters, surely they can learn to wash? Campaigners are fighting the perception that the benefits of circumcision outweigh the risks"}]
