[{"comment_id":"1133469633342492","commenter_b":"Women's bathrooms have that too bc some haven't mastered the art of hovering. Then add on period stuff.","commenter_a":"Joke's on you, pal. Men's public bathrooms are usually pretty disgusting.","post_message":"This. Is. AMAZING."},{"comment_id":"10153538416518445","commenter_b":"Fuck the police,bitches...always smoking,","commenter_a":"wtf","post_message":"Always A Good Reminder: Police in Legal States Are Using Social Media to Bust People for Marijuana."},{"comment_id":"10153559818581519","commenter_b":"I guess you Hillary Shills were just waiting for me to log back in to kick your asses right?","commenter_a":"The West Coast was MADE for Bernie Sanders... If Washington State has gone for him overwhelmingly you can expect California and certainly Oregon to follow suit. We need this man as President! The greed of the 1% cannot continue!","post_message":"3 reasons why Bernie Sanders won’t give up"},{"comment_id":"10153915007936336","commenter_b":"TRUMP the first one to say BUILD THE WALL. TRUMP the first one to say DEPORT. TRUMP the first one to say BOMB the hell out of the ISIS Oil Fields. TRUMP the first one to DEMAND LEGAL IMMIGRATION. TRUMP was the ONLY one to say NO refugees from countries that hate America! #TRUMP2016! - the best & ONLY choice to secure America!","commenter_a":"Let me see? Agreements with murdering Cuban communists and Iranian murdering Islamic terrorists. Agreements with such allies only means that they remain our enemies!!!!?","post_message":"Breaking News: The U.S. and Cuba have reached an agreement to resume commercial airlines service."},{"comment_id":"10154557066322908","commenter_b":"feelthebern.org :)","commenter_a":"Do not vote for Bernie Sanders, he is VERY MISGUIDED!!!","post_message":""},{"comment_id":"654547928069119","commenter_b":"Her momma needed to be called..to see what a disrespectful kid she has..","commenter_a":"She deserved what she got..","post_message":"Obama supporter gives lip to police, learns very quick lesson. This is what you get when you disrespect authority. Do you think she got what she deserved?"},{"comment_id":"1308410459173725","commenter_b":"@username, you are spinning it. I said he can't run it, but he certainly doesn't have to give up ownership. Then tell me how the Clintons were able to run the Clinton Foundation when Billy was in office ? Yeah they found something in Benghazi. They found four dead Americans that pleaded for help. They found gross negligence and mishandling of top secret information on Lying Hillary's emails. Are you saying that's not true ? Name one significant contribution that Lying Hillary has done on her own besides being first lady and riding her husband's coattails a husband who she couldn't even keep happy so he found his entertainment elsewhere. Not to mention a husband that was impeached. She is filthy rich, she take huge donations from corporations, her Clinton Foundation is under investigation for taking money from known terrorists countries, she voted for the war we are in now. ...","commenter_a":"It is an abuse of tax payers dollars and highly unethical for obama to give Hillary a ride on Air Force One. She should campaign on her own dime just like Trump has to. Do you think obama would give Trump a ride ? Hell no he wouldn't. So why should Hillary get a ride ?","post_message":"President Obama plans to give Hillary Clinton a lift on Air Force One to their joint appearance, and Donald J. Trump is asking a question that has a complicated answer."}]
