[{"comment_id":"710336325799525","commenter_b":"U R A STUPID BITCH !!","commenter_a":"Yes she is a well educated lady. She puts family first and shows alot of class. She was a model you don't hear people caalling actresses names for their jobs. She also is a women who knows how to work hard , she understands the immigration system. She also understands the average needs of the normal everyday person.","post_message":"Will Melania Trump make a good First Lady?"},{"comment_id":"10153899755279218","commenter_b":"Ridiculous!!! That's y some of these mother fu#$&@# go around and do what the hell they want to do because of the justice system really lay these fuc&%$@ down do to them what they are doing to others give them the death chair it just doesn't make any sense to me...eye for an eye I don't care if its my family u did the crime u do the time I believe in 2nd chances some deserve it and some don't plain and simple","commenter_a":"K she looks HIGH AS HELL in her mugshot. Shorty clearly has a problem. Her baby should go to someone who cares, someone who will love her forever. There's no way I would let the child stay with this woman.","post_message":"MOM GUILTY: Sandra McClary, 26, pleaded guilty to reckless endangerment of her child, Anne Arundel County prosecutors said. Police said McClary's 2-month-old daughter was found in a carrier on the side of the road late July 4 in Pasadena. READ MORE: >> @webpagelink"},{"comment_id":"10152958371844342","commenter_b":"sbot negroes are just going to keep raping robbing murdering , shooting looting and then '' pointiong out no one likes them''' ahhhhh dahhhhhh mr prez-a-dent","commenter_a":"so, this was 3 years ago, and you're just now getting upset?","post_message":"\"They got a slap in the face.\" A couple is now suing the owner of a photo booth who was taking pics at their wedding in 2012. Apparently, some of the guests had racial slurs printed on their wedding day photo. FULL STORY --> @webpagelink"},{"comment_id":"10154252810014749","commenter_b":"Women should do what they please and men can lump it.","commenter_a":"Burqa is not an Islamic thing it should go away, a women should dress modestly and cover her hair.","post_message":"15 countries have pledged to support the ban for security reasons, and there has hardly been any opposition among the Muslim community."},{"comment_id":"10153126452213854","commenter_b":"Yep, idiots. Gays will lose more than their heads from muslims.","commenter_a":"Good luck with that","post_message":""},{"comment_id":"1188867387819383","commenter_b":"how about just stopping illegal immigration which brought it here in the first place","commenter_a":"Running a high powered fan inside, facing your entry door might help as you come in and out and might help them from entering your home and any that might be clinging to you!","post_message":"ZIKA is FOR REAL and it hits more than just PREGNANT LADIES @webpagelink"},{"comment_id":"789366324587278","commenter_b":"Jesus, doesn't anyone see a pattern here & this dirty insane hobag. I wouldn't vote for her if u paid me. She's evil..I pray Trump wins and try her and Ovomit for TREASON and HANG their sorry asses!!!","commenter_a":"And before everyone gets Butt hurt over this one lets just reminisce some history about the Clinton's... And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock Rose Law firm. Died of a gunshot wound to the head, ruleda suicide. 4 Ron Brown Secretary of Commerce and former DNC ...","post_message":"Clinton Mistress Reveals Herself, Drops Major Bombshell Right On Top Of Hillary This will completely derail her campaign. Do you think the last thing America needs right now is another Clinton?"}]
