[{"comment_id":"10153253514670329","commenter_b":"please shut the fuck up","commenter_a":"In what world are 12 year olds adults? The entire point of a juvenile justice system is that children are NOT adults in age nor brain development. They need mental health treatment in a correctional facility tailored to children.","post_message":"They face a count of attempted first-degree intentional homicide. (via BuzzFeed News)"},{"comment_id":"604349323031583","commenter_b":"You're an idiot. It doesn't matter what book you use to swear I could use The Heir to the Empire by Timothy Zhan and that would be acceptable. This is a secular country not a Christian nation if you want to argue that fact look up the 1st ammendment which is the freedom of religion and freedom from religion in addition to separation of church and state. If she wants to use the Quran let her if you want to use the Bible fine if I want to swear on a star wars book damn those corrupt judges I'm going to swear on my Star Wars book","commenter_a":"No. We use the Bible in this country.","post_message":"Should he have allowed her to take her oath on the Koran?"},{"comment_id":"10153171170386051","commenter_b":"Nasty ugly bitch","commenter_a":"What a sick bitch","post_message":"Police showed up at this woman's home only to find her young grandson naked. They asked him what was going on - and that's when he broke down."},{"comment_id":"835204176588028","commenter_b":"Girl really baby get check","commenter_a":"Its that flu you cant shake.","post_message":"Oh my"},{"comment_id":"10154563644004087","commenter_b":"With the illegals being deported Shitlarys vote count drops","commenter_a":"Funny but if you libturds went to Mexico and tried to live and work there illegally you would end up in prison. Libturds want open borders for cheap votes, no matter how much it harms America. See: \"The Reason Trump Got Elected\" for further reference.","post_message":"The Congressional Hispanic Caucus is requesting a meeting with U.S. Immigration and Customs Enforcement after more than 300 undocumented immigrants were arrested in raids over a 48-hour time span."},{"comment_id":"833182496827699","commenter_b":"@username is Donald Trump black daughter.. Calling a whole family criminals doesn't make you any better boo","commenter_a":"This niguh said jalapeño! Lol Dude should of gotten down and teach him how to gorilla jump that border!😂","post_message":"Border Patrol Was On Him With The Quickness!"},{"comment_id":"10153464063176509","commenter_b":"Don't correct what I wrote, Gail Mac! Mind your own business. Sarah Palin has no intelligence at all!","commenter_a":"Why her, can you not find someone better with no baggage and have a mother who has no brain.","post_message":"Bristol Palin and Medal of Honor recipient Dakota Meyer are engaged. Meyer, a Marine who received the nation's highest military honor, announced the news on his Instagram account. @webpagelink"}]
