[{"comment_id":"686077748183930","commenter_b":"so many fucking idiots in america, cant you arseholes get your shit together and just kill each other off ?","commenter_a":"He needs to normalize his fucking hair. I can't trust someone who can't accept the painful fact that his hair is gone. Fucker has been lying to himself for years. Perfect example of his personality.","post_message":"Putin talked to reporters over the weekend about his first phone call with Donald Trump..."},{"comment_id":"10155024905873487","commenter_b":"Yes, but I am going out swinging. My representatives are getting letters, resistors are getting encouragement, all entreating those who swear to protect and defend the constitution are getting my support. I grew up when you did...and felt the same way. We are to be tested. Our Republic will need yo stand. So I will too. Join us!","commenter_a":"Good-bye halcyon days of growing up in the U.S. in the sixties and seventies. Worst shock of my life was 2008. I had always, unconditionally, believed that FDR's reforms were indissoluble, absolute, perfect. Now I don't trust anything; if there is money to be made, no perfidy is too great to be inflicted upon Joe Lunchbucket and me. It was a great experiment, but the protections against the avaricious that were put in place were not strong enough.","post_message":" don think Richard Nixon even comes to close to the level of corruption we already know about Trump."},{"comment_id":"997631186950175","commenter_b":"That would be a terrible thing to do and there are many who would adopt that precious child","commenter_a":"Well if I was pregnant with a fetus with Down's Syndrome I would abort the fetus. Not everyone can raise a special needs child. I would not put it up for adoption, that would not be an option. That's just my opinion.","post_message":"Yes it does!"},{"comment_id":"10153466375525575","commenter_b":"She got her 15 minutes of fame. Should go dance on a pole now! What a ho!","commenter_a":"Magan sure isn't winning any thing after Howard strearn show about her sex life and now these pictures are coming out of Her.","post_message":"The Gateway Pundit - Donald Trump Builds on Lead After First Debate – Ted Cruz Surges to Second"},{"comment_id":"1850200075215990","commenter_b":"@username and ur moms va jj. And i was being sarcastic you simpleton","commenter_a":"No roof? Im telling you this is deeper than you all realize. Doesnt add up. Id evacuate","post_message":"Chopper 6 was over the foam spill and hazmat situation in Center City around Juniper and Lombard. The foam spilled from a fire supression system at PECO substation. More information: @webpagelink"},{"comment_id":"431677547020539","commenter_b":"Filthy muslims ,deport or tag &bag'em .","commenter_a":"That is disgusting.","post_message":"This is disgusting — would YOU want to use a sink someone had washed their feet in?"},{"comment_id":"10155125514911178","commenter_b":"hhahahaha disgusting pig!","commenter_a":"Disgusting. ...","post_message":"Can you put a price on human life? Because that's how the morally warped, Hollywood left view abortion."}]
