[{"comment_id":"1106845012659268","commenter_b":"But are they Immigrants???","commenter_a":"Stop the hate!!!","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."},{"comment_id":"10155104152711323","commenter_b":"Wow how fucking sexist can you get.","commenter_a":"I don't know who any of them are but they are pretty.... boring and vacant looking.","post_message":"'These are the kind of women who take pride in saying things like not into fashion I like style, and by they mean that men like me to wear. They think anyone who criticises Disney fetishisation of princesses is just jealous.'"},{"comment_id":"10155892133225231","commenter_b":"Nancy you have the right attitude. The train operators succumbed to some questionabally motivated sour pusses and got a snootful of bad publicity. So dumb. Ladies of that age/demographic have disposable income.","commenter_a":"Laughing and talking too loud? Those are the ladies I want to ride with!","post_message":"They had no idea that laughing and talking \"too loud\" would get them escorted off the train."},{"comment_id":"10152759006876943","commenter_b":"At least they aren't cheap whores.","commenter_a":"We have the best government money can buy!!","post_message":"\"That resulted in a second lawsuit last fall, this one in D.C. Superior Court, in which Judicial Watch attorneys argued that city health officials fraudulently authorized Congress to buy plans through the small-business site...\""},{"comment_id":"483464435177470","commenter_b":"Fuck you cunt lips","commenter_a":"The reason you are seeing her all of a sudden is to take the heat off of Obama . When thing get sticky with Obama his handlers bring out Michelle, or Biden. It is to take our minds off of Obama. Don't be fooled, Michele has no power, she is a fixture . I would venture to say she and her husband have very little to do with each other. It's for the television camera only. She was bought and paid for just like he was but her thing is just until he leaves office..","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"973167082706082","commenter_b":"Its funny, we cant have stricter gun laws becuz criminals will still find a way to get access to guns but we need to figure out a way to have stricter border patrol laws as if the illegals wont try find another way into the country lmao the logic the people have now a days haha","commenter_a":"There's something wrong with American culture, not gun control laws. New York has more stringent gun laws than Canada but has about twice the number of killings via guns. It isn't the weapons, it's the people.","post_message":"This is a conversation we need to be having."},{"comment_id":"1091478814208499","commenter_b":"what a dumb bitch","commenter_a":"Our President has made it ok to be racist again.","post_message":"Doesn't seem like EVERYTHING is racist? According to the New York Times anyway."}]
