[{"comment_id":"1796145143964177","commenter_b":"If this one was another girl we would probably try one more time and call it quits bc three is the most I could possibly handle EVER. I'm still iffy on having a third bc I can't possibly handle another Jacey lmao she crazy","commenter_a":"@username at least we got lucky","post_message":"A Brazilian couple has 13 sons and won't stop having kids until they have a girl."},{"comment_id":"10153828491470329","commenter_b":"marry me","commenter_a":"@username 2, especially 2","post_message":"We might as well put a ring on it at this point."},{"comment_id":"10153889638518598","commenter_b":"You have it all wrong. The time to take-down Planned Parenthood and stop the murder of babies is now.","commenter_a":"Excellent! State's rights in action!!","post_message":"BREAKING: Kansas Governor Sam Brownback Signs Bill to Permanently De-Fund Planned Parenthood"},{"comment_id":"10154630548633132","commenter_b":"Her stepmom Melania looks like Caitlyn Jenner lol","commenter_a":"Not being mean but she reminds me of Miley Cyrus..","post_message":"Donald J. Trump and Marla Maples daughter Tiffany is addressing the nation."},{"comment_id":"10153374154140329","commenter_b":"Karmas a bitch if you're an asshole","commenter_a":"People do spit in the food. I did it myself at McD's way the hell back when. Only when someone I really hated from school came through the line though. Nice big hock in their drink. Mmm...good times.","post_message":"\"We have all tried, and failed, to make a burger that looks like they do in the ad.\""},{"comment_id":"10153767198963690","commenter_b":"@username it is not just three countries being destroyed, all the countries in Europe to which the refugees are going will be destroyed economically, culturally, life as they know it will never be the same.","commenter_a":"Saddam a cde to be missed, a last Iraqis leader","post_message":"\"There are plenty of Iraqis for whom Saddam is a nightmare that they never want to see again. His legacy here, though, is complicated. It's not as simple as 'Dictator Bad, Democracy Good,' as the architects of the Iraq war would have you believe.\" Al Jazeera's Imran Khan, in Baghdad, filed this Reporter's Note."},{"comment_id":"1181986708533713","commenter_b":"if they don't like it they should leave America. Sure mexico, africa, iran or even canada would take them.","commenter_a":"Exactly! Behavior like this is a major part of why Hillary and her supporters just lost the election! Protesting is good, but not when you're whining about a person who won an election fair and square just because you disagree with them.","post_message":"\"This is not helping.\" One Hillary Clinton supporter in Chicago said he was unhappy with how some of the the anti-Donald J. Trump protests were being carried out @webpagelink"}]
