[{"comment_id":"10155653992935389","commenter_b":"Obama's clusterf*ck !","commenter_a":"@username, I do not think either one of them have any care at all about this.","post_message":"Question of the Day: Do President Obama and Hillary Clinton owe the families of fallen troops an apology for pulling out of Iraq?"},{"comment_id":"1121407184608726","commenter_b":"Of course it was her idea. The wicked evil witch knows she doesn't have a chance to win, even if she tries to rig, won't happen. God is in control.","commenter_a":"Why doe she not release all the crap, the Gov, has been asking for for years.? WHAT IS SHE HIDING.","post_message":"\"In the end, it was the candidate, Hillary Clinton...who wanted ducks on the ground, so, by God, we will get ducks on the ground,\" Robert Creamer says on the tape."},{"comment_id":"10154333697561509","commenter_b":"@username You jsut described yourself and your mother. You crazy old lady","commenter_a":"Have you noticed who the Trump haters are? I have.......Go Trump.","post_message":"\"Six months out from Donald J. Trump's foray into American politics, the national media is finally coming to terms with a hard truth: It's Trump's world, and they're just covering it.\""},{"comment_id":"663875460469699","commenter_b":"American news you suck! This story in all of their stories are not real! I cannot believe how many people fall for this b*******! Laughing my f****** ass off! Get a life people go spend some time with your families and try to figure out what you can do to help the country! Unbelievable! American news you suck!","commenter_a":"If they don't like our traditions don't come here...That was easy...","post_message":"The Obama administration is trying to ruin your thanksgiving. This is absurd. We can't let him get away with this. Will you still call it Thanksgiving no matter what?"},{"comment_id":"932499113450014","commenter_b":"That chick in your photo is dating a dick btw.","commenter_a":"Fuck him for treating that person like that. Scumbag.","post_message":"Fuck this guy."},{"comment_id":"1370796892943097","commenter_b":"That was the sunniest, rainy Portland day with which I've ever been blessed","commenter_a":"How's Trump in his press secretary going to lie about this one? LOL","post_message":"Incredible images of the women's march protest happening all around the world."},{"comment_id":"10153991017722235","commenter_b":"If you give a lady $10 and rape her, it doesn't make her a prostitute. It makes you a rapist.","commenter_a":"Georgia, Georgia, what are you doing. You were devastated in the civil war for your enslavement of people now you demonstrate you might need another lesson. Someone dig up General Sherman.","post_message":"YES!"}]
