[{"comment_id":"1089311434439529","commenter_b":"This surprised me.....even a blind squirrel finds a nut.","commenter_a":"The view sucks all those asswipes on that show should move to Brussels if trump gets elected..","post_message":"\"I can't believe I’m feeling this way...\""},{"comment_id":"1391331507694716","commenter_b":"Shut up hoe","commenter_a":"It's really hard to see the rest of us as people when you have to distance yourself with your extreme views and lifestyle to find some amount of self esteem. Keep fooling yourself apparently NBC loves putting you out there to keep poking us in the eye, but we know we are right and you are wrong. That is the standing in America right now.","post_message":"Rachel Maddow was nearly hysterical over Trump's speech. #RNCINCLE"},{"comment_id":"10153581092769087","commenter_b":"give us a number, @username. How many Americans should be murdered, raped, robbed or maimed by asshole criminals who should not even be here in the first place? Here are some crimes committed against Americans by Illegal ALIENS The Sanctuary city of San Francisco protected the previously convicted illegal alien gang member charged in the murder of Michael Bologna, 20, his brother Matthew, 16, and his father Anthony, 48 @webpagelink Illegal alien stabs to death 24 year old college student Lauren Bump @webpagelink Illegal alien charged with murder for vicious stabbing death of Kathleen Byham in a Wal-Mart parking lot @webpagelink Twice deported illegal alien charged with murder of Sheriff's Deputy Josie Fox, 37 @webpagelink Mary Nagle - was raped and murdered by illegal alien who then uses her cell phone to brag about crime to her friends and family @webpagelink Illegal Alien Kidnaps, Rapes, and Buries Alive an 8 ...","commenter_a":"\"I have been thinking a lot about Donald Trump, people say that he doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan, he's giving you an outline. Why? Every time that he has brought something to the table, the other candidates take it and run. Such as, immigration, \"the wall\" and other issues. I can guarantee you that he won't give you his full plans in detail until he is standing at the podium, next to one of the Democrats. THAT is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business, without a strategy, and a form of negotiation already set. This man is prepared in business and will be fully prepared when the time is right, in ...","post_message":"Republican front-runner Donald J. Trump leads his rivals by double digits in Michigan on the eve of the primary, according to a new poll."},{"comment_id":"615120388649797","commenter_b":"I don't think it should be considered treason, I think it IS treason. How do you Snopes check this? And where is the link to the Washington Post article?","commenter_a":"Guys we have no choice. They are so advanced we have no choice","post_message":"This should be considered treason."},{"comment_id":"572733119579689","commenter_b":"Yeah you gotta be a useless bitch to waste time on Amazon digging these shit custom up for a fucking baby.. NO NOT ME","commenter_a":"@username gotta do this to the baby 😂😂","post_message":"I just grew ovaries and they just exploded."},{"comment_id":"1028272853931448","commenter_b":"She wasn't even twerking she was just bn silly joking like she was. Pull up her dress with spanks under Neath......its really not a big deal. If Obama get mad about that he shitty.","commenter_a":"Carlos Aden Carlyle lol","post_message":""},{"comment_id":"10153752215990575","commenter_b":"Better yet, deport them each and every one ASAP !!!","commenter_a":"Shoot everyone of them no more rape","post_message":"Good question!"}]
