[{"comment_id":"1359337234126021","commenter_b":"Kids learn this behaviour. Violence/bullying maybe the norm in their households. Young bullies grow into big bullies unless they are dealt with","commenter_a":"Ban kicking , feet and bullying","post_message":"All because he stepped in to defend an autistic friend. Shocking."},{"comment_id":"1015872441856793","commenter_b":"She needs to be shown the door","commenter_a":"Go to mslsd with Rachel Madcow. Starting to look like her anyway.","post_message":"Is this the end of Megyn Kelly on Fox News?"},{"comment_id":"10154021624482464","commenter_b":"Adultery is one of the ten commandments thou shalt not commit adultery","commenter_a":"I vote biblically, for someone who stands for righteousness and one who cares about the things of God and not his own ambitions. A true servant of God's and the people of this nation. My vote and prayers go to @username. Proverbs 29:2 says when the righteous rule, the people rejoice. God is giving the body of Christ another chance to get this right in 2016! Cruzin all the way to the White House! My president is @username!!","post_message":"\"The only person running for president to publicly admit to have been bitten by an octopus.\""},{"comment_id":"10157197688465354","commenter_b":"I hope the Police Officers NEVER help her out again!!","commenter_a":"That bitch looks like she is having seizures when she dances! Prince way, way, way better","post_message":"~~UPROAR~~"},{"comment_id":"1182540631781356","commenter_b":"ISLAM'S WHORE","commenter_a":"One Can Only Hope!","post_message":"FINALLY!"},{"comment_id":"1093577714092941","commenter_b":"Same way any comments from Pak regarding Indians and Kashmir are irrelevant.","commenter_a":"We are talking about a region where induviduals will go as far as to hijack airliners and slam them into skyscrapers. They think anybody that doesn't conform to their sick twisted ideology is the Devil.","post_message":"\"In Afghanistan, being lesbian is seen as un-Islamic. If people found out, the result would be death.\""},{"comment_id":"1100039356678391","commenter_b":"Worthless; wait, that's an insult to worthless people......","commenter_a":"what an idiot the reason for this is all the race baiting he and Sharpton an d Holder and his other mouth pieces have preached and preached while they comdemn America.","post_message":"What happened in Ferguson, New York City? Doesn't matter where it is, it's the result of slavery. It is the result, lingering effects of slavery, Jim Crow."}]
