[{"comment_id":"10154448392979749","commenter_b":"You Muslims should pick your fight with our MPS who love starting wars to make their friends rich most English have no problem with the way you run your country and don't want to have war with you.","commenter_a":"The british people love very much to fight","post_message":"UK troops had been due to leave Afghanistan this year but will now have their mission extended into 2017."},{"comment_id":"10153211498337894","commenter_b":"Lmao","commenter_a":"If that baby head is as wide as hers… Chrissy… You in danger gurl! LOL","post_message":"John Legend and Chrissy Teigen Are Having a Baby! [Photo]"},{"comment_id":"10153270653234091","commenter_b":"It should of been called player interference he did not slide with intent to advance to 2nd his sole purpose was to take out the 2nd baseman and break up a double play you can call it dirty call it aggressive I believe the rule says you have to start your slide before you reach the base and that he did not do . With all the new rules to protect the catchers and collisions at the plate this is no different . I believe he should be suspended . Unless you want the benches to clear every time he comes up to hit","commenter_a":"Here are the rules! Evidently, the umps didn't get that memo!!!","post_message":"UNDER REVIEW: Major League Baseball executive Joe Torre will review last night's controversial slide by the Dodgers Chase Utley that broke the leg of Mets shortstop Ruben Tejada for possible disciplinary action. What are your thoughts about the play? Read more: @webpagelink"},{"comment_id":"10153121038682212","commenter_b":"Ugh. You're a woman. Why are you being so dense?","commenter_a":"Isn't there a disclaimer that states not all birth control is always 100% effective??","post_message":"More than 100 women are suing a drug company for a birth control packaging error they say resulted in unplanned pregnancies; three of whom are from Oklahoma. #News9 #CBSNews"},{"comment_id":"10153580764828352","commenter_b":"She needs to be done same way but leave her in the fire crazy birch.....stand there and ask her how it feel s and eat snacks in front of her ass she burns","commenter_a":"She look deranged with that crazy psycho stare","post_message":"Woman arrested for burning 8-year-old’s hands over open flame because she ate a snack without permission"},{"comment_id":"10154787098266438","commenter_b":"@username exactly, many of the \"1%ers\" are pro choice liberals, they can fund it.","commenter_a":"Just goes to prove, don't make women angry. We don't get even, we get revenge. Elected officials had no idea what they did. This is just a start. With Elizabeth Warren, Bernie Sanders, Schumer, and many others we will take our rights back. Ryan and Trump need to be scared, very scared.","post_message":"Huge crowds everywhere from D.C. to New York to Chicago to LA to Memphis to Nashville to Raleigh to Denver to Idaho ..."},{"comment_id":"10155053775333984","commenter_b":"Maybe someone should shove a fork up your ass bitch","commenter_a":"I hope the government is checking the silverware and other furnishings of the WH before the Obamas leave...... we all remember what happened when the last democrat family left the White House.......","post_message":"As the Obamas leave the White House, Congress has some bad news for them... and this time, they're delivering it to MICHELLE Obama. See the bad news they have for the first lady while she's on her way out the door..."}]
