[{"comment_id":"10156617842095354","commenter_b":"This is just another Obama liar. Do not pay too much attention to her....Someday everything that they have done will come back and bite them in the butt.","commenter_a":"I've got to ask: Is Shultz starting to look more and more like Jar Jar Binks? What's going on there? I must avert my eyes.","post_message":"***FIRESTORM OF DEMOCRAT LIES***"},{"comment_id":"472078136250114","commenter_b":"Haha What a bitch","commenter_a":"Good for them. If they don't like prayer they need to leave the activity. To Hell with them.","post_message":"An atheist group complained about prayers at sporting events. This is how the community responded."},{"comment_id":"10154545590463010","commenter_b":"#NeverHillary #NeverTrump #JillStein2016","commenter_a":"Hmm, funny that you could say all the exact same things about Clinton. Time to stop pretending she's better than he is. Sorry y'all - we let the US drift so far to the Right a Trump popped out, but that isn't his fault. Particularly when he isn't the war criminal candidate between the two major party offerings...","post_message":"Psychiatrists aren't supposed to psychoanalyze presidential candidates. A Yale psychiatry professor writes in Los Angeles Times Opinion:"},{"comment_id":"542727622584484","commenter_b":"she need to go home back where she came from","commenter_a":"They all look like robbers and murderers with that shit on there head.","post_message":"This Muslim woman was just kicked out of the mall because of this. If you can't follow the rules, you can't shop here. Do you think Muslims should obey the rules or leave?"},{"comment_id":"10153914495466491","commenter_b":"How is a white woman being racist unbelievable?","commenter_a":"Unbelievable that people would accuse Ellen being a racist","post_message":"Ellen DeGeneres took to social media to respond to the backlash."},{"comment_id":"984815688241627","commenter_b":"She is the best lying POS that know!","commenter_a":"She is the best","post_message":"“If you want a president who will tell you everything that’s wrong with America and who’s to blame for it, you’ve got plenty of other choices.…But if you want a president who will listen to you, work her heart out to make your life better, and together to build a stronger, fairer, better country—then you’re lookin’ at her.\" — Hillary today at the New Hampshire Democratic Party State Convention"},{"comment_id":"10153758962823445","commenter_b":"Trump wants to build a 30 trillion dollar wall. I'm guessing you thought that would be free....","commenter_a":"Everything should be free or according to Bernie. Typical politician lying out his ass just so he can get more young people votes. He needs to go back to the old folks home and have his depends changed He's so full of shit.","post_message":"Bernie Sanders: \"Pot Should Not Be a Federal Crime.\""}]
