[{"comment_id":"10153258414916770","commenter_b":"she more democrat liberal pig","commenter_a":"Megyn Kelly shouldn't be permitted to go anywhere near another GOP debate for the rest of her life after the debacle of the last one she was allowed to moderate..The sooner Fox News fires her off into oblivion the better..","post_message":"Donald J. Trump reignites the drama between himself and Megyn Kelly ahead of the January 28th Fox News Republican Debate."},{"comment_id":"1935250666534672","commenter_b":"How about i kick you instead?","commenter_a":"Look like they're from the bloody Purge","post_message":"... But refuse to quit because they 'love the limelight'."},{"comment_id":"865107826951175","commenter_b":"Who cares / she's useless","commenter_a":"And, Donald Trump(ish) is not racist, bigoted, arrogant, insensitive, and lacking in political comprehension ???","post_message":"Fauxcahontas."},{"comment_id":"10153953005567464","commenter_b":"Norma Pickford love your BS where you get it from? @webpagelink","commenter_a":"I trust you to do the right thing for America and the workers of America. Don't weaken. You keep doing your part and I will keep praying to the Lord to bless us with yo uh in the Whitehouse","post_message":"Politico reports Obama's Department of Labor is using H-1B foreign workers while many Americans are jobless. That is wrong. The H-1B visa program is broken and I have a plan to fix it: @webpagelink"},{"comment_id":"10154800990580575","commenter_b":"Lock her up.","commenter_a":"Terroristic Threat","post_message":"This Has Got To Stop..."},{"comment_id":"1584230838542469","commenter_b":"DEPORT the illegal bitch.","commenter_a":"WTF!?","post_message":"In Obama's America, obeying the law and playing by the rules is for suckers."},{"comment_id":"10154317818991336","commenter_b":"F*** Donald Trump's daughter she a hoe and she look like sid from the ice age BOIIIIIIIIIIIIIIIIII","commenter_a":"The one Trump said he'd sleep with if she wasn't his daughter . What a sick disgusting man","post_message":"Ivanka Trump is a natural!"}]
