[{"comment_id":"10155647671150354","commenter_b":"She is a racist and a total disgrace!!! She encouraged the thugs to destroy Baltimore; what a LUNATIC!!!","commenter_a":"She also believe that is disrespectful to ask a Liberal a real question and expect it answered with out making a quote that your question is disrespectful to there position. Attention Liberal Politicians: every aspect of your your public life, how you act, what you say and your political views are all fair game in the management of the public safety.","post_message":"What do you think? Was the reporter being rude?"},{"comment_id":"10154086298502541","commenter_b":"I find this horrific but please take down the pictures","commenter_a":"Where is Al Sharpton when you need him. Lol","post_message":"Police spokesman Anthony Guglielmi said that while the suspects made “terrible racist statements” against white people during the attack, it does not appear to be racially motivated."},{"comment_id":"10153653886305950","commenter_b":"Shut up, whore.","commenter_a":"The teen should have complied. And his parents did a terrible job.","post_message":"The aggressive confrontation nearly cost the teenager his life."},{"comment_id":"713882998713829","commenter_b":"...then get to it...show the American citizens that you politicians have some cajones...IMPEACH the MF'er!!!","commenter_a":"THIS IS THE FIRST TIME IN HISTORY THAT A LEADER OF THE FREE WORLD ISN'T HELD ACCOUNTABLE FOR HIS ACTIONS . AND I WOULD LIKE TO KNOW WHY.","post_message":"The American President... Or Jihadist In A Suit? ⋆ Dc Gazette... @webpagelink"},{"comment_id":"10154153489278984","commenter_b":"They are grasping at straws! VOTE TRUMP!!","commenter_a":"all president getting sworn into office! before giving testimony in a courtroom! WAKE UP AND THINK SHEEPLE","post_message":"Donald Trump just addressed some of his loudest critics head on, and it's sure to have his supporters grinning... Do you support Donald Trump?"},{"comment_id":"10153565993448271","commenter_b":"Those people are a bunch of Pathetic Savages and Thugs. Just look at their wild behavior. You would think... that the Police should have arrested scores of them. It must had been too much Rock & Roll or Punk Acid Rock.","commenter_a":"I can understand being excited but destroying public property and acting like a bunch of idiots is ridiculous.","post_message":"This is disappointing. While many people celebrated the Broncos' Super Bowl victory peacefully, some were destructive. Denver Police made 12 arrests and thankfully, no one was seriously hurt. @webpagelink"},{"comment_id":"689911851133407","commenter_b":"white trash...","commenter_a":"She needs never him also never to have children ever again","post_message":"This man repeatedly beat his wife's 5-year-old and would even send videos and pictures of the abuse to his wife. She refused to step in and both joked about beating and killing the girl. Well, a judge just decided what their punishment will be. Was justice served?"}]
