[{"comment_id":"1183766191643735","commenter_b":"Hatred is strong in those with finacial short-comings, within their own community, makes you judges their contibution to their local enviroment, and their judgment in communal affairs.","commenter_a":"This will be resolved once and forever when President Trump builds the 12 foot high electrified fence between Canada and USA. Then future youths will be electrified. US Customs and Border Patrol's workload will be greatly diminished.","post_message":"Two youths unaware of their surroundings when they were playing Pokemon GO on their cell phones made an illegal border crossing this week from Canada into the United States in a remote part of Montana, U.S. Customs and Border Patrol said."},{"comment_id":"1139906406032404","commenter_b":"you are an idiot!! AND STOP KILLING ANIMALS!! They have souls too you creep!!","commenter_a":"Ok. So release the previous 5 years. That will provide an accurate picture of what to expect when the audited returns are ready for release.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"10153222902488645","commenter_b":"@username dont worry about those nails.... worry about that mouth full of yellow teeth.... nasty","commenter_a":"Who cares? The dude is old as hell and WWE is for red necks.","post_message":"Hulk Hogan claims that he resigned from the WWE in the wake of the release of the transcript in which he used racial slurs, while the pro wrestling company says he was fired. Either way, all mention of him has been scrubbed from the WWE's website."},{"comment_id":"10153124217341051","commenter_b":"Ive seen women pulling crap everything from getting a friend to flirt to wrecking a guys car.Stupid and insecure....","commenter_a":"she was watching too much titanic","post_message":"This woman wanted to test her boyfriend's love for her by climbing over the railing on a cruise ship to see if he'd come to her rescue. You can probably guess how that worked out."},{"comment_id":"1811838059034995","commenter_b":"And her answer is I don't have an answer for you. Really because you know the answer already bitch","commenter_a":"Love this guy. So to the point it's pathetic. And I can't answer anything.","post_message":"Trey Gowdy utterly DESTROYS this liberal...."},{"comment_id":"10153723682667144","commenter_b":"It makes perfect sense to the Grand Ol' Party. Women should just kept their legs shut. Duh.","commenter_a":"Geeze, who would have guessed that access to birth control would result in lower pregnancy rates.","post_message":"An all-time low!"},{"comment_id":"10153905231158984","commenter_b":"Idiot. She'll find out how wrong this is some day. It might be hot.","commenter_a":"So sorry to hear this....","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ. This is just disgusting. She has a new movie out. Let's make sure she doesn't make a dime off of us!"}]
