[{"comment_id":"980167608741328","commenter_b":"Trump should just buy there piss ant country..","commenter_a":"So funny","post_message":"What do you think of the proposal to ban Donald J. Trump from entering Mexico?"},{"comment_id":"822346244580816","commenter_b":"Lock her up for using RNC email server for government business.","commenter_a":"I will turn off any program that has her... the \"Minister of Propaganda\"","post_message":"It's time to stop giving Conway the mic - nothing she says is true or credible."},{"comment_id":"10154419778931077","commenter_b":"I'm a female and even I like your thinking! Lol","commenter_a":"My god people would rather be trapped in the house with in laws all day!?! Got to have some place to go to get away! As long as some places are open then we can all go to the bar and strip club and still be able to make the wives believe we were at Walmart the whole time and couldn't buy anything because it was all sold out. :)","post_message":"Do you think stores should be closed on Thanksgiving?"},{"comment_id":"10154630383678145","commenter_b":"She can Rot in prison too!!! Throw everything you can at her!!","commenter_a":"LOCK HER UP THROW AWAY THE KEY.","post_message":"Officials believe LaKensha Smith-Loyd knows where her uncle, accused cop killer Markeith Loyd, is but she has so far refused to tell them."},{"comment_id":"990159621088681","commenter_b":"Party affiliation is not THE ISSUE & what you should be voting on here Is Making America BETTER, PROSPEROUS & SAFER. IF YOU WANT MORE LIES..MORE CORRUPTION ...MORE $$$$$$$ GIVEN TO THE MIDDLE EAST...MORE WEAPONS SUPPLIED TO THE RADICAL GROUPS....MORE ILLEGALS COMING IN... MORE MURDERS..SANCTUARY CITIES... ...VOTE HILLARY.. YOU are the SHEEP. THE UNION HAS MADE YOU FOLLOWERS. SOUNDS LIKE MOST UAW MEMBERS ARE WISING UP. LOCAL 909 MEMBERS HAVE. EDUCATE YOURSELVES. WATCH: CLINTON CASH HILLARY THE MOVIE HILLARY'S AMERICA 13 HOURS READ: GUILTY AS SIN PARTNERS IN CRIME CRISIS OF CHARACTER ....and so much more... Investigate the CLINTON FOUNDATION.. HOW THEY HELPED (LOL) HAITI. They stole billionsof donations from these poor people. CLINTONS ARE FULL OF LIES. THEY MUST NOT BE TRUSTED! !! HILLARY CLINTON IS A WICKED WOMAN..for those who follow LOUIS FARRAKHAN, he States this fact, he also states how obama has failed his people. Look it ...","commenter_a":"Out of all the people in this work and these two clowns are the only choice","post_message":"Donald J. Trump is speaking this afternoon at Macomb Community College in Warren."},{"comment_id":"1061054770617718","commenter_b":"I'm voting for you Hillary!!!","commenter_a":"That will be hard to do from Leavenworth. But if she thinks she can go for it. Bill will be too busy I am afraid to help though.","post_message":"“It’s clear she knows how to get things accomplished in these crazy political times. She’s still standing after decades of Republican attacks, and she’ll force them to the table once in office.” -Iowa Starting Line"},{"comment_id":"10153257437420950","commenter_b":"Just hang the filthy basterds","commenter_a":"But then again they are innocent unarmed harmless individuals with bright futures ahead and their victim is the evil one","post_message":"Two 20-year-old men allegedly stole a cellphone from a man with cerebral palsy, beat him, recorded the assault on his phone and posted it to his Facebook page, police said."}]
