[{"comment_id":"483457381844842","commenter_b":"Stupid,, Stupid,,, Stupid,,dumb bitch","commenter_a":"who voted for her?","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153027652339753","commenter_b":"If a woman forces her self on a man it's rape","commenter_a":"How the hell does a woman rape a man? I have never understood this concept. Especially when he's \"asleep.\"","post_message":"She was pregnant with her third baby when she committed the alleged rape. But would her sentence have been tougher if she were a man? @webpagelink"},{"comment_id":"420003978124197","commenter_b":"She's getting back what she deserves ! Treasonous witch !","commenter_a":"She's a loser","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"},{"comment_id":"1000268296676215","commenter_b":"Bitch she's a nothing","commenter_a":"Must you keep posting that mug? We are offended just looking at her and her husband ( POOR EXCUSE FOR A PRESIDENT! )","post_message":"Michelle Running Campaign To Ban ‘Offensive’ Word From English Language. She has completely lost it. Do you find Michelle Obama offensive?"},{"comment_id":"10154363624237501","commenter_b":"This is getting Old. What will she want next a Movie? This lady is a $$$$ hungry Biotch","commenter_a":"Why oh why do you continue to post this?","post_message":"As testimony comes in and new evidence is provided, has your opinion about the shooting changed over time?"},{"comment_id":"1116898208348184","commenter_b":"She's the prime example of a \"nasty\" woman","commenter_a":"As if anything this trash had to say matters!! She's disgusting herself!! I mean she's into animals and champagne bottles!! Hello!! Need I say more. Madonna , you're far from a woman if virtue!!! Lmao","post_message":"Madonna slammed Donald Trump, claiming that he 'hates people of Color and Women and is Anti-Semitic.'"},{"comment_id":"10153986690345329","commenter_b":"Sebastian Franklin my hand on the way to the clippers game on the bus","commenter_a":"@username you","post_message":"You're not alone."}]
