[{"comment_id":"1054613801267881","commenter_b":"If they don't want to abide by our laws then go back to where you came from.","commenter_a":"I am sorry, but if you live in America, our laws trumps your religion.","post_message":"Muslim who refuses to remove head covering for officers gets rude awakening. Regardless of religious law, this is a safety concern. Do you think she got what she had coming?"},{"comment_id":"719541998236378","commenter_b":"Happy birthday keesh!!!? Love you and am so proud of all of you Guy's","commenter_a":"40,000 likes, is that going to help?","post_message":"Putin is firing on all fronts after news of a Russian plane being shot down. Russia is doing good work. Can we get 40,000 ‘LIKES’ for Putin bombing Syria?"},{"comment_id":"737825183044101","commenter_b":"I would let a refugee stay in my house.","commenter_a":"I thought all of you on the left were going to let them move into your houses","post_message":"Several refugees have lost fingers and hands from walking in sub-zero temperatures."},{"comment_id":"988010784567676","commenter_b":"If they dislike our ways so much ,WHY HAVE THEY COME TO THE USA? We all should be telling them to go back to the country they came from.","commenter_a":"Death to Islam. Ban Islam in the USA","post_message":"BOOM!"},{"comment_id":"1055649497786607","commenter_b":"I have been doing some serious thinking on this. I have always been pro second amendment, but maybe it is time to take a look at this from another direction. I propose we start here and see how this new gun control thing works. I propose that all people convicted of felonies be banned from owning/possessing firearms. All convicted felons should be made to turn in the guns the legally own now. Once we have all of those, lets move to people convicted of misdemeanor crimes of violence, like assault, sexual battery and so on. Lets get all those criminals that currently legally owning guns to turn those in. I figure it will take a year or so for all these people to disarm and turn in their guns and then we can see if we are having a positive impact on violent gun crimes. If so, then we can ...","commenter_a":"What don't the gun grabbers understand, if you take every gun out of every house hold we have no defense against the bad guys with the guns because they don't give a shit about the laws to start with...","post_message":""},{"comment_id":"10152546933456776","commenter_b":"Get all the illegals out of our country, Enforce our constitution and the god it was based upon twtf","commenter_a":"Let's get those illegals out of here and all those Muslims who hate us","post_message":"Today I was sworn into the U.S. Senate. It's a great honor to serve the people of Louisiana. Our state has limitless possibilities. Let’s take advantage of our natural resources as a way to create better jobs with better benefits for Louisiana families. Let’s work for healthcare solutions that give patients the power to make their own decisions. Let’s protect family values and the ideals our Founding Fathers established in the Constitution. I look forward to working together. I'm with you."},{"comment_id":"497157623808151","commenter_b":"Oh but their day is coming!!! We will show up one way or another!!!","commenter_a":"Obama sucks","post_message":"ISIS just made a huge move against America. This is unacceptable. Spread this post, we need to fight back. Do you agree ISIS should be wiped off the Earth?"}]
