[{"comment_id":"1015110755212120","commenter_b":"Stand tall Hillary!","commenter_a":"We got your back @username our next president of the United States of America !","post_message":"Send Hillary a message of support as she heads into the #DemDebate."},{"comment_id":"813666455490598","commenter_b":"And she needs to dump her shit in the jungle","commenter_a":"I am so sick of reading about her ,she probably spent more money then all the first lady's in the last few years ,she thinks her shit don't stink now well I got news for her it does .","post_message":"What Michelle Obama Was Just Caught Doing With Her Daughters Will Make You FURIOUS She is the worst First Lady in history. Are you ready for the Obama family to be out the White House?"},{"comment_id":"1666280716731910","commenter_b":"When she gets out she will be deported.","commenter_a":"she'll get out in less than 8 years...crime has consequences...and people exploit illegals...that's one of the reasons we need to build the wall and reform and enforce immigration laws!","post_message":"The Democratss tell illlegals, \"Yes, go ahead & vote\"—this woman does it five times and gets eight years in the slammer."},{"comment_id":"1645437002375216","commenter_b":"i like thin women but umm. no, just no","commenter_a":"That is just grotesque","post_message":"Hot or not?"},{"comment_id":"1147292828682585","commenter_b":"Go to Hell Bitch!","commenter_a":"Her earrings are real classy. Hah!","post_message":"The Black Lives Matter crowd gets crazier every single day. Now the woman who co-founded the group says that \"white folks\" need to make a special sacrifice to everyone else. You won't believe what whites are supposed to give up..."},{"comment_id":"1179263908762059","commenter_b":"моод дэлгэрүүлж дээ... хэхэ...","commenter_a":"Jargalsaihan Mandakh, @username...","post_message":"Watch over 100,000 people swarm this public beach in China."},{"comment_id":"10155300892045354","commenter_b":"Pompous ass!!!","commenter_a":"the blank is \"Delta Sierra\"","post_message":"Watch this incredible video and then fill in the blank: \"John Kerry is a _________.\""}]
