[{"comment_id":"10154336399174342","commenter_b":"🤔 alright hoe😭😭","commenter_a":"@username @username Rest In Peace Damiyah","post_message":"Happy #NationalCatDay Don't be a scaredy-cat! Watch these purr-fect #kittens reenact horror films: @webpagelink"},{"comment_id":"10153516438828487","commenter_b":"Shut up douche bag .","commenter_a":"Everything and everyone is interconnected in this economy. To say the NYSE had a series of computer glitches is to mislead the greater public and further cover up the truths behind the shut down.","post_message":"On Wednesday, technological glitches shut down the New York Stock Exchange and grounded thousands of United Airlines flights."},{"comment_id":"1738783449718030","commenter_b":"Lmfaoooo she's just so fed up","commenter_a":"The teacher at 52 seconds hung her head low like \"these mfs here \" Ty1253184741396567","post_message":"Move over, #MannequinChallenge. The #TrumpsComingChallenge is sending students fleeing @webpagelink"},{"comment_id":"1022294177808818","commenter_b":"Just normal housewife.","commenter_a":"Meat grinder, feed hogs, use poop for fertilizer, only positive outcome...","post_message":"Not even a little tiny bit sad over this. Nope."},{"comment_id":"10154012429911509","commenter_b":"Shut-up and go away!!","commenter_a":"Hi i am Ellie I am 17 years old hot Girl want to some Love able friend I live in USA Follow me I will Follow you Back Like me And make me friend <3 :D <3","post_message":"In Malibu, people call the cops on other people just for sitting on the beach. It's been going on for decades. Last weekend, we put access to beach property to the test. @webpagelink"},{"comment_id":"10153928566951943","commenter_b":"she's a LYING PIG!!!!","commenter_a":"Bull!!!! They should all have to answer all questions. STOP the cover-up's, the crap, just get the truth out. Put this Liar, Thief, Murderer, traitor in prison where she belongs, and ALL that knew about her doings and didn't do anything to prevent it, or knew of it afterwards, and buried their heads in the sand. ENOUGH IS ENOUGH !!!","post_message":"Senior Hillary Clinton aide Cheryl Mills and her lawyer walked out of a recent interview with the FBI about Clinton's private email system after an investigator asked a question Mills believed to be off limits, according to a published report. - via Fox News"},{"comment_id":"899546906747398","commenter_b":"F muslims, and GTFO!!!","commenter_a":"Heck no he is in the grave why would you move him ..when the Muslim can be buried somenplace else .this is against his family to be removed.","post_message":"Pathetic! (MUST READ)"}]
