[{"comment_id":"412948288893465","commenter_b":"An ugly skank. . . . living off tax payer money!!!","commenter_a":"POS !","post_message":"They just exposed the disgusting hotel bill Michelle Obama ran up in Cambodia... this is inexcusable. Hardworking Americans deserve better than her."},{"comment_id":"1561579034151058","commenter_b":"She's wile annoying","commenter_a":"@username .. This is so Gemma Gallanagh","post_message":"\"By the time I put it together there was nothing I could do to stop him.\""},{"comment_id":"10153677754598037","commenter_b":"All these females asking for equality. \"Wait, we don't want that equality.\" Sleep in the bed you make.","commenter_a":"Why are you women saying no? Cry for equal rights then don't want the same responsibilities as men.","post_message":"Do you support requiring women to register for the draft? If passed, 459,000 women in Texas would be eligible."},{"comment_id":"1418467401509379","commenter_b":"These could be conservative witches. You never know","commenter_a":"Liberals have lost their minds. Smh. Even the conservative didn't get this stupid.","post_message":"\"You don't have to believe in 'magic' to believe in the power of intent and community.\""},{"comment_id":"10157066156885389","commenter_b":"Listen... Im pro-Trump and agree with a vast majority of his political stances; however, this wall fallacy is a dream.... a wall doesn't stop illegal entry, it only causes illegal entry to evolve. Initiating an armed presence is one of the most effective ways of mitigating unlawful entry by immigrants.","commenter_a":"Trump wants to rename USA to UST United States of Trump lol","post_message":"“We’re going to build a wall and it’s going to be a real wall… And it’s going to look beautiful because some day they’re going to call it ‘The Trump Wall.’” – Donald J. Trump at a rally in New Mexico"},{"comment_id":"916443248422431","commenter_b":"Wow what a bitch!","commenter_a":"@username sad","post_message":"SMH: Mother Tries To Abandon Her Son In The Street!"},{"comment_id":"1740170942902081","commenter_b":"Yeah! Say that to UN! They should go to thoses places rather than bothering Philippines!","commenter_a":"Philippine leader must have nothing better to do... He just want to become famous for a little bit...Do you want to see humans right violations every day? Do you want to see people getting kill by the government? Do you really want to help people because humans right violations?? Go to Cuba!!! Go to Venezuela!!!!!move to Central America!!!! You idiot!!!","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""}]
