[{"comment_id":"477075479149699","commenter_b":"Go Greta Don't. Let the Liar.,,Dunce worry u","commenter_a":"Yes","post_message":"Greta Van Susteren's career was just threatened by Obama. Greta's under attack, she needs our help. Do you support Greta Van Susteren?"},{"comment_id":"1077881772268351","commenter_b":"She's lying her lips are moving...","commenter_a":"Get $60 worth of free medical marijuana at eazeup.com with promo code: icfnwx","post_message":"The best part of being at Caesar's Palace at midnight? Meeting the amazing staff."},{"comment_id":"10153020222586051","commenter_b":"No apology for this little lady. She is too ignorant to understand who made sacrifices for her to have the privilege of saying the Pledge! Maybe she should return from whence her ancestors came from a place where I'm sure the reason they left was because they didn't have the freedoms they came to the U.S.A. to enjoy!!","commenter_a":"After all we all should be praying.","post_message":"The teacher told this girl that she had to stand up for the Pledge of Allegiance. The girl's response: No."},{"comment_id":"903300846390748","commenter_b":"Shoot her, her life does not matter here","commenter_a":"All lives matter, but standing on the flag is WRONG","post_message":"REPULSIVE: [VIDEO] WOMAN WALKS ON AMERICAN FLAG AT #BlackLivesMatter PROTEST, As US Service Members In Uniform Turn Their Backs On Her"},{"comment_id":"1819104865025971","commenter_b":"You're an angel!!","commenter_a":"I literally did this the other day with a dog waking up after a dental. I wrapped her up, rocked her and kissed her and kept saying she would be ok, she was a good girl. It's hard to see them wake up scared and alone so as an assistant, we have to watch them while they're waking up, so why not keep them safe feeling and warm in your arms?","post_message":"Baby Meesha was coming out of surgery and was crying and scared. The vet wrapped her up in his arms and comforted her, singing to her and giving her kisses. A volunteer at the BARCS Animal Shelter walking by caught this tender moment. Turn up the volume for this one. STORY: FOX13news.com/news/@username-story"},{"comment_id":"10154944401159641","commenter_b":"Build your 100ft wall and I'll show you the 100 ft ladder what a waste of tax payer dollars America your Fired!","commenter_a":"Mexico needs the US more than we need them- they will pay- one way or another- leverage is a powerful tool and Mexico doesn't have a leg to stand on","post_message":"JUST IN: President Donald J. Trump says construction on a US-Mexico border wall will begin \"as soon as we can” adding that US taxpayers would foot the bill initially, but Mexico will eventually provide reimbursement funds @webpagelink"},{"comment_id":"10153930858301320","commenter_b":"Hoes will be hoes","commenter_a":"Kinda what he gets for being stupid.","post_message":"It was an expensive night. After a night of clubbing Knicks forward Derrick Williams took these two women back to his apartment and they made off with more than $600,000 worth of jewelry. Details: @webpagelink"}]
