[{"comment_id":"10156093588515354","commenter_b":"Not only is she an awful human being but she is hell of ugly too!!!!","commenter_a":"Twitter users: Give a Tweet she will remember. Monica Foy @ monicafoycan","post_message":"***UPDATE***"},{"comment_id":"1776292422637356","commenter_b":"I think that Donald Trump needs to demand a conservative moderator for the next debate or refuse to debate. He needs to demand to get the questions ahead of time like Hillary(doesn't need them). Oh yes, and be able to wear an ear piece and get fed all the answers(not that he needs them). He also needs to learn the hand signals(doesn't need them either). Play that wicked game better that that witch!!!! Do not let her rig another debate, or pay off the moderator. Do not get on the defense or let her get off by not answering for her sins. Be hard on her in this next debate and bring out all her skeletons. The media will continue to make you out to be the bad guy but America is not stupid and this deplorable is behind you!!!!","commenter_a":"TRUMP","post_message":"'Donald Trump is ready to lead.' Gov. Mike Pence"},{"comment_id":"484907421700536","commenter_b":"What an idiot, move to another country with the other celebrity dumbasses.","commenter_a":"His opinion matters?","post_message":"And that's not all Patton Oswald said either..."},{"comment_id":"10152973367828271","commenter_b":"Now he will have to keep finding more blondes that look like his ex wife","commenter_a":"Where do I apply for this job. I have a lot of worthless information that I would love to be paid for. 😂","post_message":"It's over: @webpagelink"},{"comment_id":"10154173460986051","commenter_b":"What a bitch and that's why I hate all cops in Los Angeles county","commenter_a":"I hope the lawyer does right and gives the kids family money instead and locks up women and her husband and who ever else was involved because the cops at the scene should of did breathalyzer it's the law when they're a wreck to make sure alcohol or drugs is a factor poor family's who have to Deal with this and prayers the kids family's win big","post_message":"This woman was driving home from a bar when she smashed into three kids. Now she's suing them. Guess what her husband does for a living."},{"comment_id":"10153721033369575","commenter_b":"Karen Crowder what the hell does immigrants have to do with it?!","commenter_a":"What's low gas prices have to do with bed bug's? Are they in the gas?","post_message":""},{"comment_id":"10156217952900725","commenter_b":"Illegals only make it harder for the ones who have done it legal. If I were a legal immagrant I would u of be pissed off about the illegals. It's not an easy process and considering the economy I'm wondering if it's worth it to them to try to come in legally. Especially with the liberals making all these empty promises.","commenter_a":"Like if you are voting trump 2016!!","post_message":"The debate last night proved that Hillary is running against the “B” team. She won’t be so lucky when it comes to me!"}]
