[{"comment_id":"1740170942902081","commenter_b":"Yeah! Say that to UN! They should go to thoses places rather than bothering Philippines!","commenter_a":"Philippine leader must have nothing better to do... He just want to become famous for a little bit...Do you want to see humans right violations every day? Do you want to see people getting kill by the government? Do you really want to help people because humans right violations?? Go to Cuba!!! Go to Venezuela!!!!!move to Central America!!!! You idiot!!!","post_message":"\"Why are you Americans killing the black people there, shooting them down when they are already on the ground?\" he said. \"Answer that question, because even if it's just one or two or three, it is still human rights violations.\""},{"comment_id":"1739262919647781","commenter_b":"Hilary is a Republican. She votes like one on war and trade deals. I can find examples if you would like","commenter_a":"Dear Democrats. Bernie Sanders is \"not\" a Democrat. Bernie applied as a conscientious objector in the Vietnam war and did until he was too old to be drafted. In July 1985, Bernie Sanders traveled to Nicaragua, where he attended an event that one wire report dubbed an -U.S. rally. In 1981, he won a shocking victory by only 10 votes to become mayor of Vermont largest city, Burlington. Sanders was elected on a socialist platform and led a mayoral administration that he boasted was radical than any other in the country. And he had a vision! Sanders believed his work in Burlington could spread socialism throughout America. In April 1985, the Los Angeles Times published a lengthy interview with Sanders in which he outlined his plan to spark change. That is exactly what he is trying to do now. Show a tiny bit of his plan and drastically change America ...","post_message":"Back-to-back poll results suggest that Hillary Clinton is on the cusp of a pivotal victory that would help her regain momentum after a string of embarrassing defeats and that would deliver a blow to Bernie Sanders as the two Democrats gear up for the final stretch of voting."},{"comment_id":"10152969196420796","commenter_b":"So?!","commenter_a":"I am very pleased not to be surrounded by poorly educated, I'll healthed, no skilled illegals and newly landed muslims. Maine people do well to care for Our own. Let the world work it out. America is not a dumping for human trash. Coe with skills and be ready to fly our flag, defend our Constitution, and become a citizen.","post_message":"The state's current demographics resemble what the rest of the country used to look like. In 1940."},{"comment_id":"10155578716975354","commenter_b":"Wouldn't it be nice if if \"christians\" practiced what they preach?","commenter_a":"Good on him, but you know he's gonna die soon.","post_message":"“I think this is the first time in history a leading Middle Eastern religious leader has embraced the forms of popular culture to advance the Christian message of love and hope,” WATCH THE VIDEO"},{"comment_id":"1051374008255409","commenter_b":"Oh please. half a million is chump change to those guys. BUY A CLUE.","commenter_a":"People, We're talking about Goldman Sachs here. Don't think for an instant that they'd shell our half a million with no expected returns on their \"investment\". Besides, hillary said she'll look into releasing those transcripts. so I'll hold my breath until I see them(getting a little lightheaded tho\")","post_message":"Another lie about Hillary Clinton goes down in flames."},{"comment_id":"10155928923344199","commenter_b":"This is the best.","commenter_a":"Breanna Barrick","post_message":"'Church, singing and sex:' That's what this couple says has kept them together for 75 years! More: via.q13fox.com/Xirhe"},{"comment_id":"1749451101986580","commenter_b":"Disgusting ... Soooooo sick of the ignorant and desperate race card being used - Clinton you are literally turning my stomach as you spoke often, all on recorded tv I may add, of protecting our borders from illegal immigrants and the insurmountable costs associated with this illegality - it's not racist, just one nation cannot afford to take on the needs of an impoverished third world nation that hides vast amount of hidden cash and hurts their citizens - you are such a liar and hypocrite - like now you should completely lecture us on keeping healthy and happy marriages - you and your lying inept money grubbing hateful wife make me sick - literally sad for any one that thinks you are role models - just so so so sick","commenter_a":"Racist not at all. Trump/Pence will be better then the evil woman! No question about that! I believe that Billy is suffering from a sexual disease that is destroying what mind (little left).","post_message":""}]
