[{"comment_id":"1329308387112427","commenter_b":"Muslims just can't adapt to modern society. Their value system is based on lower less evolved emotions and weaker minds","commenter_a":"Simple solution leave go back to where you came from","post_message":"DO THEY EVER STOP WHINING?"},{"comment_id":"1710841849170298","commenter_b":"We cant have a woman as president we need Bernie or a republican","commenter_a":"Hillary is the devil.","post_message":"We did it, New York. Together, there's nothing we can't do. Watch Hillary live from NYC—and if you've got her back, chip in here: hrc.io/1VhzzV3"},{"comment_id":"10152957563376770","commenter_b":"she should have already been locked up!...","commenter_a":"She has helped fuel the fire instead of being unbiased like she is supposed to be.","post_message":"A veteran Baltimore prosecutor is blaming state's attorney Marilyn Mosby for contributing to dramatic spike in violent crime that has gripped the city in the aftermath of the Freddie Gray case."},{"comment_id":"10154093507104087","commenter_b":"Kiss my ass illegals","commenter_a":"He'll 80% of all Americans desrespect Obama today,but we know the bias mainstream won't tell the truth,Obama lied to all Americans","post_message":"\"Many birthers believe that Obama is not an American because deep down, they believe that anyone who is not white and a Christian is either not an American, or an American with an asterisk.\""},{"comment_id":"954338344712964","commenter_b":"Idiot she has no place in the white house","commenter_a":"When her Secret Service Protectors lay down their guns, I will lay down mine.","post_message":"Hillary Clinton made the case for the United States to implement tougher restrictions on gun purchases following the terror attack in Orlando. @webpagelink"},{"comment_id":"10153228470879170","commenter_b":"Idiots abound everywhere","commenter_a":"Lol","post_message":"If only for comedic value, we hope these people are successful in their bid to \"Draft Joe Biden!\" ....Utterly crazy video included."},{"comment_id":"10156555816055354","commenter_b":"A radical muslim wants to kill you. A moderate muslim wants a radical muslim to kill you.","commenter_a":"Wake up and smell the coffee.","post_message":"This is what we're up against, gang..."}]
