[{"comment_id":"922742544437395","commenter_b":"It's not so much stupid and idiocy as it is vicious.","commenter_a":"Mississippi. Period. Point Blank. (sorry to paint with such a broad brush, but.............)","post_message":"This racist needs to be fired now. Sign the petition to have him removed from office: @webpagelink"},{"comment_id":"10153149176726636","commenter_b":"Shocking. She should be able to speak openly about her experiences with hardline muslims. Censorship at a students union is about as bad as it gets, but it does not surprise me given the 'right on' nature of some idealistic fools in the student world.","commenter_a":"And the pandering to the nasty ideology goes on, unfortunately!","post_message":"'They’re basically labelling me a racist'"},{"comment_id":"1827830767485738","commenter_b":"No","commenter_a":"NFW","post_message":"Daily Live Poll: Do You Think Russian Backed Hackers Helped Donald J. Trump Win The Election?"},{"comment_id":"600515870151925","commenter_b":"I'd say the dog has reached that point because it is being handled incorrectly. I'd put a spot light on the Obamas for not treating the dog properly and training their girls on how to treat the dog. Dogs don't lash out just like that. It would have to have been constantly mishandled. Like that stupid heavy jewellery around the neck for instance.","commenter_a":"I don't think they need to sue, if he takes financial responsibility for the cost of the injuries.","post_message":"Should they soak the Obamas for big bucks? (Or at least some sort of political favor?) Wealth being spread around. That the Obama way, isn it?"},{"comment_id":"10153439402362550","commenter_b":"How about instead of locking our doors, we teach thieves not to steal?","commenter_a":"How about instead of teaching our girls how not to get raped, we teach our boys to not rape?","post_message":"California high schools are the first in the nation to teach a new form of sex education instead of \"no means no,\" students will learn that \"yes means yes.\" Details here ---> @webpagelink"},{"comment_id":"657416461115599","commenter_b":"MAYBE SHE NEEDS MENTAL HEALTH !!!!! IF SHE IS THAT BLIND TO WHAT IS HAPPENING IN AMERICA WITH O BUMMER AS PRESIDENT , SHE MUST NEED GLASSES TOO !!!!!!","commenter_a":"She is a traitor and Muslim just like her husband. Impeach him and send all of them back to their Muslim homeland.","post_message":"Michelle just told her biggest lie to date... Her and her husband are liars, plain and simple. Do you agree the Obamas are traitors to America?"},{"comment_id":"1114872955238500","commenter_b":"Dumb Bitch","commenter_a":"I'm rich. No I'm trans. No I'm rich. No I'm trans. Ahhh!","post_message":"um... Caitlyn Jenner Donald J. Trump"}]
