[{"comment_id":"922010884502919","commenter_b":"If the perpetrator uses a handgun we get ban handguns, if he uses a magazine fed we get ban those, shotgun we get ban those, folding stalk we get ban those, black finish looks scary and military looking, we got to ban those! Where does it stop? We have millions of knives (problem in Japan) baseball bats, and cars in the U.S.! All can be used to do mass killing! Let us all be honest and cut the BS out of this subject! Gun free zones=shooting fish in a barrel! When POTUS and celebrities give up armed protection then they can give their opinion!","commenter_a":"As soon as all the criminals and government in the us get rid of all their weapons then we can talk about law abiding people curbing their guns. Until then you have completely missed the point of owning a gun for self defense. And BTW Roof got the gun illegally!!!!!! Writer doesn't understand what the word criminal means.","post_message":"COMMENTARY: Why you need to rethink some of your gun arguments. Agree?"},{"comment_id":"10152954398027452","commenter_b":"Feminists sure do preach equality until it comes to self-defense.","commenter_a":"The biker needs to be commended on how well he held his composure after being punched more than once by an older man. That Football player that punched a girl needs to take lessons from this guy.","post_message":"Motorcycle meltdown! A driver goes berserk after he says he was cut off by a biker. But what happens next escalates the situation to a dangerous new level that ends in a medical emergency. @webpagelink Is \"driver vs. biker\" road rage getting worse? The confrontation caught on camera. Tonight at 11 from ABC7 Eyewitness News."},{"comment_id":"10153933655437098","commenter_b":"Lol imagine you get off work,headed to your car,next thing you see,a perver having sex with your car lol","commenter_a":"The article doesn't make it clear if he owned the van or not?","post_message":""},{"comment_id":"1676754379239687","commenter_b":"Bramden whos god bitch","commenter_a":"What a dumbass. It just shows how little thought he's put into what he's saying. The environmental impact alone would be devastating. My problem with Trump is, if he were somehow to get elected, when he didn't get his way he would just say \"I'm going back to my life as a billionaire where I get my way and everything has a price so I can have what I want\". He's made that statement in one of his speeches. He said \"you might not like my statements and I may not get elected for them. So what, I'll just go back to my life of wealth\".","post_message":"How would Donald Trump crack down on ISIS as president? Let's just say he has a bold plan. Here, in his own words, is what he'd do:"},{"comment_id":"10153289871647894","commenter_b":"Lol","commenter_a":"Somebody tried to get with daddy.....lmao!","post_message":"‘Married to Medicine’ Star Dr. Heavenly Accused of Trying to Run Over Her Neighbor with Her Car"},{"comment_id":"10152776078426051","commenter_b":"Bet she's sorry after all those dollars were raised for his support. Selfish woman.","commenter_a":"Too bad that she thinks more of her secondary family then she does your husband in her own child","post_message":"Remember the woman who forced her husband to choose between her and a baby with Down syndrome? Well, here she is."},{"comment_id":"1598147256865554","commenter_b":"She is such a pig , I can't stomach her !!!","commenter_a":"You sound \"Off Your Rocker\" !!! A lot of you are talking and showing signs that are vulgar and disgusting! My mother always said that a person shows their ignorance by what they say and do! Seems like a lot of ignorant women were there today!","post_message":"Remember when Michelle Obama said \"when they go low, we go high\"? Neither does Ashley Judd ===>"}]
