[{"comment_id":"649071821906476","commenter_b":"THATS WRONG WITH THIS WORLD! Let her whipr children!","commenter_a":"Next time the boys won't be so lucky. Somebody just might get killed.","post_message":"Louisiana mother arrested after allegedly whipping her three children as punishment for breaking into a neighbor's home. \"I never could imagine that trying to be a good mother would end me up in jail.\""},{"comment_id":"493650944158819","commenter_b":"Get rid of her","commenter_a":"Well her whole life she's been breaking the law, she corrupt .","post_message":"Hillary's career could be over after she was exposed doing this. Good. Let's end it right here, right now, once and for all. Do you agree Hillary Clinton should be relieved of her duties?"},{"comment_id":"10153605782047522","commenter_b":"@username THE MORALS OF THE DEMOCRATIC PARTY AND IT'S FOLLOWERS HAVE RESORTED TO THE MOST LOWLY TO SPEAK IN PUBLIC...LENA DUNHAM SPOKE AT DNC CONVENTION. SHE ALSO WROTE A BOOK AND HEREIN IS A PASSAGE...NASTY...NASTY...GIRL...In the book, Lena Dunham describes an incident during her childhood in which she leaned down between her sister legs and spread open her vagina, saying the behavior did not alarm her mother and was the spectrum of things I did. At another point, she writes that she would try to bribe her sister with candy for a kiss on the lips, joking that a sexual predator might do to woo a small suburban girl I was trying.","commenter_a":"Not surprised. The media has been so bias lately, Clinton doesnt even need the DNC. She has the press. The hatred for this man by the media is astounding. The globalist and globalism will do anything, say anything, to remain in power.","post_message":"The latest in the polls:"},{"comment_id":"1756908037896244","commenter_b":"No! just let them leave our Country.","commenter_a":"Mega bucks to play ??? Go out and really work !!! Ha ha!","post_message":"If they want to disrespect our nation, then they can leave. Anyone who doesn't want to stand for our national anthem on game day should be kicked from the league. Do you think these ungrateful players need to be taught some respect?"},{"comment_id":"10153868800692377","commenter_b":"Hillary is a very nasty woman!!!","commenter_a":"He can call her what she is. A nasty woman. And it's just horrible......But she can call all of us deplorables and its ok. Don't be offended.","post_message":"Donald Trump stirred social media ire on Wednesday after he said, \"We have some bad hombres here\" and referred to Hillary Clinton as \"such a nasty woman.\""},{"comment_id":"10154099227939877","commenter_b":"She's stupid... Dont waste your time.","commenter_a":"If you can't cut your vacation short to do your job as president of the united states you aren't fit for the job.","post_message":"Today President Obama visited the flood-ravaged state of Louisiana, despite critics like Donald Trump who say he came too late. Grio Fam, check out what the President promised he would do to help Louisiana going forward. What do you think his trip accomplished? Sound off!"},{"comment_id":"10155157065294749","commenter_b":"Jade Louise Caswell can we go to chicken house again Sunday pls","commenter_a":"Jade Louise Caswell","post_message":"\"He pointed a gun at her head, demanding that she give him a nugget.\""}]
