[{"comment_id":"833545303358765","commenter_b":"She's a idiot!","commenter_a":"Abortion is not the answer - Pro-Life is!","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"10157053900475354","commenter_b":"Crooked Hillary could not/ would not keep America and Americans safe. She ignored the call for help from Ambassador Stevens even before the attack. Then she tells Americans one story while she tells her daughter a different one...crooked, crooked Hillary can't be trusted.","commenter_a":"The BLM and anybody who supports them are just a bunch of RACIST ass holes and Dirty Fukn TRAITORS to themselves and to the USA. \"Multiculturalism\" and \"diversity\" is all BULLSHIT and VERY DANGEROUS to EVERYBODY it will DESTROY everything. Islam is DEATH. DEATH to Islam long live the Infidel","post_message":"BOLD."},{"comment_id":"10153532910231336","commenter_b":"It's a food product, not plastic. Keep it real.","commenter_a":"It's not even real cheese anyway!! People, you're eating flavored plastic to begin with!","post_message":"RECALL ALERT: 36,000 cases of Kraft Singles cheese slices recalled after customers reported choking on the plastic wrapping. (via Fox Business)"},{"comment_id":"10153253284026756","commenter_b":"i like to read porn not watch it as much","commenter_a":"Meanwhile, people are praising a movie about a creepy, abusive man who likes to manipulate women into believing they want to be treated like emotional and sexual slaves.","post_message":"In which the vice president manages to invade all of our personal spaces, simultaneously."},{"comment_id":"1135459499799639","commenter_b":"END THIS EVIL INBRED FERAL ISLAMIST BARBARIAN DEATH CULT NOW, WHEREVER IT EXISTS!!","commenter_a":"Vote Trump and we won't have this problem.","post_message":" correctness is putting America in danger and it's time to take action and protect our country!"},{"comment_id":"1008103192579543","commenter_b":"For those of you @username fans, I am posting this article to show the evils of this woman and why you should not vote for her. @webpagelink","commenter_a":"Hillery for prison in 2016","post_message":"\"As a South Carolinian, an African American man, and a father, I can't stop asking myself once again: Where does my community go from here?\" Clay Middleton, Hillary for South Carolina State Director, on the #AssaultAtSpringValleyHigh."},{"comment_id":"10153845314569024","commenter_b":"This is a wake up call. Ban these type of stores underneath the rail. Build a wall around it.","commenter_a":"Cuomo & DeBlasio told their agents to not answer questions??","post_message":"Do you think the city ought to be doing more to keep overhead rail infrastructure secure?"}]
