[{"comment_id":"10154469596571523","commenter_b":"How many illegal voters are on that too???!!!","commenter_a":"Who do they poll?? They never call me ever! I think they only poll those that are known demo's.....And personally he doesn't care what they think....he is just doing his job! GO TRUMP!!!","post_message":"President Donald J. Trump's approval rating reached a new low Saturday."},{"comment_id":"1453852417965437","commenter_b":"Vile scum maggots.","commenter_a":"\"Did Huma have her genitals cut off?\",,,,More projection from Alex Jones?","post_message":""},{"comment_id":"1796841757230844","commenter_b":"well how disgusting women walking around half naked in front of men!!","commenter_a":"More made up BS","post_message":"Former Miss Arizona Tasha Dixon says Donald J. Trump walked into a dress rehearsal for the 2001 Miss USA pageant while the contestants were \"half-naked\" and that women were told to \"fawn all over him.\" The Trump camp says the accusations \"have no merit.\""},{"comment_id":"10154099091458984","commenter_b":"He is another politician and a big lier as well he cheated in the other debate with Ben Carson he will say anything to get a vote and he will owe a million favors for all the lobbyist sending him,all this money","commenter_a":"Why are people at war all the time with a Democrat or a republican let's change this to U.S. political leaders and vote for a person not a party. They always have to make people take sides and it needs to be changed.","post_message":"With the South Carolina primary right around the corner, Ted Cruz is doing his best to diminish Donald Trump's lead. Cruz's latest attack is getting a lot of attention, and it may cause some voters to ditch 'The Donald.' Is Ted Cruz right about Donald Trump?"},{"comment_id":"917835871594729","commenter_b":"This is a very old photo of Hillary...she has become too old and out of date to be the Democratic President we need!","commenter_a":"Be nice if She would make up Her mind!","post_message":"Are you supporting Hillary 2016? Then go to DemStarter.com right now and show your support: @webpagelink Hillary is in 3rd place in pledged support behind Elizabeth Warren and Bernie Sanders on DemStarter.com, but we're still just days into it. Go to DemStarter.com, and show your support for Hillary, or for your favorite Democrat!"},{"comment_id":"10154400168208525","commenter_b":"Good grief, you ladies are in a panic. There is the morning-after pill for that kind of thing.","commenter_a":"Believe it or not, you don't have to get pregnant. It's a personal choice","post_message":"#BREAKING: President Donald Trump has signed an executive order withdrawing the U.S. from the Trans-Pacific Partnership deal, and has also placed a hiring freeze on some federal workers and cut off funding for international groups that perform abortions. MORE: @webpagelink"},{"comment_id":"10153528018151717","commenter_b":"She really most likely break the toilet seat when she sat and clog the toilet anyway....best she go to Wall mart to do her business anyway cause she will fit in so much better being in her own element.","commenter_a":"This doesn't have anything to do with being fat, and she isn't mentally ill. She is suffering from an illusion, and that is anyone gives a rat's ass about her opinion. I don't even think she can afford to shop at Target, and if she did she'd pay for it with food stamps. Her kids get free lunch at school, and are probably on state Medicaid. Point being, she is depending on the government to sustain her lifestyle of having as many no-neck young'uns as she can have. Probably only has sex in order to procreate and we are screwed up. I wonder what her white trash, holy roller agenda is all about?","post_message":"A serious kook attack has been captured on video."}]
