[{"comment_id":"509999849159970","commenter_b":"So you live in England and wanna talk about raping places for centuries? Bitch please you would be speaking German in we don't not come to Europe and save you bitches.","commenter_a":"He ain't a Muslim, no outrage #Murica","post_message":"DEVELOPING: The search for the suspected gunman continues this morning."},{"comment_id":"1149843228370020","commenter_b":"1404343676260901house @username","commenter_a":"Chris Weishuhn","post_message":"What happens when you strap a GoPro to a giant sea turtle. Video by the WWF."},{"comment_id":"1103808136307925","commenter_b":"Don't explain...just tell her to go, now!","commenter_a":"Why don't these people go now ??? It is no big loss !!!!","post_message":"Someone really, really, really needs to explain to her how this whole process works."},{"comment_id":"10153794663986491","commenter_b":"More reasons for not having a women as President....","commenter_a":"\"Good guy with a gun\" turned murderer in 20 seconds.","post_message":"\"It was a family argument that turned into a shooting.\""},{"comment_id":"10153424220937106","commenter_b":"If it happened in my county, I'd make the complaint myself and have no problem with people putting one in their yards, on their business , our at their church. It just doesn't belong on government property.","commenter_a":"Would be interesting to know if the person who contacted the anti God group has neighbors with these signs in their yard! Can only hope!!","post_message":"It is outrageous that some would aim to divide a community over a banner that has been proudly displayed since Sept. 11, 2001. I commend the Pittsburg community for rejecting this decision and I stand with them. The Constitution guarantees a right to freedom of religion, not freedom from religion. This banner is not only an expression of faith, but of love for country. Expressions of patriotism, faith, and community should be welcome in our society and I have contacted USPS officials to express my concerns about their decision and to request their reconsideration. If the local post office branch is unwilling to display the banner, then I would be proud to hang it at my own office in Pittsburg."},{"comment_id":"887531464615283","commenter_b":"Sorry Derek grammar police ! What a bitch seriously piss off","commenter_a":"This is why they have gay wrights and the rebel flag in the news to distract u from this been trying to tell u police state !!","post_message":"This story is going viral right now. Read the details of the case and ruling and you'll understand why. @webpagelink From (Y) Counter Current News - MBD"},{"comment_id":"1144808412242519","commenter_b":"Keep them from working, take away their freebies and they will go back home on their own. Arrest the Gangster Types and deport them, then Build That Wall.","commenter_a":"He should be in jail with killary!","post_message":"A 4-4 tie decision by the Supreme Court upholds the lower courts decision and blocks President Obama's executive action on immigration (#DAPA). This means NO WORK PERMITS for the 4-5 million illegal aliens affected."}]
