[{"comment_id":"10154352514741523","commenter_b":"Are you ready for that wall","commenter_a":"And there's Putin Ridin Trump or the other way around","post_message":"\"He's not a bad man. But his ignorance is so profound, so profound.\""},{"comment_id":"10154369386141509","commenter_b":"Why are they racist? Because we want to deport illegal immigrants like every single country in the world? So the whole world is racist except for American liberal sissy's? Mexico deports all illegals so by your standards they're racist. England is racist. China is racist. Maybe your just a puppet?","commenter_a":"This won't sit well with the racist elements of the Republican party. Cruz is saying what I thought all along, the Republican party will never round up anyone. It's an election ploy with base voters.","post_message":"Texas Sen. Ted Cruz does not plan to authorize a special force to deport the undocumented immigrants currently in the country, he told CNN's Jake Tapper, setting up a policy contrast with Donald J. Trump. @webpagelink"},{"comment_id":"10154433599628812","commenter_b":"Good for you, we have got to keep Hillary out of WH we cant take 4 more years of failure!!","commenter_a":"Neither believe in Science/ man made climate change- Disqualified to hold office!!","post_message":"Senior level Trump campaign sources confirm to ABC News that Speaker of the House Paul Ryan will be endorsing presumptive GOP nominee Donald Trump: @webpagelink"},{"comment_id":"644569865731305","commenter_b":"Robert, no one on earth has even 1 trillion dollars. Bill Gates according to Wikipedia is the richest man on earth with a net worth of 75 billion dollars.","commenter_a":"I know that Trump is not for just one race. Trump is for all races. If you will just vote for him you will find out he will be for every one in American.And he believes in GOD. GOD bless Trump.","post_message":"MEDIA BLACKS OUT..."},{"comment_id":"10153492097934170","commenter_b":"Two F'n losers.","commenter_a":"There is a serious lack of testicular fortitude between those two!","post_message":"I'm very disappointed in the King v. Burwell ruling, but we shouldn't be relying on the courts to get rid of ObamaCare anyway. Here are the guys who need to do it."},{"comment_id":"597418893776211","commenter_b":"@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"10152920092525736","commenter_b":"Because I dive in pussy. No fecal flakes on my","commenter_a":"Because they know what they're doing is wrong & disgusting.","post_message":"41% of transgender people try to kill themselves, compared with 4.6% of the general public, according to a study."}]
