[{"comment_id":"1296712253679455","commenter_b":"Domestic Terrorists should be punished to the full extent of the law.","commenter_a":"Bundy, it's time to pay the piper !","post_message":""},{"comment_id":"10153790561559407","commenter_b":"Eco tourism is the answer to the local economy of these communities, not hunting animals into extinction. Man has done enough damage to Africa. The west needs to stick it's hand in its pocket and spend the money to educate them and show them how to diversify their economy so they don't need to rely on sports hunting. It's not sport to hunt and kill these beautiful animals.","commenter_a":"The UN should encourage all nations to make it illegal for their citizens to go to Africa and hunt the Lion or any other African wildlife.","post_message":"A small victory for the king of beasts:"},{"comment_id":"10153791461399607","commenter_b":"No the home owners are getting a 10 yr break on property taxes. Look up Eager Park Townhomes.","commenter_a":"Who the hell can afford it, hell I bet the city will hit you with a $5,000 a year property extortion, I mean tax..","post_message":"Johns Hopkins University is offering a $36,000 incentive to employees to purchase a home in the new Eager Park neighborhood in East Baltimore through its \"Live Near Your Work\" program."},{"comment_id":"557086307813348","commenter_b":"AHHAH u need a matching one","commenter_a":"@username one for mal","post_message":"That pose though"},{"comment_id":"10155086092991509","commenter_b":"They even rape cows over there... And they think cows are Gods. It's weird.","commenter_a":"India has one of the worst rape problems in the whole world, honestly if you're a woman going out after dark there it's almost a sure thing that you will get raped","post_message":"The suspect was reportedly out on bail while he awaited trial for his first rape of the teenage girl."},{"comment_id":"901774593215623","commenter_b":"About time we had larger ladies ,","commenter_a":"looks interesting !!!","post_message":"'I feel sexy and confident'"},{"comment_id":"10153356970249087","commenter_b":"#EndOurFreedom #KeepUsSafe","commenter_a":"There is no way to defend against terrorist attacks in a free society and have any freedoms left. Even a cop on every corner checking ID's and frisking people won't stop them.","post_message":"Former police commissioner Howard Safir said the terrorists in Paris changed the dynamic when they \"picked a local restaurant, they picked a theater\" instead of heading for iconic targets like the Eiffel Tower or the Louvre."}]
