[{"comment_id":"10153206999136336","commenter_b":"I love it. She should have her wooden spoon with her","commenter_a":"She is going to be arrested. She beat him that is abuse. Some Social worker will have her arrested.","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"10152784678501130","commenter_b":"I read a quote from a woman somewhere who said \"When I had kids, I saved up my sick and vacation days.\" She thought this was a major accomplishment. So she took time away from her family and herself (vacation days) and exposed her colleagues when sick. How smart is that. Bootstrap childbearing.","commenter_a":"About time, but still not enough. Germany vives a year.","post_message":"\"[W]e can't say we stand for family values when so many women in this country have to jeopardize their financial security just to take a few weeks off of work after giving birth.\""},{"comment_id":"680360518742918","commenter_b":"Yeah ted😄,, me and my uncle Malcolm Fisher love ya!!!","commenter_a":"I refused to watch his garage band act but I'll take your word on it!","post_message":"Tonight America saw a powerful demonstration that it is time to move on beyond President Barack Obama. #SOTU2015"},{"comment_id":"1373359909354017","commenter_b":"give it time you will see, the failure of these type of woman always is letting their emotions get in between business, you will see","commenter_a":"I think Kellyanne is hot for Trump and he isn't paying attention, or maybe just keeping her hanging see how for he can get her low, how low will she go","post_message":"The people in charge of defining the English language want to remind Kellyanne Conway what the word means."},{"comment_id":"10154730532542042","commenter_b":"yetanother photo u tag me in with the rachetness 😂😂😂 are we sure this one is also a she?","commenter_a":"@username wah do she eye 😂😂😂😂😂😂😑😑😑😑😑","post_message":"The New Jersey hairstylist said her client was unhappy with her services -- so she pepper sprayed the woman in the face."},{"comment_id":"10153933655437098","commenter_b":"Lol imagine you get off work,headed to your car,next thing you see,a perver having sex with your car lol","commenter_a":"The article doesn't make it clear if he owned the van or not?","post_message":""},{"comment_id":"10152955110391336","commenter_b":"What i do NOT understand is.....if kids get vaccinated....then why in the world are those parents concerned their kids will get the disease they've been vaccinated for??? Aren't the vaccines any good?? It's NOT the ppl who aren't vaccinating their children who are bringing disease to other in this country....it's the illegals who are flooding in here who are bringing this stuff with them!!! Blame the correct ppl if you're going to play the blame game....","commenter_a":"Well said Margaret","post_message":"A 3-year-old girl with leukemia was exposed to measles at an outpatient clinic in Arizona."}]
