[{"comment_id":"1234345436618217","commenter_b":"They had a class on how to not rape women? Send the raping muslims home","commenter_a":"Stupid girl, wait until it happens to her or someone close to her, then she will change her tune.","post_message":"Watch as Red Cross spokeswoman cautions that this is just an isolated incident involving a teen who just didn't know any better...."},{"comment_id":"10152814329771636","commenter_b":"The LibDems should have fought for a workable PR system when they had the opportunity.","commenter_a":"As much as I don't like the UKIP he is right","post_message":"'I now have to think seriously about my future life, and what I want to do'"},{"comment_id":"682746131874162","commenter_b":"sorry i would not F%%% hillary the whore bitch, too many germs","commenter_a":"Hillary is a whore is better","post_message":"Drivers got one hilarious shock, but is it enough to turn Texas blue? -- Ellen"},{"comment_id":"736002233211226","commenter_b":"She is such a wonderful bitch isn't she!?!!!","commenter_a":"I like Karma.","post_message":""},{"comment_id":"10154250951204641","commenter_b":"Ok, u say it's a choice so that person chose to have unprotected sex and got prego. Who's fault is that. That child didn't ask to be killed because of their parent made a choice to not put a condominium on. The consequence of having unprotected sex is a baby. If u don't want to have a baby don't have sex. Abortion us an e cause to not take respinsibilty for ur actions. Abortion isn't safe. It leaves scared emotionally.","commenter_a":"If you don't want an abortion fine, but who the hell are you to tell another person who is getting a safe procedure by professionals what they can or can not do to there bodies? What if someone was raped, low financial income, mentally unstable, or if the pregnancy was unsafe for mother and baby? Explain that to your petty beliefs of striping women of he right TO THEIR OWN BODIES!!","post_message":"The 5-3 ruling is the most significant decision from the U.S. Supreme Court on abortion in two decades and could serve to deter other states from passing so-called \"clinic shutdown\" laws."},{"comment_id":"523996764459649","commenter_b":"She is so full of crap!!!","commenter_a":"Not my husband ... Wrong again Laura !","post_message":"Laura Ingraham makes predictions:"},{"comment_id":"10153203503306130","commenter_b":"Funny how people attack Obama's character then defend this guy, it's very revealing really.","commenter_a":"Donald Trump scares you because he'll take away all your free stuff! Donald Trump scares you because he believes in working hard to get what you need, what you want. He will fix America and you will continue to whine and cry about your \"entitlements\" being taken away! Suck it up and go to work America!","post_message":"See a map of the world through The Donald’s eyes."}]
