[{"comment_id":"920858977949524","commenter_b":"Hillary is a whore!","commenter_a":"What does this say about Hillary Clinton?","post_message":"BREAKING - Hillary Clinton's Sex Scandal"},{"comment_id":"10153415212958984","commenter_b":"Yes Yes Yes and Amen","commenter_a":"Yes I do and I also believe the Church needs to pray. It's not just the pastors that need to send a message to our government THE BODY OF CHRIST ALSO.","post_message":"These 700 pastors are fed up with Obama pushing this agenda, and now they're sending him a clear message... Do you support what these pastors did?"},{"comment_id":"1098675453532382","commenter_b":"I don't need to see his return. But I do need to see killarys medical records. She's a wack a doo","commenter_a":"Go Trump 2016","post_message":"WATCH LIVE: Donald J. Trump addresses police shootings, claims America needs a 'national anti-crime agenda.'"},{"comment_id":"10153778934267098","commenter_b":"Told to put her phone diwn, LOL","commenter_a":"In other news, the NBA just suspended Ayesha Curry for Game 7.","post_message":"Twitter goes crazy over Ayesha Curry's tweet..."},{"comment_id":"10153564798429614","commenter_b":"Don't crucify this jesus but put his head on a rope and pull him on a tall tree. Hope am communicating?","commenter_a":"Another senseless act of violence, may the victims RIP","post_message":"Two parents were killed and their daughter wounded when they stopped to help a man who appeared to be having car trouble on a road inside a Montana reservation. When the family approached Jesus Deniz Mendoza, he pulled out a gun and ordered them out of their car, the surviving daughter said. He then told them to walk away from their car. As they turned to leave, the daughter heard a gunshot. She looked back and saw her father lying in the road, she said. The next shot killed her mother. The third shot hit her in the back. Mendoza said he the victims because he was getting tired of waiting around, and because the daughter laughed at him, the criminal complaint says. Read KTLA's story here: @webpagelink"},{"comment_id":"1190828210956634","commenter_b":"Ist: ENFORCE THE IMMIGRATION LAWS, forbidding businesses from hiring ILLEGALS & H1B workers; 2d: DEPORT THE FAKE MUSIM \"refugees\"; 3rd: BUILD THAT WALL!!! 4th: BEGIN DEPORTATION OF ALL ILLEGAL ALIENS! That's enough for the first day. Most of our problems can be solved just by ending ILLEGAL IMMIGRATION!","commenter_a":"RESIGN....","post_message":"GREATEST QUESTION: @webpagelink"},{"comment_id":"1040961739305022","commenter_b":"Thats right. He you dont like it then get the hell out of MY COUNTRY","commenter_a":"I do want my country back...America...the land of the free from sea to shining sea, from mountain to desert...I want it all back, all the beauty and peace and sweat and hard work that we Americans have given this land...I want it back...my America...not some version that obammer thinks it is...not his America...my America..and if that offends anyone, that is just too damn bad.","post_message":"Americas Freedom Fighters"}]
