[{"comment_id":"10155691016515354","commenter_b":"She actually spoke about how she respected the woman who hated blacks and called basically for their removal!! Ya right, she supports her own money making agenda, let's go conservatives and keep this creepy crook out of \"OUR HOUSE\"!!","commenter_a":"Now the Democrat liberals are trying to get criminal minds to help enforce their power! Criminals joining criminals. Wake up folks !! Crooks for crooks!","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.” If she didn't want it to expire, she could have driven once or twice since 1996..."},{"comment_id":"10154714016861509","commenter_b":"Now how is that wall going to work?","commenter_a":"Carlos","post_message":"It even had its own elevator."},{"comment_id":"10154430815494497","commenter_b":"Also ,,!,, cuz the onion","commenter_a":"Can't believe they would make him do this @username","post_message":"Astronaut Suspects NASA Using Him To Test Space's Effects On Fat People"},{"comment_id":"10154684431129614","commenter_b":"They should both be arrested Alisa Perne. Neither acted like an adult should, that lesson never suck","commenter_a":"He wasn't acting like a man and she wasn't acting like a woman. He had no right to hit, but she kept provoking still not right. He could of called the police or walked away..both at fault, but he hit so physical violence on his part.","post_message":"Police are searching for a man seen punching a woman in the face in a disturbing surveillance video taken outside a store in Venice over the weekend. The victim apparently had seen the man at a festival in the city on Sunday but does not know him. The two bumped into each other again at the store and got into an argument before the man punched her. Bystanders tried to stop the man but he managed to escape and ran away from the scene. read KTLA's story here: @webpagelink"},{"comment_id":"994031577299051","commenter_b":"scumbags who cross the border are exactly that illigal criminals who purposely defy US laws. The wall just got taller.","commenter_a":"Keep your citizens and residents on your side of the border. When I travel to Mexico, I have to fill out paperwork. To get back into the United States, I have to fill out paperwork. It is unacceptable that someone can come into this country through Mexico without having filled out anything and no record of them in existence while they're here.","post_message":"Vicente Fox Quesada: \"I'm not going to pay for that f---ing wall.\" Donald J. Trump: \"The wall just got ten feet taller.\" Presidente Enrique Peña Nieto: Trump has damaged the relationship between the U.S. and Mexico."},{"comment_id":"10153362630049641","commenter_b":"Whatever tickles your fancy. Hope you get a free lifetime of ky jelly .","commenter_a":"This country is going to hell in a hand basket.","post_message":"The White House takes on rainbow hues to celebrate the Supreme Court's marriage equality decision: @webpagelink"},{"comment_id":"718057805010847","commenter_b":"He looks like he deserved it","commenter_a":"Aimee Lewis @username","post_message":"Good job"}]
