[{"comment_id":"1561742504135313","commenter_b":"Gonna try this for sureeee","commenter_a":"@username yess","post_message":"Making your own crepes is the perfect way to start the weekend. (via Real Simple)"},{"comment_id":"1068708143222239","commenter_b":"Stupid","commenter_a":"Think of how awesome it would be if our President wasn't the anti christ.","post_message":"Happy Presidents Day. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1102034899855986","commenter_b":"You all want a Muslim hater so kinda breaks out even don't you think?","commenter_a":"Fuck 'em.","post_message":"American Islamophobes are beside themselves because human rights activist Sadiq Khan was elected mayor of London."},{"comment_id":"10153924246056800","commenter_b":"Bye Felicia","commenter_a":"I can't! Im done with this show....this used to be one of my favorite shows that would tell it more or less like it was. But now its just a one sided political agenda. Goodbye daily show may you rest in peace","post_message":"Activist DeRay Mckesson talks about the tenets of the Black Lives Matter movement."},{"comment_id":"10153727750436336","commenter_b":"You do realize that without spiders the world would be overrun with bugs which do a lot of damage to the earth if not contained","commenter_a":"This happened to me before when I was a kid, I was riding my bike branch hit me by my ear. Felt something weird went to the bathroom spider came out half way to say \"hi\" then went back in when I screamed for mommy. Went to the doctors then I lay down and the spider came out itself! And yes I killed it with my bare hands!!","post_message":"Each attempt doctors made to remove the spider caused it to react violently, but they eventually were able to subdue the insect with medicine and pull it out with tweezers."},{"comment_id":"1273048739421267","commenter_b":"I don't believe very many Republicans are \"in to\" the arts except at fundraisers. lol","commenter_a":"They are Trumps uneducated.Gotta love STUPID!","post_message":""},{"comment_id":"1346838938665097","commenter_b":"@username the fact is that a male will never transform himself into a female. FACT!!","commenter_a":"For people who don't understand, it is not just restrooms, but women's locker rooms and showers and dressing rooms. This is not right. This is not just a trans thing, but will allow men to go into confined areas where women are very vulnerable. So, how would you feel if your grandmother, mom, daughter, sister, aunt, etc. to shower with a man next to you with only a flimsy curtain? We here in NC will stand strong. I hope our governor will continue to fight for women's safety.","post_message":"The solution here might be that the North Carolina governor could say that we don't identify as North Carolina anymore, and therefore your lawsuit against us is irrelevant."}]
