[{"comment_id":"10153624031427293","commenter_b":"But don't forget it's going to be a wall that's yuuuuge and beautiful and the best part is Mexico is going to pay for it!","commenter_a":"does he have any ideas? any plan other than the wall?","post_message":"\"(Trump) will run into a buzz saw of reality otherwise known as the general election, and he may not know how badly mangled he’ll get.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"1738376596301641","commenter_b":"She wants you to lick it for her ! Lol","commenter_a":"Someone should tell her to lick her butt hole like a dog and mind her own dam business !","post_message":"Hillary Clinton told a group of supporters on Wednesday that America has \"too many guns.\" Yes, that's right. The presidential candidate who claims to respect the Second Amendment is upset that Americans own more guns than she is ok with."},{"comment_id":"10153505413366770","commenter_b":"She's an idiot","commenter_a":"Kelly girl get over yourself, now your show will be a flop.","post_message":"Kelly Ripa was dressed for a funeral."},{"comment_id":"1109408939099898","commenter_b":"yaaaassss bitch yasss","commenter_a":"Angela Swartzel Melinda Bailey Mallory Brogli Chelsea Pande Roma Rispoli Kunia Rodrigues Carmel Rae Anne Mellies @username Jackie Smith fucking dyingggg😂😂😂","post_message":"That Voice Over! (Free The Monkey Though)"},{"comment_id":"10153005489041770","commenter_b":"And who says this female is not a partisan hack?","commenter_a":"This woman is an enemy to our country.","post_message":"\"There’s nothing more important to me as a Jew to ensure Israel’s existence is there throughout our generations.\""},{"comment_id":"1180596495393685","commenter_b":"We ain't going to miss you don't let the door hit you on the way out","commenter_a":"He accomplish nothing but racial tension","post_message":"Here is how Americans feel about Obama as he leaves office. Are you proud of what he accomplished for our country?"},{"comment_id":"610453139087868","commenter_b":"Fuck that arrogant asshole","commenter_a":"I hate this motherfucker.","post_message":"You piece of garbage."}]
