[{"comment_id":"952954108073344","commenter_b":"Freaking Cowards !!!!!!","commenter_a":"My heart and stomach hurts..This has to stop and stop now..whos going to do it?..Not Obama cause hes one of them..This madness must stop","post_message":"BREAKING: This is the face of EVIL..."},{"comment_id":"10153007861084753","commenter_b":"Get a job!!!!!!!!!!!!!!!!!!!!!!!lazy bitch","commenter_a":"that is so wrong on so many levels","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"735565289967382","commenter_b":"Dear God, kick this ignorant African so hard he gets back to Africa. He needs English as a second language. Also needs to be taught to not make threats. What a POS. Go back to where you came from.","commenter_a":"This guy is a fanatic. He'd better be stop or someone s going to get Bharat namely, him","post_message":"Knife wielding Muslim attacks Trump, but watched what happens next. I bet he never expected this. Let's show him our support. Can we get 30,000 'LIKES' Donald Trump?"},{"comment_id":"10154608110303701","commenter_b":"She's a real winner. Just block her idiot ass.","commenter_a":"Good hes a pos","post_message":"A Sherwood man is being charged with manslaughter for a crash that killed a 2-year-old in Deschutes County, according to police."},{"comment_id":"1827543604143155","commenter_b":"That's right, all you chowder-heads SEE and HEAR what you want to. If MALEIFCENT does win, it will be through 100% corruption...but then that doesn't matter as long ad she wins, right? That way all the unemployed, druggie, scumbags can keep up the anarchy. Well, hold on to your backpacks cause there's a shit storm coming, along with rude awakenings.","commenter_a":"Alexis Marie","post_message":"Even this focus group by Fox News's Frank Luntz agrees Hillary CRUSHED Trump. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1774184492816291","commenter_b":"@username racist idiot.","commenter_a":"NO WAY! No one else should be added to Mt. Rushmore, but especially not Obama! There are a lot better President's that could have been added, but not him!","post_message":"Obama's Face To Be Inserted Into Mt. Rushmore. Don't mess with this national monument. Do you think Obama's face does not deserve to be up there?"},{"comment_id":"10154512976631943","commenter_b":"YES!!!!..... LOCK HER UP!!!...LOCK HER UP!!!!...HILLARY FOR PRISON NOW!!!!...IT MUST BE PROVEN TO ALL THAT NO ONE IS ABOVE THE LAW IN OUR AMERICA!!!....HILLARY'S CORRUPTION WILL NEVER STOP TILL SHE IS BEHIND BARS!!!!!.........TRUMP IS THE PRESIDENT AMERICA DESERVES!!!....GOD BLESS OUR NEW PRESIDENT!!!!.","commenter_a":"Mr. Trump we can't let her go Free!! She's trying to destroy you every chance she gets.. Let Gowdy loose on her","post_message":"Share if you agree!"}]
