[{"comment_id":"843343722394413","commenter_b":"You're wrong. Go in a mosque sometime you'll probably even walk out with your head still attached.","commenter_a":"If we behave in the same fashion as our enemies, we become our enemies.","post_message":"REVENGE: French Attack Mosques And Blow Up A Muslim Kebab Shop Looks like the French have had enough of the Muslims immigrants living there and are fighting back! @webpagelink"},{"comment_id":"2113127628913184","commenter_b":"He just gained 3 points sweet","commenter_a":"HILLARY !!","post_message":"We’re in a drone flying above a voting center in Parma, Ohio #CNNElection #ElectionDay #MyVote (no sound)"},{"comment_id":"10154151850958271","commenter_b":"Hilary voted for it! So she must have to go to jail. Or does it only work one way?","commenter_a":"Can we focus on how she forgot about our soldiers in Benghazi!","post_message":"We are live discussing tonight's debate. Send your questions!"},{"comment_id":"10154057964035448","commenter_b":"Everyone go to Shannon's blog and tell him to shut the hell up","commenter_a":"Shannon Sharp is one big disappointment. What an ignorant clown he turned out to be. Hasn't a clue...just a great big mouth!!","post_message":"The Left will never learn..."},{"comment_id":"10154298865889099","commenter_b":"Smh","commenter_a":"Jessica Milla","post_message":"\"Her ribs are broken. He beat her ribs and breast saying her milk was useless and she was worthless,\" the woman's mother said. \"He tried to blind her so she couldn't see her baby, he tried to make her deaf so she couldn't hear him crying for her.\" WARNING: Some may find the images in this story disturbing. @webpagelink"},{"comment_id":"1092696630813956","commenter_b":"Ur aunt eats them out of a can","commenter_a":"Quan Lawson","post_message":"This massive octopus escaped through a tiny hole in a fishing boat."},{"comment_id":"10154010743370329","commenter_b":"Ooh I didn't know there would be another season?! Thought it was over!","commenter_a":"@username Aimee Fortune Jade Morgan @username","post_message":"Watch the first four minutes of the next season of Pretty Little Liars right now!"}]
