[{"comment_id":"10152933844790667","commenter_b":"He probably figured he could demand equality for animals, since now people of same sex can get married. Next, it will be polygamy. Watch the Muslims in the US asking for equality.","commenter_a":"Yep could have gone all day w/o reading this. sick","post_message":"Crawford posted an ad on a popular website soliciting a willing horse owner, according to officials."},{"comment_id":"10153974201673445","commenter_b":"They don't care about you & me.Ain't it always about the buck & Greed.Karma will get those Clowns.Lawsuits are coming!! Let's put these clowns on Min.wage.We won't have to worry about them working overtime.Take away the free Health Insurance,put them on O'Duma care.Take away their pension.It's the taxpayers money.","commenter_a":"They continue to reject medical marijuana but continue to give out pain killers and other sedatives wow seriously","post_message":"VA Hospitals Will Continue to Reject Medical Marijuana."},{"comment_id":"10156237549955231","commenter_b":"Apples and oranges. American problem vs not America's problem","commenter_a":"White Christians have committed more acts of terrorism in America than Muslims. Some of you are clearly stupid & misinformed","post_message":"It doesn't help that Trump has been \"fanning the flames\" with his anti-Muslim talk."},{"comment_id":"607614076095838","commenter_b":"Sorry asshole there is noway you're going to get rid of Jesus, don't believe it, just keep doing what you're doing.","commenter_a":"No thank you I'll follow Jesus","post_message":"What Obama just said will have you quivering in your sheets. He has completely lost it. Spread this and show America his true intentions. Do you agree Obama is a threat to American life?"},{"comment_id":"10154273453111509","commenter_b":"Same thing is happening here in the US","commenter_a":"This is what happens when the liberal party's refuse to listen to the people. They don't want any more migrants.","post_message":"France's far-right Front National party has made gains in the wake of the #Paris attacks."},{"comment_id":"10153965204071680","commenter_b":"Vote Hillary !","commenter_a":"Bruce Moss","post_message":"Joe Biden: \"It gets down to Florida, Florida, Florida – not a joke! You all do your job, we get to go to bed early Tuesday night.\""},{"comment_id":"950144531689554","commenter_b":"pathetic drama queen!!!","commenter_a":"Let's remember who this guy is....his history, his previous shows, his personality, his tweeting naked pics of himself....self-absorbed little twit!! he is one of the reasons I am not watching Fox News as much as I once did. He's a twit and he's all about the legalizing all illegals.....as he calls it, the \"Brown Tide\".","post_message":"After Trump adviser called Geraldo an \"embarrassing hack,\" the Fox News correspondent threatened violence."}]
