[{"comment_id":"499187636938483","commenter_b":"Send her sorry ass back to the jungle with her relatives.","commenter_a":"Come and get them you POS!!!","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"1119467821481588","commenter_b":"Yay!!!","commenter_a":"Exactly his point!","post_message":"San Francisco 49ers quarterback Colin Kaepernick says he has received death threats for making his views known"},{"comment_id":"1025902810798360","commenter_b":"@username you are crooked and You are a loser. You are a complete disgrace. You will not make America great again. You have no idea what you are doing. You are a complete idiot. Do us all a favor and drop out. Stop spreading hate. The only reason your rich is because you got money from your father. you are going to make America a laughing stock. please reply to this message. Be a man and reply to my message. Debate me. don't be a chicken.","commenter_a":"@username you are crooked and You are a loser. You are a complete disgrace. You will not make America great again. You have no idea what you are doing. You are a complete idiot. Do us all a favor and drop out. Stop spreading hate. The only reason your rich is because you got money from your father. you are going to make America a laughing stock. please reply to this message. Be a man and reply to my message. Debate me. don't be a chicken.","post_message":"Thank you for the incredible amount of support last night- San Jose, California. I love you all - we will deal with the thugs & criminals -- we will build the wall --- and Mexico will pay for it!"},{"comment_id":"10152886018669091","commenter_b":"Jaaajaj buena idea","commenter_a":"She can move to another planet . I really dont care","post_message":"\"If this happens -- I am moving to Canada. The CEO of a company is getting attention for a controversial Facebook post, where she says that female shouldn't be president.\" Here her reasoning: @webpagelink"},{"comment_id":"1333556083351913","commenter_b":"Javier judging by the other comment threads on this post it seems that very many people at least in the USA disagree that those activities are as gender neutral as you do.","commenter_a":"None of this shit is new 😐 Men have always been barbers, tap dancers, ballet dancers, shoe makers, basket weavers, bakers, or tailors. What the hell is wrong with any of this stuff? More importantly... WHY are you pointing this normal stuff out as if it is odd???","post_message":"This mom is encouraging boys to do what they love — no matter what people have to say."},{"comment_id":"953112161448505","commenter_b":"Women.Stop having sex without condoms....","commenter_a":"Women. Stop having sex with Republicans.","post_message":"Sen. Elizabeth Warren has a powerful message for the Republicans that just voted to defund Planned Parenthood. Pass it on! Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153221093818433","commenter_b":"Yeah, because the media doesn't owe Mitt Romney and his family an apology....","commenter_a":"Expose the liars. I am glad he did it!","post_message":"\"I had a mission,\" Pfeifer said. \"I am sick of reading bull- - - -. I am sick of lies. I am sick of people’s lives being destroyed.\" ow.ly/MnI5N from PunditFact"}]
