[{"comment_id":"1267878706625395","commenter_b":"I'm pretty sure she wouldn't need your worthless vote anyway. Trash","commenter_a":"Can't wait til January 20th when your gone!! If you run for president in 2020 you won't get my vote! You put your nose into eating healthy school lunches thatgo into the trash everyday and restaurants.","post_message":"Happy Birthday to outgoing First Lady Michelle Obama!"},{"comment_id":"1735755160025201","commenter_b":"Hopefully I can get there before someone builds a wall around our entire country!","commenter_a":"I feel so sorry for you Americans!! Come in up to Canada we can have a beer and chat about your presidential candidates lol","post_message":"Donald J. Trump accuses President Obama of being 'the founder of ISIS'... then calls Hillary Clinton the 'co-founder.' @webpagelink"},{"comment_id":"10154306922931943","commenter_b":"Can I demand answers to what laws ye dupes say she broke?","commenter_a":"Criminal","post_message":"Hillary Clinton must be held responsible for using \"private\" email accounts and a hidden email server as Secretary of State to conduct government business in violation of the law! Judicial Watch is the one organization with a proven 20-year track record of investigating, exposing, and prosecuting Hillary Rodham Clinton and company. Please SHARE!"},{"comment_id":"1297388806970322","commenter_b":"Being ashamed of himself is not enough. Fire this idiot and boycott the idiots who hired him, and him being a professed republican. Rino.","commenter_a":"Con Hannity always a victim! Lester Holt is a registered Republican. FACT!","post_message":"The numbers don't lie."},{"comment_id":"10153111641514138","commenter_b":"Bitchassniggas","commenter_a":"I'm glad they stopped him because he would go there get training and come back!! We already have had too many of them do that there's a lot that get caught that we don't know about.","post_message":"Arrested at Minneapolis-St. Paul International Airport with a one-way ticket to Somalia + a fake passport"},{"comment_id":"1648471502112051","commenter_b":"It never bothered Hillary, at least he recognizes it and is willing to seek advice.","commenter_a":"He's getting bald.","post_message":"This is not normal. This is not normal. This is not normal."},{"comment_id":"10154799380074486","commenter_b":"Suck it up, cupcake.","commenter_a":"The Feminist Movement emasculated men and created this generation of Pajama Boys.","post_message":"Spot on."}]
