[{"comment_id":"10154432895041973","commenter_b":"everytime i have to wait for TOO LONG ...i'd rather do it myself","commenter_a":"Yaaaayyyyyyy.... So tired of waiting to have some poor guy out in the cold, heat and/or rain to come pump my gas. And no, I haven't had someone offer to wash my windshield or check the oil since I moved here 17 years ago.","post_message":"You might be pumping your own gas soon if you head out to rural Oregon."},{"comment_id":"10153422236844877","commenter_b":"Darn shes not even hot. Nappy headed hoe.","commenter_a":"What's crazy is people talking about her knowing she has special needs.","post_message":"Miami woman arrested for dancing naked at Johnny Rockets - in the middle of the afternoon! Find out why her father says she did it. Grio fam, what are your thoughts on his defense?"},{"comment_id":"10153263072806323","commenter_b":"People are so ignorant. They get off on body shaming others. They act like a strangers physical appearence directly affects them... If it does, then how pathetic are they?","commenter_a":"Whilst healthy living is undoubtedly a good thing, and being significantly overweight (or underweight) can be poor for one's health, making clothes that fit the diverse body shapes we have is not 'facilitating' an unhealthy lifestyle. It's simply ensuring that people of all body types and dimensions can dress in a style which they like, and in sizes which are comfortable and flattering to their shape. Besides, being overweight isn't as simple as being a 'lifestyle' - in many cases it can come from factors as diverse as metabolism, mobility issues, eating disorders or genuine dietary or medicine requirements.","post_message":"\"Saying that high-street stores shouldn’t “facilitate” certain human beings having access to clothing, in order to make them really understand how unacceptable they are as people, is pretty nasty, right?\""},{"comment_id":"10153659617321323","commenter_b":"What about the kids, which is the entire point of the article?","commenter_a":"Just one big difference here. Kyle has asked for privacy, and presumably won't be going voluntarily onto TV shows to discuss his divorce. The people that appear on his show do so voluntarily, so are obviously less concerned about privacy for their issues. Stop trying to compare the two. Theirs no hypocracy here.","post_message":"\"What does Jeremy Kyle think is more likely: that a child’s parent or parents appearing on his show will constitute a mere 49 minutes in their childhood, or that its ripples will magnify that car-crash public event enormously – grotesquely – into something that cannot fail to be formative, and endlessly repercussive in its damage?\""},{"comment_id":"813714802066935","commenter_b":"I'd like to see her asshole","commenter_a":"Joyce Watson @username superimpose someones cheeser. xv","post_message":"Subscribe to our mailing list and receive our awesome content for FREE - @webpagelink"},{"comment_id":"1159977814023228","commenter_b":"\"It's not what you think, really\"","commenter_a":"Nåt är fel??","post_message":"Uh-oh."},{"comment_id":"1579218252372572","commenter_b":"You k ow it is . She can't win. Otherwise","commenter_a":"Narcissists must have someone or something to blame for their inadequacies and failures.","post_message":"\"I'm afraid the election is going to be rigged, I'm going to be honest,\" Donald J. Trump told a crowd on Monday, just days after he criticized the \"unacceptable\" general election debate schedule."}]
