[{"comment_id":"1166767616720554","commenter_b":"@username - Deceit + Greed = Hillary Clinton.","commenter_a":"Here is what a Real Poll looks like in America. Please take the Time to Read.. A Total of 50,000 people Polled in 50 States.... PG Farnsworth We have just completed our own poll since we cannot get factual information from the mainstream media!! We called 1000 homes in each of the 50 states and asked basic questions on the economy, terrorism, immigration and presidential pick. Economy was the number one factor that Americans are concerned about and terrorism was number two. Presidential pick was Trump by a large percentage. Trump 33478 votes 67% Clinton 9788 Votes 19% Undecided or other 6739 votes 13% My friends and I are all Graduate students from all walks of life we meet to discuss stuff. 13 people who like and have served in the Military. It took us most of two weeks to be sure our calls were to all people and not ...","post_message":"U.S. Department of State reports show that 2,340 Syrian refugees arrived last month in the United States."},{"comment_id":"10154153036124369","commenter_b":"She confuses common core with curriculum. Anyone against common core is against preparing kids for the job market. The curriculum used implementing common core was written by the text book companies and approved by local school boards. It's OK to be angry at that but Kasich has nothing to do with curriculum so hopefully now you can vote for him again.","commenter_a":"Wake up Ohio.. vote Trump. You need to understand everything Kasich stands for.","post_message":"Authorities in North Carolina say they are looking at Donald Trump's behavior as they continue their probe of a violent altercation at one of his rallies last week."},{"comment_id":"398114563646472","commenter_b":"You talk crazy !","commenter_a":"Texas has the death penalty---use it!","post_message":"This is not a good image for those who are trying to support the rights of illegal aliens."},{"comment_id":"10154111404003132","commenter_b":"They have it bad because Americans won't allow sharia law be submit to cower to Islam . Imagine that we refuse to stupid as the EU had been . OMG we want Muslims to be tested exactly as any other religion here . The nerve of us to refuse to cower grovel to Illegal immigrants or Islam . Imagine that wanting all to assimilate to Our laws ways traditions under our flag only if it offends you LEAVE go to Saudis Iranians enjoy sharia laws","commenter_a":"I didn't read anything about her being molested or disrespected. Maybe she went to the wrong rally? And who the hell says that a muslim woman should be more respected than anyone else? I don't care that she came in peace. As long as she left in one piece. I am sick of these muslims acting that everyone hates them. Some of us are just tired of their fictitious victimizations. There are real people in this country that have been victimized. Lets focus on them, instead of some nut job that is staging a silent protest because she wants to be special.","post_message":"\"I was not afraid of these people, because I truly believe that the decent people would have stood up and not permitted that,\" she said."},{"comment_id":"10154496837959170","commenter_b":"Only LAZY UNEDUCATED PEOPLE BELIEVE IN A LYING WHITE WOMAN-hillary.","commenter_a":"BOOM killary!","post_message":"Hillary promises to continue Obama's economic policies. The latest results of those policies came out this morning. Splat!"},{"comment_id":"989405267747483","commenter_b":"Wrong woman for Obama.....","commenter_a":"What's wrong with Hamilton??","post_message":"Can you imagine? Heads would explode! I am no Randian but she IS the most important female thinker of the 20th Century not to mention the most influential."},{"comment_id":"1738986173036273","commenter_b":"@username : go away Trump or Bernie lover . Vote for Hillary","commenter_a":"Love Her! @username will be our next President of the United States of America!","post_message":"\"Clinton is a master at identifying problems and coming up with plans to solve them. There is seemingly no crisis too small to escape her attention, no subject outside her wheelhouse.\""}]
