[{"comment_id":"884264261619642","commenter_b":"Crazy crazy high price. Very sad .... 😡","commenter_a":"Yes and not to mention that you hear I want this I want that I want want seriously it use to be a different meaning to go to Disney now it has gone commercial stop going and they will start decreasing prices ....bottom line","post_message":"The price of a ticket to Walt Disney World just got more expensive. Here's what one day trip will now cost you. @webpagelink"},{"comment_id":"10153397415338984","commenter_b":"Guess you are be careful about who you ask to suck your dick!","commenter_a":"Very old","post_message":"Watch what happens when this bully starts a fight with the wrong guy... he didn't see this coming. The cameras caught this entire fight... Are you happy he got a giant slice of justice?"},{"comment_id":"973671239335036","commenter_b":"She always has been a racist bitch. Where have you'all been?","commenter_a":"Get your head out of your ass and do something productive with your life.","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"1115555701831927","commenter_b":"Get and keep satan out of the White House!! SAVE AMERICA TRUMP 2016 ALL THE WAY!!!!!!!!!!!","commenter_a":"Done","post_message":"LAUGHABLE: Clinton Press Secretary Gives Conditions Under Which She Will Give A Press Conference Let's just plan on this not happening...EVER!"},{"comment_id":"10153756780250695","commenter_b":"Respect everybody-easy on the sir crap","commenter_a":"the police and are like any other person they put there pants on and go to work ........they chose the job we didnt force it on them.i see no reason to buy there meals and say sir and ma'am to them.i work hard for what i have and i get nothing free so why should police get anything free.they have to come if you call them anyway........................!","post_message":"\"Put their charities on your giving list. If your local law enforcement has volunteer-citizen job opportunities, sign up.” Do you agree with his idea?"},{"comment_id":"10155440088805354","commenter_b":"Charlie, I guess it doesn't take much for you. When she stands up her boobs point south.","commenter_a":"Time for that old broad to retire.","post_message":"\"Why is it okay to show ass and no breast?\" - Madonna Fair question?"},{"comment_id":"10153296674076323","commenter_b":"i can't deal with her","commenter_a":"@username thought you might find this interesting","post_message":"After Frida Kahlo died in 1954, her husband Diego Rivera shut her belongings in a bathroom at their Mexico City home – then demanded it be locked until 15 years after his death. In fact, the room wasn’t opened until 2004. See the full gallery of what was inside: @webpagelink"}]
