[{"comment_id":"1231862310212247","commenter_b":"We better get building that wall","commenter_a":"This will be interesting. Will President Trump undo what Obama did to lift sanctions and travel restrictions to Cuba?","post_message":"Live Look: Celebrations in Miami over the death of Fidel Castro, and images from Cuba."},{"comment_id":"959728980774046","commenter_b":"This is ridiculous ! We are a Christian based country . Muslims need to get the hell out and take their evil ideology with them ! NOW !","commenter_a":"YES !!!","post_message":"Obama Gave Millions To This Mosque In America, But Look Who Owns The Mosque This shows you exactly where his true allegiance lies. Do you think Obama is a traitor?"},{"comment_id":"10153324267994411","commenter_b":"just for the record most women have long skirts in their wardrobes,","commenter_a":"Good decision, if she wants to live in France then she should follow French rules/laws etc and in this case the dress code, the \"its my culture\" card doesn't work in France. Which is a good thing","post_message":"A 15-year-old French Muslim girl was banned from her class for wearing a long skirt reflecting her religious affiliation."},{"comment_id":"10153328109319087","commenter_b":"@username Let the refugees go fight for themselves.","commenter_a":"When are people going to accept that refugees are not terrorists?","post_message":"President Barack Obama still plans to allow 10,000 Syrian refugees into the country over the next year, despite terrorist attacks in Paris, at top aide said Sunday."},{"comment_id":"1219104934776201","commenter_b":"And this is what this gremlin boils down to!","commenter_a":"This old man ain't going nowhere. Pump up the Trump.","post_message":"The conventional wisdom of the Democratic race holds that Vermont senator is the principled liberal challenging Hillary Clinton. But Bernie Sanders has moved too."},{"comment_id":"10153836803272623","commenter_b":"Good players But it's another\"L\"","commenter_a":"Ga...NO ....Riverboat must have sank and Cam Ain't ..... stupid Panther Fans","post_message":"The New Orleans Saints beat the Carolina Panthers in a 41-38 victory Sunday in New Orleans."},{"comment_id":"1546996122269558","commenter_b":"They should kill all the illegal immigrants.","commenter_a":"Cute he Looks Like A Real nice Guy?? Surprised Yo Mama Didn't pardon Him","post_message":"Texas Executes Illegal Immigrant Murderer, Despite Protests From Mexico. Good riddance. The world will be a better place. Do you think he deserved the death sentence?"}]
