[{"comment_id":"10153072331466051","commenter_b":"This woman is nuts and needs put away for a long time. How crewel!","commenter_a":"These people are so evil !!! what is this world coming to","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"10155071797057235","commenter_b":"@username Melania is smart. She's living in New York with her son and her parents. Trump isn't even home half the time. All she has to do is keep up appearances. Show up at the Inauguration and a few key events.","commenter_a":"Yeah. You don't even have to know him to know this was gonna happen. Just watch him for the last 20 years. Why didn't his family talk him out of it.","post_message":"The giant orange baby-man president hates his job. Nobody could have predicted this..."},{"comment_id":"10152606948662093","commenter_b":"Idiot get a life","commenter_a":"Huh! Happy to hear that they didn't get shot. Wonder if they were white. ......","post_message":"There are good people all around us.... Carrollton Police officers found a family of three sleeping in a car, and instead of being told to leave, they put them in a hotel and bought them necessities."},{"comment_id":"1015321351850138","commenter_b":"Obama has been working on changes to second amendment....all we need is more of the same...no way!!!","commenter_a":"Get over it....Hillary wants to take away oil field jobs and our guns too...no way she'll get my vote!","post_message":"\"I say that I will beat her easier than beating some of the people that I've just won [against.]\" Donald J. Trump hit at Hillary Clinton's record and explained why he believes women will vote for him. @webpagelink"},{"comment_id":"10154678643996729","commenter_b":"Screw that ignorant queer!","commenter_a":"It makes sense now why the Obama administration doesn't want us to have guns, he needs to sell them to people that hate us.","post_message":"This one hits close to home..."},{"comment_id":"10153715951406002","commenter_b":"There are not enough words to describe the opinion I have of this woman and the her unspeakable actions.","commenter_a":"In my eyes what she did is not much different than an abortion.","post_message":"A 24-year-old Eastpointe woman who already has three children is charged in connection to the death and abandonment of a newborn who was found at a Roseville recycling center."},{"comment_id":"10153970352414087","commenter_b":"how many lies does that bitch have to tell before your eyes open? Or do you not care, is it all about the vagina's turn in the WH?","commenter_a":"more like clinton being suicidal (can only hope) watching her campaign going down in flames with all her lies","post_message":"\"Longtime ally of Paul Manafort, Trump's campaign manager: 'Manafort not challenging Trump anymore. Mailing it in. Staff suicidal,'\" CNBC reporter John Harwood tweeted."}]
