[{"comment_id":"1768080320145861","commenter_b":"She is a criminal to her core","commenter_a":"TRUMP will protect LBGT people from the moSLIMEs. Hitlery will always side with iSLIME because that is who keeps her rich. VOTE for TRUMP!","post_message":"On June 18, 1983, Sally Ride became the first American woman and first LGBT astronaut to go to space."},{"comment_id":"10153506552374342","commenter_b":"She looks like a freaking man","commenter_a":"Looks like a dude","post_message":"We're getting our first look at the female shooter in Wednesday's tragedy in #SanBerardino."},{"comment_id":"971601666302233","commenter_b":"It seems like all the intelligent women with morals have been fired... This show needs to be cancelled!","commenter_a":"Yes","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"1754158708182258","commenter_b":"Rip officer...fly high... You will be missed","commenter_a":"Whoever is doing the laughing get off this page very disrespectful","post_message":"The funeral service begins for Detroit Police Sgt. Ken Steil. Watch along live as loved ones and fellow officers remember his life: Read more: @webpagelink"},{"comment_id":"1719601761432898","commenter_b":"Similar... squeeze out a parasite living off the host....","commenter_a":"I don't know which news item is more intriguing - this, or Kim Kardashian's wanting a divorce from Kanye West. It's so hard to keep up, with so much happening these days.","post_message":"Oh no. (from Elite Daily)"},{"comment_id":"1046533445373310","commenter_b":"that's not fair to pres o","commenter_a":"MLK would be ASHAMED of those useless race-baiters. He would spit in their eyes himself, if he were still alive.","post_message":"How I wish we had a Martin Luther King today instead of thugs and scam-artists like Sharpton, Jackson, Holder—and Obama."},{"comment_id":"10153184116079330","commenter_b":"She is just the white female version of what we already have. Time for a woman, yes, but not time one!","commenter_a":"Way to go Hillary - We need a lady in the white house and get rid of the Joker that is there now.","post_message":"Sources tell NBC News that former Secretary of State Hillary Clinton will announce her candidacy for president of the United States \"as early as Sunday.\" ---> nbcnews.to/1FHI9C6"}]
