[{"comment_id":"483365738520673","commenter_b":"Worthless hoe bag","commenter_a":"MYOB WITCH!","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153818246882293","commenter_b":"Leave it to mysoginists to make the case for feminists better than any feminist could.","commenter_a":"Women, get over it! You are way too thin-skinned, take yourselves too seriously, and get offended at the drop of a hat. Loosen up and quit being so tight-assed.","post_message":"If 75 percent of women told researchers they view Trump unfavorably, who is it that backs Trump?"},{"comment_id":"1299697093430376","commenter_b":"Snaaaaacks forreal. Them ladies looking like 4 course meals family","commenter_a":"So we all goin to ignore all the female snacks 😍😍👅 in this video ...","post_message":"Mike Tyson going in on Soulja Boy! #WSHH #MikeTyson #SouljaBoy"},{"comment_id":"426421217482473","commenter_b":"Yeah, I can picture this foul-tempered, lying, self-centered Socialist with an executive order pen in her fingers! Makes my blood run cold! There is NO WAY this liying, evil woman should ever get near the White House. She would be a foul-tempered dictator!","commenter_a":"Lowlife!","post_message":"Is Hillary Clinton threatening to betray the constitution?"},{"comment_id":"488963091300703","commenter_b":"Amen and Amen. If you have no respect for our country then stay out. I believe in freedom but don't come over here trying to change this country into the country you left. If your country was so great then why did you leave?","commenter_a":"I see no problem in this","post_message":"What do you think of Donald J. Trump's plan to combat terrorism? @webpagelink"},{"comment_id":"10153816577949160","commenter_b":"You believed that nonsense? Sue glad Donald never cheated at anything.","commenter_a":"When can we not have to listen to lying cheating Teds shrill voice cry over everything. Ted cheated on his wife then lied about it.","post_message":"Donald J. Trump just won Indiana. Here's what that means. READ MORE: @webpagelink"},{"comment_id":"1752604474967964","commenter_b":"Feel bad that all she did went right over my head. We couldn't understand the words but we made many comments on her big butt and thighs! Someone that big should never wear what she was wearing on national TV!","commenter_a":"LL Cool JJ, what a douche. Looks like the Wayans brothers had this jackass pegged, way back when, with \" Momma's Gonna Kick Me Out ! \" Maybe on youtube? Funny stuff, but about right, apparently.","post_message":"LOOK who LL Cool J just compared Black Panther Party Supporter and radical BLM donor Beyonce to..."}]
