[{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: \"This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.\" Watch complete press conference here: @webpagelink"},{"comment_id":"10154278163336509","commenter_b":"The Bush war, $7 trillion and counting!!! (Before) Good Schools and Good Incomes! (Now) Poverty, Guns, Incarcerations! $$ facebook doesn't want you to see this $$ As long as America's richest 1%, who now possess 70% of the wealth and don't bother to vote, have the Senators in their pockets the United States Government isn't representing the will of the people, it's the 1% that's running the show. I stand with Bernie Sanders, \"We're governed by an Oligarchy.\" The number of Americans living in poverty will continue to grow while the middle class will continue to shrink and working women will continue to enrich the wealthiest 1% for the next 20 years easily! (Able to afford the best and brightest, Hillary is a great political actor with a well rehearsed script.) She WILL make another Fortune!","commenter_a":"His plan is take more money from the successful and give it to people like freddie gray's neighbors......makes perfect sense.....","post_message":"Bernie Sanders seemed appalled by the conditions as he toured sites of unrest following the death of #FreddieGray. \"Anyone who took the walk that we took around this neighborhood would not think you are in a wealthy nation.\""},{"comment_id":"1390020544359635","commenter_b":"I would turn the hose on her and spray that STD filled flea bag off my property","commenter_a":"please knock on my door. we have lots of property and a back hoe","post_message":"I would rather ___________ than have Miley Cyrus knock on my door."},{"comment_id":"10153212700939270","commenter_b":"Well I know it was out of service around that time but I'm sure that's what they did but it was a great ship","commenter_a":"Aw darn now no one is safe aboard that ship when that time of the month comes","post_message":""},{"comment_id":"10156195156160615","commenter_b":"LMAO! Look at that old Mary!","commenter_a":"Being that he's gay, \"they\" should be \"we\"- \"I don't know why we need special protections.\" Also, \"special\" should be \"the same as\", since lgbts are just asking for the same as everyone else - \"I don't know why we need the same protections as everyone else.\" That's what he said, decoded.","post_message":"\"I don’t know why they feel they need special protections\""},{"comment_id":"1139840619402033","commenter_b":"Hey, if he wants them in California, I thonk we should let him have them. While were at it, lets build a wall around California too.","commenter_a":"What a POS he is","post_message":"Even the FBI says they can't propertly vet these migrants..."},{"comment_id":"850731841652961","commenter_b":"Another inbred rightwing BITCH! lmao.. Throw her to the lions! :) I wouldn't wipe my ass with the satanic black book of lies she learns from.. \"C-NT!","commenter_a":"One ugly MF !!!","post_message":"Her lawyer says it's not about bigotry. She says it's about her faith. But bigotry comes in many forms, and she's using her faith to justify it:"}]
