[{"comment_id":"10155469339470093","commenter_b":"NOOOOOOOOOOO!!! PLEASE no!!!!! Idiot progressives!!!","commenter_a":"Why would this NOT piss off everyone in NY who are legal tax paying American citizens??","post_message":"The impossible may soon become possible."},{"comment_id":"10153472333633352","commenter_b":"So how do you teach your girls how to be in a stable relationship?","commenter_a":"I have 3 daughters & until they grow up, no man will harm them under my roof. I sacrifice my dating a man or finding a love, so they can always feel safe. I won't allow a man to enter my life until my task is finished!","post_message":"Woman Murdered by Boyfriend After She Allegedly Asks Him If He Assaulted Her Daughter in a Sexual Manner – Daughter Also Murdered, Then Man Takes Own Life."},{"comment_id":"986689444723866","commenter_b":"She's an idiot","commenter_a":"She's as smart as a bag of hammers. Attention seeking dweeb.","post_message":"Wait until you see this."},{"comment_id":"994807880648616","commenter_b":"Is that a fly?","commenter_a":"Della Blake","post_message":"This design student created his own 3D braces for only $60, and his teeth never looked better. (via NowThis)"},{"comment_id":"10153767520167994","commenter_b":"Alicia Anne , try Jennie Craig","commenter_a":"I no longer have any remorse for anyone in an accident. I see drivers acting like morons every morning and every night...until they start acting like humans, people will continue to die. Michigan drivers are all a bunch of morons.","post_message":"The Davison Freeway westbound remains closed as investigators comb the scene where a man was killed in a crash."},{"comment_id":"10152904243581636","commenter_b":"If she wanted to kill herself she would have hope she frys!","commenter_a":"Those poor babies. This poor woman. I can't say I understand killing her babies, but she is very obviously severely depressed. I only wish she had gotten the medical attention she so clearly needs before she took such drastic measures.","post_message":"Officials say a Connecticut mother who allegedly murdered her two children left a suicide note next to the children bodies, explaining why she killed them."},{"comment_id":"10153702607362014","commenter_b":"Heck yes I'll be trying this!","commenter_a":"This makes me think of good luck Charlies Bob-burrito lol","post_message":"It's the hybrid you've always hope for (or quite possibly not)."}]
