[{"comment_id":"1117284038339327","commenter_b":"Please don't. Why would she want to shame herself in this way?","commenter_a":"will the sausage be halal free?","post_message":"Cue mass exodus from the city centre."},{"comment_id":"10153759489753812","commenter_b":"How do you know? One year of college did not teach you much","commenter_a":"Creationist heads explode...","post_message":"Researchers in South Africa believe they may have uncovered a brand new “relative” to humans, and they have named the new branch of the family tree Homo naledi.@webpagelink"},{"comment_id":"10153984867744411","commenter_b":"Saul Mendoza See, even Muslims know that Rapefugees are invaders","commenter_a":"Something is wrong as a muslim i am starting to realize people crossing borders easily are not refugees they are actually invaders , strict action must be taken to control borders","post_message":"Some 20,000 commuters travel from Denmark to Sweden every day"},{"comment_id":"1201515593201525","commenter_b":"Sad as it is. As often as this stuff happens and these woman still don't learn","commenter_a":"Update she was found dead and the man who did it is in custody. ;( RIP>","post_message":"UPDATE: Human remains found in a recycling bin have been tentatively identified as the missing Renton mother, Seattle police said. A suspect was arrested in Snohomish County. DETAILS >> kiro.tv/Renton-Mother"},{"comment_id":"10154502973076756","commenter_b":"@username do u recognize this woman in the pic? She's a Bay Area demonstration machine! I want to BE her!","commenter_a":"Wow.","post_message":"\"[W]e lack confidence that Judge Persky can fairly participate in this upcoming hearing in which a male nurse sexually assaulted an anesthetized female patient.\" -- Santa Clara District Attorney Jeff Rosen"},{"comment_id":"999058010215871","commenter_b":"Only palestinian tribe are Jews enemie because predatory tribe wants to grab everything from the Jews Included the History","commenter_a":"It is good you have such a strong army with all the enemys around you! May God be on your side!","post_message":"A beautiful moment full of love and appreciation at the 2016 Jpost Annual Conference. Share this video if you think that the Israel Defense Forces is the greatest army in the world!"},{"comment_id":"10153619663514877","commenter_b":"maybe he got 3 ugly wives.","commenter_a":"he int even cute, so his game must be strong, lol, just divorce the loser, with three wives he will not have an account, hahahah","post_message":"Man charged with being married to three women after second wife catches him on Facebook. Grio fam, what would you do if you found out your spouse was married to someone else via social media? Sound off below!"}]
