[{"comment_id":"10153893248952293","commenter_b":"That's only for white guys.","commenter_a":"Just give him a slap on the wrist and let him go. Same as always.","post_message":"Police began looking for the 40-year-old after finding her 3-year-old daughter wandering alone in a Baton Rouge parking lot near her mother’s abandoned vehicle."},{"comment_id":"10153060645251350","commenter_b":"And you'd win a beauty contest for sure ...","commenter_a":"She's so ugly. She has a mouth the size of a horses mouth","post_message":"What do you think: Is this a subtle pregnancy announcement or just a cute silly photo from Beyonce?"},{"comment_id":"10153982167589203","commenter_b":"What a pussy cant go against his witch of a wife!!!!","commenter_a":"@username Lorenzo Antonino","post_message":"\"If we're not a part of the solution, we're a part of the problem.\""},{"comment_id":"10153510348059411","commenter_b":"serious lips on that lady, shes got Grace Jones beat even.","commenter_a":"She has no ideas worth repeating-FIRE her.","post_message":""},{"comment_id":"555784677879905","commenter_b":"They're not looking for life, we are looking for resources, we kill each other for that in this planet. When we find the other resources the inhabitants of set planet will surely deliver our faiths.","commenter_a":"So anti media feel stopping space exploration will solve earths worries? ?Sorry but go the space programs and all the science behind it!","post_message":"Right? Follow us --> The Anti-Media <--"},{"comment_id":"10154308698454607","commenter_b":"Do these liberal protesters have jobs!!!!!!","commenter_a":"The US is being ridiculed by idiotic liberals who are obviously clueless on what President Trump is doing, protecting Americans!!! I live less than 20 miles away from that radical Islamic terrorist attack in San Bernardino, where 14 innocent people were murdered!! It's not Trump's fault that our government is so corrupted and does not have an immigration accountability system to know who exactly is entering our country! There are Isis training camps all over the United States! If you don't believe me Google it!!! There is an Islamic training camp less than 10 miles away. They are spreading like a disease everywhere! Last year local law enforcement caught 16 radical Islamic Muslims training near the a river bed all of them had AK-47's!!! All of them are now being investigated by FBI! 5 of which are on the top 10 most wanted list!!! Do you want to know why ...","post_message":""},{"comment_id":"1419671894761590","commenter_b":"Serves the liberal illegal lovers right.","commenter_a":"Moron","post_message":"Liberal Governor Just Caught Stealing $115 Million, Who He Gave It To That Will Piss You Off!"}]
