[{"comment_id":"10153459278655667","commenter_b":"Instead of talking about it, how about you guys do something about it? No amount of talk will stop someone from raping another.","commenter_a":"This is an incredibly important topic at the University of Pittsburgh. My fellow Pitt classmates are trying to continue the conversation and created this video about the objectification of women on our campus. If you feel strongly about the right to consent and say no, and want to support college students trying to make a difference check this video out: @webpagelink","post_message":"Vice President Joe Biden delivers an incredibly powerful and passionate speech on survivors of domestic abuse and rape at the University of Pittsburgh."},{"comment_id":"982212811884970","commenter_b":"This is so outrageous! Homeless Americans, hungry children,and people out of work and these people live like royalty. They need to be gone.","commenter_a":"shameful","post_message":"This was the Obamas eighth Hawaiian family vacation. The trip has become an annual event for the Obamas. To date, Obama and his family travel expenses total at least $85,029,819."},{"comment_id":"592558244260673","commenter_b":"The wall will at least stop them from driving & walking over the border.","commenter_a":"build the wall in Mexico","post_message":"Will Trump build the wall? When will riots end? DML addresses these issues in his Walk & Talk. Please watch and share, and if you are new to DML then we ask you give us a LIKE."},{"comment_id":"779121095562429","commenter_b":"You are so clueless.","commenter_a":"Sadly, his supporters will never watch this video. They are in utter denial. All they care about is his promise to stop immigration of Muslims and Mexicans and to keep white privilege in place. There are a lot of bigots/racists out there.","post_message":"Donald J. Trump has said a lot of things. Mike Pence said he didn’t say those things. He did. Here’s proof."},{"comment_id":"10153037800452434","commenter_b":"@username So yeah... indeed! That is a bit ironic, ain't it? I'm not republican either, I'm against the two party system, but anyway you're so right.. cracked me up.","commenter_a":"\"the Republican Muslim Coalition\" ....really?","post_message":"\"WHAT UP BITCH\" -this hijab"},{"comment_id":"1541756345884108","commenter_b":"Needs to be castrated","commenter_a":"someone please castrate this idiot","post_message":"The 'abhorrent' paedophile has been jailed for just THREE years"},{"comment_id":"10153619643270329","commenter_b":"Jordan Selph","commenter_a":"Jackie Hollander","post_message":"Bastille Day, As Told By Sloths"}]
