[{"comment_id":"10152837029192894","commenter_b":"I do the housewives should be married","commenter_a":"I kinda have to agree @username what do u think ?","post_message":"NeNe Leakes Says Bravo Should Get Rid of All the 'Unmarried' Housewives -- Do You Agree?"},{"comment_id":"10153618625791130","commenter_b":"How many more will emerge before she is 30? She is off to an excellent start!","commenter_a":"Sarah Palin has banned all Liberals from entering Bristol Palin","post_message":"Sarah Palin used some very creative English in her Donald J. Trump endorsement."},{"comment_id":"10154366303774749","commenter_b":"British Airways are a really bad airline, I would not trust a child of mine to them!","commenter_a":"If you can afford a top boarding school then you can afford a return ticket. Maximise revenue from those with plenty of disposable income to subsidise economy travel sounds like an excellent way to do things - well done BA.","post_message":"Parents will now have to travel thousands of miles to see off their children."},{"comment_id":"488312324683981","commenter_b":"Hmm if firearms are a replacement for a small penis what are females replacing with firearms @username???","commenter_a":"Gun Worship in The United States of Guns is Killing US...","post_message":"SCARY!!"},{"comment_id":"1242224722465203","commenter_b":"\"because they make decisions based on gut feeling and emotions\" - And here come the Facebook comments that'll prove just that. *sigh*","commenter_a":"I'm sure some don't, same with men.","post_message":"This person is also a board member of Women in Science and Engineering. -_-"},{"comment_id":"10152960155261336","commenter_b":"Illegal aliens receive EBT & all other assistance, including Medicaid & Medicare, Dorri McNeal Vigar. They need a TIN. They get it at the County Office or SS Office via their computers. They are the \"900\" series. If they have \"anchor babies,\" they get it. If they have children born in other countries, they get it. Now here is the un- requested bonus kicker: If they have a\"900\" series TIN, file taxes, & claim their children; even children residing in Mexico or other countries who have never been in the US, they can apply for the Child Tax Credit & get it. All they need is a TIN for each kid. The IRS is the largest remitter of funds to Mexico. When called on the carpet about it 2 years ago, the IRS became highly indignant & stated congress made no law disallowing them to remit for children not born ...","commenter_a":"And proof of US citizenship.","post_message":"Arguing that taxpayers lose $858 million a year on food stamp fraud, several GOP lawmakers have proposed a new bill that would require photo identification to use food stamps."},{"comment_id":"10153277383852098","commenter_b":"It's not typical. Do you think people don't need to know?","commenter_a":"Wow, sharks are seen in their natural environment!! How shocking!😱😱😱","post_message":"SHARK WARNING: Experts say a school of some 20 great white #sharks was recently spotted by the U.S. Coast Guard off a Bay Area coast. READ MORE ---> @webpagelink"}]
