[{"comment_id":"10154383180609641","commenter_b":"Now this is the kind of stories we want to see and hear... Not lesbian kissing in public yet in their hearts they know too that unless they repent and accept Jesus as Lord they are on their way to Hell","commenter_a":"Moms...","post_message":"Meet the woman behind Usain Bolt."},{"comment_id":"10153162076526680","commenter_b":"How the hell did you get to this conclusion based on my comment ?","commenter_a":"He's 100% right. Charlie Hebdo was especially targeted because they did cartoons criticizing Islam. What's more frightening in last week's attacks, is that, there was no rationale, just indiscriminate killing of everyone in sight.","post_message":"John Kerry suggested that there was a “rationale” for the assault on satirical French weekly Charlie Hebdo, unlike the more recent attacks in Paris."},{"comment_id":"1357303384289688","commenter_b":"Well how black do you have to be to be considered black... Since you have a PHD in biology","commenter_a":"\"If celebrating my roots and culture during Black History Month made anyone uncomfortable, those feelings were there long before a video and long before me,\" - Beyonce I totally agree!","post_message":"\"I'm an artist and I think the most powerful art is usually misunderstood.\""},{"comment_id":"10154869505163812","commenter_b":"Yuck","commenter_a":"Bill Clinton is the pig lets talk about what he did to woman .","post_message":"In light of the release of a recording of a vulgar conversation Donald J. Trump had where he brags about groping women, it seems that very little appears to have ever been off limits for the Republican presidential nominee."},{"comment_id":"10153141733752293","commenter_b":"I think you all forget that even if abortion was illegal, it would still happen. Illegal abortions were horrible, many women died. And if you think that only poor women had them or only uneducated women had them, you are badly mistaken. They happened in every economic group. Abortion needs to be legal, safe and rare!!!","commenter_a":"Yay for more fake videos. Planned Parenthood is a great organization. These people trying to create fake and misleading videos are the real enemy.","post_message":"In the video, the group discusses a potential contract for fetal parts."},{"comment_id":"1157767754287378","commenter_b":"This is the most ridiculous thing I have ever heard. NC, doesn't need this Administration deciding this issue for them! This administration is quick to bully states to legalize Gay marriage, overriding the will of the majority of people, bullying states to fall in line with their LGBT agenda. Counting the days til this administration crumbles.","commenter_a":"With all the crap that is going on and she chooses to fight this battle?","post_message":"“This is about the dignity and the respect that we accord our fellow citizens, and the laws that we as a people and as a country have enacted to protect them.” Attorney General Loretta Lynch formally announced that the The United States Department of Justice is filing a federal civil-rights lawsuit against the state of North Carolina, Gov. Pat McCrory, the North Carolina Dept. of Public Safety and the University of North Carolina over the state’s controversial “bathroom law.”"},{"comment_id":"422994894562852","commenter_b":"All but trump need to drop out and quit wasting money! Hell give it to the vets and homeless! Trump!!!!!!!!","commenter_a":"Mitt Romney will hurt Marco Rubio campain, please do let him","post_message":"Help or hurt?"}]
