[{"comment_id":"10153212964226336","commenter_b":"Daniel Eskildsen just because this women gave her kid a cookie doesn't mean she fills her kid with junk food.. cookies in my house are a treat to the healthy diets I have my children on..","commenter_a":"Teachers need to worry about teaching and not parenting","post_message":"Cookie crackdown! A preschool teacher sent a note home reprimanding a Colorado mom for packing Oreos in her 5-year-old daughter’s lunch."},{"comment_id":"10153073286297894","commenter_b":"I think the idustry favors her and is partial to her music but there is no room for disrespect to anyone.","commenter_a":"I can't get past \"somewhat respect me\". Either he respects you or not! ByeTaylor","post_message":"Taylor Swift Talks Kanye West in ‘Vanity Fair': I Felt We Couldn’t Be Friends Until He Somewhat Respected Me"},{"comment_id":"938149182885501","commenter_b":"I lived in a place in LA and I'm a clean freak but the apartment on the other side of the wall was dirty people causing me to get roaches. Now I moved outta Florida for one of those reasons. Thankfully I don't see them in Washington state","commenter_a":"Thanks for the report as high as rental apartment are they should have pest control ridiculous!!","post_message":"Imagine opening up every cabinet and drawer, and seeing nothing but roaches... Mark Rivera took the residents' concerns straight to management STORY: @webpagelink"},{"comment_id":"1022630587845203","commenter_b":"Trump is not racist. He wants to build a wall so he can get criminals out, and keep them out. No way would he, or would congress allow, deporting 11 million illegals. He doesn't hate Muslims, just wants to keep ISIS out. Look what refugees have done to Germany. Hillary has the media in her pocket. Wake up America!!","commenter_a":"Considering all that confetti at Hillary's nomination was the shredded up emails...I would say for honesty and safety...Trump won hands down.","post_message":"Now that all the balloons have fallen, who won the convention ratings race, Donald J. Trump or Hillary Clinton?"},{"comment_id":"337340083398778","commenter_b":"It’s the crazy lady","commenter_a":"Sounds like a republican did not see this coming from her good job","post_message":"If you can drive a military truck in combat, with hazardous cargo, at night, through a sandstorm, then you can drive a commercial truck on an interstate. If you can dock or anchor a 10,000 ton warship under extreme stress, you can do the same thing for a small commercial ship. We spend hundreds of millions to train our servicemembers to do highly skilled jobs, and they are the best at what they do. But too many still struggle to transition into civilian jobs because they don't have the right certifications and licenses – even when they’re being hired to do the exact same thing under much less taxing conditions. We've made progress on this issue over the last few years, and I don’t want to lower civilian standards – but I don’t believe for one second that these individuals aren’t ready to do the equivalent civilian jobs the day ..."},{"comment_id":"10153354132661320","commenter_b":"Religion is fake!","commenter_a":"He's a fraud sorry","post_message":"\"I can dream as long as I want to. I can believe God as long as I want to. If I wanna believe God for a $65 million plane, you cannot stop me.\" Pastor Creflo Dollar is blasting critics who took him to task for wanting a fancy private jet. Read more: @webpagelink"},{"comment_id":"10153223668067994","commenter_b":"Good. Now I bet she gets the hell out of here and never comes back! So embarrassing!","commenter_a":"Yay!!!!!!!!!","post_message":"Good news!"}]
