[{"comment_id":"10153413521069255","commenter_b":"Loose lips sink ships.","commenter_a":"Santorum doesn't even know that the Pope is in fact a scientist! He is a chemist! Santorum is the idiot!","post_message":"Yes. That Rick Santorum said that."},{"comment_id":"10156406946480354","commenter_b":"She'll be a thief til her last breath!!!!!!!!!!!!!!!","commenter_a":"Hillary Clinton is a corrupt, old, nasty glory seeker.","post_message":"\"Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" Hillary Clinton is a _________________."},{"comment_id":"1512598459048144","commenter_b":"Your the dumb ass!!","commenter_a":"You people are stupid if you think illegal immigrants get assistance. They stay in hiding so that they don't get caught and sent back. They can't get assistance without a social security card. Stop listening to dumb ass Trump.","post_message":"Trump says his plan to build a wall at the border is absolutely not negotiable. Do you support or oppose the wall?"},{"comment_id":"1721466568134277","commenter_b":"SHE IS A HITLER","commenter_a":"What an idiot","post_message":"Was this a good idea?"},{"comment_id":"848280508611132","commenter_b":"Bye bye illegal parasites. Free ride is over. Self Deport before you're kicked out kicking and screaming.","commenter_a":"Donald Trump is the man. It's time to rid America of career politicians, and put someone in the White House that genuinely loves their country.","post_message":"820,000 crimes committed by illegal immigrants, here in America. Guess what! NOT WHEN I AM YOUR PRESIDENT! I can assure you of that! We will BUILD THE WALL- and Mexico is going to pay for it!"},{"comment_id":"10154974435358812","commenter_b":"Russian Women For Trump ???","commenter_a":"Well rehearsed lol","post_message":""},{"comment_id":"818359668354610","commenter_b":"Freaken Muslim foreigner.","commenter_a":"Yes","post_message":"Obama Disrespects Our Nation's Police In A SICKENING Way Right After Dallas Shooting He is the worst president in our country's history. Do you think Obama is a disgrace?"}]
