[{"comment_id":"1624321510961305","commenter_b":"She's a P I G!","commenter_a":"She has a lot of gall, wearing a crusifix on that neck........","post_message":""},{"comment_id":"1164111043641758","commenter_b":"that is not Trump8 wife","commenter_a":"Hey if you got it show it","post_message":"Liberals Attack Trump Family After Sexy Photos Of Ivanka Trump Leak. Let's show her our support. Do you stand behind the Trump family?"},{"comment_id":"1225420670803521","commenter_b":"KICK THEM OUT","commenter_a":"Whatever happened to the US Military Academy's Code of Honor? If it's still in effect, those who raised a fist should be court-martialed.","post_message":"Concerns arose that the pose violated Pentagon rules on avoiding political activity by paying tribute to the civil rights-era Black Panthers group or to the present-day Black Lives Matter protests."},{"comment_id":"10153065116958984","commenter_b":"He does it for money, he don't give a damn about the Blacks on the street shooting there brothers and sisters or he would be here trying to straighten them out. But let a white or police officer doing the shooting and he will be there starting trouble. He is pregistist .","commenter_a":"This guy is a real Jackass","post_message":"Seriously Al? You must be joking... Is it about time for Al Sharpton to give it a rest?"},{"comment_id":"10154569293118132","commenter_b":"Her eyes are evil!!","commenter_a":"I think she was beautiful. This story has haunted me since it broke. Her and her daughters seemingly had a lot of love for each other. This is so tragic and so sad.","post_message":"5 things you need to know about Christy Byrd Sheats, the Texas mother who shot and killed her two daughters. (Via People True Crime)"},{"comment_id":"1486825354715718","commenter_b":"Thank you","commenter_a":"The judge then goes through the charges and dismisses the girl, to which she smugly replies, “adios!” He orders her to come back for the way she left, then increases bond for her charges from $5,000 to $10,000. “Are you serious?” the girl asks angrily, before saying “f-- you!” to the judge and storming off. She is then ordered to return again, and the judge becomes furious with her attitude. “Did you say ‘f--- you’? Did you say that?” the judge asks. “Yes sir, I did,” the girl responds. “Oh you did say that?” the judge replies. “I find you in direct criminal contempt. Thirty days in the county jail.” The video from 2013 went viral, with many praising the judge’s decision to punish the girl for her harsh words and attitude towards him.","post_message":"A judge thought he misheard what this teen girl said to him, so he asked her to repeat herself. She did. When he realized he hadn't misheard, the judge issued a response that the teen girl wasn't expecting."},{"comment_id":"714918215322687","commenter_b":"BUILD THE WALL","commenter_a":"Trump/Pence 2016... Enough of corrupt establishment politicians.","post_message":"Live: Donald J. Trump holds a rally in Manchester, New Hampshire."}]
