[{"comment_id":"10154555938529411","commenter_b":"Deeick Foley Kiss my Muslim American ass you scum.","commenter_a":"A failed colonial Zionists nuclear power have learned a lot and definitely exceeded the Hitlers Nazi's regime. Free Palestine. #BDS","post_message":"For those who are 'murdered with a knife in the heart it does not matter if the child is 12 or 15'"},{"comment_id":"503269356530311","commenter_b":"Yes they should keep it in there country. We do not want it here.","commenter_a":"Yeah right. I don't think so. This is BS","post_message":"Legislature passed in Florida that is forcing Shariah Law on local women. These women are in trouble. Let's put a stop to this now. Do you agree Shariah Law should be banned in America?"},{"comment_id":"228156194316478","commenter_b":"Trump 2016, Trump 2020","commenter_a":"AND THAT'S Y HIS ASS GOT TO GO!","post_message":"WOW. Listen carefully... EVERYTHING she said back then was right! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1026765060695063","commenter_b":"I'd whip her so hard she could only us that middle finger to rub her sore butt.","commenter_a":"No presents .........","post_message":"Utterly hilarious 10-year old drama! [Read below]"},{"comment_id":"10153083493211336","commenter_b":"Exactly. Bills must be payed no matter what.","commenter_a":"This is awful...was he not paying the bill? Because just because we are deployed doesn't mean we stop paying bills....I certainly pay all of mine while I'm deployed..","post_message":"Despite laws in place to protect troops, retired Sgt. Charles Beard's car was repossessed while he was serving in Iraq."},{"comment_id":"1701770233407796","commenter_b":"The Muslims should start their own food chain. They could have whatever Muslim food they wanted. Then Americans could be outraged that they don't have cheeseburgers.","commenter_a":"I agree with these companys","post_message":"There is no reason why they should have to change their business for them. Do you support these food chains?"},{"comment_id":"10153633420073132","commenter_b":"Keep up with the misogyny","commenter_a":"These are the lowest life, vilest example of human being that exist today. And that's the best that I can say about them.","post_message":"\"We aren't sisters, we never were. We just dated the same guy at the same damn time.\" - Kendra Wilkinson on Holly Madison"}]
