[{"comment_id":"1397527680309345","commenter_b":"Give Facebook some competition techies.","commenter_a":"YOU BETTER LOOK AT THE FACTS ,TRUMP ALLOWS IMMAGRANTS IN ,BUT IT HAS TO BE LEGALLY ,WHATS WRONG WITH THAT ,AMERICAS SAFETY FIRST","post_message":"PISSED Off Facebook CEO Sends Giant YOU To Trump Didn Expect THIS To Happen Moments Later!"},{"comment_id":"1689857144590196","commenter_b":"I say do it, and take it even further....stop immigration altogether until a proper vetting system is implemented!!!","commenter_a":"It is unAmerican and wrong to have different rules for people of another religion. Have we really come to this? We are a free nation of fearless people, this is an insult to our national character. Trump would use that fear to further his own short term goals and incidentally the long term goal of ISIS to drive a wedge between Muslims and the rest of the world.","post_message":"Republican candidates are set to take the stage tomorrow for the final #GOPDebate of 2015. So, what do Donald J. Trump's friends think of his proposal to ban Muslim immigration to the U.S.?"},{"comment_id":"10154558927621323","commenter_b":"Sex is a biological need. If I'm in a relationship, I am entitled to sex. If she won't provide, I can find someone who will. Using sex as a weapon against men is ABUSE.","commenter_a":"Problem is there are too many uptight women out there. Articles like this don't help either. 'Intimacy'. Words like that make sex sound like some mythical state of enlightenment that we are trying to achieve. When the fact is its just some good old hard core fucking. Get all the mind fuck thoughts out your head and get sucking or licking and you'll soon get into it. We've had hard core porn for years now showing us how to get down and dirty with it so stop making a big deal about it. And if all else fails there's prostitutes who can do the job for you so just sub contract it out and let your partner get some for a change instead of walking round like a sex starved idiot.","post_message":"\"Drink is not the answer.\""},{"comment_id":"10152749769427894","commenter_b":"Fuck u Im beautiful somebody love it and u must love I don't have time to entertain your stupid ass go suck a sick dick bye bitch. Go suck Bruce Jenner dick look like u in love with him","commenter_a":"Bruce Jenner is a joke wtf look how he look","post_message":"Too Far? Jamie Foxx Jokes About Bruce Jenner During the iHeartRadio Music Awards [Video]"},{"comment_id":"10155910750959062","commenter_b":"She should have thought about her baby before she decided to become a thief! Do the crime do the time!!! She got caught and now she's worried about her baby! Should have been worried before doing the crime! Baby is being raised by a habitual, especially if she can't act straight while pregnant","commenter_a":"She was sentenced 14 days and is getting them 3 for 1 that's 5 days people. If she were male and not pregnant she would have been ordered six months. Being pregnant isn't a get out of jail free card.","post_message":"Right or wrong?"},{"comment_id":"1009473349173573","commenter_b":"This woman is an idiot.","commenter_a":"#ArrestHillary #NeverHillary #GladlyPayforHillaryInJail","post_message":"FBI Federal Bureau of Investigation Director James Comey testifies on Hillary Clinton Email Investigation before House Oversight Committee. Complete video here: @webpagelink"},{"comment_id":"1011579805549158","commenter_b":"Just wait til that fat bitch is refused her insulin because her fat, meat eating ass offends a pharmacists sincerely held religious beliefs.","commenter_a":"Think that woman having a dead fetus inside of her would have been a bigger problem. that can lead to a serious infection. the drugs she was prescribed was not to induce an abortion but to remove a fetus which had already died","post_message":"Straight, white Christian men run the world and they don't care who they have to hurt so that doesn't change."}]
