[{"comment_id":"10154400468321509","commenter_b":"How does this help improve the economy, education, and create jobs! The battle is more than Hilary, let her stop dreaming!!!!!!!!!","commenter_a":"Go directly to jail","post_message":"Hillary Clinton: \"I will defend voting rights, and make it a priority... to get rid of Citizens United and its pernicious effects on our electoral system.\" Read her opinion piece on CNN: @webpagelink"},{"comment_id":"10153502660004087","commenter_b":"Obviously! She won by less than 2 delegates- 6 of which were won by COIN TOSS.","commenter_a":"She will enjoy in prison","post_message":"“Obviously, Secretary Clinton has won. So congratulations to her,\" said White House press secretary Josh Earnest said. I am sure they feel good about that. They should.\""},{"comment_id":"10154303723989411","commenter_b":"@username I'm not sure all of them are refugees","commenter_a":"if cannot adapt the European lifestyle why want to lived in Europe. I just do not understand, much better they lived in arab countries and do their own style.","post_message":"'We are not anti-migration party, we are for controlled immigration. We cannot allow for the borders just to be open for everybody who wants to come in and settle down here. No other country does that'"},{"comment_id":"370446236477004","commenter_b":"Take the bastards OUT!","commenter_a":"Time for drone, and Hell Fire missles.","post_message":"Is your state on the list?"},{"comment_id":"1066274426802142","commenter_b":"I have $10 that says that first woman in that video doesn't know how to spell diligence.","commenter_a":"Just a bunch of ignorant fear mongers, there is much more violence fine by people that sound and look just like them than any Muslims within the states.","post_message":"Did Donald Trump alienate his supporters by calling for a ban on Muslims entering the United States? NBC News asked attendees of Trump's rally in South Carolina what they thought. Watch more: @webpagelink"},{"comment_id":"10157050332450354","commenter_b":"This bitch is a PSYCHO!!!!!!!!! I am 100% convinced now ( before I couldn't be totally sure ) that those bruises on her forearm were made prior to Cory grabbing her. Corey grabbed her biceps the video shows more likely than her lower arm. She has 0 credibility and will never get a job as a respected journalist again","commenter_a":"You stupid bitch you need to let it go. There was no case and you should be the one arrested. You will be lucky if you can get a job delivering papers. Your a liar just trying to get more than your 15 which by the way is up. You didn't do what you were told to do just like every other common thug that feels they can what ever they want. Now shut up and go home before you make a even bigger ass of yourself","post_message":"“The entire situations just seem to me a little sketchy....\""},{"comment_id":"1635226930076425","commenter_b":"Take those women.","commenter_a":"I hope they do leave...","post_message":"We might have to pay another country to take them..."}]
