[{"comment_id":"582823241912998","commenter_b":"Strong, smart, accomplished, patriotic, conservative, compassionate & gracious PLUS stunningly beautiful & elegant, too -- truly she is in a class all her own!","commenter_a":"Since when does a porno star bring class to any situation?","post_message":"As first lady, she will be 'our new Nancy.'"},{"comment_id":"10153478346566955","commenter_b":"Nancy Reagan has more class in her little finger than Michelle Obama has in her entire \"hulkish\" body!!!!!!!","commenter_a":"As always, a lady of class! Hoping this next debate, we get a chance to hear from ALL the candidates more than the moderators.","post_message":"Nancy Reagan invites 16 candidates to next debate..."},{"comment_id":"10153461487831636","commenter_b":"If this woman is happy to make her money from demonising victims whoever they may be then perhaps the rest of us should just think \"what a vile individual she is\" and distance ourselves. What she has successfully done, again, is to spark a debate about herself . Which is probably earning her a fortune . Stop reading the Daily Mail for a start . Johnson was found guilty in court by a jury. Quite rightly the judgement was made on evidence and fact. Not opinion and scaremongering . Let's just stop giving her air time.","commenter_a":"WTH bloody Katie Hopkins ffs again innit???","post_message":"Her comments have sparked a particularly vocal backlash"},{"comment_id":"1200823989996135","commenter_b":"@username I, for one, will not miss that evil animal at all!","commenter_a":"Lets just Eliminate him ... can't understand why he has not been removed already ... Oh Wait , people are to afraid to do anything !","post_message":"Obama now want to eliminate another of our national symbols. Just wait until you see this!"},{"comment_id":"981590648554229","commenter_b":"Let me know if you need any help doing actual research, as opposed to just spouting off your uninformed opinion, Skatie.","commenter_a":"Of course, Mother Teresa was NOT talking about abortion when she said that, she was talking about child poverty.","post_message":"Mother Teresa gets it right! What do you think?"},{"comment_id":"10152872089786135","commenter_b":"Nations aren't doing too well and filled with hate, before this law was passed.","commenter_a":"We all know what God does to nations that disobey His word and goes rampant","post_message":"BREAKING: U.S. Supreme Court requires states to recognize marriage between two people of the same sex. LIVE UPDATES: @webpagelink"},{"comment_id":"10153613354068690","commenter_b":"and she need to learn how to write in english either","commenter_a":"May Allah help all Muslims around the world Ameen","post_message":"We demand the freedom of our colleagues who are unjustly detained in Egypt. #FreeAJStaff"}]
