[{"comment_id":"1298830980155135","commenter_b":"No wonder we are in the decline we find in our country...these people obviously do not want to deal with reality and make excuses.","commenter_a":"The indoctrination of the Sheeple.","post_message":"When asked about the Ohio State University terrorist attack that took place on Monday, the students just could not bring themselves to be honest."},{"comment_id":"10153322465354575","commenter_b":"That's no lady.","commenter_a":"F that lady","post_message":"A veterinarian posted this picture on Facebook with the caption: \"My first bow kill, lol. The only good feral tomcat is one with an arrow through it's head! Vet of the year award ... Gladly accepted.\" The cat was a family pet named Tiger, and now she could face charges."},{"comment_id":"1102034899855986","commenter_b":"You all want a Muslim hater so kinda breaks out even don't you think?","commenter_a":"Fuck 'em.","post_message":"American Islamophobes are beside themselves because human rights activist Sadiq Khan was elected mayor of London."},{"comment_id":"10152899469751130","commenter_b":"Women tearing women down. This is why we can never have nice things.","commenter_a":"The face and stance totally remind me of the gorillas at the zoo lol.","post_message":"Do not f**k with Ronda."},{"comment_id":"10154733187488967","commenter_b":"Hey. You want to make a point? Then back it up with a source. You want me to go to NBC and pull an article that states the opposite? Because i can. Now will you show me your point of view, or shut up?","commenter_a":"more people lost their healthcare under obama than anyone. ACA, uninsuring the insured since the dumbest politician on earth said \"you have to vote for the bill to see whats in the bill\"","post_message":"What happens if Obamacare gets repealed?"},{"comment_id":"10153316007267144","commenter_b":"Why doesn't she ever just answer the questions and stop telling everyone everything else!! Oh yeah, because she is the biggest liar ever!!!!!","commenter_a":"Way to go Hillary Clinton!","post_message":"The whole room joined her. Watch."},{"comment_id":"10155018018037311","commenter_b":"You should not judge unless you walk in their shoes, there are many reasons why they come in and stay illegally, majority work harder then any one born here to make ends meet. They do not get freebies, unless someone is kind and help them. 90% of them just come here to work and work harder then most people. People just talk out of ignorance","commenter_a":"It's too bad all these snowflakes can't distinguish between Immigrants and ILLEGAL Immigrants. The United States has always welcomed legal immigrants who want to come to this country, embrace the culture and make a contribution to the success of this country. We do not welcome people who come like thieves in the night, vote illegally, steal social security benefits, use our schools and hospitals and commit a disproportionate amount of crime. Big Difference. PASS IT ON!!!","post_message":"It calls for immigrants across the country to not attend work, not open their businesses, not spend money or even send their kids to school."}]
