[{"comment_id":"970527739636683","commenter_b":"Didn't notice the theme until I read the headline, after inspecting the goods.","commenter_a":"I don't see any injured vets? just hotness!!","post_message":"\"I'm not giving them back their confidence. They already have it.\""},{"comment_id":"927281534054105","commenter_b":"He doesn't belong in America!!!! Get out Obama!!!","commenter_a":"He is a traitor and should be impeached.","post_message":"This is seriously outrageous."},{"comment_id":"10150823645789963","commenter_b":"She was a hoe..","commenter_a":"But having relations with an intern is something private. A blow job is no big deal. The Leftists sure do rationalize a lot.","post_message":""},{"comment_id":"1626970717590041","commenter_b":"Just another dumb ass girl.","commenter_a":"Great job to a fellow veteran to set her straight. As a veteran we all lay our lives on the line and people like this little girl has no concept of what that means. It seems to me her family hasn't taught her or the school's she has gone to they need to wake up","post_message":"What an epic response by this Veteran!"},{"comment_id":"902128633188334","commenter_b":"I talked to my next door neighbors about the illegals. They were very verbally upset with the illegals. You see their whole family was born in Mexico and they all moved to Oklahoma Legally. The man told me it took them almost 12 years to get the whole family here. BUT they could have paid smugglers and had them all here in 2 years. They hate the illegals also. They said they give the rest of the Mexicans a bad rep.","commenter_a":"Welcome and thank you for doing it the right way","post_message":"Americas Freedom Fighters"},{"comment_id":"1076420105745487","commenter_b":"But will that maggot go to Chicago?nope, why cause they are not Muslims!!!","commenter_a":"How sad that these voices will not be heard. It does not go along with Obama's agenda. The black race is being set up. He would rather get 13 percent of a country, pissed off at 87 percent of a country. It is a setup for failure folks.","post_message":"WATCH Black Chicago Residents Blame Obama For Crime And Joblessness: “He needs to resign”"},{"comment_id":"1241837469190442","commenter_b":"@username was gonna say too :/.. probably bhs...","commenter_a":"Tim","post_message":"Ready to play during recess? Sit on the bench at this school, and you'll find friends in no time. (via CBC Saskatoon)"}]
