[{"comment_id":"10153860760766135","commenter_b":"You are so right.","commenter_a":"It was not a mistake, it is business as usual at Detroit Animal Control.","post_message":"\"As a result of a computer status error, a tragic and unacceptable euthanasia was authorized.\" -- Detroit Animal Control"},{"comment_id":"10154033192724087","commenter_b":"The white trash vote can win you the primary, just not a GE. They don't have enough Electoral votes.","commenter_a":"At this point, should really stop insisting he can't possibly become president. If we lived in a sane world, he wouldn't even be the nominee. But, here he is, and no matter what he does, people continue to support him.","post_message":"\"Donald Trump won’t be our next president come January 20, 2017, and here are 5 reasons why.\""},{"comment_id":"935532149828645","commenter_b":"No refugees immigtants.We're your great great.oh Grandparents Irish immigrant ?","commenter_a":"NO REFUGEES, NONE ! We Americans do not need more problems in our country. Stop them, am I CLEAR ?","post_message":"Our nation has always been welcoming, but we can’t let terrorists take advantage of our compassion. We should not bring Syrian refugees into this country unless we can be 100 percent confident that they are not here to do us harm."},{"comment_id":"913575248773260","commenter_b":"Hillery is a known lesbian predator get it out and end her run to destroy this nation","commenter_a":"God i feel sorry for her","post_message":"Sex slave survivor Cathy Obrien swears that Hillary Clinton raped her when she was a child in Arkansas @webpagelink"},{"comment_id":"734861966642849","commenter_b":"Abortion should be legal everywhere and easily accessed for any women or young girl. It is their body and their right. A fetus that cannot process a though does not trump the right over an already born human being, especially when it lacks a social security card, birth certificate, valid first and last name, etc. A fetus does not reserve the right to life over the person it feeds off of and needs for survival. It is her property and as her property, she has a right to decide what does does with it where her physical and mental healthy is concerned.","commenter_a":"So disappointed you tossed in a nod to the Terry Shivo debacle...bad move. Most were probably not savvy enough to catch it. I did, you lost my vote. John Kasich won. Compassion and tolerance always beats government intrusion","post_message":"\"My record is clear. My record as a pro-life governor is not in dispute. I am completely pro-life and I believe that we should have a culture of life.\" – Jeb More on Jeb's conservative record: @webpagelink"},{"comment_id":"10153427070736749","commenter_b":"BAN ALL THE POLITICIANS AND YOU WON'T HAVE ALL THESE STUPID IDIOTIC LAW'S WE HAVE TODAY WHERE THEY ARE TRYING TI TAKE ALL OUR GUN RIGHTS AWAY! OUR FOUNDING FATHERS OF THIS GREAT NATION ARE PROBABLY TURNING OVER IN THEIR GRAVES RIGHT NOW THINKING WHAT, WHERE AND WHEN THE NEXT CIVIL WAR WILL BE HERE IN THE U.S.A. WE NEED TO CLEAN HOUSE OF ALL THESE ELECTED OFFICIALS AND ELECT NEW BLOOD INTO THE OFFICE! CASE AND POINT MADE.","commenter_a":"Time to get EVERYONE trained properly on gun safety! Time to re-address the mental illness issues...","post_message":"Gun violence shouldn't be so commonplace. It's time for Congress to do something about it. @webpagelink"},{"comment_id":"567332390082204","commenter_b":"The dumbest woman in America alive .","commenter_a":"What a goofy broad.","post_message":"What are they going to call it, Mount Dumb-Dumb? -Conover"}]
