[{"comment_id":"10154360980241336","commenter_b":"I would rather see the winner of the Miss USA pageant as president than that nasty skank Hillary","commenter_a":"That's because most Miss USA contestants are a whole lot smarter than Hillary.","post_message":"Thoughts?"},{"comment_id":"10155137822548984","commenter_b":"@username hold your breath you retarded bitch and see witch comes first.","commenter_a":"He has done more in one or two days against ISIS, than Obummer had done in 8 years! On the other hand Obummer has done more to help ISIS and Iran in eight years than all countries combined!","post_message":"General James 'Mad Dog' Mattis just showed everyone why Donald Trump chose him to be secretary of defense. ISIS is in for a rude awakening..."},{"comment_id":"962229497130510","commenter_b":"LoL","commenter_a":"Hello!?! Everyone has a personal tracking device on them at all times now...it's called a cellphone. They know where you are every second of the day. Even with GPS turned off. They can turn in your camera or mic at will....and they have, do, and will continue to violate your rights with zero accountability.","post_message":"Enjoy your first private phone calls in more than a dozen years. @webpagelink"},{"comment_id":"1158796597473702","commenter_b":"She was having a PRIVATE conversation with her son! It is no one else's business!!!! She quite clearly stated she speaks English!!! Read the article people!!! So stating that immigrants should learn the native language in this situation is redundant!","commenter_a":"We speak many different languages in America.","post_message":"The woman was speaking with her son in Spanish while celebrating his birthday when a stranger interrupted to tell them, \"We speak English in America.\""},{"comment_id":"10153122318985950","commenter_b":"The bitch is the devil.","commenter_a":"stand Firm Kim .Dont Backdown .The Devil Never wins unless You let him .","post_message":"Before returning to work today, Ky. clerk Kim Davis said she is being \"forced to disobey her God,\" and that she still won't authorize marriage licenses for same-sex couples."},{"comment_id":"10150603929279999","commenter_b":"Aren't they real women? What's a real woman, and who doesn't qualify ?","commenter_a":"Perhaps a more diverse group by race, ethnicity and cultural but alarmingly the same re: the skinny, young and sullen look of mannequins rather than real women...","post_message":"Meet the woman behind the unconventional beauty of today's most successful models."},{"comment_id":"10155835827900615","commenter_b":"About damn time they got these creeps off the air!","commenter_a":"Unfortunately another network will probably pick them up.","post_message":"BIG BREAKING NEWS –"}]
