[{"comment_id":"10154524451224885","commenter_b":"I will guess her assets will be liquidated to pay the girls back.","commenter_a":"Serial killer.... I called it the day it happened. I hope those little girls in Troy get a pay out from the insurance company for their mothers life insurance now!","post_message":"BREAKING: A prosecutor filed charges of first-degree murder and armed criminal action Tuesday against Pamela Hupp in last week's killing of Louis R. Gumpenberger at her home."},{"comment_id":"10154369386141509","commenter_b":"Why are they racist? Because we want to deport illegal immigrants like every single country in the world? So the whole world is racist except for American liberal sissy's? Mexico deports all illegals so by your standards they're racist. England is racist. China is racist. Maybe your just a puppet?","commenter_a":"This won't sit well with the racist elements of the Republican party. Cruz is saying what I thought all along, the Republican party will never round up anyone. It's an election ploy with base voters.","post_message":"Texas Sen. Ted Cruz does not plan to authorize a special force to deport the undocumented immigrants currently in the country, he told CNN's Jake Tapper, setting up a policy contrast with Donald J. Trump. @webpagelink"},{"comment_id":"10153981739504091","commenter_b":"Go stick your head in a latrine!","commenter_a":"What did he know about the Clintons?","post_message":"RIP: The star of reality series Ice Road Truckers on HISTORY was killed in a plane crash while he was planning to film a show about recovering plane wrecks."},{"comment_id":"1207103952642966","commenter_b":"I'm a democratic and I don't like gay people at all I mean at all.","commenter_a":"I thought she was with the Inquisition.","post_message":"Kentucky clerk Kim Davis, a longtime Democrat, says she is switching to the Republican Party because she feels abandoned by Democrats in her fight against same-sex marriage."},{"comment_id":"10153021829314712","commenter_b":"If you thought my tone was rude then you should not have replied to me with a lecturing tone. Because clearly you thought that was productive.","commenter_a":"Lauren it isn't dumb and you are rude... I am married 17 years to a bus riding bike riding no driving city worker here in Baltimore and he has made the same observations..riders... walkers..and especially drivers need to do a better job observing traffic laws...but your tone and answer is counter productive..have a safe day and as the Irish say.... Safe home","post_message":"Commentary: Car-centric systems cost lives, and diminish quality of life."},{"comment_id":"623412734499592","commenter_b":"Stupid ass mofo","commenter_a":"The next President","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"497111050479475","commenter_b":"She's a sellout to her own race, taking everything that white people gave her, and then spews her racist anti white nonsense to make blacks think she actually cares about them.","commenter_a":"She described racism other countries not ours.","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"}]
