[{"comment_id":"1724806041088528","commenter_b":"@username don't be angry at @username because your ignorant.","commenter_a":"And THAT is why we need @username more than ever. With a life-long career of public service, having been a successful Senator and Secretary of State, and more than tough enough to continue the legacy of Obama, no one is more qualified. #Hillary2016!","post_message":"“The presidency is not an entry-level position.”"},{"comment_id":"860972087426701","commenter_b":"ABSOLUTELY NEEDS TO GO TO PRISON FOR LIFE WITH HARD LABOR . MAKE HIM CLEAN TOILETS WITH A TOOTH BRUSH .","commenter_a":"Good Luck Generals....he's pretty slick...watch out for the fall out!","post_message":"Obama has betrayed our country. These generals are moving in to arrest him. Do you think Obama should be put behind bars?"},{"comment_id":"506619736194965","commenter_b":"Thats some nasty, ass mf shit","commenter_a":"Que terrible,","post_message":"Workers reportedly wear diapers to avoid becoming so desperate that they urinate or defecate on the floor."},{"comment_id":"1369450476431551","commenter_b":"take your Muslim BS and shove it !","commenter_a":"The current jews inhabiting Israel now are not the descendants of Prophets Jacob/Israel. . The true descendants of Prophet Israel moved to Egypt and they inhabit Egypt currently.. do not forge the history","post_message":"WHO SAYS THERE IS NO GOOD NEWS IN THE WORLD?"},{"comment_id":"810137155781996","commenter_b":"If we wouldn't have killed them you would be dead by now","commenter_a":"Jebs brother George gave the go ahead to invade Iraq for something they didn't do leading to the death of over 500'000 innocent civilians. Jebs brother George. Jebs brother.......... Let that sink in. 500'000 men, women and children.","post_message":"The Obama-Clinton-Kerry team's stance towards Israel has been a disgrace. I’ll rebuild this crucial alliance."},{"comment_id":"10153561426376135","commenter_b":"we know this lady is","commenter_a":"Why would I answer those stupid questions to see this story? WXYZ are you crazy?","post_message":"In 2015, in Troy, she was charged with assault and battery. She later pled to disorderly person and, two weeks ago, she was ordered to pay a $500 fine and attend anger management."},{"comment_id":"10153170586384255","commenter_b":"Yay!! We already have enough leaking pipelines crisscrossing America...","commenter_a":"Eight treacherous Democrats. They should have to fight for their seat sin primaries.","post_message":"As expected."}]
