[{"comment_id":"1331908300162530","commenter_b":"This is disgusting, disgrace to America this never happen before, DJ.T is disgrace for our America, so dangerous wild animal.","commenter_a":"He is right! We unfortunately live amongst animals!!","post_message":"Trump said organized 'thugs' shut down his First Amendment rights in Chicago"},{"comment_id":"10154222975181336","commenter_b":"Throw Megyn Kelly up and over #TrumpWall and into Mexico!","commenter_a":"This is supposed to be a cutting edge news story? I am really disappointed with Megan Kelly. Every episode is guests who trash Trump. Megan always has guests on that attack Donald about women. It is her agenda. it is disingenuous.","post_message":"TONIGHT on The Kelly File: In an exclusive interview, Ted Cruz's wife, Heidi Cruz, speaks out about Donald J. Trump's retweet of an unflattering photo of her: \"I think we have a pattern of behavior here ... when Donald Trump is falling behind.\" Don't miss the entire interview with much more at 9p ET. @webpagelink"},{"comment_id":"10153043089801519","commenter_b":"Right? Because...ick.","commenter_a":"#dontbethatguy","post_message":"\"He then sent me five nude photos of him lying in bed, his penis prominently displayed...\""},{"comment_id":"10153414800625933","commenter_b":"Liars make me sick.","commenter_a":"John, you seem very busy these days, but who is governing Ohio at this time? Do you plan to reimburse the Ohio tax payers ? That would be the right thing to do . You have been eliminated for months. Get back to making Ohio great. Do the job your being paid to do.","post_message":"Let’s Get It Done."},{"comment_id":"1049313658417628","commenter_b":"Too true!","commenter_a":"I see an IRS audit in staples future. ...","post_message":"Staples announces that because of Obamacare they're having to make some changes in the structure of their employees, and Obama does not like it and he takes out after them. \"Obama Slams Staples for Reducing Hours to Avoid Obamacare,\" and Staples responded."},{"comment_id":"1044706655577881","commenter_b":"She know she be giving up the boot-Tay lmao","commenter_a":"This isn't even news! Yes fox 10 just post BS stories that are none of our business....","post_message":"SOUND OFF: This is Chelsea. She's 20, lives in Florida, and travels the world with men she meets online... on their dime. She says there's no pressure to do anything other than hang out with these men. What do you think? Let us know, and we'll share your comments on FOX 10 Arizona Morning!"},{"comment_id":"1142584762463568","commenter_b":"President not dictator","commenter_a":"Donald Trump nuclear war","post_message":"Indiana governor and Republican vice presidential nominee Mike Pence spoke at a rally at the Space Coast Convention Center in Cocoa, Florida."}]
