[{"comment_id":"10152964045994753","commenter_b":"I must be living wrong, that bitch","commenter_a":"This is in England so who cares","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"10155466728060354","commenter_b":"Lol...I remember when a female Dem said that recently.","commenter_a":"What will he do about all the women driven to prostitution as a result of global warming?","post_message":"We look forward to your witty comments on this one. The possibilities are endless."},{"comment_id":"10153495840691051","commenter_b":"Then don't post it online and she should mind her own business.","commenter_a":"People should also mind their own business","post_message":"This woman says her child *isn't* too old to be breastfed. Decide for yourselves if that's true."},{"comment_id":"1159811677403083","commenter_b":"The white chic yells her ancestors owned their ass, and then yells black people don't belong in America. Huh. So when. Her ancestors bought the black people and SHIPPED them to America, the black people should go back to Africa? REALLY??! WOW. Unreal...smh... KKK at its finest!","commenter_a":"more a condemnation of them and their ancestors than the person they directed this filth at","post_message":"This is just wrong."},{"comment_id":"10153709575791378","commenter_b":"@username Good call momma!","commenter_a":"They need to ban children from beaches and parks, too many dirty diapers and clothes left behind by irresponsible parents.","post_message":"JUST IN: New Jersey lawmakers have approved a ban on smoking on public beaches and parks, sending the measure to Governor Chris Christie's desk. 6abc.com/@username"},{"comment_id":"1482924058407143","commenter_b":"lol you're a joke. Dude I'm older than you! But thanks for the compliment!","commenter_a":"Are you serious???? I'm black and this is sooooo ridiculous!!! It is NOT racist! I hate Neegan more than I hate this shirt....because I don't hate the shirt...at all...actually I might buy it! #TWD","post_message":"People are accusing this The Walking Dead T-shirt of being racist — is it? yhoo.it/2kMGla0"},{"comment_id":"521485418039751","commenter_b":"Caitlyn Jenner is a repudlicrat.","commenter_a":"Who wants a killer around them and yes HE killed someone","post_message":"'Transphobic'... Republican-hating... CONFUSION!!!"}]
