[{"comment_id":"560508577442430","commenter_b":"No, illegal immigrants might think it's OK, like they already do from FD up thinking.. Our economy isn't built to give, give, give to u and the illegals. So yeah, they should go back to mexico, duhhh.","commenter_a":"Ur working at a fn hotel of course there's no job security. Fn fools.. smh. Don't like ur current situation? Gtf off ur ass n change it stop waiting for someone else's hands out!! That's ppls problem now days, want everything handed to u without doing a fn thing to deserve it.","post_message":"\"How do I feel working for Trump? I'm an immigrant. It's a job...We don't have security.\""},{"comment_id":"904790836280638","commenter_b":"Absolutely","commenter_a":"Obama care","post_message":"What's fair is fair! Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153745927208635","commenter_b":"So did these heterosexuals just go about Christians with strong beliefs just to cause trouble? @webpagelink","commenter_a":"It is funny how LGBT people seem to go after christians with strong beliefs in this area just to cause trouble.","post_message":"Wyoming Supreme Court may dismiss Judge Ruth Neely for refusing to preform gay marriage due to her religious beliefs"},{"comment_id":"686707531519825","commenter_b":"Don't bother coming back here bitch ! if you do , they need to hang ya.","commenter_a":"Keep her.","post_message":"A woman who left home to join ISIS just got served up some karma. Good. Anyone supporting ISIS is a traitor to America. Click 'LIKE' if you agree!"},{"comment_id":"10155226667000579","commenter_b":"Then you better understand that and take help from the one aligned closest to you which includes conservatives of all races.","commenter_a":"White males are the least served segment in British education.","post_message":"British Prime Minister Theresa May: \"I am pleased that I am able to meet President Trump so early in his administration.That is a sign of the strength of the special relationship between the United Kingdom and the United States of America.\" Full video of Primer Minister's Questions here: @webpagelink"},{"comment_id":"1552138465081005","commenter_b":"How does she not get dissy","commenter_a":"Matthew Boyd","post_message":"This record-breaking teenage gymnast is showing the world her incredible tumbling talent."},{"comment_id":"975170995873379","commenter_b":"Boo you whore","commenter_a":"She's still a total train wreck? What change?","post_message":"This medicine changes the life of anyone that uses it."}]
