[{"comment_id":"891775107623863","commenter_b":"Michelle isn't a woman for women. Let someone rape one of her babies and watch out!! And of course Bill Clinton may try! I've worked with sex offender's like Bill all my life and they DONT change. They like white, black, Asian, and ALL the girlees. Even baby girls. Bill is a threat to our children. Hillary doesn't stand for the security of our babies... she hands them over to Bill to be F...!!","commenter_a":"two faced .... you heard what what she said when Obama ran for office","post_message":"Michelle Obama did not get emotional for Juanita Broaddrick. Michelle Obama did not get emotional for Kathleen Willey. Michelle Obama did not get emotional for Paula Jones. Michelle Obama did not get emotional for Connie Hamzy. Michelle Obama did not get emotional for Eileen Wellstone. Michelle Obama did not get emotional for Sandra Allen James. Michelle Obama did not get emotional for Christy Zercher. When will Michelle Obama get emotional about all of Clinton's alleged sexual assault and rape victims?"},{"comment_id":"10153638608000667","commenter_b":"That must be why one out of every three women will have one.","commenter_a":"Abortion needs to be under attack! The murder of innocent babies is atrocious. It has no place in a civilized society.","post_message":"\"Abortion is still under attack all over the place.\""},{"comment_id":"10153275718534726","commenter_b":"Sometimes really rebellious kids need a bad scare, and yes, they should be afraid of cops. It's societies way of dealing with bad people. It's the people that don't fear cops that I worry about.","commenter_a":"good","post_message":"@webpagelink"},{"comment_id":"10153864923562490","commenter_b":"Women do not belong on boats or in combat this is just common sense and has everything to do with sex...","commenter_a":"Being a navy veteran, I don't agree with this. They already had a court martial case where enlisted male sailors were tried for taking pictures of female officer submariners showering....","post_message":"First enlisted women report for duty to sub force in early 2016."},{"comment_id":"10153079527196051","commenter_b":"Darwin Award!","commenter_a":"The boy appears to be under the influence.....too bad.","post_message":"This girl thought it would be fun to take selfies while she and her boyfriend were driving. This is what they looked like before the crash. Now check them out after."},{"comment_id":"587779548050076","commenter_b":"NO NO NO NO NO !!! AND HELL NO! Keep them out and send all illegals back!!!!!","commenter_a":"Hell no","post_message":"I'm thinking ... uh ... duh. But then again, we have the SFB Liberals who see 'no wrong' in Sharia. Vote in our CLASH Poll and let the US know how u feel. @webpagelink"},{"comment_id":"828695877229020","commenter_b":"I would of kicked someone ass if that was my kids","commenter_a":"Jessica Bates daaammm","post_message":"The children were 4-6 years old."}]
