[{"comment_id":"760477217433112","commenter_b":"Why is this show still one who watches these whiny bitches anyway","commenter_a":"So tired of people who think they are celebrities and think they can use that to preach their stupid opinions. Just shut up.","post_message":"Joy Behar of 'The View' just said Donald Trump will bring “mental illness” to the White House."},{"comment_id":"1317807834918571","commenter_b":"Hillary Clintin is a nasty Woman, I like the sound of that truth.","commenter_a":"TRUMP = TRUTH","post_message":"WATCH LIVE: Donald J. Trump's campaign manager tells Bianna Golodryga about the \"rigged election\" claims."},{"comment_id":"779121095562429","commenter_b":"You are so clueless.","commenter_a":"Sadly, his supporters will never watch this video. They are in utter denial. All they care about is his promise to stop immigration of Muslims and Mexicans and to keep white privilege in place. There are a lot of bigots/racists out there.","post_message":"Donald J. Trump has said a lot of things. Mike Pence said he didn’t say those things. He did. Here’s proof."},{"comment_id":"10154254404659411","commenter_b":"ya protest naked on the streets like the old lady in Australia it is 100% success rate","commenter_a":"Excellent News! These EU Nazi fascists need to be confined to the dust bin of history, and this thieving scum Schulz, Junkyard and is cronies sent to the gulag for the remainder of their lives for ruining so many lives in pursuit of their s**t sack Utopian dream which extends no further then their own arse pocket of course. Now, on another note, anyone have any ideas on we can help this festering turd of an EUSSR to collapse any faster????","post_message":"'Implosion of the EU'"},{"comment_id":"10153622833731519","commenter_b":"She says what her market wants to hear. She, and all the ilk like her, are just media whores who spout filthy hate and get PAID big bucks for it.","commenter_a":"At least she didn't say that we need to keep the tradition of having only presidents on our currency.","post_message":"Greta Van Susteren nearly gave herself a rage stroke last night..."},{"comment_id":"10153313566903908","commenter_b":"Like the symbolism...but don't know about using it as a flag...we tend to fly flags when we want to differentiate our selfs from others...this differentiation leads to conflict and destruction...no flag","commenter_a":"I see that beautiful symbol as being interconnected and one. Almost reminds me of the flower of life or a lotus","post_message":"This could become the flag that is used to represent our planet as a whole when we travel to other worlds. It was designed to \"evoke the feeling of global community in people all over the world, reminding us that we all are connected and should take care of our home planet and each other.\" Sacred geometry, anyone?"},{"comment_id":"10157519592720206","commenter_b":"Lol You're aware this is in America. Not illegal here.","commenter_a":"It's actually illegal for major super markets to charge for a plastic bag because for example say tescos they can't charge you because your advitizing tescos through the bags also store laws are to provide bags for customers not well not sell them to us","post_message":"Get ready to pay 5 cents for a plastic bag."}]
