[{"comment_id":"10156697390890354","commenter_b":"I wouldnt be a cop there for any amount of money. I say, disband the police, send those trained officer where they are really needed...and let the animals rape, rob and kill each other. Liberalism worked so well in all the other major inner cities (Detroit - a decaying liberal sh*t hole, Philly, East St. Louis, etc...), let Berkley have a peek at reality.","commenter_a":"--- I recommend abolishing 'UC Irvine\"----much more accomplished----","post_message":"You're not going to believe what they say in their demands letter. As you read it, just remind yourself that these are tomorrow's college educated \"leaders.\""},{"comment_id":"10154992177868905","commenter_b":"It really is better to have a world view. Try it some time.","commenter_a":"BBC has really gone down the tubes! Stick with news from your own country and leave ours alone!","post_message":"Watch LIVE: Latest Trump news, talking deportation and anti-Semitism. Get your questions to us in the comments section..."},{"comment_id":"10153876447145329","commenter_b":"Attention whore.","commenter_a":"Laura This might help you understand some stuff","post_message":"Is ~everyone~ on Twitter fighting? (via BuzzFeed UK)"},{"comment_id":"1364548750229953","commenter_b":"Anything above .22 caliber is illegal expect where permitted by law, and by law I mean hunting clubs that bend the rules. Open carrying is restricted to law officials only. But yeah that sure stopped the cartels from getting their hands on em","commenter_a":"What about bad/psychotic people with gun permits and guns purchased legally? The system is a joke... How can you really determine good/bad ppl...","post_message":"The Dallas police chief says he is concerned about open carry laws. \"We don't know who the good guy is versus who the bad guy is if everybody starts shooting,\" he said."},{"comment_id":"1502468899813234","commenter_b":"You mean his other bitch. First bitch is Michelle. Lol","commenter_a":"If you listen you can here Louisiana's governor kissing Obama's ass cause he is afraid Obama will sic his bitch Killery on him and he will suddenly \"commit suicide\" or die in s plane crash,\\\\","post_message":"Oh, it's okay if OBAMA doesn't visit Louisiana when they're dealing with massive floods..."},{"comment_id":"591548094329175","commenter_b":"No, let her coach womens sports.","commenter_a":"Ridiculous. Why even keep score and give everyone a super bowl ring.","post_message":"Should females be installed as coaches on every NFL team?"},{"comment_id":"1299471993412429","commenter_b":"This lady on crack","commenter_a":"Trump won the debate fair n square from 5 minutes away!!! #TrumpTrain nailed it last night raising money for our Vets!!!! $6,000,000!!!!! I donated! Did you? #Trump2016","post_message":"Experts weigh in on #GOPdebate, including the noticeably absent Donald J. Trump."}]
