[{"comment_id":"10152661116841491","commenter_b":"Thugs are thugs, white or black. Stop acting like it is a racist term, people. These idiots belong in the exact same grouping as the ones in Ferguson and deserve to be treated the exact same way.","commenter_a":"Omar Shtayyeh","post_message":"Columbus Police Department spokeswoman Denise Alex-Bouzounis said that about 8,000 students forced their way into The Horseshoe stadium and tore down a goal post."},{"comment_id":"10153021829314712","commenter_b":"If you thought my tone was rude then you should not have replied to me with a lecturing tone. Because clearly you thought that was productive.","commenter_a":"Lauren it isn't dumb and you are rude... I am married 17 years to a bus riding bike riding no driving city worker here in Baltimore and he has made the same observations..riders... walkers..and especially drivers need to do a better job observing traffic laws...but your tone and answer is counter productive..have a safe day and as the Irish say.... Safe home","post_message":"Commentary: Car-centric systems cost lives, and diminish quality of life."},{"comment_id":"1044675162261267","commenter_b":"Now go build my wall","commenter_a":"*You're *Putting","post_message":"Right!? I sure hope so!"},{"comment_id":"1820431918212382","commenter_b":"Stupid whore","commenter_a":"Good !!!!","post_message":"My, my, my..."},{"comment_id":"10158110141675500","commenter_b":"Why do u say that? I totally disagree!","commenter_a":"Disney sucks","post_message":"DISNEY DISCOUNT! Sunshine State residents can save big on Disney park tickets. Details >> @webpagelink Disney Walt Disney World Epcot - Walt Disney World"},{"comment_id":"10156878121275551","commenter_b":"She will infest the White House with her crabs.","commenter_a":"No way, I would vote for a homeless veteran first.","post_message":"Patriot Update"},{"comment_id":"930466986973481","commenter_b":"I believe that the Goverment ( teachers ) should mind their own and stay out of our lives and work on being a better teacher ! It's up to the parent to decide when it is appropriate time to educate the child . Teaching a child inappropriate touching is about the limit that the school should be doing . Nothing else !","commenter_a":"Just be open and honest with your kids about sex. Answer questions, create an environment that allows for discussion and be open minded when they tell you what they think. It's not a bad subject. It's part of life.","post_message":"Would you call this educational plan \"age-inappropriate\"?"}]
