[{"comment_id":"1551402911832466","commenter_b":"You should check asians' homework","commenter_a":"I absolutely agree!! My husband and I found this to be a problem we felt,for our daughter. We were sending her to a private school until fifth grade,and we enrolled her in the public schools instead. I believe she had somewhat less homework in the public schools but it still seemed a lot. Children definitely need time to be children and to be able to play, make friends,and have free time.","post_message":"American school kids are drowning in homework compared to other countries. Like ATTN: on Facebook."},{"comment_id":"1707811955905494","commenter_b":"Sara are you looking in the mirror while you type???","commenter_a":"Yea its stressing me out my gosh what more does this man have to do before he actually gets in trouble??? OH AND THE FRUSTRATION THAT WE THE PEOPLE OF THE USA HAVE NO VOICE","post_message":"Two-thirds of Americans say that the future of the nation is a significant source of stress, according to a new poll."},{"comment_id":"950004335054969","commenter_b":"She loves him..get over it!","commenter_a":"I sure hope he makes a full recovery, not only for his kids and himself, so that gold digging piece of garbage he is still legally married to cannot get a dime of his money. It is disgusting how she is sitting at his bedside just waiting on him to die because everyone knows she does not give a crap about him. The Kardashians are a cancer that needs to be eradicated.","post_message":"#PrayForLamar Lamar Odom gives his family and friends a sign of hope after awaking from a coma. The gesture is sure to warm your heart. Meanwhile, Lisa Morales, the mother of his two children speaks out on Odom’s early improvements. FOR THE LATEST ----> @webpagelink"},{"comment_id":"1063405993707262","commenter_b":"@username by sitting this election out, you will be voting for Hillary!","commenter_a":"The Donald has his whole family there. Oh, and his favorite adviser - himself, his biggest fan - himself, his biggest fan - himself. Who else does he need? He's been saying all along that he will win without support. The truth is that, as much as I dislike these guys, they are basing this on principles. Laura, I used to have much more trust in you, but you've gone over too the dark side it seems. Trump is the worst candidate in my lifetime. And when you consider that includes Dole, McCain, Romney and the Bushes, that's saying a lot.","post_message":"Jeb Bush, John Kasich and company reveal they value their egos more than the GOP's success."},{"comment_id":"2081524555405540","commenter_b":"SHUT THE F UP! People like you are the Cause!","commenter_a":"You are a complete fool. America needs to bring God back into our nation. Then senseless killings and hatred would cease. All life matters.","post_message":"Here are Lena Dunham's TWEETS about \"White Americans\" in the wake of Alton Sterling's death..."},{"comment_id":"800309873404645","commenter_b":"16-years ago America watched as the Clintons packed their moving vans with about $200K of stolen furnishing and valuables from the White House and drove away, finally removing a large stench of corruption and sleaze from our nation's capital. We'd be insane to allow them back. TRUMP-2016 MAKE AMERICA GREAT AGAIN!!!","commenter_a":"Counter punch...she has a glass jaw. (email, poor sec of state, another Obama)","post_message":"Crooked Hillary Clinton is spending a fortune on ads against me. I am the one person she doesn't want to run against. Will be such fun!"},{"comment_id":"1322851284474589","commenter_b":"Or help take care of them in Forster Care?","commenter_a":"Not realistic, there are many people looking to adopt. The murdering of unborn children is not justifiable.","post_message":"Accurate."}]
