[{"comment_id":"10153728879938701","commenter_b":"Ugh, that's her opinion.....she is free to say it.","commenter_a":"President Obama please stay in DC.. We do not want to hear about your stupid gun control. You are NOT welcome in Oregon. You only care about One thing and that's you.","post_message":"JUST IN: President Obama will meet privately with the families of Umpqua Community College shooting victims on Friday."},{"comment_id":"10153900591048812","commenter_b":"You mean creation of George W Bush and Cheney.","commenter_a":"You go France! I wish our president was like yours. We need to destroy this creation of Obama. But firstly we must impeach our muslim-terrorist president!","post_message":"TARGET ISIS: French fighter jets take off on mission to strike ISIS targets in Syria; at least 20 bombs were dropped on ISIS’s de facto capital in Raqqa. @webpagelink Video: Defense.gouv"},{"comment_id":"1123813841007500","commenter_b":"Illegals, you don't like our choice for president please do us a favor and go back to yours!","commenter_a":"Trump brought half his votes!!!","post_message":"WATCH LIVE: President Obama awaits Donald Trump's arrival at the White House for transition meeting. Story: @webpagelink"},{"comment_id":"1815590955374804","commenter_b":"@username good luck when the immigrants trying take over your country good luck","commenter_a":"People who don't like DT should move to Canada like all the other celebrities. I forgot nobody is moving. LOL.","post_message":"It's Inauguration week and The Donald is hard at work at Trump Tower making final preparations. Who is meeting the president-elect today?"},{"comment_id":"1788246978118850","commenter_b":"She is garbage.....","commenter_a":"Your a f*cking idiot. Please leave the country. I'll buy your ticket.","post_message":"During a show in Tampa, Amy Schumer brought an audience member on stage and quizzed him about his decision to vote for Donald J. Trump."},{"comment_id":"10157992746740594","commenter_b":"@username if I'm going to make my mother get up in the middle of the night and travel four states to feed me she better be bringing more than a hot pocket.","commenter_a":"This is great, this is just what you liberal snowflakes need to cope with reality. It's nice that Google is providing portable \"safe-spaces\" for tomorrow's Captains of State Dependency.","post_message":"Turn photos of Donald Trump into adorable kittens with this Chrome extension."},{"comment_id":"1166520376798072","commenter_b":"Grow up you sick witch. Get a life of your own.","commenter_a":"Congratulations men. One psycho off the market.","post_message":"HAHAHAHAHAHA... HAHAHAHAHAHAHAAAA!!! @webpagelink"}]
