[{"comment_id":"10155095813944203","commenter_b":"KEEP IT UP DEMS!!!👍🗽🇺🇸","commenter_a":"There should also be a petition to all cable carriers to remove FOX from their channel line up as this network is a danger to America. Tell advertiser to boycott FOX.","post_message":" misled the Congress and he misled the American people."},{"comment_id":"10153834062371337","commenter_b":"You win the Internet today!!!","commenter_a":"Well, maybe when they introduce an HIV vaccine, she can get vaccinated.... Oh, wait...nevermind.","post_message":"Jenny McCarthy is not taking the Charlie Sheen news well..."},{"comment_id":"1353803527975767","commenter_b":"Lock there asses up!","commenter_a":"Lol look how racist worded the article. If it were a black victim and white captors u know this headline would of been completely different hahaha hypocritical libs","post_message":"Four teenagers tortured a person with disabilities and streamed the horrific attack on Facebook Live. WARNING: Graphic footage."},{"comment_id":"825373110931702","commenter_b":"It's ok. Can't hurt anybody. He's irrelevant. Just laugh at him and move on.","commenter_a":"And this is why Trump won. Republicans are always told they must apologize, even by other Republicans.","post_message":"He's baaaaaack... WATCH:"},{"comment_id":"10153572716786337","commenter_b":"Well he went to my homeland n cause a problem...we don't bother NOBODY but Americans always causing trouble for us....If he dont go to jail..Maybe a African curse will do the tricks...n if the table was turn y'all would want justice","commenter_a":"Uh, no shit he won't go to jail. He didn't break any laws in America what so ever. While I disagree with what he did, it was done in another country outside of our laws.","post_message":"#CecilTheLion is dead. Walter Palmer probably won't go to jail. Here's what we can do to prevent situations like this..."},{"comment_id":"1487334004660057","commenter_b":"I'm sure my mom bragged about me when I was a teen thinking I was an innocent angel. Guess what? Girls are better at hiding it. I saw the video and see nothing wrong with it, she was wearing shorts, she moved her hips. I'm not a Obama fan but the girl is an adult and she's on her way to Harvard. There's bigger issues in the world than the presidents daughter dancing at a concert.","commenter_a":"I love all you people saying this is what a kid does. WRONG!!! Raise them right and raise the to respect their bodies and they don't do this. My daughter didn't do this crap. She was in the Sea Cadets and didn't do anything that would get her kicked out. She wanted a career in the military once she finishes college.","post_message":"Ohhhh boy..."},{"comment_id":"10154165765599091","commenter_b":"#DrainTheSwamp #PayToPlay #RiggedElections #VoteFraud #NastyHillary #MAGA #CrookedHillary #NeverHillary #HillaryForPrison2016 #LockHerUp #BuildTheWall #BringBackJobs #LatinosForTrump #NoMoreClintons #BenghaziButcher #DefeatSocialism #BanIslam #EmailGate #CorruptMedia #ObamacareFail @webpagelink","commenter_a":"Congratulations and God bless!!!","post_message":"CONGRATS! Five female firefighters have graduated from the New York City Fire Department (FDNY) academy -- the most women to join New York's Bravest since 1982!"}]
