[{"comment_id":"337340083398778","commenter_b":"It’s the crazy lady","commenter_a":"Sounds like a republican did not see this coming from her good job","post_message":"If you can drive a military truck in combat, with hazardous cargo, at night, through a sandstorm, then you can drive a commercial truck on an interstate. If you can dock or anchor a 10,000 ton warship under extreme stress, you can do the same thing for a small commercial ship. We spend hundreds of millions to train our servicemembers to do highly skilled jobs, and they are the best at what they do. But too many still struggle to transition into civilian jobs because they don't have the right certifications and licenses – even when they’re being hired to do the exact same thing under much less taxing conditions. We've made progress on this issue over the last few years, and I don’t want to lower civilian standards – but I don’t believe for one second that these individuals aren’t ready to do the equivalent civilian jobs the day ..."},{"comment_id":"1764917753728484","commenter_b":"Not!!! When she decided to make \"her\" body a home to another human being it stopped being \"her\" body and it became \"their\" body. And as that other human being is incapable of making decisions for itself, that dumb cunt sucking poisons into \"their\" body should be jailed until the other human being is freed. Then the dumb cunt should be put in an air tight room and have the exhaust of a semi pumped into it.","commenter_a":"No,it's not her choice.Since it's obviously to late for an abortion,and she cant' control her substance abuse;she should be incarcerated until the birth of the child.The child should be then taken from her and given the best possible foster care. Hopefully the child is ok.In any case,she should be charged with child endangerment at the very least and remain incarcerated until she's no longer able to reproduce.They should also find the father of this child to find out if he is either complicit in this endangerment or is morally able to care for the child.","post_message":"What do you think? Join Us: The Free Thought Project"},{"comment_id":"10152829915341130","commenter_b":"What a doll she is!","commenter_a":"I hope you are successful. I love the breed, had one 33 years ago, she was perfect and sweet and love able....don't think she knew she was a Pit. We got her at 6 weeks. She was the runt of the litter and blond. So cute, so smart.....we loved her. Her life cut short, hit by a cAr...our fault, out in country did not think there was enough traffic to leash her for her morning job, one car amd she ran in front of it....I have never forgiven myself. But she had my heart at day one. Good luck with your training🐾🐾","post_message":"\"I don't want her bad behavior to speak for the breed -- rather, to behavioral issues born from neglectful and abusive homes. More than that, though, I don't want her to have any bad behavior. I want her to help fight The Great Pit Bull Bias.\""},{"comment_id":"10153221093818433","commenter_b":"Yeah, because the media doesn't owe Mitt Romney and his family an apology....","commenter_a":"Expose the liars. I am glad he did it!","post_message":"\"I had a mission,\" Pfeifer said. \"I am sick of reading bull- - - -. I am sick of lies. I am sick of people’s lives being destroyed.\" ow.ly/MnI5N from PunditFact"},{"comment_id":"10153780029707232","commenter_b":"And until the punishment is worse people will keep doing it! Idiots","commenter_a":"Wow! he only got tickets.. texting and talking while driving is just like ( being under the influence) he could of killed someone.","post_message":"A driver who was texting on his cellphone crashed into a Delaware home, causing major damage, according to police. STORY HERE: @webpagelink"},{"comment_id":"10153297238001051","commenter_b":"YES","commenter_a":"Yup!","post_message":"The man who murdered a Kentucky police officer on Sunday night has been fatally shot. Do you consider this justice served?"},{"comment_id":"10153153729864726","commenter_b":"your mother is white your white bunch of zebras in the white house","commenter_a":"what an ass","post_message":"WATCH: Michelle Obama's mom admits she is worried about mixing races and is glad Barack Obama isn't completely white!"}]
