[{"comment_id":"10152744570508822","commenter_b":"so hard to even win a buck!","commenter_a":"$1 straight Is 50. $1 box is 25","post_message":"The Pennsylvania Lottery is getting a makeover and adding a new game. Check out the changes here: @webpagelink"},{"comment_id":"1075404492512556","commenter_b":"WTF was with that woman?!? She's just sitting in there? She should have been out of there so fast and getting those kids out. He had to keep yelling to get her out???? What a Moron. And they just stand there Casually once out??? I might be kissing the kids out of Gratitude that they were alive and Thanking the Officer that saved them. There is something Seriously WRONG with these women.","commenter_a":"So are they the baby sitters? They sure shouldn't be parents!","post_message":"Dramatic footage shows two women and two children being rescued by California Highway Patrol officer after their car catches fire."},{"comment_id":"1761239377456582","commenter_b":"Why won't she just tell the story on camera instead of wasting all that paper? And why were they recording this in the bathroom? And why were two grown women laughing and taking pictures of her in the store? And why the hell didn't her mom beat the living hell out of them? So many damn questions. Wtf..","commenter_a":"People are getting DNA and hormones mixed up as if they are the same or even similar.","post_message":"Transgender teen shares powerful message on bullying: \"We're not a threat. We are just like any other kids. We only want people to accept and love us for who we are.\" @webpagelink"},{"comment_id":"10154660100050575","commenter_b":"Is she one of those nasty girls with nasty feet","commenter_a":"Funny how Americans don't like crooks","post_message":"Oh, my!!"},{"comment_id":"10153361923310796","commenter_b":"Google it or California DMV website. Wake up.","commenter_a":"With over 50% of new California Driver's Licenses issued to illegals will anyone challenge voter fraud in Mexifornia?","post_message":"Republican presidential front-runner Donald Trump blasted Mitt Romney in Maine on Thursday after the party’s 2012 nominee criticized him, saying Romney would have “dropped to his knees” for his endorsement four years ago."},{"comment_id":"10153439402362550","commenter_b":"How about instead of locking our doors, we teach thieves not to steal?","commenter_a":"How about instead of teaching our girls how not to get raped, we teach our boys to not rape?","post_message":"California high schools are the first in the nation to teach a new form of sex education instead of \"no means no,\" students will learn that \"yes means yes.\" Details here ---> @webpagelink"},{"comment_id":"10153741817406178","commenter_b":"Hillary is an unclassified POS !","commenter_a":"I think he is smoking crack.........","post_message":"Well I suppose all is forgiven now, isn't it?"}]
