[{"comment_id":"1261955857213973","commenter_b":"Sounds good....illegal alien it is.","commenter_a":"It's illegal alien. As in not from this country. An immigrant is one who has applied for entry into this country legally before they left their home port/border.","post_message":"USC Professor Warns Students, Don’t Use Term “Illegal Immigrant” On Final"},{"comment_id":"10154489000406336","commenter_b":"She shouldn't even be in this election she should be in prison.","commenter_a":"We all have to watch Hillary very closely as she will surely try to rig the general election like she had done during the primaries. What was recently exposed at the DNC she most definitely should be disqualified. Goes to show that the Clintons are corrupt, above the law and play by their own rules.","post_message":"\"I think what I'm offering are proven results. I think what I'm offering is that we can build on where we are.\" On \"Fox News Sunday,\" Hillary Clinton slammed Donald J. Trump, claiming that he has offered nothing to help people, while she has an agenda to increase jobs, increase incomes, and make the economy grow and be more fair. @webpagelink"},{"comment_id":"10154042620823717","commenter_b":"Go away and take your predator husband with you.","commenter_a":"UPDATE: Hillary Clinton has expressed regret for calling 'half' of Donald J. Trump supporters 'deplorables.' \"Last night I was 'grossly generalistic,' and that's never a good idea. I regret saying 'half' -- that was wrong.\" @webpagelink","post_message":"UPDATE: Hillary Clinton has expressed regret for calling 'half' of Trump supporters 'deplorables.' \"Last night I was 'grossly generalistic,' and that's never a good idea. I regret saying 'half' -- that was wrong.\" @webpagelink --- Donald J. Trump and Republicans quickly pounced on the remarks, which drew comparisons to President Obama's comments about clinging to \"guns and religion\" at a 2008 campaign fundraiser and Mitt Romney's \"47 percent\" remark in 2012. @webpagelink"},{"comment_id":"642366659287246","commenter_b":"Megan, you do a great job for Fox. They are lucky to have you.","commenter_a":"Fair and Balanced?!?!?","post_message":"Megyn Kelly may be getting kicked off the air... FOX needs our support, let's give it to them. Do you support FOX News?"},{"comment_id":"10154392654096509","commenter_b":"Hotel California!!!!","commenter_a":"my prayers ...rest in peace","post_message":"Glenn Frey played guitar and keyboard and took lead vocal duties for the Eagles on tunes like \"Take it Easy\" and \"Tequila Sunrise.\" What's your favorite song from the band?"},{"comment_id":"822097871159007","commenter_b":"Take it from a feminist, there is no wage gap. @webpagelink","commenter_a":"All wonderful.... now let's see if we can make \"being paid like a girl\" equivalent to being paid like a man!","post_message":"Maybe it's not a bad thing... (h/t United Humanists) Do you consider yourself a feminist? Let us know: @webpagelink"},{"comment_id":"1032254556867364","commenter_b":"I wonder if she was addicted to the same drugs smuggled across the Mexican border due to our insufficient border protection... #TRUMP16","commenter_a":"Oh Chelsea, what a story you have now, and a calling for the rest of your life... Nobody can tell the story you have to tell now!!! Hold on to that sobriety and to God, one day at a time... I love this... And love how well Hillary listens... #ImWithHer !!!!!! Sobriety means EVERYTHING!!!!! The best thing, of course, is to never even START drugs....","post_message":"\"I started doing drugs when I was 12 years old. At 15, I was doing anything I could really get my hands on.\" Substance abuse and drug addiction hurt our kids, friends, neighbors, and loved ones. We've got to solve this."}]
