[{"comment_id":"939497619530050","commenter_b":"She is a she!!!!!","commenter_a":"People can't see that this is a case of mental illness. I'm all for freedom of expression, but this is a cry for help.","post_message":"He calls it beautiful. You might call it disturbing. He removed his ears, tattooed the whites of his eyes, and did lots more in his transformation from Robert Hernandez to Tiamat, the Dragon Lady."},{"comment_id":"10153443453313145","commenter_b":"It's not the agents it's the folks who can't seem to follow simple instructions or get grumpy when asked to do what everyone else has to.","commenter_a":"I fly weekly and it is always slow. Putting the tourist with five kids in pre check just slows it down even more. Nothing at OIA is for the business traveler only the tourists. Wish I had a choice of airports","post_message":"A study of the speed with which TSA agents get passengers through security lines at Orlando International Airport shows that times aren't what airport officials want to see. So how have you're experiences at OIA been?"},{"comment_id":"10153852965454705","commenter_b":"She's a liability. Period. I wouldn't let someone like that work for me.","commenter_a":"She worked too hard to become a doctor to get fired, she should do community service and pay a fine and formally apologize to the Uber driver. We've all done/said stupid things while drunk.","post_message":"An internal investigation will determine any disciplinary action, including possible termination."},{"comment_id":"1663552577266891","commenter_b":"Yes--indeed. This woman's behavior is appalling.","commenter_a":"Trump supporter! Makes me sick!","post_message":"Attacked as they prayed? A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."},{"comment_id":"687088591481719","commenter_b":"She can pack up and go home and take her sharia law with her. And she can pay her own way, too!!","commenter_a":"Yes it doe's.","post_message":"Woman goes on TV and points the finger at Americans for this. She has some nerve. What a ridiculous statement. Does this infuriate you?"},{"comment_id":"10150815152779999","commenter_b":"Hahah Welcome to the team","commenter_a":"@username :P","post_message":"Hold the Door. Hold the Door. Hold the Door. Hold the Door. (Hold off on reading this recap until you've watched the most recent episode of \"Game of Thrones.\")"},{"comment_id":"10153202645506350","commenter_b":"This women should go talk to parents.","commenter_a":"Everyone saying \"she could have dealt with this privately, how embarrassing for the kid\". She never even mentioned his name... She is just addressing him along with all the other boys out there who do this. Something similar happened to me when I was in grade school and instead of having my back, all my friends labeled me as a bitch for not giving this guy a chance. He WAS harassing me but it was seen as \"cute\" because women are taught to appreciate male attention no matter the circumstances. We are taught it is the best thing that could ever happen to us. Just bear in mind that if a teenage daughter willingly comes to her mother for help, during a time when most teens seek distance from their parents, there is clearly a huge problem. This is video that can help a lot of other parents and teens ...","post_message":"This mom has a message for the boy repeatedly being rejected by her 14-year-old daughter: No means no."}]
