[{"comment_id":"10154382417947293","commenter_b":"Meanwhile Russia is laughing so hard all the way to the bank. Hope everyone who helped put this unstable Trump into this position will enjoy learning their new language of Russian cause now Russia owns us.","commenter_a":"Infighting violence much Washington post?????","post_message":"2016 might really be our own 1914."},{"comment_id":"10154462492528487","commenter_b":"Depends on your view. How much of the worlds' healthcare systems have you been a part of, witnessed or experienced. We are not perfect but we are so far from \"sucks\"","commenter_a":"The crap we have now sucks","post_message":"What would TrumpCare mean for Americans? Essentially, a public health disaster."},{"comment_id":"10154629508429099","commenter_b":"Poor woman, but yet another reason as to why the elderly need to be tested at every license renewal after a certain age","commenter_a":"Poor thing.","post_message":"An 83-year-old woman died after her friend drove over her while backing out of a parking space @webpagelink"},{"comment_id":"10153798525078352","commenter_b":"She needs to be punched in her mouth","commenter_a":"she's just horny.","post_message":"VIDEO OF RACIST WHITE LADY SCREAMING NI@@ER AT KIDS GOES VIRAL AND SHE SAID SHE'S NOT SORRY FOR IT! (VIDEO)"},{"comment_id":"906483276114592","commenter_b":"Oh shut up Jindal you backward cretin. The world's views have changed and long overdue. I am glad to see that people can choose to marry whomever they want. We all live on this planet and all should be able to marry who they choose.","commenter_a":"Separation of Church & State! What part of that doesn't this fundamentalist christian rube understand?","post_message":"“I hold the view that has been the consensus in our country for over two centuries: that marriage is between one man and one woman. \" -Gov. Bobby Jindal"},{"comment_id":"1003038786410224","commenter_b":"Boycott George Clooney!","commenter_a":"Doesn't he still support Clinton?","post_message":"George Clooney is right: the powerful influence of money in politics is obscene, and it is my belief that you cannot do away with big money in politics if your campaign is funded by big money."},{"comment_id":"961273403971266","commenter_b":"Very funny.","commenter_a":"It would be a GREAT pick....! Watching Liberals heads spin and POP will be fun..! Plus Newt would wipe the floor with Hill-Lie-ary and anyone she chooses for VP.","post_message":"Trump has been asking confidants for input on Gingrich as a potential pick."}]
