[{"comment_id":"1790206457902451","commenter_b":"Michele Obama said Hillary can't run her own house, how can she run the White House","commenter_a":"Bring the jobs back. Throw out the Chinese fakes","post_message":"WATCH: Hillary Clinton and Donald J. Trump go head to head in the final presidential debate, live from Las Vegas."},{"comment_id":"10153013739666336","commenter_b":"Those Iranians Wouldn't Be Dumb Enough To Fire Pop Shots At Our Ships!, That WOULD Be A GRAVE MISTAKE!,","commenter_a":"Haha good luck!!","post_message":"VIDEO: Iranian state TV showed footage of Iran’s Revolutionary Guard conducting a drill that struck a mock U.S. aircraft carrier with missiles. @webpagelink"},{"comment_id":"10153520610884705","commenter_b":"this is a joke , seriously , he would probably kill her. That would be sad.","commenter_a":"I like her she's a hell of a fighter but Mayweather would make mincemeat of her quite quickly","post_message":"Ronda Rousey says she'd beat Floyd Mayweather (and anyone else) in a no rules fight."},{"comment_id":"1929449190619936","commenter_b":"Trump will not get a record number of votes. No way. This is going to be the biggest landslide in modern American history.","commenter_a":"My prediction in this election is that Trump will get a record number of votes beating Hillary. But Hillary will get the electoral vote giving her the presidency. The electoral is there so the establishment gets final say. Sad but true. Isn't that right Bernie Sanders.","post_message":"Donald J. Trump says he would \"promise and pledge\" to accept the results of the election --- if he wins."},{"comment_id":"10154450699361323","commenter_b":"Umm... because she's a woman!","commenter_a":".On what grounds does such a person NOT rather enter in the MALE-items?....","post_message":"\"It is unquestionably a sensitive and complicated issue and one that has arisen many times at the Olympics and other sporting competitions where it has been alleged that male athletes have attempted to compete as women or, in Caster Semenya’s case, that a woman has an intersex condition, which provides an alleged unfair advantage.\""},{"comment_id":"10153929141081800","commenter_b":"he's one of the worst lol best...wtf","commenter_a":"Who cares how Obama grew up?!? He's the best president we've had, he's very intelligent, he's done an amazing job considering the racism and obstructionism from the republicans. Carson is mentally challenged and there's something seriously wrong with him. Stop focusing on color and start looking at ability and integrity. Obama towers over Carson in every way.","post_message":"Dr. Ben Carson accuses President Barack Obama of never living the black experience. ►Watch last night's full episode: @webpagelink"},{"comment_id":"1404580556268355","commenter_b":"Highly inappropriate for her to attack a child like that. Grow up, woman!","commenter_a":"What's wrong with feeding a dog some vanilla ice cream? I seriously don't get it","post_message":"Said he 'already looked like a f****** d*******'"}]
