[{"comment_id":"10156318897435354","commenter_b":"Guess what Ms. Wilde, past immigrants came to this country in a legal fashion. That's why we call people who enter otherwise illegals. What a house ape you are.","commenter_a":"Olivia you ignorant slut, you and your liberal harpy friends wouldn't like if those trespassers came over here with their broom handles. Then again Olivia, maybe you would","post_message":"Wrong. What's \"really sickening\" is seeing innocent Americans murdered and raped by criminal illegal aliens and having a president who cares NOTHING about the victims and their families. THAT is what's \"really sickening,\" Olivia Wilde."},{"comment_id":"10153245787992507","commenter_b":"I never liked that women .","commenter_a":"She is Just not a good person ......","post_message":"Ann Coulter brought knives to a gun fight on The View."},{"comment_id":"10153794749431336","commenter_b":"She's been dogging scandal since the 70's shady person and that's probably going to be our next president.. Not because she's the best for the job, because she's a woman","commenter_a":"Clinton, will never be president of the USA, NEVER...","post_message":"George E. Pataki on Hillary Clinton’s server scandal. #GOPDeabte @webpagelink"},{"comment_id":"10155353294040231","commenter_b":"Your mom is a monkey","commenter_a":"I'm going to leave this right here. #Unapologetic #BlackAgenda @webpagelink","post_message":"Yet another black person has become a hashtag after being killed by a police officer."},{"comment_id":"1176200455772763","commenter_b":"She know foreign policy like my pet cockroach!","commenter_a":"Trump likes to do things on the cheap ,with Carson, Palin and Bachman stupid doesn't cost much.","post_message":"This is the same woman who thinks the United Nations is going to institute a One World Government and that Barack Obama is the Antichrist."},{"comment_id":"10154262917016800","commenter_b":"I am the tool to build that damn wall!","commenter_a":"Trever, don't be an idiot.... I know your just a puppet... but cut the strings man...","post_message":"Donald Trump's campaign funding is running low while his personal spending is running very, very high."},{"comment_id":"753368658095076","commenter_b":"Some people should not be allowed to breed, let alone having these many kids. Birth control should have avoided all these tragedies. Imagine the mental damage done to the remaining children.","commenter_a":"\"F\" er...period.IF...this is true...","post_message":"She confronted the father of one of her kids in court."}]
