[{"comment_id":"1369450476431551","commenter_b":"take your Muslim BS and shove it !","commenter_a":"The current jews inhabiting Israel now are not the descendants of Prophets Jacob/Israel. . The true descendants of Prophet Israel moved to Egypt and they inhabit Egypt currently.. do not forge the history","post_message":"WHO SAYS THERE IS NO GOOD NEWS IN THE WORLD?"},{"comment_id":"977838925598355","commenter_b":"Yes!","commenter_a":"Yes","post_message":"What do you think? Ferguson? Baltimore? Black Lives Matter? We've never seen so much division!"},{"comment_id":"1438922076159420","commenter_b":"Chill your butthurt bitches lol","commenter_a":"Are you kidding me? You people need to get a life!!!","post_message":"Was it inappropriate?"},{"comment_id":"1563567157272928","commenter_b":"Stupid ass motherfucker","commenter_a":"way to go rosie, now evryone knows why trump treats you like he does. you usless POS. Done let the door hit you in the ass on the way out. if Canada doesnt want you, please dont come back","post_message":"Rosie O'Donnell just restarted an epic feud."},{"comment_id":"519047684966878","commenter_b":"I wanna know what is fallacious about my statement. If we can't afford social programs to help the people of this country, how the fuck are we gonna pay for a war? Not a Bernie fan, but you can't trash one candidate because \"We can't afford him\" when Trump wants to cut shitloads of taxes, and THEN try to finance a mass deportation, a war, and then a wall. Don't even get me started on how prices will shoot up on produce, as well as anything illegal immigrants touch.","commenter_a":"Honestly Bernie Sanders not winning would make me lose complete hope for the US. They are being presented with one of the most honest, genuine, good hearted humans possible, yet they prefer to give the likes of Donald Drumpf and Hillary Cliton their attention. Jesus help these poor people.","post_message":"Sanders doesn't think the delegate count matters right now."},{"comment_id":"1510580285648823","commenter_b":"She is amazing. Jill is a bad ass","commenter_a":"Margy White @username","post_message":"True confessions: What was I doing in Russia? Speaking out against Putin following the US into catastrophic war in the Middle East, and calling for a weapons embargo and #PeaceOffensive in the region. Check out the video of my full remarks: @webpagelink"},{"comment_id":"10153181309551350","commenter_b":"Sebrina Butler cute comments here. Marcella McFadden","commenter_a":"Breast feed, breast feed! Just do it! It's best for the baby's immune system.","post_message":"What do you wish you'd known before you had your baby? Read the top responses so far and join our new TODAY Parenting Team, sponsored by Johnson's Baby, to share your advice. @webpagelink"}]
