[{"comment_id":"10154376306546636","commenter_b":"She did? She'll never get out of prison.","commenter_a":"She got off easy for mowing down people terrorist style. Or maybe they got the idea from her idk","post_message":"A woman accused of a deadly crash that claimed four lives during a homecoming parade in Stillwater has accepted a plea deal."},{"comment_id":"10154221705040530","commenter_b":"What a dumb bitch!","commenter_a":"Black on Black crime really needs to stop. So sad this young lady endured such hatered and pain from peers of her own. Rest in peace. I'm praying the killers are soon arrested and face the fate of their punishment real soon, behind bars for the rest of there life and no parole it will serve them right","post_message":"Amy Inita Joyner-Francis, 16, died Thursday morning during a violent attack in the girls bathroom."},{"comment_id":"1201604966547026","commenter_b":"Mortified to be in the vicinity of a penis? Why? You wouldn't be mortified surrounded by vaginas. Why is one suddenly more shocking than another? There's probably at least one lesbian I a crowded changing room and there's a good chance that the transgender woman prefers men. I understand being on guard I do. But not why a bit of dangling body parts suddenly makes that person mortifying to be seen by.","commenter_a":"Ok, I'm sure I will be shot down for this. Firstly, I don't think anyone likes communal changing areas, certainly not anyone I've ever met. I don't think the general issue with this is because you are transgender, although that puts a different slant on it. I don't think many people are happy getting their wobbly bits (of whatever kind!) out in front of strangers in a changing room. I'm sure you've experienced a lot of challenges in terms of getting where you are today and feeling comfortable in your body. I'm sure you have faced threats of and maybe actual physical violence. What I think you may need to bear in mind is that you don't know the 'journeys' of the other changing room users. Maybe they have experienced sexual violence. Maybe they have massive hang-ups about their body for whatever reason. Or whatever. Maybe they are religious. Maybe ...","post_message":"Four things I do to survive the gym locker room because I'm trans. - Parker Molloy"},{"comment_id":"10153179541492014","commenter_b":"Who cares? She's giving a great Christmas! Good for her!!!!! People need to butt out and mind their own business!!!","commenter_a":"What's the problem? It's her money she works for her family.","post_message":"Sound Off: Is this a great Christmas or way too much?"},{"comment_id":"842682652588978","commenter_b":"She needs to be kicked out of our country, we don't need trash like her kind around.","commenter_a":"Here's another puke, wants everything America has to offer but can't be happy with that, maybe the next time she appears in public, the police should not lift a finger to give it any protection, then she'll probably get stomped under the crowd, and she deserves every foot that would trample her arse!","post_message":"It is people like her that perpetuate hate. Police are the people that keep her safe. Do you think Beyonce needs to learn some respect?"},{"comment_id":"10154352675806336","commenter_b":"Lets hope they nail her butt to the wall!!","commenter_a":"video of her saying she was shot at and then video that she was not shot still cannot convince these people she is a liar.","post_message":"Bret Baier: \"The State Department IG, though, wanted to talk to you and you didn’t want to do that.\" Hillary Clinton doubled down on claims that her personal email scandal will not hurt her presidential bid or result in an indictment. @webpagelink"},{"comment_id":"10152660515486813","commenter_b":"Maybe , but I am not a damn Liberal pussy.","commenter_a":"Too f'ng bad , play stupid games , win stupid prizes . Its not a resort.","post_message":"HORROR in Georgia Prisons. ACLU's David Fathi sheds light on how America needs to twist the lens and reflect on how we treat those within the criminal justice system. @webpagelink"}]
