[{"comment_id":"10154858585008797","commenter_b":"If they are here illegal. they are just deported . That's why I care if they are here illegal!! they'll just come back in to commit more crimes..","commenter_a":"How many are legal citizens","post_message":"GANG BUST: After nearly three years of undercover investigation, a total of 96 felony charges have been filed against 16 gang members."},{"comment_id":"888129164543273","commenter_b":"Now before you say.... \"white women do the same things on their shows!!!\"","commenter_a":"Total waste of an article, this list would have certainly dropped down to less than 10 had the writer just said the entire basketball wives franchise, love and hip hop franchise and real housewives etc. instead of going by each show and each city. Dumb","post_message":"‘Sorority Sisters’ Isn’t Alone… 10 Reality Shows That Were A Bad Look For Black Women"},{"comment_id":"10153732172855575","commenter_b":"Hes a disgrace to the people who voted for him,, a disgrace to the GOP..WISCONSIN you need to send the rhino back to where he come form..","commenter_a":"Paul RyAn is a traitor plan and simple","post_message":"Report: Conservative Veteran may take on Paul Ryan"},{"comment_id":"1002924903097372","commenter_b":"Sad part is there are a lot of people in denial and they will actually vote for this idiot woman","commenter_a":"All today has shown America is that @username will make an outstanding president and that the Republicans are vindictive liars. The Republicans have admitted to spending over 4.5 million dollars of taxpayers money to fund a \"witch hunt\" designed solely to discredit Secretary Clinton and take down her poll numbers. They have confessed to this.","post_message":"Hillary has been testifying at the House Select Committee on Benghazi for hours, and what have we learned? That she was a Secretary of State devoted to upholding our nation's values abroad, practicing smart foreign policy, and keeping our diplomats as safe as possible. Add your name to say you're with her: hrc.io/201PFma"},{"comment_id":"10153090141861680","commenter_b":"So what? Nothing should be said about mass shootings? Thugs and criminals are not mass shooters. There is crime everywhere. In every state and city. Our second amendment has been a shield for evil doers. Most criminals and thugs or gangs are trying to survive a life of under privilege and zero opportunities...jmo","commenter_a":"I live in the Atlanta area and every day, I say again, every day there are 3, 5 and some days more murders, carjackings, home invasions, bank robberies all committed by thugs, gangs and criminals. Yet, you don't hear one word, not one word of anger or control to get the guns out of the hands of these criminals. There are more murders in one week in the Atlanta area than the 10 souls that were lost in Oregon. If politicians really cared about every life, there would be more done to dismantle the gangs and thugs in our country. But instead all they care about is how they can take advantage and politicize a senseless crime to advance their agenda to take guns away from US citizens. They know that CRIMINALS DON\"T CARE ABOUT THEIR F'n LAWS!!!! So their true intentions must be to disarm the people.","post_message":"POLITICO takes a look back at some of his stronger words on the issue."},{"comment_id":"10153091462652507","commenter_b":"There she goes again, speaking truth to power. And for the poweless. You go, girl!","commenter_a":"Thank you Sen. Watrem","post_message":"Watch Senator Elizabeth Warren crush it on the Senate floor during the debate to defund Planned Parenthood: “Did you fall down, hit your head and think you woke up in the 1950s or the 1890s? Should we call for a doctor?”"},{"comment_id":"1085651791446290","commenter_b":"I say shut them down. There are many clinics for health reason, but NOT abortions! We need to STOP abortions (murder)!","commenter_a":"health screenings,fine..but why do our taxes have to pay for birthcontrol??Tell me again, I don't understand....","post_message":"Americans want funding for women's health."}]
