[{"comment_id":"10155010773818812","commenter_b":"Cynthia lol ur such an idiot","commenter_a":"Crazy! The country is not in mourning it's thrilled!!!😃😃😃","post_message":"The first post-election \"Saturday Night Live\" didn't open with a sketch spoofing the presidential candidates, nor did it include Alec Baldwin's Donald Trump. Instead, it opened on a somber note."},{"comment_id":"10153032074653145","commenter_b":"How date she!!","commenter_a":"'Stupid is as stupid does' Glad there's one less pea size brain off the streets. She and others with that type of violent ideas should be dealt with accordingly. Enough of thugs who think they can spread such animosity in a country with so many opportunities to do something positive, enough!!","post_message":" thought about shooting every white cop I see in the head..\" That's part of a Facebook post that got this mother arrested #WFTV"},{"comment_id":"1760085394239423","commenter_b":"Is there anything we can actually wear without people and animals being exploited ???","commenter_a":"LETS CONTINUE SPREADING THIS PLEASE!!! IS OUR RESPONSABILITY TO STOP IT!","post_message":"BREAKING VICTORY! UNITED COLORS OF BENETTON announced they will BAN ANGORA after just 24 HOURS into #PETA campaign: @webpagelink THIS is why you should care."},{"comment_id":"1271419419547512","commenter_b":"Lil bitch","commenter_a":"12 jurors acquitted these guys based on the lack of evidence. This had nothing to do with white privilege, they were locked up in solitary confinement while rioters get away with burning down towns.","post_message":"Heavily armed ranchers forcefully occupied a federal building in Oregon, but they got acquitted because white privilege is real."},{"comment_id":"10153531344506077","commenter_b":"Well said!","commenter_a":"Apparently some of the people on this thread see this move by the Colorado governor as a humanitarian move. Well when the carnage starts in Colorado, we will see just how humane the move was. Every citizen of this country that has a gun needs to lock and load because what happened in Paris is coming here! If you can't see the truth then you are just as blind and ignorant as our so called leaders! I hope you do not suffer in pain long when your ignorance comes back to bite you in the butt.","post_message":"JUST IN: Colorado will NOT join the growing number of states that are refusing to accept Syrian refugees following the Paris terrorist attacks."},{"comment_id":"954338344712964","commenter_b":"Idiot she has no place in the white house","commenter_a":"When her Secret Service Protectors lay down their guns, I will lay down mine.","post_message":"Hillary Clinton made the case for the United States to implement tougher restrictions on gun purchases following the terror attack in Orlando. @webpagelink"},{"comment_id":"1710140202573363","commenter_b":"I know it will be hard for Trump to send back all of the illegals, but he'll try his damdest. I hope he goes after the ones that are draining our system and leaves the ones that are hard working and honest people with good families not asking for handouts. Once we get rid of all the sponges in this country then we only have to deal with the riff raff , junkie americans that we already have to support!!","commenter_a":"Hallo everyone economy is getting worse because of Obama's and Bush's stupid policy so we need to make great world with Donald Trump.No to unlegal immigration no to Islam","post_message":"The economy is bad and getting worse-almost ZERO growth this quarter. Nobody can beat me on the economy (and jobs). MAKE AMERICA GREAT AGAIN"}]
