[{"comment_id":"952692328160353","commenter_b":"I actually do darling. No go back to sticking your head back into a special orafice... ;-)","commenter_a":"As he should. Obamacrap only works, if you don't. LEACHES.","post_message":"It wasn't a good day for Justice Scalia."},{"comment_id":"10153438388656336","commenter_b":"Adam you dysfunction perverted twist ! This is america and illegal alien will be deported soon or later ! With traitors !!!","commenter_a":"Just listen to the Donald😆","post_message":"ICE said the tragedy could have been prevented if they had been notified of the suspect's release."},{"comment_id":"1028860963867355","commenter_b":"The bitch needs to shut up all she knows how to do is ly","commenter_a":"Lying again","post_message":"Senator Elizabeth Warren went after Donald Trump, slamming him as a \"thin-skinned, racist bully\" and \"proven failure\" who is only \"qualified to be fraudster-in-chief.\" What do you think about her comments?"},{"comment_id":"10153647518861350","commenter_b":"This is 100% a mental illness! We would never approve of someone cutting their right hand off b/c they decided they had to be a lefty. So why in the world are we letting these people mutilate themselves?!! It's not about sex it's about the brain. They need help!","commenter_a":"The man with the sign in the background has the heart of the issue correct: girls' rights matter! No way would I want a confused young man using the same bathroom at school as my daughter. These young men and women need help. I have compassion for them because they are confused. Steer them towards counseling and mental health treatment. Caitlyn Jenner isn't a hero. I don't buy the \"if it saves one life\" act. The fact is the majority of suicides in transgenders occur AFTER they've made the devastating and disastrous choice to destroy their own bodies as God created them. They need treatment BEFORE they get to that point, not someone telling them they're fine as a woman when they were born a man or vice versa!","post_message":"\"I'm not the only transgender person at my school, and I won't be the last.\""},{"comment_id":"1166206863447175","commenter_b":"Agree","commenter_a":"when did she say that? when her mother was running against him for the nomination?...can't think she said it recently...","post_message":"Americas Freedom Fighters"},{"comment_id":"10153249437958701","commenter_b":"What about whores?","commenter_a":"Taking offers on souls in exchange for this perfect diamond. Virgins get first preference.","post_message":"It's a 100-carat diamond, considered by experts to be \"perfect,\" and it's going on sale. Watch the full story, later tonight."},{"comment_id":"724989260938156","commenter_b":"Honestly I wouldn't blame people for moving to canada if trump got presidency tonette kamakahi-gumapac","commenter_a":"Votefor Trump Happy Easter. Let's spend next Easter with Trump in the White House!","post_message":"Happy Easter to all, have a great day!"}]
