[{"comment_id":"422994894562852","commenter_b":"All but trump need to drop out and quit wasting money! Hell give it to the vets and homeless! Trump!!!!!!!!","commenter_a":"Mitt Romney will hurt Marco Rubio campain, please do let him","post_message":"Help or hurt?"},{"comment_id":"1705288253066676","commenter_b":"@username Building a wall is doable? Finding and deporting millions of illegals is doable? Banning Muslims is doable? Explain how","commenter_a":"So good looks qualify you to be VP of the USA? More reason to be afraid for our country. In addition to being racist and ignorant, this guy is shallow and beyond stupid (although we knew about the stupid part before)","post_message":"\"She’s got the beautiful looks,\" Eric Trump said. \"She's got — she’s smart. She's smart smart smart smart. ... She’s certainly got my vote.\""},{"comment_id":"1047100888663716","commenter_b":"She's an embarrassment to womanhood.","commenter_a":"This woman is always putting her foot in her mouth. She's right up there with Sara Palin.","post_message":"Watch her crash and burn."},{"comment_id":"369489863429570","commenter_b":"Ship her out ban her from AMERICA","commenter_a":"I agree she should be arrested","post_message":"President Trump says Madonna is 'disgusting' and a 'disgrace' to America because she said she wanted to blow up the White House. Agree or disagree?"},{"comment_id":"10153757247084753","commenter_b":"She needs to stay in prison!!!","commenter_a":"She has been in jail almost 50 years let her go to die a free woman for all you goodie 2 shoes some people deserve a second chance let he who is without sin cast the first stone","post_message":"In shocking news today, Charles Manson follower Leslie Van Houten could be getting out of prison after all this time. Us Magazine shared that Leslie has now been tentatively approved for parole effective today. She has actually been turned down 19 times in the past. Most people know her as the one who wrote the messages on the wall at the murder scene of married couple Leno and Rosemary LaBianca back in 1969. At this time, Leslie Van Houten has been recommended for parole. There is nothing... @webpagelink"},{"comment_id":"10153945249138690","commenter_b":"The Muslims massacring Christians citizens","commenter_a":"She is a Christian with big heart offering kindness and help to the Muslims so would Muslims do the same things to Christians ?","post_message":"When refugees arrive at the Greece-Macedonia border, the smiling face that greets them is that of Gabriela Andreevska. Watch more Al Jazeera Shorts - @webpagelink"},{"comment_id":"10153260713478690","commenter_b":"Scrw U, Scrw Saddam, and Scrw Isis... Saddam killed 300,000 innocent kurdish moslems most of them by mass graving and gassing them, u pathetic peace of scm.","commenter_a":"Sadam was much better than ISIS...","post_message":"The statement said that a lorry loaded with around 20 gas canisters exploded on a highway between the Iraqi city of Mosul and Syria, as Kurdish fighters were being deployed following an offensive against ISIL fighters. @webpagelink"}]
