[{"comment_id":"10153072205104614","commenter_b":"Let us hope this woman wasn't aware of the situation. Because otherwise they're both sick horrible people.","commenter_a":"I hope this pig gets sodomized repeatedly. ......human garbage.","post_message":"BREAKING: A 30-year-old man Newhall man has been charged with sexual assault and murder in the death of his 19-day-old infant daughter. Matthew Brendan Warner led investigators to the baby body less than 12 hours after the infant had been reported missing over the weekend. He was arrested on suspicion of murder. On Tuesday, prosecutors announced he had been charged with aggravated sexual assault, torture and other alleged crimes. Read KTLA's story here: @webpagelink"},{"comment_id":"1857171411229870","commenter_b":"Apparently Madonna thinks about blowing a lot.","commenter_a":"She should be arrested for making terroristic threats!","post_message":"Madonna said she \"will not back down.\""},{"comment_id":"10153467191368132","commenter_b":"She is definitely showing side boob. I wouldn't let my daughters wear that when they're old enough for prom","commenter_a":"I like the dress! Maybe we should teach our boys to control themselves instead of teach our girls they should feel ashamed of their bodies.","post_message":"What do you think of the open-back design?"},{"comment_id":"10152828817287426","commenter_b":"Omgosh..I am not a violent person..BUT I would beat the Sh** out of that woman....first of all...I NEVER gave into my kids when they threw fits...that's how they learn to NOT get what they want all the time.....This woman is sick sick sick....part of parenting means to not give in..","commenter_a":"@username U seen this uet","post_message":"“There’s nothing wrong with that child, it just needs to be beat,” the woman, who claims to be Kathleen Smith, said in the video."},{"comment_id":"10153369157063984","commenter_b":"Fire them all and make new hires sign a contract that if they are caught stealing anything they will pay back double the amount of the theft. The citizens work hard for their money and it is the taxes they pay that keeps those in Washington working.","commenter_a":"Hey, as long as they're paying for their gambling and \"adult entertainment\" out of their own pockets, well..... that's between them and God! But, if I'm paying for any part of it, then \"nail them to the wall\"!!!","post_message":"This has got to be a big embarrassment, and they probably thought they'd gotten away with it..."},{"comment_id":"1624969957723265","commenter_b":"That poor little girl. Her mother could have killed her driving around while heavily intoxicated. She clearly had time to buy and drink alcohol but not make sure there was food in the house???","commenter_a":"Don't have any sympathy for a mother that drives drunk with a child in the car. She could have killed her or someone you love. She should lose custody of the child.","post_message":"If you have blood flowing through your veins this video should make you furious! Watch it HERE: @webpagelink"},{"comment_id":"10152727190457452","commenter_b":"This is why women do NOT belong in an all male environment. You uptight B****s can't even take a joke.","commenter_a":"Is she going to use a flag or a kitchen rag?","post_message":"Meet Sarah Thomas, the first woman hired as an NFL official, according to reports. @webpagelink"}]
