[{"comment_id":"1022812631106658","commenter_b":"You fucking cooks make this world more dense and dumb","commenter_a":"The cures are out there stop suppressing them","post_message":"Real talk for a second: someone I love very much has recently been diagnosed with terminal cancer, and I find myself growing even angrier with the charlatans who promise miracle cures and insult the incredible doctors and scientists who are working so hard to help the people afflicted with this terrible disease. They prey on desperate and sick people to line their own pockets. \"There is no alternative medicine. There is only medicine that works and medicine that doesn't work.\" Richard Dawkins Image via the Food Hunk."},{"comment_id":"1119713804747813","commenter_b":"No-chin bitch.","commenter_a":"I'm changing my first name.","post_message":"Image from Go After the Bad Guys"},{"comment_id":"10152844711636167","commenter_b":"Some say brave, real people say KKKOCKSUCKINGWHORE","commenter_a":"What's \" brave\" about cutting seniors earned benefits??","post_message":"Except his plan would be \"terrible\" for the poor and middle class..."},{"comment_id":"10153833805055329","commenter_b":"@username Jordani SIM!!!","commenter_a":":') @username @username Sam Powers","post_message":"Right in the feels. Hayao Miyazaki"},{"comment_id":"10154173554642061","commenter_b":"We are all called on to help our fellow man","commenter_a":"Nice guy!!!","post_message":"School bus driver, who is a U.S. Army veteran, noticed one of his students was crying when he boarded the bus, so he bought 10 sets of gloves and hats for that boy and other kids in need. \"No one wants a kid to suffer like that.\" @webpagelink"},{"comment_id":"10152622903648067","commenter_b":"POLICE and MILITARY are made up of FALLIBLE HUMANS......some FALLIBLE humans do HIDEOUS things and then hide behind the BADGE!!! Those that do such things deserve to be OUTTED","commenter_a":"When they stop waging war against the Police and Military maybe I'll get behind the group... until then. They're a bunch of punks living in their moms basement, blaming everyone else for their problems.","post_message":"\"We, Anonymous around the world, have decided to declare war on you, the terrorists,\" the hackers said in a YouTube video. @webpagelink"},{"comment_id":"1012827362091069","commenter_b":"The ugly bitch is back. She hasn't been on for a while and I hoped she had disappeared.","commenter_a":"Lay down dog","post_message":"Ann Coulter and Fox News take another step closer to flat out saying they don't want \"THOSE\" people to vote."}]
