[{"comment_id":"10153839277481717","commenter_b":"Welcome to Trumps America","commenter_a":"That's horrible! My partner and I attended the fair...we felt safer and less vulnerable in SF than we do in many parts of Albuquerque.","post_message":"Five men attacked the friends with pepper spray for no apparent reason other than they are gay."},{"comment_id":"10154369386511545","commenter_b":"Imagine if someone came and ruined America and a civil war started. People killing and fighting everyone. Not everyone has the money to buy guns or the nads to pull a trigger. Hopefully that never happens but I am guessing people would try and leave, some in a hurry to wherever is better and closest....and hopefully don't get turned away at borders.","commenter_a":"Why, oh why, can't the pot stirrers understand the difference between LEGAL and ILLEGAL when it comes to immigration?!? The US was indeed made up of immigrants, and we love immigrants still, WHO COME HERE LEGALLY. And while I'm at it, why should we take in refugees WHEN WE HAVE NEEDY AND HOMELESS AMERICANS IN EVERY MAJOR CITY IN THE US? Let's give the CITIZENS all the benefits first. Why is that such a hard concept for some people? Seriously! Do you really think any other country in the world would put refugees AHEAD of its own citizens?!? No! Americans first, then help others. Just like in an airplane, put YOUR oxygen mask on first, then help the ones around you. Oy!","post_message":"The full commercial didn't appear on television during the big game after it was rejected by Fox. The full ad, which is nearly six minutes long, is available on the company's Twitter account."},{"comment_id":"949410461745800","commenter_b":"well said Bonnie","commenter_a":"I am from Middle East and full face cover has nothing to do with Islam, it is clearly oppression of woman. Disgusting. Those who say this is freedom of choice or religion should also be sympathetic to Nazi insignia or brutality","post_message":"What do you think?"},{"comment_id":"10158316177600725","commenter_b":"So who was the \"Grown-UP\" the past eight years? We have had the most un-American couple in the White House, so glad to see them go! (It's a shame they will still be in the country.)","commenter_a":"Definitely need a growth up and not a coward. Glad we finally will have one that fits both","post_message":"In one of her final interviews as first lady, Michelle Obama revealed just how much the election has reshaped her view of her husband's administration."},{"comment_id":"1201903546502686","commenter_b":"No way, he works at Wal Mart today. He made something of himself.","commenter_a":"Is she related to the banjo player in \"Deliverance\"???? Same eyes!","post_message":"It’s a shame, but I guess we shouldn’t be surprised by Hillary Clinton’s attempt to politicize another tragedy to advance an anti-gun agenda. As this analysis rightly points out, Oregon has some of the strictest gun laws on the books, and none of these proposed new laws would have stopped these awful shootings in the first place. We all want to stop these senseless tragedies, but using them to push unconstitutional, unrealistic, and ineffective new laws in order to win favor on the left isn’t going to help. I’m a gun owner myself, and I strongly value the rights guaranteed in the Second Amendment. The overwhelming majority of gun owners are law-abiding citizens who strictly follow all applicable state and local regulations. I will oppose any effort to take away the rights of law-abiding American citizens to own firearms."},{"comment_id":"10152704334291051","commenter_b":"Good! Take that piece of :poop: !","commenter_a":"GREAT JOB! (y) Hope the girlfriend is okay.","post_message":"A man walked in on his uncle trying to rape his girlfriend. This is what the uncle looked like after the nephew was done with him."},{"comment_id":"1059194827547028","commenter_b":"He is not even their president. Or that is what their signs say. Besides, they will not be part of the US for much longer.","commenter_a":"Richmond? Bwahahahah! Crime central.","post_message":"So this just happened..."}]
