[{"comment_id":"1196543867052750","commenter_b":"This bitch is hilarious, please keep validating all of the stereotypes of a trump supporters! Please wipe your mouth there is shit everywhere!","commenter_a":"Wow we got some really stupid people on here first let me say I'm pre-med graduated with honors I have served as an EMT and probably took care of you idiots in the o.r apparently your lobotomy didn't work we are smart people and educated people the dumb ones are the ones that think he's wasting his time trying to save assholes like you","post_message":"Someone shared a meme featuring an Adolf Hitler quote attributed to Donald Trump -- and his supporters ate it up!"},{"comment_id":"1911868089040262","commenter_b":"Who are they surveying because not all people thinks Asians aren't hot","commenter_a":"Kyan Khalil Khalili-Broojeni heyy","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"1583439795280427","commenter_b":"Disgusting, stupid woman.","commenter_a":"This woman and Palin and others like her are enemies of the state in my opinion! Shame on them for spewing their damage.","post_message":"WOW."},{"comment_id":"920944947962651","commenter_b":"soo then Michael is right , those other species of plants are no good , , chop em down & replace them with hemp.","commenter_a":"they need to fix this, and they can, if every person in China planted even just one tree, imagine :) Jude","post_message":"This documentary film went wildly viral with over 200 million views in it's first week online. Now Chinese officials are afraid that you'll see it too."},{"comment_id":"781508608584844","commenter_b":"Problem is giving amnesty to the ones here only perpetuates the problem. The next ones to jump the border will believe they will be given amnesty and so on and so on. Companies employing illegals need to be punished and no freebies, IE entitlements to non citizens.","commenter_a":"Do the house republicans have a plan to actually fix the problem? I know the tough talk is to \"just send them all back\" but those aren't plans. Sure wish yall had answers to problems instead of continuing this political theatre.","post_message":"Last night, a federal judge issued a preliminary injunction that effectively blocks President Obama's unilateral executive actions on immigration. The magnitude of the President's executive overreach on immigration cannot be ignored. The House passed legislation to stop the President's unlawful plan, but Senate Democrats will not even allow it to be debated. It is my sincere hope that Senate Democrats see this legal action as a wakeup call and let the House bill be considered in the Senate."},{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""},{"comment_id":"1325104020861488","commenter_b":"Both of those nut cases should be locked up and hit with $100,000 bail, third party and charged to the fullest extent. A little jail time should be mixed in with their punishment.","commenter_a":"Even as a woman I would have jumped in. But I'm a Country girl. I can whip ass like a Man. Especially when it comes to someone's life.","post_message":"A Florida police officer saw a car speeding over 100 miles per hour and stopped it on I-75 in Collier County, which the two men inside didn't seem to appreciate. After pulling a little trick before getting out, they began attacking the cop in the street to avoid arrest when they were met with an incredibly perfect dose of karma that they didn't see coming. @webpagelink"}]
