[{"comment_id":"1708500929417584","commenter_b":"My native American vote for Trump Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not stirring a race war. Trump did not leave any US soldiers in Benghazzi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion dollars. ...","commenter_a":"Trump is the worst person in the world.","post_message":"Unfortunately - when some people do not like what they hear, they have a tendency to smear the facts. As your next President of the United States of America - you will be proud of your leadership in Washington, D.C. - and know that our best interests will be for you, the AMERICAN PEOPLE. WE will be WORKING FOR YOU!"},{"comment_id":"905819366142682","commenter_b":"@username if u want to have sex, pay for your birth control. If u don't want to take the chance on getting pregnant, keep your legs together. We should not have to pay for your wants or needs.","commenter_a":"Blunt doesn't think women should have access to birth control and then blocks them from getting an abortion for an unwanted and unplanned for pregnancy.","post_message":"Every day, families in Missouri and nationwide provide loving and safe homes to children in need through adoption. I’m proud to serve as the co-chair of the bipartisan Congressional Coalition on Adoption, and I’ll continue my efforts to help children in need."},{"comment_id":"1020621978034054","commenter_b":"Queen of England? LOL... She's such a jokester, a desperate one.","commenter_a":"Why should anyone stand with him? No reason to","post_message":"Sarah Palin doesn't stand with Ahmed."},{"comment_id":"591215384344977","commenter_b":"Wash your mouth lady!","commenter_a":"Ummm it's not a white thing, it's a hygiene thing.....","post_message":"Imagine if a Republican had said this about Black people...... They'd be destroyed."},{"comment_id":"659128370944408","commenter_b":"Ban them all through the U.S.!","commenter_a":"Yes!","post_message":"A town in Michigan just voted to ban mosques, this was the result. Things are about to get very controversial. Would you like to ban Mosques in your town?"},{"comment_id":"10155808489605968","commenter_b":"Exactly.","commenter_a":"Of course they knew.","post_message":"KEY POINT: \"The current and former officials said that although they believed that Pence was misled about the contents of Flynn’s communications with the Russian ambassador, they couldn’t rule out that Flynn was acting with the knowledge of others in the transition.\""},{"comment_id":"1186888831331145","commenter_b":"Hold her in contempt and lock her up.","commenter_a":"What's next stone her.....","post_message":"Her act of resistance has rocked her small Appalachia community 60 miles east of Lexington and made headlines nationwide."}]
