[{"comment_id":"10153811495701316","commenter_b":"God's will & Grace","commenter_a":"Corrine Amin","post_message":"There's a time for everything."},{"comment_id":"10153101900003010","commenter_b":"WORTHLESS PIECE OF HUMAN FLESH...","commenter_a":"This world is coming to an end . I feel sick after reading this","post_message":"A 30-year-old Newhall man told sheriff's deputies his newborn daughter was missing. But investigators say he sexually abused, tortured and killed the 19-day-old child."},{"comment_id":"484296231775664","commenter_b":"Leave alone!","commenter_a":"Our flag is fine the way it is. If you don't like you may leave. Be careful the door doesn't hit you in the butt on your way out.","post_message":"Men and women have died defending our flag, don't mess with it. Do you think the flag should be left alone?"},{"comment_id":"977430998961803","commenter_b":"Europe just \"undid\" what the last Christian Crusades accomplished. All who refuse to convert to islam will soon be put to the sword.","commenter_a":"Europe is not the Europe we knew yesterday, history has been made today. Europe will not longer be Europe it is now a Muslim world. We just lost the wonderful world of Germany, France, Spain, England, Poland, Austria, etc. It's sad, the only one fighting for their country is Hungary and I give them a lot of credit, they don't want to lose their Christian faith. And America is next, we will be taking in thousands but the problem is we don't know if we are getting terrorist or good people. All I can say is God Bless us all,","post_message":"Why are the \"refugees\" mainly fighting age men? Where are the women, children and elderly?"},{"comment_id":"902649573193973","commenter_b":"And the nasty muslims rape goats","commenter_a":"There are police outside Catholic services in NYC right now. And Jewish services. But not allowed at mosques because it's insulting.","post_message":"“If you've got nothing going on [in mosques] but a beautiful religious service, why in His name would you not want to have police officers?” – Rudy Giuliani reacts to the #OrlandoShooting and Donald J. Trump's push for more surveillance"},{"comment_id":"589266911222085","commenter_b":"I'll say it to your face, tough guy...but we all know that a pussy like yourself will never deliver!","commenter_a":"A lady I worked with told me the closest thing to a lesbian experience she ever had was kissing, a liberal beta male on a dare!","post_message":"This is just the best!"},{"comment_id":"1082470525182532","commenter_b":"You tell them Horace. Spend that EBT somewhere else.","commenter_a":"Well Texas is off my vacation choice permanently.","post_message":"In Texas, adults with the proper permits no longer need to hide the handguns they carry in their shoulder or belt holsters."}]
