[{"comment_id":"10153374833224497","commenter_b":"I miss that trashy bitch.","commenter_a":"whatever happened to amber richardson?","post_message":"\"I had some great drugs in my day, but seeing my baby for the first time? I wouldn trade that for all the ecstasy in the world.\""},{"comment_id":"1701604063395144","commenter_b":"Ze pretty ladies","commenter_a":"@username William Joseph.. You boys come get me !","post_message":"So I'm on my way to Germany to get arrested."},{"comment_id":"998201713572910","commenter_b":"Don't stop there. Get the rest of the scum","commenter_a":"How sad....","post_message":"Islamic State's chief singer-songwriter has been killed in an airstrike in Syria"},{"comment_id":"10154312293629330","commenter_b":"She's a lying murderer","commenter_a":"God help us if he wins!","post_message":"Donald Trump has been officially nominated as the Republican candidate for president at the GOP convention in Cleveland ---> @webpagelink"},{"comment_id":"10153190415066037","commenter_b":"#TooBadBitch","commenter_a":"Please let him lose !","post_message":"BREAKING Israel Prime Minister Netanyahu and center-left opposition tied in election exit polls"},{"comment_id":"10150715134694999","commenter_b":"@username Illegal immigrants steal roughly 9 billion dollars worth of resources reserved for American citizens every year. Deporting them per our existing laws will save us a ton of money...any more brain busters?","commenter_a":"What's even more appalling is that he's polling at 39% of Republican + Republican-leaning registered voters in the latest CNN poll. ...What does this say about our country and how folks want our supposed leaders to behave? What is this acceptance of ongoing crass commentary? ...And what happened to equanimity and professionalism?","post_message":"Donald J. Trump called Hillary Clinton's mid-debate bathroom break \"disgusting.\" Frank Bruni says it's \"the rare man-child who finds that worthy of ridicule.\" Read on in The New York Times Opinion Section."},{"comment_id":"1080594048640963","commenter_b":"Yes, no one was eating as much sugar in the ancient world as we do today. You can't in your right mind insist there was no tooth decay until the 20th century based on a small sampling from a small area when this \"Mediterranean Diet\" was the norm the world over. Ask any archaeologist. This article is using bad logic for clickbait.","commenter_a":"of course there's no sugar in any of these fruits and figs and honey they were eating.","post_message":"Pompeii citizens never used toothbrushes or toothpaste."}]
