[{"comment_id":"690670874378549","commenter_b":"God I know! All those gay people marrying will turn back straight! Let's hope this works!","commenter_a":"It will take years to undo all the harm that is being done now. We have laws that we should respect and stand by.","post_message":"Even though the Supreme Court made clear in United States v. Windsor that the federal government should defer to state \"choices about who may be married,\" the Obama Administration has disregarded state marriage laws enacted by democratically-elected legislatures to uphold traditional marriage. I support traditional marriage and we should reject attempts by the Obama Administration to force same-sex marriage on all 50 states. The State Marriage Defense Act helps safeguard the ability of states to preserve traditional marriage for their citizens."},{"comment_id":"10153497244196051","commenter_b":"You are such a bitch. You need put to death just like you did your baby. You bitch","commenter_a":"Glad she didn't get off like Casey Anthony","post_message":"This woman didn't want her ex-boyfriend dating other women. Her 2-year-old daughter ended up paying the price."},{"comment_id":"1836282733258652","commenter_b":"cute dirty pig woman...can't call her a 'lady' tho. She's a good match for the Drumpf. oink oink.","commenter_a":"#DumpTrump #FuckKillary","post_message":"Make no mistake, Hillary will do whatever it takes to cover up Bill's transgressions.."},{"comment_id":"1172930249409099","commenter_b":"I get chastised for bad grammar but she gets a free pass for talking about wanting to Murder Men. Cough** cough** cognitive dissidents. Cough** cough**","commenter_a":"Yes, it is called bandwagoning. And the sad fact of it is that now we will never know how many of them were being honest and how many are lying for the limelight. Cases like this only cast doubt on instances of rape, unfortunately. If you are victimized, report it immediately. Don't wait.","post_message":"Awful."},{"comment_id":"10154000901360575","commenter_b":"Trump may not be as conservative as you or I, but neither is he a liberal, and anyone who tries to convince you that Trump is a liberal is a liar. A liberal would not want to build a wall. A liberal would not want to enforce our immigration laws. A liberal would not want to repeal Obamacare. A liberal would not want to bomb ISIS back to the stone age. A liberal would not want to bring back waterboarding “and worse” for terrorists. A liberal would not want to protect your right to own and carry a gun to protect yourself. A liberal would not want to defund tax-funded abortions. A liberal would not want to build up the military. A liberal would not want to take care of our vets. A liberal would not support our police. A liberal would not want to negotiate trade deals that give ...","commenter_a":"@username, you are so correct!! Trump has not said one intelligent thing during any of his speeches. Furthermore, his false accusations of calling Senator Cruz a lier is not working for him. Anyone who believes anything Donald says is delusional. Why has Trump not agreed to debate Senator Cruz!? Donald knows he is no match to Senator Cruz. Additionally, Donald lacks knowledge, experience and intelligence to speak about the most critical issues facing our country. You cannot be a Commander-in-Chief just because you are rich!! CEO's of large corporations are not hired to run a company because they are rich. Your resume matters!","post_message":"Cruz trashes New York in hopes of picking up votes in Pennsylvania."},{"comment_id":"10154941014182577","commenter_b":"Lies and fear. Lies about money and fear of foreigners. That's it.","commenter_a":"How was Nigel Farage's march?","post_message":""},{"comment_id":"10154615680566880","commenter_b":"Like auto manufacturers too?","commenter_a":"People who believe that Musk is a genius should support him by staying fully invested. Those who distrust a business reliant on government subsidies should bail. This will be an excellent test case in the economics of government investments. A future under Hillary promises heavy government investments in the Musks of the world.","post_message":"There could be a disaster coming."}]
