[{"comment_id":"10154123509664138","commenter_b":"@username is awesome","commenter_a":"Thank You Fox , great pictures.","post_message":"Our favorite photos of Minneapolis aglow in purple for Prince."},{"comment_id":"10156195156160615","commenter_b":"LMAO! Look at that old Mary!","commenter_a":"Being that he's gay, \"they\" should be \"we\"- \"I don't know why we need special protections.\" Also, \"special\" should be \"the same as\", since lgbts are just asking for the same as everyone else - \"I don't know why we need the same protections as everyone else.\" That's what he said, decoded.","post_message":"\"I don’t know why they feel they need special protections\""},{"comment_id":"1546700958971228","commenter_b":"Heaven forbid that us stupid stupid people should be allowed to have some one tell us the truth! Good Grief!","commenter_a":"But why","post_message":"BREAKING: You’ll Never Believe The Reason Greta Van Susteren Is Losing Her Job. This is terrible. We love her. Can we get 5,000 'LIKES' to Greta on the air?"},{"comment_id":"1496723690352634","commenter_b":"@username he must have grabbed you by the pussy.","commenter_a":"Same day, taken moments earlier before the rain actually stopped.... Trump holding the umbrella for her, meanwhile Obama has someone else holding it.... just saying maybe look into it before looking so biased","post_message":"See the difference?"},{"comment_id":"10153659318868797","commenter_b":"You did a great job by taking this dog to the Vet, as well as putting you life at risk from being hit by traffic. And having to pay the bill just for an irresponsible person","commenter_a":"At least someone cared","post_message":"MUST SEE: This puppy was hit while wandering through traffic. A woman stopped to help, and even took the dog to the vet. Then, she held him in her arms as he died. The woman blasted the dog's owner in an angry letter she posted online, and it has since gone viral. Wow, you're going to want to see this:"},{"comment_id":"10154434142778822","commenter_b":"The new laws in place are great for addicts but not so much for those experiencing post-op pain. Again, everyone is paying the price for addiction.","commenter_a":"There are legal opiate drugs and you don't get refills.","post_message":"Opioid addiction is an epidemic in our region and throughout the country. The numbers are preliminary, but deaths from drug overdoses have hit another all-time high in the region in 2016… and the crisis is showing no signs of slowing down."},{"comment_id":"1060970767293401","commenter_b":"Diana Serrano those hard headed girls just don't listen!!!","commenter_a":"Hahaha.... Acha hai acha hai","post_message":""}]
