[{"comment_id":"1131895816845262","commenter_b":"husbands fault not the woman","commenter_a":"Is this Hilary Clinton? Always the women's fault, cause the man didn't know he was married.","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."},{"comment_id":"10153736965291336","commenter_b":"She dosen't know what she's talking about .Shout up !!","commenter_a":"Think she's irrelevant at this point","post_message":"\"Every single Republican candidate for president is against marriage equality. Every one of them. Many of them are against anti-discrimination laws. Many are against same sex couples adopting.” – Hillary Clinton"},{"comment_id":"701531266646721","commenter_b":"CORRECTION : THEY'RE NOT FROM AFRICA, SO THEY'RE JUST PLAIN OLD AMERICANS ... DAMN IT!","commenter_a":"Oversensitive black couple. Correction oversensitive African-American black couple.","post_message":"Oh the humanity!!!"},{"comment_id":"10152924363976130","commenter_b":"I picture the admin of this page, a fat whiney crazy feminist that hates life because the wine ran out, and because a man opened a door for her.","commenter_a":"How many women believe everything that men tell them?","post_message":"\"Generally speaking, we (men) do not believe things when they're told to us by women.\""},{"comment_id":"639543372893417","commenter_b":"As I said the jobs are what this is all about. Yet we continue to give unlimited tax breaks to these major corporations to stay here. Just look at all the money LOANED to GM that has never wholly been repaid and never will. Major corporations are \"pimping\" themselves out so WE the middle class can continue to pay for all their tax breaks. When our American companies relocate outside of our country they should be heavily taxed for importing there product here. Since they're paying these third world workers nothing anyway for once let's get into their profits.","commenter_a":"Oh well thank you is in order for saving those jobs. Too bad we the middle class have to make up for that $7m tax break you just gave them. What should have been done is let them leave and import their products back here and tax the crap out of them. Since they are going to pay some Mexican $2 hour. ONLY IN AMERICA!","post_message":"Trump's Carrier deal shows corporations they can: ✅ Threaten to outsource jobs ✅ Actually outsource jobs ✅ Still get a tax cut"},{"comment_id":"1528186400555160","commenter_b":"Thank you!","commenter_a":"THE FREEDOM OF THE PRESS is more basic to the RIGHTS of Americans than; the right to bear arms to defend. When the constitution was written it took two conventions to come up with ten amendments, BUT the first amendment was the same not changed and was readily adopted as others were still being picked and discussed. THE BILL OF RIGHTS Amendment I Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the PRESS; or the right of the people peaceably to assemble, and to petition the government for a redress of grievances","post_message":"Sean Hannity wants to destroy freedom of the press by punishing any news outlet that told the ugly truth about Donald Trump."},{"comment_id":"1453852417965437","commenter_b":"Vile scum maggots.","commenter_a":"\"Did Huma have her genitals cut off?\",,,,More projection from Alex Jones?","post_message":""}]
