[{"comment_id":"522124781280810","commenter_b":"And a thug!!!","commenter_a":"He's a terrorist.","post_message":"Police say they \"don't have any information on this individual's mentality, or his ideas or ideology.\""},{"comment_id":"1196791103694693","commenter_b":"David, better vote for anyone on the GOP side than voting for the criminal Hillary \"Cankles\" Clinton. The woman should be in prison.","commenter_a":"DO NOT be complacent. Progressives need to come out in the MILLIONS and vote. Otherwise, the Republicans/teaparty, who sold out to crazies who actually want to take a dump on the Constitution and make America a \"Christian\" Theocracy, will win.","post_message":"Republicans are losing ground in key demographics."},{"comment_id":"10153043089801519","commenter_b":"Right? Because...ick.","commenter_a":"#dontbethatguy","post_message":"\"He then sent me five nude photos of him lying in bed, his penis prominently displayed...\""},{"comment_id":"10155295844155354","commenter_b":"And you should get absolutely NOTHING if you are here illegally.","commenter_a":"If you did not go through the proper legal channels to enter this country, you are illegal and your ass should be deported!","post_message":"NYC's New Illegal Alien ID Program Includes Free Membership to 33 Top NY Venues, Including the Metropolitan Museum of Art."},{"comment_id":"1870709889833499","commenter_b":"And what about those born with both genitals ?","commenter_a":"A person that has the female organ is female, and a person that has the male organ is a male, END OF THE CASE. Next please: ''The Kardashians Still Fighting Over a Pudding''","post_message":"Meet the cover girl who used to be a boy"},{"comment_id":"705952482887629","commenter_b":"#NeverKillary, #CriminalHillary, #Notwithher, #Trump, #MakeAmericagreatagain","commenter_a":"dont you wish people liked you like this????","post_message":"Donald Trump lied to the American people at least 58 times during the first presidential debate. (We counted.)"},{"comment_id":"1670051896580847","commenter_b":"Hell yes","commenter_a":"Definitly YES !","post_message":"OMG! Obama shortchanged the VA by 2 billion and gave away 4 billion to Muslim migrants! He hates our vets! FOLLOW US----> Freedom Daily"}]
