[{"comment_id":"601754246672035","commenter_b":"Yes I do the whites made her now she it very racist big time","commenter_a":"shut your mouth!","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"},{"comment_id":"10155024905873487","commenter_b":"Yes, but I am going out swinging. My representatives are getting letters, resistors are getting encouragement, all entreating those who swear to protect and defend the constitution are getting my support. I grew up when you did...and felt the same way. We are to be tested. Our Republic will need yo stand. So I will too. Join us!","commenter_a":"Good-bye halcyon days of growing up in the U.S. in the sixties and seventies. Worst shock of my life was 2008. I had always, unconditionally, believed that FDR's reforms were indissoluble, absolute, perfect. Now I don't trust anything; if there is money to be made, no perfidy is too great to be inflicted upon Joe Lunchbucket and me. It was a great experiment, but the protections against the avaricious that were put in place were not strong enough.","post_message":" don think Richard Nixon even comes to close to the level of corruption we already know about Trump."},{"comment_id":"1308235872529496","commenter_b":"Such a HORRIBLE breed!! !!","commenter_a":"I hate pit bulls ... If judge Judy doesn't like em.... It's good enough for me .... Example here!!","post_message":"Noah suffered injuries to his head and face and underwent emergency plastic surgery."},{"comment_id":"1318881848134860","commenter_b":"Suck it up Buttercup","commenter_a":"Good , If the press would stay neutral, as they should, and report only factual information, instead of just what creates more drama, then they'd get the respect they want.","post_message":"For a year and a half, the press smeared, attacked, and belittled Middle Americans supporting Trump. Now they want respect? Sorry, that's a two way street."},{"comment_id":"434449293346332","commenter_b":"Oh Cheryl chill out","commenter_a":"Anyone who thinks this is ok and there is at least one person here, (@username, seems to think so) is an idiot.","post_message":"When a student couldn't pay for her lunch, school officials decided to do this with the food instead."},{"comment_id":"1027684670588211","commenter_b":"Sadly it's true though. The American education system is poor and it's not the citizen's fault.","commenter_a":"Who did this survey? You just want to make fun of Americans and make others feel superior. By the way, your Grand Canyon photo is too dark, poorly done.","post_message":"Do you know where these major national landmarks are?@webpagelink"},{"comment_id":"1011521052257456","commenter_b":"SHOWA. I would say if you didn't think it could happen again, it's happening again.","commenter_a":"INVADERS don't assimilate!!!","post_message":"Unreal. Stupid public schools ... celebrating the subjugation of women."}]
