[{"comment_id":"10153274022815326","commenter_b":"The DNC are the ones calling in the second string. I do like VP Biden, and respect him, but it is obvious that the DNC establishment see Hillary as a loser now. Senator Sanders is the ONLY candidate who is fighting for ALL of WE are the 99%. The media and their Oligarch Masters are afraid of Bernie Sanders, which is why they have been ignoring him. Bernie is fighting for WE the 99% regardless of race, age, gender, sexual orientation or beliefs. He should be getting 99% of ALL votes including republicans, democrats and independents. Let's all vote for our own self interests for a CHANGE. FEEL THE BERN? Everyone had better or we are doomed.","commenter_a":"The Dem establishment can't be too pleased if Biden does decide to run. Could hurt Hillary by splitting the establishment vote.","post_message":"Vice President Joe Biden is still figuring out if it is in his heart to run for President again in 2016. Biden is a fighter for the middle class, Ed Schultz and Katrina vanden Heuvel discuss. Watch the entire show at: @webpagelink"},{"comment_id":"10153964560712885","commenter_b":"are you fucking dump lock that bitch UP!!!!!!!!","commenter_a":":( :( not cool","post_message":""},{"comment_id":"10154657445794575","commenter_b":"@username so what your saying is the other 55% or the majority are coming over the border illegally so we do need to build a wall right?","commenter_a":"Help AMERICA first. Like the veterans, homeless and elderly!!!","post_message":"Exodus Refugee Immigration plans to move 60 people from Syria and the Democratic Republic of the Congo to Bloomington next year, starting in March. \"These are the most thoroughly vetted people coming to the United States. We don’t do research into anybody else to this extent,\" said IU Associate Professor Elizabeth Dunn."},{"comment_id":"10153456483261051","commenter_b":"I suggest you keep your bitch ass on the internet @username. You don't want to handle it in person.","commenter_a":"Most of the commenters here are transphobic scum. I hope none of you end up with a transgender child.","post_message":"This man handled his child’s funeral arrangements. When her friends showed up and looked inside the casket, they couldn’t believe their eyes."},{"comment_id":"1747485088840690","commenter_b":"On god all these bitches do is tattoo they brows and date niggas who still rock dickies and cortez I live an hour away from Clovis","commenter_a":"Man pussy can't be that scarce in NM","post_message":"WTH: New Mexico mother and son face jail time for incest! #NewMexico #Incest"},{"comment_id":"10157217624240354","commenter_b":"Send them to the Vatican you have walls keep them there","commenter_a":"Christians are in more danger than Muslims, that is the truth.","post_message":"Still no word on when the Pope plans to tear down that evil Vatican Wall surrounding his fortress and let all the \"migrants\" come flooding in."},{"comment_id":"1841357016150669","commenter_b":"Coming out now? It sure is a convenient time. Why is she reading it?Another thing if Trump was sexually abusing her why did she stay ? Why didn't she leave when he first kissed her. She stayed and he kissed her again. He put his hand on her breast and she still stayed? Give me a break! This woman is big time lying. This never happened!","commenter_a":"So many people are so stupid and are going to vote for Hillary but when she cause a war and all your children are sent to war and dying don't complain.","post_message":"\"I stood up and he came to me and started kissing me open-mouthed as he was pulling me towards him. I walked away and I sat down in a chair.\" - A former contestant on \"The Apprentice\" describes alleged unwanted sexual advancements made by Donald J. Trump. More: @webpagelink"}]
