[{"comment_id":"1807404516198292","commenter_b":"STOP THIS CRAP!","commenter_a":"Bs","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"1280674628621991","commenter_b":"@username yes she's the best of a bad lot","commenter_a":"Dump the Trump he just isn't Presidential Material","post_message":"If you think that a President Trump would be checked by Congress and \"couldn't really do that much harm\" you're totally wrong."},{"comment_id":"1065259396852375","commenter_b":"Oh @username, you're so fucking stupid it's not even funny. I hope you can't reproduce.","commenter_a":"Have you recuperated from all the fun last week ? Glad everyone made it home with no problems. If you're planning to go to the DNC convention; here's the schedule. DNC convention Schedule Saturday, 27 August 2016 11:15 AM Free lunch, medical marijuana, and bus ride to the Convention. Forms distributed for Food Stamp enrollment. 2:30 PM Group Voter Registration for Undocumented Immigrants. 4:00 PM Opening Flag Burning Ceremony Sponsored by CNN 4:15 PM Address on \"Being the Real You\" Rachel Dolezal, former Head of the Seattle NAACP and Caitlyn Jenner 4:30 PM \"How to Bank $200 Million as a Public Servant and Claim to be Broke\" Hillary Clinton 4:45 PM \"How to have a successful career without ever having a job, and still avoid paying taxes!\" A Seminar Moderated by Al Sharpton and Jesse Jackson 5:00 PM Medals of Freedom presentation to Army deserter Bo Berghdal and the Baltimore ...","post_message":"Stand with Democratic leaders: tell the RNC to DISBAND Trey Gowdy's fraudulent Benghazi committee and have Republicans pay back taxpayers! PETITION: @webpagelink (hat tip to Occupy Democrats)"},{"comment_id":"503269356530311","commenter_b":"Yes they should keep it in there country. We do not want it here.","commenter_a":"Yeah right. I don't think so. This is BS","post_message":"Legislature passed in Florida that is forcing Shariah Law on local women. These women are in trouble. Let's put a stop to this now. Do you agree Shariah Law should be banned in America?"},{"comment_id":"10153507125536749","commenter_b":"So tell me how more gun laws are going to stop criminals and terrorist? or are going to do the only thing you do best Lie ,cheat and screw Americans! @webpagelink","commenter_a":"TURCIA = TU Rusia CIA","post_message":"The Clean Power Plan is part of American leadership on climate change."},{"comment_id":"10153270653234091","commenter_b":"It should of been called player interference he did not slide with intent to advance to 2nd his sole purpose was to take out the 2nd baseman and break up a double play you can call it dirty call it aggressive I believe the rule says you have to start your slide before you reach the base and that he did not do . With all the new rules to protect the catchers and collisions at the plate this is no different . I believe he should be suspended . Unless you want the benches to clear every time he comes up to hit","commenter_a":"Here are the rules! Evidently, the umps didn't get that memo!!!","post_message":"UNDER REVIEW: Major League Baseball executive Joe Torre will review last night's controversial slide by the Dodgers Chase Utley that broke the leg of Mets shortstop Ruben Tejada for possible disciplinary action. What are your thoughts about the play? Read more: @webpagelink"},{"comment_id":"947714872011958","commenter_b":"Thereeeesss Billl---","commenter_a":"This is just an endorsement for trump.. it has nothing to do with Cruz.. Why is it that everything to do with t rump is exaggerated , or just outright lies ? Every time he opens his mouth the stooges have to run around for three days explaining \"what he meant to say\"? he didn't mean women should be jailed for abortions, he meant they should be celebrated.. he didn't mean mexicans were rapists he was talking about \"the bad ones\".. he didn't mean single payer health care he meant government paid health care.. he didn't mean to call Carson a child molester he equivocated that he was LIKE a child molester.. He didn't mean to hire all those immigrants for his hotel, he meant to say Americans are lazy and won't take the low paying jobs.. He didn't mean to imply that his wife is just a \"piece of ...","post_message":"Ted Cruz is having a hard time with Latinos for one EPIC reason. When I heard it, I couldn't stop cheering! All aboard the Donald J. Trump train! Do you think Ted is finished?"}]
