[{"comment_id":"10154780331641072","commenter_b":"Nm wait for her to have this baby lmfao","commenter_a":"Exactly Kelly","post_message":"Giraffe Watch: Is today the day? April the giraffe at Animal Adventure Park is expecting a calf anytime. More: on.kgw.com/aprilgiraffe"},{"comment_id":"1601162620179200","commenter_b":"Idiot. Build a wall","commenter_a":"Go back to Europe white folks... This is are land","post_message":"We're at a \"wall\" of taco trucks -- a protest in front of Trump International Hotel in Las Vegas ahead of tonight's final presidential debate."},{"comment_id":"10154063115076509","commenter_b":"Wanker !","commenter_a":"Shut up trumponszi","post_message":"\"We have a problem in this country. It's called Muslims,\" a man said at a Donald J. Trump rally. Trump did not appear to correct the man when he alleged that President Barack Obama is Muslim and also not an American. @webpagelink"},{"comment_id":"842693252541388","commenter_b":"Go pound sand Joan","commenter_a":"WOO HOO!! #CRUZ4PRESIDENT!!","post_message":"Thank you Governor Mike Pence for your support! #ChooseCruz: votetedcruz.com/in"},{"comment_id":"10152874600638598","commenter_b":"The men in China are becoming desperate for wives and there is none to be had. Men are now kidnapping small girls to keep for wives.","commenter_a":"I don't see any of you adopting the millions of unwanted children from china. The thrown away ones because they were girls, or the second child. The unwanted and given up for adoption, living in an orphanage or on the streets ones.","post_message":"China Has No Plans to Suspend Its One-Child Policy Resulting in Forced and Sex-Selection Abortions"},{"comment_id":"630903010433611","commenter_b":"Get her out of the White House!!","commenter_a":"out of her mind !!!!!","post_message":"Michelle Obama is trying to close all American museums for this absurd reason. She is a racist. This is complete madness. Do you think Michelle Obama is out of her mind?"},{"comment_id":"1474175135944775","commenter_b":"Two idiots,","commenter_a":"Hard to do when she said she wrote the speech herself, how did we get to this guy being nominee, wow","post_message":"Did they do it on purpose?"}]
