[{"comment_id":"10152783958260667","commenter_b":"You need to wake up lady !","commenter_a":"They are not public property. They are her private emails. You are all so crazy about your rights but not anyone else's. They were on a private server that had more security than her work emails. You need to take a cold shower.","post_message":"Looks like those who want a look at Hillary Clinton's emails have a long wait ahead of them."},{"comment_id":"1550216494995180","commenter_b":"I think Parkinsons...she looks like hell in that picture. Go home Killary and be a grandma","commenter_a":"I don't get the whole thing of her making appearances looking like a crazy cat lady. She's either sick, gone off the deep end, or trying to pull something. I don't know which, but she really just needs to find something else to do. She can still have a full life, but this is over.","post_message":"“As a Democrat, I am frustrated and ashamed. Unlike Hillary Clinton, I realize that America’s history was built not just on its gallant winners but also on its noble losers.” — Bryan Dean Wright, former CIA ops officer and member of the Democratic Party"},{"comment_id":"1863343793909726","commenter_b":"I hate that woman wit a passion if whoopi was there she will shut her off","commenter_a":"Omarosa is phony as hell. She does not represent Black Americans at all!!! I wish WHOOPI was on set today she would've put her in her place ! Poor joy didn't push hard enough. I don't like Omarosa","post_message":"It wasn't pretty."},{"comment_id":"588380568016902","commenter_b":"NO, they just want to shove another \"change\" down our throats!!! I am so sick of this. We don't have the money to make such a change. If anything put her on something else but DO NOT MAKE CHANGES!!!!! Do you Dems think money grows on trees?? I am not paying for nor will I ever use a $20.00 again if this is done!!!","commenter_a":"So who made this decision?","post_message":"OH HAPPY DAY!"},{"comment_id":"10152694778793717","commenter_b":"Colebrook....-38","commenter_a":"Berlin -22","post_message":"We're looking for your best guesses for the coldest spot overnight tonight in New Hampshire. Comment below with your guess for the town and temperature, and Kevin Skarupa will reveal who was right Thursday morning!"},{"comment_id":"1777641695853675","commenter_b":"Shirley Awalt Tuggle Check this out mama!","commenter_a":"Sidni Schneider Amber Kerstin Brown","post_message":"She's every inch a queen. Victoria, starring Jenna Coleman, Rufus Sewell, and Tom Hughes, premieres January 15th on MASTERPIECE | PBS. Watch a preview:"},{"comment_id":"256034241501428","commenter_b":"Hahah aww","commenter_a":"@username it'll be belated but you'll get it lol","post_message":"Pretty much #ValentinesDay #WSHH"}]
