[{"comment_id":"10152595284751519","commenter_b":"If only the women on Fox News would start wearing tampons for earrings, maybe they'd be taken more seriously.","commenter_a":"How can any thinking woman vote republican? Stepford Wives comes to mind. How does the republican platform support women? Oh and Glen, ACA is winning. Read.","post_message":"We don't have to take Fox News' lies any longer. Here's how we fight back."},{"comment_id":"10154184073372093","commenter_b":"Are you kidding ? Mom said NO. Who knows what that WOMAN has exposed that baby too.","commenter_a":"Oh.. now shes just doing the most wonderful beautful natural thing that God as given women the best thing for a child...what's wrong with that ..bad mom for sayng no to someone wanting to be so generous and giving......","post_message":"The mom says the daycare worker asked if she could breastfeed her son. Disgusted, the mom said no. But as soon as she left the room, video shows the worker did it anyway... bit.ly/2kEuI1v"},{"comment_id":"10154770811534411","commenter_b":"come on now David, gotta bring the muslims into it. Bet your a fucking Tory, or one of those ukip nazis. Away and take your face for a shite","commenter_a":"@username being one of media that show Russia is not a problem in Syria after its jets bombs and kill thousands of women and children,Killing by bombing is still an act of terrorism and should not be favoured,just fool those who see one side of the coin and they dont want the truth to prevail","post_message":"'There is a hysteria which is being organised by politicians and the media against Russia to see Russia as the only problem in Syria'"},{"comment_id":"1797949110492327","commenter_b":"Shut up","commenter_a":"LYING HAG!!!!","post_message":"Hillary Clinton speaks during a voter registration event."},{"comment_id":"507506722754821","commenter_b":"Who cares what he thinks?","commenter_a":"Is Kanye West Racist,,, he sure acts like it. In one word \"DENIAL\"... And yes Kanye if it was a \"WHITE\" entertainer I would feel the same way. This whole race card is getting played out, BILL COSBY is a rich NARCISSISTIC PREDATOR. Color shouldn't give ANYONE a pass.","post_message":"With just three words, Kanye West succeeded at creating yet another Twitter storm."},{"comment_id":"10153725721616770","commenter_b":"Donald is getting rid of illegal immigrants That doesn't belong in America","commenter_a":"Judy white your are a Democratic like them ripping the people of America no jobs Don't you know that God got Donald trump's back Revelation 18 the fall of Babylon and all trades deals .if Hillery Clinton knew god maybe she would be president But she hates god . remember god is greater.any humans On earth no one can overcome what god Has planned can try .","post_message":"New pro-amnesty campaign manager for Donald J. Trump says \"deportation force\" now \"TBD\""},{"comment_id":"604077913107506","commenter_b":"Heather: have you been living under a rock, or have you just somehow managed to not notice Hillary trashing her husband's mistresses (or victims, depending on how you want to look at it)? You're right, sexism IS still at large in this country, yet you want to vote for a woman who openly bashes other women and stands by her cheating, lying, scandalous husband? I'm not saying I like Trump, but dear God woman, have some respect for yourself. If you really think Hillary is going to stand for your rights any more than Trump will, then you obviously need to do a little more research.","commenter_a":"And it is unfathomable that a man with such decency, courage and leadership, as exhibited by her husband, has so often been disparaged and attacked by the right while they embrace a fraudulent sexual predator.","post_message":"\"I can’t stop thinking about this — it has shaken me to my core,\" Michelle Obama said of lewd remarks by Donald J. Trump."}]
