[{"comment_id":"10152751952356130","commenter_b":"Stop sending people to Portland! #dontmovetoportland","commenter_a":"Esther Payne","post_message":"Is your city on the list?"},{"comment_id":"10153007409220950","commenter_b":"What difference does it make if the victimizer was an illegal immigrant? They're no more likely to be criminals than anyone else.","commenter_a":"How about if your family was a victim of an illegal immigrant?","post_message":"Would you forgive the suspected Charleston shooter if your family were among the victims? @webpagelink"},{"comment_id":"10154237826833010","commenter_b":"So no women has ever done the same thing right? Smh","commenter_a":"My son-in-law, a sheriff's deputy, once got a call about a baby in a car seat in a car in the parking lot of a \"gentlemen club\" translation - strip club!! The cops found the father inside getting a lap dance. He was supposed to be caring for his child while his wife, a doctor, worked the night shift at the hospital. What a father :( What a husband :(","post_message":"This week in North Hollywood."},{"comment_id":"1087981781280741","commenter_b":"This has nothing to do with \"political correctness\" and everything to do with the agenda of those who wish to bring this country to its knees. Offend Who? Immigrants - legal and illegal? Muslims? Persons like George Soros? These are schools being attacted; our children, our countries highest symbol.","commenter_a":"How can u even think of not flying our flag anywhere in this country. If u have no respect for our flag get the heck out of my USA.","post_message":"Old Glory just got banned from High School football games for the most despicable reason imaginable. What do you think about this and how should students and their parents react?"},{"comment_id":"10153125857102994","commenter_b":"Just wondering if she is 13 or 14? Or is there 2 different shootings..? Because some sites says a different age than the others.","commenter_a":"Its called ignorance people. Doesnt matter if your black, white, asian or blue, these families live a life that involves violence, or may have experienced violence, try to take precautions to keep family safe but are ignorant to what \"safe\" really means. DPD can only do so much, with stupid people. Another tragedy, that will soon be replaced by another, unfortunately, probably by tomorrow evening. Stop the violence and ignorance everyone, and help save our children, who are the future.","post_message":"Police say no adults were home at the time. We'll have more @10 p.m."},{"comment_id":"10153399368892964","commenter_b":"I'm sorry but I didn't see a post about the TPA for the last vote or this one coming up probably this next week to put it in...do you think there is a reason for that? Something this important? And nowhere else to post so I would guess that means he doesn't want to hear it. But it's his job, so yes he is going to hear about it whether he wants to or not!","commenter_a":"We need to keep OUR laws and get rid of these fake \"free trade\" treaties that make us beholden to an unelected foreign tribunal that frowns on anything that allows us to favor buying American, calls it unfair and forces us to change our laws or pay through the nose for the privilege of keeping them. You need to STOP this subversive attempt to undermine our Constitution NOW and vote NO on the TPA Revote...this does not need to go to an up or down vote! @webpagelink","post_message":"I successfully added a measure protecting jobs at the Lighthouse for the Blind to the National Defense bill."},{"comment_id":"10153238274816107","commenter_b":"Counseled women*","commenter_a":"Thank you Rand! The only one who stands for the people!","post_message":"Thanks to your continued pressure, this morning I'm pleased to announce that I've secured a commitment to have a vote on my bill to defund Planned Parenthood before the August recess! I pushed hard all weekend long to vote on defunding Planned Parenthood. My campaign sent out millions of emails mobilizing patriots like you to join this critical fight. It worked. I believe right now you are seeing the impact one man who's willing to stand for something can make in Washington, D.C. with the backing of millions of good folks like you. But now our job gets even tougher. Please call your U.S. Senators at (202) 224-3121 and insist they \"Stand with Rand\" and vote for my bill to defund Planned Parenthood. And please let me know you've got my back by adding your name as a Citizen Co-Sponsor: @webpagelink"}]
