[{"comment_id":"10152798547942452","commenter_b":"Upon last survey, they only found ~three smelt in the delta! All the smelt live in temperature controlled tanks at UC Davis... to the tune of about $2.5 million tax payer dollars per year. THE SMELT ARE GONE, no matter what they do in the delta. If it weren't the smelt, another fish or animal would be chosen to take its place. We're suckers... hook, line, and sinker! Israel had severe water shortages too... they are now able to be a water exporter. They built reclamation, desalinization, and now have more than they need. California is building an f'ing bullet train to nowhere! But, what if a smelt got pulled into the desalinization plant intake?","commenter_a":"Maybe if our state government quit selling our water rights to Evian arrowhead dasani etc we wouldn't have this problem","post_message":"BREAKING NEWS: California water regulators adopted sweeping, unprecedented restrictions Tuesday on how people, governments and businesses can use water amid the state's ongoing drought. abc7.la/1QkO1GA"},{"comment_id":"10153347711966680","commenter_b":"And from your own site @webpagelink","commenter_a":"No one has ever really cared what David Duke says so people don't need to flare up over his nonsense.","post_message":"Former KKK grand wizard David Duke on Donald J. Trump: “He’s meant a lot for the human rights of European Americans.”"},{"comment_id":"994006457321423","commenter_b":"She should be drinking it!!","commenter_a":"What are the long term effects on the citizens of Flint Michigan.... Thanks Cher for showing your humanity","post_message":"Cher is doing her part to help out the people of Flint as they continue to deal with city’s water crisis. More than 180,000 bottles of water are being shipped to Flint courtesy of Cher and water company Icelandic Glacial, which pledged to double her donation. DETAILS ----> @webpagelink"},{"comment_id":"10153620531441157","commenter_b":"Their just upset because she's not Hispanic!","commenter_a":"terriorist at its finest","post_message":"Islamic State claimed responsibility."},{"comment_id":"10153540508969087","commenter_b":"@username BY THE WAY BITCH, YOU ARE THE LOSER!","commenter_a":"HOW ABOUT WHEN YOU CHEATED ON YOUR FIRST WIFE WITH MARLA MAPLES AND GOT HER PREGNANT, DUMPED YOUR EIFE, MARRIED MARLA, THEN DUMPED HER TOO!!","post_message":"\"I have a very good marriage now. Melania's fantastic,\" Donald J. Trump told Anderson Cooper at the CNN town hall in South Carolina. \"But I had two women that I never blamed because I worked so hard that my job came first. Maybe I work too hard. I was a better father than I was a husband. But I worked very, very hard and I love doing it.\""},{"comment_id":"832375306811018","commenter_b":"Fire her, is this what she is teaching kids? She need to teach the prisoners not the kids!","commenter_a":"What an idiot teacher, she should be suspended and never get anymore money !!","post_message":"An elementary school teacher has been suspended for having her 3rd-grade students write \"get well\" letters to an inmate convicted of killing a police officer. What would you do if your child was in that classroom?"},{"comment_id":"10153513064987629","commenter_b":"Put your damn sticker and tongue away woman.","commenter_a":"Wait! Wait! WAIT A GOD DAMN MINUTE HERE! So cops can be wrong or even worse racist liars? Our judicial system can fail at the expense of innocent citizens? I need to take a seat. Bear with me for a second...","post_message":"\"They’re so wrapped up in a different culture than—what I’m trying to say is, the right culture, the better one to pick from.\""}]
