[{"comment_id":"1397527680309345","commenter_b":"Give Facebook some competition techies.","commenter_a":"YOU BETTER LOOK AT THE FACTS ,TRUMP ALLOWS IMMAGRANTS IN ,BUT IT HAS TO BE LEGALLY ,WHATS WRONG WITH THAT ,AMERICAS SAFETY FIRST","post_message":"PISSED Off Facebook CEO Sends Giant YOU To Trump Didn Expect THIS To Happen Moments Later!"},{"comment_id":"10156001387100354","commenter_b":"I would prefer you be hung, Stabbed, set on fire, tar and feathered, AND THEN DECAPITATED. SAD THING, Americans NEVER GETTING WHAT THEY WANT OR NEED!","commenter_a":"How do so many of these guys have zero brains when it comes to breaking the law. They are truly brain dead about this!","post_message":"How, again, did this guy break into the top 10?"},{"comment_id":"958480264190210","commenter_b":"From this little shrimp? He couldn't lick his lips!","commenter_a":"The high-water-mark of this idiot's journalistic career was his appearance on \"My Name Is Earl.\"","post_message":"It is amazing that Fox keeps Geraldo around. He does this childish stuff all the time."},{"comment_id":"10153225018458352","commenter_b":"Shut yo strong African ass up","commenter_a":"Stevie Ray Dirt this going to be me if you don't hurry tf up ! lmfao jk","post_message":"Strong Black Woman Marries HERSELF Cause She Couldn’t Find A Husband (True Story)"},{"comment_id":"950601424986485","commenter_b":"It is none of your concern if a person has an abortion, mind your own business!","commenter_a":"if a woman is too careless/stupid to not have 'protected' sex, then she gives up her right to murder an innocent child! BE A RESPONSIBLE PERSON not a murderer!!!!","post_message":"An excellent idea!"},{"comment_id":"10153112350927908","commenter_b":"That is no good, that is not acceptable.","commenter_a":"I'm afraid Netanyahu's alternative, as well as that of many Republicans, is to bomb Iran's possible weapons sites--not the solution I'm hoping for!!","post_message":""},{"comment_id":"10157682940820389","commenter_b":"Such bullcrap that she can get away with this!!!","commenter_a":"OF COURSE THEY DID....TWO OF AMERICA'S BIGGEST MISTAKES... WAKE UP AMERICA...VOTE DONALD TRUMP .....","post_message":""}]
