[{"comment_id":"10154512976631943","commenter_b":"YES!!!!..... LOCK HER UP!!!...LOCK HER UP!!!!...HILLARY FOR PRISON NOW!!!!...IT MUST BE PROVEN TO ALL THAT NO ONE IS ABOVE THE LAW IN OUR AMERICA!!!....HILLARY'S CORRUPTION WILL NEVER STOP TILL SHE IS BEHIND BARS!!!!!.........TRUMP IS THE PRESIDENT AMERICA DESERVES!!!....GOD BLESS OUR NEW PRESIDENT!!!!.","commenter_a":"Mr. Trump we can't let her go Free!! She's trying to destroy you every chance she gets.. Let Gowdy loose on her","post_message":"Share if you agree!"},{"comment_id":"10152878720003645","commenter_b":"Great american baboons","commenter_a":"There is something inherently wrong in the black community to promote this type of group violence. But then will cry racism at a drop of a hat...it is these very images that create the negative image of blacks. We are our own worst enemies not the \"white man\"...","post_message":" tenacity of placing something on video to shoot a young lady being beat down by six or seven young women is ludicrous in our community."},{"comment_id":"1021280037910232","commenter_b":"Maybe Russia will take care of the roaches for us.","commenter_a":"Sad","post_message":"This is just sad. I never thought an American president would be seen as weaker than the Russian leader."},{"comment_id":"1003938939663251","commenter_b":"we didnt send anyone, go kill yor bankers they fuck up your country, wait they already fucked up i guess","commenter_a":"Next wedding come over to Greece you son of bitches to feed all the illegal migrants that you send us!!!!!!!","post_message":"This is such a great story!"},{"comment_id":"1832531477017547","commenter_b":"Calm down, people didn't realise the date wasn't in American standard form. And we didn't feel it, or at least no one I know felt it. Innocent enough mistake, I don't think anyone deserves to be called an idiot for it","commenter_a":"For all of you idiots saying nothing happened today.","post_message":""},{"comment_id":"10154083249768984","commenter_b":"you bitch you took away something that is all American and turned it into a race baiter bunch of bullshit you and jazeeee suck please move","commenter_a":"behind the sheriffs all the way! DISGUSTING, RACIST, C!","post_message":"When these sheriffs saw what Beyonce was doing in front of the biggest TV audience of the year, they knew there was only one thing they could do... Do you support these sheriffs?"},{"comment_id":"10153784576082439","commenter_b":"Yes nazi ideology wasn't rooted in Christianity , any person watching the military channel knows that, they were obsessed with the occult . I believe Islam , and I'm not alone is the new nazi. Same crap Nazis spewed, we are peaceful, trust us . But worse , almost all western leaders except Putin and couple Baltic states are not buying it . You'll see, next world war will be because of Islam","commenter_a":"We are doomed. I'm hoping I get cancer and die before Muslims raise the Isis flag at the Whitehouse, I'm a vet and will for go my veteran cemetery burial as Muslims will dig us all up, toss us aside and build mosques on these honored hallowed grounds!","post_message":"Anywhere American mores and law conflict with Islamic law and supremacism, it's American mores that must give way. Ripping out pews? It's sacrilege."}]
