[{"comment_id":"10157769548850725","commenter_b":"Go kick her butt.","commenter_a":"you go donald !","post_message":""},{"comment_id":"541360652655195","commenter_b":"Muslims are buggering parasites that get alone with no one","commenter_a":"NO ONE FORCED THE MUSLIMS TO LOOK. THAT WAS THEIR MISTAKE. KEEP YOUR NOSE OUT OF OTHER POEPOLES BUSINESS.","post_message":"A pastor posted this controversial sign outside his church and it caused a huge stir in the community. His response to his critics was very simple."},{"comment_id":"10154242791701636","commenter_b":"No, she should've registered as a job-seeker in Denmark and get the about 800 per month she has the rights to get as an EU citizen","commenter_a":"Begging is unlawful but how about poverty ? Should she just let herself die ? How crazy is that...this is a sick world we live in","post_message":"For the first time ever"},{"comment_id":"615120388649797","commenter_b":"I don't think it should be considered treason, I think it IS treason. How do you Snopes check this? And where is the link to the Washington Post article?","commenter_a":"Guys we have no choice. They are so advanced we have no choice","post_message":"This should be considered treason."},{"comment_id":"1114475591908563","commenter_b":"Scum","commenter_a":"Two interviews; one discussing the present, when he declares no share ownership etc, etc, and a second interview, which was today, discussing the past when he did own some. Two very different things. Perhaps it's wise to point that out, instead of skewing the facts to confuse your poor readers....","post_message":"BREAKING #MicBrights"},{"comment_id":"10153982345631162","commenter_b":"Lol at the lady that thinks Chicago is Houston!","commenter_a":"Well the store has a history of getting robbed at gun point. Also note, armed robbers have been killed in the past trying to rob this store. Its best not to try to stick this place up anymore. Matter of fact, why not obey the law and not stick up any stores.","post_message":"EMPLOYEE SHOOTS SUSPECTS: Two men were killed after police say they attempted to rob a liquor store when an employee opened fire at them - Diane Pathieu ABC7 is live with more: @webpagelink"},{"comment_id":"1416682211693618","commenter_b":"Ya we we'll come u 2 da seat Hillary","commenter_a":"She is a wonderful woman, read this to get the proof @webpagelink","post_message":"A reminder heading into tonight's debate."}]
