[{"comment_id":"1013838895312830","commenter_b":"That's what girls get, cause they want to grow up fast n experience sex.... Don't blame the man... They r just man... Like a dog give him a bone n he would eat it no matter what...","commenter_a":"Sadly this happens a lot. My neighbors daughter was 14 with a 22 year old. Her parents knew. Let her go to the beach with him, let him stay the night ect.. then they broke up and he broke her heart. The parents put him jail. He now has to register as a sex offender for life. : (","post_message":"FUGITIVE WANTED: The Dickinson Police Department is looking for a 24-year-old man accused of sexually assaulting a 14-year-old. Authorities say they have been unable to locate Joshua Dwight Blair at his residence or last known place of employment. If you know any information about his whereabouts, you are asked to call police or Crime Stoppers. MORE ---> @webpagelink"},{"comment_id":"1194670093899735","commenter_b":"Hillary? Really the woman should be in prison.","commenter_a":"The judge is a son of illegal immigrant. @username do your freaking job investigate this judge. I gurantee you he's Hillary Clinton's supporter.","post_message":"U.S. District Judge Gonzalo Curiel in San Diego called for the documents to be released."},{"comment_id":"10154140064560579","commenter_b":"Seriously Facebook . .you need to put a 'DUH' button on here","commenter_a":"She's right, the game is rigged and I'm sick and tired of the power elite in this country, be it the politicians or the media, trying to tell us what to think. Regardless of whether it's her or someone else, we DO have to take our country back.","post_message":"\"This game is rigged.\" Carly Fiorina on not being able to participate in Saturday night's debate in New Hampshire. Watch complete video here: @webpagelink"},{"comment_id":"1762485630649940","commenter_b":"In the world of medicine, an incorrect diagnosis could possibly be as good as death. So in this case, yeah. Alternative medicine does kill.","commenter_a":"\"Alternative medicine kills\" what the heck?! It didn't kill her, sure it didn't save her, but it certainly wasn't the cause of her death.","post_message":"Being vaccinated could have saved this child. Being taken to a qualified medical doctor rather than a quack could have saved this child. Alternative medicine kills."},{"comment_id":"992230870799703","commenter_b":"Naw...she's right and yet...people keep fuckin around with white people. Get smart. Leave the crazy bastards alone. Duh.","commenter_a":"Jason, maybe whites should stop shooting up their own movie theaters and schools. And show me evidence of blacks attacking police officers. I suggest you worry and take out your own trash before you start with racist bullshit. Serial killers, rapist and mass murders Mostly white.","post_message":"Rebel Wilson's usually so funny so this awful joke about police and black lives came as a huge shock. #VMAs #BlackLivesMatter"},{"comment_id":"10154151138320399","commenter_b":"muhammad ali was a muslim. karreem abdul jabbar is a muslim. the rw always misses that.","commenter_a":"So what's wrong to be a Muslim? Is being a Muslim evil and being an evangelical Christian holy? Republicans are bunch of hypocrites. Very discriminatory and hateful bunch of bigots.","post_message":"He made his name as a Calvin Klein model and actor on \"General Hospital.\""},{"comment_id":"10153070274883010","commenter_b":"Wait, so your bathroom at home is a symbol of Sodom and Gomorrah?","commenter_a":"Welcome to Sodom and Gomorrah.","post_message":"A new West Hollywood law will require gender-neutral restrooms."}]
