[{"comment_id":"1777986365799226","commenter_b":"She is above the law,she doesn't, cheat or steal!","commenter_a":"As a woman I don't want the first female president representing me as someone who is a corrupted, lying, manipulator and fraud who thinks she is above the law. #Hillaryforprison.","post_message":"Hillary Clinton holds campaign rally in Cedar Rapids, Iowa after FBI announces they are reviewing email investigation. abcn.ws/2fnHba3"},{"comment_id":"10152872089786135","commenter_b":"Nations aren't doing too well and filled with hate, before this law was passed.","commenter_a":"We all know what God does to nations that disobey His word and goes rampant","post_message":"BREAKING: U.S. Supreme Court requires states to recognize marriage between two people of the same sex. LIVE UPDATES: @webpagelink"},{"comment_id":"10153155797009205","commenter_b":"Kill the whole breed .","commenter_a":"Always have your concealed firearm in case one of these beasts attack.","post_message":"Pit Bulls Maul Multiple Men [GRAPHIC]"},{"comment_id":"10153603093348132","commenter_b":"You are not that smart are you?","commenter_a":"DONT RUN","post_message":"\"We feel the system is working but it doesn't bring him back.\""},{"comment_id":"402701206566786","commenter_b":"Wake up Bitch!","commenter_a":"I don't watch her channel anymore. I don't like Oprah!","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"},{"comment_id":"10155254752442908","commenter_b":"@username Is that right? My life is in order. I am a home owner. I have had the same employer since 1994. I have never been on food stamps or welfare. I never take a vacation. If I do take time off, it is to do chores that has built up around the house. My wife (which also has a job and the same employer for 5 years) and I had 2 children, and raised them to be hard workers. Both my daughter and son in law to be have jobs. My daughter has two jobs. They are not planning on having children until they actually have their life started, and a place to call their own. They both have their own vehicles. Ones they have worked for and were not just given. Compare that to your life. Let me know... Then we can see who has spent their life ...","commenter_a":"Funny how some of these people are using the term 'greedy' to describe the rich, only to say that THEY want more money...face-palm.","post_message":"A few years ago, a $15 minimum wage was considered too radical. But when people see the justice of an idea, it catches fire very quickly."},{"comment_id":"10153831676802377","commenter_b":"Trump and him are a great team and those Trump have lined up will make The A team! Everyone that loves this country has to realize now this Election is about saving this country! Do yourself and loved ones the most important thing and vote Trump! Obama is letting illegals in to vote the Americans have to stand up and fight for their own freedom!","commenter_a":"No he lives in a bubble","post_message":"Following Mike Pence's remarkable performance at the vice-presidential debate, Republicans wish they could swap their presidential candidate as the Indiana governor now appears more promising than Donald Trump, according to Politico."}]
