[{"comment_id":"10154542878929714","commenter_b":"Their professionals,and should set an example.","commenter_a":"Morals clauses","post_message":"This school district wants teachers to stop wearing graphic T-shirts and flip-flops to work."},{"comment_id":"10153021428690399","commenter_b":"Karma is a bitch","commenter_a":"Bet he declares bankruptcy and sticks us with the bill. Typical freeloading conservative.","post_message":"smdh"},{"comment_id":"1438259686194057","commenter_b":"Say No to drigs","commenter_a":"I tired this in high school a few times when it was sold in gas stations. Knew a girk that made it too. So dangerous! Just smoke pot. I'm glad Co legalized weed and got rid if this stuff.","post_message":"Everything you need to know about K2, the drug linked to a mass overdose of 33 people in New York: @webpagelink"},{"comment_id":"10155013183823984","commenter_b":"And your fat ass bitch!!","commenter_a":"He is a total brain dead idiot. Every state only has two senators. Even tiny little Rhode Island. We have 50 states and 100 senators. Congress is according to population. Actually we need to go back to how the founders originally had it, where the states legislatures picked Senators and when they misrepresented the state they could recall them. Then the Senators wouldn't be persuaded by donors.","post_message":"President Barack Obama just made a staggering announcement about the Electoral College days before the electors cast their official votes..."},{"comment_id":"960983097307632","commenter_b":"At the last supper, JESUS told the disiples that if they had own sword, to sell the cloak to by one. Peter was carrying in the garden. This old mam does not know the BIBLE.","commenter_a":"If you own a gun you can't be a believer??? God has not revealed that to me. Where in scripture did He reveal that to you your holiness???","post_message":"Can you believe what the Pope said about gun owners? I'm stunned: @webpagelink"},{"comment_id":"1068900079796837","commenter_b":"Right on..","commenter_a":"Guitar picks of course, a pick pocket!","post_message":"Who knew? (via HuffPost Canada Style)"},{"comment_id":"10153959018846341","commenter_b":"The problem that Islam faces is that it is continuously moving backwards. Even in the Islamic golden era, the economy was reliant on slaves and infidels. The only successful Islamic countries today are the ones that have massive oil reserves. Muslims living in countries with no resources tent to live in poverty. This is why you always see Muslims migrating into infidel lands but you don't see infidels moving into Islamic lands. I do believe that Islam will dominate Europe. I have no doubt. Firstly the countries will be split into two with one being Islamic and the other being Christian but the Muslims will continue to migrate into the Christian countries because they will be poverty stricken. Because sharia is so retrograde Europe will imminently turn into another failed Islamic state as they have no resources. European winters can be very hard If everyone wants to pray 5 times ...","commenter_a":"unfortunate though, but this is the same way Palestinians are wailing, groaning and moaning everyday yet no one seems to care. Let's not unite in periods like this alone but all the time.","post_message":"The residents of Belgium capital city woke up Wednesday morning to a new reality, on the day after the terrorist attacks that killed at least 31 people."}]
