[{"comment_id":"843529112375874","commenter_b":"About time someone takes a stand. Great job now everyone else needs to fall in line and do the same.","commenter_a":"Good for them","post_message":"REVENGE: French Attack Mosques And Blow Up A Muslim Kebab Shop Looks like the French have had enough of the Muslims immigrants living there and are fighting back! @webpagelink"},{"comment_id":"10152991332957377","commenter_b":"He is a lot weaker. Building a WAll is a lot cheaper then paying for all the illegals and their so called benefits!","commenter_a":"jeb cant carry his own state.","post_message":"Jeb Bush fights back..."},{"comment_id":"10156091000625354","commenter_b":"White Trash ...Bastard .... Hoe Bag.... She has Evil Eyes.....Ugly Bitch.....!!!!!!..","commenter_a":"That's this fat slobs 2 seconds of fame, congrats your grandkids will tell stories","post_message":"Here's what we're dealing with, folks…"},{"comment_id":"704812552989083","commenter_b":"I would too....she is ugly!","commenter_a":"Poka dots look good on her. Muslim men are just jealous their women dont look like that.","post_message":"What in the...?! And no, it's not a joke. It's a REAL lawsuit. Look at the documents..."},{"comment_id":"1068924329809654","commenter_b":"I would hope so Peter! Because she is a women","commenter_a":"I've always considered myself conservative, I box, hunt, camp, work hard, and don't support socialism, but I believe Bernie is the best canidate.. I know for a fact I'm more manly than the person who typed this weak paper","post_message":"An open letter from a real woman to \"male adults\": \"We can and we should cherish men who exhibit traditionally masculine characteristics. They have made the world what it is today. I raise my glass to you gents. I've even made you a sandwich. But on the flip side of these strapping, rugged men there's you. A Bernie Sanders sycophant with not quite enough self-worth to fill an egg cup. Or a teaspoon. Certainly not enough to fill your bong. Take a good long puff before you read the rest of this, it's not going to get any better. I'm not going to make you a sandwich either. May I recommend a Hot Pocket? What is a man? A man, as defined by this woman, exemplifies the evolutionary behavior of a provider. This can take one of two forms (maybe both) of hunting and/or gathering. The more successful the man ..."},{"comment_id":"10154518044354342","commenter_b":"An animal gives birth to its young......will care for it, and not abandon its young. Humans are worse than animals..........spay this thing at once, she needs not tpo reproduce again, EVER!!!!","commenter_a":"Praying for healing.","post_message":"UPDATE: Police say the mother of a baby born in a Walmart bathroom, then left in a trashcan has been arrested. The baby is still alive, but in critical condition."},{"comment_id":"10154473639164749","commenter_b":"Rebecca Jara","commenter_a":"carry knife free zone signs with them. they are very powerful deterrents.","post_message":"\"I would urge parents to speak to their children about the app and the best ways to make sure they stay safe.\""}]
