[{"comment_id":"10153416110184705","commenter_b":"It took a woman to git r done!!!","commenter_a":"good","post_message":"A woman scaled the 30-foot flagpole outside South Carolina's Statehouse and pulled down the Confederate flag."},{"comment_id":"10153347711966680","commenter_b":"And from your own site @webpagelink","commenter_a":"No one has ever really cared what David Duke says so people don't need to flare up over his nonsense.","post_message":"Former KKK grand wizard David Duke on Donald J. Trump: “He’s meant a lot for the human rights of European Americans.”"},{"comment_id":"1909759522584421","commenter_b":"Isn't that Gail, Oprah's secret girlfriend ? She's a racist along with Oprah.","commenter_a":"Go back to Oprah!","post_message":"CBS acted like #BlackLivesMatter's personal PR group."},{"comment_id":"10152973600191336","commenter_b":"Na she's not crazy . Mothers turn super human when someone hurts or almost hurts their kids","commenter_a":"Ok...pretty sure this woman is cray-cray...not a protective mama bear, but whatever","post_message":"A wild police chase in Dallas came to an end thanks to a protective mother."},{"comment_id":"909858709204705","commenter_b":"Absolutely ! It's not a color issue , they were intruders !","commenter_a":"What a brave wonderful woman. So sorry to hear of her loss!","post_message":"Dorothy Hendrix unloaded on thugs who broke into her house... but look what happened next. She has every right to blow those intruders away. Do you stand behind her constitutional right to defend herself?"},{"comment_id":"790733494450561","commenter_b":"You go girl.","commenter_a":"good goin!! nice shot!","post_message":"65-Year-Old Woman Shoots Robber Michael Bontaites Square In The Chest. Thank god for the 2nd amendment. Do you support her right to bear arms?"},{"comment_id":"1837423903207723","commenter_b":"She speaks in a strange language called hooking and whoring.","commenter_a":"Jackie Kennedy: BA in Arts Hilary Clinton: graduate Yale Law Michelle Obama: graduate Harvard law Laura Bush: degree in eduction, Masters in library science Pat Nixon: worked odd jobs to put herself through college including sweeping the floor of a bank! Graduated with the equivalent of a masters degree from the University of Southern Cali. Lady Bid Johnson: BA in journalism from the university of Texas Nancy Raegan: drama and English major graduate of Smith Melania Trump: college dropout. Model, married her sugar daddy, excuses his misogyny as \"boys will be boys\" lies on command. I don't care if she's posed nude so long as she has integrity. If she's honest. If she's got a mind of her own. But she doesn't. And that's a problem. Yep. Awesome role model. AWESOME. 🙄 #GiveMeABreak","post_message":"Liberal or conservative, misogyny is misogyny."}]
