[{"comment_id":"10154170827586756","commenter_b":"@username dont u have a planned parenthood office to firebomb like your christian boy did in denver? come at me asshat i'll beat your ass down and light your hairy persian ass on fire to worship in lol","commenter_a":"I hope American culture and goods don't start to flood Iran and ruin it","post_message":"NPR's Steve Inskeep revisits three Iranians he met last year to find out if their lives have changed because of Iran's nuclear agreement with world powers. \"We are actually in a new world,\" says one."},{"comment_id":"10152708840057014","commenter_b":"The only ones wanting her are the freebie seekers. And the ILLEGALS !!!!!!!!","commenter_a":"Absolutely. Sorry to the GOP because all of their candidates are LOSERS","post_message":"Would you consider voting for Hillary for President?"},{"comment_id":"762776387211747","commenter_b":"Eu vir isso acho que quinta feira, incrível né❤","commenter_a":"Helton Carlos","post_message":"You can now turn your drawings into real clothing."},{"comment_id":"1142990589094021","commenter_b":"ugly women","commenter_a":"what are you animals?.....in britian?......wth!","post_message":"'Still not asking for it'"},{"comment_id":"1098350870176382","commenter_b":"All ILLEGAL immigrants are criminals. Come here legally and I will welcome you with open arms and warm smile.","commenter_a":"anyone with common sense knows that all immigrants aren't criminals, just like all whites aren't bigots, all blacks aren't ignorant, and all hispanics aren't lazy.","post_message":"ICE program focused on ‘national security’ detains immigrants with zero criminal convictions."},{"comment_id":"10154770919726037","commenter_b":"There isn't any suspense. I think we all know what Trump's reaction will be when he loses...","commenter_a":"He answered truthfully. We'll wait and see. It was a gotcha question for which there is no correct answer.","post_message":"“I’ll keep you in suspense.” - Donald J. Trump"},{"comment_id":"1028860963867355","commenter_b":"The bitch needs to shut up all she knows how to do is ly","commenter_a":"Lying again","post_message":"Senator Elizabeth Warren went after Donald Trump, slamming him as a \"thin-skinned, racist bully\" and \"proven failure\" who is only \"qualified to be fraudster-in-chief.\" What do you think about her comments?"}]
