[{"comment_id":"998135870245890","commenter_b":"One thing about Hillary she's use to it","commenter_a":"Who are they going to blame when the current President is gone? If GOP members weren't so low information they'd know that these gifts stay with the US government unless the Obamas reimburse the government for the price of the \"gifts\". Another pathetic attempt to start an issue there isn't one.","post_message":"Once again, the right-wing media left out a few important details..."},{"comment_id":"10153174192806694","commenter_b":"Hate-watching is incredibly stupid and masochistic *unless* you're getting paid to do it, in which case I get it. I get why I09 \"hate-watches\" - it's part of their business. But how the hell can someone who isn't getting paid justify it? Lots of bored, boring, aesthetically masochistic, profoundly lonely people looking for attention I guess?","commenter_a":"Stop watching it if it's so bad","post_message":"And the one moment that exemplifies every single problem with the series."},{"comment_id":"10156127047875354","commenter_b":"U devil put this demon in the men's jail she get all the wood she wants . Why u crying bitch u r a girl now u need man.","commenter_a":"He/she needs therapy!","post_message":"Oh MAN!"},{"comment_id":"10153350173059255","commenter_b":"Isn't that one of their anchorwomen?","commenter_a":"Most \"Sex Obsessed\" persons constanty ruminate about avoiding and policing sex.","post_message":"Really, guys?"},{"comment_id":"10153779416811509","commenter_b":"I pledge allegiance to the flag of the United States of America......not the flag that fought against it #patriot","commenter_a":"People need education on the history of the flag and the different types of confederate flags. The black confederate flag is the bad one.","post_message":"Mississippi's House Speaker says his \"state's flag has become a point of offense that needs to be removed.\" The Confederate flag appears in the top-left corner. @webpagelink"},{"comment_id":"10154125606926615","commenter_b":"Those mountains r no joke girl","commenter_a":"For a few inches of snow????","post_message":"11 ALERT: Several school districts have decided to send students home early today, before the snow begins to fall. Keep checking this link for updates. FULL LIST: @webpagelink"},{"comment_id":"10156011468900354","commenter_b":"Worse than that she made jokes about it, shameless woman.","commenter_a":"say what you will, but she is, always has been, and always will be a liar , crook, theif and a criminal. Just say no to Killary.","post_message":"Hillary's got jokes! About breaking federal law and endangering national security--what a hoot!"}]
