[{"comment_id":"10154489000406336","commenter_b":"She shouldn't even be in this election she should be in prison.","commenter_a":"We all have to watch Hillary very closely as she will surely try to rig the general election like she had done during the primaries. What was recently exposed at the DNC she most definitely should be disqualified. Goes to show that the Clintons are corrupt, above the law and play by their own rules.","post_message":"\"I think what I'm offering are proven results. I think what I'm offering is that we can build on where we are.\" On \"Fox News Sunday,\" Hillary Clinton slammed Donald J. Trump, claiming that he has offered nothing to help people, while she has an agenda to increase jobs, increase incomes, and make the economy grow and be more fair. @webpagelink"},{"comment_id":"10153130276219071","commenter_b":"Want to know who fought against any and all mental health checks for firearm purchases? The ACLU and liberal groups...that's right...the ones screaming the most about \"guns\" are the ones with \"Blood on their hands\".","commenter_a":"All these gun nuts won't even consider the possibility of mandating thorough background checks before purchasing a gun. That's all that is necessary in my view. Instead they keep covering their ears and screaming \"taking away our guns won't change anything\". People wanting better gun control legislation don't necessarily want to take away normal/healthy/stable/non-criminals ability to purchase guns, we just don't want any psycho to be able to walk into any store and purchase a gun in 5 minutes.","post_message":"He says he's shocked that his son owned 14 firearms."},{"comment_id":"10153989923308854","commenter_b":"I hope the refugees stay with Obama... His wife and girls should get what they have planned for woman al over..","commenter_a":"ObamaNation only a socialist democratic liberal would create this program. Bernie Sanders love's this unconditional illegal ruling. $9.000 a year NOT to committ illegal crime. Who says crime doesn't pay. After WIC EBT HUD cash aid free ObamaCare medi medi welfare and food stamps total cost to the taxpayer's is over $50.000 a year. What's the incentive to work.!!!!!!! @webpagelink","post_message":"ISIS Promises to BEHEAD OBAMA and Transform America Into Muslim Province"},{"comment_id":"1027708620606666","commenter_b":"They have no sense of humor! They can not take any kind of criticism or satire! The most boring people on this planet!","commenter_a":"Because he exposes the truth of Muslim infiltrators! Roaches hate the light.","post_message":"Why is designated terrorist group CAIR condemning this FOX News report about Muslims as “racist and Islamophobic?” What ‘race’ is Islam?"},{"comment_id":"10153490224540950","commenter_b":"Trump","commenter_a":"Who Cares Vote Trump","post_message":"Ted Cruz's wife was caught in the crossfire this week between her husband and Donald J. Trump. But she said she's \"not worried\" about Trump spilling the beans about her past. Take a peek:"},{"comment_id":"1121161091293379","commenter_b":"I thought she was 100","commenter_a":"Nick Foley @username @username bruh.. lol this is about to be mom","post_message":"A man named Sidomejo from Indonesia has documents that claim he was born in 1870 – which may mean he is 146 years old."},{"comment_id":"550962398414284","commenter_b":"2","commenter_a":"Two(2)","post_message":"WARNING: This photo will make you feel like you have forgotten how to count. (via HelloGiggles)"}]
