[{"comment_id":"10152922353911051","commenter_b":"Someone should dangle her nasty evil ass with their hands around her fu****g neck!!!! evil bitch","commenter_a":"I'm sure the mom had a tight grip on the child when she did that. In saying that I'm hoping the kid was being punished for doing something really fucking stupid for her to take it that far","post_message":"Neighbors couldn't believe that a mother would do something like this to her young son."},{"comment_id":"10153526308641509","commenter_b":"Christians are freaked out because there will be more muslims in the world than Christians soon enough...ha, ha...paranoid! Be very afraid republicans and pee farty hatriots oh and BUY GOLD will ya? lol.....","commenter_a":"Relax people, we got those Iranians right where we want them...","post_message":"President Barack Obama says if a nuclear deal is fully implemented, it will prevent Iran from obtaining a nuclear bomb: @webpagelink"},{"comment_id":"643301722461533","commenter_b":"Does the American flag represent millions of people that have done nothing wrong and try to survive under a fucked up government? Or does it represent something else? See, that's the beauty of this flag. It holds different values for different people. You don't value yourself, others, anything? You more then likely will despise what I say and verbally attack me.You blindly support atrocities committed by our shit-for-brains leaders, you'll probably verbally attempt to attack me. My point remains clear, for those with a mind to think for themselves.","commenter_a":"Just for shits and giggles. I want to see the love we all profess for one another.","post_message":"This is epic."},{"comment_id":"10152808314825736","commenter_b":"Hope everyone has their General Lee from \"The Dukes of Hazard\" cause you can't buy one from amazon, ebay or etsy now!","commenter_a":"Confederate flags have just become collectable.","post_message":"More retailers, including Amazon and eBay, joined Walmart to remove rebel-flagged items from their shelves and websites."},{"comment_id":"10155150563786320","commenter_b":"English is patriarchal oppression Orla, please check your privilege!","commenter_a":"@username @username Bout time😂","post_message":"Hmm... Lena Dunham is crediting her recent weight loss to President Trump. (Image: AP/Fox News)"},{"comment_id":"739571439509370","commenter_b":"Suzette, no, she doesn't. She just encourages them to get abortions so they can go back to their life and most likely get pregnant again.","commenter_a":"So here's an actual SOLUTION for all the pro-life people... Rather then protest, why don't you offer to help those poor, confused girls seeking an abortion? Perhaps these women feel they have no other option. So why don't you offer to help them out, since you love babies so much? Offer to take these girls in & give them an alternative, especially since a lot of them fear that their family is going to shun them due you to this unplanned pregnancy. Then, pay for all of their medical bills for all the doctor visits they'll need, including the hospital birth. Then, while the mother recovers at YOUR house, you can raise the baby you desperately wanted to save when she leaves to go on with the life that she wanted to live. I think that would work. Why don't all you pro-life people go and do that? Oh wait, ...","post_message":"Planned Parenthood doesn't want anyone to know this? Then spread this EVERYWHERE!"},{"comment_id":"10153229951151130","commenter_b":"Because women are catty.","commenter_a":"Someone needs to get their nails done.","post_message":"\"I never again want to get so caught up in this virtual reality that I forget the physical world right behind me.\""}]
