[{"comment_id":"10153748803376077","commenter_b":"Greed!!","commenter_a":"Whoa!!","post_message":"9NEWS Denver Broncos Insider Mike Klis has confirmed that quarterback Brock Osweiler is going to the Houston Texans."},{"comment_id":"10154739009466337","commenter_b":"I say extract the bitch the bitch that's in you that complains about characters of fiction switching ethnicities","commenter_a":"I say cast a white dude. Because it's cool to switch race's of established characters now right?","post_message":"BLADE'S RETURN? Marvel hopes so..."},{"comment_id":"990159621088681","commenter_b":"Party affiliation is not THE ISSUE & what you should be voting on here Is Making America BETTER, PROSPEROUS & SAFER. IF YOU WANT MORE LIES..MORE CORRUPTION ...MORE $$$$$$$ GIVEN TO THE MIDDLE EAST...MORE WEAPONS SUPPLIED TO THE RADICAL GROUPS....MORE ILLEGALS COMING IN... MORE MURDERS..SANCTUARY CITIES... ...VOTE HILLARY.. YOU are the SHEEP. THE UNION HAS MADE YOU FOLLOWERS. SOUNDS LIKE MOST UAW MEMBERS ARE WISING UP. LOCAL 909 MEMBERS HAVE. EDUCATE YOURSELVES. WATCH: CLINTON CASH HILLARY THE MOVIE HILLARY'S AMERICA 13 HOURS READ: GUILTY AS SIN PARTNERS IN CRIME CRISIS OF CHARACTER ....and so much more... Investigate the CLINTON FOUNDATION.. HOW THEY HELPED (LOL) HAITI. They stole billionsof donations from these poor people. CLINTONS ARE FULL OF LIES. THEY MUST NOT BE TRUSTED! !! HILLARY CLINTON IS A WICKED WOMAN..for those who follow LOUIS FARRAKHAN, he States this fact, he also states how obama has failed his people. Look it ...","commenter_a":"Out of all the people in this work and these two clowns are the only choice","post_message":"Donald J. Trump is speaking this afternoon at Macomb Community College in Warren."},{"comment_id":"1970418399684565","commenter_b":"Gorgeous dress","commenter_a":"Horrible dress","post_message":"Politics made it to the Grammys!"},{"comment_id":"1195858527119048","commenter_b":"That is what we call \"seasons\" in Texas. LOL","commenter_a":"No it is not. Just look around us fire in one state floods in others and earthquakes in others lakes dying up and animals dying from bad water and no food.","post_message":"This is important."},{"comment_id":"1043726442390274","commenter_b":"We have our own problems here, send em to other Arab countries","commenter_a":"Not only a great actor, but an absolute class act.","post_message":"\"The show was fantastic, but you left in tears after [Benedict Cumberbatch's] speech. It was very eloquent, emotional, and beautifully put … He gave a 4-letter word to the politicians and said, ‘We’ve got to do something about it.’” - Rachel Martin, audience member"},{"comment_id":"10154168585709726","commenter_b":"She will be worse and any of the others. Idiots","commenter_a":"Whoever gets the nomination could run a brilliant series of ads about Hillary's War on Women.","post_message":"Abortion rights group looks to spend big to secure Clinton victory in November."}]
