[{"comment_id":"1437463806270353","commenter_b":"Can Hillary come to Texas?","commenter_a":"We don't care much for you here in Houston either, Trump. Just wanted to let you know that before you get down here and make ya self at home","post_message":"Heading to Houston, Texas now -- just informed that two police officers in Fort Worth have been shot. Please join me in keeping them in your thoughts and prayers this evening."},{"comment_id":"10153469428757144","commenter_b":"Those beautiful little WHITE girls are gonna be so bummed out when they come to understand that THEY are the minority. All that was missing in their routine was the Zeig Heil!","commenter_a":"\"Tomorrow Belongs to Me\"","post_message":"The internet is freaking out about this video. Watch it and you'll understand why."},{"comment_id":"533308460200216","commenter_b":"If you are Gay, Why are you voting for Hillary when she wants to bring in thousands of refugees that believe all Gays should be executed? If you are Black, Why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood who want to abort as many black babies as possible? Exterminate the black race because they are like \"weeds\". (Margaret Sanger quote) Most of those clinics are in Black neighborhoods. If you are a Christian, Why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who dedicated his book 'Rules for Radicals' to Lucifer (the Devil)? She says he was, and still is her mentor. If you are a Veteran, in the Military, or closely related to a Military member, Why are you voting for Hillary when she left those men to die in Benghazi and had the nerve ...","commenter_a":"Why can't we have all candidates for a debate? 1-2% should be enough for them to take the stage. Do you guys agree?","post_message":"What questions do you have about the elections? We're in CNN's Election Center with CNN Politics Executive Editor Rachel Smolkin and Political Director David Chalian. #CNNElection #ElectionDay"},{"comment_id":"966131710165214","commenter_b":"The people Hitler was fighting nare in control of America now.#GoZioniost#FickZionoistPuppets","commenter_a":"Hillary and Obama are a cancer to our country.","post_message":"Is it happening again? Join Us: The Free Thought Project"},{"comment_id":"10154427228206162","commenter_b":"Clearly the women in this case is at fault she bought the cheaper tickets and tried to pull a fast one.","commenter_a":"Leave it to ABC news to make a bigger deal out of a story than what it should be.","post_message":"A mother was devastated after she and her five children were forced off an Amtrak train in the middle of the night. READ MORE: @webpagelink"},{"comment_id":"1567259589966213","commenter_b":"She is a better person than all of you below!!! I am white and a Christian.","commenter_a":"I am so disgusted by all the haters. Eating healthy, and fighting childhood obesity benefits everyone in this country; or maybe you would like to pay the medical bills for all the diseases that are caused by lifestyle in this country. Even Trump with all his bragged about billions does not have th money to pick up that bill.","post_message":"She made a beautiful announcement then was called every racist name in the book."},{"comment_id":"10152968959637452","commenter_b":"Why couldn't she just get out?","commenter_a":"Who really believes that was a suicide? Smh..","post_message":"\"Get out of the car! I will light you up!\" Authorities have released dashcam video of Sandra Bland's arrest about a week after she was found dead in her jail cell. FULL VIDEO: @webpagelink The medical examiner ruled the Chicago-area woman's death a suicide, but her family believes otherwise."}]
