[{"comment_id":"984289534964128","commenter_b":"Easy. Stop all benefits to foreigners.","commenter_a":"Foolishly, in October 2014 Italy left-wing government became the first European Union country to decriminalise illegal immigration and deploy its navy at huge expense to save migrants crossing the narrow Sicilian channel in open boats from North Africa (Libya mainly) in order to bring them to Italy and thus the European Union where most remain. The policy change, driven by a perverted mix of human decency and political correctness, was pure folly: it has acted as a green light to wannabe boat people everywhere, whose numbers soar as the chaos in Africa and the Middle East escalates. The result is an exodus of biblical proportions out of Africa and the Middle East into Europe. The Welfare System in Britain and Ireland is the main attraction for these illegals. Action needs to be taken now to STOP this Exodus!!!!!","post_message":"Forget the Greek crisis or Britain's referendum, this wave of migrant's is Europe's biggest threat"},{"comment_id":"1645437002375216","commenter_b":"i like thin women but umm. no, just no","commenter_a":"That is just grotesque","post_message":"Hot or not?"},{"comment_id":"588617531328826","commenter_b":"She is a joke","commenter_a":"Yes she should keep her mouth shut. She is not the president (neither is Obama). She mouths off and there are Americans starving and dying because they cant get medicine. They both need to just go away. They dont need to be in the US.","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with. Nobody cares. What a joke. Do you agree Michelle Obama should keep her mouth shut?"},{"comment_id":"1191285677577713","commenter_b":"The people voting for killary think they,ll get a free pass. Muslims don,t care! Go President Trump!","commenter_a":"If Trump loses I'm going to get a divorce reap all the benefits of a single mother children's free medical care food stamps free housing free utilities free cable free cell phone he will quit his job and work at a 7-Eleven and live in a separate unit from me But will still be together like they do, My kids will get free school lunches and breakfast free sports associated camps free YMCA free scholarships for free college:))))","post_message":"\"She’s going to open the borders, pack the Supreme Court and you are not going to have the same country. Maybe you like that, maybe you don’t. But we’re not going back to the status quo, period. And so Republicans need to understand if Trump loses, it is a new America, OK? A lot is on the line, whether you like him or not. That is real.”"},{"comment_id":"10153847730226336","commenter_b":"Those widows aren't afraid to strap on a vest and blow innocent people to pieces ...#mrpresident","commenter_a":"He could never win a debate with Cruz.","post_message":""},{"comment_id":"10155018887269329","commenter_b":"Rehash rehash... blah blah you lefties, blah blah. We won blah blah. No new content. Regurgitation continued. Yawn.","commenter_a":"You'll fit in with the self-important Hollyweird glitterati JKR. The British have never been enamoured of their paid entertainers except for simply that, as entertainers, who are well paid for their craft. The disenchanted and disenfranchised led the way with Brexit. Believe me, those who formed this majority are not racist not are they Ill educated. Nor are they of the lower socio-economic strata of society. They are the majority who stopped being intimidated by the PC brigade. The U.S. followed and Europe is next. The pendulum has swung back in reaction to the rot spreading from the highest echelons of government down, aided and abetted by a dishonest press and a compliant and unrepresentative public service.","post_message":"J.K. Rowling has outdone herself."},{"comment_id":"10153572018825695","commenter_b":"Yeah, it's like a 10 hour trip from here.","commenter_a":"@username we need to plan a trip there and check this out. Me you and Jason Snyder","post_message":"TRENDING: One lucky woman discovered the fifth largest diamond ever found at an Arkansas state park. @webpagelink"}]
