[{"comment_id":"1724147734520564","commenter_b":"First Ladies always ware pearls. Hers are a double strand!","commenter_a":"She's no lady she is only 1 step above hillary Clinton in being the most pathetic excuse for a first lady","post_message":"Has Michelle Obama been a good First Lady?"},{"comment_id":"491494467719874","commenter_b":"What a dumb ignorant Bitch !","commenter_a":"And she's working on some kind of a reality show where she's a \"judge\"??? OMG!!!!!","post_message":"There it is. There’s the stupidest thing she’s ever said."},{"comment_id":"10154185747461717","commenter_b":"@username why don't you grow the f****** up","commenter_a":"So tired of women using their children as excuse for staying in a abusive relationship. Now that she did nothing, she will be in jail and loose her son.","post_message":"Her uncle said that Noor Salman was physically and mentally abused by Mateen and that she stayed with him for fear of losing custody of their son."},{"comment_id":"1034820419922610","commenter_b":"Fuck her","commenter_a":"Oh please she has an easy life it's the soldiers and other people have it hard and uncomfortable not her","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"936127749836940","commenter_b":"And system fail too","commenter_a":"Sel Taylor","post_message":"I Just Got a Computer Chip Implanted In My Hand — and The Rest of The World Won’t Be Far Behind"},{"comment_id":"430918413735174","commenter_b":"No inadiment object kills, ie, knife, gun, car, tire iron. It takes people to pick them up use/drive to kill someone. If y'all did your research, guns are not the leader in killing people. Your wife's Rolling pin is up there. Smh at some of you.","commenter_a":"Just waiting for the \"guns don't kill people\" squad","post_message":"\"More than half the women murdered each year are killed with firearms — and in nearly 75 percent of those deaths, the weapon is a handgun.\" Fault Lines: Death in Plain Sight, tonight at 10pET"},{"comment_id":"985606431474778","commenter_b":"@username, I understand what you're saying. I'm supporting Ben Carson for potus. But with all the voter fraud, illegals voting Hillary will be president. That scares the crap out of me.","commenter_a":"Sadly, I fear she will be our next POTUS. It's a bad, bad time in America.","post_message":"This is so sad."}]
