[{"comment_id":"10153499829950329","commenter_b":"Whooooah Michelle Esquibel Gena Esquibel","commenter_a":"Jenna Benham","post_message":"For a \"kids\" party, yes. Definitely not for adults. *coughs*"},{"comment_id":"116808422164651","commenter_b":"Illegal immigration must first be brought under control. Only then can we regulate all immigration and I doing do Skylake washes to naturally as the flood of cheap labor is ended.","commenter_a":"END THE DRUGS COMING IN US ! WE'RE IN BIG TROUBLE WITH DRUG ADDICTION","post_message":"BORDER WALL: President Donald J. Trump is expected to sign an executive action today to jump start construction of the border wall that he promised would be built during his campaign. MORE: @webpagelink"},{"comment_id":"10155252266929411","commenter_b":"Wheres the music coming from?","commenter_a":"77","post_message":"#1917LIVE: The sun sets on the Russian Empire Romanov rule is collapsing. Martial law imposed in #Petrograd. Authorities fear violence can erupt anytime. Russia is like a boiling cauldron, that can explode at any second. Follow #1917LIVE - Retweet the Revolution @webpagelink @webpagelink/ 27.02.2017"},{"comment_id":"10152876050286680","commenter_b":"@username is a RACIST!","commenter_a":"It's amazing how anyone like the ultimate pre-millennial distributionist, Neocon, evangelical, can spout his bilge and people think he's accomplished something. If Cruz is the best this nation can do, we are done. We don't need pontificating, and pandering to Christian values. We need leadership, a complete change in course to get our government working for the people again. I don't see it happening. Cruz belongs at a shatuaqwa tent, not the Oval Office. He cost us 24 billion in a phony shut down, could care less about health care for the middle class or poor, voted against Veterans benefits increases and VA spending. He's a charlatan, and the Elmer Gantry of the GOP.","post_message":"Ted Cruz killed it at the conference of social conservatives. And Marco Rubio fell flat."},{"comment_id":"1095090630555419","commenter_b":"Leave then lol i did","commenter_a":"Chicago is the worse place to live it's sad I fear for my child and don't want her outside because there's so many shootings each day","post_message":"WOMAN SHOT AT STOP LIGHT: A 24-year-old woman has been shot multiple times while at a stop light at 71st & Wentworth in the Englewood neighborhood. It happened just after 11 p.m. The car she was driving ended up coming to a stop in a grassy lot with its driver side window shot out. She is being treated at Christ Hospital in Oak Lawn where Diane Pathieu ABC7 joins us live with the latest."},{"comment_id":"1546688018681408","commenter_b":"If we are about to start following the Bible, can we get this woman to shut her mouth first ??","commenter_a":"I'd pay money to see the look on her face at the innoguration.","post_message":"\"Okay, Hillary, now that Donald J. Trump is looking to help you heal and help the nation heal, would it be fair to say – to use your own words – 'It's time to give Donald Trump his chance to lead'?\" – Judge Jeanine Pirro @webpagelink"},{"comment_id":"10153994674826051","commenter_b":"What a sick woman!","commenter_a":"I'm disgusted at the thought of such a thing. I hope they sue.","post_message":"This 8-year-old came home from school distraught. His dad asked him what was wrong. The boy explained that the teacher had forced him to stick his head into a bucket. Dad asked: \"What was inside the bucket?\" When his son told him, he snapped."}]
