[{"comment_id":"10153949955984454","commenter_b":"Chicks with green dresses","commenter_a":"What is wrong with this pipeline? Pipeline are the safest way to move oil and natural gas. And the least destructive to the environment. Most of the land recuperates in a few years.","post_message":"An expanded Alberta Clipper pipeline could send up to 880,000 barrels per day of toxic oil from Canada's Alberta tar sands into America's heartland even more than #KeystoneXL. Tell Secretary of State John Kerry to block the Alberta Clipper pipeline: @webpagelink"},{"comment_id":"10153100567617464","commenter_b":"get rid of her","commenter_a":"She's bad news , she's dangerous to the good people of America!!","post_message":"Read and SHARE my new op-ed: Republicans must oppose Loretta Lynch — or lose all credibility on lawlessness: @webpagelink #StopLorettaLynch"},{"comment_id":"1053133688060436","commenter_b":"What!!!???","commenter_a":"We're number 1!! We're number 1!! Oh wait......","post_message":"While the rest of the world is reducing maternal deaths, the number of pregnancy-related deaths in the U.S. continues to rise. In fact, America now has the highest rate of maternal deaths in the Western world."},{"comment_id":"10153691446913984","commenter_b":"Trey what the bitch in jail","commenter_a":"Someone should call that witch on the carpet. She's a corrupt liar, but I guess that I am supposed to be OK with that because she is a Liberal.","post_message":"Looks like Hillary Clinton just got another piece of bad news, and it's from one of her least-favorite people. 'Bulldog' Gowdy is hot on the trail! Do you support Trey Gowdy's fight to hold Hillary accountable?"},{"comment_id":"10153563509195329","commenter_b":"Obviously if you're not as fat as a cow then you're not a real woman","commenter_a":"Dammit! What EXACTLY is a 'real' woman?!?!","post_message":"After years of admiring the models in Victoria's Secret catalogs, we decided to make ourselves into models."},{"comment_id":"10152826278642093","commenter_b":"Oooh sweet Jesus take cover my friends in dat area God bless y'all prayers going yalls way","commenter_a":"Duncanville","post_message":"Tornado Warning for portions of Dallas and Tarrant Counties until 2:45 AM this morning. Tornado is radar indicated near Cockrell Hill moving NW at 35 mph."},{"comment_id":"10155037125378459","commenter_b":"Hey the angry ex wife is back!!!!!","commenter_a":"You know when there is a big headline telling you the absolute truth about anything on social media that you are in for a load of bullshit.","post_message":"The Truth About Oprah Winfrey Oprah Winfrey meets in secret with THE MOST evil men and women in the world every year and is given talking points to push on her audience..."}]
