[{"comment_id":"10153060673305329","commenter_b":"Sharon Needles bitch!","commenter_a":"Oh my gosh @username and Tavian Broderick you got to take this shit- i got Bianca","post_message":"Good luck, and DON'T f**k it up."},{"comment_id":"10154098504122541","commenter_b":"Omg you. Are too much really","commenter_a":"Ugh, putting my faith in Mike Pence to save us from Trump? Lose Lose situation. Pence is actually scarier, he just tweets less. Hmm, decisions lol","post_message":"Let's talk about the 25th Amendment."},{"comment_id":"892169154214897","commenter_b":"Tucson, AZ.","commenter_a":"12s, where are you watching from???","post_message":"Watch: Seahawks leaving for Carolina!"},{"comment_id":"10158070336085231","commenter_b":"There is no Muslim Ban. Ban is against potential terrorists not against Muslims.","commenter_a":"This is what discrimination looks like to the Black's, sorry to see another people of color experience this!","post_message":"The American people are putting their money where their mouth's are."},{"comment_id":"1903950129833878","commenter_b":"@username It was stolen! Putin and Trump stole the election, doesn't your little brain understand this. A foreign dictator stole our election so that this con-man could be manipulated by an evil russian. Read!!","commenter_a":"Then come on Democrats, let's shut down America! Trump cannot make it to the White House!","post_message":"No doubt! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154092020795950","commenter_b":"Understood but will be a taxpayer nightmare of added security details. I am sure there are comparable private schools in DC.","commenter_a":"Can you imagine if any other President did this? In addition to taking his grown CIVILIAN kids to meetings with foreign leaders. And people are actually defending this...lol","post_message":"America could soon have a long distance FLOTUS."},{"comment_id":"10156232321860354","commenter_b":"Go make us a sandwich bitch!","commenter_a":"Ah shit","post_message":"Get ready. Here it comes..."}]
