[{"comment_id":"10156192968210354","commenter_b":"This witch has lied, cheated and crooked everything she come in contact with in Washington.....she deserves to be in prison but not as long as the democrats up hold her, she will continue to get away with everything.","commenter_a":"Obombass will back Biden but only if obombass can vice president..... dictator","post_message":"***BREAKING*** \"...raises the possibility that the Democratic presidential candidate’s correspondence eventually could become public.\""},{"comment_id":"10153899615080329","commenter_b":"They can go f****** themselves. Ur beautiful.","commenter_a":"I'm not Latino but I'm half Black and half American Indian and I've felt and been told I wasn't enough of either.","post_message":"Spoiler: You're perfect."},{"comment_id":"10154997987663812","commenter_b":"@username Lie cheat and delete.","commenter_a":"What are the successes? Stealing millions via the ClintonFoundation? Seriously what has she done in 30 years?? Name three things, that's 1 per decade","post_message":"Hillary Clinton's message to young Americans and young girls in particular: \"Never doubt that you are valuable and powerful and deserving of every chance and opportunity in the world.\" @webpagelink #Election2016"},{"comment_id":"10153174741786323","commenter_b":"English people are NOT being RACIST. They dont go to places to live eg Spain. Greece. Australia etc and expect that country to cater to them. You go to a country you respect their way of life. They need to learn English. I used to love the golly on the jam jar brooches. All gone because of so called RACISM. This is a little island. Anyone with a criminal rec ord should not be allowed here and those that commit a crime need to be returned to their homeland. We pay NI out of our wages- not to support freeloaders who offer nothing to this country. What was beautiful historic church buildings-turned into Indian Temples. English Heritage is being destroyed!! Polish people have turned this country in areas to little Polands and this Government have let them. BNP want this country to be ENGLAND and ENGLISH laws and those that ...","commenter_a":"If a white person doesn't roll over and submit, he's a racist.","post_message":"\"Facts in themselves are neutral but their interpretation certainly isn’t. And while on their own facts cannot be racist, the way they are chosen certainly can be.\""},{"comment_id":"1084321754934235","commenter_b":"Get the hell out and sell the house.","commenter_a":"I'm literally crying right now hahaha","post_message":"Police in Sydney told the man neighbors heard death threats, screams and the crash of furniture being flung around."},{"comment_id":"10153689334397869","commenter_b":"Locked away in a prison? So that your tax dollars can feed him, cloth him and pay for the medicine when he is sick. There is already a fence up and they scale it. If you build a bigger wall then they will just dig tunnels.","commenter_a":"Governor, I've always respected you. I voted for you when you ran for president eight years ago, and I was proud to cast that vote. That said, wouldn't it be better to have him arrested and locked away where he can't do any more harm, regardless of what side of the border he's on? I'm concerned that having a \"deport the criminals\" stance fuels a xenophobic mentality that all illegal immigrants are dangerous criminals. Also, there's no way to ensure he stays deported for good, even with a wall. Lastly, it seems to imply that if he's a danger to society that we don't care about the lives of people outside of our borders. Aren't humans worthy of human dignity regardless of what side of the border they're on? Imprisonment seems like the best option. I'm genuinely curious, and would appreciate an honest, civil discussion.","post_message":"Prayers today for the family of North Texas firefighter Captain Peter Hacking, who was killed along with his four-year-old stepdaughter and 22-month-old son when a van veered into their lane and hit their car head-on. If the van driver recovers, he’ll be charged with criminally negligent homicide. Let’s hope that’s also enough to get him deported for good, since he’s an illegal immigrant who was already deported in 2008, but came right back across the border. Normally, I’d link to a news site for more, but I’d rather that you read it here. It’s the GoFundMe page set up to help Captain Hacking’s widow and his surviving son and four step-children:"},{"comment_id":"1154135184625068","commenter_b":"@username,get that trailer cleaned up woman!","commenter_a":"Fake","post_message":"\"Donald Trump’s birther event is the greatest trick he’s ever pulled\""}]
