[{"comment_id":"1324204954284728","commenter_b":"This is the future of the Democratic Party. She's sick .","commenter_a":"Thank goodness she got what she deserved.","post_message":"While out preaching on the sidewalk, a man was shocked to see a woman quickly approaching. Unfortunately, things would take a horrifying turn as the vile woman pulled something from between her legs and decided to gift him with it – but she wouldn’t be laughing just a few short days later. @webpagelink"},{"comment_id":"10153092200332869","commenter_b":"Mrs.Clinton will never be president and a Democrat will not get the presidential office. Either republicans or the third party is getting the presidential office. I do not accept the same-sex marriage.","commenter_a":"So proud of Gov Huckabee's strong stand against same sex marriage. Sets him apart from others who shun the issue. Will be a strong president!!","post_message":"Governor Huckabee was on Fox News tonight to discuss the Supreme Court's divided ruling on gay marriage, and the need to reject judicial tyranny and protect religious liberty. WATCH ⬇️"},{"comment_id":"10153067823099411","commenter_b":"My respected fellow u explain very nicely like a poet and blame to muslim now one question who attack on Afghanistan who is killing innocent people in Pakistan by drawn attacks who is killing Muslims in burma. who is killing Muslims in Africa,and one thing listen Islam is the religion of peace not terror first study islam than make justice infront of me 10 cristians got Islam its not the issue main point is that dont try to impose religion war make the world peaceful place not hell thank you","commenter_a":"Copy and paste this on ALL muslim stories! Flood them with the truth! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Muslims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were ...","post_message":"Hundreds of thousands have flooded the streets of Chechen capital of Grozny in a rally against the publication of the Prophet Muhammad by Charlie Hebdo magazine. The demo, dubbed to Prophet Mohammed, was organized by region clerics and united muslims from various regions of Russia."},{"comment_id":"990875947619544","commenter_b":"Such an evil, self-serving, grandstanding waste of oxygen!","commenter_a":"Wasn't he born in Canada?","post_message":"At least he's fighting imaginary foes, this time."},{"comment_id":"10153463322016051","commenter_b":"Too sick! This woman might wear Christian symbols at Christmastime !","commenter_a":"There is no meshing between our God and theirs-the Holy Bible is our guide and law-we are inclusive but stand on firm ground!","post_message":"This evangelical Christian school just suspended a tenured professor for expressing solidarity with Muslims. And they didn't stop there. Decide for yourselves if the school behaved correctly. (Via VICE News)"},{"comment_id":"10154018713024411","commenter_b":"Antony. I don't represent the US government. The US government doesn't represent me. I don't excuse all of the bad things the crooks who call themselves \"my government\" do. And none of that excuses crimes Israel commits. Including the subversion of my country's government via AIPAC and all of its spies, such as the traitor Jonothan Pollard, and dual-citizen Israeli loyalists in positions of influence and power. If you don't like the crimes my country has commited in the Middle East since 9/11, you can attribute a big part of the blame on Israel and its subversives in the US. Not all, but a big part.","commenter_a":"The excuse is always the same. A missile from Gaza lands harmlessly into the Israeli desert. Israel bombs the hell out of Gaza, killing dozens or hundreds of civilians. When are people going to wake up to this scam. Israeli agents shoot off the missile to provide a pretext for Israel's aggression.","post_message":"URGENT"},{"comment_id":"10156220417230354","commenter_b":"Funny how they brought in women who said because of Planned Parenthood they were able to get breat exams. She admitted Planned Parenthood had no mammogram machine! All they do is feel the breast then refer you to an imaging center! Obamacare covers this. Obamacare covers birth control pills as well. Take your pill, no need for an abortion.","commenter_a":"Obamacare (paid by our Taxes) covers all women's health issues and problems - why is Planned Parenthood (which name indicates planning to become a parent) even needed. Women use PP for birth control - seems like double taxation to the taxpayers.","post_message":"Running a human meat grinder and selling human baby parts is lucrative work. And YOUR hard-earned tax dollars help pay for it all!"}]
