[{"comment_id":"10154197437622426","commenter_b":"It's reality, white suburban women. It's not fair but it's a fact. If you're so concerned why don't you go down to Hillside Court and walk the kids home from the bus stop.","commenter_a":"School need more money but kids have 300$ shoes .500$ phones and say look at me and wonder why this happens.","post_message":"The robbers, described by police as young adults, threatened to beat-up the student if he did not take off his shoes and hand them over."},{"comment_id":"10155990261480354","commenter_b":"Stupid Bitch","commenter_a":"She couldn't try to offer the woman comfort in her last moments on earth? This young woman is cold hearted.","post_message":"Caption under the controversial photo translates: “I went to do the rounds and this lady was dying so selfieeee.”"},{"comment_id":"10152975606714205","commenter_b":"Oh me and Lamar was talkin bout it all day lol","commenter_a":"Nae you hear about this??","post_message":"Rapper Rick Ross arrested after pistol-whipping a man."},{"comment_id":"10153333951429575","commenter_b":"We do.","commenter_a":"It's called intuition. But I'm glad it happened.","post_message":"\"I just said I need to go check on him working on the car. I just believe a spirit told me.\" She felt something was wrong with her husband--and she was right."},{"comment_id":"1143510442327091","commenter_b":"I will personally go to the Springs to make sure this woman is defeated in her next election period!","commenter_a":"Time for her resignation!","post_message":"“The true instigator of this violence and all violence at any Planned Parenthood facility is Planned Parenthood themselves.\""},{"comment_id":"789272967888144","commenter_b":"If you're here illegally you need to get the fuck out . Don't care how old you are or how long you've been here","commenter_a":"Kill yourself Santorum , you have no purpose and you spread the disease of hate.","post_message":"Santorum... Santorum... That name sounds vaguely familiar... But why?"},{"comment_id":"10153304564243525","commenter_b":"Typical knee jerk, fear based response. The terror attack in Paris was masterminded by a Belgian, not a serian. The NSA is a lot harder to get through than the security in Paris. What we need to do is acept the refugees, like Germany has done, and educate them on taking back their contry from the corupt regime AND ISIS.","commenter_a":"This is a very sad situation.","post_message":"#BREAKING Governor Rick Scott says Florida will not be willing to accept any refugees from Syria. Florida joins the growing list of states that have sent similar notices to the federal government. STORY: @webpagelink"}]
