[{"comment_id":"1184449068295865","commenter_b":"A greedy witch !","commenter_a":"Clinton just wants votes she doesn't care about the American People","post_message":"“He used every word in the book. Can you imagine if I said that?” asked Donald J. Trump."},{"comment_id":"937893629592518","commenter_b":"men especially infantry like women.. all i can see this now is rape allegations and pregnancy going UP, that and men are biologically inclined to put a women's life first. thus taking away from the mission at hand.","commenter_a":"@username @username intentionally weakening our ground forces. Not because women can't hack it (most can't) but because they will be a distraction for the males and a logistical nightmare.","post_message":"#BREAKING: In a historic decision, the U.S. Secretary of Defense has ordered all military combat positions to be opened to women. STORY: @webpagelink"},{"comment_id":"1766432363594674","commenter_b":"hillary a rothchilds criminal, she has already been selected months ago to be president all the sheep fall for it, see how the rothchilds find it easy to fool the easily lead with their controlled media","commenter_a":"Typical politician, first it's \"I didn't lie,\" then when the evidence piles up her statement quickly changes to \"I misspoke.\" Well, when you put it that way, I suppose you get a free pass...","post_message":"\"So I may have short-circuited it and for that, I, you know, will try to clarify because I think, you know, Chris Wallace and I were probably talking past each other because of course, he could only talk to what I had told the FBI and I appreciated that.\" - Hillary Clinton"},{"comment_id":"1135206533157482","commenter_b":"this isin't just people is it mr.president but our enemy vowing to destroy us and your actions importing these islamic terrorists into our city walls is aiding our enemy to carry out their evil intentions . STOP THE POISON IMPORTS NOW !!!!!!!!!!!!!!!!!!!!!!","commenter_a":"But of course. We discriminate against people based on their skin color .","post_message":"Persecuting Muslims is not the answer."},{"comment_id":"1061821787247406","commenter_b":"fact, king obama ignored our federal immigration laws and gave amnesty to millions of illegal aliens including the illegal that killed Kate steinle. had he enforced our laws and put a stop to san Franciscos sanctuary city policies that woman would be ALIVE today. fact, obama blamed cops before the facts came in about doin their jobs. cops were killed after his comments. had king obama stood up for cops and denounced black violence those cops would be ALIVE! wake up Cynthia. who's to blame for this mess? every MORON that voted twice for king obama. 😡","commenter_a":"so when king obama blames police for doin their jobs and cops get killed it's not king Obama's fault? when king obama allowed illegal aliens to invade our communities and then kill innocent Americans like kate steinle it's not king Obama's fault? you leftest are MORONS and HYPOCRITES. 😄","post_message":"\"People have to understand that hateful rhetoric and words and harassment of doctors and harassment of women going to health centers have real implications.\" -Planned Parenthood President Cecile Richards"},{"comment_id":"10153683499520530","commenter_b":"Whore","commenter_a":"DA FAQ??!!! Dump this girl she has no self respect .....she's probably screwing him behind his back","post_message":"He decked the guy after he touched his girlfriend's rear end several times. Now she's upset and wants him to apologize."},{"comment_id":"10153365976956955","commenter_b":"Political parasites.","commenter_a":"Anyone who signs new gun control legislation that infringes on the second amendments should be tried for treason","post_message":"HERE THEY COME: CONGRESS TAKES UP GUN CONTROL"}]
