[{"comment_id":"10153854087684087","commenter_b":"Bern bitch!","commenter_a":"@username savage lmaoo","post_message":"“Say what you want about Bernie. He doesn't quit. He's in there bitching,\" Donald J. Trump said."},{"comment_id":"701531266646721","commenter_b":"CORRECTION : THEY'RE NOT FROM AFRICA, SO THEY'RE JUST PLAIN OLD AMERICANS ... DAMN IT!","commenter_a":"Oversensitive black couple. Correction oversensitive African-American black couple.","post_message":"Oh the humanity!!!"},{"comment_id":"778166008983598","commenter_b":"Huge wall!","commenter_a":"Obama is the racist pos","post_message":"“Has anybody tried that wine? How good can that wine be?” President Obama poked fun at Donald J. Trump and the GOP at a fundraiser in Texas."},{"comment_id":"10152713641640496","commenter_b":"Amen, Laura ! AMEN.","commenter_a":"Sorry. I disagree. He sounds like a spoiled brat who realized that marriage takes work. Both people have to be willing to work at it. A real marriage is good. Hard sometimes. But good.","post_message":"How many of these do you agree with? @webpagelink"},{"comment_id":"680629115421379","commenter_b":"She needs to just go away already.","commenter_a":"We can let her become president","post_message":"Hillary Clinton slammed Donald J. Trump's \"I'm with you\" proclamation, writing on Twitter, \"Not included: women, African Americans, LGBT people, Muslims, Latinos, immigrants...\""},{"comment_id":"10152900283295950","commenter_b":"You're the little bitch","commenter_a":"First of all, why the hell are 5th graders getting diplomas???","post_message":"One by one, Trinecia Blacklock's fifth grade classmates were called to walk across the stage to get their diplomas. The wheel-chair bound student waited for her turn, but her name was never read aloud — and she was left alone, sitting by herself."},{"comment_id":"555137491342104","commenter_b":"HELLARY ROTTEN CLINTON IS A SEXUAL PREDATOR AND A RAPIST CRY BABY","commenter_a":"We won fairly and stop saying it was the russians and trump. Stop filling your head with media lies","post_message":"WATCH LIVE: Members of the Electoral College in Texas gather at the statehouse in Austin to vote for the president and vice president of the United States. One Republican elector, Chris Suprun, has revealed his intention to vote for John Kasich instead of Donald J. Trump."}]
