[{"comment_id":"10153401840176336","commenter_b":"idiot and she if she would have fell and killed herself, her family would be suing. Stupidity NEVER ends.","commenter_a":"To me the flag symbolizes opposing the fed. I think that unites me with a lot of those flying the flag. Blessed to have made it to south carolina.","post_message":"A woman was arrested after climbing the flagpole in front of the South Carolina Statehouse and removing the Confederate Flag. @webpagelink"},{"comment_id":"722432601238848","commenter_b":"Idiot bitch","commenter_a":"No clue what-so-ever.","post_message":"She doesn't have a clue, does she? No idea how totally ignorant she sounds. --Andrew"},{"comment_id":"10153901527564342","commenter_b":"I hope everyone that takes their child there see's this and takes their child out of there...I also hope they shut this place down and arrests that woman","commenter_a":"Their intention was to not hurt the boy yeah OK why didn't they stop when the little boy said it hurt. That's exactly why I do not put my kids in daycare this world is full of stupid people who don't care for our kids. Its not the daycares responsibility to scrub the kids face. Like really. They should face charges I'm sure someone else heard and seen that works with this stupid girl ugh this just really upsets me.","post_message":"The dad wants the daycare to face charges"},{"comment_id":"1063797583686996","commenter_b":"Giant vagina","commenter_a":"@username you","post_message":"It be like that"},{"comment_id":"10153051967106130","commenter_b":"Aqua man? Bitch please.","commenter_a":"\"Do you have a minute to hear about our lord and savior Jesus Christ?\"","post_message":"YIKES."},{"comment_id":"483635665160347","commenter_b":"Ban it out of our country!","commenter_a":"These black robe people are not making decisions that we like they need to Go.","post_message":"The Supreme Court just made a shocking ruling on Shariah Law. We must voice ourselves publicly, Shariah Law has no place in America. Do you agree Shariah should be banned?"},{"comment_id":"595288380595755","commenter_b":"We just had 2 bombings and a knifing involving these peaceful refugees after NOW RECEIVING OVER 10,000 of them and this idiot is still trying to sell them coming into our country! Well Obama you won't be in office next year and Trump is our mouth piece \" no vetting no refugees \" WE DONT WANT ANYMORE OF THIS CULTURE , ask Merkle in Germany about them, she said if she could go back and change her decision she would not have taken these Muslims in!!!!!!!!!","commenter_a":"He's wrong.........we have citizens right here that need our help first and foremost.","post_message":"President Obama says turning away refugees based on background or religion \"would be reinforcing terrorist propaganda.\" Agree or disagree?"}]
