[{"comment_id":"10153816638906336","commenter_b":"They were to busy kissing her big a**s.","commenter_a":"Wonder what kind of \"humor\" the View women shot at Michelle Obama?","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."},{"comment_id":"10155086722556323","commenter_b":"@username Will it be a big, beautiful wall?","commenter_a":"I can see the 'Jungle' camps with the immigrants around the NI border already :)","post_message":"Ireland prime minister has warned that avoiding a post-Brexit border is now vital for the republic national interest."},{"comment_id":"560003900832233","commenter_b":"Dont lose or give up your beliefs or faith..Those who seek to destroy your lives over a cake are the ones with deep rooted hate for anything good..And they want to call themselves victims of bullying..How perverted American have become when they hate their own and embarce filth as good..So busy hating Christians and not seeing that the Government have been taking yours rights away too..Hooray to the Muslims","commenter_a":"What's messed up is these people refused to back a cake for a gay wedding. The couple wasn't discriminated against. The kliens simply didn't want to participate in something they deem as sinful. How is that forcing their beliefs on them. So now they are out of business and the militant intolerant left made it happen. While our backward minded liberal pals are doing their best to persecute Christians at the same time and probably at this very moment Muslim bakers regularly turn away gays. These incidents do get reported but the liberal media refuses to report on them and the militant LGBT stay silent.","post_message":"A Daily Signal Exclusive: Bakers Facing $135K Fine Over Wedding Cake for Same-Sex Couple Speak Out"},{"comment_id":"10153956564519087","commenter_b":"@username She is a corrupt bitch that I would never vote for president.","commenter_a":"That's the only vote that I will give Hillary.","post_message":"According to Twitter, the most retweeted tweet of the third day of the Democratic National Convention was posted by Donald J. Trump."},{"comment_id":"1077408458966678","commenter_b":"Malyk Bonnet, how fortunate for that young woman that you trusted your indtincts and took some very brave action. You ARE a HERO!!!","commenter_a":"Benjamin Fournelle Sylvie Bonin","post_message":"This teen had a hunch, so he hopped on a bus to a different city. He might have saved a life. - Robbie Couch"},{"comment_id":"10153228124522235","commenter_b":"You scaring kitty. You BAD man.","commenter_a":"Scum!","post_message":"Convicted felon, Tom Delay, crawled out from under his rock to share his very important opinion about rights and liberties."},{"comment_id":"587659781407559","commenter_b":"I bet those predestinarians didn't know anything about her past !","commenter_a":"Please just drop out Hillary! Give Bernie a shot!","post_message":"A special moment with a (new!) supporter and his mother in Henniker, New Hampshire."}]
