[{"comment_id":"10155209080925652","commenter_b":"mast! :D","commenter_a":"Ashay Gangwar @username check this out!","post_message":"These maps offer the most enjoyable route, not the fastest:"},{"comment_id":"1143931678960194","commenter_b":"Say Ms white woman...dismissed!","commenter_a":"Idiot!!!! Every race suffers racism!! And all lives matters. Not just blacks. An American is an American! I'm not a Caucasian American! They shouldn't say African Americans either. Get with this century!","post_message":"Clinton: \"We need to acknowledge some hard truths about race and justice in this country, and one of those hard truths is that that racial inequality is not merely a symptom of economic inequality. Black people across America still experience racism every day.\""},{"comment_id":"10155284668713268","commenter_b":"Who the fuck cares, did it have anything to do with this country?","commenter_a":"How long before he has a stroke a day realizes he is being uaed","post_message":"\"This is a direct attack on [Pres. Trump's] policies and her [Ivanka Trump's] name,\" Press Sec. Spicer said on Weds. regarding Nordstrom's decision to drop Ivanka Trump's fashion line. @webpagelink"},{"comment_id":"10154333518999641","commenter_b":"It's about time america should have their own female leader, if they truly wanted a real change, that lady touch would make a real difference for a great nation to reach further.","commenter_a":"VOTE FOR HiLLARY CLINTON 2016 . Hillary for America","post_message":"\"We just put the biggest crack in that glass ceiling yet.” - Hillary Clinton appears via satellite at DNC in hat-tip to history @webpagelink"},{"comment_id":"10155023002574740","commenter_b":"Leave that girl alone","commenter_a":"Shepard Smith Reporting Donald Trump President of USA doesn't want the media or anyone announcing his plans to defeat Isys enough already of selling our plans out globally, do like Donald Trump says we're going to take action without letting them know when, stop @username with telling Isys our plans","post_message":"The Office of Government Ethics is asking The White House to investigate Kellyanne Conway over her remarks regarding Ivanka Trump and Nordstrom. @webpagelink"},{"comment_id":"882098448492244","commenter_b":"I think this witch would sell her own Daughter for a ticket into the white House . How many Free rides will this traitor Promise to illegal criminals to get her to her socialist/communistic palace . ??????","commenter_a":"NO NO NO .DO NOT ELECT THIS PERSON.","post_message":"Hillary can't keep track of what she says!"},{"comment_id":"10153364221881336","commenter_b":"Hey, when you choose to try to make your family into some kind of viral internet sensation, be prepared for the backlash.","commenter_a":"Hahah I think it's cute","post_message":"Did these parents take their family photo shoot too far?"}]
