[{"comment_id":"10156021598895354","commenter_b":"And she is a witch and should be hunted-certainly not a good witch-her broom needs to be parked","commenter_a":"To think Obama and Bill Clinton are playing golf tpgether. I guess they feel shes going to jail anyway.","post_message":"So wait, you're saying Obama's Justice Dept. is conducting a politically-motivated witch-hunt via the FBI??? #NiceTry #LiberalLogic"},{"comment_id":"950144531689554","commenter_b":"pathetic drama queen!!!","commenter_a":"Let's remember who this guy is....his history, his previous shows, his personality, his tweeting naked pics of himself....self-absorbed little twit!! he is one of the reasons I am not watching Fox News as much as I once did. He's a twit and he's all about the legalizing all illegals.....as he calls it, the \"Brown Tide\".","post_message":"After Trump adviser called Geraldo an \"embarrassing hack,\" the Fox News correspondent threatened violence."},{"comment_id":"10153907295491680","commenter_b":"@username your a bitter woman","commenter_a":"Another classless moron that thinks sexual abuse is ok 👌 way to go Rush, you are pathetic","post_message":"\"Men brag,\" Rush Limbaugh said on his long-running radio show."},{"comment_id":"10153666146819099","commenter_b":"Shut up you dumb broad","commenter_a":"Get guns off the street. It's time for stricter gun laws.","post_message":"A 30-year-old wanted criminal with 12 prior incarcerations allegedly shot a 33-year-old NYPD officer in the head in East Harlem, authorities say ----> @webpagelink"},{"comment_id":"881160988599592","commenter_b":"let her keep diggin that hole","commenter_a":"Why would anyone bother to talk to her about them, they know she will just lie, lie and oh did i say this? She lies!!!","post_message":"Do you care? Clinton Camp: Nobody cares about the Hillary Clinton email scandal @webpagelink"},{"comment_id":"1159085570778138","commenter_b":"No the Great Wall did not work. Mongols had no problem getting over it.","commenter_a":"Nothing But Crap. Christie came out strong when he was elected Governor but it's been all down hill since. Why talk about Brady, not even his State. As for the wall, it worked for thousands of years for China. Plus it's a hell of a lot cheaper than what it is costing us in welfare, medical, food stamps, crime, law enforcement, prisons..... Put the people collecting welfare to work, take the young men like the CCC and WPA days. Bring our military home and build the wall.","post_message":"“Please, please, please do not fall for the idea that we are going to build a wall along the entire 2,000-mile border of the United States and Mexico ... It’s not feasible. It’s not practical. It’s too expensive. And by the way, I’ve never seen a fence or a wall that if a human being wanted to get over or around it that they couldn’t.”"},{"comment_id":"767374910062356","commenter_b":"Yes!","commenter_a":"Lord help us she is just like Obama.","post_message":"Can we PLEASE learn from last time?"}]
