[{"comment_id":"10153480166187235","commenter_b":"Oh,COME ON! In ALL of Florida there wasn't ANYTHING happening that was MORE illegal than two CONSENTING adults having SEX? RIGHT.😑","commenter_a":"Huh. If everybody who had ever had sex on the beach went to jail, well, spring break in Florida would be much less popular.","post_message":"Reminder: No one involved in the mortgage scandal has served a single day in jail."},{"comment_id":"1386744544690006","commenter_b":"That what girls do","commenter_a":"Fucking coward .. hits him as soon as he ain't lookin","post_message":"He did not see that coming (via PrattCity Savage) #WSHH"},{"comment_id":"829720727076952","commenter_b":"Where all snakes live","commenter_a":"The fall of Ramadi to ISIS demonstrate Obama's success.","post_message":"Must be a comfortable rock the White House is living under..."},{"comment_id":"1060076290679393","commenter_b":"I believe you! Just saying IMF found some crazy monetary practices. Matching 8% would create a crazily unsustainable and unattainable and unrealistic economic goal. We had our state government promise such riches for a 20 year period to public employees and it's not a practice followed and linger because we have had to fund that same crazy generosity despite economic ups and downs. This created alot of resentment as courts say we must continue to fund these government employees who gave themselves this great pension!","commenter_a":"This is just like Greece, nepotism, expensive payrolls and pensions created to benefit a few individuals and their families while real public needs are neglected...this is the opposite of socialism @username","post_message":"The budget crisis faced by Illinois is dire - the state government itself is drowning in $37 billion of debt. Read more: @webpagelink via Special Reports"},{"comment_id":"714217398680845","commenter_b":"Kill all the bad muslims!!","commenter_a":"Muslim POS","post_message":"And he's wasting no time launching his attack..."},{"comment_id":"536487383205696","commenter_b":"Here's some facts for you Gerry - I NEVER want to be someone's \"arm candy\", I will NEVER marry for money and I don't have relationships with people because of the way they look. I do agree with you when you say we are our worst enemies, but that doesn't give you the right to generalise all women. Unless you're happy to be lumped with the guys that are shallow and only date women with big breasts","commenter_a":"Who the hell cares if she is pregnant? unfortunately women are their own worst enemies, happy to be arm candy of some of the most groteste males alive,providing they are millionaires, fact!","post_message":"Jennifer Anniston has said we’ll be the first to know if she's pregnant. Writing for The Huffington Post, the actor blasted the “sport-like scrutiny” she lives under, saying it’s indicative of society’s warped view of women which sets a dangerous example for girls."},{"comment_id":"10153259767028132","commenter_b":"Go back to stinky Bay City!","commenter_a":"Who cares about Madonna. She looked horrible at the Grammys and she has no room to talj","post_message":"Madonna is not a Fifty Shades of Grey fan."}]
