[{"comment_id":"1156042484488515","commenter_b":"Amen.....She is a disaster ... vote Trump!!!","commenter_a":"Mr. Hannity. you can talk this forever and they will not change. It is sad really. Appreciate your efforts and continue with your hard work exposing what is wrong with politicians. All of them!","post_message":"\"It's a choice between Donald J. Trump, a candidate who says he'll drain the swamp in Washington and bring about real change, or Hillary Clinton, the most corrupt career politician who's ever run for this office.\" – Sean Hannity"},{"comment_id":"1639973446062778","commenter_b":"Fucking bitch...outsmarted herself and all her dumb ass supporters!","commenter_a":"I thought it was us racist white people truth is you did not deserve to be our president because we don't trust you your record suck your forein policy was terrible and caused so much death your husband disgust me and you lied about your server when you bleached bit your emails to hide your crimes blew it for you but what you did to our heros in Benghazi was the worst then to cheat in debates with Donna showed us your still the sneak we all know you are. Go away already your done","post_message":""},{"comment_id":"10158061833465354","commenter_b":"White bitch bahaha!","commenter_a":"Samantha Bee can blow her fuckin brains out for all I care. Lamestream shill. Stop feeding her.","post_message":"Dear Democrats, Please, PLEASE keep up your trashing of the 60,000,000 Deplorables who elected President-Elect Donald Trump. With every smug, arrogant, elitist, hyperbolic swipe you take, you further confirm why We the People rejected you in the first place. So please, keep it up! Sincerely, The Deplorables"},{"comment_id":"10152791090146523","commenter_b":"Feminist BS","commenter_a":"See, it doesn't just happen on college campuses. Young men learn young that sex is their \"right\" and if they want it, they take it. And then the girl gets blamed. Why do we focus on young women keeping themselves \"modest\" but do not focus on teaching young men to respect women and keep their pants on?","post_message":"17-year-old Muskego boy accused of sexually assaulting 15-year-old girl at underage drinking party."},{"comment_id":"10153278538947293","commenter_b":"Mark no I meant auto, you just need a permit which is easy to get in Oregon","commenter_a":"For most of you who have never heard of Roseburg and are assuming that ucc and \"Umpqua\" are gun free areas...1: You are ignorant.. 2: Umpqua isn't a city it's a forrest that spans way farther than Roseburg and 3: Off the top of my head, I can think of at least 10 public places (that are NOT shooting ranges) in a 5 mile radius of ucc that people normally goto to discharge their automatic weapons.","post_message":"A U.S. official has identified the gunman in the Oregon community college mass shooting as Chris Harper Mercer."},{"comment_id":"10154430644149411","commenter_b":"Wow and the racism starts. Why am illegal cause I have a latino last name? That's exactly the type of ignorance Trump types bring to the table. Also white pride has far deeper roots tied to hatred in this country. If anything you just proved my point. When KKK have rallies it's freedom and of speech. But if latino or black communities have groups such as black panters it an extremist hate group. You people are really stupid because your racism.is exactly what is creating the modern resistance. So keep on hating and bring more peope to my side..what you think after centuries of white dominance we wouldn't eventually get tired of that shit and start fighting back?","commenter_a":"Look here's what it is. The same people that like Trump ate the same people that make Obama watermelon jokes. It's all about white privilege for you guys. What's really behind Trump's popularity is the fear that white people's dominance is being threatened. \"But Ray,\" you'll say, \" there are plenty of minorities that support Trump. \" to which I say, that the US has done an excellent job of scrubbing away people's culture and heritage and whos propaganda has thoroughly brainwashed people into extremely nationalism. Cause guess what there are plenty of white people that are against Trump as well. Face it. Trump's entire campaign is based on xenophobia and white pride may ad well be his slogan.","post_message":"'It's also to show solidarity with all the people he has tried to harass and point out we are still here and not going anywhere'"},{"comment_id":"10154557994494087","commenter_b":"She is a lunatic! Ugh","commenter_a":"Jeff Sessions was that racist that prosecuted the KKK and has many black friends who defend him, yet Senator Warren throws the racist term around while pretending to be a native American? I don't get it. If you just hate someone just say it. Calling him a racist simply makes Ms Warren a racist and someone who stole from native Americans in order to further her financial coffers. You ma'am have Skelton's in your closet, live in a glass house yet you cast the first stone. Remember those HS days and your words Senator Warren.","post_message":"Elizabeth Warren: “Consider this MY warning: We won’t be silent. We will speak out. And we WILL persist.”"}]
