[{"comment_id":"843323745763879","commenter_b":"I do Tim!! I don't care that gays get married & I wouldn't dare force a female to give birth to a baby she doesn't want!!","commenter_a":"i thought you guys hate christians","post_message":"Oh, the irony!"},{"comment_id":"1092357044118639","commenter_b":"Except the assholes wouldnt drown. They'd just move to your neighborhood. I'd rather have them where they are right now.","commenter_a":"So basically where all the assholes in the U.S. live would be underwater. Anyway we can make this happen overnight?","post_message":"Would your city survive? What would Earth look like?"},{"comment_id":"10156915494530231","commenter_b":"Black woman=weapon of black mass destruction. -END","commenter_a":"Yeah, this dude SHOULD NOT marry you. If you're more concerned about him spending thousands of dollars on some stupid ring (a token of a totally outdated custom that was invented by DeBeers in the first place to sell diamonds that Africans have to DIE to mine) then you are with your relationship -- he should look elsewhere for someone who isn't a shallow golddigger.","post_message":"Here are a few tips if you find yourself in this situation. #AskDemetria"},{"comment_id":"10152735674121051","commenter_b":"This is a shame so many good women cant have kids but trash like this has them!","commenter_a":"ALABAMA...what else is there to say..........","post_message":"One look at this baby’s blood test and officials immediately ordered that the mom be arrested."},{"comment_id":"1154241914613147","commenter_b":"Maybe that dickwad should of been aborted.","commenter_a":"The faux outrage is big with this one. Who gives a crap.","post_message":"“How the hell do you think this joke is OK?”"},{"comment_id":"941299175911870","commenter_b":"Trio does not exist.. Just close borders of USA. And Americans go home please.. .","commenter_a":"But why? Much as I hate usa n what it stands for, what it does n how it treats my fellow african brethren, I still don't want it to cease to exist. What kind of sick minds wish such a thing? I'ld understand if z nazis felt zat way, for if it weren't for z Russians nazism would've triumphed, God knows for how long!!! But, why usa? Is my theory of kkk/nazi/zionists existence n zer devious work at z root of things once again? For me z 'trio' are one n z same!!!","post_message":"A top official in Moscow says Washington’s aspiration is to see Russia cease to exist as a country."},{"comment_id":"543880552475480","commenter_b":"Let a family move in with you. We The People are tired of paying high taxes for to pave a way for illegal aliens from any country while our veterans are living in the streets and receiving poor healthcare.","commenter_a":"These people shouldn't be here anyways. I am all for the people that are here illegally staying and becoming residents. Most of these people just want a better life for their kids and they are productive, hard working members of society","post_message":"THIS JUST IN: Donald J. Trump in his first post-election interview said he's willing to deport or incarcerate 2-3 million people in the country illegally who \"are criminal and have criminal records...\""}]
