[{"comment_id":"537543736410961","commenter_b":"Elizabeth Warrren for VP on a Sanders/Warren ticket!","commenter_a":"Another socialist","post_message":"“I think that what the Democrats are doing is terrific,” Sen. Elizabeth Warren said. \"We’re out talking about the issues. I look at the Republican debates and the difference between what they’re doing and what the Democrats are doing that really shows who’s on whose side.”"},{"comment_id":"10152742769151167","commenter_b":"Rihgt Michael...just another Fox News whore","commenter_a":"Speaking as a Jew, I think someone needs to kick Tarantula upside her head.","post_message":"Vile."},{"comment_id":"10153549578273984","commenter_b":"Kims a whore so who cares","commenter_a":"If killing people make me happy, should I go around and do it? No. I hate when people say, do what makes YOU happy. Hmm. That can apply to a lot of things which are wrong. We should do what makes the Lord happy.","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with... Do you side with Megyn Kelly on this one?"},{"comment_id":"10152815775186680","commenter_b":"she looks like Michelle Duggar!","commenter_a":"She wants ANOTHER wasted 15 minutes...go away...","post_message":"“There is no way that she did not know what was going on, that women were being abused and accosted by her husband,” Jones said."},{"comment_id":"10153476732498132","commenter_b":"She can't sing or act....","commenter_a":"She's still hotter than Kim Kardshian and she has talent.","post_message":"She must be a magician with double-sided tape. #MetGala"},{"comment_id":"1242326225802834","commenter_b":"There are many exceptions to this, these comics are just to stir shit up, and promote dissatisfaction, imo. Live your life to the fullest and stop getting offended so much. It's not worth it, spending your life on this planet worried about what some shithead says or thinks about you.","commenter_a":"Hey ATTN, did you know there is a mass extinction going on globally? Maybe your perceptions of gender roles can take a back seat and you can do something more useful with your time.","post_message":"The double standard is all too real."},{"comment_id":"388738841314410","commenter_b":"Go home , get out of USA !","commenter_a":"GOAT HUMPERS","post_message":"Muslim Leaders Show How ALL Muslims really think...."}]
