[{"comment_id":"1397503370290352","commenter_b":"Shellie","commenter_a":"Hahahaha fool","post_message":"Absolutely Hilarious... Spread this everywhere!"},{"comment_id":"10153845270776167","commenter_b":"Joe make up your mind, can't have it both ways.","commenter_a":"Joe. That's the dumbest lie You've told. And that's sayin somethin","post_message":"Even small children would call this excuse nonsense."},{"comment_id":"10154777033398128","commenter_b":"Are you jealous?","commenter_a":"Elvira Jaha","post_message":"London Calling: The U.K. has become the cheapest market in the world for luxury goods."},{"comment_id":"680890588768186","commenter_b":"Close them all down and get rid of all the Muslims!!! They dont belong here in Our Country!!!","commenter_a":"Donald Trump is our man and he has the balls to stand up and speak his mine for the people to help us to clean our house and to put the people who made this mess were they belong. We need to get our country back in working conditions. Get our school back saying the pledge ALEIGENT and believing in God again. So let's get our flag flying high and our spirits back. And this rotten president out with his terrorist people and kicking all to the curve (this mean get them the hell out of our Country they destroy our country enough. ).","post_message":"Donald Trump announced his plan to close Mosques, but keep watching. Muslims everywhere are furious. But he doesn't care. Do you support Donald Trump?"},{"comment_id":"1130006897113975","commenter_b":"Get out of America then","commenter_a":"It is a sad day in America. One of the most disgusting men in in our country won the election. I am so sickened by the citizens who would cast their vote for such an evil man. Do they really feel he is person to speak for us as a nation. I find him so repulsive by his words and actions.","post_message":"THESE 23 HOLLYWOOD IDIOTS PROMISED TO MOVE IF TRUMP WINS..... LET'S HOLD THEM TO IT"},{"comment_id":"1345530805539970","commenter_b":"@username again you also admitted to being a bitch so....","commenter_a":"It's funny that all these bad ass, gun toting, 2nd amendment conservatives seem to have no problem becoming Russia's bitch","post_message":"LOL! Thanks to Andy Borowitz for this helpful advice for Trump..."},{"comment_id":"10153250521056509","commenter_b":"It's not just FL, horrible people live everywhere...","commenter_a":"Why does so much f*d up sh*t happen in Florida!?!?","post_message":"A 5-year-old Florida girl was killed after her father tossed her off a bridge from his car, police said Thursday. @webpagelink"}]
