[{"comment_id":"10154429812461051","commenter_b":"Damage fags","commenter_a":"Impeach Trump","post_message":"The World Bank claims Trump could be the best thing to ever happen to the American economy. Do you think they're right?"},{"comment_id":"10152604943386615","commenter_b":"Ladies*","commenter_a":"It depends on if you see someone at the gym wearing them, or someone at Walmart...","post_message":"Lawmaker says yoga pants should be illegal: @webpagelink"},{"comment_id":"995263523875544","commenter_b":"And u look like what came out of my anus this morning, except not as attractive...","commenter_a":"Her face looks like the whole butt!","post_message":"Rosie O’Donnell unloads on Donald Trump..."},{"comment_id":"10154236838279228","commenter_b":"Very interesting.","commenter_a":"EricBlakeburn Olivia Kesselring","post_message":"A UFO incident near St. Louis captured worldwide attention 15 years ago. Many of the witnesses were police officers."},{"comment_id":"744192892380562","commenter_b":"Jerome-- a mole? Are they all?","commenter_a":"Close the borders. With all due respect congressman, only idiots would even consider calling military age men \"refugees.\" Our borders have been poorly managed that it is impossible to tell who has infiltrated my America. Seems that Congress has chosen to remain totally mute on this issue. Obama bashing does not hide the fact that inaction equals compliance.","post_message":"It's frustrating that President Obama refuses to shift his strategy to defeat ISIS. The horrific attacks in Paris are evidence that the current strategy to defeat ISIS is not working. I discussed this earlier today on Fox Business' Varney & Co.. Watch below:"},{"comment_id":"1044417148951095","commenter_b":"Ignorant bitch","commenter_a":"It's not people like this woman that scare me, it's the people that agree with and support her.","post_message":"Oh, and climate change is a hoax too!"},{"comment_id":"10153875721181770","commenter_b":"She is sipping Hillary juice.","commenter_a":"Nancy Pelosi IS a train wreck - so I would expect nothing less!","post_message":"Nancy Pelosi's Sunday morning interview on CNN was an absolute train wreck..."}]
