[{"comment_id":"1062577053802042","commenter_b":"She looks like the kind of woman who would beat up a man alright. Man, that face is the stuff of nightmares!","commenter_a":"Domestic violence in the Clinton home?","post_message":"Does Hillary beat up Bill?"},{"comment_id":"1747275395512005","commenter_b":"@username if it isn't Mr. Trump YOU will be voting in Hillary","commenter_a":"The only thing that needs to change is HIM OUT OF THE WHITE HOUSE.","post_message":"Obama says \"we\" need to pray for the \"strength to change.\" It's yet another of his disgusting refusals to acknowledge the realities we face."},{"comment_id":"10153395170866162","commenter_b":"Alien had azz. Kmsl. Female leaves there kids with anyone for bad love..","commenter_a":"Shaun Sullivan look at this guys head. wtf","post_message":"DISTURBING: A 19-year-old man is charged with the murder of 2-year-old girl whom he was babysitting @webpagelink For the stories you care about -\" like\" ABC 7 Chicago!"},{"comment_id":"10157219301315354","commenter_b":"Round up all illegals as soon as possible.","commenter_a":"Now we tolerate Mexicans and all kind of low life's stomping and burning our flag while stand silent and do nothing . Wake up America.!!!","post_message":"***IN HONOR OF EVERY SOLDIER, SAILOR, AIRMAN, MARINE, & GUARDSMAN WHO DIED DEFENDING FREEDOM***"},{"comment_id":"1166947526658609","commenter_b":"I am a Democrat and I will not vote for this woman!","commenter_a":"the bride of frankenfood. no mercy.","post_message":"Is she in trouble?"},{"comment_id":"10156862030995389","commenter_b":"Governor Mike Huckabee said it best....If Ted Cruz isn't guilty of affairs with the five women, then he should bring charges against the National Enquiry. Otherwise, there may be something to it!","commenter_a":"Barf!!","post_message":"Get free tickets for Sean’s EXCLUSIVE event with Donald J. Trump in Milwaukee, Wisconsin MONDAY, April 4th at 5p ET. @webpagelink"},{"comment_id":"10158293361345725","commenter_b":"Well mother nature must be a murderer because women spontaneously abort all the time. It's called a miscarriage.","commenter_a":"Although I consider myself a Progressive, I have to agree that abortion is murder. That is one thing that I agree with the Republicans. Not because of their political beliefs but me as a human being. Murder is murder and we shouldn't give permission to commit it.","post_message":"Ohio Governor John Kasich has signed a bill imposing a 20-week abortion ban, in a prelude to the broad offensive abortion-rights opponents plan to launch across the nation in January."}]
