[{"comment_id":"10153899191016770","commenter_b":"another nasty women I guess..","commenter_a":"Real smart people those LDS folks, sarc. Seriously,when the Supreme Court turns liberal full progressive, your little LDS church will be doing homosexual marriages, allowing non Christians to come to your places of worship, oh, I can't imagine the world of hurt the LDS is in for. Oh well, principles and all. Good for you, bless your heart, y'all just so pure as the wind driven snow.","post_message":"Latest Poll: This Conservative State Now Has Trump In Second Place. Wait. What? @webpagelink"},{"comment_id":"985973531519425","commenter_b":"All republicans should stand behind \"the people's \" choice!!!","commenter_a":"Who needs him I hope he gets fired","post_message":"What do you think? Is it too late? @webpagelink"},{"comment_id":"1232095813528626","commenter_b":"Deplorable bitch","commenter_a":"Corrupt politician","post_message":"I want to see what you all come up with... Describe Hillary in just two words... Ready, set, go!"},{"comment_id":"10154476724188352","commenter_b":"On God I'll beat this hoe up!! Sick twisted bitch","commenter_a":"Wth","post_message":"Toddlers found chained up in Texas yard covered in hundreds of wounds are now in an 'excellent' foster home and are 'eating like they have never seen food before'"},{"comment_id":"1369422333077793","commenter_b":"Witch Hillary and hubby slick Willie..","commenter_a":"#Trumphasmyvote","post_message":"Is there any stopping Hillary Clinton and Donald J. Trump now? Let's take a look at the math."},{"comment_id":"10152617466356680","commenter_b":"For those who want to deport, are the GOP taxpayers going to pick up the $50 billion tab? Dems won't because anyone with a brain knows the addition of these people into legal residency will boost our economy.","commenter_a":"Obama, siding with illegals against Americans, yes, Obama DOES NOT LOVE OUR COUNTRY.","post_message":"President Barack Obama is calling out John Boehner for not bringing comprehensive immigration reform up for a vote in the House last year."},{"comment_id":"10153083977090950","commenter_b":"The costume? Stupid. Offensive? A man who think he's a woman when NUTURE decided MALE for him and no amount of procedures will change his MALE DNA. That's offensive. What is he a salmon? Science needs to come up with some kind of rehabilitation approach or program to try and fix this social diseases, including homosexuality.","commenter_a":"Why not it's holloween nway haha","post_message":"The \"Call Me Caitlyn\" costume faced Internet backlash, with some calling it \"transphobic.\" Stores, however, think the outfit \"celebrates her.\""}]
