[{"comment_id":"10153706783614218","commenter_b":"Go suck you mother","commenter_a":"Judge Barry williams came to his decision based on fear of rioting and unrest...thats not how the justice system is supposed to work you cant be bullied by a bunch of idiots in the streets chanting lies","post_message":"#BREAKING #FreddieGray Judge denies motion to dismiss charges against 6 police officers in death of Freddie Gray. He also denied a motion for State's Attorney Marilyn Mosby to recuse herself. Follow live updates: @webpagelink READ more here: @webpagelink"},{"comment_id":"598047807050178","commenter_b":"@webpagelink/ maybe you should wake up","commenter_a":"This action taken against this marine n my opinion is shameful n should b a wake up call 2 the AMERICAN people !!!! WAKE UP AMERICA !!!","post_message":"Marine Arrested For Saying THIS About Obama [VIDEO]"},{"comment_id":"864266033622421","commenter_b":"Guaranteed Chris Matthews is paid off. GUARANTEE IT!!!!!!","commenter_a":"Oh boy...Jorge","post_message":"Watch the DNC chair squirm when asked about the difference between Democrats and socialists: @webpagelink"},{"comment_id":"1728764820743963","commenter_b":"That lady is just jealous because she is a mean n nasty lady n because she COULDN'T do it she has to be a d-bag....good job Bindi","commenter_a":"People are very cruel. God bless you bindi and your family. You were amazing and your dad was watching you sweetie .","post_message":"Oh no... I'm praying for Bindi Irwin."},{"comment_id":"10152876050286680","commenter_b":"@username is a RACIST!","commenter_a":"It's amazing how anyone like the ultimate pre-millennial distributionist, Neocon, evangelical, can spout his bilge and people think he's accomplished something. If Cruz is the best this nation can do, we are done. We don't need pontificating, and pandering to Christian values. We need leadership, a complete change in course to get our government working for the people again. I don't see it happening. Cruz belongs at a shatuaqwa tent, not the Oval Office. He cost us 24 billion in a phony shut down, could care less about health care for the middle class or poor, voted against Veterans benefits increases and VA spending. He's a charlatan, and the Elmer Gantry of the GOP.","post_message":"Ted Cruz killed it at the conference of social conservatives. And Marco Rubio fell flat."},{"comment_id":"10152998520246037","commenter_b":"Rules are rules. But the airline's inconsistency in enforcing those rules is the real issue. It was ok to hold the child on the way down, it should have been the same on the way back. BUT I find the attention mongering of this mom downright pathetic. Totally disgusted. Not everyone is a world traveler, and I also get confused by the ever changing rules of the sky. Seems to me the mom holding her daughter was pretty clear that now she knows the airline's policy she will have a safety seat with her in the future. No further big deal made of it, issue was put to rest. Until this attention whore feels compelled to one-up her and try to publicly shame her. Disgracefull, classless and pathetic. If the woman went on and on and on about how she should be allowed to hold her child anyway, Yada yasa ...","commenter_a":"I agree with most of you, if she has a child with special needs then they shouldn't have been seperated in the first place. Secondly if the flight attendant had let that happen and something happened, then who would've been at fault then??","post_message":"\"The attention mongering schemes of Elit Kirschenbaum, who took to Twitter last week lambasting a United Airways flight attendant for refusing to allow her to hold her disabled three year old daughter on her lap during take off, make me want to puke.\""},{"comment_id":"10153365745456749","commenter_b":"playing to the media.. he has done more to MAKE it happen again than anyone in history","commenter_a":"ALLAHU AKBAR!!!! #MMBR #M23BR","post_message":"\"In memory of those we lost, we resolved to shape a world where events like those of September 11, 2001, could never happen again, and we see this unbreakable spirit live on every day across America.\" —President Obama"}]
