[{"comment_id":"1766432363594674","commenter_b":"hillary a rothchilds criminal, she has already been selected months ago to be president all the sheep fall for it, see how the rothchilds find it easy to fool the easily lead with their controlled media","commenter_a":"Typical politician, first it's \"I didn't lie,\" then when the evidence piles up her statement quickly changes to \"I misspoke.\" Well, when you put it that way, I suppose you get a free pass...","post_message":"\"So I may have short-circuited it and for that, I, you know, will try to clarify because I think, you know, Chris Wallace and I were probably talking past each other because of course, he could only talk to what I had told the FBI and I appreciated that.\" - Hillary Clinton"},{"comment_id":"1756908037896244","commenter_b":"No! just let them leave our Country.","commenter_a":"Mega bucks to play ??? Go out and really work !!! Ha ha!","post_message":"If they want to disrespect our nation, then they can leave. Anyone who doesn't want to stand for our national anthem on game day should be kicked from the league. Do you think these ungrateful players need to be taught some respect?"},{"comment_id":"10153423597850779","commenter_b":"Who is that chick on the left","commenter_a":"Sasha Banks, who is the by far the best wrestler male or female in the WWE, is Snoop's first cousin. I'm guessing a storyline should emerge.","post_message":"WWE has confirmed that Snoop Dogg will be inducted into the WWE Hall of Fame's celebrity wing, joining a list of alumni that includes Pete Rose, Mike Tyson, Arnold Schwarzenegger and Donald J. Trump."},{"comment_id":"691444044379507","commenter_b":"Hate Crime.. All of these black criminals are Racists","commenter_a":"This is bullshit! There's hundreds of incidents happening everyday! Want to be fair put them all up everyday!","post_message":"A white father and son were killed by two black teens and there are no riots. The media is completely one sided. Race Baiters are the problem. Do you agree Al Sharpton is the problem not the solution?"},{"comment_id":"10155424731863812","commenter_b":"Build a wall, a big wall....","commenter_a":"Take our crazy liberals please. Go Trump !","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"},{"comment_id":"1497908770268866","commenter_b":"Alina is converted or living with muslims , check her page.","commenter_a":"A mother of 3, just 26 years old..... Makes me wonder about her story. Don't believe everything you read in the media. If she really got raped the men must be punished, simple as that. Shouldn't she have stayed at home with her children in the first place in stead of wandering the streets? And going out all by herself without a friend? Mmmm","post_message":"Raped by 'migrants from Iraq, Syria and Bahrain' after her drink was spiked"},{"comment_id":"10154490537796509","commenter_b":"Hillary will not even go on FoxNews because she is afraid of the questions. Trump is on every liberal channel.","commenter_a":"Very good luck for Hillary clinton...MY she beat all her contestants...especially Donald Trump...","post_message":"Donald J. Trump's campaign attributed the decision to pre-existing campaign engagements, but it's likely to reignite discussion about the longstanding feud with Fox News and with Megyn Kelly."}]
