[{"comment_id":"1081267351952171","commenter_b":"@username WHO IS TRUMP RACIST TO....I WANT AN ANSWER....IF YOU ARE GOING TO SAY IT AND BELIEVE IT THEN YOU CAN TELL THE REST OF US","commenter_a":"Why would anyone vote for her after everything she's done has been exposed? She is not for the American people. Benghazi was enough for me to say #nohillary her plans to continue Obamacare, my vote is a NO, setting up a private server in her home where classified information on an unsecured server putting OUR safety at risk (then lying about it) that's a No. Claims she will fight for the children out of one side of her mouth and supporting late term abortion out of the other. #notwithher. The Clinton foundation taking donations from countries that abuse their woman and children, yet she believes in equality for women?? No way , never ever Hillary. Donald J. Trump for POTUS!!!","post_message":"\"She’s going to open the borders, pack the Supreme Court and you are not going to have the same country. Maybe you like that, maybe you don’t. But we’re not going back to the status quo, period. And so Republicans need to understand if Trump loses, it is a new America, OK? A lot is on the line, whether you like him or not. That is real.”"},{"comment_id":"1107053186021095","commenter_b":"Woman enjoy sex more than man but how ? I cant beleive that","commenter_a":"Actually women enjoy sex even more than men, so leave them alone. Nature has to reward them more since they have to invest more in the fruits of the sexual act both during pregnancy and after birth.","post_message":"She started the affair when her teenage nephew came to live with her in 2008"},{"comment_id":"1776660905952346","commenter_b":"Pure, concentrated trash.","commenter_a":"Wow. I would be better of going to Hough and Central and picking something up, thank you.","post_message":"BLOWJOBS FOR HILLARY?"},{"comment_id":"1231714623549367","commenter_b":"She will fit in better there, anybody who watched Fox on election night knew how desperately she wanted Hillary to win!","commenter_a":"Good bye bye democratic stooge","post_message":"BREAKING: BUH-BYE MEGYN…The Woman Who Miscalculated Her Power With Viewers Is Leaving FOX To Join Liberal, Anti-Trump NBC"},{"comment_id":"10154872503577042","commenter_b":"If the child is deemed not viable for life outside the womb they will grant an abortion however get this there is nothing written into this law to protect the mother or take her health into consideration at all. It is a disgrace!! Turning women into human incubators whose body is controlled by the government.","commenter_a":"Wow are people really so uninformed? What if the baby has a condition incompatible with life or if the mother's life is at risk? What if it's an ectopic pregnancy that isn't always known by 6 weeks?","post_message":"Ohio lawmakers have passed a bill that would ban abortions in that state from the moment the heartbeat of a fetus can be detected."},{"comment_id":"10152609366937093","commenter_b":"Stfuh","commenter_a":"What a disrespectful jerk! You're lucky Saul that she didn't arrest you right there on live TV. You don't put your hands on an officer PERIOD!","post_message":"RAW & UNCUT: A sheriff's deputy didn't like where FOX 4 News reporter Saul Garza was standing during his live shot this AM.... then this happened.... @webpagelink"},{"comment_id":"714166885416447","commenter_b":"Most evil woman on the planet","commenter_a":"Only Crooked Hillary -she has to be the worst possessed women in the world of power and money -remember when they left the White House they were broke -now worth 250 Million-go figure","post_message":"A troubling taste of how the Clinton machine operates..."}]
