[{"comment_id":"10156282182225354","commenter_b":"Why are they even getting licenses??","commenter_a":"Lord, don't even let me go there, cause my head will explode............","post_message":"Illegal immigrant activists complain that Colorado's illegals aren't getting their driver's licenses issued quick enough. Seriously..."},{"comment_id":"537465956461211","commenter_b":"You are a total BS'er bitch ...","commenter_a":"Total billshit. I am part owner of a restaurant and we don't have this problem. We have health care for all employees and it didn't hurt our bottom line. The owner is just greedy and doesn't care about the employees.","post_message":" don have that kind of money. So instead of 50 or 60 people without health care, we have 50 or 60 people that aren employed anymore. It makes no sense."},{"comment_id":"10152999257859342","commenter_b":"I dont think its the color of our skin or were and how we ALL got here. But you do see more black people on the news for killing and stealing than any other race . Hispanics are usually the drunk drivers causing accidents, and whites usually go killing their own kids or parents!!","commenter_a":"It's always the black ppl fault.... Mexican are in the same boat but I see some on here don't see it that way. @username you black and don't know it.... Lol","post_message":"A man pulled a gun while stealing a TV at a Spring Walmart store this morning, authorities say."},{"comment_id":"1345530805539970","commenter_b":"@username again you also admitted to being a bitch so....","commenter_a":"It's funny that all these bad ass, gun toting, 2nd amendment conservatives seem to have no problem becoming Russia's bitch","post_message":"LOL! Thanks to Andy Borowitz for this helpful advice for Trump..."},{"comment_id":"10153046136906615","commenter_b":"make her take a leave of absense...without pay. If she wins, pay her retroactive.","commenter_a":"She will not resign. The minute she does. The Commonwealth will no longer be responsible for her attorney's fees. Conversely, this charade may turn into a \"where there is smoke, there is fire\" ordeal. Also thinking when she goes down. She is taking people with her, yet I believe the \"machine\" will do their best to mitigate future collateral damage!","post_message":"JUST IN via WPXI Joe Holden -- Pennsylvania's attorney general has been ordered to trial on all charges including perjury, obstruction..."},{"comment_id":"1015490965174099","commenter_b":"It takes a woman to clean up a big mess! I think she can do this!","commenter_a":"As usual, I am sure this is Not a accurate statement, as you have to factor in suicide and accidental shootings.","post_message":"Since the last #DemDebate, nearly 3,000 people have died from gun violence in the United States. It's time to act."},{"comment_id":"1849864471907247","commenter_b":"Oh yea, he needs another wife. Loser!","commenter_a":"Too soon!","post_message":"As no surprise, Gwen Stefani said yes!"}]
