[{"comment_id":"1812875395612222","commenter_b":"@username......................your a @&$)(:; fool","commenter_a":"Such a BS! Obama made a deal to stop nuclear proliferation. Iran's compliance with our demands lifted the sanctions. So they got THEIR money. Eric Trump is total idiot thinking he knows anything about this matter.","post_message":"\"[President Obama] lied about it. He said that it wasn't ransom money... No different than when he lied about ObamaCare.\" Yesterday on \"Sunday Morning Futures,\" Eric Trump accused President Obama and Hillary Clinton of lying to the American people."},{"comment_id":"10158316177600725","commenter_b":"So who was the \"Grown-UP\" the past eight years? We have had the most un-American couple in the White House, so glad to see them go! (It's a shame they will still be in the country.)","commenter_a":"Definitely need a growth up and not a coward. Glad we finally will have one that fits both","post_message":"In one of her final interviews as first lady, Michelle Obama revealed just how much the election has reshaped her view of her husband's administration."},{"comment_id":"1105387789537448","commenter_b":"Truly AMAZING she's still walking free, let alone running for ANY office other than cell block Queen!AND NOW the big 30 minute meeting of billy boy and AG L Lynch in Phoenix while under investigation! DEEP DEEP CORRUPTION","commenter_a":"Using her words when she said\" When Bill left office we were flat broke\". Folks that was less than 12 years ago. Pretty good return on her investments. Instead of President, maybe we should make her the Federal Reserve Chairman.------NOT","post_message":"Allen West Republic @webpagelink"},{"comment_id":"10153179149615399","commenter_b":"Most Conservative Women act childish.","commenter_a":"Right wing conservative instigator botox bitch.","post_message":"Actually, it's really not."},{"comment_id":"836130403149880","commenter_b":"Yes please an easy will for Hillary!","commenter_a":"Get em Sarah! We want you!!","post_message":"“I’m ready for Hillary, are you? Are you coming?” - Sarah Palin"},{"comment_id":"675106442643073","commenter_b":"Well, you are just a stupid BITCH! What say you now?","commenter_a":"that would be you Warren and you're a loon.","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"1231979063521740","commenter_b":"OF COURSE IT WAS RANSOM!! AND NOW OBAMA HAS PUT THE AMERICAN TOURISM IN HARMS WAY HE IS THE VERY WORST THING THAT WE HAVE EVER HAD IN OUR WHITE HOUSE AND WE CAN'T WAIT FOR THEM TO GET OUT OF OUR WHITE HOUSE!!! HE HAS TRIED TO DESTROY AMERICA AND HAND IT OVER TO THE MUSLIMS AND THE ILLEGALS AND NOW THE TERRORIST !! LOOK AROUND YOU THEY ARE EVERYWHERE AND GROWING !!! YOU DEMOCRATS BETTER THINK ABOUT IT !!! TRUMP FOR PRESIDENT AND LETS WIN THIS TIME !! AND SAVE AMERICA AMEN","commenter_a":"Yeah right it was more like Money Laundering.","post_message":"“This was not ransom. Any suggestion that it had anything to do with ransom is absolutely and utterly false.” State Department spokesperson John Kirby defended a $400 million cash transfer to Iran during the release of U.S. hostages. @webpagelink"}]
