[{"comment_id":"1099534980113254","commenter_b":"Anderson cooper is a killery bitch","commenter_a":"The country will be dancing in the streets if that happens. If anyone can get the job done, it's Donald J. Trump!!","post_message":"Donald Trump says he will prosecute Hillary Clinton if he becomes President of the United States."},{"comment_id":"897936806940850","commenter_b":"DUMBASSES!!!!!!!!!","commenter_a":"People take note of these 18 cities and steer clear.","post_message":"ALERT: These 18 U.S. Cities Just Made Terrifying Announcement About Muslim ‘Refugees’… Do YOU Live There? @webpagelink"},{"comment_id":"1033927403316825","commenter_b":"Good! Hopefully this will deter those damn anti-vaxxers from using Facebook and spreading their total stupidity. One can dream.","commenter_a":"Hip hip hor ehhhh","post_message":"Three cheers for Mark."},{"comment_id":"10153844148480579","commenter_b":"Only when they try to use it as the basis of their platform or legislation. Then it is a big negative.","commenter_a":"Media Silent As Muslims Ethnically Cleanse 60,000 Christians In Philippines By: Daniel Greenfield When thousands of Muslims become refugees, then you can’t get the media to shut up about it for weeks. Thousands of Muslim migrants... jewsnews.co.il","post_message":"Do you consider religion when evaluating a candidate?"},{"comment_id":"1060332480688422","commenter_b":"Hillary foreign policy. Iran bad deal. Libya diaster, benghanzi four died on her watched as they pled for help and she wants more illegals and migrants to come in take over country putting our safey and jobs at risk. Voted for Iraq war, a war buillt on lies! Say No to Hillary!!!","commenter_a":"Whether Bernie likes it or not he has no say so over what this country's direction is.","post_message":"Our message in this campaign is of creating a nation and a vision based on social justice economic justice, racial justice, and environmental justice – and whether Donald Trump likes it or not, whether Hillary Clinton likes it or not, that is the future vision of this country."},{"comment_id":"481790668675893","commenter_b":"GET THIS TROUBLE MAKER OUT OF THIS COUNTRY ....BEHEAD iSLAM","commenter_a":"Now that is one hell of a costume","post_message":"ARREST HIM!!!!!!!"},{"comment_id":"10155026342853147","commenter_b":"She is a slob","commenter_a":"Clueless no talent idiot.","post_message":"Pop star Pink attacked President Donald Trump for “stripping our humanity away”"}]
