[{"comment_id":"10153607710971336","commenter_b":"Stfu pussy","commenter_a":"How stupid do you have to be to do something like this?? Idiots!","post_message":"One student “thought seriously about going back home” after seeing the signs."},{"comment_id":"953925358000546","commenter_b":"^^see Lisa....THAT'S good parenting.","commenter_a":"Thats messed up. what if the kid is actually struggling in school ? The dad should help him with homework and take his xbox away TEMPORARILY and see whats the kids real issue.","post_message":"This is a warning to all Xbox-playing students — do your homework!!!"},{"comment_id":"883164491718973","commenter_b":"She is evil & a liar!!!","commenter_a":"She's a bigger liar than her husband and he lied to the Supreme Court and got away with it","post_message":"We must STOP HILLARY!"},{"comment_id":"10154241642885579","commenter_b":"@username And lucky for you Canadians, you have Justin Trudeau and Chrystia Freeland. They are both young, sensible and bright.","commenter_a":"I'm 73 years old and this is the strangest election I've ever seen in my life. It's scary as hell and I want to move , but nowhere to go. This is the demise of the country that has been predicted for decades. Going under , folks. It's been fun while it lasted.","post_message":"Marco Rubio: \"And so, while it is not God's plan that I be president in 2016 or maybe ever, and while today my campaign is suspended, the fact that I've even come this far is evidence of how special America truly is.\" Watch full speech here: @webpagelink"},{"comment_id":"10154093601280695","commenter_b":"Beautiful ladies","commenter_a":"People say the same about my mom. That we look like sisters. :)","post_message":"We totally guessed wrong."},{"comment_id":"843343722394413","commenter_b":"You're wrong. Go in a mosque sometime you'll probably even walk out with your head still attached.","commenter_a":"If we behave in the same fashion as our enemies, we become our enemies.","post_message":"REVENGE: French Attack Mosques And Blow Up A Muslim Kebab Shop Looks like the French have had enough of the Muslims immigrants living there and are fighting back! @webpagelink"},{"comment_id":"10154660419633797","commenter_b":"I'm pretty sure Russia is still one up on us!!","commenter_a":"Yup I'm a contributor","post_message":"AMERICANS DRINKING MORE: For the first time in nearly 15 years, everyone around the globe is drinking less alcohol. Except for people in the U.S."}]
