[{"comment_id":"10154523609503984","commenter_b":"oh, Spanish ought to set you off too, especially those who want to make it our official language, after all it was Spain that did the most detriment","commenter_a":"Cynthia, America is not racist. There are racist people that live in AMERICA. Obama is a race baiting man stop being BLIND. It was VERY INAPPROPRIATE for the speech he gave in Dallas. If anyone has the TRUE right to be angry about racism it is MY PEOPLE, NATIVE AMERICANS. I don't see any blacks living on reservations in America.","post_message":"This guy hits the nail on the head. I'm sure race baiting liberals will be fuming after watching this. A lot of people took aim at Michelle Obama in 2015, but no one hit the bullseye harder than he did..."},{"comment_id":"10153311362744135","commenter_b":"Thank you \"Pieter\" for finally posting something informative. This may be the first time. As far as your buddy \"Kathleen\" goes, it matters because many of her negative comments apply to politicians in general, so it would be quite naive and hypocritical of her to constantly criticize Christie, let's say for lying, while supporting a candidate who also lies.","commenter_a":"Please discuss why you don't threaten to enforce federal guns laws in states, but only marijuana. This would show you as a complete hypocrite and fraud. Please explain why you have expanded the failed war on drugs, your words, in Jersey.","post_message":""},{"comment_id":"10153918892062629","commenter_b":"Nah. We love Israel more than any state as far as funding goes. A Jewish president is more likely than an atheist.","commenter_a":"What the actual fuck?? \"Whites quit being racist long ago\"?? Surely this is satire and I've missed the humor. And it's not just about blacks. If we get a Jewish president, wait until the real pitchforks come out","post_message":"Whites, who are not racist, are ready to commit genocide if that is what it takes to stop black people from being racist."},{"comment_id":"10153641029539205","commenter_b":"the hell?","commenter_a":"Wow","post_message":"George Zimmerman Goes After Trayvon's Family"},{"comment_id":"10156149703965294","commenter_b":"I'd take her dang license and make her walk because she is so dang stupid!!","commenter_a":"He was doing his job,she was in the wrong ,51 in a 20 school zone.she should have been arrested.feel sorry for the safety of the kids.","post_message":"At first, she pleads for mercy: \"Can you give me a warning please?.... I have so much frozen food in the car.\" But, when the deputy walks to his car and comes back, her attitude changes completely:"},{"comment_id":"1580252788658041","commenter_b":"PLEASE STOP POSTING WITH THIS DESPICABLE WOMAN. ENOUGH TORTURE ALREADY.!","commenter_a":"Shes wacked","post_message":"Conway says she is more “amused” than “worried” over the fact that none of the top notch schools in Washington want to accept her children."},{"comment_id":"1334924336529627","commenter_b":"@username that's great except sometimes the child is tricked by a family friend, a coach, a counselor, etc... people that don't appear to be creeps. I'd like to help children see the signs, know what type of lies these predators tell them, and know how to get help if it's a family member or someone else. Killing the perpetrators after the fact will do nothing for the victims. Especially this little girl... she's already dead","commenter_a":"When I was young and in school we had the D.A.R.E program, trying to educate youth about drugs and help us make good decisions not to do them. We need a program now to educate our children on sexual predators, how to watch out for them, to be aware of how they manipulate, etc and where they can call for help and a safe harbor. I would happily volunteer to speak at any school. We need to protect these children and let them know they are not alone and that where someone may have failed them, we will not.","post_message":"Awful"}]
