[{"comment_id":"10153759354128352","commenter_b":"She's a slut","commenter_a":"U can tell exactly who the sluts are on this post lol all the women who are defending her..","post_message":"Woman who was ‘slut shamed’ after her public threesome at Calgary Stampede went viral says she has no regrets – in video seen by 3.4million"},{"comment_id":"10153042525998984","commenter_b":"NO....NO...NO......WAKE UP AMERICA! Kick these bastards out now!","commenter_a":"should not happen take off the d-- hood","post_message":"I can't believe this is happening. It has already sparked a big public outcry. Please help us get the word out so this situation can be stopped."},{"comment_id":"10152981521492235","commenter_b":"Surpising?! I think not.","commenter_a":"No surprises here. The sad thing is so many of today's Democrats and Republicans choose to ignore their party's histories and instead make excuses for it - such as saying because things happened years ago it was acceptable.","post_message":"What these presidents said in private and what they did in public were often sharply at odds."},{"comment_id":"546390502218196","commenter_b":"WHAT A ASSHOLE. !!!","commenter_a":"He is a Muslim!","post_message":"Obama threatens inprisoning military personnel for defying him. This is outrageous. He is drunk with power. Do you think Obama is a tyrant?"},{"comment_id":"10153067300837061","commenter_b":"Alex Barham you better do this for me. I sunflowers","commenter_a":"Beautiful story.","post_message":"Wisconsin man plants 4-mile stretch of sunflowers in tribute to wife who died of cancer: @webpagelink"},{"comment_id":"945724052142706","commenter_b":"Why would anyone vote for Hillary though? She's worse","commenter_a":"How could any Americans ever vote for a bigoted, vulgar, narcissistic billionaire who lies about almost everything and has advanced no policies or arguments other than strong and smart enough to do it. This is what happens when you get voters whose worldview consists of \"The Apprentice\", \"Keeping Up With the Kardashians\" along with \"Fox and Friends\". The masses of stupid going to the polls, very scary indeed.","post_message":"Donald Trump is on the verge of winning the Republican National Committee nomination, as the party plummets into a civil war that could destroy it entirely."},{"comment_id":"10153285448873984","commenter_b":"Send her to jail.","commenter_a":"Lock the beast up!!!!","post_message":"And people think she could be our next president? Do you think Hillary should be held accountable over this?"}]
