[{"comment_id":"10156932201230389","commenter_b":"Good answer. She is a sellout.","commenter_a":"NOT EVEN HONEST TO THE PEOPLE THAT PAY HER?","post_message":"David Webb: “Do you think Hillary Clinton’s honest?” Answer: “I think she’s honest to the people who pay her.” MORE: @webpagelink"},{"comment_id":"10152873585726051","commenter_b":"I thought they are suppose to be getting a education if they are going to act like fouls then everyone needs to pay and kick them out of school so somebody wanting to be there can.","commenter_a":"What a disgrace!!! Is this what they went to college for? They should be expelled and not allowed in any other college!! Let them have to work hard for the rest of their lives!!","post_message":"This fraternity caused $430,000 in damage and wasn't sorry about it at all. Well, now they're sorry."},{"comment_id":"831982023505806","commenter_b":"This woman needs to take the beam out of her eye before plucking the speck out of mine.","commenter_a":"The key point is she CHOOSES what to wear. So long as it is her choice, and not forced upon her, that's fine.","post_message":"Christian mom explains why she decided to stop wearing leggings:"},{"comment_id":"10154708467139575","commenter_b":"@username -AMEN!!!","commenter_a":"There are many people that work on major holidays. I don't know why every year retailers being open on Thanksgiving is a huge deal. First responders, hospitals, airports etc never ever close. Instead of the media always focusing on the negative maybe they should focus on the positive and the people that work these Essential jobs and miss many holidays with there family's.","post_message":"Macy's is staying committed to Thanksgiving Day shopping, saying it will open at 5 p.m. this year. What do you think about this? Will you visit Macy's on Thanksgiving?"},{"comment_id":"10154312293629330","commenter_b":"She's a lying murderer","commenter_a":"God help us if he wins!","post_message":"Donald Trump has been officially nominated as the Republican candidate for president at the GOP convention in Cleveland ---> @webpagelink"},{"comment_id":"687263024766984","commenter_b":"@username here's a fact for ya 100% of illegal immigrants are criminals","commenter_a":"\"What we are going to do is get the people that are criminal and have criminal records, gang members, drug dealers. … Probably 2 million, it could be even 3 million, we are getting them out of our country or we are going to incarcerate,” Trump said. “We’re getting them out of our country. They’re here illegally.” Don't see what the problem is with that.","post_message":"Immigrants rights groups say they're \"preparing for the worst.\""},{"comment_id":"10153476889474087","commenter_b":"How about that Nikki Haley... Traitor bitch","commenter_a":"Yesssss we need a lider no a politician like Cruz","post_message":"Donald J. Trump surged 5 points since last month to open a massive 22-point lead over his Republican rivals in North Carolina."}]
