[{"comment_id":"10152788140495950","commenter_b":"She did the right thing. Can't imagine how disappointed in her son she must have felt at that moment.","commenter_a":"I am so on board with what this mother did. She cared!","post_message":""},{"comment_id":"10152955255282452","commenter_b":"@username, abortion is legal even in the third trimester.","commenter_a":"How about we teach students and other young girls about birth control (not making it a religious issue) and make it more available to the public so we wouldn't have so many abortions in the first place. I don't like abortion, who the hell does anyways? But we shouldn't ban it. Let's push our efforts into making it as rare as possible instead.","post_message":"Anti-abortion activists on Tuesday released an undercover video showing a senior Planned Parenthood official discussing the disposition of parts from aborted fetuses. @webpagelink"},{"comment_id":"10153624837111770","commenter_b":"BLM is simply trying to create so much chaos that Marshall Law will be declared and in turn that means that if its declared Obummer will stay in office that's what they want! I have no idea why they want that because he does not care about them he does not care about anyone accept his third world Muslime buddies (no that's not a misspelling they are Muslim slimes)!","commenter_a":"Great! Trapper keeps sticking his foot in his mouth.","post_message":"\"Listen, Jake, I wasn't born last night,\" Police Chief David Brown told CNN's Jake Tapper. \"You ask me a policy question that policy-makers haven't resolved, I'm going to punt and kick it back to you.\" READ MORE: @webpagelink"},{"comment_id":"10150574072889999","commenter_b":"Exactly, politicians and police could learn a lot from thisman","commenter_a":"this is how a real man behaves - God Bless you Mr. Taylor","post_message":"Malcolm Taylor, a Baltimore city bus driver, was watching the riots unfold on television, and saw some of the players he coaches in youth football among the rioters. He gathered 15 friends, including some church pastors, and went to the riots near Mondawmin Mall to try to calm things down."},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"},{"comment_id":"1226252880748515","commenter_b":"Simply disgusting to disregard females.","commenter_a":"Carry the baby, but you'll get no health care, no paid maternity leave, no disability if you have complications, no help with diapers, daycare or anything else. And then for extra shits and giggles we'll say that you're a burden on society and need to pull yourself up by the bootstraps.","post_message":"Not content with being a mere robot who repeats the same scripted line over and over during a debate, Marco Rubio demonstrated that he is a cold heartless robot on Sunday."},{"comment_id":"614554242047139","commenter_b":"And Bill's a natural player , what a fraud the Clintons are .","commenter_a":"ring a ding, a ding ding, blow it out his smarmy lying blowhole!","post_message":"\"She's a natural leader, she's a good organizer, and she's the best darn change-maker I ever met in my entire life.\" President Bill Clinton said Hillary Clinton is \"worth every single year she's put into making people's lives better.\""}]
