[{"comment_id":"10155363897415231","commenter_b":"She's gorgeous!!! You go girl!!!","commenter_a":"Wow!! Gorgeous baby!!!","post_message":"She was bullied because of the color of her skin, but she fought her way through the tough times to now become the recipient of a $10,000 scholarship. @webpagelink"},{"comment_id":"1083445358398358","commenter_b":"She needs to give up the madness. She isn't accomplishing anything. Well..... except getting more votes for Trump.","commenter_a":"She is foul mouth pig, has not been funny in years and the sooner she move to Canada the better...","post_message":"WOW...Rosie just outdid herself. Do you agree with Trump?"},{"comment_id":"10154836635824916","commenter_b":"Yeah, he's almost as bad as Hillary! Why would anybody ever vote for either of those criminals!","commenter_a":"Of course. . . . The man is a business man being sued, up one side and down the other. He lied, often in the same speech. . . . He says wgatever pops into his head.","post_message":"It's going to be a rough four years for progressives, but Trump fans aren't headed toward happiness either."},{"comment_id":"923764651058995","commenter_b":"I've officially had it, I want Muslims in Muslim countries period not here...","commenter_a":"It was going to happen sooner or later. Might as well start it now.","post_message":"RT Khalilah Sabra: Muslims to Start a Revolution in America"},{"comment_id":"10154887847131729","commenter_b":"Take your head rag with you. Ungrateful bitch","commenter_a":"You are disgrace to my country! Pack your bags and go to one of the Muslim countries where you will be treated like a dog because you are female. What an ungrateful idiot.","post_message":"Seriously?"},{"comment_id":"1019570198153414","commenter_b":"She's a Witch!","commenter_a":"@username is showing us what a doucebag he really is. Desperate for people to believe such utter non-sense. Common Sean, the real hurricane is YOU for posting this as you are so full of hot air. lol The truth is \"The Ads were pulled when the news of the hurricane was brought to life not the other way around\" Trying to politicize an unfortunate event is plain evil and you posting this stuff to draw attention in the wrong way is absolutely @username like.. SAD Americans being fool by you.","post_message":"Absolute ghouls."},{"comment_id":"10153090141861680","commenter_b":"So what? Nothing should be said about mass shootings? Thugs and criminals are not mass shooters. There is crime everywhere. In every state and city. Our second amendment has been a shield for evil doers. Most criminals and thugs or gangs are trying to survive a life of under privilege and zero opportunities...jmo","commenter_a":"I live in the Atlanta area and every day, I say again, every day there are 3, 5 and some days more murders, carjackings, home invasions, bank robberies all committed by thugs, gangs and criminals. Yet, you don't hear one word, not one word of anger or control to get the guns out of the hands of these criminals. There are more murders in one week in the Atlanta area than the 10 souls that were lost in Oregon. If politicians really cared about every life, there would be more done to dismantle the gangs and thugs in our country. But instead all they care about is how they can take advantage and politicize a senseless crime to advance their agenda to take guns away from US citizens. They know that CRIMINALS DON\"T CARE ABOUT THEIR F'n LAWS!!!! So their true intentions must be to disarm the people.","post_message":"POLITICO takes a look back at some of his stronger words on the issue."}]
