[{"comment_id":"397229163813931","commenter_b":"Get these people deported","commenter_a":"if these goat humpers do not like the laws of the US they are free to leave any time they want","post_message":"Shock Poll! More than HALF of Muslim-Americans Think They Should be Allowed to be Governed by Sharia Law!"},{"comment_id":"10153465913933145","commenter_b":"Your mom took the time to raise you right....take the time to raise your children right !","commenter_a":"This kid didn't have to go thru this were was the mama, I hope the kid has been taken out of the home? Why did the grandmother didn't do anything for the girls. We live in a crazy world?","post_message":"A father is facing child abuse and drug charges after police say he beat his daughter because she didn't get enough candy while trick-or-treating."},{"comment_id":"10152889552848717","commenter_b":"Bringing a gun to a bomb explosion? Okay....","commenter_a":"Save natural causes, racism has directly or indirectly been the cause of death to every single black in this country. Ponder that statement for a minute, because it is the truth. If you are black, eventually racism will most likely lead to the cause of your death, whether it is diet, subsequently health, or murder. The degree of oppression will take its toll. Dying of a natural cause is a luxury that few blacks will enjoy, and by natural cause, I refer to old age only. The degree in which we are hated is only mildly expressed in this video. The odd man out is usually hated with a vengeance, and we been tasked with that role since day one. No matter whom we go to war and help this country fight, once the war is over, our citizenship status becomes less than that of the enemy whom we help ...","post_message":"President Obama's nomination of Loretta Lynch to become the country's first African-American woman attorney general is a historic pick."},{"comment_id":"10153810212319087","commenter_b":"stupid picture talking bitch. @webpagelink","commenter_a":"this is good. \"Rarely does a presidential election hit the unthinkable issues that can completely divide a nation and endanger the peace and security of that nation. It seems Donald Trump is poised to kick down doors concealing issues that mainstream media and mainstream candidates fear to even discuss. The competence level of our leaders in government and their weak attempt to compete in world markets is one of this countries forbidden issues. The other forbidden issue is the democratic party position that Islam has nothing to do with violence, as opposed to Donald Trump explosive position that hates us. It a good bet that America is about to get an education in what Islam represents and what its intentions are, as perceived by Donald Trump. I believe the two afore stated issues will sharply divide the American electorate and could possibly threaten the peace in some instances. Donald Trump ...","post_message":"Here are five of the most important primary fights to watch this month that could determine who will win this fall's battle for control of Congress."},{"comment_id":"10152752919406051","commenter_b":"She should have spent AT LEAST ONE YEAR IN CUBA.","commenter_a":"I know this might stir up the pot even more, but my sister got gastric by-pass surgery over 10 years ago & has severe health problems ever since, and will have them for the rest of her life. She also has to take a truckload of pills every day in order to make sure she gets enough nutrients so she won't have other health problems from not eating enough. Anyone doing any research on gastric by-pass will find that it's not the solution to weight loss, and in some cases, they're much worse off than before. This woman isn't so fat that she can't lose the weight on her own. The problem is she doesn't want to lose weight. If your \"want to\" isn't there, even gastric by-pass won't be very effective. I personally know 3 women who have had this surgery & they've all gained whatever weight the lost ...","post_message":"This woman says she’s too fat to work, so the government offered to pay for weight loss surgery. She had a different plan."},{"comment_id":"10150772965449999","commenter_b":"She's going to wear the same shoes every day forever? What if her feet keep changing?","commenter_a":"If you paid $1000 for shoes you will have the rest of your life, you got a bargain. If you hadn't you would have spent more on shoes that didn't fit, hurt, were too high, and you wouldn't wear them. Not extravagant at all; I would say it was smart shopping.","post_message":"\"I know I am going to take a lot of heat for what I am about to tell you, but I just spent almost $1,000 for a pair of custom shoes.\""},{"comment_id":"585707061582274","commenter_b":"Zoe, your doctor told YOU not to lift that amount of weight. If the doctor told that woman not to, I'm pretty sure she'd stop. Everyone's body is different.","commenter_a":"This is just sad , smh more concerned about looking fit and all that , be healthy that's what that baby needs not for you to be fit. Wait till the baby is born and get to your regular routine. I really hope the baby comes out ok smh all that shaking and heavy lifting Pretty sure you just gave that child problems","post_message":"Fitness Model Chontel Duncan Isn't Stopping Her Intense Workout Sessions Even During Her Pregnancy!"}]
