[{"comment_id":"10152919448276636","commenter_b":"May I remind people of this classic. I used to watch it at my Granny's house every Saturday. @webpagelink","commenter_a":"Racism is an intentional act. This is not racism. Just because it sounds the same does not make it a slur on Pakistani's in any way shape or form. It's a different spelling with a different meaning entirely. whomever started this nonsense needs to be kicked in the butt for trying to stir up trouble.","post_message":"The WHAT are out of containment?"},{"comment_id":"10152973288751130","commenter_b":"No its sad you women believe that men always negotiate harder. Please provide some scientific evidence of this, other than that try harder.","commenter_a":"Isn't that sexist to say men negotiate better than women? Lol","post_message":"“Men negotiate harder than women do, and sometimes women get penalized when they do negotiate.\""},{"comment_id":"902389386549543","commenter_b":"She is a fkn disgrace! #hilliaryforprison","commenter_a":"To all of you considering a third party vote or staying at home, facts show what that did in 2000. It gave us GEORGE BUSH. Remember Florida? Bush-2,912,790; Gore-2,912,253; Nader-97,488; Buchanan/Foster-17,484. Do the math. Please tell me, what good did that do? Are we way ahead of where we were 16 years ago? You know what Bush did. He appointed John Roberts and Clarence Thomas to the Supreme Court, gave us Iraq, Isisl and the Middle East, tax breaks for millionaires, FEMA during Katrina, the Great recession and the road to Trump. Read what \"Art of the Deal\" writer Tony Schwartz has to say about Trump and realize that it's better to have Hillary in charge while you use your outrage to build a party around progressives like Elizabeth Warren and Jeff Merkley. The unfortunate truth is, if you don't vote for Clinton/Kaine this year, we'll have Trump/Pence next year. ...","post_message":"\"Let’s go make history and elect Hillary Clinton the 45th president of the United States!\" —Tim Kaine"},{"comment_id":"10154830070756337","commenter_b":"I feel good Hillary is going to win","commenter_a":"I'm with her!","post_message":"We're counting down to Tuesday's election. Tell us how you feel..."},{"comment_id":"10155290808369657","commenter_b":"How can you support Hillary who betrays our Country lies and cheats and breaks the law each day. Hillary who.doesnt defend our Cpuntry our peopke and wants to open our borders and let terrorist enyer our Country freely as they chant death to America. Hillary qho breaks security and shares top secret Information and endangers our Military andCpuntrys and helps arms Isis ?How would anybpdy think its ok to support a lieimg cheating crinal who should be hung for Treason against America be elected President with all the oiruption and criminal acts Hillary has committed. Seems you should be glad to Vote for Mr Trump as he is good american will make a great president.","commenter_a":"So another mindless elected person. stupid is as stupid does","post_message":""},{"comment_id":"10153986738115667","commenter_b":"She is a joke","commenter_a":"Haters go away","post_message":"\"The American people deserve to get the full and complete facts immediately,\" Clinton said in her first comments about the newly discovered emails. She added that she is \"confident\" the FBI won't change its mind about bringing charges against her."},{"comment_id":"10153303118249203","commenter_b":"Beauty.","commenter_a":"That was an awesome episode!","post_message":"John Oliver made NSA whistleblower Edward Snowden crack on Last Week Tonight with John Oliver during a surprisingly contentious interview."}]
