[{"comment_id":"1290711880990755","commenter_b":"S'il pouvait balayer trump , ca ne serait pas un luxe !!","commenter_a":"SUS!","post_message":"I have been criticized for saying this, so let me say it again: I believe health care should be a right for all people, not a privilege."},{"comment_id":"10154784802599575","commenter_b":"arrest her before she flees the country!","commenter_a":"If she had any tact, or respect for the people who voted for her she would of made a speech last night.","post_message":"Hillary Clinton is expected to speak very soon from New York after losing the election to Donald Trump. We will live stream her concession speech on our Facebook page and in this post."},{"comment_id":"10153681462888984","commenter_b":"Let's have a face to face.","commenter_a":"I am, and I have always liked her because she is honest!!","post_message":"Sarah Palin just put something on Facebook that immediately went viral... this image is exactly what Hillary didn't want America to see. Palin is never scared to tell it like it is... we should be grateful for her courage and patriotism."},{"comment_id":"10153995580906037","commenter_b":"This is an ugly woman","commenter_a":"This is not a man. This is not a man who will handle such a public failure very well. This is not a man. This is not a man who was courageous enough to participate in the last Republican debate despite Megyn Kelly asking hard questions. This is not a man.","post_message":"In the week leading up to the Iowa caucuses, Donald J. Trump issued more than 120 tweets. He took 16 hours to break the silence after his loss to Ted Cruz ."},{"comment_id":"1524641694504572","commenter_b":"@username Bernie wants you to suck off all the boys in Chicago so their bitches can have a night off","commenter_a":"All the protesters want the other candidates only one protester in question was for Trump and he was 87 and still willing to fight for what was right","post_message":"John Kasich is a _________."},{"comment_id":"747501402054427","commenter_b":"Wouldn't happen to my children. My kids are five,three and one. They know better than to go into a wild animal pens. Plus me and my wife keep our eyes on them all the time. Hands are held too at all times. No excuses for that gorilla to be killed. The parents were neglectful and should be charged with neglect and child endangerment. That gorilla didn't ask to be in the pen. Then to be killed for being a gorilla. I'm not saying leave the kid to die either. Sad situation that should of never happened.","commenter_a":"For all of those slamming the zoo for killing the gorilla, what if it was your kid who fell in? Would you want the zoo to let your kid die because the gorilla was endangered? We all need to think and put ourselves in others shoes before we start spouting off on things.","post_message":"Jack Hanna says he agrees with the decision that the Cincinnati Zoo made in killing the gorilla that was dragging a toddler who fell into its enclosure. Learn more: @webpagelink"},{"comment_id":"10152885011267507","commenter_b":"Woman put up with it because we are use to it. Woman are also so busy and have not prioritized changing this. Women will eventually say enough of this nonsense and put a stop to it for good. It is only a matter of time.","commenter_a":"Women in other developed countries are getting treated better ! Why do American women take this abuse ? No paid maternity leave , no paid sick leave , no paid or very meager paid leave , WTH is wrong with American women demand it and demand it now!!!","post_message":"Let's be good to our mothers today and EVERY DAY!"}]
