[{"comment_id":"829608320409843","commenter_b":"She is disgusting!","commenter_a":"I'm warmed by the tolerance of the libs. Not.","post_message":"Well, she certainly didn't shy away about how she feels."},{"comment_id":"1142812899111790","commenter_b":"Jade White Ali omg & before ?? Ur a nun then now !","commenter_a":"It's all false to get people to make racist comment, and it's illegal in UK to have more than one wife it's called bigamy","post_message":"Men with more than one wife to get bigger benefits"},{"comment_id":"10154382058398606","commenter_b":"These chicks will walk on hot stones for me but keep disrespecting their sisters","commenter_a":"@username Smdh. Why would anyone do that?","post_message":"More than 30 people suffered burns to their feet and lower extremities at a Tony Robbins seminar after the motivational speaker encouraged them to walk across hot coals. @webpagelink"},{"comment_id":"10153991299268984","commenter_b":"Make sure he meets his virgins..","commenter_a":"Coming SOON to an ENTIRE COUNTRY near you . . . !!!!!","post_message":"This ISIS supporter had planned something truly terrifying for New Year's Eve... Thankfully, law enforcement caught him just in time. Do we need to do more to support law enforcement against ISIS?"},{"comment_id":"679029648954280","commenter_b":"Lock her ass up","commenter_a":"Waiting?","post_message":"FBI moves to arrest Hillary and put her in prison for 10 years. Good, it's about time. She deserves longer. Would you be happy if Hillary was in Jail?"},{"comment_id":"1724806041088528","commenter_b":"@username don't be angry at @username because your ignorant.","commenter_a":"And THAT is why we need @username more than ever. With a life-long career of public service, having been a successful Senator and Secretary of State, and more than tough enough to continue the legacy of Obama, no one is more qualified. #Hillary2016!","post_message":"“The presidency is not an entry-level position.”"},{"comment_id":"991848417558053","commenter_b":"what woman?","commenter_a":"If this woman is willing to show such an overt act of patriotic disrespect, how will she ever effectively enforce our laws in an unbiased way? She should be removed from her position. End of story.","post_message":"VIDEO: Muslim Police Chief Shows This Act Of Complete Disrespect To America And Is Under Heavy Fire For It."}]
