[{"comment_id":"10154691859089778","commenter_b":"Smart enough to know that it's people like Trump that make the world go round. It takes the 1% to contribute the 99% of us that couldn't keep the economy a float without there financial support or contributions to the economy. What is ruining our economy is supporters like yourselves who probably believe in giving the minorities a place to stand in the bread line while they send there un-taxed & undocumented earnings home to there families living like royalty on the backs of the mighty American dollar. While the rest of registered documented citizens pay our taxes to make America great. I am all for immigrants who are here legally and lawfully it's you stupid idiots who support the system in the blind to allow otherwise.","commenter_a":"Racist people are coming out the woodworks. They are attacking Donald Trumps campaigned because they are to stupid to understand the truths of our Society. To stupid to understand simple economics, taxes and laws. They result to violence and idiotic actions. Because they are to stupid to see what's right and wrong!","post_message":"Protests erupted during a Donald Trump rally in Chicago, forcing him to cancel the rally. @webpagelink"},{"comment_id":"1576897572597356","commenter_b":"The only \"racist\" in this picture is Whoopi ! Chip on her shoulder bigger than her ego!!","commenter_a":"It's time for her to go. She never has anything nice too say and she isn't funny anymore.","post_message":"Will someone please take Whoopi Goldberg off TV?"},{"comment_id":"1065116426845174","commenter_b":"She's thick. And frankly looks weird with the stretch marks photoshopped out.","commenter_a":"Ashley Graham, the model is size 16. She's NOT EVEN PLUS SIZE. That's what's wrong!!","post_message":"You decide..."},{"comment_id":"10154178050418010","commenter_b":"I saw it! I was walking to the store to get cat litter and it went right in front of me when I was at Hollywood and Sycamore","commenter_a":"Ernesto Peimbert","post_message":"Open convertible driving in the rain: ✓ Donuts on Hollywood Blvd.: ✓ Entire thing almost derailed by a TMZ bus: ✓ It's too early to say, but this may be the most L.A. car chase of all time."},{"comment_id":"10154326925529586","commenter_b":"The same thing happened to me! A few neighbors found it funny to toss their firecrackers over the fence during some lunch party. We came home to find our poor baby scratched up and shaking - stuck between a rose bush and fence. Horrible horrible how lightly some people take this!","commenter_a":"I used to love July 4th until someone decided to throw firecrackers in the yard with my dog. She passed her fears on and my dogs are so afraid they huddle against me and shake. I dare not leave my home out of concern for what my pets go through.","post_message":"URGENT: Your dogs & cats can be TERRIFIED of fireworks. Keep them safe this #FourthOfJuly."},{"comment_id":"733570513458390","commenter_b":"He wants to deport the Hispanics? We need to deport him with his team to Russia since they don't have anything to offer the nation. At least the Hispanics do all the dirty work in this nation.","commenter_a":"Politicians and Corporate thugs and bloated military spending.","post_message":"They're called politicians. The Mind Unleashed"},{"comment_id":"668156923332741","commenter_b":"Oh, so now you speak Spanish? You voodoo witch!","commenter_a":"What does it takes America to see that Obama and Hilary have offered our country very little for the past eight years, good deceptive speeches, pure empty promises, Obama Health Care that every Insurance Company wants to drop because they are loosing so much money, bad immigration system, from one lies and deceptions after another, 400,000,000 American tax dollars for ransom, two more Americans Kidnapped for more ransom money, bad Iran deals and foreign bribes for speech and favors from corrupt foreign leaders, 33,000 deleted government email, deleted and covered up under Hilary skeleton closet because Hilary think she is above the law, deceptions, Hilary lies and cover up about Benghazi, from one lies and deception after another coming from Hilary and Obama to much to list, while our country is falling apart and American Citizens are suffering, our poor minority American Citizens are suffering, getting worse and worse under ...","post_message":"A tan solo 83 días para el día de la elección, Trump contrató a una de las voces más extremistas de la derecha para dirigir su campaña. Este es quien realmente es Trump y queda claro que no va a cambiar."}]
