[{"comment_id":"10154232027346491","commenter_b":"Tom....amen","commenter_a":"PRESIDENT DONALD TRUMP, PRESIDENT OF THE UNITED STATES OF AMERICA...EVEN THOUGH obama DIVIDED MORE THAN ANY SITTING PRESIDENT... SHOW YOUR BIAS time mag...THAT'S WHY YOUR PART OF HISTORY, AND NOT FOR THE PRESENT !!!!","post_message":"How TIME Person of the Year runner up Beyoncé went from pop star to political force. @webpagelink"},{"comment_id":"720102644820493","commenter_b":"Niggaz","commenter_a":"Stupid ass liberal niggas..","post_message":"\"All White People Are Racist.\""},{"comment_id":"10152829915341130","commenter_b":"What a doll she is!","commenter_a":"I hope you are successful. I love the breed, had one 33 years ago, she was perfect and sweet and love able....don't think she knew she was a Pit. We got her at 6 weeks. She was the runt of the litter and blond. So cute, so smart.....we loved her. Her life cut short, hit by a cAr...our fault, out in country did not think there was enough traffic to leash her for her morning job, one car amd she ran in front of it....I have never forgiven myself. But she had my heart at day one. Good luck with your training🐾🐾","post_message":"\"I don't want her bad behavior to speak for the breed -- rather, to behavioral issues born from neglectful and abusive homes. More than that, though, I don't want her to have any bad behavior. I want her to help fight The Great Pit Bull Bias.\""},{"comment_id":"10156273080720389","commenter_b":"She's a gutless wonder!","commenter_a":"good for you rudy.now call out the queen of liars abad tell her this country does not need a corrupt murdereer of ameicans in bengazi...","post_message":"In Case You Missed It: Rudy can be a little blunt sometimes."},{"comment_id":"1049397791786635","commenter_b":"Oh yes let's hope it's true!!","commenter_a":"Danni Fiebig @username","post_message":"The Bachelor Australia may have just given it away (via Daily Mail Australia)"},{"comment_id":"10153533383913145","commenter_b":"Ur an idiot. I blame your parents for that!","commenter_a":"I blame Obama for this guy.","post_message":"A Kissimmee doctor accused of sexually battering a patient could reopen his practice today. If he does so, it will be with some restrictions. A live report coming up at 7 a.m. on Eyewitness News This Morning on TV27 WRDQ."},{"comment_id":"880499385321632","commenter_b":"100% yes.","commenter_a":"Absolutely","post_message":"Do you approve of this change?"}]
