[{"comment_id":"1801521536786663","commenter_b":"We can send all the \"safe space\" cry babies here. It will be perfect Trump will just need a longer wall. Oregon? You want in on this? Please speak up before we order materials for the wall","commenter_a":"Please do.","post_message":"The group said they plan to seek independence through the United Nations."},{"comment_id":"10153121291663984","commenter_b":"Not only false , but evil. Send them out of here !","commenter_a":"She has the right to distrust Muslims. Islam is a false religion it's really a terrorist organization.","post_message":"Her critics are attacking her mercilessly for what she said last week, but this Republican is standing by her comments. Do you agree with her?"},{"comment_id":"10153924246056800","commenter_b":"Bye Felicia","commenter_a":"I can't! Im done with this show....this used to be one of my favorite shows that would tell it more or less like it was. But now its just a one sided political agenda. Goodbye daily show may you rest in peace","post_message":"Activist DeRay Mckesson talks about the tenets of the Black Lives Matter movement."},{"comment_id":"551369591720287","commenter_b":"She is a disgrace to every First Lady America ever had, not to mention every woman in America. neither she or her husband know their ass from their elbow.","commenter_a":"They need to be GONE !!!!!!!!","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"10153206472131636","commenter_b":"Well said. If someone wants to dress from head to toe in black I have no problem with it, but full face coverage I find offensive and frightening. You can't read the expressions of a person with their face covered. Is it male or female? It's not necessary and definitely should be banned in the UK.","commenter_a":"There's a difference between Muslims who just wear the hijab (headscarf) and the niqab (face veil). The latter is simply cultural and is an import from Saudi Arabia and other countries that oppress woman (husbands don't like other men looking at their wives so will often make them wear one ) There is nothing in the Quran that says a woman has to wear one. I spend a lot of time in the Middle East and when in Rome and all that. It's not appropriate to have the niqab in our open society. British people might be tolerant but they don't have to be about absolutely everything. Women who wear the niqab segregate themselves from society. It's a barrier. The French have banned it and some other European countries have done the same. Britain should too. And before people start waving the \"islamophobic\" card. I happen to know a lot ...","post_message":"Staggeringly"},{"comment_id":"517019608487085","commenter_b":"Hell no, they can NOT stay! They are all guilty of a criminal offence. They are here ILLEGALLY, you dumb...","commenter_a":"The only path they should get is the road to the border where they would be deported.","post_message":"\"For the 11 and a half million who are here illegally, if they've not committed a crime since they've been here, I would give them a path to legalization.\" Today on \"Fox News Sunday,\" John Kasich discussed immigration."},{"comment_id":"10154500349722994","commenter_b":"Yes! If someone is wrong they should pay!! Thank you hun. Wish I wouldn't have settled because I probably wouldve gotten more going to court! Never settle sweetheart 👍💯","commenter_a":"This happened to me before but by the time I found out it was pillaged, dash kit, sounds, Windows missing. I went to court and sued DPD they settled out of court.","post_message":"Andrew Carter has been walking, riding his bike and taking the bus for nearly two years now - unaware his stolen car had been recovered the entire time."}]
