[{"comment_id":"472703329582291","commenter_b":"How does Trump make Mexico pay for the wall, When America has no authority over Mexico ?","commenter_a":"We need the good people of Florida to Vote Trump!","post_message":"FLORIDA: Early voting is now open! Do not miss this opportunity to #MakeAmericaGreatAgain #Trump2016 Ivanka Trump Find Florida early polling locations: @webpagelink"},{"comment_id":"1848158328804181","commenter_b":"Why would he not mention her. The media is so biased you know they won't mention her in any other way then to make excuses for her.","commenter_a":"Can he EVER answer a question WITHOUT mentioning Hillary Clinton??","post_message":"Donald J. Trump to George Stephanopoulos on being criticized for taking time off campaign trail to open new hotel: “Nobody complains when Hillary Clinton goes to an Adele concert.\" @webpagelink More tonight on ABC World News Tonight with David Muir and tomorrow morning on Good Morning America."},{"comment_id":"10153123243420950","commenter_b":"Love that show!","commenter_a":" and still my favorite show","post_message":"Betty White is the lone survivor of the cast; RIP Bea Arthur, who played sensible Dorothy Zbornak, Estelle Getty, who portrayed Dorothy's mother Sophia Petrillo, and Rue McClanahan, who played the sultry Blanche Devereaux. The show lives on, though."},{"comment_id":"10153308250786770","commenter_b":"Even if a guy is into that, I can't imagine him liking those freaky legs.","commenter_a":"If he wants to live as a woman, that's on him, but could someone please tell him if he's going to wear short skirts to put on pantyhose? His legs are ugly & weird looking.","post_message":"\"That will always haunt me,\" Caitlyn Jenner said."},{"comment_id":"1155027644532693","commenter_b":"ignorants are eating Donald shit with lying pence","commenter_a":"NEW RULE : MAKE GRABBING PUSSY GREAT AND SAFE AGAIN.....LYING PENCE IS DONE FROM EATING DONALD SHIT .....BREAKING NEWS : HURRICANE DONALD DUMB IS ENDING THE PRESIDENTIAL RACE AND IT IS MORE POWERFUL THAN MATTHEW HURRICANE .... PAUL RYAN AND THE RNC CHAIR WASHED THEIR SMALL HANDS FROM DONALD DUMB AFTER WATCHING DUMB TRUMP PUSSY GRABBER CLIP ..... THE RACE IS OVER ...CONGRATULATION I ANNOUNCE .HILLARY CLINTON IS THE PRESIDENT OF USA ,,DONALD JOKE DUMB HIJACKED REPUBLICAN PARTY (LINCOLN AND REGAN PARTY ) LIKE ISIS HIJACKED ISLAM AND KKK HIJACKED CHRISTIANITY ,, I AM CALLING FOR COMPLETE SHUT DOWN OF DONALD JOKE DUMB FROM TALKING TO ANY WOMAN UNTIL WE FIGURE OUT WHAT THE HELL IS GOING ON .INCLUDING DEBATING WITH PRESIDENT Hillary Clinton","post_message":"She wants textbooks changed."},{"comment_id":"1296712253679455","commenter_b":"Domestic Terrorists should be punished to the full extent of the law.","commenter_a":"Bundy, it's time to pay the piper !","post_message":""},{"comment_id":"10153614987044199","commenter_b":"Disagree. I think she's a hero. Get this psycho off the road.","commenter_a":"I just watched the whole video and I call bs on the mom. She had 4 opportunities to take a turn and drive away from this woman. If you have your kid in your car it's not your time to stand your ground. Let her drive on, pull over let them go on their way, turn down another road go another way home. Don't keep following them especially when they keep randomly braking.","post_message":"UPDATE:"}]
