[{"comment_id":"1383067515067050","commenter_b":"Your whore fingertips are getting in the way of you making any sense. Maybe if you'd done anything intelligent with your life instead of studying how to do your hair and makeup you'd see just what a failure to society you are.","commenter_a":"To all the haters, STFU. If you dont like it GTFOO our country, bc WE elected her! USA USA USA!!! We are great and will continue to be great with Hillary leading us.","post_message":"History has been made!"},{"comment_id":"1318881848134860","commenter_b":"Suck it up Buttercup","commenter_a":"Good , If the press would stay neutral, as they should, and report only factual information, instead of just what creates more drama, then they'd get the respect they want.","post_message":"For a year and a half, the press smeared, attacked, and belittled Middle Americans supporting Trump. Now they want respect? Sorry, that's a two way street."},{"comment_id":"10158313140330206","commenter_b":"She's obviously drunk.","commenter_a":"The employees shouldn't have stood there like that and just took it. I would've gone straight for security. The other customers are waiting.","post_message":"This woman takes the cake for being one of the WORST customers."},{"comment_id":"808271599289223","commenter_b":"Same as women who cheat","commenter_a":"Why frikken cheat? If your not happy, just go, leave..men who cheat are just cowards, w too much ego...dont play stupid games..","post_message":""},{"comment_id":"10153762734254087","commenter_b":"All this woman does is lie her ass off 24/7","commenter_a":"Republican Hypocrisy !!","post_message":"FBI Director James Comey dismissed Hillary Clinton's claim that his agency's probe into her private email server was a routine “security inquiry,\" telling reporters \"I'm not familiar with the term 'security inquiry.'\""},{"comment_id":"500867293395381","commenter_b":"The Hilary Clinton article is free of facts and only says superficial things. I don't agree with her assessment.","commenter_a":"Israel has had nuclear weapons for more than forty years and has not used them. Instead of focusing on the mullahs who are intent on wiping Israel and the Jews off the map, let's focus on Israel. That makes perfect sense. Of course.","post_message":"While the conservatives try to get us to focus on Iran as a nuclear threat, guess where the real threat is hiding..."},{"comment_id":"1792973144264831","commenter_b":"Come on Virginia We all know that Donald Trump is going to be president so let's rally behind him","commenter_a":"Those who vote for Crooked Hillary, are also crooked with a hidden agenda! TRUMP 2016!","post_message":"Terrific news in Virginia. Thank you for your tremendous support! I have a lot of amazing memories in Virginia - and I look forward to campaigning with you in the general!"}]
