[{"comment_id":"1868770480033724","commenter_b":"Why, because the system is being drained my illegal aliens and the corrupt gov. Trump is fixing that open your eyes.","commenter_a":"This is as embarrassing as it can get. I wouldn't want to be president of a country if I had to think so negative about it. America is a great place to live but they r making some poorer each day. Cut Social Security, cut Medicare, cut insurance , cut food stamp, cut cut. Why?","post_message":"No. Words."},{"comment_id":"852398211532955","commenter_b":"The DEMOCRAT PARTY IS A DEATH CULT! American deaths do not matter except to attack the Constitution! Democrats and their media mouthpieces HATE Christians, Jews, and conservatives, but support Islam because... ISLAM = DEATH CULT DEMOCRAT PARTY = DEATH CULT (facts): - The Democrat Party has a KNOWN NAZI (Soros) as its key financier and leader. - Fast & Furiously providing weapons to murdering gangs while trying to disarm Americans. - Freeing violent felons to MAIM AND MURDER AMERICANS! - Pushing an open border illegal alien invasion to RAPE AND MURDER AMERICANS, INCLUDING CHILDREN--, then BLOCKING KATE'S LAW which would have reduced all of this! - Treasonous support to fund Iranian terrorism (and nukes). - Ignoring the Islamic RAPE AND MURDEROUS SLAUGHTER OF CHILDREN, WOMEN, AND CHRISTIANS. - Freeing terrorists for a deserting traitor. - Promoting a race war that Satanist Charles Manson would be proud of. - Supporting Planned ...","commenter_a":"It's only been \"home grown\" since you started importing your Muslim brothers into the country.","post_message":"Here it comes..."},{"comment_id":"913594125361987","commenter_b":"Go ahead vote for her! Stink up America some more you fools!","commenter_a":"She's right, we can't let a Republican in the White House. Vote Blue and support whichever candidate wins the Democratic nomination. I happen to think Hillary has a better chance of beating any Republican, but Bernie as our president would be awesome too.","post_message":"YES! Whether you're a Bernie or Hillary supporter, there's no denying the debate audience really loved Hillary's closing remarks. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"471958379619606","commenter_b":"People like carl can't help themselves... He is a result of stupid people having children.... they raise more stupid people... in turn that have more children.....which sadly are unleashed on the rest of us..... It's and incredible and sadly unstoppable event...... OR its that he has to call his mommy Aunt Mommy and his daddy Uncle Daddy... Showing us why incest is illegal... . either way they unleash these morons on the rest of us to deal with....","commenter_a":"Wow talk about prostituting your site @username. Look what I found as an advertisement on your story.","post_message":"Unbelievable."},{"comment_id":"10154655814574411","commenter_b":"just give them what they wont , then the migrants can all go back home and rebuild","commenter_a":"Bill Jos","post_message":""},{"comment_id":"10156397443350725","commenter_b":"Proud of my home state for going for Trump!!","commenter_a":"Trump is a chump. As soon as he gets out of the way we can get about having a serious candidate.","post_message":"Thank you SC! We will NOT let political correctness get in the way of keeping America SAFE! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"10153098509611813","commenter_b":"The ACLU doesn't stand for white heterosexual males or gun rights...ever.","commenter_a":"The ACLU stands for dead babies and bombings.","post_message":"The ACLU supports refugees and stands against fear mongering by politicians. @webpagelink #refugeeswelcome"}]
