[{"comment_id":"1786796021584513","commenter_b":"Pathetic human being","commenter_a":"You are wasting your time.","post_message":"Madonna said she \"will not back down.\""},{"comment_id":"10153177691300399","commenter_b":"Geller is a Bitch Witch.","commenter_a":"Not BS the 700 club news just aired and isis has 71 soldiers in 15 different US states! We do not negotiate with or back down from terrorists! Geller you GO GIRL!","post_message":"Wilmore thinks Geller is flat out crazy."},{"comment_id":"10156197802695354","commenter_b":"More proof that starlets should keep their thoughts and actions to themselves.","commenter_a":"Trash ball----please take out with the rest of the garbage...!","post_message":"The America-hating, donut-licking, liberal icon, Ariana Grande, enlightens the country she hates yet again..."},{"comment_id":"10156034180320389","commenter_b":"He is a crybaby and moron. I used to watch him until he started with the crocodile tears and he looked so pathetic. The media should report news and not shove their opinions on anyone. If he hates Trump, that's his opinion and he should not voice it on the air","commenter_a":"It's crazy how Trump fans treat those who disagree with them. Many Megan Kelly fans and Beck fans threw a fit that someone didn't believe as they did about Trump. Is this how we treat each other? Drop people like a rock when they disagree with us? Start name calling? Sean answered Beck honestly and with class. Which is more than most of you are doing. I have great respect for Beck AND Hannity. Even if I don't always agree with them. But after years of following Glen Beck- it's clear that nothing drives him more than a love for this country.","post_message":"My response to Glenn Beck who criticized me earlier this week for supporting Donald Trump."},{"comment_id":"10153633951734170","commenter_b":"They are undocumented aliens.","commenter_a":"I find the term \"undocumented immigrant\" offensive. The press should stop using it.","post_message":"Epic VIDEO. Trump slams the proverbial door on a reporter who warns him that the term \"Anchor Baby\" could hurt someone's widdle feewings."},{"comment_id":"645397708975441","commenter_b":"Wow, does he have any world facts available to him?","commenter_a":"My 15 year old answered the question","post_message":"This is just laughable."},{"comment_id":"10155781129770329","commenter_b":"The Government shouldn't be funding ANY OF IT, that's the reason it would be discontinued. The Federal Government protects our borders, prosecutes Federal crimes (FBI) and unifies States with Federal Laws under the constitution. That's ALL I WANT THEM TO DO. I support Trump cleaning house on the outrageous spending the Federal Government has been doing for some time. PBS can go back to private funding and telethon like they did when I was a kid. NPR, same idea. They need to raise their own money like any other radio/news outlet. The amount of fees we will begin to charge Mexico for deporting all the people they let cross over will pay for The Wall. In taxes to Mexico for importing goods here. Learn basic Economics and US Government people, geez...","commenter_a":"The best part about PBS, NPR, and those other arts programs that are getting cut is that they actually don't cost that much. So, really, there isn't a lot of money being saved to go towards the idiotic wall that he wants to build.","post_message":""}]
