[{"comment_id":"1243601928984608","commenter_b":"Speak for yourself, Bertha. Don't pretend you speak for the majority of women because you sure as hell don't!","commenter_a":"Don't have the right to impose their beliefs on others.. huh? Well, then the religious right should stop right there...","post_message":"Ted Cruz’s tour de transphobia has embraced a new extreme position."},{"comment_id":"10157488430805354","commenter_b":"Lock her up !","commenter_a":"She should strike her","post_message":"***Viewer Discretion is Advised*** The mother, streaming live on her daughter’s account, tore into and struck the 16-year-old numerous times for posting provocative photos of herself on Facebook...."},{"comment_id":"1377352988951720","commenter_b":"@username ok naked girl","commenter_a":"Chaos? Not really, just a bunch of virtue signaling, brainwashed and hypocritical snowflakes doing their stunt... Stop this nonsense, people support Trump!","post_message":""},{"comment_id":"1250167005050052","commenter_b":"Fuckgirls. Yep.","commenter_a":"Aja can fuck girls be one word? Lmao","post_message":"Let us know! #2016 #WSHH"},{"comment_id":"1628546037432509","commenter_b":"Go get those evil men!","commenter_a":"Exactly... Agree with you @username!!","post_message":"WHOA! This weapon is like something out of the Iron Man movie..."},{"comment_id":"859635514085473","commenter_b":"Go home ma","commenter_a":"If she is going to run like a man then she should not be treated any differently than a man would be.","post_message":"After laying out plans to 'run as a woman,' Hillary Clinton is outraged at a Republican for bringing it up"},{"comment_id":"519047684966878","commenter_b":"I wanna know what is fallacious about my statement. If we can't afford social programs to help the people of this country, how the fuck are we gonna pay for a war? Not a Bernie fan, but you can't trash one candidate because \"We can't afford him\" when Trump wants to cut shitloads of taxes, and THEN try to finance a mass deportation, a war, and then a wall. Don't even get me started on how prices will shoot up on produce, as well as anything illegal immigrants touch.","commenter_a":"Honestly Bernie Sanders not winning would make me lose complete hope for the US. They are being presented with one of the most honest, genuine, good hearted humans possible, yet they prefer to give the likes of Donald Drumpf and Hillary Cliton their attention. Jesus help these poor people.","post_message":"Sanders doesn't think the delegate count matters right now."}]
