[{"comment_id":"10156082273560354","commenter_b":"Why in truth is it impossible to build this wall and yet we can send people to the moon???????????????????????????????","commenter_a":"UNIVISION owns Rick Perry now?","post_message":"\"It’s 1,933 miles from Tijuana to El Paso to Brownsville and you’re not going to build a wall on that distance. What you are going to do is...\""},{"comment_id":"533308460200216","commenter_b":"If you are Gay, Why are you voting for Hillary when she wants to bring in thousands of refugees that believe all Gays should be executed? If you are Black, Why are you voting for Hillary when she admires Margaret Sanger and defends Planned Parenthood who want to abort as many black babies as possible? Exterminate the black race because they are like \"weeds\". (Margaret Sanger quote) Most of those clinics are in Black neighborhoods. If you are a Christian, Why are you voting for Hillary Clinton when she wrote her Senior thesis on Saul Alinsky who dedicated his book 'Rules for Radicals' to Lucifer (the Devil)? She says he was, and still is her mentor. If you are a Veteran, in the Military, or closely related to a Military member, Why are you voting for Hillary when she left those men to die in Benghazi and had the nerve ...","commenter_a":"Why can't we have all candidates for a debate? 1-2% should be enough for them to take the stage. Do you guys agree?","post_message":"What questions do you have about the elections? We're in CNN's Election Center with CNN Politics Executive Editor Rachel Smolkin and Political Director David Chalian. #CNNElection #ElectionDay"},{"comment_id":"10153402450349456","commenter_b":"And he's out on bond in Montgomery and Elmore counties? What a joke","commenter_a":"Thug life is no good.","post_message":"One official said this is the worst case of home repair fraud he's ever seen. The suspect is also facing a murder charge in Elmore County."},{"comment_id":"1028137907274272","commenter_b":"I just want to know all you people that are here illegally, if you love it here so much why haven't you went through the process of becoming legal? And if not then bye bye. I mean it's pretty fu**ing simple. Get legal citizenship or get booted back to wherever you came from. You need the United States, the United States doesn't need you.","commenter_a":"It's all fun and games until she gets deported with the rest of us.","post_message":"Meet Miriam Cepeda, a 24-year-old Latina and a self-proclaimed \"Trump girl\" campaigning for Donald J. Trump in Texas, 8 miles from the Mexican border. @webpagelink"},{"comment_id":"10153095122281770","commenter_b":"Screw her","commenter_a":"DONALD TRUMP for PRESIDENT","post_message":"Hillary Clinton urged attendees at her Alexandria, Virginia, campaign rally on Friday to “start a competing organization” to the National Rifle Association and join her fight to end the “plague of gun violence.”"},{"comment_id":"882454405123315","commenter_b":"Divide and conquer Michelle. This is proof that you and your husband have sent this country back to a time of racial unrest and inequality like never before. I pray our country will soon be able to start healing and undue the damage you two have caused. In 18 more months, we'll be free of this kind of leadership","commenter_a":"She just proved racism towards the whites with every word spoken","post_message":"Michelle Obama is an embarrassment to America. We're ashamed to have her in the White House! WATCH what she just said..."},{"comment_id":"1052907811455998","commenter_b":"She looks like Hitler's nasty ass! THERE'S A PARTY GOING ON AND THE TRUMP TRAIN TO GET ON, CHOO CHOO, CHOO CHOO","commenter_a":"The left wing nuts see trump as a dictator. He's trying to follow the Constitution and our rule of law. What a bunch of morons","post_message":"Sarah Silverman is a _____________."}]
