[{"comment_id":"10156550543770389","commenter_b":"Tonya I thought you were referring to refugees especially Syrian ones. My mistake. Sanctuary cities are liberal ridiculousness and need to stop. I don't agree with them at all. I see what you mean about a major delay.","commenter_a":"I am amazed at how Christians can look at Trump and Cruz and not see that Cruz is clearly the choice for POTUS. 'By their fruits you will know them', Matt. 7:16. Very disappointed with Sara Palin and Rev. Falwell; they should know better.","post_message":"Question of the Day: Which Republican do you think will be the best candidate for evangelicals?"},{"comment_id":"10152852591771749","commenter_b":"no body know mr. president.... it depends if the people believed to have done the right thing","commenter_a":"United we stand as the greatest nation in the world. USA' USA' USA!","post_message":"Let's go."},{"comment_id":"10152705151371234","commenter_b":"He has a temperament ill suited to public office.","commenter_a":"That's because he didn't bring me KandyKakes, a cheese hoagie, and soft pretzels. Serves him right, loser.","post_message":"\"I think the trip was an utter failure... It should have been a trip of 'good behavior' instead of showing a short fuse,\" said a presidential historian at Rice University of Governor Chris Christie's trip to the U.K."},{"comment_id":"10154376127101509","commenter_b":"Unemployment has been the highest it's ever been under his presidency. It has just recently declined...ever since republicans took control of congress. Hmmm @webpagelink","commenter_a":"He is the worst president in the history of this once great nation. Bush is a close second. Those two have done more to destroy personal liberty and prosperity than any presidents before them. Obama is such a hypocrite. Scolding this country about division between races and religion when he has done more to divide this country than anyone in history. I need a shower after that garbage.","post_message":"President Barack Obama presents \"four big questions that we as a country have to answer \" during his State of the Union address. #SOTU updates: @webpagelink"},{"comment_id":"10154304123721051","commenter_b":"When Leftists Attack - Man Harassed For Wearing #BuildTheWall T-Shirt","commenter_a":"Teddy Roosevelt was our President during a different time period. Our country has grown in diversity, and as we continue to progress, expanding our minds and opening our hearts is the order of the day.","post_message":"Do you agree or disagree with this Theodore Roosevelt quote?"},{"comment_id":"497157623808151","commenter_b":"Oh but their day is coming!!! We will show up one way or another!!!","commenter_a":"Obama sucks","post_message":"ISIS just made a huge move against America. This is unacceptable. Spread this post, we need to fight back. Do you agree ISIS should be wiped off the Earth?"},{"comment_id":"10153756353381337","commenter_b":"Samantha, I am aware of the defintion. Just telling you its irrelevant. It's a stupid term made to put people down for making different choices.","commenter_a":"Taylor swift is a hoe she goes thru like 4 boyfriends a year","post_message":"IT'S OVER: Taylor Swift allegedly dumped Calvin Harris because of an, ahem, \"massage\"..."}]
