[{"comment_id":"10153174947101545","commenter_b":"So what's your excuse then casey?! Bahahaha!!! Mama was drinking when she was pregnant with you?!","commenter_a":"Now she and her followers will claim that she was jailed for being a christian, as opposed to a bigot hiding behind Christianity.","post_message":"A Kentucky county clerk was found in contempt of court Thursday for her refusal to issue marriage licenses in wake of the Supreme Court decision to allow gays to wed."},{"comment_id":"1038763572850057","commenter_b":"That is why UK and USA loves family rulling there in the midle eastern countries. Democracy, peace and stability there in M.E does not help uk and usa that is not what they after it is the mess and the chaos they are after and this is what they benefits from. Unfortunately it has always been like this. If not why they remove all thse regeme in ME but not even one country could not see better? IRAQ Libya are tw good examples","commenter_a":"The only people who should be ashamed are the terrorists bombing their own country, who made these refugees flee in the place.","post_message":"'Humanity washed ashore. SHAME SHAME SHAME...'"},{"comment_id":"10152712712566545","commenter_b":"That was a WOMAN.","commenter_a":"That lady in the van just opened a can of Whoopass","post_message":"Here's the incredible ending to a nerve-wracking chase in Dallas County. We'll have the latest on News 8 at 4. TO WATCH/READ MORE: @webpagelink"},{"comment_id":"10152720268826636","commenter_b":"Sweet name bro","commenter_a":"Old people are more of a danger than teenagers.","post_message":"Why you should always keep your eyes on the road."},{"comment_id":"1085989268155126","commenter_b":"How old is this beech? She sound ignorant dumb and stupid. U need to stay off the coke white girl!","commenter_a":"Send her back to the bunny Farm.....she's useless....","post_message":"Tomi Lahren says #BlackLivesMatter is the new KKK."},{"comment_id":"869870296383645","commenter_b":"I got bad news my greatgranddad was a yankee from OH I;m from KY. I know the war was over states rights","commenter_a":"My family were Union all the way but I have no qualms about the Confederate flag.","post_message":"\"In a free society, offensive speech should not just be tolerated, its regular presence should be celebrated as a symbol of democratic health.\""},{"comment_id":"1281672095204357","commenter_b":"Yep, in with the younger roaring lion, out with the old senile evil slimy snake.","commenter_a":"I hope he can get Congress to kick them out of NYC. That building would make a remarkable place to house and care for our vets and homeless. That would save us so much money. The UN is not needed for us. No one I know wants to belong to a One World Order and governance. Let them move somewhere in Europe and take Soros with them.","post_message":"This is going to be good..."}]
