[{"comment_id":"1756660697910009","commenter_b":"I hate everything about this wannabe she makes me sick","commenter_a":"I think I throw up in my mouth every time this convict opens her trap.","post_message":"\"Don't let anyone tell you that our country is weak. We're not. Don't let anyone tell you we don't have what it takes. We do. And most of all, don't believe anyone who says, 'I alone can fix it.'\" Hillary Clinton slammed Donald J. Trump, saying his words \"should set off alarm bells for all of us.\" @webpagelink"},{"comment_id":"10153029899116336","commenter_b":"She's a idiot.","commenter_a":"What a joke! Anything to grasp at more sympathy","post_message":"'American Sniper' Chris Kyle’s wife, Taya, asked family friend and U.S. Navy SEAL Pete Scobell to record the song \"Hearts I Leave Behind\" to honor her late husband. Watch Scobell's performance from earlier today on Fox & Friends."},{"comment_id":"1342964245730921","commenter_b":"Yes, Hillary ALL THE WAY!! Andrea, go away!!","commenter_a":"She asked the tough questions and Hillary was very professional and gave very informative answers. All together I think it's helped her giving this interview. Trump could never have been so poised with his answers. I think she has been doing great with her campaign. Hillary 2016","post_message":"This is not journalism by any measure."},{"comment_id":"1555472744739839","commenter_b":"Screw them! Go get a job and pay for your own damn food.","commenter_a":"Get off your butt and look for work. In meantime, thank which ever god you pray to for living in a country that gives Food Stamps!!","post_message":"This is outrageous. If you're that picky get a Job and buy whatever you want."},{"comment_id":"1022630587845203","commenter_b":"Trump is not racist. He wants to build a wall so he can get criminals out, and keep them out. No way would he, or would congress allow, deporting 11 million illegals. He doesn't hate Muslims, just wants to keep ISIS out. Look what refugees have done to Germany. Hillary has the media in her pocket. Wake up America!!","commenter_a":"Considering all that confetti at Hillary's nomination was the shredded up emails...I would say for honesty and safety...Trump won hands down.","post_message":"Now that all the balloons have fallen, who won the convention ratings race, Donald J. Trump or Hillary Clinton?"},{"comment_id":"1083798354993969","commenter_b":"You're an ignorant cunt Rosie","commenter_a":"Sell yall anything and then yall prounce on it. He ain't sided with humility that's his only thing he can do to them white bois. As a black police officer he can't beatem, rough them up, shootem, killem like they do \"somebody's\" people. That's for sure a death sentence then.","post_message":"When a KKK member suffered a heat stroke at the hate rally in Columbia, a black police officer put aside his personal feelings and sided with humanity."},{"comment_id":"10154174664018812","commenter_b":"She's repeatedly called black people, \"Super Predators\".","commenter_a":"It is sad what the Clinton machine has done to such a great man. While Blacks were fighting for equal rights in the '60s. Sen. Sanders was on the front lines risking his life while Sen. Clinton was supporting a white supremacist. Most of my fellow Black American brothers and sisters have unfortunately fell for the Clinton scam and it is going to cost us big time.","post_message":"JUST IN: ABC News projects Bernie Sanders will win Nebraska Democratic caucuses."}]
