[{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this. Do you agree with the Iowa Gov.?"},{"comment_id":"774112892726570","commenter_b":"Shit up traitor go suck on Hillary's nipple","commenter_a":"Know why? Because your last name means he who sands as in sandpaper.","post_message":"Boom. #DemocraticDebate #DemDebate"},{"comment_id":"10153549578273984","commenter_b":"Kims a whore so who cares","commenter_a":"If killing people make me happy, should I go around and do it? No. I hate when people say, do what makes YOU happy. Hmm. That can apply to a lot of things which are wrong. We should do what makes the Lord happy.","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with... Do you side with Megyn Kelly on this one?"},{"comment_id":"729190623881952","commenter_b":"You say that as if the right wing doesn't itself demand political correctness. The right wing gets its panties in a wad if someone dares say, \"Happy Holidays\" instead of \"Merry Christmas.\"","commenter_a":"Political Correctness is not a joke ... it's a dangerous growing cancer in our society and it's going to destroy our nation if we don't stand up for our freedoms while we still have them ....","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.” Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"10152909977971051","commenter_b":"I agree kaelyn! Things like this should be an eye for an eye with this sick twisted woman!!","commenter_a":"I think 9 yrs is not enough but she should get the same treatment she gave her son. Pour boiling water on her starve her. And trekking police she was a troubled child cuz of her crack head mother is a tactic to get out of more jail time!!! Pour baby I feel for the kids","post_message":"This woman was embarrassed by her 9-year-old son’s disability – so she decided to torture him."},{"comment_id":"1392748740784870","commenter_b":"Uh, he mowed down 100's of people. Definition of terrorist. Congrats on breeding and raising a supreme loser of the highest magnitude. Obviously he got his stupidity from you, seeing as you don't know terrorism when it sprung from your loins.","commenter_a":"Why did ISIS wait long before declaring the attack !! because it was not an ISIS member !!","post_message":"Family of killer insist he's 'not a terrorist'"},{"comment_id":"10153818246882293","commenter_b":"Leave it to mysoginists to make the case for feminists better than any feminist could.","commenter_a":"Women, get over it! You are way too thin-skinned, take yourselves too seriously, and get offended at the drop of a hat. Loosen up and quit being so tight-assed.","post_message":"If 75 percent of women told researchers they view Trump unfavorably, who is it that backs Trump?"}]
