[{"comment_id":"10154807538199705","commenter_b":"This chick probably enjoys white wine and Xanax every night.","commenter_a":"I cant beleive how you support the use of illegal drugs, they destroy everything, stop pretending it is fun or in to use them","post_message":"Andrew Garfield is living his best life."},{"comment_id":"10153366169796336","commenter_b":"This chick is STUPID!!!!!!","commenter_a":"Now all the blacks who have been passing themselves off as white will come forward to get media attention!","post_message":"\"She's been white all the way up until 2011, when she started to change the way she looked with the clothes she wore.\" Rachel Dolezal's brother joined \"The Kelly File\" to address his sister's recent claims to reporters."},{"comment_id":"10154153182021519","commenter_b":"The joke is going to be on the fools who think Trump is bringing their jobs back.","commenter_a":"... . : get uses to it, the next four years is going to be the Donald Trump Aion of the dead-letter-literal-interpretation Christian religious right fundamentalists. The poor rust-belt have-nots put Trump in office because of neoliberalism global economics And the religious right put Trump in the White House , because They want Supreme Court judges to turn back abortion and gay rights etc. . And neoliberal Wall Street buddy's of Trump will get what they want , deregulation for Wall Street and tax cuts. The right wing is in the candy store and everything is free . Like I said; the next political reality show startes after November. ~~~ ~","post_message":"Ted Cruz in the Supreme Court sounds like a nightmare."},{"comment_id":"1113705405389179","commenter_b":"Why do we have 400,000 permanently disabled Americans? Oh because of the 2,996 people killed and more than 6,000 injured during 9/11? So we lost more Americans in good health because war mongers like Hillary Clinton wanted to strike back? Thanks Hillary for your vote on the Iraq War.","commenter_a":"Thank you, Obama...we love you as a President!","post_message":"Excellent news for 400,000 Americans!"},{"comment_id":"494885290693351","commenter_b":"Say what you will, but she has the right to stick with her belief.","commenter_a":"For one, she's not crazy, for two, Congress has to pass the laws,and no law was passed for her to grant marriage licenses to gays. Gods law, IS LAW","post_message":"One side has got to give in. Right?"},{"comment_id":"1736088283296773","commenter_b":"And women!","commenter_a":"Shout out to CFD and their brave men and women that r serving","post_message":"BREAKING: A massive fire is burning in Chicago's Lake View Neighborhood. At least 3 buildings are engulfed in flames. A BIG shout out to the CFD for their incredible work."},{"comment_id":"10156258730695725","commenter_b":"Come to grand junction","commenter_a":"medias are crooks ...liars liars and liars gooooo trump you still got my vote and my whole family","post_message":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair #GOPdebate!"}]
