[{"comment_id":"10152783958260667","commenter_b":"You need to wake up lady !","commenter_a":"They are not public property. They are her private emails. You are all so crazy about your rights but not anyone else's. They were on a private server that had more security than her work emails. You need to take a cold shower.","post_message":"Looks like those who want a look at Hillary Clinton's emails have a long wait ahead of them."},{"comment_id":"2017999998425158","commenter_b":"No. That was Colin Powell.","commenter_a":"Actually, I'd rather see him choose someone like Condoleeza Rice!! She's a highly Intelligent, Accomplished diplomat and a true conservative.. It's my opinion that because of Her past Experience she's emmininty Qualified for the VP. Position.!!.. And could bring much needed strength and unity to Trumps campaign and the Republican party.. It would also help to put to rest the Unfounded accusations against Trump regarding women.. She's also not part of the existing establishment.","post_message":"Would you like to see him as VP?"},{"comment_id":"10153961752341037","commenter_b":"Duh, obamacare is funded by government (taxpayer dollars)","commenter_a":"If obamacare is so great, why is it that the clintons & sanders are not enrolled in it?","post_message":"Bernie Sanders airbrushed the complexities of trying to overhaul health care all over again and Hillary Clinton offered a selective reading of her rival's record on gun control in the latest Democratic presidential debate."},{"comment_id":"10153877660438812","commenter_b":"Wow, you're just full of fear. They're just people that want to use the bathroom. Get over yourself. No one wants to look at you or your ugly daughter anyway","commenter_a":"This just in! All teenage boys are claiming to be trans to gain access to girls' locker rooms.","post_message":"The DOE says an Illinois school district is violating the rights of a trans student by denying her access to the girls' locker room."},{"comment_id":"10155017567319628","commenter_b":"That's a lie Muslim DID NOT HELP BUILD AMERICA","commenter_a":"that is wrong, they (muslims) had no part in building America.","post_message":"Ohio State University is now teaching students that Muslims helped build America"},{"comment_id":"10152874752876336","commenter_b":"Don't let her have kids exterminate this animal.","commenter_a":"Shoot on sight!","post_message":"Manhunt underway: Police are searching for Hayat Boumeddiene, a suspect in Thursday's murder of a French police officer. Tune in to Fox News Channel for special coverage now."},{"comment_id":"10153659617321323","commenter_b":"What about the kids, which is the entire point of the article?","commenter_a":"Just one big difference here. Kyle has asked for privacy, and presumably won't be going voluntarily onto TV shows to discuss his divorce. The people that appear on his show do so voluntarily, so are obviously less concerned about privacy for their issues. Stop trying to compare the two. Theirs no hypocracy here.","post_message":"\"What does Jeremy Kyle think is more likely: that a child’s parent or parents appearing on his show will constitute a mere 49 minutes in their childhood, or that its ripples will magnify that car-crash public event enormously – grotesquely – into something that cannot fail to be formative, and endlessly repercussive in its damage?\""}]
