[{"comment_id":"10156205584795354","commenter_b":"Right, blacks and immigrants are the problem. It was a white kid who went into a black church and shot and killed 9 blacks while they worshiped. It was a white kid who went into the Sandy Hook Elementary School and shot and killed 20 children while they were trying to learn. He also shot and killed 6 educators who were trying to teach the days lessons. It was a white man who went into a theatre in Lo. and killed people while they were watching a movie for enjoyment. It was a white man who went into the theatre in Co. and shot and killed people who were out for a night of entertainment.","commenter_a":"If people like her wouldn't say dumb shit like this, then most of the \"white people\" wouldn't be racist towards blacks. They just keep it going instead of trying to get to the problem, causing more anger and violence from within everyone.","post_message":"“Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.”"},{"comment_id":"1749451101986580","commenter_b":"Disgusting ... Soooooo sick of the ignorant and desperate race card being used - Clinton you are literally turning my stomach as you spoke often, all on recorded tv I may add, of protecting our borders from illegal immigrants and the insurmountable costs associated with this illegality - it's not racist, just one nation cannot afford to take on the needs of an impoverished third world nation that hides vast amount of hidden cash and hurts their citizens - you are such a liar and hypocrite - like now you should completely lecture us on keeping healthy and happy marriages - you and your lying inept money grubbing hateful wife make me sick - literally sad for any one that thinks you are role models - just so so so sick","commenter_a":"Racist not at all. Trump/Pence will be better then the evil woman! No question about that! I believe that Billy is suffering from a sexual disease that is destroying what mind (little left).","post_message":""},{"comment_id":"10153243373545950","commenter_b":"Go Hillary...to JAIL","commenter_a":"BREAKING NEWS: Donald Trump, Republican presidential candidate drowned today, apparently he was trying to learn to waterboard.","post_message":"President Obama banned the practice of waterboarding and other so-called \"enhanced interrogation techniques\" after he took office. But Donald J. Trump said he would \"bring it back\" to fight ISIS."},{"comment_id":"10154174646349641","commenter_b":"That is so primitive to cage a living being and then let the others watch the poor thing. This is absolute human lowlesness as I call it, the worst specie in the entire universe for sure ! I hope humans will not go to outer space and colonize other planets and do the same thing what they did on Earth !","commenter_a":"Poor gorilla! Yes I agree the irresponsible parents are at fault for this incident.","post_message":"Ian Redmond, Chairman of The Gorilla Organization, said keepers had other options besides a fatal shot."},{"comment_id":"675915449265700","commenter_b":"Muslims are animals,filthy Scum!","commenter_a":"Get rid of all muslims there nothing but problems.","post_message":"Putin just verbally destroyed this Muslim ambassador. He's on a mission to put an end to Muslim brotherhood. Are you glad someone is standing up to ISIS?"},{"comment_id":"907290132700573","commenter_b":"Grossly misinformed woman, too.","commenter_a":"You reap what you sow, so when your harvest comes in, don't be crying cause it ain't what you wanted. You sow perversion & corruption, you will reap your harvest.","post_message":"Will marriage equality really kill people, cause 900,000 abortions and undermine heterosexual men?"},{"comment_id":"10154264238746509","commenter_b":"We have been since before 9/11, WTC was hit twice by them","commenter_a":"No we are not at war......but we do have a cancer growing that needs to be eradicated !!!!","post_message":"U.S. Senator Ted Cruz said Thursday that the deadly mass shooting in San Bernardino, California, shows that the country is \"at war.\""}]
