[{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"},{"comment_id":"10153687652479885","commenter_b":"That was stupid! Sounds like she needs to take that conceal carry class again!","commenter_a":"If you pull a gun out you need to pull the trigger. Shoot to kill not just threaten.","post_message":"A Florissant man was charged Tuesday with grabbing a pistol from a woman Saturday as she was trying to prevent him from attacking her friend in University City, then beating her and her friend with the gun and shooting one of the women."},{"comment_id":"1276041149107332","commenter_b":"Just another moronic Hollywood actress.","commenter_a":"Idiot no but of Obama and kilary have their way then you need to worry cause people like me want save you from the Muslims you help let in our country","post_message":"SARAH JESSICA PARKER FEARS She'll Be Attacked And Killed If Trump Is Elected…LOL! Has She Not Seen MULTIPLE TRUMP Supporters Who've Been Bloodied By Hillary's Lib Mobs? [VIDEO]"},{"comment_id":"10154001620082377","commenter_b":"I don't think that would work here, just look around now, pants below waist so nasty drawers complete with nasty skid marks being worn, woman with breasts hanging out of clothes and jeans with the butts completely exposed, (men and women), FU t-shirts, and on and on. Burkas would improve these types, so no, let them wear burkas.","commenter_a":"The thing is that it is part of their religion and I think we should respect their right to wear it, it is not indecent. I can think of a lot of people who benefit from it , you know to cover up too tight pants on someone who is obese and so on.","post_message":"Angela Merkel calls for Germany to join France, Belgium and others in banning the burqa. Should America be next?"},{"comment_id":"10153734508783132","commenter_b":"I have often said this...there comes a time when women need to realize this","commenter_a":"Just because you can wear one doesn't mean you should.","post_message":"NENE LEAKES can definitely rock a bikini."},{"comment_id":"940104752760731","commenter_b":"She's above the law,obviously","commenter_a":"What the hell is going on that this person can trash our national security and still be running for office when she should be in prison! Martha Stewart went to prison for less crimes!!","post_message":"A leaked email from 2014 shows Hillary Clinton reportedly wrote to then-Obama counselor John Podesta that Saudi Arabia and Qatar are funding ISIS. @webpagelink"},{"comment_id":"10152641754716367","commenter_b":"Yes she is!!! She wears Spanx.","commenter_a":"Mucho baggae...g","post_message":"The Hillary Clinton email controversy is a reminder of one inescapable fact: She comes with baggage."}]
