[{"comment_id":"10153614155549117","commenter_b":"@username you seem perfectly willing to dismiss the notion that the unborn have rights. I have no idea when to legally call a fetus a human. If a pregnant woman is beaten and loses her child is it simple battery. I don't know. When I was young I learned hunting and gun safety and rule one, you don't shoot at noise, a rustle in the bushes. Why not? Because there is a chance it may be a person. A real libertarian solution would be upon finding out she is pregnant she must claim she doesn't want to take care of a child and surrender right to it. If someone else is willing to take that child and be legally responsible for it then it gets rights and she needs to take personal responsibility (libertarian) and not be aggressive towards the fetus and turn it over on delivery.","commenter_a":"The best thing libertarians could do is reexamine their approach to abortion as their current stand favors personal privacy over personal responsibility and non aggression. Another possibility is to slightly widen the area we need to defend, to treaties,in order to be safe at home. Remember, economic liberty is the most important issue.","post_message":"John McAfee: \"The truth is this year at least there's maybe a 0.005 percent chance that any candidate on this [L.P.] stage wins the election. If we don't, if we get 20 percent, I promise you, if we don't do something to win in a real sense, this world is going to collapse.\""},{"comment_id":"10154076651981955","commenter_b":"She needs... Wait for it... To be ARMED. That jackass would think twice about that move if she was packin a pc....cmon ladies.. Do NOT be this asshole's next victim","commenter_a":"Horrible black bastard, should be shot! 100 times!","post_message":"WARNING THIS WILL MAKE YOU FURIOUS"},{"comment_id":"606394809493701","commenter_b":"Wish they would come here n do that to woman who use lil kids as weapons against their Dads .","commenter_a":"Christians werent complaining when they wiped out the indians or burned people in the south","post_message":"Show this a liberal."},{"comment_id":"10153702607362014","commenter_b":"Heck yes I'll be trying this!","commenter_a":"This makes me think of good luck Charlies Bob-burrito lol","post_message":"It's the hybrid you've always hope for (or quite possibly not)."},{"comment_id":"843350562368952","commenter_b":"With the UK refusing to stop child molesting rings, why is it surprising that thier corruption extends to the zoo.","commenter_a":"Not a fan of any of the stories that start...\" You won't believe what happened after this....\" It's The Star magazine hook line and sinker. It's like the Kardashians are the publishers.","post_message":"\"Zoo of Horrors\""},{"comment_id":"10153691718919062","commenter_b":"Maybe if you stopped seeing breasts as sex objects, this wouldn't be an object. Maybe if your dog of a husband can't stop looking at a breastfeeding woman, the issues lie in your relationship and not with the poor woman trying to feed her baby. Just saying.","commenter_a":"Not in public. I breast feed my daughter but some things should be private! When I go out to eat I dont care to be paying $80 and having to see someone elses boobs out of the corner of my eye. Then when you have younger children they point and ask why that mommys boob is showing & what is she doing? Then there are guys who get distracted by anything-anything at all. So- this is dinner and porn all in one. Thanks for ruining our night out.","post_message":"TONIGHT AT 10: A major apology from a Texas coffee house after a breastfeeding mother is told to cover up. Should breastfeeding be allowed anywhere, or should there be designated areas?"},{"comment_id":"10153664512035530","commenter_b":"Ya Chaldean girls are cute ;) lol","commenter_a":"Honestly it's about half right. But if you want to talk about the Metro Detroit area as a whole there are some really beautiful women in the area. I was at Exodos rooftop (in Greektown) in the Summer a couple years back talking to a girl that was there from Philly and she said how good looking everyone was. The Albanian and Chaldean women in Metro Detroit are GORGEOUS. The city itself might not be the prettiest but there are some beautiful foreign women in the area. But I know the article wasn't just focused on the people.","post_message":"Detroit takes it on the chin in this survey based on nightlife, setting, hot locals and \"an undercurrent of desire.\""}]
