[{"comment_id":"1167588859974389","commenter_b":"Bo Go Back To Fucking Your Sistermommy","commenter_a":"Isn't that great ! I am happy to see Trump gets that endorsement. Hillary is probably sick with envy but she got an endorsement from BLM...and other terrorist groups.","post_message":"Major Endorsement from our Heroes on the Frontlines..."},{"comment_id":"10155980506710725","commenter_b":"@username. I see why you love her lol","commenter_a":"Whoopee","post_message":"What do Amy Schumer and Judd Apatow do when they find themselves stumbling into an Irish wedding? They make the most of it, of course! Watch the wedding crashing incident, all caught on video ----> @webpagelink"},{"comment_id":"1152705121429163","commenter_b":"Illegals are voting in our elections.","commenter_a":"Don't you think you should stop asking this question and read the Constitution of the United States dumbass!","post_message":"I Agree!"},{"comment_id":"10154674776698010","commenter_b":"I've met a few bitches in my life Derek's mom and @username girl were both on that list.","commenter_a":"Pence basically saying hey I'm a rich white male never get stopped by police why should I care .","post_message":"Gov. Mike Pence spoke about police killings and the need for \"law and order\" at the debate. He ended by asking his opponent, \"Senator, please, enough of this seeking every opportunity to demean law enforcement.\" More debate updates: @webpagelink"},{"comment_id":"10153900591048812","commenter_b":"You mean creation of George W Bush and Cheney.","commenter_a":"You go France! I wish our president was like yours. We need to destroy this creation of Obama. But firstly we must impeach our muslim-terrorist president!","post_message":"TARGET ISIS: French fighter jets take off on mission to strike ISIS targets in Syria; at least 20 bombs were dropped on ISIS’s de facto capital in Raqqa. @webpagelink Video: Defense.gouv"},{"comment_id":"10156415559120354","commenter_b":"This woman.. Needs to be sent to a Muslim refugee camp ... What a sorry idiot ...","commenter_a":"Bill should be running for president","post_message":"“56% of Americans believe that the Syrian refugees have odds that are at values — their values are at odds with our values. That may not be wrong. If you are in this religion, you probably do have values that are at odds. This is what liberals don’t want to recognize.\""},{"comment_id":"1215065415200595","commenter_b":"That one black girl would have kicked their ass","commenter_a":"All it would've taken is 1 black girl and no one would give a shit","post_message":"These young racists aren't laughing anymore."}]
