[{"comment_id":"699418583582053","commenter_b":"Jaye you're a perfect example of a dumb blonde .....","commenter_a":"What in the heck did Obama do to deserve impeachment!!!! People are just RIDICULOUS!!!!!","post_message":"Obama's college records were finally publicized and what they say... This is exactly what he has been trying to cover up for so many years. Do you think Obama should be impeached?"},{"comment_id":"10154512310684726","commenter_b":"her face looks like a duck.","commenter_a":"Liar","post_message":"Tammy Duckworth says they’re all orphans and widows because the men are 'all dead.'"},{"comment_id":"563542197162994","commenter_b":"Dear black lady: it's stupid to do either example you gave. Way to drink the cool aid.","commenter_a":"Yesterday in Charlotte (As per Charlotte Police Chief--He's Black)Black man exits car with a gun in his hand, told to drop weapon and refuses....shot by a black police officer. Gun recovered....not a book. Stop the false narrative! Stop the Madness!!","post_message":"At least 12 officers and 5 demonstrators were injured in protests in Charlotte after a black man was shot and killed by police. Video shows protesters destroying a marked police vehicle."},{"comment_id":"10154527914443690","commenter_b":"Wolves under the goat skins are those who invaded their countries; not them; refugees!","commenter_a":"They are terrorist not refugees, two years from now their host community will be destroy....","post_message":"\"Failure to address serious abuses appears to be a deliberate policy to deter further asylum seekers from arriving in the country by boat.\""},{"comment_id":"10153309975398128","commenter_b":"Rich girl with bad credit","commenter_a":"Let us all shed a tear for the rich girl...","post_message":"Even the daughter of the CEO of the largest U.S. mortgage lender found it hard to buy a home in one of the country’s hottest housing markets."},{"comment_id":"1118654024897515","commenter_b":"Chemo is poison!","commenter_a":"Nicole, how insensitive can you get? Chemo? with all of the cancer survivors and sufferers fighting their disease with GOOD lifesaving chemo? Hope you never need CHEMO. Trump is not CHEMO. He IS POISON.","post_message":"“The Trump supporters see Trump as political chemo. He may be toxic. He may kill every healthy cell in the bloodstream. But he is the only cure for the cancer that is Washington establishment.” - Nicolle Wallace"},{"comment_id":"572733119579689","commenter_b":"Yeah you gotta be a useless bitch to waste time on Amazon digging these shit custom up for a fucking baby.. NO NOT ME","commenter_a":"@username gotta do this to the baby 😂😂","post_message":"I just grew ovaries and they just exploded."}]
