[{"comment_id":"918831531585696","commenter_b":"Abd the dems preach tolerance but are hnwilling to be tolerant.","commenter_a":"Democrat,s = cult being lead by a zombie . Set devour America","post_message":"Just in..."},{"comment_id":"10154473671751234","commenter_b":"Take the names of all the restaurants employing illegal aliens, seize the records, heavily fine the businesses, and deport the illegals. Give the jobs to Americans- rumor has it, employment for AMERICANS is still suffering. And if you're an American who needs a job, but won't take one, no entitlements for you. There. I said it. Call it common sense.","commenter_a":"What are the party affiliations of the owners and bosses of @username?","post_message":"Some New Jersey restaurants are preparing for a strike on Thursday."},{"comment_id":"10153432042256051","commenter_b":"Those poor people deserve a better life I heard they throw their children in the garbage because they're girls","commenter_a":"Taking misogynists whose lives revolve around subjugation of women is a bad idea. Honor killings and selling daughters are both illegal in America. Thank God.","post_message":"Here's why President Obama says accepting Syrian refugees is the ultimate American thing to do. Do you agree with his message?"},{"comment_id":"979572065469181","commenter_b":"They need to pay taxes!","commenter_a":"If you bunch of socialist morons would adopt the fair tax it would do away with this along with the burdensome irs but yall don't want real answers just partisan socialist big govt","post_message":"It's time for them to start paying their fair share."},{"comment_id":"669424226515949","commenter_b":"lol anybody can change it to anybody wiki is less secure than pussy around trump","commenter_a":"Ben Ellison thought you might like this","post_message":"So, this happened yesterday."},{"comment_id":"1701853746697814","commenter_b":"Dan Chow I maybe a old , but I am not fool !! I been follow Hillary since She was First Lady !! I know how amazing She is !! If you care to know the true about this Lady !! Check: ADDICTINGINFO.ORG list of @username accomplishments !! This are the Facts !!!","commenter_a":"2008 was a President Obama Time !!! <3 Hillary is that Leader for this TIME !!! <3","post_message":"In 2016, everything we’ve accomplished together is on the line."},{"comment_id":"1811243409145396","commenter_b":"what kind of genius stays with a man who outright cheats on you and is a womanizer....","commenter_a":"what kinda genius puts our deficit at $20 trillion....","post_message":"\"Now, how anybody can lose a dollar, let alone a billion dollars in the casino industry, is kind of beyond me,\" Hillary Clinton said of her opponent."}]
