[{"comment_id":"1013838895312830","commenter_b":"That's what girls get, cause they want to grow up fast n experience sex.... Don't blame the man... They r just man... Like a dog give him a bone n he would eat it no matter what...","commenter_a":"Sadly this happens a lot. My neighbors daughter was 14 with a 22 year old. Her parents knew. Let her go to the beach with him, let him stay the night ect.. then they broke up and he broke her heart. The parents put him jail. He now has to register as a sex offender for life. : (","post_message":"FUGITIVE WANTED: The Dickinson Police Department is looking for a 24-year-old man accused of sexually assaulting a 14-year-old. Authorities say they have been unable to locate Joshua Dwight Blair at his residence or last known place of employment. If you know any information about his whereabouts, you are asked to call police or Crime Stoppers. MORE ---> @webpagelink"},{"comment_id":"860902143955854","commenter_b":"That woman is a melodramatic idiot.","commenter_a":"Hey Nancy! Pot IS illegal and it STILL didn't stop him from giving it to his daughter! Legalize it already. Lets save Mexico from gang violence, free up the prisons, and start bringing in tax dollars from paper rolls and business sales. Enough is enough!","post_message":"What's YOUR take on the legalization of marijuana? @webpagelink #Pot2Blame?"},{"comment_id":"10156761367765354","commenter_b":"quit giving her the time of day!!!","commenter_a":"Who knew behind the mask was a racist cop hating jerk, I heard Kanye needs some $$$$ since you gave the black panthers so much why don't you give $$$$$ to another cop hating jerk so he can lavish Kim.","post_message":""},{"comment_id":"10153425885744255","commenter_b":"Look, bozo, I suggested 68. It's 66 now. That's two years, not nine. That's my answer. Thanks for the cute little story, though.","commenter_a":"Social security was developed when people rarely lived to be 65. It's stupid to keep it at 65 in this day and age. Bernie is a fool.","post_message":"Damn straight. By Daily Kos user Tool"},{"comment_id":"1162763547153229","commenter_b":"Betty White Anyone born after 1507 in America is a NATIVE AMERICAN... Those born before 1507 were not NATIVE AMERICANS.. This land mass was not named America until 1507... So Betty White, you are a NATIVE AMERICAN if you were born in America..","commenter_a":"Iwelcome to America, Ahmad Al-Abboud. I hope you, like many refugees, find the American dream!","post_message":"Ahmad al-Abboud, a Syrian refugee who recently relocated to Kansas City, discusses his harrowing ordeal. Watch more: @webpagelink"},{"comment_id":"10153155550251051","commenter_b":"Oh Erika bitch still has vagina","commenter_a":"HUGE.....SORRY ISRAEL...OUR PRESIDENT IS SETTING US UP FOR WAR....SORRY HES SUCH AN EVIL P.O.S....an i for one stand with my people an Israel....suk it obama....rot!!!!!","post_message":"Israel came out and called President Obama's nuclear deal with Iran a big mistake. Here's how they're going to respond to it. Do you agree or disagree with the idea that the Iran deal is a mistake?"},{"comment_id":"10154468706093869","commenter_b":"Maybe not, 45 may beat her to the prison. At least, those of us who are not bamboozled are hoping to see him in a federal prison.","commenter_a":"Dream on. Hillary will be convited and thrown in prison where she belongs.","post_message":"Today's daily cartoon by Tom Toro. Swipe through more cartoons with the New Yorker Today app: @webpagelink"}]
