[{"comment_id":"1035305006509971","commenter_b":"No woman should be a republican if they are smart..","commenter_a":"Young Republicans whyyyyyyyyy!!!!!!!!!!! Is any woman a republican?????????","post_message":"\"this young woman’s death serves a purpose. She 'Took one for the team.'”"},{"comment_id":"1005002076233312","commenter_b":"We do but not you please.","commenter_a":"She doesn't have a heart","post_message":"Do you agree with Hillary Clinton? #SCPrimary"},{"comment_id":"10153551995732217","commenter_b":"Darn foreigners, coming over here putting mosaics under our gardens....","commenter_a":"Claire O'Regan","post_message":"This farmhouse owner was renovating his barn in Wiltshire when he uncovered... a Roman villa built around 200AD 😮 Full story: @webpagelink"},{"comment_id":"10154236838279228","commenter_b":"Very interesting.","commenter_a":"EricBlakeburn Olivia Kesselring","post_message":"A UFO incident near St. Louis captured worldwide attention 15 years ago. Many of the witnesses were police officers."},{"comment_id":"10153708332298984","commenter_b":"Omg. Women bitching. Grow up","commenter_a":"i will always agree with Dana...............jan","post_message":"These woman got into a debate so intense, there was only one way for Megyn Kelly to cool them off... Do you agree with Dana Loesch?"},{"comment_id":"1137271292959073","commenter_b":"Sexist sad people. You know your mother is a woman!","commenter_a":"Hillary is amazing she is a rock! She doesn't go after fantasies, She will be a president like no other. As a female she will be challenged more harshly. Where is her compassion? Where is her Honesty? Where is her strength? Please don't forget she is already feeling and applying all these quialities!","post_message":"“I will absolutely protect your children, yourself, and try to bring your family back together.\" At the #DemDebate last night, Hillary spoke with the mother of five children who have not seen their father since he was deported three years ago."},{"comment_id":"10153481756262507","commenter_b":"@username \"you're\" means \"you are\"--so \"To you're point\" means \"to you are point\"...just an FYI","commenter_a":"If he doesn't win the dem ticket he can still run as independent and take all his votes that really do matter with him! along with over half the so called dems and prob a 1/4 of so called repubs!","post_message":"It's not over until it's over."}]
