[{"comment_id":"10153721033369575","commenter_b":"Karen Crowder what the hell does immigrants have to do with it?!","commenter_a":"What's low gas prices have to do with bed bug's? Are they in the gas?","post_message":""},{"comment_id":"10156282182225354","commenter_b":"Why are they even getting licenses??","commenter_a":"Lord, don't even let me go there, cause my head will explode............","post_message":"Illegal immigrant activists complain that Colorado's illegals aren't getting their driver's licenses issued quick enough. Seriously..."},{"comment_id":"10153142102307144","commenter_b":"DUMB ASS!","commenter_a":"What about soldiers lost in Iraq?","post_message":"Holy crap."},{"comment_id":"513245792199334","commenter_b":"ALL MUSLIM PIGS Get the HELL outa MY country!!!!!!","commenter_a":"Screw you, give her her job back, this is a disgrace to the AMERICAN people! Anyone can make a mistake!","post_message":"A lunch lady was fired for serving pork to a Muslim student. We are in America, give that poor lady her job back. Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"10155881705845389","commenter_b":"Scary? I'd rather say Trump is just plain hilarious!","commenter_a":"I imagine he did, and that's why he is doing so well in the polls! He's a smart man, unlike most RINOs who don't have the guts to speak out about illegal immigration! Donald Trump is gaining support because of his honesty and it scares Republicans and democrats!","post_message":"Tonight, Gov. Rick Perry reacted to the controversial immigration statements made by Donald J. Trump, telling me that he is critical of the \"disrespectful language\" that Trump used."},{"comment_id":"10154594345964749","commenter_b":"@username leave arab countries ask you governments to stop killing people there . and the immigrants will go back","commenter_a":"I think the comment has to be taken into context... Looking at Hungary's demographics, Muslims don't even account for 0.1% of the population. The politician is probably representative of the general public mood there. Although in a more colourful tone!","post_message":"The Hungarian politician was described as “a sad old man full of hate” and his comment was branded as “disgusting”."},{"comment_id":"10153463081456336","commenter_b":"So all that is wrong with this country is the Hispanic Illegals?","commenter_a":"People need to realize something, Donald J. Trump is the only person so far in the entire field of presidential candidates who is willing to take on the genuine issues that the other candidates are so afraid to talk about. The truth hurts, medicine never tastes good. Whether or not he would deliver is another subject altogether. #Trump2016","post_message":"Donald J. Trump says Joaquin “El Chapo” Guzman's escape from prison is evidence that his past comments on Mexico are true. Read more of Trump's tweets and tell us your thoughts. @webpagelink"}]
