[{"comment_id":"10153946118774071","commenter_b":"He is a #WhinyLittleBitch","commenter_a":"If he is not blaming it on the Mexicans, the women, the Muslims, the Democrats, the media or the moderator, it's the microphone. My God what a crybaby. I think Donald need a diaper change 😂","post_message":"Clinton slams Trump's debate performance: 'Anyone who complains about the microphone is not having a good night.'"},{"comment_id":"1395648327124620","commenter_b":"You're pretty much a stupid whore. I feel bad for your kids","commenter_a":"WAHT DONT U GET?????????????????SHE IS ILLEGAL.......Rayos has been required to check in with ICE every year since 2008, when she was caught working under a fake Social Security number...................NO ONE EVEN KNEW SHE WAS HERE UNTIL 2008....WAKE UP STUPID AMERICANS","post_message":"The 36-year-old mother of two is among the first undocumented immigrants to be deported under Trump strict new policies."},{"comment_id":"10153996390124071","commenter_b":"@username STOP ALL WELFARE PROGRAMS AND WE WILL NOT BE FINE! THERE WILL BE MORE MENTAL HEALTH ISSUES, MORE DRUG ISSUES, MORE CRIME, MORE HOMELESSNESS, MORE TRAUMA.. THAT IS NOT THE ANSWER BUT IF THERE WAS A LIVING WAGE PUT IN PLACE WE WOULD HAVE LESS PEOPLE ON WELFARE THAT IS A GIVEN. TOO EASY..","commenter_a":"Velocity of Money: I think it's quite simple if you look at something called velocity of money. What does that mean? That is the money that gets spent back into the economy. When you have the top 1% getting money, they spend 5-10% of what they earn. When you have the lower end of the economy getting money, they spend 100-110% of what they earn. Since we are a consumer economy this will be good for business in the long term. Not for the people getting the $15 per hour.","post_message":"An economist explains why Clinton’s plan to raise the minimum wage to $15 might be 'too much, too quickly.'"},{"comment_id":"10153354510959714","commenter_b":"He technically could put kids in danger. His fans tend to be a bit over the top. One of those fan girls could and would easily shove someone out of their way to get near him without any thought given to whether or not the person they just shoved is ok.","commenter_a":"OMG I'm not a fan of the guy but u all are over reacting...putting the kids i danger seriously...how...he is not a terrorist he a singer...u all need to get a life...","post_message":"Justin Bieber totally crashed a prom, you guys."},{"comment_id":"10158155475600615","commenter_b":"Man baby. Strong women make them crazy.","commenter_a":"No surprise! We might respect the office of the President, but that's not \"carte blanche\" for Trump to do whatever pleases his whim.","post_message":"Check out these images from Women's Marches around the world."},{"comment_id":"10153203949426782","commenter_b":"This is complete BS!!! They are illegals!! NOT undocumented.... In Oklahoma you have to prove you are here LEGALLY, not an illegal criminal to get an Oklahoma ID or DL. Sign up for a DL as an illegal and get deported.","commenter_a":"If Americans went to Mexico illegally, they would be thrown in jail, deported, if they're lucky, possibly shot and killed, but I can guarantee they wouldn't be given free medical, free schooling, welfare, jobs, driver's license, etc....all at the tax payer's expense.","post_message":"An Oklahoma City grassroots effort to get undocumented immigrants drivers licenses is gaining momentum."},{"comment_id":"1325783830806579","commenter_b":"Yeah, you're a whore","commenter_a":"Look at all of the money hungry gold digging hussies in the comment section. ☝️️ @username","post_message":"If you've got some extra money to burn..."}]
