[{"comment_id":"10155272434600652","commenter_b":"Testing. Testing. Forgive the interruption, but -- big surprise! -- something is all screwed up with my Facebook News Feed/Pages Feed and I read a suggestion that I should comment to get things to show up again.","commenter_a":"I can sum up the cause of China's rise in four words: \"American wants cheap crap.\"","post_message":"How to think about China's phenomenal rise:"},{"comment_id":"10153935705086756","commenter_b":"@username And millions of flys eat shit daily.","commenter_a":"I agree with Paul Ryan. I didn't want him to have the job either. Or any other job. Anywhere.","post_message":"Ryan has said at least three times in the past year that he did not want the job. Now it's his."},{"comment_id":"581181075381182","commenter_b":"@username Many are 'insured' but access to care is more expensive than ever when you add copay, deductible, out of pocket, and actual cost of premium. These \"facts\" are manipulated to make the ACA look \"good\". In reality it is a tax, as defined by our own government.","commenter_a":"\"We’re forcing the president to confront the failures of this law once and for all\" - Speaker Paul Ryan","post_message":"Republicans in Congress used reconciliation to be able to get the Restoring Americans' Healthcare Freedom Reconciliation Act to the president."},{"comment_id":"10154361772367061","commenter_b":"As someone who lives in Lumberton I think we need to thank a lot of people for all they did. People came from other towns and cities with food and other things that were badly needed during this time. I understand these ladies went above and beyond and for that I applaud them. But we should not forget all the other people that helped and are still here helping. While the kids are a very important part of our community there are still people working to rebuild what has taken them a lifetime to obtain. I just want to thank all the people who were here when we were at our worst.","commenter_a":"Very cool","post_message":"WATCH: Educators in Lumberton, NC, hit hard by Hurricane Matthew, get $50,000, a brand new playground and funds to rebuild 16 parks! @webpagelink"},{"comment_id":"10153738741461491","commenter_b":"women, so weak they shouldn't even be acknowledged in movies as worthy of a fight...","commenter_a":"I don't see it as offensive. It depicts two super heros fighting. Although everyone has a right to voice their own opinions.","post_message":"\"The fact that no one flagged this is offensive and frankly, stupid.\""},{"comment_id":"10152887362811770","commenter_b":"Liar....","commenter_a":"gormless!!","post_message":"Pantsuit on fire!"},{"comment_id":"10153126028062235","commenter_b":"Shame on her !!!","commenter_a":"Oh please! Hahahahahah!","post_message":""}]
