[{"comment_id":"10156459147080354","commenter_b":"if you went to stop all this killing then we have to get all the dam muslims out of America they don't care about living they been killing each other for years and now they are doing it here I hope America will open there eyes and make this move","commenter_a":"Don't worry everyone the government is screening all of these Syrian refugees.","post_message":"***BREAKING*** Muslim Killer Tashfeen Malik was in America on a K-1 (fiancée) visa and held a Pakistani passport. DEVELOPING..."},{"comment_id":"10153182751728145","commenter_b":"Can the a/c compressor fit in my car? My A/C isn't working, I'll take the air over a flag! lol lol","commenter_a":"Give it a rest already","post_message":"Say goodbye to General Lee. Now toy versions of the iconic orange Dodge Charger will end production. Here's why: @webpagelink What do you think about this move? #WFTV"},{"comment_id":"10156247602125354","commenter_b":"Waaah, send them home","commenter_a":"Ha ha ha ha ha","post_message":"Newsflash: you wouldn't BE in jail had you not illegally entered the country."},{"comment_id":"1499858063367275","commenter_b":"Fleas carry disease such as plague. They're not safer than the flea meds!","commenter_a":"This is why I don't use any flea medication on my dogs, it's more dangerous for them than the fleas and my dogs have NEVER had fleas","post_message":"It's a dog chew so powerful that one dose can kill fleas and ticks for three months. Tonight on KIRO 7 News at 5 p.m., hear from people who say the flea medicine is responsible for the death or sickness of their dogs."},{"comment_id":"10152981955661336","commenter_b":"Obama the terrorist wants Islam to take over America!","commenter_a":"There's no sense in complaining!The people can get rid of obuma anyday they choose to!!","post_message":"\"[President Obama] clearly romanticizes Islam and treats it as though Islam is above all criticism… And until we hold Islam to the same standards as every other religion, ethically and behaviorally, terrorism wins.\" – Lt. Col. Ralph Peters"},{"comment_id":"10153229951151130","commenter_b":"Because women are catty.","commenter_a":"Someone needs to get their nails done.","post_message":"\"I never again want to get so caught up in this virtual reality that I forget the physical world right behind me.\""},{"comment_id":"1714915928784727","commenter_b":"Looks like she fought with a lawnmower and lost! Seriously, she wants to look like that..... It looks horrendous","commenter_a":"UGH!","post_message":"What do you think of this extreme cut? Marketers are branding it “quirky, stylish and smooth.”"}]
