[{"comment_id":"10153213545451336","commenter_b":"Lady , you've lost all credibility.","commenter_a":"You can't Change what has already happened or bring back the dead .","post_message":"Moments ago, Baltimore Mayor Stephanie Rawlings-Blake defended her decision-making to critics and vowed there will be justice for Freddie Gray."},{"comment_id":"750259701739305","commenter_b":"Until the GOOD cops police OUT theBAD COPS, these arrogant ignorant asshats will continue to terrorize our citizens. NO EXCUSE!!","commenter_a":"I wish he'd get fired!!!!!","post_message":"His tirade was caught on tape."},{"comment_id":"10153733130168855","commenter_b":"What an ugly hag.","commenter_a":"Its going to take gallons and gallons of makeup to hide her superficiality...","post_message":"\"Caitlyn Jenner wants attention, and she doesn’t especially care who’s harmed as a result.\""},{"comment_id":"1273163526055538","commenter_b":"Amen we owe them big time, send illegals back to their oun country , start shooting at the border that will stop them lol","commenter_a":"I have been given the option to use an outside provider when they weren't able to get me in within 30 days.","post_message":""},{"comment_id":"10154151078661002","commenter_b":"Oh please just remember who killed the most Americans on American soil they were not Black or White that's what's wrong with this country if we banned together we would never worry about muslim terrorist! They wouldn't stand a chance against the blacks and whites of America","commenter_a":"Because he's a pale person his information is not even released yet","post_message":"3 dead in Lafayette theater shooting WATCH: @webpagelink #Local4Today"},{"comment_id":"10154249719951615","commenter_b":"Oh for real? That's good to hear bro.","commenter_a":"Poor kid. If Mt Oliver Cops are the lead investigators she may never be found. 😢😢😢😢😢😢😢","post_message":"PLEASE SHARE: Brandi Kolas was last seen Feb. 2 in Mount Oliver. She has blond hair and blue eyes, is 5 feet, 7 inches tall and weighs 110 pounds. Anyone with information about her whereabouts is asked to call 911, the National Center for Missing & Exploited Children or the Mount Oliver Police Department."},{"comment_id":"1296652160354811","commenter_b":"Your wrong again people ! stop with the Race card ! Wanting our borders closed and secure to stop illegal aliens and drugs from getting in our country is Not Raciest ! and we are at War with Rdical islam so yes all immigration should be Haulted Untill ISIS is Destroyed ! it's about protecting AMERICA and AMERICANS ! The Democrates do not care about securing AMERICA and protecting AMERICANS","commenter_a":"As a German living in Ireland I have to say that the choice can only be Clinton or Sanders! Trump and the likes are disqualified for being racists, bigots, etc.!","post_message":"'It's like a comedy.'"}]
