[{"comment_id":"10154689577603812","commenter_b":"He also has many lawsuits in the 80's and 90's for discrimination against blacks and people of color.","commenter_a":"TRUMP STOOD UP FOR BLACKS AND JEWS: About 20 years ago the rich elites ran Palm Beach and wouldn allow Jews and blacks to use the golf and country club facilities. When he bought Mar-a-lago, MR. TRUMP WENT TO COURT TO END THAT DISCRIMINATION, won in court and forever changed how minorities are treated in Palm Beach. That THE REAL Donald Trump. What has Hillary or ANY politician done? @webpagelink","post_message":"A potentially record-breaking gap between two groups marks one of the most striking elements of preferences in the 2016 presidential race: college-educated white women for Hillary Clinton vs. non-college white men for Donald J. Trump."},{"comment_id":"10153176368084614","commenter_b":"Thug is synonymous with what these lil twits were singing in the video. What a bunch of racist filth!","commenter_a":"Lol funny.. Being all hard in their mini bus but when they meet one of us they be scared as hell","post_message":"A fraternity has shut down its University of Oklahoma chapter after a disturbing video showed members singing a racist chant that used the n-word. Sigma Alpha Epsilon suspended all of the Oklahoma chapter's members and threatened to ban those responsible for life. In the video, the students are heard chanting, will never be a n----- in SAE. You can hang him from a tree, but he'll never sign with me.\" the video is indeed of OU students, this behavior will not be tolerated and is contrary to all of our values. We are investigating,\" the university's president said in a statement. Read KTLA's story here: @webpagelink"},{"comment_id":"10153380669974135","commenter_b":"you again? really , go away you angry negative bitter woman!","commenter_a":"Why don't you open you wallet and pay NJ back for the money you stole from them for your bridegate \"investigation\" and your campaign expenses. Oh, don't forget $82,000 for hot dogs and beer at the ball games.","post_message":"I opened my heart to you"},{"comment_id":"1835427256744336","commenter_b":"Lock her up already!","commenter_a":"It's not important how many people are there what's important is how many VOTE BLUE!!!!!!!!!!! These two ladies have have more integrity in one finger than all of you HATERS.","post_message":"WATCH LIVE: FLOTUS Michelle Obama and Hillary Clinton campaign side-by-side in NC."},{"comment_id":"10154185145943132","commenter_b":"Sue happy! These ladies are cracking me up. They have no clue.","commenter_a":"OH so this is how they make a living. Hard work paying off there. Unbelievable.","post_message":"It's always polite to ask permissionjust ask Kendall Jenner."},{"comment_id":"1002365369819992","commenter_b":"Then why did she have a professional IT tech wipe it?","commenter_a":"The cat is out of the bag. Now they can give up the untrustworthy propaganda about Hillary.. We all know who America can't trust- Republicans","post_message":"Tomorrow, Hillary will testify in front of the House Select Committee on Benghazi. She’ll answer their questions, remember the brave Americans lost in the attack, and outline the need for our country's continued leadership abroad. Let her know you’re with her by sharing this. hrc.io/WithHer"},{"comment_id":"10156388159930294","commenter_b":"Racist white trash!!!","commenter_a":"Negro......you was a bad hood rat","post_message":"An Akron man learned his punishment for kidnapping and beating his ex-girlfriend. When the victim tried to escape, she broke her leg. More on the story here: @webpagelink"}]
