[{"comment_id":"10154219660042908","commenter_b":"Yet they try to call themselves the prolife party.The warmongers that they are proves that they aren't.They aren't prolife they are pro birth.The GOP will get us into war with iran and the way donald trump is talking we'll have a border conflict with mexico.","commenter_a":"Still waiting for Bernie to say something about the 700 million dollars congress. spent on defense last year","post_message":"Sadly, people like former vice president Dick Cheney and many of the other neo-cons who pushed us to war in Iraq were not only tragically wrong then, they are wrong now. Unfortunately, these individuals have learned nothing from the results of that disastrous policy and how it destabilized the entire region."},{"comment_id":"10152729868175667","commenter_b":"Oh calm yer tits..it's just fun","commenter_a":"I may stop following USA Today because of this specific post. The guy isn't even old enough to run and you're reporting it like its important, which just means you made a joke out of yourself.","post_message":"President Flame would be a pretty epic name. Just saying."},{"comment_id":"1256330341086427","commenter_b":"I recently read an article where he said he doesn't change diapers and taking care of the kids was his wives' responsibility, so I think it's fair to say he probably has zero understanding of fetal development and pregnancy. This is a man, after all, who called a breastfeeding woman disgusting for needing to pump breast milk. Fun fact-Donald Trump is not the only man who has no idea what he's talking about in this arena. I had a friend who had to explain to a coworker, who was a father of THREE children, that breastfeeding women need to pump at work because they cannot start and stop lactation at will. Guy thought a breastfeeding coworker could just wait until her 8 hour shift was done to start lactating, and was disgusted that she stored her breast milk in the fridge.","commenter_a":"As a C-Section baby myself, I was scratching my head for a good long while after he said that. I don't understand how a seventy-year-old man with five children (and a few grandkids!) could be *that* ignorant of childbirth!","post_message":"“It is, of course, such an absurd thing to say,” one doctor said. “I’m unaware of anyone that’s terminating a pregnancy a few days prior to delivery of a normal pregnancy.”"},{"comment_id":"929207217205367","commenter_b":"It's up to the voters! United we will not let her get away with this! she's another OJ Simpson in my book....","commenter_a":"I sure hope so. This makes me sick. She is above the law. This is so shameful and just so wrong. Unbelievable.","post_message":"Today, the FBI admitted that Hillary Clinton endangered the American people—and confirmed that the worst things any of us imagined about Hillary’s email server were true. FBI Director James Comey concluded that Clinton was “extremely careless” in handling our nation’s secrets. He admitted that no reasonable person could have believed putting these emails on a private server was at all appropriate or acceptable. He admitted that 110 emails on the server were classified at the time they were sent—showing that Hillary not only lied, but knowingly endangered national security as Secretary of State. He admitted that Hillary deleted work-related emails before turning them over to the State Department, despite her claims otherwise. And most shocking, Mr. Comey even admitted that it’s likely foreign governments hacked her emails--and that our adversaries could know critical secrets about the U.S. government because of Hillary’s actions. But when you’re a Clinton, none of this ..."},{"comment_id":"902249986464524","commenter_b":"ridiculous..she was good enough to lay down and have a child with but now she's a hoe?","commenter_a":"SMDH now that an action right there to piss her off more. No woman wants the father of her child disrespecting her on media outlets. Let's see how long she gonna ban him from seeing his son now. Some guys never learn. No matter how much he hate her he need to handle their business in private. Who wants to grow up with the public and their father throwing shade at the person that gave birth them. U cant stop what the world thinks of Amber but Wiz should act more mature and handle it since he a Dad now. They need a mediator ASAP","post_message":"“Instagram Turnin’ These Wives Into Hos”: Wiz Khalifa Takes Cheap Shots At Amber Rose On New Song, “For Everybody” :("},{"comment_id":"10152523937956135","commenter_b":"Only issue is the sand doesn't wash down the drain as easily as salt when winter is over","commenter_a":"Sand is better. We use a salt and sand combo (more sand than salt) in the UP.","post_message":"Ever slide through a cold Interstate at night and wonder how exactly is salt supposed to melt ice?"},{"comment_id":"1469983173042150","commenter_b":"#Youcantdefendit #grabthembythepussy #anybodybutTrump","commenter_a":"Folks we should be talking about this Obama care collapse and how our premiums are going up in 2017 by 26% scary . My family can't afford this !!!","post_message":"The story just keeps getting worse, and worse."}]
