[{"comment_id":"10153842971535950","commenter_b":"Mary, please remove yourself from the gene pool. Don't reproduce.","commenter_a":"Many western people feel targeted and afraid of muslims. You never know what they have underneath all that crap they have on. Why don't they go back to Muslims countries?! If they can't adapt them should not migrate.","post_message":"In Nice, a city with the ban, police can fine any woman wearing a burkini -- or force her to disrobe."},{"comment_id":"1400391526679146","commenter_b":"I was at fort Wainwright... Fucking miserable place no doubt (it was -37 when that pic was taken)","commenter_a":"Thank you for all you do!!","post_message":"I remember hoping I'd get frostbite so my chain of command would get an ass chewing. This is about as miserable as it gets. ~Will"},{"comment_id":"922010884502919","commenter_b":"If the perpetrator uses a handgun we get ban handguns, if he uses a magazine fed we get ban those, shotgun we get ban those, folding stalk we get ban those, black finish looks scary and military looking, we got to ban those! Where does it stop? We have millions of knives (problem in Japan) baseball bats, and cars in the U.S.! All can be used to do mass killing! Let us all be honest and cut the BS out of this subject! Gun free zones=shooting fish in a barrel! When POTUS and celebrities give up armed protection then they can give their opinion!","commenter_a":"As soon as all the criminals and government in the us get rid of all their weapons then we can talk about law abiding people curbing their guns. Until then you have completely missed the point of owning a gun for self defense. And BTW Roof got the gun illegally!!!!!! Writer doesn't understand what the word criminal means.","post_message":"COMMENTARY: Why you need to rethink some of your gun arguments. Agree?"},{"comment_id":"10154316928129740","commenter_b":"Haha I look for radar too","commenter_a":"Driving in the personal car you see a vehicle in oncoming lanes that is definitely speeding.. You check the dash mounted radar that isnt there... Also constantly go to adjust the ghost ear piece off duty.","post_message":"These funny habits that follow you home — even after retirement — prove that officers are never truly off-duty."},{"comment_id":"628365077296674","commenter_b":"\"Woman\"","commenter_a":"woman?","post_message":"I want her sick face everywhere......people need to know how twisted this woman is!"},{"comment_id":"10153856032800329","commenter_b":"Yea I agree. They should of had variety of women. Not all overweight women have round faces. Chubby face yes. They are all pretty but some of those cuts I wouldn't do on most women, regardless of their size.","commenter_a":"A round face shape doesn't mean you are over weight. And these cuts were not exactly flattering to these women. Ijs.","post_message":"Warning: this post will make you want to get your hair did asap."},{"comment_id":"1106845012659268","commenter_b":"But are they Immigrants???","commenter_a":"Stop the hate!!!","post_message":"Mass shootings are becoming an almost-everyday occurrence in this country. This sickening and senseless gun violence must stop."}]
