[{"comment_id":"10153575842934087","commenter_b":"If she withdraws we can toss her and Bernie a Peanut.","commenter_a":"Of course, who wants to be a target for Hillary shaming?","post_message":"Pressure is building on Democrats to rally behind front-runner Hillary Clinton after her strong Super Tuesday showing, but 22 House members and five senators are holding back."},{"comment_id":"10153519405836680","commenter_b":"You are exactly right @username. It's so sad how ignorant and blind people have become. Saying we need illegal immigrants. Wow. Have you people not seen what's going on in Europe. No they need to come to this country legally people... Thank God we are gonna get it fixed this November. And that's how it will be. We will have a safer country. Trump2016!!!!!!!!!!!!","commenter_a":"Let us call it what it really is \"Bernie Sanders hugs illegal aliens at campaign rally.\". They are not undocumented immigrants because they have not followed the immigration process to get here. They are criminals. Justice needs to be dealt out to them.","post_message":"Bernie Sanders hugs undocumented immigrants at campaign rally."},{"comment_id":"879093232228004","commenter_b":"She is an ugly person!","commenter_a":"Maybe she can hire a personal assistant to help her with clothes and makeup...","post_message":"$20,000,000.00 a year?! Shoot, I wouldn't pay her $20 a year."},{"comment_id":"699812546852263","commenter_b":"Perhaps she's had enough of grabbing pussy","commenter_a":"As far as I'm concerned the whole family can go straight to hell.","post_message":"Donald Trump said his wife and youngest son would move \"very soon. After he’s finished with school.\""},{"comment_id":"1174271395944428","commenter_b":"The real Hillary afraid that the porn industry wont donate money to her or maybe they have some film!","commenter_a":"Perhaps under the advice from Bubba, he's planning ahead! Lol","post_message":"Hillary Clinton refused to sign a pledge Monday that would protect children from exploitation by the porn industry."},{"comment_id":"10153615881104199","commenter_b":"Crazy lady!","commenter_a":"White trash at its finest","post_message":" knew what was going to happen. I wanted it on tape. Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off road first time. She got behind me a second time and then went to go around again. I let her have the road, called 911, reported her and her plate number I started phone video which was in a holder on dashboard hands free"},{"comment_id":"1848439335433149","commenter_b":"Keen 😜","commenter_a":"@username @username Mari Funfax","post_message":"Put us on the next plane to Dubai."}]
