[{"comment_id":"771105652991563","commenter_b":"It would be a GREAT PLACE TO START.","commenter_a":"Yes","post_message":"It is widely known that George Soros was affiliated with the Nazi Party, and he's also a major financier of a number of democrat programs."},{"comment_id":"699619480228630","commenter_b":"@username RE-MOVE HEAD FROM ASS","commenter_a":"....and, Obama let Putin become the Hero of this War on ISIS!","post_message":"Russia is relentless bombing ISIS until they are completely destroyed. We are fully behind them. This is what needs to happen. Can we get 75,000 'LIKES' for Russia?"},{"comment_id":"1048920205189554","commenter_b":"@username idiot!!!!","commenter_a":"It's not necessary to test on animals. Their bodies are not like ours.... it means nothing. Do the back study of how useless animal testing is, folks.","post_message":"This is the heart-touching moment 156 beagles are set free from an animal testing facility in India. Credit: Caters TV"},{"comment_id":"10153141451562894","commenter_b":"She a dub","commenter_a":"@username 😕","post_message":"Kylie Jenner literally just went from 100 to 0"},{"comment_id":"1982433335149738","commenter_b":"Beyonce is good in showing off her booty and that's about it .","commenter_a":"Agreed with Santana. Her performance was too visual artistic and address to a very narrow audience....it was not too much a vocal challenge or a singing performance in the true sense. This characterize her style over all.","post_message":"Carlos Santana: Beyoncé is not a singer, with all respect to her"},{"comment_id":"10153102217682994","commenter_b":"Thugs","commenter_a":"Thugs","post_message":"Authorities say a modern-day 'Bonnie and Clyde' situation is unfolding in the Southeast right now."},{"comment_id":"10154400168208525","commenter_b":"Good grief, you ladies are in a panic. There is the morning-after pill for that kind of thing.","commenter_a":"Believe it or not, you don't have to get pregnant. It's a personal choice","post_message":"#BREAKING: President Donald Trump has signed an executive order withdrawing the U.S. from the Trans-Pacific Partnership deal, and has also placed a hiring freeze on some federal workers and cut off funding for international groups that perform abortions. MORE: @webpagelink"}]
