[{"comment_id":"10153742878600575","commenter_b":"Deport them","commenter_a":"Aren't we all supposed to be brainwashed by the communist media maggots that this is the \"peaceful religion\" ?","post_message":"Muslims blew up city Christmas tree."},{"comment_id":"1923069711254227","commenter_b":"so far 1.5 million people have liked my last comment PERIOD!!!","commenter_a":"My gawd it's an immigrant disrespecting the flag! Shouldn't O'Reilly and Hannity be all over this? Lqtm","post_message":"Oh, how they would SCREAM! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1628197660735785","commenter_b":"Typical woman. Always find something to complain about.","commenter_a":"I see no bacon...this game sux","post_message":""},{"comment_id":"10154985893890629","commenter_b":"@username Now he blamed \"fake news\" again. Only this time it was real \"fake news\".","commenter_a":"Our president is making speeches based on something he says he heard on Fox News? OMG, he has access to 1st hand intelligent briefings and he's getting his information from the news? What in the world is even happening?","post_message":"President Trump said he cited a nonexistent terrorism incident in Sweden as a reason for his travel ban after he saw a segment about immigration in the country on Fox News."},{"comment_id":"10154858559120259","commenter_b":"Good! I hope they lock that bitch up for as long as they can!","commenter_a":"Time for prison.","post_message":"Student Nikki Yovino claimed she was raped by two football players, both of whom lost their scholarships and maintained the sex was consensual. Now, Yovino admits it was a lie designed to gain sympathy from another man she liked. She now faces charges that could bring 5 years in prison if convicted."},{"comment_id":"10154153426863812","commenter_b":"I'm praying!!","commenter_a":"Pray for a safe return","post_message":"Amber alert issued for 2-month-old girl who was abducted from her home by armed kidnappers: @webpagelink"},{"comment_id":"10153400314832183","commenter_b":"...and he thinks that threat is going to deter anyone from voting for Bernie. It makes me MORE determined to vote for Bernie. Don't let the door hit you in the ass Bill.","commenter_a":"PLEASE, vote for U.S. Senator Bernie Sanders for president so O'Reilly will go!!","post_message":""}]
