[{"comment_id":"10152965357956336","commenter_b":"Lets face it, the ppl this upsets the most are the females that could never pull it off.","commenter_a":"I think all you who say it's too far are the same ones waiting for fifty shades of grey.","post_message":"Did Sports Illustrated Swimsuit go too far this year?"},{"comment_id":"10154574159493445","commenter_b":"The only wall is much needed to keep illegals out that are a drain on society. Mexico doesn't want them back and they send millions if not billions to pump up Mexico's economy and drain our economy. Many of these immigrants are from further south than Mexico. Mexico wants to keep them out of their country as well that's why they put a large wall on their southern border. Why are they allowed to do that yet we are not??? I've had several friends killed my illegals because they can't drive. I also have a very good friend that can't walk, can hardly talk and will never work again all because a car load of illegals didn't know what double yellow lines on the highway stood for. They passed around car load of illegals at the top of the hill and hit him head on at 60 mph. 3 of ...","commenter_a":"Texas.","post_message":"Creative smugglers will always come up with ways to get drugs over the border - and many doubt the effectiveness of a wall to curb the flow."},{"comment_id":"10153217617761460","commenter_b":"Gays have no right to call it Marriage .","commenter_a":"I dont like, or approve of same sex marriage, however we all have a DIVINE right to choose how to live our lives. What that means is, if one chooses to go against the 'rules' then that is on them. Its called \"free will\". I would advise against it according to my own spiritual belief's...but I have no right to take it any further than that with a non-believer. Its a touchy subject! We all have a gay person in our lives somewhere that we love, we may not like or agree with this life-style, and we do have a right to \"voice\" that, but that is where the right ends, and the rights of the gay person start...I only wish now the gays would see where THEIR rights end when dealing with those of us that are Not gay, and we do have Divine & Constitutional to disagree, but ...","post_message":"Marriage should be defined as it has always been. This is the ideal for raising children and is good for society. But while Americans are deeply divided on this issue, we should be able to agree that a Supreme Court decision would only exacerbate that division. Like the Roe v. Wade decision in 1973, a Supreme Court ruling that overturns state laws on marriage would do nothing to end the debate about marriage, but would instead prolong it. Full statement here: @webpagelink"},{"comment_id":"756693807767590","commenter_b":"Ian","commenter_a":"Joshua","post_message":"...bruh"},{"comment_id":"1214784961920643","commenter_b":"all these woman marching i wish they would say samething about us senior that can not get out of the house to help fight for our medicare and social security","commenter_a":"Marching in Tucson, AZ!! Yea! Ladies!","post_message":"LIVE NOW: Women's March in D.C., just one day after Trump's inauguration. MORE MARCH INFO: @webpagelink"},{"comment_id":"10153931139325695","commenter_b":"Omg poor @username lmao. What a nut job . So should we deport whites for crimes? Since this wasn't really our land to begin with?","commenter_a":"Really disappointed with you, WSB.","post_message":"Our investigation found the number of refugees deported for violent crimes is skyrocketing, and it includes numerous refugees here in Georgia. Today at 5, the numbers that leaders call a \"game changer\" in the Syrian refugee debate."},{"comment_id":"481193578737889","commenter_b":"After the shit she did she should be quiet people that live in glass houses should not through stones!!!!!","commenter_a":"A great concept and certainly worth attempting. We pray for success and abolishing obamas illegal actions.","post_message":"Sarah Palin is starting a revolution... and Obama's first to go. She's leading the 50 states and we’re right behind her. Do you support Sarah Palin?"}]
