[{"comment_id":"1021715281216809","commenter_b":"Definitely Dan!","commenter_a":"We are witnessing the greatest attack on our American Democracy since Citizens United! The DNC has chosen Hillary Clinton to be their next presidential nominee, and is doing whatever it takes to silence the voice of the people. We cease to be a Democracy when the Party receives millions in funding from the same media corporations that report biased coverage in an attempt to deceive voters. We cease to be a Democracy when the Party takes deliberate actions to suppress voter turnout, turns away registered voters, and commits election fraud in Arizona and across the country. We cease to be a Democracy when the Party selects super delegates (many of which are Lobbyists) who refuse to the listen to voice of the people the are intended to represent. We cease to be a Democracy when the Party simply removes a candidate from the ballot in Washington DC! A vote for ...","post_message":"Every success by Bernie is met with a story or column or talking head whose message is “but he can’t possibly win.” That's the media refrain because the Democratic establishment can't conceive of the possibility Bernie will win. That's because they aren't listening to Bernie's message and its resonance among Democratic and independent voters (as well as many Republicans). They don't know how determined Americans are to reverse the increasing concentration of wealth and political power that are eroding our economy and democracy. - Robert Reich"},{"comment_id":"10157170758630354","commenter_b":"This woman is psychotic.","commenter_a":"She's fucking disgusting to look at! A professional con artist like the Obama's and the privilege Clinton's they all should get tarred and featured in public !","post_message":"Want nightmares? WATCH:"},{"comment_id":"10153796772929411","commenter_b":"They kill civilians anywhere they go. Worse butchers then IS nearly..","commenter_a":"Terrible.","post_message":"US special operations analysts investigated #Kunduz hospital for days prior to the deadly October 3 attack, describing it as a base of operations for a Pakistani agent coordinating Taliban activities, despite despite repeated pleas by the MSF."},{"comment_id":"1096146180493131","commenter_b":"Mexicans showing their little dicks. Their penis's are as big as a Mexican pepper. Will see who kisses of illegals your asses are grass.","commenter_a":"Trump","post_message":"CITIES TELL TRUMP to KISS OFF @webpagelink"},{"comment_id":"554182668075021","commenter_b":"What lower wages, you mean lower taxes. If you don't want to birth a child, just keep those nasty little knees together","commenter_a":"They are poor, jobless and believe the American dream is dead because they are stupid enough to keep being tricked into voting democrat.","post_message":"Last year was the first time that millennials surpassed baby boomers and Gen-Xers to become the largest voting demographic in the US."},{"comment_id":"10153517844123984","commenter_b":"They needed to know.","commenter_a":"This is the most retarded thing anyone has ever posted on faceboook.","post_message":"Mega-church TV pastor Joel Osteen just made a sickening announcement about Muslims... Spread this absolutely everywhere... the REAL Joel Osteen needs to be exposed. Do you agree that Osteen is a fraud?"},{"comment_id":"10154624761426336","commenter_b":"What a dumb woman...","commenter_a":"Its her policy that allows these people in our country to kill us.","post_message":"Hillary Clinton addressed the latest bombings in New York City and New Jersey and emphasized that Donald J. Trump's comments are being used to recruit terrorists. @webpagelink"}]
