[{"comment_id":"10155894213345354","commenter_b":"Hillary is a cunt!","commenter_a":"Killary is the epitome of all the ills of this world rolled into 1 savage stinking carcass.","post_message":"Short memory!"},{"comment_id":"793702420758020","commenter_b":"Safer boarders and no more refugees!!!!!!!!!!! WAKE UP AMERICA!!!","commenter_a":"Fox news! Enough said!","post_message":"Two Middle East refugees have been arrested on terror charges in California and Texas. fxn.ws/1Rnioji"},{"comment_id":"704402909750287","commenter_b":"1st lady my ass","commenter_a":"She destroyed the school lunch program. Absolutely destroyed it...","post_message":"Michelle Obama gets blind sided with this devastating blow, it's over. No one cares about her. She is a disgrace. Are you tired of hearing about Michelle Obama?"},{"comment_id":"10153168410293690","commenter_b":"In ind had been an individual liber,on account of each mob should be admit each religion.its actual substance,besides already has recognized via Basic R8s","commenter_a":"Its expected from modi sarkar, as he has the record of massacaring muslims in Gujrat..","post_message":"Are India minorities under attack? Christians and Muslims say the government is not doing enough to protect them from hardline Hindus. But is prime minister Narendra Modi being compromised by his nationalist roots? @webpagelink"},{"comment_id":"10154156633758822","commenter_b":"Ship all libs and Democrats there now!!!!","commenter_a":"Can we send the Obamas and Clintons as test citizens? Perhaps their buddies in Isis?","post_message":"Humans on Mars by the 2030s! That's what President Obama's plan calls to do."},{"comment_id":"10155056211255329","commenter_b":"Shut up, bitch","commenter_a":"Laura :p","post_message":"You know they're a real friend when you can be a dick to them."},{"comment_id":"962481017216016","commenter_b":"@username I do not believe God condoned offering children to the fire as is abortion. the dogs ate jezebel. hillery was lucky, so far.","commenter_a":"YOU can't be a christian and vote for Hillary but it is all over, Hillary lost.","post_message":"Apostate “Pastor” Tony Campolo says Christians Should Vote for Hillary @webpagelink"}]
