[{"comment_id":"812987998844624","commenter_b":"Bra,panty,stockings,make up are part of a woman's world We want to look presentable when we go out ....not look like a beat up gf or wife","commenter_a":"The husband is so sweet ,im sure he bought perfume and other toiletries for her","post_message":"The husband was helping his wife choose a makeup color that matched her skin tone. He helped her find the color and kissed her on the forehead, according to Love What Matters."},{"comment_id":"1537745819864402","commenter_b":"and that still doesnt make him legitimate to run. Even down here in Australia we know he doesnt qualify... Surely they havnt dumbed billy yankee down that much???????","commenter_a":"Boehner and Trump, best of buds...who would have thought?","post_message":"Ted Cruz just got the best endorsement he could ever get. He could not have gotten a better endorsement than he got out of John Boehner."},{"comment_id":"1091470624223610","commenter_b":"I beg the differ sir! Here's one for Trump!! I want at first, but as this plays out, he is the only out sider I trust!!","commenter_a":"You are so wrong again. Stop you are losing all credibility. Your own hate for Trump, is going to be the end for you.","post_message":"\"You're damn right.\""},{"comment_id":"784349154999752","commenter_b":"Bitch","commenter_a":"Another racist liberal what does she have against Orange people. Ray","post_message":"Oh, Meryl...."},{"comment_id":"1086019278181113","commenter_b":"She's going to crush her opponent into Cheeto Dust. BYE ORANGE FELICIA","commenter_a":"BS","post_message":"Democratic presidential candidate Hillary Clinton will be speaking at an early voting rally in Cincinnati, Ohio."},{"comment_id":"10153492061886337","commenter_b":"Probation and a fine is all she may get. Prison you can't be that ignorant!","commenter_a":"This lady is an idiot, commited at least 3 different Federal Felonies... lol dumb broad. Well there's no Rebel flag in prison so she will be happy.","post_message":"GET TO KNOW Bree Newsome, the woman who climbed the flagpole at South Carolina's capitol building and took down the confederate flag..."},{"comment_id":"394396457415315","commenter_b":"Muslim women why do you want to stay somewhere your notttttttt wantedddddddd !!!!!!!!!!!","commenter_a":"There was nothing wrong with America until THEY came here to destroy everything we have worked so hard for!!! She and eveyone like her needs to go back where they came from!!","post_message":"“You Are Everything That is Wrong in America”"}]
