[{"comment_id":"929829353743480","commenter_b":"Gee, you'd think women would be smart enough to either (a) buy better shoes or (b) switch them out when they start to hurt. I guess not.","commenter_a":"I don't know why people wear them tbf,not if they're uncomfortable","post_message":"Time to switch to flats, ladies!"},{"comment_id":"598083523681641","commenter_b":"She really shouldn't enter into a battle of wits unarmed!!","commenter_a":"Right... because Mechanical Engineering has nothing to do with science..... *rolls eyes*","post_message":"-_-"},{"comment_id":"10153674136304641","commenter_b":"true... we just cant equate these refugees with terrorists.","commenter_a":"Its not about religion you fool! It's about your country's safety! Get that through your head!","post_message":"U.S. President Barack Obama's harshest remarks were for Texas Sen. Ted Cruz."},{"comment_id":"10152850999936813","commenter_b":"One thing that strikes me is how people obsess with the LGBT. For some reason it's \"all the Gay's fault\". If only we could get rid of them, all our world's social problems will be solved. NOTICE: YOU DO NOT SEE SIGNS SAYING: \"ADULTERERS/CHEATERS, WIFE BEATERS, ADDICTS, RAPISTS, CHILD MOLESTERS, LIARS, THIEVES, TERRORISTS, CORRUPT POLITICIANS & PASTORS WILL NOT BE SERVED OR ARE NOT WELCOME IN THIS STORE\". NONE! It's always the Gays....","commenter_a":"Actually let small businesses post these types of signs. This tells me to take my dollars elsewhere!","post_message":"Tennessee hardware store owner hangs a “no gays” sign in the front window. It's 2015, not the 1950's. @webpagelink"},{"comment_id":"10153500393969087","commenter_b":"Lmao!! Yes that woman really said that. She's a looney bin","commenter_a":"@username did you really just say \"Kid Rock is a patriot and has billions of fans that respect him?\" You really just summed up the average Trump supporter quite perfectly: someone who doesn't quite know the difference between an extra 0...","post_message":"\"I'm digging [Donald J. Trump],\" Kid Rock told Rolling Stone magazine. \"I think he will [win]. To me, I'm just like, 'We gotta try something else.'\""},{"comment_id":"10153253318118188","commenter_b":"I don't see women chomping at the bit to be garbage men, roughnecks, boilermakers, crab fishers, or construction workers.","commenter_a":"She's a joke!","post_message":"ICYMI:"},{"comment_id":"10154727217281037","commenter_b":"When your cat was grabbed, am sure you did not mind. Trump is an insult to humanity.","commenter_a":"He is a low class guy with money.","post_message":"Melania Trump defended her husband, saying the vulgar remarks were not reflective of him and that she had accepted his apology and hoped others would, too."}]
