[{"comment_id":"989405267747483","commenter_b":"Wrong woman for Obama.....","commenter_a":"What's wrong with Hamilton??","post_message":"Can you imagine? Heads would explode! I am no Randian but she IS the most important female thinker of the 20th Century not to mention the most influential."},{"comment_id":"10153771279973908","commenter_b":"Gotta be relaxed, to perform","commenter_a":"Another reason why Trump is not Presidential material. (LOL)","post_message":"Collective Evolution"},{"comment_id":"10155496447630603","commenter_b":"What's it going to be? Pick your switch? The belt?","commenter_a":"Did someone call scan","post_message":"This mother saw her son on TV throwing rocks at police, so she went to the rioting scene, found him and let him have it for taking part in the violence, according to local reports. @webpagelink"},{"comment_id":"10152967857461519","commenter_b":"Yeah, I am sure all the female open carriers/ gun owners are using firearms to compensate for their small penis'","commenter_a":"Tari, have you ever actually read the second amendment? It calls for a WELL-REGULATED militia. Not just any white supremecist or Al Qaida operative who goes to a gun show. In Vermont you have fewer urban areas. It is like saying nobody gets mugged on a row boat. I am a gun owner and I really wish that buttholes like you and these NRA pimps with your illiterate interpretation of the second amendment would go help someone else. Ammosexuals are giving responsible gun owners a bad name.","post_message":"\"A law requiring people to apply for a permit before buying a handgun helped Connecticut quietly reduce its firearm-related homicide rate by 40 percent.\" Imagine how many lives could be saved if other states passed similar laws."},{"comment_id":"1556960097657348","commenter_b":"This is a state with Making a Murderer. I'd be wary.","commenter_a":"Eternal rest grant unto HUSSAIN, O Lord, and let perpetual light shine upon HIM. May the souls of the faithful departed, through the mercy of God, rest in peace. AMEN!!","post_message":"Police say it's likely several people saw Alnahdi being beaten, but only one has come forward."},{"comment_id":"10153482643681130","commenter_b":"its on your page Joseph Zawistan","commenter_a":"\"Recent graduate initiated hunger strike\"....Lol. Why don't you use your degree and go get a fuckin.job and concentrate on future like you're supposed to do when you graduate.","post_message":"There's been a call for three top Student Senate leaders to resign, and a recent graduate initiated a hunger strike."},{"comment_id":"587546098014187","commenter_b":"It's ok, SHE has 24/7 armed guards, surrounding her...we just need to suck it up","commenter_a":"diane can have my gun, I will put it right where her head is at :))","post_message":"Diane Feinstein admits their are probably sleeper cells in America. So why does she want to take away your guns?"}]
