[{"comment_id":"10155910391265725","commenter_b":"Take America back. STOP buying crap from other countries.","commenter_a":"DONALD TRUMP: Speaking what everyone is thinking. TAKE AMERICA BACK.","post_message":"Wow, some new and even greater polls-- thank you!"},{"comment_id":"10153186192812550","commenter_b":"Oh @username its so sad. First of a talking back is not a threat. Second if he wanted to arrest her , he did not need to throw her on the ground & pull her hair. Those kids were running up to save their friend & I would have done the same thing. Third she was all ready sitting down , it was no need to push her head down in the dirt & sit on her. Apparently the kids were invited by a guest. They didn't start the fight at the party some old ladies started it.","commenter_a":"Absolutely NOT! 1.The video is incomplete. 2. The cops appeared to be outnumbered at least 4:1 3. He did not use lethal force. He restrained an individual who was not obeying his directive. 4. When another individual came from behind him; he did as any police officer would and drew their weapon. He then quickly holstered it when the threat was lessened. 5. If these kids showed proper respect for law enforcement; this would have been a different story.","post_message":"Call for cop to be fired after pool party video @webpagelink"},{"comment_id":"1033927403316825","commenter_b":"Good! Hopefully this will deter those damn anti-vaxxers from using Facebook and spreading their total stupidity. One can dream.","commenter_a":"Hip hip hor ehhhh","post_message":"Three cheers for Mark."},{"comment_id":"10153179149615399","commenter_b":"Most Conservative Women act childish.","commenter_a":"Right wing conservative instigator botox bitch.","post_message":"Actually, it's really not."},{"comment_id":"10153952652862293","commenter_b":"I guess you are happy with the Clinton globalist international crime family in the White House (along with the money laundering Clinton Foundation). She will continue to ship your jobs overseas (she supports NAFTA and the TPP), promote open borders that bring in criminals and support unlimited immigration of Muslims bringing Sharia Law and terrorism. Maybe you could then move to a \"no go zone.\" Ask Europeans (and the people in Dearborn, Michigan) how that is working for them?","commenter_a":"How is it not completely obvious to anyone with two eyes that this family is a bunch of con artists? Literally nothing they say is true. And half the country wants to give the most important job on the planet to this guy? Amazing.","post_message":"Eric Trump said he could not name a single instance when his father had given such a gift."},{"comment_id":"950959664958199","commenter_b":"She's a skunk","commenter_a":"Jackie Kennedy is turning in her grave.","post_message":"Michelle Obama Makes Rap Video: YoYo! Only Way To Succeed Is To \"Go to college!\""},{"comment_id":"10153091462652507","commenter_b":"There she goes again, speaking truth to power. And for the poweless. You go, girl!","commenter_a":"Thank you Sen. Watrem","post_message":"Watch Senator Elizabeth Warren crush it on the Senate floor during the debate to defund Planned Parenthood: “Did you fall down, hit your head and think you woke up in the 1950s or the 1890s? Should we call for a doctor?”"}]
