[{"comment_id":"10152847768557690","commenter_b":"How do you steal that many cattle without being noticed? Surely someone saw something","commenter_a":"Who let the cows out?!","post_message":"Officials are investigating how 1,121 cattle vanished from a Texas dairy facility >> @webpagelink"},{"comment_id":"569782366553109","commenter_b":"Christ. Any more soft lobs? Take off the freakin kid gloves already","commenter_a":"falling asleep?","post_message":"Tom Price, Donald Trump's pick for secretary of Health and Human Services, is expected to face tough questions on Obamacare, his financial disclosures, drug prices and more in his appearance before the Senate Committee on Health, Education, Labor and Pensions."},{"comment_id":"10158855992795206","commenter_b":"Your taste is all in your mouth. This woman lies quicker than a spider can grab it's prey. Karma will be, her children practice her art, on her.","commenter_a":"Role model, amazing mother, classy and smart. Love her! #MAGA","post_message":"Today, Donald Trump named Kellyanne Conway as presidential counselor. Here are some interesting facts about her:"},{"comment_id":"557979804384534","commenter_b":"@username I totally agree, how can she not see that??","commenter_a":"If it makes you feel better, I'm ashamed of your actions too. Disgusting.","post_message":"Jaelyn Young broke down in heavy sobs at sentencing, saying she was ashamed of her actions."},{"comment_id":"10154312259097654","commenter_b":"yes yes","commenter_a":"absolutely!","post_message":"Kellyanne Conway says the media is flat-out refusing to cover the Trump administration fairly. Is she right?"},{"comment_id":"1354102041270105","commenter_b":"BUILD THAT WALL!!!!!!!","commenter_a":"The racist bigots Trump supporters would love as many Mexican families as possible to die. Pretty sad! That's why I'm with her!!","post_message":"A son migrated to the U.S. from Mexico, to help his parents survive by sending back money. But part of Donald J. Trump's immigration policy could threaten that support, and the lifeline of an entire town. (In a statement to CNN, the Trump campaign maintains building a wall is the right solution, but did not address money transfers directly.)"},{"comment_id":"874917705876659","commenter_b":"people need guns to protect them selves from this sort of scum. is this copper stil walking?","commenter_a":"I smell a wrongful death suit with a nice pay out cooking","post_message":"This is CRAZY! A unarmed boy's last moments were caught on bodycam, just before he was SHOT & KILLED by a TRIGGER HAPPY COP! Of course the cop will not be charged for any crimes. Blood boiling VIDEO: @webpagelink"}]
