[{"comment_id":"10153356571252093","commenter_b":"Pretty sure I could peel an orange by age 6. (Or if they just CAN'T, that's what mothers are for!","commenter_a":"That people are so lazy they'd pay for a peeled orange is discouraging.","post_message":"If only nature had a way to cover and protect these oranges.... @webpagelink"},{"comment_id":"1179417458812166","commenter_b":"The apple didn't fall far from the tree. She is just as dumb as her momma lol .","commenter_a":"They didn't have a plan besides the same tired failures the current admin did and her daughter is just as fugly as Nancy .","post_message":"Nancy Pelosi's daughter went full-on crazy during this Friday Fox interview..."},{"comment_id":"10153798223993132","commenter_b":"All white women fear intelligent black women!","commenter_a":"Im not at all surprised that a group of loud, obnoxious, self-important women threw a fit. Don't be disrespectful to other passengers, and then demand respect. You're not above others.","post_message":"But it may be too little, too late."},{"comment_id":"503269356530311","commenter_b":"Yes they should keep it in there country. We do not want it here.","commenter_a":"Yeah right. I don't think so. This is BS","post_message":"Legislature passed in Florida that is forcing Shariah Law on local women. These women are in trouble. Let's put a stop to this now. Do you agree Shariah Law should be banned in America?"},{"comment_id":"10152635472271770","commenter_b":"she's a glorified prostitute. complains about the johns, but keeps taking her clothes off and taking the money","commenter_a":"and the money....","post_message":"Except for the freedom of speech, apparently."},{"comment_id":"1152030998150262","commenter_b":"You wouldn't believe it even if it was released. You'd say it was staged. Let the girl rip.","commenter_a":"How about releasing ALL the footage of her before , DURING , and AFTER her untimely murder!!! Its easy to let America view when she was alive. BS!!","post_message":"\"This video should demonstrate that people who are out there going through a lot of trouble to spread lies and mis-truths on Waller County — we are not going to stand idly by and allow that to happen.\""},{"comment_id":"10154111974819726","commenter_b":"check out her multiple lies prior to this...this chick is no journalist","commenter_a":"I can believe a liberal reporter pulling this nonsense stunt, but not someone from Breitbart! Conservative commentators have lost all respect from me if theyre going to pull these moves against anyone.","post_message":"WATCH: The now infamous video of Trump's campaign manager Corey Lewandowski allegedly grabbing Michelle Fields. What do you think happened?"}]
