[{"comment_id":"1686144921672620","commenter_b":"Sixty percent of the donations to his church are by mail. I'll wager sent in by those that can least afford it.","commenter_a":"I am thoroughly confused. Why does a preacher have to be a millionaire? Jesus did not need a million dollars to spread the Word of God and there is no other as Him. Nor did his disciples. They taught the Word and lived the Word and never did they live as lavishly as these preachers. Many of you are saying that IRS should not get involved and the people should do something about it. The problem is that no one is and the blatant greed and lavish lifestyles is out of control - and what is the absolute worst- it is all done \"in the name of the Lord\". Sorry folks, these are not churches. They are tax free money making machines that feed off of very good hearted Christian people that just want to do their best to live according to the Word and these \"preachers\" know just what ...","post_message":"I can't believe this is happening. Sending prayers for Joel Osteen and the rest of America's churches that are being attacked."},{"comment_id":"10156267037025354","commenter_b":"Why are illegals allowed to have a drivers license? Utter insanity!","commenter_a":"Jerry Brown is a putz! He should have been out of politics decades ago. Look at California. It's a disaster.","post_message":"It's starting."},{"comment_id":"10152910836255779","commenter_b":"Simply stated, the majority of the comments on this thread express what she is all about. Feminism, my eye tooth!","commenter_a":"Remember the days when you had to have talent to make the cover of @username? #TakeMeBack","post_message":"Reality-TV juggernaut, selfie queen, actress, model, mother, Internet-breaker, entrepreneur and video game subject Kim Kardashian has something to say: \"I believe that I am so much smarter than I'm portrayed.\" The 34-year-old megastar talks about her scandals, family, and feminism in our wide-ranging new cover story. Here are 11 highlights you won’t want to miss: @webpagelink"},{"comment_id":"1055064891200649","commenter_b":"Time to take them away before she kills them and why you are at it tie her tubes! Not smart enough to have children!","commenter_a":"Well try her in there for five minutes w/0 her iPhone, mirror and other items you know she thinks are indispensable....don't forget, no designer water, either!!!","post_message":"A Virginia mother left her two children unattended in a hot car, with windows rolled up as she turned herself in for leaving one of the children unattended in a hot car while she went shopping last month."},{"comment_id":"994492227347127","commenter_b":"Where is sound. Its just like showing a 360 picture.","commenter_a":"Watching from Yorkshire","post_message":"We were live at the demolition of one of the UK's tallest buildings. The Grain power station in Kent came down at approximately 11:00BST. Do you live in the area? Were you happy or sad to see it go? (Skip to 10 minutes in for the demolition moment)"},{"comment_id":"750686755029933","commenter_b":"She's a racist","commenter_a":"I guess this only applies to black women since she declared \"Black girls rock\" instead of ALL GIRLS ROCK","post_message":"The \"Barack Obama\" move didn't go over so well."},{"comment_id":"1719601761432898","commenter_b":"Similar... squeeze out a parasite living off the host....","commenter_a":"I don't know which news item is more intriguing - this, or Kim Kardashian's wanting a divorce from Kanye West. It's so hard to keep up, with so much happening these days.","post_message":"Oh no. (from Elite Daily)"}]
