[{"comment_id":"1414587195226950","commenter_b":"2 all the women in pink why not just pack up ur pink panties and move 2 Cuba now that we have relations again I hear it's a paradise.","commenter_a":"GROW UP","post_message":"Female supporters of President Donald Trump aren’t sure why the Women’s March was necessary."},{"comment_id":"10153717655651323","commenter_b":"I'm sure mosques will be very useful for Syrian refugees in Germany. Are you for real?","commenter_a":"Focussing on mobile phones while poor syrians are getting genocided by poseidon in the mediterranean? Fucking white neonazi shitlords.","post_message":"You will soon be able to ignore your friends and family in Europe as well as at home for no extra cost."},{"comment_id":"1118814734807982","commenter_b":"174742062548592helle Tenney let it first be understood I can care less for evil feminist. My point is why go to a frat house that is known for Alcohol drugs and loose women having sex up stairs, when you know inappropriate things always happen in places like that. Secondly, I'm sure she was there drinking in an unsafe environment but I don't condone anyone being raped but we should ask ourselves why the Hell do women keep going to places that are historically unsafe for women? Lastly, women lie so much about rape and other things that no one knows when they are telling the truth. There has been several times when men have been falsely accused of rape and we found out later that she was just trying to cover up the fact that she decided to sleep with the whole football team at once. I see the police reports ...","commenter_a":"Ok but why was she even there in the first place?!!!!!! Why do girls go into Frat houses?!!!!","post_message":"Sexual assault on US college campuses is a major problem and we can't ignore it any longer. In an exclusive interview, US Vice President Joe Biden outlines how he's leading the charge to change the way we fight this epidemic by going straight to the source. Get the full experience at mic.com/enough"},{"comment_id":"1212697888750239","commenter_b":"It's funny how the liberal low information voters want to take guns away from law abiding citizens, as if that will solve anything, yet they don't want to deport the illegal felons and criminals, or prevent them from being able to get guns in the first place; and you don't want to prevent a terrorist organisation that supports ISIS from getting ICBM nukes. Brazil has the world's most strict gun laws, yet people die almost every minute of the day due to gun violence there. You know why? BECAUSE CRIMINALS DON'T OBEY LAWS! That Oregon campus was a gun free zone in an area where open carry is legal. No one would have the guts to go on a shooting spree anywhere but in a gun free zone. Anytime there is a tragedy like thus, the Democrat solution is always more government tyranny. Europe has the same population size as ...","commenter_a":"So I'm sure someone on Facebook will say it's all his fault. Yeah right.","post_message":"A shooting at a school in Oregon is just the latest massacre that President Obama has had to respond to. Read full story: @webpagelink"},{"comment_id":"10154180485564411","commenter_b":"Here illegally? They should hide.","commenter_a":"Most criminals try to hide. Live in fear!","post_message":"Immigrant rights activists call it the Effect."},{"comment_id":"10153425462103271","commenter_b":"When is she to be put in a mental institution for the rest of her life, if I had a family member killed I would come after her, she is probably in hiding by now. If a woman wants an abortion THAT IS HER RIGHT TO DO SO.","commenter_a":"This is how far out these repubs go to make themselves look good to their GOP base.","post_message":"WEIGH IN: In a Facebook post, JoAnn Windholz calls Planned Parenthood a \"culprit\" and \"the true instigator.\" Read the full statement. Your thoughts?"},{"comment_id":"10153607443456130","commenter_b":"She is a fucking war criminal.Are you guys fucking high?","commenter_a":"I hope when this all over H.A. Goodman writes Hillary Clinton a thank you letter, because writing about how bad he thinks she is regardless of the facts is basically his entire career.","post_message":"\"The only leading candidate in 2016 (Ted Cruz, like Trump and Clinton has a negative favorability rating) with positive favorability numbers is Bernie Sanders. Think about that for a moment.\""}]
