[{"comment_id":"10152477981607434","commenter_b":"I agree. If she lived in Miami in a luxury condo, she'd probably pay more.","commenter_a":"But- that's not a lot of money when you consider she has no mortgage, no car, no food bills- I mean- I don't want it but....","post_message":"The cost of living like a goddamn queen is high."},{"comment_id":"10153127033512383","commenter_b":"Draw the little snakes out","commenter_a":"Bring it!","post_message":"UNAFRAID: Troops remain defiant on social media in the wake of the recent threat against military personnel from the Islamic State group."},{"comment_id":"10153638977331336","commenter_b":"Who said I only talked to one? I only mentioned ONE conversation","commenter_a":"Their apology means nothing if the employee was not fired immediately.","post_message":"The Pembroke Pines Police Department says that a uniformed officer was refused service at an Arby's simply for being a police officer."},{"comment_id":"10153713889518869","commenter_b":"this particular immigrant is a whore.......you dont get a pass for being an immigrant......","commenter_a":"an Immigrant bar whore toy bought by Donald....the end.","post_message":"The couple's courtship story is as chaste as its backdrop is louche: Donald saw Melania at an event, he asked her for number, but Donald had arrived with another woman—so Melania refused. He persisted."},{"comment_id":"10153058951371045","commenter_b":"send her to Hollywood she can act!! send to JAIL!!!!!!","commenter_a":"It seemed like a pretty fake cry to me, you know that baby was there just sorry she got caught!","post_message":" God. Oh God. I can believe I did that. Oh my God. My husband going to kill me. Oh my God! That's the reaction police body cameras caught when a frantic mother was confronted for leaving her 1-year-old daughter in a sweltering van parked in an Oklahoma Wal-Mart parking lot."},{"comment_id":"10156946534115093","commenter_b":"Hillary will trounce Trump because 70% of voters dislike Trump. That's the math.","commenter_a":"Ya use your own mind governor vote trump don't be an establishment governor. Trump is who the people want.","post_message":"Governor Mike Pence should exhibit the leadership that conservatives have come to expect from him."},{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"}]
