[{"comment_id":"1001556806534263","commenter_b":"A vagina is a sex organ. A boob is not. Stop comparing them.","commenter_a":"Society uses breast on ad to sell cars, burgers and every shits they want but when it comes to the natural uses, which is feeding a baby assholes loses their minds ? Should think twice before saying women who breastfeed don't have respect for themselves. What did our mothers/grandmothers did before powdered milk ?","post_message":"Women are brilliantly standing up to breast-feed shaming. Read a powerful example right here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"1232095813528626","commenter_b":"Deplorable bitch","commenter_a":"Corrupt politician","post_message":"I want to see what you all come up with... Describe Hillary in just two words... Ready, set, go!"},{"comment_id":"10153520680806077","commenter_b":"Marine's can be so cocky ugh","commenter_a":"Some people are so trigger happy, its ridiculous and disturbing.","post_message":"Jesse Nelson's 32-year-old brother Christopher was killed after he tried to break into a house in Denver. \"Dying like this, it's not worth it,\" Nelson said."},{"comment_id":"10155380353783797","commenter_b":"Smh Freaking Nazis","commenter_a":"KevinNajera","post_message":"HOLOCAUST REMEMBRANCE DAY: Today marks the liberation of the Auschwitz Nazi death camp on January 27, 1945. Take a moment to remember the millions killed. bit.ly/2k1HfMq"},{"comment_id":"1164111043641758","commenter_b":"that is not Trump8 wife","commenter_a":"Hey if you got it show it","post_message":"Liberals Attack Trump Family After Sexy Photos Of Ivanka Trump Leak. Let's show her our support. Do you stand behind the Trump family?"},{"comment_id":"510871105704596","commenter_b":"great man spreading peace, love, and equality.","commenter_a":"Evil wolf in sheeps clothing","post_message":"What are your thoughts on Pope Francis?"},{"comment_id":"998169870194483","commenter_b":"Dicks","commenter_a":"How the hell does anyone defend this crap?","post_message":"Their Orwellian alternative to paid family leave -->"}]
