[{"comment_id":"1065854716799003","commenter_b":"It looks like a piece of food. Im a Trump supporter. I think these stupid battles between the two are immature and I think making this some huge talking point in the world is exactly why all of us keep electing the wrong people. We care more about a piece of food on someones face then what theyre actually saying. I don't like Cruz. my money is on Trump all the way but we need to all grow up and look at the issues because this isnt Saturday night live. This is real life and the wellbeing of many people is at stake here.","commenter_a":"What about Father's Rights Movement and an overhaul to how child custody and parental time and child support are handled? If elected is Mr. Trump looking at this issue?","post_message":"We will save over $300 billion a year if we properly negotiate our healthcare expenses! #GOPDebate"},{"comment_id":"940305309340143","commenter_b":"Muslims should be ban from Guns & Knives !","commenter_a":"Nice sentiment, but It'll never stand. If People can be forced to bake a cake against their beliefs, the muslum-loving bunch in D.C. won't allow this!","post_message":"\"I will not arm and train those who wish to do harm to my fellow patriots.”"},{"comment_id":"551022975088282","commenter_b":"the only thing i would sacrifice for this transvestite is a bullet.","commenter_a":"What the hell makes her think she can change our constitution? She's a nobody married to a mistake & not worth the oxygen she breaths! & he is a waste of oxygen also.","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"10155704643444199","commenter_b":"No we dont want that woman in office.","commenter_a":"People don't want a woman in office. It's that simple! You can tell yourself and the rest of us that that's not the case. But it is.","post_message":"It the first time in four decades the state electors have broken from the popular vote for president. At least one vote was cast for Faith Spotted Eagle."},{"comment_id":"10150862298954999","commenter_b":"Hillary is the devil!","commenter_a":"Anyone who supports Trump, the human pile of fecal matter, at this point is also a human pile of fecal matter. Vote Hillary, Johnson, Stein, or write in Jesus for all I care, but for the love of all that is good and holy, do not vote for Trump.","post_message":"“I’m not going to relax,\" Christine Quinn told Donald J. Trump's former campaign manager. \"Because we have a man running for president of the United States who made a gold star mother have to go on TV and cry in front of America. This isn’t about politics——\""},{"comment_id":"10153599468079024","commenter_b":"Obnoxious establishment audience. Am I watching Jerry Springer folks?","commenter_a":"can you have the audience quit with the noise, so we can actually hear the questions being asked? it's rude","post_message":"Republican presidential hopefuls take the stage in South Carolina as CBS hosts the ninth GOP debate tonight. Watch live here: @webpagelink. Read the latest updates on CBS New York: @webpagelink"},{"comment_id":"1415185618534424","commenter_b":"@username Spaniards have been in this country for a very long time and that will never change. It is very raciest of you to assume only Hispanics are illegal and most legal Hispanics would like illegals deported. We have immigration laws in this country and they will be enforced .You are nothing but a hateful bigot. Eva's country doesn't deal with an illegal immigration problem because they strictly enforce their immigration laws; as soon as Canada takes in 10 million illegals Eva can have an opinion on this matter.","commenter_a":"Trump stirred it up with all his comments during the campaign. He brought out the worst in people. And because he was so verbal againgst race...religions...women...all the racist bigots who kept semi silent for a while have come outta of the woodwork and guess who led the way. And to think he is now going to be the leader of your country.","post_message":"Chili's provides veterans a free meal every Veterans Day, so US Army veteran Ernest Walker went to his local Chili's for a burger. Instead, he was denied a meal after an altercation over his service record. @webpagelink"}]
