[{"comment_id":"10153134555889753","commenter_b":"They should lock her down before she kills some one.","commenter_a":"Yes! This was a full on assault! When there is a minor present it is a felony. She should be tried to the fullest extent of the law!","post_message":"Do you think this teen should be tried as an adult?"},{"comment_id":"1007076626015699","commenter_b":"Yes they need to hire them back and get rid of the illegals that took there place ...what needs to be done is the illegals need to be shipped out of this country we don't need them not do we want them","commenter_a":"they need to hire them back","post_message":"Trump also criticized Marco Rubio for sponsoring the \"I-Squared\" bill that would TRIPLE the number of H-1B foreign visa holders in the U.S."},{"comment_id":"10150742367724999","commenter_b":"Yes Debra! Preach","commenter_a":"What?!! Do you really think young women voters can ignore that Hillary chose a MONSANTO lobbyist as her campaign manager? We'll wait for Elizabeth Warren, thank you very much. In the meantime- Senator Sanders is our Mr. Clean.","post_message":"Hillary Clinton's older feminist supporters had a message for young women who are not backing her candidacy: Shame on you. Update: Gloria Steinem later said she \"misspoke.\""},{"comment_id":"10154370005056162","commenter_b":"She should be CHARGED with TERRIBLE TASTE in clothing!","commenter_a":"The legs are a lot longer than a lot of the short shorts that teenage girls get away with wearing all the time everywhere.","post_message":"TOO SHORT? A burlesque dancer says an airline stripped away her dignity when they told her to change her clothes if she wanted to board her flight... @webpagelink"},{"comment_id":"10152961665786336","commenter_b":"Why would any of you morons disagree with Dr. Carson? As long as kids get vaccinated and as long as adults have already been vaccinated this Country can be protected from these diseases. Time for Obama to guarantee that anyone illegal immigrant be vaccinated...","commenter_a":"Just another reason why we need to CLOSE the borders, ENFORCE the laws already on the books and DEPORT all illegals. That means, NO AMNESTY for anyone.","post_message":"Fox News Sunday EXCLUSIVE: Dr. Ben Carson joins Chris Wallace with his stance on the vaccine debate and his plans for 2016. Check your local listings or tune in to Fox News Channel at 2p and 6p ET."},{"comment_id":"1845364932419184","commenter_b":"Little girl go sit down and shut the hell up.","commenter_a":"she is an bitter root from the tree","post_message":"Not a good choice of words, Bristol."},{"comment_id":"1298762416842950","commenter_b":"Actually W paints pretty darn decent pictures.","commenter_a":"nobody expected Bush to paint like a 5th grader. Okay, yeah we did.","post_message":"Don't expect him to stay home and take up painting."}]
