[{"comment_id":"10154036323171337","commenter_b":"Rat face versus Moron","commenter_a":"Fuck Kanye. He's the biggest skank that ever was.","post_message":"WHOA! Did Taylor Swift just drop a whole lot of shade on Kanye West??"},{"comment_id":"10156142090560594","commenter_b":"I know","commenter_a":"Go back to Brooooooooklyn. Where you belong.","post_message":"If we can't have San Francisco Giants postseason wins, this is the next best thing."},{"comment_id":"10153595971197016","commenter_b":"And women are going to vote for this lady killer","commenter_a":"Sigh. If this big dope gets elected even the people who elected him will be bitterly deceived and betrayed and it won't take long.","post_message":"Republican presidential nominee Donald Trump on Sunday morning described the numerous female employees at Fox News who accused Roger Ailes of sexual harassment in the workplace as \"complaining\" and explained how that makes him \"sad\" because really the company's top executive actually \"helped\" \"some of those women\" and he's a \"very good person\" and a close personal friend. WTF."},{"comment_id":"10153509849905329","commenter_b":"Get a grip lady","commenter_a":"Caitlin didn't choose to be born feeling like she was in the wrong body. She's not getting the award for getting surgery, she's getting the award for standing up in a bigoted, judgmental, harsh world and being her authentic self. She is giving hope and courage to thousands of transgender people all over the world and showing them it's OK to be themselves. Who knows how many people she is saving from suicide by being strong enough to go public and be treated with ridicule, ignorance, and hate. She's making a tremendous impact on the LGBTQA community. Courage comes in all forms. Are only the military and first responders allowed to show courage? Is that the only type of courage we're allowed to recognize? I choose to disagree. Of course Noah is courageous, no one is saying he isn't. Of course every member of our military is courageous, but that ...","post_message":"ESPN confirmed to BuzzFeed News there is no such thing as a “runner-up” to the Arthur Ashe Courage Award."},{"comment_id":"10152999859350090","commenter_b":"He is gone. Concentrate on what is happening NOW!","commenter_a":"yes , in my lifetime. Teddy Roosevelt runs neck and neck. different reasons.","post_message":"Tell us if the Gipper tops your list. The Historical Presidents Poll: @webpagelink"},{"comment_id":"1180266452035470","commenter_b":"@username... Exactly! They're just drugged and/or drunken hoes.","commenter_a":"I FEEL YOU SHOULD HAVE A LIMITED AMOUNT OF KIDS IF YOU ARE ON WELFARE.","post_message":"WHOA! This judge goes off on this arrogant and ungrateful mother of 12 kids who has gotten a ridiculous amount of freebies from the state. What this mother says will disgust you. Can we get 2,000 'LIKES' to take back all the benefits this ungrateful moocher has gotten?"},{"comment_id":"635677536633830","commenter_b":"Demons","commenter_a":"@username read the top comment 😂😂😂","post_message":"Name it! #WSHH"}]
