[{"comment_id":"894578323912842","commenter_b":"Then it would forever be a mystery. That hag will never tell the truth.","commenter_a":"Did they ask Hillary that question well when she tells the truth then they can come back and ask Rick that question.","post_message":"\"These are tough issues...\""},{"comment_id":"10153512778925667","commenter_b":"Life is like a camera. Just focus on what's important, capture the good times, develop from the negatives, and if things don't turn out take another shot.","commenter_a":"They should put him in the same cell as Clinton.","post_message":"Martin Shkreli could face additional criminal charges."},{"comment_id":"587167334791713","commenter_b":"Stand with her point of view, and share her perceptions with your friends! @webpagelink","commenter_a":"I am with hillary","post_message":"One candidate delivers catchy lines—the other delivers results. Add your name to say you're with Hillary. #DemDebate"},{"comment_id":"10153948445168812","commenter_b":"you gonna adopt it?","commenter_a":"And for Christmas the pup should be freed from its current owners and gifted to a loving home.","post_message":"A pup from Hardin County, Iowa, got a sweet surprise this Thanksgiving when she was gifted a brand new dog house after living outside for almost three years."},{"comment_id":"10158061833465354","commenter_b":"White bitch bahaha!","commenter_a":"Samantha Bee can blow her fuckin brains out for all I care. Lamestream shill. Stop feeding her.","post_message":"Dear Democrats, Please, PLEASE keep up your trashing of the 60,000,000 Deplorables who elected President-Elect Donald Trump. With every smug, arrogant, elitist, hyperbolic swipe you take, you further confirm why We the People rejected you in the first place. So please, keep it up! Sincerely, The Deplorables"},{"comment_id":"884581044987387","commenter_b":"If one wants buy-in from white people, blowing off white people who have had similar experiences seems extremely counterproductive.","commenter_a":"i think it's racist that it's subtle racism is only being committed by a white person in the panel. the comic itself is subtly racist.","post_message":"Let's agree to fix this."},{"comment_id":"10154064032541509","commenter_b":"Because Muslims should NEVER be president of the USA period!","commenter_a":"So what if Obama is Muslim? And then what!?","post_message":"Donald J. Trump under fire for not challenging anti-Muslim comment from a supporter: @webpagelink"}]
