[{"comment_id":"10154341352611729","commenter_b":"I am tired of hearing about this. Nothing will happen to her. Why? Who knows. Just let us know if and when she is charged. That will be news and surprising. She gets away with every thing like that damn man in the oval office.","commenter_a":"Yeah, right......","post_message":"This could be it..."},{"comment_id":"10154094410781051","commenter_b":"Again, there are more good cops than bad cops.","commenter_a":"Media is the reason we don't see or hear of these Good Deeds....stopped watching the news & buying the paper...All liberal bias crap & I'm sick of it!!â¤ï¸ðŸ‘®ðŸ»â¤ï¸","post_message":"When these police officers learned that a local teen was walking two hours to work each day, they immediately stepped up to the plate and helped him out. Do you think America needs to hear more stories like this?"},{"comment_id":"10154047559291770","commenter_b":"Jail her","commenter_a":"hope they CHARGE HER","post_message":"Muslim woman lied about subway attack by Donald Trump supporters."},{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153227857229330","commenter_b":"I'd do the same thing - little punk needs a good whipping from his mom","commenter_a":"There is one parent in Baltimore that has her priorities straight.","post_message":"Mom of the Year? Check out what a mom did when she caught her son out rioting in Baltimore. ---> @webpagelink What would you do?"},{"comment_id":"1772774552977135","commenter_b":"These women are hypocrites.","commenter_a":"So explain to me how Trump is horrible because he was talking to another man in private about a women who cares get over it you crybabies. I'm sure she liked it too","post_message":"BREAKING: Protesters have gathered in front of the Trump Tower on Michigan Ave. They're holding graphic signs referencing Donald Trump's lewd comments about women. No arrests so far. MORE: @webpagelink"},{"comment_id":"10153479746226438","commenter_b":"Nazi feminists, fuck off!","commenter_a":"Why are you showing a picture of this psychotic liar mattress girl who ruined a boys life with a false rape charge? There is no rape culture on college campuses. Rape has declined dramatically over the past decade. There are a lot of false charges of rape by scumbag feminist women though.","post_message":"Unfortunately, the oft-criticized statistic is true."}]
