[{"comment_id":"10156651164980551","commenter_b":"Dame this women looks alot like Natily wood","commenter_a":"Mine, too!","post_message":""},{"comment_id":"10153848346775470","commenter_b":"Shes just drunk leave her alone","commenter_a":"Johnny Saenz","post_message":"Parents of students at an elementary school were outraged after they found out kindergarten teacher Klara Bowman had been fired after an accusation she was intoxicated in her classroom."},{"comment_id":"10155280506710329","commenter_b":"Things real vaginas eat","commenter_a":"I read that as \"vagina\" and then saw a picture of the cupcake looking thing...didn't think twice until I read the caption again. =)","post_message":"It's tastier than you think it is."},{"comment_id":"10153683930231323","commenter_b":"@username No, your country has still resposibilities coming from your good age of colonialism and be honest to your self: IS are nothing else than organised crime and don't be so stupid to believe, that an group of organised crime needs \"illegal immigrants\" to spread the business. BTW: find out where the largest number of historical artefacts from the middle east, coming with an unclear origin, are traded? Don't be surprised when you find out that it is London and you you can easily find out, that it is business of billionGBP earning. Why do you think IS is destroying historical sites? So, all this happens under the control of your government, right in your neighbourhood...","commenter_a":"The people were on their way and Germany take action to relief all surrounding countries, who where not able to cope with a minor percentage of the people floating their countries. Yes, it is not easy, but Germany helps a lot of people and countries and yes, it is a massive task, but we (you and me and our governments...) have to deal with it.Why? Because we are causing the situations, why the people have to flee and have seek for shelter. So, I am living in Hamburg, my borough is called \"Bahrenfeld\" and we have a polpulation 23.000 people. Currently we have 3.200 refugee living here. And I can hardly understand, why a country, which has caused and initilized a lot of the current wars in the middle east, in order to earn oil money ----NO---- to fight terrorism (hahaaa), refuses to take part in the resposibility...Yes, my dear ...","post_message":"“Sometimes the smugglers arrive in the middle of the night and drop underage refugees off at the service station. The police call my child protection officer at 3am, who has to go to them, and if no accommodation can be found, he often ends up taking them home with him.\""},{"comment_id":"10152872089786135","commenter_b":"Nations aren't doing too well and filled with hate, before this law was passed.","commenter_a":"We all know what God does to nations that disobey His word and goes rampant","post_message":"BREAKING: U.S. Supreme Court requires states to recognize marriage between two people of the same sex. LIVE UPDATES: @webpagelink"},{"comment_id":"10154325210061336","commenter_b":"Let's just deport him. I'm sure that he has learned his lesson and he will never come back. (Sarcasm) Seriously, just shoot him. He's a criminal non citizen, here illegally. He shouldn't be entitled to any of the protections that our constitution affords us and neither should any other illegal immigrants that further engage in criminal activity.","commenter_a":"It may happen more then you can imagine!!","post_message":"Rene Ortiz Quintana, 69, took the identity of Ruben J. Gallardo – who has been dead since 1994 – to get Social Security, VA and other Federal, state and local benefits since 2012."},{"comment_id":"10152767059646519","commenter_b":"She is not a stripper!","commenter_a":"Really? Praising a stripper mom? You lost me today, @username.","post_message":"Go mom!"}]
