[{"comment_id":"789272967888144","commenter_b":"If you're here illegally you need to get the fuck out . Don't care how old you are or how long you've been here","commenter_a":"Kill yourself Santorum , you have no purpose and you spread the disease of hate.","post_message":"Santorum... Santorum... That name sounds vaguely familiar... But why?"},{"comment_id":"10156732658910492","commenter_b":"What is it with older ladies and dislike of bike lanes? @webpagelink","commenter_a":"These ladies probably shouldn't be driving anyway","post_message":"\"New York City is not Amsterdam, it never will be Amsterdam, and that's all there is to it.\""},{"comment_id":"606523686188854","commenter_b":"@username i will not vote for @username, he is NUTS . just like Hillary.","commenter_a":"Will you Chip in today?: @webpagelink","post_message":"First they ignore you, then they laugh at you, then they fight you, then..."},{"comment_id":"10154351539851336","commenter_b":"The fact that this women he raped was not aware of what was going to happen to her! makes him a horrible rapist!! even if she was drunk!! the same thing happens when a doctor rapes a women after they been under anesthesia and an adult raping a child is just as bad!! this young adult knew what he was doing, and now practically gets a pat on the back! by his ather and the Judge!! telling him yeah it's okay, you did nothing wrong let's just give you 6 months in jail so that we can get the media and people off our backs!! high five son!! you got my back and I got yours!! how disgusting and bad education coming from his parent!! this world is small and one day he will have a kids one day of his own, he better pray that your babies never ever ...","commenter_a":"I haven't looked at this in detail. No one should have an opinion about this until you look into it yourself. I don't go by what the media says, neither should anyone. Judge not less ye be judged. So if you haven't looked at this in detail, yourself, you can't possibly know the truth.","post_message":"Pastor John Pavlovitz wrote a powerful open letter to the Stanford University rapist's father, who said his son was paying \"a steep price...for 20 minutes of action.\""},{"comment_id":"1503738089934482","commenter_b":"Get the employers to stop hiring illegals, problem solved.","commenter_a":"no, and unless u r an open borders leftist, you probably don't either. sick and tired of illegals. period. build the wall, e-verify, zero benefits for illegals = mass migration back where they came from. problem solved :)","post_message":"Joe Biden went to Mexico on Friday and delivered a clear message: The views of Trump absolutely do not represent the views of most Americans. Do you agree with the VP?"},{"comment_id":"10152627290331636","commenter_b":"should be run over by a merkava driven by a female israeli lieutenant. thirty times.","commenter_a":"To all the comments... No one support banding women from driving in saudi expect the foreign policy of UK, USA and france which insisted to aid every decision that made or will be made by barbaric and dictator royal family in saudi since 1940s,.... lets stop taking and read history... \"Knowledge-is-power\"","post_message":"The totally logical justification for a ban on women driving in Saudi..."},{"comment_id":"10153197051250329","commenter_b":"Lol that's like half of us @username","commenter_a":"Kimberley Stefan","post_message":":/"}]
