[{"comment_id":"10153891492220575","commenter_b":"A DISGUSTING IDIOT RACIST TRADER WOMAN","commenter_a":"WHO HIRED HER RUBIO OR CRUZ?","post_message":"Surprise! So-called \"Trump supporter\" is a far left Union activist!!"},{"comment_id":"10155302269621509","commenter_b":"He may be dead but he was right. There are some crashes that you can be in that you won't survive if you were wearing an armored suit. Its proven fact that everywhere they have changed the laws regarding wearing helmets deaths have increased. It happens around here a lot and most of the deaths are caused by head trauma, no helmet.","commenter_a":"what a tragic irony!","post_message":"A state lawmaker who voted to repeal universal helmet laws has died in a motorcycle crash. He was wearing a helmet at the time."},{"comment_id":"1073730232720030","commenter_b":"Their all prostitutes, lol","commenter_a":"Mika was raised and programmed to be a prostitute by her father. She's very accommodating when it comes to white politicians and Chinese business men.","post_message":"A hot town hall mic just exposed Trump as the fraud he is."},{"comment_id":"10153846825321336","commenter_b":"We need him gone he don't give a damm about anything go home you muslim","commenter_a":"Obama is aiding and abetting the enemy. He is a traitor and should get what he deserves as such.","post_message":"“If you were waiting to hear a U.S. president say, 'I feel your pain' or…'it’s them or us,' that is not what you just heard.” – Bill Hemmer on President Barack Obama's speech on the Paris attacks @webpagelink"},{"comment_id":"1196543867052750","commenter_b":"This bitch is hilarious, please keep validating all of the stereotypes of a trump supporters! Please wipe your mouth there is shit everywhere!","commenter_a":"Wow we got some really stupid people on here first let me say I'm pre-med graduated with honors I have served as an EMT and probably took care of you idiots in the o.r apparently your lobotomy didn't work we are smart people and educated people the dumb ones are the ones that think he's wasting his time trying to save assholes like you","post_message":"Someone shared a meme featuring an Adolf Hitler quote attributed to Donald Trump -- and his supporters ate it up!"},{"comment_id":"10152881862581051","commenter_b":"Fry the bitch","commenter_a":"Sad god be with her","post_message":"When police responded to the 911 call, they saw this woman on her front lawn - covered in blood. But even that didn't prepare them for what was inside the house."},{"comment_id":"10154450520586320","commenter_b":"Well said Claudia","commenter_a":"own it. you have ignited and stirred the kettle and walked away. you have failed to address the real crimes of black/black murders happening every day in your 'home town' of chicago. you are perpetuating a false narrative to strip the local police from doing their job, create chaos and mistrust. own it for once and stop blaming everyone else.","post_message":"President Obama is to address the #BatonRougeShooting where 3 police officers were killed."}]
