[{"comment_id":"438573499666627","commenter_b":"@username. She's an idiot","commenter_a":"Another liberal sheep just voting for a female!","post_message":"Lena Dunham isn’t worried about Michael Bloomberg."},{"comment_id":"10158500628960389","commenter_b":"As a Hispanic born in the US, no Jorge Ramos! This country does not belong to illegals! You're are crazy and delusional, if you love Mexico so much go back there and see how it goes for you! We are not against legal immigrants, it's the criminal illegals that should go back! So screw off and shut up!","commenter_a":"Deport Ramos. I'm an immigrant and can't stand him.","post_message":"Univision anchor goes on an ethno-nationalist tirade."},{"comment_id":"1346170432096021","commenter_b":"@username What makes you think it's civilized? Is it the fact that mankind is about to lose it head (literally) to religious beliefs by people that still throw stones and rape like cavemen! I see your education come from ''acadamia\"! Which is also still in the dark ages!","commenter_a":"@username Nutt, a researcher at Imperial College, had to crowdfund this LSD study. He calls LSD research \"the worst censorship of science there has ever been.\" Read more: @webpagelink","post_message":"For the first time ever, scientists scanned a brain on LSD using modern technology. What they saw was a more \"unified brain.\""},{"comment_id":"712988442225067","commenter_b":"aint she pretty..i would rather kiss the south end of a north bound mule...","commenter_a":"My God that's one ugly broad she has more rinkles than a road map","post_message":"Like if you agree."},{"comment_id":"987087694644317","commenter_b":"Babies gotta eat . If you don't like it don't look . If you want to fight something, fight the laws that deal with drunk drivers . Come on America WAKE UP !","commenter_a":"Well said @username","post_message":"Dozens of mothers staged a \"nurse in\" in front of the state Capitol building today in nationwide movement. What do you think? A. I'm glad these moms are standing up for their rights B. Attention to \"discrimination against breastfeeding\" is needed C. This wasn't needed D. That's fine, we just don't need to see it E. Your own answer"},{"comment_id":"775573792575801","commenter_b":"@username bitch","commenter_a":"Nope. It was an error. The correct winner was announced. I disagree with Donald on this one. Life isn't always perfect and mistakes happen... The girl that was first announced should be proud that she came in second and briefly got to feel what it was like to be first. #stuffhappens","post_message":"Well........."},{"comment_id":"1739731709624496","commenter_b":"Dumb racist bitch","commenter_a":"I think she's stupid - like literally too lacking in intelligence to do more than jump onto an under informed, opportunist bandwagon.","post_message":"Don't let the door hit you..."}]
