[{"comment_id":"486025081592014","commenter_b":"I really really want her to go to jail","commenter_a":"This lying bitch only knows how to take care of her greedy self!!!!","post_message":"Hillary Clinton criticizes Republican Donald Trump's tax plan, calling it \"trickle down economics on steroids.\" Do you agree or disagree with Clinton on this?"},{"comment_id":"10153151930717426","commenter_b":"@username there is no double standard. One group enslaved, tortured, raped and brutalized a race, and fought a war to keep their slaves (states rights). And the other called a race that did all the above to them devils. No comparison.","commenter_a":"Who cares about the names of the schools? Does it further rasicsm? No. Are kids being taught rasicsm? No. Anything can be offensive as \"being offended\" is subjective. Will we then denounce anything named after Malcolm X because he was a Muslim who believed that all black people are Gods and the white man is of Satan? Now that's offensive.","post_message":"She argues the name represents a “history of racism.” There are also two local schools named after J.E.B. Stuart as well as other schools named for Confederate leaders. Do you think this will/should change?"},{"comment_id":"457639131093334","commenter_b":"Fuck her","commenter_a":"She doesn't even have the power to shut down a lemonade stand.","post_message":"Will You Cave To Michelle And Only Eat Where She Wants? Comment 'yes' or 'no'."},{"comment_id":"10153915045317434","commenter_b":"And like she's trying to get the fuck away.","commenter_a":"Am I the only one who thinks the second pic looks like he is going down on her? Oy!","post_message":"Enjoy some underwater pregnancy announcement pictures."},{"comment_id":"585422771627079","commenter_b":"I disagree. Trump will defeat the Liar Hillary.","commenter_a":"WELL IF 65-70% DON'T WANT TRUMP AND HIS POLL NUMBERS ARE MUCH HIGHER THEN TED'S... THEN I WOULD THINK 90-95% DON'T WANT TED AND EVEN LESS WANT RUBIO...","post_message":"\"If Donald is our nominee, in all likelihood, Hillary wins, we lose the Supreme Court for a generation, the Bill of Rights is lost, we're buried in debt, and jihadists rise across the globe,\" Ted Cruz said. Do you agree?"},{"comment_id":"10153601498992383","commenter_b":"Well your opinions are wrong, ladies! What kind of military expertise do you have besides \"my husband served?\"","commenter_a":"this is getting way out of line.second marine shot at a shooting range at Camp pendleton?","post_message":"Our thoughts are with the family and friends of the Marine."},{"comment_id":"1415440468755532","commenter_b":"Embarrassing shows some English women are ,more than stupid!!! What a PRATshe is , excuse the pun!!!","commenter_a":"These stories are not the norm. As a Brit I have been shocked & saddened at the attitude of the Brits post Brexit. If you are foolish enough to believe that the newspapers print stories that represent the situation of most refugees then you really are foolish. Yes stories like this happen, they always have. But for many this is not their situation.","post_message":"‘He is doing this to take citizenship'"}]
