[{"comment_id":"10153206999136336","commenter_b":"I love it. She should have her wooden spoon with her","commenter_a":"She is going to be arrested. She beat him that is abuse. Some Social worker will have her arrested.","post_message":"\"So what did this woman do that has everyone buzzing? What could be that extraordinary? It’s called parenting, folks. Good ol’ fashioned, no-nonsense, no-excuses parenting. This is what it looks like.\" – Ruben Navarrette"},{"comment_id":"10153484638827507","commenter_b":"Whining lil Bitch!","commenter_a":"Activist farmers? REALLY?! They got time for that shit?! I have a better idea, STOP suckling from the federal ethanol teat, get back to your damned fields, and grow the crops that feed the people!!!! I hope that you make a fortune, the HONEST way, and keep your damned MORONIC racial political opinions to yourself!","post_message":"This is important."},{"comment_id":"1006897696063097","commenter_b":"Praying for a awesome woman of God and Crouch family.....such seeds she has sown...","commenter_a":"Pamela Houston","post_message":"The TBN family continues to ask for prayers and promises to keep us updated on Jan's condition. #JanCrouch #TBN #stroke"},{"comment_id":"1728765537410558","commenter_b":"She's a Bitch!","commenter_a":"vanstone is an idiot","post_message":"Oh no... I'm praying for Bindi Irwin."},{"comment_id":"10155466728060354","commenter_b":"Lol...I remember when a female Dem said that recently.","commenter_a":"What will he do about all the women driven to prostitution as a result of global warming?","post_message":"We look forward to your witty comments on this one. The possibilities are endless."},{"comment_id":"10155759756435354","commenter_b":"Such a witch. Don't want people saying these things then start arresting and deporting the mexican criminals and all other illegals because they are criminals just by being here.","commenter_a":"How about giving guns to jihadist to fight Syrian Prez. YOU, Clinton, armed ISIS.","post_message":"WATCH Hillary's Race-Baiting Remarks Slamming Donald Trump"},{"comment_id":"10153875721181770","commenter_b":"She is sipping Hillary juice.","commenter_a":"Nancy Pelosi IS a train wreck - so I would expect nothing less!","post_message":"Nancy Pelosi's Sunday morning interview on CNN was an absolute train wreck..."}]
