[{"comment_id":"10153283312806130","commenter_b":"Denis I applaud you for teaching what you do. Big problem in our country is young girls are getting pregnant, guys leaving, single mom/hard to get education, etc ----> leads to broken family structures/children not raised properly---> leading to most problems we are facing in our country","commenter_a":"She didn't have sex, she had intercourse, or made love. Her sex is female. Why must we depersonalize coitus, to like farting or blowing your nose?? Let's put the LOVE back into making love, then our kids might make the connection to a loving act that sometimes leads to pregnancy. It's supposed to belong to people who are committed not a spectator sport or a recreational past time. :)","post_message":"She handled them pretty well though."},{"comment_id":"10154859326468487","commenter_b":"We don't know wtf is out there - we could be in a giant terrarium","commenter_a":"And most American Christians are whiney little bitches. They have some nerve to plagiarize the Jesus myth and then steal all the pagan holidays that revolve around the axial tilt of the earth, and then pretend they're persecuted.","post_message":"Even though some Muslims have been in the United States for longer than many of the Protestant and Catholic descendants of German, Italian, and Irish immigrants, most Americans still believe Islam is odds with American values and way of life."},{"comment_id":"10154074583926159","commenter_b":"However Cruz is a natural born citizen always has been always will","commenter_a":"Absolutely....Cruz is the true conservative and is a constitutional scholar. Trump is all BS and bluster.","post_message":"Would you watch?"},{"comment_id":"10154937079431729","commenter_b":"Those are some ugly women.","commenter_a":"Indeed, Colonel.....I was also having thoughts along the same lines like why aren't women engaged in sports with men like football, baseball, rugby, la crosse, hockey and, on and on.","post_message":"Folks, I need you to weigh in on this as well."},{"comment_id":"10155894445780093","commenter_b":"Certainly grown women can make decisions. . And as soon as you grow up, become mature, recognize there is a world beyond our own noses and that maybe a person could be right, or, disturbing for some, a person could be wrong... then they can make decisions. But the arrogant ought to be circumspect.","commenter_a":"One simple question: for the Christians who believe that life begins at conception; if God wants every potential human \"life\" to be born so much so that you have to create laws that every American woman whether they believe the bronze age fairy story or not, why when god destroyed all life during the Noah flood did he kill pregnant women? Or innocent new borns? Weren't their lives so precious too? Square that circle.","post_message":"The deliberate killing of an innocent human being, with the killing performed in such a way as to preserve a of the most valuable parts. That sounds totally ethical, right?"},{"comment_id":"1128870593839354","commenter_b":"They not are migrants ffs, They are invaders. When will our government's wake the duck up!!!","commenter_a":"These people are deranged.... Catch them and give them an immediate death sentence............Shut all the boarders..... Keep filth out to protect our own...","post_message":"Migrant rape fears spread across Europe"},{"comment_id":"1242326225802834","commenter_b":"There are many exceptions to this, these comics are just to stir shit up, and promote dissatisfaction, imo. Live your life to the fullest and stop getting offended so much. It's not worth it, spending your life on this planet worried about what some shithead says or thinks about you.","commenter_a":"Hey ATTN, did you know there is a mass extinction going on globally? Maybe your perceptions of gender roles can take a back seat and you can do something more useful with your time.","post_message":"The double standard is all too real."}]
