[{"comment_id":"10153830861505695","commenter_b":"It is much safer at sea then it is to remain in port.","commenter_a":"Praying they're found. Since the owners and the captain of the ship knew the path of the hurricane, why was it allowed to leave the port or at the very least why wasn't it rerouted?","post_message":"Loved ones aren't giving up hope, despite a life ring being found."},{"comment_id":"885152951544454","commenter_b":"I am parra phrasing as I am not really comfortable with the terms \"richer and poorer\" x","commenter_a":"How can she handmake 3000 items a day???","post_message":"Meet the richest seller on Etsy"},{"comment_id":"10153635316283812","commenter_b":"\"It's Just Lunch\" was already taken...","commenter_a":"The name is stupid....Couldn't come up with something a little more interesting!??","post_message":"Earlier this year, the Kang sisters, co-founders of the dating app \"Coffee Meets Bagel,\" turned down a $30 million \"Shark Tank\" investment offer. Here's what they have been up to since the show, and where their app is changing online dating: @webpagelink"},{"comment_id":"10153163216675950","commenter_b":"What...like it's hard?! #illegallyblonde","commenter_a":"This nonsense is in the same category as the Nobel Peace Prize nonsense. Victory is awarded by decree. Neoliberals in higher education are waging an aggressive campaign to destroy meritocracy.","post_message":"\"There are few teams we are prouder of having lost a debate to than the phenomenally intelligent and articulate team we faced this weekend,\" students on the Harvard team wrote."},{"comment_id":"10153832600184087","commenter_b":"She is simply unwilling to burn her country to the ground with a Trump presidency. That makes her a phony? Good grief.","commenter_a":"Elizabeth Warren is a phony. I am so disappointed. I wish I had never donated to her campaign. She is trash. They can put her on the ticket as their little bone to throw at progressives, but I am not biting. #stillSanders","post_message":"Elizabeth Warren will meet with Hillary Clinton Friday morning just hours after hinting she would be open to being Clinton's vice president."},{"comment_id":"10154056074359749","commenter_b":"Your a hoe lets be honest","commenter_a":"Hope u keep some pics for your kids to see when they grow","post_message":"\"I am a mother. I am a wife, a sister, a daughter, an entrepreneur and I am allowed to be sexy.\""},{"comment_id":"10153123341393433","commenter_b":"If the GOP and Faux news had been fighting the ACA every step of the way it would have probably met expectations. I have a neighbor that continually puts Obamacare down but when questioned on specifics she doesn't know anything about it.","commenter_a":"Survivor - Republican Nomination Edition! See the candidates squirm at questions about evolution! See them deny climate change! See them lambast Obama and try desperately not to even mildly criticize each other! See them try to criticize Jeb Bush while lusting after his millions! See them scurry and grovel for billionaire dollars! See them coordinate-not-coordinate with their PAC's! Watch as they kiss the ring of Sheldon and the behinds of the Koch's! See them on their knees begging and groveling for your vote! See them slap each other silly in the final rounds! See them bow out, tails between their legs, defiantly trying to sound manly and tough! See them in the green room, crying and sobbing and wailing... Oh wait, that's when they're on stage. See them try and start a war with Iran! See them argue about who gives Bibi the best blowjob! See them trying to be ...","post_message":"Did the health care law kill jobs? Does everyone have access to coverage? Monday marks the fifth anniversary of Obamacare, so here's a look at the predictions that were right and that ones that missed their mark. bit.ly/1HbvOsO"}]
