[{"comment_id":"964259683612268","commenter_b":"get them the hell out of our usa we dont want them here,take that scumbag obama with you.","commenter_a":"Probably headed to the Democrat Registration Office.","post_message":"Oy vey."},{"comment_id":"10155319935565294","commenter_b":"No! Our kids are getting more stupid every passing day! They NEED ALL the education they can get!!! :)","commenter_a":"No","post_message":"Should schools switch to a four-day week? Tell us what you think."},{"comment_id":"547147818822562","commenter_b":"Get rid of every illegal man woman or child then start the legal process maybe this country will fall back together after that","commenter_a":"Buddy, you are so far behind the curve by now, I'm not sure you can hear me shouting backwards. We're past issues of legality. We're past party lines. We're into basic human dignity and the essential morality of how human beings treat each other. Black lists, registration lists, and round ups and mass deportations are all tools of countries where the rule of law has broken down and democratically designed processes have failed - BY DEFINITION. Yes, illegal immigration is a huge issue and yes, there should be systems in place to allow due process of law to happen based on merit and compassion. Targeting entire groups of people and refusing to treat each person as an individual in assessing their rights and needs is the antithesis of our stated democratic ideal. So this mayor speaking out in defiance of the tools of mass oppression is an act of heroism. ...","post_message":"\"This is New York. We are always New York.\""},{"comment_id":"10154221931919199","commenter_b":"Idiot woman.","commenter_a":"At 44, she needs parenting classes! Did you read she's been stopped before for this! Someone call CPS for endangering a child!","post_message":""},{"comment_id":"10153717655651323","commenter_b":"I'm sure mosques will be very useful for Syrian refugees in Germany. Are you for real?","commenter_a":"Focussing on mobile phones while poor syrians are getting genocided by poseidon in the mediterranean? Fucking white neonazi shitlords.","post_message":"You will soon be able to ignore your friends and family in Europe as well as at home for no extra cost."},{"comment_id":"10154411705371336","commenter_b":"@username Did you purposefully neglect the part that this is what happened in every parts of the Earth? They did the same thing with the Aborigines here in Australia, when Arabs invaded Constantinople and established Istanbul...smh","commenter_a":"She is one of the few Christian celebrities. God Bless Her. Amen this nation was founded on Judeo-Christian values.","post_message":"Candace Cameron Bure is grateful to be living in the USA because \"we have the ability to love God here.\""},{"comment_id":"843323745763879","commenter_b":"I do Tim!! I don't care that gays get married & I wouldn't dare force a female to give birth to a baby she doesn't want!!","commenter_a":"i thought you guys hate christians","post_message":"Oh, the irony!"}]
