[{"comment_id":"10153080990943812","commenter_b":"Scumbag","commenter_a":"Why wasn't the mother given custody ? Custody was given to a parent with mental ssues ? This is not the rest of the story yet . Florida fails aagain and again we hear about more changes. Meanwhile NO ONE is held accountable and a child is dead. Oh well.","post_message":"UPDATE: Attorney says she reported to authorities that father was acting erratically before he allegedly threw 5-year-old girl from bridge to her death in Tampa Bay: @webpagelink"},{"comment_id":"10156359711135354","commenter_b":"Take the fuckin niggers too.","commenter_a":"Yeah screw Obama and the Obama does not care health insurance bull crap. He can get the hell out of America and take his illegals, criminals and Muslims with him.","post_message":"“We’re going to be aggressive…”"},{"comment_id":"10155284282375294","commenter_b":"Lets bathe her in lice then fill a bag with mayo and drownd her in it","commenter_a":"@username wow ppl are stupid","post_message":"A tragic ending after a family attempted to use a home remedy to treat an 18-month-old girl with lice."},{"comment_id":"10152863339776491","commenter_b":"Just think all the traffic that's been through her!! Her germs have germs!!","commenter_a":"Can you imagine being the one that has to kiss those lips? Ugh. I mean uuuugggghh!","post_message":"\"Every time I say something that’s extremely truthful out loud, it literally breaks the Internet.\""},{"comment_id":"10153134052206770","commenter_b":"They haven't earned my country or my freedoms. Let them go back and earn them in their own country. We did.","commenter_a":"Scold the 57-58 Arab nations who REFUSE to take ANY. There must be some reason they're so adamant we'd be fools not to follow their led. And stupid to be swyed by a hoard of malcontents. Have yo shown ANY appreciation to those countries who have given you free access A RESOUNDING NO. That Homeland Security is aware of the risks, and still continues is disgraceful.","post_message":"The largest Arab American civil rights organization in the United States is alarmed because 31 state governors have said they will refuse entry to Syrian refugees in their states."},{"comment_id":"10155399536459199","commenter_b":"Oh ok was wondering how close this happened it didn't specify what a sick man hope they catch him fast.","commenter_a":"Where is Lakewood Commons I live up by Lakewood high school?","post_message":"The man was about 6 feet tall and rode off on a green bicycle after exposing himself to the child."},{"comment_id":"624483627700413","commenter_b":"Someone gets it.","commenter_a":"Awesome, telling them to get a job is not on the list.","post_message":"Think what you're doing helps the homeless? Maybe it's time to think again. ~Amy"}]
