[{"comment_id":"10154473701808812","commenter_b":"Good for her! This is the American Dream at its finest. All you haters who think this country belongs to you and all immigrants are criminals and steal your jobs can suck it! I was born here and will die for my country if necessary and this is what I will fight for. The right for EVERYONE to pursue life, liberty, and happiness. God bless you little girl!","commenter_a":"This is amazing.","post_message":"Texas high school valedictorian reveals secret in graduation speech: \"I am one of the 11 million undocumented immigrants living in the shadows of the United States.\" @webpagelink"},{"comment_id":"10153120259284411","commenter_b":"Ran like the bitches they are !!","commenter_a":"Marines don't flee. They were ordered home... there's a difference...","post_message":"Fleeing US marines handed over weapons to random Sanaa airport employees Yemen official"},{"comment_id":"911888578926545","commenter_b":"@username SO WHAT ITS LEADING TO THAT WE NEED TO TAKE OUR COUNTRY BACK AND PUT THEM IN PLACE THEY CAN T GET OUT OF OR PUT THEM IN MEXICO","commenter_a":"Civil Disobedience is totally fine and I salute those who stand by their beliefs. Perpetrating violence, burning, looting, damaging property etc. is not and those folks should be arrested and prosecuted.","post_message":"***The Radical Hard Left is plotting a Soros-funded plot to spark upheaval across America***"},{"comment_id":"10153715951406002","commenter_b":"There are not enough words to describe the opinion I have of this woman and the her unspeakable actions.","commenter_a":"In my eyes what she did is not much different than an abortion.","post_message":"A 24-year-old Eastpointe woman who already has three children is charged in connection to the death and abandonment of a newborn who was found at a Roseville recycling center."},{"comment_id":"893147240733824","commenter_b":"If the women go topless I'll go lol","commenter_a":"Aida Nunez really. Kids should not see this. Go home and do that at your own home. At least! Or in your backyard lol","post_message":"Go Topless Arizona organized a protest in Central Phoenix today. The group organized a protest march this morning down Indian School protesting what they view as discrimination against women. The law allows men to go topless,they say, while women cannot. We \"cover\" the story tonight at 9 & 10."},{"comment_id":"495211413960969","commenter_b":"What a f****n punk","commenter_a":"He is a psychopath I assume.","post_message":"As for killing Trayvon, he said, \"I believe God has his plans\" F*ck this guy. -Linda"},{"comment_id":"10154624761426336","commenter_b":"What a dumb woman...","commenter_a":"Its her policy that allows these people in our country to kill us.","post_message":"Hillary Clinton addressed the latest bombings in New York City and New Jersey and emphasized that Donald J. Trump's comments are being used to recruit terrorists. @webpagelink"}]
