[{"comment_id":"10153989537064203","commenter_b":"Lots of women in Iran do not wear head scarfs","commenter_a":"I wouldn't want to land there. They'd want me to wear a headscarf to walk off the plane. Nope","post_message":"If they had not become international pariahs, could Tehran have been to airline routes what Dubai now is?"},{"comment_id":"1097574603596883","commenter_b":"Lol those mother fucks love my ankles","commenter_a":"Ruben Yunv Castillo","post_message":"Why do they torment me and leave everyone else alone?!"},{"comment_id":"10154916215254330","commenter_b":"She should be arrested and lose her job.","commenter_a":"I am not saying this is right but I have seen countless similar things of people doing this type of thing to images of Obama so everyone should just chill with the outrage , where was the outrage when it was Obama images being hung !!","post_message":"The video shows a woman pointing what appears to be a toy gun at a video of President Donald Trump and pretending to shoot at him several times, saying \"Die!\" ---> @webpagelink"},{"comment_id":"1758718481082543","commenter_b":"Illegal aliens should not be allowed to have drivers licenses. They should not be allowed to vote, should not get Social Security which they did not work for, should not get food stamps, welfare or any other type of financial assistance. If one of us went to their country, would be get financial assistance? No way! So why should they expect it here in the US, when we have seniors, veterans, children, homeless in need!","commenter_a":"More than WRONG !!!!!","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"},{"comment_id":"952967998077006","commenter_b":"Ahhhh...NOOOOOOO! AMERICA WILL NEVER!","commenter_a":"I'm paying less thanks obamacare!","post_message":"Republicans won't ever admit the success of Obamacare. As with all of the Presidents winning policies, they prefer to ignore facts and spread lies."},{"comment_id":"10154880669523614","commenter_b":"Let them go there and put up another wall.","commenter_a":"Now there's an idea, send them all there not here. Works for me.","post_message":"Canadian Prime Minister Justin Trudeau's immigration minister has declared an open door policy for immigrants and refugees."},{"comment_id":"630177530448762","commenter_b":"It is not surprising, if it was a terrorist attack the pilot would have tried to crash the plane into a very densely populated area i.e not the French Alps.","commenter_a":"I'm relieved (and surprised) that the pilot's last words weren't Allah Akbar.","post_message":"Aha! That's a BIG part of it I'm sure."}]
