[{"comment_id":"10153342666393132","commenter_b":"She still is basic!","commenter_a":"He just swerrrved on her! Ayeeee! She needs to remember her roots and remember she was once 'basic'.","post_message":"\"Madonna, you have achieved unbelievable success and while we appreciate your talent and achievement, we expect you to appreciate ours.\""},{"comment_id":"10154379818081509","commenter_b":"Go away Judy womble","commenter_a":"Shut up Donald...go away","post_message":"\"I think she's right -- I am angry.\" In an interview on Erin Burnett OutFront, Donald J. Trump responded to Nikki Haley's remarks about him after #SOTU. @webpagelink #TrumpOnCNN #SOTUresponse"},{"comment_id":"10153042394211800","commenter_b":"Actually, the comedy part means the extreme feminists are being mocked...","commenter_a":"Gotta say I was very disappointed in this whole segment. Not because it was offensive or anything, but because it seemed to take what is clearly an issue (people taking up too much space on the subway) that can be caused by *both genders* (not just men) and acted like men were silly for thinking the ads were sexist by only targeting men. How much outrage would there be if there were a series of ads specifically targeting women for doing something that both men and women could do? Food for thought.","post_message":"\"Occupying all the territory you can is sexy. When I'm on a subway car with all those men taking charge of the seats around them, I get so weak in the knees that I can barely stand. But I have to.\" -- Kristen Schaal ► Kristen Schaal defends the right for men to spread their legs and take up two seats on the subway: @webpagelink"},{"comment_id":"10154008919327439","commenter_b":"I cant stand these lying disgusting woman abusing savage animals MUSLIM MEN","commenter_a":"Didn't take long for \"moderate\", \"peaceful\" muslims to take on a new tactic. One that the liberal media will blame on Christians. These followers of allah/satan are true examples of evil!","post_message":"ISIS has issued a handbook for Muslims in the West. The gist of the instruction booklet is the necessity to blend in with the western way of life and to avoid ‘looking like a Muslim’ - pretend to be Christian -- so as to stay below the radar of the security services. This is important. It is key to understanding the enemy and their tactics. The media and the Democrats are deliberately misleading the public. You must educate yourself and those around you. Share this article on Facebook, Twitter, email. Build our army."},{"comment_id":"1671482303102466","commenter_b":"I bet he dreams about it!","commenter_a":"Trump is a vulgar idiot yet Rubio is a hero? Seriously people, Trump didn't walk out on stage and say hey I got a big package. Rubio has insulted him for a week about this and Trump ended the insults. Rubio is the one that's vulgar and obsessed with Trumps Package.","post_message":"\"Did he just say that?!\""},{"comment_id":"1727453857514316","commenter_b":"@username,just like your husbands grandparents came in the 30s,my grandparents also came here but in1907 and came threw Eli's Island LEGALLY which was harder to do in 1907 ..so there is no excuse for some coming here illegally today,none what so ever!!","commenter_a":"Trump wants illegals gone and so do I. My dad came to this country legally and at age 65 is still going strong. My brothers are so fortunate and blessed that my parents have given us this opportunity to make something out of ourselves. Seeing illegals demand stuff and act like they deserve things we Americans worked hard for burns me up inside. Illegals have no rights to anything and should be deported and forced to go through legal channels to attain citizenship like other immigrants. We need a wall or a stronger more secure border and absolutely no amnesty for these criminals","post_message":"\"Donald Trump is not a racist.\" Today, in front of Trump Tower, Donald J. Trump supporter Pastor Mark Burns fought back after an illegal immigrant activist tried to shout him down."},{"comment_id":"10153113901480329","commenter_b":"Maybe she cover her face too in case it incites men to rape her. #goodgrief","commenter_a":"Bahaha! Don't flatter yourself lady. You're no Kate Upton!","post_message":"A Christian blogger has caused a stir online after publishing a blog post about her decision to stop wearing yoga pants because they cause men to think “lustful thoughts”."}]
