[{"comment_id":"472128496314627","commenter_b":"Yeah lol she cray","commenter_a":"She was talking all kinds of mess about Prince. Maybe someone scooped her up for interrogation.","post_message":"Irish singer Sinead O'Connor was reported missing Monday a day after she went on a bike ride in the posh Chicago suburb of Wilmette and did not return."},{"comment_id":"663875460469699","commenter_b":"American news you suck! This story in all of their stories are not real! I cannot believe how many people fall for this b*******! Laughing my f****** ass off! Get a life people go spend some time with your families and try to figure out what you can do to help the country! Unbelievable! American news you suck!","commenter_a":"If they don't like our traditions don't come here...That was easy...","post_message":"The Obama administration is trying to ruin your thanksgiving. This is absurd. We can't let him get away with this. Will you still call it Thanksgiving no matter what?"},{"comment_id":"10152881225108445","commenter_b":"eat a dick","commenter_a":"Take this shit down. 666 ain't got shit to do with weed.. God blessed us with weed","post_message":"Kosher Cannabis Edibles Coming to New York"},{"comment_id":"10156695454475206","commenter_b":"Yes lol, but I'm also a full time college student and have been waitressing for three years.","commenter_a":"Carly, I wasn't sure who had my vote until tonight's debate, that being said #fiorina2016","post_message":"Hillary wants to be the first woman president—but every single one of her policies have been bad for women and bad for America. If you want a leader who will fight for all Americans, chip in $3 to get Carly in the White House. @webpagelink"},{"comment_id":"720244888107018","commenter_b":"they ran out on their bill and stiffed the waitress , who had to pay it from her own pocket ... THAT'S why they want to raise min . wage to 15, so waitresses at diners can afford to pay the tabs of these deadbeats","commenter_a":"LMBO","post_message":"Who paid the bill?"},{"comment_id":"10153079679845950","commenter_b":"What a dumb ignorant bitch","commenter_a":"When it's not your turn, it's NOT your turn! That is how press conferences work people!!! TRUMP 2016 :)","post_message":"JUST NOW: Donald J. Trump tells reporter Jorge Ramos to sit down, has him escorted from press conference: \"Go back to Univision!\" \"You can not deport 11 million people,\" he yells: @webpagelink"},{"comment_id":"1033670103395908","commenter_b":"If I looked like Debbie, I would be a liberal to. Democrats know they got messed up looking chicks.","commenter_a":"Can we have at least 10 debates?","post_message":"Chair of the DNC Debbie Wasserman Schultz is taking your questions about the Democratic debate. What would you like to ask? Leave your questions in the comments, and we'll post Rep. Wasserman Shultz's answers in a follow-up tomorrow!"}]
