[{"comment_id":"10152578291366636","commenter_b":"But I'm not joking. Why would a western woman live there ?","commenter_a":"A list of things that doesn't offend these clowns needs to be published. How can any intelligent women move to this place?","post_message":"Pakistan is not happy with Imran Khan's new wife..."},{"comment_id":"10154030120894877","commenter_b":"waaaaaa look at us! we are terrible parents! we make bad decisions and get back men killed with our ignorance! yayyyyy! black men, you are lucky to escape the wombs of these criminal producing welfare brood mares!","commenter_a":"Very nice to see Americans giving these women love and support. Their bravery and commitment to honor their sons is wonderful to see.","post_message":"‘Mothers of the Movement’ deliver staggering testimony of loss, hope at DNC Grio fam, what did you think of their appearance? Watch the full clip and share your thoughts below."},{"comment_id":"10153516000908984","commenter_b":"If they want want to stay in America, they should have to obey our laws","commenter_a":"Give them all a one way ticket to Iraq. Let them embrace their Shariah Law and the ISIS.","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing... Is Sharia law in America a major concern of yours?"},{"comment_id":"10154108457106782","commenter_b":"She probably screwing him","commenter_a":"Of course she supports him. She's nearly as stupid as he is.","post_message":"Kellyanne Conway, the high-profile White House counselor, has come under fire from Democratic and Republican lawmakers, fact checkers and the media. But she's so far maintained the support of her boss, President Donald Trump. @webpagelink"},{"comment_id":"10154937079431729","commenter_b":"Those are some ugly women.","commenter_a":"Indeed, Colonel.....I was also having thoughts along the same lines like why aren't women engaged in sports with men like football, baseball, rugby, la crosse, hockey and, on and on.","post_message":"Folks, I need you to weigh in on this as well."},{"comment_id":"10154167582371770","commenter_b":"LMAO they are their own worst enemy","commenter_a":"Sweet, we probably bought it as taxpayers.","post_message":"Liberals protest Trump by ... setting a Muslim immigrant's limo on fire."},{"comment_id":"10152592127946717","commenter_b":"I wonder why she hasn't refused service to other heathens? You know, non-Christians, like Muslims or women who cut their hair...wait...that bitch cuts her hair! Where's my stone!","commenter_a":"So let's get this right. She's in the business of making money but she didn't want to accept money and now she's willing to spend money in order to avoid making money. She is logically 'out of business'.","post_message":""}]
