[{"comment_id":"834137006720940","commenter_b":"It's called dual citizenship, I suggest you look it up.","commenter_a":"I guess the fact that Malik Obama is a Kenyan citizen, currently living in KENYA and cant vote in an American election doesn't mean anything...ughhh once again those pesky things called facts always getting in the way of a good story","post_message":"Wow, President Obama's brother, Malik, just announced that he is voting for me. Was probably treated badly by president-like everybody else!"},{"comment_id":"10153512388783812","commenter_b":"She is not dark skinned!!! I sorry she is screwed up!","commenter_a":"Love her tan. What's her secret? Lol","post_message":"A timeline of Rachel Dolezal's transition from a young white girl with blond hair to a darker-skinned leader in the country’s oldest civil rights organization: @webpagelink"},{"comment_id":"891182254405684","commenter_b":"He has already done a better job than Obama ishani August ,why don't you move to Cuba or the middle east,there you would find out what \"raping \" in a country is all about.do you feel safe with open borders?","commenter_a":"I am just so proud of President Trump, he is keeping his promesses, he is a man of his word. Wait until he gets sworn in, things will start moving for great changes.","post_message":"Do you support our president, Donald Trump? Comment YES or NO."},{"comment_id":"1353337611353126","commenter_b":"What needs to happen if Trump wants to make America great again is give it back to the original owners. I think it's funny when Trump supporters say their not racist and some aren't, yet you must know that so many are. That's why there's a popular Trump chant \"Make America white again\" which is ignorant because it never was!!! You killed off the main population of natives then brought the Africans here to work your farms without as much as a thank you. If true justice and freedom or anything great were to happen in that case we would pack all you European folk up and send ya shipping. You bitch about minorities yet your ancestors brought our ancestors here, to a land stolen from anothers ancestors. You are the problem and the contradiction, you should leave. But really all we want is to live peacefully with everyone now ...","commenter_a":"Went from racist, Muslim, and a wife who was one of the uncouth \"first lady\" ever.","post_message":"America DOES NOT stand with Trump. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1831610420459597","commenter_b":"This woman is a lunatic.","commenter_a":"Just when I thought no-one could possibly be worse than Trump..","post_message":"Forget that Donald J. Trump is accused of sexual assault...and that President Bill Clinton is not on the ballot."},{"comment_id":"10153572018825695","commenter_b":"Yeah, it's like a 10 hour trip from here.","commenter_a":"@username we need to plan a trip there and check this out. Me you and Jason Snyder","post_message":"TRENDING: One lucky woman discovered the fifth largest diamond ever found at an Arkansas state park. @webpagelink"},{"comment_id":"1157169374320401","commenter_b":"I swear not EVERYTHING is racist just because you are offended by it. He isn't anti-immigrant..he is against ILLEGAL immigration and un-vetted refugees. Get the facts straight already","commenter_a":"Go to your safe space and shut up","post_message":"The phrase “is associated with the political campaign of a candidate widely known to voice anti-immigrant and bigoted views.”"}]
