[{"comment_id":"10152867504581336","commenter_b":"What a ugly woman she is","commenter_a":"This is what Islam is all about........ @webpagelink","post_message":"Ayaan Hirsi Ali has something in common with the #CharlieHebdo editor murdered by terrorists in Paris: She is also on al Qaeda’s death list. She spoke to Megyn Kelly tonight on 'The Kelly File.'"},{"comment_id":"1475217105828968","commenter_b":"You do not know what you are talking about! If woman cannot afford birth control then there will be a definate increase in unwanted pregnancy and ultimately more abortions than ever. Its a simple enough eqausion, NO PLANNED PARENTHOOD=NO AFFORDABLE BIRTH CONTROL=MORE ABORTIONS!","commenter_a":"Will never agree stay quite,agree or be agreeable to finance or support an organization that capitalizes on the murder of innocent children. And an organization that preys on the vulnerability of women in a bad situation, that is not women's rights but profit of murderers. It needs to be called what it is. Their profits and funding comes via. death and guilt not education.","post_message":""},{"comment_id":"736610399801339","commenter_b":"Then vote for Jeb the choice of illegal aliens","commenter_a":"We need Trump to win and not another Bush.","post_message":"I'm running with heart and running to win. It¹s time to unite to defeat Hillary Clinton. Watch:"},{"comment_id":"1099416270154624","commenter_b":"Raged old skank","commenter_a":"Does she really? Or is she lying again...?? Hmm. Lol","post_message":"\"I think that’s fabulous!\" - Hillary Clinton"},{"comment_id":"10156866881005231","commenter_b":"Porsha Williams (Dish Nation)should be next.loud mouth and Crazy.Don't take the Club to you Job. Stop Emphacizeing and Profileing your rear end Porsha.Professsionalism evidently is not in your vocabulary. You are not the only woman with a big butt.Its most likely paid for anyway.","commenter_a":"All that smacking her mouth waveing her hand poping her fingers and all that darn yelling in the mic.Enough!Don't take the Club to your JOB.","post_message":"Did the leader of the 'Tamartian army' get the boot?"},{"comment_id":"935661276474731","commenter_b":"Entitled because men who sit that way feel entitled to the space they take up. If they take up 3 spaces those are two people who are standing that could have been seated. Not only are they denying people access to a seat, these men are making whoever is sitting next to them very uncomfortable. These men have no idea they are doing this, therefore their taking up of incredibly more space than others is more important than others feelings, never mind they feel they are more entitled to take up 3 spaces than 2 more people are entitled to a seat. Did you see the picture from Seattle? Two men were encroaching on this poor girls space! Yes there are other issues in the world but do you see that feminists ALSO pay attention to them as well? We are capable of multiple thoughts you know. And keep in ...","commenter_a":"..... why is this seriously an \"entitlement\" issues? Do you not see how pathetic it is to be upset because of \"spreading \"? For fuck sake, you're criticizing posture, might add well discuss \"man shaving\" why can't a woman shave get fave without feeling ostracized? Or \"man shoing\" why can't shoes be unisex, why are they discriminating against what gender you have to be to wear a pair of shoes? Or my personal favorite \"man shirting\", why are men's buttons put on one side and women's buttons on they other side. Dear god, these misogynistic assholes have gone to far with their shirts... give me a fucking break. This is, by far, the most unflattering and pathetic issue discussed in the feminist movement. Take on real issues and matters that actually affect these everyday women, the glass ceiling, wage differences, rape offenses. Giving time and thought into little things like ...","post_message":"They both spread their legs on the subway, but only one raised eyebrows. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"1334294883276632","commenter_b":"What a joke Hillary Clinton is! She's allowed to continue running while there is a fbi criminal investigation?! I wouldn't even be able to apply for a job at McDonald's if I were under a FBI criminal investigation! Nail that bitch!","commenter_a":"the traitorous bitch looks and sounds just like Nixon.","post_message":"BREAKING: Hillary Clinton holds press conference about FBI reopening email probe. VIDEO OF HER STATEMENT: @webpagelink"}]
