[{"comment_id":"10153437934696943","commenter_b":"Hillary did. She locked herself up in closet to take him down. That was when she lost her bar license for being both unethical and lying.","commenter_a":"Frankly, the Obama presidency, with all its scandals/crimes, has set incredible legal precedence for defendants to get away with almost anything, from lying, to destroying evidence, to treason, to tax evasion, you name it. Now, anyone accused of anything can simply demand equal protection and have their attorneys cite any one or all of the Obama Defenses.","post_message":"*** UPDATE *** This was a very big week for us, with tremendous results! As has been widely reported, we found almost a five-month gap in the emails Madam Hillary reluctantly returned to the State Department last year. But there more to the story..."},{"comment_id":"10153505584229705","commenter_b":"Martin Besson","commenter_a":"Fatima Tanner Daniel Robson these hotels!!","post_message":"So bizarre!"},{"comment_id":"368033556718272","commenter_b":"Sarah Got A Back Bone She Don't Back Down To That Evil Snake","commenter_a":"does she even know where Paris is?","post_message":"Good God, Mr. President, we were once known as the leader of the free world, standing for what is right! You must not let America’s sacrifices be in vain. When will you learn that actions speak louder than your words?”"},{"comment_id":"10154308698454607","commenter_b":"Do these liberal protesters have jobs!!!!!!","commenter_a":"The US is being ridiculed by idiotic liberals who are obviously clueless on what President Trump is doing, protecting Americans!!! I live less than 20 miles away from that radical Islamic terrorist attack in San Bernardino, where 14 innocent people were murdered!! It's not Trump's fault that our government is so corrupted and does not have an immigration accountability system to know who exactly is entering our country! There are Isis training camps all over the United States! If you don't believe me Google it!!! There is an Islamic training camp less than 10 miles away. They are spreading like a disease everywhere! Last year local law enforcement caught 16 radical Islamic Muslims training near the a river bed all of them had AK-47's!!! All of them are now being investigated by FBI! 5 of which are on the top 10 most wanted list!!! Do you want to know why ...","post_message":""},{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation. It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation. Read the whole story at Reverb Press HERE: @webpagelink"},{"comment_id":"10153725968361717","commenter_b":"Stupid women....","commenter_a":"IF THEY ARE REFUSING TO DO THEIR JOB ( I do NOT care how fucking religious you are) IF YOU ARE NOT DOING YOUR DAMN JOB YOU WERE ELECTED, HIRED, OR NOMINATED FOR YOU WILL BE FORCIBLY REMOVED FROM OFFICE! GOT IT ASSHOLES? Or didn't your religion TEACH you that ASSHOLE!","post_message":"Like Kim Davis, the Wyoming judge has cited religious beliefs in her refusal to marry same-sex couples."},{"comment_id":"1309394412429310","commenter_b":"Cameron, it is obvious that you are not a Student of Roman Empire History. One of the last accepted practices, prior to the down fall was homosexuality and everything associated with it. The Citizens of Rome lost direction, they became more interested in Entertainment and the Entertainers that the health of the Nation. Want to know more, it is available","commenter_a":"Roman civilization didn't have God they worshiped abunch of gods and mainly themselves and there the longest most prosperous civilization in history","post_message":""}]
