[{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"},{"comment_id":"10153967226386756","commenter_b":"Don't they have strict gun control laws? The criminals don't follow these laws? Shocking!","commenter_a":"Here are the huge protests over this? Why is the black community not absolutely outraged by this?","post_message":"These stones are a handful of those youths killed in Chicago. Diane Latiker of Kids Off The Block, Inc. (KOB) is trying to keep more names of children off the wall."},{"comment_id":"942297612493435","commenter_b":"Yep....her attitude says it all!","commenter_a":"\"What difference does it make?\"","post_message":"\"I will not quit on you. I will fight for you. I will be there for you every single day.\"—Hillary in Iowa City, Iowa yesterday via Hillary for Iowa"},{"comment_id":"1781827275423105","commenter_b":"Go Hillary! You're a rock star!","commenter_a":"Boom!! Mic drop!!","post_message":"EXACTLY! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10158475114940354","commenter_b":"Is Melania Trump retarded?","commenter_a":"Uninstalling Obama in... 99.9 % Complete!!","post_message":"Say what?!"},{"comment_id":"10153633420073132","commenter_b":"Keep up with the misogyny","commenter_a":"These are the lowest life, vilest example of human being that exist today. And that's the best that I can say about them.","post_message":"\"We aren't sisters, we never were. We just dated the same guy at the same damn time.\" - Kendra Wilkinson on Holly Madison"},{"comment_id":"10153234141898984","commenter_b":"Should fire her sorry ass!!","commenter_a":"Another feftist idiot...","post_message":"Oops! Janet Napolitano just fell victim to a hot mic. She's probably looking for places to hide right about now..."}]
