[{"comment_id":"154804301701173","commenter_b":"Here we go again with the silly questions by the press , get the popcorn out","commenter_a":"We don't like racists","post_message":"LIVE: White House Press Secretary Sean Spicer's daily briefing. Topics include the economy, domestic policy agenda, transgender bathroom policy, state's rights and the Supreme Court."},{"comment_id":"1205428982807783","commenter_b":"Actually our laws are being ignored, all illegals by law are to be deported and anyone who employs them face prison time if the current laws were enforced","commenter_a":"DONALD TRUMP It is a shame that a billionaire ...regardless of politics or party ...can walk in, fund himself and blackmail the political process.... Is this the future of our country only self-funded billionaires can run for president from now on? If that is the case then this is no longer a republic and we are no longer operating through a democratic process TRUMP'S IGNORANCE on the world stage will begin to be seen now. JUST WHAT DOES THIS MAN KNOW? He knows how to conduct business and DIRTY business deals He knows how to declare bankruptcy He knows how to be a GOOD ANCHOR HUSBAND who takes young women the age of his daughter who are NOT CITIZENS and provide them with $$$$$ and a pathway to citizenship... THAT IS WHAT HE KNOWS TRUMP continues to show the world what a racist pig he is SANTORM and CRUZ and ...","post_message":""},{"comment_id":"1197700750270781","commenter_b":"Get over it. The water is theirs. Respect it.","commenter_a":"@username I just adore you!!!","post_message":"These sharks aren't actually all that scary when you get your facts straight. Something else is, though."},{"comment_id":"560952214097169","commenter_b":"These mf's white mf's think it's funny","commenter_a":"Whats the story? Video is not working... Someone pm me!!!!","post_message":"#BREAKING: There are reports that a #Chicago school bus driver has been shot in the head in the West Garfield Park neighborhood... @webpagelink"},{"comment_id":"10153067387865329","commenter_b":"Stupid bitch","commenter_a":"Anytime a guy says \"my dick is too big for a condom\" just tell them \"well, my uterus is too small for a baby.\"","post_message":"\"To all the guys saying \"my d*** is too big for condoms,\" TAKE A SEAT.\" // BuzzFeed News"},{"comment_id":"1052630838137004","commenter_b":"This bitch know all the new snacks before they hit the streets bitch be snoring and dont even sleep","commenter_a":"@username thug life overload","post_message":"Oh No: Big Girl Back At It Again & This Time She Has Lil Terrio Rapping!"},{"comment_id":"1739731709624496","commenter_b":"Dumb racist bitch","commenter_a":"I think she's stupid - like literally too lacking in intelligence to do more than jump onto an under informed, opportunist bandwagon.","post_message":"Don't let the door hit you..."}]
