[{"comment_id":"1043726442390274","commenter_b":"We have our own problems here, send em to other Arab countries","commenter_a":"Not only a great actor, but an absolute class act.","post_message":"\"The show was fantastic, but you left in tears after [Benedict Cumberbatch's] speech. It was very eloquent, emotional, and beautifully put … He gave a 4-letter word to the politicians and said, ‘We’ve got to do something about it.’” - Rachel Martin, audience member"},{"comment_id":"1661010187498580","commenter_b":"Don't forget Texas borders!","commenter_a":"Focus now on what is at hand Mr. Trump. Put an end to ISIS, erect that wall, and focus on Florida and Canadian borders, lastly boost our economy. You have mentioned these 3 things before which garnered my attention, then my vote. Just give more ways of getting this done. Oh, hate to throw this in but there may be a few executive orders that need immediate attention! TRUMP 2016!","post_message":"Remember, I am self-funding my campaign, the only one in either party. I'm not controlled by lobbyists or special interests-only the U.S.A.!"},{"comment_id":"940585612654173","commenter_b":"Aleeyah your FB page is wacked out!! Girl I feel sorry for your kid. Get yourself some help. God don't like ugly!!","commenter_a":"Whitefolks did the same thing to Black Slaves, yes it is demonic and insanity. Look whom and what rule we have been unjustly livong under. The girl is showing the affect of what she was taught and learned from her step forefathers the Slavemasters children.","post_message":"Mother accused of intentionally setting her newborn baby on fire enters a not guilty plea, will undergo a mental health evaluation: @webpagelink"},{"comment_id":"10153124003659312","commenter_b":"Did you forget there also was Barry Bonds and others? And yes, there was McGuire! This is old and it happened over 10 yrs ago! Move On!","commenter_a":"Handcuff needs to be in handcuffs for picking the Patriots cheaters! Lol","post_message":"This morning, Handcuff, one of several dogs rescued recently by local law enforcement, made his St. Louis television debut with Rene Knott, to make his pick of a winner in today's Super Bowl. See who he picked and then call Stray Rescue to inquire about adopting him. (314) 771-6121 @webpagelink"},{"comment_id":"10154491672598843","commenter_b":"Nice but ignorant..just because it looks nice doesn't mean it is. Well if we're going to have a March about saving babies, we must teach to save wome and men. Teach women knowlage of self worth not through sex to have standars. Teach men to stick around and train this child up. Their are far to many women who trust in the wrong Ideas about relationships and sex. A comunity of ignorance instead of in the scools teaching to waite and young girls to choose a good partner who is consistent. Also have father's taking responsibility instead of running off and leaving women to fend for themselves. Child support isn't always enforced, if she has no family, if she is in poverty look at where plan pearenthood is located in the getto where the poor is and if you think the CPS system isn't filled up over populated, better look ...","commenter_a":"However, they left behind lots of litter for someone else to clean up. How thoughtful.","post_message":""},{"comment_id":"10153143993045329","commenter_b":"That poor girl would eat both of you.","commenter_a":"@username @username Gerard Bravo 'Plus size' is where it's at.","post_message":""},{"comment_id":"992371087511918","commenter_b":"So she is only part Native American because you think they must have been raped? Um.. I am part Native American because my great grandmother was savagely raped by a Native American, so please tell me how innocent and peaceful they were. And yes illegals now are a different story. Whether you like it or not, when Europeans came here it was a hostile takeover. There was a war. Which the Native Americans lost. So if illegals want to wage war, than they can bring it on. If not, they can go the he'll home to whatever country they came from. I honestly don't care which country it is.","commenter_a":"If Native Americans had @username \"Illegal European scumbags have yet again raided local villages, they crashed their boats into our shores, raped our women and children and then killed them for not turning into Christianity..\" #Talk about several overdue sentences","post_message":"Margarito Quintero didn’t have a license and was in the United States illegally. He was previously arrested and deported in 2008."}]
