[{"comment_id":"907187719304084","commenter_b":"Nope. She shouldn't.","commenter_a":"She shouldn't have to apologize. *kanye shrug* Jay","post_message":"Lindsay Lohan Apologizes For Using The N-Word On Social Media While Referencing New Kanye Song"},{"comment_id":"1339410646123872","commenter_b":"Now I'm calling her a turkey! At least she could've let us see the eggs before she got comfortable again","commenter_a":"Somebody say bugs","post_message":"EAGLET WATCH! Getting closer, it could be any time now! We are watching and waiting as mom (Harriet) and dad (M15) take turns incubating the two eggs. Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"10152948972001051","commenter_b":"You wouldn't see tomorrow if you shot my dog you pussy. I'll put a new asshole in your forehead","commenter_a":"NO DOG should be loose in public, PERIOD. Your loose dog will be neutralized if it approaches me. NO APOLOGY.","post_message":"Some people say the officer handled this situation correctly. Others say it was an overreaction. Decide for yourselves who is right."},{"comment_id":"10154012959875329","commenter_b":"I was going to tag my bff, and a couple of them made cringe a bit because u do then, but Jesus, that's a real bitch. I must be just a mini bitch.","commenter_a":"Wow I thought I was a judgmental bitch until I read this. Good to know I'm not that bad!","post_message":"You judge everything."},{"comment_id":"1761144924140317","commenter_b":"If Mexico wont pay for wall, lets put our own electric fence 2 miles from the border then put our violent offender prisoners behind it ! In tents. With no back wall.","commenter_a":"Please vote for trump!!!!!!!!!!!!!","post_message":"Truth."},{"comment_id":"585837851590068","commenter_b":"Unlike Hillary taking the china!","commenter_a":"No matter your political views, Mrs. Reagan always showed great class and dignity to the Whitehouse. The love for her husband was extraordinary. May you rest in peace.","post_message":"Nancy Reagan died this morning of congestive heart failure at the age of 94. She will be buried at the Ronald Reagan Presidential Library in Simi Valley, California, next to her husband. @webpagelink"},{"comment_id":"10154745395538984","commenter_b":"@username wow that's hot","commenter_a":"megan , why don't you lick hillary's ass , and ask trump about how he worships the devil in secret , like you believe , your a hack for clinton , move to cnn","post_message":"You don't see this every day. Trump's campaign manager went on \"The Kelly File\" to discuss Trump's debate tactics. Even though Megyn was on the attack, Kellyanne Conway came up with the PERFECT campaign strategy that Hillary definitely won't want to deal with. Do you think this could work?"}]
