[{"comment_id":"10153208287689087","commenter_b":"@username ... Trump was the topic being discussed. TRUMP didn't start wars.","commenter_a":"Rand Paul.. u r not only a sore loser, u r also a isolationist. We di not want America to be a isolationist nation. We like Trump and his \"make America Great Again\" message. We are REAL Republicans wanting real RESULTS, not words.","post_message":"“The message hasn’t penetrated yet that Donald Trump isn’t one of us. He’s barely a Republican. He’s been a Democrat,\" Rand Paul said. “I think ultimately when voters fully grasp who he is and what he supports, I think they’ll run away with their hair on fire.\""},{"comment_id":"10153122678405950","commenter_b":"Get another job lady!","commenter_a":"Where was her God when she divorced and remarried three times over? Can't hide behind religious beliefs when you can't follow them yourself.","post_message":"Before returning to work today, Ky. clerk Kim Davis said she is being \"forced to disobey her God,\" and that she still won't authorize marriage licenses for same-sex couples."},{"comment_id":"1364548750229953","commenter_b":"Anything above .22 caliber is illegal expect where permitted by law, and by law I mean hunting clubs that bend the rules. Open carrying is restricted to law officials only. But yeah that sure stopped the cartels from getting their hands on em","commenter_a":"What about bad/psychotic people with gun permits and guns purchased legally? The system is a joke... How can you really determine good/bad ppl...","post_message":"The Dallas police chief says he is concerned about open carry laws. \"We don't know who the good guy is versus who the bad guy is if everybody starts shooting,\" he said."},{"comment_id":"1728765537410558","commenter_b":"She's a Bitch!","commenter_a":"vanstone is an idiot","post_message":"Oh no... I'm praying for Bindi Irwin."},{"comment_id":"10153091643525496","commenter_b":"This woman is unreal and needs to get a life!!!","commenter_a":"Bet he won't be excited to see her any more! What kind of aunt does that! She should be ashamed!!","post_message":"The woman says her nephew, whose mother died last year, was so excited to see her arriving at his birthday party that he caused her to break her wrist: @webpagelink"},{"comment_id":"10154306922931943","commenter_b":"Can I demand answers to what laws ye dupes say she broke?","commenter_a":"Criminal","post_message":"Hillary Clinton must be held responsible for using \"private\" email accounts and a hidden email server as Secretary of State to conduct government business in violation of the law! Judicial Watch is the one organization with a proven 20-year track record of investigating, exposing, and prosecuting Hillary Rodham Clinton and company. Please SHARE!"},{"comment_id":"1054613801267881","commenter_b":"If they don't want to abide by our laws then go back to where you came from.","commenter_a":"I am sorry, but if you live in America, our laws trumps your religion.","post_message":"Muslim who refuses to remove head covering for officers gets rude awakening. Regardless of religious law, this is a safety concern. Do you think she got what she had coming?"}]
