[{"comment_id":"10154558927621323","commenter_b":"Sex is a biological need. If I'm in a relationship, I am entitled to sex. If she won't provide, I can find someone who will. Using sex as a weapon against men is ABUSE.","commenter_a":"Problem is there are too many uptight women out there. Articles like this don't help either. 'Intimacy'. Words like that make sex sound like some mythical state of enlightenment that we are trying to achieve. When the fact is its just some good old hard core fucking. Get all the mind fuck thoughts out your head and get sucking or licking and you'll soon get into it. We've had hard core porn for years now showing us how to get down and dirty with it so stop making a big deal about it. And if all else fails there's prostitutes who can do the job for you so just sub contract it out and let your partner get some for a change instead of walking round like a sex starved idiot.","post_message":"\"Drink is not the answer.\""},{"comment_id":"1368750766478283","commenter_b":"She was with a child!","commenter_a":"This women is a stupid and ignorant person I hope there were no kids around that can very easily copy this stupid act","post_message":"Toronto Zoo officials said the apparent retrieval of a hat was \"a very bad idea\" @webpagelink"},{"comment_id":"10153377992812426","commenter_b":"Typical female...never satisfied.","commenter_a":"Wish he'd do something else other than banning microbeads","post_message":"Thanks, Obama! ;) More than 8 trillion microbeads were entering the country’s aquatic habitats daily; the volume was enough to coat the surface of 300 tennis courts every day -- according to a Sept. study."},{"comment_id":"1806931362926478","commenter_b":"I just can't believe that she uses children for her dirty political TV add. Her latest add children watching Donald Trump . She is the expert lol . Her lenguage puts sailors to shame. She is no Lady never was never will. Poletic is agly we all know that. But to involve children in an add how low can you sink??? I wouldn't let my children or great grand children watch TV dirty Poletic.... The would be in bed for sure not sitting in front of the TV all day long .what kind a mother and grandmother is she we should ask ourselves to use children in her dirty advertising against TRUMP they are children MADAM SECRETARY. SHOULD WE SHOW THE CHILDREN THAT YOU IGNORED THE DESPERATE CRY FOR HELP IN BENGHAZI?? YOU KNEW WAY BEFORE THEY WOULD NEED HELP RIGHT AWAY. WELL WHERE WERE YOU YOU WENT TO BED ...","commenter_a":"He's needs to walk away from the DNC at this point!!! They never had his back why should he have theirs? Stein /Sanders could change this country.","post_message":""},{"comment_id":"10153041862786045","commenter_b":"I also like all those racist flags in your picture reference there.","commenter_a":"What should they expect, the flag does represent slavery and Jim Crow. But I guess folks must cater to the idea that \"Southern Heritage\" must only be represented by the confederate battle flag and not the U.S. flag.","post_message":"Controversy continues to surround the #ConfederateFlag. Two men in Decatur say they were fired from their jobs at Turner Industries because they refused to remove the Confederate Battle Flag from their personal vehicles."},{"comment_id":"10153837390443812","commenter_b":"No, just their sperm. Lol","commenter_a":"You mean survivors are contagious for nine months.?","post_message":"Doctors have found that Ebola can linger in some male survivors for up to 9 months."},{"comment_id":"1363879910298702","commenter_b":"Yeah! Stupid Sheep","commenter_a":"Love Bernie Sanders! #feelthebern","post_message":"Bernie Sanders was cheered for like a rock star during his surprise visit to a Verizon picket line in Brooklyn today. Read full story: @webpagelink"}]
