[{"comment_id":"10154153179614445","commenter_b":"She is a female plain and simple dna dont lie!!!!!","commenter_a":"Good sorry but proud of the boys for standing up for their rights...you are a boy not a girl therefore no you shouldnt have the right to be king ...go home and sit in a corner and cry","post_message":"A transgender teen and his peers are protesting their high school’s decision to deny his bid for prom king. Hear Ash’s story: @webpagelink"},{"comment_id":"1354934454518383","commenter_b":"She's disgusting!","commenter_a":"Hillary ! Explain to this young girl why you support second trimester abortions ( ripping the body out limb at a time up to Five minutes before natural birth ) I'm not with that !!!","post_message":"This team has so much to be proud of. Whatever happens tonight, thank you for everything."},{"comment_id":"10154567699055399","commenter_b":"cuts? cuts!? SS gave out a wonderful COLA increase for 2017 of ONLY .03%! That amounts to about $2.00 more per month while Medicare just raised their rates over 149%.....FAIR? It is insanity!","commenter_a":"Full severance packages for Medicare/Social Security recipients and contributors. Give them their money back and kiss them good bye. Get politicians out of the retirement/pension/health plans completely","post_message":"It would, among other things, gradually raise the retirement age from 67 to 69 on Americans 49 or younger at the present."},{"comment_id":"10154258591333701","commenter_b":"What a bitch. Just say you don't want to exercise, don't take it to the next level.","commenter_a":"Once they hit 65 it should be mandatory yearly testing until age 75 in which case it needs to be testing every 6 months. Elderly people do not belong on the road. NOW before you idiots talk crap let me just tell you my father drove until he was 87 years old. When my brother and I reported him to the DMV at 83 years of age he was sly. He just went and took his drive test at the Silverton branch of the DMV and passed because all they had him do was drive around the block. Regardless, old people need to be allowed to ride the buss and max for free and stay out from behind the wheel!!.","post_message":"Police say nobody was injured in the crash, however there was something very familiar about it for everyone involved."},{"comment_id":"10153699132454060","commenter_b":"Do you mean the hate speach espoused by the feminist campaigners? Such as the hashtag killallwhitemen and maletears","commenter_a":"hate speech is hate speech. We must identify and stop it.","post_message":"“Just because you lop off your dick and then wear a dress doesn't make you a fucking woman.\" Hate speech or just offensive? Cardiff University students think the former"},{"comment_id":"1832453327028289","commenter_b":"Always thought she is trash and this proves it.","commenter_a":"Arrest her","post_message":"Ever the provocateur, Madonna dropped a trio of f-bombs and admitted that she's \"thought an awful lot about blowing up the White House\" during a speech at the Women's March on Washington on Saturday."},{"comment_id":"709094575910697","commenter_b":"This bitch needs to be put in a rubber room","commenter_a":"This woman is a mental case!","post_message":"Nancy Pelosi says white males who support Trump only do so because of their belief in God, their dislike of gays and because they want to keep their guns. What do you think about her comments?"}]
