[{"comment_id":"10154188982011954","commenter_b":"illegals only come here for free money ..stop the flow","commenter_a":"Can we cover the 2 million illegals registered to vote?? That has just been proven??","post_message":"Watch LIVE: Press Secretary Sean Spicer briefs reporters after the DHS secretary moved to implement immigration changes ordered by President Donald J. Trump. @webpagelink"},{"comment_id":"10154457609673812","commenter_b":"#RIP @MuhammadAli #MuhammadAli #TheGreatest @webpagelink","commenter_a":"RIP and praying for your family","post_message":"BREAKING: Boxing legend Muhammad Ali has passed away at age 74, according to family spokesperson. @webpagelink"},{"comment_id":"10154315963468812","commenter_b":"Weed makes you hallucinate now? Yeah let's ask the 2 ladies who have obviously never tried it.","commenter_a":"I still don't understand how marijuana is in the same classification as heroine and LSD, even though it's helping people walk! Meanwhile Oxy is prescribed every day and it's ruining peoples lives...","post_message":"Federal authorities are reviewing the possibility of loosening the classification of marijuana, which is currently in the same class of drugs as heroin and LSD."},{"comment_id":"10154603806201037","commenter_b":"You mean like your people did to the INDIANS","commenter_a":"If Mexico and Mexicans hate him so much, they are free to go back to their cesspool and stop raping the American welfare system!","post_message":"“[Donald J. Trump] is not welcome to Mexico. By 130 million people, we don’t like him. We don’t want him. We reject his message.\""},{"comment_id":"10154830329021830","commenter_b":"wow what shit if a celb said something worth hearing then ok fine but most are just fucked up losers that cry for attention","commenter_a":"Anthony Turner","post_message":"Ashton Kutcher Helps Reiterate Why Tomi Lahren & Co Are Full Of Shit"},{"comment_id":"10154645739237178","commenter_b":"Rather have snow than ice in Wake Forest !","commenter_a":"Sketchy in so pines","post_message":"Winter weather update with WRAL Elizabeth Gardner. (Stick around for the end to watch a little gloating from Brian Shrader's Anti-Snow League)"},{"comment_id":"991842820828524","commenter_b":"No it doesn't. Vermont has Constitutional Carry, and Vermont is the safest state in the union. @webpagelink","commenter_a":"Thank you, Governor. The current law works just fine.","post_message":"Governor Maggie Hassan issued the following statement today on Senate Bill 116, repealing the license requirement for carrying a concealed pistol or revolver: “New Hampshire’s current concealed carry permitting law has worked well for nearly a century – ensuring the Second Amendment rights of our citizens while helping to keep the Granite State one of the safest states in the nation. Law enforcement, as well as citizens across New Hampshire, have strong public safety concerns about allowing people to carry concealed guns without a license and oppose removing the protections that the licensing process offers to help ensure that potentially dangerous individuals are not allowed to carry hidden weapons. “Our permitting system gives an important oversight role to local law enforcement, while allowing for appeals through appropriate channels. In his book Live Free or Die, Republican Governor Mel Thomson said that the current permitting process for concealed carry is ‘a ..."}]
