[{"comment_id":"10154001304876509","commenter_b":"She should be fired and arrested. No one else can break the law and get away with it.","commenter_a":"That is insubordination! She is not following the rules and duties depicted in her job description! Justified cause forr job termination! Her Supervision should file charges and she should be processed according to HR procedures which could lead to job termination.","post_message":"This Kentucky woman is still refusing to issue marriage licenses to same-sex couples on \"God's authority\" -- and in defiance of the Supreme Court. @webpagelink"},{"comment_id":"10153590950708145","commenter_b":"You can turn it off though.","commenter_a":"Ever tried to uninstall Facebook? YOU CAN'T!!!!","post_message":"Apparently, Facebook wants its Messenger app to take over your phone."},{"comment_id":"494247850741172","commenter_b":"Good. That's all we need is illegal aliens in the military. They shouldn't even be in the country. Let them get in line......My grandparents did.","commenter_a":"As a democrat, you shouldn't give a damn whether I like it or not, as long as you got off your ass and did something without the president having to force you into passing some type of immigration bill.If you think the president did something illegal!! It's because you set on your ass and forced him to do something that he really didn't want to do.","post_message":"The final version of the legislation stripped out language that would have asked the Pentagon to consider allowing young immigrants who came to the country illegally as children to become eligible for service in the military."},{"comment_id":"10157013356035500","commenter_b":"Sure they do. After its dead. Please! Lol","commenter_a":"They are checking the contents of the stomach of the gator to see if there are any human body parts. They do this by gastric lavage.","post_message":"BREAKING: Officials have captured a large gator at the lake and will examine the gator stomach contents to see if there are human remains. Read more: @webpagelink"},{"comment_id":"10154765929828812","commenter_b":"That retort would demand a Breathalyzer test immediately in any Protective Custody or Dangerous-ness to the public situation. The man is incapable of formulating a complete and comprehensible sentence in English. Does he, maybe speak English a second language like some immigrants do? I've watched people get detained/PCd for less. He's going to lead the free world. We have illuminated the planet with a new low in the dummie-ing down of America.","commenter_a":"One temper tantrum away from WWIII","post_message":"Donald J. Trump says he \"could tell\" from intelligence officials' \"body language\" they were unhappy Pres. Barack Obama \"did not follow what they were recommending.\""},{"comment_id":"10154553926556729","commenter_b":"Shes an ugly bitch","commenter_a":"I think her and Fiorina fell out of the same tree.","post_message":"Thank you, President Obama!"},{"comment_id":"1068356466583942","commenter_b":"Chris clown is a pussy ass retard all this motherfucking bitch can do is beat on women","commenter_a":"Asswipe","post_message":"Chris Brown Threatens Trump And The Police: ‘Black People, Go Together 40, 50 Deep’ ⋆ UFP NEWS @webpagelink"}]
