[{"comment_id":"927400923975122","commenter_b":"Lol. Kinda harder for a white person to flee the country. Try again. If your illegal then you are ILLEGAL. Their is no right about it.","commenter_a":"For all of you saying if the man who caused this accident was an \"illegal\" or \"undocumented\" man, what if the victims were illegal? Is that going to change how tragic and sad this is? Jeez, you would think the older the wiser but it seems to be the older the dumber and ignorant","post_message":"MCSO: \"ONE OF THE WORST DUI CRASHES WE'VE EVER INVESTIGATED.\" 5 A-M Sunday morning, Sheriff's deputies say 23 year old Cesar Villanueva, driving a white truck, slammed into the back of a Honda waiting at a stoplight in Avondale. The impact virtually destroyed the car. The young man and woman in the Honda were pronounced dead at the scene near Avondale Blvd. & MC 85. Detectives say Villanueva was speeding and was impaired. He is in custody. Details at 5."},{"comment_id":"10155756776370615","commenter_b":"Refused. By Faux News? Well, it is official, her fifteen minutes are over.","commenter_a":"One sick puppy","post_message":""},{"comment_id":"1322047887828041","commenter_b":"seriously these 2 girls acting like trash why would you act like that in front of your kids??","commenter_a":"Eddie Fregoso @username lol","post_message":"BRAWL AT CHUCK E. CHEESE: A huge fight broke out among parents at a Chuck E. Cheese. This scene went on for about 10 minutes until officers finally arrived to break it up. VIDEO: Philip D. MORE: @webpagelink"},{"comment_id":"1109139419126529","commenter_b":"They are discontinuing these items because they are not being purchased. Pure business decision. They are not trying to bs socially responsible.","commenter_a":"Posturing","post_message":"Walmart made a major decision regarding guns that is going to surprise more than a few people."},{"comment_id":"10153995580906037","commenter_b":"This is an ugly woman","commenter_a":"This is not a man. This is not a man who will handle such a public failure very well. This is not a man. This is not a man who was courageous enough to participate in the last Republican debate despite Megyn Kelly asking hard questions. This is not a man.","post_message":"In the week leading up to the Iowa caucuses, Donald J. Trump issued more than 120 tweets. He took 16 hours to break the silence after his loss to Ted Cruz ."},{"comment_id":"10152931717926336","commenter_b":"They have no \"rights\" here in the US -- if they are here illegally they should be deported and if caught coming back into our country they should be put in a hard labor camp for 5 or more years --","commenter_a":"Thats all we need , one more moron!!","post_message":"U.S. Attorney General nominee Loretta Lynch said she believed in an illegal immigrant's \"right\" and \"obligation to work\" during Wednesday’s confirmation hearing."},{"comment_id":"507498396098707","commenter_b":"You guys are all nuts if you think Hillary will make a good president! She is a lier, cheat, she would bring this country down the tubes. She is insane, she is a felony and belongs in jail. If anyone else did what she did they would be in jail for life. Wake up democrats I'm sure there is someone else out there, who can do a much better job! Just because you guys want a woman in the White House she is definitely the wrong choice!","commenter_a":"She's a chameleon who will do anything for power, prestige and to keep her ego stoked.","post_message":"No one does politics as good as a Clinton."}]
