[{"comment_id":"10154046888226167","commenter_b":"If their lesbians,where does the sperm come from?","commenter_a":"Did he say lesbians pouring blood, and eating milk and sperm? ahahahaha!!!","post_message":"Trump ally Alex Jones claims Secret Service is terrified of \"devil worshiper\" Hillary Clinton because she \"acts like Linda Blair\" and \"flops around on the ground\" and \"spits at them\" and \"stinks!\""},{"comment_id":"10157662056330405","commenter_b":"Kasich is a sore loser..used to like him but after he lost the race for president he has gotten to be a sour sore loser..","commenter_a":"Good job, Governor! Wish there were more like you that agree to support what the PEOPLE want! My governor, Kasich, wrote in 80 year old John McCain for a president, wth! He's a disgrace!!!","post_message":"Great to rally a huge crowd in Eau Claire for Donald Trump, Mike Pence, Ron Johnson, and the entire Republican ticket."},{"comment_id":"10155143556313701","commenter_b":"Watch and you might learn something. @webpagelink","commenter_a":"The woman left behind her child in a hostile environment so she could save her own skin just to turn around and blame Trump's temporary travel ban as why her reunion with her child got delayed. Talk about one selfish mother.","post_message":"While in the vetting process a Somali refugee, named Sahara, gave birth to her son. Children are not automatically approved to travel, though, so she left her son with her mother in Uganda to speed up the process."},{"comment_id":"900773723315710","commenter_b":"And how is this news? Last time I checked, Mail was supposed to be a page for news.","commenter_a":"just kill them all anyway","post_message":"In these exclusive pictures, she goofs around like a typical London schoolgirl. Here we reveal what poisoned the mind of the 15-year-old who's run off to join ISIS."},{"comment_id":"644827892343831","commenter_b":"If you agree with Mike's comment you're a sexist ignorant shithead. Thanks Mike for demonstrating what sexist assholes think!","commenter_a":"Does anyone know what is considered rape? Rape is one of the most hanus crimes that can be commited. But can anyone really know if rape was commited. Many cases each year happen when 2 people have sex and then the girl just changes her mind and calls it rape. Now i dont know all the details in this case, but maybe this judge knew more than we did.","post_message":"Judge Aaron Persky infamously handed down a sentence of six months jail time to Brock Turner in June."},{"comment_id":"1235922729753315","commenter_b":"This is why these people need to go back to mexico and let the Mexicans that earned their way here stay","commenter_a":"we need to start burning Mexican flags, and ship the free loaders back!","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"1115332378507619","commenter_b":"Shame on you Arizona. This is the doing of ALL your citizens. I have spent a lot of time in Southern Arizona - at one time I would have retired near Tucson when we arefnished traveling. Not any more. Shame on you.","commenter_a":"Conservatives want to go to war with ISIS because they are destroying ancient sites but have absolutely no qualms about destroying our own indigenous holy places","post_message":"Should it be legal for Congress to give away ancient Apache holy land to a foreign-owned mining company? Represent.Us has the scoop."}]
