[{"comment_id":"710582602423848","commenter_b":"Ann Coulter shows her true colors like Trump. They both need a good dose of DUCK TAPE over their mouths.","commenter_a":"If this wasn't an election year, the Republican's would be silent about what Ann \"the Bigot\" Coulter said. In the past she has said terrible things about Muslims, Blacks, Mexicans & liberal Women & they were silent then !!!","post_message":"Ann Coulter needs to slither back into the snakepit she came from. --Andrew"},{"comment_id":"1172120832836462","commenter_b":"@username she's a racist. \"Government people\" is code word for white devils. She just want to see them.","commenter_a":"Well how is he planning to build this wall!! Without the native America permission he's trying to build on our land (Tohono O'odham nation) nd again there's gna be another treaty broken","post_message":"President-elect Donald J. Trump says he will move to deport criminal illegal immigrants and still plans to build a wall."},{"comment_id":"10153187094616636","commenter_b":"Typical Welsh comments !!!","commenter_a":"Hoog cheats by throwing himself to the ground in an attempt to get a South African player a yellow card or worse. Not a word of aplogy from the player, coach or former players. Why is it the Scots are such bad losers.?","post_message":"Gavin Hastings said the sight of Joubert leaving the pitch was \"the worst thing I have seen on a rugby field in a very long time\""},{"comment_id":"10154021550142377","commenter_b":"I see three women who should no longer be Senators!","commenter_a":"We have our own problems to solve. stop sticking your noses were they do not belong !! No other nation has made this kind of statement !!! $6Tril we spent and we have nothing except dead soldiers !!!","post_message":"Republican Sens. John McCain and Lindsey Graham have issued a blistering condemnation of the failure of the United States to act to prevent the slaughter of hundreds of thousands of people in Syria."},{"comment_id":"1819541594934723","commenter_b":"Why caught, why is that bitch alive.","commenter_a":"Oh well","post_message":"At least they got the scum bag! @webpagelink"},{"comment_id":"1017433231703049","commenter_b":"Cách đốt mỡ =)))))))))))))))))))))))","commenter_a":"Vivi Nguyen733970070144470 á đm....","post_message":"This is a giant ball of fire ants."},{"comment_id":"1487874397904733","commenter_b":"A vote for stein is a vote for trump. Besides,google her. She is no prize!","commenter_a":"If any Bernie supporter will support Trump after reading this, they were never a Bernie supporter. If they say they will vote for Stein, they are not a Bernie supporter. Bernie was an independent. He got into this race as a democrat because he said A 3RD PARTY CANDIDATE CANNOT WIN.","post_message":"Wow, he went there."}]
