[{"comment_id":"894713893918640","commenter_b":"They are teaching the future illegal aliens how to unionize for maximum benefits. What a COUNTRY!!!!","commenter_a":"VERY WRONG!!!","post_message":"The IRS commissioner says that even illegal aliens who don't pay taxes could receive tax refunds with Obama’s executive amnesty!"},{"comment_id":"481924841998096","commenter_b":"No Islam. This is The USA, not the Middle-East.","commenter_a":"Yes i support him completely get that islam shit out of our schools and our country","post_message":"A veteran was banned from his daughter's school... for speaking out against Islam? This is absurd. We support this veteran 100%. Do you support his stand against Islam?"},{"comment_id":"10154269549387994","commenter_b":"You ugly asf stfu.^","commenter_a":"People have gone crazy if they think Trump can run this country.","post_message":"BREAKING: Ted Cruz has dropped out of the GOP race for president, clearing the way for Donald Trump to likely win the nomination."},{"comment_id":"10153629166689170","commenter_b":"I bet Herman has watched this a 1000 times","commenter_a":"You mean to say that I have to save this so I can show my lil boy when he gets older the travesty that happened and the wrongs performed by these terrible women, it won't be easy but it's for future reference , thank you Libs for bringing this horrible video to our attention or no one would have known about it hahahaha","post_message":"The left does not want you to ever watch this video because it's \"hyper-feminine\" and not diverse or something. So even though we've embedded it here, don't watch it!"},{"comment_id":"1124522294289594","commenter_b":"Well to be fair, she didn't do a very good job raising you.","commenter_a":"@@username, You watch what you say about my mother you no good peice of garbage!!!!!!!","post_message":"Would you do this if you saw a dog trapped in a hot car? A new Ohio law makes it perfectly legal."},{"comment_id":"10153758333227217","commenter_b":"A loose federation or republic please girls. also please get rid of our constitutional monarchy.","commenter_a":"Oh No nae anither ane","post_message":"Will there be a second referendum on Scottish independence? \"As far as I'm concerned, the Scottish people had their vote - they voted in 2014 - and a very clear message came through,\" says new PM Theresa May. #Indyref2"},{"comment_id":"486444454879468","commenter_b":"I can't stand her either..","commenter_a":"Yes I will always honor and support the Flag of the United States of America!!","post_message":"Michelle Obama just said something treasonous about the flag. This is ridiculous, that flag is the symbol of the greatest nation on Earth. Do you support the American Flag?"}]
