[{"comment_id":"10153031435480671","commenter_b":"Soldier on ladies!","commenter_a":"Ricky Myette","post_message":"What do you think about two women graduating from the Army's elite Ranger School?"},{"comment_id":"10154771677946602","commenter_b":"CB=gotohell!!","commenter_a":"Div 2. LMFAO!! Football is an abomination and now BB is a JOKE. What the HELL happened???","post_message":"For the second game in a row, sophomore Jalen Adams carried the offense. UConn Men's Basketball will play Oregon tomorrow."},{"comment_id":"1015223798498631","commenter_b":"I see what you did there","commenter_a":"That's gold","post_message":"Sorry folks."},{"comment_id":"710582602423848","commenter_b":"Ann Coulter shows her true colors like Trump. They both need a good dose of DUCK TAPE over their mouths.","commenter_a":"If this wasn't an election year, the Republican's would be silent about what Ann \"the Bigot\" Coulter said. In the past she has said terrible things about Muslims, Blacks, Mexicans & liberal Women & they were silent then !!!","post_message":"Ann Coulter needs to slither back into the snakepit she came from. --Andrew"},{"comment_id":"10154719579276509","commenter_b":"Google princess songs and you'll get the list","commenter_a":"Where can we get a complete list of the songs he wrote for others????","post_message":"A day after Prince’s passing, CNN’s Lisa France answers questions on how the rock superstar impacted the music of the last four decades."},{"comment_id":"10154150780421028","commenter_b":"@username, she may be immoral and gross TOO but shes not running for president","commenter_a":"Just wondering if NBC will be firing Miley Cyrus from the Voice? There are some really raunchy offensive videos of her out there. Can't imagine why it's ok for her to put that filth out there recently, but he's being punished for something so old.","post_message":"Billy Bush is leaving the \"Today\" show following outrage over the leaked Donald Trump tape, the show's producer says. @webpagelink"},{"comment_id":"10153003088197377","commenter_b":"It will be a huge shake up.","commenter_a":"Now they talking I guess they are coming out of there dream closets, they better rally around him and make this country great again.#Trump/Cruz.","post_message":"Newt Gingrich says Donald Trump is capable of winning not only the Republican presidential nomination."}]
