[{"comment_id":"10153254069356130","commenter_b":"God damn feminists","commenter_a":"Kara Capozzi","post_message":"We've got a bearded man who meets his bearded mom, a world-record lady beard and a coiffed competitor on this week's Weird News podcast."},{"comment_id":"10151088515799999","commenter_b":"Such a misogynist!","commenter_a":"I was at Smith College when Maher came and spoke in the late 90s. His contempt for women was palpable. Not a surprise that he feels avuncular towards Milo. Once you accept it is okay to dehumanized one group, it is just a hop skip and jump away from demumanizing anyone.","post_message":"Bill Maher's interview with Milo Yiannopoulos was a mostly chummy affair. Then in a segment that ran after the broadcast, Yiannopoulos attacked transgender people."},{"comment_id":"10153845354225579","commenter_b":"I guess Elizabeth you didn't get the memo. Women are excluded from being president as well! You all don't have the fortitude to do what is clearly a mans job!","commenter_a":"Really..Because the shame is on all of the Obama administration. I happen to agree with Dr. Ben Carson..","post_message":"Senator Harry Reid: on Dr. Carson. The Senate minority leader responds to Dr. Ben Carson remarks on Muslims."},{"comment_id":"1499858063367275","commenter_b":"Fleas carry disease such as plague. They're not safer than the flea meds!","commenter_a":"This is why I don't use any flea medication on my dogs, it's more dangerous for them than the fleas and my dogs have NEVER had fleas","post_message":"It's a dog chew so powerful that one dose can kill fleas and ticks for three months. Tonight on KIRO 7 News at 5 p.m., hear from people who say the flea medicine is responsible for the death or sickness of their dogs."},{"comment_id":"1296712253679455","commenter_b":"Domestic Terrorists should be punished to the full extent of the law.","commenter_a":"Bundy, it's time to pay the piper !","post_message":""},{"comment_id":"659614807562431","commenter_b":"I would have left that along time ago. Angree black woman.","commenter_a":"We don't give a shit about their marriage , they are destroying America and need to be kicked out of the White House NOW!!!!!!!!!!!","post_message":"It seems that Michelle and Barack are going there separate ways. How about in the meantime, we find a president who can actually run our country. Do you agree America should divorce the Obamas?"},{"comment_id":"10153287887659614","commenter_b":"Hahahaha @username you made me laugh lol but maybe that's what really happened to these girls too much d*ck sucking lol","commenter_a":"Sucked too many c...ocks ? lol","post_message":"A concerning new trend on social media shows young women trying to imitate the big-lipped pout of 17-year-old reality TV star Kylie Jenner of the Kardashian family. The so-called #KylieJennerChallenge requires suctioning one lips into a shot glass or bottle. Some young women are ending up with painful bruises, photos on Instagram and Twitter show. The challenge could result in injuries to nerves, muscles and trauma to the blood vessels, a plastic surgeon says. Read KTLA's story here: @webpagelink"}]
