[{"comment_id":"1068619743164680","commenter_b":"why 'send' them anyplace? Just teach our history & proper methods, uphold the laws of our nation, put teeth n the laws n place, cut off the welfare & they will leave....don't waste any more $ on them....well...maybe a 1-way ticket!","commenter_a":"Gutless flag burner won't show his face Cowards","post_message":"The nerve that Rudy Giuliani touched this week is not merely Obama's anti-Americanism; it is the anti-Americanism of the progressive left."},{"comment_id":"10152719503449117","commenter_b":"Don't these pigs have any REAL criminals to hunt down???","commenter_a":"Boy that's a basket of snarls","post_message":"Why the sex lives of teens should be subject to school discipline is suspect enough, but it's extra perplexing what interest the government has in such matters."},{"comment_id":"10153637483924714","commenter_b":"White people rock!!!","commenter_a":"^^^when the police start killing your people and getting away with it then you tell how how to protest/feel #nojusticenopeace","post_message":"Philosopher and activist Dr. Cornel West was arrested during a demonstration outside the Saint Louis federal courthouse."},{"comment_id":"10152744570508822","commenter_b":"so hard to even win a buck!","commenter_a":"$1 straight Is 50. $1 box is 25","post_message":"The Pennsylvania Lottery is getting a makeover and adding a new game. Check out the changes here: @webpagelink"},{"comment_id":"596495133817002","commenter_b":"Please put this bitch in, just for the sake of good comedy.","commenter_a":"And Dems here's 8 more years. Repubs are screwed if we put these people up.","post_message":"This is easily the most hated person by liberals. They will begin freaking out in 3... 2... 1..."},{"comment_id":"682546678578123","commenter_b":"Historical facts, not rumors, not hearsay just plan undeniable facts. (This is just a small percentage of a much longer list ) Of the two candidates running for president... Only @username was caught lying to congress. Only @username was fired from a job for being unethical. Only @username deleted 30 some thousand emails after she was ordered to hand them over to the Fed. Only @username had that same computer wiped clean by professionals. Only @username got the rapist of a teenage girl off on rape charges then laughed about it. Only @username lied to the American people about Benghazi. Only @username lied to the American people about her emails. Only @username lied about being under sniper fire. Only @username lied about lying to the American people. Only @username was involved in \" Cash Cow \" Only @username has a long list of scandals. Only @username nationally belittled her husband's ...","commenter_a":"If you hate her so much why do you sad feckers bother to be here? And have you actually looked at Trump? The rest of the world are scared shitless that he'll get in. Oh, apart from Russia.","post_message":"Born before women could vote, Ruline just cast her ballot for Hillary in Iowa today. Join her: IWillVote.com"},{"comment_id":"10154710996716800","commenter_b":"HHHHHHHHHHHHHH MRDOH hhhhhhhhhhhhhhhhhhh","commenter_a":"Ilyass darori tchouf had lvid XD","post_message":"Ronny Chieng makes a desperate plea to a batch of undecided voters ahead of Election Day. #election2016"}]
