[{"comment_id":"10150565402804999","commenter_b":"Please don't vote for her just because she's a woman.There are plenty of good women out there to vote for.","commenter_a":"Anyone who votes for her is showing support for terrorism and the killing of US personnel","post_message":"“I’m running for president,” Hillary Clinton said with a smile near the end of a two-minute video."},{"comment_id":"1250130898332398","commenter_b":"Fuck off bitch!","commenter_a":"I voted for Bernie. I'm voting for whoever stops that White Nationalist Donald Trump. If Bernie is voting Hillary, so am I.","post_message":"Bernie just put the nail in the coffin for the Trump campaign. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153367837094714","commenter_b":"You just don't understand feminism, boys are free to do what they want to do women should be just as free, to have sex, get drunk and behave carelessly just like boys do.","commenter_a":"Why would they take offense? Because they want to protect the image and dignity of young women? Seriously?","post_message":"Wow, we didn't see it until we looked closely"},{"comment_id":"891182254405684","commenter_b":"He has already done a better job than Obama ishani August ,why don't you move to Cuba or the middle east,there you would find out what \"raping \" in a country is all about.do you feel safe with open borders?","commenter_a":"I am just so proud of President Trump, he is keeping his promesses, he is a man of his word. Wait until he gets sworn in, things will start moving for great changes.","post_message":"Do you support our president, Donald Trump? Comment YES or NO."},{"comment_id":"10157096795925551","commenter_b":"Go back to sleep old woman","commenter_a":"She has shown her bias...can't be trusted anymore","post_message":"Well, imagine that."},{"comment_id":"10154979163784712","commenter_b":"@username she has given no reason for anyone to respect her. She is disrespectful, offensive and rude.","commenter_a":"Ugh .... for fucks sake ... \" the tax payers are funding this \" you fucking idiots!! He is gutting federal funding from science to build this stupid fucking wall ... p.s most illegal aliens are here from over stayed visas ! From countries they took planes from ! Besides don't you watch international news ? Cartels use tunnels now to bring in drugs you fucking dummies !","post_message":"Trump will sign executive orders enabling construction of a border wall and targeting sanctuary cities."},{"comment_id":"10154304123721051","commenter_b":"When Leftists Attack - Man Harassed For Wearing #BuildTheWall T-Shirt","commenter_a":"Teddy Roosevelt was our President during a different time period. Our country has grown in diversity, and as we continue to progress, expanding our minds and opening our hearts is the order of the day.","post_message":"Do you agree or disagree with this Theodore Roosevelt quote?"}]
