[{"comment_id":"879093232228004","commenter_b":"She is an ugly person!","commenter_a":"Maybe she can hire a personal assistant to help her with clothes and makeup...","post_message":"$20,000,000.00 a year?! Shoot, I wouldn't pay her $20 a year."},{"comment_id":"497157623808151","commenter_b":"Oh but their day is coming!!! We will show up one way or another!!!","commenter_a":"Obama sucks","post_message":"ISIS just made a huge move against America. This is unacceptable. Spread this post, we need to fight back. Do you agree ISIS should be wiped off the Earth?"},{"comment_id":"10154786029086833","commenter_b":"Arrest her","commenter_a":"While she has her entourage of security with every bit of modern rapid fire","post_message":"So the NRA isn't being \"reasonable\" for defending your individual right to keep a gun in your home for self-defense...yet it's \"reasonable\" to advocate for an Australia-style gun confiscation program? Uh, ok."},{"comment_id":"1132662126754797","commenter_b":"Haaaa! Sandhopper burgers all round !!!","commenter_a":"@username they stole our business idea!!","post_message":""},{"comment_id":"1050080195049016","commenter_b":"another dumb btch","commenter_a":"So Donald Trump you are not the savior we need for this country, I do not think you will bring jobs or prosperity when you do not even pay great wages for people that work for you. I think you are a disaster waiting to happen, you really belong in a reality series not president, I hope the people wake up before you end up our dictator","post_message":"ICYMI: Ivanka Trump took the stage in South Carolina and said, “My father is an incredibly hard worker and he’ll be working for each and every one of you.” (CC: Donald J. Trump, Sean Hannity)"},{"comment_id":"10153451111339087","commenter_b":"@username, Keep telling yourself that!! She doent have a chance, get over it already, find yourself a job!! Killary for PRISON!!!","commenter_a":"Screw Hillary and Bill, they are criminals and I don't like either of them!","post_message":"“Hillary Clinton is my candidate for President of the United States. She is best positioned to continue the progress made by President Obama on a range of issues -- from strengthening our economy to making the right investments in our infrastructure to common-sense gun safety laws to ensuring a fair criminal justice system,” Transportation Secretary Anthony Foxx said."},{"comment_id":"10152991512942377","commenter_b":"She broke the law just by living too long","commenter_a":"Do not pass go, do not collect $200M","post_message":"Hillary says she never received classified emails on her personal server. Do you believe her?"}]
