[{"comment_id":"10152964045994753","commenter_b":"I must be living wrong, that bitch","commenter_a":"This is in England so who cares","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"10153814359479411","commenter_b":"@username I don't have sex with animals unlike yourself.","commenter_a":"A monkey is still a monkey, even if you put a suite on it.","post_message":"Coming soon on RT Documentary - Congo's kings of style."},{"comment_id":"10154361772367061","commenter_b":"As someone who lives in Lumberton I think we need to thank a lot of people for all they did. People came from other towns and cities with food and other things that were badly needed during this time. I understand these ladies went above and beyond and for that I applaud them. But we should not forget all the other people that helped and are still here helping. While the kids are a very important part of our community there are still people working to rebuild what has taken them a lifetime to obtain. I just want to thank all the people who were here when we were at our worst.","commenter_a":"Very cool","post_message":"WATCH: Educators in Lumberton, NC, hit hard by Hurricane Matthew, get $50,000, a brand new playground and funds to rebuild 16 parks! @webpagelink"},{"comment_id":"10154234015931337","commenter_b":"You poor ignorant cunts...","commenter_a":"Howard Stern's Face is a roast all in it's own. Those giant dentures, cheap wig, and dick nose.","post_message":"FROM GIRALDO TO JESELNIK... These are the most vicious roast takedowns of all-time.'Comedy Knockout' premieres tomorrow on truTV at 10:30/9:30c. @webpagelink #ad"},{"comment_id":"758262410976191","commenter_b":"What a f--king liar!","commenter_a":"Chris is wrong Trump is right. Trump is the right man for the presidency. Get it and stop fighting a good thing for our country.","post_message":"Wow...Donald J. Trump and Chris Matthews agree that many Republican leaders and corporations don't want to stop illegal-alien hiring because they want the cheap labor."},{"comment_id":"10153369790181770","commenter_b":"SHES A WITCH!!!","commenter_a":"hillary is an idiot , how could anyone vote for someone so evil, she has to be stopped","post_message":"Clinton thinks everything is fantastic at the U.S.-Mexico border."},{"comment_id":"895290923994817","commenter_b":"Charlotte u must b mistaken u must mean SLICK WILLIE & HIS FAMOUS LEWINSKY & HIS ASHTRAY WHERE HE PLACED HUS CIGAR!!! HE SAID HE DID NOT HAVE SEX WITH THAT WOMAN & THEN HE ADMITTED HE DID!!! Also remember the FOUR BRAVE AMERICANS WHO DIED UNDER LYING HILLARY!! She shd b in jail!! U have been carrying the water for the dems & it is disgusting!! Grow up cupcake & if u can't go get a coloring book and color!!","commenter_a":"We need a liar, rapist and whore nude model in the White House . U bet","post_message":"With every announcement America is falling more and more in love with the Trump family. This is awesome, it's exactly what was needed. Can we get 5,000 'LIKES' for the Trump family?"}]
