[{"comment_id":"10153310967161756","commenter_b":"Yes, yes I am. Suck it!","commenter_a":"Maybe but you get to tell everyone you're a vegan within 10 seconds of meeting them.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."},{"comment_id":"1140743049271284","commenter_b":"Little girl, you are asking for a theocracy, which America is not. Time for you to leave and go to Iran, pookie. No one wants your cowardly, uneducated, anti-American traitor self here.","commenter_a":"If God said it, it is settled!, no matter what any pervert says! And the supreme court is not supreme!, God is!","post_message":" represent the people, and the people have shown several times that they are opposed to this, and are in favor of traditional marriage, state Rep. Bill Chumley, R-Woodruff."},{"comment_id":"1508488155837876","commenter_b":"Kelli Foltz-Daniels the Bkacks","commenter_a":"Because Latinos live off the welfare system. When you start talking jobs, they tend to get pissed off thinking your gonna take away their government funds","post_message":"Nearly 80 percent of Latinos have a negative opinion of Trump."},{"comment_id":"1277939352272817","commenter_b":"Its gangster in this bitch I better go before MFs pull they emojis out on my ass.","commenter_a":"Were are the white folk at? What's they excuse for this bull shit? Fucking dumbass idiots. I hope they sue the shit out of them!!!","post_message":"This bad cop narrative continues to evoke frustration. #WSHH #NYPD"},{"comment_id":"1034345616576908","commenter_b":"Please. Many women CANNOT use those. I never could. Not everyone is the same dear.","commenter_a":"Ladies....Honestly. Get a menstrual cup. You will hate yourself for not doing it sooner.","post_message":"This should not be a thing"},{"comment_id":"1234184189935923","commenter_b":"Júlia, por favor, não vire uma crazy cat lady!","commenter_a":"Se encontró una asociación entre tenencia de gatos a temprana edad y desarrollo de trastornos siquiátricos en la adultez. Según el journal of schizophrenia research. Doble de probabilidad de desarrollar esquizofrenia, post infección por Toxoplasma gondii. (Por arañazo de gato) Cuidado con quedar como la vieja de los simpson. Paulina Santander","post_message":"A parasite common in house cats has been linked to mental illness."},{"comment_id":"10156069283810354","commenter_b":"@Kristin ... \"you serious Clark?\" is a quote from the movie Christmas Vacation : )","commenter_a":"Well, when schools in a Tennessee district are banning the USA flag, why not the gay pride flag?","post_message":"“...police reportedly confiscated a gay pride flag…” Will the Left ban the gay pride flag now?"}]
