[{"comment_id":"10153325446200950","commenter_b":"@username you dumb ass, read the initial comment before you come for me bitch.","commenter_a":"Get them all out of here!!!","post_message":"Two refugees from Iraq with alleged ties to ISIS are due in court Friday to face federal charges of supporting terrorism. According to an affidavit, both men are accused of lying to cover up their efforts to support terrorism. The arrests are now renewing a debate over bringing refugees from Syria and other countries to the U.S."},{"comment_id":"1049313658417628","commenter_b":"Too true!","commenter_a":"I see an IRS audit in staples future. ...","post_message":"Staples announces that because of Obamacare they're having to make some changes in the structure of their employees, and Obama does not like it and he takes out after them. \"Obama Slams Staples for Reducing Hours to Avoid Obamacare,\" and Staples responded."},{"comment_id":"635519663305279","commenter_b":"And cut her off. And see her vagina shut","commenter_a":"Deport her and her whole family","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"545649178956022","commenter_b":"I've held that Cruz is probably more dangerous than trump because he has all the bigotry and hate but he is actually serious about it as opposed to trump who is just a bizarre orange man who is saying what he needs to get elected.","commenter_a":"Is that so? Then he's an even bigger idiot than I thought","post_message":"Ted Cruz knew exactly what he was doing by not outright endorsing Donald J. Trump."},{"comment_id":"1735755160025201","commenter_b":"Hopefully I can get there before someone builds a wall around our entire country!","commenter_a":"I feel so sorry for you Americans!! Come in up to Canada we can have a beer and chat about your presidential candidates lol","post_message":"Donald J. Trump accuses President Obama of being 'the founder of ISIS'... then calls Hillary Clinton the 'co-founder.' @webpagelink"},{"comment_id":"1080954051971524","commenter_b":"We will celebrate when she leaves the White House!","commenter_a":"How about a national party when they move out of our house???","post_message":"Would you be COOL with this? Or does the thought of this make you gag?"},{"comment_id":"10157286339920093","commenter_b":"There's no such thing as humane murder, just like there's no such thing as humane rape. Either way they're going to die and nobody wants to die. It's not our choice, these are foreign proteins that make our bodies suffer . They have a negative impact on us yet were continuing this vile massacre. Did you know that they rape cows ( the artificially inseminate them with a \"rape rack\").","commenter_a":"Humans love to kill land and sea animals. People are like cavemen and think they still have to kill to eat. I've been doing great for 20 years now without eating meat or seafood. I don't believe in killing things it's a pretty crappy thing to do. Heartless and inhumane. It's called using your brain and evolving. How can anyone with a conscience bully and kill something I don't get it.","post_message":"Hundreds of lobsters avoided being boiled alive thanks to a group of Buddhist monks."}]
