[{"comment_id":"10154814539690470","commenter_b":"She's still a thief genius.","commenter_a":"Sucks to be a thief.","post_message":"A woman in Pennsylvania died after she got her arm stuck in a clothing donation bin, and was left dangling above the ground for hours. Judith Permar, 56, used a stool to reach into the bin on Sunday before it collapsed, breaking her left arm and wrist, according to Mount Carmel police."},{"comment_id":"404872436304464","commenter_b":"Pieces of shit like her need to be culled, slowly an painfully.","commenter_a":"Now I've heard everything. Hurry up with the \"Big Payday,\" Lord.","post_message":"A woman and her cop husband were at a bar for a drink before she got on the road and ran over three teenagers riding their bikes. Now she is suing the boy's family for the \"trauma\" she was put through by hitting and killing one boy and permanently injuring two others."},{"comment_id":"10153365976956955","commenter_b":"Political parasites.","commenter_a":"Anyone who signs new gun control legislation that infringes on the second amendments should be tried for treason","post_message":"HERE THEY COME: CONGRESS TAKES UP GUN CONTROL"},{"comment_id":"949545821752943","commenter_b":"All. Very. Sexy. Women. Man...","commenter_a":"Who chose white print???? I couldn't read most of this .","post_message":"Have you seen this?"},{"comment_id":"10153347711966680","commenter_b":"And from your own site @webpagelink","commenter_a":"No one has ever really cared what David Duke says so people don't need to flare up over his nonsense.","post_message":"Former KKK grand wizard David Duke on Donald J. Trump: “He’s meant a lot for the human rights of European Americans.”"},{"comment_id":"1160101854032719","commenter_b":"Build that wall!!!","commenter_a":"U tell em Trump","post_message":"Watch as Donald J. Trump discusses his education plan."},{"comment_id":"1011733118888805","commenter_b":"Amen to that our children come FIRST","commenter_a":"So sad.","post_message":"We have NO ROOM! We need to take care of Americans first and make our country GREAT Again!~ FOLLOW US---> Freedom Daily"}]
