[{"comment_id":"10155012522801944","commenter_b":"It's now about money Obama laid out a lot of this deportation and Trump has to bite the bullet. Now back to money. Only ones going to make money on the deportation of illegals are LAWYERS. Lose. Lose situation for the illegals. Serves them right? Our forefathers and mothers came in legally Any questions ?","commenter_a":"Id like to see 365 days without illegal immigrants. enforce the law deport illegals.","post_message":"Serves 'em right."},{"comment_id":"10152742769151167","commenter_b":"Rihgt Michael...just another Fox News whore","commenter_a":"Speaking as a Jew, I think someone needs to kick Tarantula upside her head.","post_message":"Vile."},{"comment_id":"10153161330059270","commenter_b":"Women shouldn't be allowed in the special forces. Period","commenter_a":"No surprise.","post_message":"No women pass Army Ranger School."},{"comment_id":"410802195930600","commenter_b":"Stupid.. Beyonce has enough awards, no way in hell I would have broken it to give half to Beyonce.. Adele is so much more talented..","commenter_a":"It was ADELE'S moment - and BTW, that narcissistic fur hag is NOT a queen - except maybe of BAD TASTE","post_message":"Adele may have broken her Grammy award in half for Beyonce."},{"comment_id":"840567656083161","commenter_b":"Karla Huitron cause yo ass can eat","commenter_a":"Marry her ass quick!!!","post_message":"What u doing? #WSHH"},{"comment_id":"10153471802056336","commenter_b":"It's a woman's choice regardless Patricia","commenter_a":"And is a distortion of the truth. No body parts were offered for sale. This is a complete propaganda that Ted Cruz is too stupid to know to avoid. Dumb canuck.","post_message":"\"These tapings of Planned Parenthood selling body parts are grotesque. It highlights the evil of what they're doing.\" – Sen. Ted Cruz"},{"comment_id":"10153222902488645","commenter_b":"@username dont worry about those nails.... worry about that mouth full of yellow teeth.... nasty","commenter_a":"Who cares? The dude is old as hell and WWE is for red necks.","post_message":"Hulk Hogan claims that he resigned from the WWE in the wake of the release of the transcript in which he used racial slurs, while the pro wrestling company says he was fired. Either way, all mention of him has been scrubbed from the WWE's website."}]
