[{"comment_id":"10153002038827894","commenter_b":"She has a disrespectful spirit lol","commenter_a":"@username I am still laughing 😂","post_message":"Coko of SWV Throws Shade at K. Michelle & Tamar Braxton's BET Awards Performance, K. Michelle Claps Back 'You're at Home!'"},{"comment_id":"856436467738235","commenter_b":"Hang her!","commenter_a":"I'm a cabbie and I wish I could catch every person that skips on me","post_message":"A judge told this teen she could either walk 30 miles within 48 hours--or go to jail. She chose the long walk. See what she did below. Do you think the punishment fits the crime?"},{"comment_id":"10152790517586051","commenter_b":"What a piece of crap he is. Cut his manhood off and feed it to him.","commenter_a":"we need a little eye for an eye justice","post_message":"This man broke in, put a knife to a woman’s throat and raped her as her husband lay right beside her. And he didn't stop there."},{"comment_id":"10153035493893822","commenter_b":"Gross. She needs to go back.","commenter_a":"Why isn't she in jail?","post_message":"Connellsville woman charged for having sex with a 14 year old boy. The boy actually dated the woman's late daughter, who died back in June of 2014."},{"comment_id":"1791974164423219","commenter_b":"@username Mexico has a wall at the south boarder but yet it's all ok for them? They built it to keep the freeloaders out, but it's so wrong for America to do it? Sorry if you want to be over run with illegals go move to Mexico. Otherwise support YOUR COUNTRY FIRST!","commenter_a":"Difference Clinton isn't a racist all Hispanics rapist, murders and thieves. Name one nation that has put a wall to keep a bordering country out. If every country in Europe can their border without a wall so can we.","post_message":"Controlled immigration wasn't \"extreme\" 20 years ago and its not \"extreme\" today..."},{"comment_id":"744295802392870","commenter_b":"Oh god this world","commenter_a":"Anoosh GondalSadia Manzoor lol wth","post_message":"The PMS Package makes your 'time of the month' easier with candy and treats. Via In The Know"},{"comment_id":"472497066265507","commenter_b":"I believe she had a choice before the seed got mixed. so don't start the problem in the middle start at the beginning...","commenter_a":"AMEN","post_message":"Every woman is entitled to control over her own body."}]
