[{"comment_id":"517364508436536","commenter_b":"The other candidates are disappointed because they need Trump's ideas","commenter_a":"I wander if I can have my cable provider remove FOX channel from airing in our home period...ha..oh, I can do that. #TRUMP !!","post_message":"The Trump campaign is saying that Donald J. Trump will skip Thursday’s Fox News-Google #GOPDebate. @webpagelink"},{"comment_id":"874758175906540","commenter_b":"1400 years Muslims have done nothing but murder...Muslims gave humanity the dark ages,Muslims have been murdering and destroying the new body count 750,000,000 and growing..this death cult will and have killed their own it will not matter!","commenter_a":"Don't we all feel better because the NYT supports the great community organizer? Hell, I may just go to work!","post_message":"The only war the Obama administration is fighting is 'the war for American public opinion.'"},{"comment_id":"1026765060695063","commenter_b":"I'd whip her so hard she could only us that middle finger to rub her sore butt.","commenter_a":"No presents .........","post_message":"Utterly hilarious 10-year old drama! [Read below]"},{"comment_id":"1170528036314405","commenter_b":"She knows she can't do it. She has to bring her husband in to do it for her. I guess we are not ready for a woman President.","commenter_a":"Hillary says she will appoint Bill to run the economy. We've seen the Clintons in action together before in the Whiter House. We call that getting two crooks for the price of one.","post_message":"The Clinton Foundation's business relationship with 20 foreign governments raises real questions about her judgment. Simply put, Crooked Hillary is in no position to be President of the United States of America."},{"comment_id":"539787562878490","commenter_b":"Send Them back to their sand pile home, get them out of this country!","commenter_a":"Why were they even there watching if they didn't like it","post_message":"Furious Muslim students rush stage during American Sniper showing. They have no respect. If they don't like American Sniper they can leave. Do you agree these Muslims are out of line?"},{"comment_id":"1072309979477455","commenter_b":"So basically she is happy wearing those 40 yards. If she wasn't she wouldn't be wearing it","commenter_a":"I hope she's happy wearing 40 yards of material everyday! Happiness is a warm burka....","post_message":"VIDEO: United Arab Emirates appoints first minister of happiness"},{"comment_id":"10153009927864586","commenter_b":"Let someone stand on that bitch's head!","commenter_a":"I still cant get over the idea that an organization that euthanized dogs and cats and put them in dumpsters is denouncing anything to do with being cruel to animals. Google the pics... PETA EUTHANIZED ANIMALS","post_message":"ICYMI: Sarah Palin posted a picture of her son STANDING on the family dog & thinks it's totally okay: @webpagelink The most important thing we can teach our children IS COMPASSION. SHARE if you agree!"}]
