[{"comment_id":"10154351189226051","commenter_b":"Lmao nope 😅","commenter_a":"Christine you didn't get this one did you! 😂","post_message":"When these parents took the doll out of the box, they were surprised at what they saw. Take a look for yourself and see if it's worthy of the controversy."},{"comment_id":"1068708143222239","commenter_b":"Stupid","commenter_a":"Think of how awesome it would be if our President wasn't the anti christ.","post_message":"Happy Presidents Day. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"950004335054969","commenter_b":"She loves him..get over it!","commenter_a":"I sure hope he makes a full recovery, not only for his kids and himself, so that gold digging piece of garbage he is still legally married to cannot get a dime of his money. It is disgusting how she is sitting at his bedside just waiting on him to die because everyone knows she does not give a crap about him. The Kardashians are a cancer that needs to be eradicated.","post_message":"#PrayForLamar Lamar Odom gives his family and friends a sign of hope after awaking from a coma. The gesture is sure to warm your heart. Meanwhile, Lisa Morales, the mother of his two children speaks out on Odom’s early improvements. FOR THE LATEST ----> @webpagelink"},{"comment_id":"474651159350328","commenter_b":"I had to take a class on how to handle union situations at wal mart.","commenter_a":"Ya outta see Targets 20 minute \"what to do if a union approaches you\" training video that every target employee must view before they are hired... It's Reduculus...","post_message":"In recent years Walmart has been labeled the bad apple in Corporate America, but recent news may give Target that title. ~Tanner"},{"comment_id":"10154017496904753","commenter_b":"@username, shame on you as , should be, a lady sharing that garbage!!","commenter_a":"He should shout up and move on with is washed up singer Gwen. Miranda has kept silent . She is the classy one.","post_message":"Until today, Blake Shelton and Miranda Lambert have kept people guessing who really caused the divorce in their relationship. During an interview with Billboard a few weeks ago, the 40-year-old country superstar hinted that the 32-year-old songstress cheated on him. His song “She’s Got A Way With Words” was about a lover who cheated and lied. Shelton may not have written the song, but he said that he won’t stop people from thinking that some of the lines were about his relationship with his... @webpagelink"},{"comment_id":"10153526308641509","commenter_b":"Christians are freaked out because there will be more muslims in the world than Christians soon enough...ha, ha...paranoid! Be very afraid republicans and pee farty hatriots oh and BUY GOLD will ya? lol.....","commenter_a":"Relax people, we got those Iranians right where we want them...","post_message":"President Barack Obama says if a nuclear deal is fully implemented, it will prevent Iran from obtaining a nuclear bomb: @webpagelink"},{"comment_id":"10153419431089024","commenter_b":"Strange? No. Normal. These two are NOT our Allies.","commenter_a":"they're called \"handlers\", making sure their government's contributions are used wisely.","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"}]
