[{"comment_id":"1563567157272928","commenter_b":"Stupid ass motherfucker","commenter_a":"way to go rosie, now evryone knows why trump treats you like he does. you usless POS. Done let the door hit you in the ass on the way out. if Canada doesnt want you, please dont come back","post_message":"Rosie O'Donnell just restarted an epic feud."},{"comment_id":"1487251671334957","commenter_b":"That bitch could stick her face in dough and make gorilla cookies !!","commenter_a":"No matter what she wears it looks like it came off the rack at Walmart and she looks like aunt Esther. The only problem is us taxpayers are paying the big bucks for her to look like a curtain hanging over a big black window","post_message":"I'm SICK of my hard-earned tax dollars funding their lavish lifestyles!"},{"comment_id":"1147558291982624","commenter_b":"@username like to talk shit behind a keyboard like a little bitch!","commenter_a":"White on white crime 👀","post_message":"Sick: 26 year old man gets caught trying to meet a 15 year old boy! #WSHH"},{"comment_id":"10153126746034071","commenter_b":"Girls, to get ahead, bare some skin. No lots of skin, get u some fillers and marry rich.","commenter_a":"Now imagine what Kim would say in 2020","post_message":"Michelle Obama had a powerful message for girls this week."},{"comment_id":"1640584582874588","commenter_b":"Arnel, stay away from my dog. Haaaaaaaaa!","commenter_a":"We should not reward liars... reject Hillary.","post_message":"“We should not reward people who use inflammatory rhetoric, who use the kind of derogatory comments, whether it's about Muslims, or Mexicans, or women, or people with disabilities, whoever it might be,” Hillary Clinton said, referring to Donald Trump. “That is not a sign of leadership. That's a sign of, you know, showmanship, of desperation, that should be rejected roundly by the American people.”"},{"comment_id":"1457021290993798","commenter_b":"Bullshit they need to put her ass in prison","commenter_a":"jesse doesn't want her next to him at the gallows","post_message":"But, but...I thought she was innocent, Jesse?"},{"comment_id":"10156256559580354","commenter_b":"Sure she will, and we will all be getting shot by the crazy people who get guns illegally","commenter_a":"And how many guards does she have!! And I bet we paying for them!!!!","post_message":"Hillary pledges her assault on 2nd Amendment freedoms."}]
