[{"comment_id":"785803421556302","commenter_b":"GREAT!!! MAKE HER LIVE BY OUR LAWS!!!","commenter_a":"Yes sir jail or take that crap off , its disrespectful !!!","post_message":"Judge Throws Muslim Woman In Jail For Refusing To Remove Headscarf In Court. If you can't obey our laws, you go to jail. Do you think she had this coming?"},{"comment_id":"1807222879565696","commenter_b":"This is the most disturbing thing , what a monster , someone needs to cut his intestines out while his mouths tied up","commenter_a":"I hope that scumbag get his f**king hands chopped off the f**king scumbag thing like that really makes me so made !!!!!!!!!","post_message":"Chinese man live-streams himself DISSECTING a puppy as revenge."},{"comment_id":"10153123506246770","commenter_b":"I have zero respect for someone who marries a low-IQ maid.","commenter_a":"But he is more concerned about foreigners who break our laws than citizens! See ya!","post_message":"Danny Diaz, campaign manager for Republican presidential candidate Jeb Bush, told The Daily Caller that Bush opposes abortion and would not promote it as president."},{"comment_id":"10154827367754197","commenter_b":"@username your a tart.","commenter_a":"Trump's ignorance is astounding. He should stop tweeting narcissistic nonsense and start reading the security briefings. We are the laughing stock of the world now that we elected a buffoon as president. God help us.","post_message":"Donald J. Trump is very upset with the United Nations after a recent vote. Read his comments on WFSB.com and the Channel 3 app. Then, tell us your thoughts on the statements by the president-elect."},{"comment_id":"474902102708278","commenter_b":"Suck a dick cnn","commenter_a":"The Dallas Police Officers were not killed by BLM members, but by an ex military man who was involved with ISIS! Pay attention!!! So much hate in this state. Disgusting. Thankful for the police protection here and their professional attitude. Stay safe all !","post_message":"We're in Phoenix, Arizona, where residents have gathered at City Hall to protest police violence and the recent shootings in Minnesota and Louisiana. (Source: CBS 5 AZ - KPHO/KTVK)"},{"comment_id":"693773307470374","commenter_b":"What a pig!!!","commenter_a":"Disgusting, just like his jackass friend! I guess that's how money talks.","post_message":"SPEECHLESS."},{"comment_id":"10153534802752217","commenter_b":"It's knowledge obviously. Go look up the definition of Asylum if you are that uneducated @username","commenter_a":"They are all migrants, NOT refugees if they didn't claim asylum in Greece or Turkey for that matter. Your reporter needs educating.","post_message":"More than 11,000 refugees and migrants are camped on the Greek side."}]
