[{"comment_id":"648235325326484","commenter_b":"She has! Wake up!","commenter_a":"Killary should release her tax papers too! She is a liar and a murderer!","post_message":"Yesterday, Hillary Clinton blasted Donald J. Trump in a heated speech on the economy. So now, Trump is firing back... hard: @webpagelink"},{"comment_id":"1809962622565411","commenter_b":"Yeah, they need to kill all of them. If only they would turn our troops loose, so they could get the job done.","commenter_a":"Go for it.","post_message":"U.S. Pilots Bomb ISIS, Killing 40 Jihadists. They need to be destroyed. Do you support our troops?"},{"comment_id":"579603902228604","commenter_b":"She must have morals","commenter_a":"Oh the horror of it all! Freedom of speech, freedom of choice, oh now we have her! Pathetic!","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"804935616266161","commenter_b":"will the ACLU take up a case for violation of free speech?","commenter_a":"Floridians voted for him. Too bad the smart ones got him too.","post_message":"Governor Rick Scott is committing political malpractice. Parts of Miami Beach are already sinking into the rising ocean. Read more here: @webpagelink Image by Occupy Democrats."},{"comment_id":"10153128633786323","commenter_b":"I think you're getting a bit sadistic Sanchita. \"Lowered into vats of acid\"? You should hear yourself. That's inhumane. They should be put in prison, like they already are. And women CAN rape, though sadly this country's rape legislation is inadequate when it comes to women-perpetrators. What about a woman-on-woman rape? Or when a woman in her 30s rapes a 13 year old boy?","commenter_a":"Stop demonising men","post_message":"“I began this film with a narrow focus: ‘Why do men rape?’ I discovered that the disease is a lack of respect for gender. It’s not just about a few rotten apples, it’s the barrel itself that is rotten.”"},{"comment_id":"584112685109576","commenter_b":"Nah that was Sanders @username. Hillary will lead us into an even more corporate America with a short economy and allow foreign threats to come in while the middle class die and Hillary and the elite get richer and richer.","commenter_a":"Clinton will lead us into corruption, loss of independence and freedo,... she will lead us into a socialist communist state bowing to russia and north korea. Vote Trump and save our future.","post_message":"If you've ever wondered what Hillary's like as a friend, you could ask Janelle."},{"comment_id":"10153649562025950","commenter_b":"Dan Haggerty could have prob saved both..... but hes dead now. that man loved animals .__.","commenter_a":"It should never even get to the point of having to kill an already endangered animal. The zoo failed this gorilla and the little boy.","post_message":"At one zoo, qualifications include gun-loading skills, twice-annual target-shooting tests and a drill that looks like this:"}]
