[{"comment_id":"10152835596391519","commenter_b":"This woman should have her vocal chords removed!!","commenter_a":"I like to go down to the beach and write naughty words on the back of crabs.","post_message":"Repulsive..."},{"comment_id":"959728980774046","commenter_b":"This is ridiculous ! We are a Christian based country . Muslims need to get the hell out and take their evil ideology with them ! NOW !","commenter_a":"YES !!!","post_message":"Obama Gave Millions To This Mosque In America, But Look Who Owns The Mosque This shows you exactly where his true allegiance lies. Do you think Obama is a traitor?"},{"comment_id":"10153657891231336","commenter_b":"Stupid old woman","commenter_a":"Keep her in jail until she resigns or issues marriage licenses!","post_message":"Kim Davis will be in jail at least a week, but she could stay longer if she continues to not obey the judge's order."},{"comment_id":"10152734752677434","commenter_b":"Lol","commenter_a":"Hmmmm I actually do think he's kinda sketchy re: women. If he's so power to the people, then where was he when Gore or Kerry ran? Just sayin","post_message":"Bernie Sanders wrote an essay in 1972 that mentions rape, and it's weird as hell"},{"comment_id":"844439005656552","commenter_b":"breaks my heart to see what my son and brother actually see. These people don't just mad out on red and green. When they see anything that has a red or green in it. They don't see it with the colors they can interpret. So nothing is as it should be. You need red to Make purple, purple doesn't appear the way the rest of us see it for them.","commenter_a":"Sylvain St-Arneault","post_message":"Watch people see color for the first time thanks to these high-tech glasses."},{"comment_id":"10152826020480927","commenter_b":"It;s simple sex, between a man and a woman burns calories.","commenter_a":"CRAZY","post_message":"Remember, these are your taxes at work."},{"comment_id":"516541241803803","commenter_b":"@username then you should stfu!!","commenter_a":"If he violated a voting law, he should go to jail! Oh, wait! He was a drug dealer, had people killed, is a rapist, lied under oath, sold military information to China,.... STILL WALKING FREE!","post_message":"Do you think Bill Clinton should go to jail for this?"}]
