[{"comment_id":"10153535750495667","commenter_b":"@username she is a horse","commenter_a":"She's still ugly and that will never change!","post_message":"Michelle Obama turned Friday the 13th into a fashionable affair."},{"comment_id":"1009873989035649","commenter_b":"Is this bitch right about anything she should go back into hiding","commenter_a":"FAIL!!!","post_message":"Joy Behar calls out Carly Fiorina. Is she right?"},{"comment_id":"817688164952017","commenter_b":"Chesimard is a scum pig who needs to be extradited back to NJ to finish her punishment.","commenter_a":"And they wonder why there is racism in American. They are the worst and the rest of us are reacting to this sort of crap and the disproportionate numbers of black's in prison. Clean up your own house first and quit committing crimes and we might actually start to listen. Until then FY.","post_message":"[Video] INSANE LIST OF DEMANDS BY BLACK COLLEGE STUDENTS Includes Naming College Hall After Notorious Cop Killer"},{"comment_id":"10153961752341037","commenter_b":"Duh, obamacare is funded by government (taxpayer dollars)","commenter_a":"If obamacare is so great, why is it that the clintons & sanders are not enrolled in it?","post_message":"Bernie Sanders airbrushed the complexities of trying to overhaul health care all over again and Hillary Clinton offered a selective reading of her rival's record on gun control in the latest Democratic presidential debate."},{"comment_id":"10154094997078132","commenter_b":"don't reproduce...","commenter_a":"Jus had my babies let me put my fake lashes in n do my makeup for the pic..","post_message":"The only thing keeping Jaeyln and Luis apart is a year."},{"comment_id":"1362884163768725","commenter_b":"A grown ass man, with a meme of a \"butthurt report\" ,shows the intelligents of trump supporters. Trump supporters and memes go hand and hand.","commenter_a":"I did not see any bitching when Obama was elected, all you cultural marxists can fill up your \"safe\" spaces and fill out butthurt reports, not that anyone cares for you snowflakes","post_message":"Whether you support trump, hate him, or don't care either way — you need to see this:"},{"comment_id":"10153951391170579","commenter_b":"We have millions of people on welfare because Illegals are doing the jobs they are qualified for...we can use guest workers legally if we need more workers...I don't see us the US needing them though","commenter_a":"The republicans are certainly changing their tune on immigration. But they have no choice. Nobody in their right mind believes that we can deport all illegal immigrants without devastating our economy and millions of families. Even Trump admitted that they could come right back, a weak attempt to lessen the blow of his ridiculous plan. Yet another win for Bernie Sanders, who has no need to flip on issues to garner support.","post_message":"Your takeaway from the 4th Republican Presidential Debate?"}]
