[{"comment_id":"912506822117747","commenter_b":"Grow up racist","commenter_a":"Thanks Fox, again you nailed it..","post_message":"Just when you thought #FoxNews couldn't get any crazier... @webpagelink From (Y) Counter Current News - MBD"},{"comment_id":"1523980264284296","commenter_b":"I love spinning when your winning !! #MAGA #GBA","commenter_a":"I love how this man thinks and his love for Ameirca. :)","post_message":"I think Donald J. Trump has every intention of revising how everything happens in Washington, in terms of how it happens, how fast it happens, the routes you take to make things happen. If I'm right, it's gonna be fun to watch 'cause people's heads are gonna be spinning trying to catch up with him."},{"comment_id":"1003970486337899","commenter_b":"Oh pls woman get a grip. Really if you think that then move your was out of this co","commenter_a":"She must be racist then to think that.","post_message":"Oprah Claims White People Are The Cause Of Racism In America. What a hypocrite, she is the racist. Do you think Oprah is bigot?"},{"comment_id":"1204291722963907","commenter_b":"and as I assume the majority of their passengers are muslims - then they are providing them information that they require - AND - is harmless","commenter_a":"What kind of prayer? I've flown Royal Brunei Airways twice so far. Before the plane takes off, a Muslim prayer ist shown on the monitors and during the flight the direction towards Mekka is shown and not the plane's position!","post_message":"A passenger saw a WhatsApp message about 'prayer' and feared he was a terrorist"},{"comment_id":"10153563127821680","commenter_b":"Gotta love how she tries to spin this. No other SOS ever had a orivate, unsecured server in their house. Morning Joe shows her lie repeatedly. @webpagelink She needs to drop out. Even Politifact.com found her statement to be a lie. @webpagelink/ #NeverHillary #BernieOrBust","commenter_a":"I lied and I'm going to lie some more.. Hillary2016","post_message":"\"There may be reports that come out, but nothing has changed,\" Hillary Clinton said. \"It's the same story.\" Read more: politi.co/1P0pUQK"},{"comment_id":"10156504920260389","commenter_b":"Yes. Keep replying on this joke of a feed.","commenter_a":"Do we expect Sheriff Clarke to say anything different. Why doesn't Mr. Hannity ever have some real dialogue on his show. I would have more respect for him. I have been following Mr. Hannity for about 10 years now. His revolution is taking forever. I don't think it will ever come. if Mr. Trump is elected is that the revolution. Senator Cruz is the only true Conservative. But in today's world conservatism means unyielding which is not a good thing. President Reagan would be turning over in his grave if he saw what was happening to the conservative movement in our country today","post_message":"Milwaukee County Sheriff David A. Clarke Jr. had some strong words on \"Hannity\" tonight for President Obama, Hillary Clinton and the Democratic Party in the wake of Obama announcing his planned executive action on gun control."},{"comment_id":"10154066489172994","commenter_b":"Can I suggest a clip?","commenter_a":"Beyond a reasonable doubt. They have him , his gun, and a half dozen witnesses; he even pleaded the 5th. go figure. He wouldn't even get a chance to pray with me. One BULLET to his head, ok , 2 , just to make sure.","post_message":"Body found in a burned-out house in Detroit confirmed to be the mother of the missing 4-year-old girl -- the subject of the Amber Alert sent out this weekend. Police said the injuries were so severe to the second body thought to belong to the daughter that a positive ID could not yet be made. @webpagelink"}]
