[{"comment_id":"10153042580654411","commenter_b":"What a bitch ^^","commenter_a":"I condemn whatever happened in Paris and whoever did it wasn't a human for sure. But this is a shame. They kinda provoking people to do stupid stuff and it's like fuel on the fire. Shame on Charlie Hebdo","post_message":"'We will not give up, otherwise all of this will not have any sense.'"},{"comment_id":"10153190279501336","commenter_b":"Haha!","commenter_a":"Oh Lord, they'll hug the bark off the tree over this","post_message":"Fifteen buffalo who escaped an upstate New York farm have been shot and killed."},{"comment_id":"10154392424871130","commenter_b":"She has always been irrelevant!","commenter_a":"She is a Kellyanne wannabe. Open mouth, speak without thinking, non-stop, digressing, interrupting and not letting anyone else start or finish a thought. Hopefully very soon all of these people will be irrelevant.","post_message":"Mazel tov for (unintentionally) making us laugh before the election."},{"comment_id":"1102034899855986","commenter_b":"You all want a Muslim hater so kinda breaks out even don't you think?","commenter_a":"Fuck 'em.","post_message":"American Islamophobes are beside themselves because human rights activist Sadiq Khan was elected mayor of London."},{"comment_id":"10156861000555725","commenter_b":"No more stuffed-shirt limp-wristed men who talk to us in carefully chosen PC correct words .... We need a real man to take control of our country and return us to our glory days! AMERICA FIRST - EVERYONE ELSE IS A DISTANT SECOND ...... #TRUMP2016!!","commenter_a":"Why would anyone believe Breitbart after they made a business deal to screw one of their own?","post_message":"WOW! An honor to be the first-ever presidential candidate in a primary- to be endorsed by the National Border Patrol Council. WE WILL BUILD THE WALL-- WE WILL MAKE AMERICA SAFE AGAIN! Thank you."},{"comment_id":"1194913097195385","commenter_b":"shame on you that is racist and you being irish you would under stand that do not be like that sarah","commenter_a":"I know his brother Mr Poopoo !","post_message":"Chinese officials detained Ai Weiwei for 81 days and seized his travel documents in 2011, charging him with tax evasion, an accusation he has long denied."},{"comment_id":"10152995708842217","commenter_b":"Really perhaps one glass too many some would say Suspicious.....","commenter_a":"Aww 😢💔 poor Cilla..","post_message":"She was sunbathing at her Spanish home when she she stood up, lost her balance and fell"}]
