[{"comment_id":"10153045402661336","commenter_b":"Shut up idiot!!!!","commenter_a":"Early Bird gets the cage","post_message":"A Georgia sanitation worker has been sentenced to 30 days in jail for picking up trash too early in the morning."},{"comment_id":"10153255366409205","commenter_b":"You still had a chance to recognize the genders and learned from them, yes you are lucky that child is not!","commenter_a":"Justice! How about the child? Without father and stock at the house with 2 mothers? What kind of justice is this. Most of us grow up with family mother and father on site and easy for u to say is justified!","post_message":"JUSTICE! Lesbian Couple Gets Their Child Back"},{"comment_id":"10154476724188352","commenter_b":"On God I'll beat this hoe up!! Sick twisted bitch","commenter_a":"Wth","post_message":"Toddlers found chained up in Texas yard covered in hundreds of wounds are now in an 'excellent' foster home and are 'eating like they have never seen food before'"},{"comment_id":"10155284668713268","commenter_b":"Who the fuck cares, did it have anything to do with this country?","commenter_a":"How long before he has a stroke a day realizes he is being uaed","post_message":"\"This is a direct attack on [Pres. Trump's] policies and her [Ivanka Trump's] name,\" Press Sec. Spicer said on Weds. regarding Nordstrom's decision to drop Ivanka Trump's fashion line. @webpagelink"},{"comment_id":"10155487456986509","commenter_b":"Hillary is a baby killer.","commenter_a":"He was completely right on everything he called a disaster. The biggest disaster of all was the video proving that she and her campaign incited the violence at his rallies. Perhaps using the word rigged is an oversimplification, but for Christ's sake, she's guilty if inciting riotous behavior. Vote Trump, as middle finger to the corruption in government.","post_message":"- Aleppo - Hillary Clinton's tax plan - Obamacare ...and more things that Donald J. Trump called a \"disaster\" at the final #debate. @webpagelink"},{"comment_id":"10154139350608132","commenter_b":"She needs her original face back. She looks just like thousands of other women who have paid to look like Jack Nicholson's version of The Joker.","commenter_a":"For the love of God, someone give her a sandwich...stat!","post_message":"Patrick Dempsey's plans for divorce are now off the table."},{"comment_id":"10156548921815725","commenter_b":"Shameless lady you are shameless","commenter_a":"Can you only imagine this family in the white house! WOW They will bring back the class that our first family has been missing for the past 8 years.","post_message":"Thank you Ivanka Trump for the kind words. I am very proud of the role model you are for so many."}]
