[{"comment_id":"10153365455244087","commenter_b":"@username , that is BULLSHIT! They purchased the assault rifles they used IN CALIFORNIA!","commenter_a":"No one has lost any rights to guns under Obama. No one has had any guns taken away under Obama. If ONLY the right wing could learn to try to GOVERN instead of just doing things that appeal to their right wing base, that would be just great!","post_message":"“Coming in the wake of the terror attack here in Paris, this horrific murder underscores we are at a time of war,” Sen. Ted Cruz said yesterday. “Whether or not the current administration realizes it or is willing to acknowledge it, our enemies are at war with us.\""},{"comment_id":"853169931483995","commenter_b":"The article isnt dissing Melania, it's reflecting on a direct quote where Trump said giving Ivanna control of a business property was the end of his marriage, and he learned he didn't want a wife who was ambitious, who worked, because that meant she didn't focus 100% on him. Which is sexist af. But he wants his daughter to be an Ivanna, so ... also hypocritical. Should women be successful in business or not, according to Trump? Are successful woman attractive to men like Trump. Read the article, it's not made up.","commenter_a":"Such an interesting article Christine Johnson!!! I find it all fascinating, will be so interesting to be around in Nov - when the country decides! Hope to see u tomorrow? Ax","post_message":"The Trump family embodies a very old sexist hypocrisy: men who want one thing for their wives and another for their children. Read in The New York Times Opinion Section."},{"comment_id":"515781365279110","commenter_b":"I wouldn't give any fucking nigger s dime fuck them blue gum peace of shit","commenter_a":"No way! It has been so long it did not personally affect them. Get over it, and move on.","post_message":"This state just approved a resolution which will require residents to compensate blacks for slavery. Everybody is looking for a handout. Slavery has been abolished for a long time. Do you think you should be required to compensate blacks for slavery?"},{"comment_id":"10153604901701167","commenter_b":"Either way she doesn't have a dick anymore.","commenter_a":"Right. Sexual predators never pretend to be transgender to gain access to women they wouldn't have as a man. Never! Umm....errr.... @webpagelink","post_message":"A man has never pretended to be transgender to sneak into a women's restroom. It's just not a problem that exists."},{"comment_id":"468369446686969","commenter_b":"I believe these things are available in Africa where they can be real African's.","commenter_a":"We already know, they want to sit home doing nothing mooching on working people, make love and have babies to get more government checks, and get fried on dope.","post_message":"An all black student group, 'Being Black', is threatening violence if their demands are not met. We're tired of Al Sharpton, Eric Holder, and Obama's race baiting! Who agrees?"},{"comment_id":"10155804568635725","commenter_b":"Tell Andre ignorant ass to just go kill himself!! You never hit a girl you shine!","commenter_a":"Lmao attacking him?? it's a Football f**** player against a girl. Did u not see how she threw that punch lmao how is a grown ass man/athlete gonna look w that argument on court?? Lol and why didn't he leave her alone after she seemed to push him away?? Cuz she said the N word!!! Ha so it all makes sense now!!! Oh my god someone bring the guillotine!!! Not the N word!! Bring all the rappers too!!! This is an injustice!!! Lol","post_message":"Florida State University quarterback De'Andre Johnson is telling his side of the story of the now-viral video where he is seen punching a woman in the face at a campus bar, including what he says the woman said to him right before the attack ----> @webpagelink"},{"comment_id":"10153956818033967","commenter_b":"I rolled mine back to Windows 8.1, 10 is worse than Vista.","commenter_a":"Step one....reinstall Windows 7","post_message":"Unleash the power of Windows."}]
