[{"comment_id":"971472706302942","commenter_b":"That's where she belongs! That's where she belongs! That's where she belongs! That's where she belongs! LOCK HER UP!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"More Wikileaks revelations: 1) Ted Cruz allegedly asked the DNC for MONEY to help fund his delegate fight in Cleveland (specifically: Eric Bennett to and from Ken Cuccinelli, R-Virginia working with Ted Cruz and the DNC to undermine the delegate selection before the convention). Working to push through rules changes in the rules committee and working to flip bound delegates against the rules and state law. All co-ordinated with the DNC. 2) Jake Tapper of CNN allegedly colluded with the DNC. They gave him questions to ask his interview guests. 3) Chuck Todd of NBC allegedly was also colluding with the DNC and put pressure on others at the network to go easy on Democrats at the DNC’s request. 4) The New York Times allegedly co hosted parties with the DNC. This is against the law. 5) Hillary Clinton allegedly setup a slush fund through the DNC to launder donor ...","post_message":"Live Now: Jesse Watters and Brian Kilmeade are here at the Facebook Live Lounge from the Democratic National Convention and they're taking your questions! Comment below:"},{"comment_id":"10152844746900667","commenter_b":"Gross looking. Many times, less is more.","commenter_a":"Ugly colors.","post_message":"\"Beautiful things happen when you take pride in yourself. #blackgirlsrock #kyebreaktheinternet,\" the prom queen wrote."},{"comment_id":"625393104287939","commenter_b":"She is NOT too smart!!!!","commenter_a":"Enemy of the Republic right there people.","post_message":"Pentagon Officials Furious After Clinton Announces US Response Time for Nuclear Launch During Debate @webpagelink"},{"comment_id":"473987716059156","commenter_b":"If MUSLIMS want kids to learn about Islam they should move back to the HELL HOLE they came from. In America we believe in separation of religion and state.","commenter_a":"all our schools should ask God back in to their teachings","post_message":"Muslims are up in arms about this new bill affecting religion in schools in Tennessee. I wonder how far they'll challenge it."},{"comment_id":"10155086092991509","commenter_b":"They even rape cows over there... And they think cows are Gods. It's weird.","commenter_a":"India has one of the worst rape problems in the whole world, honestly if you're a woman going out after dark there it's almost a sure thing that you will get raped","post_message":"The suspect was reportedly out on bail while he awaited trial for his first rape of the teenage girl."},{"comment_id":"773502486092553","commenter_b":"The profit mohammad is a pedophile goat raping POS.","commenter_a":"Even Hitler would hate Obama.","post_message":"OBAMA THROAT: FOLLOW ISLAMIC MONEY? If you look into Obama’s foreign student status the subject is quite involved. It is not just if he was a foreign student, but was he an American posing as a foreign student? Is Obama an American that received funding from foreigners? Did he just get student loans and work hard? Is Obama keeping his records confidential to cover something even bigger than Obama himself? Ask yourself this question, would opening up Obama’s Harvard records cause people to closely examine the influence of oil rich Arabs that may want to impose Islam on the United States? In 1979 Vernon Jarrett, father in law of Valerie Jarrett, wrote about expecting Arabs to help disadvantaged black students. Khalid Abdullah Tariq Al-Mansour, formerly known as Donald Warden, had apparently been working with “rich Arab kingdoms” for this very purpose. Jarrett insisted that this is coming. @webpagelink So a ..."},{"comment_id":"10153096865294614","commenter_b":"Adorable, precious, blessed by God! What a wonderful father & lucky to have this special little boy in his life! That woman is disgusting & I agree with another comment that she should have her tubes severed forever & never be allowed to have a child, not even adopted!","commenter_a":"Thank you everybody for sharing all the beautiful pictures of your wonderful and special family members, they are truly a blessing on this earth. I work in an Adult Foster Care home and we have cared for Downs Syndrome of all ages. Due to rapid decline in health recently, two of my special guys have left this earth to be angels. I cannot explain the special spark that they put in my heart when I was with them. I will never understand how people can be so heartless. God Bless Leo and his amazing father!","post_message":"After this baby mom abandoned him because he was born with Down syndrome, his father stepped in to raise the son he calls and as a single dad. Leo Forrest was born in Armenia last month. Upon learning of the genetic condition, his mother and her family gave up on the child. They also told Samuel Forest he would no longer be welcome in their home if they decided to keep him, according to a GoFundMe page set up to help Forrest and the baby. Faced with a difficult choice -- his wife or his infant son the new father chose Leo. She has since filed for divorce, he says. Forrest is returning to Auckland, New Zealand, where he is originally from, to raise the baby. Read KTLA story here: @webpagelink"}]
