[{"comment_id":"10153197426077377","commenter_b":"I like you Ted but I want the migrants to assimilate into the US and the simple fact is the migrants from Mexico and Central and South America do that very well... we are them and they are us... get string borders but work out something so those that are hardworking people who make our country a better place can stay.","commenter_a":"Canada Cruz is an Amnesty supporter.","post_message":"Ted Cruz — \"I think Jeb Bush has been very honest, he's been very candid about his support for amnesty.\""},{"comment_id":"1154135184625068","commenter_b":"@username,get that trailer cleaned up woman!","commenter_a":"Fake","post_message":"\"Donald Trump’s birther event is the greatest trick he’s ever pulled\""},{"comment_id":"10153122245742377","commenter_b":"Ford didn't take any bail out money yet it is thriving.","commenter_a":"Bankruptcy isn't illegal or immoral, unlike some of Rubio's financial issues. And he never filed for personal bankruptcy, it was a few of his companies out of a thousand. He's a billionaire, yet Rubio has trouble paying credit cards. Truly Rubio doesn't want to go down this path with Trump.","post_message":"Rubio and Trump trade trash talk on finances."},{"comment_id":"10153649665288352","commenter_b":"Also he still has a dick so HE is still a man. No woman has a dick and balls","commenter_a":"Kylie is the insensitive one for calling Catilyn her DAD ...","post_message":"KYLIE JENNER CHECKS CHRIS BROWN OVER HIS POST ABOUT HER DAD"},{"comment_id":"1275473112509215","commenter_b":"#GrabThemByThePussy #MakingSexualAssaultGreatAgain","commenter_a":"Deplorables say don't judge Trump for something he did ten years ago yet they keep bringing up something Bill Clinton did 20 years ago. Deplorables say Hillary is an enabler for standing by her cheating husband.... But Melania is a good wife for standing by her twice divorced husband who cheated on her while she was pregnant? Hypocrisy is the running mate of Donald Trump. And sexual assault. Don't forget that. #GrabThemByThePu$$y #MakeSexualAssaultGreatAgain","post_message":"\"Everyone knows how bright she is and how resilient she is, but...they're going to see how much she cares.\" —Joe Biden"},{"comment_id":"10154035810956130","commenter_b":"I just see this on my feed that's sort of dress I wear to a nightclub in Not gonna put her down as i hate bitchness but maybe she could of gone with something little more elegant and saved this dress for a night out","commenter_a":"Before I read it I'm going to take a guess and say it was other women who were \"shaming\" her Oh I was right, although I wasn't surprised. Said it a thousand times. Women's biggest critics and women themselves.","post_message":"It's unfortunate that women can face sexist backlash from other women."},{"comment_id":"10152847056142411","commenter_b":"Bill","commenter_a":"Its because Chicago is ran by a bunch of idiots.","post_message":"Have you ever witnessed a utility company ripping up a street or sidewalk that had recently been repaved? Chicago has a department that's supposed to coordinate schedules between the city and utilities. But it's not working as well as it should - and that means taxpayer money is being wasted. Dan Ponce reports: @webpagelink"}]
