[{"comment_id":"10153659271788132","commenter_b":"Hope they keep her in prison for life!","commenter_a":"White trash!","post_message":"Awful."},{"comment_id":"10154138321738837","commenter_b":"I read she was with the lady already in line she just had more items for her. She did'nt skip the line. That racist pos was out of line enough said! Pendeja!!!!!","commenter_a":"Realistically speaking if you're with someone and they're at the counter cashing out who's going to go to the back of the line if they were \"Together\" and you're only adding an item or two?? saying she should have went to the back of the line is both irrational and impractical... part of the problem is making excuses for the inexcusable...","post_message":"#RACIST RANT RECORDED: A woman's Tuesday night racist rant while Christmas shopping goes viral on social media."},{"comment_id":"10153618006223721","commenter_b":"But it all depends on your reason to carry. Most women who would carry a knife in their bra wouldn't need it because they can normally defend themselves better than most blokes.","commenter_a":"One more place to put my knife! Sweet. Sometimes I like to carry a couple, one in the pocket, one on the necklace and now a surprise bobbie blade heck yes! Though this was certainly a man's idea as no woman would go \"lets put something sharp next to my breasts and have it not be an underwire. This is going to be a selling point for women's active wear.\" When in the high thigh sheath for when I wear a mini skirt coming out? Not all skirts have pockets you know.","post_message":"Activewear with an extra punch. (via Glamour)"},{"comment_id":"10154007566964091","commenter_b":"Sick women..","commenter_a":"Something is really wrong with this world.","post_message":"The mom claims she and her daughter \"hit it off.\" She lost custody of her children when they were young, and had only recently reconnected with her."},{"comment_id":"10154242791701636","commenter_b":"No, she should've registered as a job-seeker in Denmark and get the about 800 per month she has the rights to get as an EU citizen","commenter_a":"Begging is unlawful but how about poverty ? Should she just let herself die ? How crazy is that...this is a sick world we live in","post_message":"For the first time ever"},{"comment_id":"10153924277776130","commenter_b":"These girls are still relevant? Lol","commenter_a":"Can't get crack online","post_message":"Um ... what!?"},{"comment_id":"952967998077006","commenter_b":"Ahhhh...NOOOOOOO! AMERICA WILL NEVER!","commenter_a":"I'm paying less thanks obamacare!","post_message":"Republicans won't ever admit the success of Obamacare. As with all of the Presidents winning policies, they prefer to ignore facts and spread lies."}]
