[{"comment_id":"970408816303922","commenter_b":"John, women don't care what you think is acceptable. Abortion is a legal medical procedure. Women don't need your approval, your acceptance, or your opinion. Do you expect women you've never met to weigh in on your private medical decisions? Of course not! Stop being so arrogant. What isn't acceptable is your flawed thinking that you can control a woman. You can only control yourself.","commenter_a":"\"Birth control\" is a misnomer. If one thinks about it, it signifies controlling an already conceived being. Therefore, i do not embrace birth control. Like stopping birth. I do embrace control prior to the embryo attaching itself to the wall of the uterus. We need to find a name for that.","post_message":"How you REALLY stop unintended pregnancies."},{"comment_id":"10154444403041337","commenter_b":"Yeah IF you were, possibly. But you're not. You're just a shit talking bitch who hides on FB and acts tough. Again, you impress no one. Go fuck yourself.","commenter_a":"Everyone on here that's against Chris kyle show some respect I come from a marine family and by God if they heard the negativity about this legend a urban war would uprise show some respect ppl","post_message":"CHANGING HISTORY? American Sniper Chris Kyle's record has officially been changed..."},{"comment_id":"1159977814023228","commenter_b":"\"It's not what you think, really\"","commenter_a":"Nåt är fel??","post_message":"Uh-oh."},{"comment_id":"667865053404073","commenter_b":"No! She's a witch and that's her night out!","commenter_a":"She's a joke!!","post_message":"Michelle Obama wants to destroy Halloween for kids across America. There is no chance that we will let her take Halloween away from our kids. Do you think Michelle Obama is a joke?"},{"comment_id":"1508488155837876","commenter_b":"Kelli Foltz-Daniels the Bkacks","commenter_a":"Because Latinos live off the welfare system. When you start talking jobs, they tend to get pissed off thinking your gonna take away their government funds","post_message":"Nearly 80 percent of Latinos have a negative opinion of Trump."},{"comment_id":"10154627182156509","commenter_b":"287877634908162s, as a native (Blackfoot) I encourage you to stay out of 'our' business. Immigrant......","commenter_a":"Does @username cares even a bit about Sanders? All this channel talks about is Donald Trump.","post_message":"This is the decade when Donald J. Trump thinks America was great."},{"comment_id":"1362078013830431","commenter_b":"Cruz....Kiss that ass.","commenter_a":"Mr. President, Please do not squander this opportunity to put a conservative in the Supreme Court. This is extremely important, we do not need someone who's going to be a straddle of the fence. We have too much anti-American government, anti-Constitution battering happening inside our nations capital and a crossed our nation, we cannot afford to make evening a half step in the wrong direction. Please Mr. President I implore you to please hear my request, my plea.","post_message":"Ted Cruz NAILS it, everyone needs to see this!"}]
