[{"comment_id":"10152976962214205","commenter_b":"Yea, you're right. My comment is stupid, cause it was meant to be. And all you idiots commenting on my stupid comment as if I'm serious lol What's even more ridiculous is \"the police have to do their jobs\". So that's why some ppl get Burger King and walked out of a building (when they've killed 9ppl) and other ppl get choked to death for selling loose cigs, or get shot to death on site for having a toy gun (a 12 year old btw). Or others mysteriously die by being shot in the back while cuffed and in the back of a cop car. Yea cops totally just doing their job by the books. So yea, thanks for \"proving\" me wrong on a comment that was clearly not serious to begin with. You butthurt idiots can shut your dick holsters and relax.","commenter_a":"Prolly told him \"good job son, you played your role perfectly. You did a good job as patsy for your government. Now here's your complimentary Burger King as promised.\"","post_message":"Did you know the cops bought Dylann Roof Burger King AFTER they arrested him? WTF?!"},{"comment_id":"10153323760987994","commenter_b":"They are puppy mill dogs. They over breed these poor dogs and none of them ever see a vet...so the puppies are that are born are just as unhealthy....","commenter_a":"I purchased two kittens from there and 1 died within 24hrs, they told me \"bring it back and I'll replace it\", they gave me another one and it died 2 days later along with the other one","post_message":"A Mount Clemens pet store is being sued by nearly a dozen customers."},{"comment_id":"1036357393060980","commenter_b":"Criminals are cowards and go for easy prey. Doubt one is going pick a fight with someone who will shoot back. Use your head Raymond","commenter_a":"Welp, the criminals will know who to shoot first.","post_message":"AROUND TEXAS: The Texas Senate gave preliminary approval Monday to a measure that would make the Lone Star State the largest in the country to allow licensed open carry of handguns. Would you support the right to openly carry in Texas? MORE ---> @webpagelink"},{"comment_id":"10153315723671336","commenter_b":"God's hands sand feet here on earth. Do it for the least of these","commenter_a":"This is an American.","post_message":"Since Christmas, 28-year-old Nic Martinez has traveled along the East Coast in a 25-foot trailer re-fitted as a barbershop. Along the way, he stops and cuts hair for veterans and the homeless. #ProudAmerican"},{"comment_id":"1305722922778581","commenter_b":"Sean Connolly","commenter_a":"Logan Laybolt","post_message":"Tian Tian the panda enjoyed the snow this morning! Video via the Smithsonian’s National Zoo and Conservation Biology Institute"},{"comment_id":"507285912795322","commenter_b":"God will show his hand and these creatures will be taken away to their doom.","commenter_a":"Take off the masks ladies!","post_message":"ISIS just made a huge move against America. This is unacceptable. Spread this post, we need to fight back. Do you agree ISIS should be wiped off the Earth?"},{"comment_id":"1324418074301084","commenter_b":"And his nephew is married to Chelsea Clinton.","commenter_a":"This EVIL, sob needs something to happen to him, and take him out of his misery. As long as he is around ,this Idiot will keep causing trouble. He needs to go away forever.","post_message":"Take a look at the list... You will be shocked at some of the names on it!"}]
