[{"comment_id":"10154719758246729","commenter_b":"It's Kommiefornia. What do you expext! The same state that protects murdering illegals and ignores the FEDS!","commenter_a":"Yes, the word conceal is not used, however to bear arms is, so I guess we must be back to open carry, a 45 on every hip. I hope you don't mind if I should play the Rifleman as Chuck Connors can not.","post_message":"\"Shall not be infringed,\" right? Wrong."},{"comment_id":"1281672095204357","commenter_b":"Yep, in with the younger roaring lion, out with the old senile evil slimy snake.","commenter_a":"I hope he can get Congress to kick them out of NYC. That building would make a remarkable place to house and care for our vets and homeless. That would save us so much money. The UN is not needed for us. No one I know wants to belong to a One World Order and governance. Let them move somewhere in Europe and take Soros with them.","post_message":"This is going to be good..."},{"comment_id":"10152734752671051","commenter_b":"Unbelievable! some women should not children and she is one. Discipline begins at home.","commenter_a":"Needs a good ole fashion spankin.","post_message":"This 11-year-old boy is responsible for a fifth of the crime in his town – and his mother knows exactly who to blame for that."},{"comment_id":"10155295844155354","commenter_b":"And you should get absolutely NOTHING if you are here illegally.","commenter_a":"If you did not go through the proper legal channels to enter this country, you are illegal and your ass should be deported!","post_message":"NYC's New Illegal Alien ID Program Includes Free Membership to 33 Top NY Venues, Including the Metropolitan Museum of Art."},{"comment_id":"10152851523876680","commenter_b":"Exactly. Just because he is being observed by being a dad doesnt mean anything negative. Bush wasnt...why? Because his daughters were already grown no reason to be.","commenter_a":"Still have no clue why all of the media treat the Obamas like some sort of Kardashian reality tv celebrities. Sick!","post_message":"Barack Obama drives a bumper car with Sasha Obama, who turned 14 today, at the Iowa State Fair in August 2007."},{"comment_id":"860890883954153","commenter_b":"Goons On Parade!","commenter_a":"You weren't put there to be \"kinder, gentler\" When are you folks going to get the message!","post_message":"New Senate Majority Leader Mitch McConnell (R-Ky.) is indicating he’ll attempt to steer his party in a benign direction as his leadership style helps shape public perceptions of the GOP — and its presidential nominee’s chances — heading into the 2016 election cycle. @webpagelink"},{"comment_id":"824287517608590","commenter_b":"Let's go get em Ron. Steve is on his way to pick you up with mike bike","commenter_a":"I knew it!","post_message":"Well..."}]
