[{"comment_id":"10154959476789411","commenter_b":"@username president Melania Trump after Pence. Lollll","commenter_a":"\"Psychologists tell us that 3 and 4 year olds often lie to get their way because they don’t have a moral understanding of the importance of telling the truth. 4 and 5 year olds often bully other children because bullying is a way of asserting their dominance and making themselves feel more secure in a world that is beginning to seem very scary. 5 and 6 year olds are often thin-skinned and vindictive toward peers who criticize or make fun of them because they are at a stage when they have exaggerated concerns about the opinions of others toward them. 6 and 7 year olds are often excessively narcissistic because they don’t understand their place in the world and haven’t yet developed the moral capacity for empathy. It follows that Donald Trump’s emotional age is somewhere between 3 and 7. Assuming that the Electoral College makes him President on December ...","post_message":"Unlike most presidents, Carter has refused to let his successors do the job they were elected to do. On Jan. 20, he will be pushed aside by Obama."},{"comment_id":"950334638377899","commenter_b":"Put this bitch in jail","commenter_a":"Clinton should be in Jail.","post_message":"Hillary Clinton says the Republican party's hatred for President Obama crosses political lines and is simply disrespectful. Do you agree with her?"},{"comment_id":"1036357393060980","commenter_b":"Criminals are cowards and go for easy prey. Doubt one is going pick a fight with someone who will shoot back. Use your head Raymond","commenter_a":"Welp, the criminals will know who to shoot first.","post_message":"AROUND TEXAS: The Texas Senate gave preliminary approval Monday to a measure that would make the Lone Star State the largest in the country to allow licensed open carry of handguns. Would you support the right to openly carry in Texas? MORE ---> @webpagelink"},{"comment_id":"10157706187460354","commenter_b":"She was a joke","commenter_a":"Thud... Rolling stumble... Face plant. \"Humph, that pit of lies I just tripped on was not clearly marked.\"","post_message":"Did you HEAR what Hillary said at the Commander-in-Chief Forum?!"},{"comment_id":"10158316177600725","commenter_b":"So who was the \"Grown-UP\" the past eight years? We have had the most un-American couple in the White House, so glad to see them go! (It's a shame they will still be in the country.)","commenter_a":"Definitely need a growth up and not a coward. Glad we finally will have one that fits both","post_message":"In one of her final interviews as first lady, Michelle Obama revealed just how much the election has reshaped her view of her husband's administration."},{"comment_id":"1100615946681704","commenter_b":"@username I am very well aware of anything involving Trump or Hillary. I have kept myself very informed for years. Information he gained while being social with the Clinton's is exactly the information he needed to make his decision to run for President. She is corrupt. Period.","commenter_a":"There is a prayer movement sweeping across the country for Donald Trump. More and more roadblocks are popping up to stop him. If he is your choice, please share a prayer at 10 am and 7 pm that God will take him to the presidency. Feel free to share this post.","post_message":"Wow... he really said it! @webpagelink"},{"comment_id":"10153727750436336","commenter_b":"You do realize that without spiders the world would be overrun with bugs which do a lot of damage to the earth if not contained","commenter_a":"This happened to me before when I was a kid, I was riding my bike branch hit me by my ear. Felt something weird went to the bathroom spider came out half way to say \"hi\" then went back in when I screamed for mommy. Went to the doctors then I lay down and the spider came out itself! And yes I killed it with my bare hands!!","post_message":"Each attempt doctors made to remove the spider caused it to react violently, but they eventually were able to subdue the insect with medicine and pull it out with tweezers."}]
