[{"comment_id":"10154308698454607","commenter_b":"Do these liberal protesters have jobs!!!!!!","commenter_a":"The US is being ridiculed by idiotic liberals who are obviously clueless on what President Trump is doing, protecting Americans!!! I live less than 20 miles away from that radical Islamic terrorist attack in San Bernardino, where 14 innocent people were murdered!! It's not Trump's fault that our government is so corrupted and does not have an immigration accountability system to know who exactly is entering our country! There are Isis training camps all over the United States! If you don't believe me Google it!!! There is an Islamic training camp less than 10 miles away. They are spreading like a disease everywhere! Last year local law enforcement caught 16 radical Islamic Muslims training near the a river bed all of them had AK-47's!!! All of them are now being investigated by FBI! 5 of which are on the top 10 most wanted list!!! Do you want to know why ...","post_message":""},{"comment_id":"10155247657250294","commenter_b":"Flush her down the toilet","commenter_a":"So very sad.","post_message":"When she was told she couldn't board the plane, police say a Florida woman did the unthinkable."},{"comment_id":"10153344961531336","commenter_b":"With the negros and the muslims,America is done.","commenter_a":"Someone \"finally\" says that they noticed the male charging up to the officer put his hand behind his back! Was that officer supposed to \"WAIT\" & see if the guy had a gun ??Plus,we DON'T know what he said to the officer! Don't be idiots & think the officer shouldn't be ready to protect himself just because \"THEY WERE TEEN AGERS\"!!!! AND IT ALL GOES BACK TO...\"LISTEN & DO WHAT THE OFFICERS SAY\" INSTEAD OF THINKING YOU'RE \"ABOVE THE LAW\".......","post_message":"JUST IN: Cpl. Eric Casebolt has resigned from the McKinney Police Department after almost 10 years on the force. His resignation was confirmed by his attorney, Jane Bishkin of Dallas."},{"comment_id":"757206074401067","commenter_b":"Go suck off another jihadi, Dilosh asshoIe.","commenter_a":"How can you go into someone else's land. Occupy it, then claim self defence when a 16 year old kid attacks. Isn't he the one doing self defence since its you that on his land?","post_message":""},{"comment_id":"1674844459456494","commenter_b":"Mary Taylor i would have punched the bitch","commenter_a":"Prime example of a child who is never disciplined!!! Always got there way if I throw big enough fit !!!!! Afulenza child !!!!","post_message":"WHO DOES SHE THINK SHE IS?"},{"comment_id":"821899111236478","commenter_b":"My wife would have really liked you","commenter_a":"I believe in god, i believe there is something good and benevolent surrounding all of the miracles of life....... I believe we all have a connection to god, and that means every, single, last, one of us........ No matter what race, color, sexual orientation, or faith. I refuse to believe god (a being of pure benevolence) would ever discriminate....... I believe god is the personification of good in people.... If you are gay, atheist, and black, and are someone who does good, you are far closer to god than someone who is straight, catholic, and white and spend your life discriminating and spreading hatred to those around you..... It's time to grow up, to live and let live, and to try to lead a life of compassion and understanding rather than judgement and contempt. People will be different, but people with good souls, deep inside, are always aligned, we are ...","post_message":"Share if you agree. Image by Occupy Democrats"},{"comment_id":"10157136269005354","commenter_b":"Her brother got the gold mine, and we got the shaft. They all knew that, I think these Washington creeps all shared the pot.","commenter_a":"Restore coal mining, open the pipeline, open oil drilling on public lands, and make America Energy independent.","post_message":"****HILLARY CLINTON'S BROTHER BAGGED A GOLD MINE IN HAITI, AND HILLARY GAVE AMERICAN COAL WORKERS THE SHAFT****"}]
