[{"comment_id":"1025513424232102","commenter_b":"THAT BITCH NEVER HAD A MIND","commenter_a":"Who's gives a fling f--k what these assholes say .nobody watches that so called show anyway.get ready to pack bitch","post_message":"I think I can see steam coming from her ears! @webpagelink"},{"comment_id":"10153492061886337","commenter_b":"Probation and a fine is all she may get. Prison you can't be that ignorant!","commenter_a":"This lady is an idiot, commited at least 3 different Federal Felonies... lol dumb broad. Well there's no Rebel flag in prison so she will be happy.","post_message":"GET TO KNOW Bree Newsome, the woman who climbed the flagpole at South Carolina's capitol building and took down the confederate flag..."},{"comment_id":"10153913587481341","commenter_b":"@username The fact is Israel is the nation of Israel since the time of David , Palestinian come here from Syria and Jordan bf 48 , The Things there is no one to talk peace , PA are feeding the money from Eu countries by cover of charity organization , Some money go to Games to take care of the poor but the majority go to weapons against Israel , i'get u the gov link who provide evidence , but u still won't believe cause u are dreaming in Lala land","commenter_a":"Israel has no moral or ethical values. It only knows how to oppress and terrorise people.","post_message":"Canada will be a frank voice in the Middle East, even if it means criticizing Israel, said the country's new Prime Minister Justin Trudeau."},{"comment_id":"10153270653234091","commenter_b":"It should of been called player interference he did not slide with intent to advance to 2nd his sole purpose was to take out the 2nd baseman and break up a double play you can call it dirty call it aggressive I believe the rule says you have to start your slide before you reach the base and that he did not do . With all the new rules to protect the catchers and collisions at the plate this is no different . I believe he should be suspended . Unless you want the benches to clear every time he comes up to hit","commenter_a":"Here are the rules! Evidently, the umps didn't get that memo!!!","post_message":"UNDER REVIEW: Major League Baseball executive Joe Torre will review last night's controversial slide by the Dodgers Chase Utley that broke the leg of Mets shortstop Ruben Tejada for possible disciplinary action. What are your thoughts about the play? Read more: @webpagelink"},{"comment_id":"1542895312670081","commenter_b":"#Trump #Trump2016 #MakeAmericaGreatAgain #WomenForTrump #VeteransForTrump #IllinoisForTrump #ArizonaForTrump #TrumpTrain #TrumpForPresident #TrumpAmerica #TrumpBuildThatWall","commenter_a":"All you guys are a joke trump is running as a republican because he knows you're dumb enough to fall for his show, look up trump interview news week 98","post_message":"Politicians are trying to chip away at the 2nd Amendment. I won’t let them take away our guns!! #MakeAmericaGreatAgain #Trump2016 Text TRUMP to 88022 to get exclusive updates!"},{"comment_id":"760141017451798","commenter_b":"he also spoke at her rallies against Obama Care!! he should be thrown out for being publicly biased BC he knows he had to make decisions on it so it is illegal for him to do that!! his teaturd wife is insane too!!! apparently if your rich, you are above the law! time for a big change here!!!","commenter_a":"And what about Thomas \"inadvertently\" forgetting to report 1.6 million in income his wife earned lobbying and speaking against healthcare? How is he still on the Supreme Court?","post_message":"Very interesting."},{"comment_id":"10152786318205736","commenter_b":"She's a nut","commenter_a":"That's what I said about her","post_message":"What are your thoughts on race identification?"}]
