[{"comment_id":"10153356332992169","commenter_b":"Going to watch all the seasons leading up to it. I'm so excited, but already sad it's the last season.","commenter_a":"I CAN'T WAIT!!!!!","post_message":"NEW Downton Abbey video: Seeing is believing! The Final Season premieres Sunday, January 3 at 9/8c on MASTERPIECE | PBS (Masterpiece Theatre)."},{"comment_id":"731413603663114","commenter_b":"Build the wall, those here illegally on good status, offer citizenship, if no, they go. Those in our prisons, bye bye, gone. Immigration problem solved.","commenter_a":"The Republican politicians not following through on campaign promises and general fecklessness is what brought about Trump's popularity, not just the immigration problem. Trump was willing to bring up the illegals when the others were not.","post_message":"Meghan McCain warned Donald J. Trump of softening his stance on illegal immigration. Do you agree or disagree with her comments? @webpagelink"},{"comment_id":"10156066398495354","commenter_b":"Just can't handle the truth or face reality can you, imagine that, a black playing the race card, what a shocker!","commenter_a":"Ramos may be Hispanic, but he is also rude and disrespectful to the other reporters in the room.","post_message":"Or maybe... because they attacked him first?"},{"comment_id":"1196791103694693","commenter_b":"David, better vote for anyone on the GOP side than voting for the criminal Hillary \"Cankles\" Clinton. The woman should be in prison.","commenter_a":"DO NOT be complacent. Progressives need to come out in the MILLIONS and vote. Otherwise, the Republicans/teaparty, who sold out to crazies who actually want to take a dump on the Constitution and make America a \"Christian\" Theocracy, will win.","post_message":"Republicans are losing ground in key demographics."},{"comment_id":"1040495199380065","commenter_b":"Looks like only gays and uninformed women votes get this evil women.","commenter_a":"President Hillary Clinton","post_message":"A win for Hillary."},{"comment_id":"10150597550159999","commenter_b":"If you want to, go ahead sugar tits","commenter_a":"Never question again why men don't take women seriously","post_message":"She dated him for his dog. Then another dog came around. Read on in The New York Times Opinion."},{"comment_id":"1203183663111217","commenter_b":"STFU","commenter_a":"Nothing Mr. Trump does compares with crimes Hillary and obama have committed.","post_message":"A prominent Republican who supports Donald Trump urged the candidate to start acting like “a potential leader of the United States.”"}]
