[{"comment_id":"10153620969383352","commenter_b":"Girl people have no life!!!","commenter_a":"He's having a separate party for her idiots!!!","post_message":"CHRIS BROWN SKIPS ROYALTY'S FIRST BIRTHDAY PARTY TO BE IN MIAMI. SOURCE SAYS HE DIDN'T GET HER A GIFT OR HELP PAY FOR CHUCK E. CHEESE EITHER!"},{"comment_id":"10154280018188797","commenter_b":"Illegal immigrant aka alien. Im no immigrant nor do i support harboring illegal aliens","commenter_a":"Thank god for her. Thanksgiving is a day to honor a massacre, it's disrespectful to even celebrate the event. Religion is a lie so she is only protecting the best interest of the child, shame on parents who don't. More schools need to follow her lead. She is not the principal of a private Catholic school. She is the principal of a public school. Argument ended","post_message":"NO THANKSGIVING, SANTA, OR PLEDGE: A school principal has banned Santa Claus, Thanksgiving and the Pledge of Allegiance at her school. What do you think?"},{"comment_id":"10153166751996336","commenter_b":"CIA is the source of evil, they create such groups like ISIS, Al-Qaida to fight its dirty proxy war in other countries","commenter_a":"Haha go ahead smash the headstones. They are just mad the one thing they can't take is our eternal life with Jesus.","post_message":"ISIS continues with their calculated campaign of terror across the Middle East, destroying Christian graves in the Iraqi city of Mosul."},{"comment_id":"1680552935568119","commenter_b":"#TrumpIsMyPresident #SendAllIllegalsHome for all American Citizens involved & thanks for all law enforcement","commenter_a":"Okay Obama, this is your last chance to speak against guns... oh wait , guns were not used?! Oh darn it! Well let's start trying to ban knives now too.","post_message":"Officials hold a news conference on The Ohio State University campus attack. @webpagelink"},{"comment_id":"10152937049646051","commenter_b":"Hang her","commenter_a":"Loser","post_message":"A pregnant woman with drugs in her system crashed her car and killed a 5-year-old. When police told her the child had died, she had a two-word response for them."},{"comment_id":"10153109459178701","commenter_b":"Usually those people are criminals themselves.","commenter_a":"Why people defend the character of criminals, I'll never understand...","post_message":"Two people were caught on camera damaging an ATM to try and get money out of it on the Oregon Coast. After the surveillance photos were posted on Facebook, police made two arrests."},{"comment_id":"1782906415286798","commenter_b":"Old bitch","commenter_a":"I have to believe this woman is mentally ill. I can't find any other way to wrap by head around it. I mean can sane people be this cruel?","post_message":"So awful."}]
