[{"comment_id":"865303986949796","commenter_b":"She has the 2nd highest rated show on cable news and all YOU have is this little space on Trumpbart to air your idiotic views. Not hard to see who is more important.","commenter_a":"Grow up Megyn....as I have stated before...YOU went after him and lost ALL credibility you had. As important...your \"love fest\" with the disgusting Michael Moore was the last straw. Get over it...you just are not that important.","post_message":"Megyn Kelly tells Mediaite she worries that “someone’s gonna hurt me in the presence of my children.”"},{"comment_id":"10154992177868905","commenter_b":"It really is better to have a world view. Try it some time.","commenter_a":"BBC has really gone down the tubes! Stick with news from your own country and leave ours alone!","post_message":"Watch LIVE: Latest Trump news, talking deportation and anti-Semitism. Get your questions to us in the comments section..."},{"comment_id":"10153927537756350","commenter_b":"Glad she isn't winning the contest. Shallow personality and spoiled.","commenter_a":"He didn't need to interview her and ask for an apology, when he already did the same night the mistake happened. She's a spoiled brat looking for attention, and of course Steve Harvey is the way. What it bothers me more, is the fact that he and his family has been threatened, and the media still paying attention to her, she's greddy! #getoverit #sorelosers","post_message":"See Steve Harvey come face-to-face with Miss Colombia Ariadna Gutierrez, the contestant he accidentally crowned Miss Universe."},{"comment_id":"898930746862951","commenter_b":"You sure use a lot of words to say \" I don't have a clue \". Don't you ?","commenter_a":"Take it to the Supreme Court. We only make them pass a background check to buy a gun. That's it. Gun purchasers have no other culpability. Why not a background check for ammo? If gun and ammo purchasers were held responsible for keeping their weapons out of the wrong hands, we wouldn't have as as many shootings. Right now, they pass the background check and then can hand the gun over to whoever they want. A simple law making a background check necessary to buy and use a specific gun would prevent this. Make the legal purchaser responsible to ensure that anyone using the gun has passed their check. Every shooting, trace the gun to the legal purchaser and throw them in jail, if the shooting wasn't the owner protecting themselves. We have technology that can recover removed serial numbers. Gun owners wouldn't let their guns out of their sight. ...","post_message":"Thanks, NRA!"},{"comment_id":"981436531916095","commenter_b":"This is also the reason women live longer lol","commenter_a":"Why is it always men!?? Lol just proves us women are the wiser more clever sex","post_message":"Why you should never play with swords"},{"comment_id":"832762386834955","commenter_b":"Little bitch alert","commenter_a":"Use thc dumbasses","post_message":""},{"comment_id":"10153043180073984","commenter_b":"Finally someone with a backbone. Why is the rest of the media supporting this evil by not showing the world their true nature?","commenter_a":"Close this guy and his mosque DOWN...","post_message":"Wow, what this guy tells Hannity about the awful Paris terror attack - how he defends the killers' actions...well, see for yourself.. Do you believe radical Islam is the enemy of civilization?"}]
