[{"comment_id":"717585195090025","commenter_b":"With your logic, then what about all those moms bringing their little boys into women's locker rooms and bathrooms? They have penises and they don't belong there. Send them by themselves into a men's room and wish them good luck with the pedophiles who might be there.","commenter_a":"Just because it happens in YOUR family doesn't mean the whole of the rest of society must have their mores changed because YOUR bro/sis has identity issues. This is not and access issue. This is not and equality issue. This is a PERSONAL issue to approx 1.6 million adults and unless your bro/sis has had their genitals 'fixed' I don't want them wagging about in the locker room with my grand kids and great grands. After the 'fix' is in and they've chemically changed themselves to be more like what they think/want to be, I have less of an issue with it. mym","post_message":"Speaking out."},{"comment_id":"10152887362811770","commenter_b":"Liar....","commenter_a":"gormless!!","post_message":"Pantsuit on fire!"},{"comment_id":"10153678204533984","commenter_b":"They are scum ! We don't have enough prisons !","commenter_a":"This is a hate crime! Throw the book at these idiots!","post_message":"This is just brutal...How can anyone do this to an innocent teen?"},{"comment_id":"1276379159041275","commenter_b":"Thank you for showing the American people what a corrupt lying bitch she is","commenter_a":"I think you should give this guy some kind of a metal for Honor possibly a fruit basket!","post_message":"Ohhhh boy..."},{"comment_id":"10152884720337217","commenter_b":"Humans suck 😕","commenter_a":"Man. The death of all animals, plants, and everything else. I swear. Smdh.","post_message":"The tiger that mauled a man to death after escaping from a flooded zoo in Georgia has been shot dead. (Footage from Georgia Ministry of Internal Affairs)"},{"comment_id":"10153671007817452","commenter_b":"@username if ur really going to have a discussion please don't start with \"then how is it that...\" When you focus on the trees rather than the forest, ur def lost. If you haven't done research on average income, crimes by income, distribution of resources to low income, then this is above your level of comprehension. Start with census and BJS","commenter_a":"“If Black Lives Matter was truly concerned about black lives, they’d be concerned about black crime.”","post_message":"From Atlanta to Phoenix, to right here in L.A., protests are growing across the nation after this week's deadly officer-involved shootings. But not everyone is happy that protesters have hit the streets less than 24 hours after the Dallas bloodbath that left 5 police officers dead and 7 others wounded. Tonight the tense scenes from coast to coast - at 11 from ABC7 Eyewitness News. @webpagelink"},{"comment_id":"491909840999596","commenter_b":"These are dangerous ragheads. I say,get them out if our country","commenter_a":"They want muslims areas fine we should have MORE NON-muslims areas!","post_message":"A Texas shopping center posted a sign that have Muslims outraged. It's about time someone stood up to them, we support them. Do you support their stand against Muslims?"}]
