[{"comment_id":"850014095139630","commenter_b":"Those illegals and Refugees are everywhere,and plenty of them,obama has been busy letting them in the last 8 hills,hillary killed off soldiers[American] and wanted muslims in,guess she wanted to kill babies that was full term so they would not grow up for the usa,,what a mess,in the usa,why don;t they stop all of this junk? This is America?","commenter_a":"So I have posted this many times.... How many of our citizens have to die or be injured before these Far Left Dems understand and see the light! These illegals and Refugees are not good people......","post_message":"John Kasich opened up Ohio's borders to refugees and himself to a tidal wave of Twitter hate..."},{"comment_id":"10153480430267483","commenter_b":"I bet the sissy SOB would have never talked to a man that way.","commenter_a":"More businesses need to be like this. Its 2016 for heaven's sake. No one should be treated less than anyone else.","post_message":"\"Due to privacy laws, we are limited in what we can share, but in a situation in which a customer verbally abuses another customer or a Regions associate, we close that customer's account,\" a Regions Bank spokesperson said."},{"comment_id":"966246990097370","commenter_b":"Umm Ferguson, Watts Riots, La Riots. White people are out of control? Ok","commenter_a":"I pray for their families","post_message":"White supremacists shoot five people near the #BlackLivesMatter protests for Jamar Clark, a 24-year-old unarmed black man who was shot earlier this month by police. Protestors took to Twitter after the shooting & described the scene as chaotic, saying police maced the crowd before an ambulance arrived to assist the wounded. No arrests have yet to be made. DETAILS ----> @webpagelink"},{"comment_id":"1253889731373943","commenter_b":"Think I saw her speak recently. Speaks volumes about this creep. Shout this from the rooftops","commenter_a":"Julie Stoddard Laxton","post_message":"\"It was shortly that initial workshop that I realized that this was not what they were presenting it to be. This was a scam.\" - Cheryl Lankford, a military widow who attended Trump University"},{"comment_id":"10152872155116051","commenter_b":"She is a pig.","commenter_a":"Michelle Obama is a beautiful woman inside and out, and highly intelligent. Unlike most of these commentators!","post_message":"Raven-Symone’s take on Michelle Obama-Planet Of The Apes incident left the cast of The View at a loss for words."},{"comment_id":"571634943014885","commenter_b":"Ya 10 ft wall and make mexico pay for it that wall will never be build","commenter_a":"@username to fucking childish.","post_message":"After vowing to take the high road during his presidential campaign, Marco Rubio changes his stance on making personal attacks against Donald J. Trump. ►Watch last night's full episode: @webpagelink"},{"comment_id":"10154391866961130","commenter_b":"One track mind girl!","commenter_a":"lawd hep us!!","post_message":"Mazel tov for (unintentionally) making us laugh before the election."}]
