[{"comment_id":"645119115621270","commenter_b":"GET A JOB BITCH!","commenter_a":"Who's going to pay . . . .? YOU ARE!!!!!","post_message":"America.....someday."},{"comment_id":"10154589090613132","commenter_b":"I thought the same thing...wow, she's just like every other woman!!","commenter_a":"I'm not gonna lie, I'm glad her mascara runs too hahaha!","post_message":"A pregnant Blake Lively and husband Ryan Reynolds were caught locking lips in Rhode Island over the weekend."},{"comment_id":"10153245476169087","commenter_b":"F you Bitch !!","commenter_a":"obama with his gay pride lit up the white house for his muslim brothers and he told us how proud that he was to light up the white house for his gay friends","post_message":"“If Donald Trump becomes president, that will be the end of the world,” said Hunger Games actress Jennifer Lawrence said. \"I genuinely believe that reality television has reached the ultimate place where now even [presidential elections] might just be for entertainment.\""},{"comment_id":"485272544994977","commenter_b":"I'm so sick of her","commenter_a":"So says the compulsive liar.","post_message":"The video shows Hillary Clinton snapping at an activist and calling out the Bernie Sanders' campaign for lying."},{"comment_id":"10152783223285667","commenter_b":"I wondered what happened to the bikes. Bike sale soon????","commenter_a":"Yes and they have confiscated over 150 bikes..Bikers are pissed off","post_message":"Some of the dead and wounded may have been shot by officers responding to the bedlam, a Waco police spokesman said."},{"comment_id":"10152712220635736","commenter_b":"I'm half native you ignorant land thief!","commenter_a":"Kill it? Really? Greedy ass humans are the reason it has no food. HUMANS catch its food source and deplete rapidly. Maybe the shopkeeper will open up a tab for the poor thing. Maybe the natives should start shooting up all the white people? Doesn't sound fair? Don't go shooting starving animals.","post_message":"Watch: This seal jumps out of the water to search for food inside an Astoria market: @webpagelink"},{"comment_id":"828345383930736","commenter_b":"Yes and NO Muslim country is taking ANY refugees!","commenter_a":"I find the hateful, negative comments sad. What is perhaps even sadder, is that I am not surprised by the terrible comments. They are offering to do something kind and selfless.","post_message":"More than 11,000 Icelanders have offered to take Syrian refugees into their homes."}]
