[{"comment_id":"633419350152037","commenter_b":"Bye, don't come back","commenter_a":"His gravy train parliamentary salary wasn't enough he must have found another income that was better for less hours","post_message":"What's next for David Cameron?"},{"comment_id":"1035305006509971","commenter_b":"No woman should be a republican if they are smart..","commenter_a":"Young Republicans whyyyyyyyyy!!!!!!!!!!! Is any woman a republican?????????","post_message":"\"this young woman’s death serves a purpose. She 'Took one for the team.'”"},{"comment_id":"10152691933545950","commenter_b":"You look like a crooked bitch","commenter_a":"Yeah and what they are going to do give him the death penalty.....dam sure won't let him walk like they do those crooked a** cops","post_message":"A suspect has been arrested in the shooting of two police officers in Ferguson, Mo."},{"comment_id":"10154134238584411","commenter_b":"Mohammad IIyas, u must be annoyed abt the fact how we kill those Porkistani pigs trying to cross our border every day. Feel pity for u being born in such a disgraceful country where the the administration controlled by radical Jihadis. I believe Pakistan fought four wars with India and all of them was lost by Pakistan with great humility. Thank us, that we left the land we captured during 1965 war, or else your dad would have been fucking your mom on Indian soil, and you would hv been born in India with Indian passport.. and then still if you would have spoken against our country, we would hv sent you to your 72 virgins without appointment.","commenter_a":"India need such subs @username","post_message":"The sub disarmament is estimated to cost some 28 million rubles (about $ 400,000)"},{"comment_id":"10153182713489030","commenter_b":"You're clearly loose butthole","commenter_a":"Yeah, this show is as stupid as every druggy I have ever met, and not even close to being funny, uless you are a druggy too.","post_message":"Vote for Seth Rogen and Zac Efron's Workaholics video in this year's Webby Awards People's Voice. @webpagelink"},{"comment_id":"10153155208743010","commenter_b":"Ariel Sharon was the last Israeli leader who sincerely wanted peace with the Palestinians and strived for it despite the war hawks. Only thing the Jews want now is all of the Palestinians lands, without the Arabs of course. They are ethnic cleansing it as we speak. Sad that after the holocaust, modern Jews behave as the Nazis.","commenter_a":"Peace will only come with the return of CHRIST Jesus!'","post_message":"In this Q&A with Los Angeles Times World, former Israeli President Shimon Peres discusses the prospect of peace in his lifetime, plus other issues affecting Israel and the world:"},{"comment_id":"10154964993289411","commenter_b":"What have they to complain about the weather in Greece is lovely.","commenter_a":"pablo escobar ?","post_message":"LIVE: Protesters rally in Athens to honor memory of teen killed by police COURTESY: Ruptly"}]
