[{"comment_id":"10153776813241336","commenter_b":"Bye-bye!","commenter_a":"Good riddance!","post_message":"Ahmed Mohamed’s family released a statement saying they had accepted a foundation's offer to pay for his high school and college in Doha, Qatar."},{"comment_id":"10154429543778196","commenter_b":"Better than watching u suck dick in public","commenter_a":"Really maybe he and Putin should just get a room sick of watching them suck face in public","post_message":""},{"comment_id":"10152969596402452","commenter_b":"Exactly @username, you apply these same rule to your god daughters.😊","commenter_a":"No one cares about the children lol pets ftw!","post_message":"PET SAFETY: Arizona Cardinals player Tyrann Mathieu sits in an SUV with the windows rolled up on a sunny day in a new PSA about the dangers of leaving pets in a hot car. He lasted only eight minutes. WATCH: @webpagelink"},{"comment_id":"10156625898105354","commenter_b":"Boo hoo whiney bitch. !","commenter_a":"Wow these lady must see through smoking glasses","post_message":"\"B**ch commits! That’s the hashtag.”"},{"comment_id":"480221218832838","commenter_b":"Kevin, if you look at Christine's profile, I would say all of her ancestors were not white... And you just backed up what I said about the white man thinking they could own the land. I believe that baffled the Natives. How could you own Mother Earth?","commenter_a":"Jesus WAS!!!!! A LIBERAL, you right-wing nuts!!!","post_message":""},{"comment_id":"1170595402996226","commenter_b":"And the world would be a lot better place without your racist, misogynistic ass in it. Twit begone!","commenter_a":"Most admired my ass this stinking bitch allowed 4 people to die she a corrupt lying useless bitch should been in jail or zoo cage right next to the ape in heels","post_message":"Hillary Clinton just won Gallup's \"Most Admired Woman\" poll for the 21st time. Do you admire her?"},{"comment_id":"884379288251594","commenter_b":"Sexy diva girl","commenter_a":"Nache Mishell","post_message":"[Watch] ABC Unveils Sneak Peeks For The Return Of TGIT @webpagelink Speaking of good TV...who's ready for Scandal and HTGAWM?"}]
