[{"comment_id":"1179417458812166","commenter_b":"The apple didn't fall far from the tree. She is just as dumb as her momma lol .","commenter_a":"They didn't have a plan besides the same tired failures the current admin did and her daughter is just as fugly as Nancy .","post_message":"Nancy Pelosi's daughter went full-on crazy during this Friday Fox interview..."},{"comment_id":"10154326726666729","commenter_b":"None... Technically. I do think they may have accidentally drifted into their waters..","commenter_a":"Why did our sailors surrender and why didn't we have any support for our sailors such as a helicopter? Something isn't right here, this stinks like Benghazi.","post_message":"We REALLY wish we didn't have to show you this, but this is what the results of feckless foreign policy leadership look like..."},{"comment_id":"10153816646376336","commenter_b":"They think that are comedians!:) seriously??? They are not funny at all! These women on the view are ugly and boring! I am still at a loss who watches this show?","commenter_a":"Let's don't get started about people's looks .","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."},{"comment_id":"1016888675050426","commenter_b":"Go Trump!","commenter_a":"God Bless you, Mr Trump, we've needed someone like you for a very long time, someone e who really cares about the a","post_message":"WOW! Thank you, America! LETS GO - it is Super Tuesday -- get out & VOTE TRUMP!"},{"comment_id":"10152938422949877","commenter_b":"girl shut up","commenter_a":"#foodforthought","post_message":"Half Of Atlanta's Newly Diagnosed HIV Patients Have AIDS, Study Finds. Read more on these staggering numbers out of Atlanta. Grio fam, share your thoughts on what needs to happen to reverse this."},{"comment_id":"10154161281331636","commenter_b":"But if you are in line at the time of closing they have to stay open to allow you to vote. This orange plague on our Country needs to GO!","commenter_a":"Seriously he doesn't like democracy you elect him you'll have a dictator who you will have to overthrow","post_message":"BREAKING"},{"comment_id":"885286484921464","commenter_b":"This woman is delusional.","commenter_a":"Bat shit crazy","post_message":"ClashDaily.com"}]
