[{"comment_id":"10155980506710725","commenter_b":"@username. I see why you love her lol","commenter_a":"Whoopee","post_message":"What do Amy Schumer and Judd Apatow do when they find themselves stumbling into an Irish wedding? They make the most of it, of course! Watch the wedding crashing incident, all caught on video ----> @webpagelink"},{"comment_id":"10152617466356680","commenter_b":"For those who want to deport, are the GOP taxpayers going to pick up the $50 billion tab? Dems won't because anyone with a brain knows the addition of these people into legal residency will boost our economy.","commenter_a":"Obama, siding with illegals against Americans, yes, Obama DOES NOT LOVE OUR COUNTRY.","post_message":"President Barack Obama is calling out John Boehner for not bringing comprehensive immigration reform up for a vote in the House last year."},{"comment_id":"1415259475160745","commenter_b":"Nobody hates better than feminists.","commenter_a":"The hate is real from the Internet warriors lol. So many people driven by hate... I wonder if poked if they would ooze black.","post_message":"Is this what a feminist looks like?"},{"comment_id":"908989295805078","commenter_b":"She was discriminatory to Israel in her tweet islamaphibia Israel. The middle east wants us wiped out! She is lucky she is in the USA where she can say what she wants as a woman in her country she would be stoned for the same accusation. Get over yourself lady!!!!!!","commenter_a":"Better yet, just stay home","post_message":"\"This discriminatory and disgusting behavior.\""},{"comment_id":"10153253183992690","commenter_b":"Hispanic Race Mexican Race Human Race Everyone is a Race!","commenter_a":"I do not hate Mexicans! So get that straight! Illegal alien does not necessarily mean \"Mexican\"! Seriously????","post_message":"A former Texas DPS employee at the Irving office is sentenced Thursday for selling driver's licenses to dozens of unauthorized immigrants. @webpagelink"},{"comment_id":"10153519416973812","commenter_b":"God rest their souls! That sicko should rot in hell!","commenter_a":"R.I.P god bless this good people.","post_message":"These are the 9 people who lost their lives after a gunman opened fire during a bible study at a Charleston church: @webpagelink"},{"comment_id":"950334638377899","commenter_b":"Put this bitch in jail","commenter_a":"Clinton should be in Jail.","post_message":"Hillary Clinton says the Republican party's hatred for President Obama crosses political lines and is simply disrespectful. Do you agree with her?"}]
