[{"comment_id":"638139039652611","commenter_b":"They paid her less cause she sucked ass!","commenter_a":"It's true cause Brian Williams was there","post_message":"YEAH!!!!!!!!!"},{"comment_id":"722009277961832","commenter_b":"Brunch?","commenter_a":"@username come visit","post_message":"Mark your calendars for Jan. 29. On that day only this year, more than 30 museums in Southern California will offer free general admission as part of the 12th annual Museums Free-For-All-Day."},{"comment_id":"825278590901728","commenter_b":"And 11 million illegal aliens","commenter_a":"Please just go away, Cruz. You have nothing good to add to our country!","post_message":"“You cannot win a war against radical Islamic terrorism with an administration that is unwilling to utter the words radical Islamic terrorism.” - Ted Cruz"},{"comment_id":"10154197437622426","commenter_b":"It's reality, white suburban women. It's not fair but it's a fact. If you're so concerned why don't you go down to Hillside Court and walk the kids home from the bus stop.","commenter_a":"School need more money but kids have 300$ shoes .500$ phones and say look at me and wonder why this happens.","post_message":"The robbers, described by police as young adults, threatened to beat-up the student if he did not take off his shoes and hand them over."},{"comment_id":"10153477964755575","commenter_b":"I'm in true awe at how people react to situations. I am physically sick at what these murderers are doing and GETTING AWAY WITH IT. What kind of people are we to sit back and let the government ruin our lives. You saw, as Americans, how much power we have when Megyn Kelly attacked Donald J. Trump. Why aren't we furious about ISIS and demanded our government eliminate them all. obama has done an excellent job on turning American people against one another an will continue to do so as long as WE allow it. Its time people. Stand up and voice your opinion and tell obama that this is WRONG. WE have the Power......Use it.","commenter_a":"This crap needs to be stopped, let the Marines do it...","post_message":"The Gateway Pundit - ISIS Kidnaps Priest, Kills Him, Cuts Him into Pieces, Packs Him in Box and Sends Him Back Home"},{"comment_id":"10154472139428271","commenter_b":"@username always cleared denotes nothing about guilt .","commenter_a":"I don't care how it happens the cops will always be cleared until we say no more.","post_message":"His mom called police because she knew he was in trouble. But minutes later her son was dead. The DA has cleared the officer involved in the shooting because the suspect had reached another officer's gun and fired a shot."},{"comment_id":"10154151850958271","commenter_b":"Hilary voted for it! So she must have to go to jail. Or does it only work one way?","commenter_a":"Can we focus on how she forgot about our soldiers in Benghazi!","post_message":"We are live discussing tonight's debate. Send your questions!"}]
