[{"comment_id":"10153690611426756","commenter_b":"The woman is the patient.","commenter_a":"It's interesting the idea that the woman is the \"patient\" so her health is all that matters. I've always pictured prenatal care as for both the mom and baby together.","post_message":"Over the years, residents have come to Janet Singer, a nurse midwife, with tricky questions about performing abortions: Where does life actually begin? How do doctors’ personal beliefs play out in their clinical care? And what’s really best for mothers? She thought the public would benefit from hearing their experiences, so she asked four residents to write about them."},{"comment_id":"961657090560706","commenter_b":"Ugly woman!","commenter_a":"I am sorry but on this point I do agree with her,but I do not agree with the fact she is on 20k a year,","post_message":"Benefits mum does not understand why we send money to Africa"},{"comment_id":"1089911127716025","commenter_b":"Another illiterate ass wipe that can't get over having to share her country with people that don't look like her... Try moving to Russia, bitch.","commenter_a":"I just wonder how long she can tread water.","post_message":"The kids were just playing in the water..."},{"comment_id":"10153990406082293","commenter_b":"@username apparently you believe so easily what Hillary says. She is a vicious Evil woman who cares about Money and Power and no one else. I have been around for all the Hillary Scandals and every one of them will be coming back at her during the next few months. I don't know how this woman can sleep at night for what she has done.","commenter_a":"She has been held to a higher standard. Republicans have spent decades trying to pull her down. #ImWithHer","post_message":"Hillary Clinton's honesty problem is growing."},{"comment_id":"10153694586758132","commenter_b":"More than that! They would make her CEO due to affirmative action. Come on now!","commenter_a":"I wonder if a black woman decided to be white would she get a vanity fair interview? #whiteprivilege","post_message":"The latest from Rachel Dolezal."},{"comment_id":"10154664462516337","commenter_b":"Blaming a group of people before you even know the full story = ignorance","commenter_a":"Please bring more Syrian refugees to this country","post_message":"Explosions and IED discoveries continue to rock the northeast."},{"comment_id":"10154716628348812","commenter_b":"Cynthia, please please do not vote or reproduce.","commenter_a":"Republicans are throwing everything at Hillary trying to see if it will stick. They know they will lose the election in November, and this is the only way they can come up with crap to try to cast doubt on her campaign. It is not America's fault that the only person representing their party is a certified lunatic. :D","post_message":"The various iterations of the Clinton Foundation are coming under scrutiny as Hillary Clinton runs for The White House."}]
