[{"comment_id":"1091369127608289","commenter_b":"Tired of hearing about this stupid bitch too","commenter_a":"I don't care what she does.....she is the black Jane Fonda as far as I am concerned.","post_message":"Beyonce is backtracking from her racist Super Bowl 50 performance about as quickly as she can... now see who's being blamed for one of the most despicable aspects of her performance. This seems WAY too coincidental... Beyonce needs to step up and take responsibility."},{"comment_id":"499431526914094","commenter_b":"Leave our flag alone!","commenter_a":"I think the old saying is true. If It ain't broke, don't fix it!","post_message":"The American flag might be redesigned, see here. No one should touch the flag. It is the symbol of the greatest country on earth. Do you agree no one has the right to change the American Flag?"},{"comment_id":"10152744778310950","commenter_b":"Yeah, the law is very very clear. @webpagelink","commenter_a":"There is no justification for the killing. However, the entire incident could have been avoided if he would have stayed in the car.","post_message":"JUST IN: Newly released dash cam video shows the moments before the deadly police shooting in South Carolina; Walter Scott is seen running from the driver's seat @webpagelink - CBSN"},{"comment_id":"1088028091217546","commenter_b":"They'll just keep those desperate women safe in prison","commenter_a":"To all of the people who believe in blocking a women's right to choose by making legal abortions harder to obtain and want women to travel hundreds of miles to get one, if the law in Texas passes, I shudder to think how many \"complications\" (as if that was *really* the GOP's concern at ALL) there will be when desperate women resort to desperate measures. #keepabortionsafeandlegal","post_message":"The Supreme Court, two days after hearing a major abortion case from Texas, on Friday temporarily blocked a Louisiana law imposing regulations on doctors who perform abortions in a move that would allow two recently closed clinics to reopen."},{"comment_id":"10153184013859255","commenter_b":"ThankYou","commenter_a":"Who was it that said \"You have to have some intelligence to realize how stupid you are\"? No intelligence on display with those who still believe in the KKK. Haters and bigots.","post_message":"Another day in post-racial America."},{"comment_id":"1030546040397732","commenter_b":"Lock her up","commenter_a":"Can't do it fast enough! Lock her up!!!","post_message":""},{"comment_id":"1357303384289688","commenter_b":"Well how black do you have to be to be considered black... Since you have a PHD in biology","commenter_a":"\"If celebrating my roots and culture during Black History Month made anyone uncomfortable, those feelings were there long before a video and long before me,\" - Beyonce I totally agree!","post_message":"\"I'm an artist and I think the most powerful art is usually misunderstood.\""}]
