[{"comment_id":"10154416316781833","commenter_b":"@username lmao there is no such thing as gun violence only violence. And back off gun control laws won't stop criminals or terrorists from getting guns. Your gun control laws only harm law abiding citizens and get people killed wake up. More states are banning gun control laws. I'm moving to Arizona. They have no gun control laws and have Constitutional carry. No permits no waiting periods no finger printing. Just a simple and quick background check and I'm free to get my gun. And I will buy loads of AR 15s and other types of guns. Gun control = death","commenter_a":"I don't see what the problem is with strict background checks and a ban on assault rifles. This guy was under investigation by the FBI twice for suspected terror affiliations. A background check would have certainly stopped him from obtaining such a weapon. Noone wants to take away anyone's guns, just keep them out of the hands of lunatics","post_message":"Americans were shocked and disgusted to learn of another act of terrorism on our soil. But calls for more gun control are a desperate attempt to create the false illusion that government - and politicians - can keep us safe at all times."},{"comment_id":"10153021428690399","commenter_b":"Karma is a bitch","commenter_a":"Bet he declares bankruptcy and sticks us with the bill. Typical freeloading conservative.","post_message":"smdh"},{"comment_id":"804935616266161","commenter_b":"will the ACLU take up a case for violation of free speech?","commenter_a":"Floridians voted for him. Too bad the smart ones got him too.","post_message":"Governor Rick Scott is committing political malpractice. Parts of Miami Beach are already sinking into the rising ocean. Read more here: @webpagelink Image by Occupy Democrats."},{"comment_id":"468040403386540","commenter_b":"They need to leave America!!!","commenter_a":"No, do we get ours? Did any of our relatives from the past get their's","post_message":"Should The US Allow Muslims To Have Their Own Areas? Comment 'yes' or 'no'."},{"comment_id":"1073730232720030","commenter_b":"Their all prostitutes, lol","commenter_a":"Mika was raised and programmed to be a prostitute by her father. She's very accommodating when it comes to white politicians and Chinese business men.","post_message":"A hot town hall mic just exposed Trump as the fraud he is."},{"comment_id":"1859871360913002","commenter_b":"Can we please build that wall around his ugly face and throw dirt in his mouth!","commenter_a":"GEEZ LET THAT MAN BUILD THE WALL ... @webpagelink","post_message":"\"We will build a great wall along the southern border,\" Donald J. Trump told a crowd in Phoenix, Arizona, during his immigration speech. After a long pause, he continued: \"And Mexico will pay for the wall.\" @webpagelink"},{"comment_id":"1529581924006603","commenter_b":"She's trash, she's a disgrace!","commenter_a":"Racist pig!","post_message":"Boycott this idiot..."}]
