[{"comment_id":"748263168643341","commenter_b":"Trump is a racist bigot who drives fear into weak people just like Hitler #dumpthetrump anti-muslim isn't a political opinion its bigotry. and his anti-hispanic is talk is racism","commenter_a":"America doesn't thrive off fear we don't feed off hate and we will certainly not have a president that represents all that is wrong in this country. Hillary is who we need in charge #dumpdrumpf #imwithher","post_message":"\"I don’t think there is anything more important than working to provide every child in this country and beyond the chance to do what that child is meant to do, because I think every child has a God-given purpose and a God-given potential. That means every child deserves a good teacher and a good school regardless of the zip code that child lives in. That means every child deserves the health care that will keep that child healthy, will deal with whatever befalls him or her. That means that the child’s parents and grandparents deserve good jobs with rising incomes to provide a good, solid life for their son and daughter, for their grandchild.\" —Hillary"},{"comment_id":"828004503968344","commenter_b":"The world is better off for her decision. Her kids wouldnt only be stupid...they'd be ugly as hell too!","commenter_a":"Damn good thing she doesn't want children. We don't need more idiots like her. Just imagine how brain dead her offspring would be.","post_message":"Liberals are repulsive Dc Gazette (y)"},{"comment_id":"1670513393170878","commenter_b":"Hey he's jerking with his shit as lube on his pussy","commenter_a":"Wow it takes like 15 or more cops to take down 1 fucking guys.....pussy as pigs","post_message":"The most glorious thing we have ever seen. #thinblueline Footage from moments ago when protestors shut down HWY 70 near our shop. When the SHTF make sure you have the right SH*T @webpagelink"},{"comment_id":"10153400579000329","commenter_b":"He's all yours, ladies lol","commenter_a":"Greg Paul Rachelle Krista","post_message":"His name is Brock O’Hurn and he's the king of man buns."},{"comment_id":"10153192741541336","commenter_b":"@username you sit there and bad mouth President Reagan about low wages and high debt well buddy you ain't seen nothing yet. obozo is bringing in all the illegals and he is giving all the companies a bonus to hire illegals over American citizens because they will work for lower wages so all wages will be kept low and where do you think obozo is getting all this money that he is passing out? It is not all taxes because if you don't work you don't pay taxes and the illegals don't pay taxes on what they earn. He is adding to the national debt by borrowing more money.","commenter_a":"I am 17 and a college student and this breaks my heart. Do people know what he did for the country? He was not perfect but he made America strong.","post_message":"Can you identify this man?"},{"comment_id":"10153850610670575","commenter_b":"We will see...won't we? Vote Trump and Mexico will pay for the wall. All the others will not put up a wall. All the other candidates don't care about how many drugs are coming across the borders to ruin America and her children. Trump 2016.","commenter_a":"If he doesn't check his tone, he'll be out there with shovel in hand building the well.","post_message":"Maybe not you sir, but Mexico is paying for it!"},{"comment_id":"642882945885651","commenter_b":"Not really. Go read history..that's a facade...","commenter_a":"LOVE the Bush family! So presidential, respectful, and patriotic. Something I've missed for the last 8 years and the coming 4 years.","post_message":"President Obama, President George W. Bush, First Lady Michelle Obama, former First Lady Laura W. Bush, and others speak at the opening ceremony of the Smithsonian National Museum of African American History and Culture."}]
