[{"comment_id":"10153257961321162","commenter_b":"They should crucify her.","commenter_a":"Wtf people come on!!","post_message":"DEVELOPING: The bodies of two children, ages 11 and 14, were found dead in a freezer, and the mother is being held as a person of interest @webpagelink"},{"comment_id":"1811838059034995","commenter_b":"And her answer is I don't have an answer for you. Really because you know the answer already bitch","commenter_a":"Love this guy. So to the point it's pathetic. And I can't answer anything.","post_message":"Trey Gowdy utterly DESTROYS this liberal...."},{"comment_id":"10157409839305389","commenter_b":"CROOKED HILLARY everytime she Open her Mouth LIES come out !","commenter_a":"definition of a liberal: liar, thief, flip-flopper and now CORRUPT","post_message":""},{"comment_id":"999058010215871","commenter_b":"Only palestinian tribe are Jews enemie because predatory tribe wants to grab everything from the Jews Included the History","commenter_a":"It is good you have such a strong army with all the enemys around you! May God be on your side!","post_message":"A beautiful moment full of love and appreciation at the 2016 Jpost Annual Conference. Share this video if you think that the Israel Defense Forces is the greatest army in the world!"},{"comment_id":"1149506871736008","commenter_b":"You're welcome.","commenter_a":"What an embarrassment this guy is. Shameful. smh....","post_message":"President Obama took a jab at the so-called \"birther\" movement on Saturday night while in Kenya, his father's homeland."},{"comment_id":"480993755358552","commenter_b":"She must be from NYC she can go to hell","commenter_a":"Screw her","post_message":"This Democratic congresswoman from New York just announced her plan to reduce gun violence. I wonder how it will be received."},{"comment_id":"1097322517004941","commenter_b":"#LockHerUp","commenter_a":"Hillary Clinton is a Criminal, who should be in prison, not running for office!","post_message":"\"I think my whole life has been about handling pressure. I think I have a great temperament for winning, 'cause I know how to win.\" Donald J. Trump argued that in comparison, Hillary Clinton is \"a loser\" who \"doesn't know how to win.\""}]
