[{"comment_id":"1069087446447636","commenter_b":"Put her on the street .","commenter_a":"She looks flashy","post_message":"The liberal media loved Michelle Obama's tang SOTU dress. Take a guess at how much it cost."},{"comment_id":"10155053985253545","commenter_b":"No job, old, divorced, and very ugly ignorant from the inside... She needs a complete make over inside and out and in need of a man You say you know everything can you please direct us to facts ? Post them on here please... @username","commenter_a":"He had 23 years to make his American dream legal no feeling sorry for him sorry illegal is illegal look up the word illegal it doesn't say you get rewarded for doing illegal actions","post_message":"Daniel Ramirez Medina, who was brought to the US illegally as a child but allowed to remain under an Obama administration policy, is suing the federal government over his arrest and detention by immigration agents."},{"comment_id":"1230794190274923","commenter_b":"Umm for a free orgasm I bet you would.","commenter_a":"@username how do we get our hands on some of those mushrooms!","post_message":"This fungus can give a woman an instant orgasm."},{"comment_id":"636469079877004","commenter_b":"Send her back to her own country so she can mooch off of their welfare system, not ours! We have more than our fair share of moochers as it is!","commenter_a":"Send her back really quick........","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"10153665410768352","commenter_b":"Where is that bitch I want to slap that Bitch","commenter_a":"So sad ...so many stories lately of mother's loosing their minds....it would be really nice if dad's would start manning up and helping more.","post_message":"A Hungry 5-Year-Old Dials 911 Pleading For Food After His Mom Abandoned Him And A 10-Month-Old Baby At Home Alone"},{"comment_id":"10154327831686509","commenter_b":"If this candidate is the best the Republican Party has to offer - why vote? Hillary will win! Trump doesn't nothing but trash! What is he going to do for this country other than blame everyone else?","commenter_a":"Sorry Tom. But I like Trump. I like strong men. Who make strong decisions. And I thing he is what we need at this time.","post_message":"For Donald J. Trump, Christmas doesn't seem to be the season of peace"},{"comment_id":"1763785047184730","commenter_b":"Nice mouth for a lady?","commenter_a":"and this is supposed to negate every racist, woman hating, derisive thing he's said in the past 9 months???? Fuck off!","post_message":"Do you support Trump?"}]
