[{"comment_id":"10155022062873984","commenter_b":"Support the Gaines-not the pastor!","commenter_a":"Yes I stand for u chip and joanne","post_message":"'Fixer Upper' stars Chip and Joanna Gaines are being targeted by the media for their church's support of traditional marriage. Liberals are trying to destroy the Gaines family, and now they need your support more than ever. Stand behind Chip and Joanna Gaines and fight the liberal media by signing this petition!"},{"comment_id":"943023235797122","commenter_b":"And California lets the illegals vote so it is no good!","commenter_a":"California and NY for Hillary of course.... Trump the rest of the Country so","post_message":"Hillary Clinton won the popular vote for President by almost 3 million votes. Donald Trump will be inaugurated as the next President. That doesn't make sense for a democracy. The electoral college system needs to be changed."},{"comment_id":"1120798904674131","commenter_b":"#NeverCrookedHillary #HillaryTheLiar","commenter_a":"If taxes will pay for it, and I pay taxes, shouldn't this read \"How much money will Hillary's plan cost you?\"","post_message":"Whether you already have student loan debt or you're preparing to go to school, Hillary's college plan can help you save money. Find out how much using our new calculator: hrc.io/2cH4yGX"},{"comment_id":"10154466445410399","commenter_b":"@username Don't you have some wheelchairs to kick?","commenter_a":"The mom was an anti-Trump plant using her kid as a tool -- so it is another non-troversy for those fearful of the complete Clinton crushing coming tomorrow.","post_message":"“The crowd started chanting 'U-S-A' and pushing his wheelchair,” his mother said. “We were put out by security. Mr. Trump kept saying, 'Get them out.' \""},{"comment_id":"861742507286409","commenter_b":"This is a beastly crime Do what should be done to an inhuman beast! KILL IT.","commenter_a":"Beat him to death like he did the veteran","post_message":"Refugee Charged With Murder After Beating 97 Yr Old WWII Veteran To Death. No media outrage, no riots, nothing. What do you think his punishment should be?"},{"comment_id":"10153083604111350","commenter_b":"They have noses ! Lori Askeland","commenter_a":"Please be sure to share that Etsy link when she does start a page up!! I'm interested in these adorable dolls!","post_message":"We just love the way this artist transformed these dolls -- they look like kids again! Click to check out all the awesome make-unders."},{"comment_id":"509520402579803","commenter_b":"I see the women back of her. The men look like they have been photo shopped. Or they are pansies and do what their wives tell them to do. Maybe they are cardboard cut outs.","commenter_a":"Ever notice how the Dems always have people behind them when they're making speeches? They must have to promise to cheer a lot and be supportive. One boo and they're carried out by security.","post_message":"\"Donald Trump says I’m playing the woman card. Well you know what I say if fighting for child care, paid leave, and equal pay is playing the woman card – then deal me in!” Moments ago, Hillary Clinton gave a speech responding to Donald J. Trump's criticism."}]
