[{"comment_id":"1170836056328262","commenter_b":"The last time I posted something about the politics of these bitches, I got dozens of whining bitches, men? and women, extolling on the vitues of these sacks o shit. Piss on 'em. Bring it on bitches!!!!!!!!!!","commenter_a":"GO DIXIE CHICKS--FREEDOM OF SPEACH-TURN TEXAS BLUE--","post_message":"Some Donald J. Trump fans attended this concert wanting to get away from politics and just have a good time listening to music. But then they noticed what the Dixie Chicks has in the background during one number. After that, Trump fans in the audience were absolutely furious... and for good reason. This is sick."},{"comment_id":"932721720195935","commenter_b":"who is wiping out Africans?","commenter_a":"They need to do something before brazil becomes the next africa or Australia....white people taking over while the indigenous people get wiped out.","post_message":"EXCLUSIVE: Brazil, the World Second-Largest Black Nation, Has Been Taken Over by an All White Male Cabinet #ABSArchives"},{"comment_id":"960983097307632","commenter_b":"At the last supper, JESUS told the disiples that if they had own sword, to sell the cloak to by one. Peter was carrying in the garden. This old mam does not know the BIBLE.","commenter_a":"If you own a gun you can't be a believer??? God has not revealed that to me. Where in scripture did He reveal that to you your holiness???","post_message":"Can you believe what the Pope said about gun owners? I'm stunned: @webpagelink"},{"comment_id":"10153513530884456","commenter_b":"Yeah right. @webpagelink","commenter_a":"I have learned through the years that you initially say what is in your heart. Her statement trying to brush away her post is BS and everyone including herself knows that. Her feelings will not change, she will simply do a better job of hiding them. The commission and the public should call for her resignation.","post_message":"An elected Montgomery County official has released a statement following a controversial post on Facebook, which has sparked outrage among Montgomery County leaders and citizens. @webpagelink"},{"comment_id":"10154250290881337","commenter_b":"YES, WE UNDERSTAND THAT YOU ARE NOW A WOMAN, DO US ALL A FAVOR & STOP THROWING IT IN OUR FACES YOU BINT !!","commenter_a":"Please go away now. Everybody's over it","post_message":"Caitlyn Jenner is taking Donald J. Trump at his word..."},{"comment_id":"1188535021166526","commenter_b":"This is ridiculous! Impeach her and be done with this !","commenter_a":"\"Just because 5 Supreme Court judges make a ruling, it not a law,\" said Kim Davis's 4th and evidently very well-read husband","post_message":"Kentucky clerk Kim Davis’ husband Joe says his wife will never resign and calls out the judge who ordered her behind bars. @webpagelink"},{"comment_id":"10153409867621051","commenter_b":"Where is your neighborhood bitch I'll be there with bells on think it's a game","commenter_a":"You darkies try and pull a stunt like that in my neighborhood , you'd be leaving in a body bag . KKK TIME !!","post_message":"Beating this teen girl senseless wasn't enough for these women. They also decided to leave a special message on her forehead."}]
