[{"comment_id":"371959982974642","commenter_b":"@username, Pelosi sucks!!!!!!!","commenter_a":"Teddy, you little Canadian anchor baby, it's time for you and me to have a little heart to heart talk. Firstly, let's face the facts. The people have spoken and it's Trumps year. Now there's two ways you can go here. You can fight tooth and nail to the bitter end. You'll lose and forever be seen as the jerk who tried to thwart the will of the people. Your political career will be over! Or, you can drop out and get behind Trump. You'll be seen as the man who helped to reunite the party and defeat Hillary Clinton. Play your cards right and you could set yourself up for a top position in the Trump administration. You're a young man Ted. After a successful 8 year Trump presidency, you could be in position to be the natural heir. Remember your hero, Ronald Reagen ran against Ford for the ...","post_message":"LETS MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10154780678681509","commenter_b":"The day has finally come when guys can legally go into a womans bathroom lol thats amazing","commenter_a":"There's no recorded incidents of trans people doing anything untoward in rest rooms - Republican Christian politicians on the other hand, there's lots! Ban them.","post_message":"It's deadline day for North Carolina Gov. Pat McCrory. The U.S. Justice Department says the state's controversial bathroom law is in violation of the Civil Rights Act and gave him until today to respond. McCrory says what he chooses to do goes beyond the Tar Heel state -- it will affect the majority of Americans."},{"comment_id":"726323540858316","commenter_b":"Meryl shut your hole, no one cares what you have to say. Matter of fact put your money in California and pay their way. You are a dried up old hag from the movies and you didn't get their by yourself. We put you there. Get the hell over it and go get laid. LOL you probably can't even get that.","commenter_a":"Dodo. She will not only in be hibernation but soon will be extinct","post_message":""},{"comment_id":"588768447914861","commenter_b":"Good night bitches","commenter_a":"Well if ur dumb enough to punch urself in the face then ur dumb enough to not know Trump is the MAN and Hillary needs to be hung for treason and letting our people die in Bengazi","post_message":"For those who missed: @webpagelink"},{"comment_id":"10155358304877439","commenter_b":"Think someone must be shitting they're pants cause this brave WOMAN is gonna sort the RATS out..😂😂😂","commenter_a":"This is a threat. He should be arrested and jailed.","post_message":"A 24-year-old Muslim blogger and so-called human rights activists has called for the slitting of France's Marine Le Pen for her conservative political views."},{"comment_id":"10154066613342908","commenter_b":"It already IS that way. I'm all for him too, but he's big moneys' worst enemy.","commenter_a":"Tell 'em like it is, Bernie!!!","post_message":""},{"comment_id":"1281508448553159","commenter_b":"She probably have a better shot at playing the Wisconsin lottery !","commenter_a":"Man sues Crispy Cream because the blueberry doughnuts don't have the same nutrients as blueberries.","post_message":"Yeah, she's totally got a shot at winning."}]
