[{"comment_id":"1738986173036273","commenter_b":"@username : go away Trump or Bernie lover . Vote for Hillary","commenter_a":"Love Her! @username will be our next President of the United States of America!","post_message":"\"Clinton is a master at identifying problems and coming up with plans to solve them. There is seemingly no crisis too small to escape her attention, no subject outside her wheelhouse.\""},{"comment_id":"10153309975398128","commenter_b":"Rich girl with bad credit","commenter_a":"Let us all shed a tear for the rich girl...","post_message":"Even the daughter of the CEO of the largest U.S. mortgage lender found it hard to buy a home in one of the country’s hottest housing markets."},{"comment_id":"915633041826559","commenter_b":"Nah she just pays for herself. Greedy money grabbing witch.","commenter_a":"And so............she pays her female staff less thrn her male staff. GOOD job hillary","post_message":"Equal pay isn't a women’s issue. It's a family issue. It's an American economic issue."},{"comment_id":"994387677320953","commenter_b":"That witch is who is teaching our children","commenter_a":"This man is on point👍🏾","post_message":"Woah, THAT escalated quickly! What's YOUR opinion?"},{"comment_id":"683458785174693","commenter_b":"No Whoopie it's the exact OPPOSITE!!!! We did our homework on Corrupt Lying Criminal Killary Clinton and her open border policies and that's exactly why we voted TRUMP!!! Dumbass Racist!","commenter_a":"You didn't do yours.","post_message":"Whoopi Goldberg just scolded millions of Americans on The View. Apparently if you voted for Trump, it's because you \"didn't do your homework\" on Hillary."},{"comment_id":"10153814640313701","commenter_b":"He needs to be locked up and the key thrown away!","commenter_a":"Not to judge people on appearances, but I would seriously reconsider allowing my kid to be alone with the likes of that creep!","post_message":"A court document states that Toman admitted to sexually abusing a girl when she was between the ages of 11 and 17."},{"comment_id":"10155365024480354","commenter_b":"Loony witch....","commenter_a":"if you don't like it here LEAVE. There are plenty of non whites that are racists and fat and you seem to ne a racist yourself lady","post_message":"\"All the people who are crunched into the middle of America, the real fat and meat of America, are these racist conservative white people who live on their farms.”"}]
