[{"comment_id":"1175985589130223","commenter_b":"Eww she be ugly scary","commenter_a":"why is this infidel a councilwoman in the first place???","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"834219746615367","commenter_b":"It's hard in that situation it would be nice if it worked just that easily but pregnancy is a risk and you or I can't force a women to carry a baby.","commenter_a":"Woman's Rights? What about the fathers rights? I had a fiancee who had an abortion about 25 yrs ago. I didn't even know she was pregnant until after the abortion. She had her friend call and tell me. Then wanted me to pay half of the cost. I as the father I should have had a right in the say so for abortion.","post_message":"Five reasons why Matt Walsh says he is pro-life without exception:"},{"comment_id":"1038927489460337","commenter_b":"As for your statement about businesses being free to do what they want, I very respectfully suggest that you read some civil rights history. Businesses used to post signs such as \"Help Wanted--Irish Need Not Apply\" or of course Jim Crow laws. Would you seriously be okay with the return of Jim Crow? Businesses have discriminated in horribly blatant ways. Up until just a few years ago women weren't allowed to be members of all sorts of organizations even though there was nothing about the organization that was impossible for women (they were mostly golf and country clubs). We've had 50 years of the Civil Rights Act which people seem happy to toss out the window. If that were to happen, you yourself could easily be discriminated against with no recourse. Please read some civil rights history and see what incredibly horrible things were said and done to decent, hard-working ...","commenter_a":"I thought a private business owner reserved the right to refuse service to anyone for any reason. We have a sign up at work that says exactly that. I may think his is a dumb reason (even though to him it is not), but he is a private business owner operating on private property and should have the right to do business with whomever he wishes, and not do business with whomever he doesn't wish to do business with. That being said, I wonder what he'd say if he tried to go into a diner for lunch and saw a sign that said \"No Christians allowed.\"","post_message":"A Florida gun supply owner says his store is now a “Muslim-free zone” -- after the deadly shooting in Tennessee. Here's what an American-Islamic group had to say in response: kiro.tv/GunStore What do you think of the owner's actions?"},{"comment_id":"10153157733159197","commenter_b":"She looka likea man.","commenter_a":"the scowl on the face of #3 is pretty funny","post_message":"Have you been to a spa in East Hartford lately? It could be one that was shut down after a prostitution bust-->> @webpagelink"},{"comment_id":"720102644820493","commenter_b":"Niggaz","commenter_a":"Stupid ass liberal niggas..","post_message":"\"All White People Are Racist.\""},{"comment_id":"1757774521121112","commenter_b":"This is so DUMB! I would vote for any Republican before I would vote for \"Killery\" You sure don't know what you will get with her!.","commenter_a":"@username Agreed","post_message":"An RNC delegate just announced the great lengths she’d go to make sure Trump doesn’t win, it's not going to sit well with many people..."},{"comment_id":"10153806132721051","commenter_b":"@username How is going to all those with the wars he's going to start increasing taxes on the middle income and lowering it on the rich. Building a wall where's that money coming from? not Mexico. Putting a 35% tariff on goods from China. Good move Trump and the China and other countries do the same to us. How about that lost American jobs?. You don't think Mexico buys from us? What about machinery, minerals, autos, trucks and military equipment anf farming equipment.","commenter_a":"Interestingly Trump praised all of Obama's policies. Now he says he's done a terrible job. He praised Hillary's job performance as Senator and Secretary of State and endorsed her for POTUS, now he calls her incompetent. Hmm. Should we really elect someone with such horrible judgement?","post_message":"In an interview today, Donald Trump said President Obama has done a \"terrible job\" in office and has allowed countries to take advantage of America. Is he right?"}]
