[{"comment_id":"10154256753938701","commenter_b":"ONLY IN AMERICA RACIST GET REWARDED","commenter_a":"Regardless of if you think the shooting was justified or not this is just callous and tacky. He honestly makes me feel ill.","post_message":"UPDATE: The gun listing has been taken down from the auction site."},{"comment_id":"1052995884768693","commenter_b":"Miley Cyrus? The skank can't even keep her tongue in her mouth!","commenter_a":"Good who needs them!","post_message":"“I will give you a one-way ticket to the country of your choice, with the stipulation that you promise never to come back.” WATCH: Sean Hannity made an offer to the celebrities who are vowing to leave the country if Donald J. Trump becomes president."},{"comment_id":"10152775475131045","commenter_b":"Yes, don't nobody want to mess with this grandma about her grandchildren.","commenter_a":"As a grandparent I cannot Fathom how you could do this. I would protect my children and grandchildren with my last breath","post_message":"Breaking news out of Etowah County tonight. A jury found Joyce Garrard guilty of capital murder in the running death of her 9-year-old granddaughter."},{"comment_id":"717585195090025","commenter_b":"With your logic, then what about all those moms bringing their little boys into women's locker rooms and bathrooms? They have penises and they don't belong there. Send them by themselves into a men's room and wish them good luck with the pedophiles who might be there.","commenter_a":"Just because it happens in YOUR family doesn't mean the whole of the rest of society must have their mores changed because YOUR bro/sis has identity issues. This is not and access issue. This is not and equality issue. This is a PERSONAL issue to approx 1.6 million adults and unless your bro/sis has had their genitals 'fixed' I don't want them wagging about in the locker room with my grand kids and great grands. After the 'fix' is in and they've chemically changed themselves to be more like what they think/want to be, I have less of an issue with it. mym","post_message":"Speaking out."},{"comment_id":"422994894562852","commenter_b":"All but trump need to drop out and quit wasting money! Hell give it to the vets and homeless! Trump!!!!!!!!","commenter_a":"Mitt Romney will hurt Marco Rubio campain, please do let him","post_message":"Help or hurt?"},{"comment_id":"10150886165499999","commenter_b":"feminists are pro-islam, so of course this concerns them","commenter_a":"What does that word 'feminism* do here? Feminism does not say what you should or should not wear. Some feminists may have delusions of what is best for some, but it is still not the feminism itself, what people belive or does not belive.","post_message":"Our top 10 comments of the week."},{"comment_id":"10152998005499753","commenter_b":"Woman you have no clue.","commenter_a":"I think this mom did the right thing with her son. She is a hero to me and I for one would have done the very same thing. This columnist is way off base here and I think she needs to shut it.","post_message":"Toya Graham smacked her son and dragged him away from the Baltimore riots. Now a columnist is ridiculing her and those who support her for the \"abuse.\" @webpagelink"}]
