[{"comment_id":"10152973439396323","commenter_b":"Yeah they need to give you a time frame to study and work then go back to where you came from. It shouldn't be a forever stay for immigrants. Once they get the freedom to stay for long then they going to start taking over. America is a big example, UK, France are big example of immigtants taking over.","commenter_a":"Well they are angry citizens and they have the right to be angry when their government keep dumping immigrants in their country like that, especially those taliban immigrant who want to take over Europe like they did to Spain in the 11th century. Somebody gotta stand up to it while others are bend over backwards to accept the influx of immigrants floading their homeland. Last I recall Germany is a Dutch land not usa.","post_message":"“We just want Germany to stay German!” The rise of the Pegida party"},{"comment_id":"1126946630726765","commenter_b":"@username accepted money/bribe from the Clinton Campaign/Foundation. Recent documents released from wikileaks show! He is part of the problem and is an enemy of Americans at this point!","commenter_a":"clinton-foundation-invoiceAs you can see, the page from the Accounts Payable Invoice lists 14 names to whom the Clinton Foundation had paid considerable sums of money for suppression: $89,000 to A.C.O.R.N. $42,300 to William (Bill) Ayers: unrepentant former Weather Underground domestic terrorist; early supporter of and like ghostwriter for Barack Obama. $109,000 to @username, the radio show host who was an avid supporter of Ted Cruz during the GOP primaries, and continues to be a diehard opponent of Donald Trump. (See suspended by SiriusXM radio for hinting at Trump assassination) $203,000 to Black Lives Matter. $333,400 to the Black Panthers. $10,000 to Bill Kristol, founder and editor of the conservative magazine The Weekly Standard and, like Beck, is dead set against Trump. (See Kristol declares there will be a 3rd-party candidate against Trump) $80,600 to Monmouth University, presumably the university Polling Institute that conducts political and election public opinion polls. $12,000 ...","post_message":"Must watch."},{"comment_id":"1858429714391337","commenter_b":"Canadian has no say. Go home","commenter_a":"He's a fat, ugly, ignorant pig. Hit the sty.","post_message":"Simply pathetic."},{"comment_id":"10153413521069255","commenter_b":"Loose lips sink ships.","commenter_a":"Santorum doesn't even know that the Pope is in fact a scientist! He is a chemist! Santorum is the idiot!","post_message":"Yes. That Rick Santorum said that."},{"comment_id":"10153075860699614","commenter_b":"A women should know her body lets slit her throat!!","commenter_a":"@username I understand what you're saying I've been through it also 3 times but when you see your babies all thoughts of dying and killing go away post part um depression it's just an excuse","post_message":"A young mother in Olympia, Washington, allegedly told police that she slashed the throats of her 6-month-old twins and 2-year-old daughter to keep them quiet for her husband. Christina Booth, who is believed to be suffering from postpartum depression, made a 911 call Saturday sobbing and screaming at the operator that her children would not stop crying. When police arrived they found the twins on the couch crying \"uncontrollably\" and \"bleeding from their necks.\" The 2-year-old was upstairs with a similar wound. All three survived their injuries. Booth allegedly told police \"she knew if she killed all the kids the house would be quiet\" for her husband \"who gets annoyed when the children cry.\" Read KTLA's story here: @webpagelink"},{"comment_id":"2026860724207699","commenter_b":"Dumb bitch","commenter_a":"leftist hypocrite","post_message":"Racist blacks cried foul when Republicans wouldn't support the policies of Barack Obama. But what are you if you don't support Trump? For Leftists, a hero."},{"comment_id":"10152860755326051","commenter_b":"way to go Arizona..mebbe the first shot of the Revolution...we MUST abide by the Constitution or it means NOTHING!!","commenter_a":"What does any one expect for any state to follow the president even when he not following the law of the lands that was put there for a reason... His theory is he have a pen n a phone so that gives him the right to over step the government that he has to go through because it's the Law! He hasn't done nothing for me nor my family, all he has done is given my taxes away freely while we struggle.. Nothing he has done has improve my family living not one bit... At the end of the day we don't need his helping hand at all it does us more harm then good for us... If anyone expect any state to follow the president then he needs to lead by example n follow the laws that was put there way before his time n stop acting like the ...","post_message":"This state just passed a bill allowing them to ignore anything President Obama asks them to do. And that’s not even the most controversial part of the bill."}]
