[{"comment_id":"10154106990671409","commenter_b":"God help us if this is all they can trawl up for person of the year . He is only out to fill his own own pockets further. This misogynistic , ecogotistical man is only out for himself, and will turn out to be america's biggest mistake.","commenter_a":"He's NOT a PERSON!!! He's an orangatan and inhumane ethnocentric lying bully.","post_message":""},{"comment_id":"10154369972274749","commenter_b":"He is just like the guy that went on s rampage at the abortion clinic but this time he us a Muslim which changes the entire situation.","commenter_a":"Come on give the man a break,he was only a good muslim following the teachings in holy quran giving the wife the odd back of the hand and killing gay's is all well and good with islam ! It's us that have to adjust to the way they want us to live","post_message":"Mateen's ex-wife said she had been beaten by him during outbursts of temper in which he would \"express hatred towards everything.\""},{"comment_id":"834137006720940","commenter_b":"It's called dual citizenship, I suggest you look it up.","commenter_a":"I guess the fact that Malik Obama is a Kenyan citizen, currently living in KENYA and cant vote in an American election doesn't mean anything...ughhh once again those pesky things called facts always getting in the way of a good story","post_message":"Wow, President Obama's brother, Malik, just announced that he is voting for me. Was probably treated badly by president-like everybody else!"},{"comment_id":"801744643293915","commenter_b":"#HillNo #HillaRigged #NeverHer #LatinasForBernie","commenter_a":"hillary is going to get the majority of bernie voters to vote for her in the end and trump will be squashed.","post_message":"Of those surveyed, 74% said they have an unfavorable opinion of Donald J. Trump."},{"comment_id":"10153702607362014","commenter_b":"Heck yes I'll be trying this!","commenter_a":"This makes me think of good luck Charlies Bob-burrito lol","post_message":"It's the hybrid you've always hope for (or quite possibly not)."},{"comment_id":"10154771677946602","commenter_b":"CB=gotohell!!","commenter_a":"Div 2. LMFAO!! Football is an abomination and now BB is a JOKE. What the HELL happened???","post_message":"For the second game in a row, sophomore Jalen Adams carried the offense. UConn Men's Basketball will play Oregon tomorrow."},{"comment_id":"10155053775333984","commenter_b":"Maybe someone should shove a fork up your ass bitch","commenter_a":"I hope the government is checking the silverware and other furnishings of the WH before the Obamas leave...... we all remember what happened when the last democrat family left the White House.......","post_message":"As the Obamas leave the White House, Congress has some bad news for them... and this time, they're delivering it to MICHELLE Obama. See the bad news they have for the first lady while she's on her way out the door..."}]
