[{"comment_id":"10153796202658797","commenter_b":"I sure am glad this lady didnt work at a bank....","commenter_a":"really?? you're going to fire a pregnant employee for being robbed? how dumb and stupid and idiotic can they be? are they blind and deaf SHE JUST GOT FREAKIN ROBBED. i say sue them dumbasses","post_message":"YOU'RE FIRED! Marissa works at a fast food place. She’s 5 months pregnant. Imagine her terror when a gunman jumped the counter and demanded money. He got away with nearly $400. But Marissa says the store blames her. They gave her a choice: She can pay back the money or lose her job. But the store has a very different story:"},{"comment_id":"842682652588978","commenter_b":"She needs to be kicked out of our country, we don't need trash like her kind around.","commenter_a":"Here's another puke, wants everything America has to offer but can't be happy with that, maybe the next time she appears in public, the police should not lift a finger to give it any protection, then she'll probably get stomped under the crowd, and she deserves every foot that would trample her arse!","post_message":"It is people like her that perpetuate hate. Police are the people that keep her safe. Do you think Beyonce needs to learn some respect?"},{"comment_id":"10156317776015354","commenter_b":"Stupid ass!!!!","commenter_a":"Sounds like a plan to me.","post_message":"“No surprise that someone who makes a living glorifying crime and violence is a cop-hater, too.” MORE..."},{"comment_id":"824242924358757","commenter_b":"You must be an ugly Bastard","commenter_a":"No money no love:)","post_message":"Only A Weak Man Would Make A Woman Love Him And Refuse To Love Her Back"},{"comment_id":"10156504920260389","commenter_b":"Yes. Keep replying on this joke of a feed.","commenter_a":"Do we expect Sheriff Clarke to say anything different. Why doesn't Mr. Hannity ever have some real dialogue on his show. I would have more respect for him. I have been following Mr. Hannity for about 10 years now. His revolution is taking forever. I don't think it will ever come. if Mr. Trump is elected is that the revolution. Senator Cruz is the only true Conservative. But in today's world conservatism means unyielding which is not a good thing. President Reagan would be turning over in his grave if he saw what was happening to the conservative movement in our country today","post_message":"Milwaukee County Sheriff David A. Clarke Jr. had some strong words on \"Hannity\" tonight for President Obama, Hillary Clinton and the Democratic Party in the wake of Obama announcing his planned executive action on gun control."},{"comment_id":"10154141343121336","commenter_b":"Trump won every state TONIGHT and barely lost Ohio.. why is it even still a question of who WE THE PEOPLE want and NEED to get behind?? Wake up! #NoHillary","commenter_a":"Trump is a buffoon. Hillary will bury him in a landslide. We must nominate a person who could win in November...a ticket like Kasich/Rubio, Kasich/Cruz, or Kasich/Fiorina.","post_message":"“Here’s our vision for America: It’s an America with a brighter future. It’s an America with greater opportunity for our kids… It’s an American with more liberty and more safety and more security. It is America that is greater tomorrow than it is today and than it was yesterday.” – Ted Cruz"},{"comment_id":"10153691718919062","commenter_b":"Maybe if you stopped seeing breasts as sex objects, this wouldn't be an object. Maybe if your dog of a husband can't stop looking at a breastfeeding woman, the issues lie in your relationship and not with the poor woman trying to feed her baby. Just saying.","commenter_a":"Not in public. I breast feed my daughter but some things should be private! When I go out to eat I dont care to be paying $80 and having to see someone elses boobs out of the corner of my eye. Then when you have younger children they point and ask why that mommys boob is showing & what is she doing? Then there are guys who get distracted by anything-anything at all. So- this is dinner and porn all in one. Thanks for ruining our night out.","post_message":"TONIGHT AT 10: A major apology from a Texas coffee house after a breastfeeding mother is told to cover up. Should breastfeeding be allowed anywhere, or should there be designated areas?"}]
