[{"comment_id":"848836128595379","commenter_b":"Eat shit loser!","commenter_a":"No one has won any war against Afghanis.It is history.","post_message":"When you're on a mission to defeat the Taliban, but fly fishing is life. ~Josh"},{"comment_id":"10153369790181770","commenter_b":"SHES A WITCH!!!","commenter_a":"hillary is an idiot , how could anyone vote for someone so evil, she has to be stopped","post_message":"Clinton thinks everything is fantastic at the U.S.-Mexico border."},{"comment_id":"10152594286750779","commenter_b":"I hope she never gets a boob job","commenter_a":"Did she trademark small breasts as well?","post_message":"If you want to \"Party Like It's 1989\" to \"This Sick Beat,\" you better ask Taylor Swift's permission first. The pop star has trademarked those phrases – along with \"'Cause We Never Go Out of Style,\" \"Could Show You Incredible Things\" and \"Nice to Meet You, Where You Been?\" – with the U.S. government."},{"comment_id":"10155218538748690","commenter_b":"Hahahaha hahahaha hahahaha hahahaha UAE seeks to kick out all Pakistani expatriates and destroy CPEC by 2018 but inshallah we Pakistani will not succeed them in thier nefarious purposes. No voice for Manmyar, Kashmir, Palistine, Syria, Iraq, Libya, Afghanistan, and Chachniya etc. Make your own home first then think about mars.","commenter_a":"He who controls the Spice controls the universe!","post_message":"\"The landing of people on other planets has been a longtime dream for humans. Our aim is that the UAE will spearhead international efforts to make this dream a reality.\" @webpagelink"},{"comment_id":"10153933282696350","commenter_b":"Bethsaida Yadnara Why have their own muslim brother's turned them all away??? Jordan, UAE, Dubai, Saudia Arabia?? Those are some very rich countries, right around them.","commenter_a":"They don't belong here...and sure their parents are collecting major benefits, just for entering the country.","post_message":" know people have mixed feelings, and they can be afraid because it's the unknown. But the more we get to know these people, the more the community gets to know them, the more that's just fading away.\""},{"comment_id":"10154485862326037","commenter_b":"Sure, if you choose to believe the people in collusion with the election fraud.","commenter_a":"If you wanted unity, you should have allowed the voters to choose the nominee instead of allowing your corporate masters to do it.","post_message":"DNC chair Marcia Fudge calls for unity amid a chorus of boos and jeers from Bernie Sanders supporters: \"We're all democrats\""},{"comment_id":"10153117013549740","commenter_b":"We wouldn't have any thugs!","commenter_a":"Good idea","post_message":"\"We need to get around this idea that you can resist arrest. You can’t. You just can’t do it. It results in potential injuries to the officer, to the suspect. And we need to change that, and the way to change that is to start penalties for it.\""}]
