[{"comment_id":"1085364771487531","commenter_b":"If we accept refugees we are accepting criminal cause that what they are disguised Isis Islam radicals","commenter_a":"Thanks governor for taking s stand To no refugees","post_message":"I appreciate our Gov. Nathan Deal taking a bold stand on this issue. We must secure our borders and know who is entering our communities. #gapol"},{"comment_id":"10154120407252908","commenter_b":"attaboy Davies pass the buck.","commenter_a":"I've been trying to figure out why someone would be a Republican and for the life of me I just can't find an answer.","post_message":""},{"comment_id":"687141811427171","commenter_b":"Impeach her husband and she'll go away with him!","commenter_a":"Look who's being bossy now!","post_message":"Michelle Running Campaign To Ban ‘Offensive’ Word From English Language. She has completely lost it. Do you find Michelle Obama offensive?"},{"comment_id":"10154220777628487","commenter_b":"u rude fuck","commenter_a":"I always find it irritating that a typical response to vegetarians/vegans is something along the lines of \"it's fine as long as you don't push your views on others.\" As a lifelong vegetarian for ethical reasons, I go about my day constantly reminded that the vast majority of the people I encounter are active proponents of what I consider to be systematic violence that trumps the holocaust. Imagine believing that and being expected never to mention it. I actually don't mention it, because I've found that people simply do not give a fuck about the suffering of animals, and it is far too depressing to endure such conversations. But it continues to irritiate me when people say, it's fine, just don't push your views on others.","post_message":"Russell Simmons, founder of Def Jam and author of \"The Happy Vegan\", teaches us how to defend the plant-based diet that many love to hate."},{"comment_id":"1091727720848238","commenter_b":"Those people should be sterilized","commenter_a":"Everyone who is against this is a damn hippje","post_message":"This is HUGE news."},{"comment_id":"10152676681972507","commenter_b":"Not to mention that anti-semitic statements are illegal in France.","commenter_a":"In France you pick up 8 year old kids for what they said in school. I don't care how nationalistic you can get over this, this shows the French authorities are massive hypocrites when it comes to 'Freedom of 'Speech.","post_message":"He's 8."},{"comment_id":"10152874752876336","commenter_b":"Don't let her have kids exterminate this animal.","commenter_a":"Shoot on sight!","post_message":"Manhunt underway: Police are searching for Hayat Boumeddiene, a suspect in Thursday's murder of a French police officer. Tune in to Fox News Channel for special coverage now."}]
