[{"comment_id":"484366015087312","commenter_b":"They are all racist. They all hate white people. Yet they couldn't live without white people. Infact if it wasnt for white americans they would still be enslaved around the world. This country didnt start slavery, it was white americans that put an end to slavery around the world. its all they have is the slave thing without it they would have to evolve or take responsibly for thier inability to evolve .","commenter_a":"Why can't President Obama be impeached?","post_message":"National controversy after Juan Williams says something shocking. Juan is racist, plain and simple. Do you think FOX should fire Juan Williams?"},{"comment_id":"935330543153792","commenter_b":"Kiss your mother with that tongue Karen?","commenter_a":"Excellent news. The courts have prevented the Harper regime from taking over the judicatory.","post_message":"It was the third time Khadr's case has been before the Supreme Court of Canada, and the third time the justices have ruled in his favour."},{"comment_id":"10153604901701167","commenter_b":"Either way she doesn't have a dick anymore.","commenter_a":"Right. Sexual predators never pretend to be transgender to gain access to women they wouldn't have as a man. Never! Umm....errr.... @webpagelink","post_message":"A man has never pretended to be transgender to sneak into a women's restroom. It's just not a problem that exists."},{"comment_id":"10152680682100950","commenter_b":"Taniesha","commenter_a":"Wow","post_message":"The police officers who discovered the 18-month-old girl dangling in a car seat inside the submerged car said they heard a mysterious voice begging for help: \"Someone said 'help me' inside that car.\" Another officer also heard the voice: \"(It) wasn't just in our heads.\""},{"comment_id":"1238750836185439","commenter_b":"Maybe we \"Military Mothers\" should go protest the \" Temper Tantrum Party Protester's\" for BURNING OUR AMERICAN FLAG that is on our son's and daughter's uniforms. Wonder if that would take away their little spot light and five seconds of fame?","commenter_a":"After watching the new \" Temper Tantrum Party \" BURN OUR AMERICIAN FLAG last night, I'm voting straight up Republican Party Ticket for every Election... big, or small... for the REST of my life.","post_message":"\"We are living in an amazingly destructive, politically correct environment here in America. Just because something offends you, doesn't mean you have the right to hurt or destroy.\" Bill O'Reilly had some strong words for left-wing \"agitators\" who refuse to accept Donald J. Trump's victory in a fair and honest election. @webpagelink"},{"comment_id":"10156146715050354","commenter_b":"Who the fuck is indoctrinating children?","commenter_a":"It is what perverts do !","post_message":"Cha-ching! Tax dollars, y'all!"},{"comment_id":"10153855979179099","commenter_b":"The wife is the boss in every house hold, where have you been? #Happywifehappylife","commenter_a":"Hope those who do never get another nomination!! Btw Will, grow a set. We can see who's the boss in your house!","post_message":"Will Smith will join wife Jada Pinkett Smith in not attending the Oscars this year. @webpagelink"}]
