[{"comment_id":"1761239377456582","commenter_b":"Why won't she just tell the story on camera instead of wasting all that paper? And why were they recording this in the bathroom? And why were two grown women laughing and taking pictures of her in the store? And why the hell didn't her mom beat the living hell out of them? So many damn questions. Wtf..","commenter_a":"People are getting DNA and hormones mixed up as if they are the same or even similar.","post_message":"Transgender teen shares powerful message on bullying: \"We're not a threat. We are just like any other kids. We only want people to accept and love us for who we are.\" @webpagelink"},{"comment_id":"10153754678291336","commenter_b":"Can't play politics and disarm society if you make the kids safe! Gotta get a few kids killed to advance if you're a communist. The end justifies the means with these Freaks.","commenter_a":"jerry brown is a fool","post_message":"Does this make schools safer?"},{"comment_id":"1666312230322556","commenter_b":"what an idiot. she luck to b alive","commenter_a":"@username Whosoever","post_message":"This is why you don't mess with truckers."},{"comment_id":"10153797502305779","commenter_b":"I wonder how people react to a naked hillary statue where you get to see that bitch in all her glory. Lol. Bet people would respond differently","commenter_a":"Gross!!!! The looks are uncanny!!!!!","post_message":"New naked Donald J. Trump statues appeared today, and now they're legal, backed by a mega-developer of their own."},{"comment_id":"384888735032754","commenter_b":"Beautiful.","commenter_a":"just awesome just like his dad great job","post_message":"Just like his Father...AWESOME!"},{"comment_id":"10155170466528984","commenter_b":"Hire American instead of illegals","commenter_a":"COWARDICE","post_message":"This just in..."},{"comment_id":"1099293306823253","commenter_b":"Are you Serious ??/ \"You can keep your doctor \" LIAR Caliphate!","commenter_a":"The Classy president!!. The other side can run there collective mouths about things they have know idea about!!. ignorance is running wild in a America!!!.","post_message":"Gallup approval ratings show that President Obama is the most popular second-term president in recent history. Do you approve of the work Obama is doing in office?"}]
