[{"comment_id":"1206621306053557","commenter_b":"Truly this HYPOCRITICAL woman with NO MORAL CONSCIENCE and u hope one day she will be in a Federal Lockup w/ The Clinton CRIME FAMILY along w/ OSAMA OBAMA and they'll have time to know GOD...","commenter_a":"Piss off and die, libtard.","post_message":"WOW..."},{"comment_id":"1027678373922850","commenter_b":"Yes Michael, when an intruder breaks in your home, watch him rape your wife while you blow a whistle. Makes perfect sense. Smh Humans have the right to defend their home and family. I would rather rott in prison, than do nothing.","commenter_a":"Stupid brits. Lol","post_message":"Self-defense is now ILLEGAL in the #UK"},{"comment_id":"1648471502112051","commenter_b":"It never bothered Hillary, at least he recognizes it and is willing to seek advice.","commenter_a":"He's getting bald.","post_message":"This is not normal. This is not normal. This is not normal."},{"comment_id":"538992992891961","commenter_b":"Girls are just mean....need to face murder charges....they need the death penalty....need to be tried as adults","commenter_a":"They should all get life","post_message":"Three high school girls in Delaware are facing criminal charges over the fatal beating of a classmate inside a school bathroom last month. What could have caused them to do this?"},{"comment_id":"1043659032366340","commenter_b":"Yeah yeah @username, it's airheads like yourself what Trump needs to screw up everything in your country. I will build that wall so that people like you can't come into Mexico","commenter_a":"Look at what Mr. Trump is doing to America as a candidate, dividing it, making everybody fight betweeen each others. Imagine what he would do as president...","post_message":"People could be heard screaming, and Donald J. Trump ducked his head, grabbing his podium with both hands before backing away."},{"comment_id":"10153341159307411","commenter_b":"It will happen. We've cowered to idiots. Time to be unpoloticaly correct. We Americans are fed up. Obama and bush did nothing. Hillary is evil. We need shorter sidewalks and taller fences. These people are evil.","commenter_a":"Those isis fools try and scare people with talk like KKK,Trump,and the Republican party,pay attention and listen it's all the same act.","post_message":"A group of ISIS supporters has threatened to take down Facebook and Twitter -- as well as their leaders."},{"comment_id":"1036060346447359","commenter_b":"No. They're asking for 80million guns to be pointed at their stupid ignorant ugly faces.","commenter_a":"Are they asking for another wounded knee?","post_message":" never seen anything like it, Cleveland resident Sheila Rodriguez told Fox News Latino. everyone is gathered in one place and everyone attention is focused on one place, a lot of things can happen."}]
