[{"comment_id":"1335611113123776","commenter_b":"Give her a Public Horsewhipping too......Fraud","commenter_a":"One down, thousands to go.","post_message":"Former Pennsylvania state Attorney General Kathleen Kane, who came to office on support from gun control groups, has been sentenced on felony perjury charges."},{"comment_id":"902128633188334","commenter_b":"I talked to my next door neighbors about the illegals. They were very verbally upset with the illegals. You see their whole family was born in Mexico and they all moved to Oklahoma Legally. The man told me it took them almost 12 years to get the whole family here. BUT they could have paid smugglers and had them all here in 2 years. They hate the illegals also. They said they give the rest of the Mexicans a bad rep.","commenter_a":"Welcome and thank you for doing it the right way","post_message":"Americas Freedom Fighters"},{"comment_id":"10153725721616770","commenter_b":"Donald is getting rid of illegal immigrants That doesn't belong in America","commenter_a":"Judy white your are a Democratic like them ripping the people of America no jobs Don't you know that God got Donald trump's back Revelation 18 the fall of Babylon and all trades deals .if Hillery Clinton knew god maybe she would be president But she hates god . remember god is greater.any humans On earth no one can overcome what god Has planned can try .","post_message":"New pro-amnesty campaign manager for Donald J. Trump says \"deportation force\" now \"TBD\""},{"comment_id":"10153393648949228","commenter_b":"Actually, it's not normal for any woman to expose herself in public... feeding or not. It's quite self-centered.","commenter_a":"We all have to have something to complain about. It's like the news gives us one good story and the rest has to be bad. Give it a rest people. It's a normal mother instinct. LEAVE IT ALONE","post_message":"\"The mall told me it's perfectly fine, perfectly legal to breast-feed."},{"comment_id":"10154367782019071","commenter_b":"@username...you go girl!","commenter_a":"there u go again with ur propaganda...trying to launch a smere campaign on donald trump..main stream media is pathetic..lol","post_message":"Before becoming Donald J. Trump's chief strategist, Bannon wanted to make a movie with Mel Gibson."},{"comment_id":"990398314328597","commenter_b":"Fucking what the hell why u have to hit a poor guys damn this US is freedom fucking basdard try to find me I kick their ass to hell","commenter_a":"That fuck up stupid cop","post_message":"Listen to an MMA fighter break down the poor training of law enforcement. Source → @webpagelink Filming Cops (Y) Police The Police (Y) H/T Gracie Breakdown"},{"comment_id":"10154227254693256","commenter_b":"So give your vote to Hillary. Obama lover!","commenter_a":"\"NEVER\" - Trump, and that's not a \"Suggestion\" Mr. Trump, and that goes for \"John Miller\" either. What a Joke not him....... LOL! I say GO for it Mitt!","post_message":"Conservatives, even those not all that enamored of him in 2012, are beginning to entertain the possibility of Mitt Romney."}]
