[{"comment_id":"762801500520430","commenter_b":"The poor girl just can't make up her mind, if you want to call it that.","commenter_a":"She is an idiot!! Just like most spoiled rich people!","post_message":"Hypocrisy, much?"},{"comment_id":"1108048615955838","commenter_b":"Betty is a murderer!","commenter_a":"Just joined. Is this purge night or something","post_message":"WATCH LIVE: Protesters are filling the streets in Charlotte after police say an officer shot and killed an armed man. @webpagelink"},{"comment_id":"665234353646282","commenter_b":"Can't make a silk purse out of a sow's ear.","commenter_a":"#klasssa 👌","post_message":"Do you think the Obamas represented America with class as our nation's First Family?"},{"comment_id":"10153046934697894","commenter_b":"#SaveYourself #hatinAssHoes","commenter_a":"Because she can't find a job doing anything else #shade","post_message":"Dawn Richard Announces She’s a New Spokeswoman for PETA (People for the Ethical Treatment of Animals) [Photo]"},{"comment_id":"1561884050498286","commenter_b":"Build the wall !","commenter_a":"Regardless who wins this election... I would NOT live anywhere else but the U.S.A. We may have our differences, but at the end we all work together. It what's makes this country powerful.","post_message":"BREAKING: Hillary Clinton casts her ballot on #ElectionDay in Chappaqua, New York. Full coverage: @webpagelink"},{"comment_id":"10153104580856162","commenter_b":"Them mfs is rodents. And the people who house these things are rodents too","commenter_a":"This is why you don't keep rodents as pets. Technically a ferret isnt a rodent but they are classified as meat eating predators. And who leaves a one month old baby un-attended?","post_message":"BABY ATTACKED: A 1-month-old baby lost a large portion of her face when she was attacked by 3 ferrets inside her home FULL STORY: @webpagelink"},{"comment_id":"924171167620224","commenter_b":"It has to be big for him to screw this entire nation. Very very sad.","commenter_a":"What do you think this administration has on Justice Roberts that would make him vote twice for a law that is unconstitutional...","post_message":"John Roberts again sides with Obama."}]
