[{"comment_id":"1700674326840051","commenter_b":"Leave our flag alone!","commenter_a":"Leave it alone!","post_message":"Men and women have died defending our flag, don't mess with it. Do you think the flag should be left alone?"},{"comment_id":"1665959326994845","commenter_b":"What an ass hole!!!","commenter_a":"He sure didn't forget to LOOK at the camera though. Or.. salute the pilot in the plane. Dipsheep!!!!","post_message":"Obama refused to salute marines exiting Air Force One. That does it. Obama is anti-American and unfit to lead our country. Do you support our Marines?"},{"comment_id":"1859387827662515","commenter_b":"Why is she not in prison????? Any other American citizen would have been hauled off immediately!!!!!!!!!!!!!","commenter_a":"Can't she just go away?","post_message":"SHE'S B-A-A-A-CKKKK!!! Hillary Makes Crazy Video Calling Leftist Troops To Join Radicals In FIGHT Against Trump…\"KEEP FIGHTING!\" [VIDEO] That whole crazy eye thing doesn't appear to be getting any better…"},{"comment_id":"439363889585238","commenter_b":"This not funny I found it tasteless made my blood boil I am seeing red ! Someone needs to stop her from having any more kid someone put the whore to work fast she is hurting all of us","commenter_a":"SEND HER TO IRAN...","post_message":"“I mean, who would want to work in America?\""},{"comment_id":"1757028301196802","commenter_b":"@username more than likely you are a illegal alien .","commenter_a":"Just the thought of having a mother/grandmother in the highest office..refreshing! Go Hillary! Have a great day with your wonderful family!","post_message":"Happy Mother's Day to Charlotte's mom, and my wonderful daughter, Chelsea Clinton."},{"comment_id":"10156406876695354","commenter_b":"lies as much as Obama, anyone votes for this lady is a total idiot, we already have confirmed Muslims coming in with the wave of them as terrorist, needs to shut her mouth with all these lies, you think our economy is bad now vote her in and she will double the debt, no place for this lady in politics.","commenter_a":"Jack ass","post_message":"\"Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" Hillary Clinton is a _________________."},{"comment_id":"1007375585988585","commenter_b":"You're a bitch brady","commenter_a":"Yet another reason to dislike Tom Brady.","post_message":"Tom Brady's support for Trump may be as soft as his balls."}]
