[{"comment_id":"10153575697359087","commenter_b":"I love American Politics... Hillary Clinton is the People's Champion yet she Support the 1994 Massive Incarceration Bill, the 1996 Welfare Reform that double poverty in America between 1996-2001, 1999 Glass-Steagall Act which caused the 2008 Financial Collapse and NAFTA which as a result 70,000 Factories and millions of Jobs have gone Overseas... But hey she can't be judge on her RECORD because she is a Woman and that would be SEXIST...","commenter_a":"This is a garbage article by not even mentioning Bernie Sanders.","post_message":"\"Donald Trump versus Hillary Clinton in November? Don't bet on it.\""},{"comment_id":"685959174927994","commenter_b":"No!!! Piss off bitch!!!","commenter_a":"Absolutely not , you moved to America to benefit from American ways of life and you're participating in the American justice system , and you expect to be changed just for you . I don't think so . You shouldn't even be allowed into the court house let alone the court room for reasons of security .","post_message":"This judge just made a controversial decision... Great. We support this judge 100%. Should this woman be allowed to swear on the Quran?"},{"comment_id":"1286110978131794","commenter_b":"Oh you mean like all the people who first came to America and created the United States? Then took half of Mexico? Oh ok. As long as this is clear and there are no glaring hypocrisies!","commenter_a":"Sorry, incorrect...if you overstay a visa, you are an illegal alien, If you ENTER the country illegally, you are an INVADER!!","post_message":"Allen West Republic"},{"comment_id":"1117028848356591","commenter_b":"An illegal can not vote. Period. God only knows what other conspiracy theories you are listening to","commenter_a":"Another Liberal Lie!!!! Did she make a statement or pose a question? \"If 45% of Americans pay no taxes, should they be aloud to vote?\" They are reaching They are losing and they know it They are getting desperate No choices Lying Old Woman Communist Old Man","post_message":"She has lost her damn mind."},{"comment_id":"10154288935233984","commenter_b":"What a bitch!","commenter_a":"You will know for sure when we run out water","post_message":"Dem Sen. Barbara Boxer just laid into this Catholic priest for appearing to question Pope Francis's warning on the dangers of global warming. Do you think global warming is a hoax?"},{"comment_id":"10155114924485725","commenter_b":"If he was over 18 she will never get arrested","commenter_a":"I don't think it should be a big deal as long as the young man was over 18 years old. If older men can be with young woman why can't older women be with younger men also?","post_message":"A 38-year-old woman has been charged with having sex with her daughter’s teenage ex-boyfriend, police said. More details, and a photo of the accused ----> @webpagelink"},{"comment_id":"1019752221480019","commenter_b":"@username then leave!!!!","commenter_a":"Trump does not represent most people in America and he certainly does not represent me. He may be in office 4 years, but I can guarantee you he will not be in another 4 years after that. We will have war in America because of this!","post_message":"President Barack Obama and President-elect Donald J. Trump just met for the first time — and this is what happened. @webpagelink"}]
