[{"comment_id":"978940745501376","commenter_b":"Fire Her!","commenter_a":"Forgive them; they know not.....wait, let's not.","post_message":"DISGRACEFUL MSNBC HOST: Katy Tur Speaks over the Star-Spangled Banner at Trump Rally (VIDEO) @webpagelink"},{"comment_id":"10154009145851336","commenter_b":"She needs to rot in hell","commenter_a":"Problem is she's been in the public eye for way too long!!!","post_message":"“She is a good, smart, tough person who cares deeply about this country, and she has been in the public eye for a long time and in a culture in which new is always better,\" President Barack Obama said about Hillary Clinton. Do you agree?"},{"comment_id":"10153503495739087","commenter_b":"Shut the fuck up bitch","commenter_a":"Bernie lost, give him money, make bernie feel better with money, Bernie wants peoples money. Trump came in second and didn't ask for a dime. Trump 2016!","post_message":"Bernie Sanders presidential campaign had its \"best day ever,\" raising $3 million since the Iowa caucuses on Monday -- most in the form of small online contributions, averaging about $27 each."},{"comment_id":"10154311772481694","commenter_b":"Just when I stop thinking of him as Vern Schillinger.","commenter_a":"Geez. He must pull the plow at Farmers Insurance","post_message":"Commissioner Gordon is apparently way more into fitness than J. Jonah Jameson."},{"comment_id":"10155980506710725","commenter_b":"@username. I see why you love her lol","commenter_a":"Whoopee","post_message":"What do Amy Schumer and Judd Apatow do when they find themselves stumbling into an Irish wedding? They make the most of it, of course! Watch the wedding crashing incident, all caught on video ----> @webpagelink"},{"comment_id":"10156408466705354","commenter_b":"This woman is so disgusting! I can't even stomach accidentally surfing and the view is on for the second it takes for me to change it!","commenter_a":"Don't watch that show. Should be taken off and replaced with Mr. Roger's Neighborhood reruns.","post_message":"Maybe they should open every show with a preemptive apology for all the mind-blowingly stupid things they're sure to say. VIDEO below of their latest..."},{"comment_id":"10154617085889714","commenter_b":"@username you have a hot wife!","commenter_a":"He dressed as a gypsy gives savvy. This is the bottom for America...","post_message":"Hillary Clinton is “our new president.” Barack Obama is “the greatest president we ever had.” And Donald J. Trump is…. “No comment,” says DJ Khaled. Full interview: @webpagelink"}]
