[{"comment_id":"1349098891770012","commenter_b":"She butchers infants, rapes ad sells and children for the sex trade and you wounder she is breaking a promise? I find it hard to understand how people still defend or are associating with her name. No amount of fluoride can explain this type of behavior.","commenter_a":"once a hi-LIAR-y always a liar.","post_message":"Breaking yet another promise: What a way to fade into obscurity and irrelevance..."},{"comment_id":"10153310405423352","commenter_b":"Girl that's me","commenter_a":"I'm my own team.. Fuck that, once u have a kids, a career and a life them damn friends ain't shit... I'll kick it with all the damn kids","post_message":"Atlanta Woman Says She Was Set Up By Her Bestfriends Who Beat Her And Held Her Hostage For Hours (VIDEO) Be careful who you consider your \"friends\"...So sad, they literally left her for dead."},{"comment_id":"10155365024480354","commenter_b":"Loony witch....","commenter_a":"if you don't like it here LEAVE. There are plenty of non whites that are racists and fat and you seem to ne a racist yourself lady","post_message":"\"All the people who are crunched into the middle of America, the real fat and meat of America, are these racist conservative white people who live on their farms.”"},{"comment_id":"10156352332210354","commenter_b":"whore.","commenter_a":"Another one that is missing all that gray matter between the ears...","post_message":"Feminist Gloria Steinem is a _________________."},{"comment_id":"10154719579276509","commenter_b":"Google princess songs and you'll get the list","commenter_a":"Where can we get a complete list of the songs he wrote for others????","post_message":"A day after Prince’s passing, CNN’s Lisa France answers questions on how the rock superstar impacted the music of the last four decades."},{"comment_id":"1444717595538546","commenter_b":"It not over until it get to the highest court! Just hope we don't allow this time to allow the bad guys get something in the USA! It will not be the rights fault! But as always the left will blame the right, anyway! :(","commenter_a":"This is why America is in this shape, getting a president that would actually work toward putting Americans first is/will be thwarted at every turn.....","post_message":"Appeals court denies DOJ's request to reinstate travel ban"},{"comment_id":"1126542647424270","commenter_b":"@username oh I wouldnt doubt that, that witch needs to go down!!!!","commenter_a":"Not the first time this reporter has accused someone of the same type of assult, just another reporter looking for the spotlight!!!!","post_message":"The Secret Service just dropped a massive bombshell about the charges against Donald J. Trump's campaign manager, Corey Lewandowski... this is huge. What this agent says about the \"assault\" will completely change the case..."}]
