[{"comment_id":"10154356809342654","commenter_b":"DEPORTATE ALL IMMIGRANTS ILLEGAL! God Bless US .","commenter_a":"All the people walking there equals one mexican party or quince lmfao","post_message":"Immigrants who work at dozens of restaurants around Washington, D.C. are participating in the Without Immigrants protest. We're live at Pizzeria Paradiso (Dupont Circle) where managers are trying to get by without their employees AND we're live at the site where protesters are organizing."},{"comment_id":"10155243196880354","commenter_b":"If the border is not closed these terrorists will continue to come into America!!!","commenter_a":"Save the taxpayer some money and just shoot them. Don't tell the world, just shoot them and be done.","post_message":"Meanwhile, as Obama was snapping selfies...."},{"comment_id":"10154007626519456","commenter_b":"Yea, maybe this guy is right...slaves should learn to be free if they feel entitled to it!! Bring back discrimination!","commenter_a":"Isn't the govs job to tell anyone what they have to pay anyone for services. If you don't like what you make, increase your skill set instead of having the gov hold your hand.","post_message":"The bill passed on a 71-31 vote, and will now move to the Alabama Senate."},{"comment_id":"10152834181476135","commenter_b":"Another feminist circle jerk. You silly basic b*tches need to go take a hike and get off Facebook and tumblr.","commenter_a":"The amount of ignorance in these comments.....","post_message":"Cortney Bogorad says, despite the embarrassment she felt after the incident, she is taking legal action so no one else goes through a similar experience."},{"comment_id":"1383272325035057","commenter_b":"Donald is a leader and believe in America! Vote Trump 2016!!!!","commenter_a":"You can bet Lying ted is on that list!","post_message":"The process, meanwhile, is the only reason he will get even close to 1,237"},{"comment_id":"1801495493414518","commenter_b":"your witch is going to fry","commenter_a":"Can Trump even go to the bathroom without retracting or sending a \"revised\" tweet after his handlers yelled at him? Losing votes every day he is! Such a dope.... A con and dope. Sad.. As at one time I liked the guy???","post_message":"Donald J. Trump received swift backlash for tweeting about the fatal shooting of NBA star Dwyane Wade's cousin and writing, \"African-Americans will VOTE TRUMP!\""},{"comment_id":"1078205312195129","commenter_b":"She will walk! MSM will guarantee it.","commenter_a":"She served on the Watergate committee. That's where she got the idea. Hillary did get fired from that commission for lieing. She is the original old crony.","post_message":"Hell, Nixon only erased 18 minutes. Hillary erased literally everything."}]
