[{"comment_id":"864666960316353","commenter_b":"I know! Power to the feminists. But that would make me feel dirty .","commenter_a":"Grace Te Moananui @username","post_message":"Armpit Hair Is Trending, And It’s A Step Forward For Women Everywhere"},{"comment_id":"565976566923900","commenter_b":"She is a serial killer.","commenter_a":"They could prove that she was a serial killer and they wouldn't care","post_message":"Here we go..."},{"comment_id":"10153407697891519","commenter_b":"Hope it's a woman.","commenter_a":"I'd like to hear Feines' opinion on this. I would also like to know what other actors were applying for the part.","post_message":"We're actually embarrassed for everybody involved..."},{"comment_id":"1036464773060661","commenter_b":"Their idiots!!","commenter_a":"Keyword: Care. Democrats generally care for the American people, Republicans only care for their special interest groups, their corporate friends, and anyone else that can boost the thickness of their wallets. Conservative is a joke... conserve what? Anything that helps them and not the the country as a whole.","post_message":"ZING!"},{"comment_id":"10154765929828812","commenter_b":"That retort would demand a Breathalyzer test immediately in any Protective Custody or Dangerous-ness to the public situation. The man is incapable of formulating a complete and comprehensible sentence in English. Does he, maybe speak English a second language like some immigrants do? I've watched people get detained/PCd for less. He's going to lead the free world. We have illuminated the planet with a new low in the dummie-ing down of America.","commenter_a":"One temper tantrum away from WWIII","post_message":"Donald J. Trump says he \"could tell\" from intelligence officials' \"body language\" they were unhappy Pres. Barack Obama \"did not follow what they were recommending.\""},{"comment_id":"965089543550794","commenter_b":"Sounds like pure jealousy. Cal looks better than some women","commenter_a":"but why do they all have the need to look like hookers?","post_message":"She only realised she was transgender when she dressed up in hot pants and a wig for a joke"},{"comment_id":"10153102217682994","commenter_b":"Thugs","commenter_a":"Thugs","post_message":"Authorities say a modern-day 'Bonnie and Clyde' situation is unfolding in the Southeast right now."}]
