[{"comment_id":"10153841941246770","commenter_b":"I'm not voting for the CORRUPT, LYING, MURDERING, CROOKED iLL SICK PERSON! I'll VOTE FOR TRUMP, you know why because the LIBERALS are a bunch of sick twisted people who do give one crap about this country!!! #NEVERHILLARY","commenter_a":"You ad your husband are a perfect for each other. Both dumb as a brick!","post_message":"Chrissy Teigen just called Trump a \"sociopath\" on live television."},{"comment_id":"1148884565168237","commenter_b":"Snipers on the borders. Fill the Rio Grande with gators!","commenter_a":"build the wall close our borders down deport illegals out of America.","post_message":"For years, Trump and Bernie have both been saying that immigration policy is RIGGED by corporate special interests who want cheap labor."},{"comment_id":"1271419419547512","commenter_b":"Lil bitch","commenter_a":"12 jurors acquitted these guys based on the lack of evidence. This had nothing to do with white privilege, they were locked up in solitary confinement while rioters get away with burning down towns.","post_message":"Heavily armed ranchers forcefully occupied a federal building in Oregon, but they got acquitted because white privilege is real."},{"comment_id":"1510465682300437","commenter_b":"Drained the swamp by putting the gators in his bathtub. What happens when they attack him and each other? Too much love of power and love of money in a small space.","commenter_a":"Well, with all his wealthy Cabinet appointments, we can thank Trump for finally draining the swamp, which is unpresidented.","post_message":"This just happened. He said it! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153652749211336","commenter_b":"You better find a different church.","commenter_a":"Joe's Sunday Sermon - 09-06-2015 I guess I am compelled to address the elephant in the room. No, I am not making fun of her weight, it is just an expression. I am of course talking about Kim Davis, the misguided Kentucky Clerk of the Court that was recently jailed due to her contempt for the court and in my humble opinion, for humanity as well. This is NOT an issue of religious freedom. You can twist it, bend it and run it through a press and it will still not come out as a religious freedom issue. Does her issuing those licenses force her to change her religion or her religious views? No. No, it does not. She may still practice her religion as she chooses. She took an oath and that oath was to uphold the law. Does her religion condone being dishonest and deceitful? Well, again, in ...","post_message":"As Kim Davis began her third day behind bars yesterday, having chosen indefinite imprisonment over licensing gay marriage, around 300 people gathered on the lawn outside."},{"comment_id":"10153850798269614","commenter_b":"we definitely need to build this wall and make Mexicans pay for it","commenter_a":"donald trump is right we need to get this people out of this country","post_message":"U.S.-born Syed Rizwan Farook, 28, was one of two suspects identified in the fatal shooting rampage at the Inland Regional Center, police said. He and a female suspect, 27-year-old Tashfeen Malik, later died in a shootout with authorities."},{"comment_id":"10153826114722994","commenter_b":"What about them lying women. Who spred there legs to get bill money. I still respect bill. I still watch he's show.. get on the man who allowed them underage girls to come into that mansion..","commenter_a":"If the press and police will get over their prejudice and look at white males the way to they do black males as suspects, it would be a lot of white children alive today! \" They deserve a voice too! It's no coincidence, that these types of crimes don't get the scrutiny, they deserve. This is why child kidnappings, molesters, underground child porn rings, Internet pedophiles, thrive in suburbia, because they're white. R.I.P! Little one, the press will catch on sooner or later. The way I feel about inner city children dying by bullets in Detroit, is the same way I feel about suburban children dying at the hands of a kidnapper. They all deserve to live.....","post_message":"11-year-old Jacob Wetterling vanished in October 1989 while riding his bike. Almost 26 years to the day, police in Minnesota say they have a person of interest - and it was someone they looked at just days after he disappeared."}]
