[{"comment_id":"10153291262602507","commenter_b":"Fools if was for your Common sense You will all Now speacks german and japonese","commenter_a":"Violence begets violence.","post_message":"Krugman ~ Why is it that terrorist acts go over right-wingers' heads?"},{"comment_id":"10153990315029062","commenter_b":"So sad.......where are the parents???","commenter_a":"Seriously? the kids are really that dumb/stupid......those grades are apalling......what did the students/teachers do from the start of the school year until now?","post_message":"Monroe demanded the HISD Superintendent Terry Grier immediately step down."},{"comment_id":"1071384586215885","commenter_b":"No, she's just a crazy bitch.","commenter_a":"This is silly. A healthy lifestyle stops Cancer 90% of the time . The other 10% is the govt and environment","post_message":""},{"comment_id":"10153451111339087","commenter_b":"@username, Keep telling yourself that!! She doent have a chance, get over it already, find yourself a job!! Killary for PRISON!!!","commenter_a":"Screw Hillary and Bill, they are criminals and I don't like either of them!","post_message":"“Hillary Clinton is my candidate for President of the United States. She is best positioned to continue the progress made by President Obama on a range of issues -- from strengthening our economy to making the right investments in our infrastructure to common-sense gun safety laws to ensuring a fair criminal justice system,” Transportation Secretary Anthony Foxx said."},{"comment_id":"10153473976261438","commenter_b":"Shut the fuck up attention whore","commenter_a":"Trump for president. Enough is enough, its time to get tough. Make America great again.","post_message":"What if Trump's polling ceiling is much higher than we thought?"},{"comment_id":"10153286881869197","commenter_b":"the mother better be caring about who next door than what on facebook the people she see everyday","commenter_a":"That not discipline that torture and making a mockery of her child in front of the world what if she cause harm to herself mom can discipline at home not on Facebook","post_message":"VIRAL VIDEO: A 13-year-old girl secretly posted racy photos to #Facebook. Check out what her mother did when she found out: @webpagelink What do you think? Too harsh... or effective punishment?"},{"comment_id":"10155219757361159","commenter_b":"They should be deported and he should be in prison.","commenter_a":"So............your entire family is full of criminals and you're going on television to identify them right before we finally start enforcing the immigration laws in this country? Definitely stupid enough to be a Democrat.","post_message":"\"They got a false Social Security card, they got a false identification, they got a false driver license prior to us passing AB 60, they got a false green card, he admitted."}]
