[{"comment_id":"10155297533295294","commenter_b":"What about mature women ??","commenter_a":"Tina, No not customers. How the company treats its employees. It might just be the local HD.","post_message":"Veterans, retirees and college students are strongly encouraged to apply."},{"comment_id":"10152785056866051","commenter_b":"how dumb are these women","commenter_a":"WTH!","post_message":"This prisoner impregnated not one, not two, not three, but four prison guards."},{"comment_id":"1837044486583115","commenter_b":"Build the wall already and send her back","commenter_a":"this is funny , only because these two willfully ignorant","post_message":"Leftists Attack - Man Harassed For Wearing #BuildTheWall T-shirt SHARE if you WANT TRUMP To Build the WALL! WARNING: Strong Language!"},{"comment_id":"10153997696177300","commenter_b":"@username I feel so sorry for you ... I wish he wins and become president so you learn what immigration is ... I want to see you get kick out of another country. Remember the wall is for you not to scape. You Americans dumb supporters are morrons and losers","commenter_a":"The establishment wants a puppet, and clearly they found one in Rubio! The establishment hasn't learned that the more they ram their same old politics (taking care of donors and lobbying corporations) down our throats by telling us to vote AGAINST Trump, that we stand taller, rise stronger with you Mr. Trump. You are for us and we are for you.","post_message":"Yes, Donald Trump could win the White House in November."},{"comment_id":"644967912360454","commenter_b":"That's a women? !","commenter_a":"He ain't banning a damned thing!","post_message":"A Hispanic student is banning whites from using this term... because it's racist? 'LIKE' if this is WRONG!!!"},{"comment_id":"1023543291017240","commenter_b":"Nappy fake hair bitches.","commenter_a":"Black women aren't hot ! You can't do a fucking thing to me ! White lives matter !","post_message":"Do you think what this college student said is racist?"},{"comment_id":"376409252547369","commenter_b":"She is a looser","commenter_a":"THUMBS DOWN!! Pitiful excuse for a human being. Hard-working Americans don't get $112,000 in benefits. THIS IS SO WRONG. Stop the money and see what she does.","post_message":"One more Welfare Moocher..."}]
