[{"comment_id":"10154901503909641","commenter_b":"From our childhood we used to draw it on our notebook hoping for good fortune and will continue I dun care what the world says","commenter_a":"James Higgins-Durnan","post_message":"Conal Footwear apologized and recalled a line of boots after a viral image showed they left swastika imprints @webpagelink"},{"comment_id":"10153939182654060","commenter_b":"There are no women in a yakuza clan.","commenter_a":"Curiously -- nothing is said about females role in the family🔮","post_message":"In 2011 a Belgian photographer was allowed entry into one of Japan’s Yakuza families. Over two years, he captured the lives of those living in the underworld"},{"comment_id":"1011733118888805","commenter_b":"Amen to that our children come FIRST","commenter_a":"So sad.","post_message":"We have NO ROOM! We need to take care of Americans first and make our country GREAT Again!~ FOLLOW US---> Freedom Daily"},{"comment_id":"966246990097370","commenter_b":"Umm Ferguson, Watts Riots, La Riots. White people are out of control? Ok","commenter_a":"I pray for their families","post_message":"White supremacists shoot five people near the #BlackLivesMatter protests for Jamar Clark, a 24-year-old unarmed black man who was shot earlier this month by police. Protestors took to Twitter after the shooting & described the scene as chaotic, saying police maced the crowd before an ambulance arrived to assist the wounded. No arrests have yet to be made. DETAILS ----> @webpagelink"},{"comment_id":"1083445358398358","commenter_b":"She needs to give up the madness. She isn't accomplishing anything. Well..... except getting more votes for Trump.","commenter_a":"She is foul mouth pig, has not been funny in years and the sooner she move to Canada the better...","post_message":"WOW...Rosie just outdid herself. Do you agree with Trump?"},{"comment_id":"10154959437824369","commenter_b":"If I was impregnated by my rapist, I can assure you that I would not be having that child!","commenter_a":"Again, this does not make exceptions for rape. Also, the only people getting abortions at that stage are women whose lives are in danger or something is terrible wrong with the fetus. This is more unnecessary legislation.","post_message":"Abortions would be banned after 20 weeks under a bill Republican lawmakers hoped to pass Wednesday"},{"comment_id":"934685129905679","commenter_b":"I am a feminist and proud of it.","commenter_a":"This is feminism.","post_message":"Ellen Page has a point here, ya know... Thanks for the photo, MTV Act!"}]
