[{"comment_id":"971095776261096","commenter_b":"#CottonCancer","commenter_a":"NO! I don`t even like Corn when it is too sweet,so i know i would not like fruit that is...and it cannot be good for us.","post_message":"Yes, \"cotton candy\" grapes are a thing."},{"comment_id":"1226252880748515","commenter_b":"Simply disgusting to disregard females.","commenter_a":"Carry the baby, but you'll get no health care, no paid maternity leave, no disability if you have complications, no help with diapers, daycare or anything else. And then for extra shits and giggles we'll say that you're a burden on society and need to pull yourself up by the bootstraps.","post_message":"Not content with being a mere robot who repeats the same scripted line over and over during a debate, Marco Rubio demonstrated that he is a cold heartless robot on Sunday."},{"comment_id":"1530656863908230","commenter_b":"Feminism is the CHOICE. You can choose to be a stay at home mom now, you are no longer forced.","commenter_a":"Feminism got women the right to vote, and the right to be equally taxed as men without suffering any of the consequences of their choices (like fighting in war) obviously women are indirectly affected by war too but....this devalued their job and oppourtunities as mothers, thus hurting the family structure by putting extra financial burdens on them to cover the extra tax load. This is why families cannot survive off of one income anymore (obviously there are other factors). Feminism made it seems petty and pathetic to be a stay at home mom and raise your children but it is the most important and difficult job in the world IMO.","post_message":"The work of stay-at-home moms is valued at more than $100K a year. Learn more about the stay-at-home mom stigma: @webpagelink Like ATTN: Video on Facebook."},{"comment_id":"10154933648690695","commenter_b":"Stay in your lane lady","commenter_a":"I keep saying this and I will say it again ... why arent people protesting their brothers killing each other every night? Where are the Black lives matter groups? Or is that just when it involves a white man or police officer because I'm confused. I'm pissed that this man can't even go out in Atlanta to celebrate his new job! Why arent more people mad about this???!!!! Please tell me. They should have been looking up to this man for having his priorities straight! #alllivesmatter #theviolencehastostop #getyourneighborinorder","post_message":"Mitchell Mormon Jr. was celebrating a new job when police say someone shot and killed him."},{"comment_id":"10153562033956336","commenter_b":"Its not just the issue of illegals crossing the border and the US supporting them. The borders are open to terrorists coming across too and for both issues the bordetd need to be sealed ig we are to save our Country. Trump is right, without borders we don't have a Country.","commenter_a":"Ann Coulter is becoming the Johnny One-Note of 2016. SHUT UP ABOUT IMMIGRATION, ALREADY!!! There are dozens of issues out there that could (should) get your attention but every time I see you on @username you're yapping about immigration.","post_message":"\"The voters keep saying, 'We don't want any more immigration.' That's why Trump is so popular. So pick it up, Republicans.\" Do you agree with Ann Coulter about Donald J. Trump?"},{"comment_id":"10153316136926438","commenter_b":"... and so what if polygamy is \"legalized\" (lots of states already look the other way anyway) who would it hurt ?","commenter_a":"Yay polygamy.","post_message":"This was his best argument???"},{"comment_id":"895356030506185","commenter_b":"Saudees R disgusting devils.","commenter_a":"Saudi regime should be removed out of power and kicked out of the country.","post_message":"What do you expect of the #Saudi aggression against #Yemen? Raise your voice by taking part in our poll: www.presstv.ir"}]
