[{"comment_id":"10154334657668797","commenter_b":"I'LL SKIN THAT DOG AN THROW IT ON THE GRILL FOR DINNER. .. MMMMM MMMMM MMMMM DOG.....","commenter_a":"The newest FB trend....disabled animals as \"news.\"","post_message":"LIFE ROLLS ON: A puppy born without front legs was found abandoned and shivering in a cardboard box on a busy street. But now, she has her very own set of wheels to get around! See here:"},{"comment_id":"424819437642651","commenter_b":"I would be in prison because I would whipped her ass","commenter_a":"Oh, come on,@username, act your age! The girl was clearly in the wrong, but the sub lost the battle when he responded to her as he did. He should have immediately summoned help rather than try to argue with her.","post_message":"I wonder how this student would have been dealt with back in the day."},{"comment_id":"1288081714641540","commenter_b":"This is scary","commenter_a":"What kind of sick prople dream up this stuff are people so afraid to die that they will go to these means to create life just to torcher and kill it. Sick sick sick!!!!!!!!","post_message":""},{"comment_id":"1075762019148635","commenter_b":"I want that :)","commenter_a":"Alli Rauscher","post_message":"Piper the abandoned pig just got a new home (and a new best friend)! Via The Dodo"},{"comment_id":"10152608851681636","commenter_b":"we need freedom from jews.","commenter_a":"Mocking the prophet of as violent cult is different to mocking the deaths of 6 million people.","post_message":""},{"comment_id":"10153942859244024","commenter_b":"Let's ban YOU !","commenter_a":"Disgraceful","post_message":"He supposedly got \"PTSD\" from shooting an AR-15 and now wants to ban \"God Bless America\" from baseball games. @webpagelink"},{"comment_id":"10153931727246162","commenter_b":"She deserved it!! Drunk idiot","commenter_a":"Excessive indeed, but I wonder what happened before he tossed her in.","post_message":"North suburban Skokie has agreed to pay $875,000 to a woman who accused a police officer of using excessive force after a DUI arrest: @webpagelink"}]
