[{"comment_id":"10153664693511336","commenter_b":"Until Obama resigns she stays","commenter_a":"I'm sorry Governor Huckabee chose to support this action. She is a public official and her religious beliefs can not interfere with her professional responsibilities and duties. Is this how he would respond if he was Prresident of the U.S.? I'm disappointed in you Governor. She should resign her position if she is unwilling to comply with the law!","post_message":"Gov. Mike Huckabee joined Fox & Friends this morning to discuss his support of Kentucky county clerk Kim Davis, and why he believes she's remaining \"steadfast\" to her beliefs."},{"comment_id":"10154008919327439","commenter_b":"I cant stand these lying disgusting woman abusing savage animals MUSLIM MEN","commenter_a":"Didn't take long for \"moderate\", \"peaceful\" muslims to take on a new tactic. One that the liberal media will blame on Christians. These followers of allah/satan are true examples of evil!","post_message":"ISIS has issued a handbook for Muslims in the West. The gist of the instruction booklet is the necessity to blend in with the western way of life and to avoid ‘looking like a Muslim’ - pretend to be Christian -- so as to stay below the radar of the security services. This is important. It is key to understanding the enemy and their tactics. The media and the Democrats are deliberately misleading the public. You must educate yourself and those around you. Share this article on Facebook, Twitter, email. Build our army."},{"comment_id":"1072916832798493","commenter_b":"I dont know who's right who's wrong because this is a mourning moment","commenter_a":"God bless President Bush and his wife! Atleast we know they love America! Even Obama's brother knows Barack is a failure, he started isis by withdrawing troops from Iraq and killing Gaddafi! by the way a funeral is a celebration of the person's life morons! The Obama's are an embarrassment!","post_message":"Actions speak a THOUSAND words. Take a look at Michelle's face..."},{"comment_id":"10155222410880354","commenter_b":"Oobama and his stupid bastards.","commenter_a":"Deport EVERY SINGLE ONE!","post_message":"Obama Administration Sets Up Hotline for Illegals Seeking Amnesty Under Obama's New Policy."},{"comment_id":"10154162654734087","commenter_b":"Yep, we saw how Liberal women threw their crotches at Bill Clinton with votes right? My guess is most would have gladly changed places with Monica Lewinsky. Sucks to be a hypocrital non-critical thinking Lib woman. That's Lib Feminism I guess.","commenter_a":"Yes, when a bigoted, neo-fascist, sexual predator runs for president on the GOP ticket, Democrats are loyal to their party and independents and moderate Republicans stream to join us to stop him as well...funny how that works.","post_message":"\"With the exception of cheating Bernie out of the nom the Dems have always proven to be far more loyal to each other than the Republicans!\" Trump tweeted."},{"comment_id":"10154461137273162","commenter_b":"@username is clearly an anthropological & archaeological authority on the issue of Jewish history. Oh, and he was apparently elected to be the Arbiter of Jewish Identity, seeing as he now has the right to decide which Jews belong where","commenter_a":"I'm sorry Bibi - you know bunch of us real Americans LOVE you !!","post_message":"Now he’s “Boo Boo!” Netanyahu! The Israeli Prime Minister Benjamin aka “Bibi” Netanyahu received a chorus of boos from the most American of audiences: New Yorkers who paid exorbitant sums to see the ever sold out smash hit “Hamilton.”"},{"comment_id":"10154161190123837","commenter_b":"Some psycho wife probably found out and messed it all up for everyone, typical.","commenter_a":"Lock her up!","post_message":"DOLLS BEAUTY SUPPLY: This business wasn't attracting women to buy cosmetics. Detectives believe it was attracting men to pay for sex."}]
