[{"comment_id":"10154969618344726","commenter_b":"muslim migrants.","commenter_a":"And people wonder why nationalistic skinheads are on the rise in that country.","post_message":"One poll finds German women no longer feel safe."},{"comment_id":"840225226093860","commenter_b":"Science is proving the bible and religion is a load of rubbish...!","commenter_a":"The Bible is just a story book... Religion is a fable... looking for God is like going into a dark room and looking for a black cat that does not exist ! what religion does to people is brain wash them..","post_message":""},{"comment_id":"10153726432609087","commenter_b":"I'll buy her plane ticket","commenter_a":"Bye","post_message":"“I know a lot of people have been threatening to do this, but I really will,” Lena Dunham said about moving to Canada if Donald Trump is elected president."},{"comment_id":"1533566413336617","commenter_b":"YES !","commenter_a":"Yes","post_message":"Michelle Bachmann says Trump's win is positive of what the Lord did. Do you think God had a hand in Trump winning?"},{"comment_id":"368033556718272","commenter_b":"Sarah Got A Back Bone She Don't Back Down To That Evil Snake","commenter_a":"does she even know where Paris is?","post_message":"Good God, Mr. President, we were once known as the leader of the free world, standing for what is right! You must not let America’s sacrifices be in vain. When will you learn that actions speak louder than your words?”"},{"comment_id":"1745816418974356","commenter_b":"This woman's head is bad.","commenter_a":"That's the problem, she just let 4 Americans die, you idiot.","post_message":"Whoopi Goldberg: Gee, so sorry that you find the deaths of innocent Americans \"boring.\" But for the rest of America, we find the Benghazi massacre reprehensible and unforgivable. And on behalf of the families who can never see or hug their loved ones ever again, We the People demand transparency, honesty, and justice. So get over yourself and your need for constant amusement, Whoopi. Hillary lied, Americans died. Signed, We the People"},{"comment_id":"935532149828645","commenter_b":"No refugees immigtants.We're your great great.oh Grandparents Irish immigrant ?","commenter_a":"NO REFUGEES, NONE ! We Americans do not need more problems in our country. Stop them, am I CLEAR ?","post_message":"Our nation has always been welcoming, but we can’t let terrorists take advantage of our compassion. We should not bring Syrian refugees into this country unless we can be 100 percent confident that they are not here to do us harm."}]
