[{"comment_id":"10154332100229369","commenter_b":"??????? Seriously? Crooked Hillary. I will never vote for her.","commenter_a":"The headline is B.S. and I do not mean my undergraduate degree. Hillary is brave, intelligent, tested, Democrat, progressive, public servant. Get used to it.","post_message":"Yikes. Now what?"},{"comment_id":"1040430382659049","commenter_b":"they are getting to close for comfort. she will play the stroke card any day now.","commenter_a":"She looks like a wore out old saddle bag.","post_message":"Hillary, EXPOSED!"},{"comment_id":"908413552551727","commenter_b":"Omg poor man i hope she gets sent to prison","commenter_a":"Poor man. I hope his wife gets a nice long prison sentence.","post_message":"A year on, he still has scars..and some of them will never fade"},{"comment_id":"1079787262080732","commenter_b":"BYE BITCH","commenter_a":"@username this is SCARY accurate dont hug me when u come home","post_message":"\"I love you.\" \"Ew. Stop.\""},{"comment_id":"10150699616999999","commenter_b":"He knows well cause his father was a partner with the militar goverment that killed thousands of Argentinian citizens.","commenter_a":"If I were him I would use another story. Something to do with Argentina and it's people. Just saying.","post_message":"At 32, Mauricio Macri, the president-elect of Argentina, was kidnapped and placed in a coffin by rogue police officers, an awakening that put him on a path toward politics."},{"comment_id":"622739101214748","commenter_b":"Yes, what has she done in her young life to deserve a 900,000 dollar a year job? Oh ya, she works at mommy and daddy's \"foundation\", sorry, money laundering facility!","commenter_a":"Is she billys daughrer or NOT","post_message":"Multiple Choice Quiz time, kiddies! Which answer did you chose? A or B? @webpagelink"},{"comment_id":"10152839305921680","commenter_b":"Not this half latino nor his wife and father!","commenter_a":"And Latino will fall for it again.","post_message":"\"As a mother, grandmother, and American, I don’t know how a person can meet these young people ... and think of threatening them and their families with deportation,\" Hillary Clinton said."}]
