[{"comment_id":"508254089382552","commenter_b":"It's cheaper in the long run to deport them now.america can't continue to feed ,clothe,and give free everything to these people.Damn it our vets and needy in america should come first.","commenter_a":"We don't , and they don't assimilate ..","post_message":"NO."},{"comment_id":"10153234463025779","commenter_b":"Amazing political argument Mark. You've persuaded me to support Trump with your carefully worded statement.","commenter_a":"Biff Trump is a Joke..","post_message":"It started out as a joke: Donald Trump running for president! What better way to spoof the thinness of the Republican field than to shove a bombastic reality star with orange hair, a sixth-grade vocabulary and no behavioral filter onto the GOP debate stage. But, as Matt Taibbi writes, the joke turned ugly fast."},{"comment_id":"1090226121037135","commenter_b":"Islam and muslims are biggest threat.","commenter_a":"Israel stands with France against terrorism. Do France stands with Israel against the same terrorism?","post_message":"France's year of terror"},{"comment_id":"10154840389483256","commenter_b":"Mine Fuhror has a real hard on for the $500BILLION dollar oil deal with the Russians.","commenter_a":"Trump keeps finding the billionaires who will so care about the United States and her citizens, I am sure. Are the pigs flying yet?","post_message":"President-elect Donald Trump is expected to select Exxon Mobil chief executive Rex Tillerson as secretary of state, elevating a dark-horse prospect who seems to have surged past seasoned political actors like Mitt Romney and Sen. Bob Corker, R-Tenn., in the stretch."},{"comment_id":"901769206549495","commenter_b":"Perhaps in fantasyland he's becoming a woman, but not down here where I spend my time - ON EARTH.","commenter_a":"Sorry Bruce, you're NOT becoming a woman - that's impossible. Your just taking hormones, and chopping your John-Thomas off.","post_message":"'Hey, guys, I'm becoming a woman' (Via Daily Mail Celebrity)"},{"comment_id":"10153303433876162","commenter_b":"Hope not. There is nothing wrong with having a woman president. However other countries in particular the middle east countries dont see women as equals.","commenter_a":"I seriously hope people don't vote for her to have a \"first\" female president.","post_message":"CLINTON 2016? Hillary Clinton is expected to announce her candidacy for President tomorrow. Here's what you need to know: @webpagelink"},{"comment_id":"10153613354068690","commenter_b":"and she need to learn how to write in english either","commenter_a":"May Allah help all Muslims around the world Ameen","post_message":"We demand the freedom of our colleagues who are unjustly detained in Egypt. #FreeAJStaff"}]
