[{"comment_id":"857951050917630","commenter_b":"She needs to be beaten and slammed on the floor, I VOLUNTEER TO DO IT !!!!","commenter_a":"Linda that's not meth,bad acne","post_message":"A 26-year-old mom is accused of beating her son and slamming their 1-month-old puppy against the floor, because she did not want to clean up after the pet: @webpagelink"},{"comment_id":"10154169882022061","commenter_b":"Would you rather me say, \"stop your whining and suck it up buttercup!\"","commenter_a":"Good grief, you people kill me. Like it or not he is the next POTUS. Stop with the bashing. If you live in America then he is your President and you will benefit or suffer like the rest, but for crying out loud give him a chance.","post_message":"WATCH: Rick Perry, President-elect Donald J. Trump's expected pick for Secretary of Energy, famously forgot he wanted to abolish the energy department in a 2011 debate: @webpagelink"},{"comment_id":"10153382274960047","commenter_b":"Absolutely. We need that evil out of our country, or there won't be. That evil Clinton is still getting votes. Are there that many brain dead people that can still vote? She a freaking criminal, and low life form that should be in prison. For those that do like her, if it were you that had did all she has, you'd be a lifer in prison. Wake the heck up.","commenter_a":"I would rather see silver or gold certificate or better yet actual gold or silver. Back then no in god we trust on any money","post_message":"We must defend \"In God We Trust\" from atheist attacks. We must defend our Christian heritage. Sign and Share our petition to take action: @webpagelink"},{"comment_id":"10154108644646178","commenter_b":"This is where GWB, Dickhead Cheney and all those racist MURDERER Cops belongs. They are the real MURDERERS !!!","commenter_a":"Stupidity abounds in the liberal media. Wake up folks!","post_message":"\"Well, actually, again, if you are a terrorist you belong in Guantanamo Bay. That where they should stay....\""},{"comment_id":"1276342415734510","commenter_b":"Well they didn't because Peter Falk hadn't even been born yet.","commenter_a":"I VOTE FOR THE AMERICAN INDIANS.TELL ME WHY DID THE EUROPEANS KILL THE NATIVES ,IF THEY WERE BARBARIC THEY WOULD HAVE KILLED COLUMBO AND BURNED HIS SHIPS.","post_message":""},{"comment_id":"1766321223645256","commenter_b":"If you are gay why are you voting for Hillary when she wants to bring in millions of refugees that believe gays should be executed? If you are Black, why are you voting for Hillary when she defends Planned Parenthood and admires Margaret Sanger, who wanted to abort as many black babies as possible and exterminate the black race because they are like \"weeds.\" Most of those clinics are in Black neighborhoods. If you are a Woman, how can you vote for Hillary when she has buried all of Bill's rape victims under the rug. As an attorney, Hillary also defended the rapist of a 12-year old girl and laughed about it later. She plays the woman-card and acts entitled; implying that she deserves your vote merely because of her sex. How is that gender neutral? If you have are a Miner, Steelworker or have a Factory job, why are ...","commenter_a":"He did not say because of how they prey! This is Dem spin! KILLARY only is concerned with illegals and refugee''s Get that big dem base full of those needing your handouts!! Does not matter if some want to kill us Really our money, but once it get to DC it's their money!! Her motto should be just give me your I WILL MAKE THE DEMOCRATS!!!! This country is going down fast!! Bombings, beheading, murders etc And our president is worried about where someone should PEE !! Big world leader! OBAMA A TOTAL JOKE!!","post_message":"\"In this great nation, where our founders put a fundamental principle forward of religious freedom, [Donald J. Trump] says ban all Muslims, don't let certain people into our America because of how they pray.\" What do you think of Sen. Cory Booker's comments about Donald Trump at the #DNC?"},{"comment_id":"10153329525229203","commenter_b":"It's called Sharia Law and it's practiced in Muslim Country's where Women are considered worthless property.","commenter_a":"Alexis A Massey","post_message":"In Nigeria, violence a husband for the purpose of correcting his wife is considered lawful."}]
