[{"comment_id":"10153385022372426","commenter_b":"@username-this is for that mouth of yours. It won't cure your racist stupidity, but it will shut you up. PLEASE let make it shut her up!","commenter_a":"Hmmm... I wonder what the outcome is going to be... You mean to tell me an armed militia has takened over a Federal building and not one shot fired as of yet but a 12 year old with a toy gun could not be extended the same courtesy.... Oh the hypocrisy!","post_message":"An armed group is occupying a building at the Malheur National Wildlife Refuge Federal Preserve in Oregon. \"We will be here as long as it takes,\" said Ammon Bundy, the 40-year-old son of Nevada rancher Cliven Bundy, who is well-known for anti-government action. \"We have no intentions of using force upon anyone, (but) if force is used against us, we would defend ourselves.\""},{"comment_id":"1323967450977057","commenter_b":"Golden showers for a golden girl!!!! LOL!","commenter_a":"He's gonna cry.........all the way to the Whitehouse!!!! LOL!","post_message":"Trump has never looked so pathetic."},{"comment_id":"10153518944503984","commenter_b":"It's the Holy Spirit's job to convict or convince the unbeliever that they need a Savior. We can share the GOOD news that Jesus died and took our punishment for our sins but it is not our job to make people feel bad. Their hearts will know because of the Holy Spirit. We can share the news that we, too, were once sinners but now we are saints. People who come to God out of fear or condemnation usually won't stick around long because those emotions go away. People need to know that Someone has taken their punishment for sin for them and that they are loved more than words can say. We ALL are searching for love. Hope this helps.","commenter_a":"The Bible says it is the KINDNESS of God that leads people to repentance which is what it sounds to me like Joel Osteen is giving. Read the Word!! Jesus was not a hater no matter what people did. Paul or Saul, killed Christians too.","post_message":"Mega-church TV pastor Joel Osteen just made a sickening announcement about Muslims... Spread this absolutely everywhere... the REAL Joel Osteen needs to be exposed. Do you agree that Osteen is a fraud?"},{"comment_id":"10153627829156336","commenter_b":"Who really cares about the name?!!!! Native Americans care about protecting Mother Earth!!!! Get rid of the Pipeline!!","commenter_a":"How about leaving the mountains name alone and concentrate on more important priorities.","post_message":"President Barack Obama is restoring the name of the tallest North American mountain peak – Mt. McKinley in Alaska – to the native Alaskan name of “Denali,” the White House said today. @webpagelink"},{"comment_id":"1036339909720353","commenter_b":"Skye Waters Maite Roman","commenter_a":"You guys just love to look down your noses at others. Yes, it is an incorrect viewpoint, but ridicule is for idiots and children.","post_message":""},{"comment_id":"1619157871724827","commenter_b":"oh come on this is another lie and I would sue thevhekl out of Gloria and this bimbo! all these women have come back and stated they lied!! this bimbo wants her 15 minutes and she has no merit! ! he was right most Hollywood women will let you grope them for them to get ahead!! funny how all these women kept going around him time after time therefore it did not happen or they would not have wanted to be around him!!","commenter_a":"Blah blah blah,,,,, ummm what happened to all the other woman during the elections. Bye felicia","post_message":"WATCH LIVE: Donald J. Trump to face lawsuit from woman alleging sexual misconduct."},{"comment_id":"10154858734646002","commenter_b":"@username I was shocked at the same thought, why would Disney have a man made Lake that wasn't somehow protected from alligators with a border fence ?!?! We've been there, never thought about alligators because it's Disney, they have safety rules and barriers everywhere.","commenter_a":"So let me get this straight ... Another parent is not watching their child in an area where it clearly says NO SWIMMING so now we are killing alligators for feeding in their habitat where once again it SAYS NO SWIMMING!! What is wrong with people ?!","post_message":"\"We have been to Yellowstone and encountered grizzly bears, but this is just freaky.\""}]
