[{"comment_id":"10154607888371729","commenter_b":"What does carrying has to do with this?","commenter_a":"People wanna stop going to target bc of this but still eat chikfila after its owner gave a 100,000$ donation to thelbgt community months ago but still eat there what's the difference hypocrites","post_message":"Target just received a serious dose of reality..."},{"comment_id":"10152796636027217","commenter_b":"where are the women","commenter_a":"Check their passports and visas ...","post_message":""},{"comment_id":"10152865946012293","commenter_b":"Married men have to make more. There are others to provide for.","commenter_a":"Jamal Barcillano :)","post_message":"Marriage appears to transform men’s approach to work and the way employers treat them."},{"comment_id":"10153286169819705","commenter_b":"No, they aren't talking about Snow.","commenter_a":"Thanks for the spoiler","post_message":"For once, Game of Thrones didn't kill off a character when it looked like it was going to."},{"comment_id":"942185122493609","commenter_b":"Please, get some more facts before you continue spreading such nonsense. Of course GUN voilence is down - but violence, homicides, etc are NOT. Home invasions are up though... bc criminals know responsible home owners aren't carrying any more. Please, get a clue. Guns are not the big problem, and more gun laws do NOT stop CRIMINALS. You know who gun laws hurt, responsible gun owners.","commenter_a":"Did any of you even read all the way through? Statistics clearly show that stricter gun laws prevent shootings. Look at Australia. They used to have guns. Had a massacre. Made them illegal. No more massacres. Their gun violence is almost non existent since they made guns illegal.","post_message":"So sad."},{"comment_id":"612057282315211","commenter_b":"God she's an idiot lmao can't fix a fake blond moment","commenter_a":"This girl has a show? It is cheaper to produce this than real news that impacts people's lives. A little girl with a big mouth is our national dialogue? Cheap.","post_message":"Trevor Noah's performance was a thoughtful invasion, a methodical exploration behind enemy lines."},{"comment_id":"10153446320724087","commenter_b":"I want a woman too, but not a liar, cheap, and a phony","commenter_a":"Fuck no to Hillary. Hell yeah to Feel the Bern!!","post_message":"“It’s imperative that you vote. I want you to vote for [Hillary Clinton]. It’s time for women to be seen as real equals,” soccer hero Abby Wambach said at an event for the Democratic front-runner. “That is one hell of a badass woman in my opinion.”"}]
