[{"comment_id":"536155019906124","commenter_b":"What an ugly woman he makes","commenter_a":"Shite ignorant wow, go shoot somebody after all you've been paid for it","post_message":"CAN WE GET 10,000 SHARE AND LIKES FOR THIS MARINE\"?????"},{"comment_id":"10156132117065725","commenter_b":"I appreciate you being so kind and politically correct. And you laid out a solid, arguably INDISPUTABLE, case there. But, as you pointed out, this is absolutely willful ignorance, so real facts don't mean anything when talking to a trump supporter. They have a feeling, form a belief from that feeling, and then that feeling morphs into a \"fact\" without any due diligence. And, unfortunately, all of their beliefs stem from feelings of bigotry (irrational hatred of an entire group of people). I'd love to have an honest conversation with a trump supporter about his policies. But they won't, because trump doesn't have any feasible policies, he simply says things are bad or good (which we all have the ability to do). What any trump supporter does when confronted with a lack of actual policy, with his track record of insults and short sighted aggression, is blame someone else somewhere ...","commenter_a":"The man did not make a \"nasty or controversial statement.\" He made a series of absolutely false allegations. Correcting him after he spoke could not possibly have been construed as interfering with his right of free speech; you would have only been interfering with his right to be ignorant. Which, apparently, is a sacred right to some of your supporters. And if somebody had made a series of absolutely false statements about you to the President, yeah, I'm pretty sure he would have corrected them.","post_message":"If someone made a nasty or controversial statement about me to the President, do you really think he would come to my rescue? No chance! If I would have challenged the man, the media would have accused me of interfering with that man's right of free speech. A no win situation!"},{"comment_id":"10153516705331337","commenter_b":"I'm sorry but what did he expect...how sad that I grew up.on this family show N all his family n friends stood by him while he lied","commenter_a":"Bye asshole.","post_message":"FALL FROM GRACE: The Bill Cosby saga continues as word has broke that the comedian's talent agency has cut ties with him over his sexual allegations..."},{"comment_id":"1133897243307426","commenter_b":"Matt AtkinsonJack Nicholls looks like im moving","commenter_a":"Luis Barillas this reminds me of donuts after work. Hahaha","post_message":"Not recommended for our home viewers.... @webpagelink"},{"comment_id":"10153018351676336","commenter_b":"Disgusts me to see girls acting like this and the bystanders with the cell phones out! Come on now","commenter_a":"As a parent, I would be MORTIFIED to see my child standing there videoing the fight! Doesn't anyone have compassion any more? \"Mean girls\"... smh... it's out of control! We should have evolved beyond this.....","post_message":"A shocking photo appears to show the moment a Texas mother pulled out a gun and pointed it at a high school student."},{"comment_id":"10153836803272623","commenter_b":"Good players But it's another\"L\"","commenter_a":"Ga...NO ....Riverboat must have sank and Cam Ain't ..... stupid Panther Fans","post_message":"The New Orleans Saints beat the Carolina Panthers in a 41-38 victory Sunday in New Orleans."},{"comment_id":"1756788254541132","commenter_b":"Calmate gueys!","commenter_a":"I'm Mexican. 100% computer engineer. I break 115k a year. Lol. I guess I did take a white man's job!","post_message":"WATCH: Immigration protesters from the Puente Human Rights Movement shut down a portion of Central Ave in Phoenix, near McDowell. They're upset with today's Supreme Court decision that overturns President Obama's plan to protect illegal immigrants whose children were born in this country."}]
