[{"comment_id":"662069217316990","commenter_b":"Sorry Bitches !!! Go to jail !!","commenter_a":"Yes!!yes!!!!!yes!!! that;s a shame!! just think?? if that was your mom! or dad????","post_message":"These thugs tortured nursing home patients for an insane reason. These two are monsters. Let's lock them up and throw away the key. Do you agree these thugs should do life?"},{"comment_id":"10153754678291336","commenter_b":"Can't play politics and disarm society if you make the kids safe! Gotta get a few kids killed to advance if you're a communist. The end justifies the means with these Freaks.","commenter_a":"jerry brown is a fool","post_message":"Does this make schools safer?"},{"comment_id":"553065348238039","commenter_b":"Boy please!! Your mama gonna beat you stupid!","commenter_a":"I'm black and voting trump. Most of my family's also voting trump. Even most of my friends are voting trump so the news is a joke nowadays. And in case your all wondering yea we are 90% black family and friends.","post_message":"Here's why Donald J. Trump is struggling to win over black voters."},{"comment_id":"10155131365895231","commenter_b":"Girl preach!","commenter_a":"She will go when He calls her Home...we've all been on Life Support from our Day 1...","post_message":"Prayers for the Houston/Brown family: Bobbi Kristina will reportedly be taken off life support on Feb. 11th to allow her to pass on the same day as Whitney Houston."},{"comment_id":"10154297442132098","commenter_b":"Wow, that's crazy","commenter_a":"Mie Mie the mystery is solved","post_message":"CONDO FIRE: A massive fire broke out a Concord condominium this afternoon. Story: @webpagelink"},{"comment_id":"10153944897553132","commenter_b":"God bless you and your family","commenter_a":"Prayers are coming","post_message":"Our hearts go out to Criss Angel and his 1-year-old son, Johnny."},{"comment_id":"720191621435846","commenter_b":"Peaceful muslims?? What in the hail is that??? They all believe the same! You and all the misguided people who liked your post get to be first in line for beheading!!! Dear lord do some actual research! There is no such thing as a \" peaceful Muslim\"!!!","commenter_a":"If it's true , hats off to them . We have been wanting \" peaceful \" Muslims to stand up to the \"radicals \" , maybe this is a start ????","post_message":""}]
