[{"comment_id":"1229126323813780","commenter_b":"Reaz Tiths tell us what @username has quoted about that book of peace.","commenter_a":"Islam does not teach us to kill others. But in real it is a religion of peace, although some are killing innocent Non Muslims in the name of Islam. What a shame! Islam teaches us to respect others beliefs & not to insult them for their religion. This is the Islam I've been taught","post_message":"'One child said a Muslim prayer and was spared, the other was killed'"},{"comment_id":"10154629464758797","commenter_b":"She also needs to be medically sterilized so another child cannot be born to this vicious murderer","commenter_a":"7 YRS R U FUGGIN KIDDING ME SMH I HOPE HE AT LEAST DIES IN PRISON","post_message":"TODDLER MURDERED: Prosecutors say the beating was so bad that part of the 17-month-old boy's skull broke off in the medical examiner's hand during the autopsy..."},{"comment_id":"679029648954280","commenter_b":"Lock her ass up","commenter_a":"Waiting?","post_message":"FBI moves to arrest Hillary and put her in prison for 10 years. Good, it's about time. She deserves longer. Would you be happy if Hillary was in Jail?"},{"comment_id":"1215144131854339","commenter_b":"yup-knew this was coming next illegal immigrants-","commenter_a":"This is only for California elections it does not include the federal or United States presidential elections he cannot sign into law to control the federal government he only has control of the state so only state elections pertain to this law","post_message":"HORRIBLE!!!"},{"comment_id":"1790088647891885","commenter_b":"Lois did you listen to Hillary's speech . It sounded like she didn't know democrats policies or didn't take thousands from PP and believes in term abortion . Oh she forgot thAt, 🇺🇸Trump🇺🇸","commenter_a":"Hillary calling someone corrupt? Wtf kind of drugs is she on? Her and her so called husband are the biggest, most corrupt crooks ever involved in American politics!","post_message":"Donald J. Trump: \"Hillary Clinton may be the most corrupt person ever to seek the presidency of the United States.\""},{"comment_id":"1345530805539970","commenter_b":"@username again you also admitted to being a bitch so....","commenter_a":"It's funny that all these bad ass, gun toting, 2nd amendment conservatives seem to have no problem becoming Russia's bitch","post_message":"LOL! Thanks to Andy Borowitz for this helpful advice for Trump..."},{"comment_id":"1328913090468676","commenter_b":"You are kidding! Bush was criticised for reading to kids in a school soon after 9/11, which was actually thoughtful and humane. While Obama is on a world tour with the family!","commenter_a":"We have to be honest. If that was George Bush we wouldn't have cared. This doesn't bother me so much, he was being polite as a guest at a State Dinner. Gallivanting with communists just hours after the bombing (and his dismissive <60 second remarks) was disgraceful, though.","post_message":"Nero has nothing on this guy! Obama shows how he feels about the #BrusselsAttacks."}]
