[{"comment_id":"1187509331305594","commenter_b":"She's losing Florida.","commenter_a":"She's losing in national polls !!! Americans don't trust her!!!","post_message":"Let’s think better of each other, and hold together in the face of our challenges—not turn on each other or tear each other down."},{"comment_id":"1178341715558004","commenter_b":"LOCK HER UP!","commenter_a":"You hate hillary (so do i) but you pick a man that can't beat hillary.. we've got big problems come election time.","post_message":"Donald J. Trump, Sen. Joni Ernst, and others campaign in Iowa at the Iowa senator's second annual Roast and Ride."},{"comment_id":"10157217624240354","commenter_b":"Send them to the Vatican you have walls keep them there","commenter_a":"Christians are in more danger than Muslims, that is the truth.","post_message":"Still no word on when the Pope plans to tear down that evil Vatican Wall surrounding his fortress and let all the \"migrants\" come flooding in."},{"comment_id":"10156240306950551","commenter_b":"God, this women is a beast.","commenter_a":"Then bitch move to Africa.","post_message":"This woman is RACIST!"},{"comment_id":"1047357948654067","commenter_b":"Hopefully your girls won't grow up to be ignorant fools like you.","commenter_a":"While watching this video my four year old daughter asked, \"Who is that?\" I answered, \"@username, hopefully the first woman president.\" To that she replied, \"I love her. She's beautiful. I like her necklace.\" Can't wait for you to shatter that glass ceiling for my girls!","post_message":"An expectant mother in Iowa asked: What are your plans for parental and maternity leave?"},{"comment_id":"10157069343155354","commenter_b":"@username that is exactly what I said she would be the second biggest mistake","commenter_a":"It is about time all realize all that comes out of his mouth are lies he has seven more months to tear our country apart I saw this before his first election do not make the same mistake twice to vote for Hillary she is a continuation of Obama and if she gets in the only way we can restore our fore fathers Constitution is through force I am a Veteran and will stand by the oath I took at enlistment to defend the Constitution against all enemies foreign or domestic so help me God do not screw with my country","post_message":"Obama is a global rock star no more..."},{"comment_id":"1015835041846081","commenter_b":"She needs to take her conscience to another job.","commenter_a":"I'm getting real tired of her behind. My God's name is not Kim Davis. It's time for her to find a new job.","post_message":"BREAKING"}]
