[{"comment_id":"1134360159938174","commenter_b":"My comment here is in no way an attack on this guy. The reality is that he's working an entry level / minimum wage job so that's why he makes minimum-wage. I'm a disabled Marine Corps veteran myself and I spent four years in school so that I could earn enough money to support my family and give them a better life. For those that say that maybe he doesn't have the aptitude to go to college, there are trade schools out there that he would be more than qualified to go to. When fast food workers start making $15 an hour then entry-level welders need to be making $25 an hour and those that are currently making $25 an hour will then need to make $35 an hour and so on and so forth.","commenter_a":"This man risked all he had for this country, got wounded but continued to serve his country and now he gets $7.50/hour and cannot afford to support his family!!! :( While Mr. Cheney does not step his foot on the battlefield once, and his Halliburton makes nearly $40 billion dollars from the Iraq war!!!!!!!!!!!!!!!!!!!!!!!!! How can this country allow such extremely disproportionate treatment of its citizens???? I think the living wage is around $27 to $30 dollars/hour and that's what the veterans deserve....","post_message":"He fought in Iraq, but back home, he's struggling to get by. Fight for $15 advocates that everyone be paid a decent wage."},{"comment_id":"10154281842244726","commenter_b":"We the people ? ? ? , , , . Give me a break, , , your pigs in a cesspool of immorality . Eat shit and die.","commenter_a":"Hypocrites","post_message":"The Left would call violent protests a ‘hate crime’ if roles were reversed."},{"comment_id":"10152961247876680","commenter_b":"That's you and your crowd... Dead and cut up babies sold for the meat market !","commenter_a":"I proudly stand with Planned Parenthood.","post_message":"The move dramatically increases the chances of a government shutdown fight in the fall."},{"comment_id":"831043426931080","commenter_b":"Yes, she needs to be held accountable! She has NO business being president!!!","commenter_a":"Good luck on this one, sure hope it all works!","post_message":"Hillary might as well retire her future plans for the White House! Gowdy's gunning for something that will DESTROY her!"},{"comment_id":"1311726352220443","commenter_b":"Percy Lopez. ...taken to the cleaners, you have been schooled Percy, what's it like being a moron","commenter_a":"The best president ever!! Turned the economy 360 degrees after Bush's administration crashed it to the ground. You have done everything you could to help america Mr president. Your courage, dedication and integrity brought tears of gratitude to so many american people.","post_message":"'I can drink beer at 11.30am and Michelle won’t even know?'"},{"comment_id":"10154615680566880","commenter_b":"Like auto manufacturers too?","commenter_a":"People who believe that Musk is a genius should support him by staying fully invested. Those who distrust a business reliant on government subsidies should bail. This will be an excellent test case in the economics of government investments. A future under Hillary promises heavy government investments in the Musks of the world.","post_message":"There could be a disaster coming."},{"comment_id":"10153189234471491","commenter_b":"I still want my coke 0. Gitty up !!!","commenter_a":"Hahaha! European countries welcoming muslim refugees beware! In a few years time......","post_message":"She filed a discrimination complaint."}]
