[{"comment_id":"10153259509053010","commenter_b":"I bet she could crush Eddie lol","commenter_a":"Had the biggest crush on Eddie Van Halen growing up...LOL..He DOES NOT look the same anymore!!!","post_message":"Van Halen's David Lee Roth put it best: \"We waited 45 years for this.\" More than four decades after it formed, Van Halen played its first nationally televised gig, on Jimmy Kimmel Live. (Roth ended up with that bandage on his nose.)"},{"comment_id":"786447821458391","commenter_b":"And that woman belongs in a jumpsuit behind bars so what's your point","commenter_a":"Only people with dignity responded! The rest???? This man belong to a mafia organization! Not the White House!","post_message":"Former anchorman Dan Rather has issued a challenge to his colleagues: \"This cannot be treated as just another outrageous moment in the campaign.\""},{"comment_id":"10153473054219087","commenter_b":"Also you're basically saying someone who has the same democratic socialism plan as MLK Jr is a Marxist. Please don't insult the intelligence of Bernie Sanders supporters. We know the difference and you sir are just trying to fear monger ppl into thinking that.","commenter_a":"Perhaps Bernie will be made to answer tough questions on his absurd views on governance. Bernie Sanders: A demagogue is on the rise The populist fever is now running rampant. A demagogue is on the rise. His appeal is founded in the notion that the professional political class has both failed and ignored the plight of a disaffected but vocal minority. In terms of substance, he leaves much to be desired. In style, however, he captivates and inspires. On the debate stage, he touts his surging poll numbers, spouts unrealistic but tantalizing anti-elitist policy preferences, and berates the moderators for asking him tough questions all to the cheers of his committed band of malcontents. Noah Rothman @webpagelink","post_message":"CNN abruptly announced today that it will hold a town hall with the Democratic presidential candidates in Iowa on Monday -- one week before voters in the state head to the polls for the first-in-the-nation caucuses."},{"comment_id":"10155835827900615","commenter_b":"About damn time they got these creeps off the air!","commenter_a":"Unfortunately another network will probably pick them up.","post_message":"BIG BREAKING NEWS –"},{"comment_id":"10153065116958984","commenter_b":"He does it for money, he don't give a damn about the Blacks on the street shooting there brothers and sisters or he would be here trying to straighten them out. But let a white or police officer doing the shooting and he will be there starting trouble. He is pregistist .","commenter_a":"This guy is a real Jackass","post_message":"Seriously Al? You must be joking... Is it about time for Al Sharpton to give it a rest?"},{"comment_id":"10154107303310286","commenter_b":"This has been my home longer than it's been yours.","commenter_a":"Go home","post_message":"#BREAKING: Organizers estimate around 250,000 people flooded the streets for the Women's March on Chicago – more than three times the expected attendance. Details: nbcchi.com/eWVXidj"},{"comment_id":"1092696630813956","commenter_b":"Ur aunt eats them out of a can","commenter_a":"Quan Lawson","post_message":"This massive octopus escaped through a tiny hole in a fishing boat."}]
