[{"comment_id":"1139906406032404","commenter_b":"you are an idiot!! AND STOP KILLING ANIMALS!! They have souls too you creep!!","commenter_a":"Ok. So release the previous 5 years. That will provide an accurate picture of what to expect when the audited returns are ready for release.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"985606431474778","commenter_b":"@username, I understand what you're saying. I'm supporting Ben Carson for potus. But with all the voter fraud, illegals voting Hillary will be president. That scares the crap out of me.","commenter_a":"Sadly, I fear she will be our next POTUS. It's a bad, bad time in America.","post_message":"This is so sad."},{"comment_id":"1044157185605292","commenter_b":"Wikipedia that hoe","commenter_a":"Let's be real, we never went to the moon.. We did not have the technology to go through the Van Allen radiation belt. The astronauts would had been cooked alive.","post_message":""},{"comment_id":"10153415680402293","commenter_b":"How about we stop immigration all together, butt out of everywhere and take care of our own problems!","commenter_a":"He wants to ban Muslims from entering the USA but why he doesnt ban the US from stealing Muslim's oil and lands","post_message":"“How can a country that always talks about human rights and freedom do this or even consider this?”"},{"comment_id":"1002013776554647","commenter_b":"I dont think Buying Sex is a Game Changer Anymore. Lets get Real Here. You got a Lunatic Acting Like Hitlers Twin Brother Running and Thats Ok? Buying a Hooker is somehow More Repulsive?","commenter_a":"Intriguing.","post_message":"It sounds like this information could definitely ruin a campaign -- and it WILL be released."},{"comment_id":"10153634972561350","commenter_b":"She looks good to me. Very feminine. I like it when ladies dress nice in the workplace.","commenter_a":"I mean, I'm just saying as a former JCP employee, but during our training it was made really clear that nobody was allowed to wear shorts, male or female. We were given a packet with what was okay to wear and what wasn't. The dress code is established before you even start working, so I don't really see the problem with them sending her home.","post_message":"This woman says she was sent home for wearing these shorts to work -- which she purchased in the store's career style section."},{"comment_id":"1727453857514316","commenter_b":"@username,just like your husbands grandparents came in the 30s,my grandparents also came here but in1907 and came threw Eli's Island LEGALLY which was harder to do in 1907 ..so there is no excuse for some coming here illegally today,none what so ever!!","commenter_a":"Trump wants illegals gone and so do I. My dad came to this country legally and at age 65 is still going strong. My brothers are so fortunate and blessed that my parents have given us this opportunity to make something out of ourselves. Seeing illegals demand stuff and act like they deserve things we Americans worked hard for burns me up inside. Illegals have no rights to anything and should be deported and forced to go through legal channels to attain citizenship like other immigrants. We need a wall or a stronger more secure border and absolutely no amnesty for these criminals","post_message":"\"Donald Trump is not a racist.\" Today, in front of Trump Tower, Donald J. Trump supporter Pastor Mark Burns fought back after an illegal immigrant activist tried to shout him down."}]
