[{"comment_id":"1142481939134045","commenter_b":"F*** that nicole. That's not kool. Omg! 😨","commenter_a":"@username Logan Rose","post_message":"Would you? #WSHH"},{"comment_id":"1215546011816966","commenter_b":"This is still AMERICA. MOST OF US STILL. BELIEVE AND HAVE LET OUR CONSTITUTION , BILL OF RIGHTS AND AMENDMENTS. WORKING IN THIS COUNTRY. YOU DONT LIKE THOSE LAWS OF OUR LAND. YOU ARE NOT A TRUE AMERICAN. SO YOU HAVE NO SAY. BECAUSE YOU HAVE NOT PASSED THE LAWS OF IMMIGRATION TO BE A CITIZEN OF THIS UNITED STATES OF AMERICA. AND JUST BECAUSE YOU ARE BORN HERE DOES NOT. GIVE YOU THE RIGHT. TO UNDO OUR LAWS. IT IS BREAKING THOSE LAWS TO DO SO","commenter_a":"Bimbo has been drinking the koolaid","post_message":"This is ABSURD."},{"comment_id":"10153276953617293","commenter_b":"Whitesplaining.","commenter_a":"I guess since the whitest guy in the world doesn't find it offensive it must not be.","post_message":"\"I don’t find it offensive,\" Jeb Bush said. \"Native American tribes generally don’t find it offensive.”"},{"comment_id":"1258250390858975","commenter_b":"She's trash too,","commenter_a":"No jobs or their boss refuses to buy group health insurance and a heavy extra tax next year for not having health insurance. All those young healthy folks need to buy premiums so the insurance companies keep up their profits.","post_message":""},{"comment_id":"10156397443350725","commenter_b":"Proud of my home state for going for Trump!!","commenter_a":"Trump is a chump. As soon as he gets out of the way we can get about having a serious candidate.","post_message":"Thank you SC! We will NOT let political correctness get in the way of keeping America SAFE! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"10157601256035594","commenter_b":"I don't know who you are hanging out with but you should protect your pussy...","commenter_a":"Hillary calls Trump supporters deplorable... yet a Hillary supporter does this, this disgusting attempt at a 'protest'. This is more foul than the WORDS Trump spoke.","post_message":"“Dear Mr. Trump, I’m not able to mail you my actual p----, so I’ve included the next best thing. Cheers, Emily.”"},{"comment_id":"10156718983275206","commenter_b":"@username's campaign is not particularly offensive to women neither is her platform desirable for America. Gender is a prominent component of her campaign. There is nothing even suggesting leadership ability; but everything suggesting bias and intractable partisanship.","commenter_a":"love your definition of feminism Carly, so true","post_message":"I know I’m not the liberal Left’s fantasy candidate. But a feminist is a woman who lives the life she chooses for herself—not the life that The View, or Hillary Clinton, or Planned Parenthood orders her to live. I told that to the women of The View last time I was there. It remains true today."}]
