[{"comment_id":"1893598704195217","commenter_b":"@username oh I know how to read... Someone is benefiting.","commenter_a":"At least revenue will be generated from taxes! 👍🏼","post_message":"THIS JUST IN: Proposition 64, which legalizes recreational marijuana use, has been approved by California voters. Here's everything you need to know: @webpagelink"},{"comment_id":"10153810770121336","commenter_b":"A woman who associates with a child abuser (most especially her own child's abuser) should not be allowed on television ! Creepy woman !","commenter_a":"Nope - why? She broke?","post_message":"Will you watch?"},{"comment_id":"10153626418796509","commenter_b":"She truly is hideous","commenter_a":"God she's so ugly . How did she trick Ferris Bueller into marrying her?","post_message":"Many celebrities attended the Metropolitan Museum of Art's Costume Institute Gala in New York. See pictures from the red carpet. @webpagelink"},{"comment_id":"1480511455341931","commenter_b":"Definition of Goldigger: A woman who dates men purely to extract money and gifts from men; in particular a woman who strives to marry a wealthy man.","commenter_a":"She only came for the boat. Now she's trying to act like she's not a gold digger. Too late","post_message":"This is the Tinder date from hell"},{"comment_id":"999119110145234","commenter_b":"I like the term \"political whores\". Appropriate. They were all PAID millions of dollars by Monsanto to vote this way. (I suspect this is just the tip of the iceberg.) We should throw them all out and start over.","commenter_a":"I'm very against genetically modified foods, but the fda is supposed to be a small little entity. They aren't supposed to tell me what to eat. You guys are cutting off your noses to spite your face, and until you are willing to look at both sides of the argument and find the truth, you might as well just keep eating it like the little sheep you are.","post_message":"Despite the fact that some polls show that up to 95 percent of the American people want foods that contain genetically modified organisms to be labeled, there are a lot of politicians that don't seem to agree. Here's who they are:"},{"comment_id":"10153470330831130","commenter_b":"Divorce first, then be a whore.","commenter_a":"To y'all bashing her.. this line right here says it all, \"In my marriage, I felt alone.\" - Divorce was inevitable. Period. THEN it says she met him when she was 17, they dated while she was in college, and got married once she graduated. Can you imagine if you married the person you dated at 17? It wouldn't work for a LOT of people.","post_message":"\"And just like that, my plans to spend the rest of my life with the man I loved and my best friend were crushed.\""},{"comment_id":"10155175542819369","commenter_b":"If she took this Job she knew what her role would require, and now she has changed her mind. Time for her to seek new employment plain and simple.","commenter_a":"I dont think any of u trump idiots would take a bullet for him ?if u do well LOL !!","post_message":"The special agent in charge of the Secret Service Denver district is under investigation for suggesting she wouldn take a bullet for President Trump."}]
