[{"comment_id":"10154286126010326","commenter_b":"Hillary was lost in the past , she didn't care about the milleniels and helped destroy the base. Bernie is the future and was ignored by the filthy rich who are more Republican like than ever. Republicans were endorsing her.","commenter_a":"Eyes on the prize folks. Blue is going to be a tag team extraordinaire. We know the goal, it's not about who is the leader, it must be all of our blue and all of us.","post_message":""},{"comment_id":"10154708467139575","commenter_b":"@username -AMEN!!!","commenter_a":"There are many people that work on major holidays. I don't know why every year retailers being open on Thanksgiving is a huge deal. First responders, hospitals, airports etc never ever close. Instead of the media always focusing on the negative maybe they should focus on the positive and the people that work these Essential jobs and miss many holidays with there family's.","post_message":"Macy's is staying committed to Thanksgiving Day shopping, saying it will open at 5 p.m. this year. What do you think about this? Will you visit Macy's on Thanksgiving?"},{"comment_id":"10154246472810695","commenter_b":"I thought poppies grew from the earth","commenter_a":"Plz worry about the heroine statistics that are rising and rising. And stop giving people life in prison for a plant that grows in gods green earth.","post_message":"This family-friendly Easter event took a pretty surprising turn."},{"comment_id":"10154029757858132","commenter_b":"Wow. You ladies are some different kind of stupid","commenter_a":"Breastfeeding in public is fine but cover up, no one wants to see you whip your boob out in the middle of their lunch in a restaurant.","post_message":"This mother refuses to be shamed."},{"comment_id":"913170958829660","commenter_b":"@username Now suck on that and go vote for that murderer her name is clinton.","commenter_a":"No i don't support ending it ,it is a aganist the law they should be lock up.","post_message":""},{"comment_id":"1190272557692172","commenter_b":"I noticed, I don't believe I have ever before seen this. You can tell, they are sooo far distanced from our so called leader, lol. How is he allowed to carry on???","commenter_a":"In Obamas mind 9/11 didn't happen either. This man is a nut. Kick him out before he destroys this country. If you didn't know he was crazy before now, here's proof that he is. Pure old mean and crazy. America Please wake up. You can't be this brain dead.","post_message":"Somehow, Pentagon leaders don't seem too convinced..."},{"comment_id":"950439771634160","commenter_b":"Yeah you are a coward you b*tch","commenter_a":"Didn't any of you read this Bill or just the miss leading article Think Progress put up. Probably not the Bill will make it a CRIMINAL offence to conceal you're Identity by using a hoodie. Read the Bill you look Stupid making comments you know nothing about","post_message":"Ugly stereotypes shouldn't be enshrined into law"}]
