[{"comment_id":"10153007291820667","commenter_b":"yes... weed is as bad as crack. and if they made crack legal, will you or anyone you know start using it? if not why? its legal.... everyone will use it if its legal....","commenter_a":"Crack Cocaine is next! Woo hoo!","post_message":"Cloudy with a chance of pot smoke."},{"comment_id":"10155183414820725","commenter_b":"A whole alot of whores","commenter_a":"He's an attention whore!","post_message":"Remember when Kanye interrupted Taylor Swift at the 2009 Video Music Awards? Well, he rushed the Grammy stage last night, showing off his sense of humor and impeccable timing: @webpagelink"},{"comment_id":"10154936291493088","commenter_b":"> I don't know why it's impossible to believe it will happen again. Shane Those that are better informed than you are agreeing on this, big time, using measurements, not belief. You can't use your logic&belief on things that have happened over millions of years with this, that has happened over a range of 50 years. Keep reading up on this because you're getting very close.","commenter_a":"While I won't support any of Donald's nominations, I think climate change has always been around, long long before humans. And much longer still before the industrial era. The earth has been a waste land before, and it's also been a water world. I don't know why it's impossible to believe it will happen again.","post_message":"I will vote NO on the nominations of Scott Pruitt to be EPA Administrator and Rick Perry to be Secretary of Energy. The scientific community is virtually unanimous. Climate change is real, it is caused by human activity and it is already causing devastating problems in this country and around the world. We need an EPA Administrator and a Secretary of Energy who are prepared to stand up to the fossil fuel industry and their short term profits, and lead the fight to transform our energy system away from fossil fuels to energy efficiency and sustainable energies. In discussing these issues with Mr. Pruitt and Mr. Perry I found no evidence to believe that they are prepared to do that."},{"comment_id":"10154283345199032","commenter_b":"No: Get out of the U.S. or shut up!","commenter_a":"Who cares? Really?","post_message":"Among the popular vote, Clinton has a strong lead."},{"comment_id":"1253114871421932","commenter_b":"@username eating pussy 😂😂","commenter_a":"Who refers to going down on a girl as \"giving head\". Wtf kinda gay shit is that... \"yeah I gave her head last night\" wtf","post_message":"Who should go first?! #WSHH"},{"comment_id":"1278673865484657","commenter_b":"I understand that Hillary has a criminal mind, and I never want someone like her in any office of our government. Her evil intentions are based upon her greedy lust for power and money. But with all due respect, Mr. Trump, what I find so incredibly \"shocking\" is that NO ONE CARES ENOUGH TO DO ANYTHING ABOUT HER!!! Everyone is pissing and moaning ALL THE TIME about Hillary and Obama, saying she done this, and Obama done that. BUT WHAT IS BEING DONE ABOUT THEIR REIGN OF TERROR? NOTHING. ZERO. ZILCH. NADA. To me that says that Americans are a bunch of APATHETIC ENABLERS. We the people deserve the lot we've been given because we, as a nation, have ALLOWED IT!!! #stoptheenabling #stopthetyranny #votetrump","commenter_a":"\"Because one wrong move can mean the difference between life and death.\" -Hillary Clinton, 8-25-16 We know that's true, Hillary. We know that's true. Signed: Ambassador Stevens Sean Smith Glen Doherty Tyrone Woods","post_message":"Hillary Clinton’s actions constitute all of the elements of a major criminal enterprise - she created a private illegal email server in order to hide her corrupt dealings. She did so knowing full well it would put American lives at risk by making classified information highly vulnerable to foreign hacking. But, she didn’t care – as long as it helped her get away with her crime, no risk to America was too great. Then, to further cover-up her crime, she deleted 33,000 emails to keep them out of the hands of authorities and the American public. As a further element of the criminal cover-up, she claimed under penalty of perjury that she turned over all of her work related emails. We now know this to be one more massive Clinton lie. The FBI found thousands of work-related emails she failed to turn over, including the new discovery this week of ..."},{"comment_id":"10153069061709342","commenter_b":"Has She wore it all year? Then it would of been out of respect and not show","commenter_a":"Let her wear it!!!!","post_message":"A Native American high school senior is fighting for her right to wear an eagle feather with her cap and gown. She says its about respecting her heritage. School officials call it decoration."}]
