[{"comment_id":"821054791362772","commenter_b":"Keep your smug ass out of Texas !! YOU are NOT wanted here !!!","commenter_a":"Barff, She is in it for Hollywood, Wall Street and anyone with money who dumb enough to fall for that LIAR THIEF, DOUCHBAG!!","post_message":"This has to be said. Last night AP declared Hillary Clinton had garnered enough delegates -- by way of super delegates -- to secure the Democrat nomination for president. Everyone is expressing how this is a great historic moment. I agree, it is a historic moment. The new American Socialist Party, once known as the Democrat Party, now has a sitting president and a nominee for president who abandoned Americans to die and lied about it. And to all the detractors who would dismiss this, just think about the mother of Sean Smith widow and orphaned child of Tyrone Woods.and the families of Ambassador Chris Stevens and Glen Doherty. This is not a historic moment for them. It is an indictment of how America rewards the most despicable and abhorrent behavior. This is a sad day for our America -- well, at least for the mindless Kool-aid drinking sycophant followers ..."},{"comment_id":"10153123967295329","commenter_b":" ! Paco nooo","commenter_a":"Caffe Con Lechee","post_message":"We all have that That One Co-worker who can't control themselves around cake."},{"comment_id":"10155465475828797","commenter_b":"The president of Mexico is worried that if the drugs stop coming into the US , he will lose lots of money! Plus if all the Mexican criminals are send back , Mexico will be in more havoc !","commenter_a":"We The united states of America want President Trump to build a Border Wall just like Mexico! Also I would like to see the same Mexican LAWS on immigrants coming into their country, the same Mexican Law's in United States","post_message":"WATCH LIVE: Sec. of State Rex Tillerson and DHS Sec. John Kelly hold a joint press conference Thursday in Mexico City after meeting with Mexican officials, including President Enrique Peña Nieto."},{"comment_id":"1071556556193998","commenter_b":"So true , I love this","commenter_a":"It all starts within by releasing denial, accepting where we are, and then seeing what opportunities are there. <3","post_message":""},{"comment_id":"10154097033159117","commenter_b":"If you want to save money, deport Native-Born citizens. The immigrants cost less. @webpagelink","commenter_a":"our country is broke--go live somewhere else.","post_message":"\"So long as people are coming here to live peacefully and work peacefully, I think the government should have to show to us why they shouldn't be here.\" For the full video, go here: goo.gl/8DSL14"},{"comment_id":"1326473630726439","commenter_b":"To be successful in today's Republican Party you have to push a potent mix of craziness and meanness.","commenter_a":"The rise of the evangelical politician. The moderate and liberal republicans moved to the Democratic party and the conservative Christian moved to the Republican party. This was all in the 50's-70's there was a great migration because the majority of the Republicans didnt like the move in the direction to conservative ideals so they moved to the Democratic side. So your Democrat is actually your Republicans pre evangelical","post_message":""},{"comment_id":"10153079471709411","commenter_b":"Pakistan is terrorized from within, same as we are from the west.","commenter_a":"I wonder if this drone terrorised the inhabitants of the White House as much as US drones do to civilians in Pakistan?","post_message":""}]
