[{"comment_id":"10154839732705695","commenter_b":"Amen to that!","commenter_a":"If Trump can be manipulated by someone half his age with no power over him then he doesn't belong in any leadership position, let alone the Presidency.","post_message":"She suggested that Trump may not have known his microphone was on, calling it \"kind of a boy talk\" that \"Access Hollywood\" host Billy Bush was encouraging."},{"comment_id":"10153507149617452","commenter_b":"Your so dumb @username. Get ready to go back to Mexico or Cuba or wherever u from. Smh","commenter_a":"you idiots still voting for Trump. Smh","post_message":"New York Primary: Donald Trump and Hillary Clinton have won their parties' primaries in New York."},{"comment_id":"635519663305279","commenter_b":"And cut her off. And see her vagina shut","commenter_a":"Deport her and her whole family","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"10154156141525470","commenter_b":"Just have her carry bacon with her if she's in one of those \"gun-free\" zones.","commenter_a":"Wow! How scary is that! Pray to keep this family safe.","post_message":"A St. Louis area woman who is reportedly on an ISIS hit-list said an FBI agent came to her home and told her to “arm up” because she is a potential target. A Special Agent with the FBI on Wednesday came to April Agers’ front door, knocked and delivered the startling news. Agers is on an ISIS hit-list."},{"comment_id":"10153308958722411","commenter_b":"Beyonce ruins everything!","commenter_a":"Blah","post_message":"What did you think of the Super Bowl 50 Halftime Show? Highlights: @webpagelink"},{"comment_id":"10154678643996729","commenter_b":"Screw that ignorant queer!","commenter_a":"It makes sense now why the Obama administration doesn't want us to have guns, he needs to sell them to people that hate us.","post_message":"This one hits close to home..."},{"comment_id":"10153009927864586","commenter_b":"Let someone stand on that bitch's head!","commenter_a":"I still cant get over the idea that an organization that euthanized dogs and cats and put them in dumpsters is denouncing anything to do with being cruel to animals. Google the pics... PETA EUTHANIZED ANIMALS","post_message":"ICYMI: Sarah Palin posted a picture of her son STANDING on the family dog & thinks it's totally okay: @webpagelink The most important thing we can teach our children IS COMPASSION. SHARE if you agree!"}]
