[{"comment_id":"1044675162261267","commenter_b":"Now go build my wall","commenter_a":"*You're *Putting","post_message":"Right!? I sure hope so!"},{"comment_id":"1131895816845262","commenter_b":"husbands fault not the woman","commenter_a":"Is this Hilary Clinton? Always the women's fault, cause the man didn't know he was married.","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."},{"comment_id":"10153974541414575","commenter_b":"Poor pup glad he's doing well now just hope he finds a family asap","commenter_a":"How bad is Peyton hurt, I'm looking for a small dog, but low maintenance, I'm disabled my self an single","post_message":"Peyton the dog was found horribly injured along a Kentucky highway after being attacked by a coyote or large dog and hit by a car. Now, thanks to a local rescue group, he's getting much-needed medical care."},{"comment_id":"912344515551025","commenter_b":"Illegals are taking jobs we Americans can't or won't take...","commenter_a":"Well I like Cruz...a lot. My husband and I both voted for him. He's a true conservative and defender of the constitution....","post_message":"Ted Cruz voiced his strong opposition to President Barack Obama's lax enforcement of our nation's immigration laws, arguing that his policies have led America down a path of economic turmoil. @webpagelink"},{"comment_id":"1698523013768491","commenter_b":"Women making decisions over a man's body","commenter_a":"It's not for fucking cosmetic reasons. It's for hygiene and it prevent a large amount of penile infections.","post_message":"Y'all should probably still stop cutting baby's dicks for cosmetic reasons though."},{"comment_id":"464590737066851","commenter_b":"Unbelievable , to do that to an Elephant . Ought to cut his ta#@#@ fingers off.","commenter_a":"Neither.","post_message":"Left side: Donald Trump's son holding the tail that he cut off an elephant he shot in Africa. Right side: Chelsea Clinton working to prevent the illegal trade of ivory in the world. Whose family values do you prefer?"},{"comment_id":"10154469596571523","commenter_b":"How many illegal voters are on that too???!!!","commenter_a":"Who do they poll?? They never call me ever! I think they only poll those that are known demo's.....And personally he doesn't care what they think....he is just doing his job! GO TRUMP!!!","post_message":"President Donald J. Trump's approval rating reached a new low Saturday."}]
