[{"comment_id":"10154446510547098","commenter_b":"Trump is a Nazi Hitler KKK. He does not care about you. Are you rich? You watch what that orange man does. President Obama is the best president the United States of America ever had!","commenter_a":"Liberals are very hateful and violent","post_message":"NIGHT OF CHAOS: Protestors broke windows, threw smoke bombs, and started a raging fire on the UC Berkeley campus last night...And now, President Trump is questioning funding for the school. Read more: @webpagelink"},{"comment_id":"754375298024849","commenter_b":"I thought you did well.. BUT we want the illegals gone.. I am not a fan of the illegals... Get a plan.. announce it and I will get on board... I am not a fan of Mexico...","commenter_a":"jeb is no good","post_message":"The Reagan Approach"},{"comment_id":"10153430683108812","commenter_b":"@username Bryant Carchi","commenter_a":"Clarette Gaviola COLOMBIA!!! :)","post_message":"WATCH: Dramatic moments as members of Colombia's national police run along the rushing Liboriana River near Salgar after this dog fell in the river: @webpagelink A landslide May 18 devastated the area, killing at least 83 people -- (click video for audio)"},{"comment_id":"1057253901026942","commenter_b":"and raising the min wage only cuts jobs, hrs, and closes busnesses","commenter_a":"We've seen this movie! And it doesn't end well for most Americans","post_message":"Research has found that massive tax breaks for the wealthy don’t trickle down into economic growth."},{"comment_id":"1771115309794499","commenter_b":"Lock that b@tch up","commenter_a":"Obama did not even TRY to fix anything. He continued with the corruption at DC. And after 8 years his answer is \"vote for Hillary so she can\". And some people are actually falling for it. Pathetic!","post_message":""},{"comment_id":"10153377243163812","commenter_b":"Criminals go to Jail not to a coffin u c u n t","commenter_a":"Never in my entire life did I see so much racism!!! And it's NOT whites against blacks but the other way around!!!! Freddie gray was a criminal as was Michael brown!! Both got what they deserved in my opinion! Both had rap sheets a mile thick! Don't break the law and you won't get arrested! Simple logic! Don't get me wrong in today's society many cops coming are only there for the power but there are more that truly want to make a difference and it's sad when they're charged for trying to remove scum from the streets!","post_message":"BREAKING UPDATE: Warrant issued for arrest of 6 officers in Freddie Gray case; various charges including murder, manslaughter, assault being leveled: @webpagelink"},{"comment_id":"10153215864872235","commenter_b":"She's just making up the rules as she goes along.","commenter_a":"200,000 dollars so they can keep serving shitty pizza! Yay! Everybody wins!","post_message":"Someone needs to drink a big, tall glass of STFU juice at this point."}]
