[{"comment_id":"10154765929828812","commenter_b":"That retort would demand a Breathalyzer test immediately in any Protective Custody or Dangerous-ness to the public situation. The man is incapable of formulating a complete and comprehensible sentence in English. Does he, maybe speak English a second language like some immigrants do? I've watched people get detained/PCd for less. He's going to lead the free world. We have illuminated the planet with a new low in the dummie-ing down of America.","commenter_a":"One temper tantrum away from WWIII","post_message":"Donald J. Trump says he \"could tell\" from intelligence officials' \"body language\" they were unhappy Pres. Barack Obama \"did not follow what they were recommending.\""},{"comment_id":"1062665507148980","commenter_b":"Scum","commenter_a":"They are a terrorist group and should all be locked up.","post_message":"Black Lives Matter Takes to Twitter to Celebrate the Slaughter of Baton Rouge Police. Here are Their Sick and Disturbing Tweets..."},{"comment_id":"10153506552374342","commenter_b":"She looks like a freaking man","commenter_a":"Looks like a dude","post_message":"We're getting our first look at the female shooter in Wednesday's tragedy in #SanBerardino."},{"comment_id":"939125846176797","commenter_b":"@username - absolutely, only 2 children & no marriages in what 8 years - that's actually fewer children that I would expect. She MUST have been using birth control.","commenter_a":"The audacity of this woman is amazing. She preaches abstinence, and criticizes women and girls for being irresponsible, all the while doing whatever the hell she pleases. I think having to pay child support is small potatoes compared to her hypocrisy. Karma will get you sooner or later. Pay up Bristol, it's your turn.","post_message":"Bristol Palin brought this upon herself. After all, she could have just practiced what she preached. Now, it's her turn to take responsibility."},{"comment_id":"642882945885651","commenter_b":"Not really. Go read history..that's a facade...","commenter_a":"LOVE the Bush family! So presidential, respectful, and patriotic. Something I've missed for the last 8 years and the coming 4 years.","post_message":"President Obama, President George W. Bush, First Lady Michelle Obama, former First Lady Laura W. Bush, and others speak at the opening ceremony of the Smithsonian National Museum of African American History and Culture."},{"comment_id":"10156082273560354","commenter_b":"Why in truth is it impossible to build this wall and yet we can send people to the moon???????????????????????????????","commenter_a":"UNIVISION owns Rick Perry now?","post_message":"\"It’s 1,933 miles from Tijuana to El Paso to Brownsville and you’re not going to build a wall on that distance. What you are going to do is...\""},{"comment_id":"576869582486929","commenter_b":"BULLSHIT !","commenter_a":"And who's to pay for the insurance? Oh forgot the WORKING CLASS WITH TAX THAT'S WHO!!!!","post_message":"Congress Approves Bill Offering Free Cars To Welfare Recipients. Your tax dollars hard at work. Does this disgust you?"}]
