[{"comment_id":"1003038786410224","commenter_b":"Boycott George Clooney!","commenter_a":"Doesn't he still support Clinton?","post_message":"George Clooney is right: the powerful influence of money in politics is obscene, and it is my belief that you cannot do away with big money in politics if your campaign is funded by big money."},{"comment_id":"10155131365895231","commenter_b":"Girl preach!","commenter_a":"She will go when He calls her Home...we've all been on Life Support from our Day 1...","post_message":"Prayers for the Houston/Brown family: Bobbi Kristina will reportedly be taken off life support on Feb. 11th to allow her to pass on the same day as Whitney Houston."},{"comment_id":"1015490965174099","commenter_b":"It takes a woman to clean up a big mess! I think she can do this!","commenter_a":"As usual, I am sure this is Not a accurate statement, as you have to factor in suicide and accidental shootings.","post_message":"Since the last #DemDebate, nearly 3,000 people have died from gun violence in the United States. It's time to act."},{"comment_id":"1331853210182520","commenter_b":"Yay fast food workers making more money then military let's go.","commenter_a":"I hope everyone that vote yes on this realizes that wage increase comes from somewhere and it isn't going to be from your employers share of the profits. So when you get laid off, loose your paid vacation or other benefits.... you only have yourself to blame.","post_message":"PROP 206 ON A MINIMUM WAGE INCREASE HAS PASSED!"},{"comment_id":"10153809111181336","commenter_b":"You will feel it when your movies plays to less than half the audience shows up..","commenter_a":"IDIOT","post_message":"Quentin Tarantino has finally responded to the firestorm that’s been brewing since he criticized police officers at a rally last weekend, and he says he won't be \"intimidated.”"},{"comment_id":"10153881139329456","commenter_b":"Not Thugs , WORTHLESS TRASH!!!!! \\b","commenter_a":"Look all you people who argue what a thug is. Those two are thugs.","post_message":"Missouri police say the 2-year-old was left alone in his crib for 38 hours and reportedly died from hyperthermia."},{"comment_id":"10153200811382377","commenter_b":"I'll agree with you on that , but it still doesn't change my position on accepting unvetted refugees !","commenter_a":"So he just declared the Obama administration a terrorist group then !!","post_message":"British Prime Minister David Cameron: \"The Muslim Brotherhood is not the only movement that promotes values which appear intolerant of equality and freedom of faith and belief.\""}]
