[{"comment_id":"10154468181011833","commenter_b":"What a gal.","commenter_a":"Matt Brown Ivana Wong","post_message":"This grandmother confronted home invaders with the only thing that could level the playing field: a firearm."},{"comment_id":"1110991635663754","commenter_b":"All he did was that march. And she's scared? She worked under Obama for years! Goodness sake you're a liar","commenter_a":"He should....he's been a supporter of equality his entire career....Hillary has not!! Hillary is the dost kind of candidate...she will switch up her position just to look good...Bernie Sanders marched with Dr. King...Hillary is terrified of black people....fake a%%","post_message":"Here's how Bernie Sanders may be starting to crack the crucial demographic of Democratic voters."},{"comment_id":"1103808136307925","commenter_b":"Don't explain...just tell her to go, now!","commenter_a":"Why don't these people go now ??? It is no big loss !!!!","post_message":"Someone really, really, really needs to explain to her how this whole process works."},{"comment_id":"10153118055667623","commenter_b":"She's hot!!","commenter_a":"If you have to fight for him then he wasn't yours in the first place. I hope that you're pleased with yourself in hindsight today.","post_message":"A 26-year-old North Carolina woman allegedly stabbed another woman Tuesday night during an argument over a man."},{"comment_id":"10154680168205575","commenter_b":"@username that's a woman I would vote for","commenter_a":"You know, enough with this BS, I hope Trump wins again in 2020, and then Pence follows. These deranged off the rails nut cases think they lost now, just wait.","post_message":"Uh oh . . ."},{"comment_id":"10153422129686636","commenter_b":"legal migrants not border jumping criminals","commenter_a":"Trump is a right wing extremist who perpetrates racial stereotypes about minorities to serve an agenda. Trump is an opportunistic bigot who has historically enjoyed good relations with Muslims but to become elected, he has jumped on the bandwagon of Islamaphobia. Attacking the Mexican community is also another opportunistic attempt to create hatred, division and anger. The most beautiful thing about America is its a nation of immigrants. A melting pot of many nationalities and a true leader would do everything in their power to unite all of us as opposed to dividing through religious and racial hatred.","post_message":"Well played, Canada"},{"comment_id":"10153609828841051","commenter_b":"and where are these little bastards from ? shot there little asses down like the dogs they are and make there parents pay for this lady for the rest of her life and a huge settlement to her first.","commenter_a":"People are VENDICTIVE!!!! Mean...and must be CRAZY! What makes people want to do these things! We need an island , or send them to the Muslim area. There they will see what CRAZY IS!!!","post_message":"First these boys attacked an 87-year-old woman. Then they raped her. And then they poured bleach down her throat."}]
