[{"comment_id":"674719889350666","commenter_b":"these Muslims. should. be kept out our country there Radical. persecutors. of real born am Americans. they hate us","commenter_a":"The","post_message":"Khizr Khan's speech at the Democratic National Convention has made the pocket Constitution a best seller."},{"comment_id":"10153741817406178","commenter_b":"Hillary is an unclassified POS !","commenter_a":"I think he is smoking crack.........","post_message":"Well I suppose all is forgiven now, isn't it?"},{"comment_id":"10153410031966615","commenter_b":"Oh man. This breaks my heart. I FOUGHT for my baby to live and can't even begin to imagine this happening to my children. :(","commenter_a":"Horrible story, horrible people to treat their kid like that. But I still can't figure out where was that carseat? Is it so hard for wpxi to say if carseat was in the car or in the house? Every time I read the story it just says child was left in carseat.","post_message":"BREAKING: The parents of a 23-month-old girl who died after police said she was left in her car seat for 13 hours have been arrested -- and will face homicide charges. WPXI Cara Sapida is talking with police and will have the latest on Channel 11 at Noon."},{"comment_id":"1733461333592333","commenter_b":"Build that wall! ! !","commenter_a":"Deport them all","post_message":"Democrats gave undocumented immigrants and their concerns a featured role on the first day of the Democratic National Convention, drawing sharp contrasts with Donald J. Trump and his hardline proposals on immigration."},{"comment_id":"10153161322294726","commenter_b":"If she moves her lips She is lying","commenter_a":"Think she bad now if she WIN. White house .no stopping HER","post_message":"WATCH: Bombshell Report Clinton Did Use Private Email For State Department Business"},{"comment_id":"476667025791225","commenter_b":"I agree","commenter_a":"He's right on!","post_message":"Donald Trump spoke out against gun-free zones in last night's debate, calling them \"target practice for the sickos.\" Agree or disagree? Via Opposing Views"},{"comment_id":"10154465845766162","commenter_b":"This is different, this girl has some evil in her!!","commenter_a":"Huh? Well that's just stupid. I tell you to jump off a cliff, and you do it... You're the idiot.","post_message":"A teenager who sent her boyfriend dozens of text messages encouraging him to take his own life and told him to \"get back in\" a truck filled with carbon monoxide fumes must stand trial for involuntary manslaughter: @webpagelink"}]
