[{"comment_id":"690501341083047","commenter_b":"We don't have to deport them all. 1. Enact extremely harsh prison sentences and fines for their employers. 2. Cut off all government entitlements to them, including drivers licenses. 3. Open service centers South of the border specializing in United States work permits for any company needing cheap foreign labor. Said employer would be responsible for all housing , food , transportation costs and hospitalization. The only way to get a job here would be to sign up in Mexico! Then wait just like the rest of the world has to. Enact those measures and most will self-deport! Those who don't are criminals and harshly dealt with! All anchor babies should be stripped of citizenship and also deported. Enough of these criminal aliens!","commenter_a":"What George Lopez said ain't much better than what Trump said! They are both wrong! This country was built by immigrants and most of them came here illegally including the white man! The only Americans are the native Americans everyone else is an immigrant! Native Americans didn't invite immigrants here! So don't fool yourselves! White man came here illegally! Massacred native Americans brought black slaves illegally and now have a problem with Mexicans! What a joke! Mexicans don't come here to take your jobs! They do the jobs that your too lazy to do and won't do them! White people go to these countries to get there labor and no one says nothing about that!","post_message":"Ummm ok?"},{"comment_id":"1140745955997895","commenter_b":"@username just who do you think you are? It's not over until the FAT lady sings.","commenter_a":"Are you kidding me? Trump nor Newt will NEVER get NEAR the White House!!!","post_message":"Would you like to see Newt Gingrich serve as Chief of Staff in a Trump administration?"},{"comment_id":"1098378433550493","commenter_b":"Gore's win was not robust enough and Bush et al weaseled their way into the White House and blew up the Middle East nearly blew up Roe V Wade - even if you have to hold your nose it will be worse if Hillary loses - people will die, the environment will be further destroyed, social security will be looted. Please reconsider. Fight for a third party after the election or begin now but please don't let Trump win - the pleasure of the spite will not be worth it. Just look at the destruction, devastation, the inhumanity, wreckage of Bush presidency. If Hillary is defeated because of the spite of Bernie people it will be a Pyrrhic victory certainly.","commenter_a":"Bernie, I will follow you anywhere... but I won't be able to vote for HER. I don't begrudge you supporting her... I'm sure there was a lot of pressure to do so as well as strategic reasons. I CAN get behind down ballot progressives though! Love you, Bernie!","post_message":""},{"comment_id":"1287852217938587","commenter_b":"Don't worry Hillary is gonna make it all go away!","commenter_a":"everything is so simple, what would you do if you were in their place?? if you were from the illuminati or some sort of influence to the world?? right? we would do whatever it takes, use the media and technology or any type of power given to us to lie to ppl to influence the. and make them thing whatever we want to think...population control","post_message":"Now that we finally know the Orlando shooter's real motive, the question remains: why did the FBI try to hide it for so long?"},{"comment_id":"10153208171456167","commenter_b":"A Ass is a Ass .","commenter_a":"We should promote his show on our facebook....","post_message":"Warning: These are some truly disturbing and vile remarks."},{"comment_id":"10154156972868984","commenter_b":"ONE MORE TIME TO ALL OF YOU WHO BELIEVE THAT ALL OF US ARE INNOCENT OF EVERYTHING UNTIL WE ARE CHARGED AND THEN FOUND GUILTY IN A COURT OF LAW! IF THIS WAS YOU, A FAMILY MEMBER OR A FRIEND WOULD YOU GO SCREAMING JAIL THE SOB OR BITCH? OUR JUDICIAL SYSTEM IS BASED ON \"THE wPRESUMPTION IF INNOCENCE\" THAT ASSUMPTION PROTECTS ALL OF US FROM BEING JAILED WITHOUT DUE PROCESS! A FEW OF YOU BRING UP GENERAL PETREAUS, HE WAS A GREAT GENERAL AND IS AN HONORABLE MAN BUT HE PLEAD GUILTY OF ALL CHARGES INCLUDING DIVULGING HIGHLY CLASSIFIED INFORMATION TO HIS BIOGRAPHER WHOM HE WAS ALSO HAVING AN AFFAIR WITH. HILLARY HAS DENIED ALL CHARGES, WHICH IS ALSO HER LEGAL RIGHT UNDER OUR SYSTEM OF JUSTICE, AND NOW THE DOJ IN CONCERT WITH WHATEVER THE FBI CAN DERIVE FROM THEIR INVESTIGATION MUST PROVE THAT SHE IS GUILTY IN ...","commenter_a":"Dems are majority lawyers. Lawyers believe that if lies are stated long enough, they're perceived as truth and once a statement is made, it can't be undone. You can never un-ring the bell. She will continue to lie until way after she's indicted.","post_message":"Hillary Clinton just keeps digging herself deeper with this one... Is she your absolute LAST choice for president?"},{"comment_id":"10153181655947452","commenter_b":"Said the hipster wannabe as he hangs out at Starbucks thinking it improves his social status.","commenter_a":"Anybody who goes to Starbucks is an idiot. At Christmas or any other time of year.","post_message":"#MerryChristmasStarbucks: Starbucks' new design for its iconic red holiday cups has some customers feeling less than cheery, with one man saying the company \"removed Christmas from the cups because they hate Jesus.\""}]
