[{"comment_id":"10150886165499999","commenter_b":"feminists are pro-islam, so of course this concerns them","commenter_a":"What does that word 'feminism* do here? Feminism does not say what you should or should not wear. Some feminists may have delusions of what is best for some, but it is still not the feminism itself, what people belive or does not belive.","post_message":"Our top 10 comments of the week."},{"comment_id":"616410835216162","commenter_b":"Yes sure don't give a dam for that racist ass nigger whoopy","commenter_a":"Those with limited intelligence often resort to cursing.","post_message":"Whoopi tries to take on Ann Coulter on live TV, big mistake. This awesome. Whoopi needs to learn her place. Do you support Ann Coulter?"},{"comment_id":"678517065647894","commenter_b":"#TRUMPPOTUS Save America from wussies!","commenter_a":"When is NBC going to start posting about the latest Wikileaks stories?","post_message":"\"I regret coming to the Trump support event, and in particular allowing my son to be a part of it,\" one donor said."},{"comment_id":"693773307470374","commenter_b":"What a pig!!!","commenter_a":"Disgusting, just like his jackass friend! I guess that's how money talks.","post_message":"SPEECHLESS."},{"comment_id":"1179263908762059","commenter_b":"моод дэлгэрүүлж дээ... хэхэ...","commenter_a":"Jargalsaihan Mandakh, @username...","post_message":"Watch over 100,000 people swarm this public beach in China."},{"comment_id":"1007448135988608","commenter_b":"Lmao ik ik fr","commenter_a":"Me back in my days with the chancla 😂😂 @username","post_message":"Escape plan master"},{"comment_id":"1207859512585616","commenter_b":"Kick her out!!!! Dishonorable discharge!!!!","commenter_a":"She should be discharged, and labeled as an undesirable. Her fellow sailors cannot depend on her to have their back in a time of need.","post_message":"A Navy sailor made national news when she decided to film herself not standing for the flag. Now, she's in trouble... here's the swift justice she received. Do you think she got what she had coming to her?"}]
