[{"comment_id":"10153106152611336","commenter_b":"Imagine, Christian leaders to lead a Christian group? Lol!","commenter_a":"Maybe Cal state I should be recognized","post_message":"A Christian organization at California State University, Stanislaus has been de-recognized because the group wanted its leaders to be Christian."},{"comment_id":"503378786489136","commenter_b":"She is nothing but a bigot. Keep her locked up until she complies","commenter_a":"Do the right thing. Spread hate in the name of Jesus and shield your bigory with the bible. Claim you are a christian to defend your sorrid past to justify issuing your twisted moral judgment on others. Yes than you will be a twisted evangelical christian spreading the hate of your chosen religion.","post_message":"Who is the clerk in the middle of the same-sex marriage debate?"},{"comment_id":"10152721228310047","commenter_b":"This comes from a woman that laughed as she helped a rapist get away with his having raped a young girl... She knew he was guilty, too.","commenter_a":"If all the babies had a right to choose life or death--hmmmmm!","post_message":"Hillary Clinton and the radical Left believe that protecting abortion is even more important than your religious rights. Read & SHARE about attempts to prioritize abortion over First Amendment freedoms."},{"comment_id":"1043158469105219","commenter_b":"That's the spirit. Women, don't let anything keep you from making sandwiches!","commenter_a":"Suck it up buttercup,not everyone likes tattoos..","post_message":"'I don't understand how tattoos can stop me from making a sandwich'"},{"comment_id":"483457381844842","commenter_b":"Stupid,, Stupid,,, Stupid,,dumb bitch","commenter_a":"who voted for her?","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10155129809471929","commenter_b":"These two ladies. Need to step down they showing how they are. Active. With their mouth","commenter_a":"Crack kills","post_message":"Speechless folks..."},{"comment_id":"10153150400359087","commenter_b":"Oh, she's held to a different standard, alright! Her sh*t don't stink. No matter what she does, she's Hillary Clinton, and she's untouchable. Ask General Petraeus.","commenter_a":"Plain and Simple Hillary needs to be in jail period.","post_message":"“This is not a criminal investigation,” former Rep. Ellen Tauscher (D-Calif.) said. “There’s no question about that. It’s dancing on the head of a pin and frankly partisan politics.”"}]
