[{"comment_id":"1250456418323110","commenter_b":"Wonder what he or she was gonna tell on Clinton. What does that make now 4or5.","commenter_a":"How many more?","post_message":"DEAD!"},{"comment_id":"10154223685116409","commenter_b":"@username it is what it is, he is president elect, I did not vote for him but we always need to see the bright side of things.","commenter_a":"Everyone should give him a try, ACA is unaffordable for middle class families.","post_message":""},{"comment_id":"10154991489419726","commenter_b":"Oh please! Maybe she'll move to Syria and we'll never hear from her again!","commenter_a":"loser.","post_message":"Her Instagram has us thinking she might..."},{"comment_id":"10153342829529170","commenter_b":"Then STOP Them, enough already!!!","commenter_a":"homegrown terrorist and a president that wants Americans Disarmed.......YEA, THAT'LL WORK!","post_message":"If you're a liberal claiming ISIS doesn't exist inside the US, Barack Obama's own FBI Director has a message for you...."},{"comment_id":"10154091586819160","commenter_b":"@username @webpagelink","commenter_a":"lets see BLM carry guns and shoot police and beat up on whites. Burn our flag and want to separarte from the union. These guy protested without hurting anyone and had our american flag with them. even the policeman felt safe with them around. BIG DIFFERENCE.","post_message":"Despite carrying assault rifles, the group says it didn't mean to \"start any problems.\""},{"comment_id":"10153775896719087","commenter_b":"Nope they're Staying with her!","commenter_a":"Actually, the superdelegate system was designed to stop a primary candidate such as HRC from getting the nomination. They were put in place to prevent someone like her who wins the popular vote but is un-electable in the general election from costing the Dems the WH. The question is are they too corrupt and blind to fulfill their intended purpose which is to give the nomination to Bernie.","post_message":"“I think clearly that the superdelegate model was designed to stop outsider candidates like [Bernie Sanders], and in that sense, they’re doing what they’re designed to do,” said Former House Speaker Newt Gingrich."},{"comment_id":"1235543663197041","commenter_b":"Are you crazy fat black lady?","commenter_a":"Can't fix stupid","post_message":"Apparently, torturing white people and yelling \"F**k Donald Trump! F**k white people!\" isn't a hate crime..."}]
