[{"comment_id":"10154242157722690","commenter_b":"@username oh yes she is. No way would a women just go Willy Nilly about massive death. We are big on keeping people safe. He twits bc someone put him down. Just think if a country pisses him off.","commenter_a":"We have two people running for office that are both out for themselves. Ones going to court Nov 28th on a fraud case for his fraud school then we have one about email server. I mean come on we don't have a great choice! They both SUCK!","post_message":"FBI to reopen Hillary Clinton email investigation after additional emails were discovered as part of a separate investigation."},{"comment_id":"1128841157202139","commenter_b":"You STUPID, STUPID WOMAN. NO we as you call us\" White Folks\"are NOT going to stop saying ALL LIVES MATTER!!!. That is in no way a RACIST comment. In fact it is a very true comment. Where does all this stupidity come from. You need to read your BIBLE & pray long & hard before you start spouting these comments.","commenter_a":"NOT THE SHARPEST KNIFE IN THE DRAWER !!!!!","post_message":""},{"comment_id":"10153593708856770","commenter_b":"#TRUMPorTAXREVOLT #BOYCOTTAMAZON #TRYCLINTONFORTREASON #TRYOBAMAFORTREASON #REMOVERYAN #REMOVEPELOSI #AUDITTHEIRS #DISENGAGEWITHTHEUN #DISENGAGENATO #DISBANDTHEELECTORALCOLLEGE #INSTITUTEPOPULARVOTE #HOLDMEDIAACCOUNTABLE #IMPOSETERMLIMITS #VETERANSB4ILLEGALS #BANISLAM #UPHOLDTHECONSTITUTION #REVERSEALLOBAMAORDERS #ARRESTSOROSFORINTERNATIONALTERRORISM #WORKFARE #NOCITIZENSHIPNOVOTE #KILLCOMMONCORE #PURGETHEGOP","commenter_a":"The Muslim Brotherhood government in Egypt CRUCIFIED CHRISTIANS IN DOWNTOWN CAIRO--and they remained Obama's favored government. After the Egyptian people threw them out, Obama continues to consider the Muslim Brotherhood the legitimate rulers of Egypt.","post_message":"The Obama administration’s disappointment with the U.K.'s Brexit contrasts sharply with its celebration of the Muslim Brotherhood’s election in 2012."},{"comment_id":"10153899395243701","commenter_b":"Please take time to familiarize yourself with actual case law on this subject. Anyone under the influence of drugs or alcohol cannot legally consent to any sexual act. It makes no difference if she got that way voluntarily or involuntarily. YOU CANNONT CONSENT IF YOU ARE IMPAIRED. This is called rape","commenter_a":"I question this case also .... According to the accuser, Cosby urged her to take pills and to drink wine...... Urged her to do so??!!! So she did it to herself! I highly doubt an educated woman would take pills and drink in a room with one man without knowing the out come!! Personal responsibility is what all these people are not understanding! Read more: @webpagelink","post_message":"JUST IN: Bill Cosby has now officially been charged with sexual assault more than a decade after a woman told police the comedian drugged and violated her at his home near Philadelphia."},{"comment_id":"1173361852693721","commenter_b":"Oh oh, look out behind Hillary, she has her gass again, and gives it up to everyone on stage.","commenter_a":"Liar Hillary she just can understand that lying is not normal well I guess it is for her and Bill and Obama and her Party.","post_message":"Donald J. Trump is calling Hillary Clinton a liar, openly calling her a liar for making up that story about his being a recruitment video for ISIS. He's now demanding an apology for her lies."},{"comment_id":"10154393915434170","commenter_b":"They will find other ways !","commenter_a":"Guess the \"New World Order\" has been reordered....all the elites that envisioned a single Global Society can pretty much shove that right where it belongs!! :)","post_message":"The elites are having a meltdown, but the people of Britain have spoken. We've got the reaction from Donald J. Trump as well."},{"comment_id":"853718148092962","commenter_b":"Hope she goes to prison.","commenter_a":"She should pay it back and go to jail","post_message":"So long, farewell..."}]
