[{"comment_id":"889005157864717","commenter_b":"I remember the \" summer of love\". I hope I don't experience \"the summer of hate\". If you're looking for a change, this is the wrong guy for the job.","commenter_a":"He is not the establishment.","post_message":"Donald Trump Supporters: Why Are You Supporting Trump?"},{"comment_id":"1765230837092544","commenter_b":"Wow. So many posts are against Hillary. How can she be leading in the polls? Media bias and manipulation, perhaps? Watch for a stolen election.","commenter_a":"He is not hiding anything and the bigger concern for Americans is how much Hillary lies.","post_message":"Does Donald Trump actually pay his fair share in taxes? Is he worth less than he says he is? Does he have unsavory connections to Russian oligarchs? Until he releases his tax returns, voters won't know for sure."},{"comment_id":"559978767492171","commenter_b":"This @username guy can be on my tv screen anytime he likes. Hello, there 😍","commenter_a":"Hillary for President!","post_message":"Take a sneak peek at the MSNBC #DemDebate! Hillary Clinton and Bernie Sanders face off tonight at 9pm ET. Here's how to watch: @webpagelink"},{"comment_id":"10153927537756350","commenter_b":"Glad she isn't winning the contest. Shallow personality and spoiled.","commenter_a":"He didn't need to interview her and ask for an apology, when he already did the same night the mistake happened. She's a spoiled brat looking for attention, and of course Steve Harvey is the way. What it bothers me more, is the fact that he and his family has been threatened, and the media still paying attention to her, she's greddy! #getoverit #sorelosers","post_message":"See Steve Harvey come face-to-face with Miss Colombia Ariadna Gutierrez, the contestant he accidentally crowned Miss Universe."},{"comment_id":"10153198316596336","commenter_b":"Wilma Loo...Who LOVES you Girlfriend ? ;-)","commenter_a":"Translation:We hid the money in offshore accounts in tax evading countries,wiped our servers clean,burned all copies and rewrote history.Nothing to see here,move along,move along.","post_message":"“We made mistakes.” The Clinton Foundation has issued a statement after improperly reporting some of its donations. @webpagelink"},{"comment_id":"10155456952478797","commenter_b":"His mom was white you racist white hater!","commenter_a":"African american? He's interacial! His mother is white, let's not forget her!","post_message":"Honoring Barack Obama, the 44th President of the United States and the first African American to serve as president. bit.ly/2mfD3IE"},{"comment_id":"595288380595755","commenter_b":"We just had 2 bombings and a knifing involving these peaceful refugees after NOW RECEIVING OVER 10,000 of them and this idiot is still trying to sell them coming into our country! Well Obama you won't be in office next year and Trump is our mouth piece \" no vetting no refugees \" WE DONT WANT ANYMORE OF THIS CULTURE , ask Merkle in Germany about them, she said if she could go back and change her decision she would not have taken these Muslims in!!!!!!!!!","commenter_a":"He's wrong.........we have citizens right here that need our help first and foremost.","post_message":"President Obama says turning away refugees based on background or religion \"would be reinforcing terrorist propaganda.\" Agree or disagree?"}]
