[{"comment_id":"990875947619544","commenter_b":"Such an evil, self-serving, grandstanding waste of oxygen!","commenter_a":"Wasn't he born in Canada?","post_message":"At least he's fighting imaginary foes, this time."},{"comment_id":"990789407625962","commenter_b":"In coming President~Trump ^ seek and destroy all opposition within our borders and outside our borders VOTE TRUMP","commenter_a":"These and all jehadic Muslims are evil and need to be killed period.","post_message":"Who saw this coming? [Read below]"},{"comment_id":"1202403033149557","commenter_b":"Greg is right and you Libtards are in denial.","commenter_a":"To understand what Hillary and her leadership will do to America. all you have to do is look at our Democrat run cities. Poverty, Crime, Drugs and Hatred. Syrian Refugees and Open Boarders will only add fuel to the fire! Democrats do not want prosperity for everyone, they want to keep the poor dependent so they can perpetuate their cause of corruption and lies. It is a fact. An obvious fact. Only selfish, bleeding heart liberals could be so ignorant as to the facts and the reality of the situation. It is a joke. @webpagelink","post_message":"The women of the U.S. Senate are fighting to make their firsts the first of many."},{"comment_id":"10153064490042483","commenter_b":"Funny @username nowhere in your meme is there a picture of the woman you would force to become an incubator.","commenter_a":"Conservatives aren't pro life, they are just pro birth. They defund welfare and unemployment programs, don't support universal heathcare, want to deport \"anchor babies\" and so on. They need to stop pretending they care so much for unborn lives","post_message":"\"The federal government and several courts have made clear that a state cannot kick Planned Parenthood out of its Medicaid program simply because Planned Parenthood provides abortion,\" said Susan Watson, executive director of the ACLU of Alabama."},{"comment_id":"10153869614430329","commenter_b":"She's not even made up of gasses, geez","commenter_a":"We throw the term \"star\" around way too often","post_message":"She tells BuzzFeed News, “I don’t regret it for a second.”"},{"comment_id":"528487337334584","commenter_b":"#FUCKTRUMP #FUCKTRUMPLATINOS & YOU","commenter_a":"Latino for Trump! You don't have the explained anything. The system is crooked!","post_message":"STATEMENT REGARDING TRUMP UNIVERSITY It is unfortunate that my comments have been misconstrued as a categorical attack against people of Mexican heritage. I am friends with and employ thousands of people of Mexican and Hispanic descent. The American justice system relies on fair and impartial judges. All judges should be held to that standard. I do not feel that one’s heritage makes them incapable of being impartial, but, based on the rulings that I have received in the Trump University civil case, I feel justified in questioning whether I am receiving a fair trial. Over the past few weeks, I have watched as the media has reported one inaccuracy after another concerning the ongoing litigation involving Trump University. There are several important facts the public should know and that the media has failed to report. Throughout the litigation my attorneys have continually demonstrated that students who participated in Trump University ..."},{"comment_id":"10152804677074342","commenter_b":"Lots of prostitutes in England!!!!","commenter_a":"PROSTITUTES in LAS VEGAS. Stupidity","post_message":"DIARY OF EVIL: A teen has been found guilty of attempting to kill three woman out of 'revenge' and from frustration of not being able to lose his virginity. \"I was planning to murder, mainly women, as an act of revenge because the life they gave me. I'm still a virgin at 17.\" FULL STORY --> @webpagelink"}]
