[{"comment_id":"10153618615406320","commenter_b":"I think this moms do it on purpose.","commenter_a":"Please don't give this woman her kid back. They should take both. Her son will be next. Smdh","post_message":"SHOCKING: Child found 'Sweating profusely' Police in New Jersey had to rescue an child from a car seat in hot van while her mom went shopping. Details: @webpagelink"},{"comment_id":"1771313199818566","commenter_b":"Women just need excuses to be shirtless in public","commenter_a":"No.. He's not the ex-Stanford swimmer. He's a convicted rapist! Stop pampering the white boy FFS!!!","post_message":"We’re outside the Santa Clara County Jail where people are protesting the release of Brock Turner. He's the ex-Stanford swimmer who served three months after being convicted of sexually assaulting an unconscious woman."},{"comment_id":"1080515501999587","commenter_b":"Not going to stoop to your low, Rebio.","commenter_a":"Sounds like Rubio is gay. Wants to be in the bohemian group. Where all the rich billionaire and American leaders go and have a gay feast and worship something called mule. No woman are allowed.","post_message":"He went there..."},{"comment_id":"10154434933517690","commenter_b":"@username, she's a girl. Not a he. SHE!!!","commenter_a":"Myb6 year old saw this news story, not understanding the word transgender at all. He said \"That's mean them, I don't think God would like that\" The fact is kids don't fully understand the transgender thing. This little boy included. But if he wants to be included as a boy, then let him. The other boys don't have to know. This is like excluding a girl from football or something.","post_message":"The family of an 8-year-old New Jersey boy says he was kicked out of Cub Scouts because he is transgender, a move that could open a new front in the debate over discrimination in Scouting."},{"comment_id":"738159049657328","commenter_b":"I think that crooked, lying, evil bitch needs to be in prison","commenter_a":"K, this bit%h is really out there! She and her cronies want total power! I pray that God stops her!","post_message":"WOW. People NEED to listen to Hillary's response when asked if an individual's right to bear arms is a constitutional right... Do you think Americans should be scared of a Hillary Clinton presidency?"},{"comment_id":"1100615946681704","commenter_b":"@username I am very well aware of anything involving Trump or Hillary. I have kept myself very informed for years. Information he gained while being social with the Clinton's is exactly the information he needed to make his decision to run for President. She is corrupt. Period.","commenter_a":"There is a prayer movement sweeping across the country for Donald Trump. More and more roadblocks are popping up to stop him. If he is your choice, please share a prayer at 10 am and 7 pm that God will take him to the presidency. Feel free to share this post.","post_message":"Wow... he really said it! @webpagelink"},{"comment_id":"1877847435771618","commenter_b":"Hopefully she'll keel over and die.","commenter_a":"not so easy to back track in our modern age of electronics","post_message":"FRAIL LOOKING HILLARY HITS TRUMP FOR CALLING NYC ATTACK 'BOMBINGS' -- AFTER DOING THE SAME..."}]
