[{"comment_id":"10154729754221729","commenter_b":"She's a cunt.","commenter_a":"It does matter what you call it Killary , our young people in the United States were once again attacked .","post_message":"Whoa. About damn time."},{"comment_id":"1132111446809033","commenter_b":"Anyone who thinks this monster deserves peace to live her life free is more fucked up than she is!","commenter_a":"You people are sad! Leave her alone already, she deserves the right to be rehabilitated. Still watch her closely, but leave her alone.","post_message":"The convicted killer has changed her name several times since her 2005 release."},{"comment_id":"10153218753159270","commenter_b":"God will deal with this! He did it once.","commenter_a":"But your only going to enforce Christians to marry gays, but muslims can do whatever they want?","post_message":""},{"comment_id":"10153395170866162","commenter_b":"Alien had azz. Kmsl. Female leaves there kids with anyone for bad love..","commenter_a":"Shaun Sullivan look at this guys head. wtf","post_message":"DISTURBING: A 19-year-old man is charged with the murder of 2-year-old girl whom he was babysitting @webpagelink For the stories you care about -\" like\" ABC 7 Chicago!"},{"comment_id":"10152996410034330","commenter_b":"How about if we all carried guns to protect ourselves from worthless losers like this. Just kick them off the planet and they never will rob anyone else, thats for sure...","commenter_a":"Yes Paulette in a perfect world one could go to the ATM, grocery store, or anyplace else anytime at all, however in the real world there are criminals and scum who do prey on people when they make themselves vulnerable. Police and other security people cannot be everywhere to ensure nothing ever goes wrong. It's just common sense to use caution and good judgment when out alone.","post_message":"FRIGHTENING VIDEO: A woman who pulled up to an ATM was kidnapped at gunpoint and forced into her trunk and the whole ordeal was caught on video ---> @webpagelink The suspect even gave police a good look at him"},{"comment_id":"10153166751996336","commenter_b":"CIA is the source of evil, they create such groups like ISIS, Al-Qaida to fight its dirty proxy war in other countries","commenter_a":"Haha go ahead smash the headstones. They are just mad the one thing they can't take is our eternal life with Jesus.","post_message":"ISIS continues with their calculated campaign of terror across the Middle East, destroying Christian graves in the Iraqi city of Mosul."},{"comment_id":"10153134126831051","commenter_b":"Mother fucking bitch..","commenter_a":"A real POS","post_message":"Witnesses called 911 when they noticed this woman begin tossing something out of her car window. When the police finally caught up with her, she didn't bother denying it."}]
