[{"comment_id":"587852428063303","commenter_b":"@username WOMEN ARE THE FIRST TEACHERS OF MEN","commenter_a":"Amusing that Trump is too dim-witted to debate real issues affecting our country. Hahaha Republicans! Ready for Hillary 2016!","post_message":"Trump thinks attacking Hillary's marriage will save him. He'll soon find out how wrong he is."},{"comment_id":"10155858980760354","commenter_b":"Bitch has no morals !","commenter_a":"Do the world a favor and stop breathing!!!!!!!!","post_message":"Really?"},{"comment_id":"639543372893417","commenter_b":"As I said the jobs are what this is all about. Yet we continue to give unlimited tax breaks to these major corporations to stay here. Just look at all the money LOANED to GM that has never wholly been repaid and never will. Major corporations are \"pimping\" themselves out so WE the middle class can continue to pay for all their tax breaks. When our American companies relocate outside of our country they should be heavily taxed for importing there product here. Since they're paying these third world workers nothing anyway for once let's get into their profits.","commenter_a":"Oh well thank you is in order for saving those jobs. Too bad we the middle class have to make up for that $7m tax break you just gave them. What should have been done is let them leave and import their products back here and tax the crap out of them. Since they are going to pay some Mexican $2 hour. ONLY IN AMERICA!","post_message":"Trump's Carrier deal shows corporations they can: ✅ Threaten to outsource jobs ✅ Actually outsource jobs ✅ Still get a tax cut"},{"comment_id":"962417470484668","commenter_b":"Do with all the locks broken does that mean all these people will soon divorce ?","commenter_a":"Melissa Sheree Lisa Danielle","post_message":"Love 0 Heath and safety 1"},{"comment_id":"10153766161047217","commenter_b":"Stoning , beheading , kill non believers . No thanks not for me if that's peace then I'm a fairy","commenter_a":"Islam, this outdated cult ,has no place in a 21 century world....the quran is nothing more than a military pamphelt and islam is based on a cry for war to no end....madness......","post_message":"\"It's become much harder for modern women to live here after Friday night.\""},{"comment_id":"1152081494853966","commenter_b":"Well if men are allowed to use ladies rooms why didn't he just go in and guard her stall there. Maybe he didn't feel like a mommie that day.","commenter_a":"I don't shop at target, so...no big deal","post_message":"WOW! Father Guards the Door While Daughter Uses Target Restroom..Then This Happens. (VIDEO)"},{"comment_id":"10154335392498812","commenter_b":"learn the law because you look like an idiot. TRANSGENDER people can use the bathroom, not men like you and I. I cant just say oh I want to go pee in the ladies room. that isn't how it works. I have a friend who is transgender and her license now says female. she looks like a female. should she go into the mens room? the law is for people like that, not just people who decide today to go in the opposite sex bathroom.","commenter_a":"I won't be listening to them anymore!!! Transgender people are not the only ones with rights,,,if you're a man who wants to use the ladies room get a sex change ....Liberalism is ruining our country,,,,what was a constitutional republic is turning into a socialist hell hole","post_message":"Pearl Jam cancels North Carolina concert, calling HB2 law \"a despicable piece of legislation that encourages discrimination.\" @webpagelink"}]
