[{"comment_id":"10153679249728352","commenter_b":"Pure Evil!!","commenter_a":"SUCH HATEFUL EYES","post_message":"The most hated man in America, 21, smirks as he is hauled away in cuffs and a bullet-proof vest after his arrest ‘for shooting nine people dead at South Carolina church bible study’"},{"comment_id":"10154195854358256","commenter_b":"Nice strawman Julia. Careful you don't smoke around that one.","commenter_a":"Palin is as irrelevant on the right as Debra Wasserman Schultz is on the left.","post_message":"Sarah Palin, take a seat."},{"comment_id":"1395470217172404","commenter_b":"Who knew?","commenter_a":"This is not news talk about garbage.","post_message":"As if he had to announce this..."},{"comment_id":"10154437348239087","commenter_b":"Crooked swamp dwellers. Lock them up!","commenter_a":"Let's run a government with a weakened opposition and lack of independent oversight. What could possibly go wrong?","post_message":"BREAKING: Republican lawmakers have decided not to strip the Office of Congressional Ethics of its independence following massive public backlash."},{"comment_id":"10155456952478797","commenter_b":"His mom was white you racist white hater!","commenter_a":"African american? He's interacial! His mother is white, let's not forget her!","post_message":"Honoring Barack Obama, the 44th President of the United States and the first African American to serve as president. bit.ly/2mfD3IE"},{"comment_id":"1189206507769062","commenter_b":"Because white motherfuckers like you","commenter_a":"If black lives do matter....., then ask me this then and give an honest answer...., why have they not stopped selling illegal controlled substance off the streets? Why have they not make their community better for everyone? When was the last time they bring something positive to the community? Why can they not stop shooting each other for the upmost stupidest reason? When was the last time anyone was able to think for themselves and not allow the social media or the government telling them how to think? Why do they pull the race card whenever they get caught up in a felony offense and not man the hell up? Graduate from High school and get a career.","post_message":"#BlackLivesMatter were not happy with this speech"},{"comment_id":"10153398427016336","commenter_b":"And Never - Ever - try to make a woman choose between you or her horse! She will most certainly ride off into the sunset w/ o you!","commenter_a":"Ladies, Never make a man choose between you and his kids or his dog! You will lose every time if he is a real man!","post_message":"Faced with the \"it's me or the dog\" decision, a Virginia man chose his beagle."}]
