[{"comment_id":"1275021955856646","commenter_b":"They just need to stay out of our vaginas!","commenter_a":"Talk about several steps back for women's rights. Then women will need permission to use birth control, to vote, to get a job ... And if you are foolish enough to think permission is only going to apply with abortions, you are mistaken. This is Christian right wing control. Can you say Sharia Law, anyone?","post_message":"Oh look, more people not minding their own business."},{"comment_id":"10154180774646770","commenter_b":"We need to ban ALL muslims! That'd fix the problem!!","commenter_a":"And some of them are being trained at the age of five to behead their stuffed animals. They have posted it online. We need to be very, very careful as we do this vetting.","post_message":"Obama admitted very few Syrian Christian refugees, compared to thousands of Muslim refugees."},{"comment_id":"274137179658285","commenter_b":"@username paying for this useless wall? Yeah I know. It must be stopped!","commenter_a":"I wonder how many of these people are willing to take any of it illegals home, feed them, pay their medical bill and totally care for them?","post_message":"LIVE: Protesters gather at JFK Airport in New York in response to Trump's immigration order. A Yellow Springs resident is planning a local protest for Sunday: @webpagelink"},{"comment_id":"534767963372316","commenter_b":"HILLARY WILL TAKE OUR COUNRTY TO THE GROUND,ALL SHE CARE ABOUT IS POWOR","commenter_a":"In 1997, Donald Trump, who showed his personal courage by dodging the draft in 1960, had the gall to compare his heroism by sleeping with multiple women to the heroism shown by the brave men and women who served the United States in Vietnam. Interviewed by Howard Stern in 1997, Trump had the audacity to make the incredible claim that by risking his schlong to venereal disease from his sexual peccadilloes, his courage matched those who gave their lives facing mortar fire and bullets across the sea. Speaking of his sexual exploits, Trump bragged, been so lucky in terms of that whole world. It is a dangerous world out there. It scary, like Vietnam. Sort of like the Vietnam-era. It is my personal Vietnam. I feel like a great and very brave soldier.","post_message":"Crooked Hillary Clinton has lied from the beginning regarding her emails, and server. President Obama recently defended Crooked Hillary - saying she did not endanger national security. He also said ISIS was contained last year! Crooked Hillary will NEVER make America great again!"},{"comment_id":"10154664462516337","commenter_b":"Blaming a group of people before you even know the full story = ignorance","commenter_a":"Please bring more Syrian refugees to this country","post_message":"Explosions and IED discoveries continue to rock the northeast."},{"comment_id":"10154306058514062","commenter_b":"Women, always wear pants/skirts that have pockets. if they steal your purse and your gun is in it, you're screwed.","commenter_a":"And that's why I always have the Grim Ripper with me!!!","post_message":"So scary..."},{"comment_id":"10155175533915389","commenter_b":"Looks evil. Tired of the liberal PC bull :poop: that is going to end up killing good people. Maybe if the Terrorist went after liberals only..they wouldn't be in a hurry to let these murders free. Starting with Washington please","commenter_a":"What is this world becoming","post_message":"The United States Department of Justice said a former Al Qaeda operative was released last week from a federal prison prior to completing his 15-year sentence because of “time served.”"}]
