[{"comment_id":"10153275718534726","commenter_b":"Sometimes really rebellious kids need a bad scare, and yes, they should be afraid of cops. It's societies way of dealing with bad people. It's the people that don't fear cops that I worry about.","commenter_a":"good","post_message":"@webpagelink"},{"comment_id":"10153519153652042","commenter_b":"Men go crazy over some pussy..smh","commenter_a":"Men gon wild..smh","post_message":"WANTED: This man allegedly shot the mother of his children twice in her face, police say."},{"comment_id":"10153836514883797","commenter_b":"Why don't young ladies have enough sense to do background checks on these idiots before they shack up with them, have kids with them...","commenter_a":"Omg that's so sad","post_message":"HEARTBREAKING: Cecelia has just moved with her two children from the Detroit area for a better life. But Friday night, her ex-boyfriend used a dog leash to strangle her and her two boys. The last thing she ever said to her mother before her death will break your heart:"},{"comment_id":"10153291115837411","commenter_b":"@username, he pleaded guilty to 4 counts of manslaughter.","commenter_a":"He killed four ppl, But Bobby shmurder still locked up for a gun smh..White supremacy system for ya.","post_message":"Ethan Couch, the so-called \"affluenza\" teen convicted in a fatal 2013 drunken-driving accident who was taken into custody in Mexico, is back in America."},{"comment_id":"10154099227939877","commenter_b":"She's stupid... Dont waste your time.","commenter_a":"If you can't cut your vacation short to do your job as president of the united states you aren't fit for the job.","post_message":"Today President Obama visited the flood-ravaged state of Louisiana, despite critics like Donald Trump who say he came too late. Grio Fam, check out what the President promised he would do to help Louisiana going forward. What do you think his trip accomplished? Sound off!"},{"comment_id":"10154594345964749","commenter_b":"@username leave arab countries ask you governments to stop killing people there . and the immigrants will go back","commenter_a":"I think the comment has to be taken into context... Looking at Hungary's demographics, Muslims don't even account for 0.1% of the population. The politician is probably representative of the general public mood there. Although in a more colourful tone!","post_message":"The Hungarian politician was described as “a sad old man full of hate” and his comment was branded as “disgusting”."},{"comment_id":"1025021754204963","commenter_b":"Will make the perverted staff , horny ?","commenter_a":"Give gun control without rules. Makes a lot of sense. Not. But tell a little girl she can't feel pretty. :(","post_message":"A father bought an adorable dress for his adorable little 5-year-old girl but her school forced her to wear a t-shirt and a pair of jeans because her shoulders were showing and Texas school officials couldn't handle it."}]
