[{"comment_id":"10155829380115354","commenter_b":"Give it up Rubio!","commenter_a":"Of course he did!","post_message":"16 days after Trump gave his speech... why not stick his neck out before the media created this bandwagon?"},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."},{"comment_id":"10154684431129614","commenter_b":"They should both be arrested Alisa Perne. Neither acted like an adult should, that lesson never suck","commenter_a":"He wasn't acting like a man and she wasn't acting like a woman. He had no right to hit, but she kept provoking still not right. He could of called the police or walked away..both at fault, but he hit so physical violence on his part.","post_message":"Police are searching for a man seen punching a woman in the face in a disturbing surveillance video taken outside a store in Venice over the weekend. The victim apparently had seen the man at a festival in the city on Sunday but does not know him. The two bumped into each other again at the store and got into an argument before the man punched her. Bystanders tried to stop the man but he managed to escape and ran away from the scene. read KTLA's story here: @webpagelink"},{"comment_id":"485867691579702","commenter_b":"Sad to say but our state has that stupid caucus! Thanks to our friend Reid!","commenter_a":"Amen @username!","post_message":"Greetings from Ben Carson High School."},{"comment_id":"511461792370480","commenter_b":"The bitch will do as she always does: LIE, and the Establishment will protect her and not have an indictment. It's sad the way this country would rather have a corrupt person with a rap sheet longer than her arm, get away with everything she and Willie have done. Anyone: Google \"Clinton Chronicles\".","commenter_a":"Moot point... Hillary will get crushed by the FBI.","post_message":"Donald Trump says he would crush Hillary Clinton in a general election. Do you think he's right?"},{"comment_id":"10152821539741051","commenter_b":"who teaches bulling in school better than teachers?there are people out there that have no business interacting with young people at all. she should be put in the stocks, in school, let her feel what he felt. sue them all back to rubble","commenter_a":"Unbelievable, how could this type of bulling be tolerated? That school needs new policy's.","post_message":"When this woman found out that her grandson had been publicly punished like this, she couldn't believe it."},{"comment_id":"10153633951734170","commenter_b":"They are undocumented aliens.","commenter_a":"I find the term \"undocumented immigrant\" offensive. The press should stop using it.","post_message":"Epic VIDEO. Trump slams the proverbial door on a reporter who warns him that the term \"Anchor Baby\" could hurt someone's widdle feewings."}]
