[{"comment_id":"10153888700337464","commenter_b":"You gotta get all the brainless and illegals to stop voting democrats, its the democrats that arm criminals but prevent legal law abiding people to legaly arm themselves","commenter_a":"What happened to carson?","post_message":"Justice Scalia’s passing tonight underscores the stakes of this election. Voters must determine who on this stage has the judgement to nominate and confirm principled constitutionalists to the court."},{"comment_id":"1370953329605967","commenter_b":"She can start any day....","commenter_a":"@username maybe Jerry will do this to Eddie someday soon. 😐","post_message":"The only thing that can calm this grumpy toddler is her love for her baby sister: @webpagelink"},{"comment_id":"10153114063969091","commenter_b":"Why wouldn't they? Everyone is scared to stand up for something. Sodomites wont be around my kids cause they're not gonna be in the scouts.","commenter_a":"Just close the organization down no one is going to send There kids with the Boy Scout leader who is gay, it's another thing to gay people have screwed up","post_message":"BREAKING NEWS: Boy Scouts expected to announce that it will allow openly gay adult leaders."},{"comment_id":"10153759489753812","commenter_b":"How do you know? One year of college did not teach you much","commenter_a":"Creationist heads explode...","post_message":"Researchers in South Africa believe they may have uncovered a brand new “relative” to humans, and they have named the new branch of the family tree Homo naledi.@webpagelink"},{"comment_id":"1370415506308495","commenter_b":"I believe you have that backward.","commenter_a":"They are Demon-crats. Get it right you dirty rat!","post_message":"An activist joins thousands of Bernie Sanders supporters who are demonstrating ahead of the Democratic National Convention in Philadelphia."},{"comment_id":"10154497779774166","commenter_b":"My son. 3 at the time but 6 now, snuck out at 8am to play in the yard and went through child proof knob, door lock and deadbolt. And i was arrested and given a felony for child neglect... Judge here raised voice at me when i told her kids arent dumb. That mine is super smart. And sent me to jail/: now my ptsd is so bad i barely sleep since the day. Because im afraid he'll sneak out again.","commenter_a":"Was he pulled over for \"drunken milk driving\"? LOL! On the serious side, glad he was okay! My children were escape artists when they were younger. Have a toddler now and with having her older siblings around, she doesn't attempt anything like this. She's opened the front door before, but never left the apartment. We used alarms on the front door. Working third shift and having a toddler is hard LOL! But during the week she's at daycare so no worries there... Just worry on weekends when they're home with me.","post_message":"Deputies say the child was found driving down the road wearing only jogging pants and a diaper around 1:55 a.m. Sunday."},{"comment_id":"937893629592518","commenter_b":"men especially infantry like women.. all i can see this now is rape allegations and pregnancy going UP, that and men are biologically inclined to put a women's life first. thus taking away from the mission at hand.","commenter_a":"@username @username intentionally weakening our ground forces. Not because women can't hack it (most can't) but because they will be a distraction for the males and a logistical nightmare.","post_message":"#BREAKING: In a historic decision, the U.S. Secretary of Defense has ordered all military combat positions to be opened to women. STORY: @webpagelink"}]
