[{"comment_id":"10153699809290496","commenter_b":"Haha their wives might...lol","commenter_a":"As long as they bring home the gold, who cares??","post_message":"Three members of Team USA basketball reportedly ended up in a high-end brothel, but it was an apparent misunderstanding: @webpagelink"},{"comment_id":"10153877840551337","commenter_b":"I always hated rousey I'm glad her ass got knock the fuck out","commenter_a":"Truth is holly Holm is a real fighter n Dana white thought he picked another easy girl for Ronda to destroy well plan back fired ,Holm is a real fighter and real champion now let's see her n cyborg fight two top fighters Rousey is finished","post_message":"DAMN: Holly Holm didn't hold back with these comments about Ronda Rousey."},{"comment_id":"536032629890369","commenter_b":"suck a dick","commenter_a":"@username du o daniel","post_message":"Piper the abandoned pig has a new home and a new best mate (via The Dodo)"},{"comment_id":"10153535338020779","commenter_b":"@username Britney is better","commenter_a":"For anybody who has been to shows like Springsteen , Pearl Jam, Metallica, Pink Floyd, it's mind numbing watching Popular music in 2016.","post_message":"Britney Spears opened the #BBMAs with a career-spanning medley of her hits. Watch below."},{"comment_id":"1237296066293181","commenter_b":"Stupid Hoe","commenter_a":"I think she is mad talented but until she stops dressing like a skank and humping everything from the air to the ground to the men in her music videos, the attention she gets will not be based off her amazing talent but on her sexuality. Becuase I think she is so talented I have watched many of her videos looking more for talent than her soft core porno ways and found that only a handful of her videos showcase her talent and not her ASSets. Soooo I mean, do something else girl cuz that talent is off the hook.","post_message":"There's a tendency to read Minaj solely through her sexuality."},{"comment_id":"756504414454641","commenter_b":"Ridiculous. Keep them out at all costs","commenter_a":"I'll sell them to them","post_message":"One company that produces razor wire actually turned down a contract with the Hungarian government that would have brought them over a half-million Euros in revenue."},{"comment_id":"10153438703061130","commenter_b":"A FEMINIST is for EVERYONE.","commenter_a":"this woman is a complete poser. she does not stand with all women. just ask conservative women orgs","post_message":"\"Saying something is almost always better than swallowing it and then thinking about it for two days.\""}]
