[{"comment_id":"690670874378549","commenter_b":"God I know! All those gay people marrying will turn back straight! Let's hope this works!","commenter_a":"It will take years to undo all the harm that is being done now. We have laws that we should respect and stand by.","post_message":"Even though the Supreme Court made clear in United States v. Windsor that the federal government should defer to state \"choices about who may be married,\" the Obama Administration has disregarded state marriage laws enacted by democratically-elected legislatures to uphold traditional marriage. I support traditional marriage and we should reject attempts by the Obama Administration to force same-sex marriage on all 50 states. The State Marriage Defense Act helps safeguard the ability of states to preserve traditional marriage for their citizens."},{"comment_id":"10154011637299062","commenter_b":"Either way she is screwed...hopefully they catch these horrific criminals soon!","commenter_a":"Hmmmm wonder if they plan to murder her now?","post_message":"She \"allegedly intended to be the men's getaway driver but got cold feet and failed to show up at a rendezvous point.\""},{"comment_id":"10153574681028010","commenter_b":"To bad DHS doesn't enforce our laws...she should be returned with millions more just like her.","commenter_a":"Go back then.","post_message":"“I thought I came to this country to escape abuse, mistreatment and disrespect. But it's the same here.”"},{"comment_id":"10153200362991943","commenter_b":"Cause she's sn idiot","commenter_a":"obama and his ilk will kill us long before the climate.","post_message":"Why is Obama EPA administrator, Gina McCarthy trying to scare Americans into believing \"Climate Change\" could kill them?"},{"comment_id":"1580252788658041","commenter_b":"PLEASE STOP POSTING WITH THIS DESPICABLE WOMAN. ENOUGH TORTURE ALREADY.!","commenter_a":"Shes wacked","post_message":"Conway says she is more “amused” than “worried” over the fact that none of the top notch schools in Washington want to accept her children."},{"comment_id":"10154078774989877","commenter_b":"Besides reproduction and parts which aren't anyone's business, nothing in these comments state what makes a woman a woman.","commenter_a":"We should all be okay with this. Two words: Fairness and equality.","post_message":"Spelman College to consider admitting transgender women Grio fam, is it time HBCU's updated their views on gender identity? Sound off below!"},{"comment_id":"10153040559681130","commenter_b":"Religion, Kartrashians, J.Lopez, M.Cyrus, and their ilk. Male dicktators ruling./ruining countries...","commenter_a":"I want to see a world without religion or Kardashians.","post_message":"Do you want to see a world without elephants, rhinos or gorillas?"}]
