[{"comment_id":"460337480823499","commenter_b":"No if they do then the native Americans should be first in line. The USA did not enslave the Blacks they where sold to plantations she them","commenter_a":"No","post_message":"Should Blacks Be Compensated For Slavery? Comment 'yes' or 'no'."},{"comment_id":"930468930346189","commenter_b":"It's an interesting idea but she is much older. Re pose these with young girls and I guess there would be little difference.","commenter_a":"Stop making stupid people famous","post_message":"Fashion ads recreated by a normal woman"},{"comment_id":"1298830980155135","commenter_b":"No wonder we are in the decline we find in our country...these people obviously do not want to deal with reality and make excuses.","commenter_a":"The indoctrination of the Sheeple.","post_message":"When asked about the Ohio State University terrorist attack that took place on Monday, the students just could not bring themselves to be honest."},{"comment_id":"1194913097195385","commenter_b":"shame on you that is racist and you being irish you would under stand that do not be like that sarah","commenter_a":"I know his brother Mr Poopoo !","post_message":"Chinese officials detained Ai Weiwei for 81 days and seized his travel documents in 2011, charging him with tax evasion, an accusation he has long denied."},{"comment_id":"1038718286244949","commenter_b":"If you vote democrat you do not think much of your country? Do not ever forget BENGHAZI","commenter_a":"They are a bunch of lowlife communist wanting to destroy the country from the Left wing.","post_message":"ClashDaily.com"},{"comment_id":"761137067410204","commenter_b":"Good decision by the judge. This entitled brat needs to make better decisions.","commenter_a":"Just another teenage girl who never got proper parental guidance because the parents were too wrapped up in themselves.","post_message":"Outrage After Judge Orders Bristol Palin To Do THIS With Her Breast Milk This is just ridiculous. A mother should not be subjected to this. Do you agree or disagree with the judge?"},{"comment_id":"10155021097508812","commenter_b":"Blonde idiot.","commenter_a":"I felt like the Eagle being trapped in the drain was significantly similar to how our country was going down the drain after Trump was elected. And now the Eagle has died...another significant likeness to our country's future...","post_message":"Sad update: Bald eagle rescued after being trapped in a Florida storm drain has died, Audubon Center for Birds of Prey says. @webpagelink"}]
