[{"comment_id":"10153231447637217","commenter_b":"But if she was an alcoholic, it would be okay","commenter_a":"...and yet we allow 16 year olds and younger to raise children because 'if you do the crime, do the time' BUT HEAVEN FORBID THAT YOU SMOKE MARIJUANA","post_message":"Sindy Melany Ortiz says a hospital is restricting her access to her newborn daughter because she smoked marijuana."},{"comment_id":"952760784783670","commenter_b":"She is a sad excuse. Why do we care what she says. Why do we care she breathes. Waste of space.","commenter_a":"I've seen prettier horses","post_message":"How much lower can Katie Hopkins go?"},{"comment_id":"1839638869615346","commenter_b":"What progress? Isis? Health care costs through the roof? Men hanging out in women's bathrooms? Haiti? Russia ready to attack us? Drawimg a line in the sand? Most terror attacks on US ground ever? The disasterous Common Core? Highest poverty rate with people on welfare..ever!? Even democrats admit it!","commenter_a":"God forbid the president campaigns to protect everything he has accomplished. He doesn't need an idiot like you who would be a bull in a China shop destroying all of the progress that has been made.","post_message":"\"They're losers. They're babies. We have a president-- all he wants to do is campaign,\" Donald J. Trump said of President Obama @webpagelink"},{"comment_id":"1242326225802834","commenter_b":"There are many exceptions to this, these comics are just to stir shit up, and promote dissatisfaction, imo. Live your life to the fullest and stop getting offended so much. It's not worth it, spending your life on this planet worried about what some shithead says or thinks about you.","commenter_a":"Hey ATTN, did you know there is a mass extinction going on globally? Maybe your perceptions of gender roles can take a back seat and you can do something more useful with your time.","post_message":"The double standard is all too real."},{"comment_id":"10156695454475206","commenter_b":"Yes lol, but I'm also a full time college student and have been waitressing for three years.","commenter_a":"Carly, I wasn't sure who had my vote until tonight's debate, that being said #fiorina2016","post_message":"Hillary wants to be the first woman president—but every single one of her policies have been bad for women and bad for America. If you want a leader who will fight for all Americans, chip in $3 to get Carly in the White House. @webpagelink"},{"comment_id":"1496723690352634","commenter_b":"@username he must have grabbed you by the pussy.","commenter_a":"Same day, taken moments earlier before the rain actually stopped.... Trump holding the umbrella for her, meanwhile Obama has someone else holding it.... just saying maybe look into it before looking so biased","post_message":"See the difference?"},{"comment_id":"10154248904966337","commenter_b":"You ladies are making me think I'm being an asshole for the right reasons","commenter_a":"Stop this goddamn decimation of his character. Millions of us live with chronic pain every day.. Even if he was on painkillers so fucking what. Even if he possibly overdosed, it doesn't fucking matter. He was still a prodigy a musical genius. These post mortem aqusations are nothing more that cheep attempts at gathering attention for your shitty fucking attempts at journalism, and you should be fucking ashamed at your lack of talent and mortality... Fuck you","post_message":"OH NO: New details emerge regarding the death of #Prince."}]
