[{"comment_id":"10154268994748822","commenter_b":"Assclown fool","commenter_a":"I'm so proud to have this man as my governor and I'm ashamed of the Pennsylvanians (some of whom are commenting here) who are racists and religious bigots. Thank you Governor Wolf for representing ALL Pennsylvanians (even the ignorant ones) and for protecting our children!","post_message":"NEW: Gov. Tom Wolf's administration released a response plan after recent incidents involving racism and religious intolerance in Pennsylvania schools."},{"comment_id":"10153657891231336","commenter_b":"Stupid old woman","commenter_a":"Keep her in jail until she resigns or issues marriage licenses!","post_message":"Kim Davis will be in jail at least a week, but she could stay longer if she continues to not obey the judge's order."},{"comment_id":"1470713222988421","commenter_b":"Typical British woman. No morals, no values.","commenter_a":"Is this worthy of a news item? I think not.","post_message":"She text him the picture weeks later after not seeing him again"},{"comment_id":"1708950036028896","commenter_b":"@username I have a problem with Mexicans coming back even after the wall is built. What they did to this country is almost irreparable damage, it's overwhelming, and the amount of people they killed is staggering. You NEVER read about an American killing a Mexican. But you do read the opposite. You can't take the illegal out of an illegal. They will always be a dark cloud of problems to any society they get it. They can't change, they're programmed that way. They will bring virus' disease and plunder. Even the ones running their country a derelicts of the 3rd kind, their intent is to make America part of Mexico, that's why they send them, that's why they don't assimilate and want YOU- (Americans to assimilate) ...(google \"The RECONQUISTA / Mexicans say they will take America without firing a single shot\")..this is why Vinente Fox and Jorge Ramos are trying ...","commenter_a":"The role of our government is to keep its citizens safe.....sadly they are failing \"A house with no walls will collapse\"","post_message":"“This is something that’s happening almost on a daily basis now, that we have illegal immigrant criminals that are committing murder or rape or numerous child predator type actions.” – Steve Ronnebeck"},{"comment_id":"10154090805807869","commenter_b":"She deserves nothing!","commenter_a":"My friend said Hillary has worked her entire life to be president, so she deserves it. Working to further ones career whilst providing no service, accomplishing nothing, and harming others is exactly who I don't want.","post_message":""},{"comment_id":"10156358767360354","commenter_b":"Fuck that bitch and his man wife","commenter_a":"So sick of this repulsive little sob, 14 more months of the bastard, damn.","post_message":"“We’re going to be aggressive…”"},{"comment_id":"498036517054013","commenter_b":"if they have all that money they should go back wehre they came from","commenter_a":"Do not cave in. Do not sell any land to them. Be careful who you sell to that that buyer does not plan to re- sell to them. It is not unreasonable to consider that it is a possibility.","post_message":"STAND YOUR GROUND! Muslim are IRATE that Small Town Colorado Christians Won Sell Them Property to Build a Mosque! Show your support for these Americans who said HELL NO! NOT IN MY BACKYARD!"}]
