[{"comment_id":"467441413380453","commenter_b":"I've got a great idea! Let's send all the illegals to Italy! Who agrees with me?","commenter_a":"NO!!!Go home and support your own People!","post_message":"A five-year-old hands Pope Francis a letter asking him for help in preventing her parents from being deported. The Pope is calling for Christian support for all immigrants, both legal and illegal. Do you agree?"},{"comment_id":"10154301833998487","commenter_b":"The onus should be on the Jewish men: if they believe that women should not be swimming with them, then the men will just have to find someplace to swim.","commenter_a":"No. Your religion is your problem. If the pool wants to allow certain groups, including religious groups, to reserve the pool for certain blocks of time (like a water fitness class), that would be okay.","post_message":"Should city pools accommodate women whose religious beliefs forbid them to swim in front of men?"},{"comment_id":"10152977510376130","commenter_b":"Shut up meg","commenter_a":"I know what the show is about!!","post_message":""},{"comment_id":"910291425675761","commenter_b":"Throw her out of the white house.","commenter_a":"let the book burnings begin..then kristellnacht...then relocation camps","post_message":"Are you at all surprised by this?"},{"comment_id":"1607924772836368","commenter_b":"Yes young lady you can , just don't lie to the FBI , don't help rapist do 10 months for raping a 12 year old, don't stay with a man who had many affairs. There Are many women who can be great presidents , Hillary just isn't one.","commenter_a":"Not if you win Hillary! I fear that your election might irrevocably tarnish the idea of female presidency... Bear in mind of course, that we have to deal with a reality where people automatically stereotype and generalise...","post_message":""},{"comment_id":"10153467458013984","commenter_b":"Sick of hearing about Bruce and the damn Diggers","commenter_a":"enough of this crap...give it a rest","post_message":"If what Rush Limbaugh says is true, this whole Jenner thing could be just the tip of the iceberg. Scary... Do you think the liberal media has an agenda in pushing the Jenner story?"},{"comment_id":"10153163452101770","commenter_b":"sick thugs","commenter_a":"Good! Time to show respect..","post_message":"Two students who attend a public high school in small-town Tennessee are reportedly spending the first weekend in December in jail because they wore saggy pants to school one too many times."}]
