[{"comment_id":"10154004343429440","commenter_b":"@username and if you call me sweetheart again, I will find you and feed you your balls. \"Figuratively\"","commenter_a":"Trump has the worst politfact record of any candidate for president ever. Hillary is among the best. Making all of your reports 50-50 so you don't have to listen to Republican whining distorts the truth","post_message":"Denver Post Politics takes a look at how Hillary's statements stack up to the facts."},{"comment_id":"10153184324863984","commenter_b":"One dumb ugly bitch","commenter_a":"Dislike this skag.........","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10152986192691491","commenter_b":"You're an odd little woman","commenter_a":"Malala is big drama queen , thousand of girl are raped and kill no body knows why malal","post_message":"Malala gunmen secretly set free in Pakistan @webpagelink"},{"comment_id":"10154083249768984","commenter_b":"you bitch you took away something that is all American and turned it into a race baiter bunch of bullshit you and jazeeee suck please move","commenter_a":"behind the sheriffs all the way! DISGUSTING, RACIST, C!","post_message":"When these sheriffs saw what Beyonce was doing in front of the biggest TV audience of the year, they knew there was only one thing they could do... Do you support these sheriffs?"},{"comment_id":"1209227002477386","commenter_b":"Dumb ass bitch","commenter_a":"I feel bad if they were black but if they're white I don't give a fuck because they never care bout us dying","post_message":"#WSHH #Iowa #Police #BreakingNews"},{"comment_id":"1864825540399867","commenter_b":"A few years prior: \"did you see the her sleeveless dress?! THE FIRST LADY HAS NO CLASS!\"","commenter_a":"I'll never get over our \"president\" saying he grabs women by the pussies and his supporters just shrugging their shoulders over it","post_message":"Here are five reasons why Trump is the opposite of a Christian. Special thanks to Cindi Brady. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154666136846833","commenter_b":"I'm thankful there isn't enough police to stop all crime! Because then we would be living in a police state!","commenter_a":"There is one more Woman who Had a gun to protect her Family, but a lot of Americans who will never be Able to protect there Family's for not owning a Gun. They live in a elusion of Safety that the Police have enough manpower to Protect them. Unfortunate there will never be enough Law enforce Officers to protect everyone. It is up to you to Protect yourself as much as possible.","post_message":"If three intruders break into your home and hold your spouse at gunpoint, what would you do? This Florida woman was faced with that dire scenario last week. Thankfully, she was able to run to the bedroom and grab her own firearm to end the ordeal and save her husband."}]
