[{"comment_id":"945496635572234","commenter_b":"She is selling us out to the Arabians","commenter_a":"Butcher of Benghazi","post_message":"WATCH LIVE: Hillary Clinton addresses a crowd in Miami to talk Zika virus"},{"comment_id":"444684015719892","commenter_b":"killing over a pizza.. one less tax payer.. those black thugs aren't too worried about their welfare checks these days","commenter_a":"They need to be stabbed to see how it feels than shoot","post_message":"Where are the rioters?"},{"comment_id":"1136461496426173","commenter_b":"She should be tried for treason","commenter_a":"Smart & Tough!","post_message":"Crooked Hillary Clinton wants to flood our country with Syrian immigrants that we know little or nothing about. The danger is massive. NO!"},{"comment_id":"10154331830756028","commenter_b":"They both need to be put in population in prison and let be what needs to be done to these two monsters they didn't protect that beautiful innocent baby","commenter_a":"I am beyond sickened by this....death penalty.....","post_message":"In the days before her death, little Leah Brown-Meza suffered multiple injuries to her head, a broken arm and a second-degree burn to the bottom of her foot. Her mother and her mother's boyfriend sat in blue jail uniforms as they listened to the evidence presented against them in court. @webpagelink"},{"comment_id":"10153712165499138","commenter_b":"I'm not a hunter, however, anyone who eats meat has no right to be against hunting your own meat. At least the animals being hunted have a chance and have a good life in the wild. Anyone who eats grocery store meat should try going to the farm that the meat came from, those animals have it far worse than a dear dying from a quick shot.","commenter_a":"Stop this hunting that's what he gets","post_message":"A reminder worth sharing. Have a safe hunting season."},{"comment_id":"392884667560081","commenter_b":"Bitch!","commenter_a":"He certainly does, and the GOP deserves a kick in the ass!","post_message":"President Obama deserves a HUGE thank you!"},{"comment_id":"1793816267524585","commenter_b":"Amy you should be ashamed for trying to get people to vote for that criminal!!! The things she's going to do to our country aren't going to effect you because you have money !!!","commenter_a":"I'd be much more concerned if I voted for someone who was indited and convicted of high crimes against the United States and humanity!","post_message":"\"Your voting history is public record.\""}]
