[{"comment_id":"10155037130139369","commenter_b":"Sucker","commenter_a":"I'm 51 now and have paid into social security since my first job at 15 years old. I want MY money! Let them try and take our money. They'll have a revolution on their hands!","post_message":"That's $32,000,000,000,000."},{"comment_id":"1209908089068937","commenter_b":"Stay strong","commenter_a":"Wow what nasty humans out there!!! Thank you so much to those of you that have some understanding of what I went through..","post_message":"A truly incredible transformation (Via Daily Mail Australia)"},{"comment_id":"10154939052379218","commenter_b":"@username grammar Nazi feeling smug over a typo.","commenter_a":"But hey remember Love Trumps Hate lmfao libtards and there hypocritical ways","post_message":"Police say a teen wearing a cap with a Donald Trump campaign slogan was beaten and kicked as hundreds of students staged a walk-out to protest Trump's election."},{"comment_id":"801914353278362","commenter_b":"Trump will crush this fat ugly lying lady","commenter_a":"Love how the little girl scout is pointing out the cookies to you. Rock on Hillary -supporting you in Colorado. Ignore the haters inWV","post_message":"Cookie stop in Kentucky. Picked up some tagalongs and samoas before heading across the border to West Virginia."},{"comment_id":"637787356403576","commenter_b":"She's a psychopath","commenter_a":"She's correct. We're living in an era when a significant number of Americans simply refuse to acknowedge facts, or even the existence of facts. It's the populist wave.","post_message":"Hillary Clinton: \"It's now clear that so-called fake news can have real world consequences.\""},{"comment_id":"1082059028539299","commenter_b":"And whites don't hey dumbass All lives matter you would know that if you stayed in school 😬","commenter_a":"Because Black LIES Matter to those thugs.","post_message":"It's no surprise that the people at Black Lives Matter aren't exactly known for their ability to stick to the facts. However, this new data about black \"victims\" absolutely DEMOLISHES their whole agenda. I guarantee the media doesn't report on this... let's spread this everywhere."},{"comment_id":"10153687088042235","commenter_b":"Quit giving him attention...if you quit he will kill himself sooner.","commenter_a":"Georgie got a death wish.","post_message":"Seriously. F this douchebag."}]
