[{"comment_id":"1260055474038645","commenter_b":"Wonder who will pay her and the teachers salaries, and provide security and law enforcement if all the \"white people\" leave","commenter_a":"Have you seen it ? They can have it.","post_message":"Chicago Teachers Union Karen Lewis This City belongs” To Black People And Not White People."},{"comment_id":"559309340924025","commenter_b":"Get her fellow","commenter_a":"Lying is her number one forte","post_message":"SHARE to STAND with this NAVY SEAL!"},{"comment_id":"10154598591011756","commenter_b":"Ooh never heard that one...sweet","commenter_a":"Yes, I'm sure the Trump children know all about working. What's that saying? Born on third and think they hit a triple.","post_message":"The theme of day two of the Republican National Convention is \"Make America Work Again,\" with speakers ranging from House Speaker Paul Ryan to Tiffany Trump and Donald Trump Jr."},{"comment_id":"888007527972526","commenter_b":"Send em to their mother land","commenter_a":"Why then are they even here? Get the hell out of this country","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays Lets get 3000 SHARES if we should deport them!"},{"comment_id":"870966692926187","commenter_b":"GIRL BYE","commenter_a":"I don't blame her for not wanting to call him. She hasn't spoken to him for a reason. Probably the same reason why Lisa Bonet and God knows how many other members from the cast have not! She should not have been fired for that.","post_message":"Keisha Knight Pulliam Fired From Celebrity Apprentice For Not Contacting Bill Cosby For Fundraiser @webpagelink"},{"comment_id":"932144616915891","commenter_b":"Kill em thier lives don't matter they are scum","commenter_a":"I'm with @username not about race but individuals robbing with guns . Really is that anyone can see? Not criminal activity. Because this is a crime.","post_message":"He's got a package and a uniform, but he's no delivery guy. Once you open the door, his gun-toting crew moves in for the robbery. Now police are warning about the slick new holiday scam. The dangerous delivery - @webpagelink"},{"comment_id":"1414587195226950","commenter_b":"2 all the women in pink why not just pack up ur pink panties and move 2 Cuba now that we have relations again I hear it's a paradise.","commenter_a":"GROW UP","post_message":"Female supporters of President Donald Trump aren’t sure why the Women’s March was necessary."}]
