[{"comment_id":"822359307886042","commenter_b":"It was meant for this baby to live","commenter_a":"God directed that Officer to the area. He is Hero","post_message":"A newborn girl thought to be only 36 to 48 hours old was found alive in Compton on Friday. The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed. Detectives are now asking anyone with information to come forward. this post to alert others. Read KTLA story here: @webpagelink"},{"comment_id":"10154503562599138","commenter_b":"Dawn breaking over Lake Pepin Lake City, MN 6/9/16","commenter_a":"Watching the sunrise everyday on my way to work","post_message":"It's a call for pictures showing what you love about Minnesota. Show us animals, people and moments that show off what's so great about our state and we'll feature some on the Fox 9 morning news!"},{"comment_id":"10153161330059270","commenter_b":"Women shouldn't be allowed in the special forces. Period","commenter_a":"No surprise.","post_message":"No women pass Army Ranger School."},{"comment_id":"10153571133258132","commenter_b":"Shut up Tina","commenter_a":"Regardless of what this family would've, could've, should've said...90% of you made your judgement the second you heard \"the news\". Until it happens in our own family, none of us have the right to judge. Just as I don't have the right to judge all of you with your incredibly hateful comments. So I won't.","post_message":" watched him like all the time. I took him to work with me. We just poured our life into him.\""},{"comment_id":"10155011219571729","commenter_b":"She can't... And she doesn't plan on it either!!","commenter_a":"do not trust her to protect us.","post_message":""},{"comment_id":"1039779686062503","commenter_b":"Oh dear Lord! Yet you can have these so called \"Barbies\" walk around nude and no brains or respect for themselves or anyone else! They rob good hearted men and steal their hearts and yet this shyt is okay?","commenter_a":"People need to mind their own business if no one is getting hurt","post_message":"Is any place safe for moms anymore?"},{"comment_id":"10155013534653734","commenter_b":"There are many veterans that need work. Why not offer them a job?","commenter_a":"Just make sure they got their paperwork together since you made a public announcement.","post_message":"Starbucks Chairman and CEO Howard Schultz announced the move after President Donald Trump's travel ban that applies to Syrian refugees and six Muslim nations."}]
