[{"comment_id":"10153238484143984","commenter_b":"Screw the bitch and her lying ass husband.","commenter_a":"Move out bitch","post_message":"People are furious, and I can understand why. Do you think Michelle is an out of touch First Lady?"},{"comment_id":"10154092035258352","commenter_b":"NASTY ANIMAL.","commenter_a":"Just gross","post_message":"Dairy Queen worker who 'has herpes' arrested for 'spitting on officer's burger'"},{"comment_id":"1411220458918808","commenter_b":"I honestly think you just don't understand because you have never been through it. Hopefully you never will. It's a tough road as a parent. But My SON JASON is the love of my life!","commenter_a":"why do people with autistic children often talk about \"mourning the death of the child they thought they had\"?? its the same kid. we're not car accidents to be grieved over. we are people.","post_message":"Greg and Maya are doing everything they can to make sure their son with autism is safe, comfortable, and — most of all — happy. Parenting 2.0 | An Upworthy Original Series"},{"comment_id":"1377095295664272","commenter_b":"And she will WIN !","commenter_a":"killery is an ass...panders to any voter cause","post_message":"Clinton isn’t letting this bigotry go unnoticed."},{"comment_id":"581181075381182","commenter_b":"@username Many are 'insured' but access to care is more expensive than ever when you add copay, deductible, out of pocket, and actual cost of premium. These \"facts\" are manipulated to make the ACA look \"good\". In reality it is a tax, as defined by our own government.","commenter_a":"\"We’re forcing the president to confront the failures of this law once and for all\" - Speaker Paul Ryan","post_message":"Republicans in Congress used reconciliation to be able to get the Restoring Americans' Healthcare Freedom Reconciliation Act to the president."},{"comment_id":"955856331137563","commenter_b":"Based on what I've seen it's because they are ugly and no man will take care of them.","commenter_a":"Why are liberal women unable to take care of themselves? Why must the liberal women depend on government for everything?","post_message":"To Jeb Bush and Republicans who don't think women's health should be a priority: You couldn't be more wrong."},{"comment_id":"10153570996910329","commenter_b":"*high five* you guys are awesome! :D","commenter_a":"I'm a proud Christian and I'm ecstatic about this. I'm not even gay. Or American.","post_message":""}]
