[{"comment_id":"10152720268826636","commenter_b":"Sweet name bro","commenter_a":"Old people are more of a danger than teenagers.","post_message":"Why you should always keep your eyes on the road."},{"comment_id":"10154743661575470","commenter_b":"@username (Psst. She means white.)","commenter_a":"Finally a decent president out with the trash in with the class","post_message":"INAUGURAL PARADE: Watch President Donald J. Trump take part in the ceremonial parade."},{"comment_id":"1798977096981448","commenter_b":"What stupid woman do you think orange head is going to grab your thing and you're so happy","commenter_a":"No I believe Clinton was way worse then Tump with rape and the White House incident-- really!","post_message":"SHARE THIS and FOLLOW US at Reverb Press and Stories That Resonate <<<"},{"comment_id":"1541922275848239","commenter_b":"What a stupid bitch. Only in Amerika can someone that vapid be taken seriously.","commenter_a":"NUT JOB ???","post_message":"Kellyanne Conway is a complete hypocrite who has no soul and CNN host Jake Tapper proved it."},{"comment_id":"1263026913766051","commenter_b":"You lady are a idiot","commenter_a":"That's the problem. You all look to Facebook for your answers instead of doing your own research and being free thinkers.","post_message":"This is the video we've all been waiting for. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"949558251844940","commenter_b":"All them women on the house wives shows","commenter_a":"@username Giselle Relleta","post_message":"Are you wearing dead animals on your EYELASHES?"},{"comment_id":"585837851590068","commenter_b":"Unlike Hillary taking the china!","commenter_a":"No matter your political views, Mrs. Reagan always showed great class and dignity to the Whitehouse. The love for her husband was extraordinary. May you rest in peace.","post_message":"Nancy Reagan died this morning of congestive heart failure at the age of 94. She will be buried at the Ronald Reagan Presidential Library in Simi Valley, California, next to her husband. @webpagelink"}]
