[{"comment_id":"10153463881442235","commenter_b":"Wow @username aren't you just a little dick. I bet you work at fux news you pathetic bitch","commenter_a":"This report was completely one sided. Where were the interviews of white people who are homeless. Bill you just showed your true colors. If this report is not racist i don't know what is. O'REILLY can kiss the center of my ass.","post_message":"This could be the most despicable, manipulative report Fox News has ever produced ..."},{"comment_id":"886812858022722","commenter_b":"Yea she looked so approachable at Chipotle! Fraudster.","commenter_a":"She is listening to what? She is too busy nodding her head all the time, so disingenuous. Listening?","post_message":"\"I want people to know I’m listening and I’m accessible...\""},{"comment_id":"453687788168068","commenter_b":"The 2ND Amendment was created to stop future Politicians after 1789 From EVER disarming the American POPULACE, It was a RULE OVER The FEDERAL GOVERNMENT to Say Congress the courts and the President Could Not EVER! Make a Law to CURTAIL the AMERICAN PEOPLE FROM OWNING AND USING FIRERARMS, THE GOD GIVEN RIGHT OF THE PEOPLE TO KEEP AND BEAR ARMS, wait for it SHALL NOT!!! BE!! INFRINGED , THAT MEANS NO FIREARMS RESTRICTIONS, TO MY GOVERNMENT THAT MEANS YOU SHALL NOT PERIOD!. END OF DISCUSSION. NEXT GRIPE, SERVANTS OF WE THE PEOPLE.","commenter_a":"Seeing that his commands are what the fighting & killings are all about, it sounds about right, & if you believe that you will believe anything.","post_message":"Why Owning a Firearm is Not Just a Constitutional Right but a God-Given One!"},{"comment_id":"1574139022896040","commenter_b":"Put this animal to death!","commenter_a":"Yeah, good luck with that.","post_message":"The Attorney General is required by ethics regulations to avoid even the \"appearance\" of a conflict of interest. She has clearly violated this regulation. SIGN THE PETITION to join us in demanding her resignation."},{"comment_id":"408303332684881","commenter_b":"Maxine, you don't know much do you. The minorities already have the right to vote. Sorry if they won't let you count the votes that some people made with the names of dead people. Illegal aliens don't have the right to vote, because they are not citizens of the USA.","commenter_a":"As long as the current conservative, sorry ass Republicans are controlling both the House and Senate, there will never be a vote on a new Voting Rights bill!!!:( They are against anything good for minorities, women, seniors, and the working class.","post_message":"On this day in 1965 President Johnson gave his Voting Rights Act Address to Congress. Today, we should DEMAND Congress pass a new Voting Rights Act. Sign this petition if you agree."},{"comment_id":"10153881231351800","commenter_b":"Rubio is for granting amnesty for all these illeagals. Sorry we don't need rubio or his muslim immigrants.","commenter_a":"I would much rather see Rubio get the nomination instead of Chump Trump or Crazy Cruz...they are both psychos.","post_message":"Marco Rubio claims he's a GOP underdog because of his fancy boots, but Trevor thinks it might be something else. @webpagelink"},{"comment_id":"10153060785906519","commenter_b":"Hillary covered up for him all those years in AR because she knew he was going to be president. The wives of predators who cover up for them are almost as guilty as the offender. She only cares about one thing...power.","commenter_a":"Y'all still talking about Clinton and consensual sex. Oh I get it Hillary's running, so y'all need to bring that up again. Never mind that it isn't relevant! Or are we blaming Hillary for a spouse that strays?","post_message":"\"The actual facts of the matter are that Bill Clinton was a serial abuser of working-class women–he had exploited that power differential even in Arkansas...\""}]
