[{"comment_id":"1026033040752819","commenter_b":"And all those boobs in a row on display.","commenter_a":"I feel like the word \"leggy\" came up a lot in this article. As if the author was sorta fixated on this one thing about the girls who tormented her and swift in particular in a sorta Freudian way. Like, \"The evil reign of Taylor Swift, with her forever legs, way too long to be street-legal, stretching between pencil skirts and slightly worn Converse, glossy in the pink-frosted Malibu dusk... Um, I mean, hen culture and mean girls and stuff.\" I don't necessarily disagree with what she's saying, but she is really, really aware of Taylor Swift's legs.","post_message":"If T Swift and her squad rub you the wrong way, you're not alone. Here's why."},{"comment_id":"10153382274960047","commenter_b":"Absolutely. We need that evil out of our country, or there won't be. That evil Clinton is still getting votes. Are there that many brain dead people that can still vote? She a freaking criminal, and low life form that should be in prison. For those that do like her, if it were you that had did all she has, you'd be a lifer in prison. Wake the heck up.","commenter_a":"I would rather see silver or gold certificate or better yet actual gold or silver. Back then no in god we trust on any money","post_message":"We must defend \"In God We Trust\" from atheist attacks. We must defend our Christian heritage. Sign and Share our petition to take action: @webpagelink"},{"comment_id":"952012654839207","commenter_b":"Pair of fucking idiots. Shouldn't be allowed to breed...","commenter_a":"Every once in a while I read something that haunts me for years","post_message":"The baby was strapped into a child-seat and left on the floor."},{"comment_id":"10154060269921162","commenter_b":"BANG...! that's all","commenter_a":"Two things that are impossible... To rehabilitate a terrorist or a child molester. Both should be shot on sight...","post_message":"DISTURBING: Thousands of digital images that show children as young as 5 years old engaging in sex acts with adults were found in an Indiana man's home... @webpagelink"},{"comment_id":"10152879295577623","commenter_b":"A lot of girls are...","commenter_a":"Worst part is...SHE looks like she was cute,pre meth...","post_message":"A man and woman from North Carolina were arrested in Louisiana and face charges of manufacturing meth."},{"comment_id":"1022535797795443","commenter_b":"hahaha good one, and accurate.","commenter_a":"I flushed something more qualified than both of them this morning.","post_message":"LOL..."},{"comment_id":"10153730231431337","commenter_b":"Because women should only pursue careers that focus on their looks, right?","commenter_a":"Fxxx her kickboxing career shes georgus","post_message":"TOO BIG? This MMA fighter's \"12-pound\" breasts are ruining her fighting career..."}]
