[{"comment_id":"723019874555257","commenter_b":"Should have turned on this evil muslim way before this get him out","commenter_a":"Shariah women slavery FACTS NOT phobia... TRUTH NOT misguided HATE... Example: Mohamidians mistreat WOMEN soooo badly ends shariah court to determine who can repeatedly RAPE women SLAVED by islam... WASHINGTON - Islamic State theologians have issued an extremely detailed ruling on when \"owners\" of women enslaved by the extremist group can have sex with them, in an apparent bid to curb what they called violations in the treatment of captured females. The ruling or fatwa has the force of law and appears to go beyond the Islamic State's previous known utterances on the subject, a leading Islamic State scholar said. It sheds new light on how the group is trying to reinterpret centuries-old teachings to justify the sexual slavery of women in the swaths of Syria and Iraq it controls. Above from article... @webpagelink","post_message":"BREAKING: Liberals Turn On Obama After He Is Caught In THIS Massive Lie About Bin Laden [VIDEO]. He can't hide any longer. His presidency should be terminated. Do you think Obama should be impeached?"},{"comment_id":"10154757833186037","commenter_b":"What in the world is a 15 year old doing out at 4:00 a.m.? Oh and BTW, black lives don't matter to black thug killers!","commenter_a":"Sry to hear this","post_message":"Trinity Gay, the 15-year-old daughter of Olympic sprinter Tyson Gay, has been fatally shot."},{"comment_id":"1831610420459597","commenter_b":"This woman is a lunatic.","commenter_a":"Just when I thought no-one could possibly be worse than Trump..","post_message":"Forget that Donald J. Trump is accused of sexual assault...and that President Bill Clinton is not on the ballot."},{"comment_id":"591548094329175","commenter_b":"No, let her coach womens sports.","commenter_a":"Ridiculous. Why even keep score and give everyone a super bowl ring.","post_message":"Should females be installed as coaches on every NFL team?"},{"comment_id":"892169154214897","commenter_b":"Tucson, AZ.","commenter_a":"12s, where are you watching from???","post_message":"Watch: Seahawks leaving for Carolina!"},{"comment_id":"1800084686916109","commenter_b":"Since 1952 Muslims are here ILLEGALLY. They need to get the hell out.","commenter_a":"Dear Democrats and Liberals, I'm noticing that a lot of you aren't graciously accepting the fact that your candidate lost. In fact you seem to be posting even more hateful things about those of us who voted for Trump. Some of you are apparently \"triggered\". Because you are posting how \"sick\" you feel about the results. How did this happen you ask. You created \"us\" when you attacked our freedom of speech. You created \"us\" when you attacked our right to bear arms. You created \"us\" when you attacked our Christian beliefs. You created \"us\" when you constantly referred to us as racists. You created \"us\" when you constantly called us xenophobic. You created \"us\" when you told us to get on board or get out of the way. You created \"us\" when you forced us to buy health care and then financially penalized us for not participating. You created ...","post_message":"President-elect Donald J. Trump​, Melania Trump, Speaker Paul Ryan​ and VP-elect Mike Pence​ meet at Capitol Hill."},{"comment_id":"1859800897573502","commenter_b":"His daughters are no exception .","commenter_a":"50/50 sounds fair","post_message":"Would he let his daughters be drafted?"}]
