[{"comment_id":"828695877229020","commenter_b":"I would of kicked someone ass if that was my kids","commenter_a":"Jessica Bates daaammm","post_message":"The children were 4-6 years old."},{"comment_id":"324603137933515","commenter_b":"@username have her livein your house ! Problem solved ..","commenter_a":"She can come but her parents need to stay and fight for their country","post_message":""},{"comment_id":"10153124983097061","commenter_b":"fire her","commenter_a":"If she can't full fill her position she should step down.","post_message":"Kim Davis name removed from marriage license for same-sex couple: abcn.ws/1NrN92G"},{"comment_id":"1266458500080562","commenter_b":"These articles consistently show how unbalanced a frightening amount of women are. Cheating should NEVER result in assault or worse. Never.","commenter_a":"Did he learn anything?","post_message":"She shot him in the groin for having an affair"},{"comment_id":"1203685899671880","commenter_b":"In America more people are killed by white guys than Muslims","commenter_a":"She is not brave. American people give folks a chance. Muslims do not. She knew what she was doing. Just like the Muslim who shot the police officer yesterday. She shot Trump the same way. She should have stayed away from the rally. It was a Trump Rally. Not a Muslim rally. What did she think would happen. She knew, she used the media and did not fool anyone. She also showed her true colors. Dressed like some person from the 6th century.","post_message":"This woman will restore some of your faith in humanity. Too bad her treatment at the hands of Trump and his reporters will promptly squash it."},{"comment_id":"10152820989551615","commenter_b":"I would be putting her inappropriately dressed (?) fat butt right out of the \"prom.\" She LOOKS like a moderately dressed hooker! Maybe that is closer to the truth than one might think.","commenter_a":"Wouldn't be necessary if the CHILDREN and their PARENTS actually knew how to dress appropriately.","post_message":"“You can't put ten pounds of mud into a five pound bag.\" One parent is threatening to sue for sexual harassment over a school handout about the dress code for graduation. It’s a story we’re talking about this morning on Channel 11. @webpagelink"},{"comment_id":"1250106475030208","commenter_b":"There actually is a move to get women to sign up for the draft right now (though it won't matter because there will likely never be another draft) But you wouldn know about that because the draft is one of the only things meninists have to bitch about. But","commenter_a":"Why arent feminists fight for equal representation in sanitation? Or equal representation is crab fishing? Or equal representation in the draft. Women should sign up for the draft #genderequality","post_message":"\"But in order to help, those of us who do understand have to know what women are up against.\""}]
