[{"comment_id":"10155024905873487","commenter_b":"Yes, but I am going out swinging. My representatives are getting letters, resistors are getting encouragement, all entreating those who swear to protect and defend the constitution are getting my support. I grew up when you did...and felt the same way. We are to be tested. Our Republic will need yo stand. So I will too. Join us!","commenter_a":"Good-bye halcyon days of growing up in the U.S. in the sixties and seventies. Worst shock of my life was 2008. I had always, unconditionally, believed that FDR's reforms were indissoluble, absolute, perfect. Now I don't trust anything; if there is money to be made, no perfidy is too great to be inflicted upon Joe Lunchbucket and me. It was a great experiment, but the protections against the avaricious that were put in place were not strong enough.","post_message":" don think Richard Nixon even comes to close to the level of corruption we already know about Trump."},{"comment_id":"931654693541670","commenter_b":"It's not just barbaric, it is one more tool of the rich used to keep the not-rich \"in their place\".","commenter_a":"I guess when you have universal medical coverage you don't realize what a nightmare our system is.","post_message":"The headline really begs the question, who the hell would ever want to visit the United States knowing they could be bankrupted if they should need medical care while they are here?/"},{"comment_id":"10153188794046680","commenter_b":"And @username get that male organ out of your mouth.","commenter_a":"@username just how would have more gun control laws have prevented this last shooting? California has already the most stringent gun control laws on the books.","post_message":"A day after the shooting massacre in California, Republican presidential contenders were utterly unapologetic about their opposition to new gun-control laws."},{"comment_id":"791521404314373","commenter_b":"ENOUGH FREAK SHOW BULLSHIT IF YOU HAVE A COCK YOU USE THE MEN'S ROOM","commenter_a":"That's the Republicans in a nutshell lol. Poverty??? Jobs?? Helping the Poor and Veterans??? FUCK NO!!! we don't have time to do that we have to make Bathroom rules lol","post_message":"Oh no....last time I posted on something like this I hate Liberal hate mail for about a month. So what's your thought on this?"},{"comment_id":"10153141581576336","commenter_b":"This is because the Tri County area in Mi is one of the largest Muslim areas in the country. I'm sick of it too, this whole scenario is not going to end well for Christians.","commenter_a":"GARBAGE!","post_message":"Students at the University of Michigan successfully petitioned to cancel a campus screening of 'American Sniper' – claiming the film promotes anti-Muslim rhetoric and made them feel unsafe."},{"comment_id":"1142584762463568","commenter_b":"President not dictator","commenter_a":"Donald Trump nuclear war","post_message":"Indiana governor and Republican vice presidential nominee Mike Pence spoke at a rally at the Space Coast Convention Center in Cocoa, Florida."},{"comment_id":"10153933140869087","commenter_b":"It is their constitutional right to burn the flag just like the constitutional right to carry a gun. I might not agree with it b","commenter_a":"That's constitutional to do. Folks may not like it, but you can burn any flag. Free speech.","post_message":"Chaos as anti-Donald J. Trump protesters burn an American flag outside the GOP convention"}]
