[{"comment_id":"1359940970684036","commenter_b":"wish they would lock her up and throw away the key.","commenter_a":"That Lady makes 18 million maybe she could give up some of her salary for the poor kids that need pen to not die...something wrong with this.","post_message":"UK's price: $69 Germany's price: $218 America's price: $600"},{"comment_id":"10152926517991491","commenter_b":"A predator is a predator no matter what age they are. I'll bet kids who murder should get away with it based on naivety and hormones too right? Hormones drive alot in a human beings, including aggression, so thats an excuse I guess.","commenter_a":"Go figure. Anti-gay bigot who thinks gays are predators is a predator himself. So much self projection among the religious.","post_message":"“I would do anything to go back to those teen years and take different actions.”"},{"comment_id":"10154091586819160","commenter_b":"@username @webpagelink","commenter_a":"lets see BLM carry guns and shoot police and beat up on whites. Burn our flag and want to separarte from the union. These guy protested without hurting anyone and had our american flag with them. even the policeman felt safe with them around. BIG DIFFERENCE.","post_message":"Despite carrying assault rifles, the group says it didn't mean to \"start any problems.\""},{"comment_id":"1338481856248063","commenter_b":"Another woman with no self- respect!","commenter_a":"Typical racist coward","post_message":"He said the controversial chant he was heard yelling had nothing to do with Jews."},{"comment_id":"10153904790105496","commenter_b":"Why is this guy not convicted yet...","commenter_a":"Oh no!","post_message":"Thermal experts say temps inside Ross Harris' SUV could have been as much as 125 degrees while Cooper was inside. Watch LIVE trial analysis now: @webpagelink"},{"comment_id":"1078205312195129","commenter_b":"She will walk! MSM will guarantee it.","commenter_a":"She served on the Watergate committee. That's where she got the idea. Hillary did get fired from that commission for lieing. She is the original old crony.","post_message":"Hell, Nixon only erased 18 minutes. Hillary erased literally everything."},{"comment_id":"10153776672201770","commenter_b":"So Is @username","commenter_a":"Who is this Pollyanna? She thinks Hillary is all rainbows and unicorns. You can't put lipstick on a pig.","post_message":"\"She is a real person...\""}]
