[{"comment_id":"10153135798986323","commenter_b":"oh no Claire Leivers you are being invaded by more vikings!","commenter_a":"Martin Theander ...thoughts ?","post_message":"A bridge too far?"},{"comment_id":"10154594345964749","commenter_b":"@username leave arab countries ask you governments to stop killing people there . and the immigrants will go back","commenter_a":"I think the comment has to be taken into context... Looking at Hungary's demographics, Muslims don't even account for 0.1% of the population. The politician is probably representative of the general public mood there. Although in a more colourful tone!","post_message":"The Hungarian politician was described as “a sad old man full of hate” and his comment was branded as “disgusting”."},{"comment_id":"10155606763470492","commenter_b":"OMG it happen on number 7 train everyday. this lady on the photo is nothing. many of them insists squeeze inside and the worse is stink body smell that hit your nose.","commenter_a":"Tiffany Yeung","post_message":"Behold, the Incredible Levitating Lady."},{"comment_id":"870966692926187","commenter_b":"GIRL BYE","commenter_a":"I don't blame her for not wanting to call him. She hasn't spoken to him for a reason. Probably the same reason why Lisa Bonet and God knows how many other members from the cast have not! She should not have been fired for that.","post_message":"Keisha Knight Pulliam Fired From Celebrity Apprentice For Not Contacting Bill Cosby For Fundraiser @webpagelink"},{"comment_id":"10153994398911341","commenter_b":"@username tutsis have no link to Israel,,,, Until the 60 s and the palestinian/antisemite propaganda, Palestine was considered as where the jews came from, before ww2 antisemites were shouting at jews to \" Go back to Palestine\"...","commenter_a":"6 millions zionists certainly not because a lot wanted to stay in their own country ... but after WWII ... a lot were seduced by the zionist propaganda. Holocaust was accelering factor of the zionist project already busy in the 20's and 30's with help of british, Rotschild bank and even nazi's (1933 haavara agreement)","post_message":" school education system only tells you about Anne Frank and the six million Zionists that were killed by Hitler."},{"comment_id":"10155391661993797","commenter_b":"What a shame send this animal to jail .","commenter_a":"Very sad","post_message":"A young mother is facing child abuse charges after police say she kicked her 4-year-old daughter in the stomach for not brushing her teeth. The girl is hospitalized in critical condition."},{"comment_id":"10154220107672293","commenter_b":"@username idiot","commenter_a":"Like the Central Park rapists (5 young black boys) some years back that Trump railroaded into jail, then never apologized when someone else confessed.","post_message":"Cooper was wrongfully convicted of armed robbery in Indiana in 1997, and he is still waiting to be pardoned."}]
