[{"comment_id":"10153858591813279","commenter_b":"Clinton is a republicrat! When will people realize she is only \"progressive\" when it comes to lining the pockets of Wall Street, big corporations & the ultra rich?","commenter_a":"\"When [Clinton] says let talk about issues and let look forward, what she really saying is let not talk about my campaign financing, or my policy history, because it won bear the scrutiny my new, new, new progressive brand demands.\"Look, let get this straight. It wasn't very long ago when Hillary Clinton favored the TPP, the Keystone XL Pipeline and the death penalty. She also opposed gay marriage and reinstating Glass-Steagall. Her foreign policy is closer to the neocons who got us into Iraq (which she voted for) than what the American people favor. She flipped on immigration, gun control, and NAFTA. That not progressive. She attributes her changes towards progressivism to as a result of information. But as Politico points out, for most of these issues, there was no new information. For example, what changed on gay marriage, other than public opinion? It also begs a question: if Sanders ...","post_message":"The most heated exchange during last night's MSNBC Democratic presidential debate began after Bernie Sanders accused Hillary Clinton of being part of the political establishment."},{"comment_id":"10154084901793837","commenter_b":"How horrible to be treated like that. I hope she gets fired.","commenter_a":"Wtf is wrong with these people ..","post_message":"QUESTIONABLE TSA TREATMENT? A woman diagnosed with breast cancer says she was humiliated by TSA during a recent security check. Hear what she has to say about the ordeal."},{"comment_id":"10154657445794575","commenter_b":"@username so what your saying is the other 55% or the majority are coming over the border illegally so we do need to build a wall right?","commenter_a":"Help AMERICA first. Like the veterans, homeless and elderly!!!","post_message":"Exodus Refugee Immigration plans to move 60 people from Syria and the Democratic Republic of the Congo to Bloomington next year, starting in March. \"These are the most thoroughly vetted people coming to the United States. We don’t do research into anybody else to this extent,\" said IU Associate Professor Elizabeth Dunn."},{"comment_id":"10152804036658145","commenter_b":"I disagree... there are less and less males signing up to become priests ...Ireland of all places had 1 ..yes that is right 1 ordained priest last year...they either open the doors to the females soon or people will have to do their own masses...","commenter_a":"I kind of believe this Pope Francis might be very welcoming to having female priests...Congrats on reaching your life long dream...","post_message":"CORRECTION: While the woman was ordained through a non-denominational church, and she considers herself Catholic, the Catholic Diocese has not responded to WFTV's story and she has not been ordained by the Catholic Church. Rita Lucey says she faces excommunication from the Catholic Church, but would rather fulfill her lifelong dream of becoming a priest."},{"comment_id":"775605039243294","commenter_b":"Experimental Sexual Preference Network - no longer watching this no moral standards network","commenter_a":"I will not be watching any more","post_message":"Leftist ESPN goes all in..."},{"comment_id":"1466659373354088","commenter_b":"@username <<<america needs more folks that think like this guy... dude you such teach classes to these bigot trump supporters","commenter_a":"Protestors are chanting \"Black Lives Matter\" as they set fires, fire weapons and attack police with bricks but BLM leadership will say they don't represent \"the movement\". Yes, this IS your movement. No one respects you. You defend criminals, make martyrs of cop killers and have the gall to act like these violent protests don't speak for you?","post_message":"A large crowd turned out after Milwaukee police shot and killed what they said was an armed suspect earlier in the day."},{"comment_id":"533221760173934","commenter_b":"If this CRAP ever does fly,WE the PEOPLE,aka The Government,aka TAX PAYERS,will be SUED by LEGAL IMMIGRANTS who became CITIZENS for a HEFTY PRICE($650 per or better)wanting their money BACK because these CRIMINALS got in for FREE and remain on the TAX PAYERS TEAT...Check the story on he IRS scandle of earned income tax credit for the illegals collecting on kids(nieces.nephews,kids)IN MEXICO...They are aware(news station expose')& claime it's up to congress to close the \"loopholes\"...","commenter_a":"a vow of silence would be greatly appreciated by all career politicians and family dynasty politics","post_message":"\"The people at the heart of this issue are children, parents, families, DREAMers. They have names, and hopes and dreams that deserve to be respected\" - Hillary Clinton"}]
