[{"comment_id":"467726553428449","commenter_b":"racist ignorant rebooblican whore","commenter_a":"Both parties need to stop!!! Make America Great!!! Both parties are annoying.","post_message":"Obama wants her head, but Ann Coulter is standing her ground. This is bold. She needs our support. Can we get 50,000 'LIKES' for Ann Coulter?"},{"comment_id":"10152751952356130","commenter_b":"Stop sending people to Portland! #dontmovetoportland","commenter_a":"Esther Payne","post_message":"Is your city on the list?"},{"comment_id":"10154493195323132","commenter_b":"@username Do you believe everything that you read on the interwebs? And why are you so gung ho about defending Schumer? Or are you simply into fat chicks?","commenter_a":"Is anyone here a marine biologist? We have a beached whale on our hands!","post_message":"Amy Schumer, Kate Hudson and Goldie Hawn are the epitome of squad goals on their Hawaiian vacation."},{"comment_id":"10153540508969087","commenter_b":"@username BY THE WAY BITCH, YOU ARE THE LOSER!","commenter_a":"HOW ABOUT WHEN YOU CHEATED ON YOUR FIRST WIFE WITH MARLA MAPLES AND GOT HER PREGNANT, DUMPED YOUR EIFE, MARRIED MARLA, THEN DUMPED HER TOO!!","post_message":"\"I have a very good marriage now. Melania's fantastic,\" Donald J. Trump told Anderson Cooper at the CNN town hall in South Carolina. \"But I had two women that I never blamed because I worked so hard that my job came first. Maybe I work too hard. I was a better father than I was a husband. But I worked very, very hard and I love doing it.\""},{"comment_id":"1601468970152449","commenter_b":"Victoria SD you stupid bitch","commenter_a":"If only Khan talked about Islamic terrorist attacks as much as he talks about DJT - using his son's death to score points for a flawed ideology! Damage control!","post_message":"Khizr Khan, the father of a slain Muslim soldier, says Donald Trump is \"incapable of empathy.\""},{"comment_id":"10153725083142464","commenter_b":"@username YOU'RE A COMPLETE MORON !!","commenter_a":"I remember my thanksgiving in Iraq and the Stan. Prayers for all those away from the families eating thanksgiving in a to-go box","post_message":"Tomorrow and every day, don't forget to say a prayer of Thanksgiving for our men and women in uniform spending the holiday away from home."},{"comment_id":"10152619988623525","commenter_b":"With lots of glitter...","commenter_a":"So, what will the bathroom towels have on them??????","post_message":"UPDATE: Hillsborough County Clerk Pat Frank says the office is ready to issue same-sex marriage licenses Tuesday morning, and she has reserved the park across from the office for potential crowds. \"I was hoping Judge Hinkle would revisit it and he's made it extremely clear now that it applies to every clerk in the state, that the ban against gay marriage is void...it never existed.\" MORE: @webpagelink"}]
