[{"comment_id":"10153313566903908","commenter_b":"Like the symbolism...but don't know about using it as a flag...we tend to fly flags when we want to differentiate our selfs from others...this differentiation leads to conflict and destruction...no flag","commenter_a":"I see that beautiful symbol as being interconnected and one. Almost reminds me of the flower of life or a lotus","post_message":"This could become the flag that is used to represent our planet as a whole when we travel to other worlds. It was designed to \"evoke the feeling of global community in people all over the world, reminding us that we all are connected and should take care of our home planet and each other.\" Sacred geometry, anyone?"},{"comment_id":"474933522694941","commenter_b":"No! We don't want any more of these people!","commenter_a":"AHH HELL NOO!!","post_message":"60,000? Can you imagine how many terrorists among them?"},{"comment_id":"10153826114722994","commenter_b":"What about them lying women. Who spred there legs to get bill money. I still respect bill. I still watch he's show.. get on the man who allowed them underage girls to come into that mansion..","commenter_a":"If the press and police will get over their prejudice and look at white males the way to they do black males as suspects, it would be a lot of white children alive today! \" They deserve a voice too! It's no coincidence, that these types of crimes don't get the scrutiny, they deserve. This is why child kidnappings, molesters, underground child porn rings, Internet pedophiles, thrive in suburbia, because they're white. R.I.P! Little one, the press will catch on sooner or later. The way I feel about inner city children dying by bullets in Detroit, is the same way I feel about suburban children dying at the hands of a kidnapper. They all deserve to live.....","post_message":"11-year-old Jacob Wetterling vanished in October 1989 while riding his bike. Almost 26 years to the day, police in Minnesota say they have a person of interest - and it was someone they looked at just days after he disappeared."},{"comment_id":"1281193278643588","commenter_b":"THAT is what Hillary said she is going to do. People out there are saying she wants to abolish the 2nd amendment...which couldn't be done by anybody.","commenter_a":"Gun Control? How about enforcing the current laws. Statistically less than 25% of the current federal firearms laws & regulations are enforced. If all of them were enforced gun violence would be almost nonexistent.","post_message":"Summer vacation is over, and it's time for Congress to get to work."},{"comment_id":"1447392598607688","commenter_b":"Style and Clinton DO NOT go together; she dresses worse than a bag lady.","commenter_a":"Oh Lordy, how gross!","post_message":"Hillary Clinton? You mean THAT Hillary Clinton?"},{"comment_id":"10153691446913984","commenter_b":"Trey what the bitch in jail","commenter_a":"Someone should call that witch on the carpet. She's a corrupt liar, but I guess that I am supposed to be OK with that because she is a Liberal.","post_message":"Looks like Hillary Clinton just got another piece of bad news, and it's from one of her least-favorite people. 'Bulldog' Gowdy is hot on the trail! Do you support Trey Gowdy's fight to hold Hillary accountable?"},{"comment_id":"10153778934267098","commenter_b":"Told to put her phone diwn, LOL","commenter_a":"In other news, the NBA just suspended Ayesha Curry for Game 7.","post_message":"Twitter goes crazy over Ayesha Curry's tweet..."}]
