[{"comment_id":"452100988313815","commenter_b":"Oprah is on her way out No one watches her American people don't like racist people like her","commenter_a":"I've thought she's been racist for years!!","post_message":"Do You Agree Oprah Is A Racist? Comment 'yes' or 'no'."},{"comment_id":"1512598459048144","commenter_b":"Your the dumb ass!!","commenter_a":"You people are stupid if you think illegal immigrants get assistance. They stay in hiding so that they don't get caught and sent back. They can't get assistance without a social security card. Stop listening to dumb ass Trump.","post_message":"Trump says his plan to build a wall at the border is absolutely not negotiable. Do you support or oppose the wall?"},{"comment_id":"10152670705340671","commenter_b":"Glad she was able to fight him off but lets be smart about it ladies.","commenter_a":"What was she doing jogging in the dark at 5 am in the morning. I am not condoining she got attack. But account for ones own safety is what I am saying.","post_message":"The woman was able to fight the attacker off, police say."},{"comment_id":"10153227966933984","commenter_b":"The woman is a fukin crook","commenter_a":"I want a moral person leading our country!!","post_message":"Well, here's BIG news that will turn a lot of heads. Do you hope this marks the final chapter of the Clinton saga?"},{"comment_id":"503378786489136","commenter_b":"She is nothing but a bigot. Keep her locked up until she complies","commenter_a":"Do the right thing. Spread hate in the name of Jesus and shield your bigory with the bible. Claim you are a christian to defend your sorrid past to justify issuing your twisted moral judgment on others. Yes than you will be a twisted evangelical christian spreading the hate of your chosen religion.","post_message":"Who is the clerk in the middle of the same-sex marriage debate?"},{"comment_id":"10153283394148984","commenter_b":"She needs to be in the big house not the white house","commenter_a":"Grill her ass !","post_message":"Trey Gowdy has invited Hillary Clinton to testify, in private, on her decision to delete thousands of emails from her private server as well as the full scope of her responsibility in the 2012 attacks at Benghazi. Let Rep. Trey Gowdy know how you feel and customize an email just for him!"},{"comment_id":"10154974435358812","commenter_b":"Russian Women For Trump ???","commenter_a":"Well rehearsed lol","post_message":""}]
