[{"comment_id":"1367609406650925","commenter_b":"Lets stomp out evil everywhere.","commenter_a":"It will be good to have a true American running the government again.","post_message":"This is definitely the most Trump-tastic resolution that Donald J. Trump could have made..."},{"comment_id":"10153215419029726","commenter_b":"She is a much bigger problem than wild Willy","commenter_a":"possibly the only reason she wants to be president is so that she avoids prison time.","post_message":"Are YOU Ready for Hillary? Which is her bigger problem... Benghazi, missing emails, Wall Street? @webpagelink"},{"comment_id":"10154346047721336","commenter_b":"The also gave us mass production cigarettes, fast food, obesity, lung cancer and heart disease. Yeah!!!","commenter_a":"Think about the differences in the 18 year old people now-a-days compared to then. Can you see your 16 year old neighbor going to the recruitment office to try to lie about his age to enlist? They're called \"The Greatest Generation\" for a reason. We'd have everyone trying to sue the government for various reasons rather than fighting. It is a different world we live in, with different core values in the newer generations. Even the older generations are wasting their time debating bathroom rights... THESE kids knew what was important, and were willing to give all for their beliefs. I can't salute them enough, or honor them enough, or thank them enough. And having served overseas for the majority of my time in the service, and living in Germany, I was fortunate enough to see just what the older generation of Germans felt for these people who did so ...","post_message":"We remember, and give thanks. #DDay"},{"comment_id":"10153001285494091","commenter_b":"Why have a trial for this garbage. Execute her already.","commenter_a":"savage.","post_message":"\"Everybody wants to know. Yes, I did kill her. The mother accused of killing her two children and storing their bodies in a freezer yelled in court that she killed them: @webpagelink"},{"comment_id":"973167082706082","commenter_b":"Its funny, we cant have stricter gun laws becuz criminals will still find a way to get access to guns but we need to figure out a way to have stricter border patrol laws as if the illegals wont try find another way into the country lmao the logic the people have now a days haha","commenter_a":"There's something wrong with American culture, not gun control laws. New York has more stringent gun laws than Canada but has about twice the number of killings via guns. It isn't the weapons, it's the people.","post_message":"This is a conversation we need to be having."},{"comment_id":"10153174741786323","commenter_b":"English people are NOT being RACIST. They dont go to places to live eg Spain. Greece. Australia etc and expect that country to cater to them. You go to a country you respect their way of life. They need to learn English. I used to love the golly on the jam jar brooches. All gone because of so called RACISM. This is a little island. Anyone with a criminal rec ord should not be allowed here and those that commit a crime need to be returned to their homeland. We pay NI out of our wages- not to support freeloaders who offer nothing to this country. What was beautiful historic church buildings-turned into Indian Temples. English Heritage is being destroyed!! Polish people have turned this country in areas to little Polands and this Government have let them. BNP want this country to be ENGLAND and ENGLISH laws and those that ...","commenter_a":"If a white person doesn't roll over and submit, he's a racist.","post_message":"\"Facts in themselves are neutral but their interpretation certainly isn’t. And while on their own facts cannot be racist, the way they are chosen certainly can be.\""},{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act! Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"}]
