[{"comment_id":"1027313147330802","commenter_b":"Jerry, I hadn't thought about Arab nations not taking them for that reason. So-called common wisdom has it that they don't want them because they're potential troublemakers. Your idea makes more (and scarier) sense.","commenter_a":"I don know if anyone realizes what is going on. I always tried to grasp the larger picture; go from the general to the specific and not the other way around. Europe and soon America are under invasion. None of the typical Arab countries have taken the Syrian refugees. Fact. Why? Because they want them to overwhelm the western nations. Infiltrate the society. Surround the culture and change civilization as we know it. At that point, it done. Pretty simple, isn it? Sorry, not if I can help it. Islam is a political movement masquerading as a religion. Smell any coffee?","post_message":"Muslims Tried To Go Big In This U.S. Town, MAD Patriots Shut Them Down (VIDEO) @webpagelink"},{"comment_id":"10156406876695354","commenter_b":"lies as much as Obama, anyone votes for this lady is a total idiot, we already have confirmed Muslims coming in with the wave of them as terrorist, needs to shut her mouth with all these lies, you think our economy is bad now vote her in and she will double the debt, no place for this lady in politics.","commenter_a":"Jack ass","post_message":"\"Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" Hillary Clinton is a _________________."},{"comment_id":"438540092994538","commenter_b":"Ron i understand....however Im still not tryin to make excuses but im a single homeowner with a mortgage that works full time and has the same bills as everyone else. I wanted it bad enough and i found a way to do it. If anyone wants it bad enough then they will find a way to sacrifice for the time being. Only reason i origanally commented on this post is because i am proof that a lil sacrifice and hard work pays off. I gave up alot for the year i went to school. Most people will just \"omg i cant give all that up, eh ill just work at a crap job and complain and expect to get things handed to me.\" What bothers me is the sarchasm and name calling ive gotten here from some people haha. Ur the ones that want things handed to you probably!! Stop ...","commenter_a":"Or?? How bout it means get off ur butt and try to better yourself....","post_message":"Let's aim for a living wage."},{"comment_id":"740023432800293","commenter_b":"That is just an act! She could use some for real but that isn't going to happen!","commenter_a":"Your dead soul of an ass shouldn't have constitutional rights either you f*#king hag. Isn't it time for you to leave? Lucifer has GOT to be worried about where his ugly little daughter ran off to.","post_message":"Where's that \"love and kindness\" Hillary is always lecturing Americans about?"},{"comment_id":"508257596043081","commenter_b":"His wife destroyed that college but gave herself $200k severance pay. They are crooks","commenter_a":"If Sanders were to be nominated and elected in Nov, big problem is that he has not raised money, or campaigned for, congressional Democratic candidates. In other words, Sanders will be no better off than Obama has been if he can't get enough members of Congress to pass his initiatives.","post_message":"The attacks are going to get more unhinged."},{"comment_id":"10152961247876680","commenter_b":"That's you and your crowd... Dead and cut up babies sold for the meat market !","commenter_a":"I proudly stand with Planned Parenthood.","post_message":"The move dramatically increases the chances of a government shutdown fight in the fall."},{"comment_id":"10154156141525470","commenter_b":"Just have her carry bacon with her if she's in one of those \"gun-free\" zones.","commenter_a":"Wow! How scary is that! Pray to keep this family safe.","post_message":"A St. Louis area woman who is reportedly on an ISIS hit-list said an FBI agent came to her home and told her to “arm up” because she is a potential target. A Special Agent with the FBI on Wednesday came to April Agers’ front door, knocked and delivered the startling news. Agers is on an ISIS hit-list."}]
