[{"comment_id":"10154104100243132","commenter_b":"#2. he likes ugly chicks","commenter_a":"Just be happy... The beginnings are the best!","post_message":"New year, new romance for Amy Schumer!"},{"comment_id":"1739731709624496","commenter_b":"Dumb racist bitch","commenter_a":"I think she's stupid - like literally too lacking in intelligence to do more than jump onto an under informed, opportunist bandwagon.","post_message":"Don't let the door hit you..."},{"comment_id":"10152973215291519","commenter_b":"So you are saying that black women are easier to compete with than whites women? I don't think so","commenter_a":"She couldn't compete with other white women so she became a light skinned black woman. Using our own weakness against us.","post_message":"The cringe factor here is off the charts..."},{"comment_id":"10153687652479885","commenter_b":"That was stupid! Sounds like she needs to take that conceal carry class again!","commenter_a":"If you pull a gun out you need to pull the trigger. Shoot to kill not just threaten.","post_message":"A Florissant man was charged Tuesday with grabbing a pistol from a woman Saturday as she was trying to prevent him from attacking her friend in University City, then beating her and her friend with the gun and shooting one of the women."},{"comment_id":"1585875914805484","commenter_b":"Yer yer yer no one beleavs it","commenter_a":"Melissa Saucedo","post_message":"She claims Donald J. Trump 'groped her butt' because she 'looked like a younger Melania'"},{"comment_id":"10153120731383010","commenter_b":"now THAT'S a woman!","commenter_a":"Yay! Now wet can objectify plus - size women too! We're all about equal opportunity around here!","post_message":"When Sports Illustrated's 2015 swimsuit issue hits newsstands next week, it will include an ad featuring plus-size model Ashley Graham. Cause for full-figured celebration?"},{"comment_id":"1777986365799226","commenter_b":"She is above the law,she doesn't, cheat or steal!","commenter_a":"As a woman I don't want the first female president representing me as someone who is a corrupted, lying, manipulator and fraud who thinks she is above the law. #Hillaryforprison.","post_message":"Hillary Clinton holds campaign rally in Cedar Rapids, Iowa after FBI announces they are reviewing email investigation. abcn.ws/2fnHba3"}]
