[{"comment_id":"10153521942669369","commenter_b":"Criminals will just buy another brand.","commenter_a":"Good. Maybe less guns on the streets.","post_message":"It's the end of an era."},{"comment_id":"1177291819033735","commenter_b":"Boy that was a huge crowd! 😂","commenter_a":"Good for you, kid!","post_message":"WATCH: A kid yells \"you suck\" at Ted Cruz. More here: @webpagelink"},{"comment_id":"10157063927485725","commenter_b":"#ByeByeCrookedHillary","commenter_a":"Wipe terrorism off the map...so many countries suffering...and who knows...without TRUMP we WILL be next...TRUMP 2016","post_message":"Thank you Lt. Steven Rogers. We will respond to terrorism with strength in 2017!"},{"comment_id":"10152960138411051","commenter_b":"Good woman","commenter_a":"I would do that too. He deserved to be punished for that horrible incident. Great mom.","post_message":"As soon as this teen's mother saw the pictures that were being circulated, she immediately grabbed him and dragged him to the police station."},{"comment_id":"481914358685584","commenter_b":"That chick in the picture is going to fire up a joint , get high , go down and get her welfare check, then crash for a while, then get up and go to a anti-whatever rally and get arrested , then get out on an O/R and go cash her check and go get some more weed and start all over again. Thanks Gov. Brown for making California so great!","commenter_a":"Does that mean about 4 thousand attended?","post_message":"Attendees of the annual 4/20 pot celebration left behind almost 15,000 pounds of trash at the Golden Gate Park. PHOTOS/VIDEO:"},{"comment_id":"10158119548295603","commenter_b":"We have to hate ILLEGAL immigrants.... GOT IT!","commenter_a":"Maybe it could be an anti-bullying lesson...? You know, if he says or does anything like he did THOSE OTHER TIMES... That we have recordings and videos of him... Doing horrible things.... And saying horrible things...","post_message":"Thoughts?"},{"comment_id":"10153793853959714","commenter_b":"You know how you don't want to date every girl you see? Girls don't want to date every guy they meet :)","commenter_a":"I don't understand why women say being too nice is unattractive when all they can talk about is how they wish they had a nice guy and someone who would finally treat them right but when they find a good man who does they say \"i can't be with you cause you're too nice\" and end up with the same type of guys who treat them bad I know part of it is because some girls aren't use to being treated like that so they go back to what they are use to or they just think we want something out of them give people a chance there are still good people left","post_message":"We don't know about this one..."}]
