[{"comment_id":"10154086939802994","commenter_b":"I will never shop at cvs again until he is rehired","commenter_a":"Go figure if I was him I would have told him take anything you want this job don't pay enough money it's not worth losing my life over","post_message":"Two men hopped the pharmacy counter and tried to rob the CVS. The manager, a trained Army vet, fought them off and took their weapon from them - but they got away. He was rewarded for protecting the store and people inside...with a pink slip."},{"comment_id":"1854344181462778","commenter_b":"Trump!!! Build that wall!!!","commenter_a":"This time they'll just say \"we need to stop this black on black crime\"","post_message":"WARNING: This video is graphic and may be upsetting to some viewers. @webpagelink Officials released surveillance footage showing a violent takedown by an officer on a train platform in Houston. The officer resigned and authorities said the investigation was still ongoing."},{"comment_id":"1230909136991106","commenter_b":"👌 well done my counterpart.","commenter_a":"Ill leave this here.","post_message":"Sad, but true..."},{"comment_id":"1531453513826452","commenter_b":"Yep, Asian Men are Sexy!!","commenter_a":"Don't feel bad Asians .. Black people either play a criminal or a slave majority of the time .. And/or there's only one black character in the entire film or show lol ..","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"10153871207061336","commenter_b":"No dear, Hillary Clinton was First Lady, a US Senator and Secretary of State. This little nobody was never anything close. Glad to help you. Leave the comedy to the professionals.","commenter_a":"This little nobody from Arkansas with no job is still making noise? LOL!","post_message":"\"That's one of the frustrating things about this president – he always tries to make it that he has the moral authority and everybody else is wrong.\" This morning on \"FOX & Friends Weekend,\" presidential candidate Mike Huckabee slammed President Barack Obama's approach to policy disagreements. @webpagelink"},{"comment_id":"10156348163835354","commenter_b":"This is exactly what we need..someone to shake up the illegals..make them realize that they cant stay here..these officials are part of the problem ..trump isnt crapping on latinos..he jist wants them to be here legally..obama and past administrations have turned their heads and not dealt with..we have a big problem now...go trump","commenter_a":"Really that is a bunch of nonsense! They would only be fearful of someone enforcing the Rule of Law for ALL... IF they have broken any laws. Anyone here legitimately -- they have nothing to fear at all! This Hispanic Lawmaker is sounding a false alarm! Instead of defending illegal aliens he should be working to improve the lives of the citizens and legal constituients he represents. Why is he working so hard to help those who do not belong here but doing nothing for those leagally here that needs the job he's allowing the illegals to stay at?","post_message":"“Mr. Trump’s racist remarks and his continued rhetoric demonizing Latinos and immigrants has created fear within these communities around the country....\""},{"comment_id":"10153331383855329","commenter_b":"Ummm they are...? If a diamond ring is a deal breaker for a woman she needs a reality check","commenter_a":"Thank fuck I have a husband who knew when he was proposing to me that I'm not a shallow twit who will only accept diamonds :) Also to those who say you don't get the sparkle with a fake, let me tell you, you do, you get sparkle in abundance, just because its \"fake\" doesn't mean its not good quality!! My rings catch many an eye and always oh that must of cost a lot bla bla bla, as far as I would be concerned my advice to men would be that if she DEMANDS a diamond she is not worth it :)","post_message":"Put a diagram on it."}]
