[{"comment_id":"10153830861505695","commenter_b":"It is much safer at sea then it is to remain in port.","commenter_a":"Praying they're found. Since the owners and the captain of the ship knew the path of the hurricane, why was it allowed to leave the port or at the very least why wasn't it rerouted?","post_message":"Loved ones aren't giving up hope, despite a life ring being found."},{"comment_id":"10154242157722690","commenter_b":"@username oh yes she is. No way would a women just go Willy Nilly about massive death. We are big on keeping people safe. He twits bc someone put him down. Just think if a country pisses him off.","commenter_a":"We have two people running for office that are both out for themselves. Ones going to court Nov 28th on a fraud case for his fraud school then we have one about email server. I mean come on we don't have a great choice! They both SUCK!","post_message":"FBI to reopen Hillary Clinton email investigation after additional emails were discovered as part of a separate investigation."},{"comment_id":"1354769341225150","commenter_b":"How'd you like this one -60% of the USA. illegal population resides in the Golden State. That is one of many reasons why our politicians support this crap! Frankly, that is one reason why our state taxes are incredibly high and the other is bad management without accountability. We also have a disproportionate amount of refugees getting relocated here and illegals residing in our prisons.","commenter_a":"Californians are beyond reasoning!!! They refuse to obey a national law on harboring illegal aliens, and yet have the gall to ask for funding to support those illegals they are harboring!!! NO FEDERAL FUNDS SHOULD GO TO CALIFORNIA UNTIL THEY DEPORT THE ILLEGALS THEY ARE HARBORING!!!!!","post_message":"I can't believe they asked for THIS!"},{"comment_id":"10154603806201037","commenter_b":"You mean like your people did to the INDIANS","commenter_a":"If Mexico and Mexicans hate him so much, they are free to go back to their cesspool and stop raping the American welfare system!","post_message":"“[Donald J. Trump] is not welcome to Mexico. By 130 million people, we don’t like him. We don’t want him. We reject his message.\""},{"comment_id":"370446236477004","commenter_b":"Take the bastards OUT!","commenter_a":"Time for drone, and Hell Fire missles.","post_message":"Is your state on the list?"},{"comment_id":"775973422593235","commenter_b":"Absolutely, she should be in prison anyway not headed to highest position in America","commenter_a":"Elated!","post_message":"BUSTED: Hillary Clinton Was Just Caught Read Handed For Being Linked To... This actually might stop her from running. Would you be happy if she had to back out of the race?"},{"comment_id":"10153206942041509","commenter_b":"F that Benghazi btch !","commenter_a":"Hillary Clinton 2016!..:)","post_message":"Will we see another President Bush? Jeb Bush's father and brother have both served as president. @webpagelink"}]
