[{"comment_id":"10153212700939270","commenter_b":"Well I know it was out of service around that time but I'm sure that's what they did but it was a great ship","commenter_a":"Aw darn now no one is safe aboard that ship when that time of the month comes","post_message":""},{"comment_id":"1043659032366340","commenter_b":"Yeah yeah @username, it's airheads like yourself what Trump needs to screw up everything in your country. I will build that wall so that people like you can't come into Mexico","commenter_a":"Look at what Mr. Trump is doing to America as a candidate, dividing it, making everybody fight betweeen each others. Imagine what he would do as president...","post_message":"People could be heard screaming, and Donald J. Trump ducked his head, grabbing his podium with both hands before backing away."},{"comment_id":"1051319018240177","commenter_b":"Let's build a wall!","commenter_a":"No way? Only illegal Mexicans are drug dealers and criminals. . Right?","post_message":"DRUG RING UNCOVERED: Six students at UC Santa Cruz have been arrested on Friday for allegedly running a drug ring that uncovered over $100,000 worth of MDMA, police said. READ MORE: @webpagelink"},{"comment_id":"10153154293302293","commenter_b":"Oh please. Stop being a pussy.","commenter_a":"Thanks Fox News for causing hysteria among your psyco viewers and almost getting my buddies killed.","post_message":"The men had a deadly plot to lure government forces into a trap, federal officials say."},{"comment_id":"874881595880596","commenter_b":"Doesnt matter what they get The blacks or most of them would whine and complain about something!","commenter_a":"Lets just go back to the old days of segregation if that's what they want and they all can ride in the back of the bus","post_message":"“Whites Not Allowed” This is the public education system in Obama’s America."},{"comment_id":"1698726270383299","commenter_b":"@username I DON'T KNOW WHAT YOU ARE SMOKING OR DRINKING BUT EVERY SINGLE DAY HE LAYS OUT POLICY....1. CLOSED BORDER, 2. DEPORT ILLEGALS, 3, BUILD A WALL. 4 HEALTH INSURANCE OVER STATE LINES SO IT IS COMPETITIVE. 5. BUILD THE MILITARY...6. IMMEDIATELY DEFEAT ISIS...7 SMART TRADE NOT JUST FREE TRADE WHICH BROKE THE COUNTRY..8. CUT TAXES FOR MIDDLE CLASS..9...TAX COMPANIES GOING OUTSIDE THE USA TO MANUFACTURE AND SELL HERE WITH NO PENALTY. 10. SMALLER GOVERNMENT, TRIM COSTS, AND WASTE. 11. PLACE CONSERVATIVE JUDGES ON SC...HE WILL NAME THE CHOICES BEFORE ELECTION 12. PRO LIFE...13.NO SALARY FOR HIMSELF 14. EDUCATION BACK TO THE STATES...NO MORE COMMON CORE...I GO ON BUT YOU NEED TO PAY ATTENTION AND STOP SPOUTING LIES....YES ONCE HE GETS IN...THE PENTAGON AND OTHERS WILL GIVE HIM INFO HE DOES NOT YET HAVE ACCESS TO...BECAUSE OF THAT NEW INFO, HE MAY HAVE TO ALTER THINGS SOME...THAT'S TRUE OF EVERY ...","commenter_a":"Yeah. Donny Trump and his lackeys DO NOT get to redefine what a conservative is. Many many real conservatives have fought hard, long battles over the decades to pull this nation back onto the constitutional rails advocating for founding principles. This fight has always been against politicians of the democrat party and republican establishment put there in part with Donny Trump donations. Where was Donny when some were standing tall against amnesty? Where was Donny when some were fighting Obamacare? Where was Donny when some were fighting to get Planned Parenthood defunded? Where was Donny when a certain someone was fighting the unconstitutional DC gun ban? Where was Donny when average citizens were having their homes confiscated by local governments so rich people could use them instead............... He was on the other side, or silent......because it didn't benefit him personally to be on the right side. Trumpers are for a ...","post_message":"Dana Loesch unloads: \"She made it personal first — I’m just doing it the Trump way: you come at me, I’ll come back at you three times as hard. You like it now?\""},{"comment_id":"1736894583244313","commenter_b":"Jenny Fabbri Some of the images leaves much to be desired. Efforts are commended.","commenter_a":"Good, but they cannot do same for migrants?","post_message":"Awww... some amazing footage of a kitten revived by Italian coastguard's kiss of life..."}]
