[{"comment_id":"1811899142196174","commenter_b":"Then honey you an your country will be taken over. Woman you have made that country weak.","commenter_a":"Turn the other cheek!! Weakness will not be seen as strength by Muslims! They will eventually control and rule Germany! She is a liberal nut job and her options are few at this point! Damage is done!","post_message":"The insanity continues..."},{"comment_id":"1143835818981314","commenter_b":"I love the books. I have them all except the 3rd one.","commenter_a":"Tell them to send to the literacy centers ,people will buy them from the literacy centers to keep them running or they can build a literacy in the U.K. for the people there.","post_message":"A charity bookshop in Wales is begging people to stop donating \"Fifty Shades of Grey\" after becoming overwhelmed with hundreds of copies of E.L James' steamy novel."},{"comment_id":"10153467954429714","commenter_b":"Haha this old lady needs to grow up u to old to understand ur backwards ways","commenter_a":"Down with haters","post_message":"The clash sparked a battle that pitted school administrators against students during the last week of the school year."},{"comment_id":"10153560993130667","commenter_b":"Sounds like Hellen Hollands is just a plain old witch to me.","commenter_a":"This school and school district should be ashamed of themselves. This young man left school in order to live - to SAVE HIS LIFE. He deserves every single thing that graduation affords, other than his actual diploma (which he will receive in December). I'm guessing there is no graduation ceremony in December, so he gets no graduation? School systems across America are failing their students every single day. Rules are made to be broken, changed or given a pass","post_message":"\"I never asked to receive a diploma and am even okay with not walking across that stage or having my name called. I just want to be a part of the ceremony.\""},{"comment_id":"10153963573598984","commenter_b":"Disgusting stupid females that believe that has brevetted mine","commenter_a":"And this is not their idea of hell a place of lust","post_message":"This Muslim cleric realized that female suicide bombers don't have a whole lot of use for 72 virgins... so he came up with his own reward for these \"martyrs.\" It's even more disgusting than you think it is, too."},{"comment_id":"1152899144750942","commenter_b":"She should be more scared of her elder rapists.","commenter_a":"I have this theory that if he wins, at his coronation hes gonna start his speech by saying he doesnt want to be president he just wanted to prove how racist and bigoted people in this country are by going out saying ignorant shit on all levels and poor rednecks eat it up. I mean seriously if people really think trump would be good for America those are the people that are wrong for America. You can spend all day polishing a turd but at the end of day hes still a piece of shit. All the anti muslim shit he spews with all his rich muslim buddies. He has hotels and other businesses in multiple muslim countries are we supposed to ignore that or what.","post_message":"They let her know, in no uncertain terms, that they have her back. - Eric March"},{"comment_id":"10154376259328797","commenter_b":"Trust and believe it's lot more white women chasing black men. Even the ones that fool you into thinking they don't. What I see in the backroom of my job is hilarious! Then they go home and kiss their racist white husbands and little bundles of joy. lol","commenter_a":"A group of disgusting tramps that will suck a black man dry.","post_message":"OFFENSIVE PHOTO: A school district is taking disciplinary action after a photo of students spelling out a racial slur with T-shirts showed up on social media."}]
