[{"comment_id":"10154608110303701","commenter_b":"She's a real winner. Just block her idiot ass.","commenter_a":"Good hes a pos","post_message":"A Sherwood man is being charged with manslaughter for a crash that killed a 2-year-old in Deschutes County, according to police."},{"comment_id":"10153881231351800","commenter_b":"Rubio is for granting amnesty for all these illeagals. Sorry we don't need rubio or his muslim immigrants.","commenter_a":"I would much rather see Rubio get the nomination instead of Chump Trump or Crazy Cruz...they are both psychos.","post_message":"Marco Rubio claims he's a GOP underdog because of his fancy boots, but Trevor thinks it might be something else. @webpagelink"},{"comment_id":"1811899142196174","commenter_b":"Then honey you an your country will be taken over. Woman you have made that country weak.","commenter_a":"Turn the other cheek!! Weakness will not be seen as strength by Muslims! They will eventually control and rule Germany! She is a liberal nut job and her options are few at this point! Damage is done!","post_message":"The insanity continues..."},{"comment_id":"10154941514794062","commenter_b":"Say what you like.. Hoe, no talent.. Her bank account says otherwise. Carry on","commenter_a":"The only fame she has is singing with her legs apart and if it wasn't for that she wouldn't have any fans.","post_message":"Good news for Beyonce fans!"},{"comment_id":"1362231057136004","commenter_b":"Why should prayer bother an atheist? Bc deep down they know that God is real.","commenter_a":"Keep standing up for God, no matter what anyone says.","post_message":""},{"comment_id":"10154534719475695","commenter_b":"She should of just kept her mouth closed. #LessonLearned","commenter_a":"Good!","post_message":"Her employer and Miss Alabama pageant organizers are responding to the video, watched by 600,000 people."},{"comment_id":"1207405515987329","commenter_b":"HappyBirthday, Sir, \"It's one more candle and a trip around the sun\" !","commenter_a":"Happy Birthday Dr. Carson!!!","post_message":"#keepcalm"}]
