[{"comment_id":"1457021290993798","commenter_b":"Bullshit they need to put her ass in prison","commenter_a":"jesse doesn't want her next to him at the gallows","post_message":"But, but...I thought she was innocent, Jesse?"},{"comment_id":"10153413521069255","commenter_b":"Loose lips sink ships.","commenter_a":"Santorum doesn't even know that the Pope is in fact a scientist! He is a chemist! Santorum is the idiot!","post_message":"Yes. That Rick Santorum said that."},{"comment_id":"10152954324555399","commenter_b":"Well, they're not mutually exclusive qualities. A weasel can both **** others and have harmful effects, especially the more gradual and subtle kind.","commenter_a":"McConnell is a pernicious weasel. Reid will get even.","post_message":"An extraordinary act of trolling:"},{"comment_id":"10153117785839440","commenter_b":"close your trap you negative nancy!","commenter_a":"Who cares- nuggets are less than irrelevant.","post_message":"Denver Nuggets selected Emmanuel Mudiay with seventh pick of the NBA Draft @webpagelink"},{"comment_id":"10153227996393812","commenter_b":"And feminazis want to be equal. Smfh","commenter_a":"Men can be abused too...","post_message":"\"Why is it so hard to see black and blue?\" #TheDress being used to fight back against domestic violence: @webpagelink"},{"comment_id":"10154846980595575","commenter_b":"Only thing to say is, the political don't really give a rats as about our country or its people unless the are profiting from it.only Americans that care will change this type of bulls hit .America infrastructure is need of desired repairs. Let's take care of America before refugees","commenter_a":"There should be no money sent to this governor who chose to use the money for criminal reasons. You just can't do that!","post_message":"Instead of fixing the dam, Gov. Brown spent $25 billion per year on illegals!"},{"comment_id":"10156296694950293","commenter_b":"If all the grandkids reproduce themselves it could happen.","commenter_a":"The will be you soon @username","post_message":"A sweet story this morning. A grandmother hangs nearly 70 stockings on her wall every Christmas. Tell us about the traditions your family has!"}]
