[{"comment_id":"922742544437395","commenter_b":"It's not so much stupid and idiocy as it is vicious.","commenter_a":"Mississippi. Period. Point Blank. (sorry to paint with such a broad brush, but.............)","post_message":"This racist needs to be fired now. Sign the petition to have him removed from office: @webpagelink"},{"comment_id":"10152969196420796","commenter_b":"So?!","commenter_a":"I am very pleased not to be surrounded by poorly educated, I'll healthed, no skilled illegals and newly landed muslims. Maine people do well to care for Our own. Let the world work it out. America is not a dumping for human trash. Coe with skills and be ready to fly our flag, defend our Constitution, and become a citizen.","post_message":"The state's current demographics resemble what the rest of the country used to look like. In 1940."},{"comment_id":"10154402940891636","commenter_b":"Americans with guns are more of a threat than any other nation, must loose more lives with kids and their \"toys\"","commenter_a":"If he'd spent the $trillions he'd wasted on wars on so-called 'Climate Change' instead, then im sure the world would've been closer to 'normality' by now, but no, 8 solid years of bombs in the Middle-East is what you get. Why thank him for this, its given us EU terrorism.!!","post_message":"Hero"},{"comment_id":"1658752774184464","commenter_b":"Have you bothered -- of course you have not -- to realize the amount of business your new Fueher is doing in these very same countries? And continues to do so? At this moment anything HRC did is irrelevant.","commenter_a":"The Clinton Foundation accepts donations from the Saudi Arabian Royal family, who have had hundreds of people hung for being gay. But these moron Hillary supporters either don't know it or they're just willfully ignorant","post_message":"'I fully support Hamilton: An American Musical cast taking Mike Pence to task over equality, but..."},{"comment_id":"10153196392273984","commenter_b":"Hey Stupid! Thanksgiving is a day of thanks not a stupid holiday for your illegals and muslin buddies. Let it be! Stop destroying this country.","commenter_a":"Can we get rid of him, NOW!! Outrage doesn't even begin to describe this!! Leave things be!!","post_message":"Unbelievable. There's no way Americans are going to stand for this... Are you outraged?"},{"comment_id":"10155358304877439","commenter_b":"Think someone must be shitting they're pants cause this brave WOMAN is gonna sort the RATS out..😂😂😂","commenter_a":"This is a threat. He should be arrested and jailed.","post_message":"A 24-year-old Muslim blogger and so-called human rights activists has called for the slitting of France's Marine Le Pen for her conservative political views."},{"comment_id":"1538307646229359","commenter_b":"Let it burn ...what a dumb bitch...","commenter_a":"Let's see how that works out!","post_message":"What do you think?"}]
