[{"comment_id":"10153102217682994","commenter_b":"Thugs","commenter_a":"Thugs","post_message":"Authorities say a modern-day 'Bonnie and Clyde' situation is unfolding in the Southeast right now."},{"comment_id":"10157481563535354","commenter_b":"Silly Rabbit illegals can't and most don't want to vote or do anything to bring attention to themselves....try again!","commenter_a":"Did anyone else notice that Bill Clinton basically told illegal aliens to vote for Hillary in his speech?","post_message":"Bill Clinton's Big Bomb of a #DNC Speech was SO bad, Even Progressive MSNBC Host Rachel Maddow is TRASHING it... WATCH:"},{"comment_id":"1268015386628044","commenter_b":"An ex Democrat here that doesn't believe her lies. And neither does 90% of our Democratic Charter making up close to 3000 people. We are NOT voting for Hillary Clinton. The DNC should have let the election alone. You won't hear about it in the media or see it in the polls but MANY Democrats are pissed off at their party for rigging the election for Mrs. Clinton. I hear what's going on from the ground floor in the Democratic Party and from my calculations close to 30% of Democrats are not voting for her nationwide.... They are desperately trying to get us on board but it is not going to happen. The Democratic Party is falling apart and you won't hear about it from a single news source. She will have the \"always vote blue\" votes and that is it. The Clinton campaign and the DNC have even sent ...","commenter_a":"The democrats feelings get hurt from a said word or two. Lying Hillary can insult their intelligence by lying to their faces for 40 years and they are completely ok with it. Makes you question their intelligences.","post_message":"Hillary Clinton and Donald J. Trump are tied in South Carolina according to new polling. Rachel Maddow breaks down the surprising development. More analysis on the latest polling from The Rachel Maddow Show: @webpagelink"},{"comment_id":"10154264837836130","commenter_b":"No she isnt spitting fire..she is comng off as a wimp","commenter_a":"Living in reality is not at all something conservatives are known for.","post_message":"Hillary Clinton spitting fire. 🔥"},{"comment_id":"10154246766848797","commenter_b":"Denise unfortunately this is what your kid will probably end up doing! And you're beyond IGNORANT & clueless lady btw!!!!","commenter_a":"Black on black. Stop. We have to fight murder from the pd, ourselves, institutional genocide. Proverty. Racism. Chicago public schools. Residuals of enslavement. We are protesting all day and everyday.","post_message":"TUESDAY VIOLENCE: Five people were injured in shootings Tuesday on the South Side. Most recently, two teenage boys were shot in the Englewood neighborhood."},{"comment_id":"10154383392767894","commenter_b":"These two witches are beholding to special interests!!! Drain the swamp!!!!","commenter_a":"did not help ...","post_message":"These two Republican senators voted against Betsy DeVos."},{"comment_id":"10153206942041509","commenter_b":"F that Benghazi btch !","commenter_a":"Hillary Clinton 2016!..:)","post_message":"Will we see another President Bush? Jeb Bush's father and brother have both served as president. @webpagelink"}]
