[{"comment_id":"10153593708856770","commenter_b":"#TRUMPorTAXREVOLT #BOYCOTTAMAZON #TRYCLINTONFORTREASON #TRYOBAMAFORTREASON #REMOVERYAN #REMOVEPELOSI #AUDITTHEIRS #DISENGAGEWITHTHEUN #DISENGAGENATO #DISBANDTHEELECTORALCOLLEGE #INSTITUTEPOPULARVOTE #HOLDMEDIAACCOUNTABLE #IMPOSETERMLIMITS #VETERANSB4ILLEGALS #BANISLAM #UPHOLDTHECONSTITUTION #REVERSEALLOBAMAORDERS #ARRESTSOROSFORINTERNATIONALTERRORISM #WORKFARE #NOCITIZENSHIPNOVOTE #KILLCOMMONCORE #PURGETHEGOP","commenter_a":"The Muslim Brotherhood government in Egypt CRUCIFIED CHRISTIANS IN DOWNTOWN CAIRO--and they remained Obama's favored government. After the Egyptian people threw them out, Obama continues to consider the Muslim Brotherhood the legitimate rulers of Egypt.","post_message":"The Obama administration’s disappointment with the U.K.'s Brexit contrasts sharply with its celebration of the Muslim Brotherhood’s election in 2012."},{"comment_id":"10154414829691051","commenter_b":"You've been programed on 30 years of BULLSHIT that has not stuck, she's not perfect no politician is but to have this mfer win is just off the fucking charts people will suffer from this including me but these racist mfers will suffer a rath of bs way worse when Gw was in office.","commenter_a":"I think it's a good thing. I honestly don't think that America would have a problem with a Female President, I just don't think that America wants Hillary Clinton to be that First Female President. She's got a rough track record, a record that has a lot of corruption and lies written upon said track record, and the American people see that. She's done a lot of great things in her life, but alas, being President will not be one of them.","post_message":"It looks like Hillary Clinton is done with politics for good. Is that good or sad news to you?"},{"comment_id":"948719421835197","commenter_b":"naw, the generation of things now being exposed more like it","commenter_a":"The generation of no personal responsibility.","post_message":"If this tactic works, we're a sicker country than I could have ever imagined."},{"comment_id":"736524969871414","commenter_b":"True she needs to sit down some where and just grow old. If they don't put her in jail.","commenter_a":"I had been wondering about Hillary and her health. I was just thinking today what if Hillary should get sick if she's in office. Woman have a tendency to become ill as we get older. Has had her menopausal years. Hell because when I get sick I don't want to be bothered by nobody. I don't think Hillary would able to handle this president stuff. Not that we don't want her to be president I really don't think she would make it. Stress on a woman is not good. It triggers other types of sicknesses. I know about that stress. I had to quit a job because of stress. I was so damn stressed out I came down with hyperthyroidism that made me lose 94 lbs in one month. Due to stress. My doctor made me quit my job or die. And I had been wondering about Hillary Clinton. She's ...","post_message":"BREAKING: Hillary Clinton's Health In Jeopardy... Campaign Could Be Over Either way she was never fit to be president. She should retire early. Can we get 30,000 'LIKES' to have Hillary drop out of the race?"},{"comment_id":"10152670445845927","commenter_b":"Give that money to the Border Patrol, and arm them to convince aids-ridden latinos to stay on their side of the fence !","commenter_a":"Sick! No matter how sinful humans try to avoid the consequences of this horrible sin, God's word (Romans 1:26,27) assures that they will receive in their bodies the automatic payment for their wrong. God doesn't lie and He never fails.","post_message":"The study is to find the best ways to convince gay Latino men to wear condoms and get tested for HIV."},{"comment_id":"1341308765907356","commenter_b":"Al Franken was a terrible comedian and an even worse senator. What a worthless piece of crap!","commenter_a":"Ouch!","post_message":"Stuart Smalley never had a chance."},{"comment_id":"10155187593643352","commenter_b":"Women do the same thing every day...I'm happy for these guys...lol","commenter_a":"He need a damn job like Mary j blidge husband. They some damn bums","post_message":"Do you believe this? Lamar Sally is taking Sherri Shepherd back to court for an additional $75,000 on top of the $4,100 in child support she already gives him every month. What is he smoking? ----> @webpagelink"}]
