[{"comment_id":"1027758113945859","commenter_b":"What a bunch of liberal pussies you all are.....keep smoking that pot and living in your mom's basement LOL","commenter_a":"I love you Bernie!","post_message":"In just a few days, voters across New York will make their choice for the presidential nomination on Tuesday, April 19. The entire country will be watching as the results come in. And with your help, New York will send a profound message to the political and economic establishment in this country. That's why we're asking you to commit to vote for Bernie."},{"comment_id":"10154223685116409","commenter_b":"@username it is what it is, he is president elect, I did not vote for him but we always need to see the bright side of things.","commenter_a":"Everyone should give him a try, ACA is unaffordable for middle class families.","post_message":""},{"comment_id":"1204291722963907","commenter_b":"and as I assume the majority of their passengers are muslims - then they are providing them information that they require - AND - is harmless","commenter_a":"What kind of prayer? I've flown Royal Brunei Airways twice so far. Before the plane takes off, a Muslim prayer ist shown on the monitors and during the flight the direction towards Mekka is shown and not the plane's position!","post_message":"A passenger saw a WhatsApp message about 'prayer' and feared he was a terrorist"},{"comment_id":"10156578303710354","commenter_b":"Bill's actions are not the real issue ... how Hillary victimized Bill's victims is the real issue. Bill abused women, Hillary declared war on the women Bill abused.","commenter_a":"Hillary knew about bill and his abuse","post_message":"Silence, peasant!"},{"comment_id":"536032629890369","commenter_b":"suck a dick","commenter_a":"@username du o daniel","post_message":"Piper the abandoned pig has a new home and a new best mate (via The Dodo)"},{"comment_id":"10152700445176051","commenter_b":"Another snobby bitch","commenter_a":"You guys are all assholes siding with the trailer woman... There goes the neighborhood ... These answers talk about what has happened to the country... If you want to live in a trashy neighborhood, move to one. Don't trash up the one you are in due to your own selfishness...","post_message":"When this woman saw a note one of her neighbors left for her, she couldn’t believe it."},{"comment_id":"10157037705625725","commenter_b":"@username ILLEGALS","commenter_a":"This legal Latino is voting for Trump! Like if Donald Trump has revived your patriotism and faith in your country!","post_message":"We need strong borders to keep our country safe!"}]
