[{"comment_id":"963311450392051","commenter_b":"WILL MR. TRUMP STAY AHEAD ?! - @webpagelink","commenter_a":"Iiar liar pantsuit on fire.","post_message":"Hillary has been a champion for everyday families her whole life. That's why she's running for president."},{"comment_id":"10153229988242293","commenter_b":"And who would that lady be? Certainly not this four times married adulterous who're?","commenter_a":"It takes lady to show the world what TRUE VALUES are; and how STAND UP in those VALUES ...!!","post_message":"Kim Davis entered the Carter County Detention Center under cover of night five days ago. She emerged to Survivor’s “Eye of the Tiger.”"},{"comment_id":"1113532561997426","commenter_b":"@username you are dumb idiot. W. Bush was the want that gave the tax break to the richest and the big corporations. Do you think that the MF Republica will go along with that, has much they hate like you the President. Went you moron , stupid and idiot use the word SOCIALISM find first the meaning of that word MORON. THE LUCKY ONE IS THAT MF BUSH THAT SEND OUR KIDS TO BE KILL FOR HIS GREED. BUSH NEED NOT THE BE IN JAIL , NO BE PUT IN THE ELECTRY CHAIR, TOGETHER WITH CHENEY AND HIS ADMINISTRATION.","commenter_a":"More for the rich..less for the poor..thanks a lot.","post_message":""},{"comment_id":"1159055580820855","commenter_b":"China Eddie, we western women have a CHOICE to wear what we want when we want, unlike you poor suckerers who must obay. You poor poor deluded fools.","commenter_a":"Islam will reform when they relinquish women from its oppression","post_message":"Mothers and wives pose in the embroidered boreghehs that some start wearing from the age of nine"},{"comment_id":"10156022193165294","commenter_b":"That's incredible o be married that long. Now people marry 15-20 years and that's it. I hope to live this long and still have my husband around. This is what young couples should be using as example, If you can be married that long, theres nothing that can break you!","commenter_a":"Many yrs ago my grandparents were in same room at the hospital though, normally its two female or two male in ea room . It is very nice to keep them together.","post_message":"\"Because they were on the orthopedic surgical floor, none of those rooms have double occupancy so they couldn’t be together, and it was clearly breaking their hearts.”"},{"comment_id":"788324967967350","commenter_b":"When all is over and you. Round up the clowns for arrest make sure you get this bimbo she cared nothing about any of us","commenter_a":"I agree idiocy speaks for itself.","post_message":"I can't believe this.....I knew they were stupid but stupid and dangerous?!? COME ON."},{"comment_id":"1215472705166021","commenter_b":"No, slutty women are.","commenter_a":"I wonder how many these so called rape or incest abortions our taxes go to are really that or women lying. I'm sure planned slaughterhood and other abortion providers don't perform parternity tests.","post_message":"Like and Share if you agree!"}]
