[{"comment_id":"10157833652505615","commenter_b":"I think it's really stupid to be laughing at someone trying pretty much entirely on her own to recount an election everyone agrees was not by the book. When calling this election \"not by the book\" is a gross understatement. Forcing recounts in some critical swing states in a situation where the electoral vote and popular vote are completely different is a reasonable endeavor. What's absurd is how much of the establishment is willing to lie back and let this thing happen, then assure us in the same breath nothing truly terrible will come out of this administration because the establishment will prevent it. Actions speak louder than words, and the inaction of pretty much everyone other than Stein, Sanders, and Warren speaks volumes.","commenter_a":"Jill Stein, election spoiler, is going to put that money raised in her own pocket to pay her expenses.","post_message":"This Just In – Just a few hours til deadline..."},{"comment_id":"10153243499636336","commenter_b":"We definitely need a Godly man in the White House. I thank God for him.","commenter_a":"Amen, Dr. Ben!","post_message":"Did you know? Presidential candidate Dr. Ben Carson, a retired neurosurgeon, revealed on Fox & Friends this morning why he prayed before every surgery."},{"comment_id":"10153228787618984","commenter_b":"Well he still did his job get unlicensed uninsured drivers off the streets. They are a huge reason insurance prices are so dam high. Besides Mexicans from across the boarder are becoming the majority especially in states like Arizona!! I'd vote for Sheriff Joe every day of the week and twice on Sunday.","commenter_a":"More LE needs to do that to rid America of the damn illegals","post_message":"I cannot believe he admitted this. Liberals will be giddy. He'll really need his supporters to step up now... Do you still support Sheriff Joe Arpaio?"},{"comment_id":"962607787132303","commenter_b":"I am a Turkish citizen, as well as a British,! all our cities, streets and everywhere in Turkish borders are full of Syrians.. More than 2.5 million people officialy! Isn't that enough?? You still call yourself\"human\"?? We are sharing our bread and shelters with them. What about you? When it comes to talking about peace and human rights, you are the best, huh?Act now! It's the right time! Or do you prefer watching this American film on vision in your comfy sofas forever??? Barry in mind! ISIS is USA, UK, and IS'REAL terrorist organisation!!! They r the ones! Making, and forcing them to die or leave their homes.!! Then UK, USA, and IS'REAL terrorist organisations can get an easy access to their recourses, gold, diamond, oil, and gas.!!!! You both got it!!!","commenter_a":"If the EU keep housing them they will keep coming and is only going to make the problem worse. If they really wanted safety then they would have stayed in Muslim Turkey. They are all out for the benefits that get lavished on them. You cant blame them and most people would do the same.","post_message":"Bikinis, sun loungers ... and a tide of despair"},{"comment_id":"1213366555426261","commenter_b":"More illegals equates to more democratic votes due to the dreams of entitlements and riches. Look at California (seems to start on the west coast), they are making it as easy as they can to give illegals the opportunity to vote...they even have a few illegals in city government! More democratic votes keep Dems in power, which means more taxes from the middle class which eventually places people closer to poverty...which places more government control over it's citizens...Hence the \"Democratic Agenda\". That \"Agenda\" puts us that much closer to the \"New World Order\"!!! Guess who would be the leaders of the \"New World Order\"?","commenter_a":"#TrumpOnTrumpingOn2016! BREAKING NEWS: \"Reince Priebus, Paul Ryan, Karl Rove, Stealing RNC Donation Money\"! ~ Hon. Roger Stone","post_message":"A country that for generations saw millions of its citizens cross into the U.S. is suddenly telling its southern neighbors they can no longer do the same."},{"comment_id":"535892949940559","commenter_b":"Courtney Stark can we do this with apple juice? Cara Jean Stark you can do it with Busch light","commenter_a":"Oh Stephen Conley","post_message":"BRILLIANT."},{"comment_id":"488963091300703","commenter_b":"Amen and Amen. If you have no respect for our country then stay out. I believe in freedom but don't come over here trying to change this country into the country you left. If your country was so great then why did you leave?","commenter_a":"I see no problem in this","post_message":"What do you think of Donald J. Trump's plan to combat terrorism? @webpagelink"}]
