[{"comment_id":"714217398680845","commenter_b":"Kill all the bad muslims!!","commenter_a":"Muslim POS","post_message":"And he's wasting no time launching his attack..."},{"comment_id":"959266487466433","commenter_b":"O girls have brains too?","commenter_a":"Only frustrated sick person can prefer physical fearure otherwise normal and true men appreciate beauty with brain","post_message":"Men care more about a woman’s brains than her bust, allegedly"},{"comment_id":"499497803543925","commenter_b":"That shady bitch, I would never go to her freaking dinner!","commenter_a":"Thank You patty for doing the right thing .","post_message":"Patti LaBelle Finally Admits James Wright Chanel’s Video Increased Pie Sales, Invites Him to Thanksgiving Dinner [Video]"},{"comment_id":"10153738689479032","commenter_b":"Thanks to those who muck it up for other people. Your stupidity is so appreciated. Stop breeding too.","commenter_a":"Maribel Maldonado","post_message":"Visiting Fossil Creek? As of May 1, you need a permit. @webpagelink"},{"comment_id":"10153152736641955","commenter_b":"Who was her IASO? Who was responsible for patching and maintenance? Who setup the firewalls and data encryption? Put this bitch in jail!!","commenter_a":"U can still, get it back.","post_message":"HILLARY 'WIPED HER SERVER CLEAN'"},{"comment_id":"10154391312414614","commenter_b":"I think these pro illegals group should pay the billions it's costing Americans, show their support that way......","commenter_a":"Annndd I don't care.","post_message":"\"We wanted to point out that while he seems to think he can say what he likes in one place and not hear about it elsewhere, he is wrong,\" said one Scottish protester, referring to Trump's controversial comments about Mexican immigrants. point of the flag is to show solidarity with the Mexicans and every other group that Trump has decried, derided, insulted and tried to marginalize, said David Milne, a member of the Tripping Up Trump campaign."},{"comment_id":"10150862298954999","commenter_b":"Hillary is the devil!","commenter_a":"Anyone who supports Trump, the human pile of fecal matter, at this point is also a human pile of fecal matter. Vote Hillary, Johnson, Stein, or write in Jesus for all I care, but for the love of all that is good and holy, do not vote for Trump.","post_message":"“I’m not going to relax,\" Christine Quinn told Donald J. Trump's former campaign manager. \"Because we have a man running for president of the United States who made a gold star mother have to go on TV and cry in front of America. This isn’t about politics——\""}]
