[{"comment_id":"1027408730682076","commenter_b":"She is so stupid","commenter_a":"Ur one dumb B****!!!!!!","post_message":"@webpagelink"},{"comment_id":"964740956976016","commenter_b":"I am glad to see someone else that sees what is happening. Right now there are 76k Islamic refugees that have arrived and continue to come. Barack Husein Obama has strategically placed them throughout the U.S. Now ask yourself, how long will it take before key cities fall to Islam within the U.S..? He knew what he was doing, and his plan is working due to tolerance and bleeding heart liberals. It may not be next year, however, in the near future, we will see more turmoil through Islam than anything else. Bullets and beans brother...","commenter_a":"Notice that the UN is NOT pushing to fight Muslim extremists so these people don't have to flee their homes? That they're trying to export them around the World instead? The reason is OBVIOUS. To create chaos and bring down western culture. Look at France and Germany's problems with the bastards..","post_message":"That was a ... BAD idea. Check it out. @webpagelink"},{"comment_id":"10153071601427434","commenter_b":"Some black women are hot","commenter_a":"You KNOW it was provable, terrible, and criminal when the nearly all white, all male jury found him guilty. Even they were horrified enough.","post_message":"A jury has found Daniel Holtzclaw guilty on 18 of the 36 charges he faced for allegedly assaulting at least 13 black women. He faces up to 263 years in prison."},{"comment_id":"10153189234471491","commenter_b":"I still want my coke 0. Gitty up !!!","commenter_a":"Hahaha! European countries welcoming muslim refugees beware! In a few years time......","post_message":"She filed a discrimination complaint."},{"comment_id":"685959174927994","commenter_b":"No!!! Piss off bitch!!!","commenter_a":"Absolutely not , you moved to America to benefit from American ways of life and you're participating in the American justice system , and you expect to be changed just for you . I don't think so . You shouldn't even be allowed into the court house let alone the court room for reasons of security .","post_message":"This judge just made a controversial decision... Great. We support this judge 100%. Should this woman be allowed to swear on the Quran?"},{"comment_id":"10153073313318445","commenter_b":"The queen only has a cheeky one tho!","commenter_a":"Come on America if the queen can have it. Why can't we?","post_message":"UK's First #Cannabis Pharmacy Opens in London!"},{"comment_id":"10154194875640009","commenter_b":"This woman is a black retard, like the retarded black guy that was standing behind her when she spoke about the Kremlin invading KOREA. You let goofballs like this in a leadership position, you'll get a 3rd world country.","commenter_a":"the poor that is","post_message":"ICYMI"}]
