[{"comment_id":"1354102041270105","commenter_b":"BUILD THAT WALL!!!!!!!","commenter_a":"The racist bigots Trump supporters would love as many Mexican families as possible to die. Pretty sad! That's why I'm with her!!","post_message":"A son migrated to the U.S. from Mexico, to help his parents survive by sending back money. But part of Donald J. Trump's immigration policy could threaten that support, and the lifeline of an entire town. (In a statement to CNN, the Trump campaign maintains building a wall is the right solution, but did not address money transfers directly.)"},{"comment_id":"10154776227370399","commenter_b":"Listen to all the cry baby's all the little bitches are just jealous because they don't have what she has and besides it don't make a damn if her daddy gave it to her. So just shut the fuck up","commenter_a":"It's called Democracy. Don't like a company, don't buy it. It's evident large companies want to distance themselves from tRump and his administration.","post_message":"\"If Ivanka were anyone else’s daughter, she would be praised as a trailblazer.\""},{"comment_id":"740770189446892","commenter_b":"Close all the borders already!!! Damn Obama!!","commenter_a":"Hang that Mo**ey!","post_message":"BREAKING: Muslim Teen Refugee Charged With Murder For Beating 97 Yr Old WWII Veteran To Death This is what happens if we let refugees into our country. This needs to stop. Do you agree we should close our borders?"},{"comment_id":"1294378153962270","commenter_b":"Look in the mirror bitch","commenter_a":"I aint spending no money on this hoes lmao","post_message":"Blac Youngsta claims none of the strippers looked good! #WSHH #BlacYoungsta"},{"comment_id":"255446914877983","commenter_b":"Criminal News Network or Crooked News Network is full of nothing but whiny ass snowflake safety pin wearing nutjob crybabies. #TRUMPWON #MAKEAMERICAGREATAGAIN #DEALWITHIT #SORELOSERS","commenter_a":"It's a ban. He knows it we know it. But that doesn't stop him from spinning the Don's con.","post_message":"CNN just proved that Trump is LYING when he says he’s not banning Muslims. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"1820054648241595","commenter_b":"I agree the farther him an his tranny wife are from the white house the better !","commenter_a":"What is wrong with you people. Thank God he's on vacation and not going to get involved and make things worse!","post_message":"Nothing gets in the way of Barack Obama's golf game."},{"comment_id":"10153676761856623","commenter_b":"I just don't understand how people would want to vote for this lying deceitful person with a terrible plot up her sleeve! She is a lying snake! Now I'm not saying a support trump either but this lady is just flat out terrible!","commenter_a":"I also keep two calendars, one for business one for personal stuff.","post_message":"Hillary Clinton kept two calendars when she was secretary of state — one for the public, but another that included meetings with political donors and loyalists, Wall Street bankers and Clinton Foundation contributors."}]
