[{"comment_id":"10154159417163797","commenter_b":"Y u hating? Stop trippin & stop actin like a jealous punk. Man, sometimes these women can be straight up fools and want to try ruin something that is a gift for a couple that wanted something so bad and finally god gave that gift. Ezella, being a punk gets u nowhere. Shut up and complain about ur own life princess if u wanna be such a negative Nancy","commenter_a":"He's not crying because he's happy, he's crying because that's his 9th kid & he already owes 30k in arrears. 😈😼🙈🙉🙊","post_message":"TEARS OF JOY: A video of a man bursting into tears when he learns his wife is pregnant is warming hearts all over the Internet. Watch Here:"},{"comment_id":"10153310967161756","commenter_b":"Yes, yes I am. Suck it!","commenter_a":"Maybe but you get to tell everyone you're a vegan within 10 seconds of meeting them.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."},{"comment_id":"1916311915262611","commenter_b":"Wrong country? Or city? Please, do not behave yourselves wiser than Asians or Muslims. It's a sin. We have to love each nation regardless their colour, religion, geographic location.","commenter_a":"Pithy Vann that sucks","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"10153782445088984","commenter_b":"Interesting that this is the same city where the Muslims tried to impose Sharia law and got shut down by the mayor, a woman at that!","commenter_a":"This whole thing looks like it was aset up from the beginning, but too many people are jumping to conclusions before the facts are out ...","post_message":"The mayor of Irving, Texas -- the home of the Muslim \"bomb-clock\" boy -- just came forward with a shocking statement about the boy and his family. What she revealed shows exactly what's going on here. This was a setup from the first, and this mayor refuses to stay quiet about it. She needs our support."},{"comment_id":"10153114544546943","commenter_b":"Charge her with something!","commenter_a":"Hilliary has blood of our soldiers on her hands","post_message":" Obama administration including Hillary Clinton and Susan Rice knew immediately that the Benghazi attack was a terrorist attack. The State Department new smoking gun documents put to rest any question about what Hillary Clinton and Susan Rice knew and when they knew it, said Judicial Watch President Tom Fitton. minutes of the attack, the administration, specifically Hillary Clinton, began lying to the American people by blaming an obscure Internet video. No wonder Hillary Clinton is the great destroyer of State Department emails. One can assume that Mrs. Clinton would not have stolen and destroyed emails in violation of law and various court orders if she didn have something to hide. And it shouldn take a federal court order to find out that Hillary Clinton evidently had no clue how the State Department and the FBI responded to terrorist attacks on State Department personnel."},{"comment_id":"1091887850889750","commenter_b":"She is a POS racist cluck bum bitch and NFL you Scumbag should give all the ticket holders half their money back","commenter_a":"What about the planners of NFL Super Bowl did they not know what her performance was about there's a little bit more to blame then just solely on Beyonce. The Super Bowl planners NFL new what hurts halftime show was about was not announced or advertised of being such as low blow off base nutcase to let it going on so take that NFL maybe you should pay attention what's going on around you to","post_message":"Last weekend Beyonce got to have her racist fun at the Super Bowl. But now she's gotten some massive bad news. Looks like you can't go off and support cop killers without having to pay a big price later on. Boom!"},{"comment_id":"1250167005050052","commenter_b":"Fuckgirls. Yep.","commenter_a":"Aja can fuck girls be one word? Lmao","post_message":"Let us know! #2016 #WSHH"}]
