[{"comment_id":"572733119579689","commenter_b":"Yeah you gotta be a useless bitch to waste time on Amazon digging these shit custom up for a fucking baby.. NO NOT ME","commenter_a":"@username gotta do this to the baby 😂😂","post_message":"I just grew ovaries and they just exploded."},{"comment_id":"10153420675841162","commenter_b":"They should be out in the wild with their mom","commenter_a":"Michelle Papandrea","post_message":"ADORABLE! Take a look at the latest arrival at Metro Richmond Zoo in Virginia: 3 cheetah cubs..@webpagelink PHOTOS: @webpagelink"},{"comment_id":"990509770989495","commenter_b":"Any organization with 200,00members is not a church.","commenter_a":"This is what gives religion a bad name.","post_message":"Did Jesus Christ need a private jet to spread his word?"},{"comment_id":"10153225010746833","commenter_b":"These people should be tarred and feathered.","commenter_a":"This is what the liberals want.","post_message":" of New Jersey, warns Gordon VanGilder. The retired schoolteacher is the latest to fall victim to the Garden State gun laws the 72-year-old is facing up to 10 years in prison for having an antique flintlock pistol in his car. In this exclusive report, his attorney notes that VanGilder is facing the same felony charge for his unloaded mid-1700s firearm as he would be for a loaded .44 Magnum. is overreach, for sure, says VanGilder. @webpagelink"},{"comment_id":"10153945644022061","commenter_b":"@username because the wife wouldn't lie right?","commenter_a":"Speak children...\"Out of the mouths of babes!!! All of the racist and fearful cops should be out of the streets and sitting behind a desk (not having to deal with the public). A lack of respect is found in all groups of people and that still is not an excuse to slaughter a certain group. Americans kill, so should terrorists groups kill us??? Should animals attack people because they kill them for sport or make them zoo exhibits?","post_message":"TAKING A STAND: Kids of Charlotte spoke out at a city council meeting about their fear of the recent violence in their hometown: @webpagelink"},{"comment_id":"10153659617321323","commenter_b":"What about the kids, which is the entire point of the article?","commenter_a":"Just one big difference here. Kyle has asked for privacy, and presumably won't be going voluntarily onto TV shows to discuss his divorce. The people that appear on his show do so voluntarily, so are obviously less concerned about privacy for their issues. Stop trying to compare the two. Theirs no hypocracy here.","post_message":"\"What does Jeremy Kyle think is more likely: that a child’s parent or parents appearing on his show will constitute a mere 49 minutes in their childhood, or that its ripples will magnify that car-crash public event enormously – grotesquely – into something that cannot fail to be formative, and endlessly repercussive in its damage?\""},{"comment_id":"10158120208050557","commenter_b":"You attempting to make this about ME, so as to DISTRACT from the FACTS, TRUTH and REALITY, is a very \"cute\" little trick, implemented by YOU and so many others, who comment on this page.","commenter_a":"The PRICKTATOR's is at it again. If you're not concerned yet, you're either brain dead or a complete idiot.","post_message":"President Donald Trump fired acting Attorney General Sally Yates Monday night for refusing to enforce a legal order designed to protect the citizens of the United States, the White House said."}]
