[{"comment_id":"10153065116958984","commenter_b":"He does it for money, he don't give a damn about the Blacks on the street shooting there brothers and sisters or he would be here trying to straighten them out. But let a white or police officer doing the shooting and he will be there starting trouble. He is pregistist .","commenter_a":"This guy is a real Jackass","post_message":"Seriously Al? You must be joking... Is it about time for Al Sharpton to give it a rest?"},{"comment_id":"10154043300342577","commenter_b":"All women do!!","commenter_a":"is it just me, or has this woman got the most annoying voice in the world? I just wanna punch her in the face","post_message":"Hillary Clinton's Greatest Hits! Vol:1- infowars.com/show"},{"comment_id":"10153467954429714","commenter_b":"Haha this old lady needs to grow up u to old to understand ur backwards ways","commenter_a":"Down with haters","post_message":"The clash sparked a battle that pitted school administrators against students during the last week of the school year."},{"comment_id":"1528186400555160","commenter_b":"Thank you!","commenter_a":"THE FREEDOM OF THE PRESS is more basic to the RIGHTS of Americans than; the right to bear arms to defend. When the constitution was written it took two conventions to come up with ten amendments, BUT the first amendment was the same not changed and was readily adopted as others were still being picked and discussed. THE BILL OF RIGHTS Amendment I Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the PRESS; or the right of the people peaceably to assemble, and to petition the government for a redress of grievances","post_message":"Sean Hannity wants to destroy freedom of the press by punishing any news outlet that told the ugly truth about Donald Trump."},{"comment_id":"1195858527119048","commenter_b":"That is what we call \"seasons\" in Texas. LOL","commenter_a":"No it is not. Just look around us fire in one state floods in others and earthquakes in others lakes dying up and animals dying from bad water and no food.","post_message":"This is important."},{"comment_id":"10155295092495579","commenter_b":"Liar!","commenter_a":"Zero evidence that Russia had any influence in our elections , period. The only people that believe this are the liberals that hate Trump.","post_message":"President Trump: \"To be honest, I inherited a mess. It's a mess. At home and abroad. A mess.\" Watch full news conference here: @webpagelink"},{"comment_id":"10153974541414575","commenter_b":"Poor pup glad he's doing well now just hope he finds a family asap","commenter_a":"How bad is Peyton hurt, I'm looking for a small dog, but low maintenance, I'm disabled my self an single","post_message":"Peyton the dog was found horribly injured along a Kentucky highway after being attacked by a coyote or large dog and hit by a car. Now, thanks to a local rescue group, he's getting much-needed medical care."}]
