[{"comment_id":"10152995985561130","commenter_b":"shes such an ass!","commenter_a":"@username lol","post_message":"What the..."},{"comment_id":"1411629742215405","commenter_b":"She is nothing but a stinken trouble maker, kick her behind out of our country","commenter_a":"This fk needs to go","post_message":"Socialist Seattle City Councilwoman Kshama Sawant said activists should demand the mayor use local police to block Immigration and Customs Enforcement agents. Read both sides [here: kiro.tv/SawantOnICE] and tell us what you think: A. Yes, we need to hold ICE accountable B. No, police are needed for all protests C. We need a solution, this isn’t it. D. Wait, what? E. (Enter your own answer)"},{"comment_id":"638594622989083","commenter_b":"@username:: He is. Watched this afternoon & it was good!","commenter_a":"the credibility of cnn as a real news source has is no more....half of the hosts on msnbc are going after Hillary and not focusing on anything that trump does.... and we don't have to say anything about the fair and balanced fox.....it is just sad that trump is getting away with everything....he is the real criminal......but the press doesn't want anyone to know it...it would be bad for ratings.....","post_message":"We've warned them for months: keep pushing the double standard against Hillary and you'll lose all credibility."},{"comment_id":"599734130175363","commenter_b":"she is such a idiot","commenter_a":"Repeat a lie long enough and loud enough . . . Welcome to Nazi America, 2015","post_message":"Temper, temper, Carly."},{"comment_id":"10152849250926770","commenter_b":"Saul Alinsky a communist socialist died about 43 years ago, but his writings influenced those in political control of our nation today. Recall that Hillary Clinton did her college thesis on his writings and Barack Hussein Obama writes about him in his books. Died: June 12, 1972, Carmel-by-the-Sea, Ca Education: University of Chicago Spouse: Irene Alinsky. Books: Rules for Liberal Radicals Reveille for Radicals Anyone out there think that this stuff isn't happening today in the U.S. ? All eight rules are currently in play How to create a social state by Saul Alinsky There are eight levels of control that must be obtained before you are able to create a Liberal Socialist state. The first is the most important. 1) Healthcare : Control healthcare and you control the people. 2) Poverty : Increase the Poverty level as high as possible, poor people are easier to control and will not ...","commenter_a":"Maybe he was the main cause. Left himself out, didn't he.","post_message":"Excuse me?"},{"comment_id":"1265995716788763","commenter_b":"^fuck that baby","commenter_a":"What is up with this country? A woman owns her body and nobody can tell here what she can and can't do. Its called freedom.","post_message":"Millions of women rely on the health care services of Planned Parenthood, and we must stand with them. The women of this country have the right to control their own bodies, not politicians. No cuts to Planned Parenthood."},{"comment_id":"10154395372381656","commenter_b":"@username let me guess you stand on a corner and watch to see if there anyone putting up a sign after you park legal must work for city and help a 5 man team screw in a light bulb....","commenter_a":"Don't park in a tow zone and you'll be fine. lol.","post_message":"\"None of us has been arrested for stealing,\" he said."}]
