[{"comment_id":"1321737624513912","commenter_b":"So they're not seen as better coders, they're better coders who happen to be women!","commenter_a":"If all 4 of the total androgynous coders had 80%of their code approved, would that mean androgynous coders were superior than both other genders? How about keeping to the science topics, not social engineering propaganda.","post_message":""},{"comment_id":"1017996811629034","commenter_b":"Wat a dumb bitch","commenter_a":"PUT YOUR GUNS DOWN????? What the fuck she's stupid","post_message":"This Black cop is furious about other cops not owning up to police brutality."},{"comment_id":"10154451087971756","commenter_b":"@username That's exactly the kind of response I would expect from a feminist... You don't want to do any of the heavy lifting. There's no reciprocation on the part of feminists because they only care about themselves. Even if I did respond how you wanted, you wouldn't address any of my points and simply make ad hominem attacks. That's all you people are capable of because you have no critical thinking skills.","commenter_a":"To the men commenting on this post that are shaming other men for being feminists: shame on you. You are just proving the very reason why we, as males, have much to benefit from feminism as well","post_message":"The male activists all face roadblocks. Other men might think it's strange for guys to talk about sexual health in public. Women sometimes resent the idea of men offering them information about their bodies."},{"comment_id":"1174215552594104","commenter_b":"This is one time I hope your wrong,Rush! We don't want Hillary as President!","commenter_a":"You just ruined my day, Rush!","post_message":"Everybody is sending me e-mails about Hillary Clinton. Do any of you really, really think she's not going to be the nominee? Come on, let's get serious! There isn't anybody else that's gonna be the Democrat nominee. All of this doesn't mean anything."},{"comment_id":"10152775475131045","commenter_b":"Yes, don't nobody want to mess with this grandma about her grandchildren.","commenter_a":"As a grandparent I cannot Fathom how you could do this. I would protect my children and grandchildren with my last breath","post_message":"Breaking news out of Etowah County tonight. A jury found Joyce Garrard guilty of capital murder in the running death of her 9-year-old granddaughter."},{"comment_id":"931007510269923","commenter_b":"You Don't Hit a Woman,You Turn and Walk Away !!","commenter_a":"Will someone please beat this woman beater up and take away his nfl career.","post_message":"Florida State University quarterback De’Andre Johnson is charged with misdemeanor battery."},{"comment_id":"10158010051555354","commenter_b":"I like the way you think. You are a strong ,smart woman. Hillary? Not so much 😎","commenter_a":"That's funny....I'm a woman and I don't feel the least bit threatened by the FBI Investigation. I felt violated when Comey gave her a free ride the first time around - this time, not so much!","post_message":"THIS is the best the Left can do?!"}]
