[{"comment_id":"10153396293173525","commenter_b":"@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been \"taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns. STORY: @webpagelink"},{"comment_id":"1203685899671880","commenter_b":"In America more people are killed by white guys than Muslims","commenter_a":"She is not brave. American people give folks a chance. Muslims do not. She knew what she was doing. Just like the Muslim who shot the police officer yesterday. She shot Trump the same way. She should have stayed away from the rally. It was a Trump Rally. Not a Muslim rally. What did she think would happen. She knew, she used the media and did not fool anyone. She also showed her true colors. Dressed like some person from the 6th century.","post_message":"This woman will restore some of your faith in humanity. Too bad her treatment at the hands of Trump and his reporters will promptly squash it."},{"comment_id":"1215546011816966","commenter_b":"This is still AMERICA. MOST OF US STILL. BELIEVE AND HAVE LET OUR CONSTITUTION , BILL OF RIGHTS AND AMENDMENTS. WORKING IN THIS COUNTRY. YOU DONT LIKE THOSE LAWS OF OUR LAND. YOU ARE NOT A TRUE AMERICAN. SO YOU HAVE NO SAY. BECAUSE YOU HAVE NOT PASSED THE LAWS OF IMMIGRATION TO BE A CITIZEN OF THIS UNITED STATES OF AMERICA. AND JUST BECAUSE YOU ARE BORN HERE DOES NOT. GIVE YOU THE RIGHT. TO UNDO OUR LAWS. IT IS BREAKING THOSE LAWS TO DO SO","commenter_a":"Bimbo has been drinking the koolaid","post_message":"This is ABSURD."},{"comment_id":"10153103366966770","commenter_b":"@username yes Mario was an idiot but he's dead and buried. Andrew is his idiot son and Governor. Chris is his other idiot son. Both are liberal loonies.","commenter_a":"These idiots who push for these huge wage increases are what drives prices up!","post_message":"A proposal to enact a $15 minimum wage in New York could cost state school districts $276 Million, according to a report released Friday."},{"comment_id":"10153761694679705","commenter_b":"well lets say i know more","commenter_a":"did ya know they have votes to local reps to say the same as the usa does not likely","post_message":"Direct mail service was cut in 1963 at the height of Cold War tensions."},{"comment_id":"10153820494546350","commenter_b":"i see Kate in her lol and Will in George","commenter_a":"Princess Charlotte looks like her daddy, adorable.","post_message":"Princess Charlotte has grown so much in six months! We just can't handle the royal cuteness! on.today.com/1IrSwdd"},{"comment_id":"1911868089040262","commenter_b":"Who are they surveying because not all people thinks Asians aren't hot","commenter_a":"Kyan Khalil Khalili-Broojeni heyy","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."}]
