[{"comment_id":"582227101946110","commenter_b":"@username wow you're a stupid women aren't you","commenter_a":"Let them come in. Legally. Sure. With good intentions. Make them Learn English. Tell them it's our rules. We're not making special laws for you. Your not coming in and changing our rights. Say the pledge of allegiance with the rest of us. Call it a good day.","post_message":"We are taking in thousands, and thousands of people into or country - we have no idea who they are -- and they believe in things WE DON'T BELIEVE IN! Not happening if I am elected president."},{"comment_id":"10153213873086051","commenter_b":"Go to he'll bitch","commenter_a":"It's a lion it is legal to poach lions but legal for canned hunting everyone is having a cow because someone killed a famous Lion If you care so much about animals stop going to the zoo and the circus Stop buying products that test on animals donate to animal charitys Bitching on facebook solves nothing this man made a mistake leave him alone you self righteous idiots","post_message":"The hits just keep coming for Cecil The Lion's pride."},{"comment_id":"10153255182937452","commenter_b":"Richard Valdez what's up with that street. Last week was the guy and now this. So sad!","commenter_a":"That's what happens when you think cars can fly 😕","post_message":"1 person is dead and another was hospitalized after a head-on collision with a big rig in Gardena."},{"comment_id":"900572216669194","commenter_b":"This breed should be wipe off the earth surface","commenter_a":"But pitbulls are harmless.","post_message":"Moment dog savaged ice-bucket challenge woman"},{"comment_id":"10153706783614218","commenter_b":"Go suck you mother","commenter_a":"Judge Barry williams came to his decision based on fear of rioting and unrest...thats not how the justice system is supposed to work you cant be bullied by a bunch of idiots in the streets chanting lies","post_message":"#BREAKING #FreddieGray Judge denies motion to dismiss charges against 6 police officers in death of Freddie Gray. He also denied a motion for State's Attorney Marilyn Mosby to recuse herself. Follow live updates: @webpagelink READ more here: @webpagelink"},{"comment_id":"1009473349173573","commenter_b":"This woman is an idiot.","commenter_a":"#ArrestHillary #NeverHillary #GladlyPayforHillaryInJail","post_message":"FBI Federal Bureau of Investigation Director James Comey testifies on Hillary Clinton Email Investigation before House Oversight Committee. Complete video here: @webpagelink"},{"comment_id":"10153158704481770","commenter_b":"Someone should tell her that it has been done and she needs a new demon.","commenter_a":"When ever a candidate has nothing good to offer they bash the other party. The Butcher of Benghazi has nothing to offer, but more lies and death!","post_message":"Hillary Clinton was asked by Miss America's Outstanding Teen 2016 what she would do as president to fix our national debt but instead of offering a solution, Clinton criticized George W. Bush."}]
