[{"comment_id":"10153002038827894","commenter_b":"She has a disrespectful spirit lol","commenter_a":"@username I am still laughing 😂","post_message":"Coko of SWV Throws Shade at K. Michelle & Tamar Braxton's BET Awards Performance, K. Michelle Claps Back 'You're at Home!'"},{"comment_id":"523357894521457","commenter_b":"She would be the worst ever.","commenter_a":"The people that will vote for Hillary, see nothing wrong with all his sex scandles.......... it dosen't faze them !","post_message":"Bill Clinton's promiscuous behavior could ruin Hillary's chances. Excellent. Help us spread this and make sure she never get's into office. Do you agree that Hillary would be a terrible president?"},{"comment_id":"10157614671450293","commenter_b":"Time to take car keys. Hope this turns out well.","commenter_a":"He may of said screw it and is partying in the infield at dega . Lol . But serious note hope yall find him safe","post_message":"Have you seen this man? He was last seen driving to Coldwater, Ala. to see his son. CLICK to see if you recognize him, and please contact police if you have any information:"},{"comment_id":"1660263367594109","commenter_b":"May be we should shove firecracker up their A-- & see how they like it. God bless America","commenter_a":"Awesome. ..thank you...","post_message":"\"If you have the right to burn my flag, then i have the right to kick your ass.\" - Creed Fisher"},{"comment_id":"10154094410781051","commenter_b":"Again, there are more good cops than bad cops.","commenter_a":"Media is the reason we don't see or hear of these Good Deeds....stopped watching the news & buying the paper...All liberal bias crap & I'm sick of it!!❤️👮🏻❤️","post_message":"When these police officers learned that a local teen was walking two hours to work each day, they immediately stepped up to the plate and helped him out. Do you think America needs to hear more stories like this?"},{"comment_id":"10153612780139614","commenter_b":"Breaking the law is a crime, and that includes illegally immigration. I get it. However, in this country technically only the natives whom they/we (Americans) have taken all their lands away. Any comments ??","commenter_a":"what hell wrong with Gov Mexico, I have been there and not doing dam thing to help county shame Gov.to much Durg going and lost lost people the USA should be Buy it. There lost of them doing wrong in USA. only God fix it not Mexico .","post_message":"Donald J. Trump has again upset immigration activists after he released details Sunday on his plans to deport all \"criminal aliens\" and force Mexico to pay for a wall on its border with the U.S. The GOP frontrunner's immigration plan includes overturning a law that grants citizenship to people born in the U.S. and put stricter limits on legal immigration. His plan is based on three core principles: that the U.S. must build a wall across the U.S.-Mexico border, that immigration laws must be fully enforced and that immigration plan must improve jobs, wages and security for all Americans. Read KTLA's story here: @webpagelink"},{"comment_id":"10154394163921509","commenter_b":"It's the food were eating gmo and all the chemicals they put on our food","commenter_a":"Rest In Peace Great Grang Pa. How Comes Our Generation Dies Too Young?","post_message":"Yasutaro Koide was born a few months before the Wright brothers made the world's first powered flight."}]
