[{"comment_id":"685743394925463","commenter_b":"Someone just lock her up! Please!","commenter_a":"Hillary needs life","post_message":"The double standard..."},{"comment_id":"10153028935676130","commenter_b":"You should, Chris. If you think that's ridiculous, I hope you never have a daughter and have to see her treated like sh*t by some guy who doesn't keep in mind that she's someone's daughter.","commenter_a":"The relationship dynamics between a husband and wife are a lot different than between a father and daughter. Why would a man necessarily care if his daughter is nurturing?","post_message":"Spoiler alert: It's super depressing."},{"comment_id":"1178309965526894","commenter_b":"@username I understand and do not disagree with you. I just believe that there is enormous demand for illegal workers by American employers for whatever reasons. That demand is what brings the illegals to this country and no one ever talks about this.","commenter_a":"Donald Trump does not have a problem with Mexican's, or anyone else for that matter. He has a problem, as do I, of illegally crossing the border to make use of our system without going through the proper channels. If you don't also have a problem with that, then this country is doomed.","post_message":"Worker says he took a stand against Donald J. Trump and his immigration policies by hanging a Mexican flag at the Trump International Hotel in Vancouver. \"From the concrete pouring, finishing, drywall, taping, wood forming and general labour, Mexicans were there, building it.\" @webpagelink"},{"comment_id":"954543751267694","commenter_b":"First of all she did NOT hit the officer first.. He had his arm around her neck before she hit the arm he had wrapped around her throat.. That's a natural human reaction.. Before HE touched her, she was seated in a chair","commenter_a":"Does anyone notice the difference?","post_message":"#AssaultAtSpringValleyHigh: The SC school resource officer who slammed a teenaged girl on the floor was sued twice in federal court. Cops charged in fatal shootings reaches a nationwide high in 2015. #CoreyJones’ final phone calls may detail the moments before his fatal shooting. Check out these stories and more in today's edition of the NewsOne Top 5, our rundown of the viral stories that we are still talking about today. ------> @webpagelink"},{"comment_id":"10155804568635725","commenter_b":"Tell Andre ignorant ass to just go kill himself!! You never hit a girl you shine!","commenter_a":"Lmao attacking him?? it's a Football f**** player against a girl. Did u not see how she threw that punch lmao how is a grown ass man/athlete gonna look w that argument on court?? Lol and why didn't he leave her alone after she seemed to push him away?? Cuz she said the N word!!! Ha so it all makes sense now!!! Oh my god someone bring the guillotine!!! Not the N word!! Bring all the rappers too!!! This is an injustice!!! Lol","post_message":"Florida State University quarterback De'Andre Johnson is telling his side of the story of the now-viral video where he is seen punching a woman in the face at a campus bar, including what he says the woman said to him right before the attack ----> @webpagelink"},{"comment_id":"10152713641640496","commenter_b":"Amen, Laura ! AMEN.","commenter_a":"Sorry. I disagree. He sounds like a spoiled brat who realized that marriage takes work. Both people have to be willing to work at it. A real marriage is good. Hard sometimes. But good.","post_message":"How many of these do you agree with? @webpagelink"},{"comment_id":"955482931153795","commenter_b":"I think everyone should mind their own business,it's between God,her and gays. Don't you think ? Stop throwing stones. So much going on in this world.","commenter_a":"Amen Rev. Franklin Graham","post_message":"Every American must see what Rev. Franklin Graham just said about the arrest of Kim Davis!"}]
