[{"comment_id":"611037522408756","commenter_b":"Is this trump's doing ? Has he stirred up so much open racism that a judge would feel more compassion for a white kid ?? Was there a bribe ? Maybe the judge himself is a pedophile? ? This absolutely makes no sense whatsoever. I'm so sick of these judges who release all these rapists back into society. Arrest these judges !!!","commenter_a":"I agree. It is an outrage! I am sure if he had been a minority he would have gotten life in prison!!","post_message":"This is an absolute OUTRAGE."},{"comment_id":"10153505413366770","commenter_b":"She's an idiot","commenter_a":"Kelly girl get over yourself, now your show will be a flop.","post_message":"Kelly Ripa was dressed for a funeral."},{"comment_id":"10154492827869497","commenter_b":"Who can believe this story?? After all the woman ?????","commenter_a":"hahaha","post_message":"Highlights Of President Bill Clinton's 2016 DNC Speech"},{"comment_id":"1505750879440568","commenter_b":"@username...you\"re a stupid girl.","commenter_a":"I really feel like if the voting system was trustworthy Trump would win. His crowds are just insane and people are so enthusiastic about him. However, I don't trust the system and I'm scared to death that she will win because it will be rigged. I am literally terrified of the possibility that she could be our president. I have legit anxiety about it.","post_message":"The election was supposed to be over months ago. But certainly this week it was not supposed to be in question. Hillary should have been... They're already planning inaugural balls and all the other trappings that go with victory. This is not where they wanted to be, and with the possibility Trump could win, they are in abject panic. And it's being demonstrated on TV."},{"comment_id":"10152980958545399","commenter_b":"This may help. My feelings as a Christian points me to my Lord and Savior as a fighter. It points me to the man who once in loneliness, surrounded only by a few followers, recognized these Jews for what they were and summoned men to fight against them and who, God's truth! was greatest not as a sufferer but as a fighter. In boundless love as a Christian and as a man I read through the passage which tells us how the Lord at last rose in His might and seized the scourge to drive out of the Temple the brood of vipers and adders. How terrific was His fight for the world against the Jewish poison. To-day, after two thousand years, with deepest emotion I recognize more profoundly than ever before in the fact that it was for this that He had to shed His blood upon the Cross. ...","commenter_a":"Just what was the religion of the people loading Jews into ovens in Europe?","post_message":"\"When you take Christianity, Judaism, Hinduism, Buddhism, whatever, their combined killings in the name of religion -- well that number would be zero.\""},{"comment_id":"481790668675893","commenter_b":"GET THIS TROUBLE MAKER OUT OF THIS COUNTRY ....BEHEAD iSLAM","commenter_a":"Now that is one hell of a costume","post_message":"ARREST HIM!!!!!!!"},{"comment_id":"481914358685584","commenter_b":"That chick in the picture is going to fire up a joint , get high , go down and get her welfare check, then crash for a while, then get up and go to a anti-whatever rally and get arrested , then get out on an O/R and go cash her check and go get some more weed and start all over again. Thanks Gov. Brown for making California so great!","commenter_a":"Does that mean about 4 thousand attended?","post_message":"Attendees of the annual 4/20 pot celebration left behind almost 15,000 pounds of trash at the Golden Gate Park. PHOTOS/VIDEO:"}]
