[{"comment_id":"1220979514606949","commenter_b":"That's always the answer huh fellas,if you feel this strong about it how about throwing some fist,oh I forgot you can't fight without guns.","commenter_a":"Until the authorities start treating these \"protestors\" Like the domestic Terrorists they are the riots will continue. And they will get worse! Time to take off the PC shackles and get down to business! It all starts from the top. As long as the Democrats are in the White House this will get worse. Elect Trump 2016.","post_message":"Many people have been arrested in Charlotte, North Carolina after the past several days of protesting and rioting. 70% of those who have been arrested have something in common, and it leads to a lot more questions about who is really behind all this..."},{"comment_id":"510102432525283","commenter_b":"What a dumbass!","commenter_a":"Well duh!!! I thought everyone knew the all you can eat means is all YOU, just you, only you, your stomach, can hold, I didn't realize that there were ppl stupid enough to think they could go into a restaurant and get the all you can eat whatever and feed 5 or 6 of your friends on YOUR all YOU can eat ....are ppl really out there that are that stupid ? If so for the love of God spay and neuter them so as to prevent them from bringing more ridiculously stupid ignorant ppl into this world","post_message":"The Denny's workers here repeatedly tried to explain the rules about all-you-can-eat-pancakes to this lady - and that's when she completely snapped."},{"comment_id":"10152607726779071","commenter_b":"same here","commenter_a":"I've been dressing like a man for years and I assure you no one takes me seriously.","post_message":"The clothes you wear have a profound impact on how people perceive you."},{"comment_id":"1002924903097372","commenter_b":"Sad part is there are a lot of people in denial and they will actually vote for this idiot woman","commenter_a":"All today has shown America is that @username will make an outstanding president and that the Republicans are vindictive liars. The Republicans have admitted to spending over 4.5 million dollars of taxpayers money to fund a \"witch hunt\" designed solely to discredit Secretary Clinton and take down her poll numbers. They have confessed to this.","post_message":"Hillary has been testifying at the House Select Committee on Benghazi for hours, and what have we learned? That she was a Secretary of State devoted to upholding our nation's values abroad, practicing smart foreign policy, and keeping our diplomats as safe as possible. Add your name to say you're with her: hrc.io/201PFma"},{"comment_id":"1513700471996539","commenter_b":"I agree with a person that wants sources: he is right to ask for them. I did not give some simply because it would take too much time on my part to gather them (about the same it would take to do the research on CRS and FATCA's actual consequences). These are the keywords you want: FATCA CRS money laundering Nevada","commenter_a":"Jumping on the demonize Putin wagon eh, big surprise coming from vice. This has nothing to do with Putin, but I see his name a hundred times. Clearly this leak came from the u.s. How about the American banks laundering drug money, or the us govt selling weapons to drug cartels, or CIA plane crashing full of cocaine, or u.s Senator macconell s boat full of cocaine. Won't touch that, because that's actual truth, stay away from that. Just another propaganda outlet for the u.s government.","post_message":"The Panama Papers were a big deal."},{"comment_id":"480221218832838","commenter_b":"Kevin, if you look at Christine's profile, I would say all of her ancestors were not white... And you just backed up what I said about the white man thinking they could own the land. I believe that baffled the Natives. How could you own Mother Earth?","commenter_a":"Jesus WAS!!!!! A LIBERAL, you right-wing nuts!!!","post_message":""},{"comment_id":"10152925468786680","commenter_b":"Love is no ones business but the two who found it's bliss.","commenter_a":"Well, you could always just ignore it. Our government seems to be doing that alot lately. Like DC ignoring the Heller case.","post_message":"“It seems like the oppressor is now taking on the mentality of the oppressed.”"}]
