[{"comment_id":"388733381251257","commenter_b":"ABSOLUTELY YES !","commenter_a":"Real need/ felt need.","post_message":"This could be bad news for some people on food stamps."},{"comment_id":"1710140202573363","commenter_b":"I know it will be hard for Trump to send back all of the illegals, but he'll try his damdest. I hope he goes after the ones that are draining our system and leaves the ones that are hard working and honest people with good families not asking for handouts. Once we get rid of all the sponges in this country then we only have to deal with the riff raff , junkie americans that we already have to support!!","commenter_a":"Hallo everyone economy is getting worse because of Obama's and Bush's stupid policy so we need to make great world with Donald Trump.No to unlegal immigration no to Islam","post_message":"The economy is bad and getting worse-almost ZERO growth this quarter. Nobody can beat me on the economy (and jobs). MAKE AMERICA GREAT AGAIN"},{"comment_id":"1375821949123925","commenter_b":"Love and agree with your comment Sandy","commenter_a":"Will not stand for the disrespect and I'm totally disgusted by the inept commissioner. He wanted to fine players wanting to support something positive, Cowboys supporting the 6 policeman killed, but pats Kaepernick and his followers on the back. The entire NFL is ass backwards and I was a huge fan","post_message":"NFL says rating are down because of Trump and 2016 headlines. I think not. Read my op-ed + TAKE OUR POLL: @webpagelink"},{"comment_id":"10152744570508822","commenter_b":"so hard to even win a buck!","commenter_a":"$1 straight Is 50. $1 box is 25","post_message":"The Pennsylvania Lottery is getting a makeover and adding a new game. Check out the changes here: @webpagelink"},{"comment_id":"10157069343155354","commenter_b":"@username that is exactly what I said she would be the second biggest mistake","commenter_a":"It is about time all realize all that comes out of his mouth are lies he has seven more months to tear our country apart I saw this before his first election do not make the same mistake twice to vote for Hillary she is a continuation of Obama and if she gets in the only way we can restore our fore fathers Constitution is through force I am a Veteran and will stand by the oath I took at enlistment to defend the Constitution against all enemies foreign or domestic so help me God do not screw with my country","post_message":"Obama is a global rock star no more..."},{"comment_id":"10153921067764203","commenter_b":"@username, But many Women would and I bet You were going to have A lot more Women shooting themselves.","commenter_a":"Yah most women can't find their keys in their purse! As they fumble for the gun, they'll be long gone!","post_message":" new motto may just be you see something, say something. But make sure you packing heat and have good aim."},{"comment_id":"1745001682421383","commenter_b":"Just when I think I had seen stupid, I look at a news feed like this, and all you libtards take stupid to a whole new level. All you lazy Daisy's don't want Trump in because your welfare checks will go away, and a you illegals will be deported home to build that WALL!!!!","commenter_a":"Trump is hammering her, love it! All she can do is smile & laugh because she has nada","post_message":"\"I will release my tax returns – against my lawyer's wishes – when she releases her 33,000 emails that have been deleted.\" Donald J. Trump hit at Hillary Clinton's email issue in the first presidential debate. #Debates2016 @webpagelink"}]
