[{"comment_id":"10153153729864726","commenter_b":"your mother is white your white bunch of zebras in the white house","commenter_a":"what an ass","post_message":"WATCH: Michelle Obama's mom admits she is worried about mixing races and is glad Barack Obama isn't completely white!"},{"comment_id":"1801403630131591","commenter_b":"WHEN SHE STEALS THE HAITIANS FOR HER DAUGHTER' S WEDDING, GOD SAVE AMERICA !! LOSER CRIMINAL HITLARY Nutjobs!!","commenter_a":"It feels like Hunger games in here with all the trash talks and the media coverage ... May the odds be ever in your favor ma'am","post_message":"Share this if you know someone who needs to see it. hillaryclinton.com/locate"},{"comment_id":"499007870289793","commenter_b":"She's an ass. She's not an elected official. Tell her to stuff it.","commenter_a":"Go away Michelle.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153716736973984","commenter_b":"That's one ugly girl","commenter_a":"This is more disruptive than any dress-code the kids could break. If a kid can't wear a t-shirt with our STARS & STRIPES, for example, then this person should not be allowed in the girls restroom and locker room. Period. There is no reason an alternative restroom shouldn't suffice.","post_message":"These students just sent a BOLD message to this school after a transgender classmate said he should be allowed to use the girls bathrooms and locker room. And it's not a message that the school can overlook... Do you support what these students did?"},{"comment_id":"10153221460464087","commenter_b":"I don't get why liberals are being such cry babies? Don't get so upset about losing votes. Illegal is illegal. Period. Come back to the country Legally!","commenter_a":"You have my vote MR Trump!!","post_message":"\"The first thing I'd do in my first day as president is close up our borders so that illegal immigrants cannot come into our country,\" Donald J. Trump vowed."},{"comment_id":"10152973215291519","commenter_b":"So you are saying that black women are easier to compete with than whites women? I don't think so","commenter_a":"She couldn't compete with other white women so she became a light skinned black woman. Using our own weakness against us.","post_message":"The cringe factor here is off the charts..."},{"comment_id":"10154216740214160","commenter_b":"Says the woman who's husband cheated on her and she cheated on her husband","commenter_a":"People in Power need to lower their Kelly's.","post_message":"\"Today I ask Donald J. Trump to step aside,\" wrote Carly Fiorina."}]
