[{"comment_id":"10154343629676636","commenter_b":"Muslims treat you way better then any Jew would.","commenter_a":"Israelites are the best . shut up you muslim dicks","post_message":"BREAKING"},{"comment_id":"783731095008773","commenter_b":"Because illegals are the only ones driving without insurance right... please i bet more illegals have insurnace on their vechile then citizens for the fact they want no problem with authority","commenter_a":"Idiot","post_message":"Should dreamer's driver's licenses include the label \"non-citizen\" on them? The debate over that question is heating up after a rookie lawmaker tweeted about an upcoming bill he's working on."},{"comment_id":"10153812038063984","commenter_b":"We need to demand that our governor 's refuse to accept them in our states !!","commenter_a":"Totally against it.","post_message":"Wow. This definitely makes Obama's plan to accept refugees from war-torn Syria \"nothing short of crazy\" - as Ted Cruz would put it. America could be the next country to face this... Are you against allowing Syrian refugees into the U.S.?"},{"comment_id":"458683577589570","commenter_b":"Negotiations are not PC, you get what you can out of your adversary ! GO AMERICA, to hell with \"global niceties !","commenter_a":"The author is racist against Asians. Trump is not","post_message":"Donald Trump shows that he's not afraid of anyone, especially people from other countries that he does business with every day."},{"comment_id":"1678937325726713","commenter_b":"Prayer is on the way","commenter_a":"Prayers for Ava. Willie Nelson is GREAT!!","post_message":"Please spread this and send your prayers."},{"comment_id":"626305930908697","commenter_b":"@username Yeah, those toddlers with guns are out of control right now.","commenter_a":"I blame Obama and Bush, Bill and Bush snr for forever labeling all Muslims as terrorists . they didnt know that by doing so they created further hate for Muslims in america and this is the result","post_message":"Kim Kardashian West made her opinion known (via Daily Mail Celebrity)"},{"comment_id":"817253511741162","commenter_b":"@username she isn't running. Stupid! Trump's wife is a ditzy bimbo... Not relevant.","commenter_a":"Hello!!! The Liberals are the ones voting for him. He is a danger to our country. I know many Conservatives who feel the same way about this democrat posing as a republican. Don't be stupid with your vote. The Liberals will still want to leave over Cruz being elected. Why not go that route? Or change your page to the Comical Former Conservative.","post_message":"Rosie and Whoopi too......one can dream..."}]
