[{"comment_id":"10153153729864726","commenter_b":"your mother is white your white bunch of zebras in the white house","commenter_a":"what an ass","post_message":"WATCH: Michelle Obama's mom admits she is worried about mixing races and is glad Barack Obama isn't completely white!"},{"comment_id":"10152865946012293","commenter_b":"Married men have to make more. There are others to provide for.","commenter_a":"Jamal Barcillano :)","post_message":"Marriage appears to transform men’s approach to work and the way employers treat them."},{"comment_id":"1022294177808818","commenter_b":"Just normal housewife.","commenter_a":"Meat grinder, feed hogs, use poop for fertilizer, only positive outcome...","post_message":"Not even a little tiny bit sad over this. Nope."},{"comment_id":"10153025214071051","commenter_b":"I can't tell you how many cars my body has stopped that wouldve hit a lady otherwise","commenter_a":"The man always walks on the street side of a woman. That's manly eticat !","post_message":"A woman posted this photo with the caption, “I'm sure half of you guys don't even know what's wrong with this picture” alongside it. Well, she was right."},{"comment_id":"10153176001911336","commenter_b":"They could rename the White House, Geratic Ward","commenter_a":"91% huh? @username lol","post_message":"\"I think I've got a good message. I think I've been more right than wrong on foreign policy.\" Today on Fox News Sunday, Sen. Lindsey Graham said he is considering running for president if he can raise enough campaign funds."},{"comment_id":"405363642956925","commenter_b":"Bitches can try","commenter_a":"Come bring that b.s. this way I'm ready","post_message":"The video is titled \"A Message Signed With Blood to the Nation of the Cross.\""},{"comment_id":"10153775640411178","commenter_b":"Bully!","commenter_a":"\"In the first place, we should insist that if the immigrant who comes here in good faith becomes an American and assimilates himself to us, he shall be treated on an exact equality with everyone else, for it is an outrage to discriminate against any such man because of creed, or birthplace, or origin. But this is predicated upon the person's becoming in every facet an American, and nothing but an American...There can be no divided allegiance here. Any man who says he is an American, but something else also, isn't an American at all. We have room for but one flag, the American flag... We have room for but one language here, and that is the English language... and we have room for but one sole loyalty and that is a loyalty to the American people.\" Theodore Roosevelt 1907","post_message":"Ben Carson makes a bold statement."}]
