[{"comment_id":"10153103366966770","commenter_b":"@username yes Mario was an idiot but he's dead and buried. Andrew is his idiot son and Governor. Chris is his other idiot son. Both are liberal loonies.","commenter_a":"These idiots who push for these huge wage increases are what drives prices up!","post_message":"A proposal to enact a $15 minimum wage in New York could cost state school districts $276 Million, according to a report released Friday."},{"comment_id":"1242932969112927","commenter_b":"shes a nigga","commenter_a":"the origin of dream locks is india; not africa, not jamaica, not america. that girl is ignorant.","post_message":"Black student filmed confronting white student because of his hairstyle"},{"comment_id":"992371087511918","commenter_b":"So she is only part Native American because you think they must have been raped? Um.. I am part Native American because my great grandmother was savagely raped by a Native American, so please tell me how innocent and peaceful they were. And yes illegals now are a different story. Whether you like it or not, when Europeans came here it was a hostile takeover. There was a war. Which the Native Americans lost. So if illegals want to wage war, than they can bring it on. If not, they can go the he'll home to whatever country they came from. I honestly don't care which country it is.","commenter_a":"If Native Americans had @username \"Illegal European scumbags have yet again raided local villages, they crashed their boats into our shores, raped our women and children and then killed them for not turning into Christianity..\" #Talk about several overdue sentences","post_message":"Margarito Quintero didn’t have a license and was in the United States illegally. He was previously arrested and deported in 2008."},{"comment_id":"850397761665128","commenter_b":"I'm a 20 year retired air force vet and a woman and this kind of treatment is common among the other sex","commenter_a":"In fairness. I wonder if the person thought the parking space was ONLY for physically wounded vet. Just saying. I agree the person was wrong. Vets come in all sizes, shapes, colors and gender. We all served. In AL we can even get the word VET on our drivers lic now. Just new.","post_message":"WOW! What do you think about the note left for this woman?"},{"comment_id":"10152803991986491","commenter_b":"This less her chance of cancer . It is possible that cancer my appear else where?","commenter_a":"Anna! I always love to read your comments! Thank you for sharing :)","post_message":"\"I feel feminine, and grounded in the choices I am making for myself and my family.\""},{"comment_id":"1265414436832359","commenter_b":"SHAME ON THOSE ASSHOLES","commenter_a":"Alabama - the best argument in favor of mandatory abortion.","post_message":"From Restricting the right to vote to using $1.8 million to renovate his beach house, Republican Governor of Alabama now sinks to a new low with awarding his staff with $73, 405 raises after blocking a minimum wage increase in Birmingham."},{"comment_id":"644569865731305","commenter_b":"Robert, no one on earth has even 1 trillion dollars. Bill Gates according to Wikipedia is the richest man on earth with a net worth of 75 billion dollars.","commenter_a":"I know that Trump is not for just one race. Trump is for all races. If you will just vote for him you will find out he will be for every one in American.And he believes in GOD. GOD bless Trump.","post_message":"MEDIA BLACKS OUT..."}]
