[{"comment_id":"10154000901360575","commenter_b":"Trump may not be as conservative as you or I, but neither is he a liberal, and anyone who tries to convince you that Trump is a liberal is a liar. A liberal would not want to build a wall. A liberal would not want to enforce our immigration laws. A liberal would not want to repeal Obamacare. A liberal would not want to bomb ISIS back to the stone age. A liberal would not want to bring back waterboarding “and worse” for terrorists. A liberal would not want to protect your right to own and carry a gun to protect yourself. A liberal would not want to defund tax-funded abortions. A liberal would not want to build up the military. A liberal would not want to take care of our vets. A liberal would not support our police. A liberal would not want to negotiate trade deals that give ...","commenter_a":"@username, you are so correct!! Trump has not said one intelligent thing during any of his speeches. Furthermore, his false accusations of calling Senator Cruz a lier is not working for him. Anyone who believes anything Donald says is delusional. Why has Trump not agreed to debate Senator Cruz!? Donald knows he is no match to Senator Cruz. Additionally, Donald lacks knowledge, experience and intelligence to speak about the most critical issues facing our country. You cannot be a Commander-in-Chief just because you are rich!! CEO's of large corporations are not hired to run a company because they are rich. Your resume matters!","post_message":"Cruz trashes New York in hopes of picking up votes in Pennsylvania."},{"comment_id":"10154184073372093","commenter_b":"Are you kidding ? Mom said NO. Who knows what that WOMAN has exposed that baby too.","commenter_a":"Oh.. now shes just doing the most wonderful beautful natural thing that God as given women the best thing for a child...what's wrong with that ..bad mom for sayng no to someone wanting to be so generous and giving......","post_message":"The mom says the daycare worker asked if she could breastfeed her son. Disgusted, the mom said no. But as soon as she left the room, video shows the worker did it anyway... bit.ly/2kEuI1v"},{"comment_id":"729261537208194","commenter_b":"Not for criminals!!! More sheeple...","commenter_a":"When is everyone going to realize that gun control laws only apply to the law abiding citizen's? Criminals could care less what law is out there that says something is illegal, such as murder, drugs, ect.","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.” Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"10156440483580492","commenter_b":"Elouise faux? Why even post this garbage?","commenter_a":"Nah, it was just ratatouille ...","post_message":"Rats may love eating our finest delicacies, but they don't belong INSIDE of them."},{"comment_id":"10153725146380667","commenter_b":"no one cares I'm tired of heading about him","commenter_a":"People get punched in the face everyday.","post_message":"“He said he was going to kill me.\""},{"comment_id":"1362948977061222","commenter_b":"@username oh look a grammar nazi, good burn lol","commenter_a":"First of all I know what it's like to work in a shop with just men. Men talk locker room talk. What you do think woman talk the same way! Shut the F up! It works both ways! Until you know what it's like to work in an all male job you can shut up!","post_message":"This rape survivor just took a powerful stand against Jeff Sessions."},{"comment_id":"1114940968546374","commenter_b":"One man and one woman, Not 4 men and one woman. Stone her!","commenter_a":"Maybe she have life in prison since she likes jail so much.","post_message":"This is honestly what it's all about..."}]
