[{"comment_id":"10153622148174497","commenter_b":"women can have some rights, just so long as they arent black mexican atheist homosexuals or anything.","commenter_a":"are men hogging up all of the rights again? come on guys... let the women have some of the rights.","post_message":"What is the path forward for women given the barriers to equality they face worldwide? The Onion explains women rights."},{"comment_id":"1720672154848520","commenter_b":"@username yes I'm voting for Hillary","commenter_a":"Vote for Hillary and you're voting for corruption. Vote for Trump and you're voting to make America great again!","post_message":"'Get of the fence' and VOTE TRUMP; ' at least he's like us!' - Robert Jeffress (pastor)"},{"comment_id":"581181075381182","commenter_b":"@username Many are 'insured' but access to care is more expensive than ever when you add copay, deductible, out of pocket, and actual cost of premium. These \"facts\" are manipulated to make the ACA look \"good\". In reality it is a tax, as defined by our own government.","commenter_a":"\"We’re forcing the president to confront the failures of this law once and for all\" - Speaker Paul Ryan","post_message":"Republicans in Congress used reconciliation to be able to get the Restoring Americans' Healthcare Freedom Reconciliation Act to the president."},{"comment_id":"709741415860770","commenter_b":"She's about one stupid fucking bitch.","commenter_a":"Nancy, Nancy, Nancy: you've been in theHouse/government too long !!Time for you to resign!!!","post_message":"Liberal logic: Taxpayers don't fund abortions, they fund the organization (Planned Parenthood) that performs the abortions. This is liberal, pro-abortion double-speak at it's worst."},{"comment_id":"10153300662806491","commenter_b":"That is fair enough. I read a bit about the current government it is indeed incredibly corrupt and has generated a lot of hatred from the people due to actions which benefited only those in the inner circles. This however does not bode well, civil unrest of this scale does not end well.","commenter_a":"It is a horrible tragedy but it does not warrant for a cabinet to resign. I am confused at why the riots asked for the resignation rather then the changing of the laws.","post_message":"Prime Minister Victor Ponta and his Cabinet resigned Wednesday after mass protests."},{"comment_id":"557077507818161","commenter_b":"Take her ass down","commenter_a":"We owe Nixon an apology. Watergate was nothing compared to this.","post_message":"BREAKING..."},{"comment_id":"10154054771666574","commenter_b":"Thank you Senator @username. Please stand up to this narcissistic demagogue who is the president. Please encourage your Republican colleagues to stand up to the POTUS and his white nationalist advisors.","commenter_a":"A Free Ukrainian and freedom for Chechnya, Dogestan, Alania, Ingushetio, North Osseha, and other ethic republic under Russian occupation.","post_message":"President Donald Trump’s call with Vladimir Putin is scheduled to take place amid widespread speculation that the White House is considering lifting sanctions against Russia. For the sake of America’s national security and that of our allies, I hope President Trump will put an end to this speculation and reject such a reckless course. If he does not, I will work with my colleagues to codify sanctions against Russia into law. In just the last three years under Vladimir Putin, Russia has invaded Ukraine, annexed Crimea, threatened NATO allies, and intervened militarily in Syria, leaving a trail of death, destruction, and broken promises in his wake. Russia’s war on Ukraine has killed over 10,000 Ukrainian soldiers and civilians. Russia supplied the weapons that shot down a commercial aircraft over Ukraine and killed 298 innocent people. Russia has conducted a massive military buildup along NATO’s eastern flank, conducted large-scale military exercises, ..."}]
