[{"comment_id":"946471268733575","commenter_b":"Sit down an be quiet Mitt!","commenter_a":"Trump is not my choice, but why do Republicans do this to themselves? And who cares what Mitt Romney thinks - he blew his chance and I do mean blew it!","post_message":"Donald J. Trump fires back at Mitt Romney's claim that there may be a \"bombshell\" in his taxes. @webpagelink"},{"comment_id":"10154027837914087","commenter_b":"Must be polling illegals...","commenter_a":"BOGUS BULLSHIT.","post_message":"Hillary Clinton leads Donald Trump by nearly double digits in New Mexico."},{"comment_id":"10152995075029342","commenter_b":"A lot of women think they have to \"eat for two\" which they don't and that gets out of hand.","commenter_a":"People will never be happy. If a woman gains 100 lbs during pregnancy, people will \"OMG THATS SO UNHEALTHY! \" BUT, someone who is healthy and in shape, people are still gonna have a problem with it. What I think it is, alot of women get extremely fat and think it's ok. They use pregnancy as an excuse to over eat. This woman CHOSE to stay fit and there is nothing wrong with that. Kudos to her!","post_message":"Sarah Stage, the internet-famous pregnant model, finally gave birth on Tuesday to an unexpectedly large baby boy:"},{"comment_id":"879507305458832","commenter_b":"she wants everyones money , she is so poor !","commenter_a":"Or Vince Foster. Can't forget her law partner who magically killed himself with an antique firearm that didn't function....Interesting.","post_message":""},{"comment_id":"10152607726779071","commenter_b":"same here","commenter_a":"I've been dressing like a man for years and I assure you no one takes me seriously.","post_message":"The clothes you wear have a profound impact on how people perceive you."},{"comment_id":"10152972519324753","commenter_b":"This bitch","commenter_a":"Nathan Perez @username omg","post_message":"Anna Broom has been on welfare since she was 19-years-old since she was deemed too overweight to work. In total, she has collected over $149,000 in benefits but says that simply isn’t enough as she now wants taxpayers to pay for a dream wedding costing $15,000."},{"comment_id":"10154434933517690","commenter_b":"@username, she's a girl. Not a he. SHE!!!","commenter_a":"Myb6 year old saw this news story, not understanding the word transgender at all. He said \"That's mean them, I don't think God would like that\" The fact is kids don't fully understand the transgender thing. This little boy included. But if he wants to be included as a boy, then let him. The other boys don't have to know. This is like excluding a girl from football or something.","post_message":"The family of an 8-year-old New Jersey boy says he was kicked out of Cub Scouts because he is transgender, a move that could open a new front in the debate over discrimination in Scouting."}]
