[{"comment_id":"10154025197726717","commenter_b":"She leaked information about innocent people being murdered!!! I see nothing wrong with that!!!","commenter_a":"Fuck her, she leaked secrets. It's against the law, doesn't matter how you identify or what's between your legs","post_message":"Manning recently asked President Obama to commute her sentence, and supporters worry what a Trump presidency will mean for her."},{"comment_id":"10154517046780329","commenter_b":"Not bad, but these sudden death quizzes are pretty f***ing unpopular. I would have hoped y'all would have gotten the point.","commenter_a":"Mike Snee","post_message":"There are 20 questions, but as soon as you get one wrong, you LOSE. (via BuzzFeed Quiz)"},{"comment_id":"10154177421583734","commenter_b":"OK, toss in Jesus too, and all the Angles, and it still won't get him the Seat.","commenter_a":"He could have God running with him . He still has no shot at winning","post_message":"Do you think Fiorina was a good choice for Cruz?"},{"comment_id":"10152620550458067","commenter_b":"Get a FREE Education, Graduate, and then move into your Parents Basement because all of the Illegal Immigrants have your JOBS.","commenter_a":"Tax money used for a good long term investment finally.","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"10153580849383812","commenter_b":"I'll be there. Don't know if I'll fit in that box.","commenter_a":"This is just becoming the perfect excuse for some parents to abuse the internet and the kindness of others... What a joke, shame on the parents BY THE WAY, MY birthday is coming up, Im opening an invite to everyone and anyone!!! PO BOX for gifts to follow! LOL","post_message":"Hundreds attend 10-year-old boy's birthday after mom extends open invitation to the Internet when she finds she has no one to invite: \"He was grinning ear-to-ear.\" @webpagelink"},{"comment_id":"418116258312969","commenter_b":"Heaven help us if voter fraud (no picture ID) elects this incompetent lady","commenter_a":"Zero chance","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"10156182407910354","commenter_b":"Will they be put in jail for raping, beheading, burning live people? I think I need some pigs running around my yard.","commenter_a":"Since this treason is all being done by the commie DemocRats lets dump them all into the DemocRat run city's . Chicago, Detroit , Boston, Philly, New York , San Fran, etc. How about a 90% tax on all liberals.","post_message":"You just KNEW this was coming, didn't you?"}]
