[{"comment_id":"1591380840922039","commenter_b":"Legal Mexicans will stay,illegals will get deported..as it should be!!!","commenter_a":"Mexicans broke the fence at the border to come here illeagally, breaking the American immigration laws, so they should pay for the new repaired version (aka the wall) Copy & paste and share this comment if you agree, that way we can support Trump by making him look good.","post_message":"Wow, Mexico sounds like they're literally in the Apprentice boardroom with @Donald J. Trump pleading for him not to fire them. THIS is what it looks like when you've got a president who refuses to back down. It's a new day for America!"},{"comment_id":"10153204485844087","commenter_b":"Lucky!!! I wish I could have gone.. And TO ALL LIBERALS. I'll end with this.. Yall say if you're not natives to shut up about immigration. Tell you what, when the Mexicans conquer the land like the Europeans, they can have it. When they conquer and claim. Good luck.","commenter_a":"What a fun rally. Sold out and packed American Airlines center. It was beautiful. So beautiful, in fact, they may rename it the Trump center.","post_message":"\"I'm not going anywhere and we're not going anywhere,\" Donald J. Trump told a packed American Airlines Center in Dallas, where an estimated 20,000 rallied. \"We are killing it. They mentioned a little while ago about the silent majority — it's back. And it's not silent. Maybe we should call it the noisy, aggressive, wanting-to-win majority.\""},{"comment_id":"10154001146333598","commenter_b":"Give me a chance at her murderous body!","commenter_a":"Shame on you.","post_message":"This Abortionist Flies in to Planned Parenthood to Abort 31 Babies Every Day"},{"comment_id":"10153491570891336","commenter_b":"I don't want that scum anywhere near my home.","commenter_a":"Considering I don't have an auto dishwasher, Obama can be my dish washer anytime.","post_message":"Counterproductive? New Obama administration regulations are meant to boost dishwasher efficiency, but industry experts say it'll result in greater water usage."},{"comment_id":"588976734614882","commenter_b":"She couldn't sexually satisfy ol slick willy either","commenter_a":"Don't want her in the War Room...Remember Benghazi!!!","post_message":"Ahead of President Obama's speech to the Democratic National Convention tonight, The White House released excerpts touting Hillary Clinton's experience."},{"comment_id":"1146187242090421","commenter_b":"Lordy...I'd wear that brownish ass out...then marry her!","commenter_a":"My opinion is that, it is not nasty, is just a big booty, so whatever.","post_message":"Big booty problems."},{"comment_id":"876377039127570","commenter_b":"Hopefully the \"treatment\" is the same pain & suffering the little girls had to endure","commenter_a":"There is sex offender treatment in prison?","post_message":"Nicole Vaisey, 26, and her boyfriend, 40-year-old Stephen Howells, admitted that they kidnapped the two Amish girls."}]
