[{"comment_id":"1339410646123872","commenter_b":"Now I'm calling her a turkey! At least she could've let us see the eggs before she got comfortable again","commenter_a":"Somebody say bugs","post_message":"EAGLET WATCH! Getting closer, it could be any time now! We are watching and waiting as mom (Harriet) and dad (M15) take turns incubating the two eggs. Live video: Southwest Florida Eagle Cam MORE: @webpagelink"},{"comment_id":"470600046463909","commenter_b":"I will refuse! They have already done enough to erode away our great United States of America. They need to go far away from Washington!","commenter_a":"She is \"one ugly motherfucker\".......to coin a phrase.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"1117181214965894","commenter_b":"@username , It is kind of a long story... But just as we have labels on cans to tell us whether it's Corn or Peas the label on our Faith denotes how accurately we wish to follow Jesus .","commenter_a":"Many are walking away from Christianity, because not all...but the few, out there in this world use God and the Bible to push their own personal and political agandas! People are so tired of so-called Christians who act so self-righteous and who's actions are far far from what Jesus would do! As a Christian...Many of us do not want to be represented by Greed, bigotry and hatred!","post_message":""},{"comment_id":"602032646612178","commenter_b":"It's a very very last resort. We would have to live with it for the rest of our life. I am a responsible gun owner. Guns are meant for hunting and in case of a immediate threat on your or someone else's life only. #Berniesanders","commenter_a":"The guns themselves don't worry me. It's the people who demand having them that worry me. They never have legitimate reasons. It always boils down to paranoia and delusions of grandeur based on violence. Not the kind of humans I want to see armed.","post_message":"Multiple other vehicles were hit by gunfire, too. How many other angry Little Fellers are out there with guns? -Conover"},{"comment_id":"10153626364206600","commenter_b":"I was TAUGHT the same thing you were taught growing up catholic but instead of just taking someone's word for it I decided to go read Gods word for myself and guess what? There are several people in the bible that God forgave for murder. Instead of just taking what your priest says and running with you you shoujd go read the bible and see what GOD sYs about it. It the end it's His opinion that counts.","commenter_a":"Murder is a sin.....abortion is murder. I have no respect for this pope.","post_message":"Pope Francis has made a major change in the way the Catholic Church treats women who have had an abortion."},{"comment_id":"10153711190119411","commenter_b":"Put them on big boats & send them too the U.S. !! Time for the yanks & Jews too clean up there mess they created !!","commenter_a":"They are provided with bins and skips in most places, yet they just throw their shit everywhere. Dirty pigs","post_message":"NIMBY-syndrome grips little-mittel-Europeans"},{"comment_id":"1011883318957553","commenter_b":"Justice should have been being served all along! Hillary should already be in Prison!","commenter_a":"I release the anointing here","post_message":"We've come too far to turn back now. Make sure you're registered to vote: IWillVote.com"}]
