[{"comment_id":"10153134315811336","commenter_b":"I don't believe a word she says along with that piece of trash ruining our country.","commenter_a":"Would that be illegal voters or the type that is human scum?","post_message":"Clinton's goal, according to two people close to her organization, is to make her second run for The White House more about voters and less about herself."},{"comment_id":"10153134542104705","commenter_b":"Marianne Hutchinson maybe you should move to NZ???","commenter_a":"Merriam Mistlebauer","post_message":"The only thing we have to fear is fear itself.........and spiders."},{"comment_id":"10153144950646350","commenter_b":"Or because girls are just jealous that \"that ugly skank\" will have taylor for life now","commenter_a":"Why is everyone a hater! Give them your best and move on! I think they are a wonderful couple! Congratulations!","post_message":"Congratulations, Lady Gaga!"},{"comment_id":"10156412412225354","commenter_b":"Fire the hoe","commenter_a":"I guess they suspended her because her job, if she is actually a reporter, is just that, report the news and don't add to it or shade it with your opinion. If you want to share your opinion get a job as an editorial writer but don't pretend to be a reporter if that is what you would rather do.","post_message":"What liberal media bias? That's just a figment of your fevered rightwing imaginations."},{"comment_id":"1018417158220401","commenter_b":"That wall will not get built under Obama . To bad election voting wasn't today!!","commenter_a":"Need to do this America Wide. And build the wall Now","post_message":"BOOM! TEXAS Infuriated Obama And Illegals With Their Plan To Protect Texans- Mess With Texas @webpagelink"},{"comment_id":"10153659892877093","commenter_b":"Woman","commenter_a":"Bomb that guy","post_message":"HOUR-LONG STANDOFF: The woman refused to get out of her SUV & cooperate with police. She tried to drive away and was finally taken into custody... @webpagelink"},{"comment_id":"1219604621413341","commenter_b":"A very large dick","commenter_a":"I was born and raised on Ohio and this man embarrasses me","post_message":"Here's a clue: She's not a 62-year-old man, but that's not all. It gets worse. Much, much worse."}]
