[{"comment_id":"927164187324440","commenter_b":"A real woman appreciates foreskin and it's functions. I prefer a whole full functioning penis.","commenter_a":"Yeah well.. circumcised guys get blown more often scientific fact","post_message":"And now for a quick but fun history break from CollegeHumor. - Rollie Williams"},{"comment_id":"1778254899059301","commenter_b":"Someone take care of Bernie so Lizzi shuts her piehole, please.","commenter_a":"Lester Holt seems to be giving Hillary longer time to speak than Donald!!","post_message":"TheDC presents the first debate between Hillary Clinton and Donald Trump. Starting at 9:00PM ET."},{"comment_id":"10156208772020354","commenter_b":"Now","commenter_a":"I agree....!","post_message":"\"We’re like… Charlie Brown trying to kick the football every time and they keep taking it away…I encourage the Republican Party to get off their ass and fight like we pay them to.”"},{"comment_id":"10153461331093635","commenter_b":"Do you know common law as well as you think you know the Bible? Courts of common law MAKE law. While Congress enacts statutes, the courts write case law. So, let's put to rest the ERROR that courts don't make law. If you don't believe me, find me the statute in your state that defines the elements of slander. The decision in Obergefell doesn't require that you do anything, unless you are a marriage officiant, so I don't see how you can refuse to obey the decision.","commenter_a":"The Supreme Court \"ruling\" is NOT the Law! It's only the insane opinion of 5 corrupt arrogant judges that think they can wield more authority than God Almighty!","post_message":"No Gay Marriage in Alabama, Chief Justice Roy Moore Says"},{"comment_id":"10154467754523010","commenter_b":"@username .... Look who's talking?! Trump got his mistress pregnant, that's were his second daughter came from. Malania said, in her plagiarized speech, that she Trump had been together 18yrs....Trump was still married to wife number two at that time! Children with three different women!!!!! Can you imagine what the Republicans would be saying, if that was Hillary?! Hypocrites!!","commenter_a":"He and Bill should hang out since they both cheated on their wives multiple times. Nothing like knocking up the maid. #NeverHillary #ImAgainstHer #VoteTrump","post_message":"Not quite hasta la vista to the Republican party."},{"comment_id":"1330647500288610","commenter_b":"Killers should be punished .","commenter_a":"evil","post_message":"The U.S. Fish and Wildlife Service said Thursday that necropsies had ruled out diseases as a cause of the eagles' deaths."},{"comment_id":"10153245787992507","commenter_b":"I never liked that women .","commenter_a":"She is Just not a good person ......","post_message":"Ann Coulter brought knives to a gun fight on The View."}]
