[{"comment_id":"10155187593643352","commenter_b":"Women do the same thing every day...I'm happy for these guys...lol","commenter_a":"He need a damn job like Mary j blidge husband. They some damn bums","post_message":"Do you believe this? Lamar Sally is taking Sherri Shepherd back to court for an additional $75,000 on top of the $4,100 in child support she already gives him every month. What is he smoking? ----> @webpagelink"},{"comment_id":"10153825929880399","commenter_b":"Domestic Terrorists","commenter_a":"Let's say Trump gets defeated; narrowly or by wide margins, makes no difference. Will his supporters begrudgingly acknowledge defeat in the public forum of a democratic vote? Will they accept hat their ideas and policies, such as they are, are not accepted by the majority of their fellow citizens? I don't believe they will. And what then? Will they turn to other methods to advance political ideas that cannot be achieved through conventional democratic means? And what will we call them then...?","post_message":"Josh Marshall \"You can say all sorts of things about these folks being crazy, or extremists or whatever else. But set aside all these evaluative or partisan interpretations and one thing is fairly clear in objective terms: a large portion of the GOP is not satisfied with what can realistically be achieved by conventional political means.\""},{"comment_id":"10153300662806491","commenter_b":"That is fair enough. I read a bit about the current government it is indeed incredibly corrupt and has generated a lot of hatred from the people due to actions which benefited only those in the inner circles. This however does not bode well, civil unrest of this scale does not end well.","commenter_a":"It is a horrible tragedy but it does not warrant for a cabinet to resign. I am confused at why the riots asked for the resignation rather then the changing of the laws.","post_message":"Prime Minister Victor Ponta and his Cabinet resigned Wednesday after mass protests."},{"comment_id":"10153262313634497","commenter_b":"Alan there's no way for Cubans to legally immigrate to the US.","commenter_a":"Ted Cruz the Canadian born of a Cuban and an American that doesn't like immigrants.","post_message":"Texas senator Ted Cruz announced Monday that he will run for president in 2016. Here is what you should know about the first-term senator:"},{"comment_id":"10152960734572014","commenter_b":"They need to leave them alone! Stay out of our business in az this is our state Feds!!!","commenter_a":"These horses must be left alone! They cause zero harm, and countless amounts of pleasure to all who see them! Using the logic of \"public safety\" then why haven't all the bears in our National Parks been removed???? I had an uncle when I was very young who worked for the Forest Service. I'm sure this would shocked by this action.","post_message":"Arizona Governor Doug Ducey has voiced his support for leaving the wild horses where they are."},{"comment_id":"10153507125536749","commenter_b":"So tell me how more gun laws are going to stop criminals and terrorist? or are going to do the only thing you do best Lie ,cheat and screw Americans! @webpagelink","commenter_a":"TURCIA = TU Rusia CIA","post_message":"The Clean Power Plan is part of American leadership on climate change."},{"comment_id":"424819437642651","commenter_b":"I would be in prison because I would whipped her ass","commenter_a":"Oh, come on,@username, act your age! The girl was clearly in the wrong, but the sub lost the battle when he responded to her as he did. He should have immediately summoned help rather than try to argue with her.","post_message":"I wonder how this student would have been dealt with back in the day."}]
