[{"comment_id":"1588290287878104","commenter_b":"Russia is THE ENEMY because the DoD NEEDS to create a paper tiger to keep the world's most bloated military budget fat. Stay conned. Iran is also a made up enemy.","commenter_a":"We are with you President Obama, if you could have run it would have been a third majority vote and we wouldn't all be afraid of what is to come. Russia is our advisary not our friend, stupid people. Thank you for the eight years you have had to put up with the worst Congress in history.","post_message":"In addition, sanctions will be placed on Russia’s two leading intelligence services."},{"comment_id":"1159186317427836","commenter_b":"Yep I pay almost $400 a month and have a $3800 deductible and so far haven't had anything covered except well visit:( my parents pay thousands for coverage now. The money has to come from somewhere.","commenter_a":"How can this be wrong? Why are so many Americans so disdainful toward ObamaCare? I don't get it?","post_message":"“It wasn’t about Democrats or Republicans, it was about our values as Americans...” A touching reminder from one American to another. (via NowThis)"},{"comment_id":"678910242299554","commenter_b":"She needs to ban herself and all the other idiots","commenter_a":"She has no authority to actually ban anything.","post_message":"You'll never believe what Michelle is trying to ban now... Ridiculous. She has no right and no authority to do this. Should we kick Michelle out of the White House?"},{"comment_id":"984815688241627","commenter_b":"She is the best lying POS that know!","commenter_a":"She is the best","post_message":"“If you want a president who will tell you everything that’s wrong with America and who’s to blame for it, you’ve got plenty of other choices.…But if you want a president who will listen to you, work her heart out to make your life better, and together to build a stronger, fairer, better country—then you’re lookin’ at her.\" — Hillary today at the New Hampshire Democratic Party State Convention"},{"comment_id":"1790206457902451","commenter_b":"Michele Obama said Hillary can't run her own house, how can she run the White House","commenter_a":"Bring the jobs back. Throw out the Chinese fakes","post_message":"WATCH: Hillary Clinton and Donald J. Trump go head to head in the final presidential debate, live from Las Vegas."},{"comment_id":"10152968983250736","commenter_b":"What law didn't he follow?","commenter_a":"Judges should follow the law.","post_message":"The judge who hung this photo of Adolf Hitler in the Marion County Courthouse hired a lawyer who advised Citizens United to represent him."},{"comment_id":"10154796550641509","commenter_b":"Liberals must leave the country !!!!!","commenter_a":"Are you interested in joining the illuminati to be rich and to achieve your desires in life? If yes, Add me and Message me now so I can introduce you to the gate way to success.","post_message":"Experts warn that these labels do not really mean very much and can even be misleading in some cases"}]
