[{"comment_id":"10157069343155354","commenter_b":"@username that is exactly what I said she would be the second biggest mistake","commenter_a":"It is about time all realize all that comes out of his mouth are lies he has seven more months to tear our country apart I saw this before his first election do not make the same mistake twice to vote for Hillary she is a continuation of Obama and if she gets in the only way we can restore our fore fathers Constitution is through force I am a Veteran and will stand by the oath I took at enlistment to defend the Constitution against all enemies foreign or domestic so help me God do not screw with my country","post_message":"Obama is a global rock star no more..."},{"comment_id":"662547200602525","commenter_b":"When she is burning in hell she will want to change her mind.. buy the way. Put some damn clothes on you look like a tramp.","commenter_a":"She is so gross!","post_message":"Miley Cyrus just attacked conservatives everywhere, mocking them for believing in Christian 'fairy tales'. This is unacceptable, we stand against Miley 100%. Do you agree Miley should be kicked out of the country?"},{"comment_id":"10157131061465354","commenter_b":"She should have hung herself with the noose. That'll show em!!!!","commenter_a":"Tighten that noose!","post_message":"+++FIRESTORM+++"},{"comment_id":"1480511455341931","commenter_b":"Definition of Goldigger: A woman who dates men purely to extract money and gifts from men; in particular a woman who strives to marry a wealthy man.","commenter_a":"She only came for the boat. Now she's trying to act like she's not a gold digger. Too late","post_message":"This is the Tinder date from hell"},{"comment_id":"1787141981532253","commenter_b":"COME ON! Lock this \"thing\" up already!!! People have spent major time in prison doing FAR LESS than she has.","commenter_a":"It honestly doesn't matter to voters or our govt how bad she was and what she did or if she is a criminal. They just don't want Trump so they will be so stupid and vote for her. She is going to win and it will be game over for our nation and sovereignty.","post_message":""},{"comment_id":"10153668004231037","commenter_b":"Good they can all go to jail with her too","commenter_a":"America is a sick country","post_message":"About 300 people gathered outside of the Kentucky jail on Saturday to show support for Kim Davis."},{"comment_id":"10157713910895354","commenter_b":"@username Palestine did exist until the state of Israel was founded in 1948.","commenter_a":"Come on haters, start shit talking a kid that was brought up right by patriotic parents. You would applaud him for waving a rainbow flag.","post_message":"LOVE THIS. How about a hand for this young man respecting the Pledge of Allegiance?"}]
