[{"comment_id":"10154533749294062","commenter_b":"Lilly Cantor your a dumb young blond and still blind to the horror the earth has to offer so let me educate you . Among these people that actually need help there are terrorist trying to infiltrate us to attack us . So while your feeling bad terrorist are coming over plotting an attack . Bam attack happens then your like awww so sad but don't realize among these refugees there were terrorist . Terrorist are cowards that attack dirty . There goal is killing as many people as they can . So before you let people into our house AKA United states might want to consider would I let these people in my own house not knowing who they are","commenter_a":"Thank you Canada! It will take all of us to save these people from the horror of ISIS. They have already suffered so much and lost everything. The least we can do is welcome them With compassion.","post_message":"Canada will allow 25,000 refugees to resettle in the nation by February, with up to another 25,000 by the end of 2016."},{"comment_id":"722235994591000","commenter_b":"For sure! Madam President for Prison 2016 once Trump beats her.","commenter_a":"i can't wait to be able to call you Madam President!!","post_message":"16 days. IWillVote.com"},{"comment_id":"405687699555825","commenter_b":"They all do it, he was just to stupid and got caught.","commenter_a":"SOP,,,,,since forever!!!! Most all are getting away with it and have since day one!!!!","post_message":"How many politicians are getting away with this every day?"},{"comment_id":"10152665844280667","commenter_b":"If only she would run Elisabeth Warren would get my vote.","commenter_a":"Can't sstnd this women! She DOES NOT and WILL NEVER, EVER vote for her!!! Liar, liar, pants on fire!","post_message":"56% of women have a favorable opinion of Hillary Clinton, a Gallup Poll finds."},{"comment_id":"1368750766478283","commenter_b":"She was with a child!","commenter_a":"This women is a stupid and ignorant person I hope there were no kids around that can very easily copy this stupid act","post_message":"Toronto Zoo officials said the apparent retrieval of a hat was \"a very bad idea\" @webpagelink"},{"comment_id":"486656498389047","commenter_b":"Fuck the fist wtf she got on the left beside the fist!!!? DAMN","commenter_a":"Asking for head. You know all those been about 12\" deep","post_message":"What you doing fellas?????? #WSHH"},{"comment_id":"10154346047721336","commenter_b":"The also gave us mass production cigarettes, fast food, obesity, lung cancer and heart disease. Yeah!!!","commenter_a":"Think about the differences in the 18 year old people now-a-days compared to then. Can you see your 16 year old neighbor going to the recruitment office to try to lie about his age to enlist? They're called \"The Greatest Generation\" for a reason. We'd have everyone trying to sue the government for various reasons rather than fighting. It is a different world we live in, with different core values in the newer generations. Even the older generations are wasting their time debating bathroom rights... THESE kids knew what was important, and were willing to give all for their beliefs. I can't salute them enough, or honor them enough, or thank them enough. And having served overseas for the majority of my time in the service, and living in Germany, I was fortunate enough to see just what the older generation of Germans felt for these people who did so ...","post_message":"We remember, and give thanks. #DDay"}]
