[{"comment_id":"10153565993448271","commenter_b":"Those people are a bunch of Pathetic Savages and Thugs. Just look at their wild behavior. You would think... that the Police should have arrested scores of them. It must had been too much Rock & Roll or Punk Acid Rock.","commenter_a":"I can understand being excited but destroying public property and acting like a bunch of idiots is ridiculous.","post_message":"This is disappointing. While many people celebrated the Broncos' Super Bowl victory peacefully, some were destructive. Denver Police made 12 arrests and thankfully, no one was seriously hurt. @webpagelink"},{"comment_id":"10153311243783690","commenter_b":"Muslims and Crishtians in Kenya have lived among eachother peacefully. How come we never fight religion for thousands of years and these scam bugs are dividing us and using religion because of their own business. Kenya troops has nothing to do being in Somalia. This terror group kill it's own people. If u disagree with them they will kill you even if u are a Muslim . As amuslim somali man, when I was in Kenya I used to play football with Kenyans and respected eachother. They neve harmed me and I never thought harming them because when we know the value of humanlifes. Kenya government should build county police and protect all university, malls, and give good salary to the police and security intelegence. Iam sorry to say this your police are corrupted. Give your police a good salary so they will protect ur citizens and the country. Ethiopian ...","commenter_a":"Just wondering why only Moslem students were freed!","post_message":"\"I am so worried, I had a son who was among the students trapped inside the college, and since yesterday I have heard nothing,\" said Habel Mutinda, an elderly man, his face streaming with tears. \"I tried to identify his body among those killed... I have to do that before the body goes bad in the heat.. I have been camping overnight, it is really hard, it hurts.\" @webpagelink"},{"comment_id":"476672599181287","commenter_b":"Speaking of closet queens... overreact much, Michael???","commenter_a":"This is one of the reasons that many on the right hate him. They believe that when people are treated equally, they (personally) are somehow diminished.","post_message":"President Obama highlights why the Kenyan \"non-issue\" of LGBT rights is an issue."},{"comment_id":"10156248973870354","commenter_b":"that bitch!","commenter_a":"i was sexually harassed by Ashley Judd, she had her way with me, then tossed me aside","post_message":"When will liberal Hollywood stop its War on Women?"},{"comment_id":"879108405613069","commenter_b":"He better watch his back. Killery has a lot of time on her hands now.","commenter_a":"Although Comey has a 10 year term, he can be terminated at the Presidents request. He truly needs to go, as well as his assistants. Trump should start with a new regime that will be loyal to the actual rule of law and not a puppet. Thank God lynch is history.","post_message":"James Comey just received the worst news of his life. America demands answers, and you better bet we're going to get them. Do you think Comey needs to come clean?"},{"comment_id":"1241740062517749","commenter_b":"Keep Hillary & Bernie OUT OF MY STATE!","commenter_a":"Sauce","post_message":"Donald Trump speaking in Denver at Western Conservative Summit"},{"comment_id":"1082224775141850","commenter_b":"Beyonce sucks black stinky dicks","commenter_a":"She's entitled to her opinion but was inappropriate at Super Bowl. People need to boycott her appearances. If enough people cry their outrage maybe it will make a difference. I know I'm fed up with this BS!!!!","post_message":"***FIRESTORM*** An online #BoycottBeyonce campaign to boycott Beyoncé and her music has picked up steam since the pop star performed a controversial tribute to the Black Panthers during the Super Bowl halftime show on Sunday....Developing..."}]
