[{"comment_id":"10154291975578701","commenter_b":"Looks like he will have plenty of room for some illegals there","commenter_a":"Must be nice when all we have is homeless people living on the streets working their ass off just to get by","post_message":"The house was built in 1928 and has nine bedrooms and eight-and-a-half bathrooms. It was sold in 2014 for more than $5 million."},{"comment_id":"10153147409408812","commenter_b":"Terry is trollin trollin trollin, stfu","commenter_a":"2 billion years....lol make fun of me for believing in Santa Claus but you keep believing we could possibly ever know something was 2 billion years old.","post_message":"Scientists: Bacteria discovered that hasn't evolved in 2,000,000,000 years: @webpagelink"},{"comment_id":"10158098122215192","commenter_b":"The Crusades need to happen again in Europe @username. Run out the same invaders once more.","commenter_a":"They should add terrorism to those charges. Just because he is not a muslim, doesnt mean he isnt a terrorist. He sure comes off as a muslim in appearance though. Could be a muslim convert. FBI and other authorities just doesnt want to tell us!","post_message":"Esteban Santiago, 26, was charged with an act of violence at an international airport resulting in death - which carries a maximum punishment of execution."},{"comment_id":"10153671588729342","commenter_b":"I'm a woman who sees her as nothing but lying trash!!","commenter_a":"😷😷😷😷😷😷😷 Please, people... What do you see in her? My mom told me if I don't have anything nice to say, to not say anything at all.....! Killing me on this one.","post_message":"With Hillary Clinton set to speak momentarily at Texas Southern University, ABC13-Deborah Wrigley has an inside look. Watch Live --> @webpagelink #abc13"},{"comment_id":"10154986550662767","commenter_b":"@username DO SOME RESEARCH, BITCH!","commenter_a":"I hope he meets a terrible demise. Like I am talking, Isis style, execution. In high definition, with fabulous audio. Now, I would read THAT book, for sure. I wish nothing but the worst, to this radical islamic Kenyon born, Isis daddy! I wonder what chapter of the book describes Michelle, peeling off sweaty duct tape, and revealing the SCHLONG, that MADE THE FREAK BATHROOM BILL? Trump is wiping any, and everything, this TERRORIST has done. #HeDontMatter #GhostPresident","post_message":"Obama is widely expected to get the most lucrative contract ever for a post-presidential memoir."},{"comment_id":"10152872155116051","commenter_b":"She is a pig.","commenter_a":"Michelle Obama is a beautiful woman inside and out, and highly intelligent. Unlike most of these commentators!","post_message":"Raven-Symone’s take on Michelle Obama-Planet Of The Apes incident left the cast of The View at a loss for words."},{"comment_id":"955239887844766","commenter_b":"Good read. Tells it like it is.","commenter_a":"obama is the biggest pos in this country!","post_message":"I didn't expect THIS!"}]
