[{"comment_id":"10153128143973812","commenter_b":"Cows can't even read","commenter_a":"Japanese people have since killed 78% of all Dolphins seen in this video.","post_message":"WATCH: It seems more like a dream as you watch it, but for Alex Rivest, it was reality as he joined a large pod of dolphins off the coast of Hawaii's Big Island. This video was recorded in late December."},{"comment_id":"10153326562398812","commenter_b":"Oh really? If that had been me, or any other black woman in this country, our black asses would have been thrown under the Jail the first time it happened and my children would have been taken from me with no chance of hardly seeing them let alone getting them back! They would charge me with felony endanderment also! But these two ol'birds get a second chance to do it and even have entitled it 'Free Range Parenting'! Ain't that somethin'! Exploring their independence would happen when they are of the age of independence. If you still write them off on your taxes, you are responsible for them! And just what are these wonderful parents doing while these babies are at the park and walking alone through town for any demented minded criminal to snatch?? SMH! I tell you, it must be nice to live by your own laws and ...","commenter_a":"So it's now a crime for parents to let their kids go to the park? What are they suppose to do put them on a leash and take them out for walkies.","post_message":"UPDATE: 2 Maryland \"free range\" children taken into custody again: @webpagelink"},{"comment_id":"10152736436045496","commenter_b":"negative much?","commenter_a":"Where was the GoFundMe started for her? She lost her job after having a gun shoved in her face, did anyone start a fundraiser? If they did was the link shared? Hundreds of thousands of dollars raised in the name of hate and not one single penny raised for a working MARRIED mother who valued her life over a companies money. Yep, this is indeed a \"Christian Nation\".","post_message":"The pregnant Popeyes manager, who was fired less than 36 hours after a robbery, has been offered her job back. See more: @webpagelink Would you go back to work for the restaurant?"},{"comment_id":"10154373849503299","commenter_b":"Said all of us in January of 2009!","commenter_a":"Very good Mr. Claar!","post_message":"\"Had we understood just how clueless they were, the election result might not have been so shocking.\""},{"comment_id":"1736640533224849","commenter_b":"What are the Muslims doing to make Christian's comfortable?????? We as Christiams MUST stand up for our rights.","commenter_a":"she is a fool! crosses belong in CHRISTIAN churches! maybe she needs to be a muslim preacher. shame on her for denying Christ!","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More 'Comfortable' We are talking about a Church. This is ridiculous. Do you think society is becoming too sensitive?"},{"comment_id":"10153206865573525","commenter_b":"Stfu!","commenter_a":"'Charged' a police officer with a knife ? And she is still alive ? Oh wait, she is WHITE !","post_message":"HOUSE OF KNIVES: Here's a look at what deputies confiscated from a Hernando County woman's home after she charged at an officer with a knife. Thousands of knives and other weapons, along with fake severed limbs and fake skulls. MORE: @webpagelink"},{"comment_id":"10153627829156336","commenter_b":"Who really cares about the name?!!!! Native Americans care about protecting Mother Earth!!!! Get rid of the Pipeline!!","commenter_a":"How about leaving the mountains name alone and concentrate on more important priorities.","post_message":"President Barack Obama is restoring the name of the tallest North American mountain peak – Mt. McKinley in Alaska – to the native Alaskan name of “Denali,” the White House said today. @webpagelink"}]
