[{"comment_id":"10154310279241409","commenter_b":"@username I'm not against deporting any illegal immigrant that cannot qualify for resident alien status. If they have minor children, the children should stay with their deported families, but be allowed the reenter the US after the age of 18 with the proper paperwork. Legal migrant workers are the backbone of many US industries which would not survive without that work force. We don't really need a wall we only need to change the orders that have been forced upon our border patrol officers which makes the ineffective in most interactions with illegal migrants.","commenter_a":"Does anyone know what it is that they are protesting? Do they have any suggestions on how to handle illegal immigration, and the vetting process of refugees and immigrates? This seems like it may just be a way to get a day off work and get on TV.","post_message":""},{"comment_id":"1185052468202276","commenter_b":"@username . Yes, it has worked out very well for me. My wife doesn't just not mind, she really likes my beard. As for the women \" that do were and are not interested\" in me- I couldn't care less, they are irrelevant. I have a beautiful wife. You are right in that everyone has physical preferences, I for one am not attracted to women with silicone breasts and/or mullets. Perhaps one day soon, when you hit the menopause, you might grow yourself a fine, full beard and be proud of it. All the best!","commenter_a":"If you can grow a beard, then why not? I really couldn't care less if someone finds my beard unsightly. You should be proud of your masculinity, not try and disguise it. I spend most of the daylight hours outside, the beard helps protects me from the elements and from those of a nervous disposition.","post_message":"Just one more reason to love beards!"},{"comment_id":"10153956285791880","commenter_b":"@username I'm white. I'm not mad bro. But was that kid in Ferguson mo a thug and literally just robbed. Convenience store? Sure back lives matter.. I'm indifferent tho.. Any race, sex or creed comes at me Wrong I'll end you. Period.","commenter_a":"All the white ppl mad!! Lmao, after the 400+yrs of oppression that they weren't victims of, they want to be included in a black lives matter movement... Smh, never been discriminated against, but black lives matter is a racist cult?? Can't c the forest from the trees...","post_message":"The Facebook CEO issued a companywide memo chastising employees who have been crossing out the phrase “black lives matter” and writing “all lives matter.”"},{"comment_id":"10153438446318984","commenter_b":"Give her nothing she encouraged the animals","commenter_a":"hire the thugs who destroyed, burned, looted and rampaged in your streets...serves 2 purposes, gives them a job, gets them off aid, and the plus........your city gets cleaned up by those who wrecked it, with your permission..so use your dollars, not mine","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling. Are you outraged by the Baltimore mayor's request?"},{"comment_id":"10153075666953812","commenter_b":"Inhuman barbarism was the assassination in Paris. Please accept honest condolence to families.","commenter_a":"Prayers for all!!","post_message":"BREAKING: French president: 12 dead in \"terrorist operation\" on Paris-based satirical magazine: @webpagelink"},{"comment_id":"1108284169190819","commenter_b":"Bitch","commenter_a":"Remember Vince Foster!! He was murdered and the Clinton's look like they did it!","post_message":"Hillary Clinton has got to be sweating this one... Do you think this Dem presidential candidate needs to be held accountable for her actions?"},{"comment_id":"10157782729605725","commenter_b":"She's a fake!!","commenter_a":"Mlp","post_message":"An honor to be at the Polish National Alliance in Chicago, Illinois - meeting with & speaking to the Polish American Congress. Thank you!"}]
