[{"comment_id":"10153140414189071","commenter_b":"Read previous comments about the difference of Free Climbing and Free Solo climbing.","commenter_a":"Incredible athleticism yes!free climb? not if he's got a rope.","post_message":"What an incredible athlete."},{"comment_id":"10154185145943132","commenter_b":"Sue happy! These ladies are cracking me up. They have no clue.","commenter_a":"OH so this is how they make a living. Hard work paying off there. Unbelievable.","post_message":"It's always polite to ask permissionjust ask Kendall Jenner."},{"comment_id":"10156663842160354","commenter_b":"KILL THEM Europe.","commenter_a":"This is what the fool, Obama wants for America .","post_message":"A DOZEN PHOTOS... \"Parents have been advised to keep their children indoors as migrants roam through playgrounds, while on residential streets police wearing riot gear stalk gangs of migrants.\""},{"comment_id":"10155046621507704","commenter_b":"No way these girls aren't boozin b4 these press conferences, no way...","commenter_a":"If these morons didn't play loud music in the background, you might actually be able to hear what the people are saying.","post_message":"They're losing it! In more ways than one..."},{"comment_id":"687088591481719","commenter_b":"She can pack up and go home and take her sharia law with her. And she can pay her own way, too!!","commenter_a":"Yes it doe's.","post_message":"Woman goes on TV and points the finger at Americans for this. She has some nerve. What a ridiculous statement. Does this infuriate you?"},{"comment_id":"10154272140216336","commenter_b":"You do not agree with me because I want Trump to build the wall, and I want Hillary in jail!","commenter_a":"This clown gave cartoon maps to his citizens to help direct them to places in our border where they could run accross illegaly to work and send money back to Mexico. He's bought by the cartels and Fox is lame for giving him a voice in American politics!","post_message":"\"Pay for the wall? Why? Who is going to pay for the war on trade, the war on China's trade – it's [the] United States.\" Former Mexican President Vicente Fox Quesada said he is \"not for open borders,\" but advocates an \"intelligent and wise\" way to deal with immigration."},{"comment_id":"1345804005472359","commenter_b":"MANY WOMEN HAVE ACCUSED BILLY OF RAPE. THAT PLUS THE TRIPS TO EPSTINES ISLAND TO RAPE UNDER AGE SEX SLAVES THERE.","commenter_a":"WE ALL KNOW THE TRUTH..BILL AND HILLARY ARE AS MUCH OF A DISGRACE AS OBUMMA...GO TRUMP..","post_message":"Weak..."}]
