[{"comment_id":"10156504920260389","commenter_b":"Yes. Keep replying on this joke of a feed.","commenter_a":"Do we expect Sheriff Clarke to say anything different. Why doesn't Mr. Hannity ever have some real dialogue on his show. I would have more respect for him. I have been following Mr. Hannity for about 10 years now. His revolution is taking forever. I don't think it will ever come. if Mr. Trump is elected is that the revolution. Senator Cruz is the only true Conservative. But in today's world conservatism means unyielding which is not a good thing. President Reagan would be turning over in his grave if he saw what was happening to the conservative movement in our country today","post_message":"Milwaukee County Sheriff David A. Clarke Jr. had some strong words on \"Hannity\" tonight for President Obama, Hillary Clinton and the Democratic Party in the wake of Obama announcing his planned executive action on gun control."},{"comment_id":"1850461285187986","commenter_b":"If hillary clinton introduced herself to me as Hillary Clinton I wouldn't beleive her.","commenter_a":"#alwaysHillary","post_message":"Hillary Clinton holds a rally in the battleground state of North Carolina."},{"comment_id":"10152884821337093","commenter_b":"Why a woman?","commenter_a":"If it ain't broke don't fix it","post_message":"Which American woman deserves to be the new face of the $10 bill??? @webpagelink"},{"comment_id":"10152925868341336","commenter_b":"I agree Joanie, impeachable offense to release enemies from Gitmo to try to kill Americans again!","commenter_a":"Obama has committed treason with this big time!!! Why hasn't congress started impeachment.","post_message":"The U.S. Army has decided to charge Sgt. Bowe Bergdahl with desertion, according to Retired Lt. Col. Tony Shaffer. He told Bill O'Reilly that the Army \"wants to do the right thing\" but The White House \"wants this to go away.\" @webpagelink"},{"comment_id":"1792755454298802","commenter_b":"Yeh and you and your daughter took some of those jobs to China.. hypocrite..","commenter_a":"Jonathan oh this guy. How many apologies will he have to make?","post_message":"US presidential candidate Donald J. Trump has issued this apology for obscene comments he made about women in a newly released videotape from 2005. Follow the latest on this story: @webpagelink"},{"comment_id":"710829429070596","commenter_b":"That a girl","commenter_a":"That's all you got NBC? IF that is even true, it pales in comparison to the lies and scandals of the Clinton's. Both candidates are far from perfect but I'm going with the one who doesn't support the butchering of full-term babies, who doesn't support millions of immigrants being granted citizenship, who is in favor of term limits and ending special interest groups in DC, who will create jobs through trade reform rather than the government creating yet another program and who will reform the health care system and end Obamacare, which, in case you haven't checked, your policy is going up by 25% next year, who supports our military and vets and our police officers and supports the NRA and my second amendment rights and the list goes on and on. If the truth were ever told by the media, this would be no contest.","post_message":"Federal agencies are barred by law from endorsing candidates in political elections"},{"comment_id":"10153184013859255","commenter_b":"ThankYou","commenter_a":"Who was it that said \"You have to have some intelligence to realize how stupid you are\"? No intelligence on display with those who still believe in the KKK. Haters and bigots.","post_message":"Another day in post-racial America."}]
