[{"comment_id":"820316618158915","commenter_b":"Kick his ass out of this country,","commenter_a":"Black price of shit","post_message":"Trump Hating Thugs Split On Flag… Look What Happens Next [VIDEO]. If he was a real man and doesn't like this country or our flag he should leave. Do you think he should deported?"},{"comment_id":"497217833799843","commenter_b":"American does not need to bring any of them here. They need to return to their country and fight for it.","commenter_a":"some dumb asses do not see it..as I say only welcome children and women....period...send those men back and tell them to fight for their country......those are ISIS men....they do anything to get in the civilized countries and take over.....wakw up people","post_message":"Can you see the BIG difference?"},{"comment_id":"10154134497810575","commenter_b":"I'm so sorry for your lost child. It sad and terrible we are being made to put up with these illegal criminal invaders.","commenter_a":"Hang him and the next ten people who allowed him to be here.","post_message":"NEW YORK GIRL DIES AFTER BEING HIT BY TWICE DEPORTED ILLEGAL ALIEN...."},{"comment_id":"10153242003291636","commenter_b":"Who gives a s**t the programs shite anyway I have better things to do with my life than watch reality shows","commenter_a":"Hannah Daw not the reason you thought","post_message":"'I screwed up'"},{"comment_id":"10153276508787144","commenter_b":"I certainly hope you don't have daughters with that repulsive, misogynistic mouth.","commenter_a":"Grace under fire?? I just love how you baby murdering dirtbag sluts try to make yourselves out to be the victims instead of the human beings you kill. Why don't you show the exchange how it really happened? @webpagelink","post_message":"Yep."},{"comment_id":"984015725050561","commenter_b":"Carla. Go back to school honey. You are so stupid.","commenter_a":"Compare this: Melania Trump became a US citizen and said it was \"The greatest privilege on the face of this earth.\" Michele Obama said in a speech, \"For the first time in my adult life I am really proud of my country.\"","post_message":"Donald J. Trump’s campaign chairman denies allegations Melania Trump lifted her convention speech from Michelle Obama’s in 2008, claiming such an act would be \"absurd.\""},{"comment_id":"1003038786410224","commenter_b":"Boycott George Clooney!","commenter_a":"Doesn't he still support Clinton?","post_message":"George Clooney is right: the powerful influence of money in politics is obscene, and it is my belief that you cannot do away with big money in politics if your campaign is funded by big money."}]
