[{"comment_id":"10152876671446336","commenter_b":"Lol really woman. I think its sweet","commenter_a":"Davetra Fleary","post_message":"Twenty years ago, Brittney Husbyn and Briggs Fussy walked down the aisle as flower girl and ring bearer at a wedding. Saturday, they did it again… only this time as bride and groom."},{"comment_id":"10154714016861509","commenter_b":"Now how is that wall going to work?","commenter_a":"Carlos","post_message":"It even had its own elevator."},{"comment_id":"941727655948060","commenter_b":"the reason Trump is doing so well is that most Conservatives like me are sick of the way our country has gone down for the last 7 years..it got worse not better. Veterans treated shamefully especially the wounded in our VA hospitals. THe amount of our money that has been given to terrorist countries that hate us. And the flooding of our country with illegals who are given everything when we have many poor who could use help. Plus we do not know who or what has been coming here. Some that could be dangerous to our citizens and have been..","commenter_a":"Trump!!","post_message":"The Indiana primary may be the end -- and it's THIS WEEK. Make your voice heard by clicking the link & voting now."},{"comment_id":"1766583846919055","commenter_b":"I think she is an egotistical show-off.","commenter_a":"I think nothing about it.","post_message":"What do you think of the dress?"},{"comment_id":"1089383177744009","commenter_b":"eeeuuuuuuu - did she get that in her back yard?","commenter_a":"That looks awful.","post_message":"You as a parent do not know what's best for your kid. You don't know how to raise your kid right. You certainly do not know how to properly feed your child, and Michelle Obama and the government are going to do it for you and they're not gonna give you any choice in the matter."},{"comment_id":"10153951391170579","commenter_b":"We have millions of people on welfare because Illegals are doing the jobs they are qualified for...we can use guest workers legally if we need more workers...I don't see us the US needing them though","commenter_a":"The republicans are certainly changing their tune on immigration. But they have no choice. Nobody in their right mind believes that we can deport all illegal immigrants without devastating our economy and millions of families. Even Trump admitted that they could come right back, a weak attempt to lessen the blow of his ridiculous plan. Yet another win for Bernie Sanders, who has no need to flip on issues to garner support.","post_message":"Your takeaway from the 4th Republican Presidential Debate?"},{"comment_id":"1694550140816786","commenter_b":"Misogyny!... misogyny everywhere!","commenter_a":"RIP, Chyna. But in your next life don't be a wrestler and a pornstar. Two terrible choices for a woman.","post_message":"She was known as the \"Ninth Wonder of the World\". #RIPChyna"}]
