[{"comment_id":"10157053900475354","commenter_b":"Crooked Hillary could not/ would not keep America and Americans safe. She ignored the call for help from Ambassador Stevens even before the attack. Then she tells Americans one story while she tells her daughter a different one...crooked, crooked Hillary can't be trusted.","commenter_a":"The BLM and anybody who supports them are just a bunch of RACIST ass holes and Dirty Fukn TRAITORS to themselves and to the USA. \"Multiculturalism\" and \"diversity\" is all BULLSHIT and VERY DANGEROUS to EVERYBODY it will DESTROY everything. Islam is DEATH. DEATH to Islam long live the Infidel","post_message":"BOLD."},{"comment_id":"1809962622565411","commenter_b":"Yeah, they need to kill all of them. If only they would turn our troops loose, so they could get the job done.","commenter_a":"Go for it.","post_message":"U.S. Pilots Bomb ISIS, Killing 40 Jihadists. They need to be destroyed. Do you support our troops?"},{"comment_id":"1555472744739839","commenter_b":"Screw them! Go get a job and pay for your own damn food.","commenter_a":"Get off your butt and look for work. In meantime, thank which ever god you pray to for living in a country that gives Food Stamps!!","post_message":"This is outrageous. If you're that picky get a Job and buy whatever you want."},{"comment_id":"1624969957723265","commenter_b":"That poor little girl. Her mother could have killed her driving around while heavily intoxicated. She clearly had time to buy and drink alcohol but not make sure there was food in the house???","commenter_a":"Don't have any sympathy for a mother that drives drunk with a child in the car. She could have killed her or someone you love. She should lose custody of the child.","post_message":"If you have blood flowing through your veins this video should make you furious! Watch it HERE: @webpagelink"},{"comment_id":"1452171914802834","commenter_b":"The only thing Hillary Clinton is going to do is be the 2nd woman to run for president and loose.","commenter_a":"Go Hillary it's an excellent speech","post_message":"\"Now Donald J. Trump says, and this is a quote, 'I know more about ISIS than the generals do….'\" \"No, Donald, you don't.\" Read more of Hillary Clinton's DNC speech: @webpagelink"},{"comment_id":"10153782383018984","commenter_b":"Yes I agree with the teacher. With the country like it is, how did she know it was not a bomb. Thank, to her for keeping our students safe. I wish they would all go back to there own Country .","commenter_a":"Just wanting to get more free money. They need to kick the whole damn family out of the country.","post_message":"There's already plenty of controversy and speculation surrounding the case of the 14-year-old boy Ahmed Mohamed, who brought his clock to school - and now what his family just did is taking it all one step further, Do you still stand by this school's decision to call the authorities?"},{"comment_id":"998442540272524","commenter_b":"She is bought and paid for and if she's president what happens then?","commenter_a":"She's a crook and lies about where money comes from and buys the illegal immigrants vote","post_message":"By the way, it ILLEGAL for foreign nations to influence the outcome of an election. Just so you know. @webpagelink"}]
