[{"comment_id":"10155064205902178","commenter_b":"Don't they know it's a \"shark free zone\"! This method works for criminals who take heed to gun free notices.","commenter_a":"Joe Daniel","post_message":"An 11-year-old boy was bitten by a shark off the coast of North Carolina yesterday, the second incident in as many weeks. >>>wral.com/@username"},{"comment_id":"10153932351055950","commenter_b":"FEMALE FAT FARMS WILL RULE TRUMP PRESIDENCY... .LOL.LOL.LOL. FAT CHICK'S BEWARE","commenter_a":"If Hillary cared so much about women she would not have brought this woman's name up. That just shows she will use anyone to get her agenda out there. She's Evil. Just remember she was the person who brought this up on debate night.","post_message":"This former Miss Universe says Donald J. Trump's comments about her brought up bad memories from 20 years ago when she gained a few pounds after winning his beauty pageant."},{"comment_id":"10153885650817061","commenter_b":"@username , please take the tin foils off. For Benghazi, blame the Republicans. All of what you are saying about HC is all conspiracy based. EVERY investigation ha cleared her of wrongdoings. She is not perfect, but far better than that lying rapist BIGOT woman hater thief (ask the thousands of people he stiffed out of their money) IDIOT DT.","commenter_a":"Oh...don't mention Indiana! We are not proud that we have idiots voting for him!","post_message":"Sign of the times: Donald J. Trump supporter from Indiana says he's gone to great lengths to protect his yard sign with the candidate's name on it. So far, he says, \"I'm 2 and 0.\""},{"comment_id":"1382661791756865","commenter_b":"Somebody pleass shut this fatass up.","commenter_a":"some day little fat man someone is going to shut your mouth when you talk about things u don't know anything about.u are just mouthing off cause u want to be a big ass --- hum you already have a big ass --- so get off President Trumps back. he is only do what he needs to do to keep America safe","post_message":"Michael Moore always finds a way to be even more classless than he was minutes before! That seems to be his only real talent."},{"comment_id":"10154169581782042","commenter_b":"@username dude are you serious?","commenter_a":"It will be shared with other waitress as a group in the restaurant where she most likely get $200 if there are 5 people working and 15 % to bar back #restaurantlife","post_message":"When an 18-year-old waitress saw a customer talking to her boss, she feared she had done something wrong. What happened next brought her to tears."},{"comment_id":"1701853746697814","commenter_b":"Dan Chow I maybe a old , but I am not fool !! I been follow Hillary since She was First Lady !! I know how amazing She is !! If you care to know the true about this Lady !! Check: ADDICTINGINFO.ORG list of @username accomplishments !! This are the Facts !!!","commenter_a":"2008 was a President Obama Time !!! <3 Hillary is that Leader for this TIME !!! <3","post_message":"In 2016, everything we’ve accomplished together is on the line."},{"comment_id":"1016327315093412","commenter_b":"It is long overdue that a woman is president, and more (sane) women are in Congress. Just don't think Hillary is deserving .","commenter_a":"Sorry, but it is time,long over due for a woman to start running this country. Look at the other countries that are run by women, get smart and vote Hillary Clinton in, she is very smart and she has Bill with her. So Bill had a woman under his desk,who cares. He wasn't sexually frustrated,if only the last 3 presidents had a woman under his desk,we would have a better run country. Now I'm not saying men should cheat, but a blow job from some stupid ass hussey, wouldn't hurt.","post_message":"It's time. Thank you, Winning Democrats!"}]
