[{"comment_id":"1188852334521434","commenter_b":"These drugs are coming across the southern border.... #buildthewall","commenter_a":"I DON'T BLAME THEM I BLAME DRUG RULES TOO BAD","post_message":"The photos show a couple passed out in an SUV with a 4-year-old child sitting in the back seat."},{"comment_id":"10155275257336037","commenter_b":"Bahahahahahahahaha your trendy hashtags will change everything. Lmao. #CryHarderBitch #YouStillLose","commenter_a":"Trump is the new media now.He is telling us like it is.Lame stream media wasnt telling us about Sweden.They didnt tell us about Bowling Green.They didnt tell us about Atlanta.They didnt tell us about the massive voter fraud.They even said he lost the popular vote.They falsly reported on the size of his inauguration.Biggest ever.He was there to tell us that Barack Obama’s birth certificate was a fraud.Without trump we wouldnt have know that thopusands cheered from the roof tops of NJ when 9/11 happend.He's in charge now so suck it snowflakes.Trump 2018!!!","post_message":"FOLLOW LIVE: Coverage of upcoming Presidents’ Day protests in New York, D.C., and Los Angeles @webpagelink"},{"comment_id":"10153515397661509","commenter_b":"Race and gender identity are two totally different issues lol","commenter_a":"That's disrespectful. If it had been a white person doing a racist joke. There would be no question if he crossed the line.","post_message":"Do you think Jamie Foxx crossed the line? Many viewers of the iHeartRadio Music Awards weren't too happy about his Bruce Jenner joke: @webpagelink"},{"comment_id":"10153483472878188","commenter_b":"How can he even be called a woman when he still has his man parts?","commenter_a":"I cannot phantom bestowing the Arthur Ashe Award to this person that has done nothing to deserve it. nOTHING","post_message":""},{"comment_id":"10156034180320389","commenter_b":"He is a crybaby and moron. I used to watch him until he started with the crocodile tears and he looked so pathetic. The media should report news and not shove their opinions on anyone. If he hates Trump, that's his opinion and he should not voice it on the air","commenter_a":"It's crazy how Trump fans treat those who disagree with them. Many Megan Kelly fans and Beck fans threw a fit that someone didn't believe as they did about Trump. Is this how we treat each other? Drop people like a rock when they disagree with us? Start name calling? Sean answered Beck honestly and with class. Which is more than most of you are doing. I have great respect for Beck AND Hannity. Even if I don't always agree with them. But after years of following Glen Beck- it's clear that nothing drives him more than a love for this country.","post_message":"My response to Glenn Beck who criticized me earlier this week for supporting Donald Trump."},{"comment_id":"1095951603760962","commenter_b":"Don't forget her daughter got knocked up","commenter_a":"and her 'classy' son beat up his girlfriend...great family values","post_message":"When it comes to Donald J. Trump, the gloves are off."},{"comment_id":"10153991017722235","commenter_b":"If you give a lady $10 and rape her, it doesn't make her a prostitute. It makes you a rapist.","commenter_a":"Georgia, Georgia, what are you doing. You were devastated in the civil war for your enslavement of people now you demonstrate you might need another lesson. Someone dig up General Sherman.","post_message":"YES!"}]
