[{"comment_id":"1616469018618909","commenter_b":"Trending: Obama's Fault Racism Gun Violence Marines holding umbrellas Climate change (that is simultaneously not real) ISIS Al Queda Hot days Cold days Rainy days The economy Abortion rate Teen pregnancy rate Hurricanes Tsunamis Butterflies that flap their wings and cause Tsunamis Terror attacks in Paris Russia attacking Ukraine North Korea hating everyone Syrian Refugees Illegal Immigration Muslims Christians hating Muslims Cops \"fearing for their lives\" #BlackLivesMatter Fox News hatred The wealthy 1% Everyone else Fantastic Four being a horrible movie _________ Fill in the blank.","commenter_a":"I don't see how you blame our first African American president for racists coming out of the wood work.","post_message":"Barack Obama is seen as one of America's most racially polarizing presidents, numerous polls show. So will tensions ease once his term ends? #RaceAndReality"},{"comment_id":"524517941072119","commenter_b":"This is USA .Muslims can eat pork and go to hell.","commenter_a":"Yall think they are pissed now ????? we aint done with them yet, still gotta play Cowboys and Muslims and then those who are left get to play the part of the Mexican Army at our reenactment of the \":Battle of San Jacinto\" although this time we aint takin prisoners ... Remember the Alamo !!!!!!","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy. Let them be angry. This America and if you don't like it, get out. Do you agree that Muslims should assimilate or leave?"},{"comment_id":"10154298201954087","commenter_b":"STFU","commenter_a":"He's such a comedian.","post_message":"Lindsey Graham insisted Trump's administration look into the Clinton Foundation with an \"independent view, not a political agenda.\""},{"comment_id":"10153635584924575","commenter_b":"What about rap videos or BET...come on people","commenter_a":"All them white girls in one video.....thats RACIST","post_message":"A University of Alabama sorority has taken down a recruitment video after receiving a lot of criticism. One website described it as, \"Stepford Wives: College Edition. It’s all so…unempowering.\""},{"comment_id":"609176595931357","commenter_b":"Not shark tale though 😂😂😭😭 Alex McKay @username","commenter_a":"Jasmine Elise","post_message":""},{"comment_id":"1091887850889750","commenter_b":"She is a POS racist cluck bum bitch and NFL you Scumbag should give all the ticket holders half their money back","commenter_a":"What about the planners of NFL Super Bowl did they not know what her performance was about there's a little bit more to blame then just solely on Beyonce. The Super Bowl planners NFL new what hurts halftime show was about was not announced or advertised of being such as low blow off base nutcase to let it going on so take that NFL maybe you should pay attention what's going on around you to","post_message":"Last weekend Beyonce got to have her racist fun at the Super Bowl. But now she's gotten some massive bad news. Looks like you can't go off and support cop killers without having to pay a big price later on. Boom!"},{"comment_id":"10154608110303701","commenter_b":"She's a real winner. Just block her idiot ass.","commenter_a":"Good hes a pos","post_message":"A Sherwood man is being charged with manslaughter for a crash that killed a 2-year-old in Deschutes County, according to police."}]
