[{"comment_id":"10157007075205725","commenter_b":"#BOGOSale - FINAL CLEARANCE: Hypocrite Hillary AND Slick Willie = two for the price of one!! CLEARING THEM OUTt!! #TrumpTrain #MakeAmericaGreatAgain","commenter_a":"Trump versus Hillary, lets do this voters. We do NOT need Hillary (Obama) Clinton in the White House. Thanks Mr. Trump. Vote Trump...lets get him to Washington!","post_message":"So interesting that Sanders beat Crooked Hillary in Indiana. The dysfunctional system is totally rigged against him!"},{"comment_id":"864523933643860","commenter_b":"Judy. Are you really that stupid? She's a doormat that stayed with a moral less husband for decades just for power. You have low standards.","commenter_a":"Hillary is such a threat to them, they will do anything to hurt her.","post_message":"“Secretary Clinton used one email account when corresponding with anyone, from Department officials to friends to family. A month after she left the Department, Gawker published her email address and so she changed the address on her account.” -Clinton attorney David Kendall"},{"comment_id":"10158604415035206","commenter_b":"@username The woman can speak five languages... get a grip","commenter_a":"I have never said anything negative about Barack Hussein Obama's wife, but since that's gonna be the new norm for the liberal lunatics, let me just say this. Melanie Trump has more class in her little finger than Michelle Obama ever had or ever will have. But just look at all the jealous women who are putting her down and all the worthless men with mangina's who are putting her down. You people are pathetic.","post_message":"“Melania will be an excellent first lady who will take Slovenian values of generosity, loyalty and trust to the United States and the world,\" said one fan from Melania's hometown."},{"comment_id":"10153997171416486","commenter_b":"Fools don't you see that your woman are raped by Muslim refugees.Germany is now blocked Christian immigrants in their country.","commenter_a":"Some of the biggest idiots .You people are.","post_message":"\"...we think that this is our time as Catholics to be the Good Samaritan, regardless of what is expected of us from countries overseas.\""},{"comment_id":"902972626429153","commenter_b":"This has nothing to do with muslims.Shut up!","commenter_a":"give muslims a planet and they'd still not be satisfied","post_message":"The barbarism continues"},{"comment_id":"10150666434674999","commenter_b":"Haters are a sure sign that future President Trump has hit the nerves of all those left wing panty waste liberals that pulled their heads out of the sand just long enough to realize that Hillary isn't the omnipotent goddess they thought she was. Dry those tears little babies. Like.....wipe it with a cloth.","commenter_a":"This country is such a mess, it would probably take a Donald Trump to get us back on track. Shows how far we have sunk. Thanks Obama.","post_message":"Something unmistakable has happened to Donald J. Trump since he announced his campaign for president in June: He has become a better candidate."},{"comment_id":"10153446505791130","commenter_b":"I prefer the Wicked Witch is dead!","commenter_a":"Olha, Fer Montano!","post_message":"A songwriting expert reveals the reason."}]
