[{"comment_id":"692289614253147","commenter_b":"Doubt it,he won't say anything different then he has already,he's got a small mind and can't think beyond the paper and crayolas","commenter_a":"No,it's not...after his scripted speech Hillary IS going to have a lot of problems","post_message":"This made my morning. I hope you guys enjoy it as well. ~Natalie"},{"comment_id":"1007015132691568","commenter_b":"They're a success for the home invaders, they don't have to worry about getting shot now.","commenter_a":"Sadly gun crime happens so many time in the USA one wonders why they just don't legislate for firmer gun laws, but then again that will never happen...","post_message":"'America is a financially failing filth farm', he ranted"},{"comment_id":"10153731561481336","commenter_b":"You're an idiot Elizabeth!","commenter_a":"The shooter was a conservative republican. That seems to be a common theme in mass shootings.","post_message":"One law enforcement official described the shooter as an \"angry young man who was very filled with hate.\""},{"comment_id":"10153630936701955","commenter_b":"Idiots are using it for crack and other illegal substances !","commenter_a":"What a shitty headline. The doctors put him in a coma, not the e-cig. Drudge should have had more sense than to repost such drivel.","post_message":"Man In Coma After E-Cigarette Blows Up In His Face..."},{"comment_id":"10153961752341037","commenter_b":"Duh, obamacare is funded by government (taxpayer dollars)","commenter_a":"If obamacare is so great, why is it that the clintons & sanders are not enrolled in it?","post_message":"Bernie Sanders airbrushed the complexities of trying to overhaul health care all over again and Hillary Clinton offered a selective reading of her rival's record on gun control in the latest Democratic presidential debate."},{"comment_id":"632963596894219","commenter_b":"No one with half a brain watches her ANYWAY!!!","commenter_a":"WHO'S OPRAH","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"},{"comment_id":"10157462499315093","commenter_b":"Hillary Rotten Clinton is the most corrupt person to ever run for president...she is like Crabby Appleton,Rotten to the core....","commenter_a":"Hillary Rotten Clinton is the most evil and most corrupt politician in our country's history hands down.","post_message":"They gave money. She gave them meetings. It's a conflict of interest. It's corrupt. She's still lying about it."}]
