[{"comment_id":"10152861667311045","commenter_b":"I don't agree with abortion, but when you have an abortion the baby dies, it's suffering is over. Women who do drugs while they are pregnant can cause problems for these children their entire lives. And we foot the bill for it. They should be charged, never given their kids back and the law should stop having these double standards. And if they didn't cause their kids damage then they still did the equivalent of putting a gun to its head and playing Russian roulette, which would also be child endangerment and child abuse.","commenter_a":"Does anybody find it ironic that they can be charged for exposing their unborn babies to drugs while it is legal for them to kill/abort those same babies? Either unborn babies are people with rights or they aren't. Odd how \"the law\" can have it both ways.","post_message":"Two Shoals women are charged with exposing their children to drugs. Both women are pregnant, and are in the community corrections program. Investigators say the two failed mandatory drug tests."},{"comment_id":"935958373261405","commenter_b":"Can she get any uglier.","commenter_a":"Trash just like her parents glad they are gone","post_message":"This speaks volumes about who they are as people. Thank the good lord we are done with them. Were the Obama's the worst first family ever?"},{"comment_id":"860168877353787","commenter_b":"She has such a nasty attitude and doesn't try to hide it. Very haughty woman.","commenter_a":"She looks like she's giving him attitude. Why's does she always have \"that\" look on her face when she looks at whites and anyone else she considers below her?","post_message":"Caption this photo in the comments! ...... Former President George W. Bush and first lady Michelle Obama speak before President Barack Obama delivers a speech and takes a symbolic walk across the Edmund Pettus Bridge. (AP Photo/Bill Frakes)"},{"comment_id":"10154916215254330","commenter_b":"She should be arrested and lose her job.","commenter_a":"I am not saying this is right but I have seen countless similar things of people doing this type of thing to images of Obama so everyone should just chill with the outrage , where was the outrage when it was Obama images being hung !!","post_message":"The video shows a woman pointing what appears to be a toy gun at a video of President Donald Trump and pretending to shoot at him several times, saying \"Die!\" ---> @webpagelink"},{"comment_id":"10156255636920354","commenter_b":"At least admit you got beat up by thugs...","commenter_a":"To bad the band did not hit him in his lying liberal mouth.","post_message":"Things are about to get VERY interesting..."},{"comment_id":"10153085738765163","commenter_b":"Yep @username. Sophia was a crazy cat lady. Lol","commenter_a":"Renee Rudd","post_message":"SHE WINS. 😂💛😸"},{"comment_id":"10153674546377293","commenter_b":"Belief structure is the exact same thing. Splitting hairs to rationalize your views.","commenter_a":"They got a point. It's not a religion by definition, but it's a belief system. Praying affects the individual doing it; only those offended are the people that can't stand the sight of it. They hate, if you will. Equality means just that, though. Can't restrict one group only.","post_message":"“This is very scary,\" a parent wrote."}]
