[{"comment_id":"1786349714946678","commenter_b":"Lol! She is a lunatic!","commenter_a":"She is a racist huh?","post_message":"Former Arkansas Gov. Mike Huckabee asked Monday if House Minority Leader Nancy Pelosi is racist after she said Housing and Urban Development Secretary nominee Ben Carson is \"disturbingly unqualified.\""},{"comment_id":"991233837660061","commenter_b":"Fuck them, go back to the shit hole you crawled out of.","commenter_a":"If our culture offends u get out!","post_message":"First bacon, then bikinis, then beer and now sports fans should watch their ... wardrobe selection so not to offend The Religion Of Peace? @webpagelink"},{"comment_id":"485707381619842","commenter_b":"Shariah Law is \"TORTURE OF WOMEN\". It demands that women be covered from the top of their heads to their toes. HOW STUPID is that. But this is just a small portion of the TORTURE. We are America. We will NOT HAVE SHARIAH LAW. BB","commenter_a":"No sharia !!!!!!!!!!","post_message":"Enough is enough. It's time we as Americans stand up and say 'NO' to Shariah Law. Spread the word and SHARE, we need people aware of radicals in this country. Do you agree Shariah Law should be banned from America?"},{"comment_id":"564505557070656","commenter_b":"😩😩😩","commenter_a":"@username 😩😂😂😂😂","post_message":""},{"comment_id":"10154449321726729","commenter_b":"Fuck u bitch.. I'm an Obama supporter and wouldn't say no shit.like.that.. FUCK U!","commenter_a":"You know what's amazing about Trump's supporters? They are so cult-like that if Donald Trump raped a little girl, his supporters would insist that's okay. They would say that she was probably asking for it. No true conservative supports Trump.","post_message":"BREAKING: The decision desk has now called the winner of Kansas..."},{"comment_id":"1754483651501060","commenter_b":"When they take our gun rights away, what are we to protect ourselves with when evil terrorist get guns off the black market? And don't people see that more people are killed by drugs and drunk driving in America than by people shooting others? They just want to take our rights away!!!","commenter_a":"Barbaric!!","post_message":"Watch Rep. Louie Gohmert shout \"radical Islam\" at House Democrats who were staging a sit-in on gun control. @webpagelink"},{"comment_id":"10154103517111178","commenter_b":"Tell the truth its because you give all illegal aliens full medical care.","commenter_a":"They say 17 million people are enrolled so if it cost that much then scrap it","post_message":"Truer words have never been spoken by the president."}]
