[{"comment_id":"10156232321860354","commenter_b":"Go make us a sandwich bitch!","commenter_a":"Ah shit","post_message":"Get ready. Here it comes..."},{"comment_id":"10154840389483256","commenter_b":"Mine Fuhror has a real hard on for the $500BILLION dollar oil deal with the Russians.","commenter_a":"Trump keeps finding the billionaires who will so care about the United States and her citizens, I am sure. Are the pigs flying yet?","post_message":"President-elect Donald Trump is expected to select Exxon Mobil chief executive Rex Tillerson as secretary of state, elevating a dark-horse prospect who seems to have surged past seasoned political actors like Mitt Romney and Sen. Bob Corker, R-Tenn., in the stretch."},{"comment_id":"10154233668643132","commenter_b":"Michelle Lena Butler idiots on both sides.","commenter_a":"Why is a 50 year old and a 47 year old trying to even reproduce? Can their be laws against that please?","post_message":"\"I can't afford Melissa's doctor visits . . . I don't think I can afford the babies, so I just want to abort all three babies.\""},{"comment_id":"10154151138320399","commenter_b":"muhammad ali was a muslim. karreem abdul jabbar is a muslim. the rw always misses that.","commenter_a":"So what's wrong to be a Muslim? Is being a Muslim evil and being an evangelical Christian holy? Republicans are bunch of hypocrites. Very discriminatory and hateful bunch of bigots.","post_message":"He made his name as a Calvin Klein model and actor on \"General Hospital.\""},{"comment_id":"10153118055667623","commenter_b":"She's hot!!","commenter_a":"If you have to fight for him then he wasn't yours in the first place. I hope that you're pleased with yourself in hindsight today.","post_message":"A 26-year-old North Carolina woman allegedly stabbed another woman Tuesday night during an argument over a man."},{"comment_id":"10154952151491509","commenter_b":"\"Guns don't kill people. People kill people.\" You think Omar would have killed as many people as he did if he only had a kitchen knife or a baseball bat?","commenter_a":"The NRA are the republicans pimp....","post_message":"\"We're talking about terrorism right now. This isn't about guns.\" Congressman Sean Duffy rebuked House Democrats, who are staging a sit-in for stricter gun control measures."},{"comment_id":"10153974541414575","commenter_b":"Poor pup glad he's doing well now just hope he finds a family asap","commenter_a":"How bad is Peyton hurt, I'm looking for a small dog, but low maintenance, I'm disabled my self an single","post_message":"Peyton the dog was found horribly injured along a Kentucky highway after being attacked by a coyote or large dog and hit by a car. Now, thanks to a local rescue group, he's getting much-needed medical care."}]
