[{"comment_id":"10155456952478797","commenter_b":"His mom was white you racist white hater!","commenter_a":"African american? He's interacial! His mother is white, let's not forget her!","post_message":"Honoring Barack Obama, the 44th President of the United States and the first African American to serve as president. bit.ly/2mfD3IE"},{"comment_id":"954338344712964","commenter_b":"Idiot she has no place in the white house","commenter_a":"When her Secret Service Protectors lay down their guns, I will lay down mine.","post_message":"Hillary Clinton made the case for the United States to implement tougher restrictions on gun purchases following the terror attack in Orlando. @webpagelink"},{"comment_id":"10154975862774062","commenter_b":"That woman just wouldn't stop she makes the situation worse and keeps it going she brings it on herself if I were that man I would hit her too","commenter_a":"Men shouldn't punch animals like that. Poor cow..","post_message":"The confrontation quickly turned into a brawl."},{"comment_id":"1058387144217814","commenter_b":"Best part, Karen, they probably don't even make minimum wage, if they're paid at all! Little Hitler Youth!","commenter_a":"Wowzer... I see the RNC interns are working through the weekend, copying and pasting their GOP talking points. Working hard to keep women, minorities, the poor, our LGBT brothers & sisters and immigrants under their jackboots 24/7. Shameful.","post_message":"It’s 2016. The days of dismissing the pay gap as a \"women's issue\" are over."},{"comment_id":"10154634366371729","commenter_b":"so now we support the lazy mongrels","commenter_a":"FLORIDA EVEN BETTER, NO INCOME TAX LOW SALES TAX AND NO COMMUNISTS.","post_message":"Of course they're moving to Texas!"},{"comment_id":"10154816797908812","commenter_b":"There's a pattern here Trump women seem to be dumber than crash dummy's","commenter_a":"She means softer because he hasn't had as many scandals and the extent of those scandals would be scary enough facing the press. I would definitely start coughing if I were in her shoes...she could pretend to faint again just as the van arrives and that way she can be saved from her own embarrassing actions. Being held accountable to the public is not in her best interest.","post_message":"The Trump campaign’s major concern: The candidate’s limited preparation. The Clinton camp’s biggest worry: That Donald J. Trump will be asked softer questions than Hillary Clinton."},{"comment_id":"497560420446120","commenter_b":"By voting for @username, you are wasting your vote. There is no way he can win the presidency. Besides, why would you vote for a person who supports amnesty. Amnesty is bad for America. It is bad for the state of Ohio. It lowers wages. And takes jobs away from Americans.","commenter_a":"We're just 3 days from Ohio. Chip in $10 or more right now to support our TV ad & critical grassroots programs! JohnKasich.com/TV","post_message":"Kasich Works Town Hall live from Heath, Ohio"}]
