[{"comment_id":"10153671476736509","commenter_b":"Online predators? she lied about her age, and deceiving people. wtf is wrong with you. how would that be all those men's fault? she lied dude. i'm glad mom stopped it. we need to do something about females lying about age. why are the men in the wrong hear? but that's the double standard of women though. kids should not be on Facebook period. we need to regulate Facebook and make it for adults only. and use id's to sign in. just like in a bar. i applaud mom, she could of gotten pregnant the works. it would of been her own fault. why? because she lied and said she was a grown up when she clearly was not. mom has every right to give those people a chance to delete her. and i bet you real quick, those people removed her. good job mom. good job. kids don't belong ...","commenter_a":"So people are shitting on her for tough love because she's trying to protect her child from online predators? WTF is wrong with society.","post_message":"Tough love or public humiliation? This Denver mom gave some strong feedback about her daughter's suggestive Facebook postings: @webpagelink"},{"comment_id":"10153572594101051","commenter_b":"Gee, did you even graduate from high school????!!!!! You foul mouthed witch!!!!","commenter_a":"I dont blame them!! It probably sickens them that crazy angry trump uses their music while he talks his trash!!","post_message":"One of the world's most legendary rock bands just told Donald Trump they want nothing to do with him."},{"comment_id":"10153065757271636","commenter_b":"nope, men rape men too.","commenter_a":"Oh I see. Rapists are just misinformed. If only they had read this first, or someone had read it to them at an early age then we wouldn't have this problem that we have today. Women taking sensible precautions has nothing to do with preventing rape. Maybe we should write and share a ten point guide for thieves on why they shouldn't steal. Then we wouldn't have to lock our doors.","post_message":"Worth re-sharing"},{"comment_id":"1457667300971814","commenter_b":"Or fire her!","commenter_a":"I am ashamed of NBC. Rather than addressing the crude and disputable comment by one of your employees, you just champion Chelsea. Do the right thing fire Katie Rich and issue and apology","post_message":"\"Barron Trump deserves the chance every child does - to be a kid.\""},{"comment_id":"1719601761432898","commenter_b":"Similar... squeeze out a parasite living off the host....","commenter_a":"I don't know which news item is more intriguing - this, or Kim Kardashian's wanting a divorce from Kanye West. It's so hard to keep up, with so much happening these days.","post_message":"Oh no. (from Elite Daily)"},{"comment_id":"467133756816336","commenter_b":"That is a disgusting fact. Those people should be ashamed to call themselves 741915279236631s","commenter_a":"That is a shocking testament of liberal standards & ethics!","post_message":"A new poll found 71 percent of Democratic voters believe Hillary Clinton should keep running even if indicted, a view shared by only 30 percent of Republicans. Where do you stand?"},{"comment_id":"818332488251250","commenter_b":"American exceptionalism...we can be batshit crazy and justify it with religious idiocy. We're special :)","commenter_a":"Have we gone completely nuts or completely American/Christian Taliban?","post_message":"Six states currently permit pharmacists to refuse prescribed contraception medication to a woman based on personal and/or religious beliefs."}]
