[{"comment_id":"1179451428768183","commenter_b":"Blacks on a welfare leash! also remember the KKK WAS STARTED BY THE DEMOCRATS. the first RUNAWAY Slave tracked down by a Democrat Government and the first legal slave was owned by another BLACK MAN ,, SO WHO YOU VOTING FOR ??","commenter_a":"Bastard, who opened the vault holding our Social Security.","post_message":"Here's the HARD TRUTH about what the Democrat party has REALLY done to the Black community,."},{"comment_id":"10154570947183822","commenter_b":"his ass should of been hung long ago.....his mother should of been charged as an accomplice too.. she knew damn well those officers would be walking into an ambush.","commenter_a":"Yeah...and I want a million dollars....sorry buddy...you earned it. No remorse ...no care....there are no words...","post_message":"The man convicted of killing three police officers in Stanton Heights appeared in court today. Richard Poplawski wants all charges against him dropped, and declared \"Let's Go Pens\" as he was led into court."},{"comment_id":"1722190664688272","commenter_b":"Go back to your Country!","commenter_a":"Then get the hell out of our country.. go back to your country so you can smell camel s***","post_message":"Muslims Throw Fit Over Odor From Bacon, Then THIS Happened Do you love the smell of bacon? @webpagelink"},{"comment_id":"1561579034151058","commenter_b":"She's wile annoying","commenter_a":"@username .. This is so Gemma Gallanagh","post_message":"\"By the time I put it together there was nothing I could do to stop him.\""},{"comment_id":"10153189366828132","commenter_b":"Yes for real!!! That's hilarious.. but just a secret, I do it to. Except when they stare, I sing to them. And they sometimes laugh or look at me like","commenter_a":"I could so see Mervin doing Danielle!","post_message":"This police officer from Dover, Delaware, has some serious moves!"},{"comment_id":"1083622038339883","commenter_b":"The girl who was supposedly GRABED claims ALL SORTS OF THINGS! I think she wants to live the American dream....SUE SOMEONE AND RETIRE! Little WITCH!","commenter_a":"Another liberal that makes me think in rare cases abortion maybe should have happened !!!!!!!!!!!!!","post_message":"BOOM!!"},{"comment_id":"1033268563393975","commenter_b":"Build the wall already and gas up the coaches to take the illegals home!","commenter_a":"Scumbag democrats and other illegal scumbags.","post_message":"PROTEST TURNS VIOLENT OUTSIDE TRUMP RALLY: \"There won't be no United States without Mexicans.\" [Video]"}]
