[{"comment_id":"555638054626774","commenter_b":"monkey bitch","commenter_a":"Seriously? Get a life! This is none of your concern....","post_message":"After this Obama staffer quit, he leaked something disturbing secret about Michelle. This is a joke. She needs to be kicked out of the White House. Do you agree Michelle Obama is a disgrace?"},{"comment_id":"817253511741162","commenter_b":"@username she isn't running. Stupid! Trump's wife is a ditzy bimbo... Not relevant.","commenter_a":"Hello!!! The Liberals are the ones voting for him. He is a danger to our country. I know many Conservatives who feel the same way about this democrat posing as a republican. Don't be stupid with your vote. The Liberals will still want to leave over Cruz being elected. Why not go that route? Or change your page to the Comical Former Conservative.","post_message":"Rosie and Whoopi too......one can dream..."},{"comment_id":"459815194143521","commenter_b":"I personally just don't give a shit. They can walk around naked as a jay bird for all I care. But I'll bet other women would be the ones that bitch the loudest.","commenter_a":"this means that we can have video games and movies with naked women in them ??","post_message":"Female nipples are causing an internet storm & here's why: #FreeTheNipple"},{"comment_id":"10153244318929726","commenter_b":"Why work when you can live off the taxpayer???","commenter_a":"This is so true in IT.","post_message":"Former IT Manager Exposes Ugly truth on so called \"Shortage\" of American Workers"},{"comment_id":"1118389778239557","commenter_b":"The question is, \"Is there a discernible difference between \"Radical Muslims\", and Muslims?\" When people close their eyes, get on their magic carpets five time a day and pray to Mecca, it is clear that Islam is the most important thing in their existence. Far above Nationalism, for the country they are in. For our own security, we must stop Muslims from entering this country. In addition, existing Muslims here should be asked and paid handsomely to leave. Finally we should ban all business dealings with Muslims and abandon the Middle East.","commenter_a":"Non't kid yourself islam is all radical at the core.","post_message":"This guy is EXACTLY right about radical Islam. Let's share this everywhere, because you know the media never will."},{"comment_id":"933455743437871","commenter_b":"no first do their time in prison then be deported","commenter_a":"They should be put in jail for years and when their old, deport them. That is if they make it in jail at all.","post_message":"ClashDaily.com"},{"comment_id":"10153599468079024","commenter_b":"Obnoxious establishment audience. Am I watching Jerry Springer folks?","commenter_a":"can you have the audience quit with the noise, so we can actually hear the questions being asked? it's rude","post_message":"Republican presidential hopefuls take the stage in South Carolina as CBS hosts the ninth GOP debate tonight. Watch live here: @webpagelink. Read the latest updates on CBS New York: @webpagelink"}]
