[{"comment_id":"1094996023854086","commenter_b":"What an ignorant woman..,","commenter_a":"Beautiful! So glad she will be recognized. This Pope restores a bit of faith in me for the Catholic Church!","post_message":"Mother Teresa of Calcutta, a nun who dedicated her life to helping the poor, will be made a saint of the Roman Catholic Church at a ceremony on Sept. 4, Pope Francis has announced: @webpagelink"},{"comment_id":"10153354132661320","commenter_b":"Religion is fake!","commenter_a":"He's a fraud sorry","post_message":"\"I can dream as long as I want to. I can believe God as long as I want to. If I wanna believe God for a $65 million plane, you cannot stop me.\" Pastor Creflo Dollar is blasting critics who took him to task for wanting a fancy private jet. Read more: @webpagelink"},{"comment_id":"10152661116841491","commenter_b":"Thugs are thugs, white or black. Stop acting like it is a racist term, people. These idiots belong in the exact same grouping as the ones in Ferguson and deserve to be treated the exact same way.","commenter_a":"Omar Shtayyeh","post_message":"Columbus Police Department spokeswoman Denise Alex-Bouzounis said that about 8,000 students forced their way into The Horseshoe stadium and tore down a goal post."},{"comment_id":"666551896811325","commenter_b":"Nah send the atheists and liberals and dems over to beg for coexistence. Please !!!","commenter_a":"I want all liberals to go meet isis and propose there coexist mantra. All of them! Now please!","post_message":"I am begging liberals to understand this!"},{"comment_id":"10153435038829753","commenter_b":"tape her mouth","commenter_a":"KARMA is a BITCH....BITCH....I must say YOU are One SORRY ASS LOW LIFE BITCH .....I CAN'T STAND PEOPLE THAT ARE CRUEL TO ANIMALS.........If YOU are CRUEL to a Dog.. There's no telling what YOU might do to a Person....","post_message":"With over 100-thousand shares as of Saturday morning, Katie Brown, the woman who taped her dog’s mouth shut to stop it from barking, has still not removed the photo she took of her canine-reprimand off of her Facebook page. The photo has reportedly caused a flood of phone calls to the police station in South Daytona, Florida, where the woman’s Facebook account says she is residing. “This is what happens when you dont shut up!!!” That is the caption of the photo post Katie Brown put on her... @webpagelink"},{"comment_id":"369489863429570","commenter_b":"Ship her out ban her from AMERICA","commenter_a":"I agree she should be arrested","post_message":"President Trump says Madonna is 'disgusting' and a 'disgrace' to America because she said she wanted to blow up the White House. Agree or disagree?"},{"comment_id":"10153944005826336","commenter_b":"@username Your cocksucking grandma needs to read the bible!!","commenter_a":"What is this world coming to?!","post_message":"Just a few weeks before Christmas, Labor Commissioner Brad Avakian wiped out the Klein family’s bank accounts – taking nearly $7,000."}]
