[{"comment_id":"1671482303102466","commenter_b":"I bet he dreams about it!","commenter_a":"Trump is a vulgar idiot yet Rubio is a hero? Seriously people, Trump didn't walk out on stage and say hey I got a big package. Rubio has insulted him for a week about this and Trump ended the insults. Rubio is the one that's vulgar and obsessed with Trumps Package.","post_message":"\"Did he just say that?!\""},{"comment_id":"1558275617531277","commenter_b":"NICE PERSON..SHE LIES, ARGUES LIKE HE DOES. INTERUPTS,ALL SHE DOES IS TRASH HILLARY","commenter_a":"She really seemed like a nice person and I am hoping she gets as far way from that idiot as she can. She is way too good for him. She was going down the tubes with him.","post_message":"The wheels are falling off!"},{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?! This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES. They sound so terrified. :("},{"comment_id":"509394902575723","commenter_b":"Women especially can be proud!","commenter_a":"What do y'all think so far?","post_message":"Republican Rep. from Alabama seems surprised that not every single State Department was 100 percent loyal to Secretary Clinton all the time."},{"comment_id":"978190742237455","commenter_b":"Hillary will win in 2016!","commenter_a":"Hillary 2016!","post_message":"“I should have used two accounts—one for personal, one for work related emails. That was a mistake, I’m sorry about that, I take responsibility, and I’m trying to be as transparent as I possibly can.” -Hillary on ABC World News Tonight with David Muir"},{"comment_id":"10153192741541336","commenter_b":"@username you sit there and bad mouth President Reagan about low wages and high debt well buddy you ain't seen nothing yet. obozo is bringing in all the illegals and he is giving all the companies a bonus to hire illegals over American citizens because they will work for lower wages so all wages will be kept low and where do you think obozo is getting all this money that he is passing out? It is not all taxes because if you don't work you don't pay taxes and the illegals don't pay taxes on what they earn. He is adding to the national debt by borrowing more money.","commenter_a":"I am 17 and a college student and this breaks my heart. Do people know what he did for the country? He was not perfect but he made America strong.","post_message":"Can you identify this man?"},{"comment_id":"718386484926627","commenter_b":"But as soon as they hit 18, they're prostitutes? Crazy how one second can change the definition... #ijs","commenter_a":"Please don't call under age girls child prostitutes. They are victims of being sold to sex traffickers, or kidnapped. They are victims, not prostitutes.","post_message":"It wasn't all fun and games on Super Sunday."}]
