[{"comment_id":"636835003152516","commenter_b":"In these cases the police are the terrorists","commenter_a":"Balck white man woman cop civilian.. the real enemy is Terrorism.. and they are using all this crap to keep us from conentrating on them","post_message":"An important conversation for America. President Obama participates in special town hall event on race, justice, and policing. @webpagelink #POTUStownhall"},{"comment_id":"1713716002223281","commenter_b":"@username Bill Clinton is the one that suggested the wall u retard. Plus trump will hold people hiring illegals accountable.","commenter_a":"Yep. Actually, does sound like Trump's current talking points. Someone's a hypocrite. And it's not Trump. #Trump2016!","post_message":"Do you think this sounds a lot like Donald J. Trump? MORE: @webpagelink"},{"comment_id":"10152991512942377","commenter_b":"She broke the law just by living too long","commenter_a":"Do not pass go, do not collect $200M","post_message":"Hillary says she never received classified emails on her personal server. Do you believe her?"},{"comment_id":"628439843967466","commenter_b":"Yep criminals think like that That is why she pointed a gun at the polw. @webpagelink","commenter_a":"Because they don't have anyone to be accountable to!!!","post_message":"This is for all of the victims of #PoliceMurder and #PoliceBrutality who never make national headlines in the mainstream media! @webpagelink"},{"comment_id":"10152562554341636","commenter_b":"Time to persecute muslims everywhere.","commenter_a":"I will never support terrorism but I also think we have to respect other people's religions...","post_message":"Ahmed Merabet had raised his hands up in surrender before being shot dead..."},{"comment_id":"10153356970249087","commenter_b":"#EndOurFreedom #KeepUsSafe","commenter_a":"There is no way to defend against terrorist attacks in a free society and have any freedoms left. Even a cop on every corner checking ID's and frisking people won't stop them.","post_message":"Former police commissioner Howard Safir said the terrorists in Paris changed the dynamic when they \"picked a local restaurant, they picked a theater\" instead of heading for iconic targets like the Eiffel Tower or the Louvre."},{"comment_id":"10152927219763721","commenter_b":"Jason Milosh","commenter_a":"Fiona Yeamans Mia might like some of these creatures 😄","post_message":"Scientists just captured stunning images of deep sea creatures off the coast of Puerto Ricosome are so new to us, they don even have names. (via Quartz)"}]
