[{"comment_id":"1647007322270889","commenter_b":"@username great values you're teaching your kid. Enjoy karma","commenter_a":"Yeah well cyclists need to be safer, in Utah they over take actual roads holding up traffic passing people off.","post_message":"Biking in America is way too dangerous. (Video: ATTN:)"},{"comment_id":"10153374338805329","commenter_b":"Lock her up and Throw away the key.","commenter_a":"Haha hopefully everyone enjoys there burgers and burritos today Cats ruin the forests when left to roam free They kill anything that's small And they over breed more than people on welfare Get over yourself You would ruin her life forever just because she took out a feral cat? Murderers even get off Scott free and live in society but this girl who by the way isn't hunting giraffes and rhinos (which is an actual job in some places) is condemned to a life of hatred by all you animal eating Internet trolls I curse everyone here with the fact that you will accidently run over an animal in your life Know that you were just a photo away from getting your whole life ruined","post_message":"A photo of the veterinarian with the dead cat have gone viral and sparked outrage."},{"comment_id":"1420761931270891","commenter_b":"I'm just annoyed that girl had to post it. The minute she posed with it and posted it made it a trophy kill. She didn't pay all that money to go to Africa to feed the orphans, cause if that was the case, she would have gone about it a different way. Don't get me wrong, I think it's great that a lot of people got fed, but in her mind this was all about the trophy.","commenter_a":"@username, @username, did you see This? Hopefully there isn't protesting in CV","post_message":"12-year-old hunter speaks out after facing backlash online for posting photos with big game. \"I'm never gonna stop.\" @webpagelink"},{"comment_id":"10153469428757144","commenter_b":"Those beautiful little WHITE girls are gonna be so bummed out when they come to understand that THEY are the minority. All that was missing in their routine was the Zeig Heil!","commenter_a":"\"Tomorrow Belongs to Me\"","post_message":"The internet is freaking out about this video. Watch it and you'll understand why."},{"comment_id":"10153810212319087","commenter_b":"stupid picture talking bitch. @webpagelink","commenter_a":"this is good. \"Rarely does a presidential election hit the unthinkable issues that can completely divide a nation and endanger the peace and security of that nation. It seems Donald Trump is poised to kick down doors concealing issues that mainstream media and mainstream candidates fear to even discuss. The competence level of our leaders in government and their weak attempt to compete in world markets is one of this countries forbidden issues. The other forbidden issue is the democratic party position that Islam has nothing to do with violence, as opposed to Donald Trump explosive position that hates us. It a good bet that America is about to get an education in what Islam represents and what its intentions are, as perceived by Donald Trump. I believe the two afore stated issues will sharply divide the American electorate and could possibly threaten the peace in some instances. Donald Trump ...","post_message":"Here are five of the most important primary fights to watch this month that could determine who will win this fall's battle for control of Congress."},{"comment_id":"10154517046780329","commenter_b":"Not bad, but these sudden death quizzes are pretty f***ing unpopular. I would have hoped y'all would have gotten the point.","commenter_a":"Mike Snee","post_message":"There are 20 questions, but as soon as you get one wrong, you LOSE. (via BuzzFeed Quiz)"},{"comment_id":"10154247175501680","commenter_b":"I've seen you post this exact thing, verbatim, on another posting. Are you just copy/pasting on all the posts? If so, I would spend some time on grammar and punctuation because this is completely incoherent. I've tried 2xs to understand what you are saying but i give up by the second run on sentence...","commenter_a":"Trump return dodd-frank law to gang of bail out banks to reduce their power and to transfer it to the people of usa and to stop fraud in the stock market stealing from workers ,middle class investors and retirement funds and reduce USA world's record inequality ,legacy of lawless obama.They will have to pay you your part anyway because if not you send them to jail for using privileged info all together for stock trading,take gang of bail out banks the license to steal with stock market and reduce their money to pay for protests ,lies, to bribe GOP politicians and to own Democrat party.take the financial resources from the establishment.FREE USA.return power to USA people.Make america great again.,there is more freedom in china than usa ,with gang of bail out banks holding power here since they brought obama to powerThere was another fair solution for banks ,was to bring ...","post_message":"The best guide to what Donald J. Trump would do as president appears to be what he said he would do as president."}]
