[{"comment_id":"10153292399553984","commenter_b":"He has it coming to him.","commenter_a":"yes I do","post_message":"Obama's big plans have blown up in his face! That's got to hurt... Do you hope Obama finally gets the message?"},{"comment_id":"997010993718412","commenter_b":"Islamic Terrorist, go home, stop trying to change the U.S.A.","commenter_a":"No true American is safe as long as Islam is allowed to exist in our nation! We true Americans must unite against this plague and the liberals who allow them to destroy our lives and wipe them from our nation so we can ensure the safety and security of our nation and the American people!","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack. He is a hero, and will always be remembered as so. Can we get 150,000 'LIKES' for this brave boy?"},{"comment_id":"10153008307071130","commenter_b":"Justifying double standards while still playing the perpetual victim. Yay modern feminism.","commenter_a":"Are we not gonna talk about how a 50+ year old lady forced herself on a 20 something guy? Because if it was the other way around, I'm sure you'd have milked it every possible way.","post_message":"In the ongoing saga of things brands should never tweet..."},{"comment_id":"10153368981378812","commenter_b":"As past wars have told us, you can ONLY stop violence with violence, these people need to be shot down","commenter_a":"You can't stop violence with violence.","post_message":"BREAKING UPDATE: Baltimore Police: At least 7 officers injured in clashes -- 1 is \"unresponsive,\" some have broken bones; mob has surrounded and destroyed a police cruiser -- LATEST: @webpagelink LIVE: @webpagelink"},{"comment_id":"703522563139507","commenter_b":"She's just jealous ,because she has NEVER looked this good in her whole life ,just saying !!!","commenter_a":"What country did rosie post that from...I bet she stares at that pic. all night...","post_message":"OUTRAGE...! Rosie posts naked photo of Melania when comparing her to other First Ladies. WARNING: Nudity"},{"comment_id":"10154056074359749","commenter_b":"Your a hoe lets be honest","commenter_a":"Hope u keep some pics for your kids to see when they grow","post_message":"\"I am a mother. I am a wife, a sister, a daughter, an entrepreneur and I am allowed to be sexy.\""},{"comment_id":"10155143556313701","commenter_b":"Watch and you might learn something. @webpagelink","commenter_a":"The woman left behind her child in a hostile environment so she could save her own skin just to turn around and blame Trump's temporary travel ban as why her reunion with her child got delayed. Talk about one selfish mother.","post_message":"While in the vetting process a Somali refugee, named Sahara, gave birth to her son. Children are not automatically approved to travel, though, so she left her son with her mother in Uganda to speed up the process."}]
