[{"comment_id":"10153581516273984","commenter_b":"The feds will just print more money huh. That's what's wrong with America is people like you don't know how things operate. The only money that gets printed is money that gets destroyed that banks send back. We are not in debt because we keep printing our own money. We can only print as much money as we have in our gold reserves. The reason we are in debt is because we keep borrowing money from places like China. But see that's the problem with the people in this country, they run to the polls to vote but have no clue how anything even operates","commenter_a":"Trump won't be any better. We will have more wars and more debt. Your pensions and other government ensured money will be gambled away again. The dollar will continue to devalue as the Fed prints money debt money. More American jobs will go overseas to China and Mexico. The middle class will slowly but surely wither away while people wonder what happened AGAIN and do absolutely nothing but complain on the couch or internet. The list goes on and on and on but you reap what you sew I guess. It is always the younger generation who has to clean up the mess of the old as always.","post_message":"Donald J. Trump just ripped apart Obama's Iran deal with 6 blunt words that hit home to millions of Americans. You know Obama hated hearing him say this, because Obama knows it's the truth."},{"comment_id":"10153523680568606","commenter_b":"God Bless ♡ Hearts broken♡","commenter_a":"It time to vote trump","post_message":"The remains of the four Marines gunned down in the Chattanooga attack were transported through Northern Virginia. @webpagelink"},{"comment_id":"10153547473805950","commenter_b":"I meant she's about the most ignorant narcissistic female I've ever seen.","commenter_a":"She's about the most ignorant narcsisci femaale","post_message":"He's \"as much a scientist as I am.\""},{"comment_id":"10153674546377293","commenter_b":"Belief structure is the exact same thing. Splitting hairs to rationalize your views.","commenter_a":"They got a point. It's not a religion by definition, but it's a belief system. Praying affects the individual doing it; only those offended are the people that can't stand the sight of it. They hate, if you will. Equality means just that, though. Can't restrict one group only.","post_message":"“This is very scary,\" a parent wrote."},{"comment_id":"10154312293629330","commenter_b":"She's a lying murderer","commenter_a":"God help us if he wins!","post_message":"Donald Trump has been officially nominated as the Republican candidate for president at the GOP convention in Cleveland ---> @webpagelink"},{"comment_id":"10152522515306717","commenter_b":"Trust bitch, more Gays will flock to Nikon, you're obviously a total moron","commenter_a":"Won't be buying anything from that company or my family or friends Adam and eve people not Adam and steve","post_message":"Click here to follow LGBTQ Nation on Twitter: lgbtqn.at/tw"},{"comment_id":"595270947330151","commenter_b":"Absolutely the most corrupt female politician! Bad for the US!","commenter_a":"Hillary is a PIG","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down. She is in trouble. Let's show her our support. Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"}]
