[{"comment_id":"1191420990909535","commenter_b":"Really??? I use my pants to hide this dick!!!!","commenter_a":"I'm sorry","post_message":"Military intelligence... isn't. ~Will"},{"comment_id":"861355680627352","commenter_b":"ronan need to go, and joy should replace REV AL at 5pm cst is very very hard to watch his show!!!!!","commenter_a":"did someone from fox come over and take over in charge of show selection as I am with the others why keep Scarborough who belongs over on fox and let these two go....way to lose viewership","post_message":"Ronan Farrow reveals the answer to a big question ... almost."},{"comment_id":"10154220565880575","commenter_b":"This is why immigrants need to be vetted and illegals should be shipped out of USA. TRUMP/PENCE","commenter_a":"Sunshine patriots, you'll do as you're told.","post_message":"Mothers of slain children killed by illegals hold protest in front of Paul Ryan's home."},{"comment_id":"10152976534071955","commenter_b":"Bonehead stole Christmas and gave it to the illegals.","commenter_a":"POS!!!","post_message":"PAYBACK: BOEHNER FOES BOOTED FROM POSTS"},{"comment_id":"10154140637508984","commenter_b":"She's a she bitch..she's sappose to be neutral.","commenter_a":"Megan started this mess! Now the Balls in her Court, she can act like a person doing her job are act like the Establishment with the Mean Spirited Questions. FOX this could be the End for what you call Fair and Balanced. News Max looks pretty good.","post_message":"The long-awaited rematch between Donald Trump and Megyn Kelly will occur at tonight's Fox News debate. Kelly has a plan if Trump starts to attack her, and it's going to surprise you."},{"comment_id":"10153357244917061","commenter_b":"She should be a shame of herself. A doctor, would not want her to treat me.","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"1701604063395144","commenter_b":"Ze pretty ladies","commenter_a":"@username William Joseph.. You boys come get me !","post_message":"So I'm on my way to Germany to get arrested."}]
