[{"comment_id":"554182668075021","commenter_b":"What lower wages, you mean lower taxes. If you don't want to birth a child, just keep those nasty little knees together","commenter_a":"They are poor, jobless and believe the American dream is dead because they are stupid enough to keep being tricked into voting democrat.","post_message":"Last year was the first time that millennials surpassed baby boomers and Gen-Xers to become the largest voting demographic in the US."},{"comment_id":"10153312839004203","commenter_b":"No way she's a stupid bitch","commenter_a":"You'd rather have Rand Paul , Jeb Bush or Ted Effing Cruz? Really? GO HILL!","post_message":"This is it."},{"comment_id":"1775780972691266","commenter_b":"Andrea Lynnette no way in hell.","commenter_a":"To all the people harping about how \"historic\" the DNC nomination is: There is nothing empowering about this, and by saying otherwise, you are setting the next generation of American women up for failure. You're telling them that it's okay to lie, cheat, and steal, so long as it breaks the glass ceiling. You're telling them that it's okay to stand behind an unrepentant philanderer so long as it is politically expeditious. You're telling them that one does not need to take a principled stance on any issue in order to be successful; one only needs to adhere to populist notions. The only way in which last night was historic is in the sense that this marks the first time in American history that a candidate won the nomination under FBI scrutiny. This is also the first time in which an entire political party was caught actively sabotaging a candidate. ...","post_message":"Democratic Party nominates Hillary Clinton. Your reaction?"},{"comment_id":"10153091738774071","commenter_b":"Tesla already solidified its royalty by breaking the consumer report ranking system 😜","commenter_a":"\"While Porsche's Concept Mission E is just a concept now, Porsche said that it aims to begin production in the next five years.\" The cheaper Tesla will be out by then and Tesla Motors will solidify it's spot as the king of e.v's.","post_message":"The future of Porsche? (via Tech Insider)."},{"comment_id":"10153735845537144","commenter_b":"The dog having a home is the goal isn't it? This woman didn't know the dog, she might not have liked it. The dog could have hated her. Yeah, the governor had an advantage and the guy's not my favorite. However, this whiny woman sems too needy and I'm not at all sure I would trust her to care for a pet.","commenter_a":"Another entitled old white guy. God how I despise his ilk.","post_message":"What. The. Hell."},{"comment_id":"613516002130239","commenter_b":"Women wear ties","commenter_a":"Men are expected to wear ties, that's also sexist.","post_message":"Nicola Thorp says she was laughed at for asking if a male colleague was expected to wear heels too. 👠👠"},{"comment_id":"10153037559646051","commenter_b":"Some woman so hard up for a half ass man that they no nothing about and children are getting hurt for there weaknesses","commenter_a":"sadistic POS monster","post_message":"The only thing worse than what this guy did to a 5-year-old is why he did it."}]
