[{"comment_id":"1758718481082543","commenter_b":"Illegal aliens should not be allowed to have drivers licenses. They should not be allowed to vote, should not get Social Security which they did not work for, should not get food stamps, welfare or any other type of financial assistance. If one of us went to their country, would be get financial assistance? No way! So why should they expect it here in the US, when we have seniors, veterans, children, homeless in need!","commenter_a":"More than WRONG !!!!!","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"},{"comment_id":"1199381900178382","commenter_b":"They were not illegals!!","commenter_a":"#WomenAgainstSessions #LGBTQAgainstSessions #MinoritiesAgainstSessions!!!!","post_message":"WATCH: The Senate Judiciary Committee meets to vote on Attorney General nominee Sen. Jeff Sessions, hours after the firing of the acting attorney general. Read more: @webpagelink"},{"comment_id":"935570869827883","commenter_b":"You don't have to apoligize for that bitch","commenter_a":"Don't worry, she is a fringe politician who's party holds only one seat in parliament. She doesn't speak for most Canadians (like me) who abhor Omar Khadr. Our apologies.","post_message":"This video makes me sick. Praising a Taliban war criminal for his \"class\", making light of the death of a U.S. soldier, and having to be dragged off stage all in one speech. I hope her career ends in a fiery explosion ASAP. Here is her Facebook page if you want to share your opinions on her speech > @webpagelink ~Funker"},{"comment_id":"913594125361987","commenter_b":"Go ahead vote for her! Stink up America some more you fools!","commenter_a":"She's right, we can't let a Republican in the White House. Vote Blue and support whichever candidate wins the Democratic nomination. I happen to think Hillary has a better chance of beating any Republican, but Bernie as our president would be awesome too.","post_message":"YES! Whether you're a Bernie or Hillary supporter, there's no denying the debate audience really loved Hillary's closing remarks. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154536510048279","commenter_b":"nonsense. keeping Donald Trump out of the white house is the only thing that matters right now in this historical moment. Now if Jill Stein were Gertrude Stein, I'd vote for her. She'd have a chance. But for now, we should take a clue from no one less than Angela Davis and vote for Hillary. There are a lot of right wing trolls out there disguised as purist lefties. Don't fall for it.","commenter_a":"There really needs to be an eye roll reaction option on ef book","post_message":"A leaked audio recording reveals Hillary Clinton told a group of donors she’s the center-left to center-right alternative to Bernie Sanders and Donald Trump."},{"comment_id":"10153593606745575","commenter_b":"@username That would require the removal of the colored beast as well as the illegals as they are responsible for 49/50 murders in NYC ofr instance. 96% of all crimes in that city and a whopping 98% of all gun assaults. Liberal American preaches these two species are to be housed, fed, clothed, educated and given the best medical treatment in return for their confusion between acting civilized and acting like animals.","commenter_a":"You women need to vote Republican or this will become common.","post_message":""},{"comment_id":"1367609406650925","commenter_b":"Lets stomp out evil everywhere.","commenter_a":"It will be good to have a true American running the government again.","post_message":"This is definitely the most Trump-tastic resolution that Donald J. Trump could have made..."}]
