[{"comment_id":"10153871154220329","commenter_b":"SHE is a WOMAN.","commenter_a":"No man can bear children. She's a woman, fact.","post_message":"\"One came from daddy's tummy and one came from mummy's tummy.\" (via BuzzFeed Trending)"},{"comment_id":"10153921067764203","commenter_b":"@username, But many Women would and I bet You were going to have A lot more Women shooting themselves.","commenter_a":"Yah most women can't find their keys in their purse! As they fumble for the gun, they'll be long gone!","post_message":" new motto may just be you see something, say something. But make sure you packing heat and have good aim."},{"comment_id":"887531464615283","commenter_b":"Sorry Derek grammar police ! What a bitch seriously piss off","commenter_a":"This is why they have gay wrights and the rebel flag in the news to distract u from this been trying to tell u police state !!","post_message":"This story is going viral right now. Read the details of the case and ruling and you'll understand why. @webpagelink From (Y) Counter Current News - MBD"},{"comment_id":"1399324063479459","commenter_b":"Put her away","commenter_a":"Karma!!!","post_message":"She got what was coming to her and then some. Excellent! People who treat cops like dirt should absolutely be called out and held accountable."},{"comment_id":"10153754678291336","commenter_b":"Can't play politics and disarm society if you make the kids safe! Gotta get a few kids killed to advance if you're a communist. The end justifies the means with these Freaks.","commenter_a":"jerry brown is a fool","post_message":"Does this make schools safer?"},{"comment_id":"965394473500060","commenter_b":"That's what happens when unqualified people get put in jobs, for fear of hurting someone's feelings!!!!!","commenter_a":"THIS WAS PLANNED , THIS IS HOW NEGRO'S GET RICH !!! I HAVE SAID THIS MANY TIMES BEFORE !!! DUMMY'S","post_message":"A New York City firefighter who was allowed to graduate from the New York City Fire Department (FDNY) training academy despite failing physical fitness tests is now on medical leave after less than two weeks on the job."},{"comment_id":"10154436464143931","commenter_b":"The wall will stop a lot of illegal aliens because they don't usually go thru tunnels. The tunnels are for drugs. They don't want a lot of people knowing where the tunnels are because if the people get caught they will snitch on the tunnels location. That's why they use the tunnels for drugs not people","commenter_a":"The drugs are smuggled thru tunnels underground.","post_message":"A wall would do little, if anything, to stop the flow of illegal drugs - the majority of which are actually smuggled though checkpoints."}]
