[{"comment_id":"10152764281491680","commenter_b":"Reminds me of Nancy Reagan. Stepford wives, both of them.","commenter_a":"Not surprised that a cheater would support a fellow cheater. Also...why does his wife always looked demonically smiley at literally everything he says. She creeps me out.","post_message":"Chris Christie addresses the controversy surrounding Tom Brady, the New England Patriots and Deflategate."},{"comment_id":"1161479583891497","commenter_b":"BUILD THAT WALL! BUILD THAT WALL! BUILD THAT WALL! #MexicoWillPayOneWayOrTheOther #Trump2016","commenter_a":"Time to just hand out some good old justice and let them be found in a roadside ditch back across the border","post_message":"GROUP OF ILLEGALS GANG RAPE 13-YEAR OLD GIRLS. sickening details: @webpagelink"},{"comment_id":"10153370823461336","commenter_b":"Well Ryan it is better than putting Jenner on the bill","commenter_a":"Megyn Kelly","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"10154945952871037","commenter_b":"Wow, I honestly thought I was the only one.😢","commenter_a":"I was diagnosed with PTSD after being sexually assaulted as well. It disgusts me that so many people dismiss it as someone playing the victim card or seeking attention. Believe me, no one wants PTSD or to be sexually assaulted.","post_message":""},{"comment_id":"10153788091955950","commenter_b":"Jay the only way Hillary will win is if she lies cheats an steels the votes. Oh wait that's what she does for a living !!!","commenter_a":"This is nonsince TRUMP is not a quiter. He's in it to win it. An he WILL !!! TRUMP FOR PRESIDENT !!!!!!","post_message":"A Clinton plant? A Russian agent? Here's everything you need to know about all the far-fetched explanations of Trump's behavior."},{"comment_id":"1099878783413317","commenter_b":"Thank-YOU!!!!!","commenter_a":"Damn good question! Ask obama!!","post_message":"America's Freedom Fighters"},{"comment_id":"10154090805807869","commenter_b":"She deserves nothing!","commenter_a":"My friend said Hillary has worked her entire life to be president, so she deserves it. Working to further ones career whilst providing no service, accomplishing nothing, and harming others is exactly who I don't want.","post_message":""}]
