[{"comment_id":"10153833805055329","commenter_b":"@username Jordani SIM!!!","commenter_a":":') @username @username Sam Powers","post_message":"Right in the feels. Hayao Miyazaki"},{"comment_id":"10152708692641051","commenter_b":"Dumb girls, they were warned and went anyway.","commenter_a":"Earlier articles said they ran away to join ISIS's cause, they went , now they have to deal with their decision. Sorry, I have very little empathy for them. They basically told their parents, their government and God to go ___ themselves.","post_message":"These parents begged their daughters not to go. They went anyway."},{"comment_id":"10155757237589062","commenter_b":"I guess your mother didn't raise you right then. I bet she's proud of the rude, ignorant, pathetic little girl you are.","commenter_a":"Congratulations PRESIDENT TRUMP! Glad our electors upheld THE VOICE OF THE PEOPLE.","post_message":"BREAKING: Donald Trump surpasses 270 votes in Electoral College to formally win presidency. @webpagelink"},{"comment_id":"10153473976261438","commenter_b":"Shut the fuck up attention whore","commenter_a":"Trump for president. Enough is enough, its time to get tough. Make America great again.","post_message":"What if Trump's polling ceiling is much higher than we thought?"},{"comment_id":"10153507200311336","commenter_b":"Cool end abortion I'll send all the mothers that can't afford to take care of their kids to you.","commenter_a":"Amen! I can't believe people are so desensitized to what is happening all around us. It is our duty as human beings to stand against this, which is actual murder. Abortion is wrong at any point and specifically aborting a baby at 24 weeks, the same time they can live out of the womb is just completely inhumane and murderous.","post_message":"ICYMI: \"Destroying innocent life and harvesting human organs is beyond barbaric -- it is unimaginably immoral, grotesque, and evil,\" writes 2016 presidential contender Gov. Mike Huckabee."},{"comment_id":"1617460714934208","commenter_b":"Hopefully she'll waste away and go away","commenter_a":"Apparently not","post_message":"Since she's not moving to Canada, Dunham could always try eating all that crow."},{"comment_id":"1181554231878327","commenter_b":"The Federal government now going to decide about bathroom attendance? Gimme a break and Kill some ISIS and seal the dam borders! North Carolina laws are for North Carolinians! Don't like it than stay out!","commenter_a":"The most ridiculous law ever! Where the F_ _ K to you folks think these HUMAN BEINGS were going to the bathroom before?? Surprise....right next to you and you never knew it! Poor NC....losing all that money and those jobs because of an arrogant Governor who is hardly worth the job that the PEOPLE voted him into!! #LOVEALWAYSWINS","post_message":"It's the federal government being a bully. This unrealistic deadline by the federal government to the ninth largest state is quite amazing.\""}]
