[{"comment_id":"10153756605707293","commenter_b":"They under no obligation to equally satirize. None at all.","commenter_a":"When you do one on Cruz's squished nose, Hillary's liar farm, Bernie's insane core math, then I'll listen.","post_message":"Wait, what?"},{"comment_id":"10154622434238433","commenter_b":"He's probably counting retirees. Of course, when the fascists STEAL our Social Security all those retirees will be forced back into the workforce.","commenter_a":"When Pence and other GOPers rattle off this crap -- it's aim is to cause anxiety and to inflate anger at such inequities - THUS, it is a100% LIETZOW, as it's meant to deceive!!!","post_message":"NEW: Is Mike Pence right that 1 in 5 U.S. households don't have anyone working? Well, sort of. Half True."},{"comment_id":"10153733743438606","commenter_b":"Human nature wants us to create Heaven on Earth where everything is perfect and explained (No disasters, illnesses, wars, and sadness). That's exactly WHY people are sad and sick and at war. They can't reconcile it. I have no clue why bad things happen. But I do have my faith in God. I wouldn't dismiss for a moment why you feel your way. I hope you won't dismiss mine. I just can't see Bill Nye explaining this to me? I sincerely hope you have a great day 🌺","commenter_a":"You figure he wouldn't have orphaned and separated them years ago in the first place then.","post_message":"INCREDIBLE STORY! Two orphaned sisters separated decades ago in Korea have been reunited after miraculously getting hired on the same floor of a Florida hospital ----> @webpagelink"},{"comment_id":"544768002395182","commenter_b":"No election has ever seen such sore losers! And they were accusing Trump of this type of behavior if he lost.","commenter_a":"what a jerk and pathetic American---","post_message":"He's crossed a line."},{"comment_id":"1785965414966824","commenter_b":"Ancient celts had hair like dreads as well. This is her putting a modern spin as an absolute.","commenter_a":"My life my world my rules. You dont tell me what to do","post_message":"It's everyone else's fault!"},{"comment_id":"367420056779622","commenter_b":"she should be in jail","commenter_a":"This is not right","post_message":"THIS is where tax money go..."},{"comment_id":"999816333406704","commenter_b":"It's rough being a single parent. But \"usually \"women have less resources to work with.","commenter_a":"We single fathers do just as much.","post_message":"When you talk about heroes and heroines, at the top of that list is the single moms of America."}]
