[{"comment_id":"10152725766556636","commenter_b":"I know of at least one Christian religion that forbids voting. There's only a big deal being made about it because it's Islam. Having said that, I don't know what else this preacher has said.","commenter_a":"So voting is something that happend 1400 yrs ago.","post_message":"Apparently it's a 'sin'..."},{"comment_id":"10153373990610329","commenter_b":"So NO harm ?!? Dude how did this dumb bitch make it through medical school... 😂😂","commenter_a":"I know what I'd do!! Shotgun job!","post_message":"A photo of the veterinarian with the dead cat have gone viral and sparked outrage."},{"comment_id":"1454919074525438","commenter_b":"That horrid bitch belongs in prison period.","commenter_a":"Harold Alan,you hit that one right on the nail. Hitler and Mussolini that's the way he want to to Govern the United States Of America if elected.","post_message":""},{"comment_id":"10153085748364312","commenter_b":"So it's appropriate for the race card to be thrown here?? Wow","commenter_a":"I bet they don't get gunned down! BC \"white lives matter\"","post_message":"Two teenagers from Kentucky who vanished nearly two weeks ago are suspected in a multi-state crime spree."},{"comment_id":"1337467809657543","commenter_b":"Actually...now.women will do time for....oh what's that word.... MURDER! Hahahahhahahaha","commenter_a":"Abortion happens. Now if it happens in a sterile clinic with a doctor or in a back alley with a coat hanger, it's still going to happen.","post_message":"The so-called \"heartbeat bill\" approved Tuesday would result in what would be one of the most stringent abortion restrictions in America."},{"comment_id":"10153382960318717","commenter_b":"I used to not like Mr. Trump. Then started to like him...sort of. Now I dislike him again.","commenter_a":"He's a prick","post_message":"The New York Times is angry that Donald J. Trump mocked one of its reporters who has a physical disability: @webpagelink"},{"comment_id":"905767619489994","commenter_b":"Yeah...I gotta BITCH with a BITCH that like BITCHES!!! LMAO 😂 😂 😂","commenter_a":"@username @username lmao I'm dead 😂😂💀 the comments","post_message":"When your ex asks about getting back together"}]
