[{"comment_id":"10154258956738352","commenter_b":"Congratulations. Amazing lady.","commenter_a":"Twins!","post_message":""},{"comment_id":"1624321510961305","commenter_b":"She's a P I G!","commenter_a":"She has a lot of gall, wearing a crusifix on that neck........","post_message":""},{"comment_id":"958476177526574","commenter_b":"Good, I'm glad you agree I keep your inconsiderate ass home so that nobody has to see your nasty ass milk sacs. lol It's a shame people can be so in inside rate of others. Nobody asked you to have a child let alone breast feed let on too of that in PUBLIC! that's not cool. I just think others should be respectful of those around them instead just thinking about themselves which is what public breast feeders do...selfishly think about themselves and not the fact that they are disturbing everyone else. I do not want to be sitting somewhere and have someone's nasty ass breast out feeding a child nobody asked them to have. SORRY!","commenter_a":"I love Victoria's Secret and their model are gorgeous. All I will say is this: be considerate of others. Nobody wants to see someone's breasts all out...breast feeding or not. Idgaf what ones reasons for their breasts being exposed is, BE CONSIDERATE. You can pre pump your fucking milk. If that's the case than people should be able to walk around naked because it makes them comfortable and they mean no harm right?? lol oh...I thought so.","post_message":"With Saturday Night Live's 40th anniversary show starting soon, we thought it would be fitting to share one of our favorite moments from this show's important history. Check it out: #SNL40"},{"comment_id":"950959664958199","commenter_b":"She's a skunk","commenter_a":"Jackie Kennedy is turning in her grave.","post_message":"Michelle Obama Makes Rap Video: YoYo! Only Way To Succeed Is To \"Go to college!\""},{"comment_id":"470890583106641","commenter_b":"@username YOU'RE the looser ! And that's why you'll loose in November also !","commenter_a":"Hillary Clinton all the way to the White House !!!!","post_message":"WATCH LIVE: Hillary Clinton answers question LIVE in commercial break!"},{"comment_id":"10153342655734411","commenter_b":"What is the difference between greeks and prostitutes? Prostitutes earn their money through an honest living","commenter_a":"Let's just carpet bomb western makedonia all the way to Tirana and rid the world of this problem.","post_message":"UPDATE: 8 police officers, 14 killed in Macedonia stand-off - authorities"},{"comment_id":"1875497529335937","commenter_b":"Ann Coulter is a very dumb idiot. I wish she would disappear","commenter_a":"That would keep many of his own people from voting.","post_message":"Fact check! Image by Occupy Democrats, LIKE our page for more!"}]
