[{"comment_id":"1172261136143561","commenter_b":"iPhone 7 will murder Note 7, with its 720p display and 2000 mAh battery. *Slow claps*","commenter_a":"Verge commenters won't like to admit verge is now defending samsuck. Looks like Samsung paid Verge, the iPhone 7 will murder this on benchmarks AS IT ALWAYS DOES","post_message":"Seriously, everybody chill."},{"comment_id":"10154242157722690","commenter_b":"@username oh yes she is. No way would a women just go Willy Nilly about massive death. We are big on keeping people safe. He twits bc someone put him down. Just think if a country pisses him off.","commenter_a":"We have two people running for office that are both out for themselves. Ones going to court Nov 28th on a fraud case for his fraud school then we have one about email server. I mean come on we don't have a great choice! They both SUCK!","post_message":"FBI to reopen Hillary Clinton email investigation after additional emails were discovered as part of a separate investigation."},{"comment_id":"10153475441185329","commenter_b":"Bologna on stage lights sounds familiar.","commenter_a":"@username, I assume you have already done this many of times.","post_message":"This is how real men grill."},{"comment_id":"10154514079711509","commenter_b":"That is funny","commenter_a":"I hate to say it but Bernie has done much more for equality than Donald trump","post_message":"\"There's nobody that's done so much for equality as I have,\" said Donald J. Trump."},{"comment_id":"10154060235711336","commenter_b":"Refuse to have hearings on any potential candidate until after the election.","commenter_a":"Quit following this piece of trash. Go back to Cuba where you came from.","post_message":"“We risk losing our basic constitutional rights with one more liberal justice on the court.” Sen. Ted Cruz reacted to the passing of Supreme Court Justice Antonin Scalia, saying this loss “underscores the stakes of this election.” Do you agree? @webpagelink"},{"comment_id":"999929080073847","commenter_b":"Lol 1800 slap both of y'all bitches","commenter_a":"@username @username this is whats gonna happen whenever yall talk shi, ima walk my hoes lmao","post_message":"Really Out Here Walking Them On A Leash!"},{"comment_id":"10154624761426336","commenter_b":"What a dumb woman...","commenter_a":"Its her policy that allows these people in our country to kill us.","post_message":"Hillary Clinton addressed the latest bombings in New York City and New Jersey and emphasized that Donald J. Trump's comments are being used to recruit terrorists. @webpagelink"}]
