[{"comment_id":"10157442603035389","commenter_b":"Omg not shoplifting. Oh the outrage. Shut up pussy","commenter_a":"ARE YOU SHOCKED.....this from.a guy who picks katrina (reality TV star who was shop lifting ) as his spokesman and this woman has been caught several times trying to defend and excuse the lies and bogus claims he has made. THIS IS WHAT HE DOES.....THIS IS ALL ONE REALITY T.V. SHOW and you people have so much hatred and stubbornness that you allow this without question. Care for yourself more to question this man. You can hate hilarious clinton all you want, but that doesn't mean drop your guard down on trump. He will destroy the integrity of our country 10 times more. Bring Rand Paul back!","post_message":""},{"comment_id":"10153399368892964","commenter_b":"I'm sorry but I didn't see a post about the TPA for the last vote or this one coming up probably this next week to put it in...do you think there is a reason for that? Something this important? And nowhere else to post so I would guess that means he doesn't want to hear it. But it's his job, so yes he is going to hear about it whether he wants to or not!","commenter_a":"We need to keep OUR laws and get rid of these fake \"free trade\" treaties that make us beholden to an unelected foreign tribunal that frowns on anything that allows us to favor buying American, calls it unfair and forces us to change our laws or pay through the nose for the privilege of keeping them. You need to STOP this subversive attempt to undermine our Constitution NOW and vote NO on the TPA Revote...this does not need to go to an up or down vote! @webpagelink","post_message":"I successfully added a measure protecting jobs at the Lighthouse for the Blind to the National Defense bill."},{"comment_id":"10154018789591491","commenter_b":"@username littel girls like that crap thats why.","commenter_a":"Because boys can grow up to be whatever they want, but girls will grow up to only want to look pretty and wear cute clothes...","post_message":"Amy Schumer and Blake Lively are not happy."},{"comment_id":"1148960128472164","commenter_b":"Beat the whore","commenter_a":"Ok idiot, lets say this girl had no idea he was married and after realizing how dumb you are, he leaves you bcz he knows deep down that he is to blame not the girl....","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."},{"comment_id":"1163296670367051","commenter_b":"Oooooo","commenter_a":"@username @username ummm they airways served alcohol. Unless they are talking about Webster","post_message":"Chuck E. Cheese's: Where a mom can be a mom! The family-friendly chain is hoping to lure in millennial parents by adding beer and wine to the menu."},{"comment_id":"10152579324632093","commenter_b":"especially coming from a girl who's spent plenty of time barefoot in the kitchen pregnant...","commenter_a":"That's what makes Texas so awesome.... everyone here knows their place..","post_message":"Same topic... different take. A man claims a bakery discriminated against his religious beliefs by refusing to make an anti-gay cake. @webpagelink"},{"comment_id":"985183654870370","commenter_b":"She's tripping.......","commenter_a":"She got a low i.q. and a low self esteem. Your kids should come before any man. They always say a fool and their money will soon part. And soon, it will all be gone and so will he.","post_message":"The N.C. woman who won a $188 million Powerball last February is facing an onslaught of criticism after she posted a $12 million bond for her boyfriend…for the fourth time. Lamarr (Hot Sauce) McDow was arrested Tuesday for violating the terms of his pre-trial release. As NewsOne reported last year, Marie Holmes, 26, posted bond for McDow three times — once just weeks after she collected her winnings ($3 million), once in August ($6 million) and again in October after he was arrested for possession of a firearm by a felon. Is the public being too hard on Holmes? Is it any of our business what she does with her money? Let us know ----> @webpagelink"}]
