[{"comment_id":"857720034363387","commenter_b":"This crap has to stop!!!!We do NOT need hillary and another 4 years of obozo and their evil ways-they have destroyed this country--we can not afford all these immigrants---we have to take care of our own first!!!!!","commenter_a":"They'll vote for Gary before Hillary.","post_message":"Exclusive: Federal immigration officials may be working overtime to swear in as many new \"citizen voters\" as possible before the presidential election, according to an internal Obama administration email disclosed to FoxNews.com by Republican Sen. Ron Johnson of Wisconsin."},{"comment_id":"951619314934321","commenter_b":"She is a moron.","commenter_a":"Fox news, God love em, is like all old line Republicans, afraid of the truth that Palin tells. Sarah may never be president, but she sure should be. She represents working Americans better than any other.","post_message":"Don't worry, Palin fans. You'll still be able to see “the First Lady of the Outdoors” on the Sportsman Channel."},{"comment_id":"1038174059551348","commenter_b":"@username you are an Idiot and will never Learn !!","commenter_a":"Absolutely! Why don't you just fly away to that new mansion in Dubai, never to be heard from again.","post_message":"Yes, and you should be ARRESTED!"},{"comment_id":"10154362784109062","commenter_b":"❤️","commenter_a":"Praying for the family...","post_message":"A heartbreaking loss for a family after a 14-year-old boy collapsed and died after school in Cleveland, Texas. Hear from the mother about how the teen is being remembered on KHOU 11 News at 6."},{"comment_id":"439208642934096","commenter_b":"She should be fired !!!!!!!!!!!!!!!!!!!","commenter_a":"The teacher should be fired and possibly sent to Afghanistan!","post_message":"An Illinois teacher was placed on leave after stomping on the American flag in front of students. That teacher should be ashamed; the American flag deserves to be flown everywhere with respect and honor! ForAmerica"},{"comment_id":"542298055958487","commenter_b":"That shouldn't come as a suprise.There is alot more where that came from. JAIL HILLARY 2016","commenter_a":"If this was only true. If she is arrested she should be put it with all the other criminals and NO special treatment","post_message":"She looks good in orange..."},{"comment_id":"1118006468215013","commenter_b":"and illegals.","commenter_a":"Lol same old democrap bs. Yes the GOP is trying to keep Millon's from voting. Millions of dead people.","post_message":"Mrs. Clinton is out accusing the Republicans once again of plotting voter fraud, and she is making this allegation in front of African-American audiences."}]
