[{"comment_id":"10152523937956135","commenter_b":"Only issue is the sand doesn't wash down the drain as easily as salt when winter is over","commenter_a":"Sand is better. We use a salt and sand combo (more sand than salt) in the UP.","post_message":"Ever slide through a cold Interstate at night and wonder how exactly is salt supposed to melt ice?"},{"comment_id":"10155048968076037","commenter_b":"I would be behind him Mr. Knowing it all","commenter_a":"Wikileaks said the emails were a \"leak,\" not a hack. i would like to see some evidence of wrongdoing, before Obama starts WWIII on his way out the door. Why is he effecting ANY major policy changes so close to being out?!?","post_message":"The US will kick out 35 Russian intelligence operatives & shutter 2 Russian compounds."},{"comment_id":"1007444045971350","commenter_b":"don't change anything","commenter_a":"STOP","post_message":"First The 20, Now The $5 Bill - Obama Announces More 'Diverse' Face For The Bill Stop it. Leave our money alone. Do you think they should keep honest Abe on the 5$ bill?"},{"comment_id":"978476018838818","commenter_b":"How can a woman like this evil face.","commenter_a":"Oh for God's sake.","post_message":"PLEASE SHARE: Seattle police have released a photo and have identified the man suspected of setting his girlfriend on fire in South Seattle last night. Police are looking for 62-year-old John Turner >> @webpagelink"},{"comment_id":"10154241642885579","commenter_b":"@username And lucky for you Canadians, you have Justin Trudeau and Chrystia Freeland. They are both young, sensible and bright.","commenter_a":"I'm 73 years old and this is the strangest election I've ever seen in my life. It's scary as hell and I want to move , but nowhere to go. This is the demise of the country that has been predicted for decades. Going under , folks. It's been fun while it lasted.","post_message":"Marco Rubio: \"And so, while it is not God's plan that I be president in 2016 or maybe ever, and while today my campaign is suspended, the fact that I've even come this far is evidence of how special America truly is.\" Watch full speech here: @webpagelink"},{"comment_id":"513245792199334","commenter_b":"ALL MUSLIM PIGS Get the HELL outa MY country!!!!!!","commenter_a":"Screw you, give her her job back, this is a disgrace to the AMERICAN people! Anyone can make a mistake!","post_message":"A lunch lady was fired for serving pork to a Muslim student. We are in America, give that poor lady her job back. Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"10158323534995594","commenter_b":"Stupid idiot. He is not sending out legal immigrants.","commenter_a":"Closing stores and businesses won't make America Great Again","post_message":"“I feel like I want to put the message out that I am ashamed that I gave him my vote, and I wish I could repeal and replace my vote for him.”"}]
