[{"comment_id":"10153505844154714","commenter_b":"But THEY can't have their own..male with male doesn't make babies","commenter_a":"You made a typo. You said \"her family\". You mean Bruce spent the day with his family.","post_message":"It was Caitlyn Jenner's first Father's Day as an out trans woman."},{"comment_id":"10154846980595575","commenter_b":"Only thing to say is, the political don't really give a rats as about our country or its people unless the are profiting from it.only Americans that care will change this type of bulls hit .America infrastructure is need of desired repairs. Let's take care of America before refugees","commenter_a":"There should be no money sent to this governor who chose to use the money for criminal reasons. You just can't do that!","post_message":"Instead of fixing the dam, Gov. Brown spent $25 billion per year on illegals!"},{"comment_id":"10153641029539205","commenter_b":"the hell?","commenter_a":"Wow","post_message":"George Zimmerman Goes After Trayvon's Family"},{"comment_id":"985606431474778","commenter_b":"@username, I understand what you're saying. I'm supporting Ben Carson for potus. But with all the voter fraud, illegals voting Hillary will be president. That scares the crap out of me.","commenter_a":"Sadly, I fear she will be our next POTUS. It's a bad, bad time in America.","post_message":"This is so sad."},{"comment_id":"10153668516697235","commenter_b":"She said my country...woman your kind is European.","commenter_a":"Have you noticed that that Trump supporters always have that crazed. I just crapped myself look in their eyes.","post_message":"This is NUTS!"},{"comment_id":"10154153182021519","commenter_b":"The joke is going to be on the fools who think Trump is bringing their jobs back.","commenter_a":"... . : get uses to it, the next four years is going to be the Donald Trump Aion of the dead-letter-literal-interpretation Christian religious right fundamentalists. The poor rust-belt have-nots put Trump in office because of neoliberalism global economics And the religious right put Trump in the White House , because They want Supreme Court judges to turn back abortion and gay rights etc. . And neoliberal Wall Street buddy's of Trump will get what they want , deregulation for Wall Street and tax cuts. The right wing is in the candy store and everything is free . Like I said; the next political reality show startes after November. ~~~ ~","post_message":"Ted Cruz in the Supreme Court sounds like a nightmare."},{"comment_id":"987364064653456","commenter_b":"What about the case of the stay at home mom, divorces, etc. where does she fall in your explanation Michael?","commenter_a":"Keep it in your pants or out of your pants until AFTER you finish school. I don't have to pay for your daycare.","post_message":"Juggling the demands of an education with parenting is a reality for over 25% of American college students—and it’s time that we create affordable childcare options for those seeking a degree."}]
