[{"comment_id":"875538442502852","commenter_b":"Absolutely, illegal is illegal and alien is alien!!!!!","commenter_a":"There is no reason they can't do that legally","post_message":"Don't you agree this is ridiculous?"},{"comment_id":"10153587807310861","commenter_b":"If she wear a pasta strainer then.i will wear my niqub where only my eyes show.","commenter_a":"Expresses her beliefs....and remains single","post_message":"#LateNightLink Lindsay Miller says wearing the spaghetti strainer allows her to express her beliefs, like other religions are allowed to do."},{"comment_id":"1006897696063097","commenter_b":"Praying for a awesome woman of God and Crouch family.....such seeds she has sown...","commenter_a":"Pamela Houston","post_message":"The TBN family continues to ask for prayers and promises to keep us updated on Jan's condition. #JanCrouch #TBN #stroke"},{"comment_id":"10153531244887377","commenter_b":"If she wanted privacy then don't run hypocrite","commenter_a":"they nef to vote you also a has been","post_message":"Sen. Dianne Feinstein: Criticism against Hillary Clinton is taken out of context and she broke no laws."},{"comment_id":"10153043089801519","commenter_b":"Right? Because...ick.","commenter_a":"#dontbethatguy","post_message":"\"He then sent me five nude photos of him lying in bed, his penis prominently displayed...\""},{"comment_id":"10154479449143271","commenter_b":"Happens to every girl.","commenter_a":"LoL OMG! When I was 14 I lived off of 14th and Pierce by Casa Bonita....and had to catch the bus on Colfax for school. If I would have reported every dude who cat called, they would have needed a daily report for me alone on the news. I'm really not trying to down play the fact that this guy could have been a weirdo but this seems a little extreme.","post_message":"Keep an eye out, Colorado. This man reportedly tried to follow the girls home after they ran away from him."},{"comment_id":"1765463453479427","commenter_b":"Tell that to these women. @webpagelink","commenter_a":"Hey! if their good their good why not if that's what they want to do! and pass all the ground's for being able to handle it!","post_message":""}]
