[{"comment_id":"853027351431360","commenter_b":"Kill all the white people!","commenter_a":"They won't even look at them","post_message":"Boy are these guys gonna be in trouble when the Justice Department gets involved with this, amirite?"},{"comment_id":"817062668431422","commenter_b":"We are to political and afraid to hurt someones feelings to do anything... when Trump ginally takes the seat yall will see some change","commenter_a":"My tears go to all the fatalities. Rest in peace","post_message":"BREAKING NEWS: Berlin terror attack... At least 12 dead as truck ploughs into Christmas market Full story: @webpagelink"},{"comment_id":"10153811229123433","commenter_b":"1. Hardly \"record\" when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is \" record\"?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing \"record\" abortions. @webpagelink"},{"comment_id":"10158409138265725","commenter_b":"Now we know why she's bitter and single","commenter_a":"I can't believe she told that woman that her husband was cheating on her!!!! For her to go home","post_message":"Re-watch the video that started it all: @webpagelink"},{"comment_id":"10152850866306051","commenter_b":"susie you didnt read so shut up u dumb bitch","commenter_a":"What does the kind of dog have anything to do with insurance.","post_message":"When the insurance company found out what sort of dog this woman had, they told her that her claim would be denied."},{"comment_id":"10157563024440206","commenter_b":"Suck my d*ck Un song nia","commenter_a":"@ Mika and @ Alyssa bow wow","post_message":"Lil’ Kim, is that you?"},{"comment_id":"1239053882772316","commenter_b":"@username They are ALL connected. Mcain, Obama, Hellary, Bush. If you think it is the \"other party\" that is bad, then they have been successful at controling your mind. The Dem/Rep thin is a HOAX!! Stop blaming obama. He is terrible, but he is just a puppet! Cut the strings of the puppet masters. vote for the guy they hate! Trump!","commenter_a":"As did the decision to try to overthrow Syria by giving unlimited weapons to \"rebels\" of unknown origin.","post_message":"\"Obama's decision to pull the troops out of Iraq may have helped to create ISIS. As did the decision to disband Saddam's army. As did the decision to invade a country that had nothing to do with 9/11.\" -- Jon Stewart @webpagelink"}]
