[{"comment_id":"933293176705778","commenter_b":"@username have a shitty day bitch","commenter_a":"COPS ARE MURDERERS AND MANIPULATORS","post_message":"It's been called the most gruesome case of police brutality in US history. We will never forget you, Kelly. The civil trial for the cops is about to begin. Latest update here: @webpagelink/ Video by Truth Be Known."},{"comment_id":"10153882831009714","commenter_b":"The same reason why men need viagra...","commenter_a":"No pregnancy is a choice and it doesn't deserve any special treatment. Women have been pregnant for as long as time and they didn't need special parking, so why do they need them now.","post_message":"What do you think?"},{"comment_id":"939262232775539","commenter_b":"Hey pam how about I come over and slam you're stupid ass to the ground and throw you across the room, see how you like being manhandled","commenter_a":"No the policeman was right!! No damn respect for anyone any more, just makes me sick!!!!","post_message":"BREAKING NEWS! The cop ASSAULTED a young girl in her South Carolina high school classroom has JUST been FIRED! Do you agree with this decision by his department? Does it change anything? Let us know and help SPREAD THE WORD about the power of #FilmingThePolice! From (Y) Counter Current News - MBD"},{"comment_id":"10153424220937106","commenter_b":"If it happened in my county, I'd make the complaint myself and have no problem with people putting one in their yards, on their business , our at their church. It just doesn't belong on government property.","commenter_a":"Would be interesting to know if the person who contacted the anti God group has neighbors with these signs in their yard! Can only hope!!","post_message":"It is outrageous that some would aim to divide a community over a banner that has been proudly displayed since Sept. 11, 2001. I commend the Pittsburg community for rejecting this decision and I stand with them. The Constitution guarantees a right to freedom of religion, not freedom from religion. This banner is not only an expression of faith, but of love for country. Expressions of patriotism, faith, and community should be welcome in our society and I have contacted USPS officials to express my concerns about their decision and to request their reconsideration. If the local post office branch is unwilling to display the banner, then I would be proud to hang it at my own office in Pittsburg."},{"comment_id":"527878314072059","commenter_b":"Put her in jail!!!!!!","commenter_a":"To recap: Hillary is \"the devil\" and has \"hatred in her heart\" and Trump is going to appoint a special prosecutor to \"put her in jail.\" This is how a democracy slouches into totalitarianism.","post_message":"Your reaction to the second presidential debate?"},{"comment_id":"10153801376773822","commenter_b":"Sean Hile lol","commenter_a":"Chelsea Nichole","post_message":"Burgers, Wings, and Country music... A taste of Nashville is set to move into #Pittsburgh's North Shore."},{"comment_id":"10154009145851336","commenter_b":"She needs to rot in hell","commenter_a":"Problem is she's been in the public eye for way too long!!!","post_message":"“She is a good, smart, tough person who cares deeply about this country, and she has been in the public eye for a long time and in a culture in which new is always better,\" President Barack Obama said about Hillary Clinton. Do you agree?"}]
