[{"comment_id":"1134898503249901","commenter_b":"That's supposed to make me want to vote for her?????????","commenter_a":"From a Bernie Delegate: A hard day for most of us. I have contacts within both campaigns. Here what I was told yesterday and today. Clinton campaign to vote down every concession made to Bernie on the platform if he did not endorse her prior to the convention. Knowing that Superdelegates were not going to switch to his side without something major happening, the best he could do was hold on to the progressive concessions he won for US on the platform. He could not, in good consciousness let the GOP and Trump win, especially when we have a potential half of the Supreme Court Justices that will be replaced within the next 4-8 years. He was looking out for the future of our movement and our nation in this very hard decision he made. This post is not to tell you to vote for Hillary, or to not leave ...","post_message":"In the coming weeks, I will be announcing the creation of successor organizations to carry on the struggle that we have been a part of these past 15 months. I hope you will continue to be involved in fighting to transform America. Our goal will be to advance the progressive agenda that we believe in and to elect like-minded candidates at the federal, state and local levels who are committed to accomplishing our goals."},{"comment_id":"10153933427867235","commenter_b":"Shouldn't she be looking for baby daddy #3 instead of being an idiot?","commenter_a":"Barstool--shut up and go try to figure out who your latest baby daddy is.","post_message":"She said, ‘Not everyone gets a trophy.’"},{"comment_id":"986811718026353","commenter_b":"\"The kids will eat it up, if it's packaged properly Steal a sound and imitate\"","commenter_a":"And thats why i loved him 👊","post_message":"Nirvana's Kurt Cobain is known for being something of a legend in music, but that's not all. In fact, he said some pretty on-point things during his time, especially about rape, bigotry, racism, and feminism."},{"comment_id":"10153749043211159","commenter_b":"Our Country? Go back to Iran you POS!","commenter_a":"no","post_message":"The White House is back on it..."},{"comment_id":"10154189490969497","commenter_b":"Most teen girls are total bitches, even those with cancer.","commenter_a":"they always use a teenage girl for this example but never a teenage boy that does the same thing/worse :P","post_message":"Though the chemotherapy Rachel Fullerton is undergoing often makes her weak, she said she has strived to maintain her typical routine of rolling her eyes and sighing loudly anytime an adult addresses her."},{"comment_id":"10153756605707293","commenter_b":"They under no obligation to equally satirize. None at all.","commenter_a":"When you do one on Cruz's squished nose, Hillary's liar farm, Bernie's insane core math, then I'll listen.","post_message":"Wait, what?"},{"comment_id":"596495133817002","commenter_b":"Please put this bitch in, just for the sake of good comedy.","commenter_a":"And Dems here's 8 more years. Repubs are screwed if we put these people up.","post_message":"This is easily the most hated person by liberals. They will begin freaking out in 3... 2... 1..."}]
