[{"comment_id":"959584250762524","commenter_b":"That woman is so far out of touch with reality she is in her own dimension","commenter_a":"Hilary will lose","post_message":"Hillary Clinton on potential battle with Donald J. Trump: \"Look, I’ve been standing up to bullies my entire life on the international stage, on the national stage.”"},{"comment_id":"1785689904981470","commenter_b":"I'm considered a minority, but I will NEVER support a lying pandering corrupt person no matter the gender. Many of us are onto her regardless of her pandering. I hope that bottle of hot sauce that she carries in her bag at all times, helps her because she's going to need it. I'm happy she dodged sniper fire in Bosnia, but at this point, \"What difference does it make?\"","commenter_a":"Women and minorities will elect Hillary. We do not need an inexperienced, ignorant, unpatriotic misogynist as President. He isn't even familiar with the Constitution or how our system of government works and he is a horrible human being who brags about not paying taxes, crushing small business, defaulting on loans and being sexually attracted to his daughter. It is hard to imagine someone less qualified being nominated but then he ran against a group of people without a clue.","post_message":"After their hard-fought primary battle in 2008, President Obama asked Hillary to serve as his secretary of state. Here's what foreign policy experts and world leaders think about her four years as America's chief diplomat:"},{"comment_id":"1238033529550008","commenter_b":"Cute blonde catching giant gator. There's no race problem here, chill out!","commenter_a":"If this \"Aligator\" was black the outcome certainly would have been different!","post_message":"'Godzilla' did not take kindly to being restrained by alligator hunter Christy Kroboth @webpagelink"},{"comment_id":"10152912093186749","commenter_b":"PUKE.","commenter_a":"PUKE","post_message":"This Valentine's Day, Nicholas and Dylan are finally able to celebrate their legal marriage. This is progress. @webpagelink"},{"comment_id":"10154254404659411","commenter_b":"ya protest naked on the streets like the old lady in Australia it is 100% success rate","commenter_a":"Excellent News! These EU Nazi fascists need to be confined to the dust bin of history, and this thieving scum Schulz, Junkyard and is cronies sent to the gulag for the remainder of their lives for ruining so many lives in pursuit of their s**t sack Utopian dream which extends no further then their own arse pocket of course. Now, on another note, anyone have any ideas on we can help this festering turd of an EUSSR to collapse any faster????","post_message":"'Implosion of the EU'"},{"comment_id":"10153579902226135","commenter_b":"I think it's illegal to drive while drinking whether or not you have a child in the car...","commenter_a":"What's her name? I want to see if she has a Facebook.","post_message":"Initially, the woman is seen on video wearing only a tank top and underwear. Police says she appeared sluggish and smelled of alcohol."},{"comment_id":"10153205127216336","commenter_b":"They should be arrested, if any are on welfare they should lose their benifits..!!","commenter_a":"So they riot and loot because they don't have jobs and are poor?","post_message":"\"Because of my faith in God and people in the church that never gave up on me, I was able to pursue my own calling and purpose and destiny.\" Pastor Donte Hickman of Southern Baptist Church (Baltimore) told Gretchen Carlson that the youth in his community are not a lost cause."}]
