[{"comment_id":"837004389725950","commenter_b":"Oh so sad.","commenter_a":"Amen!!!!!","post_message":"Absolutely! Thanks to our friends at Democratic Memes for this great image. Give their page a like and let them know we sent you!"},{"comment_id":"10154164118946167","commenter_b":"Legal immigrants!","commenter_a":"There has got to be individual discretion involved in these cases. It's ridiculous. We are a nation of immigrants. We all come from an immigrant somewhere down the line!","post_message":"A Cambodian-American spoke out today about how inhumane Trump's immigration rhetoric is. This is an interview that a lot of people need to see."},{"comment_id":"10154927875454174","commenter_b":"Build that wall","commenter_a":"Protesters now these days are who are dividing the races","post_message":"Protests are happening in cities across the U.S. once again while President Trump is reacting to the judicial order stopping his policy @webpagelink"},{"comment_id":"1019443361412045","commenter_b":"Let's use it to build the fuckin wall","commenter_a":"Twice as much as reported. The other half is getting sold back by corrupt DEA agents. Border Patrol did their job, now DEA will make it tougher for them.","post_message":"Guess high, REAL high."},{"comment_id":"901808109839369","commenter_b":"Women can't vote or even wear a pair of shorts where these dumb laws come from, so should we impose those laws on Canadian women too Jeni? Canada should never change to suit others, they do not have to come here if they do not like it","commenter_a":"Harper wouldn't know the first thing about gender equality.","post_message":"Opportunistic feminism: Step 1: Find a practice you don't like Step 2: Claim it's misogynist Step 3: Demonize that group Step 4: Dismantle women's rights at will"},{"comment_id":"1790748334489343","commenter_b":"So go.","commenter_a":"Goodbye to all the rif-raf. America will be great again!","post_message":"SHARE THIS IF YOU WILL BE HAPPY TO SEE THEM GO!"},{"comment_id":"10152874635857894","commenter_b":"There's a reason she can't get and keep a man.","commenter_a":"Rob Spencer","post_message":"The Wife of Kenya Moore’s ‘Millionaire Matchmaker’ Boyfriend Speaks Out: ‘She Knew He Was Seeing Somebody!’"}]
