[{"comment_id":"10155027451044411","commenter_b":"Boooo :) make them strong :) We kick your ass in Afghanistan... @username should respect other cultures and their traditions.. These Indian Muslims doing this due to their believes.. This is racism what is @username doing..","commenter_a":"What about you Russian whores bathing their babies in Ice cold water... shit heads @webpagelink","post_message":""},{"comment_id":"1229861343720720","commenter_b":"She would govern effectively by not selling out, like HRC did decades ago and like Sanders never did during his campaign. #JillNotShill","commenter_a":"I have liked her page.I'm trying to research her. I have ave some reservations. If she were to win how could she govern effectively? With zero green party reps and senators to assist her. For the green party to be effective we would need down ticket victories also. I don't like Hillary Clinton! I absolutely fear Donald Trump. Voting green in 2000 gave us GWB. That is NOT debatable those that don't accept that are just in denial. Jill's platform is in accordance with my beliefs. I do think that her promise to put Snowden on her cabinet is pure pandering. That troubles me. Voting my conscience would be horrible if it means a Trump presidency.NOTHING COULD BE WORSE! !!","post_message":"Dr. Cornel West on the morally bankrupt DNC Platform: \"There's no way for me, as a human being, a teacher & a citizen - if we can't say a word about TPP, if we can't talk about Medicare for All explicitly, if the greatest prophetic voice dealing with impending ecological catastrophe can hardly win a vote, & if we can't even acknowledge occupation as something that's real for a slice of humanity... there's no way in good conscience I could say 'take it to the next stage!' I wasn't raised like that. That's not my calling. I'm just being truthful. It'd be a violation of my own limited sense of moral integrity and spiritual conscience. That's how I roll.\""},{"comment_id":"10153829014724091","commenter_b":"Does the witch have pizza","commenter_a":"Sounds like trump","post_message":"We're under a Tornado Watch -- checking in with Lee Goldberg on what we can expect."},{"comment_id":"10153619223127042","commenter_b":"My condolences to the family","commenter_a":"Kristopher Jadoo omg","post_message":"BREAKING: New details have emerged about an entire New Jersey family found dead at a burned home."},{"comment_id":"1295671170453891","commenter_b":"@username they danced!!!","commenter_a":"Winner eats the loser....","post_message":"Yes. Dinosaurs danced."},{"comment_id":"1264843663556103","commenter_b":"Christianity will not be dead, extremist Islam will keep it from dying and drying out. BTW atheist here.","commenter_a":"Because \"Christmas break\" is very Biblical. -.- I am so sick of these people hijacking God and MY Faith for their asshattery and hate. It's repulsive and they are such an embarrassment. And this is why Christianity will be dead in the US within the next 50-75 years.","post_message":"This kind of ignorance has no business influencing school children."},{"comment_id":"1062730680414093","commenter_b":"Donald trump can't even get 35% registered republicans Please do the math Trump can't win a general Election. You remember my words I'm not being nasty\" just call it in the know. You will find out I'm correct.","commenter_a":"This is for all of my fellow Florida voters. I just received my mail in ballot. Donald Trump is on the very bottom of the list, so please be careful and select him.","post_message":""}]
