[{"comment_id":"10153032074653145","commenter_b":"How date she!!","commenter_a":"'Stupid is as stupid does' Glad there's one less pea size brain off the streets. She and others with that type of violent ideas should be dealt with accordingly. Enough of thugs who think they can spread such animosity in a country with so many opportunities to do something positive, enough!!","post_message":" thought about shooting every white cop I see in the head..\" That's part of a Facebook post that got this mother arrested #WFTV"},{"comment_id":"1724103797869883","commenter_b":"This black pig needs to be publicly executed by being hung till dead,then tossed in the garbage tho I doubt the land fill will allow the garbage truck to dump their garbage with him in it .","commenter_a":"BLM, baby ! BLM !","post_message":"Media Silent After Black Teen Shoots Newlywed Veteran And Executes His Pregnant Wife. Tragedy strikes again, please pray. What do you think his punishment should be?"},{"comment_id":"10155316493136509","commenter_b":"She's a putz.","commenter_a":"Kacie Hughes","post_message":"Hillary Clinton: \"The good news is my pneumonia finally got some Republicans interested in women’s health\" @webpagelink"},{"comment_id":"10153768028339614","commenter_b":"Lol Olivia you sound butthurt or does truth hurt as Ben Carson state all black lives matter not just criminals","commenter_a":"Where's the black lives matter people at? Or is only white on black that matters","post_message":"An anti-violence advocate is now paralyzed after being shot in the back during an attempted robbery, and the teenager arrested was supposed to attend one of his speeches on reducing juvenile crime rates. The Cal Poly Pomona student turned his life around after a criminal history beginning at the age of 12 and facing abuse in foster care. But while in Georgia to share his message of peace, Semaj Clark was shot. won be able to walk anymore, and that hurts me, but it not going to stop be from doing what I got to do, he said tearfully from his hospital bed in Georgia, where he continues to recover. Watch KTLA video here: @webpagelink"},{"comment_id":"10153510348059411","commenter_b":"serious lips on that lady, shes got Grace Jones beat even.","commenter_a":"She has no ideas worth repeating-FIRE her.","post_message":""},{"comment_id":"549834655207114","commenter_b":"These women are child abusers. Where is child protection?","commenter_a":"Yes !","post_message":"These two lesbians are trying to play god with their son. This is the world we are living in today. Do you think this is wrong?"},{"comment_id":"10156822812815725","commenter_b":"your wife is hot","commenter_a":"You alone? Really? No help from anyone? Hmmmm","post_message":"Europe and the U.S. must immediately stop taking in people from Syria. This will be the destruction of civilization as we know it! So sad! It was just announced that as many as 5000 ISIS fighters have infiltrated Europe. Also, many in U.S. I TOLD YOU SO! I alone can fix this problem!"}]
