[{"comment_id":"1624969957723265","commenter_b":"That poor little girl. Her mother could have killed her driving around while heavily intoxicated. She clearly had time to buy and drink alcohol but not make sure there was food in the house???","commenter_a":"Don't have any sympathy for a mother that drives drunk with a child in the car. She could have killed her or someone you love. She should lose custody of the child.","post_message":"If you have blood flowing through your veins this video should make you furious! Watch it HERE: @webpagelink"},{"comment_id":"1727638077485478","commenter_b":"Theyre cool. But they claw into you. Very clingy animals","commenter_a":"@username this is why i wana go Australia - want one asa pet lets get one","post_message":"Koala joey plays in baby basket. Via Symbio Wildlife Park"},{"comment_id":"10152676681972507","commenter_b":"Not to mention that anti-semitic statements are illegal in France.","commenter_a":"In France you pick up 8 year old kids for what they said in school. I don't care how nationalistic you can get over this, this shows the French authorities are massive hypocrites when it comes to 'Freedom of 'Speech.","post_message":"He's 8."},{"comment_id":"10153538663841130","commenter_b":"Cristian Cabrera","commenter_a":"Marisa have you seen these guys??","post_message":"No mailman is safe..."},{"comment_id":"818824291595686","commenter_b":"@username. I don't live it Kentucky Faggott. Ummmm, Self -Employed Trucker. You big and Bad, bring your punk Ass on. Scatter my Brains. You ALL talk, punk Bitch. Tell your mama, to get back on the Corner, her break is up!","commenter_a":"By Law, if the man is found not guilty, they cannot Execute him. This is a Bogus Site!!!","post_message":"SPREAD THIS LIKE WILD FIRE! This man is INNOCENT! Do not stop until this is HEADLINE NEWS in the #MainstreamMedia! NONE OF US ARE FREE UNTIL ALL OF US ARE FREE!"},{"comment_id":"1118389778239557","commenter_b":"The question is, \"Is there a discernible difference between \"Radical Muslims\", and Muslims?\" When people close their eyes, get on their magic carpets five time a day and pray to Mecca, it is clear that Islam is the most important thing in their existence. Far above Nationalism, for the country they are in. For our own security, we must stop Muslims from entering this country. In addition, existing Muslims here should be asked and paid handsomely to leave. Finally we should ban all business dealings with Muslims and abandon the Middle East.","commenter_a":"Non't kid yourself islam is all radical at the core.","post_message":"This guy is EXACTLY right about radical Islam. Let's share this everywhere, because you know the media never will."},{"comment_id":"10153315951826336","commenter_b":"Start the engines and suck her up like a seagull.","commenter_a":"What's wrong this photo? Nothing I can see....","post_message":"Some passengers who had just boarded a plane at the Chicago Chicago O'Hare International Airport looked out their windows and saw flight attendant Ericka Paige Diehl posing for photos."}]
