[{"comment_id":"10154237826833010","commenter_b":"So no women has ever done the same thing right? Smh","commenter_a":"My son-in-law, a sheriff's deputy, once got a call about a baby in a car seat in a car in the parking lot of a \"gentlemen club\" translation - strip club!! The cops found the father inside getting a lap dance. He was supposed to be caring for his child while his wife, a doctor, worked the night shift at the hospital. What a father :( What a husband :(","post_message":"This week in North Hollywood."},{"comment_id":"10158120208050557","commenter_b":"You attempting to make this about ME, so as to DISTRACT from the FACTS, TRUTH and REALITY, is a very \"cute\" little trick, implemented by YOU and so many others, who comment on this page.","commenter_a":"The PRICKTATOR's is at it again. If you're not concerned yet, you're either brain dead or a complete idiot.","post_message":"President Donald Trump fired acting Attorney General Sally Yates Monday night for refusing to enforce a legal order designed to protect the citizens of the United States, the White House said."},{"comment_id":"10152902448996680","commenter_b":"Get your Zoloft refilled.","commenter_a":"She is despicable. Trash.","post_message":"The Island nation of Palau gets swept up in the Hillary Clinton controversy."},{"comment_id":"10154460389668445","commenter_b":"If this were on a normal sized girl, those panties would be muffin top city.","commenter_a":"What happened to the girl in the black suit her waist is half missing. Photoshop fail. Hahaha","post_message":"#Getstoned, caption this photo and tag two friends. These tees and more on sale shop.hightimes.com/collections/sale-items"},{"comment_id":"1447392598607688","commenter_b":"Style and Clinton DO NOT go together; she dresses worse than a bag lady.","commenter_a":"Oh Lordy, how gross!","post_message":"Hillary Clinton? You mean THAT Hillary Clinton?"},{"comment_id":"935501763157349","commenter_b":"Okay. That's more than a bit much. People shouldn't need to spread theirs legs that much. I wish people wouldn't call it man spreading though. I've seen women do it as well, and the name just sounds offensive.","commenter_a":"Frankly unless they refuse to close their legs to let someone sit next to them this is just stupid.","post_message":"They both spread their legs on the subway, but only one raised eyebrows. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"1309394412429310","commenter_b":"Cameron, it is obvious that you are not a Student of Roman Empire History. One of the last accepted practices, prior to the down fall was homosexuality and everything associated with it. The Citizens of Rome lost direction, they became more interested in Entertainment and the Entertainers that the health of the Nation. Want to know more, it is available","commenter_a":"Roman civilization didn't have God they worshiped abunch of gods and mainly themselves and there the longest most prosperous civilization in history","post_message":""}]
