[{"comment_id":"10154412077781323","commenter_b":"Italy isn't doing anything, yeah neither is Nigeria, or the Nigerian women that are the madams of these places.","commenter_a":"Italy allowing this to happen in plain sight. It's blatant and brazen and on the roads in broad daylight. The country should be in uproar, but no one does anything about it, not the government, not the vatican.....shameful.","post_message":"Thousands of women and girls are being trafficked to Italy from Nigeria, into a life of forced prostitution. Abused and desperately vulnerable, they have a champion in Princess Okokon, who was herself trafficked from Nigeria in 1999. Okokon fled her captors, and, with her husband, set up the NGO Piam Onlus Asti. Together they have helped hundreds of women in Asti and Sicily to escape their traffickers, giving them refuge and support."},{"comment_id":"785040181594590","commenter_b":"Lol...let's put all small business out of business because no skill workers want to get paid what skilled labor is paid..country is going to hell and fast","commenter_a":"I don't think a fast food employee should get $15. Maybe $8 start out and earn your raise, but not $15. If you want to make money in the food industry, become a server. Yeah, we make $2.13 and hr (yes our minimum wage hasn't changed in DECADES) but I work part time for full time pay as I call it. I work 3-5 hr a day which give s plenty of family time and can make $15+ an hr from tips off the table. That is how we pay our bills for those of you who feel tipping is dumb. My $2.13 pays the taxes and the smallest check I've gotten was 10 cents, some don't even get checks.","post_message":"\"We need you out there leading the fight ...\""},{"comment_id":"10154668593434062","commenter_b":"Yes, and the NFL approved it and promoted it. If you're going to boycott anything it should be NFL products.","commenter_a":"For those that are clueless or ignorant, she endorses and is promoting the black panther party, which is a racist militaristic organization whose motto is literally \"kill whitey\".","post_message":"Online opinions are intense."},{"comment_id":"976047545785108","commenter_b":"Go go Hillary, you will be next USA-President.","commenter_a":"Go Hillary all the way","post_message":"“Beijing is normally very hot and very dry in September, but it just poured rain throughout the conference. The Chinese claimed that it was the fault of all these women in Beijing.” Watch the history of Hillary’s stirring speech at the 1995 UN Women’s Conference:"},{"comment_id":"1016269761823135","commenter_b":"Disgrace to this country she is a racist bitch of another type BAN this bitch from your cities stop buying her crap she calls music no talent bitch.. Yes I am pissed she is allowed to keep going.","commenter_a":"She has shown her true stripes and needs jail time to think about what she did knowing her idiot followers would try to please her.","post_message":"Beyonce has morphed from pop-star to Jesse Jackson in a D-Cup. Check this BS out. BTW, She foments more hate than any zany right-winger 'the media' makes up. @webpagelink"},{"comment_id":"10154335910931130","commenter_b":"Just a joke? Really? So if you ever get assaulted verbally or sexually it's just a joke?","commenter_a":"Oh please. Hillary laughs at getting a guilty rapist off, what does it matter now, and trump was just making a joke. Get real.","post_message":"Talk about RIGGED!"},{"comment_id":"10154942733646873","commenter_b":"Sally Yates we need more of you. Well done.","commenter_a":"We have a dictator as presidentDon't agree with him ,you are fired","post_message":"Sally Yates had said the Justice Department would not defend in court Trump's immigration order."}]
