[{"comment_id":"959924910733924","commenter_b":"Nonsense don't believe the Hype. why don't you start a campaign to get rid of us Scots? You will be doing us a favour. For the record were not antiEnglish were antiWestminster","commenter_a":"All paid for by us Nice English people No wonder they voted against independent They would be mugs to leave their gravy train","post_message":"How Scotland got RICHER during austerity thanks to English taxpayers"},{"comment_id":"1065493480157790","commenter_b":"I hope he is right. We can live well without what Beck represents.","commenter_a":"lol Beck is always good for a laugh","post_message":"Glenn Beck's reaction to the fact that the Supreme Court upheld Obamacare was nothing short of amazing."},{"comment_id":"10153234639738701","commenter_b":"Portland should be really embarrassed","commenter_a":"Really??? With all the real people who have contributed their time and energy to the Parade over the years all they can come up with is a old smelly piece of rug???????????????????","post_message":"Just in case you were starting to think Portland's obsession with the #pdxcarpet was over..."},{"comment_id":"10153452410792235","commenter_b":"LOL He is such a nut","commenter_a":"Ted, I prescribe driving your chevy to the levy...","post_message":"You mad, bro?"},{"comment_id":"10152813780680950","commenter_b":"Kill the devil baby it comes from a rapist. The seed of evil grows within her.","commenter_a":"EVERYONE SHOULD REMEMBER U WERE ALL A FETUS AT ONE POINT TOO, MAYBE SOMEONE DEBATED ABORTIONING U WHEN THEY WERE PREGNANT, BUY UR HERE!!! I BET ALL U PEOPLE ARE AGAINST THE DEATH PENALTY TOO.....DAMN HYPOCRITS DONT WANT TO KILL AN ADULT BUT U WANT TO KILL A BABY!?!?!?!?","post_message":"In Paraguay, abortions are banned in all cases — even rape — except when the mother's life is in danger."},{"comment_id":"908413552551727","commenter_b":"Omg poor man i hope she gets sent to prison","commenter_a":"Poor man. I hope his wife gets a nice long prison sentence.","post_message":"A year on, he still has scars..and some of them will never fade"},{"comment_id":"10153043180073984","commenter_b":"Finally someone with a backbone. Why is the rest of the media supporting this evil by not showing the world their true nature?","commenter_a":"Close this guy and his mosque DOWN...","post_message":"Wow, what this guy tells Hannity about the awful Paris terror attack - how he defends the killers' actions...well, see for yourself.. Do you believe radical Islam is the enemy of civilization?"}]
