[{"comment_id":"10155855233440354","commenter_b":"Go away you airhead bitch","commenter_a":"To late dumb ass! No explication for intentionally exposing people to your obvious low grade DNA, should be a criminal offence!","post_message":"Even the liberal media is questioning this apology.... Check out the video...."},{"comment_id":"10154001146333598","commenter_b":"Give me a chance at her murderous body!","commenter_a":"Shame on you.","post_message":"This Abortionist Flies in to Planned Parenthood to Abort 31 Babies Every Day"},{"comment_id":"10152912675916051","commenter_b":"smith you ain't a pimple on my ass. Your pissed because everything I said is true. And I hope you need a cop and they make a stop on the way. Your not in my tax bracket, you don't have any skills ( unless having the government feed and house your little bastards ). All you good at is living off other people and their money. Your nothing but a waste of skin. Get a life and a job. Your the POS loser. And I can see you never served your country either, have you bitch?","commenter_a":"They said they filmed it. Were the hell is the rest of the film. It's funny they only show the cop saying something. What was said and what happened up to that time????","post_message":"When the guy in the car asked why he was being arrested, the officer didn't miss a beat: \"Because I feel like arresting you.\""},{"comment_id":"10154529062833132","commenter_b":"Your son probably won't even know what's going on unless he's seen the first one. Gtfo with your nonsense lady. I hope your son grows up to be a better adult then you.","commenter_a":"Cant they just leave the kids movie alone? Kid's dont need to see that. My son isn't going to see the movie now. I swear the gays have to take over","post_message":"Ellen DeGeneres is addressing the issue some people had after the recent Finding Dory trailer."},{"comment_id":"10155678849387004","commenter_b":"GET SOROS- GET SOROS!~ FREE AMERICA!","commenter_a":"This shows you how STUPID people at Berkeley are...","post_message":"In the 1960s, leftists at UC Berkeley fought for their free speech. Now they use violence and mayhem to trample on the rights of others..."},{"comment_id":"10155756776370615","commenter_b":"Refused. By Faux News? Well, it is official, her fifteen minutes are over.","commenter_a":"One sick puppy","post_message":""},{"comment_id":"1238033529550008","commenter_b":"Cute blonde catching giant gator. There's no race problem here, chill out!","commenter_a":"If this \"Aligator\" was black the outcome certainly would have been different!","post_message":"'Godzilla' did not take kindly to being restrained by alligator hunter Christy Kroboth @webpagelink"}]
