[{"comment_id":"1287108874642473","commenter_b":"OF COURSE OBAMA`S AND HILLARY PAY CHECK FROM SAUDI ARAB IS GETTING BIGGER BY SECOND , IMAGINE WHEN THIS HYENA BRING MORE OBAMA`S ANGEL REFUGEES... HOW BIG HER CHECK WILL BE..? HYENA CLINTON WILL NEVER SUFFER MUSLIN VIOLENCE , SURROUNDED BY HEAVY ARM BODYGUARDS , OK...WHAT ABOUT YOUR FAMILY..? IF OBAMA`S GANGSTERS TAKE OUR GUNS ...HOW WE ARE GOING TO PROTECT OURS FAMILIES...? WORKING HARDER IN ORDER TO FEED OBAMA`S ISLAM ORPHANS & WIDOWS ANGELS OR BLACKANIMALMATTER OR ILLEGALS ,...DEMOCRATS SLAVERING THE PLANET FOR ISLAM ...NOT SEE IT YET ...SERIOUSLY ..? CHECK HOW MANY PEOPLE ARE ON WELFARE OR FOOD STAMPS ..","commenter_a":"Who is the mayor?","post_message":"\"If you go 15 miles from downtown you will find communities that don't have water or sewer yet.\""},{"comment_id":"523996764459649","commenter_b":"She is so full of crap!!!","commenter_a":"Not my husband ... Wrong again Laura !","post_message":"Laura Ingraham makes predictions:"},{"comment_id":"10153067823099411","commenter_b":"My respected fellow u explain very nicely like a poet and blame to muslim now one question who attack on Afghanistan who is killing innocent people in Pakistan by drawn attacks who is killing Muslims in burma. who is killing Muslims in Africa,and one thing listen Islam is the religion of peace not terror first study islam than make justice infront of me 10 cristians got Islam its not the issue main point is that dont try to impose religion war make the world peaceful place not hell thank you","commenter_a":"Copy and paste this on ALL muslim stories! Flood them with the truth! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Muslims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were ...","post_message":"Hundreds of thousands have flooded the streets of Chechen capital of Grozny in a rally against the publication of the Prophet Muhammad by Charlie Hebdo magazine. The demo, dubbed to Prophet Mohammed, was organized by region clerics and united muslims from various regions of Russia."},{"comment_id":"10154429253158812","commenter_b":"Oh the illegals know wnglish, most play stupid","commenter_a":"So we don't require illegal aliens to speak English but go to Vietnam to teach them English","post_message":"Pres. Barack Obama announces that the Peace Corps will go to Vietnam for the first time. The group’s main focus will be teaching English to Vietnamese students."},{"comment_id":"1149843228370020","commenter_b":"1404343676260901house @username","commenter_a":"Chris Weishuhn","post_message":"What happens when you strap a GoPro to a giant sea turtle. Video by the WWF."},{"comment_id":"10155874943040354","commenter_b":"Black scumbags do not matter !","commenter_a":"I'm sure Al Sharpton and his ilk will spin this as a racial injustice and Obama will write his family. Probably won't claim him as looking like his son as he's been there and done that. All of them are sick sons of bitches.","post_message":"Police say the 82-year-old did one thing that likely saved her life..."},{"comment_id":"897220707004345","commenter_b":"Ah yeah, 'only'!","commenter_a":"Emma Marie Hulme Bet you'd be able to shed some light on this!","post_message":"Near death survivor says all he saw was darkness"}]
