[{"comment_id":"1809746189282784","commenter_b":"Why you wait until today to do this stupid you are old and stupid my God how a woman do these stupid thing","commenter_a":"Stupid stupid","post_message":"#LIVE VIDEO: Attorney Gloria Allred is holding a press conference with a woman who accuses Donald J. Trump of sexual misconduct."},{"comment_id":"10154335392498812","commenter_b":"learn the law because you look like an idiot. TRANSGENDER people can use the bathroom, not men like you and I. I cant just say oh I want to go pee in the ladies room. that isn't how it works. I have a friend who is transgender and her license now says female. she looks like a female. should she go into the mens room? the law is for people like that, not just people who decide today to go in the opposite sex bathroom.","commenter_a":"I won't be listening to them anymore!!! Transgender people are not the only ones with rights,,,if you're a man who wants to use the ladies room get a sex change ....Liberalism is ruining our country,,,,what was a constitutional republic is turning into a socialist hell hole","post_message":"Pearl Jam cancels North Carolina concert, calling HB2 law \"a despicable piece of legislation that encourages discrimination.\" @webpagelink"},{"comment_id":"1411220458918808","commenter_b":"I honestly think you just don't understand because you have never been through it. Hopefully you never will. It's a tough road as a parent. But My SON JASON is the love of my life!","commenter_a":"why do people with autistic children often talk about \"mourning the death of the child they thought they had\"?? its the same kid. we're not car accidents to be grieved over. we are people.","post_message":"Greg and Maya are doing everything they can to make sure their son with autism is safe, comfortable, and — most of all — happy. Parenting 2.0 | An Upworthy Original Series"},{"comment_id":"10153465235771316","commenter_b":"I guess the woman in this pic is borderline retarded...","commenter_a":"They can store more farts too so that's good","post_message":"Women with larger behinds are healthier and more intelligent, study finds: @webpagelink"},{"comment_id":"1663552577266891","commenter_b":"Yes--indeed. This woman's behavior is appalling.","commenter_a":"Trump supporter! Makes me sick!","post_message":"Attacked as they prayed? A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."},{"comment_id":"10158427550135093","commenter_b":"I watched a movie recently where this woman wanted to sing and thought she could sing. Because her husband was somewhat affluent she sang in get togethers and everyone fawned upon her and let her believe she could sing. Eventually her delusion became so bad that she wanted to pursue more public and aggressive venues for her singing. A doctor stepped at her husbands request, and decided to record her and play it back to her so she could be faced with the reality of her own voice. Alas, upon hearing it. . .she dropped dead.","commenter_a":"Ye are away with the fairies so ye are","post_message":"Over the line. Katherine Timpf sums it up as only she can."},{"comment_id":"10154246053623797","commenter_b":"They are being peaceful.","commenter_a":"No reason to protest. Have a vigil. Be peaceful!!","post_message":"#CHICAGO PROTESTS: Protesters swarm the Chicago Police HQ"}]
