[{"comment_id":"10153685089913037","commenter_b":"@username how about we deport you Michelle? You see my Apache and Mexican ancestors were here before you ancestors ever set foot, RAPED and KILLED my people. Texas belongs to us. So, get it straight. YOU are the illegal here Michelle.","commenter_a":"Omg if you are legal he doesn't want to send you back. If you are illegal you should be in jail anyway","post_message":"\"It was kind of demeaning.\""},{"comment_id":"679630052167782","commenter_b":"She needs to be deported.","commenter_a":"i think you belong over there","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"894913557210733","commenter_b":"That's a very good question. They should have been the first to do that, And Arizona as well. But I don't think we can save lower California. The illegals think they own it anyway........","commenter_a":"ok texas needs to do this fast","post_message":"AND He needs our help!"},{"comment_id":"822517567938820","commenter_b":"This woman is crazy saying Hillary is the most loved and respected woman in the world! She's been hanging around Hillary to much, and Hillary's lying is rubbing off!!","commenter_a":"Security should of threw her out on her ass. The demons must be running scared.","post_message":"Watch: Dem Chair Shows Up INSIDE GOP Convention Arena And Does The Unthinkable It is amazing to see to what extent the Democratic party will try to derail Trump's campaign. Do you stand behind Donald Trump?"},{"comment_id":"434228700035058","commenter_b":"Why so illegal immigrants can collect our money??? I think u should have to prove that you' have worked for 20 yrs or more to collect","commenter_a":"Also give thanks to Bill Clinton who signed the bill making it legal to outsource jobs here.","post_message":"Jeb Bush wants people to work until this age. I'm sure this will raise some eyebrows."},{"comment_id":"467133756816336","commenter_b":"That is a disgusting fact. Those people should be ashamed to call themselves 741915279236631s","commenter_a":"That is a shocking testament of liberal standards & ethics!","post_message":"A new poll found 71 percent of Democratic voters believe Hillary Clinton should keep running even if indicted, a view shared by only 30 percent of Republicans. Where do you stand?"},{"comment_id":"10153854560011378","commenter_b":"Hillary is nothing but a liar... Trump 2016","commenter_a":"I'll be so glad once Hillary Clinton wins and becomes our new president because her speech she gave the other night everything that she said about keeping the guns out of the hands of criminals terrorist and these bad people that shouldn't have guns in the first place she will keep us good people from getting shot will be great we need a change in America please God let Hillary Clinton get enough votes to win in November","post_message":"A shooting victim has died and one man was taken into custody after a police chase and crash in South Philadelphia."}]
