[{"comment_id":"10155046621507704","commenter_b":"No way these girls aren't boozin b4 these press conferences, no way...","commenter_a":"If these morons didn't play loud music in the background, you might actually be able to hear what the people are saying.","post_message":"They're losing it! In more ways than one..."},{"comment_id":"10153646192306880","commenter_b":"They like getting in touch with their feminine side. :)","commenter_a":"I have the man color, slate grey.","post_message":"Let's face it, the \"rose gold\" iPhone 6s is pink."},{"comment_id":"1413505585331340","commenter_b":"YOU are ONE CRAZY WOMAN!!!! You just wait.... Trump is going to eat you alive during your debates! Trump/Pence2016!!!","commenter_a":"I think she has short circuited or blown a fuse.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"},{"comment_id":"10154115994939369","commenter_b":"The thugs will make their way over to this mall too.","commenter_a":"This must be for everyone who wants to shop at Easton, but are tired of all the thugs that are there on the weekend.","post_message":"Not all neighbors and nearby businesses are happy about the new mall."},{"comment_id":"972807806163282","commenter_b":"shes a Savage","commenter_a":"@username her","post_message":"The former Stanford University student who sexually assaulted a woman behind a dumpster was released from prison on Sept. 2, 2016. That a full three months early from his original six month sentence."},{"comment_id":"1010236605683478","commenter_b":"What a joke. Most of those assclowns couldnt get laid without a prostitute. Legalize it so the ladies can get paid. Quit hating on people.","commenter_a":"put more people out of work!","post_message":"Eric Holder had to send an unbelievably embarrassing memo to his DOJ staff that shouldn't even be necessary, telling them not to hire prostitutes."},{"comment_id":"10154017510261336","commenter_b":"I NEVER SEE THIS KIND OF PLANNED HATE TO DONALD TRUMP OR DOCTOR CARSON AND NOT TO OBAMA OR SOCIALIST ILL SANDERS OR HYENA CLINTON... NOBODY IN CNN OR ISLAM PAY MEDIAS NEVER ASK DEMOCRATS... WHAT SOCIALIST COUNTRY IS DOING BETTER THE U.S.A. ....WE DON`T NEED SOCIALISM OR ISLAM LAWS ,,SOCIALISM LEECHES SUCK CAPITALISM LIKE CUBA FOR 65 YEARS SUCKING FLORIDA MONEY TO CUBAN GOVERNMENT AND PEOPLE ...WHAT A ZOMBIES IGNORANT DEMOCRATS ARE ....NOW EVERYBODY CAN SEE THE FUTURE IF TRUMP WIN THE WHITE HOUSE... BUT NOBODY CAN IMAGINE OR SUGGEST THE DESTRUCTION THAT MUSLIM LEADER OBAMA ALREADY DONE IT ..OBAMA`S ACTION ALWAYS BENEFITS HIS RACE ISLAM ,SOCIALISM ,BLACK CRIMINALS ,OUR MONEY SEND TO HELP ALL PLANET BUT NOT THE TAX PAYERS....OUR CONSTITUTION IS BY FAR THE BEST GIFT TO HUMANS FREEDOM ....AND CAN YOU BELIEVE ME I`M NOT GETTING PAY FOR DOING THIS I CALL THIS THE POWER OF ...","commenter_a":"And the lobbyists and special interest groups Bush, Trump 2016","post_message":"Jeb Bush said to defeat radical Islam, we \"shouldn't have the warfighters have their arms tied behind their backs.\" Do you agree? #GOPDebate"}]
