[{"comment_id":"10155757585249829","commenter_b":"Why not boycott Budweiser simply because it is not good beer?","commenter_a":"Melania???????","post_message":"Trump supporters on social media were furious: \"Never drinking Budweiser you should respect the AMERICAN president instead you mock with liberal propaganda.\""},{"comment_id":"10156411867420354","commenter_b":"@username , NO MORE REFUGEES !! I DO SAY NEVER FORGET WHAT THE islamoCRAPS AND obuma HAVE DONE TO AMERICA ! PROSECUTE obuma & killery FOR TREASON !! DONALD TRUMP/CRUZ 2016 ! AMERICA NEEDS PHOTO I.D. TO VOTE , IDENTIFICATION , FOOD STAMPS , ETC ! TERM LIMITS WITH NO BENEFITS ! DRUG TEST ALL FED. EMPLOYEES AND THOSE COLLECTING WELFARE ! ABOLISH ALL GUN FREE ZONES ! IF YOU AGREE PASS IT ON !","commenter_a":"Political correctness=Nazism","post_message":"When you see the so-called \"politically incorrect\" sign, you'll instantly understand why liberals' heads are exploding...and will want to buy a cupcake from these folks."},{"comment_id":"10150787426639999","commenter_b":"I'd stay in line then.","commenter_a":"Police State: \"Get in line or we'll crack your skull.\" That's the direction we're heading towards if we let this continue.","post_message":"As the girl struggles, the officer whirls around and then slams her down onto a brick sidewalk."},{"comment_id":"1041072545948147","commenter_b":"You look like a witch already","commenter_a":"this the third post i've seen with this baby and all the \"after\" babies are different babies...the jig is up!!! i'm starting to suspect the witchcraft claim is true...this baby has changed to even 3 different complexions and facial features or somebody has nothing to do by come up with lies to make themselves feel righteous!!!!","post_message":"A little positivity out of a horrible situation 🙏 Baby Hope, who was found starving on a street in Nigeria after he was abandoned by his family over accusations of witchcraft, makes extraordinary improvements since he was helped by Danish aid Anja Ringgren Lovén."},{"comment_id":"10153120731383010","commenter_b":"now THAT'S a woman!","commenter_a":"Yay! Now wet can objectify plus - size women too! We're all about equal opportunity around here!","post_message":"When Sports Illustrated's 2015 swimsuit issue hits newsstands next week, it will include an ad featuring plus-size model Ashley Graham. Cause for full-figured celebration?"},{"comment_id":"10155295092495579","commenter_b":"Liar!","commenter_a":"Zero evidence that Russia had any influence in our elections , period. The only people that believe this are the liberals that hate Trump.","post_message":"President Trump: \"To be honest, I inherited a mess. It's a mess. At home and abroad. A mess.\" Watch full news conference here: @webpagelink"},{"comment_id":"10154376306546636","commenter_b":"She did? She'll never get out of prison.","commenter_a":"She got off easy for mowing down people terrorist style. Or maybe they got the idea from her idk","post_message":"A woman accused of a deadly crash that claimed four lives during a homecoming parade in Stillwater has accepted a plea deal."}]
