[{"comment_id":"10154098504122541","commenter_b":"Omg you. Are too much really","commenter_a":"Ugh, putting my faith in Mike Pence to save us from Trump? Lose Lose situation. Pence is actually scarier, he just tweets less. Hmm, decisions lol","post_message":"Let's talk about the 25th Amendment."},{"comment_id":"10153754678291336","commenter_b":"Can't play politics and disarm society if you make the kids safe! Gotta get a few kids killed to advance if you're a communist. The end justifies the means with these Freaks.","commenter_a":"jerry brown is a fool","post_message":"Does this make schools safer?"},{"comment_id":"1159620574116477","commenter_b":"Why doesn't she leave, to many people here anyway.","commenter_a":"American is great, but we all have to remember who we got this great country from the great American Indians they should be the only ones who can say who can stay and can't.","post_message":"This whiny Home Depot employee is going viral in all the wrong ways after a man's photo caught what was on her hat... this is disgusting. The employees of this Home Depot store clearly don't want our money, so let's make sure they don't get it."},{"comment_id":"1036436079751842","commenter_b":"Now that's a face only a mother could love!!!! What a mutha!!!","commenter_a":"BS!","post_message":"UNREAL: Thug Rapper Calls For Presidential Candidate To Be Slaughtered- Media Silent (LISTEN) Could you imagine if a white guy did this to candidate Obama? @webpagelink"},{"comment_id":"10153451961173717","commenter_b":"Jamie Woods well we don't have any respect or trust in the lying liberals democRATS..who believes in killing unborn babies and selling their body parts, nor allowing illegals into our country so they can suck the life out of America by getting on welfare and to kill,also not support our troops..democrats only care about their own pockets..","commenter_a":"he isnt any worse then the other ones that are running at least TRUMP tells the truth doesnt mince words doesnt try and manipulate and cheat his way through and election.","post_message":"Skywriters stole the show at the 127th Rose Parade in California on Friday, dashing out a message for Donald Trump just as the last float left the gate. \"America is great! Trump is disgusting,\" were the words dotted clearly across the sky on what appe..."},{"comment_id":"10156205584795354","commenter_b":"Right, blacks and immigrants are the problem. It was a white kid who went into a black church and shot and killed 9 blacks while they worshiped. It was a white kid who went into the Sandy Hook Elementary School and shot and killed 20 children while they were trying to learn. He also shot and killed 6 educators who were trying to teach the days lessons. It was a white man who went into a theatre in Lo. and killed people while they were watching a movie for enjoyment. It was a white man who went into the theatre in Co. and shot and killed people who were out for a night of entertainment.","commenter_a":"If people like her wouldn't say dumb shit like this, then most of the \"white people\" wouldn't be racist towards blacks. They just keep it going instead of trying to get to the problem, causing more anger and violence from within everyone.","post_message":"“Right now we declare, it’s open season on a motherf–king cracker. All you motherf–king crackers y’all need to watch your motherf–king heads.”"},{"comment_id":"1097574603596883","commenter_b":"Lol those mother fucks love my ankles","commenter_a":"Ruben Yunv Castillo","post_message":"Why do they torment me and leave everyone else alone?!"}]
