[{"comment_id":"10154180485564411","commenter_b":"Here illegally? They should hide.","commenter_a":"Most criminals try to hide. Live in fear!","post_message":"Immigrant rights activists call it the Effect."},{"comment_id":"10153740918402217","commenter_b":"Good for the women!","commenter_a":"Or are they being left to clean up the rubbish left by the men? When it all goes wrong, people of the masculine variety will blame the women when it was 3 of their number who screwed it up in the first place!","post_message":"It may be a watershed moment."},{"comment_id":"1420761931270891","commenter_b":"I'm just annoyed that girl had to post it. The minute she posed with it and posted it made it a trophy kill. She didn't pay all that money to go to Africa to feed the orphans, cause if that was the case, she would have gone about it a different way. Don't get me wrong, I think it's great that a lot of people got fed, but in her mind this was all about the trophy.","commenter_a":"@username, @username, did you see This? Hopefully there isn't protesting in CV","post_message":"12-year-old hunter speaks out after facing backlash online for posting photos with big game. \"I'm never gonna stop.\" @webpagelink"},{"comment_id":"10153326464497235","commenter_b":"She is definitely a jerk. And that's putting it nicely. lol","commenter_a":"all they needed to do was let her call someone to prevent his suicide. a tragedy when regulations trump basic moral values.","post_message":"She says a Southwest Airlines flight attendant slapped the phone out of her hands ..."},{"comment_id":"10154354422615950","commenter_b":"$400,000 a day for Melania to stay in NYC.","commenter_a":"Two weekends in a row out of three weeks in office we've flown him to Florida. Where is the Republican outrage?","post_message":"On Saturday, President Donald J. Trump is hosting Japanese Prime Minister Shinzo Abe at his resort in West Palm Beach."},{"comment_id":"10154402940891636","commenter_b":"Americans with guns are more of a threat than any other nation, must loose more lives with kids and their \"toys\"","commenter_a":"If he'd spent the $trillions he'd wasted on wars on so-called 'Climate Change' instead, then im sure the world would've been closer to 'normality' by now, but no, 8 solid years of bombs in the Middle-East is what you get. Why thank him for this, its given us EU terrorism.!!","post_message":"Hero"},{"comment_id":"10153469031994705","commenter_b":"Everything is wrong with McDonald's.","commenter_a":"Well I love mc donalds There's nothing wrong with mc donalds","post_message":"McDonald's big secret isn't so secret anymore."}]
