[{"comment_id":"1346164815479767","commenter_b":"She will not ever be our president","commenter_a":"The Department of Justice is now the Department of Clinton. The FBI are just employees of Clinton also. Do not trust the FBI. Join your local militia! Support your 2nd and 1st amendment. Remember Hillary Clinton is everyone's enemy and all Liberals are animals and terrorists. The North should have there own country. The South and Midwest our own also. Liberals can't be trusted. Liberals are not patriots.","post_message":"BREAKING: Here are the NBC News presidential race updates for 8PM ET poll closings @webpagelink #Decision2016"},{"comment_id":"1068708143222239","commenter_b":"Stupid","commenter_a":"Think of how awesome it would be if our President wasn't the anti christ.","post_message":"Happy Presidents Day. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10157734459025354","commenter_b":"Bill can't wait to be in Las Vegas were the hookers are like running water! I did not have sexual relations with those hookers!","commenter_a":"The real deplorables are the 40 something % of true idiots that are still backing the Clintons- Trump people are fed up taxpayers-","post_message":"If she's \"feeling great\" as Team Hillary claims, why isn't she campaigning? What is going on? And why can't these two ever tell the truth?!"},{"comment_id":"10153152678751051","commenter_b":"Lady u need help your just stupid","commenter_a":"So many evil haters for every Obama achievement. You have all been wrong on everything Obama has done this far. It is time to take a positive stance!","post_message":"President Obama says today's Iran deal is a huge victory. What do you think: is this a good deal for America?"},{"comment_id":"1734664193415362","commenter_b":"Don't Worry Bernie supporters.. !! Hillary will never win, well never let her ! #FeelTheBern #NotMeUs #HesWithUs","commenter_a":"Hillary is the clear choice for the White House!","post_message":"What a week."},{"comment_id":"10154369972274749","commenter_b":"He is just like the guy that went on s rampage at the abortion clinic but this time he us a Muslim which changes the entire situation.","commenter_a":"Come on give the man a break,he was only a good muslim following the teachings in holy quran giving the wife the odd back of the hand and killing gay's is all well and good with islam ! It's us that have to adjust to the way they want us to live","post_message":"Mateen's ex-wife said she had been beaten by him during outbursts of temper in which he would \"express hatred towards everything.\""},{"comment_id":"10154438030826336","commenter_b":"Fat lesbians...","commenter_a":"Disgusting that Chick Fil HITLER would laugh about genocide.","post_message":"Celebrate #CowAppreciationDay at Chick-fil-A!"}]
