[{"comment_id":"1067324623308009","commenter_b":"Why should anyone get special benefits for being married?","commenter_a":"I am for the government getting out of the marriage business","post_message":"While we celebrated the right of same-sex marriage finally being nationally recognized, Republicans began to lose their minds."},{"comment_id":"10153253183992690","commenter_b":"Hispanic Race Mexican Race Human Race Everyone is a Race!","commenter_a":"I do not hate Mexicans! So get that straight! Illegal alien does not necessarily mean \"Mexican\"! Seriously????","post_message":"A former Texas DPS employee at the Irving office is sentenced Thursday for selling driver's licenses to dozens of unauthorized immigrants. @webpagelink"},{"comment_id":"759110204189419","commenter_b":"@username Don't come to America, lol","commenter_a":"Here's a counterpoint. If you un-sexualize all body parts no one will want sex as, hey that's just a hand and that a boob and that a....Well maybe this is what we need then to decrease the enlarged...population, LOL! Truth is, I don't respect anyone who sells themselves. Even a little bit.","post_message":"Women everywhere are freeing the nipple but Facebook doesn't want us to show it. #MicCheckDaily"},{"comment_id":"10154903561816320","commenter_b":"maybe you can volunteer to carry luggage to plane and save Us some money sore loser","commenter_a":"Let me guess, he'll insist on using his TRUMP Air instead then charge back the cost to the US government (i.e. taxpayers...). Maybe he can make his daughter Tiffany head flight attendant and get her salaried too","post_message":"BREAKING: President-elect Donald J. Trump says he wants Boeing Company to cancel the order on a new 747 Air Force One for future presidents. At more than $4 Billion, Trump says it's \"ridiculous\" and he \"wants Boeing to make money, but not that much money.\" (AP photo) MORE: @webpagelink"},{"comment_id":"10154060235711336","commenter_b":"Refuse to have hearings on any potential candidate until after the election.","commenter_a":"Quit following this piece of trash. Go back to Cuba where you came from.","post_message":"“We risk losing our basic constitutional rights with one more liberal justice on the court.” Sen. Ted Cruz reacted to the passing of Supreme Court Justice Antonin Scalia, saying this loss “underscores the stakes of this election.” Do you agree? @webpagelink"},{"comment_id":"10155087301336509","commenter_b":"@username once stench like you and others weeded from this country, then decency and class will return. Its your choice to be losers. Stop blaming others for your failures in life..CLASSLESS!!!!!","commenter_a":"Michelle Obama is the strongest and the women with the most elegance I've ever heard of. Hopes she stays in politics and still get involved after she leaves the White House!","post_message":"\"Don't let anyone tell you that this country isn't great. This right now is the greatest country on earth,\" Michelle Obama said."},{"comment_id":"629803473847253","commenter_b":"she is a bitch to treat that young woman like that","commenter_a":"What a bitch!","post_message":"MUST WATCH: Hillary doesn't like being challenged by black woman. Welcome to the DEMOCRAT plantation."}]
