[{"comment_id":"10152775475131045","commenter_b":"Yes, don't nobody want to mess with this grandma about her grandchildren.","commenter_a":"As a grandparent I cannot Fathom how you could do this. I would protect my children and grandchildren with my last breath","post_message":"Breaking news out of Etowah County tonight. A jury found Joyce Garrard guilty of capital murder in the running death of her 9-year-old granddaughter."},{"comment_id":"1382661791756865","commenter_b":"Somebody pleass shut this fatass up.","commenter_a":"some day little fat man someone is going to shut your mouth when you talk about things u don't know anything about.u are just mouthing off cause u want to be a big ass --- hum you already have a big ass --- so get off President Trumps back. he is only do what he needs to do to keep America safe","post_message":"Michael Moore always finds a way to be even more classless than he was minutes before! That seems to be his only real talent."},{"comment_id":"10155086092991509","commenter_b":"They even rape cows over there... And they think cows are Gods. It's weird.","commenter_a":"India has one of the worst rape problems in the whole world, honestly if you're a woman going out after dark there it's almost a sure thing that you will get raped","post_message":"The suspect was reportedly out on bail while he awaited trial for his first rape of the teenage girl."},{"comment_id":"10154486445542994","commenter_b":"There is no male. It is a transgendered woman.","commenter_a":"they beat his anus","post_message":"Courtney Purvis says she was attacked outside of a bar in Dearborn because she identifies herself as transgender."},{"comment_id":"1658924690814663","commenter_b":"And last time I checked, Treason still carries the death penalty! That would certainly get rid of a bunch of \"bad actors\"! It would go a LONG WAY towards \"making America great again\"!!!","commenter_a":"Trump and Bannon are complicit in Flynn's actions. Does anyone remember Trump tweeting about how \"smart\" Putin is after Putin chose to not retaliate against the sanctions?? This was all coordinated at the highest levels. The whole administration should be in jail for conspiring with a foreign government against America's interests both before and after the election. If all of this put together isn't treason, I don't know what is.","post_message":"Bet Trump knew about this...."},{"comment_id":"10153482590876509","commenter_b":"Yes. GTFO IF YOU DINT SUPPORT ISREAL SND THE USA","commenter_a":"Try again @username..... We still stand behind Israel!","post_message":"Two days after his victory at the polls, Israeli Prime Minister Benjamin Netanyahu has already walked back his disavowal of a two-state solution with Palestinian statehood. @webpagelink"},{"comment_id":"10154975691779859","commenter_b":"Not only NO but hell NO!","commenter_a":"No","post_message":"Should Betsy DeVos be confirmed by the Senate. Although Roy Blunt supports her, local educators and politicians have expressed concerns about her nomination. Vote and then tells us why you support or do not support her in the comments."}]
