[{"comment_id":"854726854659317","commenter_b":"Build the wall","commenter_a":"The Donald has done it again @username","post_message":"I don't have time for political correctness and neither does this country. Donald J. Trump"},{"comment_id":"990159621088681","commenter_b":"Party affiliation is not THE ISSUE & what you should be voting on here Is Making America BETTER, PROSPEROUS & SAFER. IF YOU WANT MORE LIES..MORE CORRUPTION ...MORE $$$$$$$ GIVEN TO THE MIDDLE EAST...MORE WEAPONS SUPPLIED TO THE RADICAL GROUPS....MORE ILLEGALS COMING IN... MORE MURDERS..SANCTUARY CITIES... ...VOTE HILLARY.. YOU are the SHEEP. THE UNION HAS MADE YOU FOLLOWERS. SOUNDS LIKE MOST UAW MEMBERS ARE WISING UP. LOCAL 909 MEMBERS HAVE. EDUCATE YOURSELVES. WATCH: CLINTON CASH HILLARY THE MOVIE HILLARY'S AMERICA 13 HOURS READ: GUILTY AS SIN PARTNERS IN CRIME CRISIS OF CHARACTER ....and so much more... Investigate the CLINTON FOUNDATION.. HOW THEY HELPED (LOL) HAITI. They stole billionsof donations from these poor people. CLINTONS ARE FULL OF LIES. THEY MUST NOT BE TRUSTED! !! HILLARY CLINTON IS A WICKED WOMAN..for those who follow LOUIS FARRAKHAN, he States this fact, he also states how obama has failed his people. Look it ...","commenter_a":"Out of all the people in this work and these two clowns are the only choice","post_message":"Donald J. Trump is speaking this afternoon at Macomb Community College in Warren."},{"comment_id":"10152855879679753","commenter_b":"Bitch! F*cking bitch.","commenter_a":"My heart breaks for what that poor boy must have gone through.... how anyone can harm a child I'll never understand. I agree with others here. The parents knew he was being beaten. Something should have been done sooner.","post_message":"This woman did something horrifying to her 3-year-old nephew, all because he was having difficulty with a spelling lesson."},{"comment_id":"1062283227145482","commenter_b":"Glad you decided to be a Republican, Eric! Your bigoted remarks belong with them.","commenter_a":"Chan Zilla, even white people are getting sick of white people's bullshit...","post_message":"The significance of the march on the Confederate museum should not be lost. The Confederacy in and of itself was built on racial terrorism."},{"comment_id":"960437774039688","commenter_b":"Get the delegates and you win.. How would they screw him if he gets the necessary votes?","commenter_a":"If after winning FL, MO, NC and IL, Trump does not get nomination, Rubio and Kasich do not drop out... I with all my family and friends will never vote for GOP.. We will be life time democrat..Trump is better than all GOP candidates , if not trump than Clinton or Bernie is fine for me because GOP does not count out votes as votes... They want to do what they want.. They don't hear our voice...","post_message":"\"Donald Trump is one of the two most talented presidential candidates any of us have covered.” Mark Halperin Bloomberg Politics Managing Director Editor"},{"comment_id":"10155818590289657","commenter_b":"Democrats always want more. They're parasites .","commenter_a":"Who cares what the democrats want. I am so tired of them making demands. They are nothing more then a pack of bullies and I am tired of them. They should try to fix themselves rather than telling other people how to think.","post_message":"\"Ridiculous shame.\""},{"comment_id":"1643657415907529","commenter_b":"Literate people too lazy to read...","commenter_a":"And...this thread has made me loose hope for humanity.","post_message":"What is it and why is this happening?"}]
