[{"comment_id":"10153377243163812","commenter_b":"Criminals go to Jail not to a coffin u c u n t","commenter_a":"Never in my entire life did I see so much racism!!! And it's NOT whites against blacks but the other way around!!!! Freddie gray was a criminal as was Michael brown!! Both got what they deserved in my opinion! Both had rap sheets a mile thick! Don't break the law and you won't get arrested! Simple logic! Don't get me wrong in today's society many cops coming are only there for the power but there are more that truly want to make a difference and it's sad when they're charged for trying to remove scum from the streets!","post_message":"BREAKING UPDATE: Warrant issued for arrest of 6 officers in Freddie Gray case; various charges including murder, manslaughter, assault being leveled: @webpagelink"},{"comment_id":"1780142445541305","commenter_b":"Lmao","commenter_a":"What in the actual fuck","post_message":"Punching White Woman After Yelling Hate White People Not Hate Crime, Judge Rules"},{"comment_id":"1118917194866740","commenter_b":"Thanks for stating this. I'm a follower of Christ and so glad you get it about Tebow.","commenter_a":"I'm not a Tebow fan, or a Florida Gators fan, or religious. But I never understood the hate directed at what seems to me to be a decent human being that threw his actions has shown hes willing to help anyone. Funny my fellow Athiest scream about this man \"shoving his faith in our face!\" Don't seem to mind shoving their Athiest views down everyone else's throat.","post_message":"\"The goal of this book was if you pick it up with your head down, you finish the book with your head held high knowing that God has an awesome plan for your life, you matter, and you're important -- and that's a bigger identity than anything that the world could ever offer.\" — Tim Tebow on his new book \"Shaken\""},{"comment_id":"410085892484700","commenter_b":"Yes, look at Seattle. They're thriving. Lol WTF. Way to make a point against yourself. The two highest min wage cities are Seattle and San Francisco and they're also the top two fastest growing metropolitan areas in the country right now.","commenter_a":"If you think shit is expensive now, just wait when the minimum wage is 10 bucks an hour...Walmart is in favor of this because people will only be able to afford to shop at Walmart instead of the locally owned businesses","post_message":"Walmart's announcement that it will raise its minimum wage to $10 an hour was claimed as a victory by both advocates and opponents of raising the federal minimum wage."},{"comment_id":"962643217106352","commenter_b":"all i can say is zombies! now we have to worry about zombies crossing the border, thanks south America.","commenter_a":"Freaky.","post_message":"A family in Honduras that claimed teen was screaming from inside her coffin have made international headlines with their actions."},{"comment_id":"1098620013533448","commenter_b":"This is AMERICA AND AMERICANS should be able to fly OUR FLAG any time and any place in America we want to and if some foreigners don't like it then they can get the hell out of America now.","commenter_a":"The school should be ashamed. This is America and the flag is the symbol of freedom. Whoever is the leader of this school should be fired and never allowed to work in the school system again","post_message":"EPIC! The School Said The Flags Off Your Truck, His Response Set Em Straight (VIDEO) This is America! Don't like it then leave!"},{"comment_id":"976609702473803","commenter_b":"Most black people i know WANT self segregation. They want a unified black country within the country and that is completely ok. White people make up 70 percent of this country so by proxy their is going to be areas without minorites. That's completely ok too. What we need to admit is that as a main rule forced integration doesn't work. In areas which are more racially undiverse there are fewer racially based crimes. It doesnt mean we all can't be friends it means we aren't all the same culture. And that is fine!","commenter_a":"what's the points of hate we all go to die one day, so enjoy the trip we call LIFE","post_message":"Top 10 Most Segregated Cities in the US"}]
