[{"comment_id":"885152951544454","commenter_b":"I am parra phrasing as I am not really comfortable with the terms \"richer and poorer\" x","commenter_a":"How can she handmake 3000 items a day???","post_message":"Meet the richest seller on Etsy"},{"comment_id":"10153058205158984","commenter_b":"Good job, give the woman a raise.","commenter_a":"Would her employer be happier if she was the one who was shot??? I commend her for having the courage to stand up for herself","post_message":"I don't think this robber thought that holding a woman on the ground at gunpoint would land him a bullet to the face, but this gal delivers more than just pizzas! Do you think this woman should be afraid of getting fired for defending her life?"},{"comment_id":"10153617872056636","commenter_b":"Islam isn't but a lot of it's exponents use it as an excuse to kill.","commenter_a":"No religion is peaceful, it divides opinions which leads to violence.","post_message":"Show this next time someone claims Islam is violent"},{"comment_id":"601754246672035","commenter_b":"Yes I do the whites made her now she it very racist big time","commenter_a":"shut your mouth!","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"},{"comment_id":"1790748334489343","commenter_b":"So go.","commenter_a":"Goodbye to all the rif-raf. America will be great again!","post_message":"SHARE THIS IF YOU WILL BE HAPPY TO SEE THEM GO!"},{"comment_id":"1231324976946036","commenter_b":"If people believe there are only peace loving Mexican people crossing the southern borders then they think there are no muslim terrorists entering with them....all with fake I.d. All borders need to be shut down ...and shut tight . Let the round up and deportation begin . If they kill...they should pay the death price .","commenter_a":"Build the fence...run electricity through it and man with machine guns . Don't bother even trying to clear these people. They do not want to assimulate into any culture. There is a tent city sitting empty for them to go to...but they can't raise shit there so they are not happy there because there are no luxurious places to visit nor anyone to demand that all their wants and desires are going to be catered to. Deport the ones that are there after your fence is finished.","post_message":"Norway has been one of the European nations hit hardest by the refugee crisis. Instead of lying down about it, they've introduced an EPIC plan to stop the refugee influx... and it will make Donald J. Trump a very proud man."},{"comment_id":"1736136556654311","commenter_b":"Secure our borders. ..Start deporting. AMERICA FIRST. ..GO TRUMP.","commenter_a":"This wasn't a racist comment trump was saying the judge could very well be prejudiced against trump because he wants to build a wall to keel illegals out and drugs and people who wants to do harm to our Country and judges parents are Mexican","post_message":"\"Claiming a person can't do their job because of their race is sort of like the textbook definition of a racist comment,\" Paul Ryan said of Donald J. Trump's recent comments about a judge. @webpagelink"}]
