[{"comment_id":"1080347691985409","commenter_b":"Exactly","commenter_a":"Frankly, no matter whether the women went back to him--maybe they were screwed up emotionally at that time too--he assaulted them. It's the 21st century. Stop trying to drag women through the mud for reporting it. Choking is assault, n'est pas?!","post_message":"\"Nobody close to Jian even pretends he is innocent, and somehow this isn't an issue the women are.\""},{"comment_id":"934633189910873","commenter_b":"Ah, Danielle, so you had the choice because of feminists who paved the way for you to do so.","commenter_a":"It user to be Matt but anymore it's just crazy man hating women destroying family dynamics in this country. I believe in equality, rights and fair treatment of all. Men, women, and all races, but I'm not a feminist. I support my family the best way I can now which is to stay home and take care of them. My children are smarter and safer with me here, plus they have a structured living environment. I plan on getting a p/t job when they both start full time school but as for now this is where I'm needed. And I love every minute of it even the hard days.","post_message":"Ellen Page has a point here, ya know... Thanks for the photo, MTV Act!"},{"comment_id":"10155424694168812","commenter_b":"@username Mexico is important! Why do you have to be so damn nasty??","commenter_a":"I can not way for Mexico start not combating drug dealers and not helping stop immigrants from other countries to reach US, then you will see how important Mexico is as a neighbor.","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"},{"comment_id":"1104255989636871","commenter_b":"#westoppedtrump #fucktrump","commenter_a":"You saved countless lives last night on the streets of Chicago, they stopped the gang banging for a few hours to come together in your honor...you've already made America great again.","post_message":"Good morning! Departing for Dayton, Ohio now! WE ARE GOING TO MAKE AMERICA GREAT AGAIN!"},{"comment_id":"566112886870821","commenter_b":"another one to kiss that ring and feet","commenter_a":"if donald trump is a racist why to people of many different races show up to his rallies? why aren't they kicked out? He hasn't singled out any one particular ethnic group that he has singled out by saying he hates them.","post_message":"Welp, Donald Trump sure has that racist vote down pat. -Conover"},{"comment_id":"10153581173261337","commenter_b":"Get fucking jobs you fucking losers ass faggots !!!!!","commenter_a":"I'm pretty sure these people have more money than God! Please don't help them in there time of wrong doings!!","post_message":"DUGGAR DISASTER: After TLC cancelled 19 Kids and Counting, the Duggar family is asking for donations..."},{"comment_id":"10154569592984497","commenter_b":"@username GO FUCK YOUR MOTHER","commenter_a":"Mom really in love with new fat penis-shaped exotic veggie.","post_message":"\"Carol from book club told me about it and sent me a recipe to cook it in a skillet.\""}]
