[{"comment_id":"10156340474870354","commenter_b":"The Failed LIE of Multiculturalism is KILLING America. Low IQ Aborigines cannot uphold the Personal Responsibility DEMANDED. See Baltimore, DC, St Louis and Ghetto after Ghetto!","commenter_a":"Yes, yes!","post_message":"“I believe our country’s biggest threats come from within, from failing to address our incredible fiscal irresponsibility, by allowing our populous to become enemies with each other, stirring up hatred and strife within our country, by allowing education to take a second seat, by giving a lot of lip service but not actually taking care of it.\""},{"comment_id":"10155551213935354","commenter_b":"If they kill all the whites who is going to work and pay thier welfare, food stamps, medical bills, and supply thier free housing? If they have to pay bills there won't be any money left over for drugs!","commenter_a":"black nation? you mean like haiti,or africa...or anyplace where they arn't feeding off white people..these freaks should have been extinct a hundred years ago,most are tired of feeding and housing them..","post_message":"SHOCKING...."},{"comment_id":"1246473882081393","commenter_b":"TURN THEM LOOSE AN PAY THEM TO KILL AMERICANS !!!!","commenter_a":"Go figure that thank you Mr. Obama and miss Killory you guys are doing America so good","post_message":"REVEALED! Minnesota Mall Attacker ID'd As One Of Hillary's Somali Muslim Refugees!"},{"comment_id":"455432694647311","commenter_b":"Will not eat there. She would turn my stomach and I couldn't eat---ugh","commenter_a":"Well that does it McDonald's out","post_message":"Would You Refuse To Eat An 'Obama' Burger? Comment 'yes' or 'no'."},{"comment_id":"1578057615587695","commenter_b":"10 Days and she will be our president","commenter_a":"@username am I right Cody Martinez","post_message":""},{"comment_id":"1317571668339082","commenter_b":"Same base of people that have supported him all along - not enough!","commenter_a":"Uhm, Trump is not losing support. Did you not see the amount of people that showed up to his rally today?? You've got to be joking!! He spoke to at least 25K people. And there were still people outside whom the fire Marshall would not allow in!!","post_message":"The National Rifle Association has spent more than $21 million on the presidential race, praising Donald J. Trump and knocking Hillary Clinton."},{"comment_id":"985973531519425","commenter_b":"All republicans should stand behind \"the people's \" choice!!!","commenter_a":"Who needs him I hope he gets fired","post_message":"What do you think? Is it too late? @webpagelink"}]
