[{"comment_id":"1745647555687410","commenter_b":"Julianne 😂😂","commenter_a":"Lol Luke Hargis you guys need to figure this out before moving out!","post_message":"\"I pay puppy support...\""},{"comment_id":"1049397791786635","commenter_b":"Oh yes let's hope it's true!!","commenter_a":"Danni Fiebig @username","post_message":"The Bachelor Australia may have just given it away (via Daily Mail Australia)"},{"comment_id":"10153836514883797","commenter_b":"Why don't young ladies have enough sense to do background checks on these idiots before they shack up with them, have kids with them...","commenter_a":"Omg that's so sad","post_message":"HEARTBREAKING: Cecelia has just moved with her two children from the Detroit area for a better life. But Friday night, her ex-boyfriend used a dog leash to strangle her and her two boys. The last thing she ever said to her mother before her death will break your heart:"},{"comment_id":"10153512778925667","commenter_b":"Life is like a camera. Just focus on what's important, capture the good times, develop from the negatives, and if things don't turn out take another shot.","commenter_a":"They should put him in the same cell as Clinton.","post_message":"Martin Shkreli could face additional criminal charges."},{"comment_id":"10155319348083132","commenter_b":"Jesus this is absolutely heart wrenching","commenter_a":"Rest in peace","post_message":"The 21-year-old mom is being hailed a hero for her quick-thinking in saving her newborn."},{"comment_id":"10153077946636037","commenter_b":"How about you stop being a stripper?","commenter_a":"Good for them. That's their job and everyone deserves fare treatment. Whether their dancing on a poll or serving meals at a local diner. This is America.","post_message":"Tired of watching well-meaning strangers impose their own visions for improving the plight of the exotic dancer, some of Portland's seasoned #strippers are working directly with state lawmakers and professional lobbyists."},{"comment_id":"10154405981987300","commenter_b":"But they're still ten times better than ungrateful immigrants from African hell holes!","commenter_a":"They have everything covered. Police union, the system, their own partners that lie to protect themselves, the idiot that post all over the internet \"back the blue\", they get a free meal because if they don't, they'll make a tantrum and call the police and the news, etc, etc, etc. A simple war veteran (which, to me, has more respect that this parasites of society), don't get much back up when they get in trouble. Of course I'm talking about the bad cops. Because their is bad cops, right?","post_message":"“It’s too emotional to see your baby caught up in something like this.”"}]
