[{"comment_id":"10155741021510354","commenter_b":"Dear Allison, you are one poor sucker. There never was a thing called white privilege. You thought emancipated blacks were slaves but in truth , the only thing equality means is that no one gets a free ride . Not blacks or whites...you have the freedom to work your little butt off to get what you earn. If that is white privilege, you have been duped into wanted to toil and toil to get what you want in life...same as the next guy.","commenter_a":"you are a fucktard","post_message":"Why MSNBC called in an erotic novelist to discuss this topic is beyond us... but somehow the crazy here might even surpass Rachel's."},{"comment_id":"10154677372708145","commenter_b":"Everyone who voted for trump should come together and pay for that wall if y'all want it so bad . So y'all can't stop crying ...Trump gonna pay to build it with yall money next president gonna knock it down. Have a good day","commenter_a":"Our POTUS... Treating this like he's on an episode of celebrity apprentice and needs ratings. We are screwed beyond belief...","post_message":"BREAKING: The decision comes after Donald J. Trump tweeted the meeting should be canceled if Mexico won't pay for a border wall."},{"comment_id":"10153976625678162","commenter_b":"Zionists let jews die that didn't obey the transfer agreement","commenter_a":"Just shows how much the Zionists have in common with the Nazis. They killed defenceless people and celebrated the murderers. The fact 35,000 Israelis have signed a petition to get the IDF member a medal is astonishing. @webpagelink","post_message":"As a video recording of an Israeli soldier killing a wounded Palestinian in Hebron on Thursday emerged hours after the shooting Israeli government officials and civil society representatives were split in their responses. Some quickly moved to condemn the shooting, while an outspoken group of Israeli leaders applauded the soldier and circulated a counter-theory of self-defense and heroism."},{"comment_id":"487411828113777","commenter_b":"No kill these mofos","commenter_a":"These people are evil beast.","post_message":"This is INSANE...Deport Them ALL!"},{"comment_id":"10153386310193869","commenter_b":"Not from NYC... but upstate. Older and forgot spelling.","commenter_a":"Concerto for Horne and Hardart (spelling?)","post_message":"Alex Ross listens to both satirical and serious compositions by Peter Schickele, the man behind the comic persona of P.D.Q. Bach."},{"comment_id":"1814664762098886","commenter_b":"But you sure don't mind taking white people's money do you Colin?","commenter_a":"Then have him sit on the locker room bench and not the field","post_message":"NFL player Colin Kaepernick isn't apologizing for his controversial decision to not stand during the national anthem."},{"comment_id":"10153712087136336","commenter_b":"That teacher should be ashamed of herself she is just a bully!!!","commenter_a":"So very, very sad. The teacher should be fired.","post_message":"Lloyd's mother, Nyesha Terry, found him seated at a desk away from other students wearing a trash bag a teacher had turned into a poncho."}]
