[{"comment_id":"10154807538199705","commenter_b":"This chick probably enjoys white wine and Xanax every night.","commenter_a":"I cant beleive how you support the use of illegal drugs, they destroy everything, stop pretending it is fun or in to use them","post_message":"Andrew Garfield is living his best life."},{"comment_id":"10154318254146509","commenter_b":"Why don't you look back in G W Bush and Klinton to what they did? The difference between Russia and the USA is that the USA never asked for permission to invade any country. They just did what they wanted, and they destroyed the whole country with it's sovereignty. Another difference is - when you sea how these leaders greet \"dictators\" as they call them, with extremely wide hypocritical smile, and after a while the destroy them. Russian leader doesn't smile that much, but you get the feeling that he doesn't substitute his values and he is a person that can be trusted.","commenter_a":"Closed CAPTIONS, please!","post_message":"Five of CNN's correspondents look back at the role of Russia and President Vladimir Putin this year, and what impact there may be in the future. @webpagelink"},{"comment_id":"1288081714641540","commenter_b":"This is scary","commenter_a":"What kind of sick prople dream up this stuff are people so afraid to die that they will go to these means to create life just to torcher and kill it. Sick sick sick!!!!!!!!","post_message":""},{"comment_id":"691363511054227","commenter_b":"Get a life and leave her alone!!","commenter_a":"She must be an AWESOME girl as she brings out the second, third, etc. class haters !!!??? Tom","post_message":"Ivanka Trump is taking fire from all directions after this wardrobe mishap. She doesn't deserve this. Let's show her our support. Can we get 10,000 'LIKES' for Ivanka Trump?"},{"comment_id":"1000663273302101","commenter_b":"Fuck you pig boot licker.","commenter_a":"HAHAHAHAHA. Just because they be black,,,,,,,,you think yo sorry black asses BE safe with Islamists \"protecting\" yo ASSES? HAHAHAHAHA","post_message":"The police thought they were the only alternative for security. They just found out that there are many groups willing to do their jobs for them, for cheaper and with more accountability if they mess up! Do you support this move? Or will their be utter chaos without the police there? Follow >> (Y) Counter Current News for the latest!"},{"comment_id":"10152998520246037","commenter_b":"Rules are rules. But the airline's inconsistency in enforcing those rules is the real issue. It was ok to hold the child on the way down, it should have been the same on the way back. BUT I find the attention mongering of this mom downright pathetic. Totally disgusted. Not everyone is a world traveler, and I also get confused by the ever changing rules of the sky. Seems to me the mom holding her daughter was pretty clear that now she knows the airline's policy she will have a safety seat with her in the future. No further big deal made of it, issue was put to rest. Until this attention whore feels compelled to one-up her and try to publicly shame her. Disgracefull, classless and pathetic. If the woman went on and on and on about how she should be allowed to hold her child anyway, Yada yasa ...","commenter_a":"I agree with most of you, if she has a child with special needs then they shouldn't have been seperated in the first place. Secondly if the flight attendant had let that happen and something happened, then who would've been at fault then??","post_message":"\"The attention mongering schemes of Elit Kirschenbaum, who took to Twitter last week lambasting a United Airways flight attendant for refusing to allow her to hold her disabled three year old daughter on her lap during take off, make me want to puke.\""},{"comment_id":"10154783600566336","commenter_b":"Did the first plagiarize too?","commenter_a":"Trump talked about immigrants, but first he should deport his own wife who is not even american and come here illegally","post_message":"History Quiz: Can you guess the first?"}]
