[{"comment_id":"962417470484668","commenter_b":"Do with all the locks broken does that mean all these people will soon divorce ?","commenter_a":"Melissa Sheree Lisa Danielle","post_message":"Love 0 Heath and safety 1"},{"comment_id":"10153940739241178","commenter_b":"What a bum bitck","commenter_a":"IDIOT!","post_message":"MSNBC host goes on CRAZY rant about Star Wars being racist."},{"comment_id":"10152634515646813","commenter_b":"Mind your own damn uterus, mkay?","commenter_a":"ACLU's \"rape culture\" worship, Rape of the child in the womb with instrumentation. rape to death..","post_message":"VICTORY! Federal judge strikes down law that could have closed #Wisconsin abortion clinics, calling the law “a solution in search of a problem (unless that problem is access to abortion itself).\" @webpagelink"},{"comment_id":"10154504498488655","commenter_b":"@username You can tell 84Lumber just how much we don't need illegal immigration: www.84Lumber. com","commenter_a":"Hmmm if they wanted to show people on the path to becoming legal Americans, why didn't they show them going to the embassy and applying for a visa? Some dramatic music while they fill out paperwork","post_message":"Who didn't see right through that?"},{"comment_id":"1068924329809654","commenter_b":"I would hope so Peter! Because she is a women","commenter_a":"I've always considered myself conservative, I box, hunt, camp, work hard, and don't support socialism, but I believe Bernie is the best canidate.. I know for a fact I'm more manly than the person who typed this weak paper","post_message":"An open letter from a real woman to \"male adults\": \"We can and we should cherish men who exhibit traditionally masculine characteristics. They have made the world what it is today. I raise my glass to you gents. I've even made you a sandwich. But on the flip side of these strapping, rugged men there's you. A Bernie Sanders sycophant with not quite enough self-worth to fill an egg cup. Or a teaspoon. Certainly not enough to fill your bong. Take a good long puff before you read the rest of this, it's not going to get any better. I'm not going to make you a sandwich either. May I recommend a Hot Pocket? What is a man? A man, as defined by this woman, exemplifies the evolutionary behavior of a provider. This can take one of two forms (maybe both) of hunting and/or gathering. The more successful the man ..."},{"comment_id":"1786411671679890","commenter_b":"Fucker","commenter_a":"@username sheep bitch","post_message":"100% accurate!"},{"comment_id":"10154246472810695","commenter_b":"I thought poppies grew from the earth","commenter_a":"Plz worry about the heroine statistics that are rising and rising. And stop giving people life in prison for a plant that grows in gods green earth.","post_message":"This family-friendly Easter event took a pretty surprising turn."}]
