[{"comment_id":"1718830391702540","commenter_b":"Obama does not want to destroy it because he is part of it.","commenter_a":"Bill O'Reilly.the American. People should pay more attention what's going on around them. Train are self too be more open minded. These terrorists attracts are not going away. It's. Up too the America people too prevent these attracts. How. , communication system set up by naborhoods, friends. Basically by listing. You feel some one a subspect , call (911). Alearkness is the best defences. Maybe. So.","post_message":"Bill O'Reilly said America is under attack, and \"just because they don't use tanks and planes doesn't mean it isn't war. It is.\""},{"comment_id":"1145897778760904","commenter_b":"I have the same solution no matter the skin color......shot them, protect the population from killers.","commenter_a":"Throw him in a cell with a bunch of big angry sex offenders.","post_message":""},{"comment_id":"965089543550794","commenter_b":"Sounds like pure jealousy. Cal looks better than some women","commenter_a":"but why do they all have the need to look like hookers?","post_message":"She only realised she was transgender when she dressed up in hot pants and a wig for a joke"},{"comment_id":"1263330063738211","commenter_b":"WE ARE STRONGER TO-GET-HER AWAY FROM POTUS! #NeverHillary #DrainTheSwamp","commenter_a":"Seeing you, Obama, your husband and the rest of the democrat crooks, liars and thieves in prison for life or the hanging post!!!!!","post_message":""},{"comment_id":"1052995884768693","commenter_b":"Miley Cyrus? The skank can't even keep her tongue in her mouth!","commenter_a":"Good who needs them!","post_message":"“I will give you a one-way ticket to the country of your choice, with the stipulation that you promise never to come back.” WATCH: Sean Hannity made an offer to the celebrities who are vowing to leave the country if Donald J. Trump becomes president."},{"comment_id":"1073897729311987","commenter_b":"@username LOCK HER UP!","commenter_a":"@username. First American woman likley to pardon her self for her many crimes if ever elected.","post_message":"The women of Team USA broke through glass ceilings, wrote history, and showed the world what it means to represent the red, white, and blue. Read some of their stories: hrc.io/2bQa5y3"},{"comment_id":"10153525456151438","commenter_b":"I've saved this to read for later because I'm in denial. I will always remember Richard Dawkins the way he was in his Growing Up in the Universe christmas lectures.","commenter_a":"He might be a brilliant scientist and author, but he's also a bigoted asshole too filled with his own sense of superiority to recognize that he can be as much of an intolerant hypocrite as the religious extremists he (rightfully) criticizes.","post_message":"He’s charming in his books, but he picks fights on the Internet."}]
