[{"comment_id":"1313680338710499","commenter_b":"Dam so the bitch anit leaving","commenter_a":"I thought she said she was leaving the United States and my subconscious was hoping it was for good Her support threw the election for Obama she's lost all credibility with me","post_message":"Oprah Winfrey just STUNNED her fans with this massive announcement about Donald Trump's victory. Nobody saw this coming..."},{"comment_id":"10153106152611336","commenter_b":"Imagine, Christian leaders to lead a Christian group? Lol!","commenter_a":"Maybe Cal state I should be recognized","post_message":"A Christian organization at California State University, Stanislaus has been de-recognized because the group wanted its leaders to be Christian."},{"comment_id":"10155894445780093","commenter_b":"Certainly grown women can make decisions. . And as soon as you grow up, become mature, recognize there is a world beyond our own noses and that maybe a person could be right, or, disturbing for some, a person could be wrong... then they can make decisions. But the arrogant ought to be circumspect.","commenter_a":"One simple question: for the Christians who believe that life begins at conception; if God wants every potential human \"life\" to be born so much so that you have to create laws that every American woman whether they believe the bronze age fairy story or not, why when god destroyed all life during the Noah flood did he kill pregnant women? Or innocent new borns? Weren't their lives so precious too? Square that circle.","post_message":"The deliberate killing of an innocent human being, with the killing performed in such a way as to preserve a of the most valuable parts. That sounds totally ethical, right?"},{"comment_id":"1005120462832757","commenter_b":"and for that she deserves what amounts to life in prison?","commenter_a":"Ummm she took abortion pills and left her baby in a dumpster, then took herself to the hospital.","post_message":"\"What this prosecution makes clear is... abortion being recriminalized in America\""},{"comment_id":"1779395119015202","commenter_b":"So women have been successfully doing this for how long? Most cases of extreme pain can be resolved medically and if not that's why we accrue roughly 8 hours of sick time per month at standard full time jobs One cannot expect businesses to experience this loss of productivity and still want to retain female workers","commenter_a":"Emily Lynn Bowman","post_message":"(Note: Look at the women in the back left of this photo.)"},{"comment_id":"10153009927864586","commenter_b":"Let someone stand on that bitch's head!","commenter_a":"I still cant get over the idea that an organization that euthanized dogs and cats and put them in dumpsters is denouncing anything to do with being cruel to animals. Google the pics... PETA EUTHANIZED ANIMALS","post_message":"ICYMI: Sarah Palin posted a picture of her son STANDING on the family dog & thinks it's totally okay: @webpagelink The most important thing we can teach our children IS COMPASSION. SHARE if you agree!"},{"comment_id":"1446844205342023","commenter_b":"She needs to STFU!!!","commenter_a":"Why publicly, tho? 😡","post_message":"This woman has some nerve...."}]
