[{"comment_id":"10153068492709411","commenter_b":"Thank heavens...............one revolting misogynist pig gone, but alas another is replacing it.","commenter_a":"RIP","post_message":"BREAKING:"},{"comment_id":"10154184073372093","commenter_b":"Are you kidding ? Mom said NO. Who knows what that WOMAN has exposed that baby too.","commenter_a":"Oh.. now shes just doing the most wonderful beautful natural thing that God as given women the best thing for a child...what's wrong with that ..bad mom for sayng no to someone wanting to be so generous and giving......","post_message":"The mom says the daycare worker asked if she could breastfeed her son. Disgusted, the mom said no. But as soon as she left the room, video shows the worker did it anyway... bit.ly/2kEuI1v"},{"comment_id":"10154800678109203","commenter_b":"Stop the Racist Hate!","commenter_a":"Latinos are stupid especially the ones that are voting for the first time and have lived in politically corrupt countries. A vote for corrupt Hillary is throwing away the sacrifice they made to move here.Voting for a party that rigged a primary is a vote for corruption.","post_message":"\"We are the wall that can stop Trump.\" Latino Victory Project spokesman"},{"comment_id":"10153004529954071","commenter_b":"Bill is a smart man!","commenter_a":"And what did Hillary say? Unless Trump is doing all this show to destroy the Republicans and elect Hillary as POTUS but then again there is Bernie.","post_message":"Former President Bill Clinton called Donald J. Trump in May and \"encouraged Trump's efforts.\""},{"comment_id":"10154105541082093","commenter_b":"Yea man! Go Donald. Get rid of the illegals. I can't wait","commenter_a":"Jeff Sessions = KKK! Another good ole boy for Donald trump...","post_message":"They held up hand signs saying, \"Go Jeffie Boy!\" and \"KKK\" ... The Alabama Republican was rejected for a federal judgeship 30 years ago amid accusations of racial insensitivity... @webpagelink"},{"comment_id":"10153562770079228","commenter_b":"Lol right^^^?","commenter_a":"Should be fired","post_message":"She complained about protesters blocking rush hour traffic on I-70"},{"comment_id":"404568359667759","commenter_b":"They all need to go somewhere else!","commenter_a":"what is wrong with the United States flag this is United States we have the right to fly our flag just like any other country","post_message":"Why do some people want to ban our flag?"}]
