[{"comment_id":"954073617997796","commenter_b":"Hate speech. What a classy woman....","commenter_a":"She makes Sarah Palin look smart","post_message":"Absolutely abhorrent."},{"comment_id":"1681683485379770","commenter_b":"That should be a crime leave OUR money alone I'm sad to see this .don't we have rights what was this country built on!!!","commenter_a":"Why !!!!!! Muslims ????? Why !!!!! They need to remove there burkka and all the drag queen garb all the poof ta\"s wear !!!!!!!!","post_message":"\"In God We Trust\" To Be Removed From The Dollar Bill Leave the dollar alone. Are country was built on Christian beliefs. Do you think they should leave 'In God We Trust\" on the dollar bill?"},{"comment_id":"422053507998163","commenter_b":"After entering into discussions with egocentrics on Abortion, I have concluded the following: 1) Egocentrics callous their minds by clinging to the term fetus. 2) Egocentrics ignore the dictionary primary definition of child, \"1a :an unborn or recently born person\". 3) Egocentrics refuse to acknowledge a child exists until it breaths air. 4) Egocentrics ignore that sexual consent includes consent for sperm and egg to join thereby forming a new human being in the uterus. 5) Egocentrics dehumanize the new human being (child) by hammering the label \"fetus\", completely ignoring the relativity of \" the fetal stage\" development of a child. President Barack Obama told a group that harvesting organs from humans that are killed was and a tradition that needed to stop. He warned of dehumanizing marginal groups of humans and of the problems that arise when are not able to see someone else as a human being.\" Based ...","commenter_a":"No I don't think so","post_message":"Planned Parenthood and the 3% Abortion Myth"},{"comment_id":"10155425307145615","commenter_b":"\"But no use trying to educate them...\" I feel the same way, because after all: 1) This law is not discriminatory. Anti-discrimination law always trumps Religious freedom law, especially when discrimination is not explicitly addressed, as if the case for RFRA laws. If this was an attempted to legalize discrimination, the analogy would be like a man throwing a feather at a door to force it open. It is a sad attempt. 2) This is not religion being forced down your throat. It is religious liberty. Perhaps, it bothers you that a man would be allowed to wear long hair in an office that requires a clean cut, or that the Amish would not be forced to \"drive\" a minimum speed limit, but it hardly qualifies as religion being forced down one's throat, in my opinion. 3) This is merely a copy of the federal law with some of the ...","commenter_a":"I'm tired of Pence and all his follower's trying to \"defend\" him. They're all discriminating bigots!! Plain and simple!","post_message":"Wow!"},{"comment_id":"10156862030995389","commenter_b":"Governor Mike Huckabee said it best....If Ted Cruz isn't guilty of affairs with the five women, then he should bring charges against the National Enquiry. Otherwise, there may be something to it!","commenter_a":"Barf!!","post_message":"Get free tickets for Sean’s EXCLUSIVE event with Donald J. Trump in Milwaukee, Wisconsin MONDAY, April 4th at 5p ET. @webpagelink"},{"comment_id":"598047807050178","commenter_b":"@webpagelink/ maybe you should wake up","commenter_a":"This action taken against this marine n my opinion is shameful n should b a wake up call 2 the AMERICAN people !!!! WAKE UP AMERICA !!!","post_message":"Marine Arrested For Saying THIS About Obama [VIDEO]"},{"comment_id":"948666735231933","commenter_b":"Wow, no misogyny going on here (heavy sarcasm).","commenter_a":"More from man hating feminist jackasses. Keep your legs shut, or demand the guy who stick his dick in you wears a condom. Not that complicated.","post_message":"Patients would also be required to get counseling on celibacy as a valid life choice."}]
