[{"comment_id":"901967236585038","commenter_b":"she has blood on her hands !!! Bengazi !!","commenter_a":"AWESOME","post_message":"In the just out Fox News Poll, I easily beat Hillary Clinton - and I havn't even focused on her yet. On our way: MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10152899242557144","commenter_b":"Illegals Charlotte, illegals.","commenter_a":"\"We\" need to take care of our country first. We still have veterans dyeing before they get an appointment. Don't tell me about Mexicans.","post_message":"Wow."},{"comment_id":"10153434124594032","commenter_b":"@username illegals aren't just Mexican stop being ignorant.","commenter_a":"I'm on the fence about this, the immigrants being lazy living off the state should be taken back. BUT the hard workers doing what they can taking care of their families should not be bothered!!!","post_message":"#BREAKING: The deportation operation by U.S. Immigration and Customs Enforcement would begin as soon as next month, the report said. UPDATE: DHS plan to raid Central American immigrants draws criticism. Details: @webpagelink"},{"comment_id":"10153157843033984","commenter_b":"I am thrilled! I pray someone stops the madness. We must enforce our immigration laws abs seal our borders.","commenter_a":"A judge with Balls","post_message":"Obama received a major smackdown last week! Amnesty plans halted!! Are you as happy about this ruling as we are?"},{"comment_id":"10153212700939270","commenter_b":"Well I know it was out of service around that time but I'm sure that's what they did but it was a great ship","commenter_a":"Aw darn now no one is safe aboard that ship when that time of the month comes","post_message":""},{"comment_id":"1184007451677789","commenter_b":"She's a stupid bitch lieing douche","commenter_a":"Another liar that is living off of taxpayers, was educated off of the taxpayers dime by lying.","post_message":"Sen. Elizabeth \"Fauxcahontas\" Warren just decided to make a video bashing Donald J. Trump. That wasn't a surprise... however, the humiliating error in the video WAS. This shows just how bumbling the Democrats are... what a failure."},{"comment_id":"10154056074359749","commenter_b":"Your a hoe lets be honest","commenter_a":"Hope u keep some pics for your kids to see when they grow","post_message":"\"I am a mother. I am a wife, a sister, a daughter, an entrepreneur and I am allowed to be sexy.\""}]
