[{"comment_id":"10153570546732464","commenter_b":"I am sure that this wont just amount to more talk from you and that you will actually do something. Yeah right.","commenter_a":"GO TED, GO\"!!!!!","post_message":"Our first priority should be stopping a bad #IranDeal that jeopardizes the lives of Americans: www.stoptheirandeal.com"},{"comment_id":"10153698942976350","commenter_b":"Not everyone has reconstruction surgery. It is hard to find a bra that holds the prosthetic breast without it going sideways so you end up looking off. I opt for a sports bra most days as I have one breast.","commenter_a":"I love Stella!","post_message":"\"We wanted to bring something feminine and beautiful into a bra that is taboo.\""},{"comment_id":"10153206684663855","commenter_b":"F LA! No bears or real men only these fake ass roided out bitches","commenter_a":"Where did they get the inspiration for those haircuts ... :-)","post_message":"Love these pics!"},{"comment_id":"10153811060584614","commenter_b":"Take the guns....and the illegal criminals will be the only ones with them...","commenter_a":"90% of the immigrants are Muslims male between 18 - 30..and are military savvy....the are probably guilty...a planned take over.....Germany is next...","post_message":"Update: At least 150 people were killed in Friday's Paris and Saint-Denis shootings and bombings, French officials say."},{"comment_id":"10154990936431600","commenter_b":"#KeepWadeBitches","commenter_a":"bad choice in a head coach, Elway must be smoking weed","post_message":"What do you think Denver Broncos fans?"},{"comment_id":"10152995708842217","commenter_b":"Really perhaps one glass too many some would say Suspicious.....","commenter_a":"Aww 😢💔 poor Cilla..","post_message":"She was sunbathing at her Spanish home when she she stood up, lost her balance and fell"},{"comment_id":"10153346413122300","commenter_b":"Victories or defeats in this life are truly not relevant to Christians. Though they should always fight the good fight. As long as I (they) stay true to Gods word. Then I (they) will have the greatest victory. Eternity with God.","commenter_a":"Amen to Marco Rubio, could not have said better. I don't agree with same sex \"marriage\". That's all.","post_message":"“If you think about it, we are at the water’s edge of the argument that mainstream Christian teaching is hate speech,” Rubio told CBN News chief political correspondent David Brody. “Because today we’ve reached the point in our society where if you do not support same-sex marriage you are labeled a homophobe and a hater.”"}]
