[{"comment_id":"10153780658736350","commenter_b":"@username I have no clue what you are talking about but let me clue you and those like you in on something .... we wonder why kids are shooting up schools and bully each other to death when all they have to do is look at ignorance like you for an example. Sit behind a computer screen and throw insults around like you are all important. You get on a thread and bash a new born baby and his parents that take care of them selves and don't do anything what so ever to you and the likes of you. Instead of passing over a story you don't want to be a part of you get on threads and be an ugly soul and bully people that are happy for this couple or any couple that lovingly gives birth to a much loved and wanted baby. Since you brought up ...","commenter_a":"People have babies everyday! Women birth children under horrible circumstances... Alone .. In poverty ... How about focusing on that instead of these irrelevant people!!","post_message":"Congratulations, Jessa Seewald and Ben Seewald!"},{"comment_id":"10154462492528487","commenter_b":"Depends on your view. How much of the worlds' healthcare systems have you been a part of, witnessed or experienced. We are not perfect but we are so far from \"sucks\"","commenter_a":"The crap we have now sucks","post_message":"What would TrumpCare mean for Americans? Essentially, a public health disaster."},{"comment_id":"10152703267277217","commenter_b":"64% of voters didn't vote for the Conservatives in 2010, so not that popular.","commenter_a":"Best PM ever. Don't even know why the others have bothered...","post_message":"What do you make of David Cameron's cufflinks? Follow our UK election coverage: @webpagelink #GE2015"},{"comment_id":"865762326792523","commenter_b":"She needs to go home and git her dildo and go for a ride","commenter_a":"I'm sure Netanyahu is ignoring them...","post_message":"Why does the Democratic Party hate #Israel so much?"},{"comment_id":"10156397443350725","commenter_b":"Proud of my home state for going for Trump!!","commenter_a":"Trump is a chump. As soon as he gets out of the way we can get about having a serious candidate.","post_message":"Thank you SC! We will NOT let political correctness get in the way of keeping America SAFE! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"10153794023656051","commenter_b":"If she had broken into my house, I would have gotten in bed with her and just laid there waiting for her to wake up.","commenter_a":"I'd shag her then call po po","post_message":"This wife came home early and found this woman in her bed. She immediately assumed her husband was having an affair. It was only after she ordered him to come home and confronted him about it that she finally discovered the truth."},{"comment_id":"1183411145055216","commenter_b":"Wake up Hillary will destroy trump","commenter_a":"Trump is walking all over Hillary. Polls showing her ahead i do not believe.","post_message":"Dorothy Woods, whose husband Ty Woods was one of the four Americans killed in the 2012 Benghazi terror attack, says that Hillary Clinton's track record proves that the Democratic nominee believes rules don't apply to her. @webpagelink"}]
