[{"comment_id":"632124420311470","commenter_b":"Of all the garbage o n tv every night and they r bitching about this, cmon really! This right here is the reason we need to get rid of the shit in govt","commenter_a":"That's funny, Liberals complaining about a woman uncrossing her legs When has this been an issue for them? This is why liberalism equals hypocrite.","post_message":"Liberals want FOX News taken down after yet another wardrobe malfunction. This is ridiculous. FOX News hosts are classy, we support them! Do you support ALL FOX News hosts?"},{"comment_id":"863141660412250","commenter_b":"I can't belive some young women want to pay tons of money for this,keep poppin those Skittles and you'll look like that in no time!","commenter_a":"Sorry but it's hard for me to feel sorry for these customers. One ounce of common sense would tell you....Do not let this person inject me with anything!!","post_message":"Toxic butt ‘doctor’ stuns court with her backside."},{"comment_id":"437108856413709","commenter_b":"He will CERTAINLY BE BETTER THAN THE MORON IN THE WHITE HOUSE NOW!","commenter_a":"Agree","post_message":"\"I will be the greatest jobs president that God ever created\". Agree or disagree?"},{"comment_id":"10153216503482507","commenter_b":"I guess the gloves are coming off, the fourth reich is just about ready to emerge. When is that wall to Mexico scheduled?","commenter_a":"Evil","post_message":"Wow. Just wow."},{"comment_id":"10153717655651323","commenter_b":"I'm sure mosques will be very useful for Syrian refugees in Germany. Are you for real?","commenter_a":"Focussing on mobile phones while poor syrians are getting genocided by poseidon in the mediterranean? Fucking white neonazi shitlords.","post_message":"You will soon be able to ignore your friends and family in Europe as well as at home for no extra cost."},{"comment_id":"465989180258329","commenter_b":"HELL NO FUCK THAT BITCH","commenter_a":"I wouldn't take them if they were free.","post_message":"Will You Refuse To Buy These Stamps?! Comment 'yes' or 'no'."},{"comment_id":"418611591638646","commenter_b":"We need to get rid of the income tax and the IRS and go to a strictly consumption tax. It would force people with hidden income like drug dealers to at least pay taxes on their incomes. It could also rid of us of the earned income tax credit which is nothing more than welfare paid through the income tax system. It is paid to illegal aliens. Welfare payments should be made at the state and local level and not the federal level.","commenter_a":"\"Cooperation between the parties is needed and not multiple threats of vetoes\"... perhaps if the do-nothing GOP actually starts doing something instead of just saying NO all the time then the veto threats would disappear....","post_message":"The President's State of the Union address was uplifting, particularly if one is not aware of the actual facts. The economy is better, but far from good. There is a war on radical Islamic terrorists, although he won't use those terms, and we are far from vanquishing them without an aggressive stance. Tax reform is needed, but not redistribution. Cooperation between the parties is needed and not multiple threats of vetoes. Perhaps someone can play the President's speech back to him and hopefully he will abide by the spirit of his words and not the spirit of his ideology."}]
