[{"comment_id":"510871105704596","commenter_b":"great man spreading peace, love, and equality.","commenter_a":"Evil wolf in sheeps clothing","post_message":"What are your thoughts on Pope Francis?"},{"comment_id":"10157699168860294","commenter_b":"If you think he can do that with all the times she's been investigated over the last several years you're sadly mistaken.","commenter_a":"Trump is not for social society so I can't be for him","post_message":"“If I win, I am going to instruct my attorney general to get a special prosecutor to look into your situation because there has never been so many lies, so much deception.”"},{"comment_id":"1091470624223610","commenter_b":"I beg the differ sir! Here's one for Trump!! I want at first, but as this plays out, he is the only out sider I trust!!","commenter_a":"You are so wrong again. Stop you are losing all credibility. Your own hate for Trump, is going to be the end for you.","post_message":"\"You're damn right.\""},{"comment_id":"10153820494546350","commenter_b":"i see Kate in her lol and Will in George","commenter_a":"Princess Charlotte looks like her daddy, adorable.","post_message":"Princess Charlotte has grown so much in six months! We just can't handle the royal cuteness! on.today.com/1IrSwdd"},{"comment_id":"10154917656616509","commenter_b":"People, here the moronic trump plan : deport Americans from America! Ban Americans immigration from state to state. Unless you're a Caucasian with 'orange paint' on your face, then you must wear a badge to show who you are! That's the moronic trump have plans for America!","commenter_a":"So many people dead and Obama plays politics and slams Trump, Whats Obamas plan to stop this, He dont have one, Trump has one","post_message":"President Barack Obama on use of the term \"radical Islam\": \"What exactly would using this label accomplish?\" @webpagelink"},{"comment_id":"913575248773260","commenter_b":"Hillery is a known lesbian predator get it out and end her run to destroy this nation","commenter_a":"God i feel sorry for her","post_message":"Sex slave survivor Cathy Obrien swears that Hillary Clinton raped her when she was a child in Arkansas @webpagelink"},{"comment_id":"569782366553109","commenter_b":"Christ. Any more soft lobs? Take off the freakin kid gloves already","commenter_a":"falling asleep?","post_message":"Tom Price, Donald Trump's pick for secretary of Health and Human Services, is expected to face tough questions on Obamacare, his financial disclosures, drug prices and more in his appearance before the Senate Committee on Health, Education, Labor and Pensions."}]
