[{"comment_id":"500763203381607","commenter_b":"This crap started with Clinton. Oliver North warned us what was coming.","commenter_a":"He warned Bush,but wasn't taken seriously.","post_message":"Do you agree or disagree with Donald Trump on this?"},{"comment_id":"10154249016409170","commenter_b":"She's a soft spoken HACK!","commenter_a":"Bam, i love the dems motto, vote early and often. How is this right. Another star for NC. Good job","post_message":"Usually Democrats can play the race card with no consequences. Not this time."},{"comment_id":"933409340029740","commenter_b":"Go back to Mexico we don't want you here","commenter_a":"She's just sorry she got caught and is afraid that her American-bashing, honest statement that was caught on-tape will ruin her career...as it should! She's nothing!","post_message":"Pop star Ariana Grande has issued a second apology, this time on video, after being caught on camera saying she had \"hate\" for America. \"I feel like the apology I posted, I kind of missed my opportunity to actually sincerely apologize...\""},{"comment_id":"775973422593235","commenter_b":"Absolutely, she should be in prison anyway not headed to highest position in America","commenter_a":"Elated!","post_message":"BUSTED: Hillary Clinton Was Just Caught Read Handed For Being Linked To... This actually might stop her from running. Would you be happy if she had to back out of the race?"},{"comment_id":"388258684695759","commenter_b":"We all need to ban to gather and kick all Muslims out of this country they have no say so in this country if they want say so they need to go back to their own country this is United States of America not Mohammed country","commenter_a":"You damn right. All states should do this","post_message":"It's time that all the states do the same..."},{"comment_id":"10154208108446717","commenter_b":"I want to punch that bitch in her ugly face","commenter_a":"Disgusting.....","post_message":"His sympathy is with the first responders, and not the victims."},{"comment_id":"1243497535729399","commenter_b":"Who is this angry old lady?","commenter_a":"500,000 Women march on Washington to protest Trump becoming 45th President march today for the moral core of this nation, against which our new president is waging a war, actress America Ferrera told the Washington crowd. ..... for the moral core of this nation - most curious statement ! Both Presidents Jack Kennedy and Bill Clinton were known womanizers - both had long history of doing so Kennedy had his lovers escorted into the White House late at night while Clinton had a young woman intern give him oral sex right in the Oval office ONLY difference was that Kennedy and Clinton were Democrats while Trump is a Republican At the core of the protest is that Trump won the 2016 election in KEY states and the Democrats could not get their vote out in the KEY states Moore, Garry R - Solutions Inc","post_message":"\"Well, good did not win this election. But good will win in the end,\" Madonna delivered a fiery R-rated, anti-Donald J. Trump speech during the #WomensMarch @webpagelink"}]
