[{"comment_id":"10153244318929726","commenter_b":"Why work when you can live off the taxpayer???","commenter_a":"This is so true in IT.","post_message":"Former IT Manager Exposes Ugly truth on so called \"Shortage\" of American Workers"},{"comment_id":"10154134238584411","commenter_b":"Mohammad IIyas, u must be annoyed abt the fact how we kill those Porkistani pigs trying to cross our border every day. Feel pity for u being born in such a disgraceful country where the the administration controlled by radical Jihadis. I believe Pakistan fought four wars with India and all of them was lost by Pakistan with great humility. Thank us, that we left the land we captured during 1965 war, or else your dad would have been fucking your mom on Indian soil, and you would hv been born in India with Indian passport.. and then still if you would have spoken against our country, we would hv sent you to your 72 virgins without appointment.","commenter_a":"India need such subs @username","post_message":"The sub disarmament is estimated to cost some 28 million rubles (about $ 400,000)"},{"comment_id":"861460177233384","commenter_b":"She needs to smoke. Nancy Disgrace","commenter_a":"I refuse to watch her anymore..go away Nancy!!!!","post_message":"Nancy Grace vs. 2 Chainz: Part 2! Right now on HLN. Where do you stand on the debate? #PotToBlame"},{"comment_id":"10153373033325667","commenter_b":"I love boobs, now thats something worth fighting for!!","commenter_a":"With so many violent movies and video games around, no wonder real killings are becoming an 'accepted' part of society. Children can easily watch something in which a person is shot (often without flinching), but God forbid a woman breastfeeds her baby in public...","post_message":"No motive for the shooting was given and police said they were still looking for two gunmen."},{"comment_id":"10154743139306508","commenter_b":"She's a liar ....","commenter_a":"The funny thing is the same scenario happened in Egypt four years ago with the Muslim brotherhood president Morsi, when someone beside him was telling him what to say and was caught the very same way Pelosi is caught now. I think same same school, no difference","post_message":"She didn't know people could hear her"},{"comment_id":"10150574072889999","commenter_b":"Exactly, politicians and police could learn a lot from thisman","commenter_a":"this is how a real man behaves - God Bless you Mr. Taylor","post_message":"Malcolm Taylor, a Baltimore city bus driver, was watching the riots unfold on television, and saw some of the players he coaches in youth football among the rioters. He gathered 15 friends, including some church pastors, and went to the riots near Mondawmin Mall to try to calm things down."},{"comment_id":"10154384389006636","commenter_b":"One of the biggest lies is that the state of Israel was built out of a scrap of desert with just a few primitive wandering around. So they perpetrate a lie that Palestine was the invention of Yasser Arafat and the Palestine Liberation Organization. Yet the real truth is that Palestine has existed as a discrete country for well over 2,000 years and there is plenty of evidence to prove this. @webpagelink","commenter_a":"Israel continually ignores international law and wonders why the UN resolution was passed against illegal settlements in occupied land. Will Israelis give the homeless shelter - hell will freeze over first.","post_message":"A nationwide strike"}]
