[{"comment_id":"10152650775565496","commenter_b":"Agreed. They gave that lady not one, but TWO! black eyes. They liked to beat her brains in.","commenter_a":"Why are they out on bond? If I were the D.A. I would be pushing for attempted murder charges.","post_message":"The trio of woman accused in a brutal beating over a squished hamburger were scheduled for court this morning. UPDATE on the case: @webpagelink"},{"comment_id":"1155777891187482","commenter_b":"Clear to me this woman is smarter than you will ever be.","commenter_a":"This woman is a mercenary. She has no morals, ethics or integrity. Just a few months ago when she was on Ted Cruz' team she was bashing Trump for all the things that she is now defending him. She would say just about anything for a buck.","post_message":"Reports about Kellyanne Conway are greatly exaggerated."},{"comment_id":"1842076306034200","commenter_b":"But the opinion of a lying, misogynist, braggart like Trump is worth listening to ? Some people . :-(","commenter_a":"Worst acceptance speech ever Be appreciative of the award. Nobody watches the Golden Globes to hear your multi million dollar opinion","post_message":"WOW! Meryl Streep just brought down the house at the Golden Globes..."},{"comment_id":"10154093094596756","commenter_b":"Yes that's it Alissa, it is \"hidden on purpose\" but you supposedly know this secret and post it on Facebook...yet it is hidden? How, just HOW do you make that thinking work in your mind?","commenter_a":"They just lie with confidence and no facts and figures. The economy is worse than when Obama came to power? Are you serious? The whole banking system had crumbled and TARP funds had to be injected. Lehman Brothers had closed down. Merrill and Bear Stearns were sold, housing was plummeting, unemployment was rising, stock market had crashed, sentiment was pessimistic. Now that we are all good - yep let's not give anyone credit where it is due.","post_message":"If you missed last night's GOP debate, here's a recap in 100 words."},{"comment_id":"1001474073269501","commenter_b":"Muslims consist of .9% of our population. Bigotry around 20%","commenter_a":"I disapprove! He has caused nothing but destruction! The flooding of illegals and Muslims! They are murdering innocent Americans! Obama just sits back and enjoys the show. He lies about his crimes like Hillary does. I'll enjoy the show when Trump is president and arrests your ass!","post_message":"Do you approve or disapprove of the job President Obama is doing in office?"},{"comment_id":"495211413960969","commenter_b":"What a f****n punk","commenter_a":"He is a psychopath I assume.","post_message":"As for killing Trayvon, he said, \"I believe God has his plans\" F*ck this guy. -Linda"},{"comment_id":"10154220107672293","commenter_b":"@username idiot","commenter_a":"Like the Central Park rapists (5 young black boys) some years back that Trump railroaded into jail, then never apologized when someone else confessed.","post_message":"Cooper was wrongfully convicted of armed robbery in Indiana in 1997, and he is still waiting to be pardoned."}]
