[{"comment_id":"1798977096981448","commenter_b":"What stupid woman do you think orange head is going to grab your thing and you're so happy","commenter_a":"No I believe Clinton was way worse then Tump with rape and the White House incident-- really!","post_message":"SHARE THIS and FOLLOW US at Reverb Press and Stories That Resonate <<<"},{"comment_id":"10153153203728525","commenter_b":"The girls that go there will be fine.","commenter_a":"If you think this is funny just know that you're wrong and a terrible human being. This is the reason that young girls are raped and abused, because \"boys will be boys\". Or they were 'asking for it'. We've become a society where men can get away with sexualizing everything but its okay but they're boys and it's in their nature. But good to know that half of you people (that are most likely all parents) are okay with your daughters being looked at as nothing but a piece of meat.","post_message":"Imagine rolling up to drop your daughter off at college for the first time and seeing this: @webpagelink"},{"comment_id":"1172311699525637","commenter_b":"Fuck You! Get off your fat ass and get a fucking JOB!","commenter_a":"All I can do is laugh","post_message":"\"Pay me consistently, provide me safe housing, offer me a job with benefits, run me those Beyonce tickets\" She must have lost her mind, if she thinks we are going to pay her anything. Will you pay for this entitled BLM organizer to go to a Beyonce concert?"},{"comment_id":"10153227996393812","commenter_b":"And feminazis want to be equal. Smfh","commenter_a":"Men can be abused too...","post_message":"\"Why is it so hard to see black and blue?\" #TheDress being used to fight back against domestic violence: @webpagelink"},{"comment_id":"10153218783658869","commenter_b":"No inspired because I do not look up to her.","commenter_a":"Antes de ver a una mujer en la Casa Blanca, la clase política americana es capaz de buscar lo inexistente, y si hay hay que crearlo, de crea.","post_message":"Hillary Clinton cannot appear too strong without risking her likability ratings; she cannot appear too vulnerable without her credibility suffering. Herein lies her dilemma."},{"comment_id":"10153924277776130","commenter_b":"These girls are still relevant? Lol","commenter_a":"Can't get crack online","post_message":"Um ... what!?"},{"comment_id":"10153629166689170","commenter_b":"I bet Herman has watched this a 1000 times","commenter_a":"You mean to say that I have to save this so I can show my lil boy when he gets older the travesty that happened and the wrongs performed by these terrible women, it won't be easy but it's for future reference , thank you Libs for bringing this horrible video to our attention or no one would have known about it hahahaha","post_message":"The left does not want you to ever watch this video because it's \"hyper-feminine\" and not diverse or something. So even though we've embedded it here, don't watch it!"}]
