[{"comment_id":"1095662820489119","commenter_b":"She's God Damn Trash! Nasty white cunt!","commenter_a":"This is a prime example older white people are the most racist people in America the older white the younger generation is not like the old white generation they raise the kids to be racist this just don't make no sense but she got a dose of her own medicine because the world is not hateful like she is and she's in her last days she's going to die a old racist woman she have to answer to God she's trash in my book","post_message":"A black girl was harassed by an older white woman while selling candy outside a California Target for $1. But, there’s a twist. Jay Lopez, a customer at Target, saw the woman berating the girl & intervened. Restoring your faith in humanity, Lopez bought the remainder of the sweets. VIDEO---> @webpagelink"},{"comment_id":"1080347691985409","commenter_b":"Exactly","commenter_a":"Frankly, no matter whether the women went back to him--maybe they were screwed up emotionally at that time too--he assaulted them. It's the 21st century. Stop trying to drag women through the mud for reporting it. Choking is assault, n'est pas?!","post_message":"\"Nobody close to Jian even pretends he is innocent, and somehow this isn't an issue the women are.\""},{"comment_id":"10153505413366770","commenter_b":"She's an idiot","commenter_a":"Kelly girl get over yourself, now your show will be a flop.","post_message":"Kelly Ripa was dressed for a funeral."},{"comment_id":"813714802066935","commenter_b":"I'd like to see her asshole","commenter_a":"Joyce Watson @username superimpose someones cheeser. xv","post_message":"Subscribe to our mailing list and receive our awesome content for FREE - @webpagelink"},{"comment_id":"1017645858352192","commenter_b":"This she bitch should be locked up.","commenter_a":"Every one knows what to expect from you. Nothing good.","post_message":"ClashDaily.com"},{"comment_id":"1033520256666198","commenter_b":"It would be that woman riding in on a broom!","commenter_a":"what governor","post_message":""},{"comment_id":"492568140946699","commenter_b":"Keep it close to the Whitehouse for the next few months, 2 fer 1! (JOKE)","commenter_a":"No.","post_message":"Guess who was at the ribbon cutting ceremony?"}]
