[{"comment_id":"10155358304877439","commenter_b":"Think someone must be shitting they're pants cause this brave WOMAN is gonna sort the RATS out..😂😂😂","commenter_a":"This is a threat. He should be arrested and jailed.","post_message":"A 24-year-old Muslim blogger and so-called human rights activists has called for the slitting of France's Marine Le Pen for her conservative political views."},{"comment_id":"10154202595341178","commenter_b":"MIKA needs to SHUT UP! Just vote in HILLARY Mika. that is who your candidate is isn't it?","commenter_a":"Anything for ratings!!!","post_message":"MSNBC host has MAJOR tantrum on live TV! #TTT16"},{"comment_id":"1169723563063063","commenter_b":"SHES ONE HELL OF ALOT BETTER THAN THE TRANNY AMERICA HAS PARADING AROUND AS A WOMAN NOW! THE TRANNYS NAME IS MICHAEL! ODUMBASS LOVES HIS GAYS! DAMN THAT IS ONE BUTT UGLY GORILLA FAVED TRANNY! MELANIA HAS MORE CLASS IN HER CRAP THAN THE TRANNY HAS IN HIS WHOLE BODY! P.S. TUCK THAT SCHLONG TRANNY!","commenter_a":"Agree","post_message":"I agree!"},{"comment_id":"10154043795967061","commenter_b":"The fact that the lady moves so slow is the first reason she should no longer be driving!!!!!!","commenter_a":"Grab her and get her out!! Why so slow Poor lady Car could explode","post_message":"WATCH: Body cam video shows Santa Fe police officer rescuing an 87-year-old woman from a burning car. \"I could have burned to death. @webpagelink"},{"comment_id":"1362278090453725","commenter_b":"GET THE FUCK OUT!","commenter_a":"Send them home","post_message":"Muslims Banning 9/11 Memorial Because It’s Racist. They have no respect for the country we live in. Do you think they are the racists?"},{"comment_id":"1345530805539970","commenter_b":"@username again you also admitted to being a bitch so....","commenter_a":"It's funny that all these bad ass, gun toting, 2nd amendment conservatives seem to have no problem becoming Russia's bitch","post_message":"LOL! Thanks to Andy Borowitz for this helpful advice for Trump..."},{"comment_id":"10154262416956037","commenter_b":"Remember if you need some hot sauce Hilbilary carries it in her purse!","commenter_a":"Why? So this is the type of journalism Yahoo gives us after laying off 25% of their staff?","post_message":"Yahoo News reporter Hunter Walker is heading to the Trump Tower Grill for a Facebook live stream to get reaction to Donald J. Trump's Cinco de Mayo fiesta. Tune in soon ..."}]
