[{"comment_id":"418033801654548","commenter_b":"The woman deserves to burn in hell for eternity.","commenter_a":"Zeeeeerooooooooooooooooooo!","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"10153067188779312","commenter_b":"your a funny hoe if u wanna live like that so be it","commenter_a":"No junk food or soda Should be like the old days . Meat, cheese, bread, can goods , fresh fruits and vegetables . THATS ALL","post_message":"A Florissant lawmaker wants to prevent the ability to purchase energy drinks with food stamps. Thoughts?"},{"comment_id":"10153287530191336","commenter_b":"A woman who got it 100% correct.","commenter_a":"As women, we have ruined it for ourselves. We can't act like men and then expect a men to act chivalrous towards us. Be a lady, and you might be pleasantly surprised.","post_message":"Is chivalry dead?"},{"comment_id":"10154796550641509","commenter_b":"Liberals must leave the country !!!!!","commenter_a":"Are you interested in joining the illuminati to be rich and to achieve your desires in life? If yes, Add me and Message me now so I can introduce you to the gate way to success.","post_message":"Experts warn that these labels do not really mean very much and can even be misleading in some cases"},{"comment_id":"944724415582961","commenter_b":"Fuck all white people they stink as fuck come in my yard I'll kill all yall bitches I don't give a fuck about them crackers when they die they turn black bitch we all come from dust one man one woman dust is what color Brown bitch you black like us","commenter_a":"Sharokina Haghee","post_message":"This happened. A Facebook user who goes by the name of Geris Hilton posted a photo with a black child, who is allegedly the son of his co-worker. What happened next, will leave you disgusted. He and his friends decided to make racist “jokes” at the child’s expense. Had it not been for Black Twitter, they would have gotten away with it. MORE -----> @webpagelink"},{"comment_id":"10153871207061336","commenter_b":"No dear, Hillary Clinton was First Lady, a US Senator and Secretary of State. This little nobody was never anything close. Glad to help you. Leave the comedy to the professionals.","commenter_a":"This little nobody from Arkansas with no job is still making noise? LOL!","post_message":"\"That's one of the frustrating things about this president – he always tries to make it that he has the moral authority and everybody else is wrong.\" This morning on \"FOX & Friends Weekend,\" presidential candidate Mike Huckabee slammed President Barack Obama's approach to policy disagreements. @webpagelink"},{"comment_id":"1186888831331145","commenter_b":"Hold her in contempt and lock her up.","commenter_a":"What's next stone her.....","post_message":"Her act of resistance has rocked her small Appalachia community 60 miles east of Lexington and made headlines nationwide."}]
