[{"comment_id":"974401272656125","commenter_b":"If he is not im sure he has been watching and waiting for his next money making endeavor.","commenter_a":"And here come the riots.","post_message":"JUST IN."},{"comment_id":"10154830070756337","commenter_b":"I feel good Hillary is going to win","commenter_a":"I'm with her!","post_message":"We're counting down to Tuesday's election. Tell us how you feel..."},{"comment_id":"1369581076434970","commenter_b":"Stay on your meds lady","commenter_a":"If you go and read her fb page you will see this is FALSE reporting.","post_message":"Sinead O'Connor has 'threatened to jump off a bridge'"},{"comment_id":"10152969053772293","commenter_b":"Well scumbags cat got your tongue","commenter_a":"It is not racism.It is about illegal bangladeshis entering every bordering country. Half of Bangladesh is in India. Burma or Malaysia are not like India.These Bangladeshis create all sorts problems from drug peddling, to prostitution, thievery, robberies, kidnapping & rapes. Recently bangladeshis raped a 70 year old nun at a church.","post_message":"A tragedy no one wants to own."},{"comment_id":"10153543031078812","commenter_b":"If you are crossing borders illegally... You broke the law, entered our country without proper credentials and then I'm suppose to foot the bill? Hell no, if I have to follow the rules, then so should the ILLEGAL immigrants!!!","commenter_a":"In my opinion he offended not only #mexicans but all imigrantes that have to cross any border w/ USA. MY RESPECT to anyone that comes to the USA trying to have a better life.","post_message":"NEW: Univision dropping Miss USA pageant and cutting all business ties with Donald Trump over comments about Mexican immigrants: @webpagelink"},{"comment_id":"10153108575014726","commenter_b":"Obama working to hamstring America from fighting the Jihad @webpagelink","commenter_a":"obama is an appeaser and weakling","post_message":"WATCH: The Netanyahu speech that is throwing Obama off his game!"},{"comment_id":"10153978384659726","commenter_b":"There is a new Wave in America, it's the Blue Collar Wave and it's about to wash away an entire Establishment. The Media says we're dummies and Racist for Standing up to the Establishment and Riding that #TrumpTrain all the way to the White House to Make America Great Again. I say let the Blue Collar Wave wash them away.","commenter_a":"Perhaps but regardless, Obama is a POS.....","post_message":"WATCH: Obama: I'm not a 'big government, crazy liberal'"}]
