[{"comment_id":"10153473377133132","commenter_b":"She needs a vaginal reconstruction!","commenter_a":"WEIRDO","post_message":"Still haven't bought a gift for mom? The 19 Kids and Counting matriarch is going to fix that."},{"comment_id":"10153933282696350","commenter_b":"Bethsaida Yadnara Why have their own muslim brother's turned them all away??? Jordan, UAE, Dubai, Saudia Arabia?? Those are some very rich countries, right around them.","commenter_a":"They don't belong here...and sure their parents are collecting major benefits, just for entering the country.","post_message":" know people have mixed feelings, and they can be afraid because it's the unknown. But the more we get to know these people, the more the community gets to know them, the more that's just fading away.\""},{"comment_id":"10154230428956509","commenter_b":"To protect us from bringing terrorists here. How can you tell if a Muslim is not an extremist?","commenter_a":"I don't think they should have to be Christians, just not Muslim.","post_message":"\"I don't know if you can prove that they're Christian... How are they proving it?\" Donald J. Trump said about Syrian refugees. @webpagelink"},{"comment_id":"1280674628621991","commenter_b":"@username yes she's the best of a bad lot","commenter_a":"Dump the Trump he just isn't Presidential Material","post_message":"If you think that a President Trump would be checked by Congress and \"couldn't really do that much harm\" you're totally wrong."},{"comment_id":"910779442445965","commenter_b":"YES THAT IS WHAT WE SPEAK. THE ILLEGALS CAN LEARN IF THEY HAVE A BRAIN OR FIGURE STUFF OUT FOR THEMSELVES. THEY CAME HERE NOW THEY CAN FOLLOW THE LAWS OR START Walking or swimming. either way learn or leave.","commenter_a":"Yes to english","post_message":"He wants to make this this official language of our country. People are up in arms. Do you think he's right?"},{"comment_id":"1281672095204357","commenter_b":"Yep, in with the younger roaring lion, out with the old senile evil slimy snake.","commenter_a":"I hope he can get Congress to kick them out of NYC. That building would make a remarkable place to house and care for our vets and homeless. That would save us so much money. The UN is not needed for us. No one I know wants to belong to a One World Order and governance. Let them move somewhere in Europe and take Soros with them.","post_message":"This is going to be good..."},{"comment_id":"601754246672035","commenter_b":"Yes I do the whites made her now she it very racist big time","commenter_a":"shut your mouth!","post_message":"Oprah: ‘Anyone Who Doesn’t Like Obama Is Racist’. Unbelievable. What a bigot. Do you think Oprah is the racist?"}]
