[{"comment_id":"975170995873379","commenter_b":"Boo you whore","commenter_a":"She's still a total train wreck? What change?","post_message":"This medicine changes the life of anyone that uses it."},{"comment_id":"10154523609503984","commenter_b":"oh, Spanish ought to set you off too, especially those who want to make it our official language, after all it was Spain that did the most detriment","commenter_a":"Cynthia, America is not racist. There are racist people that live in AMERICA. Obama is a race baiting man stop being BLIND. It was VERY INAPPROPRIATE for the speech he gave in Dallas. If anyone has the TRUE right to be angry about racism it is MY PEOPLE, NATIVE AMERICANS. I don't see any blacks living on reservations in America.","post_message":"This guy hits the nail on the head. I'm sure race baiting liberals will be fuming after watching this. A lot of people took aim at Michelle Obama in 2015, but no one hit the bullseye harder than he did..."},{"comment_id":"10153573434494087","commenter_b":"Oh for the love of God, I fear for the United States when that evil emotional vampire gets the keys to your White House!!! Vote Trump. Vote Sanders, for all things decient don't have that evil woman near the White House","commenter_a":"Trump for President and Hillary for Prison","post_message":"Two of the top three most retweeted tweets of last night's Republican debate were from Hillary Clinton, while none of the GOP candidate even entered the top 5."},{"comment_id":"10154798019399062","commenter_b":"Russia has been the most proactive but we condemn their actions.... lol","commenter_a":"I wonder how long the leaders of the free world are going to tolerate this without taking the fight to ISIS directly and wiping them out! The scumbags need annihilating!","post_message":"BREAKING: Islamic State group claims responsibility for Brussels attacks, Associated Press reports. READ MORE -> @webpagelink"},{"comment_id":"10154128572736378","commenter_b":"Shouldn't they have to go back home before mommy and daddy lock the basement door","commenter_a":"Wonder if they voted?","post_message":"#BREAKING - Hundreds of protesters are marching through Center City, Philadelphia tonight, near City Hall. They are unhappy with Donald Trump's election. Many of these protesters are local college students, others say they are supporters of former democratic presidential candidate Bernie Sanders. @webpagelink"},{"comment_id":"10153072331466051","commenter_b":"This woman is nuts and needs put away for a long time. How crewel!","commenter_a":"These people are so evil !!! what is this world coming to","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"369558209835168","commenter_b":"She's going to die","commenter_a":"Lesley has asthma and she wants to come @username Christian Canales @username @username","post_message":"People living in Galena Park are being told to shelter in place because of a sulfur dioxide release at a Pasadena refining system. This is viewer video from Geno Salinas. Story --> @webpagelink"}]
