[{"comment_id":"1753098654934241","commenter_b":"I'm not making this Woman commit suicide, and I'm not the one to stop her.","commenter_a":"Jump bitch.","post_message":"She wants to end her own life."},{"comment_id":"1067844663241313","commenter_b":"Texas i never would have u of all states would let muslims take over u capital and Texas read there korah they hate sll non muslims u have been fooled ,they use our laws againest us to get into our goverment , the woman had a right to speak she is a American citizens talking about God and Jesus his son , and u made her leave i bet her family fit 4 our freedom can u say the same about ur muslims that were there ,muslims use people like u all falling 4 there garabage ,i bet they are not even citizens , Texas ur idiots make no mistake the muslims will try to take texas over ,then where are ur Texas Rangers ,","commenter_a":"I see everyone praising this woman, and it's cool I respect her opinion and her right to her actions. But why use the name of Jesus for all the hatred rants. Like when the illegal kids on the bus came to the U.S. and got screamed at and booed by \"Christians\" I wonder if Jesus came down here would be ranting with his Christians or would he be loving everyone?? I think you should do your hatred rants in your name. Not the Lords name.","post_message":""},{"comment_id":"10154910667241162","commenter_b":"We both like thick @username, but for some strange reason she wanna be thin.","commenter_a":"Demetrius DaInfluence Hardy and @username told y'all it was debatable.","post_message":"We all agree that Chicago has the best pizza - but the debate in our newsroom is over deep dish or thin crust. What your pick? Our Hungry Hound did some research for you: @webpagelink"},{"comment_id":"10153465334273132","commenter_b":"This case may seem cut n dry but so much time has gone by plus they never found his body.. I would not want to be a juror on this case","commenter_a":"They had a convict in prison who was even more than likely this little boy's killer. I think this is why this guy's 'confession' is so questionable. The investigators refused to admit they made a huge mistake, not surprisingly. I don't think they have the right guy, as for the real killer, I believe he died in prison. The whole thing is tragic.","post_message":"The jury has already been deliberating for 11 days."},{"comment_id":"10152889836291491","commenter_b":"Felicitari !","commenter_a":"I hope she and her baby are both well safely","post_message":"It's a girl!! @webpagelink"},{"comment_id":"1628197660735785","commenter_b":"Typical woman. Always find something to complain about.","commenter_a":"I see no bacon...this game sux","post_message":""},{"comment_id":"465830173607563","commenter_b":"Bossy bitch!","commenter_a":"Just ban Michelle.","post_message":"Should We Ban This Word To Please Michelle? Comment 'yes' or 'no'."}]
