[{"comment_id":"10153575814345950","commenter_b":"Fuck trump POS!","commenter_a":"Thry are all illegal wall jumpers. Come back to the US after u grow up","post_message":"\"No hate in our state,\" demonstrators chanted early in the day, with a few carrying Mexican flags in protest of Trump's anti-immigrant policies."},{"comment_id":"10152927124907293","commenter_b":"because female popes get the same pay as male popes","commenter_a":"1. The premise is not even true. 2. The screaming irony of this makes me think that the @username picked this up from The Onion.","post_message":"\"Why should it be taken for granted that women must earn less than men?\" the pontiff said."},{"comment_id":"952596034775492","commenter_b":"@username Shooter FU! You are a whinny little bitch.","commenter_a":"lol we are fucking idiots, we believe in make believe deities, we salute the flag of the sickest country in the history of existence, we salute brainwashed troops who murder innocent people behind imaginary lines, welcome to brain dead Georgia lol","post_message":"If you don't love the nationalistic rhetoric of the state, LEAVE! Police The Police | The Free Thought Project.com"},{"comment_id":"939237909458566","commenter_b":"Time to put two carrier groups in the area and drop lots of big fire crackers and line up some goats for the departed cave rats....but that raghead POS that lives in the WHITEHOUSE will do nothing","commenter_a":"Uh....why????","post_message":"BREAKING NEWS:"},{"comment_id":"10153249235547894","commenter_b":"here Sharnise Nisec Brown since you are behind on the times lol Lauren Payton Katrina Elizabeth","commenter_a":"Zanehya Rayshaun Corleone","post_message":"Exclusive: K. Michelle Opens Up About Her Relationship with Idris Elba and Backlash from Black Women: ‘The Women I Fight For Have Been The Women That Attack Me’ [Video]"},{"comment_id":"1239839009369460","commenter_b":"@username is a wetback that's gonna be deported.","commenter_a":"When the immigrants - illegal or not - leave the USA, be prepared to clean your own toilets. Americans are lazy. Plain and sheer.","post_message":"Under the Eisenhower program, immigrants inside the U.S. were rounded up and deported to remote places, resulting in deaths and criticism of human rights abuses."},{"comment_id":"472078136250114","commenter_b":"Haha What a bitch","commenter_a":"Good for them. If they don't like prayer they need to leave the activity. To Hell with them.","post_message":"An atheist group complained about prayers at sporting events. This is how the community responded."}]
