[{"comment_id":"10153775888041756","commenter_b":"Some of these countries send their boys to war as young as age 6. That's gendercide too. And a much more painful form of it. Like in Sparta where they would kill the boys if they didn't have a warrior's body. Male disposability exists throughout the world including the West. And it persists regardless of the sex of the leader. The Queens of England ruled half the world for long periods of time but it was still the men who were disposable. I would never expect the mass media to address that. Not for another hundred years that is.","commenter_a":"Those are going to be some very unhappy boys.","post_message":"Technology has enabled even the poorest of countries to boost the ratio of boys over girls. One expert even goes so far as to use the term \"culling\" when talking about what's going on in these countries — a word otherwise reserved for describing the removal of undesirable animals from the herd."},{"comment_id":"525718480886525","commenter_b":"Go home angelia you're drunk","commenter_a":"Yesterday 100 innocent dead in Lebanon Attack, 500 innocent dead in Palestine, 200 Dead In Yemen, last year 400,000 dead in Syria, 5 years ago 1.5 million dead in iraq, Yet No one Says Word , The world Stands silent. And In Paris Attack Today 150 Dead And World Goes Crazy . Obama's statement after attacks in Paris: \"This is an attack not just on Paris...this is an attack on all of humanity\" Mr . Obama Wake up Humanity Has Been Getting Attacked and it dead long time ago. R.I.P To All those innocents Who Died In Paris Attack Today, and R.I.P To All Those innocent lives Who were never Mentioned In The Attacks , and Still Being Killed and not Being Mentioned .","post_message":"Our worst fears have been confirmed. #ParisAttacks The Free Thought Project.com (y)"},{"comment_id":"10157751782920500","commenter_b":"BUILD THE WALL!","commenter_a":"I don't get how everyone assumes all those people are unemployed, on government assistance and have no education... who the fck are you.","post_message":"This is live footage from Oakland where people are protesting Donald Trump's election."},{"comment_id":"1166185690114851","commenter_b":"I agree Awesome comment thanks :/","commenter_a":"OG gives zero fucks","post_message":"Uber driver loses it after man smokes weed in his car"},{"comment_id":"10153207702598967","commenter_b":"That chick in red goes down HARD!!! Hahahaha...","commenter_a":"Outstanding!","post_message":"So silly but so fun"},{"comment_id":"1317807834918571","commenter_b":"Hillary Clintin is a nasty Woman, I like the sound of that truth.","commenter_a":"TRUMP = TRUTH","post_message":"WATCH LIVE: Donald J. Trump's campaign manager tells Bianna Golodryga about the \"rigged election\" claims."},{"comment_id":"954186131315786","commenter_b":"Her being revealing? Do you think she picked out the dress herself and made a conscious choice to show her nipples?","commenter_a":"To be so revealing when so young is certainly extremely questionable moral territory.","post_message":"Too young?"}]
