[{"comment_id":"10152858693731336","commenter_b":"And those countries don't have 30 million illegals and a lazy spoon feed group like we do either!","commenter_a":"No one had actually spoken to a Canadian. They have to wait in hallways for a room. They go to Mexico for medicine and dental. So how is it better. Trust me I have dealt with a lot of them who come to the US to get care. This information comes from the Canadians themselves because they purchase travelers insurance from various American Insurance Co so they can come here. If you have not lived in Canada don't talk about their healthcare you don't know about it.","post_message":"What could a Republican alternative to ObamaCare look like? “We could try freedom for a while,” Sen. Rand Paul said."},{"comment_id":"10153186576481162","commenter_b":"I'm glad she won't be crushing any more babies.","commenter_a":"I happy 4 her but i want to do it with out surgery","post_message":"HALF-TON NO MORE: She is the woman once dubbed the \"Half Ton Killer,\" accused of killing her nephew by rolling on him with her 1,000-pound frame. But after clearing her name, she has a new lease on life, a smaller body, and is motivating others with her weight loss story. AMAZING TRANSFORMATION---> @webpagelink"},{"comment_id":"10152874752876336","commenter_b":"Don't let her have kids exterminate this animal.","commenter_a":"Shoot on sight!","post_message":"Manhunt underway: Police are searching for Hayat Boumeddiene, a suspect in Thursday's murder of a French police officer. Tune in to Fox News Channel for special coverage now."},{"comment_id":"10153814640313701","commenter_b":"He needs to be locked up and the key thrown away!","commenter_a":"Not to judge people on appearances, but I would seriously reconsider allowing my kid to be alone with the likes of that creep!","post_message":"A court document states that Toman admitted to sexually abusing a girl when she was between the ages of 11 and 17."},{"comment_id":"10153377992812426","commenter_b":"Typical female...never satisfied.","commenter_a":"Wish he'd do something else other than banning microbeads","post_message":"Thanks, Obama! ;) More than 8 trillion microbeads were entering the country’s aquatic habitats daily; the volume was enough to coat the surface of 300 tennis courts every day -- according to a Sept. study."},{"comment_id":"1170836056328262","commenter_b":"The last time I posted something about the politics of these bitches, I got dozens of whining bitches, men? and women, extolling on the vitues of these sacks o shit. Piss on 'em. Bring it on bitches!!!!!!!!!!","commenter_a":"GO DIXIE CHICKS--FREEDOM OF SPEACH-TURN TEXAS BLUE--","post_message":"Some Donald J. Trump fans attended this concert wanting to get away from politics and just have a good time listening to music. But then they noticed what the Dixie Chicks has in the background during one number. After that, Trump fans in the audience were absolutely furious... and for good reason. This is sick."},{"comment_id":"10155306004950725","commenter_b":"Those girls are animals.","commenter_a":"Throw her Ass in Jail with the real Women, not the Kiddos.","post_message":"A 16-year-old girl has been arrested after a vicious fight with a group of girls at McDonald's, police say. Watch a video of the brutal brawl here------> @webpagelink (WARNING: Violent nature could be disturbing to some viewers)"}]
