[{"comment_id":"1027408730682076","commenter_b":"She is so stupid","commenter_a":"Ur one dumb B****!!!!!!","post_message":"@webpagelink"},{"comment_id":"991842820828524","commenter_b":"No it doesn't. Vermont has Constitutional Carry, and Vermont is the safest state in the union. @webpagelink","commenter_a":"Thank you, Governor. The current law works just fine.","post_message":"Governor Maggie Hassan issued the following statement today on Senate Bill 116, repealing the license requirement for carrying a concealed pistol or revolver: “New Hampshire’s current concealed carry permitting law has worked well for nearly a century – ensuring the Second Amendment rights of our citizens while helping to keep the Granite State one of the safest states in the nation. Law enforcement, as well as citizens across New Hampshire, have strong public safety concerns about allowing people to carry concealed guns without a license and oppose removing the protections that the licensing process offers to help ensure that potentially dangerous individuals are not allowed to carry hidden weapons. “Our permitting system gives an important oversight role to local law enforcement, while allowing for appeals through appropriate channels. In his book Live Free or Die, Republican Governor Mel Thomson said that the current permitting process for concealed carry is ‘a ..."},{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"10157833652505615","commenter_b":"I think it's really stupid to be laughing at someone trying pretty much entirely on her own to recount an election everyone agrees was not by the book. When calling this election \"not by the book\" is a gross understatement. Forcing recounts in some critical swing states in a situation where the electoral vote and popular vote are completely different is a reasonable endeavor. What's absurd is how much of the establishment is willing to lie back and let this thing happen, then assure us in the same breath nothing truly terrible will come out of this administration because the establishment will prevent it. Actions speak louder than words, and the inaction of pretty much everyone other than Stein, Sanders, and Warren speaks volumes.","commenter_a":"Jill Stein, election spoiler, is going to put that money raised in her own pocket to pay her expenses.","post_message":"This Just In – Just a few hours til deadline..."},{"comment_id":"10153782670984838","commenter_b":"Then why are they acting like children when they run around sleeping with random people getting pregnant when they don't want a baby in the first place? So yes those women are children since they don't know how to have safe sex.","commenter_a":"Absolutely ridiculous!! Women are not children.","post_message":"A bill that would impose a 24-hour waiting period on women seeking an abortion is headed to Republican Gov. Rick Scott."},{"comment_id":"10153563956586519","commenter_b":"Hello??? It is time for you poor ladies to start being your own role model. Stop whining.","commenter_a":"Sooooooo, losing weight is selling out now? You damned if you do, damned if you don't.","post_message":"\"I’m left longing for stories about fat women that don’t tumble off the wrong side of that thin tightrope between laughing with and laughing at...\""},{"comment_id":"10152894854427756","commenter_b":"I use paper condoms.","commenter_a":"Thanks Obama. *shakes fist*","post_message":""}]
