[{"comment_id":"870966692926187","commenter_b":"GIRL BYE","commenter_a":"I don't blame her for not wanting to call him. She hasn't spoken to him for a reason. Probably the same reason why Lisa Bonet and God knows how many other members from the cast have not! She should not have been fired for that.","post_message":"Keisha Knight Pulliam Fired From Celebrity Apprentice For Not Contacting Bill Cosby For Fundraiser @webpagelink"},{"comment_id":"10155316493136509","commenter_b":"She's a putz.","commenter_a":"Kacie Hughes","post_message":"Hillary Clinton: \"The good news is my pneumonia finally got some Republicans interested in women’s health\" @webpagelink"},{"comment_id":"1222800194406675","commenter_b":"we want some in the NW!!!","commenter_a":"Noooooooooooooooo","post_message":"Millions of Americans woke to chilly temperatures Saturday, and many could see (gulp) snow before the weekend is over."},{"comment_id":"596524653885918","commenter_b":"Hell no she's a racist and a bigot . Her husband did our country more harm than good. No way would I ever vote her into office.","commenter_a":"no way in Hell","post_message":"Would you vote for Michelle Obama if she ran for president one day?"},{"comment_id":"1072924802728530","commenter_b":"So your saying, that I'd have a needle put in my eye for something that wouldn't be used since I sleep when it's able to use.... interesting....","commenter_a":"@username .. hackers never stop ... xD","post_message":"Who wants to be able to see in the dark?"},{"comment_id":"788040247961250","commenter_b":"you were pounced on by women....","commenter_a":"I feel so sorry for him. When did we as a people become so cynical, unfeeling, intolerant and belittling. He made an old person's mistake - we old farts are often out of sync with the modern culture - it's not a crime. Did anybody consult the women he worked with before they dumped him??","post_message":"\"They haven’t even bothered to ask for my side of affairs.\""},{"comment_id":"10156784755310354","commenter_b":"Fly on your Broomstick Hillary!!","commenter_a":"The fact that she has not been indicted by now with the mountain of evidence stacked against her is proof that it will NEVER happen, folks.","post_message":"There is zero irony in this story."}]
