[{"comment_id":"10154512685084411","commenter_b":"No copy paste","commenter_a":"copy paste. This is what you do ? Be creative guys.","post_message":"The Big Mac is dead, long live the DonMac!"},{"comment_id":"10154442416273701","commenter_b":"You wouldn't likely notice a player. This woman was doing something else, I'm sure.","commenter_a":"Am I the only one that thinks it's disrespectful to be playing in a cemetery??","post_message":"Authorities in New Jersey say a woman trying to catch Pokemon in a cemetery ended up stuck in a tree and had to call 911 to rescue her."},{"comment_id":"127551884528757","commenter_b":"@username she was female","commenter_a":"She got what she asked for. Had she left room between her and the vehicle in front of her, she would have had adequate time to take evasive action to avoid the mattress and been able to maintain control of her vehicle. Both trucks were traveling at a reasonable and prudent speed. The ford was passim the semi safely. She grew impatient. Ford took evasive action, maintained control of his vehicle. She was tailgating and did not have time to take evasive action SAFELY. Over corrected and lost control of her vehicle. She is 100% at fault. There is no negligence on either driver. Her car is obviously totaled hopefully she carries collision coverage. She will also be paying for the damage to the semi. Hope she has enough liability. I am a claims adjuster. I explain this to people allllllllll day. She was impatient, and now she will have ...","post_message":"TAILGATING GONE WRONG: Watch as a car that was tailgating another vehicle on the I-10 ends up ramming into a semi-truck and flipping in the air. Luckily, the driver and her cat were not severely injured."},{"comment_id":"10152695549716615","commenter_b":"My wife has never done drugs.","commenter_a":"That lady obv is a meth head..","post_message":"A second grader who has autism - slapped by a teacher's aide. That boy's parents tell WPXI Joe Holden their son was tapping on the aide's shoulder, trying to get her attention, when they say she hit him. Both mom and dad are now upset with how the school handled the incident. We're learning more about the aide's punishment and why it's just not enough for these parents. Joe is also making calls to the school for a response. He'll have an update tonight at 5:06 p.m. on Channel 11 News."},{"comment_id":"1337467809657543","commenter_b":"Actually...now.women will do time for....oh what's that word.... MURDER! Hahahahhahahaha","commenter_a":"Abortion happens. Now if it happens in a sterile clinic with a doctor or in a back alley with a coat hanger, it's still going to happen.","post_message":"The so-called \"heartbeat bill\" approved Tuesday would result in what would be one of the most stringent abortion restrictions in America."},{"comment_id":"1265882336765127","commenter_b":"And yes that woman looks horrible because she over does it ...like I said I wouldn't suggest coming every day for the rest of your life","commenter_a":"Ummm....I am a tanning salon OWNER! You are are misinformed in your information as we all have taken classes about tanning. My mother died of melanoma and never tanned a day in her life we get SOOOOO MANY people with medical conditions who have to tan some of which are young girls. Now they passed the new law in 2014 on minors but we are WIDELY sought out and remained a tanning salon for 17 years!!! You have to educate yourself on it. The media is giving it such a horrible rep just like they do with everything to make you all freak out the exact way u are. If we didn't know what we were talking about then why do we have clients come who beat breast cancer with a doctors note or psoriasis or cystic acne or ms eczema the list goes on. Your body NEEDS vitamin D ...","post_message":"The FDA proposed unprecedented new rules Friday that would bar anyone under 18 from using a tanning booth or sunlamp."},{"comment_id":"1054180274641720","commenter_b":"Sam , isn't a lesbian so why would they have lesbian in the house?","commenter_a":"It's homophobic too, since there are no lesbians on the show either.","post_message":"Is The Bachelorette Australia RACIST? (via Daily Mail Australia)"}]
