[{"comment_id":"10153342655734411","commenter_b":"What is the difference between greeks and prostitutes? Prostitutes earn their money through an honest living","commenter_a":"Let's just carpet bomb western makedonia all the way to Tirana and rid the world of this problem.","post_message":"UPDATE: 8 police officers, 14 killed in Macedonia stand-off - authorities"},{"comment_id":"982783361781141","commenter_b":"Agreed but those who think she is a liar and a criminal probably won't be swayed regardlees. I think those \"on the fence\" folks will be the factor in the next election not the lemmings who accept whatever is feed to them. My optimism is shaky but I'm hopeful.","commenter_a":"I say, keep it up. Most people will see this for what it is .. a transparent attempt to stop Hillary from becoming President. Anyone who watched the hearing knows she was poised and presidential unlike the GOP committee members. Gowdy was an unknown laughing stock but not he's a famous one.","post_message":"In trying to save his committee and his reputation, Trey Gowdy is now saying that Hillary was the whole problem, rather than admitting that this 'investigation' is a sham. What are your thoughts on his accusation?"},{"comment_id":"10154320018886323","commenter_b":"Fascist dictatorship and destruction of cabinet government system. Democracy under attack.","commenter_a":"I am okay I never voted either tyrant but that's that's English government","post_message":"\"The Tories are about to give us a second female prime minister while much of the left will say gender is an irrelevance or that there are many more important things to deal with. Women, know your limits!\""},{"comment_id":"1658663710820319","commenter_b":"The Obama presidency wasn't a failure. Facts suck if your opinion differs, but it doesn't mean you get to have your very own truth.","commenter_a":"After seeing our FLOTUS on Oprah and seeing once again her \"attempt\" to divide our nation.... She had me thinking.. It was nearly nine long years ago that Michelle Obama stated, \"for the first time in my adult life I am proud of my country because it feels like hope is finally making a comeback.” After nearly eight years of failed policies, I feel I can nearly say the same.... For the first time in eight years, I am proud of my country because it feels like hope is finally making a comeback.”","post_message":"As First Lady Michelle Obama prepares to depart The White House, here's a look back at the moments that made her go viral. Watch more here: @webpagelink"},{"comment_id":"10153997571366378","commenter_b":"So glad they got him! That beautiful child did not deserve to get shot. God bless her.","commenter_a":"Why am I still shocked by such brutal events? Such a sweet looking child.","post_message":"#BREAKING: A man has been charged with murder in the shooting death of 8-year-old Gabrielle Carter in Camden, New Jersey. The 18-year-old suspect was arrested Friday morning at a relative's home in Tennessee."},{"comment_id":"963644947039340","commenter_b":"But she is dirty","commenter_a":"She knows women's issues best","post_message":"Watch live as Hillary talks to students at New England College in New Hampshire about the issues on their minds."},{"comment_id":"649003498581759","commenter_b":"On a more humorous note.","commenter_a":"The republicans in congress have failed to do their job for 7 years ,but the stupid voters put them back.How do you explain this ?","post_message":"We can make major changes in Washington DC with our votes in November. Armed Democrats"}]
