[{"comment_id":"629211877227588","commenter_b":"If you were born to an married father who was a citizen of the US, I'm pretty sure you're a natural born american, until and unless you and/or your parents renounce it.","commenter_a":"Being a naturalized citizen is not the same as being a natural BORN citizen. I'm a naturalized citizen, born in the UK to a British mother and an American father. I am not a natural born citizen and would not be eligible to run for President. How did he ever get in this race to begin with?","post_message":"It's like a circular firing squad!"},{"comment_id":"10156281148690725","commenter_b":"The wife knew what was going on","commenter_a":"The non-profit has rules and he \"didn't follow them\" (I guess) so the family should return it. 100 Club should learn by this mistake and not give out money till the ruling is over...Everyone expect the family to put a \"Go-Fund-Me\" page up soon :/","post_message":"An organization that helps the families of officers during times of need is now asking for the substantial donations made to the loved ones of Lt. Joe Gliniewicz to be returned ----> @webpagelink"},{"comment_id":"597418893776211","commenter_b":"@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"944173558951399","commenter_b":"Every thing that man spoke is true. Leave lady","commenter_a":"Muslim people you live in the United States . Take that f--king towel off your face . Your weak minded people . With no chance to Evolve , your stupid religion holds you back . Just get out of are country . So we can bomb you and get rid of you ! .","post_message":"A Muslim woman confronted a female cashier about her flag pin... What happened next is going VIRAL!"},{"comment_id":"10156857801965093","commenter_b":"Who will women vote for if Trump and Clinton are both running in the Fall?","commenter_a":"Maybe America have more young vaginas thann old vaginas!","post_message":"It's hard to believe America's first female Presidential front-runner is doing THIS badly among women."},{"comment_id":"10152746450450326","commenter_b":"They are the real terrorists. They need to be stopped.","commenter_a":"Why should they have anything to say about what we do... We don't tell these evil men what to do.","post_message":""},{"comment_id":"828345383930736","commenter_b":"Yes and NO Muslim country is taking ANY refugees!","commenter_a":"I find the hateful, negative comments sad. What is perhaps even sadder, is that I am not surprised by the terrible comments. They are offering to do something kind and selfless.","post_message":"More than 11,000 Icelanders have offered to take Syrian refugees into their homes."}]
