[{"comment_id":"10153858711711162","commenter_b":"Hell Indianapolis too","commenter_a":"They would get killed in da Chi anyways","post_message":"Illinois will stop accepting Syrian refugees in wake of the Paris Attacks... @webpagelink"},{"comment_id":"10153478052978984","commenter_b":"This girl is one ignorant PIG !!","commenter_a":"This spoiled brat is headed down the same road as Brittny and Lindsey. She needs prayers not publicity.","post_message":"Pop star Miley Cyrus just said something highly disturbing about Christians. It's especially sad when you consider where she came from..."},{"comment_id":"1359337234126021","commenter_b":"Kids learn this behaviour. Violence/bullying maybe the norm in their households. Young bullies grow into big bullies unless they are dealt with","commenter_a":"Ban kicking , feet and bullying","post_message":"All because he stepped in to defend an autistic friend. Shocking."},{"comment_id":"10153982977694411","commenter_b":"This old bitch is an asswhole ..am sure you are having sex with your boy aren't you?","commenter_a":"go the hell home.. you are nothing but a bunch of bitchers, bellyachers.. shut up and get a life.. stop moaning and groaning and playing the pity card.. there's millions around the world that are worse off than you are.. keep moving until you find where it is Allah wants you.. dang.. are you all stupid ignorant imbeciles? can any Muslims think for themselves or do they all wait on what their God Allah/Poop Francis says.. rub your rosary beads and pray 5 times aday towards Mecca or better yet go there and shut the hell up.. freaks.","post_message":"'We were just standing outside and we all just started coughing and our eyes were burning. We were really confused about what was going on'"},{"comment_id":"1033509070100318","commenter_b":"@username yes you god damn do! Women throw sex parties and drink alcohol through dick straws for Christ sake! Most women are guilty of cheating at some point in their life. That's what we as a species do, we eat and have sex. Like or hate it, men hunt for women and women love it","commenter_a":"I find it very sad that WOMEN are defending it, what the fuck is wrong with you? I'm sorry you feel that you should allow a man to have his way with you. It's sickening.","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"10153092045117756","commenter_b":"there is no place around here seems like most females prefer dating sites i think","commenter_a":"screw dating sites they dont work","post_message":""},{"comment_id":"525940174197243","commenter_b":"And that is why we need to vote for Trump...with Cruz you will get an open southern border and amnesty.","commenter_a":"No vote for Cruz, he is a politician, just cannot trust politicians democrat or republican. Politicians will tell you anything to get you to vote for them, they get into office and do not follow thru.","post_message":"Agree or disagree?"}]
