[{"comment_id":"1155777891187482","commenter_b":"Clear to me this woman is smarter than you will ever be.","commenter_a":"This woman is a mercenary. She has no morals, ethics or integrity. Just a few months ago when she was on Ted Cruz' team she was bashing Trump for all the things that she is now defending him. She would say just about anything for a buck.","post_message":"Reports about Kellyanne Conway are greatly exaggerated."},{"comment_id":"821129384591070","commenter_b":"Big whoop. The lady could sneeze, and the Left would twist it into a controversy!","commenter_a":"Some people are just so unhappy in their own lives they have to try and make others just as miserable. Get over yourself and get a REAL life!","post_message":"Sarah Palin kicks off 2015 with a little controversy..."},{"comment_id":"1127007594082684","commenter_b":"Hell yes, round em up & send em back in those pink boxers.","commenter_a":"HE 's the best man for the job","post_message":"ClashDaily.com"},{"comment_id":"907616379294892","commenter_b":"More crickets!","commenter_a":"She really doesn't have a chance this time, way to old and way to much baggage , All you la las might want to take a look at her record , do some research and vote for someone qualified instead of following the sheep.","post_message":"Kelly was one of the lucky moms who got a Mother's Day surprise to remember: a call from Hillary."},{"comment_id":"10156026923975354","commenter_b":"She makes me sick .","commenter_a":"Sadly, the low information voters, which seems like 70% of the populace today, buys her act hook, line and sinker...Then again, if she is so naive about servers and cell phones, who on earth wants this dimwit in the White House (again)...","post_message":"A reporter asked if she had attempted to “wipe” her server. She replied, “What, like, with a cloth or something?” And she didn't stop there..."},{"comment_id":"1263441190347909","commenter_b":"Exiguimos la Cabeza de Juan Manuel Santos Calderon Presidente Eunuco de Colombia, Denodado Comandante santiago de las Farc, lo mismo que de los Altos mandos de las Fuerzas armadas por traidores y por aceptar el soborno del Gobinero Naco terrorista Criminals de Santos y su Asquerosa Estirpe. Esto es lo que dir un honesto y verdadero Jefe de estado. Los Colombianos pueden tener la tranquilidad que sea cual sea su elecci en el plebiscito, estar seguros porque las fuerzas del Estado no se doblegar y se han fortalecido\" No lo que dijo Santos? Emisario de FARC y Presidente de los narco terroristas genocidas de las Farc. est preparadas para guerra urbana si se cae proceso: La mas asquerosa extorsion y amenaza a los Ciudadanos. Justicia Verdad Patria o Vida.","commenter_a":"Senator, please oppose any and all gun control propsed by the Democrats. They simply want to disarm the American people to suit their own separate agenda.","post_message":"Today, Senator Nelson and I urged the U.S. Small Business Administration (SBA) to provide assistance to the small businesses in the Orlando area that have been closed off to the public in the aftermath of the Orlando attacks. In a letter to SBA Administrator Maria Contreras-Sweet, we requested assistance to the affected businesses, such as disaster relief loans. Read the letter here: @webpagelink"},{"comment_id":"10152874216906336","commenter_b":"Were the idiots of man that let these people in the country there should be bought to trail as well","commenter_a":"When will we as a human race stand up to the immoral acts of the few. Doesn't matter where your from. We need to stand together to eradicate scum..","post_message":"PHOTO OF THE DAY: Hundreds of thousands of people marched in solidarity across France Saturday to denounce this week’s terror attacks in Paris and to honor the victims."}]
