[{"comment_id":"10156393524070389","commenter_b":"Isis , of course,climate change is a myth! It gives obama something to talk about beside the real problem, his muslim brothers.","commenter_a":"Odummy is the Threat!!!!!!!!!!","post_message":"Question of the Day: Which do you think is a bigger threat: Climate change or ISIS?"},{"comment_id":"1406868092703665","commenter_b":"Get back here with my food mother fucker!","commenter_a":"Christopher. Stop allowing the americans access!","post_message":"Does the US government want a war with Russia?"},{"comment_id":"1149773515076812","commenter_b":"Hillary should be in prison.","commenter_a":"Intelligent much??? I heard she said he was like an octopus...with six arms...omg","post_message":"OOPS! HILLARY'S HIT WOMAN LIED About Trump Groping Her…Eye-Witness Comes Forward: \"It was she that was the one being flirtatious”"},{"comment_id":"10153389055716770","commenter_b":"Wow is she stupid or what. Racist pig.","commenter_a":"Sure we can play with a bad bad boy and you will get bad results","post_message":"A CNN guest argued that her ex-CIA panel-mate was unqualified to talk about ISIS because he's white."},{"comment_id":"947484675311281","commenter_b":"This is why so many people are against Muslims. I've sat and ate meals with people from all over the world with differnt faiths and never had a cross word. It's all about give and take yet some Muslims can't grasp the idea of peace and harmony. The reason why they all want to come to England and screw our little island up is the free hand outs. VOTE UKIP and maybe we can stamp the minority out and make it harder for these people to enter our island.","commenter_a":"This not surprising. What surprising is he is not in jail for what he just said.","post_message":"Sean Hannity: 'You want her to die!?'"},{"comment_id":"10153944195789456","commenter_b":"Wht a woman will do against their children over a man. Smfh","commenter_a":"They should be stoned to death!! Wasting bullets on them is too humane....","post_message":"HORRIBLE: A 3-year-old was found duct taped in a trash bag in a closet in Arizona, and was surrounded by feces. Here’s the disgusting reason the suspect allegedly hid the child:"},{"comment_id":"10157214530105615","commenter_b":"Now if Rupert Murdoch could just croak and leave us all alone, particularly National Geographic...","commenter_a":"40 million to leave?","post_message":"BREAKING – Maybe now Americans can have their country back... Best thing to happen to America in years!"}]
