[{"comment_id":"719541998236378","commenter_b":"Happy birthday keesh!!!? Love you and am so proud of all of you Guy's","commenter_a":"40,000 likes, is that going to help?","post_message":"Putin is firing on all fronts after news of a Russian plane being shot down. Russia is doing good work. Can we get 40,000 ‘LIKES’ for Putin bombing Syria?"},{"comment_id":"10152901034836636","commenter_b":"Karina a poopoo head","commenter_a":"Great! Don't terrorize kids! Be the adult. Do your job and treat everyone equally. Don't only attack the black kids.","post_message":"This just in: That Texas officer videotaped outside an pool party has reportedly stepped down from the police force."},{"comment_id":"10155779429195389","commenter_b":"Yep all she would be is loose end","commenter_a":"She is a real winner, did she think she was gonna hook up with these guys? All she would be is a witness, I cannot fathom how stupid some people are!","post_message":"BREAKING NEWS: New York state prison employee Joyce Mitchell has been arrested on felony charges for providing material assistance to prison escapees, state police say. @webpagelink"},{"comment_id":"10152676681972507","commenter_b":"Not to mention that anti-semitic statements are illegal in France.","commenter_a":"In France you pick up 8 year old kids for what they said in school. I don't care how nationalistic you can get over this, this shows the French authorities are massive hypocrites when it comes to 'Freedom of 'Speech.","post_message":"He's 8."},{"comment_id":"618134845039685","commenter_b":"It's about time, defund them and get them out of the country.","commenter_a":"Make it so! Move this anti-American institution offshore!","post_message":"Have Obama and the UN finally gone too far?"},{"comment_id":"1592202987743626","commenter_b":"She needs to go to jail and pay a Big big fine to get back some of those illegal millions she got","commenter_a":"anyone following trump is b😀😀 tshit car cra !!!!!!","post_message":"\"I think [Hillary Clinton's] greatest accomplishment will be getting out of her email scandal.\" — Donald J. Trump @webpagelink"},{"comment_id":"10153454779861336","commenter_b":"If Mexicans went they would no longer be illegal aliens. They'd be going home.","commenter_a":"I didn't know NASA was racist theres no black astronauts on the list!","post_message":"NASA - National Aeronautics and Space Administration has named the four astronauts who will fly on capsules built by private companies — SpaceX and Boeing."}]
