[{"comment_id":"10153478960668984","commenter_b":"Shows what kinda person she is, she throws her own Dad under the Bus,, Classy, dirt bag.","commenter_a":"They say the acorn doesn't fall from the tree","post_message":"Mosby has made it widely known that she comes from a long line of police officers, but this admission reveals a very different look into her background..."},{"comment_id":"10153643322467434","commenter_b":"@username, I am an actress...I can rip you apart in iambic pentameter. Words do matter and so do definitions. In order for RAPE to occur, SEX has to happen...or it is considered MOLESTATION...","commenter_a":"Wow...semantics. Yes, Brock Turner DID have sexual relations...or else he couldn't have RAPED her. Sex is kind of a requirement...the headline does NOT say \"consensual\". #GoodGrief","post_message":"Just because the law smiled upon a man who had sex with an unconscious woman behind a dumpster doesn’t mean this group of angry, armed protesters will do the same."},{"comment_id":"10158299454390206","commenter_b":"Then get the hell out.","commenter_a":"I will pay for the firing squad bullets! Now.","post_message":"Chelsea bombing suspect is apparently a United States-hating homophobe @webpagelink"},{"comment_id":"558632694347761","commenter_b":"Oh Karen, you drank the Kool-Aid!","commenter_a":"Clinton News Network is the Communist News Network! Suppressing the american people and the truth and shutting down live feed the minute anyone mentions anything negative about your Wicked Queen is disgraceful! Your network is just as bad as the National Inquirer with fake reporting! You continue to try and brainwash americans into believing the left wing propaganda. News Flash...millions of americans are starting to use their own brains, which you can no longer control! Continue to cheer for Killary, because you're proving to the american people that your network is as crooked as she is!","post_message":"“There’s no quote. You’re not gonna find a quote from me,” Donald J. Trump told Hillary Clinton. Well, we found a few. Watch 4 of Trump's statements from the debate stage that don't seem to match up with what he previously said @webpagelink"},{"comment_id":"1029438293779366","commenter_b":"Keep Bill away from those girls Hillary!! You know he acts around other girls!!","commenter_a":"The next Americans president and expected cabinet members came 2015","post_message":"On the set of Broad City season 3 with Abbi, Ilana and Amy! #yas"},{"comment_id":"1708500929417584","commenter_b":"My native American vote for Trump Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not stirring a race war. Trump did not leave any US soldiers in Benghazzi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion dollars. ...","commenter_a":"Trump is the worst person in the world.","post_message":"Unfortunately - when some people do not like what they hear, they have a tendency to smear the facts. As your next President of the United States of America - you will be proud of your leadership in Washington, D.C. - and know that our best interests will be for you, the AMERICAN PEOPLE. WE will be WORKING FOR YOU!"},{"comment_id":"10153985778706955","commenter_b":"@username Cruz will never get my vote ever. So?","commenter_a":"I will never support Ted Cruz, never! #NeverCruz","post_message":"Cruz Still Faces Daunting Math After Win in Wisconsin..."}]
