[{"comment_id":"10150849465384999","commenter_b":"Canada only lets rich Asians in obsessed with money!","commenter_a":"Keep letting Hordes of Immigrants into Europe!!!...Same goes for the U.S. of A., Canada & Australia!!!","post_message":"Victims of the terror attack on Bastille Day were honored on Friday in Nice, Paris, Rome, New York and Moscow."},{"comment_id":"1757028301196802","commenter_b":"@username more than likely you are a illegal alien .","commenter_a":"Just the thought of having a mother/grandmother in the highest office..refreshing! Go Hillary! Have a great day with your wonderful family!","post_message":"Happy Mother's Day to Charlotte's mom, and my wonderful daughter, Chelsea Clinton."},{"comment_id":"10153945489322522","commenter_b":"And more illegal aliens in states Trump won","commenter_a":"If the electoral College didn't exist. There would be no need to campaign outside of New York and California. The election is over. The results are in. Clinton conceded. Trump won. Move on. If America really wanted to elect Clinton, perhaps more Americans should have voted!","post_message":"It's official:"},{"comment_id":"10153928566951943","commenter_b":"she's a LYING PIG!!!!","commenter_a":"Bull!!!! They should all have to answer all questions. STOP the cover-up's, the crap, just get the truth out. Put this Liar, Thief, Murderer, traitor in prison where she belongs, and ALL that knew about her doings and didn't do anything to prevent it, or knew of it afterwards, and buried their heads in the sand. ENOUGH IS ENOUGH !!!","post_message":"Senior Hillary Clinton aide Cheryl Mills and her lawyer walked out of a recent interview with the FBI about Clinton's private email system after an investigator asked a question Mills believed to be off limits, according to a published report. - via Fox News"},{"comment_id":"10154865590730329","commenter_b":"Yey!! 69 for the win!! Lemme eat dat booty too girl!","commenter_a":"All you dick suckers out there are appreciated. Just remember that. Thank you so much.","post_message":"\"Honey, they don't call it a job for nothing.\""},{"comment_id":"10154539572188433","commenter_b":"@username ignores taped audio/video proof if it exposes negative info about Killary!","commenter_a":"I don't understand how Drumpf can stand up in front of the American people and continue spewing his blatant lies. He should know that he can't get away with it. If he doesn't, he's no more intelligent than his dumb deplorable supporters.","post_message":"In an attempt to defend his recently linked offensive comments, Trump claimed Clinton laughed at a 12-year-old rape victim. False. @webpagelink"},{"comment_id":"10153804113241770","commenter_b":"Wasn't it Hillary yesterday stating that she has always been in favor of strong vetting of refugees? Obviously she sees which way the wind is blowing on that issue, so she's trying to get onboard. Wish she and Obama had been in favor of that when they started letting this evil, diseased crap into the country by the tens of thousands.","commenter_a":"I've always been amused at the people who say you shouldn't profile. But EVERYONE does it on a daily basis. That's a bit of reality for you... Yes to profiling, more stop and frisk.","post_message":"Republican presidential nominee Donald Trump called for profiling techniques to combat U.S. domestic terrorism threats during an appearance on Fox News Monday."}]
