[{"comment_id":"10153811495701316","commenter_b":"God's will & Grace","commenter_a":"Corrine Amin","post_message":"There's a time for everything."},{"comment_id":"1118758671477300","commenter_b":"Illegal immigration is what Americans are against Trump for president 2016 !!!","commenter_a":"Biden doesn't speak Spanish either. I bet he had a huge crowd","post_message":"Joe Biden went to Mexico on Friday and delivered a clear message: The views of Trump absolutely do not represent the views of most Americans. Do you agree with the VP?"},{"comment_id":"10153625218767464","commenter_b":"That was their land. The other middle eastern countries opened their jails and put those people there to taunt Israel. Know your history if you're going to insult a Nation using their systemic slaughter as a punch line.","commenter_a":"The genocide of the Jews does not justify hem killing the Palestinians. What's the difference between a cow and the Holocaust? You can't milk a cow for 70 years.","post_message":"I'm proud to stand with PM Benjamin Netanyahu - בנימין נתניהו and the nation of Israel. LIKE if you are too!"},{"comment_id":"10153147518933984","commenter_b":"This guy must be screwing oshithead or he wouldn't get so mad.If he loves illegals so much he needs to go live with the scum.If the illegals get into our country,crime will run rampant.","commenter_a":"Vote the asshole out next term.","post_message":"Who does he think he is to make these kinds of threats?"},{"comment_id":"1191420990909535","commenter_b":"Really??? I use my pants to hide this dick!!!!","commenter_a":"I'm sorry","post_message":"Military intelligence... isn't. ~Will"},{"comment_id":"1137553239588633","commenter_b":"I will not vote for Hi$$ary under any circumstances in November. It will not come to that because Bernie will win as he has the people behind him. They have done everything to suppress Bernie but they will fail. If she steals the nomination with the help of the corrupt DNC and the corporate media then please do as I and many other liberal progressives and take the Bernie or bust pledge. It is way past voting for the lesser of two evils. I refuse to be bullied into supporting her when I know that she is basically a GOP lite and if she is nominated we will lose. I will not help her and my vote is not for sale. So if it ever comes to that, I will cast my vote proudly in November for the only candidate that supports me - Bernie Sanders . I will do ...","commenter_a":"I'm not voting for Bernie as much as I like him only because I'm afraid it will be wasted. He's great but I don't believe he'll be elected. I'm going to lose it if Trump gets in","post_message":""},{"comment_id":"1128370543896366","commenter_b":"Girl quiet !!","commenter_a":"When I would sneak in food for you while you hid your pregnancy with jayden from my parents. Jacqueline Carranza 😂😂 #iGotChu","post_message":"Sibling goals!"}]
