[{"comment_id":"10152991512942377","commenter_b":"She broke the law just by living too long","commenter_a":"Do not pass go, do not collect $200M","post_message":"Hillary says she never received classified emails on her personal server. Do you believe her?"},{"comment_id":"1596151633736175","commenter_b":"This is what happens when their is no understanding of the real threat. Neither Iran or North Korea pose as large a threat as Climate Change. Not belief, understanding.","commenter_a":"Climate change does not matter to me North Korea and Iran want to destroy us probably a more urgent matter?","post_message":"Twenty-one kids and climate scientist James Hansen sued the Obama administration to take more aggressive action on climate. As of Thursday, the climate-change-denying 45th president has inherited the case."},{"comment_id":"480289475501690","commenter_b":"Read thru all the comments before insinuating, fucking bitch","commenter_a":"What about womens rights? What about the Muslim teens who made a mistake? Or the children & women getting raped? What about the women who are clearly not mentally capable of handling pregnancy or a baby? Id rather an aborted baby than a murdered baby left in the dumpster.","post_message":"The bill has been called the first of its kind in the nation:"},{"comment_id":"10153278015134575","commenter_b":":) Exactly","commenter_a":"If you're going to do BUSINESS in a free society that is supposed to separate religious beliefs from law of the land then we must require you to be tolerant & serve anyone & everyone who walks through your doors. (Remember? Separation of church & state? One of our country's founding principles?) Besides-supporting intolerance & bigotry is an abuse of the word Christian. Jesus would not turn anyone away.","post_message":"\"If a gay couple was to come and they wanted us to bring pizzas to their wedding, we'd have to say no.\" An Indiana pizzeria finds itself at the center of the debate over the state's religious freedom law."},{"comment_id":"10154716616787908","commenter_b":"It looks like GE is moving part of it's head quarters to Boston, since Boston will give them a $25 million dollar tax break! It's all about the deal! I'm told that what they're giving back is just a drop in the bucket compared to what they'll get. We're so lucky!","commenter_a":"Yes BERNIE Yeeeeees","post_message":"I didn’t hear the head of GE and all these CEOs who ship jobs to China asking the Chinese for a bailout check in 2008. Instead, after laying off American workers they came begging the American taxpayers for a bailout."},{"comment_id":"10152918950086336","commenter_b":"What a doll!","commenter_a":"What a cutie and smart too!","post_message":"An incredibly brave 4-year-old girl is being credited with saving her pregnant mother who suffered a seizure and couldn't reach the phone."},{"comment_id":"849566101841798","commenter_b":"Ignore Spenser Jeffery, he's bankrupt, c);-)","commenter_a":"God Bless this wonderful man! God bless his family and many friends. You truly lost a good man. Prayers and all the respect in the world to him and his family!! Please holy father, take this wonderful soul into your loving arms, amen and amen.","post_message":"\"I swear to God I love this city but I wonder if this city loves me,\" slain officer Montrell Jackson wrote on Facebook earlier this month."}]
