[{"comment_id":"1753089554908587","commenter_b":"Race has nothing to do with him being a dumbass.","commenter_a":"and he owes over 10.000.000 to creditors in US","post_message":"Kanye West is finally leaving. Thank the lord. We don't want him anyway. Can we get 5,000 'LIKES' to have Kanye leave for good!"},{"comment_id":"10154043389689411","commenter_b":"well.... you can still get it from my throat and eat it eh? #NoWaste Stop world hunger lel","commenter_a":"Robert Pavle Dulić how my life will die prob. lel","post_message":"His last words were 'Watch this'"},{"comment_id":"10154180485564411","commenter_b":"Here illegally? They should hide.","commenter_a":"Most criminals try to hide. Live in fear!","post_message":"Immigrant rights activists call it the Effect."},{"comment_id":"1191081784242503","commenter_b":"Can't we just put her in jail already?","commenter_a":"Ostensibly, this woman is a public servant whose salary is taxpayer funded. Her bigotry is flagrant and she has chosen to behave in a lawless manner and not serve the public. She is not adhering to her job description and thus is to be held accountable, as are those in the County and Republican Legislature who are condoning this assault on civil rights. Therefore, she, County administrators, and the Legislature need to be served with a large lawsuit.","post_message":""},{"comment_id":"10152729868175667","commenter_b":"Oh calm yer tits..it's just fun","commenter_a":"I may stop following USA Today because of this specific post. The guy isn't even old enough to run and you're reporting it like its important, which just means you made a joke out of yourself.","post_message":"President Flame would be a pretty epic name. Just saying."},{"comment_id":"10154233578003352","commenter_b":"Right! Stupid lady. No man is worth that.","commenter_a":"Here we go again....... The Childs mother is dead, the side chick is going to Jail and the Man is sleeping with a New Woman TONIGHT. IJS.","post_message":"Woman Allegedly Murdered Boyfriend’s Baby Mother Because He Got Her A Valentine's Gift!"},{"comment_id":"874546065914187","commenter_b":"Buy a boat move in land !","commenter_a":"Not just act, but act urgently. Right now, it's all but inevitable that there will be some serious sea level rise from melting glaciers over land.","post_message":"Barack Obama is right. It's time to act. Like ATTN: for coverage of climate change and the environment."}]
