[{"comment_id":"1002924903097372","commenter_b":"Sad part is there are a lot of people in denial and they will actually vote for this idiot woman","commenter_a":"All today has shown America is that @username will make an outstanding president and that the Republicans are vindictive liars. The Republicans have admitted to spending over 4.5 million dollars of taxpayers money to fund a \"witch hunt\" designed solely to discredit Secretary Clinton and take down her poll numbers. They have confessed to this.","post_message":"Hillary has been testifying at the House Select Committee on Benghazi for hours, and what have we learned? That she was a Secretary of State devoted to upholding our nation's values abroad, practicing smart foreign policy, and keeping our diplomats as safe as possible. Add your name to say you're with her: hrc.io/201PFma"},{"comment_id":"10152995708842217","commenter_b":"Really perhaps one glass too many some would say Suspicious.....","commenter_a":"Aww 😢💔 poor Cilla..","post_message":"She was sunbathing at her Spanish home when she she stood up, lost her balance and fell"},{"comment_id":"999119110145234","commenter_b":"I like the term \"political whores\". Appropriate. They were all PAID millions of dollars by Monsanto to vote this way. (I suspect this is just the tip of the iceberg.) We should throw them all out and start over.","commenter_a":"I'm very against genetically modified foods, but the fda is supposed to be a small little entity. They aren't supposed to tell me what to eat. You guys are cutting off your noses to spite your face, and until you are willing to look at both sides of the argument and find the truth, you might as well just keep eating it like the little sheep you are.","post_message":"Despite the fact that some polls show that up to 95 percent of the American people want foods that contain genetically modified organisms to be labeled, there are a lot of politicians that don't seem to agree. Here's who they are:"},{"comment_id":"10152600779162217","commenter_b":"How is it funny how we'll let an aeroplane be controlled by a computer, when we all know of the very high general standard of trained pilots we have flying our passenger aeroplanes who are there too? Just thought I'd point out one of the stupidest thing I've ever heard.","commenter_a":"I didn't think it would be long before we had driverless cars. I am a terrible driver so this would suit me right down to the ground.","post_message":"Driverless pods, set to hit the streets of UK cities, are unveiled for the first time. Would you be able to relax and trust technology to take you for a ride? @webpagelink"},{"comment_id":"10155547019200389","commenter_b":"Once again jay you are incorrect as Cheney resigned from Hali when he became VP. As you say google it","commenter_a":"We need to do the same with Bush and Chaney for the Iraq war","post_message":"Egyptian criminal court sentenced ousted Islamist President Mohammed Morsi to 20 years in prison on charges linked to the killing of protesters in 2012."},{"comment_id":"10158129645930015","commenter_b":"We don't want a wall.","commenter_a":"I live in mexico , but do you know that all the money invested on that stupid wall , it will come out from your pocket , American taxpayer will pay for that wall ,not us, we ain't paying that thing, we have bigger problemas than that ,good luck with your wall","post_message":"Do you support a border wall with Mexico?"},{"comment_id":"10154990936431600","commenter_b":"#KeepWadeBitches","commenter_a":"bad choice in a head coach, Elway must be smoking weed","post_message":"What do you think Denver Broncos fans?"}]
