[{"comment_id":"1275842862475459","commenter_b":"Might have to tell family to leave Italy and come here as refugees","commenter_a":"You don't have to be a genius to see that's happening now. Send them all to the middle east","post_message":"EU admit immigration will destroy European values"},{"comment_id":"10153547862267894","commenter_b":"This bitch cant act bye","commenter_a":"I think Nene should focus on her acting career. I enjoyed just having her pop up on a few episodes as a guest and not a wife.","post_message":"NeNe Leakes Reportedly Offered $2.5 MILLION to Return to ‘The Real Housewives of Atlanta’"},{"comment_id":"10153707771213598","commenter_b":"Oh wow, so I guess she never felt them moving around in there for the last FOUR months of her pregnancies. That was probably a monkey or a frog moving around in there. Right. Stupid, evil excuse for a woman.","commenter_a":"Her remarks don't make a bit of sense. What in the world she thought was growing in her body got 9 months, and she is swelling and gaming weight, etc. did any of her babies kick and move around? Was she skinny when her children were born? She just instantly gave birth to a baby out of the blue! Wow! Just plain stupid.","post_message":"Planned Parenthood President: My Childrens’ Lives Began at Delivery, Not Conception"},{"comment_id":"10156809440295725","commenter_b":"Time to get tough with these vermin muzzies. We need to kill them before they kill us. Wake up, America, this is not CandyLand anymore.","commenter_a":"It is time! We have been too relaxed on this matter for too long. It is not that we do not love and welcome diversity and other nationalities and cultures into the amazing USA; however, we must have order and we must have processes in place to be proactive rather than reactive about our safety. We must take care of the people in our country first and then use the wealth that those resources will bring to help others throughout. My mother always said, if you cannot take care of yourself first, you cannot take care of anyone else and that simple advice applies here greatly.","post_message":"As president- I would be very, very tough on the borders, and I would NOT be allowing certain people to come into this country without absolute perfect documentation!"},{"comment_id":"10153831710401509","commenter_b":"OMG !!!! GET OFF HER BACK, people get suntaned without a hassle !","commenter_a":"ENOUGH!!","post_message":"Paula Deen has some \"explaining\" to do: @webpagelink"},{"comment_id":"10155290808369657","commenter_b":"How can you support Hillary who betrays our Country lies and cheats and breaks the law each day. Hillary who.doesnt defend our Cpuntry our peopke and wants to open our borders and let terrorist enyer our Country freely as they chant death to America. Hillary qho breaks security and shares top secret Information and endangers our Military andCpuntrys and helps arms Isis ?How would anybpdy think its ok to support a lieimg cheating crinal who should be hung for Treason against America be elected President with all the oiruption and criminal acts Hillary has committed. Seems you should be glad to Vote for Mr Trump as he is good american will make a great president.","commenter_a":"So another mindless elected person. stupid is as stupid does","post_message":""},{"comment_id":"10156663817835294","commenter_b":"That nasty women needs mandatory life in prison. Piece of garbage","commenter_a":"She didn't give the baby up! She left it in the toilet to die. That's not surrendering that poor baby.","post_message":"The police are releasing the photo and the video to bring awareness to California’s safe surrender law, which allows any newborn under 72 hours old to be surrendered without criminal charges."}]
