[{"comment_id":"10156946907525389","commenter_b":"@username you are just a hater. Stop disrespecting people specially Muslims.","commenter_a":"Love this man!","post_message":"\"Why didn't she say, 'Hey, make better lifestyle choices?' If you want to join something, why don't you join a church, why don't you join the Boy Scouts or the Girl Scouts?\" Milwaukee County Sheriff David A. Clarke Jr criticized Hillary Clinton's comment on joining \"positive gangs.\" @webpagelink"},{"comment_id":"10152793900772452","commenter_b":"Bad women drivers! ;)","commenter_a":"Who the hell runs over a motorcyclist and does not have a clue that they hit someone????! Thank god the other drivers made her stop FINALLY!!!","post_message":"The dramatic rescue of a motorcyclist who had been dragged underneath a truck on the eastbound 91 Freeway was caught on video. abc7.la/1EK2HcY The video was submitted to Eyewitness News by viewer Byron Holeman who used the #ABC7Eyewitness."},{"comment_id":"594779170700056","commenter_b":"Really bitch.💤💤💤💤💤🖕🏻","commenter_a":"Sick and tired of her ignorance","post_message":"Anti-Cop Black Panther Party Supporter Beyonce: \"Stop Killing Us\""},{"comment_id":"10153106076119255","commenter_b":"We have so many publications on both side that are mudslingers with out facts--about time both sides clean up their act and print thing to promote and support","commenter_a":"@username only wants to stir the pot recently!","post_message":"They were insiders. Home grown. Godly. Our neighbors, friends, and kin. People like us. By Bill Moyers"},{"comment_id":"1311796595543533","commenter_b":"#DontBoo #VoteHillary #NastyWomenVote","commenter_a":"we are not going backward, we are going forward , Best of luck The world President @username \"I am sick and tired of the negative, dark, divisive, dangerous vision and behaviour of people who support Donald J. Trump","post_message":"Don’t miss out! Join them: hillaryclinton.com/makeaplan"},{"comment_id":"1384025364955130","commenter_b":"Good god what a shit show........our nations democracy is at risk..ELECTORS DO YOUR JOB AND PROTECT AMERICANS FROM THEMSELVES","commenter_a":"Oh brother....","post_message":"Conway again defending one of Trump's intolerably dangerous views."},{"comment_id":"1708500929417584","commenter_b":"My native American vote for Trump Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not stirring a race war. Trump did not leave any US soldiers in Benghazzi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion dollars. ...","commenter_a":"Trump is the worst person in the world.","post_message":"Unfortunately - when some people do not like what they hear, they have a tendency to smear the facts. As your next President of the United States of America - you will be proud of your leadership in Washington, D.C. - and know that our best interests will be for you, the AMERICAN PEOPLE. WE will be WORKING FOR YOU!"}]
