[{"comment_id":"491909840999596","commenter_b":"These are dangerous ragheads. I say,get them out if our country","commenter_a":"They want muslims areas fine we should have MORE NON-muslims areas!","post_message":"A Texas shopping center posted a sign that have Muslims outraged. It's about time someone stood up to them, we support them. Do you support their stand against Muslims?"},{"comment_id":"1428416493869569","commenter_b":"She, that was a woman officer","commenter_a":"watched the video again lucky nobody was shot what people need to remember officers have a family too they want to go home in one piece he should have drawn his weapon but he still would have been the bad white cop","post_message":"MUST WATCH: Two people face assault charges following a wild brawl with a police officer in Nashville."},{"comment_id":"519056438282649","commenter_b":"cair can go to hell","commenter_a":"Our country. .USA..AMERICA","post_message":"PLEASE SHARE AND HELP PROTECT OUR VETERANS!"},{"comment_id":"10154997987663812","commenter_b":"@username Lie cheat and delete.","commenter_a":"What are the successes? Stealing millions via the ClintonFoundation? Seriously what has she done in 30 years?? Name three things, that's 1 per decade","post_message":"Hillary Clinton's message to young Americans and young girls in particular: \"Never doubt that you are valuable and powerful and deserving of every chance and opportunity in the world.\" @webpagelink #Election2016"},{"comment_id":"1356943270993679","commenter_b":"Take away about 15-20 million illegal immigrants and where are you? Be careful what you wish for.","commenter_a":"Yet, those \"islands\" hold the majority of the population... which will continue to increase as urbanization increases. You can play spatial games with maps all you want, but the reality is, our country should be predicated on the idea of one person, one vote (equal representation).","post_message":"This is actually a very informative map."},{"comment_id":"485555318301715","commenter_b":"All muslims need exterminated","commenter_a":"That will be a good time to take more out they will be together","post_message":"Gunman accused of hate crime in slaying of three Muslim students. Brace yourself, more race riots to come as angry Muslims prepare to march. Should all race rioters be wiped out?"},{"comment_id":"1773052759611713","commenter_b":"Rosemary cant even spell.....","commenter_a":"To the ones claiming that the \"media picks him apart\", news flash guys... the media doesn't have to do anything! Every time he opens his mouth terrible things come out, its not the media, its him!","post_message":"Donald J. Trump and his aides refused to allow reporters to travel with him to D.C. yesterday, breaking decades of traditional press protocol and setting a new precedent for coverage of his administration."}]
