[{"comment_id":"1799169303666092","commenter_b":"I'm still waiting to hear how sexual relations not involving vaginal Intercourse is not responsible and can't prevent pregnancy if you aren't ready for a child. Allllll ears, lol. Time to find a safe place for you, you can't handle the truth.","commenter_a":"I am 66 years old and I am sick and tired of old white men trying to rule my reproductive life and that of my daughter, and now of my granddaughter. NOT ON MY WATCH.","post_message":"Do you agree with Rachel Maddow? We definitely do."},{"comment_id":"858797117508627","commenter_b":"& the rich bastards don't give a shite.","commenter_a":"rockthevote.com","post_message":"Unless we take bold action to address climate change, our children, grandchildren and great-grandchildren are going to look back on this period in history and ask a very simple question: Where were they?"},{"comment_id":"873396172789454","commenter_b":"Taking our RIGHTS to to fulfill your agenda is not going to happen. Do you have armed security? I bet if a person walked in and brandished a weapon he/she would be taken out by a person you hired or are in connection with you and your party that is wielding a gun. You would say its protection...... We say the same thing.... It is for Protection.... While you want to make guns illegal for law abiding citizens to obtain, you will only make it Illegal to own them. Causing a bigger issue for some. People will always have guns. Ask a Drug dealer if they have issues getting illegal drugs.... NOPE. they will straight laugh at you. All you are doing is wasting taxpayer money and time. If you want to make change, ban together to reform Immigration to be fair and swift, Vote laws to tax churches to ...","commenter_a":"Real action","post_message":""},{"comment_id":"10156742886720354","commenter_b":"Maybe they will accept the migrants destined for the USA.","commenter_a":"Good luck. You can have ours tooo","post_message":"The government of Canada has ordered its military to draw up plans for migrant camps that will allow more than 6,000 Muslims to be housed on a long-term basis at several Canadian Forces Bases...."},{"comment_id":"10152740103222507","commenter_b":"Have female genitals, potential prostitute","commenter_a":"Carry a gun....potential murderer. You won't be laughing when you child or grandchild gets killed","post_message":"Disturbed thinking."},{"comment_id":"10154525720961323","commenter_b":"@username: \"In any case, the only way to deal with migration is to recognise what really causes it (inequality, proxy wars, global warming you name it) and to start coming up with responsible and honest solutions rather than shutting yourself off.\" I definitely agree. Our high levels of foreign aid and international development is only the beginning. We need to stop bombing other peoples countries and begin accepting a LOT more refugees. ------------------------------------- \"Voting yourself out of the EU has not solved that problem at all and it will most certainly not lead to more non-EU migration\" But with control of our own borders we can stop priority status for Europeans over non-Europeans and decide our immigration policies at election time. ------------------------------------- \"And if you are so concerned by population control on your island\" I'm concerned about population control on earth. I've absolutely no idea what we do about never-ending ...","commenter_a":"That is the future the masses chose. If you don't like it, do your research next time instead of foolishly buying into far-right propaganda.","post_message":"\"There is very little evidence of people knowing what they are trying to do.\""},{"comment_id":"10155229441268352","commenter_b":"She is a grown ass women","commenter_a":"For all j-lo haters y'all can go straight to hell she is in love","post_message":"Daaaayum! Drake and J-Lo are KILLING THE DANCE FLOOR… watch Drake GRIND ON J-Lo's FAMOUS BOOTY… then slow-dancing together like they about to go make babies!! (Video -- Super HOT!!) ----> @webpagelink"}]
