[{"comment_id":"1354157517952129","commenter_b":"Has Ann never looked in a mirror? She may be a skinny bitch, but look at that horse face of hers. Does anybody see the resemblance? She's got great hair, but hair can't cover up that horse face.","commenter_a":"Man Coulter is a vile excuse for a human being.","post_message":"Yes, really."},{"comment_id":"10153384667464726","commenter_b":"I can't tell you how little I care about what this silly woman says.","commenter_a":"it,s more convenient being black these days!!!!!!!!!","post_message":"WATCH: Controversy is swirling in Spokane over the local NAACP president. She says she is black but her parents say otherwise..."},{"comment_id":"10153931664823797","commenter_b":"Well..when you look at how Democrats view abortion...5 months ago..that woman could have destroyed that baby through an abortion... .They don't respect life. So why should a Democrat care about how this baby died?","commenter_a":"Democrats would argue that this is not murder as abortion is not murder to them.","post_message":"29-year-old Sharron Braxton has been charged with the fatal suffocation of her 4-month-old son. Prosecutors say Marcus Jr. died after she rolled on top of him in the middle of the night. How very sad. Here's what police say she was doing before she fell asleep:"},{"comment_id":"369558209835168","commenter_b":"She's going to die","commenter_a":"Lesley has asthma and she wants to come @username Christian Canales @username @username","post_message":"People living in Galena Park are being told to shelter in place because of a sulfur dioxide release at a Pasadena refining system. This is viewer video from Geno Salinas. Story --> @webpagelink"},{"comment_id":"1337743466286160","commenter_b":"How about we deplorables boycott all of you talentless walking DUMB LIBTURDS!!!","commenter_a":"These slobs have sold their souls years ago on the casting couch of Hollywood! What do they know about the struggle of the everyday @username! Go back to your fantasy world of make believe, most people live in the REAL world!","post_message":"Hollywood Hail Mary: See who's begging the Electoral College to vote against Donald J. Trump."},{"comment_id":"10154093507104087","commenter_b":"Kiss my ass illegals","commenter_a":"He'll 80% of all Americans desrespect Obama today,but we know the bias mainstream won't tell the truth,Obama lied to all Americans","post_message":"\"Many birthers believe that Obama is not an American because deep down, they believe that anyone who is not white and a Christian is either not an American, or an American with an asterisk.\""},{"comment_id":"871246712910789","commenter_b":"The face of an ugly, pathetic bitch.","commenter_a":"I would never have breast fed my daughter in public. A woman can go to the ladies room or bring a bottle with her when she's out. I think it's distasteful to breastfeed in public.","post_message":"\"I was almost in tears and creating my own wet t-shirt contest by the time I could pump again.\""}]
