[{"comment_id":"1738340076416341","commenter_b":"Women can be President too 21 Century America ,,,","commenter_a":"Vote Trump to end the Clinton Crime Cartel as we know it.","post_message":"Mike Pence \"signed an abortion law so extreme and so dangerous that even pro-life Republican women in the Indiana legislature spoke out and voted against it.\""},{"comment_id":"674719889350666","commenter_b":"these Muslims. should. be kept out our country there Radical. persecutors. of real born am Americans. they hate us","commenter_a":"The","post_message":"Khizr Khan's speech at the Democratic National Convention has made the pocket Constitution a best seller."},{"comment_id":"1249598461784360","commenter_b":"Illegal go home","commenter_a":"Why doesn't anyone show compassion? They lost their mother, they are grieving. How would u feel? Instead they act like she is a criminal for wanting her kids to have a future no matter what happened to her.","post_message":"LIVE VIDEO: The family of the Valley mother who was detained and deported under President Donald J. Trump's immigration executive order speaks outside of ICE headquarters in Phoenix. STORY: @webpagelink"},{"comment_id":"916530445075740","commenter_b":"GET OUT !","commenter_a":"Unbelievable.","post_message":"OUTRAGEOUS: People Stomping On American Flag In #Hashtag Challenge Support For Self-Proclaimed Against White People (VIDEOS) @webpagelink"},{"comment_id":"10153083604111350","commenter_b":"They have noses ! Lori Askeland","commenter_a":"Please be sure to share that Etsy link when she does start a page up!! I'm interested in these adorable dolls!","post_message":"We just love the way this artist transformed these dolls -- they look like kids again! Click to check out all the awesome make-unders."},{"comment_id":"388738841314410","commenter_b":"Go home , get out of USA !","commenter_a":"GOAT HUMPERS","post_message":"Muslim Leaders Show How ALL Muslims really think...."},{"comment_id":"10154140064560579","commenter_b":"Seriously Facebook . .you need to put a 'DUH' button on here","commenter_a":"She's right, the game is rigged and I'm sick and tired of the power elite in this country, be it the politicians or the media, trying to tell us what to think. Regardless of whether it's her or someone else, we DO have to take our country back.","post_message":"\"This game is rigged.\" Carly Fiorina on not being able to participate in Saturday night's debate in New Hampshire. Watch complete video here: @webpagelink"}]
