[{"comment_id":"10152643081825496","commenter_b":"Sadly, it's the day and age were in. My mother died of ALS in June 1973 but was in the hospital and out many times and was never denied care. In fact she spent the last 3 months of her life in the hospital and had her nightly beer with my dad. Hopefully at some point in time they will get it figured out but sadly will probably not happen in my lifetime.","commenter_a":"That's exactly how they work. They deny, deny, deny until the person /family gives up hope. It is terrible how these people can get away with stealing/withholding money that these precious people put in and need.","post_message":"A few weeks ago, 11Alive shared the moving story of 42-year-old Melissa Kern. She had been battling ALS for almost a decade, and had reached a point where she could only move her eyelid to communicate. While she fought the disease, her husband Chris struggled to pay the bills, getting nothing from Social Security for disability benefits. Bill Liss 11Alive took on the case. They succeeded. Tragically, it was too late. See more: @webpagelink"},{"comment_id":"800970150035571","commenter_b":"Stupid...sheeple its a bathroom!","commenter_a":"Target Please close doors move out of there where they respect all the people,,,,","post_message":" continue to believe that this is the right thing for Target,'' the company told TODAY in response to the boycott."},{"comment_id":"10153815696151336","commenter_b":"I don't know about that. I think this election we have many that will go up against HRC. She ruined her own chances. Everyone's sick of the shenanigans","commenter_a":"\"DESPERTA FERRO\"..., AWAKEN IRON!!! Christian Battle Cry of the Crusades. Unite and Fight people. WIPE THIS DEMOCRAP FILTH FROM AMERICA!","post_message":"“I am Hillary Clinton‘s worst nightmare — a conservative woman who will take her on on her track record and her policies and her lies.” – Carly Fiorina"},{"comment_id":"10153994674826051","commenter_b":"What a sick woman!","commenter_a":"I'm disgusted at the thought of such a thing. I hope they sue.","post_message":"This 8-year-old came home from school distraught. His dad asked him what was wrong. The boy explained that the teacher had forced him to stick his head into a bucket. Dad asked: \"What was inside the bucket?\" When his son told him, he snapped."},{"comment_id":"987873944592566","commenter_b":"She willl burn in Hell","commenter_a":"you have that right @username,I wonder if she ever thought how she got here on earth??","post_message":"Pro-abortion Congresswoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb. baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here! @webpagelink"},{"comment_id":"10157217624240354","commenter_b":"Send them to the Vatican you have walls keep them there","commenter_a":"Christians are in more danger than Muslims, that is the truth.","post_message":"Still no word on when the Pope plans to tear down that evil Vatican Wall surrounding his fortress and let all the \"migrants\" come flooding in."},{"comment_id":"1004626696250624","commenter_b":"Boy is she getting old!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"They show this picture to men who have had an erection for more that 4 hours, works every time!","post_message":"Make sure you let our politicians know that we will not support their abortion friendly policies! Click below to sign your petition to end Roe v. Wade today! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH15&pid=fb122"}]
