[{"comment_id":"821899111236478","commenter_b":"My wife would have really liked you","commenter_a":"I believe in god, i believe there is something good and benevolent surrounding all of the miracles of life....... I believe we all have a connection to god, and that means every, single, last, one of us........ No matter what race, color, sexual orientation, or faith. I refuse to believe god (a being of pure benevolence) would ever discriminate....... I believe god is the personification of good in people.... If you are gay, atheist, and black, and are someone who does good, you are far closer to god than someone who is straight, catholic, and white and spend your life discriminating and spreading hatred to those around you..... It's time to grow up, to live and let live, and to try to lead a life of compassion and understanding rather than judgement and contempt. People will be different, but people with good souls, deep inside, are always aligned, we are ...","post_message":"Share if you agree. Image by Occupy Democrats"},{"comment_id":"10154846980595575","commenter_b":"Only thing to say is, the political don't really give a rats as about our country or its people unless the are profiting from it.only Americans that care will change this type of bulls hit .America infrastructure is need of desired repairs. Let's take care of America before refugees","commenter_a":"There should be no money sent to this governor who chose to use the money for criminal reasons. You just can't do that!","post_message":"Instead of fixing the dam, Gov. Brown spent $25 billion per year on illegals!"},{"comment_id":"10156695454475206","commenter_b":"Yes lol, but I'm also a full time college student and have been waitressing for three years.","commenter_a":"Carly, I wasn't sure who had my vote until tonight's debate, that being said #fiorina2016","post_message":"Hillary wants to be the first woman president—but every single one of her policies have been bad for women and bad for America. If you want a leader who will fight for all Americans, chip in $3 to get Carly in the White House. @webpagelink"},{"comment_id":"10155175542819369","commenter_b":"If she took this Job she knew what her role would require, and now she has changed her mind. Time for her to seek new employment plain and simple.","commenter_a":"I dont think any of u trump idiots would take a bullet for him ?if u do well LOL !!","post_message":"The special agent in charge of the Secret Service Denver district is under investigation for suggesting she wouldn take a bullet for President Trump."},{"comment_id":"1563946600332130","commenter_b":"she says she all for kids but she can not hide the truth","commenter_a":"If a woman walks around spewing F!#K the way she does you damn sure don't want her to be president, hell I don't even want her as a friend","post_message":"This is the REAL Hillary Clinton, folks!"},{"comment_id":"1022812631106658","commenter_b":"You fucking cooks make this world more dense and dumb","commenter_a":"The cures are out there stop suppressing them","post_message":"Real talk for a second: someone I love very much has recently been diagnosed with terminal cancer, and I find myself growing even angrier with the charlatans who promise miracle cures and insult the incredible doctors and scientists who are working so hard to help the people afflicted with this terrible disease. They prey on desperate and sick people to line their own pockets. \"There is no alternative medicine. There is only medicine that works and medicine that doesn't work.\" Richard Dawkins Image via the Food Hunk."},{"comment_id":"10153076129356680","commenter_b":"Yes she is a witch and should be burned","commenter_a":"Just another witch hunt.","post_message":"“This is enormously significant.”"}]
