[{"comment_id":"10154264837836130","commenter_b":"No she isnt spitting fire..she is comng off as a wimp","commenter_a":"Living in reality is not at all something conservatives are known for.","post_message":"Hillary Clinton spitting fire. 🔥"},{"comment_id":"10153302995429255","commenter_b":"That is not proven, nor can it be.","commenter_a":"I got the rubella vaccine when I was 27 because that was the one childhood disease I didn't contract. At age 27 my body was able to handle the vaccine. NOW tell me PLEASE how the hell do you think its OK for an hours old baby to get vaccinated for a sexually transmitted disease, and then 48 more by age 18 months? Its seems to me KOS person, you have been bought by big pharma, or you are on a rant. Because this getting tedious","post_message":"A \"perfect storm\" is starting to brew. By Daily Kos user Lib Dem FoP"},{"comment_id":"617179595103961","commenter_b":"She is SUPER PREDATOR HERSELF","commenter_a":"$illary🐍🐍🐍🐍🐍 in the grass she will do any thing say anything to win ... Oh ya she already has","post_message":"This Video SHOULD Cost Hillary Clinton The Black Vote"},{"comment_id":"10153374338805329","commenter_b":"Lock her up and Throw away the key.","commenter_a":"Haha hopefully everyone enjoys there burgers and burritos today Cats ruin the forests when left to roam free They kill anything that's small And they over breed more than people on welfare Get over yourself You would ruin her life forever just because she took out a feral cat? Murderers even get off Scott free and live in society but this girl who by the way isn't hunting giraffes and rhinos (which is an actual job in some places) is condemned to a life of hatred by all you animal eating Internet trolls I curse everyone here with the fact that you will accidently run over an animal in your life Know that you were just a photo away from getting your whole life ruined","post_message":"A photo of the veterinarian with the dead cat have gone viral and sparked outrage."},{"comment_id":"1036436079751842","commenter_b":"Now that's a face only a mother could love!!!! What a mutha!!!","commenter_a":"BS!","post_message":"UNREAL: Thug Rapper Calls For Presidential Candidate To Be Slaughtered- Media Silent (LISTEN) Could you imagine if a white guy did this to candidate Obama? @webpagelink"},{"comment_id":"10154507086148984","commenter_b":"She was instructed to keep her hands on the dash...smh","commenter_a":"Not even surprised by this video, their false narratives always fall apart.. And instead of rendering aid to her boyfriend she continues to record, can't be more self-centered than that.","post_message":"Right after Philando Castile was identified as the man killed by police, people started talking about what a wonderful guy he was. But we've found video of what he was caught doing to a helpless child before he was killed, and it will make you sick. Don't expect to hear about this anywhere but here..."},{"comment_id":"456327834562277","commenter_b":"They are a matched set, failed business woman and failed politician.","commenter_a":"As for CARLY supporting Cruz SHE wants the VP spot and this is her ONLY chance! Tying herself to Cruz who will allow lying, half truths, whatever it takes to get into OUR White House! Carly Fiorina said BEFORE this establishment endorsement, that she found it that fellow candidate Sen. Ted Cruz, didn renounce his dual citizenship until 2014, and that Cruz one thing in the drawing rooms of Manhattan, and another thing in the living rooms of Iowa ! NOW it seems, Cruz brokered a deal with Carly AND SHE WAS BOUGHT! Talk about a SHILL Fiorina is a TOTAL GOP ESTABLISHMENT SHILL!","post_message":""}]
