[{"comment_id":"10154246558899575","commenter_b":"I think she should have been charged with negligent homicide. She caused the child's death.","commenter_a":"Agree.","post_message":"The mother of a 2-year-old boy who fatally shot himself last month has been charged with neglect. Police say the child found the gun in her purse."},{"comment_id":"10154254891359411","commenter_b":"@username I'll piss on your sphincter","commenter_a":"I love anal sex. Anal orgasms are stronger than vaginal ones. Personally, I waited til I had kids to do it coz I didnt want to stretch out both holes, but if teens want to prematurely stretch out both holes simultaneously, that's their business.","post_message":""},{"comment_id":"429016630556711","commenter_b":"Fuck off cunt slut ...","commenter_a":"Why is the cuffed woman running? If she woulda kept her cuffed ass where it needed to be she'd be fine","post_message":"This cop was too lazy to run after the woman so he tasered her causing her muscles to lock up. She fell, hit her head and later died from injuries. What do you think of this case?"},{"comment_id":"10152954324555399","commenter_b":"Well, they're not mutually exclusive qualities. A weasel can both **** others and have harmful effects, especially the more gradual and subtle kind.","commenter_a":"McConnell is a pernicious weasel. Reid will get even.","post_message":"An extraordinary act of trolling:"},{"comment_id":"1141292965963756","commenter_b":"There is evil everywhere in all religions! This is a slap in all Christian faces whether they are right, left, or middle! It's just another example of a sick individual taking advantage of others!","commenter_a":"I was in the BIG HOUSE for 2 months long ago and I have to tell ya, some of the queens in there started to look pretty good. Damn Did I just say that?","post_message":"And another \"family-values\" hypocrite bites the dust."},{"comment_id":"1848158328804181","commenter_b":"Why would he not mention her. The media is so biased you know they won't mention her in any other way then to make excuses for her.","commenter_a":"Can he EVER answer a question WITHOUT mentioning Hillary Clinton??","post_message":"Donald J. Trump to George Stephanopoulos on being criticized for taking time off campaign trail to open new hotel: “Nobody complains when Hillary Clinton goes to an Adele concert.\" @webpagelink More tonight on ABC World News Tonight with David Muir and tomorrow morning on Good Morning America."},{"comment_id":"939636916071768","commenter_b":"She's a whore? @username you are a crude, ignorant troll.","commenter_a":"The first real scientific post-debate poll results are out and they are great news for Hillary Clinton. According to the just released Huffington Post/YouGov poll, 55% say Clinton won the debate as compared to just 22% who said Sanders did. Furthermore, 52% in the national poll now say they want Clinton to be the nominee, up from 44% prior to the debate. All in all, a great result that matches the media's assessment of who won the debate, our next President, Hillary Clinton!","post_message":"Larry David is Bernie Sanders."}]
