[{"comment_id":"10157648853630389","commenter_b":"I cannot stand this woman! She's an evil individual!","commenter_a":"I think Hillary is in for a very soul awakening! God did not choose and Call a man, Donald J. Trump, to lose! Donald J. Trump, answered God's Call, he did not have to do this! God is still in Control and this is God's Creation, not the Clintons, BHO, Soros, the big bankers, or any government! Look at all of the corruption & evil that has been EXPOSED TO THE LIGHT AND HAS BEEN GOING ON FOR YEARS & YEARS AND GOD KNEW IT!!! Life is like a tapestry, we see the underside, the messy side, but God sees the finished beautiful side and knows the reasoning behind every stitch. We have repented and we have asked God to save this country, ask and it shall be given! Deuteronomy 32:35 'Vengeance is Mine, and retribution, In due time their foot will slip; For the day of their calamity is ...","post_message":""},{"comment_id":"447034255487155","commenter_b":"No vet should have to remove their stickers, as for the Obama supporters they should be kicked out of the neighborhood.","commenter_a":",yes","post_message":"Should This Vet Refuse To Remove His Decals? Comment 'yes' or 'no'."},{"comment_id":"10153322805023132","commenter_b":"She's still pregnant?","commenter_a":"I read it's a girl","post_message":"Do you think she's having a boy or girl?"},{"comment_id":"1338481856248063","commenter_b":"Another woman with no self- respect!","commenter_a":"Typical racist coward","post_message":"He said the controversial chant he was heard yelling had nothing to do with Jews."},{"comment_id":"10154064486021509","commenter_b":"Sure they alienate all woman","commenter_a":"A lot of you folks are so quick to follow the narrative. There has not been a debate in years. Just mud slinging and popularity contests. One thing is true though, the only thing the Clintons should be doing is life in prison. What a dirty dirty dirty duo.","post_message":"Could the GOP's opposition to Planned Parenthood at the #CNNDebate be a general-election vulnerability? Hillary Clinton's top aides seem to think so: @webpagelink"},{"comment_id":"1056274324413039","commenter_b":"You ladies here are absolutely correct, with your minds guns are for killing, and yes you for sure do not need to own one. If a person thinks that guns are just for killing, they sure as fuck better not own one... Let's start a new asshole list and get some signatures that states, If you are a total fucking idiot that believes guns are just to kill shit, then you do NOT and will NEVER be able to own a gun. :) Hows that ladies better? I broke it down and separated the stupid shit you people come up with. Ok, lets hear whats next,...","commenter_a":"Gun nuts who needs loads of weapons and ammo suffer from paranoia. Paranoia is a mental disease. Any person, especially those with existing mental problems can have a psychotic break any time. People like this are dangerous to the rest of us.","post_message":"Nothing says \"I'm a good Christian American\" more than protesting a priest calling for peace."},{"comment_id":"10156964298475557","commenter_b":"Unbelievable that she is allowed to be running for president if I did what she did they would have found me guilty and thrown the key away!! To think she could be our president, omg!!","commenter_a":"Political game playing and media bias. This woman should be in prison. Not on a pedestal. She is as corrupt as they come. Why are people so stupid?","post_message":"Hillary Clinton will become the first woman to top a presidential ticket after securing enough commitments Monday from delegates to become the presumptive Democratic nominee, The Associated Press reported."}]
