[{"comment_id":"1221745097868321","commenter_b":"Send her out to pasture","commenter_a":"The dumbest women in the world","post_message":"Pelosi says Clinton only lost because of Comey and the FBI investigation. Do you think Democrats are being sore losers?"},{"comment_id":"628028950680040","commenter_b":"Finally intelligent smart women say what the leader of this country needs to say. It's simple as that. They could prevent this attack they chose to be Muslim lovers.","commenter_a":"Yes sir I have many.","post_message":"\"Get a gun. Because this government ain't in a position to help.\" – Judge Jeanine Pirro bit.ly/1UgPEW4"},{"comment_id":"10155129809471929","commenter_b":"These two ladies. Need to step down they showing how they are. Active. With their mouth","commenter_a":"Crack kills","post_message":"Speechless folks..."},{"comment_id":"10154615218080530","commenter_b":"@username-Fequiere Wait, so now black on black violence is due to INEQUALITY????","commenter_a":"When are people going to start protesting the deaths of 9 year old girls executed in Gang warfare in Chicago? It's like we're protesting something that happens 1 time out of 1,000,000. And nobody cares about something that happens like everyday. The media has got the people riled up about a very small issue while ignoring major problems. That's why I don't understand this movement. It's like if the government was repossessing everyone's home and moving them to refugee camps for no reason, but I was protesting the governments estate tax while ignoring people's homes being taken.","post_message":"Does the Michigan Football players' silent protest make you uncomfortable? Does that interrupt your Saturday afternoon of escapism? Sorry. That’s the point. @webpagelink"},{"comment_id":"635677536633830","commenter_b":"Demons","commenter_a":"@username read the top comment 😂😂😂","post_message":"Name it! #WSHH"},{"comment_id":"614667495400588","commenter_b":"although she used the same structure as the \"hero myth\" that Joseph Campbell taught us to be a structure present in all traditional cultures","commenter_a":"Yeah, gonna have to disagree with this article. Just because whiny liberal twenty-somethings are hijacking the HP narrative for their agenda does not mean that the series is poorly written or guilty of propagating a false view of the world. Sure, Rowling is loudly liberal herself. But as a conservative I can, and do, greatly enjoy her books.","post_message":"Let's be honest, J.K. Rowling isn't a very good writer."},{"comment_id":"10157096795925551","commenter_b":"Go back to sleep old woman","commenter_a":"She has shown her bias...can't be trusted anymore","post_message":"Well, imagine that."}]
