[{"comment_id":"10152984814394641","commenter_b":"Ban Islam!","commenter_a":"if you Arrest Jihadist, you are hurting religious sentiments of Muslims. Beware!","post_message":"Five men arrested in France, accused of belonging to jihadist cell that was recruiting young people, authorities say."},{"comment_id":"10156004556150725","commenter_b":"Yes Please get RID of her!!","commenter_a":"Please get rid of Hillary Clinton....You rock @username","post_message":"Arriving to check out the border."},{"comment_id":"888228281273425","commenter_b":"Go baby go! There is no one more capable to speak for the down trotted, our Vets and what wars do to people than you! And you are a hero and thanks a million for your dedication and Service!","commenter_a":"Go Tammy!","post_message":"She’ll challenge GOP Sen. Mark Kirk in the 2016 election."},{"comment_id":"10153751890519411","commenter_b":"Fuck Israel baby killers.","commenter_a":"The alleged tens of thousands of “rockets” from Gaza killed how many Israelis so far? How many? Palestine has a legal right of self-defense whether Israel likes it or not. Saying that Israel is a victim is like saying that Hitler acted in self defense. Israel has no more right to Palestine than the Nazis had over Austria, Hungary, Poland, etc... In 2000, 57 Arab and Islamic countries offered full diplomatic recognition of Israel if they returned to 1967 borders. Israel never acknowledged this offer. Israel kills in the name of self defense. US kills in the name of democracy. When they fight back they are called terrorists. When it is said to them: \"Make not mischief on the earth,\" they say: \"We are only peacemakers.\" [Quran 2:11] Isn't this the case today... in the name of Freedom and Democracy! Law of current world Muslims = Guilty (until proven innocent) ...","post_message":"She died of multiple wounds in a hospital after bleeding in the street for 30 minutes."},{"comment_id":"637787356403576","commenter_b":"She's a psychopath","commenter_a":"She's correct. We're living in an era when a significant number of Americans simply refuse to acknowedge facts, or even the existence of facts. It's the populist wave.","post_message":"Hillary Clinton: \"It's now clear that so-called fake news can have real world consequences.\""},{"comment_id":"1034069336638599","commenter_b":"Cruz cannot win Ohio, Florida, New York, California, he cannot possibly win the presidency losing these key states. He only has a chance winning Texas as a key state.","commenter_a":"If Kasich and Cruz can't win in the primary how can they win the election? If the people don't want them now why would we want them later? It's not that hard to understand is it?","post_message":"Donald J. Trump on Ted Cruz and John Kasich: “Honestly Sean, they should both drop out.” Do you agree?"},{"comment_id":"10154542878929714","commenter_b":"Their professionals,and should set an example.","commenter_a":"Morals clauses","post_message":"This school district wants teachers to stop wearing graphic T-shirts and flip-flops to work."}]
