[{"comment_id":"10153410031966615","commenter_b":"Oh man. This breaks my heart. I FOUGHT for my baby to live and can't even begin to imagine this happening to my children. :(","commenter_a":"Horrible story, horrible people to treat their kid like that. But I still can't figure out where was that carseat? Is it so hard for wpxi to say if carseat was in the car or in the house? Every time I read the story it just says child was left in carseat.","post_message":"BREAKING: The parents of a 23-month-old girl who died after police said she was left in her car seat for 13 hours have been arrested -- and will face homicide charges. WPXI Cara Sapida is talking with police and will have the latest on Channel 11 at Noon."},{"comment_id":"10156237549955231","commenter_b":"Apples and oranges. American problem vs not America's problem","commenter_a":"White Christians have committed more acts of terrorism in America than Muslims. Some of you are clearly stupid & misinformed","post_message":"It doesn't help that Trump has been \"fanning the flames\" with his anti-Muslim talk."},{"comment_id":"10154554439281602","commenter_b":"@username you must be a very lonely man","commenter_a":"The metal scrap yard is located on the same street as the historic Colt Factory. To pretend they had no knowledge of it's origin is BS. They should be fined and held accountable. I lived across the street from this monument for two years and while the area does have its issues, there is no reason to bash Hartford. There is a multitude of beautiful and historical architecture to see in that area if you are willing to get out of your car. Many state and local residents have worked long and hard to have the Colt area designated as a National Park. This is a slap in the face to a city that is trying to restore some remnants of it's former glory. Take the tour - learn a little history and have an appreciation for some of the treasures in our own back yard.","post_message":"\"When I first saw it, it almost made you want to cry.\""},{"comment_id":"766826556749286","commenter_b":"pigs","commenter_a":"Thug scum! Their families should suffer for the suffering they've caused others!","post_message":"So disturbing."},{"comment_id":"609800865864857","commenter_b":"#NeverTrump #NeverHillary","commenter_a":"Everyone of us who supports Mr. Trump, must come out and vote. It's great to talk, but we need to actually cast a vote. NO EXCUSES!! The Libertards will stop at nothing to cheat, lie and steal this election. Pass the word on to everyone. Republicans have to come out and support Mr. Trump like no other has been before. #TRUMP2016","post_message":"Crooked Hillary Clinton rakes in millions from nations that fund terrorism, oppress women, and spread hatred."},{"comment_id":"10154399468414411","commenter_b":"Herna Suryani Fuck you you dumb cunt ..israel was given the land at the end of the 2nd world war in 1947..and all you have done since ,,is kill.. steal ...bitch..and moan.. so FUCK YOU CUNT !!!","commenter_a":"The ongoing 'Palestinian' terror attacks towards innocent Israeli citizens, leave Israel with no other choice. Israel must take tough decisions in order to protect its citizens and prevent the next terror attacks. 'palestinians' always choose terrorism over peace. Sadly","post_message":"This step will 'only increase the sense of injustice and frustration felt by Palestinians' - UN official"},{"comment_id":"978940745501376","commenter_b":"Fire Her!","commenter_a":"Forgive them; they know not.....wait, let's not.","post_message":"DISGRACEFUL MSNBC HOST: Katy Tur Speaks over the Star-Spangled Banner at Trump Rally (VIDEO) @webpagelink"}]
