[{"comment_id":"1115178825215538","commenter_b":"What the hoes Milton","commenter_a":"Smh..that's sad ..the thing is a man will stay only if he WANTS to stay no matter how many babies you popping out the coochie..better get yo life..become a wife..and try to avoid the strife","post_message":"Desperate"},{"comment_id":"10154818711864586","commenter_b":"BASTARDS","commenter_a":"these idiots should beSHOT!! \"COWARDS\"","post_message":"[GRAPHIC] If you drive a Toyota USA, General Motors, or Volkswagen car, you need to see this."},{"comment_id":"576566162546923","commenter_b":"I'm going to keep flossing every day. Brush three times, floss once. Usually more but oh well. When you get ten cavities per year, you do whatever could give you hope","commenter_a":"The AP can't get facts right about news events, so we should trust them about flossing?","post_message":""},{"comment_id":"983699055080206","commenter_b":"Stay out of the bedroom of married women.","commenter_a":"Yes because of his sorry voice and music, put your money where your loud mouth is west, take on a navy seal and see what happens to your sorry arse. Then let them send you to pakistan and see what happens, I bet body bag for you","post_message":"DELUSIONAL! Kanye thinks he's tougher than an American soldier. 'LIKE' if you think Kanye West is just a completely idiotic LOSER. [Read below] @webpagelink"},{"comment_id":"922136247820460","commenter_b":"Keep drinking the kool-aid lady!","commenter_a":"I think you are clueless dude. The \"obstructionist party\" is obstructing because they have listened to their fellow supporters of we the people! I don't want more and higher taxes! I don't want more illegals here illegally! I don't want Obamacare! I don't want a gigantic government telling me when, where, why and how to blow my nose! I don't want them taking away my guns! I don't want them (Democrats - now the Socialists/Communists of America) allowing Bengazi, fast and furious, and Ferguson protests to happen. I don't want Obama \"using his pen and paper\" Anymore! ILLEGALLY! WITHOUT CONGRESS!","post_message":"Back home in Indiana after a late night. The Senate held its 25th amendment roll call vote of 2015 late yesterday, already more than all of 2014."},{"comment_id":"1187655654624295","commenter_b":"You couldn't even please your husband, what makes you think you can please us? #NeverHillary","commenter_a":"Nice","post_message":"In the presence of practical, tactical brilliance at Hamilton: An American Musical."},{"comment_id":"10156746539145354","commenter_b":"Is she a horse of a different color? By looking in her mouth I would say this nag is pretty old herself.","commenter_a":"Wow! Maybe someone should check if she's a card carrying nazi. Hey Emma holocaust much?","post_message":"\"Either you wait for them all to die, or kill them off slowly.\""}]
