[{"comment_id":"10152700019752212","commenter_b":"While I understand what they are trying to do, forcing a certain body shape (or denying a certain body shape) under penalty of law is rather draconian. They might better serve the public through education.","commenter_a":"In this day of unrealistic, unattainable goals for what is beautiful, unless you go under the knife or starve yourself. I say Amen. Keep it real.","post_message":"HOT TOPICS: France has passed legislation banning models deemed excessively thin. The law also imposes steep fines and possible jail time for any agent and modeling agency who hire them. The law focuses on the model Body Mass Index (BMI) and bans anyone whose BMI is, according to the law, than levels proposed by health authorities and decreed by the ministers of health and labor. Opponents of the law think that the criteria for banning a model is too rigid; that BMI alone is not a good judge of who is and isn healthy. Others, though, say they happy the law is put in place. They think the law will stop glorifying an unhealthy body image. #9HotTopics What do you think? Robin Marsh and Lacie Lowry may share your comments today on News 9 at Four!"},{"comment_id":"10153130571029726","commenter_b":"Is that considered a rhetorical question? I think you know, and I'll add that all those girls need to be caged.","commenter_a":"Animals.","post_message":"VIDEO RAW footage of 4 teens viciously beating a girl in Brooklyn McDonald's as a crowd cheers them on. Why do parts of society cheer and take pleasure from this type of sheer brutality?"},{"comment_id":"10155910750959062","commenter_b":"She should have thought about her baby before she decided to become a thief! Do the crime do the time!!! She got caught and now she's worried about her baby! Should have been worried before doing the crime! Baby is being raised by a habitual, especially if she can't act straight while pregnant","commenter_a":"She was sentenced 14 days and is getting them 3 for 1 that's 5 days people. If she were male and not pregnant she would have been ordered six months. Being pregnant isn't a get out of jail free card.","post_message":"Right or wrong?"},{"comment_id":"1861021464115839","commenter_b":"Fits his class level.","commenter_a":"Ignorant","post_message":"WARNING: Graphic content"},{"comment_id":"692872167570028","commenter_b":"It's NOT A WOMAN!!","commenter_a":"Moron nuts ops HeShe got balls . Sick , sick , sick . Woman of the year ? Bull crap ,disgusting , insulting to all women in the world . Hmmmmm maybe he should be castrated then but he will still be the same , a mangoman hehehe .","post_message":"Watch what Caitlyn Jenner said when she accepted the 'Woman Of The Year' Award. This is what our world has come to. It doesn't get more absurd than this. Do you think this is wrong?"},{"comment_id":"10153106240459586","commenter_b":"Thank you for choosing adoption! <3","commenter_a":"Precious baby!! I have four rescued pets and must stop but it breaks my heart every time I see these posts..","post_message":"DON'T BREED OR BUY WHILE SHELTER DOGS DIE. @webpagelink CC: American Kennel Club & Westminster Kennel Club Dog Show SHARE if you ALWAYS #AdoptDontBuy!"},{"comment_id":"10153101900003010","commenter_b":"WORTHLESS PIECE OF HUMAN FLESH...","commenter_a":"This world is coming to an end . I feel sick after reading this","post_message":"A 30-year-old Newhall man told sheriff's deputies his newborn daughter was missing. But investigators say he sexually abused, tortured and killed the 19-day-old child."}]
