[{"comment_id":"1142065182546406","commenter_b":"Bye... That just means another wall.","commenter_a":"California can secede from us like texas did. Theyre their own entity but it comes with a price to pay. The time when earthquakes peel it off the rest of the world they can b their own saviour!","post_message":"They're calling it #Calexit"},{"comment_id":"10152982642761336","commenter_b":"Where are the sires of these brooding mares? I know they are out making many more welfare babies! Really!","commenter_a":"Let me clear this up for y'all make it real simple. I grew up in Jackson and the school is in the heart of the ghetto. I am talking section 8 housing, five homeless shelters with in a five block radius of each other. This is the part of town most people don't like to be in after dark. Most of the children you will run into at the school will be children of welfare brood mares. Jacksonville is very lenient on getting welfare and other government assistance, so a lot of welfare babies are born and never taught respect or manners. Most of the people living in the zip codes surrounding the school have six to eight children and are on welfare and any government assistance they can be on. So schools are over crowded and under staffed. Also these parents are either not going to care or get ...","post_message":"A Florida kindergarten teacher has been suspended without pay after she videotaped a boy beating other students on three occasions."},{"comment_id":"1215144131854339","commenter_b":"yup-knew this was coming next illegal immigrants-","commenter_a":"This is only for California elections it does not include the federal or United States presidential elections he cannot sign into law to control the federal government he only has control of the state so only state elections pertain to this law","post_message":"HORRIBLE!!!"},{"comment_id":"10154208001624497","commenter_b":"an improper whore","commenter_a":"I'd recommend an 8 ball of crack and a proper whore","post_message":"\"Every reasonable alternative has been examined and exhausted; every rational avenue, from acupuncture to chocolate, explored to no avail.\""},{"comment_id":"10153902888094726","commenter_b":"Shut up you dopey ass bitch.","commenter_a":"Palin has lost her class. She is foolish supporting Trump and a lady doesn't swear!!! She must think he will choose her for V.P. Not a good idea for Trump!!!","post_message":"WATCH: Sarah Palin: Donald Trump Will Kick ISIS Ass"},{"comment_id":"10152888732626680","commenter_b":"This recent ruling by the Supreme Court on gay marriage is only about civil unions. Those who are making this about church unions could not be more wrong as the Majority Opinion of Justice Kennedy points out: \"Finally, it must be emphasized that religions, and those who adhere to religious doctrines, may continue to advocate with utmost, sincere conviction that, by divine precepts, same-sex marriage should not be condoned. The First Amendment ensures that religious organizations and persons are given proper protection as they seek to teach the principles that are so fulfilling and so central to their lives and faiths, and to their own deep aspirations to continue the family structure they have long revered.","commenter_a":"Here come the lawsuits from the States!","post_message":"The Supreme Court has legalized gay marriage nationwide by ruling that the U.S. Constitution bars states from denying marriage licenses to same-sex couples. Full story: @webpagelink The landmark, 5-4 decision split the court along the usual ideological lines, with Republican appointee Justice Anthony Kennedy joining the court’s liberal wing to back same-sex marriage rights and the court’s remaining GOP appointees dissenting. Before the court acted Friday, 37 states authorized marriages by same-sex couples, but most of those states did so due to court rulings that could have been overturned if the Supreme Court reached the opposite result."},{"comment_id":"1587336334908184","commenter_b":"Fire HER butt.","commenter_a":"Can't stand her anymore. She is a petty, spiteful, conspirator.","post_message":"Should Fox News FIRE Megyn Kelly? YES OR NO:"}]
