[{"comment_id":"1859080321003763","commenter_b":"@username IDIOT!! No brains!!","commenter_a":"Don't give them the attention they want......they are not America they are not speaking for me!","post_message":"Protesters shut down dc"},{"comment_id":"10154001304876509","commenter_b":"She should be fired and arrested. No one else can break the law and get away with it.","commenter_a":"That is insubordination! She is not following the rules and duties depicted in her job description! Justified cause forr job termination! Her Supervision should file charges and she should be processed according to HR procedures which could lead to job termination.","post_message":"This Kentucky woman is still refusing to issue marriage licenses to same-sex couples on \"God's authority\" -- and in defiance of the Supreme Court. @webpagelink"},{"comment_id":"10153285448873984","commenter_b":"Send her to jail.","commenter_a":"Lock the beast up!!!!","post_message":"And people think she could be our next president? Do you think Hillary should be held accountable over this?"},{"comment_id":"858797117508627","commenter_b":"& the rich bastards don't give a shite.","commenter_a":"rockthevote.com","post_message":"Unless we take bold action to address climate change, our children, grandchildren and great-grandchildren are going to look back on this period in history and ask a very simple question: Where were they?"},{"comment_id":"1413505585331340","commenter_b":"YOU are ONE CRAZY WOMAN!!!! You just wait.... Trump is going to eat you alive during your debates! Trump/Pence2016!!!","commenter_a":"I think she has short circuited or blown a fuse.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"},{"comment_id":"1023824300991761","commenter_b":"Women's loos can be more festy","commenter_a":"My bathroom in my house is open to anyone who can flush. Unisex bathrooms would end this issue","post_message":"In case you missed it: Trans people need to use the restroom just like anyone else. Why do some people have to make such a big deal about it?"},{"comment_id":"10155300892045354","commenter_b":"Pompous ass!!!","commenter_a":"the blank is \"Delta Sierra\"","post_message":"Watch this incredible video and then fill in the blank: \"John Kerry is a _________.\""}]
