[{"comment_id":"853235784752651","commenter_b":"Too bad there aren't more moms like her.","commenter_a":"I love that she is wearing bright yellow...for all to see.","post_message":""},{"comment_id":"10157707332290354","commenter_b":"Deport her ass","commenter_a":"If you vote Hillary you are just inviting scum like this into our country.","post_message":"What did she mean by this?"},{"comment_id":"1719312091654441","commenter_b":"It sure can happen. We'll see.","commenter_a":"Trump beats Hillary??? Never going to happen. He's too much of a loose cannon.","post_message":"Hillary Has Dark Secrets, Dick Morris Reveals Dick Morris says Trump can defeat Hillary. \"She will lie and cheat at every turn,\" Morris says, \"But Trump needs a new strategy.\" Morris reveals it in his new \"Armageddon: How Trump Can Beat Hillary.\" Get the book here: @webpagelink"},{"comment_id":"1477546275595181","commenter_b":"Hillary Clinton is a phony champion of the working class! She takes millions from Wall Street the same people who have made Billions shipping are jobs out of the country!","commenter_a":"As it should be...when is the rest of the nation gonna wake up and at least acknowledge what's happening?","post_message":"Donald J. Trump leads Hillary Clinton by 5 points among likely voters in Ohio, according to a new poll."},{"comment_id":"1294378153962270","commenter_b":"Look in the mirror bitch","commenter_a":"I aint spending no money on this hoes lmao","post_message":"Blac Youngsta claims none of the strippers looked good! #WSHH #BlacYoungsta"},{"comment_id":"1346838938665097","commenter_b":"@username the fact is that a male will never transform himself into a female. FACT!!","commenter_a":"For people who don't understand, it is not just restrooms, but women's locker rooms and showers and dressing rooms. This is not right. This is not just a trans thing, but will allow men to go into confined areas where women are very vulnerable. So, how would you feel if your grandmother, mom, daughter, sister, aunt, etc. to shower with a man next to you with only a flimsy curtain? We here in NC will stand strong. I hope our governor will continue to fight for women's safety.","post_message":"The solution here might be that the North Carolina governor could say that we don't identify as North Carolina anymore, and therefore your lawsuit against us is irrelevant."},{"comment_id":"10152820989551615","commenter_b":"I would be putting her inappropriately dressed (?) fat butt right out of the \"prom.\" She LOOKS like a moderately dressed hooker! Maybe that is closer to the truth than one might think.","commenter_a":"Wouldn't be necessary if the CHILDREN and their PARENTS actually knew how to dress appropriately.","post_message":"“You can't put ten pounds of mud into a five pound bag.\" One parent is threatening to sue for sexual harassment over a school handout about the dress code for graduation. It’s a story we’re talking about this morning on Channel 11. @webpagelink"}]
