[{"comment_id":"10157131061465354","commenter_b":"She should have hung herself with the noose. That'll show em!!!!","commenter_a":"Tighten that noose!","post_message":"+++FIRESTORM+++"},{"comment_id":"1025172404211543","commenter_b":"That old gal is an idiot.","commenter_a":"She must not love her freedom, or freedom of choice,","post_message":"FOLLOW US FOR UPDATES----> Freedom Daily This is Monica Ball she is a peace protestor outside of Bradley University in Peoria Illinois she hates the troops and doesn't care about her freedom..... Anyone see her? If so make sure you let her know where you stand. Show her some love @webpagelink"},{"comment_id":"10154813371927787","commenter_b":"Hate to tell you, but Nordstrom is an American company..","commenter_a":"President Trump daughter will make it even more with us American women behind her.. I will not be buying from these companies any longer....I buy American and I Support American...","post_message":"Press Secretary Sean Spicer weighs in on Nordstrom dropping Ivanka Trump's fashion line. is a direct attack on [President Donald J. Trump's] policies and [Ivanka's] name. @webpagelink"},{"comment_id":"1078994498821381","commenter_b":"This is OHBLOWME's army!!","commenter_a":"Obama has blood on his hands","post_message":"BATON ROUGE KILLER'S SOCIAL MEDIA Bought Into Obama's Anti-Cop \"JUSTICE\" Rhetoric [Video] Obama is heard by people like this killer...blood on Obama's hands!"},{"comment_id":"1655877784709346","commenter_b":"Oh god between him and Trudeau ? That's not a choice , it's a bloody disaster looking for a place to happen Are there no good political leaders in this nation It would be the Canadian version of Clinton and Trump , to be fair to her she's a lot smarter than Trudeau","commenter_a":"Funny watching all the leftards do the exact same thing they did with trump with labels and lies and thinking we won't have the same results!","post_message":"Kevin O'Leary called Justin Trudeau a \"complete incompetent.\" Read more: @webpagelink"},{"comment_id":"697756897072855","commenter_b":"The rest of congress are afraid of him, they are like mice! They are not afraid to mess over the ones who voted them in, they will find out the same door they walked in, can also be the one they walk out when they have no jobs! We put them in, we can take them out the same way!","commenter_a":"Time for you to go asshole","post_message":"Unreal."},{"comment_id":"10150787426639999","commenter_b":"I'd stay in line then.","commenter_a":"Police State: \"Get in line or we'll crack your skull.\" That's the direction we're heading towards if we let this continue.","post_message":"As the girl struggles, the officer whirls around and then slams her down onto a brick sidewalk."}]
