[{"comment_id":"1409033915841807","commenter_b":"it is her business, she can refuse anyone","commenter_a":"Shouldve kicked the dudes out then shaved her head","post_message":"A Muslim woman went into a local hair stylist and made a shocking demand regarding her religion. It didn't take her long to realize that she had picked the wrong hair stylist... Now, some are saying that this hairdresser went too far. Do you agree?"},{"comment_id":"1219104934776201","commenter_b":"And this is what this gremlin boils down to!","commenter_a":"This old man ain't going nowhere. Pump up the Trump.","post_message":"The conventional wisdom of the Democratic race holds that Vermont senator is the principled liberal challenging Hillary Clinton. But Bernie Sanders has moved too."},{"comment_id":"10155048968076037","commenter_b":"I would be behind him Mr. Knowing it all","commenter_a":"Wikileaks said the emails were a \"leak,\" not a hack. i would like to see some evidence of wrongdoing, before Obama starts WWIII on his way out the door. Why is he effecting ANY major policy changes so close to being out?!?","post_message":"The US will kick out 35 Russian intelligence operatives & shutter 2 Russian compounds."},{"comment_id":"10153108119036037","commenter_b":"We should have been more selective when your ancestors came over.","commenter_a":"Towels and curtains have a purpose in the USA curtains go on windows and towels go in closet.s neither go on our heads ... if you wanna live love and respect ur traditional values then go enjoy them In your country not cram them in the face of good hard working American s","post_message":"Police in North Carolina say they are still investigating possible motives for the killing of three Muslim college students, whose relatives are pressing for hate crime charges against the alleged shooter. Legal experts, however, say a hate crime case could be difficult to prove. @webpagelink"},{"comment_id":"10153385022372426","commenter_b":"@username-this is for that mouth of yours. It won't cure your racist stupidity, but it will shut you up. PLEASE let make it shut her up!","commenter_a":"Hmmm... I wonder what the outcome is going to be... You mean to tell me an armed militia has takened over a Federal building and not one shot fired as of yet but a 12 year old with a toy gun could not be extended the same courtesy.... Oh the hypocrisy!","post_message":"An armed group is occupying a building at the Malheur National Wildlife Refuge Federal Preserve in Oregon. \"We will be here as long as it takes,\" said Ammon Bundy, the 40-year-old son of Nevada rancher Cliven Bundy, who is well-known for anti-government action. \"We have no intentions of using force upon anyone, (but) if force is used against us, we would defend ourselves.\""},{"comment_id":"10153816646376336","commenter_b":"They think that are comedians!:) seriously??? They are not funny at all! These women on the view are ugly and boring! I am still at a loss who watches this show?","commenter_a":"Let's don't get started about people's looks .","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."},{"comment_id":"1108048615955838","commenter_b":"Betty is a murderer!","commenter_a":"Just joined. Is this purge night or something","post_message":"WATCH LIVE: Protesters are filling the streets in Charlotte after police say an officer shot and killed an armed man. @webpagelink"}]
