[{"comment_id":"556876431104063","commenter_b":"Put a cap in her ass :-)","commenter_a":"I'll still bone her! Even with a mangled face! What's the point of the story?\"did you see her legs?","post_message":"The police state: before and after... The Free Thought Project.com (Y)"},{"comment_id":"884276841629012","commenter_b":"I'm not for it but I will say this: the government has known and has collected millions of dollars from illegals with fake social security numbers. Republicans and democrats both. To work here the illegals have had to come up with a fake s.s. number and pay on every check. This is a fact. I've seen it, known people who pay into it and will never see a dime from it. Our government is full of lies. They take that money and our legal money and blow it. Like I said I'm not for illegals but don't be blinded any side of the aisle in Washington D.C.","commenter_a":"This ia considered buying votes and that's illegal...but then everything Obama does is illegal. ..STOP HIM","post_message":"Thousands of illegal aliens could begin collecting from Social Security as a direct result of the president’s executive amnesty."},{"comment_id":"518916724963287","commenter_b":"Is she holding a sex toy???!!!!!","commenter_a":"I cannot believe facebook has stuped so low to put this kind of crap on their page, I'm thinking it might be time to leave.","post_message":"THIS IS DISGUSTING..."},{"comment_id":"1387674034582344","commenter_b":"@username if i had a girlfriend i probably would not watch porn, but women are picky and i am nothing special.","commenter_a":"BAN PORNOGRAPHY...simple. It is a debauched and at times cruel form of sex and at the moment is fully open to those low-lives whose brain thinks it's fully acceptable to either engage in such ridiculous practices or expect their partners to or inflict it on others. Of course this terrible crime on this poor girl was inflicted by a deviant but the role of watching pornography put fuel to the fire...BAN IT!!!!!!","post_message":"The man who held Elizabeth Smart captive when she was a teenager regularly looked at pornography, which \"just led to him raping me more,\" the now 28-year-old woman says in a new video."},{"comment_id":"10152966300122093","commenter_b":"You Must love getting raped .. how was your child life stupid","commenter_a":"he's fine as hell he can be my massage therapist any day ;)","post_message":"This man posed as a massage therapist.... he then sexually assaulted the Dallas women he tricked.... @webpagelink"},{"comment_id":"545673352289911","commenter_b":"Bitch","commenter_a":"Well the bitch is rich and scared of her own shadow... I will never watch a show hers again","post_message":"Nicole Kidman just showed her support for Shariah Law in a very public way. What a disgrace. She needs to deported to the Middle East. Do you think Nicole Kidman is a sell out?"},{"comment_id":"10152881862581051","commenter_b":"Fry the bitch","commenter_a":"Sad god be with her","post_message":"When police responded to the 911 call, they saw this woman on her front lawn - covered in blood. But even that didn't prepare them for what was inside the house."}]
