[{"comment_id":"10153707771213598","commenter_b":"Oh wow, so I guess she never felt them moving around in there for the last FOUR months of her pregnancies. That was probably a monkey or a frog moving around in there. Right. Stupid, evil excuse for a woman.","commenter_a":"Her remarks don't make a bit of sense. What in the world she thought was growing in her body got 9 months, and she is swelling and gaming weight, etc. did any of her babies kick and move around? Was she skinny when her children were born? She just instantly gave birth to a baby out of the blue! Wow! Just plain stupid.","post_message":"Planned Parenthood President: My Childrens’ Lives Began at Delivery, Not Conception"},{"comment_id":"1149314588454636","commenter_b":"Ban them from the U.S.","commenter_a":"No","post_message":"The saga continues..."},{"comment_id":"10154028349033812","commenter_b":"@username because I CAN and honestly sick of hearing about that dn women people KILL THERE SELF everyday she's no damn different","commenter_a":"I always knew something was wrong with the story could not understand why","post_message":"Texas trooper who arrested Sandra Bland surrendered to police after being charged with perjury."},{"comment_id":"10153031435480671","commenter_b":"Soldier on ladies!","commenter_a":"Ricky Myette","post_message":"What do you think about two women graduating from the Army's elite Ranger School?"},{"comment_id":"1233646523418790","commenter_b":"The filthy parasites must get the fuck out of the US","commenter_a":"Both my Great Grandparents immigrated , assimilated, learned English, no gov assistance, raised big families and loved this country for the opportunities & freedom it afforded them. We deserve the right to help those who earn the right to be Americans , but not those who come to take, hate, criticize and try to change America to suit their needs. JFK had it right .. \"ask not what your country can do for , but what you can do for your country \". Our Vets need first consideration when we spend our tax money... ! It's about time to help those who honor this country !","post_message":"Just when you think Trump can't do any better he implements policy like this one that puts AMERICANS FIRST! SHARE & LIKE if you think immigrants should never receive welfare! @webpagelink"},{"comment_id":"1536859509948075","commenter_b":"I don't want your butt in my face! Haha","commenter_a":"@username think we could do this?! Haha","post_message":"That feeling when you've made it to Friday... via JukinVideo"},{"comment_id":"1797648893800416","commenter_b":"Women's bathrooms have in closed stalls get over it.","commenter_a":"I don't do business with Target anyway","post_message":"In the wake of Target's decision to allow men in women's restrooms and changing rooms, the hashtag #BoycottTarget has exploded across social media and trended as high as #1 on U.S. Facebook..."}]
