[{"comment_id":"10153404952670399","commenter_b":"Women see him and spontaneously abort.","commenter_a":"Cherry picking keeps religion alive.","post_message":"Way, way too much information."},{"comment_id":"10154312646744726","commenter_b":"For those confused about how an attack like the one in Orlando, Florida, could happen, I'll try to catch you up: Barack Obama's #1 goal has been to turn this nation into an Islamic wasteland. To that end, he appointed Hillary Clinton to be his dirty-dealing Secretary of State, in order to funnel military grade weapons to a then very inchoate ISIS. Hillary Clinton decided that it was appropriate for her to set up a fake Canadian charity, the Clinton Global Initiative, so that she could accept donations from dangerous nations, in return for personal political favors from the Secretary of State. This is the very definition of treason. However, Hillary didn't want anyone to have a paper trail of all her crooked dealings, so she set up a private email server in an attempt to thwart Freedom of Information Act requests. Barack Obama is now protecting Hillary, because he's ...","commenter_a":"It's truly disgusting and disturbing to use a massacre to push a political agenda. It was an Islamic terrorist attack now it's been used by democrats for an anti gun campaign, sickening.","post_message":"Liberals immediately urge gun control measures as terror link emerges in Orlando shooting"},{"comment_id":"10154349136059203","commenter_b":"Then you would be sexually assaulting a sexual assaulter","commenter_a":"If I ever saw this piece of shit in the street, I'd kick him in the nuts. He's a disgusting animal","post_message":"As if this could get any sicker."},{"comment_id":"461301070747634","commenter_b":"They are ILLEGAL!!! It should not be allowed!","commenter_a":"No illegals have no right to vote in our country's elections. The democrats are destroying this country. Wake up is a phone worth your vote. Honestly look around are you better off now than 8 years ago. On the economy I blame both parties!","post_message":"BREAKING: Obama Launches Plan To Allow Illegals To Vote In Next Election They are not citizens of our country, and should not be allowed to vote. Do you think this is wrong?"},{"comment_id":"1292791090782624","commenter_b":"She's a paralegal? She should make much more than a fast food worker. This is why Sanders lost. He only helps the poor. He doesn't help the hard working middle class. Where is our mandated raise?","commenter_a":"Um I went to college to make $15 an hour and I have student loans. So now people working at Burger King are going to make the same or more than me? WTF I need a raise too!!","post_message":"When working people stand together, we win. And we are winning the fight for a living wage. In 2016, a total of 25 states and localities approved minimum wage increases."},{"comment_id":"1339369766115783","commenter_b":"There are so many other places to shop.A woman`s dignity is valuable to her self esteem.","commenter_a":"I still think this is another part of Obama's plan to cause unrest and confusion so he can carry on the New World Order Plan. Wake up folks the end is almost here.","post_message":"@webpagelink"},{"comment_id":"10152765716636028","commenter_b":"What an effen B-tch I see why he cheated on her weird @$$","commenter_a":".","post_message":"\"That's what you get for cheating on me,\" said a woman who allegedly lured her ex to a drug house where a group of men robbed him at gunpoint, according to a judge. @webpagelink"}]
