[{"comment_id":"10156129057215389","commenter_b":"Uhh...nope!!!...I was born also...but not today!","commenter_a":"Yes, it might cost her a lot like not greeting to be president.","post_message":"Question of the Day: Do you believe Hillary Clinton is really sorry about her server scandal?"},{"comment_id":"10153476732498132","commenter_b":"She can't sing or act....","commenter_a":"She's still hotter than Kim Kardshian and she has talent.","post_message":"She must be a magician with double-sided tape. #MetGala"},{"comment_id":"628439843967466","commenter_b":"Yep criminals think like that That is why she pointed a gun at the polw. @webpagelink","commenter_a":"Because they don't have anyone to be accountable to!!!","post_message":"This is for all of the victims of #PoliceMurder and #PoliceBrutality who never make national headlines in the mainstream media! @webpagelink"},{"comment_id":"934872919883382","commenter_b":"Did you listen to how Oklahoma handled the questions? She is no fake Barbie. Women can be beautiful and smart.","commenter_a":"Eeeeew, another fake blond Barbie miss USA. Miss Texas should have won .","post_message":"Wow."},{"comment_id":"423132557811339","commenter_b":"Al Sharpton is a racist !","commenter_a":"Afraid this will spread as it has in the past.","post_message":"Could this violence against police spread around the country?"},{"comment_id":"10152532301590927","commenter_b":"In Mexico, illegal aliens trying to take up residence, jobs and asking for free healthcare are arrested, put on a bus and taken to the border to be dropped off without a second thought. If you're here in the United States illegally, you deserve to be arrested and shipped back to the border of the Country you originate from.","commenter_a":"Liberal bs.","post_message":"And the immigration debate gets personal again!"},{"comment_id":"10152523937956135","commenter_b":"Only issue is the sand doesn't wash down the drain as easily as salt when winter is over","commenter_a":"Sand is better. We use a salt and sand combo (more sand than salt) in the UP.","post_message":"Ever slide through a cold Interstate at night and wonder how exactly is salt supposed to melt ice?"}]
