[{"comment_id":"1693365440922113","commenter_b":"We need to take back our country from these liberal Morons! How dare they: your rights STOP where ours begin!","commenter_a":"Funded by MUSLIM BROTHERHOOD to divide & conquer!","post_message":"Black Lives Matter supporters spat and stood on the American flag outside a Donald J. Trump rally Sunday."},{"comment_id":"924082021021384","commenter_b":"and hate smart women.","commenter_a":"What happened with the great Sara Palin she not running lol","post_message":"They might need a bigger stage..."},{"comment_id":"10153686254615653","commenter_b":"\"Poor Catholic Hispanic Immigrants\". Key Word : Illegal","commenter_a":"Donald Trump says he would force Mexico to pay for a border wall as president by threatening to cut off (rob) the flow of billions of dollars in payments that poor Catholic Hispanic immigrants send home to their native country, an idea that could decimate the Mexican economy and set up an unprecedented showdown (Trade War) between the United States and a key regional ally. #NeverTrump #ReverseRobinHood","post_message":"Stronger together."},{"comment_id":"543983115775139","commenter_b":"Let them keep walking to wherever they came from","commenter_a":"Let them walk all the way to the muddeled East.","post_message":"Muslim Students Walk Out During National Anthem [VIDEO] If don't want to show your respect for our country, you can leave. Are you appalled by their blatant disrespect?"},{"comment_id":"817070211680479","commenter_b":"Who cares about this slut","commenter_a":"POS","post_message":"“I hate everything about this country.” Rapper Azealia Banks Tells Playboy Why White America Owes Her Reparations… How does someone who makes millions in America get away with saying she hates everything about our country?"},{"comment_id":"1392423634112580","commenter_b":"MESSAGE TO DONALD TRUMP AND TO THOSE WHO VOTED FOR: THE DEVIL IS AT HOME. EVERYONE MUST PROTECT HIS RIGHT BY LAW. MAKES YOU QUESTION WHY MADE THIS MILLONARY HUMAN BEING MADE OF FINITO DUST? THANK YOU TO THESE COUNTRIES. IN INDIA HAS 16 BUSINESSES, ARAB EMIRATES 13, CANADA 12, CHINA 9, INDONESIA 8, PANAMA 8, SAUDI ARABIA 8, SCOTLAND 7, AZERBAIYAN 5, BRASIL 4, IRELAND 4, ISRAEL 4, CATAR 4, FRENCH ANTILLES 2, SOUTH AFRICA 2, TURKEY 2 URUGUAY 2, BERMUDA ISLANDS 2. AND CASINO IS ONLY YOUR MASK. HOW EASY IS TOMB TO THE GOLIAT. AND IF IT CONDEMNS CUBA? EVERYONE CONDEMNS THEM; UNTIL WHERE THIS DONALD HITLER ADOLF TRUMP DICTATOR HAS ARRIVED. THE CURRENT MOMENT IS OF ABRUMING INTEREST FOR ALL REPUBLICANISMS THAT OCCUPY POSITIONS OF CONFIDENCE, THE REPUBLICANISMS HAVE CHOSEN THE MOST VIOLENT MAN WHO HAD ALREADY HAD SINCE THE FOUNDATION OF THE UNITED STATES OF ...","commenter_a":"So what happens now?? Castro brother takes over???same crap or the people change this?","post_message":"\"Everybody's been partying, basically, all night long.\" Earlier this morning on \"FOX & Friends Weekend,\" Phil Keating gave us a look at the pre-dawn celebrations occurring in Miami, Florida, in response to Fidel Castro's death. @webpagelink"},{"comment_id":"10154663245784657","commenter_b":"Who wants to watch a liar. He is so delusional, he should have been removed from office years ago. Except Congress has no spine !","commenter_a":"Heard one from this 'fella, you've heard them all !!! Only said \"I\" 84 times in this one, --- he's gettin' better ???","post_message":"Obama, the celebrity president, may not be as popular as he thinks he is."}]
