[{"comment_id":"10153106240459586","commenter_b":"Thank you for choosing adoption! <3","commenter_a":"Precious baby!! I have four rescued pets and must stop but it breaks my heart every time I see these posts..","post_message":"DON'T BREED OR BUY WHILE SHELTER DOGS DIE. @webpagelink CC: American Kennel Club & Westminster Kennel Club Dog Show SHARE if you ALWAYS #AdoptDontBuy!"},{"comment_id":"10153931664823797","commenter_b":"Well..when you look at how Democrats view abortion...5 months ago..that woman could have destroyed that baby through an abortion... .They don't respect life. So why should a Democrat care about how this baby died?","commenter_a":"Democrats would argue that this is not murder as abortion is not murder to them.","post_message":"29-year-old Sharron Braxton has been charged with the fatal suffocation of her 4-month-old son. Prosecutors say Marcus Jr. died after she rolled on top of him in the middle of the night. How very sad. Here's what police say she was doing before she fell asleep:"},{"comment_id":"10153763759623812","commenter_b":"Girl, shut up.","commenter_a":"Relax dad, she's not a teen, stupid and sad comment - life is about friends, why confuse a happy loving kid, who loves boys too as friends...","post_message":"This 2-year-old girl is crushed to hear that she can’t have a boyfriend, insists to her dad that she has someone special in her life. Her conviction is intense! @webpagelink"},{"comment_id":"10153070915541051","commenter_b":"Put her in the outhouse and lock the door.","commenter_a":"😕","post_message":"This woman's husband was buried under a particularly big pile of manure when police finally discovered him."},{"comment_id":"10154190292923908","commenter_b":"My balls itch !","commenter_a":"perhaps they learned something from mother nature, (she fights back) with a swift justice. earthquake anyone else ;) it's time to rethink the old ways and start a new, where nature comes first <3","post_message":"Good..."},{"comment_id":"10153653064325575","commenter_b":"Please get rid of this POS","commenter_a":"100% pathetic - Trump 2016 !","post_message":"Talk about OUT OF TOUCH!"},{"comment_id":"1338210979551629","commenter_b":"Lady your way too old to be a cheerleader!!!!","commenter_a":"This woman is not well","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video] This is embarrassing! She scolds the audience!"}]
