[{"comment_id":"10153896899905579","commenter_b":"Yes...go away!!!","commenter_a":"you go","post_message":"President Obama to extend U.S. Military presence in Afghanistan: Your Thoughts? WATCH statement from President Obama @webpagelink"},{"comment_id":"10152960155261336","commenter_b":"Illegal aliens receive EBT & all other assistance, including Medicaid & Medicare, Dorri McNeal Vigar. They need a TIN. They get it at the County Office or SS Office via their computers. They are the \"900\" series. If they have \"anchor babies,\" they get it. If they have children born in other countries, they get it. Now here is the un- requested bonus kicker: If they have a\"900\" series TIN, file taxes, & claim their children; even children residing in Mexico or other countries who have never been in the US, they can apply for the Child Tax Credit & get it. All they need is a TIN for each kid. The IRS is the largest remitter of funds to Mexico. When called on the carpet about it 2 years ago, the IRS became highly indignant & stated congress made no law disallowing them to remit for children not born ...","commenter_a":"And proof of US citizenship.","post_message":"Arguing that taxpayers lose $858 million a year on food stamp fraud, several GOP lawmakers have proposed a new bill that would require photo identification to use food stamps."},{"comment_id":"1877847435771618","commenter_b":"Hopefully she'll keel over and die.","commenter_a":"not so easy to back track in our modern age of electronics","post_message":"FRAIL LOOKING HILLARY HITS TRUMP FOR CALLING NYC ATTACK 'BOMBINGS' -- AFTER DOING THE SAME..."},{"comment_id":"606686526157968","commenter_b":"@username I'm coming to rape and murder ur whole family","commenter_a":"Why not use that time, money, and tech to sniff out cancer, instead of destroying addicts lives by throwing them in a cell with rapists and murders?","post_message":"It's so powerful, it had to be calibrated in the pristine air of Antarctica — one of the few places in the world where it would read true zero."},{"comment_id":"10153587068405329","commenter_b":"Dolphins are such vicious, terrifying monsters!","commenter_a":"@username \"It hit my wife and knocked her over, and punched my daughter.","post_message":"The dolphin jumped in, broke someone’s ankles and “punched” a 16-year-old girl."},{"comment_id":"10158362932045500","commenter_b":"Her water didn't break yet","commenter_a":"Her water did not break","post_message":"BABY WATCH (10am update): Still no baby giraffe yet! When do you think mom April will give birth at Animal Adventure Park? Don't miss anything: @webpagelink"},{"comment_id":"10156323895095354","commenter_b":"@username Your not aware of everything that went on or was said. I \"ASSUME\" he told her to GET UP and being Defiant and Arrogant she decided \"I'LL DO WHAT I WANT TO DO\" . She should have STOPPED what she was doing when she was TOLD TO. It was Harsh but perhaps the rest of the Class learned a Lesson. Crap like she pulled Disrupt a Class ands children that WANT to LEARN can't.","commenter_a":"Yes good for the cop, if you do not like this then do what your told to do by the cops.","post_message":"The FBI and DOJ have jumped in..."}]
