[{"comment_id":"10154336382586729","commenter_b":"What a bitch...","commenter_a":"Maybe she could watch it from her prison cell!","post_message":"This woman...SMH"},{"comment_id":"10153772983356813","commenter_b":"Does that mean pardoning him for his rape accusation that he fled the country for as well?","commenter_a":"Snowden deserves a pardon. More than Obama deserves to be POTUS.","post_message":"Now's the time for Barack Obama to pardon Snowden."},{"comment_id":"10152769166208271","commenter_b":"Tauna Corbin so a dead woman can drive a car?","commenter_a":"She broke the law. She could have KILLED the officer if she ran over him. Its called consequences for YOUR PERSONAL CHOICR.","post_message":"#BREAKING Denver Police Chief Robert White spoke to the public about the shooting Monday that killed a teenage girl in a stolen car. We are updating this report: @webpagelink"},{"comment_id":"10153228470879170","commenter_b":"Idiots abound everywhere","commenter_a":"Lol","post_message":"If only for comedic value, we hope these people are successful in their bid to \"Draft Joe Biden!\" ....Utterly crazy video included."},{"comment_id":"10154056167770329","commenter_b":"For Christ's sake lady give it a rest!!! Please get yourself fixed and do my reproduce we don't anymore people like you. And if you've already reproduced I pray for your children. Now kindly fuck off and go find someone else to annoy. Seriously anyone else. The other girl got the message why can't you??","commenter_a":"So stupid. Blackface doesn't make someone racist.","post_message":"IMPORTANT REMINDER: It's never okay to wear blackface!"},{"comment_id":"687263024766984","commenter_b":"@username here's a fact for ya 100% of illegal immigrants are criminals","commenter_a":"\"What we are going to do is get the people that are criminal and have criminal records, gang members, drug dealers. … Probably 2 million, it could be even 3 million, we are getting them out of our country or we are going to incarcerate,” Trump said. “We’re getting them out of our country. They’re here illegally.” Don't see what the problem is with that.","post_message":"Immigrants rights groups say they're \"preparing for the worst.\""},{"comment_id":"1005026196219449","commenter_b":"Demon dog born of a jackle, shut your butt hole","commenter_a":"He didnt do nuffin...he was just minded his own biz..like they all do..blame the whites in America. .tell me one state thats mostly black..that dont have a high crime rate?..then tell me how its whites fault...anddd go!","post_message":"Authorities in Austin, Texas have identified the Black, unarmed teenager who was fatally shot by police Monday morning. Initial reports didn’t name 17-year-old David Joseph or his age, but what has been revealed is that he was naked at the time of the shooting. Geoffrey Freeman, a sergeant with Austin police, and other officers were responding to a call at an apartment complex. Although details are scant, Freeman arrived on the scene and apparently opened fire. MORE ---> @webpagelink"}]
