[{"comment_id":"10157601256035594","commenter_b":"I don't know who you are hanging out with but you should protect your pussy...","commenter_a":"Hillary calls Trump supporters deplorable... yet a Hillary supporter does this, this disgusting attempt at a 'protest'. This is more foul than the WORDS Trump spoke.","post_message":"“Dear Mr. Trump, I’m not able to mail you my actual p----, so I’ve included the next best thing. Cheers, Emily.”"},{"comment_id":"1079787262080732","commenter_b":"BYE BITCH","commenter_a":"@username this is SCARY accurate dont hug me when u come home","post_message":"\"I love you.\" \"Ew. Stop.\""},{"comment_id":"10153250521056509","commenter_b":"It's not just FL, horrible people live everywhere...","commenter_a":"Why does so much f*d up sh*t happen in Florida!?!?","post_message":"A 5-year-old Florida girl was killed after her father tossed her off a bridge from his car, police said Thursday. @webpagelink"},{"comment_id":"891579364198188","commenter_b":"You're right. It just seems women are more selective.","commenter_a":"How about guys? It is not just all women!","post_message":"Well this is horrifying. (via The Huffington Post)"},{"comment_id":"542901459225067","commenter_b":"Go Hillary !","commenter_a":"She is honest and I am tired of people accusing her of everything when she has been for the USA since Clinton was President and after that, etc. She loves her country and will be an excellent President. Grow up world!","post_message":"The people of Iowa versus pollsters and pundits. The people win."},{"comment_id":"10153963007189160","commenter_b":"@username: Michelle Obama is not an entitled wife she is just an ordinary male in women's clothing. GO TRUMP GO!!!!! America is the land that I love.","commenter_a":"Finally now the truth starts to come out. Hopefully Obama cannot put the spin on this now. Hillary for jail with the rest of her crooked family and Obama and his family also. Especially his entitled wife.","post_message":"Wikileaks is out with more than 1,200 emails from Hillary Clinton's private inbox."},{"comment_id":"1614611835509066","commenter_b":"you're welcome u baster","commenter_a":"I'm going to the toilet and leaving my phone on charge, I expect loads of likes when I'm back. Thank you","post_message":"US President-elect Donald J. Trump will soon be accompanied at all times by a military aide carrying the nuclear \"football,\" enabling him to order a nuclear strike at a moment's notice."}]
