[{"comment_id":"932964430158104","commenter_b":"I wish we could deport ALL these crazy ass idiots!","commenter_a":"This woman and Palin and others like her are enemies of the state in my opinion! Shame on them for spewing their damage.","post_message":"WOW."},{"comment_id":"10154048103696409","commenter_b":"Hey Betty eat a dick","commenter_a":"Lovely Family ! May God continue His Blessings on them!","post_message":""},{"comment_id":"10153148405249753","commenter_b":"Fuck you again bitch and fuck your manner too. Don't come to teach about manner. My mama only said \" baby, respect everyone before get that respect back.\" My mama is better than yours.","commenter_a":"Everyone shall be respected the American's rules because we are living in America, not your or mines, so lady get that into your head.","post_message":"The Dearborn Police Department has been slapped with a lawsuit after a Muslim woman says that she was ordered to remove her hijab, or headscarf, for her booking photo after she was arrested."},{"comment_id":"688269957994142","commenter_b":"Honestly, what a creeper. Who thinks thats acceptable??","commenter_a":"@username what an idiot!","post_message":"This man WON'T stop preying on Kim Kardashian West and Gigi Hadid!"},{"comment_id":"10152936340096770","commenter_b":"She is such a Train Wreck","commenter_a":"Bored","post_message":"Kim Richards spent the night in jail and was released Monday afternoon on a $5,000 bail."},{"comment_id":"817971878238235","commenter_b":"WTF. Is she even more stupid then I thought.","commenter_a":"She is so stupid!!Does she have that kind of power or does that have to have congregational approvevl?","post_message":"Big news! What do you think about this?"},{"comment_id":"1324023564281057","commenter_b":"FUCK YOU FUCK sharia law GO HOME ALLUH FUCKTARDS","commenter_a":"It is so wrong","post_message":"Florida Democrats Approve Bill That Imposes Shariah Law On Women. You can't force your religion on other people. Do you think this wrong?"}]
