[{"comment_id":"1705728746332744","commenter_b":"The blacks elected him with help thinking they would have it made financially etc and now more are out of work and on welfare than ever. They have to stay in school and work hard like everyone else to get ahead and blacks don't see it. How do they think you get a position anywhere?","commenter_a":"Absolutely","post_message":"SHARE IF YOU AGREE!"},{"comment_id":"873492039433845","commenter_b":"make all the illegals-legal so thats 10 million persons paying taxes. we could sell the republicans to the dog eating festival. thats say 100 dollars.","commenter_a":"cool give them texas. that would be hilarious!!!!!!","post_message":""},{"comment_id":"10155610147785389","commenter_b":"Maybe we all need too draw more Cartoons/dont like it leave our Country.If we went to there Muslin Country they cut your head off are take your body parts for opening your mouth,so i think we all need too fight back too these ugly Muslin who think they are going too rule America and kill us for nothing.All they are Communist and they are brought in too our Country too destroy ,let them destroy there own.Lock these borders and stop letting them build camps too close too us.","commenter_a":"The Lamestream media are sell outs to this great Republic, and therefore deserve nothing but disdain from all true patriots.","post_message":"Question of the Day: Is the mainstream media wrong for criticizing Pamela Geller, instead of the radical Islamists?"},{"comment_id":"970145053025967","commenter_b":"Remember: it's all politics ...and about votes. The GOP is garnering for the 'jewish' vote in 2016.","commenter_a":"Talk about shooting yourself in the foot...! Between this \"journalist\", Boehner, and Bibi, the court of public opinion may not be so kind. Obama will most likely rise above the pettiness, but like he said, there WILL be consequences. He is after all the actual elected President of the United States.","post_message":"Conservatives and Pro-Israel groups are now actively undermining the US President. This is about as un-American as it gets."},{"comment_id":"10154427870651491","commenter_b":"She was deported because she is a felon!!","commenter_a":"Now if only the Native Americans could some how deport the illegal descendants who settled in America and forcibly stole their tribal lands in violation of Native American law, because that would be poetic justice.","post_message":"She inspired protests in Phoenix, Arizona when she was detained on Wednesday."},{"comment_id":"10153838420452217","commenter_b":"English can be privatised ? Wow.","commenter_a":"I'll trademark all the vowels...That way they are just spcsvrs...which makes no sense...","post_message":"Yes, you are reading this clearly. 👀 👓"},{"comment_id":"1022737904430216","commenter_b":"Yuge piss on Shillery Clinton. Name ONE more disgusting pig who ever lived?","commenter_a":"Nobody kicks a dead dog. Hillary's attack shows that her campaign sees Cruz as a real threat. Ron Nehring, keep up the good fight.","post_message":"Ted Cruz: “John Kerry was not a little wrong, he was wildly, extraordinarily wrong. Facts matter. Science matters. Data matters.\""}]
