[{"comment_id":"10153648874092060","commenter_b":"You made Nola.com Michelle!","commenter_a":"Tammy, we should have gone to target last night instead!","post_message":"Metairie Target shoppers got a little help with last-minute Father's Day shopping last night from a special guest – New Orleans Saints Quarterback Drew Brees."},{"comment_id":"1088448164564744","commenter_b":"MOB VIOLENCE - MUSHY FRAUDULENT L A C K OF LEADERSHIP. VOTE THEM OUT OUT OUT !!!!!!","commenter_a":"Is this what we call, \"Today's Leaders?\"","post_message":"This guy is nuts!"},{"comment_id":"1099154366818961","commenter_b":"Hypocrites and parasites all , get them all out now","commenter_a":"Kristian I don't know if you'll catch it","post_message":"#resigncameron demo live in London"},{"comment_id":"633174346857148","commenter_b":"You are absolutely correct. And, this was a time of turmoil in our country. How the times have changed. It's sad isn't it??","commenter_a":"Thousands of young people got together for 3 days of music and partying and no one got killed or caused havoc. It could not happen today.","post_message":"On this day in history, the Woodstock festival debuted on a dairy farm in New York in 1969. Do you remember the original Woodstock?"},{"comment_id":"10152721939436051","commenter_b":"Your a cunt ya bitch","commenter_a":"Dumb bitch she would of been mad if the made her fat ass look fater","post_message":"This girl couldn’t believe what her school did to her yearbook photo."},{"comment_id":"666187176847797","commenter_b":"Too much butt kissing being done. The pilot and his white privilege remark, the seat mate's skin color even being mentioned, the flight attendant feeling compelled to apologize...oh, brother! This chick needs to put her big girl panties on and if she's a peace loving/seeking person, she'd drop the whole issue.","commenter_a":"So let all muslims boycott United, I will feel much safer with them not being there. Muslims are lower than whale shit.","post_message":"Look what happens when a flight attendant refuses to give a Muslim woman a Diet Coke..."},{"comment_id":"10153237461976367","commenter_b":"You ladies make a youngen proud :))","commenter_a":"As an older feminist, I have looked forward to the chance to vote for a woman for president for many years. I will be voting for Senator Sanders instead because his willingness to look at everything and proposed changes would improve the lives of millions of Americans. Women and men. A rising tide floats all boats.","post_message":"Would Sanders or Clinton do more to improve the lives of women in the United States?"}]
