[{"comment_id":"680890588768186","commenter_b":"Close them all down and get rid of all the Muslims!!! They dont belong here in Our Country!!!","commenter_a":"Donald Trump is our man and he has the balls to stand up and speak his mine for the people to help us to clean our house and to put the people who made this mess were they belong. We need to get our country back in working conditions. Get our school back saying the pledge ALEIGENT and believing in God again. So let's get our flag flying high and our spirits back. And this rotten president out with his terrorist people and kicking all to the curve (this mean get them the hell out of our Country they destroy our country enough. ).","post_message":"Donald Trump announced his plan to close Mosques, but keep watching. Muslims everywhere are furious. But he doesn't care. Do you support Donald Trump?"},{"comment_id":"1051319018240177","commenter_b":"Let's build a wall!","commenter_a":"No way? Only illegal Mexicans are drug dealers and criminals. . Right?","post_message":"DRUG RING UNCOVERED: Six students at UC Santa Cruz have been arrested on Friday for allegedly running a drug ring that uncovered over $100,000 worth of MDMA, police said. READ MORE: @webpagelink"},{"comment_id":"10153249235547894","commenter_b":"here Sharnise Nisec Brown since you are behind on the times lol Lauren Payton Katrina Elizabeth","commenter_a":"Zanehya Rayshaun Corleone","post_message":"Exclusive: K. Michelle Opens Up About Her Relationship with Idris Elba and Backlash from Black Women: ‘The Women I Fight For Have Been The Women That Attack Me’ [Video]"},{"comment_id":"10153626418796509","commenter_b":"She truly is hideous","commenter_a":"God she's so ugly . How did she trick Ferris Bueller into marrying her?","post_message":"Many celebrities attended the Metropolitan Museum of Art's Costume Institute Gala in New York. See pictures from the red carpet. @webpagelink"},{"comment_id":"1578057615587695","commenter_b":"10 Days and she will be our president","commenter_a":"@username am I right Cody Martinez","post_message":""},{"comment_id":"219022051835576","commenter_b":"Legal Immigration isn't a Problem! Melania Trump is a legal Immigrant!","commenter_a":"YES","post_message":"Senator Tom Cotton just introduced Trump's immigration proposal through the Senate! Sign the petition SUPPORTING the bill HERE: @webpagelink"},{"comment_id":"894578323912842","commenter_b":"Then it would forever be a mystery. That hag will never tell the truth.","commenter_a":"Did they ask Hillary that question well when she tells the truth then they can come back and ask Rick that question.","post_message":"\"These are tough issues...\""}]
