[{"comment_id":"835204176588028","commenter_b":"Girl really baby get check","commenter_a":"Its that flu you cant shake.","post_message":"Oh my"},{"comment_id":"10152848964136051","commenter_b":"Hang the little bastards.","commenter_a":"I know @username 😞","post_message":"First these teens attacked an 87-year-old woman. Then they raped her. And then they poured bleach down her throat."},{"comment_id":"656793474487890","commenter_b":"Hillary the Felon says Trump is prejudice and she is just telling the same manipulative lies over and over. Mexicans do need to be properly vetted and screened because they are coming from a country knee deep in political corruption and organized crime. This lying fraud is trying to get her voters to think Trump is racist and prejudice but fails to acknowledge the gallons of red blood leaking into mexican streets because GOVERNMENT DISARMED ALL LAW ABIDING CITIZENS. It is NO QUESTION, Hillary wants Australian styled gun abolition, want proof? Ask and you will receive! She fails to acknowledge mexico is sending rapists and drug dealers en masse to deal much like Fidel sent his POW to Miami. There IS NO DOUBT this Felon is going to drag us into a civil war with her ideologies on government. Syrian and muslim refugees who have turned Germany into the brink ...","commenter_a":"#Trump2016 #HillaryForPrison #DNCLeak #DNCWalkout #CrookedHillary #ClintonCorruption #RiggedSystem Debbie Wasserman Schultz was the co-chair of Hillary's 2008 presidential run, where she lost the nomination to Obama. So, in order to lock down the nomination for 2016, Hillary would've had to put Schultz in charge of the DNC and manipulate it from within. In order for this corruption scheme to work, the Clintons would have needed first to, not only get the current DNC chair at the time to step down, but also get them to recommend Schultz for the position. A big request. And the Clintons would have likely needed to promise a powerful favor to that DNC chair, something more prestigious than being head of the Democratic party. So who was that person and what did they get in return? The previous chair of the DNC prior to Debbie Wasserman Schultz was... Tim Kaine. Let that sink in for a ...","post_message":""},{"comment_id":"836649156384109","commenter_b":"he s a crook","commenter_a":"Shake hands then shoot the f'er in the head.","post_message":"Rahm Emanuel just wants to be friends with Chicago unions"},{"comment_id":"10153262313634497","commenter_b":"Alan there's no way for Cubans to legally immigrate to the US.","commenter_a":"Ted Cruz the Canadian born of a Cuban and an American that doesn't like immigrants.","post_message":"Texas senator Ted Cruz announced Monday that he will run for president in 2016. Here is what you should know about the first-term senator:"},{"comment_id":"1106399449450800","commenter_b":"Have you ever been fired or refused a job because you had a cough?! If this is the best you can do you should throw in your white sheet and accept defeat.","commenter_a":"Notice how her hair is different in all 3 of the pictures and her clothes are different in the two pictures that show her clothes. Who changes their hair and clothes several times while on a plane? Another made up story without corroboration by the right wing nuts from @username.","post_message":"WATCH:"},{"comment_id":"10154129472871509","commenter_b":"Shut up Muslim trash","commenter_a":"Middle East bloodshed happened due U.S invasion of Iraq. Sadam was a great leader. U.S is responsible for Shia occupation of Iraq, syria and Yamen.","post_message":"At least 30 killed after airstrikes hit wedding @webpagelink"}]
