[{"comment_id":"1742914335970564","commenter_b":"Where are we going to put all these people . ???? I just have not seem many pictures of great families knocking on our countr's door but mostly young to middle age men with anger and mean expression written all over their faces . How will we cope ????","commenter_a":"Noooooo","post_message":"That's a 550% increase!"},{"comment_id":"10154953325678984","commenter_b":"John, trump just said in his speech last night we have to unify. How can we when you make stupid statements like that!!","commenter_a":"President Trump should invite the Haitian Leaders, absolutely. And as a gift to them, hand over the Clinton's to them to face justice there.","post_message":"Obama probably isn't going to like this..."},{"comment_id":"10154296658174411","commenter_b":"@username Actually, no it wasn't in response to that comment. I wasn't responding to Andy Shitman anyway.","commenter_a":"imagine a group of 4 thousand russian troops on a boat alongside new york..... and then telling the us theyre acting aggressive.. LOL","post_message":"'Russia is acting in an extraordinarily provocative behavior'"},{"comment_id":"1139700699375519","commenter_b":"Stop All Muslims. Send them back where they came from.","commenter_a":"Wrong not here","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"981909798535164","commenter_b":"No, I don't think he have to.","commenter_a":"No","post_message":"Bernie Sanders doesn't talk very much about faith beyond saying he's culturally Jewish. Jimmy Kimmel asked him, point blank, if he believes in God, and he framed his answer in a rather unique way. Do you think a president must have a belief in a god to be a good leader?"},{"comment_id":"10153839105457994","commenter_b":"What a sassy little shitbag ... definitely you 😉","commenter_a":"Jamie spirit animal","post_message":"Because sometimes, you just need to tear apart a room. Have a great weekend."},{"comment_id":"10155357191987439","commenter_b":"No thanks in representing the USA. Just another Linda Sarsour.","commenter_a":"Pretty sure this was found to be another muslim playing the victim","post_message":"Muhammad, a lifelong American citizen, claimed in an interview last week that she was detained \"just a few weeks ago\" by U.S. Customs and Border Protection agents. She said she was held for two hours without explanation."}]
