[{"comment_id":"1281672095204357","commenter_b":"Yep, in with the younger roaring lion, out with the old senile evil slimy snake.","commenter_a":"I hope he can get Congress to kick them out of NYC. That building would make a remarkable place to house and care for our vets and homeless. That would save us so much money. The UN is not needed for us. No one I know wants to belong to a One World Order and governance. Let them move somewhere in Europe and take Soros with them.","post_message":"This is going to be good..."},{"comment_id":"924961764238223","commenter_b":"Some companies are specifically recruiting unskilled migrants because they know they can get away with paying them next to nothing! Also these entrepreneurs you speak of often pay such little to their employees so they can get rich themselves!","commenter_a":"70% tax from working people to pay while we have so many lazy unemployed sitting at home seems fair","post_message":"She says injustice and inequality makes her \"as angry as the Hulk\"..."},{"comment_id":"971472706302942","commenter_b":"That's where she belongs! That's where she belongs! That's where she belongs! That's where she belongs! LOCK HER UP!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"More Wikileaks revelations: 1) Ted Cruz allegedly asked the DNC for MONEY to help fund his delegate fight in Cleveland (specifically: Eric Bennett to and from Ken Cuccinelli, R-Virginia working with Ted Cruz and the DNC to undermine the delegate selection before the convention). Working to push through rules changes in the rules committee and working to flip bound delegates against the rules and state law. All co-ordinated with the DNC. 2) Jake Tapper of CNN allegedly colluded with the DNC. They gave him questions to ask his interview guests. 3) Chuck Todd of NBC allegedly was also colluding with the DNC and put pressure on others at the network to go easy on Democrats at the DNC’s request. 4) The New York Times allegedly co hosted parties with the DNC. This is against the law. 5) Hillary Clinton allegedly setup a slush fund through the DNC to launder donor ...","post_message":"Live Now: Jesse Watters and Brian Kilmeade are here at the Facebook Live Lounge from the Democratic National Convention and they're taking your questions! Comment below:"},{"comment_id":"692747934208970","commenter_b":"If illegal aliens must be allowed into our colleges, they should be charged twice the tuition as out-of-state students, with no eligibility for any financial aid, and any courses that legal aliens are taking in order to obtain citizenship be mandatory.","commenter_a":"He'll no!","post_message":"Do you think illegal aliens have a right to attend taxpayer funded public universities?"},{"comment_id":"1023513341058227","commenter_b":"Go figure. A business in business to make money. She should know, she's the biggest criminal of them all.","commenter_a":"imagine that, a company in business to make money. You can't fix stupid, but you can vote it out of office, or in this case make sure it doesn't get into office.","post_message":"This is most likely the dumbest comment she has made to date..... so far."},{"comment_id":"10154166342376717","commenter_b":"FUCK HER","commenter_a":"I think Caitlyn is a fake I mean if she was a true Transgender she would've turned her back on trump a long time ago","post_message":"The transgender reality star and former Olympian is believed to have accepted the invitation and is looking for a plus-one to accompany her."},{"comment_id":"10152801050747377","commenter_b":"Not in favor with illegals, but let's not forget that we are here illegal too, the Indians are the only people here legally!","commenter_a":"Let's raise the percentage point!","post_message":"56 percent are against granting amnesty to 5 million illegal immigrants currently living in the United States."}]
