[{"comment_id":"1141972632481659","commenter_b":"I think they should exact a form of sharia law on these ME males. Cut their peckers off. They are stealing from these women","commenter_a":"Europe wake up and time to get you at of my bed. We can't except no more of this crime it's disgusting and these middle eastern got to go bye bye and ready for there deportation sentence. We don't want to hear no more of liberal excuses oh it's racist.Racist my face those people deserve there jail sentence and then there deportation sentence.","post_message":"Drip, drip, drip: News of more Muslim sex attacks leaks out"},{"comment_id":"10153931678551523","commenter_b":"You can't fix stupid! This bitch is flat out ignorant","commenter_a":"She's the same sister that said to take all the violence to the suburbs, but yet she condemns it. Lmao Yeah, condemns it when it's in her part of town, but to hell with the rest of the city and surrounding areas.","post_message":"One-on-one with the sister of Sylville Smith. She spoke exclusively with FOX6's A.J. Bayatpour on Monday. @webpagelink"},{"comment_id":"10154024812315470","commenter_b":"Lol, whatever you have to tell yourself... moron.","commenter_a":"Seeing how anti-science Bernie is and how his followers uncritically swallow his anti-science stand I wouldn't be shocked by the numbers that try this.","post_message":"BE ON THE LOOKOUT! A picture going around on social media looks like an ad supporting Bernie Sanders, offering instructions on how to make so-called Bernie Sanders glow sticks. The recipe is actually for a deadly chlorine bomb."},{"comment_id":"10153523680568606","commenter_b":"God Bless ♡ Hearts broken♡","commenter_a":"It time to vote trump","post_message":"The remains of the four Marines gunned down in the Chattanooga attack were transported through Northern Virginia. @webpagelink"},{"comment_id":"10154787098266438","commenter_b":"@username exactly, many of the \"1%ers\" are pro choice liberals, they can fund it.","commenter_a":"Just goes to prove, don't make women angry. We don't get even, we get revenge. Elected officials had no idea what they did. This is just a start. With Elizabeth Warren, Bernie Sanders, Schumer, and many others we will take our rights back. Ryan and Trump need to be scared, very scared.","post_message":"Huge crowds everywhere from D.C. to New York to Chicago to LA to Memphis to Nashville to Raleigh to Denver to Idaho ..."},{"comment_id":"1030546040397732","commenter_b":"Lock her up","commenter_a":"Can't do it fast enough! Lock her up!!!","post_message":""},{"comment_id":"1131664770254026","commenter_b":"You should try to get one. Aiden needs a service dog as well.","commenter_a":"@username you need one!","post_message":"✔ Laundry ✔ Dishes ✔ Shopping WATCH: This service dog in training is wowing the internet with all the ways she helps her chronically ill owner @webpagelink"}]
