[{"comment_id":"10153618573248984","commenter_b":"@username ANOTHER IDIOT FOLLOWER","commenter_a":"ANYONE WHO SUPPORTS HIM IS A ASSHOLE","post_message":"Trump is tearing it up! This is sure to make his haters absolutely livid. Do you support Donald Trump?"},{"comment_id":"900706196692300","commenter_b":"So, David, share some more of your white Texan wisdom. What is a \"real woman.\" Please, mansplain it to us.","commenter_a":"I still have trouble with why anyone would want to become an elderly woman.","post_message":"\"I think [Bruce] Jenner has a right to do what Jenner wants to do, and the way Jenner wants to do it.\" -Jeffrey Tambor"},{"comment_id":"10154493231947235","commenter_b":"That's if she lucky..now don't get me wrong,I never hit a woman,but this bitch would've caught a 1989 Mike Tyson uppercut to da jaw at best case scenario lol","commenter_a":"Why can't I see none of these people...man I'm telling you,if that was my daughter she was talking to,her fucking head would've been in her mailbox","post_message":"What an absolutely HORRIBLE person"},{"comment_id":"10153097012535329","commenter_b":"Lauren Youssef","commenter_a":"Lily, Marielle we need this!","post_message":"BuzzFeed Life can confirm that these delightful Oreos are VERY REAL AND VERY GOOD."},{"comment_id":"10152727190457452","commenter_b":"This is why women do NOT belong in an all male environment. You uptight B****s can't even take a joke.","commenter_a":"Is she going to use a flag or a kitchen rag?","post_message":"Meet Sarah Thomas, the first woman hired as an NFL official, according to reports. @webpagelink"},{"comment_id":"1073730232720030","commenter_b":"Their all prostitutes, lol","commenter_a":"Mika was raised and programmed to be a prostitute by her father. She's very accommodating when it comes to white politicians and Chinese business men.","post_message":"A hot town hall mic just exposed Trump as the fraud he is."},{"comment_id":"10155605832169657","commenter_b":"Lock her up","commenter_a":"When you see it written out like this, it is nothing short of stunning. Clinton emails. Trump admitting sexual assault. Clinton emails. Trump charity fraud. Clinton emails. Trump calls for nuclear proliferation. Clinton emails. Trump calls for national stop and frisk. Clinton emails. Trump violates trade embargo with Cuba. Clinton emails. Trump sued over Trump U fraud. Clinton emails. Trump bribes DA. Clinton emails. Trump doesn't pay taxes for 20 years. Clinton emails. Trump employs campaign manager involved in illegal corruption with Russia. Clinton emails. Trump calls for ban of an entire religion from entering US. Clinton emails. Trump lied about support for Iraq War over and over in debate. Clinton emails. Trump in court for rape of a minor. Clinton emails. Trump unaware of Russia's Crimea occupation. Clinton emails. Trump unaware of situation in Syria. Clinton emails. Trump penalized for racist housing discrimination. Clinton emails. Trump files for bankruptcy ...","post_message":"Hillary wants you to believe that there's nothing to see."}]
