[{"comment_id":"10153472333633352","commenter_b":"So how do you teach your girls how to be in a stable relationship?","commenter_a":"I have 3 daughters & until they grow up, no man will harm them under my roof. I sacrifice my dating a man or finding a love, so they can always feel safe. I won't allow a man to enter my life until my task is finished!","post_message":"Woman Murdered by Boyfriend After She Allegedly Asks Him If He Assaulted Her Daughter in a Sexual Manner – Daughter Also Murdered, Then Man Takes Own Life."},{"comment_id":"1000377376688677","commenter_b":"Just stay the hell out of America...we don't need your crap here.......Stay in your own country......These buttwipes are allowed to do this in their country, so go home and do what you want, keep it out of America!!!!!!","commenter_a":"1. First the US gov attacks its own people on 9.11 in false flag operation 2. They blame the attack on Osama Bin Ladin, a fictitious character created by the CIA and played by several actors. 3. The US makes war on two countries using false pretexts for war, both times. 4. The US uses drones to kill \"terrorists\" which include many innocent Islamic peoples 5. The US gov pretends to kill OBL as some kind of fake victory. Obviously, they cannot allow the remains to be scrutinised so they jetison it at sea and take no photographs either. All lies. 6. The US War on Terror is very similar to the Crusades where four centuries of young Christian men were lied to by the Pope and told to go brutalise and savagely attack innocent Saracens who were safeguarding the Holy sites in Palestine 7. In the US, whites kill ...","post_message":"And he wanted to take a second wife 'because it was allowed under Islamic law'"},{"comment_id":"10153070699666028","commenter_b":"Cuz ur DUMB","commenter_a":"No vote here !!!!","post_message":"\"I have a great relationship with the Mexican people\": Donald Trump tells NBC in an interview that \"there's nothing to apologize for\" regarding his comments made about Mexican immigrants last month. He says he believes he will win the Latino vote. \"I will create jobs and the Latinos will have jobs that they don't have right now. And I will win that vote.\" @webpagelink"},{"comment_id":"10153523101282169","commenter_b":"They don't have a wall...just go....and demand your rights....lol","commenter_a":"@username, you are cool water in a desert of ignorance. Please don't think we are all so ignorant of our world.","post_message":""},{"comment_id":"1142306435836110","commenter_b":"What a piece of shit! And fuck the judge that his mommy and daddy paid off!","commenter_a":"White privilege at its best","post_message":"Man charged of raping 2 unconscious women only gets probation and won't have to register as a sex offender! #WSHH #SMH"},{"comment_id":"10153013739666336","commenter_b":"Those Iranians Wouldn't Be Dumb Enough To Fire Pop Shots At Our Ships!, That WOULD Be A GRAVE MISTAKE!,","commenter_a":"Haha good luck!!","post_message":"VIDEO: Iranian state TV showed footage of Iran’s Revolutionary Guard conducting a drill that struck a mock U.S. aircraft carrier with missiles. @webpagelink"},{"comment_id":"10153170015287690","commenter_b":"Eeewww No girl!!! Hate Snakes","commenter_a":"Margaret thought of your pet at Millies.","post_message":"\"If one got in the house or in the cars, I would have to move.\" One North Texas family fights hundreds of copperheads on their property: @webpagelink"}]
