[{"comment_id":"10153026987796051","commenter_b":"I hope that bitch never gets out alive from prison that poor little baby how can anyone do that to a baby much less a mother it makes me sick I want to knock the crap out of her that baby could not defend herself and the pain it must of went true","commenter_a":"Disgusting! Horrific, she is supposed to be her daughters biggest protector!!","post_message":"Even the police were caught a little off guard when they saw the pictures this woman had of her infant daughter."},{"comment_id":"10153243373545950","commenter_b":"Go Hillary...to JAIL","commenter_a":"BREAKING NEWS: Donald Trump, Republican presidential candidate drowned today, apparently he was trying to learn to waterboard.","post_message":"President Obama banned the practice of waterboarding and other so-called \"enhanced interrogation techniques\" after he took office. But Donald J. Trump said he would \"bring it back\" to fight ISIS."},{"comment_id":"724979780984130","commenter_b":"Let's not forget that the woman also has to spread her legs.","commenter_a":"I have been saying this for years. The whole thing starts when a man can't keep it in his pants. He has no business telling women what they should or shouldn't do.","post_message":"Let me share a piece of myself. Yours truly was abandoned as a newborn by a man who now he is 100% against abortion. I guess me being taken to Arkansas and being raised by an abusive stepfather (and the first few years in a shack with an outhouse and a well for water) was OK. I appreciate that I had a chance at life. But you men who think you can make decisions for women? STFU. Now. ~tiff via Occupy Democrats"},{"comment_id":"10153197495351378","commenter_b":"Why Yall want her to get charged so bad , ..Focus On them Cop killers niggaz","commenter_a":"Thats really strange... Ive never even heard that song!!","post_message":"VIDEO: A woman slammed on her brakes and then stepped out of her car while it was still moving in a bizarre crash caught on a dashboard camera. @webpagelink"},{"comment_id":"10153792306655329","commenter_b":"Love watching this grossness!","commenter_a":"Tom Genaway","post_message":"jlskjerssjklrjsl"},{"comment_id":"703561329834445","commenter_b":"Get that pos out at any cost.","commenter_a":"Dreams Dreams. What The Fuck Ever. I only get 3 wishes. Anyone got a lamp I can rub.","post_message":"Obama impeachment process takes huge steps forward... he's finished. This is great news. He should have been gone long ago. Can we get 30,000 'LIKES' to have Obama impeached?"},{"comment_id":"1195300027229716","commenter_b":"Nope, they would be saying who wants a whore for president. Very hypocritical.","commenter_a":"If Trump is so rich, why can't he afford better concealer? I mean damn, look at him in this picture.","post_message":"GREAT question!"}]
