[{"comment_id":"10153809983489486","commenter_b":"She needs jail","commenter_a":"oh hell, I know of NO ONE brave enough to bully Hillary","post_message":"Lol, Hillary fishing for sympathy.."},{"comment_id":"10150906812849999","commenter_b":"Which candidate doesn't?","commenter_a":"Guys he meant he is happy that nobody died lol get over it you all know what he meant. He says a gaffe, everyone is on it and saying how ill qualified he is, yet 99% of the time he is showing his wits no one cares.","post_message":"\"Well, first of all, just grateful that nobody got hurt,\" Gary Johnson told CNN after the attacks in New York and Minneapolis."},{"comment_id":"1362278090453725","commenter_b":"GET THE FUCK OUT!","commenter_a":"Send them home","post_message":"Muslims Banning 9/11 Memorial Because It’s Racist. They have no respect for the country we live in. Do you think they are the racists?"},{"comment_id":"1796967167212138","commenter_b":"What an idiot!!! Cher became a Chair!!!","commenter_a":"Scum of the earth. Crawl back into your hole.","post_message":"**Irony Alert**"},{"comment_id":"10152744532057426","commenter_b":"This is what I call a real woman","commenter_a":"Congrats to her! Yay!","post_message":"She said she would spend her new millions on her church and her children -- one of whom has cerebral palsy."},{"comment_id":"10153963537435579","commenter_b":"Defeat lsis & send all refugees home ! Simple","commenter_a":"Best plan would be to stop funding, remove all troops and leave other countries alone.","post_message":"Speaker Paul Ryan: \"What happened in Paris is pure evil's clear this was an act of war and that the world needs American leadership. The National Defense Bill that I will sign later today will requires the President to come up with a plan for defeating ISIS, not just containing, but defeating ISIS. A containment plan is not enough.\""},{"comment_id":"1168375003221975","commenter_b":"This smacks of Naziism!! He is trying to intimidate the minority vote. He is so disgusting and despicable . We must come out in force to stand up to this type of scare tactics!!!!","commenter_a":"Well in my State, of Washington, like many other States, voting is done by mail or can be dropped off at drop boxes for elections only. So will his people be harassing the Postal employees? And for any States that still go to the polls, those State governments better damn well make sure that ALL citizens can get to their polling places unmolested. And if that means with police protection, so be it. Then, charge the GOP for all of the overtime for said protections that will need to be paid.","post_message":"Unable to win, Trump now looks to blocking Hillary voters with an army of deranged volunteers."}]
