[{"comment_id":"1007076626015699","commenter_b":"Yes they need to hire them back and get rid of the illegals that took there place ...what needs to be done is the illegals need to be shipped out of this country we don't need them not do we want them","commenter_a":"they need to hire them back","post_message":"Trump also criticized Marco Rubio for sponsoring the \"I-Squared\" bill that would TRIPLE the number of H-1B foreign visa holders in the U.S."},{"comment_id":"10152852591771749","commenter_b":"no body know mr. president.... it depends if the people believed to have done the right thing","commenter_a":"United we stand as the greatest nation in the world. USA' USA' USA!","post_message":"Let's go."},{"comment_id":"10153420675841162","commenter_b":"They should be out in the wild with their mom","commenter_a":"Michelle Papandrea","post_message":"ADORABLE! Take a look at the latest arrival at Metro Richmond Zoo in Virginia: 3 cheetah cubs..@webpagelink PHOTOS: @webpagelink"},{"comment_id":"10153767198963690","commenter_b":"@username it is not just three countries being destroyed, all the countries in Europe to which the refugees are going will be destroyed economically, culturally, life as they know it will never be the same.","commenter_a":"Saddam a cde to be missed, a last Iraqis leader","post_message":"\"There are plenty of Iraqis for whom Saddam is a nightmare that they never want to see again. His legacy here, though, is complicated. It's not as simple as 'Dictator Bad, Democracy Good,' as the architects of the Iraq war would have you believe.\" Al Jazeera's Imran Khan, in Baghdad, filed this Reporter's Note."},{"comment_id":"10154865700468256","commenter_b":"Aaaaaaannnnndddd just fortifying my position even more!! Lmfao!","commenter_a":"I sit back, a giggle my butt off at all these liberals grasping at straws to stop Donald Trump. Such hypocrites, because just 8 years ago when Obama was elected, they were so critical of the \"birther\" cries from conservatives...... I guess when your horse loses the race, you go chasing unicorns!!","post_message":"Pressure on members of the electoral college to select someone other than Donald Trump has grown dramatically - and noisily - in recent weeks, causing some to waver ahead of the Monday vote."},{"comment_id":"553770641467261","commenter_b":"Who even cares what that woman thinks? She's a murderer!","commenter_a":"Fricking Amazing, right!?!?! What a POS","post_message":"Is this hypocritical? WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"10155447635791509","commenter_b":"She just needs to shut up. She's backing a rapist wife","commenter_a":"Wikileaks is Hillary's nightmare","post_message":"\"I can't believe that I am saying that a candidate for President of the United States has bragged about sexually assaulting women,\" Michelle Obama, speaking in New Hampshire, addresses the Donald J. Trump tape @webpagelink"}]
