[{"comment_id":"10154625084044270","commenter_b":"To me she is worthless. And don't care for this evil women. End of story!","commenter_a":"On no that's like putting killary in charge. She is a very evil women. Not good for New Mexico or the air force.","post_message":"President Donald Trump announced he will nominate Heather Wilson, a former congresswoman and Air Force Academy graduate, as the new United States Air Force secretary."},{"comment_id":"10153802989025927","commenter_b":"If you are here legally you have nothing to fear, stop listening to liberals who pander fear...If you are here illegally than yes, you might wanna vacate before being made to leave...This is not a hard concept, it's quite simple, if you are here illegally leave and immigrate back legally, if you are here legally ...What are you worrying about?","commenter_a":"If these people want to engage in disrespecting this country by burning the American Flag and demonstrating allegiance to another the authorities should round them up and deposit them in that country they love so much. This is getting to be far far too common and needs to be stopped. They can go to these countries they love so much and demonstrate and destroy things there","post_message":"PROFESSOR: am getting many heartfelt notes from students who are in shock over the election returns and , rightly or wrongly for their families ..."},{"comment_id":"850737528316277","commenter_b":"Does anybody realize the U.S. has 5,525 miles of border with Canada and 1,989 miles with Mexico. Our maritime border includes 95,000 miles of shoreline. How do you propose to secure this border? How do you propose to identify and round up 11 million people and deport them? I would really like to hear your reasoned proposals.","commenter_a":"just do it already.","post_message":"Don't you think we should start enforcing CURRENT immigration laws?"},{"comment_id":"10152744778310950","commenter_b":"Yeah, the law is very very clear. @webpagelink","commenter_a":"There is no justification for the killing. However, the entire incident could have been avoided if he would have stayed in the car.","post_message":"JUST IN: Newly released dash cam video shows the moments before the deadly police shooting in South Carolina; Walter Scott is seen running from the driver's seat @webpagelink - CBSN"},{"comment_id":"1602376966724515","commenter_b":"@username I am fully aware of who I have voted for since 1992. Hillary Clinton put herself in this position by NOT doing what's right and serving HER own interests. Public Service is a privilege and shouldn't be abused. I look forward to more ethical women running for President in the future, hopefully in my lifetime.","commenter_a":"She puts herself in a coma just hearing herself!! Her own husband is so unimpressed, HE doesn't know her campaign slogan!!","post_message":"LIVE NOW: Hillary Clinton early vote rally, Cedar Rapids, Iowa"},{"comment_id":"10154712267998145","commenter_b":"@username no you're just a pussy","commenter_a":"And the trend has been set. Everybody just open fire at will. Don't worry about those pesky innocent bystanders and there's no need wasting tax dollars on a trial. Apparently stealing is an automatic death sentence. From diapers to Dodges citizens can now act as judge, jury and executioner. Smh.","post_message":"A man shot at least 18 times at someone who had stolen his pickup truck early Monday from an apartment complex, the Winter Garden Police Department said"},{"comment_id":"10153053091263984","commenter_b":"HOW ABOUT MOVE OUT OF THE WH!!!!","commenter_a":"all the kids should pack their lunch","post_message":"Alright Michelle Obama, 'Let's Move' on to you finding a new hobby. Preferably something that doesn't involve pushing this agenda on Americans..."}]
