[{"comment_id":"1107115119405265","commenter_b":"I've heard more sense coming from a crack head","commenter_a":"Can't these people realize somebody is going to have to pay for \"free school\"?","post_message":"ClashDaily.com"},{"comment_id":"10154883066819411","commenter_b":"They don't care about children being blown to bits as long as they can let trans use women's toilets and have gay marriage","commenter_a":"They are so fukn stupid. Clinton will plunge this world into war and then run for the nearest bunker.","post_message":""},{"comment_id":"1875959669293549","commenter_b":"I believe that she should be charged. I wonder if that would have happened if it was a white MALE officer. Just wondering.","commenter_a":"I believe she checked it for a person.","post_message":"BREAKING: Tulsa police officer Betty Shelby has been charged with manslaughter in the first degree. Shelby fatally shot 40-year-old Terence Crutcher"},{"comment_id":"10153519405836680","commenter_b":"You are exactly right @username. It's so sad how ignorant and blind people have become. Saying we need illegal immigrants. Wow. Have you people not seen what's going on in Europe. No they need to come to this country legally people... Thank God we are gonna get it fixed this November. And that's how it will be. We will have a safer country. Trump2016!!!!!!!!!!!!","commenter_a":"Let us call it what it really is \"Bernie Sanders hugs illegal aliens at campaign rally.\". They are not undocumented immigrants because they have not followed the immigration process to get here. They are criminals. Justice needs to be dealt out to them.","post_message":"Bernie Sanders hugs undocumented immigrants at campaign rally."},{"comment_id":"10153552343052452","commenter_b":"What a shitbag","commenter_a":"These people have no shame... very sad..","post_message":"An Alhambra homeowner caught a package thief in the act and recorded the woman as she tried to swipe two boxes from his porch. Police are now searching for the culprit. abc7.la/1Wt5Auf"},{"comment_id":"10153373038333855","commenter_b":"Kill this witch","commenter_a":"She wants every legal consequence possible so she can be a Christian Martyr!","post_message":"BREAKING: Kentucky clerk defies Supreme Court."},{"comment_id":"1028272853931448","commenter_b":"She wasn't even twerking she was just bn silly joking like she was. Pull up her dress with spanks under Neath......its really not a big deal. If Obama get mad about that he shitty.","commenter_a":"Carlos Aden Carlyle lol","post_message":""}]
