[{"comment_id":"10153722562581800","commenter_b":"Gosh, I hope you are not able to reproduce. Idiot!!!","commenter_a":"I think no one bars militant Christians from the country, or seeks to deport them, just because Christians are responsible for most acts of violence and terror in this nation.","post_message":"Mike Huckabee went on an alliteration spree on cable news recently, saying the following about the response to the Paris attacks: \"[Democrats are] more interested in protecting the image of Islam than they are in protecting Americans...If these were Militant Methodists, Extreme Episcopalians, Bad Boy Baptists, do you think we would be afraid to say that?\" \"No we would not be afraid to say that. Because Bad Boy Baptists is an awful name for a terrorist group, but a GREAT name for your Christian Soul Rock, one man, bass-only album.\" - Trevor Noah ►Watch now: @webpagelink"},{"comment_id":"1824233217832680","commenter_b":"Yep! I saw what DT paid for in this campaign, thousands and thousands of his campaign signs , thru WV, Ohio, Mi. Drove it many times from NC due to a deaths in my family. I couldn't believe how many I saw and where they were. Really in the oddest of places too. Someone was paid to put them up.","commenter_a":"I love my Affordable health Care, it has saved my life. It's very important to have coverage for everyone in our country. You never know when you my need it. The health care conglomerate has made it expensive, big Pharm etc..etc.. not OUR President! What he did was great for this nation, and yes I would tweak a few things but all-in-all we need this for a healthy people!","post_message":"Your experience with the Affordable Care Act? #ACA"},{"comment_id":"10153904790105496","commenter_b":"Why is this guy not convicted yet...","commenter_a":"Oh no!","post_message":"Thermal experts say temps inside Ross Harris' SUV could have been as much as 125 degrees while Cooper was inside. Watch LIVE trial analysis now: @webpagelink"},{"comment_id":"1247936331966085","commenter_b":"So tired of explaining this exact sad truth.","commenter_a":"Learn the difference.","post_message":"It was clear from the start the criticism wasn't about the flag."},{"comment_id":"932144616915891","commenter_b":"Kill em thier lives don't matter they are scum","commenter_a":"I'm with @username not about race but individuals robbing with guns . Really is that anyone can see? Not criminal activity. Because this is a crime.","post_message":"He's got a package and a uniform, but he's no delivery guy. Once you open the door, his gun-toting crew moves in for the robbery. Now police are warning about the slick new holiday scam. The dangerous delivery - @webpagelink"},{"comment_id":"620704854748480","commenter_b":"agree","commenter_a":"Agree","post_message":"Enough said."},{"comment_id":"814884995294947","commenter_b":"this is sick.stupid bitch,","commenter_a":"SLUT TRASH","post_message":"Only thing this proved is that she is flippin' disgusting. @webpagelink"}]
