[{"comment_id":"10150734990144999","commenter_b":"Now it's time to loathe Coldplay, then in ten years, we can appreciate them again.","commenter_a":"Never heard of anyone hating him I think this is a media thing thought up by some little intern that thinks he was being smart","post_message":"After decades spent as the target of jokes and sneers, Phil Collins is getting a fresh look."},{"comment_id":"10154462492528487","commenter_b":"Depends on your view. How much of the worlds' healthcare systems have you been a part of, witnessed or experienced. We are not perfect but we are so far from \"sucks\"","commenter_a":"The crap we have now sucks","post_message":"What would TrumpCare mean for Americans? Essentially, a public health disaster."},{"comment_id":"10154542525666051","commenter_b":"So we get rid of all the illegals and we pay $5.00 for a head of lettuce cause who is going to do all this work?","commenter_a":"Sneaking into our country is explicitly illegal. Why is Mexico allowed to have a wall on its southern border with strictly enforced immigration laws but America isnt? What would happen to 100% of Americans caught illegally entering","post_message":"The Trump Administration's latest deportation plan is explicitly illegal under international law. Here are the details:"},{"comment_id":"1753089554908587","commenter_b":"Race has nothing to do with him being a dumbass.","commenter_a":"and he owes over 10.000.000 to creditors in US","post_message":"Kanye West is finally leaving. Thank the lord. We don't want him anyway. Can we get 5,000 'LIKES' to have Kanye leave for good!"},{"comment_id":"1801737773446077","commenter_b":"Hell no stupid BITCH","commenter_a":"That's what this country is all about- Idiots supporting idiots!","post_message":"President Obama called Hillary Clinton the most qualified presidential candidate ever. Do you agree?"},{"comment_id":"812922865409803","commenter_b":"Imagine being the daughter of the two biggest a$$es in recent history - how would YOU react?","commenter_a":"she is a teenager, let her alone .... I am as anti-obama as the hext person, but geeeeeeeeeeez ... don't attack a kid","post_message":"Why is she supporting this?"},{"comment_id":"10153213873086051","commenter_b":"Go to he'll bitch","commenter_a":"It's a lion it is legal to poach lions but legal for canned hunting everyone is having a cow because someone killed a famous Lion If you care so much about animals stop going to the zoo and the circus Stop buying products that test on animals donate to animal charitys Bitching on facebook solves nothing this man made a mistake leave him alone you self righteous idiots","post_message":"The hits just keep coming for Cecil The Lion's pride."}]
