[{"comment_id":"1107371389322608","commenter_b":"The bloke with the pube beard is better looking then mwah? Ok STEVIE WONDER","commenter_a":"Looks like he's put glue on his face and rolled around a barbers floor","post_message":"Hug-me-Muslim ‘threatened to bomb MPs house"},{"comment_id":"1766583846919055","commenter_b":"I think she is an egotistical show-off.","commenter_a":"I think nothing about it.","post_message":"What do you think of the dress?"},{"comment_id":"984289534964128","commenter_b":"Easy. Stop all benefits to foreigners.","commenter_a":"Foolishly, in October 2014 Italy left-wing government became the first European Union country to decriminalise illegal immigration and deploy its navy at huge expense to save migrants crossing the narrow Sicilian channel in open boats from North Africa (Libya mainly) in order to bring them to Italy and thus the European Union where most remain. The policy change, driven by a perverted mix of human decency and political correctness, was pure folly: it has acted as a green light to wannabe boat people everywhere, whose numbers soar as the chaos in Africa and the Middle East escalates. The result is an exodus of biblical proportions out of Africa and the Middle East into Europe. The Welfare System in Britain and Ireland is the main attraction for these illegals. Action needs to be taken now to STOP this Exodus!!!!!","post_message":"Forget the Greek crisis or Britain's referendum, this wave of migrant's is Europe's biggest threat"},{"comment_id":"1043167352401972","commenter_b":"She needs to be fired.","commenter_a":"Again I say\"get rid of her\". There are many patriotic qualified principals out there.","post_message":"A New York school principal has banned the Pledge of Allegiance, Thanksgiving and Santa. The school's PTA president Mimi Ferrer told 'Fox & Friends,' \"We are in America. We're supposed to be proud of where we are.” @webpagelink"},{"comment_id":"1079856352035375","commenter_b":"Wow","commenter_a":"White and gold","post_message":"o.O"},{"comment_id":"10152933128350671","commenter_b":"That's because when you were younger they weren't mixing the vaccination like cocktail drinks.","commenter_a":"I'm 45 year old hot all my vacs as a child and I'm ok","post_message":"The Senate on Monday reaffirmed the bill striking California's personal belief exemption for immunizations on a 24-14 vote."},{"comment_id":"10154558604929411","commenter_b":"dont worry Ann, no one would wana rape your fat ass","commenter_a":"What I find terrible is that if anybody wears a bikini they \"have chances of being raped\". Sorry, but France has to keep their country free of this BS. Next time a french woman steps into a pool in a bikini, will she be molested by this woman hating monsters?","post_message":"The pool park has allowed bathers to wear burqinis and jilbab de bains as way of exception"}]
