[{"comment_id":"10157068560150354","commenter_b":"When you ignorant fucking blacks start acting like black lives matter, maybe then I'll start to believe that black lives matter. Until that happens, and I doubt it ever will, keep killing each other and SHUT THE FUCK UP. Your BLM movement is a FUCKING JOKE;nothing more than LOW LIFE, FUCKING ANIMALS.","commenter_a":"I HOPE THIS IS AN ISOLATED INCIDENT. FOR THOSE WHO STOOD BY AND WATCHED, MAY THE SAME HAPPEN TO YOU.","post_message":"A shocking Chicago video reveals the horrifying death of 32-year-old Marques Gaines..."},{"comment_id":"10152861667311045","commenter_b":"I don't agree with abortion, but when you have an abortion the baby dies, it's suffering is over. Women who do drugs while they are pregnant can cause problems for these children their entire lives. And we foot the bill for it. They should be charged, never given their kids back and the law should stop having these double standards. And if they didn't cause their kids damage then they still did the equivalent of putting a gun to its head and playing Russian roulette, which would also be child endangerment and child abuse.","commenter_a":"Does anybody find it ironic that they can be charged for exposing their unborn babies to drugs while it is legal for them to kill/abort those same babies? Either unborn babies are people with rights or they aren't. Odd how \"the law\" can have it both ways.","post_message":"Two Shoals women are charged with exposing their children to drugs. Both women are pregnant, and are in the community corrections program. Investigators say the two failed mandatory drug tests."},{"comment_id":"10153268969721336","commenter_b":"How stupid r parents...it is not that hard to put this on a tall shelf...what a bunch of dumbasses...","commenter_a":"Survival of the fittest.","post_message":"This year, U.S. poison centers have already logged an average of 31 exposures to laundry pods per day."},{"comment_id":"10157484651970725","commenter_b":"@username PAM she is already DESTROYING THE COUNTRY !","commenter_a":"Go trump ! So, 96% of Hillary's charitable donations went to the Clinton Foundation! Yeah, 96%, they donated to themselves.","post_message":"Unbelievable! Thank you Erie, Pennsylvania. This is a MOVEMENT! I have no doubt that we are going to WIN -- and MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"10153665650660927","commenter_b":"Not for illegals","commenter_a":"So can't wait to escape this looney bin state.....","post_message":" all Californians no matter their immigration status in comprehensive coverage is not only a more humanitarian approach, it also ...\""},{"comment_id":"10154898631786729","commenter_b":"But at least she was honest enough to release her tax returns,something that Trump still hasnt done.What damning information is Trump hiding in those returns?Has it to do with his business dealings with the Russian oligarchs.","commenter_a":"The old switch a roo...creative tax scheme?","post_message":"Something's rotten all right..."},{"comment_id":"10152964410961130","commenter_b":"It's Bush's fault Duh","commenter_a":"If they'd have shot him it would be all because he's black & a victim of the evil white man lol","post_message":"Have you seen this man?"}]
