[{"comment_id":"10153971100801600","commenter_b":"If we won when I was a kid my parents would have kept me out. My son deserved to be there... I was more than happy to take him!","commenter_a":"Shouldn't of had school","post_message":"The numbers are in. Should parents have taken kids out of school for the parade?"},{"comment_id":"10153615563223812","commenter_b":"Well some people family don't care","commenter_a":"(rolling eyes) if she was white and was found hung in a cell, no one would say a word.","post_message":"While Sandra Bland's family and supporters have been calling for an independent investigation into her death, the DA plans to release the dash-cam footage from her arrest: @webpagelink"},{"comment_id":"10152717878976770","commenter_b":"Too many nut-jobs in higher education these days. Bet she sues the school if she gets sunburn.","commenter_a":"Stupid is as stupid does and we all know you can't fix stupid.","post_message":"We're pretty sure that's not going to work..."},{"comment_id":"10154467754523010","commenter_b":"@username .... Look who's talking?! Trump got his mistress pregnant, that's were his second daughter came from. Malania said, in her plagiarized speech, that she Trump had been together 18yrs....Trump was still married to wife number two at that time! Children with three different women!!!!! Can you imagine what the Republicans would be saying, if that was Hillary?! Hypocrites!!","commenter_a":"He and Bill should hang out since they both cheated on their wives multiple times. Nothing like knocking up the maid. #NeverHillary #ImAgainstHer #VoteTrump","post_message":"Not quite hasta la vista to the Republican party."},{"comment_id":"935330543153792","commenter_b":"Kiss your mother with that tongue Karen?","commenter_a":"Excellent news. The courts have prevented the Harper regime from taking over the judicatory.","post_message":"It was the third time Khadr's case has been before the Supreme Court of Canada, and the third time the justices have ruled in his favour."},{"comment_id":"1172261136143561","commenter_b":"iPhone 7 will murder Note 7, with its 720p display and 2000 mAh battery. *Slow claps*","commenter_a":"Verge commenters won't like to admit verge is now defending samsuck. Looks like Samsung paid Verge, the iPhone 7 will murder this on benchmarks AS IT ALWAYS DOES","post_message":"Seriously, everybody chill."},{"comment_id":"874758175906540","commenter_b":"1400 years Muslims have done nothing but murder...Muslims gave humanity the dark ages,Muslims have been murdering and destroying the new body count 750,000,000 and growing..this death cult will and have killed their own it will not matter!","commenter_a":"Don't we all feel better because the NYT supports the great community organizer? Hell, I may just go to work!","post_message":"The only war the Obama administration is fighting is 'the war for American public opinion.'"}]
