[{"comment_id":"1549351415084883","commenter_b":"Dear Miss Jordan the idiot is not I that's for sure, just remember this this is not your land to start with. I hope you don't have an issue with the Native Americans because if it's true you should go back with you where you from.","commenter_a":"Why does the police have military style vehicles, why does the Native Americans still have to defend their land, why our government doesn't do anything about it.... Same old story oil companies rule the world.","post_message":"Watch as police in riot gear use pepper spray on activists protesting against the Dakota Access Pipeline. Multiple were arrested. More: @webpagelink"},{"comment_id":"1216674918389035","commenter_b":"Vote Hillary","commenter_a":"Vote Hillary","post_message":"“En mis primeros 100 días, voy a introducir legislación para una reforma migratoria integral con camino a la ciudadanía. Esto no solo es lo correcto sino que cada análisis independiente ha demostrado que añadiría cientos de miles de millones de dólares a nuestra economía. Mantendría también a las familias juntas. Tenemos que sacar a las personas trabajadoras fuera de las sombras. Estados Unidos siempre ha sido un lugar donde personas de alrededor del mundo trabajan duro y aplican sus talentos al crecimiento e innovación del país en la búsqueda de sus sueños. Así que haremos todo lo posible para lograrlo” —Hillary."},{"comment_id":"10152702993831636","commenter_b":"would rather pay for a second hand BMW than be involved in a spit roast with her","commenter_a":"sex united fc Siddhant Behera Sanket Mohanty","post_message":"Manchester United have found themselves at the centre of another sex story..."},{"comment_id":"1147558291982624","commenter_b":"@username like to talk shit behind a keyboard like a little bitch!","commenter_a":"White on white crime 👀","post_message":"Sick: 26 year old man gets caught trying to meet a 15 year old boy! #WSHH"},{"comment_id":"10154724331976341","commenter_b":"If you people are to arrogant or ignorant to comprehend the FACT that the land belongs to Israel than you will never get it because YOU DON\"T WANT TO.","commenter_a":"What's the big surprise? Prior to last Friday, Bibi and his gang gave lip service to the two-state solution, willingness to talk with the Pals, preservation of human rights. And did the opposite, much of the time. They don't have to bluff anymore. And by the by, it's strange to hear the man who's tried to bypass the administration for almost all of its eight years, you supported Obama's opponent in 08, talk about underhand tactics.","post_message":"You might think that something actually happened last Friday at the UN, writes David Rosenberg"},{"comment_id":"10154383447230745","commenter_b":"She modeled nude! Soft porn!","commenter_a":"Trump is not going to make it past 2017......Bigly!","post_message":"WATCH LIVE: President Trump makes an announcement — will he take questions from the press? @webpagelink"},{"comment_id":"10154145520606770","commenter_b":"Never, they're pigs. Tell them to oink off.","commenter_a":"When did they stop calling women like Kim who have no decency or moral compass pigs?","post_message":"The outfits that Kim Kardashian and Kendall Jenner wore were absolutely stunning."}]
