[{"comment_id":"10153259509053010","commenter_b":"I bet she could crush Eddie lol","commenter_a":"Had the biggest crush on Eddie Van Halen growing up...LOL..He DOES NOT look the same anymore!!!","post_message":"Van Halen's David Lee Roth put it best: \"We waited 45 years for this.\" More than four decades after it formed, Van Halen played its first nationally televised gig, on Jimmy Kimmel Live. (Roth ended up with that bandage on his nose.)"},{"comment_id":"10154450520586320","commenter_b":"Well said Claudia","commenter_a":"own it. you have ignited and stirred the kettle and walked away. you have failed to address the real crimes of black/black murders happening every day in your 'home town' of chicago. you are perpetuating a false narrative to strip the local police from doing their job, create chaos and mistrust. own it for once and stop blaming everyone else.","post_message":"President Obama is to address the #BatonRougeShooting where 3 police officers were killed."},{"comment_id":"1169723563063063","commenter_b":"SHES ONE HELL OF ALOT BETTER THAN THE TRANNY AMERICA HAS PARADING AROUND AS A WOMAN NOW! THE TRANNYS NAME IS MICHAEL! ODUMBASS LOVES HIS GAYS! DAMN THAT IS ONE BUTT UGLY GORILLA FAVED TRANNY! MELANIA HAS MORE CLASS IN HER CRAP THAN THE TRANNY HAS IN HIS WHOLE BODY! P.S. TUCK THAT SCHLONG TRANNY!","commenter_a":"Agree","post_message":"I agree!"},{"comment_id":"1544777802496810","commenter_b":"i smell a rat and it's not trump and his wife. ignore them,","commenter_a":"Are we still talking about this? Oh Glenn, you've lost your way!","post_message":"She has been done a grave disservice by somebody."},{"comment_id":"10153657767106051","commenter_b":"OMG... A bunch of women who can't stfu!","commenter_a":"This isn't a political website Lorretta so move on.","post_message":"Olivia Newton-John's ex vanished on a fishing trip 10 years ago. Now, more than a decade later, we finally know what happened to him."},{"comment_id":"10154798019399062","commenter_b":"Russia has been the most proactive but we condemn their actions.... lol","commenter_a":"I wonder how long the leaders of the free world are going to tolerate this without taking the fight to ISIS directly and wiping them out! The scumbags need annihilating!","post_message":"BREAKING: Islamic State group claims responsibility for Brussels attacks, Associated Press reports. READ MORE -> @webpagelink"},{"comment_id":"1753991328222832","commenter_b":"Angry, angry woman.","commenter_a":"I hear some sniffles coming out of Philly, sure sounds like a bad case of the Blue Flu may be headed that way","post_message":"We'll see what ends up happening..."}]
