[{"comment_id":"10154985893890629","commenter_b":"@username Now he blamed \"fake news\" again. Only this time it was real \"fake news\".","commenter_a":"Our president is making speeches based on something he says he heard on Fox News? OMG, he has access to 1st hand intelligent briefings and he's getting his information from the news? What in the world is even happening?","post_message":"President Trump said he cited a nonexistent terrorism incident in Sweden as a reason for his travel ban after he saw a segment about immigration in the country on Fox News."},{"comment_id":"1820380214887532","commenter_b":"I will bet you $10.00 to a donut she is a liberal.","commenter_a":"This is insanity, this principle needs to be removed.","post_message":"Angry yet??"},{"comment_id":"10154473389496336","commenter_b":"Hahaha we thought same thing.","commenter_a":"Lmao! So the DNC asked the lady who caused all the chaos in Baltimore to restore order ?? Wow ! The DNC is in trouble","post_message":"Baltimore Mayor Stephanie Rawlings-Blake gaveled in to bring the Democratic National Convention to order, after Debbie Wasserman Schultz excused herself from the role amid controversy regarding leaked DNC emails."},{"comment_id":"1362606120446523","commenter_b":"I heard about that. Those kid's were way out of bounds for doing that. But I assure you, no citizens of the United States of America are being threatened of being deported. Only illegal immigrants of any color, race or religion. Its already the law. It has been for a long time. Its just not been enforced properly. The media tries to spend it in to hate. Its not hate, although there is anger for what were allowing to happen to our country. I personally only hate terrorist. No matter where they come from. Thats why we need to band together all American citizens. We have band together against a corrupt government, illegal immigration and these terrorists. Foreign and demestic. If we can't come to terms with that as a people. See it for what it is. Than im afaid all is lost.","commenter_a":"No they don't. You continue to try and make it about Trump. It does however have a lot to do with you. The media and the government. This is your( collectively) propaganda. To continue to divide. Its not working. Not for the majority. People listen please. They are lying to you. To push their naritive. If you actually listen to Trump. Not just the out of context sound bites they feed you. He and people who support him want unity more than anything else. For America. Then we can focus on everyone else. But we have a serious problem at home to deal with first. We have to let white, black, left, right and what ever else America go!! And realize we the people. All the people. We the people of this great nation are on the same team. Thats what we are missing. Everyone is more concerned with their ...","post_message":"This is just sad."},{"comment_id":"10154151629042507","commenter_b":"Says the white bitch with a job and a Beamer....Dorothy saloum.....ha-ha!","commenter_a":"Hey @username liberals, Thanksgiving looks like gratitude. It's all about money to you socialists.","post_message":"If you have $50,000 you can join them."},{"comment_id":"902649573193973","commenter_b":"And the nasty muslims rape goats","commenter_a":"There are police outside Catholic services in NYC right now. And Jewish services. But not allowed at mosques because it's insulting.","post_message":"“If you've got nothing going on [in mosques] but a beautiful religious service, why in His name would you not want to have police officers?” – Rudy Giuliani reacts to the #OrlandoShooting and Donald J. Trump's push for more surveillance"},{"comment_id":"10154199374772894","commenter_b":"Women need to stop playing themselves. He only wants money on his books.","commenter_a":"Well it's the thought that count.. At least she know that and accept it for what it is... But some of these hoes don't know bout that tho","post_message":"ICYMI: Apollo Nida Gave His New Fiancée an Engagement Ring Made Out of Paper Towels [Photos]"}]
