[{"comment_id":"1082429571840463","commenter_b":"Sounds like @username sharing a very personal account.","commenter_a":"I agree, but those who refuse to see this analogy... the seriousness or the truth of what is happening to America ... and what to do about it... before it's too late and America is totally unrecognizable... is another story.... the story of the real American history is not being taught for one thing ... the story as in the recent documentary by \"Dinesh Desouza, \"Hillary's America\"... the story of the real America is not being told in the history books or on the campaign trail...and not mentioned once in any of the debates....WHY??? these are the people who need to hear the real American History .... I for one was in shock...to learn the truth... but was blessed and was one of the fortunate ones to \"see\" this documentary... but there are others who are ignorant of this truth ... who are or choose to remain a victim or ...","post_message":""},{"comment_id":"713883512069088","commenter_b":"@username you don't look old enough to know what that women has been doing for the last 40 years.You better hope she isn't the next President she is going to bring in 65,000 more illegal immigrants so when they molest part of your family and the police can't do anything about it. Because she has tied their hands what are you going to do. Blame someone else like she does.","commenter_a":"Why don't the democrat fools stop beating on Trump all the time , They would love for him to drop out then we would have crooked Hillary running every thing, She will never be my president she is the biggest liar on this earth and the lowest scum on this earth ! !","post_message":"Donald J. Trump's campaign chairman Paul Manafort said the report that the GOP nominee asked about using nuclear weapons in a security briefing is \"absolutely not true.\" @webpagelink"},{"comment_id":"10153521372371162","commenter_b":"Illegals cant vote....","commenter_a":"This men can't never be president white racist people can do it alone with out Hispanics and blacks his election is a waste time and money he lost already","post_message":"BREAKING: Donald Trump sues Univision for $500 million over the Miss USA pageant... @webpagelink"},{"comment_id":"10153588391460667","commenter_b":"@username: you basically need a nice warm cup of shut the hell up.","commenter_a":"Don't feel sorry about those ... These soliders maybe killed 300 kids and 300 from elderly people in Palestine , but we say Islam say don't kill innocents people even from your enemy ...","post_message":"\"Terror will not silence us, we will return to work tomorrow,\" Tel Aviv Mayor Ron Huldai said."},{"comment_id":"903840716398977","commenter_b":"Nestle can suck my balls","commenter_a":"Rick Rule","post_message":""},{"comment_id":"10153356243998908","commenter_b":"I'm sure American Indians don't want those free loaders here either, even legal immigrants who did the hard work to become citizens don't want them here. We need a real President who has the guts to deport these leeches.","commenter_a":"We need a man like him in office now. He deported millions of illegals, he was a great President, unlike our current one.","post_message":"Collective Evolution \"In the councils of government, we must guard against the acquisition of unwarranted influence, whether sought or unsought, by the military industrial complex. The potential for a disastrous rise of misplaced power exists, and will persist.\" - President Eisenhower."},{"comment_id":"703561329834445","commenter_b":"Get that pos out at any cost.","commenter_a":"Dreams Dreams. What The Fuck Ever. I only get 3 wishes. Anyone got a lamp I can rub.","post_message":"Obama impeachment process takes huge steps forward... he's finished. This is great news. He should have been gone long ago. Can we get 30,000 'LIKES' to have Obama impeached?"}]
