[{"comment_id":"10152838085232014","commenter_b":"That woman is not a mother. A mother loving, nurturing, protective. That woman is a disgrace. She should never get those precious babies back.","commenter_a":"What's wrong with these people leaving their kids in cars alone o in apartments....seriously people stop having kids or don't have them at all if you're not going to be responsible.","post_message":"Police say a Phoenix mom left her two babies alone in an apartment with a bathtub full of water, a switchblade in reach, and an open door to the third-floor balcony."},{"comment_id":"1799616930271434","commenter_b":"Liar!","commenter_a":"The more she says it the less I believe it.","post_message":"\"Certainly my meeting with President Bill Clinton raises questions and concerns.\" Attorney General Loretta Lynch says says she will accept the recommendations of the FBI on whether to pursue charges against Hillary Clinton."},{"comment_id":"10153080407966323","commenter_b":"No but seriously why the hell would a girl shave their face...?","commenter_a":"Um I've shaved my face for like 6 years and had no issues.. hair getting thicker from shaving is a myth.. the reason people think that is because hair tapers to a tip and when you shave that tip off the hair seems thicker.. but its not.. it's just the end of the hair and it has always been that size","post_message":"Is it a terrible idea for women to shave their faces? Yes, yes it is."},{"comment_id":"10154433599628812","commenter_b":"Good for you, we have got to keep Hillary out of WH we cant take 4 more years of failure!!","commenter_a":"Neither believe in Science/ man made climate change- Disqualified to hold office!!","post_message":"Senior level Trump campaign sources confirm to ABC News that Speaker of the House Paul Ryan will be endorsing presumptive GOP nominee Donald Trump: @webpagelink"},{"comment_id":"10153536148652426","commenter_b":"That's sad! Lawyers can find many ways of getting people out of trouble. Bet the girl didn't show remorse or learn an important lesson.","commenter_a":"Ok, fine people for smoking around children. Then let's raise the fines for texting and driving and add fines for talking and driving. These fines can be used to further aid in our children's education. But most important-people can use their lessons they learned in driver's ed such as using a turn signal and stopping at a stop sign.","post_message":"Should smokers be fined for smoking in cars with kids? A - Yes B - No"},{"comment_id":"987929541300100","commenter_b":"You guys just don't know anything about Muslims! !!!! Wake up.America they will take over your land People are clapping for her for what????????","commenter_a":"Should be concerned about all Americans instead","post_message":"Watch: Bernie Sanders teaches Republicans a lesson on how to respect Muslim Americans and end racism in America."},{"comment_id":"995165647267071","commenter_b":"Ignorant fucking racist bitch","commenter_a":"Today is the first time I listened to his so-called speech, I usually either hit the mute button or change the channel. I sat through his speech and was dumbfounded...The lies were spewing all over the place, he is such a narcissist and egomaniac I could not believe what I was hearing. I hope and pray that Crooked Hillary, the Benghazi Butcher does not get elected because if she does, we are in for four more years of the same!","post_message":"Simple question: Are you happy or unhappy with the way President Obama has responded to the Orlando attack?"}]
