[{"comment_id":"10153653886305950","commenter_b":"Shut up, whore.","commenter_a":"The teen should have complied. And his parents did a terrible job.","post_message":"The aggressive confrontation nearly cost the teenager his life."},{"comment_id":"10157053900475354","commenter_b":"Crooked Hillary could not/ would not keep America and Americans safe. She ignored the call for help from Ambassador Stevens even before the attack. Then she tells Americans one story while she tells her daughter a different one...crooked, crooked Hillary can't be trusted.","commenter_a":"The BLM and anybody who supports them are just a bunch of RACIST ass holes and Dirty Fukn TRAITORS to themselves and to the USA. \"Multiculturalism\" and \"diversity\" is all BULLSHIT and VERY DANGEROUS to EVERYBODY it will DESTROY everything. Islam is DEATH. DEATH to Islam long live the Infidel","post_message":"BOLD."},{"comment_id":"10153772983356813","commenter_b":"Does that mean pardoning him for his rape accusation that he fled the country for as well?","commenter_a":"Snowden deserves a pardon. More than Obama deserves to be POTUS.","post_message":"Now's the time for Barack Obama to pardon Snowden."},{"comment_id":"10153113901480329","commenter_b":"Maybe she cover her face too in case it incites men to rape her. #goodgrief","commenter_a":"Bahaha! Don't flatter yourself lady. You're no Kate Upton!","post_message":"A Christian blogger has caused a stir online after publishing a blog post about her decision to stop wearing yoga pants because they cause men to think “lustful thoughts”."},{"comment_id":"885506288175787","commenter_b":"Thnx god u not woman,imagine poor woman life with such big ugly nose","commenter_a":"if i was that woman i would never talk to that stupid arabian pig -_- what kind of thinking and beliefs let these ppl tobe in social with this kind of talking and beliefs it doesnt worth even a simple like","post_message":"Apparently in countries like America sexual crimes 'are no big deal' to women."},{"comment_id":"10153310967161756","commenter_b":"Yes, yes I am. Suck it!","commenter_a":"Maybe but you get to tell everyone you're a vegan within 10 seconds of meeting them.","post_message":"Three activists, three answers on how veganism — or vegetarianism, or even just cutting way back on meat consumption — can actually make an impact for animals, and for global inequality."},{"comment_id":"962147223853010","commenter_b":"Femmie=carpet munchingg","commenter_a":"And this is why I don't identify as a feminist. Yes, periods should not be stigmatized, yes womens sanitary products should not be taxed, yes we should try and supply women without access to sanitary products but publicity stunts like this are what give feminism a bad name. Let's all grow out our armpit hair and show it off on Instagram, not wear deodorant and bleed all over the place and while we're at it let's just devolve a little as well.","post_message":"'I ran with blood dripping down my legs for sisters who don’t have access to tampons...'"}]
