[{"comment_id":"1788246978118850","commenter_b":"She is garbage.....","commenter_a":"Your a f*cking idiot. Please leave the country. I'll buy your ticket.","post_message":"During a show in Tampa, Amy Schumer brought an audience member on stage and quizzed him about his decision to vote for Donald J. Trump."},{"comment_id":"1162368457165867","commenter_b":"CORRUPT - I GUESS CLINTON HAS SOMETHING ON YOU!! KARMA - I HOPE PEOPLE SEE THROUGH YOUR CONSPIRACY FOR HILLARY.... I AM GOING TO CALL TO BOYCOTT UTAH","commenter_a":"who, whit ,where ??","post_message":"Could Evan McMullin be the next President of the United States? Full story: @webpagelink"},{"comment_id":"10152801050747377","commenter_b":"Not in favor with illegals, but let's not forget that we are here illegal too, the Indians are the only people here legally!","commenter_a":"Let's raise the percentage point!","post_message":"56 percent are against granting amnesty to 5 million illegal immigrants currently living in the United States."},{"comment_id":"10154277856037042","commenter_b":"@azade and hopefully if this ever happens to ur kid they kill ur child instead of the gorilla..u idiot","commenter_a":"Smh! All these gorilla whisperers and no one have any knowledge on gorilla other than from the television. The mother is 95% to blame and the zoo is 5% to blame. No way should a 4yr. old be able to find his way in there. However since he did, no one knows what the gorilla was going to do next. Saving the child should have been the first and only priority (and it was) not the gorilla. Sad the gorilla had to die but not only should humans come first but it was a baby. Some people are really crazy.","post_message":"A gorilla was killed to save a child at the Cincinnati Zoo over the weekend. But there was a much different outcome when a little boy fell into a gorilla pit at an Illinois zoo nearly 20 years ago. See it in this amazing video:"},{"comment_id":"955239887844766","commenter_b":"Good read. Tells it like it is.","commenter_a":"obama is the biggest pos in this country!","post_message":"I didn't expect THIS!"},{"comment_id":"10153030669318961","commenter_b":"Yeah, sure pal.","commenter_a":"Mother Jones - HAHAHAHA. That's about as credible as Mother Goose, in other words - a fairy tale.","post_message":"If you have time to read an article today, make it this one on the true costs of gun violence"},{"comment_id":"10154063115076509","commenter_b":"Wanker !","commenter_a":"Shut up trumponszi","post_message":"\"We have a problem in this country. It's called Muslims,\" a man said at a Donald J. Trump rally. Trump did not appear to correct the man when he alleged that President Barack Obama is Muslim and also not an American. @webpagelink"}]
