[{"comment_id":"1113788628681311","commenter_b":"I will be voting for a true American who has respect for our military n veterans who's goal is to make America strong again for we the American people n the future of our country n children bring jobs back. close our borders Build the WALL My Vote like many Americans who are sick of our do noting liberal government Will vote Trump Go TRUMP","commenter_a":"Indiana, go vote Trump over lyin' Ted and Kasich! Time to send Donald to the White House. We're tired of all talk and no action politicians! #TRUMPTRAIN","post_message":"Last week we had huge wins in Connecticut, Delaware, Maryland, Pennsylvania and Rhode Island. It has been an amazing week in Indiana. We have traveled all over the state visiting Indianapolis, Evansville, Fort Wayne, Terre Haute, South Bend and beyond. I was endorsed by many sports icons including the legendary coach Bobby Knight, long-time Purdue University Basketball Coach Gene Keady, former Notre Dame Coaches Digger Phelps and Lou Holtz, and actor and former NFL player Fred \"The Hammer\" Williamson. I also received support from many Republican leaders across the country, who believe we will unify the party and defeat Hillary Clinton in the fall. The latest polls indicate this to be true. According to the latest Rasmussen poll, I beat Hillary easily and with your support we can widen this margin and Make America Great Again! It is so important to me to win Indiana. Not only would it solidify ..."},{"comment_id":"10154369386511545","commenter_b":"Imagine if someone came and ruined America and a civil war started. People killing and fighting everyone. Not everyone has the money to buy guns or the nads to pull a trigger. Hopefully that never happens but I am guessing people would try and leave, some in a hurry to wherever is better and closest....and hopefully don't get turned away at borders.","commenter_a":"Why, oh why, can't the pot stirrers understand the difference between LEGAL and ILLEGAL when it comes to immigration?!? The US was indeed made up of immigrants, and we love immigrants still, WHO COME HERE LEGALLY. And while I'm at it, why should we take in refugees WHEN WE HAVE NEEDY AND HOMELESS AMERICANS IN EVERY MAJOR CITY IN THE US? Let's give the CITIZENS all the benefits first. Why is that such a hard concept for some people? Seriously! Do you really think any other country in the world would put refugees AHEAD of its own citizens?!? No! Americans first, then help others. Just like in an airplane, put YOUR oxygen mask on first, then help the ones around you. Oy!","post_message":"The full commercial didn't appear on television during the big game after it was rejected by Fox. The full ad, which is nearly six minutes long, is available on the company's Twitter account."},{"comment_id":"1807011322902281","commenter_b":"In what part did she say super predators? Actually finish watching the video instead of make false accusations!!","commenter_a":"Do you guys have one recorded incident of Trump saying anything negative towards the black community like this? We have a recording of Hillary calling African-American super predators and saying to a group of black people that if they did not like what she had to say then she would just go talk to white people. @webpagelink","post_message":"BREAKING: Trump's own rental agent just told MSNBC that the Trumps told him: \"WE DON'T RENT TO N-WORDS\" Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153345787268984","commenter_b":"She's a corn ball","commenter_a":"Yes, She Is Crazy!","post_message":"Christians are ripping Hillary to shreds over this. What was she thinking?? Do you think Hillary's already done enough damage to America?"},{"comment_id":"10154316513732235","commenter_b":"douche bag....that's it...you're the guy in school that doesn't make ANY team....because you're a class 1, grade a douche bag.","commenter_a":"These people are so insincere...they make me sick.","post_message":"Paul Ryan just smirked and laughed when asked how many more times he could rebuke Trump's racist ideas without rescinding his endorsement."},{"comment_id":"892169154214897","commenter_b":"Tucson, AZ.","commenter_a":"12s, where are you watching from???","post_message":"Watch: Seahawks leaving for Carolina!"},{"comment_id":"442634665940047","commenter_b":"A phony through and through. All she cares about is herself and power","commenter_a":"Indeed","post_message":"ICYMI - Hillary Clinton an Expert at being Fake"}]
