[{"comment_id":"10154530088657908","commenter_b":"Ginny Gruhler Vanderhoof You are a very dishonest person \"Sanders battled over veterans issues as chairman of the Senate Veterans Affairs Committee from 2013 until early this year, giving him an easy pitch to a crucial voting bloc of veterans, particularly in South Carolina where veterans make up more than 11 percent of the voting-aged population. There stiff competition for these voters, with front-runner Hillary Rodham Clinton wooing them this month during a round table in Nevada. Even the leaders of veterans groups who praise Sanders acknowledge that the 73-year-old Democratic socialist isn an obvious champion for the flag-waving set of former military officers and enlistees. When asked if the Veterans of Foreign Wars, which recognized Sanders with its Congressional Award in March, had ever bestowed the honor on a socialist before, the group Washington executive director, Bob Wallace chuckled a bit. . No. No, said Wallace, a man who ...","commenter_a":"Why does Hillary think she can get anything done? We've seen how the congress works now. Even if the Democrats re-take the Senate, we still won't have the radically gerrymandered House until 2020. It will be nothing but stonewalling until then. That and attempts to repeal the ACA are all the GOP reps remember how to do. Plus, they hate her with the fury of a thousand suns. They'll waste all their time and hundreds of millions of taxpayer dollars investigating her for anything they can think of until they can figure out some way to impeach her as well. She's not getting anything done. But if Bernie is the candidate, and he is able to continue to energize his massive voter base, then suddenly we have a shot at taking the entire congress back and getting something done. Bernie will bring far more folks to the polls than Hillary ...","post_message":""},{"comment_id":"1109370075781392","commenter_b":"@username, do you think the military being forced to lower their standards to allow females into front line infantry units is a good thing? The Marine Corps did numerous studies that show infantry units became much less effective when women were added. Currently, a special forces Sgt. is being court martialed and will be less than honorably discharged because he confronted an Afgan police officer and pushed him to the ground because he was ongoingly raping a little boy- that's a good thing? Our veterans are literally dying because they are having to wait for treatment from the VA - that's a good thing? A lot of great officers are being let go and forced out because they don't agree with Obama's policy's....that's a good thing? The current ROE's tie soldiers hands and put them in danger. The morale is at an all time low....things are not good. THis plus ...","commenter_a":"Our military is second to none! The only people questioning the readiness of our military forces are Republicans! There isn't one nation on the planet that wouldn't trade to have both our military personnel and equipment! So stop perpetuating a political lie in the hopes of portraying President Obama as un-supportive of our troops and military leadership!","post_message":"When President Barack Obama took office, he inherited a professional, world-class, battle-toughened military. Seven years later, many experts see the U.S. armed forces as a tattered and demoralized organization. In a special 'Fox News Reporting - Rising Threats - Shrinking Military,' Bret Baier investigates what Obama has done with – and to – the military. Don’t miss it Friday at 10p ET on Fox News Channel. @webpagelink"},{"comment_id":"900759883386314","commenter_b":"Hillary's supporters don't care that she's a sold-out Wall Street neocon. It's weird.","commenter_a":"She is the ONLY person on earth to know how it felt to take that place in history........glad she was the one who knew how to really cherish it for all of us... thanks Hillary... Girl, you rock!","post_message":"When history's in the making, sleep can wait."},{"comment_id":"10154552857806955","commenter_b":"How is Hillary performing vs. Obama?","commenter_a":"This is it America. This is our last chance, the alternatives are most unsettling.","post_message":"FLORIDA SHOCK: TRUMP OUTPERFORMS ROMNEY BY 130,000 IN EARLY VOTING!"},{"comment_id":"10152878773282217","commenter_b":"Jeanette is a bit of an obsessed weirdo","commenter_a":"Organised religion is worse than organised crime","post_message":"Why is Magna Carta so important?"},{"comment_id":"10156240313260551","commenter_b":"This post is a waste. If you have 1/2 a brain you have known for over 6 years that she is a racist.","commenter_a":"IF....all the white folks were gone from this country, there wouldn't be enough others to support the welfare system or the Obama's income......hummmmm.","post_message":"This woman is RACIST!"},{"comment_id":"1214110285315058","commenter_b":"Great that's sounds good to me.Now tell him to tell his people to tell the kids and tell the hate groups,especially the kkk and others to stop yelling white power and build a wall and bulling people.Tell him to stop terrorizing people from Mexico that have been here for years that he is going break up families.That a good start.That's not God's ways.This is an America for all.","commenter_a":"God gave us a choice and decent rules to go live by but unfortunately some people just don't follow God's rules and a trump is produced.Using Vile language,threatening people,a wife that is no example to little girls but everybody in the republican camp adores him.He's gonna save the world.Not!","post_message":"If you claim to be a “Christian” but support Donald Trump and all the hate and bigotry he embodies, you’re a hypocrite."}]
