[{"comment_id":"10153660069974456","commenter_b":"You never know what goes on behind closed doors... He probably threw all disgression out the door after she found out about it and agreed to wait. A woman will only take so much and then it's Katy bar the door!!!","commenter_a":"A Sad Story Here...He Broke His Vows...I Want 2 Know Why He Cheated On His Wife...They Look Like They Was Very Happy 2 In There Marriage!!","post_message":"JUST IN: Gov. Bentley says recent allegations that he misused state property aren't true, and he will show that."},{"comment_id":"523996764459649","commenter_b":"She is so full of crap!!!","commenter_a":"Not my husband ... Wrong again Laura !","post_message":"Laura Ingraham makes predictions:"},{"comment_id":"10153877529004778","commenter_b":"Yup she's a joke","commenter_a":"Why because they know she going to give them a run for there money..","post_message":"\"Rarely in the history of any criminal case has a prosecutor so directly maintained so many conflicts of interests,\" the motion declares."},{"comment_id":"10154332100229369","commenter_b":"??????? Seriously? Crooked Hillary. I will never vote for her.","commenter_a":"The headline is B.S. and I do not mean my undergraduate degree. Hillary is brave, intelligent, tested, Democrat, progressive, public servant. Get used to it.","post_message":"Yikes. Now what?"},{"comment_id":"10154020630826636","commenter_b":"@username however... that's detracting from my point! My original comment was about the UK's inability to prosecute migrant sex offenders!","commenter_a":"The only problem people in the uk have with immigrants, new British, Muslims etc... is the lack of police prosecution and \"special treatment\" minority groups get. There are an estimated 1 million cases of Islamic grooming, which've been swept under the carpet, by social services or went uninvestigated by police because of fear of being branded racist! That's not just some \"bigoted\" or \"islamphobic\" propaganda.. that's the reality of people living in a heavily Muslim populated area! The problem isn't with immigrants or non white Christian Brits... it's the lack of ability to deal with the crime coming from their community's by the authorities!","post_message":"Ironic?"},{"comment_id":"779579485508565","commenter_b":"Mia King you are just making things worse. People of all races kill period! I could waste my time looking for articles of blacks killing whites but I'm not trying to keep the racist shit going.","commenter_a":"The TRIBAL ATTACK is alive and well. Took seven (7) FUCKING NEGRAHS to beat up one (1) homeless white man. Put these porch monkies one-on-one and they run like the cowards they are.","post_message":"Dear liberals and the #BlackLivesMatter movement, police and white people are not the problem. This is the problem...Sickening."},{"comment_id":"485707381619842","commenter_b":"Shariah Law is \"TORTURE OF WOMEN\". It demands that women be covered from the top of their heads to their toes. HOW STUPID is that. But this is just a small portion of the TORTURE. We are America. We will NOT HAVE SHARIAH LAW. BB","commenter_a":"No sharia !!!!!!!!!!","post_message":"Enough is enough. It's time we as Americans stand up and say 'NO' to Shariah Law. Spread the word and SHARE, we need people aware of radicals in this country. Do you agree Shariah Law should be banned from America?"}]
