[{"comment_id":"606606769472505","commenter_b":"Karma's a bitch!","commenter_a":"not that I don't think this would be a good thing, but what's shown isn't likely. Unless this particular suicide bomber killed himself without using the bomb he was wearing, that bomb has been used. somebody would have had to put the scraps of his body into a new wearable bomb for this to happen... without anyone noticing.","post_message":"Video: This funeral for a suicide bomber is about to take a MAJOR unexpected turn for these terrorists. Karma?"},{"comment_id":"10152897950463445","commenter_b":"To steal God is an oxymoron! Obviously your ignorant! God is there for everyone. It says in scripture that God will call up people from every nation on earth. After the rapture and 1000 yrs of destruction The promise land will be restored in all it's glory. And it's ridiculous to say everyone is Muslim, there were religions that worshipped idols and had orgies as part of their religious beliefs. This is what angered God and he wiped out the wicked in the great flood.","commenter_a":"My God doesn't reward murder , or threaten that if a person doesn't repent according to the Koran they will be killed. My God wouldn't reward living a just and Godly life with going to heaven and having 72 virgins!!! God would never give a sexual gift as a reward. Muslims treat women like shit, just like a woman has no civil rights. In America we have the right to practice whatever religion we want and freedom of speech. If this country sucked so bad immigrants wouldn't risk their lives to get here.🔯 Shalom😇","post_message":"#Cannabis Legalization Goes Mainstream in Israel"},{"comment_id":"10152973439396323","commenter_b":"Yeah they need to give you a time frame to study and work then go back to where you came from. It shouldn't be a forever stay for immigrants. Once they get the freedom to stay for long then they going to start taking over. America is a big example, UK, France are big example of immigtants taking over.","commenter_a":"Well they are angry citizens and they have the right to be angry when their government keep dumping immigrants in their country like that, especially those taliban immigrant who want to take over Europe like they did to Spain in the 11th century. Somebody gotta stand up to it while others are bend over backwards to accept the influx of immigrants floading their homeland. Last I recall Germany is a Dutch land not usa.","post_message":"“We just want Germany to stay German!” The rise of the Pegida party"},{"comment_id":"10154308942676336","commenter_b":"Build the wall screw the Mexicans","commenter_a":"no need to .. i mean their ignorant puppet master says it all the time :P","post_message":"The student said he wanted to do something \"provocative\" to protest restrictions on freedom of speech and didn't realize until later that the phrase held such a strong, threatening connotation."},{"comment_id":"10154660419633797","commenter_b":"I'm pretty sure Russia is still one up on us!!","commenter_a":"Yup I'm a contributor","post_message":"AMERICANS DRINKING MORE: For the first time in nearly 15 years, everyone around the globe is drinking less alcohol. Except for people in the U.S."},{"comment_id":"1601468970152449","commenter_b":"Victoria SD you stupid bitch","commenter_a":"If only Khan talked about Islamic terrorist attacks as much as he talks about DJT - using his son's death to score points for a flawed ideology! Damage control!","post_message":"Khizr Khan, the father of a slain Muslim soldier, says Donald Trump is \"incapable of empathy.\""},{"comment_id":"10153528018151717","commenter_b":"She really most likely break the toilet seat when she sat and clog the toilet anyway....best she go to Wall mart to do her business anyway cause she will fit in so much better being in her own element.","commenter_a":"This doesn't have anything to do with being fat, and she isn't mentally ill. She is suffering from an illusion, and that is anyone gives a rat's ass about her opinion. I don't even think she can afford to shop at Target, and if she did she'd pay for it with food stamps. Her kids get free lunch at school, and are probably on state Medicaid. Point being, she is depending on the government to sustain her lifestyle of having as many no-neck young'uns as she can have. Probably only has sex in order to procreate and we are screwed up. I wonder what her white trash, holy roller agenda is all about?","post_message":"A serious kook attack has been captured on video."}]
