[{"comment_id":"1666828886940954","commenter_b":"when someone finally makes sense .. THANK YOU SALMAN RUSHDIE!","commenter_a":"Every thing they say here is an outright lie. There is Huffpoop id evil. not a shred of truth about any of these.","post_message":"Let's put Hillary Clinton's emails into perspective."},{"comment_id":"1738783449718030","commenter_b":"Lmfaoooo she's just so fed up","commenter_a":"The teacher at 52 seconds hung her head low like \"these mfs here \" Ty1253184741396567","post_message":"Move over, #MannequinChallenge. The #TrumpsComingChallenge is sending students fleeing @webpagelink"},{"comment_id":"10153894125869205","commenter_b":"Another whiny bitch.","commenter_a":"Hey dummy it's not that you are reporting about him it is you only complain about him. Where as with Hillary you are sold out to her just like Bernie.","post_message":"After getting $2 billion in free advertising from the corporate-controlled media, Donald Trump is now whining about the fact that they’re being super mean to him (by doing nothing more than reporting on what he says.) The Ring of Fire’s Farron Cousins discusses this."},{"comment_id":"10153228470879170","commenter_b":"Idiots abound everywhere","commenter_a":"Lol","post_message":"If only for comedic value, we hope these people are successful in their bid to \"Draft Joe Biden!\" ....Utterly crazy video included."},{"comment_id":"10153146614743984","commenter_b":"You Dum bitch","commenter_a":"IMPEACH OBAMA NOW that damn MUSLIM","post_message":"Wow. I'm sure this is the last thing Obama wanted to slip out to the public. Do you think Obama is one of our worst presidents ever?"},{"comment_id":"1276342415734510","commenter_b":"Well they didn't because Peter Falk hadn't even been born yet.","commenter_a":"I VOTE FOR THE AMERICAN INDIANS.TELL ME WHY DID THE EUROPEANS KILL THE NATIVES ,IF THEY WERE BARBARIC THEY WOULD HAVE KILLED COLUMBO AND BURNED HIS SHIPS.","post_message":""},{"comment_id":"1048277701893900","commenter_b":"@username We have the highest number of legal immigrants per year in the whole world!","commenter_a":"I know this is going to be unpopular, but I know many Hispanics who agree with me. There is a legal way to come to the country, and contrary to some of the attacks I have seen on other posts, it does affect our low income Black, Hispanic, and White communities. They are used to a more extreme poverty, so they are willing to work for less than minimum wage, and are off the books, so taxes, SS are not paid. This means an American citizen or legal immigrant is denied a job. When so many of our jobs are being sent to Mexico, China, India how can we not address the issue of those who came here illegally. My nephew's wife is from Mexico. 2 of my nephews have dual citizenship. US/Brazil. I am far from racist or anti-immigration, but our own citizens and legal immigrants are suffering. We ...","post_message":"This week the media reported something that I find not just wrong, but inhumane: President Obama is currently planning \"a month-long series of raids in May and June to deport hundreds of Central American mothers and children\" who came to our country fleeing that same violence. Sending women and children back into harm's way after they already fled horrendous violence in Central America is painful and inhumane, and must be stopped. Sign my petition asking President Obama to stop these raids and to make sure that families fleeing violence in Central America are protected from deportation."}]
