[{"comment_id":"827683380698175","commenter_b":"@username, so this guy should use the woman's bathroom?","commenter_a":"XY, XX there is nothing more, deal with it","post_message":"The American College of Pediatricians just made a SHOCKING statement about transgendering young children. Liberals are going to be pretty upset over this."},{"comment_id":"930922740261239","commenter_b":"This will be great and a good female leader not like the arrogant bitchthat we have in BC.","commenter_a":"Albertans are the dummies of politics, what happened the last time a female was in power in that province","post_message":"A ray of hope for Alberta's NDP MPs? via The Huffington Post Alberta"},{"comment_id":"10154079570861130","commenter_b":"What do you have against us fat lesbians ?","commenter_a":"He looks like a fat lesbian Neil young.","post_message":"\"...I think Donald J. Trump is gonna win.” --Michael Moore"},{"comment_id":"470600046463909","commenter_b":"I will refuse! They have already done enough to erode away our great United States of America. They need to go far away from Washington!","commenter_a":"She is \"one ugly motherfucker\".......to coin a phrase.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"1561884050498286","commenter_b":"Build the wall !","commenter_a":"Regardless who wins this election... I would NOT live anywhere else but the U.S.A. We may have our differences, but at the end we all work together. It what's makes this country powerful.","post_message":"BREAKING: Hillary Clinton casts her ballot on #ElectionDay in Chappaqua, New York. Full coverage: @webpagelink"},{"comment_id":"10152941804948869","commenter_b":"Women in bed with marxism again...","commenter_a":"No, the world needs more female rockers...not more critics","post_message":"\"The problem for women is that our role in popular music was codified long ago.\""},{"comment_id":"10153648380297293","commenter_b":"so that justifies a breach in privacy, Richard?","commenter_a":"Why keep nude images of yourself either on your device or your email inbox especially when you're a person of public interest. Stupidity warrants punishment.","post_message":"Jennifer Lawrence, Kate Upton, and Lea Michele were among the celebrities whose photos were said to be in the Celebgate dump."}]
