[{"comment_id":"1132428533502348","commenter_b":"I think they should be deported back to Mexico. There here because Obama wants more democratic votes. He is now trying to give them rights to vote. A lot of Hispanic legals who work hard are against them.","commenter_a":"This should anger all Americans!! BUILD THAT WALL TRUMP!!!!","post_message":"This firefighter and 2 kids were just killed... if that weren't infuriating enough, wait til you see WHO murdered them. This is EXACTLY what Donald J. Trump has been talking about..."},{"comment_id":"10153417298067434","commenter_b":"Yeah everyone needs this guy in the women's bathroom","commenter_a":"This is how we protect our women... not guarding bathrooms for trans \"predators\".","post_message":"\"I was going on about something and saw Monica staring behind and making a funny face. I stopped. 'What’s going on?' After a few second she said 'That guy just put something in her drink.'”"},{"comment_id":"10153235598706756","commenter_b":"Its when your chakras are misaligned, or your spirit animal needs a vet. The only treatment is #woofighters","commenter_a":"what exactly is \"psychic damage\"?","post_message":"Maureen Corrigan says the story \"reflects on the unearned power that beauty confers on its recipients; rather less convincingly, it also tries to make a case for the psychic damage of being beautiful in a world that's all too eager to rate women primarily on their looks.\""},{"comment_id":"932964430158104","commenter_b":"I wish we could deport ALL these crazy ass idiots!","commenter_a":"This woman and Palin and others like her are enemies of the state in my opinion! Shame on them for spewing their damage.","post_message":"WOW."},{"comment_id":"1241458632577946","commenter_b":"@username I speak the same to everyone. But no one slaps me. And a pussy like you certainly wouldnt be the one to slap me. But as I stated in the original post. Plant some fucking trees if you don't like it.","commenter_a":"Yea and collapse the economy in less than 2 years. Get educated dumb ass. If you care for trees so fucking much then get the fuck off of Facebook and go plant some trees.","post_message":""},{"comment_id":"10153678796416491","commenter_b":"If its a libby female like killary, she'll be fine on the side of the road ;-)","commenter_a":"Dude. You left a lady on the side of the road. I don't know how you were raised, but someone needs to kick your teeth in.","post_message":"The driver said the woman was “obviously a socialist”"},{"comment_id":"10154037628650672","commenter_b":"Even the illegal/undocumented immigrants are human beings. Everyone deserves a chance at safety.","commenter_a":"This doesn't effect law abiding citizens!!! Immigrants are safe!!! People who are here illegally are the problem!","post_message":"Mayor Bill de Blasio is addressing the media in the wake of President Donald Trump's executive order to strip federal funding for so-called sanctuary cities."}]
