[{"comment_id":"434228700035058","commenter_b":"Why so illegal immigrants can collect our money??? I think u should have to prove that you' have worked for 20 yrs or more to collect","commenter_a":"Also give thanks to Bill Clinton who signed the bill making it legal to outsource jobs here.","post_message":"Jeb Bush wants people to work until this age. I'm sure this will raise some eyebrows."},{"comment_id":"10154848659386509","commenter_b":"Disney will think twice about hiring him now","commenter_a":"He deserves it and never should have left his wife for that homewrecker ! His children should appeal anything and everything this tramp wants.","post_message":"A Los Angeles judge has granted Amber Heard a temporary restraining order against husband Johnny Depp."},{"comment_id":"10154848442742235","commenter_b":"Duh, you think! Not a difficult prediction","commenter_a":"I'm sorry but GOOD. I hope this country is brought to its knees. Then maybe. Just maybe people will get their heads out of their asses","post_message":"A sociologist who predicted the collapse of the Soviet Union and 9/11 attacks warns that American global power will collapse under Donald Trump."},{"comment_id":"10153183452347490","commenter_b":"The photographer is a WOMAN!","commenter_a":"I have 3 perspectives on this photo: as a PO in charge of the flag, it is against flag etiquette. As a Navy retiree, we need more people to support our militaries and this photo he is a defender of our country and our families. As a photographer this has no words to express how beautifully this photo turned out.","post_message":"THOUSANDS RALLY AROUND PHOTO -- Navy vet and photographer says she's getting more support, and business, after her photo of a baby cradled in the flag made national news:"},{"comment_id":"10154100012033598","commenter_b":"G","commenter_a":"Disgusting, the price of an innocent life","post_message":"Ex-Planned Parenthood Director: They Told Me Every Baby Killed in Abortion Made Them $313.29"},{"comment_id":"10154634366371729","commenter_b":"so now we support the lazy mongrels","commenter_a":"FLORIDA EVEN BETTER, NO INCOME TAX LOW SALES TAX AND NO COMMUNISTS.","post_message":"Of course they're moving to Texas!"},{"comment_id":"10157544751020354","commenter_b":"wasn't lady gaga also a crack fiend before she made shitty music and supported domestic terrorists?","commenter_a":"No one gives a shit what the fucking rich liberal is said.","post_message":"Here are Lady Gaga's tweets supporting the BLM radicals..."}]
