[{"comment_id":"10155757585249829","commenter_b":"Why not boycott Budweiser simply because it is not good beer?","commenter_a":"Melania???????","post_message":"Trump supporters on social media were furious: \"Never drinking Budweiser you should respect the AMERICAN president instead you mock with liberal propaganda.\""},{"comment_id":"581504818688172","commenter_b":"we are \"nasty women\" and we vote!","commenter_a":"Your mother always said that you were a disappointment and a nasty little creep.","post_message":"The conviction of an Iraqi refugee plotting to blow up the Houston Galleria is exactly why I've been pushing so hard to immediately suspend the refugee program from terrorist hotspots. The current program is a Trojan Horse allowing ISIS and other terrorist groups an open invitation into the U.S."},{"comment_id":"10153776672201770","commenter_b":"So Is @username","commenter_a":"Who is this Pollyanna? She thinks Hillary is all rainbows and unicorns. You can't put lipstick on a pig.","post_message":"\"She is a real person...\""},{"comment_id":"10154354422615950","commenter_b":"$400,000 a day for Melania to stay in NYC.","commenter_a":"Two weekends in a row out of three weeks in office we've flown him to Florida. Where is the Republican outrage?","post_message":"On Saturday, President Donald J. Trump is hosting Japanese Prime Minister Shinzo Abe at his resort in West Palm Beach."},{"comment_id":"10152925277511336","commenter_b":"Let it go, let it go!","commenter_a":"WELL YOU FORGOT TO MENTION THE SNOW THAT WE HAD IN wc/PA.","post_message":"JUST IN: Travel bans in New York and New Jersey have been lifted. Blizzard predictions that kept millions of people home are now being downgraded. @webpagelink Time-lapse video taken Tuesday morning shows a deserted Times Square:"},{"comment_id":"864428380327492","commenter_b":"Ruth, you're an idiot.","commenter_a":"Just proves they hate women and wish we were their slaves ... can't believe we have to fight for human rights for women still .. please tell me why anyone voted for this disaster","post_message":"Republicans will move to strip all federal funding for Planned Parenthood as part of the process to dismantle Obamacare, House Speaker Paul Ryan said"},{"comment_id":"1213471005342343","commenter_b":"Amnesty International can't even help the refugees that are dying in the Mediterranean today, all they can do is pick on Israel which is a democratic country and an easy target.","commenter_a":"Shame on you Amnesty International!","post_message":"This is ABSURD! How could they get away with this??"}]
