[{"comment_id":"386555874837702","commenter_b":"You obviously know nothing about the economy or laws or Russia in general...","commenter_a":"Its nice to see that thier prioritizing With all that going on with thier financial collapse and war in the Ukraine They have made driving xdressed a precedent Just curious... How would one know that the driver is a pyromaniac Will he be the one with the lit flare out the window???!!","post_message":"\"At first glance, it already appears absolutely absurd.\""},{"comment_id":"10155209654718974","commenter_b":"Donald J. Trump 3 mins Statement Regarding Recent Executive Order Concerning Extreme Vetting is a proud nation of immigrants and we will continue to show compassion to those fleeing oppression, but we will do so while protecting our own citizens and border. America has always been the land of the free and home of the brave. We will keep it free and keep it safe, as the media knows, but refuses to say. My policy is similar to what President Obama did in 2011 when he banned visas for refugees from Iraq for six months. The seven countries named in the Executive Order are the same countries previously identified by the Obama administration as sources of terror. To be clear, this is not a Muslim ban, as the media is falsely reporting. This is not about religion - this is about terror and keeping our country safe. There are over ...","commenter_a":"Stay strong","post_message":"We're at Portland International Airport for the second day of the #nobanpdx protest against Donald Trump's executive order on immigration."},{"comment_id":"1279396932093344","commenter_b":"This is why I hate narcan","commenter_a":"Horrible heroin.","post_message":"\"This child can't speak for himself but we are hopeful his story can convince another user to think twice about injecting this poison while having a child in their custody.\""},{"comment_id":"843343722394413","commenter_b":"You're wrong. Go in a mosque sometime you'll probably even walk out with your head still attached.","commenter_a":"If we behave in the same fashion as our enemies, we become our enemies.","post_message":"REVENGE: French Attack Mosques And Blow Up A Muslim Kebab Shop Looks like the French have had enough of the Muslims immigrants living there and are fighting back! @webpagelink"},{"comment_id":"1155155194501829","commenter_b":"Get over it. There are two different justice systems, if not more; operating within one....","commenter_a":"white privilege","post_message":""},{"comment_id":"10156091487575389","commenter_b":"They're socialists, not Americans. They should be deported with the illegals.","commenter_a":"I think they would vote for Hitler if he ran as a democrat. SO many in this country have no concept of reality any more.","post_message":"Question of the Day: Do you think Bernie Sanders can beat Hillary Clinton in Iowa and New Hampshire?"},{"comment_id":"422994894562852","commenter_b":"All but trump need to drop out and quit wasting money! Hell give it to the vets and homeless! Trump!!!!!!!!","commenter_a":"Mitt Romney will hurt Marco Rubio campain, please do let him","post_message":"Help or hurt?"}]
