[{"comment_id":"934398819989704","commenter_b":"Apparently, the right-wing cannot get enough of their failed foreign policies. Now, all they need is another Bush in the White House.","commenter_a":"Derp","post_message":"He's baaaaack..."},{"comment_id":"1246596595370794","commenter_b":"I commend you for being relentless and honorable. It is a very hard row you hoe in the cesspool in Washington D.C. I hope you have hazmat insurance. With deep respect, SFL","commenter_a":"Hon Gowdy, you have the support of the American people, Why, please tell, has the Congress of the United State, officials that we, the American people elected to represent us th the American peo have not brought charges against the current Administration, contempt, treason, murder, deriliction of duty, incompentence, assisting the enemies of the United States, Why Senator? Why? Why are you with the help of the rest of Washington letting us down?","post_message":"It’s taken way too long and way too much of our energy in simply gaining access to #Benghazi documents and witnesses. There continues to be time wasted negotiating with executive branch entities who do not want to give us what I believe Congress is entitled to."},{"comment_id":"758262410976191","commenter_b":"What a f--king liar!","commenter_a":"Chris is wrong Trump is right. Trump is the right man for the presidency. Get it and stop fighting a good thing for our country.","post_message":"Wow...Donald J. Trump and Chris Matthews agree that many Republican leaders and corporations don't want to stop illegal-alien hiring because they want the cheap labor."},{"comment_id":"10153957381501336","commenter_b":"FAIR TAX on consumption, please. Get the hookers, pimps, drug dealers etc. To pay tax! They have to eat too.","commenter_a":"Make states lower property tax too. It's screwing me on buying a house","post_message":"“No deductions, no loopholes.” Dr. Ben Carson revealed his tax plan this morning and said he would replace the current tax code with a 14.9% flat tax. (Via: Fox & Friends)"},{"comment_id":"628439843967466","commenter_b":"Yep criminals think like that That is why she pointed a gun at the polw. @webpagelink","commenter_a":"Because they don't have anyone to be accountable to!!!","post_message":"This is for all of the victims of #PoliceMurder and #PoliceBrutality who never make national headlines in the mainstream media! @webpagelink"},{"comment_id":"10155254792200354","commenter_b":"Which college did she attend? Was a waste of money.","commenter_a":"We don't need Work Place Violence. They need OUT of U.S.","post_message":"She actually stands by her statement that ISIS terrorists just need...job opportunities. Watch the insane VIDEO below."},{"comment_id":"456764181180829","commenter_b":"Looking at that ugly bitch may stop people from going to McDonald's","commenter_a":"Ooh i just lost my appetite. Why would McDonalds allow this. She is so BSD about anything dealing with food and nutrition","post_message":"Would You Refuse To Eat An 'Obama' Burger? Comment 'yes' or 'no'."}]
