[{"comment_id":"10154191515199087","commenter_b":"If Hillary gets elected Bill will be coming to the white house with her lets not repeat history.","commenter_a":"Unfortunately it's not Bill Clinton who's running for the President but it's Hillary Clinton, and Nobody cares what Bill Clinton did.","post_message":"The former reporter came forward today for the first time to accuse Bill Clinton of groping her on multiple occasions."},{"comment_id":"1702569516701619","commenter_b":"Soetoro the ineligibles wife did do that! But why are the D traitors who condone it with NFL players so upset??","commenter_a":"Oh yeah would of never heard the end of it.","post_message":"Oh, how they would SCREAM! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154188982011954","commenter_b":"illegals only come here for free money ..stop the flow","commenter_a":"Can we cover the 2 million illegals registered to vote?? That has just been proven??","post_message":"Watch LIVE: Press Secretary Sean Spicer briefs reporters after the DHS secretary moved to implement immigration changes ordered by President Donald J. Trump. @webpagelink"},{"comment_id":"10154001737221509","commenter_b":"Because marriage is between a man and a woman, look up sodam and gamora","commenter_a":"Why has she not been fired? Seriously, find another job if performing your duties as a PUBLIC SERVANT conflicts with your religious beliefs. BTW, homosexual marriage is NEVER mentioned in the bible.","post_message":"This Kentucky woman is still refusing to issue marriage licenses to same-sex couples on \"God's authority\" -- and in defiance of the Supreme Court. @webpagelink"},{"comment_id":"10156359711135354","commenter_b":"Take the fuckin niggers too.","commenter_a":"Yeah screw Obama and the Obama does not care health insurance bull crap. He can get the hell out of America and take his illegals, criminals and Muslims with him.","post_message":"“We’re going to be aggressive…”"},{"comment_id":"565051436999865","commenter_b":"Why don't these idiots get deported already? They come here illegally so they are criminals!","commenter_a":"Just bag em and ship back to Mexico","post_message":"Police in riot gear faced off against a violent crowd of protesters outside a Donald J. Trump campaign event in Albuquerque. @webpagelink"},{"comment_id":"10153076452609705","commenter_b":"They look overfed. People need to cut back on the amount they feed manatees.","commenter_a":"This is only 40 miles north of my house. Heading up Saturday to see them","post_message":"A storm is coming. A storm of manatees. Prepare."}]
