[{"comment_id":"1338951096148716","commenter_b":"Anthony - Huh? Who proposed that? If you're not a citizen, you don't get to vote. If undocumented get amnesty (which can only be done by Congress), that doesn't necessarily make them a citizen. If we decide (via legislation) they should have a path to citizenship, then citizens get to vote. Your comment makes no sense, and is a total strawman.","commenter_a":"If you can't win on the merits of your policy ideas, change the system. The GOP should be ashamed.","post_message":"Republicans are pushing, in Virginia and elsewhere, to make it harder for Democrats to win the Electoral College."},{"comment_id":"977484695718405","commenter_b":"You know all this for a fact?? Otherwise move along snowflake","commenter_a":"That was awkward to watch she was looking like she can't wait to get away from him seriously but her face never moves Botox much","post_message":"President Trump and First Lady Melania Trump just shared their first dance at the inaugural ball. @webpagelink"},{"comment_id":"10153598424984364","commenter_b":"Lighten up, lady.","commenter_a":"We don't \" Happy Holidays\" we wish Merry Christmas and Happy New year. Same to you.","post_message":"Here's wishing everyone Happy Holidays!"},{"comment_id":"1159671620816281","commenter_b":"Why didn't you keep your promise and leave this country? Because you were so sure Hillary was going to win! LOL just please shut up! Get over it! Do you think it you keep going on &. On, things ar going to change? NOT!!!","commenter_a":"Ted danson probably gags thinking of his past. Yes,he used to do the deed with that😁","post_message":"Whoopi definitely gets what she has coming after she made this dim-witted attempt to insult Trump. She so deserves the humiliation. Let's get 5,000 'LIKES' to show that America wants \"The View\" CANCELLED PERMANENTLY! @webpagelink"},{"comment_id":"1403734329688680","commenter_b":"these mobs are planed and paid for by the elites and must be stoped","commenter_a":"These people need to be arrested. This is not peaceful protest. It's criminal.","post_message":"BREAKING: Trump Official RUSHED To Safety After What Mobb of Attackers Just Did To Her Outside Child School"},{"comment_id":"10152570511717212","commenter_b":"Tiu wull be my wife","commenter_a":"He has a wife? And a kid? There is hope for us all! WTF? Freak!","post_message":"A man is in Oklahoma City police custody after a standoff early Friday morning. According to police, the man could be heard yelling about a number of issues including what happened in Ferguson, Missouri, and about his wife and kids."},{"comment_id":"962607787132303","commenter_b":"I am a Turkish citizen, as well as a British,! all our cities, streets and everywhere in Turkish borders are full of Syrians.. More than 2.5 million people officialy! Isn't that enough?? You still call yourself\"human\"?? We are sharing our bread and shelters with them. What about you? When it comes to talking about peace and human rights, you are the best, huh?Act now! It's the right time! Or do you prefer watching this American film on vision in your comfy sofas forever??? Barry in mind! ISIS is USA, UK, and IS'REAL terrorist organisation!!! They r the ones! Making, and forcing them to die or leave their homes.!! Then UK, USA, and IS'REAL terrorist organisations can get an easy access to their recourses, gold, diamond, oil, and gas.!!!! You both got it!!!","commenter_a":"If the EU keep housing them they will keep coming and is only going to make the problem worse. If they really wanted safety then they would have stayed in Muslim Turkey. They are all out for the benefits that get lavished on them. You cant blame them and most people would do the same.","post_message":"Bikinis, sun loungers ... and a tide of despair"}]
