[{"comment_id":"10153563509195329","commenter_b":"Obviously if you're not as fat as a cow then you're not a real woman","commenter_a":"Dammit! What EXACTLY is a 'real' woman?!?!","post_message":"After years of admiring the models in Victoria's Secret catalogs, we decided to make ourselves into models."},{"comment_id":"10152956267682061","commenter_b":"Congratulations, Ginger!!! We love you in Atlanta!","commenter_a":"Congrats","post_message":"Ginger Zee is pregnant and we couldn't be any more thrilled for her! Same with Lara and Amy Robach! @webpagelink"},{"comment_id":"480289475501690","commenter_b":"Read thru all the comments before insinuating, fucking bitch","commenter_a":"What about womens rights? What about the Muslim teens who made a mistake? Or the children & women getting raped? What about the women who are clearly not mentally capable of handling pregnancy or a baby? Id rather an aborted baby than a murdered baby left in the dumpster.","post_message":"The bill has been called the first of its kind in the nation:"},{"comment_id":"10154622434238433","commenter_b":"He's probably counting retirees. Of course, when the fascists STEAL our Social Security all those retirees will be forced back into the workforce.","commenter_a":"When Pence and other GOPers rattle off this crap -- it's aim is to cause anxiety and to inflate anger at such inequities - THUS, it is a100% LIETZOW, as it's meant to deceive!!!","post_message":"NEW: Is Mike Pence right that 1 in 5 U.S. households don't have anyone working? Well, sort of. Half True."},{"comment_id":"939237909458566","commenter_b":"Time to put two carrier groups in the area and drop lots of big fire crackers and line up some goats for the departed cave rats....but that raghead POS that lives in the WHITEHOUSE will do nothing","commenter_a":"Uh....why????","post_message":"BREAKING NEWS:"},{"comment_id":"10153226808856378","commenter_b":"Get over yourself Sarah","commenter_a":"Smart, caring woman who made a point in a positive way","post_message":"INSPIRING ACT OF KINDNESS: A woman says she was at the coffee shop with her 22-month-old child when two women behind her in line started making mean, hushed comments about her looks. Rather than returning hate with hate, the woman decided to be a role model for her child and show the women kindness."},{"comment_id":"1100490033318081","commenter_b":"Suck it up b**ch","commenter_a":"I thought this family was rich. What gives?","post_message":"Hardly 5 star quality... \"She explained a slight bit of displeasure about her accommodations and I explained to her this a jail, not a resort.\" -Sheriff Anderson @webpagelink"}]
