[{"comment_id":"1857403831172162","commenter_b":"If brains were dynomite these broads couldn't blow their tampx loose.","commenter_a":"Reality sometimes is in our face This just the beginning","post_message":"Classy!"},{"comment_id":"10153517390897293","commenter_b":"TRUMP KNOWS HOW TO NEGOTIATE! Politicians see how you get things done! Everyone is talking about Trump, and he doesn't have to pay a penny! Awesome! This is a Revolution for Trump like I have never seen in my 63 years! Go Trump! The man with COMMON SENSE! Obama was bought by the Communist Billionaire George Soros. Soros' main objective is to destroy America. Soros is now buying Hillary. NEWS MEDIA IS BRAINWASHING AMERICA TO HATE TRUMP! The people who have ruled America behind the backs of Politicians they have paid to win will lose a lot of MONEY if Trump gets elected. Who are these people, well some of them OWN NEWS MEDIA STATIONS! How many World Leaders have been paying Politicians to run so they could have a payback when the Politician got into power? Notice how much money America sends to other Countries? Think about it, WHO ...","commenter_a":"Waaaaah.","post_message":"He's out of Thursday's debate."},{"comment_id":"1854124191468836","commenter_b":"Perhaps that bitter old lady should learn proper English. Disgusting behavior.","commenter_a":"Like this white woman has never held a space or stood in line for a family member. Come-on!!! we have all done it. What the F..k!!","post_message":"The video is intensely uncomfortable to watch. After a shopper berates two others in line, telling one \"you are nothing\" and worse, a mall says it's banning the woman for her racially-charged tirade. @webpagelink"},{"comment_id":"10152797801290671","commenter_b":"You should leave this planet! Your unreal.","commenter_a":"Looks like she's the one on the control on causing a riot","post_message":"Have you seen this video? A woman in Baltimore was caught on tape hitting a young man, believed to be her son, after catching him participating in the riots. About the incident, Baltimore's police chief said: \"...I wish I had more parents [like her] that took charge of their kids out there tonight.\""},{"comment_id":"10153226517872232","commenter_b":"Probably...","commenter_a":"And while all were watching the fight 1 or more were most likely walking out with merchandise","post_message":"CAUGHT ON VIDEO: Several women got into a brawl Friday afternoon inside the popular Rittenhouse Square clothing store, Zara --> @webpagelink"},{"comment_id":"363912913812223","commenter_b":"This LOSER should not even be in this country!!!!!!","commenter_a":"I say disarm the cops on the same day that this turd becomes a vegitarian!","post_message":"Michael Moore Demands Cops Disarm!"},{"comment_id":"1095951603760962","commenter_b":"Don't forget her daughter got knocked up","commenter_a":"and her 'classy' son beat up his girlfriend...great family values","post_message":"When it comes to Donald J. Trump, the gloves are off."}]
