[{"comment_id":"1406868092703665","commenter_b":"Get back here with my food mother fucker!","commenter_a":"Christopher. Stop allowing the americans access!","post_message":"Does the US government want a war with Russia?"},{"comment_id":"10153415680402293","commenter_b":"How about we stop immigration all together, butt out of everywhere and take care of our own problems!","commenter_a":"He wants to ban Muslims from entering the USA but why he doesnt ban the US from stealing Muslim's oil and lands","post_message":"“How can a country that always talks about human rights and freedom do this or even consider this?”"},{"comment_id":"1245546388827745","commenter_b":"Don't disparage whores.","commenter_a":"Barrasso. It's embarassing to watch these whores. These scumbags have gotten so emboldened they don't even try to hide their crimes.","post_message":"Right after leading the floor debate in support of Scott Pruitt’s nomination to lead the EPA, Sen. John Barrasso attended a high-dollar fundraiser hosted by energy lobbyists."},{"comment_id":"10155757585249829","commenter_b":"Why not boycott Budweiser simply because it is not good beer?","commenter_a":"Melania???????","post_message":"Trump supporters on social media were furious: \"Never drinking Budweiser you should respect the AMERICAN president instead you mock with liberal propaganda.\""},{"comment_id":"489404284583485","commenter_b":"The hell with her","commenter_a":"Slick willy is at it again!","post_message":"Bill Clinton's promiscuous behavior could ruin Hillary's chances. Excellent. Help us spread this and make sure she never get's into office. Do you agree that Hillary would be a terrible president?"},{"comment_id":"1116440755118842","commenter_b":"O the transcripts, that was so lame lady. #LameLady","commenter_a":"Bernie did well as always I believe him. I'd like to remind he Secretary you have to win the primary first. I'm checking out now, I just can't stand to listen to her. I don't believe her I don't trust her.","post_message":"For updates from the #DemTownHall in Nevada, check out our liveblog: @webpagelink"},{"comment_id":"10154883066819411","commenter_b":"They don't care about children being blown to bits as long as they can let trans use women's toilets and have gay marriage","commenter_a":"They are so fukn stupid. Clinton will plunge this world into war and then run for the nearest bunker.","post_message":""}]
