[{"comment_id":"10153423522201636","commenter_b":",,,keep yer head down and leave the building!!!","commenter_a":"I KNOW WHY,,, never ever ever ever talk about PERIODS when a woman has her period!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! :O","post_message":"The answer is simple"},{"comment_id":"1574139022896040","commenter_b":"Put this animal to death!","commenter_a":"Yeah, good luck with that.","post_message":"The Attorney General is required by ethics regulations to avoid even the \"appearance\" of a conflict of interest. She has clearly violated this regulation. SIGN THE PETITION to join us in demanding her resignation."},{"comment_id":"952148034847314","commenter_b":"How LOW can you go? What a dirtbag!","commenter_a":"Public Square Hanging is well deserved.","post_message":"EXPLOSIVE: Thief Stole Veteran Gravestones to Make Granite Flooring at His Home (VIDEO) @webpagelink"},{"comment_id":"10153892614846323","commenter_b":"Heartless bitch","commenter_a":"you failed your child it is your job to teach them not to go to strangers homes do not trust people over the internet and so on","post_message":"\"My heart breaks to think how scared he must have been.\""},{"comment_id":"724989260938156","commenter_b":"Honestly I wouldn't blame people for moving to canada if trump got presidency tonette kamakahi-gumapac","commenter_a":"Votefor Trump Happy Easter. Let's spend next Easter with Trump in the White House!","post_message":"Happy Easter to all, have a great day!"},{"comment_id":"10152928682609753","commenter_b":"Is this another religious thing and now pushing in Indiana utah has cults that dirty old men take child brides and they dump boys out very young so no competition pigs","commenter_a":"disgusting","post_message":"The child’s mother, who is reportedly divorced from the father, asked that he not carry out the ceremony, but to no avail. Although the wedding was not recognized under Australian law, the series of events that took place after the wedding have led to the father’s arrest."},{"comment_id":"10153345787268984","commenter_b":"She's a corn ball","commenter_a":"Yes, She Is Crazy!","post_message":"Christians are ripping Hillary to shreds over this. What was she thinking?? Do you think Hillary's already done enough damage to America?"}]
