[{"comment_id":"10153855927834330","commenter_b":"Wow","commenter_a":"You kids are borderline retarded","post_message":"\"Dewshine\" is a mix of racing fuel and Mountain Dew. Two teens are now dead after consuming the highly toxic mixture ---> @webpagelink"},{"comment_id":"1184007451677789","commenter_b":"She's a stupid bitch lieing douche","commenter_a":"Another liar that is living off of taxpayers, was educated off of the taxpayers dime by lying.","post_message":"Sen. Elizabeth \"Fauxcahontas\" Warren just decided to make a video bashing Donald J. Trump. That wasn't a surprise... however, the humiliating error in the video WAS. This shows just how bumbling the Democrats are... what a failure."},{"comment_id":"10153315079826680","commenter_b":"Women are voting for her because she's the most qualified and she's been speaking up for us her whole political career. Not because we're shamed or bullied into it.#Imwithher","commenter_a":"And join her in hell","post_message":"POLITICO's Roger Simon says: It's a strange world when women are being shamed into voting for Clinton."},{"comment_id":"925749584134949","commenter_b":"May they name a FEMA camp after you. What a totally ignorant woman you are! Unbelievable!","commenter_a":"You need some solid intelligence. We had these under Bush , he is the one who stated war and depleted the reserve funds. Obama replenished them. I am happy to have such a high IQ, highly educated president with multiple graduate degrees including a Doctorate in Constitutional Law. He even taught it at Harvard. I have worked on secure govt projects . The govt can show power to those in the Middle East . Fox News? keeps the fear mongering going. It has a 20% accuracy rate. The elites are the Koch brothers & Corporate powers. Get a reality check!","post_message":"In case you missed it, here's the top story from Tuesday: The recent exposure of the nationwide Jade Helm 15 exercise has made many people suspicious, and with good reason. Federal crisis exercises have a strange historical tendency to suddenly coincide with very real crisis events. The elites are clearly preparing for something big. When the elites wage war on America, this is how they will do it: They will control public opinion, control the public, isolate population centers, decapitate leadership, and initiate fourth-generation warfare. Crisis is the best weapon the elites have at their disposal, and exercises like Jade Helm show that they may use it in the near term. The defense that defeats crisis is preparation — preparation not just for yourself, but for others around you. War is coming, and while we can’t know the exact timing, we can assume the worst and do our best to ..."},{"comment_id":"1143835818981314","commenter_b":"I love the books. I have them all except the 3rd one.","commenter_a":"Tell them to send to the literacy centers ,people will buy them from the literacy centers to keep them running or they can build a literacy in the U.K. for the people there.","post_message":"A charity bookshop in Wales is begging people to stop donating \"Fifty Shades of Grey\" after becoming overwhelmed with hundreds of copies of E.L James' steamy novel."},{"comment_id":"1272811836073158","commenter_b":"I wouldn't mind my dick being six feet longer","commenter_a":"Is this before or after birth......if so I know many candidates for editing DNA to make civilised human.....step forward 8b7...there are some 'adjustments' needed.","post_message":"Should we be allowed to edit human DNA?"},{"comment_id":"10153555901929087","commenter_b":"GO #TRUMP !!! HECK YEAH...YOU BET!!! THE ONLY ONE WHO WORKS CIRCLES AROUND THE REST, WHO KNOWS EXACTLY HOW TO MAKE AMERICA GREAT AGAIN !!! YOU BET!!!","commenter_a":"Yes, he's a strong Christian who takes on the Pope and walks in the path of Christ, building walls, abusing women and attacking people of other cultures. If this guy's a Christian, I'm Christie Brinkley.","post_message":"\"I'm always audited by the IRS, which I think is very unfair. Maybe because of religion,\" Donald J. Trump said after tonight's #GOPdebate. \"Maybe because of the fact that I am a strong Christian...you see what's happened, you have many religious groups complaining about that.\""}]
