[{"comment_id":"498469603689886","commenter_b":"This sissy should go into a latino hood, she won't be talking smack for long","commenter_a":"Get outta here.","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING. Enjoy. ~ DG"},{"comment_id":"1156042484488515","commenter_b":"Amen.....She is a disaster ... vote Trump!!!","commenter_a":"Mr. Hannity. you can talk this forever and they will not change. It is sad really. Appreciate your efforts and continue with your hard work exposing what is wrong with politicians. All of them!","post_message":"\"It's a choice between Donald J. Trump, a candidate who says he'll drain the swamp in Washington and bring about real change, or Hillary Clinton, the most corrupt career politician who's ever run for this office.\" – Sean Hannity"},{"comment_id":"1103608743035479","commenter_b":"Just going off the man's statement. And yes some of my statement is assumption because of some of the stuff he has said.","commenter_a":"You do know like every neighborhood in America Muslim community are already patrolled. They patrolled by cops. An if did know this after 9/11 the FBI and NAS already monitor communication it those communities than to the Patriot Act. So what Ted Cruz is talk is already being done. What Ted Cruz really wants to do like communist leaders would do in term of monitor arrest you and in prison you with any form of guilt. He want to doing like Castro. It's funny Ted Cruz father escaped Cuba to get away from communism. No Ted Cruz is advocating the same communist view his father escaped from. If you look at his policies Ted Cruz is nothing more than a communist pretending to be a Republican.","post_message":"Ted Cruz was blasted this week for saying Muslim neighborhoods should face extra patrolling to prevent extremism. Here's why Cruz says those critics are wrong. Do you support or oppose Cruz's plan?"},{"comment_id":"1220652477966511","commenter_b":"LOCK HER UP! LOCK HER UP!","commenter_a":"Lock her up!!!!","post_message":"Live: Donald J. Trump delivers a speech at the VFW National Convention in Charlotte, North Carolina."},{"comment_id":"994057867406695","commenter_b":"3 americans tried to blow up a mosque in Kansas. No coverage here","commenter_a":"This is why we should NOT bring anymore refugees here and should return the ones that are here. We NEED to take care of our Americans first!","post_message":"An Iraqi refugee who planned to blow up two malls in Houston pleaded guilty to trying to help ISIS. @webpagelink"},{"comment_id":"10153942859244024","commenter_b":"Let's ban YOU !","commenter_a":"Disgraceful","post_message":"He supposedly got \"PTSD\" from shooting an AR-15 and now wants to ban \"God Bless America\" from baseball games. @webpagelink"},{"comment_id":"10155010773818812","commenter_b":"Cynthia lol ur such an idiot","commenter_a":"Crazy! The country is not in mourning it's thrilled!!!😃😃😃","post_message":"The first post-election \"Saturday Night Live\" didn't open with a sketch spoofing the presidential candidates, nor did it include Alec Baldwin's Donald Trump. Instead, it opened on a somber note."}]
