[{"comment_id":"10154339117992619","commenter_b":"THERE JOINING ISIS WILL LIBERATE THEM FROM ALL THERE PROBLEMS","commenter_a":"SO YOUR POINT IS ????","post_message":"A transsexual man and his gay female friend, have left to join ISIS, unaware that ISIS publicly executes gay people by throwing them off buildings and stoning them."},{"comment_id":"887899764578453","commenter_b":"Any woman dumb enough to marry a cop shouldn't be surprised when he starts beating on you. How do you think cops unwind after work? The single ones get a dog to kick around","commenter_a":"Smh! When will it end?","post_message":"With all these red flags, police still didn't step in and protect her. Is it because the abusive husband was a fellow cop, so they just let him do what he wanted to her? Wow!"},{"comment_id":"10153573991208132","commenter_b":"Officer Donahue is a true hero","commenter_a":"My cat Quacks too!","post_message":"So. Many. Feelings."},{"comment_id":"10153436086986509","commenter_b":"She's a crooked, unethical liar.","commenter_a":"Hillary Clinton seems to irritate all Republicans. I don't understand their problem is it because she's strong, smart, not afraid to speak her mind?","post_message":"While Hillary Clinton isn't the first secretary of state to use a private email address, she is the first to exclusively use a private account during her tenure: @webpagelink"},{"comment_id":"677264589079564","commenter_b":"If Muslims are offend by us they can leave and go else where....maybe Syria.","commenter_a":"He'll no","post_message":"Muslims Are OFFENDED By This Teams Fans Uniforms, Should They Be Forced To Change it? Take our poll!"},{"comment_id":"10155149699869558","commenter_b":"I just watched two segments of news, that being just a plain old person, it seems to me could be mutually worked out to everyone's benefit. It costs to become a citizen. AND our infrastructure is failing..Why cant' we find how willing these people are to be here by having them work for 2 or 3 months for construction, they could work for 4 hours for free to pay for citizenship, and 4 hours for pay for living expenses, A place to stay would be provided while they go through a 2 or 3 month vetting and so prove they really want to be here and are willing to honestly work for it.","commenter_a":"All you americans opposing trump are thick as hell he trying to save your country leave him alone let him do what is needed i wish we had him back off dont be thick all your lives","post_message":"\"That's not press bias. That's blatant dishonesty... The illegal immigration issue has been set up by the media to demonize Mr. Trump as a racist and a brutalizer of the poor.\" In his Talking Points Memo tonight, Bill O'Reilly ripped the mainstream media coverage of federal immigration officials arresting more than 600 people across at least 11 states last week. MORE: @webpagelink"},{"comment_id":"10153591926318984","commenter_b":"She's bitchin because her kids need to eat, where are the 6 daddies at? And where do these people think that money comes from! Get a fucking job!","commenter_a":"TRY AND GET ONE OF THE JOBS THAT OBAMA AND THE DEMOCRATS ARE GIVING THE ILLEGALS THAT ARE COMING OVER THE BORDERS THAT HE WILL NOT CLOSE P.S. ASK OBAMA WHY HES DOING THIS TO YOU DO YOU REALLY THINK HE HELPING YOU AND YOUR FAMILIES IF YOU DO YOU ARE ONE OF THE PEOPLE THE DEMOCRATS SAID HAD. STUPID WRITTEN ON YOUR FOREHEADS ITS TIME FOR YOU PEOPLE TO SMARTEN UP DONT YOU THINK","post_message":"This is simply shocking... Is this what our founders envisioned for America?"}]
