[{"comment_id":"1184007451677789","commenter_b":"She's a stupid bitch lieing douche","commenter_a":"Another liar that is living off of taxpayers, was educated off of the taxpayers dime by lying.","post_message":"Sen. Elizabeth \"Fauxcahontas\" Warren just decided to make a video bashing Donald J. Trump. That wasn't a surprise... however, the humiliating error in the video WAS. This shows just how bumbling the Democrats are... what a failure."},{"comment_id":"718386484926627","commenter_b":"But as soon as they hit 18, they're prostitutes? Crazy how one second can change the definition... #ijs","commenter_a":"Please don't call under age girls child prostitutes. They are victims of being sold to sex traffickers, or kidnapped. They are victims, not prostitutes.","post_message":"It wasn't all fun and games on Super Sunday."},{"comment_id":"10154992215446729","commenter_b":"Stephanie Hallstrom Hillary is from Chicago.....send her back there. They grew her. They can keep her.","commenter_a":"You can see her jerking several times prior to falling / collapsing. Clearly from a seizure people know the difference. She should stop her thirst for greed and power and live her life and take care of herself in the private sector for herself and the American People. It was not weather people were there saw others in worse health and heavier clothing...she came out wearing same clothes as before. She is not well. Go Home Hillary!!","post_message":"Help get this out there, folks! People need to know the TRUTH."},{"comment_id":"10154630548633132","commenter_b":"Her stepmom Melania looks like Caitlyn Jenner lol","commenter_a":"Not being mean but she reminds me of Miley Cyrus..","post_message":"Donald J. Trump and Marla Maples daughter Tiffany is addressing the nation."},{"comment_id":"10156247602125354","commenter_b":"Waaah, send them home","commenter_a":"Ha ha ha ha ha","post_message":"Newsflash: you wouldn't BE in jail had you not illegally entered the country."},{"comment_id":"10154134497810575","commenter_b":"I'm so sorry for your lost child. It sad and terrible we are being made to put up with these illegal criminal invaders.","commenter_a":"Hang him and the next ten people who allowed him to be here.","post_message":"NEW YORK GIRL DIES AFTER BEING HIT BY TWICE DEPORTED ILLEGAL ALIEN...."},{"comment_id":"10157614671450293","commenter_b":"Time to take car keys. Hope this turns out well.","commenter_a":"He may of said screw it and is partying in the infield at dega . Lol . But serious note hope yall find him safe","post_message":"Have you seen this man? He was last seen driving to Coldwater, Ala. to see his son. CLICK to see if you recognize him, and please contact police if you have any information:"}]
