[{"comment_id":"10155450012565354","commenter_b":"Common Women are not going to waste 2000/yr on themselves. That is uncommon disposable income.","commenter_a":"You are not close to \"the common woman,\" if you refer to her as \"the common woman.\"","post_message":"Gwyneth is quickly becoming our favorite celebrity."},{"comment_id":"833696443343651","commenter_b":"What a sick statement, what a horrible woman!","commenter_a":"Hillary Clinton was awarded the Margaret Sanger award for her abortion stance.","post_message":"How many of you would have been aborted under this perverted logic?"},{"comment_id":"10154660794741756","commenter_b":"Shut Up Clown!","commenter_a":"If Venus or Serena were caught using this stuff they would have been stripped of everything!! Those double standards.Lol","post_message":"\"If it's not banned, athletes will use it.\""},{"comment_id":"10152931413566491","commenter_b":"Love how in America, its the land of free ONLY if you don't go against the status quo or what's defined as \"normal.\" I'm a straight dude, and guess what? When it comes to gay people, I mind my own business. I support the human right to love, so long as no one is hurt. I just wish minding one's business was actually expressed by the many who love to use it for themselves only.","commenter_a":"Obviously there are a lot of Christians or Islamists or whatever commenting on here with a ton of negativity about this. Being a Christian myself, God does not teach us to hate on people for choosing to marry the same sex. He teaches us to love others amd treat them fairly. Give your head a shake people.","post_message":"After the historic Ireland vote, here's where else gay marriage is legal."},{"comment_id":"1067844663241313","commenter_b":"Texas i never would have u of all states would let muslims take over u capital and Texas read there korah they hate sll non muslims u have been fooled ,they use our laws againest us to get into our goverment , the woman had a right to speak she is a American citizens talking about God and Jesus his son , and u made her leave i bet her family fit 4 our freedom can u say the same about ur muslims that were there ,muslims use people like u all falling 4 there garabage ,i bet they are not even citizens , Texas ur idiots make no mistake the muslims will try to take texas over ,then where are ur Texas Rangers ,","commenter_a":"I see everyone praising this woman, and it's cool I respect her opinion and her right to her actions. But why use the name of Jesus for all the hatred rants. Like when the illegal kids on the bus came to the U.S. and got screamed at and booed by \"Christians\" I wonder if Jesus came down here would be ranting with his Christians or would he be loving everyone?? I think you should do your hatred rants in your name. Not the Lords name.","post_message":""},{"comment_id":"10154542525666051","commenter_b":"So we get rid of all the illegals and we pay $5.00 for a head of lettuce cause who is going to do all this work?","commenter_a":"Sneaking into our country is explicitly illegal. Why is Mexico allowed to have a wall on its southern border with strictly enforced immigration laws but America isnt? What would happen to 100% of Americans caught illegally entering","post_message":"The Trump Administration's latest deportation plan is explicitly illegal under international law. Here are the details:"},{"comment_id":"1702569516701619","commenter_b":"Soetoro the ineligibles wife did do that! But why are the D traitors who condone it with NFL players so upset??","commenter_a":"Oh yeah would of never heard the end of it.","post_message":"Oh, how they would SCREAM! Shared by Occupy Democrats, LIKE our page for more!"}]
