[{"comment_id":"1118917194866740","commenter_b":"Thanks for stating this. I'm a follower of Christ and so glad you get it about Tebow.","commenter_a":"I'm not a Tebow fan, or a Florida Gators fan, or religious. But I never understood the hate directed at what seems to me to be a decent human being that threw his actions has shown hes willing to help anyone. Funny my fellow Athiest scream about this man \"shoving his faith in our face!\" Don't seem to mind shoving their Athiest views down everyone else's throat.","post_message":"\"The goal of this book was if you pick it up with your head down, you finish the book with your head held high knowing that God has an awesome plan for your life, you matter, and you're important -- and that's a bigger identity than anything that the world could ever offer.\" — Tim Tebow on his new book \"Shaken\""},{"comment_id":"611652445656331","commenter_b":"USE'N The Words \"Protect & Serve\" Is An Excape For Majority Of Ths Police Officers Who Shoot & Kill Inoscent' Civilians ... SMH* It Is A Shame ...Need To Weed -Out The B.A.D. - POLICE OFFICERS Sister Asiyah Hensley Ka'Bah Brother Abdul Azim Ka'Bah","commenter_a":"Thank you for standing up and stating the truth","post_message":"\"These shooters aren't my brothers in blue, they're murderers.\" - Rep. Andre Carson, a former law enforcement officer, joined other members of the Congressional Black Caucus to condemn the recent police shootings of Alton Sterling and Philando Castile Read more: @webpagelink"},{"comment_id":"10152719503449117","commenter_b":"Don't these pigs have any REAL criminals to hunt down???","commenter_a":"Boy that's a basket of snarls","post_message":"Why the sex lives of teens should be subject to school discipline is suspect enough, but it's extra perplexing what interest the government has in such matters."},{"comment_id":"510721549087800","commenter_b":"Ok 1. Lets ask ourselves do they want to destroy capitalism answer (no) 2. Will they take the means of production from the capitalist answer no 3. Do they want to destroy the upper class answer no","commenter_a":"The progressives will next demonize God and Jesus then they'll start pushing multiculturalism and diversity so Ireland get ready","post_message":"\"Abortion has been demonized and criminalized in this country and older generations think there's something really wrong of it... but it's something that should be available to people.\""},{"comment_id":"10154134497810575","commenter_b":"I'm so sorry for your lost child. It sad and terrible we are being made to put up with these illegal criminal invaders.","commenter_a":"Hang him and the next ten people who allowed him to be here.","post_message":"NEW YORK GIRL DIES AFTER BEING HIT BY TWICE DEPORTED ILLEGAL ALIEN...."},{"comment_id":"1669026716715370","commenter_b":"You can not close borders. People can fly here, come on boats and come via Canada or Mexico. The president has deported more illegals than any other president. Frankly the wealthy prefer to hire illegals to watch their children, clean and build their homes and other jobs because they do not want to pay minimum wages and want them to work as slaves in the farms, restaurants and factories. Put the blame where it belongs, on the 5%ers that are reaping the benefits of immigrants. They get you passed at the victims rather than themselves. If you want change you have to vote for someone brave enough to address the issues and actually formulate and execute a plan. Perhaps Bernie who actually addresses the issue. Voting for billionaires backed by the 5% will not resolve any issues.","commenter_a":"Obama better back off, he is allready in it for Treason","post_message":"Franklin Graham just delivered a MASSIVE message to Obama and the left about jihad and what it means for America... liberals are furious, but over 100,000 people have \"liked\" what he said on Facebook. Do you agree with Rev. Graham?"},{"comment_id":"10154575462084714","commenter_b":"No, a set is 3 games. They lost one game in a set, which is the only time they've lost in Rio.","commenter_a":"But did she win??!","post_message":""}]
