[{"comment_id":"1279026295523755","commenter_b":"Translation: \"such a nasty woman\"/\"Bitch\"","commenter_a":"I just have to laugh about this because he represents himself so horribly and it just scores points for Hillary. She is tough and takes it like a woman because women are strong and tough!","post_message":"Absolutely deplorable."},{"comment_id":"10154557994494087","commenter_b":"She is a lunatic! Ugh","commenter_a":"Jeff Sessions was that racist that prosecuted the KKK and has many black friends who defend him, yet Senator Warren throws the racist term around while pretending to be a native American? I don't get it. If you just hate someone just say it. Calling him a racist simply makes Ms Warren a racist and someone who stole from native Americans in order to further her financial coffers. You ma'am have Skelton's in your closet, live in a glass house yet you cast the first stone. Remember those HS days and your words Senator Warren.","post_message":"Elizabeth Warren: “Consider this MY warning: We won’t be silent. We will speak out. And we WILL persist.”"},{"comment_id":"627774310707730","commenter_b":"Kathleen, you're an illegal alien","commenter_a":"This is very offensive. 1) I am well educated- I even completed a College degree. 2) I am not a racist or a bigot. 3) I love America Deeply and believe in her core principals. I am voting for Trump. I voted for him in the primary's and I will vote for him at the national level if he makes the ballot. I have been a registered Republican Since GW was voted in Office. Now I can agree that Mr Donald Trump can at times speak without discernment; however it is my opinion rather my belief that he is best suited for the position given the day and age we live in. You can not practice Islam without shariah law- they go hand in hand. It surprises me that persons with liberal views- LGBT- Freedom and separation of Church and state- Equality for all races- ages and gender- would open ...","post_message":"Yep."},{"comment_id":"642587655914116","commenter_b":"These people are uneducated and ignorant!!!!","commenter_a":"The blind leading the blind. Good lord they actually believe this nonsense. I'd honestly be embarrassed for them if it wasn't so flipping sad. Dummy down people we're in for a long four years.😥","post_message":"Dear Lord."},{"comment_id":"10153359529326051","commenter_b":"I would have beat her ignorant ass with a stick too. Hopefully karma hits her with a Mac truck.","commenter_a":"And that is why I dont trust daycares","post_message":"When this woman's 2-year-old son came home with these marks on his leg, she marched down to his school and demanded to see the surveillance footage. Now she's even more outraged."},{"comment_id":"1050901851597824","commenter_b":"It wont be single payer with this Congress. Thank God the sane people control Congress. Liberalism is a mental disorder.","commenter_a":"Wrong. The ACA was intended to fail. This will be replaced by single-payer, all Medicare/Medicaid type system.","post_message":"Obamacare was supposed to fix the problems created in the healthcare system by pre-Obamacare government meddling. I wonder why it didn't work? Be warned - an Obamacare bailout (mostly for the insurance companies) could be on the way."},{"comment_id":"10153235771901167","commenter_b":"Pay close attention! And the Liberals love this guy? @webpagelink","commenter_a":"Exactly. Hate crime.","post_message":"Multiple Planned Parenthood clinics have been targeted in arson attacks since the release of highly edited videos trying to smear them. Why aren't you hearing about that on the news?"}]
