[{"comment_id":"10153232515139087","commenter_b":"Will she go away now?","commenter_a":"Rosa Parks, Martin Luther King, and Abe Lincoln all fought for equality. Kim Davis is trying to deny equality to people.","post_message":"Kim Davis was compared to Abraham Lincoln, Martin Luther King and Rosa Parks as she was given the \"Cost of Discipleship Award\" by the Family Research Council."},{"comment_id":"426421217482473","commenter_b":"Yeah, I can picture this foul-tempered, lying, self-centered Socialist with an executive order pen in her fingers! Makes my blood run cold! There is NO WAY this liying, evil woman should ever get near the White House. She would be a foul-tempered dictator!","commenter_a":"Lowlife!","post_message":"Is Hillary Clinton threatening to betray the constitution?"},{"comment_id":"10154179155026051","commenter_b":"Yup","commenter_a":"Nop","post_message":"Do you think Donald Trump would be a better president than Hillary Clinton?"},{"comment_id":"10154031009040329","commenter_b":"I'm crying about all of this all over again!!!!!!!!!!","commenter_a":"Riley","post_message":"People keep telling you “it’s only a show,” but then why does your heart hurt so much?"},{"comment_id":"10153945154891323","commenter_b":"Naser E. Kandjani many nations in Asia and Europe and Africa have million Muslims without conquests or wars and they were just spread by talking through Muslim merchants and travellers in these countries..you can read how Islam spread in east Africa and many Asian countries especially China Indonesia phillipines Malaysia ...all these countries have Muslims though no wars or conquests arrived there ...most Muslim nations today became Muslims without wars","commenter_a":"Anti-islam movements in Europe are treated as any political group and not called terrorist organizations ...What if there were anti Christian organization in any European country ..how will u react to it? Your double standards created extremisim in the whole world...","post_message":"'Islam has failed': Former EDL leader Tommy Robinson brings Pegida to the UK. Tommy Robinson stepped down as leader of the far right English Defence League in 2013. Alongside two former Ukip candidates, he is now setting up the UK arm of Pegida, the pan-European anti-Islam movement. Film-maker Simon Winkler joins Robinson as he prepares for Pegida’s first march in the UK."},{"comment_id":"10154044965451717","commenter_b":"The school I taught at had GSA. Admin discovered they HAD to allow it because they had FCA (Fellowship of Christian Athletes). Best use of irony. If a school has a non-curricular club it must allow other non-curricular clubs on campus. Federal law!","commenter_a":"When I was in high school we had one, he next year we got a new principal and he shut it down","post_message":"The ACLU says the ruling strengthens the rights of middle school students, putting them on the same level as high school students."},{"comment_id":"1155951624441179","commenter_b":"\"Security concerns\"... Right. It was probably because smiling is illegal.","commenter_a":"Real reason: Mewtwo is in Tehran 😂","post_message":"Iran isn't going to catch them all."}]
