[{"comment_id":"10154126092428132","commenter_b":"So sorry to hear your loss and prayers goes out to you and your family God bless","commenter_a":"Prayers for your brother so sorry.","post_message":"The news comes just a day after Celine Dion lost her husband, Rene Angelil, to the disease."},{"comment_id":"1707925176144398","commenter_b":"The shemale will sit alone","commenter_a":"He has no right to assume that the people who have died from gun violence would not have wanted to be able to carry That they might have been AGAINST gun free zones.. It's again his agenda if one of my family members had been one lost to these acts of violence I would demand that they NOT SPEAK ON THEIR BEHALF...THAT THE PRESIDENT make reference to the fact that he DOES NOT SPEAK for ALL CITIZENS","post_message":"The Obamas never miss an opportunity to shamelessly politicize an event. At the next State of the Union, Michelle Obama will be sitting next to an empty chair; and the outrageous reason why will have you shaking your head... Are you glad this will be Obama's final State of the Union?"},{"comment_id":"1285543264804515","commenter_b":"No, and unless her ancestors were Native Americans, they were illegals and traitors to the Crown.","commenter_a":"She's as ignorant as she is ugly, does she not know anything about American history for Christ sake.","post_message":"Someone should tell Ann Coulter cocaine makes you age poorly."},{"comment_id":"10153859214957169","commenter_b":"Should Donald Trump become President,what he has in mind to do,will go over Congress first","commenter_a":"All the blame on the \"current administration\" ignores that both the house and senate are republican...and they control (or obstruct) a major part of what happens in this country. Tho there is some opportunity for a president to make executive orders, it is a limited power. So our votes for our state reps and congress will carry a lot more weight. Just sayin'.","post_message":"Here's a look at some of the Republican presidential candidate's claims and how they compare with the facts (From PBS NewsHour)"},{"comment_id":"10153440964853606","commenter_b":"Omg","commenter_a":"prayer for him and were r parents hope parents go to jail","post_message":"A 2-year-old boy is in life-threatening condition after he was found at the bottom of a pool Sunday evening. @webpagelink"},{"comment_id":"608045926060248","commenter_b":"Try saying dick her dick her. Another girl commented saying it coulda sounded like that. Lol","commenter_a":"I have alexa... She doesnt curse. She bleeps(literally) out inappropriate words in her speech automatically. Idk about this. I'm gonna try it.","post_message":"An innocent request turned awkward real fast! #WSHH"},{"comment_id":"1050901851597824","commenter_b":"It wont be single payer with this Congress. Thank God the sane people control Congress. Liberalism is a mental disorder.","commenter_a":"Wrong. The ACA was intended to fail. This will be replaced by single-payer, all Medicare/Medicaid type system.","post_message":"Obamacare was supposed to fix the problems created in the healthcare system by pre-Obamacare government meddling. I wonder why it didn't work? Be warned - an Obamacare bailout (mostly for the insurance companies) could be on the way."}]
