[{"comment_id":"10153025578804753","commenter_b":"Which one are you Dave... The chick in the skirt..?","commenter_a":"Cowardly cops should go find work at the library..!","post_message":"Police said the man instead charged at the officer, who retreated behind his patrol car while giving numerous commands for the suspect to drop the rock. The man raised the rock to strike the officer, so the officer fired his weapon 3 times to prevent the suspect from striking him. According to a police statement, the officer, “used deadly force against deadly force”"},{"comment_id":"10154287365081130","commenter_b":"Bitter angry woman hater. I feel sorry for your kids, especially if you have daughters.","commenter_a":"We should let children make their own decision about whether they get to live or not. All Americans have basic civil rights and women do not have the right to take the right to life away from another living human being.","post_message":"\"We should let women make their own decisions.\" 👏"},{"comment_id":"1304540879566920","commenter_b":"If Gwyneth puts it in Goop, it's not a feminist thing, lol","commenter_a":"This is a feminist thing, eh?","post_message":"Don't put herbs in your vagina, for goodness sake. Your womb doesn't need a freaking detox."},{"comment_id":"10152774797039877","commenter_b":"She still in hot water","commenter_a":"So wait a min. Im from cleveland lol. So this boy was 5'7 195 lbs bundled up pointing a fake gun at people in the park with his little sister..... Yea the cops did not have to kill him but no one thinks the parenting is to blame ??","post_message":"Extended Tamir Rice Video Shows Cop Tackle His 14-Yr-Old Sister As She Rushed To Her Dying Little Brother's Aid. Watch the heartbreaking video here. Grio fam, sound off with your thoughts on this extended video."},{"comment_id":"10153304044791336","commenter_b":"Hope they show up in mine, I'll send them to hell.","commenter_a":"Please study these faces they could turn up in your neighborhood","post_message":"The five Taliban leaders traded a year ago for Sgt. Bowe Bergdahl could be free to travel as early as Monday as the terms of their supervised release are set to expire."},{"comment_id":"1132425910108091","commenter_b":"The Duggars need to be rape themselves so they can experience what is like to be violated only then they will know that is not something you can can forget or forgive and it's even worse when the rapist is a family member that's supposed to protect you.","commenter_a":"Proves they believe girls/women have no value.","post_message":""},{"comment_id":"10155768590015557","commenter_b":"Lmao they must be the fugliest bunch of prostitutes in the planet. A darn shame for whoever plugged in that","commenter_a":"I'd rather do the 5 knuckle shuffle. Gross. Just legalize it, better quality.","post_message":"'It's been a problem around here for awhile,' Reading resident says following an undercover sting that resulted in the arrests of eight women on prostitution charges. More on the story in a live report from WFMZ's Ryan Hughes on #69News at 5:30."}]
