[{"comment_id":"10153977079018717","commenter_b":"@username i agree there certainly is an issue which needs to be on a high priority list.","commenter_a":"Come on everyone!! Cut the crap!! Humans lives matter!! Nuff said.","post_message":"The owners thought it was a good idea at the time, but a slogan for a restuarant menu item has turned into a controversy!"},{"comment_id":"10154647269064024","commenter_b":"You must be dumber than dumb to believe a fake news story. And the folks in Hamtramck are laughing their asses off at you, and everyone else, who believes this codswallop. Hamtramck is NOT under Sharia law.","commenter_a":"You folks in Hamtramck, Michigan must be dummer than dumb, now you can live and enjoy what you have done. Happy Days are NOT in your future.","post_message":"First Muslim City Council In U.S. ENFORCES Sharia Law... Too Late Now! - BB4SP"},{"comment_id":"10154717771869657","commenter_b":"Moving forward..and having some fun goes along way..Go Trump!! Trump Up!!","commenter_a":"Lol","post_message":"Whiplash."},{"comment_id":"1044157185605292","commenter_b":"Wikipedia that hoe","commenter_a":"Let's be real, we never went to the moon.. We did not have the technology to go through the Van Allen radiation belt. The astronauts would had been cooked alive.","post_message":""},{"comment_id":"10157252417295354","commenter_b":"TRUMP...Build that wall!","commenter_a":"Ten accused, 3 convicted, 2 still not apprehended. One was going to use his \"Federal Education Aid\" money. Didn't see their citizenship status though. Planned to show ISIS how easily they can cross through our Southern Border. What say critics of a wall or temporary ban of refugees now?","post_message":"They're here."},{"comment_id":"1051832858188283","commenter_b":"That's why we're in the place we are now,to no where.","commenter_a":"Sure makes some pretty good points","post_message":"This extremely popular \"Bernie\" meme has tens of thousands of likes and shares yet it reflects a SAD reality about young people today and the public education system in America. Watch as we expose the sad truth behind this meme. [READ]"},{"comment_id":"10155360412381509","commenter_b":"She's a nasty looking monkwy","commenter_a":"Michelle Obama is the most elegant, intelligent and intellectual First Lady's ever to grace the White House. This family will be missed!! God bless them!","post_message":"Over the past eight years, former President George W. Bush and First Lady Michelle Obama have been seen becoming increasingly chummy."}]
