[{"comment_id":"1027758113945859","commenter_b":"What a bunch of liberal pussies you all are.....keep smoking that pot and living in your mom's basement LOL","commenter_a":"I love you Bernie!","post_message":"In just a few days, voters across New York will make their choice for the presidential nomination on Tuesday, April 19. The entire country will be watching as the results come in. And with your help, New York will send a profound message to the political and economic establishment in this country. That's why we're asking you to commit to vote for Bernie."},{"comment_id":"10154622276758797","commenter_b":"😂😂😂😂😂","commenter_a":"Iveeno Wallace this time only ur teeth match.","post_message":"ABDUCTION ALERT: Look like anyone you know? #Chicago Police have released a sketch of a man suspected of trying to abduct a 14-year-old girl in the Roseland neighborhood. Important details, here: @webpagelink"},{"comment_id":"10154437348239087","commenter_b":"Crooked swamp dwellers. Lock them up!","commenter_a":"Let's run a government with a weakened opposition and lack of independent oversight. What could possibly go wrong?","post_message":"BREAKING: Republican lawmakers have decided not to strip the Office of Congressional Ethics of its independence following massive public backlash."},{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation. It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation. Read the whole story at Reverb Press HERE: @webpagelink"},{"comment_id":"10154906449059657","commenter_b":"@username, no pics of yourself on your fb? why? you one of those fugly women trump wont touch? or maybe 1 of the low enducated he loves so much for your vote? poor liberal feminist, no body wants you.","commenter_a":"Yes, we all know that. It came from Rubio....why does the media always think that people are complete idiots? We can read, you know. There are tons of legit sites to go to, besides mainstream propaganda sites....","post_message":"Contradicts what his boss is saying..."},{"comment_id":"10153935539180399","commenter_b":"They will just be in the restroom with transgender men! Grow up guys!!","commenter_a":"cruzs and trumps kinda guy @webpagelink","post_message":"Cruz said the bills make sense because \"men should not be going to the bathroom with little girls.\""},{"comment_id":"10156717481975354","commenter_b":"she is a pig","commenter_a":"SO VERY WRONG!!!","post_message":"Black Panther Tribute by Beyonce..."}]
