[{"comment_id":"10153153941377507","commenter_b":"fuck her","commenter_a":"Who is this boob! Facts are facts!","post_message":"The last thing we need is a news outlet telling seniors that their Social Security isn't their money. We need to expand it - not cut it. Sign the petition if you agree: @webpagelink (via Snarky Pundit)"},{"comment_id":"1011118955590810","commenter_b":"This woman has to go, she is crazy :(","commenter_a":"Yes, it's about the continued spread of the lefts fourth Reich! Whose ultimate leader, Satan, must be proud! Hillary, Bernie, Obama and his flunkies all cut from the same deprived mindset!","post_message":"PAY ATTENTION “This action is about a great deal more than just bathrooms,” Loretta Lynch declared."},{"comment_id":"10158409138265725","commenter_b":"Now we know why she's bitter and single","commenter_a":"I can't believe she told that woman that her husband was cheating on her!!!! For her to go home","post_message":"Re-watch the video that started it all: @webpagelink"},{"comment_id":"10153233109924170","commenter_b":"DEPORT ALL ILLEGALS !!!!!! Put Americans back to work !","commenter_a":"hes an idiot","post_message":"Chuck Schumer is doing his absolute best to play the blame game in regards to his terrible immigration bill. ...And it's all about paving the way for 2016 race-baiting."},{"comment_id":"1502468899813234","commenter_b":"You mean his other bitch. First bitch is Michelle. Lol","commenter_a":"If you listen you can here Louisiana's governor kissing Obama's ass cause he is afraid Obama will sic his bitch Killery on him and he will suddenly \"commit suicide\" or die in s plane crash,\\\\","post_message":"Oh, it's okay if OBAMA doesn't visit Louisiana when they're dealing with massive floods..."},{"comment_id":"494539450746362","commenter_b":"one ugly woman","commenter_a":"Cruz started this slanderous crap and it backfired on him. But he is still trying to blame Trump for a rags publication. But he's right about one thing, we don't give a shit so he can shut the hell up about it. Trump has already moved on.","post_message":"Carly Fiorina accused Donald Trump of being a serial philanderer. Do you think there's any truth to it?"},{"comment_id":"474511766072737","commenter_b":"Can't do that until you remove the Muslim president who encourages them to take over.","commenter_a":"we need to take our Country back. We outnumber them let stop the insanity. Dont let any mosks be built in this country. We cant build Churches in theirs. If they dont like it here than leave. No one would care.","post_message":"Muslims force this school to ban Christian holidays. America is under attack, this is treasonous. 'LIKE' if banning Easter is WRONG!"}]
