[{"comment_id":"1181726388516881","commenter_b":"Yep, infidelity has nothing to do with a woman's looks. It's opportunity.","commenter_a":"Been there done that ....it sickens me even the prettiest girls get cheated on which tells me that it is not about how good you look,how skinny you are, or even how rich you are you see how when they make their minds up and don't want to work at fixing anything well we need to stop giving second chances too.","post_message":"Check out what Keshia had to say about the lie that was their relationship. What do you think of her comments?"},{"comment_id":"856883727746819","commenter_b":"She's a lame person...disgusting!","commenter_a":"c'mon and drink the kool-aid already!","post_message":"\"They are not a basket of anything. They are Americans and they deserve your respect.\" Today, Mike Pence slammed Hillary Clinton's \"basket of deplorables\" remark, stating that \"no one with that low opinion of the American people should ever be elected president of the United States of America.” @webpagelink"},{"comment_id":"10155021097508812","commenter_b":"Blonde idiot.","commenter_a":"I felt like the Eagle being trapped in the drain was significantly similar to how our country was going down the drain after Trump was elected. And now the Eagle has died...another significant likeness to our country's future...","post_message":"Sad update: Bald eagle rescued after being trapped in a Florida storm drain has died, Audubon Center for Birds of Prey says. @webpagelink"},{"comment_id":"455432694647311","commenter_b":"Will not eat there. She would turn my stomach and I couldn't eat---ugh","commenter_a":"Well that does it McDonald's out","post_message":"Would You Refuse To Eat An 'Obama' Burger? Comment 'yes' or 'no'."},{"comment_id":"10153825778449877","commenter_b":"So what now only black women have abortions! GTFOH!","commenter_a":"No words. Just disgust","post_message":"College Newspaper Cartoon Depicts Black Woman Being 'Late' for Her 'Abortion.' Oh, and she was wearing a Black Lives Matter T-shirt. Read the full details below. Grio fam, what in the world is going on here?"},{"comment_id":"10156142090560594","commenter_b":"I know","commenter_a":"Go back to Brooooooooklyn. Where you belong.","post_message":"If we can't have San Francisco Giants postseason wins, this is the next best thing."},{"comment_id":"10154416316781833","commenter_b":"@username lmao there is no such thing as gun violence only violence. And back off gun control laws won't stop criminals or terrorists from getting guns. Your gun control laws only harm law abiding citizens and get people killed wake up. More states are banning gun control laws. I'm moving to Arizona. They have no gun control laws and have Constitutional carry. No permits no waiting periods no finger printing. Just a simple and quick background check and I'm free to get my gun. And I will buy loads of AR 15s and other types of guns. Gun control = death","commenter_a":"I don't see what the problem is with strict background checks and a ban on assault rifles. This guy was under investigation by the FBI twice for suspected terror affiliations. A background check would have certainly stopped him from obtaining such a weapon. Noone wants to take away anyone's guns, just keep them out of the hands of lunatics","post_message":"Americans were shocked and disgusted to learn of another act of terrorism on our soil. But calls for more gun control are a desperate attempt to create the false illusion that government - and politicians - can keep us safe at all times."}]
