[{"comment_id":"10153765705598132","commenter_b":"Don't care what her point is/was... No woman should do that. It's nasty and probably a health hazard as well. Koo koo.","commenter_a":"Should have been declared a Health Hazzard and disqualified. What a disqusting thing to subject others to. And can someone tell me how being a ragless woman is going to get sanitary napkins to 3rd world woman? I bet if they don't have tampons they don't have TV either... Stupid Stupid Stupid","post_message":"She thinks critics only prove her point."},{"comment_id":"10153915007936336","commenter_b":"TRUMP the first one to say BUILD THE WALL. TRUMP the first one to say DEPORT. TRUMP the first one to say BOMB the hell out of the ISIS Oil Fields. TRUMP the first one to DEMAND LEGAL IMMIGRATION. TRUMP was the ONLY one to say NO refugees from countries that hate America! #TRUMP2016! - the best & ONLY choice to secure America!","commenter_a":"Let me see? Agreements with murdering Cuban communists and Iranian murdering Islamic terrorists. Agreements with such allies only means that they remain our enemies!!!!?","post_message":"Breaking News: The U.S. and Cuba have reached an agreement to resume commercial airlines service."},{"comment_id":"10153483204295667","commenter_b":"Nardine","commenter_a":"Robert Taylor","post_message":"Do you see a ghost in this photo? Henry Yau took this photo at the Stanley Hotel, the real-life inspiration for Stephen King's 'The Shining.' Yau says no one was on the stairs."},{"comment_id":"10155335860455968","commenter_b":"So true!","commenter_a":"Yeah if someone could add a \"satire\" tag, that would be helpful, too. It is getting pretty hard to tell the difference between crazy real news and satire these days.","post_message":"About time."},{"comment_id":"10154618806016336","commenter_b":"WHY THE IRAN DEAL IS A MONEY LAUNDERING SCHEME CREATED BY THE CLINTONS AND CARRIED OUT BY OBAMA: Our economy is worth billions if not trillions of dollars, annually. The Clintons are incensed at Americans and think they are trolls or deplorable or predators or worthless. What the Clintons really desire is to add to their greedy pot of wealth built on the backs of slaves; modern day, contemporary slavery which includes a melting pot of all races. TRUTH: Hillary's economic plan seeks to further these greedy ambitions of gain and puts all of America and every American citizen at risk. By allowing an influx of immigrants including the 11 million (maybe astronomically more) to stay illegally, unconstitutionally, your wages will decrease or stagnate while your costs of living rise: You will be forced to compete with these new immigrants for housing, your prices on everyday purchases will rise, over ...","commenter_a":"Trump founded Racist Birtherism","post_message":"A senior ISIS leader was killed earlier this month in a precision strike near the Syrian city of Raqqa, a U.S. official told Fox News."},{"comment_id":"10153216569907550","commenter_b":"@username, lol you all claim its part of your heritage... First and foremost did you READ my post carefully? Because if you did you would know that I was referring to the past southerners who DID do all that. Your heritage is ALL THAT.... Your southern heritage is a hateful one and that's what you all are holding on too... You Keep saying that flag is our heritage. Name one good thing the south did for the slaves that wasn't hateful and name one good thing that flag represents. And FYI Lisa, you can't enlighten me because just like your counter part, you can't explain what your southern heritage is.","commenter_a":"It is not a symbol of hate, only in your dumb minds...its a symbol of our Heritage......maybe if you learned something in school you wouldnt worry about that flag........","post_message":"\"The time has come to remove this symbol of hate....\" Local religious and political leaders joined forces today to call for the South Carolina state general assembly to remove the Confederate battle flag still flying at the state capitol. More here ---> @webpagelink"},{"comment_id":"10154389558756336","commenter_b":"@username LOL! it's the world who runs to, scrambles to get to, imitates and leaves all behind to get to The US not the UK! We don't need to catch up with anywhere, no one's out in front of us!.....hence a hella immigration problem!","commenter_a":"Hey aren't guns illegal there? This must be a misunderstanding I'm sure, take your gun control and stick it up your a$$ Thought Europe(Germany) had very strict gun laws? Just goes to show you that the bad guys will ALWAYS find a way to get guns!!!!","post_message":"Breaking News: There are reports of a “threat situation,” involving \"some sort of weapon\" at a German movie theater in Viernheim, according to police. @webpagelink"}]
