[{"comment_id":"10155169202635231","commenter_b":"You're rare Theresa -- women don't think this way.","commenter_a":"Wow, he couldn't just get married to a good woman???? He could've gotten it for the rest of his life...but that's how crazy some men are. Go figure!!!","post_message":"Warren Sapp paid some $600 for oral sex, which he allegedly taped using his cellphone camera."},{"comment_id":"888129164543273","commenter_b":"Now before you say.... \"white women do the same things on their shows!!!\"","commenter_a":"Total waste of an article, this list would have certainly dropped down to less than 10 had the writer just said the entire basketball wives franchise, love and hip hop franchise and real housewives etc. instead of going by each show and each city. Dumb","post_message":"‘Sorority Sisters’ Isn’t Alone… 10 Reality Shows That Were A Bad Look For Black Women"},{"comment_id":"1343052442401891","commenter_b":"@username She also stated that she was going to get her 'presidential kneepads' Brenda. She knew exactly what she was doing! So, get over it already. Trump has cheated on both previous wives, and is now with the scary looking mrs strumpit.","commenter_a":"I love watching Bill do things like that. he's so good at it","post_message":"Because it's fun to watch them squirm."},{"comment_id":"484808285062410","commenter_b":"Illegals are actually working for money other than the \"Americans\" begging for money on a corner","commenter_a":"I bet he had a taster for it too. Give away our jobs, let illegals in, give them government money, they never earned, and let the American people suffer. What a great President.","post_message":"President Barack Obama drinks filtered water in Flint, Michigan during a briefing on the ongoing water crisis."},{"comment_id":"444684015719892","commenter_b":"killing over a pizza.. one less tax payer.. those black thugs aren't too worried about their welfare checks these days","commenter_a":"They need to be stabbed to see how it feels than shoot","post_message":"Where are the rioters?"},{"comment_id":"10153273305921051","commenter_b":"Sick ass Mother fucking Bastard, needs to be castrated and beat to death so he can feel the pain that poor baby felt, it just sickens me to hear of these evil people in the world.","commenter_a":"Convicts will likely shove reality up his ass!","post_message":"This guy did something awful to a 19-month-old girl. Now he's going to face the consequences."},{"comment_id":"634863706677709","commenter_b":"Yes absolutely. ...you are on our soil...you NOW live by our laws...if you don't like that LEAVE....","commenter_a":"Yes she has to obey the law's of this land, or be deported","post_message":"Muslim Refuse To Remove Head Covering For Officers – Gets Brutal Wakeup Call. Should of listen to authority. Do you think everyone should have to obey they law, regardless of religion?"}]
