[{"comment_id":"10154467987919342","commenter_b":"Ban cars. They kill more people than guns.","commenter_a":"Guns. Taking people's lives needlessly everyday because we let anyone and everyone have them. Not it's not a mental health issue. It's the acceptance of daily gun violence in our society. People will read this story and move on. Congrats NRA. Kill more Americans daily for our freedom to own guns. #GunsHaveMoreRightsThanPeople","post_message":"#Breaking: I 69 at Spur 527 is completely shutdown after a minor accident led to a deadly shooting."},{"comment_id":"10157462499315093","commenter_b":"Hillary Rotten Clinton is the most corrupt person to ever run for president...she is like Crabby Appleton,Rotten to the core....","commenter_a":"Hillary Rotten Clinton is the most evil and most corrupt politician in our country's history hands down.","post_message":"They gave money. She gave them meetings. It's a conflict of interest. It's corrupt. She's still lying about it."},{"comment_id":"10153524671301323","commenter_b":"If they are dangerous, then stay away!","commenter_a":"So is crossing the street. Let's kill all the drivers.","post_message":"“Everybody thinks we’re cold-hearted killers and it’s not that ... Giraffes are very dangerous animals. They could hurt you seriously, very quickly.”"},{"comment_id":"10153571133258132","commenter_b":"Shut up Tina","commenter_a":"Regardless of what this family would've, could've, should've said...90% of you made your judgement the second you heard \"the news\". Until it happens in our own family, none of us have the right to judge. Just as I don't have the right to judge all of you with your incredibly hateful comments. So I won't.","post_message":" watched him like all the time. I took him to work with me. We just poured our life into him.\""},{"comment_id":"879507305458832","commenter_b":"she wants everyones money , she is so poor !","commenter_a":"Or Vince Foster. Can't forget her law partner who magically killed himself with an antique firearm that didn't function....Interesting.","post_message":""},{"comment_id":"1179936415364556","commenter_b":"No but it might save a few Americans! Instead of worrying about illegals they need to be worried about their own selves!","commenter_a":"Hows those gated estates working for you and Georgie .","post_message":"Says the British-Lebanese human rights attorney..."},{"comment_id":"10153326829869170","commenter_b":"then let her and the mayor protect the city, see how good they do against the thugs.","commenter_a":"This whole deal is just so sad, on so many levels. Lots of fault to go around. Lots of blame to be shared.","post_message":"BREAKING NEWS: Baltimore's chief prosecutor says the death of Freddie Gray is a homicide. Six officers are being charged."}]
