[{"comment_id":"470896363098657","commenter_b":"That's called free speech in Obama America. Sad. I would love to see them meet their maker. Hell is going to be a busy place.","commenter_a":"They will do anything to RUB their ideas into our faces. If your part of this just keep it in your bedroom(house). Enough is enough.","post_message":"This is INSANE!"},{"comment_id":"10153228594071615","commenter_b":"Does it involve SPIDERsSsssssss????","commenter_a":"What doctor would even do this?","post_message":"Are you afraid of spiders? If so, there might be hope for you..."},{"comment_id":"10154154880759087","commenter_b":"And if Bill's affairs are on the table, so are Melania's published nude photos, including her lesbian poses.","commenter_a":"Stupid people can't even see that their party is in shambles because of this animal. PS- Bill isn't running for President, HRC is. If you're gonna judge spouses for their lack of control or influence in their marriages, then where's your criticism of Melania?","post_message":"\"They will elect Donald Trump and Mike Pence because they know that this is our last chance to keep our nation from plunging over the cliff into an abyss of debt, weakness, and servitude.\""},{"comment_id":"410802195930600","commenter_b":"Stupid.. Beyonce has enough awards, no way in hell I would have broken it to give half to Beyonce.. Adele is so much more talented..","commenter_a":"It was ADELE'S moment - and BTW, that narcissistic fur hag is NOT a queen - except maybe of BAD TASTE","post_message":"Adele may have broken her Grammy award in half for Beyonce."},{"comment_id":"1003938939663251","commenter_b":"we didnt send anyone, go kill yor bankers they fuck up your country, wait they already fucked up i guess","commenter_a":"Next wedding come over to Greece you son of bitches to feed all the illegal migrants that you send us!!!!!!!","post_message":"This is such a great story!"},{"comment_id":"10153889847128132","commenter_b":"Da devil is a lie she outta pocket no excuse non of that","commenter_a":"Well this explains a lot. If you have people like her working in child services, no wonder the children are left in abusive situations and no wonder society is grieving for them as they plant their innocent bodies in the earth--a sad day it is","post_message":"So horrifying."},{"comment_id":"10153468487630530","commenter_b":"To conservative for you liberal","commenter_a":"Big ol lame duck","post_message":"Is Governor Rick Snyder a lame duck in the making?"}]
