[{"comment_id":"10152940675830090","commenter_b":"Someone who will secure our borders and send aliens back. It would be cheaper to send them back than to support them. Why should anyone want to work. But, those with pride will work 2-3 jobs to make ends meet.","commenter_a":"Jeb Bush and VP Mit Romney.","post_message":"The White House has been BLUE for too long—In 2016 we're taking it back. Start by taking the GOP Presidential Straw Poll: @webpagelink"},{"comment_id":"1184449068295865","commenter_b":"A greedy witch !","commenter_a":"Clinton just wants votes she doesn't care about the American People","post_message":"“He used every word in the book. Can you imagine if I said that?” asked Donald J. Trump."},{"comment_id":"1369450476431551","commenter_b":"take your Muslim BS and shove it !","commenter_a":"The current jews inhabiting Israel now are not the descendants of Prophets Jacob/Israel. . The true descendants of Prophet Israel moved to Egypt and they inhabit Egypt currently.. do not forge the history","post_message":"WHO SAYS THERE IS NO GOOD NEWS IN THE WORLD?"},{"comment_id":"1726976590895675","commenter_b":"@username Drama queen.","commenter_a":". LETTERMAN'S TOP 10 REASONS TO VOTE DEMOCRAT 10. I vote Democrat because I love the fact that I can now marry whatever I want. I've decided to marry my German Shepherd. 9. I vote Democrat because I believe oil companies profits of 4% on a gallon of gas are obscene, but the government taxing the same gallon at 15% isn't. 8. I vote Democrat because I believe the government will do a better job of spending the money I earn than I would. 7. I vote Democrat because Freedom of Speech is fine as long as nobody is offended by it. 6. I vote Democrat because I'm way too irresponsible to own a gun, and I know that my local police are all I need to protect me from murderers and thieves. I am also thankful that we have a 911 service that gets police to your home in ...","post_message":"Good morning America! Big day ahead! Join me at 11amE - as I officially announce my Vice Presidential choice- Governor Mike Pence! Watch here: @webpagelink"},{"comment_id":"10153238674498984","commenter_b":"this bitch will have blood on her hands","commenter_a":"good now i have more reasons to cut myself and attempt suicide.... this really set me off ..","post_message":"What she said about \"fat white Americans\" and \"racist white conservatives\" is absolutely sickening... Are you outraged by these comments?"},{"comment_id":"10153423597850779","commenter_b":"Who is that chick on the left","commenter_a":"Sasha Banks, who is the by far the best wrestler male or female in the WWE, is Snoop's first cousin. I'm guessing a storyline should emerge.","post_message":"WWE has confirmed that Snoop Dogg will be inducted into the WWE Hall of Fame's celebrity wing, joining a list of alumni that includes Pete Rose, Mike Tyson, Arnold Schwarzenegger and Donald J. Trump."},{"comment_id":"1754805464735210","commenter_b":"You are a dumb whore","commenter_a":"I don't know if she's the MOST qualified (Al Gore), but she's way more qualified than the joke running on the Republican side.","post_message":"Obama: Hillary Clinton is the most qualified presidential candidate in history Just weeks after pledging his support for Hillary Clinton President Barack Obama has said the former Secretary of State is the best possible candidate ever for the White House. Do you agree?"}]
