[{"comment_id":"971032156302726","commenter_b":"The Liberals should be deported along with the rest of the illegals","commenter_a":"Monday morning i was at the Dmv here in NC,and while waiting for the examier was attending to other people,i was listening to the other people around me. Everyone of us was ask if they were register to vote or if not they can register you right there. Five people were asked and all refused to sign up ! I got on my soapbox to the amusment of the examiers and told them about our sacred right to vote, they said nothing !","post_message":"Liberals want illegals to vote so they can cancel out your well informed vote."},{"comment_id":"10153831984088132","commenter_b":"She's ok with adultery too","commenter_a":"A Christian who was married and divorced what? 3 times? Ok. She certainly doesn't have a problem with divorce but has a problem with gay marriage. The problem with so called \"Christians\" these days is there always seems to be a double standard. Sorry but you can't condemn someone who you deem a sinner when you sin yourself. Shame on her.","post_message":"\"Kim Davis should have never been locked-up for being a Christian,\" said Mike Huckabee."},{"comment_id":"902389386549543","commenter_b":"She is a fkn disgrace! #hilliaryforprison","commenter_a":"To all of you considering a third party vote or staying at home, facts show what that did in 2000. It gave us GEORGE BUSH. Remember Florida? Bush-2,912,790; Gore-2,912,253; Nader-97,488; Buchanan/Foster-17,484. Do the math. Please tell me, what good did that do? Are we way ahead of where we were 16 years ago? You know what Bush did. He appointed John Roberts and Clarence Thomas to the Supreme Court, gave us Iraq, Isisl and the Middle East, tax breaks for millionaires, FEMA during Katrina, the Great recession and the road to Trump. Read what \"Art of the Deal\" writer Tony Schwartz has to say about Trump and realize that it's better to have Hillary in charge while you use your outrage to build a party around progressives like Elizabeth Warren and Jeff Merkley. The unfortunate truth is, if you don't vote for Clinton/Kaine this year, we'll have Trump/Pence next year. ...","post_message":"\"Let’s go make history and elect Hillary Clinton the 45th president of the United States!\" —Tim Kaine"},{"comment_id":"10157214530105615","commenter_b":"Now if Rupert Murdoch could just croak and leave us all alone, particularly National Geographic...","commenter_a":"40 million to leave?","post_message":"BREAKING – Maybe now Americans can have their country back... Best thing to happen to America in years!"},{"comment_id":"813714802066935","commenter_b":"I'd like to see her asshole","commenter_a":"Joyce Watson @username superimpose someones cheeser. xv","post_message":"Subscribe to our mailing list and receive our awesome content for FREE - @webpagelink"},{"comment_id":"1195300027229716","commenter_b":"Nope, they would be saying who wants a whore for president. Very hypocritical.","commenter_a":"If Trump is so rich, why can't he afford better concealer? I mean damn, look at him in this picture.","post_message":"GREAT question!"},{"comment_id":"10150721680719999","commenter_b":"That's not true @username. There care is every bit as good as ours and not nearly as expensive.","commenter_a":"We need a single payer system. My daughter lives in France, and I'm always impressed with their healthcare. Stress free.","post_message":"Here is the surest way to enjoy the peace of mind that comes with having health insurance: Don’t get sick."}]
