[{"comment_id":"10154147730689071","commenter_b":"Lol you need help lady","commenter_a":"Good job trump. Keep up the good work. We need to be making more friends. Even if the liberals wanted to go to war with Russia led by Hillary. It's time for a new chapter in diplomacy.","post_message":"\"To be honest with you, the waters here seem like a little bit of a tempest in a teapot. I mean, it's striking to me that President Obama would reach out to a murdering dictator in Cuba and be hailed as a hero...\""},{"comment_id":"1104084689647932","commenter_b":"Proabably referring to the 2 black dudes answering the question. If they were rappers they would have bitches and Bentleys haha. These are just 2 really baked or really stupid men. That's it nothing more.","commenter_a":"This how stupid these rapper are today, but if you ask him how much for half of kush he would quote you to the penny. Wow","post_message":"Is That Your Final Answer?"},{"comment_id":"985293351528112","commenter_b":"Well the high taxes on import/exported goods and labor, access fees to our harbors and Panama Canal or fees to get visas will sure help to pay for wall. LOL!","commenter_a":"Your country will PAY for the wall knucklehead, we hold the ACE CARD, your economy is DEPENDENT on USA! USA is a self contained nation. This is something a LOT of Americans have forgotten, this country is SELF CONTAINED, we don't need to import, we have RAW MATERIALS for EVERYTHING you can think of! I can't wait for factories growing all over USA like grass when Trump occupy the Oval Office.","post_message":"We're 'Not Going To Pay For That F*cking Wall'"},{"comment_id":"784349154999752","commenter_b":"Bitch","commenter_a":"Another racist liberal what does she have against Orange people. Ray","post_message":"Oh, Meryl...."},{"comment_id":"10154611817649087","commenter_b":"Diana , sthu . Don't call me names . We went through 8 years of that black racist pos muslim traitor obama . Now we get a real American President that wants to help America and people like you don't even give him a chance . So crawl back under your rock and take obama with ya .","commenter_a":"So many liberals . I mean clueless liberals . With obama and hillary we would have been a 3rd world muslim country in no time . STHU and give Trump a chance . He's done more for America in weeks that obama did in 8 years .","post_message":"\"It's apparent that President Trump is clueless when it comes to nuclear weapons.\""},{"comment_id":"692830987553004","commenter_b":"Fr we were running thangzz up in that bitch","commenter_a":"@username i don't miss Carrows but I miss working with you. 😿😻","post_message":"Too lit! #WSHH"},{"comment_id":"468340716665733","commenter_b":"I suppose those of you refusing to vote for him because of vaccinations would rather live in a socialist regime under Hillary.","commenter_a":"Yes!!!","post_message":"Will you stand with me. Together we can take our country back! @webpagelink"}]
