[{"comment_id":"10156259154010354","commenter_b":"Well, she won't have to worry so much about those tax breaks she was looking for in America. Now she has not reason to stay here.","commenter_a":"You hate America and Republicans, well, that's fine, we won't bother to see your movies.","post_message":"The America hater's new movie is hemorrhaging cash..."},{"comment_id":"1240086616006505","commenter_b":"Animals r strange voters... They will vote with the Jews.","commenter_a":"Who? Never heard of him.","post_message":"And then he said where he promises to MOVE if Trump DOES win..."},{"comment_id":"950451268383973","commenter_b":"I look forward to never looking at this Obummer again!","commenter_a":"Why is it everybody is out to get Trump? It seems to me they are so scared he may get President they have stooped to the lowest ways to destroy him....it just wants me to vote for him more because they are scared he will and the fact is it will ruin the political garbage at the white house who are trying to bring our country down.....I want our Country back and the Constitution back to what it was meant to be!!!!!","post_message":"“Good luck with that…We’ve got serious problems here.” President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."},{"comment_id":"10156467558905725","commenter_b":"I knew it too good to be true!","commenter_a":"Hard to believe this thing he say????","post_message":"If you’ve been on Facebook in the last few days, you might have noticed a number of friends posting a status thanking Zuckerberg for giving away a portion of his $45 billion to lucky Facebook users ----> @webpagelink"},{"comment_id":"10153269356147452","commenter_b":"@username the Marine Corps taught me nothing. You must be a weapons expert","commenter_a":"So you can hear two people yelling but not a gunshot?","post_message":"BREAKING NEWS: A homicide investigation is underway after one person was found dead following a report of two men yelling in an Alhambra neighborhood, police said. One person is being questioned, and there is no active search for other suspects."},{"comment_id":"685743394925463","commenter_b":"Someone just lock her up! Please!","commenter_a":"Hillary needs life","post_message":"The double standard..."},{"comment_id":"1635226930076425","commenter_b":"Take those women.","commenter_a":"I hope they do leave...","post_message":"We might have to pay another country to take them..."}]
