[{"comment_id":"10154838337948797","commenter_b":"Mask? How did a hijab become a mask?","commenter_a":"Religious garment is to be used at church. As she lives in America she must take off the mask, is better for her to wear a miniskirt on this hot weather","post_message":"SOUND OFF: A woman wearing a hijab was asked to leave a Family Dollar store because of her Muslim face veil. When she protested that it was a religious garment, the manager explained that it is a high-crime area and the store gets \"robbed a lot. Was the store manager right in kicking her out? How would you have handled the situation? The best responses will go on air!"},{"comment_id":"678327045675400","commenter_b":"Now if those same 27% would move to another country!!","commenter_a":"Oh, the Republikkkans. Your big daddy is a rapist yo! How he got here is a complete joke! GTFOH","post_message":"Polls show 27 percent of Trump voters won't accept the result if he loses."},{"comment_id":"10155627747429778","commenter_b":"Suck it up snowflakes","commenter_a":"So great!","post_message":"#BREAKING Donald Trump surpasses 270 votes in Electoral College to officially win Presidency"},{"comment_id":"1779395119015202","commenter_b":"So women have been successfully doing this for how long? Most cases of extreme pain can be resolved medically and if not that's why we accrue roughly 8 hours of sick time per month at standard full time jobs One cannot expect businesses to experience this loss of productivity and still want to retain female workers","commenter_a":"Emily Lynn Bowman","post_message":"(Note: Look at the women in the back left of this photo.)"},{"comment_id":"10152914682658598","commenter_b":"So do women.","commenter_a":"Weak! Some guys need to man up and become responsible","post_message":"Man Kills His Own Unborn Child After He Secretly Puts Abortion Pill in Girlfriend’s Drink"},{"comment_id":"10153181956571162","commenter_b":"I guess it depends on how you speak to your mother.","commenter_a":"I thought it was great. Normal mom and daughter banter. They are human after all.","post_message":"50 SHADES OF AWKWARD! Dakota Johnson and Melanie Griffith on-camera spat on Oscars red carpet: @webpagelink"},{"comment_id":"531497917040788","commenter_b":"What a Dixie chick.....","commenter_a":"Dope head","post_message":"Tim Mcgraw fans shocked after he bowed down to Obama in this sickening way. Sorry Tim, you lost our business forever. Will continue to support Tim Mcgraw after he did this?"}]
