[{"comment_id":"901769206549495","commenter_b":"Perhaps in fantasyland he's becoming a woman, but not down here where I spend my time - ON EARTH.","commenter_a":"Sorry Bruce, you're NOT becoming a woman - that's impossible. Your just taking hormones, and chopping your John-Thomas off.","post_message":"'Hey, guys, I'm becoming a woman' (Via Daily Mail Celebrity)"},{"comment_id":"1181554231878327","commenter_b":"The Federal government now going to decide about bathroom attendance? Gimme a break and Kill some ISIS and seal the dam borders! North Carolina laws are for North Carolinians! Don't like it than stay out!","commenter_a":"The most ridiculous law ever! Where the F_ _ K to you folks think these HUMAN BEINGS were going to the bathroom before?? Surprise....right next to you and you never knew it! Poor NC....losing all that money and those jobs because of an arrogant Governor who is hardly worth the job that the PEOPLE voted him into!! #LOVEALWAYSWINS","post_message":"It's the federal government being a bully. This unrealistic deadline by the federal government to the ninth largest state is quite amazing.\""},{"comment_id":"10154406577771051","commenter_b":"Ray >Melania isn't even from the US can't speak English an is a HOE!!!!!","commenter_a":"There is nothing wrong with her dress.","post_message":"This photo of Melania Trump sparked serious backlash after people noticed one thing about her dress."},{"comment_id":"10154385658569197","commenter_b":"@username good one","commenter_a":"They should cancel all outdoor activities in sports .. Those poor kids too hot for them","post_message":"It's 9am and the heat index is already at nearly 100! What are you doing to stay cool today?"},{"comment_id":"10152784784428145","commenter_b":"Huh!! Woman abuser and she's a dummy for staying with him! Jerk!","commenter_a":"I guess his girlfriend is a little thug to uhh. Wow!! It should be clear now who really was the trouble maker.","post_message":"UPDATE: Zimmerman has posted bond and is out of jail. @webpagelink #wftv A judge set George Zimmerman's bond at $5,000 and ordered him to surrender any firearms. His attorney, Don West, said Zimmerman is accused of throwing a wine bottle at his girlfriend earlier this week. #wftv Reporter Blaine Tolison is live with the latest on #WFTVatNOON"},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""},{"comment_id":"692747934208970","commenter_b":"If illegal aliens must be allowed into our colleges, they should be charged twice the tuition as out-of-state students, with no eligibility for any financial aid, and any courses that legal aliens are taking in order to obtain citizenship be mandatory.","commenter_a":"He'll no!","post_message":"Do you think illegal aliens have a right to attend taxpayer funded public universities?"}]
