[{"comment_id":"10153135601604575","commenter_b":"If they come here legally and are not criminals then they should be allowed to become citizens but if they just plan on breaking laws and feeding off everyone's tax dollars then no they should be shipped out regardless of where they come from.","commenter_a":"Well that sucks. Aside from the idiotic general opinion of the public, I've met more illegals that really want to be here to work and provide a better life for their families. Unlike many of the current inhabitants of this country that just can't wait for the first of the month for that government check. And let's be honest, we're a country of immigrants. Seems a bit hypocritical. And on the plus side at least immigrants want their children vaccinated.","post_message":"Thousands of immigrants seeking legalization through the U.S. court system have had their hearings canceled and are being told by the government that it may be 2019 or later before their futures are resolved. The increase in cancellations began late last summer after the Justice Department prioritized the tens of thousands of Central American families and unaccompanied children crossing the U.S.-Mexico border."},{"comment_id":"10153211590889255","commenter_b":"How on earth did that guy get elected in a logical state like Maine? Maybe he had some help.....","commenter_a":"JUst more proof that Le Page is a nutcase and a liar. So glad he isn't from NH . We have enough nutjobs of our own who scare the bejesus out of 4th gfaders!","post_message":"I think I just became an even bigger Stephen King fan."},{"comment_id":"1065696356784708","commenter_b":"and it is not round","commenter_a":"So the planet isn't flat.","post_message":"Find out what the world really looks like."},{"comment_id":"1103808136307925","commenter_b":"Don't explain...just tell her to go, now!","commenter_a":"Why don't these people go now ??? It is no big loss !!!!","post_message":"Someone really, really, really needs to explain to her how this whole process works."},{"comment_id":"1727548687496080","commenter_b":"HILLARY CLINTON IS AN ARROGANT NARCISSISTIC SOCIOPATHIC LIAR AND VERY EVIL WOMAN !!","commenter_a":"Time will tell","post_message":"We'll see what ends up happening..."},{"comment_id":"10154285889541350","commenter_b":"Congrats Dylan and Savannah must be something in the water up there. Have a great day to all of you guys. From Georgia","commenter_a":"Good morning","post_message":"Join our weekend TODAY anchors for their first Facebook Live Q&A! Comment below with any questions you have for a chance to have them answered live!!"},{"comment_id":"10154306922931943","commenter_b":"Can I demand answers to what laws ye dupes say she broke?","commenter_a":"Criminal","post_message":"Hillary Clinton must be held responsible for using \"private\" email accounts and a hidden email server as Secretary of State to conduct government business in violation of the law! Judicial Watch is the one organization with a proven 20-year track record of investigating, exposing, and prosecuting Hillary Rodham Clinton and company. Please SHARE!"}]
