[{"comment_id":"1315765065158489","commenter_b":"I think.. Mexico already knows where the border is...start shooting.... enough said!","commenter_a":"Mr. Trump - take down that wall !!!","post_message":"Pres. Donald J. Trump wants to pay for his proposed wall by slapping a 20 percent tax on imports from Mexico. Do you think the tax is a good idea?"},{"comment_id":"1287108874642473","commenter_b":"OF COURSE OBAMA`S AND HILLARY PAY CHECK FROM SAUDI ARAB IS GETTING BIGGER BY SECOND , IMAGINE WHEN THIS HYENA BRING MORE OBAMA`S ANGEL REFUGEES... HOW BIG HER CHECK WILL BE..? HYENA CLINTON WILL NEVER SUFFER MUSLIN VIOLENCE , SURROUNDED BY HEAVY ARM BODYGUARDS , OK...WHAT ABOUT YOUR FAMILY..? IF OBAMA`S GANGSTERS TAKE OUR GUNS ...HOW WE ARE GOING TO PROTECT OURS FAMILIES...? WORKING HARDER IN ORDER TO FEED OBAMA`S ISLAM ORPHANS & WIDOWS ANGELS OR BLACKANIMALMATTER OR ILLEGALS ,...DEMOCRATS SLAVERING THE PLANET FOR ISLAM ...NOT SEE IT YET ...SERIOUSLY ..? CHECK HOW MANY PEOPLE ARE ON WELFARE OR FOOD STAMPS ..","commenter_a":"Who is the mayor?","post_message":"\"If you go 15 miles from downtown you will find communities that don't have water or sewer yet.\""},{"comment_id":"818563178203701","commenter_b":"For what? Please elaborate...","commenter_a":"Impeachment now","post_message":"Before we voted to defund President Obama's unconstitutional actions on immigration, Speaker Boehner read 22 direct quotes where President Obama argued, in his own words, that he couldn't act alone on immigration. Here are the quotes: March 31, 2008: “I take the Constitution very seriously. The biggest problems that we’re facing right now have to do with [the president] trying to … not go through Congress at all. And that’s what I intend to reverse when I’m President...” May 19, 2008: “I believe in the Constitution and I will obey the Constitution of the United States.” May 5, 2010: “Anybody who tells you … that I can wave a magic wand and make it happen hasn't been paying attention to how this town works.” July 1, 2010: “[T]here are those … who have argued passionately that we should … at least ignore the laws on the books... I believe such ..."},{"comment_id":"404025676388694","commenter_b":"Hes a piece of shit its not there country and the middle class has suffered enough from its temp wages and illegal pay for us we cant get all the benefits illegals do we do not qualify lol he just wants votes for liberal Democrats","commenter_a":"At this point ,what difference does it make","post_message":"Is President Obama breaking the law with Immigration Reform measures?"},{"comment_id":"10158574220485206","commenter_b":"Ur a racist #sitthefuckdow","commenter_a":"We cannot wait for a Trump presidency. #WeThePeople must rise now & take back America which has been stolen from us!!! Trump touched me a year ago. He reached inside me and touched my heart and built a patriotic fire that flows deep through my veins and has given me hope that we can save America from the elitist New World Order Puppet Masters who would end our freedoms forever God bless Donald Trump!","post_message":"It would be a rare revolt."},{"comment_id":"1033609543378017","commenter_b":"Arrested???? WE OWN THIS BUILDING!!!!, and ALL THE GOVEMRNNENT BUILDINGS. BOUGHT, BUILT AND MAINTAINED WITH OUR TAX $$$$$$$$","commenter_a":"Yes!!! #DemocracySpring is currently trending on Facebook!!!","post_message":"The Young Turks live from the Democracy Spring: Sit In. Save Democracy. protest in Washington, District of Columbia - The police are arresting people now."},{"comment_id":"10153092045117756","commenter_b":"there is no place around here seems like most females prefer dating sites i think","commenter_a":"screw dating sites they dont work","post_message":""}]
