[{"comment_id":"417605495104769","commenter_b":"Ummm hmmm. Now ask YOUR grand parents and the rest of YOUR family. Bitch PLEASE lol","commenter_a":"FUCK ALL Y'ALL WHITE AND FAT UGLY MATHERFUCKER! OBAMA OBAMA OBAMA OBAMA OBAMA OBAMA","post_message":"Malia Obama Just Challenged Tiffany Trump, Learns Quick Lesson The Hard Way. You don't mess with the Trump family. Can we get 30,000 'LIKES' for Tiffany Trump?"},{"comment_id":"608045926060248","commenter_b":"Try saying dick her dick her. Another girl commented saying it coulda sounded like that. Lol","commenter_a":"I have alexa... She doesnt curse. She bleeps(literally) out inappropriate words in her speech automatically. Idk about this. I'm gonna try it.","post_message":"An innocent request turned awkward real fast! #WSHH"},{"comment_id":"1066896063328404","commenter_b":"Get these suckers!","commenter_a":"Billie. Do you need to suck each and every bit of lefty nonsense and regurgitate it?","post_message":"Four House Democrats are calling for an investigation into the Center for Medical Progress (CMP) as the group’s deceptively edited video attacking Planned Parenthood continues to fall apart under public scrutiny."},{"comment_id":"1238572129494342","commenter_b":"You're a typical liberal Asshole ! Try those new laws in Court on those Illegals & Drug dealers & criminals no gun permits !","commenter_a":"can't wait for the State of Jefferson to separate from California and away from Brown and his non concern for America, this guy sucks ass was a loser before but voted in again by losers from other states that just moved to California for welfare and hand outs","post_message":"Gov. Jerry Brown dropped ink Friday on about half of the dozen gun control bills recently placed on his desk, including one requiring background checks for ammunition purchases and another that bans the sale of semiautomatic rifles that use a bullet button to easily detach a magazine."},{"comment_id":"1257959987602294","commenter_b":"You are completely ignoring many of the issues such as the inequality in wages between men and women, the dearth of equality in positions of power such as government and business, and, many other issues which have been a problem for many years. Most murders of women are by men as are rapes. Women are often expected to wear short skirts and behave in what men deem a \"feminine\" way on TV and in many businesses. An excellent example is Fox news.","commenter_a":"I think this poem/speech misses a huge issue and ignores the obvious. Humans as a whole are failing. This isn't just a man's issue. I see, daily, women tearing other women down. Calling them the same things you hear. It is a problem from all sides. We have failed to raise children with respect, love, and caring. That is the issue. To suggest it is only males is dishonest. We should accept it is a societal issue and not a male/female issue.","post_message":"She’s a “dangerous\" woman because she dares to speak her mind in an online community that openly harasses, disparages, and threatens women. Warning: contains strong language. (via Agnes Török Poetry)"},{"comment_id":"1231862310212247","commenter_b":"We better get building that wall","commenter_a":"This will be interesting. Will President Trump undo what Obama did to lift sanctions and travel restrictions to Cuba?","post_message":"Live Look: Celebrations in Miami over the death of Fidel Castro, and images from Cuba."},{"comment_id":"396121180569763","commenter_b":"Yes she definitely deserves to lose her license bigoted bitch","commenter_a":"Not only doctor in the world......find a new one...wouldn't want that dr touching my kid.","post_message":"Does the Hippocratic Oath allow for doctors to make this kind of choice?"}]
