[{"comment_id":"10154021624482464","commenter_b":"Adultery is one of the ten commandments thou shalt not commit adultery","commenter_a":"I vote biblically, for someone who stands for righteousness and one who cares about the things of God and not his own ambitions. A true servant of God's and the people of this nation. My vote and prayers go to @username. Proverbs 29:2 says when the righteous rule, the people rejoice. God is giving the body of Christ another chance to get this right in 2016! Cruzin all the way to the White House! My president is @username!!","post_message":"\"The only person running for president to publicly admit to have been bitten by an octopus.\""},{"comment_id":"840567656083161","commenter_b":"Karla Huitron cause yo ass can eat","commenter_a":"Marry her ass quick!!!","post_message":"What u doing? #WSHH"},{"comment_id":"10158012155960354","commenter_b":"Prosecute her! Drain the swamp!","commenter_a":"lock donna brazil up.........","post_message":"“Stealing valuable proprietary confidential information is illegal, and debate questions are highly confidential,” said Ken Sukhia, who served as United States Attorney for North Florida and who has prosecuted numerous white collar crimes."},{"comment_id":"1364548750229953","commenter_b":"Anything above .22 caliber is illegal expect where permitted by law, and by law I mean hunting clubs that bend the rules. Open carrying is restricted to law officials only. But yeah that sure stopped the cartels from getting their hands on em","commenter_a":"What about bad/psychotic people with gun permits and guns purchased legally? The system is a joke... How can you really determine good/bad ppl...","post_message":"The Dallas police chief says he is concerned about open carry laws. \"We don't know who the good guy is versus who the bad guy is if everybody starts shooting,\" he said."},{"comment_id":"1333344573352236","commenter_b":"Omg! She LIED!!!!!!! IT HAS BEEN PROVEN. IT IS OVER","commenter_a":"While calling Breitbart a \"journalism\" might be pushing it, Breitbart should have thrown it's full weight behind Fields, and waged an all-out campaign against the Trump campaign until receiving a proper apology. The fact that they seemed to have abandoned her in light of evidence is despicable, and Breitbart needs to be held accountable.","post_message":"\"This is disgusting,\" former Breitbart editor Ben Shapiro said. \"No news outlet would stand for it.\""},{"comment_id":"573047149521906","commenter_b":"God bless White people","commenter_a":"Wow if any of us \"peasants\" had our name attached to an on-going FBI investigation we wouldn't be able to get a job at Seven-eleven. Must be nice being that rich and connected","post_message":"\"This is an active and ongoing investigation.\""},{"comment_id":"1704753069786736","commenter_b":"THEY SHOULD BE TAKEN TO GITMO NEVER TO GET OUT!","commenter_a":"Need to be hung by the balls","post_message":"If you were in charge, would you have these deported back to where they came from? @webpagelink"}]
