[{"comment_id":"774141519351123","commenter_b":"I hate when people treat service workers less than human just because they are having a bad day. I have been there as a server. Some people are evil!","commenter_a":"Entitlement, is why ppl act the way they do. But as a Manager sometimes you have to take what the customers throw at you, they are not always right but you make them Think they are! Its all in a days work, manager or not, right or wrong, you look like an ass when you throw a fit like this.","post_message":"Wow."},{"comment_id":"10155206212838984","commenter_b":"It could also be that the libertards Have No Taste! They don't know a Good Thing When They See It!","commenter_a":"For the life of me , I cannot understand the obsession all these small minded liberals have with the Trump family. Is it jealously ?? You can't possibly spend that much time dwelling on people you don't even know. Lots of people weren't happy with the Obama presidency or his crude wife, but they didn't spend every waking moment stalking them, writing fake news about them. At this point I have serious concerns that there is a mental health epidemic in this country as far too many people are consumed with hatred that has no true origin. Hopefully the pharmaceutical companies can keep up with the demand for medications that clearly need to be prescribed.","post_message":"Maybe now this reporter will think twice before attacking the first lady."},{"comment_id":"10154236838279228","commenter_b":"Very interesting.","commenter_a":"EricBlakeburn Olivia Kesselring","post_message":"A UFO incident near St. Louis captured worldwide attention 15 years ago. Many of the witnesses were police officers."},{"comment_id":"1067844663241313","commenter_b":"Texas i never would have u of all states would let muslims take over u capital and Texas read there korah they hate sll non muslims u have been fooled ,they use our laws againest us to get into our goverment , the woman had a right to speak she is a American citizens talking about God and Jesus his son , and u made her leave i bet her family fit 4 our freedom can u say the same about ur muslims that were there ,muslims use people like u all falling 4 there garabage ,i bet they are not even citizens , Texas ur idiots make no mistake the muslims will try to take texas over ,then where are ur Texas Rangers ,","commenter_a":"I see everyone praising this woman, and it's cool I respect her opinion and her right to her actions. But why use the name of Jesus for all the hatred rants. Like when the illegal kids on the bus came to the U.S. and got screamed at and booed by \"Christians\" I wonder if Jesus came down here would be ranting with his Christians or would he be loving everyone?? I think you should do your hatred rants in your name. Not the Lords name.","post_message":""},{"comment_id":"10153060645251350","commenter_b":"And you'd win a beauty contest for sure ...","commenter_a":"She's so ugly. She has a mouth the size of a horses mouth","post_message":"What do you think: Is this a subtle pregnancy announcement or just a cute silly photo from Beyonce?"},{"comment_id":"10153136284189607","commenter_b":"She should resign","commenter_a":"Good! now don't run for anything else","post_message":"#BREAKING: Baltimore Mayor Stephanie Rawlings-Blake will not seek re-election, a spokesperson confirmed. Her 10AM press conference will air on FOX45 and will stream online here: @webpagelink"},{"comment_id":"10154479449143271","commenter_b":"Happens to every girl.","commenter_a":"LoL OMG! When I was 14 I lived off of 14th and Pierce by Casa Bonita....and had to catch the bus on Colfax for school. If I would have reported every dude who cat called, they would have needed a daily report for me alone on the news. I'm really not trying to down play the fact that this guy could have been a weirdo but this seems a little extreme.","post_message":"Keep an eye out, Colorado. This man reportedly tried to follow the girls home after they ran away from him."}]
