[{"comment_id":"10152902421671378","commenter_b":"She needs to set her asss down ! Cthu","commenter_a":"Ratchet asss fools ! The Baltimore Mayor is INCOMPETENT ! Her dumb az decides to enforce a curfew 24 hours AFTER the riot starts... #blankstare Why hasn't she called The National Guard ???","post_message":"#BREAKING Action News reporter Kenneth Moton is in Baltimore and this is some of what he is seeing this morning."},{"comment_id":"10155114674037558","commenter_b":"One sick BITCH!","commenter_a":"Let me make this clear! We paid taxes to support our children completely in our schools. We did not pay taxes to make you richer, honey... Getting a fat paycheck to make inappropriate jokes about hungry children is not funny to the best of humanity - Just to you! Ms. Rich Monster - (Your Word)","post_message":"You put these Republicans all in one room and they say some evil things."},{"comment_id":"10153290853866636","commenter_b":"Did she prove he showed her that fake passport? How else could she get cleared?","commenter_a":"Give that woman my phone number","post_message":"Amanda Lockhart is 46"},{"comment_id":"10154739927446037","commenter_b":"Sorry, women ARE voting...lol","commenter_a":"Most pictures are worth a measly thousand words. This one's worth millions. I would never advocate voting for a woman just because she's a woman, but this suggests that might not be a bad idea.","post_message":""},{"comment_id":"10155087301336509","commenter_b":"@username once stench like you and others weeded from this country, then decency and class will return. Its your choice to be losers. Stop blaming others for your failures in life..CLASSLESS!!!!!","commenter_a":"Michelle Obama is the strongest and the women with the most elegance I've ever heard of. Hopes she stays in politics and still get involved after she leaves the White House!","post_message":"\"Don't let anyone tell you that this country isn't great. This right now is the greatest country on earth,\" Michelle Obama said."},{"comment_id":"898930746862951","commenter_b":"You sure use a lot of words to say \" I don't have a clue \". Don't you ?","commenter_a":"Take it to the Supreme Court. We only make them pass a background check to buy a gun. That's it. Gun purchasers have no other culpability. Why not a background check for ammo? If gun and ammo purchasers were held responsible for keeping their weapons out of the wrong hands, we wouldn't have as as many shootings. Right now, they pass the background check and then can hand the gun over to whoever they want. A simple law making a background check necessary to buy and use a specific gun would prevent this. Make the legal purchaser responsible to ensure that anyone using the gun has passed their check. Every shooting, trace the gun to the legal purchaser and throw them in jail, if the shooting wasn't the owner protecting themselves. We have technology that can recover removed serial numbers. Gun owners wouldn't let their guns out of their sight. ...","post_message":"Thanks, NRA!"},{"comment_id":"10152747219056051","commenter_b":"This is soooooo wrong and why can't these cases be corrected immediately when the proof comes out. The women who do this should be prosecuted and pay for All damages!","commenter_a":"Back in 1990 I had to pay 400 a week child support for 3 kids the courts let me have custody of my oldest boy gave the ex-wife custody of the three youngest the day that we walked out of the courtroom the ex wife let me have the other three children two years later the welfare department came to me and told me that I have to pay back the last two years of u living expenses that they was giving her she forgot to tell them that she was getting 400 a week the last 2 years took me 2 years in the court system to fight it the system does not like to put women in jail so I know what you are going through","post_message":"This man had an arrest warrant issued for him and got threatened with jail time over unpaid child support. There's just one problem."}]
