[{"comment_id":"985335071559547","commenter_b":"Scumbag!","commenter_a":"First of all what was the point in having all of this kids man! Now a days 3 or 4 is a lot of kids man. 19 kids is like your freaking crazy! I only watch half of a episode and I change the channel mighty quick. The ones that are going to suffer are their kids.","post_message":"This \"family values\" hypocrite hoped you'd never see these."},{"comment_id":"10154160102065047","commenter_b":"GET US OUT OF THE UNITED NATIONS; THEY ARE NOT STANDING UP FOR 'BASIC HUMAN RIGHTS' FOR THESE WOMEN AND CHILDREN UNDER ISLAMIC RULE. WHY? THEY ARE RUN BY ISLAM NOW. GET THE UN OUT OF THE USA.","commenter_a":"Why do so many Americans support and justify this abomination???? The number of Islamic apologists is nauseating!","post_message":"Little girls in northern Kenya are being brutally tortured and enslaved. They're forced to marry men as old as their father or grandfather. Sign our urgent petition to demand an end to this evil practice."},{"comment_id":"10153678565299062","commenter_b":"*** Important","commenter_a":"Support tradition marriage","post_message":"SHOWDOWN: Officials and lawmakers continue to clash over same-sex marriage debate in Austin."},{"comment_id":"1720672154848520","commenter_b":"@username yes I'm voting for Hillary","commenter_a":"Vote for Hillary and you're voting for corruption. Vote for Trump and you're voting to make America great again!","post_message":"'Get of the fence' and VOTE TRUMP; ' at least he's like us!' - Robert Jeffress (pastor)"},{"comment_id":"563081667216516","commenter_b":"Where the white woman at !!","commenter_a":"Markus please don't allow this on my pic I have very young children One is my 6 month old grandson. And 4 other grand kids. Please help Me out lets work to gather to stay Younger. Love auntie Diana","post_message":""},{"comment_id":"812245008908679","commenter_b":"You are one sick bitch.","commenter_a":"More whit and wisdom from Donald Dump the worst! Just like the KGB. People might begin to vanish if he doesn't like them.","post_message":"I would like you know what Trump supporters think about this. I find it very unsettling."},{"comment_id":"10154028228372060","commenter_b":"B*LL S**T.","commenter_a":"Assuming this is true, this is unacceptable. What a horrible thing to say to someone.","post_message":"A Muslim teacher in a Georgia high school said someone left her an anonymous note in her classroom, telling her that her \"headscarf isn't allowed anymore.\" The note also told her to \"tie\" her headscarf around her neck and \"hang yourself with it.\""}]
