[{"comment_id":"1648471502112051","commenter_b":"It never bothered Hillary, at least he recognizes it and is willing to seek advice.","commenter_a":"He's getting bald.","post_message":"This is not normal. This is not normal. This is not normal."},{"comment_id":"806491062782835","commenter_b":"Its funny the democratic party started the Confederate nation and fought to keep slavery. Robert byrd retired in 2010 a Democrat longest serving politician in history and was active member of the klan. Imagine all yhr bills he voted on due to his racist views. Alot of the Democrats knew he was a klan member and said nothing. Pull some ones opinions off line and use them to your benefits but truth is your being lied to but 99% of politicians and the first to speak up you all attack.lol just like o malley saying all lives matter and Democrats attacked him for that. Yet alone he is democrat himself. Get it through your heads we are done with the hypocrits and lies and political correctness","commenter_a":"Can someone please explain to me who they are polling to get Trump in the lead?","post_message":"And yes, it's really his number."},{"comment_id":"10152577391880047","commenter_b":"it is only the beginning of America rising up against it's enemies...all of them...","commenter_a":"This needs to be permanent!","post_message":"BREAKING: Federal court temporarily halts President Obama's illegal Executive action on immigration. Read and Share how the court agreed with our legal arguments in holding this imperial presidency accountable: @webpagelink"},{"comment_id":"893880777331086","commenter_b":"\"I kill ithith and bite their ears off\"","commenter_a":"I hope when he talks he doesn't sound like Mike Tyson or something. That would be a let down. LOL","post_message":"Yeah. That dude is pretty intimidating. ANGEL OF DEATH: Axe Wielding Militia Commander is Striking Fear Into ISIS Fighters"},{"comment_id":"1120933471338794","commenter_b":"Lol","commenter_a":"These uneducated hillbillies dont care because they cant afford to buy a trailer anyway...","post_message":"Millions upon millions of his poorest voters just got terrible news."},{"comment_id":"10152647068355927","commenter_b":"She can be rich,but doesn't want the rest of us to be","commenter_a":"What's wrong with being rich? We pretty much all strive to be rich but the government does its utmost to prevent you. Good grief Hil.","post_message":"Great question..."},{"comment_id":"10153215250940329","commenter_b":"You clearly don't live in the country.","commenter_a":"\" Why are your large pizzas the size of our personal pizzas?\" because we aren't a country full of fat fucks.","post_message":"Dear BuzzFeed Oz."}]
