[{"comment_id":"10153432042256051","commenter_b":"Those poor people deserve a better life I heard they throw their children in the garbage because they're girls","commenter_a":"Taking misogynists whose lives revolve around subjugation of women is a bad idea. Honor killings and selling daughters are both illegal in America. Thank God.","post_message":"Here's why President Obama says accepting Syrian refugees is the ultimate American thing to do. Do you agree with his message?"},{"comment_id":"10150832975979963","commenter_b":"Something tells me that the Bulletin of Atomic Scientists probably knows more about \"international nuclear weapons relations\" than you do.","commenter_a":"Anyone who thinks that this is \"Trumps fault\" doesn't know much about international nuclear weapons relations and the money exchange that goes with it, be it legal or not. Trump wasn't president then....","post_message":"According to the Doomsday Clock there's an increasing probability that the world will observe nuclear conflict."},{"comment_id":"10152767669722217","commenter_b":"100' wall? It will keep out all the green eyed monsters!","commenter_a":"After the last couple of days, I feel it's time to throw my hat into the political ring. I'm forming a new party. The Free England From London Party. We have one proposal. To turn the M25 into a hundred foot wall and fill it with concrete. I'm not sure how we're gonna pay for it, so we're the same as all the other parties, however, I reckon a few Poles and Kurds will do it quite cheap and we could recycle bits of London to make the wall. Who's with me?","post_message":"Spotted any quirky campaign #GE2015 pics? Share yours in the comment section below or via haveyoursay@bbc.co.uk"},{"comment_id":"1338481856248063","commenter_b":"Another woman with no self- respect!","commenter_a":"Typical racist coward","post_message":"He said the controversial chant he was heard yelling had nothing to do with Jews."},{"comment_id":"10154371662414117","commenter_b":"This will make it easier to build a wall. Then Mexico can invade and get back it's land.","commenter_a":"God I hate my damn State.","post_message":"The people who are pointing to CalExit as a possibility have little grasp of either the demographics of the state, nor its actual finances. It is oblivious to the fact that the non-coastal parts of California are similar to the non-coastal parts of the rest of the United States. It is oblivious to the reality that the state's financial crisis is due to overspending within California and not because they're sending money to D.C."},{"comment_id":"10153382839234312","commenter_b":"No not sisters I read THEIR blog. Girls visiting - NOT SISTERS.","commenter_a":"No charges were filed. He was a minor. The girls were not his sisters! MOVE ON!","post_message":"Josh Duggar apologized Thursday and abruptly resigned his job at the Family Research Council in Washington, one of the leading conservative groups fighting abortion and gay marriage among other causes."},{"comment_id":"1001016903307871","commenter_b":"this woman is vial","commenter_a":"Can she get away with everything!! She and Bill both should have been in prison over this too!!","post_message":"Independent Counsel Laying Out Criminal Case against Hillary Clinton in Whitewater Land Scandal."}]
