[{"comment_id":"10153725083142464","commenter_b":"@username YOU'RE A COMPLETE MORON !!","commenter_a":"I remember my thanksgiving in Iraq and the Stan. Prayers for all those away from the families eating thanksgiving in a to-go box","post_message":"Tomorrow and every day, don't forget to say a prayer of Thanksgiving for our men and women in uniform spending the holiday away from home."},{"comment_id":"1076420105745487","commenter_b":"But will that maggot go to Chicago?nope, why cause they are not Muslims!!!","commenter_a":"How sad that these voices will not be heard. It does not go along with Obama's agenda. The black race is being set up. He would rather get 13 percent of a country, pissed off at 87 percent of a country. It is a setup for failure folks.","post_message":"WATCH Black Chicago Residents Blame Obama For Crime And Joblessness: “He needs to resign”"},{"comment_id":"988396247881207","commenter_b":"She should have walked with a pig","commenter_a":"So stupid.","post_message":"Woman Hitchhiked Through The Middle East To Prove Muslims Are Peaceful. What They Did Next..."},{"comment_id":"1231979063521740","commenter_b":"OF COURSE IT WAS RANSOM!! AND NOW OBAMA HAS PUT THE AMERICAN TOURISM IN HARMS WAY HE IS THE VERY WORST THING THAT WE HAVE EVER HAD IN OUR WHITE HOUSE AND WE CAN'T WAIT FOR THEM TO GET OUT OF OUR WHITE HOUSE!!! HE HAS TRIED TO DESTROY AMERICA AND HAND IT OVER TO THE MUSLIMS AND THE ILLEGALS AND NOW THE TERRORIST !! LOOK AROUND YOU THEY ARE EVERYWHERE AND GROWING !!! YOU DEMOCRATS BETTER THINK ABOUT IT !!! TRUMP FOR PRESIDENT AND LETS WIN THIS TIME !! AND SAVE AMERICA AMEN","commenter_a":"Yeah right it was more like Money Laundering.","post_message":"“This was not ransom. Any suggestion that it had anything to do with ransom is absolutely and utterly false.” State Department spokesperson John Kirby defended a $400 million cash transfer to Iran during the release of U.S. hostages. @webpagelink"},{"comment_id":"10152687758547093","commenter_b":"That woman has NO business with a baby.","commenter_a":"Wat is happening to these people ADOPT a baby,dam.","post_message":"HORROR: This woman is accused of cutting the baby out a pregnant mom who answered her Craigslist ad for baby clothes... @webpagelink"},{"comment_id":"1648471502112051","commenter_b":"It never bothered Hillary, at least he recognizes it and is willing to seek advice.","commenter_a":"He's getting bald.","post_message":"This is not normal. This is not normal. This is not normal."},{"comment_id":"10156232723535354","commenter_b":"There is no viable comparison to prohibition. This is not a gun ban. It's apples and oranges. This is simply sensible purchase laws.","commenter_a":"The answer to something like this is not more laws imposed by a federal government. It never works, it never will. Did prohibition prevent alcohol consumption? After prohibition alcohol became more dangerous to consume; crime increased and became ; the court and prison systems were stretched to the breaking point; and corruption of public officials was rampant. Prohibition removed a significant source of tax revenue and greatly increased government spending. It led many drinkers to switch to opium, marijuana, patent medicines, cocaine, and other dangerous substances that they would have been unlikely to encounter in the absence of Prohibition. Now we have the \"War on Drugs\" has that worked? Has Lyndon B Johnson's war on Poverty reduced poverty? It's been 50 years and it appears to be getting worse every year, there are approximately 100 million americans receiving some type of government assistance, an all time high. Has the department ...","post_message":"\"This makes Mercer just one more public attacker who cooperated fully with all gun control, then went on to commit heinous crimes against innocent life.\""}]
