[{"comment_id":"10153962484766680","commenter_b":"Hillary Clinton: All I do is win win win no matter what =)","commenter_a":"And it tells you that the election is not rigged and in fact anyone believes what comes out of Trump's mouth which just showed to not have any credibility","post_message":"Donald J. Trump celebrated a new poll that shows him leading by a single percentage point."},{"comment_id":"10153668088332452","commenter_b":"Ain't that near McD's and the bus station we were chillin at? @username","commenter_a":"Why are Latinos protesting? I don't see blacks protesting when a Latino is killed by a cop? 😒","post_message":"UPDATE: Video shows the chaotic scene as protesters scramble for cover as snipers open fire during marches in downtown Dallas. @webpagelink Eleven officers were shot and five killed."},{"comment_id":"10153809983489486","commenter_b":"She needs jail","commenter_a":"oh hell, I know of NO ONE brave enough to bully Hillary","post_message":"Lol, Hillary fishing for sympathy.."},{"comment_id":"1328913090468676","commenter_b":"You are kidding! Bush was criticised for reading to kids in a school soon after 9/11, which was actually thoughtful and humane. While Obama is on a world tour with the family!","commenter_a":"We have to be honest. If that was George Bush we wouldn't have cared. This doesn't bother me so much, he was being polite as a guest at a State Dinner. Gallivanting with communists just hours after the bombing (and his dismissive <60 second remarks) was disgraceful, though.","post_message":"Nero has nothing on this guy! Obama shows how he feels about the #BrusselsAttacks."},{"comment_id":"1011521052257456","commenter_b":"SHOWA. I would say if you didn't think it could happen again, it's happening again.","commenter_a":"INVADERS don't assimilate!!!","post_message":"Unreal. Stupid public schools ... celebrating the subjugation of women."},{"comment_id":"10153253514670329","commenter_b":"please shut the fuck up","commenter_a":"In what world are 12 year olds adults? The entire point of a juvenile justice system is that children are NOT adults in age nor brain development. They need mental health treatment in a correctional facility tailored to children.","post_message":"They face a count of attempted first-degree intentional homicide. (via BuzzFeed News)"},{"comment_id":"1091478814208499","commenter_b":"what a dumb bitch","commenter_a":"Our President has made it ok to be racist again.","post_message":"Doesn't seem like EVERYTHING is racist? According to the New York Times anyway."}]
