[{"comment_id":"790733494450561","commenter_b":"You go girl.","commenter_a":"good goin!! nice shot!","post_message":"65-Year-Old Woman Shoots Robber Michael Bontaites Square In The Chest. Thank god for the 2nd amendment. Do you support her right to bear arms?"},{"comment_id":"700385996818645","commenter_b":"We in America should do that too. The tree is evil, the fruit is isis and radical muslems.","commenter_a":"Thats what they want it makes them stronger. Causes more hate.","post_message":"Muslims are doing everything to stop him, but he won't relent. This might be what they have to do. Do you agree with his movement?"},{"comment_id":"10153434193979138","commenter_b":"Time to ban women..","commenter_a":"Women are crazy!","post_message":"DEVELOPING- A St. Paul woman has been taken into custody after her boyfriend was stabbed to death this morning"},{"comment_id":"574676589404983","commenter_b":"What a stupid bitch","commenter_a":"She should have seen that nazi meathead Trump fan telling Mexican protestors to make him a burrito. Way more uncivilized than what's happening here. What a stupid statement.","post_message":"She should have seen the \"uncivilized\" civil rights sit-ins that won her the right to be on Fox News."},{"comment_id":"485585728298674","commenter_b":"She is death warmed over!","commenter_a":"Not the first time Nancy has been hit. A face rearrangement could only improve her looks.","post_message":"Greta just kicked Pelosi to the curb... Good. We need more American women like Greta and less like Pelosi. Do you support Greta taking on Pelosi publicly?"},{"comment_id":"10154530088657908","commenter_b":"Ginny Gruhler Vanderhoof You are a very dishonest person \"Sanders battled over veterans issues as chairman of the Senate Veterans Affairs Committee from 2013 until early this year, giving him an easy pitch to a crucial voting bloc of veterans, particularly in South Carolina where veterans make up more than 11 percent of the voting-aged population. There stiff competition for these voters, with front-runner Hillary Rodham Clinton wooing them this month during a round table in Nevada. Even the leaders of veterans groups who praise Sanders acknowledge that the 73-year-old Democratic socialist isn an obvious champion for the flag-waving set of former military officers and enlistees. When asked if the Veterans of Foreign Wars, which recognized Sanders with its Congressional Award in March, had ever bestowed the honor on a socialist before, the group Washington executive director, Bob Wallace chuckled a bit. . No. No, said Wallace, a man who ...","commenter_a":"Why does Hillary think she can get anything done? We've seen how the congress works now. Even if the Democrats re-take the Senate, we still won't have the radically gerrymandered House until 2020. It will be nothing but stonewalling until then. That and attempts to repeal the ACA are all the GOP reps remember how to do. Plus, they hate her with the fury of a thousand suns. They'll waste all their time and hundreds of millions of taxpayer dollars investigating her for anything they can think of until they can figure out some way to impeach her as well. She's not getting anything done. But if Bernie is the candidate, and he is able to continue to energize his massive voter base, then suddenly we have a shot at taking the entire congress back and getting something done. Bernie will bring far more folks to the polls than Hillary ...","post_message":""},{"comment_id":"524602671063646","commenter_b":"this is america fuck islam","commenter_a":"Go Texas","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy. Let them be angry. This America and if you don't like it, get out. Do you agree that Muslims should assimilate or leave?"}]
