[{"comment_id":"1742093019366838","commenter_b":"SUCKS","commenter_a":"Lisa Nicklas Villota!!!!!","post_message":"Thank you to the LGBT community! I will fight for you while Hillary brings in more people that will threaten your freedoms and beliefs."},{"comment_id":"10153744028791178","commenter_b":"WHAT!!!! She's the one that should b in jail","commenter_a":"She needs to go to jail.","post_message":"I'm not sure you can send people to jail for this..."},{"comment_id":"10152955356009071","commenter_b":"I know I said LMAO, but really hit me up... could use the help. ;-)","commenter_a":"Dear anyone... please contact me if you're up for some pro bono work to sharpen your skills! Lmao!","post_message":"It's a known fact that hacking makes money. But how much money?"},{"comment_id":"1171597936185008","commenter_b":"Says the white woman. Lmfao","commenter_a":"It's time for big changes? It's not a change to use racism as a command to get to the top despite our achievements. Jada Pinkett Smith, the talentless half black lady whose name is only known based on the celebrity of her husband. This cause needs a new spokesperson, perhaps a black celebrity with some actual talent worthy of an Oscar.","post_message":"“It’s time for big changes.”"},{"comment_id":"10153365976956955","commenter_b":"Political parasites.","commenter_a":"Anyone who signs new gun control legislation that infringes on the second amendments should be tried for treason","post_message":"HERE THEY COME: CONGRESS TAKES UP GUN CONTROL"},{"comment_id":"10153584485708812","commenter_b":"So did Jesus preach love or condemnation??? I'm confused! Wait, actually YOU ARE CONFUSED! Don't buy the nonsense you are listening to on Sundays. Save your 10%, and search your soul for the truth! Ironic how the same people who follow Jesus (a man of love and forgiveness), are the ones who are most hateful and judgmental","commenter_a":"Wow... Let's see what's next... You give a little & then they want more. SMH","post_message":"South Carolina House approves bill removing Confederate flag from Statehouse grounds: @webpagelink"},{"comment_id":"10156085666465354","commenter_b":"@username Nah ..shes a Wanna be Black!!","commenter_a":"Why are these F*%^ ers not being hunted down, arrested and prosecuted as the 60's radicals were? Why do we even have an FBI????","post_message":"“The revolution is on…Off the pigs.”"}]
