[{"comment_id":"10152660058432452","commenter_b":"Why should your taxes pray double to kill her","commenter_a":"Forgive her. Two wrongs will never make a right...","post_message":"The execution of the first female in Georgia in 70 years was on hold as the U.S. Supreme Court reviewed last-minute arguments by her lawyers that they hoped would persuade the nation's top justices to grant a stay. abc7.la/1M2tBxU"},{"comment_id":"10153588505935329","commenter_b":"Arielle white people shit. Add this to the list.","commenter_a":"Ewrick Velasquez shark week!!!!","post_message":"Jaws IRL."},{"comment_id":"10153602906656509","commenter_b":"You can buy them too.","commenter_a":"I think she means she wants to make a lot of money. Those GEDs aren't cheap.","post_message":"Is America ready for #marijuana moguls? Follow one young couple's journey as they attempt to franchise legal marijuana @webpagelink #HighProfits"},{"comment_id":"10153947256054369","commenter_b":"You don't know much about the Black Hills or surrounding areas, do ya there, Todd and friends.","commenter_a":"What the hell is there to do in South Dakota","post_message":"You work hard, here's where to retire well."},{"comment_id":"1100490033318081","commenter_b":"Suck it up b**ch","commenter_a":"I thought this family was rich. What gives?","post_message":"Hardly 5 star quality... \"She explained a slight bit of displeasure about her accommodations and I explained to her this a jail, not a resort.\" -Sheriff Anderson @webpagelink"},{"comment_id":"10152708692641051","commenter_b":"Dumb girls, they were warned and went anyway.","commenter_a":"Earlier articles said they ran away to join ISIS's cause, they went , now they have to deal with their decision. Sorry, I have very little empathy for them. They basically told their parents, their government and God to go ___ themselves.","post_message":"These parents begged their daughters not to go. They went anyway."},{"comment_id":"10152828817287426","commenter_b":"Omgosh..I am not a violent person..BUT I would beat the Sh** out of that woman....first of all...I NEVER gave into my kids when they threw fits...that's how they learn to NOT get what they want all the time.....This woman is sick sick sick....part of parenting means to not give in..","commenter_a":"@username U seen this uet","post_message":"“There’s nothing wrong with that child, it just needs to be beat,” the woman, who claims to be Kathleen Smith, said in the video."}]
