[{"comment_id":"875483499177795","commenter_b":"It doesn't fit their \"outrage\"","commenter_a":"Where's the GoFundMe link? Her business is a non-profit, they feed the hungry, her organization deserves a lot more than a pizza parlor in Indiana. FoxNews, where is your outrage over this?","post_message":"Republicans don't want government to feed poor people. They want charities to do it. So, what happens when a chef who runs a charity steps up to the plate?"},{"comment_id":"10154396026094714","commenter_b":"Hey woman need your number","commenter_a":"Angie Slater.... awesome words for you","post_message":"\"A strong spirit transcends rules.\" — Prince #RIP"},{"comment_id":"10154432726796320","commenter_b":"Another white woman mad","commenter_a":"Oh let's not forget how a caucasian family looked away from there child in Disney and the alligator got him(🙏🏾) did they drag his parents threw the news talking about their backgrounds? Nooooooo but a African American child falls in a gorilla pit and they put his fathers picture up and he wasn't even around!!!!","post_message":"In a dramatic image, a protester is grabbed by police officers in riot gear after she refused to leave the road in front of the the Baton Rouge Police Department Headquarters on Saturday. She has been identified by multiple media outlets as Ieshia Evans, 35, a nurse and mother of a 5-year-old boy. (AP Photo/Max Becherer)"},{"comment_id":"1158796597473702","commenter_b":"She was having a PRIVATE conversation with her son! It is no one else's business!!!! She quite clearly stated she speaks English!!! Read the article people!!! So stating that immigrants should learn the native language in this situation is redundant!","commenter_a":"We speak many different languages in America.","post_message":"The woman was speaking with her son in Spanish while celebrating his birthday when a stranger interrupted to tell them, \"We speak English in America.\""},{"comment_id":"1153743537971235","commenter_b":"She needs to be in prison!!!","commenter_a":"Really! I don't believe it! Her conscience must be getting to her. But I doubt it. Are they trying to make us feel sorry for her?","post_message":"Is this the real reason Hillary has so many \"issues\" when it comes to her health?"},{"comment_id":"879507305458832","commenter_b":"she wants everyones money , she is so poor !","commenter_a":"Or Vince Foster. Can't forget her law partner who magically killed himself with an antique firearm that didn't function....Interesting.","post_message":""},{"comment_id":"1313980255294149","commenter_b":"this woman simply cannot be a fisrt lady.. Why doesn't trump talk about deporting her ass?","commenter_a":"I am sure he didn't marry her for her to speak. When I think of all the haters who said Michelle Obama had no class (ridiculous), I wonder if they will be thrilled with FLOTUS, Melania Trump.","post_message":"Ha."}]
