[{"comment_id":"1701200686777335","commenter_b":"Gun laws will not effect non-American \"Crazy\" residents taking advantage of our Freedoms.","commenter_a":"What do you think the USA has done all over the planet.....we have bombed and killed thousands upon thousands of innocents and we are the victims? I think not","post_message":"“They want to blow up our country. They want to blow up our cities. They want to knock down our buildings, and [Pres. Barack Obama’s] worried about global warming. We have somebody that’s not in touch.” – Donald J. Trump"},{"comment_id":"10158494825160725","commenter_b":"Why do you care what others do????? It's a saturday. Most people get that day off . dRump loves the bossy bitches. Go grab a pussy","commenter_a":"Get a job/life.You have way to much time on ur hands.","post_message":"Thousands of demonstrators are expected to take to city streets this weekend for the Women's March on Chicago, one day after Donald Trump's inauguration."},{"comment_id":"1252850228086868","commenter_b":"Hang the bitch","commenter_a":"You all just racist that's why you all up all in trumps ass with his bull so take you all racist ass and do what you do best talk mess about real ppl. Trump going to blow your mind when he turns on you and do what's right","post_message":"Hillary Clinton is desperate these days and has even officially taken to getting down on her knees to beg the American people after Congress announced their next big plans for the corrupt Clinton – and the brutal nature of them has got to have Hillary downright horrified. @webpagelink"},{"comment_id":"10153659427149087","commenter_b":"@username Yeah, I've been to a few strip clubs in my life. Good looks though don't mean a girl can perform.","commenter_a":"It's the old emperor with no clothes on eyesight ... The schmuck can't see. He can't even see that his wife is a little hoish, not just the adulterous sex while he was married to his prior wife, but the many pictures like the one I've got in my downloads of a Melania Drumpf doing full frontal nudity, with a wet soapy body, wet hair, seductive pout, and a hand over her crotch doing the two finger simulated insertion. Ha, he can see everybody else and their blemishes .... and talk about them ad nauseum in the most insulting and revolting fashion, but he can't see his naked self .. nor, ha, his naked wife.","post_message":"\"Wow, Corey Lewandowski, my campaign manager and a very decent man, was just charged with assaulting a reporter,\" Donald J. Trump tweeted. \"Look at tapes-nothing there!\" WATCH THE VIDEO HERE:"},{"comment_id":"10155209654718974","commenter_b":"Donald J. Trump 3 mins Statement Regarding Recent Executive Order Concerning Extreme Vetting is a proud nation of immigrants and we will continue to show compassion to those fleeing oppression, but we will do so while protecting our own citizens and border. America has always been the land of the free and home of the brave. We will keep it free and keep it safe, as the media knows, but refuses to say. My policy is similar to what President Obama did in 2011 when he banned visas for refugees from Iraq for six months. The seven countries named in the Executive Order are the same countries previously identified by the Obama administration as sources of terror. To be clear, this is not a Muslim ban, as the media is falsely reporting. This is not about religion - this is about terror and keeping our country safe. There are over ...","commenter_a":"Stay strong","post_message":"We're at Portland International Airport for the second day of the #nobanpdx protest against Donald Trump's executive order on immigration."},{"comment_id":"10153129788220667","commenter_b":"No one cares that he lived and no one would care if he died","commenter_a":"Really?? Who cares?!?!??!!!","post_message":"He is in significantly better shape than when he was rushed to a Las Vegas medical facility after a three-day binge at a Nevada brothel."},{"comment_id":"1354157517952129","commenter_b":"Has Ann never looked in a mirror? She may be a skinny bitch, but look at that horse face of hers. Does anybody see the resemblance? She's got great hair, but hair can't cover up that horse face.","commenter_a":"Man Coulter is a vile excuse for a human being.","post_message":"Yes, really."}]
