[{"comment_id":"612078075583452","commenter_b":"She did it before. Why not now ?","commenter_a":"She is reg","post_message":"If you listen closely to yesterday's debate, you can hear a very clear whisper. It was easily picked up by the microphone - but some people still missed it. Here - listen closely."},{"comment_id":"10153311065101167","commenter_b":"Three words: Token. Black. Woman.","commenter_a":"Why does anyone care what Stacey Dash has to say?","post_message":"Today on live TV on two separate programs, Fox News called Obama a \"total pussy\" who doesn't \"give a shit\" about terrorism:"},{"comment_id":"10154025018063812","commenter_b":"Haha ahhaha he started a few months early than G! We'll see u there chap!","commenter_a":"@username look at georgie's bf!","post_message":"Prince George attends his first day of nursery school: @webpagelink"},{"comment_id":"10154125037012377","commenter_b":"Women are smarter than you think. This is always from a man's perspective that we are weaker. Always remember women birth your armies, their children suffer and die. The hands that rock the cradle rule the world. And when they send troops home blind and crippled, it's the woman wives and mother that take up the healing the grieving and the praying. God made us special that way. Someone has to have sense.","commenter_a":"I hope that Trump comes up with some way to penalize the Media when they publish lies.....They should not be able to get away with it.....they put up pictures that are not true with the stories.....the media has become a very negative view on anything with Trump...they dont have the truth in them......I have high hopes for President Trump and do believe he will do a great job.....It is time for all to quit all tthe stupid protesting and join together to help America!!!","post_message":"Americans reactions to President Donald Trump's inauguration were positive with more people saying they are now more hopeful about the next four years than those who are less hopeful, a Gallup Poll reveals."},{"comment_id":"10154154937686409","commenter_b":"Very smart wife! You'd do well to follow her example!","commenter_a":"Beg to differ tree hugger. My wife warms up her 4Runner for five to ten minutes. I never warm up. Her car is a 2006 and runs like new. I've gone through two cars. And '06 and an' 08","post_message":""},{"comment_id":"1703000273311505","commenter_b":"If they want want to demand, tell them to go home!","commenter_a":"First of all, you can buy any kind of food you choose on food stamps ( I work in a grocery store, if you could see what people buy with food stamps ) , secondly you can't DEMAND anything. If you have demands, demand it from your own country.","post_message":"Muslims On Welfare Benefits Make RIDICULOUS Demand About Food Stamps If you want special treatment, then go get a job. Do you agree beggars can't be choosers?"},{"comment_id":"10153507125536749","commenter_b":"So tell me how more gun laws are going to stop criminals and terrorist? or are going to do the only thing you do best Lie ,cheat and screw Americans! @webpagelink","commenter_a":"TURCIA = TU Rusia CIA","post_message":"The Clean Power Plan is part of American leadership on climate change."}]
