[{"comment_id":"873971869318028","commenter_b":"You can hack those toys so easily","commenter_a":"Junior Marquina Perez & @username I WAS NOT ABLE TO SEE YOUR REPLY :'(","post_message":"Do your kids like the Minions? One family did a double take after hearing their 5-year-old daughter's McDonald's Happy Meal Minion toy speak:"},{"comment_id":"1200823989996135","commenter_b":"@username I, for one, will not miss that evil animal at all!","commenter_a":"Lets just Eliminate him ... can't understand why he has not been removed already ... Oh Wait , people are to afraid to do anything !","post_message":"Obama now want to eliminate another of our national symbols. Just wait until you see this!"},{"comment_id":"10153398427016336","commenter_b":"And Never - Ever - try to make a woman choose between you or her horse! She will most certainly ride off into the sunset w/ o you!","commenter_a":"Ladies, Never make a man choose between you and his kids or his dog! You will lose every time if he is a real man!","post_message":"Faced with the \"it's me or the dog\" decision, a Virginia man chose his beagle."},{"comment_id":"10153410031966615","commenter_b":"Oh man. This breaks my heart. I FOUGHT for my baby to live and can't even begin to imagine this happening to my children. :(","commenter_a":"Horrible story, horrible people to treat their kid like that. But I still can't figure out where was that carseat? Is it so hard for wpxi to say if carseat was in the car or in the house? Every time I read the story it just says child was left in carseat.","post_message":"BREAKING: The parents of a 23-month-old girl who died after police said she was left in her car seat for 13 hours have been arrested -- and will face homicide charges. WPXI Cara Sapida is talking with police and will have the latest on Channel 11 at Noon."},{"comment_id":"441930219322192","commenter_b":"Jail this pervert!","commenter_a":"Creep","post_message":"Conservatives are bending over backwards trying to defend the Duggars. Gross!"},{"comment_id":"1179704828736654","commenter_b":"What do you expect their natural prey is vermin after all!","commenter_a":"Omen? It probably thought his hair was a nest.","post_message":"This might be the greatest story of the week."},{"comment_id":"831063543595735","commenter_b":"and what would having military service help with illegal aliens......","commenter_a":"Every Presidential candidate should have had at least 3 years active duty! No exceptions! Would stop illegal aliens, and other scum from infiltrating the white house like NOW!","post_message":"We need a leader who supports our military, now more than ever! www.thepoliticalinsider.com"}]
