[{"comment_id":"10156170430735354","commenter_b":"Women don't need men any longer. They hate men. They have each other, the feminist lesbian agenda, invetro fertilization and high tech sex toys. All they need are man farms for harvesting sperm.","commenter_a":"Truer words.........","post_message":"\"...academics and feminists are terrified and calling for them to be banned.\""},{"comment_id":"10152856224956051","commenter_b":"Ban them from the USA!!!!!","commenter_a":"These f***ing traitors need to have their asses strung up on the flag pole !!! Wtf is happening to our country!! What a bunch of sorry worthless stupid f***ing liberals!!.. S*** is fixin to hit the fan!.. Do they actually think we're just going to sit back n let them continue their disrespect??","post_message":"More than 1,200 people, including a lot of prominent professors, just signed a letter to ban the American flag. Here are all their names and the schools they’re from."},{"comment_id":"10153033026636336","commenter_b":"She should have let him back on","commenter_a":"Somebody better contact Social Services about that bus driver! He let a child walk 1/2 mile alone!","post_message":"An Indianapolis mother is outraged after her 6-year-old son was forced to walk home a half-mile through knee-deep snow after a bus driver dropped him off at the wrong stop and wouldn't let him back on."},{"comment_id":"10157371932040500","commenter_b":"Build that wall!","commenter_a":"Lithia FL","post_message":"WFLA Ian Oliver talking about Sunday weather and the latest on the tropics including Invest 99L."},{"comment_id":"1009028342550450","commenter_b":"She is having them killed","commenter_a":"Hell yes she is responsible for that","post_message":"BREAKING: Another Clinton Associate Set To Testify Against Hillary Found Dead There's no way this is a coincidence. America deserves to know the truth. Do you think Hillary is responsible for this?"},{"comment_id":"10154189490969497","commenter_b":"Most teen girls are total bitches, even those with cancer.","commenter_a":"they always use a teenage girl for this example but never a teenage boy that does the same thing/worse :P","post_message":"Though the chemotherapy Rachel Fullerton is undergoing often makes her weak, she said she has strived to maintain her typical routine of rolling her eyes and sighing loudly anytime an adult addresses her."},{"comment_id":"961665563922802","commenter_b":"Lady, stop proving your ignorance","commenter_a":"if its a fairy tale explain how what and when where we got on this planet? we are aliens for god made us in his image not a fairy tale i have seen too much that i cannot explain that was unnatural to the human eye not to know its a fact there is a god and angels to go along with him so they should just wake up and smell the coffee","post_message":"Well.... this could put a damper on the tent revival."}]
