[{"comment_id":"10153855606886336","commenter_b":"How come you mother fu*kers can't just go to school and stfu?","commenter_a":"Yes","post_message":"Are students demanding too much power?"},{"comment_id":"10153655864652217","commenter_b":"Allah the greatest ever 💖💖💖","commenter_a":"“This life is not real. I conquered the world and it did not bring me satisfaction… God gave me this illness to remind me that I’m not number One; He is.” Muhammad Ali You will be missed #Champ #RIP","post_message":"Muhammad Ali was famous for his pre-fight braggadocio, predictions and quips."},{"comment_id":"2077791549112023","commenter_b":"@username, They are both illegal, just being born here doesn't mean a thing if your parents are illegal to begin with. 2 illegals cannot make a legal.","commenter_a":"How did she get there? If she had to fly? I don't fly, don't you need an Id and if she has a letter to be deported, how does this work?","post_message":"Democrats just got busted violating federal law at the DNC convention. This is HUGE, but apparently the law doesn't apply to Democrats. Can you imagine if a Republican had done this?"},{"comment_id":"484366015087312","commenter_b":"They are all racist. They all hate white people. Yet they couldn't live without white people. Infact if it wasnt for white americans they would still be enslaved around the world. This country didnt start slavery, it was white americans that put an end to slavery around the world. its all they have is the slave thing without it they would have to evolve or take responsibly for thier inability to evolve .","commenter_a":"Why can't President Obama be impeached?","post_message":"National controversy after Juan Williams says something shocking. Juan is racist, plain and simple. Do you think FOX should fire Juan Williams?"},{"comment_id":"10153196646006336","commenter_b":"Illegal Immigration !!","commenter_a":"the only thing i want this guy to speak is about cuban and latino massive immigration to USA !","post_message":"“The purpose of our laws is to protect our right not just to worship, but to live our faith as citizens of this country.” 2016 presidential candidate Marco Rubio spoke with FNC’s John Roberts about religious freedom today at the Faith and Freedom Summit in Iowa, saying that we’ve reached an era of growing religious intolerance."},{"comment_id":"10154429543778196","commenter_b":"Better than watching u suck dick in public","commenter_a":"Really maybe he and Putin should just get a room sick of watching them suck face in public","post_message":""},{"comment_id":"853027351431360","commenter_b":"Kill all the white people!","commenter_a":"They won't even look at them","post_message":"Boy are these guys gonna be in trouble when the Justice Department gets involved with this, amirite?"}]
