[{"comment_id":"10153709556991880","commenter_b":"Mario","commenter_a":"Maggie Urgupluoglu","post_message":"The city's five boroughs are filled with hidden spots."},{"comment_id":"1263312547023087","commenter_b":"James Walters watch it","commenter_a":"I feel deceived. I thought he was going to explain the theory briefly with the popcorn.","post_message":"It's the 100th anniversary of Einstein's theory of relativity this year. Here's an explanation so good, it won $400,000"},{"comment_id":"1338951096148716","commenter_b":"Anthony - Huh? Who proposed that? If you're not a citizen, you don't get to vote. If undocumented get amnesty (which can only be done by Congress), that doesn't necessarily make them a citizen. If we decide (via legislation) they should have a path to citizenship, then citizens get to vote. Your comment makes no sense, and is a total strawman.","commenter_a":"If you can't win on the merits of your policy ideas, change the system. The GOP should be ashamed.","post_message":"Republicans are pushing, in Virginia and elsewhere, to make it harder for Democrats to win the Electoral College."},{"comment_id":"10152610219894071","commenter_b":"Gabriel Emilio","commenter_a":"Bates PAPA Creighton","post_message":"They're killing it right now."},{"comment_id":"909858709204705","commenter_b":"Absolutely ! It's not a color issue , they were intruders !","commenter_a":"What a brave wonderful woman. So sorry to hear of her loss!","post_message":"Dorothy Hendrix unloaded on thugs who broke into her house... but look what happened next. She has every right to blow those intruders away. Do you stand behind her constitutional right to defend herself?"},{"comment_id":"485435508313696","commenter_b":"She is a dangerous racist!,","commenter_a":"Yes","post_message":"Oprah is going after white people on live television. The hypocrisy is overwhelming. We need to show her we're not going to stand for this. Do you agree Oprah is a racist?"},{"comment_id":"817253511741162","commenter_b":"@username she isn't running. Stupid! Trump's wife is a ditzy bimbo... Not relevant.","commenter_a":"Hello!!! The Liberals are the ones voting for him. He is a danger to our country. I know many Conservatives who feel the same way about this democrat posing as a republican. Don't be stupid with your vote. The Liberals will still want to leave over Cruz being elected. Why not go that route? Or change your page to the Comical Former Conservative.","post_message":"Rosie and Whoopi too......one can dream..."}]
