[{"comment_id":"964810136945374","commenter_b":"Woman is nuts , how did she get the job in the first place?","commenter_a":"I don't think she wants fame. She's taking a stand for what she believes in. Just like everyone else is standing up for what they believe in. Only one that's making her famous is the ones giving her attention. #DRAMASEEKERS","post_message":"Kim Davis's latest attention-grab has blown up in her face."},{"comment_id":"10153493964774060","commenter_b":"And she could have foiled the whole dastardly plot by wearing a seatbelt!","commenter_a":"it's a shame the British had her murdered...","post_message":"On this day in 1981, Lady Diana Spencer married Prince Charles. At the time, The Economist gushed \"God save the next queen\". It was not to be. Read our obituary from 1997 @webpagelink"},{"comment_id":"10154018713024411","commenter_b":"Antony. I don't represent the US government. The US government doesn't represent me. I don't excuse all of the bad things the crooks who call themselves \"my government\" do. And none of that excuses crimes Israel commits. Including the subversion of my country's government via AIPAC and all of its spies, such as the traitor Jonothan Pollard, and dual-citizen Israeli loyalists in positions of influence and power. If you don't like the crimes my country has commited in the Middle East since 9/11, you can attribute a big part of the blame on Israel and its subversives in the US. Not all, but a big part.","commenter_a":"The excuse is always the same. A missile from Gaza lands harmlessly into the Israeli desert. Israel bombs the hell out of Gaza, killing dozens or hundreds of civilians. When are people going to wake up to this scam. Israeli agents shoot off the missile to provide a pretext for Israel's aggression.","post_message":"URGENT"},{"comment_id":"837279236391341","commenter_b":"She's a stupid twat","commenter_a":"How dumb can any one person be?","post_message":"Come again??"},{"comment_id":"1220005224782920","commenter_b":"She was a fucking stripper! Yeah, real class!!!","commenter_a":"Yes, what a wonderful change. And so does Mellania - what a classy First Lady we have!","post_message":"ClashDaily.com"},{"comment_id":"1455671454485613","commenter_b":"I thought alcohol is not allowed in their religion of peace.","commenter_a":"Drunk and drugged? Classic!","post_message":"The Rabbi looks like a natural at Jew Jitsu..."},{"comment_id":"10152546933456776","commenter_b":"Get all the illegals out of our country, Enforce our constitution and the god it was based upon twtf","commenter_a":"Let's get those illegals out of here and all those Muslims who hate us","post_message":"Today I was sworn into the U.S. Senate. It's a great honor to serve the people of Louisiana. Our state has limitless possibilities. Let’s take advantage of our natural resources as a way to create better jobs with better benefits for Louisiana families. Let’s work for healthcare solutions that give patients the power to make their own decisions. Let’s protect family values and the ideals our Founding Fathers established in the Constitution. I look forward to working together. I'm with you."}]
