[{"comment_id":"10153578934943984","commenter_b":"Really. Yall have to ask??? Stupid crap and a shame people think of HIM as courage. SAD. However HIS timing was planned just at the right time for the supreme courts decision.","commenter_a":"What a joke.","post_message":"Wow. Immediately after the ESPYs it became clear to those paying attention that ESPN made a big mistake. I'm pretty sure ESPN never saw this coming when they decided to give Jenner the Arthur Ashe Courage Award. Do you think ESPN was wrong to give this award to Jenner?"},{"comment_id":"10153303118249203","commenter_b":"Beauty.","commenter_a":"That was an awesome episode!","post_message":"John Oliver made NSA whistleblower Edward Snowden crack on Last Week Tonight with John Oliver during a surprisingly contentious interview."},{"comment_id":"10153645226755399","commenter_b":"Totally feeding ISIS everything they want. Playing right into their hands. What a naive jerk. ISIS loves Trump.","commenter_a":"Hum. ISIS launches attacks in order to provoke a backlash against Muslims in the West in order radicalize them. Trump follows the ISIS playbook perfectly calling for an entire raft of outlandish actions against Muslims in America: ISIS Mission Accomplished. Donald Trump: ISIS Agent #1","post_message":"The GOP presidential frontrunner just went there."},{"comment_id":"10154043795967061","commenter_b":"The fact that the lady moves so slow is the first reason she should no longer be driving!!!!!!","commenter_a":"Grab her and get her out!! Why so slow Poor lady Car could explode","post_message":"WATCH: Body cam video shows Santa Fe police officer rescuing an 87-year-old woman from a burning car. \"I could have burned to death. @webpagelink"},{"comment_id":"1202111446538878","commenter_b":"Ain't none OF these HOES VIRGINS!! EVERY GIRL BEEN WITH SOMEONE BEFORE YOU GOT IT . THIS DAY AND AGE..","commenter_a":"Everybody saying he having diddys seconds are dumb by that logic every girl you've been with is technically seconds sometimes more than seconds 😭😭😭😭 might be hundreds","post_message":"Damn! #WSHH"},{"comment_id":"754375298024849","commenter_b":"I thought you did well.. BUT we want the illegals gone.. I am not a fan of the illegals... Get a plan.. announce it and I will get on board... I am not a fan of Mexico...","commenter_a":"jeb is no good","post_message":"The Reagan Approach"},{"comment_id":"10153491721731337","commenter_b":"He's the biggest Dick","commenter_a":"Rock Star? Don't you have to be able to play an instrument? And sing? If not, then I'm the biggest rock star!","post_message":"SHOTS FIRED: Kanye West claimed to be \"THE GREATEST LIVING ROCK STAR.\" The Who responded perfectly..."}]
