[{"comment_id":"483898831770072","commenter_b":"@username Whoa, calm down woman.","commenter_a":"They could just import it from Iran. I wonder what's stopping that great deal?","post_message":"Italian caviar, that is."},{"comment_id":"1054180274641720","commenter_b":"Sam , isn't a lesbian so why would they have lesbian in the house?","commenter_a":"It's homophobic too, since there are no lesbians on the show either.","post_message":"Is The Bachelorette Australia RACIST? (via Daily Mail Australia)"},{"comment_id":"1109262989140148","commenter_b":"Crazy woman- Good match for Trump","commenter_a":"What an imbecilic shallow fool! Has she ever gone a day without knowing where she will sleep for the night or whether she will find a meal before the end of the day? God! Someone just shut her up!","post_message":"\"Knowing that Trump won on [immigration], it should empower you to go ahead and ask the candidates, 'What the heck are you thinking, candidates? What are you thinking when you're going ahead and actually asking for more immigrants, illegal immigrants, welcoming them in, even inducing and seducing immigrants with gift baskets of teddy bears and soccer balls?' \" Sarah Palin said."},{"comment_id":"1895551420676942","commenter_b":"Its not a muslim ban you morons.....learn facts. The top 5 countries in regaurds to muslim population are still traveling with zero restrictions. Its a 3 month travel ban from the 7 countries with strong terror ties....and 3 months until the fix the problem of Isis slipping through the cracks. And if he is so mean and horrible, what is Obama and the rest of the democrates? Because this \"Ban\" is the exact same one Obama used in 2011 only Obama did it for 6 months...not 3. Please open your eyes before you spew blind hate.","commenter_a":"You are and idiot. Wake your ass up shame Trump has to protect you.","post_message":"Share if YOU stand with Sally Yates, too. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1114642831881306","commenter_b":"We Can't seem to Pin Point The Problem!!! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The Underwear Bomber was a Muslim The U.S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bali Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Muslims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were Muslims The first World Trade ...","commenter_a":"Where are the women & children ???","post_message":"A sound strategy, considering Obama's strategy is basically, \"You're a bigot if you don't accept Islamization of America.\""},{"comment_id":"10153855606886336","commenter_b":"How come you mother fu*kers can't just go to school and stfu?","commenter_a":"Yes","post_message":"Are students demanding too much power?"},{"comment_id":"1870709889833499","commenter_b":"And what about those born with both genitals ?","commenter_a":"A person that has the female organ is female, and a person that has the male organ is a male, END OF THE CASE. Next please: ''The Kardashians Still Fighting Over a Pudding''","post_message":"Meet the cover girl who used to be a boy"}]
