[{"comment_id":"1676754379239687","commenter_b":"Bramden whos god bitch","commenter_a":"What a dumbass. It just shows how little thought he's put into what he's saying. The environmental impact alone would be devastating. My problem with Trump is, if he were somehow to get elected, when he didn't get his way he would just say \"I'm going back to my life as a billionaire where I get my way and everything has a price so I can have what I want\". He's made that statement in one of his speeches. He said \"you might not like my statements and I may not get elected for them. So what, I'll just go back to my life of wealth\".","post_message":"How would Donald Trump crack down on ISIS as president? Let's just say he has a bold plan. Here, in his own words, is what he'd do:"},{"comment_id":"10157992746740594","commenter_b":"@username if I'm going to make my mother get up in the middle of the night and travel four states to feed me she better be bringing more than a hot pocket.","commenter_a":"This is great, this is just what you liberal snowflakes need to cope with reality. It's nice that Google is providing portable \"safe-spaces\" for tomorrow's Captains of State Dependency.","post_message":"Turn photos of Donald Trump into adorable kittens with this Chrome extension."},{"comment_id":"10153842554698132","commenter_b":"How about all of the leading men she banged?","commenter_a":"He deserved it for having to put up with her stupidity","post_message":"\"That's actually a common answer believe it or not,\" the host replied. @webpagelink"},{"comment_id":"10154967718641337","commenter_b":"Go fuck your self pussy","commenter_a":"Fuck him and his Walmart brand shit mustache, i'd stone cold stunner this redneck, put him in a coma and have Black Lives MAtter tattooed on his face. Only then i'd forgive this shitstain","post_message":"A stunning conclusion..."},{"comment_id":"10154534078174445","commenter_b":"I know. Is that close to where you live? It's scary","commenter_a":"Sharon Leahy-Lind Elizabeth Lind","post_message":"Imagine you're enjoying a day in the woods, walking down a trail when you see THIS: a large snakeskin. @webpagelink"},{"comment_id":"10154185145943132","commenter_b":"Sue happy! These ladies are cracking me up. They have no clue.","commenter_a":"OH so this is how they make a living. Hard work paying off there. Unbelievable.","post_message":"It's always polite to ask permissionjust ask Kendall Jenner."},{"comment_id":"10152866488206336","commenter_b":"that IS child endangerment..someone needs to be locked up--along with the snake........","commenter_a":"Some are just nuts","post_message":"This video footage of a 14-month-old girl playing with the family pet might make you a little nervous."}]
