[{"comment_id":"942297612493435","commenter_b":"Yep....her attitude says it all!","commenter_a":"\"What difference does it make?\"","post_message":"\"I will not quit on you. I will fight for you. I will be there for you every single day.\"—Hillary in Iowa City, Iowa yesterday via Hillary for Iowa"},{"comment_id":"1090441274344209","commenter_b":"People keep saying this but it seems like Hillary IS our Trump-like candidate.","commenter_a":"Allow me devil's advocacy: 1. If the dems ever run a \"Trump\"like candidate, the super delegate system would be designed to stop that person. 2. Getting more than a small percentage of voters to the primary booths will make the dem party more democratic than overhauling the super delegate system","post_message":"Ending the superdelegate system is what will make the Democratic Party more democratic. This is the kind of grassroots democracy that will help the Democratic Party grow and win elections."},{"comment_id":"10152949428967061","commenter_b":"who freaking cares,she need to get her tubes tied !","commenter_a":"none of anyone's business....really don't care....","post_message":"Bristol Palin announces second pregnancy; says she knows it will be \"huge disappointment\" to many: @webpagelink"},{"comment_id":"10154269549387994","commenter_b":"You ugly asf stfu.^","commenter_a":"People have gone crazy if they think Trump can run this country.","post_message":"BREAKING: Ted Cruz has dropped out of the GOP race for president, clearing the way for Donald Trump to likely win the nomination."},{"comment_id":"10154428619792144","commenter_b":"Kimberly, other than Melania Trump, you wouldn't know an illegal immigrant from a U.S citizen if your life depended on it. Get ahold of yourself woman!","commenter_a":"Seriously????? Let it go.....He's done, THANK GOD!!!!!! The end of an ERROR....","post_message":"Thank God."},{"comment_id":"1326722587387039","commenter_b":"Lock her up!","commenter_a":"These people man!","post_message":"Guess what her alias is..."},{"comment_id":"10154228299244218","commenter_b":"FYI this was NOT over drugs!","commenter_a":"clean up cecil county get drugs out the killed will stop . can,not count all the kids pasway in 20 year I live in cecil county iam way ingfor a call my son rusty is died I love rusty but he love his drugs","post_message":"Two people were killed in a shooting Monday night in Elkton, police said. @webpagelink"}]
