[{"comment_id":"10153583021397434","commenter_b":"Get that bomb ass dick!","commenter_a":"I had to open up my decoy facebook just to be able to \"anonymously\" say that I've slept with at least 160 different men and have never experienced this.","post_message":"After fucking, while you’re still a tangle of sweaty limbs and heaving torsos, your partner--probably still inside you--looks deeply into your eyes and whispers a husky and sensitive “hey.” Why?"},{"comment_id":"985606431474778","commenter_b":"@username, I understand what you're saying. I'm supporting Ben Carson for potus. But with all the voter fraud, illegals voting Hillary will be president. That scares the crap out of me.","commenter_a":"Sadly, I fear she will be our next POTUS. It's a bad, bad time in America.","post_message":"This is so sad."},{"comment_id":"10154017496904753","commenter_b":"@username, shame on you as , should be, a lady sharing that garbage!!","commenter_a":"He should shout up and move on with is washed up singer Gwen. Miranda has kept silent . She is the classy one.","post_message":"Until today, Blake Shelton and Miranda Lambert have kept people guessing who really caused the divorce in their relationship. During an interview with Billboard a few weeks ago, the 40-year-old country superstar hinted that the 32-year-old songstress cheated on him. His song “She’s Got A Way With Words” was about a lover who cheated and lied. Shelton may not have written the song, but he said that he won’t stop people from thinking that some of the lines were about his relationship with his... @webpagelink"},{"comment_id":"10154713601071336","commenter_b":"For the tape no more no less!","commenter_a":"The sexual assault was words - big deal.","post_message":"Donald J. Trump says accusations of sexual assault may have been started by Hillary Clinton's campaign: \"I didn't even apologize to my wife...because I didn't do anything.\" #Debates2016 #FoxNews2016"},{"comment_id":"872561492840104","commenter_b":"Just STFU!!!!","commenter_a":"You know he's an imbecile when he says the president should b e like a rapist,drugger of the unsuspecting; Bill Cosby","post_message":"\"America's Mayor\" wades back into the fray."},{"comment_id":"517364508436536","commenter_b":"The other candidates are disappointed because they need Trump's ideas","commenter_a":"I wander if I can have my cable provider remove FOX channel from airing in our home period...ha..oh, I can do that. #TRUMP !!","post_message":"The Trump campaign is saying that Donald J. Trump will skip Thursday’s Fox News-Google #GOPDebate. @webpagelink"},{"comment_id":"10155083954441509","commenter_b":"Bernie sanders , Hillary Clinton,barrack Obama , Set out a bobber in the middle of a HUGE democratic lake , And caught a HUGE amount of sucker fish from the Bernie Campaign, just to find out it was a catch and release campaign ! \"Awesome\" Hand the election to Donald J Trump , Cause it's over for the Democrats Thanks Bernie","commenter_a":"HIllary Rodham Clinton is going to be the 45th~! Putin is manipulating the US presidential election as the De Facto Master manipulator behind Wikileaks- exclusively for his Neo-colonial ambitions. Under Trump's erratic, contradictory rhetoric there is disregard for the 1945 Yalta/1949 Armistice Agreements Border Treaties. A new deal with Putin will re-allocate all former USSR-European domains unless they contribute a \"protection-fee\" Mafia-Culture, upsetting the political/ climate balance of the entire planet;-)","post_message":"Protesters chanting “No TPP” disrupt Representative Elijah E. Cummings' speech at the Democratic National Convention in Philadelphia. @webpagelink #DemsInPhilly"}]
