[{"comment_id":"867742276749682","commenter_b":"You are a liar and a piece of shit!","commenter_a":"Yes","post_message":"Obama just gave Trump hell for complaining about the voter fraud but look what just happened. This goes to show you the sickening corruption that's happening in our country. Do you think the election is rigged?"},{"comment_id":"10153160986369705","commenter_b":"stupid cow","commenter_a":"Nothings more eerie than the words \"AMERICA\" and \"ISRAEL\". No photos needed.","post_message":"These eerie photos show Osama Bin Laden before 9/11."},{"comment_id":"10153104771426051","commenter_b":"That woman is whack a doodle!","commenter_a":"Get a real life.","post_message":"This mom took one look at her daughter's Christening cake and immediately demanded an apology from the cake shop."},{"comment_id":"1353803527975767","commenter_b":"Lock there asses up!","commenter_a":"Lol look how racist worded the article. If it were a black victim and white captors u know this headline would of been completely different hahaha hypocritical libs","post_message":"Four teenagers tortured a person with disabilities and streamed the horrific attack on Facebook Live. WARNING: Graphic footage."},{"comment_id":"10153237839494203","commenter_b":"Marxist Feminists are ugly and nasty.","commenter_a":"Would you describe a man as \"testy\", Daily Beast? Thought not.","post_message":" can spin her way out of this. She can explain her way out of this."},{"comment_id":"1036949889659355","commenter_b":"Mother fucker that shot him should be shot","commenter_a":":(","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"10152996410034330","commenter_b":"How about if we all carried guns to protect ourselves from worthless losers like this. Just kick them off the planet and they never will rob anyone else, thats for sure...","commenter_a":"Yes Paulette in a perfect world one could go to the ATM, grocery store, or anyplace else anytime at all, however in the real world there are criminals and scum who do prey on people when they make themselves vulnerable. Police and other security people cannot be everywhere to ensure nothing ever goes wrong. It's just common sense to use caution and good judgment when out alone.","post_message":"FRIGHTENING VIDEO: A woman who pulled up to an ATM was kidnapped at gunpoint and forced into her trunk and the whole ordeal was caught on video ---> @webpagelink The suspect even gave police a good look at him"}]
