[{"comment_id":"1202111446538878","commenter_b":"Ain't none OF these HOES VIRGINS!! EVERY GIRL BEEN WITH SOMEONE BEFORE YOU GOT IT . THIS DAY AND AGE..","commenter_a":"Everybody saying he having diddys seconds are dumb by that logic every girl you've been with is technically seconds sometimes more than seconds 😭😭😭😭 might be hundreds","post_message":"Damn! #WSHH"},{"comment_id":"10153605782047522","commenter_b":"@username THE MORALS OF THE DEMOCRATIC PARTY AND IT'S FOLLOWERS HAVE RESORTED TO THE MOST LOWLY TO SPEAK IN PUBLIC...LENA DUNHAM SPOKE AT DNC CONVENTION. SHE ALSO WROTE A BOOK AND HEREIN IS A PASSAGE...NASTY...NASTY...GIRL...In the book, Lena Dunham describes an incident during her childhood in which she leaned down between her sister legs and spread open her vagina, saying the behavior did not alarm her mother and was the spectrum of things I did. At another point, she writes that she would try to bribe her sister with candy for a kiss on the lips, joking that a sexual predator might do to woo a small suburban girl I was trying.","commenter_a":"Not surprised. The media has been so bias lately, Clinton doesnt even need the DNC. She has the press. The hatred for this man by the media is astounding. The globalist and globalism will do anything, say anything, to remain in power.","post_message":"The latest in the polls:"},{"comment_id":"1096146180493131","commenter_b":"Mexicans showing their little dicks. Their penis's are as big as a Mexican pepper. Will see who kisses of illegals your asses are grass.","commenter_a":"Trump","post_message":"CITIES TELL TRUMP to KISS OFF @webpagelink"},{"comment_id":"10153742878600575","commenter_b":"Deport them","commenter_a":"Aren't we all supposed to be brainwashed by the communist media maggots that this is the \"peaceful religion\" ?","post_message":"Muslims blew up city Christmas tree."},{"comment_id":"10153646192306880","commenter_b":"They like getting in touch with their feminine side. :)","commenter_a":"I have the man color, slate grey.","post_message":"Let's face it, the \"rose gold\" iPhone 6s is pink."},{"comment_id":"1783804358520815","commenter_b":"Shut up....","commenter_a":"As reprehensible as Dylann Roof's crimes are, the death penalty is simply a barbaric act that brings a blood-lust satisfaction. There is no Hell to which criminals are consigned that is worse than lifetime confinement.","post_message":"Defense attorneys for Dylann Roof, who is accused of killing nine people at a church in Charleston, South Carolina, filed a legal challenge to the constitutionality of the federal death penalty."},{"comment_id":"1161299523890076","commenter_b":"overly politically correct, nail on the head!","commenter_a":"he offered no defense...merely doubled down","post_message":"\"I think the big problem this country has is being politically correct. I've been challenged by so many people and I don't frankly have time for total political correctness and to be honest with you this country doesn't have time either.\""}]
