[{"comment_id":"1332991433380908","commenter_b":"All im saying is some people shouldnt breed .","commenter_a":"poor skinny white Jesusy guy.. HOW COME I'm THE CHUMP !! ==========>.\"roll tide/ @webpagelink","post_message":"Counter-demonstrators outnumbered attendees of a \"pro-white\" rally at Stone Mountain Park in Georgia, home to a divisive landmark that pays tribute to Confederate leaders."},{"comment_id":"10154268994748822","commenter_b":"Assclown fool","commenter_a":"I'm so proud to have this man as my governor and I'm ashamed of the Pennsylvanians (some of whom are commenting here) who are racists and religious bigots. Thank you Governor Wolf for representing ALL Pennsylvanians (even the ignorant ones) and for protecting our children!","post_message":"NEW: Gov. Tom Wolf's administration released a response plan after recent incidents involving racism and religious intolerance in Pennsylvania schools."},{"comment_id":"1205288416198545","commenter_b":"in tears watching this. God keep him with you and give the family strength and patience to heal.","commenter_a":"Priceless....God bless this little tyke and his family and friends..","post_message":"WATCH: 6-year-old boy killed in SC school shooting laid to rest dressed as Batman at superhero-themed funeral: @webpagelink"},{"comment_id":"10153076397462452","commenter_b":"Yikes!!! Kill it with fire before it rapes again.","commenter_a":"Why do child molesters look so child molestery?","post_message":"A former drama teacher at Sycamore Junior High School in Anaheim has been arrested on child molestation and child pornography charges. @webpagelink"},{"comment_id":"1596477097312385","commenter_b":"Illegal immigrants must not vote. That is against the law. All people must be made to show ID to make sure illegal immigrants are not voting and to make sure nobody votes more than once. It is simple common sense. For the very rare citizen who may not have ID they can assist them and pay the fees. It would only be a very few people. But everybody must show ID to vote and prevent voter fraud.","commenter_a":"Why do judges think only black people don't have IDs and considering everyone needs an ID for just about anything else, why would anyone not have an ID? All this law does is make sure there is not voter fraud...so in essence this ruling shows me that the court wants voter fraud, it's the only thing that makes logical sense. I think it may be time for other countries to oversee our democratic process or we need to stop telling them we will oversee theirs because we obviously have no moral high ground to speak on the subject in other countries.","post_message":"Unreal."},{"comment_id":"10154113028645329","commenter_b":"Does this mean we all just became best friends?","commenter_a":"Wow. Completely true. Very accurate quiz.","post_message":"It really will. (via BuzzFeed Quiz)"},{"comment_id":"1516899938343259","commenter_b":"Yet when guys write this type of stuff all women are emotionally hurt ad need to bitch to the moon. Regardless, these women are virtually worthless. Never date a feminists they have nothing to offer a man at all. Zero. Let them die 60 and single","commenter_a":"I can say with 100% honesty that I would avoid every one of those selfish cunts as if they carried the plague. And i feel certain that these are the same daft cunts that will cry about the matriarchy if men were to make an article just like this.","post_message":"\"If someone was quite a weird child, he tends to be a great date.\""}]
