[{"comment_id":"10154990936431600","commenter_b":"#KeepWadeBitches","commenter_a":"bad choice in a head coach, Elway must be smoking weed","post_message":"What do you think Denver Broncos fans?"},{"comment_id":"10155018018037311","commenter_b":"You should not judge unless you walk in their shoes, there are many reasons why they come in and stay illegally, majority work harder then any one born here to make ends meet. They do not get freebies, unless someone is kind and help them. 90% of them just come here to work and work harder then most people. People just talk out of ignorance","commenter_a":"It's too bad all these snowflakes can't distinguish between Immigrants and ILLEGAL Immigrants. The United States has always welcomed legal immigrants who want to come to this country, embrace the culture and make a contribution to the success of this country. We do not welcome people who come like thieves in the night, vote illegally, steal social security benefits, use our schools and hospitals and commit a disproportionate amount of crime. Big Difference. PASS IT ON!!!","post_message":"It calls for immigrants across the country to not attend work, not open their businesses, not spend money or even send their kids to school."},{"comment_id":"1022176817805108","commenter_b":"It really doesn't look like the kind of skirt that could be worn any higher either.","commenter_a":"That skirt is hardly short... Cheerleaders' skirts are much shorter.","post_message":"When this student body president was shamed for a \"too short\" skirt, she wasn't having any of it and her response is epic."},{"comment_id":"10158494825160725","commenter_b":"Why do you care what others do????? It's a saturday. Most people get that day off . dRump loves the bossy bitches. Go grab a pussy","commenter_a":"Get a job/life.You have way to much time on ur hands.","post_message":"Thousands of demonstrators are expected to take to city streets this weekend for the Women's March on Chicago, one day after Donald Trump's inauguration."},{"comment_id":"10154173460986051","commenter_b":"What a bitch and that's why I hate all cops in Los Angeles county","commenter_a":"I hope the lawyer does right and gives the kids family money instead and locks up women and her husband and who ever else was involved because the cops at the scene should of did breathalyzer it's the law when they're a wreck to make sure alcohol or drugs is a factor poor family's who have to Deal with this and prayers the kids family's win big","post_message":"This woman was driving home from a bar when she smashed into three kids. Now she's suing them. Guess what her husband does for a living."},{"comment_id":"1065854716799003","commenter_b":"It looks like a piece of food. Im a Trump supporter. I think these stupid battles between the two are immature and I think making this some huge talking point in the world is exactly why all of us keep electing the wrong people. We care more about a piece of food on someones face then what theyre actually saying. I don't like Cruz. my money is on Trump all the way but we need to all grow up and look at the issues because this isnt Saturday night live. This is real life and the wellbeing of many people is at stake here.","commenter_a":"What about Father's Rights Movement and an overhaul to how child custody and parental time and child support are handled? If elected is Mr. Trump looking at this issue?","post_message":"We will save over $300 billion a year if we properly negotiate our healthcare expenses! #GOPDebate"},{"comment_id":"1368444483166524","commenter_b":"Best line of the day....Hillary: \"RELEASE YOUR TAX RETURNS.\" TRUMP: \"I EMAILED THEM TO YOU.\" HAHAHAHAHA","commenter_a":"One reason I support Trump is not because he knows everything, but because I agree with his position on most things. I like his energy and desire to solve problems, and he seems to be willing to change when something isn't working..unlike most politicians who refuse to admit when they're wrong. However, (and this is an example) when Hillary says he doesn't believe in climate change, he needs to back up his position with facts on why. Sure she can say scientists believe in it..well not all of them do. Trump needs to bring up scientists that don't support that theory. Also I would like to see him release his taxes, so she can't bring it up anymore.","post_message":"'CNBC, Time magazine online polls say Donald Trump won the first presidential debate' via The Washington Times."}]
