[{"comment_id":"1734577893461739","commenter_b":"clinton continues to LIE- wikileaks has proved that-she should be in jail.","commenter_a":"His comeback sounded like something a 3 year old would say","post_message":"Hillary Clinton: \"Well that's because [Putin would] rather have a puppet as president of the United States.\" Donald J. Trump: \"No puppet, no puppet. You're the puppet.\" @webpagelink"},{"comment_id":"10153877529004778","commenter_b":"Yup she's a joke","commenter_a":"Why because they know she going to give them a run for there money..","post_message":"\"Rarely in the history of any criminal case has a prosecutor so directly maintained so many conflicts of interests,\" the motion declares."},{"comment_id":"1594655060832823","commenter_b":"Put her out there in the line of duty unarmed and we'll see how fast her mind changes!!!!!!!","commenter_a":"Impressive stupidity","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"421137708047770","commenter_b":"Lady, you're an idiot!","commenter_a":"Your amazing trying to explain to limited, CNN stupid reporter how dangerous Iran is. Thank god for you! I'd vote 4u any day!","post_message":"ICYMI: I joined The Lead with Jake Tapper to discuss my open letter to the Iranian Government. WATCH:"},{"comment_id":"978940745501376","commenter_b":"Fire Her!","commenter_a":"Forgive them; they know not.....wait, let's not.","post_message":"DISGRACEFUL MSNBC HOST: Katy Tur Speaks over the Star-Spangled Banner at Trump Rally (VIDEO) @webpagelink"},{"comment_id":"10155023002574740","commenter_b":"Leave that girl alone","commenter_a":"Shepard Smith Reporting Donald Trump President of USA doesn't want the media or anyone announcing his plans to defeat Isys enough already of selling our plans out globally, do like Donald Trump says we're going to take action without letting them know when, stop @username with telling Isys our plans","post_message":"The Office of Government Ethics is asking The White House to investigate Kellyanne Conway over her remarks regarding Ivanka Trump and Nordstrom. @webpagelink"},{"comment_id":"10153238960151438","commenter_b":"Ok clark. You win. All lesbians are fat hairy and ugly. That is completely accurate. No bullshit. You are a really smart person. So glad we had this talk.","commenter_a":"why are most queer women obese now thats a question","post_message":"Why don’t queer women flirt with other queer women?"}]
