[{"comment_id":"10152574431526636","commenter_b":"but its ok for females to tell us how to sit? bit sexist.","commenter_a":"Alright, then women have to stop wearing leggings without a skirt..leggings by themselves looks trampy.","post_message":"Men, here's why you should close your legs on public transport..."},{"comment_id":"10158119548295603","commenter_b":"We have to hate ILLEGAL immigrants.... GOT IT!","commenter_a":"Maybe it could be an anti-bullying lesson...? You know, if he says or does anything like he did THOSE OTHER TIMES... That we have recordings and videos of him... Doing horrible things.... And saying horrible things...","post_message":"Thoughts?"},{"comment_id":"715065121964948","commenter_b":"Good luck competing with India and China for FDI by multinational corporations. Unless you guys are okay with working for <US$1 an hour.","commenter_a":"Correct me if I'm wrong, cost of living will rise and NHS is at serious risk........... As far as I can see we're in real trouble!","post_message":"Is #Dexit on the cards? Could Denmark follow Britain? Paul Adams was in Copenhagen where there are already calls for a similar #EURef. You put your questions to him and Eurosceptic Danish pollster Erik Høgh-Sørensen. #FacebookLive"},{"comment_id":"1796249287363379","commenter_b":"Khloe would put this midget bitch on blast.","commenter_a":"So what","post_message":"She really don't like the Kardashians. #WSHH"},{"comment_id":"10153401168701130","commenter_b":"Pussy ... no balls...","commenter_a":"Char Marsh","post_message":"President Obama is a little too used to reacting to shootings. Video: NowThis"},{"comment_id":"1496723690352634","commenter_b":"@username he must have grabbed you by the pussy.","commenter_a":"Same day, taken moments earlier before the rain actually stopped.... Trump holding the umbrella for her, meanwhile Obama has someone else holding it.... just saying maybe look into it before looking so biased","post_message":"See the difference?"},{"comment_id":"626305930908697","commenter_b":"@username Yeah, those toddlers with guns are out of control right now.","commenter_a":"I blame Obama and Bush, Bill and Bush snr for forever labeling all Muslims as terrorists . they didnt know that by doing so they created further hate for Muslims in america and this is the result","post_message":"Kim Kardashian West made her opinion known (via Daily Mail Celebrity)"}]
