[{"comment_id":"10153774603359714","commenter_b":"She needs to resign then!","commenter_a":"Right Fire her..she has a job to do and it was put into law then she should uphold it or go....fundamentalist zealot","post_message":"Kim Davis said she grasped Pope Francis' outstretched hand, and he told her to \"stay strong.\""},{"comment_id":"1337467809657543","commenter_b":"Actually...now.women will do time for....oh what's that word.... MURDER! Hahahahhahahaha","commenter_a":"Abortion happens. Now if it happens in a sterile clinic with a doctor or in a back alley with a coat hanger, it's still going to happen.","post_message":"The so-called \"heartbeat bill\" approved Tuesday would result in what would be one of the most stringent abortion restrictions in America."},{"comment_id":"10154280018188797","commenter_b":"Illegal immigrant aka alien. Im no immigrant nor do i support harboring illegal aliens","commenter_a":"Thank god for her. Thanksgiving is a day to honor a massacre, it's disrespectful to even celebrate the event. Religion is a lie so she is only protecting the best interest of the child, shame on parents who don't. More schools need to follow her lead. She is not the principal of a private Catholic school. She is the principal of a public school. Argument ended","post_message":"NO THANKSGIVING, SANTA, OR PLEDGE: A school principal has banned Santa Claus, Thanksgiving and the Pledge of Allegiance at her school. What do you think?"},{"comment_id":"495211413960969","commenter_b":"What a f****n punk","commenter_a":"He is a psychopath I assume.","post_message":"As for killing Trayvon, he said, \"I believe God has his plans\" F*ck this guy. -Linda"},{"comment_id":"10154692333454203","commenter_b":"EAT ME ASSHOLES!","commenter_a":"Dallas Lavalley","post_message":"This is how Donald J. Trump treats women."},{"comment_id":"10154074342184087","commenter_b":"This woman is demented and willing to win at any price including a race war. I support Trump and I fought America's wars for forty three years from a 17 year old poverty stricken high school dropout to a sixty year old colonel with several academic degrees. I also was a first generation American but also have Native American DNA from my French Canadian and Micmac side. Demonizing me and belittling my service which included the Cuban Missile Blockade, Vietnam, Cold war Germany, Panama, the Gulf War. Bosnia and support for the Iraq War; is the best this lying, corrupt, sick loon can do.","commenter_a":"Generally speaking, 100% of what comes out of Hillary Clinton's mouth is deplorable......","post_message":"\"You know, just to be grossly generalist, you could put half of Trump’s supporters into what I call the basket of deplorables,\" Hillary Clinton said. \"The racist, sexist, homophobic, xenophobic, Islamaphobic — you name it.\""},{"comment_id":"10156095135925389","commenter_b":"Donna I believe bush\"s were much better then the Muslim terrorist we have now!","commenter_a":"I do not want Bernie Sanders, Hillary, or Biden!!! Wake up America we need some one who will fix America!!!","post_message":"Question of the Day: Do you think Bernie Sanders can beat Hillary Clinton in Iowa and New Hampshire?"}]
