[{"comment_id":"473987716059156","commenter_b":"If MUSLIMS want kids to learn about Islam they should move back to the HELL HOLE they came from. In America we believe in separation of religion and state.","commenter_a":"all our schools should ask God back in to their teachings","post_message":"Muslims are up in arms about this new bill affecting religion in schools in Tennessee. I wonder how far they'll challenge it."},{"comment_id":"827089443993145","commenter_b":"First Lady??? Really","commenter_a":"Ignore ....WHAT A WASTE OF CIVILATION","post_message":"Is she serious?"},{"comment_id":"10152949521626051","commenter_b":"she is not a mother no mother puts a man before her kids . sick bitch","commenter_a":"Wonderful Mom!!!! She should be locked up !!!!","post_message":"Every night this little girl has to lock her bedroom door so that the child molester who lives with her mother can't get to her."},{"comment_id":"10154273453111509","commenter_b":"Same thing is happening here in the US","commenter_a":"This is what happens when the liberal party's refuse to listen to the people. They don't want any more migrants.","post_message":"France's far-right Front National party has made gains in the wake of the #Paris attacks."},{"comment_id":"1221745097868321","commenter_b":"Send her out to pasture","commenter_a":"The dumbest women in the world","post_message":"Pelosi says Clinton only lost because of Comey and the FBI investigation. Do you think Democrats are being sore losers?"},{"comment_id":"10153330405506130","commenter_b":"Exactly. Plus her job is simply to determine if a couple qualify for marriage under the law, not to marry them. She isn't advocating gay marriage by signing the licenses, her signature simply states they are lawfully allowed to wed. Her fucking religious views don't even apply to her job, the fucktard! She is simply trying to use religion to justify her bigoted attempt to judge others and not do her job. She is an employee of her state/county, and bound to the law. If she wants to have her religious views dictate her job she needs to be a clerk for a church. Then she can be a bigot all she wants.","commenter_a":"She is a public servant...to serve ALL the people...not just the ones she agrees with...there's a little thing called \"separation of church and state\"...","post_message":"\"We cannot be held hostage to the theatrics of religious extremists.\""},{"comment_id":"10152866241386094","commenter_b":"So what planet will the money mongers move to when this planet will not support human life?","commenter_a":"...while not witnessing the irony of the capitalist market as the driver of climate change… says nothing of the oil gas, mining, food industry's culpability in this mass earth murder","post_message":"Planetary distress has become the new normal."}]
