[{"comment_id":"1507272636242022","commenter_b":"@username, that is exactly what Americans are so angry about , is our own traitorous bunches of Bureaucratic terrorists that not only has funded but brought into our own country on our own American soil, these terrorists that they somehow continue to push on the public and is why Trump stood up and heard American peoples complaint, not one politician up in that white house is a true American, or else they would have long ago removed the terrorists as well as not funded them with the peoples hard earned tax dollars, all Trump is saying is know whom we are allowing into our country, something the now Manics in the white house are not doing..","commenter_a":"Yeah Donald Trump is protecting Americans. Maybe if some of his supporters read a little about Hitler and Nazi Germany, they would see some similarities. I mean, the Jews and Communists were plotting against the Germans, right? They did start that tragic Reichstag fire, didn't they? Oh! And let's not forget the gay people and the mentally ill! America has a problem with them too! Yeah and women too. We've just gotten all uppity during the last 40 years, trying to steal men's jobs. Send us away too. And while we're at it, let's round up the Japanese again. I mean, they attacked us once, what's to stop them from doing it again? Of course, we should forget they were mostly citizens and born here! It absolutely amazes me how many people believe this!!! It's unamerican! It's dangerous. When you start sending a group of people off like that, where ...","post_message":"This is one of the most powerful segments we've ever seen. Tom Brokaw compares Donald Trump's call to bar Muslims from America to Japanese internment, Nazi Germany, McCarthyism, and Jim Crow - and he didn't stop there. This amazing video is well worth taking a moment to watch, via NBC News"},{"comment_id":"10156148528265725","commenter_b":"Trump has the mentality of an 8 year old class bully","commenter_a":"Suzanna Mikolajczak Trump is a Beast","post_message":"I think Megyn Kelly should take another eleven day \"unscheduled\" vacation."},{"comment_id":"10152861814749753","commenter_b":"Same little bitch.","commenter_a":"How utterly sad and horrifying for the bird and it's owners. It is a proven fact that people who will torture and kill animals have no qualms in \"upgrading\" to humans. These kids need deep and immense counseling while sitting behind bars for about 6 to 10 years","post_message":"Police say this 18-year-old high school football player stole the pet emu from a neighbor's pen, tortured the animal, gouged out its eyes and then beat it to death. How should he be punished?"},{"comment_id":"508257596043081","commenter_b":"His wife destroyed that college but gave herself $200k severance pay. They are crooks","commenter_a":"If Sanders were to be nominated and elected in Nov, big problem is that he has not raised money, or campaigned for, congressional Democratic candidates. In other words, Sanders will be no better off than Obama has been if he can't get enough members of Congress to pass his initiatives.","post_message":"The attacks are going to get more unhinged."},{"comment_id":"1591225437848101","commenter_b":"You can leave too lady.","commenter_a":"This is totally wrong you don't disrespect the flag our the National Anthem . Good they would never play another down","post_message":"High-school football players in New Jersey, Alabama and Massachusetts, replicating Colin Kaepernick's protest, are facing suspension from school."},{"comment_id":"10154391866961130","commenter_b":"One track mind girl!","commenter_a":"lawd hep us!!","post_message":"Mazel tov for (unintentionally) making us laugh before the election."},{"comment_id":"435485493243158","commenter_b":"Criminals don't get one...why require them for law abiding citizens","commenter_a":"i cannot believe how brainwashed and idiotic everyone is, you actually believe concealing more weapons, allowing no permits and actually believing it is the right thing to do because its in your constitution is fucking ridiculous, lets see how many more kids are massacred in schools now that shooters can conceal their weapons","post_message":"Good idea?"}]
