[{"comment_id":"969458729761266","commenter_b":"Eat a dick,you stupid bitch.I do have personal pictures on my page that's how much you know.","commenter_a":"And you, @username, are an asshole, and so fugly you don't have the balls to post a real pic.","post_message":"Michelle Obama is simply the best First Lady ever."},{"comment_id":"10154888080729099","commenter_b":"@username idiot","commenter_a":"Yorkshire UK. Police shot a person the other Day, Last time they shot someone was 6 years ago.","post_message":"Breaking News: Police have shot and killed a man in Prospect Heights. The shooting comes less than 12 hours after an NYPD officer fatally shot a man in Canarsie @webpagelink"},{"comment_id":"466923970098864","commenter_b":"Do not let the Muslims take over our great country with their agenda. I'd look terrible in a burka!","commenter_a":"Carson is right!!!","post_message":"A major American Muslim group says Ben Carson should drop out of the presidential race unless he apologizes for saying Muslims shouldn't be president. Do you think Carson should comply with their request? Via Opposing Views"},{"comment_id":"10154190661067541","commenter_b":"Now that's an ugly women","commenter_a":"Bannon you are a lot better looking than that thing in the left.","post_message":"Steve Bannon has a doppelganger, and her name is Rosie O'Donnell."},{"comment_id":"720244888107018","commenter_b":"they ran out on their bill and stiffed the waitress , who had to pay it from her own pocket ... THAT'S why they want to raise min . wage to 15, so waitresses at diners can afford to pay the tabs of these deadbeats","commenter_a":"LMBO","post_message":"Who paid the bill?"},{"comment_id":"1522438461149611","commenter_b":"OMG!! She has loads and loads of BULLSHIT in there!!!","commenter_a":"GOT METH?","post_message":"There's been lots of speculation about what might be ailing Hillary Clinton, if anything. One dental expert took a look inside Hillary's mouth... and almost instantly, he said he knew the condition that's been causing all of her health problems. Could this expert be right?"},{"comment_id":"929340743844610","commenter_b":"Unfortunately, it will only get worse if lying, cheating, Hillary gets in the White House. God Bless us all.","commenter_a":"Time can't pass fast enough until he is gone and out of office!! He is such a disgrace to this great nation!!! I would love to see him locked up for all of his crimes that he has commented on the people!! TRUMP is the only hope we have...Hillary will be even worse than Obama!!!","post_message":"Obama Admin Gives Homeless Vets The Finger; Housing Illegals at Military Base Instead.... Obama is like Colin Kaepernick... Hates America, Hates our Flag and HATES the people in the US Military who defend it. Then Cries racism at every corner while becoming RICH from it."}]
