[{"comment_id":"10153108961506491","commenter_b":"Who cares ,whatever the case, he's richer than me ...who are we to judge and worry about how much money somebody has in their pockets ? .He has more money than any of us here writing crap on Facebook .","commenter_a":" keep teaching them cause it's obvious, America thinks we come from space!","post_message":"Bill Gates barely holds a candle."},{"comment_id":"1163328470392328","commenter_b":"A worthless bitch","commenter_a":"She is an amazing woman that should be admired. A class act.","post_message":"First Lady Michelle Obama continues to top lists of most admired women in the world. Do you admire her?"},{"comment_id":"10153597366220329","commenter_b":"Like we're met to be best friends lol","commenter_a":"Craig! I still think it's you.","post_message":"It's not me, it's your god damn chargers."},{"comment_id":"10152926517991491","commenter_b":"A predator is a predator no matter what age they are. I'll bet kids who murder should get away with it based on naivety and hormones too right? Hormones drive alot in a human beings, including aggression, so thats an excuse I guess.","commenter_a":"Go figure. Anti-gay bigot who thinks gays are predators is a predator himself. So much self projection among the religious.","post_message":"“I would do anything to go back to those teen years and take different actions.”"},{"comment_id":"10154251674646636","commenter_b":"O don't back benefit sanctions , however if your gonna make a living out of claiming benefits do the job right , simple as","commenter_a":"He has a sighted carer (his brother) who opens all his mail and should have done it. Obviously they had never requested braille correspondence. So on that aspect I (for once) can't fault the DSS however to not reinstate the money after they appealed the decision is just ridiculous.","post_message":"Awful"},{"comment_id":"10153520477923132","commenter_b":"Those freaks should have never been on TV anyway!!","commenter_a":"Yep thy absolutely should. Should never have a show on the air that advocates bigotry and hatred while showing women as animals for breeding purposes that are be owned. Also the show advocates for having more children than you can afford (unless you have a reality show to pay the bills) and more kids than you can physically and emotionally take care of.","post_message":"Do you think TLC should cancel 19 Kids and Counting?"},{"comment_id":"10153163452101770","commenter_b":"sick thugs","commenter_a":"Good! Time to show respect..","post_message":"Two students who attend a public high school in small-town Tennessee are reportedly spending the first weekend in December in jail because they wore saggy pants to school one too many times."}]
