[{"comment_id":"1181889591889575","commenter_b":"Disgusting, disrespectful pigs. They should kiss the ground they walk on and be grateful to be here instead of the hellhole they came from. However, maybe they should go back. They laugh at us, the stupid Americans that clothe and feed them not to mention housing and oh yes, the free education!!!!! Filthy people.","commenter_a":"Go away...","post_message":"A Muslim family is going viral in a bad way after they made a SHOCKING move while the National Anthem played... this is NOT good. Now that the video is out, they probably wish they had never done this..."},{"comment_id":"10153321709602217","commenter_b":"shes dissolving the trends in the fashion world","commenter_a":"Nigeria is looking for their 2016 budget","post_message":"She's fronting a campaign called the \"Face of Courage\"."},{"comment_id":"10154233668643132","commenter_b":"Michelle Lena Butler idiots on both sides.","commenter_a":"Why is a 50 year old and a 47 year old trying to even reproduce? Can their be laws against that please?","post_message":"\"I can't afford Melissa's doctor visits . . . I don't think I can afford the babies, so I just want to abort all three babies.\""},{"comment_id":"1478284585520531","commenter_b":"@username At least he loves and respects Americans, which clearly you are not....Does not have the blood on his hands like Hillary of 114 people and counting.....Maybe you want him to destroy us, but, when he does you'll be right there with us all...Let all these illegals come live with you!!!","commenter_a":"This has got to stop!!!! Please read the following.. John Miech *Here is something to think about**, and why so many Americans support Donald Trump !!* (This information has all been checked, then double checked... it is 100% Correct.) That's why there is such an alarm within US government, since Trump's statement about temporary suspension of migration of Muslims to US till US authorities make sure there is a proper concept of safe penetration of US territory. People are stunned to learn that the head of the U.S. CIA is a Muslim! Do hope this wakes up some! You mean until it hits you like a ton of bricks read it again, until you understand! We now have a Muslim government. @username, current head of the CIA converted to Islam while stationed in Saudi Arabia. Obama's top adviser, Valerie Jarrett, is a Muslim who was born in Iran where her ...","post_message":"Do you know what the actual percentage of money the Clinton Foundation has raised that they donate so far to charity is? It's like 5%."},{"comment_id":"1158796597473702","commenter_b":"She was having a PRIVATE conversation with her son! It is no one else's business!!!! She quite clearly stated she speaks English!!! Read the article people!!! So stating that immigrants should learn the native language in this situation is redundant!","commenter_a":"We speak many different languages in America.","post_message":"The woman was speaking with her son in Spanish while celebrating his birthday when a stranger interrupted to tell them, \"We speak English in America.\""},{"comment_id":"10153097402831748","commenter_b":"Michael Savage you are an ignorant swine prejudice d Jewish imigrant not worthy of comment. You are inciting racial war!","commenter_a":"And you may as well be...oh hell-I can't think of anyone that I want to insult that badly. You are in your very own camp of What-the-hell??","post_message":"Michael Savage asserts \"[Obama] may as well be Charles Manson” for inciting racial tension in America."},{"comment_id":"1317571668339082","commenter_b":"Same base of people that have supported him all along - not enough!","commenter_a":"Uhm, Trump is not losing support. Did you not see the amount of people that showed up to his rally today?? You've got to be joking!! He spoke to at least 25K people. And there were still people outside whom the fire Marshall would not allow in!!","post_message":"The National Rifle Association has spent more than $21 million on the presidential race, praising Donald J. Trump and knocking Hillary Clinton."}]
