[{"comment_id":"10154424065382885","commenter_b":"If I'm not mistaken your authorized to wear awards from other services you earned. I know in my unit former Marines would wear their aviation badges.","commenter_a":"The officer in this picture is wearing a Navy Fleet Marine Force Breast insignia, Navy Conduct Medal, Navy and Marine Corps Achievement Medal ... weird","post_message":""},{"comment_id":"10153423597850779","commenter_b":"Who is that chick on the left","commenter_a":"Sasha Banks, who is the by far the best wrestler male or female in the WWE, is Snoop's first cousin. I'm guessing a storyline should emerge.","post_message":"WWE has confirmed that Snoop Dogg will be inducted into the WWE Hall of Fame's celebrity wing, joining a list of alumni that includes Pete Rose, Mike Tyson, Arnold Schwarzenegger and Donald J. Trump."},{"comment_id":"10154096088722373","commenter_b":"a monstrous buffoon!!","commenter_a":"I agree Senator! So where have you been while former Presidents, candidates and officials broke the law? President Obama ruled by EO so Trump is picking up where his predessor left off. Just going at it from different direction. We need to get back to changing law via legislative process rather than by fiat.","post_message":"Donald Trump is going to have to learn, in one way or another, the very important truth recently stated by the Attorney General of Washington, Bob Ferguson: \"We are a nation of laws. Not even the president can violate the constitution. No one is above the law, not even the president.\""},{"comment_id":"898024070290648","commenter_b":"Scum","commenter_a":"What an ass","post_message":"Never, really?! Last night's theater shooting was a preventable tragedy. Louisiana has the weakest gun laws in the country, and one of the highest rates of gun violence. Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"521485418039751","commenter_b":"Caitlyn Jenner is a repudlicrat.","commenter_a":"Who wants a killer around them and yes HE killed someone","post_message":"'Transphobic'... Republican-hating... CONFUSION!!!"},{"comment_id":"10153660734489726","commenter_b":"what a mess she is!","commenter_a":"You mean murder!!!","post_message":"WATCH: Goldberg: Planned Parenthood Founded for Abortions"},{"comment_id":"10153130571029726","commenter_b":"Is that considered a rhetorical question? I think you know, and I'll add that all those girls need to be caged.","commenter_a":"Animals.","post_message":"VIDEO RAW footage of 4 teens viciously beating a girl in Brooklyn McDonald's as a crowd cheers them on. Why do parts of society cheer and take pleasure from this type of sheer brutality?"}]
