[{"comment_id":"465830173607563","commenter_b":"Bossy bitch!","commenter_a":"Just ban Michelle.","post_message":"Should We Ban This Word To Please Michelle? Comment 'yes' or 'no'."},{"comment_id":"10155216029445500","commenter_b":"Coyotes are indigenous to our state all states. They were driven put west because of our industrialization. Now they have learned how to co- exist with man and have migrated to the east again. Warning - maybe coyotes will make owners stop using this awful leashes the retract and maybe we as a society will begin to respect all animals better . Coyotes are as afraid of is as we are of them bit put a tractable leash on a small dig ad watch an eagle , hawk or coyote take it. Adjust your human responses and behav avoid","commenter_a":"The.coyotes have a human problem. Keep your pets inside. We were the ones who came and stole the land they called home. You have to attempt to keep in mind they are there and adjust a little","post_message":"HEADS UP: Pasco residents say coyotes wandering the streets have been killing their pets. It's almost \"pup\" season, so they travel and hunt more. Here's what you should do if you see a coyote: @webpagelink"},{"comment_id":"963821730369705","commenter_b":"we need Ben Carson to give us hope.","commenter_a":"Liberals did it.","post_message":"MIT professor and noted left-wing academic Noam Chomsky attributes Donald Trump’s wild popularity to “fear, and the breakdown of society during the neoliberal period.”"},{"comment_id":"10153039009502217","commenter_b":"The pussy is slanted trust me","commenter_a":"Tradicional woman japannese, very good","post_message":"Japan really isn't that strange"},{"comment_id":"10153310405423352","commenter_b":"Girl that's me","commenter_a":"I'm my own team.. Fuck that, once u have a kids, a career and a life them damn friends ain't shit... I'll kick it with all the damn kids","post_message":"Atlanta Woman Says She Was Set Up By Her Bestfriends Who Beat Her And Held Her Hostage For Hours (VIDEO) Be careful who you consider your \"friends\"...So sad, they literally left her for dead."},{"comment_id":"10155016645768010","commenter_b":"Let's keep in mind the big picture here. Less illegals, the better.","commenter_a":"As we've learned from all his businesses, failures and bankruptcies...he is very good at spending other people's money.","post_message":"He wants to get Mexico to reimburse the U.S."},{"comment_id":"483898831770072","commenter_b":"@username Whoa, calm down woman.","commenter_a":"They could just import it from Iran. I wonder what's stopping that great deal?","post_message":"Italian caviar, that is."}]
