[{"comment_id":"1133469633342492","commenter_b":"Women's bathrooms have that too bc some haven't mastered the art of hovering. Then add on period stuff.","commenter_a":"Joke's on you, pal. Men's public bathrooms are usually pretty disgusting.","post_message":"This. Is. AMAZING."},{"comment_id":"10153482509219714","commenter_b":"The girl is a faker","commenter_a":"Once you go black you don't go back. She took it out of context.","post_message":"NAACP leader Rachel Dolezal is speaking out in the wake of controversy."},{"comment_id":"10154271758836336","commenter_b":"oh god, its attack of the uneducated middle aged housewives!","commenter_a":"bush is guilty of actual war crimes, but no, lets just crusade against a democrat because they are a democrat. you retards disgust me.","post_message":"BREAKING NEWS: The infamous Romanian hacker known as “Guccifer,” speaking EXCLUSIVELY with Fox News, claims he easily – and repeatedly – breached former Secretary of State Hillary Clinton’s personal email server in early 2013."},{"comment_id":"494096337456103","commenter_b":"Thank you San Diego Border Patrol for stopping these two.","commenter_a":"Aren't they lovely.","post_message":"BREAKING: Johnny Lewis Hartley, 39, and Mercy Mary Becerra, 43, were arrested midday Tuesday and are being held on suspicion of murder and child cruelty. When they tried to cross at the San Ysidro Port of Entry, Mexican authorities found the body of a 2-year-old child inside a duffel bag that Hartley had. \"The incident may have occurred in Whittier,\" San Diego police said."},{"comment_id":"952148034847314","commenter_b":"How LOW can you go? What a dirtbag!","commenter_a":"Public Square Hanging is well deserved.","post_message":"EXPLOSIVE: Thief Stole Veteran Gravestones to Make Granite Flooring at His Home (VIDEO) @webpagelink"},{"comment_id":"910131575844085","commenter_b":"It should NOT be given to illegal aliens #1. It should not be a life time money train #2.","commenter_a":"Unfair.The middle class working people can no longer pay for these people to watch TV all day and do nothing. Now when we die out because of Obamcare.they too will die behind us.","post_message":"Welfare recipients just got hit with some devestating news. The party is coming to crashing halt. Do you think it should be illegal to live off other people's hard work?"},{"comment_id":"1168129036575432","commenter_b":"@username, I'm not voting for Hillary and if you want to call me a monkey you can meet me outside any military base and we can handle this.","commenter_a":"Hillary is an evil narcissist, a pathological liar, a Corporatist, Bilderberg member, the Whore of Wallstreet, Queen of Corruption, & Ultimate Establishment Candidate. The DNC shoved her down our throat & cheated. Her supporters are dumber than NeoCons. Trump being terrible is no excuse for anything she's done. She can go to Hell. We'd rather vote for Jill who has no chance than put our names behind either of the scumbags running.","post_message":"The differences between Hillary Clinton and Donald Trump on the real issues impacting the middle class and working families of this country are very clear."}]
