[{"comment_id":"10154787328718984","commenter_b":"Perhaps she should have kept her mouth shut and the White House wouldn't have to protect her!!","commenter_a":"BS....houses don't talk. We are about to witness the biggest revolt on DC and heads will be rolling. Trump will clean house literally. The most crooked leaders plus the worst media in the world. People are po'ed and WE aren't going to take it anymore.","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."},{"comment_id":"1073538729332546","commenter_b":"Terri must not have kids to make a statement like she or he made. Shame on you putting the blame on the mother.","commenter_a":"School needs to be held accountable and the bus driver for forcing her off. This can never happen to another child. They are lucky the right person found this child and returned her.","post_message":"A #Seattle bus driver is now off his route --- after a 7-year-old was found wandering Capitol Hill, crying. >> kiro.tv/WrongStop"},{"comment_id":"711989458991632","commenter_b":"So you are saying if all guns were banned from legal americans the secret service would not need any guns? You obviously are another liberal idiot. Again shit for brains, criminals don't get their weapons legally. They will still get weapons illegally & then what are they going to use against an illegal weapon, throw cans of green beans & peas at them? Throw rocks at them? Why do liberal idiots refuse to understand CRIMINALS DON'T BUY WEAPONS PER SAY AT GUN SHOPS.","commenter_a":"Let's start at the very top and ban those guns that the SService are carrying all around Obama","post_message":"President Obama is taking guns out of all forms of entertainment. This is ridiculous. He can't get away with this. Do you think he is abusing his power to push his propaganda?"},{"comment_id":"10153330953062452","commenter_b":"Stay out of this Stephanie Mullins","commenter_a":"Great. Now it'll be legal for California to smell worse than just smog and congestion. ***Disclaimer*** This comment was made in sarcastic jest. If you're offended by this joke, clearly you cannot comprehend sarcasm over the internet. Avoid replying if you're offended. You'll just make yourself look as stupid as the halfbreeds of Offended By Everything 2015. #PSA #TheMoreYouKnow #CalmYourTitsAndTokeYourHits","post_message":"Is California going to pot? The push to legalize recreational marijuana use in the state just got a big boost. The California Medical Association is giving the proposed ballot initiative a big thumbs up. abc7.la/20oIUO6 So, should adults 21 and over be able to buy and smoke weed?"},{"comment_id":"10153174741786323","commenter_b":"English people are NOT being RACIST. They dont go to places to live eg Spain. Greece. Australia etc and expect that country to cater to them. You go to a country you respect their way of life. They need to learn English. I used to love the golly on the jam jar brooches. All gone because of so called RACISM. This is a little island. Anyone with a criminal rec ord should not be allowed here and those that commit a crime need to be returned to their homeland. We pay NI out of our wages- not to support freeloaders who offer nothing to this country. What was beautiful historic church buildings-turned into Indian Temples. English Heritage is being destroyed!! Polish people have turned this country in areas to little Polands and this Government have let them. BNP want this country to be ENGLAND and ENGLISH laws and those that ...","commenter_a":"If a white person doesn't roll over and submit, he's a racist.","post_message":"\"Facts in themselves are neutral but their interpretation certainly isn’t. And while on their own facts cannot be racist, the way they are chosen certainly can be.\""},{"comment_id":"10154575462084714","commenter_b":"No, a set is 3 games. They lost one game in a set, which is the only time they've lost in Rio.","commenter_a":"But did she win??!","post_message":""},{"comment_id":"1203529499735652","commenter_b":"Shut the fuck up","commenter_a":"I guess none of you that are bashing Trump know enough history to know that China has a pattern of testing US resolve after every election. (usually between feb and march) Trump brilliantly turned the tables on them. It will be even clearer when she visits trump next month. Chinese government has a mouth that writes checks it can't cash and Trump has called their bluff.","post_message":""}]
