[{"comment_id":"726323540858316","commenter_b":"Meryl shut your hole, no one cares what you have to say. Matter of fact put your money in California and pay their way. You are a dried up old hag from the movies and you didn't get their by yourself. We put you there. Get the hell over it and go get laid. LOL you probably can't even get that.","commenter_a":"Dodo. She will not only in be hibernation but soon will be extinct","post_message":""},{"comment_id":"10153806284196509","commenter_b":"He is representing the USA is a PATRIOT with money. MANY MANY AMERICANS R Rich! PRAISE GOD WHOM ALL BLESSINGS FALL! RICH People make employment for others! RICH people can pay well & most do! Rich people donate to causes that heal, give to the poor, spread for GOOD! They are AMERICAN CITIZENS with opinions that this country needs fueled now!","commenter_a":"TRUMP is an AMERICAN that is ENTITLED to a VOICE! We support TRUMP!","post_message":"Both co-hosts of Miss USA, Cheryl Burke and Thomas Roberts, have pulled out of the pageant in light of recent comments from Donald J. Trump. @webpagelink"},{"comment_id":"1036464773060661","commenter_b":"Their idiots!!","commenter_a":"Keyword: Care. Democrats generally care for the American people, Republicans only care for their special interest groups, their corporate friends, and anyone else that can boost the thickness of their wallets. Conservative is a joke... conserve what? Anything that helps them and not the the country as a whole.","post_message":"ZING!"},{"comment_id":"858528920935448","commenter_b":"Sarah Dingle, how do you (or any Arabs or Muslims) have the courage to speak of apartheid when ISLAMIC COUNTRIES ARE WELL-KNOWN FOR THEIR GENDER-SEGREGATED SOCIEITES? That really laughable!","commenter_a":"If any Country refuses to compete in a friendly or qualifying tournament or bans others for racial reasons. They should be banned from all worldwide competitions! This is 2015!! Time to stop the hate against Israel!!","post_message":"Israel judokas were not allowed to compete in Abu Dhabi with the Israel flag on their judo uniform."},{"comment_id":"1528186400555160","commenter_b":"Thank you!","commenter_a":"THE FREEDOM OF THE PRESS is more basic to the RIGHTS of Americans than; the right to bear arms to defend. When the constitution was written it took two conventions to come up with ten amendments, BUT the first amendment was the same not changed and was readily adopted as others were still being picked and discussed. THE BILL OF RIGHTS Amendment I Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the PRESS; or the right of the people peaceably to assemble, and to petition the government for a redress of grievances","post_message":"Sean Hannity wants to destroy freedom of the press by punishing any news outlet that told the ugly truth about Donald Trump."},{"comment_id":"1758399887778329","commenter_b":"Hillary Clinton is as corrupt as they come, she needs to be held accountable and put in a prison cell. Corruption in Washington is running rampant and WE THE PEOPLE are sick of it.","commenter_a":"Lol... At least she appears to be truthful with her daughter","post_message":"Hillary Clinton told her daughter in an email that there was a terror attack in Benghazi, according to an email provided to the Benghazi Select Committee. @webpagelink The GOP-led committee will discuss the report in a news conference at 10a ET."},{"comment_id":"10153239404845329","commenter_b":"If a women wants to hate on men and bring them down, she is not a feminist no matter how much she claims to be. Feminists just want complete gender equality!","commenter_a":"I'm pretty sure that most men aren't like \"rape is so cool bruh, I'm going raping this weekend bruh, you coming?\" Stop lol And not all men get all \"EEEEEKKK\" about periods. Personally, I can listen to my female friends talk about it and not even get slightly sick.","post_message":"\"Imagine if men were as disgusted with rape as they are with periods.\""}]
