[{"comment_id":"10152938422949877","commenter_b":"girl shut up","commenter_a":"#foodforthought","post_message":"Half Of Atlanta's Newly Diagnosed HIV Patients Have AIDS, Study Finds. Read more on these staggering numbers out of Atlanta. Grio fam, share your thoughts on what needs to happen to reverse this."},{"comment_id":"10153193599506770","commenter_b":"I think Audrey had her brain aborted !","commenter_a":"Will she have an abortion since Grandma Hillary wants everybody to have abortions.","post_message":"Hillary's going to be a grandma again."},{"comment_id":"1353803527975767","commenter_b":"Lock there asses up!","commenter_a":"Lol look how racist worded the article. If it were a black victim and white captors u know this headline would of been completely different hahaha hypocritical libs","post_message":"Four teenagers tortured a person with disabilities and streamed the horrific attack on Facebook Live. WARNING: Graphic footage."},{"comment_id":"10153498381391523","commenter_b":"Someone needs to throw this evil bitch out of a car. The same way she did to these innocent pups.","commenter_a":"Awe poor baby","post_message":"A woman let three dogs out of her vehicle and sped off on Farmlane Drive in Slinger -- with the dogs chasing after her. Now, police are searching for answers. Please spread the word."},{"comment_id":"10153072153096157","commenter_b":"If you're here Illegally you Wil pay the consequences. Deportation!","commenter_a":"stupid question any of u talkers served","post_message":"The ICE operation would begin as soon as next month and would likely affect hundreds of immigrants who fled violence in Central America."},{"comment_id":"10153255366409205","commenter_b":"You still had a chance to recognize the genders and learned from them, yes you are lucky that child is not!","commenter_a":"Justice! How about the child? Without father and stock at the house with 2 mothers? What kind of justice is this. Most of us grow up with family mother and father on site and easy for u to say is justified!","post_message":"JUSTICE! Lesbian Couple Gets Their Child Back"},{"comment_id":"1210447342329069","commenter_b":"@username you are the brain washes moron if you believe the bs","commenter_a":"Of course republicans are pissed that Obama got those prisoners freed... They wanted those people to be killed thus becoming martyrs so they could use it as another excuse to go to war... And anything positive Obama does deflates their efforts to talk shit and make him look bad...","post_message":"Things just got VERY awkward for Obama's Iran critics."}]
