[{"comment_id":"10153544587506350","commenter_b":"Real women dont need all that! They are content with the gift of life they just grew in their body for months!!!! This is a little overkill.","commenter_a":"Oh good grief...isn't the baby enough to show off? Must one be materialistic to have to have a push ring?","post_message":"Push presents (the bling or gift an expectant mom is given for, um, pushing) are getting more and more popular."},{"comment_id":"10154735959309575","commenter_b":"How fatherly of him to want to murder his kids along with himself. SMH! This world is SICK.","commenter_a":"for the children and the family God bless them","post_message":"A 1-year-old boy and a 3-year-old boy survived after their dad threw them off a 100-foot bridge during a murder-suicide attempt. They suffered concussions but were awake and conscious when police arrived."},{"comment_id":"717054201797155","commenter_b":"Yeah, she'll get sammich stains all over the front.","commenter_a":"That's a strange dress to wear in a kitchen... Doesn't she know women are better off today than being nothing more than owned objects","post_message":"Kellyanne Conway dressed as the era Trump wants to take America back to. #InaugurationDay"},{"comment_id":"788206447982585","commenter_b":"The trump train is heading for the trump wall. toot toot.","commenter_a":"Hurry Hillary call Wall Street call @username call AL Sharpton because your gunna need all the help you can get. The Trump Train is rolling straight for the White House !!!","post_message":"Hillary Clinton and her allies are preparing for the fight against Donald J. Trump."},{"comment_id":"460205810854230","commenter_b":"The law should be to only give welfare to an American citizen. Then, take the American abusers off of welfare.","commenter_a":"But not as much as those in government office positions of welfare.","post_message":"The average immigrant household consumes 33% more in cash welfare, 57% more in food assistance, and 44% more in Medicaid, according to a new study by The Center for Immigration Studies."},{"comment_id":"10155151069049575","commenter_b":"If she can't raise her kid right she should have not ever been pregnant","commenter_a":"Single moms struggling to pay bills and work where she has to work long days just get by on 8.00 dollars an hour with no time left for teenagers out of control who know everything, i vote with helping the mom , the hardest job on any day.","post_message":"Teen who was among five arrested in downtown fights Saturday night admits she needs help. 16-year-old describes it as, \"scariest night\" of her life."},{"comment_id":"10153143993045329","commenter_b":"That poor girl would eat both of you.","commenter_a":"@username @username Gerard Bravo 'Plus size' is where it's at.","post_message":""}]
