[{"comment_id":"10153597568671770","commenter_b":"What is different with her from other females?","commenter_a":"Wonder what his wife thinks about that . He just wants attention . Think he is obsessed with Taylor !!!!! Or just trying to piss you off .","post_message":"She is mad..."},{"comment_id":"10155255088631037","commenter_b":"Don't hate cause I'm not morbidly obese","commenter_a":"Where are all those kind hearted liberals who are protecting the refugees now?, you all show your true colors you will snub a American Woman just because of the job her dad has.. This is why the DNC is a sinking ship. Just look at all the red republican states now.","post_message":"Did Whoopi Goldberg think this is how Tiffany would react?"},{"comment_id":"1364548750229953","commenter_b":"Anything above .22 caliber is illegal expect where permitted by law, and by law I mean hunting clubs that bend the rules. Open carrying is restricted to law officials only. But yeah that sure stopped the cartels from getting their hands on em","commenter_a":"What about bad/psychotic people with gun permits and guns purchased legally? The system is a joke... How can you really determine good/bad ppl...","post_message":"The Dallas police chief says he is concerned about open carry laws. \"We don't know who the good guy is versus who the bad guy is if everybody starts shooting,\" he said."},{"comment_id":"1055483257833554","commenter_b":"Hell no lol","commenter_a":"@username Marcela Guzman-Medina","post_message":"NIGHTMARE: What began as a normal day at the beach ended with amputation after a man contracted a flesh-eating virus."},{"comment_id":"697839387073306","commenter_b":"She should have been arrested months ago!!!! Arrest her now and put her away for good!","commenter_a":"Our Justice Department is corrupt. They will not take appropriate action.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"},{"comment_id":"944371082289036","commenter_b":"pig stupid bitch","commenter_a":"ass","post_message":"Conservatives really are the worst kind of people."},{"comment_id":"1470713222988421","commenter_b":"Typical British woman. No morals, no values.","commenter_a":"Is this worthy of a news item? I think not.","post_message":"She text him the picture weeks later after not seeing him again"}]
