[{"comment_id":"10153136894823145","commenter_b":"Bottom line do what the officer says and don't talk back. The girl kept running her mouth to him. My child would have got in trouble by me for talking back the way she was.","commenter_a":"The only good cop is a dead cop","post_message":"Here's 5 things to know about the Texas officer seen on a viral video breaking up a disturbance at a pool party. #WFTV Watch the video here: @webpagelink"},{"comment_id":"10155182239718984","commenter_b":"Go to hell BITCH","commenter_a":"Let the criminals out. Let illegals in. Let boys in the girls bathrooms. Condemn police officers. Persecute Christians. Don't care about the veterans. Pervert the children. Kill the unborn. Stomp on and burn the American flag. Accept barbarity in the name of Islam. Protect the Sanctuary cities. Cuddle the lazy. Encourage hate crimes. Destroy properties. That's the liberal way!","post_message":"Nancy Pelosi just dropped a lot of jaws with what she had to say about impeachment. Donald Trump will definitely want to hear about this..."},{"comment_id":"1908531226047249","commenter_b":"But where is Hillary?? This would have more weight if she were working with you","commenter_a":"Yes the people voted and they voted for CLINTON by over 2.5 Million votes!!!!","post_message":"The fight for #Recount2016 continues! We deserve a voting system we can trust, that is accurate, secure and just. Despite the sabotage, political cronyism, bureaucratic hurdles, economic extortion, and legal maneuvering that has been thrown in our way, this historic first-ever multi-state presidential recount carries on. I'm here to give you the latest updates, answer your questions, and talk about next steps."},{"comment_id":"555507287934896","commenter_b":"I'll flip it back and not shop there until the board fires her","commenter_a":"Time to switch to Costco.","post_message":"What do you think of this?"},{"comment_id":"1105423922847469","commenter_b":"Bitchhhh","commenter_a":"@username best of the world's ladies !!!!","post_message":"This isn't who we are, and it also isn't how we keep America safe."},{"comment_id":"1773311049564873","commenter_b":"Jerk","commenter_a":"Mitt Romney should be quiet. I worked very hard for him, was sick when he lost to Obama mostly because he would not fight back. He broke a lot of hearts the way he ran and loss. He has absolutely no RIGHT to open his mouth now. I am angry at him.","post_message":"Mitt Romney wants Donald Trump as FAR from the White House as possible... but nobody thought he would go this far to accomplish it. Is Mitt Romney irrelevant?"},{"comment_id":"10153203727769342","commenter_b":"Way to go ladies","commenter_a":"Smdh","post_message":"It was an all-out brawl in the middle of the day, and ultimately, it was two women armed with a bat who came to the rescue of a young man in serious trouble. The incident was caught on camera."}]
