[{"comment_id":"1753991328222832","commenter_b":"Angry, angry woman.","commenter_a":"I hear some sniffles coming out of Philly, sure sounds like a bad case of the Blue Flu may be headed that way","post_message":"We'll see what ends up happening..."},{"comment_id":"1194478233905538","commenter_b":"@username...your learning is interfering with your lack of understanding and common sense. These people are Muslims as maybe you are. Their ideology is to secede as supreme at any cost including the taking of life to advance their cause. Allowing 10,000 to come to this Country, and not knowing who they really are, is not a smart idea nor is it responsible. We have enough problems in this Country now with illegals and supporting them. We don't need more leaches to feed. And yes, I am a proud Southerner as you have mentioned. Your history is somewhat flawed and Gods laws supersedes mans laws.","commenter_a":"9/11...\"We will never forget\"! The White House has already forgot, allowing 10,000 Syrian Muslims into America...","post_message":"The Obama administration said Thursday it is willing to take in at least 10,000 refugees in the next fiscal year as Europe grapples with the crisis."},{"comment_id":"10153042394211800","commenter_b":"Actually, the comedy part means the extreme feminists are being mocked...","commenter_a":"Gotta say I was very disappointed in this whole segment. Not because it was offensive or anything, but because it seemed to take what is clearly an issue (people taking up too much space on the subway) that can be caused by *both genders* (not just men) and acted like men were silly for thinking the ads were sexist by only targeting men. How much outrage would there be if there were a series of ads specifically targeting women for doing something that both men and women could do? Food for thought.","post_message":"\"Occupying all the territory you can is sexy. When I'm on a subway car with all those men taking charge of the seats around them, I get so weak in the knees that I can barely stand. But I have to.\" -- Kristen Schaal ► Kristen Schaal defends the right for men to spread their legs and take up two seats on the subway: @webpagelink"},{"comment_id":"10153507149617452","commenter_b":"Your so dumb @username. Get ready to go back to Mexico or Cuba or wherever u from. Smh","commenter_a":"you idiots still voting for Trump. Smh","post_message":"New York Primary: Donald Trump and Hillary Clinton have won their parties' primaries in New York."},{"comment_id":"10153442947898908","commenter_b":"This is wrong. I can just tell you it is wrong because of decay and expansion. We know that the universe was something different even if that was just a tiny speck. The way the article reads as if the universe has always been the way it is now and that is not the case. All these bible thumpers who don't understand basic science or astrophysics will use this to try to say God is real.","commenter_a":"the end is the beginning.... the beginning is the end...","post_message":"This is a tough thing to wrap your head around."},{"comment_id":"978723315520750","commenter_b":"With photographs like that, she ain't no lady!","commenter_a":"too much hate toward this young lady. Racist white pigs","post_message":"It's the pool party that forced a police officer to resign...but the organiser has got a modeling contract out of it"},{"comment_id":"1301249303268148","commenter_b":"It wasnt done right then and thats on the doctor, not the procedure, I have spinal epidurals three ot four times a year with no problems.","commenter_a":"Scare mongering!","post_message":"I said 'Yes' to an epidural to ease agony of childbirth ... it left me PARALYSED"}]
