[{"comment_id":"1157175910989546","commenter_b":"Why would ANYBODY admit they were a Republican after this years parade of idiots, never mind vote for them?","commenter_a":"Assholes are use of SHIT !!!!","post_message":"Three Republican presidential candidates befriend a pastor who just went on stage and gave the most bizarre anti-gay speech ever."},{"comment_id":"1736087096643244","commenter_b":"She can dig as much dirt as she wants. We all see right through her. What a loser.","commenter_a":"Lied and busted on national tv","post_message":"Alicia Machado blames Donald Trump for her two eating disorders..."},{"comment_id":"1104371989582553","commenter_b":"Don't kiss any bugs, Suzanne--even if they swear they'll turn into a handsome prince. Only frogs for that.","commenter_a":"Thanks for that. I'll be obsessing on this for weeks now.","post_message":"“Kissing bugs” may sound sweet, but they have infected at least 12 people in Texas with a parasite that causes a deadly disease. >>kiro.tv/KissingBug"},{"comment_id":"10155525709475603","commenter_b":"She is a scam artist and charlatan anyway.","commenter_a":"Ok now what about the big Joyce Meyer's Women's Conference that comes to St. Louis in Sept.? That's why I can't travel by myself down there. It's sad.","post_message":"Three people shot overnight including at 16-year-old boy. If you think you’re hearing more about crime this year in St. Louis, we have new statistics to prove it. Right now on News 4 This Morning, Laura Hettiger is breaking down all the violent crime we’ve seen so far in the first 4 months of the year."},{"comment_id":"10153781188388984","commenter_b":"We need to get Americans off of Welfare...80 million Americans are not coming off their porch until we take EBT away from them, the Obama phone and ACA. Immigrants with green cards would not be here if Americans would get off their ass.","commenter_a":"Ben Carson supports amnesty for illegal aliens. The liberals can have him.","post_message":"Rush Limbaugh just issued a huge statement Dr. Ben Carson ... this caught a lot of people by surprise. Do you agree with what Rush just said?"},{"comment_id":"10153829014724091","commenter_b":"Does the witch have pizza","commenter_a":"Sounds like trump","post_message":"We're under a Tornado Watch -- checking in with Lee Goldberg on what we can expect."},{"comment_id":"1296652160354811","commenter_b":"Your wrong again people ! stop with the Race card ! Wanting our borders closed and secure to stop illegal aliens and drugs from getting in our country is Not Raciest ! and we are at War with Rdical islam so yes all immigration should be Haulted Untill ISIS is Destroyed ! it's about protecting AMERICA and AMERICANS ! The Democrates do not care about securing AMERICA and protecting AMERICANS","commenter_a":"As a German living in Ireland I have to say that the choice can only be Clinton or Sanders! Trump and the likes are disqualified for being racists, bigots, etc.!","post_message":"'It's like a comedy.'"}]
