[{"comment_id":"10154122931756756","commenter_b":"Ugly, spoiled killer.","commenter_a":"The apple didn't fall far from that tree.","post_message":"In a video released by Mexico's immigration institute, an expressionless Ethan Couch is shown being led into a truck and placed on a plane at a Mexico City airport."},{"comment_id":"10152744164338645","commenter_b":"@username....Sounds like you are the racist here calling @username \"Mr. White Man\" with the pea brain...maybe you are the one with the pea brain!","commenter_a":"Please don't shoot the young black ARMED CRIMINAL, it might start another riot!","post_message":"Police investigate an early morning armed robbery at an area Wal-Mart store."},{"comment_id":"10153359196206234","commenter_b":"She can leave the house!","commenter_a":"If she can't leave the house,what does she need it for","post_message":"The new Lexus was waiting for Giudice when she returned home from prison earlier this week."},{"comment_id":"814884995294947","commenter_b":"this is sick.stupid bitch,","commenter_a":"SLUT TRASH","post_message":"Only thing this proved is that she is flippin' disgusting. @webpagelink"},{"comment_id":"10153471802056336","commenter_b":"It's a woman's choice regardless Patricia","commenter_a":"And is a distortion of the truth. No body parts were offered for sale. This is a complete propaganda that Ted Cruz is too stupid to know to avoid. Dumb canuck.","post_message":"\"These tapings of Planned Parenthood selling body parts are grotesque. It highlights the evil of what they're doing.\" – Sen. Ted Cruz"},{"comment_id":"1670513393170878","commenter_b":"Hey he's jerking with his shit as lube on his pussy","commenter_a":"Wow it takes like 15 or more cops to take down 1 fucking guys.....pussy as pigs","post_message":"The most glorious thing we have ever seen. #thinblueline Footage from moments ago when protestors shut down HWY 70 near our shop. When the SHTF make sure you have the right SH*T @webpagelink"},{"comment_id":"10153223186871336","commenter_b":"Lol @username it wouldn't be America without us it would still be Native American land Indian land you call crazy and aliens would still be over in Europe living without sign in famine","commenter_a":"Actually 52-0 if you count all the woman beatings and cheap shots outside of the ring.","post_message":"ICYMI: Floyd Mayweather piled up enough points against Manny Pacquiao to win by unanimous decision in their welterweight title bout last night. Mayweather extended his win record to 48-0, cementing his legacy as the best of his generation."}]
