[{"comment_id":"1238572129494342","commenter_b":"You're a typical liberal Asshole ! Try those new laws in Court on those Illegals & Drug dealers & criminals no gun permits !","commenter_a":"can't wait for the State of Jefferson to separate from California and away from Brown and his non concern for America, this guy sucks ass was a loser before but voted in again by losers from other states that just moved to California for welfare and hand outs","post_message":"Gov. Jerry Brown dropped ink Friday on about half of the dozen gun control bills recently placed on his desk, including one requiring background checks for ammunition purchases and another that bans the sale of semiautomatic rifles that use a bullet button to easily detach a magazine."},{"comment_id":"10156625671370354","commenter_b":"Dork....","commenter_a":"He's a black man who don't no shit about running a country","post_message":"“I’m a black man who sometime wears his hat on backwards,” Obama said. And the rest is, well, you'll see..."},{"comment_id":"488632654671676","commenter_b":"55555","commenter_a":"Nonthawat Ford Focus @username","post_message":"Watch this T-Rex own ‘American Ninja Warrior.’"},{"comment_id":"10153309125991491","commenter_b":"Kerr, it's not the good guns with guns in the US. It's the BAD ones.","commenter_a":"He is 100% right. The attackers would've been shot down where possible. Edited for grammar.","post_message":"\"It would have been a much, much different situation.\" - Donald J. Trump"},{"comment_id":"10154532714726162","commenter_b":"England, and yes it is my city is run by the labour party","commenter_a":"Where's white live matter, oh wait their not black","post_message":"A father and his two sons have been charged with molesting three young girls in their home... @webpagelink"},{"comment_id":"10154999301374411","commenter_b":"@username Fck off white trash","commenter_a":"Good. Cheats shouldn't prosper.","post_message":""},{"comment_id":"10153107987369205","commenter_b":"When an illegal alien is here and gives birth to a child the child is still illegal.","commenter_a":"Matt Ely this who you want you dont know shit if this who u want","post_message":"Things get heated between Bill O'Reilly and Donald J. Trump"}]
