[{"comment_id":"10153140087886037","commenter_b":"@username I have a friend who works as an ICE agent and their hands are often tied when getting rid of criminals and they already deport the serious criminals.","commenter_a":"My mother-in-law went through the process legally and in November she took the oath. She took the process seriously, learning US history, learning english, and working hard to pay the fees. Freely handing out citizenship is an insult to those who went through the process legally. Laws are put in place for a reason, we cant pick and choose which ones we follow. And the President can't be allowed to give millions of people citizenship when it goes against our laws. I don't care if the president is Democrat or Republican, this is not legal.","post_message":"Confident Obama predicts success in immigration appeal, has message for millions facing possible deportation @webpagelink"},{"comment_id":"10156202756245354","commenter_b":"@username, lol, I'm doing just fine sitting here on the beach. Awful life? Bitch please.","commenter_a":"How much did the Pope's dress cost?","post_message":"Pro-Tip: When bashing capitalism is your brand, it's best not to wear dresses that cost $2,300.00."},{"comment_id":"10153212099990927","commenter_b":"She and Whoopi are proof that there are people in this world that shouldn't be allowed to reproduce.","commenter_a":"She is so irrelevant.","post_message":"So if you don't ago along with Obama plans...you're racist? Only the 'View' Crew could come up with something so stupid."},{"comment_id":"10152874600638598","commenter_b":"The men in China are becoming desperate for wives and there is none to be had. Men are now kidnapping small girls to keep for wives.","commenter_a":"I don't see any of you adopting the millions of unwanted children from china. The thrown away ones because they were girls, or the second child. The unwanted and given up for adoption, living in an orphanage or on the streets ones.","post_message":"China Has No Plans to Suspend Its One-Child Policy Resulting in Forced and Sex-Selection Abortions"},{"comment_id":"10154578809696336","commenter_b":"They are all corrupt !!! Time to clean house !!!","commenter_a":"Lol , I just remembered that Obama said hillary is more qualified than he is .","post_message":"\"The FBI's not supposed to be involved in spinning the news. Whenever you release sensitive materials on the Friday of a holiday weekend you are trying to affect the news cycle.\" Tucker Carlson said the timing of the FBI's release of documents relating to the Clinton server scandal \"discredits a venerable agency.\" @webpagelink"},{"comment_id":"10152633763458525","commenter_b":"So because somebody disagrees with you they lack common sense. That's very adult of you.","commenter_a":"And people say that pot doesn't hurt anyone.... That's two deaths due to pot sales just during the holiday season. Pot hurts....even kills.","post_message":"They are just 15 and 16."},{"comment_id":"1745816418974356","commenter_b":"This woman's head is bad.","commenter_a":"That's the problem, she just let 4 Americans die, you idiot.","post_message":"Whoopi Goldberg: Gee, so sorry that you find the deaths of innocent Americans \"boring.\" But for the rest of America, we find the Benghazi massacre reprehensible and unforgivable. And on behalf of the families who can never see or hug their loved ones ever again, We the People demand transparency, honesty, and justice. So get over yourself and your need for constant amusement, Whoopi. Hillary lied, Americans died. Signed, We the People"}]
