[{"comment_id":"10153303433876162","commenter_b":"Hope not. There is nothing wrong with having a woman president. However other countries in particular the middle east countries dont see women as equals.","commenter_a":"I seriously hope people don't vote for her to have a \"first\" female president.","post_message":"CLINTON 2016? Hillary Clinton is expected to announce her candidacy for President tomorrow. Here's what you need to know: @webpagelink"},{"comment_id":"494096337456103","commenter_b":"Thank you San Diego Border Patrol for stopping these two.","commenter_a":"Aren't they lovely.","post_message":"BREAKING: Johnny Lewis Hartley, 39, and Mercy Mary Becerra, 43, were arrested midday Tuesday and are being held on suspicion of murder and child cruelty. When they tried to cross at the San Ysidro Port of Entry, Mexican authorities found the body of a 2-year-old child inside a duffel bag that Hartley had. \"The incident may have occurred in Whittier,\" San Diego police said."},{"comment_id":"10155425307145615","commenter_b":"\"But no use trying to educate them...\" I feel the same way, because after all: 1) This law is not discriminatory. Anti-discrimination law always trumps Religious freedom law, especially when discrimination is not explicitly addressed, as if the case for RFRA laws. If this was an attempted to legalize discrimination, the analogy would be like a man throwing a feather at a door to force it open. It is a sad attempt. 2) This is not religion being forced down your throat. It is religious liberty. Perhaps, it bothers you that a man would be allowed to wear long hair in an office that requires a clean cut, or that the Amish would not be forced to \"drive\" a minimum speed limit, but it hardly qualifies as religion being forced down one's throat, in my opinion. 3) This is merely a copy of the federal law with some of the ...","commenter_a":"I'm tired of Pence and all his follower's trying to \"defend\" him. They're all discriminating bigots!! Plain and simple!","post_message":"Wow!"},{"comment_id":"1356943270993679","commenter_b":"Take away about 15-20 million illegal immigrants and where are you? Be careful what you wish for.","commenter_a":"Yet, those \"islands\" hold the majority of the population... which will continue to increase as urbanization increases. You can play spatial games with maps all you want, but the reality is, our country should be predicated on the idea of one person, one vote (equal representation).","post_message":"This is actually a very informative map."},{"comment_id":"10153827416061438","commenter_b":"Lol...really?She may be a whackjob but looks wise, she is a stunning women.","commenter_a":"It was pitiful and tragic to watch and it was clear that she is a desperate, washed up, narcissistic, actress whose looks are fading and relies upon her melodramatic sexuality rather than any improvisational or theatrical skills. Her girl, delivery was worse that the sound of a dentist drill and it was more emetic than aphrodisiac. The audience was truly stunned , as if they were witnessing the senile ego of a down and out prostitute consumed, devoured, by her own inflated ego turning tricks in the parking lot. Her exaggerated performance wreaked. It almost seemed cruel to not instantly cut to a commercial. It was truly wretched. Mr. Ed pissing on stage would have been a great improvement! And I sure that horse is dead!","post_message":"If you were left scratching your head, here’s a quick explanation."},{"comment_id":"1817145371836310","commenter_b":"@username MY BAD...I THOUGHT YOU WERE A WOMAN...NOW I UNDERSTAND...","commenter_a":"Yep. She got mitch slapped, and now she's gnashing teeth. I can't thank you enough mitch. Bravo. I thought you were a spineless rhino, and you probably are, but this is brilliant.","post_message":"Elizabeth Warren took to Facebook Live after being silenced on the Senate floor for quoting a 1986 letter by Coretta Scott King. Now, supporters are rallying behind her with #ShePersisted. @webpagelink"},{"comment_id":"10153227271719228","commenter_b":"If she didn't go to the hospital another couple hours she would have been gone cuz it would have went to her heart it was that close to her heart they caught it in time","commenter_a":"The exact same thing happened to my daughter they went in a Lana ectomy scraped her spinal cord put her in a coma for 2 weeks it took her 2 months to learn how to walk again but she is walking again","post_message":"Her body started to go numb and she lost feeling in her legs."}]
