[{"comment_id":"10152952742422507","commenter_b":"I don't see how feeling guilty about things that happened hundreds of years ago has anything to do with what's happening now. Especially when it was perpetrated by not one person living today. It isn't about keeping people from coming here, as my grandparents are immigrants. It's about how they go about doing it. There is a right way and a wrong way. I see it everyday, the advantages people take of a broken system. If you choose to leave your blinders on to facts, that is your choice. Ignorance is bliss.","commenter_a":"WOW... it's been over half a millennia and this story has repeated all over the globe throughout history affecting all people everywhere at some point or another. This shit is pathetic to bring up.","post_message":"Turns out..."},{"comment_id":"10153076129356680","commenter_b":"Yes she is a witch and should be burned","commenter_a":"Just another witch hunt.","post_message":"“This is enormously significant.”"},{"comment_id":"1140463419377942","commenter_b":"Oh a gold dress, is that all? I thought maybe her penis was showing through her dress! Ha!","commenter_a":"For what she spent on that dress they could let all of the Afghanistan veterans keep the Enlistment bonuses they received 10 years ago instead of charging them $650 each a month until the entire $10,000 plus interest is paid back!","post_message":"It was Michelle Obama's final state dinner, and the first lady was trying to make a good impression. However, people noticed something wrong with her dress in a big way... now, it's making news everywhere. This is sick... it shows you who the Obama's REALLY are."},{"comment_id":"10152818942414342","commenter_b":"Slit her throat","commenter_a":"Sick! Sick! Sick! Hope she burns in hell.","post_message":"UNTHINKABLE CRIME: A mother accused of slitting the throats of her three young children, because, police say, she wanted them to stop crying. FULL STORY --> @webpagelink"},{"comment_id":"875277045852257","commenter_b":"You are a woman your body is naturally designed to bear children. It is worse when you make the choice to get pregnant.","commenter_a":"Most pro-aborts know there is an actual baby being killed. 99 percent of them have never had an abortion, yet have no problem telling others it's perfectly okay to have one. Pro-aborts are sick people.","post_message":"When was the last time you saw a baby announcement like this?"},{"comment_id":"1537745819864402","commenter_b":"and that still doesnt make him legitimate to run. Even down here in Australia we know he doesnt qualify... Surely they havnt dumbed billy yankee down that much???????","commenter_a":"Boehner and Trump, best of buds...who would have thought?","post_message":"Ted Cruz just got the best endorsement he could ever get. He could not have gotten a better endorsement than he got out of John Boehner."},{"comment_id":"967763486668466","commenter_b":"Smart, educated women are actually voting for Hillary. Don't fool yourselves.","commenter_a":"What is it about the Democratic platform that is appealing? Higher taxes, weaker security, open borders, murdering babies, a very real risk of WWIII... ya'll must really hate America","post_message":"\"Get this Donald: nasty women are smart, nasty women are tough, and nasty women vote.” —Elizabeth Warren"}]
