[{"comment_id":"10152762362423645","commenter_b":"smh...","commenter_a":"Marlo","post_message":"Wow. That must have been a strange night. Kurt Busch testifies that his ex-girlfriend is a 'trained assassin' who returned from a mission in blood-splattered gown."},{"comment_id":"964624156930666","commenter_b":"Fat wives also can wear jeans ^_^","commenter_a":"He must have a really fat wife.","post_message":"Sounds reasonable :/"},{"comment_id":"10154414222354087","commenter_b":"Get used to it. Welcome to Trump's America.","commenter_a":"So? We've been hearing that North Korea has nukes, is building nukes for years... Whatever... Their society and economy is so fragile a major earthquake would send them back to the dark ages...","post_message":"A top North Korean official who recently defected to South Korea says the country is racing to develop nuclear weapons \"at all costs\" by the end of 2017."},{"comment_id":"10153226517872232","commenter_b":"Probably...","commenter_a":"And while all were watching the fight 1 or more were most likely walking out with merchandise","post_message":"CAUGHT ON VIDEO: Several women got into a brawl Friday afternoon inside the popular Rittenhouse Square clothing store, Zara --> @webpagelink"},{"comment_id":"10153415212958984","commenter_b":"Yes Yes Yes and Amen","commenter_a":"Yes I do and I also believe the Church needs to pray. It's not just the pastors that need to send a message to our government THE BODY OF CHRIST ALSO.","post_message":"These 700 pastors are fed up with Obama pushing this agenda, and now they're sending him a clear message... Do you support what these pastors did?"},{"comment_id":"1823440651212555","commenter_b":"Shut up bitch","commenter_a":"All Lives Matter, or NO LIVES MATTER. Sick and tired of people useing the Race card for their answer to all their problems. How about INDIVIDUAL RESPONSIBILITY!","post_message":"Ben Shapiro is a liberal's worst nightmare...."},{"comment_id":"10156475967855231","commenter_b":"@username That's nothing to brag about or feel proud of. Just makes you a parental fail.","commenter_a":"Art is seems to be tge type of jerk who would disown his gay child. Especially, a male child.","post_message":"He apologized, but let's be for real: does he really mean it?"}]
