[{"comment_id":"1678604362359824","commenter_b":"@username how about i fuck your wife?","commenter_a":"Ah yes, Israel defending themselves against the crazed islamists wanting to destroy the country and kill all the jews. This page is turning into a progressive shitehole full of regressive thinking. NASTY.","post_message":"Literally the biggest assholes on the planet."},{"comment_id":"10153107987369205","commenter_b":"When an illegal alien is here and gives birth to a child the child is still illegal.","commenter_a":"Matt Ely this who you want you dont know shit if this who u want","post_message":"Things get heated between Bill O'Reilly and Donald J. Trump"},{"comment_id":"750074615183116","commenter_b":"THIS IS AMERICA & WE BETTER START PAYING ATTENTION BEFORE IT'S TOO LATE! SHARIA LAW BELONGS NOWHERE IN AMERICA.","commenter_a":"Let go hunting America ...Get them out of our country before they hurt our love ones ...","post_message":"Muslims take over THIS U.S. town and immediately begin implementing Sharia law. You cannot force others to follow your religious laws. Do you think this is wrong?"},{"comment_id":"10153700282571955","commenter_b":"Ann Coulter's long lost French sister !!! Yea !!!! <3 \\b\\b\\b\\b\\b","commenter_a":"European and US far right are far different there is no limited governemtn and free marekt in Europe, it is just taking chashing cultures seriously.","post_message":"NEW WONDER-GIRL OF FRANCE FAR RIGHT..."},{"comment_id":"10153818246882293","commenter_b":"Leave it to mysoginists to make the case for feminists better than any feminist could.","commenter_a":"Women, get over it! You are way too thin-skinned, take yourselves too seriously, and get offended at the drop of a hat. Loosen up and quit being so tight-assed.","post_message":"If 75 percent of women told researchers they view Trump unfavorably, who is it that backs Trump?"},{"comment_id":"10156136666730725","commenter_b":"@username..so the Democrats will bring in foreigners who despise us and our way of life. Yes that will certainly help.","commenter_a":"Why are we not taking care of our homeless veterans better first?","post_message":"BREAKING: Secretary of State John Kerry says the U.S. will significantly increase the number of worldwide refugees it takes in over the next two years to help ease the Syrian refugee crisis ----> @webpagelink"},{"comment_id":"10153736965291336","commenter_b":"She dosen't know what she's talking about .Shout up !!","commenter_a":"Think she's irrelevant at this point","post_message":"\"Every single Republican candidate for president is against marriage equality. Every one of them. Many of them are against anti-discrimination laws. Many are against same sex couples adopting.” – Hillary Clinton"}]
