[{"comment_id":"10153166262121336","commenter_b":"she can't stop lying","commenter_a":"If her lips are moving she is lying","post_message":"“All my grandparents, you know, came over here...\" – Hillary Clinton said on the campaign trail But Census records show that only one of Clinton’s grandparents was born outside of the U.S."},{"comment_id":"10152968959637452","commenter_b":"Why couldn't she just get out?","commenter_a":"Who really believes that was a suicide? Smh..","post_message":"\"Get out of the car! I will light you up!\" Authorities have released dashcam video of Sandra Bland's arrest about a week after she was found dead in her jail cell. FULL VIDEO: @webpagelink The medical examiner ruled the Chicago-area woman's death a suicide, but her family believes otherwise."},{"comment_id":"898169113565446","commenter_b":"dumb chick","commenter_a":"Why do you even question that liar, cheater, traitor and friend of Obama.","post_message":"Let's get the facts straight, Hillary Clinton..."},{"comment_id":"1080347691985409","commenter_b":"Exactly","commenter_a":"Frankly, no matter whether the women went back to him--maybe they were screwed up emotionally at that time too--he assaulted them. It's the 21st century. Stop trying to drag women through the mud for reporting it. Choking is assault, n'est pas?!","post_message":"\"Nobody close to Jian even pretends he is innocent, and somehow this isn't an issue the women are.\""},{"comment_id":"1228480800579306","commenter_b":"also don't worry about the food, mods gave another interesting fact Eagles do not waste food they will eat it!","commenter_a":"Watching from Buckley Michigan","post_message":"SNUGGLE TIME: Fuzzy eaglet is snuggling as lunchtime approaches! VIDEO: Southwest Florida Eagle Cam"},{"comment_id":"10154177550736509","commenter_b":"She was legal to have sex in those two states! End of story!","commenter_a":"Did he KNOW she was a minor? That should make all the difference.","post_message":"The 17-year-old girl's cell phone had evidence of \"inappropriate communications over the last several weeks between (25-year-old Steven) Sheerer and the minor,\" the prosecutor said."},{"comment_id":"1196105023763301","commenter_b":"I got something for your ass you want it","commenter_a":"How about remove the sick person behind addicting info !!!!","post_message":"Somebody just did something genius to help in the battle to remove Donald Trump from public life."}]
