[{"comment_id":"514982215334916","commenter_b":"With all the illegal immigrants crossing our borders daily, we have no control over the diseases they are bringing into the country, diseases that were eradicated here,thanks to vaccines. If there is even a small chance my child could be exposed to diphtheria, whooping cough, or the measles, or polio, you can believe I will do whatever I can to protect them from these horrendous diseases. If you want to play Russian Roulette with those chances, that is up to you.","commenter_a":"Thanks for taking the time to let us see who you really are. I am more and more impressed by you each day.","post_message":"Each night I try and carve out some time to answer questions from my friends on Facebook. You can submit your questions by sending them to me via email at AskBen@BenCarson.com. I am out in Jackson, Wyoming tonight and my, is it pretty out here. The first question tonight is one I see comments on occasionally. It is from Devon and it is about childhood vaccinations. Devon, as you know, I spent my life with a Pediatric specialty. As a Pediatric Neurologist, I feel I have a very solid understanding of the developing brain of a child. Devon as you know, my life's work was in a pediatric specialty, caring for 15,000 children to ensure that they could live full, productive, and healthy lives. I can assure you that I would never advocate for a treatment for children without fully knowing that it is safe and in the best interest ..."},{"comment_id":"425066681021905","commenter_b":"That woman should of been kicked out.","commenter_a":"Look what we just missed- Wendy Rowe Ristine-#noblackfriday #somepeoplejustsuck","post_message":"Look at what a woman just did to a child at a Black Friday Sale."},{"comment_id":"10154578752917501","commenter_b":"How many actually paid attention and noticed that I was questioning the doctors- NOT THE WOMEN!!!","commenter_a":"I am ever in awe at the things they do at the Clinic. However, I have to wonder at the ethics. Performing a surgery that has major repercussions for the woman involved (anti-rejection meds, etc...) just so she can undergo pregnancy- which has its own set of dangers - seems ethically sketchy. There are so many unwanted children who need homes. Adopt.","post_message":"This is truly amazingThe Cleveland Clinic said the nine-hour surgery was performed on a 26-year-old woman, using a uterus from a deceased donor."},{"comment_id":"1354769341225150","commenter_b":"How'd you like this one -60% of the USA. illegal population resides in the Golden State. That is one of many reasons why our politicians support this crap! Frankly, that is one reason why our state taxes are incredibly high and the other is bad management without accountability. We also have a disproportionate amount of refugees getting relocated here and illegals residing in our prisons.","commenter_a":"Californians are beyond reasoning!!! They refuse to obey a national law on harboring illegal aliens, and yet have the gall to ask for funding to support those illegals they are harboring!!! NO FEDERAL FUNDS SHOULD GO TO CALIFORNIA UNTIL THEY DEPORT THE ILLEGALS THEY ARE HARBORING!!!!!","post_message":"I can't believe they asked for THIS!"},{"comment_id":"1890349187852006","commenter_b":"One does not have to TRY to cast america in a bad light..... The racists & Nazis here do a good enough job by themselves. America is NOT great, & will never be great again until the cancer which arrived here In 1492 is removed. Swim back to Europe racist beast","commenter_a":"Stupid, stupid, stupid. I only still like this site cuz i wanna read what propoganda u spew next. Has anybody else thought that this site is communist run, or pro russian. They always try to find ways to cast the US in a very bad light","post_message":"OMG, did you hear? $$ Dump: @webpagelink DAPL Raid: @webpagelink Drone Bomb: @webpagelink Join Us: The Free Thought Project"},{"comment_id":"696169153898296","commenter_b":"@username, a new time of patients unable to afford treatment are being kicked out of hospital , letting them stay in the parking lot. Or putting them in a cab, just stranding them anywhere! Has happened many times.","commenter_a":"I had hoped that they would at least do the right thing and replace before they left millions without coverage....plus I read that it's going to cost a huge amount of $$$ to dismantle the Affordable Care Act....I want to know where this is being fiscally responsible????","post_message":"Awful!"},{"comment_id":"10154363624237501","commenter_b":"This is getting Old. What will she want next a Movie? This lady is a $$$$ hungry Biotch","commenter_a":"Why oh why do you continue to post this?","post_message":"As testimony comes in and new evidence is provided, has your opinion about the shooting changed over time?"}]
