[{"comment_id":"10154148249086336","commenter_b":"KILL ALL RNC PIGS,LIBS,RINOS,SQUAEL PIG SQUEAL","commenter_a":"Caleb Benitez these are those higher power that people don't know about ,they try controlling the world ,not this time","post_message":"The letter reportedly contained a threatening message that implied Donald J. Trump's children would be hurt if the GOP candidate did not withdraw from the 2016 presidential race."},{"comment_id":"10154054531268984","commenter_b":"shes a bitch, and has over inflated the facts and and did not do the research in her questions it was all edited as thats what the media does they piece the words together to suit them sick of of all news media they do not report anything truth anymore just the lies they try to make into thier own little fantasy world to get them in the spotlights of the media world ........","commenter_a":"M KELLY IS A LOW-CLASS BITCH","post_message":"Megyn Kelly was in the middle of her live TV show when news broke that Donald Trump would officially be skipping the Fox News GOP debate. Talk about a captivating moment of live television... Do you think Donald J. Trump made the right decision?"},{"comment_id":"472078136250114","commenter_b":"Haha What a bitch","commenter_a":"Good for them. If they don't like prayer they need to leave the activity. To Hell with them.","post_message":"An atheist group complained about prayers at sporting events. This is how the community responded."},{"comment_id":"936532806442972","commenter_b":"Is that a bad thing?","commenter_a":"Oh, please. He will become the biggest clown in the clown car.","post_message":"Donald Trump knows what he’s doing in 2016 ..."},{"comment_id":"10153152962811323","commenter_b":"It doesnt apply both ways. It says it does but woman are malicious and always get their own way.","commenter_a":"Good. And what about divorced men who have brought up the children while the wife goes off to make her fortune without contributing to the children's upbringing?","post_message":"\"At last! The supreme court has just rocked the apple cart of unequal divorce. It has pronounced that being a parent is an obligation that lasts. Even if one parent is no longer around, for better or worse their fortunes are inextricably bound together. Particularly if those fortunes are for better.\""},{"comment_id":"601888693294679","commenter_b":"Pussy is pussy","commenter_a":"Almost every girl I've ever met before my current relationship has just been looking for someone to either buy all their shit so they don't have to work, or someone to be step daddy. Smh. I don't want to hear shit about unfair expectations.","post_message":"Well Damn!"},{"comment_id":"1011665845530135","commenter_b":"Cassandra is a fox!","commenter_a":"She is beautiful, and yes, I think it's a step in the right direction, but she is NOT plus sized! I am a plus sized woman.","post_message":"PLUS-SIZED MODEL: Model Robyn Lawley just became the first plus-sized model to snag a page in Sports Illustrated's swimsuit edition. Do you think it's a step in the right direction for the modeling industry? Or is it sending the wrong message?"}]
