[{"comment_id":"1280674628621991","commenter_b":"@username yes she's the best of a bad lot","commenter_a":"Dump the Trump he just isn't Presidential Material","post_message":"If you think that a President Trump would be checked by Congress and \"couldn't really do that much harm\" you're totally wrong."},{"comment_id":"952148034847314","commenter_b":"How LOW can you go? What a dirtbag!","commenter_a":"Public Square Hanging is well deserved.","post_message":"EXPLOSIVE: Thief Stole Veteran Gravestones to Make Granite Flooring at His Home (VIDEO) @webpagelink"},{"comment_id":"10155021097508812","commenter_b":"Blonde idiot.","commenter_a":"I felt like the Eagle being trapped in the drain was significantly similar to how our country was going down the drain after Trump was elected. And now the Eagle has died...another significant likeness to our country's future...","post_message":"Sad update: Bald eagle rescued after being trapped in a Florida storm drain has died, Audubon Center for Birds of Prey says. @webpagelink"},{"comment_id":"981590648554229","commenter_b":"Let me know if you need any help doing actual research, as opposed to just spouting off your uninformed opinion, Skatie.","commenter_a":"Of course, Mother Teresa was NOT talking about abortion when she said that, she was talking about child poverty.","post_message":"Mother Teresa gets it right! What do you think?"},{"comment_id":"577421592439857","commenter_b":"I don't believe anything this woman says.","commenter_a":"\"You can always point a finger. But there's three pointing back. Literally, If you point a finger at someone else, three of your fingers are pointing back at you. This also means that you need to stop blaming others and deal with your own issues to help yourself.\"","post_message":"Hillary Clinton and her running mate Tim Kaine have released their tax returns, as her campaign called on Donald J. Trump to do the same."},{"comment_id":"1432544963425545","commenter_b":"As Usual Asian people don't respect anything. They are doomed!","commenter_a":"Typical Asian - they'll eat anything that moves","post_message":"Their cries will make you question everything you put on your plate. How can anyone treat animals this way?"},{"comment_id":"10154332394779607","commenter_b":"How dare she!","commenter_a":"Democrats cow-tow to any and all unions especially ones tied to government. Follow the money. The only choice they like is abortion.","post_message":"\"Rather than merely enjoying her billions and donating money to fashionable causes, she poured money, time, and energy into education reform with a particular focus on the least economically advantaged...\""}]
