[{"comment_id":"1746177368955196","commenter_b":"she's full of it","commenter_a":"WTF this is what she said in her tweet: For the record, my book \"Settle for More\" does not suggest Trump had any debate Qs in advance, nor do I believe that he did. -","post_message":"MEGYN's LATEST CLAIM. @webpagelink"},{"comment_id":"812894658799894","commenter_b":"GI, Hillary, go.","commenter_a":"Hillary is a strong woman and won't tolerate any Republican CRAP.","post_message":"This is Hillary in full badass mode. You may not love her, but you should love her passion!"},{"comment_id":"10152838085232014","commenter_b":"That woman is not a mother. A mother loving, nurturing, protective. That woman is a disgrace. She should never get those precious babies back.","commenter_a":"What's wrong with these people leaving their kids in cars alone o in apartments....seriously people stop having kids or don't have them at all if you're not going to be responsible.","post_message":"Police say a Phoenix mom left her two babies alone in an apartment with a bathtub full of water, a switchblade in reach, and an open door to the third-floor balcony."},{"comment_id":"10157519592720206","commenter_b":"Lol You're aware this is in America. Not illegal here.","commenter_a":"It's actually illegal for major super markets to charge for a plastic bag because for example say tescos they can't charge you because your advitizing tescos through the bags also store laws are to provide bags for customers not well not sell them to us","post_message":"Get ready to pay 5 cents for a plastic bag."},{"comment_id":"10153433309476051","commenter_b":"Tie her up in the yard with a plate of chicken wings just out of reach","commenter_a":"No compassion, no conscience ,scruples,morals..nothing but a worthless excuse for a person.I hope she has no children.","post_message":"Officials took one look at what this woman did to her dog and arrested her immediately."},{"comment_id":"543745795816000","commenter_b":"We need to start carrying bacon with us and when they disrespect an American Bitch slap them with the bacon.","commenter_a":"Yes,yes! Or send their butts back! We don't want them here!","post_message":"This Fox News reporter was absolutely disrespected by these Muslims. They are out of control. If Muslims are going to live in our country they need to learn some manners. Do you agree Muslims have to assimilate or get out?"},{"comment_id":"10154497779774166","commenter_b":"My son. 3 at the time but 6 now, snuck out at 8am to play in the yard and went through child proof knob, door lock and deadbolt. And i was arrested and given a felony for child neglect... Judge here raised voice at me when i told her kids arent dumb. That mine is super smart. And sent me to jail/: now my ptsd is so bad i barely sleep since the day. Because im afraid he'll sneak out again.","commenter_a":"Was he pulled over for \"drunken milk driving\"? LOL! On the serious side, glad he was okay! My children were escape artists when they were younger. Have a toddler now and with having her older siblings around, she doesn't attempt anything like this. She's opened the front door before, but never left the apartment. We used alarms on the front door. Working third shift and having a toddler is hard LOL! But during the week she's at daycare so no worries there... Just worry on weekends when they're home with me.","post_message":"Deputies say the child was found driving down the road wearing only jogging pants and a diaper around 1:55 a.m. Sunday."}]
