[{"comment_id":"1150660831667337","commenter_b":"@username shut up fatass hoe","commenter_a":"America was built on hate! Just ask the Indians.... oh wait it's hard to find any because the white man almost killed off the whole entire race for land?? Land that was never theirs?? Land that is foreign to them? Oh and we are the savages?","post_message":"Good question #Philippines #WSHH"},{"comment_id":"10153092001211037","commenter_b":"Divina there must be some way around this.God it would be a sin to put an animal down for no good reason ! Some Humans are the worse I tell you. Try talking with her when ever she has her bouts. I had one like that too and then again for heavens sake if it's not often then what is the problem she is a dog and that's what they do. Ugg I hope something else gives them reason to move faraway from you.","commenter_a":"Naomi get a pellet/ BB gun pump it 3 times hit that dog a couple time it won't bark anymore. It doesn't break the skin nor leave marks ( I know this for a fact) but will shut them up.","post_message":"A North Seattle woman faced a lawsuit from a neighbor alleging her dog Cawper’s barking was intentionally causing him “profound emotional distress.” The neighbor wound up winning $500,000 by default because she did not challenge his claim. Would you sue your neighbor over a disruptive pet?"},{"comment_id":"10154533631771756","commenter_b":"Well, it's not final yet, but research has shown that kids in 3rd world countries have fewer food allergies because they have had hookworm infections. The hookworm releases enzymes that actully turn off parts of your dna that determine food allergies and other autoimmune diseases. It's in the worm's best interest to keep the host able to eat many things so that the worm can enjoy them, too.","commenter_a":"Tina Pak","post_message":"A research powerhouse attempts to solve the huge mystery of why food allergies have been skyrocketing in recent years."},{"comment_id":"1235978386476227","commenter_b":"someone please give that nasty fat cunt a coupon to jenny criag.","commenter_a":"Get over yourself!! U need to go to the gym","post_message":"Entitled woman claims cashier give her a free drink because her grandmother was a slave. 'LIKE' if this is WRONG!!!!"},{"comment_id":"10154420630831378","commenter_b":"That's because she's a big liar too","commenter_a":"And less than 7 hours ago Kellyanne Conway said the White House has full confidence in Flynn.","post_message":"#BREAKING National security adviser Michael Flynn has resigned. @webpagelink"},{"comment_id":"1868221936741025","commenter_b":"@username STUART BAILLIE IS RIGHT. AL SHARPTON IS THE ONLY MORON THAT LOST WEIGHT. ROSIE AND WHOOPI WILL NEED AN AIRBUS TO LEAVE HERE. THEY WILL HAVE TO MAKE A CUSTOMIZED GAS TANK TO HOLD ENOUGH FUEL TO GET IT OFF THE GROUND. NASA HAS ITS WORK CUT OUT FOR SURE. MAYBE THE ENTERPRISE USED ON STAR TREK WOULD WORK. BEAM THEM UP SCOTTIE. WARP 10","commenter_a":"I thought this fat fucking pig was leaving the country if Trump won. Just another piece of shit liar that won't leave as promised.","post_message":"Rosie O'Donnell has a new job."},{"comment_id":"10153415212958984","commenter_b":"Yes Yes Yes and Amen","commenter_a":"Yes I do and I also believe the Church needs to pray. It's not just the pastors that need to send a message to our government THE BODY OF CHRIST ALSO.","post_message":"These 700 pastors are fed up with Obama pushing this agenda, and now they're sending him a clear message... Do you support what these pastors did?"}]
