[{"comment_id":"10153406887426955","commenter_b":"Can't wait until someone drops a house on Hilary.","commenter_a":"I'm no detective, but my guess would be Hillary, I mean the wicked witch of the east.","post_message":"WHO STOLE DOROTHY'S SLIPPERS?"},{"comment_id":"10154555938529411","commenter_b":"Deeick Foley Kiss my Muslim American ass you scum.","commenter_a":"A failed colonial Zionists nuclear power have learned a lot and definitely exceeded the Hitlers Nazi's regime. Free Palestine. #BDS","post_message":"For those who are 'murdered with a knife in the heart it does not matter if the child is 12 or 15'"},{"comment_id":"515781365279110","commenter_b":"I wouldn't give any fucking nigger s dime fuck them blue gum peace of shit","commenter_a":"No way! It has been so long it did not personally affect them. Get over it, and move on.","post_message":"This state just approved a resolution which will require residents to compensate blacks for slavery. Everybody is looking for a handout. Slavery has been abolished for a long time. Do you think you should be required to compensate blacks for slavery?"},{"comment_id":"1104084689647932","commenter_b":"Proabably referring to the 2 black dudes answering the question. If they were rappers they would have bitches and Bentleys haha. These are just 2 really baked or really stupid men. That's it nothing more.","commenter_a":"This how stupid these rapper are today, but if you ask him how much for half of kush he would quote you to the penny. Wow","post_message":"Is That Your Final Answer?"},{"comment_id":"10155998790520294","commenter_b":"No!!! I'll pass on swimming in everyone's pee and who knows what else lol. Germ infestation!","commenter_a":"I want to do this","post_message":"Would you take a ride on this 800 foot water slide? A few thousand people in Akron are!"},{"comment_id":"1193851514016933","commenter_b":"You losers already get my money in taxes. I pay for your food stamps and slow check every month!","commenter_a":"We wuz kangs","post_message":"Just in time for Christmas!"},{"comment_id":"10154140006458525","commenter_b":"pure evil! No reason to harm officers.","commenter_a":"Suspect is now in custody.","post_message":"#BREAKING The suspect has been captured. Police in Iowa are searching for this man in the ambush-style attacks of two police officers, shot and killed in their cruisers. Police say Scott Michael Greene, 46, is considered armed and dangerous. SPREAD THE WORD: @webpagelink"}]
