[{"comment_id":"10153225867682061","commenter_b":"How can you cut taxes, increase military spending And balance the budget and the only thing going is Obama Care?","commenter_a":"CHILDREN DON'T CHOOSE TO HAVE POOR OR INCOMPETENT PARENTS. FATE GRABS CHILDREN BY THE THROAT AND SAYS, is your life. Poor Child and the Politicians Beneath the greedy iron fist of the Politicians, a ragged, hungry, poor child dwelled Poor Child family tried to climb over poverty restraining wall, but their fragile world collapsed during a cold-blooded eviction from their shoddy shelter Poor Child moved onto a filthy, freezing street, their destitution once again a widespread and noisy public dispute Poor Child body and hope were quickly fading away, tho for their soul, many fellow sufferers continued to wail Politicians and their cronies only cared that reduced assistance and lowered wages for the poor would increase their already huge fortunes Poor Child only wanted, one last chance to be warm, to be dry, to eat. @username","post_message":"WATCH: The #GOPDebate in a minute. More on the debate from last night: abcn.ws/1NJnjrU"},{"comment_id":"1583439795280427","commenter_b":"Disgusting, stupid woman.","commenter_a":"This woman and Palin and others like her are enemies of the state in my opinion! Shame on them for spewing their damage.","post_message":"WOW."},{"comment_id":"10153478399867993","commenter_b":"Do it already.","commenter_a":"What are you waiting for? Her to be elected???","post_message":"Judge suspects ‘bad faith’ from Obama administration on Hillary Clinton emails, threatens subpoena to force former Secretary of State to turn over entire email account."},{"comment_id":"1173449382693296","commenter_b":"ANTI CHRIST HILLARY CLINTON IS BEING PROTECTED BY UN AND OBAMA! ISIS IS THEIR CHILD OF HATRED TOWARDS THE WORLD AND IS GROWING BY THE MIN THEY ARMED ISIS!","commenter_a":"Hmmm","post_message":"Should the US pull out of the United Nations over this?"},{"comment_id":"10154455818619705","commenter_b":"She referred specifically to people who are \" ..racist, sexist, homophobic, xenophobic, Islamophobic.\" If you don't find those things deplorable then you're in the basket and you might as well wear the shirt so the rest of us can more easily identify you.","commenter_a":"Trump supporters take being referred to as \"deplorables\" like a badge of honor","post_message":"The shirts stem from a comment Democratic presidential nominee Hillary Clinton made at a fundraiser."},{"comment_id":"10153243002653984","commenter_b":"Liberal women who are blind & have cement between their ears!","commenter_a":"Why is anyone even considering Hillary for the next president??? Ar","post_message":"Hmmm I wonder why they wanted to keep this a secret... Do you hope Hillary gets defeated in 2016?"},{"comment_id":"422474541282890","commenter_b":"Bring it on motherfucka","commenter_a":"1490882780941608ing Joseph Cortes @username Matt Flambard Leigh Cramphorn","post_message":"Xbox One vs. Sony PlayStation 4 gaming is finally becoming a reality."}]
