[{"comment_id":"1168211463199863","commenter_b":"It's there. (Fuscia)","commenter_a":"I couldn't find New Zealand in there either. I suppose with a population of only 4.5 million...it's no wonder why.","post_message":"Where did Australia disappear to ..."},{"comment_id":"10152801044501130","commenter_b":"Mandatory blow jobs. Vomit.","commenter_a":"During womens periods I'm all for mandatory blowjobs and or anal sex","post_message":"The tampon scene, as it’s known, marks an important point in the relationship between Christian Grey and Ana Steele—but it was apparently a little bit too much for an R rating."},{"comment_id":"10153780723343984","commenter_b":"the Muslim parents could have kept their brats at home that day and celebrate their butts off.","commenter_a":"Yes","post_message":"Tempers flared after this city's board of education refused to take a day off of school in observance of an Islamic holiday, and these Muslim parents were NOT happy about it. Do you agree with the decision these school officials made?"},{"comment_id":"542727622584484","commenter_b":"she need to go home back where she came from","commenter_a":"They all look like robbers and murderers with that shit on there head.","post_message":"This Muslim woman was just kicked out of the mall because of this. If you can't follow the rules, you can't shop here. Do you think Muslims should obey the rules or leave?"},{"comment_id":"863141660412250","commenter_b":"I can't belive some young women want to pay tons of money for this,keep poppin those Skittles and you'll look like that in no time!","commenter_a":"Sorry but it's hard for me to feel sorry for these customers. One ounce of common sense would tell you....Do not let this person inject me with anything!!","post_message":"Toxic butt ‘doctor’ stuns court with her backside."},{"comment_id":"10153290298049087","commenter_b":"You think the people who think that immigrants constitue criminals when in reality they commit less crimes than native born Americans are the smart people? Crossing the border doesn't make you a criminal since in 49 States, crossing the border is a civil issue.","commenter_a":"Donald trump's campaign is all about making America racist again. It isn't coincidental that all of his supporters are idiots.","post_message":"“I’m going to unify. This country is totally divided,” Donald J. Trump said in an interview with CNN's Jake Tapper. “Barack Obama has divided this country unbelievably, and it’s all hatred, what can I tell you, I’ve never seen anything like it. I’m going to unify the country.”"},{"comment_id":"10154174664018812","commenter_b":"She's repeatedly called black people, \"Super Predators\".","commenter_a":"It is sad what the Clinton machine has done to such a great man. While Blacks were fighting for equal rights in the '60s. Sen. Sanders was on the front lines risking his life while Sen. Clinton was supporting a white supremacist. Most of my fellow Black American brothers and sisters have unfortunately fell for the Clinton scam and it is going to cost us big time.","post_message":"JUST IN: ABC News projects Bernie Sanders will win Nebraska Democratic caucuses."}]
