[{"comment_id":"10153721560403984","commenter_b":"We are protected by the Constitution. Christians founded this country. Gay people are harrassing HER, as there are dozens of other local offices that are issuiing these licenses for them. She is defending her faith and beliefs, not harrassing others. Do away with freedom of religion, and America is nothing.","commenter_a":"500%","post_message":"County Clerk Kim Davis has found herself at the center of a national firestorm after refusing to issue gay marriage licenses, even after the Supreme Court's decision. She's even being dragged to court herself, but she refuses to back down. Do you stand with Kim Davis?"},{"comment_id":"10154272140216336","commenter_b":"You do not agree with me because I want Trump to build the wall, and I want Hillary in jail!","commenter_a":"This clown gave cartoon maps to his citizens to help direct them to places in our border where they could run accross illegaly to work and send money back to Mexico. He's bought by the cartels and Fox is lame for giving him a voice in American politics!","post_message":"\"Pay for the wall? Why? Who is going to pay for the war on trade, the war on China's trade – it's [the] United States.\" Former Mexican President Vicente Fox Quesada said he is \"not for open borders,\" but advocates an \"intelligent and wise\" way to deal with immigration."},{"comment_id":"10153253749121800","commenter_b":"Heard this on 98 rock on way to work....halliarous!","commenter_a":"Masoud Jalali","post_message":"\"To be clear, a guy on CNN just said, 'Hey, if people are looking for news, I'm sure they can find it somewhere.'\" -- Jon Stewart"},{"comment_id":"636835003152516","commenter_b":"In these cases the police are the terrorists","commenter_a":"Balck white man woman cop civilian.. the real enemy is Terrorism.. and they are using all this crap to keep us from conentrating on them","post_message":"An important conversation for America. President Obama participates in special town hall event on race, justice, and policing. @webpagelink #POTUStownhall"},{"comment_id":"363912913812223","commenter_b":"This LOSER should not even be in this country!!!!!!","commenter_a":"I say disarm the cops on the same day that this turd becomes a vegitarian!","post_message":"Michael Moore Demands Cops Disarm!"},{"comment_id":"1136052583084752","commenter_b":"tainted bully!!","commenter_a":"hIS mOUTH RUNNETH OVAH!!! E","post_message":"Curt Schilling, an unemployed baseball commentator who moonlights as a volunteer political commentator on social media, has a hot take on President Obama: @webpagelink"},{"comment_id":"10153891492220575","commenter_b":"A DISGUSTING IDIOT RACIST TRADER WOMAN","commenter_a":"WHO HIRED HER RUBIO OR CRUZ?","post_message":"Surprise! So-called \"Trump supporter\" is a far left Union activist!!"}]
