[{"comment_id":"1264843663556103","commenter_b":"Christianity will not be dead, extremist Islam will keep it from dying and drying out. BTW atheist here.","commenter_a":"Because \"Christmas break\" is very Biblical. -.- I am so sick of these people hijacking God and MY Faith for their asshattery and hate. It's repulsive and they are such an embarrassment. And this is why Christianity will be dead in the US within the next 50-75 years.","post_message":"This kind of ignorance has no business influencing school children."},{"comment_id":"10154250290881337","commenter_b":"YES, WE UNDERSTAND THAT YOU ARE NOW A WOMAN, DO US ALL A FAVOR & STOP THROWING IT IN OUR FACES YOU BINT !!","commenter_a":"Please go away now. Everybody's over it","post_message":"Caitlyn Jenner is taking Donald J. Trump at his word..."},{"comment_id":"10153171511013690","commenter_b":"Strong woman always obsesses BOYS...","commenter_a":"Im guessing most if not all of those women are in prison for no other reason other than being born female. Women and children are always the worst abused in mens wars","post_message":"Hundreds of young children in Afghanistan are being forced to share a jail cell with their mothers; women who in many cases are protesting their innocence or have been convicted of so-called moral crimes. Many of those children are facing years behind bars, cut off from the outside world yet themselves completely innocent of any offence. People & Power finds out why: @webpagelink"},{"comment_id":"10153190279501336","commenter_b":"Haha!","commenter_a":"Oh Lord, they'll hug the bark off the tree over this","post_message":"Fifteen buffalo who escaped an upstate New York farm have been shot and killed."},{"comment_id":"10156121986485354","commenter_b":"I hope Hillary win cause we need dem stamps","commenter_a":"Since Pelosi has NO integrity then she would not know it and therefore in her little finite mind think Hillary has it, when she doesn't. As a side note, does anyone beside me get physically nauseous and ill when seeing photos of pelosi and hillary???","post_message":"Well this should make everyone feel much better."},{"comment_id":"10152912760116491","commenter_b":"Nichole with all respects, no one is entitled to ANYTHING! I simply illustrate that women must figure out exactly what it is they want before complaining about how things are. I purposely let the door close on a woman because I don't always hold it for a guy. Women give me a stink face so often and I tell them it's me treating them equally. Have a woman pay for her own dinner once and see how far you get to having a second date. ... List goes on and on","commenter_a":"I've been to the Middle East. There isn't an American woman alive that can talk to me about oppression by men. Women run this country. They are the reason men wake up in the morning. I feel women in this country have an identity crisis in that they want chilvary but in the same instance they want equality. Men are tough and ravenous towards each other. You want that then don't complain when men treat you as they would a fellow man. (I want to add this doesn't apply to ALL women just the ones it does)","post_message":"Much of what we hear about the plight of American women is false."},{"comment_id":"1382411831811576","commenter_b":"No reason to make threats or warn the Racist idiots..........when they start a ruckus, we'll bury them!","commenter_a":"..and people like you want to start a race war. You can't win that one...","post_message":"@webpagelink"}]
