[{"comment_id":"953112161448505","commenter_b":"Women.Stop having sex without condoms....","commenter_a":"Women. Stop having sex with Republicans.","post_message":"Sen. Elizabeth Warren has a powerful message for the Republicans that just voted to defund Planned Parenthood. Pass it on! Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1086763938002529","commenter_b":"\"The dangers of muslims...\" Yes, because American muslims have just been attacking other Americans day after day for years. Oh im sure theyre just waiting right? And in 10 years theyll still be waiting? And in 20, still waiting...","commenter_a":"Trying to desensitize the American people of the dangers of muslims.","post_message":"\"Mohamed Ahmed is not at a disadvantage because he's Muslim: On the contrary, as the reaction from Obama and the fawning media shows, he's privileged.\""},{"comment_id":"10154041877500586","commenter_b":"Oh really Dan... sounds like Nevia has your panties in a bunch, bc she struck the right nerve.","commenter_a":"Really Fox 13 this is your news let's hear about something that actually matters for once please","post_message":"So how many of your passwords made this list of the worst from 2015? It turns out, longer isn't always better."},{"comment_id":"902389386549543","commenter_b":"She is a fkn disgrace! #hilliaryforprison","commenter_a":"To all of you considering a third party vote or staying at home, facts show what that did in 2000. It gave us GEORGE BUSH. Remember Florida? Bush-2,912,790; Gore-2,912,253; Nader-97,488; Buchanan/Foster-17,484. Do the math. Please tell me, what good did that do? Are we way ahead of where we were 16 years ago? You know what Bush did. He appointed John Roberts and Clarence Thomas to the Supreme Court, gave us Iraq, Isisl and the Middle East, tax breaks for millionaires, FEMA during Katrina, the Great recession and the road to Trump. Read what \"Art of the Deal\" writer Tony Schwartz has to say about Trump and realize that it's better to have Hillary in charge while you use your outrage to build a party around progressives like Elizabeth Warren and Jeff Merkley. The unfortunate truth is, if you don't vote for Clinton/Kaine this year, we'll have Trump/Pence next year. ...","post_message":"\"Let’s go make history and elect Hillary Clinton the 45th president of the United States!\" —Tim Kaine"},{"comment_id":"10155896308790354","commenter_b":"I don't know about you folks but I'm sure getting tired of these niggers.","commenter_a":"Buy them a fucken air conditioner, get the money from Jackson's Toyota ripoff !","post_message":"***THIS JUST IN*** The environment is racist!"},{"comment_id":"10154101869331323","commenter_b":"He's a cunt !!","commenter_a":"Look at that mugshot! THAT is the face of a man who has just been caught doing, pretty much anything imaginable...","post_message":"Chancellor George Osborne is facing calls to reveal whether he has ever benefited from offshore tax havens after the prime minister bowed to public pressure over the Panama Papers by releasing a summary of his tax returns."},{"comment_id":"10153509891501051","commenter_b":"Oh ya.....that'll stop the criminals from getting illegal guns!","commenter_a":"AGREE all the way","post_message":"Do you agree or disagree with the majority of Americans on this?"}]
