[{"comment_id":"10153857469189197","commenter_b":"Sorry, she does need spanks to look even better ! And you know it !","commenter_a":"Lol....I love my Spanx!!!","post_message":"She was trying on dresses for an upcoming formal, but her mother took to Facebook following the experience they had inside the dressing room-->> @webpagelink After you read the mother's message to the employees, tell us what you think in the comments below!"},{"comment_id":"10153380386696130","commenter_b":"No, illegal immigrants do not commit 35% of murders in this county. Give me factual numbers.","commenter_a":"Everyone hating, yet he leads all polls.","post_message":"The rest of the media finally remembered that Donald J. Trump is entertainment, not politics! (We told ya so!)"},{"comment_id":"10154467163611051","commenter_b":"Madonna this is a women who invaded her on body with a cross,scum is all i can say ,yes she should be in jail","commenter_a":"trump does not have moral privilege to call anyone an ugly name, since he owns every ugly name one can muster to describe his repugnant behavior. Madonna does not come close to the names lying trump has called President Obama. Madonna \"tells it like it is\" and that is too much for Right wing nut bags.","post_message":"Donald Trump says he has only one word to describe Madonna."},{"comment_id":"10152902421671378","commenter_b":"She needs to set her asss down ! Cthu","commenter_a":"Ratchet asss fools ! The Baltimore Mayor is INCOMPETENT ! Her dumb az decides to enforce a curfew 24 hours AFTER the riot starts... #blankstare Why hasn't she called The National Guard ???","post_message":"#BREAKING Action News reporter Kenneth Moton is in Baltimore and this is some of what he is seeing this morning."},{"comment_id":"1715281765380661","commenter_b":"These adulta should be ashamed of themselves! Hoping whatever league they are in bans them from attending any more games!!!","commenter_a":"What a bunch of degenerate so called parents and adults. Useless to kids and society","post_message":"WATCH: Brawl breaks out between coaches at an under-10 baseball game. The stunned little kids don even know what to do. The video was provided to ABC News by a spectator. @webpagelink"},{"comment_id":"10152721939436051","commenter_b":"Your a cunt ya bitch","commenter_a":"Dumb bitch she would of been mad if the made her fat ass look fater","post_message":"This girl couldn’t believe what her school did to her yearbook photo."},{"comment_id":"595790673878859","commenter_b":"SHE NEEDED TO LEAVE!!!","commenter_a":"Ragheads go home .","post_message":"This Muslim woman walked into a salon and demanded all the men leave so she could remove her headscarf. It didn't take long for her to realize she had made a huge mistake and this hairdresser was not going to accommodate her entitled behavior."}]
