[{"comment_id":"1848439335433149","commenter_b":"Keen 😜","commenter_a":"@username @username Mari Funfax","post_message":"Put us on the next plane to Dubai."},{"comment_id":"1289811051085647","commenter_b":"Nothing prepares your for a move a bitch ass pussy makes smh","commenter_a":"Always gotta be ready. I definitely think it was a pussy move though","post_message":"What a cheap shot! #mma #cheapshot #wshh www.worldstarhiphop.com/videos/video.php?v=wshhfsWHNoydsw8M0AY7"},{"comment_id":"10153605782047522","commenter_b":"@username THE MORALS OF THE DEMOCRATIC PARTY AND IT'S FOLLOWERS HAVE RESORTED TO THE MOST LOWLY TO SPEAK IN PUBLIC...LENA DUNHAM SPOKE AT DNC CONVENTION. SHE ALSO WROTE A BOOK AND HEREIN IS A PASSAGE...NASTY...NASTY...GIRL...In the book, Lena Dunham describes an incident during her childhood in which she leaned down between her sister legs and spread open her vagina, saying the behavior did not alarm her mother and was the spectrum of things I did. At another point, she writes that she would try to bribe her sister with candy for a kiss on the lips, joking that a sexual predator might do to woo a small suburban girl I was trying.","commenter_a":"Not surprised. The media has been so bias lately, Clinton doesnt even need the DNC. She has the press. The hatred for this man by the media is astounding. The globalist and globalism will do anything, say anything, to remain in power.","post_message":"The latest in the polls:"},{"comment_id":"10154917863094654","commenter_b":"Can women join this Club??????","commenter_a":"this is the best!!!","post_message":"Handlers of Pennsylvania's most famous groundhog are set to announce whether the rodent will predict an early spring or six more weeks of winter. More about the legendary Punxsutawney Phil @webpagelink"},{"comment_id":"10153687651936509","commenter_b":"Dont worry everyone...Jane cant be taken serious. She is a white liberal woman. We all know they are idiots.","commenter_a":"A black man said this...\"Over The Memorial Day weekend. Over 56 people shot in Chicago, 28 shot 9 dead in Baltimore, & the bizarre thing is; They want you to know the 'Police' are the problem in their communities. And I guarantee you they ALLLLLLL called \"911\" asking the \"Police\" for help & assistance when these shootings took place (go figure). A Fool will never recognize his own foolishness.\"- Johnathan Gentry.","post_message":"An outbreak of Memorial Day weekend violence left nine people dead in 29 shootings, according to police and CNN affiliates. What's behind these deaths? @webpagelink"},{"comment_id":"10153509134104205","commenter_b":"Fuckdonaldbitchasstrump!!! @webpagelink","commenter_a":"Excellent point! That's why I think Unions came out for her, well some Unions! If they didn't and she wins, they aren't represented! If they back her and Bernie wins, he'd still be for them!!","post_message":"Hillary Clinton keeps a list of her political friends and enemies. She does this so her staff can quickly decide who to reward and who to punish when favors are asked. Basically it’s for streamlining corruption."},{"comment_id":"1220297847993003","commenter_b":"174742062548592helle Simons, she had the ability to dispense medicine to stop their suffering and didn't. That makes her a monster.","commenter_a":"I think this article is written very poorly and from a single minded view . Being Saint does not mean that you are perfect as no one is . It means you have strived all their lives to fulfill Christ mission and to serve God . If you don't believe in the church values and mission then why do you care who we canonize? Also when it comes to caring for people with a large organization things are much more complicated . There are many people who max out on pain killers and still feel pain in the hospitals. So when it comes to pain meds that are very valuable and they may not work why administer them ? In places like Calcutta it is not just a question of money but also transportation . They in fact hold more money then they need to but I very well doubt ...","post_message":"Is Mother Teresa a saint or an expertly-managed brand?"}]
