[{"comment_id":"1392678767477322","commenter_b":"I lived there for awhile, when I got out of the Navy and met a lot of great people.Trust me, we know there are many good people there.Just the idiots have loud voices. lol","commenter_a":"I have lived here for 66 years except for military time. Don't count me as one of these idiots I love this country, third generation Navy👍🇺🇸","post_message":"A new poll shows 1/3 or Californians want to secede from the USA over Trump. Here's EXACTLY what would happen if they got their way!"},{"comment_id":"10153755312209170","commenter_b":"These people have no understanding of history. Idiots","commenter_a":"Stupid on steroids.","post_message":"Because dumping tea into the harbor is exactly the same as smashing a window and grabbing a new flatscreen for yourself."},{"comment_id":"10153108119036037","commenter_b":"We should have been more selective when your ancestors came over.","commenter_a":"Towels and curtains have a purpose in the USA curtains go on windows and towels go in closet.s neither go on our heads ... if you wanna live love and respect ur traditional values then go enjoy them In your country not cram them in the face of good hard working American s","post_message":"Police in North Carolina say they are still investigating possible motives for the killing of three Muslim college students, whose relatives are pressing for hate crime charges against the alleged shooter. Legal experts, however, say a hate crime case could be difficult to prove. @webpagelink"},{"comment_id":"1495140610505964","commenter_b":"Candace Richerson what about roger Ailes? He's a jerk. So what","commenter_a":"The truth hurts doesn't it!??!!! She is well armed with actual facts. Unlike the people who speak for Trump: the sexual haraser, the racist, the bully and the Ukraine employee - But you Trumpets go right ahead and support the guy who loves Putin. Every Hitler needs a Mussolini.","post_message":"Sen. Elizabeth Warren calls Donald J. Trump a \"small, insecure money-grubber\" during her first solo campaign appearance for Hillary Clinton. Read more: @webpagelink"},{"comment_id":"10154715866881077","commenter_b":"A real woman would provide a chicken pot pie, just saying...","commenter_a":"Kiss my what? Real women can provide their own and don't need any man. After all, I have done just fine on my own with my 2 special needs children (because their father wasn't any sort of real man: his moto provide, but beat and refuse basic needs or the right for me to work) That being said real men and woman work together to get through life together. Men nor women are above one another. This billboard only assists in the purpose of one being better than the other and undermine equality, which we have been fighting so hard for.","post_message":"What do you think about this billboard?"},{"comment_id":"10154330471404087","commenter_b":"....because in a hostile foreign environment you may well have to...I say it's sound advice.","commenter_a":"We will make this World great again!","post_message":"Retired Gen. James “Mad Dog” Mattis once explained his life philosophy to fellow Marines as: “Be polite, be professional, but have a plan to kill everybody you meet.”"},{"comment_id":"977430998961803","commenter_b":"Europe just \"undid\" what the last Christian Crusades accomplished. All who refuse to convert to islam will soon be put to the sword.","commenter_a":"Europe is not the Europe we knew yesterday, history has been made today. Europe will not longer be Europe it is now a Muslim world. We just lost the wonderful world of Germany, France, Spain, England, Poland, Austria, etc. It's sad, the only one fighting for their country is Hungary and I give them a lot of credit, they don't want to lose their Christian faith. And America is next, we will be taking in thousands but the problem is we don't know if we are getting terrorist or good people. All I can say is God Bless us all,","post_message":"Why are the \"refugees\" mainly fighting age men? Where are the women, children and elderly?"}]
