[{"comment_id":"10152632178256813","commenter_b":"Shut up Statist. No one deserves jail because of an unpaid weed ticket. Jail should only be for Killers, Rapists, and Burglars. Is that too much to ask?","commenter_a":"I see, so break the law, claim you're poor, and get away with breaking the law. Talk about \"privilege\". :/ Being poor is NOT a \"justification\" for not taking responsibility for one's own acts. No more than being rich is a \"justification\" for not being responsible for one's own acts. It's interesting how people complain that the rich aren't being held responsible for committing violations of the law, then claiming that the poor should NOT be held responsible. Rich person doesn't pay their taxes, they belong in jail. Poor person doesn't pay for legal fines and fees, they should just be entirely excused for breaking the law. Interesting.","post_message":"Kevin Thompson was jailed for five days because he couldn't afford to pay fines and fees from a traffic ticket. Last week, we reached a settlement that promises to prevent others from being improperly jailed for being poor in DeKalb County. @webpagelink"},{"comment_id":"1115407108512795","commenter_b":"Jay Z is trash just like his skank wife!","commenter_a":"Can't stand Jay-Z, or his mop! Sad she has to pull the hypocrite card but in office she never did anything that's credible anyway!","post_message":"“He used every word in the book. Can you imagine if I said that?” asked Donald J. Trump."},{"comment_id":"10153938173248967","commenter_b":"That girl a punk","commenter_a":"It's been crazy windy. Was hard to walk.","post_message":"What's that nickname for Chicago, Illinois, again? Stay safe, people"},{"comment_id":"1526333487662909","commenter_b":"Trump, you just jealous it was not you to be the first to go there. Get a life you weirdo.","commenter_a":"Big talk for someone who is a national embarrassment.","post_message":"Wow, President Obama just landed in Cuba, a big deal, and Raul Castro wasn't even there to greet him. He greeted Pope and others. No respect!"},{"comment_id":"1184256164945951","commenter_b":"Feminists are the worst lays!!!","commenter_a":"You are lame and you shouting that you're a lesbian is boring. Try something beneficial? Go suck a big one.","post_message":"You can't make this stuff up, folks!"},{"comment_id":"10152620550458067","commenter_b":"Get a FREE Education, Graduate, and then move into your Parents Basement because all of the Illegal Immigrants have your JOBS.","commenter_a":"Tax money used for a good long term investment finally.","post_message":"BREAKING: President Obama to call for 2 years of free community college for all students. More details to come."},{"comment_id":"10153204052806051","commenter_b":"@username-You are a chicken !!!","commenter_a":"Obama is a terrorists","post_message":"This sign about President Obama is sparking a lot of controversy. Decide for yourselves if it's fair."}]
