[{"comment_id":"10152960155261336","commenter_b":"Illegal aliens receive EBT & all other assistance, including Medicaid & Medicare, Dorri McNeal Vigar. They need a TIN. They get it at the County Office or SS Office via their computers. They are the \"900\" series. If they have \"anchor babies,\" they get it. If they have children born in other countries, they get it. Now here is the un- requested bonus kicker: If they have a\"900\" series TIN, file taxes, & claim their children; even children residing in Mexico or other countries who have never been in the US, they can apply for the Child Tax Credit & get it. All they need is a TIN for each kid. The IRS is the largest remitter of funds to Mexico. When called on the carpet about it 2 years ago, the IRS became highly indignant & stated congress made no law disallowing them to remit for children not born ...","commenter_a":"And proof of US citizenship.","post_message":"Arguing that taxpayers lose $858 million a year on food stamp fraud, several GOP lawmakers have proposed a new bill that would require photo identification to use food stamps."},{"comment_id":"10153913587481341","commenter_b":"@username The fact is Israel is the nation of Israel since the time of David , Palestinian come here from Syria and Jordan bf 48 , The Things there is no one to talk peace , PA are feeding the money from Eu countries by cover of charity organization , Some money go to Games to take care of the poor but the majority go to weapons against Israel , i'get u the gov link who provide evidence , but u still won't believe cause u are dreaming in Lala land","commenter_a":"Israel has no moral or ethical values. It only knows how to oppress and terrorise people.","post_message":"Canada will be a frank voice in the Middle East, even if it means criticizing Israel, said the country's new Prime Minister Justin Trudeau."},{"comment_id":"197882667406213","commenter_b":"Get fucked cunts","commenter_a":"No regard for life! !!!!","post_message":"SICK & WRONG: Slaughterhouse worker caught on tape dancing with body of a freshly killed pig :( The other workers just laugh. #Reasons2GoVegan"},{"comment_id":"1901231699975547","commenter_b":"That don't count, She is a pig and certainly is Fat. Its not her fault it was the spoons fault.","commenter_a":"Wasserman hates men","post_message":""},{"comment_id":"10153702607362014","commenter_b":"Heck yes I'll be trying this!","commenter_a":"This makes me think of good luck Charlies Bob-burrito lol","post_message":"It's the hybrid you've always hope for (or quite possibly not)."},{"comment_id":"10156359711135354","commenter_b":"Take the fuckin niggers too.","commenter_a":"Yeah screw Obama and the Obama does not care health insurance bull crap. He can get the hell out of America and take his illegals, criminals and Muslims with him.","post_message":"“We’re going to be aggressive…”"},{"comment_id":"10153517803776157","commenter_b":"Hmmm,,, just a little chance of rain Victoria Marshall? Need some rain in San Benito!! :))","commenter_a":"Light","post_message":"Meteorologist Victoria Marshall CBS 4 News is tracking the heat and the chance for rain in your forecast below:"}]
