[{"comment_id":"842682652588978","commenter_b":"She needs to be kicked out of our country, we don't need trash like her kind around.","commenter_a":"Here's another puke, wants everything America has to offer but can't be happy with that, maybe the next time she appears in public, the police should not lift a finger to give it any protection, then she'll probably get stomped under the crowd, and she deserves every foot that would trample her arse!","post_message":"It is people like her that perpetuate hate. Police are the people that keep her safe. Do you think Beyonce needs to learn some respect?"},{"comment_id":"10150542434714999","commenter_b":"She will not be the next president. Do you see unicorns at all?","commenter_a":"Who cares!!! She'll still be President.","post_message":"Special Report: Hillary Rodham Clinton exclusively used a personal email account to conduct government business as secretary of state, State Department officials said, and may have violated federal requirements that officials’ correspondence be retained as part of the agency’s record."},{"comment_id":"10153218890796336","commenter_b":"^ baseball, hockey, and wrestling","commenter_a":"Should white people riot the NFL Draft?? 95% black were drafted last night","post_message":"JUST IN: Five of the six Baltimore police officers charged in the death of Freddie Gray are in custody, according to Mayor Stephanie Rawlings-Blake. @webpagelink"},{"comment_id":"1310434322356653","commenter_b":"@username you brought the feminism in when you started defending being a hoe","commenter_a":"Only one thing I disagree is he could have waited till the sun came out more to take her and the kids out. I don't blame him for his actions if his busting his ass to provide for her and the kids. If they your kids. Please don't abandon them. And she should be grateful he didn't hurt her. I'm praying they work it out for the kids if their his.","post_message":"He felt the punishment fit the crime. #WSHH #Cheating"},{"comment_id":"1764684433799515","commenter_b":"Class all the way !! Just think they want to make America great again !!","commenter_a":"Boring & hard to understand","post_message":"It was truly an honor to introduce my wife, Melania Trump last night. Her speech and demeanor were absolutely incredible. Very proud! #GOPConvention"},{"comment_id":"1596477097312385","commenter_b":"Illegal immigrants must not vote. That is against the law. All people must be made to show ID to make sure illegal immigrants are not voting and to make sure nobody votes more than once. It is simple common sense. For the very rare citizen who may not have ID they can assist them and pay the fees. It would only be a very few people. But everybody must show ID to vote and prevent voter fraud.","commenter_a":"Why do judges think only black people don't have IDs and considering everyone needs an ID for just about anything else, why would anyone not have an ID? All this law does is make sure there is not voter fraud...so in essence this ruling shows me that the court wants voter fraud, it's the only thing that makes logical sense. I think it may be time for other countries to oversee our democratic process or we need to stop telling them we will oversee theirs because we obviously have no moral high ground to speak on the subject in other countries.","post_message":"Unreal."},{"comment_id":"10152950876076130","commenter_b":"They're such bitches.","commenter_a":"Emma Green @username","post_message":"\"I cleaned the counter for you.\""}]
