[{"comment_id":"10153655047616130","commenter_b":"When someone makes those comments, they will learn what my bitch face REALLY looks like!","commenter_a":"Everyone: Are you okay? Everyone: You look tired. Everyone: You look upset. Everyone: You look confused. Everyone: Are you mad at me? Everyone: Why are you mad at me? Me: IT'S JUST MY FACE!!!!! This has been an accurate description on what it's like to live with Resting Bitch Face.","post_message":"Scientists say resting bitch face is real."},{"comment_id":"10154459591051320","commenter_b":"A Man hungry woman will sale their children's soul to keep a man at whatever price...Sad to say ...but true.","commenter_a":"I don't get how the mother didn't know. I'm sure this poor little girl had to be showing signs of withdrawing from people, especially him. She had to be acting different. Jesus this was going on for 5 years under this woman's nose. It's so sad that this child had no one to go to and kept this secret up to this point. I pray they don't let her have this baby. And for all you right to lifers, I'm sorry, this is a 13 year old child who shouldn't be expected to keep a baby resulting from a rape, when she's a baby herself. I pray that she doesn't have severe emotional scarring and other issues. Poor child... Smh. As for the POS, I hope they split him in half in prison and he bleeds to death.","post_message":"Disgusting: Police say Mark Sutton had been raping his girlfriend's daughter since she was 8-years-old. The mother found out when she took her 13-year-old daughter to the hospital and discovered she was four months pregnant."},{"comment_id":"1632303213733906","commenter_b":"This dumb chick is over reacting","commenter_a":"Yeah! No thanks your husband has already broken America","post_message":"One first lady has already lost to Donald Trump... could Michelle win in 2020?? @webpagelink"},{"comment_id":"1117807908334921","commenter_b":"@username Where is she from?","commenter_a":"Well what did you expect! Trump doesn't trust immigrants","post_message":"Donald J. Trump's peek at Melania Trump's ballot inspired a flood of jokes"},{"comment_id":"1181685188533567","commenter_b":"This picture is missing a muzzle for that big mouth!","commenter_a":"Her eye bags and pouchy cheeks disappear somewhat when her mouth is open like this. But then you see her overbite and buck teeth.","post_message":"It's happening!"},{"comment_id":"873971869318028","commenter_b":"You can hack those toys so easily","commenter_a":"Junior Marquina Perez & @username I WAS NOT ABLE TO SEE YOUR REPLY :'(","post_message":"Do your kids like the Minions? One family did a double take after hearing their 5-year-old daughter's McDonald's Happy Meal Minion toy speak:"},{"comment_id":"851850534874696","commenter_b":"Loads of respect for her now:) well done woman! Anything to wind those twats up makes my day","commenter_a":"Good","post_message":"Selena Gomez sparks fury by violating religious dress code in mosque."}]
