[{"comment_id":"1135206533157482","commenter_b":"this isin't just people is it mr.president but our enemy vowing to destroy us and your actions importing these islamic terrorists into our city walls is aiding our enemy to carry out their evil intentions . STOP THE POISON IMPORTS NOW !!!!!!!!!!!!!!!!!!!!!!","commenter_a":"But of course. We discriminate against people based on their skin color .","post_message":"Persecuting Muslims is not the answer."},{"comment_id":"758333967690514","commenter_b":"Pure, unadulterated ignorance. Lots of it going around. That guard shut them down","commenter_a":"Some people have no respect. So sad.","post_message":"These two men laughed at a military memorial. This guard shut them up without hesitation. Do you hate disrespectful people like that?"},{"comment_id":"10153702195241336","commenter_b":"What a WANKER .","commenter_a":"No , they either are true to their faith or to their country , not both !","post_message":"\"Mr. Carson may be a good doctor but he is not ready to lead a great nation.\" Today on \"Sunday Morning Futures with Maria Bartiromo,\" Sen. Lindsey Graham responded to Dr. Ben Carson's comments that a Muslim should not serve as a president. @webpagelink"},{"comment_id":"10154044362479024","commenter_b":"Let's cleanse American by not letting his sorry ass back into the USA","commenter_a":"tell Will Smith that we were here frist , and to fuck off","post_message":"With video. Bad things usually happen when leftists start talking about \"cleansing...\""},{"comment_id":"10154422800373132","commenter_b":"These women are smart?? Lol OK.","commenter_a":"This show is a flake need to be cancel asap.","post_message":"That's quite the family heirloom, Kim Kardashian West. (via PeopleStyle)"},{"comment_id":"1006685692721909","commenter_b":"hahaha, that's not what i had in mind! Just thought it was cool!","commenter_a":"@username Ali Sharp cool concept","post_message":"This is wonderful <3"},{"comment_id":"10153533383913145","commenter_b":"Ur an idiot. I blame your parents for that!","commenter_a":"I blame Obama for this guy.","post_message":"A Kissimmee doctor accused of sexually battering a patient could reopen his practice today. If he does so, it will be with some restrictions. A live report coming up at 7 a.m. on Eyewitness News This Morning on TV27 WRDQ."}]
