[{"comment_id":"10153244744761378","commenter_b":"Stfu","commenter_a":"Stop chasing people in residential communities!","post_message":"DEVELOPING: Police tell Action News officers were chasing a sedan when the driver lost control, hitting several parked cars, trapping one person in the wreckage. It began before 7:00 this morning in Glenolden, Delaware County. @webpagelink"},{"comment_id":"1290711880990755","commenter_b":"S'il pouvait balayer trump , ca ne serait pas un luxe !!","commenter_a":"SUS!","post_message":"I have been criticized for saying this, so let me say it again: I believe health care should be a right for all people, not a privilege."},{"comment_id":"10154837209509657","commenter_b":"Gowdy did you just find out that democraps cant be trusted? I could have told that to you years ago.","commenter_a":"The only thing that will cause changes is to put Hillary Clinton in jail. Make an example of her. Set an example that shows that politicians cannot go around lying and mishandling classified information without dire consequences happening to them. You have got to get that train back up on its tracks.","post_message":"Desperate times call for desperate measures."},{"comment_id":"10153736602849749","commenter_b":"@username - Why does Europe have to take these refugees? So many are military aged men. Why aren't they staying in their country and fighting to save it? Militant Islam is dangerous whether you agree to it or not. Letting these people into your country will diminish your country because these people will demand that you accommodate their religion and their way of life instead of them making an adjustment because they are guests. They will demand changes in established laws because they will not conform. These are not bigoted statements. These are facts that are easily verified.","commenter_a":"Why do militant atheists support the arrival of (militant?) Islam into Germany?","post_message":"German police spray left-wing protesters with a water cannon to keep them apart from an anti-Islam demonstration. See more: @webpagelink"},{"comment_id":"970527739636683","commenter_b":"Didn't notice the theme until I read the headline, after inspecting the goods.","commenter_a":"I don't see any injured vets? just hotness!!","post_message":"\"I'm not giving them back their confidence. They already have it.\""},{"comment_id":"434449293346332","commenter_b":"Oh Cheryl chill out","commenter_a":"Anyone who thinks this is ok and there is at least one person here, (@username, seems to think so) is an idiot.","post_message":"When a student couldn't pay for her lunch, school officials decided to do this with the food instead."},{"comment_id":"899546906747398","commenter_b":"F muslims, and GTFO!!!","commenter_a":"Heck no he is in the grave why would you move him ..when the Muslim can be buried somenplace else .this is against his family to be removed.","post_message":"Pathetic! (MUST READ)"}]
