[{"comment_id":"483898831770072","commenter_b":"@username Whoa, calm down woman.","commenter_a":"They could just import it from Iran. I wonder what's stopping that great deal?","post_message":"Italian caviar, that is."},{"comment_id":"942185122493609","commenter_b":"Please, get some more facts before you continue spreading such nonsense. Of course GUN voilence is down - but violence, homicides, etc are NOT. Home invasions are up though... bc criminals know responsible home owners aren't carrying any more. Please, get a clue. Guns are not the big problem, and more gun laws do NOT stop CRIMINALS. You know who gun laws hurt, responsible gun owners.","commenter_a":"Did any of you even read all the way through? Statistics clearly show that stricter gun laws prevent shootings. Look at Australia. They used to have guns. Had a massacre. Made them illegal. No more massacres. Their gun violence is almost non existent since they made guns illegal.","post_message":"So sad."},{"comment_id":"10153725740586336","commenter_b":"Who Cares. He's a Conservative Rapist","commenter_a":"Keep him on the other side of the Trump Wall.","post_message":"Police say Paul Jackson and his older brother, Vance Roberts, kidnapped prostitutes, drove them to Roberts' home and held them captive for days."},{"comment_id":"10153250160727235","commenter_b":"sue and angela, dumb bitchs","commenter_a":"I'm a gun owner and have a permit to carry. I'm also sick and tired of the gun nuts. There is absolutely no accountability on their part for the tens of thousands who die by guns every year. The NRA can kiss my ass also. Just a bunch of crazies and I'm sick of their crap. I also used to be a member. Time to grow up America and hold people accountable.","post_message":"What kind of people would be enraged because of a benefit for dead children? OH."},{"comment_id":"10154820857971438","commenter_b":"It's got nothing to do with controlling women, it's got to do with being the voice of the silent unborn. Who protects the unborn when they are being ripped apart because the woman who decided to have unprotected sex asks to butcher the unborn. No one has listen to the unborn small scream when they are being tortured inside their mom's womb. Look it up, and after you hear it and see it, you'll realize that a life, no matter how small, MATTERS.","commenter_a":"They don't. It's about control.","post_message":"I am sympathetic to the pro-life argument, but anti-abortion rallies leave me baffled."},{"comment_id":"10153930605634614","commenter_b":"Women.., please don't fight strangers...,they're not your husbands..,to be arguing all day...","commenter_a":"Only 13 years for her life. Really for someone killing a mother directly in front of her children what really he should of got life for each child plus mom no way appalled.","post_message":"Elizabeth Yanez was stabbed to death in front of her two children in a dispute over a parking space at the Santa Fe Springs swap meet. Her convicted killer, 23-year-old Reggie Cervantes, was sentenced to 13 years in state prison Tuesday for the 2014 attack. doesn make sense to me, nothing makes sense, the woman daughter said after witnessing the brutal attack. a parking space. How am I supposed to go on with my life? Read KTLA's story here: @webpagelink"},{"comment_id":"726323540858316","commenter_b":"Meryl shut your hole, no one cares what you have to say. Matter of fact put your money in California and pay their way. You are a dried up old hag from the movies and you didn't get their by yourself. We put you there. Get the hell over it and go get laid. LOL you probably can't even get that.","commenter_a":"Dodo. She will not only in be hibernation but soon will be extinct","post_message":""}]
