[{"comment_id":"10153199702710095","commenter_b":"We'll soon be seeing the kids wearing these shirts. Happens every election. Thanks for helping to clothe the poor in Africa and South America.","commenter_a":"Please take the time to read my little rant! And the article! Monday morning trash x 2 floors.. Plus 6 bathrooms to wipe up and make presentable, a floor and a half to sweep and mop, vacuum 1 study room, then I can begin in my own bathrooms according to schedule.. Ive mopped my half of 5th and finished up there about to sweep and mop my own whole floor.. All for $7.57 an hour.. Oh and I left our the part about the beer poured all over the floor near and in back of fifth floor trash cans.. Im not usually a complainer and I really feel sorry for the people that have been here longer than me. Pack the students in and don't worry these petty people will clean up whatever the students can throw at them.. I was also promised a raise after 6 months of my ...","post_message":"New Jindal for President shirts are available. Buy one today."},{"comment_id":"932169176839778","commenter_b":"And, they won't ever listen to us when they have all these illegals voting for them! I hope the Democratice citizens are taking note of all that is going on in our country!","commenter_a":"Americans had better listen to Anne Coulter. She is right and she is warning Americans what I have also been saying. We are losing America to illegal immigrants because of obama.","post_message":"A new Pew Poll found that only 24% of Americans want to increase immigration to the U.S."},{"comment_id":"10155546384855192","commenter_b":"Don't worry God would not choose an unworthy Woman to Have His Child. People no matter how much they serve Christ can still go through very hard times. He didn't say because you love Him, and serve Him that life would be easy.","commenter_a":"First of all to those that say praying won't help them.....You better understand that they don't worship God, or believe Jesus Christ died for their sins. Maybe that is why their world was shaken. God isn't playing. These are the end times. They need to stop the things they do, and accept Jesus Christ in their hearts.","post_message":"The death toll from Nepal's earthquake soared past 3,700 Monday and rescue workers are still struggling to reach two days after the disaster."},{"comment_id":"10153308958722411","commenter_b":"Beyonce ruins everything!","commenter_a":"Blah","post_message":"What did you think of the Super Bowl 50 Halftime Show? Highlights: @webpagelink"},{"comment_id":"1342374952487749","commenter_b":"We dont need these winers let them stay home,they wont be missed","commenter_a":"Let them skip more peaceful that way no whining","post_message":"LAME EXCUSES! CRYBABY DEMOCRATS To Skip Inauguration For FAKE Reasons Petty AND Partisan!"},{"comment_id":"10154174646349641","commenter_b":"That is so primitive to cage a living being and then let the others watch the poor thing. This is absolute human lowlesness as I call it, the worst specie in the entire universe for sure ! I hope humans will not go to outer space and colonize other planets and do the same thing what they did on Earth !","commenter_a":"Poor gorilla! Yes I agree the irresponsible parents are at fault for this incident.","post_message":"Ian Redmond, Chairman of The Gorilla Organization, said keepers had other options besides a fatal shot."},{"comment_id":"10153287032506770","commenter_b":"Ugliest drag queen","commenter_a":"She sucked big time!!","post_message":"Did you see her performance?"}]
