[{"comment_id":"10153238417336717","commenter_b":"Like regular hetero marriage is such a fountain of virtue. LOL","commenter_a":"What a nice slap in the face for marriage equality. They say they dont care what anyone thinks....I think they look like whores, when's number 4 coming?","post_message":"In case you missed it:"},{"comment_id":"10153379026314205","commenter_b":"Seriously , I don't know how these fraudsters were able to deceive their unsuspecting poor followers. Acquiring jets and planes at their expense. This is exploitation. The worst is that , it is these followers of them that will come and defend them. So sad indeed.","commenter_a":"I posted that video a few weeks ago. Shameless. I'm bustin' a gut. Hee, hee","post_message":"Televangelists: God Says We Need Another Private Jet!"},{"comment_id":"10153446133962550","commenter_b":"Because it's hilarious","commenter_a":"So no crime and no charges....Why is news then?","post_message":"Police found the 22-year-old man curled in a fetal position on the floor, groaning and surrounded by snacks that included Doritos, Pepperidge Farm Goldfish crackers, and Chips Ahoy cookies."},{"comment_id":"10153874605884270","commenter_b":"Jagdeep Singh Jagge sir, you need to study english literature. Also, Japan is/would be a US ally over China. You can not live in the past. Basing a country's actions on what happened nearly 100 years ago now is folly. The world and possible battlefield is ever changing.","commenter_a":"Japan technology is far ahead thn china, just they don't showof or not interested in military anymore after world war2(japan use less than 1% of his gfp for military).","post_message":"There has been a dramatic increase in sorties for the Japanese in the past year."},{"comment_id":"10153825338913690","commenter_b":"... and what does anybody to prevent it, concerning slave traffickers???,","commenter_a":"Well it's right what you say, but where is Qatar in that case? Shouldn't Muslims help Muslims. I can't see any help from Saudi Arabia, Qatar or UAE!","post_message":"\"To have the small bodies of babies and children carried ashore or washed up on these idyllic beaches is devastating. I have seen children sleeping in the mud under a flimsy bit of cardboard, and kids shivering with blue lips and hands. We expect the situation to get much worse as winter really bites.\""},{"comment_id":"1189532041066824","commenter_b":"only girls use pillow when they fight","commenter_a":"A pillow fight injured more than two dozen people????? Boy, are we ever ready for World War 3 if need be!!!","post_message":"UPDATE: A pillow fight at the United States Military Academy at West Point turned so violent that it caused concussions in 24 cadets, the superintendent of the school told NBC News on Saturday."},{"comment_id":"10156372463505354","commenter_b":"OMG that laugh of hers is so annoying and she is a ugly old bitch! Carley is so much more a women than Hillary could ever be and much more knowledge than the old hag. She let four Americans die in Benghazi she should not even be able to run for President and her emails and her and Bills Clinton foundation fiasco I could go on !","commenter_a":"She is sick","post_message":"*DEMOCRATS' WAR ON WOMEN* Remember how the liberal media EXPLODED when a questioner asked Trump about \"Muslim Obama\"? Well, look at THIS..."}]
