[{"comment_id":"1201604966547026","commenter_b":"Mortified to be in the vicinity of a penis? Why? You wouldn't be mortified surrounded by vaginas. Why is one suddenly more shocking than another? There's probably at least one lesbian I a crowded changing room and there's a good chance that the transgender woman prefers men. I understand being on guard I do. But not why a bit of dangling body parts suddenly makes that person mortifying to be seen by.","commenter_a":"Ok, I'm sure I will be shot down for this. Firstly, I don't think anyone likes communal changing areas, certainly not anyone I've ever met. I don't think the general issue with this is because you are transgender, although that puts a different slant on it. I don't think many people are happy getting their wobbly bits (of whatever kind!) out in front of strangers in a changing room. I'm sure you've experienced a lot of challenges in terms of getting where you are today and feeling comfortable in your body. I'm sure you have faced threats of and maybe actual physical violence. What I think you may need to bear in mind is that you don't know the 'journeys' of the other changing room users. Maybe they have experienced sexual violence. Maybe they have massive hang-ups about their body for whatever reason. Or whatever. Maybe they are religious. Maybe ...","post_message":"Four things I do to survive the gym locker room because I'm trans. - Parker Molloy"},{"comment_id":"1713956375559891","commenter_b":"I think ladies should have control over their bodies but what if your mama aborted you","commenter_a":"Bravo Guttier","post_message":"This is AMAZING. The ending is the best part. Share if you agree with Congressman Luis V. Gutierrez and give his page a LIKE! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152871405466717","commenter_b":"I remember seeing this it really touched my heart loved it!!! And those moms can suck it!","commenter_a":"Moms... eat shit and die! Hypocritical, bigoted ass-holes..... 1,000,000 Moms = about 12 homophobic morons!","post_message":""},{"comment_id":"553065348238039","commenter_b":"Boy please!! Your mama gonna beat you stupid!","commenter_a":"I'm black and voting trump. Most of my family's also voting trump. Even most of my friends are voting trump so the news is a joke nowadays. And in case your all wondering yea we are 90% black family and friends.","post_message":"Here's why Donald J. Trump is struggling to win over black voters."},{"comment_id":"1695797427350247","commenter_b":"She is so stupid. That will not fix it it has to be destroyed.","commenter_a":"Does Compassion, Unity, & Love make roundes in 5.56/223.","post_message":"Have you hugged a suicide bomber today?"},{"comment_id":"10153403140121037","commenter_b":"If she looks like that at 65, I want some of what ever she got hahahahaha","commenter_a":"getting paid to be in the media daily ? yeah nervous about something","post_message":"Watch the full video: Katie Couric speaks with Vanity Fair writer Buzz Bissinger and stylist Jessica Diehl about #CaitlynJenner's groundbreaking cover story."},{"comment_id":"10153197491081051","commenter_b":"She's already proven she's delusional","commenter_a":"Nancy - Have Another Drink !","post_message":"Nancy Pelosi says President Obama's Iran deal is simply brilliant. Agree or disagree with her?"}]
