[{"comment_id":"10153784576082439","commenter_b":"Yes nazi ideology wasn't rooted in Christianity , any person watching the military channel knows that, they were obsessed with the occult . I believe Islam , and I'm not alone is the new nazi. Same crap Nazis spewed, we are peaceful, trust us . But worse , almost all western leaders except Putin and couple Baltic states are not buying it . You'll see, next world war will be because of Islam","commenter_a":"We are doomed. I'm hoping I get cancer and die before Muslims raise the Isis flag at the Whitehouse, I'm a vet and will for go my veteran cemetery burial as Muslims will dig us all up, toss us aside and build mosques on these honored hallowed grounds!","post_message":"Anywhere American mores and law conflict with Islamic law and supremacism, it's American mores that must give way. Ripping out pews? It's sacrilege."},{"comment_id":"10153183452347490","commenter_b":"The photographer is a WOMAN!","commenter_a":"I have 3 perspectives on this photo: as a PO in charge of the flag, it is against flag etiquette. As a Navy retiree, we need more people to support our militaries and this photo he is a defender of our country and our families. As a photographer this has no words to express how beautifully this photo turned out.","post_message":"THOUSANDS RALLY AROUND PHOTO -- Navy vet and photographer says she's getting more support, and business, after her photo of a baby cradled in the flag made national news:"},{"comment_id":"10152532301590927","commenter_b":"In Mexico, illegal aliens trying to take up residence, jobs and asking for free healthcare are arrested, put on a bus and taken to the border to be dropped off without a second thought. If you're here in the United States illegally, you deserve to be arrested and shipped back to the border of the Country you originate from.","commenter_a":"Liberal bs.","post_message":"And the immigration debate gets personal again!"},{"comment_id":"10153624513811336","commenter_b":"Now the world knows what Cheryl is all about when it comes to black people..","commenter_a":"We also have a president who has made it open season on our police officers.","post_message":"This week on Fox News Sunday: Gov. Chris Christie discusses his 2016 strategy, the government and more. Check your local listings or tune in to Fox News Channel at 2p/6p ET."},{"comment_id":"1842076306034200","commenter_b":"But the opinion of a lying, misogynist, braggart like Trump is worth listening to ? Some people . :-(","commenter_a":"Worst acceptance speech ever Be appreciative of the award. Nobody watches the Golden Globes to hear your multi million dollar opinion","post_message":"WOW! Meryl Streep just brought down the house at the Golden Globes..."},{"comment_id":"10152910071581130","commenter_b":"@username, cry me a River. You don't see that those women keep on having babies that they can't take care of and are sold into prostitution. Oh, but im wrong for believing in controlling the problem. And no bitch, I got my tubes cut and burned, because I dont believe in having more then what I can take care of.","commenter_a":"Since they don't have protection & clearly can't afford children why not find alternatives to intercourse? Or maybe idk use some self control & abstain from sex altogether? They are consenting adult women fully aware of the possible outcome/consequences of their choices. Only people I feel sorry for are those babies born into a piss poor life because they have SELFISH parents.","post_message":"“Sharing a bed is fine, it’s okay to share and be all together. But it’s tough because what if the person next to you is sick? What if they pass that illness on to you and your baby?”"},{"comment_id":"10153196392273984","commenter_b":"Hey Stupid! Thanksgiving is a day of thanks not a stupid holiday for your illegals and muslin buddies. Let it be! Stop destroying this country.","commenter_a":"Can we get rid of him, NOW!! Outrage doesn't even begin to describe this!! Leave things be!!","post_message":"Unbelievable. There's no way Americans are going to stand for this... Are you outraged?"}]
