[{"comment_id":"1062730680414093","commenter_b":"Donald trump can't even get 35% registered republicans Please do the math Trump can't win a general Election. You remember my words I'm not being nasty\" just call it in the know. You will find out I'm correct.","commenter_a":"This is for all of my fellow Florida voters. I just received my mail in ballot. Donald Trump is on the very bottom of the list, so please be careful and select him.","post_message":""},{"comment_id":"972471592821368","commenter_b":"Don't beleave this is west point?","commenter_a":"yes they are acting like beyonce,stupid","post_message":"The image has spurred questions about whether the gesture violates military restrictions on political activity."},{"comment_id":"1163032473715499","commenter_b":"I hope Trump builds a wall 200 ft tall to keep these loosers out!!!!!!","commenter_a":"did the donald get him deported yet??","post_message":"Worker says he took a stand against Donald J. Trump and his immigration policies by hanging a Mexican flag at the Trump International Hotel in Vancouver. \"From the concrete pouring, finishing, drywall, taping, wood forming and general labour, Mexicans were there, building it.\""},{"comment_id":"1096205787130648","commenter_b":"this bitch looks horrible","commenter_a":"He sure doesn't call the Super predators you pos","post_message":"...says the woman who trashed tens of millions of working class Americans."},{"comment_id":"10153705260739218","commenter_b":"All Lives Mater...another life ended and another life over.","commenter_a":"Every man woman and child makes their own decisions in life...don't know the circumstances but he has to deal with the outcome..not his father...prAyers to both families","post_message":"The son of a Baltimore Police Department commander has been charged with murder, sources have confirmed to the 11 News I-Team on Tuesday >> @webpagelink"},{"comment_id":"10158183422455594","commenter_b":"What message are you sending? That nutty women can run around dressed as vaginas and cry out for the \"right\" for women to kill their innocent babies? Some message from you silly chicks.","commenter_a":"Funny how the negative comments are posted predominantly by males. Do we make you nervous and uneasy? Good. You should be nervous.","post_message":"Crowds went berserk for the big-screen actress as she waxed poetic in R-rated language on women's rights and the perceived threat the new administration poses to those liberties."},{"comment_id":"10153316007267144","commenter_b":"Why doesn't she ever just answer the questions and stop telling everyone everything else!! Oh yeah, because she is the biggest liar ever!!!!!","commenter_a":"Way to go Hillary Clinton!","post_message":"The whole room joined her. Watch."}]
