[{"comment_id":"942297612493435","commenter_b":"Yep....her attitude says it all!","commenter_a":"\"What difference does it make?\"","post_message":"\"I will not quit on you. I will fight for you. I will be there for you every single day.\"—Hillary in Iowa City, Iowa yesterday via Hillary for Iowa"},{"comment_id":"10155769419940231","commenter_b":"My thought is this Ladies; the occurrences, that we are know seeing unfold are strategic! I hope that you will agree that the system has removed a majority of our \"Black\" men who would physically engage in battle with the injustices. They are being removed from society and that weakens us as a people. They are imprisoned for a greater length of time, killed in unlawful ways right in our faces (bullets in the back, strangled and held by more than one, ect...). A great majority of our women are now out and about alone and really can not defend themselves physically against the powers that be! In addition I see more \"Black\" women, more than ever going to be the next victims of murder. This leaves our children more venerable than ever before!","commenter_a":"It would of not been like that if a man was in the car with her!","post_message":"It may not be in the way that she thought she would, but she has, indeed, changed history."},{"comment_id":"10153064195022377","commenter_b":"This lady is destined to be behind bars. Narcissus is her mode of operation and her eye shadow displays deceit.","commenter_a":"As I always Say, Can't Fix Stupid. SHE IS.","post_message":"Newsmax shares the 10 most crucial moments from the Planned Parenthood hearing."},{"comment_id":"10154064486021509","commenter_b":"Sure they alienate all woman","commenter_a":"A lot of you folks are so quick to follow the narrative. There has not been a debate in years. Just mud slinging and popularity contests. One thing is true though, the only thing the Clintons should be doing is life in prison. What a dirty dirty dirty duo.","post_message":"Could the GOP's opposition to Planned Parenthood at the #CNNDebate be a general-election vulnerability? Hillary Clinton's top aides seem to think so: @webpagelink"},{"comment_id":"10153414242381130","commenter_b":"And another. Oh those terrible feminists. @webpagelink","commenter_a":"Considering the male comments on this article, women aren't your equals. Thankfully.","post_message":"Ability? Absolutely. Opportunity? Nope."},{"comment_id":"538555889666037","commenter_b":"SHE IS NOT A SMART WOMAN","commenter_a":"She fails at everything'. We need #Trump2016","post_message":"She NEVER learns..."},{"comment_id":"10153444828331770","commenter_b":"Ignorant blacks thugs","commenter_a":"G.U.N. ?","post_message":"\"Man, I got that sh*t on camera, bro!\""}]
