[{"comment_id":"1505750879440568","commenter_b":"@username...you\"re a stupid girl.","commenter_a":"I really feel like if the voting system was trustworthy Trump would win. His crowds are just insane and people are so enthusiastic about him. However, I don't trust the system and I'm scared to death that she will win because it will be rigged. I am literally terrified of the possibility that she could be our president. I have legit anxiety about it.","post_message":"The election was supposed to be over months ago. But certainly this week it was not supposed to be in question. Hillary should have been... They're already planning inaugural balls and all the other trappings that go with victory. This is not where they wanted to be, and with the possibility Trump could win, they are in abject panic. And it's being demonstrated on TV."},{"comment_id":"978940745501376","commenter_b":"Fire Her!","commenter_a":"Forgive them; they know not.....wait, let's not.","post_message":"DISGRACEFUL MSNBC HOST: Katy Tur Speaks over the Star-Spangled Banner at Trump Rally (VIDEO) @webpagelink"},{"comment_id":"10154819113006336","commenter_b":"She'll pay one way or another! I would like to see her drug through a trial, but if it's going to take away from necessary changes to bring America back to its roots, then let Hillary continue to slowly sink her own ship! It being brought to light solely to cost her the election was good enough for me.","commenter_a":"Truth be told she has been tried and found guilty November 8 she was sentenced RIP girlfriend","post_message":"In a meeting with The New York Times, President-elect Donald J. Trump said he would not take the investigations of the Clintons off the table."},{"comment_id":"1061923367225138","commenter_b":"Shes a rino like glenn.. no one cares..","commenter_a":"Good riddance, campaign for the liar Hillary.","post_message":"“This is not a decision I make lightly, for I am a lifelong Republican.”"},{"comment_id":"965586620162170","commenter_b":"Scumbag","commenter_a":"....too many \"GUNS\" on the street....and who is holding these guns????? The criminals, thugs, refugees, muslims, and other monsters that are given free reign and encouragement to commit these crimes against innocent citizens! Another elected official with his head up the governments butt!","post_message":"BREAKING…CAUGHT ON TAPE: 30 Yr Old MUSLIM MAN Ambushes, Shoots Philadelphia Cop Several Times “I’m shot. I’m bleeding heavily!” Muslim shooter says he did it \"In the name of Islam\" When Obama's War On Cops and Islamic Terror collide...."},{"comment_id":"10156132117065725","commenter_b":"I appreciate you being so kind and politically correct. And you laid out a solid, arguably INDISPUTABLE, case there. But, as you pointed out, this is absolutely willful ignorance, so real facts don't mean anything when talking to a trump supporter. They have a feeling, form a belief from that feeling, and then that feeling morphs into a \"fact\" without any due diligence. And, unfortunately, all of their beliefs stem from feelings of bigotry (irrational hatred of an entire group of people). I'd love to have an honest conversation with a trump supporter about his policies. But they won't, because trump doesn't have any feasible policies, he simply says things are bad or good (which we all have the ability to do). What any trump supporter does when confronted with a lack of actual policy, with his track record of insults and short sighted aggression, is blame someone else somewhere ...","commenter_a":"The man did not make a \"nasty or controversial statement.\" He made a series of absolutely false allegations. Correcting him after he spoke could not possibly have been construed as interfering with his right of free speech; you would have only been interfering with his right to be ignorant. Which, apparently, is a sacred right to some of your supporters. And if somebody had made a series of absolutely false statements about you to the President, yeah, I'm pretty sure he would have corrected them.","post_message":"If someone made a nasty or controversial statement about me to the President, do you really think he would come to my rescue? No chance! If I would have challenged the man, the media would have accused me of interfering with that man's right of free speech. A no win situation!"},{"comment_id":"1573366636056793","commenter_b":"LOL And people trust this bitch. LOL Good little sheep BBBBAAAAAHHHHH","commenter_a":"Why this isn't on the headline news?","post_message":"She used the racial slur over and over and over..."}]
