[{"comment_id":"843323745763879","commenter_b":"I do Tim!! I don't care that gays get married & I wouldn't dare force a female to give birth to a baby she doesn't want!!","commenter_a":"i thought you guys hate christians","post_message":"Oh, the irony!"},{"comment_id":"10155399536459199","commenter_b":"Oh ok was wondering how close this happened it didn't specify what a sick man hope they catch him fast.","commenter_a":"Where is Lakewood Commons I live up by Lakewood high school?","post_message":"The man was about 6 feet tall and rode off on a green bicycle after exposing himself to the child."},{"comment_id":"10157413216720594","commenter_b":"Mom's instinct to protect their young.. Right or wrong.","commenter_a":"I say let the son alone and send his parents to jail for a long time for raising and protecting a rapist son. Whatever this parents are doing is making their son believe he did not do anything wrong.","post_message":"It makes a powerful statement about a parent's will to stand by a child who is morally culpable and has committed a crime."},{"comment_id":"10154969717088352","commenter_b":"She need to sit in jail for a good 30 days!! Bet she won't think that's funny!","commenter_a":"And what's her punishment??!!!","post_message":"Massachusetts cop’s wife ‘faked robbery and spray-painted the letters BLM on her own home to blame Black Lives Matter supporters’"},{"comment_id":"10153483204295667","commenter_b":"Nardine","commenter_a":"Robert Taylor","post_message":"Do you see a ghost in this photo? Henry Yau took this photo at the Stanley Hotel, the real-life inspiration for Stephen King's 'The Shining.' Yau says no one was on the stairs."},{"comment_id":"592725884246871","commenter_b":"She looks like the devil","commenter_a":"She is definitely easier on the eyes than the current one or the wicked witch running for pres","post_message":"Would Melania Trump be a good First Lady?"},{"comment_id":"774141519351123","commenter_b":"I hate when people treat service workers less than human just because they are having a bad day. I have been there as a server. Some people are evil!","commenter_a":"Entitlement, is why ppl act the way they do. But as a Manager sometimes you have to take what the customers throw at you, they are not always right but you make them Think they are! Its all in a days work, manager or not, right or wrong, you look like an ass when you throw a fit like this.","post_message":"Wow."}]
