[{"comment_id":"1160091574027415","commenter_b":"You are more than disgusting","commenter_a":"Yes!","post_message":"Do you think The View should be CANCELLED from TV?"},{"comment_id":"1779050492377737","commenter_b":"She can suck a large hot dog my dog is smarter than her","commenter_a":"He can sue her and make her prove it.","post_message":"Star Wars actress Carrie Fisher speculated Sunday night that Donald Trump’s occasional sniffling during the second presidential debate stems from the fact that he is “absolutely” a cocaine user..."},{"comment_id":"10156232723535354","commenter_b":"There is no viable comparison to prohibition. This is not a gun ban. It's apples and oranges. This is simply sensible purchase laws.","commenter_a":"The answer to something like this is not more laws imposed by a federal government. It never works, it never will. Did prohibition prevent alcohol consumption? After prohibition alcohol became more dangerous to consume; crime increased and became ; the court and prison systems were stretched to the breaking point; and corruption of public officials was rampant. Prohibition removed a significant source of tax revenue and greatly increased government spending. It led many drinkers to switch to opium, marijuana, patent medicines, cocaine, and other dangerous substances that they would have been unlikely to encounter in the absence of Prohibition. Now we have the \"War on Drugs\" has that worked? Has Lyndon B Johnson's war on Poverty reduced poverty? It's been 50 years and it appears to be getting worse every year, there are approximately 100 million americans receiving some type of government assistance, an all time high. Has the department ...","post_message":"\"This makes Mercer just one more public attacker who cooperated fully with all gun control, then went on to commit heinous crimes against innocent life.\""},{"comment_id":"1230909136991106","commenter_b":"👌 well done my counterpart.","commenter_a":"Ill leave this here.","post_message":"Sad, but true..."},{"comment_id":"10153212063865950","commenter_b":"U go girl.....GIRL POWER....kick that pussy ass thieves ass","commenter_a":"Wow. Go serena","post_message":"When Serena Williams saw a thief snatch her phone at a restaurant, she took matters into her own hands. Without thinking, she jumped up, leaped over a chair or two and chased the suspect down. She was on him in a flash."},{"comment_id":"10153766161047217","commenter_b":"Stoning , beheading , kill non believers . No thanks not for me if that's peace then I'm a fairy","commenter_a":"Islam, this outdated cult ,has no place in a 21 century world....the quran is nothing more than a military pamphelt and islam is based on a cry for war to no end....madness......","post_message":"\"It's become much harder for modern women to live here after Friday night.\""},{"comment_id":"10152999450927439","commenter_b":"This is so out of hand! what the hell are they afraid of! get them out!","commenter_a":"Muslim Brotherhood terrorists","post_message":""}]
