[{"comment_id":"10157972017965093","commenter_b":"@username Hey moron why couldn't those 3 legged blind goats beat trump.","commenter_a":"They couldn't beat Trump, what makes you think they could beat Clinton. Just asking the question tells me that you still haven't figured out exactly how fed up people are with the Republican leadership. They, and their democratic counterparts are the reason people are crying for term limits.","post_message":"You decide..."},{"comment_id":"1280473441987748","commenter_b":"Why is it that when someone makes a valid point. He or she is told to leave. His country was solely built on the backs of slaves. Leave a country you built. How bout leave a country you stole","commenter_a":"Don't like or agree then leave the country if shit offends you... like mama said I'm pretty sure the grass isn't greener on the other side but your more than welcome to check if ya don't like it here just don't let the door hit ya in the ass on the way out ....","post_message":"Massive respect to Colin Kaepernick for having the courage to speak out!!"},{"comment_id":"974683422567079","commenter_b":"Ignore this woman! NWO!","commenter_a":"The people that surround her, and adore her, are walking dead at best....gonna be a blast to watch her debate a Socialist in the Democratic debate, hope the POS screws up royally.","post_message":"PROOF that the liberal media is in the bag for Hillary!"},{"comment_id":"1247749101912765","commenter_b":"It's so well done!","commenter_a":"@username Martha Elizabeth","post_message":"Periodic pumpkins!"},{"comment_id":"10153776813241336","commenter_b":"Bye-bye!","commenter_a":"Good riddance!","post_message":"Ahmed Mohamed’s family released a statement saying they had accepted a foundation's offer to pay for his high school and college in Doha, Qatar."},{"comment_id":"657748434349749","commenter_b":"CANCEL the game, go to half time show, then go home. Terminate the remainder of football season. Have each player turn in his jersey...","commenter_a":"I WOULD LOVE TO SEE AN ENTIRE STADIUM WALK AWAY FROM THIS CRAP...","post_message":"The entire team decided to pay tribute to Kaepernick and take a knee during the National Anthem. Guess how that worked out for them."},{"comment_id":"10154429812461051","commenter_b":"Damage fags","commenter_a":"Impeach Trump","post_message":"The World Bank claims Trump could be the best thing to ever happen to the American economy. Do you think they're right?"}]
