[{"comment_id":"404872436304464","commenter_b":"Pieces of shit like her need to be culled, slowly an painfully.","commenter_a":"Now I've heard everything. Hurry up with the \"Big Payday,\" Lord.","post_message":"A woman and her cop husband were at a bar for a drink before she got on the road and ran over three teenagers riding their bikes. Now she is suing the boy's family for the \"trauma\" she was put through by hitting and killing one boy and permanently injuring two others."},{"comment_id":"10154105541082093","commenter_b":"Yea man! Go Donald. Get rid of the illegals. I can't wait","commenter_a":"Jeff Sessions = KKK! Another good ole boy for Donald trump...","post_message":"They held up hand signs saying, \"Go Jeffie Boy!\" and \"KKK\" ... The Alabama Republican was rejected for a federal judgeship 30 years ago amid accusations of racial insensitivity... @webpagelink"},{"comment_id":"1247936331966085","commenter_b":"So tired of explaining this exact sad truth.","commenter_a":"Learn the difference.","post_message":"It was clear from the start the criticism wasn't about the flag."},{"comment_id":"10153161231757411","commenter_b":"She should have thrown herself out the window!","commenter_a":"Saven Haven laws.... she could've just walked to the nearest church, hospital, police station etc and said \"Here\" as she handed over the baby and walked away ..... so heartbreaking !","post_message":"Woman charged with killing her newborn baby, after throwing it out of an 8th floor window in Chicago's Uptown neighborhood. Full story: @webpagelink"},{"comment_id":"10153296497591519","commenter_b":"@username No, I kiss your mother with that mouth.","commenter_a":"Racist Republican Religious Lying Christian Coward Party.","post_message":"\"Religions are not all the same, with some being more peaceful than others...\""},{"comment_id":"10152610870925950","commenter_b":"And go on a global eradication war to execute 2 billion Muslims.","commenter_a":"AND; the 100,000 troops need to come from the Middle Eastern nations (not the U.S.)!","post_message":"According to a CIA insider, it would take 100,000 ground troops to effectively respond to ISIS."},{"comment_id":"10154551576694030","commenter_b":"White people love mayo and ranch. I lovvee ranch bruh.","commenter_a":"I didn't see this as particularilly white. Like people of color don't use mayo?????","post_message":"You can't help who you are. Kyle Kinane's Loose in Chicago premieres tonight at 12a/11c."}]
