[{"comment_id":"1167192579994034","commenter_b":"Hi joannie.","commenter_a":"Yet John Calvin believed and taught that murdering a baby in the womb was an act of the god that he worshiped. That god is the cause of everything including sin.","post_message":"Amen!"},{"comment_id":"982212811884970","commenter_b":"This is so outrageous! Homeless Americans, hungry children,and people out of work and these people live like royalty. They need to be gone.","commenter_a":"shameful","post_message":"This was the Obamas eighth Hawaiian family vacation. The trip has become an annual event for the Obamas. To date, Obama and his family travel expenses total at least $85,029,819."},{"comment_id":"1017996811629034","commenter_b":"Wat a dumb bitch","commenter_a":"PUT YOUR GUNS DOWN????? What the fuck she's stupid","post_message":"This Black cop is furious about other cops not owning up to police brutality."},{"comment_id":"10154197437622426","commenter_b":"It's reality, white suburban women. It's not fair but it's a fact. If you're so concerned why don't you go down to Hillside Court and walk the kids home from the bus stop.","commenter_a":"School need more money but kids have 300$ shoes .500$ phones and say look at me and wonder why this happens.","post_message":"The robbers, described by police as young adults, threatened to beat-up the student if he did not take off his shoes and hand them over."},{"comment_id":"1109370075781392","commenter_b":"@username, do you think the military being forced to lower their standards to allow females into front line infantry units is a good thing? The Marine Corps did numerous studies that show infantry units became much less effective when women were added. Currently, a special forces Sgt. is being court martialed and will be less than honorably discharged because he confronted an Afgan police officer and pushed him to the ground because he was ongoingly raping a little boy- that's a good thing? Our veterans are literally dying because they are having to wait for treatment from the VA - that's a good thing? A lot of great officers are being let go and forced out because they don't agree with Obama's policy's....that's a good thing? The current ROE's tie soldiers hands and put them in danger. The morale is at an all time low....things are not good. THis plus ...","commenter_a":"Our military is second to none! The only people questioning the readiness of our military forces are Republicans! There isn't one nation on the planet that wouldn't trade to have both our military personnel and equipment! So stop perpetuating a political lie in the hopes of portraying President Obama as un-supportive of our troops and military leadership!","post_message":"When President Barack Obama took office, he inherited a professional, world-class, battle-toughened military. Seven years later, many experts see the U.S. armed forces as a tattered and demoralized organization. In a special 'Fox News Reporting - Rising Threats - Shrinking Military,' Bret Baier investigates what Obama has done with – and to – the military. Don’t miss it Friday at 10p ET on Fox News Channel. @webpagelink"},{"comment_id":"10153836785761350","commenter_b":"Lady do you even know.what the truth is? Doesnt seem like it","commenter_a":"Trump is the ONLY one telling the truth and saying like it is,,,,,,Obama just lies,,,,","post_message":"\"We have a whole bunch of Americans, Trump supporters and his support I think will grow after this moment who feel that no one is telling them the truth and no one is saying what is obvious to them.\""},{"comment_id":"10153527313703525","commenter_b":"You can kiss my dick","commenter_a":"Florida has alot of crazy old out-dated laws that are on the books!! Check it out and you will see!!","post_message":"'SHACKING UP' LAW: As soon as the governor signs the bill, it will no longer be illegal to live with someone you're not married to. STORY: @webpagelink"}]
