[{"comment_id":"1333824080002554","commenter_b":"@username love that red dress","commenter_a":"Jessica Phillips @username Jasmin Pluto this is great","post_message":"WTF does \"girlfriend material\" even mean?..."},{"comment_id":"888390488018194","commenter_b":"Feminazi bitches","commenter_a":"This program has got to go...what is Disney thinking...stopped watching it long ago....they have become left extremists...they are just like the long time politicians...our view is the one that you people should be thinking...totally out of touch with common people...don't these so called stars get it...we don't care what you think","post_message":"Let's help them pack their bags. Do you want The View gone?"},{"comment_id":"950451268383973","commenter_b":"I look forward to never looking at this Obummer again!","commenter_a":"Why is it everybody is out to get Trump? It seems to me they are so scared he may get President they have stooped to the lowest ways to destroy him....it just wants me to vote for him more because they are scared he will and the fact is it will ruin the political garbage at the white house who are trying to bring our country down.....I want our Country back and the Constitution back to what it was meant to be!!!!!","post_message":"“Good luck with that…We’ve got serious problems here.” President Barack Obama addressed Donald J. Trump's plans to build a wall and get Mexico to pay for it."},{"comment_id":"10154994136091800","commenter_b":"He probably knee jerked so hard he got a bloody nose and blames it on picking it too much!","commenter_a":"Trevor Noah is a puppet... Go back to south Africa where division is welcome stop trying to divide my country with your shitty humor... #Bringbackstewart","post_message":"The Daily Show recaps President Trump’s flurry of executive orders."},{"comment_id":"10153333951429575","commenter_b":"We do.","commenter_a":"It's called intuition. But I'm glad it happened.","post_message":"\"I just said I need to go check on him working on the car. I just believe a spirit told me.\" She felt something was wrong with her husband--and she was right."},{"comment_id":"898473566912365","commenter_b":"@Patty Royer, please do not breed. America already has enough mouth breathing inbred idiots and you, madame, and I use that in it's professional sense, Are their Queen.","commenter_a":"And the Republicans encourage this kind of person.","post_message":"No surprise at all. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152800411296051","commenter_b":"Nice with her hands","commenter_a":"Good.","post_message":"This guy noticed a 12-year-old girl walking alone and thought she’d be an easy target. He had no idea who he was messing with."}]
