[{"comment_id":"10153750734644369","commenter_b":"Ya, and you will go after corrupt windbags in D.C next? It looks good on paper, but it wont happen. There are laws in place that wont allow this to happen. Take the LLC for example, go after the company but cant get the person. But then again, when did laws ever apply to this administration.","commenter_a":"They need a home now!!","post_message":"It is a \"significant scaling up\" of the U.S. commitment to accept refugees from Syria."},{"comment_id":"1163296670367051","commenter_b":"Oooooo","commenter_a":"@username @username ummm they airways served alcohol. Unless they are talking about Webster","post_message":"Chuck E. Cheese's: Where a mom can be a mom! The family-friendly chain is hoping to lure in millennial parents by adding beer and wine to the menu."},{"comment_id":"10156422552765354","commenter_b":"Mexcans, niggard and white hoes need a good kick in the ass.","commenter_a":"Unbelievable! ! Round their butts up and get them out!!","post_message":"The group chanted “Let them in, Abbott let them in” and “Governor Abbott shame on you.”"},{"comment_id":"10153534266495399","commenter_b":"We don't need him and take little Mexico with you","commenter_a":"And he's supposed to be the \"smart\" one?","post_message":"Asked to clarify, Jeb said, \"Things happen all the time. Things. Is that better?\""},{"comment_id":"10153396293173525","commenter_b":"@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been \"taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns. STORY: @webpagelink"},{"comment_id":"10154221705040530","commenter_b":"What a dumb bitch!","commenter_a":"Black on Black crime really needs to stop. So sad this young lady endured such hatered and pain from peers of her own. Rest in peace. I'm praying the killers are soon arrested and face the fate of their punishment real soon, behind bars for the rest of there life and no parole it will serve them right","post_message":"Amy Inita Joyner-Francis, 16, died Thursday morning during a violent attack in the girls bathroom."},{"comment_id":"1044706655577881","commenter_b":"She know she be giving up the boot-Tay lmao","commenter_a":"This isn't even news! Yes fox 10 just post BS stories that are none of our business....","post_message":"SOUND OFF: This is Chelsea. She's 20, lives in Florida, and travels the world with men she meets online... on their dime. She says there's no pressure to do anything other than hang out with these men. What do you think? Let us know, and we'll share your comments on FOX 10 Arizona Morning!"}]
