[{"comment_id":"10154428619792144","commenter_b":"Kimberly, other than Melania Trump, you wouldn't know an illegal immigrant from a U.S citizen if your life depended on it. Get ahold of yourself woman!","commenter_a":"Seriously????? Let it go.....He's done, THANK GOD!!!!!! The end of an ERROR....","post_message":"Thank God."},{"comment_id":"10153025802828205","commenter_b":"Cindy @username please those immigrants pay taxes and guess what they can't file them every year. So the United states keep them. And I bet you would do anything if your kids didn't have an education. Or food on their table. Yes those that killed . Do bad things should be deported. Those parents that work . Some people like me have small business. So shut up if you never been on a situation where you don't a choice.","commenter_a":"If the above bill goes trough then where does ending DACA and deportation come in? They are giving them an opportunity for citizenship which if they do that then they should deport their illegal parents especially if the kids have completed school and working. No compromise here or you Republicans will never win the White House and I will only vote to get all Rhinos out of their cushioned thrones.","post_message":"On #TBT, remembering when my Republican colleagues believed in protecting immigrant children, just one year ago. Yesterday, they voted to end #DACA and deport #DREAMers. What a difference a year makes."},{"comment_id":"10153199702710095","commenter_b":"We'll soon be seeing the kids wearing these shirts. Happens every election. Thanks for helping to clothe the poor in Africa and South America.","commenter_a":"Please take the time to read my little rant! And the article! Monday morning trash x 2 floors.. Plus 6 bathrooms to wipe up and make presentable, a floor and a half to sweep and mop, vacuum 1 study room, then I can begin in my own bathrooms according to schedule.. Ive mopped my half of 5th and finished up there about to sweep and mop my own whole floor.. All for $7.57 an hour.. Oh and I left our the part about the beer poured all over the floor near and in back of fifth floor trash cans.. Im not usually a complainer and I really feel sorry for the people that have been here longer than me. Pack the students in and don't worry these petty people will clean up whatever the students can throw at them.. I was also promised a raise after 6 months of my ...","post_message":"New Jindal for President shirts are available. Buy one today."},{"comment_id":"10154411481819062","commenter_b":"Or the reverse at movie theaters. How will women react when a bunch of not-women get in line in front of them while the men's restroom has nobody in it?","commenter_a":"So he/she's will get to sit on the can in the Women's rest room. Well turn about is fair play, women using the men's room when there is a line at sporting events. How will men react when they are standing at the urinal and a woman walks by heading for the toilet stall?","post_message":"HAPPENING TODAY: In about an hour, business leaders are expected to reveal their plans to support the Houston equal rights ordinance."},{"comment_id":"1172807002807988","commenter_b":"But you know it's hard to dress a tranny and make anyone think they're a woman !!!","commenter_a":"Well this certainly has nothing to do with the article, but thank goodness Michelle's designer will not be dressing Melania. Think how hard it was to come up w flower gardens, etc to cover all the hair on Michelle's chest every time she dressed her. Melania's designer will have it much easier dressing a woman w a figure.","post_message":"Looks like Michelle saved her most patronizing comments for last. When you see what she just said, try not to lose it! Are you ready for Melania Trump to be the First Lady?"},{"comment_id":"10157164250770206","commenter_b":"yeah allowing syrian refugees into your country , with no skills or money , will really bring about progress and sustained growth.","commenter_a":"nope not gripped by it.","post_message":"The Turkish Coast Guard has released a gripping video of a Syrian refugee being rescued after his boat sank – killing 27 people, including at least 11 children. @webpagelink"},{"comment_id":"10155107164375231","commenter_b":"She's about as black as Clarence Thomas.","commenter_a":"She literally is Clueless","post_message":"After remarks about “good girls” and “naughty” women Stacey Dash proves that 'Clueless' is a perpetual state of mind for her."}]
