[{"comment_id":"587990821351234","commenter_b":"2","commenter_a":"2","post_message":"Some say two, some say 13 can you tell? Take our TODAY poll!"},{"comment_id":"736524969871414","commenter_b":"True she needs to sit down some where and just grow old. If they don't put her in jail.","commenter_a":"I had been wondering about Hillary and her health. I was just thinking today what if Hillary should get sick if she's in office. Woman have a tendency to become ill as we get older. Has had her menopausal years. Hell because when I get sick I don't want to be bothered by nobody. I don't think Hillary would able to handle this president stuff. Not that we don't want her to be president I really don't think she would make it. Stress on a woman is not good. It triggers other types of sicknesses. I know about that stress. I had to quit a job because of stress. I was so damn stressed out I came down with hyperthyroidism that made me lose 94 lbs in one month. Due to stress. My doctor made me quit my job or die. And I had been wondering about Hillary Clinton. She's ...","post_message":"BREAKING: Hillary Clinton's Health In Jeopardy... Campaign Could Be Over Either way she was never fit to be president. She should retire early. Can we get 30,000 'LIKES' to have Hillary drop out of the race?"},{"comment_id":"10153220980835950","commenter_b":"Calm your tits lady damn it's fuckin cup!","commenter_a":"I CARE ! That \"plain red cup\" represents the disdain that Starbucks and its homosexual CEO have for Conservative and Christian values. Except for the color red,Starbucks refuses to advertise any semblance of the Christmas season or what it represents..Well I don't intend to patronize their coffee shops again ! They can HAVE their liberal agenda and I\"ll continue with my Conservative principles !","post_message":"WATCH: At campaign rally, Donald J. Trump says maybe we should boycott Starbucks over plain red \"holiday\" cup design, promising: \"If I become president, we’re all going to be saying 'Merry Christmas' again, that I can tell you.\" @webpagelink"},{"comment_id":"1353532451354276","commenter_b":"Said the blond headed, blue-eyed white woman.","commenter_a":"I am so sorry if this happens, your fear, only because your skin is darker than mine. But I kinda think all of this has happened to white skinned people as well. If we could all walk argh nd inside out we would see assholes right up and recognise good when we see it. Its not about race for everyone. Some of us see us all as people!!!","post_message":"This man shares his haunting testimony: He too is afraid of being killed by the police. (via KevOnStage)"},{"comment_id":"10152834207221130","commenter_b":"Suzie Mills when all the GB is gone xx","commenter_a":"Mark O'Halloran","post_message":"Practice makes perfect, little buddy."},{"comment_id":"10153750514111336","commenter_b":"Why isn't the media reporting on the violent acts being perpetrated by these muslim 'refugees' in Europe? Shouldn't Americans know the type of filth Obastard wants to bring to the US?","commenter_a":"The religion of peace strikes again.","post_message":"“I was taken by three men,” the murdered Syrian woman reportedly said. “Ever since that time my family has regarded me as unclean... They say that I deserve to die.”"},{"comment_id":"10153359842468984","commenter_b":"Love it .. Good for the Bitch /Bastard","commenter_a":"You can go to hell leave us alone. We don't care what you call it marriage is one man and one woman.","post_message":"You knew this was coming..."}]
