[{"comment_id":"10158514408340354","commenter_b":"@username first Trump wasn't ever going to win. Then he would never build a wall. Then Mex will never pay us back... See where this is going, fk nuts?","commenter_a":"A wall is a slab of steel reinforced concrete buried in dirt This man builds skyscrapers for a living What did those neanderthals think was going to happen lol","post_message":"WOW. WATCH:"},{"comment_id":"10156046301859896","commenter_b":"Romona de Araujo Lol lol lol lol lol lol Lol lol lol lol lol lol You think someone who earned a living from porn and NEEDED TO READ A PRAYER...THE MOST COMMON OF PRAYERS... FROM A TELEPROMPTER IS THE VEHICLE TO BRING GOD BACK INTO AMERICA. OMG ...WHAT THE HELL IS WRONG WITH YOU. IN ADDITION, LET ME REMIND YOU THAT SHE HAS MADE A CONSCIOUS DECISION TO REMAIN MARRIED TO A SELF- PROCLAIMED SEXUAL PREDATOR. MY DEAR GOD WAS NOT SMILING DOWN IN APPROVAL AT MELANIA, AS SHE READ RELIGIOUS WORDS OFF A TELEPROMPTER ... HER ATTEMPT TO BRING A PRAYER INTO HER ACT ....OF ATTEMPTING TO CON US INTO BELIEVING SHE IS RELIGIOUS ....WAS A TOTAL DISRESPECT TO THOSE OF US WHO ARE TRULY RELIGIOUS AND HAVE THE LORD'S PRAYER IN OUR HEARTS AND LIVE BY THE WORDS OF THAT PRAYER. FANTASTIC....YOU NEED TO LOOK UP THE WORD ...","commenter_a":"Of course satan and his demons would be offended. I think she was fantastic!! Take God out of any country and it quickly loses it's greatness. It's about time America's bringing Him back.","post_message":"Progressive \"Love\" and \"Tolerance\":"},{"comment_id":"10157871036080354","commenter_b":"@username that just shows how dumb you are! You actually think that hackers need trumps permission to hack!","commenter_a":"Hillary to Trump: \"We had a deal Don, you were supposed to help me!!!!\" Lol.... Does no one understand the Trump's constitutional rights were violated when he was recorded without his knowledge? This is exactly why we need him. The rule of law is run amuck.","post_message":"WATCH:"},{"comment_id":"10156643152565354","commenter_b":"Looks like a bad week for the Hollywood elites. He and Jada can cry on each other's shoulders. Just goes to show you that living in a mansion in Beverly Hills, riding in chauffeured limos, traveling the world and having the best of everything, still doesn't make these people happy. Pitiful!","commenter_a":"Booob!!!","post_message":"BAHAHAHA!"},{"comment_id":"1513798078640217","commenter_b":"@username Prove that lady!!!!!!","commenter_a":"Obama has publicly said he was born in Kenya so has his tranny wife.... What more do you need ?","post_message":"Donald J. Trump \"has really started his political activity based on this racist lie,\" Hillary Clinton said."},{"comment_id":"1344780435541174","commenter_b":"Yes For Hillary!!!!!!","commenter_a":"Vote Hillary","post_message":"Watch: Hallie Jackson gives a special preview of what's to come on #ElectionDay from NBC News HQ in New York! Full coverage all day: @webpagelink"},{"comment_id":"10152876069325950","commenter_b":"Enjoy your retirement Bob","commenter_a":"A straight shooter w/ a sense of humor and a poet to boot. Sunday won't be the same. We'll miss you, Bob.","post_message":"Bob Schieffer's 46-year career at CBS ends this morning with the 10:30 a.m. ET broadcast of \"Face the Nation.\" As we say goodbye, here's a lighter reflection with some of his best bloopers across the years."}]
