[{"comment_id":"10153079679845950","commenter_b":"What a dumb ignorant bitch","commenter_a":"When it's not your turn, it's NOT your turn! That is how press conferences work people!!! TRUMP 2016 :)","post_message":"JUST NOW: Donald J. Trump tells reporter Jorge Ramos to sit down, has him escorted from press conference: \"Go back to Univision!\" \"You can not deport 11 million people,\" he yells: @webpagelink"},{"comment_id":"711989458991632","commenter_b":"So you are saying if all guns were banned from legal americans the secret service would not need any guns? You obviously are another liberal idiot. Again shit for brains, criminals don't get their weapons legally. They will still get weapons illegally & then what are they going to use against an illegal weapon, throw cans of green beans & peas at them? Throw rocks at them? Why do liberal idiots refuse to understand CRIMINALS DON'T BUY WEAPONS PER SAY AT GUN SHOPS.","commenter_a":"Let's start at the very top and ban those guns that the SService are carrying all around Obama","post_message":"President Obama is taking guns out of all forms of entertainment. This is ridiculous. He can't get away with this. Do you think he is abusing his power to push his propaganda?"},{"comment_id":"1161479583891497","commenter_b":"BUILD THAT WALL! BUILD THAT WALL! BUILD THAT WALL! #MexicoWillPayOneWayOrTheOther #Trump2016","commenter_a":"Time to just hand out some good old justice and let them be found in a roadside ditch back across the border","post_message":"GROUP OF ILLEGALS GANG RAPE 13-YEAR OLD GIRLS. sickening details: @webpagelink"},{"comment_id":"944173558951399","commenter_b":"Every thing that man spoke is true. Leave lady","commenter_a":"Muslim people you live in the United States . Take that f--king towel off your face . Your weak minded people . With no chance to Evolve , your stupid religion holds you back . Just get out of are country . So we can bomb you and get rid of you ! .","post_message":"A Muslim woman confronted a female cashier about her flag pin... What happened next is going VIRAL!"},{"comment_id":"10153924246056800","commenter_b":"Bye Felicia","commenter_a":"I can't! Im done with this show....this used to be one of my favorite shows that would tell it more or less like it was. But now its just a one sided political agenda. Goodbye daily show may you rest in peace","post_message":"Activist DeRay Mckesson talks about the tenets of the Black Lives Matter movement."},{"comment_id":"10153513922564087","commenter_b":"Typical obfuscation from a serial liar & all-around nasty woman,","commenter_a":"Bernie will release whatever you ask him to. He has nothing to hide!","post_message":"“Let everybody who’s ever given a speech to any private group under any circumstances release them,” Hillary Clinton said on ABC’s “This Week.” “We’ll all release them at the same time.”"},{"comment_id":"10154079570861130","commenter_b":"What do you have against us fat lesbians ?","commenter_a":"He looks like a fat lesbian Neil young.","post_message":"\"...I think Donald J. Trump is gonna win.” --Michael Moore"}]
