[{"comment_id":"1068974126482547","commenter_b":"@username, that is so true! WHORES ARE NOT WOMEN!","commenter_a":"Obama by far has been the worst president this country has ever had. He put America straight into the crapper. If Hillary gets elected she's going to pull the handle.","post_message":"We need to elect men and women who uphold the Sanctity of Life!"},{"comment_id":"10154111974819726","commenter_b":"check out her multiple lies prior to this...this chick is no journalist","commenter_a":"I can believe a liberal reporter pulling this nonsense stunt, but not someone from Breitbart! Conservative commentators have lost all respect from me if theyre going to pull these moves against anyone.","post_message":"WATCH: The now infamous video of Trump's campaign manager Corey Lewandowski allegedly grabbing Michelle Fields. What do you think happened?"},{"comment_id":"10155440088805354","commenter_b":"Charlie, I guess it doesn't take much for you. When she stands up her boobs point south.","commenter_a":"Time for that old broad to retire.","post_message":"\"Why is it okay to show ass and no breast?\" - Madonna Fair question?"},{"comment_id":"1836032849948227","commenter_b":"I'd say you'll go in for one yourself @username!! Dressed as a lady","commenter_a":"@username I don't feel well","post_message":"😍😍😍"},{"comment_id":"10153116909760671","commenter_b":"As they should I would not want men in a women's locker room even if he dresses like a women, just think about how it smells that would be enough for me to wait until there showered.","commenter_a":"Try sending in a transgender reporter, that'll make 'em happy!","post_message":"“I have covered male sporting events all over the world and it took coming to Indianapolis to face my first gender discrimination,” one of the journalists wrote on Twitter. Thoughts?"},{"comment_id":"1064358433623633","commenter_b":"TRUMP GO back TO Hell","commenter_a":"Can these idiots be any more reprehensible?! The Repugs care only about the top 1%.","post_message":"The right's hostility toward the working poor is now front and center."},{"comment_id":"10154485360681323","commenter_b":"She won the election. Period.","commenter_a":"I congratulate Brazil for their courage and determination. The Latin-American left likes to keep the people they rule poor, uneducated and frightened. They like to pretend to be the saviors. But the truth is they always leave a country poorer, they become richer, and as in the case of Nicaragua, Cuba, Venezuela, and Bolivia, they do not leave, ever.","post_message":"In keeping with her pledge to fight until the end for the 54 million voters who put her in office, Rousseff – a former Marxist guerrilla – ended her presidency this week with a gritty 14-hour defence of her government’s achievements and a sharply worded attack on the “usurpers” and “coup-mongers” who ejected her from power without an election."}]
