[{"comment_id":"386555874837702","commenter_b":"You obviously know nothing about the economy or laws or Russia in general...","commenter_a":"Its nice to see that thier prioritizing With all that going on with thier financial collapse and war in the Ukraine They have made driving xdressed a precedent Just curious... How would one know that the driver is a pyromaniac Will he be the one with the lit flare out the window???!!","post_message":"\"At first glance, it already appears absolutely absurd.\""},{"comment_id":"10153630936701955","commenter_b":"Idiots are using it for crack and other illegal substances !","commenter_a":"What a shitty headline. The doctors put him in a coma, not the e-cig. Drudge should have had more sense than to repost such drivel.","post_message":"Man In Coma After E-Cigarette Blows Up In His Face..."},{"comment_id":"1047903455266183","commenter_b":"I wish you would get an education, maybe you wouldn't say such stupid things Douglas","commenter_a":"Lmao. what a joke. So the economy is better, Because the middle class people are working 2 jobs to make what they were making before Obama and to pay for more expansive healthcare? The people have strengthened the economy,not politicians, through hard work and much sacrifice. I am sure the \"rich\" are happy, anyway.It works for them.","post_message":"We have to defend the progress we’ve made and build an economy that works for everyone—not just those at the top."},{"comment_id":"10154047857863855","commenter_b":"Fake, phony and fraudster. Being a lesbian gave her no special privilege to ripoff people","commenter_a":"Bet she didn't see that coming!?","post_message":"RIP Youree Harris."},{"comment_id":"10154595284389888","commenter_b":"Oh for crying out loud. He's pissed because he can't get his bad people in. OMG. People are so childish. Illegal vs legal.","commenter_a":"Why don't U take your Iranian A$$ back to your country and direct movies over their . U don't like it here LEAVE.Sorry POS. And stick that OSCAR where the sun don't shine","post_message":"\"My absence is out of respect for the people of my country and those of other six nations whom have been disrespected by the inhumane law that bans entry of immigrants to the U.S. Iranian director Asghar Farhadi won an Oscar tonight, but chose not to attend the ceremony in response to President Donald J. Trump's recent travel ban."},{"comment_id":"10154293209899153","commenter_b":"What do you mean what is happening...It's been going on for thousands of years....There are POS's everywhere","commenter_a":"What is happening too many men are raping these young children, ladies be careful who you have in your home , keep your eyes on your children at all times never leave them with anyone these days it could be your closest to molest these kids...","post_message":"Joseph Genitempo is accused of sexually assaulting an 11-year-old girl. Anyone who may know where he is located is asked to call the Delaware State Police."},{"comment_id":"829608320409843","commenter_b":"She is disgusting!","commenter_a":"I'm warmed by the tolerance of the libs. Not.","post_message":"Well, she certainly didn't shy away about how she feels."}]
