[{"comment_id":"10154553926556729","commenter_b":"Shes an ugly bitch","commenter_a":"I think her and Fiorina fell out of the same tree.","post_message":"Thank you, President Obama!"},{"comment_id":"10153597366220329","commenter_b":"Like we're met to be best friends lol","commenter_a":"Craig! I still think it's you.","post_message":"It's not me, it's your god damn chargers."},{"comment_id":"497513650439215","commenter_b":"Bitch","commenter_a":"Well then ll blacks are racist even if they don't use the Cracker word!!!","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"10152955110391336","commenter_b":"What i do NOT understand is.....if kids get vaccinated....then why in the world are those parents concerned their kids will get the disease they've been vaccinated for??? Aren't the vaccines any good?? It's NOT the ppl who aren't vaccinating their children who are bringing disease to other in this country....it's the illegals who are flooding in here who are bringing this stuff with them!!! Blame the correct ppl if you're going to play the blame game....","commenter_a":"Well said Margaret","post_message":"A 3-year-old girl with leukemia was exposed to measles at an outpatient clinic in Arizona."},{"comment_id":"10150832219144999","commenter_b":"Are women able to have more than one husband?","commenter_a":"Polygamy is legal in my country.","post_message":"Could the U.S. Supreme Court decision that recognized a right to same-sex marriage presage a constitutional right to plural marriage? Read on in The New York Times Opinion."},{"comment_id":"1713716002223281","commenter_b":"@username Bill Clinton is the one that suggested the wall u retard. Plus trump will hold people hiring illegals accountable.","commenter_a":"Yep. Actually, does sound like Trump's current talking points. Someone's a hypocrite. And it's not Trump. #Trump2016!","post_message":"Do you think this sounds a lot like Donald J. Trump? MORE: @webpagelink"},{"comment_id":"10153173721809091","commenter_b":"👎 on your comment sammi","commenter_a":"How many 15 year old boys get to bang a pro cheerleader?","post_message":"Molly Shattuck collapsed to her knees inside the courtroom as the judge handed down her sentence for raping a 15-year-old boy:"}]
