[{"comment_id":"945524792158383","commenter_b":"Kill all the white people, then they will only have each other to blame and kill. Brilliant!","commenter_a":"Idiots","post_message":"[Watch] New Black Panther Party Urging Blacks to Get Ready to Kill for a Black Nation"},{"comment_id":"948827975173732","commenter_b":"Alright, Rosa! Good for you and good for Latina women!","commenter_a":"Yes @username with the Latin vote you will be our president 2016 yeaaaa","post_message":"Hillary stands up for Planned Parenthood—and women's rights."},{"comment_id":"10153366308391336","commenter_b":"Ewww! What a scanky hoe!","commenter_a":"I bet they didn't even use condoms... - Don't they care about STD's on DEATH ROW or in Maximum Security?","post_message":"Shepard Smith reported that Joyce Mitchell, the prison worker accused of helping two convicted murders escape from Clinton Correctional Facility, reportedly had sexual relationships with both killers."},{"comment_id":"10153531344506077","commenter_b":"Well said!","commenter_a":"Apparently some of the people on this thread see this move by the Colorado governor as a humanitarian move. Well when the carnage starts in Colorado, we will see just how humane the move was. Every citizen of this country that has a gun needs to lock and load because what happened in Paris is coming here! If you can't see the truth then you are just as blind and ignorant as our so called leaders! I hope you do not suffer in pain long when your ignorance comes back to bite you in the butt.","post_message":"JUST IN: Colorado will NOT join the growing number of states that are refusing to accept Syrian refugees following the Paris terrorist attacks."},{"comment_id":"10154660299872501","commenter_b":"She can work anywhere in these United States.","commenter_a":"So she can be a lawyer not a judge cool.","post_message":"We reached out to Angela Stokes today to ask about her future legal plans. If she responds, we'll add her comments to the story."},{"comment_id":"10154018676368701","commenter_b":"If she used a gun and shot the fleeing perp then she should get off free and clear ! The cops do don't they !","commenter_a":"Sadly, if it was a gun she would be facing attempted murder charges in shooting a fleeing suspect. Since a car is a lethal weapon, it wouldn't be surprising if they decide to charge with something comparable. Property is not worth life, ever","post_message":"Police credit the octogenarian driver with leaving damage that helped officers identify the thieves car and apprehend them."},{"comment_id":"10153099385609255","commenter_b":"Of course there is climate change. It's been jumping around forever.","commenter_a":"The animals are a bit smarter than the scientists and they live in the weather not a lab","post_message":"Happy Groundhog Day—here's to six more weeks of winter. Thanks to Believing in imaginary friends and fairy tales is outside of my age bracket for sharing."}]
