[{"comment_id":"1207859512585616","commenter_b":"Kick her out!!!! Dishonorable discharge!!!!","commenter_a":"She should be discharged, and labeled as an undesirable. Her fellow sailors cannot depend on her to have their back in a time of need.","post_message":"A Navy sailor made national news when she decided to film herself not standing for the flag. Now, she's in trouble... here's the swift justice she received. Do you think she got what she had coming to her?"},{"comment_id":"1243601928984608","commenter_b":"Speak for yourself, Bertha. Don't pretend you speak for the majority of women because you sure as hell don't!","commenter_a":"Don't have the right to impose their beliefs on others.. huh? Well, then the religious right should stop right there...","post_message":"Ted Cruz’s tour de transphobia has embraced a new extreme position."},{"comment_id":"10153157541959641","commenter_b":"Yes Dilma get the hell out!","commenter_a":"protests? you can't never even think about it ! if you join to a manifestation group you can get killed or lose your job if you be an influent person , you can get bribed and many people are shut because of these reasons this is the message that we've been received from our fathers the message has been transmitted from generations to generations a message of fear were the law is to rule the poor .","post_message":"Hundreds of thousands marched in Sao Paulo, Brazil, with one message for President Dilma Rousseff: Get out. cnn.it/1ynM33B"},{"comment_id":"1530656863908230","commenter_b":"Feminism is the CHOICE. You can choose to be a stay at home mom now, you are no longer forced.","commenter_a":"Feminism got women the right to vote, and the right to be equally taxed as men without suffering any of the consequences of their choices (like fighting in war) obviously women are indirectly affected by war too but....this devalued their job and oppourtunities as mothers, thus hurting the family structure by putting extra financial burdens on them to cover the extra tax load. This is why families cannot survive off of one income anymore (obviously there are other factors). Feminism made it seems petty and pathetic to be a stay at home mom and raise your children but it is the most important and difficult job in the world IMO.","post_message":"The work of stay-at-home moms is valued at more than $100K a year. Learn more about the stay-at-home mom stigma: @webpagelink Like ATTN: Video on Facebook."},{"comment_id":"10153083977090950","commenter_b":"The costume? Stupid. Offensive? A man who think he's a woman when NUTURE decided MALE for him and no amount of procedures will change his MALE DNA. That's offensive. What is he a salmon? Science needs to come up with some kind of rehabilitation approach or program to try and fix this social diseases, including homosexuality.","commenter_a":"Why not it's holloween nway haha","post_message":"The \"Call Me Caitlyn\" costume faced Internet backlash, with some calling it \"transphobic.\" Stores, however, think the outfit \"celebrates her.\""},{"comment_id":"10156198873145354","commenter_b":"Screw Faux News and that bitch Megyn Kelly.","commenter_a":"FOX is decending to a new low leval! I used to have it on all the time but now i will just tune in for one program!","post_message":"We have the intense Twitter exchange between Donald Trump and National Review editor Rich Lowry. Read the tweets!"},{"comment_id":"10153290298049087","commenter_b":"You think the people who think that immigrants constitue criminals when in reality they commit less crimes than native born Americans are the smart people? Crossing the border doesn't make you a criminal since in 49 States, crossing the border is a civil issue.","commenter_a":"Donald trump's campaign is all about making America racist again. It isn't coincidental that all of his supporters are idiots.","post_message":"“I’m going to unify. This country is totally divided,” Donald J. Trump said in an interview with CNN's Jake Tapper. “Barack Obama has divided this country unbelievably, and it’s all hatred, what can I tell you, I’ve never seen anything like it. I’m going to unify the country.”"}]
