[{"comment_id":"916372545089161","commenter_b":"She is beautiful. But ugly women and men with little dicks see the opposite! :-)","commenter_a":"She is still pretty","post_message":"Where HAS Michelle Obama's hair gone?"},{"comment_id":"10153140087886037","commenter_b":"@username I have a friend who works as an ICE agent and their hands are often tied when getting rid of criminals and they already deport the serious criminals.","commenter_a":"My mother-in-law went through the process legally and in November she took the oath. She took the process seriously, learning US history, learning english, and working hard to pay the fees. Freely handing out citizenship is an insult to those who went through the process legally. Laws are put in place for a reason, we cant pick and choose which ones we follow. And the President can't be allowed to give millions of people citizenship when it goes against our laws. I don't care if the president is Democrat or Republican, this is not legal.","post_message":"Confident Obama predicts success in immigration appeal, has message for millions facing possible deportation @webpagelink"},{"comment_id":"10153140940574205","commenter_b":"Perfection!","commenter_a":"Lol... Reminds me of the Mandelbaums on Seinfeld. \"You think you're better than me?\"","post_message":"In an effort to show how tough they are, Vladimir Putin and Dmitri Medvedev have released an exercise video."},{"comment_id":"1358265534191667","commenter_b":"She is an ignorant cunt and let some one break into her house and use it up and then she will change her mind","commenter_a":" .. . The problem is not guns. It is hearts without G-o-d. It is homes without discipline. It is schools without p-r-a-y-e-r. It is courts without justice. It is Obama willful destruction of the economy and good jobs, families to flourish. It is Obama directive to not enforce gun laws, giving himself the perfect excuse to label guns as the problem. Right out of the Marxist Playbook. HE is the problem. HE is the greatest traitor in the history of human civilization.","post_message":"The founder of Moms Demand Action for Gun Sense in America says she's done wallowing in disappointment following Donald Trump's victory last week."},{"comment_id":"10153080401256051","commenter_b":"There is a hog epidemic going on in the U.S. there destroying farms everyday...there's a big need to keep the population down. Quit crying your not the ones who's life's are being destroyed","commenter_a":"The ribs are good .. smokin low and slow.","post_message":"These hunters have one message and one message only for their critics: get over it."},{"comment_id":"1711137139137823","commenter_b":"@username I've been reading your comments and I can tell you're a Drumpf dwarf you dumb, classless, hillbilly trash you are utterly disgusting don't forget when you take your dump in your out house you can cast your vote for Drumpf at the same time!","commenter_a":"I think it was the movie Animal House..\"fat drunk and stupid is no way to go through life\" maybe you should take the same advice Rosie O'Donnell. You're a classless loud mouth, when Trump becomes President feel free to leave the country, Ill even pay for your ticket","post_message":"Rosie O'Donnell just restarted an epic feud."},{"comment_id":"1056647814370639","commenter_b":"Let's be honest. HE is not confused. HE is still a MALE. And absolutely a disgrace.","commenter_a":"NO, are you kidding me?","post_message":"Do you agree with MAC's decision? Yes or no?"}]
