[{"comment_id":"10154249719951615","commenter_b":"Oh for real? That's good to hear bro.","commenter_a":"Poor kid. If Mt Oliver Cops are the lead investigators she may never be found. 😢😢😢😢😢😢😢","post_message":"PLEASE SHARE: Brandi Kolas was last seen Feb. 2 in Mount Oliver. She has blond hair and blue eyes, is 5 feet, 7 inches tall and weighs 110 pounds. Anyone with information about her whereabouts is asked to call 911, the National Center for Missing & Exploited Children or the Mount Oliver Police Department."},{"comment_id":"1176027829155419","commenter_b":"Smart woman","commenter_a":"Big deal!!! She had a right as an American citizen to vote but who she voted for is no one's business but hers.","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"1726976590895675","commenter_b":"@username Drama queen.","commenter_a":". LETTERMAN'S TOP 10 REASONS TO VOTE DEMOCRAT 10. I vote Democrat because I love the fact that I can now marry whatever I want. I've decided to marry my German Shepherd. 9. I vote Democrat because I believe oil companies profits of 4% on a gallon of gas are obscene, but the government taxing the same gallon at 15% isn't. 8. I vote Democrat because I believe the government will do a better job of spending the money I earn than I would. 7. I vote Democrat because Freedom of Speech is fine as long as nobody is offended by it. 6. I vote Democrat because I'm way too irresponsible to own a gun, and I know that my local police are all I need to protect me from murderers and thieves. I am also thankful that we have a 911 service that gets police to your home in ...","post_message":"Good morning America! Big day ahead! Join me at 11amE - as I officially announce my Vice Presidential choice- Governor Mike Pence! Watch here: @webpagelink"},{"comment_id":"1575163439454943","commenter_b":"Thank God for this smart young man I hope he can get thru to these thugs who have done this.","commenter_a":"I tip my hat to this young man who certainly possesses a depth of wisdom and pray he and many more like minded can be first to reach out in some way that only he and others are acceptable for the larger purpose TALKING to others about the failure that they have caused but need to turn back to!!!!","post_message":"One Milwaukee resident has a message for rioters destroying his community. And it completely DEFIES the liberal media's narrative."},{"comment_id":"602980583159868","commenter_b":"The majority of these people have never seen much less used a toilet. The do it everywhere at any time. It's sickening besides disgusting and a health problem. Expect to see toilets broken or destroyed in bathrooms from now on.","commenter_a":"Another cost to be added to culturally incompatible immigration","post_message":"Public restrooms are going to get an unusual addition due to all the immigrants coming in. The reason for the change will make you sick."},{"comment_id":"10152852591771749","commenter_b":"no body know mr. president.... it depends if the people believed to have done the right thing","commenter_a":"United we stand as the greatest nation in the world. USA' USA' USA!","post_message":"Let's go."},{"comment_id":"1142812899111790","commenter_b":"Jade White Ali omg & before ?? Ur a nun then now !","commenter_a":"It's all false to get people to make racist comment, and it's illegal in UK to have more than one wife it's called bigamy","post_message":"Men with more than one wife to get bigger benefits"}]
