[{"comment_id":"10154007566964091","commenter_b":"Sick women..","commenter_a":"Something is really wrong with this world.","post_message":"The mom claims she and her daughter \"hit it off.\" She lost custody of her children when they were young, and had only recently reconnected with her."},{"comment_id":"821054791362772","commenter_b":"Keep your smug ass out of Texas !! YOU are NOT wanted here !!!","commenter_a":"Barff, She is in it for Hollywood, Wall Street and anyone with money who dumb enough to fall for that LIAR THIEF, DOUCHBAG!!","post_message":"This has to be said. Last night AP declared Hillary Clinton had garnered enough delegates -- by way of super delegates -- to secure the Democrat nomination for president. Everyone is expressing how this is a great historic moment. I agree, it is a historic moment. The new American Socialist Party, once known as the Democrat Party, now has a sitting president and a nominee for president who abandoned Americans to die and lied about it. And to all the detractors who would dismiss this, just think about the mother of Sean Smith widow and orphaned child of Tyrone Woods.and the families of Ambassador Chris Stevens and Glen Doherty. This is not a historic moment for them. It is an indictment of how America rewards the most despicable and abhorrent behavior. This is a sad day for our America -- well, at least for the mindless Kool-aid drinking sycophant followers ..."},{"comment_id":"10155415365743812","commenter_b":"Alfredo Aguilar This comment","commenter_a":"I see Trump's shipment has arrived. This explains his snorting problem. lol","post_message":"U.S. Coast Guard Cutter Midgett crew offloads more than 13 tons of cocaine at Naval Base San Diego that were seized in 21 separate incidents in the Eastern Pacific Ocean. @webpagelink"},{"comment_id":"10154218056967439","commenter_b":"The ones in the Muslim communities that haven't done anything are still in Stage 1......just wait until they move to Stage 2 & 3....it is in the Quran: @webpagelink","commenter_a":"Cameron what a d-------","post_message":"And do what exactly? Convert? Christianity is not the problem. How many murders, attacks etc will it take for these craven quisling to realize their appeasement and submission is not working? UK PM Cameron: \"Our brothers and sisters who are Muslims, they want our assistance.\" Uh, no they don't."},{"comment_id":"10152933128350671","commenter_b":"That's because when you were younger they weren't mixing the vaccination like cocktail drinks.","commenter_a":"I'm 45 year old hot all my vacs as a child and I'm ok","post_message":"The Senate on Monday reaffirmed the bill striking California's personal belief exemption for immunizations on a 24-14 vote."},{"comment_id":"680360518742918","commenter_b":"Yeah ted😄,, me and my uncle Malcolm Fisher love ya!!!","commenter_a":"I refused to watch his garage band act but I'll take your word on it!","post_message":"Tonight America saw a powerful demonstration that it is time to move on beyond President Barack Obama. #SOTU2015"},{"comment_id":"10154199374772894","commenter_b":"Women need to stop playing themselves. He only wants money on his books.","commenter_a":"Well it's the thought that count.. At least she know that and accept it for what it is... But some of these hoes don't know bout that tho","post_message":"ICYMI: Apollo Nida Gave His New Fiancée an Engagement Ring Made Out of Paper Towels [Photos]"}]
