[{"comment_id":"10153596201678984","commenter_b":"Absolutely Support him. He has every right to refuse and shouldn't be forced to preform a same sex marriage if it's against his beliefs!!","commenter_a":"I am supporting the judge who didn't marry the same-sex couple. If gays and lesbians demand justice they also should let those who differ in thought the same right to practice what they believe instead, of trying to force someone to commit something that goes against what they belief..","post_message":"This judge's response has him in hot water. You'll be surprised when you learn his background, then when you see who stepped in for him -- you'll be even more surprised. A totally backwards scenario from what you'd expect... Do you support what this judge did?"},{"comment_id":"727349494120008","commenter_b":"are you kidding me. Get rid of these lowlife scum bags. It didn't have a dining room. well soon they will be Trumped.","commenter_a":"If this is true .they need to go pitch a couple tents ⛺️ somewhere . Give the house to someone who will be grateful to have a roof over there heads 😡😡","post_message":"This shows the welfare mentality at it's absolute WORST! This family has rejected 2 different taxpayer funded 5-bedroom houses and is now staying in a taxpayer funded hotel but they are making another VERY special demand..."},{"comment_id":"10153803162214456","commenter_b":"There is a big difference between a legal immigrant and an illegal alien. Ivana trump was a legal immigrant.","commenter_a":"Thanks JENNIFER...this is what I am seeing and hearing. No matter how brash everyone thinks Donald Trump is...we have incompetent leadership in this country...I agree with him...","post_message":"BREAKING NEWS: French police have issued a wanted notice with a photo of a man suspected in the Paris attacks."},{"comment_id":"944552658926615","commenter_b":"People always wanna go after the other person. .. well guess what? .... THE DAUGHTER WAS THE ONE WHO HAD HER 16 YEAR OLD LEGS OPEN. AND WHAT 16 YEAR OLD BOY GONNA SAY NO TO PUSSY? smh","commenter_a":"I've got 4 daughters and a handfull of granddaughters--put me on her jury!","post_message":"MAD MOTHER: Police say say she beat up a boy after finding him in bed with her daughter. After he ran away, they say she took a baseball bat to his car."},{"comment_id":"10153362958101955","commenter_b":"I agree. The Barbarians are within.","commenter_a":"Our own government is the biggest terror threat we've ever had.","post_message":"House Intel Committee Chair: US Is at 'Highest Threat Level We Have Ever Faced'..."},{"comment_id":"10152522515306717","commenter_b":"Trust bitch, more Gays will flock to Nikon, you're obviously a total moron","commenter_a":"Won't be buying anything from that company or my family or friends Adam and eve people not Adam and steve","post_message":"Click here to follow LGBTQ Nation on Twitter: lgbtqn.at/tw"},{"comment_id":"10153018871246130","commenter_b":"Lesbian porn is boring. Girls that don't have the slightest clue as to how to thrust their hips.","commenter_a":"Men say \"fucking disgusting\" then get their morning jerk off to lesbian porn.","post_message":"How adorable is this?"}]
