[{"comment_id":"754801571296723","commenter_b":"You possess a gun! Must include you and your Force. No, possession of a gun or any other weapon by an honest citizen and who Carrie's it legally is not the problem, it's your drug dealing gangs and the shitbags they cater to that are committing all the crime and violence, when the politicians and legal system gets real and grows a pair, maybe then the police can finally do the job they are required to do, try some aggressive patrolling and \"stop and frisk\" along with prosecution of those who illegally possess guns and stop throwing out the gun charge for a quick \"plea bargain case\" maybe you'll see some results!","commenter_a":"That's why Chicago had 62 shootings over there weekend their in the wrong hands.","post_message":"Garry McCarthy has no interest in stopping the thug culture destroying Chicago. Instead, he wants to blame law-abiding gun owners for his failures."},{"comment_id":"882172088504463","commenter_b":"Do you guys know Bernie is a SOCIALIST.. A SOCIALIST !!!! why do you guys hate America so much, I tell you why, because YOU HAVE NO IDEA HOW IT IS TO LIVE IN A SOCIALIST SYSTEM , go to any South American Coutry , tell any parson who have lived under this system that YOU support a Socialist in America, be careful you might get your ass kicked due to stupidity ...pick a Socialist country, live there for 6 months then wee talk ....IGNORANT!!!!!!!","commenter_a":"It's one thing to get elected as Mayor of Burlington, VT, then, Congress, and the US Senate with a population of 800,000 where $5 or $10 makes a difference and running for President. We all know the game is fixed. And, as an incumbent, it was fixed in his favor.","post_message":"Five years ago, the Supreme Court issued what I think is one of the most disastrous decisions in its history, Citizens United v. FEC. Billionaires buying elections is not what our Constitution stands for. Add your name to my petition if you agree that our democracy is not for sale: @webpagelink"},{"comment_id":"1172120832836462","commenter_b":"@username she's a racist. \"Government people\" is code word for white devils. She just want to see them.","commenter_a":"Well how is he planning to build this wall!! Without the native America permission he's trying to build on our land (Tohono O'odham nation) nd again there's gna be another treaty broken","post_message":"President-elect Donald J. Trump says he will move to deport criminal illegal immigrants and still plans to build a wall."},{"comment_id":"10153080762721051","commenter_b":"Set his butt on fire the next time sis.. Light a match and go for it. Learn how to defend yourself.","commenter_a":"It has to do with the fact that even with the strides that women have made in securing rights. Women are still 2nd class citizens we are expendable. The national movement has wrapped itself up in abortion rights as the only right we speak out for. Susanne B Anthony must be rolling in her grave. Shame on us for allowing this to continue. There are currently more women than men worldwide. Withhold that which men hold dear, watch how fast things change.","post_message":"This woman's husband repeatedly abused her. Then he sent her a text message that read, \"In the next 48 hours I will be locked up and you will be dead.\" Despite that, he's still walking free."},{"comment_id":"548865588651254","commenter_b":"How touching❤️","commenter_a":"Love this and will remember when choosing between Home Depot and Lowes!","post_message":"This disabled vet was having trouble finding a job because of his service dog — so Lowe's hired them both."},{"comment_id":"10153963573598984","commenter_b":"Disgusting stupid females that believe that has brevetted mine","commenter_a":"And this is not their idea of hell a place of lust","post_message":"This Muslim cleric realized that female suicide bombers don't have a whole lot of use for 72 virgins... so he came up with his own reward for these \"martyrs.\" It's even more disgusting than you think it is, too."},{"comment_id":"1680552935568119","commenter_b":"#TrumpIsMyPresident #SendAllIllegalsHome for all American Citizens involved & thanks for all law enforcement","commenter_a":"Okay Obama, this is your last chance to speak against guns... oh wait , guns were not used?! Oh darn it! Well let's start trying to ban knives now too.","post_message":"Officials hold a news conference on The Ohio State University campus attack. @webpagelink"}]
