[{"comment_id":"915117481938364","commenter_b":"One day her money,scheming,and life of cards will come crumbling down in front of the world. How can billy bob clinton show his adulteress face. They are shamefull. And not the only ones. They better get their life righ fir the next.","commenter_a":"yes...why should Hillary get away with what she has done,if it was any of us we would go to prison,so yes send her to prison along with Obama","post_message":"No wonder The Hildebeest hates... The Donald. @webpagelink"},{"comment_id":"1765230837092544","commenter_b":"Wow. So many posts are against Hillary. How can she be leading in the polls? Media bias and manipulation, perhaps? Watch for a stolen election.","commenter_a":"He is not hiding anything and the bigger concern for Americans is how much Hillary lies.","post_message":"Does Donald Trump actually pay his fair share in taxes? Is he worth less than he says he is? Does he have unsavory connections to Russian oligarchs? Until he releases his tax returns, voters won't know for sure."},{"comment_id":"1173449382693296","commenter_b":"ANTI CHRIST HILLARY CLINTON IS BEING PROTECTED BY UN AND OBAMA! ISIS IS THEIR CHILD OF HATRED TOWARDS THE WORLD AND IS GROWING BY THE MIN THEY ARMED ISIS!","commenter_a":"Hmmm","post_message":"Should the US pull out of the United Nations over this?"},{"comment_id":"10154376449396636","commenter_b":"Sorry but the open door immigration you referred to doesnt apply to North Africans. No African countries are in the EU.","commenter_a":"I don't think the opinions of someone who has ruined an entire continent with her open door immigration policy are worth listening to....","post_message":"Strong words"},{"comment_id":"574728392714767","commenter_b":"You should be worried about all of these weekly race riots, terrorist attacks, and minority crime. All three of those factors are why Trump will win. People do not want a third Obama term, which is what Hillary offers. Why do YOU, white person support the Democratic Party, the party that hates you, and legalizes racial discrimination against you? You are like those Jews in 1932 Germany who supported the Nazi Party. You both follow the political party that calls for you demise.","commenter_a":"What I'm worried about is Mr. Reality TV turning what should be a serious debate into another stupid episode of The Apprentice, and the media not giving a damn because it makes for good ratings ... and then our dumbed-down electorate lapping it up.","post_message":"Tonight debate between Hillary Clinton and Donald J. Trump may be one for the ages. But history shows it not the great arguments we remember, but the zingers and gaffes."},{"comment_id":"1214214798614861","commenter_b":"From Chris (Author of this article) he mentioned \"dangerous batteries\". Well what did you know the whole world is putting blames on a company instead of the provider. Talented consumers indeed. Personally the problem probably lies with the performance output and the batteries supplying the phone. Note 7 is a heavy powerhorse so... overexerting the battery could damage it.","commenter_a":"This is worst than the BlackBerry disaster.","post_message":"BREAKING: Samsung ends production of the Galaxy Note 7."},{"comment_id":"1086551791461598","commenter_b":"oboma is kissing hillerys ass cause she going to put him in the supreme court sit .Lord please don't let this evil. women win .","commenter_a":"It will be the end of the America our founding fathers put together","post_message":"ClashDaily.com"}]
