[{"comment_id":"726722780803193","commenter_b":"Bloody Tim with all his Facebook profiles!","commenter_a":"Tim Duurland @username Adam Burns Tim Duurland","post_message":"This \"smart table\" could be the future of ping pong."},{"comment_id":"1241740062517749","commenter_b":"Keep Hillary & Bernie OUT OF MY STATE!","commenter_a":"Sauce","post_message":"Donald Trump speaking in Denver at Western Conservative Summit"},{"comment_id":"880649995314349","commenter_b":"What's the hold up? The President cannot be trusted to follow the law. President Obama has repeatedly shown that he will use \"prosecutorial discretion\" to simply refuse to enforce provisions of the existing deportation laws. Marco Rubio originally helped sponsor the Senate bill, but now says that he opposes any immigration reform until the border is secure FIRST. Any immigration reform should first start with verifiable border security -- not 100% since that's not realistic, but verification that almost all illegals are turned away at the border. At the same time, the Visa system needs to be reformed -- people from all over the world enter the U.S. with a tourist visa and then never leave -- the current system fails to track these people and force them to leave. This is not an issue of race; it is an issue of national sovereignty. Only after the Border is secure ...","commenter_a":"I am very impressed, Rep. @username, you nailed it. First, this is a vital issue under the Constitution -- the President cannot simply wish a new law into existence, especially one opposed by Congress, and the Congress MUST assert its Power of the Purse to preserve the balance of power. Otherwise, the Presidency becomes too powerful. Second, this Administration and the Democratic party have been able to accomplish much of their agenda by simply refusing to negotiate, forcing the Republicans to give in. However, the structure of the legislative branch in the Constitution was INTENDED to require compromise to get things done. It is obvious that the Democrats are more concerned with political victories than what is best for the country. This is one time when the Republicans should not, and CANNOT simply acquiesce to the other side who refuses to compromise. We all know that separating DHS funding bill ...","post_message":"I spoke on the House floor to discuss the Department of Homeland Security's funding and challenged our Congress to find solutions. You can watch my remarks here:"},{"comment_id":"10155231887371037","commenter_b":"@username Proof he has no respect for the other branches of government.","commenter_a":"It's pretty sad that he's got to be the target of all this hate. It seems so many people can't go a single day without being hateful or judgemental. How can a group of people that claim to be loving and caring be so hateful and ugly hearted?","post_message":""},{"comment_id":"541837822650909","commenter_b":"blow hard............lies lies lies.....#USA4DJT, #MakeAmericaGreatAgain, #VoteTrumpForPresident","commenter_a":"So sorry this is his last year","post_message":"Your reaction to President Obama's State of the Union Address?"},{"comment_id":"10152854969571051","commenter_b":"Let behead these scumbags..What the F**k is wrong with people..Your parents should get their asses kicked","commenter_a":"Tell me where they live. I'll do the rest...","post_message":"These teens beheaded a puppy with a machete and posted the video to Snapchat. Then they picked up another puppy and did it again. And they didn’t stop there."},{"comment_id":"10153053091263984","commenter_b":"HOW ABOUT MOVE OUT OF THE WH!!!!","commenter_a":"all the kids should pack their lunch","post_message":"Alright Michelle Obama, 'Let's Move' on to you finding a new hobby. Preferably something that doesn't involve pushing this agenda on Americans..."}]
