[{"comment_id":"10153545304972452","commenter_b":"Happy mothers day mom, have a cheeseburger, see ya later!","commenter_a":"was it on a friday ?","post_message":"When they both went for the cheeseburger, investigators said Benjamin Middendorf had enough and shot his brother."},{"comment_id":"10152700014751167","commenter_b":"Also there, Christians killing Hindus .","commenter_a":"And there was that situation in India a few years ago with Buddhists and Hindus killing each other.","post_message":"\"When you take Christianity, Judaism, Hinduism, Buddhism, whatever, their combined killings in the name of religion -- well, that would be zero.” #FoxNewsFacts"},{"comment_id":"635163520007560","commenter_b":"If she is illegal,DEPORT her and all 11 of her illegal children!!!","commenter_a":"why should she,she get everything free here and we are paying for it and our military men and women get nothing","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"10153938173248967","commenter_b":"That girl a punk","commenter_a":"It's been crazy windy. Was hard to walk.","post_message":"What's that nickname for Chicago, Illinois, again? Stay safe, people"},{"comment_id":"10154449386136336","commenter_b":"Ban Muslims Now!!","commenter_a":"Open mouth insert foot.","post_message":"Last night on “Hannity,” Mike Pence echoed Donald J. Trump’s call for a temporary ban on immigration from countries where terrorists represent a threat to the United States. @webpagelink"},{"comment_id":"1132111446809033","commenter_b":"Anyone who thinks this monster deserves peace to live her life free is more fucked up than she is!","commenter_a":"You people are sad! Leave her alone already, she deserves the right to be rehabilitated. Still watch her closely, but leave her alone.","post_message":"The convicted killer has changed her name several times since her 2005 release."},{"comment_id":"582227101946110","commenter_b":"@username wow you're a stupid women aren't you","commenter_a":"Let them come in. Legally. Sure. With good intentions. Make them Learn English. Tell them it's our rules. We're not making special laws for you. Your not coming in and changing our rights. Say the pledge of allegiance with the rest of us. Call it a good day.","post_message":"We are taking in thousands, and thousands of people into or country - we have no idea who they are -- and they believe in things WE DON'T BELIEVE IN! Not happening if I am elected president."}]
