[{"comment_id":"1033502426742811","commenter_b":"True!","commenter_a":"That cop had been dismissed from another police dept for being 'too immature to handle a gun' and lack of ability to follow orders. Fact.","post_message":"BREAKING: a grand jury has chosen not to indict the cop who murdered Tamir Rice in cold blood. Something is seriously wrong with our criminal justice system when a cop can kill a fully innocent kid with impunity. Read more here: @webpagelink Image by Occupy Democrats, like our page or more."},{"comment_id":"10154466445410399","commenter_b":"@username Don't you have some wheelchairs to kick?","commenter_a":"The mom was an anti-Trump plant using her kid as a tool -- so it is another non-troversy for those fearful of the complete Clinton crushing coming tomorrow.","post_message":"“The crowd started chanting 'U-S-A' and pushing his wheelchair,” his mother said. “We were put out by security. Mr. Trump kept saying, 'Get them out.' \""},{"comment_id":"10152875626591051","commenter_b":"Yep.. she should have her vehicle towed for parking in the handicap spot. That will give her an attitude adjustment real quick!","commenter_a":"The American Disability Act will allow the police to fine this nasty man. I'd call the police. Let them handle him.","post_message":"A woman asked her neighbor to please avoid parking in her handicap parking spot. This is the letter she got in response."},{"comment_id":"666489030205380","commenter_b":"Get the hell out of our country","commenter_a":"I though you were leaving the country Rosie, what's keeping you?","post_message":"Get comfy, Rosie!"},{"comment_id":"1220005224782920","commenter_b":"She was a fucking stripper! Yeah, real class!!!","commenter_a":"Yes, what a wonderful change. And so does Mellania - what a classy First Lady we have!","post_message":"ClashDaily.com"},{"comment_id":"481914358685584","commenter_b":"That chick in the picture is going to fire up a joint , get high , go down and get her welfare check, then crash for a while, then get up and go to a anti-whatever rally and get arrested , then get out on an O/R and go cash her check and go get some more weed and start all over again. Thanks Gov. Brown for making California so great!","commenter_a":"Does that mean about 4 thousand attended?","post_message":"Attendees of the annual 4/20 pot celebration left behind almost 15,000 pounds of trash at the Golden Gate Park. PHOTOS/VIDEO:"},{"comment_id":"10153243300499087","commenter_b":"She's a flaming idiot","commenter_a":"She is one sick BITCH !!!!","post_message":"\"I am a devout, practicing Catholic. I’m a mother of five children. When my baby was born, my fifth child, my oldest was six. I think I know more about this subject than you, with all due respect,\" Nancy Pelosi told a CNS News reporter. WATCH:"}]
