[{"comment_id":"10154254037283352","commenter_b":"Fuck that queen","commenter_a":"He must be on his period","post_message":"'I'd rather see a drag queen!' Elton John accuses Janet Jackson of lip-syncing"},{"comment_id":"1271408779539022","commenter_b":"You girls are hilarious 😘😘","commenter_a":"Marijoe!!!!","post_message":"The whole thing is very ~Mermaid goth.~"},{"comment_id":"1160371997392384","commenter_b":"She made us women proud!","commenter_a":"Proud of you, and I don't even know you! I spend a lot of time in Florida although I don't live there. If I ever encountered Scott, I'd like to think I'd tell him off, perhaps not so 'eloquently'!","post_message":"\"In some ways this is about me and my personal interaction, but it's also about all of us who are having to live under the reign of Governor Scott.\" - Cara Jennings"},{"comment_id":"10153626418796509","commenter_b":"She truly is hideous","commenter_a":"God she's so ugly . How did she trick Ferris Bueller into marrying her?","post_message":"Many celebrities attended the Metropolitan Museum of Art's Costume Institute Gala in New York. See pictures from the red carpet. @webpagelink"},{"comment_id":"10153216157089087","commenter_b":"Screw Carly the bitch","commenter_a":"She hit the nail on the head with that statement. Problem is that people are so selfish, narcissistic, and apathetic that they don't really LOOK at a person until its too late. Did I mention lazy? Handle problems on the front end and there will be less on the back end. Do you want to elect Carly Fiorina? Or a woman with multiple murders under her belt? Or a hatemongerer? Not my first choice, but I still like her.","post_message":"“The reason I’m running for president is because I don’t want to see hope fading from anyone’s eyes,\" Carly Fiorina said. \"When someone is addicted, you watch them disappear before your eyes.\""},{"comment_id":"10153468910666037","commenter_b":"Kids from low income communities and families qualify for free college education through goverment grants and programs... some choose to use those programs to better themselves and their famalies... others would rather point fingers and blame others... the only person to point the finger at in a capitalist society is the dude in the mirror because you can truly be anything you wanna be if you want it bad enough...","commenter_a":"This is awesome... more boots on the ground hopefully with the full support of the community and politicians to clean the crime up on the streets of this country... Every single city should follow in their footsteps!!","post_message":"The country's largest police force says it will also hire 400 administrative aides to take over desk jobs, which will free up more officers to walk the streets for community policing."},{"comment_id":"954338344712964","commenter_b":"Idiot she has no place in the white house","commenter_a":"When her Secret Service Protectors lay down their guns, I will lay down mine.","post_message":"Hillary Clinton made the case for the United States to implement tougher restrictions on gun purchases following the terror attack in Orlando. @webpagelink"}]
