[{"comment_id":"10153351373259614","commenter_b":"This woman wants to make decisions for you and for me.....","commenter_a":"Dummy","post_message":"A videotaped gaffe by Rep. Loretta Sanchez has sparked outrage among those who found the comment to be racially offensive. Sanchez, a candidate who wants to replace retiring Senator Barbara Boxer, was speaking at a California Democratic party convention event when she made a stereotypical Native American \"war cry.\" Referring to the difference between Indian Americans and Native Americans, the congresswoman tapped her hand to her mouth. Sanchez's main opponent, Attorney General Kamala Harris, was later asked for her reaction to the gesture. \"I don know what to say to that. That that that shocking,\" said Harris, whose mother is Indian. (Video courtesy of Uduak-Joe Ntuk) Read KTLA's story here: @webpagelink"},{"comment_id":"10152998486166680","commenter_b":"BRAVO TO TRUMP!!!! We LOVE your IMMIGRATION POLICY!!! But, you \"must\" repeal the 1965 Immigration Policy to make sure things go back to normal!! Those who use the \"RACE CARD\" and cll names are really part of the problem!! Place them on \"BLOCK\"!! Of course they will rant and scream racism, because that is the very tool and threat they use that they are so used to getting their own way with! THEY are also destroying this Country! What is unconstitutional is what is being done NOW! Deporting ILLEGALS is the LAW!!! The LEFT are out in droves to slander, to name call, to label, to smear, to relentlessly attack all supporters of Trump and anyone else who is trying to save this Country!","commenter_a":"2016 TRUMP FOR PRESIDENT 2016","post_message":"Donald J. Trump's three-principle plan: “1. A nation without borders is not a nation. There must be a wall across the southern border. 2. A nation without laws is not a nation. Laws passed in accordance with our Constitutional system of government must be enforced. 3. A nation that does not serve its own citizens is not a nation. Any immigration plan must improve jobs, wages and security for all Americans.”"},{"comment_id":"1090391007723817","commenter_b":"Arrest the bum and let him drink the water","commenter_a":"A shame","post_message":"The city has confirmed 200 cases and 9,000 exposures to lead poisoning in kids under age 6."},{"comment_id":"10153473377133132","commenter_b":"She needs a vaginal reconstruction!","commenter_a":"WEIRDO","post_message":"Still haven't bought a gift for mom? The 19 Kids and Counting matriarch is going to fix that."},{"comment_id":"10152759006876943","commenter_b":"At least they aren't cheap whores.","commenter_a":"We have the best government money can buy!!","post_message":"\"That resulted in a second lawsuit last fall, this one in D.C. Superior Court, in which Judicial Watch attorneys argued that city health officials fraudulently authorized Congress to buy plans through the small-business site...\""},{"comment_id":"977838925598355","commenter_b":"Yes!","commenter_a":"Yes","post_message":"What do you think? Ferguson? Baltimore? Black Lives Matter? We've never seen so much division!"},{"comment_id":"879835912051831","commenter_b":"I wish her big mouth would go away ; what a disgusting woman","commenter_a":"A message for Rosie. It is one thing for people to think you ignorant and it is another for you to open your mouth and prove it.","post_message":"Tom Selleck is awesome!"}]
