[{"comment_id":"1237296066293181","commenter_b":"Stupid Hoe","commenter_a":"I think she is mad talented but until she stops dressing like a skank and humping everything from the air to the ground to the men in her music videos, the attention she gets will not be based off her amazing talent but on her sexuality. Becuase I think she is so talented I have watched many of her videos looking more for talent than her soft core porno ways and found that only a handful of her videos showcase her talent and not her ASSets. Soooo I mean, do something else girl cuz that talent is off the hook.","post_message":"There's a tendency to read Minaj solely through her sexuality."},{"comment_id":"10152867281821051","commenter_b":"Give it your best shot bitches","commenter_a":"Full of crap","post_message":"ISIS just announced the specific targets they’re looking to blow up – including the American ones."},{"comment_id":"1925997537627031","commenter_b":"Hillary is a criminal who should be facing years behind bars.. I can't see why anyone would support a criminal for president.. Felons cannot vote let alone run for president.. How could we expect a actual change from what we have now with her? Never gonna happen. If Trump don't win the election, U.S. is gonna be in worse shape than it is now..","commenter_a":"Mr Trump, there is a stellar idea going around on FB about the possibility of flying in the families of the Benghazi victims to join you at the RNC Convention!! Consensus is strongly for this idea. I hope you or someone on your staff sees this comment..God Bless You.","post_message":"I will be making the announcement of my Vice Presidential pick on Friday at 11am in Manhattan. Details to follow."},{"comment_id":"785950868181654","commenter_b":"Fuck you white Bitch! !","commenter_a":"DEMOCRATIC VOTERS ARE JUST FREE LOADERS...","post_message":"Don't worry John Travolta, we're also confunsed about what these people are doing!"},{"comment_id":"10153187094616636","commenter_b":"Typical Welsh comments !!!","commenter_a":"Hoog cheats by throwing himself to the ground in an attempt to get a South African player a yellow card or worse. Not a word of aplogy from the player, coach or former players. Why is it the Scots are such bad losers.?","post_message":"Gavin Hastings said the sight of Joubert leaving the pitch was \"the worst thing I have seen on a rugby field in a very long time\""},{"comment_id":"10154527914443690","commenter_b":"Wolves under the goat skins are those who invaded their countries; not them; refugees!","commenter_a":"They are terrorist not refugees, two years from now their host community will be destroy....","post_message":"\"Failure to address serious abuses appears to be a deliberate policy to deter further asylum seekers from arriving in the country by boat.\""},{"comment_id":"1097859700233782","commenter_b":"Thanks! It's true!","commenter_a":"The woman had every right to post on yelp.","post_message":"Last night we told you the story about how a woman who was upset about her treatment by a doctor and gave a bad review on Yelp. That review then led to the doctor filing a lawsuit against her >> @webpagelink"}]
