[{"comment_id":"10153677956363961","commenter_b":"@username Yes, those stupid one.","commenter_a":"In case you haven't notice, Tom, Obama has given the \"middle finger\" to Americans since he's been in office, always going against the will of the majority. We'll remember you when your term is up.","post_message":"Proud to help secure a new federal grant to improve public transit and fix traffic lights in 10 Connecticut towns"},{"comment_id":"2077791549112023","commenter_b":"@username, They are both illegal, just being born here doesn't mean a thing if your parents are illegal to begin with. 2 illegals cannot make a legal.","commenter_a":"How did she get there? If she had to fly? I don't fly, don't you need an Id and if she has a letter to be deported, how does this work?","post_message":"Democrats just got busted violating federal law at the DNC convention. This is HUGE, but apparently the law doesn't apply to Democrats. Can you imagine if a Republican had done this?"},{"comment_id":"967879999960507","commenter_b":"Mr. Trump she is saying anything to get the Latino vote. She doesn't give 2 cents about any of those people.","commenter_a":"That's just insane!!!!!","post_message":"Do you believe that Hillary Clinton now wants Obamacare for illegal immigrants? She should spend more time taking care of our great Vets!"},{"comment_id":"10153515610223984","commenter_b":"Tough shxt! If you want Muslim crap, go back to the sand fleas, get the hell out of America!","commenter_a":"If I was to go to another country would they change their laws for me change their religion.. NO THEY WOULD NOT!! SO WHY ON EARTH WILL AMERICA CHANGE WHY !! GOD FORGIVE AMERICA FOR THEY RE GOVERNMENT IS STUPID!","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing... Is Sharia law in America a major concern of yours?"},{"comment_id":"1201578119864976","commenter_b":"All rapists should be killed.","commenter_a":"Yes it does","post_message":"This reeks of white privilege."},{"comment_id":"10153018351676336","commenter_b":"Disgusts me to see girls acting like this and the bystanders with the cell phones out! Come on now","commenter_a":"As a parent, I would be MORTIFIED to see my child standing there videoing the fight! Doesn't anyone have compassion any more? \"Mean girls\"... smh... it's out of control! We should have evolved beyond this.....","post_message":"A shocking photo appears to show the moment a Texas mother pulled out a gun and pointed it at a high school student."},{"comment_id":"897936806940850","commenter_b":"DUMBASSES!!!!!!!!!","commenter_a":"People take note of these 18 cities and steer clear.","post_message":"ALERT: These 18 U.S. Cities Just Made Terrifying Announcement About Muslim ‘Refugees’… Do YOU Live There? @webpagelink"}]
