[{"comment_id":"10157700515445294","commenter_b":"Educate yourself. So we rather have criminals holding people up at gun point running the street? Robbing innocent hard working people?. We feel bad for the criminals? However, I don't. Much peace and love.","commenter_a":"Well he won't do that again. Glad he won't be terrorizing hard workers anymore. I don't care if he had a drug problem look at all the people he held at gun point the past 3 weeks. Should feel sorry for those who had to be terrified of their life.","post_message":"Police say the robber was suspected of holding up other Cleveland-area CVS stores for opioids."},{"comment_id":"10153828733732235","commenter_b":"LOL ... You people are so screwed up it amazing. You don't have to go to a fracking town to get raped ladies. Just go to any sanctuary city. There will be plenty of Mexicans willing to do the job that no American will do. LOL","commenter_a":"I have read about this .... disgusting .... assaulting women shows cowardice from these men ... shame, shame on them and the legal authorities!!","post_message":"This interview is heartbreaking."},{"comment_id":"10154133163039032","commenter_b":"Ohhh waaaa, namecalling hurts soooo bad, better to be a pig and be free than to be \"hip\" and be a socialist. Again libtards are so out of touch with reality its scary, you all hate this country and the constitution but yet none of you have lived in anoyher country to compare. Like I said, try living in China or Cuba, or Greece, or Russia if you all think big government and socialism are so great. Btw, name calling and insults mean nothing.","commenter_a":"To the guy with \"the america was never great\" sign, why don't you go live in another country for awhile and then come back and waive that sign. Scary how delusional some people are.","post_message":"Music, signs and lots of confrontation between Trump protesters and rally attendees in Prescott Valley. @webpagelink"},{"comment_id":"1756788254541132","commenter_b":"Calmate gueys!","commenter_a":"I'm Mexican. 100% computer engineer. I break 115k a year. Lol. I guess I did take a white man's job!","post_message":"WATCH: Immigration protesters from the Puente Human Rights Movement shut down a portion of Central Ave in Phoenix, near McDowell. They're upset with today's Supreme Court decision that overturns President Obama's plan to protect illegal immigrants whose children were born in this country."},{"comment_id":"633140033543242","commenter_b":"That's Ok She will BURN IN\"HELL\" Along with All The Rest of the Sheep That Followed HER !","commenter_a":"Ugly inside and out AND GETTING WORSE EVERY DAY","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"},{"comment_id":"10153152678751051","commenter_b":"Lady u need help your just stupid","commenter_a":"So many evil haters for every Obama achievement. You have all been wrong on everything Obama has done this far. It is time to take a positive stance!","post_message":"President Obama says today's Iran deal is a huge victory. What do you think: is this a good deal for America?"},{"comment_id":"10153263550734205","commenter_b":"Sure @username","commenter_a":"Not every Muslim is a terrorist, but most terrorist are Muslim. It's science.","post_message":"Man Bullies Muslim At Town Hall"}]
