[{"comment_id":"10156429610305354","commenter_b":"No \"Refugees\" from Muslim countries!","commenter_a":"Kill all 15 on the spit","post_message":"So much for Obama's crackerjack \"vetting\" process..."},{"comment_id":"10153659405156955","commenter_b":"Stupid bitch","commenter_a":"She look ignorant.... Brainless!","post_message":"VIDEO: Student Leading College Protest / Walkouts and Demanding FREE College Gets Destroyed on TV..."},{"comment_id":"1180082675403600","commenter_b":"What a bitch and she says she is going to help the less fortunate! What a joke!","commenter_a":"And she has been for decades. So sad that so many black people are so clueless. This lying thieving dirt bag couldn't care less about anything but your vote.","post_message":"Talk about something the media will never show us. Look what happened when this young black girl got in Hillary's way. This is so sickening. Hillary is a complete and utter fraud."},{"comment_id":"477691072379670","commenter_b":"Where are the weapons and the drugs??????????Ha!Ha!","commenter_a":"The majority of people coming across the southern border are peasant farmers. They bring illiteracy and tuberculosis.","post_message":"When some Americans think of illegal immigrants, they picture gang members. Drug dealers. Ruthless job stealers. Armed with hypodermic needles and Ebola, coming here to beat puppies and filch Girl Scout cookies, while toting crates of cocaine, prObama propaganda, and other satanic supplies. But what do real immigrants look like, and what do they bring to the US?"},{"comment_id":"10153840856185950","commenter_b":"Luckily that woman is not running @username, I wouldn't vote for her either!","commenter_a":"If you believe this false report you're an idiot. If you vote for Hillary Clinton you're an idiot. After all these lies and scandals surrounding this woman I can't see too many bright people voting for her. Trump's going to be our President!!!!!!","post_message":"Hillary Clinton's expansive lead is due to support from women and non-white voters, according to the survey."},{"comment_id":"10153235771901167","commenter_b":"Pay close attention! And the Liberals love this guy? @webpagelink","commenter_a":"Exactly. Hate crime.","post_message":"Multiple Planned Parenthood clinics have been targeted in arson attacks since the release of highly edited videos trying to smear them. Why aren't you hearing about that on the news?"},{"comment_id":"10154017509764156","commenter_b":"I will keep you in my prayers, Eva. You'll need them.","commenter_a":"California has extremely strict gun laws! Many in violation of Supreme Court orders! Blame the terrorists that did this, not the gun laws! It's obvious no one other than the murderers had a weapon or this would have ended much sooner, with less tragedy!","post_message":"There are no words that can come close to describing the horror of today’s attack in San Bernardino and my heart goes out to the victims and their families. Our only response must be to take immediate action to stop tomorrow’s mass shooting by addressing the gun violence epidemic. Period."}]
