[{"comment_id":"1055483257833554","commenter_b":"Hell no lol","commenter_a":"@username Marcela Guzman-Medina","post_message":"NIGHTMARE: What began as a normal day at the beach ended with amputation after a man contracted a flesh-eating virus."},{"comment_id":"10156232723535354","commenter_b":"There is no viable comparison to prohibition. This is not a gun ban. It's apples and oranges. This is simply sensible purchase laws.","commenter_a":"The answer to something like this is not more laws imposed by a federal government. It never works, it never will. Did prohibition prevent alcohol consumption? After prohibition alcohol became more dangerous to consume; crime increased and became ; the court and prison systems were stretched to the breaking point; and corruption of public officials was rampant. Prohibition removed a significant source of tax revenue and greatly increased government spending. It led many drinkers to switch to opium, marijuana, patent medicines, cocaine, and other dangerous substances that they would have been unlikely to encounter in the absence of Prohibition. Now we have the \"War on Drugs\" has that worked? Has Lyndon B Johnson's war on Poverty reduced poverty? It's been 50 years and it appears to be getting worse every year, there are approximately 100 million americans receiving some type of government assistance, an all time high. Has the department ...","post_message":"\"This makes Mercer just one more public attacker who cooperated fully with all gun control, then went on to commit heinous crimes against innocent life.\""},{"comment_id":"1583049088381782","commenter_b":"@username crazy women beat their selves up.","commenter_a":"Before this is over, the \"two women\" will be just ONE MAN, and the \"abduction\" will likely turn into an \"affair\". The reason why she is saying it was women, is so that there's no suspicion of rape. = Less of an investigation.","post_message":"Authorities are searching for two women suspected in the abduction of a California mother. via NBC Bay Area"},{"comment_id":"1570942919862279","commenter_b":"@username how about keeping your dick in your pants if all you men are going to do is walk away.....","commenter_a":"58 million human babies have been victims of abortion in the past 43 years since Roe vs Wade legalized abortion through all 9 months of pregnancy. Science has proven that life begins at conception. Social injustices continue such as poverty, hunger, underemployment, and child abuse has actually increased. Killing innocent life has not and will not solve these problems. Women and men suffer terrible regret for a decision that can never be reversed. They need real help and healing. The website hopeafterabortion.com offers loving help to post abortive women. Prolife Pregnancy Care Centers offer free nonjudgmental, loving support whether a woman decides to give birth or abort. So many women have been exploited and even died due to abortion. Abortionists get rich killing babies. Planned parenthood is the largest abortion provider in the United States. They do not provide any prenatal care or even mammograms. None of their services are ...","post_message":"\"Only when America chooses, remembers, and restores her respect for life will we rediscover our moral bearings and truly find our way,\" Rand Paul said."},{"comment_id":"412094642305750","commenter_b":"Wow, this skank is as dumb as they get. Might be too much time on her back.","commenter_a":"Hey joe, arrest this clown. Lol.","post_message":"It's time for the Sheriff to pay up!"},{"comment_id":"734861966642849","commenter_b":"Abortion should be legal everywhere and easily accessed for any women or young girl. It is their body and their right. A fetus that cannot process a though does not trump the right over an already born human being, especially when it lacks a social security card, birth certificate, valid first and last name, etc. A fetus does not reserve the right to life over the person it feeds off of and needs for survival. It is her property and as her property, she has a right to decide what does does with it where her physical and mental healthy is concerned.","commenter_a":"So disappointed you tossed in a nod to the Terry Shivo debacle...bad move. Most were probably not savvy enough to catch it. I did, you lost my vote. John Kasich won. Compassion and tolerance always beats government intrusion","post_message":"\"My record is clear. My record as a pro-life governor is not in dispute. I am completely pro-life and I believe that we should have a culture of life.\" – Jeb More on Jeb's conservative record: @webpagelink"},{"comment_id":"590301711160408","commenter_b":"She looks to be about 100 years old in this photo, Ban her ugly mug from FB","commenter_a":"When she becomes a licensed nutritionist then maybe somebody might listen to her. Her plan not only sucks but it is no where near the enough food. A child needs more than 200 calories for lunch.","post_message":"What Michelle Obama is banning now is just plain unacceptable. The American people are tired and finally fighting back. Do you agree Michelle Obama should mind her own business?"}]
