[{"comment_id":"10154684991066077","commenter_b":"Women are awful","commenter_a":"If it was Chelsea Clinton line every talk show news media blah blah blah would be wearing them...funny Ivanka isnt even a republican.","post_message":"The decision to drop the line, which is owned by the Trump Organization, follows last week’s move by Nordstrom to discontinue sales of evocative Trump’s fashion brand."},{"comment_id":"935570869827883","commenter_b":"You don't have to apoligize for that bitch","commenter_a":"Don't worry, she is a fringe politician who's party holds only one seat in parliament. She doesn't speak for most Canadians (like me) who abhor Omar Khadr. Our apologies.","post_message":"This video makes me sick. Praising a Taliban war criminal for his \"class\", making light of the death of a U.S. soldier, and having to be dragged off stage all in one speech. I hope her career ends in a fiery explosion ASAP. Here is her Facebook page if you want to share your opinions on her speech > @webpagelink ~Funker"},{"comment_id":"684458911714062","commenter_b":"Not this dumbass lady again","commenter_a":"\"Surrogate?\" That's his campaign CHIEF!","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"10153119045143145","commenter_b":"You are actually showing your colors, stop trying this woman about race card when it was all about race.","commenter_a":"She was stupid and uncooperative. Why didn't she just do what they asked her instead of acting like a complete assh*le.","post_message":"This woman got into a road rage argument in a school parking lot. Then this is what happened when police arrived. #WFTV WATCH THE VIDEO: @webpagelink"},{"comment_id":"849416281771667","commenter_b":"Not all women are evil feminists... Only feminists are evil...","commenter_a":"Abortion was legal by common law we brought with us from England at the very beginning of this country, the 1600's, women could abort up until quickening using herbs, falls, punches to the stomach, abortion potions were big business and freely advertised. The Founders did nothing to change this either. Try Googling the history of abortion in the US.","post_message":"Pretty much."},{"comment_id":"10155692576378572","commenter_b":"hit her in the ass with the INK","commenter_a":"good riddence to you old girl you will be replaced go join Isis","post_message":"SHE IS ALSO A HILLARY CLINTON SUPPORTER..."},{"comment_id":"10154302176821491","commenter_b":"Duchess Aungelique GauBrielle You're officially crazy. Added, this is one man's personal experience as well to be fair...","commenter_a":"In all honesty, this sounds like a disgruntled employee... all of the African Americans employed, & previously employed at Versace... he's the only one to disclose this... people buy into anything where race is concerned. I'm African American, I shop high end... I've definitely experienced Racism while shopping, but I could literally count the incidents. Racism is very real, but it's being used and over used to justify everything! However, if this is true, why did he wait until he was fired to speak up. Also, why have none of the other African American employees past or present come out to support him?","post_message":"The store employees were taught during training to say \"D410\" whenever a black customer entered the store, according to the lawsuit."}]
