[{"comment_id":"10153129046736051","commenter_b":"The border is broken and Obama wants everyone to come on in. Breakdown between law enforcement agencies. I agree with Trump. Build a damn wall. I live in a border city. Luckily we don't have a big problem but now we have to worry about middle eastern people.","commenter_a":"That's a Dad who will have nightmares the rest of his life! May God be with him. What a beautiful young woman! What the hell is wrong with our country?","post_message":"This woman's dad had his arm around her when they heard the pop. As she collapsed on the ground, he could hear her repeat the same thing over and over again: \"Dad, help me, help me.\""},{"comment_id":"10152898071811336","commenter_b":"illegal aliens no doubt !","commenter_a":"Are you kidding me, do parents have any responsibly any more.","post_message":"The nation's second-largest school district is eyeing a move to offer dinner to students at every school."},{"comment_id":"10153889494331438","commenter_b":"I just don't understand how people who vote for these whackjobs can imagine living in the world that they want to create. Talk about a hellhole..","commenter_a":"Ted Cruz's campaign statement that \"Muslim neighborhoods\" should be patrolled and militarized is possibly the least American thing I have read today. Land of the free, home of the brave? Nope, not so much because those brown people scare me! And who determines how many Muslims in one neighborhood is enough to warrant this police state attention? I live in a very nice neighborhood and although I don't know for sure (you can't tell someone's religion by looking, folks) there are possibly 4 or 5 Muslim families in my little 2 mile square housing tract. Would that qualify as a \"Muslim neighborhood\"? Jesus, these guys are scary. Bomb, kill, torture, create Muslim ghettos inside the United States. Ugh!","post_message":"Ted Cruz and Donald Trump have particularly harsh responses to the Brussels attacks."},{"comment_id":"10153344730251130","commenter_b":"The County Clerk who refuses to issue marriage licenses to gay couples makes the same argument. This job responsibility should be no surprise to her. If she can't do it, then she needs to be in a different job.","commenter_a":"Surely she knew when she took the job that serving alcohol was part of it. Go find a job that fits your lifestyle.","post_message":"\"No one should have to choose between their career and religion.\""},{"comment_id":"1232264963481332","commenter_b":"@username, you should read up on the case! It doesn't look good and she's only after what Trump would consider pocket change.","commenter_a":"Wait, Wait, Trump claims he never sexually assaulted anyone, \"I only spoke words, Bill acted\". but Bill was charged and cleared and Trump has been charged. Also, he is being charged with Raping a 13 year old girl. And I don't want to hear from Trump supporters that he \"innocent until proven Guilty\" because every single charge they've made against Hillary, she has not been proven guilty of.","post_message":"WOW. Trump has a lot of explaining to do... in federal court."},{"comment_id":"10154405981987300","commenter_b":"But they're still ten times better than ungrateful immigrants from African hell holes!","commenter_a":"They have everything covered. Police union, the system, their own partners that lie to protect themselves, the idiot that post all over the internet \"back the blue\", they get a free meal because if they don't, they'll make a tantrum and call the police and the news, etc, etc, etc. A simple war veteran (which, to me, has more respect that this parasites of society), don't get much back up when they get in trouble. Of course I'm talking about the bad cops. Because their is bad cops, right?","post_message":"“It’s too emotional to see your baby caught up in something like this.”"},{"comment_id":"10153665410768352","commenter_b":"Where is that bitch I want to slap that Bitch","commenter_a":"So sad ...so many stories lately of mother's loosing their minds....it would be really nice if dad's would start manning up and helping more.","post_message":"A Hungry 5-Year-Old Dials 911 Pleading For Food After His Mom Abandoned Him And A 10-Month-Old Baby At Home Alone"}]
