[{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx \" you big dummy \"","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"367258316795796","commenter_b":"This is against the establishment clause of the Constitution!!","commenter_a":"Send all of those goat lovers back to the sand dunes!","post_message":"Allah is replacing God in our schools..."},{"comment_id":"789366324587278","commenter_b":"Jesus, doesn't anyone see a pattern here & this dirty insane hobag. I wouldn't vote for her if u paid me. She's evil..I pray Trump wins and try her and Ovomit for TREASON and HANG their sorry asses!!!","commenter_a":"And before everyone gets Butt hurt over this one lets just reminisce some history about the Clinton's... And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock Rose Law firm. Died of a gunshot wound to the head, ruleda suicide. 4 Ron Brown Secretary of Commerce and former DNC ...","post_message":"Clinton Mistress Reveals Herself, Drops Major Bombshell Right On Top Of Hillary This will completely derail her campaign. Do you think the last thing America needs right now is another Clinton?"},{"comment_id":"1023160814385680","commenter_b":"Pussy bitch","commenter_a":"Fuck that! If that fuckin dog was comin at me is shoot the cunt too! No questions asked! Why risk your life for someone's untrained mutt!!","post_message":"The difference between firefighters and cops. Coward → @webpagelink Filming Cops (Y) via Cop Logic (Y)"},{"comment_id":"10153201313814255","commenter_b":"How is this even legal?! How do these cretins get to refuse to act on ONE thing because they don't LIKE another?!!!!!","commenter_a":"Geriatric Mutant Ninny Turtle. Competing with Agent Orange to see who is the worst leader in Congress.","post_message":"Thugs."},{"comment_id":"10154765929828812","commenter_b":"That retort would demand a Breathalyzer test immediately in any Protective Custody or Dangerous-ness to the public situation. The man is incapable of formulating a complete and comprehensible sentence in English. Does he, maybe speak English a second language like some immigrants do? I've watched people get detained/PCd for less. He's going to lead the free world. We have illuminated the planet with a new low in the dummie-ing down of America.","commenter_a":"One temper tantrum away from WWIII","post_message":"Donald J. Trump says he \"could tell\" from intelligence officials' \"body language\" they were unhappy Pres. Barack Obama \"did not follow what they were recommending.\""},{"comment_id":"10153850039752452","commenter_b":"Samantha Keller me","commenter_a":"Esdras Diaz","post_message":"After being a dad for five months, this father decided to share a funny review on his “2016 model” baby. @webpagelink"}]
