[{"comment_id":"10153715195470736","commenter_b":"NO>>NO..these are always a waste of tax payers money and benefit Corps...and I don't want MORE people here..","commenter_a":"NO!!! no no!!! such a waste.","post_message":"Would you want Oregon to host the summer Olympics in 2028?"},{"comment_id":"933533113336146","commenter_b":"Humans suck","commenter_a":"I donate to Amur leopards monthly. I hope we can save these lovely creatures!","post_message":"We need to take action now or risk losing some of the most beautiful citizens of our world."},{"comment_id":"10153306712306323","commenter_b":"Women are garbage collectors in the US. I've worked with a woman in construction 25 years ago in construction. I quit that job, and got an easier one. She remained, lol. I don't mind Feminism, I think it's something that needs to exist. I just don't like the internet clusters of nutjobs, who believe if you smile or say \"hello\" to a woman, you are promoting rape culture-whatever the fuck that is. These types of Feminists are useless. They need to fuck off.","commenter_a":"According to 2010 BLS data, the following jobs contain 1 percent female workers or less: boiler making, brick masonry, stonemasonry, septic tank servicing, sewer pipe cleaning and working with reinforcing iron and rebar. Maybe the reason female workers aren't in these occupations is that too many are in other occupations. Females are 97 percent of preschool and kindergarten teachers, 80 percent of social workers, 82 percent of librarians and 92 percent of dietitians and nutritionists and registered nurses. Women have demanded more professorships, seats in congress and chairs in the boardroom, but have never complained that there were not enough female garbage collectors, waste water treatment workers, plumbers, welders, pipe fitters, coal miners, truck drivers, brick masons an block masons, lumberjacks, oil rig workers, well drillers, surveyors, longshoremen, construction workers, landscapers, sheet metal workers, HVAC repair persons, meat packers, high rise window washers, car mechanics, iron workers or any physically ...","post_message":"\"Philip Zimbardo is one of the first people undergraduate psychologists learn about. His prison experiment in the basement of Stanford University showed a darker side of humanity. He now tells us that there are fewer men than women at college, stating that positive discrimination is now needed to increase the numbers of men at university, but this is because ‘one reason you go to college is to find a guy’. Not only are these kinds of views horribly sexist and outdated, they’re also far too simplistic.\""},{"comment_id":"1046533445373310","commenter_b":"that's not fair to pres o","commenter_a":"MLK would be ASHAMED of those useless race-baiters. He would spit in their eyes himself, if he were still alive.","post_message":"How I wish we had a Martin Luther King today instead of thugs and scam-artists like Sharpton, Jackson, Holder—and Obama."},{"comment_id":"10154346331578812","commenter_b":"I love the sons of Diana and Charles.. The babies are as sweet as can be..long live the queen","commenter_a":"So cute x","post_message":"Prince George is allowed to stay up 15 minutes past his bedtime to meet the Obamas at Kensington Palace dinner."},{"comment_id":"10154168585709726","commenter_b":"She will be worse and any of the others. Idiots","commenter_a":"Whoever gets the nomination could run a brilliant series of ads about Hillary's War on Women.","post_message":"Abortion rights group looks to spend big to secure Clinton victory in November."},{"comment_id":"10153182751728145","commenter_b":"Can the a/c compressor fit in my car? My A/C isn't working, I'll take the air over a flag! lol lol","commenter_a":"Give it a rest already","post_message":"Say goodbye to General Lee. Now toy versions of the iconic orange Dodge Charger will end production. Here's why: @webpagelink What do you think about this move? #WFTV"}]
