[{"comment_id":"10156878121275551","commenter_b":"She will infest the White House with her crabs.","commenter_a":"No way, I would vote for a homeless veteran first.","post_message":"Patriot Update"},{"comment_id":"10153227966933984","commenter_b":"The woman is a fukin crook","commenter_a":"I want a moral person leading our country!!","post_message":"Well, here's BIG news that will turn a lot of heads. Do you hope this marks the final chapter of the Clinton saga?"},{"comment_id":"1342391692491333","commenter_b":"Put her in jail","commenter_a":"Buses...bussed them in and still cannot fill a gym","post_message":"Hillary Clinton spoke at a campaign rally in Sanford, with one week left until the election."},{"comment_id":"1242328489179018","commenter_b":"Sick bitch. I hope she chokes to near death and has a fucking stroke. I don't hate people but this pos. needs to disappear for good.","commenter_a":"Wow, is everyone scared of killery ? Geeze really ? Oops, forgot about the Clinton Mafia and all the dead bodies in their wake. Maybe they have reason to be.","post_message":"After months of pressure, the mainstream media has finally begun asking questions about Hillary Clinton's health. Just as they do, however, Hillary and her people have made a SICK threat to all of them... and it could mean that the truth stays hidden from America."},{"comment_id":"904212379645518","commenter_b":"These thugs and hoodlums should be arrested .","commenter_a":"Thugs","post_message":"He Wasn't Ready!"},{"comment_id":"10156697390890354","commenter_b":"I wouldnt be a cop there for any amount of money. I say, disband the police, send those trained officer where they are really needed...and let the animals rape, rob and kill each other. Liberalism worked so well in all the other major inner cities (Detroit - a decaying liberal sh*t hole, Philly, East St. Louis, etc...), let Berkley have a peek at reality.","commenter_a":"--- I recommend abolishing 'UC Irvine\"----much more accomplished----","post_message":"You're not going to believe what they say in their demands letter. As you read it, just remind yourself that these are tomorrow's college educated \"leaders.\""},{"comment_id":"10155910391265725","commenter_b":"Take America back. STOP buying crap from other countries.","commenter_a":"DONALD TRUMP: Speaking what everyone is thinking. TAKE AMERICA BACK.","post_message":"Wow, some new and even greater polls-- thank you!"}]
