[{"comment_id":"10155358304877439","commenter_b":"Think someone must be shitting they're pants cause this brave WOMAN is gonna sort the RATS out..😂😂😂","commenter_a":"This is a threat. He should be arrested and jailed.","post_message":"A 24-year-old Muslim blogger and so-called human rights activists has called for the slitting of France's Marine Le Pen for her conservative political views."},{"comment_id":"1513700471996539","commenter_b":"I agree with a person that wants sources: he is right to ask for them. I did not give some simply because it would take too much time on my part to gather them (about the same it would take to do the research on CRS and FATCA's actual consequences). These are the keywords you want: FATCA CRS money laundering Nevada","commenter_a":"Jumping on the demonize Putin wagon eh, big surprise coming from vice. This has nothing to do with Putin, but I see his name a hundred times. Clearly this leak came from the u.s. How about the American banks laundering drug money, or the us govt selling weapons to drug cartels, or CIA plane crashing full of cocaine, or u.s Senator macconell s boat full of cocaine. Won't touch that, because that's actual truth, stay away from that. Just another propaganda outlet for the u.s government.","post_message":"The Panama Papers were a big deal."},{"comment_id":"950976811609844","commenter_b":"Yes!!! Although these women should be considered normal size and healthy... Definitely not 'plus size'... Sick of all the labelling... How 'bout healthy, happy and active?!","commenter_a":"I don't care what anyone else thinks. I think she looks great. But I think the more important question is \"How does her personality, intelligence, etc. compare with her looks?\"","post_message":"So excited for The Official Ashley Graham Fan Page, the first \"plus-size\" model to have an ad in Sports Illustrated! AND for Robyn Lawley, who's the first \"plus-size\" Swimsuit Issue model! Here's why that's so exciting."},{"comment_id":"1234345436618217","commenter_b":"They had a class on how to not rape women? Send the raping muslims home","commenter_a":"Stupid girl, wait until it happens to her or someone close to her, then she will change her tune.","post_message":"Watch as Red Cross spokeswoman cautions that this is just an isolated incident involving a teen who just didn't know any better...."},{"comment_id":"10157692463425389","commenter_b":"Hillary will win due to the corruption within the establishment, and the votes of illegals and dead people!!","commenter_a":"Never permit the Federal government to pass into the traitorous hands of Hillary Clinton","post_message":"Keep in mind-he actually did these things."},{"comment_id":"604349323031583","commenter_b":"You're an idiot. It doesn't matter what book you use to swear I could use The Heir to the Empire by Timothy Zhan and that would be acceptable. This is a secular country not a Christian nation if you want to argue that fact look up the 1st ammendment which is the freedom of religion and freedom from religion in addition to separation of church and state. If she wants to use the Quran let her if you want to use the Bible fine if I want to swear on a star wars book damn those corrupt judges I'm going to swear on my Star Wars book","commenter_a":"No. We use the Bible in this country.","post_message":"Should he have allowed her to take her oath on the Koran?"},{"comment_id":"579001232257569","commenter_b":"THIS HAS ALWAYS BEEN A PROBLEM FOR A LONG TIME ITS CALLED THUGS AND OUTLAWS IN CHICAGO.THIS STARTS AT HOME WHEN THESE THUGS DO NOT HAVE A FATHER TO SHOW THEM THE WAY.THINGS WILL NEVER CHANGE IN CHICAGO WHEN YOU HAVE WOMEN THROWING THERE LEGS UP TO ANY MAN WALKS BY FOR MONEY.IT WILL NEVER CHANGE. THEN THE MEN WALKS OFF AND FINDS ANOTHER ONE TO KNOCK UP.THE WORLD KNOWS ABOUT THESE PEOPLE.ITS LIFE IN CHICAGO.","commenter_a":"What a joke","post_message":"BLACK LIVES HYPOCRITES! Gun-Controlled Chicago: 21 Shot, 1 Stabbed, 1 Dead In 24 Hours Amazing they can unite and riot for TRUMP but can't for the constant murders and shootings plaguing THEIR community! IF you are pissed off LIKE AND SHARE THIS!"}]
