[{"comment_id":"10153061482070326","commenter_b":"I don't care who the media whores are in love with or paid to pretend they are in love with. If people would just vote for who they really want to win, we would beat them. Stop listening to the media tell you no one can beat Hillary.","commenter_a":"Thats because the media no longer represents the people. They want to talk about emails, when most of us are worried about just making it. I wouldn't sit down with you either.","post_message":"This is what Hillary Clinton does NOT do with the media."},{"comment_id":"1466659373354088","commenter_b":"@username <<<america needs more folks that think like this guy... dude you such teach classes to these bigot trump supporters","commenter_a":"Protestors are chanting \"Black Lives Matter\" as they set fires, fire weapons and attack police with bricks but BLM leadership will say they don't represent \"the movement\". Yes, this IS your movement. No one respects you. You defend criminals, make martyrs of cop killers and have the gall to act like these violent protests don't speak for you?","post_message":"A large crowd turned out after Milwaukee police shot and killed what they said was an armed suspect earlier in the day."},{"comment_id":"10154505706873812","commenter_b":"If you create terror among a group because you are shooting them and killing them, you are a terrorist. If you align yourself with a KNOWN terrorist group, you become part of that terrorist group. I don't believe any domestic terrorist has EVER sworn allegiance to God and commenced to killing folks though.","commenter_a":"Just because it's deleted doesn't mean it wasn't said!!! He swore his allegiance to isis! We already know this. I guess offending those of the same belief and/or faith is more important than the entire truth being released so it's sugar coated and deleted. Sickening!! Why bother releasing any of it if you delete the parts where he ADMITS he's a freaking terrorist?!!!!!","post_message":"UPDATE: DOJ and FBI release full transcript from Orlando shooter's 911 call to provide the \"highest level of transparency.\" abcn.ws/28It1Ld"},{"comment_id":"587167334791713","commenter_b":"Stand with her point of view, and share her perceptions with your friends! @webpagelink","commenter_a":"I am with hillary","post_message":"One candidate delivers catchy lines—the other delivers results. Add your name to say you're with Hillary. #DemDebate"},{"comment_id":"10152944029886316","commenter_b":"Well that settles it, she paid $600.00 for that?","commenter_a":"no no","post_message":"In recent days, Hillary forces half a department store to shut down just so she could get a $600 haircut in a luxury salon, even as she refuses to engage the very public she is trying to convince to vote for her for president: @webpagelink"},{"comment_id":"10153401968107411","commenter_b":"GOOD..,TIRED OF SMELLING DOG POOP ON A HOT SUMMER DAY we have filthy nasty neighbors with too many dogs...they don't clean the poop and it FEEDS RATS PEOPLE...","commenter_a":"Esoj Ornelas","post_message":"Mayor Emanuel and several Chicago aldermen are proposing a new ordinance that calls on property owners to clean their lots daily to keep them free of feces -- or face fines up to $500."},{"comment_id":"10153090141861680","commenter_b":"So what? Nothing should be said about mass shootings? Thugs and criminals are not mass shooters. There is crime everywhere. In every state and city. Our second amendment has been a shield for evil doers. Most criminals and thugs or gangs are trying to survive a life of under privilege and zero opportunities...jmo","commenter_a":"I live in the Atlanta area and every day, I say again, every day there are 3, 5 and some days more murders, carjackings, home invasions, bank robberies all committed by thugs, gangs and criminals. Yet, you don't hear one word, not one word of anger or control to get the guns out of the hands of these criminals. There are more murders in one week in the Atlanta area than the 10 souls that were lost in Oregon. If politicians really cared about every life, there would be more done to dismantle the gangs and thugs in our country. But instead all they care about is how they can take advantage and politicize a senseless crime to advance their agenda to take guns away from US citizens. They know that CRIMINALS DON\"T CARE ABOUT THEIR F'n LAWS!!!! So their true intentions must be to disarm the people.","post_message":"POLITICO takes a look back at some of his stronger words on the issue."}]
