[{"comment_id":"10155928923344199","commenter_b":"This is the best.","commenter_a":"Breanna Barrick","post_message":"'Church, singing and sex:' That's what this couple says has kept them together for 75 years! More: via.q13fox.com/Xirhe"},{"comment_id":"10152721267846813","commenter_b":"Did feminists put these dumb words in this clown's mouth?","commenter_a":"The problem comes from this institutionalized idea that men are superior to women and therefore can make decisions on behalf of women. It is a systemic problem that as a society we have been fighting externally, but have found challenges how to fight it internally.","post_message":"Should men be able to decide what happens to a woman’s body? Sound off in the comments section! #LetsTalk"},{"comment_id":"1074021369287319","commenter_b":"She's negative. ..kinda like both of u ... f off","commenter_a":"Beyonce is an asshole","post_message":"Not a lot people noticed, but Beyonce took a major stand last night."},{"comment_id":"1121293104578213","commenter_b":"A girl?!?? Good at a SPORT?!? Better insult her appearance!!","commenter_a":"Talking bout that horse face","post_message":"WNBA star Elena Delle Donne shared her free-throw secret and the encouraging words that drive her. - Erin Canty"},{"comment_id":"10152876898775496","commenter_b":"Prayers for her son and family!!! The county and the contractors should be held responsible! There's no way a lifeguard should have his job if he can't swim or perform CPR! Ridiculous!","commenter_a":"Obviously the lifeguards should be able to swim and perform CPR but my question is more for the Mother ... Don't depend on other people to keep your kid safe in a pool ... That is your job as his parent ... Why are you do quick to blame another for your lack of responsibility in this? Just another story of needing to blame someone else ...","post_message":"\"The lifeguard told him that they couldn't swim to him, they didn't know how to swim, and one said that he didn't know CPR,\" See more: @webpagelink"},{"comment_id":"10154663245784657","commenter_b":"Who wants to watch a liar. He is so delusional, he should have been removed from office years ago. Except Congress has no spine !","commenter_a":"Heard one from this 'fella, you've heard them all !!! Only said \"I\" 84 times in this one, --- he's gettin' better ???","post_message":"Obama, the celebrity president, may not be as popular as he thinks he is."},{"comment_id":"950334638377899","commenter_b":"Put this bitch in jail","commenter_a":"Clinton should be in Jail.","post_message":"Hillary Clinton says the Republican party's hatred for President Obama crosses political lines and is simply disrespectful. Do you agree with her?"}]
