[{"comment_id":"1159085570778138","commenter_b":"No the Great Wall did not work. Mongols had no problem getting over it.","commenter_a":"Nothing But Crap. Christie came out strong when he was elected Governor but it's been all down hill since. Why talk about Brady, not even his State. As for the wall, it worked for thousands of years for China. Plus it's a hell of a lot cheaper than what it is costing us in welfare, medical, food stamps, crime, law enforcement, prisons..... Put the people collecting welfare to work, take the young men like the CCC and WPA days. Bring our military home and build the wall.","post_message":"“Please, please, please do not fall for the idea that we are going to build a wall along the entire 2,000-mile border of the United States and Mexico ... It’s not feasible. It’s not practical. It’s too expensive. And by the way, I’ve never seen a fence or a wall that if a human being wanted to get over or around it that they couldn’t.”"},{"comment_id":"10153453475573128","commenter_b":"To let the criminals' partnered officials pirate settlements to fill RICO crime established deficits AS the CRIMINALS declare exemptions on the fines, PRESERVES THEIR RIGHT TO THE CRIMINALLY GAINED CAPITAL, as the RICO mechanisms are left destroying the citizens WHO ARE NOT MADE RIGHT. They STILL lose the paid into asset/taxes.","commenter_a":"What is more egregious than a racket on our assets and THEN OUR WEALTH/earnings used to STEAL the racketeered assets WHILE the bank uses OUR wealth to outsource, exploit economic refugees, and MARKET RIG for decades? Citizen-taxpayers FORCED TO ASSUME market control(free market) destruction as RISK, as criminals assume racketeered assets, margins, and government. That is TEXTBOOK Weimar-Gangster Statism for which the criminal interests MUST be prosecuted and the assets/capital RETURNED to us as citizens and to our economy.","post_message":"A decade after homeowners used a soaring real-estate market to go on a borrowing binge against their own properties, many are now falling behind on payments."},{"comment_id":"10150906812849999","commenter_b":"Which candidate doesn't?","commenter_a":"Guys he meant he is happy that nobody died lol get over it you all know what he meant. He says a gaffe, everyone is on it and saying how ill qualified he is, yet 99% of the time he is showing his wits no one cares.","post_message":"\"Well, first of all, just grateful that nobody got hurt,\" Gary Johnson told CNN after the attacks in New York and Minneapolis."},{"comment_id":"10153100567617464","commenter_b":"get rid of her","commenter_a":"She's bad news , she's dangerous to the good people of America!!","post_message":"Read and SHARE my new op-ed: Republicans must oppose Loretta Lynch — or lose all credibility on lawlessness: @webpagelink #StopLorettaLynch"},{"comment_id":"10152987263776130","commenter_b":"@axelnieto and @hugoaguilar. I never said people in Latin American countries aren't happy. I also never said that there is absolute no wealth or opportunity. I agree with you that it's not easy (which is what I was trying to make a point of to begin with) but it is there.","commenter_a":"They don't make work, wealth, and success important because their country doesn't give them the opportunity for that. Duh huffington post.","post_message":"\"Instead of making work, success and wealth the most important things in life, Latin Americans typically have family and community firmly at the top of their priority list.\""},{"comment_id":"10154138321738837","commenter_b":"I read she was with the lady already in line she just had more items for her. She did'nt skip the line. That racist pos was out of line enough said! Pendeja!!!!!","commenter_a":"Realistically speaking if you're with someone and they're at the counter cashing out who's going to go to the back of the line if they were \"Together\" and you're only adding an item or two?? saying she should have went to the back of the line is both irrational and impractical... part of the problem is making excuses for the inexcusable...","post_message":"#RACIST RANT RECORDED: A woman's Tuesday night racist rant while Christmas shopping goes viral on social media."},{"comment_id":"10153153941377507","commenter_b":"fuck her","commenter_a":"Who is this boob! Facts are facts!","post_message":"The last thing we need is a news outlet telling seniors that their Social Security isn't their money. We need to expand it - not cut it. Sign the petition if you agree: @webpagelink (via Snarky Pundit)"}]
