[{"comment_id":"10152792589201051","commenter_b":"Yes she should get surgery. Just wire her mouth shut","commenter_a":"Well if she would close moth once in awhile and watch what she eats she would not have to have surgery. I know it's the tax payers fault.","post_message":"This teen and her family have just one request for taxpayers."},{"comment_id":"943402869028468","commenter_b":"It is only because all the other politicians want illegal's here. Trump is watching out for the American People!","commenter_a":"It's being said that Mr. Trump is causing problems for the GOP; taking votes from the others. BS! I'm Indy/democrat, and trust me, I'm voting for Mr. Trump! Any other Indy/democrats doing the same?","post_message":"BREAKING"},{"comment_id":"10155024202814703","commenter_b":"America has American terrorist's as well. Why no effort on banning them, or shipping them out of our Country???","commenter_a":"Bet you never thought you would see planes crash intentionally into buildings either","post_message":"Thoughts?"},{"comment_id":"10152515657266717","commenter_b":"Not really applicable but you forgot \"love\" ;)","commenter_a":"Game, Set, Match. Give it up.","post_message":"Join our mailing list for a daily news recap: lgbtqn.at/mail Follow us on Twitter: lgbtqn.at/tw"},{"comment_id":"10152774943488717","commenter_b":"Women drivers..","commenter_a":"hmmm - am I the only one who doesn't \"buy\" the foot caught on accelerator? I feel for anyone who reaches the point where they should no longer be driving - this appears to be one of them.","post_message":"Watch as a driver in Wisconsin slams into nine cars in a parking lot: @webpagelink"},{"comment_id":"993063080750221","commenter_b":"Biden's coming in! you lose, Hillary.","commenter_a":"backwards is thinking that butchering a live baby in the womb is ok to do.","post_message":"In this week's Facebook Q&A, Hillary took on Jeb’s claim that Democrats use \"free stuff\" to appeal to minorities."},{"comment_id":"10154369972274749","commenter_b":"He is just like the guy that went on s rampage at the abortion clinic but this time he us a Muslim which changes the entire situation.","commenter_a":"Come on give the man a break,he was only a good muslim following the teachings in holy quran giving the wife the odd back of the hand and killing gay's is all well and good with islam ! It's us that have to adjust to the way they want us to live","post_message":"Mateen's ex-wife said she had been beaten by him during outbursts of temper in which he would \"express hatred towards everything.\""}]
