[{"comment_id":"10153412068770667","commenter_b":"Ban all muslims from America!","commenter_a":"Muslims are hitting Facebook and other social media to proclaim that Islam is a religion of peace again... The only difference between \"moderate\" Muslims and radical ones is the distance from the suicide vest.","post_message":"BREAKING: Three explosions have left more than 30 dead and dozens injured at an airport and subway station in Brussels. Officials expect the death toll to continue to rise."},{"comment_id":"10153465235771316","commenter_b":"I guess the woman in this pic is borderline retarded...","commenter_a":"They can store more farts too so that's good","post_message":"Women with larger behinds are healthier and more intelligent, study finds: @webpagelink"},{"comment_id":"455416051331721","commenter_b":"Bullish*t. That articulate enough for you?","commenter_a":"If there is one thing that is inescapably true about President Obama compared to the many predecessors that came before he is this: President Obama will be considered by history's standards as the most articulate president to ever occupy the white house! Period!","post_message":"President Obama's last State of the Union address is January 12th—don't miss it. @webpagelink"},{"comment_id":"10153816896676337","commenter_b":"\"Bitch! Now turn the other cheek!\"","commenter_a":"Jesus needs to come back and give this Pastor a firm pimp hand.","post_message":"The Pastor leading the Starbucks red-cup charge got disconnected and laughed at on TV..."},{"comment_id":"10157357339200354","commenter_b":"Nope don't thonk so. We the people have spoken.","commenter_a":"I think billy needs to brexit.","post_message":"If at first you don't succeed..."},{"comment_id":"717073721816539","commenter_b":"She is nothing but a bitch and a liar.","commenter_a":"Hillary for Prison 2016","post_message":"Hillary tried to damage Trump’s reputation by spreading this rumor. She is disgusting. Comment ‘yes’ if you think Hillary should be punished. Can we get 30,000 ‘LIKES’ for Donald Trump? [VIDEO]"},{"comment_id":"10154662722072619","commenter_b":"Stupid woman.","commenter_a":"Total anti-semitic bitch; She would march the Jews to the ovens if she could.","post_message":"Swedish FM drew outrage in Israel when she linked the terror attacks in Paris and the feelings of Palestinians."}]
