[{"comment_id":"588976734614882","commenter_b":"She couldn't sexually satisfy ol slick willy either","commenter_a":"Don't want her in the War Room...Remember Benghazi!!!","post_message":"Ahead of President Obama's speech to the Democratic National Convention tonight, The White House released excerpts touting Hillary Clinton's experience."},{"comment_id":"10153638037189778","commenter_b":"Wait. What?!? Trixie, sorry for not telling you, but I cannot have crazy women, or effeminate looking men stabbing people to death in my hotel.","commenter_a":"@username Donovan Hotel? You never said a thing about it. ;)","post_message":"POLICE NEED YOUR HELP! Police say this person is suspect in the stabbing death of a 30-year-old lawyer in NW DC. Please SHARE to help him/her to justice."},{"comment_id":"453687788168068","commenter_b":"The 2ND Amendment was created to stop future Politicians after 1789 From EVER disarming the American POPULACE, It was a RULE OVER The FEDERAL GOVERNMENT to Say Congress the courts and the President Could Not EVER! Make a Law to CURTAIL the AMERICAN PEOPLE FROM OWNING AND USING FIRERARMS, THE GOD GIVEN RIGHT OF THE PEOPLE TO KEEP AND BEAR ARMS, wait for it SHALL NOT!!! BE!! INFRINGED , THAT MEANS NO FIREARMS RESTRICTIONS, TO MY GOVERNMENT THAT MEANS YOU SHALL NOT PERIOD!. END OF DISCUSSION. NEXT GRIPE, SERVANTS OF WE THE PEOPLE.","commenter_a":"Seeing that his commands are what the fighting & killings are all about, it sounds about right, & if you believe that you will believe anything.","post_message":"Why Owning a Firearm is Not Just a Constitutional Right but a God-Given One!"},{"comment_id":"992365204151742","commenter_b":"Since the dawn of evolved time mankind has migrated so that won't stop. I agree the need know who is entering the nation if I remember a European country found that immigrants were part of protest. And terrorist will use this to build cells to attack. However I don't see how Trump will get Gulf States to build security safe zone since the 'fountain is running dry' or maybe he will reignite the polluting of the environment with fossil fuels and take action to get fossils prices back to 110 which will create more bad than good but greedy and gluttony will prosper. His positions may have down sides for any real growth. And I agree that America needs to stop providing bulk funding, to the UN and other, let the world let the new imperialists do it and they, US, rebuild and make the world positive, green, clean and ...","commenter_a":"Republican Party souls have been sold to highest bidders, \"The Sneaky Wolves\". Lincoln Party is officially dead. So sad, Republican primary election is fraud, unfair and rigged, it seems every bigot and racist hiding behind the conservatism came out the closet to poisoned the election process in order to hijacked the Republican Party. I feel sorry for the gullible and naive Republicans who have been mislead, bluffed, lied and manipulated. Trump’s gang for hostile takeover of Republican Party maybe the worst case scenario in the American political history. Thanks a lot media for giving Trump’s gang free ride. Media is sold out to the highest bidders and freedom of press is no longer relevant to corrupt bosses and greedy investors Not again, another Hitler era, never again. @webpagelink Going in and out of building makes a person a Christian no more than going in and out of a barn makes ...","post_message":"“No. I would not allow people to come in from Syria. They’re not vetted properly. They’re moving in by the thousands.” Donald J. Trump reaffirmed his commitment to a ban on Muslims immigrating to the United States, arguing that it is better to build \"safe zones\" in Syria. What do you think?"},{"comment_id":"10153163157971130","commenter_b":"Nope...move along","commenter_a":"I hated the first one...I guess I'm not the audience their after.","post_message":"Thunder-buddies for life!"},{"comment_id":"10153154951847994","commenter_b":"Finally a judge with a brain! you go girl! They should get life but sadly they will have some tear jerking defense and will probably get ten years.","commenter_a":"Wow, this was compelling!!!","post_message":"A judge is furious over the death of a little child -- and she let the suspects hear it. She says watching their police interview footage was more like watching a cable TV show. Read more about the case here: @webpagelink"},{"comment_id":"10153424802654255","commenter_b":"Hillary 2016.....@webpagelink","commenter_a":"That'd be great if a liberal were running.","post_message":"When liberals go to the polls, liberals win."}]
