[{"comment_id":"10153758962823445","commenter_b":"Trump wants to build a 30 trillion dollar wall. I'm guessing you thought that would be free....","commenter_a":"Everything should be free or according to Bernie. Typical politician lying out his ass just so he can get more young people votes. He needs to go back to the old folks home and have his depends changed He's so full of shit.","post_message":"Bernie Sanders: \"Pot Should Not Be a Federal Crime.\""},{"comment_id":"675517259277271","commenter_b":"And now you know .......the rest of the story","commenter_a":"Good questions","post_message":"Hear, hear!"},{"comment_id":"10153604901701167","commenter_b":"Either way she doesn't have a dick anymore.","commenter_a":"Right. Sexual predators never pretend to be transgender to gain access to women they wouldn't have as a man. Never! Umm....errr.... @webpagelink","post_message":"A man has never pretended to be transgender to sneak into a women's restroom. It's just not a problem that exists."},{"comment_id":"10156351239605093","commenter_b":"I just wish humans leave wild life alone.","commenter_a":"Signed ✔️","post_message":"Hanako lives alone in a barren, concrete enclosure without grass, trees, or a pool. Elephants are well-known for having complex social bonds, but it's unclear when Hanako has last seen another elephant."},{"comment_id":"1223203257706743","commenter_b":"But hey lets bring in refugees... and keep illegals... It is good for America according ot Liberals and Democrats","commenter_a":"I agree with them. Shame on Disney.","post_message":"23 former IT employees at Disney are preparing to fight back..."},{"comment_id":"10152765716636028","commenter_b":"What an effen B-tch I see why he cheated on her weird @$$","commenter_a":".","post_message":"\"That's what you get for cheating on me,\" said a woman who allegedly lured her ex to a drug house where a group of men robbed him at gunpoint, according to a judge. @webpagelink"},{"comment_id":"10154038089667293","commenter_b":"Unlikely? Really?","commenter_a":"I live abroad, and there is no escaping questions about Donald Trump on an almost daily basis. I'm often asked directly, \"He's not actually going to be President, though, is he? Can he be? Why are people supporting him?\" They think Americans have lost their minds, and there's tangible concern about what his presidency could mean for the world. Fortunately, I keep FiveThirtyEight handy and can show them how unlikely (currently) his election is, but American democracy has taken a huge (yuge?) credibility hit regardless.","post_message":"When your vacation turns into a lesson in \"Trump-splaining.\""}]
