[{"comment_id":"531668583690388","commenter_b":"GO AWAY!","commenter_a":"This bitch needs to change, or else....","post_message":"Hillary Clinton just said all Christians have to change their beliefs. She is the one who needs to change her beliefs. Do you agree Hillary Clinton it out of line?"},{"comment_id":"10155435763498812","commenter_b":"I","commenter_a":"@username pretty horseys","post_message":"WATCH: When a donkey struggles to get over a fence at a non-profit animal protection sanctuary in Italy, he gets a helping hoof. @webpagelink"},{"comment_id":"1216236868472563","commenter_b":"I'm all for it and We will let Yall have all of our democrats too","commenter_a":"Can we please please please have a vote on splitting the united states into the union and confederate states? Let the confederate states figure out first hand what \"do nothing\" politics really does. The north is already outperforming the south in money and academics, and they aren't so cruel either, but the south will never admit their shortcomings ever and at this point they are just a huge drag.","post_message":"The plan relies on individual tax credits to allow people to buy coverage from private insurers."},{"comment_id":"10153639863228352","commenter_b":"Cover up last thing I want to see is someone's boob while I'm trying to eat!!","commenter_a":"I'm with the lady's it's natural and people need to mind their own business the baby was hungry so mom fed it end of story and ask before posting pictures of people you don't know/ have permission to that's rude and illegal fucking ignorant immature sexist swine","post_message":"New mom is horrified to discover a photo of her breastfeeding shared on Facebook by a disgruntled diner"},{"comment_id":"1359039877491459","commenter_b":"Muslims are the devil","commenter_a":"What the hell is he. Trying to make things harder for Trump?","post_message":"SICK: While You Celebrated Christmas, Obama Gave FULL CONTROL Of Christian Holy Sites To Muslims"},{"comment_id":"10153775896719087","commenter_b":"Nope they're Staying with her!","commenter_a":"Actually, the superdelegate system was designed to stop a primary candidate such as HRC from getting the nomination. They were put in place to prevent someone like her who wins the popular vote but is un-electable in the general election from costing the Dems the WH. The question is are they too corrupt and blind to fulfill their intended purpose which is to give the nomination to Bernie.","post_message":"“I think clearly that the superdelegate model was designed to stop outsider candidates like [Bernie Sanders], and in that sense, they’re doing what they’re designed to do,” said Former House Speaker Newt Gingrich."},{"comment_id":"10154432895041973","commenter_b":"everytime i have to wait for TOO LONG ...i'd rather do it myself","commenter_a":"Yaaaayyyyyyy.... So tired of waiting to have some poor guy out in the cold, heat and/or rain to come pump my gas. And no, I haven't had someone offer to wash my windshield or check the oil since I moved here 17 years ago.","post_message":"You might be pumping your own gas soon if you head out to rural Oregon."}]
