[{"comment_id":"10154493541114060","commenter_b":"Karolina Kulewicz yeyeee","commenter_a":"Congrats Daniel your city came second again! No shame in being runners up 😂😂","post_message":"1. Melbourne 2. Vienna 3. Vancouver"},{"comment_id":"10153593940166336","commenter_b":"Every woman scares Jorge.","commenter_a":"He did NOT pay kids for sex. He raped children!! Get it right!!!","post_message":"Fogle offered to pay adult prostitutes a finder's fee if they could connect him with minors for sex acts, including some as young as 14 or 15 years old, authorities said."},{"comment_id":"10152772572266051","commenter_b":"Awwww come on people . What the heck .people hunt all the time","commenter_a":"You can tell these activists and Hollywood people have never hunted whitetail?","post_message":"Some people are outraged over Matthew McConaughey’s hunting business. Decide for yourselves if there’s anything wrong with it."},{"comment_id":"763624153793368","commenter_b":"@username..Bye Felicia, go suck an egg","commenter_a":"I would waited until he falls asleep, and pull me a loreana bobbitt ...get a Surgical scapple do a nice clean quick slice, get me some tweezers and carry it and throw it on the freeway, and let someone run over it. it ain't big anyway. second scenario, get some super glue and glue his little hands to his little tilwinkle!","post_message":"Did you catch this moment from Melania Trump at the inauguration? Via In The Know"},{"comment_id":"1220652477966511","commenter_b":"LOCK HER UP! LOCK HER UP!","commenter_a":"Lock her up!!!!","post_message":"Live: Donald J. Trump delivers a speech at the VFW National Convention in Charlotte, North Carolina."},{"comment_id":"1648797488740697","commenter_b":"Sadie is a lady Miley is a joke!!","commenter_a":"LOVE LOVE LOVE!","post_message":"America needs more Sadie Robertson and less Miley Cyrus."},{"comment_id":"1066819213408210","commenter_b":"Welcome home honey, Americans take care of each other. We want more proud immigrants like you!","commenter_a":"I am not a us citizen yet,but I hate seeing american burning a us flag..she not the one to fight for her freedom..she didn't even think to the forefathers that fight for her freedom right now..that has no respect at all..","post_message":"WATCH: A police officer takes an American flag away from a protester who was trying to burn it outside the GOP Convention in Cleveland."}]
