[{"comment_id":"1220522774636943","commenter_b":"Lock her up!","commenter_a":"NOTHING TRUMP SAYS CAN CHANGE OUR MINDS WE WILL NOT VOTE FOR TRUMP . TRUMP IS A BASKET CASE . TRUMP IS A CRIMINAL . TRUMP LIES , LIES ,LIES","post_message":"CAST YOUR VOTE: The third and final debate between Hillary Clinton and Donald Trump before Election 2016. Vote for who you believe is winning and see the results LIVE. Vote here: @webpagelink"},{"comment_id":"10153221007429575","commenter_b":"Lmao. Guess who isn't surprised. I just wish I was there. There'd be holes in some stupid flat brim hats.","commenter_a":"Where's Jackson? Where's Sharpton? Where's Eric Holder? Where's the NAACP? Where's the constant 24/7 national news coverage? Oh wait, the attackers were black and the victims were white? Well in that case, move along, no big deal, nothing to see here.","post_message":"\"Their children and grandchildren were running around while we were fighting and they don’t know what’s going on and there’s blood everywhere.\" A party at an Ohio Chuck E. Cheese's got out of control after the store manager told guests the photo booth wasn't working."},{"comment_id":"10154278344319497","commenter_b":"Also @username","commenter_a":"Melissa Tim @username","post_message":""},{"comment_id":"1129043100469880","commenter_b":"There is a woman out there thirsting for this man","commenter_a":"@username LOL","post_message":"He wants to be \"the complete father,\" and he's doing it one braid at a time. A video by Jess Blank."},{"comment_id":"10153446133962550","commenter_b":"Because it's hilarious","commenter_a":"So no crime and no charges....Why is news then?","post_message":"Police found the 22-year-old man curled in a fetal position on the floor, groaning and surrounded by snacks that included Doritos, Pepperidge Farm Goldfish crackers, and Chips Ahoy cookies."},{"comment_id":"10153463322016051","commenter_b":"Too sick! This woman might wear Christian symbols at Christmastime !","commenter_a":"There is no meshing between our God and theirs-the Holy Bible is our guide and law-we are inclusive but stand on firm ground!","post_message":"This evangelical Christian school just suspended a tenured professor for expressing solidarity with Muslims. And they didn't stop there. Decide for yourselves if the school behaved correctly. (Via VICE News)"},{"comment_id":"10153815696151336","commenter_b":"I don't know about that. I think this election we have many that will go up against HRC. She ruined her own chances. Everyone's sick of the shenanigans","commenter_a":"\"DESPERTA FERRO\"..., AWAKEN IRON!!! Christian Battle Cry of the Crusades. Unite and Fight people. WIPE THIS DEMOCRAP FILTH FROM AMERICA!","post_message":"“I am Hillary Clinton‘s worst nightmare — a conservative woman who will take her on on her track record and her policies and her lies.” – Carly Fiorina"}]
