[{"comment_id":"10152999257859342","commenter_b":"I dont think its the color of our skin or were and how we ALL got here. But you do see more black people on the news for killing and stealing than any other race . Hispanics are usually the drunk drivers causing accidents, and whites usually go killing their own kids or parents!!","commenter_a":"It's always the black ppl fault.... Mexican are in the same boat but I see some on here don't see it that way. @username you black and don't know it.... Lol","post_message":"A man pulled a gun while stealing a TV at a Spring Walmart store this morning, authorities say."},{"comment_id":"10152950499076130","commenter_b":"What a joke. Handcuffs is what she should be wearing","commenter_a":"SANDERS 2016","post_message":"Are you?"},{"comment_id":"10153179149615399","commenter_b":"Most Conservative Women act childish.","commenter_a":"Right wing conservative instigator botox bitch.","post_message":"Actually, it's really not."},{"comment_id":"10154768873318132","commenter_b":"First off who the hell is she ? I've never even heard of her . Lol like seriously what does she do ? Furthermore nobody really cares about her opinion because it's a very poor one. More important things going on in the world then you crying about someone not hitting on you he probably doesn't even know who she is","commenter_a":"It seemed pretty clear to me that she was poking fun at herself, talking about her own feeling, not bashing the athlete in any way. Can everyone just relax and remember that everyone is entitled to their opinions and their own insecurities and maybe, just maybe, not twist every single thing that anyone says into something offensive? Geeeeeeeez!","post_message":"Lena Dunham is setting the record straight on her comments about NFL star Odell Beckham Jr."},{"comment_id":"1720672154848520","commenter_b":"@username yes I'm voting for Hillary","commenter_a":"Vote for Hillary and you're voting for corruption. Vote for Trump and you're voting to make America great again!","post_message":"'Get of the fence' and VOTE TRUMP; ' at least he's like us!' - Robert Jeffress (pastor)"},{"comment_id":"1832453327028289","commenter_b":"Always thought she is trash and this proves it.","commenter_a":"Arrest her","post_message":"Ever the provocateur, Madonna dropped a trio of f-bombs and admitted that she's \"thought an awful lot about blowing up the White House\" during a speech at the Women's March on Washington on Saturday."},{"comment_id":"1686987451566043","commenter_b":"@username -- A woman who gets raped didn't choose to have that sex.","commenter_a":"Isn't it great that we have the Government to make decisions about what women can and cannot do with their bodies? I'm so glad we have old, white men who can control our woman parts for us.","post_message":"Indiana Governor Mike Pence signed a bill that bars women from seeking an abortion because the child will be born with a disability, a controversial restriction that is one of the tightest abortion laws in the country."}]
