[{"comment_id":"10153758333227217","commenter_b":"A loose federation or republic please girls. also please get rid of our constitutional monarchy.","commenter_a":"Oh No nae anither ane","post_message":"Will there be a second referendum on Scottish independence? \"As far as I'm concerned, the Scottish people had their vote - they voted in 2014 - and a very clear message came through,\" says new PM Theresa May. #Indyref2"},{"comment_id":"10152513756410927","commenter_b":"e is talking about his leader Satan","commenter_a":"Ha! The blind leading the blind. Schmuck. “This I say therefore, and testify in the Lord, that ye henceforth walk not as other Gentiles walk, in the vanity of their mind, Having the understanding darkened, being alienated from the life of God through the ignorance that is in them, because of the blindness of their heart:” Ephesians 4:17-18","post_message":"Obama says he has sought God's guidance in leading nation..."},{"comment_id":"10153243710196523","commenter_b":"Give her ass the death penalty!!!!!","commenter_a":"Poor angel baby...rip. Your POS mother should now get the death penalty. Horrible!!!!!!!!","post_message":"A 33-year-old woman has been charged with murder in the death of her newborn baby girl after the child was allegedly thrown from the 7th floor window of an apartment building."},{"comment_id":"10154432155426509","commenter_b":"she is a liar","commenter_a":"In the end, She got voted because of her gender. Not saying she is bad, she is decent candidate but this woman thingy got to stop if she truly want to become a great president.","post_message":"\"In my second century, I look forward to seeing a woman president.\" She's 102 years old, and she turned out to her Iowa caucus to support Hillary Clinton: @webpagelink"},{"comment_id":"1807222879565696","commenter_b":"This is the most disturbing thing , what a monster , someone needs to cut his intestines out while his mouths tied up","commenter_a":"I hope that scumbag get his f**king hands chopped off the f**king scumbag thing like that really makes me so made !!!!!!!!!","post_message":"Chinese man live-streams himself DISSECTING a puppy as revenge."},{"comment_id":"1231385010209866","commenter_b":"Hahahahaha en fisica te salve de tu proyecto :v","commenter_a":"@username pa que se te de mejor química xD","post_message":"This is how they should teach chemistry in school. Video by Marie Skłodowska-Curie Actions."},{"comment_id":"10153868800692377","commenter_b":"Hillary is a very nasty woman!!!","commenter_a":"He can call her what she is. A nasty woman. And it's just horrible......But she can call all of us deplorables and its ok. Don't be offended.","post_message":"Donald Trump stirred social media ire on Wednesday after he said, \"We have some bad hombres here\" and referred to Hillary Clinton as \"such a nasty woman.\""}]
