[{"comment_id":"10153598643443812","commenter_b":"Hmmm....will it help us grow perfect women with nice titts?","commenter_a":"Cristian Reyes","post_message":"World's largest atom smasher detects new kind of subatomic particle called the 'pentaquark' -- a new form of matter: @webpagelink"},{"comment_id":"950976811609844","commenter_b":"Yes!!! Although these women should be considered normal size and healthy... Definitely not 'plus size'... Sick of all the labelling... How 'bout healthy, happy and active?!","commenter_a":"I don't care what anyone else thinks. I think she looks great. But I think the more important question is \"How does her personality, intelligence, etc. compare with her looks?\"","post_message":"So excited for The Official Ashley Graham Fan Page, the first \"plus-size\" model to have an ad in Sports Illustrated! AND for Robyn Lawley, who's the first \"plus-size\" Swimsuit Issue model! Here's why that's so exciting."},{"comment_id":"1777601655795113","commenter_b":"Hilary is such a hypocrite. She is lighting the matches.","commenter_a":"But hey, Hillary over Trump for sure.","post_message":"The divisive rhetoric and encouragement of violence we're hearing from Donald Trump isn't just wrong—it's dangerous."},{"comment_id":"538555889666037","commenter_b":"SHE IS NOT A SMART WOMAN","commenter_a":"She fails at everything'. We need #Trump2016","post_message":"She NEVER learns..."},{"comment_id":"10156036197975293","commenter_b":"I don't get it. If a woman pulls her breast out in public it's illegal. I a man looks at her breast he's a perv. So why dose a woman want to breast feed in public.","commenter_a":"It's awesome","post_message":"A picture of some soldiers breastfeeding has gone viral. READ the story and let us know what you think."},{"comment_id":"10154189944991320","commenter_b":"NO WHITE PEOPLE DO THIS...BLACK AND LATINO....NO CHINESE....NO IRISH....NO ITALIANS.....NO GERMANS....NO SWEDISH...... NO LATVIANS.......BLACK AND HISPANIC PIECES OF S..T","commenter_a":"Try Linden Blvd. and Pennsylvania Ave.","post_message":"The NYPD made its inflexibility clear, dirt bikes and ATVs are illegal in the city, break the law and arrests will be made and the seized vehicle will be destroyed. @webpagelink"},{"comment_id":"10154291814626178","commenter_b":"Everything she touches goes to h**l.","commenter_a":"Well if they have a remake of the Munsters she might have a chance. Looks like a cross between Grandpa and Eddie.","post_message":"Michelle Obama to appear on another television show. Is this an appropriate role for the FLOTUS?"}]
