[{"comment_id":"861460177233384","commenter_b":"She needs to smoke. Nancy Disgrace","commenter_a":"I refuse to watch her anymore..go away Nancy!!!!","post_message":"Nancy Grace vs. 2 Chainz: Part 2! Right now on HLN. Where do you stand on the debate? #PotToBlame"},{"comment_id":"10152720268826636","commenter_b":"Sweet name bro","commenter_a":"Old people are more of a danger than teenagers.","post_message":"Why you should always keep your eyes on the road."},{"comment_id":"10154352960083037","commenter_b":"Haha!! This dude is a savage!!","commenter_a":"@username you as a maintenance worker hahaha 😆😆😆😆","post_message":"A KXAN viewer sent us this video today. A maintenance worker at an Austin apartment complex was caught taking a swig of booze. How would you react?"},{"comment_id":"10152927124907293","commenter_b":"because female popes get the same pay as male popes","commenter_a":"1. The premise is not even true. 2. The screaming irony of this makes me think that the @username picked this up from The Onion.","post_message":"\"Why should it be taken for granted that women must earn less than men?\" the pontiff said."},{"comment_id":"1487251671334957","commenter_b":"That bitch could stick her face in dough and make gorilla cookies !!","commenter_a":"No matter what she wears it looks like it came off the rack at Walmart and she looks like aunt Esther. The only problem is us taxpayers are paying the big bucks for her to look like a curtain hanging over a big black window","post_message":"I'm SICK of my hard-earned tax dollars funding their lavish lifestyles!"},{"comment_id":"1122936174469300","commenter_b":"That fat lady will sing in the end, just wait","commenter_a":"I'd never vote for ANY republican, but when it comes to one-liners nobody beats Trump. His smack-down of Hugh Hewitt was epic, and Trump argued well taking on both Rubio and Cruz at the same time.","post_message":"Romney insists Trump's reasoning is an excuse."},{"comment_id":"10152817810411636","commenter_b":"Hmm yes thats the trouble with war..it creats unstable countries which then lets the door open to yet more evil!","commenter_a":"Don't forget he got rid of Saddam Hussain who was committing genocide to thousands of men women & children..on alnost a daily basis!","post_message":"Surprise, surprise"}]
