[{"comment_id":"10154456330994445","commenter_b":"I'm a female! Hilary needs to stay home and crochet something ya crazy hag","commenter_a":"I notice most of the haters of Hillary are men, you must have Momma issues!","post_message":"President Obama made the case for Hillary Clinton, saying there there's no other person more qualified for the most powerful office in the world. @webpagelink"},{"comment_id":"1820420311530016","commenter_b":"Feminazis!!","commenter_a":"Again Liberals at their stupidest.","post_message":"Women's protest"},{"comment_id":"1011579805549158","commenter_b":"Just wait til that fat bitch is refused her insulin because her fat, meat eating ass offends a pharmacists sincerely held religious beliefs.","commenter_a":"Think that woman having a dead fetus inside of her would have been a bigger problem. that can lead to a serious infection. the drugs she was prescribed was not to induce an abortion but to remove a fetus which had already died","post_message":"Straight, white Christian men run the world and they don't care who they have to hurt so that doesn't change."},{"comment_id":"492953910886489","commenter_b":"I don't feel sorry for her. She had the right to marry four times. Fuck that bitch hope they fine her into poverty and hope she gets her ass tossed by a big butch inmate","commenter_a":"just give her a different job already","post_message":"Are you angry at the anti-gay clerk? Us too. But we also pity her."},{"comment_id":"1027700850605035","commenter_b":"Russia does not need turkey; Turkey are the back stabbers lying pigs!","commenter_a":"But Russia will miss alot if they cut relations wz Turkia","post_message":"Russia's Foreign Minister Sergei Lavrov has rejected the possibility of normalizing relations with Ankara after Turkey downed a Russian warplane inside Syria."},{"comment_id":"10153190910859607","commenter_b":"Little a$$wipe","commenter_a":"Uf you don't like what they serve,bring your own.","post_message":"The video of a UConn student berating food service workers who refused to sell him jalapeno-bacon mac and cheese prompted a group of students to start an online fundraiser to give the beleaguered employees a well-deserved night out."},{"comment_id":"10153814640313701","commenter_b":"He needs to be locked up and the key thrown away!","commenter_a":"Not to judge people on appearances, but I would seriously reconsider allowing my kid to be alone with the likes of that creep!","post_message":"A court document states that Toman admitted to sexually abusing a girl when she was between the ages of 11 and 17."}]
