[{"comment_id":"10154179155026051","commenter_b":"Yup","commenter_a":"Nop","post_message":"Do you think Donald Trump would be a better president than Hillary Clinton?"},{"comment_id":"10153855979179099","commenter_b":"The wife is the boss in every house hold, where have you been? #Happywifehappylife","commenter_a":"Hope those who do never get another nomination!! Btw Will, grow a set. We can see who's the boss in your house!","post_message":"Will Smith will join wife Jada Pinkett Smith in not attending the Oscars this year. @webpagelink"},{"comment_id":"10154896780339411","commenter_b":"Why is that boot still in charge. Get her out !!!!","commenter_a":"Says the leader that advocates the EU: one of the biggest protectionism rackets on the planet!","post_message":"'Globalization is happening. We can arrange it such that we strengthen multilateral instruments... or such that we seal ourselves off and become protectionist', said Angela Merkel."},{"comment_id":"998135870245890","commenter_b":"One thing about Hillary she's use to it","commenter_a":"Who are they going to blame when the current President is gone? If GOP members weren't so low information they'd know that these gifts stay with the US government unless the Obamas reimburse the government for the price of the \"gifts\". Another pathetic attempt to start an issue there isn't one.","post_message":"Once again, the right-wing media left out a few important details..."},{"comment_id":"885506288175787","commenter_b":"Thnx god u not woman,imagine poor woman life with such big ugly nose","commenter_a":"if i was that woman i would never talk to that stupid arabian pig -_- what kind of thinking and beliefs let these ppl tobe in social with this kind of talking and beliefs it doesnt worth even a simple like","post_message":"Apparently in countries like America sexual crimes 'are no big deal' to women."},{"comment_id":"442764485911159","commenter_b":"In other words: Problems caused by Democrat policies expected to be solved by Democrat solutions. Great speech, but totally misses that it was HER party that did most of this. KKK, democrat. Vehemently-anti-civil-rights legislation, democrat. Creation of Freddie/Fannie and housing bubble, democrat. Champion of illegal immigrants driving down many black inner city wages, democrat. Cities with most black-on-black crime and deaths, mayors are...you guessed it....years of democrats. Great points, but I really wish people would figure out who REALLY is the Iago to Othello. (hint: he's a democrat)","commenter_a":"Warren! Warren! Warren!","post_message":"Elizabeth Warren explains why \"it is important to cause necessary trouble.\""},{"comment_id":"950144531689554","commenter_b":"pathetic drama queen!!!","commenter_a":"Let's remember who this guy is....his history, his previous shows, his personality, his tweeting naked pics of himself....self-absorbed little twit!! he is one of the reasons I am not watching Fox News as much as I once did. He's a twit and he's all about the legalizing all illegals.....as he calls it, the \"Brown Tide\".","post_message":"After Trump adviser called Geraldo an \"embarrassing hack,\" the Fox News correspondent threatened violence."}]
