[{"comment_id":"1598021397151640","commenter_b":"At least God is doing something to help with the immigration problem.","commenter_a":"He is a wonderful god","post_message":"WHOA!"},{"comment_id":"10152772722763445","commenter_b":"Stfu","commenter_a":"Pot kills","post_message":"What are you paying for your stash and how do they compare? Pot Prices: December 2014 THMQ."},{"comment_id":"10153438388656336","commenter_b":"Adam you dysfunction perverted twist ! This is america and illegal alien will be deported soon or later ! With traitors !!!","commenter_a":"Just listen to the Donald😆","post_message":"ICE said the tragedy could have been prevented if they had been notified of the suspect's release."},{"comment_id":"1054288197942749","commenter_b":"Even if that is the case (and that is some BULLSHIT) that is not what the feminist gender gap argument is all about. What happened to you is illegal, what THEY are bitching and whining about is NOT, nor should it ever be.","commenter_a":"And many women support kids on what they earn while the fathers of their children do no pay child support. Talk about discrimination!","post_message":"BOOM!"},{"comment_id":"10153399487739411","commenter_b":"wrong , Britain has nothing to be ashamed about, its not British people planting bombs and blowing their own kind up, if you haven't got anything useful to say except the usual stereo typical crap then stfu and go away, preferably to the middle east if you think the people are so great. Its funny how people such as yourself preach \"tolerance\", care to show an example of tolerance shown by Islam or its followers","commenter_a":"To that ignorant little britain first shitbag you do not represent my country, Britain is built on the back of slavery, racism and bigoted xenophobic imperialism but today it SHOULD stand for tolerance, cosmopolitanism and living in peace with our collective of ethnicities from all corners of the former empire (Including Wales and ireland, remember when it was fashionable to hate the Irish too, wake up muppet divide and conquer is as old as politics itself.)","post_message":""},{"comment_id":"1747275395512005","commenter_b":"@username if it isn't Mr. Trump YOU will be voting in Hillary","commenter_a":"The only thing that needs to change is HIM OUT OF THE WHITE HOUSE.","post_message":"Obama says \"we\" need to pray for the \"strength to change.\" It's yet another of his disgusting refusals to acknowledge the realities we face."},{"comment_id":"10153232997868352","commenter_b":"Serve her right she should have been in her house doing house work or school what the hell she doing out in a battle field throwing stone, lack of parenting","commenter_a":"that is horrible. This needs to be told all over the news. Sounds like something SA would do instead of Israel.","post_message":"Palestinian girl, 14, locked up in Israeli prison for two months for throwing rocks"}]
