[{"comment_id":"10153591312367217","commenter_b":"The death of the GOP is fun to watch!","commenter_a":"I can explain it in fewer words - sore losers","post_message":"He's the presumptive nominee but not everyone's a fan of The Donald."},{"comment_id":"10153296243781130","commenter_b":"So if this chick had aids and she was bleeding all over, that's cool right?","commenter_a":"And in the meantime virtually no attention was paid to the actual winner of the women's race, Tigist Tufa. Instead the media focuses on this woman and her disgusting stunt. Why am I not at all surprised that Huff Post jumped on the bandwagon.","post_message":"\"Periods are here to stay, and our generation has the power to put this conversation on the map today in order to blow through stigma.\""},{"comment_id":"10153286761179586","commenter_b":"The same with all Zoo's and not only seaworld. But if he or she is born in a Zoo or seaworld, they will have hard time to survive the real world and maybe die of hunger. So what to do? let them live in seaworld or zoo? kill them now? or let them free so they my die a slow dead of hunger because they never have learn how to hunt and survive?","commenter_a":"Assholes!","post_message":"How much space does an orca at #SeaWorld REALLY have? @webpagelink THIS is why they swim in circles in their tanks. The chart at 0:20 seconds explains it ALL."},{"comment_id":"1756660697910009","commenter_b":"I hate everything about this wannabe she makes me sick","commenter_a":"I think I throw up in my mouth every time this convict opens her trap.","post_message":"\"Don't let anyone tell you that our country is weak. We're not. Don't let anyone tell you we don't have what it takes. We do. And most of all, don't believe anyone who says, 'I alone can fix it.'\" Hillary Clinton slammed Donald J. Trump, saying his words \"should set off alarm bells for all of us.\" @webpagelink"},{"comment_id":"10153500362571770","commenter_b":"The world does not have a right to illegally enter the United States. The American people have appealed to Congress for years to secure the southern border so that we could then begin to address the issue of the illegals already in the country. That could have at one time meant some sort of arrangement for them to stay legally. But Congress did nothing because the WSJ, the Chamber of Congress and the business world wanted a supply of illegal, off the books, low wage slaves while others long for a utopian open borders world. It's time to bend our politicians to our will. We need to send the message, secure the borders or pay the price come election day.","commenter_a":"make sure they're all legal!!!","post_message":"A new coalition of Latino groups and labor unions aimed at stopping Donald Trump from becoming president will begin holding voter registration drives at high schools in battleground states."},{"comment_id":"1247455158641980","commenter_b":"She's such a nasty woman!","commenter_a":"guess she needs to be held for terrorist threats","post_message":"MADONNA Tells Feminazis At DC #WomensMarch: \"I Have Thought an Awful Lot About BLOWING UP The WHITE HOUSE\" [VIDEO] @webpagelink"},{"comment_id":"1023820500989519","commenter_b":"Ask Planned Parenthood to pay for it - Bitch.","commenter_a":"There are enough uber wealthy Dems to pay this. Why not hit up Oprah? This is spare change for Holliwood.","post_message":""}]
