[{"comment_id":"1754483651501060","commenter_b":"When they take our gun rights away, what are we to protect ourselves with when evil terrorist get guns off the black market? And don't people see that more people are killed by drugs and drunk driving in America than by people shooting others? They just want to take our rights away!!!","commenter_a":"Barbaric!!","post_message":"Watch Rep. Louie Gohmert shout \"radical Islam\" at House Democrats who were staging a sit-in on gun control. @webpagelink"},{"comment_id":"10152973288751130","commenter_b":"No its sad you women believe that men always negotiate harder. Please provide some scientific evidence of this, other than that try harder.","commenter_a":"Isn't that sexist to say men negotiate better than women? Lol","post_message":"“Men negotiate harder than women do, and sometimes women get penalized when they do negotiate.\""},{"comment_id":"10154060269921162","commenter_b":"BANG...! that's all","commenter_a":"Two things that are impossible... To rehabilitate a terrorist or a child molester. Both should be shot on sight...","post_message":"DISTURBING: Thousands of digital images that show children as young as 5 years old engaging in sex acts with adults were found in an Indiana man's home... @webpagelink"},{"comment_id":"1092357044118639","commenter_b":"Except the assholes wouldnt drown. They'd just move to your neighborhood. I'd rather have them where they are right now.","commenter_a":"So basically where all the assholes in the U.S. live would be underwater. Anyway we can make this happen overnight?","post_message":"Would your city survive? What would Earth look like?"},{"comment_id":"1059194827547028","commenter_b":"He is not even their president. Or that is what their signs say. Besides, they will not be part of the US for much longer.","commenter_a":"Richmond? Bwahahahah! Crime central.","post_message":"So this just happened..."},{"comment_id":"10153776630979714","commenter_b":"Woman here. Would never get an abortion myself, but don't want to impose my beliefs on others so if others want to abort, go ahead. I do not feel the American tax payers should have to fund others abortions, though.","commenter_a":"You have no place to discuss abortion or planned parenthood unless you are a female.... If you're a man, shut the hell up because most of you cant even tell me how many days are in between menstral cycles.","post_message":"Do you, Lena Dunham."},{"comment_id":"1695404184069071","commenter_b":"She's just a fat old cow","commenter_a":"Getting offended over what a woman with no pants on has to say at a game where men are paid millions to crush each other for a ball....Just wow.","post_message":"Some people didn't notice what was happening during Beyonce's performance last night... but these sheriffs did, and they were appalled. Did you notice what Beyonce did?"}]
