[{"comment_id":"778166008983598","commenter_b":"Huge wall!","commenter_a":"Obama is the racist pos","post_message":"“Has anybody tried that wine? How good can that wine be?” President Obama poked fun at Donald J. Trump and the GOP at a fundraiser in Texas."},{"comment_id":"585837851590068","commenter_b":"Unlike Hillary taking the china!","commenter_a":"No matter your political views, Mrs. Reagan always showed great class and dignity to the Whitehouse. The love for her husband was extraordinary. May you rest in peace.","post_message":"Nancy Reagan died this morning of congestive heart failure at the age of 94. She will be buried at the Ronald Reagan Presidential Library in Simi Valley, California, next to her husband. @webpagelink"},{"comment_id":"10153345787268984","commenter_b":"She's a corn ball","commenter_a":"Yes, She Is Crazy!","post_message":"Christians are ripping Hillary to shreds over this. What was she thinking?? Do you think Hillary's already done enough damage to America?"},{"comment_id":"368033556718272","commenter_b":"Sarah Got A Back Bone She Don't Back Down To That Evil Snake","commenter_a":"does she even know where Paris is?","post_message":"Good God, Mr. President, we were once known as the leader of the free world, standing for what is right! You must not let America’s sacrifices be in vain. When will you learn that actions speak louder than your words?”"},{"comment_id":"1795597093801212","commenter_b":"But Hillary won the popular vote..at least you won something","commenter_a":"Hopefully they get deported","post_message":"BREAKING: A massive protest of President-Elect Donald Trump is happening in downtown Chicago. It started outside the Trump Tower and is growing @webpagelink"},{"comment_id":"1303184443111138","commenter_b":"People check when you read this and other comments if your name is being used factilously by the Republican party to make statements in your name for Don the Con. Please watch.","commenter_a":"You sound like school children arguing on a playground. Little school children. This is what you got from the first presidential debate. Hillary did not do well if all you have to talk about is her accusation that Trump called some woman miss piggy.","post_message":"\"If any women was about to let go anything that he said in the past, this is not going to be it.\" - Morning Joe's Mika Brzezinski reacts to Donald J. Trump's remarks about ex-Miss Universe Alicia Machado's weight"},{"comment_id":"895290923994817","commenter_b":"Charlotte u must b mistaken u must mean SLICK WILLIE & HIS FAMOUS LEWINSKY & HIS ASHTRAY WHERE HE PLACED HUS CIGAR!!! HE SAID HE DID NOT HAVE SEX WITH THAT WOMAN & THEN HE ADMITTED HE DID!!! Also remember the FOUR BRAVE AMERICANS WHO DIED UNDER LYING HILLARY!! She shd b in jail!! U have been carrying the water for the dems & it is disgusting!! Grow up cupcake & if u can't go get a coloring book and color!!","commenter_a":"We need a liar, rapist and whore nude model in the White House . U bet","post_message":"With every announcement America is falling more and more in love with the Trump family. This is awesome, it's exactly what was needed. Can we get 5,000 'LIKES' for the Trump family?"}]
