[{"comment_id":"1100615946681704","commenter_b":"@username I am very well aware of anything involving Trump or Hillary. I have kept myself very informed for years. Information he gained while being social with the Clinton's is exactly the information he needed to make his decision to run for President. She is corrupt. Period.","commenter_a":"There is a prayer movement sweeping across the country for Donald Trump. More and more roadblocks are popping up to stop him. If he is your choice, please share a prayer at 10 am and 7 pm that God will take him to the presidency. Feel free to share this post.","post_message":"Wow... he really said it! @webpagelink"},{"comment_id":"10157205870170354","commenter_b":"Cats don't like her.","commenter_a":"She can hate him all she wants but I bet more people in this world hate her pathetic ass. She is a washed up piece of shit who is completely irrelevant and means nothing to no one except maybe a few fucking cats","post_message":"Rosie O'Donnell's worst yet..."},{"comment_id":"465989180258329","commenter_b":"HELL NO FUCK THAT BITCH","commenter_a":"I wouldn't take them if they were free.","post_message":"Will You Refuse To Buy These Stamps?! Comment 'yes' or 'no'."},{"comment_id":"1012827362091069","commenter_b":"The ugly bitch is back. She hasn't been on for a while and I hoped she had disappeared.","commenter_a":"Lay down dog","post_message":"Ann Coulter and Fox News take another step closer to flat out saying they don't want \"THOSE\" people to vote."},{"comment_id":"1259567494078669","commenter_b":"Just stop the CRYING,We didnt cry when Obama got in.Grow up!!","commenter_a":"Stupid is as stupid does.","post_message":"This just in..."},{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"10154463724150329","commenter_b":"@username because I don't keep people around who are ignorant and misogynistic pigs, such as yourself. Get a grip and show some fucking respect. Sitting in your parents house being a troll isn't gonna get you anywhere. Also, alot more women are feminists than you would think, @username.","commenter_a":"Wear whatever the fuck you want. Just dont expect everyone to compliment you.","post_message":"\"Bikinis just don't look nice on plus-size women.\""}]
