[{"comment_id":"1002435359842664","commenter_b":"One things for sure there's plenty to pray for. For those precious children, for their mothers who have been fed lies from hell's own lips, and for those who would advocate for such heinous things to go on. I guarantee you this girl has had a couple of abortions and they were oh so wonderfully sickeningly sweet to her- so that they can use her face and influence. Makes me sick. Yes, she is responsible for her sins, but she's just a rebellious, gullible kid that several of these snakes have sunk their fangs into. Just like Brittany Spears before her- and Raven Symone.","commenter_a":"My heart went out to her when she started turning crazy. She's in the throes of rebellion, but I think it came because some of the snakes of Hollywood influenced her. She's rebelling against her dad, and the way he's tried to raise her, like many of the child actors and performers before her. The kid used to want to be a missionary and help save lives. Now she wants to be a champion for killing. I will still pray for her. God's arm is not short.","post_message":"\"I'm a good person to put on the face of a T-shirt.\""},{"comment_id":"857951050917630","commenter_b":"She needs to be beaten and slammed on the floor, I VOLUNTEER TO DO IT !!!!","commenter_a":"Linda that's not meth,bad acne","post_message":"A 26-year-old mom is accused of beating her son and slamming their 1-month-old puppy against the floor, because she did not want to clean up after the pet: @webpagelink"},{"comment_id":"10153022619096523","commenter_b":"She's white who cares... Get over it lady!!!","commenter_a":"This is so sad","post_message":"\"She told me not to blow her cover about the fact that she had this secret life or alternate identity. She told not to tell anybody about Montana or her family over there. She said she was starting a new life.\""},{"comment_id":"324603137933515","commenter_b":"@username have her livein your house ! Problem solved ..","commenter_a":"She can come but her parents need to stay and fight for their country","post_message":""},{"comment_id":"10154128572736378","commenter_b":"Shouldn't they have to go back home before mommy and daddy lock the basement door","commenter_a":"Wonder if they voted?","post_message":"#BREAKING - Hundreds of protesters are marching through Center City, Philadelphia tonight, near City Hall. They are unhappy with Donald Trump's election. Many of these protesters are local college students, others say they are supporters of former democratic presidential candidate Bernie Sanders. @webpagelink"},{"comment_id":"10152708692641051","commenter_b":"Dumb girls, they were warned and went anyway.","commenter_a":"Earlier articles said they ran away to join ISIS's cause, they went , now they have to deal with their decision. Sorry, I have very little empathy for them. They basically told their parents, their government and God to go ___ themselves.","post_message":"These parents begged their daughters not to go. They went anyway."},{"comment_id":"804935616266161","commenter_b":"will the ACLU take up a case for violation of free speech?","commenter_a":"Floridians voted for him. Too bad the smart ones got him too.","post_message":"Governor Rick Scott is committing political malpractice. Parts of Miami Beach are already sinking into the rising ocean. Read more here: @webpagelink Image by Occupy Democrats."}]
