[{"comment_id":"1322047887828041","commenter_b":"seriously these 2 girls acting like trash why would you act like that in front of your kids??","commenter_a":"Eddie Fregoso @username lol","post_message":"BRAWL AT CHUCK E. CHEESE: A huge fight broke out among parents at a Chuck E. Cheese. This scene went on for about 10 minutes until officers finally arrived to break it up. VIDEO: Philip D. MORE: @webpagelink"},{"comment_id":"10153268969721336","commenter_b":"How stupid r parents...it is not that hard to put this on a tall shelf...what a bunch of dumbasses...","commenter_a":"Survival of the fittest.","post_message":"This year, U.S. poison centers have already logged an average of 31 exposures to laundry pods per day."},{"comment_id":"10154042885608352","commenter_b":"N BITCH U HELLA UGLY..LOL.LOL.N GET UR HAIR FLAT IRON POOFY HEAD HOE!!YEA U A DIRTY HOUSE HOE,YEA U CAN STAY MAD,WAY N ALABAMA. TALKING SHIT..YEA U WOULD...","commenter_a":"SHE TALK ALL THAT. SHIT,N SHE A PUNK ASS HOE!!!MAKE US WOMEN. LOOK. BAD N US WIFE'S....DUMB ASS!!","post_message":"Mo'Nique Defends Letting Her Husband Have A Side Chick! Says 'That's When The Relationship Is Real'"},{"comment_id":"10152547170886636","commenter_b":"@username. ..rode hard...and put away wet..too bad she didn't stay away wet","commenter_a":"This is a stupid law. If it gets passed. For the reasons you idiot liberals think. It is only a crime if you are wearing it in the commission of a crime. Think about that for a moment. If they charge you with a felony. They will add on a misdemeanor for wearing a hoodie. And then run it all together. So basically it's a nothing law","post_message":"Wearing your hoodie in public could soon be illegal in the state of Oklahoma"},{"comment_id":"1130006897113975","commenter_b":"Get out of America then","commenter_a":"It is a sad day in America. One of the most disgusting men in in our country won the election. I am so sickened by the citizens who would cast their vote for such an evil man. Do they really feel he is person to speak for us as a nation. I find him so repulsive by his words and actions.","post_message":"THESE 23 HOLLYWOOD IDIOTS PROMISED TO MOVE IF TRUMP WINS..... LET'S HOLD THEM TO IT"},{"comment_id":"1276041149107332","commenter_b":"Just another moronic Hollywood actress.","commenter_a":"Idiot no but of Obama and kilary have their way then you need to worry cause people like me want save you from the Muslims you help let in our country","post_message":"SARAH JESSICA PARKER FEARS She'll Be Attacked And Killed If Trump Is Elected…LOL! Has She Not Seen MULTIPLE TRUMP Supporters Who've Been Bloodied By Hillary's Lib Mobs? [VIDEO]"},{"comment_id":"927319353970153","commenter_b":"Who cares about whatever Sarah has to say....she's a nobody. Good grief !!","commenter_a":"BO doesn't care he's in office as a fraud perpetuating and feeding the muslime brotherhood on our dime","post_message":"HA HA!"}]
