[{"comment_id":"10154307782959205","commenter_b":"ummm i dont think thats the chant they should be using.. wrong march","commenter_a":"Choppy feed. :/","post_message":""},{"comment_id":"994006457321423","commenter_b":"She should be drinking it!!","commenter_a":"What are the long term effects on the citizens of Flint Michigan.... Thanks Cher for showing your humanity","post_message":"Cher is doing her part to help out the people of Flint as they continue to deal with city’s water crisis. More than 180,000 bottles of water are being shipped to Flint courtesy of Cher and water company Icelandic Glacial, which pledged to double her donation. DETAILS ----> @webpagelink"},{"comment_id":"10154451446444614","commenter_b":"Good that is what she gets. She is a cruel person","commenter_a":"She needs to be criminally charged and have to register as a sex offender.","post_message":"Dani Mathers has been banned from all LA Fitness gyms after she took a photo of a woman inside a locker room and posted it on social media with disparaging comments about her body."},{"comment_id":"1081910365238548","commenter_b":"Your moms twat","commenter_a":"Donald Trump is a maggot-ridden crapsplatter from a syphillitic pink-assed baboon.","post_message":"Trump's new ad is directed at... a) George Lucas b) Princess Leia c) President Obama"},{"comment_id":"10157214530105615","commenter_b":"Now if Rupert Murdoch could just croak and leave us all alone, particularly National Geographic...","commenter_a":"40 million to leave?","post_message":"BREAKING – Maybe now Americans can have their country back... Best thing to happen to America in years!"},{"comment_id":"10154304263504203","commenter_b":"Haha crooked Dems are feeling the Bern, bet rigging the system doesn't seem to nice now does it DWS? Trump is going to destroy Crooked Hillary in November","commenter_a":"Dear Bernie.....GET OUT.","post_message":"Berning bridges."},{"comment_id":"1726500120946412","commenter_b":"I'm not really sure why anyone would vote for that scandal ridden woman, but hey you got this little buddy.","commenter_a":"I did vote for U.S. Senator Bernie Sanders to win, but I not upset that my choice did not win, no, I let Democracy decide on that, and I am proud to vote for Hillary as our first female president. Everyone Rock the Vote!","post_message":"So much for party unity."}]
