[{"comment_id":"965394473500060","commenter_b":"That's what happens when unqualified people get put in jobs, for fear of hurting someone's feelings!!!!!","commenter_a":"THIS WAS PLANNED , THIS IS HOW NEGRO'S GET RICH !!! I HAVE SAID THIS MANY TIMES BEFORE !!! DUMMY'S","post_message":"A New York City firefighter who was allowed to graduate from the New York City Fire Department (FDNY) training academy despite failing physical fitness tests is now on medical leave after less than two weeks on the job."},{"comment_id":"1766049700310185","commenter_b":"She better look deeply into Muslim beliefs and get used to sexual assaults because these heathens think it's their right","commenter_a":"The White House is warning Trump not to retaliate against her. Is that a red line? They going to write a mean letter to him if he does?","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."},{"comment_id":"10153933865898984","commenter_b":"Send her ass to cuba","commenter_a":"The mother was a moderate Muslim who supports what the extremists do. She may not participate in the killing, and so on, but she helps from the sidelines. Deport.","post_message":"This just adds to the mystery of the San Bernardino shooting. This is absolutely huge and it means that there's A LOT more to the story than we know... Share this with everyone. We need to get this out there."},{"comment_id":"1591225437848101","commenter_b":"You can leave too lady.","commenter_a":"This is totally wrong you don't disrespect the flag our the National Anthem . Good they would never play another down","post_message":"High-school football players in New Jersey, Alabama and Massachusetts, replicating Colin Kaepernick's protest, are facing suspension from school."},{"comment_id":"1765463453479427","commenter_b":"Tell that to these women. @webpagelink","commenter_a":"Hey! if their good their good why not if that's what they want to do! and pass all the ground's for being able to handle it!","post_message":""},{"comment_id":"1015033255223089","commenter_b":"Tariq doesn't represent the real moderate Islam at all! I am Muslim and I do advocate humans rights no matter what sexuality, religion or colour they are","commenter_a":"I dont like ISIS but they did a very good job by killing the gay... Same sex is not permitted in any Heavenly Religion","post_message":"Blindfolded, bound and brutally murdered"},{"comment_id":"10153100567617464","commenter_b":"get rid of her","commenter_a":"She's bad news , she's dangerous to the good people of America!!","post_message":"Read and SHARE my new op-ed: Republicans must oppose Loretta Lynch — or lose all credibility on lawlessness: @webpagelink #StopLorettaLynch"}]
