[{"comment_id":"569159163208677","commenter_b":"Ohhhh....the irony. An 'upgraded' fence around the WhiteHouse to keep 'intruders' (i.e., we the legal citizens of the U.S.) out, but Obama and Hitlery refuse to support fencing our borders to keep illegals out. SMH","commenter_a":"Voting Trump a real American","post_message":"President Obama just unveiled the new White House fence and a lot of people are upset. This new design feature has Americans demanding it be torn down."},{"comment_id":"1750894945158794","commenter_b":"@username I'd rather be nationalistic than a back stabbing, gutless, two faced, squirming, sissified nonce!!!!","commenter_a":"If you don't support the country you live in, feel free to move to the country you support. Scumbags!","post_message":"WATCH: A police officer takes an American flag away from a protester who was trying to burn it outside the GOP Convention in Cleveland."},{"comment_id":"10154650140738984","commenter_b":"Lol Thomas.. I always look for that very same sticker.","commenter_a":"They could have lost their job after they bought the car. That also could be their groceries for the month. When I worked at Walmart I would see carts like that and see that a lot of people would buy their monthly groceries at one time. So if you broke the cart down into 4 it really wouldn't be that much.","post_message":"This man noticed a difference between his cart and one in front of him in line at the checkout. What he saw next is royally ticking off Americans everywhere."},{"comment_id":"10153514692996135","commenter_b":"No other president has lived on the \"people's money\" like obama has except maybe the clintons ! They have all had their homes before they got elected and actually used them for \"vacation\" time etc. among other things ! If I have to tell you you must have been asleep for the last 7 1/2 years !","commenter_a":"Pretty good sized house for making pocket change for 8 years. It is funny how all the poor people he was supposed to help are still living on the streets and in the slums of the city ! But the scum always rises to the top ! ! !","post_message":"Check out these photos."},{"comment_id":"623307227823727","commenter_b":"She should never be President,God help us if she does","commenter_a":"This whole thing just makes me ill!","post_message":"Crooked Hillary Clinton Lies vs. the FBI: A Tale of Two Press Conferences."},{"comment_id":"993863733987432","commenter_b":"Shut up Meg","commenter_a":"If only this call had been made in September 2001.","post_message":"That's probably not the kind of congratulatory phone call Netanyahu wanted."},{"comment_id":"10153051831985950","commenter_b":"WTF?! I would have knocked that bitch the fuck out if that were my child. And the so called DAD is a piece of SHIT too! They need to light her ass up in PRISON! >:(","commenter_a":"What?! I can't comprehend this... why,,,,","post_message":"Police say a stepmom bullied her now 15-year-old stepson: \"She asked me if I wanted to play the game,\" the boy said. \"And I said no. So then she called me 'punk,' so we did it. We went in the bathroom, she poured a whole bunch [of alcohol] on my butt and then she lit it on fire.\""}]
