[{"comment_id":"410085892484700","commenter_b":"Yes, look at Seattle. They're thriving. Lol WTF. Way to make a point against yourself. The two highest min wage cities are Seattle and San Francisco and they're also the top two fastest growing metropolitan areas in the country right now.","commenter_a":"If you think shit is expensive now, just wait when the minimum wage is 10 bucks an hour...Walmart is in favor of this because people will only be able to afford to shop at Walmart instead of the locally owned businesses","post_message":"Walmart's announcement that it will raise its minimum wage to $10 an hour was claimed as a victory by both advocates and opponents of raising the federal minimum wage."},{"comment_id":"10152952742422507","commenter_b":"I don't see how feeling guilty about things that happened hundreds of years ago has anything to do with what's happening now. Especially when it was perpetrated by not one person living today. It isn't about keeping people from coming here, as my grandparents are immigrants. It's about how they go about doing it. There is a right way and a wrong way. I see it everyday, the advantages people take of a broken system. If you choose to leave your blinders on to facts, that is your choice. Ignorance is bliss.","commenter_a":"WOW... it's been over half a millennia and this story has repeated all over the globe throughout history affecting all people everywhere at some point or another. This shit is pathetic to bring up.","post_message":"Turns out..."},{"comment_id":"10154967718641337","commenter_b":"Go fuck your self pussy","commenter_a":"Fuck him and his Walmart brand shit mustache, i'd stone cold stunner this redneck, put him in a coma and have Black Lives MAtter tattooed on his face. Only then i'd forgive this shitstain","post_message":"A stunning conclusion..."},{"comment_id":"1740459202903983","commenter_b":"SHE IS A FELT POINT SPOILED BITCH THAT HAS NEVER WORKED A DAY IN HER LIFE","commenter_a":"Having second and third generation entitled political hacks like Pelosi is what breeds assholes like Trump. In the end, Karma is a bitch. This country can do better.","post_message":"Nancy Pelosi blasted her Republican colleagues for not taking action on gun control, saying after every shooting there is a moment of silence, which means nothing without action. Pelosi states \"a moment of silence just left there is a moment of denial.\" Do you agree?"},{"comment_id":"1089012597882184","commenter_b":"ANTI AMERICAN ASSHOLES","commenter_a":"That's what jackass's do!","post_message":"ClashDaily.com"},{"comment_id":"10152794611951636","commenter_b":"It is just that!.we women have no say....we just get on with it!.","commenter_a":"Really?? A marketing campaign for icecream?? You don't know half of what happens .","post_message":"We’re not supposed to break the silence and secrecy surrounding women’s bleeding bodies..."},{"comment_id":"565051436999865","commenter_b":"Why don't these idiots get deported already? They come here illegally so they are criminals!","commenter_a":"Just bag em and ship back to Mexico","post_message":"Police in riot gear faced off against a violent crowd of protesters outside a Donald J. Trump campaign event in Albuquerque. @webpagelink"}]
