[{"comment_id":"10153281917270090","commenter_b":"And what does that have to do with what his stand on immigration has cost all tax payers!","commenter_a":"Illegal immigrants!","post_message":"All of the above! Choose Obama's #1 failure as president: @webpagelink"},{"comment_id":"895899747125716","commenter_b":"These child rapists are our allies?? No F-----G way!!!","commenter_a":"Please help this soldier who was trying to stop the rape of a boy!","post_message":"All of Congress should support this...."},{"comment_id":"683458785174693","commenter_b":"No Whoopie it's the exact OPPOSITE!!!! We did our homework on Corrupt Lying Criminal Killary Clinton and her open border policies and that's exactly why we voted TRUMP!!! Dumbass Racist!","commenter_a":"You didn't do yours.","post_message":"Whoopi Goldberg just scolded millions of Americans on The View. Apparently if you voted for Trump, it's because you \"didn't do your homework\" on Hillary."},{"comment_id":"1709971309289981","commenter_b":"How can you like these ignorant witches","commenter_a":"only reason l watch it, for Whoopee and Joy, still very good and stimulating\\\\","post_message":"The View just dug their own grave, FINALLY! Cancel this show now."},{"comment_id":"10153472925796336","commenter_b":"Oh, what a surprise, Jackie is an ignorant b*tch offering her uninformed, sexist opinion.","commenter_a":"Everyone is so concerned with making sure winny people feelings don't get hurt by legalizing gay marriage and taking down flags but the real important stuff like the murder of baby's everyday is last on their agenda.. ban abortion and all these little hoes will be forced to used condoms. . If you get raped, , i understand it's a sad thing but don't kill the baby. .the baby didn't ask for it. Have the baby then give it up for adoption. . But it's an innocent baby. . Stop committing murder. .","post_message":"“I’m saying there ought to be some humanity and respect for the dignity of a potential life.” – Megyn Kelly on last night's 'The Kelly File'"},{"comment_id":"10155229441268352","commenter_b":"She is a grown ass women","commenter_a":"For all j-lo haters y'all can go straight to hell she is in love","post_message":"Daaaayum! Drake and J-Lo are KILLING THE DANCE FLOOR… watch Drake GRIND ON J-Lo's FAMOUS BOOTY… then slow-dancing together like they about to go make babies!! (Video -- Super HOT!!) ----> @webpagelink"},{"comment_id":"10153904847648128","commenter_b":"100% true","commenter_a":"Miss Colombia says: happens for a reason. Now Steve Harvey, Miss Colombia, and Miss Philippines are more famous than if the crowning had been flub-free.","post_message":"This year's Miss Universe is Miss Philippines, Pia Alonzo Wurtzbach, but host Steve Harvey initially announced the runner-up, Miss Colombia, as the winner."}]
