[{"comment_id":"735565289967382","commenter_b":"Dear God, kick this ignorant African so hard he gets back to Africa. He needs English as a second language. Also needs to be taught to not make threats. What a POS. Go back to where you came from.","commenter_a":"This guy is a fanatic. He'd better be stop or someone s going to get Bharat namely, him","post_message":"Knife wielding Muslim attacks Trump, but watched what happens next. I bet he never expected this. Let's show him our support. Can we get 30,000 'LIKES' Donald Trump?"},{"comment_id":"10153765289899726","commenter_b":"Come to my house and more than their head will fly out the window. #semperfi","commenter_a":"Now, does Allah have 73 virgins for her too?","post_message":"Bomber's severed head 'flew out the window'"},{"comment_id":"1686879181550201","commenter_b":"It had to be a woman. Why couldn't have just come up with a $3 bill. Leave well enough alone.","commenter_a":"Of all the really great black statesman the US has ever produced, wonder why they didn't pick Frederick Douglas, MLK? Oh yeah, they were republicans and Douglas said any black that would vote democratic was an idiot. Of course people are so ignorant now I have read where people have stated the democrats drew up the legislation for the civil rights act, in reality passed by a republican congress with a reluctant Democrat, Johnson signing it. Ignorance abounds","post_message":"BREAKING: OBAMA SUCCESSFULLY WHITEWASHES AMERICAN HISTORY…”Racist” President Andrew Jackson To Be Replaced With Harriet Tubman On $20 Bill"},{"comment_id":"10153903118333690","commenter_b":"Israeisl go there with American pasports","commenter_a":"Donald Trump need to stop Americans going to Muslim Countries whether it,s visit or work","post_message":"US Republican front-runner Donald Trump wants to ban all Muslims from entering the United States. Elsewhere in the world, Tuesday marked the 50th anniversary of the Race Relations Act in the UK, which outlaws discrimination on the grounds of colour, race, ethnic or national origin. So, how has racism changed over time?"},{"comment_id":"1923125384575450","commenter_b":"All of them are nasty ass bitches","commenter_a":"These trump people are so ridiculous they would spin a shit sandwich Trump fed them by claiming it's full of protein because of the nutz in it","post_message":"LOL! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1596151633736175","commenter_b":"This is what happens when their is no understanding of the real threat. Neither Iran or North Korea pose as large a threat as Climate Change. Not belief, understanding.","commenter_a":"Climate change does not matter to me North Korea and Iran want to destroy us probably a more urgent matter?","post_message":"Twenty-one kids and climate scientist James Hansen sued the Obama administration to take more aggressive action on climate. As of Thursday, the climate-change-denying 45th president has inherited the case."},{"comment_id":"1304157179622515","commenter_b":"Is there any difference at all in Trump utilizing Twitter and Chinese Commie rulers using a a newspaper as their mouthpieces? What does China have that we don't have besides lots of bodies? The best thing they know how to produce is garbage.","commenter_a":"China, wallstreet, and our own government have been pissing down our collective backs for years, and telling us it's good for us because it's just rain.","post_message":"That's quite a bark, but do they have the bite to back it up?"}]
