[{"comment_id":"10153506474399342","commenter_b":"She's one of these \"innocent\" women that our cretin in the White House wants to allow in the US.","commenter_a":"What a mutt. I hope they shot her in that ugly face of hers.","post_message":"We're getting our first look at the female shooter in Wednesday's tragedy in #SanBerardino."},{"comment_id":"498469603689886","commenter_b":"This sissy should go into a latino hood, she won't be talking smack for long","commenter_a":"Get outta here.","post_message":"Check out the CRAP this clown is spewing. His 2nd statement really has peeps FUMING. Enjoy. ~ DG"},{"comment_id":"10154147763835329","commenter_b":"She wouldn't understand","commenter_a":"@username do it to Sydney","post_message":"how to know your sibling is on drugs"},{"comment_id":"10153236305609342","commenter_b":"You have a brown child, she can easily be in the same boat!","commenter_a":"Hopefully her family can let her rest in peace and find a new cash cow to milk..","post_message":"JUST IN -- The 11-page report released Friday corroborates findings detailed a day earlier by Waller County officials. Warning: Some details are graphic."},{"comment_id":"1275842862475459","commenter_b":"Might have to tell family to leave Italy and come here as refugees","commenter_a":"You don't have to be a genius to see that's happening now. Send them all to the middle east","post_message":"EU admit immigration will destroy European values"},{"comment_id":"736942216449300","commenter_b":"The most logical way to deal with the Real ID Act is to stop rewarding illegal activities. The people that make it possible for illegals to get driver's license are the same people who refuse to correct the laws that allow career criminals to run the streets killing cops and our children.","commenter_a":"How about we stop issuing drivers licenses to people that have broken the law and are here illegally? Blaming the current governor for this is absolute stupidity. Blame Richardson and the democrats in Santa Fe, this is all on them!","post_message":"The most logical way to comply with the REAL ID law is for the Governor to agree to a bipartisan plan for a two-tier driver’s license in New Mexico. Republicans and Democrats in the state Senate crafted a compromise last session that would have resolved this issue. The Governor should agree to that compromise. This will address concerns about public safety, meet the requirements of the REAL ID law, and assure that New Mexicans can continue to access federal facilities and airports. @webpagelink"},{"comment_id":"10154514379914657","commenter_b":"And your answer is to just try to talk them out of killing us Nancy. \"Maybe if we're just nice to them, they won't hate us\". Coward","commenter_a":"Stirring up more hate,the Republican way. Your answer to everything is violence.I have never heard so much vile hate in my life. You are horrible human beings.","post_message":"UPDATE: A Paris prosecutor has also confirmed the passport that was found."}]
