[{"comment_id":"10153180295086051","commenter_b":"shes a smooth talking criminal, i'll give her that","commenter_a":"I very much hope so. The \"scandal\" the regressive party is touting is an expression of the kind of fear they have of her. I absolutely want Hillary to be the next President of the United States.","post_message":"Here's what Hillary Clinton had to say about her State Department e-mail scandal. Simple question: Do you think she'll be the next President of the United States?"},{"comment_id":"1067324623308009","commenter_b":"Why should anyone get special benefits for being married?","commenter_a":"I am for the government getting out of the marriage business","post_message":"While we celebrated the right of same-sex marriage finally being nationally recognized, Republicans began to lose their minds."},{"comment_id":"10153404952670399","commenter_b":"Women see him and spontaneously abort.","commenter_a":"Cherry picking keeps religion alive.","post_message":"Way, way too much information."},{"comment_id":"465989180258329","commenter_b":"HELL NO FUCK THAT BITCH","commenter_a":"I wouldn't take them if they were free.","post_message":"Will You Refuse To Buy These Stamps?! Comment 'yes' or 'no'."},{"comment_id":"10154880820226178","commenter_b":"What a shameless woman. You are heartless.","commenter_a":"Kelly A Dee","post_message":"LOL. Martha Raddatz can barely keep it together!"},{"comment_id":"922136247820460","commenter_b":"Keep drinking the kool-aid lady!","commenter_a":"I think you are clueless dude. The \"obstructionist party\" is obstructing because they have listened to their fellow supporters of we the people! I don't want more and higher taxes! I don't want more illegals here illegally! I don't want Obamacare! I don't want a gigantic government telling me when, where, why and how to blow my nose! I don't want them taking away my guns! I don't want them (Democrats - now the Socialists/Communists of America) allowing Bengazi, fast and furious, and Ferguson protests to happen. I don't want Obama \"using his pen and paper\" Anymore! ILLEGALLY! WITHOUT CONGRESS!","post_message":"Back home in Indiana after a late night. The Senate held its 25th amendment roll call vote of 2015 late yesterday, already more than all of 2014."},{"comment_id":"10154083070804160","commenter_b":"Go to Hell","commenter_a":"Won't this trump puppet go jump off a cliff already","post_message":"\"Bow down.\""}]
