[{"comment_id":"1049399221792530","commenter_b":"A Hillary supporter should be asking themselves why they want a killer in office.","commenter_a":"A Trump supporter should be asking themselves why Putin would be interested in Trump winning the generals. Makes you wonder about where you stand.","post_message":"Donald Trump’s call for Russia to hack America makes this election an easy choice. ►Full Episode: @webpagelink"},{"comment_id":"1005026196219449","commenter_b":"Demon dog born of a jackle, shut your butt hole","commenter_a":"He didnt do nuffin...he was just minded his own biz..like they all do..blame the whites in America. .tell me one state thats mostly black..that dont have a high crime rate?..then tell me how its whites fault...anddd go!","post_message":"Authorities in Austin, Texas have identified the Black, unarmed teenager who was fatally shot by police Monday morning. Initial reports didn’t name 17-year-old David Joseph or his age, but what has been revealed is that he was naked at the time of the shooting. Geoffrey Freeman, a sergeant with Austin police, and other officers were responding to a call at an apartment complex. Although details are scant, Freeman arrived on the scene and apparently opened fire. MORE ---> @webpagelink"},{"comment_id":"10152874752876336","commenter_b":"Don't let her have kids exterminate this animal.","commenter_a":"Shoot on sight!","post_message":"Manhunt underway: Police are searching for Hayat Boumeddiene, a suspect in Thursday's murder of a French police officer. Tune in to Fox News Channel for special coverage now."},{"comment_id":"10153155550251051","commenter_b":"Oh Erika bitch still has vagina","commenter_a":"HUGE.....SORRY ISRAEL...OUR PRESIDENT IS SETTING US UP FOR WAR....SORRY HES SUCH AN EVIL P.O.S....an i for one stand with my people an Israel....suk it obama....rot!!!!!","post_message":"Israel came out and called President Obama's nuclear deal with Iran a big mistake. Here's how they're going to respond to it. Do you agree or disagree with the idea that the Iran deal is a mistake?"},{"comment_id":"1367609406650925","commenter_b":"Lets stomp out evil everywhere.","commenter_a":"It will be good to have a true American running the government again.","post_message":"This is definitely the most Trump-tastic resolution that Donald J. Trump could have made..."},{"comment_id":"1557909130909006","commenter_b":"Go watch FOX bitch...","commenter_a":"Because guns cure racism and misogyny. Vice you are officially the retarded wing of journalism.","post_message":"What radical black womanist politics organized around self-defense actually looks like, and why it matters."},{"comment_id":"10153044064759456","commenter_b":"That is exactly the thought that went through my head!","commenter_a":"Yet this A**hole gets a $500,000 bond.....whew this judicial system!","post_message":"A Montgomery man is being held on a $1.25 million bond after being arrested for allegedly trafficking methamphetamine. @webpagelink"}]
