[{"comment_id":"1270203316353471","commenter_b":"she cant and is a skank","commenter_a":"Say what you want about Miley--those pipes of hers are GOLD. period. And, she's been a sole advocate of LGBT and homeless rights. She's young and finding her voice but good for her for wading into the advocacy pool! Applause!!","post_message":"She may be an attention seeking diva with a voice like nails on a chalkboard, but she's also a politically active advocate for women's rights who despises Donald Trump."},{"comment_id":"1019874124772308","commenter_b":"Not just Islam but all religions. Ban religions not humans","commenter_a":"Yes it is, and we need to remember what the Spanish Catholics did to the Native Americans, and what the \"Christian\" Protestands did to the \"Christian\" Quakers. Religion is not the issue here. It's hostility.","post_message":"Trump supporters should remember our OWN history before they foolishly suggest we should ban all Muslims from entering the country. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"995560767160480","commenter_b":"Why should he not? The more knowledegable of us that bother to read and comprehend what we read knows full well obummer's allegiance is with his muslim homeland.","commenter_a":"The tyranny in this country almost makes everyone speechless Wake up America Hillary is just an extension of Obama policies","post_message":"Not only did this Syrian immigrant cheer 9/11, in April 2013 she told me to \"go fuc k yourself\" after I called the Boston bombing jihad. This is who Obama assigns to keep us safe. Who is going to keep us safe from this savage?"},{"comment_id":"10154232902826600","commenter_b":"It's called hustle lady! Wtf? No it's called dirt bag thief. It's not hustle it's theft. What a douch.","commenter_a":"Just don't understand why people think it's ok to take things that don't belong to them...no freakin' values or morals.. Disgusting!","post_message":"She was taken into custody without incident after being found through social media tips and “old fashion police work.”"},{"comment_id":"1231549493587943","commenter_b":"Hang her in the public square!","commenter_a":"We need term limits.","post_message":"Liberalism is a MENTAL disorder. Look what the Liberal tinkerpots are seeking to tear down now. BTW, nice glasses Babs!"},{"comment_id":"1241740062517749","commenter_b":"Keep Hillary & Bernie OUT OF MY STATE!","commenter_a":"Sauce","post_message":"Donald Trump speaking in Denver at Western Conservative Summit"},{"comment_id":"1211339922259660","commenter_b":"Love it!!","commenter_a":"Next Congress will be investigating the rape charges against Trump..............right? No? How about the fact that he doesn't pay income taxes.......? How about his dealings with China? No! Wait a minute, this sounds like another witch hunt, fact finding repeat of all the other investigations that Congressional Republicans have tried to have brought against Clinton. I've never seen anything like it.","post_message":"\"You are hereby served.\" Rep. Jason Chaffetz served a subpoena demanding the FBI’s full investigative file on the Hillary Clinton email probe. @webpagelink"}]
