[{"comment_id":"10154299911443128","commenter_b":"40K Cubans today 100K Muslims yesterday.","commenter_a":"I'm sorry, but this old man is as stupid as they come if he really thinks we, as Americans, are buying this inflammatory rhetoric. Get real. Maybe he forgets how or just wants to go the way of his candidate down to LA LA land. Bon Voyage! ;-)","post_message":"Oil billionaire T. Boone Pickens, who endorsed presumptive GOP nominee Donald Trump, is planning to host a fundraising event for the pro-Trump super PAC next month."},{"comment_id":"10156397443350725","commenter_b":"Proud of my home state for going for Trump!!","commenter_a":"Trump is a chump. As soon as he gets out of the way we can get about having a serious candidate.","post_message":"Thank you SC! We will NOT let political correctness get in the way of keeping America SAFE! #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"401586413362986","commenter_b":"Cut off her welfare check!","commenter_a":"and they raised a boy? No wonder","post_message":"Michael Brown’s mother decided to show her true nature when she said this..."},{"comment_id":"1218923861503062","commenter_b":"I wonder if this woman realizes what a joke she is. Department of Justice my butt. She has ruined any respect she may have had from the American people. What she may not realize is the Clinton's would leave her holding the bag if it covered their tracks!","commenter_a":"We don't need Attorney Generals that don't represent WeThePeople and the truth.","post_message":"Loretta Lynch, Attorney General can't seem to get her story straight about Hillary Clinton. This is what it looks like when your career crumbles right in front of you. Let's get 2,000 SHARES to show that we don't need CROOKS in office!"},{"comment_id":"10154390282749411","commenter_b":"Yeah, only to let them in later since we have open borders with yhem","commenter_a":"@username Lessa Katherine but sure.. let them into europe haha","post_message":"'This is my sincere thought'"},{"comment_id":"10154082768681130","commenter_b":"The popular vote doesn't determine the presidency.","commenter_a":"She should have picked Bernie and that way all his voters would have voted for them","post_message":"Meet Hillary Clinton's running mate: Sen. Tim Kaine of Virginia."},{"comment_id":"1247598538653217","commenter_b":"Cheap wages and NO regulations. So tell us, what's unreasonable? Are the international businesses really hurting that bad? Oh, right, it's the \"shareholders\" that are burdened","commenter_a":"Government caused the exodus of manufacturing. 35% corporate tax, EPA regulations, inflated wages, high energy costs. Don't let government fix anything. All they do is break things.","post_message":"Too many working families in the Midwest have been left behind because of the outsourcing of American jobs. I led a letter with Rep. Debbie Dingell and 24 other colleagues to urge Congressional Leadership to expand opportunities in manufacturing communities harmed by outsourcing. It is critical Congress takes immediate action to jumpstart the economic prosperity of our communities."}]
