[{"comment_id":"10153259534778145","commenter_b":"Hehe","commenter_a":"Happiest place on earth!!!!!!","post_message":"EPCOT BRAWL: Looks like these Disney guests weren't exactly having a blast at the happiest place on Earth. Three women were recorded having a full-fledged fistfight while waiting in line at the Test Track at Epcot. Watch the full video: @webpagelink"},{"comment_id":"1795597093801212","commenter_b":"But Hillary won the popular vote..at least you won something","commenter_a":"Hopefully they get deported","post_message":"BREAKING: A massive protest of President-Elect Donald Trump is happening in downtown Chicago. It started outside the Trump Tower and is growing @webpagelink"},{"comment_id":"857261721036748","commenter_b":"He is a terrible president regardless of anything else.","commenter_a":"I'm sick of this crap!...He's a great President..Who cares what religion he is?","post_message":"Scott Walker says he doesn't know if President Obama is a Christian."},{"comment_id":"10153657767106051","commenter_b":"OMG... A bunch of women who can't stfu!","commenter_a":"This isn't a political website Lorretta so move on.","post_message":"Olivia Newton-John's ex vanished on a fishing trip 10 years ago. Now, more than a decade later, we finally know what happened to him."},{"comment_id":"10155357191987439","commenter_b":"No thanks in representing the USA. Just another Linda Sarsour.","commenter_a":"Pretty sure this was found to be another muslim playing the victim","post_message":"Muhammad, a lifelong American citizen, claimed in an interview last week that she was detained \"just a few weeks ago\" by U.S. Customs and Border Protection agents. She said she was held for two hours without explanation."},{"comment_id":"1628196954146655","commenter_b":"It is in the constitution !!!!","commenter_a":"Yes","post_message":"POLL: Do you support the 2nd Amendment? Comment YES or NO."},{"comment_id":"10153042394211800","commenter_b":"Actually, the comedy part means the extreme feminists are being mocked...","commenter_a":"Gotta say I was very disappointed in this whole segment. Not because it was offensive or anything, but because it seemed to take what is clearly an issue (people taking up too much space on the subway) that can be caused by *both genders* (not just men) and acted like men were silly for thinking the ads were sexist by only targeting men. How much outrage would there be if there were a series of ads specifically targeting women for doing something that both men and women could do? Food for thought.","post_message":"\"Occupying all the territory you can is sexy. When I'm on a subway car with all those men taking charge of the seats around them, I get so weak in the knees that I can barely stand. But I have to.\" -- Kristen Schaal ► Kristen Schaal defends the right for men to spread their legs and take up two seats on the subway: @webpagelink"}]
