[{"comment_id":"10156809440295725","commenter_b":"Time to get tough with these vermin muzzies. We need to kill them before they kill us. Wake up, America, this is not CandyLand anymore.","commenter_a":"It is time! We have been too relaxed on this matter for too long. It is not that we do not love and welcome diversity and other nationalities and cultures into the amazing USA; however, we must have order and we must have processes in place to be proactive rather than reactive about our safety. We must take care of the people in our country first and then use the wealth that those resources will bring to help others throughout. My mother always said, if you cannot take care of yourself first, you cannot take care of anyone else and that simple advice applies here greatly.","post_message":"As president- I would be very, very tough on the borders, and I would NOT be allowing certain people to come into this country without absolute perfect documentation!"},{"comment_id":"10153744028791178","commenter_b":"WHAT!!!! She's the one that should b in jail","commenter_a":"She needs to go to jail.","post_message":"I'm not sure you can send people to jail for this..."},{"comment_id":"10155204940516337","commenter_b":"Well, those compys had gotten away before the story even started.","commenter_a":"I prefer the way the book ended.","post_message":"THE ORIGINAL ENDING of Jurassic Park might blow your mind..."},{"comment_id":"10153856032800329","commenter_b":"Yea I agree. They should of had variety of women. Not all overweight women have round faces. Chubby face yes. They are all pretty but some of those cuts I wouldn't do on most women, regardless of their size.","commenter_a":"A round face shape doesn't mean you are over weight. And these cuts were not exactly flattering to these women. Ijs.","post_message":"Warning: this post will make you want to get your hair did asap."},{"comment_id":"10155981845940354","commenter_b":"Trump is a media whore. Anyone dumb enough to support him might as well give your vote to Hillary because that is what you asshats are doing NOTHING in Trump's history suggests he is a real conservative. He is just repeating what we say and making republicans look like clowns. His close friend Oprah Winfrey, the person who did more to get Obama elected than anyone else and endorsed by Trump to be vp is ecstatic.","commenter_a":"Hes right pc has got to go. I heard him this morning, if cnn would have allowed him to finish his sentence, he was referring to nose mouth obviously. Typical, cut them off and use it for a soundbite.","post_message":"\"I’ve had lots of men imply that I was unfit for decision-making because maybe I was having my period…\""},{"comment_id":"10153229988242293","commenter_b":"And who would that lady be? Certainly not this four times married adulterous who're?","commenter_a":"It takes lady to show the world what TRUE VALUES are; and how STAND UP in those VALUES ...!!","post_message":"Kim Davis entered the Carter County Detention Center under cover of night five days ago. She emerged to Survivor’s “Eye of the Tiger.”"},{"comment_id":"916726885042526","commenter_b":"Such a FOOL !!","commenter_a":"He must be hitting the bong again","post_message":"President Obama said he thinks he's been a pretty good president, and he could win if he ran again. What do you think? Read more at @webpagelink"}]
