[{"comment_id":"10153667196560090","commenter_b":"She should be in Jail period!!!","commenter_a":"No. Send her to Prison","post_message":"Keep Hillary Clinton out of the White House!"},{"comment_id":"1598147256865554","commenter_b":"She is such a pig , I can't stomach her !!!","commenter_a":"You sound \"Off Your Rocker\" !!! A lot of you are talking and showing signs that are vulgar and disgusting! My mother always said that a person shows their ignorance by what they say and do! Seems like a lot of ignorant women were there today!","post_message":"Remember when Michelle Obama said \"when they go low, we go high\"? Neither does Ashley Judd ===>"},{"comment_id":"898473566912365","commenter_b":"@Patty Royer, please do not breed. America already has enough mouth breathing inbred idiots and you, madame, and I use that in it's professional sense, Are their Queen.","commenter_a":"And the Republicans encourage this kind of person.","post_message":"No surprise at all. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1323274761102106","commenter_b":"Hillary is for WALL STREET, BIG BANKS and CORPORATE WELFARE!!!! Bernie was right!!! Don't let her steal our COUNTRY🇺🇸#NEVERHILLARY","commenter_a":"I think it's great that the majority of America is holding him accountable for being a sexual predator.","post_message":"Hillary Clinton is leading Donald J. Trump by 15 points in Virginia, up 8 points from two weeks ago."},{"comment_id":"10153237839494203","commenter_b":"Marxist Feminists are ugly and nasty.","commenter_a":"Would you describe a man as \"testy\", Daily Beast? Thought not.","post_message":" can spin her way out of this. She can explain her way out of this."},{"comment_id":"965089543550794","commenter_b":"Sounds like pure jealousy. Cal looks better than some women","commenter_a":"but why do they all have the need to look like hookers?","post_message":"She only realised she was transgender when she dressed up in hot pants and a wig for a joke"},{"comment_id":"10153490224540950","commenter_b":"Trump","commenter_a":"Who Cares Vote Trump","post_message":"Ted Cruz's wife was caught in the crossfire this week between her husband and Donald J. Trump. But she said she's \"not worried\" about Trump spilling the beans about her past. Take a peek:"}]
