[{"comment_id":"904311766324849","commenter_b":"How do dicks like this get rich?","commenter_a":"Wow, what a dick!","post_message":"All I can say is that this guy is a total douche. What's your response to this video?"},{"comment_id":"1414911755215699","commenter_b":"Stupid bitch","commenter_a":"Taylor Paton @username Barrett Paton @username Clint Paton So the house will always smell like a fuckin' bucket.","post_message":"No, you cannot eat the candle."},{"comment_id":"10155320618472668","commenter_b":"@username bigly, hum, never heard that word before. She is a hateful lady, period!","commenter_a":"I thought she was moving? Time to leave loser. It's time to take care of your own run-a-way and drug addicted children!!","post_message":"Following reports that President Trump was upset at seeing Sean Spicer impersonated by a woman on SNL, Rosie O’Donnell has stepped up with an offer to play Steve Bannon on the show."},{"comment_id":"10153737959512623","commenter_b":"Girl one lady is so about to make me go in lmbo","commenter_a":"It's not about air... They weren't even allowed to open the windows, there was no airflow, the kids came off drenched in sweat and crying.","post_message":"Some parents are upset with a local school system after they say their kids got off the bus \"drenched in sweat\" and crying. A school system spokesperson said some of the parents' claims were \"less than accurate.\""},{"comment_id":"10153780845375530","commenter_b":"You can look it up!","commenter_a":"Columbus is neither hero nor monster. Indigenous people were screwin' each other over long before Columbus arrived. Don't like Columbus Day? Don't celebrate it.","post_message":"It was not clear when exactly the statue was vandalized. Detroit police were still looking into the incident when contacted."},{"comment_id":"10154168585709726","commenter_b":"She will be worse and any of the others. Idiots","commenter_a":"Whoever gets the nomination could run a brilliant series of ads about Hillary's War on Women.","post_message":"Abortion rights group looks to spend big to secure Clinton victory in November."},{"comment_id":"10155879050540354","commenter_b":"Stop these muslims from coming into our country. Please. Trojan horse.","commenter_a":"I can't wait to force them to bake my gay wedding cake.","post_message":"Some truly shocking statistics in this article..."}]
