[{"comment_id":"10153333476251770","commenter_b":"My father is an immigrant from France, I lived 15 miles from the border of Mexico for ten years, I love the Mexican people and so does Trump, don't you see??? People who are in the legal process are being cut in line by illegals. Illegals ruin your wage rates, take your jobs, use our governments program resources. By shutting the border down deporting the illegals the Mexican Americans will get the wage they deserve! As acting, legal tax paying citizens!","commenter_a":"Because the legal Latinos want jobs. The illegal compete and lower the wage rate and that affects the legals ability to make a decent wage.","post_message":"Donald J. Trump beat out his Republican rivals in America's most Latin city Tuesday."},{"comment_id":"1322497724487878","commenter_b":"Lolololol congratulations trumplinas, you played yourself","commenter_a":"It's going to be just like the wall. Everyone will have insurance but you have it pay for it now and somehow we will be paid back later.","post_message":"He says all Americans will be \"beautifully covered.\""},{"comment_id":"10152602794417894","commenter_b":"smh bitch can do better","commenter_a":"I am totally okay with this. David Ramos @username","post_message":"Coupled Up? Rihanna Reportedly Spotted Making Out with Leonardo DiCaprio at the Playboy Mansion"},{"comment_id":"1110154855687296","commenter_b":"Knock that bitch out!","commenter_a":"@username @username let's fuck his shit up","post_message":"Would you do it? #WSHH"},{"comment_id":"10153410983047787","commenter_b":"@username, she is an idiot!","commenter_a":"You are an idiot. Climate change causes prostitution I have never heard such a stupid coment.","post_message":"Diversity is our nation’s greatest strength – our currency should reflect that. I’m so glad that the Treasury Department agrees! Which shero would you like to see on #TheNew10?"},{"comment_id":"593997884104848","commenter_b":"God help us all...God please Bless America! No Hillary!!!","commenter_a":".......President means MAN! .amen.","post_message":"Nancy Pelosi said confidently today that Hillary Clinton will be the next president of the United States. Do you hope she's right?"},{"comment_id":"1291488564240340","commenter_b":"Sorry but she is an unhinged dingbat.","commenter_a":"I'm concerned after reading today's Buzzfeed Report that the now well publicized 1986 letter by Coretta @username was not made a part of the Record then (in apparent subterfuge by Committee Chair Throm Thurmand ?). Now Sen. McConnell, by invoking Rule 19 may well have prevented the inclusion of this letter in the official record once again, in spite of the continued publicity it has received during the hearing. Our History is thus written by the \"Vicors\". Maybe it is still possible to insert that letter into the official Record of the Debates.","post_message":"I’m deeply disappointed that the Senate voted to confirm Jeff Sessions as Attorney General tonight. Deeply disappointed that the Senate confirmed an AG whose record does not show he will faithfully and fairly enforce the law. Thanks to you, everyone now knows the concerns that Coretta Scott King had about Jeff Sessions. Concerns that millions of people still have. There’s no Rule 19 to silence me from talking about Jeff Sessions anymore. So let me say loudly and clearly: This is just the beginning. If Jeff Sessions turns a blind eye while Donald Trump violates the Constitution or breaks the law, he'll hear from all of us. If Jeff Sessions makes even the tiniest attempt to bring his racism, sexism, and bigotry into the Justice Department, he'll hear from all of us. And you better believe every Senator who voted to put Jeff Sessions’s radical hatred into the Justice Department ..."}]
