[{"comment_id":"10156484375905354","commenter_b":"MmmmHmmm so should welfare bitch!","commenter_a":"Chicago thugs on welfare should be fedubded.","post_message":"\"One of our major demands is that police be defunded and that that money used to fund police be used to fund black futures....\""},{"comment_id":"481672038690043","commenter_b":"Muslims can all go to hell were they came from,they don't belong in this country","commenter_a":"Time for a million dog March, please don't clean up after your dog's at this March.","post_message":"Muslims are telling Americans what they can and cannot do. They have gone too far with this. We need to stop this madness now. Do you agree Muslim immigrants should abide by our laws?"},{"comment_id":"10152796011681130","commenter_b":"That's right. You. Cant Your not a football fan. Just some bitch with a uneducated opinion. Sad...","commenter_a":"So they should be disqualfied and the Colts should get in.","post_message":"So it wasn't just some weird conspiracy theory."},{"comment_id":"581422622060041","commenter_b":"Hahaha!! Funny!! \"Blacks are lazy\" \"Super Predators\" \"Heel\" -Hillary Clinton on blacks","commenter_a":"Make America dumb again is his slogan this guy caught on tape making fun of so many people she makes a mistake with emails an everyone losses their minds he's not for the people of different cultures he order his supporters to attack people an they did why are you voting for him that's the real ?","post_message":"With Medal of Honor recipients seated behind him, Donald J. Trump tells supporters: \"They're so much more brave than me. I wouldn't have done what they did. I'm brave in other ways ... I'm financially brave.\" @webpagelink"},{"comment_id":"1793905347490203","commenter_b":"Plus she is nasty and disgusting","commenter_a":"This young lady is very talented, but she has no clue what this country is all about. It happens when you grow up with the world revolving around you. She has no idea what she supports! Or Who!","post_message":"Miley Cyrus is begging people to vote for Hillary Clinton"},{"comment_id":"1227002650653096","commenter_b":"The LATIN EMPIRE AWAKENS! They realize that Republicans will get them into American class warfare!","commenter_a":"Latino Republicans? Does such an animal exist?","post_message":"Latino Republicans are mounting a pushback against the more conservative wing of their party."},{"comment_id":"1698523013768491","commenter_b":"Women making decisions over a man's body","commenter_a":"It's not for fucking cosmetic reasons. It's for hygiene and it prevent a large amount of penile infections.","post_message":"Y'all should probably still stop cutting baby's dicks for cosmetic reasons though."}]
