[{"comment_id":"10153512316881130","commenter_b":"Classy old gal she is....lmao","commenter_a":"I don't know about that if your kid is old enough to eat real food with a spoon its time to take them off the tit.","post_message":"\"There's no difference in me feeding my baby with my breast than you feeding yourself with a spoon.\""},{"comment_id":"1717305195178742","commenter_b":"@username Did you smoke crack before your post? Americans can be Asians. Using your logic, Latinos and Latinas can't be Americans either. And all blacks would be African. Also, those nations are far from being heterogeneous like ours.","commenter_a":"Yes Asian men are not portrayed in a very nice light especially in american media. however, I find many Asian men to be attractive. love the facial structures and there is nothing like a guy with a sword.","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"10155010773818812","commenter_b":"Cynthia lol ur such an idiot","commenter_a":"Crazy! The country is not in mourning it's thrilled!!!😃😃😃","post_message":"The first post-election \"Saturday Night Live\" didn't open with a sketch spoofing the presidential candidates, nor did it include Alec Baldwin's Donald Trump. Instead, it opened on a somber note."},{"comment_id":"1211339922259660","commenter_b":"Love it!!","commenter_a":"Next Congress will be investigating the rape charges against Trump..............right? No? How about the fact that he doesn't pay income taxes.......? How about his dealings with China? No! Wait a minute, this sounds like another witch hunt, fact finding repeat of all the other investigations that Congressional Republicans have tried to have brought against Clinton. I've never seen anything like it.","post_message":"\"You are hereby served.\" Rep. Jason Chaffetz served a subpoena demanding the FBI’s full investigative file on the Hillary Clinton email probe. @webpagelink"},{"comment_id":"10153238705381717","commenter_b":"Yes, well if you're a woman who's into men, that is how it should be. Is there any particular reason you're trying to pick a fight?","commenter_a":"What's next ppl marrying there pets!# Gross..one man and one woman period. DAMM GAYS","post_message":"In case you missed it:"},{"comment_id":"10154487721214062","commenter_b":"Only problem he has to rape to be a thug. Blacks just have to be born and they are considered thugs","commenter_a":"Lol KHOU just called someone a thug! 😂😂😂but seriously he needs to be caught.","post_message":"Please share to get this thug off the streets! He's a violent rapist who sexually assaulted two 16-year-old girls."},{"comment_id":"10152735928791680","commenter_b":"Of course. I know there is no way Hillary's home had anywhere near the \"Defense in depth\" that the government has. She decided to run her job from her less secure home. She brought it upon herself. ISPs and private servers are hackers easiest and most favorite targets, especially the traffic to and from. Take an IT course sometime. This info is taught at the basic level.","commenter_a":"Democrats can be mean brainwashed SOBs: @webpagelink","post_message":"Louisiana Gov. Bobby Jindal took his socially conservative message Thursday straight into the belly of the liberal beast: the New York Times’ opinion pages."}]
