[{"comment_id":"659146920942553","commenter_b":"Muslim terrorist","commenter_a":"YOU BET I AM!","post_message":"Members of ISIS are disguising themselves as refugees so that they can funnel into Europe. Terrorists have breached European borders, things are about to elevate. Are you worried Obama will let terrorists into our country?"},{"comment_id":"10154137219211323","commenter_b":"Except I don't know any bores.","commenter_a":"How the shallow half lives. My parties are made up of kinder people and we include bores, shy people and those who feel rubbish but know they will be treated with kindness and respect.","post_message":"“They don’t know they’re bores, so they’re happy.\""},{"comment_id":"1089399481081062","commenter_b":"Hahahaha","commenter_a":"Matthieu Sinclair","post_message":""},{"comment_id":"1411212282241061","commenter_b":"That's DIRECTED To YOU Mr Joe Biden. .oh my mistake. .mr. Joe bishop!","commenter_a":"Trump is still a fraud and will always be! Go Ted Cruz 2016!","post_message":"The #NeverTrump movement has been around longer than you'd expect."},{"comment_id":"638594622989083","commenter_b":"@username:: He is. Watched this afternoon & it was good!","commenter_a":"the credibility of cnn as a real news source has is no more....half of the hosts on msnbc are going after Hillary and not focusing on anything that trump does.... and we don't have to say anything about the fair and balanced fox.....it is just sad that trump is getting away with everything....he is the real criminal......but the press doesn't want anyone to know it...it would be bad for ratings.....","post_message":"We've warned them for months: keep pushing the double standard against Hillary and you'll lose all credibility."},{"comment_id":"10154164118946167","commenter_b":"Legal immigrants!","commenter_a":"There has got to be individual discretion involved in these cases. It's ridiculous. We are a nation of immigrants. We all come from an immigrant somewhere down the line!","post_message":"A Cambodian-American spoke out today about how inhumane Trump's immigration rhetoric is. This is an interview that a lot of people need to see."},{"comment_id":"10153232887939071","commenter_b":"@username she's a bad asss","commenter_a":"Zelal Tas","post_message":"The Canadian model who is fighting ISIS in Syria says the terrorists are all cowards."}]
