[{"comment_id":"571127086402504","commenter_b":"Come on guys, the woman is desperate and nervous. You will see very soon who will come out on top. It's time for some real change.","commenter_a":"Look like this page is also scrambling to save Hillary. It's good to know sanders is getting to her. #feelthebern","post_message":"Bernie and his campaign are misleading voters about what Hillary said."},{"comment_id":"371959982974642","commenter_b":"@username, Pelosi sucks!!!!!!!","commenter_a":"Teddy, you little Canadian anchor baby, it's time for you and me to have a little heart to heart talk. Firstly, let's face the facts. The people have spoken and it's Trumps year. Now there's two ways you can go here. You can fight tooth and nail to the bitter end. You'll lose and forever be seen as the jerk who tried to thwart the will of the people. Your political career will be over! Or, you can drop out and get behind Trump. You'll be seen as the man who helped to reunite the party and defeat Hillary Clinton. Play your cards right and you could set yourself up for a top position in the Trump administration. You're a young man Ted. After a successful 8 year Trump presidency, you could be in position to be the natural heir. Remember your hero, Ronald Reagen ran against Ford for the ...","post_message":"LETS MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153549578273984","commenter_b":"Kims a whore so who cares","commenter_a":"If killing people make me happy, should I go around and do it? No. I hate when people say, do what makes YOU happy. Hmm. That can apply to a lot of things which are wrong. We should do what makes the Lord happy.","post_message":"Look out, Kim Kardashian. I don't think you realize who you're messing with... Do you side with Megyn Kelly on this one?"},{"comment_id":"1240488536029680","commenter_b":"Would she use such foul mouth language if so she would be in the gutter with you","commenter_a":"And I really think she would of said \" you're the anti Christ you cunt\" that's what she would of said to hitlary Clinton","post_message":"The late, great Mother Teresa was just sainted, but what she said about Hillary before she died will come as a surprise to a LOT of people. Everyone in America needs to see what she said about Hillary before she died."},{"comment_id":"10153253284026756","commenter_b":"i like to read porn not watch it as much","commenter_a":"Meanwhile, people are praising a movie about a creepy, abusive man who likes to manipulate women into believing they want to be treated like emotional and sexual slaves.","post_message":"In which the vice president manages to invade all of our personal spaces, simultaneously."},{"comment_id":"690460261111351","commenter_b":"spelling lady...... come on now.","commenter_a":"I think I will get off here and work. Better than listening to his lioes","post_message":"Watch LIVE as President Obama speaks at a town hall at Fort Lee. Do you know someone taking part in the event?"},{"comment_id":"10154293209899153","commenter_b":"What do you mean what is happening...It's been going on for thousands of years....There are POS's everywhere","commenter_a":"What is happening too many men are raping these young children, ladies be careful who you have in your home , keep your eyes on your children at all times never leave them with anyone these days it could be your closest to molest these kids...","post_message":"Joseph Genitempo is accused of sexually assaulting an 11-year-old girl. Anyone who may know where he is located is asked to call the Delaware State Police."}]
