[{"comment_id":"10154491672598843","commenter_b":"Nice but ignorant..just because it looks nice doesn't mean it is. Well if we're going to have a March about saving babies, we must teach to save wome and men. Teach women knowlage of self worth not through sex to have standars. Teach men to stick around and train this child up. Their are far to many women who trust in the wrong Ideas about relationships and sex. A comunity of ignorance instead of in the scools teaching to waite and young girls to choose a good partner who is consistent. Also have father's taking responsibility instead of running off and leaving women to fend for themselves. Child support isn't always enforced, if she has no family, if she is in poverty look at where plan pearenthood is located in the getto where the poor is and if you think the CPS system isn't filled up over populated, better look ...","commenter_a":"However, they left behind lots of litter for someone else to clean up. How thoughtful.","post_message":""},{"comment_id":"1429289687105057","commenter_b":"I'm going to beat your ass why you do that to me sis lmao","commenter_a":"Omg sis imagine this! VVanesha Williams","post_message":"This is the incredible moment a mother gives birth to her baby son - in a groundbreaking delivery procedure."},{"comment_id":"10152704334291051","commenter_b":"Good! Take that piece of :poop: !","commenter_a":"GREAT JOB! (y) Hope the girlfriend is okay.","post_message":"A man walked in on his uncle trying to rape his girlfriend. This is what the uncle looked like after the nephew was done with him."},{"comment_id":"466299333581093","commenter_b":"You sound like a true liberal","commenter_a":"Philip Sjostrom","post_message":""},{"comment_id":"10156351239605093","commenter_b":"I just wish humans leave wild life alone.","commenter_a":"Signed ✔️","post_message":"Hanako lives alone in a barren, concrete enclosure without grass, trees, or a pool. Elephants are well-known for having complex social bonds, but it's unclear when Hanako has last seen another elephant."},{"comment_id":"1313680338710499","commenter_b":"Dam so the bitch anit leaving","commenter_a":"I thought she said she was leaving the United States and my subconscious was hoping it was for good Her support threw the election for Obama she's lost all credibility with me","post_message":"Oprah Winfrey just STUNNED her fans with this massive announcement about Donald Trump's victory. Nobody saw this coming..."},{"comment_id":"10153189013365736","commenter_b":"Please don't insult scum. Scum must be very embarrassed to be compared to HER!","commenter_a":"Of course she did it. Using that poor boys abduction to get her face on T.V. What an evil woman n","post_message":"Kyron Horman's stepmother Terri Horman gives People magazine an exclusive interview about the disappearance in June, 2010 of the 7-year-old."}]
