[{"comment_id":"10154100932456968","commenter_b":"Has Steve Bannon taken over the POTUS Twitter account?","commenter_a":"Suggest that Trump and co. start keeping their mouths shut and start listening to America.","post_message":"He also threatened federal funds to UC Berkeley."},{"comment_id":"10155501213150354","commenter_b":"New campaign slogan: A burrito in every pot and a hooker in every bed...Vote for Hillary","commenter_a":"Why not, Hillary has been a pro at f**king everybody.","post_message":"Bill Clinton hits the jackpot."},{"comment_id":"998442540272524","commenter_b":"She is bought and paid for and if she's president what happens then?","commenter_a":"She's a crook and lies about where money comes from and buys the illegal immigrants vote","post_message":"By the way, it ILLEGAL for foreign nations to influence the outcome of an election. Just so you know. @webpagelink"},{"comment_id":"10157069343155354","commenter_b":"@username that is exactly what I said she would be the second biggest mistake","commenter_a":"It is about time all realize all that comes out of his mouth are lies he has seven more months to tear our country apart I saw this before his first election do not make the same mistake twice to vote for Hillary she is a continuation of Obama and if she gets in the only way we can restore our fore fathers Constitution is through force I am a Veteran and will stand by the oath I took at enlistment to defend the Constitution against all enemies foreign or domestic so help me God do not screw with my country","post_message":"Obama is a global rock star no more..."},{"comment_id":"10153092364080779","commenter_b":"how about enforcing the laws.....dumb bitch.....","commenter_a":"If I hear gun control one more time... I couldn't feel worse for the families that lost loved ones today, but laws are NOT going to keep law abiding citizens safe from criminals, the mentally ill or those that intend on dying in a blaze of glory.","post_message":"Calling America's epidemic of gun violence \"a political choice we make\" and declaring of the nation's political class, \"we, collectively, are answerable to those families who lose their loved ones because of our inaction,\" President Barack Obama delivered one of the rawest speeches of his presidency today in response to the Umpqua Community College shooting rampage. Read it below."},{"comment_id":"10153573697440090","commenter_b":"If our next leader or liar was on that stage we are in trouble","commenter_a":"In your dreams!","post_message":"Take. It. Back. @webpagelink"},{"comment_id":"10152987199648645","commenter_b":"We are fed up with illegals and their anchor babies.","commenter_a":"What an idiot!! Those poor children! Obviously the program was already english hence the translator for the parents. Have some compassion and MANNERS!!!","post_message":"Witnesses at the Kindergarten concert said the man stood up as a Spanish translator began speaking and repeatedly shouted ! English only!"}]
