[{"comment_id":"10156411867420354","commenter_b":"@username , NO MORE REFUGEES !! I DO SAY NEVER FORGET WHAT THE islamoCRAPS AND obuma HAVE DONE TO AMERICA ! PROSECUTE obuma & killery FOR TREASON !! DONALD TRUMP/CRUZ 2016 ! AMERICA NEEDS PHOTO I.D. TO VOTE , IDENTIFICATION , FOOD STAMPS , ETC ! TERM LIMITS WITH NO BENEFITS ! DRUG TEST ALL FED. EMPLOYEES AND THOSE COLLECTING WELFARE ! ABOLISH ALL GUN FREE ZONES ! IF YOU AGREE PASS IT ON !","commenter_a":"Political correctness=Nazism","post_message":"When you see the so-called \"politically incorrect\" sign, you'll instantly understand why liberals' heads are exploding...and will want to buy a cupcake from these folks."},{"comment_id":"10153287530191336","commenter_b":"A woman who got it 100% correct.","commenter_a":"As women, we have ruined it for ourselves. We can't act like men and then expect a men to act chivalrous towards us. Be a lady, and you might be pleasantly surprised.","post_message":"Is chivalry dead?"},{"comment_id":"10153831550149474","commenter_b":"I don't believe my dog trust Hillary","commenter_a":"I remember she slapped her husband's face at the White House. Lol.","post_message":"Simple. Share if you agree."},{"comment_id":"867761519952633","commenter_b":"Illegals can get drivers licenses in NC.....no problemo! Dumb!","commenter_a":"Illegals can drive drunk but I can't. Now that's discrimination. Lol","post_message":"BREAKING: Leaked Document Reveals SICKENING Order Obama Just Issued To Border Agents President Barack Obama has issued a new order for the Border Patrol not to arrest drunk drivers because driving while impaired is not a federal crime. The notice, With Alcohol-Impaired Drivers, directed the 4,000 U.S. Border Agents in the Tucson... #arrest #borderpatrol #drunk @webpagelink"},{"comment_id":"840225226093860","commenter_b":"Science is proving the bible and religion is a load of rubbish...!","commenter_a":"The Bible is just a story book... Religion is a fable... looking for God is like going into a dark room and looking for a black cat that does not exist ! what religion does to people is brain wash them..","post_message":""},{"comment_id":"1217783301639772","commenter_b":"It's new- tella. Stfu","commenter_a":"Some people say nut-ell-uh and he's right. Nutella is absolutely nut-ell-uh. New-tell-uh is wrong.","post_message":"The right way to say 12 brand names you've been mispronouncing your whole life."},{"comment_id":"1761239377456582","commenter_b":"Why won't she just tell the story on camera instead of wasting all that paper? And why were they recording this in the bathroom? And why were two grown women laughing and taking pictures of her in the store? And why the hell didn't her mom beat the living hell out of them? So many damn questions. Wtf..","commenter_a":"People are getting DNA and hormones mixed up as if they are the same or even similar.","post_message":"Transgender teen shares powerful message on bullying: \"We're not a threat. We are just like any other kids. We only want people to accept and love us for who we are.\" @webpagelink"}]
