[{"comment_id":"10154180774646770","commenter_b":"We need to ban ALL muslims! That'd fix the problem!!","commenter_a":"And some of them are being trained at the age of five to behead their stuffed animals. They have posted it online. We need to be very, very careful as we do this vetting.","post_message":"Obama admitted very few Syrian Christian refugees, compared to thousands of Muslim refugees."},{"comment_id":"10154007252811770","commenter_b":"It's like they forget that these idiot elitists make up 1% of the population and those of us who are her \"deplorables\" pretty much loathe Miley, Gaga (she makes me gag), Madonna and the rest of her low class disgusting amoral favs. These truly deplorable people have the OPPOSITE effect on decent hard working people and especially those who love God.","commenter_a":"Bull. bull. bull. SHE'S THE QUEEN OF CORRUPTION!!!!!!How the libtards don't get this is beyond me???Nasty woman.","post_message":"It's a real wonder how Lady Gaga didn't win the election for Hillary"},{"comment_id":"10153603833598598","commenter_b":"Sick minded evil old women.","commenter_a":"One ignorant person!","post_message":"Nancy Pelosi: De-Funding Planned Parenthood Abortion Biz is “Taking Away Life-Saving Care”"},{"comment_id":"828705883906152","commenter_b":"Trump for me all the way! We can't have Hillary. Socialism whatever","commenter_a":"Donald Trump is what we need not another stupid politician. Wake up people stop being so bling of the BS from Hillary, Cruz, Rubio. Those candidates are a joke. We need America back agin the strong country that once was until Obama and now Hillary, please the woman is a liar and a joke. She gets away with everything. Wake. Up America Trump will bring this country back, AMEN!","post_message":"Positive change is not going to come from someone such as Donald J. Trump. He is running for the wrong reasons, nothing good comes out from him. @webpagelink"},{"comment_id":"10153645226755399","commenter_b":"Totally feeding ISIS everything they want. Playing right into their hands. What a naive jerk. ISIS loves Trump.","commenter_a":"Hum. ISIS launches attacks in order to provoke a backlash against Muslims in the West in order radicalize them. Trump follows the ISIS playbook perfectly calling for an entire raft of outlandish actions against Muslims in America: ISIS Mission Accomplished. Donald Trump: ISIS Agent #1","post_message":"The GOP presidential frontrunner just went there."},{"comment_id":"10152759006876943","commenter_b":"At least they aren't cheap whores.","commenter_a":"We have the best government money can buy!!","post_message":"\"That resulted in a second lawsuit last fall, this one in D.C. Superior Court, in which Judicial Watch attorneys argued that city health officials fraudulently authorized Congress to buy plans through the small-business site...\""},{"comment_id":"1027684670588211","commenter_b":"Sadly it's true though. The American education system is poor and it's not the citizen's fault.","commenter_a":"Who did this survey? You just want to make fun of Americans and make others feel superior. By the way, your Grand Canyon photo is too dark, poorly done.","post_message":"Do you know where these major national landmarks are?@webpagelink"}]
