[{"comment_id":"10153947557669753","commenter_b":"Police and your government bosses, STOP PREYING ON BLACK PEOPLE LIKE HUNTING WILD GAME AND SHOOTING US TO KILL!!!","commenter_a":"She is crying a hell of a lot more now that she is being interviewed than when sitting next to a dying man with her child in a car... Still say something fishy about the whole situation","post_message":"Police scanner recordings obtained by a local Minneapolis news station reveals that St. Anthony police officers pulled over Philando Castile not because of a busted tail light but because he looked similar to a robbery suspect due to his “wide nose.” The startling dispatch recording indicates that not only was Castile seemingly racially profiled for his “wide nose”, his girlfriend says that officers lied when they claimed the stop was for a tail light that was out as the tail light was seen... @webpagelink"},{"comment_id":"659276420929603","commenter_b":"I guess she could go back to Africa Ebola does that ring a bell","commenter_a":"Dam she's got lips like monkey boy.I bet she could suck the crome off a trailer hitch.","post_message":"This entitled woman just demanded a free drink... Because of slavery? This is absolutely ridiculous. We owe her nothing. Should she be compensated for slavery?"},{"comment_id":"10153675023971409","commenter_b":"First of all .... what is she doing out of the kitchen ? She should be making sandwiches ..not pizzas","commenter_a":"Good that's life","post_message":"Jensen isn't sure yet if she'll take any official legal action, but she still wants to fully understand why she wasn't given equal pay."},{"comment_id":"10154248071539714","commenter_b":"@username seriously what does being white have to do with anything.","commenter_a":"Isn't that discrimination? I mean I don't care. It could be a good thing. But with all the political pc going around. This is discrimination compared to what liberals say","post_message":"A former Uber driver and his wife are launching an alternative car service for female passengers only. (via Good Morning America)"},{"comment_id":"900572216669194","commenter_b":"This breed should be wipe off the earth surface","commenter_a":"But pitbulls are harmless.","post_message":"Moment dog savaged ice-bucket challenge woman"},{"comment_id":"10156270295245354","commenter_b":"Illegals voting in California this should give the liberals some help. GO Trump !!!","commenter_a":"They focus on Gun Control, in the Debate, they will lose the Election","post_message":"Here's what's on deck for tonight's Democrat presidential debate..."},{"comment_id":"10153875712703128","commenter_b":"Natalie Grace","commenter_a":"my iphone 6s lpus battey has not died on me. it has lasted me all day every day. they increased the battery life so if people are having problems then thats off","post_message":"With its entry into the battery case market, Apple finally admits that heavy iPhone users could use more juice. Its solution also fixes many of the issues present with third-party cases."}]
