[{"comment_id":"10153899191016770","commenter_b":"another nasty women I guess..","commenter_a":"Real smart people those LDS folks, sarc. Seriously,when the Supreme Court turns liberal full progressive, your little LDS church will be doing homosexual marriages, allowing non Christians to come to your places of worship, oh, I can't imagine the world of hurt the LDS is in for. Oh well, principles and all. Good for you, bless your heart, y'all just so pure as the wind driven snow.","post_message":"Latest Poll: This Conservative State Now Has Trump In Second Place. Wait. What? @webpagelink"},{"comment_id":"889632651227311","commenter_b":"She's a dingbat","commenter_a":"Way to meny Hillary lovers. Hate Sarah only because she is a conservative.","post_message":"Trump comes forward with huge announcement about Sarah Palin... You're going to love this. She is a true patriot and will serve our country. Can we get 10,000 'LIKES' for Sarah Palin?"},{"comment_id":"884089625114947","commenter_b":"Well pack up lady!","commenter_a":"And just how they all accuse others of lies. Well i dont see any of their fake asses leaving","post_message":"Hey Barbara, we'll help you pack. See ya, never!"},{"comment_id":"10154645739237178","commenter_b":"Rather have snow than ice in Wake Forest !","commenter_a":"Sketchy in so pines","post_message":"Winter weather update with WRAL Elizabeth Gardner. (Stick around for the end to watch a little gloating from Brian Shrader's Anti-Snow League)"},{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed. You can't see greatness at the same time you see that."},{"comment_id":"10153371491386336","commenter_b":"Not American and horrible woman","commenter_a":"Mother Teresa.","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"10153659318868797","commenter_b":"You did a great job by taking this dog to the Vet, as well as putting you life at risk from being hit by traffic. And having to pay the bill just for an irresponsible person","commenter_a":"At least someone cared","post_message":"MUST SEE: This puppy was hit while wandering through traffic. A woman stopped to help, and even took the dog to the vet. Then, she held him in her arms as he died. The woman blasted the dog's owner in an angry letter she posted online, and it has since gone viral. Wow, you're going to want to see this:"}]
