[{"comment_id":"924642210962167","commenter_b":"What a dumbass!","commenter_a":"No political enemy of this country could have done more to destroy it then the Republican party has done over the past 30+ years. They have nothing to offer our citizens but hatred & fraud. Neither Russia nor China could have planned it better. These evil people have taken a strong, compassionate country & turned into the laughing stock of the rest of the free world. All they really want is to have us pay for & die for their desire to make war all the time. It's time we figured out that these \"straight\" (maybe) white men are truly impotent & can only declare their\"manliness\" by making war on everyone rlse, including you & I. If there is such a thing as the \"anti-Christ\", it has come in the form of the Teapublicans, not just one person. They are sickening & digusting.","post_message":"Too true. Image by Occupy Democrats, LIKE our page for more."},{"comment_id":"766553903477790","commenter_b":"Obama will call it workplace problems.","commenter_a":"It's not ISIS committing these violent crimes it's the guns, we have to start a war against guns!!!!!","post_message":"Oh my God.....BREAKING NEWS. Share it folks. We need you."},{"comment_id":"787563944661438","commenter_b":"No more shrubs!","commenter_a":"What do you expect from him, he is a Bush.","post_message":"Democrats have a field day mocking Jeb Bush for pretending to be \"his own man\" despite the fact his policy advisors list reads like a Who's Who from the Reagan administration and those of his father, George H.W. Bush, and his brother, George W. Bush #ItDoesntFallFarFromTheTree"},{"comment_id":"571789942944915","commenter_b":"Mentall illness--- the narcissist doing his thing..I only hope the damage he IS going to do is NOT catastrophic.","commenter_a":"Egomaniac?? That is being kind. He is certifiably insane. I am calling all my congressional reps on Jan 21 to demand a mental health evaluation. He is crazy.","post_message":"Trump's 'Twitter feed is remarkably bananas this morning. Something bad must be coming.'"},{"comment_id":"10152936340096770","commenter_b":"She is such a Train Wreck","commenter_a":"Bored","post_message":"Kim Richards spent the night in jail and was released Monday afternoon on a $5,000 bail."},{"comment_id":"10154251165218984","commenter_b":"He shots he hits he scores, 250bucks for each, thrn charge mexico for the money, sry but see if you can just walk over the border there no you can not, you get arested and jailed asap, but some how the Mexicans and all the others get by Mexicos military hummmmm","commenter_a":"Oh yea Eean, Milo, Jackie, Heather, Cory, Liz, Justin.. Mmmmhhhhm I'm not gonna share on your walls but for those who have children, think of what type of democracy will enable if Sanders or Clinton both Democrat are elected president. To have too share the taxes you earn back for the benefit of others. Don't be naive because a lot abuse the system, which means if you want universal health care and benefits.. The Republican Party has to amend the laws of drug test issued for anyone wanting freebies and living off the cheese the government provides.. Which is I THE TAX PAYER. This revolution crap will end after New York. On another note, Ted Cruz may have a 10 day rant after this upcoming Super Tuesday winning Wisconsin with all delegates.. But Trump will win New York & all the eastern part of nation, and then we're too California! ...","post_message":"This is insane, and it happened right in front of a journalist... Do you think America needs a president with a firm stance on immigration?"},{"comment_id":"10152873861987434","commenter_b":"Shit for brains","commenter_a":"Since when did weed start smelling like fish?","post_message":"After pulling Charnesia Corley over for running a stop sign, two Houston deputies held her legs apart and forcibly administered a body cavity search in public—all because her arresting officer suspected she had weed."}]
