[{"comment_id":"470600046463909","commenter_b":"I will refuse! They have already done enough to erode away our great United States of America. They need to go far away from Washington!","commenter_a":"She is \"one ugly motherfucker\".......to coin a phrase.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"474793122711268","commenter_b":"NIGGA you need to go back to Kenya, and fucken stay there.","commenter_a":"I was not born in England why don't Odumber go back to Kenya where he was born. He is such a idiot they probably don't want him back.","post_message":"The President just said 'all white people should go back to England'. This is outrageous, and just plain racist. 'LIKE' if you agree!"},{"comment_id":"10153796202658797","commenter_b":"I sure am glad this lady didnt work at a bank....","commenter_a":"really?? you're going to fire a pregnant employee for being robbed? how dumb and stupid and idiotic can they be? are they blind and deaf SHE JUST GOT FREAKIN ROBBED. i say sue them dumbasses","post_message":"YOU'RE FIRED! Marissa works at a fast food place. She’s 5 months pregnant. Imagine her terror when a gunman jumped the counter and demanded money. He got away with nearly $400. But Marissa says the store blames her. They gave her a choice: She can pay back the money or lose her job. But the store has a very different story:"},{"comment_id":"10153163157971130","commenter_b":"Nope...move along","commenter_a":"I hated the first one...I guess I'm not the audience their after.","post_message":"Thunder-buddies for life!"},{"comment_id":"1758834931015826","commenter_b":"A dude with a dick is what he is!!! Let's call a Ace an Ace & a spade a spade now!!","commenter_a":"Oh fuck this bullshit! Enough already! You're a chick with a dick we get it, not the first, nor the last. Ever been to fucking Thailand? Loaded with these fuckin things. Better looking too.","post_message":""},{"comment_id":"985183654870370","commenter_b":"She's tripping.......","commenter_a":"She got a low i.q. and a low self esteem. Your kids should come before any man. They always say a fool and their money will soon part. And soon, it will all be gone and so will he.","post_message":"The N.C. woman who won a $188 million Powerball last February is facing an onslaught of criticism after she posted a $12 million bond for her boyfriend…for the fourth time. Lamarr (Hot Sauce) McDow was arrested Tuesday for violating the terms of his pre-trial release. As NewsOne reported last year, Marie Holmes, 26, posted bond for McDow three times — once just weeks after she collected her winnings ($3 million), once in August ($6 million) and again in October after he was arrested for possession of a firearm by a felon. Is the public being too hard on Holmes? Is it any of our business what she does with her money? Let us know ----> @webpagelink"},{"comment_id":"10153794749431336","commenter_b":"She's been dogging scandal since the 70's shady person and that's probably going to be our next president.. Not because she's the best for the job, because she's a woman","commenter_a":"Clinton, will never be president of the USA, NEVER...","post_message":"George E. Pataki on Hillary Clinton’s server scandal. #GOPDeabte @webpagelink"}]
