[{"comment_id":"10153482266875329","commenter_b":"We have no hope for me aka the oblivious bitch.","commenter_a":"Brianna Musselman @username Guarantee this would probably be me, lol","post_message":"cringing"},{"comment_id":"982612308510776","commenter_b":"@username killary LIED to the FBI, congress and all of America, she's perhaps the BIGGEST LIAR and MOST CORRUPT politician ever in America, she cares for NO ONE but herself and power, wants OPEN BORDERS, over 600 thousand more refugees to come into this country, continue obummers FAILED agenda, supports abortions up until time for birth and you support her. Neither candidate is a good choice but a vote for killary is a vote to destroy America, soon socialism and like obummer she supports the New World Order, please open your eyes and use some common sense before you vote to destroy America","commenter_a":"No, Hillary is not completely rattled. She's going to win in a landslide and is now closing in on a Democrat-controlled congress. You all need to get real, regroup, and try again in 2020. Good luck.","post_message":"Hillary is completely rattled after Trey pulled this out... It's over. No one can hide from him. Let's him know he's not alone. Can we get 30,000 'LIKES' for Trey to bring Hillary to justice?"},{"comment_id":"10152546933456776","commenter_b":"Get all the illegals out of our country, Enforce our constitution and the god it was based upon twtf","commenter_a":"Let's get those illegals out of here and all those Muslims who hate us","post_message":"Today I was sworn into the U.S. Senate. It's a great honor to serve the people of Louisiana. Our state has limitless possibilities. Let’s take advantage of our natural resources as a way to create better jobs with better benefits for Louisiana families. Let’s work for healthcare solutions that give patients the power to make their own decisions. Let’s protect family values and the ideals our Founding Fathers established in the Constitution. I look forward to working together. I'm with you."},{"comment_id":"10154473671751234","commenter_b":"Take the names of all the restaurants employing illegal aliens, seize the records, heavily fine the businesses, and deport the illegals. Give the jobs to Americans- rumor has it, employment for AMERICANS is still suffering. And if you're an American who needs a job, but won't take one, no entitlements for you. There. I said it. Call it common sense.","commenter_a":"What are the party affiliations of the owners and bosses of @username?","post_message":"Some New Jersey restaurants are preparing for a strike on Thursday."},{"comment_id":"10153066527856336","commenter_b":"Please woman go troll somewhere else","commenter_a":"Poor guy","post_message":"Bristol Palin is engaged to Medal of Honor recipient Dakota Meyer – the Kentucky native is credited with saving the lives of 36 Marines, Army soldiers and Afghan soldiers."},{"comment_id":"378965758958385","commenter_b":"We need to start deporting all Muslims in this country. Or bedick them so they don't reproduce.","commenter_a":"DEPORT THEM ALL!!","post_message":"Norway started deporting radical Muslims by the thousands, then they saw something dramatic happen..."},{"comment_id":"1206849516074767","commenter_b":"Call Hillary what you want, I don't care about her emails, she is better than that piece of Shit Trump","commenter_a":"Can he get any worst?","post_message":"\"Forget politics; he is a disgusting human being.\" - Thomas Friedman"}]
