[{"comment_id":"10153965204071680","commenter_b":"Vote Hillary !","commenter_a":"Bruce Moss","post_message":"Joe Biden: \"It gets down to Florida, Florida, Florida – not a joke! You all do your job, we get to go to bed early Tuesday night.\""},{"comment_id":"821190501249706","commenter_b":"just his type, they can have fruit loops together","commenter_a":"Yeh but our leader will meet with a woman eating fruit loops in a bathtub! !! POS","post_message":"The White House is FURIOUS with Boehner for breaking protocol! Looks like somebody doesn't like the taste of their own medicine!"},{"comment_id":"10152755892071051","commenter_b":"Butch ass bitch...stop eating pussy behind the first ladies back and maybe someone would like your ugly ass","commenter_a":"If the Brits love this animal so much, they can have her.","post_message":"People in Saudi Arabia are livid with Michelle Obama for one very specific reason."},{"comment_id":"10153618615406320","commenter_b":"I think this moms do it on purpose.","commenter_a":"Please don't give this woman her kid back. They should take both. Her son will be next. Smdh","post_message":"SHOCKING: Child found 'Sweating profusely' Police in New Jersey had to rescue an child from a car seat in hot van while her mom went shopping. Details: @webpagelink"},{"comment_id":"1367609406650925","commenter_b":"Lets stomp out evil everywhere.","commenter_a":"It will be good to have a true American running the government again.","post_message":"This is definitely the most Trump-tastic resolution that Donald J. Trump could have made..."},{"comment_id":"2179339492291943","commenter_b":"Stick that thumb up your assssss.....","commenter_a":"Bang bang trumpty","post_message":"Trump wants guns in your classrooms, but not at his inauguration."},{"comment_id":"921176444602838","commenter_b":"Bernie or Hillary will destroy the economy with their policies. Plus, they're so weak on immigration and would prefer for the illegal immigrants, who by the way, suck up over 150 billion dollars per year, to stay. Trump is on point with just about everything.","commenter_a":"Michael Luna Can't wait to see what Obama says or these other people just opening the gates to everyone... Donald J. Trump is right on this one, we need to close the border right now...","post_message":"The two men have been training at the base since February and “were screened prior to their arrival in the United States more than a year ago,” according to the statement."}]
