[{"comment_id":"10153795049694199","commenter_b":"I thought he was dead....ooopps","commenter_a":"April fools","post_message":""},{"comment_id":"1517058091671594","commenter_b":"Sisters don't destroy our men like BECKYS DO....WHEN THEY FINISH WITH YOU...YOU ARE DONE!!!! PERIOD","commenter_a":"not really a black white thing. but a man woman thing. woman of all colors have gotten away with assaulting men since forever, only it now comes with a nap. as it should.","post_message":"New Video of Joe Mixon Altercation and How Society Ignores White Female Violence Towards Black Men"},{"comment_id":"10153438446318984","commenter_b":"Give her nothing she encouraged the animals","commenter_a":"hire the thugs who destroyed, burned, looted and rampaged in your streets...serves 2 purposes, gives them a job, gets them off aid, and the plus........your city gets cleaned up by those who wrecked it, with your permission..so use your dollars, not mine","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling. Are you outraged by the Baltimore mayor's request?"},{"comment_id":"1392423634112580","commenter_b":"MESSAGE TO DONALD TRUMP AND TO THOSE WHO VOTED FOR: THE DEVIL IS AT HOME. EVERYONE MUST PROTECT HIS RIGHT BY LAW. MAKES YOU QUESTION WHY MADE THIS MILLONARY HUMAN BEING MADE OF FINITO DUST? THANK YOU TO THESE COUNTRIES. IN INDIA HAS 16 BUSINESSES, ARAB EMIRATES 13, CANADA 12, CHINA 9, INDONESIA 8, PANAMA 8, SAUDI ARABIA 8, SCOTLAND 7, AZERBAIYAN 5, BRASIL 4, IRELAND 4, ISRAEL 4, CATAR 4, FRENCH ANTILLES 2, SOUTH AFRICA 2, TURKEY 2 URUGUAY 2, BERMUDA ISLANDS 2. AND CASINO IS ONLY YOUR MASK. HOW EASY IS TOMB TO THE GOLIAT. AND IF IT CONDEMNS CUBA? EVERYONE CONDEMNS THEM; UNTIL WHERE THIS DONALD HITLER ADOLF TRUMP DICTATOR HAS ARRIVED. THE CURRENT MOMENT IS OF ABRUMING INTEREST FOR ALL REPUBLICANISMS THAT OCCUPY POSITIONS OF CONFIDENCE, THE REPUBLICANISMS HAVE CHOSEN THE MOST VIOLENT MAN WHO HAD ALREADY HAD SINCE THE FOUNDATION OF THE UNITED STATES OF ...","commenter_a":"So what happens now?? Castro brother takes over???same crap or the people change this?","post_message":"\"Everybody's been partying, basically, all night long.\" Earlier this morning on \"FOX & Friends Weekend,\" Phil Keating gave us a look at the pre-dawn celebrations occurring in Miami, Florida, in response to Fidel Castro's death. @webpagelink"},{"comment_id":"10153631022078812","commenter_b":"When my sister and I owned a dual outboard, she had the ridiculous idea to do this exact same thing. We were fully grown women. I told her in no uncertain terms that she would do that one alone. The water between FL and the Bahamas is full of unsavory people, weather, and sea life.","commenter_a":"The ocean is cruel. Regardless of how prepared you are for anything, the ocean is unpredictable as well as man. Anything could have occurred. Rouge wave, pirates, drug runners, etc. Either way it must be Hell on that family right now as you start to wonder \"what if\"? From one parent to another that has lost a Son God Bless and I hope this story has a happy ending but it doesn't look good. Nature, sadly, normally wins in the end.","post_message":"UPDATE: The missing teens' boat was found capsized off the Florida coast. @webpagelink"},{"comment_id":"2027615577464102","commenter_b":"@username you didn't even spell her first name right!","commenter_a":"Ivanka Trump would be the perfect #FirstDaughter! She spoke with grace and dignity about our future President of the United States! #Trump2016🇺🇸🇺🇸🇺🇸","post_message":"Ivanka Trump spoke in support of Donald J. Trump at the Republican National Convention, saying \"no one has more faith in the American people than my father.\""},{"comment_id":"1746066945644780","commenter_b":"Sickening","commenter_a":"If Hillary wins we are fucked. All will end for this once dear nation. Adios America this nation is now a dump China & Russia are the leading nations now. Deceiving Hillary is going to backstab everyone. She will do anything to get your vote but at the end you will see her lies.","post_message":"Does Trump's violent rhetoric and bigotry remind you of something? Let's take a look back at history and find out... Big thanks to Marianne DeMarco for making this video."}]
