[{"comment_id":"10153289431079726","commenter_b":"Sure, show me how the bad outweighs the good and maybe I believe it.","commenter_a":"Real think tank in here. Glad none of you are plotting my future. Real Christian like thoughts in here as well. Fact is you don't know what he does or doesn't watch. Fact is none of you are objective enough about yourself to see through your hatred. You'll call it something else to redirect but it's hate and negativity. It is for those reasons fox news and it core viewership are not to be believed or trusted to be fair and impartial lol","post_message":"WATCH: Krauthammer: Obama ‘Doesn’t Know A Damn Thing About What’s On Fox’"},{"comment_id":"10152969596402452","commenter_b":"Exactly @username, you apply these same rule to your god daughters.😊","commenter_a":"No one cares about the children lol pets ftw!","post_message":"PET SAFETY: Arizona Cardinals player Tyrann Mathieu sits in an SUV with the windows rolled up on a sunny day in a new PSA about the dangers of leaving pets in a hot car. He lasted only eight minutes. WATCH: @webpagelink"},{"comment_id":"10153738741461491","commenter_b":"women, so weak they shouldn't even be acknowledged in movies as worthy of a fight...","commenter_a":"I don't see it as offensive. It depicts two super heros fighting. Although everyone has a right to voice their own opinions.","post_message":"\"The fact that no one flagged this is offensive and frankly, stupid.\""},{"comment_id":"10153563509195329","commenter_b":"Obviously if you're not as fat as a cow then you're not a real woman","commenter_a":"Dammit! What EXACTLY is a 'real' woman?!?!","post_message":"After years of admiring the models in Victoria's Secret catalogs, we decided to make ourselves into models."},{"comment_id":"10152866241386094","commenter_b":"So what planet will the money mongers move to when this planet will not support human life?","commenter_a":"...while not witnessing the irony of the capitalist market as the driver of climate change… says nothing of the oil gas, mining, food industry's culpability in this mass earth murder","post_message":"Planetary distress has become the new normal."},{"comment_id":"10154532714726162","commenter_b":"England, and yes it is my city is run by the labour party","commenter_a":"Where's white live matter, oh wait their not black","post_message":"A father and his two sons have been charged with molesting three young girls in their home... @webpagelink"},{"comment_id":"10154460376356955","commenter_b":"Let's get real honest for a minute. WHAT demographic purachased most of the 80 million copies of \"FIfty Shades of Grey\"? White suburan WOMEN. They were ok with the talk about p888y in that book and movie, but are all the sudden appalled at trump's language 11 yrs ago.. As espn football guys would say, \"COME ON MAN\"!","commenter_a":"Funny how all the establishment types who have fought to stop Trump all along, republicans and democrats alike, are the ones most offended by coarse language and not so bothered by corruption and criminal activity.","post_message":"Voters Heckle Paul Ryan, Chant: 'SHAME ON YOU!'..."}]
