[{"comment_id":"776000935873204","commenter_b":"But I'd call you a hoe 😂😂","commenter_a":"Us when we get a dog and live in separate places 😂 @username","post_message":"\"I pay puppy support...\""},{"comment_id":"964740956976016","commenter_b":"I am glad to see someone else that sees what is happening. Right now there are 76k Islamic refugees that have arrived and continue to come. Barack Husein Obama has strategically placed them throughout the U.S. Now ask yourself, how long will it take before key cities fall to Islam within the U.S..? He knew what he was doing, and his plan is working due to tolerance and bleeding heart liberals. It may not be next year, however, in the near future, we will see more turmoil through Islam than anything else. Bullets and beans brother...","commenter_a":"Notice that the UN is NOT pushing to fight Muslim extremists so these people don't have to flee their homes? That they're trying to export them around the World instead? The reason is OBVIOUS. To create chaos and bring down western culture. Look at France and Germany's problems with the bastards..","post_message":"That was a ... BAD idea. Check it out. @webpagelink"},{"comment_id":"10154047914259740","commenter_b":"Prayers for him and his family and all the law enforcement.","commenter_a":"Prayers for the officers","post_message":"The officer was shot Saturday morning while investigating a report of a break-in."},{"comment_id":"989113651145780","commenter_b":"Well I don't consider myself religious just because I have a relationship with god. I am Christian. The lord is my savior.","commenter_a":"sigh....","post_message":""},{"comment_id":"10155960556545500","commenter_b":"They need protection from poachers! You are really dumb for supporting this.","commenter_a":"Shut down. Place animals in a REAL SANCTUARY.","post_message":"ABUSE ACCUSATIONS against the 'Wild things' - @webpagelink"},{"comment_id":"10155998790520294","commenter_b":"No!!! I'll pass on swimming in everyone's pee and who knows what else lol. Germ infestation!","commenter_a":"I want to do this","post_message":"Would you take a ride on this 800 foot water slide? A few thousand people in Akron are!"},{"comment_id":"10152917193351813","commenter_b":"Women have options. Don't have sex if you can't afford the reprocussions.","commenter_a":"Why would you vote to decrease the options women have for health care? Makes no sense at all.","post_message":"BREAKING: Senate fails to defund Planned Parenthood. The road ahead is uncertain, but for today logic prevails. We’ll continue to stand alongside our partner and access to care for millions."}]
