[{"comment_id":"893404867419235","commenter_b":"Really! Like WTF! Those sharks don't belong there! This bullshit is effecting tourism! Kill'em all, right?? You freakin gluttonous capitalistic bitches! 😡","commenter_a":"o_O *slow blink*","post_message":"Why isn't the government protecting our freedom of beach?"},{"comment_id":"10154650140738984","commenter_b":"Lol Thomas.. I always look for that very same sticker.","commenter_a":"They could have lost their job after they bought the car. That also could be their groceries for the month. When I worked at Walmart I would see carts like that and see that a lot of people would buy their monthly groceries at one time. So if you broke the cart down into 4 it really wouldn't be that much.","post_message":"This man noticed a difference between his cart and one in front of him in line at the checkout. What he saw next is royally ticking off Americans everywhere."},{"comment_id":"10154066613342908","commenter_b":"It already IS that way. I'm all for him too, but he's big moneys' worst enemy.","commenter_a":"Tell 'em like it is, Bernie!!!","post_message":""},{"comment_id":"10153295619909384","commenter_b":"I beg to clarify this situation. As we all know, Pelosi has been psychotic for several years. I think the question that should be answered is this: How many blind and ignorant lemming liberals have kept this shameful person in the powerful position she is in, for as many years she has been elected? That is where the real shame lies.","commenter_a":"Since when do you care about Homeland security, Nancy. You who totally have supported all that obama has done to destroy the security of our nation's borders and let millions in including criminals whose own country does not want them. You are a joke and a puppet whose love of our nation was destroyed by your love of power and party. Just shut up.","post_message":"We shouldn't wait another day to remove all doubt to our enemies, to American families and to the affected workers that we will fully fund the Department of Homeland Security. My full statement: @webpagelink"},{"comment_id":"949029821890932","commenter_b":"@username Before you vote for Clinton remember this. a vote for her is vote for a another kilo of heroin across an open border polluting Americans and contributing to more crime.","commenter_a":"If you are privileged enough so that a Trump presidency doesn't matter to you, vote against him for the many people he will take advantage of if he wins.","post_message":"Most Americans, regardless of their political views, do not want to see us go backwards, and are not going to be supporting a candidate for president who has made bigotry the cornerstone of his campaign."},{"comment_id":"1075179569197597","commenter_b":"Crooked Worthless Hillary for Prison","commenter_a":"You brag about being a grandma on your Facebook page. Why don't you stay at home with your aides? Give your grandkids cookies and milk. America is a great country that influences the world. It needs a strong leader. POTUS is not a position for the weak and feeble.","post_message":"Danny Williams and his wife Leah lost their home after Trump University took advantage of them."},{"comment_id":"614898638719277","commenter_b":"She's to stupid to no anything","commenter_a":"Reason for term limits are these two examples of our Representatives being out of touch with reality.","post_message":"So thoroughly unhinged it is impressive."}]
