[{"comment_id":"928696510523431","commenter_b":"She should think about buying a woman's breasts.","commenter_a":"This girl can actually sing. Not sure why she does these things. Pointless, & invalidates her as an artist.","post_message":"Miley Cyrus shares naked tub pic"},{"comment_id":"10153256342071336","commenter_b":"Thank you.","commenter_a":"Good! He deserves it!","post_message":"Breaking News: Jury sentences convicted Boston Marathon bomber Dzhokhar Tsarnaev to death."},{"comment_id":"10155180907040649","commenter_b":"@username You are right but the other way around Soros running Obama and Hillary. They all need to go. God be with us all. Trump needs us more now than ever. Pray people and I mean pray as hard and often as you can. We will also fight them tooth and nail if need be and its looks like we are going to have to. Just stay awake, stand up no giving up and no giving in, we will not be taken down and we will win.","commenter_a":"They're rioters, not protesters. Well paid radical left-wing thugs. Call it like it is...and find out who's backing these people.","post_message":"Question of the Day: Do you think President Barack Obama and Hillary Clinton should condemn the violent left-wing protesters?"},{"comment_id":"10155964895995354","commenter_b":"Dumb ass bitches is right on!","commenter_a":"All you dumb ass bitches on the view.. Trump isn't against Latino's. He's not asking for Latino's to be thrown out of the country. He wants illegal immigration stopped. Kelly Osbourne is a racist. Imagine if Donald Trump had said that!!","post_message":"Here's what Hollywood really thinks of minorities... And one of the View's co-hosts is Latina! WATCH how well she takes it in this video:"},{"comment_id":"10153021008650326","commenter_b":"Creepy man-woman!","commenter_a":"LOSER","post_message":""},{"comment_id":"1839325792793827","commenter_b":"Sandra you old hag","commenter_a":"I hope he suffered.","post_message":"State run Press TV said Rafsanjani, 82, died from the heart problems despite efforts by doctors to save him."},{"comment_id":"1613087268994006","commenter_b":"Look at that smug look on her nasty face! She makes me want to puke","commenter_a":"Sending to the Khans..","post_message":"Appearing alongside Hillary Clinton, Khizr Khan asks rhetorically, \"Donald J. Trump, would my son Capt. Humayun Khan have a place in your America?\" @webpagelink"}]
