[{"comment_id":"10153137583782293","commenter_b":"What's this?! Women get butthurt on the Internet? Get out...","commenter_a":"Wait, what? Women actually care to attract men? I thought they'd much rather prefer to smugly ignore the existence of all men in public settings so as to artificially build their own self-esteem. Your mileage may vary, I suppose.","post_message":"\"Fear not. Since Eve, woman has been responsible for the fall of man, and again, we shall prevail.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10152884821337093","commenter_b":"Why a woman?","commenter_a":"If it ain't broke don't fix it","post_message":"Which American woman deserves to be the new face of the $10 bill??? @webpagelink"},{"comment_id":"10156527615820206","commenter_b":"She's getting my vote. I want a woman in the White House.","commenter_a":"Seeing Carly on Tuesday, can't wait!!","post_message":"Such a great welcome from supporters in Mackinac Island, Michigan today!"},{"comment_id":"10152550592377014","commenter_b":"Someday we would love too visit, Beautiful!!","commenter_a":"Jeremiah Ludewig it's so pretty but idk if I could do with cactus lol","post_message":"Another night, another stunning Arizona sunset sent in by a great 3TV viewer. Thanks, Rosanne Zimmerman!"},{"comment_id":"1613087268994006","commenter_b":"Look at that smug look on her nasty face! She makes me want to puke","commenter_a":"Sending to the Khans..","post_message":"Appearing alongside Hillary Clinton, Khizr Khan asks rhetorically, \"Donald J. Trump, would my son Capt. Humayun Khan have a place in your America?\" @webpagelink"},{"comment_id":"10154881965660575","commenter_b":"Want to be loved I guess","commenter_a":"Is it just me: or is she looking at you like a Stepford Wife ?","post_message":"Barbara Bush: “We believe that every person has the right to live a healthy, dignified life.”..."},{"comment_id":"10153109185578812","commenter_b":"I hope people know the women in Iowa aren't all like her.","commenter_a":"I'm from Iowa. So embarrassing!","post_message":"The Republican Response to #SOTU2015: Who is Joni Ernst?"}]
