[{"comment_id":"682571568600088","commenter_b":"I am so sick of hearing this offends the Muslims that offends the Muslims what the hell are they living here in America this is our country go back to where you came from because you offend us","commenter_a":"DONT LET THEM DO IT!!! Don't keep the truth away from AMERICA. Don't let them do it.","post_message":"Schools are removing the Holocaust for curriculum because it offends Muslims. This is could be the most ridiculous thing I've ever heard. Do you think they should keep the Holocaust in history lessons?"},{"comment_id":"10152836141061130","commenter_b":"A man loves getting molested by his women while he is sleeping he will wake with a bigger erection because he is not sure who is doing him.","commenter_a":"I like red haired, bears","post_message":"A man isn't strong unless he's also vulnerable."},{"comment_id":"10154078689087894","commenter_b":"Smh! I find it hard for woman to think they can touch people and think its ok. Everybody don't like to be touched. Yes his a artist performing, not for you to be there grabbing all on his or her clothes just to say \"Oh I grabbed his pants\"!! Sit back and enjoy the show....without touching me!","commenter_a":"Oh please he didn't take his foot and shoved it down her throat! He tapped that girl with the top of his shoe. And because he's a big dude it look harder then what it probably was. She still stay at the show, so she must wasnt hurt that much! 6months is ridiculous!!!","post_message":"Kevin Gates Sentenced to Six Months in Jail for Kicking Female Fan [Video]"},{"comment_id":"262360004194462","commenter_b":"It's a bad photoshop job","commenter_a":"Ewww !! Haha","post_message":"TELL US IN THE COMMENTS!"},{"comment_id":"1019443361412045","commenter_b":"Let's use it to build the fuckin wall","commenter_a":"Twice as much as reported. The other half is getting sold back by corrupt DEA agents. Border Patrol did their job, now DEA will make it tougher for them.","post_message":"Guess high, REAL high."},{"comment_id":"10152995429007507","commenter_b":"So you won't procreate?","commenter_a":"Ha-ha.","post_message":"Clock started...."},{"comment_id":"10157782729605725","commenter_b":"She's a fake!!","commenter_a":"Mlp","post_message":"An honor to be at the Polish National Alliance in Chicago, Illinois - meeting with & speaking to the Polish American Congress. Thank you!"}]
