[{"comment_id":"817062668431422","commenter_b":"We are to political and afraid to hurt someones feelings to do anything... when Trump ginally takes the seat yall will see some change","commenter_a":"My tears go to all the fatalities. Rest in peace","post_message":"BREAKING NEWS: Berlin terror attack... At least 12 dead as truck ploughs into Christmas market Full story: @webpagelink"},{"comment_id":"10154473671751234","commenter_b":"Take the names of all the restaurants employing illegal aliens, seize the records, heavily fine the businesses, and deport the illegals. Give the jobs to Americans- rumor has it, employment for AMERICANS is still suffering. And if you're an American who needs a job, but won't take one, no entitlements for you. There. I said it. Call it common sense.","commenter_a":"What are the party affiliations of the owners and bosses of @username?","post_message":"Some New Jersey restaurants are preparing for a strike on Thursday."},{"comment_id":"10153379588172377","commenter_b":"TRUMP vs HILLARY?? Trump Illegals out, creates jobs - Hillary Illegals left here, job losses? Trump build a wall, welcome new legal citizens and make them pay taxes. Hillary let em stay and use all our stuff for free. No wall ?? Trump going to bring companies back to America - Hillary could care less ? Trump supports all woman's programs, equal pay and job growth. Hillary supports only women's programs that give to her foundation and supports habitual adultery from her husband?? Trump support our allies in the Middle East & make new deals - Hillary does not support our allies and no new deals? Trump get rid of Obama care and have open insurance plans that people are allowed to pick from - Hillary supports Obama care and it will literally bankrupt itself in 3 more years ? Trump protecting other countries with our military & now earning ...","commenter_a":"why would Obama do that? His hero is Bil Ayers, terrorist bomber.","post_message":"President Obama should have insisted on Cuba returning a group of fugitives accused of killing police officers."},{"comment_id":"10153491721731337","commenter_b":"He's the biggest Dick","commenter_a":"Rock Star? Don't you have to be able to play an instrument? And sing? If not, then I'm the biggest rock star!","post_message":"SHOTS FIRED: Kanye West claimed to be \"THE GREATEST LIVING ROCK STAR.\" The Who responded perfectly..."},{"comment_id":"1037527509601593","commenter_b":"Well America will allow idiots to have guns","commenter_a":"What a dingbat","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"635519663305279","commenter_b":"And cut her off. And see her vagina shut","commenter_a":"Deport her and her whole family","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"517613611762552","commenter_b":"@username must be an ignorant stinking liberal!","commenter_a":"Why can,t we ban liberals ???????","post_message":"Liberals are trying to get rid of one of your favorite snacks. Stop being so sensitive. We need to put a stop to this. Do you agree Liberals pushing their beliefs on you?"}]
