[{"comment_id":"885067018227393","commenter_b":"Moms should go to a socialist country where their values are the norm","commenter_a":"Cops are too agressive and think they are always the kings and you can't tell them anything, and they dont know the laws.","post_message":"Moms want out of America!"},{"comment_id":"1007375585988585","commenter_b":"You're a bitch brady","commenter_a":"Yet another reason to dislike Tom Brady.","post_message":"Tom Brady's support for Trump may be as soft as his balls."},{"comment_id":"709741415860770","commenter_b":"She's about one stupid fucking bitch.","commenter_a":"Nancy, Nancy, Nancy: you've been in theHouse/government too long !!Time for you to resign!!!","post_message":"Liberal logic: Taxpayers don't fund abortions, they fund the organization (Planned Parenthood) that performs the abortions. This is liberal, pro-abortion double-speak at it's worst."},{"comment_id":"10157462499315093","commenter_b":"Hillary Rotten Clinton is the most corrupt person to ever run for president...she is like Crabby Appleton,Rotten to the core....","commenter_a":"Hillary Rotten Clinton is the most evil and most corrupt politician in our country's history hands down.","post_message":"They gave money. She gave them meetings. It's a conflict of interest. It's corrupt. She's still lying about it."},{"comment_id":"10153113757150329","commenter_b":"I am 5 ft 9 and wear a 22. She is 4\" shorter than me., She is sitting sideways and we all know when we sit down the bulges show more. if she was standing up you would be able to tell better. She is gorgeous and fyi anything over a 12 is considered obese in the weight scale","commenter_a":"If she's a size 22 then I'm also a white woman.","post_message":"Meet Tess Holliday, a size 22 model who is the first of her size and height to be signed to a major agency."},{"comment_id":"10154352675806336","commenter_b":"Lets hope they nail her butt to the wall!!","commenter_a":"video of her saying she was shot at and then video that she was not shot still cannot convince these people she is a liar.","post_message":"Bret Baier: \"The State Department IG, though, wanted to talk to you and you didn’t want to do that.\" Hillary Clinton doubled down on claims that her personal email scandal will not hurt her presidential bid or result in an indictment. @webpagelink"},{"comment_id":"989628607749873","commenter_b":"Lord have mercy, poor little baby, may he rest in peace.","commenter_a":"HOW?!?! HOW DOES THIS HAPPEN?!?! I just can't wrap my head around it. I have tried to understand but I am also a busy/working mother and I just can't understand how you can forget about a child in a car.","post_message":"Parents, grandparents and caregivers of any kind - PLEASE remember to always check your vehicle: @webpagelink"}]
