[{"comment_id":"10150524320899999","commenter_b":"So once again punish people who are trying to help themselves","commenter_a":"Un-American","post_message":"Millions of families may need to rethink their approach to college savings."},{"comment_id":"10153584485708812","commenter_b":"So did Jesus preach love or condemnation??? I'm confused! Wait, actually YOU ARE CONFUSED! Don't buy the nonsense you are listening to on Sundays. Save your 10%, and search your soul for the truth! Ironic how the same people who follow Jesus (a man of love and forgiveness), are the ones who are most hateful and judgmental","commenter_a":"Wow... Let's see what's next... You give a little & then they want more. SMH","post_message":"South Carolina House approves bill removing Confederate flag from Statehouse grounds: @webpagelink"},{"comment_id":"10153438772266051","commenter_b":"Ignorant bitch.","commenter_a":"Grow up you spoiled brat.","post_message":"It's easy to see why this encounter between a woman going through the McDonald's drive-thru and an employee has gone viral."},{"comment_id":"10153233936119170","commenter_b":"Yes, she belongs there. Always enjoyed this show and hae a good laugh at some stupid people.","commenter_a":"Fodder for \"World's Dumbest Drivers\".","post_message":"Behold a video of the worst parking job in human history. Newsworthy? Probably not. Hilarious? Definitely."},{"comment_id":"684458911714062","commenter_b":"Not this dumbass lady again","commenter_a":"\"Surrogate?\" That's his campaign CHIEF!","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"10153593708856770","commenter_b":"#TRUMPorTAXREVOLT #BOYCOTTAMAZON #TRYCLINTONFORTREASON #TRYOBAMAFORTREASON #REMOVERYAN #REMOVEPELOSI #AUDITTHEIRS #DISENGAGEWITHTHEUN #DISENGAGENATO #DISBANDTHEELECTORALCOLLEGE #INSTITUTEPOPULARVOTE #HOLDMEDIAACCOUNTABLE #IMPOSETERMLIMITS #VETERANSB4ILLEGALS #BANISLAM #UPHOLDTHECONSTITUTION #REVERSEALLOBAMAORDERS #ARRESTSOROSFORINTERNATIONALTERRORISM #WORKFARE #NOCITIZENSHIPNOVOTE #KILLCOMMONCORE #PURGETHEGOP","commenter_a":"The Muslim Brotherhood government in Egypt CRUCIFIED CHRISTIANS IN DOWNTOWN CAIRO--and they remained Obama's favored government. After the Egyptian people threw them out, Obama continues to consider the Muslim Brotherhood the legitimate rulers of Egypt.","post_message":"The Obama administration’s disappointment with the U.K.'s Brexit contrasts sharply with its celebration of the Muslim Brotherhood’s election in 2012."},{"comment_id":"1170886402975254","commenter_b":"Great family, a drunk, his brother a cheating womanizer, and his lying idot of a wife","commenter_a":"It's ok he will be let go with no repercussions !! 1 he is a Clinton 2 he is in California","post_message":"Former President Bill Clinton's brother, Roger Clinton, has been arrested for DUI in Redondo Beach, California."}]
