[{"comment_id":"831083283688817","commenter_b":"Just a bunch of fat people eating fat food. No incumbents in 2016 november.","commenter_a":"America runs on Dunkin!!","post_message":"Elizabeth Warren repped Massachusetts by bringing Dunkin' Donuts to the House sit-in."},{"comment_id":"551022975088282","commenter_b":"the only thing i would sacrifice for this transvestite is a bullet.","commenter_a":"What the hell makes her think she can change our constitution? She's a nobody married to a mistake & not worth the oxygen she breaths! & he is a waste of oxygen also.","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"10154029757858132","commenter_b":"Wow. You ladies are some different kind of stupid","commenter_a":"Breastfeeding in public is fine but cover up, no one wants to see you whip your boob out in the middle of their lunch in a restaurant.","post_message":"This mother refuses to be shamed."},{"comment_id":"292042534545715","commenter_b":"Ur so dead and sure its ur bear belly","commenter_a":"It's @username's butt ;)","post_message":"What could it be?"},{"comment_id":"1452176608135698","commenter_b":"What branch of the service was Hillary and her daughter in?","commenter_a":"Thank you for your family's sacrifice, sir, your son is a true American hero. Donald Trump doesn't know the meaning of the word.","post_message":"His son was killed while fighting for the U.S. in Iraq. Now, he's got something to say to Donald J. Trump."},{"comment_id":"10152917139561051","commenter_b":"Kim, Please show me where the white kids were doing this. I must have missed this.","commenter_a":"Can anyone explain why blacks act like this? Is it something about IQ?","post_message":"These kids thought it would be funny to jump on people's cars and dent them. It took about a minute before someone noticed and decided to make them regret it."},{"comment_id":"10153513922564087","commenter_b":"Typical obfuscation from a serial liar & all-around nasty woman,","commenter_a":"Bernie will release whatever you ask him to. He has nothing to hide!","post_message":"“Let everybody who’s ever given a speech to any private group under any circumstances release them,” Hillary Clinton said on ABC’s “This Week.” “We’ll all release them at the same time.”"}]
