[{"comment_id":"10154135106979330","commenter_b":"Scumbag","commenter_a":"Conservative idiots who are happy.. it will ultimately go to the Supreme Court and your ace has died. Oops.","post_message":"A judge has just ruled that the Obama administration is unconstitutionally spending federal money to fund Obamacare @webpagelink"},{"comment_id":"10154064032541509","commenter_b":"Because Muslims should NEVER be president of the USA period!","commenter_a":"So what if Obama is Muslim? And then what!?","post_message":"Donald J. Trump under fire for not challenging anti-Muslim comment from a supporter: @webpagelink"},{"comment_id":"10154394948753494","commenter_b":"When one door close another will open, smh","commenter_a":"I hate to break it to anyone, but unless you own the company very few people can not show up for work and still have a job. There are plenty of others who need a job, that will step right up and be thankful to have a job.","post_message":"Juvenito Quintana and 20 others missed work February 16th. The following day, they all received a termination letter."},{"comment_id":"10153160273727217","commenter_b":"Sorry if that last comment offended anyone.","commenter_a":"Does EVERYONE in Britain get offended by EVERYTHING?","post_message":"\"It brings back trauma for everybody who was attacked by a shark.\""},{"comment_id":"1145946565440763","commenter_b":"@username Maybe a visit to the Maury show???? That's where all whores go","commenter_a":"It looks like with eight children, some of the fathers should be paying child support, not the government!!","post_message":"GOOD!"},{"comment_id":"1916311915262611","commenter_b":"Wrong country? Or city? Please, do not behave yourselves wiser than Asians or Muslims. It's a sin. We have to love each nation regardless their colour, religion, geographic location.","commenter_a":"Pithy Vann that sucks","post_message":"An AirAsia plane accidentally flew more than 400 miles in the wrong direction"},{"comment_id":"10153071601427434","commenter_b":"Some black women are hot","commenter_a":"You KNOW it was provable, terrible, and criminal when the nearly all white, all male jury found him guilty. Even they were horrified enough.","post_message":"A jury has found Daniel Holtzclaw guilty on 18 of the 36 charges he faced for allegedly assaulting at least 13 black women. He faces up to 263 years in prison."}]
