[{"comment_id":"10150723689079999","commenter_b":"Krissy's a troll. Ignore her.","commenter_a":"Monstrous. No excuse. Over the course of 4 decades denotes a culture of abuse not an abnormality in behavior.","post_message":"At least 231 children who sang in a boys’ choir led by the brother of former Pope Benedict XVI were abused over a period of almost 4 decades."},{"comment_id":"758333967690514","commenter_b":"Pure, unadulterated ignorance. Lots of it going around. That guard shut them down","commenter_a":"Some people have no respect. So sad.","post_message":"These two men laughed at a military memorial. This guard shut them up without hesitation. Do you hate disrespectful people like that?"},{"comment_id":"10152700473451051","commenter_b":"Better to stay single. Plan to meet in a well lit public location. Women don't pick up or be picked up.","commenter_a":"I tried this one time! Never again! He scared me!","post_message":"It started out as an ordinary date between two people who met online. It ended very violently."},{"comment_id":"1390819424294656","commenter_b":"Esta es la barbaridad de el aborto La Nina nacio viva, y la dejaron morir.Dios va a traer juicio , sobre todos los que derraman sangre inocente.","commenter_a":"That's not an abortion,that's disgraceful","post_message":""},{"comment_id":"1718149915138787","commenter_b":"Why don't they remove these 3 evil women?","commenter_a":"I wouldn't waste 1 minute watching this group! They all look like they are wearing Halloween masks!","post_message":"Come... ON... Joy Behar needs to be banned from TV!"},{"comment_id":"10153076397462452","commenter_b":"Yikes!!! Kill it with fire before it rapes again.","commenter_a":"Why do child molesters look so child molestery?","post_message":"A former drama teacher at Sycamore Junior High School in Anaheim has been arrested on child molestation and child pornography charges. @webpagelink"},{"comment_id":"632124420311470","commenter_b":"Of all the garbage o n tv every night and they r bitching about this, cmon really! This right here is the reason we need to get rid of the shit in govt","commenter_a":"That's funny, Liberals complaining about a woman uncrossing her legs When has this been an issue for them? This is why liberalism equals hypocrite.","post_message":"Liberals want FOX News taken down after yet another wardrobe malfunction. This is ridiculous. FOX News hosts are classy, we support them! Do you support ALL FOX News hosts?"}]
