[{"comment_id":"849566101841798","commenter_b":"Ignore Spenser Jeffery, he's bankrupt, c);-)","commenter_a":"God Bless this wonderful man! God bless his family and many friends. You truly lost a good man. Prayers and all the respect in the world to him and his family!! Please holy father, take this wonderful soul into your loving arms, amen and amen.","post_message":"\"I swear to God I love this city but I wonder if this city loves me,\" slain officer Montrell Jackson wrote on Facebook earlier this month."},{"comment_id":"382957778552770","commenter_b":"Better her than some right wing nut!","commenter_a":"Hoping for someone else - Hillary is too close to big bankers. :(","post_message":"You won't believe how large her lead is now!"},{"comment_id":"1811838059034995","commenter_b":"And her answer is I don't have an answer for you. Really because you know the answer already bitch","commenter_a":"Love this guy. So to the point it's pathetic. And I can't answer anything.","post_message":"Trey Gowdy utterly DESTROYS this liberal...."},{"comment_id":"10154700417126323","commenter_b":" This is why women worldwide have body issues. Because nasty bitches like this one feel it is their duty to mock and body shame. Well shame on her for bringing the world down a notch in my estimation...","commenter_a":"'It's not the person I am' well it is love because you took the picture and posted it. Goes to show beautiful on the outside not at all on the inside.","post_message":"A Playboy model who used social media to body shame a 70-year-old woman at her gym was charged with invasion of privacy by the Los Angeles city prosecutor on Friday."},{"comment_id":"611879509002628","commenter_b":"She was already insane!","commenter_a":"Whay too much PIE HOLE. Cuss at me, and your Freedom of speech, goes right out the window!!! Maybe she should resort to plan \"B\". Get a M/F'in JOB!!","post_message":"This welfare leech absolutely lost it when she couldn't get change with her EBT card. How pathetic. You cannot live off the hard work of other people. Are you tired of welfare leeches stealing your money?"},{"comment_id":"10154223634466770","commenter_b":"She's got great legs","commenter_a":"All these red carpet shows are about is who can have the most revealing, revolting and trashy outfit on! It's rare that there's a decent one, but I guess they're the ones not shown because they aren't revealing enough! Too bad these \"artists\" don't rely on talent!!!","post_message":"We didn't even know they made dresses this short."},{"comment_id":"1800270353550404","commenter_b":"She is a news whore and can't stand when she's not the center of the news! Whole thing probably a publicity stunt!","commenter_a":"insurance","post_message":"Kardashian West has yet to post about the incident in the days since it all allegedly went down."}]
