[{"comment_id":"10153626418796509","commenter_b":"She truly is hideous","commenter_a":"God she's so ugly . How did she trick Ferris Bueller into marrying her?","post_message":"Many celebrities attended the Metropolitan Museum of Art's Costume Institute Gala in New York. See pictures from the red carpet. @webpagelink"},{"comment_id":"10154062692302439","commenter_b":"How will all the \"empowered\" women of America take this? I say there will be a revolt.","commenter_a":"Has the U S stooped so low. No gentlemen, no ladies, no gender. Just human bodies. Numb, mindless zombies.","post_message":"Another gift we can thank the feminists for. Let's see; the epidemic of single motherhood, the breakdown of the American family, the street vernacular of \"bitches and hos,\" the emasculation of men, defense of Islamic misogyny, suppression and oppression, silence on sharia, and the bone-crushing responsibility of one woman being mother, father, breadwinner, chief cook and bottle washer we owe to the feminists. And now this - one can only imagine what the likes of the Islamic State will do to our female soldiers."},{"comment_id":"10153662465839714","commenter_b":"Am I the only one who gets the joke?","commenter_a":"Mr trump, explain to me why something in the constitution is unconstitutional?","post_message":"Donald J. Trump continues to defend his controversial immigration plan."},{"comment_id":"10153683930231323","commenter_b":"@username No, your country has still resposibilities coming from your good age of colonialism and be honest to your self: IS are nothing else than organised crime and don't be so stupid to believe, that an group of organised crime needs \"illegal immigrants\" to spread the business. BTW: find out where the largest number of historical artefacts from the middle east, coming with an unclear origin, are traded? Don't be surprised when you find out that it is London and you you can easily find out, that it is business of billionGBP earning. Why do you think IS is destroying historical sites? So, all this happens under the control of your government, right in your neighbourhood...","commenter_a":"The people were on their way and Germany take action to relief all surrounding countries, who where not able to cope with a minor percentage of the people floating their countries. Yes, it is not easy, but Germany helps a lot of people and countries and yes, it is a massive task, but we (you and me and our governments...) have to deal with it.Why? Because we are causing the situations, why the people have to flee and have seek for shelter. So, I am living in Hamburg, my borough is called \"Bahrenfeld\" and we have a polpulation 23.000 people. Currently we have 3.200 refugee living here. And I can hardly understand, why a country, which has caused and initilized a lot of the current wars in the middle east, in order to earn oil money ----NO---- to fight terrorism (hahaaa), refuses to take part in the resposibility...Yes, my dear ...","post_message":"“Sometimes the smugglers arrive in the middle of the night and drop underage refugees off at the service station. The police call my child protection officer at 3am, who has to go to them, and if no accommodation can be found, he often ends up taking them home with him.\""},{"comment_id":"986861908039953","commenter_b":"President Obama is the best. Elizabeth Warren should have run for president because she would have been great just like Obama..STOP HATING PEOPLE. Recognize greatness...","commenter_a":"That's just great Thank you Mr President and Elizabeth Warren , your the best !!","post_message":"They are kicking Wall Street's ass!"},{"comment_id":"1729707230595759","commenter_b":"See, you came here legally. That was your big mistake.","commenter_a":"I immigrated from Europe legally paying my dues. Before they even gave me the visa to enter in USA I had to travel across the country and spend a day at a hospital designated by the USA consulate being checked out for diseases. Had to have a certificate from the tuberculosis center that I don't have tb. And after the consulate got my results I was issued the visa and given the green light to come to USA......why did the laws change?","post_message":"Are Americans aware of this?"},{"comment_id":"10155137822548984","commenter_b":"@username hold your breath you retarded bitch and see witch comes first.","commenter_a":"He has done more in one or two days against ISIS, than Obummer had done in 8 years! On the other hand Obummer has done more to help ISIS and Iran in eight years than all countries combined!","post_message":"General James 'Mad Dog' Mattis just showed everyone why Donald Trump chose him to be secretary of defense. ISIS is in for a rude awakening..."}]
