[{"comment_id":"10153987186985329","commenter_b":"Fuck off bitch","commenter_a":"Dorotea Lazio Batistoni I'm ded","post_message":"It's finally happened."},{"comment_id":"10157746035990093","commenter_b":"Megan needs to be Fired! She could always work for the Clinton's.","commenter_a":"That's one lieing women","post_message":"Donna Brazile CANNOT take Megyn Kelly's line of questioning and it's hilariously uncomfortable. She's so CLEARLY lying!"},{"comment_id":"10152958371844342","commenter_b":"sbot negroes are just going to keep raping robbing murdering , shooting looting and then '' pointiong out no one likes them''' ahhhhh dahhhhhh mr prez-a-dent","commenter_a":"so, this was 3 years ago, and you're just now getting upset?","post_message":"\"They got a slap in the face.\" A couple is now suing the owner of a photo booth who was taking pics at their wedding in 2012. Apparently, some of the guests had racial slurs printed on their wedding day photo. FULL STORY --> @webpagelink"},{"comment_id":"10155683176459778","commenter_b":"@username classless is any woman who voted for Trump...","commenter_a":"I hope he sticks his middle finger up on the walk across the lawn...","post_message":"Are you ready to say goodbye to President Obama?"},{"comment_id":"10153133818461491","commenter_b":"Feminazis are the worst. Impossible to be around.","commenter_a":"Lame. I support women and women rights. But, the so-called feminism movement is not attempting equal rights, rather, they think women are superior to men. Everything about the femisnism movement is ironic and does more harm than good.","post_message":"Stephen Colbert is a feminist."},{"comment_id":"10153292336206680","commenter_b":"Given he is so concered about conditions in Eurpose how about opening the borders to more refugees in desperate need . Sharing the burden rather than slamming to door to hope shut.","commenter_a":"I've been to Brussels. I was essentially homeless there for one night as I passed through -- I camped at a vacant fairground. Not a single Muslim tried to commit a violent act against me. The real world isn't nearly as scary as Trump seems to think it is.","post_message":"POLITICO Europe Donald Trump defended his proposed Muslim ban."},{"comment_id":"10153432953951130","commenter_b":"Its not hard at all. Check craiglast there everywhere. I can sell you mine. Thats the point!!","commenter_a":"It's such a pain in the ass to get guns now. Why would anyone want more gun laws?","post_message":"A majority of Americans want stricter gun laws, and now we have the poll numbers to prove it."}]
