[{"comment_id":"927319353970153","commenter_b":"Who cares about whatever Sarah has to say....she's a nobody. Good grief !!","commenter_a":"BO doesn't care he's in office as a fraud perpetuating and feeding the muslime brotherhood on our dime","post_message":"HA HA!"},{"comment_id":"1048024048598660","commenter_b":"Disgusting.","commenter_a":"The blessings of new life. I think it's wonderful","post_message":"\"It looks like an alien\""},{"comment_id":"10153078698497994","commenter_b":"Ucs ? Every district around them closed! who are they competing with? This lady shouldn't be a superintendent of a kennel let alone of our children!!!","commenter_a":"378 schools closed today and a handful of are schools still open that has to be frustrating to parents, teachers and students. This is one situation it's not okay to stand out","post_message":"Nearly 300 schools are already closed this morning (including Detroit Public). You can check out the list here."},{"comment_id":"880649995314349","commenter_b":"What's the hold up? The President cannot be trusted to follow the law. President Obama has repeatedly shown that he will use \"prosecutorial discretion\" to simply refuse to enforce provisions of the existing deportation laws. Marco Rubio originally helped sponsor the Senate bill, but now says that he opposes any immigration reform until the border is secure FIRST. Any immigration reform should first start with verifiable border security -- not 100% since that's not realistic, but verification that almost all illegals are turned away at the border. At the same time, the Visa system needs to be reformed -- people from all over the world enter the U.S. with a tourist visa and then never leave -- the current system fails to track these people and force them to leave. This is not an issue of race; it is an issue of national sovereignty. Only after the Border is secure ...","commenter_a":"I am very impressed, Rep. @username, you nailed it. First, this is a vital issue under the Constitution -- the President cannot simply wish a new law into existence, especially one opposed by Congress, and the Congress MUST assert its Power of the Purse to preserve the balance of power. Otherwise, the Presidency becomes too powerful. Second, this Administration and the Democratic party have been able to accomplish much of their agenda by simply refusing to negotiate, forcing the Republicans to give in. However, the structure of the legislative branch in the Constitution was INTENDED to require compromise to get things done. It is obvious that the Democrats are more concerned with political victories than what is best for the country. This is one time when the Republicans should not, and CANNOT simply acquiesce to the other side who refuses to compromise. We all know that separating DHS funding bill ...","post_message":"I spoke on the House floor to discuss the Department of Homeland Security's funding and challenged our Congress to find solutions. You can watch my remarks here:"},{"comment_id":"1552829708351782","commenter_b":"Nor do any of you have the full story like I do, so please don't speculate on what you don't know.","commenter_a":"in this day and age, a woman shouldn't lose her life during childbirth, I surely hope there is a huge investigation","post_message":"He was at the wake for his wife and 5-day-old baby when he got word that his sister had lost her battle with cancer. Many of you saw the heartbreaking story on NewsCenter 5 and have asked, “How can I help?” Here’s how: @webpagelink"},{"comment_id":"10156255636920354","commenter_b":"At least admit you got beat up by thugs...","commenter_a":"To bad the band did not hit him in his lying liberal mouth.","post_message":"Things are about to get VERY interesting..."},{"comment_id":"1510580285648823","commenter_b":"She is amazing. Jill is a bad ass","commenter_a":"Margy White @username","post_message":"True confessions: What was I doing in Russia? Speaking out against Putin following the US into catastrophic war in the Middle East, and calling for a weapons embargo and #PeaceOffensive in the region. Check out the video of my full remarks: @webpagelink"}]
