[{"comment_id":"10154319616791337","commenter_b":"???????????? LOL ????????????","commenter_a":"Looking forward to Colbert's inevitable rant about this, since he has Cap's shield.","post_message":"PURE FURY! Captain America fans are losing their sh*t over this decision..."},{"comment_id":"10152828660804071","commenter_b":"Yes.Yes. The hookers have also existed forever. Its seeing where and who they recruit. thats what would shock you. These women aint street walkers or trailer park meth queens..","commenter_a":"So true.. Except the hookers, not sure about that.","post_message":"Some of these are shocking."},{"comment_id":"10153534802752217","commenter_b":"It's knowledge obviously. Go look up the definition of Asylum if you are that uneducated @username","commenter_a":"They are all migrants, NOT refugees if they didn't claim asylum in Greece or Turkey for that matter. Your reporter needs educating.","post_message":"More than 11,000 refugees and migrants are camped on the Greek side."},{"comment_id":"1182026965223689","commenter_b":"Those Redumblicans are getting worse everyday!","commenter_a":"He deserves what he got !","post_message":"Here's some more of those \"family values.\""},{"comment_id":"10153113757150329","commenter_b":"I am 5 ft 9 and wear a 22. She is 4\" shorter than me., She is sitting sideways and we all know when we sit down the bulges show more. if she was standing up you would be able to tell better. She is gorgeous and fyi anything over a 12 is considered obese in the weight scale","commenter_a":"If she's a size 22 then I'm also a white woman.","post_message":"Meet Tess Holliday, a size 22 model who is the first of her size and height to be signed to a major agency."},{"comment_id":"1071265242982572","commenter_b":"Do NOT be BLINDED people for it won't be long before they find a way to seize everyone's guns- THAT'S WHAT THIS IS TRULY ABOUT- SMH","commenter_a":"You are representing terrorists","post_message":"Attorneys for the family of Keith Lamont Scott hold a news conference."},{"comment_id":"10153491570891336","commenter_b":"I don't want that scum anywhere near my home.","commenter_a":"Considering I don't have an auto dishwasher, Obama can be my dish washer anytime.","post_message":"Counterproductive? New Obama administration regulations are meant to boost dishwasher efficiency, but industry experts say it'll result in greater water usage."}]
