[{"comment_id":"1085472271464242","commenter_b":"If they are on there with consent, are actually single, or are polyamorous, this breech will not hurt any relationship. But this site advertises directly to cheaters.","commenter_a":"How many users on am are there with full consent of their partners? How many are actually single? How many are polyamorous? These things you don't know, and here you are cheering on this invasion of privacy for all am users, because you don't align morally with a subset of users. This kind of punishment never goes away, and that is especially a problem for those who don't deserve it.","post_message":"Will this hack be the one to get people to care about digital privacy?"},{"comment_id":"10156586840470147","commenter_b":"Tildon Peacock, so using your guidelines, abortions should only occur when there was rape?","commenter_a":"The law already acknowledges the unborn child as a human being. If a pregnant women is murdered, it's classified as a double homicide. Regardless, it should have a right to live as we all had the opportunity. If society calls a germinating seed a plant, we can call an unborn child a human being with rights.","post_message":"Wow..."},{"comment_id":"1094996023854086","commenter_b":"What an ignorant woman..,","commenter_a":"Beautiful! So glad she will be recognized. This Pope restores a bit of faith in me for the Catholic Church!","post_message":"Mother Teresa of Calcutta, a nun who dedicated her life to helping the poor, will be made a saint of the Roman Catholic Church at a ceremony on Sept. 4, Pope Francis has announced: @webpagelink"},{"comment_id":"978977272143131","commenter_b":"I agree. That's a spot on observation. I never thought about that, but it's true. Many feminine topics make people uncomfortable. Whether it be hygiene, sexuality, or social treatment. All common topics for comedy.","commenter_a":"Honestly, I think a lot of the reason men don't find women funny, is because men AND women are trained to see things from a man's perspective. I can hear a boner story and laugh my ass off because I can imagine what they are telling me and it's amusing. So much of what women comedians talk about are things that men feel they can't relate to - they've never thought about most things from a women's perspective. Just my two cents though...","post_message":"First it sounds ridiculous. Then you get it. Then it's hilarious and sad all at the same time. - Eric March"},{"comment_id":"1077881772268351","commenter_b":"She's lying her lips are moving...","commenter_a":"Get $60 worth of free medical marijuana at eazeup.com with promo code: icfnwx","post_message":"The best part of being at Caesar's Palace at midnight? Meeting the amazing staff."},{"comment_id":"10153566690418812","commenter_b":"Get those horny chicks out of there.","commenter_a":"This is a good reason why you don't have them in there or serving in combat.","post_message":"One former female corrections officer is providing an insider perspective on forbidden love behind bars: @webpagelink"},{"comment_id":"10157205870170354","commenter_b":"Cats don't like her.","commenter_a":"She can hate him all she wants but I bet more people in this world hate her pathetic ass. She is a washed up piece of shit who is completely irrelevant and means nothing to no one except maybe a few fucking cats","post_message":"Rosie O'Donnell's worst yet..."}]
