[{"comment_id":"1033904696677262","commenter_b":"it's good that there is surveillance even watching midwives, and exposing this crazy cow is also good, but I just feel that this might start a trend of uploading horrendous abuse videos. The media should try to hide the identities of poor kids like this baby. She definitely needs shooting a few times at least.","commenter_a":"I have not seen the video nor do I want to. Y on earth is it here for everyone to see!? What is there to gain from displaying a horrific video of a child being abused? The story should be published but when this poor child grows up and sees that this video has been seen by millions how do u think he/she will feel? Hope this cow rots in hell.","post_message":"WARNING: GRAPHIC VIDEO"},{"comment_id":"10154429253158812","commenter_b":"Oh the illegals know wnglish, most play stupid","commenter_a":"So we don't require illegal aliens to speak English but go to Vietnam to teach them English","post_message":"Pres. Barack Obama announces that the Peace Corps will go to Vietnam for the first time. The group’s main focus will be teaching English to Vietnamese students."},{"comment_id":"1557321691221611","commenter_b":"karma is a bitch at times","commenter_a":"When is it anybody else's business! Tell them to butt out!","post_message":"Way to go mom!!!"},{"comment_id":"491024294436506","commenter_b":"@username you are a horrible racist pile of feces. You're worthless.","commenter_a":"I take offense at The Great White Trash's reference to any member of Native America. He should keep his trash talking to himself. Pocahontas' only crime was a lapse in judgment by saving the life of some white guy.","post_message":"When Donald Trump was asked if “he had been chided by any Republicans” for his Twitter war with Elizabeth Warren, the presumptive nominee said, “You mean Pocahontas?”"},{"comment_id":"1006112072821407","commenter_b":"Demand Justice..Hillary doesn't deserve a Free ride.....","commenter_a":"Clinton Mafia is on the Move #NeverHillary #NeverAgainBill!!!","post_message":"FBI Director James Comey detailed Hillary Clinton massive destruction of government records and grossly negligent handling of classified information. Frankly, there a disconnect between Comey devastating findings and his weak recommendation not to prosecute Hillary Clinton. Federal prosecutors, independent of politics, need to consider whether to pursue the potential violations of law confirmed by the FBI."},{"comment_id":"389381401250154","commenter_b":"Well go home and get oyt of AMERICA ,no one made you come here and no one wants you here !!!!!","commenter_a":"Is Obama seeing this! Maybe He's the Antichrist.","post_message":"Muslim Leaders Show How ALL Muslims really think...."},{"comment_id":"10154839732705695","commenter_b":"Amen to that!","commenter_a":"If Trump can be manipulated by someone half his age with no power over him then he doesn't belong in any leadership position, let alone the Presidency.","post_message":"She suggested that Trump may not have known his microphone was on, calling it \"kind of a boy talk\" that \"Access Hollywood\" host Billy Bush was encouraging."}]
