[{"comment_id":"978723315520750","commenter_b":"With photographs like that, she ain't no lady!","commenter_a":"too much hate toward this young lady. Racist white pigs","post_message":"It's the pool party that forced a police officer to resign...but the organiser has got a modeling contract out of it"},{"comment_id":"955856331137563","commenter_b":"Based on what I've seen it's because they are ugly and no man will take care of them.","commenter_a":"Why are liberal women unable to take care of themselves? Why must the liberal women depend on government for everything?","post_message":"To Jeb Bush and Republicans who don't think women's health should be a priority: You couldn't be more wrong."},{"comment_id":"10153401840176336","commenter_b":"idiot and she if she would have fell and killed herself, her family would be suing. Stupidity NEVER ends.","commenter_a":"To me the flag symbolizes opposing the fed. I think that unites me with a lot of those flying the flag. Blessed to have made it to south carolina.","post_message":"A woman was arrested after climbing the flagpole in front of the South Carolina Statehouse and removing the Confederate Flag. @webpagelink"},{"comment_id":"10154859326468487","commenter_b":"We don't know wtf is out there - we could be in a giant terrarium","commenter_a":"And most American Christians are whiney little bitches. They have some nerve to plagiarize the Jesus myth and then steal all the pagan holidays that revolve around the axial tilt of the earth, and then pretend they're persecuted.","post_message":"Even though some Muslims have been in the United States for longer than many of the Protestant and Catholic descendants of German, Italian, and Irish immigrants, most Americans still believe Islam is odds with American values and way of life."},{"comment_id":"10153977245641509","commenter_b":"Shirts for everyone!! If women can keep their shirts on, so should men.","commenter_a":"Yes","post_message":"This isn't just about decency, a CNN commentator writes -- it's a small exercise in democracy. What do you think? @webpagelink"},{"comment_id":"1736088283296773","commenter_b":"And women!","commenter_a":"Shout out to CFD and their brave men and women that r serving","post_message":"BREAKING: A massive fire is burning in Chicago's Lake View Neighborhood. At least 3 buildings are engulfed in flames. A BIG shout out to the CFD for their incredible work."},{"comment_id":"10153659427149087","commenter_b":"@username Yeah, I've been to a few strip clubs in my life. Good looks though don't mean a girl can perform.","commenter_a":"It's the old emperor with no clothes on eyesight ... The schmuck can't see. He can't even see that his wife is a little hoish, not just the adulterous sex while he was married to his prior wife, but the many pictures like the one I've got in my downloads of a Melania Drumpf doing full frontal nudity, with a wet soapy body, wet hair, seductive pout, and a hand over her crotch doing the two finger simulated insertion. Ha, he can see everybody else and their blemishes .... and talk about them ad nauseum in the most insulting and revolting fashion, but he can't see his naked self .. nor, ha, his naked wife.","post_message":"\"Wow, Corey Lewandowski, my campaign manager and a very decent man, was just charged with assaulting a reporter,\" Donald J. Trump tweeted. \"Look at tapes-nothing there!\" WATCH THE VIDEO HERE:"}]
