[{"comment_id":"10153659271788132","commenter_b":"Hope they keep her in prison for life!","commenter_a":"White trash!","post_message":"Awful."},{"comment_id":"10153566886509614","commenter_b":"Stupid girls!","commenter_a":"Looks like the liberated those caged pups. :)","post_message":"Two teen girls were caught on surveillance footage stealing two puppies who were still nursing and not yet ready to leave their mother, workers at a pet store in Compton allege. In the video, one girl can be seen leaning over a gate and grabbing a puppy while the other stands by. The alleged theft happened Thursday at Jazmin Pet Supply. this post to alert others. Watch KTLA video here: @webpagelink"},{"comment_id":"676191809238064","commenter_b":"I`ll say it agin, if the damn guns would stop shoten off there damn barrols!","commenter_a":"This father did not know his son was mentally ill and did not know his son was planning to commit mass murder with the dozen or so guns that unknown to this same father. This father is such a failure and out of touch with his son that his opinion doesn't count. He failed his son and now wants to put the blame some where else.","post_message":"The father of the shooter in Oregon just blamed guns for what happened. He must be out of his mind. This is a sick joke. Do you think his son is to blame?"},{"comment_id":"10153243727475667","commenter_b":"@username Ireland built America, because the locals were too lazy. Shall we continue with stereo types, girls?","commenter_a":"I assume none of you gun-lovin' yeehars will ever come over and visit civilised nations. Just keep your gun addiction fetish stateside, and you won't have a problem. Try and set foot outside of your bunker, and your shiny, highly polished barrels will be removed from you. And so your manhood shall be no more. Bless your cotton socks. :)","post_message":"You can now open carry at ticketing and baggage claim."},{"comment_id":"10153732172855575","commenter_b":"Hes a disgrace to the people who voted for him,, a disgrace to the GOP..WISCONSIN you need to send the rhino back to where he come form..","commenter_a":"Paul RyAn is a traitor plan and simple","post_message":"Report: Conservative Veteran may take on Paul Ryan"},{"comment_id":"10153916638559753","commenter_b":"Feed the gator Hillary and her pimp Obama kill that gator quick","commenter_a":"According to CNN the gator was a known Trump supporter and a life member of the NRA.","post_message":"News of yet another alligator attack has shaken things up in the state of Florida. A service dog named Precious has passed away after protecting her owner from being attacked by an alligator. Fox News reports the protective pit bill died after jumping in between her owner to save the man from an alligator attack in the southwestern portion of Florida. The alligator attack and death of this heroic service dog from Florida has prompted an inspect to determine whether or not the marina where... @webpagelink"},{"comment_id":"10154375998138145","commenter_b":"Some women get pregnant and have babies only to blackmail the father of the baby . 5 min sex with a crazy chick get you scrued for lifetime","commenter_a":"REVOKE her parent card!!! right now before anything happens to that baby. I will gladly adopt","post_message":"She got 2 months in jail, but could have faced 5 years in prison. The baby now lives with his grandmother."}]
