[{"comment_id":"1390855700937474","commenter_b":"RACIST!","commenter_a":"I can't imagine ever turning down an invitation to the White House no matter what! As an American I would consider it the highest honor!!! Can I go in his place?","post_message":"We know that Brady, Belichick, and Bob Kraft are friendly with President Trump. But one member of the Patriots doesn't seem so keen on going to the White House."},{"comment_id":"10154485862326037","commenter_b":"Sure, if you choose to believe the people in collusion with the election fraud.","commenter_a":"If you wanted unity, you should have allowed the voters to choose the nominee instead of allowing your corporate masters to do it.","post_message":"DNC chair Marcia Fudge calls for unity amid a chorus of boos and jeers from Bernie Sanders supporters: \"We're all democrats\""},{"comment_id":"1225422174190243","commenter_b":"Now you can tell her that our President likes to grab pussy's! You must be so proud.","commenter_a":"Well I personally am glad I dont have to wake up to another 8 years of Democrats!!!! Its a 2 way street. I felt the same way...Glad I didnt have to tell my daughter Hillary is our president. Time to get this country back and finally build a future for my daughter and family","post_message":"The CNN commentator appeared to choke back tears as he voiced concerns felt by many in a divided election."},{"comment_id":"10153564963769778","commenter_b":"Happy Birthday Andrew Thomas,thought you might like this. :D","commenter_a":"hahah xD oh i must watch i will feel the flow xD i know it!","post_message":"After reviewing dashcam footage, the Dover Police department in Delaware came across some interesting sights. \"We hope you enjoy this...and Taylor Swift, if you're watching...we're sorry.\""},{"comment_id":"1166206863447175","commenter_b":"Agree","commenter_a":"when did she say that? when her mother was running against him for the nomination?...can't think she said it recently...","post_message":"Americas Freedom Fighters"},{"comment_id":"1005120462832757","commenter_b":"and for that she deserves what amounts to life in prison?","commenter_a":"Ummm she took abortion pills and left her baby in a dumpster, then took herself to the hospital.","post_message":"\"What this prosecution makes clear is... abortion being recriminalized in America\""},{"comment_id":"1701770233407796","commenter_b":"The Muslims should start their own food chain. They could have whatever Muslim food they wanted. Then Americans could be outraged that they don't have cheeseburgers.","commenter_a":"I agree with these companys","post_message":"There is no reason why they should have to change their business for them. Do you support these food chains?"}]
