[{"comment_id":"924171167620224","commenter_b":"It has to be big for him to screw this entire nation. Very very sad.","commenter_a":"What do you think this administration has on Justice Roberts that would make him vote twice for a law that is unconstitutional...","post_message":"John Roberts again sides with Obama."},{"comment_id":"10157370446315354","commenter_b":"Let a woman kill them.","commenter_a":"Bring see how many get wiped out America is not afraid of you cowards","post_message":"As the ISIS cancer grows, the threat comes closer and closer."},{"comment_id":"1100137706687990","commenter_b":"Couldn't she have just not threatened him with scissors? Criminals need to be held to their actions","commenter_a":"Why were the police called? Where is the audio to the video? Why doesn't the video show the shooting? In the video, she is obviously advancing on the officer. And it doesn't matter how big the person is or what they have, a weapon is a weapon.","post_message":"If a 100lb woman makes you fear for your life, perhaps your to much of a coward to be a cop!!"},{"comment_id":"10153389361142061","commenter_b":"Lady Gaga, great job.","commenter_a":"Oh Yes She Did!!","post_message":"Lady Gaga absolutely crushed her performance of the national anthem at Super Bowl 50. @webpagelink"},{"comment_id":"10155996223940354","commenter_b":"Take their citizenship away and deport.","commenter_a":"Black trash","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS. Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"979742035426993","commenter_b":"Send this JEW to ISREAL , they don't Belong in the USA !!","commenter_a":"What an idiot and people are ACT voting for him","post_message":"COMMUNIST LUNATIC Bernie Sanders Just Called For Total Gun Confiscation! @webpagelink"},{"comment_id":"1118917194866740","commenter_b":"Thanks for stating this. I'm a follower of Christ and so glad you get it about Tebow.","commenter_a":"I'm not a Tebow fan, or a Florida Gators fan, or religious. But I never understood the hate directed at what seems to me to be a decent human being that threw his actions has shown hes willing to help anyone. Funny my fellow Athiest scream about this man \"shoving his faith in our face!\" Don't seem to mind shoving their Athiest views down everyone else's throat.","post_message":"\"The goal of this book was if you pick it up with your head down, you finish the book with your head held high knowing that God has an awesome plan for your life, you matter, and you're important -- and that's a bigger identity than anything that the world could ever offer.\" — Tim Tebow on his new book \"Shaken\""}]
