[{"comment_id":"515781365279110","commenter_b":"I wouldn't give any fucking nigger s dime fuck them blue gum peace of shit","commenter_a":"No way! It has been so long it did not personally affect them. Get over it, and move on.","post_message":"This state just approved a resolution which will require residents to compensate blacks for slavery. Everybody is looking for a handout. Slavery has been abolished for a long time. Do you think you should be required to compensate blacks for slavery?"},{"comment_id":"10153605782047522","commenter_b":"@username THE MORALS OF THE DEMOCRATIC PARTY AND IT'S FOLLOWERS HAVE RESORTED TO THE MOST LOWLY TO SPEAK IN PUBLIC...LENA DUNHAM SPOKE AT DNC CONVENTION. SHE ALSO WROTE A BOOK AND HEREIN IS A PASSAGE...NASTY...NASTY...GIRL...In the book, Lena Dunham describes an incident during her childhood in which she leaned down between her sister legs and spread open her vagina, saying the behavior did not alarm her mother and was the spectrum of things I did. At another point, she writes that she would try to bribe her sister with candy for a kiss on the lips, joking that a sexual predator might do to woo a small suburban girl I was trying.","commenter_a":"Not surprised. The media has been so bias lately, Clinton doesnt even need the DNC. She has the press. The hatred for this man by the media is astounding. The globalist and globalism will do anything, say anything, to remain in power.","post_message":"The latest in the polls:"},{"comment_id":"10154267425314160","commenter_b":"Another nasty woman on the side of evil...GOOD WINS","commenter_a":"and you are Madeline Not So Bright","post_message":"\"There is a great term the Soviets used to use.\""},{"comment_id":"747059155450198","commenter_b":"How would a little girl see a transgender's penis? In the female washroom, everyone uses a stall with a door that locks. The only way a little girl would see one is if a pervert walked in the washroom. A true transgender would not exposed himself unnecessarily.","commenter_a":"I don't think its a good idea. I'm not concerned with transgendered using the women's restrooms,. I'm concerned with a pedophile using the restroom to grab a child. Or a rapist using the opportunity to grab a woman. I don't know that either scenario will ever happen...but it could. When it comes to safety, I think we should make every effort to keep women and kids safe.","post_message":"ClashDaily.com"},{"comment_id":"10155736096870231","commenter_b":"Its not about the braids.....its about the #whitegirlsdoItBetter","commenter_a":"What is it called, then, when black women get relaxers to wear their hair straight?","post_message":"The young actress is making sure her comments about appropriation are taken seriously."},{"comment_id":"10157252417295354","commenter_b":"TRUMP...Build that wall!","commenter_a":"Ten accused, 3 convicted, 2 still not apprehended. One was going to use his \"Federal Education Aid\" money. Didn't see their citizenship status though. Planned to show ISIS how easily they can cross through our Southern Border. What say critics of a wall or temporary ban of refugees now?","post_message":"They're here."},{"comment_id":"10155495328191509","commenter_b":"@username you should be ashamed voting a criminal!!!","commenter_a":"Could we think less of him? Really, he's been in the public eye for 30 years. We know what he is and she is. I'm not voting for a person. I am voting for the economy, the Supreme court, and the best chance for the US.","post_message":"Garry Kasparov suggested that the Russians could possess information on Donald J. Trump that is at least as damaging as WikiLeaks releases have been for Hillary Clinton."}]
