[{"comment_id":"10154187969491615","commenter_b":"@username 99.9% could be prevented if the women had any morals....","commenter_a":"I hope everyone marching plans on adopting a kid or two. If your so concerned with the baby being born, you should actively participate in rasing it.seeing as the parents dont want to or they would have an abortion. So please sign up at the front entrance and take your unwanted child when you leave. Thanks for keeping kids outta foster homes and orphanages.","post_message":"This year is a historic one as Vice President Mike Pence is spoke during the march. It is the first time a president or vice president has taken part in the March for Life. _____________ UPDATE: (1:35 p.m.) The livestream has ended. Full story on.wpxi.com/MarchForLife"},{"comment_id":"10154769907171509","commenter_b":"But but, the Internet thinks for us so we don't have to!","commenter_a":"People need to start doing a little research. If @username (the actor) was dead, it would be on every single news outlet. And @username's wife (Jada) is darker than Raquel (who is lighter) Sad I have to edit my comment because people are getting bent out of shape.","post_message":"Before he died, Will Smith was part of an 18-month Executive MBA program at the University of Miami. His wife, who was shot in the legs during the attack that killed her husband, received it in his honor."},{"comment_id":"1584230838542469","commenter_b":"DEPORT the illegal bitch.","commenter_a":"WTF!?","post_message":"In Obama's America, obeying the law and playing by the rules is for suckers."},{"comment_id":"10153745927208635","commenter_b":"So did these heterosexuals just go about Christians with strong beliefs just to cause trouble? @webpagelink","commenter_a":"It is funny how LGBT people seem to go after christians with strong beliefs in this area just to cause trouble.","post_message":"Wyoming Supreme Court may dismiss Judge Ruth Neely for refusing to preform gay marriage due to her religious beliefs"},{"comment_id":"256901098085552","commenter_b":"So don't f with me I am from Louisiana I'll give u he'll and make ur ass cry like a baby are u still running don't say shot to me pat I won't say shot to u u ever meet a woman that hunt a allerigator I don't think so I can't hunt any thing we woman from Louisiana that hunt and fish are strong woman we don't take shot for nothing .","commenter_a":"Same could be said of Obama and his executive pen, but I didn't hear you snowflakes complaining then.....so why now? Because your criminal didn't win?.....boohoo! Get on with life.....you didn't see us doing the crap that is going on now when Obama was president......God help us......for 8 years. Quit crying and get on with it. I think Trump is going to do some great things for this country. Things that should have been done a long time ago......even before Obama came to be. I am looking forward to a better America....go get em Trump!!","post_message":"AMEN! This one is a MUST READ."},{"comment_id":"10154404367061037","commenter_b":"Get a life lady","commenter_a":"When trump loses I wonder what the trump voters that have outed themselves as racists and bullies are going to do, double down or deny it.","post_message":"Is Donald J. Trump's historic presidential run doomed to fail?"},{"comment_id":"10152807038616636","commenter_b":"Muslims are still a small minority in England. They may cause trouble, but they are controllable.","commenter_a":"Message to Islamlist functionalists.... don't fu**k with the British people...if you want war ....you have it !!!! We'll wipe you off the planet !!!","post_message":"Breaking: Isis have warned of ‘even bigger and more bitter’ things to come..."}]
