[{"comment_id":"10153660392802217","commenter_b":"Some of London does not speak for all of London.","commenter_a":"London didn't care when the rest of the U.K. Suffer so why should we care about london","post_message":"A mad half hour as \"Biblical\" rain hits London."},{"comment_id":"10156415559120354","commenter_b":"This woman.. Needs to be sent to a Muslim refugee camp ... What a sorry idiot ...","commenter_a":"Bill should be running for president","post_message":"“56% of Americans believe that the Syrian refugees have odds that are at values — their values are at odds with our values. That may not be wrong. If you are in this religion, you probably do have values that are at odds. This is what liberals don’t want to recognize.\""},{"comment_id":"1066274426802142","commenter_b":"I have $10 that says that first woman in that video doesn't know how to spell diligence.","commenter_a":"Just a bunch of ignorant fear mongers, there is much more violence fine by people that sound and look just like them than any Muslims within the states.","post_message":"Did Donald Trump alienate his supporters by calling for a ban on Muslims entering the United States? NBC News asked attendees of Trump's rally in South Carolina what they thought. Watch more: @webpagelink"},{"comment_id":"10152768793527377","commenter_b":"I am white and I criticize him because he is an nut. I voted for Obama twice and decry racism. Much of the criticism toward Obama was WAY over the top that NO white guy with the same basic Democrat policies would have faced. The fact that Snopes had to crerate a whole separate page dedicated to just the massive amount of fake viral emails smearing Obama and outright lying with claims so outrageous that any snae person would immediately question but Conservatives swallowed hoook, line and sinker because of their hateful, irrational, racist bias says it all","commenter_a":"He's a good man and could be a good leader , Vice President too!","post_message":"Black “mascot,” “court jester,” “minstrel show”? Tucker says about Dr. Carson."},{"comment_id":"10157007075205725","commenter_b":"#BOGOSale - FINAL CLEARANCE: Hypocrite Hillary AND Slick Willie = two for the price of one!! CLEARING THEM OUTt!! #TrumpTrain #MakeAmericaGreatAgain","commenter_a":"Trump versus Hillary, lets do this voters. We do NOT need Hillary (Obama) Clinton in the White House. Thanks Mr. Trump. Vote Trump...lets get him to Washington!","post_message":"So interesting that Sanders beat Crooked Hillary in Indiana. The dysfunctional system is totally rigged against him!"},{"comment_id":"10153287887659614","commenter_b":"Hahahaha @username you made me laugh lol but maybe that's what really happened to these girls too much d*ck sucking lol","commenter_a":"Sucked too many c...ocks ? lol","post_message":"A concerning new trend on social media shows young women trying to imitate the big-lipped pout of 17-year-old reality TV star Kylie Jenner of the Kardashian family. The so-called #KylieJennerChallenge requires suctioning one lips into a shot glass or bottle. Some young women are ending up with painful bruises, photos on Instagram and Twitter show. The challenge could result in injuries to nerves, muscles and trauma to the blood vessels, a plastic surgeon says. Read KTLA's story here: @webpagelink"},{"comment_id":"10152833954741051","commenter_b":"Here we go with those damn pit bulls again. They should be banned from the United States","commenter_a":"Show any dog love & they'll be loving..!! Shame on the owner for not providing that..!! Now a dog that could've been a great pet gets euthanized & the poor lady gets hurt. Lose/lose situation...","post_message":"This woman was taking part in the Ice Bucket Challenge in her backyard when, all of a sudden, all hell broke loose."}]
