[{"comment_id":"10154005218489749","commenter_b":"@username fool","commenter_a":"Galloway is a racist..anti-semite...he needs to be thrown out of any meeting of decent minds.","post_message":"\"This has ruined this evening, as far as I am concerned, it's disgusting,\" one angry attendee said."},{"comment_id":"10153754034371336","commenter_b":"JJ Smith ,any investigations on Hillary Clinton she has coming,nothing more than a lier and crook. Planned parenhood should get no more money until they no longer do abortions,I do believe in some abortions but not late term or in order to butcher infants to sell body parts! Not a fan of Obamacare and the IRS is corrupt as is the Justice Dept.It seems to me that most of the politicians these days on both sides of the isle are corrupt and should be replaced!","commenter_a":"FANTASTC and appropriate response.","post_message":"\"I kind of feel sorry for people who are so consumed with hatred and intolerance that they behave in that manner. I say we should pray for them.\" Today on \"FOX & Friends Weekend,\" 2016 presidential contender Dr. Ben Carson responded to an attack he received from GQ. @webpagelink"},{"comment_id":"10153036402924885","commenter_b":"excuse you? I am so sick of all that we went through when we brought the rams here, and they aren't that great a team to be trying to drum up public support for them again. If you're such a good fan, how bout you follow then to wherever they end up!","commenter_a":"Let 'em GO! Let 'em GO!","post_message":"Details of the plan for a new downtown football stadium were revealed today. Peacock called the project more than a football stadium: \"We are talking about a revitalization of our downtown.\" Take a look and let us know what you think."},{"comment_id":"10153685449009060","commenter_b":"They do. This, in itself, isn't a problem anymore than relying on other countries to buy your goods is a problem.","commenter_a":"Most of the British public are blissfully unaware of this worrying problem. They still think they live in a \"rich\" country.","post_message":"As warning signs flash across the global economy, Britain is a favoured bolthole for skittish investors. But there’s a flipside to this: the country’s huge current-account deficit. Time to worry?"},{"comment_id":"10153574217106509","commenter_b":"And she IS being a butthole!","commenter_a":"I don't know why everyone gets mad at someone's expression of an opinion. Opinions are like buttholes, we all have em","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"827089443993145","commenter_b":"First Lady??? Really","commenter_a":"Ignore ....WHAT A WASTE OF CIVILATION","post_message":"Is she serious?"},{"comment_id":"10155495328191509","commenter_b":"@username you should be ashamed voting a criminal!!!","commenter_a":"Could we think less of him? Really, he's been in the public eye for 30 years. We know what he is and she is. I'm not voting for a person. I am voting for the economy, the Supreme court, and the best chance for the US.","post_message":"Garry Kasparov suggested that the Russians could possess information on Donald J. Trump that is at least as damaging as WikiLeaks releases have been for Hillary Clinton."}]
