[{"comment_id":"10154355616737293","commenter_b":"He deserves a bullet.","commenter_a":"He looks like Gov. Christie","post_message":"The gruesome revelations are a stark contrast to Kohlhepp’s professional image. But details from his childhood hint at a deeply troubled individual."},{"comment_id":"480221218832838","commenter_b":"Kevin, if you look at Christine's profile, I would say all of her ancestors were not white... And you just backed up what I said about the white man thinking they could own the land. I believe that baffled the Natives. How could you own Mother Earth?","commenter_a":"Jesus WAS!!!!! A LIBERAL, you right-wing nuts!!!","post_message":""},{"comment_id":"10152968959637452","commenter_b":"Why couldn't she just get out?","commenter_a":"Who really believes that was a suicide? Smh..","post_message":"\"Get out of the car! I will light you up!\" Authorities have released dashcam video of Sandra Bland's arrest about a week after she was found dead in her jail cell. FULL VIDEO: @webpagelink The medical examiner ruled the Chicago-area woman's death a suicide, but her family believes otherwise."},{"comment_id":"10153365714833352","commenter_b":"Stupid bitch!","commenter_a":"Mental illness is real...","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"409789959202885","commenter_b":"@username SUCK ON AN ASS","commenter_a":"All you white assholes should walk in a black mans shoes for one day. It may just change your perspective about racism, and how black people feel in this country.","post_message":"Why the secrecy?"},{"comment_id":"970468323009697","commenter_b":"@username PLEASE vote for Hillary she is on her way out, just ask Biden, ask Obama, ask Bernie, ask the FBI. So plz do us a favor and vote for her, she will need something to read in jail and your voting ballot will be perfect.","commenter_a":"She might have a college plan but how could she do it from jail?","post_message":"How much could your family save with Hillary’s college plan? In Oklahoma, a family earning $75,000 per year could save $22,300."},{"comment_id":"10153090622101037","commenter_b":"It's not illegal to lie on TV !!! So why is it such a Problem?? The news media is pushing it off on Brian. Brian is representing the News Agency . Brian is not a field journalist the News Media gives the go ahead to spew out the lies of current events. What's on trial should be the publics Distaste of how the news media Ethics have been highjacked. Hopefully this is a eye-opener for most people.","commenter_a":"Who hasn't lied about something, he should still be reporting and if his rating dropped, then fire him.","post_message":"#BrianWilliams has been suspended from \"NBC Nightly News\" without pay for six months, the network announced. Yahoo News' Dylan Stableford reports. Do you agree with his punishment?"}]
