[{"comment_id":"1736640533224849","commenter_b":"What are the Muslims doing to make Christian's comfortable?????? We as Christiams MUST stand up for our rights.","commenter_a":"she is a fool! crosses belong in CHRISTIAN churches! maybe she needs to be a muslim preacher. shame on her for denying Christ!","post_message":"Bishop To Remove Crosses From Churches To Make Muslims More 'Comfortable' We are talking about a Church. This is ridiculous. Do you think society is becoming too sensitive?"},{"comment_id":"10153656714955575","commenter_b":"Well Baltimore is already torn up for them!!! Wonder what the blacks think about them coming.","commenter_a":"Obama is bringing Mexicans and Syrians in to train them. Terrorist that kill with weed whips","post_message":"Baltimore politicians defying logic once again. . . ."},{"comment_id":"10153267785502894","commenter_b":"Lol I knew I was gonna get somebody! Yes it does and that's why being faithful and protecting ourselves is so important! It's too many fake porn stars out here...","commenter_a":"I bet too many thots out here having unprotected sex 😏","post_message":"STD Rates Have Hit a Record High in the United States"},{"comment_id":"10154654026369160","commenter_b":"HOLLYWOOD ELITES..... TAKE DOWN YOUR WALLS AND YOUR GATES AROUND YOUR MANSIONS. We all want to have the right to walk onto your property, so that we can also enjoy the excessive good life that you live. We want to swim in your pools and relax in your hot tubs..... we want to sleep in your beds and wear your designer clothes.TAKE DOWN YOUR WALLS AND YOUR GATES!","commenter_a":"By the way the police had nothing to do with Nicole Brown and Ron Goldmans deaths. Awful nice of him in a past year how many officers lost their lives while just in their cars and were gunned down, 5 in Dallas protecting protesters against them, and 3 in Baton Rouge. Really thoughtful to attack the police which have been more of victims than offenders in this country.","post_message":"The director of \"O.J.: Made in America\" dedicated his Oscar to Nicole Brown Simpson and Ron Goldman, and then to \"the victims of police violence, police brutality, racially motivated violence and criminal injustice.\""},{"comment_id":"993063080750221","commenter_b":"Biden's coming in! you lose, Hillary.","commenter_a":"backwards is thinking that butchering a live baby in the womb is ok to do.","post_message":"In this week's Facebook Q&A, Hillary took on Jeb’s claim that Democrats use \"free stuff\" to appeal to minorities."},{"comment_id":"10153672150997217","commenter_b":"Watch your tongue","commenter_a":"Most muslims hate gays yet have no problem seeing a murderous paedophile prophet as a role model for all mankind? That's f***ed up I'm sorry but it is.","post_message":"BREAKING: The suspect for the mass shooting at Pulse Orlando gay nightclub is 29-year-old Omar Mateen, the BBC understands. It is believed the US citizen was not on a \"terrorism watch list\"."},{"comment_id":"10154739043556336","commenter_b":"Did you read her comment, Michael? Kapernick has his rights, we have ours. But our rights aren't as relevant?","commenter_a":"And yet again, we have the right to not patronize the NFL that allows players to disrespect our military, LEO and country.","post_message":"\"If you have the platform to speak up and you choose to do so, then that is your prerogative,” Derek Jeter said."}]
