[{"comment_id":"10156091694535725","commenter_b":"when was i a women? rockstar","commenter_a":"Mr @username has taken to personal invective again, this time mocking the appearance of the only woman in the Republican field, Carly Fiorina. This from a man who wears a tribble on his head","post_message":"I will be speaking at the #StopIranDeal rally shortly- watch live here-"},{"comment_id":"906483276114592","commenter_b":"Oh shut up Jindal you backward cretin. The world's views have changed and long overdue. I am glad to see that people can choose to marry whomever they want. We all live on this planet and all should be able to marry who they choose.","commenter_a":"Separation of Church & State! What part of that doesn't this fundamentalist christian rube understand?","post_message":"“I hold the view that has been the consensus in our country for over two centuries: that marriage is between one man and one woman. \" -Gov. Bobby Jindal"},{"comment_id":"10152478705626990","commenter_b":"I eat a lot of eggs too, but it's just about a dollar or less, so I don't really pay attention to the price increase.","commenter_a":"Eggs are one of the few inexpensive natural proteins ... I'm concerned that this is gonna hit poor families where it hurts the worst :/ just a thought","post_message":"EGG-SPENSIVE! A new California law mandating that hens get more room in their cages, means egg prices are likely to go up --> @webpagelink"},{"comment_id":"822097871159007","commenter_b":"Take it from a feminist, there is no wage gap. @webpagelink","commenter_a":"All wonderful.... now let's see if we can make \"being paid like a girl\" equivalent to being paid like a man!","post_message":"Maybe it's not a bad thing... (h/t United Humanists) Do you consider yourself a feminist? Let us know: @webpagelink"},{"comment_id":"497839773741528","commenter_b":"SO TIRED OF THE MUSLIM'S THINKING THEY CAN TELL US HOW TO LIVE IN OUR COUNTRY,,,,,,,THIS IS AMERICA NOT THE MIDDLE EAST......LEAVE AND TAKE YOUR MUSLIM BROTHER OBAMA WITH YOU...........","commenter_a":"@webpagelink I am a proud American, but this is a false story that is meant to instill false patriotism, and sadly by these comments it has worked.","post_message":"Muslim picks fight with patriotic cashier, and then this happened. If you don't like our country's flag, you don't have to live here. Can we get 35,000 'LIKES' for this patriot?"},{"comment_id":"1581294075496417","commenter_b":"Kiss my white ass","commenter_a":"If we give them reparations will they go to school and get a job and stop whining?","post_message":"BREAKING: Obama Just Announced That He Will Be Forcing You To Compensate Blacks For Slavery. Never in a million years. That is old history. Will you compensate blacks for slavery?"},{"comment_id":"10156122375765354","commenter_b":"Wow!!! She had to be real high.","commenter_a":"I am not going to make a pun about a bang.","post_message":"Her mugshot says it all."}]
