[{"comment_id":"10154014597174203","commenter_b":"Lise stfu","commenter_a":"How about a story on the hundreds of black-on-black murders in Chicago every year...","post_message":"He planned to bomb black churches and Jewish synagogues."},{"comment_id":"10153216503482507","commenter_b":"I guess the gloves are coming off, the fourth reich is just about ready to emerge. When is that wall to Mexico scheduled?","commenter_a":"Evil","post_message":"Wow. Just wow."},{"comment_id":"874881595880596","commenter_b":"Doesnt matter what they get The blacks or most of them would whine and complain about something!","commenter_a":"Lets just go back to the old days of segregation if that's what they want and they all can ride in the back of the bus","post_message":"“Whites Not Allowed” This is the public education system in Obama’s America."},{"comment_id":"1152993574758066","commenter_b":"Trump is the person this country needs. He is not a politician, he is a hard nosed businessman. The borders should have been closed a long time ago, illegals need to go, refugees need to find another country to bleed for free stuff. I am so sick of the politically correct government we have now, none of them have common sense. After 9-11 we should have turned that place into a parking lot just like we did to Japan during ww2.","commenter_a":"Anyone who plans on voting for that lying, cheating, snake called hillary just needs to stay home. She should be on her way to prison for the email scandal and benghazzi. This proves that government is fixed. Besides nobody wants to see bill again ( he don't even know what sex is).","post_message":"Michelle Obama says she wants a president who knows issues \"cannot be boiled down to 140 characters.\""},{"comment_id":"10152694220270736","commenter_b":"She doesn't have a soul.","commenter_a":"I'll be dead because of you then crashing sounds pretty intentional to me. How this person can even consider entertaining not guilty is beyond me. May the terror and the guilt of this tragedy eat her soul.","post_message":""},{"comment_id":"714166885416447","commenter_b":"Most evil woman on the planet","commenter_a":"Only Crooked Hillary -she has to be the worst possessed women in the world of power and money -remember when they left the White House they were broke -now worth 250 Million-go figure","post_message":"A troubling taste of how the Clinton machine operates..."},{"comment_id":"1177291819033735","commenter_b":"Boy that was a huge crowd! 😂","commenter_a":"Good for you, kid!","post_message":"WATCH: A kid yells \"you suck\" at Ted Cruz. More here: @webpagelink"}]
