[{"comment_id":"1284242998285633","commenter_b":"Proving they are not protesting anything really. They are just out to murder anyone they can for fun! Thugs paid for by Soros, Clinton's, Obama and others wanting one world government. Just like the Nazi regime but it will be 10 times worse. Liberals are too stupid to realize that. Until something they voted for creates a bad situation for them. Then they blame everyone else.","commenter_a":"That is really beneath everyone.","post_message":"So basically, this is incitement to murder and cops should treat them accordingly...what should they do?"},{"comment_id":"1079778352065591","commenter_b":"She is cum bumb","commenter_a":"Hillary may be her Girlfriend!","post_message":"Talk about condescending!"},{"comment_id":"1009873989035649","commenter_b":"Is this bitch right about anything she should go back into hiding","commenter_a":"FAIL!!!","post_message":"Joy Behar calls out Carly Fiorina. Is she right?"},{"comment_id":"10153181655947452","commenter_b":"Said the hipster wannabe as he hangs out at Starbucks thinking it improves his social status.","commenter_a":"Anybody who goes to Starbucks is an idiot. At Christmas or any other time of year.","post_message":"#MerryChristmasStarbucks: Starbucks' new design for its iconic red holiday cups has some customers feeling less than cheery, with one man saying the company \"removed Christmas from the cups because they hate Jesus.\""},{"comment_id":"1798977096981448","commenter_b":"What stupid woman do you think orange head is going to grab your thing and you're so happy","commenter_a":"No I believe Clinton was way worse then Tump with rape and the White House incident-- really!","post_message":"SHARE THIS and FOLLOW US at Reverb Press and Stories That Resonate <<<"},{"comment_id":"10152826258466051","commenter_b":"I hope the bitch gets life","commenter_a":"Got what you deserve","post_message":"First she stole this cancer-stricken man’s dog. Then she had him euthanized."},{"comment_id":"10154933648690695","commenter_b":"Stay in your lane lady","commenter_a":"I keep saying this and I will say it again ... why arent people protesting their brothers killing each other every night? Where are the Black lives matter groups? Or is that just when it involves a white man or police officer because I'm confused. I'm pissed that this man can't even go out in Atlanta to celebrate his new job! Why arent more people mad about this???!!!! Please tell me. They should have been looking up to this man for having his priorities straight! #alllivesmatter #theviolencehastostop #getyourneighborinorder","post_message":"Mitchell Mormon Jr. was celebrating a new job when police say someone shot and killed him."}]
