[{"comment_id":"1046767232087074","commenter_b":"@username I know that - he promoted that they would all go back intially and has since changed his agenda. He announced it more or less on Hannity last night - please read the comment again. There are AT LEAST 11.5 of illegals in the nation who would not be classified as criminals. And even tho \"they would not be given citizenship\" who does not know the Left's MO - of course the left will push for voting rights. The Left needs an underclass to stay in power. They are building the numbers year after year of voting blocs to keep themselves in power!","commenter_a":"So you are going to let the 11.5 illegals stay in the nation. You say they will not be given citizenship. You must know that most of us on the right are not stupid by now, right? The Marxists will push for their voting rights anyway - and get them w/a song and dance. And there goes the nation. We will never get her back - ever. The Left is delighted. They did it. They stacked the nation in their favor. WHY do you think the wall was never built? RIP USA.","post_message":"Will be on #Hannity @ 10pE on Fox News - discussing various subjects including immigration - if elected, we will #BuildTheWall & enforce our laws! Tune in - as Donald Trump Jr. Joins me with other special guests!"},{"comment_id":"10153471802056336","commenter_b":"It's a woman's choice regardless Patricia","commenter_a":"And is a distortion of the truth. No body parts were offered for sale. This is a complete propaganda that Ted Cruz is too stupid to know to avoid. Dumb canuck.","post_message":"\"These tapings of Planned Parenthood selling body parts are grotesque. It highlights the evil of what they're doing.\" – Sen. Ted Cruz"},{"comment_id":"10153944897553132","commenter_b":"God bless you and your family","commenter_a":"Prayers are coming","post_message":"Our hearts go out to Criss Angel and his 1-year-old son, Johnny."},{"comment_id":"10154522869261051","commenter_b":"The only thing Melania will do as first lady is give free head and hand jobs","commenter_a":"He can't handle being President is a joke just like his supporters he is being a reality show president","post_message":"This is not what Donald Trump wanted to hear today."},{"comment_id":"10154221931919199","commenter_b":"Idiot woman.","commenter_a":"At 44, she needs parenting classes! Did you read she's been stopped before for this! Someone call CPS for endangering a child!","post_message":""},{"comment_id":"10154836011454641","commenter_b":"Muslims should be exterminated..ambassadors of evil!","commenter_a":"And now he funds terrorism, giving weapons to the same people that have just been found to of made a mass grave in Aleppo of civilians. Scumbag.","post_message":"He was broke after running a losing campaign, his credit card was declined and he was quickly losing hope on pursuing a career in politics."},{"comment_id":"832838423431849","commenter_b":"She won't be in the White House.","commenter_a":"A-hole","post_message":"Say WHAT?!?!? In remarks today to the South Carolina Democratic Women's Council, Hillary Clinton says \"You're not going to see me turn white in the White House!\""}]
