[{"comment_id":"10155037977401509","commenter_b":"Hillary basically said hey let's use intelligence to figure out where they are coming from. Trump just wants to get the military involved and kill them all.","commenter_a":"Both called for war so what's the difference? Obama's the one who's weak. Ms. Clinton is a savage compared to Obama and Trumps Attila The Hun lol","post_message":"Donald J. Trump and Hillary Clinton struck different tones following the attack."},{"comment_id":"821899111236478","commenter_b":"My wife would have really liked you","commenter_a":"I believe in god, i believe there is something good and benevolent surrounding all of the miracles of life....... I believe we all have a connection to god, and that means every, single, last, one of us........ No matter what race, color, sexual orientation, or faith. I refuse to believe god (a being of pure benevolence) would ever discriminate....... I believe god is the personification of good in people.... If you are gay, atheist, and black, and are someone who does good, you are far closer to god than someone who is straight, catholic, and white and spend your life discriminating and spreading hatred to those around you..... It's time to grow up, to live and let live, and to try to lead a life of compassion and understanding rather than judgement and contempt. People will be different, but people with good souls, deep inside, are always aligned, we are ...","post_message":"Share if you agree. Image by Occupy Democrats"},{"comment_id":"804935616266161","commenter_b":"will the ACLU take up a case for violation of free speech?","commenter_a":"Floridians voted for him. Too bad the smart ones got him too.","post_message":"Governor Rick Scott is committing political malpractice. Parts of Miami Beach are already sinking into the rising ocean. Read more here: @webpagelink Image by Occupy Democrats."},{"comment_id":"897818090261432","commenter_b":"Put her in jail!","commenter_a":"Go straight to jail. Don't pass go.","post_message":"Which Hillary Clinton scandal is bigger? Is it the one involving her likely illegal secreting and destruction of email records from her time as secretary of state, or is it the one involving the massive conflict of interest she wholeheartedly embraced by using her family’s nonprofit foundation to collect millions of dollars from foreign government donors — again, during her time as secretary of state? @webpagelink"},{"comment_id":"10152536753022377","commenter_b":"Pay back is hell Nancy you POS witch..","commenter_a":"tell pelosie to fk off s hes disguisting pos let pic cotton","post_message":"Trending Now..."},{"comment_id":"10154150775406636","commenter_b":"The House of Lords are having this overturned? Since 2005 The House of Lords do not have the authority to overturn a court decision. The highest court in the UK is now the Supreme Court.","commenter_a":"the country voted that Judges are tw@s...but the house of lords are having this overturned..","post_message":"More follows"},{"comment_id":"1077965912287650","commenter_b":"What policy? The only policy she had was to make money for herself!!!","commenter_a":"HILLARY IS DISTURBING","post_message":"...says the Benghazi butcher and the woman who transferred 20% of all U.S. uranium (the stuff used to build nuclear bombs) to Putin's Russia as 9 investors in the deal funneled $145 million to the Clinton Foundation."}]
