[{"comment_id":"1180266452035470","commenter_b":"@username... Exactly! They're just drugged and/or drunken hoes.","commenter_a":"I FEEL YOU SHOULD HAVE A LIMITED AMOUNT OF KIDS IF YOU ARE ON WELFARE.","post_message":"WHOA! This judge goes off on this arrogant and ungrateful mother of 12 kids who has gotten a ridiculous amount of freebies from the state. What this mother says will disgust you. Can we get 2,000 'LIKES' to take back all the benefits this ungrateful moocher has gotten?"},{"comment_id":"10153501793088837","commenter_b":"I don't care that they kissed but I think all PDA should be refrained. I won't do it in public and I don't like it when straight people do it. Save for privacy of your home. I don't mind seeing a quick kiss, but the groping is nasty.","commenter_a":"keep your private life private... and when you go to a different place be modest n respectful..carry yourselves accordingly","post_message":"UPDATE: Jordan Schaeffer still hasn't recovered from his Miami vacation when he and his boyfriend were beaten at a BK Whopper Bar in Miami Beach after they kissed."},{"comment_id":"1508488155837876","commenter_b":"Kelli Foltz-Daniels the Bkacks","commenter_a":"Because Latinos live off the welfare system. When you start talking jobs, they tend to get pissed off thinking your gonna take away their government funds","post_message":"Nearly 80 percent of Latinos have a negative opinion of Trump."},{"comment_id":"10154478022181973","commenter_b":"I was looking at the protest videos of the inauguration and in a couple of clips I saw ppl with anarchists gear on vandalizing those businesses so I don't like it when the media on both sides of the aisle says it's only one group causing something.","commenter_a":"I WANT A ANSWER LIBERALS. WHY HIDE YOUR FACE? I BET I WON'T GET ONE.","post_message":"During the \"Not My Presidents Day\" rally, bike-mounted officers pushed the crowd out of the street and a standoff ensued, with police in riot gear keeping the protesters to the sidewalks. Then, as the protesters stood by and chanted, police charged in and grabbed several people, dragging them from the crowd before they were handcuffed and put in waiting police vans. Read more here: @webpagelink"},{"comment_id":"10153515610223984","commenter_b":"Tough shxt! If you want Muslim crap, go back to the sand fleas, get the hell out of America!","commenter_a":"If I was to go to another country would they change their laws for me change their religion.. NO THEY WOULD NOT!! SO WHY ON EARTH WILL AMERICA CHANGE WHY !! GOD FORGIVE AMERICA FOR THEY RE GOVERNMENT IS STUPID!","post_message":"I have to admit, I was quite startled when I saw these numbers. It seems that a real problem could be brewing... Is Sharia law in America a major concern of yours?"},{"comment_id":"10153373946241833","commenter_b":"HE is a mental defective!","commenter_a":"he can leave anyday and take his moron buddies with him.","post_message":"The chairman of the Senate Judiciary Committee wants Attorney General Eric H. Holder Jr. to explain why a Department of Justice gun ban list has a defective category consisting almost entirely of names belonging to military veterans and their dependents. disturbing to think that the men and women who dedicated themselves to defending our freedom and values face undue threats to their fundamental Second Amendment rights from the very agency established to serve them, Sen. Chuck Grassley, Iowa Republican, said in a statement Wednesday."},{"comment_id":"10154607888371729","commenter_b":"What does carrying has to do with this?","commenter_a":"People wanna stop going to target bc of this but still eat chikfila after its owner gave a 100,000$ donation to thelbgt community months ago but still eat there what's the difference hypocrites","post_message":"Target just received a serious dose of reality..."}]
