[{"comment_id":"1228480800579306","commenter_b":"also don't worry about the food, mods gave another interesting fact Eagles do not waste food they will eat it!","commenter_a":"Watching from Buckley Michigan","post_message":"SNUGGLE TIME: Fuzzy eaglet is snuggling as lunchtime approaches! VIDEO: Southwest Florida Eagle Cam"},{"comment_id":"10156019875440354","commenter_b":"Then lets deport them when they cause trouble!","commenter_a":"Why not? So should Italian Americans.","post_message":"Say what?"},{"comment_id":"10154001146333598","commenter_b":"Give me a chance at her murderous body!","commenter_a":"Shame on you.","post_message":"This Abortionist Flies in to Planned Parenthood to Abort 31 Babies Every Day"},{"comment_id":"10153160273727217","commenter_b":"Sorry if that last comment offended anyone.","commenter_a":"Does EVERYONE in Britain get offended by EVERYTHING?","post_message":"\"It brings back trauma for everybody who was attacked by a shark.\""},{"comment_id":"1015377538499586","commenter_b":"Once they gain a hold in our political system does anyone think they won't usher in Sharia Law? Incompatible with our Democratic Republic!","commenter_a":"When Islam got started it destroyed what was decent in the Middle East. It's incompatible with anything.","post_message":"\"Do you think, fundamentally, Muslims from the Middle East are incompatible with American democracy?”"},{"comment_id":"10154524451224885","commenter_b":"I will guess her assets will be liquidated to pay the girls back.","commenter_a":"Serial killer.... I called it the day it happened. I hope those little girls in Troy get a pay out from the insurance company for their mothers life insurance now!","post_message":"BREAKING: A prosecutor filed charges of first-degree murder and armed criminal action Tuesday against Pamela Hupp in last week's killing of Louis R. Gumpenberger at her home."},{"comment_id":"10152960138411051","commenter_b":"Good woman","commenter_a":"I would do that too. He deserved to be punished for that horrible incident. Great mom.","post_message":"As soon as this teen's mother saw the pictures that were being circulated, she immediately grabbed him and dragged him to the police station."}]
