[{"comment_id":"1183171455046239","commenter_b":"Who is she to decide who the child should live with","commenter_a":"I just read another story that he had reversed his decision, probably due to pressure from above.","post_message":"SOUND OFF: Judge believes a child is better off with a heterosexual couple."},{"comment_id":"933409340029740","commenter_b":"Go back to Mexico we don't want you here","commenter_a":"She's just sorry she got caught and is afraid that her American-bashing, honest statement that was caught on-tape will ruin her career...as it should! She's nothing!","post_message":"Pop star Ariana Grande has issued a second apology, this time on video, after being caught on camera saying she had \"hate\" for America. \"I feel like the apology I posted, I kind of missed my opportunity to actually sincerely apologize...\""},{"comment_id":"10154003076373812","commenter_b":"Actually women STFU if you can't take the heat dont attack....he has just as much right as her","commenter_a":"When it comes to women, Donald should just STFU.","post_message":"Donald Trump ramps up his attacks against Hillary Clinton and former Pres. Bill Clinton: \"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!\""},{"comment_id":"10153262054135779","commenter_b":"It's funny cuz it's true.","commenter_a":"\"...MTV then responded by phasing music out altogether over the course of the next few decades, essentially defeating the entire point of why they're there in the first place.\"","post_message":"In 1983, while promoting 'Let's Dance,' David Bowie takes the then two-year-old network MTV to task for playing virtually no videos by black artists. Watch the amazing interview below."},{"comment_id":"10153491120417869","commenter_b":"How ironic, mike; YOU are the one that's \"done\". You know what I'm talking about. This was your swan song, buddy.","commenter_a":"All Presidents are natural born to eat the dirt and breathe the air within USA soil ONLY!!! President\\tDOB\\tPlace of Birth George Washington\\tFebruary 22, 1732\\tWestmoreland County, Virginia, British America John Adams\\tOctober 30, 1735\\tQuincy, Massachusetts, British America Thomas Jefferson\\tApril 13, 1743\\tShadwell, Colony of Virginia, British America James Madison\\tMarch 16, 1751\\tPort Conway, Virginia Colony, British America James Monroe\\tApril 28, 1758\\tMonroe Hall, Virginia, British America John Quincy Adams\\tJuly 11, 1767\\tBraintree, Province of Massachusetts Bay Andrew Jackson\\tMarch 15, 1767\\tWaxhaws border region between The Carolinas USA Martin Van Buren\\tDecember 5, 1782\\tKinderhook, New York United States William Henry Harrison\\tFebruary 9, 1773\\tCharles City, Virginia Colony, British America John Tyler\\tMarch 29, 1790\\tCharles City County, Virginia United States James K. Polk\\tNovember 2, 1795\\tPineville, North Carolina United States Zachary Taylor\\tNovember 24, 1784\\tBarboursville, Virginia United States Millard Fillmore\\tJanuary 7, 1800\\tSummerhill, New York United States Franklin Pierce\\tNovember 23, 1804\\tHillsborough, New Hampshire United States James Buchanan\\tApril 23, 1791\\tCove Gap, Pennsylvania United States Abraham Lincoln\\tFebruary ...","post_message":""},{"comment_id":"10153171636986756","commenter_b":"Trust me, women are interested in computer science. The brogrammer culture is very offputting.","commenter_a":"Considering that there were more women in computer science back in Turing's day than there are now?","post_message":"There are fewer women in fields where genius is a perceived prerequisite, a study finds. Does the stereotype of the male \"lone genius\" in art have an impact?"},{"comment_id":"10154248904966337","commenter_b":"You ladies are making me think I'm being an asshole for the right reasons","commenter_a":"Stop this goddamn decimation of his character. Millions of us live with chronic pain every day.. Even if he was on painkillers so fucking what. Even if he possibly overdosed, it doesn't fucking matter. He was still a prodigy a musical genius. These post mortem aqusations are nothing more that cheep attempts at gathering attention for your shitty fucking attempts at journalism, and you should be fucking ashamed at your lack of talent and mortality... Fuck you","post_message":"OH NO: New details emerge regarding the death of #Prince."}]
