[{"comment_id":"822966724405417","commenter_b":"Does anyone that says she was young and dumb and made a MISTAKE? THIS WOMAN WAS IN HER T H I R T I E S. The ones that are saying must not know this. So, therfore, there is no forgiveness and she will always be a TRAITOR PERIOD!!!!!!!","commenter_a":"The photos were not the biggest mistake. Her biggest mistake was even going over there.","post_message":"Jane Fonda has changed her tune. She apologized for her Vietnam photos. What do you think? Better late than never, or too little too late? Should she be forgiven?"},{"comment_id":"1008136642595139","commenter_b":"Not hardly! Idol contestants bring all they've got and lay it all on the line. \"What you see and hear IS what you get\", so that makes it easy to vote for the best. Presidential Candidates. ...... What you see and hear isn't always what you get which makes it very difficult to vote for the better of all the evils.","commenter_a":"I think Obama doesn't have a clue. He thinks we live in a world full of unicorns and rainbows","post_message":"In the unexpected opening act, President Barack Obama said he thinks voting for president \"should be almost as easy as voting on 'American Idol.'\" What do you think?"},{"comment_id":"1446844205342023","commenter_b":"She needs to STFU!!!","commenter_a":"Why publicly, tho? 😡","post_message":"This woman has some nerve...."},{"comment_id":"1006685692721909","commenter_b":"hahaha, that's not what i had in mind! Just thought it was cool!","commenter_a":"@username Ali Sharp cool concept","post_message":"This is wonderful <3"},{"comment_id":"10155152380736337","commenter_b":"\"I'm an idiot who has never read a book or even been in a bookstore but I fo sho is gonna post on Facebook all day and show those educated peoples the what for!\" And she says to get a life?","commenter_a":"I literally just had to google who J.K. Rowling is. This person has ZERO impact on me. I find it hilarious that these \"celebrities\" think that they impact our lives in any way, shape and/or form.","post_message":"BURN: J.K. Rowling's latest tweet-spree took no prisoners..."},{"comment_id":"10153065116958984","commenter_b":"He does it for money, he don't give a damn about the Blacks on the street shooting there brothers and sisters or he would be here trying to straighten them out. But let a white or police officer doing the shooting and he will be there starting trouble. He is pregistist .","commenter_a":"This guy is a real Jackass","post_message":"Seriously Al? You must be joking... Is it about time for Al Sharpton to give it a rest?"},{"comment_id":"10154248071539714","commenter_b":"@username seriously what does being white have to do with anything.","commenter_a":"Isn't that discrimination? I mean I don't care. It could be a good thing. But with all the political pc going around. This is discrimination compared to what liberals say","post_message":"A former Uber driver and his wife are launching an alternative car service for female passengers only. (via Good Morning America)"}]
