[{"comment_id":"10153795049694199","commenter_b":"I thought he was dead....ooopps","commenter_a":"April fools","post_message":""},{"comment_id":"1129911067026242","commenter_b":"Well said my friend....well said!! Megan Kelly WILL tear them apart...no doubt about it!","commenter_a":"Oh trust me they are in for a rude awaking during this interview. Big mistake if they think it will be a walk in the park. Megyn Kelly will rip them a new one. She is awesome at her job and takes no prisoners. Fox News is the only station not on Obama's payroll. ( not that this has anything to do with him) but it's the only news station were you can expect to hear the truth!!!! Love Megyn and Fox!!","post_message":""},{"comment_id":"1137409276317081","commenter_b":"Hillary threatened by a female!? The Republican Party just makes me laugh!","commenter_a":"Hillary Clinton threatened by Melania??? lol give me a break.","post_message":"\"It's just another example of... when Hillary Clinton is threatened by a female, the first thing she does is try to destroy the person\": Donald J. Trump's campaign manager Paul Manafort addresses allegations that Melania Trump's #GOPConvention speech was plagiarized @webpagelink"},{"comment_id":"1076303882387835","commenter_b":"Stoooopid bitch! ! ! ! ! ! !","commenter_a":"Folks, QUIT talking about her, just let her fade away to hell.","post_message":""},{"comment_id":"10154407674347756","commenter_b":"Muzzie lover go eat crap","commenter_a":"key word temporary oh maybe we republicans should go burn a few cities down now too and a few police cars right! Hmnnn oh thats right we like law and order imagine that.. Good things take time go TRUMP go we have your back...","post_message":"A Federal Appeals court Thursday evening ruled against the Trump Administration’s controversial transportation order, upholding a district court judge’s ruling to block the order."},{"comment_id":"10153432042256051","commenter_b":"Those poor people deserve a better life I heard they throw their children in the garbage because they're girls","commenter_a":"Taking misogynists whose lives revolve around subjugation of women is a bad idea. Honor killings and selling daughters are both illegal in America. Thank God.","post_message":"Here's why President Obama says accepting Syrian refugees is the ultimate American thing to do. Do you agree with his message?"},{"comment_id":"10152643081825496","commenter_b":"Sadly, it's the day and age were in. My mother died of ALS in June 1973 but was in the hospital and out many times and was never denied care. In fact she spent the last 3 months of her life in the hospital and had her nightly beer with my dad. Hopefully at some point in time they will get it figured out but sadly will probably not happen in my lifetime.","commenter_a":"That's exactly how they work. They deny, deny, deny until the person /family gives up hope. It is terrible how these people can get away with stealing/withholding money that these precious people put in and need.","post_message":"A few weeks ago, 11Alive shared the moving story of 42-year-old Melissa Kern. She had been battling ALS for almost a decade, and had reached a point where she could only move her eyelid to communicate. While she fought the disease, her husband Chris struggled to pay the bills, getting nothing from Social Security for disability benefits. Bill Liss 11Alive took on the case. They succeeded. Tragically, it was too late. See more: @webpagelink"}]
