[{"comment_id":"10154727217281037","commenter_b":"When your cat was grabbed, am sure you did not mind. Trump is an insult to humanity.","commenter_a":"He is a low class guy with money.","post_message":"Melania Trump defended her husband, saying the vulgar remarks were not reflective of him and that she had accepted his apology and hoped others would, too."},{"comment_id":"10153910972008812","commenter_b":"it should be 25 to life","commenter_a":"He's gonna be getting plenty of footlongs where he's going lol","post_message":"JUST IN: Ex-Subway spokesman Jared Fogle sentenced to over 15 years in prison after pleading guilty to child pornography charges."},{"comment_id":"1792973144264831","commenter_b":"Come on Virginia We all know that Donald Trump is going to be president so let's rally behind him","commenter_a":"Those who vote for Crooked Hillary, are also crooked with a hidden agenda! TRUMP 2016!","post_message":"Terrific news in Virginia. Thank you for your tremendous support! I have a lot of amazing memories in Virginia - and I look forward to campaigning with you in the general!"},{"comment_id":"10150791998559999","commenter_b":"They are thieves!","commenter_a":"The cable industry as a whole is pretty much a monopoly. #Comcast","post_message":"In an unusual step, President Obama singled out cable set-top boxes as an outdated symbol of corporate power over consumers."},{"comment_id":"10154996363431337","commenter_b":"We have a incest pedohpile leading USA. The ignorants have come out from their caves.","commenter_a":"At least he'll bring back jobs!- every ignorant trump supporter.","post_message":"Donald J. Trump really shouldn't be tweeting about nuclear weapons..."},{"comment_id":"539787562878490","commenter_b":"Send Them back to their sand pile home, get them out of this country!","commenter_a":"Why were they even there watching if they didn't like it","post_message":"Furious Muslim students rush stage during American Sniper showing. They have no respect. If they don't like American Sniper they can leave. Do you agree these Muslims are out of line?"},{"comment_id":"10152947208161336","commenter_b":"There's a chic that would still date this guy, that's news!","commenter_a":"He proved himself to be an a** years ago.","post_message":"Lance Armstrong crashed his SUV into two parked cars after a night of partying and then let his girlfriend take the blame, according to police."}]
