[{"comment_id":"10153224960603984","commenter_b":"oh boo fuckin who leave bitch and take your husband with you","commenter_a":"She's out of touch on everything!!","post_message":"People are furious, and I can understand why. Do you think Michelle is an out of touch First Lady?"},{"comment_id":"10156946534115093","commenter_b":"Hillary will trounce Trump because 70% of voters dislike Trump. That's the math.","commenter_a":"Ya use your own mind governor vote trump don't be an establishment governor. Trump is who the people want.","post_message":"Governor Mike Pence should exhibit the leadership that conservatives have come to expect from him."},{"comment_id":"586245841541886","commenter_b":"Murders need to go to prison!!!","commenter_a":"Thank you Dr Carson","post_message":""},{"comment_id":"10153637464097377","commenter_b":"@username That's lame .The females in my family would not let it go for 10 seconds much less 10 years .","commenter_a":"10 years ago? It's not that I don't believe it, but you wait 10 years to report . Does not sound kosher .","post_message":"BOMBSHELL: Megyn Kelly has accused Fox News Chairman Roger Ailes of sexual harassment! New York magazine reports that Ailes has until August 1 to resign or be fired. Read the story: @webpagelink"},{"comment_id":"10154770811534411","commenter_b":"come on now David, gotta bring the muslims into it. Bet your a fucking Tory, or one of those ukip nazis. Away and take your face for a shite","commenter_a":"@username being one of media that show Russia is not a problem in Syria after its jets bombs and kill thousands of women and children,Killing by bombing is still an act of terrorism and should not be favoured,just fool those who see one side of the coin and they dont want the truth to prevail","post_message":"'There is a hysteria which is being organised by politicians and the media against Russia to see Russia as the only problem in Syria'"},{"comment_id":"10153675678941037","commenter_b":"I always thought I was a billionaire on Fridays, but by Monday reality always let me know otherwise.","commenter_a":"Hey John J. Reardon check out this guy disrespecting the Marines !","post_message":"From the upcoming Donald J. Trump biography"},{"comment_id":"10153827416061438","commenter_b":"Lol...really?She may be a whackjob but looks wise, she is a stunning women.","commenter_a":"It was pitiful and tragic to watch and it was clear that she is a desperate, washed up, narcissistic, actress whose looks are fading and relies upon her melodramatic sexuality rather than any improvisational or theatrical skills. Her girl, delivery was worse that the sound of a dentist drill and it was more emetic than aphrodisiac. The audience was truly stunned , as if they were witnessing the senile ego of a down and out prostitute consumed, devoured, by her own inflated ego turning tricks in the parking lot. Her exaggerated performance wreaked. It almost seemed cruel to not instantly cut to a commercial. It was truly wretched. Mr. Ed pissing on stage would have been a great improvement! And I sure that horse is dead!","post_message":"If you were left scratching your head, here’s a quick explanation."}]
