[{"comment_id":"1603692309937131","commenter_b":"Hillary got 2 million more votes. Americans REJECTED TRUMP","commenter_a":"\"Why are you really doing this?\" Despite the many rumors swirling on the Internet, the Stein/Baraka campaign genuinely believes in the power of grassroots democracy. Independently funded candidates like @username cannot stand a chance if our electoral system is rigged in favor of establishment, corporate-funded candidates. The evidence so far shows it is easy to hack many voting machines being used in elections. Aside from conducting a recount, we advocate Ranked Choice Voting and federal campaign financing, just a few solutions put forth by the Green Party in it's six-point plan for grassroots democracy. The Green Party Platform, which calls for \"publicly-owned, open source voting equipment and deploy it across the nation to ensure high national standards, performance, transparency and accountability; use verifiable paper ballots; and institute mandatory automatic random precinct recounts to ensure a high level of accuracy in election results.\" jill2016.com/recountfaq","post_message":"I am joined tonight with Kevin Ronca, the director and creator of the incredible docuseries, \"The Revolution Televised.\" Although only 13 minutes in length, each of these episodes get to the heart of the matter: exposing the corruption that has been taking place in our sick political system! I would like to invite you to join the conversation as we will be releasing the 4th episode in this series right now, followed by a live Q&A session between our viewers, me and Kevin about this extraordinary series and where he goes from here. I'm sure you all have heard about the dramatic developments at Standing Rock, including the announcement today by the Army Corps of Engineers (see below). Kevin is willing to go there with his team to bear witness to this very important struggle. --- Press Release from Army Corps of Engineers 11/25/16: @webpagelink -- Here are some of ..."},{"comment_id":"10152536753022377","commenter_b":"Pay back is hell Nancy you POS witch..","commenter_a":"tell pelosie to fk off s hes disguisting pos let pic cotton","post_message":"Trending Now..."},{"comment_id":"10154627536394203","commenter_b":"And Hillary is in a self-serving line person all my God where are you woman you're in dreamland what are you smoking","commenter_a":"The man is entirely self-serving. His ego is his God. Bravo to Rev. Timmons for putting him in his place.","post_message":"Donald J. Trump's latest target? Rev. Faith Green Timmons of Bethel United Methodist Church."},{"comment_id":"1166520376798072","commenter_b":"Grow up you sick witch. Get a life of your own.","commenter_a":"Congratulations men. One psycho off the market.","post_message":"HAHAHAHAHAHA... HAHAHAHAHAHAHAAAA!!! @webpagelink"},{"comment_id":"10153077946636037","commenter_b":"How about you stop being a stripper?","commenter_a":"Good for them. That's their job and everyone deserves fare treatment. Whether their dancing on a poll or serving meals at a local diner. This is America.","post_message":"Tired of watching well-meaning strangers impose their own visions for improving the plight of the exotic dancer, some of Portland's seasoned #strippers are working directly with state lawmakers and professional lobbyists."},{"comment_id":"541297862703293","commenter_b":"All wall must be built before the country is lost!","commenter_a":"We lived in Mercedes . Know exactly what you are going thru !!!","post_message":"We need a wall fast to stop ILLEGAL IMMIGRATION and ILLEGAL DRUGS from entering our country. Its just common sense!"},{"comment_id":"890231291031876","commenter_b":"Why would you slap immigrants in the face by rewarding those that broke the law?","commenter_a":"There are a lot of academic papers (i.e. data by experts and not angry, ignorant people on Facebook) that shows that 1) undocumented residents have a MUCH smaller drain on tax dollars relative to what they contribute than what the media hypes up (generating fear is a lot faster/easier/profitable than actually knowing the facts), 2) that immigrants rank high on civic service, 3) that immigrants rank high on starting new businesses ventures, 4) that the U.S. Immigrantion system shows indicators of being purposefully designed to have an undocumented work force for which the govt. can reap benefits without paying the full bundle of rights, etc.","post_message":"We must sign comprehensive immigration reform into law to bring over 11 million undocumented workers out of the shadows. We cannot continue to run an economy where millions are made so vulnerable because of their undocumented status. @webpagelink"}]
