[{"comment_id":"10154614760931077","commenter_b":"Only a nasty hateful woman would write this. Pathetic!","commenter_a":"what a nasty hateful woman she is.:(.","post_message":"There were visible awkward moments during the meeting of the two families."},{"comment_id":"1001556806534263","commenter_b":"A vagina is a sex organ. A boob is not. Stop comparing them.","commenter_a":"Society uses breast on ad to sell cars, burgers and every shits they want but when it comes to the natural uses, which is feeding a baby assholes loses their minds ? Should think twice before saying women who breastfeed don't have respect for themselves. What did our mothers/grandmothers did before powdered milk ?","post_message":"Women are brilliantly standing up to breast-feed shaming. Read a powerful example right here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"1437658776254148","commenter_b":"Go home burn your drunk","commenter_a":"Think its time we start saving the tax payers money and get all these corrupt career politicians out of office! These hearing are a waste of money when the system is rigged for them when they pick people like Lynch! She was picked solely on how she could withstand what she went through! Trump is real change! America needs these corrupt politician gone!","post_message":"\"Together we have begun a political revolution to transform America and that revolution continues,\" Sanders said in his endorsement of Clinton."},{"comment_id":"10153696500960575","commenter_b":"Shoot this mother fucker.","commenter_a":"Hey you are invited to my next BBQ all the pig you can eat","post_message":"More tolerance and love from the Religion of Peace."},{"comment_id":"1836282733258652","commenter_b":"cute dirty pig woman...can't call her a 'lady' tho. She's a good match for the Drumpf. oink oink.","commenter_a":"#DumpTrump #FuckKillary","post_message":"Make no mistake, Hillary will do whatever it takes to cover up Bill's transgressions.."},{"comment_id":"10153687019896800","commenter_b":"Maybe abortion opponents could just focus on those things that actually reduce abortions. The #1 cause of abortion is unplanned pregnancy. Universal coverage for birth control has done a great job of reducing abortions in other countries. Equal pay guarantees also work - mothers in this country experience a greater wage gap than childless women. Job protection is an issue here. Women in this country still experience job loss solely because of pregnancy. And, child support is a huge problem here. Civilized countries pay custodial parents child support, and THEN collect it from the non-custodial parent. Knowing that you can afford to feed, house, and clothe a child is a factor when deciding whether to continue a pregnancy.","commenter_a":"If these conservatives really wanted to prevent abortions -- they should be handing out birth control like it was candy. After all, if you prevent an unwanted pregnancy you automatically prevent the need for an abortion. But I guess that kind of logic is beyond the comprehension of most conservatives. Considering the conservatives are trying to restrict or elimiminate access to birth control as well -- I don't think this is about preventing abortions at all. It seems like it's about a group of morally uptight religious busybodies going around poking their noses into other people's private matters and wanting to have total control over those people's lives.","post_message":"Trevor encourages abortion opponents to extend their pro-life stance beyond fetuses."},{"comment_id":"10152698246092293","commenter_b":"Obama is SCARED His Funding of these TERRORISTS, will have to STOP!","commenter_a":"Obama was right not to go.","post_message":"\"We agree that we should have sent someone with a higher profile in addition to the ambassador to France.\""}]
