[{"comment_id":"10153831676802377","commenter_b":"Trump and him are a great team and those Trump have lined up will make The A team! Everyone that loves this country has to realize now this Election is about saving this country! Do yourself and loved ones the most important thing and vote Trump! Obama is letting illegals in to vote the Americans have to stand up and fight for their own freedom!","commenter_a":"No he lives in a bubble","post_message":"Following Mike Pence's remarkable performance at the vice-presidential debate, Republicans wish they could swap their presidential candidate as the Indiana governor now appears more promising than Donald Trump, according to Politico."},{"comment_id":"1164891623572953","commenter_b":"No Obama, is a Muslim and I say screw all Muslims!! Trust No Muslim Ever!! Remove all Muslims from the United States. Trump, 2016, for 8 years!!!!","commenter_a":"Hell NO","post_message":"Another Muslim Holiday, And another Speech From Obama Greeting Them... Obama said he sides, with Muslims, maybe he should side with America FIRST! Do you side with muslims? take our poll!"},{"comment_id":"1251827328191456","commenter_b":"they are only saying this so they wont loose sales!!!!!","commenter_a":"So everyone remember to take your children to the restroom before Target trips","post_message":"👏 👏 👏 (via The Huffington Post)"},{"comment_id":"10153921510965329","commenter_b":"lol i thought this was cute calm down woman","commenter_a":"Alison Wonderland when you tame the mane...","post_message":"can't stop watching this"},{"comment_id":"1085637111459772","commenter_b":"Y'all sound like a bunch of cheating mistresses!!!","commenter_a":"Here you go If you plan to vote for Ted Cruz, you MUST know these things! Educate yourselves on him and his wife * Heidi Cruz has been employed by Goldman Sachs since 2005. She is currently on leave. * Heidi Cruz is a member of the leftist council on foreign relations, advocates of world Government and a New World Order. * Ted Cruz was George Bush's top policy advisor. * Ted Cruz was in the federal Trade Commission. * Ted and Heidi met when they were both Bush staffers. * Cruz advised on legal affairs and Heidi on economic policy for the bush administration. * Heidi was director for the Western Hemisphere on the national security council under Condoleeza Rice. * Heidi served as deputy U.S. Trade Representative to USTR head, Robert Zoellick, working on China trade policy. * Ted Cruz' campaign chairman, Chad Sweet, is a former CIA ...","post_message":"The story the whole Internet is buzzing about..."},{"comment_id":"10157648853630389","commenter_b":"I cannot stand this woman! She's an evil individual!","commenter_a":"I think Hillary is in for a very soul awakening! God did not choose and Call a man, Donald J. Trump, to lose! Donald J. Trump, answered God's Call, he did not have to do this! God is still in Control and this is God's Creation, not the Clintons, BHO, Soros, the big bankers, or any government! Look at all of the corruption & evil that has been EXPOSED TO THE LIGHT AND HAS BEEN GOING ON FOR YEARS & YEARS AND GOD KNEW IT!!! Life is like a tapestry, we see the underside, the messy side, but God sees the finished beautiful side and knows the reasoning behind every stitch. We have repented and we have asked God to save this country, ask and it shall be given! Deuteronomy 32:35 'Vengeance is Mine, and retribution, In due time their foot will slip; For the day of their calamity is ...","post_message":""},{"comment_id":"10154286409446800","commenter_b":"That's pussy shit. And we agreed on 2","commenter_a":"Jami Hugo Omar Oliver","post_message":"Tonight at 11/10c on The Daily Show: #NationalHandshakeDay, a Brexit update and most important, Jessica Williams’ final show."}]
