[{"comment_id":"477777845756672","commenter_b":"Bull Crap, Hillary.","commenter_a":"Please take a good look at Chicago !!!","post_message":"Hillary Clinton's answer to crime is always to just crack down on law-abiding gun owners - not law breakers. But the American public is seeing through her gun control lies for what they really are: meaningless rhetoric."},{"comment_id":"10153573613391037","commenter_b":"An interesting job for our President on how to get these kids off the street at night and up in the morning to go to school.","commenter_a":"If it's done the right way!!!!","post_message":"The president says helping America's minority youth and making sure young people have the opportunity to succeed is \"an economic imperative.\" Liz Goodwin details the push behind the My Brother's Keeper initiative."},{"comment_id":"10154211018961337","commenter_b":"Hot chick","commenter_a":"Dont agree rob schneider is funny in some movies","post_message":"WHOA, sorry Rob Schneider and Jennifer Love Hewitt (and all the other actors on this list)..."},{"comment_id":"343579349178913","commenter_b":"Nobodynis beyond the law!! ARREST OBAMA AND CHARGE WITH TREASON!!!","commenter_a":"That's because they are all STupid, and follow their leader and Nancy P.","post_message":"ICYMI - Nearly Half of Democrats think Obama Should Have the 'Right' to IGNORE the Courts!"},{"comment_id":"1809746189282784","commenter_b":"Why you wait until today to do this stupid you are old and stupid my God how a woman do these stupid thing","commenter_a":"Stupid stupid","post_message":"#LIVE VIDEO: Attorney Gloria Allred is holding a press conference with a woman who accuses Donald J. Trump of sexual misconduct."},{"comment_id":"947825155333866","commenter_b":"..i got 99 problems but a bitch ain't one","commenter_a":"Wax off wax on Daniel son !!!!","post_message":"This can't be real"},{"comment_id":"10153509134104205","commenter_b":"Fuckdonaldbitchasstrump!!! @webpagelink","commenter_a":"Excellent point! That's why I think Unions came out for her, well some Unions! If they didn't and she wins, they aren't represented! If they back her and Bernie wins, he'd still be for them!!","post_message":"Hillary Clinton keeps a list of her political friends and enemies. She does this so her staff can quickly decide who to reward and who to punish when favors are asked. Basically it’s for streamlining corruption."}]
