[{"comment_id":"1096108950465633","commenter_b":"Let em go and then build a wall around it so they stay gone","commenter_a":"I say let them go. Pull all the military bases and all the government jobs and everything that belongs to the United States of America, and that includes the dollar. Then round up all of the other Racists and Dumb Shits who blame all their trouble on Obama when it was Bush and the Republican majoritys falt and send them down to the new nation of Texas where they can be happy ever after. The United States will be better for it too.","post_message":"The majority of Texas Trump supporters say they'd rather secede from the U.S. than live under Hillary Clinton as president. Do you feel the same way?"},{"comment_id":"744295802392870","commenter_b":"Oh god this world","commenter_a":"Anoosh GondalSadia Manzoor lol wth","post_message":"The PMS Package makes your 'time of the month' easier with candy and treats. Via In The Know"},{"comment_id":"1009798209043227","commenter_b":"That woman will never learn.","commenter_a":"Pig","post_message":"Joy Behar calls out Carly Fiorina. Is she right?"},{"comment_id":"10154140064560579","commenter_b":"Seriously Facebook . .you need to put a 'DUH' button on here","commenter_a":"She's right, the game is rigged and I'm sick and tired of the power elite in this country, be it the politicians or the media, trying to tell us what to think. Regardless of whether it's her or someone else, we DO have to take our country back.","post_message":"\"This game is rigged.\" Carly Fiorina on not being able to participate in Saturday night's debate in New Hampshire. Watch complete video here: @webpagelink"},{"comment_id":"10153758496148487","commenter_b":"Is the message that youre a whiny little pussy? Roger that.","commenter_a":"We are sending a message to the rednecks and right wing nut cases.","post_message":"\"We join other leaders in our state who are calling for a change in the state flag."},{"comment_id":"10153678796416491","commenter_b":"If its a libby female like killary, she'll be fine on the side of the road ;-)","commenter_a":"Dude. You left a lady on the side of the road. I don't know how you were raised, but someone needs to kick your teeth in.","post_message":"The driver said the woman was “obviously a socialist”"},{"comment_id":"10153127976631162","commenter_b":"You sound ignorant you stupid old lady","commenter_a":"A 3, 2, year old and she is 8 months pg. give her birth control.","post_message":"TODDLER SHOOTS PARENTS: A 3-year-old boy shot his dad and his 8-months-pregnant mom when he found a loaded handgun in her purse while looking for an iPod. READ MORE: @webpagelink"}]
