[{"comment_id":"934884219913515","commenter_b":"@username they were not prostitutes. Those were his pimps.","commenter_a":"TRUMPS ASS LOOKS BETTER THAN RUBIO'S FACE. RUBIO IS A DAMN SWEATHOG!!!!!","post_message":"Marco Rubio mocks Donald Trump's face..."},{"comment_id":"1459625230716396","commenter_b":"Send them home!","commenter_a":"Who's with me ?? BUILD the W. A. L. L.","post_message":"Deport them all, President Trump"},{"comment_id":"10154259751471509","commenter_b":"What because he supports the laws of the land? Yeah. Illegal immigrants are illegal. Period. Muslims harbor terrorists.. Period. We are 19 trillion in debt. Will take a business person to get out of it, not a crooked politician who put us here..period.. I can keep going","commenter_a":"That's the main reason Trump will be elected, we the people are pissed, Hillary lies, Obama lies, Congress lies and the media lies for them","post_message":"Ever felt that politicians were fibbing? Several CNN Opinion contributors weigh in on truth and lies in the political realm."},{"comment_id":"10153593708856770","commenter_b":"#TRUMPorTAXREVOLT #BOYCOTTAMAZON #TRYCLINTONFORTREASON #TRYOBAMAFORTREASON #REMOVERYAN #REMOVEPELOSI #AUDITTHEIRS #DISENGAGEWITHTHEUN #DISENGAGENATO #DISBANDTHEELECTORALCOLLEGE #INSTITUTEPOPULARVOTE #HOLDMEDIAACCOUNTABLE #IMPOSETERMLIMITS #VETERANSB4ILLEGALS #BANISLAM #UPHOLDTHECONSTITUTION #REVERSEALLOBAMAORDERS #ARRESTSOROSFORINTERNATIONALTERRORISM #WORKFARE #NOCITIZENSHIPNOVOTE #KILLCOMMONCORE #PURGETHEGOP","commenter_a":"The Muslim Brotherhood government in Egypt CRUCIFIED CHRISTIANS IN DOWNTOWN CAIRO--and they remained Obama's favored government. After the Egyptian people threw them out, Obama continues to consider the Muslim Brotherhood the legitimate rulers of Egypt.","post_message":"The Obama administration’s disappointment with the U.K.'s Brexit contrasts sharply with its celebration of the Muslim Brotherhood’s election in 2012."},{"comment_id":"10153643564026051","commenter_b":"She shouldn't be out!! WTH","commenter_a":"I don't think so","post_message":"A mom who killed her 3 kids is now demanding custody of her new children."},{"comment_id":"1057273917621602","commenter_b":"No lol","commenter_a":"One world order ?","post_message":"You can't possibly understand America's greatness if you look at this country as nothing more than a series of grievances that need to be addressed. You can't see greatness at the same time you see that."},{"comment_id":"1262934473727561","commenter_b":"There is no 'weaker' version of the species. Both genders are the same species, just with physical differences.","commenter_a":"12,000 yrs. ago and they're still Lions 😭😭","post_message":"These images are just extraordinary. The cubs were just a few weeks old when they died."}]
