[{"comment_id":"1264747770240434","commenter_b":"where are you people getting married? That's way tooo much for a wedding.","commenter_a":"save that money for a down payment on a starter home. have a small personal wedding. in the longrun no one is going to remember crystal chandeliers, wine glasses or the color of the bridesmaid dresses. only you. in 35 years your husband won't remember that----only the credit card bills. Have a wonderful time no matter what you do.","post_message":"And about $16,000 of that is for the venue alone... STORY: @webpagelink"},{"comment_id":"10153598011598812","commenter_b":"She is like.... Told you to stay away from those blonde white bitc... lol","commenter_a":"With his mommy right beside him worried about where her money is going to come from now","post_message":"Former FSU quarterback says \"I totally should have walked away\" after video surfaces showing him punching woman in the face."},{"comment_id":"1188535021166526","commenter_b":"This is ridiculous! Impeach her and be done with this !","commenter_a":"\"Just because 5 Supreme Court judges make a ruling, it not a law,\" said Kim Davis's 4th and evidently very well-read husband","post_message":"Kentucky clerk Kim Davis’ husband Joe says his wife will never resign and calls out the judge who ordered her behind bars. @webpagelink"},{"comment_id":"10153287384469714","commenter_b":"We never like skinny models.we love skinned and boned and toned models that should take the run ways","commenter_a":"I think people don't get it. It's attractive to be thin but you don't have to starve yourself. You don't have to be super skinny. People like a nice figure but above all a nice personality. You don't have to kill yourself to have a nice figure. Eating right and working out makes you look nice and feel better .","post_message":""},{"comment_id":"543443959158926","commenter_b":"Time to skewer the witch!!","commenter_a":"Hell Ya !","post_message":"'Hillary Is In for the Ride of Her Life' When She Takes On Trump. Governor Mike Huckabee"},{"comment_id":"10154994151726800","commenter_b":"Thinking of spending time at home. On the Galapagos islands with the other tortoises.","commenter_a":"@username dudes face says it ALL!!","post_message":"#LifesAMitch"},{"comment_id":"1058693167521161","commenter_b":"I died a long time ago, no girl cares about me and it's quite clear.","commenter_a":"Telling the women that you Love, that you Love her.","post_message":""}]
