[{"comment_id":"565051436999865","commenter_b":"Why don't these idiots get deported already? They come here illegally so they are criminals!","commenter_a":"Just bag em and ship back to Mexico","post_message":"Police in riot gear faced off against a violent crowd of protesters outside a Donald J. Trump campaign event in Albuquerque. @webpagelink"},{"comment_id":"682571568600088","commenter_b":"I am so sick of hearing this offends the Muslims that offends the Muslims what the hell are they living here in America this is our country go back to where you came from because you offend us","commenter_a":"DONT LET THEM DO IT!!! Don't keep the truth away from AMERICA. Don't let them do it.","post_message":"Schools are removing the Holocaust for curriculum because it offends Muslims. This is could be the most ridiculous thing I've ever heard. Do you think they should keep the Holocaust in history lessons?"},{"comment_id":"10154453575369087","commenter_b":"I love it.","commenter_a":"And Trump is right once again! Meryl Streep is a piece of s***!","post_message":"Donald J. Trump: \"Meryl Streep, one of the most over-rated actresses in Hollywood, doesn't know me but attacked last night at the Golden Globes. She is a Hillary flunky who lost big.\""},{"comment_id":"10153088167230329","commenter_b":"jajajajaja pa que andas viendo esas cosas , si da asco su lombrizota!","commenter_a":"@username. Vivian Lord Pussyfer. No mameeeees me quería morir, grite y casi lloro y seguramente no dormiré jamas","post_message":"¡Qué asco! Via: [[ BuzzFeed Español ]]"},{"comment_id":"814799585299285","commenter_b":"Yes me to!! We better not be dumb enough to let another one get in like Hillary Clinton! We can't afford to have her ruin our country and drive it farther into the ground than Obama already has!!","commenter_a":"Can't wait for Obama to leave office","post_message":"President Obama will address the nation tonight. He needs to acknowledge RADICAL ISLAMIC TERRORISM! On Friday night in North Carolina, I was asked what I would say to Obama - at this point:"},{"comment_id":"10154477709641729","commenter_b":"True","commenter_a":"Hillary is power hungry and Bernie is actually a communist . Both don't care about the American people.","post_message":"They'd best heed the writing on the wall."},{"comment_id":"10153072162137144","commenter_b":"It was defacing State property. No matter how she feels there are laws. She was right to be arrested.","commenter_a":"Yay for this righteous woman !!","post_message":"Brava! #freeBree"}]
