[{"comment_id":"10152758680722144","commenter_b":"Racist pigs","commenter_a":"What the hell are these people thinken DO THERE DUM ASSES KNOW THAT CHILD ABUSE","post_message":"WTF."},{"comment_id":"10153825338913690","commenter_b":"... and what does anybody to prevent it, concerning slave traffickers???,","commenter_a":"Well it's right what you say, but where is Qatar in that case? Shouldn't Muslims help Muslims. I can't see any help from Saudi Arabia, Qatar or UAE!","post_message":"\"To have the small bodies of babies and children carried ashore or washed up on these idyllic beaches is devastating. I have seen children sleeping in the mud under a flimsy bit of cardboard, and kids shivering with blue lips and hands. We expect the situation to get much worse as winter really bites.\""},{"comment_id":"648235325326484","commenter_b":"She has! Wake up!","commenter_a":"Killary should release her tax papers too! She is a liar and a murderer!","post_message":"Yesterday, Hillary Clinton blasted Donald J. Trump in a heated speech on the economy. So now, Trump is firing back... hard: @webpagelink"},{"comment_id":"10154530300669087","commenter_b":"I'm guessing the attorneys general in question are more aware of the law than you, random Facebook commenter.","commenter_a":"The Inadmissible Aliens Act Section 8 - 1182 allows the President to ban any group or nationality from getting Visas. The Law is Legal and on the books since 1952 and used by President Jimmy Carter to ban Iranians in 1979 and Obama in 2011.","post_message":"Virginia’s attorney general has joined other state attorneys general around the country in filing a lawsuit against President Trump over his immigration ban."},{"comment_id":"404568359667759","commenter_b":"They all need to go somewhere else!","commenter_a":"what is wrong with the United States flag this is United States we have the right to fly our flag just like any other country","post_message":"Why do some people want to ban our flag?"},{"comment_id":"10153888153653352","commenter_b":"You said it all...Thank you!","commenter_a":"I feel she should have been fired.... possibly fined. Holding her in jail until she changes her mind is a waste of tax dollars and time.... yes this woman stood up for what she believed but she still had a job to do .... not only did she refuse to issue same sex marriage license but she didn't allow the people under her who were willing to issue them either.... that is wrong..... this woman used her title and athority and held an entire government staff to her religious beliefs ... she didn't have to issue them she could have let someone else do that and still be faithful to God's law.... this country was built on freedom of religion. That means no law can be withheld or upheld based on religious beliefs.... she made an oath to follow the laws of the US , as soon as the laws ...","post_message":"Defiant Court Clerk, Kim Davis, Will Be Held In Jail Until She Agrees To Issue Same-Sex Marriage Licenses! CHRISTIANS WHAT IS YOUR REACTION?"},{"comment_id":"1328494547175243","commenter_b":"Join a lots of OTHERS, -- WHO could put up with that WOMAN. Send \" HER \" to JAIL.","commenter_a":"Good girl, Judge! Way to go! You are the best!","post_message":"“It’s the kind of locker room and frat house talk that personally infuriates me. But guess what? I still, without a doubt, support [Donald J. Trump].\" Watch Judge Jeanine Pirro's full opening statement."}]
