[{"comment_id":"659128370944408","commenter_b":"Ban them all through the U.S.!","commenter_a":"Yes!","post_message":"A town in Michigan just voted to ban mosques, this was the result. Things are about to get very controversial. Would you like to ban Mosques in your town?"},{"comment_id":"10154268012211336","commenter_b":"HURRY UP AND OD, MAKE AMERICA PROUD, FIDDY THENTS.","commenter_a":"50 cent. Ironically, that's also what his career is worth.","post_message":"In a video posted on Instagram, 50 Cent confronts a young man as he pushes a cleaning cart through the terminal and accuses him of appearing to be high on drugs."},{"comment_id":"10153120259284411","commenter_b":"Ran like the bitches they are !!","commenter_a":"Marines don't flee. They were ordered home... there's a difference...","post_message":"Fleeing US marines handed over weapons to random Sanaa airport employees Yemen official"},{"comment_id":"10153357244917061","commenter_b":"She should be a shame of herself. A doctor, would not want her to treat me.","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"1036826173024907","commenter_b":"you mean the way a woman allowed herself to be treated for good money?? wahhhh wah wahhhhhh.","commenter_a":"The way Hollywood portrays women is outrageous.","post_message":"Right on. Go Dame Helen, go! - Eric March"},{"comment_id":"10153771956525428","commenter_b":"@username He is beholden to we the people and he just said he isn't showing up for his interview..","commenter_a":"Trump just lost the election skipping debate.","post_message":"What is the meaning behind Trump long-lasting surge in the polls?"},{"comment_id":"1016852955001727","commenter_b":"Calais wasn't a jungle before these muslim herds invaded it and consequently turned it into filthy, unsafe jungle!!! Let them go to muslim countries for a better life, they do not belong to Europe!!! They cannot and will not assimilate. EVER!!!","commenter_a":"Welcome to Europe, here you be safe and free","post_message":"\"It's slowly, slowly starting to become colder and I don't know what are their plans, these people, because if it starts snowing, most of the people, they're going to start coughing and getting sick and probably dying in that jungle.\" Read more: @webpagelink"}]
