[{"comment_id":"10152917139561051","commenter_b":"Kim, Please show me where the white kids were doing this. I must have missed this.","commenter_a":"Can anyone explain why blacks act like this? Is it something about IQ?","post_message":"These kids thought it would be funny to jump on people's cars and dent them. It took about a minute before someone noticed and decided to make them regret it."},{"comment_id":"1457667300971814","commenter_b":"Or fire her!","commenter_a":"I am ashamed of NBC. Rather than addressing the crude and disputable comment by one of your employees, you just champion Chelsea. Do the right thing fire Katie Rich and issue and apology","post_message":"\"Barron Trump deserves the chance every child does - to be a kid.\""},{"comment_id":"1271975762826442","commenter_b":"You guys are so right & prosperous blacks had their own black slaves too. Our troublemaker-in-chief is keeping this going, stirring up strife so he can cry Marshal Law & keep his seat in our White House. We're in big trouble folks but most people don't even know that. Keepin' on puter & cell phone games, partying, gettin' high & working 2 jobs just to keep the bills paid. The average person has no time to protest & make trouble but we have the government paying people to not work so THEY have lots of time. It's how barry wants it to be.","commenter_a":"Loretta, Sadly, you're an intricate part of the problem. Just another old racist white person that cannot and/or will not recognize the murder of our young Black men by white racist police officers. Your kind will always find an excuse to somehow blame the victim...the evidence be Damn!","post_message":""},{"comment_id":"1098378433550493","commenter_b":"Gore's win was not robust enough and Bush et al weaseled their way into the White House and blew up the Middle East nearly blew up Roe V Wade - even if you have to hold your nose it will be worse if Hillary loses - people will die, the environment will be further destroyed, social security will be looted. Please reconsider. Fight for a third party after the election or begin now but please don't let Trump win - the pleasure of the spite will not be worth it. Just look at the destruction, devastation, the inhumanity, wreckage of Bush presidency. If Hillary is defeated because of the spite of Bernie people it will be a Pyrrhic victory certainly.","commenter_a":"Bernie, I will follow you anywhere... but I won't be able to vote for HER. I don't begrudge you supporting her... I'm sure there was a lot of pressure to do so as well as strategic reasons. I CAN get behind down ballot progressives though! Love you, Bernie!","post_message":""},{"comment_id":"1477546275595181","commenter_b":"Hillary Clinton is a phony champion of the working class! She takes millions from Wall Street the same people who have made Billions shipping are jobs out of the country!","commenter_a":"As it should be...when is the rest of the nation gonna wake up and at least acknowledge what's happening?","post_message":"Donald J. Trump leads Hillary Clinton by 5 points among likely voters in Ohio, according to a new poll."},{"comment_id":"1137787319581255","commenter_b":"She is a disgrace!","commenter_a":"\"When Democrats win, America wins.\" 😂","post_message":"Everything about the Clintons is fake, including Hillary's faux-Southern accent—listen! #Hillary2016"},{"comment_id":"10153625386991179","commenter_b":"@username. Thought you would like this!","commenter_a":"Tracy McElfresh Jesy Anderson","post_message":"Here's another one! Who is the genius behind these?"}]
