[{"comment_id":"10153123967295329","commenter_b":" ! Paco nooo","commenter_a":"Caffe Con Lechee","post_message":"We all have that That One Co-worker who can't control themselves around cake."},{"comment_id":"10153572594101051","commenter_b":"Gee, did you even graduate from high school????!!!!! You foul mouthed witch!!!!","commenter_a":"I dont blame them!! It probably sickens them that crazy angry trump uses their music while he talks his trash!!","post_message":"One of the world's most legendary rock bands just told Donald Trump they want nothing to do with him."},{"comment_id":"10153674136304641","commenter_b":"true... we just cant equate these refugees with terrorists.","commenter_a":"Its not about religion you fool! It's about your country's safety! Get that through your head!","post_message":"U.S. President Barack Obama's harshest remarks were for Texas Sen. Ted Cruz."},{"comment_id":"10153291697646350","commenter_b":"It was beautiful . I have seen the stage play at least 20 times with groups and sung by many, and it is great to hear the different sounds.","commenter_a":"If you ever saw Phantom on stage or saw the movie, you know Josh Groban did it justice. Kelly did not. She about ruined my favorite song for me, from which my wedding vows were taken. Kind of like nails on a chalkboard for me.","post_message":"We could listen to Josh Groban and Kelly Clarkson sing The Phantom of the Opera all day."},{"comment_id":"10153312471793606","commenter_b":"Enough Rioting In Baltimore Already It's Time To Cleanup The Damage Those Idiots Made And To Restore Peace Better Yet Make Those Monkeys Who Damaged Baltimore Cleanup Their Own Mess","commenter_a":"<iframe width=\"330\" height=\"180\" src=\"@webpagelink\" frameborder=\"0\" allowfullscreen><\/iframe>","post_message":"#BaltimoreRiots: We're monitoring social media right now, and some people are tweeting to get out and riot AGAIN. @webpagelink"},{"comment_id":"1270203316353471","commenter_b":"she cant and is a skank","commenter_a":"Say what you want about Miley--those pipes of hers are GOLD. period. And, she's been a sole advocate of LGBT and homeless rights. She's young and finding her voice but good for her for wading into the advocacy pool! Applause!!","post_message":"She may be an attention seeking diva with a voice like nails on a chalkboard, but she's also a politically active advocate for women's rights who despises Donald Trump."},{"comment_id":"1034412946618453","commenter_b":"Shut up","commenter_a":"The end of life and nature. I miss to see the destination of these individuals and their satanic groups. #SuicideInTheNameOfFreedom","post_message":"Hopefully more players will be encouraged to come out"}]
