[{"comment_id":"10154557994494087","commenter_b":"She is a lunatic! Ugh","commenter_a":"Jeff Sessions was that racist that prosecuted the KKK and has many black friends who defend him, yet Senator Warren throws the racist term around while pretending to be a native American? I don't get it. If you just hate someone just say it. Calling him a racist simply makes Ms Warren a racist and someone who stole from native Americans in order to further her financial coffers. You ma'am have Skelton's in your closet, live in a glass house yet you cast the first stone. Remember those HS days and your words Senator Warren.","post_message":"Elizabeth Warren: “Consider this MY warning: We won’t be silent. We will speak out. And we WILL persist.”"},{"comment_id":"10154357996114203","commenter_b":"innocent guns. why do we ban drugs such as cocaine? if the entire responsibility is on the abuser","commenter_a":"line up Americans arguing what the definition of assault rifle is.","post_message":"Conan O'Brien: \"I am a father of two, I like to believe I have a shred of common sense, and I simply do not understand why anybody in this country is allowed to purchase and own a semiautomatic assault rifle. It makes no sense to me. These are weapons of war, and they have no place in civilian life.\""},{"comment_id":"10154356809342654","commenter_b":"DEPORTATE ALL IMMIGRANTS ILLEGAL! God Bless US .","commenter_a":"All the people walking there equals one mexican party or quince lmfao","post_message":"Immigrants who work at dozens of restaurants around Washington, D.C. are participating in the Without Immigrants protest. We're live at Pizzeria Paradiso (Dupont Circle) where managers are trying to get by without their employees AND we're live at the site where protesters are organizing."},{"comment_id":"1206621306053557","commenter_b":"Truly this HYPOCRITICAL woman with NO MORAL CONSCIENCE and u hope one day she will be in a Federal Lockup w/ The Clinton CRIME FAMILY along w/ OSAMA OBAMA and they'll have time to know GOD...","commenter_a":"Piss off and die, libtard.","post_message":"WOW..."},{"comment_id":"10153216213261717","commenter_b":"Skars the reason people are so upset is because the bitch is a fucking lesbian for god sakes","commenter_a":"caitlyn jenner may be transgender but she doesnt believe in same sex marriage. she isnt an insparation at all. shes a selfish bitch","post_message":"Caitlyn Jenner prays with fervently antigay preacher"},{"comment_id":"995099337179781","commenter_b":"Crazy dumb old witch.","commenter_a":"I think democrats are more like terrorist. Terrorist maim and tear people's bodies apart. Democrats do the same thing to unborn babies by allowing Planned Parenthood to Harvest baby body parts. As far as I know no terrorist organization sells body parts. Guess that makes Democrats and Hillary Clinton worse than terrorist.","post_message":"BREAKING: Hillary Clinton says GOP candidates are like terrorists because they're...pro-life?"},{"comment_id":"1175706475803156","commenter_b":"But women shouldn't be able to get birth control or abortions...","commenter_a":"Now thats the Paul Ryan I know.","post_message":"WOW."}]
