[{"comment_id":"1586029795023236","commenter_b":"all you women who just need to color those grey hairs with Bleach blonde. So Vain.","commenter_a":"Richard Dryfus.....dude...you just lost the majority of your fan base. You must be a Criminal follower!","post_message":"He called Trump small dicked prick a unqualified racist who had for celebrity supporters."},{"comment_id":"10152847768557690","commenter_b":"How do you steal that many cattle without being noticed? Surely someone saw something","commenter_a":"Who let the cows out?!","post_message":"Officials are investigating how 1,121 cattle vanished from a Texas dairy facility >> @webpagelink"},{"comment_id":"10153655047616130","commenter_b":"When someone makes those comments, they will learn what my bitch face REALLY looks like!","commenter_a":"Everyone: Are you okay? Everyone: You look tired. Everyone: You look upset. Everyone: You look confused. Everyone: Are you mad at me? Everyone: Why are you mad at me? Me: IT'S JUST MY FACE!!!!! This has been an accurate description on what it's like to live with Resting Bitch Face.","post_message":"Scientists say resting bitch face is real."},{"comment_id":"10153067300837061","commenter_b":"Alex Barham you better do this for me. I sunflowers","commenter_a":"Beautiful story.","post_message":"Wisconsin man plants 4-mile stretch of sunflowers in tribute to wife who died of cancer: @webpagelink"},{"comment_id":"1427954837264260","commenter_b":"I consider reading this page to be a spectator sport. ;)","commenter_a":"Such a disgusting Olympics. The committee needs higher standards.","post_message":"And you thought Rio's green pool was worrying!"},{"comment_id":"10153243499636336","commenter_b":"We definitely need a Godly man in the White House. I thank God for him.","commenter_a":"Amen, Dr. Ben!","post_message":"Did you know? Presidential candidate Dr. Ben Carson, a retired neurosurgeon, revealed on Fox & Friends this morning why he prayed before every surgery."},{"comment_id":"947324245313643","commenter_b":"Sick witch, heartless.","commenter_a":"Arrested her","post_message":"Police say woman hid body of dead son in trunk of her car. According to police, the boy was last seen in 2004. @webpagelink"}]
