[{"comment_id":"988452247844232","commenter_b":"If you have a daughter tell her to free her nipple in public and the pervs will come flocking to take pictures. Which will be legal if in a public space. Maybe you should look up Voyeur on pornhub or something and girls of all ages are being creep'd on.","commenter_a":"These sexist comments are appalling. Especially from the women. Keep letting society tell you what's proper and where your naked parts belong. As long as I'm concerned breast were designed to feed a new born. A man can do whatever the hell he wants but a woman has to be restricted to pretty much anything that might make her comfortable because revealing clothing means she's \"asking for it\" and showing her nipples, which are both called the areola on both men and females by the way, would just make men go into a frenzy. Instead of instilling this belief that breast and skin of women are meant to appeal to the eyes of men, teach men and instill in them self control, consent, and respect for women.","post_message":"Here are the nipples so scandalizing that Facebook won let us show them to you. (To see the uncensored version, click here: @webpagelink) #FreeTheNipple"},{"comment_id":"1194058434020542","commenter_b":"Coulda, woulda, probably shoulda.","commenter_a":"Thank you, Bernie Sanders for finally bringing unity to the Democratic Party!","post_message":"This moved us to tears... what a moment!"},{"comment_id":"1134898503249901","commenter_b":"That's supposed to make me want to vote for her?????????","commenter_a":"From a Bernie Delegate: A hard day for most of us. I have contacts within both campaigns. Here what I was told yesterday and today. Clinton campaign to vote down every concession made to Bernie on the platform if he did not endorse her prior to the convention. Knowing that Superdelegates were not going to switch to his side without something major happening, the best he could do was hold on to the progressive concessions he won for US on the platform. He could not, in good consciousness let the GOP and Trump win, especially when we have a potential half of the Supreme Court Justices that will be replaced within the next 4-8 years. He was looking out for the future of our movement and our nation in this very hard decision he made. This post is not to tell you to vote for Hillary, or to not leave ...","post_message":"In the coming weeks, I will be announcing the creation of successor organizations to carry on the struggle that we have been a part of these past 15 months. I hope you will continue to be involved in fighting to transform America. Our goal will be to advance the progressive agenda that we believe in and to elect like-minded candidates at the federal, state and local levels who are committed to accomplishing our goals."},{"comment_id":"10154629508429099","commenter_b":"Poor woman, but yet another reason as to why the elderly need to be tested at every license renewal after a certain age","commenter_a":"Poor thing.","post_message":"An 83-year-old woman died after her friend drove over her while backing out of a parking space @webpagelink"},{"comment_id":"742295419269809","commenter_b":"Herman. You read my mind. Agree completely!","commenter_a":"Banty McBotox seriously needs a reality check. Watching them as they form a circular firing squad is quite amusing. carry on.","post_message":"Please, Democrats. Keep repeating this. We want you to believe it with every fiber of your being. Don't change course. Don't learn your lesson. VIDEO!"},{"comment_id":"1474175135944775","commenter_b":"Two idiots,","commenter_a":"Hard to do when she said she wrote the speech herself, how did we get to this guy being nominee, wow","post_message":"Did they do it on purpose?"},{"comment_id":"10152977510376130","commenter_b":"Shut up meg","commenter_a":"I know what the show is about!!","post_message":""}]
