[{"comment_id":"984015725050561","commenter_b":"Carla. Go back to school honey. You are so stupid.","commenter_a":"Compare this: Melania Trump became a US citizen and said it was \"The greatest privilege on the face of this earth.\" Michele Obama said in a speech, \"For the first time in my adult life I am really proud of my country.\"","post_message":"Donald J. Trump’s campaign chairman denies allegations Melania Trump lifted her convention speech from Michelle Obama’s in 2008, claiming such an act would be \"absurd.\""},{"comment_id":"10154589090613132","commenter_b":"I thought the same thing...wow, she's just like every other woman!!","commenter_a":"I'm not gonna lie, I'm glad her mascara runs too hahaha!","post_message":"A pregnant Blake Lively and husband Ryan Reynolds were caught locking lips in Rhode Island over the weekend."},{"comment_id":"855360527843909","commenter_b":"Really clueless woman","commenter_a":"Shes not relevant!","post_message":"How's this for abortion logic?"},{"comment_id":"1191081784242503","commenter_b":"Can't we just put her in jail already?","commenter_a":"Ostensibly, this woman is a public servant whose salary is taxpayer funded. Her bigotry is flagrant and she has chosen to behave in a lawless manner and not serve the public. She is not adhering to her job description and thus is to be held accountable, as are those in the County and Republican Legislature who are condoning this assault on civil rights. Therefore, she, County administrators, and the Legislature need to be served with a large lawsuit.","post_message":""},{"comment_id":"10154500485544062","commenter_b":"So the one girl should go back to Chicago? That's where she was born so that's her home.","commenter_a":"Assimilate, dump your hateful evil religion; or maybe you should go back wherever 'home' is.","post_message":"What would you have done in this situation?"},{"comment_id":"1190272557692172","commenter_b":"I noticed, I don't believe I have ever before seen this. You can tell, they are sooo far distanced from our so called leader, lol. How is he allowed to carry on???","commenter_a":"In Obamas mind 9/11 didn't happen either. This man is a nut. Kick him out before he destroys this country. If you didn't know he was crazy before now, here's proof that he is. Pure old mean and crazy. America Please wake up. You can't be this brain dead.","post_message":"Somehow, Pentagon leaders don't seem too convinced..."},{"comment_id":"10154412077781323","commenter_b":"Italy isn't doing anything, yeah neither is Nigeria, or the Nigerian women that are the madams of these places.","commenter_a":"Italy allowing this to happen in plain sight. It's blatant and brazen and on the roads in broad daylight. The country should be in uproar, but no one does anything about it, not the government, not the vatican.....shameful.","post_message":"Thousands of women and girls are being trafficked to Italy from Nigeria, into a life of forced prostitution. Abused and desperately vulnerable, they have a champion in Princess Okokon, who was herself trafficked from Nigeria in 1999. Okokon fled her captors, and, with her husband, set up the NGO Piam Onlus Asti. Together they have helped hundreds of women in Asti and Sicily to escape their traffickers, giving them refuge and support."}]
