[{"comment_id":"10155298164813132","commenter_b":"This dumb broad just made her ignorance known.","commenter_a":"@username Kenya Hall I'm waiting for Riri to read her to filth.","post_message":"Azealia Banks shared several Instagram posts and a video attacking Rihanna for her post about Trump's immigration ban."},{"comment_id":"556876431104063","commenter_b":"Put a cap in her ass :-)","commenter_a":"I'll still bone her! Even with a mangled face! What's the point of the story?\"did you see her legs?","post_message":"The police state: before and after... The Free Thought Project.com (Y)"},{"comment_id":"10153611062907217","commenter_b":"#LetAmericabebadagain trump2016","commenter_a":"If you vote in this racist idiot as your president , Your country will be going down the shitter for many many years to come. The guy is a nut job who hasn't got a clue !! He's a threat to world peace ... Anyway good luck America","post_message":"\"I am offended. Those are very rude statements.\""},{"comment_id":"1111126252261565","commenter_b":"Bigger the caliber smaller the cock.","commenter_a":"Maybe she should just use the dildo then relax a little. Nothing wrong with open carry. All of these other campuses getting shot up didn't allow guns and that didn't work either.","post_message":"If this doesn't get people to pay attention to how ludicrous our gun laws are, I don't know what will. - Eric March"},{"comment_id":"10153677754598037","commenter_b":"All these females asking for equality. \"Wait, we don't want that equality.\" Sleep in the bed you make.","commenter_a":"Why are you women saying no? Cry for equal rights then don't want the same responsibilities as men.","post_message":"Do you support requiring women to register for the draft? If passed, 459,000 women in Texas would be eligible."},{"comment_id":"1990611657665239","commenter_b":"Another vile rapefugee","commenter_a":"death penalty anyone ?? #asktrump","post_message":"Horrifying."},{"comment_id":"10153160535761491","commenter_b":"Shes nowhere close to finny. Shes more along the lines of annoying.","commenter_a":"Non stop coverage of Amy Schumer won't work. She's still not funny.","post_message":"\"Amy and I were creatively made for each other,\" Jennifer Lawrence said."}]
