[{"comment_id":"1150560135003462","commenter_b":"Pathetic Kardashian whore.","commenter_a":"you go it right she is pathetic","post_message":"Caitlyn Jenner joined the festivities in Cleveland where she explained her reasons for being a Republican."},{"comment_id":"10152803991986491","commenter_b":"This less her chance of cancer . It is possible that cancer my appear else where?","commenter_a":"Anna! I always love to read your comments! Thank you for sharing :)","post_message":"\"I feel feminine, and grounded in the choices I am making for myself and my family.\""},{"comment_id":"10153927132326680","commenter_b":"She is nasty","commenter_a":"I rewound my tv three times when I heard this because I couldn't believe a presidential candidate would actually say something like this.","post_message":"Donald J. Trump to Hillary Clinton: \"Such a nasty woman.\""},{"comment_id":"999119110145234","commenter_b":"I like the term \"political whores\". Appropriate. They were all PAID millions of dollars by Monsanto to vote this way. (I suspect this is just the tip of the iceberg.) We should throw them all out and start over.","commenter_a":"I'm very against genetically modified foods, but the fda is supposed to be a small little entity. They aren't supposed to tell me what to eat. You guys are cutting off your noses to spite your face, and until you are willing to look at both sides of the argument and find the truth, you might as well just keep eating it like the little sheep you are.","post_message":"Despite the fact that some polls show that up to 95 percent of the American people want foods that contain genetically modified organisms to be labeled, there are a lot of politicians that don't seem to agree. Here's who they are:"},{"comment_id":"10153443453313145","commenter_b":"It's not the agents it's the folks who can't seem to follow simple instructions or get grumpy when asked to do what everyone else has to.","commenter_a":"I fly weekly and it is always slow. Putting the tourist with five kids in pre check just slows it down even more. Nothing at OIA is for the business traveler only the tourists. Wish I had a choice of airports","post_message":"A study of the speed with which TSA agents get passengers through security lines at Orlando International Airport shows that times aren't what airport officials want to see. So how have you're experiences at OIA been?"},{"comment_id":"10153916638559753","commenter_b":"Feed the gator Hillary and her pimp Obama kill that gator quick","commenter_a":"According to CNN the gator was a known Trump supporter and a life member of the NRA.","post_message":"News of yet another alligator attack has shaken things up in the state of Florida. A service dog named Precious has passed away after protecting her owner from being attacked by an alligator. Fox News reports the protective pit bill died after jumping in between her owner to save the man from an alligator attack in the southwestern portion of Florida. The alligator attack and death of this heroic service dog from Florida has prompted an inspect to determine whether or not the marina where... @webpagelink"},{"comment_id":"10154180577936770","commenter_b":"no he isn't","commenter_a":"He is violating the constitution again. Smh.","post_message":"Liberals are accusing Donald Trump of implementing a \"Muslim ban\""}]
