[{"comment_id":"10152933128350671","commenter_b":"That's because when you were younger they weren't mixing the vaccination like cocktail drinks.","commenter_a":"I'm 45 year old hot all my vacs as a child and I'm ok","post_message":"The Senate on Monday reaffirmed the bill striking California's personal belief exemption for immunizations on a 24-14 vote."},{"comment_id":"10153933865898984","commenter_b":"Send her ass to cuba","commenter_a":"The mother was a moderate Muslim who supports what the extremists do. She may not participate in the killing, and so on, but she helps from the sidelines. Deport.","post_message":"This just adds to the mystery of the San Bernardino shooting. This is absolutely huge and it means that there's A LOT more to the story than we know... Share this with everyone. We need to get this out there."},{"comment_id":"934017173381331","commenter_b":"You keep having your exercise interrupted by having to go pee. There I said it","commenter_a":"Duh, coffee is a powerful drug, of course things feel better when yer buzzed","post_message":""},{"comment_id":"10153874849832439","commenter_b":"I heard her spine landed on top of police car. Best news I heard today! Rot in hell psychotic bitch!","commenter_a":"Can she blow herself up again, with all her brethren with her?","post_message":"Hmmm, is she making the (Eiffel tower) peace sign? Islam is peace, brother. The good news is -- she's dead. The bad news is Obama wants to bring these 'widows' and 'children' like the refugee Boston bombers to our shores. This savage tried to lure police within detonation range by crying \"help me, help me\" before blowing herself up."},{"comment_id":"1034069336638599","commenter_b":"Cruz cannot win Ohio, Florida, New York, California, he cannot possibly win the presidency losing these key states. He only has a chance winning Texas as a key state.","commenter_a":"If Kasich and Cruz can't win in the primary how can they win the election? If the people don't want them now why would we want them later? It's not that hard to understand is it?","post_message":"Donald J. Trump on Ted Cruz and John Kasich: “Honestly Sean, they should both drop out.” Do you agree?"},{"comment_id":"10153212099990927","commenter_b":"She and Whoopi are proof that there are people in this world that shouldn't be allowed to reproduce.","commenter_a":"She is so irrelevant.","post_message":"So if you don't ago along with Obama plans...you're racist? Only the 'View' Crew could come up with something so stupid."},{"comment_id":"779579485508565","commenter_b":"Mia King you are just making things worse. People of all races kill period! I could waste my time looking for articles of blacks killing whites but I'm not trying to keep the racist shit going.","commenter_a":"The TRIBAL ATTACK is alive and well. Took seven (7) FUCKING NEGRAHS to beat up one (1) homeless white man. Put these porch monkies one-on-one and they run like the cowards they are.","post_message":"Dear liberals and the #BlackLivesMatter movement, police and white people are not the problem. This is the problem...Sickening."}]
