[{"comment_id":"1192472137454872","commenter_b":"they will have to change the toillets in the White House after this thing used them!! Please change the toilets at least for Melania!!","commenter_a":"It shows her manhood lol","post_message":"SHAMEFUL!!"},{"comment_id":"1032772820091472","commenter_b":"And white people killing white people. America is a violent country. One man can't change that! Sad, isn't it","commenter_a":"If he was still alive it still be the same thing black people killing black people so yea everything is the same thing it do not matter","post_message":"Absolutely!"},{"comment_id":"10153603915850667","commenter_b":"Thank you sir. You are right. Prayers for the family.","commenter_a":"Prayers^^^ These parents have to live with this loss for the rest of their days.This isn't the time to be judgemental or self righteous. Prayers and condolences are in order.","post_message":"The father struggled with the alligator to try to save his son, but was “unsuccessful.\" @webpagelink"},{"comment_id":"10154493614517235","commenter_b":"How about just sending all of the whites back to their mother countries and leave the Americas to the Natives!","commenter_a":"I've always believed conservatives would destroy this country and it would appear they are well on their way to doing it - maybe we should boot the old confederacy out and let them make it on their own - if Mexico wants texas back, if france wants louisiana, spain wants florida or great britain wants the southern colonies, hey guys don't call us yankees - you got what you wanted LOL","post_message":"BUSTED."},{"comment_id":"1124028447686512","commenter_b":"YES She will Win No he will Not be elected. We The People need Bernie Sanders and Elizabeth Warren in The Senate to Protect the Environment The Economy and raise a little hell with Corporate Greed and Global Poverty; End Hunger for Kids, Homelessness and Gun Violence.Heathcare Education and Social Justice For All; VOTE !","commenter_a":"Hillary won nothing I'm voting for Trump","post_message":"TELL US YOUR THOUGHTS! FOLLOW US at Reverb Press and Stories That Resonate <<<"},{"comment_id":"10156802863905354","commenter_b":"She's def a whore! Well said","commenter_a":"Hillary is nothing more than a lying, conniving political whore.","post_message":"REVEALED:"},{"comment_id":"10154537125069024","commenter_b":"Bunch of boobs.","commenter_a":" Congratulations America!!Finally...a leader!!!! @webpagelink","post_message":""}]
