[{"comment_id":"608045926060248","commenter_b":"Try saying dick her dick her. Another girl commented saying it coulda sounded like that. Lol","commenter_a":"I have alexa... She doesnt curse. She bleeps(literally) out inappropriate words in her speech automatically. Idk about this. I'm gonna try it.","post_message":"An innocent request turned awkward real fast! #WSHH"},{"comment_id":"1157767754287378","commenter_b":"This is the most ridiculous thing I have ever heard. NC, doesn't need this Administration deciding this issue for them! This administration is quick to bully states to legalize Gay marriage, overriding the will of the majority of people, bullying states to fall in line with their LGBT agenda. Counting the days til this administration crumbles.","commenter_a":"With all the crap that is going on and she chooses to fight this battle?","post_message":"“This is about the dignity and the respect that we accord our fellow citizens, and the laws that we as a people and as a country have enacted to protect them.” Attorney General Loretta Lynch formally announced that the The United States Department of Justice is filing a federal civil-rights lawsuit against the state of North Carolina, Gov. Pat McCrory, the North Carolina Dept. of Public Safety and the University of North Carolina over the state’s controversial “bathroom law.”"},{"comment_id":"1179936415364556","commenter_b":"No but it might save a few Americans! Instead of worrying about illegals they need to be worried about their own selves!","commenter_a":"Hows those gated estates working for you and Georgie .","post_message":"Says the British-Lebanese human rights attorney..."},{"comment_id":"874917705876659","commenter_b":"people need guns to protect them selves from this sort of scum. is this copper stil walking?","commenter_a":"I smell a wrongful death suit with a nice pay out cooking","post_message":"This is CRAZY! A unarmed boy's last moments were caught on bodycam, just before he was SHOT & KILLED by a TRIGGER HAPPY COP! Of course the cop will not be charged for any crimes. Blood boiling VIDEO: @webpagelink"},{"comment_id":"733367520187159","commenter_b":"we need to get these low lifes out of our country","commenter_a":"I am offended by them. I don't want to take them down but can we send them home. I m gladly contribute with the air fair","post_message":"Muslims Make Massive Move To Change The Flag Because It's Offensive If you don't like the flag you can leave. Do you think this is absurd?"},{"comment_id":"10153357244917061","commenter_b":"She should be a shame of herself. A doctor, would not want her to treat me.","commenter_a":"@username this was that crazy girl I was watching yesterday","post_message":"WATCH: Young doctor placed on administrative leave after video surfaces of her attacking an Uber driver (who was set to pickup a different customer) and trashing his car."},{"comment_id":"917503514939106","commenter_b":"Shut up bitch","commenter_a":"Surely another upstanding citizen.","post_message":"BREAKING: New police body cam video reveals the disturbing moment a white cop killed Eric Harris, an unarmed black man in Tulsa, Oklahoma. #EricHarris #BlackLivesMatter"}]
