[{"comment_id":"409403839241497","commenter_b":"The tea baggers mistresses have abortions too.","commenter_a":"It's funny how the party of limited govt wants the govt in every OBGYN office in America. Sounds like big govt to me. Teabaggers, why not just attach cameras to every uterus to make sure women are doing what you say at all times? The tea party lunacy and hypocrisy is too much. I don't like abortion but it is legal and what others do is no one else's business. You ass backwards tea baggers seem to forget that your southern women have abortions too.","post_message":"He went too far."},{"comment_id":"10153120731383010","commenter_b":"now THAT'S a woman!","commenter_a":"Yay! Now wet can objectify plus - size women too! We're all about equal opportunity around here!","post_message":"When Sports Illustrated's 2015 swimsuit issue hits newsstands next week, it will include an ad featuring plus-size model Ashley Graham. Cause for full-figured celebration?"},{"comment_id":"756504414454641","commenter_b":"Ridiculous. Keep them out at all costs","commenter_a":"I'll sell them to them","post_message":"One company that produces razor wire actually turned down a contract with the Hungarian government that would have brought them over a half-million Euros in revenue."},{"comment_id":"10154153036124369","commenter_b":"She confuses common core with curriculum. Anyone against common core is against preparing kids for the job market. The curriculum used implementing common core was written by the text book companies and approved by local school boards. It's OK to be angry at that but Kasich has nothing to do with curriculum so hopefully now you can vote for him again.","commenter_a":"Wake up Ohio.. vote Trump. You need to understand everything Kasich stands for.","post_message":"Authorities in North Carolina say they are looking at Donald Trump's behavior as they continue their probe of a violent altercation at one of his rallies last week."},{"comment_id":"1230794190274923","commenter_b":"Umm for a free orgasm I bet you would.","commenter_a":"@username how do we get our hands on some of those mushrooms!","post_message":"This fungus can give a woman an instant orgasm."},{"comment_id":"10153936646970329","commenter_b":"The American government steals from us and treat its American citizens like crap.","commenter_a":"Everyone's shit scared of the Americans cause they lie, are arrogant, have big weapons, invade any country and are religion obsessed. Same as Islam extremists. The thing they say they hate.","post_message":"Including some disturbing news for America..."},{"comment_id":"10153140451210950","commenter_b":"He is waiting for Jade Helm. Ha ha ha ha what an idiot.","commenter_a":"@username the \"President\" is not Protestant. You my friend are the dumb ass. He is a Muslim,educated in Jakarta,Indonesia at several Mosques. Born in Kenya and outer by several family members as being a \"Kenyan\" your support of this foreign born usurper of the presidency is ridiculous. Not to mention Pope Francis is evil and lacks the backing of a large number of Catholics. Pull your head out of you're ass and realize that it I simply a meeting of 2 monsters,playing pretend for the media to feed it to idiots lil you. Retard!","post_message":"For the first time ever, President Barack Obama and Pope Francis sit in the Oval Office — together: @webpagelink"}]
