[{"comment_id":"10153229988242293","commenter_b":"And who would that lady be? Certainly not this four times married adulterous who're?","commenter_a":"It takes lady to show the world what TRUE VALUES are; and how STAND UP in those VALUES ...!!","post_message":"Kim Davis entered the Carter County Detention Center under cover of night five days ago. She emerged to Survivor’s “Eye of the Tiger.”"},{"comment_id":"10156095135925389","commenter_b":"Donna I believe bush\"s were much better then the Muslim terrorist we have now!","commenter_a":"I do not want Bernie Sanders, Hillary, or Biden!!! Wake up America we need some one who will fix America!!!","post_message":"Question of the Day: Do you think Bernie Sanders can beat Hillary Clinton in Iowa and New Hampshire?"},{"comment_id":"10153489123235496","commenter_b":"Spay her quick","commenter_a":"When in the hell are we going to sterilize these sows. After the second child tie a women's tubes. That way she can be with as many as she wants, but tax dollars aren't supporting her & her brood!!!!!","post_message":"The woman was taken into custody Friday after deputies found eight children at her residence in conditions described as 'as bad as it gets.'"},{"comment_id":"1766281877023124","commenter_b":"Its not the bathrooms that rea really an issue, its the open locker roons with few changing stalls that people are really worried about since most transgenders do not get the full plumbing make over.","commenter_a":"Who is going to notice if this guy uses a men's room? I swear America is making more problems each day out of boredom. No one here in Germany gives a shit is your trans or taking your kids to the shitter. If a trans or better said a human being needs to pee I really don't care what gender they are or identify with. It's none of my fucking business.","post_message":"When it comes down to it, trans people just need to pee. That's all."},{"comment_id":"10153725968361717","commenter_b":"Stupid women....","commenter_a":"IF THEY ARE REFUSING TO DO THEIR JOB ( I do NOT care how fucking religious you are) IF YOU ARE NOT DOING YOUR DAMN JOB YOU WERE ELECTED, HIRED, OR NOMINATED FOR YOU WILL BE FORCIBLY REMOVED FROM OFFICE! GOT IT ASSHOLES? Or didn't your religion TEACH you that ASSHOLE!","post_message":"Like Kim Davis, the Wyoming judge has cited religious beliefs in her refusal to marry same-sex couples."},{"comment_id":"1218857281537727","commenter_b":"She is still authentically uncorrupted. may she hold on to that and help the US find itself again","commenter_a":"Could please run for president ! Please","post_message":"Education is power and to fight sexism and inequality, Michelle Obama has a message to young girls around the world. (via NowThis)"},{"comment_id":"918479428207062","commenter_b":"\"If you don't have the guts to run for office on your ideas, then you shouldn't run for office at all.\" Thank you, @username. #realtalk","commenter_a":"The last two elections I couldn't get to the polls because of 14 hour workdays","post_message":"If you don't have the guts to run for office on your ideas, then you shouldn't run for office at all."}]
