[{"comment_id":"10153057265651051","commenter_b":"Freaking gross! Got what she deserved!","commenter_a":"Sick","post_message":"Some people say this principal deserves the death penalty after what she made a 2-year-old and 5-year-old do. Decide for yourselves if that’s true."},{"comment_id":"10154018738645736","commenter_b":"Isn't that gorgeous.","commenter_a":"We need some housing Kate Brown.","post_message":"People are still flocking to the Beaver State."},{"comment_id":"986689444723866","commenter_b":"She's an idiot","commenter_a":"She's as smart as a bag of hammers. Attention seeking dweeb.","post_message":"Wait until you see this."},{"comment_id":"903256166376472","commenter_b":"Where does this B S come from !","commenter_a":"Stupidity","post_message":"Incredible!"},{"comment_id":"10153348611360950","commenter_b":"And he got arrested? For what? Bitch probably asked for it","commenter_a":"NEEDLE TIME NOW. Not 50 years later.","post_message":"Officials believe the 19-year-old suspect was upset over \"a bad breakup\" with the victim's teen daughter. Police say he confronted the mother as she was leaving her car, shot her multiple times and then went inside her home and fatally shot a dog."},{"comment_id":"1734707080142446","commenter_b":"@username fuck outta here!!! Hahaha biggie pulled more bitches!!!!! REALIZE THAT NONE OF THOSE FEMALES U NAMED IS BAD ALL UGLY ASS HOES!! THE BEST LOOKIN FEMALE BIGGIE GOT TUPAC FUCKED (Faith)!!!!! Jada Smith shut biggies females down lol","commenter_a":"Biggie, cus todays people are too stupid to understand Tupacs lyrics lol","post_message":"VOTE NOW! 2pac vs. The Notorious B.I.G. -- Who'd be bigger today? #DEWcision2016 #sp See how your fellow hip-hop fans are voting here..."},{"comment_id":"396121180569763","commenter_b":"Yes she definitely deserves to lose her license bigoted bitch","commenter_a":"Not only doctor in the world......find a new one...wouldn't want that dr touching my kid.","post_message":"Does the Hippocratic Oath allow for doctors to make this kind of choice?"}]
