[{"comment_id":"10152734752677434","commenter_b":"Lol","commenter_a":"Hmmmm I actually do think he's kinda sketchy re: women. If he's so power to the people, then where was he when Gore or Kerry ran? Just sayin","post_message":"Bernie Sanders wrote an essay in 1972 that mentions rape, and it's weird as hell"},{"comment_id":"1009393132499179","commenter_b":"Is this guy even alive? He looks like a bad wax figure.","commenter_a":"Trump set the tone and this jerks lowered the bar to a new level. He should be removed from his position immediately!","post_message":"This is definitely disturbing."},{"comment_id":"1382411831811576","commenter_b":"No reason to make threats or warn the Racist idiots..........when they start a ruckus, we'll bury them!","commenter_a":"..and people like you want to start a race war. You can't win that one...","post_message":"@webpagelink"},{"comment_id":"1159620574116477","commenter_b":"Why doesn't she leave, to many people here anyway.","commenter_a":"American is great, but we all have to remember who we got this great country from the great American Indians they should be the only ones who can say who can stay and can't.","post_message":"This whiny Home Depot employee is going viral in all the wrong ways after a man's photo caught what was on her hat... this is disgusting. The employees of this Home Depot store clearly don't want our money, so let's make sure they don't get it."},{"comment_id":"1253114871421932","commenter_b":"@username eating pussy 😂😂","commenter_a":"Who refers to going down on a girl as \"giving head\". Wtf kinda gay shit is that... \"yeah I gave her head last night\" wtf","post_message":"Who should go first?! #WSHH"},{"comment_id":"10153105889332235","commenter_b":"Oh no! Someone stole my vagina!","commenter_a":"\"Like she'd protect her purse or phone\" not even touching the objectification of a woman's anatomy there, but yeah let's make it legal to steal those too, that'll stop people stealing them. Am I right!?!?!","post_message":"Just. Wow."},{"comment_id":"1619157871724827","commenter_b":"oh come on this is another lie and I would sue thevhekl out of Gloria and this bimbo! all these women have come back and stated they lied!! this bimbo wants her 15 minutes and she has no merit! ! he was right most Hollywood women will let you grope them for them to get ahead!! funny how all these women kept going around him time after time therefore it did not happen or they would not have wanted to be around him!!","commenter_a":"Blah blah blah,,,,, ummm what happened to all the other woman during the elections. Bye felicia","post_message":"WATCH LIVE: Donald J. Trump to face lawsuit from woman alleging sexual misconduct."}]
