[{"comment_id":"1090226121037135","commenter_b":"Islam and muslims are biggest threat.","commenter_a":"Israel stands with France against terrorism. Do France stands with Israel against the same terrorism?","post_message":"France's year of terror"},{"comment_id":"10155442182635615","commenter_b":"Fix that damn grill! She looks like a damn key maker!","commenter_a":"get a new haircut, for starters...","post_message":"What do you think they should do with it?"},{"comment_id":"10153370538292144","commenter_b":"@username She's a Republican.","commenter_a":"Not all republicans are pathological liar but all pathological liars are republican.","post_message":"\"This is not normal political hucksterism. It's a pathological disregard for the truth.\" —Kevin Drum"},{"comment_id":"671356856304361","commenter_b":"Absolutely! Well said @ Nick..","commenter_a":"I think anyone that can actually read and does read about the UN`s actions will know that something is very wrong here, there is corruption at work, right at the top. Their anti Israel bias is painfully obvious in deed and action, compare what they levy against Israel in comparison to every other country under the UN, read some of the insane quotes from Palestinian sympathizing UN members and you will have the naked truth envelop your logical thinking in determining that ulterior motives are at work, insidious schemes are hatching and Israel is in the UN`s sights for dubious reasons. They are utterly obsessed with attacking Israel on the world stage and make not one effort to direct their attention anywhere else. We see the bias, we understand corruption is undermining the very fabric that weaves the tapestry that makes the UN have any credibility in the eyes of ...","post_message":"Israeli sources detail president’s ‘difficult’ 30-minute post-election call to Netanyahu, posit grave scenarios for diplomatic rupture"},{"comment_id":"10154094997078132","commenter_b":"don't reproduce...","commenter_a":"Jus had my babies let me put my fake lashes in n do my makeup for the pic..","post_message":"The only thing keeping Jaeyln and Luis apart is a year."},{"comment_id":"10153572562143645","commenter_b":"the woman must have a strong heart...I would have had a heart attack and expired right then and there!!","commenter_a":"I would have been spooked","post_message":"This furry creature gave an elderly woman a rude awakening when she found it curled up on her chest."},{"comment_id":"10155284282375294","commenter_b":"Lets bathe her in lice then fill a bag with mayo and drownd her in it","commenter_a":"@username wow ppl are stupid","post_message":"A tragic ending after a family attempted to use a home remedy to treat an 18-month-old girl with lice."}]
