[{"comment_id":"10153467191368132","commenter_b":"She is definitely showing side boob. I wouldn't let my daughters wear that when they're old enough for prom","commenter_a":"I like the dress! Maybe we should teach our boys to control themselves instead of teach our girls they should feel ashamed of their bodies.","post_message":"What do you think of the open-back design?"},{"comment_id":"10153702293656636","commenter_b":"better christian refugees than islamic terrorists.","commenter_a":"This is a Christian country and if you dont like it, dont worry!! We will not cut your head off or throw you off a building, or blow up innocent people ...we all know the \"kind\" religion that does all that kind of stuff..","post_message":"'One question they asked me was very strange'"},{"comment_id":"623412734499592","commenter_b":"Stupid ass mofo","commenter_a":"The next President","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153988463481077","commenter_b":"If this is true, shame on her! She should be charged too!","commenter_a":"So she knew about it before it happened?","post_message":"Mateen's current wife told the FBI that she was with him when he bought ammunition and a holster, and that she once drove him to Pulse because he wanted to scope it out."},{"comment_id":"10157031950785206","commenter_b":"Lady like OMG!!! The way she lied and attacked Hillary!!! Yeah, she was real ladylike LOL!!!!!","commenter_a":"WOW! What a disaster you were just now on Chris Matthews Hardball. No wonder you have sunk in the polls and have been sent to the kids' table when it's time to debate. Your behavior was terrible.","post_message":"Cheer on Carly in the debate right now—LIVE on Fox Business! Even if you don't get Fox Business, you can watch the debate for free online at foxbusiness.com."},{"comment_id":"10156586840470147","commenter_b":"Tildon Peacock, so using your guidelines, abortions should only occur when there was rape?","commenter_a":"The law already acknowledges the unborn child as a human being. If a pregnant women is murdered, it's classified as a double homicide. Regardless, it should have a right to live as we all had the opportunity. If society calls a germinating seed a plant, we can call an unborn child a human being with rights.","post_message":"Wow..."},{"comment_id":"885152951544454","commenter_b":"I am parra phrasing as I am not really comfortable with the terms \"richer and poorer\" x","commenter_a":"How can she handmake 3000 items a day???","post_message":"Meet the richest seller on Etsy"}]
