[{"comment_id":"10153460687383598","commenter_b":"Wretched evil vile women","commenter_a":"These sick people are going to BURN IN HELL","post_message":"NEW VIDEO: Planned Parenthood official caught selling aborted baby's eyeballs"},{"comment_id":"10153712087136336","commenter_b":"That teacher should be ashamed of herself she is just a bully!!!","commenter_a":"So very, very sad. The teacher should be fired.","post_message":"Lloyd's mother, Nyesha Terry, found him seated at a desk away from other students wearing a trash bag a teacher had turned into a poncho."},{"comment_id":"1802884339926690","commenter_b":"evil woman","commenter_a":"You're right, Donald. She doesn't give up. She's been fighting to keep people like you from preying on others - all her life! You aren't even qualified to clean toilets.","post_message":"\"You interrupt me all the time. Why don't you interrupt her?\" All the times tonight's #debate moderators and Donald J. Trump talked over each other. @webpagelink"},{"comment_id":"1008549135942537","commenter_b":"Stupid..and when it doesn't work do they turn in their brooms?","commenter_a":"Pray for our president every day!","post_message":"Witches Plan To Cast A ‘Binding Spell’ On Trump And His Supporters Every Month During The Crescent Moon @webpagelink"},{"comment_id":"1792831500973232","commenter_b":"Fucking Pussy","commenter_a":"Nice, so with the looming threat of another cold war, you guys will be able to cover the war with Russia when it happens! :D","post_message":"Signs are pointing to Madam President."},{"comment_id":"10155246322201509","commenter_b":"Hillary will only do what pads her pockets and feathers her own nest...","commenter_a":"Trump Newest Hat Says \"The Low Educated Loves Me\" #TrumpIsAnIdiot!","post_message":"Nope, the newest Donald J. Trump hat isn't a parody."},{"comment_id":"1557321691221611","commenter_b":"karma is a bitch at times","commenter_a":"When is it anybody else's business! Tell them to butt out!","post_message":"Way to go mom!!!"}]
