[{"comment_id":"485585728298674","commenter_b":"She is death warmed over!","commenter_a":"Not the first time Nancy has been hit. A face rearrangement could only improve her looks.","post_message":"Greta just kicked Pelosi to the curb... Good. We need more American women like Greta and less like Pelosi. Do you support Greta taking on Pelosi publicly?"},{"comment_id":"10153461345971130","commenter_b":"Arrogant bitch. Who does she think she is? Shut up and go back to whatever latin dump you crawled out of.","commenter_a":"Coreena Christensen could agree any more!!! perfectly said","post_message":""},{"comment_id":"900773723315710","commenter_b":"And how is this news? Last time I checked, Mail was supposed to be a page for news.","commenter_a":"just kill them all anyway","post_message":"In these exclusive pictures, she goofs around like a typical London schoolgirl. Here we reveal what poisoned the mind of the 15-year-old who's run off to join ISIS."},{"comment_id":"10153983597909726","commenter_b":"ugliest face on the planet,put the bitch in shackles","commenter_a":"It puts them under oath and on the record and if any take the 5th it'll hurt Hillary even more, especially with Independents and Undecideds.","post_message":"Hillary Clinton's aides will be questioned on emails by the U.S. State Department. Will this make any difference?"},{"comment_id":"1180266452035470","commenter_b":"@username... Exactly! They're just drugged and/or drunken hoes.","commenter_a":"I FEEL YOU SHOULD HAVE A LIMITED AMOUNT OF KIDS IF YOU ARE ON WELFARE.","post_message":"WHOA! This judge goes off on this arrogant and ungrateful mother of 12 kids who has gotten a ridiculous amount of freebies from the state. What this mother says will disgust you. Can we get 2,000 'LIKES' to take back all the benefits this ungrateful moocher has gotten?"},{"comment_id":"498036517054013","commenter_b":"if they have all that money they should go back wehre they came from","commenter_a":"Do not cave in. Do not sell any land to them. Be careful who you sell to that that buyer does not plan to re- sell to them. It is not unreasonable to consider that it is a possibility.","post_message":"STAND YOUR GROUND! Muslim are IRATE that Small Town Colorado Christians Won Sell Them Property to Build a Mosque! Show your support for these Americans who said HELL NO! NOT IN MY BACKYARD!"},{"comment_id":"10154445854511973","commenter_b":"this is what i think about blm's","commenter_a":"CRIMINAL PIGS OF AMERICA!!","post_message":"We are broadcasting live from downtown Portland, where members of Don't Shoot Portland are holding a press conference regarding the recent shooting of Quanice Hayes, 17, by a Portland police officer."}]
