[{"comment_id":"10153937473666336","commenter_b":"Michell is NOT a woman.","commenter_a":"PU$$ Y !!!","post_message":"\"You help keep us free. You help keep us strong. Whatever service you're in, whatever branch, we are extraordinarily grateful for everything that you do every single day.\" – President Barack Obama"},{"comment_id":"10154655136218984","commenter_b":"Makes you wonder why she's riding in a van! Not very comfortable and certainly not presidential.","commenter_a":"Not a Hillary fan but have you ever tried getting out of one of those van back seats?","post_message":"There's some new footage of Hillary Clinton making the rounds, and it's exactly what her campaign does NOT want America to see. Here's what happened to Hillary when she tried to get out of a van. This confirms a lot of things that we'd feared about the Democrat nominee..."},{"comment_id":"1008378105905084","commenter_b":"She has more than a few screws loose!!!!","commenter_a":"Which Koran.","post_message":"Nancy Pelosi Quotes Mohammed and Pushes Islam at the National Prayer Breakfast"},{"comment_id":"10153829550465575","commenter_b":"Go home Cruz we want trump !","commenter_a":"Trump is a strong supporter of the Second Amendment! This post is another poor attempt to win votes for Cruz. If Killery or Bernie win the Second Amendment is in trouble as will be the first. I am sure the Feds are wanting to shut the internet down so we can't inform each other on what they are up too. Lets face it! The internet has shown America how corrupt our Government has become. Without it we would never have known.","post_message":"These are the lies that TRUMP is referring to. . . ."},{"comment_id":"10157076515550354","commenter_b":"Agree . No one uglier or nasty except her daughter !","commenter_a":"Where's my $$$? Ohhhh...she wants online trolls who will say something good about her....my mistake...","post_message":"SURPRISE!"},{"comment_id":"10155397159458797","commenter_b":"And no telling how many more he has! Since he likes to pull on ladies p___y. Freak!","commenter_a":"Since you all won't acknowledge our formal president as the \"First Black President\" i will only acknowledge trump as the FIRST PRESIDENT WITH THREE BABY MOMMAS' BAHAAAAA! HAPPY BLACK HISTORY MONTH!!!","post_message":"On this first day of Black History Month, we recognize former President of the United States, Barack Obama. He was the 44th U.S. President and the first African American to serve as president."},{"comment_id":"1056274324413039","commenter_b":"You ladies here are absolutely correct, with your minds guns are for killing, and yes you for sure do not need to own one. If a person thinks that guns are just for killing, they sure as fuck better not own one... Let's start a new asshole list and get some signatures that states, If you are a total fucking idiot that believes guns are just to kill shit, then you do NOT and will NEVER be able to own a gun. :) Hows that ladies better? I broke it down and separated the stupid shit you people come up with. Ok, lets hear whats next,...","commenter_a":"Gun nuts who needs loads of weapons and ammo suffer from paranoia. Paranoia is a mental disease. Any person, especially those with existing mental problems can have a psychotic break any time. People like this are dangerous to the rest of us.","post_message":"Nothing says \"I'm a good Christian American\" more than protesting a priest calling for peace."}]
