[{"comment_id":"10156440483580492","commenter_b":"Elouise faux? Why even post this garbage?","commenter_a":"Nah, it was just ratatouille ...","post_message":"Rats may love eating our finest delicacies, but they don't belong INSIDE of them."},{"comment_id":"10153070274883010","commenter_b":"Wait, so your bathroom at home is a symbol of Sodom and Gomorrah?","commenter_a":"Welcome to Sodom and Gomorrah.","post_message":"A new West Hollywood law will require gender-neutral restrooms."},{"comment_id":"779579485508565","commenter_b":"Mia King you are just making things worse. People of all races kill period! I could waste my time looking for articles of blacks killing whites but I'm not trying to keep the racist shit going.","commenter_a":"The TRIBAL ATTACK is alive and well. Took seven (7) FUCKING NEGRAHS to beat up one (1) homeless white man. Put these porch monkies one-on-one and they run like the cowards they are.","post_message":"Dear liberals and the #BlackLivesMatter movement, police and white people are not the problem. This is the problem...Sickening."},{"comment_id":"924082021021384","commenter_b":"and hate smart women.","commenter_a":"What happened with the great Sara Palin she not running lol","post_message":"They might need a bigger stage..."},{"comment_id":"10152790517586051","commenter_b":"What a piece of crap he is. Cut his manhood off and feed it to him.","commenter_a":"we need a little eye for an eye justice","post_message":"This man broke in, put a knife to a woman’s throat and raped her as her husband lay right beside her. And he didn't stop there."},{"comment_id":"10156415559120354","commenter_b":"This woman.. Needs to be sent to a Muslim refugee camp ... What a sorry idiot ...","commenter_a":"Bill should be running for president","post_message":"“56% of Americans believe that the Syrian refugees have odds that are at values — their values are at odds with our values. That may not be wrong. If you are in this religion, you probably do have values that are at odds. This is what liberals don’t want to recognize.\""},{"comment_id":"10154534719475695","commenter_b":"She should of just kept her mouth closed. #LessonLearned","commenter_a":"Good!","post_message":"Her employer and Miss Alabama pageant organizers are responding to the video, watched by 600,000 people."}]
