[{"comment_id":"1390094244343935","commenter_b":"I hope she does. Even easier for Trump to win","commenter_a":"No I don't. There are other qualified people.","post_message":"Want to see Elizabeth Warren on Hillary Clinton's White House ticket? It might not be so easy."},{"comment_id":"10153987793981320","commenter_b":"She is such a bimbo","commenter_a":"They have to be kidding! She is a joke! Tina Fey would do a better job!","post_message":"Sarah Palin has officially endorsed Donald Trump for President, but does it matter? Thoughts?"},{"comment_id":"1131647630206805","commenter_b":"I know. He's been promoting terrorism all throughout his presidency. The liberals are dead set on destroying this country. Obama is'nt even a citizen of this country. All of his records are sealed.","commenter_a":"This pos along with the president who endorses cair need to be locked up or shipped off to a Muslim country where they won't have any problems getting along with their fellow Muslim brothers. Muslims commit more atrocities than any other religion in the world and she has the nerve to call our servicemen and women murderers. This organization is a terrorist group and should be disbanded and everyone of them deported!!!!","post_message":"This is guaranteed to be the most vile and despicable thing you see all day..."},{"comment_id":"10154269953567439","commenter_b":"Wouldn't be Muslim refugees if our leader would fight for them . He wants them to spread out and start a war of Islam","commenter_a":"Those Muslims were Barack Obama's son's","post_message":"This woman is brave to come forward and tell this gruesome story. Only one of the five Muslim migrants were apprehended. The other four \"escaped the country.\" Don't believe it. They are being hidden by the Muslim community much the way the Paris jihadis were."},{"comment_id":"429016630556711","commenter_b":"Fuck off cunt slut ...","commenter_a":"Why is the cuffed woman running? If she woulda kept her cuffed ass where it needed to be she'd be fine","post_message":"This cop was too lazy to run after the woman so he tasered her causing her muscles to lock up. She fell, hit her head and later died from injuries. What do you think of this case?"},{"comment_id":"1174393302606728","commenter_b":"I want my money back it is ugly and doesn't make her any better","commenter_a":"She could wear a 100,000 and it wouldn't help her looks","post_message":"Woman of the People"},{"comment_id":"10153855436966337","commenter_b":"It's a final effort to get her extra viewers lol","commenter_a":"God no! Jim Ian Eric Jesse Omar Eric","post_message":"PRETTY COOL: Do you want to see 'Supergirl' meet up with 'The Flash'?"}]
