[{"comment_id":"10152879630121336","commenter_b":"Shes got her hands full.","commenter_a":"Blessings","post_message":"A Montana woman gave birth to a set of identical triplet boys in early December, a rare occurrence — especially without the aid of fertility drugs. @webpagelink"},{"comment_id":"10154780678681509","commenter_b":"The day has finally come when guys can legally go into a womans bathroom lol thats amazing","commenter_a":"There's no recorded incidents of trans people doing anything untoward in rest rooms - Republican Christian politicians on the other hand, there's lots! Ban them.","post_message":"It's deadline day for North Carolina Gov. Pat McCrory. The U.S. Justice Department says the state's controversial bathroom law is in violation of the Civil Rights Act and gave him until today to respond. McCrory says what he chooses to do goes beyond the Tar Heel state -- it will affect the majority of Americans."},{"comment_id":"516585565198690","commenter_b":"Leave America, why are you here? Go back where you belong, we don't want you.","commenter_a":"Ship them all back to the hell hole they came from. We don't need or want them.","post_message":"This state just voted to ban Islamic laws… Good. We won't stand for Shariah in America and neither should you. Do you support banning Islamic laws in all 50 states?"},{"comment_id":"10158298295275206","commenter_b":"@username Memisevic you want to be a victim so bad. Girl go lay down.","commenter_a":"This is exactly why NFL players are doing what they are doing, and you are pissed at them!?","post_message":"“We saw that Terence did not have any weapon. Terence did not make any sudden movements. We saw that Terence was not being belligerent.”"},{"comment_id":"1011883318957553","commenter_b":"Justice should have been being served all along! Hillary should already be in Prison!","commenter_a":"I release the anointing here","post_message":"We've come too far to turn back now. Make sure you're registered to vote: IWillVote.com"},{"comment_id":"1275021955856646","commenter_b":"They just need to stay out of our vaginas!","commenter_a":"Talk about several steps back for women's rights. Then women will need permission to use birth control, to vote, to get a job ... And if you are foolish enough to think permission is only going to apply with abortions, you are mistaken. This is Christian right wing control. Can you say Sharia Law, anyone?","post_message":"Oh look, more people not minding their own business."},{"comment_id":"10153707450494218","commenter_b":"I DONT CARE if he was Sellings DRUGS or Selling His MOTHERRRRR These Six Police Officers TOOK A LIFEEEEEEE PPL.. ANd for that They Shall SUFFERThat's IT That's ALLLLL","commenter_a":"No justice for the 6 officers who were doing their job. What do we have police officers for? That needs to be explained..... Mr. Gray was a drug dealer plus numerous other things. Baltimore wants to keep drugs in their streets it seems! My thoughts only and Mr. Gray, well he would have gone to prison if he lived I hope.","post_message":"#BREAKING #FreddieGray Judge denies motion to dismiss charges against 6 police officers in death of Freddie Gray. He also denied a motion for State's Attorney Marilyn Mosby to recuse herself. Follow live updates: @webpagelink READ more here: @webpagelink"}]
