[{"comment_id":"1753303961361759","commenter_b":"Ooooh a compliment! Now go get your pussy grabbed by some rich wrinkled old prune.","commenter_a":"she's a Hillary wannabe","post_message":"I’m still banned from speaking on the floor of the Senate about the nomination of Jeff Sessions to be Attorney General. But this morning, I met with civil rights leaders and other Democrats right outside the Senate floor to say: Coretta Scott King will not be silenced."},{"comment_id":"1148960128472164","commenter_b":"Beat the whore","commenter_a":"Ok idiot, lets say this girl had no idea he was married and after realizing how dumb you are, he leaves you bcz he knows deep down that he is to blame not the girl....","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."},{"comment_id":"978940745501376","commenter_b":"Fire Her!","commenter_a":"Forgive them; they know not.....wait, let's not.","post_message":"DISGRACEFUL MSNBC HOST: Katy Tur Speaks over the Star-Spangled Banner at Trump Rally (VIDEO) @webpagelink"},{"comment_id":"1135459499799639","commenter_b":"END THIS EVIL INBRED FERAL ISLAMIST BARBARIAN DEATH CULT NOW, WHEREVER IT EXISTS!!","commenter_a":"Vote Trump and we won't have this problem.","post_message":" correctness is putting America in danger and it's time to take action and protect our country!"},{"comment_id":"1890218664531612","commenter_b":"Bitch please","commenter_a":"I wish they had either a dislike tag or a big BOO we could tag!","post_message":"By selecting this unqualified ideologue, Trump just declared war on public schools. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10156383221255354","commenter_b":"I can face God and not fear my fate if all muslims are eradicated from the earth. This is only the first of many attacks and I feel not a single muslim can be trusted. Call it racism, call it profiling or plain ol fashion hatred but they all are the enemy to the rest of us and their death is our only option.","commenter_a":"War involves two sides! Until we realize the Muslims are at war with us, we will continue to lose!","post_message":"\"This is war.\""},{"comment_id":"10154307345026729","commenter_b":"I am a liberal and I totally agree with the poster, so why are you irritated with liberals; your reasoning doesn't make sense to me.","commenter_a":"Or becoming traitors and taking over federal buildings!","post_message":"This will definitely irritate liberals and the \"coexist\" crowd"}]
