[{"comment_id":"1216674918389035","commenter_b":"Vote Hillary","commenter_a":"Vote Hillary","post_message":"“En mis primeros 100 días, voy a introducir legislación para una reforma migratoria integral con camino a la ciudadanía. Esto no solo es lo correcto sino que cada análisis independiente ha demostrado que añadiría cientos de miles de millones de dólares a nuestra economía. Mantendría también a las familias juntas. Tenemos que sacar a las personas trabajadoras fuera de las sombras. Estados Unidos siempre ha sido un lugar donde personas de alrededor del mundo trabajan duro y aplican sus talentos al crecimiento e innovación del país en la búsqueda de sus sueños. Así que haremos todo lo posible para lograrlo” —Hillary."},{"comment_id":"10153646418046770","commenter_b":"Me too...bad ole' white Cain and Trump lovin' women...shame on us...NOT!","commenter_a":"Love you Herman Cane! Oh, wait, you are black and I am racist! Isn't that what they say! Oh well, I love you, Dr Ben, Allen West! I guess I can be racist some other day!","post_message":"The Cain Train is Back in the Station - Herman Cain is back again live on day 2 of Trump's Convention"},{"comment_id":"10153540366322061","commenter_b":"It's not. But I've never seen it happen. Making laws to protect the rights of others is NOT discrimination. Even if you find the laws offensive.","commenter_a":"So why is it alright to discriminate against Christians?","post_message":"Charles Barkley pushing the NBA to move the All-Star game from North Carolina due to state's so-called \"anti-LGBT\" law. \"As a black person, I against any form of discrimination.\" @webpagelink"},{"comment_id":"962643217106352","commenter_b":"all i can say is zombies! now we have to worry about zombies crossing the border, thanks south America.","commenter_a":"Freaky.","post_message":"A family in Honduras that claimed teen was screaming from inside her coffin have made international headlines with their actions."},{"comment_id":"1800270353550404","commenter_b":"She is a news whore and can't stand when she's not the center of the news! Whole thing probably a publicity stunt!","commenter_a":"insurance","post_message":"Kardashian West has yet to post about the incident in the days since it all allegedly went down."},{"comment_id":"10154208649726770","commenter_b":"She needs to go so she can do no more damage","commenter_a":"She will be dumped her country is tired of Muslims ruining their country raping their women","post_message":"Merkel's party is second in polls for the first time since 2010"},{"comment_id":"1469871926366166","commenter_b":"@username...... leave Our country!!!!","commenter_a":"Too late you racist p.o.s. you are hatred and bigotry..","post_message":"\"We will reject bigotry and hatred and oppression in all its forms, and seek a new future built on our common culture and values as one American people.\""}]
