[{"comment_id":"10153549615210667","commenter_b":"But not in the women's room with a dress on..","commenter_a":"Wow! Another church minister bites the dust.This is so sickening.","post_message":"Authorities say the two suspects answered online ads specifically offering sex with an underage girl."},{"comment_id":"10152834181476135","commenter_b":"Another feminist circle jerk. You silly basic b*tches need to go take a hike and get off Facebook and tumblr.","commenter_a":"The amount of ignorance in these comments.....","post_message":"Cortney Bogorad says, despite the embarrassment she felt after the incident, she is taking legal action so no one else goes through a similar experience."},{"comment_id":"10153105889332235","commenter_b":"Oh no! Someone stole my vagina!","commenter_a":"\"Like she'd protect her purse or phone\" not even touching the objectification of a woman's anatomy there, but yeah let's make it legal to steal those too, that'll stop people stealing them. Am I right!?!?!","post_message":"Just. Wow."},{"comment_id":"394094587445502","commenter_b":"No they are everything that is wrong with our world now!! We need to remove them from America!!","commenter_a":"Desert is calling. ...","post_message":"“You Are Everything That is Wrong in America”"},{"comment_id":"690460261111351","commenter_b":"spelling lady...... come on now.","commenter_a":"I think I will get off here and work. Better than listening to his lioes","post_message":"Watch LIVE as President Obama speaks at a town hall at Fort Lee. Do you know someone taking part in the event?"},{"comment_id":"10153054078171336","commenter_b":"hey @username you guys have been saying that for 6 years. Settle down haters! And you sound like an idiot.","commenter_a":"Dig deeper because this is not enough to derail her run. She kept the records!","post_message":"“Can we trust Hillary Clinton to produce all of her email when we couldn’t trust her to obey the law that she had to use a State Department email?” – Senator Rand Paul asked on tonight's The Kelly File. @webpagelink"},{"comment_id":"10154047559291770","commenter_b":"Jail her","commenter_a":"hope they CHARGE HER","post_message":"Muslim woman lied about subway attack by Donald Trump supporters."}]
