[{"comment_id":"10153724515436770","commenter_b":"She has no womb or ovaries.","commenter_a":"Transgenders are just psychologically \"challenged\" individuals with a normal complement of either male or female sex chromosomes. A genetically male transgender would (quite correctly) not be allowed to compete in a woman's race whereas a genetically female transgender would only get beaten were she to compete in a male race. Caster is (it seems) totally different. If an intersex she has two X chromosomes that would normally make a female but, unlike true females she also possesses male Y chromosomes that will give some male characteristics. If she has Y chromosomes then she isn't qualified to compete in female races but, as with female transgenders, there is little point in her trying (and she should not with two X chromosomes) to compete in male races.","post_message":"South African runner Caster Semenya dominated the women's 800-meter final Saturday in Rio, finishing well ahead of the competition to take home the gold medal. Turns out Semenya is widely believed to be “intersex.\""},{"comment_id":"1115407108512795","commenter_b":"Jay Z is trash just like his skank wife!","commenter_a":"Can't stand Jay-Z, or his mop! Sad she has to pull the hypocrite card but in office she never did anything that's credible anyway!","post_message":"“He used every word in the book. Can you imagine if I said that?” asked Donald J. Trump."},{"comment_id":"10155424731863812","commenter_b":"Build a wall, a big wall....","commenter_a":"Take our crazy liberals please. Go Trump !","post_message":"Canada's border has seen a surge in people crossing illegally from the U.S., with a 230% increase in people crossing into Quebec in January compared to a year ago. @webpagelink"},{"comment_id":"10153617313036051","commenter_b":"Lazy ass bitch","commenter_a":"Is this for real?","post_message":"This 61-year-old woman and her jobless boyfriend live entirely off government benefits. Now, they have yet another request. When you find out what they want, you're going to be outraged."},{"comment_id":"927164187324440","commenter_b":"A real woman appreciates foreskin and it's functions. I prefer a whole full functioning penis.","commenter_a":"Yeah well.. circumcised guys get blown more often scientific fact","post_message":"And now for a quick but fun history break from CollegeHumor. - Rollie Williams"},{"comment_id":"10154426235974369","commenter_b":"My Smith & Wesson says otherwise, son.","commenter_a":"If you support trump. Every time you Run or walk you will be Trampled","post_message":"Donald J. Trump really went after Hillary Clinton in his speech today."},{"comment_id":"10154568214757300","commenter_b":"Voting is a scam. I'm sorry,to say!!","commenter_a":"How tasteless","post_message":"He was asking listeners to register to vote — and then cast their ballots for Hillary Clinton."}]
