[{"comment_id":"10154293209899153","commenter_b":"What do you mean what is happening...It's been going on for thousands of years....There are POS's everywhere","commenter_a":"What is happening too many men are raping these young children, ladies be careful who you have in your home , keep your eyes on your children at all times never leave them with anyone these days it could be your closest to molest these kids...","post_message":"Joseph Genitempo is accused of sexually assaulting an 11-year-old girl. Anyone who may know where he is located is asked to call the Delaware State Police."},{"comment_id":"10153428606317042","commenter_b":"Hell NO. They invited the idiot with the gun","commenter_a":"Yes.. including the idiot that set everything into motion causing the cancellation of the biggest time of their lives.. they could of ACCOMMODATED THEM INTO A ROYAL SWEET OR BALLROOM. ..I MEAN AT THE ASTORIA ...IM SURE THEY,SPENT A PRETTY PENNY. TRAUMATIZED AS WELL. SUE EVERYONE ... Not the doorman.... They were suppose to have a \"Dream Wedding and honeymoon\" ........ . Seriously.....","post_message":"COUPLE SUES HOTEL: The couple whose wedding was canceled after an accidental shooting in the Waldorf Astoria New York is filing a multimillion dollar lawsuit against the hotel. Do you think they should sue?"},{"comment_id":"10153122318985950","commenter_b":"The bitch is the devil.","commenter_a":"stand Firm Kim .Dont Backdown .The Devil Never wins unless You let him .","post_message":"Before returning to work today, Ky. clerk Kim Davis said she is being \"forced to disobey her God,\" and that she still won't authorize marriage licenses for same-sex couples."},{"comment_id":"10154464854894087","commenter_b":"Your fucking Scum","commenter_a":"World's Greatest Groper...engraved on the back of the medal.","post_message":"BREAKING: President Obama awarded Vice President Joe Biden with the Presidential Medal of Freedom -- the highest civilian honor -- in the surprise ceremony."},{"comment_id":"10153440964853606","commenter_b":"Omg","commenter_a":"prayer for him and were r parents hope parents go to jail","post_message":"A 2-year-old boy is in life-threatening condition after he was found at the bottom of a pool Sunday evening. @webpagelink"},{"comment_id":"1287852217938587","commenter_b":"Don't worry Hillary is gonna make it all go away!","commenter_a":"everything is so simple, what would you do if you were in their place?? if you were from the illuminati or some sort of influence to the world?? right? we would do whatever it takes, use the media and technology or any type of power given to us to lie to ppl to influence the. and make them thing whatever we want to think...population control","post_message":"Now that we finally know the Orlando shooter's real motive, the question remains: why did the FBI try to hide it for so long?"},{"comment_id":"675151445982815","commenter_b":"illegals are going back..THE WALL","commenter_a":"But according to trump and his supporters he must be either a thief or a rapist. To the people that dislike Hillary for whatever reason: \"vote for her and hold your nose\", that orange Nazi is at the door, and we can't let him in.","post_message":"14-year-old mariachi singer opens night 3 of the DNC with a rendition of The Star-Spangled Banner. Sebastien de la Cruz was 11 when he sang it at the NBA Finals, a performance that sparked a wave of racist comments on social media. @webpagelink"}]
