[{"comment_id":"10155435763498812","commenter_b":"I","commenter_a":"@username pretty horseys","post_message":"WATCH: When a donkey struggles to get over a fence at a non-profit animal protection sanctuary in Italy, he gets a helping hoof. @webpagelink"},{"comment_id":"10153358285837439","commenter_b":"Well done Mr. Abbott! He should go one step further and ban/kick out ALL Muslims from the great continent of Australia!","commenter_a":"I am Australian and applaud this action by Tony Abbot. He is a staunch Catholic Christian, and a former Rhodes scholar who from what I,ve heard him say is aware of the fascist doctrines of Islam. Why other Western leaders insist on appeasement of Islam and jihadists is incomprehensible. And more importantly, suicidal.","post_message":"@webpagelink"},{"comment_id":"1070265606383000","commenter_b":"Love the response. Don't like dogs, don't come to the park.","commenter_a":"Yayness","post_message":"Allen West Republic"},{"comment_id":"395107284010899","commenter_b":"asshole mother fuckers wow","commenter_a":"Democrats are acting like children.","post_message":"Democrats LASH OUT at Netanyahu, Tell Him to Go Home, Call Him “a Child”"},{"comment_id":"1766246316922622","commenter_b":"@username don't be nervous I'll only use My 2nd Amendment if you were to try to come into my home & try to harm my Family. I'm a nice guy. Now you're saying that other country's are doing just fine without Guns? Lol NO NO NO!!! Do you see what the hell is going on in Europe with the Muslim invasion or did you forget to Mention that part? The Europeans are telling us NOT to ever give up our GOD Giving Right of the 2nd Amendment. There homes are being invaded there women & children are being Raped & the FUKIN Government are sitting back & watching it all OH & they now have a Muslim PM. Something doesn't smell right wouldn't you agree? Just like I said they take your guns so when they come like they're doing now in Europe you won't be able to defend yourself. ...","commenter_a":"You gun loving Americans are so funny. I will bet all I have, that if one of you ever find yourself in a situation like the one this douche bag is referring to, which 99,9 to 100 % of you never will, you and your gun won't do anything but piss your pants. Guns would not have stopped this, nor any other terrorist attack, just like guns isn't stopping anything in your country, quite the opposite in fact. You won't see european people from Copenhagen, Paris, Brussels or any other high risk cities demand a right to carry guns, because we don't want to, because we know it don't work and because we are not stupid. Trump is a freaking idiot and sadly many of you Americans are brainwashed and scared so easily. I really really hate using the over used and annoying word, sheep, but that is what you ...","post_message":"At the National Rifle Association convention, Donald J. Trump said the Paris attacks may not have happened if people had guns to take down the terrorists. @webpagelink"},{"comment_id":"10153591926318984","commenter_b":"She's bitchin because her kids need to eat, where are the 6 daddies at? And where do these people think that money comes from! Get a fucking job!","commenter_a":"TRY AND GET ONE OF THE JOBS THAT OBAMA AND THE DEMOCRATS ARE GIVING THE ILLEGALS THAT ARE COMING OVER THE BORDERS THAT HE WILL NOT CLOSE P.S. ASK OBAMA WHY HES DOING THIS TO YOU DO YOU REALLY THINK HE HELPING YOU AND YOUR FAMILIES IF YOU DO YOU ARE ONE OF THE PEOPLE THE DEMOCRATS SAID HAD. STUPID WRITTEN ON YOUR FOREHEADS ITS TIME FOR YOU PEOPLE TO SMARTEN UP DONT YOU THINK","post_message":"This is simply shocking... Is this what our founders envisioned for America?"},{"comment_id":"10153572381213984","commenter_b":"Real Americans care, libtards don't give a damn, want more illegals here!","commenter_a":"So sorry......","post_message":"One man whose life was forever changed the day his teenage son died at the hand of an illegal repeat offender is now embracing one 2016 candidate's message. Do you agree with what he said here?"}]
