[{"comment_id":"10153649800077894","commenter_b":"Such a hateful bitch","commenter_a":"So Janet Jackson cancels her tour, gets pregnant and then has the nerve to drop a new video that was basic as all get out......Janet will see you after the baby because 2016 is not for you.","post_message":"Janet Jackson – Dammn Baby [New Video]"},{"comment_id":"1180908731937011","commenter_b":"YOU SUCK","commenter_a":"The Chinese asked the mongols the same thing","post_message":"ON IMMIGRATION: \"I have a hard line on this. We have a country or we don’t have a country. WALLS DO WORK! Just speak to the people in Israel. #GOPDebate"},{"comment_id":"10155358304877439","commenter_b":"Think someone must be shitting they're pants cause this brave WOMAN is gonna sort the RATS out..😂😂😂","commenter_a":"This is a threat. He should be arrested and jailed.","post_message":"A 24-year-old Muslim blogger and so-called human rights activists has called for the slitting of France's Marine Le Pen for her conservative political views."},{"comment_id":"10154592396721336","commenter_b":"What a concept...build a wall! Did they get the idea from President Bill Clinton?","commenter_a":"All borders need to be secured.","post_message":"In what could be a \"told you so\" moment for Donald J. Trump, the U.K. announced plans to build a \"big new wall\" at a border port in France to prevent migrants in nearby camps from sneaking aboard vehicles heading to Britain."},{"comment_id":"10152948972001051","commenter_b":"You wouldn't see tomorrow if you shot my dog you pussy. I'll put a new asshole in your forehead","commenter_a":"NO DOG should be loose in public, PERIOD. Your loose dog will be neutralized if it approaches me. NO APOLOGY.","post_message":"Some people say the officer handled this situation correctly. Others say it was an overreaction. Decide for yourselves who is right."},{"comment_id":"10152710214754205","commenter_b":"Bitch, you're from Missouri.","commenter_a":"Another reason to hate chicago","post_message":"Secret CIA Black Sites In American Heartland For 'Disappearing' Citizens"},{"comment_id":"1610489359249521","commenter_b":"Maybe she'll have a stroke.","commenter_a":"She has RECENTLY HAD 2 BLOOD CLOTS ON HER BRAIN, FROM WHEN SHE FELL AND HIT HER HEAD. SHE IS EASILY CONFUSED, STAMMERS, SHORT-CIRCUITS , AND IS DILLUSIONAL. She is not well. \"THOU SHALL BEHOLD AND SEE THE REWA.RD OF THE WICKED\" !!!!!! Psalm 91.","post_message":"Hillary Clinton apparently needed assistance standing up at a rally."}]
