[{"comment_id":"1196095087116904","commenter_b":"This women is craving Attention poor thing","commenter_a":"And they call this art !!!! How ??? Not on !!!","post_message":"She's doing what?"},{"comment_id":"10152879384712894","commenter_b":"She's stupid what more do you expect","commenter_a":"This heifer is trying to get a job...nonsense!!!","post_message":"Raven-Symone Doesn’t Think Harriet Tubman Should Be on the $20 Bill [Video]"},{"comment_id":"10153440964853606","commenter_b":"Omg","commenter_a":"prayer for him and were r parents hope parents go to jail","post_message":"A 2-year-old boy is in life-threatening condition after he was found at the bottom of a pool Sunday evening. @webpagelink"},{"comment_id":"10153719914114060","commenter_b":"these immigrants dont have a chance getting on the housing market","commenter_a":"Dave Thompson","post_message":"“People feel rich today thanks to these crazy prices.” Swedish house prices"},{"comment_id":"10153994398911341","commenter_b":"@username tutsis have no link to Israel,,,, Until the 60 s and the palestinian/antisemite propaganda, Palestine was considered as where the jews came from, before ww2 antisemites were shouting at jews to \" Go back to Palestine\"...","commenter_a":"6 millions zionists certainly not because a lot wanted to stay in their own country ... but after WWII ... a lot were seduced by the zionist propaganda. Holocaust was accelering factor of the zionist project already busy in the 20's and 30's with help of british, Rotschild bank and even nazi's (1933 haavara agreement)","post_message":" school education system only tells you about Anne Frank and the six million Zionists that were killed by Hitler."},{"comment_id":"10153185123243984","commenter_b":"For all the rhetoric and obfuscation, will Gowdy, or anyone else, really have the stones to put this bitch in jail? Lord knows she and many others in this government belong there!","commenter_a":"Please... don't tease me.","post_message":"Trey Gowdy just hit Hillary Clinton with an attack that could end her presidential ambitions... Do you have Trey Gowdy's back?"},{"comment_id":"10153679413971051","commenter_b":"I'd inject that bitch with enough meth to make her OD & die. Eye for an eye","commenter_a":"stupid cunt deserves to spend the rest of her life in jail","post_message":"This woman allowed her little boy to overdose on meth. A jury just decided her fate. Decide for yourselves if justice has been served."}]
