[{"comment_id":"1416682211693618","commenter_b":"Ya we we'll come u 2 da seat Hillary","commenter_a":"She is a wonderful woman, read this to get the proof @webpagelink","post_message":"A reminder heading into tonight's debate."},{"comment_id":"1337467809657543","commenter_b":"Actually...now.women will do time for....oh what's that word.... MURDER! Hahahahhahahaha","commenter_a":"Abortion happens. Now if it happens in a sterile clinic with a doctor or in a back alley with a coat hanger, it's still going to happen.","post_message":"The so-called \"heartbeat bill\" approved Tuesday would result in what would be one of the most stringent abortion restrictions in America."},{"comment_id":"1887850284608044","commenter_b":"She was obviously impaired with alcohol, Thats how these freaks work!!!","commenter_a":"But the teen is also partly to be blamed. Knowing very well he is a disturbed 40 something dude who worships satan, how can u be ignorant on the values of his life. Why dint u just stay away from this monster as he wld embody all things evil that which is the hallmark of satan n the devil.","post_message":"Jailed for nine years"},{"comment_id":"10150583091169999","commenter_b":"Smart girl","commenter_a":"Tara Hosseini Chanelle Felder Curtis","post_message":"“A Bush was trying to blame ISIS on Obama’s foreign policy — it was hilarious.” Check out our sister page The New York Times Politics and Washington for more."},{"comment_id":"894582770641419","commenter_b":"Ship her out","commenter_a":"There is a special place in HELL for Rosie O'Donnell. It seems to me she is living her hell on earth her life has gone so well. Can you remember a movie? TV Show oh the view, did she get canned. What ever happened to that talk show. If I remember correctly she had problems with her own kids. I think they just didn't want anything to do with her. Go get back underneath your rock Rosie!","post_message":""},{"comment_id":"10152917193351813","commenter_b":"Women have options. Don't have sex if you can't afford the reprocussions.","commenter_a":"Why would you vote to decrease the options women have for health care? Makes no sense at all.","post_message":"BREAKING: Senate fails to defund Planned Parenthood. The road ahead is uncertain, but for today logic prevails. We’ll continue to stand alongside our partner and access to care for millions."},{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."}]
