[{"comment_id":"1329423637100902","commenter_b":"She owns them.","commenter_a":"Ivanka you rock and you are a great representative of a Jewish woman and princcess and MOm . G-d bless you and your family .NOOne has a perfect family and you exemplify derecho eretz.","post_message":"LIBERALS HAVE CONCLUSIVELY PROVEN DURING THEIR ELECTION MELTDOWN THAT THEY ARE THE SCUM OF THE EARTH!"},{"comment_id":"1882169925350064","commenter_b":"she needs 2 take a step back! She also needs 2 learn 2 RESPECT OTHER PEOPLE,S OPINIONS! If she doesn't like it here...LEAVE!","commenter_a":"Get rid of her. She's a real Bitch. Jeanie","post_message":"Whoopi Goldberg just crossed the line when she said this about Trump's children. She just got taught a lesson she'll never forget. Should Whoopi be kicked off the air?"},{"comment_id":"482004281990152","commenter_b":"Muslims are breaking our laws. Take down the sign and let muslims know that we have our own laws and as Americans we do not recognize sharia law.","commenter_a":"Shoot them all..","post_message":"First our schools, then our public areas, what's next? 'SHARE' this post, we have to let the nation know what the MSM won't. Do you agree Shariah must be stopped?"},{"comment_id":"10154459591051320","commenter_b":"A Man hungry woman will sale their children's soul to keep a man at whatever price...Sad to say ...but true.","commenter_a":"I don't get how the mother didn't know. I'm sure this poor little girl had to be showing signs of withdrawing from people, especially him. She had to be acting different. Jesus this was going on for 5 years under this woman's nose. It's so sad that this child had no one to go to and kept this secret up to this point. I pray they don't let her have this baby. And for all you right to lifers, I'm sorry, this is a 13 year old child who shouldn't be expected to keep a baby resulting from a rape, when she's a baby herself. I pray that she doesn't have severe emotional scarring and other issues. Poor child... Smh. As for the POS, I hope they split him in half in prison and he bleeds to death.","post_message":"Disgusting: Police say Mark Sutton had been raping his girlfriend's daughter since she was 8-years-old. The mother found out when she took her 13-year-old daughter to the hospital and discovered she was four months pregnant."},{"comment_id":"10153554741380950","commenter_b":"Wait until those other prisoners get a hold of her. She will wish she was dead! Many of the women in there worry about their children, and don't take kindly to those who hurt children! She'll get hers! Karma right around the corner!","commenter_a":"Do it to her!","post_message":"The 4-year-old boy's stepmother put his legs in 130-degree water for at least 20 minutes; it would have taken just 4 seconds to scald the child, prosecutors say."},{"comment_id":"1272561409477278","commenter_b":"Bitch stop lien ^","commenter_a":"Why not tell the full story instead of half?","post_message":"Over her son littering though? #WSHH #Texas #Cop"},{"comment_id":"10153154397831051","commenter_b":"Trump is absolutely right. Illegal aliens are not immigrants by the way. They are merely common criminals. Criminal is not a race.","commenter_a":"I don't want their jobs but we need our benefits. Would you let your kid go hungry to feed a stranger?","post_message":"We went to the Donald Trump protest this week to speak to his supporters and critics. Here's what they had to say. Do you agree or disagree with Trump when it comes to immigration?"}]
