[{"comment_id":"557055264492970","commenter_b":"What scum bunnies.","commenter_a":"It should be simple, if you don't vote, then don't complain! But it seems the ones who didn't vote, are the ones crying, whining, rioting and be rude!","post_message":"\"That's sort of amusing,\" Donald J. Trump senior adviser Kellyanne Conway tweeted."},{"comment_id":"10156550543770389","commenter_b":"Tonya I thought you were referring to refugees especially Syrian ones. My mistake. Sanctuary cities are liberal ridiculousness and need to stop. I don't agree with them at all. I see what you mean about a major delay.","commenter_a":"I am amazed at how Christians can look at Trump and Cruz and not see that Cruz is clearly the choice for POTUS. 'By their fruits you will know them', Matt. 7:16. Very disappointed with Sara Palin and Rev. Falwell; they should know better.","post_message":"Question of the Day: Which Republican do you think will be the best candidate for evangelicals?"},{"comment_id":"10154432155426509","commenter_b":"she is a liar","commenter_a":"In the end, She got voted because of her gender. Not saying she is bad, she is decent candidate but this woman thingy got to stop if she truly want to become a great president.","post_message":"\"In my second century, I look forward to seeing a woman president.\" She's 102 years old, and she turned out to her Iowa caucus to support Hillary Clinton: @webpagelink"},{"comment_id":"739722056160975","commenter_b":"Really tom? We are just providing facts, pull your head out of the sand, wake up,,,, sheesh","commenter_a":"it is NOT clear the killer was targeting christians....lying about this for your political purposes is irresponsible at the least. In fact, of the few facts, which have been confirmed about this awful incedent....among the most prominent is that the killer, himself was a christian...Also, that he describes himself as a \"conservative republican\" and that he was obsessed with mass-shootings. Stop lying to advance your political agenda...it's actually a big part of the gun disease gripping this nation.","post_message":"Made me want to cry."},{"comment_id":"10153521630153984","commenter_b":"Why fight it? Gay marriage can't do any more harm to the sanctity of marraige then us heterosexuals have already done! 50% of marraiges or more end in divorce! We spend billions on weddings creating unesseccary specticals that have nothing to do with the marraige spoken of in the Bible! Jesus would not condemn, He would love. Point fingers if you want but my goodness people, haven't we learned our lesson yet?","commenter_a":"Thank you Judge Wes Allen! May others follow you!","post_message":"This official took a bold stand for traditional marriage, and the initiative is spreading across the state. Do you support what this probate judge did?"},{"comment_id":"10154242655245470","commenter_b":"@username bush got much much more killed. Both are evil.","commenter_a":"Wasn't there a war going on? You all are concerned about her supposedly lying and 4 military personnel died? Any concern about weapons of mass destruction lie GW Bush told and has been responsible for 7000 deaths?","post_message":"The suit claims the victims' deaths \"were directly and proximately caused by the negligent and reckless actions of Defendant Clinton.\""},{"comment_id":"10153949819826770","commenter_b":"Trump is not against Muslims. He wants Muslims coming into the country right now to be stopped and vetted completely with what is going around in the world. He wants all the law breakers in the country that are illegally gone. And its not just them it means everyone for now till we can get a handle on jihadists trying to come in to the country. What is wrong with that!??","commenter_a":"A woman protesting in New York City just said she was protesting because Trump doesn't represent her beliefs! Well that's why we had an election yesterday and America spoke clear and loud that they were fed up with the way our country was going. The American people are tired of the murder of our unborn children. We voted!! The American people are tired of people who don't work being rewarded while people who do work are being punished. We voted!! The American people are tired of activists judges making new laws without the approval of we the people. We voted!! The American people are tired of foreigners being treated like first class citizens while our veterans needs are put on the back burner. We voted!! The American people are tired of our enemies disrespecting us. We voted!! The American people are tired of our policemen and other law enforcement people ...","post_message":"Asra Nomani is sick of the \"liberal honor brigade\" turning a blind eye to radical Islamic terrorism..."}]
