[{"comment_id":"10153877529004778","commenter_b":"Yup she's a joke","commenter_a":"Why because they know she going to give them a run for there money..","post_message":"\"Rarely in the history of any criminal case has a prosecutor so directly maintained so many conflicts of interests,\" the motion declares."},{"comment_id":"10154963214296178","commenter_b":"Did that woman just get out of bed ?","commenter_a":"How is he behaving like an authoritarian? By having the EPA enforce regulations that Congress wouldn't pass? By giving amnesty to people who are here illegally, with his pen and phone? By allowing an underling to leave men for dead in Benghazi because it was politically expedient?","post_message":"According to Brian Stelter, Donald Trump is acting like the leader of an \"authoritarian regime.\" His solution? Have the media act MORE biased."},{"comment_id":"10153951989588701","commenter_b":"Is not like police had other things to do","commenter_a":"Seriously a 38 year old man. Grow up","post_message":"The Camas Police Department said every available officer responded to the scene and canvassed the neighborhood looking for a suspect that didn't even exist."},{"comment_id":"10153286893164032","commenter_b":"She does not have the authority to get rid of common core. That will have to go through the state legislature and governor. She's all talk with nothing to support her. She truly is an embarrassment to her job and party.","commenter_a":"Bye bye common core. It sucks. The testing needs to stay. But common core needs to be kick-booted out. Talk about lowering self esteem for kids who already struggled before with math. Always a fun time in my house with my 4th grader.","post_message":"#BREAKING: Arizona students would take fewer standardized tests and Common Core standards would be thrown out under a plan just announced by schools chief Diane Douglas. Here's a look at what else she has in mind."},{"comment_id":"523969991126914","commenter_b":"That's the whole purpose of the melting pot. To asimilate and not for every culture to impose their beliefs on the rest of the country, loyalty to the people and to the American flag.","commenter_a":"Get them the he'll out of our country !!!","post_message":"A lunch lady was fired for serving pork to a Muslim student. We are in America, give that poor lady her job back. Do you agree Muslims have to Assimilate if they want to stay?"},{"comment_id":"10153603833598598","commenter_b":"Sick minded evil old women.","commenter_a":"One ignorant person!","post_message":"Nancy Pelosi: De-Funding Planned Parenthood Abortion Biz is “Taking Away Life-Saving Care”"},{"comment_id":"10153216754526167","commenter_b":"Madam President get used to it.","commenter_a":"But Hillary sucks","post_message":"Finally, everyone starting to agree that we need to shut it down. It's instructive to look at how we got to this point."}]
