[{"comment_id":"539553339568579","commenter_b":"Yes. Send them home. They CANT Obey Our laws","commenter_a":"To Syria, no return ever!!","post_message":"Furious Muslim students rush stage during American Sniper showing. They have no respect. If they don't like American Sniper they can leave. Do you agree these Muslims are out of line?"},{"comment_id":"10155284282375294","commenter_b":"Lets bathe her in lice then fill a bag with mayo and drownd her in it","commenter_a":"@username wow ppl are stupid","post_message":"A tragic ending after a family attempted to use a home remedy to treat an 18-month-old girl with lice."},{"comment_id":"899984393370316","commenter_b":"Muslims offend me so throw them out","commenter_a":"Perhaps if the Muslims are so unhappy w/ their environment they might want to go home where they won't have to deal w/ such inconveniences. Furthermore, I hope the Smith family doesn't give up their spare lot. I'm so sick of the non-Muslim world walking on egg shells for these folks. I doubt their mother country would give on one issue to accommodate my American, Christian values if I had the misfortune to relocate to their country. Why are we constantly caving to these folks!?","post_message":"Pathetic! (MUST READ)"},{"comment_id":"1391779917508701","commenter_b":"lol white girl troll","commenter_a":"The confederate flag, rebel flag doesn't stand for slavery nor against blacks. But it's OK for them to tote around black panther crap which is known as a black supremacy group?? Get a life and find something meaningful and real to whine about.","post_message":"The House has voted to ban the display of the Confederate flag on flagpoles at Veterans Administration cemeteries."},{"comment_id":"10153590364786409","commenter_b":"What a bunch of caddie women","commenter_a":"Oh I could never stand her....once Regis was gone,so was the show.....","post_message":"Kelly Ripa says she and 'Live!' staff members helped speed up Michael Strahan's departure."},{"comment_id":"995597563869829","commenter_b":"@username you are free to get the hell out","commenter_a":"Nobody takes Huff po seriously . I read it to see what liberal homos think.","post_message":"Should news sites cover Donald Trump as politics or entertainment?"},{"comment_id":"574728392714767","commenter_b":"You should be worried about all of these weekly race riots, terrorist attacks, and minority crime. All three of those factors are why Trump will win. People do not want a third Obama term, which is what Hillary offers. Why do YOU, white person support the Democratic Party, the party that hates you, and legalizes racial discrimination against you? You are like those Jews in 1932 Germany who supported the Nazi Party. You both follow the political party that calls for you demise.","commenter_a":"What I'm worried about is Mr. Reality TV turning what should be a serious debate into another stupid episode of The Apprentice, and the media not giving a damn because it makes for good ratings ... and then our dumbed-down electorate lapping it up.","post_message":"Tonight debate between Hillary Clinton and Donald J. Trump may be one for the ages. But history shows it not the great arguments we remember, but the zingers and gaffes."}]
