[{"comment_id":"981436531916095","commenter_b":"This is also the reason women live longer lol","commenter_a":"Why is it always men!?? Lol just proves us women are the wiser more clever sex","post_message":"Why you should never play with swords"},{"comment_id":"10153102979511545","commenter_b":"I heard of it last night on the news. Disgusting!!!","commenter_a":"@username have you heard about this?","post_message":"Just in: This is gross..."},{"comment_id":"10154102342209607","commenter_b":"Melania trump was a model","commenter_a":"And my question is why do we care? We elected a man with no political experience and our soon to be First Lady have nude pics floating around on the internet....I mean at this point does it matter if his family moves in? Everything about this is...unconventional lol.","post_message":"QUESTION OF THE DAY Do you think Melania and Barron Trump should move into the White House in January? Tell us your thoughts and they may appear live on Fox45 Morning News."},{"comment_id":"10152683402245667","commenter_b":"She must like getting stuff for free.","commenter_a":"He's republican. Enuff said. Lost my vote.","post_message":"Marco Rubio has \"something\" important to say."},{"comment_id":"10153615979136336","commenter_b":"The screams of protest would wake the dead if that happened.......even after the muslims get they demands met!!! This is a true blight on America!!!","commenter_a":"Should be open to all faiths. Can you imagine the liberal outrage if it was a Christian prayer room?","post_message":"\"How loud do you think the objections would be today if they spent $250,000 in taxpayer money to build a new prayer room exclusively for evangelical Christians?\" – Rev. Franklin Graham"},{"comment_id":"944173558951399","commenter_b":"Every thing that man spoke is true. Leave lady","commenter_a":"Muslim people you live in the United States . Take that f--king towel off your face . Your weak minded people . With no chance to Evolve , your stupid religion holds you back . Just get out of are country . So we can bomb you and get rid of you ! .","post_message":"A Muslim woman confronted a female cashier about her flag pin... What happened next is going VIRAL!"},{"comment_id":"726825177508060","commenter_b":"Muslims offend me. Make them leave.","commenter_a":"God help us all. Leave your American Flag flying high. I sure will. It's OUR country. If u don't like it----- get the h---ll OUT. We didn't invite u here.","post_message":"Texas man ordered to take down American flag because it offends Muslims. In our country we fly our flag. This is absurd. Do you think this is ridiculous?"}]
