[{"comment_id":"837370303025890","commenter_b":"Your just another Dumb Female","commenter_a":"Slick willy fits him better","post_message":"Just call him Adam."},{"comment_id":"10153517803776157","commenter_b":"Hmmm,,, just a little chance of rain Victoria Marshall? Need some rain in San Benito!! :))","commenter_a":"Light","post_message":"Meteorologist Victoria Marshall CBS 4 News is tracking the heat and the chance for rain in your forecast below:"},{"comment_id":"10153269295123352","commenter_b":"That last statement not only make her a dumb bitch but a ignorant one at that. Please use some of that money your boyfriend is making and educate yourself.","commenter_a":"So fake she has 3 kids no where does she have the time to make all of this stuff.","post_message":"Meet Etsy's richest seller: Mom-of-three sells 3,000 items a day and earns $65,000 a month from handmade socks and scarves"},{"comment_id":"10153232887939071","commenter_b":"@username she's a bad asss","commenter_a":"Zelal Tas","post_message":"The Canadian model who is fighting ISIS in Syria says the terrorists are all cowards."},{"comment_id":"10153331151986336","commenter_b":"Take her out Carly . We need a trustworthy Woman in the whitehouse.","commenter_a":"Thanks for sharing this I will be praying God will greatly use Carly .","post_message":"\"Hillary Clinton has demonstrated over and over again that she is not transparent. She will clearly be the [Democratic] nominee, and somebody must take the fight to her.” – Carly Fiorina"},{"comment_id":"10153894125869205","commenter_b":"Another whiny bitch.","commenter_a":"Hey dummy it's not that you are reporting about him it is you only complain about him. Where as with Hillary you are sold out to her just like Bernie.","post_message":"After getting $2 billion in free advertising from the corporate-controlled media, Donald Trump is now whining about the fact that they’re being super mean to him (by doing nothing more than reporting on what he says.) The Ring of Fire’s Farron Cousins discusses this."},{"comment_id":"1102034899855986","commenter_b":"You all want a Muslim hater so kinda breaks out even don't you think?","commenter_a":"Fuck 'em.","post_message":"American Islamophobes are beside themselves because human rights activist Sadiq Khan was elected mayor of London."}]
