[{"comment_id":"1494215257285326","commenter_b":"If ur here illegally you got to go. 100%.","commenter_a":"If you're here legally and ICE knocks at your door: Answer and say hello, you haven't broken the law so you have nothing to fear.","post_message":"ICE raids have resumed in several cities under the Trump administration, continuing to tear immigrant families apart and put whole communities in the target hairs. Thankfully, more and more people are getting aware and awake, and are hitting the streets to protect undocumented communities and protest raids, mass detentions, and deportations. Activists in many cities are holding \"know your rights\" trainings over the next several days - get involved in your city, and join the movement to protect immigrants and their families!"},{"comment_id":"1764684433799515","commenter_b":"Class all the way !! Just think they want to make America great again !!","commenter_a":"Boring & hard to understand","post_message":"It was truly an honor to introduce my wife, Melania Trump last night. Her speech and demeanor were absolutely incredible. Very proud! #GOPConvention"},{"comment_id":"659614807562431","commenter_b":"I would have left that along time ago. Angree black woman.","commenter_a":"We don't give a shit about their marriage , they are destroying America and need to be kicked out of the White House NOW!!!!!!!!!!!","post_message":"It seems that Michelle and Barack are going there separate ways. How about in the meantime, we find a president who can actually run our country. Do you agree America should divorce the Obamas?"},{"comment_id":"10154147763835329","commenter_b":"She wouldn't understand","commenter_a":"@username do it to Sydney","post_message":"how to know your sibling is on drugs"},{"comment_id":"10155415846376509","commenter_b":"Money time you know it","commenter_a":"Vinny","post_message":"New video shows power lines exploding on Merritt Island, Florida, as Hurricane #Matthew lingers just offshore. More footage from Florida as Matthew hits: @webpagelink"},{"comment_id":"10157411786570594","commenter_b":"Mean douches create little mean douches. The parents created these mean little spawns.","commenter_a":"why does the school district tolerate this? those kids should be expelled and parents should be educated about this....","post_message":"His mother has pulled him out of the school."},{"comment_id":"1308350412560406","commenter_b":"She looks like a black snowman... Where's her neck..?","commenter_a":"Who cares what this fat cow thinks???","post_message":"Whoopi Runs Her Big Mouth at Mike Pence GETS A BRUTAL RESPONSE! Wow... she should just shut her mouth! Lets get 5000 SHARES if you agree she should be FIRED!!!"}]
