[{"comment_id":"10154234015931337","commenter_b":"You poor ignorant cunts...","commenter_a":"Howard Stern's Face is a roast all in it's own. Those giant dentures, cheap wig, and dick nose.","post_message":"FROM GIRALDO TO JESELNIK... These are the most vicious roast takedowns of all-time.'Comedy Knockout' premieres tomorrow on truTV at 10:30/9:30c. @webpagelink #ad"},{"comment_id":"1921412701405309","commenter_b":"Your daughter is next.","commenter_a":"But had they wasted the dude, they'd be selling shirts with his thug face and calling for a cop lynching.","post_message":"A police officer's body camera captures the moments he and his partner were shot during a traffic stop. More details ---> @webpagelink"},{"comment_id":"10154327927746336","commenter_b":"Only thing that needs a brain is u Hernandez as u can't even spell my name which is right infront of u.. Thank God Trump is getting rid of all u illegals.","commenter_a":"Please refer to him as President Trump.. Thank u.","post_message":"This morning, Donald J. Trump tweeted out a message for Memorial Day."},{"comment_id":"836130403149880","commenter_b":"Yes please an easy will for Hillary!","commenter_a":"Get em Sarah! We want you!!","post_message":"“I’m ready for Hillary, are you? Are you coming?” - Sarah Palin"},{"comment_id":"1342964245730921","commenter_b":"Yes, Hillary ALL THE WAY!! Andrea, go away!!","commenter_a":"She asked the tough questions and Hillary was very professional and gave very informative answers. All together I think it's helped her giving this interview. Trump could never have been so poised with his answers. I think she has been doing great with her campaign. Hillary 2016","post_message":"This is not journalism by any measure."},{"comment_id":"10152595015514071","commenter_b":"Everyone's saying about larger women.. Have any if you thought that some girls are blessed with a small back but large boobs!","commenter_a":"Good!!","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"10158409138265725","commenter_b":"Now we know why she's bitter and single","commenter_a":"I can't believe she told that woman that her husband was cheating on her!!!! For her to go home","post_message":"Re-watch the video that started it all: @webpagelink"}]
