[{"comment_id":"10153007409220950","commenter_b":"What difference does it make if the victimizer was an illegal immigrant? They're no more likely to be criminals than anyone else.","commenter_a":"How about if your family was a victim of an illegal immigrant?","post_message":"Would you forgive the suspected Charleston shooter if your family were among the victims? @webpagelink"},{"comment_id":"963452387028567","commenter_b":"Judy.. that is a huge part of the problem with the US today.. Dumb parents raising dumber kids. She has NO id ... can not drive nor get married nor get any medical care. How Stupid is that? She gets sick .. just stick her in the dirt right? Great parenting.","commenter_a":"That's amazing. Her parents should be charged with abuse.","post_message":"Her parents never got her a birth certificate or social security number, never took her to a doctor or let her go to school, and now she has no way of proving to the government that she even exists."},{"comment_id":"909858709204705","commenter_b":"Absolutely ! It's not a color issue , they were intruders !","commenter_a":"What a brave wonderful woman. So sorry to hear of her loss!","post_message":"Dorothy Hendrix unloaded on thugs who broke into her house... but look what happened next. She has every right to blow those intruders away. Do you stand behind her constitutional right to defend herself?"},{"comment_id":"1203685899671880","commenter_b":"In America more people are killed by white guys than Muslims","commenter_a":"She is not brave. American people give folks a chance. Muslims do not. She knew what she was doing. Just like the Muslim who shot the police officer yesterday. She shot Trump the same way. She should have stayed away from the rally. It was a Trump Rally. Not a Muslim rally. What did she think would happen. She knew, she used the media and did not fool anyone. She also showed her true colors. Dressed like some person from the 6th century.","post_message":"This woman will restore some of your faith in humanity. Too bad her treatment at the hands of Trump and his reporters will promptly squash it."},{"comment_id":"10154028349033812","commenter_b":"@username because I CAN and honestly sick of hearing about that dn women people KILL THERE SELF everyday she's no damn different","commenter_a":"I always knew something was wrong with the story could not understand why","post_message":"Texas trooper who arrested Sandra Bland surrendered to police after being charged with perjury."},{"comment_id":"10154595284389888","commenter_b":"Oh for crying out loud. He's pissed because he can't get his bad people in. OMG. People are so childish. Illegal vs legal.","commenter_a":"Why don't U take your Iranian A$$ back to your country and direct movies over their . U don't like it here LEAVE.Sorry POS. And stick that OSCAR where the sun don't shine","post_message":"\"My absence is out of respect for the people of my country and those of other six nations whom have been disrespected by the inhumane law that bans entry of immigrants to the U.S. Iranian director Asghar Farhadi won an Oscar tonight, but chose not to attend the ceremony in response to President Donald J. Trump's recent travel ban."},{"comment_id":"707413306095459","commenter_b":"She have a bird on her head?","commenter_a":"Illegal people","post_message":"LIVE NOW: The Phoenix City Council is talking about a proposal that will designate the city as a Sanctuary City. STORY: @webpagelink"}]
