[{"comment_id":"10154403319313812","commenter_b":"On their engines a 100,000 is a lot, only had to do my head gaskets or have a burned out valve. Meanwhile my duratec engine in the Mazda hit 300,000 with little power loss. We do love or did I should say our new 2016 Outback for the whole 600 miles we had it till yesterday it was the 85th car at the single dealership to be towed away to some lot in the middle of slc airport till god knows when Subaru can pull their head out and get entire steering colums to replace.","commenter_a":"I have 4 Subaru's in the family 2005, 2008, 2010, 2012. Three foresters one Tribeca. They all have been great. never had an issue with any of them. Two of them are over 100,000 miles. Love my Subie!","post_message":"RECALL ALERT: Subaru of America, Inc. recalls 52,000 cars and SUVs over potential steering failure and warns owners not to drive them."},{"comment_id":"10156034180320389","commenter_b":"He is a crybaby and moron. I used to watch him until he started with the crocodile tears and he looked so pathetic. The media should report news and not shove their opinions on anyone. If he hates Trump, that's his opinion and he should not voice it on the air","commenter_a":"It's crazy how Trump fans treat those who disagree with them. Many Megan Kelly fans and Beck fans threw a fit that someone didn't believe as they did about Trump. Is this how we treat each other? Drop people like a rock when they disagree with us? Start name calling? Sean answered Beck honestly and with class. Which is more than most of you are doing. I have great respect for Beck AND Hannity. Even if I don't always agree with them. But after years of following Glen Beck- it's clear that nothing drives him more than a love for this country.","post_message":"My response to Glenn Beck who criticized me earlier this week for supporting Donald Trump."},{"comment_id":"10152899242557144","commenter_b":"Illegals Charlotte, illegals.","commenter_a":"\"We\" need to take care of our country first. We still have veterans dyeing before they get an appointment. Don't tell me about Mexicans.","post_message":"Wow."},{"comment_id":"10152889836291491","commenter_b":"Felicitari !","commenter_a":"I hope she and her baby are both well safely","post_message":"It's a girl!! @webpagelink"},{"comment_id":"10153731471343967","commenter_b":"But a laser pointer. Entertain your cat AND COOK DELICIOUS BACON.","commenter_a":"@username James Speck @username","post_message":"Brilliant"},{"comment_id":"10153643564026051","commenter_b":"She shouldn't be out!! WTH","commenter_a":"I don't think so","post_message":"A mom who killed her 3 kids is now demanding custody of her new children."},{"comment_id":"1180802641955155","commenter_b":"Don't let this wicked woman get away !!!!!!","commenter_a":"BETTER LATE THAN NEVER!!!!!!","post_message":"GET HER!"}]
