[{"comment_id":"10154040346806162","commenter_b":"Low life POS!!!!","commenter_a":"Sad how you kill your own child u will rotten in jail rip","post_message":"FAMILY MURDERED: A man is accused of killing his 2-year-old daughter and her mother over child support: @webpagelink"},{"comment_id":"10153581092769087","commenter_b":"give us a number, @username. How many Americans should be murdered, raped, robbed or maimed by asshole criminals who should not even be here in the first place? Here are some crimes committed against Americans by Illegal ALIENS The Sanctuary city of San Francisco protected the previously convicted illegal alien gang member charged in the murder of Michael Bologna, 20, his brother Matthew, 16, and his father Anthony, 48 @webpagelink Illegal alien stabs to death 24 year old college student Lauren Bump @webpagelink Illegal alien charged with murder for vicious stabbing death of Kathleen Byham in a Wal-Mart parking lot @webpagelink Twice deported illegal alien charged with murder of Sheriff's Deputy Josie Fox, 37 @webpagelink Mary Nagle - was raped and murdered by illegal alien who then uses her cell phone to brag about crime to her friends and family @webpagelink Illegal Alien Kidnaps, Rapes, and Buries Alive an 8 ...","commenter_a":"\"I have been thinking a lot about Donald Trump, people say that he doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan, he's giving you an outline. Why? Every time that he has brought something to the table, the other candidates take it and run. Such as, immigration, \"the wall\" and other issues. I can guarantee you that he won't give you his full plans in detail until he is standing at the podium, next to one of the Democrats. THAT is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business, without a strategy, and a form of negotiation already set. This man is prepared in business and will be fully prepared when the time is right, in ...","post_message":"Republican front-runner Donald J. Trump leads his rivals by double digits in Michigan on the eve of the primary, according to a new poll."},{"comment_id":"1124522294289594","commenter_b":"Well to be fair, she didn't do a very good job raising you.","commenter_a":"@@username, You watch what you say about my mother you no good peice of garbage!!!!!!!","post_message":"Would you do this if you saw a dog trapped in a hot car? A new Ohio law makes it perfectly legal."},{"comment_id":"1161299523890076","commenter_b":"overly politically correct, nail on the head!","commenter_a":"he offered no defense...merely doubled down","post_message":"\"I think the big problem this country has is being politically correct. I've been challenged by so many people and I don't frankly have time for total political correctness and to be honest with you this country doesn't have time either.\""},{"comment_id":"944724415582961","commenter_b":"Fuck all white people they stink as fuck come in my yard I'll kill all yall bitches I don't give a fuck about them crackers when they die they turn black bitch we all come from dust one man one woman dust is what color Brown bitch you black like us","commenter_a":"Sharokina Haghee","post_message":"This happened. A Facebook user who goes by the name of Geris Hilton posted a photo with a black child, who is allegedly the son of his co-worker. What happened next, will leave you disgusted. He and his friends decided to make racist “jokes” at the child’s expense. Had it not been for Black Twitter, they would have gotten away with it. MORE -----> @webpagelink"},{"comment_id":"1419268561466221","commenter_b":"Stop reasoning like an idiot","commenter_a":"Nothing lasts forever...whatever goes up must come down.","post_message":"Serena and Venus Williams are KNOCKED OUT of Rio"},{"comment_id":"10152865807076051","commenter_b":"This was set up by this girl and her friends - she made sure her friend was there with the video going b4 she hit the other girl-she needs to be put away for a long time and have her sorry ass beat in prison and see what a REAL asskicking is. I hope the victim doesn't get scared and not proceed with the charges.","commenter_a":"we can thank our president and people like al sharpton for all of this they have done as much as possible to entice race wars!!!","post_message":"A girl was at the park with her little brother when all of a sudden they were attacked. The little boy tried to stop the beating – but that just drew him into the line of fire."}]
