[{"comment_id":"968868466550965","commenter_b":"Let's leave tomorrow!","commenter_a":"How do we get his life @username","post_message":"Can we apply?"},{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: \"This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.\" Watch complete press conference here: @webpagelink"},{"comment_id":"1082992428420186","commenter_b":"She will never be in jail","commenter_a":"How can she send people to jail from her prison cell?","post_message":"Dangerous person!"},{"comment_id":"595246650649268","commenter_b":"You're not a woman... so we don't expect you to get it...","commenter_a":"what brand of dope is she smoking? Seems to be effective in blocking reality","post_message":"\"I think [Trump] would be very good for women’s issues.\" - Caitlyn Jenner"},{"comment_id":"10153703275114384","commenter_b":"Whine, whine, whine. All the illegals will vote for hand outs, what more do you corrupt fools need? Lying POS!","commenter_a":"BLUE ALL THE WAY!!!","post_message":"It is inexcusable for Republicans to have left town without acting to restore the Voting Rights Act. Click LIKE if you agree: Nothing should stand between American citizens and their most sacred right to vote."},{"comment_id":"1753991328222832","commenter_b":"Angry, angry woman.","commenter_a":"I hear some sniffles coming out of Philly, sure sounds like a bad case of the Blue Flu may be headed that way","post_message":"We'll see what ends up happening..."},{"comment_id":"10153888628981336","commenter_b":"@username - your brain is a mulsim! SHUT ALL \"DOORS\"!! KILL ALL muslim islams!! The only people who hate Trump are the illegals, anchor babies, muslims! Again, I ask, which one are you or are you all three? I demand to block ALL ILLEGAL aliens; muslim islams, to PROTECT OUR borders! Then IMPEACH obama blammer mouth!","commenter_a":"Obama can't help it. His father was a Muslim, not an American. His allegiance is pretty clear.","post_message":"Yesterday on \"America's News Headquarters,\" Mike Huckabee shared his perspective in light of the #SanBernardino terror attack."}]
