[{"comment_id":"10154992215446729","commenter_b":"Stephanie Hallstrom Hillary is from Chicago.....send her back there. They grew her. They can keep her.","commenter_a":"You can see her jerking several times prior to falling / collapsing. Clearly from a seizure people know the difference. She should stop her thirst for greed and power and live her life and take care of herself in the private sector for herself and the American People. It was not weather people were there saw others in worse health and heavier clothing...she came out wearing same clothes as before. She is not well. Go Home Hillary!!","post_message":"Help get this out there, folks! People need to know the TRUTH."},{"comment_id":"1138008016249439","commenter_b":"Hillary is a corrupt liar","commenter_a":"Bernie is accepting the will of the majority of democrats, and throwing his support behind an amazing woman who will make an astounding President.","post_message":"Bernie Sanders and Hillary Clinton campaign in Portsmouth, NH. Full video here: @webpagelink"},{"comment_id":"10153242859546636","commenter_b":"i agree women want equal rights go to prison for murder they will get treated these ams as men","commenter_a":"Send Teresa May then!","post_message":"Satire died on Friday 20 November 2015"},{"comment_id":"10153704706699170","commenter_b":"She got robbed! She should be #missamerica!","commenter_a":"Well, if their question was addressing 'gun related accidents', she was right on point. However, that was not their aim ( no pun intended) - their 'aim' is to ban weapons period. Their question does not address any of the mitigating circumstances that surround each of the recent incidences of gun violence and they know it. You can see it in the eyes and expressions of the questionners once Miss S.C. gave her answer.","post_message":"Wow. I don't think ANYONE was expecting this... Do you agree with Miss South Carolina's answer?"},{"comment_id":"937622143000705","commenter_b":"She can't win.","commenter_a":"Republicans are in total disarray! Hillary 2016","post_message":"According to the Washington Post, the four recent resignations have “gutted the core of Carson’s apparatus and left the 63-year-old first-time candidate with only a handful of experienced advisers.”"},{"comment_id":"10153035493893822","commenter_b":"Gross. She needs to go back.","commenter_a":"Why isn't she in jail?","post_message":"Connellsville woman charged for having sex with a 14 year old boy. The boy actually dated the woman's late daughter, who died back in June of 2014."},{"comment_id":"10156036197975293","commenter_b":"I don't get it. If a woman pulls her breast out in public it's illegal. I a man looks at her breast he's a perv. So why dose a woman want to breast feed in public.","commenter_a":"It's awesome","post_message":"A picture of some soldiers breastfeeding has gone viral. READ the story and let us know what you think."}]
