[{"comment_id":"1839325792793827","commenter_b":"Sandra you old hag","commenter_a":"I hope he suffered.","post_message":"State run Press TV said Rafsanjani, 82, died from the heart problems despite efforts by doctors to save him."},{"comment_id":"1349045918521792","commenter_b":"You have a lot of names there Laurren.. The typical liberal feminist skank.. Way to go","commenter_a":"Just a suggestion for you @username people. If you dislike Trump and hate that he won a fair election then I suggest you retreat into your safe space for the next 4 years (at least). Shouldn't cause you too many problems as you probably don't have jobs anyway.","post_message":"This website is going viral, and Trump is not happy. You know what to do!"},{"comment_id":"10152817676244877","commenter_b":"Wonderful woman","commenter_a":"RIP Queen of Gospel Music.","post_message":"ON THIS DAY IN HISTORY: On January 27 1972, The Queen of Gospel, Mahalia Jackson passed away at age 60. She became one of the most influential gospel singers in the world and was heralded internationally as a singer and civil rights activist. LIKE and SHARE to remember the Queen of Gospel!! >>@webpagelink"},{"comment_id":"10153092888622507","commenter_b":"I like planned parenthood because it will finally rid all the blacks from the US","commenter_a":"Woman, can you say Obama care? You dems rammed it down my throat saying it would take care of all medical needs. Aren't women part of this? Why should I help pay for obamacare and planned parent hood too!","post_message":"Watch Senator Elizabeth Warren crush it on the Senate floor during the debate to defund Planned Parenthood: “Did you fall down, hit your head and think you woke up in the 1950s or the 1890s? Should we call for a doctor?”"},{"comment_id":"899262110108885","commenter_b":"So Damian... You too... Just bAck up bitch .... READ THE 4TH AMENDMENT !!!!","commenter_a":"I saw this video when it first came out. During the struggle the kid mounts the cop and beats his face in.. Consistently , cop struggled and shot him. Tall goofy for this one. Watch the full vid , kid is a douche asking for trouble","post_message":"\"I don't have a weapon..\" -- Some of Deven's last words. He was shot 7 times by a cop. Get RISE OF THE WARRIOR COP for free: @webpagelink WARNING: This video contains graphic content. The full story has finally been exposed, thanks to Matthew Cooke."},{"comment_id":"10152668576767377","commenter_b":"And Hillary is a broke down bus","commenter_a":"ted needs to take a cruise, maybe to the north pole. maybe, he and santa can go ride a reindeer, and build some toys together.","post_message":"Why Ted Cruz is the Strongest Candidate for President in 2016."},{"comment_id":"659614807562431","commenter_b":"I would have left that along time ago. Angree black woman.","commenter_a":"We don't give a shit about their marriage , they are destroying America and need to be kicked out of the White House NOW!!!!!!!!!!!","post_message":"It seems that Michelle and Barack are going there separate ways. How about in the meantime, we find a president who can actually run our country. Do you agree America should divorce the Obamas?"}]
