[{"comment_id":"10153286893164032","commenter_b":"She does not have the authority to get rid of common core. That will have to go through the state legislature and governor. She's all talk with nothing to support her. She truly is an embarrassment to her job and party.","commenter_a":"Bye bye common core. It sucks. The testing needs to stay. But common core needs to be kick-booted out. Talk about lowering self esteem for kids who already struggled before with math. Always a fun time in my house with my 4th grader.","post_message":"#BREAKING: Arizona students would take fewer standardized tests and Common Core standards would be thrown out under a plan just announced by schools chief Diane Douglas. Here's a look at what else she has in mind."},{"comment_id":"10153807891284062","commenter_b":"He served our country well and is our Founding Father.","commenter_a":"Only one problem with having to be a dead president. Ben Franklin was never president.","post_message":"Which of these women would you like to see on the $20, if any?"},{"comment_id":"10153758496148487","commenter_b":"Is the message that youre a whiny little pussy? Roger that.","commenter_a":"We are sending a message to the rednecks and right wing nut cases.","post_message":"\"We join other leaders in our state who are calling for a change in the state flag."},{"comment_id":"10153660069974456","commenter_b":"You never know what goes on behind closed doors... He probably threw all disgression out the door after she found out about it and agreed to wait. A woman will only take so much and then it's Katy bar the door!!!","commenter_a":"A Sad Story Here...He Broke His Vows...I Want 2 Know Why He Cheated On His Wife...They Look Like They Was Very Happy 2 In There Marriage!!","post_message":"JUST IN: Gov. Bentley says recent allegations that he misused state property aren't true, and he will show that."},{"comment_id":"10154170781271491","commenter_b":"Oh I bet \"she\" can run alright .. run out of the white house next year take her kids and Obama with \"her\"","commenter_a":"What a beautiful,sane & facts ridden reply !","post_message":"Just because one Obama is preparing to vacate the Oval Office that doesn’t mean everyone in his family has to follow suit."},{"comment_id":"10154592575994062","commenter_b":"Hang these neggos today !!!","commenter_a":"They don't even care that they took someone life, so no one should care when they are giving them the chair","post_message":"TODAY: 4 accused of robbing a Houston restaurant and killing a man are scheduled to appear in court."},{"comment_id":"10153551784963984","commenter_b":"She wants some air time don't give it to her","commenter_a":"Yep","post_message":"These days, Donald Trump seems to be at the center of every controversy. He might just be in the midst of another one after this actress just thanked him for his stance on immigration... Do you agree with Donald Trump's views on immigration?"}]
