[{"comment_id":"10153107987369205","commenter_b":"When an illegal alien is here and gives birth to a child the child is still illegal.","commenter_a":"Matt Ely this who you want you dont know shit if this who u want","post_message":"Things get heated between Bill O'Reilly and Donald J. Trump"},{"comment_id":"10154038278856990","commenter_b":"My prayers and condolences for the family. Heartbreaking.","commenter_a":"This is horrible.... I am not sure what escalated it into him putting one guy in a headlock and then getting stabbed by the 2nd guy, but I really feel for his family. All those babies will never be able to experience a completely happy Christmas again. :(","post_message":"A father-of-four went to Target to buy gifts for his children on Christmas Eve, but was stabbed to death as his 4-year-old son watched. A witness said the victim confronted a pair of men who were allegedly playing vulgar music in the toy section. @webpagelink"},{"comment_id":"10153387831771336","commenter_b":"It's like when people are drowning we add more water.","commenter_a":"No stricter gun laws won't work. I know!!! Let's keep throwing more guns into the mix! More guns and LESS strict gun laws will definitely solve this!","post_message":"\"If it can happen in church, it can happen anywhere, so there’s no answer to it. You can't predict when evil's gonna show up.\" – Toby Keith"},{"comment_id":"10154110456411337","commenter_b":"Why are they anonymous?? Staying unknown seems cowardly... Bunch of bullies. Be open about it if that's what they feel and think....","commenter_a":"Erica Rudolph","post_message":"TOTAL WAR: Things are getting really ugly between Anonymous and Donald Trump."},{"comment_id":"1292791090782624","commenter_b":"She's a paralegal? She should make much more than a fast food worker. This is why Sanders lost. He only helps the poor. He doesn't help the hard working middle class. Where is our mandated raise?","commenter_a":"Um I went to college to make $15 an hour and I have student loans. So now people working at Burger King are going to make the same or more than me? WTF I need a raise too!!","post_message":"When working people stand together, we win. And we are winning the fight for a living wage. In 2016, a total of 25 states and localities approved minimum wage increases."},{"comment_id":"711006379048137","commenter_b":"THERE IS SOMETHING WRONG WITH THIS BRAINLESS MORON...CAN NOT LISTEN TO HER HAVE TO CHANGE THE CHANNELL.....I WISH THEY WOULD NOT PUT HER ON...DISAPOINTED CNN.","commenter_a":"I just cannot listen to her!!","post_message":"No, Donald Trump would NEVER try to draw attention to himself. /smh/ --Andrew"},{"comment_id":"10155208741709255","commenter_b":"These people need to go!!!","commenter_a":"Cowards","post_message":"Face the music, fellas."}]
