[{"comment_id":"1617460714934208","commenter_b":"Hopefully she'll waste away and go away","commenter_a":"Apparently not","post_message":"Since she's not moving to Canada, Dunham could always try eating all that crow."},{"comment_id":"10153456187686615","commenter_b":"That chick must be high","commenter_a":"Please everyone lets leave her in an empty room. I seriously don't understand how anyone could like her!!","post_message":"JUST IN: Hillary Clinton's campaign says the Democratic presidential candidate will be making a stop in Pittsburgh next week."},{"comment_id":"566696260200553","commenter_b":"They can go now","commenter_a":"Hope she goes","post_message":"It appears Bill and Hillary Clinton are making plans to flee the country to Qatar in the event Donald Trump wins this election."},{"comment_id":"893880777331086","commenter_b":"\"I kill ithith and bite their ears off\"","commenter_a":"I hope when he talks he doesn't sound like Mike Tyson or something. That would be a let down. LOL","post_message":"Yeah. That dude is pretty intimidating. ANGEL OF DEATH: Axe Wielding Militia Commander is Striking Fear Into ISIS Fighters"},{"comment_id":"10154261314153525","commenter_b":"He had it made on Howard channels. Then double crossed hogan with the tapes etc. Dirt bag. How many times can he use the connection with tony Stewart. He is a Howard copy cat with less talent.","commenter_a":"Jimmy","post_message":"JUST IN: Bubba the Love Sponge is off the air in the Tampa market. MORE: @webpagelink"},{"comment_id":"716079211915990","commenter_b":"Shirley you. Ignorant bitch","commenter_a":"How many mof these post DO WE HAVE TO SEE BEFORE IT IS DONE???? IMPEACH NOW!!","post_message":"House GOP is officially voting on the impeachment of Obama. Let's push this through. Please let this pass. Can we get 75,000 'LIKES' to have Obama impeached?"},{"comment_id":"10153823295824411","commenter_b":"You needed to be pulled over Obama.","commenter_a":"He got racially profiled into being elected president.","post_message":" as a report that came out just this week reminded us, there are a lot of African-Americans, not just me, who have that same kind of story of being pulled over or frisked or something, and the data shows that this is not an aberration."}]
