[{"comment_id":"10153051114747550","commenter_b":"I did when I was a teenager! Moms are hot!","commenter_a":"True it's sick but boys that age will bang a mom especially to show off.","post_message":"Mother accused of having sex with minors at her teenage daughter's party--> @webpagelink"},{"comment_id":"10153515397661509","commenter_b":"Race and gender identity are two totally different issues lol","commenter_a":"That's disrespectful. If it had been a white person doing a racist joke. There would be no question if he crossed the line.","post_message":"Do you think Jamie Foxx crossed the line? Many viewers of the iHeartRadio Music Awards weren't too happy about his Bruce Jenner joke: @webpagelink"},{"comment_id":"860902143955854","commenter_b":"That woman is a melodramatic idiot.","commenter_a":"Hey Nancy! Pot IS illegal and it STILL didn't stop him from giving it to his daughter! Legalize it already. Lets save Mexico from gang violence, free up the prisons, and start bringing in tax dollars from paper rolls and business sales. Enough is enough!","post_message":"What's YOUR take on the legalization of marijuana? @webpagelink #Pot2Blame?"},{"comment_id":"10153402450349456","commenter_b":"And he's out on bond in Montgomery and Elmore counties? What a joke","commenter_a":"Thug life is no good.","post_message":"One official said this is the worst case of home repair fraud he's ever seen. The suspect is also facing a murder charge in Elmore County."},{"comment_id":"10158129645930015","commenter_b":"We don't want a wall.","commenter_a":"I live in mexico , but do you know that all the money invested on that stupid wall , it will come out from your pocket , American taxpayer will pay for that wall ,not us, we ain't paying that thing, we have bigger problemas than that ,good luck with your wall","post_message":"Do you support a border wall with Mexico?"},{"comment_id":"1152822888099590","commenter_b":"Hillary is a liar, a cheat and cares more about money then Americans.","commenter_a":"Another embarrassment p***y grabber to the country...","post_message":"JUST IN: Donald Trump Jr. will be speaking at ASU on Thursday at 2 p.m. MORE: @webpagelink"},{"comment_id":"10155365024480354","commenter_b":"Loony witch....","commenter_a":"if you don't like it here LEAVE. There are plenty of non whites that are racists and fat and you seem to ne a racist yourself lady","post_message":"\"All the people who are crunched into the middle of America, the real fat and meat of America, are these racist conservative white people who live on their farms.”"}]
