[{"comment_id":"10152543335115933","commenter_b":"Amen!!","commenter_a":"Leave our kids alone! GET RID OF COMMON CORE!","post_message":"It's about time we get college costs under control, and I'm glad to have Ohio's college and university presidents on board as we move to make it happen."},{"comment_id":"1702951239953812","commenter_b":"Go to hell","commenter_a":"a liar and corrupt & a socialist what a pick for dems.","post_message":"Now it’s Hillary Clinton who has taken up the “white privilege” banner. During a recent Q&A she asserted that white people need to “recognize our privilege” and “practice humility.” Do you think Hillary is totally out of touch with reality?"},{"comment_id":"10153232997868352","commenter_b":"Serve her right she should have been in her house doing house work or school what the hell she doing out in a battle field throwing stone, lack of parenting","commenter_a":"that is horrible. This needs to be told all over the news. Sounds like something SA would do instead of Israel.","post_message":"Palestinian girl, 14, locked up in Israeli prison for two months for throwing rocks"},{"comment_id":"10152894854427756","commenter_b":"I use paper condoms.","commenter_a":"Thanks Obama. *shakes fist*","post_message":""},{"comment_id":"1151612978215863","commenter_b":"Nah, Katie. You want to talk about the real world?? Hillary Clinton is the candidate of the \"real world,\" where people DO suffer, most certainly. They are primarily people of color. They are Arabs and Persians living under constant threat of US drones. They are black youth who have been dubbed super-predators by Hillary, who have been beaten and bloodied by the police that she helped arm, and that she helped expand. They are Hondurans and Egyptians and Libyans who have been subjugated by the regimes in their countries, regimes that only exist because we can't seem to keep our fingers out of everyone else's pie. Neoliberal policy has caused more suffering in this world than even Trump promises to bring. Secondly, voting in line with ones genuine ideology is not reprehensible in the slightest. If everyone understood that, maybe we wouldn't be stuck in the two-party, lesser-of-two-evils rut that ...","commenter_a":"Lmao, fat chance on that one. His endorsement solidifies that he has been enveloped into the Democratic Party, where social movements go to die. His most ideologically loyal supporters will be voting for #JillStein, because #NeverHillary , and #NeverTrump","post_message":"Most of the #FeelTheBerners who now say they’ll go third party would otherwise be backing Clinton."},{"comment_id":"10154315963468812","commenter_b":"Weed makes you hallucinate now? Yeah let's ask the 2 ladies who have obviously never tried it.","commenter_a":"I still don't understand how marijuana is in the same classification as heroine and LSD, even though it's helping people walk! Meanwhile Oxy is prescribed every day and it's ruining peoples lives...","post_message":"Federal authorities are reviewing the possibility of loosening the classification of marijuana, which is currently in the same class of drugs as heroin and LSD."},{"comment_id":"10153105200194497","commenter_b":"I couldn't stand this chick.","commenter_a":"Tom Lombard","post_message":"From our sister publication: \"Next Week On ClickHole\""}]
