[{"comment_id":"10155874943040354","commenter_b":"Black scumbags do not matter !","commenter_a":"I'm sure Al Sharpton and his ilk will spin this as a racial injustice and Obama will write his family. Probably won't claim him as looking like his son as he's been there and done that. All of them are sick sons of bitches.","post_message":"Police say the 82-year-old did one thing that likely saved her life..."},{"comment_id":"729302233879236","commenter_b":"@username No, she is insane and a danger to others.","commenter_a":"Dreadlocks existed in Scandinavian, Mediterranean, and Middle Eastern cultures as well. Also, does this make it permissible to confront black women who have straightened or relaxed hair for taking white people's culture? No?","post_message":"\"You're saying that I can't have a hair style because of your culture? Why?\" the man said. \"Because it's my culture,\" the woman said."},{"comment_id":"1452176608135698","commenter_b":"What branch of the service was Hillary and her daughter in?","commenter_a":"Thank you for your family's sacrifice, sir, your son is a true American hero. Donald Trump doesn't know the meaning of the word.","post_message":"His son was killed while fighting for the U.S. in Iraq. Now, he's got something to say to Donald J. Trump."},{"comment_id":"10152961665786336","commenter_b":"Why would any of you morons disagree with Dr. Carson? As long as kids get vaccinated and as long as adults have already been vaccinated this Country can be protected from these diseases. Time for Obama to guarantee that anyone illegal immigrant be vaccinated...","commenter_a":"Just another reason why we need to CLOSE the borders, ENFORCE the laws already on the books and DEPORT all illegals. That means, NO AMNESTY for anyone.","post_message":"Fox News Sunday EXCLUSIVE: Dr. Ben Carson joins Chris Wallace with his stance on the vaccine debate and his plans for 2016. Check your local listings or tune in to Fox News Channel at 2p and 6p ET."},{"comment_id":"10153898297209726","commenter_b":"I know someone that used to be a neighbor to one of Bill's party friends and Bill partied there all the time. They would bring in scores of prostitutes.","commenter_a":"Look this stuff is 20 years old. Bill chased women. A lot. Hes not the first and wont be the last man to do that lets move on","post_message":"WATCH: The central figure in the Lewinsky affair is speaking out about scores of Clinton affairs unknown to the public!"},{"comment_id":"479435838921955","commenter_b":"@username not very lady like !","commenter_a":"President trump all the way people power God bless Donald trump","post_message":"For many, the look on Chris Christie's face said it all during Donald J. Trump's #SuperTuesday event."},{"comment_id":"10153512778925667","commenter_b":"Life is like a camera. Just focus on what's important, capture the good times, develop from the negatives, and if things don't turn out take another shot.","commenter_a":"They should put him in the same cell as Clinton.","post_message":"Martin Shkreli could face additional criminal charges."}]
