[{"comment_id":"10153828491470329","commenter_b":"marry me","commenter_a":"@username 2, especially 2","post_message":"We might as well put a ring on it at this point."},{"comment_id":"1157455867648336","commenter_b":"Or get the hell out of our country","commenter_a":"Think again. This is the United States, not some Middle Eastern Country. Assimilate or leave!!!!","post_message":"Muslim Leader : we are practicing Muslims, we are above the law of the land. Like if you think practicing Muslims need to follow our laws just like everyone else. @webpagelink"},{"comment_id":"1557909130909006","commenter_b":"Go watch FOX bitch...","commenter_a":"Because guns cure racism and misogyny. Vice you are officially the retarded wing of journalism.","post_message":"What radical black womanist politics organized around self-defense actually looks like, and why it matters."},{"comment_id":"10153486383431037","commenter_b":"So how many cops takes to capture one guy?","commenter_a":"Tantiana Valentina","post_message":"MORE DETAILS: Second escaped prisoner shot by police, in custody and taken to hospital"},{"comment_id":"1689857144590196","commenter_b":"I say do it, and take it even further....stop immigration altogether until a proper vetting system is implemented!!!","commenter_a":"It is unAmerican and wrong to have different rules for people of another religion. Have we really come to this? We are a free nation of fearless people, this is an insult to our national character. Trump would use that fear to further his own short term goals and incidentally the long term goal of ISIS to drive a wedge between Muslims and the rest of the world.","post_message":"Republican candidates are set to take the stage tomorrow for the final #GOPDebate of 2015. So, what do Donald J. Trump's friends think of his proposal to ban Muslim immigration to the U.S.?"},{"comment_id":"994387677320953","commenter_b":"That witch is who is teaching our children","commenter_a":"This man is on point👍🏾","post_message":"Woah, THAT escalated quickly! What's YOUR opinion?"},{"comment_id":"10153462530999255","commenter_b":"The Chinese will be happy to take its place!","commenter_a":"Is that dog shittin in the flag. Thats just wrong just wrong.lol","post_message":"You don't see Nazi memorabilia on the Antiques Roadshow for a reason."}]
