[{"comment_id":"531497917040788","commenter_b":"What a Dixie chick.....","commenter_a":"Dope head","post_message":"Tim Mcgraw fans shocked after he bowed down to Obama in this sickening way. Sorry Tim, you lost our business forever. Will continue to support Tim Mcgraw after he did this?"},{"comment_id":"10153801598562042","commenter_b":"God this makes me sooo angry I just want to cry and beat the crap out of her. She is a monster and deserves the death penalty!! Rip Little Angel!! 😢","commenter_a":"And That POS is pregnant again","post_message":"DISTURBING DEATH: A mom allegedly punched her 2-year-old repeatedly in the stomach and the child was found dead the next day. What the mother later admitted to police is horrific ..."},{"comment_id":"10153286881669641","commenter_b":"Suck my metaphorical dick @username","commenter_a":"Apparently people are paying more for cooking... Tess O' Connor @username","post_message":"Wealthy millennial women are more likely to make at least as much -- if not more -- than their husbands: cnnmon.ie/1HNES88"},{"comment_id":"536178543246730","commenter_b":"Meg Whitman is a disgrace and a lousy CEO.Bitch needs to shut the hell up.","commenter_a":"She's a fool","post_message":"SICK & SHAMEFUL"},{"comment_id":"10153519405836680","commenter_b":"You are exactly right @username. It's so sad how ignorant and blind people have become. Saying we need illegal immigrants. Wow. Have you people not seen what's going on in Europe. No they need to come to this country legally people... Thank God we are gonna get it fixed this November. And that's how it will be. We will have a safer country. Trump2016!!!!!!!!!!!!","commenter_a":"Let us call it what it really is \"Bernie Sanders hugs illegal aliens at campaign rally.\". They are not undocumented immigrants because they have not followed the immigration process to get here. They are criminals. Justice needs to be dealt out to them.","post_message":"Bernie Sanders hugs undocumented immigrants at campaign rally."},{"comment_id":"955482931153795","commenter_b":"I think everyone should mind their own business,it's between God,her and gays. Don't you think ? Stop throwing stones. So much going on in this world.","commenter_a":"Amen Rev. Franklin Graham","post_message":"Every American must see what Rev. Franklin Graham just said about the arrest of Kim Davis!"},{"comment_id":"936532806442972","commenter_b":"Is that a bad thing?","commenter_a":"Oh, please. He will become the biggest clown in the clown car.","post_message":"Donald Trump knows what he’s doing in 2016 ..."}]
