[{"comment_id":"778598825583664","commenter_b":"Don't let Chump Trump know you Clown Car passengers responded to a Megan Kelly article...She is the enemy...Have you Repubics forgotten...Clown Car Rolls On","commenter_a":"Hey Tim, I like the pocket pool!!!","post_message":"Pulls no punches."},{"comment_id":"10153593433561323","commenter_b":"when people are in the process of migrating from one spot to another they are sometimes referred to as migrants.","commenter_a":"because it describes a particular group of people. Like descibing a group of people from Norway as Norwegian or whatever. jeez","post_message":"\"You will still see the word 'migrants' or 'migration' in the Guardian as a general expression to cover people who for whatever reason have moved, or are moving, from the country of which they are nationals to another. But 'refugees', 'displaced people' and 'asylum seekers', all of which have clear definitions, are more useful and accurate terms than a catch-all label like 'migrants', and we should use them wherever possible.\" - David Marsh, Guardian style guide editor."},{"comment_id":"1267016713333785","commenter_b":"Spanish and Latina aren't synonyms- Latina=a woman from Latin America. Spanish is from Spain. Jsyk !","commenter_a":"It's not really a stereotype when the cleaning industry is dominated by a majority of Latina woman. But I agree Latina women shouldn't be isolated to only this role, Spanish women work in a wide range of fields including healthcare, law and science. Many of these women have gone on to play great roles that where not maids. You start from the bottom.","post_message":"It's time to stop casting Latinas as hot-headed, sexy, maids."},{"comment_id":"1324289204299860","commenter_b":"LOCK HER UP!!!...LOCK HER UP!!!!...HILLARY FOR PRISON NOW!!!!...IT MUST BE PROVEN TO ALL THAT NO ONE IS ABOVE THE LAW IN OUR AMERICA!!!....HILLARY'S CORRUPTION WILL NEVER STOP TILL SHE IS BEHIND BARS!!!!!.........TRUMP IS THE PRESIDENT AMERICA DESERVES!!!....GOD BLESS OUR NEW PRESIDENT!!!!.","commenter_a":"Tried to listen to Jill's reason for the recount but she made no sense. She is the reason Hillary lost and she's nuts. Wouldn't vote for either of one, both are evil.","post_message":"Uh-Oh, Hillary! Trump Just SMASHED Down The Hammer On Crazy Vote Recount Scam! THROW THEM BOTH IN JAIL!"},{"comment_id":"10154006446451680","commenter_b":"She is a joke.","commenter_a":"Making sure this cult leader doesn't get away with anything and Elizabeth Warren is one tough woman. Good for her.","post_message":"\"The American people understand the revolving door,\" Elizabeth Warren said. \"They're really sick of it.\""},{"comment_id":"889771817799697","commenter_b":"Stupid. All this shows is the truth ... guns don't kill ... criminals kill.","commenter_a":"How many of the guns featured in the film were bought by good law abiding citizens in a legal way. Hmmmm I'm going with NONE!!!","post_message":"These people, who claim to have innocent people's best interest at heart, are sicker than the people in their disgusting film. THEY are the gun crazies."},{"comment_id":"10154133671460950","commenter_b":"There was only 1 person who refused to vote guilty all 12 have to agree, this piece of shit refused to vote guilty. There were 11 people who voted guilty","commenter_a":"Its the south and besides he had an all white jury and he shot the man in cold blood it was caught on camera and the jurors call it a mistrial","post_message":"WATCH: Judy Scott, mother of Walter Scott, reacts to a mistrial being declared in Michael Slager's trial: \"It's not over 'til God says it's over.\" @webpagelink"}]
