[{"comment_id":"10156732658910492","commenter_b":"What is it with older ladies and dislike of bike lanes? @webpagelink","commenter_a":"These ladies probably shouldn't be driving anyway","post_message":"\"New York City is not Amsterdam, it never will be Amsterdam, and that's all there is to it.\""},{"comment_id":"10152903989921336","commenter_b":"Just say your sorry, it'll be ok, long time ago let it go.","commenter_a":"The sooner the better","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."},{"comment_id":"1393941760623890","commenter_b":"Just like they blocked Obama?","commenter_a":"It's a shame that Democrat voters don't vote on issues such as jobs, the economy, and security... They vote for the candidate who has the most celebrity backing... Low info voters.","post_message":"Lady Gaga criticized Melania Trump for saying she wants to end cyber-bullying if she becomes first lady. @webpagelink"},{"comment_id":"1128341107201309","commenter_b":"Hillary is a very evil woman.She will do anything for power.","commenter_a":"I would love to see a truly in depth report regarding The Clinton Foundation. I do believe if the truth was revealed about the Clinton's and their corruption that surely more people would not vote for Hillary Clinton.","post_message":"FINALLY!!!"},{"comment_id":"10152768405859032","commenter_b":"Good!! She should appreciate the fact that she got hired & HAD a job!! What a dumb ass!!","commenter_a":"@username talk about #keepingitghetto hahaha!","post_message":"The boss didn't appreciate all those thumbs-down emojis."},{"comment_id":"1619560758331037","commenter_b":"This bitch needs to be taken down so sick of her throwing other people under the bus she's just as guilty as them. Take her out!","commenter_a":"SHE MAY RUN...BUT YOU DO NOT HAVE TO VOTE FOR HER! THE RED CARPET WAS YANKED OUT FROM UNDER HER BEFORE...IT CAN HAPPEN AGAIN! BENGHAZI MURDERESS IS NOT PRESIDENTIAL MATERIAL!! THE CLINTONS N' OBAMAS ARE FINISHED!!","post_message":"Hillary Clinton MUST be stopped!"},{"comment_id":"10153868800692377","commenter_b":"Hillary is a very nasty woman!!!","commenter_a":"He can call her what she is. A nasty woman. And it's just horrible......But she can call all of us deplorables and its ok. Don't be offended.","post_message":"Donald Trump stirred social media ire on Wednesday after he said, \"We have some bad hombres here\" and referred to Hillary Clinton as \"such a nasty woman.\""}]
