[{"comment_id":"1030546040397732","commenter_b":"Lock her up","commenter_a":"Can't do it fast enough! Lock her up!!!","post_message":""},{"comment_id":"10154753068623812","commenter_b":"Send them all back and send Mexico into a Panic Mode. The Wall will be up in no time.","commenter_a":"Maybe he can bring back the auto manufacturing jobs from Mexico, and hire legal citizens, and then the illegals will stop coming. Oh wait. They come here because there are those willing to pay pitiful salaries and no benefits to make a buck.","post_message":"Donald J. Trump has made his promise that Mexico would pay to build a wall along the U.S. border a centerpiece of his proposed immigration policy. But only 13% of voters believe he could deliver on that promise if elected."},{"comment_id":"10153416798099060","commenter_b":"I think they should be sent back to Africa. If they are fleeing Africa for political reasons, or because they fear for their lives, then and only then might they have a valid claim to stay in Europe. But if they're just fleeing because they're poor, they should move to Europe legally, or simply make the best of what they've got in Africa. Tough titties. That's just how the world works.","commenter_a":"never mind the consequences huh i bet those negotiating got paid well with plenty of overtime","post_message":"153,000 migrants have crossed into Europe this year alone, an increase of 149% on 2014. Yesterday, after seven expletive-laden hours of debate, European leaders forged a disappointingly modest resettlement agreement. @webpagelink"},{"comment_id":"10153137583782293","commenter_b":"What's this?! Women get butthurt on the Internet? Get out...","commenter_a":"Wait, what? Women actually care to attract men? I thought they'd much rather prefer to smugly ignore the existence of all men in public settings so as to artificially build their own self-esteem. Your mileage may vary, I suppose.","post_message":"\"Fear not. Since Eve, woman has been responsible for the fall of man, and again, we shall prevail.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"907989709297282","commenter_b":"This story will be huge until the next huge story comes along.","commenter_a":"Don't care .","post_message":"Could Bruce Jenner's announcement be a turning point for the transgender community?"},{"comment_id":"10153217086893984","commenter_b":"Get them outta there ,","commenter_a":"IDIOT.","post_message":"Unreal. Does she realize what she's doing? Is Michelle Obama bad for America?"},{"comment_id":"382957778552770","commenter_b":"Better her than some right wing nut!","commenter_a":"Hoping for someone else - Hillary is too close to big bankers. :(","post_message":"You won't believe how large her lead is now!"}]
