[{"comment_id":"10153852965454705","commenter_b":"She's a liability. Period. I wouldn't let someone like that work for me.","commenter_a":"She worked too hard to become a doctor to get fired, she should do community service and pay a fine and formally apologize to the Uber driver. We've all done/said stupid things while drunk.","post_message":"An internal investigation will determine any disciplinary action, including possible termination."},{"comment_id":"10154278742015329","commenter_b":"Thats that lingo dang old times lol","commenter_a":"Diego X Flores Pringle","post_message":"Single and ready for a PRINGLE."},{"comment_id":"952012654839207","commenter_b":"Pair of fucking idiots. Shouldn't be allowed to breed...","commenter_a":"Every once in a while I read something that haunts me for years","post_message":"The baby was strapped into a child-seat and left on the floor."},{"comment_id":"10154298201954087","commenter_b":"STFU","commenter_a":"He's such a comedian.","post_message":"Lindsey Graham insisted Trump's administration look into the Clinton Foundation with an \"independent view, not a political agenda.\""},{"comment_id":"420582524733009","commenter_b":"No lying Bitch will run this Country!! You will be heavy investigated about all this money you have.","commenter_a":"No they never do on the left !!","post_message":"Is the press giving this enough attention?"},{"comment_id":"1015160651860508","commenter_b":"@username go be stupid with your blond friends elsewhere","commenter_a":"If the little brat would have respected the teachers authority in the first place the cop wouldn't have even needed to be there.","post_message":"No matter how smarmy some snot-nosed teenager might be, even if she’s burning off the teacher’s time, the class time and her own time, there’s never a moment in which it’s appropriate for a law enforcement officer to try out his best WWE moves in order to bring her to heel — even if she takes a swing at him. @webpagelink"},{"comment_id":"1060970767293401","commenter_b":"Diana Serrano those hard headed girls just don't listen!!!","commenter_a":"Hahaha.... Acha hai acha hai","post_message":""}]
