[{"comment_id":"10154356809342654","commenter_b":"DEPORTATE ALL IMMIGRANTS ILLEGAL! God Bless US .","commenter_a":"All the people walking there equals one mexican party or quince lmfao","post_message":"Immigrants who work at dozens of restaurants around Washington, D.C. are participating in the Without Immigrants protest. We're live at Pizzeria Paradiso (Dupont Circle) where managers are trying to get by without their employees AND we're live at the site where protesters are organizing."},{"comment_id":"523357894521457","commenter_b":"She would be the worst ever.","commenter_a":"The people that will vote for Hillary, see nothing wrong with all his sex scandles.......... it dosen't faze them !","post_message":"Bill Clinton's promiscuous behavior could ruin Hillary's chances. Excellent. Help us spread this and make sure she never get's into office. Do you agree that Hillary would be a terrible president?"},{"comment_id":"1060173974080560","commenter_b":"You always do a fantastic job so thank you!","commenter_a":"Thank you for covering","post_message":"Christopher Heath WFTV has a look at the crowds waiting in Orlando for the Donald Trump rally, which is set to start at 4pm. More details here: @webpagelink"},{"comment_id":"10154451446444614","commenter_b":"Good that is what she gets. She is a cruel person","commenter_a":"She needs to be criminally charged and have to register as a sex offender.","post_message":"Dani Mathers has been banned from all LA Fitness gyms after she took a photo of a woman inside a locker room and posted it on social media with disparaging comments about her body."},{"comment_id":"1771313199818566","commenter_b":"Women just need excuses to be shirtless in public","commenter_a":"No.. He's not the ex-Stanford swimmer. He's a convicted rapist! Stop pampering the white boy FFS!!!","post_message":"We’re outside the Santa Clara County Jail where people are protesting the release of Brock Turner. He's the ex-Stanford swimmer who served three months after being convicted of sexually assaulting an unconscious woman."},{"comment_id":"10153463322016051","commenter_b":"Too sick! This woman might wear Christian symbols at Christmastime !","commenter_a":"There is no meshing between our God and theirs-the Holy Bible is our guide and law-we are inclusive but stand on firm ground!","post_message":"This evangelical Christian school just suspended a tenured professor for expressing solidarity with Muslims. And they didn't stop there. Decide for yourselves if the school behaved correctly. (Via VICE News)"},{"comment_id":"10154565207543812","commenter_b":"A gun can not cause violence. It's harmless. I have several. They have never shot anyone. They have never caused violence against me or anyone. Get it??","commenter_a":"He lost his brother, son and partner to VIOLENCE by someone using a gun. Could have been a knife, a baseball bat or even a suicide vest. Lay any of these items on a table and they do nothing. Let me know what I'm missing here","post_message":"#Dallas Police Chief David Brown Sr., a 30-year veteran and Dallas native, lost his former police partner, his younger brother and his own son to gun violence."}]
