[{"comment_id":"1020710211322060","commenter_b":"Alexcea Erini Apostolakis bod","commenter_a":"I think the poor girl should be left alone","post_message":"The birthday festivities never end for Kylie Jenner (via Daily Mail Celebrity)"},{"comment_id":"850412481815995","commenter_b":"Ungrateful bitch deserve to be slaped","commenter_a":"Y can't fix stupid","post_message":"If you disrespect our troops, you don't deserve to live in this country. They are the reason you have freedom. They keep us safe. What do you think her punishment should be?"},{"comment_id":"10154594345964749","commenter_b":"@username leave arab countries ask you governments to stop killing people there . and the immigrants will go back","commenter_a":"I think the comment has to be taken into context... Looking at Hungary's demographics, Muslims don't even account for 0.1% of the population. The politician is probably representative of the general public mood there. Although in a more colourful tone!","post_message":"The Hungarian politician was described as “a sad old man full of hate” and his comment was branded as “disgusting”."},{"comment_id":"10152780926180779","commenter_b":"Dude I get it let it go","commenter_a":"Yet how many innocent black men have been killed for no reason other than for being black?","post_message":"Over 15 police officers were injured – six seriously – and over 200 people were arrested as riots broke out in West Baltimore yesterday following the funeral of Freddie Gray. Maryland Governor Larry Hogan declared a state of emergency in the city and requested that Maryland activate its National Guard."},{"comment_id":"10153850039752452","commenter_b":"Samantha Keller me","commenter_a":"Esdras Diaz","post_message":"After being a dad for five months, this father decided to share a funny review on his “2016 model” baby. @webpagelink"},{"comment_id":"1229522020425442","commenter_b":"I don't know about everyone else but I still think she looks good without make up.","commenter_a":"She's so beautiful! Why would she want to cover up that face? Who would, if they actually thought about it?","post_message":"\"Just a little concealer next time.\""},{"comment_id":"10153213873086051","commenter_b":"Go to he'll bitch","commenter_a":"It's a lion it is legal to poach lions but legal for canned hunting everyone is having a cow because someone killed a famous Lion If you care so much about animals stop going to the zoo and the circus Stop buying products that test on animals donate to animal charitys Bitching on facebook solves nothing this man made a mistake leave him alone you self righteous idiots","post_message":"The hits just keep coming for Cecil The Lion's pride."}]
