[{"comment_id":"1707925176144398","commenter_b":"The shemale will sit alone","commenter_a":"He has no right to assume that the people who have died from gun violence would not have wanted to be able to carry That they might have been AGAINST gun free zones.. It's again his agenda if one of my family members had been one lost to these acts of violence I would demand that they NOT SPEAK ON THEIR BEHALF...THAT THE PRESIDENT make reference to the fact that he DOES NOT SPEAK for ALL CITIZENS","post_message":"The Obamas never miss an opportunity to shamelessly politicize an event. At the next State of the Union, Michelle Obama will be sitting next to an empty chair; and the outrageous reason why will have you shaking your head... Are you glad this will be Obama's final State of the Union?"},{"comment_id":"10153554685766880","commenter_b":"I want TRUMP to build the wall so can make it hold","commenter_a":"At one time owning slaves was constitutional","post_message":"#2. Ending birthright citizenship would be \"clearly unconstitutional.\""},{"comment_id":"10154877505644351","commenter_b":"Build it electrify it arm the wall with automatic weapons cameras night vision electrify deep into the ground to kill tunnellers pass new deportTion laws make it a felonie criminal act to border hop punishable by years in a very bad prison","commenter_a":"His whole campaign was based on building a wall!! Of course he should, we need secure borders!!","post_message":"Thoughts?"},{"comment_id":"10153101745071336","commenter_b":"kat, an arms limitation agreement isnt a treaty.","commenter_a":"Yep, once the ship starts sinking, the rats are the first to go. Good riddance!","post_message":"BREAKING NEWS: Senate Minority Leader Harry Reid announced that he will retire from the Senate at the end of his term. @webpagelink"},{"comment_id":"1192108440886151","commenter_b":"He is going to be a great president","commenter_a":"He is the uneducated and ignorants president which apparently there is a lot of!","post_message":"WATCH LIVE: President-elect Donald J. Trump makes a statement from Mar-A-Lago estate"},{"comment_id":"10155132618144885","commenter_b":"@username CA would be in a lot less debt if they kept their own revenues. CA ranks as 46/50 in dependent states in the US. They give more than they get.","commenter_a":"What are these liberal agencies and locations going to do without Federal Funding? This is a direct threat from Trump. From what I've seen from him he keeps his word. Places like Chicago are going to be in a world of hurt without federal money.","post_message":"Chicago Public Schools has instructed its principals not to let federal immigration agents inside district buildings without a criminal warrant."},{"comment_id":"10153376239848984","commenter_b":"Kill the fucking idiot","commenter_a":"He is now someone's girlfriend...","post_message":"He stabbed a police officer 14 times and what he said here was even WORSE. Do you think this criminal deserves life behind bars after this?"}]
