[{"comment_id":"1811838059034995","commenter_b":"And her answer is I don't have an answer for you. Really because you know the answer already bitch","commenter_a":"Love this guy. So to the point it's pathetic. And I can't answer anything.","post_message":"Trey Gowdy utterly DESTROYS this liberal...."},{"comment_id":"10153031435480671","commenter_b":"Soldier on ladies!","commenter_a":"Ricky Myette","post_message":"What do you think about two women graduating from the Army's elite Ranger School?"},{"comment_id":"1014005318629521","commenter_b":"Mine usually bark at noises or neighborhood dogs. However our Pit will ECHO in the house for 30 minutes when she wants to play. It only annoys us! However my neighbors digs howl for hours and have eaten my fence!","commenter_a":"Dang, what if the family isn't home?","post_message":"DOG BARKING ORDINANCE: Dallas city officials want to cut down on barking dogs. City officials have created an animal ordinance that says it is an offense if a person lets their dog bark for longer than 15 minutes. Would you agree with a similar ordinance in the Houston area? MORE ---> @webpagelink"},{"comment_id":"10154144112782699","commenter_b":"too bad this policemans life has been changed because of some mouthy teenagers","commenter_a":"With the chief of police not supporting him...most definitely. He can't go it alone.","post_message":"\"Eric Casebolt of the McKinney, Texas Police Department has quit his job, after a video of him pulling his firearm on rowdy teens went viral.\" @webpagelink Do you think the officer should have resigned?"},{"comment_id":"742531822604062","commenter_b":"PLEASE PUT HIS ASS IN IT","commenter_a":"All this shit is posted and nothing is ever going to happen to this goat fucker or his bestie Hillary Clinton","post_message":"Obama Caught In Major Lie - This Could Be The Nail In The Coffin [VIDEO] He cannot be trusted. End his term early. Do you want a president who will tell the truth?"},{"comment_id":"10150977696104999","commenter_b":"No, the representation in the Senate is not of the people, but of the states. Each state has two Senators. That's equal representation. If you want representation of the people, you're looking in the wrong chamber.","commenter_a":"It is a very good thing that urban power centres cannot set the taxes of their rural neighbours. If they could the rural producers would become slaves and would have no quality of life in the pursuit of urban consumers actively destroying rural methods of negotiation. This is NOT a failing of the system, it is exactly why the system is in place. It is a good thing that farmers are not economic slaves of nearby cities.","post_message":"In the U.S. Senate, the least populous states are now more overrepresented than ever before."},{"comment_id":"1011883318957553","commenter_b":"Justice should have been being served all along! Hillary should already be in Prison!","commenter_a":"I release the anointing here","post_message":"We've come too far to turn back now. Make sure you're registered to vote: IWillVote.com"}]
