[{"comment_id":"10153081516228822","commenter_b":"Eliza sounds like she's the one going to hell.","commenter_a":"Why is this topic constantly being forced down our throats","post_message":"It was a historic day for marriage equality in the US -- and Pittsburghers had a lot to say."},{"comment_id":"10152744532057426","commenter_b":"This is what I call a real woman","commenter_a":"Congrats to her! Yay!","post_message":"She said she would spend her new millions on her church and her children -- one of whom has cerebral palsy."},{"comment_id":"10154211754086509","commenter_b":"Immigration, no; Illegal invasion, yes!!!","commenter_a":"I get that people are against immigration. But some of these comments go to show how Inhumane people are. Sickening. (Since people don't know how to read and have messaged me ugly things saying how I should take them in...I'm going to state that I agree with immigration restrictions but I do not agree with having them DROWNED or KILLED.) Jeez.","post_message":"A Polish teacher asked students to calculate how many Syrian refugees had to be thrown overboard for a boat to stay afloat and reach Greece."},{"comment_id":"10153440735091130","commenter_b":"We don't want to hear any more about this ugly, perverted, faggot drag queen.","commenter_a":"Done w Huff Post","post_message":"Stunning!"},{"comment_id":"10153156840858690","commenter_b":"F**k off, blue haired Zionist murderer!","commenter_a":"just a game, fake for 3 reasons: 1. To lower the rising American hate that's growing in the world 2. For Isreal to keep using the US as a negotiator (like calling your big brother to be a \"indendent \" deal maker\") 3. Confuse people, now we are talking about this while the settlements are being built and time goes on","post_message":"Increasingly isolated, Israeli Prime Minister Benjamin Netanyahu turns to US Senator Chuck Schumer, Israel's leading friend, to enlist his support against President Barack Obama. It's likely their conversation went like this, says Marwan Bishara. @webpagelink"},{"comment_id":"10155012522801944","commenter_b":"It's now about money Obama laid out a lot of this deportation and Trump has to bite the bullet. Now back to money. Only ones going to make money on the deportation of illegals are LAWYERS. Lose. Lose situation for the illegals. Serves them right? Our forefathers and mothers came in legally Any questions ?","commenter_a":"Id like to see 365 days without illegal immigrants. enforce the law deport illegals.","post_message":"Serves 'em right."},{"comment_id":"752230248210825","commenter_b":"@username you live in the Philippines, don't worry about our country, stay in your shithole","commenter_a":"***Trump Platform*** 1.) Donald Trump believes that America should not intervene militarily in other country problems without being compensated for doing so. If America is going to risk the lives of our soldiers and incur the expense of going to war, then the nations we help must be willing to pay for our help. Using the Iraq War as an example, he cites the huge monetary expense to American taxpayers (over $1.5 trillion, and possibly much more depending on what sources are used to determine the cost) in addition to the cost in human life. He suggests that Iraq should have been required to give us enough of their oil to pay for the expenses we incurred. He includes in those expenses the medical costs for our military and $5 million for each family that lost a loved one in the war and $2 million for each family of soldiers ...","post_message":"\"What she did is a criminal act ... if she's allowed to run, honestly, it will be a sad day for this country, because what she did was wrong.\" Donald J. Trump slammed Hillary Clinton during his #SuperTuesday speech in Palm Beach, Florida tonight."}]
