[{"comment_id":"10153067387865329","commenter_b":"Stupid bitch","commenter_a":"Anytime a guy says \"my dick is too big for a condom\" just tell them \"well, my uterus is too small for a baby.\"","post_message":"\"To all the guys saying \"my d*** is too big for condoms,\" TAKE A SEAT.\" // BuzzFeed News"},{"comment_id":"10153692085070950","commenter_b":"There was a story not long ago of the White House sending out a million Green Cards to illegals. About a year ago there was a story on Obama sending out a million US citizen applications to green card holders.","commenter_a":"The story CBS did on Brexit tonight was horribly biased. The reporter all but predicted the end of the world (Communism). How better to get America to join the EU, than to bring us to our knees with Obama flooding the homeland with Mexican and south American (illegal alien) nationals? Low skilled labor and low information voters go together like Obama and Muslims. A match made in economic and cultural Hell.","post_message":"U.K.'s withdrawal from the European Union is already causing economic and political upheaval -- so what happens next?"},{"comment_id":"10154724312199486","commenter_b":"Yes come here and get shot!!! That will have them flooring in!","commenter_a":"Chicago will soon see that President is higher than Mayor...Fucktards!","post_message":"NAILED IT."},{"comment_id":"10153393698278606","commenter_b":"The statement would they would have been fired if it was a white man is stupid,they should have been either way and the point is it wasn't, if this is the kind of judgement they you I wouldn't trust them to protect and serve","commenter_a":"It looks like two hunters with a deer...what's racist about it?","post_message":"One of the two police officers who was fired after posting this photo wants his job back: @webpagelink"},{"comment_id":"1346208208805563","commenter_b":"@username If you can even get in to see the surgeon!","commenter_a":"Its funny cause in Mexico, the full of thugs and criminals and rapists Mexico you can get major surgeries for free. Yes you need to wait a few weeks but you do get it free if you pay your fee (about 8% of your salary goes for health, another 8% for retirement and house)","post_message":""},{"comment_id":"1211339922259660","commenter_b":"Love it!!","commenter_a":"Next Congress will be investigating the rape charges against Trump..............right? No? How about the fact that he doesn't pay income taxes.......? How about his dealings with China? No! Wait a minute, this sounds like another witch hunt, fact finding repeat of all the other investigations that Congressional Republicans have tried to have brought against Clinton. I've never seen anything like it.","post_message":"\"You are hereby served.\" Rep. Jason Chaffetz served a subpoena demanding the FBI’s full investigative file on the Hillary Clinton email probe. @webpagelink"},{"comment_id":"1113246462026036","commenter_b":"I love being a princess. As you can see from time line Imma pussy","commenter_a":"She uses the same playbook as the very people she supposedly hates. Yet the morons line up behind her, rank and file. 'Murica.","post_message":""}]
