[{"comment_id":"10150600601724999","commenter_b":"A woman is whatever she wants to be. That's kinda the point of feminism.","commenter_a":"For a group - women - who have been arguing for decades that they shouldn't be reduced to their reproductive organs so they can have more opportunities in life that have NOTHING to do reproduction, it's pretty ironic when those same people say someone can't be a woman because she doesn't have the proper bits or experiences with those bits.","post_message":"People who haven’t lived their whole lives as women shouldn’t get to define us. Read on in The New York Times Opinion."},{"comment_id":"909858709204705","commenter_b":"Absolutely ! It's not a color issue , they were intruders !","commenter_a":"What a brave wonderful woman. So sorry to hear of her loss!","post_message":"Dorothy Hendrix unloaded on thugs who broke into her house... but look what happened next. She has every right to blow those intruders away. Do you stand behind her constitutional right to defend herself?"},{"comment_id":"828004503968344","commenter_b":"The world is better off for her decision. Her kids wouldnt only be stupid...they'd be ugly as hell too!","commenter_a":"Damn good thing she doesn't want children. We don't need more idiots like her. Just imagine how brain dead her offspring would be.","post_message":"Liberals are repulsive Dc Gazette (y)"},{"comment_id":"677448822404448","commenter_b":"These women are idiots!!!!!!!!!!","commenter_a":"OMG!!!","post_message":"\"We finally have this god that's going to come down and help us all.\" Here's what two \"Trumpettes\" think about Donald J. Trump's Twitter rant against former Miss Universe Alicia Machado. Watch more: @webpagelink"},{"comment_id":"10153382769757411","commenter_b":"I don't know who you've been talking to but it seems to me that America has been supporting the illegal Mexicans for quite a while and we have been paying for it with our tax dollars! So now people are angry because there is no money in our checking accounts because the government is taking it to pay for all the refugees and the illegals that is using our system! We have no country without a border, we have no country if everybody comes in that wants to! without doing it properly! Now is the time to take our country back and get it out of the true terrorist hands, that is in our government and has been for past several years, using the people to their advantage!","commenter_a":"People should protest all of Donald Trump's rallies and stop this man before he gets out of control. America does not need to return to the days of racism and prejudice to be \"great again\". I can't imagine Donald Trump as President of the United States. Everything will be one big reality show for him and he will be the host who gets to fire whoever gets in his way. His supporters are exhibiting the same attitude and acting like they are judge and jury treating protesters as if they should be deemed as Enemy Combatants who do not have rights. Donald Trump has stated that if he becomes President of the United States that he would wage war against Mexico in order to recuperate the cost to build his wall. Racism is his underlying motive. Just like when Hitler waged war against the Jews. His sole ambition to gain ...","post_message":"\"Donald Trump has created a toxic environment. And the toxic environment has allowed his supporters and those who sometimes seek confrontation to come together in violence.\" John Kasich today blasted Donald J. Trump for \"preying on the fears\" of Americans. Both Kasich and Marco Rubio suggested they may not support Trump should he become the GOP nominee. Story: @webpagelink"},{"comment_id":"10156300548230389","commenter_b":"Gilbert, go back to the ignorant liberal hole you slithered out of. You spineless snake.","commenter_a":"Who in the Hell is Race baiting? It is Fox Propaganda Channel and @username. Who in the Hell supported the Racist Tea Party? Fox Propaganda channel. I see by the comments that you are the problem, not Obama. Your commenters would rather cut off their heads to spite their faces. That is why they listen to you, for the same reason the German people listened to Hitler.","post_message":"Question of the Day: Do you think President Obama has made race relations better or worse in this country?"},{"comment_id":"970339789709457","commenter_b":"The media doesn't give Dr Carson a fair chance, disgusting and sad!","commenter_a":"All Trump supporters, pls get out and vote! This is a very critical time in America, we need to get back our White House, otherwise we gonna reach the point of no return!","post_message":"GOOD MORNING, America! Thank you for all of your support- in last nights #GOPDebate. If everyone gets out to vote in 2016-- there is no question that we will ALL be MAKING AMERICA GREAT AGAIN- soon enough!"}]
