[{"comment_id":"10154959437824369","commenter_b":"If I was impregnated by my rapist, I can assure you that I would not be having that child!","commenter_a":"Again, this does not make exceptions for rape. Also, the only people getting abortions at that stage are women whose lives are in danger or something is terrible wrong with the fetus. This is more unnecessary legislation.","post_message":"Abortions would be banned after 20 weeks under a bill Republican lawmakers hoped to pass Wednesday"},{"comment_id":"10150889986764999","commenter_b":"I don't. Our economy benefits tremendously from the labor, the buying power, and the taxes paid by undocumented labor. I for one don't want to have to pay $5 for an apple. We don't need no stinking wall. What a colossal waste of time and money.","commenter_a":"Who here does not want secure borders and our immigration laws enforced and why?","post_message":"The photo-op allowed Donald J. Trump to please his nativist base and humiliate Mexico at the same time, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"473460069511240","commenter_b":"Tell the goat F to get out of our country","commenter_a":"Kudos to you Clint Eastwood ... !!!","post_message":"Muslims want Clint Eastwood's head, but he's not backing down. This is outrageous, let's show him we have his back. Can we get 10,000 'LIKES' for Clint Eastwood?"},{"comment_id":"1218654931501590","commenter_b":"Amen!","commenter_a":"It might have something to do with the fact that they make veteran Officers from other agencies retake the academy if they try to switch to their Department.","post_message":"10News' Phil Buck digging deeper to find out how Hillsborough County Sheriff's Office is still working to keep you safe in spite of deputy shortage @webpagelink"},{"comment_id":"10153992942406316","commenter_b":"what is the life span of a fruit fly??","commenter_a":"Wayna Biggs","post_message":"Truvia sweetener a powerful pesticide, kills fruit flies in less than a week..."},{"comment_id":"10153043534789614","commenter_b":"Girl do your thang....U have a beautiful heart and it shows. WOOp","commenter_a":"You know wat, the only reason those guys said those thing is cause the DICKS are to small to please a big beautiful woman. If u agree give me a HELL YEAHHHH!!!!","post_message":"When Kristen Layne decided to sell her junior prom dress on Facebook, she had no idea that some people would respond by criticizing her weight and looks. \"These two men were just saying some very hateful things, just telling me I was fat and that I wasn't beautiful,\" she said. It wasn't long, however, before a number of commenters rallied to the Tennessee teenager's defense. One person posted: \"It's obvious this woman is beautiful, inside and out.\" Another wrote that the dress \"looks absolutely stunning.\" Layne had originally tried selling the gown for $350, but supporters have now raised more than $2,700 to help her buy a new dress for her senior prom. Read KTLA's story here: @webpagelink"},{"comment_id":"10155027451044411","commenter_b":"Boooo :) make them strong :) We kick your ass in Afghanistan... @username should respect other cultures and their traditions.. These Indian Muslims doing this due to their believes.. This is racism what is @username doing..","commenter_a":"What about you Russian whores bathing their babies in Ice cold water... shit heads @webpagelink","post_message":""}]
