[{"comment_id":"10153614155549117","commenter_b":"@username you seem perfectly willing to dismiss the notion that the unborn have rights. I have no idea when to legally call a fetus a human. If a pregnant woman is beaten and loses her child is it simple battery. I don't know. When I was young I learned hunting and gun safety and rule one, you don't shoot at noise, a rustle in the bushes. Why not? Because there is a chance it may be a person. A real libertarian solution would be upon finding out she is pregnant she must claim she doesn't want to take care of a child and surrender right to it. If someone else is willing to take that child and be legally responsible for it then it gets rights and she needs to take personal responsibility (libertarian) and not be aggressive towards the fetus and turn it over on delivery.","commenter_a":"The best thing libertarians could do is reexamine their approach to abortion as their current stand favors personal privacy over personal responsibility and non aggression. Another possibility is to slightly widen the area we need to defend, to treaties,in order to be safe at home. Remember, economic liberty is the most important issue.","post_message":"John McAfee: \"The truth is this year at least there's maybe a 0.005 percent chance that any candidate on this [L.P.] stage wins the election. If we don't, if we get 20 percent, I promise you, if we don't do something to win in a real sense, this world is going to collapse.\""},{"comment_id":"10153272244859071","commenter_b":"Women RUN the World.... All Hail the Queen....","commenter_a":"Ana Clara Mello","post_message":"Kurdish fighters have said ISIS is \"afraid of girls.\""},{"comment_id":"10154058052466336","commenter_b":"the muzroach must not remain on the face of the earth no more","commenter_a":"He probably wouldn't have been caught coming across Obama's border.","post_message":"Police say they seized four air rifles, eight scopes and 200,000 .22-caliber bullets."},{"comment_id":"927473010672643","commenter_b":"@username this has made my day!! When are you and Rene coming to visit I miss you guys!!!!","commenter_a":"Eyes bigger than stomach? 😜","post_message":"That's the most metal thing I ever heard. \\\\m/"},{"comment_id":"10155855233440354","commenter_b":"Go away you airhead bitch","commenter_a":"To late dumb ass! No explication for intentionally exposing people to your obvious low grade DNA, should be a criminal offence!","post_message":"Even the liberal media is questioning this apology.... Check out the video...."},{"comment_id":"10154024812315470","commenter_b":"Lol, whatever you have to tell yourself... moron.","commenter_a":"Seeing how anti-science Bernie is and how his followers uncritically swallow his anti-science stand I wouldn't be shocked by the numbers that try this.","post_message":"BE ON THE LOOKOUT! A picture going around on social media looks like an ad supporting Bernie Sanders, offering instructions on how to make so-called Bernie Sanders glow sticks. The recipe is actually for a deadly chlorine bomb."},{"comment_id":"10154000125138132","commenter_b":"That woman is a nut!!!","commenter_a":"Hope he doesn't take them on a nice \"trip\" to Monaco like Kelly Rutherford's ex did.","post_message":"Gavin Rossdale has a special Christmas trip planned for his kids!"}]
