[{"comment_id":"10153538416518445","commenter_b":"Fuck the police,bitches...always smoking,","commenter_a":"wtf","post_message":"Always A Good Reminder: Police in Legal States Are Using Social Media to Bust People for Marijuana."},{"comment_id":"10153344961531336","commenter_b":"With the negros and the muslims,America is done.","commenter_a":"Someone \"finally\" says that they noticed the male charging up to the officer put his hand behind his back! Was that officer supposed to \"WAIT\" & see if the guy had a gun ??Plus,we DON'T know what he said to the officer! Don't be idiots & think the officer shouldn't be ready to protect himself just because \"THEY WERE TEEN AGERS\"!!!! AND IT ALL GOES BACK TO...\"LISTEN & DO WHAT THE OFFICERS SAY\" INSTEAD OF THINKING YOU'RE \"ABOVE THE LAW\".......","post_message":"JUST IN: Cpl. Eric Casebolt has resigned from the McKinney Police Department after almost 10 years on the force. His resignation was confirmed by his attorney, Jane Bishkin of Dallas."},{"comment_id":"864879717035938","commenter_b":"Voter fraud will get her elected anyway","commenter_a":"I would like to ask, How many Hilrack supporters have been in the military or had someone they love in the military and how many believe in God. The drive behind the Hilrack campaign is to REMOVE GOD from this country and then she will remove the military. READ \"The battling boys of Bengazhi\" Thats their agenda!!! The aid she gave to them will be repeated with any and all protecters of America. Why do you think all the Clinton money is in Canada???","post_message":"She's done. Please help us spread this. America needs to see it. Do you think Hillary is not fit to be president?"},{"comment_id":"10154874885608796","commenter_b":"Drain the swamp!","commenter_a":"Yates used no integrity because she took an oath of office to obey the law. Same as Lynch did. Both should have been fired no just one of them.","post_message":"Former Attorney General Loretta Lynch praised now-fired acting Attorney General Sally Yates for her “unshakable integrity” in refusing to defend President Donald Trump’s executive order putting a pause on travel from terror-ridden countries."},{"comment_id":"10153116557673812","commenter_b":"The problem here is that if there wasn't such a demand for these young females by perverts this wouldn't exist. You are sick to lust a 14 yr old as a grown man.","commenter_a":"My heart goes out to this mother!","post_message":"WATCH: A mother in a desperate search for her missing 15-year-old daughter is overwhelmed with emotion when journalist Nicholas Kristof searches for and quickly finds her being advertised explicitly online – A Path Appears: Tonight on Nightline / Monday on PBS -- MORE: @webpagelink"},{"comment_id":"10153190678386116","commenter_b":"this is why we dont let kids vote","commenter_a":"Little misdirected President can't do anything until the GOP congress recognizes there is a problem......","post_message":"Wow."},{"comment_id":"10152857545591051","commenter_b":"They all need to be sent over with Isis! If you don't like this country, get the hell out!!!!!","commenter_a":"Agree with @username.","post_message":"More than 1,200 people, including a lot of prominent professors, just signed a letter to ban the American flag. Here are all their names and the schools they’re from."}]
