[{"comment_id":"1794738107245611","commenter_b":"Mexico has no standing in America. The reason Mexico is upset is because the majority of Mexico!s economy depends on money sent from Illegals in America and illegal drug traffic. The rich in Mexico will lose their illegal source of income and Mexican economy may crash.","commenter_a":"Screw you.","post_message":"Yea, good luck with number 11..."},{"comment_id":"1051319018240177","commenter_b":"Let's build a wall!","commenter_a":"No way? Only illegal Mexicans are drug dealers and criminals. . Right?","post_message":"DRUG RING UNCOVERED: Six students at UC Santa Cruz have been arrested on Friday for allegedly running a drug ring that uncovered over $100,000 worth of MDMA, police said. READ MORE: @webpagelink"},{"comment_id":"10152983014636051","commenter_b":"Yes, she should have been suspended. The foul language is not acceptable to use in school or anywhere else.","commenter_a":"i see nothing wrong she answered them in her opinion and where are the profanities? teacher is wrong and so is the school","post_message":"School officials took one look at this 14-year-old girl's answers on her sex-ed quiz and immediately suspended her."},{"comment_id":"10154327927746336","commenter_b":"Only thing that needs a brain is u Hernandez as u can't even spell my name which is right infront of u.. Thank God Trump is getting rid of all u illegals.","commenter_a":"Please refer to him as President Trump.. Thank u.","post_message":"This morning, Donald J. Trump tweeted out a message for Memorial Day."},{"comment_id":"1098675453532382","commenter_b":"I don't need to see his return. But I do need to see killarys medical records. She's a wack a doo","commenter_a":"Go Trump 2016","post_message":"WATCH LIVE: Donald J. Trump addresses police shootings, claims America needs a 'national anti-crime agenda.'"},{"comment_id":"10158044327420354","commenter_b":"Yes then a finger dipped in purple dye.....lol","commenter_a":"Funny how these so-called \"errors and glitches\" always favor the democrats. Personally, I used a paper ballot.","post_message":"***BREAKING***"},{"comment_id":"1666670816943719","commenter_b":"Let's help protect the interns at the White House! Keep the Clinton's out!","commenter_a":"I can NO LONGER DRINK TRUMP'S POISON. Stupid me. Anyway, Donald, you are SATAN.","post_message":"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!"}]
