[{"comment_id":"747501402054427","commenter_b":"Wouldn't happen to my children. My kids are five,three and one. They know better than to go into a wild animal pens. Plus me and my wife keep our eyes on them all the time. Hands are held too at all times. No excuses for that gorilla to be killed. The parents were neglectful and should be charged with neglect and child endangerment. That gorilla didn't ask to be in the pen. Then to be killed for being a gorilla. I'm not saying leave the kid to die either. Sad situation that should of never happened.","commenter_a":"For all of those slamming the zoo for killing the gorilla, what if it was your kid who fell in? Would you want the zoo to let your kid die because the gorilla was endangered? We all need to think and put ourselves in others shoes before we start spouting off on things.","post_message":"Jack Hanna says he agrees with the decision that the Cincinnati Zoo made in killing the gorilla that was dragging a toddler who fell into its enclosure. Learn more: @webpagelink"},{"comment_id":"1733461333592333","commenter_b":"Build that wall! ! !","commenter_a":"Deport them all","post_message":"Democrats gave undocumented immigrants and their concerns a featured role on the first day of the Democratic National Convention, drawing sharp contrasts with Donald J. Trump and his hardline proposals on immigration."},{"comment_id":"422474541282890","commenter_b":"Bring it on motherfucka","commenter_a":"1490882780941608ing Joseph Cortes @username Matt Flambard Leigh Cramphorn","post_message":"Xbox One vs. Sony PlayStation 4 gaming is finally becoming a reality."},{"comment_id":"1275439085806772","commenter_b":"Hopefully they'll rule it what it is, UNCONSTITUTIONAL and they can send all of the ILLEGALS back to where they came from. I don't know what it is about Liberals not understanding the concept of the word ILLEGAL! Maybe some of these Bleeding Heart Liberals that want these ILLEGALS here so badly will open up their checkbooks and homes to feed house and clothe these illegals. Oh wait, that's just wishful thinking...Liberals can't do anything without other peoples money.","commenter_a":"Sick of his abuse of the executive order. Be gone loser !!","post_message":""},{"comment_id":"10155246322201509","commenter_b":"Hillary will only do what pads her pockets and feathers her own nest...","commenter_a":"Trump Newest Hat Says \"The Low Educated Loves Me\" #TrumpIsAnIdiot!","post_message":"Nope, the newest Donald J. Trump hat isn't a parody."},{"comment_id":"10153460908891680","commenter_b":"Len Williams Carver Hillary is a SHILL for Wall Street and the Big banks. Do you need a road map to follow the money?? 3 speeches for $675,000 from Goldman Sachs and you don;t find that troubling??? She said she would release those transcripts then reneged on her promise. So she LIED again! A Clinton trait! #BernieSanders","commenter_a":"Apparently to her a democrat is someone who switches their mind on same sex marriage, fracking, corporate executives, and Middle Eastern Wars all over the course of 10 years #Bernie2016","post_message":"LISTEN: New Off Message with Glenn Thrush - Hillary Clinton sits down with Glenn Thrush following a campaign event in Syracuse, New York. The former secretary of state compares Donald Trump to foreign demagogues and says she's not even sure her primary opponent is a Democrat. SUBSCRIBE: @webpagelink"},{"comment_id":"10153196622799753","commenter_b":"FUCK U CUNT.......","commenter_a":"She committed suicide now let it go.","post_message":"Do you think Sandra Bland was murdered?"}]
