[{"comment_id":"10153515397661509","commenter_b":"Race and gender identity are two totally different issues lol","commenter_a":"That's disrespectful. If it had been a white person doing a racist joke. There would be no question if he crossed the line.","post_message":"Do you think Jamie Foxx crossed the line? Many viewers of the iHeartRadio Music Awards weren't too happy about his Bruce Jenner joke: @webpagelink"},{"comment_id":"695871927257910","commenter_b":"Josiah Meek","commenter_a":"Laurie Fink","post_message":"DESK GOALS. @webpagelink"},{"comment_id":"1553570801369710","commenter_b":"The head of black panthers got robbed at gun point called police. They got his stuff back and arrested the criminal. Ben and jerry time to get your heads out of your ass. I won't buy any thing from you hope all true Americans stop buying your products let the boycott begin hope you lose millions in sales","commenter_a":"All lives matter.","post_message":"Why? Just...why"},{"comment_id":"525718480886525","commenter_b":"Go home angelia you're drunk","commenter_a":"Yesterday 100 innocent dead in Lebanon Attack, 500 innocent dead in Palestine, 200 Dead In Yemen, last year 400,000 dead in Syria, 5 years ago 1.5 million dead in iraq, Yet No one Says Word , The world Stands silent. And In Paris Attack Today 150 Dead And World Goes Crazy . Obama's statement after attacks in Paris: \"This is an attack not just on Paris...this is an attack on all of humanity\" Mr . Obama Wake up Humanity Has Been Getting Attacked and it dead long time ago. R.I.P To All those innocents Who Died In Paris Attack Today, and R.I.P To All Those innocent lives Who were never Mentioned In The Attacks , and Still Being Killed and not Being Mentioned .","post_message":"Our worst fears have been confirmed. #ParisAttacks The Free Thought Project.com (y)"},{"comment_id":"10155391516626729","commenter_b":"make the bitch donate it to charities or homeless people","commenter_a":"Green Party = Communist, it is all about the money","post_message":"Probably the objective all along."},{"comment_id":"10153296497591519","commenter_b":"@username No, I kiss your mother with that mouth.","commenter_a":"Racist Republican Religious Lying Christian Coward Party.","post_message":"\"Religions are not all the same, with some being more peaceful than others...\""},{"comment_id":"543443959158926","commenter_b":"Time to skewer the witch!!","commenter_a":"Hell Ya !","post_message":"'Hillary Is In for the Ride of Her Life' When She Takes On Trump. Governor Mike Huckabee"}]
