[{"comment_id":"1417299944952004","commenter_b":"They are illegal immigrants. Reagan granted amnesty in the 80's and it was to be a one time thing for those already here. Settled once and for all. But they keep coming. And this problem is not just from Hispanics although they make up the majority of inflow. If they couldn't come legally then they shouldn't be here. People have been coming legally for 100 years (like my father and his parents). No excuses. They are breaking the law and need to be deported.","commenter_a":"All he has is big ego","post_message":"Dude! Really??!"},{"comment_id":"10153639993996135","commenter_b":"She is a criminal....wake up!","commenter_a":"Her speech was excellent! Very well spoken and original.","post_message":"What did you think of the First Lady's speech?"},{"comment_id":"10153546186781162","commenter_b":"The disturbing replies to this is that people actually think just because she is a woman, she can hit whoever she wants and continue to escalate a fight. Doesn't matter who or what she is. You don't hit people period. Had she not come back in, hit him and continued this, there would have never been a problem.","commenter_a":"I'm all for not putting hands on a woman. But where's this equal opportunity draw the line at? She smacked the taste out dudes mouth. Don't start what you can't finish","post_message":"PANERA ATTACK: A Panera bread manager is fired after he was filmed punching a female employee in the head and knocking her to the ground. WATCH: @webpagelink (Warning: Graphic video)"},{"comment_id":"1023637380990606","commenter_b":"Bubble gum? Lol are you 12?","commenter_a":"I came to piss off pro vaxxers and chew bubble gum. Im all out of bubble gum.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"459509127578200","commenter_b":"She still has it","commenter_a":"I would love to dance with ..you go girl..!","post_message":"I can't stop laughing!"},{"comment_id":"10153699640168984","commenter_b":"Trump2016, Deported his ass and then let him back in,Just like he said he can do with the good illegals, but if they are bad then he will leave them on the other side of the wall.lol","commenter_a":"the most entertaining candidate I have ever seen :)","post_message":"This Univision host thought he could battle it out with Trump, but he failed BIG time. Do you think Donald Trump made the right move?"},{"comment_id":"970145053025967","commenter_b":"Remember: it's all politics ...and about votes. The GOP is garnering for the 'jewish' vote in 2016.","commenter_a":"Talk about shooting yourself in the foot...! Between this \"journalist\", Boehner, and Bibi, the court of public opinion may not be so kind. Obama will most likely rise above the pettiness, but like he said, there WILL be consequences. He is after all the actual elected President of the United States.","post_message":"Conservatives and Pro-Israel groups are now actively undermining the US President. This is about as un-American as it gets."}]
