[{"comment_id":"10153966184001037","commenter_b":"She is crazy & evil!","commenter_a":"Obama started the war in Iraq?","post_message":"Sarah Palin opens up about her son's arrest: “My son, like so many others, they came back a bit different.”"},{"comment_id":"574474082714162","commenter_b":"A voting majority will not vote for a re-hash of the Bush administration.","commenter_a":"Newt Gingrich, Mike Huckabee","post_message":"Question of the Day: Who should Donald J. Trump pick to be his running mate?"},{"comment_id":"624483627700413","commenter_b":"Someone gets it.","commenter_a":"Awesome, telling them to get a job is not on the list.","post_message":"Think what you're doing helps the homeless? Maybe it's time to think again. ~Amy"},{"comment_id":"1109027105857009","commenter_b":"As the meme says, \"If you don't have a vagina and womb, keep out of mine!\"","commenter_a":"I support Bernie. Because I can't stand either Hillary or Trump. And because he wants Single Payer health care. But the Democrats are insane to support abortion rights. We will ALL be held accountable before God for the murder of our children.","post_message":"We're PROUD to be Democrats. Are YOU?"},{"comment_id":"1552392261455878","commenter_b":"You forgot to show the filthy, disgusting women in vagina costumes.","commenter_a":"I'm sick of vagina.","post_message":"Congratulations to the women marching around the world today. We will not go back to the days when women had to risk their lives to end a pregnancy. The decision to have an abortion must remain one for a woman, not the government. And we will not go backward to a time before Planned Parenthood, when millions of women had no access to birth control or cancer screenings. We must go forward to ensure full reproductive justice for all women."},{"comment_id":"10153407697891519","commenter_b":"Hope it's a woman.","commenter_a":"I'd like to hear Feines' opinion on this. I would also like to know what other actors were applying for the part.","post_message":"We're actually embarrassed for everybody involved..."},{"comment_id":"1217766195006823","commenter_b":"DISGUSTIMG CLASSLESS PIGLETS UNREAL","commenter_a":"Congrats to the left,You've just proven to the world,you don't need Obama to make America look foolish,you can do it all on your own.","post_message":"ClashDaily.com"}]
