[{"comment_id":"10154362244534778","commenter_b":"This is a symptom of disrespect. Did the office overreact, perhaps. What do you do with a teenager that doesn't listen to authority? Continue to let her disrupt the class? This girls deserves to be punished. She may have gotten hurt because of her initial defiance but she is not a victim. They should review the incident and I hope they clear the officer of everything and I hope they give the girl detention. If we don't stop the disrespect, the result is anarchy.","commenter_a":"This kid did not attack anyone she may have ignored commands peacefully as most protestors will do but in no way is that a crime. The violent attack from this cop was in fact a crime.","post_message":"About 100 students wore T-shirts reading \"Free Fields\" or \"#BringBackFields.\""},{"comment_id":"936127749836940","commenter_b":"And system fail too","commenter_a":"Sel Taylor","post_message":"I Just Got a Computer Chip Implanted In My Hand — and The Rest of The World Won’t Be Far Behind"},{"comment_id":"10155469522230354","commenter_b":"Where do these idiots come from on the left, try to bring in women to compete with fox and there is nothing between the ears.","commenter_a":"Those tampon dangles must have penetrated her brain.","post_message":"Believe it or not, it actually gets worse..."},{"comment_id":"10153194256163812","commenter_b":"humanity at it best.","commenter_a":"Anaa Rodriguez Jesus Rodriguez Beto Rodriguez no salgan!","post_message":""},{"comment_id":"10154097033159117","commenter_b":"If you want to save money, deport Native-Born citizens. The immigrants cost less. @webpagelink","commenter_a":"our country is broke--go live somewhere else.","post_message":"\"So long as people are coming here to live peacefully and work peacefully, I think the government should have to show to us why they shouldn't be here.\" For the full video, go here: goo.gl/8DSL14"},{"comment_id":"1022890011112195","commenter_b":"well people you all know by now that the illegals are who and what is at the top of being cared for first and they receive what our own Military should be getting as well as the American people our men and women who risk their lives are just a # and after thought and these actions begins with THE PRESIDENT OF THE UNITED STATES who has no respect for any Military or the American people , prayers for all who serve and have served and and fought for this great Country and our freedom and what we stand for we need to clean out the Government offices starting with the WH oval office we need a real man put in that position one that will help America not destroy it","commenter_a":"its in my tat","post_message":"NEVER FORGOTTEN! The voice of the people"},{"comment_id":"10157519592720206","commenter_b":"Lol You're aware this is in America. Not illegal here.","commenter_a":"It's actually illegal for major super markets to charge for a plastic bag because for example say tescos they can't charge you because your advitizing tescos through the bags also store laws are to provide bags for customers not well not sell them to us","post_message":"Get ready to pay 5 cents for a plastic bag."}]
