[{"comment_id":"569159163208677","commenter_b":"Ohhhh....the irony. An 'upgraded' fence around the WhiteHouse to keep 'intruders' (i.e., we the legal citizens of the U.S.) out, but Obama and Hitlery refuse to support fencing our borders to keep illegals out. SMH","commenter_a":"Voting Trump a real American","post_message":"President Obama just unveiled the new White House fence and a lot of people are upset. This new design feature has Americans demanding it be torn down."},{"comment_id":"10153744028791178","commenter_b":"WHAT!!!! She's the one that should b in jail","commenter_a":"She needs to go to jail.","post_message":"I'm not sure you can send people to jail for this..."},{"comment_id":"10154411705371336","commenter_b":"@username Did you purposefully neglect the part that this is what happened in every parts of the Earth? They did the same thing with the Aborigines here in Australia, when Arabs invaded Constantinople and established Istanbul...smh","commenter_a":"She is one of the few Christian celebrities. God Bless Her. Amen this nation was founded on Judeo-Christian values.","post_message":"Candace Cameron Bure is grateful to be living in the USA because \"we have the ability to love God here.\""},{"comment_id":"10153657891231336","commenter_b":"Stupid old woman","commenter_a":"Keep her in jail until she resigns or issues marriage licenses!","post_message":"Kim Davis will be in jail at least a week, but she could stay longer if she continues to not obey the judge's order."},{"comment_id":"10155086722556323","commenter_b":"@username Will it be a big, beautiful wall?","commenter_a":"I can see the 'Jungle' camps with the immigrants around the NI border already :)","post_message":"Ireland prime minister has warned that avoiding a post-Brexit border is now vital for the republic national interest."},{"comment_id":"10154164118946167","commenter_b":"Legal immigrants!","commenter_a":"There has got to be individual discretion involved in these cases. It's ridiculous. We are a nation of immigrants. We all come from an immigrant somewhere down the line!","post_message":"A Cambodian-American spoke out today about how inhumane Trump's immigration rhetoric is. This is an interview that a lot of people need to see."},{"comment_id":"844439005656552","commenter_b":"breaks my heart to see what my son and brother actually see. These people don't just mad out on red and green. When they see anything that has a red or green in it. They don't see it with the colors they can interpret. So nothing is as it should be. You need red to Make purple, purple doesn't appear the way the rest of us see it for them.","commenter_a":"Sylvain St-Arneault","post_message":"Watch people see color for the first time thanks to these high-tech glasses."}]
