[{"comment_id":"1098350870176382","commenter_b":"All ILLEGAL immigrants are criminals. Come here legally and I will welcome you with open arms and warm smile.","commenter_a":"anyone with common sense knows that all immigrants aren't criminals, just like all whites aren't bigots, all blacks aren't ignorant, and all hispanics aren't lazy.","post_message":"ICE program focused on ‘national security’ detains immigrants with zero criminal convictions."},{"comment_id":"10153430470412217","commenter_b":"Oh no no no....this woman is only about herself. My America would be a disaster if this witch were to gain the presidency. She is a fake and a phoney. She lies more then she tells the truth. She thinks our rules don't apply to her. God helps us if she wins!","commenter_a":"Speaking as a Scotsman who likes the USA, I think Hillary is the best choice to be the next president","post_message":"The latest in the battle to be the Democratic presidential candidate."},{"comment_id":"10154177421583734","commenter_b":"OK, toss in Jesus too, and all the Angles, and it still won't get him the Seat.","commenter_a":"He could have God running with him . He still has no shot at winning","post_message":"Do you think Fiorina was a good choice for Cruz?"},{"comment_id":"10155874943040354","commenter_b":"Black scumbags do not matter !","commenter_a":"I'm sure Al Sharpton and his ilk will spin this as a racial injustice and Obama will write his family. Probably won't claim him as looking like his son as he's been there and done that. All of them are sick sons of bitches.","post_message":"Police say the 82-year-old did one thing that likely saved her life..."},{"comment_id":"1143931678960194","commenter_b":"Say Ms white woman...dismissed!","commenter_a":"Idiot!!!! Every race suffers racism!! And all lives matters. Not just blacks. An American is an American! I'm not a Caucasian American! They shouldn't say African Americans either. Get with this century!","post_message":"Clinton: \"We need to acknowledge some hard truths about race and justice in this country, and one of those hard truths is that that racial inequality is not merely a symptom of economic inequality. Black people across America still experience racism every day.\""},{"comment_id":"924300044274003","commenter_b":"Duh...He's a Liberal!!! He wants Fox to continue pying him, even thought he won't kick his alcohol and drug problem!!!","commenter_a":"Can you send Juan Williams with him?","post_message":"Bob Beckel isn't going to stay silent in the face of a harsh Fox News statement announcing his departure form the network."},{"comment_id":"10154344335198181","commenter_b":"And the public has every right to show their displeasure by not supporting a corrupt regime...","commenter_a":"He's stupid","post_message":"The White House Press Secretary Sean Spicer on Pres. Donald J. Trump's tweet criticizing Nordstrom after decision to no longer carry Ivanka Trump's clothing brand: \"This was less about his family's business than an attack on his daughter.\" @webpagelink"}]
