[{"comment_id":"1310434322356653","commenter_b":"@username you brought the feminism in when you started defending being a hoe","commenter_a":"Only one thing I disagree is he could have waited till the sun came out more to take her and the kids out. I don't blame him for his actions if his busting his ass to provide for her and the kids. If they your kids. Please don't abandon them. And she should be grateful he didn't hurt her. I'm praying they work it out for the kids if their his.","post_message":"He felt the punishment fit the crime. #WSHH #Cheating"},{"comment_id":"10153597366220329","commenter_b":"Like we're met to be best friends lol","commenter_a":"Craig! I still think it's you.","post_message":"It's not me, it's your god damn chargers."},{"comment_id":"611879509002628","commenter_b":"She was already insane!","commenter_a":"Whay too much PIE HOLE. Cuss at me, and your Freedom of speech, goes right out the window!!! Maybe she should resort to plan \"B\". Get a M/F'in JOB!!","post_message":"This welfare leech absolutely lost it when she couldn't get change with her EBT card. How pathetic. You cannot live off the hard work of other people. Are you tired of welfare leeches stealing your money?"},{"comment_id":"370446236477004","commenter_b":"Take the bastards OUT!","commenter_a":"Time for drone, and Hell Fire missles.","post_message":"Is your state on the list?"},{"comment_id":"517132878459126","commenter_b":"Right under this post is an article that says blue nation review gives Hillary Clinton her own media wing.","commenter_a":"But the Word of God is in our heart, never to be taken away, Glory to God","post_message":"The numbers are undeniable."},{"comment_id":"954295721303850","commenter_b":"Dumb hoe lol","commenter_a":"KiAsia SimplyyMee Wilson smh #fixitjesus","post_message":"SMH"},{"comment_id":"1416682211693618","commenter_b":"Ya we we'll come u 2 da seat Hillary","commenter_a":"She is a wonderful woman, read this to get the proof @webpagelink","post_message":"A reminder heading into tonight's debate."}]
