[{"comment_id":"1147470615320800","commenter_b":"For one I'm not a dumb ass.So don't call me names.Im a lady.And I will vote Hillary","commenter_a":"Clinton for president","post_message":"BREAKING: ANONYMOUS Set To Drop MOTHER LODE On Hillary TOMORROW... Here's What We Know [VID] \"EVIDENCE EXPOSING THE LARGEST COVER-UP IN AMERICAN HISTORY!\""},{"comment_id":"10153997229702042","commenter_b":"You ladies don't have knees or you like the attention... Knee to the groin!!","commenter_a":"Get him off the streets","post_message":"Police are looking for this man who allegedly groped and rubbed his groin against a subway rider on the train. \"SHARE\" this post to help police find this man."},{"comment_id":"1115332378507619","commenter_b":"Shame on you Arizona. This is the doing of ALL your citizens. I have spent a lot of time in Southern Arizona - at one time I would have retired near Tucson when we arefnished traveling. Not any more. Shame on you.","commenter_a":"Conservatives want to go to war with ISIS because they are destroying ancient sites but have absolutely no qualms about destroying our own indigenous holy places","post_message":"Should it be legal for Congress to give away ancient Apache holy land to a foreign-owned mining company? Represent.Us has the scoop."},{"comment_id":"10153816646376336","commenter_b":"They think that are comedians!:) seriously??? They are not funny at all! These women on the view are ugly and boring! I am still at a loss who watches this show?","commenter_a":"Let's don't get started about people's looks .","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."},{"comment_id":"739879102780921","commenter_b":"She's biding her time!!!","commenter_a":"Let me offer you, @username, some unsolicited and unqualified advice since I'm not a politician. There is no way you should be neck and neck with Bernie Sanders. But you're playing weak. Go on the attack. Use your willingness to stay in a marriage regardless of your husband's infidelity as a selling point. We all know people make mistakes. Marriages often dissolve over a hint of unfaithfulness and unforgiveness. Only the extremely strong can take a mistake made by a spouse to demonstrate their character. If I'm not mistaken this is Sanders' second wife and 'The Donald' has had three wives and several affairs. How many times have you been married? They can't use President Bill Clinton's infidelity to their advantage, but you can. Who are the people advising you?","post_message":"Jimmy Fallon: Can we do a Snapchat? Hillary: Sure! 👻"},{"comment_id":"1231862310212247","commenter_b":"We better get building that wall","commenter_a":"This will be interesting. Will President Trump undo what Obama did to lift sanctions and travel restrictions to Cuba?","post_message":"Live Look: Celebrations in Miami over the death of Fidel Castro, and images from Cuba."},{"comment_id":"10153055382512061","commenter_b":"That woman. Was disgusting","commenter_a":"I'm sure there must of been a 'medical' term for the reasoning....","post_message":"\"I asked him why I couldn't do it and he said, you're black.'\" Black delivery driver replaced after customer wanted whites only: @webpagelink"}]
