[{"comment_id":"10154091586819160","commenter_b":"@username @webpagelink","commenter_a":"lets see BLM carry guns and shoot police and beat up on whites. Burn our flag and want to separarte from the union. These guy protested without hurting anyone and had our american flag with them. even the policeman felt safe with them around. BIG DIFFERENCE.","post_message":"Despite carrying assault rifles, the group says it didn't mean to \"start any problems.\""},{"comment_id":"388738841314410","commenter_b":"Go home , get out of USA !","commenter_a":"GOAT HUMPERS","post_message":"Muslim Leaders Show How ALL Muslims really think...."},{"comment_id":"380847572097124","commenter_b":"This piss-ant compared himself to MLK!!! That's their mentality; he's blinded by hate. Typical rightwing idiocy!","commenter_a":"Idiot.","post_message":"Today is not the day for this nonsense."},{"comment_id":"10153206057979312","commenter_b":"Yeah that's why global warming is such a bigger deal than millions of humans getting their head slashed. Good one! You know they will come over here and do the same!","commenter_a":"If the President comes out in favor of it they'll drop the idea like a hot rock.","post_message":"Under the proposed measure, Missouri residents would switch to daylight saving time in March 2017 and never turn their clocks back again. Good idea? Bad idea?"},{"comment_id":"1778494812377732","commenter_b":"@username, so your point will be valid according to the justifications of the San Bernardino and Paris Massacre victims and their families? How much more American people must die before you realize even 1 terrorist is unacceptable for the sacrifice of our lives just to be nice to foreigners?","commenter_a":"Does anyone remember FDR's ban on Japanese and Jimmy Carter's ban on Iranians? Oh, and they were both Democrats, but Trump is being compared to Hitler for suggesting we ban Muslims. Funny how that works.","post_message":"Skyscrapers. Music. Athletics. Comedy. The list goes on and on ... After Donald J. Trump's recent controversial remarks, here's a look at the United States without the influences of Muslims."},{"comment_id":"10153574405058352","commenter_b":"No lesson learned. Maybe she wore her moms shoes because she could not afford a pair of her own","commenter_a":"She should have stayed down and took those shoes OFF and kept it movin","post_message":"Lesson learned! Moment girl graduating from high school wobbles for 12 SECONDS in platform heels before crashing to ground"},{"comment_id":"1744978035715181","commenter_b":"Me too. She was sweet. I guess that's why she bit it.","commenter_a":"Kim, I thought you would appreciate this.","post_message":"AMC's the Walking Dead may soon be stumbling its way out of Georgia if the state's anti-LGBT bill is passed."}]
