[{"comment_id":"10155026272596320","commenter_b":"Loose lips sink ships!","commenter_a":"There saying nothing","post_message":"REPLAY: Senate hearing on Russian hacking. Office of the Director of National Intelligence NSA - National Security Agency"},{"comment_id":"10154034067333701","commenter_b":"Is that a dude in drag? Or a real girl","commenter_a":"It is a bad eyebrow day.","post_message":"Court documents showed Perry had at least 15 prior criminal convictions, including five felonies and driving violations, along with a felony warrant for ID theft, methamphetamine possession and providing false information to police."},{"comment_id":"1062730680414093","commenter_b":"Donald trump can't even get 35% registered republicans Please do the math Trump can't win a general Election. You remember my words I'm not being nasty\" just call it in the know. You will find out I'm correct.","commenter_a":"This is for all of my fellow Florida voters. I just received my mail in ballot. Donald Trump is on the very bottom of the list, so please be careful and select him.","post_message":""},{"comment_id":"10153506552374342","commenter_b":"She looks like a freaking man","commenter_a":"Looks like a dude","post_message":"We're getting our first look at the female shooter in Wednesday's tragedy in #SanBerardino."},{"comment_id":"389420827906465","commenter_b":"Tony, Many of today's pillars of righteous GOPer's come from illegal entry to the U.S. We often forget the illegal passage of our Italian, Irish, English, ancestors. You know the \"mention pot\". Key word that you are ignoring is RACISM. Hope that's not you, but it sounds like it might be. Have a good day !!!","commenter_a":"In a Nation of immigrants,mi would expect nothing less. The reactionary GOP is just plain backwards and have forgotten our heritage.","post_message":"President Obama has their back."},{"comment_id":"10153458857456107","commenter_b":"Keep them out.","commenter_a":"As an avid, long-time, supporter of your campaign (I mean... I was hoping you'd run for president back in '04), I am very disappointed to see you taking this fearful and outdated stance. Isis doesn't need refugees to sneak into our country, they have the internet.","post_message":"Today I introduced a bill that calls for an immediate moratorium on visas for refugees. My bill will also stop all refugees as well as others from obtaining visas to immigrate, visit, or study in the U.S. from about 30 countries that have significant jihadist movements. This bill will be paid for with a special tax on arms sales to any of these countries. Read more here: @webpagelink"},{"comment_id":"10155786065335329","commenter_b":"I sincerely hope you don't have children or grandchildren. Do not reproduce. You know who needs serious psychological help? People who are so close minded that they can't see out their \"perfect little bubble\" and judge anyone and everyone different than them. I love my generation because we are some accepting individuals. We want equality for all because WE ARE ALL HUMAN!! why does it matter to YOU personally what genitals someone has/wants. Who they lay down with behind closed doors. Why is considered \"crazy\" for the parents to support THEIR child's dreams and aspirations. Like got damn lady. Worry about your own snatch and keep your negativity to yourself. ✌💚","commenter_a":"Wow that family needs serious psychiatric help.","post_message":"\"By four, Samuel broke out in hives when we tried to cut his hair, and at five he told us, through tears, that he wanted to burn his face off because it wasn a girl face.\""}]
