[{"comment_id":"10152834181476135","commenter_b":"Another feminist circle jerk. You silly basic b*tches need to go take a hike and get off Facebook and tumblr.","commenter_a":"The amount of ignorance in these comments.....","post_message":"Cortney Bogorad says, despite the embarrassment she felt after the incident, she is taking legal action so no one else goes through a similar experience."},{"comment_id":"1306172506079052","commenter_b":"@username if immigrants want to come to America and live the American Dream they should work for it. Trump isn't against immigration he is against ILLEGAL undocumented immigrants. If u want to come here, come the right way.","commenter_a":"And when a pregnant illegal comes here and has a baby born here that baby is a citizen and then that baby is able to get welfare food stamps housing WIC fuel assist etc... All while the mom is an illegal but cuz child is born here it's entitled WAKE UP AMERICA","post_message":"Donald J. Trump responded Monday to the worst terror attack on U.S. soil since 9/11 with a tough call to clamp down on Muslim immigration. @webpagelink"},{"comment_id":"10154186189827894","commenter_b":"What a bitch","commenter_a":"Real petty","post_message":"Ouch! Sheree Whitfield Responds to Kenya Moore's Chateau Shade: 'My Mother Loves Me' [Video]"},{"comment_id":"10152975606714205","commenter_b":"Oh me and Lamar was talkin bout it all day lol","commenter_a":"Nae you hear about this??","post_message":"Rapper Rick Ross arrested after pistol-whipping a man."},{"comment_id":"10153043792241680","commenter_b":"Hillary Clinton 2016!!","commenter_a":"Maybe it's his fault...no cant be.","post_message":"He says it would be \"an unforced error\" if Republicans let the government shut down."},{"comment_id":"750259701739305","commenter_b":"Until the GOOD cops police OUT theBAD COPS, these arrogant ignorant asshats will continue to terrorize our citizens. NO EXCUSE!!","commenter_a":"I wish he'd get fired!!!!!","post_message":"His tirade was caught on tape."},{"comment_id":"962607787132303","commenter_b":"I am a Turkish citizen, as well as a British,! all our cities, streets and everywhere in Turkish borders are full of Syrians.. More than 2.5 million people officialy! Isn't that enough?? You still call yourself\"human\"?? We are sharing our bread and shelters with them. What about you? When it comes to talking about peace and human rights, you are the best, huh?Act now! It's the right time! Or do you prefer watching this American film on vision in your comfy sofas forever??? Barry in mind! ISIS is USA, UK, and IS'REAL terrorist organisation!!! They r the ones! Making, and forcing them to die or leave their homes.!! Then UK, USA, and IS'REAL terrorist organisations can get an easy access to their recourses, gold, diamond, oil, and gas.!!!! You both got it!!!","commenter_a":"If the EU keep housing them they will keep coming and is only going to make the problem worse. If they really wanted safety then they would have stayed in Muslim Turkey. They are all out for the benefits that get lavished on them. You cant blame them and most people would do the same.","post_message":"Bikinis, sun loungers ... and a tide of despair"}]
