[{"comment_id":"10153092364080779","commenter_b":"how about enforcing the laws.....dumb bitch.....","commenter_a":"If I hear gun control one more time... I couldn't feel worse for the families that lost loved ones today, but laws are NOT going to keep law abiding citizens safe from criminals, the mentally ill or those that intend on dying in a blaze of glory.","post_message":"Calling America's epidemic of gun violence \"a political choice we make\" and declaring of the nation's political class, \"we, collectively, are answerable to those families who lose their loved ones because of our inaction,\" President Barack Obama delivered one of the rawest speeches of his presidency today in response to the Umpqua Community College shooting rampage. Read it below."},{"comment_id":"1528359970798514","commenter_b":"Hillary is a traitor!","commenter_a":"At what point do you recognize the whole process is a farce and Hillary's presidency has been predetermined and bought since 2008?","post_message":"What questions do you have about the Democratic and Republican primary races? We are live with WSJ's Aaron Zitner and Dante Chinni now."},{"comment_id":"822921484411860","commenter_b":"Run him out of America or sent him to Islam for good !","commenter_a":"Absolutely YES! Police are bound by laws and orders that do not allow any other real form of expressive protest. This sends the message loud and clear. It is also a great honor of solid support to the murdered officer whose Mayor helped provide the hostile environment in which this officer was murdered.","post_message":"Was this the right move?"},{"comment_id":"10153000605642060","commenter_b":"The way all states should be.","commenter_a":"When purchasing a firearm in a Louisiana gun shop, a buyer will encounter limited procedural barriers. Louisiana is commonly referred to as a \"gun loving state.\" The only necessary requirement for purchase is a valid driver's license, which can prove the buyer meets the federal age limits: 21 for handguns and 18 for shotguns or rifles. There is no gun permit required to purchase a firearm in the state, nor is a gun license mandatory to detail ownership. Registration of long guns or handguns is also not required under Louisiana law. There are no restrictions on long guns in the state; the only areas where an individual cannot carry a loaded shotgun or rifle are on college campuses, or properties that specifically designate the barring of weapons. Areas such as schools, hospitals, municipalities, and places of worship often disallow carrying privileges. It is also permissible to transport loaded long guns ...","post_message":"Gov. Bobby Jindal believes Louisiana law is strong enough to prevent people with mental illnesses, like the Lafayette shooter, from purchasing a gun."},{"comment_id":"10153497244196051","commenter_b":"You are such a bitch. You need put to death just like you did your baby. You bitch","commenter_a":"Glad she didn't get off like Casey Anthony","post_message":"This woman didn't want her ex-boyfriend dating other women. Her 2-year-old daughter ended up paying the price."},{"comment_id":"936127749836940","commenter_b":"And system fail too","commenter_a":"Sel Taylor","post_message":"I Just Got a Computer Chip Implanted In My Hand — and The Rest of The World Won’t Be Far Behind"},{"comment_id":"966472163391020","commenter_b":"They won't last very long if they show up here!","commenter_a":"Already here","post_message":"Nothing but a change in leadership can stop this."}]
