[{"comment_id":"10153123685718690","commenter_b":"Exactly , he got 72 Virgin girls.","commenter_a":"So jihad was killing none believers and was killed? so he died a hero?","post_message":"The mood was sombre as mourners gathered in Beirut southern suburbs to pay their respects to Jihad Mughniyeh, one of the six Hezbollah fighters killed in an alleged Israeli air strike in Syria. @webpagelink"},{"comment_id":"1006601726066242","commenter_b":"It is her own fault due to not following the rules- do not get closer then 25 yards!!!","commenter_a":"Stupid people, I do enjoy them.","post_message":"Pictured: Moment bison selfie went all wrong"},{"comment_id":"10153201111658984","commenter_b":"DEPORT ALL OF THEM !!","commenter_a":"And the sad part is that I have no faith this error will ever be fixed.","post_message":"This is just astonishing. I think this revelation will make a lot of people very uneasy..."},{"comment_id":"10154384389006636","commenter_b":"One of the biggest lies is that the state of Israel was built out of a scrap of desert with just a few primitive wandering around. So they perpetrate a lie that Palestine was the invention of Yasser Arafat and the Palestine Liberation Organization. Yet the real truth is that Palestine has existed as a discrete country for well over 2,000 years and there is plenty of evidence to prove this. @webpagelink","commenter_a":"Israel continually ignores international law and wonders why the UN resolution was passed against illegal settlements in occupied land. Will Israelis give the homeless shelter - hell will freeze over first.","post_message":"A nationwide strike"},{"comment_id":"524989287704578","commenter_b":"Build the wall","commenter_a":"Hillary has been in the lime light for 30 years first lady, senator of New York, Secretary of state, and i can not think of one good thing she has done, nothing prolific, nothing of any worth, and i see a successful business man. Oh the choices","post_message":"WATCH: Donald J. Trump hosts campaign rally at the Fox Theatre in Atlanta. @webpagelink"},{"comment_id":"10153077388711051","commenter_b":"What she can't read? So they don't like what your wearing take your business elsewhere duh but what she is wearing I see nothing wrong with she has more close on then most. The owner is an ass","commenter_a":"Seafood Nazi.","post_message":"When this woman was told that she was being kicked out of a store for her 'inappropriate' outfit, she thought it was a joke. Nope."},{"comment_id":"884581044987387","commenter_b":"If one wants buy-in from white people, blowing off white people who have had similar experiences seems extremely counterproductive.","commenter_a":"i think it's racist that it's subtle racism is only being committed by a white person in the panel. the comic itself is subtly racist.","post_message":"Let's agree to fix this."}]
