[{"comment_id":"10154286409446800","commenter_b":"That's pussy shit. And we agreed on 2","commenter_a":"Jami Hugo Omar Oliver","post_message":"Tonight at 11/10c on The Daily Show: #NationalHandshakeDay, a Brexit update and most important, Jessica Williams’ final show."},{"comment_id":"10153322219778188","commenter_b":"@username......... you're making me hungry!!!!!!","commenter_a":"Should they be wearing ball caps and tennis shorts? You equip with the best available to protect yourself.","post_message":"Local police are now often seen equipped with the same gear and weapons you would see in a war zone. How did this happen? @webpagelink"},{"comment_id":"1619560758331037","commenter_b":"This bitch needs to be taken down so sick of her throwing other people under the bus she's just as guilty as them. Take her out!","commenter_a":"SHE MAY RUN...BUT YOU DO NOT HAVE TO VOTE FOR HER! THE RED CARPET WAS YANKED OUT FROM UNDER HER BEFORE...IT CAN HAPPEN AGAIN! BENGHAZI MURDERESS IS NOT PRESIDENTIAL MATERIAL!! THE CLINTONS N' OBAMAS ARE FINISHED!!","post_message":"Hillary Clinton MUST be stopped!"},{"comment_id":"10156899392785725","commenter_b":"Hope she gets jail time","commenter_a":"hillary who shed the blood of innocent American at Libyan embassy. Obama and clinton who created all conflicts possible in America ( income war, gender war, age war, war on women, Race wars) driving wedges among the people. Hillary clinton and bill clinton war on women explained by Roger Stone on youtube","post_message":"As President of the United States of America- I will see to it that the AWARENESS continues -- I will be in a position to immediately handle all of the issues at the VA --- nobody will look after our Veterans --- our heroes, like me. I guarantee that!"},{"comment_id":"10154734487368352","commenter_b":"You got that right,unless she's a fool","commenter_a":"When they get that paper he'll want a black woman","post_message":"Browns quarterback Robert Griffin III pictured walking hand-in-hand with a blonde Estonian athlete as reports he is divorcing his wife of three years emerges"},{"comment_id":"1160371997392384","commenter_b":"She made us women proud!","commenter_a":"Proud of you, and I don't even know you! I spend a lot of time in Florida although I don't live there. If I ever encountered Scott, I'd like to think I'd tell him off, perhaps not so 'eloquently'!","post_message":"\"In some ways this is about me and my personal interaction, but it's also about all of us who are having to live under the reign of Governor Scott.\" - Cara Jennings"},{"comment_id":"1418008091611056","commenter_b":"I bet you a thousand dollars her girls didnt eat that crap they served. Im also sure she herself never ate that crap. She had a full service crew of chef's preparing her gourmet foods 24/7.","commenter_a":"Lunch program? What lunch program? My daughter will never eat lunch at school so I have to fix it for her everyday. On the few occasions where she had to buy it she says it's terrible and she didn't eat it. They serve stuff like corn dog tots with tater tots total processed garbage that doesn't even taste good. What tF is so hard about giving them a piece of chicken on a wheat roll with a piece of fruit?? It ain't rocket science people.","post_message":"Michelle Obama's legacy is already unraveling..."}]
