[{"comment_id":"10153815696151336","commenter_b":"I don't know about that. I think this election we have many that will go up against HRC. She ruined her own chances. Everyone's sick of the shenanigans","commenter_a":"\"DESPERTA FERRO\"..., AWAKEN IRON!!! Christian Battle Cry of the Crusades. Unite and Fight people. WIPE THIS DEMOCRAP FILTH FROM AMERICA!","post_message":"“I am Hillary Clinton‘s worst nightmare — a conservative woman who will take her on on her track record and her policies and her lies.” – Carly Fiorina"},{"comment_id":"10152898071811336","commenter_b":"illegal aliens no doubt !","commenter_a":"Are you kidding me, do parents have any responsibly any more.","post_message":"The nation's second-largest school district is eyeing a move to offer dinner to students at every school."},{"comment_id":"843529112375874","commenter_b":"About time someone takes a stand. Great job now everyone else needs to fall in line and do the same.","commenter_a":"Good for them","post_message":"REVENGE: French Attack Mosques And Blow Up A Muslim Kebab Shop Looks like the French have had enough of the Muslims immigrants living there and are fighting back! @webpagelink"},{"comment_id":"10153551784963984","commenter_b":"She wants some air time don't give it to her","commenter_a":"Yep","post_message":"These days, Donald Trump seems to be at the center of every controversy. He might just be in the midst of another one after this actress just thanked him for his stance on immigration... Do you agree with Donald Trump's views on immigration?"},{"comment_id":"10155866233724199","commenter_b":"@username trump wives were here illegally before became citizens , your an immigrant just like these people. The were properly vetted and that's a fact . S maybe you should go back where your from and see how fast you live after setting on one foot .","commenter_a":"IF YOU ARE NOT HERE LEGALLY THEN GET OUT ! WE HAVE LAWS AND THEY ARE GOING TO BE ENFORCED !","post_message":"Governor Jay Inslee reacts to President Trump's immigration ban. \"The unjustifiable chaos and cruelty caused by President Trump executive order is now on full display, right now at Sea-Tac airport.\" More: @webpagelink"},{"comment_id":"964070213702162","commenter_b":"She is dumb as a fox! Crooked doesnt require brains! Just dishonesty!","commenter_a":"Ha! Ha! Poor Hilary Rotten Clinton!","post_message":"Does anyone know that Crooked Hillary, who tried so hard, was unable to pass the Bar Exams in Washington D.C. She was forced to go elsewhere!"},{"comment_id":"752230248210825","commenter_b":"@username you live in the Philippines, don't worry about our country, stay in your shithole","commenter_a":"***Trump Platform*** 1.) Donald Trump believes that America should not intervene militarily in other country problems without being compensated for doing so. If America is going to risk the lives of our soldiers and incur the expense of going to war, then the nations we help must be willing to pay for our help. Using the Iraq War as an example, he cites the huge monetary expense to American taxpayers (over $1.5 trillion, and possibly much more depending on what sources are used to determine the cost) in addition to the cost in human life. He suggests that Iraq should have been required to give us enough of their oil to pay for the expenses we incurred. He includes in those expenses the medical costs for our military and $5 million for each family that lost a loved one in the war and $2 million for each family of soldiers ...","post_message":"\"What she did is a criminal act ... if she's allowed to run, honestly, it will be a sad day for this country, because what she did was wrong.\" Donald J. Trump slammed Hillary Clinton during his #SuperTuesday speech in Palm Beach, Florida tonight."}]
