[{"comment_id":"10155380353783797","commenter_b":"Smh Freaking Nazis","commenter_a":"KevinNajera","post_message":"HOLOCAUST REMEMBRANCE DAY: Today marks the liberation of the Auschwitz Nazi death camp on January 27, 1945. Take a moment to remember the millions killed. bit.ly/2k1HfMq"},{"comment_id":"10154040024789160","commenter_b":"If you got a dick,,,, GO F- - K yourself","commenter_a":"Go sway","post_message":"It's Barack Obama's 55th birthday. What's your birthday message for him? (AP Photo)"},{"comment_id":"10154529341826178","commenter_b":"This may be fun! Hillary won't be debating a politician! I see a house falling on her and watching her toes curl!","commenter_a":"Illegals and dead people voting","post_message":"Mika seems so sure of this...#RNCINCLE"},{"comment_id":"712201488878460","commenter_b":"Just can't stand that a black woman dresses better than you eh? Jealousy is a sin ya know.","commenter_a":"funny how ms obamas wardrobe has gotten mote expensive over the years. guess jcrew too cheap for her now. oh well, shes outta here soon anyways ;)","post_message":"Michelle Obama wore a familiar outfit last night ..."},{"comment_id":"1152094041550315","commenter_b":"This is Trump he's racist or rapists he brings crime and does drugs is insane and sometimes maybe nice but lies all the time! He only hooks up with foreign women probably keeps them in the basement until needed no American woman would ever marry him no matter how much money he has!","commenter_a":"Make America great again by getting rid of Trump! Check out the smile on that white boys face makes me sick and I'm white! Trump is nothing but a trouble maker and an embarrassment for America! Do any of his supporters listen to him I mean really listen and heed what he says and does?? I doubt it must be mental illness","post_message":"The laughter of the Trump supporters will haunt you."},{"comment_id":"10153292336206680","commenter_b":"Given he is so concered about conditions in Eurpose how about opening the borders to more refugees in desperate need . Sharing the burden rather than slamming to door to hope shut.","commenter_a":"I've been to Brussels. I was essentially homeless there for one night as I passed through -- I camped at a vacant fairground. Not a single Muslim tried to commit a violent act against me. The real world isn't nearly as scary as Trump seems to think it is.","post_message":"POLITICO Europe Donald Trump defended his proposed Muslim ban."},{"comment_id":"10153043089801519","commenter_b":"Right? Because...ick.","commenter_a":"#dontbethatguy","post_message":"\"He then sent me five nude photos of him lying in bed, his penis prominently displayed...\""}]
