[{"comment_id":"10153564847120530","commenter_b":"The father had been living in Israel when this divorce started years ago (I believe I read he currently lives in the states though) and left for a two week business trip the day after the kids were sentenced so he obviously has no time for his children that he \"cares so much to have a healthy relationship with\". He's a bad dad, the woman is a bad mom and this judge is a joke.","commenter_a":"She said all you need to know - that this was an EXCEPTIONAL case - and that there was a disgusting pattern of mental abuse/programming by the mother towards the father. Unless you are a family member who has lived through something like this, you have absolutely no idea what damage can be done to the children permanently. In our case, the The fathers children passed away from a unknown heart disease very young, and those children will never get the chance for any kind of reconciliation with him. The mother is a hateful woman, and her daughters now have no relationship with the father's side of the family because of her. The only the kids may EVER have a chance to not be screwed up permanently is by doing this. Blame the parents? What good has that done? There was cause for extreme action here - and the judge ...","post_message":"\"I wanted to do this because of your horrific behavior a long time ago and your dad begged me not to.\""},{"comment_id":"10153588505935329","commenter_b":"Arielle white people shit. Add this to the list.","commenter_a":"Ewrick Velasquez shark week!!!!","post_message":"Jaws IRL."},{"comment_id":"10150604575769999","commenter_b":"Why do you suppose all those things are necessary for women? Come on, think!","commenter_a":"Overcoming the confidence gap? Thanks for your concern NYT but I'm doing just fine. I'm so sick of people telling me how disadvantaged I am as a woman. Women get alimony, the children, special scholarship opportunities, special mentorship opportunities, special conferences, support groups for violence against women, priority disembarking off the titanic, the seats on the crowed bus, and the list continues... Let's face it, men are disadvantaged now.","post_message":"While men often overvalue their strengths, women too frequently undervalue theirs. Call it a continuing confidence gap."},{"comment_id":"1387016887980986","commenter_b":"Oh yeah. AMERICANS have to folllow all the rules, but illegals can do just as they damn please. Right? Poppycock.","commenter_a":"Fuck u Cicala !!!","post_message":"Sportscaster on Female Attacked by Democrat Mob: She Was Asking for It by Wearing Trump Jersey!"},{"comment_id":"10158220719125203","commenter_b":"Obama allowed illegals to move here, not President Trump. Obama told illegals to vote, not President Trump. During his campaign, President Trump said he was going to build the Wall, and deport illegal immigrants. They were warned. President Trump is not to blame when these criminals are arrested.","commenter_a":"Throw her ass back to Mexico","post_message":"WHOSE fault is this!? ===>"},{"comment_id":"1251860331547386","commenter_b":"She probably cheated..can't blame him","commenter_a":"Seems like all the guys in Berlin are pussies","post_message":"Cold blooded! #WSHH"},{"comment_id":"1777641695853675","commenter_b":"Shirley Awalt Tuggle Check this out mama!","commenter_a":"Sidni Schneider Amber Kerstin Brown","post_message":"She's every inch a queen. Victoria, starring Jenna Coleman, Rufus Sewell, and Tom Hughes, premieres January 15th on MASTERPIECE | PBS. Watch a preview:"}]
