[{"comment_id":"929340743844610","commenter_b":"Unfortunately, it will only get worse if lying, cheating, Hillary gets in the White House. God Bless us all.","commenter_a":"Time can't pass fast enough until he is gone and out of office!! He is such a disgrace to this great nation!!! I would love to see him locked up for all of his crimes that he has commented on the people!! TRUMP is the only hope we have...Hillary will be even worse than Obama!!!","post_message":"Obama Admin Gives Homeless Vets The Finger; Housing Illegals at Military Base Instead.... Obama is like Colin Kaepernick... Hates America, Hates our Flag and HATES the people in the US Military who defend it. Then Cries racism at every corner while becoming RICH from it."},{"comment_id":"10154884648408984","commenter_b":"The old saying ...behind a good man is a great women.... nothing wrong with that","commenter_a":"Very impressive - I have watched her handle exceptionally tough and even hostile interviews exceptionally well. Great job!","post_message":"Trump's campaign manager, Kellyanne Conway, is the very first woman to run a victorious presidential campaign. After the election, she reveals why Trump chose her..."},{"comment_id":"10153457138529342","commenter_b":"With clothing like this... Close the borders!","commenter_a":"Ya'll do know that \"Mexican\" isn't a race, it's a nationality...","post_message":"Have you seen Jonathan Figueroa? He's believed to be driving a maroon Ford Taurus. He's a person of interest after a mother and child were found dead in a southeast Houston home. #abc13 FULL STORY---> @webpagelink"},{"comment_id":"1544777802496810","commenter_b":"i smell a rat and it's not trump and his wife. ignore them,","commenter_a":"Are we still talking about this? Oh Glenn, you've lost your way!","post_message":"She has been done a grave disservice by somebody."},{"comment_id":"1238750836185439","commenter_b":"Maybe we \"Military Mothers\" should go protest the \" Temper Tantrum Party Protester's\" for BURNING OUR AMERICAN FLAG that is on our son's and daughter's uniforms. Wonder if that would take away their little spot light and five seconds of fame?","commenter_a":"After watching the new \" Temper Tantrum Party \" BURN OUR AMERICIAN FLAG last night, I'm voting straight up Republican Party Ticket for every Election... big, or small... for the REST of my life.","post_message":"\"We are living in an amazingly destructive, politically correct environment here in America. Just because something offends you, doesn't mean you have the right to hurt or destroy.\" Bill O'Reilly had some strong words for left-wing \"agitators\" who refuse to accept Donald J. Trump's victory in a fair and honest election. @webpagelink"},{"comment_id":"10155216029445500","commenter_b":"Coyotes are indigenous to our state all states. They were driven put west because of our industrialization. Now they have learned how to co- exist with man and have migrated to the east again. Warning - maybe coyotes will make owners stop using this awful leashes the retract and maybe we as a society will begin to respect all animals better . Coyotes are as afraid of is as we are of them bit put a tractable leash on a small dig ad watch an eagle , hawk or coyote take it. Adjust your human responses and behav avoid","commenter_a":"The.coyotes have a human problem. Keep your pets inside. We were the ones who came and stole the land they called home. You have to attempt to keep in mind they are there and adjust a little","post_message":"HEADS UP: Pasco residents say coyotes wandering the streets have been killing their pets. It's almost \"pup\" season, so they travel and hunt more. Here's what you should do if you see a coyote: @webpagelink"},{"comment_id":"10153650702998984","commenter_b":"The evil corrupt white witch.","commenter_a":"It's about time,","post_message":"All I can say is wow. I didn't think this was ever going to happen, but here it is. Hillary has to be terrified right about now... Are you glad the FBI is taking action against Hillary?"}]
