[{"comment_id":"10152978726794342","commenter_b":"Yep that's some more B.S. All of the jobs that illegals are here taking were done by American citizens before you came. Your comment is without any truth whatsoever!!!","commenter_a":"All this jobs yall dnt do the hispanic race does !","post_message":""},{"comment_id":"487411828113777","commenter_b":"No kill these mofos","commenter_a":"These people are evil beast.","post_message":"This is INSANE...Deport Them ALL!"},{"comment_id":"10153803392470950","commenter_b":"And yet again the liberal media twist his words, he never suggested in any form that anybody attempt to cause bodily harm to the hag. Just that we need to exercise our rights as Americans and keep the hag out of office.","commenter_a":"Why did CBS reporters ADD words to what Donald Trump said at his campaign rally the other day? What he said was \"supporters of the second amendment\" might have a way ....... meaning like the NRA's lobby could have a way to PROTECT AND KEEP THE SECOND AMENDMENT FOR ALL AMERICANS. AT NO TIME DID HE EVER SAY OR IMPLY THAT anyone be assassinated. AT NO TIME!!! When you report things that NEVER HAPPENED BY CHANGING WORDS AND ADDING WORDS, You really make yourselves look pathetic! WE ALL KNOW WHAT DONALD TRUMP SAID and it isn't what your are saying. VERY unprofessional of your news staff to do that kind of stuff! You are as bad as Hillary Clinton saying she didn't say WHAT SHE SAID ON THE VIDEO WHICH PROVES WHAT SHE SAID, when the 4 men's coffins from Benghazi were being taken off the plane. HER OWN WORDS ...","post_message":"These latest numbers come out a day after Donald J. Trump came under fire for suggesting \"Second Amendment people\" could do something about Hillary Clinton."},{"comment_id":"10156312558675354","commenter_b":"What a self serving heartless bitch.","commenter_a":"She is a good for NOTHING LIER ,GET RID OF HER FOREVER !!!!","post_message":"PARTY TIME!!!"},{"comment_id":"1201578119864976","commenter_b":"All rapists should be killed.","commenter_a":"Yes it does","post_message":"This reeks of white privilege."},{"comment_id":"10153258325486680","commenter_b":"Dear Airlines:* Dump the male flight attendants. No one wanted them in the first place. Replace all the female flight attendants with young good-looking strippers. They don't even serve food anymore, so what's the loss. The strippers would at least triple the alcohol sales and get a \"party atmosphere\" going in the cabin. And, of course, every businessman in this country would start flying again, hoping to see naked women. Because of the tips, female flight attendants wouldn't need a salary, thus saving even more money. Muslims would be afraid to get on the planes for fear of seeing naked women. Hijackings would come to a screeching halt, and the airline industry would see record revenues. This is definitely a win - win situation if we handle it right -- a golden opportunity to turn a liability into an asset. Why didn't Bush or Obama think of this? Why do ...","commenter_a":"Bernie would trounce him! Trump would get absolutely destroyed! Lmao 😂","post_message":"Donald J. Trump: \"Oh would I love to run against Bernie. That would be a dream come true.\""},{"comment_id":"680629115421379","commenter_b":"She needs to just go away already.","commenter_a":"We can let her become president","post_message":"Hillary Clinton slammed Donald J. Trump's \"I'm with you\" proclamation, writing on Twitter, \"Not included: women, African Americans, LGBT people, Muslims, Latinos, immigrants...\""}]
