[{"comment_id":"10153761646217439","commenter_b":"Dorrie America is a christian country. No one has to live under Sharia law unless they desire to participate. Women that are abused need to run to a shelter with their children ASAP.","commenter_a":"Brilliant and brave that Ben Carson would say openly what a majority of Americans are to afraid to say about Islam. Obvious to non-politicians what the incompatibility is all about.","post_message":"Carson is the first presidential candidate ever – or perhaps since Thomas Jefferson – to show a detailed knowledge of Islam and Sharia: “Right now,” he said about the possibility of a Muslim President, “when you have something that is against the rights of women, against the rights of gays, subjugates other religions and a host of things that are not compatible with our Constitution, why in fact would you take that chance?” Brilliant. Contrast those clear and simple and accurate words to the Obama administration’s systematic and deliberate denial of the nature and reality of the jihad threat. The entire Obama response to the jihad is called “Countering Violent Extremism.” Note the glaring absence of any reference to Islam and jihad. Obama is trying to fight a war while pretending that the enemy is other than what he is, or even worse, is nameless, faceless, and bereft of ideology. ..."},{"comment_id":"1770834126470122","commenter_b":"She can't fit those shoes","commenter_a":"Of course she's going to copy from one of the smartest, classiest 1st ladies we've ever had!","post_message":"Portions of Melania Trump's speech on Night 1 of the Republican National Convention bear striking similarities to Michelle Obama's speech at the 2008 Democratic National Convention."},{"comment_id":"756120254539294","commenter_b":"Dont \"let\" her leave America, MAKE IT LEAVE AMERICA! !!","commenter_a":"I thought Rosie was leaving?","post_message":"It's no secret that Rosie O'Donnell and Donald J. Trump don't like each other very much. But what she just did took things WAY too far..."},{"comment_id":"10153683930231323","commenter_b":"@username No, your country has still resposibilities coming from your good age of colonialism and be honest to your self: IS are nothing else than organised crime and don't be so stupid to believe, that an group of organised crime needs \"illegal immigrants\" to spread the business. BTW: find out where the largest number of historical artefacts from the middle east, coming with an unclear origin, are traded? Don't be surprised when you find out that it is London and you you can easily find out, that it is business of billionGBP earning. Why do you think IS is destroying historical sites? So, all this happens under the control of your government, right in your neighbourhood...","commenter_a":"The people were on their way and Germany take action to relief all surrounding countries, who where not able to cope with a minor percentage of the people floating their countries. Yes, it is not easy, but Germany helps a lot of people and countries and yes, it is a massive task, but we (you and me and our governments...) have to deal with it.Why? Because we are causing the situations, why the people have to flee and have seek for shelter. So, I am living in Hamburg, my borough is called \"Bahrenfeld\" and we have a polpulation 23.000 people. Currently we have 3.200 refugee living here. And I can hardly understand, why a country, which has caused and initilized a lot of the current wars in the middle east, in order to earn oil money ----NO---- to fight terrorism (hahaaa), refuses to take part in the resposibility...Yes, my dear ...","post_message":"“Sometimes the smugglers arrive in the middle of the night and drop underage refugees off at the service station. The police call my child protection officer at 3am, who has to go to them, and if no accommodation can be found, he often ends up taking them home with him.\""},{"comment_id":"1529581924006603","commenter_b":"She's trash, she's a disgrace!","commenter_a":"Racist pig!","post_message":"Boycott this idiot..."},{"comment_id":"10154343629676636","commenter_b":"Muslims treat you way better then any Jew would.","commenter_a":"Israelites are the best . shut up you muslim dicks","post_message":"BREAKING"},{"comment_id":"10154836635824916","commenter_b":"Yeah, he's almost as bad as Hillary! Why would anybody ever vote for either of those criminals!","commenter_a":"Of course. . . . The man is a business man being sued, up one side and down the other. He lied, often in the same speech. . . . He says wgatever pops into his head.","post_message":"It's going to be a rough four years for progressives, but Trump fans aren't headed toward happiness either."}]
