[{"comment_id":"750074615183116","commenter_b":"THIS IS AMERICA & WE BETTER START PAYING ATTENTION BEFORE IT'S TOO LATE! SHARIA LAW BELONGS NOWHERE IN AMERICA.","commenter_a":"Let go hunting America ...Get them out of our country before they hurt our love ones ...","post_message":"Muslims take over THIS U.S. town and immediately begin implementing Sharia law. You cannot force others to follow your religious laws. Do you think this is wrong?"},{"comment_id":"10156722273625354","commenter_b":"I hope the whole crowd good her sorry ass.","commenter_a":"And who allows them their STAGE? Disgustingly racial, anti police and presidential common, ticket of 8 yrs. Ugh! Don't buy their future stage!","post_message":"***BLACK PANTHER PARTY SUPPORTER AND BLM RADICAL DONOR BEYONCE OWES AMERICA'S POLICE, ARMED FORCES, & VETERANS AN APOLOGY***"},{"comment_id":"987364064653456","commenter_b":"What about the case of the stay at home mom, divorces, etc. where does she fall in your explanation Michael?","commenter_a":"Keep it in your pants or out of your pants until AFTER you finish school. I don't have to pay for your daycare.","post_message":"Juggling the demands of an education with parenting is a reality for over 25% of American college students—and it’s time that we create affordable childcare options for those seeking a degree."},{"comment_id":"10153882150921545","commenter_b":"Hahaha. Your an idiot lady!","commenter_a":"appalled by the comments on this article. this was a TEENAGE GIRL who was groomed and manipulated by ISIS agents via social media to leave her family to join them, not some mastermind terrorist who deserves to die. she is as much a victim as anyone else who has been killed by ISIS.","post_message":"ITV News reported Thursday that Sultana is thought to have been killed in May when a Russian warplane dropped a bomb on her accommodation in Raqqa, the de facto capital of the Islamic State"},{"comment_id":"10153788091955950","commenter_b":"Jay the only way Hillary will win is if she lies cheats an steels the votes. Oh wait that's what she does for a living !!!","commenter_a":"This is nonsince TRUMP is not a quiter. He's in it to win it. An he WILL !!! TRUMP FOR PRESIDENT !!!!!!","post_message":"A Clinton plant? A Russian agent? Here's everything you need to know about all the far-fetched explanations of Trump's behavior."},{"comment_id":"10155678849387004","commenter_b":"GET SOROS- GET SOROS!~ FREE AMERICA!","commenter_a":"This shows you how STUPID people at Berkeley are...","post_message":"In the 1960s, leftists at UC Berkeley fought for their free speech. Now they use violence and mayhem to trample on the rights of others..."},{"comment_id":"1379882718715731","commenter_b":"Illiterate angry white trash lady. #sad","commenter_a":"They lost the election because they rigged their nomination and backed the wrong candidate","post_message":"TheBlaze's Dana Loesch explains why Democrats lost the election at the Conservative Political Action Conference (CPAC) 2017. See more Dana @ theblaze.com/dana-loesch"}]
