[{"comment_id":"10154688029234749","commenter_b":"No, not all woman. Just ugly dogs like yourself","commenter_a":"Because the beard makes them extra ugly and nobody else wants them","post_message":"A little bit of stubble has a whole other meaning though..."},{"comment_id":"1342391692491333","commenter_b":"Put her in jail","commenter_a":"Buses...bussed them in and still cannot fill a gym","post_message":"Hillary Clinton spoke at a campaign rally in Sanford, with one week left until the election."},{"comment_id":"1185646658122029","commenter_b":"Yeah, thanks fer nuthin'. Don't need some guy's forgiveness for anything. Not lookin' for it, ain't askin' for it.","commenter_a":"No one but God can forgive sins. The Pope and priests are men.","post_message":"BREAKING NEWS: Pope Francis will allow Roman Catholic priests to absolve women who have had abortions if they seek forgiveness, the Vatican announced Tuesday."},{"comment_id":"842693252541388","commenter_b":"Go pound sand Joan","commenter_a":"WOO HOO!! #CRUZ4PRESIDENT!!","post_message":"Thank you Governor Mike Pence for your support! #ChooseCruz: votetedcruz.com/in"},{"comment_id":"1157767754287378","commenter_b":"This is the most ridiculous thing I have ever heard. NC, doesn't need this Administration deciding this issue for them! This administration is quick to bully states to legalize Gay marriage, overriding the will of the majority of people, bullying states to fall in line with their LGBT agenda. Counting the days til this administration crumbles.","commenter_a":"With all the crap that is going on and she chooses to fight this battle?","post_message":"“This is about the dignity and the respect that we accord our fellow citizens, and the laws that we as a people and as a country have enacted to protect them.” Attorney General Loretta Lynch formally announced that the The United States Department of Justice is filing a federal civil-rights lawsuit against the state of North Carolina, Gov. Pat McCrory, the North Carolina Dept. of Public Safety and the University of North Carolina over the state’s controversial “bathroom law.”"},{"comment_id":"1172100076163796","commenter_b":"Tape the bitches mouth shut and repeatedly butt fuck her","commenter_a":"Cruelty to animals is not OK.","post_message":"The internet is calling for blood after a woman posted a photo of her dog with its mouth duct-taped shut."},{"comment_id":"10153053678596157","commenter_b":"Ur rite mari but the USA cannot sentence this idiot to death cause Mexico won't allow it .","commenter_a":"He has ruined the life of an innocent women shame on him .....put him in life in prison or give him the death penalty.....","post_message":"BREAKING: Hidalgo County Sheriff Eddie Guerra says 17-year-old Eduardo Castro Lopez a Mexican man who lived in Mission confessed to killing a woman for her money. He took less than $100."}]
