[{"comment_id":"1788499241368226","commenter_b":"Right. She has breasts. Ducks don't have breasts.","commenter_a":"Talks like a duck... looks like a duck... acts like a duck... must be a fucking duck","post_message":"Police Forcibly Remove Woman From Ladies Restroom Because She \"Looked Like a Man\" - is this what #MakeAmericaGreatAgain looks like?"},{"comment_id":"896920230364507","commenter_b":"Never mix hillerie with religion, she's a sinner !","commenter_a":"Love has no bias, gender, race or labels. First Corinthians chapter 13.","post_message":"\"I was thrilled when you recently urged the Supreme Court to rule in favor of marriage equality. I was like 'That’s our gal.'\"—Mike Yowell, having coffee with Hillary in Council Bluffs, Iowa"},{"comment_id":"912964402129948","commenter_b":"Great ideas .. And it would eliminate early voting '","commenter_a":"It's incredible how many people are so patriotic on the 4th of July yet not so much on Election Day!","post_message":"This would be a huge step forward towards restoring the integrity of our democracy."},{"comment_id":"513241782197365","commenter_b":"Drop dead bitch","commenter_a":"Hillary just wants to be HBIC (Head Bitch in Charge)... and she will do anything to achieve her goal... including murder!","post_message":"I don't think we can take a risk on a ________ like Hillary Clinton."},{"comment_id":"1765230837092544","commenter_b":"Wow. So many posts are against Hillary. How can she be leading in the polls? Media bias and manipulation, perhaps? Watch for a stolen election.","commenter_a":"He is not hiding anything and the bigger concern for Americans is how much Hillary lies.","post_message":"Does Donald Trump actually pay his fair share in taxes? Is he worth less than he says he is? Does he have unsavory connections to Russian oligarchs? Until he releases his tax returns, voters won't know for sure."},{"comment_id":"1012223128870741","commenter_b":"Finally, someone says something. Geez, spot on Sean Penn 😊","commenter_a":"All trash talk by liberal wimps","post_message":"He's right. America must never forget who is truly responsible for creating ISIS. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"940985469275259","commenter_b":"She was a Man Baby!","commenter_a":"What do they do with pictures of Golda Meir, who was prime minister of their own country?","post_message":"Someone should remind this \"news\"paper that we're in the year 2015."}]
