[{"comment_id":"10153255897157894","commenter_b":"She has a problem period","commenter_a":"Somebody has a problem with authority","post_message":"Azealia Banks Under Investigation for Allegedly Beating Up a Security Guard [Video]"},{"comment_id":"10152776711902014","commenter_b":"Swatting twitch users I bet!","commenter_a":"#rekt","post_message":"A 17-year-old teen from Surprise has been arrested for several \"swatting\" incidentsin which she reported fake shootings and bomb threats."},{"comment_id":"10154787098266438","commenter_b":"@username exactly, many of the \"1%ers\" are pro choice liberals, they can fund it.","commenter_a":"Just goes to prove, don't make women angry. We don't get even, we get revenge. Elected officials had no idea what they did. This is just a start. With Elizabeth Warren, Bernie Sanders, Schumer, and many others we will take our rights back. Ryan and Trump need to be scared, very scared.","post_message":"Huge crowds everywhere from D.C. to New York to Chicago to LA to Memphis to Nashville to Raleigh to Denver to Idaho ..."},{"comment_id":"417605495104769","commenter_b":"Ummm hmmm. Now ask YOUR grand parents and the rest of YOUR family. Bitch PLEASE lol","commenter_a":"FUCK ALL Y'ALL WHITE AND FAT UGLY MATHERFUCKER! OBAMA OBAMA OBAMA OBAMA OBAMA OBAMA","post_message":"Malia Obama Just Challenged Tiffany Trump, Learns Quick Lesson The Hard Way. You don't mess with the Trump family. Can we get 30,000 'LIKES' for Tiffany Trump?"},{"comment_id":"10153829014724091","commenter_b":"Does the witch have pizza","commenter_a":"Sounds like trump","post_message":"We're under a Tornado Watch -- checking in with Lee Goldberg on what we can expect."},{"comment_id":"499136410296158","commenter_b":"Go back to Mexico you trash","commenter_a":"Very disrespectful! I can say I'm embarrassed, what type of protest is this? I don't agree with Trump but I certainly don't agree with this. That guy in the white shirt with the Mexican flag under his hat is ridiculous. Obviously he does not know how to respond correctly and only starts welling stupid stuff. The only history they are making is to upset people to react upon their actions.","post_message":"Watch This Insane Reckless Trump Protester Nearly Kill People"},{"comment_id":"981590648554229","commenter_b":"Let me know if you need any help doing actual research, as opposed to just spouting off your uninformed opinion, Skatie.","commenter_a":"Of course, Mother Teresa was NOT talking about abortion when she said that, she was talking about child poverty.","post_message":"Mother Teresa gets it right! What do you think?"}]
