[{"comment_id":"10152922353911051","commenter_b":"Someone should dangle her nasty evil ass with their hands around her fu****g neck!!!! evil bitch","commenter_a":"I'm sure the mom had a tight grip on the child when she did that. In saying that I'm hoping the kid was being punished for doing something really fucking stupid for her to take it that far","post_message":"Neighbors couldn't believe that a mother would do something like this to her young son."},{"comment_id":"1600976746609844","commenter_b":"wow.Its a cartoon.It was cute.Do you take every comic strip so seriously? It wasnt make a bold political statement it was just a cute funny comic.Let people enjoy things..Not everything is sexist.This is what gives feminism a bad name.Some of you take things so literally and so seriously.Lighten up.","commenter_a":"Oh no... people, this was meant to be cute and funny, and even a little disturbing. Don't make it a sexist thing, please? Let it be what it is.","post_message":"5. Don't sweat it. The world is our runway every day."},{"comment_id":"10153281917270090","commenter_b":"And what does that have to do with what his stand on immigration has cost all tax payers!","commenter_a":"Illegal immigrants!","post_message":"All of the above! Choose Obama's #1 failure as president: @webpagelink"},{"comment_id":"1225422174190243","commenter_b":"Now you can tell her that our President likes to grab pussy's! You must be so proud.","commenter_a":"Well I personally am glad I dont have to wake up to another 8 years of Democrats!!!! Its a 2 way street. I felt the same way...Glad I didnt have to tell my daughter Hillary is our president. Time to get this country back and finally build a future for my daughter and family","post_message":"The CNN commentator appeared to choke back tears as he voiced concerns felt by many in a divided election."},{"comment_id":"396121180569763","commenter_b":"Yes she definitely deserves to lose her license bigoted bitch","commenter_a":"Not only doctor in the world......find a new one...wouldn't want that dr touching my kid.","post_message":"Does the Hippocratic Oath allow for doctors to make this kind of choice?"},{"comment_id":"10154622879034024","commenter_b":"I think she should sue the college to go back and redo the 4 years and maybe learn something.","commenter_a":"There's no way she could be that dumb and have finished high school.I think we need to have a new law enacted Where our leading officials must have t least a IQ of 117 or above.But Them that would knock out 85-90% of them .","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1058387144217814","commenter_b":"Best part, Karen, they probably don't even make minimum wage, if they're paid at all! Little Hitler Youth!","commenter_a":"Wowzer... I see the RNC interns are working through the weekend, copying and pasting their GOP talking points. Working hard to keep women, minorities, the poor, our LGBT brothers & sisters and immigrants under their jackboots 24/7. Shameful.","post_message":"It’s 2016. The days of dismissing the pay gap as a \"women's issue\" are over."}]
