[{"comment_id":"953216211400448","commenter_b":"Ron, don't forget about the white folks whom have EBT cards and are on welfare.","commenter_a":"So why are we not receiving reparations like the Jews Obama.U jst gave them 12 million for something that didn't happen here!","post_message":"President Obama defends the Black Lives Matter movement, saying the concerns of the activists who have marched & protested for change are legitimate. Obama reiterates that while all lives do matter, black communities are under a specific & unique scourge that needs to be addressed. He also goes on to say that using the phrase “Black Lives Matter\" does not mean that other lives do not. DETAILS ----> @webpagelink"},{"comment_id":"737091973148047","commenter_b":"Imigrants that come here with four wives and ten kids need to be kicked off welfare they cost tax payers a 100.000 dollars a year per family","commenter_a":"Cut her off.","post_message":"Debbie Merton lives off of government tax money. But it’s what she’s doing NOW that will make you want to punch a wall. Should this woman be cut off from the government?"},{"comment_id":"10153434470306323","commenter_b":"Vahan alko tanssijalkaa vipattaa :D","commenter_a":"Nora ootkos tanssinut taas?","post_message":"Five passengers were injured after a train derailed at Mumbai's Churchgate station on Sunday. CCTV shows the local passenger train crashing into the barriers and partly mounting the platform. Officials have blamed human error for the incident."},{"comment_id":"10153129778526336","commenter_b":"Women can't do it. Its physically impossible unless the standards are lowered (this has been repeatedly proven in Marine infantry officer course) and lower standards WILL KILL PEOPLE IN COMBAT. People that want women in ground combat either have not the slightest idea what it is OR had a far different experience than most infantrymen of my generation had. There are no bathrooms in the field. There are no showers for weeks or months sometimes. But maybe its easier now. But I doubt SF or Seals are.","commenter_a":"Everybody should be held to the same physical standards to do the job. Man or woman. That's equality.","post_message":"Controversial new surveys about women serving in the special forces found that men in special ops fear women aren't up to the task."},{"comment_id":"10153983597909726","commenter_b":"ugliest face on the planet,put the bitch in shackles","commenter_a":"It puts them under oath and on the record and if any take the 5th it'll hurt Hillary even more, especially with Independents and Undecideds.","post_message":"Hillary Clinton's aides will be questioned on emails by the U.S. State Department. Will this make any difference?"},{"comment_id":"10153990601334726","commenter_b":"Joel Gillespie One thing to have hired them (via a contractor) totally another to hand them citizenship. Maybe if Rubio and his fellow politicians would secure the border enforce immigration laws there would not be illegals for hire.","commenter_a":"hilarious that Rubio is the one that said Trump misspelled Choked and he didn't... Rubio was wrong","post_message":"WATCH: Rubio Mocks Trump, Reads Misspelled Mean Tweets, 'Friends Don't Let Friends Vote For Con Artists'"},{"comment_id":"835204176588028","commenter_b":"Girl really baby get check","commenter_a":"Its that flu you cant shake.","post_message":"Oh my"}]
