[{"comment_id":"10155243885678984","commenter_b":"@username excuse me ??? It's the fake news that is treating the president with utter disregard for his office ... they are bought & paid for that's why they say what the liberals are spouting ... makes one SICK !","commenter_a":"Oh boo freakin hoo! Shut the f#&@up all you newsies! You treat the President of the United States like a lowlife scumbag and expect him to kiss your collective asses to make nice! This is Donald Trump and you dummies just don't get it! Be fair and honest and quit making up crap and he will reciprocate! Wake up and smell the coffee!","post_message":"Fox News' Brett Baier just left many viewers speechless. This is going to get Donald Trump's attention..."},{"comment_id":"571634943014885","commenter_b":"Ya 10 ft wall and make mexico pay for it that wall will never be build","commenter_a":"@username to fucking childish.","post_message":"After vowing to take the high road during his presidential campaign, Marco Rubio changes his stance on making personal attacks against Donald J. Trump. ►Watch last night's full episode: @webpagelink"},{"comment_id":"10155104954104411","commenter_b":"Smoking is very bad but rapefugees are not. Damn wtf happened to Sweden..","commenter_a":"what about the vehicle emissions?","post_message":""},{"comment_id":"10154716616787908","commenter_b":"It looks like GE is moving part of it's head quarters to Boston, since Boston will give them a $25 million dollar tax break! It's all about the deal! I'm told that what they're giving back is just a drop in the bucket compared to what they'll get. We're so lucky!","commenter_a":"Yes BERNIE Yeeeeees","post_message":"I didn’t hear the head of GE and all these CEOs who ship jobs to China asking the Chinese for a bailout check in 2008. Instead, after laying off American workers they came begging the American taxpayers for a bailout."},{"comment_id":"10155892133225231","commenter_b":"Nancy you have the right attitude. The train operators succumbed to some questionabally motivated sour pusses and got a snootful of bad publicity. So dumb. Ladies of that age/demographic have disposable income.","commenter_a":"Laughing and talking too loud? Those are the ladies I want to ride with!","post_message":"They had no idea that laughing and talking \"too loud\" would get them escorted off the train."},{"comment_id":"10155880374735354","commenter_b":"It sickens me to know that we let Muslim terrorist cowards like that stay in this country under the protection of religious freedom while we tell the Marines and the rest of the armed forces that we don't trust them enough to have a weapon around a civilian population. Ship those goat fuckers out and give our boys some firepower.","commenter_a":"I will always honor them and all that do sooo much to feel us free God Bless","post_message":"Know Their Names, Honor Their Lives. Semper Fi."},{"comment_id":"10156121986485354","commenter_b":"I hope Hillary win cause we need dem stamps","commenter_a":"Since Pelosi has NO integrity then she would not know it and therefore in her little finite mind think Hillary has it, when she doesn't. As a side note, does anyone beside me get physically nauseous and ill when seeing photos of pelosi and hillary???","post_message":"Well this should make everyone feel much better."}]
