[{"comment_id":"10152888128321051","commenter_b":"Black white green. Wtf ever. Cant affort birth control. Then you can't afford kids.","commenter_a":"White women have babies too...not just black women.No-one should have children that they can't take care of,no matter what color you are!!---- i see that there are so many opinions about this post. I wasn't making this a race issue just stating my opinion.This country we call America is full of hate.We all can see this by all the name calling. It's a strange thing that some of you say it's not about race.anytime someone make a comment that doesn't support your views you call them a racist. I am not a racist i just can't stand people who continue to put my people down. I had to add these comments after i read the comments of so much hate. God made us all. The color of all our skin God made. So take your complaints to Him. It really makes me so sad that some people can treat others ...","post_message":"This state is about to ban low income single mothers from having any more children for 5 years."},{"comment_id":"10153725968361717","commenter_b":"Stupid women....","commenter_a":"IF THEY ARE REFUSING TO DO THEIR JOB ( I do NOT care how fucking religious you are) IF YOU ARE NOT DOING YOUR DAMN JOB YOU WERE ELECTED, HIRED, OR NOMINATED FOR YOU WILL BE FORCIBLY REMOVED FROM OFFICE! GOT IT ASSHOLES? Or didn't your religion TEACH you that ASSHOLE!","post_message":"Like Kim Davis, the Wyoming judge has cited religious beliefs in her refusal to marry same-sex couples."},{"comment_id":"464432047077736","commenter_b":"Bye, Felicia....go to that other planet where NOTHING will be different. ...the More of you we get rid of here, the sooner We can straighten the SHIT YOU CAUSED out","commenter_a":"Secondhand rocket for hire. Use at own risk.","post_message":"Elon Musk called the rocket landing \"absolutely perfect.\""},{"comment_id":"10154262733576615","commenter_b":"The men don't have to be gay .. the killer doesn't have to be gay.. if there even is a killer, it could be male or female.. (although the odds are low of that ) .. I'm just saying it's funny how I feel it would be different if this many bodies were found and they were female. I don't like how ppl instantly assume this many men just walked into the river accidently drunk.. especially when their have been bodies found in garbage cans and other areas as well. It may be a big city but a serial killer theory is plausible and cannot be excluded when this many individuals seemingly \"walked into the river\" accidentally. The men are young mostly college aged looking ... if someone is targeting them it could be for a variety of reasons. The only thing they seem to have in common is they ...","commenter_a":"I can't be the only person that's starting to get the impression there may be a serial killer in Pittsburgh","post_message":"JUST IN: Skeletal remains found earlier this week in a trash can have been identified as Dominick Brown, a Penn Hills man who went missing in 2012, his family tells Channel 11 News."},{"comment_id":"10153112075801051","commenter_b":"I love this chick!!","commenter_a":"Really? You guys are jerks. Don't like her or this post, keep scrolling.","post_message":"This mom was complimented on her \"perfect\" body recently. She appreciated it, but she also felt the need to show everyone the difference between what's real and what's in magazines."},{"comment_id":"10153228124522235","commenter_b":"You scaring kitty. You BAD man.","commenter_a":"Scum!","post_message":"Convicted felon, Tom Delay, crawled out from under his rock to share his very important opinion about rights and liberties."},{"comment_id":"1099416270154624","commenter_b":"Raged old skank","commenter_a":"Does she really? Or is she lying again...?? Hmm. Lol","post_message":"\"I think that’s fabulous!\" - Hillary Clinton"}]
