[{"comment_id":"10153430683108812","commenter_b":"@username Bryant Carchi","commenter_a":"Clarette Gaviola COLOMBIA!!! :)","post_message":"WATCH: Dramatic moments as members of Colombia's national police run along the rushing Liboriana River near Salgar after this dog fell in the river: @webpagelink A landslide May 18 devastated the area, killing at least 83 people -- (click video for audio)"},{"comment_id":"1621412104829954","commenter_b":"She needs to go and climb under a rock","commenter_a":"This woman is disgusting.....","post_message":"Lady Gaga just stunned her fans when she wore this out in public..."},{"comment_id":"1549806335319114","commenter_b":"She is why we don't need women leading our country.","commenter_a":"She is nuts!","post_message":"An RNC delegate just announced the great lengths she’d go to make sure Trump doesn’t win, it's not going to sit well with many people..."},{"comment_id":"10152796011681130","commenter_b":"That's right. You. Cant Your not a football fan. Just some bitch with a uneducated opinion. Sad...","commenter_a":"So they should be disqualfied and the Colts should get in.","post_message":"So it wasn't just some weird conspiracy theory."},{"comment_id":"10153322688803132","commenter_b":"I hope she drops dead now in the pits of hell for what she did to this poor girl!","commenter_a":"How stupid can people get ???","post_message":"\"She's going to run till I tell her to stop. She's gonna learn ... I don't play with her.\""},{"comment_id":"10153566353686323","commenter_b":"Paul, I live in Heidelberg Germany. The Americans have left, and the army barracks have been filled with refugees. The plan was for 1200, but we have 1900. This summer, I drove to the UK. The British press reported trouble and riots in Calais and Dover - we sailed through, in both directions. Germany has taken 8x the number of refugees than Britain. And, incidently, I find that if I post here, I often receive an extremely rude and aggressive reply from someone in the UK. I find the British to be quite aggressive, probably frustration with the pro military, right wing, Banker Government, for whom they voted. (Preparing for a tirade of abuse here :) )","commenter_a":"Considering that the surge in recent immigration to EU is mainly due to military and political actions initiated and undeertaken by UK, US and France the hospitality displayed by Germany is more than commandable ... And the British attempts to refuse responsobility for the Lybian and middle eastern mess is plain shameful ...","post_message":"In July, Germany received 37,531 asylum applications, that is 5,586 more applications than the UK had in the whole of 2014."},{"comment_id":"10153407342318352","commenter_b":"I meant, Beast-like BITCH.","commenter_a":"Nothing these beasts say even shocks me anymore.","post_message":"'I just don't like the black kids': Middle school vice principal is suspended after being filmed making outrageous comment on camera"}]
