[{"comment_id":"981141605287036","commenter_b":"She belongs in a freak show. Why do people do that to their self.","commenter_a":"How disgusting I wouldn't hire you","post_message":"Americas Freedom Fighters"},{"comment_id":"1081696675193718","commenter_b":"Y.e.s. lol","commenter_a":"@username is this the lovely place you worked?","post_message":"Thanks to #KPRC2 viewer Harold K. for this video of a manhole cover flooding outside the Houston Museum of Natural Science. Live coverage --> @webpagelink Radar --> @webpagelink Photos --> @webpagelink"},{"comment_id":"10156112421560293","commenter_b":"LIFE is what they should get. turn their a**holes inside out by the sisters...","commenter_a":"These people should be charged with sexual slavery of a minor. They should have a very long prison sentence.","post_message":"Phone calls about possible human trafficking and a missing teenager led Tuscumbia police to arrest these three suspects:"},{"comment_id":"10154124888373812","commenter_b":"The jobs that illegal immigrents work in this country are jobs that, #1 citizens of this country are unwilling to work and #2 jobs that employers are not willing to pay a fair wage for. That's where this country needs to start. We can build a wall that anyone who wants to cross will and does.","commenter_a":"13 million might get you just under a mile of fence.....and I'm not talking chain link. Trump would be first in line to throw in his overpriced bid.","post_message":"President Bill Clinton tells Donald J. Trump supporter “If you want to build a wall along the Rio Grande and spend $13 million, then you should follow him like Moses into the Promised Land.”"},{"comment_id":"10153370823461336","commenter_b":"Well Ryan it is better than putting Jenner on the bill","commenter_a":"Megyn Kelly","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"595288380595755","commenter_b":"We just had 2 bombings and a knifing involving these peaceful refugees after NOW RECEIVING OVER 10,000 of them and this idiot is still trying to sell them coming into our country! Well Obama you won't be in office next year and Trump is our mouth piece \" no vetting no refugees \" WE DONT WANT ANYMORE OF THIS CULTURE , ask Merkle in Germany about them, she said if she could go back and change her decision she would not have taken these Muslims in!!!!!!!!!","commenter_a":"He's wrong.........we have citizens right here that need our help first and foremost.","post_message":"President Obama says turning away refugees based on background or religion \"would be reinforcing terrorist propaganda.\" Agree or disagree?"},{"comment_id":"924082021021384","commenter_b":"and hate smart women.","commenter_a":"What happened with the great Sara Palin she not running lol","post_message":"They might need a bigger stage..."}]
