[{"comment_id":"10155334834981509","commenter_b":"Police ddnt kill here the one who shoot her is her boss to shut her up.. Druglords her in phillipines are afraid now they kill all there people who knows evrything to there bussnes. Cnn researcher maybe now is grade 7 only ahahah","commenter_a":"WTF is going over there? Why isn't this President condemning these murders if he is not then he is in part at blame!","post_message":"The daughter of a runaway British lord has become one of the highest profile victims of the Philippines' war on drugs."},{"comment_id":"10155444687161490","commenter_b":"*how dare she!!!!!","commenter_a":"@username, This ^^","post_message":"Ivanka Trump tweets about the \"importance of women having a seat at the table. @webpagelink"},{"comment_id":"10156406946480354","commenter_b":"She'll be a thief til her last breath!!!!!!!!!!!!!!!","commenter_a":"Hillary Clinton is a corrupt, old, nasty glory seeker.","post_message":"\"Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" Hillary Clinton is a _________________."},{"comment_id":"10157243305955354","commenter_b":"Then get to work.","commenter_a":"She could move out of her government subsidized housing if she actually had any employable skills.","post_message":""},{"comment_id":"10153327649961943","commenter_b":"She should be in Prison As well as ALL the rest of that bunch!","commenter_a":"$170,000 is a really hefty pension for the shaft of Obammy's challengers by the crooks in he IRS . AND her boss is still there covering up the evidence !!!","post_message":"This material shows that the IRS cover-up began years ago. We now have smoking-gun proof that top officials in the Obama IRS unlawfully harassed taxpayers just to keep them from complaining to Congress about IRS targeting and abuse. Please SHARE!"},{"comment_id":"1493294134044387","commenter_b":"She is pure evil & should be put to death.","commenter_a":"Hillary is done the writings on the wall god look at the rallies know it's there for her no signs no bumper stickers no T-shirts and say Hillary for prison. She's a criminal and should prosecuted","post_message":"Wow!"},{"comment_id":"704293576413843","commenter_b":"Can't wait to be done with the racist goat humper","commenter_a":"Yay for Trump!!! Bye bye Obama!","post_message":"LIVE VOTE: With Trump taking office, are you grieving or cheering? Let us know why in the comments and see what others think. Join us for continuing coverage as President-elect Donald Trump prepares to take office, straight ahead on The Four!"}]
