[{"comment_id":"517132878459126","commenter_b":"Right under this post is an article that says blue nation review gives Hillary Clinton her own media wing.","commenter_a":"But the Word of God is in our heart, never to be taken away, Glory to God","post_message":"The numbers are undeniable."},{"comment_id":"10153075860699614","commenter_b":"A women should know her body lets slit her throat!!","commenter_a":"@username I understand what you're saying I've been through it also 3 times but when you see your babies all thoughts of dying and killing go away post part um depression it's just an excuse","post_message":"A young mother in Olympia, Washington, allegedly told police that she slashed the throats of her 6-month-old twins and 2-year-old daughter to keep them quiet for her husband. Christina Booth, who is believed to be suffering from postpartum depression, made a 911 call Saturday sobbing and screaming at the operator that her children would not stop crying. When police arrived they found the twins on the couch crying \"uncontrollably\" and \"bleeding from their necks.\" The 2-year-old was upstairs with a similar wound. All three survived their injuries. Booth allegedly told police \"she knew if she killed all the kids the house would be quiet\" for her husband \"who gets annoyed when the children cry.\" Read KTLA's story here: @webpagelink"},{"comment_id":"503378786489136","commenter_b":"She is nothing but a bigot. Keep her locked up until she complies","commenter_a":"Do the right thing. Spread hate in the name of Jesus and shield your bigory with the bible. Claim you are a christian to defend your sorrid past to justify issuing your twisted moral judgment on others. Yes than you will be a twisted evangelical christian spreading the hate of your chosen religion.","post_message":"Who is the clerk in the middle of the same-sex marriage debate?"},{"comment_id":"522124781280810","commenter_b":"And a thug!!!","commenter_a":"He's a terrorist.","post_message":"Police say they \"don't have any information on this individual's mentality, or his ideas or ideology.\""},{"comment_id":"10154584993799497","commenter_b":"Thanks pussy","commenter_a":"U fuckin cucks","post_message":"Here what you need to know about the alt-right:"},{"comment_id":"1025902810798360","commenter_b":"@username you are crooked and You are a loser. You are a complete disgrace. You will not make America great again. You have no idea what you are doing. You are a complete idiot. Do us all a favor and drop out. Stop spreading hate. The only reason your rich is because you got money from your father. you are going to make America a laughing stock. please reply to this message. Be a man and reply to my message. Debate me. don't be a chicken.","commenter_a":"@username you are crooked and You are a loser. You are a complete disgrace. You will not make America great again. You have no idea what you are doing. You are a complete idiot. Do us all a favor and drop out. Stop spreading hate. The only reason your rich is because you got money from your father. you are going to make America a laughing stock. please reply to this message. Be a man and reply to my message. Debate me. don't be a chicken.","post_message":"Thank you for the incredible amount of support last night- San Jose, California. I love you all - we will deal with the thugs & criminals -- we will build the wall --- and Mexico will pay for it!"},{"comment_id":"10153722838823984","commenter_b":"Pussy breath","commenter_a":"Through the key away","post_message":"A federal judge has ordered Kim Davis to remain in a jail cell until she agrees to issue marriage licenses to same-sex couples. The state is holding a metaphorical gun to her head, yet all she has done is stand firm in her conviction that marriage is between one man and one woman. Stand with us and sign the petition for Kim Davis to be released from jail immediately!"}]
