[{"comment_id":"1189126694470722","commenter_b":"With all the beutiful woman in NYC you get a mop","commenter_a":"She only cares about money she will never have true love' She must work for the IRS or the Goverment","post_message":"When it comes to love, Martina Paillant won’t settle for someone who has a credit score below 700."},{"comment_id":"10154145520606770","commenter_b":"Never, they're pigs. Tell them to oink off.","commenter_a":"When did they stop calling women like Kim who have no decency or moral compass pigs?","post_message":"The outfits that Kim Kardashian and Kendall Jenner wore were absolutely stunning."},{"comment_id":"675151445982815","commenter_b":"illegals are going back..THE WALL","commenter_a":"But according to trump and his supporters he must be either a thief or a rapist. To the people that dislike Hillary for whatever reason: \"vote for her and hold your nose\", that orange Nazi is at the door, and we can't let him in.","post_message":"14-year-old mariachi singer opens night 3 of the DNC with a rendition of The Star-Spangled Banner. Sebastien de la Cruz was 11 when he sang it at the NBA Finals, a performance that sparked a wave of racist comments on social media. @webpagelink"},{"comment_id":"607404219443285","commenter_b":"He's an idiot","commenter_a":"Then why in the hell did he get elected...twice?","post_message":"Delusional..."},{"comment_id":"10154455424349445","commenter_b":"Tons of them in cod","commenter_a":"I used to see them and had to pick them out of sole filets when I worked at a major New England grocery store fish market years ago.","post_message":"This video will make you squirm.... but the retailer says its actually a natural phenomenon. @webpagelink"},{"comment_id":"10152721939436051","commenter_b":"Your a cunt ya bitch","commenter_a":"Dumb bitch she would of been mad if the made her fat ass look fater","post_message":"This girl couldn’t believe what her school did to her yearbook photo."},{"comment_id":"10152756009211051","commenter_b":"Could be..Better than that leaching piece of whale dung..","commenter_a":"You Brits can have her...","post_message":"People in Saudi Arabia are livid with Michelle Obama for one very specific reason."}]
