[{"comment_id":"10152984814394641","commenter_b":"Ban Islam!","commenter_a":"if you Arrest Jihadist, you are hurting religious sentiments of Muslims. Beware!","post_message":"Five men arrested in France, accused of belonging to jihadist cell that was recruiting young people, authorities say."},{"comment_id":"853540474702649","commenter_b":"By the way I don't agree with this either. But just think if people do not hire illegals they couldn't survive here. That is the root problem maybe we should start there.","commenter_a":"States did this not Obama. Do you blame him for everything? If the Cardinals don't win the World Series I'm asking congress to impeached him because it would have to be his fault","post_message":"10 states now offer driver's licenses to illegal aliens. Don't you think this is WRONG?"},{"comment_id":"10152477981607434","commenter_b":"I agree. If she lived in Miami in a luxury condo, she'd probably pay more.","commenter_a":"But- that's not a lot of money when you consider she has no mortgage, no car, no food bills- I mean- I don't want it but....","post_message":"The cost of living like a goddamn queen is high."},{"comment_id":"1347077192027276","commenter_b":"LuAnn...I guess you are ready to pick some fruits and veggies for 2 bucks an hour in any kind of weather mind you! Oh and then remember anything coming in from Mexico like tequila and avocados will cost you 20 cents more for every dollar the item costs! Hmmmmm! So, we are paying for the wall!","commenter_a":"Round 'em up ... head 'em out... back across the border... if they are here illegally they have already broken the law they do not need to be here number one . it's the rule of law .. number two .. it's common sense for the survival of the Republic ... BUILD THE WALL ... and whatever else it takes to keep them out .. they want to come in they can get in line and do the process ...","post_message":"Speaking at the CPAC today, President Trump says he intends to keep his campaign promises:"},{"comment_id":"10152619988623525","commenter_b":"With lots of glitter...","commenter_a":"So, what will the bathroom towels have on them??????","post_message":"UPDATE: Hillsborough County Clerk Pat Frank says the office is ready to issue same-sex marriage licenses Tuesday morning, and she has reserved the park across from the office for potential crowds. \"I was hoping Judge Hinkle would revisit it and he's made it extremely clear now that it applies to every clerk in the state, that the ban against gay marriage is void...it never existed.\" MORE: @webpagelink"},{"comment_id":"1381800741835583","commenter_b":"Smart woman makes Hillary look like ??? 😝","commenter_a":"Obama couldn't stand her, or for that matter, none of the democrats.","post_message":"Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe.Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe."},{"comment_id":"10153727755939117","commenter_b":"@username If Trump were a cat, he would be licking his own balls.","commenter_a":"And the Republican leaders of the past, McCain, Romney, and the entire Bush family? They recognize a fraud when they see one and won't even bother attending, endorsing or having anything to do with a bully liberal like Trump.","post_message":"The list of GOP convention speakers includes a bunch of people better known for harshly criticizing Donald J. Trump, in some cases unambiguously pronouncing him unfit for the presidency. They say he's a \"con artist,\" \"narcissist,\" \"bully,\" and \"pathological liar\" whose candidacy is \"a cancer on conservatism.\""}]
