[{"comment_id":"784349154999752","commenter_b":"Bitch","commenter_a":"Another racist liberal what does she have against Orange people. Ray","post_message":"Oh, Meryl...."},{"comment_id":"952261771573668","commenter_b":"You don't have to like Trump to have your PUSSY groped!","commenter_a":"I'm telling ya people, you dont have to like Trump personally but you all have to get out there to vote for him to stop this stuff. Its unreal. Its almost like we are living in 1960's Soviet Union.","post_message":"This makes me sick..."},{"comment_id":"1171441452907864","commenter_b":"@username really Dems are racist?name a dem that wants to deport all Mexicans then get back to me..","commenter_a":"Good thing no one cares what Little Marco has to say. I'm sure Trump has no need for losers as VP either!","post_message":"In a statement on Facebook, Marco Rubio said he has no interest in being Donald J. Trump’s running mate and put VP rumors to rest."},{"comment_id":"10153127976631162","commenter_b":"You sound ignorant you stupid old lady","commenter_a":"A 3, 2, year old and she is 8 months pg. give her birth control.","post_message":"TODDLER SHOOTS PARENTS: A 3-year-old boy shot his dad and his 8-months-pregnant mom when he found a loaded handgun in her purse while looking for an iPod. READ MORE: @webpagelink"},{"comment_id":"10153899395243701","commenter_b":"Please take time to familiarize yourself with actual case law on this subject. Anyone under the influence of drugs or alcohol cannot legally consent to any sexual act. It makes no difference if she got that way voluntarily or involuntarily. YOU CANNONT CONSENT IF YOU ARE IMPAIRED. This is called rape","commenter_a":"I question this case also .... According to the accuser, Cosby urged her to take pills and to drink wine...... Urged her to do so??!!! So she did it to herself! I highly doubt an educated woman would take pills and drink in a room with one man without knowing the out come!! Personal responsibility is what all these people are not understanding! Read more: @webpagelink","post_message":"JUST IN: Bill Cosby has now officially been charged with sexual assault more than a decade after a woman told police the comedian drugged and violated her at his home near Philadelphia."},{"comment_id":"10152828817287426","commenter_b":"Omgosh..I am not a violent person..BUT I would beat the Sh** out of that woman....first of all...I NEVER gave into my kids when they threw fits...that's how they learn to NOT get what they want all the time.....This woman is sick sick sick....part of parenting means to not give in..","commenter_a":"@username U seen this uet","post_message":"“There’s nothing wrong with that child, it just needs to be beat,” the woman, who claims to be Kathleen Smith, said in the video."},{"comment_id":"10153055222394877","commenter_b":"Wrong! I've awakened with someone riding on my dick..The dick can get hard without you even knowing it... while you're asleep. Duh. Ever heard of a wet dream!","commenter_a":"Rape is rape, no matter the gender of the rapist and they all should get equal servere punishment. She deserves more than 9 months tho.","post_message":"Mother of 3 arrested for breaking into a man's apartment and raping him while he slept. Grio fam, if she was a man do you think her sentencing would have been more severe? Sound off below!"}]
