[{"comment_id":"750074615183116","commenter_b":"THIS IS AMERICA & WE BETTER START PAYING ATTENTION BEFORE IT'S TOO LATE! SHARIA LAW BELONGS NOWHERE IN AMERICA.","commenter_a":"Let go hunting America ...Get them out of our country before they hurt our love ones ...","post_message":"Muslims take over THIS U.S. town and immediately begin implementing Sharia law. You cannot force others to follow your religious laws. Do you think this is wrong?"},{"comment_id":"10154674776698010","commenter_b":"I've met a few bitches in my life Derek's mom and @username girl were both on that list.","commenter_a":"Pence basically saying hey I'm a rich white male never get stopped by police why should I care .","post_message":"Gov. Mike Pence spoke about police killings and the need for \"law and order\" at the debate. He ended by asking his opponent, \"Senator, please, enough of this seeking every opportunity to demean law enforcement.\" More debate updates: @webpagelink"},{"comment_id":"998442540272524","commenter_b":"She is bought and paid for and if she's president what happens then?","commenter_a":"She's a crook and lies about where money comes from and buys the illegal immigrants vote","post_message":"By the way, it ILLEGAL for foreign nations to influence the outcome of an election. Just so you know. @webpagelink"},{"comment_id":"10154485360681323","commenter_b":"She won the election. Period.","commenter_a":"I congratulate Brazil for their courage and determination. The Latin-American left likes to keep the people they rule poor, uneducated and frightened. They like to pretend to be the saviors. But the truth is they always leave a country poorer, they become richer, and as in the case of Nicaragua, Cuba, Venezuela, and Bolivia, they do not leave, ever.","post_message":"In keeping with her pledge to fight until the end for the 54 million voters who put her in office, Rousseff – a former Marxist guerrilla – ended her presidency this week with a gritty 14-hour defence of her government’s achievements and a sharply worded attack on the “usurpers” and “coup-mongers” who ejected her from power without an election."},{"comment_id":"10153954425955329","commenter_b":"Hahahaha her get away!","commenter_a":"@username, Jane Archer, @username, @username, can you please pleeeease do this with Poppi, Ricky, Harlou and Max?!?!?! HILARIOUS!","post_message":"brb gonna go test my dog's loyalty"},{"comment_id":"1100594890039116","commenter_b":"Hillary would've crapped herself... oh wait she probably already did...","commenter_a":"Another fake attempt 2 lure in sympathetic voters?","post_message":"Trump’s top aides baselessly pushed the idea that it was an assassination attempt."},{"comment_id":"10154377654466729","commenter_b":"parents need to stay in contact with reality when it comes to their kids. pay attention to what schools is teaching our kids. it is all coming together. womans lib, moms are not home any more to pay attention to what kids bring home. homes have been destroyed.","commenter_a":"Those who can, do.","post_message":"Bingo."}]
