[{"comment_id":"922742544437395","commenter_b":"It's not so much stupid and idiocy as it is vicious.","commenter_a":"Mississippi. Period. Point Blank. (sorry to paint with such a broad brush, but.............)","post_message":"This racist needs to be fired now. Sign the petition to have him removed from office: @webpagelink"},{"comment_id":"1820380214887532","commenter_b":"I will bet you $10.00 to a donut she is a liberal.","commenter_a":"This is insanity, this principle needs to be removed.","post_message":"Angry yet??"},{"comment_id":"805771119613465","commenter_b":"The woman has no class.","commenter_a":"Laura Bush...a REAL FIRST LADY WITH CLASS...not the thing we have now , a disgrace!","post_message":"Laura Bush SLAMS Michelle Obama Right To Her Face In Front Of Everyone. This is awesome. We love her. Can we get 5,000 'LIKES' for Laura Bush?"},{"comment_id":"1562827943734753","commenter_b":"That woman on the right is a moron!!! (Red top).","commenter_a":"Fuck you lieing democrats your nominee is trash n war with Russia will happen if she's elected even Russia's president believes so","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"1157455867648336","commenter_b":"Or get the hell out of our country","commenter_a":"Think again. This is the United States, not some Middle Eastern Country. Assimilate or leave!!!!","post_message":"Muslim Leader : we are practicing Muslims, we are above the law of the land. Like if you think practicing Muslims need to follow our laws just like everyone else. @webpagelink"},{"comment_id":"990898310953409","commenter_b":"\"Driving benzes with no benefits. Not bad huh, for some immigrants. Build your fences, we diggin tunnels. Can't you see we getting money up under you\"","commenter_a":"I don't know why they just don't put up No Trespassing signs and make it agasinst the law to cross the border, after all, it works so well for Gun Free Zones and keeping guns out of the hands of criminals..","post_message":"In response to a Senate inquiry on border security, the Department of Homeland Security recently revealed that 1,300 miles of the U.S.-Mexico border remains unprotected by a fence or some kind of barrier. The government has cobbled together various other types of fencing for border barriers — most of which are ineffective or hamper Border Patrol agents’ ability to spot illegal immigrants — to protect other areas. @webpagelink"},{"comment_id":"10156077468780354","commenter_b":"She'll be worse then Obama","commenter_a":"We can all hope that she is 80% of the way to the Big House!","post_message":"Before a single vote is cast?"}]
