[{"comment_id":"10153182751728145","commenter_b":"Can the a/c compressor fit in my car? My A/C isn't working, I'll take the air over a flag! lol lol","commenter_a":"Give it a rest already","post_message":"Say goodbye to General Lee. Now toy versions of the iconic orange Dodge Charger will end production. Here's why: @webpagelink What do you think about this move? #WFTV"},{"comment_id":"10154103102004170","commenter_b":"hillary is a pig liar","commenter_a":"Despicable HRC is! Oh, so despicable! 👎👎👎👎","post_message":"What kind of First Lady has so little class that she would say something nice about another First Lady, then apologize for saying the nice thing? Oh. Right."},{"comment_id":"1059551124091179","commenter_b":"Surprise, I don't want women in mine either!","commenter_a":"Don't want some guy in bathroom with any girls. Whose to say he really is gay. ! Don't care if he is though don't belong there.","post_message":"Why is this so hard to understand?"},{"comment_id":"10153346238078690","commenter_b":"Still as barbaric as before, that was why it was difficult for Mandela to organized them and fight for free. That is why he has to do it on his own. Animals never changes.","commenter_a":"Free from the ravages of inteligence and absolutely racist !","post_message":"Thousands expected to march in South Africa against attacks on foreigners @webpagelink"},{"comment_id":"1004626696250624","commenter_b":"Boy is she getting old!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"They show this picture to men who have had an erection for more that 4 hours, works every time!","post_message":"Make sure you let our politicians know that we will not support their abortion friendly policies! Click below to sign your petition to end Roe v. Wade today! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH15&pid=fb122"},{"comment_id":"10154744706316729","commenter_b":"It's the violent felons and lunatics the legislation is trying to keep the guns away from by closing the loopholes on gun sales. As long as background checks can be skirted, the criminals and mentally ill can buy them at gun shows (in some states but no one checks at state lines!) and over the Internet (easier than you think!). You, being an upstanding citizen of sound mind, are welcome to keep and buy guns.","commenter_a":"But but Hillary and oboozo with their constant armed guards say we don't need to or have a right to defend ourselves when the violent lunatics they want to let out of prison come busting down our doors.","post_message":""},{"comment_id":"10154090150895329","commenter_b":"OMFG she's such a bitch...","commenter_a":"@username STRUGGLE SO REAL","post_message":"\"I will bleed on everything you love.\""}]
