[{"comment_id":"10153291697646350","commenter_b":"It was beautiful . I have seen the stage play at least 20 times with groups and sung by many, and it is great to hear the different sounds.","commenter_a":"If you ever saw Phantom on stage or saw the movie, you know Josh Groban did it justice. Kelly did not. She about ruined my favorite song for me, from which my wedding vows were taken. Kind of like nails on a chalkboard for me.","post_message":"We could listen to Josh Groban and Kelly Clarkson sing The Phantom of the Opera all day."},{"comment_id":"1206849516074767","commenter_b":"Call Hillary what you want, I don't care about her emails, she is better than that piece of Shit Trump","commenter_a":"Can he get any worst?","post_message":"\"Forget politics; he is a disgusting human being.\" - Thomas Friedman"},{"comment_id":"10152998520246037","commenter_b":"Rules are rules. But the airline's inconsistency in enforcing those rules is the real issue. It was ok to hold the child on the way down, it should have been the same on the way back. BUT I find the attention mongering of this mom downright pathetic. Totally disgusted. Not everyone is a world traveler, and I also get confused by the ever changing rules of the sky. Seems to me the mom holding her daughter was pretty clear that now she knows the airline's policy she will have a safety seat with her in the future. No further big deal made of it, issue was put to rest. Until this attention whore feels compelled to one-up her and try to publicly shame her. Disgracefull, classless and pathetic. If the woman went on and on and on about how she should be allowed to hold her child anyway, Yada yasa ...","commenter_a":"I agree with most of you, if she has a child with special needs then they shouldn't have been seperated in the first place. Secondly if the flight attendant had let that happen and something happened, then who would've been at fault then??","post_message":"\"The attention mongering schemes of Elit Kirschenbaum, who took to Twitter last week lambasting a United Airways flight attendant for refusing to allow her to hold her disabled three year old daughter on her lap during take off, make me want to puke.\""},{"comment_id":"10153845354225579","commenter_b":"I guess Elizabeth you didn't get the memo. Women are excluded from being president as well! You all don't have the fortitude to do what is clearly a mans job!","commenter_a":"Really..Because the shame is on all of the Obama administration. I happen to agree with Dr. Ben Carson..","post_message":"Senator Harry Reid: on Dr. Carson. The Senate minority leader responds to Dr. Ben Carson remarks on Muslims."},{"comment_id":"1544982162188475","commenter_b":"That's why I have your wife come over","commenter_a":"Yeah it changes kids it doesn't make them limp wristed liberals who don't know which gender they are . It makes them tuff , learn how to solve problems with others and gives them confidence!","post_message":"The more head blows a child sustained, the more changes were seen in their brain tissue, according to the study released Monday."},{"comment_id":"948419235220194","commenter_b":"If she wont follow the dress code I wonder what other codes she would break...Be compliant or be gone !!","commenter_a":"How refreshing !! Parts of this country is still the U.S.A.","post_message":"Ohio Police Takes BOLD Stand Against Islam After Offended Muslim Woman Issues Threat @webpagelink"},{"comment_id":"10152861667311045","commenter_b":"I don't agree with abortion, but when you have an abortion the baby dies, it's suffering is over. Women who do drugs while they are pregnant can cause problems for these children their entire lives. And we foot the bill for it. They should be charged, never given their kids back and the law should stop having these double standards. And if they didn't cause their kids damage then they still did the equivalent of putting a gun to its head and playing Russian roulette, which would also be child endangerment and child abuse.","commenter_a":"Does anybody find it ironic that they can be charged for exposing their unborn babies to drugs while it is legal for them to kill/abort those same babies? Either unborn babies are people with rights or they aren't. Odd how \"the law\" can have it both ways.","post_message":"Two Shoals women are charged with exposing their children to drugs. Both women are pregnant, and are in the community corrections program. Investigators say the two failed mandatory drug tests."}]
