[{"comment_id":"1233538923335820","commenter_b":"Well she can shove it in my face.","commenter_a":"Climb back into your closet. We are sick of all of you being shoved in our faces.😈😈😈😈","post_message":"\"I knew going in that I had the opportunity to make history ...\""},{"comment_id":"10155892133225231","commenter_b":"Nancy you have the right attitude. The train operators succumbed to some questionabally motivated sour pusses and got a snootful of bad publicity. So dumb. Ladies of that age/demographic have disposable income.","commenter_a":"Laughing and talking too loud? Those are the ladies I want to ride with!","post_message":"They had no idea that laughing and talking \"too loud\" would get them escorted off the train."},{"comment_id":"10153294493981438","commenter_b":"I hate her as corporate whore and war monger.","commenter_a":"I like her as Nerd and Law Student!","post_message":"Nerds are cool, and that is Hillary’s true self. She should two-strap her way to the White House."},{"comment_id":"10154869505163812","commenter_b":"Yuck","commenter_a":"Bill Clinton is the pig lets talk about what he did to woman .","post_message":"In light of the release of a recording of a vulgar conversation Donald J. Trump had where he brags about groping women, it seems that very little appears to have ever been off limits for the Republican presidential nominee."},{"comment_id":"10156170491245206","commenter_b":"Shut up sexy","commenter_a":"I was pro @username but Carly I cant take you seriously unless you attack someone beside Hillary she is not the only one running who is bad for our country and until I see you attack Trump or Jeb who are you major competitors right now I am not going to take you seriously as a serious candidate.","post_message":"What are my thoughts on Hillary Clinton's speech this morning?"},{"comment_id":"1086698044698949","commenter_b":"THINK ABOUT THIS ,TRUMP SAYS HE'LL ADD A 45% TARIFF ON IMPORTS FROM MEXICO AND CHINA ,STOP MONEY TRANSFERS OUT TO MEXICO TO GET THEM TO PAY FOR A WALL ,WE EXPORT 236 BILLION A YEAR TO MEXICO IF WE ADD A 45% TARIFF TO IMPORTS THEY WILL DO THE SAME ,BOOM! THOUSANDS OF PEOPLE OUT OF WORK !! CHINA IMPORTS 116 BILLION FROM AMERICA INCLUDING ALMOST OUR INTIRE CROP OF SOYBEANS ,WE MESS WITH THEM THEY GO SOMEWHERE ELSE ONCE AGAIN FARMS SHUT DOWN, FARM HANDS OUT OF WORK .WE'RE TALKING 1930'S STYLE DEPRESSION.WHY ?..........DONALD TRUMP WE IMPORT MORE FROM MEXICO THAN WE EXPORT TO THEM TRUE 5 BILLION A YEAR IS DIAMONDS AND PRECIOUS METAL,14BILLION A YEAR IN OIL,AND 11 BILLION A YEAR IN FRUIT,NUTS AND VEGETABLES ,YOU WANT YOUR FOOD AND FUEL COST TO GO UP 45 % IT WON'T BOTHER TRUMP HE'S WORTH 10 BILLION","commenter_a":"Our current administration is a joke. They have been living off of the tax payers for years without one concern for the US Citizens. People, wake up. Take a good long look at your life, are you living better now or five years ago? or even 10 years ago, Is your income the same, are you now needing to work 2 jobs just to make ends meet. People, we are now competing with our teenagers for the jobs we held as teenagers to learn responsibility just to make ends meet. Wake up people, I don't think this is what our parents believed was the American Dream. And we certainly aren't living better than they did. Think long and hard about your future and that of your children and the generations to come, will they have a FUTURE!!!!!!","post_message":"Whoa!! Do you still support Trump?"},{"comment_id":"10154360980241336","commenter_b":"I would rather see the winner of the Miss USA pageant as president than that nasty skank Hillary","commenter_a":"That's because most Miss USA contestants are a whole lot smarter than Hillary.","post_message":"Thoughts?"}]
