[{"comment_id":"1289706671107866","commenter_b":"I say fire her ass and let her get her 20 mil from someone else, she isn't worth it.","commenter_a":"#FoxFireMegynKelly! She is no journalist and has to go, help make that happen by signing this petition and sharing! @webpagelink","post_message":"Fox News' Megyn Kelly just got some bad news... after trashing Newt Gingrich in a Tuesday interview over Donald J. Trump, here's what Rupert Murdoch said about the controversial anchor. What do you think should happen to Megyn Kelly?"},{"comment_id":"10153575430048525","commenter_b":"It is absolutely ludicrous that a law had to be made for that. What she did was animal cruelty.","commenter_a":"It used to be legal but in 2011 they pass the bill in Florida banning sex between humans and animals.","post_message":"Deputies say they arrested her after seeing video. STORY: www.fox13news.com/news/florida-news/@username-story"},{"comment_id":"722235994591000","commenter_b":"For sure! Madam President for Prison 2016 once Trump beats her.","commenter_a":"i can't wait to be able to call you Madam President!!","post_message":"16 days. IWillVote.com"},{"comment_id":"10153626364206600","commenter_b":"I was TAUGHT the same thing you were taught growing up catholic but instead of just taking someone's word for it I decided to go read Gods word for myself and guess what? There are several people in the bible that God forgave for murder. Instead of just taking what your priest says and running with you you shoujd go read the bible and see what GOD sYs about it. It the end it's His opinion that counts.","commenter_a":"Murder is a sin.....abortion is murder. I have no respect for this pope.","post_message":"Pope Francis has made a major change in the way the Catholic Church treats women who have had an abortion."},{"comment_id":"1439319502750684","commenter_b":"Scum","commenter_a":"When will your congress do it's job and imprison that traitorest SOB???","post_message":"A horrified nation learned this week that President Obama handed over $1.7 billion in cash to the terror masters of Iran..."},{"comment_id":"10153123096616770","commenter_b":"They'll leave on their own !","commenter_a":"Send back the illegals!","post_message":"Donald J. Trump wants a “deportation force” to remove the illegal immigrants currently living in the United States."},{"comment_id":"10153225010746833","commenter_b":"These people should be tarred and feathered.","commenter_a":"This is what the liberals want.","post_message":" of New Jersey, warns Gordon VanGilder. The retired schoolteacher is the latest to fall victim to the Garden State gun laws the 72-year-old is facing up to 10 years in prison for having an antique flintlock pistol in his car. In this exclusive report, his attorney notes that VanGilder is facing the same felony charge for his unloaded mid-1700s firearm as he would be for a loaded .44 Magnum. is overreach, for sure, says VanGilder. @webpagelink"}]
