[{"comment_id":"10153665410768352","commenter_b":"Where is that bitch I want to slap that Bitch","commenter_a":"So sad ...so many stories lately of mother's loosing their minds....it would be really nice if dad's would start manning up and helping more.","post_message":"A Hungry 5-Year-Old Dials 911 Pleading For Food After His Mom Abandoned Him And A 10-Month-Old Baby At Home Alone"},{"comment_id":"10154287365081130","commenter_b":"Bitter angry woman hater. I feel sorry for your kids, especially if you have daughters.","commenter_a":"We should let children make their own decision about whether they get to live or not. All Americans have basic civil rights and women do not have the right to take the right to life away from another living human being.","post_message":"\"We should let women make their own decisions.\" 👏"},{"comment_id":"10157375449970354","commenter_b":"Fuck off you little bitch!","commenter_a":"Its ok. Nobody was listening.","post_message":"Isn't that so thoughtful of Leftists who deride religion to lecture Christians on their faith?"},{"comment_id":"651982771617164","commenter_b":"SEND HER BACK TO WHERE EVER SHE CAME FROM ! LET HER WHINE ALL THE WAY HOME !","commenter_a":"Yap she's crazy..go home.","post_message":"Woman Goes On National TV And Blames Americans For Banning Sharia Law And Executing Kids In... This must be some kind of sick joke. Do you think she has completely lost her mind?"},{"comment_id":"10155514073390354","commenter_b":"Oh darn...NOT!!! Good riddance!! Hopes they ALL go up in flames. Enjoy those virgins, buttholes!!!","commenter_a":"Another dead terrorist, WOO HOO!!! KILL THEM ALL, LET GOD SORT THEM OUT!","post_message":"Height: 5'11\" Chest: 40\" Waist: 32 Currently Not Available for Bookings"},{"comment_id":"10155024202814703","commenter_b":"America has American terrorist's as well. Why no effort on banning them, or shipping them out of our Country???","commenter_a":"Bet you never thought you would see planes crash intentionally into buildings either","post_message":"Thoughts?"},{"comment_id":"10156924134420725","commenter_b":"@username The Wall Is Coming and Mexico Will Pay. No More Hand Outs To Mexico It's Time Mexico Starts Taking Care Of Their Own!!! Donald J Trump President of the United States of America and American People 2016!!!","commenter_a":"Don't Forget: DONALD TRUMP WANTS TO BANG HIS DAUGHTER.","post_message":""}]
