[{"comment_id":"1213019208717830","commenter_b":"@username So...a ticket paid for means she can do whatever she wants and not follow rules and regulations. I'm pretty sure it is clearly stated in the paperwork you sign before sailing that you will be left behind if you are not back on the ship on time.","commenter_a":"Horrible. They waited a whole 30 minutes how about waiting til she's back. What if she had been kid napped or in a hospital. No compassion what so ever, makes me sick. If she can see that ship depart they are at fault.","post_message":"A woman looked on with horror as the cruise ship on which she was vacationing left a port in Bahamas, leaving her on the island while her children were on the ship."},{"comment_id":"1123021131087914","commenter_b":"the bulshit they talk is baloney. the true Americans are the native people the rest are immigrants.","commenter_a":"eah did you ount the dead, I mean the millions massacred by your ancestors the funding fathers the true Americans the only ones with the right to talk about how bad is immigration. Your talk is baloney.","post_message":"A Pew study found immigration will account for 88% of U.S. population growth over the next 50 years."},{"comment_id":"547324122108733","commenter_b":"Hearing her, and the rest of these contemporary crashing bores, causes me macroaggressions","commenter_a":"This nation no longer understands the cause of anything. We have managed to create a group of retards who are only concerned with their own personal agenda, while at the same time, they have abandoned common sense and common decency...","post_message":"\"One day, these privileged snowflakes armed with their microaggressions will be in charge of HR departments all across the fruited plain,\" says Todd Starnes."},{"comment_id":"1777986365799226","commenter_b":"She is above the law,she doesn't, cheat or steal!","commenter_a":"As a woman I don't want the first female president representing me as someone who is a corrupted, lying, manipulator and fraud who thinks she is above the law. #Hillaryforprison.","post_message":"Hillary Clinton holds campaign rally in Cedar Rapids, Iowa after FBI announces they are reviewing email investigation. abcn.ws/2fnHba3"},{"comment_id":"10153627054797217","commenter_b":"They were one of the best armys when Saddam was in power. Everything in Iraq lost its glory after him.","commenter_a":"It's a shame the Iraqi army is so awful otherwise they may actually succeed.","post_message":"To retake Falluja from the so-called Islamic State."},{"comment_id":"10153078698497994","commenter_b":"Ucs ? Every district around them closed! who are they competing with? This lady shouldn't be a superintendent of a kennel let alone of our children!!!","commenter_a":"378 schools closed today and a handful of are schools still open that has to be frustrating to parents, teachers and students. This is one situation it's not okay to stand out","post_message":"Nearly 300 schools are already closed this morning (including Detroit Public). You can check out the list here."},{"comment_id":"1388401547878144","commenter_b":"They ain't people fuck em and their cars","commenter_a":"Even if its a serious rush it doesnt give them the right to fkin hammer through like that, imo. Yes they should move over more than they do, but to run into every car they can is idiotic. Shows the disrespect of people even if some may be the enemy, everyone isnt","post_message":"More throwbacks at > Afghanistan Combat Footage - Funker530 You think you know road rage? ~Josh"}]
