[{"comment_id":"10152778500617093","commenter_b":"@username lol! I saw this earlier. Had me crackin up. She was playin NO games with him","commenter_a":"He may not see it now but when he gets older, he will thank her. God bless them.","post_message":"Mom finds her son in the middle of the Baltimore riots... many are calling her Mom of the Year for what she does next. @webpagelink"},{"comment_id":"10153231020785933","commenter_b":"@username you are so wrong girl !","commenter_a":"#Kasich 4Us#...Kasich is a good man and a honest man who is humble enough to recognize God in his life and the need for him in the country once again,hes a man with all of the experience who learned from one of our best presidents Ronald Reagan...and he KNOWS how to lead this country in the direction that it needs to go to become great and LEAD the world as we once did...lets do something right in this country for once and VOTE KASICH!!","post_message":"It's our time to unite the country. New Hampshire, it's your time to vote for a leader who can do it. #Kasich4Us #fitn"},{"comment_id":"10153077775262994","commenter_b":"Linda shove it up your butt. Lions all the way!","commenter_a":"Detroit needs to suck it up, quit whining, and get over it!","post_message":"What more can he say?"},{"comment_id":"837415593047972","commenter_b":"what a lying hag she associates herself above everyone no matter color!!!!!!!","commenter_a":"Excuse me, is Hillary Clinton talking about humility ? - What a joke !","post_message":"Give me a break!"},{"comment_id":"10153480820949726","commenter_b":"Skank whore.","commenter_a":"That song is getting a little old hillary...just like you","post_message":"WATCH: Hillary Clinton targets Wall Street!"},{"comment_id":"10154619916723812","commenter_b":"she only made that statement because she's salty that Melania got busted lol.","commenter_a":"Again for those that don't have a clue. A speech writer helps to incorporate your thoughts and feelings on paper. As the article reads Michelle was heavily involved in the speech. Read b4 u comment.","post_message":"The woman who wrote Michelle Obama's DNC speech is currently a senior presidential speechwriter and has been a speechwriter for Hillary Clinton, John Kerry, and more in the past."},{"comment_id":"697756897072855","commenter_b":"The rest of congress are afraid of him, they are like mice! They are not afraid to mess over the ones who voted them in, they will find out the same door they walked in, can also be the one they walk out when they have no jobs! We put them in, we can take them out the same way!","commenter_a":"Time for you to go asshole","post_message":"Unreal."}]
