[{"comment_id":"10153207702598967","commenter_b":"That chick in red goes down HARD!!! Hahahaha...","commenter_a":"Outstanding!","post_message":"So silly but so fun"},{"comment_id":"10154622879034024","commenter_b":"I think she should sue the college to go back and redo the 4 years and maybe learn something.","commenter_a":"There's no way she could be that dumb and have finished high school.I think we need to have a new law enacted Where our leading officials must have t least a IQ of 117 or above.But Them that would knock out 85-90% of them .","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10158045305755206","commenter_b":"Never get a mortgage if you lose ur job your F ed.My gran always said get a council house,If anything goes wrong they have to fix it,If you lose your job they have to pay your rent.","commenter_a":"@username read the comments.We Defo got to do the outer boroughs next time! X","post_message":"“I wouldn’t give this up for anything.”"},{"comment_id":"10153150400359087","commenter_b":"Oh, she's held to a different standard, alright! Her sh*t don't stink. No matter what she does, she's Hillary Clinton, and she's untouchable. Ask General Petraeus.","commenter_a":"Plain and Simple Hillary needs to be in jail period.","post_message":"“This is not a criminal investigation,” former Rep. Ellen Tauscher (D-Calif.) said. “There’s no question about that. It’s dancing on the head of a pin and frankly partisan politics.”"},{"comment_id":"1308235872529496","commenter_b":"Such a HORRIBLE breed!! !!","commenter_a":"I hate pit bulls ... If judge Judy doesn't like em.... It's good enough for me .... Example here!!","post_message":"Noah suffered injuries to his head and face and underwent emergency plastic surgery."},{"comment_id":"1376905028996190","commenter_b":"Once you build the real fence, you will also be a target of terrorist!","commenter_a":"Hypocrisy","post_message":"The agency said it intends to begin building a “taller, stronger” fence to protect the White House grounds by 2018. via NBC Washington"},{"comment_id":"10152771119936051","commenter_b":"Lady, when in America, do as Americans do. Our country was founded on a theocracy. Deal with it.","commenter_a":"Happy to hear it! American laws and rules apply here. NO others. Don,t like it then leave!","post_message":"This woman demanded that she be allowed to swear on the Quran before testifying. Well, she got her answer."}]
