[{"comment_id":"10153586503151336","commenter_b":"Lmao @username is a pussy cuz a girl made it","commenter_a":"@username @username Cody Wilkerson","post_message":"Two women have made military history by becoming the first female soldiers to complete the U.S. Army's grueling Ranger Course."},{"comment_id":"612057282315211","commenter_b":"God she's an idiot lmao can't fix a fake blond moment","commenter_a":"This girl has a show? It is cheaper to produce this than real news that impacts people's lives. A little girl with a big mouth is our national dialogue? Cheap.","post_message":"Trevor Noah's performance was a thoughtful invasion, a methodical exploration behind enemy lines."},{"comment_id":"935633429829739","commenter_b":"No woman EVER asked for it.","commenter_a":"Of course her clothing doesn't mean she wants it. But, if she wears something low cut and is hanging those ta-tas out.... then she should not care, not get mad if guys look at them.","post_message":"Women prove that no matter what they are wearing, they are NEVER 'asking for it'"},{"comment_id":"944724415582961","commenter_b":"Fuck all white people they stink as fuck come in my yard I'll kill all yall bitches I don't give a fuck about them crackers when they die they turn black bitch we all come from dust one man one woman dust is what color Brown bitch you black like us","commenter_a":"Sharokina Haghee","post_message":"This happened. A Facebook user who goes by the name of Geris Hilton posted a photo with a black child, who is allegedly the son of his co-worker. What happened next, will leave you disgusted. He and his friends decided to make racist “jokes” at the child’s expense. Had it not been for Black Twitter, they would have gotten away with it. MORE -----> @webpagelink"},{"comment_id":"10155881705845389","commenter_b":"Scary? I'd rather say Trump is just plain hilarious!","commenter_a":"I imagine he did, and that's why he is doing so well in the polls! He's a smart man, unlike most RINOs who don't have the guts to speak out about illegal immigration! Donald Trump is gaining support because of his honesty and it scares Republicans and democrats!","post_message":"Tonight, Gov. Rick Perry reacted to the controversial immigration statements made by Donald J. Trump, telling me that he is critical of the \"disrespectful language\" that Trump used."},{"comment_id":"10154083070804160","commenter_b":"Go to Hell","commenter_a":"Won't this trump puppet go jump off a cliff already","post_message":"\"Bow down.\""},{"comment_id":"10154388349554657","commenter_b":"Put the witch on a stick and burn her.","commenter_a":"Should be incarserating her.","post_message":"It is the political story that just won’t go away for Hillary Rodham Clinton:"}]
