[{"comment_id":"10154771677946602","commenter_b":"CB=gotohell!!","commenter_a":"Div 2. LMFAO!! Football is an abomination and now BB is a JOKE. What the HELL happened???","post_message":"For the second game in a row, sophomore Jalen Adams carried the offense. UConn Men's Basketball will play Oregon tomorrow."},{"comment_id":"10155306004950725","commenter_b":"Those girls are animals.","commenter_a":"Throw her Ass in Jail with the real Women, not the Kiddos.","post_message":"A 16-year-old girl has been arrested after a vicious fight with a group of girls at McDonald's, police say. Watch a video of the brutal brawl here------> @webpagelink (WARNING: Violent nature could be disturbing to some viewers)"},{"comment_id":"10154313794062464","commenter_b":"Makes sense to me that Hillary would hide all her secrets in bathroom....no one would go in there after her....even if she did wipe her server.....","commenter_a":"Love the boots!!! I hate pink!!!","post_message":"In the Washington Examiner today: “Could Wendy Davis challenge Ted Cruz in 2018?” Add your name to stand with the cowboy boots over the pink running shoes: @webpagelink"},{"comment_id":"1551325111574622","commenter_b":"This is HER country.","commenter_a":"Now do we really care what this looney tune thinks or if she accepts Trump...if she does not accept him....send her out of the country!","post_message":"No one could have said this better."},{"comment_id":"10154092301891028","commenter_b":"she hates clowns","commenter_a":"@username and Leonora Fabio Chavez Don't tell Sarah About this lol","post_message":"Nope. The lore of creepy clowns purportedly trying to lure children into the woods sweeping the Carolinas and Ohio just made it to Tennessee. @webpagelink"},{"comment_id":"1487251671334957","commenter_b":"That bitch could stick her face in dough and make gorilla cookies !!","commenter_a":"No matter what she wears it looks like it came off the rack at Walmart and she looks like aunt Esther. The only problem is us taxpayers are paying the big bucks for her to look like a curtain hanging over a big black window","post_message":"I'm SICK of my hard-earned tax dollars funding their lavish lifestyles!"},{"comment_id":"10154283345199032","commenter_b":"No: Get out of the U.S. or shut up!","commenter_a":"Who cares? Really?","post_message":"Among the popular vote, Clinton has a strong lead."}]
