[{"comment_id":"631712173663014","commenter_b":"Illegals should not have the right to vote.","commenter_a":"Trump is the answer our country needs at this point in time. I have a feeling that this election in November will bring record number of voters -- what I don't agree with is that illegals have the right to vote. That is why the Democrats are pushing this because otherwise they will lose. Voting should only be for US citizens. Looking forward to a better and greater America come January 2017. #Trump/Pence.","post_message":"Watch: This was the highest-scored moment of the entire 2016 Republican National Convention, and it happened during Donald J. Trump’s speech as he addressed the corruption surrounding Hillary Clinton. @webpagelink"},{"comment_id":"1258751664191586","commenter_b":"i bet she can harvest a lot of trees on minecraft","commenter_a":"Look little bittt i wana see you actually fight some one as good","post_message":"Nice with the hands. #WSHH #Boxing"},{"comment_id":"1233486323342287","commenter_b":"Would rather have this girl as president than hillary.","commenter_a":"As a tax payer I don't mind paying for something like that.....I can't be mad....","post_message":"This 4.95 GPA student revealed her status as undocumented immigrant during her graduation speech. #MicBrights"},{"comment_id":"609800865864857","commenter_b":"#NeverTrump #NeverHillary","commenter_a":"Everyone of us who supports Mr. Trump, must come out and vote. It's great to talk, but we need to actually cast a vote. NO EXCUSES!! The Libertards will stop at nothing to cheat, lie and steal this election. Pass the word on to everyone. Republicans have to come out and support Mr. Trump like no other has been before. #TRUMP2016","post_message":"Crooked Hillary Clinton rakes in millions from nations that fund terrorism, oppress women, and spread hatred."},{"comment_id":"10153099824304753","commenter_b":"This bitch should burn in hell and die of slow painful death","commenter_a":"Look at this demon shaking my damn head","post_message":"She murdered two of her children, one of them in front of her 8-year-old son. At today's custody hearing, she wanted the whole world to know it and was kicked out of the courtroom. What do you think should happen to this woman? @webpagelink"},{"comment_id":"10154377654466729","commenter_b":"parents need to stay in contact with reality when it comes to their kids. pay attention to what schools is teaching our kids. it is all coming together. womans lib, moms are not home any more to pay attention to what kids bring home. homes have been destroyed.","commenter_a":"Those who can, do.","post_message":"Bingo."},{"comment_id":"10154716616787908","commenter_b":"It looks like GE is moving part of it's head quarters to Boston, since Boston will give them a $25 million dollar tax break! It's all about the deal! I'm told that what they're giving back is just a drop in the bucket compared to what they'll get. We're so lucky!","commenter_a":"Yes BERNIE Yeeeeees","post_message":"I didn’t hear the head of GE and all these CEOs who ship jobs to China asking the Chinese for a bailout check in 2008. Instead, after laying off American workers they came begging the American taxpayers for a bailout."}]
