[{"comment_id":"10153067387865329","commenter_b":"Stupid bitch","commenter_a":"Anytime a guy says \"my dick is too big for a condom\" just tell them \"well, my uterus is too small for a baby.\"","post_message":"\"To all the guys saying \"my d*** is too big for condoms,\" TAKE A SEAT.\" // BuzzFeed News"},{"comment_id":"1008378105905084","commenter_b":"She has more than a few screws loose!!!!","commenter_a":"Which Koran.","post_message":"Nancy Pelosi Quotes Mohammed and Pushes Islam at the National Prayer Breakfast"},{"comment_id":"10153714205856336","commenter_b":"First Ladies don't drive.","commenter_a":"Who in their right mind would ever think a Muslim would make a good President of the United States. No One would. This is such a bunch of crap. Liberals get over yourselves and your Gotcha BS. Can you even imagine the first lady in a Burka and not allowed to sit at the table with the men or drive a car or vote? Come on get real.","post_message":"“I’m not a politician, so I'm not going to be looking for the politically correct answer – I’m going to be looking for the truth.\" Dr. Ben Carson told Bill O'Reilly that he stands by his controversial comments that he would not advocate for a Muslim president. Watch the full interview: @webpagelink"},{"comment_id":"10153144460870950","commenter_b":"Rules are rules and the parents are aware of them before schools starts. There has to be more to this than what is being said by the parents. Schools are not allowed to say anything regarding any matter involving a child. Before I can make an opinion on the matter would like to know the schools side on it.","commenter_a":"That's an understatement...","post_message":"The 8-year-old girl's mother says the elementary school sent her daughter home for wearing a kelly green polo shirt."},{"comment_id":"10154038920644091","commenter_b":"Ladies! Do your thang...","commenter_a":"he can save me any day. 😍","post_message":"One thankful New Yorker expressed his gratitude to the NYPD and New York City Fire Department (FDNY) with free coffee and treats."},{"comment_id":"10155290808369657","commenter_b":"How can you support Hillary who betrays our Country lies and cheats and breaks the law each day. Hillary who.doesnt defend our Cpuntry our peopke and wants to open our borders and let terrorist enyer our Country freely as they chant death to America. Hillary qho breaks security and shares top secret Information and endangers our Military andCpuntrys and helps arms Isis ?How would anybpdy think its ok to support a lieimg cheating crinal who should be hung for Treason against America be elected President with all the oiruption and criminal acts Hillary has committed. Seems you should be glad to Vote for Mr Trump as he is good american will make a great president.","commenter_a":"So another mindless elected person. stupid is as stupid does","post_message":""},{"comment_id":"1169496993094128","commenter_b":"Girl, you nuts.","commenter_a":"Don't believe everything you read, folks...apparently Nate Silver got a call from Washington, telling him to \"fix\" his poll numbers from last week. Trump is trumping HRC, and the media is lying to us all. Shoulda picked Bernie when they had the chance. #stillsanders #neverhillary #electionfraud #dnc","post_message":"Our latest polls-only election forecast gives Donald Trump an 17% chance to win the presidency. Polls-plus puts it at 24%"}]
