[{"comment_id":"936073656538031","commenter_b":"She is the one for the job. Let's go forward not backward.","commenter_a":"HILLARY will be a GREAT PRESIDENT.. #PRESIDENTHILLARYCLINTON2016","post_message":"Matt Lauer asks Hillary Clinton about the qualities that make her qualified to become Commander-in-Chief. More coverage on @webpagelink"},{"comment_id":"412094642305750","commenter_b":"Wow, this skank is as dumb as they get. Might be too much time on her back.","commenter_a":"Hey joe, arrest this clown. Lol.","post_message":"It's time for the Sheriff to pay up!"},{"comment_id":"954760584579344","commenter_b":"and if his girlfriend is black then......... \"Harpo who dis woman\".......@webpagelink","commenter_a":"lmao that sounds like the common comment \"I'm not racist some of my friends are black\" or \"I just had dinner with one of my black friends the other day\"........ The Phuckery as the young folks say lol....... #Shade","post_message":"The deputy who addressed reporters regarding the Spring Valley High incident doesn’t believe school resource officer Ben Fields is racist because of his romantic relationship with a black woman 😐 The deputy says the police investigation will focus solely on the question of force, & when asked if race was a factor, he pointed to Fields’ dating life. Fields has previously faced two lawsuits regarding alleged misconduct with black citizens. DETAILS ---> @webpagelink"},{"comment_id":"10153407697891519","commenter_b":"Hope it's a woman.","commenter_a":"I'd like to hear Feines' opinion on this. I would also like to know what other actors were applying for the part.","post_message":"We're actually embarrassed for everybody involved..."},{"comment_id":"10153736965291336","commenter_b":"She dosen't know what she's talking about .Shout up !!","commenter_a":"Think she's irrelevant at this point","post_message":"\"Every single Republican candidate for president is against marriage equality. Every one of them. Many of them are against anti-discrimination laws. Many are against same sex couples adopting.” – Hillary Clinton"},{"comment_id":"10154429812461051","commenter_b":"Damage fags","commenter_a":"Impeach Trump","post_message":"The World Bank claims Trump could be the best thing to ever happen to the American economy. Do you think they're right?"},{"comment_id":"1155384687884221","commenter_b":"That's what you get for working for him.....I wonder if he ever payed the little girls who sang and danced for him for a rally","commenter_a":"Trumps motto : if you're stupid enough to trust me you get what you deserve.","post_message":"If you work for Trump, you're going to get burned."}]
