[{"comment_id":"592725884246871","commenter_b":"She looks like the devil","commenter_a":"She is definitely easier on the eyes than the current one or the wicked witch running for pres","post_message":"Would Melania Trump be a good First Lady?"},{"comment_id":"10153814092279740","commenter_b":"Gear up and hit the streets or shut up these KEYBOARD WARRIORS Crack me up !","commenter_a":"Great Job by the Police....Suspect had ample opportunity to surrender peacefully and the KILL ZONE for an edged weapon is 21 FT..he was well within that zone and a threat to police, who are not required to retreat nor should they...","post_message":"Fla. police shot and killed a razor-wielding man suspected in a bank robbery early Saturday. Video captured the shooting:"},{"comment_id":"10153118055667623","commenter_b":"She's hot!!","commenter_a":"If you have to fight for him then he wasn't yours in the first place. I hope that you're pleased with yourself in hindsight today.","post_message":"A 26-year-old North Carolina woman allegedly stabbed another woman Tuesday night during an argument over a man."},{"comment_id":"1130006897113975","commenter_b":"Get out of America then","commenter_a":"It is a sad day in America. One of the most disgusting men in in our country won the election. I am so sickened by the citizens who would cast their vote for such an evil man. Do they really feel he is person to speak for us as a nation. I find him so repulsive by his words and actions.","post_message":"THESE 23 HOLLYWOOD IDIOTS PROMISED TO MOVE IF TRUMP WINS..... LET'S HOLD THEM TO IT"},{"comment_id":"10153974538694228","commenter_b":"Wow. Two uneducated racists here.....Jean and Gary! Shame on you both!","commenter_a":"You can thank Trump for perpetuating this problem.","post_message":" Muslim? All of you should die! The man yelled from his car. He then went inside for his gun. Police are seeking hate crime charges."},{"comment_id":"10155023527124614","commenter_b":"Oh it was...Sears. It's been awhile since this happened.","commenter_a":"It's sad to see Sears going this way. They lost their way and are seemingly heading towards permanent closure. What's sad is I think Kmart is to blame, whoever at Sears approved that merger with Kmart as they were going through bankruptcy was crazy.","post_message":"Sears Holdings announced today the closure of dozens of Kmart and Sears locations, including multiple locations in California. Stores in Riverside, Bakersfield, Coalinga and Kingsburg will be closed by the end of March, according to officials. decision to close stores is a difficult but necessary step as we take actions to strengthen the Company operations and fund its transformation. Many of these stores have struggled with their financial performance for years and we have kept them open to maintain local jobs and in the hopes that they would turn around,\" officials said in a statement."},{"comment_id":"1339288666111988","commenter_b":"🙄🙄🙄 could have killed thatboy","commenter_a":"@username when @username used to wake us up every morning with his music","post_message":"Peace, love, and coexistence — this Christian man helps Muslims observe their holy month. (via NowThis)"}]
