[{"comment_id":"1191081784242503","commenter_b":"Can't we just put her in jail already?","commenter_a":"Ostensibly, this woman is a public servant whose salary is taxpayer funded. Her bigotry is flagrant and she has chosen to behave in a lawless manner and not serve the public. She is not adhering to her job description and thus is to be held accountable, as are those in the County and Republican Legislature who are condoning this assault on civil rights. Therefore, she, County administrators, and the Legislature need to be served with a large lawsuit.","post_message":""},{"comment_id":"10156132117065725","commenter_b":"I appreciate you being so kind and politically correct. And you laid out a solid, arguably INDISPUTABLE, case there. But, as you pointed out, this is absolutely willful ignorance, so real facts don't mean anything when talking to a trump supporter. They have a feeling, form a belief from that feeling, and then that feeling morphs into a \"fact\" without any due diligence. And, unfortunately, all of their beliefs stem from feelings of bigotry (irrational hatred of an entire group of people). I'd love to have an honest conversation with a trump supporter about his policies. But they won't, because trump doesn't have any feasible policies, he simply says things are bad or good (which we all have the ability to do). What any trump supporter does when confronted with a lack of actual policy, with his track record of insults and short sighted aggression, is blame someone else somewhere ...","commenter_a":"The man did not make a \"nasty or controversial statement.\" He made a series of absolutely false allegations. Correcting him after he spoke could not possibly have been construed as interfering with his right of free speech; you would have only been interfering with his right to be ignorant. Which, apparently, is a sacred right to some of your supporters. And if somebody had made a series of absolutely false statements about you to the President, yeah, I'm pretty sure he would have corrected them.","post_message":"If someone made a nasty or controversial statement about me to the President, do you really think he would come to my rescue? No chance! If I would have challenged the man, the media would have accused me of interfering with that man's right of free speech. A no win situation!"},{"comment_id":"10154208723663984","commenter_b":"The Clinton's are the world's greatest LIARS and they do not give a Damm about you fools who will vote for her ,this woman is a evil woman , but her sheep are if the dumbest people in this country.","commenter_a":"Boy, the \"free\" press keeping her back. Boy, they do the same for the Republicans, the only difference they erase the good comments.","post_message":"A CBS reporter asked Hillary a question about the Brussels attack, but then after she said this 1 thing they IMMEDIATELY cut her off and cut to commercial. This is absolutely nuts."},{"comment_id":"10153146614743984","commenter_b":"You Dum bitch","commenter_a":"IMPEACH OBAMA NOW that damn MUSLIM","post_message":"Wow. I'm sure this is the last thing Obama wanted to slip out to the public. Do you think Obama is one of our worst presidents ever?"},{"comment_id":"10154290325745496","commenter_b":"Excuse me I'm not a racist I didn't like Clinton either so you just showed your true colors the left always does. I didn't vote for Obama but I sure was praying for the change he promised and boy we sure got it but it was nothing he promised so suck it","commenter_a":"All these liberals like to say Trump started the hate no I believe Obama started it 8 years ago","post_message":"Wondering what the blue ribbon is all about? Here: @webpagelink"},{"comment_id":"1429289687105057","commenter_b":"I'm going to beat your ass why you do that to me sis lmao","commenter_a":"Omg sis imagine this! VVanesha Williams","post_message":"This is the incredible moment a mother gives birth to her baby son - in a groundbreaking delivery procedure."},{"comment_id":"544761025684245","commenter_b":"Liars don't smile a lot.","commenter_a":"What Killiary considers a welcome endorsement would be considered a sin and disgrace to any decent human being. Furthermore , what satan's secretary calls the \"extreme\" position of Republican candidates on women's health is really a quite normal position for any one who wants to protect a babies life and quite possibly the life of the mother as well. Of course that position endangers the finances of planned parenthood so naturally Ms. Richards , who would lose her lucrative job if abortion is outlawed, wants to help elect someone who favors her cause. May God have mercy on Clinton, Richards and all like them who promote the culture of death.(MA)","post_message":"The endorsement marks the first time Planned Parenthood has waded into a presidential primary."}]
