[{"comment_id":"10153950593368984","commenter_b":"MAXAMED : WITH THIS NAME YOU SHOULD NOT BE SHOWING OFF!! JEWS ASURE THE WHOLE PLANET BELONG TO THEM, WHAT SAY YOU? FIRST CHANGE YOUR RIDICULOUS NAME, THEN AFTERWARDS CUT YOUR PENIS, ONLY TO SAVE THE WORLD OF PEOPLE LIKE YOU.","commenter_a":"A simple answer: If Muslims need to be treated like Muslims, then they should commit their crimes in Muslim countries. When in America, do as Americans do!!!","post_message":"Muslim inmates decided they needed special treatment because an Islamic holiday was coming up, so they started making insane demands. That's when the jailers responded with some unexpected news..."},{"comment_id":"10154569592984497","commenter_b":"@username GO FUCK YOUR MOTHER","commenter_a":"Mom really in love with new fat penis-shaped exotic veggie.","post_message":"\"Carol from book club told me about it and sent me a recipe to cook it in a skillet.\""},{"comment_id":"10152821450821519","commenter_b":"I don't read/post/view links. So if you're responding to me on fb, a simple original thought will suffice. Thanks!","commenter_a":"Yes! Agreed. We should punish and penalize those who are responsible for providing employment opportunities for tens of thousands. Everyone in America should work for government. #sarcasm","post_message":"\"It’s hard to see how anyone can possibly believe that the Republican Party, which fetishizes low taxes for the rich above all other priorities, truly cares about wealth inequality...\""},{"comment_id":"10155175542819369","commenter_b":"If she took this Job she knew what her role would require, and now she has changed her mind. Time for her to seek new employment plain and simple.","commenter_a":"I dont think any of u trump idiots would take a bullet for him ?if u do well LOL !!","post_message":"The special agent in charge of the Secret Service Denver district is under investigation for suggesting she wouldn take a bullet for President Trump."},{"comment_id":"10154093507104087","commenter_b":"Kiss my ass illegals","commenter_a":"He'll 80% of all Americans desrespect Obama today,but we know the bias mainstream won't tell the truth,Obama lied to all Americans","post_message":"\"Many birthers believe that Obama is not an American because deep down, they believe that anyone who is not white and a Christian is either not an American, or an American with an asterisk.\""},{"comment_id":"1156042484488515","commenter_b":"Amen.....She is a disaster ... vote Trump!!!","commenter_a":"Mr. Hannity. you can talk this forever and they will not change. It is sad really. Appreciate your efforts and continue with your hard work exposing what is wrong with politicians. All of them!","post_message":"\"It's a choice between Donald J. Trump, a candidate who says he'll drain the swamp in Washington and bring about real change, or Hillary Clinton, the most corrupt career politician who's ever run for this office.\" – Sean Hannity"},{"comment_id":"421137708047770","commenter_b":"Lady, you're an idiot!","commenter_a":"Your amazing trying to explain to limited, CNN stupid reporter how dangerous Iran is. Thank god for you! I'd vote 4u any day!","post_message":"ICYMI: I joined The Lead with Jake Tapper to discuss my open letter to the Iranian Government. WATCH:"}]
