[{"comment_id":"10153424802654255","commenter_b":"Hillary 2016.....@webpagelink","commenter_a":"That'd be great if a liberal were running.","post_message":"When liberals go to the polls, liberals win."},{"comment_id":"10154061820451955","commenter_b":"It is just amazing that she can't take both of Bernie's knees out with a snap of her fingers. Something is brewing...","commenter_a":"Time to start planning a street party when Donald J. Trump wins the election. One thing for sure, Hillary Clinton won't be elected DOG CATCHER!","post_message":"SHE LOSES AGAIN"},{"comment_id":"10153776630979714","commenter_b":"Woman here. Would never get an abortion myself, but don't want to impose my beliefs on others so if others want to abort, go ahead. I do not feel the American tax payers should have to fund others abortions, though.","commenter_a":"You have no place to discuss abortion or planned parenthood unless you are a female.... If you're a man, shut the hell up because most of you cant even tell me how many days are in between menstral cycles.","post_message":"Do you, Lena Dunham."},{"comment_id":"10154344399454411","commenter_b":"fuck off you bitch American","commenter_a":"Abe out of all should know that you don't complain against your Slave-Masters. You sold yourselves to the Empire, now shut the fuck up and sit the fuck down.","post_message":"Kenneth Shinzato, a 32yo civil employee of the US military base in Okinawa, admitted that he strangled his victim"},{"comment_id":"10153660392802217","commenter_b":"Some of London does not speak for all of London.","commenter_a":"London didn't care when the rest of the U.K. Suffer so why should we care about london","post_message":"A mad half hour as \"Biblical\" rain hits London."},{"comment_id":"1041804329212648","commenter_b":"The same family will bring in refugees, no doubt, and will regret that as well.","commenter_a":"At the shelter in my city they put all pits and even half pits to sleep, they don't even adopt them out.","post_message":"Pit bull rescued from 'death row' attacks daughter just minutes after arriving at family home"},{"comment_id":"10153208409382093","commenter_b":"She asleep in the kitchen ?","commenter_a":"So just because you invite someone over that person has the right to have sex with you? No means no! And even if she was too drunk to say no, if she never say yes, then it is a freaking no! I didn't know that just because you let someone in your house you're automatically saying \"you can come in my house and rape me :)\"","post_message":"The victim said she woke up to find the suspect forcing himself on her.... so she fought back with what she could find... @webpagelink"}]
