[{"comment_id":"869514233108326","commenter_b":"Wendy please get an education","commenter_a":"And yet they are doing the same to the Palestinians","post_message":"'I could have faced a bullet for kissing Mengele's boots.'"},{"comment_id":"10153394561766336","commenter_b":"Only one I see judging is you","commenter_a":"Her Christian mother must be so proud. This is why you don't preach and judge. Once you put yourself out there, you are now the target to being judged.","post_message":"Bristol Palin, daughter of 2008 GOP VP candidate Sarah Palin, has announced on her blog that she is pregnant with her second child. “I know this has been, and will be, a huge disappointment to my family, to my close friends, and to many of you,” Palin said. @webpagelink"},{"comment_id":"10153294493981438","commenter_b":"I hate her as corporate whore and war monger.","commenter_a":"I like her as Nerd and Law Student!","post_message":"Nerds are cool, and that is Hillary’s true self. She should two-strap her way to the White House."},{"comment_id":"1103020493078450","commenter_b":"@username and Donald Trump's wife is a illegal alien what's your point","commenter_a":"Can somebody explain this to me. Donald Trump just had a physical done and all of his stats are great for 70-year-old man. But yet factor in the draft he couldn't pass a physical exam. Did he get more healthy in the last 50 years? No I don't think so. And it wasn't because of a physical disability. Because right after he dodge the draft he just went to college and play physical sports such as tennis squash and football. So now the medical Side of the argument is contradicting 50 years later. The physical part of it is completely out of the question at the time of the draft because of the sports he played right after he dodged a war. So what other excuse is there to keep you out of the draft? Please somebody answer this question. And these veterans today deserve to hear the answer to ...","post_message":"After four days spent recovering from pneumonia, Hillary Clinton returns to the campaign trail, chats with reporters aboard her plane @webpagelink"},{"comment_id":"1043659032366340","commenter_b":"Yeah yeah @username, it's airheads like yourself what Trump needs to screw up everything in your country. I will build that wall so that people like you can't come into Mexico","commenter_a":"Look at what Mr. Trump is doing to America as a candidate, dividing it, making everybody fight betweeen each others. Imagine what he would do as president...","post_message":"People could be heard screaming, and Donald J. Trump ducked his head, grabbing his podium with both hands before backing away."},{"comment_id":"10156475967855231","commenter_b":"@username That's nothing to brag about or feel proud of. Just makes you a parental fail.","commenter_a":"Art is seems to be tge type of jerk who would disown his gay child. Especially, a male child.","post_message":"He apologized, but let's be for real: does he really mean it?"},{"comment_id":"1113705405389179","commenter_b":"Why do we have 400,000 permanently disabled Americans? Oh because of the 2,996 people killed and more than 6,000 injured during 9/11? So we lost more Americans in good health because war mongers like Hillary Clinton wanted to strike back? Thanks Hillary for your vote on the Iraq War.","commenter_a":"Thank you, Obama...we love you as a President!","post_message":"Excellent news for 400,000 Americans!"}]
