[{"comment_id":"1346208208805563","commenter_b":"@username If you can even get in to see the surgeon!","commenter_a":"Its funny cause in Mexico, the full of thugs and criminals and rapists Mexico you can get major surgeries for free. Yes you need to wait a few weeks but you do get it free if you pay your fee (about 8% of your salary goes for health, another 8% for retirement and house)","post_message":""},{"comment_id":"10154403443803338","commenter_b":"Stupid bitch , be serious","commenter_a":"Let me guess....they were ALL shot by white police officers.....","post_message":"Eight kids under age 10 shot in past 28 days, according to CPD."},{"comment_id":"1348467338501928","commenter_b":"Totalbitch","commenter_a":"Fake","post_message":"If you had one word to describe Hillary Clinton, what word would you use? (Be nice.)"},{"comment_id":"10154188598828405","commenter_b":"he is fighting to get your gun","commenter_a":"Thank you Rep. Lewis!! From a mother, military spouse and small business owner - I'm happy to see democrats fighting to keep us safe! #goodtrouble","post_message":"On July 5th, we're going to continue to push, to pull, to stand up, and if necessary, to sit down. Don't give up. Don't give in. Keep the faith, and keep your eyes on the prize. #goodtrouble"},{"comment_id":"10152907297842507","commenter_b":"look at them idiots......fff","commenter_a":"we need a new classification. White-Black-Latino-Asian-Native American-Loser.","post_message":"Anyone want to weigh in?"},{"comment_id":"1553198684973790","commenter_b":"LOSERS! ONLY TRUMP FOR PRESIDENT!","commenter_a":"Trumps my guy!!! GO","post_message":"Washington insiders and politicians have failed America. If I am elected President I will create jobs, end illegal immigration and #MakeAmericaGreatAgain. #Trump2016 Support Trump: @webpagelink"},{"comment_id":"10152784029667093","commenter_b":"Apparently, Valerie loves being inbred too!","commenter_a":"If you're white you're right.","post_message":"Parker Co. teen accepts a plea deal, avoids life in prison... @webpagelink"}]
