[{"comment_id":"581422622060041","commenter_b":"Hahaha!! Funny!! \"Blacks are lazy\" \"Super Predators\" \"Heel\" -Hillary Clinton on blacks","commenter_a":"Make America dumb again is his slogan this guy caught on tape making fun of so many people she makes a mistake with emails an everyone losses their minds he's not for the people of different cultures he order his supporters to attack people an they did why are you voting for him that's the real ?","post_message":"With Medal of Honor recipients seated behind him, Donald J. Trump tells supporters: \"They're so much more brave than me. I wouldn't have done what they did. I'm brave in other ways ... I'm financially brave.\" @webpagelink"},{"comment_id":"1754805464735210","commenter_b":"You are a dumb whore","commenter_a":"I don't know if she's the MOST qualified (Al Gore), but she's way more qualified than the joke running on the Republican side.","post_message":"Obama: Hillary Clinton is the most qualified presidential candidate in history Just weeks after pledging his support for Hillary Clinton President Barack Obama has said the former Secretary of State is the best possible candidate ever for the White House. Do you agree?"},{"comment_id":"10154356306731545","commenter_b":"Nude models are not the same as porn. If so no young person would be allowed in the best art galleries in the world. However I agree, I would not show my child porn.","commenter_a":"If our First Lady can be a print \"porn\" star, you can be a teacher! Don't let anyone tell you different!!!! :)","post_message":"A teacher at an all-girls academy in Dallas ISD says she lost her job after word got out that she appeared in pornographic films over a decade ago."},{"comment_id":"10155729304999638","commenter_b":"Trump is another Hitler in the making! Shame on all those Americans who brought him into power!!! Wonder what his next steps will be - Muslim concentration camps!?","commenter_a":"Hey Donald does this sound familiar! \"An evil exists that threatens every man, woman, and child of this great nation. We must take steps to ensure our domestic security and protect our homeland.\" -Hitler Racist big Donald and his racist supporters all deserve to go to hell!","post_message":"Donald J. Trump's controversial \"Muslim ban\" just hit a major legal roadblock."},{"comment_id":"10155928923344199","commenter_b":"This is the best.","commenter_a":"Breanna Barrick","post_message":"'Church, singing and sex:' That's what this couple says has kept them together for 75 years! More: via.q13fox.com/Xirhe"},{"comment_id":"869042603191993","commenter_b":"Good! Then STFU you two!","commenter_a":"So they jab him when they invite what's his face to address the congress, now they jab him with this letter to Iran. I mean are you kidding me?","post_message":"\"The letter sent on March 9th by forty-seven Republican Senators to the Islamic Republic of Iran ... is beneath the dignity of an institution I revere.\" - Vice President Joe Biden"},{"comment_id":"10152660515486813","commenter_b":"Maybe , but I am not a damn Liberal pussy.","commenter_a":"Too f'ng bad , play stupid games , win stupid prizes . Its not a resort.","post_message":"HORROR in Georgia Prisons. ACLU's David Fathi sheds light on how America needs to twist the lens and reflect on how we treat those within the criminal justice system. @webpagelink"}]
