[{"comment_id":"1125723030801501","commenter_b":"Lord, she's a vile woman.","commenter_a":"Does anyone have the balls to fire this woman for not doing her job. FIRE HER!!!!!","post_message":"Seems Kim Davis may be going back to jail..."},{"comment_id":"1406868092703665","commenter_b":"Get back here with my food mother fucker!","commenter_a":"Christopher. Stop allowing the americans access!","post_message":"Does the US government want a war with Russia?"},{"comment_id":"888747014505260","commenter_b":"Good way to a straight path to HELL!!","commenter_a":"Awful but God will be the judge. Foolish woman.","post_message":"Pro-abortion Congresswoman Debbie Wasserman Schultz was asked if she's OK with killing a 7 lb. baby that's not born yet. Her response? No restrictions. Period. Sign the petition to defend unborn babies from radicals like Debbie! Click here!@webpagelink"},{"comment_id":"10153788091955950","commenter_b":"Jay the only way Hillary will win is if she lies cheats an steels the votes. Oh wait that's what she does for a living !!!","commenter_a":"This is nonsince TRUMP is not a quiter. He's in it to win it. An he WILL !!! TRUMP FOR PRESIDENT !!!!!!","post_message":"A Clinton plant? A Russian agent? Here's everything you need to know about all the far-fetched explanations of Trump's behavior."},{"comment_id":"10153064490042483","commenter_b":"Funny @username nowhere in your meme is there a picture of the woman you would force to become an incubator.","commenter_a":"Conservatives aren't pro life, they are just pro birth. They defund welfare and unemployment programs, don't support universal heathcare, want to deport \"anchor babies\" and so on. They need to stop pretending they care so much for unborn lives","post_message":"\"The federal government and several courts have made clear that a state cannot kick Planned Parenthood out of its Medicaid program simply because Planned Parenthood provides abortion,\" said Susan Watson, executive director of the ACLU of Alabama."},{"comment_id":"2095517547254171","commenter_b":"Anastasia wants the GOP controlling her lady parts!","commenter_a":"WHY IS MEGAN STILL ON FOX??? Please fire her and let her go hang with her liberal media friends. We deserve to have at least ONE station without this crap. Yellow journalism at its worst.","post_message":"\"I love this country because I understand that I'm living in one of the few places on God's given planet in which a person like me ... could live the life I've been able to live, but I didn't live it by going and screaming and burning the flag,\" Mike Huckabee said."},{"comment_id":"1905981339634270","commenter_b":"O, yea...nothing to do with what a shit candidate Hillary was or the DNC rigging the primary...it's all stupid, racist, immigrant hating, uneducated fools...still don't get it do you. Bullying people you don't agree with by \"being offended\" and calling names lost y'all the election. Try a conversation without inviting your hate first, and stop listening to the alphabet news hate and fear mongers.","commenter_a":"Laura Dittmann watch this. I tell you wutttttt lol","post_message":"Donald Trump's own voters fell for a giant lie. -- Trae Crowder"}]
