[{"comment_id":"1628105883873422","commenter_b":"And your a bitch DANI KAYE","commenter_a":"Sandy if you like him so much. Why don't you just go and live with him at the white house.","post_message":"Tomorrow, we will leave behind a president who has carried himself with quiet dignity for eight years and replace him with a man who is neither quiet nor dignified."},{"comment_id":"444043602465820","commenter_b":"Look at her satanic pointed teeth!","commenter_a":"Not surprising, coming from stupid, I mean her.","post_message":"Democrat Leader says Her Kids Weren't Human Beings while in Her Womb!"},{"comment_id":"1251358764916884","commenter_b":"@username she is the epitome of EVIL...","commenter_a":"This happens when you are stressed and not comfortable with what you are saying. She has to stay in the race or she goes to jail. There are a lot of people depending on her to keep them out of jail. She will crack and meltdown if pushed long enough...","post_message":"@webpagelink"},{"comment_id":"405363642956925","commenter_b":"Bitches can try","commenter_a":"Come bring that b.s. this way I'm ready","post_message":"The video is titled \"A Message Signed With Blood to the Nation of the Cross.\""},{"comment_id":"485585728298674","commenter_b":"She is death warmed over!","commenter_a":"Not the first time Nancy has been hit. A face rearrangement could only improve her looks.","post_message":"Greta just kicked Pelosi to the curb... Good. We need more American women like Greta and less like Pelosi. Do you support Greta taking on Pelosi publicly?"},{"comment_id":"1354934454518383","commenter_b":"She's disgusting!","commenter_a":"Hillary ! Explain to this young girl why you support second trimester abortions ( ripping the body out limb at a time up to Five minutes before natural birth ) I'm not with that !!!","post_message":"This team has so much to be proud of. Whatever happens tonight, thank you for everything."},{"comment_id":"10156478047465231","commenter_b":"Her lips are gorgeous","commenter_a":"Somebody is jealous of this beautiful lips!!! :* :* :*","post_message":"Some people just don't know how to cope when they see beautiful melanin and full lips."}]
