[{"comment_id":"10153277843683352","commenter_b":"LMFAOOOOOOO black women stay losing","commenter_a":"Nothing is wrong with being ghetto and loud, you just gotta know when to show it!","post_message":"LADIES IF YOU'RE ALONE OR WITH A SORRY MAN! HERE'S WHY‼️‼️ #VALENTINES"},{"comment_id":"10153574681028010","commenter_b":"To bad DHS doesn't enforce our laws...she should be returned with millions more just like her.","commenter_a":"Go back then.","post_message":"“I thought I came to this country to escape abuse, mistreatment and disrespect. But it's the same here.”"},{"comment_id":"10152784784428145","commenter_b":"Huh!! Woman abuser and she's a dummy for staying with him! Jerk!","commenter_a":"I guess his girlfriend is a little thug to uhh. Wow!! It should be clear now who really was the trouble maker.","post_message":"UPDATE: Zimmerman has posted bond and is out of jail. @webpagelink #wftv A judge set George Zimmerman's bond at $5,000 and ordered him to surrender any firearms. His attorney, Don West, said Zimmerman is accused of throwing a wine bottle at his girlfriend earlier this week. #wftv Reporter Blaine Tolison is live with the latest on #WFTVatNOON"},{"comment_id":"10153263550734205","commenter_b":"Sure @username","commenter_a":"Not every Muslim is a terrorist, but most terrorist are Muslim. It's science.","post_message":"Man Bullies Muslim At Town Hall"},{"comment_id":"10153905231158984","commenter_b":"Idiot. She'll find out how wrong this is some day. It might be hot.","commenter_a":"So sorry to hear this....","post_message":"She's the biggest female star in Hollywood right now, and she just made a sickening claim about Christians and the cross of Christ. This is just disgusting. She has a new movie out. Let's make sure she doesn't make a dime off of us!"},{"comment_id":"834219746615367","commenter_b":"It's hard in that situation it would be nice if it worked just that easily but pregnancy is a risk and you or I can't force a women to carry a baby.","commenter_a":"Woman's Rights? What about the fathers rights? I had a fiancee who had an abortion about 25 yrs ago. I didn't even know she was pregnant until after the abortion. She had her friend call and tell me. Then wanted me to pay half of the cost. I as the father I should have had a right in the say so for abortion.","post_message":"Five reasons why Matt Walsh says he is pro-life without exception:"},{"comment_id":"10156237879600594","commenter_b":"Her posture? She's not modeling, she's out on a boat with her nieces. I doubt they would have been in the picture if the intent was to be \"sexy\". She wearing a bathing suit. So what?","commenter_a":"The body is fine, the bikini is ugly and her posture is horrible.","post_message":"Ariel Winter takes the online hate and spins it into a message for all the bullied girls out there: \"YOU ARE BEAUTIFUL\""}]
