[{"comment_id":"767530393325420","commenter_b":"If employers are fined and punished who hire illegals and no welfare benefits were given to illegals, they'd have no incentive to be in the US and they go home..","commenter_a":"Senate Democrats need to stop being obstructionists!!! Keep up the good work Congressman.","post_message":"If Senate Democrats aren't happy with the House-passed #DHS funding bill, then they should allow debate & amendments-- that is how our government is supposed to work. I fear that Senate Democrats are playing politics with America's national security in an effort to protect the President's unconstitutional #executiveaction and to protect themselves from having to go on the record with their pro-#amnesty positions. #DontShutDownOurSecurity"},{"comment_id":"10154031009040329","commenter_b":"I'm crying about all of this all over again!!!!!!!!!!","commenter_a":"Riley","post_message":"People keep telling you “it’s only a show,” but then why does your heart hurt so much?"},{"comment_id":"10150620952809999","commenter_b":"You people don't get it. Keep sticking your heads in the sand. You focus on what he says and not what Hillary has done","commenter_a":"Dump Trump.","post_message":"The P.G.A. became the first major golf organization to pull an event from one of Donald J. Trump's properties in response to his comments about Mexican immigrants."},{"comment_id":"10154003076373812","commenter_b":"Actually women STFU if you can't take the heat dont attack....he has just as much right as her","commenter_a":"When it comes to women, Donald should just STFU.","post_message":"Donald Trump ramps up his attacks against Hillary Clinton and former Pres. Bill Clinton: \"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!\""},{"comment_id":"10153896267090329","commenter_b":"How about don't send dick pics to anyone. If she wants to see it she can come over...","commenter_a":"The only one I dont support is the woman who shared a screenshot of the dick pic. Yes, unsolicited nude photos are completely uncool. BUT if a woman sent a boob pic to a dude without Asking him if he wanted one, and he shared it on the internet ... Well this would be a whole different post.","post_message":"More and more every day, women are turning to the internet to find the justice the real world won't give them."},{"comment_id":"1296652160354811","commenter_b":"Your wrong again people ! stop with the Race card ! Wanting our borders closed and secure to stop illegal aliens and drugs from getting in our country is Not Raciest ! and we are at War with Rdical islam so yes all immigration should be Haulted Untill ISIS is Destroyed ! it's about protecting AMERICA and AMERICANS ! The Democrates do not care about securing AMERICA and protecting AMERICANS","commenter_a":"As a German living in Ireland I have to say that the choice can only be Clinton or Sanders! Trump and the likes are disqualified for being racists, bigots, etc.!","post_message":"'It's like a comedy.'"},{"comment_id":"10153635902876130","commenter_b":"Lol. Why do they even give them their name in print. If we ignore them they will hopefully go away...🙄","commenter_a":"Geesh, what an unimpressive list. Was this even worth an article?","post_message":"They all think Donald J. Trump is \"that guy\" for America."}]
