[{"comment_id":"949410461745800","commenter_b":"well said Bonnie","commenter_a":"I am from Middle East and full face cover has nothing to do with Islam, it is clearly oppression of woman. Disgusting. Those who say this is freedom of choice or religion should also be sympathetic to Nazi insignia or brutality","post_message":"What do you think?"},{"comment_id":"10153040394173984","commenter_b":"She needs to resign","commenter_a":"Starting with Obama","post_message":"This is downright despicable. Wait until you see how she's associated with Obama... Do you support removing this racist politician from office?"},{"comment_id":"10156924916305405","commenter_b":"Kathy ugly woman inside and out. I don't talk to commie vermin!!","commenter_a":"Hillary will become president amidst your persistent digging. Republicans cannot even nominate a republican, the party is a total eclipse. Trump vs Hillary is a mono party.","post_message":"\"I have turned over all my emails…I have been incredibly open about doing that.\" Yet Clinton deleted more than 31,000 emails."},{"comment_id":"10156878121275551","commenter_b":"She will infest the White House with her crabs.","commenter_a":"No way, I would vote for a homeless veteran first.","post_message":"Patriot Update"},{"comment_id":"1487334004660057","commenter_b":"I'm sure my mom bragged about me when I was a teen thinking I was an innocent angel. Guess what? Girls are better at hiding it. I saw the video and see nothing wrong with it, she was wearing shorts, she moved her hips. I'm not a Obama fan but the girl is an adult and she's on her way to Harvard. There's bigger issues in the world than the presidents daughter dancing at a concert.","commenter_a":"I love all you people saying this is what a kid does. WRONG!!! Raise them right and raise the to respect their bodies and they don't do this. My daughter didn't do this crap. She was in the Sea Cadets and didn't do anything that would get her kicked out. She wanted a career in the military once she finishes college.","post_message":"Ohhhh boy..."},{"comment_id":"10153438703061130","commenter_b":"A FEMINIST is for EVERYONE.","commenter_a":"this woman is a complete poser. she does not stand with all women. just ask conservative women orgs","post_message":"\"Saying something is almost always better than swallowing it and then thinking about it for two days.\""},{"comment_id":"10153395954276051","commenter_b":"It's a deformed pig fetus.","commenter_a":"Yea right.","post_message":"When a woman found this bizarre creature in her backyard, she was completely horrified."}]
