[{"comment_id":"1156042484488515","commenter_b":"Amen.....She is a disaster ... vote Trump!!!","commenter_a":"Mr. Hannity. you can talk this forever and they will not change. It is sad really. Appreciate your efforts and continue with your hard work exposing what is wrong with politicians. All of them!","post_message":"\"It's a choice between Donald J. Trump, a candidate who says he'll drain the swamp in Washington and bring about real change, or Hillary Clinton, the most corrupt career politician who's ever run for this office.\" – Sean Hannity"},{"comment_id":"10156759727355354","commenter_b":"He might make good filler for potholes.","commenter_a":"Stick your head into a stump grinder? Please?","post_message":"HUMBLE"},{"comment_id":"1508488155837876","commenter_b":"Kelli Foltz-Daniels the Bkacks","commenter_a":"Because Latinos live off the welfare system. When you start talking jobs, they tend to get pissed off thinking your gonna take away their government funds","post_message":"Nearly 80 percent of Latinos have a negative opinion of Trump."},{"comment_id":"10157597315525294","commenter_b":"if ya momma was playing she,d get fined too!!!","commenter_a":"As usual we find a way to lose!!!!","post_message":"Plugged in: Josh McCown and Cam Erving injured. Browns blow first half lead. If McCown can't go, who should QB this week against Miami??"},{"comment_id":"1199679816751446","commenter_b":"@Jim. that sucks! But does not eliminate Trump. We need to get Muslim Terrorist Lovers and their people out before we start on removing the money grabers!","commenter_a":"Who much money are you making Mitch, to allow the Obama's Muslims Terrorist Groups, mainly \"The Brotherhood\", to get more weapons and other support? You are supposed to be stopping this, not helping it! You are already helping Obama, not our Country, by you and Ryan allowing him to much spending money to begin with, now you are screwing us again! You'll get your's as soon as Trump or Cruz are President, there will be some Audit's taking place to stop what you and Obama are now doing!","post_message":"Truly terrifying!"},{"comment_id":"1108284169190819","commenter_b":"Bitch","commenter_a":"Remember Vince Foster!! He was murdered and the Clinton's look like they did it!","post_message":"Hillary Clinton has got to be sweating this one... Do you think this Dem presidential candidate needs to be held accountable for her actions?"},{"comment_id":"565976566923900","commenter_b":"She is a serial killer.","commenter_a":"They could prove that she was a serial killer and they wouldn't care","post_message":"Here we go..."}]
