[{"comment_id":"10152790517586051","commenter_b":"What a piece of crap he is. Cut his manhood off and feed it to him.","commenter_a":"we need a little eye for an eye justice","post_message":"This man broke in, put a knife to a woman’s throat and raped her as her husband lay right beside her. And he didn't stop there."},{"comment_id":"962133447168441","commenter_b":"Ok first of all don't try to tell me there was no raiping in euroup until the emigrants got there it's just the fact that a raipest is a raipest no matter where he is so you shouldn't go around saying imegrants are raipests hide your wives and kids I mean grow up dude","commenter_a":"Imagine if an immigrant did the same thing in Europe. I guess the title (and the comments) would be totally different!!","post_message":"A tourist has captured spectacular views from the top of a pyramid he illegally scaled in Egypt. (Video credit: Caters TV.)"},{"comment_id":"988329747869113","commenter_b":"she should be arrested for making false statement, amd be fired from her job. This crab is getting old.","commenter_a":"She lied","post_message":"WOW this lady...shamelessly LIED about her entire encounter with the Police Officers..and here's the proof! What a fool."},{"comment_id":"10153877529004778","commenter_b":"Yup she's a joke","commenter_a":"Why because they know she going to give them a run for there money..","post_message":"\"Rarely in the history of any criminal case has a prosecutor so directly maintained so many conflicts of interests,\" the motion declares."},{"comment_id":"10153780150441509","commenter_b":"That's nasty","commenter_a":"Shave your freakin pits.","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"},{"comment_id":"1109139419126529","commenter_b":"They are discontinuing these items because they are not being purchased. Pure business decision. They are not trying to bs socially responsible.","commenter_a":"Posturing","post_message":"Walmart made a major decision regarding guns that is going to surprise more than a few people."},{"comment_id":"10153515225917994","commenter_b":"Then leave the country!!!!","commenter_a":"Another flag that represents racism and hatred.","post_message":"Confederate flags: History or discrimination?"}]
