[{"comment_id":"1805658249719321","commenter_b":"Me muero!!!","commenter_a":"@username tu sueno","post_message":"Watch 23 adorable pandas make their public debut. @webpagelink"},{"comment_id":"934872919883382","commenter_b":"Did you listen to how Oklahoma handled the questions? She is no fake Barbie. Women can be beautiful and smart.","commenter_a":"Eeeeew, another fake blond Barbie miss USA. Miss Texas should have won .","post_message":"Wow."},{"comment_id":"10153837082186130","commenter_b":"Just like a woman - fickle and gossipy.","commenter_a":"I'd like to see a woman president too. The right woman president. Someone so awesome she makes everyone wonder why we waited so long for that woman. I don't think we've found that woman yet.","post_message":"It's not neccessarily an endorsement for Hillary Clinton, but..."},{"comment_id":"1293464810706279","commenter_b":"Foolish talk from a foolish woman","commenter_a":"Try retraining the dumb crooks and thugs!","post_message":"@webpagelink"},{"comment_id":"1502446079775417","commenter_b":"Hillary is doing so badly she has to stir up whatever she can. Notice at all of her rally's or speeches instead of substance,all she does is pick on Trump. Guess that and lying are her specialities, along with hating half the country.","commenter_a":"Go Trump Say NO to Hillary And YES to Trump Save America from WW3 so go out and vote for Mr Trump When I as a Muslim wants him to be come a president so what is wrong with you Go out and make history vote for trump Thanks Don't listen to the media they are one sided","post_message":"It's possible that Donald J. Trump will try to backtrack today. But here's why he can't."},{"comment_id":"1003748633011864","commenter_b":"Gurmeet.... YOUR POINT IS MOOT.","commenter_a":"Things that make you go Hmmmm???? Curious how some women would vote for a candidate, that said he would date his own daughter if they weren't related. And said he was waiting fro her breasts and ass to blossom when she was younger.","post_message":"In one of his most overt efforts to reach out to the critical Latino voting bloc, the presumptive Republican presidential nominee Donald Trump wants to address a meeting of influential evangelical Hispanics this weekend hoping to draw their support this November. Do you believe this gesture is sincere?"},{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."}]
