[{"comment_id":"10154012959875329","commenter_b":"I was going to tag my bff, and a couple of them made cringe a bit because u do then, but Jesus, that's a real bitch. I must be just a mini bitch.","commenter_a":"Wow I thought I was a judgmental bitch until I read this. Good to know I'm not that bad!","post_message":"You judge everything."},{"comment_id":"10153062976166680","commenter_b":"Eh. Women do come back in body bags but whatever.","commenter_a":"The candidates should pledge to keep Jackson and Hamilton on the currency. Where does it say a women has to go on a bill. Women don't come back in body bags during our wars. To go on a currency bill as Washington, Lincoln, Hamilton, Jackson, Grant, Franklin, and Jefferson have is b/c of their committment to this country, AND NOT b/c of their genitals. If a woman is to go on a bill let it be on a three-dollar bill.","post_message":"POLITICO Europe: “There is such a thing as society,” Cameron said in an implied retort to Margaret Thatcher’s counter-view, “it’s just not the same thing as the state.”"},{"comment_id":"367258316795796","commenter_b":"This is against the establishment clause of the Constitution!!","commenter_a":"Send all of those goat lovers back to the sand dunes!","post_message":"Allah is replacing God in our schools..."},{"comment_id":"10152849250926770","commenter_b":"Saul Alinsky a communist socialist died about 43 years ago, but his writings influenced those in political control of our nation today. Recall that Hillary Clinton did her college thesis on his writings and Barack Hussein Obama writes about him in his books. Died: June 12, 1972, Carmel-by-the-Sea, Ca Education: University of Chicago Spouse: Irene Alinsky. Books: Rules for Liberal Radicals Reveille for Radicals Anyone out there think that this stuff isn't happening today in the U.S. ? All eight rules are currently in play How to create a social state by Saul Alinsky There are eight levels of control that must be obtained before you are able to create a Liberal Socialist state. The first is the most important. 1) Healthcare : Control healthcare and you control the people. 2) Poverty : Increase the Poverty level as high as possible, poor people are easier to control and will not ...","commenter_a":"Maybe he was the main cause. Left himself out, didn't he.","post_message":"Excuse me?"},{"comment_id":"10154140006458525","commenter_b":"pure evil! No reason to harm officers.","commenter_a":"Suspect is now in custody.","post_message":"#BREAKING The suspect has been captured. Police in Iowa are searching for this man in the ambush-style attacks of two police officers, shot and killed in their cruisers. Police say Scott Michael Greene, 46, is considered armed and dangerous. SPREAD THE WORD: @webpagelink"},{"comment_id":"10153543271535950","commenter_b":"If it said \"build a wall to keep the women in their place\" would you be offended?","commenter_a":"OMG get the crisis team there quick. It's a free speech wall that can only be used for their personal agendas and things they agree with . Poor pansies. Oh and make sure the crisis team comes with their prescription pad.","post_message":"The Ohio University wall has been an outlet for free speech for more than 40 years. But some students say the latest Donald J. Trump-related message went too far, and they decided to do something about it:"},{"comment_id":"10152713641640496","commenter_b":"Amen, Laura ! AMEN.","commenter_a":"Sorry. I disagree. He sounds like a spoiled brat who realized that marriage takes work. Both people have to be willing to work at it. A real marriage is good. Hard sometimes. But good.","post_message":"How many of these do you agree with? @webpagelink"}]
