[{"comment_id":"791518854323422","commenter_b":"@username She won't even make it out of 2016 before being arrested!!","commenter_a":"When I voted in Virginia on 10/13/2016, they never checked my ID. Just sayin folks .................. better watch these cheating people .... just in case!!!!!","post_message":"Live Now: Donald J. Trump speaks at a rally in Johnstown, Pennsylvania."},{"comment_id":"637787356403576","commenter_b":"She's a psychopath","commenter_a":"She's correct. We're living in an era when a significant number of Americans simply refuse to acknowedge facts, or even the existence of facts. It's the populist wave.","post_message":"Hillary Clinton: \"It's now clear that so-called fake news can have real world consequences.\""},{"comment_id":"475959349195637","commenter_b":"@username BITTER GAY HATER!!!","commenter_a":"@username 2016!","post_message":"Tony Perkins Rallying Iowans for Ted Cruz: @webpagelink"},{"comment_id":"1006112072821407","commenter_b":"Demand Justice..Hillary doesn't deserve a Free ride.....","commenter_a":"Clinton Mafia is on the Move #NeverHillary #NeverAgainBill!!!","post_message":"FBI Director James Comey detailed Hillary Clinton massive destruction of government records and grossly negligent handling of classified information. Frankly, there a disconnect between Comey devastating findings and his weak recommendation not to prosecute Hillary Clinton. Federal prosecutors, independent of politics, need to consider whether to pursue the potential violations of law confirmed by the FBI."},{"comment_id":"1641203876178008","commenter_b":"God Bless You PRESIDENT DONALD J. Trump","commenter_a":"I called illinois state election they didn't do anything","post_message":"WATCH #LIVE: Donald J. Trump speaks at his second event on #Halloween at a rally in Warren, Michigan."},{"comment_id":"598083523681641","commenter_b":"She really shouldn't enter into a battle of wits unarmed!!","commenter_a":"Right... because Mechanical Engineering has nothing to do with science..... *rolls eyes*","post_message":"-_-"},{"comment_id":"959584250762524","commenter_b":"That woman is so far out of touch with reality she is in her own dimension","commenter_a":"Hilary will lose","post_message":"Hillary Clinton on potential battle with Donald J. Trump: \"Look, I’ve been standing up to bullies my entire life on the international stage, on the national stage.”"}]
