[{"comment_id":"1317571668339082","commenter_b":"Same base of people that have supported him all along - not enough!","commenter_a":"Uhm, Trump is not losing support. Did you not see the amount of people that showed up to his rally today?? You've got to be joking!! He spoke to at least 25K people. And there were still people outside whom the fire Marshall would not allow in!!","post_message":"The National Rifle Association has spent more than $21 million on the presidential race, praising Donald J. Trump and knocking Hillary Clinton."},{"comment_id":"10153128866595329","commenter_b":"Feminists brats don't want to objectified by men, but flock to articles like these. Hello, double standard. You ladies should be ashamed.","commenter_a":"Thank you!!!!","post_message":""},{"comment_id":"10156036512370294","commenter_b":"Why doesn't she just create her own page?","commenter_a":"U r beautiful don't forget that","post_message":"'We recommend that you avoid focusing on certain body parts...' A mother and blogger who suffers from a chronic skin disorder that affects her face wanted to post a photo of herself without make-up to teach others about her disease. Facebook said no:"},{"comment_id":"1164695216980191","commenter_b":"@username if you don't appreciate how this site reports things or how it's run, do us all a favor and take your clicker to someone else's bait!! Life's too short to have to deal with such negativity! Peace!","commenter_a":"This happened a year ago... Wonder why it is recirculating?","post_message":""},{"comment_id":"10156697390890354","commenter_b":"I wouldnt be a cop there for any amount of money. I say, disband the police, send those trained officer where they are really needed...and let the animals rape, rob and kill each other. Liberalism worked so well in all the other major inner cities (Detroit - a decaying liberal sh*t hole, Philly, East St. Louis, etc...), let Berkley have a peek at reality.","commenter_a":"--- I recommend abolishing 'UC Irvine\"----much more accomplished----","post_message":"You're not going to believe what they say in their demands letter. As you read it, just remind yourself that these are tomorrow's college educated \"leaders.\""},{"comment_id":"10154684364106130","commenter_b":"Jerry's beautiful wife. Who looks like that","commenter_a":"Gayle Gergich, you rock Pawnee!","post_message":"Slay, Christie Brinkley!"},{"comment_id":"10153564191549270","commenter_b":"Chupacabra, pick up DOD Files hay accurate B 52 bombing during knock out gooks ... evaporated socialists and during First Iraq company","commenter_a":"When the last time bombardier B52 knock out targets accurately .... during .Vietnam... Flight over Chinese and just scare... scare Chinese...","post_message":"\"We conduct B-52 flights in international air space in that part of the world all the time.\""}]
