[{"comment_id":"10153933282696350","commenter_b":"Bethsaida Yadnara Why have their own muslim brother's turned them all away??? Jordan, UAE, Dubai, Saudia Arabia?? Those are some very rich countries, right around them.","commenter_a":"They don't belong here...and sure their parents are collecting major benefits, just for entering the country.","post_message":" know people have mixed feelings, and they can be afraid because it's the unknown. But the more we get to know these people, the more the community gets to know them, the more that's just fading away.\""},{"comment_id":"1859871360913002","commenter_b":"Can we please build that wall around his ugly face and throw dirt in his mouth!","commenter_a":"GEEZ LET THAT MAN BUILD THE WALL ... @webpagelink","post_message":"\"We will build a great wall along the southern border,\" Donald J. Trump told a crowd in Phoenix, Arizona, during his immigration speech. After a long pause, he continued: \"And Mexico will pay for the wall.\" @webpagelink"},{"comment_id":"10154465806735530","commenter_b":"NO! Please God, NO!!!!! Don't come here!","commenter_a":"These comments certainly prove how classy and educated Trump supporters are, lol.","post_message":"Hillary Clinton will be in metro Detroit next week. @webpagelink"},{"comment_id":"10158198305710206","commenter_b":"Exactly why women shouldn't be police officers!!","commenter_a":"Hodor.","post_message":"Nice try!"},{"comment_id":"876377039127570","commenter_b":"Hopefully the \"treatment\" is the same pain & suffering the little girls had to endure","commenter_a":"There is sex offender treatment in prison?","post_message":"Nicole Vaisey, 26, and her boyfriend, 40-year-old Stephen Howells, admitted that they kidnapped the two Amish girls."},{"comment_id":"10155781129770329","commenter_b":"The Government shouldn't be funding ANY OF IT, that's the reason it would be discontinued. The Federal Government protects our borders, prosecutes Federal crimes (FBI) and unifies States with Federal Laws under the constitution. That's ALL I WANT THEM TO DO. I support Trump cleaning house on the outrageous spending the Federal Government has been doing for some time. PBS can go back to private funding and telethon like they did when I was a kid. NPR, same idea. They need to raise their own money like any other radio/news outlet. The amount of fees we will begin to charge Mexico for deporting all the people they let cross over will pay for The Wall. In taxes to Mexico for importing goods here. Learn basic Economics and US Government people, geez...","commenter_a":"The best part about PBS, NPR, and those other arts programs that are getting cut is that they actually don't cost that much. So, really, there isn't a lot of money being saved to go towards the idiotic wall that he wants to build.","post_message":""},{"comment_id":"10153632761623984","commenter_b":"Die bitch","commenter_a":"Coward!!!!!!!!!!!","post_message":"After calling out the suspect in this tragic police officer shooting, this city’s top cop dropped a huge truth bomb that could come as a big surprise to advocates of the \"black lives matter” movement. Do you agree with this police chief?"}]
