[{"comment_id":"10153723682667144","commenter_b":"It makes perfect sense to the Grand Ol' Party. Women should just kept their legs shut. Duh.","commenter_a":"Geeze, who would have guessed that access to birth control would result in lower pregnancy rates.","post_message":"An all-time low!"},{"comment_id":"1311796595543533","commenter_b":"#DontBoo #VoteHillary #NastyWomenVote","commenter_a":"we are not going backward, we are going forward , Best of luck The world President @username \"I am sick and tired of the negative, dark, divisive, dangerous vision and behaviour of people who support Donald J. Trump","post_message":"Don’t miss out! Join them: hillaryclinton.com/makeaplan"},{"comment_id":"10153986690345329","commenter_b":"Sebastian Franklin my hand on the way to the clippers game on the bus","commenter_a":"@username you","post_message":"You're not alone."},{"comment_id":"1164111043641758","commenter_b":"that is not Trump8 wife","commenter_a":"Hey if you got it show it","post_message":"Liberals Attack Trump Family After Sexy Photos Of Ivanka Trump Leak. Let's show her our support. Do you stand behind the Trump family?"},{"comment_id":"10152960734572014","commenter_b":"They need to leave them alone! Stay out of our business in az this is our state Feds!!!","commenter_a":"These horses must be left alone! They cause zero harm, and countless amounts of pleasure to all who see them! Using the logic of \"public safety\" then why haven't all the bears in our National Parks been removed???? I had an uncle when I was very young who worked for the Forest Service. I'm sure this would shocked by this action.","post_message":"Arizona Governor Doug Ducey has voiced his support for leaving the wild horses where they are."},{"comment_id":"1178310438875078","commenter_b":"Now we have to feed, clothe and house this murdering POS! Like the other 60 million illegal aliens aren't enough! Mexico's corrupt government couldn't keep track of him! Take him out to the desert and open fire!","commenter_a":"Get a rope!","post_message":"DRUG KINGPIN heading our way (until he escapes, of course) details: @webpagelink"},{"comment_id":"10154051337399411","commenter_b":"Are you sane, woman?","commenter_a":"A scientific theory is a well-substantiated explanation of some aspect of the natural world that is acquired through the scientific method and repeatedly tested and confirmed through observation and experimentation.","post_message":"If you have proof: bring it. If you do not: acknowledge openly that you have theory perhaps a well-honed, much loved theory, but a theory nonetheless. (Op-Edge by Sam Gerrans)"}]
