[{"comment_id":"10153036402924885","commenter_b":"excuse you? I am so sick of all that we went through when we brought the rams here, and they aren't that great a team to be trying to drum up public support for them again. If you're such a good fan, how bout you follow then to wherever they end up!","commenter_a":"Let 'em GO! Let 'em GO!","post_message":"Details of the plan for a new downtown football stadium were revealed today. Peacock called the project more than a football stadium: \"We are talking about a revitalization of our downtown.\" Take a look and let us know what you think."},{"comment_id":"1762721907277999","commenter_b":"yes it is I don\"t care for her either but talking bout taking a life is wrong. weneed let goodLord dealall shes done doing. will answerto Him in the endnot us and he knowsit all. don\"t vote for her that simple","commenter_a":"Just remember: NASTY WOMEN VOTE!","post_message":"This is unacceptable. Period. I hope they track down the car's owner--and whoever made this bumper sticker.--Darrell"},{"comment_id":"10153051967106130","commenter_b":"Aqua man? Bitch please.","commenter_a":"\"Do you have a minute to hear about our lord and savior Jesus Christ?\"","post_message":"YIKES."},{"comment_id":"424819437642651","commenter_b":"I would be in prison because I would whipped her ass","commenter_a":"Oh, come on,@username, act your age! The girl was clearly in the wrong, but the sub lost the battle when he responded to her as he did. He should have immediately summoned help rather than try to argue with her.","post_message":"I wonder how this student would have been dealt with back in the day."},{"comment_id":"802434323195863","commenter_b":"I support neither group. Blacks and whites need to get along. We are in a failing country that is falling apart.we need to get rid of this racism and focus on the big picture here","commenter_a":"As a member of the Armed Forces and a decorated war veteran...she does not owe me an apology. She used her platform to deliver a message while honoring a historic Black-ran group on their 50th anniversary during the one month Black history seems to be relevant. Coldplay honored the LGBT community in their performance but ironically there was no uproar over that. If anything @username you owe me, the Armed Forces, and the Veterans an apology for posting this crap and trying rally up sympathizers to further your racist agenda. Radical? Hardly....maybe you should brush up on some history and ask yourself why these organizations began in the first place before posting....oh and this...","post_message":"***BLACK PANTHER PARTY SUPPORTER AND BLM RADICAL DONOR BEYONCE OWES AMERICA'S POLICE, ARMED FORCES, & VETERANS AN APOLOGY***"},{"comment_id":"10156440483580492","commenter_b":"Elouise faux? Why even post this garbage?","commenter_a":"Nah, it was just ratatouille ...","post_message":"Rats may love eating our finest delicacies, but they don't belong INSIDE of them."},{"comment_id":"10153320376007042","commenter_b":"All five females was arrested","commenter_a":"That poor girl. I hope the person who attacked her gets arrested.","post_message":"A 17-year-old girl viciously attacked inside a Brooklyn McDonald's is speaking out about the brutal assault for the first time. @webpagelink"}]
