[{"comment_id":"10153465913933145","commenter_b":"Your mom took the time to raise you right....take the time to raise your children right !","commenter_a":"This kid didn't have to go thru this were was the mama, I hope the kid has been taken out of the home? Why did the grandmother didn't do anything for the girls. We live in a crazy world?","post_message":"A father is facing child abuse and drug charges after police say he beat his daughter because she didn't get enough candy while trick-or-treating."},{"comment_id":"1554819554825337","commenter_b":"i dont have to even listen , i can tell by how stupid she looks","commenter_a":"Lunatic left.","post_message":"This is downright shameful."},{"comment_id":"952596034775492","commenter_b":"@username Shooter FU! You are a whinny little bitch.","commenter_a":"lol we are fucking idiots, we believe in make believe deities, we salute the flag of the sickest country in the history of existence, we salute brainwashed troops who murder innocent people behind imaginary lines, welcome to brain dead Georgia lol","post_message":"If you don't love the nationalistic rhetoric of the state, LEAVE! Police The Police | The Free Thought Project.com"},{"comment_id":"571127086402504","commenter_b":"Come on guys, the woman is desperate and nervous. You will see very soon who will come out on top. It's time for some real change.","commenter_a":"Look like this page is also scrambling to save Hillary. It's good to know sanders is getting to her. #feelthebern","post_message":"Bernie and his campaign are misleading voters about what Hillary said."},{"comment_id":"960936923986215","commenter_b":"She is loud!!! Trump!!!","commenter_a":"Now I'm really confused, Trump is not the true conservative, and I thought Palin was.","post_message":"Sarah Palin is ready for someone who can take down ISIS and #MakeAmericaGreatAgain- are you?"},{"comment_id":"778598825583664","commenter_b":"Don't let Chump Trump know you Clown Car passengers responded to a Megan Kelly article...She is the enemy...Have you Repubics forgotten...Clown Car Rolls On","commenter_a":"Hey Tim, I like the pocket pool!!!","post_message":"Pulls no punches."},{"comment_id":"10153168410293690","commenter_b":"In ind had been an individual liber,on account of each mob should be admit each religion.its actual substance,besides already has recognized via Basic R8s","commenter_a":"Its expected from modi sarkar, as he has the record of massacaring muslims in Gujrat..","post_message":"Are India minorities under attack? Christians and Muslims say the government is not doing enough to protect them from hardline Hindus. But is prime minister Narendra Modi being compromised by his nationalist roots? @webpagelink"}]
