[{"comment_id":"10154880669523614","commenter_b":"Let them go there and put up another wall.","commenter_a":"Now there's an idea, send them all there not here. Works for me.","post_message":"Canadian Prime Minister Justin Trudeau's immigration minister has declared an open door policy for immigrants and refugees."},{"comment_id":"10153951464149575","commenter_b":"IU sucks","commenter_a":"They suck though.....","post_message":"The Indiana Hoosiers are back in the top 25!"},{"comment_id":"10153088515381336","commenter_b":"Withdraw so we can finance the terrorist to attack isis....","commenter_a":"Oh, the ones he referred to as JV?","post_message":"President Obama is expected to announce in the coming days a modified plan on U.S. troop withdrawal in Afghanistan to help the country’s new government fight the Taliban and other emerging insurgent groups."},{"comment_id":"10152538895247014","commenter_b":"Suck his dick already","commenter_a":"I bet his pay didn't get any cuts","post_message":"In his state budget proposal, Gov. Doug Ducey announced some big cuts to the state's universities. Now, the Board of Regents responds."},{"comment_id":"1245131405583109","commenter_b":"Hillary said she carries hot sauce with her to pander to blacks and said they are predators. New leaked emails said that democrats were making fun of black women names. Yep that's what the democrats think about you. You have been played","commenter_a":"all he really concentrated on is how the speakers totally dogged him out....lol...I loved it but thats all he heard...he didnt hear them talk about Isis...he didnt see them bring up 4 star generals..he didnt hear a thing about what Kareem Abdul- Jabbar said...he didnt see the father of a Muslim man who fought and was killed while serving in our armed forces...he didnt hear them address Black Lives Matter and the Police...he didnt hear them talk about our criminal justice system...so t makes me wonder what convention was he watching..","post_message":"\"They're not talking about radical Islamic terrorism. They're not talking about borders where people just pour across. They're not talking about the crime,\" - Donald J. Trump"},{"comment_id":"10152987263776130","commenter_b":"@axelnieto and @hugoaguilar. I never said people in Latin American countries aren't happy. I also never said that there is absolute no wealth or opportunity. I agree with you that it's not easy (which is what I was trying to make a point of to begin with) but it is there.","commenter_a":"They don't make work, wealth, and success important because their country doesn't give them the opportunity for that. Duh huffington post.","post_message":"\"Instead of making work, success and wealth the most important things in life, Latin Americans typically have family and community firmly at the top of their priority list.\""},{"comment_id":"673333352791257","commenter_b":"It is VACCINATED children getting the measles from the illegals.","commenter_a":"There will be more diseases brought in that we have eradicated ! They can't let in all these refugees and not face the problem!!!","post_message":"Illegal immigrants have been bringing a special 'gift' with them when they cross the borders. This is terrifying!"}]
