[{"comment_id":"1555472744739839","commenter_b":"Screw them! Go get a job and pay for your own damn food.","commenter_a":"Get off your butt and look for work. In meantime, thank which ever god you pray to for living in a country that gives Food Stamps!!","post_message":"This is outrageous. If you're that picky get a Job and buy whatever you want."},{"comment_id":"10154625084044270","commenter_b":"To me she is worthless. And don't care for this evil women. End of story!","commenter_a":"On no that's like putting killary in charge. She is a very evil women. Not good for New Mexico or the air force.","post_message":"President Donald Trump announced he will nominate Heather Wilson, a former congresswoman and Air Force Academy graduate, as the new United States Air Force secretary."},{"comment_id":"1346208208805563","commenter_b":"@username If you can even get in to see the surgeon!","commenter_a":"Its funny cause in Mexico, the full of thugs and criminals and rapists Mexico you can get major surgeries for free. Yes you need to wait a few weeks but you do get it free if you pay your fee (about 8% of your salary goes for health, another 8% for retirement and house)","post_message":""},{"comment_id":"10156996522130354","commenter_b":"I will not vote for Ryan ... he is a socialist....","commenter_a":"Yep!","post_message":"TED CRUZ: PEOPLE WILL ‘REVOLT’ IF NOMINEE NOT ME OR TRUMP..."},{"comment_id":"10153772983356813","commenter_b":"Does that mean pardoning him for his rape accusation that he fled the country for as well?","commenter_a":"Snowden deserves a pardon. More than Obama deserves to be POTUS.","post_message":"Now's the time for Barack Obama to pardon Snowden."},{"comment_id":"10153089785921491","commenter_b":"Ah , the range of a true lady.","commenter_a":"Love everything about her, even though I'm now aware of an intimate and amusing detail of which I had't really given much thought.","post_message":"Interviewers, beware: do not mess with Amy Schumer."},{"comment_id":"699418583582053","commenter_b":"Jaye you're a perfect example of a dumb blonde .....","commenter_a":"What in the heck did Obama do to deserve impeachment!!!! People are just RIDICULOUS!!!!!","post_message":"Obama's college records were finally publicized and what they say... This is exactly what he has been trying to cover up for so many years. Do you think Obama should be impeached?"}]
