[{"comment_id":"10154020630826636","commenter_b":"@username however... that's detracting from my point! My original comment was about the UK's inability to prosecute migrant sex offenders!","commenter_a":"The only problem people in the uk have with immigrants, new British, Muslims etc... is the lack of police prosecution and \"special treatment\" minority groups get. There are an estimated 1 million cases of Islamic grooming, which've been swept under the carpet, by social services or went uninvestigated by police because of fear of being branded racist! That's not just some \"bigoted\" or \"islamphobic\" propaganda.. that's the reality of people living in a heavily Muslim populated area! The problem isn't with immigrants or non white Christian Brits... it's the lack of ability to deal with the crime coming from their community's by the authorities!","post_message":"Ironic?"},{"comment_id":"10153168898035950","commenter_b":"Says the jaded soul. We still love you.","commenter_a":"He really thinks his opinion really matters. I hope and pray to God he loses really bad so he can get off his arrogance. He is a very insecure man. You can see how he talks and communicates his body language very insecure man. His life is a big lie and is willing to say what it takes to take the country down. Amazing some coat see right through him. Must not be very bright people.","post_message":"The secret to real estate mogul Donald Trump's popularity in this election season has eluded pundits, pollsters, the Republican establishment, and really, everyone else. \"Honestly it's my looks,\" Trump said before a rally in Atlanta on Saturday. \"I'm very handsome. That's the only thing I can think of right now\""},{"comment_id":"466923970098864","commenter_b":"Do not let the Muslims take over our great country with their agenda. I'd look terrible in a burka!","commenter_a":"Carson is right!!!","post_message":"A major American Muslim group says Ben Carson should drop out of the presidential race unless he apologizes for saying Muslims shouldn't be president. Do you think Carson should comply with their request? Via Opposing Views"},{"comment_id":"10154110456411337","commenter_b":"Why are they anonymous?? Staying unknown seems cowardly... Bunch of bullies. Be open about it if that's what they feel and think....","commenter_a":"Erica Rudolph","post_message":"TOTAL WAR: Things are getting really ugly between Anonymous and Donald Trump."},{"comment_id":"10153715195470736","commenter_b":"NO>>NO..these are always a waste of tax payers money and benefit Corps...and I don't want MORE people here..","commenter_a":"NO!!! no no!!! such a waste.","post_message":"Would you want Oregon to host the summer Olympics in 2028?"},{"comment_id":"10156036197975293","commenter_b":"I don't get it. If a woman pulls her breast out in public it's illegal. I a man looks at her breast he's a perv. So why dose a woman want to breast feed in public.","commenter_a":"It's awesome","post_message":"A picture of some soldiers breastfeeding has gone viral. READ the story and let us know what you think."},{"comment_id":"10153111712291491","commenter_b":"Respectfully disagree. I like my women a pretty delicate flowers, but that's just me.","commenter_a":"She might be the all around inside/outside sexiest female of the 21st century!","post_message":"Ronda Rousey's next opponent: the box office."}]
