[{"comment_id":"534767963372316","commenter_b":"HILLARY WILL TAKE OUR COUNRTY TO THE GROUND,ALL SHE CARE ABOUT IS POWOR","commenter_a":"In 1997, Donald Trump, who showed his personal courage by dodging the draft in 1960, had the gall to compare his heroism by sleeping with multiple women to the heroism shown by the brave men and women who served the United States in Vietnam. Interviewed by Howard Stern in 1997, Trump had the audacity to make the incredible claim that by risking his schlong to venereal disease from his sexual peccadilloes, his courage matched those who gave their lives facing mortar fire and bullets across the sea. Speaking of his sexual exploits, Trump bragged, been so lucky in terms of that whole world. It is a dangerous world out there. It scary, like Vietnam. Sort of like the Vietnam-era. It is my personal Vietnam. I feel like a great and very brave soldier.","post_message":"Crooked Hillary Clinton has lied from the beginning regarding her emails, and server. President Obama recently defended Crooked Hillary - saying she did not endanger national security. He also said ISIS was contained last year! Crooked Hillary will NEVER make America great again!"},{"comment_id":"10153767545206002","commenter_b":"My son still has school.","commenter_a":"Schools need a coordinated web site saying exactly what are close or open..","post_message":"Bitter cold has closed schools not already on Winterbreak. School Closings: @webpagelink #Local4Today"},{"comment_id":"525857150938198","commenter_b":"She is the female anti-Christ.","commenter_a":"Oh but there are plenty of sheep out there that think this idiot is wonderful how stupid can people be???","post_message":"Hillary Clinton's sex slave just exposed her for doing THIS. What a disgrace. She will never be president. Can we get 20,000 'LIKES' to make sure Hillary never becomes president?"},{"comment_id":"1019119028118150","commenter_b":"Majority of the worlds wealth belongs to Caucasians. It's not news anymore.","commenter_a":"Wow lost all respect for this station. Seriously? I know there is more important news that doesn't have to deal with comparing races.","post_message":"Report: Whites have 12 times the wealth of blacks See study--> @webpagelink"},{"comment_id":"474511766072737","commenter_b":"Can't do that until you remove the Muslim president who encourages them to take over.","commenter_a":"we need to take our Country back. We outnumber them let stop the insanity. Dont let any mosks be built in this country. We cant build Churches in theirs. If they dont like it here than leave. No one would care.","post_message":"Muslims force this school to ban Christian holidays. America is under attack, this is treasonous. 'LIKE' if banning Easter is WRONG!"},{"comment_id":"10154151078661002","commenter_b":"Oh please just remember who killed the most Americans on American soil they were not Black or White that's what's wrong with this country if we banned together we would never worry about muslim terrorist! They wouldn't stand a chance against the blacks and whites of America","commenter_a":"Because he's a pale person his information is not even released yet","post_message":"3 dead in Lafayette theater shooting WATCH: @webpagelink #Local4Today"},{"comment_id":"10153828343101051","commenter_b":"You are a brave girl I'm happy you kids are out off that hell hole","commenter_a":"This so sick and so sad! I pray for these children are in a good foster home. The mother and the boyfriend and the other person go to jail for life. This child was very brave to email the teacher. Didn't anyone at school see that something was wrong with these kids? The boyfriend should be castrated! How can this happen in America?","post_message":"This teacher was reading her e-mails when she noticed a message from one of her students. Because of how young the kids in her class are, they rarely sent her e-mails. She realized almost immediately that something was wrong."}]
