[{"comment_id":"1158047454312031","commenter_b":"STOP THIS IN AMERICA!! Send illegals back! Police those that are here legally. These people want us dead....when did that change, folks????","commenter_a":"If they want to kill off their women and children nothing we can do about that. I have no problems shooting anyone who is coming after me. It's us or them. I say us","post_message":"It's only a matter of time before children will be doing all the dirty work. These monsters MUST be stopped. @webpagelink"},{"comment_id":"10152745228401615","commenter_b":"being lesbian doesn't make them superior... they could easily end up divorced single mothers too.","commenter_a":"Most marriages end up in divorce and children are raised mostly by struggling single mothers. Those mother's present the mother And father role. Having two mothers appears to be a blessing! :) Children need love, structure and room for growth. So, haters just sit down and if you love children so much the foster care and group homes have many of your neglected and abused children waiting to be adopted and loved.","post_message":"Yes, they're both pregnant, but about a year apart..."},{"comment_id":"10153816638906336","commenter_b":"They were to busy kissing her big a**s.","commenter_a":"Wonder what kind of \"humor\" the View women shot at Michelle Obama?","post_message":"“If you meant [the] comment about my face being demented as a Halloween mask as humor, so be it… I have a real thick skin,\" Carly Fiorina fired back."},{"comment_id":"10154937498024885","commenter_b":"She MAY have HAD fashion, but when she wears hideous clothes made for her. It speaks volumes.","commenter_a":"Ok Post Disgrace, we get it STL has a slightly few more liberal, reverse racist, nobodies then the rest of the Midwest. However, this is no time to be praising Osama Obama's wife. We just celebrated Christmas for God's let's try to keep the sane ones sane.","post_message":"\"She's made an effort to wear accessible fashion,\" designer Tracy Reese says. \"I think Jackie (Kennedy) was a great role model but she wore a lot of couture, and things that most Americans could not afford.\" Mrs. Obama, she says, has worn both high-end and moderately priced fashion."},{"comment_id":"10154216740214160","commenter_b":"Says the woman who's husband cheated on her and she cheated on her husband","commenter_a":"People in Power need to lower their Kelly's.","post_message":"\"Today I ask Donald J. Trump to step aside,\" wrote Carly Fiorina."},{"comment_id":"1053937954629059","commenter_b":"Crystal...I'm beyond sick of those trifling girls.","commenter_a":"Who cares???...I'm so sick of B news","post_message":"Un-Clutch Your Pearls: Beyoncé Has Nothing To Do With The Sarah Baartman Project @webpagelink"},{"comment_id":"10153436827584153","commenter_b":"very often though.","commenter_a":"it's burning 24/7 don't even try to go there.","post_message":"Would you go vacation in Greece now, despite the economic crisis?"}]
