[{"comment_id":"10155229441268352","commenter_b":"She is a grown ass women","commenter_a":"For all j-lo haters y'all can go straight to hell she is in love","post_message":"Daaaayum! Drake and J-Lo are KILLING THE DANCE FLOOR… watch Drake GRIND ON J-Lo's FAMOUS BOOTY… then slow-dancing together like they about to go make babies!! (Video -- Super HOT!!) ----> @webpagelink"},{"comment_id":"10153306477369586","commenter_b":"Bunch of dumb asses.","commenter_a":"this is sick","post_message":"Yes, those are real dead cats. :( Oklahoma high school students posted this disturbing video on Facebook. Wait until you see how the teacher was involved. HELP STOP THIS: @webpagelink"},{"comment_id":"10154674776698010","commenter_b":"I've met a few bitches in my life Derek's mom and @username girl were both on that list.","commenter_a":"Pence basically saying hey I'm a rich white male never get stopped by police why should I care .","post_message":"Gov. Mike Pence spoke about police killings and the need for \"law and order\" at the debate. He ended by asking his opponent, \"Senator, please, enough of this seeking every opportunity to demean law enforcement.\" More debate updates: @webpagelink"},{"comment_id":"10153224417118984","commenter_b":"Both sides of her mouth - she's guilty and she knows it","commenter_a":"YES; An Orange Pant Suit would do just fine!!","post_message":"The irony is unbelievable. I don't think I could have said it any better than Hillary did in this 38-second video... Should Hillary be punished for her email scandal?"},{"comment_id":"10153389055716770","commenter_b":"Wow is she stupid or what. Racist pig.","commenter_a":"Sure we can play with a bad bad boy and you will get bad results","post_message":"A CNN guest argued that her ex-CIA panel-mate was unqualified to talk about ISIS because he's white."},{"comment_id":"991210200940830","commenter_b":"DUMB-DUMB-DUMB WOMAN","commenter_a":"What a ghastly hag!","post_message":"She's not the only woman to make such a painfully ignorant comment. Just last week, a German Mayor made a very similar remark. Click here to read what she had to say about Muslim immigrant rapists, and how women in Germany can prevent rape: @webpagelink"},{"comment_id":"10156315267360725","commenter_b":"Humble pie lol","commenter_a":"She was getting way to cocky... talking way 2 much... didn't hit gloves before the fight .... she was force fed a slice of humble pie last night","post_message":"Glad to see that Ronda Rousey lost her championship fight last night. Was soundly beaten - not a nice person!"}]
