[{"comment_id":"10153820494546350","commenter_b":"i see Kate in her lol and Will in George","commenter_a":"Princess Charlotte looks like her daddy, adorable.","post_message":"Princess Charlotte has grown so much in six months! We just can't handle the royal cuteness! on.today.com/1IrSwdd"},{"comment_id":"10156244248180354","commenter_b":"Stop importing the pigs and it wont be","commenter_a":"Learn English","post_message":"Obama's New America..."},{"comment_id":"10153382769757411","commenter_b":"I don't know who you've been talking to but it seems to me that America has been supporting the illegal Mexicans for quite a while and we have been paying for it with our tax dollars! So now people are angry because there is no money in our checking accounts because the government is taking it to pay for all the refugees and the illegals that is using our system! We have no country without a border, we have no country if everybody comes in that wants to! without doing it properly! Now is the time to take our country back and get it out of the true terrorist hands, that is in our government and has been for past several years, using the people to their advantage!","commenter_a":"People should protest all of Donald Trump's rallies and stop this man before he gets out of control. America does not need to return to the days of racism and prejudice to be \"great again\". I can't imagine Donald Trump as President of the United States. Everything will be one big reality show for him and he will be the host who gets to fire whoever gets in his way. His supporters are exhibiting the same attitude and acting like they are judge and jury treating protesters as if they should be deemed as Enemy Combatants who do not have rights. Donald Trump has stated that if he becomes President of the United States that he would wage war against Mexico in order to recuperate the cost to build his wall. Racism is his underlying motive. Just like when Hitler waged war against the Jews. His sole ambition to gain ...","post_message":"\"Donald Trump has created a toxic environment. And the toxic environment has allowed his supporters and those who sometimes seek confrontation to come together in violence.\" John Kasich today blasted Donald J. Trump for \"preying on the fears\" of Americans. Both Kasich and Marco Rubio suggested they may not support Trump should he become the GOP nominee. Story: @webpagelink"},{"comment_id":"10154121076339342","commenter_b":"You are sick! Abortion should not be an option, period!","commenter_a":"There are so many people who would love to have kids and can't. But monsters like this get that blessing and go and kill their kids. This world is so effed up.","post_message":"Chilling new details about how a mother allegedly took each of her kids into the bathtub, and took their lives."},{"comment_id":"900572216669194","commenter_b":"This breed should be wipe off the earth surface","commenter_a":"But pitbulls are harmless.","post_message":"Moment dog savaged ice-bucket challenge woman"},{"comment_id":"1802126320030739","commenter_b":"I still say his daughter should be charged with inciting a riot! All damages, and the protester that was killed. I still think she was doing all of this to get a paycheck from the city. No difference between her and Browns momma in Ferguson Missouri. Remember her jumping up and down on somebody's car screaming \"Burn this mother*ucker down\" referring to the city! Was she charged? Hell no, I still wonder if she got paid ? Bitch should have been buried under the jail.","commenter_a":"Ah, more clickbait. Headline: Dash Cam Footage Released. Story: Police are not releasing the dash camera footage because..... Gotta love the manipulative lies in these article headlines that these sites put out just so they can get paid per click to the site.","post_message":"Riots have critically wounded one already and now it's proven he had a gun, not a book..."},{"comment_id":"1258250390858975","commenter_b":"She's trash too,","commenter_a":"No jobs or their boss refuses to buy group health insurance and a heavy extra tax next year for not having health insurance. All those young healthy folks need to buy premiums so the insurance companies keep up their profits.","post_message":""}]
