[{"comment_id":"1143835818981314","commenter_b":"I love the books. I have them all except the 3rd one.","commenter_a":"Tell them to send to the literacy centers ,people will buy them from the literacy centers to keep them running or they can build a literacy in the U.K. for the people there.","post_message":"A charity bookshop in Wales is begging people to stop donating \"Fifty Shades of Grey\" after becoming overwhelmed with hundreds of copies of E.L James' steamy novel."},{"comment_id":"10153234141898984","commenter_b":"Should fire her sorry ass!!","commenter_a":"Another feftist idiot...","post_message":"Oops! Janet Napolitano just fell victim to a hot mic. She's probably looking for places to hide right about now..."},{"comment_id":"10153204052806051","commenter_b":"@username-You are a chicken !!!","commenter_a":"Obama is a terrorists","post_message":"This sign about President Obama is sparking a lot of controversy. Decide for yourselves if it's fair."},{"comment_id":"729190623881952","commenter_b":"You say that as if the right wing doesn't itself demand political correctness. The right wing gets its panties in a wad if someone dares say, \"Happy Holidays\" instead of \"Merry Christmas.\"","commenter_a":"Political Correctness is not a joke ... it's a dangerous growing cancer in our society and it's going to destroy our nation if we don't stand up for our freedoms while we still have them ....","post_message":"“There are jihadists out there… who want to kill all of us because of our way of life... We have to understand that we can no longer be politically correct.” Judge Jeanine Pirro slammed the White House for being too politically correct when it comes to the threat of terrorism. @webpagelink"},{"comment_id":"1903950129833878","commenter_b":"@username It was stolen! Putin and Trump stole the election, doesn't your little brain understand this. A foreign dictator stole our election so that this con-man could be manipulated by an evil russian. Read!!","commenter_a":"Then come on Democrats, let's shut down America! Trump cannot make it to the White House!","post_message":"No doubt! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10155018887269329","commenter_b":"Rehash rehash... blah blah you lefties, blah blah. We won blah blah. No new content. Regurgitation continued. Yawn.","commenter_a":"You'll fit in with the self-important Hollyweird glitterati JKR. The British have never been enamoured of their paid entertainers except for simply that, as entertainers, who are well paid for their craft. The disenchanted and disenfranchised led the way with Brexit. Believe me, those who formed this majority are not racist not are they Ill educated. Nor are they of the lower socio-economic strata of society. They are the majority who stopped being intimidated by the PC brigade. The U.S. followed and Europe is next. The pendulum has swung back in reaction to the rot spreading from the highest echelons of government down, aided and abetted by a dishonest press and a compliant and unrepresentative public service.","post_message":"J.K. Rowling has outdone herself."},{"comment_id":"10153613354068690","commenter_b":"and she need to learn how to write in english either","commenter_a":"May Allah help all Muslims around the world Ameen","post_message":"We demand the freedom of our colleagues who are unjustly detained in Egypt. #FreeAJStaff"}]
