[{"comment_id":"10152889836291491","commenter_b":"Felicitari !","commenter_a":"I hope she and her baby are both well safely","post_message":"It's a girl!! @webpagelink"},{"comment_id":"1765571717063636","commenter_b":"@username STFU","commenter_a":"It's so nice to hear a candidate say he loves America and its people. Unlike Obama and Hillary who constantly tell us how horrible and deplorable we are and not fit to wipe their shoes. Vote Trump who would wipe our shoes if asked.","post_message":"An incredible evening in MIAMI, FLORIDA! This is a MASSIVE MOVEMENT. I LOVE YOU! -DJT"},{"comment_id":"10153957663196509","commenter_b":"i would run away too if rosie was my embarassing mother, RUN GIRL RUN......","commenter_a":"Gay parents would make any child go crazy!!!","post_message":"The 17-year-old had stopped taking medication for an undisclosed mental illness, Rosie O'Donnell said in a statement. @webpagelink"},{"comment_id":"499007870289793","commenter_b":"She's an ass. She's not an elected official. Tell her to stuff it.","commenter_a":"Go away Michelle.","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10154222477216717","commenter_b":"I want her and trump dropped in the middle of Aleppo ASAP.","commenter_a":"What swamp did this creature slime her way out of!!!' I wish she would slither back in!!'","post_message":"Trump advisor Kellyanne Conway also said that detained Muslim travelers would be \"disposed of\" on a case-by-case basis."},{"comment_id":"1871395319625852","commenter_b":"I can totally see her talking to the Queens of other countries not clomping around scowling at everyone that is pretty","commenter_a":"For a GOP Super Pac to do this to a presidential candidate's wife and family is inexcusable and wicked as hell. Look at her TODAY. She will be the most glamorous and classy first lady yet and envy of the nations.","post_message":""},{"comment_id":"1280674628621991","commenter_b":"@username yes she's the best of a bad lot","commenter_a":"Dump the Trump he just isn't Presidential Material","post_message":"If you think that a President Trump would be checked by Congress and \"couldn't really do that much harm\" you're totally wrong."}]
