[{"comment_id":"10153283394148984","commenter_b":"She needs to be in the big house not the white house","commenter_a":"Grill her ass !","post_message":"Trey Gowdy has invited Hillary Clinton to testify, in private, on her decision to delete thousands of emails from her private server as well as the full scope of her responsibility in the 2012 attacks at Benghazi. Let Rep. Trey Gowdy know how you feel and customize an email just for him!"},{"comment_id":"1747275395512005","commenter_b":"@username if it isn't Mr. Trump YOU will be voting in Hillary","commenter_a":"The only thing that needs to change is HIM OUT OF THE WHITE HOUSE.","post_message":"Obama says \"we\" need to pray for the \"strength to change.\" It's yet another of his disgusting refusals to acknowledge the realities we face."},{"comment_id":"10155177965959050","commenter_b":"MAN HATER. EVIL WOMAN","commenter_a":"Disgusting.","post_message":"The anti-Trump Women's March featured a woman who kidnapped a man and then tortured him"},{"comment_id":"10153255897157894","commenter_b":"She has a problem period","commenter_a":"Somebody has a problem with authority","post_message":"Azealia Banks Under Investigation for Allegedly Beating Up a Security Guard [Video]"},{"comment_id":"10153598643443812","commenter_b":"Hmmm....will it help us grow perfect women with nice titts?","commenter_a":"Cristian Reyes","post_message":"World's largest atom smasher detects new kind of subatomic particle called the 'pentaquark' -- a new form of matter: @webpagelink"},{"comment_id":"10156651950690354","commenter_b":"She can have all my babies","commenter_a":"Some poor schlep is going to get this girl pregnant one day and then oooooohhhhhhhh shitttttttt, here comes the crazy. Which brings up a good point. Wear condoms. Knowing is half the battle.","post_message":"Here's the VIDEO that's breaking the Internet today. \"Miami’s Local 10 identified the inebriated girl as second year University of Miami neurology resident Dr. Anjali Ramkissoon.\" **Viewer discretion is advised**"},{"comment_id":"10150815152779999","commenter_b":"Hahah Welcome to the team","commenter_a":"@username :P","post_message":"Hold the Door. Hold the Door. Hold the Door. Hold the Door. (Hold off on reading this recap until you've watched the most recent episode of \"Game of Thrones.\")"}]
