[{"comment_id":"635476119976300","commenter_b":"And we are apparently buying her cigarettes for her, good for nothing jackass. Where are the FATHERS, let those suckers pay for their babies they fathered!","commenter_a":"Deport !","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"10154091486669445","commenter_b":"As is history. It is the dark side of humankind.","commenter_a":"We're all in, but especially Europe, for a very tough long haul. When you have people hating as a lot of terrorists do, willing to give up their lives, there's practically no way to stop them. And Europe is full of them","post_message":"The Eiffel tower is lit up in the colors of Belgian national flag after #Brussels terror attacks @webpagelink"},{"comment_id":"1017809398240071","commenter_b":"Thought it was a low-res depiction of a chicken...","commenter_a":"Lexi Langlinais !!!","post_message":"A huge asteroid is set to pass close to Earth."},{"comment_id":"10154231947457411","commenter_b":"You would think they would have heard all the bee's buzzing around up in the attic long before it got to this point. DUH.","commenter_a":"This is common wasps or bees or Lizards I have seen a lot but not this much","post_message":"A Texas homeowner found herself in a sticky situation after calling for help with what she thought was going to be a simple roof repair."},{"comment_id":"1648471502112051","commenter_b":"It never bothered Hillary, at least he recognizes it and is willing to seek advice.","commenter_a":"He's getting bald.","post_message":"This is not normal. This is not normal. This is not normal."},{"comment_id":"373714942816800","commenter_b":"these two remind me of demons..... boy are they in for a surprise on judgement day... I will pray for them.........they are so misguided........","commenter_a":"It is my understanding that there are some Seal team guys in the middle east that would like these guys to come and visit....and they will be glad to indoctrinate you about how things work in their part of the world...please make a reservation as soon as possible.","post_message":"Bill Maher joins Michael Moore in the war against Chris Kyle..."},{"comment_id":"488461684677745","commenter_b":"There idiots ,this woman can handle a weapon and herself ,and shes beautiful to boot","commenter_a":"beside ,in front,behind shes good from any view, wish she was President ,one smart lady !","post_message":"Controversy erupts after this video of Palin surfaces. Sarah is in trouble. She needs our help. Do you stand behind Sarah Palin?"}]
