[{"comment_id":"1698278530442016","commenter_b":"We need to plan a gathering this summer","commenter_a":"@username where are you?","post_message":"Your Monday just got better. Today is National Margarita Day."},{"comment_id":"680360518742918","commenter_b":"Yeah ted😄,, me and my uncle Malcolm Fisher love ya!!!","commenter_a":"I refused to watch his garage band act but I'll take your word on it!","post_message":"Tonight America saw a powerful demonstration that it is time to move on beyond President Barack Obama. #SOTU2015"},{"comment_id":"884276841629012","commenter_b":"I'm not for it but I will say this: the government has known and has collected millions of dollars from illegals with fake social security numbers. Republicans and democrats both. To work here the illegals have had to come up with a fake s.s. number and pay on every check. This is a fact. I've seen it, known people who pay into it and will never see a dime from it. Our government is full of lies. They take that money and our legal money and blow it. Like I said I'm not for illegals but don't be blinded any side of the aisle in Washington D.C.","commenter_a":"This ia considered buying votes and that's illegal...but then everything Obama does is illegal. ..STOP HIM","post_message":"Thousands of illegal aliens could begin collecting from Social Security as a direct result of the president’s executive amnesty."},{"comment_id":"10153778649078854","commenter_b":"This witch should have been fried after being tried!","commenter_a":"a bullet does not cost much and in this case it would definitely improve the penal figures.","post_message":"Mother Sentenced to 25 Years in Prison After She Presented an FBI Informant with a Disturbing Offer"},{"comment_id":"10153088515381336","commenter_b":"Withdraw so we can finance the terrorist to attack isis....","commenter_a":"Oh, the ones he referred to as JV?","post_message":"President Obama is expected to announce in the coming days a modified plan on U.S. troop withdrawal in Afghanistan to help the country’s new government fight the Taliban and other emerging insurgent groups."},{"comment_id":"10153373990610329","commenter_b":"So NO harm ?!? Dude how did this dumb bitch make it through medical school... 😂😂","commenter_a":"I know what I'd do!! Shotgun job!","post_message":"A photo of the veterinarian with the dead cat have gone viral and sparked outrage."},{"comment_id":"10154952151491509","commenter_b":"\"Guns don't kill people. People kill people.\" You think Omar would have killed as many people as he did if he only had a kitchen knife or a baseball bat?","commenter_a":"The NRA are the republicans pimp....","post_message":"\"We're talking about terrorism right now. This isn't about guns.\" Congressman Sean Duffy rebuked House Democrats, who are staging a sit-in for stricter gun control measures."}]
