[{"comment_id":"1403734329688680","commenter_b":"these mobs are planed and paid for by the elites and must be stoped","commenter_a":"These people need to be arrested. This is not peaceful protest. It's criminal.","post_message":"BREAKING: Trump Official RUSHED To Safety After What Mobb of Attackers Just Did To Her Outside Child School"},{"comment_id":"10155119252083690","commenter_b":"@username U r a horrible women ur all posts r anti Islamic. ...shame on u..","commenter_a":"Correction: Racism sparks anger towards dude getting on with his life.","post_message":"A British boxing star has stirred far-right anger after posting a picture of himself taking part in Muslim prayers at a mosque in the UAE."},{"comment_id":"1136778326378278","commenter_b":"Mizo I am not shia. But i am sure shia love this place aswell I can never imagine they can do this cowardly act it is time to hug each other regardless of there beleive let Allah to decide and guide us all the ryt path. I am in the favor of a united muslims across the world regardless of there beleive. Muslims getting butchered across the world. Innocent children women are getting bombed every single day. For God sake be united. May Allah protect all the muslims across the world.","commenter_a":"inshallah everything would be alright because the Angels of Allah look after our prophet house so I have suggest to King of Saudi to whip Shia from Saudi Arabia to somewhere else","post_message":"It exploded near the Prophet's Mosque, one of Islam's holiest sites. Update at 23:00 BST: Interior ministry has confirmed four security officers have been killed and five others injured."},{"comment_id":"10152587508455163","commenter_b":"She read them their rights! Envyherlashes Tawana","commenter_a":"@username girl yes I was so happy Amber told them hoes wat it really IZ it's was going on ALLDAY yesterday!!!!!","post_message":"Amber Rose responds to Khloe Kardashian after calling her out for Kylie and Tyga comments"},{"comment_id":"10154753068623812","commenter_b":"Send them all back and send Mexico into a Panic Mode. The Wall will be up in no time.","commenter_a":"Maybe he can bring back the auto manufacturing jobs from Mexico, and hire legal citizens, and then the illegals will stop coming. Oh wait. They come here because there are those willing to pay pitiful salaries and no benefits to make a buck.","post_message":"Donald J. Trump has made his promise that Mexico would pay to build a wall along the U.S. border a centerpiece of his proposed immigration policy. But only 13% of voters believe he could deliver on that promise if elected."},{"comment_id":"10153067300837061","commenter_b":"Alex Barham you better do this for me. I sunflowers","commenter_a":"Beautiful story.","post_message":"Wisconsin man plants 4-mile stretch of sunflowers in tribute to wife who died of cancer: @webpagelink"},{"comment_id":"776000935873204","commenter_b":"But I'd call you a hoe 😂😂","commenter_a":"Us when we get a dog and live in separate places 😂 @username","post_message":"\"I pay puppy support...\""}]
