[{"comment_id":"1011635065552183","commenter_b":"Are you surprised by this woman's corruption? She should be in jail with the other corrupt politicians. Wonder what she'd look like if she didn't have access to plastic surgery for a couple of years.","commenter_a":"this woman should be took out and shot for all the corrupt things she has done ,, and throw in her friend Dirty Harry Reid also ...","post_message":"Here's Nancy Pelosi real \"war on women\""},{"comment_id":"1268015386628044","commenter_b":"An ex Democrat here that doesn't believe her lies. And neither does 90% of our Democratic Charter making up close to 3000 people. We are NOT voting for Hillary Clinton. The DNC should have let the election alone. You won't hear about it in the media or see it in the polls but MANY Democrats are pissed off at their party for rigging the election for Mrs. Clinton. I hear what's going on from the ground floor in the Democratic Party and from my calculations close to 30% of Democrats are not voting for her nationwide.... They are desperately trying to get us on board but it is not going to happen. The Democratic Party is falling apart and you won't hear about it from a single news source. She will have the \"always vote blue\" votes and that is it. The Clinton campaign and the DNC have even sent ...","commenter_a":"The democrats feelings get hurt from a said word or two. Lying Hillary can insult their intelligence by lying to their faces for 40 years and they are completely ok with it. Makes you question their intelligences.","post_message":"Hillary Clinton and Donald J. Trump are tied in South Carolina according to new polling. Rachel Maddow breaks down the surprising development. More analysis on the latest polling from The Rachel Maddow Show: @webpagelink"},{"comment_id":"10153422173110329","commenter_b":"Weird","commenter_a":"@username read all the way through. This is what you're getting.","post_message":"Mom is gonna freak. An elegant homemade gift is just a few easy steps away."},{"comment_id":"1011157232323867","commenter_b":"I heard this interview last night. It was in reference to him making less money.","commenter_a":"LOL","post_message":"That'll convince voters."},{"comment_id":"945496635572234","commenter_b":"She is selling us out to the Arabians","commenter_a":"Butcher of Benghazi","post_message":"WATCH LIVE: Hillary Clinton addresses a crowd in Miami to talk Zika virus"},{"comment_id":"10154209676831336","commenter_b":"Carolyn Ann Banet shut up hoe","commenter_a":"Women are dangerous, no matter what species!","post_message":"Yikes!"},{"comment_id":"395107284010899","commenter_b":"asshole mother fuckers wow","commenter_a":"Democrats are acting like children.","post_message":"Democrats LASH OUT at Netanyahu, Tell Him to Go Home, Call Him “a Child”"}]
