[{"comment_id":"10153767198963690","commenter_b":"@username it is not just three countries being destroyed, all the countries in Europe to which the refugees are going will be destroyed economically, culturally, life as they know it will never be the same.","commenter_a":"Saddam a cde to be missed, a last Iraqis leader","post_message":"\"There are plenty of Iraqis for whom Saddam is a nightmare that they never want to see again. His legacy here, though, is complicated. It's not as simple as 'Dictator Bad, Democracy Good,' as the architects of the Iraq war would have you believe.\" Al Jazeera's Imran Khan, in Baghdad, filed this Reporter's Note."},{"comment_id":"1192453620787838","commenter_b":"Pitiful female !","commenter_a":"She's not the teacher she could be a student","post_message":"The report said the teacher ended up having an abortion after she got nervous when Child Protective Services unexpectedly showed up at school in February to question her and the student about their relationship."},{"comment_id":"10153067387865329","commenter_b":"Stupid bitch","commenter_a":"Anytime a guy says \"my dick is too big for a condom\" just tell them \"well, my uterus is too small for a baby.\"","post_message":"\"To all the guys saying \"my d*** is too big for condoms,\" TAKE A SEAT.\" // BuzzFeed News"},{"comment_id":"1196095087116904","commenter_b":"This women is craving Attention poor thing","commenter_a":"And they call this art !!!! How ??? Not on !!!","post_message":"She's doing what?"},{"comment_id":"944837115644330","commenter_b":"No way trump will win this election! Most white, asian, african american and latinos will unite on november and bit the heck out of trump! Never will vote for a someone that makes fun of disable, a rapist, a liar and a PSYCHO!","commenter_a":"The audacity of your campaign sickness me to my core :/ . You and your minions are the \"deplorables\" . All you that support these monsters should be ashamed of yourselves! #Trump2016","post_message":"If Donald J. Trump becomes president, how can we guarantee that he'll choose America's security over his own financial interests?"},{"comment_id":"10155685513649838","commenter_b":"Build a wall or simply arrest business owners for hiring illegals","commenter_a":"Curtail \"illegal\" immigration.,......why is it so hard for liberals to grasp the concept of \"illegal\" ? Great having a \"difference maker\" with a backbone back in the White House.","post_message":"Trump plans to sign an executive order today to direct federal funds to be shifted toward the building of a wall on the southern border, a signature promise of his campaign. He has argued that doing so is vital to gaining control over the illegal flow of immigrants into the United States."},{"comment_id":"970318416341964","commenter_b":"Airbrushed and retouched photos set unrealistic goals for women, and set us up to believe that we are JUST NOT GOOD ENOUGH. Since we can't ever achieve \"the look\" that we see in ads, we are consistently striving it, and so continue to buy more cosmetics than we need. Pictures and articles like this are absolutely necessary if women are to ever claim their power as more than objects.","commenter_a":"News Flash! Most of us know what people look like in real life. This story is useless.","post_message":"These pictures are everything cosmetic companies DON'T want you to know."}]
