[{"comment_id":"1041013112628492","commenter_b":"COUGH ON ALL YOUR LIES BITCH! THE WRATH OF THE LORD IS COMING FOR HER!","commenter_a":"Is she still alive? Damm she is","post_message":"Well this was just revolting. Clinton cannot stop coughing during speech."},{"comment_id":"10152941804948869","commenter_b":"Women in bed with marxism again...","commenter_a":"No, the world needs more female rockers...not more critics","post_message":"\"The problem for women is that our role in popular music was codified long ago.\""},{"comment_id":"10153227262005667","commenter_b":"@username where do you live? Come on your pry think we don't need crude oil any more either.","commenter_a":"If you think it's cute I will snare one and let you try to pet it. They are vermin and need to be killed or they will take over. Now they just eat your pets, if the numbers get out of control they will come after humans.","post_message":"The animal was spotted entering the baggage claim area and then ran across the ticket check-in area and toward the TSA checkpoint."},{"comment_id":"10153850798269614","commenter_b":"we definitely need to build this wall and make Mexicans pay for it","commenter_a":"donald trump is right we need to get this people out of this country","post_message":"U.S.-born Syed Rizwan Farook, 28, was one of two suspects identified in the fatal shooting rampage at the Inland Regional Center, police said. He and a female suspect, 27-year-old Tashfeen Malik, later died in a shootout with authorities."},{"comment_id":"1176027829155419","commenter_b":"Smart woman","commenter_a":"Big deal!!! She had a right as an American citizen to vote but who she voted for is no one's business but hers.","post_message":"People are freaking out over what's being said about Taylor Swift today..."},{"comment_id":"1703634343208850","commenter_b":"Demo's must be high on something, another unquaified and under accomplished democrat running for the highest office in the land. Jail is where she belongs.","commenter_a":"Clinton should be in jail!!!!","post_message":"Sen. Jeanne Shaheen says there's no question Hillary Clinton is the most qualified candidate in the presidential race. Would you like to see Clinton become America's next president?"},{"comment_id":"10153028935676130","commenter_b":"You should, Chris. If you think that's ridiculous, I hope you never have a daughter and have to see her treated like sh*t by some guy who doesn't keep in mind that she's someone's daughter.","commenter_a":"The relationship dynamics between a husband and wife are a lot different than between a father and daughter. Why would a man necessarily care if his daughter is nurturing?","post_message":"Spoiler alert: It's super depressing."}]
