[{"comment_id":"483365738520673","commenter_b":"Worthless hoe bag","commenter_a":"MYOB WITCH!","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10152734015363525","commenter_b":"going to get cold tonight!!","commenter_a":"Wtf...???","post_message":"Road trip to Lakewood Ranch. Who's in?"},{"comment_id":"1132568873502832","commenter_b":"Dont know. You went baiit an switch. Its about keeping these men out. Want more? @webpagelink","commenter_a":"To keep men pedophiles out womens bathrooms? Yes. I agree!","post_message":"How does this make ANY sense? Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1721466568134277","commenter_b":"SHE IS A HITLER","commenter_a":"What an idiot","post_message":"Was this a good idea?"},{"comment_id":"10153422173110329","commenter_b":"Weird","commenter_a":"@username read all the way through. This is what you're getting.","post_message":"Mom is gonna freak. An elegant homemade gift is just a few easy steps away."},{"comment_id":"699261006928857","commenter_b":"Hey Amber suck dick","commenter_a":"That was here plan NOT to help kids eat healthy but to sto kids from eating and she did a good job of it, come on Read between the lines. smh","post_message":"BYE BYE! Congress Releases SOME MASSIVE Bad News To Michelle On Her Way Out of The White House!"},{"comment_id":"858528920935448","commenter_b":"Sarah Dingle, how do you (or any Arabs or Muslims) have the courage to speak of apartheid when ISLAMIC COUNTRIES ARE WELL-KNOWN FOR THEIR GENDER-SEGREGATED SOCIEITES? That really laughable!","commenter_a":"If any Country refuses to compete in a friendly or qualifying tournament or bans others for racial reasons. They should be banned from all worldwide competitions! This is 2015!! Time to stop the hate against Israel!!","post_message":"Israel judokas were not allowed to compete in Abu Dhabi with the Israel flag on their judo uniform."}]
