[{"comment_id":"10153053080376336","commenter_b":"She should have been thrown put on her fat a**.","commenter_a":"How about firing the witch for inappropriate behavior toward our Veterans! She's disgusting!","post_message":"\"Had she been a veteran herself or served in the military, she would probably have a different thought on how she treats our veterans.\" The Veterans Affairs manager in Indiana who mocked her patients’ mental health has been placed on paid administrative leave."},{"comment_id":"1270356769653367","commenter_b":"She is so gross, just sickening!","commenter_a":"Whatever That idiot should move to Mexico","post_message":""},{"comment_id":"1582705788695822","commenter_b":"Hillary Will be President!!","commenter_a":"Liar. Killer. Cold hearted, some one please drop a house on her","post_message":"Thank you, California!"},{"comment_id":"10153128305820933","commenter_b":"Kasich and Taylor can't be responsible when a trusted employee breaks rules behind their backs. Taylor has come out strong against the actions and has expressed deep disappointment that the Trust of the people was broken... as for Spencer (Tim) Balls crazy assertions. Kasich had nothing to do with the ordeal. Spencer (Tim) Ball has a vendetta against Worthington Christian Schools. Kasich's daughters attend the school. That is the only connection between the 2.","commenter_a":"Today's Columbus Dispatch (newspaper) had a good article revealing problems in the Lt. Gov.'s house.","post_message":"Gov. Kasich stopped to greet a small group in beautiful Peterborough, New Hampshire to end the week. See you again soon, New Hampshire! #nhpolitics #fitn"},{"comment_id":"817179565047318","commenter_b":",the problem is that these companies take too much Shit from their UNRULY customers.Customerst first..What about employees?","commenter_a":"The manager did NOT make the right call which is why they are out of a job!!!! You don't reward bad behavior. Companies don't have certain people to service certain customers!!! You have problem resolution departments or resolution specialist but in this case the customer was the problem!!! Options being \"mam we can certainly deliver your item(s) or we can refund your money but we do not have special delivery people\".","post_message":"The driver says he was told \"you are black, and they don't want you at the house.\""},{"comment_id":"10152776711902014","commenter_b":"Swatting twitch users I bet!","commenter_a":"#rekt","post_message":"A 17-year-old teen from Surprise has been arrested for several \"swatting\" incidentsin which she reported fake shootings and bomb threats."},{"comment_id":"10156322425460725","commenter_b":"Maybe ISIS knew America would take in the refugees, it was there plan all along to have a easy way into America to destroy us! Lord help us all.","commenter_a":"He's a traitor, he is just a resident of the white house, he has broken the oath and is no longer legally the president","post_message":"What is our President doing?"}]
