[{"comment_id":"1179704828736654","commenter_b":"What do you expect their natural prey is vermin after all!","commenter_a":"Omen? It probably thought his hair was a nest.","post_message":"This might be the greatest story of the week."},{"comment_id":"10153065626180950","commenter_b":"He's a dayum disgrace. Im sure Subway can't believe this saga.Jared is a sicko that needed mental help yrs ago. He failed to get it & now he pays for his sordid fetish. The inmates will love that ass.. Footlong comin for your ass Jared. Ijs !!!! Karma is a bish :(+","commenter_a":"Hope you bring Vaseline for your new job interview jared.","post_message":"JUST IN: Court hearing for ex-Subway spokesman Jared Fogle ends; he \"expects to go to prison,\" his attorney says: @webpagelink"},{"comment_id":"10153232276610496","commenter_b":"Fire them, then keep your doors locked.................that is exactly why they do not need to be in this country.","commenter_a":"Not showing up for 3 days to work with no explanation...how is that part of religious freedom...that many accomodationa are not made for Christians...and if Christians prayed in front of Muslims at the same workplace, Muslims would say they were offended...kind of one sided thinking ...","post_message":"\"Prayer is the first priority to every Muslim. We can sustain without a job, but we cannot sustain without prayer.\""},{"comment_id":"1225936470775105","commenter_b":"Bye naked fool","commenter_a":"What a worthless p.o.s. go get out its types like you we need to be rid of.","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"10153898297209726","commenter_b":"I know someone that used to be a neighbor to one of Bill's party friends and Bill partied there all the time. They would bring in scores of prostitutes.","commenter_a":"Look this stuff is 20 years old. Bill chased women. A lot. Hes not the first and wont be the last man to do that lets move on","post_message":"WATCH: The central figure in the Lewinsky affair is speaking out about scores of Clinton affairs unknown to the public!"},{"comment_id":"1186097424786988","commenter_b":"Hillary you're a smart women have faith and be strong you is next President Trump dangerous","commenter_a":"Hillary, you will be a great President.","post_message":"Here’s the sad truth: There is no other Donald Trump. This is it."},{"comment_id":"1691864404387315","commenter_b":"Omg ....how adorable!! You want one Mark? Do you still have your hot tub?? You're all set! I'll baby sit for you!","commenter_a":"Signe Nielsen tror jeg har fundet dr - at passe denne lille pige","post_message":"Welcome to Chicago, sea otter pup! At 10 weeks old, this little lady was found on a California beach all alone. Now, she's got a new home at the Shedd Aquarium. See the full video and photos here: @webpagelink"}]
