[{"comment_id":"10153022390127217","commenter_b":"Stupid, sexy, popular flanders !","commenter_a":"@username 👍🏽","post_message":"Let's hear some noise for Okilly Dokilly"},{"comment_id":"1610662465894059","commenter_b":"And she should be out of a job.","commenter_a":"Yes","post_message":"\"These hands clean the rooms every single day for Mr. Trump so he can be rich.\" Meet the Trump workers who are not voting for Donald J. Trump @webpagelink"},{"comment_id":"891336577589705","commenter_b":"Americans, protect your selves!","commenter_a":"Thanks Obama","post_message":"Click to see these alarming new numbers..."},{"comment_id":"10154655136218984","commenter_b":"Makes you wonder why she's riding in a van! Not very comfortable and certainly not presidential.","commenter_a":"Not a Hillary fan but have you ever tried getting out of one of those van back seats?","post_message":"There's some new footage of Hillary Clinton making the rounds, and it's exactly what her campaign does NOT want America to see. Here's what happened to Hillary when she tried to get out of a van. This confirms a lot of things that we'd feared about the Democrat nominee..."},{"comment_id":"10153306237383984","commenter_b":"It's about d**n time......quit dragging your feet and file the articles....make sure to include all his bogus names in the charges including the name Davis","commenter_a":"If it hasn't been done by now,it's not going to happen.He might be impeached, but to actually 'remove' him from office takes a seperate action,and that's the ultimate goal.But.........don't get your hopes up. Saying and doing....are seperate issues as well!","post_message":"Wow. This guy has a lot of guts to go after Obama in this way. Do you hope his plan to take down Obama is successful?"},{"comment_id":"694257180764860","commenter_b":"Oh please, these people are untouchable or she would have had in jail a long time ago.","commenter_a":"Throw her off the face of the earth along with Obama. .that would be the best thing for this country","post_message":"Insider information surfaces that will ruin Hillary's career forever. She's finished. Let's spread this. Can we get 30,000 'LIKES' to keep Hillary out of office forever?"},{"comment_id":"10154787328718984","commenter_b":"Perhaps she should have kept her mouth shut and the White House wouldn't have to protect her!!","commenter_a":"BS....houses don't talk. We are about to witness the biggest revolt on DC and heads will be rolling. Trump will clean house literally. The most crooked leaders plus the worst media in the world. People are po'ed and WE aren't going to take it anymore.","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."}]
