[{"comment_id":"1242326225802834","commenter_b":"There are many exceptions to this, these comics are just to stir shit up, and promote dissatisfaction, imo. Live your life to the fullest and stop getting offended so much. It's not worth it, spending your life on this planet worried about what some shithead says or thinks about you.","commenter_a":"Hey ATTN, did you know there is a mass extinction going on globally? Maybe your perceptions of gender roles can take a back seat and you can do something more useful with your time.","post_message":"The double standard is all too real."},{"comment_id":"10153840747221336","commenter_b":"Let every congressman in Washington put up 10 \"refugees\" each in their own homes. The White House could take care of at least 100 of them. Just keep them out of our towns and cities.","commenter_a":"\"Stupid is as stupid does.\" - Forrest Gump","post_message":"On Monday, Governor Greg Abbott announced that he sent a letter to President Barack Obama saying that Texas will not take any Syrian refugees in light of the Paris attacks."},{"comment_id":"10152680682100950","commenter_b":"Taniesha","commenter_a":"Wow","post_message":"The police officers who discovered the 18-month-old girl dangling in a car seat inside the submerged car said they heard a mysterious voice begging for help: \"Someone said 'help me' inside that car.\" Another officer also heard the voice: \"(It) wasn't just in our heads.\""},{"comment_id":"10154145520606770","commenter_b":"Never, they're pigs. Tell them to oink off.","commenter_a":"When did they stop calling women like Kim who have no decency or moral compass pigs?","post_message":"The outfits that Kim Kardashian and Kendall Jenner wore were absolutely stunning."},{"comment_id":"1012827362091069","commenter_b":"The ugly bitch is back. She hasn't been on for a while and I hoped she had disappeared.","commenter_a":"Lay down dog","post_message":"Ann Coulter and Fox News take another step closer to flat out saying they don't want \"THOSE\" people to vote."},{"comment_id":"373714942816800","commenter_b":"these two remind me of demons..... boy are they in for a surprise on judgement day... I will pray for them.........they are so misguided........","commenter_a":"It is my understanding that there are some Seal team guys in the middle east that would like these guys to come and visit....and they will be glad to indoctrinate you about how things work in their part of the world...please make a reservation as soon as possible.","post_message":"Bill Maher joins Michael Moore in the war against Chris Kyle..."},{"comment_id":"1031214057011772","commenter_b":"Keeps women from cheating lmao","commenter_a":"So, she wants to be registered, heavily taxed, and locked up at night?","post_message":"Pure gold..."}]
