[{"comment_id":"675151445982815","commenter_b":"illegals are going back..THE WALL","commenter_a":"But according to trump and his supporters he must be either a thief or a rapist. To the people that dislike Hillary for whatever reason: \"vote for her and hold your nose\", that orange Nazi is at the door, and we can't let him in.","post_message":"14-year-old mariachi singer opens night 3 of the DNC with a rendition of The Star-Spangled Banner. Sebastien de la Cruz was 11 when he sang it at the NBA Finals, a performance that sparked a wave of racist comments on social media. @webpagelink"},{"comment_id":"10153288258378854","commenter_b":"I'm seeing a lot of CRAP posted by: Sumah Volmarius. Pretty sure she's an OBAMA COMMIE...!!!","commenter_a":"If this is true why haeve w not seen this on the news, this is outragious .","post_message":"New Executive Order: Obama Takes Total Control of Internet: Declares ‘National Cyber Security Emergency’"},{"comment_id":"10154229601211179","commenter_b":"Ash Kay- see? I'm not the only one thinking this! 😂","commenter_a":"That is sadly amusing","post_message":"via @buzzfeed"},{"comment_id":"10153109459178701","commenter_b":"Usually those people are criminals themselves.","commenter_a":"Why people defend the character of criminals, I'll never understand...","post_message":"Two people were caught on camera damaging an ATM to try and get money out of it on the Oregon Coast. After the surveillance photos were posted on Facebook, police made two arrests."},{"comment_id":"10153066062681770","commenter_b":"She will say anything to get people to vote for her!","commenter_a":"I wouldn't back her as dog catcher, the dogs never did anything to me, I like dogs. Can't stand Hitley.","post_message":"Hillary Clinton claims the National Rifle Association takes an “absolutist” stance on gun rights, comparing it to “the Iranians and Communists.”"},{"comment_id":"1065116426845174","commenter_b":"She's thick. And frankly looks weird with the stretch marks photoshopped out.","commenter_a":"Ashley Graham, the model is size 16. She's NOT EVEN PLUS SIZE. That's what's wrong!!","post_message":"You decide..."},{"comment_id":"759110204189419","commenter_b":"@username Don't come to America, lol","commenter_a":"Here's a counterpoint. If you un-sexualize all body parts no one will want sex as, hey that's just a hand and that a boob and that a....Well maybe this is what we need then to decrease the enlarged...population, LOL! Truth is, I don't respect anyone who sells themselves. Even a little bit.","post_message":"Women everywhere are freeing the nipple but Facebook doesn't want us to show it. #MicCheckDaily"}]
