[{"comment_id":"10153910482357464","commenter_b":"We don't need another illegal immigrant running our country!! Vote for Trump","commenter_a":"We don't need another Obama in office be smart!! Vote for Trump","post_message":"Spoke with Hugh Hewitt yesterday on the eve of the Nevada caucuses. You can hear the discussion here: @webpagelink"},{"comment_id":"900278129995043","commenter_b":"No","commenter_a":"They're great to look at and their love is cute and all but not sure if their personalities would work for a talk show. Maybe a dating game show would work better.","post_message":"Would You Watch? Boris Kodjoe And Nicole Ari Parker Get Their Own Talk Show On Fox"},{"comment_id":"10154905567876336","commenter_b":"Ok, time for a bragging rights bet: First, it was \"racist and sexist white males,\" then \"fake news,\" and now the Russians. What do you think next week's excuse is going to be from the Dems as to explain Hillary's loss? Aliens? The cast from Duck Dynasty? My guess is that they will say Trump flew in the Aghori Monks, a modern day Monk Order from India that practices cannibalism, to scour the US and feed on Democratic Voters as to deter turnout.","commenter_a":"She lost because she is implicated in so many lies and scandals nobody has time for that.","post_message":"\"The Russians didn't elect Donald J. Trump. America did.\" Today on \"Cashin' In,\" Eric Bolling slammed anti-Trumpers who are searching for excuses as to why Hillary Clinton lost. @webpagelink"},{"comment_id":"1386744544690006","commenter_b":"That what girls do","commenter_a":"Fucking coward .. hits him as soon as he ain't lookin","post_message":"He did not see that coming (via PrattCity Savage) #WSHH"},{"comment_id":"1011931832233204","commenter_b":"They don't really care about fetuses either. If they did, they'd be storming fertility clinics, demanding that leftover embryos be implanted in someone's uterus. No, this whole thing is about controlling women.","commenter_a":"The Republicans & Right Wing Christians are trying to take woman back to the 50's. Women should know their place, sit down & shut up.","post_message":"After seeing all the pro-lifers cheer the attack on Planned Parenthood yesterday, it's time to remind ourselves of how they really feel about human life. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"961966360614126","commenter_b":"I bet Walt Disney rolled over in his grave whenever he's found out what you become you are such a vulgar I can't even use the time lady because ladies do not act like that but I will come help you pack free of charge I don't care what you have and how many boxes how many trucks I will help free of charge just to get you out. And thank you for the promise","commenter_a":"Good","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"10154937889184885","commenter_b":"She hates white people","commenter_a":"Such hateful petty people. A day after celebrating the birth of your savior and half of you aren't following his example in the slightest. You should be ashamed, but I doubt you really are. Michelle Obama is a human being. Just like you and me. What ill will has she done to you, that you would meet her with such contempt? I am no Trump supporter and I worry about his lack of qualification, but I don't say mean, hateful things about his wife. If she is going to work on internet bullying she may need to start with those that support her husband.","post_message":"\"She's made an effort to wear accessible fashion,\" designer Tracy Reese says. \"I think Jackie (Kennedy) was a great role model but she wore a lot of couture, and things that most Americans could not afford.\" Mrs. Obama, she says, has worn both high-end and moderately priced fashion."}]
