[{"comment_id":"510712935755721","commenter_b":"...via the food scraps from their Whole Foods trips found in dumpsters! Now I see the trickle!","commenter_a":"This sounds like a problem that a few more tax cuts for Billionaires will fix. It's really simple. You give ALL the $$$ to a few people, and then it just \"trickles down\", and eventually reaches the homeless.","post_message":"A 2015 report found that an estimated 44,359 homeless people live in LA County — a 12% increase since 2013."},{"comment_id":"928764863812971","commenter_b":"She would be a nightmare! She can't even run a business.","commenter_a":"No.","post_message":"It's official."},{"comment_id":"10154291975578701","commenter_b":"Looks like he will have plenty of room for some illegals there","commenter_a":"Must be nice when all we have is homeless people living on the streets working their ass off just to get by","post_message":"The house was built in 1928 and has nine bedrooms and eight-and-a-half bathrooms. It was sold in 2014 for more than $5 million."},{"comment_id":"10153831793476438","commenter_b":"Celine O'Hara maybe you are the one biggest fucking idiot !!!","commenter_a":"After he was done introducing Trump, I fully expected Trump to say to him, \"Now shut up and go home.\"","post_message":"Will somebody please help Chris Christie? Seriously: Is this a hostage situation? @webpagelink Christie does not seem to enjoy serving as Donald Trump’s hype man. Like, not at all. Do you see any hint of joy as he introduces Trump at his press conference in Palm Beach tonight? This is a hostage who is reading a statement with a gun pressed to his back."},{"comment_id":"10153446505791130","commenter_b":"I prefer the Wicked Witch is dead!","commenter_a":"Olha, Fer Montano!","post_message":"A songwriting expert reveals the reason."},{"comment_id":"10152700014751167","commenter_b":"Also there, Christians killing Hindus .","commenter_a":"And there was that situation in India a few years ago with Buddhists and Hindus killing each other.","post_message":"\"When you take Christianity, Judaism, Hinduism, Buddhism, whatever, their combined killings in the name of religion -- well, that would be zero.” #FoxNewsFacts"},{"comment_id":"10153659682115399","commenter_b":"Really? In what way could Trump have forestalled the Syrian refugee crisis?","commenter_a":"If Trump would have been in charge before this, these horrendous wars and humanitarian crisis may not be going on. It appears that Obama is way out of his league. #trumpforpresident","post_message":"Reminder: More than 100 people were killed and more than 350 injured in the coordinated terror attacks."}]
