[{"comment_id":"10156258730695725","commenter_b":"Come to grand junction","commenter_a":"medias are crooks ...liars liars and liars gooooo trump you still got my vote and my whole family","post_message":"After a great evening and packed auditorium in Iowa, I am now in Colorado looking forward to what I am sure will be a very unfair #GOPdebate!"},{"comment_id":"517019608487085","commenter_b":"Hell no, they can NOT stay! They are all guilty of a criminal offence. They are here ILLEGALLY, you dumb...","commenter_a":"The only path they should get is the road to the border where they would be deported.","post_message":"\"For the 11 and a half million who are here illegally, if they've not committed a crime since they've been here, I would give them a path to legalization.\" Today on \"Fox News Sunday,\" John Kasich discussed immigration."},{"comment_id":"10153507506919877","commenter_b":"Wendy get a life","commenter_a":"People always get offended when you say that you love dark skinned women. For some reason we have been deemed as \"too masculine\" or \"dirty looking\" or \"just unattractive\" because some how all dark skinned women everywhere are all unattractive *insert eye roll here*. We don't have the standard European features so when people say they love us they get offended and say \"well what about the rest of us?!\". No one said that he wouldn't date other races but he loves dark skinned women. Good for him because we are some beautiful women indeed!","post_message":"Mack Wilds Professes his Love for Dark-Skinned Women...and Wendy Williams Gets...Offended? Watch the clip below. Grio fam, what do you think of the young actor's remarks?"},{"comment_id":"10154282712736409","commenter_b":"Exactly! We would not have over 8 million illegal immigrants if not for Obama. Now the President that follow him has to figure a way to clean up his mess.","commenter_a":"Irony: everything that Trump is doing, including building a wall, was set in motion by establishment Democrats.","post_message":"Fox thought the border wall reference was \"too controversial to air during the Super Bowl.\""},{"comment_id":"10152867281821051","commenter_b":"Give it your best shot bitches","commenter_a":"Full of crap","post_message":"ISIS just announced the specific targets they’re looking to blow up – including the American ones."},{"comment_id":"1574139022896040","commenter_b":"Put this animal to death!","commenter_a":"Yeah, good luck with that.","post_message":"The Attorney General is required by ethics regulations to avoid even the \"appearance\" of a conflict of interest. She has clearly violated this regulation. SIGN THE PETITION to join us in demanding her resignation."},{"comment_id":"10154254205206179","commenter_b":"Yes, the man who was accused of racism 30 years ago despite being a legal champion of civil rights when it mattered, showing he can actually put personal beliefs aside and do his job when it counts. Can't have someone like that as attorney general. He might actually enforce the law.","commenter_a":"She knows the rules. . She was warned. . She broke the rule. . She was disciplined. . The rules are arcane, but then crying cause y'all don't get your way, well please! #growuppeople","post_message":""}]
