[{"comment_id":"10153153203728525","commenter_b":"The girls that go there will be fine.","commenter_a":"If you think this is funny just know that you're wrong and a terrible human being. This is the reason that young girls are raped and abused, because \"boys will be boys\". Or they were 'asking for it'. We've become a society where men can get away with sexualizing everything but its okay but they're boys and it's in their nature. But good to know that half of you people (that are most likely all parents) are okay with your daughters being looked at as nothing but a piece of meat.","post_message":"Imagine rolling up to drop your daughter off at college for the first time and seeing this: @webpagelink"},{"comment_id":"1766049700310185","commenter_b":"She better look deeply into Muslim beliefs and get used to sexual assaults because these heathens think it's their right","commenter_a":"The White House is warning Trump not to retaliate against her. Is that a red line? They going to write a mean letter to him if he does?","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."},{"comment_id":"10153439402362550","commenter_b":"How about instead of locking our doors, we teach thieves not to steal?","commenter_a":"How about instead of teaching our girls how not to get raped, we teach our boys to not rape?","post_message":"California high schools are the first in the nation to teach a new form of sex education instead of \"no means no,\" students will learn that \"yes means yes.\" Details here ---> @webpagelink"},{"comment_id":"921881311183439","commenter_b":"Obama go home to Kenya. Illegals go back to countries you came from. Need to help our own not illegals who drain our economy and increase our national debt......","commenter_a":"Dumbama suck donkey dic","post_message":"Will you accept Obama's latest \"order\"?"},{"comment_id":"1118758671477300","commenter_b":"Illegal immigration is what Americans are against Trump for president 2016 !!!","commenter_a":"Biden doesn't speak Spanish either. I bet he had a huge crowd","post_message":"Joe Biden went to Mexico on Friday and delivered a clear message: The views of Trump absolutely do not represent the views of most Americans. Do you agree with the VP?"},{"comment_id":"10157076515550354","commenter_b":"Agree . No one uglier or nasty except her daughter !","commenter_a":"Where's my $$$? Ohhhh...she wants online trolls who will say something good about her....my mistake...","post_message":"SURPRISE!"},{"comment_id":"10153862948491523","commenter_b":"You think women put these objects in themselves? This was a product recommended and approved by from their doctors. STFU","commenter_a":"Stop putting foreign objects in your body!","post_message":"Some of the women experiencing adverse affects from Essure are relieved to get hysterectomies to get the coils out."}]
