[{"comment_id":"10153749043211159","commenter_b":"Our Country? Go back to Iran you POS!","commenter_a":"no","post_message":"The White House is back on it..."},{"comment_id":"1216236868472563","commenter_b":"I'm all for it and We will let Yall have all of our democrats too","commenter_a":"Can we please please please have a vote on splitting the united states into the union and confederate states? Let the confederate states figure out first hand what \"do nothing\" politics really does. The north is already outperforming the south in money and academics, and they aren't so cruel either, but the south will never admit their shortcomings ever and at this point they are just a huge drag.","post_message":"The plan relies on individual tax credits to allow people to buy coverage from private insurers."},{"comment_id":"1272474692787949","commenter_b":"She looks very ill, mentally, emotionally, physically and spiritually.","commenter_a":"Fuckin mental!","post_message":"WHY. WON'T. YOU. LEAVE? You're like that nasty drunk chick who won't leave the party after it's OVER."},{"comment_id":"873396172789454","commenter_b":"Taking our RIGHTS to to fulfill your agenda is not going to happen. Do you have armed security? I bet if a person walked in and brandished a weapon he/she would be taken out by a person you hired or are in connection with you and your party that is wielding a gun. You would say its protection...... We say the same thing.... It is for Protection.... While you want to make guns illegal for law abiding citizens to obtain, you will only make it Illegal to own them. Causing a bigger issue for some. People will always have guns. Ask a Drug dealer if they have issues getting illegal drugs.... NOPE. they will straight laugh at you. All you are doing is wasting taxpayer money and time. If you want to make change, ban together to reform Immigration to be fair and swift, Vote laws to tax churches to ...","commenter_a":"Real action","post_message":""},{"comment_id":"575480735957321","commenter_b":"I'd rather listen to a milk cow","commenter_a":"Go 3rd Party!","post_message":"Watch the final night Republican Convention live with NPR and PBS NewsHour. Donald Trump accepts the party’s nomination tonight and makes his case to be the nation’s next president. Scheduled speakers include: Brock Mealer, Marsha Blackburn, Mary Fallin, Lisa Shin, Reince Priebus, Peter Thiel, Tom Barrack, Ivanka Trump and Donald Trump."},{"comment_id":"861148387265123","commenter_b":"Female racist-in-chief.","commenter_a":"-who is she to make that decision, no man has that right - God creates life!","post_message":"What sorts of \"populations\" does it sound like Ruth Bader Ginsberg is interested in \"controlling\" here?"},{"comment_id":"10153302910759087","commenter_b":"But the sheep love the Queen of BS and her Lies, Hillary the evil millionaire theft by deception. and lair","commenter_a":"Carly doesn't back down from a fight. I would NEVER go on that show after that BS. She's a better woman than I!","post_message":"“My message to the ladies of ‘The View’ is, ‘man-up,’” Carly Fiorina said. “The Obama administration, for example, has been bad for women. Planned Parenthood is harvesting body parts. If you don’t like those facts and those messages, than man up and debate me on them. Don’t sink to talking about my face.”"}]
