[{"comment_id":"10152987213175090","commenter_b":"She is a liar!!","commenter_a":"'What difference does it make'!","post_message":"Why don't you want Hillary Clinton to be President? @webpagelink"},{"comment_id":"10154202595341178","commenter_b":"MIKA needs to SHUT UP! Just vote in HILLARY Mika. that is who your candidate is isn't it?","commenter_a":"Anything for ratings!!!","post_message":"MSNBC host has MAJOR tantrum on live TV! #TTT16"},{"comment_id":"10153233109924170","commenter_b":"DEPORT ALL ILLEGALS !!!!!! Put Americans back to work !","commenter_a":"hes an idiot","post_message":"Chuck Schumer is doing his absolute best to play the blame game in regards to his terrible immigration bill. ...And it's all about paving the way for 2016 race-baiting."},{"comment_id":"10153060645251350","commenter_b":"And you'd win a beauty contest for sure ...","commenter_a":"She's so ugly. She has a mouth the size of a horses mouth","post_message":"What do you think: Is this a subtle pregnancy announcement or just a cute silly photo from Beyonce?"},{"comment_id":"1159811677403083","commenter_b":"The white chic yells her ancestors owned their ass, and then yells black people don't belong in America. Huh. So when. Her ancestors bought the black people and SHIPPED them to America, the black people should go back to Africa? REALLY??! WOW. Unreal...smh... KKK at its finest!","commenter_a":"more a condemnation of them and their ancestors than the person they directed this filth at","post_message":"This is just wrong."},{"comment_id":"1575163439454943","commenter_b":"Thank God for this smart young man I hope he can get thru to these thugs who have done this.","commenter_a":"I tip my hat to this young man who certainly possesses a depth of wisdom and pray he and many more like minded can be first to reach out in some way that only he and others are acceptable for the larger purpose TALKING to others about the failure that they have caused but need to turn back to!!!!","post_message":"One Milwaukee resident has a message for rioters destroying his community. And it completely DEFIES the liberal media's narrative."},{"comment_id":"10154336216583010","commenter_b":"An illegal aliens will take the job for pennies on the dollar...or a machine will replace you.","commenter_a":"But..but, if we raise minimum wage and pay people overtime, that would just create \"Dependency\". Then everyone who works for a living will expect to be paid a fair wage. Because you know, minimum wage jobs weren't meant to teenagers the hoopnard tractor socks because the hoodad ya ya. You're not supposed to pay for stuff like luxuries like food and rent because inflation. Death. Destruction. Burger flipping robots, twenty dollar Big Macs, dogs and cats sleeping together, locusts with the face of man, all because a soldier gets less than a french fries cook. Benghazi. Save up 112 years and go to school if you want $15 an hour, moochers ! Tuition isn't that expensive if you sell a kidney. You have TWO, stop feeling entitled to your organs. If you really want to help people get ahead, give MORE TAX breaks to the rich and keep the gay ...","post_message":"More than two-thirds of Californians support the state gradually increasing the minimum wage to $15 an hour."}]
