[{"comment_id":"1036501259720547","commenter_b":"If illegals are going to remain here what difference does it make?","commenter_a":"Trump/Cruz will have my vote.... but if Trump is not on the ballot......don't expect me to cast one","post_message":"Ted Cruz explains why he thinks \"2016 is going to be an incredible year.\""},{"comment_id":"161828217554597","commenter_b":"Racist bitch","commenter_a":"The racist white ppl that support Trump never show black ppl in a good light!! Never!! @username is the most racist of the right-wing, white supremacist sites!","post_message":"After the Louisiana flood, this man started wondering when the help from Black Lives Matter and Black Panthers would be arriving... The TRUTH is devastating..."},{"comment_id":"10153700802697235","commenter_b":"Untrue. Unfair. The DC snipers were/are referred to as mentally ill, not as \"thugs.\" I can't think of another black mass shooter offhand. Most U.S. mass shootings are either non-blacks with histories of mental illness, or gang/drug related shootings committed by blacks.","commenter_a":"It's because he was white. That's why now it's about mental illness next week a black kid will be a thug or a menace to society","post_message":"This is a big lie we're always told so that we can avoid talking about the obvious -- GUNS."},{"comment_id":"10153249235547894","commenter_b":"here Sharnise Nisec Brown since you are behind on the times lol Lauren Payton Katrina Elizabeth","commenter_a":"Zanehya Rayshaun Corleone","post_message":"Exclusive: K. Michelle Opens Up About Her Relationship with Idris Elba and Backlash from Black Women: ‘The Women I Fight For Have Been The Women That Attack Me’ [Video]"},{"comment_id":"1543012149092242","commenter_b":"Awww you pathetic little slut... Let me guess, yo baby daddy is black....","commenter_a":"Its funny because in the 5th grade i refused to stand for the flag, 5th grade and i already knew this country was crap and lacked concern for its citizens. My friends grandfather was a vet from vietnam and she refused to stand for the flag out of how this country treated its troops. And she had every right and justification. You guys are missing the meaning behind the flag, you cannot just take the good of a country and claim thats all the country is. There is injustice that is constantly being negated by people like you, and those in these comments, simply because you haven't experienced it. Get over yourself and your terrible nationalistic views about a country that couldnt care less about you. Reality is reality, that flag represents a government that openly allows racism to grow and continue in our judicial and enforcement systems.","post_message":"This store owner planned a signing event with Brandon Marshall but when Marshall protested the national anthem, the owner cancelled the event immediately... but what the owner did next is going viral. Good for this owner... he's a true patriot."},{"comment_id":"939497619530050","commenter_b":"She is a she!!!!!","commenter_a":"People can't see that this is a case of mental illness. I'm all for freedom of expression, but this is a cry for help.","post_message":"He calls it beautiful. You might call it disturbing. He removed his ears, tattooed the whites of his eyes, and did lots more in his transformation from Robert Hernandez to Tiamat, the Dragon Lady."},{"comment_id":"515846775249931","commenter_b":"Does she know how ugly she is?","commenter_a":"Why would I care what a celebrity thinks or says.","post_message":"\"Oh, Donald Trump is whining about attention now?\""}]
