[{"comment_id":"1774855949444875","commenter_b":"Really are we surprised??? He has been committing political suicide for over a week now and handing it to Hillary with the comments about over weight women, his tax evasion, and then of all things to attack the vets???? Pitiful win if you ask me and sad that she is not winning with a landslide.","commenter_a":"Pence is going rogue! :):) He's pulling a Sarah Palin....he's running in 2020! :):):)","post_message":"A new poll in one key battleground state shows Donald J. Trump's campaign facing some trouble ..."},{"comment_id":"10154028893376051","commenter_b":"He is going to build a wall. Send back the goobacks and bomb Isis. Has my vote. If he triples the debt the libtards shouldnt mind. They have no concept of paying bills.","commenter_a":"Does that mean that Trump will put the country in more debt than it has been before him? Does it mean that Trump will instigate a covert plan to arm terrorist nations? Why exactly is that a good thing?","post_message":"Brexit leader Nigel Farage says Donald Trump reminds him of a modern-day Ronald Reagan. Will you be supporting Trump this November?"},{"comment_id":"1536859509948075","commenter_b":"I don't want your butt in my face! Haha","commenter_a":"@username think we could do this?! Haha","post_message":"That feeling when you've made it to Friday... via JukinVideo"},{"comment_id":"10153784446624203","commenter_b":"@username-She answers questions, she just doesn't give you, narrative you want hear-why should she. It amazes me, the vagina remark! Must be nice to have 240 years of men. Too bad it's not you electing, the first male President. Try reversing that and how would that feel? Oh and a lot our Male Presidents, haven't been real Winners. CONgress mostly MALE-mostly FAIL!","commenter_a":"Clinton is dead in the water. Mass media is bought and paid for. Sanders for President!","post_message":"\"Hillary Clinton may have trounced the men at Tuesday debate, but 2016 isn likely to be the year we get our first woman commander in chief.\""},{"comment_id":"10153513194301157","commenter_b":"Sorry kill traders Isis is out to kill innocent people that trader should lie down 6 feet under","commenter_a":"13 year veteran, can't trust anyone anymore!","post_message":"A Washington D.C. Metro Transit Police officer has been charged for trying to provide material support to ISIS."},{"comment_id":"10155755235340725","commenter_b":"U mean I have to marry ur ass!? Ugh","commenter_a":"Patti McGough, let's meet at Daley center on tuesday.","post_message":"#BREAKING: Supreme Court rules all gay couples have a constitutional right to marry-----> @webpagelink"},{"comment_id":"10154664283754778","commenter_b":"We can see all the ex cons..right in this thread...","commenter_a":"He would look good in any back alley dumpster","post_message":"\"If I had to bet, I would say to Kalorama or a neighborhood called Mass Ave. Heights.\" Where do you think?"}]
