[{"comment_id":"10154055081001770","commenter_b":"Those girls are too skinny. They need to put some meat on those bones before they could be sizzling","commenter_a":"sizzling...but was she a Hillary voter?","post_message":"Are these sizzling photos too much for the internet to handle?"},{"comment_id":"10154465845766162","commenter_b":"This is different, this girl has some evil in her!!","commenter_a":"Huh? Well that's just stupid. I tell you to jump off a cliff, and you do it... You're the idiot.","post_message":"A teenager who sent her boyfriend dozens of text messages encouraging him to take his own life and told him to \"get back in\" a truck filled with carbon monoxide fumes must stand trial for involuntary manslaughter: @webpagelink"},{"comment_id":"1207587629262246","commenter_b":"Yeah they're adorable haha, the way they move :D","commenter_a":"@username they are so cute lol","post_message":"<3 penguins Watch the full video here: bit.ly/1Fxpjfk Video by John Downer Productions. Music composed by Will Gregory. Video edited by Matthew Gordon."},{"comment_id":"666489030205380","commenter_b":"Get the hell out of our country","commenter_a":"I though you were leaving the country Rosie, what's keeping you?","post_message":"Get comfy, Rosie!"},{"comment_id":"1097911176909250","commenter_b":"So... Nazis ok? It's the very nature of Islam that poses the problem isn't it? Do you really want to populate your country with people who follow a religion that is also a supremacist ideology? Is it your argument that it's hate that motivates people to not want to allow mass immigration of people that follow this system of belief? I would say that's a very irresponsible and naive view. Who do you have a greater duty to? If you think it's to the millions of immigrants living in countries with terrible histories of violence, terrorism, misogyny, and rape I have to say that is not kindness at all. Don't you understand that real people in your country are going to die and get raped because people think like you? Where do you draw the line. There are billions that would love to pour into our countries because our values ...","commenter_a":"Go back home and fight for your freedom instead of coming to western countries and committing crimes and raping.","post_message":"This photographer traveled by raft with refugees headed to Europe. The images he captured are a rare glimpse into the greatest refugee crisis since World War II."},{"comment_id":"627774310707730","commenter_b":"Kathleen, you're an illegal alien","commenter_a":"This is very offensive. 1) I am well educated- I even completed a College degree. 2) I am not a racist or a bigot. 3) I love America Deeply and believe in her core principals. I am voting for Trump. I voted for him in the primary's and I will vote for him at the national level if he makes the ballot. I have been a registered Republican Since GW was voted in Office. Now I can agree that Mr Donald Trump can at times speak without discernment; however it is my opinion rather my belief that he is best suited for the position given the day and age we live in. You can not practice Islam without shariah law- they go hand in hand. It surprises me that persons with liberal views- LGBT- Freedom and separation of Church and state- Equality for all races- ages and gender- would open ...","post_message":"Yep."},{"comment_id":"1085651791446290","commenter_b":"I say shut them down. There are many clinics for health reason, but NOT abortions! We need to STOP abortions (murder)!","commenter_a":"health screenings,fine..but why do our taxes have to pay for birthcontrol??Tell me again, I don't understand....","post_message":"Americans want funding for women's health."}]
