[{"comment_id":"694257180764860","commenter_b":"Oh please, these people are untouchable or she would have had in jail a long time ago.","commenter_a":"Throw her off the face of the earth along with Obama. .that would be the best thing for this country","post_message":"Insider information surfaces that will ruin Hillary's career forever. She's finished. Let's spread this. Can we get 30,000 'LIKES' to keep Hillary out of office forever?"},{"comment_id":"1272474692787949","commenter_b":"She looks very ill, mentally, emotionally, physically and spiritually.","commenter_a":"Fuckin mental!","post_message":"WHY. WON'T. YOU. LEAVE? You're like that nasty drunk chick who won't leave the party after it's OVER."},{"comment_id":"10155114674037558","commenter_b":"One sick BITCH!","commenter_a":"Let me make this clear! We paid taxes to support our children completely in our schools. We did not pay taxes to make you richer, honey... Getting a fat paycheck to make inappropriate jokes about hungry children is not funny to the best of humanity - Just to you! Ms. Rich Monster - (Your Word)","post_message":"You put these Republicans all in one room and they say some evil things."},{"comment_id":"10153253318118188","commenter_b":"I don't see women chomping at the bit to be garbage men, roughnecks, boilermakers, crab fishers, or construction workers.","commenter_a":"She's a joke!","post_message":"ICYMI:"},{"comment_id":"10153378576094087","commenter_b":"*you're","commenter_a":"your a SKANK!!!","post_message":"First Lady Michelle Obama and SNL player Jay Pharoah spit a sick bunch of dope rhymes in a new CollegeHumor rap video about how awesome it is to go to college. WATCH:"},{"comment_id":"1292895457407386","commenter_b":"FFFFFFFFFFFFFFFFFFFUUUUUUUUUUUUU UGLY BITCH","commenter_a":"Frau Kraut...... you have destroyed Germany ... so shut up.","post_message":"Why would Merkel think issuing Trump a not-so-thinly veiled warning, on the day after his amazing win, was a good move politically?"},{"comment_id":"10153443453313145","commenter_b":"It's not the agents it's the folks who can't seem to follow simple instructions or get grumpy when asked to do what everyone else has to.","commenter_a":"I fly weekly and it is always slow. Putting the tourist with five kids in pre check just slows it down even more. Nothing at OIA is for the business traveler only the tourists. Wish I had a choice of airports","post_message":"A study of the speed with which TSA agents get passengers through security lines at Orlando International Airport shows that times aren't what airport officials want to see. So how have you're experiences at OIA been?"}]
