[{"comment_id":"618627604994485","commenter_b":"Right on Nicholesa and Aaron. From the word go, you could see that she was a south side of Chicago ghetto girl and she hasn't learned a thing being with the \"swells\". She is an embarrassment.","commenter_a":"Poor little rich bitch wants out sympathy. She should give us hers for all of our money that she's waster. What an ugly greedy ungrateful woman she is. We have never ever had a first lady worse in OUR white house. She is a despicable human being.","post_message":"Michelle Obama wants America's sympathy for all that she has to put up with. Nobody cares. What a joke. Do you agree Michelle Obama should keep her mouth shut?"},{"comment_id":"1720045178285132","commenter_b":"She didn't make it running for president what makes her think she can do it for VP","commenter_a":"SHUT UP","post_message":"Donald Trump would be \"shellacked\" in a general election showdown with Democrat Hillary Clinton, Carly Fiorina said after being named Ted Cruz's running mate."},{"comment_id":"10154784802599575","commenter_b":"arrest her before she flees the country!","commenter_a":"If she had any tact, or respect for the people who voted for her she would of made a speech last night.","post_message":"Hillary Clinton is expected to speak very soon from New York after losing the election to Donald Trump. We will live stream her concession speech on our Facebook page and in this post."},{"comment_id":"10154432155426509","commenter_b":"she is a liar","commenter_a":"In the end, She got voted because of her gender. Not saying she is bad, she is decent candidate but this woman thingy got to stop if she truly want to become a great president.","post_message":"\"In my second century, I look forward to seeing a woman president.\" She's 102 years old, and she turned out to her Iowa caucus to support Hillary Clinton: @webpagelink"},{"comment_id":"10153999197086623","commenter_b":"She needs those basement dwelling super predators!","commenter_a":"PLEASE!!!! Don't let the opinions/directions of others, polls, political analysts and outcome predictions determine your participation in the voting process. Register*… Vote… Exercise your right to be heard! *If you are not registered, in some places you may do so in person up to and through election day. Contact your state government voter organization or @webpagelink for more information.","post_message":"\"There is a platform now. I reflected on the things I've heard her say, commit to and seen in writing, and that's how I came to my decision.\""},{"comment_id":"10154331117659411","commenter_b":"News Flash: You've probably used the bathroom with a Trans person and not even known it. You know what Gender Neutral bathrooms are good for? A dad being able to use a changing table because those things are all to rare in the men's bathroom. Gender Neutral bathrooms make sense and honestly if you're so worried about your kids then go to the bathroom with them. Oh wait! Women can't go in men's bathrooms with their sons so their sons have to go alone or go into a women's bathroom just to piss.","commenter_a":"He wasn't even transgender. Criminals will break laws no matter what and being trans is not a mental illness!","post_message":"The girl mother, who was in the adjacent stall, heard her daughter screams and rescued her, while restaurant patrons held the suspect until police arrived."},{"comment_id":"465830173607563","commenter_b":"Bossy bitch!","commenter_a":"Just ban Michelle.","post_message":"Should We Ban This Word To Please Michelle? Comment 'yes' or 'no'."}]
