[{"comment_id":"1525627194121061","commenter_b":"no one wants californians","commenter_a":"Why, Canadian provinces are constantly talking about seceding from Canada.","post_message":"Canadians are inviting Washington, Oregon, and California to secede and join Canada."},{"comment_id":"1060479207341941","commenter_b":"@username you are stupid and Crystal takeaway from drugs looking for help never is to late for live free of drugs jajajaja jajajaja jajajaja.","commenter_a":"Hillary for Iowa the best candidate for president and 2016. Go @username go.","post_message":"5 days to Iowa!"},{"comment_id":"10153780029707232","commenter_b":"And until the punishment is worse people will keep doing it! Idiots","commenter_a":"Wow! he only got tickets.. texting and talking while driving is just like ( being under the influence) he could of killed someone.","post_message":"A driver who was texting on his cellphone crashed into a Delaware home, causing major damage, according to police. STORY HERE: @webpagelink"},{"comment_id":"1787645241556279","commenter_b":"They look beautiful, professional and feminine. Certainly classy women.","commenter_a":"These are first class ladies No attitude","post_message":"There's great symbolism in Melania Trump and Ivanka Trump's inauguration style."},{"comment_id":"844439005656552","commenter_b":"breaks my heart to see what my son and brother actually see. These people don't just mad out on red and green. When they see anything that has a red or green in it. They don't see it with the colors they can interpret. So nothing is as it should be. You need red to Make purple, purple doesn't appear the way the rest of us see it for them.","commenter_a":"Sylvain St-Arneault","post_message":"Watch people see color for the first time thanks to these high-tech glasses."},{"comment_id":"904173296345590","commenter_b":"For the amount it too severe a sentence","commenter_a":"YES!!!!!","post_message":"Weldon Angelos is serving a 55-year-term for the sale of about $1,000 of marijuana. By the time he's out, he'll be in his 70s."},{"comment_id":"10153009294016680","commenter_b":"Why doesn't he run for Lt. Governor and Dog Catcher, while he's at it! 😡","commenter_a":"Who says money can't buy you elections - er, I mean, caucuses. Now he can continue to get paid for doing a job he won't be doing while he is attempting to further his political ambitions.","post_message":"Rand Paul is closer to getting his way. | AP Photo @webpagelink"}]
