[{"comment_id":"10152992527222507","commenter_b":"You talk to your momma like that with those cocksuckers?","commenter_a":"That bitch been a racist with that shit on top of head suppose to be some hair looks like a hat","post_message":"Explains so much"},{"comment_id":"10153723467413984","commenter_b":"Wow what a woman","commenter_a":"You FOOLS! Let this American citizen out of jail and start concentrating on REAL illegals in this country! You have totally lost track of reality! In my 65 years on this planet I have never seen the U.S. Government be so dysfunctional as it is right now!","post_message":"Amazing. Kim’s 21-year-old son has just stood up for his mother in a HUGE way after she was ordered to jail, and it speaks volumes. Do you support Nathan Davis?"},{"comment_id":"10153112992879753","commenter_b":"How extremely sad... :( and the parents were to take CARE of her. The boy should be taken away...","commenter_a":"they need to be charge my grandson only has to say his ear hurt and it time to do something they are painful so put them away","post_message":"One-year-old Hope Delozier died from an ear infection because she couldn't count on the two people she should have mattered to the most. BS excuses. @webpagelink"},{"comment_id":"10152899242557144","commenter_b":"Illegals Charlotte, illegals.","commenter_a":"\"We\" need to take care of our country first. We still have veterans dyeing before they get an appointment. Don't tell me about Mexicans.","post_message":"Wow."},{"comment_id":"10155023002574740","commenter_b":"Leave that girl alone","commenter_a":"Shepard Smith Reporting Donald Trump President of USA doesn't want the media or anyone announcing his plans to defeat Isys enough already of selling our plans out globally, do like Donald Trump says we're going to take action without letting them know when, stop @username with telling Isys our plans","post_message":"The Office of Government Ethics is asking The White House to investigate Kellyanne Conway over her remarks regarding Ivanka Trump and Nordstrom. @webpagelink"},{"comment_id":"10153736602849749","commenter_b":"@username - Why does Europe have to take these refugees? So many are military aged men. Why aren't they staying in their country and fighting to save it? Militant Islam is dangerous whether you agree to it or not. Letting these people into your country will diminish your country because these people will demand that you accommodate their religion and their way of life instead of them making an adjustment because they are guests. They will demand changes in established laws because they will not conform. These are not bigoted statements. These are facts that are easily verified.","commenter_a":"Why do militant atheists support the arrival of (militant?) Islam into Germany?","post_message":"German police spray left-wing protesters with a water cannon to keep them apart from an anti-Islam demonstration. See more: @webpagelink"},{"comment_id":"10154992215446729","commenter_b":"Stephanie Hallstrom Hillary is from Chicago.....send her back there. They grew her. They can keep her.","commenter_a":"You can see her jerking several times prior to falling / collapsing. Clearly from a seizure people know the difference. She should stop her thirst for greed and power and live her life and take care of herself in the private sector for herself and the American People. It was not weather people were there saw others in worse health and heavier clothing...she came out wearing same clothes as before. She is not well. Go Home Hillary!!","post_message":"Help get this out there, folks! People need to know the TRUTH."}]
