[{"comment_id":"10153661567171336","commenter_b":"This thug lady needs whatever the cops want to do to handle thugs","commenter_a":"So breaking the law is okay, right @username?","post_message":""},{"comment_id":"1118654024897515","commenter_b":"Chemo is poison!","commenter_a":"Nicole, how insensitive can you get? Chemo? with all of the cancer survivors and sufferers fighting their disease with GOOD lifesaving chemo? Hope you never need CHEMO. Trump is not CHEMO. He IS POISON.","post_message":"“The Trump supporters see Trump as political chemo. He may be toxic. He may kill every healthy cell in the bloodstream. But he is the only cure for the cancer that is Washington establishment.” - Nicolle Wallace"},{"comment_id":"10154836635824916","commenter_b":"Yeah, he's almost as bad as Hillary! Why would anybody ever vote for either of those criminals!","commenter_a":"Of course. . . . The man is a business man being sued, up one side and down the other. He lied, often in the same speech. . . . He says wgatever pops into his head.","post_message":"It's going to be a rough four years for progressives, but Trump fans aren't headed toward happiness either."},{"comment_id":"10154009145851336","commenter_b":"She needs to rot in hell","commenter_a":"Problem is she's been in the public eye for way too long!!!","post_message":"“She is a good, smart, tough person who cares deeply about this country, and she has been in the public eye for a long time and in a culture in which new is always better,\" President Barack Obama said about Hillary Clinton. Do you agree?"},{"comment_id":"10152703267277217","commenter_b":"64% of voters didn't vote for the Conservatives in 2010, so not that popular.","commenter_a":"Best PM ever. Don't even know why the others have bothered...","post_message":"What do you make of David Cameron's cufflinks? Follow our UK election coverage: @webpagelink #GE2015"},{"comment_id":"10153965773226491","commenter_b":"Jenny Minttych, nice fat shaming other women. Shallow.","commenter_a":"No comparison, diet and genetics are different from those days, every generation gains on the next in height and build.","post_message":"See how a size 8 has changed through the ages."},{"comment_id":"10153146090320667","commenter_b":"Watch out she's going to report u lmao","commenter_a":"Go get a life,","post_message":"In about three days, the group has collected 30,000 signatures."}]
