[{"comment_id":"10153784799867894","commenter_b":"Andy needs to fire her ! #GoodBye2BasicBitches","commenter_a":"@username another storyline to stay on #RHOA","post_message":"It’s Really Over! Cynthia Bailey Announces Plans to Divorce Peter Thomas: ‘I Just Don’t Want to be Married Anymore’"},{"comment_id":"10153722269186680","commenter_b":"Helene....her supporters have jobs....what planet do you live on ???","commenter_a":"Trump draws crowds of 15k, while Hillary can't draw 100 people to come to her rallies, yet the polls say that Hillary is ahead....something smells foul.","post_message":"The independent says he'll continue to find ways to support Hillary Clinton and defeat Donald J. Trump."},{"comment_id":"10153310344686157","commenter_b":"If she gets droped off by the bus shes to young for you bruh","commenter_a":"If her shoes light up when she walks she is too young for you bro.","post_message":"Investigators believe 23-year-old Estevan Garcia sent naked Instagram photos to a 14-year-old girl. He worked for the Donna school district as a security guard."},{"comment_id":"1142065182546406","commenter_b":"Bye... That just means another wall.","commenter_a":"California can secede from us like texas did. Theyre their own entity but it comes with a price to pay. The time when earthquakes peel it off the rest of the world they can b their own saviour!","post_message":"They're calling it #Calexit"},{"comment_id":"591215384344977","commenter_b":"Wash your mouth lady!","commenter_a":"Ummm it's not a white thing, it's a hygiene thing.....","post_message":"Imagine if a Republican had said this about Black people...... They'd be destroyed."},{"comment_id":"882098448492244","commenter_b":"I think this witch would sell her own Daughter for a ticket into the white House . How many Free rides will this traitor Promise to illegal criminals to get her to her socialist/communistic palace . ??????","commenter_a":"NO NO NO .DO NOT ELECT THIS PERSON.","post_message":"Hillary can't keep track of what she says!"},{"comment_id":"10156238965050354","commenter_b":"Hillary isn't change She is Washington She is the establishment Everything that is wrong with America Is what Hillary represents!!!!!!","commenter_a":"Are lawmakers going to allow themselves to be sued when a citizen is killed because they can't protect themselves?","post_message":"DEVELOPING..."}]
