[{"comment_id":"1618315388221218","commenter_b":"Disgusting. The trolls perpatrating this clearly have issues with yor mammas.","commenter_a":"I sure hope so","post_message":"She's got to be scared..."},{"comment_id":"491024294436506","commenter_b":"@username you are a horrible racist pile of feces. You're worthless.","commenter_a":"I take offense at The Great White Trash's reference to any member of Native America. He should keep his trash talking to himself. Pocahontas' only crime was a lapse in judgment by saving the life of some white guy.","post_message":"When Donald Trump was asked if “he had been chided by any Republicans” for his Twitter war with Elizabeth Warren, the presumptive nominee said, “You mean Pocahontas?”"},{"comment_id":"1006897696063097","commenter_b":"Praying for a awesome woman of God and Crouch family.....such seeds she has sown...","commenter_a":"Pamela Houston","post_message":"The TBN family continues to ask for prayers and promises to keep us updated on Jan's condition. #JanCrouch #TBN #stroke"},{"comment_id":"10156410445115354","commenter_b":"Rebecca the clan was founded in 1865....u ignorant slut....","commenter_a":"If this paper had any business sense and compassion, they would fire that guy.","post_message":"When you see the CARTOON mocking Republican Gov-elect Matt Bevin's adopted children from Ethiopia, just remind yourself: it's only racist when attacks are against Democrats, not Republicans."},{"comment_id":"10154768873318132","commenter_b":"First off who the hell is she ? I've never even heard of her . Lol like seriously what does she do ? Furthermore nobody really cares about her opinion because it's a very poor one. More important things going on in the world then you crying about someone not hitting on you he probably doesn't even know who she is","commenter_a":"It seemed pretty clear to me that she was poking fun at herself, talking about her own feeling, not bashing the athlete in any way. Can everyone just relax and remember that everyone is entitled to their opinions and their own insecurities and maybe, just maybe, not twist every single thing that anyone says into something offensive? Geeeeeeeez!","post_message":"Lena Dunham is setting the record straight on her comments about NFL star Odell Beckham Jr."},{"comment_id":"1324418074301084","commenter_b":"And his nephew is married to Chelsea Clinton.","commenter_a":"This EVIL, sob needs something to happen to him, and take him out of his misery. As long as he is around ,this Idiot will keep causing trouble. He needs to go away forever.","post_message":"Take a look at the list... You will be shocked at some of the names on it!"},{"comment_id":"10154044845821320","commenter_b":"Will it turn into ice by the morning","commenter_a":"Stay warm all from sunny California.","post_message":"Mike Woods updates the storm. Be sure to download the free FOX5NY WEATHER app to get Fox 5 weather on the go."}]
