[{"comment_id":"10153266523095927","commenter_b":"Should have BABY MURDERER on the FRONT of that DRESS!!","commenter_a":"DISGUSTING!!","post_message":"Dress is part of a social media campaign that encourages women to share \"POSITIVE STORIES about their abortion experience ...\""},{"comment_id":"10153686038898984","commenter_b":"DO NOT PASS GO....DO NOT COLLECT ANY MORE OF OUR MONEY......GO DIRECTLY TO JAIL....GITMO.......HOPEFULLY....barack HUSSEIN ......WILL FOLLOW !!!!","commenter_a":"YES!","post_message":"Wow. It looks like winning the presidency is about to become the last thing on Hillary's mind... Do you think Hillary should be indicted?"},{"comment_id":"10154111404003132","commenter_b":"They have it bad because Americans won't allow sharia law be submit to cower to Islam . Imagine that we refuse to stupid as the EU had been . OMG we want Muslims to be tested exactly as any other religion here . The nerve of us to refuse to cower grovel to Illegal immigrants or Islam . Imagine that wanting all to assimilate to Our laws ways traditions under our flag only if it offends you LEAVE go to Saudis Iranians enjoy sharia laws","commenter_a":"I didn't read anything about her being molested or disrespected. Maybe she went to the wrong rally? And who the hell says that a muslim woman should be more respected than anyone else? I don't care that she came in peace. As long as she left in one piece. I am sick of these muslims acting that everyone hates them. Some of us are just tired of their fictitious victimizations. There are real people in this country that have been victimized. Lets focus on them, instead of some nut job that is staging a silent protest because she wants to be special.","post_message":"\"I was not afraid of these people, because I truly believe that the decent people would have stood up and not permitted that,\" she said."},{"comment_id":"10157370446315354","commenter_b":"Let a woman kill them.","commenter_a":"Bring see how many get wiped out America is not afraid of you cowards","post_message":"As the ISIS cancer grows, the threat comes closer and closer."},{"comment_id":"1723680187844156","commenter_b":"she is CRAY cray crazzzyyy","commenter_a":"@username ton 2 cents plottale la dessus please","post_message":"On Tuesday’s “The View”, Hillary claimed that a child, on its due date, just before delivery, has no constitutional rights. Are you serious? I believe that life begins at conception and that abortion takes the life of an innocent human being. And I’ve heard all the arguments from the left before, but this idea that a baby on its due date still has no constitutional rights? That really takes the cake."},{"comment_id":"943252975710162","commenter_b":"I feel like singing. We say grace we say ma'am if ya ain't in to that we don't give a dam. Were from north california and south alabam and little towns all. Around this land. But on a serious note. Being politically correct has made our country weak. Made our children bad and taught them mom and dad will save me no matter what. And yes I do support trump. I'm against illegal immigration and gun control.","commenter_a":"If she would have been taught respect for authority at home this wouldn't have happened true thug trash.","post_message":"Some reasons why Officer Ben Fields should be fired immediately."},{"comment_id":"1034069336638599","commenter_b":"Cruz cannot win Ohio, Florida, New York, California, he cannot possibly win the presidency losing these key states. He only has a chance winning Texas as a key state.","commenter_a":"If Kasich and Cruz can't win in the primary how can they win the election? If the people don't want them now why would we want them later? It's not that hard to understand is it?","post_message":"Donald J. Trump on Ted Cruz and John Kasich: “Honestly Sean, they should both drop out.” Do you agree?"}]
