[{"comment_id":"10154627182156509","commenter_b":"287877634908162s, as a native (Blackfoot) I encourage you to stay out of 'our' business. Immigrant......","commenter_a":"Does @username cares even a bit about Sanders? All this channel talks about is Donald Trump.","post_message":"This is the decade when Donald J. Trump thinks America was great."},{"comment_id":"593869030794976","commenter_b":"#killery #neverforget #emailscandal #saudibribes #womandestroyer #liesthroughherteethwithasmile #corrupt #unfitleader","commenter_a":"Headline reads...CLINTON AND TRUMP UNFIT 2B PRESIDENT","post_message":"It was one of the great body slams of presidential politics. Donald is hurting at this moment."},{"comment_id":"10153934644331336","commenter_b":"Immoral women?","commenter_a":"I wonder what would happen if sexes were reversed. Point is, the guy will be wrong no matter which side he is on.","post_message":"He pinched her, so she punched him... hard."},{"comment_id":"10155187133853029","commenter_b":"Your literally the only one what finds this funny","commenter_a":"@username listen to the end","post_message":"Video captures a Syrian mother and father preparing their two daughters, ages 7 and 9, for jihad suicide missions."},{"comment_id":"10154051866134087","commenter_b":"His bitch better get ready to be deported and come here the right way","commenter_a":"fuck you ass","post_message":"Trump says maybe his deportation task force will be able to deport Clinton. READ MORE: @webpagelink"},{"comment_id":"10153674546377293","commenter_b":"Belief structure is the exact same thing. Splitting hairs to rationalize your views.","commenter_a":"They got a point. It's not a religion by definition, but it's a belief system. Praying affects the individual doing it; only those offended are the people that can't stand the sight of it. They hate, if you will. Equality means just that, though. Can't restrict one group only.","post_message":"“This is very scary,\" a parent wrote."},{"comment_id":"10153206037935399","commenter_b":"Even if the fight is with a women","commenter_a":"Just like all of the allegations about his false claims about the Falklands and being at the suicide of the JFK witness etc..........","post_message":"O'Reilly isn't one to go down without a fight."}]
