[{"comment_id":"1288081714641540","commenter_b":"This is scary","commenter_a":"What kind of sick prople dream up this stuff are people so afraid to die that they will go to these means to create life just to torcher and kill it. Sick sick sick!!!!!!!!","post_message":""},{"comment_id":"10152905378740736","commenter_b":"Shes an idiot..lmao","commenter_a":"Send him home to Mexico please.","post_message":"Two young girls told security at an H&M store that the man was positioning his phone under women's skirts."},{"comment_id":"10152547170886636","commenter_b":"@username. ..rode hard...and put away wet..too bad she didn't stay away wet","commenter_a":"This is a stupid law. If it gets passed. For the reasons you idiot liberals think. It is only a crime if you are wearing it in the commission of a crime. Think about that for a moment. If they charge you with a felony. They will add on a misdemeanor for wearing a hoodie. And then run it all together. So basically it's a nothing law","post_message":"Wearing your hoodie in public could soon be illegal in the state of Oklahoma"},{"comment_id":"466923970098864","commenter_b":"Do not let the Muslims take over our great country with their agenda. I'd look terrible in a burka!","commenter_a":"Carson is right!!!","post_message":"A major American Muslim group says Ben Carson should drop out of the presidential race unless he apologizes for saying Muslims shouldn't be president. Do you think Carson should comply with their request? Via Opposing Views"},{"comment_id":"10152743678847434","commenter_b":"Danielle D'Andrea This bitch is my hero","commenter_a":"@username lolololol save above the knee","post_message":"\"I didn’t lose my two front teeth until I was in 5th grade, which is late. And that very same week, I got my period. Which is early. So I was just this jack-o-lantern with tits walking around, and I had one of those moms that was like, ‘You don’t need to shave above your knees.’\" - Amy Schumer"},{"comment_id":"10153359064344411","commenter_b":"Just say it mate... She's a cunt spread the word","commenter_a":"If she is poor with $30 millions in her pocket imagine me without $30 millions smh","post_message":""},{"comment_id":"971078176272942","commenter_b":"I am writing the facts and the reality. Muslims do not adapt to our culture, habits and language. There is one kind of human race which always cause problems: Muslims. The only thing Muslims do is fight. In your muslim countries, all what you guys do is fight, fight and fight. If you want to live according to the Islamic laws, go live in Muslim countries. There are enough Muslim countries where you can experience your believe . Let the people of Europe alone. Adjust or outside. Respect our Western culture.We do not need you. You are a cost for the European community. You make abuse of our social security. You have no added value for Europe.","commenter_a":"@username, All Muslims are terrorists. Muslim students have cheered in a Dutch school when they heard that the airport has been attacked in Brussels. Muslims have thrown stones at the police in Brussels at the time of the arrest of the terrorist Abdeslam.The situation in Europe is much worse than the media lets on. Muslims who commit such attacks are psychopaths. There is something seriously wrong in their heads. You can't negotiate With fools . There is only one way to deal with this. Eliminate! All the world has problems with the same human race: that are the Muslims. It is a fact and a reality. It is always with Muslims that the world has problems with. You forgot the attac in New York committed by Muslims coming from Brussels! Muslims are a threat to humanity. Please wake up Hillary. Face the reality of the danger!","post_message":"In our fight against radical jihadism, we have to do what actually works. One thing we know that does not work is offensive, inflammatory rhetoric that demonizes all Muslims. There are millions of peace-loving Muslims living, working, raising families, and paying taxes in this country. These Americans are a crucial line of defense against terrorism. They are the most likely to recognize the warning signs of radicalization before it’s too late, and the best positioned to block it. We need every American community invested in this fight, not fearful and sitting on the sidelines. So when Republican candidates like Ted Cruz call for treating American Muslims like criminals, and for racially profiling predominantly-Muslim neighborhoods, it’s wrong, it’s counter-productive, and it’s dangerous."}]
