[{"comment_id":"1025373750832154","commenter_b":"@username, nope, not voting for her, either.","commenter_a":"The Trump train is full speed ahead. Get on board the Trump train. You will get run over. It is full speed ahead to making America great again. Mr. Trump for president 2016!!!!","post_message":"America is proud to stand shoulder-to-shoulder with a free & independent UK. We stand together as friends, as allies, & as a people with a shared history."},{"comment_id":"717743675080590","commenter_b":"shes an ugly cunt that smells of camel piss","commenter_a":"Who is she ? Shariah ! Who's she? @username David A Doran","post_message":"FINALLY, We are taking back our country from the entitled Muslims that Obama let do whatever they want and try to tell us what to do!! SHARE if you agree that Sharia Law should NEVER be allowed in America!!!"},{"comment_id":"10153359196206234","commenter_b":"She can leave the house!","commenter_a":"If she can't leave the house,what does she need it for","post_message":"The new Lexus was waiting for Giudice when she returned home from prison earlier this week."},{"comment_id":"10153196584554091","commenter_b":"Go marry donkey who cares","commenter_a":"As a Christian..I feel she's out of order...do your job!...and let God deal with anything else.","post_message":"She told the couples and activists that her office is continuing to deny the licenses \"under God's authority.\""},{"comment_id":"10154383180609641","commenter_b":"Now this is the kind of stories we want to see and hear... Not lesbian kissing in public yet in their hearts they know too that unless they repent and accept Jesus as Lord they are on their way to Hell","commenter_a":"Moms...","post_message":"Meet the woman behind Usain Bolt."},{"comment_id":"10154551576694030","commenter_b":"White people love mayo and ranch. I lovvee ranch bruh.","commenter_a":"I didn't see this as particularilly white. Like people of color don't use mayo?????","post_message":"You can't help who you are. Kyle Kinane's Loose in Chicago premieres tonight at 12a/11c."},{"comment_id":"10153839105457994","commenter_b":"What a sassy little shitbag ... definitely you 😉","commenter_a":"Jamie spirit animal","post_message":"Because sometimes, you just need to tear apart a room. Have a great weekend."}]
