[{"comment_id":"609800865864857","commenter_b":"#NeverTrump #NeverHillary","commenter_a":"Everyone of us who supports Mr. Trump, must come out and vote. It's great to talk, but we need to actually cast a vote. NO EXCUSES!! The Libertards will stop at nothing to cheat, lie and steal this election. Pass the word on to everyone. Republicans have to come out and support Mr. Trump like no other has been before. #TRUMP2016","post_message":"Crooked Hillary Clinton rakes in millions from nations that fund terrorism, oppress women, and spread hatred."},{"comment_id":"1267309513345274","commenter_b":"Great comeback! :)","commenter_a":"Ya gotta love the way the Dems embarrass themselves in front of the entire world .... just say'n .. JBeale","post_message":"Allen West Republic"},{"comment_id":"1225420670803521","commenter_b":"KICK THEM OUT","commenter_a":"Whatever happened to the US Military Academy's Code of Honor? If it's still in effect, those who raised a fist should be court-martialed.","post_message":"Concerns arose that the pose violated Pentagon rules on avoiding political activity by paying tribute to the civil rights-era Black Panthers group or to the present-day Black Lives Matter protests."},{"comment_id":"10153576810758984","commenter_b":"Lot of good women out there but she's not one of them!!!","commenter_a":"Hillary is another Obama in a pantsuit. Maybe even worse! PPL didn't listen when Obama was exposed..... Will they listen now about Hillary?????","post_message":"I watched this over and over again to try and figure out what Hillary possibly could have been thinking. I'm still stumped. Like the news anchors reporting on this did, all I could do was laugh... Do you want to see Hillary suffer a resounding loss in 2016?"},{"comment_id":"10152999790806167","commenter_b":"I would pay money to watch Nikki Haley and the vampire fight each other.","commenter_a":"conservative firebrand???lol whatever! she is a delusional racist self hating woman!","post_message":"Fact: Governor Nikki Haley was born in South Carolina."},{"comment_id":"1050080195049016","commenter_b":"another dumb btch","commenter_a":"So Donald Trump you are not the savior we need for this country, I do not think you will bring jobs or prosperity when you do not even pay great wages for people that work for you. I think you are a disaster waiting to happen, you really belong in a reality series not president, I hope the people wake up before you end up our dictator","post_message":"ICYMI: Ivanka Trump took the stage in South Carolina and said, “My father is an incredibly hard worker and he’ll be working for each and every one of you.” (CC: Donald J. Trump, Sean Hannity)"},{"comment_id":"10153692085070950","commenter_b":"There was a story not long ago of the White House sending out a million Green Cards to illegals. About a year ago there was a story on Obama sending out a million US citizen applications to green card holders.","commenter_a":"The story CBS did on Brexit tonight was horribly biased. The reporter all but predicted the end of the world (Communism). How better to get America to join the EU, than to bring us to our knees with Obama flooding the homeland with Mexican and south American (illegal alien) nationals? Low skilled labor and low information voters go together like Obama and Muslims. A match made in economic and cultural Hell.","post_message":"U.K.'s withdrawal from the European Union is already causing economic and political upheaval -- so what happens next?"}]
