[{"comment_id":"10154094997078132","commenter_b":"don't reproduce...","commenter_a":"Jus had my babies let me put my fake lashes in n do my makeup for the pic..","post_message":"The only thing keeping Jaeyln and Luis apart is a year."},{"comment_id":"10153811060584614","commenter_b":"Take the guns....and the illegal criminals will be the only ones with them...","commenter_a":"90% of the immigrants are Muslims male between 18 - 30..and are military savvy....the are probably guilty...a planned take over.....Germany is next...","post_message":"Update: At least 150 people were killed in Friday's Paris and Saint-Denis shootings and bombings, French officials say."},{"comment_id":"10153193679463812","commenter_b":"Lady Gaga was amazing & Julie Andrews is stunning! Love that movie always!","commenter_a":"Absolutely amazing!","post_message":"Perhaps the most powerful moment of the #Oscars: @webpagelink"},{"comment_id":"10153644040068967","commenter_b":"Yeah but women can not, not without getting sexually harassed","commenter_a":"Common place in Denmark as well. Alone and in school groups. Take your pick.","post_message":"Japan is awesome"},{"comment_id":"10150832219144999","commenter_b":"Are women able to have more than one husband?","commenter_a":"Polygamy is legal in my country.","post_message":"Could the U.S. Supreme Court decision that recognized a right to same-sex marriage presage a constitutional right to plural marriage? Read on in The New York Times Opinion."},{"comment_id":"1753098654934241","commenter_b":"I'm not making this Woman commit suicide, and I'm not the one to stop her.","commenter_a":"Jump bitch.","post_message":"She wants to end her own life."},{"comment_id":"10154700098471323","commenter_b":"All talk of this being an exercise in protecting democracy is simply a smokescreen. This lady is a member of the privileged elite aiming to derail the Brexit we voted for by seeing it completely emasculated to the point where the status quo will be preserved. The bankers and fund managers will never allow ordinary people their freedom. Only the rich are allowed to be free.","commenter_a":"All MPs are Selfserving PARASITES .The People have VOTED DEAL WITH IT .And Start bye getting our Borders sortted and RIP UP ALL EU LAWS Because we never needed them .FACT .And Stop Foreign Aid.We carnt afford it.And Spend the money on the people that need it in the UK..","post_message":"\"Neither the British people nor parliament have, however, voted on what form that leaving should take, or on which fundamental rights will be removed as a result of leaving. Those are questions that can be decided only by our sovereign parliament.\""}]
