[{"comment_id":"10154478839956636","commenter_b":"@username without god, noone can hear you get shot. Your worldview is wuite hopeless. Without god, who will punish evil ppl then evil has won. Rofl","commenter_a":"They found the remains of velociraptor Jesus used to ride on.","post_message":"Incredible"},{"comment_id":"595052750663656","commenter_b":"So RACIST I used to really like her. Now o can't stand her..","commenter_a":"And we don't want to hear you talkm","post_message":"THE VIEW’S Whoopie Goldberg To Co-Host: “This Is Why Black People Don’t Wanna Talk To White People” [VIDEO]"},{"comment_id":"608368836001258","commenter_b":"Rigged? Really?? LOL!! Of course ir was and the next ones will be also! Did you notice the \"Hill\" isn't even wearing an American Flag pin? She didn't have any American flags at the convention either till the media mentioned it. A real pice of S===!","commenter_a":"yep when hillery was wired so she could be told what to say","post_message":"A rigged election!!"},{"comment_id":"754801571296723","commenter_b":"You possess a gun! Must include you and your Force. No, possession of a gun or any other weapon by an honest citizen and who Carrie's it legally is not the problem, it's your drug dealing gangs and the shitbags they cater to that are committing all the crime and violence, when the politicians and legal system gets real and grows a pair, maybe then the police can finally do the job they are required to do, try some aggressive patrolling and \"stop and frisk\" along with prosecution of those who illegally possess guns and stop throwing out the gun charge for a quick \"plea bargain case\" maybe you'll see some results!","commenter_a":"That's why Chicago had 62 shootings over there weekend their in the wrong hands.","post_message":"Garry McCarthy has no interest in stopping the thug culture destroying Chicago. Instead, he wants to blame law-abiding gun owners for his failures."},{"comment_id":"486444454879468","commenter_b":"I can't stand her either..","commenter_a":"Yes I will always honor and support the Flag of the United States of America!!","post_message":"Michelle Obama just said something treasonous about the flag. This is ridiculous, that flag is the symbol of the greatest nation on Earth. Do you support the American Flag?"},{"comment_id":"1065259396852375","commenter_b":"Oh @username, you're so fucking stupid it's not even funny. I hope you can't reproduce.","commenter_a":"Have you recuperated from all the fun last week ? Glad everyone made it home with no problems. If you're planning to go to the DNC convention; here's the schedule. DNC convention Schedule Saturday, 27 August 2016 11:15 AM Free lunch, medical marijuana, and bus ride to the Convention. Forms distributed for Food Stamp enrollment. 2:30 PM Group Voter Registration for Undocumented Immigrants. 4:00 PM Opening Flag Burning Ceremony Sponsored by CNN 4:15 PM Address on \"Being the Real You\" Rachel Dolezal, former Head of the Seattle NAACP and Caitlyn Jenner 4:30 PM \"How to Bank $200 Million as a Public Servant and Claim to be Broke\" Hillary Clinton 4:45 PM \"How to have a successful career without ever having a job, and still avoid paying taxes!\" A Seminar Moderated by Al Sharpton and Jesse Jackson 5:00 PM Medals of Freedom presentation to Army deserter Bo Berghdal and the Baltimore ...","post_message":"Stand with Democratic leaders: tell the RNC to DISBAND Trey Gowdy's fraudulent Benghazi committee and have Republicans pay back taxpayers! PETITION: @webpagelink (hat tip to Occupy Democrats)"},{"comment_id":"924082021021384","commenter_b":"and hate smart women.","commenter_a":"What happened with the great Sara Palin she not running lol","post_message":"They might need a bigger stage..."}]
