[{"comment_id":"367258316795796","commenter_b":"This is against the establishment clause of the Constitution!!","commenter_a":"Send all of those goat lovers back to the sand dunes!","post_message":"Allah is replacing God in our schools..."},{"comment_id":"10153484638827507","commenter_b":"Whining lil Bitch!","commenter_a":"Activist farmers? REALLY?! They got time for that shit?! I have a better idea, STOP suckling from the federal ethanol teat, get back to your damned fields, and grow the crops that feed the people!!!! I hope that you make a fortune, the HONEST way, and keep your damned MORONIC racial political opinions to yourself!","post_message":"This is important."},{"comment_id":"10154789025934641","commenter_b":"If wonder woman can do it ..so can I","commenter_a":"This is so disappointing. Anyone petitioning for the removal of Wonder Woman as ambassador, clearly doesn't know the history of the character. Peace Justice Equality ...and more. Bottom line: basing her removal mainly on appearance - is sexist. Look at male superhero costumes. They leave little to the imagination also. No one is hollering about that. As a feminist, I understand that the sexual objectification of women is a huge problem in our culture. The answer is not to force women to cover up. The answer is to allow women to express themselves without fear. The answer is to teach our boys how to behave. Read the comics. Read the history of the character. Read scholarly articles on WW as a feminist icon. She has pro-women zingers that make me cheer! Many parts of her \"sexy\" costume are actually powerful symbols. Do some research. I know there are more important ...","post_message":"Wonder Woman has been stripped of her role as UN honorary ambassador less than two months after the appointment was made."},{"comment_id":"831043426931080","commenter_b":"Yes, she needs to be held accountable! She has NO business being president!!!","commenter_a":"Good luck on this one, sure hope it all works!","post_message":"Hillary might as well retire her future plans for the White House! Gowdy's gunning for something that will DESTROY her!"},{"comment_id":"10155175542819369","commenter_b":"If she took this Job she knew what her role would require, and now she has changed her mind. Time for her to seek new employment plain and simple.","commenter_a":"I dont think any of u trump idiots would take a bullet for him ?if u do well LOL !!","post_message":"The special agent in charge of the Secret Service Denver district is under investigation for suggesting she wouldn take a bullet for President Trump."},{"comment_id":"10153338672643721","commenter_b":"I've had a lot of experience with it An am only giving my opinion based on my experience am not trying to upset anyone am just giving u my insight","commenter_a":"So how are these people getting LSD exactly?","post_message":"How LSD microdosing became the hot new business trip. (via Rolling Stone)"},{"comment_id":"467441413380453","commenter_b":"I've got a great idea! Let's send all the illegals to Italy! Who agrees with me?","commenter_a":"NO!!!Go home and support your own People!","post_message":"A five-year-old hands Pope Francis a letter asking him for help in preventing her parents from being deported. The Pope is calling for Christian support for all immigrants, both legal and illegal. Do you agree?"}]
