[{"comment_id":"10153154951847994","commenter_b":"Finally a judge with a brain! you go girl! They should get life but sadly they will have some tear jerking defense and will probably get ten years.","commenter_a":"Wow, this was compelling!!!","post_message":"A judge is furious over the death of a little child -- and she let the suspects hear it. She says watching their police interview footage was more like watching a cable TV show. Read more about the case here: @webpagelink"},{"comment_id":"813666455490598","commenter_b":"And she needs to dump her shit in the jungle","commenter_a":"I am so sick of reading about her ,she probably spent more money then all the first lady's in the last few years ,she thinks her shit don't stink now well I got news for her it does .","post_message":"What Michelle Obama Was Just Caught Doing With Her Daughters Will Make You FURIOUS She is the worst First Lady in history. Are you ready for the Obama family to be out the White House?"},{"comment_id":"1734707080142446","commenter_b":"@username fuck outta here!!! Hahaha biggie pulled more bitches!!!!! REALIZE THAT NONE OF THOSE FEMALES U NAMED IS BAD ALL UGLY ASS HOES!! THE BEST LOOKIN FEMALE BIGGIE GOT TUPAC FUCKED (Faith)!!!!! Jada Smith shut biggies females down lol","commenter_a":"Biggie, cus todays people are too stupid to understand Tupacs lyrics lol","post_message":"VOTE NOW! 2pac vs. The Notorious B.I.G. -- Who'd be bigger today? #DEWcision2016 #sp See how your fellow hip-hop fans are voting here..."},{"comment_id":"10153877660438812","commenter_b":"Wow, you're just full of fear. They're just people that want to use the bathroom. Get over yourself. No one wants to look at you or your ugly daughter anyway","commenter_a":"This just in! All teenage boys are claiming to be trans to gain access to girls' locker rooms.","post_message":"The DOE says an Illinois school district is violating the rights of a trans student by denying her access to the girls' locker room."},{"comment_id":"10155996223940354","commenter_b":"Take their citizenship away and deport.","commenter_a":"Black trash","post_message":"This Mississippi Teen Honors Student and Her Husband Have Been Charged with Attempting to Join ISIS. Her Father-in-Law is Imam of the Islamic Center of Mississippi in Starkville..."},{"comment_id":"1299471993412429","commenter_b":"This lady on crack","commenter_a":"Trump won the debate fair n square from 5 minutes away!!! #TrumpTrain nailed it last night raising money for our Vets!!!! $6,000,000!!!!! I donated! Did you? #Trump2016","post_message":"Experts weigh in on #GOPdebate, including the noticeably absent Donald J. Trump."},{"comment_id":"903353419700080","commenter_b":"She is so nasty looking all the time I bet she stinks","commenter_a":"What is Always wrong with her tongue? Personal hygiene is a must. Can someone tell her to brush it .","post_message":"Awesome!"}]
