[{"comment_id":"1316028568419930","commenter_b":"What happens if you don't believe in \"God\"? I personally will not end up in hell if I have an abortion, as I don't follow the teachings of any religion. For me, it is my body and if I don't want something growing in my body I will remove it. I have had a miscarriage, and I have my one child. I do not want another child, ever. I can't use birth control, I can't use affordable condoms. If I have sex and I end up with a pregnancy I will have an abortion. Becuase I do not want another child. It is that simple. If we do not watch out we will soon be sent to jail for having a miscarriage, that is the road we are going down. So every female that has ever had a miscarriage needs to stand up and fight for the rights of others, ...","commenter_a":"Sometimes pregnancy happens regardless of how many precautions are taken. Sometime a woman's right to consent is taken from her. Sometimes the pregnancy is a deadly risk for the mother. Sometimes the baby may live a short, painful life or a long painful life. Sometimes a woman does not realize she is pregnant right away. Every time it is her body, her rules.","post_message":"This bill would prohibit abortions after the first detectable fetal heartbeat but many women don' even know they're pregnant that early."},{"comment_id":"10154485862326037","commenter_b":"Sure, if you choose to believe the people in collusion with the election fraud.","commenter_a":"If you wanted unity, you should have allowed the voters to choose the nominee instead of allowing your corporate masters to do it.","post_message":"DNC chair Marcia Fudge calls for unity amid a chorus of boos and jeers from Bernie Sanders supporters: \"We're all democrats\""},{"comment_id":"10153341159307411","commenter_b":"It will happen. We've cowered to idiots. Time to be unpoloticaly correct. We Americans are fed up. Obama and bush did nothing. Hillary is evil. We need shorter sidewalks and taller fences. These people are evil.","commenter_a":"Those isis fools try and scare people with talk like KKK,Trump,and the Republican party,pay attention and listen it's all the same act.","post_message":"A group of ISIS supporters has threatened to take down Facebook and Twitter -- as well as their leaders."},{"comment_id":"10154147730689071","commenter_b":"Lol you need help lady","commenter_a":"Good job trump. Keep up the good work. We need to be making more friends. Even if the liberals wanted to go to war with Russia led by Hillary. It's time for a new chapter in diplomacy.","post_message":"\"To be honest with you, the waters here seem like a little bit of a tempest in a teapot. I mean, it's striking to me that President Obama would reach out to a murdering dictator in Cuba and be hailed as a hero...\""},{"comment_id":"1345804005472359","commenter_b":"MANY WOMEN HAVE ACCUSED BILLY OF RAPE. THAT PLUS THE TRIPS TO EPSTINES ISLAND TO RAPE UNDER AGE SEX SLAVES THERE.","commenter_a":"WE ALL KNOW THE TRUTH..BILL AND HILLARY ARE AS MUCH OF A DISGRACE AS OBUMMA...GO TRUMP..","post_message":"Weak..."},{"comment_id":"10157746035990093","commenter_b":"Megan needs to be Fired! She could always work for the Clinton's.","commenter_a":"That's one lieing women","post_message":"Donna Brazile CANNOT take Megyn Kelly's line of questioning and it's hilariously uncomfortable. She's so CLEARLY lying!"},{"comment_id":"10152987213175090","commenter_b":"She is a liar!!","commenter_a":"'What difference does it make'!","post_message":"Why don't you want Hillary Clinton to be President? @webpagelink"}]
