[{"comment_id":"1212813765463824","commenter_b":"She's lower than a snakes belly. God help us if she's elected.","commenter_a":"The Benghazi Butcher.","post_message":"This father of a Benghazi victim just shocked the CNN reporter when he abandoned the script... he wanted the world to know the truth about Hillary Clinton. This MUST get out..."},{"comment_id":"10154176527056770","commenter_b":"Shut up and crawl back in your hole.","commenter_a":"He's a creep for saying that!","post_message":"'Avengers' director Joss Whedon made a lot of outlandish comments on Ivanka Trump and Jared Kushner."},{"comment_id":"10156175309065231","commenter_b":"She lookin to get paid! I'm sorry ....she a hoe","commenter_a":"Voting democrat","post_message":"Pierson feels her new alliance with the Donald is \"perfect.\""},{"comment_id":"10153167789731336","commenter_b":"Wow only they can attack ppl...what happens to them a slap on the hand!!! When does all this stop? The violence is out of control.. I no if they would of attack my husband an I was in my car..probably would of ran them over or use the gun to scare them off.... Sad that no one helped!!!!","commenter_a":"This is why you carry. Been a few dead teens if it had been me.","post_message":"Caught on camera: A man was viciously attacked in broad daylight by a mob of teenagers while helping an elderly woman at a gas station."},{"comment_id":"779312755503344","commenter_b":"How about in the best interest of the Muslims, they don't belong here.","commenter_a":"why do we need them here??? what benefit are they to America??? wtf....","post_message":"Is Paul Ryan in our country's interests?"},{"comment_id":"775509592583157","commenter_b":"@username they are home how about the real immigrants go home for a change ?","commenter_a":"Illegals come here from Mexico looking for a better life yet they want to turn the U.S. into Mexico...freakin' crazy, and stupid!","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"},{"comment_id":"10153369790181770","commenter_b":"SHES A WITCH!!!","commenter_a":"hillary is an idiot , how could anyone vote for someone so evil, she has to be stopped","post_message":"Clinton thinks everything is fantastic at the U.S.-Mexico border."}]
