[{"comment_id":"10153639863228352","commenter_b":"Cover up last thing I want to see is someone's boob while I'm trying to eat!!","commenter_a":"I'm with the lady's it's natural and people need to mind their own business the baby was hungry so mom fed it end of story and ask before posting pictures of people you don't know/ have permission to that's rude and illegal fucking ignorant immature sexist swine","post_message":"New mom is horrified to discover a photo of her breastfeeding shared on Facebook by a disgruntled diner"},{"comment_id":"10153993699771756","commenter_b":"@username And you do realize the husband who was carried out the attacks was an American citizen, not refugees. In fact no refugees have ever carried out attacks. But by all means you go ahead and keep screaming about refugees, the terrorist just love you doing exactly as they wish.","commenter_a":"So Texas went from an idiot governor, to a mostly corrupt governor, to an insane one?","post_message":"Texas and the federal government have taken their power struggle over Syrian refugees to federal court."},{"comment_id":"10153517844123984","commenter_b":"They needed to know.","commenter_a":"This is the most retarded thing anyone has ever posted on faceboook.","post_message":"Mega-church TV pastor Joel Osteen just made a sickening announcement about Muslims... Spread this absolutely everywhere... the REAL Joel Osteen needs to be exposed. Do you agree that Osteen is a fraud?"},{"comment_id":"10157734459025354","commenter_b":"Bill can't wait to be in Las Vegas were the hookers are like running water! I did not have sexual relations with those hookers!","commenter_a":"The real deplorables are the 40 something % of true idiots that are still backing the Clintons- Trump people are fed up taxpayers-","post_message":"If she's \"feeling great\" as Team Hillary claims, why isn't she campaigning? What is going on? And why can't these two ever tell the truth?!"},{"comment_id":"848324611946507","commenter_b":"Actually I spent a number of years in special ops in the military, we called guys like you \"Dinky Daos\".","commenter_a":"ISIS thanks Senator Cruz for supporting their strategy to create a war of religions.","post_message":"The Obama Administration has no foolproof vetting process, and this is tantamount to rolling out a welcome mat for terrorists to this country. Congressman Jeff Duncan and I have together introduced legislation that would empower states to use their Tenth Amendment authority to opt out of the national refugee resettlement program. Our legislation requires the federal government to inform states of its intent to settle aliens within their borders, and allows governors to reject those aliens if a governor believes that the refugee presents a security risk. Our children’s safety tomorrow depends on our ability to secure America today."},{"comment_id":"10153116557673812","commenter_b":"The problem here is that if there wasn't such a demand for these young females by perverts this wouldn't exist. You are sick to lust a 14 yr old as a grown man.","commenter_a":"My heart goes out to this mother!","post_message":"WATCH: A mother in a desperate search for her missing 15-year-old daughter is overwhelmed with emotion when journalist Nicholas Kristof searches for and quickly finds her being advertised explicitly online – A Path Appears: Tonight on Nightline / Monday on PBS -- MORE: @webpagelink"},{"comment_id":"10155505963450354","commenter_b":"What about the other female that had a hold of the flag?","commenter_a":"Brava patriot.","post_message":"“I was just going over there to pick up the flag off the ground.\""}]
