[{"comment_id":"918539948208123","commenter_b":"I say we hand this trifling hoe to ISIS","commenter_a":"Another oxygen water","post_message":"DISRESPECT for our military and nations heroes is out of control. This is straight up disgraceful! READ HERE---> @webpagelink/ HONOR CHRIS KYLE!"},{"comment_id":"1420083668051377","commenter_b":"Oh shes a female.. whoops","commenter_a":"Muslims r like a football team. The radicals /terrorist r the strikers. The extremists r the midfielders who feed the radicals. The defenders r the moderate Muslims who create diversions, deflect, defend and save Islam from legitimate criticisms n any accusations. They work as a team though they create the perception that the defenders have nothing to do with the strikers. The Liberals r the goalies who jump in when the situation gets worse with statements like Islam is a religion of peace @ De Joe Int'l ur comment had to be repeated.","post_message":"'We march through the night to cut and behead... Allahu Akbar'"},{"comment_id":"10153516438828487","commenter_b":"Shut up douche bag .","commenter_a":"Everything and everyone is interconnected in this economy. To say the NYSE had a series of computer glitches is to mislead the greater public and further cover up the truths behind the shut down.","post_message":"On Wednesday, technological glitches shut down the New York Stock Exchange and grounded thousands of United Airlines flights."},{"comment_id":"1065493480157790","commenter_b":"I hope he is right. We can live well without what Beck represents.","commenter_a":"lol Beck is always good for a laugh","post_message":"Glenn Beck's reaction to the fact that the Supreme Court upheld Obamacare was nothing short of amazing."},{"comment_id":"10153311065101167","commenter_b":"Three words: Token. Black. Woman.","commenter_a":"Why does anyone care what Stacey Dash has to say?","post_message":"Today on live TV on two separate programs, Fox News called Obama a \"total pussy\" who doesn't \"give a shit\" about terrorism:"},{"comment_id":"483457381844842","commenter_b":"Stupid,, Stupid,,, Stupid,,dumb bitch","commenter_a":"who voted for her?","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"10153320110664641","commenter_b":"her kids are black, derp","commenter_a":"As long as she is not racist and is doing good she is my sister! Her being white does not change anything","post_message":"Rachel Dolezal represents the black community publicly and vocally. But her birth certificate says she's white."}]
