[{"comment_id":"1494215257285326","commenter_b":"If ur here illegally you got to go. 100%.","commenter_a":"If you're here legally and ICE knocks at your door: Answer and say hello, you haven't broken the law so you have nothing to fear.","post_message":"ICE raids have resumed in several cities under the Trump administration, continuing to tear immigrant families apart and put whole communities in the target hairs. Thankfully, more and more people are getting aware and awake, and are hitting the streets to protect undocumented communities and protest raids, mass detentions, and deportations. Activists in many cities are holding \"know your rights\" trainings over the next several days - get involved in your city, and join the movement to protect immigrants and their families!"},{"comment_id":"1192108440886151","commenter_b":"He is going to be a great president","commenter_a":"He is the uneducated and ignorants president which apparently there is a lot of!","post_message":"WATCH LIVE: President-elect Donald J. Trump makes a statement from Mar-A-Lago estate"},{"comment_id":"10156072867635389","commenter_b":"Ramos was rude but so was Trump.","commenter_a":"Trump of course","post_message":"Question of the Day: Who do you think won last night’s exchange: Jorge Ramos or Donald J. Trump?"},{"comment_id":"10152784678501130","commenter_b":"I read a quote from a woman somewhere who said \"When I had kids, I saved up my sick and vacation days.\" She thought this was a major accomplishment. So she took time away from her family and herself (vacation days) and exposed her colleagues when sick. How smart is that. Bootstrap childbearing.","commenter_a":"About time, but still not enough. Germany vives a year.","post_message":"\"[W]e can't say we stand for family values when so many women in this country have to jeopardize their financial security just to take a few weeks off of work after giving birth.\""},{"comment_id":"10154165765599091","commenter_b":"#DrainTheSwamp #PayToPlay #RiggedElections #VoteFraud #NastyHillary #MAGA #CrookedHillary #NeverHillary #HillaryForPrison2016 #LockHerUp #BuildTheWall #BringBackJobs #LatinosForTrump #NoMoreClintons #BenghaziButcher #DefeatSocialism #BanIslam #EmailGate #CorruptMedia #ObamacareFail @webpagelink","commenter_a":"Congratulations and God bless!!!","post_message":"CONGRATS! Five female firefighters have graduated from the New York City Fire Department (FDNY) academy -- the most women to join New York's Bravest since 1982!"},{"comment_id":"10150832219144999","commenter_b":"Are women able to have more than one husband?","commenter_a":"Polygamy is legal in my country.","post_message":"Could the U.S. Supreme Court decision that recognized a right to same-sex marriage presage a constitutional right to plural marriage? Read on in The New York Times Opinion."},{"comment_id":"10153467954429714","commenter_b":"Haha this old lady needs to grow up u to old to understand ur backwards ways","commenter_a":"Down with haters","post_message":"The clash sparked a battle that pitted school administrators against students during the last week of the school year."}]
