[{"comment_id":"10153378230871770","commenter_b":"You have to be a special gentile stupid to call the protesters racist.read the Talmud you stupid bastards.","commenter_a":"I think I seen that dude on delliverance movie","post_message":"Violent anti-Israel protests broke out at the American Israel Public Affairs Committee’s annual conference in Washington, D.C. on Sunday."},{"comment_id":"10152798547942452","commenter_b":"Upon last survey, they only found ~three smelt in the delta! All the smelt live in temperature controlled tanks at UC Davis... to the tune of about $2.5 million tax payer dollars per year. THE SMELT ARE GONE, no matter what they do in the delta. If it weren't the smelt, another fish or animal would be chosen to take its place. We're suckers... hook, line, and sinker! Israel had severe water shortages too... they are now able to be a water exporter. They built reclamation, desalinization, and now have more than they need. California is building an f'ing bullet train to nowhere! But, what if a smelt got pulled into the desalinization plant intake?","commenter_a":"Maybe if our state government quit selling our water rights to Evian arrowhead dasani etc we wouldn't have this problem","post_message":"BREAKING NEWS: California water regulators adopted sweeping, unprecedented restrictions Tuesday on how people, governments and businesses can use water amid the state's ongoing drought. abc7.la/1QkO1GA"},{"comment_id":"1786910708245530","commenter_b":"She is a liar !!","commenter_a":"Imagine a Trump led America With a vision to make us great, Builder, businessman, father, With a leader, fighter trait. Imagine factories buzzing, Oil flowing out of the ground, Coal miners packing their lunches, People talking about jobs they've found. Soldiers, sailors, airmen, marines, Showered with Presidential Pride, Strong and able to keep us safe, Respected and feared worldwide. Imagine a really, really big wall, With a big, beautiful door, Swings one way to put out the bad, The other to let in the good. ISIS not even a JV team, Russian Bear back in its cage, Iran decided to take a new deal, Israel safe from all rage. Imagine a man of integrity, A man the world will respect, A man who will fill the office With all the honor we expect. Imagine a Trump led America With a vision to make us Great, Imagine a Trump led America ...","post_message":"FACT-CHECK:"},{"comment_id":"1806931362926478","commenter_b":"I just can't believe that she uses children for her dirty political TV add. Her latest add children watching Donald Trump . She is the expert lol . Her lenguage puts sailors to shame. She is no Lady never was never will. Poletic is agly we all know that. But to involve children in an add how low can you sink??? I wouldn't let my children or great grand children watch TV dirty Poletic.... The would be in bed for sure not sitting in front of the TV all day long .what kind a mother and grandmother is she we should ask ourselves to use children in her dirty advertising against TRUMP they are children MADAM SECRETARY. SHOULD WE SHOW THE CHILDREN THAT YOU IGNORED THE DESPERATE CRY FOR HELP IN BENGHAZI?? YOU KNEW WAY BEFORE THEY WOULD NEED HELP RIGHT AWAY. WELL WHERE WERE YOU YOU WENT TO BED ...","commenter_a":"He's needs to walk away from the DNC at this point!!! They never had his back why should he have theirs? Stein /Sanders could change this country.","post_message":""},{"comment_id":"586488074867632","commenter_b":"There needs to be at a 10 yr moratorium on any immigration!! From 1920-1965 there was no immigration whatsoever. The reason was: from around 1889-1920 there were 14 million immigrated allowed into the USA & the Govt said they needed to get acclimated & learn English, to become Americans. This needs to start again!!","commenter_a":"None we are full up","post_message":"Currently, the U.S. allows 1 Million legal immigrants every year. New poll of voters found most want the number cut at least by half. What do you think?"},{"comment_id":"10153212700939270","commenter_b":"Well I know it was out of service around that time but I'm sure that's what they did but it was a great ship","commenter_a":"Aw darn now no one is safe aboard that ship when that time of the month comes","post_message":""},{"comment_id":"10154390572299749","commenter_b":"@username suckers.","commenter_a":"@username Nope....that is all...nope","post_message":"About 400 fen raft spiders have been set free in the UK."}]
