[{"comment_id":"857390540965850","commenter_b":"I resent paying for any illegal immigrant through our tax money...It is fundamentally wrong and immoral to take away from the next generation of real Americans.... Obama is evil......how about taking care of our elderly, our Veterans and our AMERICAN children?","commenter_a":"thanks obama","post_message":"This is insane, no rational government would do this, or am I off base on this one?"},{"comment_id":"10152889213814071","commenter_b":"I'm gon die Miranda Hill Allie Lorimor","commenter_a":"Anfal Alkhalaf","post_message":"Listen to your dentist."},{"comment_id":"638139039652611","commenter_b":"They paid her less cause she sucked ass!","commenter_a":"It's true cause Brian Williams was there","post_message":"YEAH!!!!!!!!!"},{"comment_id":"1028722620528934","commenter_b":"Much better than the lying Hillary or senile Bernie!","commenter_a":"And the other morons will vote for Trump.","post_message":"Americas Freedom Fighters"},{"comment_id":"10154003076373812","commenter_b":"Actually women STFU if you can't take the heat dont attack....he has just as much right as her","commenter_a":"When it comes to women, Donald should just STFU.","post_message":"Donald Trump ramps up his attacks against Hillary Clinton and former Pres. Bill Clinton: \"If Hillary thinks she can unleash her husband, with his terrible record of women abuse, while playing the women's card on me, she's wrong!\""},{"comment_id":"10153172623814153","commenter_b":"I don't have compassion because of their careers I have compassion because I'm human","commenter_a":"How many of you would be screaming compassion if he wasn't a cop? And a history of DUI? Please. I have no compassion for anyone who drives drunk or gets into a car with a drunk driver.","post_message":"MVC Records: Officer Pedro Abad Jr., driver in deadly Staten Island crash, had 2013 DUI in Rahway. Read more: @webpagelink"},{"comment_id":"10153722838823984","commenter_b":"Pussy breath","commenter_a":"Through the key away","post_message":"A federal judge has ordered Kim Davis to remain in a jail cell until she agrees to issue marriage licenses to same-sex couples. The state is holding a metaphorical gun to her head, yet all she has done is stand firm in her conviction that marriage is between one man and one woman. Stand with us and sign the petition for Kim Davis to be released from jail immediately!"}]
