[{"comment_id":"1020621978034054","commenter_b":"Queen of England? LOL... She's such a jokester, a desperate one.","commenter_a":"Why should anyone stand with him? No reason to","post_message":"Sarah Palin doesn't stand with Ahmed."},{"comment_id":"1060076290679393","commenter_b":"I believe you! Just saying IMF found some crazy monetary practices. Matching 8% would create a crazily unsustainable and unattainable and unrealistic economic goal. We had our state government promise such riches for a 20 year period to public employees and it's not a practice followed and linger because we have had to fund that same crazy generosity despite economic ups and downs. This created alot of resentment as courts say we must continue to fund these government employees who gave themselves this great pension!","commenter_a":"This is just like Greece, nepotism, expensive payrolls and pensions created to benefit a few individuals and their families while real public needs are neglected...this is the opposite of socialism @username","post_message":"The budget crisis faced by Illinois is dire - the state government itself is drowning in $37 billion of debt. Read more: @webpagelink via Special Reports"},{"comment_id":"10156020385660725","commenter_b":"#FameWhoresDo","commenter_a":"Brooke the has been dethroned...","post_message":"A new celebrity has claimed the top spot on Instagram, setting a record on the social media site ----> @webpagelink"},{"comment_id":"1243590202327674","commenter_b":"Hmmmm maybe we should stop any more Christians from coming to the US","commenter_a":"WTH is wrong with people!!!","post_message":"\"Nothing can describe the pain and sorrow of the remaining family members.\""},{"comment_id":"1308410459173725","commenter_b":"@username, you are spinning it. I said he can't run it, but he certainly doesn't have to give up ownership. Then tell me how the Clintons were able to run the Clinton Foundation when Billy was in office ? Yeah they found something in Benghazi. They found four dead Americans that pleaded for help. They found gross negligence and mishandling of top secret information on Lying Hillary's emails. Are you saying that's not true ? Name one significant contribution that Lying Hillary has done on her own besides being first lady and riding her husband's coattails a husband who she couldn't even keep happy so he found his entertainment elsewhere. Not to mention a husband that was impeached. She is filthy rich, she take huge donations from corporations, her Clinton Foundation is under investigation for taking money from known terrorists countries, she voted for the war we are in now. ...","commenter_a":"It is an abuse of tax payers dollars and highly unethical for obama to give Hillary a ride on Air Force One. She should campaign on her own dime just like Trump has to. Do you think obama would give Trump a ride ? Hell no he wouldn't. So why should Hillary get a ride ?","post_message":"President Obama plans to give Hillary Clinton a lift on Air Force One to their joint appearance, and Donald J. Trump is asking a question that has a complicated answer."},{"comment_id":"421525971373828","commenter_b":"Stop apologizing women! I had an abortion, cause I wanted to and no one ever new! Lol! Ya know why, cause its not your business! Stop saying ,well my birth control didn't work, blah blah blah. Its not illegal! If you don't like abortions, don't have one.","commenter_a":"What does that actually have to do with abortion? Viagra is not causing the death of a living being. It's not about hurting women's reproductive decisions. I mean, I'm all for birth control methods. Just imagine how many abortions could've been avoided if the women were using a very effective form of birth control? And, before anyone says that you can get pregnant on birth control or while using condoms, let me just state that it is over 99% effective if used properly. Although it is possible, it would be a fairly rare occurrence.","post_message":"\"I purposely tried to make it as invasive, as intrusive, as hypocritical and unnecessary as possible,\" the lawmaker said."},{"comment_id":"434665249991403","commenter_b":"Like Ms. Richards said \" get over it\"","commenter_a":"The supreme court has been and is political. It has jettisoned the straight forward and logical meaning of the Constitution in a growing social activism. The concept of heterosexual marriage has been intact from the beginning of historical time...until the present attempts to normalize the homosexual perversion . Legal liasons by contract have always been possible to all persons but the attempts to socially institutionalize and legally legitimize homosexual marriage as an equal and legitimate alternative to heterosexual marriage will never legitimize it. It may legalize it - but unborn baby murder is legal but will never be morally normal nor moral.","post_message":"Rick Santorum thinks that Congress should fight the Supreme Court if the court rules in favor of gay marriage. Is he right or wrong?"}]
