[{"comment_id":"907989709297282","commenter_b":"This story will be huge until the next huge story comes along.","commenter_a":"Don't care .","post_message":"Could Bruce Jenner's announcement be a turning point for the transgender community?"},{"comment_id":"788324967967350","commenter_b":"When all is over and you. Round up the clowns for arrest make sure you get this bimbo she cared nothing about any of us","commenter_a":"I agree idiocy speaks for itself.","post_message":"I can't believe this.....I knew they were stupid but stupid and dangerous?!? COME ON."},{"comment_id":"10153470128239497","commenter_b":"Get outta here!","commenter_a":"Strange new cult forming under my guidance 😈","post_message":"\"Somehow, the account management team has forged a society all its own.\""},{"comment_id":"1311513512199990","commenter_b":"So Slick Willies wife is the answer, LOL","commenter_a":"Trump is a symptom. He makes it easy for people to place the blame on him because, let's face it, he thinks he's smarter than he's capable of being. But, the vitriol and hate that is so easy to see NOW has always been there, simmering. Trump is a boil, a symptom of an untreated infection. People need to take a good look at themselves, their friends, their families, and their neighbors if they really want to understand the \"virus\" and the \"unreason\". It isn't as distant as Donald Trump.","post_message":"American history is littered with \"narcissistic demagogues who lie and distort in pursuit of power and self-promotion. Bullies all, swaggering across the landscape with fistfuls of false promises, smears, innuendo and hatred for others, spite and spittle for anyone of a different race, faith, gender or nationality.\" -- Bill Moyers and Michael Winship."},{"comment_id":"606686526157968","commenter_b":"@username I'm coming to rape and murder ur whole family","commenter_a":"Why not use that time, money, and tech to sniff out cancer, instead of destroying addicts lives by throwing them in a cell with rapists and murders?","post_message":"It's so powerful, it had to be calibrated in the pristine air of Antarctica — one of the few places in the world where it would read true zero."},{"comment_id":"10152904243581636","commenter_b":"If she wanted to kill herself she would have hope she frys!","commenter_a":"Those poor babies. This poor woman. I can't say I understand killing her babies, but she is very obviously severely depressed. I only wish she had gotten the medical attention she so clearly needs before she took such drastic measures.","post_message":"Officials say a Connecticut mother who allegedly murdered her two children left a suicide note next to the children bodies, explaining why she killed them."},{"comment_id":"10153283394148984","commenter_b":"She needs to be in the big house not the white house","commenter_a":"Grill her ass !","post_message":"Trey Gowdy has invited Hillary Clinton to testify, in private, on her decision to delete thousands of emails from her private server as well as the full scope of her responsibility in the 2012 attacks at Benghazi. Let Rep. Trey Gowdy know how you feel and customize an email just for him!"}]
