[{"comment_id":"1901824630047376","commenter_b":"Meant to be","commenter_a":"Catherine her name... :)","post_message":"She’s a Republican college student and she’s proof that marching is about more than politics. #WomensMarch"},{"comment_id":"991971067506900","commenter_b":"Islam IS the Problem !!","commenter_a":"That would stop all protests if you take a couple of the looters out!!","post_message":"\"After handing over his ID card, the terrorist stabbed one of the officers in the neck and another one in the upper body.\""},{"comment_id":"1193851514016933","commenter_b":"You losers already get my money in taxes. I pay for your food stamps and slow check every month!","commenter_a":"We wuz kangs","post_message":"Just in time for Christmas!"},{"comment_id":"10153908275696545","commenter_b":"@username the problem with the wall is it can be breached and take years to build, and will still have to be guarded. How about we just beef up border patrol and guard our country the way it was intended? If you research you will find that there are miles of tunnels already that bypass above ground entry. Although we have National guard at the borders they have no jurisdiction to stop anyone from entry and can only alert border patrol. If border patrol is busy elsewhere then the illegal immigrants are not stopped. These are the issues that need to be addressed building a wall is useless as we will still have the same problem not enough manpower to protect it.","commenter_a":" the \"wall\" is the most ridiculous idea to come out of a politician yet. Good luck getting Mexico to pay. How about you use common sense and get congress to give up funds for proper border patrol?","post_message":"If Donald Trump is softening his stance on undocumented immigrants, he didn't mention it to several thousand supporters at the Travis County Expo on Tuesday night. “We are going to build the wall,” Trump said to cheers. “And who’s going to pay for the wall? Mexico!”"},{"comment_id":"1318671731495117","commenter_b":"So basically women have no rights to privacy in a woman's bathroom or locker room. So women have no rights in Washington State.","commenter_a":"They make a law for about one hundred (max) people. The Washington government doesn't think much of all the rest of the states people do they. What a waste of time.","post_message":"Big Brother is watching"},{"comment_id":"10153562599204087","commenter_b":"#DumpTrump","commenter_a":"cruz your a fool the media has been trying to destroy trump and help you. cruz you are stupid","post_message":"“Every accusation you raised is incorrect,” Ted Cruz told Fox News host Chris Wallace when asked about his campaign’s role in spreading falsehoods about rival Ben Carson in Iowa. “I appreciate you reading the Donald Trump attack file on that.”"},{"comment_id":"10152975467087232","commenter_b":"Would you like them to put a gas grill up there! Get a life California your state has more problems to deal with other than a treehouse","commenter_a":"Their property it should be their choice","post_message":"This California family's treehouse is pretty sweet! But a judge ruled it has got to change. DETAILS---> @webpagelink"}]
