[{"comment_id":"913202388702552","commenter_b":"For women, there's always danger no matter how much you use your head.","commenter_a":"No danger if you use your head. Crime is down in most of the civilized world. The news cycle is just longer.","post_message":"\"Are you alone?\""},{"comment_id":"10152919448276636","commenter_b":"May I remind people of this classic. I used to watch it at my Granny's house every Saturday. @webpagelink","commenter_a":"Racism is an intentional act. This is not racism. Just because it sounds the same does not make it a slur on Pakistani's in any way shape or form. It's a different spelling with a different meaning entirely. whomever started this nonsense needs to be kicked in the butt for trying to stir up trouble.","post_message":"The WHAT are out of containment?"},{"comment_id":"10154317818991336","commenter_b":"F*** Donald Trump's daughter she a hoe and she look like sid from the ice age BOIIIIIIIIIIIIIIIIII","commenter_a":"The one Trump said he'd sleep with if she wasn't his daughter . What a sick disgusting man","post_message":"Ivanka Trump is a natural!"},{"comment_id":"690670874378549","commenter_b":"God I know! All those gay people marrying will turn back straight! Let's hope this works!","commenter_a":"It will take years to undo all the harm that is being done now. We have laws that we should respect and stand by.","post_message":"Even though the Supreme Court made clear in United States v. Windsor that the federal government should defer to state \"choices about who may be married,\" the Obama Administration has disregarded state marriage laws enacted by democratically-elected legislatures to uphold traditional marriage. I support traditional marriage and we should reject attempts by the Obama Administration to force same-sex marriage on all 50 states. The State Marriage Defense Act helps safeguard the ability of states to preserve traditional marriage for their citizens."},{"comment_id":"1160927630633650","commenter_b":"I don't care, I eat it. Yum yum.","commenter_a":"But this is exactly what you do when you eat meat, fish or any kind of breathing animal....but you don't realise because someone did the dirty job for you. Wake up animal eaters.","post_message":"Not what you want to see when you're out shopping"},{"comment_id":"10154366303774749","commenter_b":"British Airways are a really bad airline, I would not trust a child of mine to them!","commenter_a":"If you can afford a top boarding school then you can afford a return ticket. Maximise revenue from those with plenty of disposable income to subsidise economy travel sounds like an excellent way to do things - well done BA.","post_message":"Parents will now have to travel thousands of miles to see off their children."},{"comment_id":"1164111043641758","commenter_b":"that is not Trump8 wife","commenter_a":"Hey if you got it show it","post_message":"Liberals Attack Trump Family After Sexy Photos Of Ivanka Trump Leak. Let's show her our support. Do you stand behind the Trump family?"}]
