[{"comment_id":"627551224082449","commenter_b":"What a nasty woman. ...","commenter_a":"Rosie is totally against any heterosexual type of sex,she would prefer all people were gay like her.s","post_message":"Rosie O'Donnell called Donald Trump a “demented human being,\" a “sexual predator,” and several other nasty things."},{"comment_id":"659700944220484","commenter_b":"yes beat her ass for being arrogant","commenter_a":"REALLY,??","post_message":"This entitled woman just demanded a free drink... Because of slavery? This is absolutely ridiculous. We owe her nothing. Should she be compensated for slavery?"},{"comment_id":"10153156704581051","commenter_b":"So what should he have done? If a chick is crazy like this chances are she isn't just gonna let him walk away. Men can be abused to and it's never right her ass is exactly where it should be.","commenter_a":"What kind of wimp does a guy have to be to call the police because his girl friend slapped his sensitive little face, and hurt his widdle feelings.","post_message":"This woman set up a secret camera to keep an eye on her boyfriend. When she reviewed the footage and saw what he was doing while she was gone, she snapped."},{"comment_id":"1738569013030719","commenter_b":"Hoe","commenter_a":"Alex Keira Keir Craig","post_message":"I'm gonna make love in this Snapstory with you, Usher."},{"comment_id":"10153531344506077","commenter_b":"Well said!","commenter_a":"Apparently some of the people on this thread see this move by the Colorado governor as a humanitarian move. Well when the carnage starts in Colorado, we will see just how humane the move was. Every citizen of this country that has a gun needs to lock and load because what happened in Paris is coming here! If you can't see the truth then you are just as blind and ignorant as our so called leaders! I hope you do not suffer in pain long when your ignorance comes back to bite you in the butt.","post_message":"JUST IN: Colorado will NOT join the growing number of states that are refusing to accept Syrian refugees following the Paris terrorist attacks."},{"comment_id":"10155226667000579","commenter_b":"Then you better understand that and take help from the one aligned closest to you which includes conservatives of all races.","commenter_a":"White males are the least served segment in British education.","post_message":"British Prime Minister Theresa May: \"I am pleased that I am able to meet President Trump so early in his administration.That is a sign of the strength of the special relationship between the United Kingdom and the United States of America.\" Full video of Primer Minister's Questions here: @webpagelink"},{"comment_id":"1240488536029680","commenter_b":"Would she use such foul mouth language if so she would be in the gutter with you","commenter_a":"And I really think she would of said \" you're the anti Christ you cunt\" that's what she would of said to hitlary Clinton","post_message":"The late, great Mother Teresa was just sainted, but what she said about Hillary before she died will come as a surprise to a LOT of people. Everyone in America needs to see what she said about Hillary before she died."}]
