[{"comment_id":"10155505963450354","commenter_b":"What about the other female that had a hold of the flag?","commenter_a":"Brava patriot.","post_message":"“I was just going over there to pick up the flag off the ground.\""},{"comment_id":"1074021369287319","commenter_b":"She's negative. ..kinda like both of u ... f off","commenter_a":"Beyonce is an asshole","post_message":"Not a lot people noticed, but Beyonce took a major stand last night."},{"comment_id":"1184855771553940","commenter_b":"I won't be watching @username tonight. I will not be watching that Hag!! Why is @username making such a big deal out of THAT LYING WITCH??","commenter_a":"Here's me not watching","post_message":"\"We know that Russian intelligence services... hacked into the DNC.\" Today on \"Fox News Sunday,\" Hillary Clinton commented on the recent hack and Donald J. Trump's attitude towards Putin."},{"comment_id":"10153231905295047","commenter_b":"Obama must be stopped, or the Supreme Court is complicit in his wrongful actions.","commenter_a":"Qut saying it, DO IT.","post_message":"When President Obama circumvents Congress to rewrite the law, he's acting more like a king than a President. His illegal Executive overreach must be stopped. Sign and Share our Supreme Court brief to take action: @webpagelink"},{"comment_id":"1212525308785662","commenter_b":"HILLARY GOING TO PRISON. NA NA NA NA NA!","commenter_a":"Trump Pence 2016 Make America Great Again","post_message":"On Friday, FBI Director James Comey bowed to partisan pressure and released a vague and inappropriate letter to Congress that only serves to give Republicans a new line of attack against Hillary. Here's what we've learned from news reports: The emails may not have been to or from Hillary. The emails weren’t even ever on her server. The FBI case has not been re-opened. HFA Press Secretary Brian Fallon breaks it down."},{"comment_id":"10153476529996756","commenter_b":"I think they assume they can just take take take, and someone will eventually design a self sustaining space station and then they'll buy it.","commenter_a":"I don't understand why the Masters of the Planet want to destroy the planet.","post_message":"A provision in the TPP allows corporations to sue governments for limiting their ability to compete in a market, which critics say could undercut food labeling policies that promote healthier food choices and make it more difficult to battle rising obesity rates."},{"comment_id":"10153715953211336","commenter_b":"America can't wait for these 'Rug Rats' to grow up. We need action NOW.","commenter_a":"Very true!!","post_message":"ICYMI: Dr. Ben Carson said that fiscal irresponsibility is ruining the future for younger generations. What do you think? More from the GOP candidates at the Values Voter Summit: @webpagelink"}]
