[{"comment_id":"1231833570240008","commenter_b":"We voted for Obama twice now we are racist. A lot of african's and Hispanics voted for Trump. If Hillary would have been a better candidate and visited the states Trump won she would be president.","commenter_a":"And you're saying that the BLM, BLACK PANTHERS are any different. This shows how blind that you are","post_message":"\"These white Americans tuck their heads under cone-shaped hats and American flags ... training their guns on the unarmed, the innocent, the scared ...\""},{"comment_id":"1736087096643244","commenter_b":"She can dig as much dirt as she wants. We all see right through her. What a loser.","commenter_a":"Lied and busted on national tv","post_message":"Alicia Machado blames Donald Trump for her two eating disorders..."},{"comment_id":"10153954425955329","commenter_b":"Hahahaha her get away!","commenter_a":"@username, Jane Archer, @username, @username, can you please pleeeease do this with Poppi, Ricky, Harlou and Max?!?!?! HILARIOUS!","post_message":"brb gonna go test my dog's loyalty"},{"comment_id":"1528607397159285","commenter_b":"Nobody has proved that Russia is behind it .","commenter_a":"I just can't take how Trump supporters defend this disgusting and vile piece of trash! Let's vote based solely on platform! Everyone keeps saying that they both have a lot of baggage, so let's level the playing field.","post_message":"\"To profess not to know at this point is willful misrepresentation,\" an official said."},{"comment_id":"10154228766276523","commenter_b":"All over being asked about a reusable bag?! How is that racist? Crazy woman.","commenter_a":"Wow. Fox 6 is really becoming a rag show. Too bad they used to cover the news.","post_message":"All this -- because she was unhappy after being asked about purchasing a reusable bag at the craft store."},{"comment_id":"10156346245355354","commenter_b":"She should have been body shamed. What body she has that is.","commenter_a":"How about just a useless cunt?","post_message":"READ what anti-America donut-licker Ariana Grande wrote. Genuine pain from being 'body shamed'? Or shameless PR stunt to gain sympathy?"},{"comment_id":"10156090164245354","commenter_b":"She not a little fat she a Big FatASS just saying.","commenter_a":"maybe she deserves execution,someone must think she has creepy perv eyes,and she,s fat","post_message":"Here's what we're dealing with, folks…"}]
