[{"comment_id":"675106442643073","commenter_b":"Well, you are just a stupid BITCH! What say you now?","commenter_a":"that would be you Warren and you're a loon.","post_message":"If Democrats REALLY believed Trump's speech was ineffective, they'd want him to give MORE speeches like that, not fewer."},{"comment_id":"10152873946396045","commenter_b":"she is an idiot","commenter_a":"I think most people who don't like her are sore about her portrayals of Sarah Palin.","post_message":"Tina Fey literally gave David Letterman the dress off her back -- right there on the spot, leaving her stripped down to her Spanx, which had a special goodbye message written on them. #lastdressever"},{"comment_id":"1089512117777571","commenter_b":"YEP CLINTON RAN TO CANADA","commenter_a":"Blame Carter. If he hadn't pardoned Clinton for draft dodging we wouldn't be in this pickle.","post_message":"SHOCKING VIDEO: US Marine Booed, Removed From Clinton Rally For Asking Legitimate Question WATCH THIS! @webpagelink"},{"comment_id":"10153191536946051","commenter_b":"I was thinking of eradication of the scum and I don't care what color they are!","commenter_a":"Doesn't matter what nationality, they need there legs broken, if that was my daughter?","post_message":"This teen was at the gas station with her boyfriend when a group approached them."},{"comment_id":"828114997284754","commenter_b":"Can goats give consent?","commenter_a":"Polygamy is next. Then incest not far behind. Chris you gonna marry a goat?","post_message":"BREAKING"},{"comment_id":"585707061582274","commenter_b":"Zoe, your doctor told YOU not to lift that amount of weight. If the doctor told that woman not to, I'm pretty sure she'd stop. Everyone's body is different.","commenter_a":"This is just sad , smh more concerned about looking fit and all that , be healthy that's what that baby needs not for you to be fit. Wait till the baby is born and get to your regular routine. I really hope the baby comes out ok smh all that shaking and heavy lifting Pretty sure you just gave that child problems","post_message":"Fitness Model Chontel Duncan Isn't Stopping Her Intense Workout Sessions Even During Her Pregnancy!"},{"comment_id":"10154840389483256","commenter_b":"Mine Fuhror has a real hard on for the $500BILLION dollar oil deal with the Russians.","commenter_a":"Trump keeps finding the billionaires who will so care about the United States and her citizens, I am sure. Are the pigs flying yet?","post_message":"President-elect Donald Trump is expected to select Exxon Mobil chief executive Rex Tillerson as secretary of state, elevating a dark-horse prospect who seems to have surged past seasoned political actors like Mitt Romney and Sen. Bob Corker, R-Tenn., in the stretch."}]
