[{"comment_id":"10152860083811051","commenter_b":"Rene this country still has racism because some blacks won't let it go and grow up And Larry NOBODY wants this president to stay with him tearing down America and acting like a dictator. Remember what happened to hitler???","commenter_a":"Wtf is OBAMA IF NOT A DISGRACE AND EMBARRASSMENT?????","post_message":"President Obama just said that some Senators have become an embarrassment to the United States. And he didn't stop there."},{"comment_id":"1329308387112427","commenter_b":"Muslims just can't adapt to modern society. Their value system is based on lower less evolved emotions and weaker minds","commenter_a":"Simple solution leave go back to where you came from","post_message":"DO THEY EVER STOP WHINING?"},{"comment_id":"524602671063646","commenter_b":"this is america fuck islam","commenter_a":"Go Texas","post_message":"Texas sends huge message to Muslims everywhere, and they're not happy. Let them be angry. This America and if you don't like it, get out. Do you agree that Muslims should assimilate or leave?"},{"comment_id":"10153240346384087","commenter_b":"You are remarkably uninformed. Why do you passively accept propaganda?","commenter_a":"Abortions account for over 86% of Planned Parenthood revenues, according to President Cecile Richards, who makes over $520,000 annually. Richards made the admission while testifying before the House Oversight and Government Reform Committee on Tuesday. @webpagelink","post_message":"Rep. Jim Jordan interrupted Planned Parenthood President and CEO Cecile Richards 19 times in five minutes as he grilled her about the previous apology she had given about the leaked footage."},{"comment_id":"10156208772020354","commenter_b":"Now","commenter_a":"I agree....!","post_message":"\"We’re like… Charlie Brown trying to kick the football every time and they keep taking it away…I encourage the Republican Party to get off their ass and fight like we pay them to.”"},{"comment_id":"10152999790806167","commenter_b":"I would pay money to watch Nikki Haley and the vampire fight each other.","commenter_a":"conservative firebrand???lol whatever! she is a delusional racist self hating woman!","post_message":"Fact: Governor Nikki Haley was born in South Carolina."},{"comment_id":"10154442416273701","commenter_b":"You wouldn't likely notice a player. This woman was doing something else, I'm sure.","commenter_a":"Am I the only one that thinks it's disrespectful to be playing in a cemetery??","post_message":"Authorities in New Jersey say a woman trying to catch Pokemon in a cemetery ended up stuck in a tree and had to call 911 to rescue her."}]
