[{"comment_id":"10153167485887411","commenter_b":"Yes this is true but the vaccinated are less likely to display the symptoms or be effected. The only ones who will be most effected is those who are under vaccinated or not vaccinated. But aP does not cause the disease. Only prevents the vaccinated from having the most severe form of the illness.","commenter_a":"I'll just leave this here...... @webpagelink","post_message":"A mother's Facebook post pleading with people to vaccinate their children is going viral Note: This video may be difficult for some viewers to watch"},{"comment_id":"472128496314627","commenter_b":"Yeah lol she cray","commenter_a":"She was talking all kinds of mess about Prince. Maybe someone scooped her up for interrogation.","post_message":"Irish singer Sinead O'Connor was reported missing Monday a day after she went on a bike ride in the posh Chicago suburb of Wilmette and did not return."},{"comment_id":"10153331203624614","commenter_b":"@username Sure, black bears are much smaller than grizzly bears, and a couple of humans could scare it away","commenter_a":"What I noticed was all the younger guys running and totally leaving the few elderly people behind...shame :/","post_message":"A Montana wildlife official captured video of an unnerving encounter between humans and bears on a bridge in Yellowstone National Park. The footage shows several apparent tourists making a dash to safety after finding themselves a little too close to a black bear sow and her three cubs. No one was injured in the incident, and the animals made their way safely back to the forest, officials said. Read KTLA's story here: @webpagelink"},{"comment_id":"10153182713489030","commenter_b":"You're clearly loose butthole","commenter_a":"Yeah, this show is as stupid as every druggy I have ever met, and not even close to being funny, uless you are a druggy too.","post_message":"Vote for Seth Rogen and Zac Efron's Workaholics video in this year's Webby Awards People's Voice. @webpagelink"},{"comment_id":"1757645291122332","commenter_b":"@username or because the people who own the farms/fields can get away with paying illegals less money than legal citizens. Lived in a farming town and saw it happen all the time. I have no problems with anyone coming here legally, paying taxes and doing everything else American citizens do.","commenter_a":"This video only proves that we need Trump. Every statistic stated was \"illegal\" immigrants working in our country. I honestly thought it was a joke. Time for Americans to start working again and quit hiring illegals to do the jobs.","post_message":"If Donald Trump's immigration plan came true, the results would be scary. See the biggest immigration myths here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"10153425462103271","commenter_b":"When is she to be put in a mental institution for the rest of her life, if I had a family member killed I would come after her, she is probably in hiding by now. If a woman wants an abortion THAT IS HER RIGHT TO DO SO.","commenter_a":"This is how far out these repubs go to make themselves look good to their GOP base.","post_message":"WEIGH IN: In a Facebook post, JoAnn Windholz calls Planned Parenthood a \"culprit\" and \"the true instigator.\" Read the full statement. Your thoughts?"},{"comment_id":"1072309979477455","commenter_b":"So basically she is happy wearing those 40 yards. If she wasn't she wouldn't be wearing it","commenter_a":"I hope she's happy wearing 40 yards of material everyday! Happiness is a warm burka....","post_message":"VIDEO: United Arab Emirates appoints first minister of happiness"}]
