[{"comment_id":"10157096096500725","commenter_b":"Trump and his supporters can go ahead and choke on a Nigerian cock","commenter_a":"Yet another reason Billy Joel sucks....he's supporting DollHands Donny!","post_message":"Thank you Billy Joel- many friends just told me you gave a very kind shoutout at MSG. Appreciate it- love your music!"},{"comment_id":"10153021008650326","commenter_b":"Creepy man-woman!","commenter_a":"LOSER","post_message":""},{"comment_id":"10155685513649838","commenter_b":"Build a wall or simply arrest business owners for hiring illegals","commenter_a":"Curtail \"illegal\" immigration.,......why is it so hard for liberals to grasp the concept of \"illegal\" ? Great having a \"difference maker\" with a backbone back in the White House.","post_message":"Trump plans to sign an executive order today to direct federal funds to be shifted toward the building of a wall on the southern border, a signature promise of his campaign. He has argued that doing so is vital to gaining control over the illegal flow of immigrants into the United States."},{"comment_id":"10153460551006051","commenter_b":"It's nobody's damn business what she does with her home","commenter_a":"He should get out of this woman's property . However by all accounts it is not her home. She could rent it out, she could house a family . It doesn't seem right just to let the house sit there when so many are in need.","post_message":"This guy stole a 70-year-old woman’s home. On Wednesday, a judge decided whether he could keep it."},{"comment_id":"10153543758049753","commenter_b":"i hate this bitch","commenter_a":"You should start packing, so your ready when time comes","post_message":"According to Whoopi Goldberg, America will no longer be such a great nation if Donald Trump is elected. She shared this opinion Wednesday on The View where she stars as a cohost. This is what she said: “I’ve always been an American, and this has always been my country, and we’ve always been able to have discussions. And suddenly now it’s turning into, you know, ‘not them, not them.’ And you know, we have a lot of friends whose parents saw this already. They don’t want to relive this. They... @webpagelink"},{"comment_id":"1660263367594109","commenter_b":"May be we should shove firecracker up their A-- & see how they like it. God bless America","commenter_a":"Awesome. ..thank you...","post_message":"\"If you have the right to burn my flag, then i have the right to kick your ass.\" - Creed Fisher"},{"comment_id":"1058499540933711","commenter_b":"@username ... You love those liars, don't you.","commenter_a":"Women, would you want your children to have Trump as their Teacher? Their Minister? How about as your kids Father? if you said no to any of those, then you don't want Trump as your president either.","post_message":"“And when you’re a star they let you do it,” Trump says. “Grab them by the p---y. You can do anything.”"}]
