[{"comment_id":"968475119944707","commenter_b":"Man this website is So So So Biased, how can you take a political stance all day long to put down trump(4 to 5 articles a day) trump is this, trump is that, can we even call you a news website anymore??? How much money did the hill team fill your coffers with??? Do you not care about the world?? It's bleeding out in the middleeast :( you completely put out the best prospective candidates bernie, Jill, Gary. You leave trump cuz he doesn't say too many intelligent things but he is more human than any of the Warhawks that's been running the murica for a decade now!!!! Please people we need to spread the truth and love not put people down and dish out hate all day!!! Here's my finger to you Huffington","commenter_a":"put a toothbrush moustache on hillary and then it would be appropriate to yell 'heil hillary!' What is going on in 2016, appears to match severial elements to the 1934 German presidental election. For example: 2016 Democrate liberials ruthlessly beating up on Republican voters. Local Police (Fresno Ca) allowing violence as a policital objective at a Trump event. Propaganda; political acuity against conservative thought and the deceptiveness of 90% the media to sway voters towards hillary. Can anyone define all the promises from this great fuhrer hillary to buy their votes? HEIL HILLARY! Even the Universities and High Schools are exercising power over speech they disagree with. This is a time of struggle 'Kampfjahre.'","post_message":"They really got riled up about his birther-announcement fiasco."},{"comment_id":"10153276508787144","commenter_b":"I certainly hope you don't have daughters with that repulsive, misogynistic mouth.","commenter_a":"Grace under fire?? I just love how you baby murdering dirtbag sluts try to make yourselves out to be the victims instead of the human beings you kill. Why don't you show the exchange how it really happened? @webpagelink","post_message":"Yep."},{"comment_id":"10154042620823717","commenter_b":"Go away and take your predator husband with you.","commenter_a":"UPDATE: Hillary Clinton has expressed regret for calling 'half' of Donald J. Trump supporters 'deplorables.' \"Last night I was 'grossly generalistic,' and that's never a good idea. I regret saying 'half' -- that was wrong.\" @webpagelink","post_message":"UPDATE: Hillary Clinton has expressed regret for calling 'half' of Trump supporters 'deplorables.' \"Last night I was 'grossly generalistic,' and that's never a good idea. I regret saying 'half' -- that was wrong.\" @webpagelink --- Donald J. Trump and Republicans quickly pounced on the remarks, which drew comparisons to President Obama's comments about clinging to \"guns and religion\" at a 2008 campaign fundraiser and Mitt Romney's \"47 percent\" remark in 2012. @webpagelink"},{"comment_id":"902484503120305","commenter_b":"She will never be a first lady! She spouts her mouth in the wrong direction! Lady you are suppose to set an example for red white black brown or any other color of people in United States! Instead you keep things stirred up, you and your so called husband!!","commenter_a":"Oh, she is the racist. She hate her own kind. Disgusting.","post_message":"Jaw-dropping!"},{"comment_id":"10153134474569369","commenter_b":"@username so then bill Russell should be the greatest to ever play if where talking about rings you idiot SMH it's not about the rings stupid head","commenter_a":"M. J. Loyal to his team.","post_message":"It's one of the big sporting questions of our time."},{"comment_id":"10152674104515667","commenter_b":"Leave her alone!","commenter_a":"She's not bald, she just had her hair pulled back. But even if she was bald she still looks beautiful.","post_message":"ICYMI: Michelle Obama looked a bit different on Wednesday's episode of \"Jeopardy!\""},{"comment_id":"10153609828841051","commenter_b":"and where are these little bastards from ? shot there little asses down like the dogs they are and make there parents pay for this lady for the rest of her life and a huge settlement to her first.","commenter_a":"People are VENDICTIVE!!!! Mean...and must be CRAZY! What makes people want to do these things! We need an island , or send them to the Muslim area. There they will see what CRAZY IS!!!","post_message":"First these boys attacked an 87-year-old woman. Then they raped her. And then they poured bleach down her throat."}]
