[{"comment_id":"10153286893164032","commenter_b":"She does not have the authority to get rid of common core. That will have to go through the state legislature and governor. She's all talk with nothing to support her. She truly is an embarrassment to her job and party.","commenter_a":"Bye bye common core. It sucks. The testing needs to stay. But common core needs to be kick-booted out. Talk about lowering self esteem for kids who already struggled before with math. Always a fun time in my house with my 4th grader.","post_message":"#BREAKING: Arizona students would take fewer standardized tests and Common Core standards would be thrown out under a plan just announced by schools chief Diane Douglas. Here's a look at what else she has in mind."},{"comment_id":"10153648963644203","commenter_b":"I assure you, Hillary has more political experience than ALL the male candidates. Her being female just makes it better. You men who hate powerful females are gonna be maaaaad! lol","commenter_a":"I think so. It's equally difficult to imagine what Hillary Clinton's appeal to anyone, women included, is.","post_message":"\"Being a woman does not give you the right to be the next president. Whether you Carly Fiorina or Hillary Clinton. It going to be your campaign that matters.\""},{"comment_id":"1878310592388061","commenter_b":"Deport this muslim.","commenter_a":"The Quran should not be recognized as","post_message":"First Somali-Muslim Lawmaker Who Married Her Brother Was Just Sworn In, And Americans INSTANTLY Noticed What She Had Her Hand On Top Of! This is ILLEGAL! Sharia is non compliant!"},{"comment_id":"1150301004990909","commenter_b":"Awww don't be jealous little bitch","commenter_a":"Hahaha typical chicken shit Americans","post_message":"For the first time in twelve years the United States has experienced a death from measles."},{"comment_id":"10153636348708132","commenter_b":"Eww she ugly","commenter_a":"I love her comedy routines and I think she is beautiful. I like to hold hips not bones.","post_message":"The endlessly quotable Amy Schumer!"},{"comment_id":"10155104140119497","commenter_b":"Build that wall, watch all the libs fall on ground kicking ...priceless..let the shit show begin...popcorn anyone?","commenter_a":"I thought the Onion was supposed to be funny.","post_message":"How The Border Wall Will Be Built"},{"comment_id":"10153019047726130","commenter_b":"Not every cheerleader is a slut.","commenter_a":"meeting the cheerleader at the dance so you can go someplace else and apply what you have learned!!!!","post_message":"Young people still aren't getting much from sex ed."}]
