[{"comment_id":"762776387211747","commenter_b":"Eu vir isso acho que quinta feira, incrível né❤","commenter_a":"Helton Carlos","post_message":"You can now turn your drawings into real clothing."},{"comment_id":"959639310819514","commenter_b":"Maybe they should also be deported.","commenter_a":"I love the idea!","post_message":"ClashDaily.com"},{"comment_id":"10154060235711336","commenter_b":"Refuse to have hearings on any potential candidate until after the election.","commenter_a":"Quit following this piece of trash. Go back to Cuba where you came from.","post_message":"“We risk losing our basic constitutional rights with one more liberal justice on the court.” Sen. Ted Cruz reacted to the passing of Supreme Court Justice Antonin Scalia, saying this loss “underscores the stakes of this election.” Do you agree? @webpagelink"},{"comment_id":"1027408730682076","commenter_b":"She is so stupid","commenter_a":"Ur one dumb B****!!!!!!","post_message":"@webpagelink"},{"comment_id":"484808285062410","commenter_b":"Illegals are actually working for money other than the \"Americans\" begging for money on a corner","commenter_a":"I bet he had a taster for it too. Give away our jobs, let illegals in, give them government money, they never earned, and let the American people suffer. What a great President.","post_message":"President Barack Obama drinks filtered water in Flint, Michigan during a briefing on the ongoing water crisis."},{"comment_id":"1719312091654441","commenter_b":"It sure can happen. We'll see.","commenter_a":"Trump beats Hillary??? Never going to happen. He's too much of a loose cannon.","post_message":"Hillary Has Dark Secrets, Dick Morris Reveals Dick Morris says Trump can defeat Hillary. \"She will lie and cheat at every turn,\" Morris says, \"But Trump needs a new strategy.\" Morris reveals it in his new \"Armageddon: How Trump Can Beat Hillary.\" Get the book here: @webpagelink"},{"comment_id":"10155692576378572","commenter_b":"hit her in the ass with the INK","commenter_a":"good riddence to you old girl you will be replaced go join Isis","post_message":"SHE IS ALSO A HILLARY CLINTON SUPPORTER..."}]
