[{"comment_id":"1446844205342023","commenter_b":"She needs to STFU!!!","commenter_a":"Why publicly, tho? 😡","post_message":"This woman has some nerve...."},{"comment_id":"638594622989083","commenter_b":"@username:: He is. Watched this afternoon & it was good!","commenter_a":"the credibility of cnn as a real news source has is no more....half of the hosts on msnbc are going after Hillary and not focusing on anything that trump does.... and we don't have to say anything about the fair and balanced fox.....it is just sad that trump is getting away with everything....he is the real criminal......but the press doesn't want anyone to know it...it would be bad for ratings.....","post_message":"We've warned them for months: keep pushing the double standard against Hillary and you'll lose all credibility."},{"comment_id":"903300846390748","commenter_b":"Shoot her, her life does not matter here","commenter_a":"All lives matter, but standing on the flag is WRONG","post_message":"REPULSIVE: [VIDEO] WOMAN WALKS ON AMERICAN FLAG AT #BlackLivesMatter PROTEST, As US Service Members In Uniform Turn Their Backs On Her"},{"comment_id":"1325194690833614","commenter_b":"People need to slow down","commenter_a":"I hope this guy gets a huge fine and jail time. He could have killed someone.","post_message":"A driver was not injured after this violent crash that landed on Seattle's Burke-Gilman Trail. Gary Horcher shares the story >> @webpagelink"},{"comment_id":"10154051337399411","commenter_b":"Are you sane, woman?","commenter_a":"A scientific theory is a well-substantiated explanation of some aspect of the natural world that is acquired through the scientific method and repeatedly tested and confirmed through observation and experimentation.","post_message":"If you have proof: bring it. If you do not: acknowledge openly that you have theory perhaps a well-honed, much loved theory, but a theory nonetheless. (Op-Edge by Sam Gerrans)"},{"comment_id":"705870246236573","commenter_b":"Muslim Bakeries also refuse same sex marriage cakes as well it was done under cover and yet No Punishment!","commenter_a":"Yet Muslims can get out of delivering beer on religious grounds and awarded damages. Seems Christians are not afforded the same religious protection.","post_message":"A sweet slice of JUSTICE!"},{"comment_id":"10153436827584153","commenter_b":"very often though.","commenter_a":"it's burning 24/7 don't even try to go there.","post_message":"Would you go vacation in Greece now, despite the economic crisis?"}]
