[{"comment_id":"10153259767028132","commenter_b":"Go back to stinky Bay City!","commenter_a":"Who cares about Madonna. She looked horrible at the Grammys and she has no room to talj","post_message":"Madonna is not a Fifty Shades of Grey fan."},{"comment_id":"953451111362414","commenter_b":"Feminists are annoying","commenter_a":"I think there all cunts so I suppose I am humanist ha...","post_message":"Tonight, Ed Sheeran performed a song about his love life. Feminist Taylor Swift wants to know why no one called him sexist. #Grammys"},{"comment_id":"10153370823461336","commenter_b":"Well Ryan it is better than putting Jenner on the bill","commenter_a":"Megyn Kelly","post_message":"With your help, #TheNew10 will be decided later this summer."},{"comment_id":"10153961148192869","commenter_b":"such a vile, vile woman.","commenter_a":"I don't understand how any woman that has a daughter could vote for Hillary Clinton, sorry she is the poorest excuse for a champion of women and children that I have ever seen.","post_message":"In the war of the Presidential candidates, Donald Trump has taken some heat for his over-the-top characterizations of Hillary Clinton. Admittedly, this is the first campaign in my memory in which one candidate actually called the other a “monster.” But one woman who finds Hillary’s behavior truly monstrous has finally put her name and face behind that charge. This required courage, not just because it goes against the Clintons --- that’s always a scary thing to do --- but also because it relates to the fact that she was raped at age 12 and Hillary defended the man who raped her. The man pleaded guilty to a lesser charge and spent just a few months in jail. This was early in Hillary’s career, in Arkansas, in her one big courtroom trial. (The defendant had reportedly requested a female lawyer.) Certainly every defendant has the Constitutional right to a legal defense, ..."},{"comment_id":"1075404492512556","commenter_b":"WTF was with that woman?!? She's just sitting in there? She should have been out of there so fast and getting those kids out. He had to keep yelling to get her out???? What a Moron. And they just stand there Casually once out??? I might be kissing the kids out of Gratitude that they were alive and Thanking the Officer that saved them. There is something Seriously WRONG with these women.","commenter_a":"So are they the baby sitters? They sure shouldn't be parents!","post_message":"Dramatic footage shows two women and two children being rescued by California Highway Patrol officer after their car catches fire."},{"comment_id":"10153212700939270","commenter_b":"Well I know it was out of service around that time but I'm sure that's what they did but it was a great ship","commenter_a":"Aw darn now no one is safe aboard that ship when that time of the month comes","post_message":""},{"comment_id":"10152814946648822","commenter_b":"Should have been three to six YEARS ! This woman is NUTS !","commenter_a":"I love the people on here, who claim to be about humane treatment of animals; but, they want this woman to get beat to death, while in jail. Hypocrites.","post_message":"The woman accused of stealing and euthanizing her neighbor's dog is headed to jail. Today she was sentenced to 3-6 months for killing the husky named \"Thor.\""}]
