[{"comment_id":"10153667125634087","commenter_b":"@username its like talking to children that can't do math.","commenter_a":"Nate Silver has moved Sanders to winning this primary with a close to 60% chance . Mind you, just DAYS ago he had Hillary with an 80% chance of winning. The wider the margin the merrier. The small Wyoming caucus is next. And Hillary's lead in the April 19th NY primary is down from 30 to 40 point lead down to 12 in the latest poll","post_message":"#BREAKING: Another poll shows Bernie Sanders slightly ahead of Hillary Clinton in the all-important Wisconsin primary"},{"comment_id":"686707531519825","commenter_b":"Don't bother coming back here bitch ! if you do , they need to hang ya.","commenter_a":"Keep her.","post_message":"A woman who left home to join ISIS just got served up some karma. Good. Anyone supporting ISIS is a traitor to America. Click 'LIKE' if you agree!"},{"comment_id":"1529265630712432","commenter_b":"This lady is a nut job and probably has some deep issues that she needs to work on.","commenter_a":"#DavePirnerProblems","post_message":"\"You're saying that I can't have a hairstyle because of your culture? Why?\" the man, who is white, says in the video. \"Because it's my culture,\" says the woman, who is black."},{"comment_id":"10153366601141770","commenter_b":"Where is our freedom of speech??? Keep your rioters away from TRUMP! You all send them with your lies of deceit...so you can have business as usual in Washington! We Americans see right through you...the uneducated don't...or the naive youth..","commenter_a":"what happened to freedom of speech? trump had nothing to do with the violence at his rally in chicago these were paid punks to not let him speek","post_message":"Mitch McConnell told reporters he and Donald J. Trump spoke by phone Tuesday and he encouraged the New York businessman to “condemn” the “violent expressions” at some of his political rallies."},{"comment_id":"10153330396398812","commenter_b":"I was just about to say- and watch all the females flock to this rich young single male Hahaha","commenter_a":"@username i actually think I'm in love","post_message":"This CEO says executive pay is \"out of whack.\" So, he's going to start earning $70,000, like many of his employees: @webpagelink"},{"comment_id":"1311876355490031","commenter_b":"These people should be locked up in cages. We have to be a voice for these poor animals. Set them Free!","commenter_a":"China don't care about shit","post_message":"Tourists take selfies with him"},{"comment_id":"10153721560403984","commenter_b":"We are protected by the Constitution. Christians founded this country. Gay people are harrassing HER, as there are dozens of other local offices that are issuiing these licenses for them. She is defending her faith and beliefs, not harrassing others. Do away with freedom of religion, and America is nothing.","commenter_a":"500%","post_message":"County Clerk Kim Davis has found herself at the center of a national firestorm after refusing to issue gay marriage licenses, even after the Supreme Court's decision. She's even being dragged to court herself, but she refuses to back down. Do you stand with Kim Davis?"}]
