[{"comment_id":"10156220417230354","commenter_b":"Funny how they brought in women who said because of Planned Parenthood they were able to get breat exams. She admitted Planned Parenthood had no mammogram machine! All they do is feel the breast then refer you to an imaging center! Obamacare covers this. Obamacare covers birth control pills as well. Take your pill, no need for an abortion.","commenter_a":"Obamacare (paid by our Taxes) covers all women's health issues and problems - why is Planned Parenthood (which name indicates planning to become a parent) even needed. Women use PP for birth control - seems like double taxation to the taxpayers.","post_message":"Running a human meat grinder and selling human baby parts is lucrative work. And YOUR hard-earned tax dollars help pay for it all!"},{"comment_id":"10152694778793717","commenter_b":"Colebrook....-38","commenter_a":"Berlin -22","post_message":"We're looking for your best guesses for the coldest spot overnight tonight in New Hampshire. Comment below with your guess for the town and temperature, and Kevin Skarupa will reveal who was right Thursday morning!"},{"comment_id":"10154093601280695","commenter_b":"Beautiful ladies","commenter_a":"People say the same about my mom. That we look like sisters. :)","post_message":"We totally guessed wrong."},{"comment_id":"1365265100160183","commenter_b":"Joseph, a woman gave birth to a shadow demon in (I think) season 2.","commenter_a":"Its time to give serious thought of graduating this show to the big screen. Follow the same playbook used by the James Bond.","post_message":"All good things must come to an end. Unfortunately, Game of Thrones is one of them."},{"comment_id":"822359307886042","commenter_b":"It was meant for this baby to live","commenter_a":"God directed that Officer to the area. He is Hero","post_message":"A newborn girl thought to be only 36 to 48 hours old was found alive in Compton on Friday. The baby muffled cries led sheriff deputies to find her buried under pieces of asphalt and rubble inside a crevice near a riverbed. Detectives are now asking anyone with information to come forward. this post to alert others. Read KTLA story here: @webpagelink"},{"comment_id":"10153465168796162","commenter_b":"She shouldn't have said anything. Should not have been on social media while working.","commenter_a":"It's not racist it's just ignorant, she could have just said these rude people","post_message":"Brookfield Zoo responds after an employee posted what some may call a racist comment on social media... @webpagelink"},{"comment_id":"10154065834906323","commenter_b":"Britain has more than enough/too many home grown criminals, that's very true. So what kind of imbecile would want to import more? eg: 1,000 immigrants. 999 workers/1 criminal. That's one too many. How to stop the criminal entering? Let none in. How simple is that?","commenter_a":"I didn't know all UK citizens were perfect law abiding citizens. Those who live in glass houses ... The important stat is crimes per person, EU citizen vs UK citizen, but that'll probably be inconvenient for the leave campaign as most EU immigrants are educated, employed, and tax paying.","post_message":"A dossier of murders and rapes committed by 50 EU citizens in Britain has been published by leading out campaign group Vote Leave, in a move described by critics as “scaremongering of the worst kind”."}]
