[{"comment_id":"10153723426423487","commenter_b":"What the fuck ever. My answer is clear, even if backwards. Bikes should follow the rules, however it is phrased.....jackass.","commenter_a":"Of course they should follow the traffic laws. A bike has been my main mode of transportation for most of my 61 years. We cyclists demand drivers follow every rule and yet many of my fellow cyclists think the rules do not apply to them. They risk their lives, cause wrecks, etc. with careless behavior.","post_message":"What's safest for cyclists and pedestrians? (CityLab)"},{"comment_id":"1008549135942537","commenter_b":"Stupid..and when it doesn't work do they turn in their brooms?","commenter_a":"Pray for our president every day!","post_message":"Witches Plan To Cast A ‘Binding Spell’ On Trump And His Supporters Every Month During The Crescent Moon @webpagelink"},{"comment_id":"10152933844790667","commenter_b":"He probably figured he could demand equality for animals, since now people of same sex can get married. Next, it will be polygamy. Watch the Muslims in the US asking for equality.","commenter_a":"Yep could have gone all day w/o reading this. sick","post_message":"Crawford posted an ad on a popular website soliciting a willing horse owner, according to officials."},{"comment_id":"559309340924025","commenter_b":"Get her fellow","commenter_a":"Lying is her number one forte","post_message":"SHARE to STAND with this NAVY SEAL!"},{"comment_id":"1432544963425545","commenter_b":"As Usual Asian people don't respect anything. They are doomed!","commenter_a":"Typical Asian - they'll eat anything that moves","post_message":"Their cries will make you question everything you put on your plate. How can anyone treat animals this way?"},{"comment_id":"10153167485887411","commenter_b":"Yes this is true but the vaccinated are less likely to display the symptoms or be effected. The only ones who will be most effected is those who are under vaccinated or not vaccinated. But aP does not cause the disease. Only prevents the vaccinated from having the most severe form of the illness.","commenter_a":"I'll just leave this here...... @webpagelink","post_message":"A mother's Facebook post pleading with people to vaccinate their children is going viral Note: This video may be difficult for some viewers to watch"},{"comment_id":"10154173812304205","commenter_b":"As long as she keeps getting elected, she wont feel the need for change!","commenter_a":"If she was a basketball coach, she'd be fired. Continue to work for your district in CA, but someone else from another part of the country like for example a representative from Wisconsin or Michigan should lead. The Democrats are pussies.","post_message":"Nancy Pelosi wants to assure you that everything is fine in the Democratic party. She is wrong."}]
