[{"comment_id":"10152722362786680","commenter_b":"Shut up","commenter_a":"NO","post_message":"\"I think presidents have the right to pick their team.\""},{"comment_id":"10153411171720950","commenter_b":"Ron, please stop being materialistic with cheap cars. Are you trying to intimidate or impress your FB friends? Bad taste, Sir.","commenter_a":"Trump Supporters are not motivated by fears, we're motivated by FED UP! We're tired of our voices being stifled and the liberals/media doing all they can to take our freedom of speech! This time we WILL have the last word! <3 Common Sense Approach! TRUMP! 2016","post_message":"Donald J. Trump: \"We love Nevada!\" Watch his full victory speech after projected GOP caucus win."},{"comment_id":"10153828594101135","commenter_b":"Ignorance at its best","commenter_a":"losers go back to the burbs","post_message":"Supporters of Donald Trump are gathering for a \"flash mob\" on the Wayne State University campus - where Hillary Clinton is scheduled to speak later this afternoon."},{"comment_id":"714217398680845","commenter_b":"Kill all the bad muslims!!","commenter_a":"Muslim POS","post_message":"And he's wasting no time launching his attack..."},{"comment_id":"2077791549112023","commenter_b":"@username, They are both illegal, just being born here doesn't mean a thing if your parents are illegal to begin with. 2 illegals cannot make a legal.","commenter_a":"How did she get there? If she had to fly? I don't fly, don't you need an Id and if she has a letter to be deported, how does this work?","post_message":"Democrats just got busted violating federal law at the DNC convention. This is HUGE, but apparently the law doesn't apply to Democrats. Can you imagine if a Republican had done this?"},{"comment_id":"10154558927621323","commenter_b":"Sex is a biological need. If I'm in a relationship, I am entitled to sex. If she won't provide, I can find someone who will. Using sex as a weapon against men is ABUSE.","commenter_a":"Problem is there are too many uptight women out there. Articles like this don't help either. 'Intimacy'. Words like that make sex sound like some mythical state of enlightenment that we are trying to achieve. When the fact is its just some good old hard core fucking. Get all the mind fuck thoughts out your head and get sucking or licking and you'll soon get into it. We've had hard core porn for years now showing us how to get down and dirty with it so stop making a big deal about it. And if all else fails there's prostitutes who can do the job for you so just sub contract it out and let your partner get some for a change instead of walking round like a sex starved idiot.","post_message":"\"Drink is not the answer.\""},{"comment_id":"1685289261757038","commenter_b":"So true. She needs disarm them!!","commenter_a":"not just disarm, but \"quickly\"","post_message":"Hillary said that guns don't keep you safe. If she really believes that she should demand that her heavily armed bodyguards quickly disarm!"}]
