[{"comment_id":"10154099227939877","commenter_b":"She's stupid... Dont waste your time.","commenter_a":"If you can't cut your vacation short to do your job as president of the united states you aren't fit for the job.","post_message":"Today President Obama visited the flood-ravaged state of Louisiana, despite critics like Donald Trump who say he came too late. Grio Fam, check out what the President promised he would do to help Louisiana going forward. What do you think his trip accomplished? Sound off!"},{"comment_id":"10152750349506130","commenter_b":"Wow your a dumb bitch","commenter_a":"All these comments about donating the dress are so retarded. If a bride can't afford a dress she shouldn't be having a wedding. There's enough poor people getting married and procreating which is gross lol get your own dress and she can do whatever the hell she wants with hers","post_message":"\"I knew that a pity party was the farthest thing from what I wanted or needed.\""},{"comment_id":"10156220417230354","commenter_b":"Funny how they brought in women who said because of Planned Parenthood they were able to get breat exams. She admitted Planned Parenthood had no mammogram machine! All they do is feel the breast then refer you to an imaging center! Obamacare covers this. Obamacare covers birth control pills as well. Take your pill, no need for an abortion.","commenter_a":"Obamacare (paid by our Taxes) covers all women's health issues and problems - why is Planned Parenthood (which name indicates planning to become a parent) even needed. Women use PP for birth control - seems like double taxation to the taxpayers.","post_message":"Running a human meat grinder and selling human baby parts is lucrative work. And YOUR hard-earned tax dollars help pay for it all!"},{"comment_id":"10152724871896045","commenter_b":"She wasn't spanked. She was whipped with a STUDDED belt.","commenter_a":"I wouldn't shame my kid in that way but there's nothing wrong with a spanking. Spare the rod spoil the child. If you don't guide them as parents they don't learn.","post_message":"A Florida woman is charged with child abuse after she sent her daughter to school with a t-shirt shaming her about bad grades. It's what the school noticed after giving the girl a new shirt to wear that got the mother arrested."},{"comment_id":"392535437595004","commenter_b":"What a misogynistic jerk!","commenter_a":"WTF? what a loser! how is this guy in politics? what a loser!","post_message":"No, there's no GOP war on women."},{"comment_id":"10154399903958797","commenter_b":"Idiots!!","commenter_a":"And then people wonder why they are shot. First responders should be licensed to carry and use if needed.","post_message":"WHO DOES THAT?! Two people have been charged with scratching and hitting paramedics on a Red Line platform in the South Loop Sunday night. Officials say the suspects walked up and hit the responders in the face and body before spitting in their faces."},{"comment_id":"439208642934096","commenter_b":"She should be fired !!!!!!!!!!!!!!!!!!!","commenter_a":"The teacher should be fired and possibly sent to Afghanistan!","post_message":"An Illinois teacher was placed on leave after stomping on the American flag in front of students. That teacher should be ashamed; the American flag deserves to be flown everywhere with respect and honor! ForAmerica"}]
