[{"comment_id":"1787645241556279","commenter_b":"They look beautiful, professional and feminine. Certainly classy women.","commenter_a":"These are first class ladies No attitude","post_message":"There's great symbolism in Melania Trump and Ivanka Trump's inauguration style."},{"comment_id":"10156270295245354","commenter_b":"Illegals voting in California this should give the liberals some help. GO Trump !!!","commenter_a":"They focus on Gun Control, in the Debate, they will lose the Election","post_message":"Here's what's on deck for tonight's Democrat presidential debate..."},{"comment_id":"10153226407581770","commenter_b":"Evil scum bags. Send them back!","commenter_a":"Strategically this suicide!","post_message":"When the politicians said \"Refugees Welcome,\" did they know they'd be welcoming a rape culture as well?"},{"comment_id":"1121295257893818","commenter_b":"Maybe the sign should have said \"ladies don't pee on the toilet seat\".","commenter_a":"By the Holy Ghost I am being formed in the Earth! Says the Lord, My Time has Come! When I say, , My Kingdom COMES FORTH! Now is the Day of Salvation! Whoever wants it . Whoever is thirsty for Right and Good, . Whoever is hungry for Love and Peace and Deliverance from evil, . Now is The Time!!! When u Ask me, I give. Whoever Asks will Receive. Believe! Believe! Believe! Now is The Time!","post_message":"The owner of Windy City Pizza posted a sign that appeared to reference the controversial topic of transgender restrooms: @webpagelink"},{"comment_id":"10152841288932061","commenter_b":"I LOVE Johnny Depp and most of his movies. This is disappointing. He should just send them home. Save their lives. They should not have to pay for his stupidity!","commenter_a":"Everyone else has to do this and so do you,Depp!","post_message":"Depp is in Australia to shoot the fifth edition of of the Caribbean, called Men Tell No Tales.\""},{"comment_id":"422053507998163","commenter_b":"After entering into discussions with egocentrics on Abortion, I have concluded the following: 1) Egocentrics callous their minds by clinging to the term fetus. 2) Egocentrics ignore the dictionary primary definition of child, \"1a :an unborn or recently born person\". 3) Egocentrics refuse to acknowledge a child exists until it breaths air. 4) Egocentrics ignore that sexual consent includes consent for sperm and egg to join thereby forming a new human being in the uterus. 5) Egocentrics dehumanize the new human being (child) by hammering the label \"fetus\", completely ignoring the relativity of \" the fetal stage\" development of a child. President Barack Obama told a group that harvesting organs from humans that are killed was and a tradition that needed to stop. He warned of dehumanizing marginal groups of humans and of the problems that arise when are not able to see someone else as a human being.\" Based ...","commenter_a":"No I don't think so","post_message":"Planned Parenthood and the 3% Abortion Myth"},{"comment_id":"1308235872529496","commenter_b":"Such a HORRIBLE breed!! !!","commenter_a":"I hate pit bulls ... If judge Judy doesn't like em.... It's good enough for me .... Example here!!","post_message":"Noah suffered injuries to his head and face and underwent emergency plastic surgery."}]
