[{"comment_id":"10153930858301320","commenter_b":"Hoes will be hoes","commenter_a":"Kinda what he gets for being stupid.","post_message":"It was an expensive night. After a night of clubbing Knicks forward Derrick Williams took these two women back to his apartment and they made off with more than $600,000 worth of jewelry. Details: @webpagelink"},{"comment_id":"10154963214296178","commenter_b":"Did that woman just get out of bed ?","commenter_a":"How is he behaving like an authoritarian? By having the EPA enforce regulations that Congress wouldn't pass? By giving amnesty to people who are here illegally, with his pen and phone? By allowing an underling to leave men for dead in Benghazi because it was politically expedient?","post_message":"According to Brian Stelter, Donald Trump is acting like the leader of an \"authoritarian regime.\" His solution? Have the media act MORE biased."},{"comment_id":"467441413380453","commenter_b":"I've got a great idea! Let's send all the illegals to Italy! Who agrees with me?","commenter_a":"NO!!!Go home and support your own People!","post_message":"A five-year-old hands Pope Francis a letter asking him for help in preventing her parents from being deported. The Pope is calling for Christian support for all immigrants, both legal and illegal. Do you agree?"},{"comment_id":"10153023573702452","commenter_b":"The bizarre part : Women buy purses but don't want to carry them ?? Who leaves their purse???","commenter_a":"Por pendeja!","post_message":"BIZARRE VIDEO: A thief was caught on surveillance video stealing a purse inside a Philadelphia restaurant - and then dancing away. @webpagelink"},{"comment_id":"1062577053802042","commenter_b":"She looks like the kind of woman who would beat up a man alright. Man, that face is the stuff of nightmares!","commenter_a":"Domestic violence in the Clinton home?","post_message":"Does Hillary beat up Bill?"},{"comment_id":"10154247175501680","commenter_b":"I've seen you post this exact thing, verbatim, on another posting. Are you just copy/pasting on all the posts? If so, I would spend some time on grammar and punctuation because this is completely incoherent. I've tried 2xs to understand what you are saying but i give up by the second run on sentence...","commenter_a":"Trump return dodd-frank law to gang of bail out banks to reduce their power and to transfer it to the people of usa and to stop fraud in the stock market stealing from workers ,middle class investors and retirement funds and reduce USA world's record inequality ,legacy of lawless obama.They will have to pay you your part anyway because if not you send them to jail for using privileged info all together for stock trading,take gang of bail out banks the license to steal with stock market and reduce their money to pay for protests ,lies, to bribe GOP politicians and to own Democrat party.take the financial resources from the establishment.FREE USA.return power to USA people.Make america great again.,there is more freedom in china than usa ,with gang of bail out banks holding power here since they brought obama to powerThere was another fair solution for banks ,was to bring ...","post_message":"The best guide to what Donald J. Trump would do as president appears to be what he said he would do as president."},{"comment_id":"10154693491116833","commenter_b":"They know. It doesn't fit their agenda of eliminating ownership.","commenter_a":"When will the liberal anti-gun haters, learn that teaching safety first you will get rid of most of the accidental shootings. It's not the gun it's the person that picks up the gun that is the problem. If you would allow gun safety in the schools, like sex-ed, there would be a lowering in accidental shootings.","post_message":"While Everytown's ad message is all about being and safe with guns, the ad, amazingly, disregards basic fundamentals of safe gun handling. Unlike the National Rifle Association, anti-gun groups don't make actual gun safety training services, for adults and children who want to be and safe with guns available."}]
