[{"comment_id":"10154892673543690","commenter_b":"@username Yeah I get it, I'm just evil with white supremacy and global domination on my mind. Nobody with brown or black skin anywhere outside the United States is capable of doing anything wrong, because of white people, right? You're just a victim? I wasn't in the Navy, I am a Marine. But I feel like I have to defend the Navy here. There are sailors representing men and women from every race, not just whites. I guess you didn't know that. You say that the US Navy contributes to human misery but when a tsunami struck Indonesia in 2004, who was there for the rescue effort? When an earthquake struck Nepal, who was there? When a hurricane destroyed Haiti, who was there? I was there distributing food and medical supplies to desperately poor people in Ethiopia and Somalia. The US Navy prevents two-bit pirates with speedboats and AK47's from ...","commenter_a":"All I do is get up to go to work everyday to provide for my family. Ive never oppressed anyone and I Judge people based on the content of their character. I still hear all over the media how I, and people like me, are causing all the problems in this world. I suppose im just tired of it. Please tell me how being born with white skin makes me responsible for societies ills.","post_message":"Marwan Bishara: America needs anger management"},{"comment_id":"970339789709457","commenter_b":"The media doesn't give Dr Carson a fair chance, disgusting and sad!","commenter_a":"All Trump supporters, pls get out and vote! This is a very critical time in America, we need to get back our White House, otherwise we gonna reach the point of no return!","post_message":"GOOD MORNING, America! Thank you for all of your support- in last nights #GOPDebate. If everyone gets out to vote in 2016-- there is no question that we will ALL be MAKING AMERICA GREAT AGAIN- soon enough!"},{"comment_id":"10155970638220354","commenter_b":"Megan Kelly is a jerk,","commenter_a":"Hehe!!!","post_message":"Donald Trump vs. Megyn Kelly? Fireworks are already flying!"},{"comment_id":"10153581516273984","commenter_b":"The feds will just print more money huh. That's what's wrong with America is people like you don't know how things operate. The only money that gets printed is money that gets destroyed that banks send back. We are not in debt because we keep printing our own money. We can only print as much money as we have in our gold reserves. The reason we are in debt is because we keep borrowing money from places like China. But see that's the problem with the people in this country, they run to the polls to vote but have no clue how anything even operates","commenter_a":"Trump won't be any better. We will have more wars and more debt. Your pensions and other government ensured money will be gambled away again. The dollar will continue to devalue as the Fed prints money debt money. More American jobs will go overseas to China and Mexico. The middle class will slowly but surely wither away while people wonder what happened AGAIN and do absolutely nothing but complain on the couch or internet. The list goes on and on and on but you reap what you sew I guess. It is always the younger generation who has to clean up the mess of the old as always.","post_message":"Donald J. Trump just ripped apart Obama's Iran deal with 6 blunt words that hit home to millions of Americans. You know Obama hated hearing him say this, because Obama knows it's the truth."},{"comment_id":"895290923994817","commenter_b":"Charlotte u must b mistaken u must mean SLICK WILLIE & HIS FAMOUS LEWINSKY & HIS ASHTRAY WHERE HE PLACED HUS CIGAR!!! HE SAID HE DID NOT HAVE SEX WITH THAT WOMAN & THEN HE ADMITTED HE DID!!! Also remember the FOUR BRAVE AMERICANS WHO DIED UNDER LYING HILLARY!! She shd b in jail!! U have been carrying the water for the dems & it is disgusting!! Grow up cupcake & if u can't go get a coloring book and color!!","commenter_a":"We need a liar, rapist and whore nude model in the White House . U bet","post_message":"With every announcement America is falling more and more in love with the Trump family. This is awesome, it's exactly what was needed. Can we get 5,000 'LIKES' for the Trump family?"},{"comment_id":"10153790561559407","commenter_b":"Eco tourism is the answer to the local economy of these communities, not hunting animals into extinction. Man has done enough damage to Africa. The west needs to stick it's hand in its pocket and spend the money to educate them and show them how to diversify their economy so they don't need to rely on sports hunting. It's not sport to hunt and kill these beautiful animals.","commenter_a":"The UN should encourage all nations to make it illegal for their citizens to go to Africa and hunt the Lion or any other African wildlife.","post_message":"A small victory for the king of beasts:"},{"comment_id":"10152870129557093","commenter_b":"Omg this woman is so racist!!! Just watch! Lol @webpagelink","commenter_a":"He doesn't need to apologize! People need to learn how to act! And how to respect higher Authority. Life would be more peaceful if people just learned to act like decent people","post_message":"Attorney for McKinney Cpl. Casebolt said two suicide calls before pool party put him in \"emotional place\" .... said Casebolt apologizes to those offended by his actions.... @webpagelink"}]
