[{"comment_id":"1658959434379097","commenter_b":"Nice boobs","commenter_a":"Sad.","post_message":"\"She could play a position if she wanted to,\" Donald J. Trump said of Sarah Palin, who threw her backing behind the real estate mogul on Tuesday."},{"comment_id":"1299685360072319","commenter_b":"And what if the fingerprint belongs to a psychopath or a killer ? This solution gives the wrong message, that guns are okay, you just need to make them safer. But guns are not okay. But Americans will never understand this unfortunately. America was build on guns and blood. What do you expect. Don't come now with the reason it's the same with a knife. You can use a knife for different things, but it can also kill someone. A gun though has only one aim and it was made only for one reason and one purpose. To kill. And it's a very unfair way of killing too. I hate guns, I wish they all would disappear.","commenter_a":"This is a great idea if it can be refined to the point of consistent performance!","post_message":"Can a fingerprint save a life? This teenager is working on \"smart gun\" technology. (via INSIDER)"},{"comment_id":"10153875046907235","commenter_b":"So did Ollie North! The fuckery.......","commenter_a":"\"Former United States Attorney general sold guns to drug cartels.\"","post_message":"WHOA"},{"comment_id":"884581044987387","commenter_b":"If one wants buy-in from white people, blowing off white people who have had similar experiences seems extremely counterproductive.","commenter_a":"i think it's racist that it's subtle racism is only being committed by a white person in the panel. the comic itself is subtly racist.","post_message":"Let's agree to fix this."},{"comment_id":"10155345287068132","commenter_b":"She needs to save her nekkidness for JZ.","commenter_a":"Wierdo & shes so over rated meh","post_message":"We're still not over Beyonce's performance! Join us in the comments to let us know what you thought."},{"comment_id":"10153137583782293","commenter_b":"What's this?! Women get butthurt on the Internet? Get out...","commenter_a":"Wait, what? Women actually care to attract men? I thought they'd much rather prefer to smugly ignore the existence of all men in public settings so as to artificially build their own self-esteem. Your mileage may vary, I suppose.","post_message":"\"Fear not. Since Eve, woman has been responsible for the fall of man, and again, we shall prevail.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"1296652160354811","commenter_b":"Your wrong again people ! stop with the Race card ! Wanting our borders closed and secure to stop illegal aliens and drugs from getting in our country is Not Raciest ! and we are at War with Rdical islam so yes all immigration should be Haulted Untill ISIS is Destroyed ! it's about protecting AMERICA and AMERICANS ! The Democrates do not care about securing AMERICA and protecting AMERICANS","commenter_a":"As a German living in Ireland I have to say that the choice can only be Clinton or Sanders! Trump and the likes are disqualified for being racists, bigots, etc.!","post_message":"'It's like a comedy.'"}]
