[{"comment_id":"10152582982555950","commenter_b":"Im guessing she's a real bitch...","commenter_a":"he could have just said he wanted a divorce,","post_message":"The man's wife didn't know about or give permission for the demolition, police say."},{"comment_id":"10153895768928132","commenter_b":"Showing your butt in public doesn't empower women. It's the opposite. It shows women as sex objects. It shows little girls that is ok to post pictures of them naked. It shows those real woman with curves that if they don't look like that, they are not\"normal\".","commenter_a":"Beautiful!","post_message":"You rock, Demi Lovato!"},{"comment_id":"10154590275170586","commenter_b":"Which wife is she again?","commenter_a":"It takes a real woman to critize Melanie Trump. She is elligant. She will make a better First Lady than Bill Clinton will make. She hasn't hurt anyone. How can you even mention her name.","post_message":"Lady Gaga has joined the chorus of those criticizing Melania Trump days after the would-be first lady gave a speech decrying bullying online."},{"comment_id":"10154531059061337","commenter_b":"Well there's the fact she acts like a cheap whore","commenter_a":"Really what is wrong with Miley Cyrus..? She got some serious issues & needs help...","post_message":"SHOWING OFF: Miley Cyrus didn't hesitate to full on make out with her Victoria's Secret girlfriend, despite the watchful eye of the paparazzi..."},{"comment_id":"10153957381501336","commenter_b":"FAIR TAX on consumption, please. Get the hookers, pimps, drug dealers etc. To pay tax! They have to eat too.","commenter_a":"Make states lower property tax too. It's screwing me on buying a house","post_message":"“No deductions, no loopholes.” Dr. Ben Carson revealed his tax plan this morning and said he would replace the current tax code with a 14.9% flat tax. (Via: Fox & Friends)"},{"comment_id":"1788948718006323","commenter_b":"Scumbags","commenter_a":"lol. Morons.","post_message":"Democratic Rep. Karen Bass of California labeled semi-automatic rifles \"weapons of mass destruction\" Wednesday."},{"comment_id":"10152822886591130","commenter_b":"SHE* isn't 'dressed up as a woman. She is a fucking woman.","commenter_a":"Hold on a minute here, it's make your mind up here time fella/gal or whatever make & model you wake up wanting to be today as others (me) do mind where you take a piss as kids use these toilets and we need to protect from people who don't even know what sex they are from one toilet visit to the next !!!","post_message":"\"How we go about our business is none of yours.\""}]
