[{"comment_id":"10153434124594032","commenter_b":"@username illegals aren't just Mexican stop being ignorant.","commenter_a":"I'm on the fence about this, the immigrants being lazy living off the state should be taken back. BUT the hard workers doing what they can taking care of their families should not be bothered!!!","post_message":"#BREAKING: The deportation operation by U.S. Immigration and Customs Enforcement would begin as soon as next month, the report said. UPDATE: DHS plan to raid Central American immigrants draws criticism. Details: @webpagelink"},{"comment_id":"10157254857370354","commenter_b":"Punch that Bitch","commenter_a":"If he had a background like that, other wives would come forward. She wasn't going to get alimony...hummmm","post_message":"The latest twist..."},{"comment_id":"1088236524530691","commenter_b":"Humans are a parasite on this planet, we are unable to live in balance it's time for another extinction.","commenter_a":"It prob all happened because of climate change","post_message":"New evidence suggests there have been 6 mass-extinctions since life began."},{"comment_id":"1720045178285132","commenter_b":"She didn't make it running for president what makes her think she can do it for VP","commenter_a":"SHUT UP","post_message":"Donald Trump would be \"shellacked\" in a general election showdown with Democrat Hillary Clinton, Carly Fiorina said after being named Ted Cruz's running mate."},{"comment_id":"1120823271280022","commenter_b":"What you actually mean is that all women are idiots","commenter_a":"Proof that republican women are idiots.","post_message":"If we're going to be honest here, the thing that might be most shocking is that ANY women could look at ANY of these candidates in a favorable light."},{"comment_id":"10152961665786336","commenter_b":"Why would any of you morons disagree with Dr. Carson? As long as kids get vaccinated and as long as adults have already been vaccinated this Country can be protected from these diseases. Time for Obama to guarantee that anyone illegal immigrant be vaccinated...","commenter_a":"Just another reason why we need to CLOSE the borders, ENFORCE the laws already on the books and DEPORT all illegals. That means, NO AMNESTY for anyone.","post_message":"Fox News Sunday EXCLUSIVE: Dr. Ben Carson joins Chris Wallace with his stance on the vaccine debate and his plans for 2016. Check your local listings or tune in to Fox News Channel at 2p and 6p ET."},{"comment_id":"1093462474008096","commenter_b":"Yeah, please do?^","commenter_a":"They are more worried about bringing extinct animals but not help animals that are close to extinction. (rhino, tigers, wolf's, ect)","post_message":"Woolly mammoth genome has been decoded."}]
