[{"comment_id":"1170886402975254","commenter_b":"Great family, a drunk, his brother a cheating womanizer, and his lying idot of a wife","commenter_a":"It's ok he will be let go with no repercussions !! 1 he is a Clinton 2 he is in California","post_message":"Former President Bill Clinton's brother, Roger Clinton, has been arrested for DUI in Redondo Beach, California."},{"comment_id":"642366659287246","commenter_b":"Megan, you do a great job for Fox. They are lucky to have you.","commenter_a":"Fair and Balanced?!?!?","post_message":"Megyn Kelly may be getting kicked off the air... FOX needs our support, let's give it to them. Do you support FOX News?"},{"comment_id":"10153124356001336","commenter_b":"IDIOTS PUT IDIOTS IN OUR WHITEHOUSE!!!","commenter_a":"It is not up to obama it is supposed to be congress and senate this is illegal","post_message":"\"Please just give this soldier the dignity of life! We give it to these guys down in Gitmo!\" Montel Williams questioned how Amir Hekmati, a Marine held in Iran's worst prison, is still in captivity while the Obama administration makes a deal with Iran. #FreeAmirNow"},{"comment_id":"10153276508787144","commenter_b":"I certainly hope you don't have daughters with that repulsive, misogynistic mouth.","commenter_a":"Grace under fire?? I just love how you baby murdering dirtbag sluts try to make yourselves out to be the victims instead of the human beings you kill. Why don't you show the exchange how it really happened? @webpagelink","post_message":"Yep."},{"comment_id":"10153513325884614","commenter_b":"Brianna Paino","commenter_a":"I was told so it maybe BS. There is no law stating what direction the car is to be pointed. Say backing up in a lane at a stop.","post_message":"Dramatic cellphone video captured a dangerous scene in the Hollywood Hills: an Audi driving backwards for miles on a narrow and windy stretch of Laurel Canyon. Kevin Zanazanian, who shot the video, told KTLA the stunt jeopardized the safety of pedestrians and motorists. He said he recorded it for safety reason. After the video was uploaded to YouTube, the Los Angeles Police Department said it was investigating the incident and working to identify the driver, whose identity remains a mystery. Read KTLA story here: @webpagelink"},{"comment_id":"10153050457656037","commenter_b":"Oh poor thing she cant make her 10,000 a month rent and shes too good for an average joe apt what a predicament and if its not acting or showbiz im not working they are all the same","commenter_a":"Come over to my house free rent plus all the free SEX you can get x10 =!","post_message":"66-year-old actress #DianneWiest, who begins previews Tuesday for off-Broadway production Rasheeda Speaking, told the New York Times she is facing money issues due to a lack of high-paying work."},{"comment_id":"10153253016300329","commenter_b":"I can almost guarantee that this lady is nowhere near as big as this dress makes her look. I personally think she looks pretty average. Size 12 or 14. I'm not \"fat\" but I would probably look like that in that dress, thanks to the perfect little human I made. Haha. It just isn't flattering, that doesn't mean anything about her body.","commenter_a":"The dress is not for fat people that is the issue lol","post_message":"ICYMI"}]
