[{"comment_id":"10154568214757300","commenter_b":"Voting is a scam. I'm sorry,to say!!","commenter_a":"How tasteless","post_message":"He was asking listeners to register to vote — and then cast their ballots for Hillary Clinton."},{"comment_id":"832342470197694","commenter_b":"Boring!","commenter_a":"We do the very same things here today.","post_message":"What do you see in this inkblot?"},{"comment_id":"479766112213969","commenter_b":"Oh that is too funny she claims her life is harder than soldier that bitch don't have a clue","commenter_a":"and they have no vaction poor baby michelle","post_message":"Michelle Obama just made an outrageous claim... Our soldiers fight and die for our country, Michelle takes lavish vacations. Do you respect our veterans over Michelle?"},{"comment_id":"1101197406562586","commenter_b":"wheredid they dig these women up she does not know what she is doing..she mite as well givr the city to the thugs, disarm the police and go home and take a nap","commenter_a":"Burn it","post_message":"There are people openly worrying if Mosby's case fails, if Baltimore will burn to the ground."},{"comment_id":"1039200399433046","commenter_b":"What were her parents thinking? I never left either of my children unattended in a car. That could have killed their most precious thing in the world. It is crazy to leave your child unattended in a car at such a tender age. I applaud the rescuers.","commenter_a":"Stupid people shouldn't breed.","post_message":"HOT CAR TODDLER RESCUE>> From Michelle Millman: This just breaks my heart for this little girl trapped in a hot car. A woman broke a car's window in Kansas after seeing a toddler trapped inside. Police say a couple left the girl while they shopped! Sadly, the woman says the parents seemed to care only about the damaged car."},{"comment_id":"10157239899915725","commenter_b":"Democrat lives don't matter.","commenter_a":"Say it Mr President .","post_message":"ISIS exploded on Hillary Clinton's watch- she's done nothing about it and never will. Not capable!"},{"comment_id":"712691792254732","commenter_b":"Nothing going to happen to the bitch, cannot wait for her and Mr Muslim to be out of White House....","commenter_a":"The American people were fools to ever put them in the White House . Now we have to find a way to get them the hell out","post_message":"Michelle Obama facing hug charges after being enveloped in lawsuit. Good it's about time. She couldn't get away with this. Do you think Michelle Obama is a criminal?"}]
