[{"comment_id":"10153661567171336","commenter_b":"This thug lady needs whatever the cops want to do to handle thugs","commenter_a":"So breaking the law is okay, right @username?","post_message":""},{"comment_id":"558741910917069","commenter_b":"Well a lot of the problem is, is she is a woman. I guarantee you she is going to have to fight a lot to become President, now and if she becomes president it will only get worse.and I am not voting for her.","commenter_a":"Shut up, Ben!!! You're out of this race.....","post_message":"Does Clinton's use of a private email server prove she has poor judgment and is unfit to be president?"},{"comment_id":"976274442437807","commenter_b":"I never liked her fake ass!!!","commenter_a":"Yes.","post_message":"Oprah threatens anyone who opposes Obama. Get that liberal trash off of TV. Do you think Oprah is the racist?"},{"comment_id":"10153785925861130","commenter_b":"So disgusting! Foot kiss'n Catholics just turn my stomach.","commenter_a":"Some people on this post are so stupid. Read the bible that is if you can read. Jesus washed feet. And the pope is just trying to be as Christ like as he can be. Some of you really need to follow his example. That is if you are not to ignorant","post_message":"Pope Francis says regardless of religion, we're all \"children of the same God.\""},{"comment_id":"533052596897970","commenter_b":"Her coloring is terrible. Bad makeup artist. It's not natural looking.","commenter_a":"they should've casted danai gurira from the walking dead. She'd do an amazing job. The fact that they couldn't get a beautiful chocolate actress is plain disrespectful","post_message":"Here's Why Casting Zoe Saldana with Blackface is a Major Problem. What do you think? Please share this video! #NinaSimone"},{"comment_id":"10154113063315950","commenter_b":"@username wrong. Polls showed Hillary winning the ELECTORAL vote. Wanna try again delusional one? #ShesNotYourPresidentAndNeverWillBe #GetOverIt #SoreLoser","commenter_a":"Polls Smolls! Haven't we learn anything when it comes to \"polls\"?! Bwhahahaha!","post_message":"Barack Obama has a 50 percent approval rating heading into his final months in office, a new poll found Monday."},{"comment_id":"10153598011598812","commenter_b":"She is like.... Told you to stay away from those blonde white bitc... lol","commenter_a":"With his mommy right beside him worried about where her money is going to come from now","post_message":"Former FSU quarterback says \"I totally should have walked away\" after video surfaces showing him punching woman in the face."}]
