[{"comment_id":"10154303723989411","commenter_b":"@username I'm not sure all of them are refugees","commenter_a":"if cannot adapt the European lifestyle why want to lived in Europe. I just do not understand, much better they lived in arab countries and do their own style.","post_message":"'We are not anti-migration party, we are for controlled immigration. We cannot allow for the borders just to be open for everybody who wants to come in and settle down here. No other country does that'"},{"comment_id":"1118006468215013","commenter_b":"and illegals.","commenter_a":"Lol same old democrap bs. Yes the GOP is trying to keep Millon's from voting. Millions of dead people.","post_message":"Mrs. Clinton is out accusing the Republicans once again of plotting voter fraud, and she is making this allegation in front of African-American audiences."},{"comment_id":"10153154293302293","commenter_b":"Oh please. Stop being a pussy.","commenter_a":"Thanks Fox News for causing hysteria among your psyco viewers and almost getting my buddies killed.","post_message":"The men had a deadly plot to lure government forces into a trap, federal officials say."},{"comment_id":"10152821450821519","commenter_b":"I don't read/post/view links. So if you're responding to me on fb, a simple original thought will suffice. Thanks!","commenter_a":"Yes! Agreed. We should punish and penalize those who are responsible for providing employment opportunities for tens of thousands. Everyone in America should work for government. #sarcasm","post_message":"\"It’s hard to see how anyone can possibly believe that the Republican Party, which fetishizes low taxes for the rich above all other priorities, truly cares about wealth inequality...\""},{"comment_id":"913170958829660","commenter_b":"@username Now suck on that and go vote for that murderer her name is clinton.","commenter_a":"No i don't support ending it ,it is a aganist the law they should be lock up.","post_message":""},{"comment_id":"10152869358831336","commenter_b":"We should get rid of the Kkk. This is not their land either.","commenter_a":"We should Deport Obama and his Kind back to Kenya or where they all came from this is our Land Not their's!!!","post_message":"In Thursday’s Talking Points Memo, Bill O'Reilly asked: where is America's policy to fight the Islamic jihad? Watch and weigh in: @webpagelink"},{"comment_id":"10153217617761460","commenter_b":"Gays have no right to call it Marriage .","commenter_a":"I dont like, or approve of same sex marriage, however we all have a DIVINE right to choose how to live our lives. What that means is, if one chooses to go against the 'rules' then that is on them. Its called \"free will\". I would advise against it according to my own spiritual belief's...but I have no right to take it any further than that with a non-believer. Its a touchy subject! We all have a gay person in our lives somewhere that we love, we may not like or agree with this life-style, and we do have a right to \"voice\" that, but that is where the right ends, and the rights of the gay person start...I only wish now the gays would see where THEIR rights end when dealing with those of us that are Not gay, and we do have Divine & Constitutional to disagree, but ...","post_message":"Marriage should be defined as it has always been. This is the ideal for raising children and is good for society. But while Americans are deeply divided on this issue, we should be able to agree that a Supreme Court decision would only exacerbate that division. Like the Roe v. Wade decision in 1973, a Supreme Court ruling that overturns state laws on marriage would do nothing to end the debate about marriage, but would instead prolong it. Full statement here: @webpagelink"}]
