[{"comment_id":"10153956823096135","commenter_b":"I want Michigan to win. Been a fan for many, many years !!","commenter_a":".","post_message":"POLL: It's time for The Game! The Michigan Wolverines face off against the Ohio State Buckeyes at high noon Saturday on WXYZ-TV. We want to know who you think is going to win. React to this post with a heart if you think it will be Michigan and a like if you think it will be Ohio State. You can also predict the final score with a comment. Also, if you share this post your friends can weigh in too."},{"comment_id":"731413603663114","commenter_b":"Build the wall, those here illegally on good status, offer citizenship, if no, they go. Those in our prisons, bye bye, gone. Immigration problem solved.","commenter_a":"The Republican politicians not following through on campaign promises and general fecklessness is what brought about Trump's popularity, not just the immigration problem. Trump was willing to bring up the illegals when the others were not.","post_message":"Meghan McCain warned Donald J. Trump of softening his stance on illegal immigration. Do you agree or disagree with her comments? @webpagelink"},{"comment_id":"1756054801276415","commenter_b":"Though what border did the Muslims come ?","commenter_a":"Don't mess with Texas!","post_message":"BREAKING: Texas Lt. Governor Announces That Texas Has Finally Shut Down The Border. It's about time. With or without a wall, we will protect our country. Do you think we need to close our borders to Mexico?"},{"comment_id":"10154148249086336","commenter_b":"KILL ALL RNC PIGS,LIBS,RINOS,SQUAEL PIG SQUEAL","commenter_a":"Caleb Benitez these are those higher power that people don't know about ,they try controlling the world ,not this time","post_message":"The letter reportedly contained a threatening message that implied Donald J. Trump's children would be hurt if the GOP candidate did not withdraw from the 2016 presidential race."},{"comment_id":"894537217346746","commenter_b":"These damn emails enough already. So how do you handle your text or emails? Do keep them or do you delete them? Keep that national security was a what risk BS! Are you being bombed or shot at by Islamic radicals are they taking over your house? What the hell you got a gun use help the military out by the way according to Trump is a mess a total disaster.Trump is a man with no plan.#you many people say that. Its true he himself can't put one concrete issue and have a real solution not one. He has all the best people no really the best people helping him according to him. Loom, doom, and gloom are the same people who will run this country because Trump won't have a voice. Those same so call good people will run this country really. They know he's not qualified. They will ...","commenter_a":"You are wrong if you think Trump is a Republican.Yes he is their candidate, but his views are far from it.","post_message":"This guy needs to wake up and smell the coffee."},{"comment_id":"10154104825566336","commenter_b":"@username so you think the bible is nonsense. You better wake up before you meet your maker. - Bob","commenter_a":"Luke 8:17 What is done in the dark surely will be brought to light.","post_message":"Fox News confirms that a buried knife has been found on what used to be O.J. Simpson's property and is being tested by the LAPD. @webpagelink"},{"comment_id":"1313639405344510","commenter_b":"Saudi is the most corrupt and evil country in the world. Where else are women banned from doing anything? Even worse than North Korea. And yet, Hillary took money from them and her supporters love to cry \"sexism!\" One Nation under God \"there is no one like our God\" Jesus, Amen. We don't need any Islamic states in American","commenter_a":"Saudi is the most corrupt and evil country in the world. Where else are women banned from doing anything? Even worse than North Korea. And yet, Hillary took money from them and her supporters love to cry \"sexism!\" One Nation under God \"there is no one like our God\" Jesus, Amen. We don't need any Islamic states in American","post_message":"U.S. president-elect Donald Trump’s recent cabinet appointments had drawn harsh criticism from civil rights campaigners. The cabinet picks have, however, earned praise from white supremacists and neo-Nazis. What do you think about his cabinet? Join us on #presstvdebate at 18:33 GMT"}]
