[{"comment_id":"10155037576899268","commenter_b":"So, all wives are prostitutes?","commenter_a":"When you obviously marry a man for his money, what else would you call it. If you sell your soul to the devil, you're a prostitute. After all, no one would want this orange Cheeto if it wasn't for his money.","post_message":"Melania Trump doesn't deserve to be slut-shamed."},{"comment_id":"1051319018240177","commenter_b":"Let's build a wall!","commenter_a":"No way? Only illegal Mexicans are drug dealers and criminals. . Right?","post_message":"DRUG RING UNCOVERED: Six students at UC Santa Cruz have been arrested on Friday for allegedly running a drug ring that uncovered over $100,000 worth of MDMA, police said. READ MORE: @webpagelink"},{"comment_id":"10153070826933701","commenter_b":"hes a fag it","commenter_a":"Nope!","post_message":"Heisman winner Marcus Mariota on the loss of wide receiver Darren Carrington to a failed drug test: \"We'll get another guy that's ready to go.\""},{"comment_id":"979572065469181","commenter_b":"They need to pay taxes!","commenter_a":"If you bunch of socialist morons would adopt the fair tax it would do away with this along with the burdensome irs but yall don't want real answers just partisan socialist big govt","post_message":"It's time for them to start paying their fair share."},{"comment_id":"549044465305156","commenter_b":"You mean illegals who want free shit? Trump 2016 Killary Corrupt and OSUCKO Shitbag for Prison 2016","commenter_a":"To all the Hispanic and women out there, we all need to VOTE!!! Our vote has to be the one that makes the difference of who will be our new President Mrs. Clinton.. lets all make sure that we the piggy, uglys fat black and hispanic show Mr. Trump that we where the ones we the power for him not to be our new President, trust me he will always remember us women.","post_message":"This is Alicia Machado, the former Miss Universe who Trump bullied and harassed, calling her an \"ugly\" \"Miss Piggy\" and \"Miss Housekeeping\" -- just because she is Latina. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1115714755184548","commenter_b":"@username DUMBF TRUMP BUILDING HIS OWN WALL BECAUSE MEXICAN PRESIDENT SENT HIS ASS PACKING.","commenter_a":"Smart women.. COUNTRY COMES FIRST. LET'S VOTE BLUE IN NOVEMBER. HILLARY NEXT PRESIDENT OF THE UNITED STATES OF AMERICA.","post_message":"This is just too good!"},{"comment_id":"1062077417179756","commenter_b":"She is a fraud !","commenter_a":"bad squaw","post_message":"WATCH: CHEROKEE PEOPLE Express Disgust Over \"Lying\" Elizabeth Warren Faking \"Native American Heritage\" To Get Prestigious Law Professor Job [VIDEO] @webpagelink"}]
