[{"comment_id":"894578323912842","commenter_b":"Then it would forever be a mystery. That hag will never tell the truth.","commenter_a":"Did they ask Hillary that question well when she tells the truth then they can come back and ask Rick that question.","post_message":"\"These are tough issues...\""},{"comment_id":"1122827437738266","commenter_b":"Go home Elsa, you're drunk....","commenter_a":"the cold never bothered us anyways... amirighyt?","post_message":""},{"comment_id":"727273657378849","commenter_b":"We can not trust Iran and we definitely do not need to give them money. Thanks for standing up against this deal and a deal that does not even include the release of our Americans held in the Iran prison.","commenter_a":"hey rodney you pathetic weasel,the US has violated almost every treaty they have ever signed you delusional fool.","post_message":"My statement on the nuclear deal reached with Iran: “In the coming days and weeks, I will carefully analyze the details of this agreement, but remain skeptical that the Iranian regime will live up to its end of the deal,” said Davis. “We’ve been here before with North Korea who two decades later have cheated its way out of a deal and onto a path to dozens of nuclear weapons. I fear this administration has agreed to terms that will leave the world’s leader in state-sponsored terrorism stronger economically with a nuclear program largely intact.” Last week, I spoke on the House floor warning against a bad deal with Iran →"},{"comment_id":"10155741021510354","commenter_b":"Dear Allison, you are one poor sucker. There never was a thing called white privilege. You thought emancipated blacks were slaves but in truth , the only thing equality means is that no one gets a free ride . Not blacks or whites...you have the freedom to work your little butt off to get what you earn. If that is white privilege, you have been duped into wanted to toil and toil to get what you want in life...same as the next guy.","commenter_a":"you are a fucktard","post_message":"Why MSNBC called in an erotic novelist to discuss this topic is beyond us... but somehow the crazy here might even surpass Rachel's."},{"comment_id":"10154725381070579","commenter_b":"You may want to look into Stein or Johnson... Hillary is a corrupt habitual liar and anyone that does not see it, is not the sharpest knife in the drawer...","commenter_a":"I'm a United States Army Veteran and I'm With Her. Trump's complete failure to understand basic foreign policy concepts, his relationship with Putin, and his out-of-control ego are a one-way trip into a third world war. His kind of \"leadership\" is the last thing America needs. Clinton isn't perfect but she's better than any of the other candidates today.","post_message":"Active & Retired Military: Your choice in 2016?"},{"comment_id":"10153561312261748","commenter_b":"I'm come to the conclusion that we can safely assume the complete opposite of anything said by a conservative.....","commenter_a":"It's little wonder the whole world thinks the USA has gone bat shit crazy!","post_message":"Ted Cruz says people don't like Duck Dynasty's Phil Robertson because he \"speaks with joy,\" floats him as UN Ambassador"},{"comment_id":"10156617842095354","commenter_b":"This is just another Obama liar. Do not pay too much attention to her....Someday everything that they have done will come back and bite them in the butt.","commenter_a":"I've got to ask: Is Shultz starting to look more and more like Jar Jar Binks? What's going on there? I must avert my eyes.","post_message":"***FIRESTORM OF DEMOCRAT LIES***"}]
