[{"comment_id":"1362948977061222","commenter_b":"@username oh look a grammar nazi, good burn lol","commenter_a":"First of all I know what it's like to work in a shop with just men. Men talk locker room talk. What you do think woman talk the same way! Shut the F up! It works both ways! Until you know what it's like to work in an all male job you can shut up!","post_message":"This rape survivor just took a powerful stand against Jeff Sessions."},{"comment_id":"988561661229838","commenter_b":"F*^king disgusting!!!","commenter_a":"Disgrace as president.","post_message":"President Barack Obama and First Lady Michelle Obama paid less than two minutes of respect to the late Antonin Scalia while the Justice lies in repose at the Supreme Court."},{"comment_id":"1172807002807988","commenter_b":"But you know it's hard to dress a tranny and make anyone think they're a woman !!!","commenter_a":"Well this certainly has nothing to do with the article, but thank goodness Michelle's designer will not be dressing Melania. Think how hard it was to come up w flower gardens, etc to cover all the hair on Michelle's chest every time she dressed her. Melania's designer will have it much easier dressing a woman w a figure.","post_message":"Looks like Michelle saved her most patronizing comments for last. When you see what she just said, try not to lose it! Are you ready for Melania Trump to be the First Lady?"},{"comment_id":"10152940519275933","commenter_b":"Mr. Kasich is a nice man but Donald Trump is right about everything he states - if we don't deport ILLEGALS then we will have to grant them amnesty. I know the deportation is not feasible - but it could be done but I know it won't happen - but we most certainly should deport the criminals who are here illegally. Illegals should have NO RIGHTS - first of all they break the law when they enter here. I'm voting for Trump. Mr. Kasich - what about OUR rights? Do the citizens of America have any rights ? are we protected any more? Now, what's happened is that these illegals are stuck here - that's why we MUST STOP IT. We cannot support the entire world no matter how sympathetic we are to them.","commenter_a":"The strong leader is not @username......he says deporting 20 million illegals is inhumane! You're part of the problem! How patriotic can you be, how much can you love your country to condone an invasion by 20 million illegals into our country that is now a welfare state with very high unemployment. The 11 million came from the 2010 census.....but many hispanics refused to answer the questionaire out of fear.....also, since 2010, millions more have come acrtoss the border. It's 20 million, folks!","post_message":"America deserves a strong leader back in the White House. America needs John Kasich."},{"comment_id":"1048532555215895","commenter_b":"What a sicko. she needs to be either arrested or locked up somewhere.","commenter_a":"Someone should sew her legs together..better still use lots of super glue, she needs to suffer s little.","post_message":"Woman: “I’ve Had Five Abortions Because I Love Getting Pregnant But Don’t Want Kids”"},{"comment_id":"1030546040397732","commenter_b":"Lock her up","commenter_a":"Can't do it fast enough! Lock her up!!!","post_message":""},{"comment_id":"985798528183066","commenter_b":"What if the Mexico government said any pregnant women being deported back to Mexico must have an abortion. Would ya let them stay or kill the baby because remember #alllivesmatter.","commenter_a":"I don't know. I still see a lot more dead baby posts than lion.","post_message":"\"This is offensive stuff, and there’s more outrage about a dead lion than there is about dead babies.\" -- Marco Rubio, on Planned Parenthood's videos"}]
