[{"comment_id":"10153255280801336","commenter_b":"You can't fix stupid. She was stupid before she went to college or she wouldn't have come out that way!","commenter_a":"Lol GW created ISIS... yeah, and Obama is the best President we've ever had. I think you should get a refund for your college tuition, because it's not working...","post_message":"College student to Jeb Bush: \"Your brother created ISIS.\""},{"comment_id":"10154160813994657","commenter_b":"She is a criminal","commenter_a":"She's a disgrace, so are the people that support this nonsense","post_message":"Playing by her own rules?"},{"comment_id":"919328804793264","commenter_b":"These girls have behaved impeccably!!","commenter_a":"As soon as someone denies being racist, the following lines reveal their bigotry.","post_message":"Once again, we are treated to a massive display of Tea Party \"not-racism.\""},{"comment_id":"799197103604200","commenter_b":"Um Death, that's a No fucking brainer","commenter_a":"He needs to be in front of a firing squad. He appears to be full of racial hatred.","post_message":"BREAKING: Black Lives Matters Shooter Kills 7, Wounds 30 [VIDEO]. Things are getting out of control. They need to be stopped. What do you think his punishment should be?"},{"comment_id":"1139514676096919","commenter_b":"#TrumpThatBitch","commenter_a":"Hillary is dirt","post_message":"Hillary Clinton and Donald Trump clashed repeatedly over the economy, tax cuts for the wealthy and ISIS in the first of three highly anticipated presidential debates. Read KTLA's story here: @webpagelink"},{"comment_id":"1739956166245053","commenter_b":"Tommy @username lol","commenter_a":"@username 😉","post_message":"Sharing just in case, can't hurt :)"},{"comment_id":"1002013776554647","commenter_b":"I dont think Buying Sex is a Game Changer Anymore. Lets get Real Here. You got a Lunatic Acting Like Hitlers Twin Brother Running and Thats Ok? Buying a Hooker is somehow More Repulsive?","commenter_a":"Intriguing.","post_message":"It sounds like this information could definitely ruin a campaign -- and it WILL be released."}]
