[{"comment_id":"470890583106641","commenter_b":"@username YOU'RE the looser ! And that's why you'll loose in November also !","commenter_a":"Hillary Clinton all the way to the White House !!!!","post_message":"WATCH LIVE: Hillary Clinton answers question LIVE in commercial break!"},{"comment_id":"10153271978657411","commenter_b":"White trash.","commenter_a":"I don't really care.","post_message":"HAPPY BIRTHDAY, #FLOTUS! First Lady Michelle Obama is celebrating her 52nd birthday today!"},{"comment_id":"10158188671665231","commenter_b":"Not to change the subject but is the android in the picture holding a giant marshmallow or giant roll of toilet paper?!?!?! Just asking","commenter_a":"Rich Jones","post_message":"Google wants you to know that #BlackLivesMatter."},{"comment_id":"919624348099683","commenter_b":"They don't want to assimilate; they want to take over. That's why ovomit is here","commenter_a":"Quit allowing Muslims into our nation as immigrants...we do not need people that will never assimilate into our culture....their god Is not our God!","post_message":"ISLAMIC TERRORISM: Texas Gunman Mother Says He Wasn Religious Until Attending Phoenix Mosque, Meeting Elton Simpson @webpagelink"},{"comment_id":"741677189266873","commenter_b":"Really Rubio you must have a small dick. I feel sorry for your wife.","commenter_a":"Grow up, ! You are acting like a middle school boy.that is why you won't get anywhere","post_message":"Uncool. A new Rubio low...."},{"comment_id":"712691792254732","commenter_b":"Nothing going to happen to the bitch, cannot wait for her and Mr Muslim to be out of White House....","commenter_a":"The American people were fools to ever put them in the White House . Now we have to find a way to get them the hell out","post_message":"Michelle Obama facing hug charges after being enveloped in lawsuit. Good it's about time. She couldn't get away with this. Do you think Michelle Obama is a criminal?"},{"comment_id":"10155469522230354","commenter_b":"Where do these idiots come from on the left, try to bring in women to compete with fox and there is nothing between the ears.","commenter_a":"Those tampon dangles must have penetrated her brain.","post_message":"Believe it or not, it actually gets worse..."}]
