[{"comment_id":"497552493768664","commenter_b":"she can drop dead for all I care","commenter_a":"Irrelevant liberal rhetoric, out of the idiotic blathering mouth of a pitiful bitch who doesn know what damn day it is....","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"10154038979953279","commenter_b":"Very simple by democratically changing the Congress /Senate, and local states governments with stateswomen /men that supports Bernie's and we the people's agenda. If you think outside the subjugated status quo box where you live it is possible to allocate the economic resources where we want it to be instead of for example spending trillions on wars and then passing a debt bill to we the people so we paid more to wall street. Simple enough. We can even pass legislation specifying since that Iraq war was illegal due to lies for greed we can write off that illegal debt and don't paid to wall street. Hmm just brain storming the possibilities once we change the Congress, Senate, and Bernie is our POTUS. Just follow THE PANAMA PAPERS.","commenter_a":"Hillary is Cynical. But we the people know who the real champion for the 99% working class wealth producers is. Only Bernie Sanders is genuine and legit to the people. #NotHer15 #berniesanders #latinosforbernie #bernieorbust #creditgoestobernie","post_message":"\"I’m supporting Bernie Sanders because he says no to fracking. I’m supporting Bernie Sanders because we do need a single-payer healthcare system that takes care of everyone. And that is not a pipe dream.\" - Rosario Dawson"},{"comment_id":"1057489254266735","commenter_b":"Deport all illegals ..............","commenter_a":"The funny thing is that it's NOT about amnesty. It's about getting control of a situation that's currently OUT of control. If we don't move forward with the current plan, than what? Yes folks we are not in the same situation, but a much worse one. SIMPLE! Think about it, they are already currently living here and paying NO taxes. Unless we can beam these people up bye my calculations, YEP, there still here. Let's look back at what was actually said, the President NEVER said he was going to legalize any body's current status, just give them a chance to apply while working on there current status. Is it such a bad idea to have these people come out of the dark?","post_message":"I've been telling people for I don't know how many years, you know it as well as I do that's what this is all about. But no Democrat's ever admitted it."},{"comment_id":"467018143488766","commenter_b":"Liz...please shut up and go help your sexual victims","commenter_a":"Why don't we just ban Muslims from the military","post_message":"Should Christianity Be Banned To Please Muslims? Comment 'yes' or 'no'."},{"comment_id":"1037656442936422","commenter_b":"@username , I agree .","commenter_a":"Absolutely! This is the first campaign I have been able to follow totally since I retired, and I am sickened by how words that I have heard myself are mis-quoted and lied about, mostly by the Democrats. The lies are really incredible to me. Do they think nobody is paying attention?","post_message":"Huckabee says the mainstream media is making sure Clinton is \"presented in the best light,\" and goes out of their way to make Trump look bad. Is he right?"},{"comment_id":"1166185690114851","commenter_b":"I agree Awesome comment thanks :/","commenter_a":"OG gives zero fucks","post_message":"Uber driver loses it after man smokes weed in his car"},{"comment_id":"10150734990144999","commenter_b":"Now it's time to loathe Coldplay, then in ten years, we can appreciate them again.","commenter_a":"Never heard of anyone hating him I think this is a media thing thought up by some little intern that thinks he was being smart","post_message":"After decades spent as the target of jokes and sneers, Phil Collins is getting a fresh look."}]
