[{"comment_id":"1278741865525899","commenter_b":"@username dese bitch jam cuz","commenter_a":"🤘🏼OUS🚀ON","post_message":"Slim Thug's new joint \"King\" off the new album, \"Hogg Life, Vol 4: American King\"! #WSHH #SlimThug #Exclusive"},{"comment_id":"1323274761102106","commenter_b":"Hillary is for WALL STREET, BIG BANKS and CORPORATE WELFARE!!!! Bernie was right!!! Don't let her steal our COUNTRY🇺🇸#NEVERHILLARY","commenter_a":"I think it's great that the majority of America is holding him accountable for being a sexual predator.","post_message":"Hillary Clinton is leading Donald J. Trump by 15 points in Virginia, up 8 points from two weeks ago."},{"comment_id":"1871694196449652","commenter_b":"Bahaha Anna O'Toole","commenter_a":"Kaylee Parsons-Cordrey Jessica Shoffner k I don't really give a fuck about either of them but ajdvabsjz skz yes","post_message":"The most bromantic sign of the day."},{"comment_id":"10154471352991337","commenter_b":"Lil girl","commenter_a":"Bitch I hope one of these hoes are next on the hit list of dead cops fuck the police bitch and if u don't like fuck u too hoe come get some bitch ass nigga I'm waiting for w a big ass weapon nigga find out what it is","post_message":"What happens in this video is not ok."},{"comment_id":"891529944370915","commenter_b":"Yes I'm still for Trump! Put this women in prison. Stupid Women Lost & she conceded.","commenter_a":"Yes","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"952012654839207","commenter_b":"Pair of fucking idiots. Shouldn't be allowed to breed...","commenter_a":"Every once in a while I read something that haunts me for years","post_message":"The baby was strapped into a child-seat and left on the floor."},{"comment_id":"10153563127821680","commenter_b":"Gotta love how she tries to spin this. No other SOS ever had a orivate, unsecured server in their house. Morning Joe shows her lie repeatedly. @webpagelink She needs to drop out. Even Politifact.com found her statement to be a lie. @webpagelink/ #NeverHillary #BernieOrBust","commenter_a":"I lied and I'm going to lie some more.. Hillary2016","post_message":"\"There may be reports that come out, but nothing has changed,\" Hillary Clinton said. \"It's the same story.\" Read more: politi.co/1P0pUQK"}]
