[{"comment_id":"416198871873795","commenter_b":"I think those are pictures of women there supposed to be in capes ridiculous","commenter_a":"Why do so many pictures of ISIS soldiers depict them in clothing that would be of the worst kind for combat? Might as well give them a cape.","post_message":"ISIL’s Al-Khanssaa Brigade, an all-women fighting group, says women should only leave the house to practice medicine, teach or study religion"},{"comment_id":"10154929144129657","commenter_b":"You're actually describing her as intelligent? Seriously?","commenter_a":"Intelligent strong ladies don't need NOW to fight their battles for them. They are capable of doing it themselves.","post_message":"Looks like she doesn't need NOW's help after all."},{"comment_id":"862139507221510","commenter_b":"Obama and Trump should get along splendidly then.","commenter_a":"Hillary is running a close second or maybe she is in first place.","post_message":"Yes he is! Do you agree with Trump?"},{"comment_id":"10153189307188352","commenter_b":"I Understand hw U feel. U will ask d Grace frm God 2 give U a woman,I mean a \"Virtous Woman\". God wil give U a Good woman as a Wife. Remember d Bible says, He who finds a Wife,finds a good thing n Obtain Favour frm God. U jst av to b HAppy wit Urslf.","commenter_a":"How is that when everything you are she just crap on me rip my heart out and then go to our church act like I don't even exist understand how you can say you love me 1 minute and then say you don't want to be with me the next and all I hear from people is get over it and just move on wow so easy to say I am not a man that has the gift of words to woo a woman love one forsake all others that is how I was raised","post_message":"Breakups hurt, but losing someone who doesn't respect and appreciate you is actually a gain, not a loss."},{"comment_id":"10153270653234091","commenter_b":"It should of been called player interference he did not slide with intent to advance to 2nd his sole purpose was to take out the 2nd baseman and break up a double play you can call it dirty call it aggressive I believe the rule says you have to start your slide before you reach the base and that he did not do . With all the new rules to protect the catchers and collisions at the plate this is no different . I believe he should be suspended . Unless you want the benches to clear every time he comes up to hit","commenter_a":"Here are the rules! Evidently, the umps didn't get that memo!!!","post_message":"UNDER REVIEW: Major League Baseball executive Joe Torre will review last night's controversial slide by the Dodgers Chase Utley that broke the leg of Mets shortstop Ruben Tejada for possible disciplinary action. What are your thoughts about the play? Read more: @webpagelink"},{"comment_id":"10152777493386130","commenter_b":"Ya. Clearly, women want nothing more than to \"trap\" some real prize catches around here. Give me a break.","commenter_a":"this is great. Now men are less likely to be victims of the tramps who lie about birth control and crazy GFs who try to lock their men in.","post_message":"We're looking at you, gentlemen."},{"comment_id":"10154521519049726","commenter_b":"I'm not especially interested in Mexico paying for it - our wall and WE NEED TO GET IT DONE!","commenter_a":"Trump will not only get Mexico to pay for a wall but he will get them to see it's value to them and want it!","post_message":"From Pence's appearance on my show today — Pence all detailed how he and Trump will make Mexico pay for the border wall:"}]
