[{"comment_id":"10153359647714138","commenter_b":"Get the place shut down, then sue them for everything.","commenter_a":"Oh no!!","post_message":"When the family didn't hear back from Petco after a few hours they called the store and were told to meet the manager at an animal hospital."},{"comment_id":"10155086092991509","commenter_b":"They even rape cows over there... And they think cows are Gods. It's weird.","commenter_a":"India has one of the worst rape problems in the whole world, honestly if you're a woman going out after dark there it's almost a sure thing that you will get raped","post_message":"The suspect was reportedly out on bail while he awaited trial for his first rape of the teenage girl."},{"comment_id":"10153723307413037","commenter_b":"RideAustin doesn't even have an Android app yet. On the other hand, Fare has an app like Uber & Lyft, does the required background checks, offeres a way to schedule an upcoming ride and to choose preferred drivers....and it is all working now...as in this minute. Download the app and use me for a reference: Lynne3. @webpagelink","commenter_a":"Give our City Council a call...maybe they will give you a ride. @webpagelink","post_message":"The company says it will pay for fingerprint checks. Are you likely to give this company a try?"},{"comment_id":"10154703624496077","commenter_b":"These are all men! Lame. Almost any female is hotter than all of these (or does that make me sexist?)!","commenter_a":"Its the beard. Come on ladies, you know you love it!","post_message":"On Friday, Buzzfeed ranked our very own Kyle Clark #4 on their list of the hottest news anchors. We thought we'd share what we think makes Kyle so unique."},{"comment_id":"727273657378849","commenter_b":"We can not trust Iran and we definitely do not need to give them money. Thanks for standing up against this deal and a deal that does not even include the release of our Americans held in the Iran prison.","commenter_a":"hey rodney you pathetic weasel,the US has violated almost every treaty they have ever signed you delusional fool.","post_message":"My statement on the nuclear deal reached with Iran: “In the coming days and weeks, I will carefully analyze the details of this agreement, but remain skeptical that the Iranian regime will live up to its end of the deal,” said Davis. “We’ve been here before with North Korea who two decades later have cheated its way out of a deal and onto a path to dozens of nuclear weapons. I fear this administration has agreed to terms that will leave the world’s leader in state-sponsored terrorism stronger economically with a nuclear program largely intact.” Last week, I spoke on the House floor warning against a bad deal with Iran →"},{"comment_id":"1770528716571181","commenter_b":"@username you like being grabbed by the pussy,, I can see that from 100s of miles away. Lmao!!!!!!","commenter_a":"Come on. It's more like a Dr. who accidentally discloses he didn't go to med school, let alone college and is practicing without a listener and has a large number of outstanding malpractice lawsuits against him. But you still trust him.","post_message":""},{"comment_id":"10153270035730779","commenter_b":"Oh! And what about all those potential babies killed when wankers like you spill your seed onto barren ground?! #EverySpermIsSacred","commenter_a":"Forty million dead babies can't be wrong. An entire generatation of Americans has been murdered in the womb.","post_message":"Yes, Martin O'Malley, Bernie Sanders and Hillary Clinton are all pro-choice, but that isn't good enough. Simply promising to veto abortion restrictions passed by a Republican Congress isn't how we protect access to abortion, not when state legislatures are making it increasingly difficult for the most vulnerable women to get one. It's time debate moderators talked about it."}]
