[{"comment_id":"998702053501364","commenter_b":"Prison. He can still rape again without a tongue.","commenter_a":"Jail the bastard","post_message":"He lost his tongue. Is that punishment enough or should he go to jail as well? [Read below]"},{"comment_id":"10154282712736409","commenter_b":"Exactly! We would not have over 8 million illegal immigrants if not for Obama. Now the President that follow him has to figure a way to clean up his mess.","commenter_a":"Irony: everything that Trump is doing, including building a wall, was set in motion by establishment Democrats.","post_message":"Fox thought the border wall reference was \"too controversial to air during the Super Bowl.\""},{"comment_id":"10152708840057014","commenter_b":"The only ones wanting her are the freebie seekers. And the ILLEGALS !!!!!!!!","commenter_a":"Absolutely. Sorry to the GOP because all of their candidates are LOSERS","post_message":"Would you consider voting for Hillary for President?"},{"comment_id":"1197872970239356","commenter_b":"Whites will not destroy their own houses and businesses. Waste of time and money.","commenter_a":"Where is the outrage from Obama on this regarding this racial hate crime? Where are the white rioters?","post_message":"Let's hope that Obama expresses sympathy for the white victims of the #VirginiaShooting and not for the gay black shooter."},{"comment_id":"10153193679463812","commenter_b":"Lady Gaga was amazing & Julie Andrews is stunning! Love that movie always!","commenter_a":"Absolutely amazing!","post_message":"Perhaps the most powerful moment of the #Oscars: @webpagelink"},{"comment_id":"1055356871225809","commenter_b":"Trump is clearly a tyrant.","commenter_a":"Go, @username! This man will bring down the Republic! He's a barbarian baying at the gates of our Rome. He wants to change the legal system our forefathers died for, deny us freedom of the press and access to unbiased information, encourages racism and discourages free exercise of religion. This will not end well.","post_message":"\"The Post will continue to cover Donald Trump as it has all along-- honorably, honestly, accurately, energetically and unflinchingly,\" Executive Editor Marty Baron said in response."},{"comment_id":"10154250068154749","commenter_b":"How does she get away with this rubbish?????","commenter_a":"Diane Abbot is a hypocrite of the first order, always trying to play the race card if the argument does not go her way. As for JC he's a dead man walking yes massive grass roots support but his own back benchers are actively plotting against him and most are preying for bad election results so they can stage a coup. He's lost big backers, even the labour red tops are Luke warm at best. And grass roots support doesn't transfer to the ordinary man and woman on the street who see him as a reactionary 70s throwback and apologist. Labour will either ditch it before the next general election or face annihilation and ditch him and her after.","post_message":""}]
