[{"comment_id":"780568308754036","commenter_b":"She is a pig!","commenter_a":"Loved it you will not see another first lady as classy and beautiful as Michelle Obama for a while. She is gorgeous!","post_message":"What did you think of the First Lady's sunny State of the Union dress?"},{"comment_id":"10153530026483707","commenter_b":"What have Senators Done??? over 30 some years.. Trump is 1000 percent Correct.","commenter_a":"McCain is a scumbag traitor. He was codenamed \"songbird\" by the NVA when he was a pampered guest at the hanoi hilton. He has done more harm to veterans as a senator than could be believed. He is no true American hero. Piece of filth.","post_message":"Congrats to my daughter Meghan on her new nationally-syndicated show, starting July 20th - very proud of you! Learn more:"},{"comment_id":"1765571717063636","commenter_b":"@username STFU","commenter_a":"It's so nice to hear a candidate say he loves America and its people. Unlike Obama and Hillary who constantly tell us how horrible and deplorable we are and not fit to wipe their shoes. Vote Trump who would wipe our shoes if asked.","post_message":"An incredible evening in MIAMI, FLORIDA! This is a MASSIVE MOVEMENT. I LOVE YOU! -DJT"},{"comment_id":"486778464846067","commenter_b":"@username Your a FREAKING DUMB EXCUSE FOR A SO CALLED HUMAN BEING!","commenter_a":"What do expect out of a Muslim bitch that won't even place her hand over her heart when National Anthem is sang.","post_message":"Michelle Obama just said something treasonous about the flag. This is ridiculous, that flag is the symbol of the greatest nation on Earth. Do you support the American Flag?"},{"comment_id":"677264589079564","commenter_b":"If Muslims are offend by us they can leave and go else where....maybe Syria.","commenter_a":"He'll no","post_message":"Muslims Are OFFENDED By This Teams Fans Uniforms, Should They Be Forced To Change it? Take our poll!"},{"comment_id":"10153719914114060","commenter_b":"these immigrants dont have a chance getting on the housing market","commenter_a":"Dave Thompson","post_message":"“People feel rich today thanks to these crazy prices.” Swedish house prices"},{"comment_id":"10153122678405950","commenter_b":"Get another job lady!","commenter_a":"Where was her God when she divorced and remarried three times over? Can't hide behind religious beliefs when you can't follow them yourself.","post_message":"Before returning to work today, Ky. clerk Kim Davis said she is being \"forced to disobey her God,\" and that she still won't authorize marriage licenses for same-sex couples."}]
