[{"comment_id":"1338210979551629","commenter_b":"Lady your way too old to be a cheerleader!!!!","commenter_a":"This woman is not well","post_message":"HOLY SMOKES! NANCY PELOSI: Orders People to Clap, Repeats Words Then Calls John Kasich The Gov. of Illinois [Video] This is embarrassing! She scolds the audience!"},{"comment_id":"10153289431079726","commenter_b":"Sure, show me how the bad outweighs the good and maybe I believe it.","commenter_a":"Real think tank in here. Glad none of you are plotting my future. Real Christian like thoughts in here as well. Fact is you don't know what he does or doesn't watch. Fact is none of you are objective enough about yourself to see through your hatred. You'll call it something else to redirect but it's hate and negativity. It is for those reasons fox news and it core viewership are not to be believed or trusted to be fair and impartial lol","post_message":"WATCH: Krauthammer: Obama ‘Doesn’t Know A Damn Thing About What’s On Fox’"},{"comment_id":"10153546186781162","commenter_b":"The disturbing replies to this is that people actually think just because she is a woman, she can hit whoever she wants and continue to escalate a fight. Doesn't matter who or what she is. You don't hit people period. Had she not come back in, hit him and continued this, there would have never been a problem.","commenter_a":"I'm all for not putting hands on a woman. But where's this equal opportunity draw the line at? She smacked the taste out dudes mouth. Don't start what you can't finish","post_message":"PANERA ATTACK: A Panera bread manager is fired after he was filmed punching a female employee in the head and knocking her to the ground. WATCH: @webpagelink (Warning: Graphic video)"},{"comment_id":"948371528584407","commenter_b":"They will never be Americans .. They are all murders and need to go home..","commenter_a":"His typical BS. Lie Muslims. Don't belong here !!!","post_message":"Do you think there was anything wrong in saying this?"},{"comment_id":"1539146466096818","commenter_b":"😁😁","commenter_a":"I am starting to think this entire administration was homeschooled by Betsy DeVos.","post_message":"Her (lack of) explanation left Matt Lauer flabbergasted."},{"comment_id":"470909953099585","commenter_b":"Every state should step up and protect our America, muslims can keep their beliefs to themselves, ban Shariah Law in all 50 states!!!","commenter_a":"WTF","post_message":"Muslims trying to force Shariah Law on Alabama just got owned. Good. We won't stand for Shariah Law in America. Do you agree this should happen in all 50 states?"},{"comment_id":"620704854748480","commenter_b":"agree","commenter_a":"Agree","post_message":"Enough said."}]
