[{"comment_id":"10153269295123352","commenter_b":"That last statement not only make her a dumb bitch but a ignorant one at that. Please use some of that money your boyfriend is making and educate yourself.","commenter_a":"So fake she has 3 kids no where does she have the time to make all of this stuff.","post_message":"Meet Etsy's richest seller: Mom-of-three sells 3,000 items a day and earns $65,000 a month from handmade socks and scarves"},{"comment_id":"1124947717560231","commenter_b":"Hurry up woman!!","commenter_a":"Alright, that's it...we're moving to Colorado. @username","post_message":"It is absurd that here in America, we remain the only major country on earth not to guarantee health care to all people. If this proposal for universal health care can win in Colorado, I believe it will spread around the country."},{"comment_id":"10154351189226051","commenter_b":"Lmao nope 😅","commenter_a":"Christine you didn't get this one did you! 😂","post_message":"When these parents took the doll out of the box, they were surprised at what they saw. Take a look for yourself and see if it's worthy of the controversy."},{"comment_id":"10153847085126162","commenter_b":"Girl stfu ^^^ u dumb. That's not y.","commenter_a":"As long as her son has a decnt funeral, I dont judge her for using donations for what she needed besides funeral expenses. If it was enough for her to buy a house out of the hood Im sure she would have done that too! If she is partying and gloating about thats not cool. But a scandal after tour the death is kind of hard to deal with so...i cast no judgement.","post_message":"9-year-old Tyshawn Lee's mom is accused of spending money donated for her son's funeral expenses on a new car. FULL STORY: @webpagelink"},{"comment_id":"10153546478451337","commenter_b":"Bitch? Way to completely destroy everything no makeup selfies are meant to promote","commenter_a":"that bitch is bad without makeup real talk","post_message":"PERFECT RESPONSE: Watch Lana - WWE perfectly shut down her Instagram trolls..."},{"comment_id":"418611591638646","commenter_b":"We need to get rid of the income tax and the IRS and go to a strictly consumption tax. It would force people with hidden income like drug dealers to at least pay taxes on their incomes. It could also rid of us of the earned income tax credit which is nothing more than welfare paid through the income tax system. It is paid to illegal aliens. Welfare payments should be made at the state and local level and not the federal level.","commenter_a":"\"Cooperation between the parties is needed and not multiple threats of vetoes\"... perhaps if the do-nothing GOP actually starts doing something instead of just saying NO all the time then the veto threats would disappear....","post_message":"The President's State of the Union address was uplifting, particularly if one is not aware of the actual facts. The economy is better, but far from good. There is a war on radical Islamic terrorists, although he won't use those terms, and we are far from vanquishing them without an aggressive stance. Tax reform is needed, but not redistribution. Cooperation between the parties is needed and not multiple threats of vetoes. Perhaps someone can play the President's speech back to him and hopefully he will abide by the spirit of his words and not the spirit of his ideology."},{"comment_id":"1419671894761590","commenter_b":"Serves the liberal illegal lovers right.","commenter_a":"Moron","post_message":"Liberal Governor Just Caught Stealing $115 Million, Who He Gave It To That Will Piss You Off!"}]
