[{"comment_id":"1801495493414518","commenter_b":"your witch is going to fry","commenter_a":"Can Trump even go to the bathroom without retracting or sending a \"revised\" tweet after his handlers yelled at him? Losing votes every day he is! Such a dope.... A con and dope. Sad.. As at one time I liked the guy???","post_message":"Donald J. Trump received swift backlash for tweeting about the fatal shooting of NBA star Dwyane Wade's cousin and writing, \"African-Americans will VOTE TRUMP!\""},{"comment_id":"859268404119788","commenter_b":"Woman - an adult human female.","commenter_a":"This makes me not proud to be an American.. We stand by for the worst stuff.","post_message":"How's this for perspective?"},{"comment_id":"1247936331966085","commenter_b":"So tired of explaining this exact sad truth.","commenter_a":"Learn the difference.","post_message":"It was clear from the start the criticism wasn't about the flag."},{"comment_id":"10153835285409024","commenter_b":"I think legal American cititzens should be allowed to shoot illegals when they enter the US!","commenter_a":"AGREE!!","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1016327315093412","commenter_b":"It is long overdue that a woman is president, and more (sane) women are in Congress. Just don't think Hillary is deserving .","commenter_a":"Sorry, but it is time,long over due for a woman to start running this country. Look at the other countries that are run by women, get smart and vote Hillary Clinton in, she is very smart and she has Bill with her. So Bill had a woman under his desk,who cares. He wasn't sexually frustrated,if only the last 3 presidents had a woman under his desk,we would have a better run country. Now I'm not saying men should cheat, but a blow job from some stupid ass hussey, wouldn't hurt.","post_message":"It's time. Thank you, Winning Democrats!"},{"comment_id":"1161299523890076","commenter_b":"overly politically correct, nail on the head!","commenter_a":"he offered no defense...merely doubled down","post_message":"\"I think the big problem this country has is being politically correct. I've been challenged by so many people and I don't frankly have time for total political correctness and to be honest with you this country doesn't have time either.\""},{"comment_id":"10156011468900354","commenter_b":"Worse than that she made jokes about it, shameless woman.","commenter_a":"say what you will, but she is, always has been, and always will be a liar , crook, theif and a criminal. Just say no to Killary.","post_message":"Hillary's got jokes! About breaking federal law and endangering national security--what a hoot!"}]
