[{"comment_id":"626971257493453","commenter_b":"Kiss our asses","commenter_a":"he should be charged with murder","post_message":"George W. Bush was right, there were weapons of mass destruction. We always had his back. He is a great man, and a true patriot. Do you support George W. Bush?"},{"comment_id":"10155466728060354","commenter_b":"Lol...I remember when a female Dem said that recently.","commenter_a":"What will he do about all the women driven to prostitution as a result of global warming?","post_message":"We look forward to your witty comments on this one. The possibilities are endless."},{"comment_id":"10158313140330206","commenter_b":"She's obviously drunk.","commenter_a":"The employees shouldn't have stood there like that and just took it. I would've gone straight for security. The other customers are waiting.","post_message":"This woman takes the cake for being one of the WORST customers."},{"comment_id":"872561492840104","commenter_b":"Just STFU!!!!","commenter_a":"You know he's an imbecile when he says the president should b e like a rapist,drugger of the unsuspecting; Bill Cosby","post_message":"\"America's Mayor\" wades back into the fray."},{"comment_id":"917835871594729","commenter_b":"This is a very old photo of Hillary...she has become too old and out of date to be the Democratic President we need!","commenter_a":"Be nice if She would make up Her mind!","post_message":"Are you supporting Hillary 2016? Then go to DemStarter.com right now and show your support: @webpagelink Hillary is in 3rd place in pledged support behind Elizabeth Warren and Bernie Sanders on DemStarter.com, but we're still just days into it. Go to DemStarter.com, and show your support for Hillary, or for your favorite Democrat!"},{"comment_id":"10154043795967061","commenter_b":"The fact that the lady moves so slow is the first reason she should no longer be driving!!!!!!","commenter_a":"Grab her and get her out!! Why so slow Poor lady Car could explode","post_message":"WATCH: Body cam video shows Santa Fe police officer rescuing an 87-year-old woman from a burning car. \"I could have burned to death. @webpagelink"},{"comment_id":"862139507221510","commenter_b":"Obama and Trump should get along splendidly then.","commenter_a":"Hillary is running a close second or maybe she is in first place.","post_message":"Yes he is! Do you agree with Trump?"}]
