[{"comment_id":"740023432800293","commenter_b":"That is just an act! She could use some for real but that isn't going to happen!","commenter_a":"Your dead soul of an ass shouldn't have constitutional rights either you f*#king hag. Isn't it time for you to leave? Lucifer has GOT to be worried about where his ugly little daughter ran off to.","post_message":"Where's that \"love and kindness\" Hillary is always lecturing Americans about?"},{"comment_id":"10155303364265603","commenter_b":"For exposing corruption and telling the truth...","commenter_a":"He should sue the pants off of Eric Holder.","post_message":"JUST IN: Ferguson Police Chief Tom Jackson resigns, effective March 19. Lt Col. Al Eickhoff will serve as acting chief as the City of Ferguson begins a nationwide search. We will carry the 5:30p press conference LIVE on-air and online. STORY: @webpagelink"},{"comment_id":"10155065453241323","commenter_b":"You still refuse to answer the question.","commenter_a":"An admirable academic for sure . But; one line in the video had me chuckling \"And then population growth will stop\". Naive to think population growth will ever stop. Deluded dreamy lefty thinking.","post_message":"\"Let me show you the world\", said Swedish academic Hans Rosling, who has died aged 68. Here he demonstrates the dynamics of population growth, child mortality and carbon dioxide emissions. The challenge for the world is to get everyone out of extreme poverty and get the richest people to use less fossil fuels, he said."},{"comment_id":"10154391127173181","commenter_b":"Good grief, this woman needs to get a life!","commenter_a":"Me, me, me, me, me, me, me, me, me, me,me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me,me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me,me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me.","post_message":"...continues, globally, to overwhelm my appearance at the Oscars, on the occasion of my record-breaking 20th nomination, and to eclipse this honor in the eyes of the media, my colleagues and the audience, wrote Meryl Streep in a scathing statement about the Oscar dress dustup."},{"comment_id":"10153565993448271","commenter_b":"Those people are a bunch of Pathetic Savages and Thugs. Just look at their wild behavior. You would think... that the Police should have arrested scores of them. It must had been too much Rock & Roll or Punk Acid Rock.","commenter_a":"I can understand being excited but destroying public property and acting like a bunch of idiots is ridiculous.","post_message":"This is disappointing. While many people celebrated the Broncos' Super Bowl victory peacefully, some were destructive. Denver Police made 12 arrests and thankfully, no one was seriously hurt. @webpagelink"},{"comment_id":"1754512868165576","commenter_b":"Hillary will follow him ..........because she also wants Muslim invasion in United states.","commenter_a":"Barack Obama is the worst president ever in the history of the United States of America","post_message":"\"I fully expect by tomorrow morning that President Obama will ... give a press conference in which he'll explain that the problem is too many trucks. If only we had truck regulation then we wouldn't have problems like Nice, because it is trucks that are dangerous.\" – Newt Gingrich"},{"comment_id":"10153827950153797","commenter_b":"Devastating but why didn't the mother have them in the first place ?","commenter_a":"Another child in the cruel system","post_message":"CHILD DIES IN CPS CUSTODY: Several days have passed since the mother of 6-month-old Aailyah was told, \"There's been a little accident.\""}]
