[{"comment_id":"10154029279516341","commenter_b":"By the Gods. Now they do have a chance to tell that envoy to give back Roman territory and she fucks it all up ! To the Circus with her !","commenter_a":"Bum nutter","post_message":""},{"comment_id":"929207217205367","commenter_b":"It's up to the voters! United we will not let her get away with this! she's another OJ Simpson in my book....","commenter_a":"I sure hope so. This makes me sick. She is above the law. This is so shameful and just so wrong. Unbelievable.","post_message":"Today, the FBI admitted that Hillary Clinton endangered the American people—and confirmed that the worst things any of us imagined about Hillary’s email server were true. FBI Director James Comey concluded that Clinton was “extremely careless” in handling our nation’s secrets. He admitted that no reasonable person could have believed putting these emails on a private server was at all appropriate or acceptable. He admitted that 110 emails on the server were classified at the time they were sent—showing that Hillary not only lied, but knowingly endangered national security as Secretary of State. He admitted that Hillary deleted work-related emails before turning them over to the State Department, despite her claims otherwise. And most shocking, Mr. Comey even admitted that it’s likely foreign governments hacked her emails--and that our adversaries could know critical secrets about the U.S. government because of Hillary’s actions. But when you’re a Clinton, none of this ..."},{"comment_id":"1738783449718030","commenter_b":"Lmfaoooo she's just so fed up","commenter_a":"The teacher at 52 seconds hung her head low like \"these mfs here \" Ty1253184741396567","post_message":"Move over, #MannequinChallenge. The #TrumpsComingChallenge is sending students fleeing @webpagelink"},{"comment_id":"837279236391341","commenter_b":"She's a stupid twat","commenter_a":"How dumb can any one person be?","post_message":"Come again??"},{"comment_id":"10153467954429714","commenter_b":"Haha this old lady needs to grow up u to old to understand ur backwards ways","commenter_a":"Down with haters","post_message":"The clash sparked a battle that pitted school administrators against students during the last week of the school year."},{"comment_id":"10153004529954071","commenter_b":"Bill is a smart man!","commenter_a":"And what did Hillary say? Unless Trump is doing all this show to destroy the Republicans and elect Hillary as POTUS but then again there is Bernie.","post_message":"Former President Bill Clinton called Donald J. Trump in May and \"encouraged Trump's efforts.\""},{"comment_id":"940104752760731","commenter_b":"She's above the law,obviously","commenter_a":"What the hell is going on that this person can trash our national security and still be running for office when she should be in prison! Martha Stewart went to prison for less crimes!!","post_message":"A leaked email from 2014 shows Hillary Clinton reportedly wrote to then-Obama counselor John Podesta that Saudi Arabia and Qatar are funding ISIS. @webpagelink"}]
