[{"comment_id":"10155201801124170","commenter_b":"And the are letting this teach our children!!!!!!!!!!!!!!!","commenter_a":"I was talking with someone who told me they way he sees what's happening is most of these rioters are youths and college students that aren't even from HERE!!!Don't care about America, don't even know about America our home sweet home. So they need to STFU.","post_message":"Public education at its finest."},{"comment_id":"1720347271558389","commenter_b":"What a pathetic slut !!!!!!!","commenter_a":"Just another Wacko;showing her ignorance.","post_message":""},{"comment_id":"10154429543778196","commenter_b":"Better than watching u suck dick in public","commenter_a":"Really maybe he and Putin should just get a room sick of watching them suck face in public","post_message":""},{"comment_id":"1752604474967964","commenter_b":"Feel bad that all she did went right over my head. We couldn't understand the words but we made many comments on her big butt and thighs! Someone that big should never wear what she was wearing on national TV!","commenter_a":"LL Cool JJ, what a douche. Looks like the Wayans brothers had this jackass pegged, way back when, with \" Momma's Gonna Kick Me Out ! \" Maybe on youtube? Funny stuff, but about right, apparently.","post_message":"LOOK who LL Cool J just compared Black Panther Party Supporter and radical BLM donor Beyonce to..."},{"comment_id":"1675801449377863","commenter_b":"Better yet: Buh bye racist ahole!","commenter_a":"Buh bye, racist!","post_message":"Serves him right."},{"comment_id":"10155178808719411","commenter_b":"she so fine would have her sit on my tongue on the day lee","commenter_a":"Ok, so protests are Ok but protesting against the former protest is \"not Okay\".. Double standards imo.","post_message":""},{"comment_id":"10153829501651337","commenter_b":"Humanity","commenter_a":"The amount of non judgmental compassionate comments on here is truly staggering","post_message":"HE'S KNOWN HOW LONG? Here's Charlie Sheen's HIV announcement..."}]
