[{"comment_id":"764424377012570","commenter_b":"Muslims are the problems in this world without muslims the would be a better place","commenter_a":"Why is it that every Arab must have a temper tantrum and act like a five-year-old about everything? I would love to see, one time, a mature, calculated, reasonable response from a Muslim. Just once.","post_message":""},{"comment_id":"10153653886305950","commenter_b":"Shut up, whore.","commenter_a":"The teen should have complied. And his parents did a terrible job.","post_message":"The aggressive confrontation nearly cost the teenager his life."},{"comment_id":"1095951603760962","commenter_b":"Don't forget her daughter got knocked up","commenter_a":"and her 'classy' son beat up his girlfriend...great family values","post_message":"When it comes to Donald J. Trump, the gloves are off."},{"comment_id":"10153348611360950","commenter_b":"And he got arrested? For what? Bitch probably asked for it","commenter_a":"NEEDLE TIME NOW. Not 50 years later.","post_message":"Officials believe the 19-year-old suspect was upset over \"a bad breakup\" with the victim's teen daughter. Police say he confronted the mother as she was leaving her car, shot her multiple times and then went inside her home and fatally shot a dog."},{"comment_id":"1288081714641540","commenter_b":"This is scary","commenter_a":"What kind of sick prople dream up this stuff are people so afraid to die that they will go to these means to create life just to torcher and kill it. Sick sick sick!!!!!!!!","post_message":""},{"comment_id":"10153517803776157","commenter_b":"Hmmm,,, just a little chance of rain Victoria Marshall? Need some rain in San Benito!! :))","commenter_a":"Light","post_message":"Meteorologist Victoria Marshall CBS 4 News is tracking the heat and the chance for rain in your forecast below:"},{"comment_id":"10155981845940354","commenter_b":"Trump is a media whore. Anyone dumb enough to support him might as well give your vote to Hillary because that is what you asshats are doing NOTHING in Trump's history suggests he is a real conservative. He is just repeating what we say and making republicans look like clowns. His close friend Oprah Winfrey, the person who did more to get Obama elected than anyone else and endorsed by Trump to be vp is ecstatic.","commenter_a":"Hes right pc has got to go. I heard him this morning, if cnn would have allowed him to finish his sentence, he was referring to nose mouth obviously. Typical, cut them off and use it for a soundbite.","post_message":"\"I’ve had lots of men imply that I was unfit for decision-making because maybe I was having my period…\""}]
