[{"comment_id":"1277939352272817","commenter_b":"Its gangster in this bitch I better go before MFs pull they emojis out on my ass.","commenter_a":"Were are the white folk at? What's they excuse for this bull shit? Fucking dumbass idiots. I hope they sue the shit out of them!!!","post_message":"This bad cop narrative continues to evoke frustration. #WSHH #NYPD"},{"comment_id":"1584390601848053","commenter_b":"12 years old. She looks 30 !","commenter_a":"Of course she sings well.....her mother is FAITH HILL!","post_message":"Wow. She is incredible. Just like her mother!"},{"comment_id":"1340551885984265","commenter_b":"Your a believer if you believe what you said, people been saying that crap every election. I know you don't like either nobody does but someone is going to win Who would you rather","commenter_a":"@username I know you won't but watch this....","post_message":"TOTALLY VIRAL --- HOW TRUMP WINS (VIDEO) @webpagelink"},{"comment_id":"10154285934165575","commenter_b":"Bet Hillary can't do that!","commenter_a":"You knew it was coming....THE DANCING DONALD! Lol","post_message":"THIS COULD SPELL DISASTER FOR CROOKED HILLARY...."},{"comment_id":"1172120832836462","commenter_b":"@username she's a racist. \"Government people\" is code word for white devils. She just want to see them.","commenter_a":"Well how is he planning to build this wall!! Without the native America permission he's trying to build on our land (Tohono O'odham nation) nd again there's gna be another treaty broken","post_message":"President-elect Donald J. Trump says he will move to deport criminal illegal immigrants and still plans to build a wall."},{"comment_id":"10155104140119497","commenter_b":"Build that wall, watch all the libs fall on ground kicking ...priceless..let the shit show begin...popcorn anyone?","commenter_a":"I thought the Onion was supposed to be funny.","post_message":"How The Border Wall Will Be Built"},{"comment_id":"10155021638815859","commenter_b":"And dress like a woman","commenter_a":"Of course Trump fails to mention that there really is NO WAY to call the white house and expect to actually get through to anyone.","post_message":"Pres. Donald J. Trump: 'I haven't had one call' complaining about Dakota Access Pipeline. \"I don't even think it was controversial.\" @webpagelink"}]
