[{"comment_id":"1033391136683934","commenter_b":"Dee I'm not a violent women, however I would love to bitch slap you. Sorry but I'm tired of idiots like Dee. Yes Dee it's called artificial insemination. I highly doubt anyone doing this would get an abortion.","commenter_a":"That MOTHER LOVING USED ASS WIPE thinks EVERYONE should WORSHI{_ HIS GODDESS, Ayn Rand, and that EVERYONE should be SELF-SUFFICIENT. Oh yeah, He is ADDICTED to TAXPAYER-FINANCED salary and TAXPAYER-FINSANCED health care. HIS ROTTEN KIDS would STARVE if he weren't a USELESS, WORTHLESS MOOCHEZR. Maybe HE would like to pay for all of the unwanted pregnancies.","post_message":"Did Speaker Ryan just go there on Planned Parenthood?"},{"comment_id":"10152982959796130","commenter_b":"AMEN!","commenter_a":"Every member of Congress should do the same","post_message":"The #FoodBankNYCChallenge is meant to raise awareness about hunger and the struggle to live on such a limited budget."},{"comment_id":"10156776105275354","commenter_b":"Difference between American and European women...","commenter_a":"And we pay $260 billion a year for our government.","post_message":"CHAOS IN AMERICA'S STREETS..."},{"comment_id":"10154126092428132","commenter_b":"So sorry to hear your loss and prayers goes out to you and your family God bless","commenter_a":"Prayers for your brother so sorry.","post_message":"The news comes just a day after Celine Dion lost her husband, Rene Angelil, to the disease."},{"comment_id":"10153051831985950","commenter_b":"WTF?! I would have knocked that bitch the fuck out if that were my child. And the so called DAD is a piece of SHIT too! They need to light her ass up in PRISON! >:(","commenter_a":"What?! I can't comprehend this... why,,,,","post_message":"Police say a stepmom bullied her now 15-year-old stepson: \"She asked me if I wanted to play the game,\" the boy said. \"And I said no. So then she called me 'punk,' so we did it. We went in the bathroom, she poured a whole bunch [of alcohol] on my butt and then she lit it on fire.\""},{"comment_id":"10153912277130329","commenter_b":"We should exile this dumb bitch to Syria!","commenter_a":"I rather vote for Kanye than for trump","post_message":"Kanye West revealed he would be running for president during last night's MTV VMAs."},{"comment_id":"1181726388516881","commenter_b":"Yep, infidelity has nothing to do with a woman's looks. It's opportunity.","commenter_a":"Been there done that ....it sickens me even the prettiest girls get cheated on which tells me that it is not about how good you look,how skinny you are, or even how rich you are you see how when they make their minds up and don't want to work at fixing anything well we need to stop giving second chances too.","post_message":"Check out what Keshia had to say about the lie that was their relationship. What do you think of her comments?"}]
