[{"comment_id":"549834655207114","commenter_b":"These women are child abusers. Where is child protection?","commenter_a":"Yes !","post_message":"These two lesbians are trying to play god with their son. This is the world we are living in today. Do you think this is wrong?"},{"comment_id":"921846451264234","commenter_b":"Hey al sharpton you and the guy next to you with the dorkey looking glasses on why don't you preach for colored people to be good instead of hate or is it because your so friggin stupid . I never realized that years ago back when you were a fat boy some one tried to kill you I guess your were spared so into the future you could spread your hate .","commenter_a":"Pay your taxes Deadbeat ! plus penalties, plus interest, You will when Trump takes over !","post_message":"\"...offensive and insulting.\""},{"comment_id":"1123485461004965","commenter_b":"I like how Jeffery Nichols is the expert on how Women get pleasure. Don't ever believe what Women say lol.","commenter_a":"The correct position is penis in vagina. #savedyouaclick","post_message":"Size has nothing to do with it. (via HuffPost Canada Living)"},{"comment_id":"1121910377840173","commenter_b":"CAN NOT STAND HER TRUMP2016","commenter_a":"watching the debate now can't sand Carley","post_message":"It's not too late! Get your Make America Great Again hat today and join the movement to take America back from the all talk no action politicians!"},{"comment_id":"10154151629042507","commenter_b":"Says the white bitch with a job and a Beamer....Dorothy saloum.....ha-ha!","commenter_a":"Hey @username liberals, Thanksgiving looks like gratitude. It's all about money to you socialists.","post_message":"If you have $50,000 you can join them."},{"comment_id":"10155013183823984","commenter_b":"And your fat ass bitch!!","commenter_a":"He is a total brain dead idiot. Every state only has two senators. Even tiny little Rhode Island. We have 50 states and 100 senators. Congress is according to population. Actually we need to go back to how the founders originally had it, where the states legislatures picked Senators and when they misrepresented the state they could recall them. Then the Senators wouldn't be persuaded by donors.","post_message":"President Barack Obama just made a staggering announcement about the Electoral College days before the electors cast their official votes..."},{"comment_id":"10153589793400329","commenter_b":"10154197025200954Mary Lu10154879708717248","commenter_a":"Ryan Bere still wanna do this?","post_message":"Jaws IRL."}]
