[{"comment_id":"10154047129019749","commenter_b":"then they wanna face Russians? :D :P","commenter_a":"Victoria","post_message":"Graduates from Norway's Royal Naval School in Stavanger have shown the Internet they can do more than just march in formation."},{"comment_id":"10158604415035206","commenter_b":"@username The woman can speak five languages... get a grip","commenter_a":"I have never said anything negative about Barack Hussein Obama's wife, but since that's gonna be the new norm for the liberal lunatics, let me just say this. Melanie Trump has more class in her little finger than Michelle Obama ever had or ever will have. But just look at all the jealous women who are putting her down and all the worthless men with mangina's who are putting her down. You people are pathetic.","post_message":"“Melania will be an excellent first lady who will take Slovenian values of generosity, loyalty and trust to the United States and the world,\" said one fan from Melania's hometown."},{"comment_id":"10152647068355927","commenter_b":"She can be rich,but doesn't want the rest of us to be","commenter_a":"What's wrong with being rich? We pretty much all strive to be rich but the government does its utmost to prevent you. Good grief Hil.","post_message":"Great question..."},{"comment_id":"10154341575671729","commenter_b":"Not a charge will be brought against this bitch","commenter_a":"How much worse does it have to get? Will a corrupt government be able to bury all the evidence? If Hillary survives the latest, democracy is finished.","post_message":"The hits just keep on coming..."},{"comment_id":"10153587068405329","commenter_b":"Dolphins are such vicious, terrifying monsters!","commenter_a":"@username \"It hit my wife and knocked her over, and punched my daughter.","post_message":"The dolphin jumped in, broke someone’s ankles and “punched” a 16-year-old girl."},{"comment_id":"10153855436966337","commenter_b":"It's a final effort to get her extra viewers lol","commenter_a":"God no! Jim Ian Eric Jesse Omar Eric","post_message":"PRETTY COOL: Do you want to see 'Supergirl' meet up with 'The Flash'?"},{"comment_id":"1038174059551348","commenter_b":"@username you are an Idiot and will never Learn !!","commenter_a":"Absolutely! Why don't you just fly away to that new mansion in Dubai, never to be heard from again.","post_message":"Yes, and you should be ARRESTED!"}]
