[{"comment_id":"1840557005997054","commenter_b":"Out her in jail!!!","commenter_a":"Insanity needs to be STOPPED now. Gets some 'TEETH' into prosecuting ALL threats.","post_message":"Yet another one..."},{"comment_id":"10154880669523614","commenter_b":"Let them go there and put up another wall.","commenter_a":"Now there's an idea, send them all there not here. Works for me.","post_message":"Canadian Prime Minister Justin Trudeau's immigration minister has declared an open door policy for immigrants and refugees."},{"comment_id":"10154574159493445","commenter_b":"The only wall is much needed to keep illegals out that are a drain on society. Mexico doesn't want them back and they send millions if not billions to pump up Mexico's economy and drain our economy. Many of these immigrants are from further south than Mexico. Mexico wants to keep them out of their country as well that's why they put a large wall on their southern border. Why are they allowed to do that yet we are not??? I've had several friends killed my illegals because they can't drive. I also have a very good friend that can't walk, can hardly talk and will never work again all because a car load of illegals didn't know what double yellow lines on the highway stood for. They passed around car load of illegals at the top of the hill and hit him head on at 60 mph. 3 of ...","commenter_a":"Texas.","post_message":"Creative smugglers will always come up with ways to get drugs over the border - and many doubt the effectiveness of a wall to curb the flow."},{"comment_id":"10154683791611002","commenter_b":"Gross. She needs to be locked up and throw away the key","commenter_a":"Lock her up and throw away the key.","post_message":"A 38-year-old Dearborn Heights woman is accused of attempting to arrange a meeting for sex with whom she thought was a man and his underage daughter."},{"comment_id":"1413445192014321","commenter_b":"You girls are funny!","commenter_a":"Come on! This is his ploy to try and intimidate Clinton and throw her off her game. Who's he going to announce next? Monica Lewinsky as Secretary of State??","post_message":"This couldn't be worse."},{"comment_id":"1015138285280684","commenter_b":"To the bone","commenter_a":"They cut his head","post_message":"Ron Mott said the four Chicago teens who kidnapped and tortured a mentally challenged young man weren't \"trying\" to be criminals."},{"comment_id":"978977272143131","commenter_b":"I agree. That's a spot on observation. I never thought about that, but it's true. Many feminine topics make people uncomfortable. Whether it be hygiene, sexuality, or social treatment. All common topics for comedy.","commenter_a":"Honestly, I think a lot of the reason men don't find women funny, is because men AND women are trained to see things from a man's perspective. I can hear a boner story and laugh my ass off because I can imagine what they are telling me and it's amusing. So much of what women comedians talk about are things that men feel they can't relate to - they've never thought about most things from a women's perspective. Just my two cents though...","post_message":"First it sounds ridiculous. Then you get it. Then it's hilarious and sad all at the same time. - Eric March"}]
