[{"comment_id":"1002435359842664","commenter_b":"One things for sure there's plenty to pray for. For those precious children, for their mothers who have been fed lies from hell's own lips, and for those who would advocate for such heinous things to go on. I guarantee you this girl has had a couple of abortions and they were oh so wonderfully sickeningly sweet to her- so that they can use her face and influence. Makes me sick. Yes, she is responsible for her sins, but she's just a rebellious, gullible kid that several of these snakes have sunk their fangs into. Just like Brittany Spears before her- and Raven Symone.","commenter_a":"My heart went out to her when she started turning crazy. She's in the throes of rebellion, but I think it came because some of the snakes of Hollywood influenced her. She's rebelling against her dad, and the way he's tried to raise her, like many of the child actors and performers before her. The kid used to want to be a missionary and help save lives. Now she wants to be a champion for killing. I will still pray for her. God's arm is not short.","post_message":"\"I'm a good person to put on the face of a T-shirt.\""},{"comment_id":"10153862572524369","commenter_b":"I have pretty extensive vocabulary and definitely don't need to use slang so by all means generalize and assume that we all say it...it's sad people are really this stupid.","commenter_a":"If they want the racial slurs to go away, they need to stop saying them as well. It's a double standard.","post_message":"Student groups have complained for months of racial slurs and other slights on the overwhelmingly white campus. Now, more than two dozen players say they're staying on the bench until the university's president is removed due to his \"negligence toward marginalized students' experience.\""},{"comment_id":"10153131166411051","commenter_b":"Muslims, get out of our country, go to where you are sickheaded and treat others like dirt..we don't want you here..you are sick and so disrespected..we can't stand you or your way of thinking.","commenter_a":"I'll continue to do things the way I normaly do. If you are offended by it then that's you're problem.","post_message":"A woman's painting was rejected because it might offend some Muslims. Decide for yourselves if there's anything wrong with the image."},{"comment_id":"10153216569907550","commenter_b":"@username, lol you all claim its part of your heritage... First and foremost did you READ my post carefully? Because if you did you would know that I was referring to the past southerners who DID do all that. Your heritage is ALL THAT.... Your southern heritage is a hateful one and that's what you all are holding on too... You Keep saying that flag is our heritage. Name one good thing the south did for the slaves that wasn't hateful and name one good thing that flag represents. And FYI Lisa, you can't enlighten me because just like your counter part, you can't explain what your southern heritage is.","commenter_a":"It is not a symbol of hate, only in your dumb minds...its a symbol of our Heritage......maybe if you learned something in school you wouldnt worry about that flag........","post_message":"\"The time has come to remove this symbol of hate....\" Local religious and political leaders joined forces today to call for the South Carolina state general assembly to remove the Confederate battle flag still flying at the state capitol. More here ---> @webpagelink"},{"comment_id":"1777986365799226","commenter_b":"She is above the law,she doesn't, cheat or steal!","commenter_a":"As a woman I don't want the first female president representing me as someone who is a corrupted, lying, manipulator and fraud who thinks she is above the law. #Hillaryforprison.","post_message":"Hillary Clinton holds campaign rally in Cedar Rapids, Iowa after FBI announces they are reviewing email investigation. abcn.ws/2fnHba3"},{"comment_id":"1877280792500982","commenter_b":"Hes an alien!!","commenter_a":"Can't hear clearly","post_message":"Paul Ryan is speaking."},{"comment_id":"1313910325313867","commenter_b":"Some body give me one logical reason to have women in combat.","commenter_a":"There are some exceptional women who can and have performed well. However, truth in science shows overall. Men hold up better. Women break down faster. So many things women do better. Leave the grunt work to us grunts.","post_message":"When will \"the party of science\" accept the truths that science tells us?"}]
