[{"comment_id":"1230461060352731","commenter_b":"Finish your comment. What type of women are these?","commenter_a":"I'm actually quite amazed at the amount of women attempting to justify this. As if abusive culture isn't hard enough on you. Just wow. Like demographic though.","post_message":"UPDATE: According to Rolesville Mayor Frank Eagles, the officer seen slamming a student to the ground is school resource officer Ruben De Los Santos, who has been placed on paid administrative leave. Follow this story>>wral.com/@username/"},{"comment_id":"609328869267784","commenter_b":"Racist woman","commenter_a":"It's always been great.","post_message":"Beyoncé appeared Monday night at the Grammys and led a visual and musical performance celebrating motherhood."},{"comment_id":"10154383392767894","commenter_b":"These two witches are beholding to special interests!!! Drain the swamp!!!!","commenter_a":"did not help ...","post_message":"These two Republican senators voted against Betsy DeVos."},{"comment_id":"699044636944748","commenter_b":"But will he be deported!","commenter_a":"Kill them all!","post_message":"HORROR IN MINNEAPOLIS! Somali Refugee in U.S. for Only 3 Months RAPES American Woman! This is what OBAMA has done to our cities! He imported this Muslim rapist!! TRUMP WAS RIGHT!"},{"comment_id":"10153436831622217","commenter_b":"I never said I sympathized with Rhodes, I'm concerned over how you are passing over Hitler's attrocities if they are nothing. Generally, people who downplay Hitler are anti-Semitic","commenter_a":"Oh my God... if you compared Hitler with Cecil Rhodes, the former is a TODDLER... he killed over 15 million people, kidnapped forced millions into slavery, his statue shouldn't be anywhere for people to remember him, he's not hero or we can have statue of HITLER in Berlin","post_message":"Campaigners say #CecilRhodes represents white supremacy."},{"comment_id":"10156552982575354","commenter_b":"Colorado? Thats stupid of a migration....I am disapointed california was a great republican state being ruined by demoxratic liptards","commenter_a":"Enough said - California: soooo fucking broke no thanks to Democratic ignorance. A liberal virus that occupied the west. All these liberal fucktards are moving to Colorado with their shitty habits, a virus that will continue to spread.","post_message":"A worthless piece of paper anymore?"},{"comment_id":"726384220793520","commenter_b":"Mostly things that happen bad in this country always happen in Texas are with someone from Texas","commenter_a":"That kinda stuff goes on all the time in Texas","post_message":"Terrible."}]
