[{"comment_id":"10153432042256051","commenter_b":"Those poor people deserve a better life I heard they throw their children in the garbage because they're girls","commenter_a":"Taking misogynists whose lives revolve around subjugation of women is a bad idea. Honor killings and selling daughters are both illegal in America. Thank God.","post_message":"Here's why President Obama says accepting Syrian refugees is the ultimate American thing to do. Do you agree with his message?"},{"comment_id":"1079856352035375","commenter_b":"Wow","commenter_a":"White and gold","post_message":"o.O"},{"comment_id":"1012827362091069","commenter_b":"The ugly bitch is back. She hasn't been on for a while and I hoped she had disappeared.","commenter_a":"Lay down dog","post_message":"Ann Coulter and Fox News take another step closer to flat out saying they don't want \"THOSE\" people to vote."},{"comment_id":"10152677348991523","commenter_b":"I wasnt there but innocent until proven guilty and its always a bunch of white women","commenter_a":"They are liars. Every time these women have a press conference, I've noticed while they're speaking they have to keep looking down at their notes. Their statements should freely flow out of their mouths if it was true.","post_message":"Phylicia Rashad says she was misquoted on Bill Cosby, and sets the record straight."},{"comment_id":"496072593916654","commenter_b":"send them to the toilets they came from","commenter_a":"Unless the Muslims can \"Swear allegiance\" to America, practice / observe their faith, while respecting & protecting the rights of Non-Muslims...YES, DEPORT THEM!","post_message":"Chaos ensues after Norway starts deporting Muslims. Norway made a brave move, now the rest of the world needs to follow their example. Do You Support Muslim Deportation In The United States?"},{"comment_id":"1576836375956014","commenter_b":"And yes, you will pay for that f'n wall!","commenter_a":"Fox apologized to Trump and invited him in May. He is a liar","post_message":"The former president of Mexico, Vicente Fox Quesada, says Donald J. Trump is using his visit to Mexico with President Enrique Peña Nieto to boost his sinking poll numbers. @webpagelink"},{"comment_id":"1796841757230844","commenter_b":"well how disgusting women walking around half naked in front of men!!","commenter_a":"More made up BS","post_message":"Former Miss Arizona Tasha Dixon says Donald J. Trump walked into a dress rehearsal for the 2001 Miss USA pageant while the contestants were \"half-naked\" and that women were told to \"fawn all over him.\" The Trump camp says the accusations \"have no merit.\""}]
