[{"comment_id":"10153831676802377","commenter_b":"Trump and him are a great team and those Trump have lined up will make The A team! Everyone that loves this country has to realize now this Election is about saving this country! Do yourself and loved ones the most important thing and vote Trump! Obama is letting illegals in to vote the Americans have to stand up and fight for their own freedom!","commenter_a":"No he lives in a bubble","post_message":"Following Mike Pence's remarkable performance at the vice-presidential debate, Republicans wish they could swap their presidential candidate as the Indiana governor now appears more promising than Donald Trump, according to Politico."},{"comment_id":"10152778407223445","commenter_b":"No argument, no facts, just a loud mouth bitch thinking she's right bc of some stupid ass parents. She keeps saying free access, bitch it's already accessible, just gotta know who to call. 2chainz wins this conversation piece every time.","commenter_a":"Idiot-ass","post_message":"UPDATED: Nancy Grace admits defeat in #pot debate with 2 Chainz?: @webpagelink"},{"comment_id":"644825525648235","commenter_b":"That doesn't matter he is evil to the core Common core Rotten Apple Treasonous Muslim at war with America","commenter_a":"The antichrist is supposed to be gay I was taught","post_message":"Former Breitbart Reporter: Why Did Obama Join “The Gay Club” at Occidental College? @webpagelink"},{"comment_id":"769122743278303","commenter_b":"Your right just little bitches","commenter_a":"Three armed thugs couldn't handle one 67yr. old man. Punk ass b!tches, take note; One responsible, LEGALLY armed American Citizen is better than three worthless, no job pussies with mothers on welfare with multiple kids from multiple donors. And they wonder why they get shot.","post_message":"Thugs Attack Little Girl, Grandpa Immediately Blows Them Away With Shotgun. Thank god for the 2nd amendment. Let's show him our support. Can we get 75,000 'LIKES' for this grandpa?"},{"comment_id":"10153113757150329","commenter_b":"I am 5 ft 9 and wear a 22. She is 4\" shorter than me., She is sitting sideways and we all know when we sit down the bulges show more. if she was standing up you would be able to tell better. She is gorgeous and fyi anything over a 12 is considered obese in the weight scale","commenter_a":"If she's a size 22 then I'm also a white woman.","post_message":"Meet Tess Holliday, a size 22 model who is the first of her size and height to be signed to a major agency."},{"comment_id":"1505750879440568","commenter_b":"@username...you\"re a stupid girl.","commenter_a":"I really feel like if the voting system was trustworthy Trump would win. His crowds are just insane and people are so enthusiastic about him. However, I don't trust the system and I'm scared to death that she will win because it will be rigged. I am literally terrified of the possibility that she could be our president. I have legit anxiety about it.","post_message":"The election was supposed to be over months ago. But certainly this week it was not supposed to be in question. Hillary should have been... They're already planning inaugural balls and all the other trappings that go with victory. This is not where they wanted to be, and with the possibility Trump could win, they are in abject panic. And it's being demonstrated on TV."},{"comment_id":"10153146614743984","commenter_b":"You Dum bitch","commenter_a":"IMPEACH OBAMA NOW that damn MUSLIM","post_message":"Wow. I'm sure this is the last thing Obama wanted to slip out to the public. Do you think Obama is one of our worst presidents ever?"}]
