[{"comment_id":"1200378003330990","commenter_b":"@username then why girl dont get a comfortable bra? DICKHEAD?","commenter_a":"well what if show my boner because wearing underwear is a bit uncomfortable","post_message":"These high school students brilliantly stood up against sexist dress codes."},{"comment_id":"1142904239055165","commenter_b":"Cruz wants to stop illegal immigration. He or Trump will basically rescind all this lawless president's entire presidency in the first month.","commenter_a":"Don't bet on it. Remember, Cruz though he has his good points, he still \"wears the Republican & Special Interests chain\" he forged by accepting campaign contributions. Also, remember fort 7 long, long, long years...he didn't constatnly call for John Boehner (sober?) to call for The House Sergeant-at-Arms to arrest \"Barry O from Honolulu\" for multiple counts of High Treason, violation of The Presidential Oath of Office, failing to defend The Constitution, and counts of U.S. Treasuyr Embezzlement of Funds to illegally fund bogas business startups that failed, disappeared, and the money disappeared as well.","post_message":""},{"comment_id":"10154326925529586","commenter_b":"The same thing happened to me! A few neighbors found it funny to toss their firecrackers over the fence during some lunch party. We came home to find our poor baby scratched up and shaking - stuck between a rose bush and fence. Horrible horrible how lightly some people take this!","commenter_a":"I used to love July 4th until someone decided to throw firecrackers in the yard with my dog. She passed her fears on and my dogs are so afraid they huddle against me and shake. I dare not leave my home out of concern for what my pets go through.","post_message":"URGENT: Your dogs & cats can be TERRIFIED of fireworks. Keep them safe this #FourthOfJuly."},{"comment_id":"10152595015514071","commenter_b":"Everyone's saying about larger women.. Have any if you thought that some girls are blessed with a small back but large boobs!","commenter_a":"Good!!","post_message":"Thousands of people have signed petitions calling for Victoria's Secret to offer sizes that fit more women."},{"comment_id":"10155065586189657","commenter_b":"She is garbage","commenter_a":"Gun owners - mentally disturbed. A man dressing up like a woman - \" Normal \" This is leftism.","post_message":"This wasn't a mistake, this was done on purpose."},{"comment_id":"10155239406179199","commenter_b":"Wow, you're an a**h**e","commenter_a":"I bet you they're trump supporters.. them","post_message":" still a person, you should still treat me with respect."},{"comment_id":"10153017975939205","commenter_b":"Well you'll have to fuck off back to Europe then, cunts !","commenter_a":"I worship Ana.....Every square inch...","post_message":"Who knew Jesus was against immigration!"}]
