[{"comment_id":"685842924908994","commenter_b":"@username and you are a millennial piece of shit who does not know his ass from a whole in the ground. You should be stepped on like the cockroach you are.","commenter_a":"FYI, George Soros, Move On and Black Lives Matter are responsible for all of the protests going on. These are NOT groups of people who suddenly decided to protest. Therefore, the is more Hillary BS. However, CNN and MSNBC are blaming Bernie and Stein supporters. These people are insane. I am so tired of this BS.","post_message":"Protesters targeted buildings owned by Trump – burning effigies, setting flags on fire and chanting: “Not my president.”"},{"comment_id":"758122781044966","commenter_b":"Pack it up asshole your fired","commenter_a":"Traitor","post_message":"While Everyone Was Distracted By Super Tuesday Obama Secretly Did THIS We can't let him get away with this. He needs to be stopped. Do you think Obama is running this country into the ground?"},{"comment_id":"678910242299554","commenter_b":"She needs to ban herself and all the other idiots","commenter_a":"She has no authority to actually ban anything.","post_message":"You'll never believe what Michelle is trying to ban now... Ridiculous. She has no right and no authority to do this. Should we kick Michelle out of the White House?"},{"comment_id":"10153562599204087","commenter_b":"#DumpTrump","commenter_a":"cruz your a fool the media has been trying to destroy trump and help you. cruz you are stupid","post_message":"“Every accusation you raised is incorrect,” Ted Cruz told Fox News host Chris Wallace when asked about his campaign’s role in spreading falsehoods about rival Ben Carson in Iowa. “I appreciate you reading the Donald Trump attack file on that.”"},{"comment_id":"10154554439281602","commenter_b":"@username you must be a very lonely man","commenter_a":"The metal scrap yard is located on the same street as the historic Colt Factory. To pretend they had no knowledge of it's origin is BS. They should be fined and held accountable. I lived across the street from this monument for two years and while the area does have its issues, there is no reason to bash Hartford. There is a multitude of beautiful and historical architecture to see in that area if you are willing to get out of your car. Many state and local residents have worked long and hard to have the Colt area designated as a National Park. This is a slap in the face to a city that is trying to restore some remnants of it's former glory. Take the tour - learn a little history and have an appreciation for some of the treasures in our own back yard.","post_message":"\"When I first saw it, it almost made you want to cry.\""},{"comment_id":"611037522408756","commenter_b":"Is this trump's doing ? Has he stirred up so much open racism that a judge would feel more compassion for a white kid ?? Was there a bribe ? Maybe the judge himself is a pedophile? ? This absolutely makes no sense whatsoever. I'm so sick of these judges who release all these rapists back into society. Arrest these judges !!!","commenter_a":"I agree. It is an outrage! I am sure if he had been a minority he would have gotten life in prison!!","post_message":"This is an absolute OUTRAGE."},{"comment_id":"10155308331690354","commenter_b":"If these 400 men are really that stupid...do we really want them populating the world anyway?!","commenter_a":"I wasn't aware obama was a follower","post_message":"Other than charisma, how does one convince 400 men this is a good idea?"}]
