[{"comment_id":"10153359522561051","commenter_b":"I'd be waiting every day to catch those bitches.","commenter_a":"I hope she caught her in the parking lot.","post_message":"When this woman's 2-year-old son came home with these marks on his leg, she marched down to his school and demanded to see the surveillance footage. Now she's even more outraged."},{"comment_id":"10154969717088352","commenter_b":"She need to sit in jail for a good 30 days!! Bet she won't think that's funny!","commenter_a":"And what's her punishment??!!!","post_message":"Massachusetts cop’s wife ‘faked robbery and spray-painted the letters BLM on her own home to blame Black Lives Matter supporters’"},{"comment_id":"1259707477396285","commenter_b":"@username a much better caption for that sound","commenter_a":"Ali Finneran","post_message":"Once you hear it, you can’t un-hear it. It will be forever with you. Just a warning."},{"comment_id":"10152676390231519","commenter_b":"I always come across people who like to talk shit while hiding their face. Typical","commenter_a":"Mentioning Faux News isn't a \"liberal\" thing. The ones who mention it are humane, educated, not ignorant and are not racist. That's not \"liberal.\" People that watch Faux News other than for the laughs are both ignorant and racist. Period. They also hate democracy, hate poor people and hate minorities - I.e., they are thuggish punks. Wear your badges proud, you cowardly fascist creeps!","post_message":"This could end Brian Williams' career..."},{"comment_id":"10154056899827541","commenter_b":"Did you know that one the kkk used to lynch Italians as well?","commenter_a":"All you morons. This is an italian thing. And they are white. Get over it already. Its 2017 almost","post_message":"A high-ranking mob enforcer from Queens told a gambler who owed his boss money he was saved by the color of his skin."},{"comment_id":"10152910274569091","commenter_b":"Lmao I wonder what gave him away... The eyes?","commenter_a":"@username lol","post_message":"This man was arrested smuggling 18 pounds of marijuana in his checked bags at LaGuardia Airport: @webpagelink"},{"comment_id":"10153554741380950","commenter_b":"Wait until those other prisoners get a hold of her. She will wish she was dead! Many of the women in there worry about their children, and don't take kindly to those who hurt children! She'll get hers! Karma right around the corner!","commenter_a":"Do it to her!","post_message":"The 4-year-old boy's stepmother put his legs in 130-degree water for at least 20 minutes; it would have taken just 4 seconds to scald the child, prosecutors say."}]
