[{"comment_id":"10152925468786680","commenter_b":"Love is no ones business but the two who found it's bliss.","commenter_a":"Well, you could always just ignore it. Our government seems to be doing that alot lately. Like DC ignoring the Heller case.","post_message":"“It seems like the oppressor is now taking on the mentality of the oppressed.”"},{"comment_id":"10153901527564342","commenter_b":"I hope everyone that takes their child there see's this and takes their child out of there...I also hope they shut this place down and arrests that woman","commenter_a":"Their intention was to not hurt the boy yeah OK why didn't they stop when the little boy said it hurt. That's exactly why I do not put my kids in daycare this world is full of stupid people who don't care for our kids. Its not the daycares responsibility to scrub the kids face. Like really. They should face charges I'm sure someone else heard and seen that works with this stupid girl ugh this just really upsets me.","post_message":"The dad wants the daycare to face charges"},{"comment_id":"10153401168701130","commenter_b":"Pussy ... no balls...","commenter_a":"Char Marsh","post_message":"President Obama is a little too used to reacting to shootings. Video: NowThis"},{"comment_id":"1095905513769436","commenter_b":"But he couldn't get our marine out of Mexico, anybody had enough","commenter_a":"i do not believe that he was ever a prisoner of the taliban. he was working with them","post_message":"#Bergdahl wasn't just a DESERTER who left our side; he was a DEFECTOR who joined the other side!"},{"comment_id":"1836028549960584","commenter_b":"She is our next President.actually Trump made it easier for her .","commenter_a":"Yeah, it pisses me off ... but my respect for her has just gotten greater.","post_message":"She and her supporters smile and thrive despite a daily avalanche of hatred."},{"comment_id":"1102034899855986","commenter_b":"You all want a Muslim hater so kinda breaks out even don't you think?","commenter_a":"Fuck 'em.","post_message":"American Islamophobes are beside themselves because human rights activist Sadiq Khan was elected mayor of London."},{"comment_id":"10154931929434641","commenter_b":"Lickass, lickass, lickass from Sri Lanka.","commenter_a":"CNN offered a lot of 'fake news; and 'alternative facts' about Hillary and \"fake polls\" showing her victory.... Mainstream media has lost its credibility.... You cannot stop Trump getting elected in 2020 either","post_message":"\"Alternative facts aren't facts, they are falsehoods.\" - Chuck Todd In an interview on NBC's \"Meet the Press,\" Trump senior adviser Kellyanne Conway said White House press secretary Sean Spicer's false claims about the size of the crowd at President Donald J. Trump 's inauguration were \"alternative facts,\""}]
