[{"comment_id":"952483414832934","commenter_b":"Don't tag me in anything, slut-shamer.","commenter_a":"Lyssa","post_message":"The details of the next season of American Horror Story are terrifying..."},{"comment_id":"874546065914187","commenter_b":"Buy a boat move in land !","commenter_a":"Not just act, but act urgently. Right now, it's all but inevitable that there will be some serious sea level rise from melting glaciers over land.","post_message":"Barack Obama is right. It's time to act. Like ATTN: for coverage of climate change and the environment."},{"comment_id":"10154809751863812","commenter_b":"Yup I'm buying it! Vanessa Duarte I found our house lol","commenter_a":"@username buy it","post_message":"The 3-bedroom property, located in Bracknell, Berkshire, served as the home where Harry Potter grew up with the Dursleys in the movies."},{"comment_id":"1157609597663965","commenter_b":"Go Grab your mother's Pussy","commenter_a":"Dumb a$$ people - looking to start a war here on our home land - won't be happy until they do - hope they are truly ready for it - and hope they know what that will really mean.","post_message":"BREAKING: A massive protest of President-Elect Donald Trump is happening in downtown Chicago. It started outside the Trump Tower and is growing @webpagelink"},{"comment_id":"623778954497467","commenter_b":"Hoes fuck over A by picking B. Once B fucks over the woman, woman tries to go for A to save face... but A ain't having that shit and tells her to go fuck herself sideways.","commenter_a":"I believe A is from the Amazing Spiderman...","post_message":"A or B? #WSHH"},{"comment_id":"853194554776798","commenter_b":"all illegals should be hunted down like animals captured and deported","commenter_a":"Send. Them. All. Back. Legal immigration only.","post_message":"\"I know it’s going to pass, and I know we’re going to be protected.” - Camila Trujillo, DREAMer"},{"comment_id":"10154958123446037","commenter_b":"Go away troll 🤣🤣🤣🤣🤣","commenter_a":"Why should the taxes I pay be used to pay for security for a billionaire that pays no taxes?","post_message":"“New York City taxpayers should not be on the hook for 80 percent of the national bill to protect [Donald J. Trump] and his family’s residence.\""}]
