[{"comment_id":"10153067300837061","commenter_b":"Alex Barham you better do this for me. I sunflowers","commenter_a":"Beautiful story.","post_message":"Wisconsin man plants 4-mile stretch of sunflowers in tribute to wife who died of cancer: @webpagelink"},{"comment_id":"10153689322651162","commenter_b":"Typical female cant let another female live. Lol","commenter_a":"Stupid a@@! She probably walks faster than the Barbie Jeep.","post_message":"WOW: A 20-year-old college student's license was suspended when she was busted for a DUI... So she decided to get around campus on a Barbie Jeep instead: @webpagelink"},{"comment_id":"10153501793088837","commenter_b":"I don't care that they kissed but I think all PDA should be refrained. I won't do it in public and I don't like it when straight people do it. Save for privacy of your home. I don't mind seeing a quick kiss, but the groping is nasty.","commenter_a":"keep your private life private... and when you go to a different place be modest n respectful..carry yourselves accordingly","post_message":"UPDATE: Jordan Schaeffer still hasn't recovered from his Miami vacation when he and his boyfriend were beaten at a BK Whopper Bar in Miami Beach after they kissed."},{"comment_id":"516585565198690","commenter_b":"Leave America, why are you here? Go back where you belong, we don't want you.","commenter_a":"Ship them all back to the hell hole they came from. We don't need or want them.","post_message":"This state just voted to ban Islamic laws… Good. We won't stand for Shariah in America and neither should you. Do you support banning Islamic laws in all 50 states?"},{"comment_id":"10157704194035725","commenter_b":"MAKE SURE SHE HAS NO EAR PIECE IN HER EAR.","commenter_a":"Great show this morning!","post_message":"I am truly honored and grateful for receiving SO much support from these military leaders -- American heroes -- who have defended our freedoms. THANK YOU for your service and sacrifice, as well as your confidence in me to serve as Commander-in-Chief. #AmericaFirst!"},{"comment_id":"727349494120008","commenter_b":"are you kidding me. Get rid of these lowlife scum bags. It didn't have a dining room. well soon they will be Trumped.","commenter_a":"If this is true .they need to go pitch a couple tents ⛺️ somewhere . Give the house to someone who will be grateful to have a roof over there heads 😡😡","post_message":"This shows the welfare mentality at it's absolute WORST! This family has rejected 2 different taxpayer funded 5-bedroom houses and is now staying in a taxpayer funded hotel but they are making another VERY special demand..."},{"comment_id":"10152956998151051","commenter_b":"Good! Send her ass to prison!","commenter_a":"Good","post_message":"Remember the veterinarian who got fired after doing this to a cat? Well, she just got some more bad news."}]
