[{"comment_id":"10153184013859255","commenter_b":"ThankYou","commenter_a":"Who was it that said \"You have to have some intelligence to realize how stupid you are\"? No intelligence on display with those who still believe in the KKK. Haters and bigots.","post_message":"Another day in post-racial America."},{"comment_id":"10153836514883797","commenter_b":"Why don't young ladies have enough sense to do background checks on these idiots before they shack up with them, have kids with them...","commenter_a":"Omg that's so sad","post_message":"HEARTBREAKING: Cecelia has just moved with her two children from the Detroit area for a better life. But Friday night, her ex-boyfriend used a dog leash to strangle her and her two boys. The last thing she ever said to her mother before her death will break your heart:"},{"comment_id":"10153091738774071","commenter_b":"Tesla already solidified its royalty by breaking the consumer report ranking system 😜","commenter_a":"\"While Porsche's Concept Mission E is just a concept now, Porsche said that it aims to begin production in the next five years.\" The cheaper Tesla will be out by then and Tesla Motors will solidify it's spot as the king of e.v's.","post_message":"The future of Porsche? (via Tech Insider)."},{"comment_id":"10154004463969060","commenter_b":"We did, we along with many other countries liberated Europe…you're welcome. But in all serious we have and we continue to do, but we know when we're being played! But you're so busy with statistics, you failed to look over the problem! You need to understand the difference between migrants and refugees! The human catastrophe you're talking about is in Syria, they're refugees (although most are single males - who should be heading in the other direction to fight for there freedom and their families) The majority are economic migrants (for outside the EU), exploiting the current situation - and Germany.","commenter_a":"She does what she thinks it's good for Germany and EU, and not what she thinks would give her more votes!!!!!!! That's the difference!!!!!!!","post_message":"“I don’t have a Plan B,” she said with fighting passion. It is “my damned duty” to find a common path for the EU"},{"comment_id":"865723720214442","commenter_b":"Abortion is murder, and most unwanted pregnancy are related to sin sex with a man they don't love a date of selfish reasons like I am not ready now I am in school or the man runs off or even the man wants her to get one and even beats her.","commenter_a":"There is a planned parenthood in Knoxville that advertises abortions on their website. So why this woman decided to self abort is a puzzle.","post_message":"While attempting to self-abort with a coat hanger, the woman became worried about her own safety. Her boyfriend took her to the hospital where doctors delivered a 24-week-old baby weighing just 1.5 pounds."},{"comment_id":"767374910062356","commenter_b":"Yes!","commenter_a":"Lord help us she is just like Obama.","post_message":"Can we PLEASE learn from last time?"},{"comment_id":"1112602185474010","commenter_b":"FFFFFFFFFFFFFFFFFFFFFF trump he is a orange bigot! #Ftrump","commenter_a":"trump 2016","post_message":"Former Mexico President Vicente Fox is sorry, not sorry about his big middle finger to Donald J. Trump and his proposed wall along the U.S. southern border."}]
