[{"comment_id":"10154376127101509","commenter_b":"Unemployment has been the highest it's ever been under his presidency. It has just recently declined...ever since republicans took control of congress. Hmmm @webpagelink","commenter_a":"He is the worst president in the history of this once great nation. Bush is a close second. Those two have done more to destroy personal liberty and prosperity than any presidents before them. Obama is such a hypocrite. Scolding this country about division between races and religion when he has done more to divide this country than anyone in history. I need a shower after that garbage.","post_message":"President Barack Obama presents \"four big questions that we as a country have to answer \" during his State of the Union address. #SOTU updates: @webpagelink"},{"comment_id":"766826556749286","commenter_b":"pigs","commenter_a":"Thug scum! Their families should suffer for the suffering they've caused others!","post_message":"So disturbing."},{"comment_id":"768354383300233","commenter_b":"@username Go ahead and Kick the Tea Partiers and Trumpetiers out of the GOP, MARY JANE FAGALA! WHAT YOU WILL HAVE LEFT SHOULD BE ENOUGH TO HOLD A STRATEGY SESSION ON HOW TO REACH OUT TO DISAFFECTED DEMOCRATS, SOCIALISTS, COMMUNISTS AND LOTS OF OTHER \"ISTS,\" BUT YOU WILL HAVE LOST ALL THE POWER THAT THE TEA PARTY DELIVERED TO YOU. LOTS OF LUCK!!","commenter_a":"If the GOP think the people are ANGRY NOW,,,,just wait until they try a brokered convention!! It will be mayhem. The LAST NAIL in the coffin of the Republican Party!! You can take THAT TO THE BANK.","post_message":"A brokered convention seems to be all the talk in the Republican party right now, but there's a real split in who's supportive of the idea... Do you think Ted Cruz is right about this?"},{"comment_id":"1826661334287644","commenter_b":"These two comments made me laugh out loud!","commenter_a":"I didn't see Elizabeth Warren in there...","post_message":"Can you imagine seeing this in the distance? Unbelievable..."},{"comment_id":"10153243300499087","commenter_b":"She's a flaming idiot","commenter_a":"She is one sick BITCH !!!!","post_message":"\"I am a devout, practicing Catholic. I’m a mother of five children. When my baby was born, my fifth child, my oldest was six. I think I know more about this subject than you, with all due respect,\" Nancy Pelosi told a CNS News reporter. WATCH:"},{"comment_id":"919474584812263","commenter_b":"She's in the white one percent of income earners selling darkness for light, propaganda and bullshit spewing pays well in America, the scary black men are race baiting ha","commenter_a":"To paraphrase the great Nelson Mandela: \"We are not less life loving than you are.\"","post_message":"Why didn't she have the same concerns about American Sniper?"},{"comment_id":"10153545304972452","commenter_b":"Happy mothers day mom, have a cheeseburger, see ya later!","commenter_a":"was it on a friday ?","post_message":"When they both went for the cheeseburger, investigators said Benjamin Middendorf had enough and shot his brother."}]
