[{"comment_id":"1124522294289594","commenter_b":"Well to be fair, she didn't do a very good job raising you.","commenter_a":"@@username, You watch what you say about my mother you no good peice of garbage!!!!!!!","post_message":"Would you do this if you saw a dog trapped in a hot car? A new Ohio law makes it perfectly legal."},{"comment_id":"10152769166208271","commenter_b":"Tauna Corbin so a dead woman can drive a car?","commenter_a":"She broke the law. She could have KILLED the officer if she ran over him. Its called consequences for YOUR PERSONAL CHOICR.","post_message":"#BREAKING Denver Police Chief Robert White spoke to the public about the shooting Monday that killed a teenage girl in a stolen car. We are updating this report: @webpagelink"},{"comment_id":"961966360614126","commenter_b":"I bet Walt Disney rolled over in his grave whenever he's found out what you become you are such a vulgar I can't even use the time lady because ladies do not act like that but I will come help you pack free of charge I don't care what you have and how many boxes how many trucks I will help free of charge just to get you out. And thank you for the promise","commenter_a":"Good","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"1768583180066710","commenter_b":"suckass","commenter_a":"This man wants to get us another 1.3 trillion up in deficit","post_message":"WATCH LIVE: Donald Trump campaign rally in Waukesha"},{"comment_id":"915117481938364","commenter_b":"One day her money,scheming,and life of cards will come crumbling down in front of the world. How can billy bob clinton show his adulteress face. They are shamefull. And not the only ones. They better get their life righ fir the next.","commenter_a":"yes...why should Hillary get away with what she has done,if it was any of us we would go to prison,so yes send her to prison along with Obama","post_message":"No wonder The Hildebeest hates... The Donald. @webpagelink"},{"comment_id":"10153854087684087","commenter_b":"Bern bitch!","commenter_a":"@username savage lmaoo","post_message":"“Say what you want about Bernie. He doesn't quit. He's in there bitching,\" Donald J. Trump said."},{"comment_id":"10152810811021130","commenter_b":"It absolutely shocks me that this many woman are grossed out by their own bodies. What a shame!","commenter_a":"I'm glad to see this getting publicity. I love my cup and would love to see more acceptance and less \"ewwwwww\" about it. It's great!","post_message":"Menstrual cups could be a great alternative if you don't like tampons or pads."}]
