[{"comment_id":"10152878773282217","commenter_b":"Jeanette is a bit of an obsessed weirdo","commenter_a":"Organised religion is worse than organised crime","post_message":"Why is Magna Carta so important?"},{"comment_id":"1065479603531539","commenter_b":"Only more proof that you can't fix stupid! Who gives a damn what these idiots think? I sure don't.","commenter_a":"To heck with DC's","post_message":"The last time they did this, thousands of their CDs were destroyed..."},{"comment_id":"10153271515149087","commenter_b":"Stfu old bitch","commenter_a":"God help America if Hillary or Sanders ever become president","post_message":"Bernie Sanders is leading Hillary Clinton by a stunning 30 points among voters under 30, according to NBC's first post-debate poll."},{"comment_id":"10153701487053984","commenter_b":"She need to stay out of all business","commenter_a":"tell that ugly monkey to miind her own business","post_message":"Students have been complaining about Michelle O's lunch rules since they were implemented, but now it just got taken to a whole new level... Do you think schools should quit enforcing Michelle Obama's lunch rules?"},{"comment_id":"10153566886509614","commenter_b":"Stupid girls!","commenter_a":"Looks like the liberated those caged pups. :)","post_message":"Two teen girls were caught on surveillance footage stealing two puppies who were still nursing and not yet ready to leave their mother, workers at a pet store in Compton allege. In the video, one girl can be seen leaning over a gate and grabbing a puppy while the other stands by. The alleged theft happened Thursday at Jazmin Pet Supply. this post to alert others. Watch KTLA video here: @webpagelink"},{"comment_id":"10154992177868905","commenter_b":"It really is better to have a world view. Try it some time.","commenter_a":"BBC has really gone down the tubes! Stick with news from your own country and leave ours alone!","post_message":"Watch LIVE: Latest Trump news, talking deportation and anti-Semitism. Get your questions to us in the comments section..."},{"comment_id":"10154249857386770","commenter_b":"STOP.","commenter_a":"OMG.seriously..and down the toliet bowl we go.swirl, swirl","post_message":"Police officers in a Massachusetts town are no longer allowed to give kids high fives as they enter their elementary school because it reportedly makes illegal immigrants and minority students feel uncomfortable."}]
