[{"comment_id":"10154984816883797","commenter_b":"I hope this women knows that dying is the easy way out that she is not going to get.","commenter_a":"I utterly despise anyone who would harm and even go so far as to kill a child, ESPECIALLY the parent of the children.","post_message":"BREAKING: A statewide Amber Alert in Indiana has been canceled after a 7-year-old girl and 6-year-old boy were found dead Monday."},{"comment_id":"10153333368109705","commenter_b":"Maybe more like 12, but the whole \"space age\" thing they started with \"i\" everything is tired. Heck, even their naming scheme. About the only difference today is they do most things in aluminum instead of white plastic, but it still has the same design queues. But who can blame them? When you have so many people branded to buy your products without blinking, change would be scary.","commenter_a":"Let's hope so. Apples design has been stale & stagnant for the last 15 years. For a company who is lauded for it's design, I can't believe It's gone this long without some fresh blood or new design ideas.","post_message":"Jony Ive just got promoted to Apple's C-suite. Here's why it might be his first step toward the exit door."},{"comment_id":"659146920942553","commenter_b":"Muslim terrorist","commenter_a":"YOU BET I AM!","post_message":"Members of ISIS are disguising themselves as refugees so that they can funnel into Europe. Terrorists have breached European borders, things are about to elevate. Are you worried Obama will let terrorists into our country?"},{"comment_id":"10154005218489749","commenter_b":"@username fool","commenter_a":"Galloway is a racist..anti-semite...he needs to be thrown out of any meeting of decent minds.","post_message":"\"This has ruined this evening, as far as I am concerned, it's disgusting,\" one angry attendee said."},{"comment_id":"10155045059411037","commenter_b":"NO!!!!!!!!!!!!!","commenter_a":"O come on!! Not her too!!!!","post_message":"Carrie Fisher died Tuesday, and Debbie has been distraught since Carrie's emergency on Friday."},{"comment_id":"10153941213411162","commenter_b":"Lacey why are women lazy for not changing their last name? You should speak for yourself only.","commenter_a":"isnt her name Erica Crosby.. ijs.., she was his wife.... right","post_message":"HUSBAND PLEADS GUILTY: Kyle Crosby, 29, has pleaded guilty to murdering his wife who went missing on New Year Eve, 2014. Erica Crippen body was found March 17. As part of a plea deal, charges against Crosby mother have been dropped. FULL STORY: @webpagelink"},{"comment_id":"1207405515987329","commenter_b":"HappyBirthday, Sir, \"It's one more candle and a trip around the sun\" !","commenter_a":"Happy Birthday Dr. Carson!!!","post_message":"#keepcalm"}]
