[{"comment_id":"730165010456352","commenter_b":"@username I love women who are well read xxx","commenter_a":"Is price to paid, for this people, crazy,terrorist! ! I don't blame cpd.just keep us safe!!","post_message":"One minute a Chicago Muslim woman was running to catch her train. The next, she was tackled by Chicago police, and it didn't end there. Itemad \"Angel\" ALmatar said she faced more humiliation at the hands of police before being arrested."},{"comment_id":"10153458308386336","commenter_b":"He'll build housing for the illegals on it.","commenter_a":"this man should be named adolph hitler.","post_message":"Despite Republican resistance, Pres. Obama announced the creation of three national monuments, encompassing more than a million acres of protected sites in Nevada, Texas and California."},{"comment_id":"10154408917183797","commenter_b":"How big is that wall going to be? Lol","commenter_a":"This is why I can't wait for Trump being elected and building a giant wall!!!","post_message":"FLIGHTS TO CUBA: U.S. officials say the United States and Cuba will sign an agreement next week to restart commercial air traffic for the first time in five decades."},{"comment_id":"623778954497467","commenter_b":"Hoes fuck over A by picking B. Once B fucks over the woman, woman tries to go for A to save face... but A ain't having that shit and tells her to go fuck herself sideways.","commenter_a":"I believe A is from the Amazing Spiderman...","post_message":"A or B? #WSHH"},{"comment_id":"1184927621535157","commenter_b":"Obama is an IDIOT! \"Yeah we have Muslim terrorist in this country so now take all the gun away from all the other CITIZENS!\" NO! IMPEACH THIS IDIOT!","commenter_a":"Now you watch yesterday's massacre was intentional. The went to Syria so guess what Obama you ass hole your climate control and gun control is bullshit. Prayers for the Families.","post_message":"Obama responds to the shooting by tightening gun control laws. This is unbelievable. Is Obama incompetent, or just intentionally trying to ruin America?"},{"comment_id":"10154752862228941","commenter_b":"No Weapon formed against us shall prosper...witches have absolutely no power over men of God","commenter_a":"These people are not REAL witches. They do not know what they are doing and only will cause harm to themselves. Real witches look to help and heal. What they put out comes back three fold. These people are just plain evil and should not be considered as witches.","post_message":"The forms of protests against President Donald J. Trump are just getting weirder and weirder..."},{"comment_id":"10152912675916051","commenter_b":"smith you ain't a pimple on my ass. Your pissed because everything I said is true. And I hope you need a cop and they make a stop on the way. Your not in my tax bracket, you don't have any skills ( unless having the government feed and house your little bastards ). All you good at is living off other people and their money. Your nothing but a waste of skin. Get a life and a job. Your the POS loser. And I can see you never served your country either, have you bitch?","commenter_a":"They said they filmed it. Were the hell is the rest of the film. It's funny they only show the cop saying something. What was said and what happened up to that time????","post_message":"When the guy in the car asked why he was being arrested, the officer didn't miss a beat: \"Because I feel like arresting you.\""}]
