[{"comment_id":"1322851284474589","commenter_b":"Or help take care of them in Forster Care?","commenter_a":"Not realistic, there are many people looking to adopt. The murdering of unborn children is not justifiable.","post_message":"Accurate."},{"comment_id":"882454405123315","commenter_b":"Divide and conquer Michelle. This is proof that you and your husband have sent this country back to a time of racial unrest and inequality like never before. I pray our country will soon be able to start healing and undue the damage you two have caused. In 18 more months, we'll be free of this kind of leadership","commenter_a":"She just proved racism towards the whites with every word spoken","post_message":"Michelle Obama is an embarrassment to America. We're ashamed to have her in the White House! WATCH what she just said..."},{"comment_id":"905767619489994","commenter_b":"Yeah...I gotta BITCH with a BITCH that like BITCHES!!! LMAO 😂 😂 😂","commenter_a":"@username @username lmao I'm dead 😂😂💀 the comments","post_message":"When your ex asks about getting back together"},{"comment_id":"10153561426376135","commenter_b":"we know this lady is","commenter_a":"Why would I answer those stupid questions to see this story? WXYZ are you crazy?","post_message":"In 2015, in Troy, she was charged with assault and battery. She later pled to disorderly person and, two weeks ago, she was ordered to pay a $500 fine and attend anger management."},{"comment_id":"905819366142682","commenter_b":"@username if u want to have sex, pay for your birth control. If u don't want to take the chance on getting pregnant, keep your legs together. We should not have to pay for your wants or needs.","commenter_a":"Blunt doesn't think women should have access to birth control and then blocks them from getting an abortion for an unwanted and unplanned for pregnancy.","post_message":"Every day, families in Missouri and nationwide provide loving and safe homes to children in need through adoption. I’m proud to serve as the co-chair of the bipartisan Congressional Coalition on Adoption, and I’ll continue my efforts to help children in need."},{"comment_id":"891529944370915","commenter_b":"Yes I'm still for Trump! Put this women in prison. Stupid Women Lost & she conceded.","commenter_a":"Yes","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"10154064486021509","commenter_b":"Sure they alienate all woman","commenter_a":"A lot of you folks are so quick to follow the narrative. There has not been a debate in years. Just mud slinging and popularity contests. One thing is true though, the only thing the Clintons should be doing is life in prison. What a dirty dirty dirty duo.","post_message":"Could the GOP's opposition to Planned Parenthood at the #CNNDebate be a general-election vulnerability? Hillary Clinton's top aides seem to think so: @webpagelink"}]
