[{"comment_id":"10152879384712894","commenter_b":"She's stupid what more do you expect","commenter_a":"This heifer is trying to get a job...nonsense!!!","post_message":"Raven-Symone Doesn’t Think Harriet Tubman Should Be on the $20 Bill [Video]"},{"comment_id":"10154616109355575","commenter_b":"THEY DON'T NEED A TAX BREAK. JUST TAX THEM COMING IN.","commenter_a":"Do it Donald, show all these NaySayers it can be done, save our Jobs, put America back to work.","post_message":"Trump doing more before he's President than Obama did in 8 years!"},{"comment_id":"930466986973481","commenter_b":"I believe that the Goverment ( teachers ) should mind their own and stay out of our lives and work on being a better teacher ! It's up to the parent to decide when it is appropriate time to educate the child . Teaching a child inappropriate touching is about the limit that the school should be doing . Nothing else !","commenter_a":"Just be open and honest with your kids about sex. Answer questions, create an environment that allows for discussion and be open minded when they tell you what they think. It's not a bad subject. It's part of life.","post_message":"Would you call this educational plan \"age-inappropriate\"?"},{"comment_id":"1393410924025989","commenter_b":"Sam","commenter_a":"They should name the chicks Liberty and Freedom","post_message":"HATCH WATCH CONTINUES: Eagle parents Harriet and M15 have taken turns incubating two eggs. We could have an eaglet hatchling soon. (Video courtesy of Dick Pritchett Real Estate) @webpagelink"},{"comment_id":"10153038783201717","commenter_b":"She is absolutely ridiculous","commenter_a":"Dude she had how many warnings to do her job and she refused? Did the judge think that putting her in jail then taking her out would scare her into doing her job now? I highly doubt she's gonna get out and be like \"oh yea imma start issuing out these licenses now, even tho its against my religious beliefs\" pffft fat chance.. -_- I'm so sick of this bitch","post_message":""},{"comment_id":"10153834090031336","commenter_b":"The true face of Islam! This is what the Quran says about non Muslims! Quran 2:191 Slay the unbelievers wherever you find them; qurann:3:28 Muslims must not take the infidels as friends; quran 3:85 Any relegion other than Islam is not accepteble; quran 8:12 Maim and crucify the infidels idf they criticize Islam; quran: 8:12 Terrorize and behead those who believe in scriptures other than the Qur'an; qurann 8:60 Muslims must master all weapons to terrorize the infidels; quran 8:65 The unbelievers are stupid; urge the Muslims to fight them; quran: When oppertunity arises kill the infidels wherever you find them; quran 9:30 the jews and Christians are perverts. Quran 9:123 make war on the infidels living in your neighborhood; quran 22:19 Punish the unbelievers with garments of fire, hooked iron rods, boiling water, melt their skin and bellies; quran 47:4 Do not hanker for peace with the infidels, behead ...","commenter_a":"Hey Obama keep bringing your Muslim brothers here in America so we can have the same thing done here at home! (The Syrian refugees mixed in with the terrorists) RIP to the innocent souls","post_message":"Breaking News Update: At least 100 people have reportedly been killed inside the Bataclan concert hall in Paris. @webpagelink"},{"comment_id":"1189206507769062","commenter_b":"Because white motherfuckers like you","commenter_a":"If black lives do matter....., then ask me this then and give an honest answer...., why have they not stopped selling illegal controlled substance off the streets? Why have they not make their community better for everyone? When was the last time they bring something positive to the community? Why can they not stop shooting each other for the upmost stupidest reason? When was the last time anyone was able to think for themselves and not allow the social media or the government telling them how to think? Why do they pull the race card whenever they get caught up in a felony offense and not man the hell up? Graduate from High school and get a career.","post_message":"#BlackLivesMatter were not happy with this speech"}]
