[{"comment_id":"10153206229641336","commenter_b":"You Carol, are a Goddess if you can swallow that orange whole! Puh-tow!","commenter_a":"Great. We need someone like him. He gets my vote.","post_message":"Vermont Senator Bernie Sanders is set to announce his decision to run for the Democratic nomination for the presidency as soon as Thursday, according to multiple reports. @webpagelink"},{"comment_id":"1247749101912765","commenter_b":"It's so well done!","commenter_a":"@username Martha Elizabeth","post_message":"Periodic pumpkins!"},{"comment_id":"1162022200542981","commenter_b":"Hillary Clinton's response would be \"What difference - at this point, what difference does it make?\" The crooked bitch would lie about it anyway!","commenter_a":"You don't know what he was doing!! Why did trump tell you ?","post_message":"Wow. A major discovery about the EgyptAir pilot was just made, and it could change everything. It's been revealed that he was doing something surprising before the plane went down, and it could explain a lot..."},{"comment_id":"1765463453479427","commenter_b":"Tell that to these women. @webpagelink","commenter_a":"Hey! if their good their good why not if that's what they want to do! and pass all the ground's for being able to handle it!","post_message":""},{"comment_id":"10153188794046680","commenter_b":"And @username get that male organ out of your mouth.","commenter_a":"@username just how would have more gun control laws have prevented this last shooting? California has already the most stringent gun control laws on the books.","post_message":"A day after the shooting massacre in California, Republican presidential contenders were utterly unapologetic about their opposition to new gun-control laws."},{"comment_id":"482004281990152","commenter_b":"Muslims are breaking our laws. Take down the sign and let muslims know that we have our own laws and as Americans we do not recognize sharia law.","commenter_a":"Shoot them all..","post_message":"First our schools, then our public areas, what's next? 'SHARE' this post, we have to let the nation know what the MSM won't. Do you agree Shariah must be stopped?"},{"comment_id":"739571439509370","commenter_b":"Suzette, no, she doesn't. She just encourages them to get abortions so they can go back to their life and most likely get pregnant again.","commenter_a":"So here's an actual SOLUTION for all the pro-life people... Rather then protest, why don't you offer to help those poor, confused girls seeking an abortion? Perhaps these women feel they have no other option. So why don't you offer to help them out, since you love babies so much? Offer to take these girls in & give them an alternative, especially since a lot of them fear that their family is going to shun them due you to this unplanned pregnancy. Then, pay for all of their medical bills for all the doctor visits they'll need, including the hospital birth. Then, while the mother recovers at YOUR house, you can raise the baby you desperately wanted to save when she leaves to go on with the life that she wanted to live. I think that would work. Why don't all you pro-life people go and do that? Oh wait, ...","post_message":"Planned Parenthood doesn't want anyone to know this? Then spread this EVERYWHERE!"}]
