[{"comment_id":"10154042161636910","commenter_b":"USA Vets, homeless, the disabled! All of our own meaning legal USA citizens need to be taken care of FIRST. That's what we pay into. Get rid of who is faking it also.","commenter_a":"9th Circuit Court of Appeals issued a decision backing an earlier decision by a federal district court judge in Washington State that put President Trump national security Executive order affecting seven countries that harbor terrorists on hold. Activist Judges intruded into areas reserved by the Constitution powers which unambiguously gives constitutional powers to the President. That is why the 9th Circuit ruling is so fundamentally wrong by assuming the power of the President. It is the 9th Circuit that violated the Constitution under the Separation of Powers with its ruling. The fact is that President Trump clearly has the constitutional and statutory authority to issue this order. It is clear: radical Islamic terrorists are at war with America. President Trump order is a proper and constitutional way to protect America. Again, the directives contained in the President Executive Order are closely tethered to discretionary powers vested in the Executive Branch ...","post_message":"A MAJOR SETBACK FOR PRESIDENT TRUMP: The 9TH Circuit Court of Appeals has ruled unanimously against reinstating Trump's travel ban. Do you agree with the ruling? @webpagelink"},{"comment_id":"10154898631786729","commenter_b":"But at least she was honest enough to release her tax returns,something that Trump still hasnt done.What damning information is Trump hiding in those returns?Has it to do with his business dealings with the Russian oligarchs.","commenter_a":"The old switch a roo...creative tax scheme?","post_message":"Something's rotten all right..."},{"comment_id":"10153733743438606","commenter_b":"Human nature wants us to create Heaven on Earth where everything is perfect and explained (No disasters, illnesses, wars, and sadness). That's exactly WHY people are sad and sick and at war. They can't reconcile it. I have no clue why bad things happen. But I do have my faith in God. I wouldn't dismiss for a moment why you feel your way. I hope you won't dismiss mine. I just can't see Bill Nye explaining this to me? I sincerely hope you have a great day 🌺","commenter_a":"You figure he wouldn't have orphaned and separated them years ago in the first place then.","post_message":"INCREDIBLE STORY! Two orphaned sisters separated decades ago in Korea have been reunited after miraculously getting hired on the same floor of a Florida hospital ----> @webpagelink"},{"comment_id":"704293576413843","commenter_b":"Can't wait to be done with the racist goat humper","commenter_a":"Yay for Trump!!! Bye bye Obama!","post_message":"LIVE VOTE: With Trump taking office, are you grieving or cheering? Let us know why in the comments and see what others think. Join us for continuing coverage as President-elect Donald Trump prepares to take office, straight ahead on The Four!"},{"comment_id":"10153782670984838","commenter_b":"Then why are they acting like children when they run around sleeping with random people getting pregnant when they don't want a baby in the first place? So yes those women are children since they don't know how to have safe sex.","commenter_a":"Absolutely ridiculous!! Women are not children.","post_message":"A bill that would impose a 24-hour waiting period on women seeking an abortion is headed to Republican Gov. Rick Scott."},{"comment_id":"1047357948654067","commenter_b":"Hopefully your girls won't grow up to be ignorant fools like you.","commenter_a":"While watching this video my four year old daughter asked, \"Who is that?\" I answered, \"@username, hopefully the first woman president.\" To that she replied, \"I love her. She's beautiful. I like her necklace.\" Can't wait for you to shatter that glass ceiling for my girls!","post_message":"An expectant mother in Iowa asked: What are your plans for parental and maternity leave?"},{"comment_id":"10150959655894999","commenter_b":"f you want a president that - Is a dictator above the law criminal who controls the brainwashing media and FBI Starts a war with Russia, China, Syria because they're not part of NEW WORLD ORDER - Can't be trusted to protect the security of our nations borders, classified information, or lives of our ambassadors and spies - Opens door to Jihad Terrorism and rape culture while our veterans sleep in the streets - Take away your right to protect yourself with a gun from her Isis soldiers she and HUSSIEN created and brought in. - Sells your country to your enemies and gives your enemies nukes - Raise taxes and enslave us while paying our enemies billions - Steals from her charity - \"Loses\" 6 billion of your hard earned taxes money - Defends rapists and bullies the victims - Brainwashes her followers to attack \"deplorables\" and starts fights ...","commenter_a":"I hope you guys will vote for Jill...","post_message":"Our photographers are sharing Election Day scenes from Manhattan, Miami and polling sites across the country. Follow along here: instagram.com/nytimes"}]
