[{"comment_id":"10155910750959062","commenter_b":"She should have thought about her baby before she decided to become a thief! Do the crime do the time!!! She got caught and now she's worried about her baby! Should have been worried before doing the crime! Baby is being raised by a habitual, especially if she can't act straight while pregnant","commenter_a":"She was sentenced 14 days and is getting them 3 for 1 that's 5 days people. If she were male and not pregnant she would have been ordered six months. Being pregnant isn't a get out of jail free card.","post_message":"Right or wrong?"},{"comment_id":"10153552144846636","commenter_b":"Wow.. boo hoo. There's no \"controversy.\" Just a few crybaby parents who probably don't like soccer. This team is generating money in the Yukon community and also generating money for the school during a time of need. People should be thankful, not critical. This team isn't cutting into the school budget in any way, chill out.","commenter_a":"KFOR you need to get rid of the pop up ads your page uses!! Can't read a complete story or watch a video without getting a redirect to somewhere else. You are the only news station page there are issues with!","post_message":"\"By no means was it ever intended to say hey this is ours now.\""},{"comment_id":"10153790561559407","commenter_b":"Eco tourism is the answer to the local economy of these communities, not hunting animals into extinction. Man has done enough damage to Africa. The west needs to stick it's hand in its pocket and spend the money to educate them and show them how to diversify their economy so they don't need to rely on sports hunting. It's not sport to hunt and kill these beautiful animals.","commenter_a":"The UN should encourage all nations to make it illegal for their citizens to go to Africa and hunt the Lion or any other African wildlife.","post_message":"A small victory for the king of beasts:"},{"comment_id":"968868466550965","commenter_b":"Let's leave tomorrow!","commenter_a":"How do we get his life @username","post_message":"Can we apply?"},{"comment_id":"1008136642595139","commenter_b":"Not hardly! Idol contestants bring all they've got and lay it all on the line. \"What you see and hear IS what you get\", so that makes it easy to vote for the best. Presidential Candidates. ...... What you see and hear isn't always what you get which makes it very difficult to vote for the better of all the evils.","commenter_a":"I think Obama doesn't have a clue. He thinks we live in a world full of unicorns and rainbows","post_message":"In the unexpected opening act, President Barack Obama said he thinks voting for president \"should be almost as easy as voting on 'American Idol.'\" What do you think?"},{"comment_id":"975168282518593","commenter_b":"Better be sure. Our us h hospital are not allowing this.....What. If. Patient wants non Islamic nurse. Because is this practice?","commenter_a":"STOP with the offending of muslims.....this is the United States of America...land of the free.... Who gives a crap if your offended....","post_message":"Whoa!"},{"comment_id":"10152767669722217","commenter_b":"100' wall? It will keep out all the green eyed monsters!","commenter_a":"After the last couple of days, I feel it's time to throw my hat into the political ring. I'm forming a new party. The Free England From London Party. We have one proposal. To turn the M25 into a hundred foot wall and fill it with concrete. I'm not sure how we're gonna pay for it, so we're the same as all the other parties, however, I reckon a few Poles and Kurds will do it quite cheap and we could recycle bits of London to make the wall. Who's with me?","post_message":"Spotted any quirky campaign #GE2015 pics? Share yours in the comment section below or via haveyoursay@bbc.co.uk"}]
