[{"comment_id":"10153576810758984","commenter_b":"Lot of good women out there but she's not one of them!!!","commenter_a":"Hillary is another Obama in a pantsuit. Maybe even worse! PPL didn't listen when Obama was exposed..... Will they listen now about Hillary?????","post_message":"I watched this over and over again to try and figure out what Hillary possibly could have been thinking. I'm still stumped. Like the news anchors reporting on this did, all I could do was laugh... Do you want to see Hillary suffer a resounding loss in 2016?"},{"comment_id":"10153862948491523","commenter_b":"You think women put these objects in themselves? This was a product recommended and approved by from their doctors. STFU","commenter_a":"Stop putting foreign objects in your body!","post_message":"Some of the women experiencing adverse affects from Essure are relieved to get hysterectomies to get the coils out."},{"comment_id":"10153935705086756","commenter_b":"@username And millions of flys eat shit daily.","commenter_a":"I agree with Paul Ryan. I didn't want him to have the job either. Or any other job. Anywhere.","post_message":"Ryan has said at least three times in the past year that he did not want the job. Now it's his."},{"comment_id":"733570513458390","commenter_b":"He wants to deport the Hispanics? We need to deport him with his team to Russia since they don't have anything to offer the nation. At least the Hispanics do all the dirty work in this nation.","commenter_a":"Politicians and Corporate thugs and bloated military spending.","post_message":"They're called politicians. The Mind Unleashed"},{"comment_id":"10153425462103271","commenter_b":"When is she to be put in a mental institution for the rest of her life, if I had a family member killed I would come after her, she is probably in hiding by now. If a woman wants an abortion THAT IS HER RIGHT TO DO SO.","commenter_a":"This is how far out these repubs go to make themselves look good to their GOP base.","post_message":"WEIGH IN: In a Facebook post, JoAnn Windholz calls Planned Parenthood a \"culprit\" and \"the true instigator.\" Read the full statement. Your thoughts?"},{"comment_id":"408303332684881","commenter_b":"Maxine, you don't know much do you. The minorities already have the right to vote. Sorry if they won't let you count the votes that some people made with the names of dead people. Illegal aliens don't have the right to vote, because they are not citizens of the USA.","commenter_a":"As long as the current conservative, sorry ass Republicans are controlling both the House and Senate, there will never be a vote on a new Voting Rights bill!!!:( They are against anything good for minorities, women, seniors, and the working class.","post_message":"On this day in 1965 President Johnson gave his Voting Rights Act Address to Congress. Today, we should DEMAND Congress pass a new Voting Rights Act. Sign this petition if you agree."},{"comment_id":"593869030794976","commenter_b":"#killery #neverforget #emailscandal #saudibribes #womandestroyer #liesthroughherteethwithasmile #corrupt #unfitleader","commenter_a":"Headline reads...CLINTON AND TRUMP UNFIT 2B PRESIDENT","post_message":"It was one of the great body slams of presidential politics. Donald is hurting at this moment."}]
