[{"comment_id":"1068708143222239","commenter_b":"Stupid","commenter_a":"Think of how awesome it would be if our President wasn't the anti christ.","post_message":"Happy Presidents Day. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"465830173607563","commenter_b":"Bossy bitch!","commenter_a":"Just ban Michelle.","post_message":"Should We Ban This Word To Please Michelle? Comment 'yes' or 'no'."},{"comment_id":"10153880836367994","commenter_b":"EXPELL THE HOE S FOR LIFE , LET THEM WORK THE STREETS","commenter_a":"All I got to say is we need to bring back discipline back in the schools I would of never In a million yrs ever thought about hitting a teacher I think these kids need to b put in jail disgusting how these kids are now a day","post_message":"Those who work at Detroit Public Schools say this was \"teacher baiting\" -- and that this isn't the first time they've seen it happen: @webpagelink"},{"comment_id":"10153646192306880","commenter_b":"They like getting in touch with their feminine side. :)","commenter_a":"I have the man color, slate grey.","post_message":"Let's face it, the \"rose gold\" iPhone 6s is pink."},{"comment_id":"991037997658085","commenter_b":"Bitch didn't get cheated, she got outplayed. Sour grapes!","commenter_a":"The American people have had enough I being manipulated by candidates that don't know how to quit when they're beaten. Hey Idon't know where thus 2nd ballot thing comes from but they better knock it off before they a billion pissed off Americans !!","post_message":"CRUZ POACHES NEARLY ALL AZ DELEGATES Jan Brewer: 'I Got Cheated!'..."},{"comment_id":"10154282712736409","commenter_b":"Exactly! We would not have over 8 million illegal immigrants if not for Obama. Now the President that follow him has to figure a way to clean up his mess.","commenter_a":"Irony: everything that Trump is doing, including building a wall, was set in motion by establishment Democrats.","post_message":"Fox thought the border wall reference was \"too controversial to air during the Super Bowl.\""},{"comment_id":"10154137219211323","commenter_b":"Except I don't know any bores.","commenter_a":"How the shallow half lives. My parties are made up of kinder people and we include bores, shy people and those who feel rubbish but know they will be treated with kindness and respect.","post_message":"“They don’t know they’re bores, so they’re happy.\""}]
