[{"comment_id":"1084382244943634","commenter_b":"The below information must get exposed. Hillary wrote a college thesis on Saul Alinsky's book. We have to save America .!! These are facts., Not propaganda Please read and copy paste to pass this on The Cloward-Piven aka \"Coward Proven\" strategy is based on the teachings of Saul Alinsky a communist socialist died about 43 years ago, but his writings have influenced the politicians who control our nation today. Hillary Clinton did a college thesis on his writings and Barack Hussein Obama writes about him in his books. Saul Alinsky Died: June 12, 1972, Carmel-by-the-Sea, Ca Education: University of Chicago Spouse: Irene Alinsky. Books: Rules for Liberal Radicals Reveille for Radicals Anyone think this stuff isn't happening today in the U.S. ? All eight rules are currently in play. There are eight levels of control that must be obtained before you are able to create a Liberal Socialist state. The ...","commenter_a":"These are okay but when will the size and cost of government be SUBSTANTIALLY reduced? When will we secure our borders? When will we un-bridle the economy and the coal industry? When will we adopt the Fair Tax? Stop playing with the small stuff and fix the big issues!","post_message":"Here are 7 bills we recently sent to the president's desk. Every single one is now law. @webpagelink"},{"comment_id":"10153649562025950","commenter_b":"Dan Haggerty could have prob saved both..... but hes dead now. that man loved animals .__.","commenter_a":"It should never even get to the point of having to kill an already endangered animal. The zoo failed this gorilla and the little boy.","post_message":"At one zoo, qualifications include gun-loading skills, twice-annual target-shooting tests and a drill that looks like this:"},{"comment_id":"1133405013362371","commenter_b":"She looks that way from years of only having a tiny withered Cheeto to satisfy her","commenter_a":"Why does every picture of Melanie look constipated or disgusted. Her eyes are always squinted, and her lips are always tight. I mean it is not a happy look. This is not a rant because she is female, and it is not a comment on her worth or attractiveness. It is a comment on how people show expression in their face. She doesn't look happy at all.","post_message":"Could you imagine the right-wing reaction if the Obamas did this?"},{"comment_id":"713883512069088","commenter_b":"@username you don't look old enough to know what that women has been doing for the last 40 years.You better hope she isn't the next President she is going to bring in 65,000 more illegal immigrants so when they molest part of your family and the police can't do anything about it. Because she has tied their hands what are you going to do. Blame someone else like she does.","commenter_a":"Why don't the democrat fools stop beating on Trump all the time , They would love for him to drop out then we would have crooked Hillary running every thing, She will never be my president she is the biggest liar on this earth and the lowest scum on this earth ! !","post_message":"Donald J. Trump's campaign chairman Paul Manafort said the report that the GOP nominee asked about using nuclear weapons in a security briefing is \"absolutely not true.\" @webpagelink"},{"comment_id":"1158047454312031","commenter_b":"STOP THIS IN AMERICA!! Send illegals back! Police those that are here legally. These people want us dead....when did that change, folks????","commenter_a":"If they want to kill off their women and children nothing we can do about that. I have no problems shooting anyone who is coming after me. It's us or them. I say us","post_message":"It's only a matter of time before children will be doing all the dirty work. These monsters MUST be stopped. @webpagelink"},{"comment_id":"642366659287246","commenter_b":"Megan, you do a great job for Fox. They are lucky to have you.","commenter_a":"Fair and Balanced?!?!?","post_message":"Megyn Kelly may be getting kicked off the air... FOX needs our support, let's give it to them. Do you support FOX News?"},{"comment_id":"511283065698315","commenter_b":"But she looks like she has taken lots of dicks in her ass/mouth then made out with you","commenter_a":"But he will walk away with no punishment because USA is Saudi arabias little bitch","post_message":"That's a lot of drugs."}]
