[{"comment_id":"10153851640243984","commenter_b":"Fire that going bitch","commenter_a":"Isaiah 5 : 20 ~ Woe unto them that call evil good, and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter!","post_message":"This young Texan is standing up for her religious beliefs BIG time after her teacher tried to force students to deny that God is real, and threatened them with failing grades if they did not. Do you support this young girl for taking this stand?"},{"comment_id":"10153189013365736","commenter_b":"Please don't insult scum. Scum must be very embarrassed to be compared to HER!","commenter_a":"Of course she did it. Using that poor boys abduction to get her face on T.V. What an evil woman n","post_message":"Kyron Horman's stepmother Terri Horman gives People magazine an exclusive interview about the disappearance in June, 2010 of the 7-year-old."},{"comment_id":"1478284585520531","commenter_b":"@username At least he loves and respects Americans, which clearly you are not....Does not have the blood on his hands like Hillary of 114 people and counting.....Maybe you want him to destroy us, but, when he does you'll be right there with us all...Let all these illegals come live with you!!!","commenter_a":"This has got to stop!!!! Please read the following.. John Miech *Here is something to think about**, and why so many Americans support Donald Trump !!* (This information has all been checked, then double checked... it is 100% Correct.) That's why there is such an alarm within US government, since Trump's statement about temporary suspension of migration of Muslims to US till US authorities make sure there is a proper concept of safe penetration of US territory. People are stunned to learn that the head of the U.S. CIA is a Muslim! Do hope this wakes up some! You mean until it hits you like a ton of bricks read it again, until you understand! We now have a Muslim government. @username, current head of the CIA converted to Islam while stationed in Saudi Arabia. Obama's top adviser, Valerie Jarrett, is a Muslim who was born in Iran where her ...","post_message":"Do you know what the actual percentage of money the Clinton Foundation has raised that they donate so far to charity is? It's like 5%."},{"comment_id":"629803473847253","commenter_b":"she is a bitch to treat that young woman like that","commenter_a":"What a bitch!","post_message":"MUST WATCH: Hillary doesn't like being challenged by black woman. Welcome to the DEMOCRAT plantation."},{"comment_id":"904059146360453","commenter_b":"She is earning her check! hahahahha WTF! I just can't with this crazy woman!","commenter_a":"Maybe she's trying to help Hilary??","post_message":"Donald J. Trump campaign manager Kellyanne Conway said she wished her candidate had more opportunities to debate and would \"be willing to do another one if somehow they can squeeze it in.\""},{"comment_id":"1397503370290352","commenter_b":"Shellie","commenter_a":"Hahahaha fool","post_message":"Absolutely Hilarious... Spread this everywhere!"},{"comment_id":"1727453857514316","commenter_b":"@username,just like your husbands grandparents came in the 30s,my grandparents also came here but in1907 and came threw Eli's Island LEGALLY which was harder to do in 1907 ..so there is no excuse for some coming here illegally today,none what so ever!!","commenter_a":"Trump wants illegals gone and so do I. My dad came to this country legally and at age 65 is still going strong. My brothers are so fortunate and blessed that my parents have given us this opportunity to make something out of ourselves. Seeing illegals demand stuff and act like they deserve things we Americans worked hard for burns me up inside. Illegals have no rights to anything and should be deported and forced to go through legal channels to attain citizenship like other immigrants. We need a wall or a stronger more secure border and absolutely no amnesty for these criminals","post_message":"\"Donald Trump is not a racist.\" Today, in front of Trump Tower, Donald J. Trump supporter Pastor Mark Burns fought back after an illegal immigrant activist tried to shout him down."}]
