[{"comment_id":"10154528365584342","commenter_b":"@username. Kim kardashian has done nothing in her life compared to Trump. Except suck like 10 ninjas dikks.","commenter_a":"Haha, once again ch. 13 is being biased. Haven't y'all seen all the libtards going unhinged on social media. Or commie elected democrat officials too. Democrats are the ones talking non stop about the results of the election. And calling president elect Trump not their president. Now that's un-American and petty.","post_message":"One expert blames it on Trump's insecurity from losing the popular vote. Others say it's just Trump being Trump."},{"comment_id":"10153728879938701","commenter_b":"Ugh, that's her opinion.....she is free to say it.","commenter_a":"President Obama please stay in DC.. We do not want to hear about your stupid gun control. You are NOT welcome in Oregon. You only care about One thing and that's you.","post_message":"JUST IN: President Obama will meet privately with the families of Umpqua Community College shooting victims on Friday."},{"comment_id":"1255087781177916","commenter_b":"Get on your knees and suck my big fat hillbilly cock. Lol ....","commenter_a":"Republicans deserve a President Cruz who gets his condoms from dive bar bathroom dispensers.","post_message":"It's not who the party's establishment thinks."},{"comment_id":"1496723690352634","commenter_b":"@username he must have grabbed you by the pussy.","commenter_a":"Same day, taken moments earlier before the rain actually stopped.... Trump holding the umbrella for her, meanwhile Obama has someone else holding it.... just saying maybe look into it before looking so biased","post_message":"See the difference?"},{"comment_id":"10155345287068132","commenter_b":"She needs to save her nekkidness for JZ.","commenter_a":"Wierdo & shes so over rated meh","post_message":"We're still not over Beyonce's performance! Join us in the comments to let us know what you thought."},{"comment_id":"10154700417126323","commenter_b":" This is why women worldwide have body issues. Because nasty bitches like this one feel it is their duty to mock and body shame. Well shame on her for bringing the world down a notch in my estimation...","commenter_a":"'It's not the person I am' well it is love because you took the picture and posted it. Goes to show beautiful on the outside not at all on the inside.","post_message":"A Playboy model who used social media to body shame a 70-year-old woman at her gym was charged with invasion of privacy by the Los Angeles city prosecutor on Friday."},{"comment_id":"10154011043376615","commenter_b":"@username fighting for these POS muslims till the end. Listen hag, why dont you leave for Somalia and see how that works out 4 you. Liberal hag!!!!","commenter_a":"The hate and racism on here is disgusting! Most of you don't even know what's happened, you're just ready to jump in with your white supremacist rhetoric. Makes me sick.","post_message":"WATCH LIVE: Officials are providing an update on the victims in the attack at The Ohio State University. WPXI Aaron Martin is in Columbus and will have the latest developments on Channel 11 News at 5:00. MORE DETAILS: on.wpxi.com/OSUAttack"}]
