[{"comment_id":"10155119252083690","commenter_b":"@username U r a horrible women ur all posts r anti Islamic. ...shame on u..","commenter_a":"Correction: Racism sparks anger towards dude getting on with his life.","post_message":"A British boxing star has stirred far-right anger after posting a picture of himself taking part in Muslim prayers at a mosque in the UAE."},{"comment_id":"10154173554642061","commenter_b":"We are all called on to help our fellow man","commenter_a":"Nice guy!!!","post_message":"School bus driver, who is a U.S. Army veteran, noticed one of his students was crying when he boarded the bus, so he bought 10 sets of gloves and hats for that boy and other kids in need. \"No one wants a kid to suffer like that.\" @webpagelink"},{"comment_id":"782624725204041","commenter_b":"SJ Shang dumbshit, the topic is how the allegedly peace-loving Muslims treat their kids. We have enough problems with idiots shooting each other in the US, we don't need more sand monkeys doing the same, whats so hard to understand about that? But you want to digress, fine. Americans desperately want to have dope legalized, to make themselves feel good. 80% of Americans are overweight, because they are lazy, they love to pop and abuse prescription pills and illegal drugs. They don't drink and drive responsibly, insist on texting while driving and play Candy Crush on the job. They refuse to live within their means, balance a checkbook. The last thing they need is one more useless addiction, and yet they whine and yammer about their right to be high .\"Dope fixes everything. If we smoked dope nobody would die from cancer anymore\"","commenter_a":"But we don't want Obama to address white Christian American murderers of children here because he might take our guns. Seems legit.","post_message":"I want a REAL president to step in and take these bastards out once and for all..."},{"comment_id":"10153488237764087","commenter_b":"Her looks are irrelevant to the fact that Trump is a punk ass bitch and his supporters leave slime trails.","commenter_a":"I have a challenge for Megyn. How about she show up at the debate wearing ZERO MAKEUP, so she shows her true self and not the all painted up deceptive image of who Megyn Kelly really is. Come on Megyn, quit hiding behind that makeup paint.","post_message":"\"As I've said before, I would rather set myself on fire in front of the Fox News studio than go on the debate stage with [Megyn Kelly],\" Morning Joe's Joe Scarborough said."},{"comment_id":"1198972140162838","commenter_b":"Well you sure have a funny way of showing your best wishes for our country yourng woman. Respect is due any President, First Lady, VP and his wife. I hope you have learned from the experience.","commenter_a":"Yeah!!!! Why not you leave too. I can do your job! You do that about obama and tell me what happens!","post_message":"Gigi Hadid says her impression of soon-to-be First Lady Melania Trump at the American Music Awards was \"done in good humor.\" @webpagelink"},{"comment_id":"10154054920697093","commenter_b":"Just let this crazy lady live in her imaginary world.","commenter_a":"I feel the closet racists gathering on this post.","post_message":"Small protest happening now at the old Tarrant County Courthouse in response to the Fort Worth viral video arrest. bit.ly/2hYduuA"},{"comment_id":"1368750766478283","commenter_b":"She was with a child!","commenter_a":"This women is a stupid and ignorant person I hope there were no kids around that can very easily copy this stupid act","post_message":"Toronto Zoo officials said the apparent retrieval of a hat was \"a very bad idea\" @webpagelink"}]
