[{"comment_id":"10153829550465575","commenter_b":"Go home Cruz we want trump !","commenter_a":"Trump is a strong supporter of the Second Amendment! This post is another poor attempt to win votes for Cruz. If Killery or Bernie win the Second Amendment is in trouble as will be the first. I am sure the Feds are wanting to shut the internet down so we can't inform each other on what they are up too. Lets face it! The internet has shown America how corrupt our Government has become. Without it we would never have known.","post_message":"These are the lies that TRUMP is referring to. . . ."},{"comment_id":"1224318647634888","commenter_b":"@username BUILD THE WALL PUSSY. BYE BYE.","commenter_a":"LOL AYEEEEE","post_message":"Aren't teachers suppose to be the example? #WSHH"},{"comment_id":"10154936291493088","commenter_b":"> I don't know why it's impossible to believe it will happen again. Shane Those that are better informed than you are agreeing on this, big time, using measurements, not belief. You can't use your logic&belief on things that have happened over millions of years with this, that has happened over a range of 50 years. Keep reading up on this because you're getting very close.","commenter_a":"While I won't support any of Donald's nominations, I think climate change has always been around, long long before humans. And much longer still before the industrial era. The earth has been a waste land before, and it's also been a water world. I don't know why it's impossible to believe it will happen again.","post_message":"I will vote NO on the nominations of Scott Pruitt to be EPA Administrator and Rick Perry to be Secretary of Energy. The scientific community is virtually unanimous. Climate change is real, it is caused by human activity and it is already causing devastating problems in this country and around the world. We need an EPA Administrator and a Secretary of Energy who are prepared to stand up to the fossil fuel industry and their short term profits, and lead the fight to transform our energy system away from fossil fuels to energy efficiency and sustainable energies. In discussing these issues with Mr. Pruitt and Mr. Perry I found no evidence to believe that they are prepared to do that."},{"comment_id":"10153648963644203","commenter_b":"I assure you, Hillary has more political experience than ALL the male candidates. Her being female just makes it better. You men who hate powerful females are gonna be maaaaad! lol","commenter_a":"I think so. It's equally difficult to imagine what Hillary Clinton's appeal to anyone, women included, is.","post_message":"\"Being a woman does not give you the right to be the next president. Whether you Carly Fiorina or Hillary Clinton. It going to be your campaign that matters.\""},{"comment_id":"580872065400762","commenter_b":"She is a big mess","commenter_a":"Dress by Radical Christian Dior.","post_message":"LOL! Sorry, but we just couldn't resist... where did Kim Davis think she was going tonight? If she wasn't such a homophobic bigot we'd recommend she go on Queer Eye for the Straight Girl! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"766553903477790","commenter_b":"Obama will call it workplace problems.","commenter_a":"It's not ISIS committing these violent crimes it's the guns, we have to start a war against guns!!!!!","post_message":"Oh my God.....BREAKING NEWS. Share it folks. We need you."},{"comment_id":"10153502208726350","commenter_b":"Too bad they don't pay the woman as much as the men. Men.... 9 million to make it to 16 round. Women.... 2 million for Championship win.","commenter_a":"Congratulations ...Great team","post_message":"\"It was just an epic journey. One we'll never forget.\" - Carli Lloyd to Matt Lauer. #WorldCup #SheBelieves #USWNT Cc: FIFA Women's World Cup"}]
