[{"comment_id":"10153141257132490","commenter_b":"Seems like it's the only thing they are worried about .. LEAVE THEM BE. focus time and energy elsewhere. Geeeeesh!!!!!!","commenter_a":"For god sakes leave the uniforms alone!! They are fine as is.","post_message":"YOUR TAKE: CRACKERJACKS -- It's taken a decade to develop new service dress white and blue uniforms. Do you really need both types of crackerjacks? Send your thoughts to staff writer Mark D. Faram at mfaram@navytimes.com:"},{"comment_id":"10153312996021167","commenter_b":"He has also said that Muslims need to be deported, whether the are American citizens or not. 😖","commenter_a":"Brokaw makes a false comparison. In the 1940's, many Japanese were US citizens, and living here already. Their internment was a knee-jerk reaction to a very real fear that the Empire would try to invade our country with help from loyalists living here. Today, there is no nation threatening invasion, but rather a rogue terror group looking to radicalize ideological adherents within our borders, and inspire them to randomly murder us. Trump has suggested that we not allow any more people from Middle Eastern areas known as incubators for terrorists UNTIL we have much better means of sorting out the radicals from the legitimate refugees.","post_message":"This is one of the most powerful segments we've ever seen. Tom Brokaw compares Donald Trump's call to bar Muslims from America to Japanese internment, Nazi Germany, McCarthyism, and Jim Crow - and he didn't stop there. This amazing video is well worth taking a moment to watch, via NBC News"},{"comment_id":"824242924358757","commenter_b":"You must be an ugly Bastard","commenter_a":"No money no love:)","post_message":"Only A Weak Man Would Make A Woman Love Him And Refuse To Love Her Back"},{"comment_id":"10152896761617293","commenter_b":"and the mob was mad when he called thm out too .... NEXT!! -","commenter_a":"Nothing like calling them as he (and most of the rest of the world) sees 'em!","post_message":"\"Currently, an evil front is being formed against us,\" he said. \"Now the pope has joined this conspiracy.\""},{"comment_id":"809439485771743","commenter_b":"no sh-- sherlock, and obummer is running circles around the media....idiots.","commenter_a":"Andrea you are so astute! That is more than obvious, with that clown Kerry doing the negotiating!","post_message":"We could've told you that, Andrea. #Iran"},{"comment_id":"10153798223993132","commenter_b":"All white women fear intelligent black women!","commenter_a":"Im not at all surprised that a group of loud, obnoxious, self-important women threw a fit. Don't be disrespectful to other passengers, and then demand respect. You're not above others.","post_message":"But it may be too little, too late."},{"comment_id":"536487383205696","commenter_b":"Here's some facts for you Gerry - I NEVER want to be someone's \"arm candy\", I will NEVER marry for money and I don't have relationships with people because of the way they look. I do agree with you when you say we are our worst enemies, but that doesn't give you the right to generalise all women. Unless you're happy to be lumped with the guys that are shallow and only date women with big breasts","commenter_a":"Who the hell cares if she is pregnant? unfortunately women are their own worst enemies, happy to be arm candy of some of the most groteste males alive,providing they are millionaires, fact!","post_message":"Jennifer Anniston has said we’ll be the first to know if she's pregnant. Writing for The Huffington Post, the actor blasted the “sport-like scrutiny” she lives under, saying it’s indicative of society’s warped view of women which sets a dangerous example for girls."}]
