[{"comment_id":"10153352792949203","commenter_b":"Woman hating much","commenter_a":"They are very stupid people who deserve no sympathy. I'll bet drug dealers and mafia members get assaulted too.","post_message":"Porn stars are people too."},{"comment_id":"10153151930717426","commenter_b":"@username there is no double standard. One group enslaved, tortured, raped and brutalized a race, and fought a war to keep their slaves (states rights). And the other called a race that did all the above to them devils. No comparison.","commenter_a":"Who cares about the names of the schools? Does it further rasicsm? No. Are kids being taught rasicsm? No. Anything can be offensive as \"being offended\" is subjective. Will we then denounce anything named after Malcolm X because he was a Muslim who believed that all black people are Gods and the white man is of Satan? Now that's offensive.","post_message":"She argues the name represents a “history of racism.” There are also two local schools named after J.E.B. Stuart as well as other schools named for Confederate leaders. Do you think this will/should change?"},{"comment_id":"882454405123315","commenter_b":"Divide and conquer Michelle. This is proof that you and your husband have sent this country back to a time of racial unrest and inequality like never before. I pray our country will soon be able to start healing and undue the damage you two have caused. In 18 more months, we'll be free of this kind of leadership","commenter_a":"She just proved racism towards the whites with every word spoken","post_message":"Michelle Obama is an embarrassment to America. We're ashamed to have her in the White House! WATCH what she just said..."},{"comment_id":"10154195854358256","commenter_b":"Nice strawman Julia. Careful you don't smoke around that one.","commenter_a":"Palin is as irrelevant on the right as Debra Wasserman Schultz is on the left.","post_message":"Sarah Palin, take a seat."},{"comment_id":"588870771303502","commenter_b":"He should be deported. Hillary should be charged for her recent money scam","commenter_a":"lmmfao","post_message":"Obama is formally being charged with treason. He is getting it from all angles. Now is our time to push. Should Obama serve time for his crimes?"},{"comment_id":"1529265630712432","commenter_b":"This lady is a nut job and probably has some deep issues that she needs to work on.","commenter_a":"#DavePirnerProblems","post_message":"\"You're saying that I can't have a hairstyle because of your culture? Why?\" the man, who is white, says in the video. \"Because it's my culture,\" says the woman, who is black."},{"comment_id":"10156176044470354","commenter_b":"I think the women of the View are ignorant. Their 15 minutes has been up years ago !!!!!!!!!!!!!!!!!","commenter_a":"These women are a bunch of assclowns... They mean nothing and I can't wait for the day they need a nurse then they will be eating their words and asking for your help... SMH...","post_message":"The #NursesUnite movement is mobilizing against liberal co-hosts of \"The View\" Joy Behar and Michelle Collins. But now, new arrogant and elitist behind-the-scenes comments are coming to light and sparking further uproar with nurses across America..."}]
