[{"comment_id":"10153575697359087","commenter_b":"I love American Politics... Hillary Clinton is the People's Champion yet she Support the 1994 Massive Incarceration Bill, the 1996 Welfare Reform that double poverty in America between 1996-2001, 1999 Glass-Steagall Act which caused the 2008 Financial Collapse and NAFTA which as a result 70,000 Factories and millions of Jobs have gone Overseas... But hey she can't be judge on her RECORD because she is a Woman and that would be SEXIST...","commenter_a":"This is a garbage article by not even mentioning Bernie Sanders.","post_message":"\"Donald Trump versus Hillary Clinton in November? Don't bet on it.\""},{"comment_id":"10154330471404087","commenter_b":"....because in a hostile foreign environment you may well have to...I say it's sound advice.","commenter_a":"We will make this World great again!","post_message":"Retired Gen. James “Mad Dog” Mattis once explained his life philosophy to fellow Marines as: “Be polite, be professional, but have a plan to kill everybody you meet.”"},{"comment_id":"10153102018738822","commenter_b":"What is wrong with these women!?","commenter_a":"Dumb fkn bitch","post_message":"A mother has been arrested after she left her baby on the side of the road in Maryland this past weekend."},{"comment_id":"10156358767360354","commenter_b":"Fuck that bitch and his man wife","commenter_a":"So sick of this repulsive little sob, 14 more months of the bastard, damn.","post_message":"“We’re going to be aggressive…”"},{"comment_id":"761137067410204","commenter_b":"Good decision by the judge. This entitled brat needs to make better decisions.","commenter_a":"Just another teenage girl who never got proper parental guidance because the parents were too wrapped up in themselves.","post_message":"Outrage After Judge Orders Bristol Palin To Do THIS With Her Breast Milk This is just ridiculous. A mother should not be subjected to this. Do you agree or disagree with the judge?"},{"comment_id":"880543368756744","commenter_b":"@username ok women let karma take care of me .","commenter_a":"I hope the teen's parents pay for everything for what this family went through. Yes it is the parents fault for not controlling their little shits.","post_message":"The husband of the Ohio woman left brain damaged after teens threw a rock through the windshield of her moving car has committed suicide."},{"comment_id":"1093462474008096","commenter_b":"Yeah, please do?^","commenter_a":"They are more worried about bringing extinct animals but not help animals that are close to extinction. (rhino, tigers, wolf's, ect)","post_message":"Woolly mammoth genome has been decoded."}]
