[{"comment_id":"10152995075029342","commenter_b":"A lot of women think they have to \"eat for two\" which they don't and that gets out of hand.","commenter_a":"People will never be happy. If a woman gains 100 lbs during pregnancy, people will \"OMG THATS SO UNHEALTHY! \" BUT, someone who is healthy and in shape, people are still gonna have a problem with it. What I think it is, alot of women get extremely fat and think it's ok. They use pregnancy as an excuse to over eat. This woman CHOSE to stay fit and there is nothing wrong with that. Kudos to her!","post_message":"Sarah Stage, the internet-famous pregnant model, finally gave birth on Tuesday to an unexpectedly large baby boy:"},{"comment_id":"10153831984088132","commenter_b":"She's ok with adultery too","commenter_a":"A Christian who was married and divorced what? 3 times? Ok. She certainly doesn't have a problem with divorce but has a problem with gay marriage. The problem with so called \"Christians\" these days is there always seems to be a double standard. Sorry but you can't condemn someone who you deem a sinner when you sin yourself. Shame on her.","post_message":"\"Kim Davis should have never been locked-up for being a Christian,\" said Mike Huckabee."},{"comment_id":"1203529499735652","commenter_b":"Shut the fuck up","commenter_a":"I guess none of you that are bashing Trump know enough history to know that China has a pattern of testing US resolve after every election. (usually between feb and march) Trump brilliantly turned the tables on them. It will be even clearer when she visits trump next month. Chinese government has a mouth that writes checks it can't cash and Trump has called their bluff.","post_message":""},{"comment_id":"886212474747508","commenter_b":"she is a trashy shank","commenter_a":"This guy rips her a new one. Good for you.","post_message":"Michelle Obama has no class, and he sets the record straight!"},{"comment_id":"10156422552765354","commenter_b":"Mexcans, niggard and white hoes need a good kick in the ass.","commenter_a":"Unbelievable! ! Round their butts up and get them out!!","post_message":"The group chanted “Let them in, Abbott let them in” and “Governor Abbott shame on you.”"},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."},{"comment_id":"10154752862228941","commenter_b":"No Weapon formed against us shall prosper...witches have absolutely no power over men of God","commenter_a":"These people are not REAL witches. They do not know what they are doing and only will cause harm to themselves. Real witches look to help and heal. What they put out comes back three fold. These people are just plain evil and should not be considered as witches.","post_message":"The forms of protests against President Donald J. Trump are just getting weirder and weirder..."}]
