[{"comment_id":"1370415506308495","commenter_b":"I believe you have that backward.","commenter_a":"They are Demon-crats. Get it right you dirty rat!","post_message":"An activist joins thousands of Bernie Sanders supporters who are demonstrating ahead of the Democratic National Convention in Philadelphia."},{"comment_id":"10153190910859607","commenter_b":"Little a$$wipe","commenter_a":"Uf you don't like what they serve,bring your own.","post_message":"The video of a UConn student berating food service workers who refused to sell him jalapeno-bacon mac and cheese prompted a group of students to start an online fundraiser to give the beleaguered employees a well-deserved night out."},{"comment_id":"636835003152516","commenter_b":"In these cases the police are the terrorists","commenter_a":"Balck white man woman cop civilian.. the real enemy is Terrorism.. and they are using all this crap to keep us from conentrating on them","post_message":"An important conversation for America. President Obama participates in special town hall event on race, justice, and policing. @webpagelink #POTUStownhall"},{"comment_id":"10153227262005667","commenter_b":"@username where do you live? Come on your pry think we don't need crude oil any more either.","commenter_a":"If you think it's cute I will snare one and let you try to pet it. They are vermin and need to be killed or they will take over. Now they just eat your pets, if the numbers get out of control they will come after humans.","post_message":"The animal was spotted entering the baggage claim area and then ran across the ticket check-in area and toward the TSA checkpoint."},{"comment_id":"547324122108733","commenter_b":"Hearing her, and the rest of these contemporary crashing bores, causes me macroaggressions","commenter_a":"This nation no longer understands the cause of anything. We have managed to create a group of retards who are only concerned with their own personal agenda, while at the same time, they have abandoned common sense and common decency...","post_message":"\"One day, these privileged snowflakes armed with their microaggressions will be in charge of HR departments all across the fruited plain,\" says Todd Starnes."},{"comment_id":"10154489000406336","commenter_b":"She shouldn't even be in this election she should be in prison.","commenter_a":"We all have to watch Hillary very closely as she will surely try to rig the general election like she had done during the primaries. What was recently exposed at the DNC she most definitely should be disqualified. Goes to show that the Clintons are corrupt, above the law and play by their own rules.","post_message":"\"I think what I'm offering are proven results. I think what I'm offering is that we can build on where we are.\" On \"Fox News Sunday,\" Hillary Clinton slammed Donald J. Trump, claiming that he has offered nothing to help people, while she has an agenda to increase jobs, increase incomes, and make the economy grow and be more fair. @webpagelink"},{"comment_id":"853194554776798","commenter_b":"all illegals should be hunted down like animals captured and deported","commenter_a":"Send. Them. All. Back. Legal immigration only.","post_message":"\"I know it’s going to pass, and I know we’re going to be protected.” - Camila Trujillo, DREAMer"}]
