[{"comment_id":"10154000125138132","commenter_b":"That woman is a nut!!!","commenter_a":"Hope he doesn't take them on a nice \"trip\" to Monaco like Kelly Rutherford's ex did.","post_message":"Gavin Rossdale has a special Christmas trip planned for his kids!"},{"comment_id":"10154675817978984","commenter_b":"@username, she broke the law dumbass.","commenter_a":"Good for her. We should be thanking her not vilifying her.","post_message":"This presidential candidate was just busted ON CAMERA for doing the unthinkable. Supporters never saw this coming..."},{"comment_id":"1633238976976440","commenter_b":"Debate is good!!! It means they're taking an interest in politics! I don't agree with the shirt but how can you be a 'free country' and yet ban a tshirt ? The teen has a right to free speech","commenter_a":"No keep it on, this is a good learning experience for them to do research and compile facts to rebut the shirt. In fact if she wants to wear that shirt she should have to make a presentation showing fax and citations from non-biased source is why she thinks it's true!","post_message":"The teen said she was asked to take the shirt off after it sparked a debate in class."},{"comment_id":"10153513194301157","commenter_b":"Sorry kill traders Isis is out to kill innocent people that trader should lie down 6 feet under","commenter_a":"13 year veteran, can't trust anyone anymore!","post_message":"A Washington D.C. Metro Transit Police officer has been charged for trying to provide material support to ISIS."},{"comment_id":"10154322509929087","commenter_b":"Truth Hurts huh you little bitch? go whine and cry somewhere else. you sound like a little girl.. Here I'll give you your wubby","commenter_a":"This is the death of the Republican Party written as a victory. The backlash will be fierce and overwhelming if Trump behaves in office as if he has a mandate.","post_message":"#BREAKING: Hillary Clinton 's popular vote lead over Donald J. Trump is now over 2.3 million or 48.1 percent of the vote."},{"comment_id":"10153940111165579","commenter_b":"Any women who can put an unborn baby through a shredder while it's alive....is nasty","commenter_a":"So good to see a man who stays and takes care of his kids. At least he wasn't chasing an intern around the Oval Office right..... Why is it Libs can be so mean to men who stay with their families and give honor to men who not only engage in adulterous affairs but continue to do so. Liberal women are nasty...that is all.","post_message":"Speaker Paul Ryan: \"This was not a job I was looking for or seeking, it kind of sought me. I realized that it was a duty and an obligation. Now realize it's an honor.\" Watch complete press conference here: @webpagelink"},{"comment_id":"10153369790181770","commenter_b":"SHES A WITCH!!!","commenter_a":"hillary is an idiot , how could anyone vote for someone so evil, she has to be stopped","post_message":"Clinton thinks everything is fantastic at the U.S.-Mexico border."}]
