[{"comment_id":"10153507200311336","commenter_b":"Cool end abortion I'll send all the mothers that can't afford to take care of their kids to you.","commenter_a":"Amen! I can't believe people are so desensitized to what is happening all around us. It is our duty as human beings to stand against this, which is actual murder. Abortion is wrong at any point and specifically aborting a baby at 24 weeks, the same time they can live out of the womb is just completely inhumane and murderous.","post_message":"ICYMI: \"Destroying innocent life and harvesting human organs is beyond barbaric -- it is unimaginably immoral, grotesque, and evil,\" writes 2016 presidential contender Gov. Mike Huckabee."},{"comment_id":"851657764869646","commenter_b":"Keep on keeping on...........read the Bible verse EVERY DAY! If the atheists/muslims don't like it then let them leave!!!!!","commenter_a":"good-for-this-principal-","post_message":"YES! This school won't bend to the whims of #atheists! This is how they stuck it to #FFRF:"},{"comment_id":"10153322835227994","commenter_b":"Sounds like something fishy. The devils monster wouldn't kill my kids before me.","commenter_a":"Don't strollers have brakes on the back I don't know this story is impossible to believe","post_message":"So sad. Her 18-month-old twins were killed."},{"comment_id":"10154156171661509","commenter_b":"Who ever used the word 'liberal'? Labels are so 90s. I support Bernie because of his integrity, his consistency and his sincerity. I see none of those qualities in Hillary. I see the opposite in Hillary. I support Bernie because of his policies. Hillary uses too many weasel words when she talks about policy. She likes to leave the door open because she plans to make a hard right as soon as she's elected. She owes too many favors to the banks, corporations and wealthy investors who back her. They need a return on their investment and good ol' Hillary will no doubt deliver the goods.","commenter_a":"The media is dying to have Bush v. Clinton 2.0 so badly but I've never met anyone in person who thinks either of them would make a good president. It's a media manufactured dream match. Both of them would be bad for America but good for ratings. as long As I live I never want to hear the name Bush again and Clinton's got way too much baggage. Policy-wise Hillary is just a kinder face to the same neocon agenda that Bush would be peddling. Sanders is our best hope. Let's stop moving Backwards, let's move forward!","post_message":"Jeb Bush says Hillary Clinton is a \"smart person\" but is \"beatable.\" @webpagelink"},{"comment_id":"1166520376798072","commenter_b":"Grow up you sick witch. Get a life of your own.","commenter_a":"Congratulations men. One psycho off the market.","post_message":"HAHAHAHAHAHA... HAHAHAHAHAHAHAAAA!!! @webpagelink"},{"comment_id":"10157403698925354","commenter_b":"This was a public city pool not a water park","commenter_a":"It happened at a water park here,as well, but never made the news?? What I want to know is how the refugees were able to afford the park. I have passes for my family but it is not cheap.","post_message":"IT'S STARTING. ***Report: Massachusetts Syrian 'Refugee' Swimming Pool Sex Attack of 13-Year-Old Girl***"},{"comment_id":"10154192939617541","commenter_b":"Agree it's the dumbing down of America....","commenter_a":"He's such a child.. name calling , whining and bullying when he doesn't get his way. That behavior is definitely not what we should expect from our president!","post_message":"Trump says \"Pocahontas is now the face of\" the Democratic party."}]
