[{"comment_id":"998167890303719","commenter_b":" y ayuda tmbn a Los autistas","commenter_a":"Diego Alberto Rodriguez Pesaresi @username","post_message":"Marijuana can literally stop a seizure in its tracks. Like ATTN: on Facebook."},{"comment_id":"10153808334131337","commenter_b":"Y should people have to log out of FB cause they don't like her?","commenter_a":"If you don't like her and don't like hearing about her then I don't know keep scrolling, log out of Facebook, go on about your life!","post_message":"Oh, sure, Kim Kardashian West..."},{"comment_id":"10152826278642093","commenter_b":"Oooh sweet Jesus take cover my friends in dat area God bless y'all prayers going yalls way","commenter_a":"Duncanville","post_message":"Tornado Warning for portions of Dallas and Tarrant Counties until 2:45 AM this morning. Tornado is radar indicated near Cockrell Hill moving NW at 35 mph."},{"comment_id":"10153597568671770","commenter_b":"What is different with her from other females?","commenter_a":"Wonder what his wife thinks about that . He just wants attention . Think he is obsessed with Taylor !!!!! Or just trying to piss you off .","post_message":"She is mad..."},{"comment_id":"10156364820535615","commenter_b":"Best liars contest? Hmmm... Now, I'm not saying that he hasn't told his fair share of lies throughout his life. Who hasn't? But, have you heard of a woman named Hillary? She'd have no problems at all winning that contest. Not just winning, but OBLITERATING the competition.","commenter_a":"Glad to see half of Americans are smart enough to realize that. We've come a long way when it comes to equal rights and racism. Let's not go backwards and throw all of that way. Donald Trump is not a good candidate for President !!!","post_message":""},{"comment_id":"998169870194483","commenter_b":"Dicks","commenter_a":"How the hell does anyone defend this crap?","post_message":"Their Orwellian alternative to paid family leave -->"},{"comment_id":"599734130175363","commenter_b":"she is such a idiot","commenter_a":"Repeat a lie long enough and loud enough . . . Welcome to Nazi America, 2015","post_message":"Temper, temper, Carly."}]
