[{"comment_id":"10152582982555950","commenter_b":"Im guessing she's a real bitch...","commenter_a":"he could have just said he wanted a divorce,","post_message":"The man's wife didn't know about or give permission for the demolition, police say."},{"comment_id":"10154674776698010","commenter_b":"I've met a few bitches in my life Derek's mom and @username girl were both on that list.","commenter_a":"Pence basically saying hey I'm a rich white male never get stopped by police why should I care .","post_message":"Gov. Mike Pence spoke about police killings and the need for \"law and order\" at the debate. He ended by asking his opponent, \"Senator, please, enough of this seeking every opportunity to demean law enforcement.\" More debate updates: @webpagelink"},{"comment_id":"1037969679612623","commenter_b":"Preach it brother!! Racial hangups. More racial tension in this nation since the 1960's. that is a fact. Does every speech have to include how everyone use to be slaves, so down trodden and pitiful. I know alot of blacks. They are smart, educated and are not prisoners of the past. We understand history, we know what happened. But my goodness, dont be so beat down by killary. Dont let her use you. After all, she said, \"blacks are predators and she needs to bring them to heel\". So who has racial hangupsI I'll check back for your answer.","commenter_a":"I realize slaves help build the whitehouse. Whtes also helped build the whitehouse. That would have been a good statement. Like, blacks and whites worked together to build the place where our presidents live. It was a joint effort. But as usual, race baiting and on and on about how slaves had to rise up etc... We have had a potus who has made racial tensions the worst they have been since I was a teenager. How is this unity? How have bama and shelly brought unity to our nation? More rioting in the streets more blacks killing each other, our people are fighting and against each other. So much for the legacy of the first black potus. Now they want a woman to be the nxt black potus.","post_message":"Well said, Kelly Clarkson!"},{"comment_id":"1181554231878327","commenter_b":"The Federal government now going to decide about bathroom attendance? Gimme a break and Kill some ISIS and seal the dam borders! North Carolina laws are for North Carolinians! Don't like it than stay out!","commenter_a":"The most ridiculous law ever! Where the F_ _ K to you folks think these HUMAN BEINGS were going to the bathroom before?? Surprise....right next to you and you never knew it! Poor NC....losing all that money and those jobs because of an arrogant Governor who is hardly worth the job that the PEOPLE voted him into!! #LOVEALWAYSWINS","post_message":"It's the federal government being a bully. This unrealistic deadline by the federal government to the ninth largest state is quite amazing.\""},{"comment_id":"10154099893448132","commenter_b":"all she has to do is prove it, Will she?","commenter_a":"This is so pathetic!","post_message":"Donald J. Trump and Megyn Kelly have quite a history."},{"comment_id":"10153499378776051","commenter_b":"all women are crazy","commenter_a":"Dummy. He should have just gone home and find a girlfriend that is not crazy.","post_message":"This man's girlfriend and ex-girlfriend jumped into a river to force him to choose which one he loved more. Well, he made his choice."},{"comment_id":"1210447342329069","commenter_b":"@username you are the brain washes moron if you believe the bs","commenter_a":"Of course republicans are pissed that Obama got those prisoners freed... They wanted those people to be killed thus becoming martyrs so they could use it as another excuse to go to war... And anything positive Obama does deflates their efforts to talk shit and make him look bad...","post_message":"Things just got VERY awkward for Obama's Iran critics."}]
