[{"comment_id":"10155089942751037","commenter_b":"Probably a 1% chance I'm wrong, 99% that go clubbing with mom are losers looking for a free ride!","commenter_a":"They'll all end up as Uneducated Ho's, sitting in the corner of a club by themselves when the looks are gone!","post_message":""},{"comment_id":"10155280506710329","commenter_b":"Things real vaginas eat","commenter_a":"I read that as \"vagina\" and then saw a picture of the cupcake looking thing...didn't think twice until I read the caption again. =)","post_message":"It's tastier than you think it is."},{"comment_id":"10152813699938145","commenter_b":"R u ok, smiling with a chainsaw in your hand.","commenter_a":"I know this guy. He's out of his mind","post_message":"Daytona Beach police are hoping you share this picture. They're looking for Allen Phillip Fike. They say he may be armed with an AK-47 and has threatened to kill officers if they approach. Fike is wanted on several outstanding warrants. He could be driving a white Toyota Camry."},{"comment_id":"1134245933335126","commenter_b":"@username sadly I think in a Trumparchy dipsticks like Susan will become Senators. Oh wait, they already have.","commenter_a":"It looks like your allies have a far more accurate picture of Trump that the American morons who vote for him do. He has made America a great laughing stock around the world. If America is to regain any pride, you MUST DUMP HERR TRUMP.; he is a danger to the whole world. If we could all vote, about 6 Billion people would vote No to Trump..","post_message":"These drawings are PERFECT."},{"comment_id":"10153661151756167","commenter_b":"Ditzy Daisy, throw her out! Keep her coat! Knock the cr*p out of her! Go ahead back to your momma! Drag her outta here! Ditzy Daisy, she's really nuts folks, really nuts. Yep, that's how Drumpf would handle her...","commenter_a":"That goes for all you communists who call us racists and if you spell president trumps name wrong again. The democrats are the party of anti american hate mongering. Now we can sue yo ass.","post_message":"Trump’s plan to “open up our libel laws” is just the beginning."},{"comment_id":"1231833570240008","commenter_b":"We voted for Obama twice now we are racist. A lot of african's and Hispanics voted for Trump. If Hillary would have been a better candidate and visited the states Trump won she would be president.","commenter_a":"And you're saying that the BLM, BLACK PANTHERS are any different. This shows how blind that you are","post_message":"\"These white Americans tuck their heads under cone-shaped hats and American flags ... training their guns on the unarmed, the innocent, the scared ...\""},{"comment_id":"941252249248581","commenter_b":"Oh Bill, you handsome devil...lol, NOT!!!","commenter_a":"It couldn't happen to a more deserving bunch of lying propagandists Hell Bent on fomenting Hate, Racial War & Spewing Male Bovine Feces.","post_message":"Fox News has enlisted two of their biggest twits to play the victim card and accuse Dish Network of censorship as the battle between the two rages on for a fourth straight week."}]
