[{"comment_id":"1157612937618557","commenter_b":"Yes we all should judge illegal immigrants as invaders and depot them! good ppl or not they MUST GO","commenter_a":"Color Blind? All Trump has done in his campaign is judge people by there color and culture.","post_message":"Ivanka Trump on the people her father hires: \"He is color blind and gender neutral.” @webpagelink"},{"comment_id":"1729302324008318","commenter_b":"@username like your sister & her boyfriend helped rape your niece!!!!","commenter_a":"If the kid is dumb enough to Climb into a gorilla pen, and the mother is dumb enough not to pay attention to a kid climbing into a gorilla pen.....then by all means that gorilla should have ripped the little kids head off, at least the gorilla would have had a better reason to get shot and killed","post_message":"After the Cincinnati Zoo gorilla incident, some want a sort of leash law for children. Your thoughts? Via CNN Opinion"},{"comment_id":"508965689228025","commenter_b":"The Dem's blocked Bushes nominations when he still had 18months to go. What goes around comes around. Oh yea, they forgot that fact.","commenter_a":"Eat shit and dye hillary.","post_message":"Agree or disagree?"},{"comment_id":"1095951603760962","commenter_b":"Don't forget her daughter got knocked up","commenter_a":"and her 'classy' son beat up his girlfriend...great family values","post_message":"When it comes to Donald J. Trump, the gloves are off."},{"comment_id":"10153932069946523","commenter_b":"Lana Gonzalez @username I changed it just for you guys feel better now","commenter_a":"This is irrelevant and does not Justify his life being taken !!!","post_message":"Bryan Polcyn - FOX6 Investigators - did a little digging on the criminal past of Sylville Smith. Take a look."},{"comment_id":"10152801044501130","commenter_b":"Mandatory blow jobs. Vomit.","commenter_a":"During womens periods I'm all for mandatory blowjobs and or anal sex","post_message":"The tampon scene, as it’s known, marks an important point in the relationship between Christian Grey and Ana Steele—but it was apparently a little bit too much for an R rating."},{"comment_id":"10155759756435354","commenter_b":"Such a witch. Don't want people saying these things then start arresting and deporting the mexican criminals and all other illegals because they are criminals just by being here.","commenter_a":"How about giving guns to jihadist to fight Syrian Prez. YOU, Clinton, armed ISIS.","post_message":"WATCH Hillary's Race-Baiting Remarks Slamming Donald Trump"}]
