[{"comment_id":"1311876355490031","commenter_b":"These people should be locked up in cages. We have to be a voice for these poor animals. Set them Free!","commenter_a":"China don't care about shit","post_message":"Tourists take selfies with him"},{"comment_id":"915924881775941","commenter_b":"The buildings were resisting arrest, so they were executed!","commenter_a":"Justified. Those buildings and people around were obviously obstructing justice.","post_message":"More trigger happy cops? Time to unarm the cops? What do you think? Via: Police The Police <-- (y) Follow this page!"},{"comment_id":"10153161322294726","commenter_b":"If she moves her lips She is lying","commenter_a":"Think she bad now if she WIN. White house .no stopping HER","post_message":"WATCH: Bombshell Report Clinton Did Use Private Email For State Department Business"},{"comment_id":"743297559178019","commenter_b":"Dumbest fucking answer. Trump met with the black panther party and several top gang members from Chicago to reduce body counts and help fix the black community. Dumb asses mistake for deportation of illegals vs legal immigration. Left supporters are the dumbest people on the planet.","commenter_a":"Good !!! Just makes More room for the REAL PATRIOTS","post_message":"\"I'm not going to the White House. I don't feel accepted in the White House.\""},{"comment_id":"10154346047721336","commenter_b":"The also gave us mass production cigarettes, fast food, obesity, lung cancer and heart disease. Yeah!!!","commenter_a":"Think about the differences in the 18 year old people now-a-days compared to then. Can you see your 16 year old neighbor going to the recruitment office to try to lie about his age to enlist? They're called \"The Greatest Generation\" for a reason. We'd have everyone trying to sue the government for various reasons rather than fighting. It is a different world we live in, with different core values in the newer generations. Even the older generations are wasting their time debating bathroom rights... THESE kids knew what was important, and were willing to give all for their beliefs. I can't salute them enough, or honor them enough, or thank them enough. And having served overseas for the majority of my time in the service, and living in Germany, I was fortunate enough to see just what the older generation of Germans felt for these people who did so ...","post_message":"We remember, and give thanks. #DDay"},{"comment_id":"10150600601724999","commenter_b":"A woman is whatever she wants to be. That's kinda the point of feminism.","commenter_a":"For a group - women - who have been arguing for decades that they shouldn't be reduced to their reproductive organs so they can have more opportunities in life that have NOTHING to do reproduction, it's pretty ironic when those same people say someone can't be a woman because she doesn't have the proper bits or experiences with those bits.","post_message":"People who haven’t lived their whole lives as women shouldn’t get to define us. Read on in The New York Times Opinion."},{"comment_id":"10153648963644203","commenter_b":"I assure you, Hillary has more political experience than ALL the male candidates. Her being female just makes it better. You men who hate powerful females are gonna be maaaaad! lol","commenter_a":"I think so. It's equally difficult to imagine what Hillary Clinton's appeal to anyone, women included, is.","post_message":"\"Being a woman does not give you the right to be the next president. Whether you Carly Fiorina or Hillary Clinton. It going to be your campaign that matters.\""}]
