[{"comment_id":"10154151629042507","commenter_b":"Says the white bitch with a job and a Beamer....Dorothy saloum.....ha-ha!","commenter_a":"Hey @username liberals, Thanksgiving looks like gratitude. It's all about money to you socialists.","post_message":"If you have $50,000 you can join them."},{"comment_id":"10154444925336336","commenter_b":"Hillary supports Islamic terrorist and their right to open borders. Will you continue to support such a wicked evil woman?? Vote Trump2016!!","commenter_a":"The JV team strikes again. How long before we hear Obama say \"religion of peace\"? I don't know how he says it with a straight face. #PrayforFranceAGAIN","post_message":"Sky News now reports that the death toll has reached 60 after a truck drove through a crowd celebrating Bastille Day in Nice. French President Francois Hollande has returned to Paris for crisis talks."},{"comment_id":"10153758605053132","commenter_b":"These woman work these jobs to get rich. Tigers Woods wife was a nanny Arnold Schwarzenegger's, house keeper, now this chick. These women plot & plan to insert themselves into the money by any means necessary.","commenter_a":"Bad woman what goes around comes around! She will be sorry! Down with Affleck and her!!","post_message":"She's staying busy."},{"comment_id":"10152862008521336","commenter_b":"I'm so glad they caught those scumbags without more bloodshed. It still is b@llshit that some people think shooting at cops is an appropriate action to try and prove a point. If you want a lawless society I'm sure there is some third world country that will accept your dumb@ss.","commenter_a":"He Could Be Obama's Son!","post_message":"UPDATE: Two suspects are in police custody Tuesday for allegedly shooting two plainclothes NYPD officers responding to a robbery."},{"comment_id":"1703542769705464","commenter_b":"Nothing wrong with the east end of london. I used to go there most weekend to watch West Ham. Most of the whites moved out so blame them for not integrating.","commenter_a":"What a load of BS.. The best thing about britain is that its a big melting pot of all cultures and religions and we all get along fine apart from a small minority of extremists.","post_message":"According to a shocking new report"},{"comment_id":"894598347242254","commenter_b":"She needs to keep the hell out of our city schools.","commenter_a":"From what I see in this pictire, Moochelle is describing how to succeed in politics the Lewinsky way! ROFLMAO!","post_message":"The Food Police!"},{"comment_id":"10153601667565329","commenter_b":"Wtf buzzfeed? That chick with her fingers under her eyelids?!","commenter_a":"My leg spasms like that too. It's nasty!","post_message":"No. No you can not."}]
