[{"comment_id":"10153586191671336","commenter_b":"White girls everywhere lose their minds","commenter_a":"No to starbucks for quite some time.","post_message":"Yay or nay… What do you think of Starbucks changing up the pumpkin spice latte?"},{"comment_id":"1529581924006603","commenter_b":"She's trash, she's a disgrace!","commenter_a":"Racist pig!","post_message":"Boycott this idiot..."},{"comment_id":"10153204052806051","commenter_b":"@username-You are a chicken !!!","commenter_a":"Obama is a terrorists","post_message":"This sign about President Obama is sparking a lot of controversy. Decide for yourselves if it's fair."},{"comment_id":"10153206865573525","commenter_b":"Stfu!","commenter_a":"'Charged' a police officer with a knife ? And she is still alive ? Oh wait, she is WHITE !","post_message":"HOUSE OF KNIVES: Here's a look at what deputies confiscated from a Hernando County woman's home after she charged at an officer with a knife. Thousands of knives and other weapons, along with fake severed limbs and fake skulls. MORE: @webpagelink"},{"comment_id":"498451153654689","commenter_b":"This is one more reason we need you","commenter_a":"I want to vote for you. However, would you please address the very serious immigration issue.","post_message":"Just spoke to National Right to Life Convention. We are united in cause. Thanks for having me. Defend the defenseless. We are the voice for the voiceless. #HealInspireRevive"},{"comment_id":"477887179066242","commenter_b":"That is so sick why would anyone want abort a unborn baby must one that already born i'll tell you who a sick mf that's who","commenter_a":"They have abortions like it's nothing, no big deal. I used to work with a woman that loudly explained to 2 co-workers how her Dr gave her some pills. She took the pills over a weekend and when she went to the bathroom the fetus fell out. I couldn't believe what I was hearing and was stunned. Made life seem cheap.","post_message":"This is INSANE...STOP THEM NOW! PLEASE SHARE TO EXPOSE THEM!"},{"comment_id":"10154298930434497","commenter_b":"Also, I don't appreciate you insulting my intelligence without provocation and based on assumption. You should work on how to prevent yourself from treating people like shit who don't deserve it.","commenter_a":"I know this is satire, but they broke my suspension of disbelief, with the suggestion that a television company actually covered Bernie's campaign...","post_message":"Via Onion Politics:"}]
