[{"comment_id":"10154065834906323","commenter_b":"Britain has more than enough/too many home grown criminals, that's very true. So what kind of imbecile would want to import more? eg: 1,000 immigrants. 999 workers/1 criminal. That's one too many. How to stop the criminal entering? Let none in. How simple is that?","commenter_a":"I didn't know all UK citizens were perfect law abiding citizens. Those who live in glass houses ... The important stat is crimes per person, EU citizen vs UK citizen, but that'll probably be inconvenient for the leave campaign as most EU immigrants are educated, employed, and tax paying.","post_message":"A dossier of murders and rapes committed by 50 EU citizens in Britain has been published by leading out campaign group Vote Leave, in a move described by critics as “scaremongering of the worst kind”."},{"comment_id":"1212512528838103","commenter_b":"STFU already! Hillary lost because she's Hillary. Get over it!!!","commenter_a":"Trump can't make an honest or decent response to anything.","post_message":"Trump’s Latest Twitter Tantrum Desperate Distraction From Tuesday’s Stunning Revelation. It’s likely not a coincidence that the President-Elect is rehashing won battles after Tuesday’s breaking news that FBI Director James Comey likely acted favorably towards Donald Trump with his October announcement that new evidence emerged in the Clinton email investigation. Read the whole story at Reverb Press HERE: @webpagelink"},{"comment_id":"10154140006458525","commenter_b":"pure evil! No reason to harm officers.","commenter_a":"Suspect is now in custody.","post_message":"#BREAKING The suspect has been captured. Police in Iowa are searching for this man in the ambush-style attacks of two police officers, shot and killed in their cruisers. Police say Scott Michael Greene, 46, is considered armed and dangerous. SPREAD THE WORD: @webpagelink"},{"comment_id":"10154362244534778","commenter_b":"This is a symptom of disrespect. Did the office overreact, perhaps. What do you do with a teenager that doesn't listen to authority? Continue to let her disrupt the class? This girls deserves to be punished. She may have gotten hurt because of her initial defiance but she is not a victim. They should review the incident and I hope they clear the officer of everything and I hope they give the girl detention. If we don't stop the disrespect, the result is anarchy.","commenter_a":"This kid did not attack anyone she may have ignored commands peacefully as most protestors will do but in no way is that a crime. The violent attack from this cop was in fact a crime.","post_message":"About 100 students wore T-shirts reading \"Free Fields\" or \"#BringBackFields.\""},{"comment_id":"10154784802599575","commenter_b":"arrest her before she flees the country!","commenter_a":"If she had any tact, or respect for the people who voted for her she would of made a speech last night.","post_message":"Hillary Clinton is expected to speak very soon from New York after losing the election to Donald Trump. We will live stream her concession speech on our Facebook page and in this post."},{"comment_id":"10153328651014342","commenter_b":"wonder if her phone was busy? congress write the laws why is no one talking about them?","commenter_a":"Well he calls after someone writes the words to say....the deputy was killed on Friday night and this is Monday....","post_message":"Today, President Obama called the widow of fallen Harris County Sheriff's Office Deputy #DarrenGoforth. After that, he released the following statement: \"This afternoon, on my way to Alaska, I called Kathleen Goforth, the widow of Harris County Deputy Sheriff Darren Goforth - a veteran law enforcement officer who was contemptibly shot and killed over the weekend. On behalf of the American people, I offered Mrs. Goforth my condolences, and told her that Michelle and I would keep her and her family in our prayers. I also promised that I would continue to highlight the uncommon bravery that police officers show in our communities every single day. They put their lives on the line for our safety. Targeting police officers is completely unacceptable - an affront to civilized society. As I said in my State of the Union Address, we've got to be able to put ourselves in the shoes of ..."},{"comment_id":"10154369386511545","commenter_b":"Imagine if someone came and ruined America and a civil war started. People killing and fighting everyone. Not everyone has the money to buy guns or the nads to pull a trigger. Hopefully that never happens but I am guessing people would try and leave, some in a hurry to wherever is better and closest....and hopefully don't get turned away at borders.","commenter_a":"Why, oh why, can't the pot stirrers understand the difference between LEGAL and ILLEGAL when it comes to immigration?!? The US was indeed made up of immigrants, and we love immigrants still, WHO COME HERE LEGALLY. And while I'm at it, why should we take in refugees WHEN WE HAVE NEEDY AND HOMELESS AMERICANS IN EVERY MAJOR CITY IN THE US? Let's give the CITIZENS all the benefits first. Why is that such a hard concept for some people? Seriously! Do you really think any other country in the world would put refugees AHEAD of its own citizens?!? No! Americans first, then help others. Just like in an airplane, put YOUR oxygen mask on first, then help the ones around you. Oy!","post_message":"The full commercial didn't appear on television during the big game after it was rejected by Fox. The full ad, which is nearly six minutes long, is available on the company's Twitter account."}]
