[{"comment_id":"10153341180476545","commenter_b":"Didn't a Muslim refugees came to U.S.A and took part in 9/11? So yes we have seen American Idol attacked be a refugee","commenter_a":"Funny... I do treat people the way I wish to be treated, I have not once cut off anyone's head.","post_message":"Their voices: Both sides of the Richardson mosque protest VIDEO: @webpagelink"},{"comment_id":"10152905378740736","commenter_b":"Shes an idiot..lmao","commenter_a":"Send him home to Mexico please.","post_message":"Two young girls told security at an H&M store that the man was positioning his phone under women's skirts."},{"comment_id":"1747901745468646","commenter_b":"Do the same to that raghead bitch","commenter_a":"Is this true? If it is, she needs to be on death row!","post_message":"Muslim Nanny Who Beheaded 4 Year Old Girl Will Not Face Murder Trial Because... This is the world we are living in today people. What do you think her punishment should be?"},{"comment_id":"10153699640168984","commenter_b":"Trump2016, Deported his ass and then let him back in,Just like he said he can do with the good illegals, but if they are bad then he will leave them on the other side of the wall.lol","commenter_a":"the most entertaining candidate I have ever seen :)","post_message":"This Univision host thought he could battle it out with Trump, but he failed BIG time. Do you think Donald Trump made the right move?"},{"comment_id":"895880550545124","commenter_b":"An actual woman.","commenter_a":"This is a weak argument.","post_message":"Maybe liberals should have thought about how much they wanted to focus on Michelle and Melania's speeches before they started losing their minds. With so many people looking at the speeches this was gonna happen."},{"comment_id":"10153173329758984","commenter_b":"Wolves in sheep's clothing.","commenter_a":"Watch Yer back,Sheriff Joe,Yer dealin with Snakes...","post_message":"Look out, Obama. The sheriff's in town. Do you support what Sheriff Joe Arpaio just did to stop Obama's amnesty?"},{"comment_id":"1819660061616257","commenter_b":"Let me guess...She will be Secretary of Mental Health...F*cking Lunatic...","commenter_a":"OMFG","post_message":"WOW. We are officially an international embarrassment..."}]
