[{"comment_id":"10154590709007955","commenter_b":"Of course. He has already done a lot for the USA. Keep going President Trump. Pay no attention to the meaningless leftists.","commenter_a":"absolutely","post_message":"Do you think Americans need to give Trump more of a chance to succeed as president?"},{"comment_id":"10153720190262894","commenter_b":"She'll always be a ghetto bitch from Chicago","commenter_a":"Read this shit @username gold diggin bitch","post_message":"Wiz Khalifa and Amber Rose Finalize Their Divorce, Hit the Strip Club Together [Video]"},{"comment_id":"10153021428690399","commenter_b":"Karma is a bitch","commenter_a":"Bet he declares bankruptcy and sticks us with the bill. Typical freeloading conservative.","post_message":"smdh"},{"comment_id":"953925358000546","commenter_b":"^^see Lisa....THAT'S good parenting.","commenter_a":"Thats messed up. what if the kid is actually struggling in school ? The dad should help him with homework and take his xbox away TEMPORARILY and see whats the kids real issue.","post_message":"This is a warning to all Xbox-playing students — do your homework!!!"},{"comment_id":"609176595931357","commenter_b":"Not shark tale though 😂😂😭😭 Alex McKay @username","commenter_a":"Jasmine Elise","post_message":""},{"comment_id":"10153767520167994","commenter_b":"Alicia Anne , try Jennie Craig","commenter_a":"I no longer have any remorse for anyone in an accident. I see drivers acting like morons every morning and every night...until they start acting like humans, people will continue to die. Michigan drivers are all a bunch of morons.","post_message":"The Davison Freeway westbound remains closed as investigators comb the scene where a man was killed in a crash."},{"comment_id":"10152836141061130","commenter_b":"A man loves getting molested by his women while he is sleeping he will wake with a bigger erection because he is not sure who is doing him.","commenter_a":"I like red haired, bears","post_message":"A man isn't strong unless he's also vulnerable."}]
