[{"comment_id":"1286110978131794","commenter_b":"Oh you mean like all the people who first came to America and created the United States? Then took half of Mexico? Oh ok. As long as this is clear and there are no glaring hypocrisies!","commenter_a":"Sorry, incorrect...if you overstay a visa, you are an illegal alien, If you ENTER the country illegally, you are an INVADER!!","post_message":"Allen West Republic"},{"comment_id":"10153939182654060","commenter_b":"There are no women in a yakuza clan.","commenter_a":"Curiously -- nothing is said about females role in the family🔮","post_message":"In 2011 a Belgian photographer was allowed entry into one of Japan’s Yakuza families. Over two years, he captured the lives of those living in the underworld"},{"comment_id":"10153794663986491","commenter_b":"More reasons for not having a women as President....","commenter_a":"\"Good guy with a gun\" turned murderer in 20 seconds.","post_message":"\"It was a family argument that turned into a shooting.\""},{"comment_id":"614667495400588","commenter_b":"although she used the same structure as the \"hero myth\" that Joseph Campbell taught us to be a structure present in all traditional cultures","commenter_a":"Yeah, gonna have to disagree with this article. Just because whiny liberal twenty-somethings are hijacking the HP narrative for their agenda does not mean that the series is poorly written or guilty of propagating a false view of the world. Sure, Rowling is loudly liberal herself. But as a conservative I can, and do, greatly enjoy her books.","post_message":"Let's be honest, J.K. Rowling isn't a very good writer."},{"comment_id":"10154173812304205","commenter_b":"As long as she keeps getting elected, she wont feel the need for change!","commenter_a":"If she was a basketball coach, she'd be fired. Continue to work for your district in CA, but someone else from another part of the country like for example a representative from Wisconsin or Michigan should lead. The Democrats are pussies.","post_message":"Nancy Pelosi wants to assure you that everything is fine in the Democratic party. She is wrong."},{"comment_id":"10153571319289342","commenter_b":"¡¡¡¡Omg esta cara voy a poner si ganó !!!!","commenter_a":"Will Htx Larisa Valcy Brian Valcy Jovannii N Juliet Mendoza Luisao Roberto Galvez @username Beldy Salvador","post_message":"$400 MILLION POWERBALL JACKPOT: Are you planning on buying a Powerball ticket this week? With the potential jackpot now standing at $400 million, this Wednesday drawing could be one of the largest in U.S. history. While you're dreaming of how you'll spend your winnings, here's a look at the 10 largest U.S. lottery jackpots: #abc13"},{"comment_id":"10156019875440354","commenter_b":"Then lets deport them when they cause trouble!","commenter_a":"Why not? So should Italian Americans.","post_message":"Say what?"}]
