[{"comment_id":"1105387789537448","commenter_b":"Truly AMAZING she's still walking free, let alone running for ANY office other than cell block Queen!AND NOW the big 30 minute meeting of billy boy and AG L Lynch in Phoenix while under investigation! DEEP DEEP CORRUPTION","commenter_a":"Using her words when she said\" When Bill left office we were flat broke\". Folks that was less than 12 years ago. Pretty good return on her investments. Instead of President, maybe we should make her the Federal Reserve Chairman.------NOT","post_message":"Allen West Republic @webpagelink"},{"comment_id":"10153263925251990","commenter_b":"@username hubby leaves for work and I wake up","commenter_a":"Jackie Owens @username-Hernandez @username","post_message":"JUST IN: The CHP says two people were struck by blow darts while walking on the Golden Gate Bridge --> @webpagelink We will have more on this story in our News at 11 p.m."},{"comment_id":"10153162076526680","commenter_b":"How the hell did you get to this conclusion based on my comment ?","commenter_a":"He's 100% right. Charlie Hebdo was especially targeted because they did cartoons criticizing Islam. What's more frightening in last week's attacks, is that, there was no rationale, just indiscriminate killing of everyone in sight.","post_message":"John Kerry suggested that there was a “rationale” for the assault on satirical French weekly Charlie Hebdo, unlike the more recent attacks in Paris."},{"comment_id":"852381858149314","commenter_b":"she is a total ASSHOLE and the biggest racist along with her husband. could just imagine how they are raising the girls.","commenter_a":"The only thing I see that she's done is screw the guy that planned to lie, cheat, steal his way into the white house. She did, he did, and they keep going.","post_message":"INSANE VIDEO: IT’S GRADUATION TIME...AND THAT MEANS IT’S TIME FOR OUR RACIST FIRST LADY To Spew Hateful Lies And Rhetoric About Racist White America And The Mistreatment Of Blacks ***WARNING****It's hard to watch this video filled with lies and anger toward white Americans without feeling like your head is about to explode!"},{"comment_id":"10153373232208984","commenter_b":"Wow!! Such nasty, foul mouth comment from a woman. First Lady has more class than you will ever know.","commenter_a":"Yes we can not wait to get a real first lady again this nasty racist bitch needs to fk off","post_message":"I thought I'd seen every attempt at the race card possible, but this is definitely a new one... Do you look forward to Michelle leaving the White House?"},{"comment_id":"975974852420526","commenter_b":"You would lie like that? You and Warren deserve each other!","commenter_a":"We really DO need to declare the GOP a terrorist organization!","post_message":"From today's #MorningReads: GOP Front-Group Targets Warren's Legacy; \"Jihad John\" IDed; and Inside the GOP's Campaign to Defang Federal Gun Laws."},{"comment_id":"1025513424232102","commenter_b":"THAT BITCH NEVER HAD A MIND","commenter_a":"Who's gives a fling f--k what these assholes say .nobody watches that so called show anyway.get ready to pack bitch","post_message":"I think I can see steam coming from her ears! @webpagelink"}]
