[{"comment_id":"608238889333781","commenter_b":"They can leave this country","commenter_a":"Tell them to leave","post_message":"Texas Man Told Remove His American Flag Because It Was A ‘Threat To Muslims’. Let's show this patriot our support. Can we get 75,000 'LIKES' for his love of his country?"},{"comment_id":"10153956818033967","commenter_b":"I rolled mine back to Windows 8.1, 10 is worse than Vista.","commenter_a":"Step one....reinstall Windows 7","post_message":"Unleash the power of Windows."},{"comment_id":"10152876898775496","commenter_b":"Prayers for her son and family!!! The county and the contractors should be held responsible! There's no way a lifeguard should have his job if he can't swim or perform CPR! Ridiculous!","commenter_a":"Obviously the lifeguards should be able to swim and perform CPR but my question is more for the Mother ... Don't depend on other people to keep your kid safe in a pool ... That is your job as his parent ... Why are you do quick to blame another for your lack of responsibility in this? Just another story of needing to blame someone else ...","post_message":"\"The lifeguard told him that they couldn't swim to him, they didn't know how to swim, and one said that he didn't know CPR,\" See more: @webpagelink"},{"comment_id":"10152999790806167","commenter_b":"I would pay money to watch Nikki Haley and the vampire fight each other.","commenter_a":"conservative firebrand???lol whatever! she is a delusional racist self hating woman!","post_message":"Fact: Governor Nikki Haley was born in South Carolina."},{"comment_id":"10153134851981316","commenter_b":"Go away kardashian of the transgender world","commenter_a":"Lol. Worthless","post_message":"Feminists now attacking political correctness after Caitlyn Jenner honored by Glamour as Woman of the Year: @webpagelink"},{"comment_id":"10154102450848984","commenter_b":"OMG, Hillary is so very, very, very White !","commenter_a":"She just wants to be president, talks a lot of BS.","post_message":"Wow. Hillary Clinton was caught doing something next to Al Sharpton that is fueling the criticism that she is a complete fraud... and it was all caught on camera. Do you think Hillary will be the Democratic nominee?"},{"comment_id":"1830155707222526","commenter_b":"@username ...Well, CA did vote her out...but the rest of America did!!! Oh, HAPPY DAYS!!!","commenter_a":"This \"Deplorable\" American Christian is voting for TRUMP, I live in California and all my neighbors and friends are voting for TRUMP...We are tired of the lies and corruption of career politicians!!!!","post_message":"Matt Walsh: A Clinton win won’t be a victory for women but a victory for corruption."}]
