[{"comment_id":"10152610219894071","commenter_b":"Gabriel Emilio","commenter_a":"Bates PAPA Creighton","post_message":"They're killing it right now."},{"comment_id":"961900420609625","commenter_b":"Of course Mary doesn't care lol ignorant people usually don't listen","commenter_a":"Your was hoping he would be our first African American president. Instead we got a communist African Muslim!!!","post_message":"President Obama delivers his farewell speech in Chicago."},{"comment_id":"914583611910394","commenter_b":"Trump is right about illegal immigrants. Our government has committed treason by leaving the borders open.","commenter_a":"Give em a right and then a left upper cut ,don't quit,you have em on the ropes...","post_message":"Hot off the press!"},{"comment_id":"10155177965959050","commenter_b":"MAN HATER. EVIL WOMAN","commenter_a":"Disgusting.","post_message":"The anti-Trump Women's March featured a woman who kidnapped a man and then tortured him"},{"comment_id":"952596034775492","commenter_b":"@username Shooter FU! You are a whinny little bitch.","commenter_a":"lol we are fucking idiots, we believe in make believe deities, we salute the flag of the sickest country in the history of existence, we salute brainwashed troops who murder innocent people behind imaginary lines, welcome to brain dead Georgia lol","post_message":"If you don't love the nationalistic rhetoric of the state, LEAVE! Police The Police | The Free Thought Project.com"},{"comment_id":"902484503120305","commenter_b":"She will never be a first lady! She spouts her mouth in the wrong direction! Lady you are suppose to set an example for red white black brown or any other color of people in United States! Instead you keep things stirred up, you and your so called husband!!","commenter_a":"Oh, she is the racist. She hate her own kind. Disgusting.","post_message":"Jaw-dropping!"},{"comment_id":"557193267780477","commenter_b":"KEEP GOING TED!!!!","commenter_a":"Wooo! Hooo! Colorado!...We stand with Ben!","post_message":""}]
