[{"comment_id":"10154407865186636","commenter_b":"Not by quite a wide margin however. How much Norbert get? 47% was it? It's already getting dangerous","commenter_a":"Austrians rejected the Far-Right, let's hope the French do the same, otherwise Europe will become a more dangerous place.","post_message":"Elections take place in April"},{"comment_id":"10154352514741523","commenter_b":"Are you ready for that wall","commenter_a":"And there's Putin Ridin Trump or the other way around","post_message":"\"He's not a bad man. But his ignorance is so profound, so profound.\""},{"comment_id":"10153459242386409","commenter_b":"That will teach him to open his big Mouth !!","commenter_a":"This is ridiculous","post_message":"A murderer serving three life terms for killing three people saw two more decades added to his sentence after a Washington State parole board considering his request for early release felt his crimes called for a harsher punishment."},{"comment_id":"1757840827811038","commenter_b":"Cindi, your an idiot. She is legal.","commenter_a":"She has bad health,think how much more will she take from we all to stay alive","post_message":"LIVE Trump! DRAIN THE SWAMP FOLLOW US for Conservative news!---> Freedom Daily Donald J. Trump Donald Trump For President #maga"},{"comment_id":"10153494540359641","commenter_b":"Good decision. No one wants to take the chance of harboring snakes on their own homeland, before long this migrant group would breed like crazy and before long their population would be 40 p.c or more and they might get some enlightenment and start bombing the locals.. The problem with most muslims, is they are always muslims first. They are not british, germans, australians, americans..There identity is muslim first and that's why its hard to trust loyalty of someone whose citizenship comes second to the God..These people can easily be blinded. From birth they are taught to prepare for heaven, if only they had such devotion for their mother land. Be it, wherever they are born, what ever citizenship they hold. The greed of heaven and fear of hell has done more bad to man than good.","commenter_a":"Oh no, of course not!","post_message":"Slovakian minister insists it's not discrimination."},{"comment_id":"557055264492970","commenter_b":"What scum bunnies.","commenter_a":"It should be simple, if you don't vote, then don't complain! But it seems the ones who didn't vote, are the ones crying, whining, rioting and be rude!","post_message":"\"That's sort of amusing,\" Donald J. Trump senior adviser Kellyanne Conway tweeted."},{"comment_id":"1901231699975547","commenter_b":"That don't count, She is a pig and certainly is Fat. Its not her fault it was the spoons fault.","commenter_a":"Wasserman hates men","post_message":""}]
