[{"comment_id":"10153061482070326","commenter_b":"I don't care who the media whores are in love with or paid to pretend they are in love with. If people would just vote for who they really want to win, we would beat them. Stop listening to the media tell you no one can beat Hillary.","commenter_a":"Thats because the media no longer represents the people. They want to talk about emails, when most of us are worried about just making it. I wouldn't sit down with you either.","post_message":"This is what Hillary Clinton does NOT do with the media."},{"comment_id":"10153438152599087","commenter_b":"What a phony!","commenter_a":"This man should win an award . I wanted to hurl. Wake up people, he is setting you up, playing you like a fiddle for his own political agenda. What a low life to use the children over and over. Not one damn thing he is going to use that damn pen for, will stop the issues we have. The gun doesn't pull its own trigger and mentally ill, terrorists, and murderers do not obey damn laws. He wants to disarm the law abiding. Ask him to dismiss the secret service that carry guns to protect his ass and see how far you get.","post_message":"“Every time I think about those kids [in Newtown], it gets me mad,” President Barack Obama said as tears rolled down his cheek. WATCH:"},{"comment_id":"10153836803272623","commenter_b":"Good players But it's another\"L\"","commenter_a":"Ga...NO ....Riverboat must have sank and Cam Ain't ..... stupid Panther Fans","post_message":"The New Orleans Saints beat the Carolina Panthers in a 41-38 victory Sunday in New Orleans."},{"comment_id":"1034345616576908","commenter_b":"Please. Many women CANNOT use those. I never could. Not everyone is the same dear.","commenter_a":"Ladies....Honestly. Get a menstrual cup. You will hate yourself for not doing it sooner.","post_message":"This should not be a thing"},{"comment_id":"575161529335569","commenter_b":"That sick women will never be fine ! Who you kidding !","commenter_a":"Why is this such a big deal? After some rest, and antibiotics she will be fine.","post_message":"Is Hillary Clinton just run down, or is it more serious?"},{"comment_id":"1321112227930500","commenter_b":"I reckon there's still a chance he'll be persuaded to step aside, and Pence will be inaugurated on Jan. 20.","commenter_a":"Looking forward to the impeachment.","post_message":"It's official"},{"comment_id":"10153765289899726","commenter_b":"Come to my house and more than their head will fly out the window. #semperfi","commenter_a":"Now, does Allah have 73 virgins for her too?","post_message":"Bomber's severed head 'flew out the window'"}]
