[{"comment_id":"10153111712291491","commenter_b":"Respectfully disagree. I like my women a pretty delicate flowers, but that's just me.","commenter_a":"She might be the all around inside/outside sexiest female of the 21st century!","post_message":"Ronda Rousey's next opponent: the box office."},{"comment_id":"817764698322138","commenter_b":"What Melissa said !!","commenter_a":"You know if everyone hates you, you must be doing something RIGHT. Trump isn't an ASS KISSER.","post_message":"\"I understand why he got angry. She was asking insulting questions.\""},{"comment_id":"1665959326994845","commenter_b":"What an ass hole!!!","commenter_a":"He sure didn't forget to LOOK at the camera though. Or.. salute the pilot in the plane. Dipsheep!!!!","post_message":"Obama refused to salute marines exiting Air Force One. That does it. Obama is anti-American and unfit to lead our country. Do you support our Marines?"},{"comment_id":"888228281273425","commenter_b":"Go baby go! There is no one more capable to speak for the down trotted, our Vets and what wars do to people than you! And you are a hero and thanks a million for your dedication and Service!","commenter_a":"Go Tammy!","post_message":"She’ll challenge GOP Sen. Mark Kirk in the 2016 election."},{"comment_id":"10153638108452894","commenter_b":"Exactly STFU Girl","commenter_a":"........\"my neck,my back,lick my 9ussy and my crack\" is her claim to fame, from like the 90s or something, why is she even doing a interview ?","post_message":"Khia BLASTS Beyoncé & Serena Williams for Making ‘Black People Look Bad’ & The Game Claps BACK: ‘Don’t Yo Neck and Yo Back Hurt?’ [Video]"},{"comment_id":"418399244951783","commenter_b":"People Conroling People , Money Conroling people , Paper controlling people , hu? Paper seems to be more in control here , get ready for a tree farm congress , congress: wants more trees , People: why, Congress: environmentally safe ecosystem, People: yeh, Congress: Money money money","commenter_a":"Seems legit.","post_message":"Lobbyists and politicians getting together, and yet it's the people who get screwed."},{"comment_id":"474933522694941","commenter_b":"No! We don't want any more of these people!","commenter_a":"AHH HELL NOO!!","post_message":"60,000? Can you imagine how many terrorists among them?"}]
