[{"comment_id":"10153941419749614","commenter_b":"how is she an idiot, Frank? your original post does indeed come across as victim blaming. rapists don't discriminate. it doesn't matter if it's 9pm or 9am - if they wanna rape someone, they will do it. also, this girl was with her father so I'm sure she felt pretty safe to be out after dark.","commenter_a":"Why would they be at a Playground in Brooklyn around 9 p.m.???","post_message":"Update: Police say they have four of the five males in custody in connection with the incident. Original post: New York police are looking for five men who forced a father at gunpoint to leave his teen daughter behind so they could take turns raping her, authorities say. The 18-year-old was with her father at the Osborn Playground in Brooklyn around 9 p.m. Thursday when the brutal gang rape took place, according to NYPD. Authorities released this grainy surveillance video, taken in a bodega before the violent assault, that they say shows the suspected attackers. Police are asking for the public's assistance in identifying them. Read KTLA story here: @webpagelink"},{"comment_id":"2040319902861153","commenter_b":"Trump dont controll the border walls he will make trouble here in border town n Mexico... we have crime here due to there here already the Cartels n Zetas in da USA in the border cities... USA build walls the always around or underneath or make ladder in the walls","commenter_a":"Wow. You hate waterboarding of terrorist and protest on the streets of America on their behalf. But the beheadings of American soldiers, christians and innocent civilians in the Middle East and nothing said on the streets of America. And you call yourself an American. Seems like the left is more interested in open bathrooms and open borders, hmmm?","post_message":"Wake up, America!"},{"comment_id":"10152812861587507","commenter_b":"Tell us who those democrats are that WANT war????","commenter_a":"God supports hate , hate wins wars , and Democratic elections .","post_message":"Army of God? 6 Modern-Day Christian Terrorist Groups You Never Hear About"},{"comment_id":"1075404492512556","commenter_b":"WTF was with that woman?!? She's just sitting in there? She should have been out of there so fast and getting those kids out. He had to keep yelling to get her out???? What a Moron. And they just stand there Casually once out??? I might be kissing the kids out of Gratitude that they were alive and Thanking the Officer that saved them. There is something Seriously WRONG with these women.","commenter_a":"So are they the baby sitters? They sure shouldn't be parents!","post_message":"Dramatic footage shows two women and two children being rescued by California Highway Patrol officer after their car catches fire."},{"comment_id":"1504784736221446","commenter_b":"U sound like a bitch","commenter_a":"And the award for the most useless attempt at contribution to society goes to.... The author of this article. Wonder if that student debt you got from studying journalism at university was worth it. Merry Christmas","post_message":"As you can imagine, it did not go well."},{"comment_id":"1218898121528016","commenter_b":"@username ..... What I really believe , is that the Republicans will have Trump tossed out of office within the first year. He is a Dangerous person , and he also has far too many enemies within the party. That is why he is surrounding himself with people he feels are loyal to him instead of people that actually have some knowledge of what really needs to be done. They are not going to forgive and forget his insults and his horrible attacks on them and their families. Ted Cruz and the gang are just biding their time until the inauguration. Pence Will be President and then the country will be run as a Christian Caliphate.","commenter_a":"Exactly right ! And make no mistake , Pence IS going to be president ! Seriously ... I don't know which one will be worse !!","post_message":""},{"comment_id":"10153990406082293","commenter_b":"@username apparently you believe so easily what Hillary says. She is a vicious Evil woman who cares about Money and Power and no one else. I have been around for all the Hillary Scandals and every one of them will be coming back at her during the next few months. I don't know how this woman can sleep at night for what she has done.","commenter_a":"She has been held to a higher standard. Republicans have spent decades trying to pull her down. #ImWithHer","post_message":"Hillary Clinton's honesty problem is growing."}]
