[{"comment_id":"1725328477744790","commenter_b":"A blow job from what you call an ugly woman is still a blow job. We drank, screwed, and partied in cemeteries when I was a teenager.","commenter_a":"Cemetary, huh? Could be 'cause the kid didn't wanta be seen anywhere with such an ugly woman.........","post_message":"Police say that an officer caught 49-year-old Kelly Aldinger in the act with a 17-year-old student at Easton Cemetery."},{"comment_id":"1115714755184548","commenter_b":"@username DUMBF TRUMP BUILDING HIS OWN WALL BECAUSE MEXICAN PRESIDENT SENT HIS ASS PACKING.","commenter_a":"Smart women.. COUNTRY COMES FIRST. LET'S VOTE BLUE IN NOVEMBER. HILLARY NEXT PRESIDENT OF THE UNITED STATES OF AMERICA.","post_message":"This is just too good!"},{"comment_id":"10156663842160354","commenter_b":"KILL THEM Europe.","commenter_a":"This is what the fool, Obama wants for America .","post_message":"A DOZEN PHOTOS... \"Parents have been advised to keep their children indoors as migrants roam through playgrounds, while on residential streets police wearing riot gear stalk gangs of migrants.\""},{"comment_id":"10153241233694087","commenter_b":"Which wife??","commenter_a":"He makes good decisions ... look at his wife and his kids ...","post_message":"\"He is who he is,\" Melania Trump said of her husband Donald J. Trump. \"Even if you give him advice, he will maybe take it in, but then he will do it the way he wants to do it. You cannot change a person. Let them be. Let them be the way they are.\""},{"comment_id":"10153163380586336","commenter_b":"ANIMAL! wait is that Obama's son??","commenter_a":"Hang em on national TV.","post_message":"UPDATE: A third man has been charged with sexually assaulting a woman during spring break in Panama City Beach, Florida, that was captured on cellphone video, authorities said."},{"comment_id":"1336033269792120","commenter_b":"Lol mybe we all should get a dogs and then all the Muslims will live.Cause thay thank dogs r evil ant that funny .","commenter_a":"He was acting like a mad dog, so he got what he deserved!!","post_message":"When This Muslim Migrant FAILS To Surrender, Police Let Their K9 SHRED Him To Pieces! (VIDEO) LOL! Sorry! Even \"Beggin' Strips\" can't save you now! LOL!!!!!! :D"},{"comment_id":"1729707230595759","commenter_b":"See, you came here legally. That was your big mistake.","commenter_a":"I immigrated from Europe legally paying my dues. Before they even gave me the visa to enter in USA I had to travel across the country and spend a day at a hospital designated by the USA consulate being checked out for diseases. Had to have a certificate from the tuberculosis center that I don't have tb. And after the consulate got my results I was issued the visa and given the green light to come to USA......why did the laws change?","post_message":"Are Americans aware of this?"}]
