[{"comment_id":"10155410892145500","commenter_b":"Arthur, your mother should have swallowed you.","commenter_a":"Once again. ..guns being used against the family...even if its unintentional. ...there are way too many unnecessary guns out there. ...","post_message":"BREAKING TONIGHT: A 9-year-old boy has accidentally shot his 54-year-old grandfather in the woods in Dade City. Story: bit.ly/1GIYKqL"},{"comment_id":"10153767932239411","commenter_b":"Anna Tagintseva shut your mouth bitch","commenter_a":"I know those Chinese universities are bullshiting all the time and yet @username believed it. And someone believe that China will go against US with the help from Russia? Come on, China and US need each other, while Russia will have to stand back and watch.","post_message":"'The increasing pro-active position by China is built on increasing sophisticated and powerful military technology in China defense and military sector. This factor makes US increasingly worried.' - Xin Zhang, Research Fellow at East China Normal University. (Op-Ed)"},{"comment_id":"10157197688465354","commenter_b":"I hope the Police Officers NEVER help her out again!!","commenter_a":"That bitch looks like she is having seizures when she dances! Prince way, way, way better","post_message":"~~UPROAR~~"},{"comment_id":"931654693541670","commenter_b":"It's not just barbaric, it is one more tool of the rich used to keep the not-rich \"in their place\".","commenter_a":"I guess when you have universal medical coverage you don't realize what a nightmare our system is.","post_message":"The headline really begs the question, who the hell would ever want to visit the United States knowing they could be bankrupted if they should need medical care while they are here?/"},{"comment_id":"1251827328191456","commenter_b":"they are only saying this so they wont loose sales!!!!!","commenter_a":"So everyone remember to take your children to the restroom before Target trips","post_message":"👏 👏 👏 (via The Huffington Post)"},{"comment_id":"862939013836884","commenter_b":"Go away woman.","commenter_a":"I believe she is a bigot for supporting Sharia. Go blow Max.","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"10154896780339411","commenter_b":"Why is that boot still in charge. Get her out !!!!","commenter_a":"Says the leader that advocates the EU: one of the biggest protectionism rackets on the planet!","post_message":"'Globalization is happening. We can arrange it such that we strengthen multilateral instruments... or such that we seal ourselves off and become protectionist', said Angela Merkel."}]
