[{"comment_id":"10153005489041770","commenter_b":"And who says this female is not a partisan hack?","commenter_a":"This woman is an enemy to our country.","post_message":"\"There’s nothing more important to me as a Jew to ensure Israel’s existence is there throughout our generations.\""},{"comment_id":"10154575462084714","commenter_b":"No, a set is 3 games. They lost one game in a set, which is the only time they've lost in Rio.","commenter_a":"But did she win??!","post_message":""},{"comment_id":"10153443298156051","commenter_b":"Go to hell","commenter_a":"She a moron. You hate kids then don't work at a day care idiot.","post_message":"A few hours before she began her new job, this mom posted something on her Facebook account. Before she could even get to work, her employers called her and told her not to come in. Decide for yourselves whether she should've been fired."},{"comment_id":"10154369386141509","commenter_b":"Why are they racist? Because we want to deport illegal immigrants like every single country in the world? So the whole world is racist except for American liberal sissy's? Mexico deports all illegals so by your standards they're racist. England is racist. China is racist. Maybe your just a puppet?","commenter_a":"This won't sit well with the racist elements of the Republican party. Cruz is saying what I thought all along, the Republican party will never round up anyone. It's an election ploy with base voters.","post_message":"Texas Sen. Ted Cruz does not plan to authorize a special force to deport the undocumented immigrants currently in the country, he told CNN's Jake Tapper, setting up a policy contrast with Donald J. Trump. @webpagelink"},{"comment_id":"10156651950690354","commenter_b":"She can have all my babies","commenter_a":"Some poor schlep is going to get this girl pregnant one day and then oooooohhhhhhhh shitttttttt, here comes the crazy. Which brings up a good point. Wear condoms. Knowing is half the battle.","post_message":"Here's the VIDEO that's breaking the Internet today. \"Miami’s Local 10 identified the inebriated girl as second year University of Miami neurology resident Dr. Anjali Ramkissoon.\" **Viewer discretion is advised**"},{"comment_id":"1099414256845409","commenter_b":"No. We will still vote Republican democrat too far away from Christian beliefs","commenter_a":"DNC thugs started the riots.","post_message":"“I will respect that he’s the President, but I’m going to fight every single day to make sure he’s one-term,” a New York protester said of Donald J. Trump's election victory @webpagelink"},{"comment_id":"10155788720365405","commenter_b":"What are you smoking Kate!","commenter_a":"Let's all remember that when Reagan was inaugurated, within hours he was greeting our 50+ hostages held in Iran for more than 400 days. Gov. Walker, you may be the one that will greet them in those hours following your inauguration.","post_message":"In this bad Iran deal, Obama has given up a lot and he hasn't even managed to bring back our Americans currently held hostage in Iran's prisons. We have to stop this reckless and irresponsible deal today. Join me in calling on Congress to stop this deal: @webpagelink"}]
