[{"comment_id":"1111506915536985","commenter_b":"there always must be some mother Theresa online who will even justify leg surgery of mosquito..","commenter_a":"It's gonna be a waste of money to save that snake. Save it for someone who really needs surgery.","post_message":"That looks uncomfortable."},{"comment_id":"10153790561559407","commenter_b":"Eco tourism is the answer to the local economy of these communities, not hunting animals into extinction. Man has done enough damage to Africa. The west needs to stick it's hand in its pocket and spend the money to educate them and show them how to diversify their economy so they don't need to rely on sports hunting. It's not sport to hunt and kill these beautiful animals.","commenter_a":"The UN should encourage all nations to make it illegal for their citizens to go to Africa and hunt the Lion or any other African wildlife.","post_message":"A small victory for the king of beasts:"},{"comment_id":"489404284583485","commenter_b":"The hell with her","commenter_a":"Slick willy is at it again!","post_message":"Bill Clinton's promiscuous behavior could ruin Hillary's chances. Excellent. Help us spread this and make sure she never get's into office. Do you agree that Hillary would be a terrible president?"},{"comment_id":"10154660100050575","commenter_b":"Is she one of those nasty girls with nasty feet","commenter_a":"Funny how Americans don't like crooks","post_message":"Oh, my!!"},{"comment_id":"10154230829439877","commenter_b":"@username that's horrible Florida teachers do get raises the website says the pay is negotiable but I only co-teach so my salary is non negotiable. I suppose it depends on what one perceives as good pay the teacher I work with gets grants and other stipends but she also buys many things. My aunt who's taught for about 11 years in Arkansas buys many items but keeps her recipient for discounts and tax write offs I imagine you don't get nearly back what is put in. I subbed for a little over a year and I found myself buying many items I didn't care to file on my taxes even though the district gives you that option. I understand","commenter_a":"I've worked at many schools many of them teach our babies and cannot stand them this is a fact. I will add I chose my profession after having my well behaved straight A children repeatedly coming home telling me their teacher was mean or did not appreciate their good behavior and Good citizenship. So I began to substitute and get an inside view. 68 job assignments later I saw many teachers that were jaded not just by the lack of parental involvement but by the lack of pay. I think more parents should better discipline and I also believe teachers lacked empathy and understanding. I will add prejudices and biases had a part as well. I really noticed it at mostly white schools that had few Hispanic students and it is truly heart breaking. Therefore, I am pursuing my teaching certification with everything in me to become the/an advocate for ...","post_message":"Who are we allowing to teach our babies?"},{"comment_id":"10153573726630950","commenter_b":"bitch shut your half dead looking ass up !!!","commenter_a":"I am watching on television and I am seeing a lot of Mexican Flags. This is absolutely unacceptable. Last time I looked, California is still a state in the United States of America. If you want to fly the Mexican Flag, go back to Mexico!","post_message":"WATCH: Protesters are gathering outside of a Donald J. Trump event, shouting chants and clashing with police @webpagelink"},{"comment_id":"638594622989083","commenter_b":"@username:: He is. Watched this afternoon & it was good!","commenter_a":"the credibility of cnn as a real news source has is no more....half of the hosts on msnbc are going after Hillary and not focusing on anything that trump does.... and we don't have to say anything about the fair and balanced fox.....it is just sad that trump is getting away with everything....he is the real criminal......but the press doesn't want anyone to know it...it would be bad for ratings.....","post_message":"We've warned them for months: keep pushing the double standard against Hillary and you'll lose all credibility."}]
