[{"comment_id":"972807806163282","commenter_b":"shes a Savage","commenter_a":"@username her","post_message":"The former Stanford University student who sexually assaulted a woman behind a dumpster was released from prison on Sept. 2, 2016. That a full three months early from his original six month sentence."},{"comment_id":"10155057562030725","commenter_b":"\"Bu-but! If we ban guns evildoers would be unable to buy them!! Rig-Right?\"","commenter_a":"you are so right MR, TRUMP ,","post_message":"If the people so violently shot down in Paris had guns, at least they would have had a fighting chance."},{"comment_id":"10153842554698132","commenter_b":"How about all of the leading men she banged?","commenter_a":"He deserved it for having to put up with her stupidity","post_message":"\"That's actually a common answer believe it or not,\" the host replied. @webpagelink"},{"comment_id":"10153043180073984","commenter_b":"Finally someone with a backbone. Why is the rest of the media supporting this evil by not showing the world their true nature?","commenter_a":"Close this guy and his mosque DOWN...","post_message":"Wow, what this guy tells Hannity about the awful Paris terror attack - how he defends the killers' actions...well, see for yourself.. Do you believe radical Islam is the enemy of civilization?"},{"comment_id":"10152797801290671","commenter_b":"You should leave this planet! Your unreal.","commenter_a":"Looks like she's the one on the control on causing a riot","post_message":"Have you seen this video? A woman in Baltimore was caught on tape hitting a young man, believed to be her son, after catching him participating in the riots. About the incident, Baltimore's police chief said: \"...I wish I had more parents [like her] that took charge of their kids out there tonight.\""},{"comment_id":"892166267491828","commenter_b":"Why always Iran?","commenter_a":"Erdogan is a disgrace to Turkish people.","post_message":"Iran has summoned Turkey's charge d’affaires to hear Tehran's protest against Turkish President Recep Tayyip Erdogan's “improper” remarks regarding the Islamic Republic's alleged regional ambitions. Read more: @webpagelink"},{"comment_id":"10153646092561167","commenter_b":"Liberals hate women!!!","commenter_a":"If Megyn Kelly didn't have her looks and her little fued with the Donald to capitalize on she'd be a non issue.","post_message":"Can everyone finally stop pretending Megyn Kelly is any kind of “hard-hitting journalist”?"}]
