[{"comment_id":"10152674104515667","commenter_b":"Leave her alone!","commenter_a":"She's not bald, she just had her hair pulled back. But even if she was bald she still looks beautiful.","post_message":"ICYMI: Michelle Obama looked a bit different on Wednesday's episode of \"Jeopardy!\""},{"comment_id":"10155021638815859","commenter_b":"And dress like a woman","commenter_a":"Of course Trump fails to mention that there really is NO WAY to call the white house and expect to actually get through to anyone.","post_message":"Pres. Donald J. Trump: 'I haven't had one call' complaining about Dakota Access Pipeline. \"I don't even think it was controversial.\" @webpagelink"},{"comment_id":"1136052583084752","commenter_b":"tainted bully!!","commenter_a":"hIS mOUTH RUNNETH OVAH!!! E","post_message":"Curt Schilling, an unemployed baseball commentator who moonlights as a volunteer political commentator on social media, has a hot take on President Obama: @webpagelink"},{"comment_id":"10153325446200950","commenter_b":"@username you dumb ass, read the initial comment before you come for me bitch.","commenter_a":"Get them all out of here!!!","post_message":"Two refugees from Iraq with alleged ties to ISIS are due in court Friday to face federal charges of supporting terrorism. According to an affidavit, both men are accused of lying to cover up their efforts to support terrorism. The arrests are now renewing a debate over bringing refugees from Syria and other countries to the U.S."},{"comment_id":"10153346238078690","commenter_b":"Still as barbaric as before, that was why it was difficult for Mandela to organized them and fight for free. That is why he has to do it on his own. Animals never changes.","commenter_a":"Free from the ravages of inteligence and absolutely racist !","post_message":"Thousands expected to march in South Africa against attacks on foreigners @webpagelink"},{"comment_id":"948666735231933","commenter_b":"Wow, no misogyny going on here (heavy sarcasm).","commenter_a":"More from man hating feminist jackasses. Keep your legs shut, or demand the guy who stick his dick in you wears a condom. Not that complicated.","post_message":"Patients would also be required to get counseling on celibacy as a valid life choice."},{"comment_id":"1624321510961305","commenter_b":"She's a P I G!","commenter_a":"She has a lot of gall, wearing a crusifix on that neck........","post_message":""}]
