[{"comment_id":"10153099824304753","commenter_b":"This bitch should burn in hell and die of slow painful death","commenter_a":"Look at this demon shaking my damn head","post_message":"She murdered two of her children, one of them in front of her 8-year-old son. At today's custody hearing, she wanted the whole world to know it and was kicked out of the courtroom. What do you think should happen to this woman? @webpagelink"},{"comment_id":"10153240848239087","commenter_b":"So he's trying to hold her accountable.... I think more people need to keep asking the ignored questions...","commenter_a":"I have never seen a grown man act that ridiculous in a public setting. Fucking pussy.","post_message":"Rep. Jim Jordan, chairman of the House Freedom Caucus, got into a heated shouting match with Planned Parenthood president Cecile Richards during today's House Oversight Committee hearing into the nonprofit's use of federal funds. WATCH:"},{"comment_id":"1148884565168237","commenter_b":"Snipers on the borders. Fill the Rio Grande with gators!","commenter_a":"build the wall close our borders down deport illegals out of America.","post_message":"For years, Trump and Bernie have both been saying that immigration policy is RIGGED by corporate special interests who want cheap labor."},{"comment_id":"10154496006728689","commenter_b":"@username I guess you're right with your saying!!","commenter_a":"Many people are saying.....not me, but many people. They might be right. I haven't fully investigated it yet, so I don't know,, but from what I'm hearing from many people........Things, I've heard things. Lot's of things. Not so good things...many bad things,I don't know, but it's what I'm hearing lately, from many people. They could be right. And then what? These things I've heard, from many people. Could be trouble...We're in trouble, folks.","post_message":"WATCH: Donald J. Trump: If Hillary Clinton gets to pick her US Supreme Court judges, \"nothing you can do, folks — although the 2nd Amendment people, maybe there is. I don't know.\" Read full story: @webpagelink"},{"comment_id":"10153899191016770","commenter_b":"another nasty women I guess..","commenter_a":"Real smart people those LDS folks, sarc. Seriously,when the Supreme Court turns liberal full progressive, your little LDS church will be doing homosexual marriages, allowing non Christians to come to your places of worship, oh, I can't imagine the world of hurt the LDS is in for. Oh well, principles and all. Good for you, bless your heart, y'all just so pure as the wind driven snow.","post_message":"Latest Poll: This Conservative State Now Has Trump In Second Place. Wait. What? @webpagelink"},{"comment_id":"1239053882772316","commenter_b":"@username They are ALL connected. Mcain, Obama, Hellary, Bush. If you think it is the \"other party\" that is bad, then they have been successful at controling your mind. The Dem/Rep thin is a HOAX!! Stop blaming obama. He is terrible, but he is just a puppet! Cut the strings of the puppet masters. vote for the guy they hate! Trump!","commenter_a":"As did the decision to try to overthrow Syria by giving unlimited weapons to \"rebels\" of unknown origin.","post_message":"\"Obama's decision to pull the troops out of Iraq may have helped to create ISIS. As did the decision to disband Saddam's army. As did the decision to invade a country that had nothing to do with 9/11.\" -- Jon Stewart @webpagelink"},{"comment_id":"668462060011039","commenter_b":"kick the racist out of here!!!","commenter_a":"Send him to Guantannamo","post_message":"A scandalous tape of Al Sharpton has been released... He's not gonna like this. Let's make it go viral. Sharpton is a complete hypocrite. Who's the racist now? Let's kick Sharpton out of America... NOW!"}]
