[{"comment_id":"10153816896676337","commenter_b":"\"Bitch! Now turn the other cheek!\"","commenter_a":"Jesus needs to come back and give this Pastor a firm pimp hand.","post_message":"The Pastor leading the Starbucks red-cup charge got disconnected and laughed at on TV..."},{"comment_id":"10155788720365405","commenter_b":"What are you smoking Kate!","commenter_a":"Let's all remember that when Reagan was inaugurated, within hours he was greeting our 50+ hostages held in Iran for more than 400 days. Gov. Walker, you may be the one that will greet them in those hours following your inauguration.","post_message":"In this bad Iran deal, Obama has given up a lot and he hasn't even managed to bring back our Americans currently held hostage in Iran's prisons. We have to stop this reckless and irresponsible deal today. Join me in calling on Congress to stop this deal: @webpagelink"},{"comment_id":"367438390047230","commenter_b":"Devora Sexton and you are a cheap whore","commenter_a":"If a man's children and wife are a measure of him, Trump is a hell of a guy.","post_message":"Another reason Dems are terrified..."},{"comment_id":"1060332480688422","commenter_b":"Hillary foreign policy. Iran bad deal. Libya diaster, benghanzi four died on her watched as they pled for help and she wants more illegals and migrants to come in take over country putting our safey and jobs at risk. Voted for Iraq war, a war buillt on lies! Say No to Hillary!!!","commenter_a":"Whether Bernie likes it or not he has no say so over what this country's direction is.","post_message":"Our message in this campaign is of creating a nation and a vision based on social justice economic justice, racial justice, and environmental justice – and whether Donald Trump likes it or not, whether Hillary Clinton likes it or not, that is the future vision of this country."},{"comment_id":"10153207702598967","commenter_b":"That chick in red goes down HARD!!! Hahahaha...","commenter_a":"Outstanding!","post_message":"So silly but so fun"},{"comment_id":"1334294883276632","commenter_b":"What a joke Hillary Clinton is! She's allowed to continue running while there is a fbi criminal investigation?! I wouldn't even be able to apply for a job at McDonald's if I were under a FBI criminal investigation! Nail that bitch!","commenter_a":"the traitorous bitch looks and sounds just like Nixon.","post_message":"BREAKING: Hillary Clinton holds press conference about FBI reopening email probe. VIDEO OF HER STATEMENT: @webpagelink"},{"comment_id":"910206839098639","commenter_b":"How is this funny, what an ignorant woman!!","commenter_a":"Sarah Silverman is a moron who needs to go back to school and learn what the real Hitler was all about.","post_message":"Was this a good idea?"}]
