[{"comment_id":"10154624761426336","commenter_b":"What a dumb woman...","commenter_a":"Its her policy that allows these people in our country to kill us.","post_message":"Hillary Clinton addressed the latest bombings in New York City and New Jersey and emphasized that Donald J. Trump's comments are being used to recruit terrorists. @webpagelink"},{"comment_id":"10152797115634117","commenter_b":"Matthew, most of you gun totters don't have the balls to pull the trigger. But if you need a gun to make you feel like a man, knock yourself out. Guns are there for men who's wives wont let them have a penis truck. Have a nice day.","commenter_a":"And the evil liberal Democrats want to take our guns away because the police are here to protect you.","post_message":"U.S. marshal's effort to censor a citizen's recording was foiled by yet another citizen recording in this small town that collects millions in asset forfeiture revenue."},{"comment_id":"10153829560109062","commenter_b":"Illegals dont fil lout any forms,","commenter_a":"Who tell him Illegal immigrates do not pay taxes, there are special forms most of them pay by the end of the year simce they know if there a possibility to change their status they will have to show they paid taxes... Ignorance makes people say atupid things... sad!!!","post_message":"What do you think of the sign?"},{"comment_id":"1050442818384698","commenter_b":"At the least, his judgement is impaired............his bond to the Clintons got in the way of his judgement.............","commenter_a":"Fire him he is a crook","post_message":"Should James B. Comey, Jr. continue as Director of the Federal Bureau of Investigation? Is he professionally compromised? Does Mr. Comey continue to enjoy the trust and confidence of the American people, the rank-and-file of the FBI, and the thousands of government employees holding security clearances and access to classified information? Read this op-ed by Judicial Watch Director of Investigations Chris Farrell below."},{"comment_id":"10154373849503299","commenter_b":"Said all of us in January of 2009!","commenter_a":"Very good Mr. Claar!","post_message":"\"Had we understood just how clueless they were, the election result might not have been so shocking.\""},{"comment_id":"10153646092561167","commenter_b":"Liberals hate women!!!","commenter_a":"If Megyn Kelly didn't have her looks and her little fued with the Donald to capitalize on she'd be a non issue.","post_message":"Can everyone finally stop pretending Megyn Kelly is any kind of “hard-hitting journalist”?"},{"comment_id":"1032023936930784","commenter_b":"Dear God if people did this to the Obama girls everyone would be pissed","commenter_a":"Sick freaking guy that Spinola..Ugh.","post_message":"Oh, Hell no..."}]
