[{"comment_id":"10153154951847994","commenter_b":"Finally a judge with a brain! you go girl! They should get life but sadly they will have some tear jerking defense and will probably get ten years.","commenter_a":"Wow, this was compelling!!!","post_message":"A judge is furious over the death of a little child -- and she let the suspects hear it. She says watching their police interview footage was more like watching a cable TV show. Read more about the case here: @webpagelink"},{"comment_id":"889632651227311","commenter_b":"She's a dingbat","commenter_a":"Way to meny Hillary lovers. Hate Sarah only because she is a conservative.","post_message":"Trump comes forward with huge announcement about Sarah Palin... You're going to love this. She is a true patriot and will serve our country. Can we get 10,000 'LIKES' for Sarah Palin?"},{"comment_id":"1220911264593201","commenter_b":"@username who is illegal stupid!!!","commenter_a":"FINAL, now THAT is something to celebrate because: #BarackObama is a sociopathic liar, a national disgrace, an enemy of the Constitution, racially divisive, a promoter of black genocide by abortion, denies the threat of radical Islam and then supports that threat, a communist sympathizer and a traitor to civilization. That is his legacy.","post_message":"SATURDAY: Watch President Obama's final White House Correspondents' Dinner - LIVE on C-SPAN (TV) and here on C-SPAN's Facebook page. More here: @webpagelink"},{"comment_id":"1648962245130424","commenter_b":"find a new dick to suck lol","commenter_a":"What will DiCaprio do?","post_message":"This sounds too good to be true!"},{"comment_id":"10153861358541680","commenter_b":"@username killary has had her head inside hitlers butt","commenter_a":"He'd tap that","post_message":"President Bill Clinton and Melania Trump greet one another before the first presidential debate begins."},{"comment_id":"10153335992009071","commenter_b":"Malia Young-Williams","commenter_a":"Omar Kashmir","post_message":"We tried Shake Shack’s new Chick-fil-A killer."},{"comment_id":"502143199967560","commenter_b":"I wouldn't even give her the Cleveland steamer","commenter_a":"That's a face you could donkey punch.","post_message":"She makes it official!"}]
