[{"comment_id":"10153155550251051","commenter_b":"Oh Erika bitch still has vagina","commenter_a":"HUGE.....SORRY ISRAEL...OUR PRESIDENT IS SETTING US UP FOR WAR....SORRY HES SUCH AN EVIL P.O.S....an i for one stand with my people an Israel....suk it obama....rot!!!!!","post_message":"Israel came out and called President Obama's nuclear deal with Iran a big mistake. Here's how they're going to respond to it. Do you agree or disagree with the idea that the Iran deal is a mistake?"},{"comment_id":"1236456179783965","commenter_b":"I was expecting a stripper jump on a pole. Boring.","commenter_a":"Nice speech, all lies","post_message":"Melania Trump speaks at the Republican National Convention. Watch the full live stream here: @webpagelink"},{"comment_id":"910291425675761","commenter_b":"Throw her out of the white house.","commenter_a":"let the book burnings begin..then kristellnacht...then relocation camps","post_message":"Are you at all surprised by this?"},{"comment_id":"10153330049981159","commenter_b":"Really? Whatever lady....","commenter_a":"No.","post_message":"Would you support this kind of bill in your state?"},{"comment_id":"10153344147357439","commenter_b":"Lol is that where Muslims come from? Wow didn't know that!","commenter_a":"Send them back to Egypt.","post_message":"DC Area Professor To Catholic University: Too Many Crosses On Campus For Muslim Students To Pray @webpagelink Anywhere American law and Islamic law conflict, it's American law the inevitably has to give way. These demands for special accommodation are everywhere. Hertz, Heinz, Costco, IKEA, Target, Wal-mart, Disneyland, McDonalds and hundreds of others have all been in the cross-hairs. Islamic demands and the ensuing lawsuits in order to impose sharia...."},{"comment_id":"1799616930271434","commenter_b":"Liar!","commenter_a":"The more she says it the less I believe it.","post_message":"\"Certainly my meeting with President Bill Clinton raises questions and concerns.\" Attorney General Loretta Lynch says says she will accept the recommendations of the FBI on whether to pursue charges against Hillary Clinton."},{"comment_id":"1550216494995180","commenter_b":"I think Parkinsons...she looks like hell in that picture. Go home Killary and be a grandma","commenter_a":"I don't get the whole thing of her making appearances looking like a crazy cat lady. She's either sick, gone off the deep end, or trying to pull something. I don't know which, but she really just needs to find something else to do. She can still have a full life, but this is over.","post_message":"“As a Democrat, I am frustrated and ashamed. Unlike Hillary Clinton, I realize that America’s history was built not just on its gallant winners but also on its noble losers.” — Bryan Dean Wright, former CIA ops officer and member of the Democratic Party"}]
