[{"comment_id":"1610722349214878","commenter_b":"wow beautiful.......","commenter_a":"Beautiful","post_message":"Wow. I've got chills. God is so good."},{"comment_id":"933475353412186","commenter_b":"Somebody needs to fuck her ass up","commenter_a":"Elisabeth Hasselbeck is a no talent bimbo. She is a racist a bigot and just an unpleasant pain is n the ... Neck! Her claim to fame is that she was on Survivor and clung to an older gentleman who did everything for her and protected her. How is she qualified to open her ignorant mouth about anything political??? Typical Fox bleached blonde snotty witch! Yuck! She was fired from The View because she was so nasty and bigoted.","post_message":"This is superbly offensive."},{"comment_id":"10152960138411051","commenter_b":"Good woman","commenter_a":"I would do that too. He deserved to be punished for that horrible incident. Great mom.","post_message":"As soon as this teen's mother saw the pictures that were being circulated, she immediately grabbed him and dragged him to the police station."},{"comment_id":"1399324063479459","commenter_b":"Put her away","commenter_a":"Karma!!!","post_message":"She got what was coming to her and then some. Excellent! People who treat cops like dirt should absolutely be called out and held accountable."},{"comment_id":"10154493195323132","commenter_b":"@username Do you believe everything that you read on the interwebs? And why are you so gung ho about defending Schumer? Or are you simply into fat chicks?","commenter_a":"Is anyone here a marine biologist? We have a beached whale on our hands!","post_message":"Amy Schumer, Kate Hudson and Goldie Hawn are the epitome of squad goals on their Hawaiian vacation."},{"comment_id":"1113814495365780","commenter_b":"@username Illegal immigrants cost taxpayers money and jobs as well as their lives.","commenter_a":"American taxpayers are spending over $130 Billion a year on welfare programs for illegal immigrants and that doesn't include prison for the felons.","post_message":"American taxpayers have already spent billions of dollars on border security, including a 700-mile long physical barrier along the southern border."},{"comment_id":"1230909136991106","commenter_b":"👌 well done my counterpart.","commenter_a":"Ill leave this here.","post_message":"Sad, but true..."}]
