[{"comment_id":"1064358433623633","commenter_b":"TRUMP GO back TO Hell","commenter_a":"Can these idiots be any more reprehensible?! The Repugs care only about the top 1%.","post_message":"The right's hostility toward the working poor is now front and center."},{"comment_id":"814269158659286","commenter_b":"Oh really!","commenter_a":"My sister became an alcohol by drinking at home, the drink prepared by her husband before he went out with other women.","post_message":"Some point to our liberty in Christ, but is it wisdom to consume alcohol? One pastor sounds off."},{"comment_id":"10153470330831130","commenter_b":"Divorce first, then be a whore.","commenter_a":"To y'all bashing her.. this line right here says it all, \"In my marriage, I felt alone.\" - Divorce was inevitable. Period. THEN it says she met him when she was 17, they dated while she was in college, and got married once she graduated. Can you imagine if you married the person you dated at 17? It wouldn't work for a LOT of people.","post_message":"\"And just like that, my plans to spend the rest of my life with the man I loved and my best friend were crushed.\""},{"comment_id":"10153509665060950","commenter_b":"I'm sorry but that doesn't even sound right. The solution that they put the fetus in does not destroy it. If that was the case every placenta, product of conception, etc, would be destroyed! Most product/tissue that comes from one's body goes into some sort of formalin. And about them giving you back tissue/poc, that will never happen. I don't believe any hospital will be like oh here, you can have your 19 week demised fetus. It's not going to happen.. That's like saying you want your uterus when they take it out. Someone told you a load of crap if that is really what transpired.","commenter_a":"I find that hard to believe. They have protocols to follow when it comes to medical waste. Right? (I honestly believe they do)","post_message":"The woman claims as she screamed for the employee to stop, she could see the face of her child as it was flushed."},{"comment_id":"568744853313807","commenter_b":"Take her welfare away from her and force her 2 get a job!","commenter_a":"Their parents must be total Pieces of shlt","post_message":"Did this idiot DESERVE this?"},{"comment_id":"10154374594014087","commenter_b":"All other respectable women","commenter_a":"don't grab your pussy hahaha I dought there is a worry there.","post_message":"\"After months of attacks against women and minorities, women grab back.\""},{"comment_id":"10153889847128132","commenter_b":"Da devil is a lie she outta pocket no excuse non of that","commenter_a":"Well this explains a lot. If you have people like her working in child services, no wonder the children are left in abusive situations and no wonder society is grieving for them as they plant their innocent bodies in the earth--a sad day it is","post_message":"So horrifying."}]
