[{"comment_id":"953112161448505","commenter_b":"Women.Stop having sex without condoms....","commenter_a":"Women. Stop having sex with Republicans.","post_message":"Sen. Elizabeth Warren has a powerful message for the Republicans that just voted to defund Planned Parenthood. Pass it on! Read more here: @webpagelink Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1193174800771119","commenter_b":"@username and deport them","commenter_a":"Sounds to me like she's taken some pages out of Hitlers book: Meine Kaumph. Don't know if that is spelled right, but you get the idea. And I wonder how she'll feel about it when she reaches 80. (if she ever does).","post_message":"What's up with leftists having no problem 'taking people out'?"},{"comment_id":"10155896308790354","commenter_b":"I don't know about you folks but I'm sure getting tired of these niggers.","commenter_a":"Buy them a fucken air conditioner, get the money from Jackson's Toyota ripoff !","post_message":"***THIS JUST IN*** The environment is racist!"},{"comment_id":"10152958677570927","commenter_b":"If it was that bad! Why isn't the border fence leaning toward the South! Someone will gladly take your number!","commenter_a":"Another stupid comment from the Peanut gallery","post_message":""},{"comment_id":"756504414454641","commenter_b":"Ridiculous. Keep them out at all costs","commenter_a":"I'll sell them to them","post_message":"One company that produces razor wire actually turned down a contract with the Hungarian government that would have brought them over a half-million Euros in revenue."},{"comment_id":"10153664452407183","commenter_b":"Very good comment !!!","commenter_a":"Mr. Robertson you do know that the Bible is a compilation of 66 books and letters written by more than 40 authors during a period of approximately 1,500 years. Its original text was communicated in just three languages. The Bible's authors were very human and may have been inspired by what they understood to be God's words, thoughts, actions. These 40 individuals came from various walks of life. Moses was probably the most educated, while the others were shepherds who became the King of Israel (David), farmers, fisherman and warriors. These earliest accounts were handed on from generation to generation in songs, narratives, and poetry. In those early societies there was no writing as yet and people passed on these oral accounts and with that the stories are exaggerated, changed, misrepresented, and contradictions, so we admit the humans creating the bible were not infallible or God is bi-polar. The creation ...","post_message":"Who knew that being kind to gays was a death sentence?"},{"comment_id":"759110204189419","commenter_b":"@username Don't come to America, lol","commenter_a":"Here's a counterpoint. If you un-sexualize all body parts no one will want sex as, hey that's just a hand and that a boob and that a....Well maybe this is what we need then to decrease the enlarged...population, LOL! Truth is, I don't respect anyone who sells themselves. Even a little bit.","post_message":"Women everywhere are freeing the nipple but Facebook doesn't want us to show it. #MicCheckDaily"}]
