[{"comment_id":"1050293421764665","commenter_b":"Good thing? To leave 20 million with no health care? Who are you? Scrooge? Let the excess population die? WWJD. I will not battle here.","commenter_a":"I am a constituent of yours. Let me tell you how hard I am going to work to make sure you are never re-elected! How dare you dismantle the ACA in the late night sessions. How dare you de fund the UN!","post_message":"This was John Kerry and President Obama taking a slap at Israel. I think most Americans believe that the United Nations has become more anti-Semitic, more anti-Israeli. We're going to stop the US money to the UN until we get this fixed."},{"comment_id":"10154590709007955","commenter_b":"Of course. He has already done a lot for the USA. Keep going President Trump. Pay no attention to the meaningless leftists.","commenter_a":"absolutely","post_message":"Do you think Americans need to give Trump more of a chance to succeed as president?"},{"comment_id":"10154282562893797","commenter_b":"Get rid of her dumb A S S","commenter_a":"Have her arrested and charged her for treason!","post_message":"BAN OVERTURNED: A school principal banned Santa, Thanksgiving and the Pledge of Allegiance at her school. However, the Department of Education wasn't having any of that. And now, some have started an online petition to remove Eujin Jaela Kim as principal."},{"comment_id":"10154253294384486","commenter_b":"Jack, this heartless bitch is worse than an animal","commenter_a":"make no mistake,this is an animal","post_message":"Only 12,000 more signatures needed...."},{"comment_id":"10153168410293690","commenter_b":"In ind had been an individual liber,on account of each mob should be admit each religion.its actual substance,besides already has recognized via Basic R8s","commenter_a":"Its expected from modi sarkar, as he has the record of massacaring muslims in Gujrat..","post_message":"Are India minorities under attack? Christians and Muslims say the government is not doing enough to protect them from hardline Hindus. But is prime minister Narendra Modi being compromised by his nationalist roots? @webpagelink"},{"comment_id":"474793122711268","commenter_b":"NIGGA you need to go back to Kenya, and fucken stay there.","commenter_a":"I was not born in England why don't Odumber go back to Kenya where he was born. He is such a idiot they probably don't want him back.","post_message":"The President just said 'all white people should go back to England'. This is outrageous, and just plain racist. 'LIKE' if you agree!"},{"comment_id":"10154485862326037","commenter_b":"Sure, if you choose to believe the people in collusion with the election fraud.","commenter_a":"If you wanted unity, you should have allowed the voters to choose the nominee instead of allowing your corporate masters to do it.","post_message":"DNC chair Marcia Fudge calls for unity amid a chorus of boos and jeers from Bernie Sanders supporters: \"We're all democrats\""}]
