[{"comment_id":"955289837857113","commenter_b":"How about we start with u lady . What a Moron!","commenter_a":"She should start with herself.","post_message":"(Video) 2 lies woven together to justify depopulating the Earth... Full Story: @webpagelink"},{"comment_id":"10153515225917994","commenter_b":"Then leave the country!!!!","commenter_a":"Another flag that represents racism and hatred.","post_message":"Confederate flags: History or discrimination?"},{"comment_id":"10150611422369999","commenter_b":"The south wants to keep it.....FLY IT HIGH SOUTHERNERS WHO ARE PROUD OF THEIR HERITAGE KEEPING STATE RIGHTS.","commenter_a":"It's a VA battle flag....why was SC flying it? oh yeah, State's rights were taken away...sad so many people think that war was over nothing but slavery...I'm a history major....would never fly it but I know what it's true purpose is...Those who had confederate soldiers die in their family still use it....KKK ruined it and so did this fool....","post_message":"Breaking News: Gov. Nikki Haley of South Carolina called for removal of a Confederate battle flag from the State Capitol grounds after the white man accused of killing 9 black people was seen brandishing that flag in widely circulated pictures. “It’s time to move the flag from the Capitol grounds,” the governor said."},{"comment_id":"10153623967716323","commenter_b":"This is the best thing ever said. Ever.","commenter_a":"Uniting all parts of Yorkshire could be a bad idea. If it took our fancy we could go game of thrones on your arse!","post_message":"\"Pit a bunch of Yorkshire folk against outsiders and they’ll all chunter on about how chuffing brilliant God’s Own County is. Put a Bradfordian, a Sheffielder, a Yorkie and a Leeds lad in the same room, however, and they’ll argue about their football teams, the relative quality of their beer, the beauty of their landscape and women, and everything in between. Often all that will unite them is a shared disdain for Hull.\" Full disclosure: Helen Pidd is from Lancashire."},{"comment_id":"1738569013030719","commenter_b":"Hoe","commenter_a":"Alex Keira Keir Craig","post_message":"I'm gonna make love in this Snapstory with you, Usher."},{"comment_id":"10154675817978984","commenter_b":"@username, she broke the law dumbass.","commenter_a":"Good for her. We should be thanking her not vilifying her.","post_message":"This presidential candidate was just busted ON CAMERA for doing the unthinkable. Supporters never saw this coming..."},{"comment_id":"10154250951204641","commenter_b":"Ok, u say it's a choice so that person chose to have unprotected sex and got prego. Who's fault is that. That child didn't ask to be killed because of their parent made a choice to not put a condominium on. The consequence of having unprotected sex is a baby. If u don't want to have a baby don't have sex. Abortion us an e cause to not take respinsibilty for ur actions. Abortion isn't safe. It leaves scared emotionally.","commenter_a":"If you don't want an abortion fine, but who the hell are you to tell another person who is getting a safe procedure by professionals what they can or can not do to there bodies? What if someone was raped, low financial income, mentally unstable, or if the pregnancy was unsafe for mother and baby? Explain that to your petty beliefs of striping women of he right TO THEIR OWN BODIES!!","post_message":"The 5-3 ruling is the most significant decision from the U.S. Supreme Court on abortion in two decades and could serve to deter other states from passing so-called \"clinic shutdown\" laws."}]
