[{"comment_id":"571634943014885","commenter_b":"Ya 10 ft wall and make mexico pay for it that wall will never be build","commenter_a":"@username to fucking childish.","post_message":"After vowing to take the high road during his presidential campaign, Marco Rubio changes his stance on making personal attacks against Donald J. Trump. ►Watch last night's full episode: @webpagelink"},{"comment_id":"486290274888721","commenter_b":"Bernie sit yo old ass down u is not gonna win nother","commenter_a":"it's beneficial being educated in this!","post_message":"There is a BIG difference!"},{"comment_id":"10153140087886037","commenter_b":"@username I have a friend who works as an ICE agent and their hands are often tied when getting rid of criminals and they already deport the serious criminals.","commenter_a":"My mother-in-law went through the process legally and in November she took the oath. She took the process seriously, learning US history, learning english, and working hard to pay the fees. Freely handing out citizenship is an insult to those who went through the process legally. Laws are put in place for a reason, we cant pick and choose which ones we follow. And the President can't be allowed to give millions of people citizenship when it goes against our laws. I don't care if the president is Democrat or Republican, this is not legal.","post_message":"Confident Obama predicts success in immigration appeal, has message for millions facing possible deportation @webpagelink"},{"comment_id":"1376905028996190","commenter_b":"Once you build the real fence, you will also be a target of terrorist!","commenter_a":"Hypocrisy","post_message":"The agency said it intends to begin building a “taller, stronger” fence to protect the White House grounds by 2018. via NBC Washington"},{"comment_id":"864428380327492","commenter_b":"Ruth, you're an idiot.","commenter_a":"Just proves they hate women and wish we were their slaves ... can't believe we have to fight for human rights for women still .. please tell me why anyone voted for this disaster","post_message":"Republicans will move to strip all federal funding for Planned Parenthood as part of the process to dismantle Obamacare, House Speaker Paul Ryan said"},{"comment_id":"10154069182538128","commenter_b":"You're disgusting!","commenter_a":"Disgusting crap Chris Rock!!","post_message":"Chris Rock didn’t waste any time diving into the controversy over the lack of diversity at this year’s Academy Awards."},{"comment_id":"10153712165499138","commenter_b":"I'm not a hunter, however, anyone who eats meat has no right to be against hunting your own meat. At least the animals being hunted have a chance and have a good life in the wild. Anyone who eats grocery store meat should try going to the farm that the meat came from, those animals have it far worse than a dear dying from a quick shot.","commenter_a":"Stop this hunting that's what he gets","post_message":"A reminder worth sharing. Have a safe hunting season."}]
