[{"comment_id":"1858429714391337","commenter_b":"Canadian has no say. Go home","commenter_a":"He's a fat, ugly, ignorant pig. Hit the sty.","post_message":"Simply pathetic."},{"comment_id":"1588290287878104","commenter_b":"Russia is THE ENEMY because the DoD NEEDS to create a paper tiger to keep the world's most bloated military budget fat. Stay conned. Iran is also a made up enemy.","commenter_a":"We are with you President Obama, if you could have run it would have been a third majority vote and we wouldn't all be afraid of what is to come. Russia is our advisary not our friend, stupid people. Thank you for the eight years you have had to put up with the worst Congress in history.","post_message":"In addition, sanctions will be placed on Russia’s two leading intelligence services."},{"comment_id":"10153680623219087","commenter_b":"@username Why should the gun industry be the only industry in our country to be granted blanket immunity?","commenter_a":"Ah yes, @username ready to go with its latest Bernie slam piece right after he wins Wisconsin and right after they post an article praising Hillary's graceful concession. Quality, non-agenda-filled journalism, lads and ladies.","post_message":"\"Shame on you, @BernieSanders try living one hour of our lives. Love, the #SandyHook Principal's Daughter,\" Erica Smegielski tweeted with links to the front page of Wednesday’s New York Daily News, with a headline reading: Bernie’s Sandy Hook Shame."},{"comment_id":"10152536753022377","commenter_b":"Pay back is hell Nancy you POS witch..","commenter_a":"tell pelosie to fk off s hes disguisting pos let pic cotton","post_message":"Trending Now..."},{"comment_id":"590256634486210","commenter_b":"Haha america was never great and with you or Hilary as our president it will continue to never be great !","commenter_a":" Vote strong Vote Trump","post_message":"This is only the beginning. Hillary is CROOKED! She is not capable of making America great again. Sadly, she would do the opposite."},{"comment_id":"499431526914094","commenter_b":"Leave our flag alone!","commenter_a":"I think the old saying is true. If It ain't broke, don't fix it!","post_message":"The American flag might be redesigned, see here. No one should touch the flag. It is the symbol of the greatest country on earth. Do you agree no one has the right to change the American Flag?"},{"comment_id":"10153206290841037","commenter_b":"And burn all the racist people in America","commenter_a":"burn all the bibles, korans, and any other religious text. They are blights.","post_message":"After being falsely accused of burning a Quran, Farkhunda was beaten, run over with a car and burned before her body was thrown into the Kabul River."}]
