[{"comment_id":"1175985589130223","commenter_b":"Eww she be ugly scary","commenter_a":"why is this infidel a councilwoman in the first place???","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"10153509244088854","commenter_b":"Go home!!","commenter_a":"Don't let the hit you in the behind when you leave","post_message":"Obama Claims He’d Be Treated Better In Europe, Whines About “Names I’m Called” In America..."},{"comment_id":"10153348611360950","commenter_b":"And he got arrested? For what? Bitch probably asked for it","commenter_a":"NEEDLE TIME NOW. Not 50 years later.","post_message":"Officials believe the 19-year-old suspect was upset over \"a bad breakup\" with the victim's teen daughter. Police say he confronted the mother as she was leaving her car, shot her multiple times and then went inside her home and fatally shot a dog."},{"comment_id":"881610245305235","commenter_b":"She is skanky.","commenter_a":"Megyn Kelly is a waste of human potential. A bright and flashy exterior but of little inner substance.","post_message":""},{"comment_id":"1287415054614429","commenter_b":"@username If SCOTUS is majority conservative, and I'm sure it will be, they won't overturn any of this because they don't care about the wellbeing of this country or its people.","commenter_a":"Wanna bet? First, women have been ending pregnancies for millenia and nothing the Kentucky Legislature can do about that. Second, with Roe V Wade the law of the land, any attempts to ban abortion will be overturned. Third, the so-called \"pro-lifers\" will not always be in total control of Kentucky and what this Legislature might pass can just as easily be thrown out.","post_message":"For the first time in 95 years, Republicans took total control over the Kentucky state government this week and immediately moved to strip rights from women and workers."},{"comment_id":"10152826905226130","commenter_b":"Lisa Longbine you are without a doubt one of the biggest tools of society. Why dont you do some research before sounding even more ignorant than you already do. Measels is on the rise mostly due to the huge amount of diseased illegals entering the country by the millions. Due some research tool...","commenter_a":"There's a reason why people don't want their kids getting vaccinated. The fact that their daughter can't get vaccinated is proof enough that they're dangerous","post_message":"My daughter has cancer. Your unvaccinated kid put her in danger. Here’s what I have to say to you."},{"comment_id":"10152725934094071","commenter_b":"My manager told me \"if you want my position, you might need more than a Master degree, or probably more than one Master. Plus 10+ years of experience as manager\"... So spare me this story, its not the 80's anymore.","commenter_a":"Ain't that the farkin truth!!","post_message":"You don't have to earn an MBA to become a great manager."}]
