[{"comment_id":"10153526411091350","commenter_b":"I don't eat in private, why should my kid have to? Most women who choose to bf in public are so good at it, you don't even notice, so don't wore about averting your eyes. When I'm at target I'm busy shopping not looking for a nip slip.","commenter_a":"I completely support breastfeeding mothers but would prefer not to see it happening while shopping. Target should be providing private respectable areas for this if they really supported breastfeeding moms.","post_message":" policy supports breastfeeding in any area of our stores, including our fitting rooms, even if others are waiting. See why moms are swooning over the retailer breastfeeding policy."},{"comment_id":"10153918741113854","commenter_b":"@username You stupid racist the C word that women don't like! Will be glad when people like you die out!!!!!!!!!!!!!!","commenter_a":"Barack Obama has done NOTHING to improve this country....he has improved his own lifestyle at our expense!","post_message":""},{"comment_id":"10153811887041770","commenter_b":"I never liked Nancy until I saw her genuine love and grief for the loss of her Husband.","commenter_a":"Well honey you know everybody laughed at Ronald Reagan because he was a movie star not a reality star cuz they didn't have that back then but he was still a movie star and they all laughed at him but guess what he broke down the wall he made this country great he made us unified and we love him and we love Nancy for The Classy wonderful woman that she was. Can we actually say that about what's an office now?","post_message":"Ann Coulter: “Why couldn’t it be a more genteel, a more elegant person like Mitt Romney. But as soon as you think that to yourself, you realize that is a creature that doesn’t exist in nature. For the attacks that Trump has come under, you have to be a tacky reality-TV star.”"},{"comment_id":"1758834931015826","commenter_b":"A dude with a dick is what he is!!! Let's call a Ace an Ace & a spade a spade now!!","commenter_a":"Oh fuck this bullshit! Enough already! You're a chick with a dick we get it, not the first, nor the last. Ever been to fucking Thailand? Loaded with these fuckin things. Better looking too.","post_message":""},{"comment_id":"10154455818619705","commenter_b":"She referred specifically to people who are \" ..racist, sexist, homophobic, xenophobic, Islamophobic.\" If you don't find those things deplorable then you're in the basket and you might as well wear the shirt so the rest of us can more easily identify you.","commenter_a":"Trump supporters take being referred to as \"deplorables\" like a badge of honor","post_message":"The shirts stem from a comment Democratic presidential nominee Hillary Clinton made at a fundraiser."},{"comment_id":"453758594748735","commenter_b":"Hey Keith when leeches use my hard earned money to live it's my right to how it's used so STFU!","commenter_a":"Look at it this way, if they can afford to go on cruises, go to psychics and buy liquor, then they don't need to be on welfare.","post_message":"This state just banned welfare recipients from spending their benefits on cruises and tattoos - and officials didn't stop there."},{"comment_id":"10152892433531051","commenter_b":"What about the elderly and the disabled you stupid bitch.","commenter_a":"If you don't have Children, You shouldn't be drawing food Stamps!!\"","post_message":"This state just kicked 9,000 people off food stamps."}]
