[{"comment_id":"10153816896676337","commenter_b":"\"Bitch! Now turn the other cheek!\"","commenter_a":"Jesus needs to come back and give this Pastor a firm pimp hand.","post_message":"The Pastor leading the Starbucks red-cup charge got disconnected and laughed at on TV..."},{"comment_id":"10155084101790329","commenter_b":"LOL she's too real","commenter_a":"@username LMFAO BYE","post_message":"The best answer to the infamous question we've ever heard."},{"comment_id":"622131437962489","commenter_b":"That's a women? Wtf","commenter_a":"Stevo Reed bruh","post_message":"Freddie Gray’s mother Gloria Darden pledged to keep fighting for her son after news broke that all remaining cases against the officers charged with his arrest and death would be dropped: @webpagelink"},{"comment_id":"10153950706953132","commenter_b":"This is why people suck.. who the hell does that?? why??? WTF.. really man!!????","commenter_a":"Autumn Baker","post_message":"But it's the little boy who won the game."},{"comment_id":"1833287473397659","commenter_b":"Its being kept running by immigrants as it has, its a shortage of money and a deliberate government policy to ruin the NHS so all the Tory dirctors of private health care can ride in and cherry pick the best parts and leave a dead carcass for the rest of us to fund.","commenter_a":"It's simply because the government has closed too many hospitals. That's the only reason.","post_message":"Worst NHS week in 15 years"},{"comment_id":"10151087068944999","commenter_b":"ALL ILLEGALS LEAVE AMERICA NOW!","commenter_a":"I wonder how many of them are legal immigrants. What's wrong with deporting illegal immigrants?","post_message":"On Thursday, foreign-born residents stayed home, or took to the streets, in protest of President Trump's immigration policies."},{"comment_id":"1857128867864045","commenter_b":"What about the insane amount of lying going on in the White House right now? I haven't heard you talking about that.","commenter_a":"So lame.","post_message":"Please check out our 2nd Facebook live town hall right here!"}]
