[{"comment_id":"460052980821324","commenter_b":"Put the pussy on the chain-wax","commenter_a":"This headline is complete and utter garbage click bait bullshit. Mumford & Sons had nothing to do with THE CITIES/RESIDENTS. You can't blame a band for the amount of fans they attract, they're grammy award winning musciams coming of a 2 year hiatus after releasng a long awaited album. The city is the problem here for using this \"cleanout method\" which they are literally treating these people, HUMAN BEINGS, like trash and obviously have no problem using terms that state that. Blame the city not the band, oh and actually read the article.","post_message":"Not cool."},{"comment_id":"10158515262905725","commenter_b":"Gomez u bitch u","commenter_a":"fukin who're","post_message":"All eyes were on Melania as she stepped into the ballroom."},{"comment_id":"1694550140816786","commenter_b":"Misogyny!... misogyny everywhere!","commenter_a":"RIP, Chyna. But in your next life don't be a wrestler and a pornstar. Two terrible choices for a woman.","post_message":"She was known as the \"Ninth Wonder of the World\". #RIPChyna"},{"comment_id":"410359492488277","commenter_b":"It's simple women why treat guys like crap then want to be with him poor guy didn't get none for years and this happen f all the women in the world cause if he look like Enrique Iglesias you will give it to him if he was in the street another story","commenter_a":"10 year in jail for him, at this age, is life imprisonment.","post_message":"If convicted, Bill Cosby faces up to 10 years in jail and a $25,000 fine."},{"comment_id":"10153362420896028","commenter_b":"I and many Americans clearly disagree.","commenter_a":"Obama: You are a historic disgrace. No President in US history has ever approached the safety of Americans with the level of smug indifference that you do. You are soft on Muslim terrorists and degrading to Christians and Jews. You golf through American beheadings and yawn away the deaths of Americans at Islamic hands. You have ZERO Moral Authority.And we look forward to reminding you of that until the last second you leave office. Signed, True Americans... :D","post_message":"UPDATE 5:45 p.m. PST: Our livestream has ended. \"I know that after so much war, many Americans are asking whether we are confronted by a cancer that has no immediate cure,\" he said. Read more: @webpagelink WATCH LIVE: President Obama to address nation on San Bernardino mass shooting from the Oval Office @webpagelink"},{"comment_id":"472553692939711","commenter_b":"No.. She's Stupid.","commenter_a":"There is no way she is that stupid... I don't believe anyone can be that stupid! Her motive is to make ISIS sound misunderstood, to make you hesitate, and allow ISIS to grow. She is like Obama, is helping their brothers is arms, ISIS.","post_message":"I honestly don't even know where to start with this. It is absurd beyond belief."},{"comment_id":"1039851232779934","commenter_b":"Leave the poor girl along. ..she's retarded","commenter_a":"No. She has been lied about for years!! Republicans can't stand a strong woman with brains!! Gotta tear them down. They prefer mindless, brainless twits like Michelle Bachman and Sarah Palin.","post_message":"Answer with a simple 'yes' or 'no': Is Hillary Clinton corrupt?"}]
