[{"comment_id":"10153064906873984","commenter_b":"Providing we can sue you - You don't even secure the borders .","commenter_a":"Another Hitler.With his name being Barrack Hussein Obama,what do you expect. He's proud of his name,and being a Muslim.","post_message":"A government in control of all cyber space is slowly taking shape. Consider yourself warned."},{"comment_id":"1159671620816281","commenter_b":"Why didn't you keep your promise and leave this country? Because you were so sure Hillary was going to win! LOL just please shut up! Get over it! Do you think it you keep going on &. On, things ar going to change? NOT!!!","commenter_a":"Ted danson probably gags thinking of his past. Yes,he used to do the deed with that😁","post_message":"Whoopi definitely gets what she has coming after she made this dim-witted attempt to insult Trump. She so deserves the humiliation. Let's get 5,000 'LIKES' to show that America wants \"The View\" CANCELLED PERMANENTLY! @webpagelink"},{"comment_id":"10154346331578812","commenter_b":"I love the sons of Diana and Charles.. The babies are as sweet as can be..long live the queen","commenter_a":"So cute x","post_message":"Prince George is allowed to stay up 15 minutes past his bedtime to meet the Obamas at Kensington Palace dinner."},{"comment_id":"10154164118946167","commenter_b":"Legal immigrants!","commenter_a":"There has got to be individual discretion involved in these cases. It's ridiculous. We are a nation of immigrants. We all come from an immigrant somewhere down the line!","post_message":"A Cambodian-American spoke out today about how inhumane Trump's immigration rhetoric is. This is an interview that a lot of people need to see."},{"comment_id":"10152660516532894","commenter_b":"After u,dumb bitch!","commenter_a":"Girl,run b4 they kill u! Run girl! Run!!!!!","post_message":"Look at God: 26-Year-Old Mother of 4 Quit McDonald's Job to Take Care of Her Disabled Son, Hits $561.4 Million Powerball Jackpot"},{"comment_id":"1229861343720720","commenter_b":"She would govern effectively by not selling out, like HRC did decades ago and like Sanders never did during his campaign. #JillNotShill","commenter_a":"I have liked her page.I'm trying to research her. I have ave some reservations. If she were to win how could she govern effectively? With zero green party reps and senators to assist her. For the green party to be effective we would need down ticket victories also. I don't like Hillary Clinton! I absolutely fear Donald Trump. Voting green in 2000 gave us GWB. That is NOT debatable those that don't accept that are just in denial. Jill's platform is in accordance with my beliefs. I do think that her promise to put Snowden on her cabinet is pure pandering. That troubles me. Voting my conscience would be horrible if it means a Trump presidency.NOTHING COULD BE WORSE! !!","post_message":"Dr. Cornel West on the morally bankrupt DNC Platform: \"There's no way for me, as a human being, a teacher & a citizen - if we can't say a word about TPP, if we can't talk about Medicare for All explicitly, if the greatest prophetic voice dealing with impending ecological catastrophe can hardly win a vote, & if we can't even acknowledge occupation as something that's real for a slice of humanity... there's no way in good conscience I could say 'take it to the next stage!' I wasn't raised like that. That's not my calling. I'm just being truthful. It'd be a violation of my own limited sense of moral integrity and spiritual conscience. That's how I roll.\""},{"comment_id":"1607924772836368","commenter_b":"Yes young lady you can , just don't lie to the FBI , don't help rapist do 10 months for raping a 12 year old, don't stay with a man who had many affairs. There Are many women who can be great presidents , Hillary just isn't one.","commenter_a":"Not if you win Hillary! I fear that your election might irrevocably tarnish the idea of female presidency... Bear in mind of course, that we have to deal with a reality where people automatically stereotype and generalise...","post_message":""}]
