[{"comment_id":"1536355363064383","commenter_b":"I can go tomorrow bitch","commenter_a":"Uriel Campos explains it all","post_message":"\"I don't think I've ever been without sex for as long as I have now.\""},{"comment_id":"10154074342184087","commenter_b":"This woman is demented and willing to win at any price including a race war. I support Trump and I fought America's wars for forty three years from a 17 year old poverty stricken high school dropout to a sixty year old colonel with several academic degrees. I also was a first generation American but also have Native American DNA from my French Canadian and Micmac side. Demonizing me and belittling my service which included the Cuban Missile Blockade, Vietnam, Cold war Germany, Panama, the Gulf War. Bosnia and support for the Iraq War; is the best this lying, corrupt, sick loon can do.","commenter_a":"Generally speaking, 100% of what comes out of Hillary Clinton's mouth is deplorable......","post_message":"\"You know, just to be grossly generalist, you could put half of Trump’s supporters into what I call the basket of deplorables,\" Hillary Clinton said. \"The racist, sexist, homophobic, xenophobic, Islamaphobic — you name it.\""},{"comment_id":"1350025431679743","commenter_b":"Lmaoo thats why i say i cant be no girl","commenter_a":"See Babe Its Not Easy Being A Girl @username","post_message":"Women shouldn't have to spend a fortune on bras. Like ATTN: on Facebook."},{"comment_id":"10153500362571770","commenter_b":"The world does not have a right to illegally enter the United States. The American people have appealed to Congress for years to secure the southern border so that we could then begin to address the issue of the illegals already in the country. That could have at one time meant some sort of arrangement for them to stay legally. But Congress did nothing because the WSJ, the Chamber of Congress and the business world wanted a supply of illegal, off the books, low wage slaves while others long for a utopian open borders world. It's time to bend our politicians to our will. We need to send the message, secure the borders or pay the price come election day.","commenter_a":"make sure they're all legal!!!","post_message":"A new coalition of Latino groups and labor unions aimed at stopping Donald Trump from becoming president will begin holding voter registration drives at high schools in battleground states."},{"comment_id":"703541823169729","commenter_b":"Both of the girls always look miserable !","commenter_a":"You tell a bunch of things that aren't true . Please people","post_message":"Malia Obama at the center of damning White House scandal. The whole family is a disgrace. This is ridiculous. Do you think the Obama family is the worst presidential family in history?"},{"comment_id":"1402181823177264","commenter_b":"He wants all Muslim refugees to stay there......","commenter_a":"GOOD FOR THEM , EVERY STATE IN THE UNION SHOULD DO THIS !!","post_message":"Victory for the Constitution!!"},{"comment_id":"10154858734646002","commenter_b":"@username I was shocked at the same thought, why would Disney have a man made Lake that wasn't somehow protected from alligators with a border fence ?!?! We've been there, never thought about alligators because it's Disney, they have safety rules and barriers everywhere.","commenter_a":"So let me get this straight ... Another parent is not watching their child in an area where it clearly says NO SWIMMING so now we are killing alligators for feeding in their habitat where once again it SAYS NO SWIMMING!! What is wrong with people ?!","post_message":"\"We have been to Yellowstone and encountered grizzly bears, but this is just freaky.\""}]
