[{"comment_id":"10153443482053352","commenter_b":"He knew that bitch was cazey","commenter_a":"Idk what to say bout him, i know personally a man who loves n does for his kids, but his child's mother does not let him take his son ANYWHERE, n will continuously say he sick or he can't go, but always calls when he needs shoes or something and holidays.. So i can't judge him. Also just because ur behind on child support doesn't make u a deadbeat, you can be behind while making payments still!! Its sad what this family has to go thru but not everyone is educated on their parental rights or can afford court! I just feel sorry for the kids n the family.","post_message":"Dad of Kids Found Dead in Freezer Comes Forward #TRENDING"},{"comment_id":"622739101214748","commenter_b":"Yes, what has she done in her young life to deserve a 900,000 dollar a year job? Oh ya, she works at mommy and daddy's \"foundation\", sorry, money laundering facility!","commenter_a":"Is she billys daughrer or NOT","post_message":"Multiple Choice Quiz time, kiddies! Which answer did you chose? A or B? @webpagelink"},{"comment_id":"1110991635663754","commenter_b":"All he did was that march. And she's scared? She worked under Obama for years! Goodness sake you're a liar","commenter_a":"He should....he's been a supporter of equality his entire career....Hillary has not!! Hillary is the dost kind of candidate...she will switch up her position just to look good...Bernie Sanders marched with Dr. King...Hillary is terrified of black people....fake a%%","post_message":"Here's how Bernie Sanders may be starting to crack the crucial demographic of Democratic voters."},{"comment_id":"10158187868175203","commenter_b":"Boo hoo bitch","commenter_a":"The Dems aren't going to stop. They're working their agenda to undermine our Constitutional Republic, the rule of law, and our civil society: @webpagelink","post_message":"Trump defends his travel ban."},{"comment_id":"10153203949426782","commenter_b":"This is complete BS!!! They are illegals!! NOT undocumented.... In Oklahoma you have to prove you are here LEGALLY, not an illegal criminal to get an Oklahoma ID or DL. Sign up for a DL as an illegal and get deported.","commenter_a":"If Americans went to Mexico illegally, they would be thrown in jail, deported, if they're lucky, possibly shot and killed, but I can guarantee they wouldn't be given free medical, free schooling, welfare, jobs, driver's license, etc....all at the tax payer's expense.","post_message":"An Oklahoma City grassroots effort to get undocumented immigrants drivers licenses is gaining momentum."},{"comment_id":"862688910457525","commenter_b":"Women is just as bad","commenter_a":"Ryan selfish & sexism pig!!!!","post_message":"Ryan Giggs' brother: 'He never even apologised'."},{"comment_id":"1219104934776201","commenter_b":"And this is what this gremlin boils down to!","commenter_a":"This old man ain't going nowhere. Pump up the Trump.","post_message":"The conventional wisdom of the Democratic race holds that Vermont senator is the principled liberal challenging Hillary Clinton. But Bernie Sanders has moved too."}]
