[{"comment_id":"935570869827883","commenter_b":"You don't have to apoligize for that bitch","commenter_a":"Don't worry, she is a fringe politician who's party holds only one seat in parliament. She doesn't speak for most Canadians (like me) who abhor Omar Khadr. Our apologies.","post_message":"This video makes me sick. Praising a Taliban war criminal for his \"class\", making light of the death of a U.S. soldier, and having to be dragged off stage all in one speech. I hope her career ends in a fiery explosion ASAP. Here is her Facebook page if you want to share your opinions on her speech > @webpagelink ~Funker"},{"comment_id":"10154517045124087","commenter_b":"The Muslim ban from war torn nations is meaningless. Besides him not banning Muslims from Saudi Arabia - because they have \"great human rights\" over there from Women not being allowed to drive or throwing Gays off of roof tops; Trump says US will prioritize Christian refugees. How do you determine who is a Christian when one can easily lie about this? Congress will likely overturn this. While they're at it, Trump stop droning brown people overseas and Congress stop sending foreign aid to these terrorist organizations who indirectly receive it.","commenter_a":"Good","post_message":"BREAKING: President Trump has signed an executive order indefinitely banning all refugees from war-torn Syria and suspending all refugee entry for at least 120 days."},{"comment_id":"10156506667295354","commenter_b":"MUCK FUSLIMS","commenter_a":"They hate what it stands for Freedom, and they want to take it over, take away all freedom and replace it with Sharia. They will by population growth win this battle and eliminate all non muslim men, women, and your children if you allow them to settle in our Country.","post_message":"\"The hatred of infidels is a religious imperative in Islam. No matter how fast we dance, appease, pay, accommodate, and submit, the hatred and holy war will not cease. On the contrary, the more we submit and reward the hatred and terror, the more we will have to surrender.\""},{"comment_id":"10153321594333812","commenter_b":"Hahahahahaha","commenter_a":"what strong messages? I thought she deleted all her messages. lol","post_message":"President Obama says Hillary Clinton will have \"some strong messages to deliver\" if she runs for president. @webpagelink"},{"comment_id":"519362884912406","commenter_b":"Unfortunately, the difference is usually that they are dead after interacting with her...","commenter_a":"Bye","post_message":"Hillary Clinton: \"I am not a natural politician like my husband or President Obama...I just have to do the best I can, get the results I can, make a difference in people's lives.\""},{"comment_id":"10153023573702452","commenter_b":"The bizarre part : Women buy purses but don't want to carry them ?? Who leaves their purse???","commenter_a":"Por pendeja!","post_message":"BIZARRE VIDEO: A thief was caught on surveillance video stealing a purse inside a Philadelphia restaurant - and then dancing away. @webpagelink"},{"comment_id":"1154585737915740","commenter_b":"She wasn't going anything wrong. Shame on these liars!!!!!!!","commenter_a":"No class . Needs to move to Detroit where she belongs .Lol Trump for president","post_message":"What Michelle Obama Was Caught Doing At Nancy Reagan's Funeral Will Make You SICK The Obama's have absolutely no respect. Do you think she is the worst first lady ever?"}]
