[{"comment_id":"10152564778122623","commenter_b":"What I don't understand is why would anyone want to follow her? Congratulations you got video of her stopping and starting over and over, all the while you are driving in wet conditions with one hand, with a child in the car??? Plus this crazy lady could have gotten out WITH a gun and killed the woman driving and the child. People need to just let road raged people go. Just pull off to another road or whatever, get a tag number and call 911. Leave it to the authorities. She should be thankful for her life.","commenter_a":"I'm glad the nut case was turned in and charged.","post_message":"It's the video everyone is talking about. The woman recorded in a terrifying road rage incident in Randleman has been charged."},{"comment_id":"10157563024440206","commenter_b":"Suck my d*ck Un song nia","commenter_a":"@ Mika and @ Alyssa bow wow","post_message":"Lil’ Kim, is that you?"},{"comment_id":"10153631022078812","commenter_b":"When my sister and I owned a dual outboard, she had the ridiculous idea to do this exact same thing. We were fully grown women. I told her in no uncertain terms that she would do that one alone. The water between FL and the Bahamas is full of unsavory people, weather, and sea life.","commenter_a":"The ocean is cruel. Regardless of how prepared you are for anything, the ocean is unpredictable as well as man. Anything could have occurred. Rouge wave, pirates, drug runners, etc. Either way it must be Hell on that family right now as you start to wonder \"what if\"? From one parent to another that has lost a Son God Bless and I hope this story has a happy ending but it doesn't look good. Nature, sadly, normally wins in the end.","post_message":"UPDATE: The missing teens' boat was found capsized off the Florida coast. @webpagelink"},{"comment_id":"10153572716786337","commenter_b":"Well he went to my homeland n cause a problem...we don't bother NOBODY but Americans always causing trouble for us....If he dont go to jail..Maybe a African curse will do the tricks...n if the table was turn y'all would want justice","commenter_a":"Uh, no shit he won't go to jail. He didn't break any laws in America what so ever. While I disagree with what he did, it was done in another country outside of our laws.","post_message":"#CecilTheLion is dead. Walter Palmer probably won't go to jail. Here's what we can do to prevent situations like this..."},{"comment_id":"999515513474836","commenter_b":"No shit ..told u that a while ago......u stubborn Dominican","commenter_a":"Especially after what happened in France.... I usually dont say much but liberal democrats can go scratch... ...its gonna happen here soon.......","post_message":"Watch: Pres. Obama calls out Republicans for pretending the Bush Recession was the \"golden era\" and refusing to give him credit for fixing their mess."},{"comment_id":"992725720849341","commenter_b":"Who cares what they want........I hope every single one of those sniveling, useless, A-holes leave!!!!","commenter_a":"Who cares","post_message":"They really don't want Donald Trump to be president."},{"comment_id":"10153845314569024","commenter_b":"This is a wake up call. Ban these type of stores underneath the rail. Build a wall around it.","commenter_a":"Cuomo & DeBlasio told their agents to not answer questions??","post_message":"Do you think the city ought to be doing more to keep overhead rail infrastructure secure?"}]
