[{"comment_id":"10153193679463812","commenter_b":"Lady Gaga was amazing & Julie Andrews is stunning! Love that movie always!","commenter_a":"Absolutely amazing!","post_message":"Perhaps the most powerful moment of the #Oscars: @webpagelink"},{"comment_id":"10157782729605725","commenter_b":"She's a fake!!","commenter_a":"Mlp","post_message":"An honor to be at the Polish National Alliance in Chicago, Illinois - meeting with & speaking to the Polish American Congress. Thank you!"},{"comment_id":"10153976625678162","commenter_b":"Zionists let jews die that didn't obey the transfer agreement","commenter_a":"Just shows how much the Zionists have in common with the Nazis. They killed defenceless people and celebrated the murderers. The fact 35,000 Israelis have signed a petition to get the IDF member a medal is astonishing. @webpagelink","post_message":"As a video recording of an Israeli soldier killing a wounded Palestinian in Hebron on Thursday emerged hours after the shooting Israeli government officials and civil society representatives were split in their responses. Some quickly moved to condemn the shooting, while an outspoken group of Israeli leaders applauded the soldier and circulated a counter-theory of self-defense and heroism."},{"comment_id":"10157177074000354","commenter_b":"And she will continue where he leaves off","commenter_a":"We've had more terrorist attacks on our soil during the Obama administration than on GW Bush's watch. I think Obama is doing a fine job of recruiting terrorists.","post_message":"So the basis of Hillary Clinton's corrupt candidacy is that she is more popular with terrorists? WATCH:"},{"comment_id":"1806931362926478","commenter_b":"I just can't believe that she uses children for her dirty political TV add. Her latest add children watching Donald Trump . She is the expert lol . Her lenguage puts sailors to shame. She is no Lady never was never will. Poletic is agly we all know that. But to involve children in an add how low can you sink??? I wouldn't let my children or great grand children watch TV dirty Poletic.... The would be in bed for sure not sitting in front of the TV all day long .what kind a mother and grandmother is she we should ask ourselves to use children in her dirty advertising against TRUMP they are children MADAM SECRETARY. SHOULD WE SHOW THE CHILDREN THAT YOU IGNORED THE DESPERATE CRY FOR HELP IN BENGHAZI?? YOU KNEW WAY BEFORE THEY WOULD NEED HELP RIGHT AWAY. WELL WHERE WERE YOU YOU WENT TO BED ...","commenter_a":"He's needs to walk away from the DNC at this point!!! They never had his back why should he have theirs? Stein /Sanders could change this country.","post_message":""},{"comment_id":"1109139419126529","commenter_b":"They are discontinuing these items because they are not being purchased. Pure business decision. They are not trying to bs socially responsible.","commenter_a":"Posturing","post_message":"Walmart made a major decision regarding guns that is going to surprise more than a few people."},{"comment_id":"10154303024133132","commenter_b":"Shut up, Maggie.","commenter_a":"It's not nice to be wearing such nice clothes to cuba when those people have nothing! They looked scaredto be their in my opinion.","post_message":"Sasha and Malia Obama delivering a healthy dose of style inspiration while in Cuba! (via PeopleStyle)"}]
