[{"comment_id":"10153157733159197","commenter_b":"She looka likea man.","commenter_a":"the scowl on the face of #3 is pretty funny","post_message":"Have you been to a spa in East Hartford lately? It could be one that was shut down after a prostitution bust-->> @webpagelink"},{"comment_id":"10156188886135354","commenter_b":"Suzanne, you're a dumb bitch. Shut the fuck up","commenter_a":"Scott walker Mexican Americans legals are against illegals we are with DonaldTrump not because we are Mexicans but this is our country n our children need a better America not free loader hard working for a better America since 1800 hundreds my family been hereover 200 hundreds years we love America we have to be great again my decision n my family DonaldTrump is the great America we need","post_message":"Scott Walker calls for a “limited number of candidates who can offer a positive conservative alternative to the current front-runner.”"},{"comment_id":"10153221269572464","commenter_b":"Yes, Hillary should indeed be going to jail, for life! People were killed because of her. :(","commenter_a":"I think she should be going to trial instead of running for president....","post_message":"We need to restore America’s leadership: @webpagelink"},{"comment_id":"10154616109355575","commenter_b":"THEY DON'T NEED A TAX BREAK. JUST TAX THEM COMING IN.","commenter_a":"Do it Donald, show all these NaySayers it can be done, save our Jobs, put America back to work.","post_message":"Trump doing more before he's President than Obama did in 8 years!"},{"comment_id":"964343103614237","commenter_b":"@username Fuk them girls","commenter_a":"How about if the school confiscates ALL mobile devises or devises that play music so we can listen to the playlist of songs that use these words? I think what these kids did was dumb. Question is..\"is it only offensive to hear these words when it comes from a non black individual? Or is it also as offensive to black person if their their own race uses the word to announce their friendship\"? What up my n..... You all have heard it. Its in every horrible rap lyric. Its used daily in schools and on the streets. RESPECT IS RESPECT. there is no off time when the word is offensive or not. So its an honest question. Why is it Not offensive in music or when used by black people toward other black people?","post_message":"I'M SORRY: One Desert Vista High School senior, who posed for a picture while spelling out a racial slur, apologized yesterday during a rally. Many of her fellow students say they have forgiven her. Should she face further punishment from the school district? Read the story at @webpagelink"},{"comment_id":"10153534266495399","commenter_b":"We don't need him and take little Mexico with you","commenter_a":"And he's supposed to be the \"smart\" one?","post_message":"Asked to clarify, Jeb said, \"Things happen all the time. Things. Is that better?\""},{"comment_id":"433149650143409","commenter_b":":)","commenter_a":"done & done","post_message":"\"Work hard, play hard,\" is the lie they want you to buy. #fuckwork"}]
