[{"comment_id":"10152635472271770","commenter_b":"she's a glorified prostitute. complains about the johns, but keeps taking her clothes off and taking the money","commenter_a":"and the money....","post_message":"Except for the freedom of speech, apparently."},{"comment_id":"10154974435358812","commenter_b":"Russian Women For Trump ???","commenter_a":"Well rehearsed lol","post_message":""},{"comment_id":"687880108038609","commenter_b":"of course they arn't all murders and gang members that's why the wall will have a door or did you miss that part in the cnn chopped up version of that speech? the ones who want to be Americans can stay the rest can f off.","commenter_a":"These comments are disturbing. These are parents, children, families...not murders, drug dealers or rapists. Instead of \"building a wall\" or treating them like shit we should be coming together with Mexico so that they don't need to come here. They need help, we have a problem, so why are the two countries not putting their heads together to figure out a way to HELP","post_message":"Thousands of Central American children and families are arriving in Texas."},{"comment_id":"934248849943870","commenter_b":"American's just as guilty for ALLOWING these Satanic PIGS to roam our country and have their way! THIS----IS---OUR---COUNTRY!!! NOT the POA - NOT Islams!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"These MUSLIMS think they can come to this Country and do what they want, NO if you don't like it go back rape you women and kill but not in AMERICA!","post_message":"Must Watch!"},{"comment_id":"10152999450927439","commenter_b":"This is so out of hand! what the hell are they afraid of! get them out!","commenter_a":"Muslim Brotherhood terrorists","post_message":""},{"comment_id":"10156717481975354","commenter_b":"she is a pig","commenter_a":"SO VERY WRONG!!!","post_message":"Black Panther Tribute by Beyonce..."},{"comment_id":"10157662056330405","commenter_b":"Kasich is a sore loser..used to like him but after he lost the race for president he has gotten to be a sour sore loser..","commenter_a":"Good job, Governor! Wish there were more like you that agree to support what the PEOPLE want! My governor, Kasich, wrote in 80 year old John McCain for a president, wth! He's a disgrace!!!","post_message":"Great to rally a huge crowd in Eau Claire for Donald Trump, Mike Pence, Ron Johnson, and the entire Republican ticket."}]
