[{"comment_id":"1226253117412922","commenter_b":"White peoples God George Soros funds these riots !","commenter_a":"If there is any one in the car, it is also attempted murder, and MUST be prosecuted.","post_message":"Nails it!"},{"comment_id":"10153196800261051","commenter_b":"Shut up you bitch! !","commenter_a":"I thought for sure she would want to be a Ferguson protester!","post_message":"Michelle Obama was asked a simple question: If you could have any other job in the world, what would it be? Here's her response."},{"comment_id":"10154169792132629","commenter_b":"@username bye bitch","commenter_a":"BernieOrBust! We are giving the people in the remaining states the opportunity to make the right choice! This is not a threat, its promise! Thanks to social media we are constantly talking to each other, organizing and planning our next steps! The bigger picture doesn't have the Democratic Party playing a role if they are adamant about representing the 1%! Those of us who are Bernie or bust have no party loyalties! We don't care about what happens to the party if they don't care about us in the primary! It's just that simple Trump does not scare us. We plan to vote a bunch of Progressive's in the House to block his agenda, but Hillary scares us more! The ultrarich neocons in the right wing love her and hate Trump! That's a problem! She will get a lot of center right policies signed into law! And we will never ...","post_message":"Hillary Clinton won no delegates, because Washington Democrats already awarded them based on party caucuses in March."},{"comment_id":"1684200761639665","commenter_b":"Like I said, she looks like an old hag.","commenter_a":"My gosh, she only 49 years old and looks much older.","post_message":"Kellyanne Conway breaks out her bathing suit as she manages to sneak away from Team Trump for a brief family vacation"},{"comment_id":"602171783246943","commenter_b":"I think he is a prick he makeing the country he inn charge with killing off his own people as black. And look at what they saying on here about him he needs to send two b52 bombers and carpet bomb all these evil peope o. Here calling him names lol","commenter_a":"I'm ready!","post_message":"\"The American People must be willing to call Barack Obama what He is in order to Defeat Him\""},{"comment_id":"1313639405344510","commenter_b":"Saudi is the most corrupt and evil country in the world. Where else are women banned from doing anything? Even worse than North Korea. And yet, Hillary took money from them and her supporters love to cry \"sexism!\" One Nation under God \"there is no one like our God\" Jesus, Amen. We don't need any Islamic states in American","commenter_a":"Saudi is the most corrupt and evil country in the world. Where else are women banned from doing anything? Even worse than North Korea. And yet, Hillary took money from them and her supporters love to cry \"sexism!\" One Nation under God \"there is no one like our God\" Jesus, Amen. We don't need any Islamic states in American","post_message":"U.S. president-elect Donald Trump’s recent cabinet appointments had drawn harsh criticism from civil rights campaigners. The cabinet picks have, however, earned praise from white supremacists and neo-Nazis. What do you think about his cabinet? Join us on #presstvdebate at 18:33 GMT"},{"comment_id":"10153571133258132","commenter_b":"Shut up Tina","commenter_a":"Regardless of what this family would've, could've, should've said...90% of you made your judgement the second you heard \"the news\". Until it happens in our own family, none of us have the right to judge. Just as I don't have the right to judge all of you with your incredibly hateful comments. So I won't.","post_message":" watched him like all the time. I took him to work with me. We just poured our life into him.\""}]
