[{"comment_id":"1227346460655830","commenter_b":"This bitch is an idiot.. lol","commenter_a":"Really? Trump wants to end Social Security, Medicare, Medicaid, Food Stamps, and Obamacare! Voting Democrat is the only way to stay alive!","post_message":""},{"comment_id":"1072916832798493","commenter_b":"I dont know who's right who's wrong because this is a mourning moment","commenter_a":"God bless President Bush and his wife! Atleast we know they love America! Even Obama's brother knows Barack is a failure, he started isis by withdrawing troops from Iraq and killing Gaddafi! by the way a funeral is a celebration of the person's life morons! The Obama's are an embarrassment!","post_message":"Actions speak a THOUSAND words. Take a look at Michelle's face..."},{"comment_id":"10154335098801002","commenter_b":"Amy... are you serious?!?! IQ test?!? A lot of criminals have high IQ's when tested! It has NOTHING AT ALL TO DO WITH IQ! It has EVERYTHING to do with COMMONSENSE!!","commenter_a":"Why is she being charged it was completely the guns fault lol","post_message":"CHARGES: A woman who fired her gun at suspected shoplifters in a Home Depot parking lot has been charged."},{"comment_id":"1271695059532579","commenter_b":"she is so miserable with herself she just lashes out at everyone such a poor excuse for a female","commenter_a":"Rosie is not well! Needs Mental Health help!","post_message":"Rosie is disgusting!"},{"comment_id":"376409252547369","commenter_b":"She is a looser","commenter_a":"THUMBS DOWN!! Pitiful excuse for a human being. Hard-working Americans don't get $112,000 in benefits. THIS IS SO WRONG. Stop the money and see what she does.","post_message":"One more Welfare Moocher..."},{"comment_id":"1510465682300437","commenter_b":"Drained the swamp by putting the gators in his bathtub. What happens when they attack him and each other? Too much love of power and love of money in a small space.","commenter_a":"Well, with all his wealthy Cabinet appointments, we can thank Trump for finally draining the swamp, which is unpresidented.","post_message":"This just happened. He said it! Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154501796200861","commenter_b":"A form of The old bait and switch. ....I don't feel sorry for the jewelry store...you knew better","commenter_a":"I'm not saying profiling works every time but it would of worked this time","post_message":"Do you know any of these men? Police need your help."}]
