[{"comment_id":"10153359196206234","commenter_b":"She can leave the house!","commenter_a":"If she can't leave the house,what does she need it for","post_message":"The new Lexus was waiting for Giudice when she returned home from prison earlier this week."},{"comment_id":"1754494444782298","commenter_b":"If you have to ask what's wrong with him then you need to get a checkup from the neck up and have your ears cleaned out","commenter_a":"I sure hope he's getting 2 a.m. calls in the morning from people who hate his guts","post_message":"THEY DID IT: #Anonymous just released all of Donald J. Trump's personal information to the public..."},{"comment_id":"1241511662632276","commenter_b":"Send his ass to jail","commenter_a":"Send him to jail","post_message":"This thug-in-training tried to act tough by sucker punching this white 12-year-old boy with a pair of brass knuckles. Too bad for him the District Attorney didn't think his brutal assault was as funny as he did... Now he's going to see what the real word is like! SHARE and let us know what you think should happen to this thug-in-training! @webpagelink"},{"comment_id":"10153657891231336","commenter_b":"Stupid old woman","commenter_a":"Keep her in jail until she resigns or issues marriage licenses!","post_message":"Kim Davis will be in jail at least a week, but she could stay longer if she continues to not obey the judge's order."},{"comment_id":"10153717285696509","commenter_b":"Looking better then the women in his home","commenter_a":"Should be on the cover of freaks magazine","post_message":"Caitlyn Jenner is on the cover of Vanity Fair, in an image shot by famed photographer Annie Leibovitz: @webpagelink #CallMeCaitlyn"},{"comment_id":"10153706783614218","commenter_b":"Go suck you mother","commenter_a":"Judge Barry williams came to his decision based on fear of rioting and unrest...thats not how the justice system is supposed to work you cant be bullied by a bunch of idiots in the streets chanting lies","post_message":"#BREAKING #FreddieGray Judge denies motion to dismiss charges against 6 police officers in death of Freddie Gray. He also denied a motion for State's Attorney Marilyn Mosby to recuse herself. Follow live updates: @webpagelink READ more here: @webpagelink"},{"comment_id":"1918194181741344","commenter_b":"Orange Hitler needs to shut up!","commenter_a":"Trump NEVER considers possible consequences of his words.","post_message":"Donald J. Trump told his supporters \"a bomb went off in New York,\" well before local officials had publicly confirmed details of the incident or what caused the explosion."}]
