[{"comment_id":"1333958173358453","commenter_b":"@username you racist prick","commenter_a":"#FakeNews THIS is what it really looked like.","post_message":"An estimated 700,000-900,000 people attended President Donald J. Trump's inauguration today, about half the number of people who attended Barack Obama's eight years ago. @webpagelink"},{"comment_id":"10153276508787144","commenter_b":"I certainly hope you don't have daughters with that repulsive, misogynistic mouth.","commenter_a":"Grace under fire?? I just love how you baby murdering dirtbag sluts try to make yourselves out to be the victims instead of the human beings you kill. Why don't you show the exchange how it really happened? @webpagelink","post_message":"Yep."},{"comment_id":"1005120462832757","commenter_b":"and for that she deserves what amounts to life in prison?","commenter_a":"Ummm she took abortion pills and left her baby in a dumpster, then took herself to the hospital.","post_message":"\"What this prosecution makes clear is... abortion being recriminalized in America\""},{"comment_id":"10152975606714205","commenter_b":"Oh me and Lamar was talkin bout it all day lol","commenter_a":"Nae you hear about this??","post_message":"Rapper Rick Ross arrested after pistol-whipping a man."},{"comment_id":"10153361923310796","commenter_b":"Google it or California DMV website. Wake up.","commenter_a":"With over 50% of new California Driver's Licenses issued to illegals will anyone challenge voter fraud in Mexifornia?","post_message":"Republican presidential front-runner Donald Trump blasted Mitt Romney in Maine on Thursday after the party’s 2012 nominee criticized him, saying Romney would have “dropped to his knees” for his endorsement four years ago."},{"comment_id":"997010993718412","commenter_b":"Islamic Terrorist, go home, stop trying to change the U.S.A.","commenter_a":"No true American is safe as long as Islam is allowed to exist in our nation! We true Americans must unite against this plague and the liberals who allow them to destroy our lives and wipe them from our nation so we can ensure the safety and security of our nation and the American people!","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack. He is a hero, and will always be remembered as so. Can we get 150,000 'LIKES' for this brave boy?"},{"comment_id":"10153151151584330","commenter_b":"... what does this have to do with this news story?","commenter_a":"Mental illness on the rise. We need to open state mental institutions Nd not close them down. Poor people have no where to turn to and it can effect the innocent.","post_message":"BREAKING: A person died after being hit by a train in Fairfield. Train service in the area has been disrupted --> @webpagelink"}]
