[{"comment_id":"10153722777028822","commenter_b":"if that female can do it and make it big go for it i would like to see it","commenter_a":"Its bound to happen because they are plentiful and killing it in the minors and its just a matter of time before one breaks into the big leagues. Smh...","post_message":"What do you think? Do you agree with Pittsburgh Pirates manager Clint Hurdle?"},{"comment_id":"1144826232238207","commenter_b":"There are also many women that have \"potty mouths\" and that too is common knowledge.","commenter_a":"as a woman... I was a bartender for many years and you live in a bubble and you live in denial becasue 85% of men talk like that....BUT...it was all talk...unlike like Bill Clinton. who raped a woman! I believe all the outrage is coming from the liberals who never intended on voting Trump....What sane Republican would say they are now voting for OPEN BORDERS over Trumps 11 year old comment from a man to another man... it is like democrats have moral values all of a sudden! They were words not actions!!","post_message":"Trump's idea of pre-debate prep… BREAKING VIDEO: TRUMP Has Meeting With Women Who Say They Were RAPED, SEXUALLY ASSAULTED By Bill Clinton \"Mr Trump may have said some bad words, but Bill Clinton raped me\""},{"comment_id":"543983115775139","commenter_b":"Let them keep walking to wherever they came from","commenter_a":"Let them walk all the way to the muddeled East.","post_message":"Muslim Students Walk Out During National Anthem [VIDEO] If don't want to show your respect for our country, you can leave. Are you appalled by their blatant disrespect?"},{"comment_id":"10158293361345725","commenter_b":"Well mother nature must be a murderer because women spontaneously abort all the time. It's called a miscarriage.","commenter_a":"Although I consider myself a Progressive, I have to agree that abortion is murder. That is one thing that I agree with the Republicans. Not because of their political beliefs but me as a human being. Murder is murder and we shouldn't give permission to commit it.","post_message":"Ohio Governor John Kasich has signed a bill imposing a 20-week abortion ban, in a prelude to the broad offensive abortion-rights opponents plan to launch across the nation in January."},{"comment_id":"10154307345026729","commenter_b":"I am a liberal and I totally agree with the poster, so why are you irritated with liberals; your reasoning doesn't make sense to me.","commenter_a":"Or becoming traitors and taking over federal buildings!","post_message":"This will definitely irritate liberals and the \"coexist\" crowd"},{"comment_id":"1152081494853966","commenter_b":"Well if men are allowed to use ladies rooms why didn't he just go in and guard her stall there. Maybe he didn't feel like a mommie that day.","commenter_a":"I don't shop at target, so...no big deal","post_message":"WOW! Father Guards the Door While Daughter Uses Target Restroom..Then This Happens. (VIDEO)"},{"comment_id":"10155334834981509","commenter_b":"Police ddnt kill here the one who shoot her is her boss to shut her up.. Druglords her in phillipines are afraid now they kill all there people who knows evrything to there bussnes. Cnn researcher maybe now is grade 7 only ahahah","commenter_a":"WTF is going over there? Why isn't this President condemning these murders if he is not then he is in part at blame!","post_message":"The daughter of a runaway British lord has become one of the highest profile victims of the Philippines' war on drugs."}]
