[{"comment_id":"1260728277356755","commenter_b":"Can we talk about your taxes Trump and some of your wife's well kept secrets since you are always pointing your finger at everybody else!!!","commenter_a":"Instance 302-A when Trump is actually projecting himself.","post_message":"\"She also lacks the mental and physical stamina to take on ISIS and all of the many adversaries we face.\" - Donald J. Trump questions Hillary Clinton's health"},{"comment_id":"1085502584794544","commenter_b":"Good thing the fetuses don't care","commenter_a":"butchering humans is not health care","post_message":"Americans want funding for women's health."},{"comment_id":"10157131061465354","commenter_b":"She should have hung herself with the noose. That'll show em!!!!","commenter_a":"Tighten that noose!","post_message":"+++FIRESTORM+++"},{"comment_id":"10153292022111051","commenter_b":"Keep the statue,ignore the STUPIDS !!","commenter_a":"Again, if they don't believe why do they spend so much time removing evidence of God.... I really do believe that Atheist DO BELIEVE in God but don't want reminding that God is Holy and we are not. If God does not exist then sin does not exist, and thus they can live the way they want without worry of sinning...Sad! Our children and our country have paid the price of Atheists and their faithless and evil ideals.","post_message":"Should they have to remove the statue?"},{"comment_id":"1192108440886151","commenter_b":"He is going to be a great president","commenter_a":"He is the uneducated and ignorants president which apparently there is a lot of!","post_message":"WATCH LIVE: President-elect Donald J. Trump makes a statement from Mar-A-Lago estate"},{"comment_id":"10154622434238433","commenter_b":"He's probably counting retirees. Of course, when the fascists STEAL our Social Security all those retirees will be forced back into the workforce.","commenter_a":"When Pence and other GOPers rattle off this crap -- it's aim is to cause anxiety and to inflate anger at such inequities - THUS, it is a100% LIETZOW, as it's meant to deceive!!!","post_message":"NEW: Is Mike Pence right that 1 in 5 U.S. households don't have anyone working? Well, sort of. Half True."},{"comment_id":"10154647269064024","commenter_b":"You must be dumber than dumb to believe a fake news story. And the folks in Hamtramck are laughing their asses off at you, and everyone else, who believes this codswallop. Hamtramck is NOT under Sharia law.","commenter_a":"You folks in Hamtramck, Michigan must be dummer than dumb, now you can live and enjoy what you have done. Happy Days are NOT in your future.","post_message":"First Muslim City Council In U.S. ENFORCES Sharia Law... Too Late Now! - BB4SP"}]
