[{"comment_id":"893880777331086","commenter_b":"\"I kill ithith and bite their ears off\"","commenter_a":"I hope when he talks he doesn't sound like Mike Tyson or something. That would be a let down. LOL","post_message":"Yeah. That dude is pretty intimidating. ANGEL OF DEATH: Axe Wielding Militia Commander is Striking Fear Into ISIS Fighters"},{"comment_id":"10154011298015927","commenter_b":"Shut up you non event","commenter_a":"F u dusche bag","post_message":"\"It needed to be said, and you said it beautifully ...\""},{"comment_id":"10154382058398606","commenter_b":"These chicks will walk on hot stones for me but keep disrespecting their sisters","commenter_a":"@username Smdh. Why would anyone do that?","post_message":"More than 30 people suffered burns to their feet and lower extremities at a Tony Robbins seminar after the motivational speaker encouraged them to walk across hot coals. @webpagelink"},{"comment_id":"10154007626519456","commenter_b":"Yea, maybe this guy is right...slaves should learn to be free if they feel entitled to it!! Bring back discrimination!","commenter_a":"Isn't the govs job to tell anyone what they have to pay anyone for services. If you don't like what you make, increase your skill set instead of having the gov hold your hand.","post_message":"The bill passed on a 71-31 vote, and will now move to the Alabama Senate."},{"comment_id":"10154346047721336","commenter_b":"The also gave us mass production cigarettes, fast food, obesity, lung cancer and heart disease. Yeah!!!","commenter_a":"Think about the differences in the 18 year old people now-a-days compared to then. Can you see your 16 year old neighbor going to the recruitment office to try to lie about his age to enlist? They're called \"The Greatest Generation\" for a reason. We'd have everyone trying to sue the government for various reasons rather than fighting. It is a different world we live in, with different core values in the newer generations. Even the older generations are wasting their time debating bathroom rights... THESE kids knew what was important, and were willing to give all for their beliefs. I can't salute them enough, or honor them enough, or thank them enough. And having served overseas for the majority of my time in the service, and living in Germany, I was fortunate enough to see just what the older generation of Germans felt for these people who did so ...","post_message":"We remember, and give thanks. #DDay"},{"comment_id":"10154078774989877","commenter_b":"Besides reproduction and parts which aren't anyone's business, nothing in these comments state what makes a woman a woman.","commenter_a":"We should all be okay with this. Two words: Fairness and equality.","post_message":"Spelman College to consider admitting transgender women Grio fam, is it time HBCU's updated their views on gender identity? Sound off below!"},{"comment_id":"10153404952670399","commenter_b":"Women see him and spontaneously abort.","commenter_a":"Cherry picking keeps religion alive.","post_message":"Way, way too much information."}]
