[{"comment_id":"600652730065515","commenter_b":"Christians are doing it now to homosexuals, in Uganda","commenter_a":"They are savages. Anyone who can cut off a person's head is cold blooded.","post_message":"Attention Liberals: The Koran is a Satanic Manifesto & Christianity is not as bad as Islam!"},{"comment_id":"10153626389226336","commenter_b":"Guns don't kill people husbands that come home from work early do.","commenter_a":"You need tougher idiot-control!","post_message":"\"I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.\" – Andy Parker"},{"comment_id":"10154701801396002","commenter_b":"Just like this woman doesn't care if you believe her or not.","commenter_a":"I'm not believing this, you're leaving prescription drugs in the house and know you're going to be gone for 5 days? We never leave ours behind Fir any reason because of what you have to go thru to replace them. I also can't believe they stole video games and not the TV. According to the report and the time limit, they would of wiped them out. Just my opinion.","post_message":"Standing in the middle of her ransacked living room, Taylor resident Janice Mulholland is in disbelief."},{"comment_id":"10154298201954087","commenter_b":"STFU","commenter_a":"He's such a comedian.","post_message":"Lindsey Graham insisted Trump's administration look into the Clinton Foundation with an \"independent view, not a political agenda.\""},{"comment_id":"10153512316881130","commenter_b":"Classy old gal she is....lmao","commenter_a":"I don't know about that if your kid is old enough to eat real food with a spoon its time to take them off the tit.","post_message":"\"There's no difference in me feeding my baby with my breast than you feeding yourself with a spoon.\""},{"comment_id":"10153942931813132","commenter_b":"Show this picture to the stupid drunk driver!!! Ask her if it was worth it!!!","commenter_a":"Blessings!!!","post_message":"Unbelievably sad."},{"comment_id":"1201354526579759","commenter_b":"Can't turn a hoe into a housewife should of known that!!! Smh Anyway in other news?","commenter_a":"When the goin gets tough the fake show true colors","post_message":"\"She's felt trapped for a while... She doesn't want to stay married.\""}]
