[{"comment_id":"689624227852673","commenter_b":"They're not ladies either but you don't have a problem with that.","commenter_a":"I agree with British spelling (and actually use it here in the states) except on two accounts- Aluminium and Ladybirds. That's crazy, they're bugs. Ladybugs. They're not birds. Birds eat them. XD","post_message":"The last weekend of October sees ladybirds swarm public spaces, people's homes and ex-footballers."},{"comment_id":"10153624031427293","commenter_b":"But don't forget it's going to be a wall that's yuuuuge and beautiful and the best part is Mexico is going to pay for it!","commenter_a":"does he have any ideas? any plan other than the wall?","post_message":"\"(Trump) will run into a buzz saw of reality otherwise known as the general election, and he may not know how badly mangled he’ll get.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10153810948993717","commenter_b":"Hillary wants to secure our border now - #TrumpWall - @webpagelink","commenter_a":"Great........I wonder which town he plans on hurting this time, forcing the tax payers to pay for his visit, and extra police security while he's here weather they like it or not....glad to see our state has a say in it......","post_message":"Donald Trump will be back in the Granite State on Monday: @webpagelink"},{"comment_id":"1089143724523512","commenter_b":"Jenny Magnanelli I would pummel him.","commenter_a":"Travis Kieska","post_message":"A Texas mother wants everyone to stay aware when out shopping with your baby. A man walked up picked up her 14-month-old without permission. When confronted, the man never spoke to the mom, just addressed the baby, then left the store with no merchandise. #NBC5Now More: @webpagelink"},{"comment_id":"10153117785839440","commenter_b":"close your trap you negative nancy!","commenter_a":"Who cares- nuggets are less than irrelevant.","post_message":"Denver Nuggets selected Emmanuel Mudiay with seventh pick of the NBA Draft @webpagelink"},{"comment_id":"1780142445541305","commenter_b":"Lmao","commenter_a":"What in the actual fuck","post_message":"Punching White Woman After Yelling Hate White People Not Hate Crime, Judge Rules"},{"comment_id":"10153249679689384","commenter_b":"They are not saying that they are not going to fund the DHS- just the portion that supplies billions to illegal immigrants. The mess that the Dumbocrats likes you and Nag Nancy supported along with the idiot in the White House. You and the fools like you are no longer \"hilarious\" you are dangerous! You need to educate your foolish self and quit endangering the rest of us!","commenter_a":"Hilarious!!! GOP makes us think we are in momentary threat of something or other and then Refuses to Fund the operating system for oour Defense!!!","post_message":"The clock is ticking and still, Republicans are trapped in a dangerous, anti-immigrant fantasy. This is the second time this week that Republicans have voted to continue threatening the security of American families, doubling down on their breathtaking irresponsibility. My full statement: @webpagelink #DontShutDownOurSecurity"}]
