[{"comment_id":"1782119588705977","commenter_b":"@username Dumbocraps can't read. They need pictures.","commenter_a":"never once have I cared or wondered \"What would Eric Trump think?\" about... anything.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"10153743824977093","commenter_b":"Ain't no snake ever hurt no one. My niece Becky got bit by a dog","commenter_a":"Am glad y'all found this snake","post_message":"UPDATE: The missing king cobra has been found. That time your deadly pet snake escaped the house.. bit.ly/2bPTSGW"},{"comment_id":"1024025567641378","commenter_b":"I voted Obama twice Glad I did too.","commenter_a":"Someone pass me the bong he's been taking hits from.","post_message":"Pres. Barack Obama takes swipe at Donald J. Trump's campaign slogan “Make America Great Again” by saying \"America’s pretty darn great right now.\""},{"comment_id":"837370303025890","commenter_b":"Your just another Dumb Female","commenter_a":"Slick willy fits him better","post_message":"Just call him Adam."},{"comment_id":"485435508313696","commenter_b":"She is a dangerous racist!,","commenter_a":"Yes","post_message":"Oprah is going after white people on live television. The hypocrisy is overwhelming. We need to show her we're not going to stand for this. Do you agree Oprah is a racist?"},{"comment_id":"1766583846919055","commenter_b":"I think she is an egotistical show-off.","commenter_a":"I think nothing about it.","post_message":"What do you think of the dress?"},{"comment_id":"10153656233196756","commenter_b":"Kerry Hayes Bryan Hayes James Cadillac Cardarelli told ya","commenter_a":"What?!... Well, I like \"Las Mananitas\" better anyway","post_message":"Ever wonder why you so rarely hear \"Happy Birthday to You\" on TV or the big screen? Turns out that, while it may be one of the most recognized songs in the English language, its copyright is also owned by a music publisher. So, if you're going to sing those famous strains on screen, you'd better be prepared to fork over some cash."}]
