[{"comment_id":"1043659032366340","commenter_b":"Yeah yeah @username, it's airheads like yourself what Trump needs to screw up everything in your country. I will build that wall so that people like you can't come into Mexico","commenter_a":"Look at what Mr. Trump is doing to America as a candidate, dividing it, making everybody fight betweeen each others. Imagine what he would do as president...","post_message":"People could be heard screaming, and Donald J. Trump ducked his head, grabbing his podium with both hands before backing away."},{"comment_id":"10153518895070326","commenter_b":"And who believes her??? This must be a \"Clinton Joke\".","commenter_a":"the old scritch she does know how to lie though,,and has lots of crooked schemes up her sleeve","post_message":""},{"comment_id":"471664429690804","commenter_b":"THERE IS NO PLACE IN AMERICA for SHARIAH LAW !!!, Not Now... NOT EVER.. IF those people want their own laws.. GO BACK where YOU came from... Never to Return !!!....Close our country to ALL Muslims, those who are here, send them packing back where they came from !!!","commenter_a":"OK Here we go again... we are going to let muslim religious practice in government owned facilities but not Christian or Jewish? No prayer or religious organizations (Christian Athletes Association, for example) allowed for anyone in public schools, but exceptions for muslims? They can have time for prayer and muslim student organizations in school, but we are not to have prayers at student events? Come on SCOTUS ... what the heck is going on? We now have separate rules for muslims? Unbelievable. If the muslim inmate can grow a beard then anyone should be able to do it. They are becoming a government sponsored and endorsed religion. They even provide prayer rugs and call to prayer at gitmo. The state shall establish no religion.","post_message":"The Supreme Court just made a shocking ruling on Shariah Law. We must voice ourselves publicly, Shariah Law has no place in America. Do you agree Shariah should be banned?"},{"comment_id":"10154806560781509","commenter_b":"Hillary is a joke. Too bad we didn't have a good candidate. I will not vote for Clinton. The Democrats are losing voters in mass.","commenter_a":"NOT IN JAIL YET......it's not what you know (she knows stuff all) it's the case of WHO....","post_message":"Hillary Clinton just did a Donald J. Trump impersonation, mocking him in a hypothetical debate @webpagelink"},{"comment_id":"1376905028996190","commenter_b":"Once you build the real fence, you will also be a target of terrorist!","commenter_a":"Hypocrisy","post_message":"The agency said it intends to begin building a “taller, stronger” fence to protect the White House grounds by 2018. via NBC Washington"},{"comment_id":"1270203316353471","commenter_b":"she cant and is a skank","commenter_a":"Say what you want about Miley--those pipes of hers are GOLD. period. And, she's been a sole advocate of LGBT and homeless rights. She's young and finding her voice but good for her for wading into the advocacy pool! Applause!!","post_message":"She may be an attention seeking diva with a voice like nails on a chalkboard, but she's also a politically active advocate for women's rights who despises Donald Trump."},{"comment_id":"10153461487831636","commenter_b":"If this woman is happy to make her money from demonising victims whoever they may be then perhaps the rest of us should just think \"what a vile individual she is\" and distance ourselves. What she has successfully done, again, is to spark a debate about herself . Which is probably earning her a fortune . Stop reading the Daily Mail for a start . Johnson was found guilty in court by a jury. Quite rightly the judgement was made on evidence and fact. Not opinion and scaremongering . Let's just stop giving her air time.","commenter_a":"WTH bloody Katie Hopkins ffs again innit???","post_message":"Her comments have sparked a particularly vocal backlash"}]
