[{"comment_id":"10156617842095354","commenter_b":"This is just another Obama liar. Do not pay too much attention to her....Someday everything that they have done will come back and bite them in the butt.","commenter_a":"I've got to ask: Is Shultz starting to look more and more like Jar Jar Binks? What's going on there? I must avert my eyes.","post_message":"***FIRESTORM OF DEMOCRAT LIES***"},{"comment_id":"10153442848704474","commenter_b":"She gives women a bad name.","commenter_a":"Bah bye! Don't let the door hit ya where the good Lord split ya! JUST LEAVE!","post_message":"REPORT: House Democrats ready for Pelosi to retire. Where do you stand?"},{"comment_id":"10154011043376615","commenter_b":"@username fighting for these POS muslims till the end. Listen hag, why dont you leave for Somalia and see how that works out 4 you. Liberal hag!!!!","commenter_a":"The hate and racism on here is disgusting! Most of you don't even know what's happened, you're just ready to jump in with your white supremacist rhetoric. Makes me sick.","post_message":"WATCH LIVE: Officials are providing an update on the victims in the attack at The Ohio State University. WPXI Aaron Martin is in Columbus and will have the latest developments on Channel 11 News at 5:00. MORE DETAILS: on.wpxi.com/OSUAttack"},{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?! This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES. They sound so terrified. :("},{"comment_id":"10154967718641337","commenter_b":"Go fuck your self pussy","commenter_a":"Fuck him and his Walmart brand shit mustache, i'd stone cold stunner this redneck, put him in a coma and have Black Lives MAtter tattooed on his face. Only then i'd forgive this shitstain","post_message":"A stunning conclusion..."},{"comment_id":"10154648148626509","commenter_b":"Women for Trrump!!!: \"They'll be on their knees soon enough.\"","commenter_a":"Woman and Americans for our next president Donald J Trump.. Welcome aboard it's a wonderful ride to the White House","post_message":"This mogul once said he's a member of \"the lucky sperm club.\" How Donald J. Trump sees himself, in his own words: @webpagelink"},{"comment_id":"10153333476251770","commenter_b":"My father is an immigrant from France, I lived 15 miles from the border of Mexico for ten years, I love the Mexican people and so does Trump, don't you see??? People who are in the legal process are being cut in line by illegals. Illegals ruin your wage rates, take your jobs, use our governments program resources. By shutting the border down deporting the illegals the Mexican Americans will get the wage they deserve! As acting, legal tax paying citizens!","commenter_a":"Because the legal Latinos want jobs. The illegal compete and lower the wage rate and that affects the legals ability to make a decent wage.","post_message":"Donald J. Trump beat out his Republican rivals in America's most Latin city Tuesday."}]
