[{"comment_id":"10153810948993717","commenter_b":"Hillary wants to secure our border now - #TrumpWall - @webpagelink","commenter_a":"Great........I wonder which town he plans on hurting this time, forcing the tax payers to pay for his visit, and extra police security while he's here weather they like it or not....glad to see our state has a say in it......","post_message":"Donald Trump will be back in the Granite State on Monday: @webpagelink"},{"comment_id":"10153477026528352","commenter_b":"She should be buried under the jail,","commenter_a":"She's a LOSER.... There's no copping out of the fact that SHE murdered her kids.. Whether dad was around or not is irrelevant.. Plenty of women like myself are single moms and we aren't doing crazy shit like this","post_message":"Mother in court for ‘killing two of her kids and putting them in freezer’ has to be removed after flying into a rage over their absent father"},{"comment_id":"10153614097404199","commenter_b":"Victim or not, that was still unacceptable behavior. She tried to attack her! That lady could have just kept going.... BUT she chose road rage.","commenter_a":"That mom wasn't scared. She was pissed at the person driving recklessly. If she was scared, she could of pulled herself out of the situation at many different side roads and pull offs. She choose to keep following someone she new was driving aggressively putting herself and child in more danger.","post_message":"UPDATE:"},{"comment_id":"907989709297282","commenter_b":"This story will be huge until the next huge story comes along.","commenter_a":"Don't care .","post_message":"Could Bruce Jenner's announcement be a turning point for the transgender community?"},{"comment_id":"10153202664107217","commenter_b":"Pmsl yes, parallel parking to the extreme","commenter_a":"@username u do this with jim?","post_message":"Now that's a nifty bit of parking 🚙 @webpagelink Footage: Guinness World Records"},{"comment_id":"1609547186014156","commenter_b":"#BELIEVELAND","commenter_a":"Believeland! Cleveland! Go Cavs!","post_message":"A BIG day for your Cleveland Cavaliers ! They were honored at the White House:"},{"comment_id":"10153860714632098","commenter_b":"Ok people get real speeches are written for them and each one has something from another as their are only so many things that can be said in a speech such as this. No I am not in favor of our politics right now and feel that neither are a good choice for the US. But that aside do we not have more important things to worry about then what a speech writer gave to the wife of a running mate? Move on and let's get things going in a better place for our country, with so many loosing their lives recently I feel this is a low priority. Let's make change for good elect Mickey Mouse. Lol","commenter_a":"Give her a grade F - fail, flunked, fake !","post_message":"Melania Trump accused of plagiarizing Michelle Obama's speech"}]
