[{"comment_id":"623412734499592","commenter_b":"Stupid ass mofo","commenter_a":"The next President","post_message":"Think quick! Then, click \"like\" on your favorite answers in the comments. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153258414916770","commenter_b":"she more democrat liberal pig","commenter_a":"Megyn Kelly shouldn't be permitted to go anywhere near another GOP debate for the rest of her life after the debacle of the last one she was allowed to moderate..The sooner Fox News fires her off into oblivion the better..","post_message":"Donald J. Trump reignites the drama between himself and Megyn Kelly ahead of the January 28th Fox News Republican Debate."},{"comment_id":"444065119108702","commenter_b":"Please don't come. You would ruin the peace with your complaining.","commenter_a":"Would never go to Texas! Actually none of these states that are so in love with guns!","post_message":"College campuses need books, not weapons."},{"comment_id":"10156240306950551","commenter_b":"God, this women is a beast.","commenter_a":"Then bitch move to Africa.","post_message":"This woman is RACIST!"},{"comment_id":"10153493676581770","commenter_b":"Them bitches will kill you quick as their men.its their belief.","commenter_a":"It's about time!","post_message":"A collection of brave individuals acting on behalf of a little-known non-profit is running daring operations to free Islamic State sex slaves, including literally cutting the chains binding a woman to a bed."},{"comment_id":"10153720423624312","commenter_b":"Thank you. I let my daughter go camping!","commenter_a":"Poor parenting skill for letting her daughter go camping, wow he is delusional.","post_message":"Shirley Fortner, 70, has re-lived the night of her daughter death five times during five prior parole hearings. Bret Arbuckle killed Angela Lyn Fortner in rural Ash Grove, Mo., in 1989."},{"comment_id":"1244207775611835","commenter_b":"That's why she wants to let them all in and use up our benefits and drain it. Enough is enough.","commenter_a":"Well just in case you needed another reason to NOT vote for Hillary here it is. But sadly, this nation is over run with uneducated and uninformed voters who will vote for free stuff that is anything but free to to american taxpayer.","post_message":"Obama used executive actions to grant amnesty to millions of illegal immigrants WITHOUT Congressional approval. Hillary Clinton says she will go EVEN FURTHER!"}]
