[{"comment_id":"10154853515096336","commenter_b":"Go away troll! You don't even live in our country","commenter_a":"I bet a million dollars kellyanne conway gave her soul away for for a few bucks and a pussy grab","post_message":" it up, Kellyanne Conway said to Jill Stein. your friends at the Clinton campaign said it won change the results. Conway suggests that the outrage over the call shows many Americans' unwillingness to accept Donald J. Trump as their president and to give him a chance, which includes Green Party presidential nominee Jill Stein three-state, vote-recount effort. Do you agree? @webpagelink"},{"comment_id":"509999849159970","commenter_b":"So you live in England and wanna talk about raping places for centuries? Bitch please you would be speaking German in we don't not come to Europe and save you bitches.","commenter_a":"He ain't a Muslim, no outrage #Murica","post_message":"DEVELOPING: The search for the suspected gunman continues this morning."},{"comment_id":"1301887483185054","commenter_b":"@username : Colossians 3:18 Wives, submit yourselves unto your own husbands, as it is fit in the Lord. 1 Timothy 2:11-15 Let the woman learn in silence with all subjection. But I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence. For Adam was first formed, then Eve. And Adam was not deceived, but the woman being deceived was in the transgression. Notwithstanding she shall be saved in childbearing. Titus 2:4-5 Teach the young women to be ... obedient to their own husbands, that the word of God be not blasphemed. 1 Peter 3:1 Likewise, ye wives, be in subjection to your own husbands.","commenter_a":"Well... how is this a surprise? Their bible backs up this ideology and states women are lesser creatures, that their only value is their ability to produce offspring and see to their husband's needs. That's all women are to conservative Christians- breeding stock.","post_message":"If you’re a woman you’re likely going to want to deck this a**hole for what he just said."},{"comment_id":"10153541842375329","commenter_b":"Kim has a nice body","commenter_a":"Who wore it better? Kim or Doug the Pug?","post_message":"Way to turn the tables, girls. (via BuzzFeed Trending)"},{"comment_id":"10153606515353132","commenter_b":"She was annoying to watch.","commenter_a":"Brandi was the only person who made the show entertaining #BadMoveBravo","post_message":"Will you miss Brandi on The Real Housewives of Beverly Hills?"},{"comment_id":"10153615881104199","commenter_b":"Crazy lady!","commenter_a":"White trash at its finest","post_message":" knew what was going to happen. I wanted it on tape. Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off road first time. She got behind me a second time and then went to go around again. I let her have the road, called 911, reported her and her plate number I started phone video which was in a holder on dashboard hands free"},{"comment_id":"1231833570240008","commenter_b":"We voted for Obama twice now we are racist. A lot of african's and Hispanics voted for Trump. If Hillary would have been a better candidate and visited the states Trump won she would be president.","commenter_a":"And you're saying that the BLM, BLACK PANTHERS are any different. This shows how blind that you are","post_message":"\"These white Americans tuck their heads under cone-shaped hats and American flags ... training their guns on the unarmed, the innocent, the scared ...\""}]
