[{"comment_id":"1250456418323110","commenter_b":"Wonder what he or she was gonna tell on Clinton. What does that make now 4or5.","commenter_a":"How many more?","post_message":"DEAD!"},{"comment_id":"10154304263504203","commenter_b":"Haha crooked Dems are feeling the Bern, bet rigging the system doesn't seem to nice now does it DWS? Trump is going to destroy Crooked Hillary in November","commenter_a":"Dear Bernie.....GET OUT.","post_message":"Berning bridges."},{"comment_id":"438679209798098","commenter_b":"What a stupid cunt.","commenter_a":"I'm in love with this guy.","post_message":"Tomi Lahren fails to see Lady Gaga's subtle political message and still uses it to rip on Beyoncé. + Hasan Piker is heartbroken Tomi never hit him up when she came out for Bill Maher."},{"comment_id":"10153871207061336","commenter_b":"No dear, Hillary Clinton was First Lady, a US Senator and Secretary of State. This little nobody was never anything close. Glad to help you. Leave the comedy to the professionals.","commenter_a":"This little nobody from Arkansas with no job is still making noise? LOL!","post_message":"\"That's one of the frustrating things about this president – he always tries to make it that he has the moral authority and everybody else is wrong.\" This morning on \"FOX & Friends Weekend,\" presidential candidate Mike Huckabee slammed President Barack Obama's approach to policy disagreements. @webpagelink"},{"comment_id":"1089311434439529","commenter_b":"This surprised me.....even a blind squirrel finds a nut.","commenter_a":"The view sucks all those asswipes on that show should move to Brussels if trump gets elected..","post_message":"\"I can't believe I’m feeling this way...\""},{"comment_id":"10152847768557690","commenter_b":"How do you steal that many cattle without being noticed? Surely someone saw something","commenter_a":"Who let the cows out?!","post_message":"Officials are investigating how 1,121 cattle vanished from a Texas dairy facility >> @webpagelink"},{"comment_id":"10154250068154749","commenter_b":"How does she get away with this rubbish?????","commenter_a":"Diane Abbot is a hypocrite of the first order, always trying to play the race card if the argument does not go her way. As for JC he's a dead man walking yes massive grass roots support but his own back benchers are actively plotting against him and most are preying for bad election results so they can stage a coup. He's lost big backers, even the labour red tops are Luke warm at best. And grass roots support doesn't transfer to the ordinary man and woman on the street who see him as a reactionary 70s throwback and apologist. Labour will either ditch it before the next general election or face annihilation and ditch him and her after.","post_message":""}]
