[{"comment_id":"10152710610321051","commenter_b":"Many Americans dont' have enough to while this couple seems to be eating too much - thanks to benefits they are not entitled to!","commenter_a":"Wrong!!!!","post_message":"A couple that lives off benefits because they’re too obese to work got another gift from taxpayers."},{"comment_id":"1851253931763489","commenter_b":"You WILL get the thin mints bitch!","commenter_a":"Nathan Williamson","post_message":"Knonk Knock, you want these Semoas?-mo Shop.tacticalshit.com"},{"comment_id":"10155004778474136","commenter_b":"This woman is a nut case.","commenter_a":"Skimmers...","post_message":"\"I think he is leading himself into that kind of position where folks are beginning to ask what are we going to do and the answer is going to be, eventually, we have to do something about him,\" Maxine Waters waters said of President Donald J. Trump. FULL STORY: @webpagelink"},{"comment_id":"1168375003221975","commenter_b":"This smacks of Naziism!! He is trying to intimidate the minority vote. He is so disgusting and despicable . We must come out in force to stand up to this type of scare tactics!!!!","commenter_a":"Well in my State, of Washington, like many other States, voting is done by mail or can be dropped off at drop boxes for elections only. So will his people be harassing the Postal employees? And for any States that still go to the polls, those State governments better damn well make sure that ALL citizens can get to their polling places unmolested. And if that means with police protection, so be it. Then, charge the GOP for all of the overtime for said protections that will need to be paid.","post_message":"Unable to win, Trump now looks to blocking Hillary voters with an army of deranged volunteers."},{"comment_id":"1056978507726395","commenter_b":"we Irish and Scottish built it","commenter_a":"Why does she have to keep using the \"I live in a house built by slaves\"? What about the whites, free blacks and immigrants who also helped build the White House? Stop playing the damn slave card already.","post_message":"Warning: Sharing this with your liberal Facebook friends may spontaneously burst bubbles..."},{"comment_id":"947825155333866","commenter_b":"..i got 99 problems but a bitch ain't one","commenter_a":"Wax off wax on Daniel son !!!!","post_message":"This can't be real"},{"comment_id":"10154145784326130","commenter_b":"Woman should act like woman? Barf, if a woman does not shave her legs she is still a woman and there is nothing wrong with that.","commenter_a":"This is kinda stupid I'm sorry. And why did she make her legs so goddamn hairy in the comics? I'm sure that's how they look in real life. Glad you found someone who wants to date someone with legs as hairy as his lol","post_message":"Nothing weirder than true love."}]
