[{"comment_id":"10152695549716615","commenter_b":"My wife has never done drugs.","commenter_a":"That lady obv is a meth head..","post_message":"A second grader who has autism - slapped by a teacher's aide. That boy's parents tell WPXI Joe Holden their son was tapping on the aide's shoulder, trying to get her attention, when they say she hit him. Both mom and dad are now upset with how the school handled the incident. We're learning more about the aide's punishment and why it's just not enough for these parents. Joe is also making calls to the school for a response. He'll have an update tonight at 5:06 p.m. on Channel 11 News."},{"comment_id":"774112892726570","commenter_b":"Shit up traitor go suck on Hillary's nipple","commenter_a":"Know why? Because your last name means he who sands as in sandpaper.","post_message":"Boom. #DemocraticDebate #DemDebate"},{"comment_id":"997479846960469","commenter_b":"Statements of a failed leader","commenter_a":"Not president U S president","post_message":"President Barack Obama said on Friday that the strategy adopted by Russia in Syria is a \"recipe for disaster.\""},{"comment_id":"10153507149617452","commenter_b":"Your so dumb @username. Get ready to go back to Mexico or Cuba or wherever u from. Smh","commenter_a":"you idiots still voting for Trump. Smh","post_message":"New York Primary: Donald Trump and Hillary Clinton have won their parties' primaries in New York."},{"comment_id":"10154060269921162","commenter_b":"BANG...! that's all","commenter_a":"Two things that are impossible... To rehabilitate a terrorist or a child molester. Both should be shot on sight...","post_message":"DISTURBING: Thousands of digital images that show children as young as 5 years old engaging in sex acts with adults were found in an Indiana man's home... @webpagelink"},{"comment_id":"10152943147236680","commenter_b":"Nowadays we have male, female and family bathrooms!!! If you can't hold it in look for a tree!!!","commenter_a":"There's a term called friendly fire...","post_message":"The senior member of the Senate Armed Services Committee opposes the plan announced last week by the Pentagon to allow transgender troops to serve in the military, saying “it wouldn’t work.”"},{"comment_id":"1135738829807996","commenter_b":"Lydia, you should learn to shut up","commenter_a":"What's next? Calling Thanksgiving Indigenous People's Day II? Why don't they pick their own day. Why is it, like MLK Day, they have to replace long beloved holidays?","post_message":"BREAKING: The City of Phoenix just became the largest city in the country to recognize Indigenous Peoples Day, unanimously voted by the city council. It will take place the second Monday of October."}]
