[{"comment_id":"10152816296297452","commenter_b":"I hate possums they look like big rats","commenter_a":"Time to burn the house down","post_message":"Can something be totally terrifying and completely cute at the same time? We've seen a lot of \"wild animal in the city\" stories here in Southern California: bears, coyotes, mountain lions... But this could be the wildest. What one L.A. woman found in her closet is lighting the internet on fire. @webpagelink How it got in... how it got out... and the reason it was so angry. Tonight at 11 from ABC7 Eyewitness News. Courtesy: Tara McVicar"},{"comment_id":"10153077775262994","commenter_b":"Linda shove it up your butt. Lions all the way!","commenter_a":"Detroit needs to suck it up, quit whining, and get over it!","post_message":"What more can he say?"},{"comment_id":"578813518988176","commenter_b":"He needs to be voted OUT","commenter_a":"Give them his job ! Asshole","post_message":"What do you think?"},{"comment_id":"1069894739689449","commenter_b":"That is a bunch of hog wash. It is not about keeping your knees together til you are married. If a girl and a boy want to have a sexual relations then they can buy their own rubbers or birth control pills. Since we have Obama Care I am sure birth control pills will be covered. So even the children who have gone to college can have sex responsibly now that parents can keep their kids on their insurance long after they graduate from high school. If these youngsters can afford smart (cell) phones they sure as heck can afford birth control pills. .","commenter_a":"Amen to that","post_message":"\"Ladies, unless you want the stain of guilt upon your soul, keep your knees together until you're married and put Planned Parenthood out of business.\""},{"comment_id":"10153092200332869","commenter_b":"Mrs.Clinton will never be president and a Democrat will not get the presidential office. Either republicans or the third party is getting the presidential office. I do not accept the same-sex marriage.","commenter_a":"So proud of Gov Huckabee's strong stand against same sex marriage. Sets him apart from others who shun the issue. Will be a strong president!!","post_message":"Governor Huckabee was on Fox News tonight to discuss the Supreme Court's divided ruling on gay marriage, and the need to reject judicial tyranny and protect religious liberty. WATCH ⬇️"},{"comment_id":"10153467191368132","commenter_b":"She is definitely showing side boob. I wouldn't let my daughters wear that when they're old enough for prom","commenter_a":"I like the dress! Maybe we should teach our boys to control themselves instead of teach our girls they should feel ashamed of their bodies.","post_message":"What do you think of the open-back design?"},{"comment_id":"694905427350625","commenter_b":"@username do you have special \"illegal spotting\" glasses? How do you know who's here legally & who isn't? Can you just look at people and tell or what? It's ok for them to fight in the army but because they're \"illegal\", they shouldn't be able to live here. Illegal immigrants aren't the problem, racists are","commenter_a":"I'm a Mexican who lives in Mexico, I had to say that before someone comments that I should be deported. Let me tell you that WE, you and us, are not enemies, yet your federal government, and Trump have treated us like such. The point is that some of us even share family living in both sides. I do have lots of American friends who I care for and respect greatly. I do also know that the majority of Americans are decent, honest, hardworking, generous, and God loving people. I am not against you neither most of my fellow country men are. I ask you from the bottom of my heart and trying to appeal to your reason and kindness not to let all this crazy stuff mess with our relationship as fellow humans and as good neighbors. We are friends and family. Let's keep it like that. Thanks for ...","post_message":"We certainly have. Image by Occupy Democrats, LIKE our page for more!"}]
