[{"comment_id":"618380188311949","commenter_b":"Go home? Come back Nikki, come back!","commenter_a":"I've hated being called \"Nikki\" all my life as a nickname, but in Prince's honor, I guess I'll go home and get my grind on. :-(","post_message":""},{"comment_id":"1148960128472164","commenter_b":"Beat the whore","commenter_a":"Ok idiot, lets say this girl had no idea he was married and after realizing how dumb you are, he leaves you bcz he knows deep down that he is to blame not the girl....","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."},{"comment_id":"10152515657266717","commenter_b":"Not really applicable but you forgot \"love\" ;)","commenter_a":"Game, Set, Match. Give it up.","post_message":"Join our mailing list for a daily news recap: lgbtqn.at/mail Follow us on Twitter: lgbtqn.at/tw"},{"comment_id":"872561492840104","commenter_b":"Just STFU!!!!","commenter_a":"You know he's an imbecile when he says the president should b e like a rapist,drugger of the unsuspecting; Bill Cosby","post_message":"\"America's Mayor\" wades back into the fray."},{"comment_id":"477526855778749","commenter_b":"@username It won't because its Racist...You that Dumb??","commenter_a":"Celebrating Diversity while excluding whites is NOT Diversity. It is Discrimination.","post_message":"“Seeking NON-WHITE men and women, ages 20s to 30s, for Broadway and upcoming Tours!” the casting notice for \"Hamilton the Musical\" read."},{"comment_id":"10152879295577623","commenter_b":"A lot of girls are...","commenter_a":"Worst part is...SHE looks like she was cute,pre meth...","post_message":"A man and woman from North Carolina were arrested in Louisiana and face charges of manufacturing meth."},{"comment_id":"10153094131986378","commenter_b":"Nothing is going to happen to this so called mother ...because if a white judge sentenced her to prison..she'll pull the race card.......","commenter_a":"Can we leave her in a hot car???","post_message":"TODDLER LEFT IN 117-DEGREE CAR: An Arizona mom has been charged with child abuse after surveillance video showed her leaving her toddler locked inside a hot car while she went shopping at Walmart. See the surveillance footage:"}]
