[{"comment_id":"1097574603596883","commenter_b":"Lol those mother fucks love my ankles","commenter_a":"Ruben Yunv Castillo","post_message":"Why do they torment me and leave everyone else alone?!"},{"comment_id":"952520861503939","commenter_b":"We need to send in a drone and level the place. I will be tainted now and need to be rebuilt anyway.","commenter_a":"Operation White Privilege hasn't had an accidental firearms discharge yet. That has to be some kind of record.","post_message":"Do you not want the government to 'Waco' you? Because this is how you get the government to 'Waco' you."},{"comment_id":"405363642956925","commenter_b":"Bitches can try","commenter_a":"Come bring that b.s. this way I'm ready","post_message":"The video is titled \"A Message Signed With Blood to the Nation of the Cross.\""},{"comment_id":"1849468845289358","commenter_b":"@username rn she sitting on a strap thats why u so butt hurt😂😂😂😂","commenter_a":"She kicks some dude out of her show cause he didn't want to record her and now she does this shit... she's straight up trash.","post_message":"Doesn't look like this promoter is playing games! #WSHH #YoungMa"},{"comment_id":"636835003152516","commenter_b":"In these cases the police are the terrorists","commenter_a":"Balck white man woman cop civilian.. the real enemy is Terrorism.. and they are using all this crap to keep us from conentrating on them","post_message":"An important conversation for America. President Obama participates in special town hall event on race, justice, and policing. @webpagelink #POTUStownhall"},{"comment_id":"10153312130831051","commenter_b":"its a MUTE SUBJECT!!! THERES NOT ONE RUNNING FOR PRESIDENT ... AMERICANS ARE SICK OF THIS CRAP !!!!!!!!!!!","commenter_a":"I would beleive Mr Carson anyday over Obama or any of his men......","post_message":"The Obama administration just slammed Ben Carson for saying America shouldn’t elect a Muslim president. Who do you think is right here: Carson or the Obama administration?"},{"comment_id":"838829739577213","commenter_b":"Yes! They should be arrested!","commenter_a":"As long as it includes under God!","post_message":"This is disgusting. Do you support the Pledge of Allegiance?"}]
