[{"comment_id":"1461062437286833","commenter_b":"Glad he found out before she gave him a STD nasty hoe","commenter_a":"who cares","post_message":"Brutal. (From Elite Daily)"},{"comment_id":"917384355021286","commenter_b":"I would love to see Trump/Carson..... Trump because you can't push him around. carson because the man is just smart!","commenter_a":"How does a troll like Trump make America great. When he can't run a business without filing for bankruptcy. You get no I screwed it up and need a do over in politics. Just ask GW Bush. Anyone hear Trumps policy other than he's going to be great. I I don't think so. Let's call him the carnival barker and clown show that he is. And his supporters if you don't like government than don't participate. A vote for a angry clueless egotistical clown won't help America.","post_message":"Republican 2016 frontrunner Donald Trump is a stain on our country. Image by Occupy Democrats."},{"comment_id":"10154028228372060","commenter_b":"B*LL S**T.","commenter_a":"Assuming this is true, this is unacceptable. What a horrible thing to say to someone.","post_message":"A Muslim teacher in a Georgia high school said someone left her an anonymous note in her classroom, telling her that her \"headscarf isn't allowed anymore.\" The note also told her to \"tie\" her headscarf around her neck and \"hang yourself with it.\""},{"comment_id":"10152749769427894","commenter_b":"Fuck u Im beautiful somebody love it and u must love I don't have time to entertain your stupid ass go suck a sick dick bye bitch. Go suck Bruce Jenner dick look like u in love with him","commenter_a":"Bruce Jenner is a joke wtf look how he look","post_message":"Too Far? Jamie Foxx Jokes About Bruce Jenner During the iHeartRadio Music Awards [Video]"},{"comment_id":"369489863429570","commenter_b":"Ship her out ban her from AMERICA","commenter_a":"I agree she should be arrested","post_message":"President Trump says Madonna is 'disgusting' and a 'disgrace' to America because she said she wanted to blow up the White House. Agree or disagree?"},{"comment_id":"460743430758281","commenter_b":"No! That's why you have insurance! If you don't want a kid and the responsibilities that go with it, don't have unprotected sex. Better yet, keep your legs together and your pecker in your pants!","commenter_a":"NO NO NO!!!!","post_message":"\"Whatever happens, this likely won’t be the last we hear from Notre Dame, or the Supreme Court, on the accommodation.\""},{"comment_id":"10153279327706973","commenter_b":"Your saying this restaurant chain is hateful and kills animals when dozens of others do exactly the same thing? You do know that cows and fish are animals and killed in order to make the food you find at McDonald's, Burger King, Wendy's, Arby's, Subway, Taco Bell, Panda Express, Red Robin, Dennys, IHOP, etc. right?","commenter_a":"Don't do it! They're a little too conservative for our area. Do people really want to support a company that not-so-secretly opposes equal rights (not to mention the whole killing of animals thing...)? @webpagelink","post_message":"The fast-food chain is looking to to add one or two restaurants a year until there are 10 to 12 locations in the greater Portland area."}]
