[{"comment_id":"10153787356025667","commenter_b":"Hello pretty lady","commenter_a":"Here's a fact for you Ms. Arnaud: Have you ever heard of Robert Byrd? Hillary considered him a close friend and mentor. Do some research.","post_message":"Hillary Clinton gave one of her strongest rebukes against Donald Trump at a speech in Reno, Nevada. @webpagelink"},{"comment_id":"820349888068915","commenter_b":"No she does not!","commenter_a":"@username Melinda Caskey @username Angela Fisher Claudia Billings @username","post_message":"Hillary Clinton says she’s tired of Bernie Sanders’s campaign lying about her. The only problem is he’s not lying, she is."},{"comment_id":"1210892618945831","commenter_b":"Ain't no clan rallies, ain't no alllivesmatter, ain't no trump rallies...none of that bullshit up here ya'll mother fuckers get fucked up up here talking that bullshit. If you ever in the big Apple look me up.","commenter_a":"Edited for narrow minded people who want to pick apart a comment as opposed to seeing the big picture: Why do things like this only get attention when the victim is attractive? When this same thing happens to anyone other than black people, it only gets attention when they are affluent or attractive. This SAME THING happens to white people MORE OFTEN than it does to black people and doesn't get the OVERALL attention it deserves. It's not even a black or white thing at this point. It's about what the main stream media will and will not cover. BLM is BULLSHIT and only service to segregating the people and preventing ALL OF US to come together to address these issues. If we cannot band together and fight the power they are the ones winning while we are killing each other. #knowyourenemy","post_message":"I am literally in tears. Full story: @webpagelink"},{"comment_id":"1473072332752510","commenter_b":"@username So do God Almighty, do you have a problem with Him also taking care of them? When you stand before Him on JUDGMENT DAY, you are going to be sorry you didn't do anything to help them also. Because God Almighty said, TREAT THEM WITH KINDNESS AND AS A NATIVE (meaning CITIZEN) BORN IN YOUR LAND. I WILL DESTROY ALL WHO TURNS AWAY AN ALIEN(illegal immigrants). I guess your behind is going to FRY big time come JUDGMENT DAY.","commenter_a":"The kids look healthy and happy.. And she taking care of them that's all it matters.","post_message":"EXCLUSIVE: 'I had to kill Octomom to save my life.'"},{"comment_id":"10153982167589203","commenter_b":"What a pussy cant go against his witch of a wife!!!!","commenter_a":"@username Lorenzo Antonino","post_message":"\"If we're not a part of the solution, we're a part of the problem.\""},{"comment_id":"1166911916662170","commenter_b":"Quit being a girl!!!!!!!!!","commenter_a":"People should remember that clearly there are innocent people in both jails and prisons. How would you like to be an innocent person in jail or prison, getting beaten up....with people cheering on further for you to be additionally brutalized?","post_message":"Inmates at New York's Clinton Correctional Facility say they were beaten, choked and slammed against walls by guards seeking information after 2 convicted killers escaped."},{"comment_id":"1039031896153505","commenter_b":"How many immigrants do you personally know? I'm guessing none","commenter_a":"Every one of you idiots came from immigrants","post_message":"The immigrant population in the U.S. is more than 4 TIMES what it was in 1970."}]
