[{"comment_id":"794416220665090","commenter_b":"Eat a dick.","commenter_a":"One word...SCHMUCK","post_message":"PA President demands bodies of ‘martyrs’ killed in recent attacks, says Israeli public ‘deceived’ by leaders"},{"comment_id":"970145053025967","commenter_b":"Remember: it's all politics ...and about votes. The GOP is garnering for the 'jewish' vote in 2016.","commenter_a":"Talk about shooting yourself in the foot...! Between this \"journalist\", Boehner, and Bibi, the court of public opinion may not be so kind. Obama will most likely rise above the pettiness, but like he said, there WILL be consequences. He is after all the actual elected President of the United States.","post_message":"Conservatives and Pro-Israel groups are now actively undermining the US President. This is about as un-American as it gets."},{"comment_id":"10153122318985950","commenter_b":"The bitch is the devil.","commenter_a":"stand Firm Kim .Dont Backdown .The Devil Never wins unless You let him .","post_message":"Before returning to work today, Ky. clerk Kim Davis said she is being \"forced to disobey her God,\" and that she still won't authorize marriage licenses for same-sex couples."},{"comment_id":"10156132117065725","commenter_b":"I appreciate you being so kind and politically correct. And you laid out a solid, arguably INDISPUTABLE, case there. But, as you pointed out, this is absolutely willful ignorance, so real facts don't mean anything when talking to a trump supporter. They have a feeling, form a belief from that feeling, and then that feeling morphs into a \"fact\" without any due diligence. And, unfortunately, all of their beliefs stem from feelings of bigotry (irrational hatred of an entire group of people). I'd love to have an honest conversation with a trump supporter about his policies. But they won't, because trump doesn't have any feasible policies, he simply says things are bad or good (which we all have the ability to do). What any trump supporter does when confronted with a lack of actual policy, with his track record of insults and short sighted aggression, is blame someone else somewhere ...","commenter_a":"The man did not make a \"nasty or controversial statement.\" He made a series of absolutely false allegations. Correcting him after he spoke could not possibly have been construed as interfering with his right of free speech; you would have only been interfering with his right to be ignorant. Which, apparently, is a sacred right to some of your supporters. And if somebody had made a series of absolutely false statements about you to the President, yeah, I'm pretty sure he would have corrected them.","post_message":"If someone made a nasty or controversial statement about me to the President, do you really think he would come to my rescue? No chance! If I would have challenged the man, the media would have accused me of interfering with that man's right of free speech. A no win situation!"},{"comment_id":"10155209654718974","commenter_b":"Donald J. Trump 3 mins Statement Regarding Recent Executive Order Concerning Extreme Vetting is a proud nation of immigrants and we will continue to show compassion to those fleeing oppression, but we will do so while protecting our own citizens and border. America has always been the land of the free and home of the brave. We will keep it free and keep it safe, as the media knows, but refuses to say. My policy is similar to what President Obama did in 2011 when he banned visas for refugees from Iraq for six months. The seven countries named in the Executive Order are the same countries previously identified by the Obama administration as sources of terror. To be clear, this is not a Muslim ban, as the media is falsely reporting. This is not about religion - this is about terror and keeping our country safe. There are over ...","commenter_a":"Stay strong","post_message":"We're at Portland International Airport for the second day of the #nobanpdx protest against Donald Trump's executive order on immigration."},{"comment_id":"10153324267994411","commenter_b":"just for the record most women have long skirts in their wardrobes,","commenter_a":"Good decision, if she wants to live in France then she should follow French rules/laws etc and in this case the dress code, the \"its my culture\" card doesn't work in France. Which is a good thing","post_message":"A 15-year-old French Muslim girl was banned from her class for wearing a long skirt reflecting her religious affiliation."},{"comment_id":"10153617872056636","commenter_b":"Islam isn't but a lot of it's exponents use it as an excuse to kill.","commenter_a":"No religion is peaceful, it divides opinions which leads to violence.","post_message":"Show this next time someone claims Islam is violent"}]
