[{"comment_id":"1032281423464900","commenter_b":"Oh please. You gotta be kidding. I will say Madcow needs the ratings for sure.","commenter_a":"When you get the guts to go on Rachel Maddow's show, please let me know.","post_message":"I talked with Fox News’ Gretchen Carlson this afternoon about the House passage of the Homeland Security Appropriations bill. As I told her, we made a commitment in December to seek to block President Obama’s lawless, unconstitutional amnesty using the \"power of the purse.\" Today we upheld that promise by doing our part to pass the strongest, most conservative bill that we could. I hope you’ll take a moment to watch."},{"comment_id":"10153191924801051","commenter_b":"really wow is all i can say about most of the post. what i have to say on this. i hope the gangs keeps to themselves and kill eachother off only and not hit any one that is not in gangs and not hit children. this world would be better off with out them and there needs to be an end to the gangs white or black there needs to be an end to them and i hope this would be the end. they need to do this more offtin if it gets rid of the riff rats and drugs and robberys and help brings the streets safer. and we might not have to see anyones butts any more. they really need to pull their paints up. i dont like that my kids has to see such things. total disrespect. the ones that love in peice would love this","commenter_a":"maybe the police should see how many gang banger's they can kill in 1900 day's","post_message":"Two gangs in this city are holding a contest to see how many people they can kill in 100 nights. #100Days100Nights,"},{"comment_id":"1768583180066710","commenter_b":"suckass","commenter_a":"This man wants to get us another 1.3 trillion up in deficit","post_message":"WATCH LIVE: Donald Trump campaign rally in Waukesha"},{"comment_id":"10155201075949657","commenter_b":"why would a woman vote for this asshole he calls them FAT PIGS","commenter_a":"I'm surprised women don't value honesty more in light of Hillary's proven lies","post_message":"Trouble."},{"comment_id":"1002013776554647","commenter_b":"I dont think Buying Sex is a Game Changer Anymore. Lets get Real Here. You got a Lunatic Acting Like Hitlers Twin Brother Running and Thats Ok? Buying a Hooker is somehow More Repulsive?","commenter_a":"Intriguing.","post_message":"It sounds like this information could definitely ruin a campaign -- and it WILL be released."},{"comment_id":"853999368022756","commenter_b":"He's a busy man filing all his bankruptcies!!! Lol","commenter_a":"His excuse for failed marriages is hes a busy man. Whats his excuse for all his bankruptcies.","post_message":"Trump admitted that his marriages aren't traditional but claimed that it's different for him because he a \"hardworking person.\""},{"comment_id":"997631186950175","commenter_b":"That would be a terrible thing to do and there are many who would adopt that precious child","commenter_a":"Well if I was pregnant with a fetus with Down's Syndrome I would abort the fetus. Not everyone can raise a special needs child. I would not put it up for adoption, that would not be an option. That's just my opinion.","post_message":"Yes it does!"}]
