[{"comment_id":"10152994999515326","commenter_b":"Screw you laurie. Are you a tea bagging bitch?","commenter_a":"Good man!","post_message":""},{"comment_id":"1387674034582344","commenter_b":"@username if i had a girlfriend i probably would not watch porn, but women are picky and i am nothing special.","commenter_a":"BAN PORNOGRAPHY...simple. It is a debauched and at times cruel form of sex and at the moment is fully open to those low-lives whose brain thinks it's fully acceptable to either engage in such ridiculous practices or expect their partners to or inflict it on others. Of course this terrible crime on this poor girl was inflicted by a deviant but the role of watching pornography put fuel to the fire...BAN IT!!!!!!","post_message":"The man who held Elizabeth Smart captive when she was a teenager regularly looked at pornography, which \"just led to him raping me more,\" the now 28-year-old woman says in a new video."},{"comment_id":"1022294177808818","commenter_b":"Just normal housewife.","commenter_a":"Meat grinder, feed hogs, use poop for fertilizer, only positive outcome...","post_message":"Not even a little tiny bit sad over this. Nope."},{"comment_id":"836649156384109","commenter_b":"he s a crook","commenter_a":"Shake hands then shoot the f'er in the head.","post_message":"Rahm Emanuel just wants to be friends with Chicago unions"},{"comment_id":"10154134010956323","commenter_b":"Be careful, please. Chose a president because she is woman is sexism. Here in Brazil we already had our first woman president, and this brought to us hope about a better country, but now she is under impeachment process due responsibility crimes made and allowed by her. This not means that women are worst than men, au contraire, I have been working with many managers, directors and executives women and found professionals better than men. Point is, be careful with WHO is the woman you are choosing.","commenter_a":"No.","post_message":"\"Following a decisive victory in New York and with her path to the presidency ever-more surefooted, the possibility of the first female president is sinking in. And whatever your feelings about Hillary Clinton as the vessel for this achievement, it’s an extraordinary one.\""},{"comment_id":"1704753069786736","commenter_b":"THEY SHOULD BE TAKEN TO GITMO NEVER TO GET OUT!","commenter_a":"Need to be hung by the balls","post_message":"If you were in charge, would you have these deported back to where they came from? @webpagelink"},{"comment_id":"10152842669910779","commenter_b":"Feminazi alert","commenter_a":"Why aren't you showing her as an athlete, instead of an object? Such utter bullshit.","post_message":"She’s “a beast.” The “most dominant athlete alive.” The “greatest athlete” UFC president Dana White has ever worked with. But what’s her life really like? And how did she go from living in her car to being MMA’s unstoppable force? Erik Hedegaard tangles with Ronda Rousey. Click through to read the full feature."}]
