[{"comment_id":"1142065182546406","commenter_b":"Bye... That just means another wall.","commenter_a":"California can secede from us like texas did. Theyre their own entity but it comes with a price to pay. The time when earthquakes peel it off the rest of the world they can b their own saviour!","post_message":"They're calling it #Calexit"},{"comment_id":"1108048615955838","commenter_b":"Betty is a murderer!","commenter_a":"Just joined. Is this purge night or something","post_message":"WATCH LIVE: Protesters are filling the streets in Charlotte after police say an officer shot and killed an armed man. @webpagelink"},{"comment_id":"10154138321738837","commenter_b":"I read she was with the lady already in line she just had more items for her. She did'nt skip the line. That racist pos was out of line enough said! Pendeja!!!!!","commenter_a":"Realistically speaking if you're with someone and they're at the counter cashing out who's going to go to the back of the line if they were \"Together\" and you're only adding an item or two?? saying she should have went to the back of the line is both irrational and impractical... part of the problem is making excuses for the inexcusable...","post_message":"#RACIST RANT RECORDED: A woman's Tuesday night racist rant while Christmas shopping goes viral on social media."},{"comment_id":"922572661194216","commenter_b":"Yep, she's illegal.","commenter_a":"Karma people, Karma! What you put out towards an innocent child will come back to you and it's well deserved.","post_message":"Ivanka Trump announced the arrival of Theodore James Kushner on Twitter."},{"comment_id":"1172930249409099","commenter_b":"I get chastised for bad grammar but she gets a free pass for talking about wanting to Murder Men. Cough** cough** cognitive dissidents. Cough** cough**","commenter_a":"Yes, it is called bandwagoning. And the sad fact of it is that now we will never know how many of them were being honest and how many are lying for the limelight. Cases like this only cast doubt on instances of rape, unfortunately. If you are victimized, report it immediately. Don't wait.","post_message":"Awful."},{"comment_id":"615120388649797","commenter_b":"I don't think it should be considered treason, I think it IS treason. How do you Snopes check this? And where is the link to the Washington Post article?","commenter_a":"Guys we have no choice. They are so advanced we have no choice","post_message":"This should be considered treason."},{"comment_id":"635163520007560","commenter_b":"If she is illegal,DEPORT her and all 11 of her illegal children!!!","commenter_a":"why should she,she get everything free here and we are paying for it and our military men and women get nothing","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"}]
