[{"comment_id":"10158494825160725","commenter_b":"Why do you care what others do????? It's a saturday. Most people get that day off . dRump loves the bossy bitches. Go grab a pussy","commenter_a":"Get a job/life.You have way to much time on ur hands.","post_message":"Thousands of demonstrators are expected to take to city streets this weekend for the Women's March on Chicago, one day after Donald Trump's inauguration."},{"comment_id":"1324023564281057","commenter_b":"FUCK YOU FUCK sharia law GO HOME ALLUH FUCKTARDS","commenter_a":"It is so wrong","post_message":"Florida Democrats Approve Bill That Imposes Shariah Law On Women. You can't force your religion on other people. Do you think this wrong?"},{"comment_id":"10154996363431337","commenter_b":"We have a incest pedohpile leading USA. The ignorants have come out from their caves.","commenter_a":"At least he'll bring back jobs!- every ignorant trump supporter.","post_message":"Donald J. Trump really shouldn't be tweeting about nuclear weapons..."},{"comment_id":"10154496837959170","commenter_b":"Only LAZY UNEDUCATED PEOPLE BELIEVE IN A LYING WHITE WOMAN-hillary.","commenter_a":"BOOM killary!","post_message":"Hillary promises to continue Obama's economic policies. The latest results of those policies came out this morning. Splat!"},{"comment_id":"10153091950239205","commenter_b":"IF YOU'RE ILLEGAL ALIENS IN AMERICA, THEN YOU HAVE NO BUSINESS HERE, JUST LIKE MEXICO TREATS AMERICANS! PEOPLE WHO WANT TO COME HERE LEGALLY ARE WELCOMED.","commenter_a":"The mexican solution (Donald Hitler )","post_message":"Donald J. Trump's detailed and foolish immigration plan explained."},{"comment_id":"576110785930150","commenter_b":"@username did she grab them by the pussy?","commenter_a":"Read stories that when Slick Willie was president, the spent more of their time protecting him from Killary than anything or anyone else when she went on her ballistic tantrums.","post_message":"Not only is she corrupt, she's also beyond rude and disrespectful to those who protect her very life. So many who've worked for her attest to her nasty nature. natl.io/ghciVB"},{"comment_id":"10154277505591509","commenter_b":"At the end of the day, Banning Muslims from this country isn't going to fix the problem. They will find another way to hurt us. It's an ongoing threat that's not going to stop unless you eliminate the threat.","commenter_a":"I've never seen so much racism in my life, say it ain't so, but the comments and the reactions are very disturbing.","post_message":"\"The fact is what Donald J. Trump said yesterday disqualifies him from serving as president,\" The White House Press Secretary Josh Earnest said Tuesday. @webpagelink"}]
