[{"comment_id":"10154939979936729","commenter_b":"she belongs behind bars","commenter_a":"Hillary Clinton goes to a gifted-student primary school in New York to talk about the world. After her talk she offers to answer questions from the kids. One little boy puts up his hand. Hillary asks him what his name is. \"Kenny,\" he says. \"And what is your question, Kenny?\" she asks. \"I have three questions,\" he says. \"First -- what happened in Benghazi? \"Second -- why would you run for president if you are not capable of handling two e-mail accounts? \"Third -- what happened to that six billion dollars that went missing while you were Secretary of State?” Just then the bell rings for recess. Hillary tells the students that they will continue after recess. When they resume Hillary says, \"Okay, where were we? Oh, that's right, question time. Who has a question?” A different boy -- little Johnny -- puts his hand up. Hillary points to him ...","post_message":"Yes. She. Did."},{"comment_id":"447034255487155","commenter_b":"No vet should have to remove their stickers, as for the Obama supporters they should be kicked out of the neighborhood.","commenter_a":",yes","post_message":"Should This Vet Refuse To Remove His Decals? Comment 'yes' or 'no'."},{"comment_id":"1116747615049049","commenter_b":"Women frequently nurse their Babies in the train station where I work - I applaud it as natural and organic and cannot imagine why in Heaven's name it is such an issue - (we all come with identical equipment and this is what breasts are for) Nursed Babies are much healthier than those bottle fed","commenter_a":"Beautiful","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"},{"comment_id":"1061054770617718","commenter_b":"I'm voting for you Hillary!!!","commenter_a":"That will be hard to do from Leavenworth. But if she thinks she can go for it. Bill will be too busy I am afraid to help though.","post_message":"“It’s clear she knows how to get things accomplished in these crazy political times. She’s still standing after decades of Republican attacks, and she’ll force them to the table once in office.” -Iowa Starting Line"},{"comment_id":"10154362244534778","commenter_b":"This is a symptom of disrespect. Did the office overreact, perhaps. What do you do with a teenager that doesn't listen to authority? Continue to let her disrupt the class? This girls deserves to be punished. She may have gotten hurt because of her initial defiance but she is not a victim. They should review the incident and I hope they clear the officer of everything and I hope they give the girl detention. If we don't stop the disrespect, the result is anarchy.","commenter_a":"This kid did not attack anyone she may have ignored commands peacefully as most protestors will do but in no way is that a crime. The violent attack from this cop was in fact a crime.","post_message":"About 100 students wore T-shirts reading \"Free Fields\" or \"#BringBackFields.\""},{"comment_id":"921846451264234","commenter_b":"Hey al sharpton you and the guy next to you with the dorkey looking glasses on why don't you preach for colored people to be good instead of hate or is it because your so friggin stupid . I never realized that years ago back when you were a fat boy some one tried to kill you I guess your were spared so into the future you could spread your hate .","commenter_a":"Pay your taxes Deadbeat ! plus penalties, plus interest, You will when Trump takes over !","post_message":"\"...offensive and insulting.\""},{"comment_id":"10156364820535615","commenter_b":"Best liars contest? Hmmm... Now, I'm not saying that he hasn't told his fair share of lies throughout his life. Who hasn't? But, have you heard of a woman named Hillary? She'd have no problems at all winning that contest. Not just winning, but OBLITERATING the competition.","commenter_a":"Glad to see half of Americans are smart enough to realize that. We've come a long way when it comes to equal rights and racism. Let's not go backwards and throw all of that way. Donald Trump is not a good candidate for President !!!","post_message":""}]
