[{"comment_id":"848324611946507","commenter_b":"Actually I spent a number of years in special ops in the military, we called guys like you \"Dinky Daos\".","commenter_a":"ISIS thanks Senator Cruz for supporting their strategy to create a war of religions.","post_message":"The Obama Administration has no foolproof vetting process, and this is tantamount to rolling out a welcome mat for terrorists to this country. Congressman Jeff Duncan and I have together introduced legislation that would empower states to use their Tenth Amendment authority to opt out of the national refugee resettlement program. Our legislation requires the federal government to inform states of its intent to settle aliens within their borders, and allows governors to reject those aliens if a governor believes that the refugee presents a security risk. Our children’s safety tomorrow depends on our ability to secure America today."},{"comment_id":"1762485630649940","commenter_b":"In the world of medicine, an incorrect diagnosis could possibly be as good as death. So in this case, yeah. Alternative medicine does kill.","commenter_a":"\"Alternative medicine kills\" what the heck?! It didn't kill her, sure it didn't save her, but it certainly wasn't the cause of her death.","post_message":"Being vaccinated could have saved this child. Being taken to a qualified medical doctor rather than a quack could have saved this child. Alternative medicine kills."},{"comment_id":"10152995708842217","commenter_b":"Really perhaps one glass too many some would say Suspicious.....","commenter_a":"Aww 😢💔 poor Cilla..","post_message":"She was sunbathing at her Spanish home when she she stood up, lost her balance and fell"},{"comment_id":"10152872089786135","commenter_b":"Nations aren't doing too well and filled with hate, before this law was passed.","commenter_a":"We all know what God does to nations that disobey His word and goes rampant","post_message":"BREAKING: U.S. Supreme Court requires states to recognize marriage between two people of the same sex. LIVE UPDATES: @webpagelink"},{"comment_id":"10152700491620779","commenter_b":"Heavens to Betsy, woman. Have you tried Fortitude?","commenter_a":"Thanks @username. I'm currently watching BB. Yes, I really am.","post_message":"Let's face it: We are currently living in the all-you-can-eat-smorgasbord era of TV viewing choices. The downside is that the abundance of stuff at our fingertips also makes it easier for jaw-dropping, mind-expanding small-screen masterpieces to come and go without so much as a peep. From a British gangster thriller to a surreal riff on twentysomething single life, click through for 10 shows you should be watching this year."},{"comment_id":"10152948081757144","commenter_b":"She's just as bad. I will never vote for her.","commenter_a":"Not a fan. She's a liar and a thief. In bed with Walmart and Monsanto. She's a evil war hawk.","post_message":"So much for transparency."},{"comment_id":"10152718223821051","commenter_b":"Shut up cunt","commenter_a":"this can not be","post_message":"Darren Wilson is about to get sucked back into the Michael Brown shooting case."}]
