[{"comment_id":"1747901745468646","commenter_b":"Do the same to that raghead bitch","commenter_a":"Is this true? If it is, she needs to be on death row!","post_message":"Muslim Nanny Who Beheaded 4 Year Old Girl Will Not Face Murder Trial Because... This is the world we are living in today people. What do you think her punishment should be?"},{"comment_id":"10152653245300671","commenter_b":"Then get off of their butts and go through and jump the hoops just like all of our legal immigrants.","commenter_a":"this is so wrong. Take care of Americans first. Illegal immigration is wrong. I don't care what country or why you came here illegally, if you were a kid you have had plenty of time to do it legally, yet too lazy......","post_message":"The Migration Policy Institute says about 1.2 million people are eligible for the plan under the DACA rules. But now many more would become eligible if the president expands the program to eliminate the age cap. That cap includes a Modesto woman who’s been in the U.S. since she was a teenager. Ron Jones has her story."},{"comment_id":"10152907368938525","commenter_b":"wth this world really sucks or should i say the women who dump their babies suck....","commenter_a":"I would probably adopt it too if i could. How sad but beautiful","post_message":"He was heading to work when he made an unexpected discovery."},{"comment_id":"10152700491620779","commenter_b":"Heavens to Betsy, woman. Have you tried Fortitude?","commenter_a":"Thanks @username. I'm currently watching BB. Yes, I really am.","post_message":"Let's face it: We are currently living in the all-you-can-eat-smorgasbord era of TV viewing choices. The downside is that the abundance of stuff at our fingertips also makes it easier for jaw-dropping, mind-expanding small-screen masterpieces to come and go without so much as a peep. From a British gangster thriller to a surreal riff on twentysomething single life, click through for 10 shows you should be watching this year."},{"comment_id":"1076817779005244","commenter_b":"We'd have a beautiful First Lady!","commenter_a":"Don't want her or him","post_message":"If Melania Trump succeeds Michelle Obama as First Lady, she may trace her road to the White House back to 1987 and a chance encounter in the capital of her native Slovenia. Find out more about Melania: @webpagelink"},{"comment_id":"10153855436966337","commenter_b":"It's a final effort to get her extra viewers lol","commenter_a":"God no! Jim Ian Eric Jesse Omar Eric","post_message":"PRETTY COOL: Do you want to see 'Supergirl' meet up with 'The Flash'?"},{"comment_id":"1377352988951720","commenter_b":"@username ok naked girl","commenter_a":"Chaos? Not really, just a bunch of virtue signaling, brainwashed and hypocritical snowflakes doing their stunt... Stop this nonsense, people support Trump!","post_message":""}]
