[{"comment_id":"10153044064759456","commenter_b":"That is exactly the thought that went through my head!","commenter_a":"Yet this A**hole gets a $500,000 bond.....whew this judicial system!","post_message":"A Montgomery man is being held on a $1.25 million bond after being arrested for allegedly trafficking methamphetamine. @webpagelink"},{"comment_id":"444065119108702","commenter_b":"Please don't come. You would ruin the peace with your complaining.","commenter_a":"Would never go to Texas! Actually none of these states that are so in love with guns!","post_message":"College campuses need books, not weapons."},{"comment_id":"1748645152080208","commenter_b":"heck ya we need a woman in the white house","commenter_a":"That's what I'm talking about Clinton 2016","post_message":"BREAKING: NBC News projects Hillary Clinton as the Democratic presumptive nominee. Read more: @webpagelink"},{"comment_id":"10154647718578132","commenter_b":"Ahhhh...women tearing other women down! How mature!","commenter_a":"At least she did the mop on her head somewhat decent tonight","post_message":"First Lady Michelle Obama delivered an unusually personal and emotional speech at tonight's #DNC."},{"comment_id":"1369422333077793","commenter_b":"Witch Hillary and hubby slick Willie..","commenter_a":"#Trumphasmyvote","post_message":"Is there any stopping Hillary Clinton and Donald J. Trump now? Let's take a look at the math."},{"comment_id":"10153639993996135","commenter_b":"She is a criminal....wake up!","commenter_a":"Her speech was excellent! Very well spoken and original.","post_message":"What did you think of the First Lady's speech?"},{"comment_id":"1146391592075725","commenter_b":"ANOTHER RACIST TO PODIUM","commenter_a":"Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry Hilarry hilarry","post_message":"LIVE: Presidential Nominee Donald J. Trump is in Warren to speak to supporters just 8 days before election day. More info: bit.ly/TrumpvisitsMCC"}]
