[{"comment_id":"965586620162170","commenter_b":"Scumbag","commenter_a":"....too many \"GUNS\" on the street....and who is holding these guns????? The criminals, thugs, refugees, muslims, and other monsters that are given free reign and encouragement to commit these crimes against innocent citizens! Another elected official with his head up the governments butt!","post_message":"BREAKING…CAUGHT ON TAPE: 30 Yr Old MUSLIM MAN Ambushes, Shoots Philadelphia Cop Several Times “I’m shot. I’m bleeding heavily!” Muslim shooter says he did it \"In the name of Islam\" When Obama's War On Cops and Islamic Terror collide...."},{"comment_id":"1024025567641378","commenter_b":"I voted Obama twice Glad I did too.","commenter_a":"Someone pass me the bong he's been taking hits from.","post_message":"Pres. Barack Obama takes swipe at Donald J. Trump's campaign slogan “Make America Great Again” by saying \"America’s pretty darn great right now.\""},{"comment_id":"10153445196113984","commenter_b":"She has no right to control any thing!","commenter_a":"Not only does she not have any class, she is ugly and gross! I do not care if she is republican or democrat she is just nasty!","post_message":"This has to be very embarrassing for the First Lady. Hopefully this doesn't make her try even harder to control Americans... Do you think Michelle Obama as First Lady is bad for America?"},{"comment_id":"1313943068640455","commenter_b":"Ol bitch ass!!! Now come love on meeeee","commenter_a":"@username Amber Nicole yo ass lol","post_message":"Her mood swings are real!"},{"comment_id":"10153367837094714","commenter_b":"You just don't understand feminism, boys are free to do what they want to do women should be just as free, to have sex, get drunk and behave carelessly just like boys do.","commenter_a":"Why would they take offense? Because they want to protect the image and dignity of young women? Seriously?","post_message":"Wow, we didn't see it until we looked closely"},{"comment_id":"10153067823099411","commenter_b":"My respected fellow u explain very nicely like a poet and blame to muslim now one question who attack on Afghanistan who is killing innocent people in Pakistan by drawn attacks who is killing Muslims in burma. who is killing Muslims in Africa,and one thing listen Islam is the religion of peace not terror first study islam than make justice infront of me 10 cristians got Islam its not the issue main point is that dont try to impose religion war make the world peaceful place not hell thank you","commenter_a":"Copy and paste this on ALL muslim stories! Flood them with the truth! The Shoe Bomber was a Muslim The Beltway Snipers were Muslims The Fort Hood Shooter was a Muslim The underwear Bomber was a Muslim The U-S.S. Cole Bombers were Muslims The Madrid Train Bombers were Muslims The Bafi Nightclub Bombers were Muslims The London Subway Bombers were Muslims The Moscow Theatre Attackers were Muslims The Boston Marathon Bombers were Muslims The Pan-Am flight #93 Bombers were Muslims The Air France Entebbe Hijackers were Muslims The Iranian Embassy Takeover, was by Muslims The Beirut U.S. Embassy bombers were Muslims The Libyan U.S. Embassy Attack was by Muslims The Buenos Aires Suicide Bombers were Muslims The Israeli Olympic Team Attackers were Muslims The Kenyan U.S, Embassy Bombers were Muslims The Saudi, Khobar Towers Bombers were Muslims The Beirut Marine Barracks bombers were Muslims The Besian Russian School Attackers were ...","post_message":"Hundreds of thousands have flooded the streets of Chechen capital of Grozny in a rally against the publication of the Prophet Muhammad by Charlie Hebdo magazine. The demo, dubbed to Prophet Mohammed, was organized by region clerics and united muslims from various regions of Russia."},{"comment_id":"1158047454312031","commenter_b":"STOP THIS IN AMERICA!! Send illegals back! Police those that are here legally. These people want us dead....when did that change, folks????","commenter_a":"If they want to kill off their women and children nothing we can do about that. I have no problems shooting anyone who is coming after me. It's us or them. I say us","post_message":"It's only a matter of time before children will be doing all the dirty work. These monsters MUST be stopped. @webpagelink"}]
