[{"comment_id":"10153333951429575","commenter_b":"We do.","commenter_a":"It's called intuition. But I'm glad it happened.","post_message":"\"I just said I need to go check on him working on the car. I just believe a spirit told me.\" She felt something was wrong with her husband--and she was right."},{"comment_id":"932489970229038","commenter_b":"Nothing compares to what Bill Clinton did as Gov of Ark, and in the White House with Monika Lewinsky and other women..same with John F Kennedy, with Marilyn Monroe, and mistress of a Gang boss, and nude swimming parties. They both dis honored our White House...where was the media..and why were they voted in twice...","commenter_a":"I agree! Mr. Trump has changed in the past 11 years but Hillary Clinton has not except for the worst!!","post_message":"Dr. Robert Jeffress, Senior Pastor of the First Baptist Church in Dallas, Texas, stated that he still supports Donald J. Trump, despite the GOP nominee's controversial 2005 comments."},{"comment_id":"10153053080376336","commenter_b":"She should have been thrown put on her fat a**.","commenter_a":"How about firing the witch for inappropriate behavior toward our Veterans! She's disgusting!","post_message":"\"Had she been a veteran herself or served in the military, she would probably have a different thought on how she treats our veterans.\" The Veterans Affairs manager in Indiana who mocked her patients’ mental health has been placed on paid administrative leave."},{"comment_id":"879507305458832","commenter_b":"she wants everyones money , she is so poor !","commenter_a":"Or Vince Foster. Can't forget her law partner who magically killed himself with an antique firearm that didn't function....Interesting.","post_message":""},{"comment_id":"1401080203318363","commenter_b":"Well eventually there will come a day of reckoning.","commenter_a":"Notice how these people claim to be Christian meanwhile they do the opposite of what Christians do & they dislike true Christians as much ad they do people of other faiths, they quote the bible to support their homophobia but they don't except & love people who are different, like God says that they should","post_message":"This is absolutely deplorable."},{"comment_id":"10153127480747411","commenter_b":"That's what boobs are for, to feed your children. Yet women can walk around in boob pasties and thongs but that's ok, get real!!!!","commenter_a":"Proud nursing in public Momma right here.. never feel shamed. If you want to cover, go for it. If you want to go in private, do it. If you want to feed your baby in front of the world, go right on ahead. It's boobs people. But you have no problem with bikinis that show WAY more of most women than when nursing their child. Grow up","post_message":"NURSING MOTHER: POLICE SHAMED ME A Nebraska mother breastfeeding her 4-month-old son in public says an officer threatened to cite her for indecent exposure if she refused to cover up. What do you think about this?"},{"comment_id":"881915648510562","commenter_b":"Bitch you wanna get arrested????","commenter_a":"@username we talked about this as well","post_message":"The dark history of why cocaine is illegal... (ATTN: is excited to launch a new series about the history of illegal drugs)."}]
