[{"comment_id":"1076188252391484","commenter_b":"body slammed my ass this little cunt held on to the desk causing it to fall over with her nasty ass in it!!!! and now we'll have a litany about the evil whitey cop from some negro lawyer and welfare mama.","commenter_a":"Quick make a judgement before the facts come out.","post_message":"Student body-slammed by South Carolina officer"},{"comment_id":"10152924972954342","commenter_b":"No the mother didn't give meth to the baby, the baby was born with it in its system meaning the mother used drugs while pregnant, she had the baby at home so they wouldn't test her or the baby BC when they come up positive CPS will take the child away","commenter_a":"...and exactly where was he going with this baby?? These crack heads now days are BOLD","post_message":"Police say this confessed drug addict was caught on camera smuggling his 2-day-old baby out of the hospital in a plastic bag. He was stopped by hospital staff after triggering an alarm and putting the hospital on lock down - but no one ever looked inside the bag he was carrying and they let him go."},{"comment_id":"10155879050540354","commenter_b":"Stop these muslims from coming into our country. Please. Trojan horse.","commenter_a":"I can't wait to force them to bake my gay wedding cake.","post_message":"Some truly shocking statistics in this article..."},{"comment_id":"1774184492816291","commenter_b":"@username racist idiot.","commenter_a":"NO WAY! No one else should be added to Mt. Rushmore, but especially not Obama! There are a lot better President's that could have been added, but not him!","post_message":"Obama's Face To Be Inserted Into Mt. Rushmore. Don't mess with this national monument. Do you think Obama's face does not deserve to be up there?"},{"comment_id":"963953273645145","commenter_b":"Lets not forget our own NATIVE AMERICANS!!!","commenter_a":"Obama was being kind, to only mention the crusades! the destruction, genocides, and murders throughout history tell, a much more terrifying truth!","post_message":"If a person in good faith was truly hurt by these comments, their faith is pretty damn weak. Suck it up, know your history, and grow from it. You don't like someone calling you out for the atrocities you didn't commit? Welcome to the life of every Muslim American."},{"comment_id":"1792520417642435","commenter_b":"Darlene is a freaking moon bat low life from Mars. Leave the scum alone.","commenter_a":"desroy Clinton, do not hold back, destroy this criminal.","post_message":"Crooked Hillary Clinton wants to essentially abolish the 2nd Amendment. No gun owner can ever vote for Clinton!"},{"comment_id":"761596003989174","commenter_b":"Sure","commenter_a":"TRUMPET THE SCARIEST ORANGE CAT GRABBING PSYCHOTIC CLOWN AFTER TRUMPET LEARNED A FOREIGN DIGNITARY SAID TRUMPET SHOULD PRODUCE HIS BIRTH CERTIFICATE TO PROVE TRUMPET WAS NOT SPAWNED BY A SCARY ORANGE APE ! TRUST TRUMPET WITH NUCLEAR WEAPONS ?!!!","post_message":"Too soon? Lol. - kyle"}]
