[{"comment_id":"1854344181462778","commenter_b":"Trump!!! Build that wall!!!","commenter_a":"This time they'll just say \"we need to stop this black on black crime\"","post_message":"WARNING: This video is graphic and may be upsetting to some viewers. @webpagelink Officials released surveillance footage showing a violent takedown by an officer on a train platform in Houston. The officer resigned and authorities said the investigation was still ongoing."},{"comment_id":"1509437802422806","commenter_b":"All you ladies with your agendas should probably put it to ACTUAL LEGITIMATE use and aim it where it belongs: at your incoming government. I for one, have never just gone around grabbing random pussy or publicly proclaimed that I wanna fuck my own offspring. Actions speak so much louder than your weak ass words. Pick the RIGHT battle, for once!","commenter_a":"Call me crazy, but this dudes most impressive moments happened in a wheelchair on a kids show. So...he's banging an old whore. Whoopity-Do! I don't get and never have gotten the hype. Lol","post_message":"Drake won 2016."},{"comment_id":"10152829806276636","commenter_b":"U can't find african american in this kind of situation coz they are at home just waiting for their money from welfare...since when african american have their sense of urgency in going to work?","commenter_a":"Ironically, wasn't there a case in US of an african american single parent who was desperate for a job, left her children (older than this one) in car in car park so that she could attend interview....put in prison and her children removed, that just doesn't seem very fair does it?","post_message":"He'd got half an hour to work before making the realisation..."},{"comment_id":"10153397415338984","commenter_b":"Guess you are be careful about who you ask to suck your dick!","commenter_a":"Very old","post_message":"Watch what happens when this bully starts a fight with the wrong guy... he didn't see this coming. The cameras caught this entire fight... Are you happy he got a giant slice of justice?"},{"comment_id":"10155752220095603","commenter_b":"Black lives must not matter too much, stupid idiots cannot stop killing each other.","commenter_a":"Tired of all this carp. Can we get along for a change.","post_message":""},{"comment_id":"10154517651704166","commenter_b":"Ash, Nc","commenter_a":"Hi from","post_message":"Mother of son hit with books at school speaks out"},{"comment_id":"392535437595004","commenter_b":"What a misogynistic jerk!","commenter_a":"WTF? what a loser! how is this guy in politics? what a loser!","post_message":"No, there's no GOP war on women."}]
