[{"comment_id":"662636977246385","commenter_b":"This is stupid why not help other people or animals","commenter_a":"More money than sense. !!!","post_message":"She already owns two Apple Watches 😕"},{"comment_id":"10154151078661002","commenter_b":"Oh please just remember who killed the most Americans on American soil they were not Black or White that's what's wrong with this country if we banned together we would never worry about muslim terrorist! They wouldn't stand a chance against the blacks and whites of America","commenter_a":"Because he's a pale person his information is not even released yet","post_message":"3 dead in Lafayette theater shooting WATCH: @webpagelink #Local4Today"},{"comment_id":"1536859509948075","commenter_b":"I don't want your butt in my face! Haha","commenter_a":"@username think we could do this?! Haha","post_message":"That feeling when you've made it to Friday... via JukinVideo"},{"comment_id":"1715281765380661","commenter_b":"These adulta should be ashamed of themselves! Hoping whatever league they are in bans them from attending any more games!!!","commenter_a":"What a bunch of degenerate so called parents and adults. Useless to kids and society","post_message":"WATCH: Brawl breaks out between coaches at an under-10 baseball game. The stunned little kids don even know what to do. The video was provided to ABC News by a spectator. @webpagelink"},{"comment_id":"10153082513017169","commenter_b":"Another sold out POS that wants another war. Shoot the c**ksucker.","commenter_a":"Poor outcomes across the board.","post_message":"What does Scott Walker believe? Where the candidate stands on 10 issues (From PBS NewsHour)"},{"comment_id":"10153287604604753","commenter_b":"but she took the oath of offce before the Federal government made the ruling.","commenter_a":"She is an Apostolic Christian. According to #17 in the Apostolic Christian Church's Statement of Faith \"Governmental authority is respected and obeyed. Members serve in a non-combatant status in the military. Oaths are not taken, but truth is affirmed.\" With that being said, she violated her religious beliefs when she took the oath of office, and is violating her beliefs again by disobeying the law and court orders. Source: @webpagelink","post_message":"Kim Davis is reportedly unwilling to resign her position at the court until she is permitted to deny marriage licenses to gay couples on the grounds of her sincerely held religious beliefs. This means the clerk is planning to stay behind bars until someone grants her requests. Her lawyer, Mat Staver, spoke to reporters outside Carter County Detention Center on Friday."},{"comment_id":"10154088282393145","commenter_b":"@username, if we could just have put a wall up around the DNC convention center, we'd have a great start catching many of the illegal immigrants.","commenter_a":"Didn't See any American Flags on stage or anywhere anyone else notice that I guess showing pride for our country is out the window if your a democrat","post_message":"She took some hard digs at Donald J. Trump and didn't even mention his name. What did you think of her speech?"}]
