[{"comment_id":"10153589793400329","commenter_b":"10154197025200954Mary Lu10154879708717248","commenter_a":"Ryan Bere still wanna do this?","post_message":"Jaws IRL."},{"comment_id":"10153675678941037","commenter_b":"I always thought I was a billionaire on Fridays, but by Monday reality always let me know otherwise.","commenter_a":"Hey John J. Reardon check out this guy disrespecting the Marines !","post_message":"From the upcoming Donald J. Trump biography"},{"comment_id":"10155143556313701","commenter_b":"Watch and you might learn something. @webpagelink","commenter_a":"The woman left behind her child in a hostile environment so she could save her own skin just to turn around and blame Trump's temporary travel ban as why her reunion with her child got delayed. Talk about one selfish mother.","post_message":"While in the vetting process a Somali refugee, named Sahara, gave birth to her son. Children are not automatically approved to travel, though, so she left her son with her mother in Uganda to speed up the process."},{"comment_id":"10158325816450192","commenter_b":"@username I do worry about that difference is I can go in the bathroom with my son. Can't do that with my daughter. Point is if you a swinging a sausage you have no reason to be in a womans bathroom.","commenter_a":"@username How is it fair to let a man use the same restroom as my Daughter. Its not marginalization of those that are different its preventing those that don't need to.be exposed to it. Sorry to.many sick-o's in the world today to alow this.","post_message":"The Trump administration will revoke federal guidelines telling public schools to let transgender students use bathrooms and locker rooms matching their chosen gender identity, a government official said Wednesday."},{"comment_id":"10155691016515354","commenter_b":"She actually spoke about how she respected the woman who hated blacks and called basically for their removal!! Ya right, she supports her own money making agenda, let's go conservatives and keep this creepy crook out of \"OUR HOUSE\"!!","commenter_a":"Now the Democrat liberals are trying to get criminal minds to help enforce their power! Criminals joining criminals. Wake up folks !! Crooks for crooks!","post_message":"Clinton said that she was fighting “for the grandmother who’s turned away from the polls because her driver’s license expired.” If she didn't want it to expire, she could have driven once or twice since 1996..."},{"comment_id":"10152882517291051","commenter_b":"Just lie a Black woman to get defensive-----you have a crush on him? Michelle won't like it.","commenter_a":"A lot better the Barack Hussein Obama.","post_message":"The next time you meet someone who doesn't like their name, tell them about this guy and remind them that it could be worse."},{"comment_id":"10153514692996135","commenter_b":"No other president has lived on the \"people's money\" like obama has except maybe the clintons ! They have all had their homes before they got elected and actually used them for \"vacation\" time etc. among other things ! If I have to tell you you must have been asleep for the last 7 1/2 years !","commenter_a":"Pretty good sized house for making pocket change for 8 years. It is funny how all the poor people he was supposed to help are still living on the streets and in the slums of the city ! But the scum always rises to the top ! ! !","post_message":"Check out these photos."}]
