[{"comment_id":"1057489254266735","commenter_b":"Deport all illegals ..............","commenter_a":"The funny thing is that it's NOT about amnesty. It's about getting control of a situation that's currently OUT of control. If we don't move forward with the current plan, than what? Yes folks we are not in the same situation, but a much worse one. SIMPLE! Think about it, they are already currently living here and paying NO taxes. Unless we can beam these people up bye my calculations, YEP, there still here. Let's look back at what was actually said, the President NEVER said he was going to legalize any body's current status, just give them a chance to apply while working on there current status. Is it such a bad idea to have these people come out of the dark?","post_message":"I've been telling people for I don't know how many years, you know it as well as I do that's what this is all about. But no Democrat's ever admitted it."},{"comment_id":"10154725381070579","commenter_b":"You may want to look into Stein or Johnson... Hillary is a corrupt habitual liar and anyone that does not see it, is not the sharpest knife in the drawer...","commenter_a":"I'm a United States Army Veteran and I'm With Her. Trump's complete failure to understand basic foreign policy concepts, his relationship with Putin, and his out-of-control ego are a one-way trip into a third world war. His kind of \"leadership\" is the last thing America needs. Clinton isn't perfect but she's better than any of the other candidates today.","post_message":"Active & Retired Military: Your choice in 2016?"},{"comment_id":"10153906891941051","commenter_b":"When you don't treat a woman right - she will do you wrong.","commenter_a":"Wish I had not read this.","post_message":"A man came home early only to find his wife in bed with someone else. The worst part? It was with the absolute last person he'd ever expect to find her in bed with."},{"comment_id":"10153640013936636","commenter_b":"O questo o un procione non voglio altro siamo io e te li vedi li vedi Dio pinolo?!","commenter_a":"Luca sparati in bocca con me","post_message":"Red pandas have an adorable wrestling competition Via Detroit Zoo"},{"comment_id":"1820350008207308","commenter_b":"She will sell us out to the highest Middle Eastern bidder","commenter_a":"GIVE US A LIKE! -----> @username your TRUSTED Conservative News","post_message":"TRUMP LIVE! Donald J. Trump Rally in Sioux City, IA Like us for TRUSTED conservative news---> Freedom Daily"},{"comment_id":"1724892717782853","commenter_b":"We are in America! Speak English woman! Lol","commenter_a":"@username they read my post!","post_message":"\"Hail Hydra\" are two words no one ever expected Captain America to say."},{"comment_id":"10154160813994657","commenter_b":"She is a criminal","commenter_a":"She's a disgrace, so are the people that support this nonsense","post_message":"Playing by her own rules?"}]
