[{"comment_id":"10153365714833352","commenter_b":"Stupid bitch!","commenter_a":"Mental illness is real...","post_message":"Woman ordered to stay away from her baby after throwing child from car tells judge ‘I need a break anyway’"},{"comment_id":"1836028549960584","commenter_b":"She is our next President.actually Trump made it easier for her .","commenter_a":"Yeah, it pisses me off ... but my respect for her has just gotten greater.","post_message":"She and her supporters smile and thrive despite a daily avalanche of hatred."},{"comment_id":"508999315933206","commenter_b":"Well done Doc! I too wish you had more airtime, but we that follow you know!","commenter_a":"You are my 2nd favorite candate running. Would be 1st if not for you shaking hands and smiling with Al, Sharpton! Al Sharton!!!' What good can he possibly do for you?!!!!","post_message":"A leader listens when the American people speak. Unfortunately, our stage was filled with plenty of rhetoric and shouting politicians. I want We the People to know I hear you. Although I didn’t have much time to share my common sense solutions with you on stage, I look forward to continuing my clear, concise vision with the American people as I did tonight. Even more, it’s clear that the people were listening – we gained over 100,000 friends and patriots on Facebook during the debate. I am humbled by our over 400,000 Twitter followers that made us the Most Mentioned candidate on Twitter during the debate. We the People are fighting for freedom, and tonight is proof that the American people are winning."},{"comment_id":"1005002076233312","commenter_b":"We do but not you please.","commenter_a":"She doesn't have a heart","post_message":"Do you agree with Hillary Clinton? #SCPrimary"},{"comment_id":"1701853746697814","commenter_b":"Dan Chow I maybe a old , but I am not fool !! I been follow Hillary since She was First Lady !! I know how amazing She is !! If you care to know the true about this Lady !! Check: ADDICTINGINFO.ORG list of @username accomplishments !! This are the Facts !!!","commenter_a":"2008 was a President Obama Time !!! <3 Hillary is that Leader for this TIME !!! <3","post_message":"In 2016, everything we’ve accomplished together is on the line."},{"comment_id":"1252245104845317","commenter_b":"So sad, the Hispanic ladies had more class then the racist. Also sad no one had the courage to stand up to her!!","commenter_a":"That's messed up. She forgot that U.S has the freedom of language","post_message":"This racist woman went off on two Hispanic shoppers with a racist rant and no one did anything to stop her. More on this story here: @webpagelink"},{"comment_id":"1028867523831550","commenter_b":"STFU pussy","commenter_a":"Misunderstood character, he was not some badass Ranger, he was literally some kind of clerk who got brought along at the last minute. To me, this character represents the fears of what the average person would feel in that situation.","post_message":""}]
