[{"comment_id":"1708950036028896","commenter_b":"@username I have a problem with Mexicans coming back even after the wall is built. What they did to this country is almost irreparable damage, it's overwhelming, and the amount of people they killed is staggering. You NEVER read about an American killing a Mexican. But you do read the opposite. You can't take the illegal out of an illegal. They will always be a dark cloud of problems to any society they get it. They can't change, they're programmed that way. They will bring virus' disease and plunder. Even the ones running their country a derelicts of the 3rd kind, their intent is to make America part of Mexico, that's why they send them, that's why they don't assimilate and want YOU- (Americans to assimilate) ...(google \"The RECONQUISTA / Mexicans say they will take America without firing a single shot\")..this is why Vinente Fox and Jorge Ramos are trying ...","commenter_a":"The role of our government is to keep its citizens safe.....sadly they are failing \"A house with no walls will collapse\"","post_message":"“This is something that’s happening almost on a daily basis now, that we have illegal immigrant criminals that are committing murder or rape or numerous child predator type actions.” – Steve Ronnebeck"},{"comment_id":"10153562599204087","commenter_b":"#DumpTrump","commenter_a":"cruz your a fool the media has been trying to destroy trump and help you. cruz you are stupid","post_message":"“Every accusation you raised is incorrect,” Ted Cruz told Fox News host Chris Wallace when asked about his campaign’s role in spreading falsehoods about rival Ben Carson in Iowa. “I appreciate you reading the Donald Trump attack file on that.”"},{"comment_id":"10152801050747377","commenter_b":"Not in favor with illegals, but let's not forget that we are here illegal too, the Indians are the only people here legally!","commenter_a":"Let's raise the percentage point!","post_message":"56 percent are against granting amnesty to 5 million illegal immigrants currently living in the United States."},{"comment_id":"950004335054969","commenter_b":"She loves him..get over it!","commenter_a":"I sure hope he makes a full recovery, not only for his kids and himself, so that gold digging piece of garbage he is still legally married to cannot get a dime of his money. It is disgusting how she is sitting at his bedside just waiting on him to die because everyone knows she does not give a crap about him. The Kardashians are a cancer that needs to be eradicated.","post_message":"#PrayForLamar Lamar Odom gives his family and friends a sign of hope after awaking from a coma. The gesture is sure to warm your heart. Meanwhile, Lisa Morales, the mother of his two children speaks out on Odom’s early improvements. FOR THE LATEST ----> @webpagelink"},{"comment_id":"10153220983921770","commenter_b":"@username Then why did her husband push Trump to run?","commenter_a":"Trump is nothing but a Clinton crony who is trying to split the Republican vote to ensure a Clinton win. He is NOT a Conservative! @webpagelink","post_message":"After PolitiFact found that Donald J. Trump's first television advertisement uses footage of immigrants pouring over the Morocco-Spain border instead of the U.S.-Mexico border, the Trump campaign gave a blunt response to NBC News."},{"comment_id":"10153273305921051","commenter_b":"Sick ass Mother fucking Bastard, needs to be castrated and beat to death so he can feel the pain that poor baby felt, it just sickens me to hear of these evil people in the world.","commenter_a":"Convicts will likely shove reality up his ass!","post_message":"This guy did something awful to a 19-month-old girl. Now he's going to face the consequences."},{"comment_id":"1211860118868990","commenter_b":"Hopefully Bernie can take control of congress, and we can keep moving this country forward! #DontPushAmericaBackwardsAgain","commenter_a":"It's gonna be ... Huge ...!","post_message":"I hope today we defeat Donald Trump, and we defeat him badly. iwillvote.com"}]
