[{"comment_id":"10154467987919342","commenter_b":"Ban cars. They kill more people than guns.","commenter_a":"Guns. Taking people's lives needlessly everyday because we let anyone and everyone have them. Not it's not a mental health issue. It's the acceptance of daily gun violence in our society. People will read this story and move on. Congrats NRA. Kill more Americans daily for our freedom to own guns. #GunsHaveMoreRightsThanPeople","post_message":"#Breaking: I 69 at Spur 527 is completely shutdown after a minor accident led to a deadly shooting."},{"comment_id":"10154464854894087","commenter_b":"Your fucking Scum","commenter_a":"World's Greatest Groper...engraved on the back of the medal.","post_message":"BREAKING: President Obama awarded Vice President Joe Biden with the Presidential Medal of Freedom -- the highest civilian honor -- in the surprise ceremony."},{"comment_id":"10156232723535354","commenter_b":"There is no viable comparison to prohibition. This is not a gun ban. It's apples and oranges. This is simply sensible purchase laws.","commenter_a":"The answer to something like this is not more laws imposed by a federal government. It never works, it never will. Did prohibition prevent alcohol consumption? After prohibition alcohol became more dangerous to consume; crime increased and became ; the court and prison systems were stretched to the breaking point; and corruption of public officials was rampant. Prohibition removed a significant source of tax revenue and greatly increased government spending. It led many drinkers to switch to opium, marijuana, patent medicines, cocaine, and other dangerous substances that they would have been unlikely to encounter in the absence of Prohibition. Now we have the \"War on Drugs\" has that worked? Has Lyndon B Johnson's war on Poverty reduced poverty? It's been 50 years and it appears to be getting worse every year, there are approximately 100 million americans receiving some type of government assistance, an all time high. Has the department ...","post_message":"\"This makes Mercer just one more public attacker who cooperated fully with all gun control, then went on to commit heinous crimes against innocent life.\""},{"comment_id":"118155238703506","commenter_b":"Yes, to bad they are ruining a great state. It's going to take more than Hollywood to support the illegals. Have fun, I'm gone","commenter_a":"Hell yesss goodbye","post_message":"There could be 49 states of America very soon. It's only a matter of time. Good riddance. Do you think we would be better without those libs?"},{"comment_id":"10154166667183205","commenter_b":"Very well done mr. Congressman, proud to have shaken ur hand once when u visited vegas.","commenter_a":"Thank you! I'm proud of you! great speech! Facts and more facts!","post_message":"I gave a speech this morning on the House Floor welcoming the new leader of the Republican Party to Capitol Hill and showing him what is on the menu in the cafeterias today -- taco salads (the food Republicans eat to show their love for The Hispanics) and strawberries (which almost certainly were picked and packed by undocumented farmworkers), which is a little ironic given that the GOP now wants to deport 11 million people, mostly Latinos, from the U.S."},{"comment_id":"10154254891359411","commenter_b":"@username I'll piss on your sphincter","commenter_a":"I love anal sex. Anal orgasms are stronger than vaginal ones. Personally, I waited til I had kids to do it coz I didnt want to stretch out both holes, but if teens want to prematurely stretch out both holes simultaneously, that's their business.","post_message":""},{"comment_id":"10154592396721336","commenter_b":"What a concept...build a wall! Did they get the idea from President Bill Clinton?","commenter_a":"All borders need to be secured.","post_message":"In what could be a \"told you so\" moment for Donald J. Trump, the U.K. announced plans to build a \"big new wall\" at a border port in France to prevent migrants in nearby camps from sneaking aboard vehicles heading to Britain."}]
