[{"comment_id":"1154933824548403","commenter_b":"Kill every last pig","commenter_a":"Well done Syria","post_message":"Watch Syrian forces closing in on the Daesh Takfiri terrorist group’s de facto capital Raqqah."},{"comment_id":"10153534824302550","commenter_b":"She wasted our tax dollars on fantasy.","commenter_a":"Why is everyone so negative? A thirteen year old took a state to court. That says alot. Why is it OK for the president to waste money talking about climate change but not her. Get your heads out of your Butts people. She is not the problem, but did try to come up with a solution","post_message":"A judge has ruled against a 13-year-old girl who took North Carolina to court over climate change More ---> @webpagelink"},{"comment_id":"1731231320495188","commenter_b":"Fool","commenter_a":"Now ratify Obama's choice for Supreme Court judge.","post_message":"Backed into a corner, Senate Republicans have given up trying to repeal Obamacare."},{"comment_id":"10153038783201717","commenter_b":"She is absolutely ridiculous","commenter_a":"Dude she had how many warnings to do her job and she refused? Did the judge think that putting her in jail then taking her out would scare her into doing her job now? I highly doubt she's gonna get out and be like \"oh yea imma start issuing out these licenses now, even tho its against my religious beliefs\" pffft fat chance.. -_- I'm so sick of this bitch","post_message":""},{"comment_id":"10154316928129740","commenter_b":"Haha I look for radar too","commenter_a":"Driving in the personal car you see a vehicle in oncoming lanes that is definitely speeding.. You check the dash mounted radar that isnt there... Also constantly go to adjust the ghost ear piece off duty.","post_message":"These funny habits that follow you home — even after retirement — prove that officers are never truly off-duty."},{"comment_id":"1592202987743626","commenter_b":"She needs to go to jail and pay a Big big fine to get back some of those illegal millions she got","commenter_a":"anyone following trump is b😀😀 tshit car cra !!!!!!","post_message":"\"I think [Hillary Clinton's] greatest accomplishment will be getting out of her email scandal.\" — Donald J. Trump @webpagelink"},{"comment_id":"10153881139329456","commenter_b":"Not Thugs , WORTHLESS TRASH!!!!! \\b","commenter_a":"Look all you people who argue what a thug is. Those two are thugs.","post_message":"Missouri police say the 2-year-old was left alone in his crib for 38 hours and reportedly died from hyperthermia."}]
