[{"comment_id":"536178543246730","commenter_b":"Meg Whitman is a disgrace and a lousy CEO.Bitch needs to shut the hell up.","commenter_a":"She's a fool","post_message":"SICK & SHAMEFUL"},{"comment_id":"10153784629291323","commenter_b":"So women are overly sensitive and need to \"man up\"?","commenter_a":"Actually, men do say and do the things they say on the internet in person to women, and the reaction by society and the bosses is about the same: yawn.","post_message":"\"If the things said by men to women on the internet were said by men to their female colleagues in workplaces, they would be fired. If they were said by men to women in public spaces, they would be removed [..] The belittling and bullying, threats and harassment, cyberstalking and outright hate speech directed to women on the internet every day is real-world behaviour with real-world consequence and it should oblige real-world punishments.\""},{"comment_id":"633419350152037","commenter_b":"Bye, don't come back","commenter_a":"His gravy train parliamentary salary wasn't enough he must have found another income that was better for less hours","post_message":"What's next for David Cameron?"},{"comment_id":"10153260257844614","commenter_b":"Signed!! And shared!!!","commenter_a":"Let's start a petition to ban this person. Apparently not fit to perform the duty","post_message":"Gabriel Fernandez parents allegedly beat him to death after dousing the little boy with pepper spray, forcing him to eat his own vomit and locking him in a cabinet with a sock stuffed in his mouth, according to court records. Now, the Department of Children and Family Services supervisor who was fired after it was determined he missed opportunities to save the 8-year-old Palmdale boy is close to getting his job back. Gregory Merritt was among those who decided to close Gabriel case shortly before his death even though he knew the boy had written a suicide note and had a BB gun pellet embedded in his chest. A civil service panel recently voted unanimously to reinstate Merritt, imposing a 30-day suspension in lieu of termination, the L.A. Times reported. Read KTLA story here: @webpagelink"},{"comment_id":"1105112639584987","commenter_b":"She's an embarrassment to all intelligent women","commenter_a":"Get over your love affair with Trump. It's not happening and @username looks super pathetic.","post_message":"Here's what happened in Iowa, according to Donald J. Trump."},{"comment_id":"10153080990943812","commenter_b":"Scumbag","commenter_a":"Why wasn't the mother given custody ? Custody was given to a parent with mental ssues ? This is not the rest of the story yet . Florida fails aagain and again we hear about more changes. Meanwhile NO ONE is held accountable and a child is dead. Oh well.","post_message":"UPDATE: Attorney says she reported to authorities that father was acting erratically before he allegedly threw 5-year-old girl from bridge to her death in Tampa Bay: @webpagelink"},{"comment_id":"1117421238280665","commenter_b":"Mary please do your homework. It would be great to have a woman president but not her. She's a chameleon. If she hasn't flip flopped on something that matters to you just wait...","commenter_a":"Hillary Clinton is the single most qualified candidate in the race, and of the last 60 years. she is the right woman for the job, and in 284 days, i will be proud to call her Madam President.","post_message":"EXCLUSIVE: Vice President Joe Biden reveals what he thinks about the US electing a female president. \"This country's ready for a woman.\""}]
