[{"comment_id":"10153997571366378","commenter_b":"So glad they got him! That beautiful child did not deserve to get shot. God bless her.","commenter_a":"Why am I still shocked by such brutal events? Such a sweet looking child.","post_message":"#BREAKING: A man has been charged with murder in the shooting death of 8-year-old Gabrielle Carter in Camden, New Jersey. The 18-year-old suspect was arrested Friday morning at a relative's home in Tennessee."},{"comment_id":"10153140940574205","commenter_b":"Perfection!","commenter_a":"Lol... Reminds me of the Mandelbaums on Seinfeld. \"You think you're better than me?\"","post_message":"In an effort to show how tough they are, Vladimir Putin and Dmitri Medvedev have released an exercise video."},{"comment_id":"10153374338805329","commenter_b":"Lock her up and Throw away the key.","commenter_a":"Haha hopefully everyone enjoys there burgers and burritos today Cats ruin the forests when left to roam free They kill anything that's small And they over breed more than people on welfare Get over yourself You would ruin her life forever just because she took out a feral cat? Murderers even get off Scott free and live in society but this girl who by the way isn't hunting giraffes and rhinos (which is an actual job in some places) is condemned to a life of hatred by all you animal eating Internet trolls I curse everyone here with the fact that you will accidently run over an animal in your life Know that you were just a photo away from getting your whole life ruined","post_message":"A photo of the veterinarian with the dead cat have gone viral and sparked outrage."},{"comment_id":"10153994656339714","commenter_b":"I'm sure God told her. ;-)","commenter_a":"And how would Carly know how the Clinton's feel about each other. PLUS -- what good for the country was Carly's statement suppose to serve??? It sure didn't make me want to vote for her. We don't need more petty.","post_message":"Carly Fiorina had it out for Hillary Clinton at last night's #GOPDebate."},{"comment_id":"10153093570621955","commenter_b":"Lying old hag","commenter_a":"The queen of the American Communist Party, oops, I mean liberals...","post_message":"WSJ: HILLARY TO ANNOUNCE NEXT MONTH..."},{"comment_id":"1293464810706279","commenter_b":"Foolish talk from a foolish woman","commenter_a":"Try retraining the dumb crooks and thugs!","post_message":"@webpagelink"},{"comment_id":"10153916167801178","commenter_b":"Mommas ain't no saints in this passion play either.","commenter_a":"I agree. Black on black crime is so out of control and too many momma's ate losing their children to death. It needs to stop, all drivebys gang shooters need to be prosecuted to the entire law, not just slaps on the wrist.","post_message":"Sheriff Clarke slams Jesse Jackson for refusing to 'talk about the black-on-black crime in South Chicago.'"}]
