[{"comment_id":"10155637604520354","commenter_b":"BO is merely the `uncriticisable blackface` of liberalism. Hillary is much more evil because she knows what she is doing.","commenter_a":"Obama has a plan....and it's working.","post_message":"This is what Obama calls \"defeating ISIS\"?"},{"comment_id":"10154138002220671","commenter_b":"If they dont catch her already","commenter_a":"#NewAge","post_message":"Police pursuing possible homicide suspect in Southern California"},{"comment_id":"1390020544359635","commenter_b":"I would turn the hose on her and spray that STD filled flea bag off my property","commenter_a":"please knock on my door. we have lots of property and a back hoe","post_message":"I would rather ___________ than have Miley Cyrus knock on my door."},{"comment_id":"989628607749873","commenter_b":"Lord have mercy, poor little baby, may he rest in peace.","commenter_a":"HOW?!?! HOW DOES THIS HAPPEN?!?! I just can't wrap my head around it. I have tried to understand but I am also a busy/working mother and I just can't understand how you can forget about a child in a car.","post_message":"Parents, grandparents and caregivers of any kind - PLEASE remember to always check your vehicle: @webpagelink"},{"comment_id":"1292791090782624","commenter_b":"She's a paralegal? She should make much more than a fast food worker. This is why Sanders lost. He only helps the poor. He doesn't help the hard working middle class. Where is our mandated raise?","commenter_a":"Um I went to college to make $15 an hour and I have student loans. So now people working at Burger King are going to make the same or more than me? WTF I need a raise too!!","post_message":"When working people stand together, we win. And we are winning the fight for a living wage. In 2016, a total of 25 states and localities approved minimum wage increases."},{"comment_id":"10153785925861130","commenter_b":"So disgusting! Foot kiss'n Catholics just turn my stomach.","commenter_a":"Some people on this post are so stupid. Read the bible that is if you can read. Jesus washed feet. And the pope is just trying to be as Christ like as he can be. Some of you really need to follow his example. That is if you are not to ignorant","post_message":"Pope Francis says regardless of religion, we're all \"children of the same God.\""},{"comment_id":"10154499233438132","commenter_b":"All men have hoes.","commenter_a":"your universal super power What if I told you that you hold the universal super power of anticipating life-altering encounters with strangers... tapping into your unlimited abundance frequency predicting upcoming challenges and lucrative opportunities... and following through on your BIG goals without any hesitation or uncertainty How? You might be wondering... Because you have access to a secret weapon that most don know about: Numerology. You be amazed at the shockingly accurate and revealing information that can be deciphered from nothing more than your name and date of birth. @webpagelink","post_message":"John F. Kennedy's scandalous handwritten love letters have been revealed."}]
