[{"comment_id":"10154603481037994","commenter_b":"How can you kid nap your own kids is as stupid as how can your rape your own wife","commenter_a":"That's messed up. I wish I knew more but she shouldn't have to go to jail. She's a mom and those are her kids. She shouldn't have done what she did but at the end of the day those are her kids too.","post_message":"The mother was scheduled to return the two little girls to their father -- but never came back."},{"comment_id":"10154137219211323","commenter_b":"Except I don't know any bores.","commenter_a":"How the shallow half lives. My parties are made up of kinder people and we include bores, shy people and those who feel rubbish but know they will be treated with kindness and respect.","post_message":"“They don’t know they’re bores, so they’re happy.\""},{"comment_id":"10153814359479411","commenter_b":"@username I don't have sex with animals unlike yourself.","commenter_a":"A monkey is still a monkey, even if you put a suite on it.","post_message":"Coming soon on RT Documentary - Congo's kings of style."},{"comment_id":"10153461487831636","commenter_b":"If this woman is happy to make her money from demonising victims whoever they may be then perhaps the rest of us should just think \"what a vile individual she is\" and distance ourselves. What she has successfully done, again, is to spark a debate about herself . Which is probably earning her a fortune . Stop reading the Daily Mail for a start . Johnson was found guilty in court by a jury. Quite rightly the judgement was made on evidence and fact. Not opinion and scaremongering . Let's just stop giving her air time.","commenter_a":"WTH bloody Katie Hopkins ffs again innit???","post_message":"Her comments have sparked a particularly vocal backlash"},{"comment_id":"1002013776554647","commenter_b":"I dont think Buying Sex is a Game Changer Anymore. Lets get Real Here. You got a Lunatic Acting Like Hitlers Twin Brother Running and Thats Ok? Buying a Hooker is somehow More Repulsive?","commenter_a":"Intriguing.","post_message":"It sounds like this information could definitely ruin a campaign -- and it WILL be released."},{"comment_id":"1264161686965709","commenter_b":"Sounds like the brides need to chill the hell out lol i would rather go on a awesome honeymoon then spend that kinda money just to walk to a isle... But that's just me and I'm a very different kinda women.","commenter_a":"Retarded....","post_message":"And about $16,000 of that is for the venue alone... STORY: @webpagelink"},{"comment_id":"961148523904901","commenter_b":"Every female I pursued that said \"No, I am not interested in more than being friends\" at some point had sexual relations with me and enjoyed it after I kept pursuing her in ways she WAS responsive to! some women want gifts and loads of flattery before they say. When they dont want to be friends, I stop pursuing them, until then its their choice to hang or not. The only clause is when they ended up being lesbian women!","commenter_a":"No means No! Some people don't get it. If someone is not interested in you move on.","post_message":"After a 14-year-old girl told her mom that a boy was aggressively pursuing her at school, her mom, a clinical sexologist and video blogger, decided to post a video to the boy on YouTube. >>@webpagelink"}]
