[{"comment_id":"10153091462652507","commenter_b":"There she goes again, speaking truth to power. And for the poweless. You go, girl!","commenter_a":"Thank you Sen. Watrem","post_message":"Watch Senator Elizabeth Warren crush it on the Senate floor during the debate to defund Planned Parenthood: “Did you fall down, hit your head and think you woke up in the 1950s or the 1890s? Should we call for a doctor?”"},{"comment_id":"856527364484863","commenter_b":"@username shut ur dumb-ass up!","commenter_a":"First point of order the car is in the middle of road. Second point yes his hands were raised but he moved to the car and did not stop not typical behavior of a stranded motorist when given an order to stop or asked hey why is your car in the road. Third point the suspension is typical following any ois during an investigation. So is the officer right or wrong if you can make that judment based on clips of an entire interaction with the police you're an idiot, and are part of what's wrong with America as well.","post_message":"GRAPHIC VIDEO: Video released today shows Tulsa police shooting and killing Terence Crutcher, an UNARMED father of 4 and college student for the crime of having his car stall down on the road. His hands are raised shortly before shots are fired. From the helicopter, a cop can be heard on the radio saying, \"That looks like a bad dude, too.\" A federal Justice Department investigation has been launched and the officer who shot him has been suspended. Video by Occupy Democrats, LIKE our page for more. Read more here: @webpagelink"},{"comment_id":"1738373569725506","commenter_b":"Nasty bitch!","commenter_a":"Thief don't need to words","post_message":"This should be interesting....ClashDaily.com"},{"comment_id":"10153517171806336","commenter_b":"Shut up you stupid woman!","commenter_a":"They were only 160 ft. Away and actually they checked on the children throughout the night. It is said the mother visits the place where the child went missing to walk the streets hoping to find her. The parents are devastated over the loss. Just because you or I would not leave our children like this doesn't mean we should be so critical or unkind. They made a terrible mistake ( in this case perhaps a deadly one). We should show kindness and pray for them. I mean after all what if it were you/me. No one is beyond making mistakes. They are tortured enough. Walk a mile in their shoes.","post_message":"Based on an examination of the bones, Australian police determined the child was killed \"some time since the start of 2007\" – the same year Madeleine McCann disappeared."},{"comment_id":"835588663194002","commenter_b":"As I was reading this article and the comments it evoked, which as a believer I support 100%, this thought came to me - what's to prevent a Godless government from forcing churches to perform gay marriage ceremonies much as they've strong armed bakeries and wedding venues?","commenter_a":"They will have to be married @ the Justice of the Peace. You can't force ministers, priests, rabbis, etc to marry them.","post_message":"The Supreme Court's decision on same-sex marriage doesn't change anything. The position of the Bible on marriage is not negotiable. #marriage #SupremeCourt"},{"comment_id":"10155048968076037","commenter_b":"I would be behind him Mr. Knowing it all","commenter_a":"Wikileaks said the emails were a \"leak,\" not a hack. i would like to see some evidence of wrongdoing, before Obama starts WWIII on his way out the door. Why is he effecting ANY major policy changes so close to being out?!?","post_message":"The US will kick out 35 Russian intelligence operatives & shutter 2 Russian compounds."},{"comment_id":"10154545590463010","commenter_b":"#NeverHillary #NeverTrump #JillStein2016","commenter_a":"Hmm, funny that you could say all the exact same things about Clinton. Time to stop pretending she's better than he is. Sorry y'all - we let the US drift so far to the Right a Trump popped out, but that isn't his fault. Particularly when he isn't the war criminal candidate between the two major party offerings...","post_message":"Psychiatrists aren't supposed to psychoanalyze presidential candidates. A Yale psychiatry professor writes in Los Angeles Times Opinion:"}]
