[{"comment_id":"978977272143131","commenter_b":"I agree. That's a spot on observation. I never thought about that, but it's true. Many feminine topics make people uncomfortable. Whether it be hygiene, sexuality, or social treatment. All common topics for comedy.","commenter_a":"Honestly, I think a lot of the reason men don't find women funny, is because men AND women are trained to see things from a man's perspective. I can hear a boner story and laugh my ass off because I can imagine what they are telling me and it's amusing. So much of what women comedians talk about are things that men feel they can't relate to - they've never thought about most things from a women's perspective. Just my two cents though...","post_message":"First it sounds ridiculous. Then you get it. Then it's hilarious and sad all at the same time. - Eric March"},{"comment_id":"10154315963468812","commenter_b":"Weed makes you hallucinate now? Yeah let's ask the 2 ladies who have obviously never tried it.","commenter_a":"I still don't understand how marijuana is in the same classification as heroine and LSD, even though it's helping people walk! Meanwhile Oxy is prescribed every day and it's ruining peoples lives...","post_message":"Federal authorities are reviewing the possibility of loosening the classification of marijuana, which is currently in the same class of drugs as heroin and LSD."},{"comment_id":"10156617842095354","commenter_b":"This is just another Obama liar. Do not pay too much attention to her....Someday everything that they have done will come back and bite them in the butt.","commenter_a":"I've got to ask: Is Shultz starting to look more and more like Jar Jar Binks? What's going on there? I must avert my eyes.","post_message":"***FIRESTORM OF DEMOCRAT LIES***"},{"comment_id":"10154141594486509","commenter_b":"I can't stand Sanders grating voice and Hillary puts me to sleep O'Malley's obnoxious Thank God NCIS is on at 8.","commenter_a":"I wonder if @username will ambush Clinton, like FOX ambushed Trump.","post_message":"Classroom lecture vs. rock concert: Just how different are Bernie Sanders and Hillary Clinton campaign styles? #DemDebate @webpagelink"},{"comment_id":"1308410459173725","commenter_b":"@username, you are spinning it. I said he can't run it, but he certainly doesn't have to give up ownership. Then tell me how the Clintons were able to run the Clinton Foundation when Billy was in office ? Yeah they found something in Benghazi. They found four dead Americans that pleaded for help. They found gross negligence and mishandling of top secret information on Lying Hillary's emails. Are you saying that's not true ? Name one significant contribution that Lying Hillary has done on her own besides being first lady and riding her husband's coattails a husband who she couldn't even keep happy so he found his entertainment elsewhere. Not to mention a husband that was impeached. She is filthy rich, she take huge donations from corporations, her Clinton Foundation is under investigation for taking money from known terrorists countries, she voted for the war we are in now. ...","commenter_a":"It is an abuse of tax payers dollars and highly unethical for obama to give Hillary a ride on Air Force One. She should campaign on her own dime just like Trump has to. Do you think obama would give Trump a ride ? Hell no he wouldn't. So why should Hillary get a ride ?","post_message":"President Obama plans to give Hillary Clinton a lift on Air Force One to their joint appearance, and Donald J. Trump is asking a question that has a complicated answer."},{"comment_id":"10158321761725206","commenter_b":"Stupid girl","commenter_a":"She initially said he wasn't armed, but then she started screaming at him \"don't do it\" as she had her camera pointed at the ground. Then she started filming them afterwards trying to cover up the fact that he was threatening the police with the gun.","post_message":"A photo has emerged in social media showing a gun at the feet of Keith Lamont Scott lying on the ground after he was shot by a police officer in Charlotte, NC."},{"comment_id":"542586789241125","commenter_b":"Get off drugs!!! Our economy would crush!!","commenter_a":"Trump is not dropping out you idiots. The best you can hope for is Trump/Carson ticket.","post_message":""}]
