[{"comment_id":"1202395043109110","commenter_b":"betty you need to get your facts checked for you are off your mind. over the past 6 years the number have increase and a large number that was to be send back Obama administration let them go. don't listen to the libs press unless you can't think for yourself. a American life is worth more then sending illegals back. and it's the free stuff they get is why they come. so next illegal that was charged for federal crimes and sent back to their country comes back and kills an American why don't you go tell the family that there was nothing that could have been done to stop them because the illegal is more important then their love one. why don't you use your head and read both sides of the story instead of only one side unless you are an illegal yourself.","commenter_a":"Harry Reid is right. This bill is not the answer to a difficult problem. Some of the folks that have posted think this is a great bill. They aren't stopping to realize that it will cost more to house, feed, and send these people back to wherever they have come from, which is probably a very unsafe place or why would they have left in the first place? I hope this bill is seen for what it is, a terrible step in the wrong direction and hopefully our Senators will have more sense than to pass it into law. If you will check the numbers, in recent years more undocumented people have left the United States than have entered.","post_message":"The vile legislation that is now before the Senate might as well be called the \"Donald Trump Act.\" Like the disgusting and outrageous language championed by Donald Trump, this legislation paints all immigrants as “criminals and rapists.” Local law enforcement officials, domestic violence groups, immigrants’ rights groups, mayors, faith leaders and labor groups all oppose the \"Donald Trump Act.\" This bill does nothing to keep Americans safe, and it certainly does nothing to address our broken immigration system."},{"comment_id":"10152861965631130","commenter_b":"Is that the END OF YOUR BULLSHIT?? Nothing to do with illegal immigrants. Whooping Cough outbreaks happening ALL over the world. The bacteria is mutating in two ways: one strain of bacteria lacks the primary protein used in the vaccines; the other strain has new proteins. These are found in Europe, Japan and elsewhere @webpagelink","commenter_a":"Vaccines can force the bacteria to mutate, did you know that? 100,000 Americans have gotten whooping cough in the last three years. 32 babies have died. C.D.C. scientists speculate that the current vaccine may be helping to drive the bugs’ evolution. “The fact that this happened so quickly, to the proportions we’re seeing now, clearly suggests some selective pressures …. Vaccine pressure is probably one of them. @webpagelink","post_message":"\"I believe in trusting doctors, not know-it-alls.\""},{"comment_id":"10153163966344255","commenter_b":"Where my confusion comes in is most people don't trust the government with their money but they will trust it with their children's lives....","commenter_a":"See fellow liberals? This is the fanatic pro-vaxxers showing their true face. Fascist totalitarianism. Hitler and Mengele would be proud of the folks signing this petition. These are not liberals. These are corporate thugs in disguise using liberal forums like @username to try to convince us that the pro-vax position is the smart, scientific , modern one and that vax-skeptics are a bunch of right wing anti-science fundamentalist boneheads. Its simply not the case. The real smart folk can see right thru this Big Lie that all vaccines are perfectly safe. They clearly are not. And most of us do not want to ban vaccines as they would have you believe. We just want safer vaccines, common sense, and for folks to see both sides of the scientific debate. And yes, vax fanatics, there IS a scientific debate.","post_message":"Public health must trump parental choice. Tell your governor to introduce legislation to ban all belief-based vaccination exemptions."},{"comment_id":"10156346245355354","commenter_b":"She should have been body shamed. What body she has that is.","commenter_a":"How about just a useless cunt?","post_message":"READ what anti-America donut-licker Ariana Grande wrote. Genuine pain from being 'body shamed'? Or shameless PR stunt to gain sympathy?"},{"comment_id":"392535437595004","commenter_b":"What a misogynistic jerk!","commenter_a":"WTF? what a loser! how is this guy in politics? what a loser!","post_message":"No, there's no GOP war on women."},{"comment_id":"10155243885678984","commenter_b":"@username excuse me ??? It's the fake news that is treating the president with utter disregard for his office ... they are bought & paid for that's why they say what the liberals are spouting ... makes one SICK !","commenter_a":"Oh boo freakin hoo! Shut the f#&@up all you newsies! You treat the President of the United States like a lowlife scumbag and expect him to kiss your collective asses to make nice! This is Donald Trump and you dummies just don't get it! Be fair and honest and quit making up crap and he will reciprocate! Wake up and smell the coffee!","post_message":"Fox News' Brett Baier just left many viewers speechless. This is going to get Donald Trump's attention..."},{"comment_id":"10153065626180950","commenter_b":"He's a dayum disgrace. Im sure Subway can't believe this saga.Jared is a sicko that needed mental help yrs ago. He failed to get it & now he pays for his sordid fetish. The inmates will love that ass.. Footlong comin for your ass Jared. Ijs !!!! Karma is a bish :(+","commenter_a":"Hope you bring Vaseline for your new job interview jared.","post_message":"JUST IN: Court hearing for ex-Subway spokesman Jared Fogle ends; he \"expects to go to prison,\" his attorney says: @webpagelink"}]
