[{"comment_id":"908467619212716","commenter_b":"They are idiots. Why have 19 kids? Whats thier motive? This is called incest.","commenter_a":"Let the legal system work the way it should.","post_message":"Is anyone surprised by this?"},{"comment_id":"497513650439215","commenter_b":"Bitch","commenter_a":"Well then ll blacks are racist even if they don't use the Cracker word!!!","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"1729707230595759","commenter_b":"See, you came here legally. That was your big mistake.","commenter_a":"I immigrated from Europe legally paying my dues. Before they even gave me the visa to enter in USA I had to travel across the country and spend a day at a hospital designated by the USA consulate being checked out for diseases. Had to have a certificate from the tuberculosis center that I don't have tb. And after the consulate got my results I was issued the visa and given the green light to come to USA......why did the laws change?","post_message":"Are Americans aware of this?"},{"comment_id":"10153854800096955","commenter_b":"@username loooooooool u stupid Americans are cute. Have fun finding water in 5 years 😜","commenter_a":"You should have to have a comprehensive background check before anyone can just buy a knife and close the knife show loop hole . Problem solved !","post_message":"NYC Residents On Edge After 3 Slashing Attacks In Less Than 48 Hours..."},{"comment_id":"1794738107245611","commenter_b":"Mexico has no standing in America. The reason Mexico is upset is because the majority of Mexico!s economy depends on money sent from Illegals in America and illegal drug traffic. The rich in Mexico will lose their illegal source of income and Mexican economy may crash.","commenter_a":"Screw you.","post_message":"Yea, good luck with number 11..."},{"comment_id":"10153781188388984","commenter_b":"We need to get Americans off of Welfare...80 million Americans are not coming off their porch until we take EBT away from them, the Obama phone and ACA. Immigrants with green cards would not be here if Americans would get off their ass.","commenter_a":"Ben Carson supports amnesty for illegal aliens. The liberals can have him.","post_message":"Rush Limbaugh just issued a huge statement Dr. Ben Carson ... this caught a lot of people by surprise. Do you agree with what Rush just said?"},{"comment_id":"10154458181463128","commenter_b":"Everyone is scared in America because there are so many guns. We need commonsense gun control ASAP. We need to vote out all politicians that oppose commonsense gun reform and get this issue addressed","commenter_a":"The cop is clearly nervous as hell. His voice is cracking and his gun is shaking terribly. To me, this is proof cops just aren't trained enough to identify true threats and staying calm under extreme pressures. He shot this guy in fear. Period. He should be charged for murder. I am absolutely terrified of cops and it shouldn't be that way.","post_message":"\"Police just shot my boyfriend for no apparent reason\": A police officer fatally shot a man in a car with a woman and a child, an official said. Authorities are looking into reports that the aftermath was live-streamed on Facebook."}]
