[{"comment_id":"945524792158383","commenter_b":"Kill all the white people, then they will only have each other to blame and kill. Brilliant!","commenter_a":"Idiots","post_message":"[Watch] New Black Panther Party Urging Blacks to Get Ready to Kill for a Black Nation"},{"comment_id":"502242713299642","commenter_b":"Fire him","commenter_a":"Break his legs then he will have an excuse not to stand.","post_message":"This Muslim NBA Star refuses to stand for the U.S. National Anthem. How disrespectful. Regardless of religion, you need to respect our country. Do you agree this NBA player needs to learn some respect?"},{"comment_id":"581504818688172","commenter_b":"we are \"nasty women\" and we vote!","commenter_a":"Your mother always said that you were a disappointment and a nasty little creep.","post_message":"The conviction of an Iraqi refugee plotting to blow up the Houston Galleria is exactly why I've been pushing so hard to immediately suspend the refugee program from terrorist hotspots. The current program is a Trojan Horse allowing ISIS and other terrorist groups an open invitation into the U.S."},{"comment_id":"1561579034151058","commenter_b":"She's wile annoying","commenter_a":"@username .. This is so Gemma Gallanagh","post_message":"\"By the time I put it together there was nothing I could do to stop him.\""},{"comment_id":"1179869992091535","commenter_b":"Lol yeah never thought about a lefty you ever try those net bags to catch spent casings I use them because we reload that should help","commenter_a":"First of all the guy was lying no way he shot it he said the casings flying in front of his face gave PTSD has anyone ever had a spent casing fly in front of them why shooting the AR not me lol so I doubt he even used one","post_message":""},{"comment_id":"10154004343429440","commenter_b":"@username and if you call me sweetheart again, I will find you and feed you your balls. \"Figuratively\"","commenter_a":"Trump has the worst politfact record of any candidate for president ever. Hillary is among the best. Making all of your reports 50-50 so you don't have to listen to Republican whining distorts the truth","post_message":"Denver Post Politics takes a look at how Hillary's statements stack up to the facts."},{"comment_id":"401586413362986","commenter_b":"Cut off her welfare check!","commenter_a":"and they raised a boy? No wonder","post_message":"Michael Brown’s mother decided to show her true nature when she said this..."}]
