[{"comment_id":"10154382058398606","commenter_b":"These chicks will walk on hot stones for me but keep disrespecting their sisters","commenter_a":"@username Smdh. Why would anyone do that?","post_message":"More than 30 people suffered burns to their feet and lower extremities at a Tony Robbins seminar after the motivational speaker encouraged them to walk across hot coals. @webpagelink"},{"comment_id":"10153296674076323","commenter_b":"i can't deal with her","commenter_a":"@username thought you might find this interesting","post_message":"After Frida Kahlo died in 1954, her husband Diego Rivera shut her belongings in a bathroom at their Mexico City home – then demanded it be locked until 15 years after his death. In fact, the room wasn’t opened until 2004. See the full gallery of what was inside: @webpagelink"},{"comment_id":"10153186192812550","commenter_b":"Oh @username its so sad. First of a talking back is not a threat. Second if he wanted to arrest her , he did not need to throw her on the ground & pull her hair. Those kids were running up to save their friend & I would have done the same thing. Third she was all ready sitting down , it was no need to push her head down in the dirt & sit on her. Apparently the kids were invited by a guest. They didn't start the fight at the party some old ladies started it.","commenter_a":"Absolutely NOT! 1.The video is incomplete. 2. The cops appeared to be outnumbered at least 4:1 3. He did not use lethal force. He restrained an individual who was not obeying his directive. 4. When another individual came from behind him; he did as any police officer would and drew their weapon. He then quickly holstered it when the threat was lessened. 5. If these kids showed proper respect for law enforcement; this would have been a different story.","post_message":"Call for cop to be fired after pool party video @webpagelink"},{"comment_id":"10154146270706218","commenter_b":"@username change the fucking tampon","commenter_a":"President Obama and First Lady Michelle are a class act and what a President should act like with intelligence, calmness and responsibility to the American people, not the train wreck we currently have.","post_message":"Do you miss Barack and Michelle Obama?"},{"comment_id":"843343722394413","commenter_b":"You're wrong. Go in a mosque sometime you'll probably even walk out with your head still attached.","commenter_a":"If we behave in the same fashion as our enemies, we become our enemies.","post_message":"REVENGE: French Attack Mosques And Blow Up A Muslim Kebab Shop Looks like the French have had enough of the Muslims immigrants living there and are fighting back! @webpagelink"},{"comment_id":"10154724312199486","commenter_b":"Yes come here and get shot!!! That will have them flooring in!","commenter_a":"Chicago will soon see that President is higher than Mayor...Fucktards!","post_message":"NAILED IT."},{"comment_id":"10153913650358010","commenter_b":"Male, female, you are still a crazy bitch.","commenter_a":"Bill Clinton is the WHITE BILL COSBY and she is a LIAR","post_message":"We're 309 days away from Election Day."}]
