[{"comment_id":"10154346331578812","commenter_b":"I love the sons of Diana and Charles.. The babies are as sweet as can be..long live the queen","commenter_a":"So cute x","post_message":"Prince George is allowed to stay up 15 minutes past his bedtime to meet the Obamas at Kensington Palace dinner."},{"comment_id":"10154954307148984","commenter_b":"You're the dumbass,bitch!","commenter_a":"Lol.you dumbasses believe in stump???lol. I hope you get what he gives you lol and more","post_message":"Paul Ryan is shaking things up with this unexpected announcement. He feels so strongly about this, he decided to make his feelings known during Donald Trump's crucial transition period..."},{"comment_id":"1023513341058227","commenter_b":"Go figure. A business in business to make money. She should know, she's the biggest criminal of them all.","commenter_a":"imagine that, a company in business to make money. You can't fix stupid, but you can vote it out of office, or in this case make sure it doesn't get into office.","post_message":"This is most likely the dumbest comment she has made to date..... so far."},{"comment_id":"10154478022181973","commenter_b":"I was looking at the protest videos of the inauguration and in a couple of clips I saw ppl with anarchists gear on vandalizing those businesses so I don't like it when the media on both sides of the aisle says it's only one group causing something.","commenter_a":"I WANT A ANSWER LIBERALS. WHY HIDE YOUR FACE? I BET I WON'T GET ONE.","post_message":"During the \"Not My Presidents Day\" rally, bike-mounted officers pushed the crowd out of the street and a standoff ensued, with police in riot gear keeping the protesters to the sidewalks. Then, as the protesters stood by and chanted, police charged in and grabbed several people, dragging them from the crowd before they were handcuffed and put in waiting police vans. Read more here: @webpagelink"},{"comment_id":"1059501164087223","commenter_b":"a little racists are we? I don't see any white ladies up there dancing with her.","commenter_a":"nope didn't see it,...who is beyonce?","post_message":"Not so subtle."},{"comment_id":"1000558950003853","commenter_b":"Nope. But I've had enough experience with woman in business to know that they are always looking for some excuse to demand a refund, which they never get.","commenter_a":"this is how women are - always looking to steal back their money.","post_message":"He who pays the piper . . . doesn’t like him drinking"},{"comment_id":"10153238053014586","commenter_b":"plants are living things too... so eat sand... all human should eat sand.","commenter_a":"literally feel sick watching this how can people still let this happen? disgusting","post_message":"Can you imagine having that huge metal tube shoved down your throat?! This is just 60 seconds of how #FoieGras ducks spend THEIR ENTIRE LIVES. They sound so terrified. :("}]
