[{"comment_id":"557979804384534","commenter_b":"@username I totally agree, how can she not see that??","commenter_a":"If it makes you feel better, I'm ashamed of your actions too. Disgusting.","post_message":"Jaelyn Young broke down in heavy sobs at sentencing, saying she was ashamed of her actions."},{"comment_id":"1788323888048645","commenter_b":"SouthernBox Blues But why are the prisons full? Getting rid of the illegal aliens from them would help. If the little jackasses need to be locked up, do it. Just like Sheriff Joe, put them in a tent.","commenter_a":"Its time for Chicago to clean house . From the dirty politicians all the way down to these street thugs .","post_message":"WATCH: 71-year-old man shot while watering lawn; new Chicago shooting sparks outrage: @webpagelink"},{"comment_id":"575985222606198","commenter_b":"Yes","commenter_a":"More money to waist.","post_message":"Do you support a lottery in Alabama?"},{"comment_id":"10153486383431037","commenter_b":"So how many cops takes to capture one guy?","commenter_a":"Tantiana Valentina","post_message":"MORE DETAILS: Second escaped prisoner shot by police, in custody and taken to hospital"},{"comment_id":"10152609562277452","commenter_b":"Can you believe woman these days","commenter_a":"Wtf Hurray for this man.. bless his heart, and for a better woman to come to them..","post_message":"After a father refused to give up his newborn son, who was born with Down syndrome, the mother left both of them. abc7.la/1DEs3a0"},{"comment_id":"10154861039595575","commenter_b":"What is this woman doing Hallucigenics?","commenter_a":"i thought she was paying them to leve, and she made a big mistake,,, what the hell, is this old or what,","post_message":"They call her the Hillary Clinton of Europe..."},{"comment_id":"10153307437349641","commenter_b":"Well a man Isis noob is better than a super trained nato soldier who does nothing as all NATO soldiers do - nothing","commenter_a":"i dont think isis fighters are more than trained noobs :v","post_message":"ISIS \"moron\" gives away HQ location on social media:"}]
