[{"comment_id":"1015232928526293","commenter_b":"will someone call the home and tell them a resident is out running loose?","commenter_a":"makes no sense, idiot","post_message":"Nancy Pelosi identified what she called the \"three G's\" – reasons why white males favor Donald J. Trump over Hillary Clinton. @webpagelink"},{"comment_id":"10154028349033812","commenter_b":"@username because I CAN and honestly sick of hearing about that dn women people KILL THERE SELF everyday she's no damn different","commenter_a":"I always knew something was wrong with the story could not understand why","post_message":"Texas trooper who arrested Sandra Bland surrendered to police after being charged with perjury."},{"comment_id":"10152929070861336","commenter_b":"They're still human beings escaping horrible working conditions, some of these people don't even have the education or access to resources to migrate legally. So, our government is going to arrange for them to be able to live in peace and be employed in jobs that most people wouldn't take. And they'll be grateful. Sounds like the rush of immigrants that came over in the 1800's. Maybe you need to chill out instead of being knee-jerk reactionists like the anti-immigration groups from back then.","commenter_a":"Idiots both of them","post_message":"U.S. Attorney General nominee Loretta Lynch said she believed in an illegal immigrant's \"right\" and \"obligation to work\" during Wednesday’s confirmation hearing."},{"comment_id":"10153029899116336","commenter_b":"She's a idiot.","commenter_a":"What a joke! Anything to grasp at more sympathy","post_message":"'American Sniper' Chris Kyle’s wife, Taya, asked family friend and U.S. Navy SEAL Pete Scobell to record the song \"Hearts I Leave Behind\" to honor her late husband. Watch Scobell's performance from earlier today on Fox & Friends."},{"comment_id":"1218857281537727","commenter_b":"She is still authentically uncorrupted. may she hold on to that and help the US find itself again","commenter_a":"Could please run for president ! Please","post_message":"Education is power and to fight sexism and inequality, Michelle Obama has a message to young girls around the world. (via NowThis)"},{"comment_id":"10156550140360354","commenter_b":"WAKE UP AMERICA !","commenter_a":"Go girl!!","post_message":"What in the...?! And no, it's not a joke. It's a REAL lawsuit. Look at the documents..."},{"comment_id":"1329814237089560","commenter_b":"These seem so handy","commenter_a":"This feels like a Savannah thing.","post_message":"If there's one thing we can all agree on, it's that tying shoelaces is the worst: @webpagelink"}]
