[{"comment_id":"10153331383855329","commenter_b":"Ummm they are...? If a diamond ring is a deal breaker for a woman she needs a reality check","commenter_a":"Thank fuck I have a husband who knew when he was proposing to me that I'm not a shallow twit who will only accept diamonds :) Also to those who say you don't get the sparkle with a fake, let me tell you, you do, you get sparkle in abundance, just because its \"fake\" doesn't mean its not good quality!! My rings catch many an eye and always oh that must of cost a lot bla bla bla, as far as I would be concerned my advice to men would be that if she DEMANDS a diamond she is not worth it :)","post_message":"Put a diagram on it."},{"comment_id":"10152702993831636","commenter_b":"would rather pay for a second hand BMW than be involved in a spit roast with her","commenter_a":"sex united fc Siddhant Behera Sanket Mohanty","post_message":"Manchester United have found themselves at the centre of another sex story..."},{"comment_id":"1726500120946412","commenter_b":"I'm not really sure why anyone would vote for that scandal ridden woman, but hey you got this little buddy.","commenter_a":"I did vote for U.S. Senator Bernie Sanders to win, but I not upset that my choice did not win, no, I let Democracy decide on that, and I am proud to vote for Hillary as our first female president. Everyone Rock the Vote!","post_message":"So much for party unity."},{"comment_id":"10150863474824999","commenter_b":"As opposed to when exactly? When was this glorious period of time when everyone spoke the truth?","commenter_a":"the problem these days we do not know who or what to believe, everyone seems to have their own agenda and telling lies is at the top of their agendas.","post_message":"\"Few other countries go to such lengths to deliberately inflict suffering on people seeking safety and freedom.\""},{"comment_id":"10154144133589060","commenter_b":"@username I agree. She's one big mess. But they will elect her. Everyone loves a winner","commenter_a":"Lets make no mistake - Hillary has LOTS and LOTS of experience with many, many, many male (and some woman) leaders.","post_message":"Sanders espouses bold positions; Clinton talks about the world leaders she has met"},{"comment_id":"10152797115634117","commenter_b":"Matthew, most of you gun totters don't have the balls to pull the trigger. But if you need a gun to make you feel like a man, knock yourself out. Guns are there for men who's wives wont let them have a penis truck. Have a nice day.","commenter_a":"And the evil liberal Democrats want to take our guns away because the police are here to protect you.","post_message":"U.S. marshal's effort to censor a citizen's recording was foiled by yet another citizen recording in this small town that collects millions in asset forfeiture revenue."},{"comment_id":"874758175906540","commenter_b":"1400 years Muslims have done nothing but murder...Muslims gave humanity the dark ages,Muslims have been murdering and destroying the new body count 750,000,000 and growing..this death cult will and have killed their own it will not matter!","commenter_a":"Don't we all feel better because the NYT supports the great community organizer? Hell, I may just go to work!","post_message":"The only war the Obama administration is fighting is 'the war for American public opinion.'"}]
