[{"comment_id":"10153748697767629","commenter_b":"If white women didn't flunk every black and Latino out we might have the blacks in college and in education that we need.","commenter_a":"When are we going to start making teachers uncomfortable and scared? its a white, more privileged profession with more time off. Especially at the college level. Shouldn't they fear being shot in the head too? Thankfully we are getting guns on college campuses so that all authority can be radically challenged with an in your face confrontation. The Russian left has always known the power of confronting authority so I'm glad America is catching up. War and Revolution baby! Just like the founding fathers intended.","post_message":"This is beautiful."},{"comment_id":"10153333476251770","commenter_b":"My father is an immigrant from France, I lived 15 miles from the border of Mexico for ten years, I love the Mexican people and so does Trump, don't you see??? People who are in the legal process are being cut in line by illegals. Illegals ruin your wage rates, take your jobs, use our governments program resources. By shutting the border down deporting the illegals the Mexican Americans will get the wage they deserve! As acting, legal tax paying citizens!","commenter_a":"Because the legal Latinos want jobs. The illegal compete and lower the wage rate and that affects the legals ability to make a decent wage.","post_message":"Donald J. Trump beat out his Republican rivals in America's most Latin city Tuesday."},{"comment_id":"10153556232516162","commenter_b":"Wtf","commenter_a":"Merdith V Marin","post_message":"WHAT THE HAY? Caught on video by undercover cops, Michael Crawford told investigators that for 35 years he's been traveling the country having sex with horses... @webpagelink"},{"comment_id":"854160414621300","commenter_b":"That's because they don't know it, and they think they're smarter and know more than anyone else. Truth is, they're afraid of Gowdy!","commenter_a":"GO GET EM!!! If anyone can do it you can.Luv your passion and fire!!!The dems DON'T think anyone knows the Constitution...","post_message":"\"I'll make you this promise...\""},{"comment_id":"10154742351861336","commenter_b":"Insane b.s. But Hillary is a free woman. Wtf","commenter_a":"When I went to vote in the primaries, there were people wearing Hillary shirts and they had signs and were giving out stickers. Oh I guess it's OK for Democrats. :/","post_message":"A Donald J. Trump voter in Texas was arrested Monday for wearing a T-shirt to the polls that mocked Hillary Clinton’s infamous comment in which she said half of Trump supporters were “a basket of deplorables.”"},{"comment_id":"10153840856185950","commenter_b":"Luckily that woman is not running @username, I wouldn't vote for her either!","commenter_a":"If you believe this false report you're an idiot. If you vote for Hillary Clinton you're an idiot. After all these lies and scandals surrounding this woman I can't see too many bright people voting for her. Trump's going to be our President!!!!!!","post_message":"Hillary Clinton's expansive lead is due to support from women and non-white voters, according to the survey."},{"comment_id":"10154469596571523","commenter_b":"How many illegal voters are on that too???!!!","commenter_a":"Who do they poll?? They never call me ever! I think they only poll those that are known demo's.....And personally he doesn't care what they think....he is just doing his job! GO TRUMP!!!","post_message":"President Donald J. Trump's approval rating reached a new low Saturday."}]
