[{"comment_id":"10153117633836051","commenter_b":"I think Cindy is jealous cuz her double wide doesn't have a closet! And Barbara, don't join the dumbass train, I clearly cannot teach this old dog new tricks, but if she has the right to call people queer then I have the right to call her stuff, correct?","commenter_a":"Shame on the Queers.","post_message":"A CNN host went on a lengthy rant about spotting an ISIS flag at a gay pride event this weekend. There's just one problem."},{"comment_id":"10153206472131636","commenter_b":"Well said. If someone wants to dress from head to toe in black I have no problem with it, but full face coverage I find offensive and frightening. You can't read the expressions of a person with their face covered. Is it male or female? It's not necessary and definitely should be banned in the UK.","commenter_a":"There's a difference between Muslims who just wear the hijab (headscarf) and the niqab (face veil). The latter is simply cultural and is an import from Saudi Arabia and other countries that oppress woman (husbands don't like other men looking at their wives so will often make them wear one ) There is nothing in the Quran that says a woman has to wear one. I spend a lot of time in the Middle East and when in Rome and all that. It's not appropriate to have the niqab in our open society. British people might be tolerant but they don't have to be about absolutely everything. Women who wear the niqab segregate themselves from society. It's a barrier. The French have banned it and some other European countries have done the same. Britain should too. And before people start waving the \"islamophobic\" card. I happen to know a lot ...","post_message":"Staggeringly"},{"comment_id":"10154266076039071","commenter_b":"They will be new Amazon GO stores!","commenter_a":"I AM COUNT DRACULA","post_message":"The retail industry is heading into 2017 with a glut of store space."},{"comment_id":"10153603206034342","commenter_b":"Make her Vice President...you will truly be elected","commenter_a":"Sarah Palin is Hott","post_message":"Sarah Palin is endorsing Donald Trump..."},{"comment_id":"442764485911159","commenter_b":"In other words: Problems caused by Democrat policies expected to be solved by Democrat solutions. Great speech, but totally misses that it was HER party that did most of this. KKK, democrat. Vehemently-anti-civil-rights legislation, democrat. Creation of Freddie/Fannie and housing bubble, democrat. Champion of illegal immigrants driving down many black inner city wages, democrat. Cities with most black-on-black crime and deaths, mayors are...you guessed it....years of democrats. Great points, but I really wish people would figure out who REALLY is the Iago to Othello. (hint: he's a democrat)","commenter_a":"Warren! Warren! Warren!","post_message":"Elizabeth Warren explains why \"it is important to cause necessary trouble.\""},{"comment_id":"10153196646006336","commenter_b":"Illegal Immigration !!","commenter_a":"the only thing i want this guy to speak is about cuban and latino massive immigration to USA !","post_message":"“The purpose of our laws is to protect our right not just to worship, but to live our faith as citizens of this country.” 2016 presidential candidate Marco Rubio spoke with FNC’s John Roberts about religious freedom today at the Faith and Freedom Summit in Iowa, saying that we’ve reached an era of growing religious intolerance."},{"comment_id":"1413133632042756","commenter_b":"I believe that the adult in this circumstances escalated the situation. Wrong to trample someone's lawn, wrong approach to correct the problem. Two wrongs do not make a right.","commenter_a":"That's not true Media saying wrong stuff The off duty officer was right When kids jump on him Then he fire to scare the kids He was waiting for on duty officers to arrived","post_message":"Horrifying new footage shows an off-duty cop shooting a gun at a group of teens in Anaheim, CA. It's going viral and sparking protests."}]
