[{"comment_id":"676191809238064","commenter_b":"I`ll say it agin, if the damn guns would stop shoten off there damn barrols!","commenter_a":"This father did not know his son was mentally ill and did not know his son was planning to commit mass murder with the dozen or so guns that unknown to this same father. This father is such a failure and out of touch with his son that his opinion doesn't count. He failed his son and now wants to put the blame some where else.","post_message":"The father of the shooter in Oregon just blamed guns for what happened. He must be out of his mind. This is a sick joke. Do you think his son is to blame?"},{"comment_id":"10152722362786680","commenter_b":"Shut up","commenter_a":"NO","post_message":"\"I think presidents have the right to pick their team.\""},{"comment_id":"10155205840346337","commenter_b":"@username illegals work every job of the spectrum not just in the fields.","commenter_a":"So these restaurants openly hire illegal workers,,,,hmmmm.","post_message":"American eateries will be shutting down to show solidarity with immigrant workers."},{"comment_id":"456612701195977","commenter_b":"Try shutting your mouth and your legs , bitch !","commenter_a":"yep a free ticket to Africa","post_message":"Should Blacks Be Compensated For Slavery? Comment 'yes' or 'no'."},{"comment_id":"10154026090214087","commenter_b":"Obama give the worlds largest terror sponsor a nuke deal. What the hell is that shit about? I know whats going on. You are just stupid. Hillary's top aide huma is a fucking muslim terrorist. This bitch lived in the middle east and wrote for Islamic extremist magazine. She wrote all kinds of anti american articles. And you dumb dip shits run around blind as a damn bat. You people have some real issues. Liberals are whack.","commenter_a":"I think Obama being the first Black President/so awesome set the bar too high for the first female President. We know many stellar women before Hillary never got a shot in politics. Hopefully Hillary breaking the glass ceiling improves equality even tho shes not ideal.","post_message":"\"Hillary Clinton is still changing the way we thought about women as spouses and politicians.\""},{"comment_id":"1451058244908937","commenter_b":"Deport illegals!!","commenter_a":"Florida for Trump!","post_message":"LIVE Trump! DRAIN THE SWAMP FOLLOW US for Conservative news!---> Freedom Daily Donald J. Trump Donald Trump For President #maga"},{"comment_id":"10154903561816320","commenter_b":"maybe you can volunteer to carry luggage to plane and save Us some money sore loser","commenter_a":"Let me guess, he'll insist on using his TRUMP Air instead then charge back the cost to the US government (i.e. taxpayers...). Maybe he can make his daughter Tiffany head flight attendant and get her salaried too","post_message":"BREAKING: President-elect Donald J. Trump says he wants Boeing Company to cancel the order on a new 747 Air Force One for future presidents. At more than $4 Billion, Trump says it's \"ridiculous\" and he \"wants Boeing to make money, but not that much money.\" (AP photo) MORE: @webpagelink"}]
