[{"comment_id":"10153911405746509","commenter_b":"Lesbians rock","commenter_a":"its possible that he may have some mental issues :P but seems like a practicing Jewish...!!","post_message":"A 16-year-old girl, who was one of the people stabbed during a gay pride parade last week in Jerusalem, has died, police said. @webpagelink"},{"comment_id":"10152638370431167","commenter_b":"Skinny, blond, white ladies can't be racist.","commenter_a":"What the...","post_message":"Reminder: This person is still on the payroll at ABC."},{"comment_id":"10155549933771729","commenter_b":"They are terrorists. Maybe, its time to form our militias and eliminate these crazy evil nuts.","commenter_a":"Yes indeed. Love it!","post_message":"Oh, so sorry..."},{"comment_id":"1729018337314031","commenter_b":"Hello everyone,my name is sandra from the united state,getting my lover back was what I least expected and could never imagine,my lover and I were together for five years,but all of a sudden he changed completely and turned away from me and I had no idea what was going on,I tried asking him why but he refused to tell me what the problem was,as time went on he sought for a breakup,I was so worried and confused but I never gave up on him until I met an old friend of mine who had a similar problem,she told me about a spell caster called alakijaoogun who helped her situation,I never used to believe in spell casting in my entire life because I never taught it could work for me but to my greatest surprise it got me a positive result and I was able to get my lover back,even after ...","commenter_a":"i think she has thrush","post_message":"Miley Cyrus delivered quite a statement to Donald Trump..."},{"comment_id":"10157948531130206","commenter_b":"Lol now only Muslim men beat their girlfriends???? Come on all races n religions of coward men beat n sometimes even murder their wives/girlfriends. Sorry this happened to you. But plz don't try to make it sound like he beat u only cuz he was Muslim......","commenter_a":"This is just sad. I use to have a muslim boyfriend who would always hit me and I left him faster than a rocket ship.","post_message":"Qandeel Baloch was known for her raunchy social media posts that challenged social norms in Pakistan."},{"comment_id":"10158313140330206","commenter_b":"She's obviously drunk.","commenter_a":"The employees shouldn't have stood there like that and just took it. I would've gone straight for security. The other customers are waiting.","post_message":"This woman takes the cake for being one of the WORST customers."},{"comment_id":"1766871976928173","commenter_b":"We have no idea what he's going to do, he's never been given a chance, The Clintons however.....what have they done? Let's see, when in office 1 went on trial for impeachment. The other has numerous investigations against her for treason, putting our national security at risk multiple times, accusations of selling American uranium to Russian companies in exchange for massive donations to \"The Clinton Foundation\" who was soliciting funds to send to the Haitians who were devastated by one of the worst earthquakes in history, yet only received a small fraction of what was raised......and while consumed with sealing her deal with the Russians, neglected action in Benghazi which cost the lives of US soldiers......... So, I don't know what Trump will do, but if I had to pick between the lesser of two evils, I would say you can't get much more evil than that witch who camouflages ...","commenter_a":"We truely don't want him in our state. We have his lil brother John Bel Boma and that is enough. We'll just hold on until Trump wins.","post_message":"Dear Mr. President: How’s the vacation going on Martha’s Vineyard? Pretty swell place for sure. Ocean breeze, beautiful homes, and packed out with America’s top 1% of the 1%—you must be in your element. And golf? I’m sure you’re playing so much golf, you’re getting almost tired of it. But then, you never tire of golf. You just seem to tire of that “Presidency thing.” My neighbors in Louisiana aren’t having it so good, Mr. President. They are underwater—again. Historic floods that have impacted or destroyed 40,000 homes and left thousands of families homeless are sure ruining their hopes for a summer vacation this year. Probably will take away hopes for a summer vacation next year as well. Their once nice homes are now waterfront property. In fact their homes don’t just front the water—they are IN the water and the water is in them. I realize that in the ..."}]
