[{"comment_id":"557077507818161","commenter_b":"Take her ass down","commenter_a":"We owe Nixon an apology. Watergate was nothing compared to this.","post_message":"BREAKING..."},{"comment_id":"10153818538521519","commenter_b":"She's ok with a total asshole who may blow up the world though apparently","commenter_a":"Her son did NOT even work for the State Department, he worked for the the CIA. Her comments and opinions about Hillary are completely irrelevant.","post_message":"Pat Smith at RNC: Hillary Clinton \"deserves to be in stripes\"..."},{"comment_id":"10152767581187061","commenter_b":"Big deal. She is and always will be a pedophile","commenter_a":"She taught him in second grade??!!! How outrageous is that??!! And what about her 4 children that she already had? Not a word about them!! So wrong!!!","post_message":"Mary and Vili are still together and about to celebrate their 10th wedding anniversary. Their 2 daughters are now older than Vili when the affair started: @webpagelink"},{"comment_id":"1034093419959450","commenter_b":"@username OMG Yay! We should praise bernie more often! <3","commenter_a":"He needed to win by 57%. He barely squeaked by, and only tied in delegates. It was not a good day for him.","post_message":"Are you feeling the Bern?"},{"comment_id":"10153780150441509","commenter_b":"That's nasty","commenter_a":"Shave your freakin pits.","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"},{"comment_id":"1016269761823135","commenter_b":"Disgrace to this country she is a racist bitch of another type BAN this bitch from your cities stop buying her crap she calls music no talent bitch.. Yes I am pissed she is allowed to keep going.","commenter_a":"She has shown her true stripes and needs jail time to think about what she did knowing her idiot followers would try to please her.","post_message":"Beyonce has morphed from pop-star to Jesse Jackson in a D-Cup. Check this BS out. BTW, She foments more hate than any zany right-winger 'the media' makes up. @webpagelink"},{"comment_id":"519430408242325","commenter_b":"What do expect from narcicistic bullies? They steal cheat etc...go figure....most poor folk who steal get arrested..why not trimp chimp rabid rat","commenter_a":"Well it's nice to see how Trumplestiltskin would use Meredith McIver as a scapegoat for that plagiarized speech that dipstick Melanoma Trumplestiltskin gave!! C'mon, surely you can see through the Trumplestiltskins I mean honestly am I the only one!? LOL!!","post_message":"Meredith McIver is listed as a co-author with Donald J. Trump on several of the books he's had his name on spanning more than a decade."}]
