[{"comment_id":"10153757618426336","commenter_b":"You're a complete @$$hole !","commenter_a":"Hey Campus Employee where are you going to? I'm going to Disneyworld (Suckers!!!)","post_message":"Kathryn Thompson, who works the night shift at an on-campus coffee shop, has always dreamed of taking her autistic grandson to Walt Disney World."},{"comment_id":"10153130457761162","commenter_b":"P.s pimps should be illegal, prostitutes should regulate their own self on how.much they make an what not","commenter_a":"Would it have been better if he had raped someone?","post_message":"NEW: NFL Hall of Fame lineman Warren Sapp arrested for allegedly hiring a prostitute after covering the Super Bowl for the NFL Network: @webpagelink"},{"comment_id":"1796967167212138","commenter_b":"What an idiot!!! Cher became a Chair!!!","commenter_a":"Scum of the earth. Crawl back into your hole.","post_message":"**Irony Alert**"},{"comment_id":"10157833652505615","commenter_b":"I think it's really stupid to be laughing at someone trying pretty much entirely on her own to recount an election everyone agrees was not by the book. When calling this election \"not by the book\" is a gross understatement. Forcing recounts in some critical swing states in a situation where the electoral vote and popular vote are completely different is a reasonable endeavor. What's absurd is how much of the establishment is willing to lie back and let this thing happen, then assure us in the same breath nothing truly terrible will come out of this administration because the establishment will prevent it. Actions speak louder than words, and the inaction of pretty much everyone other than Stein, Sanders, and Warren speaks volumes.","commenter_a":"Jill Stein, election spoiler, is going to put that money raised in her own pocket to pay her expenses.","post_message":"This Just In – Just a few hours til deadline..."},{"comment_id":"1457667300971814","commenter_b":"Or fire her!","commenter_a":"I am ashamed of NBC. Rather than addressing the crude and disputable comment by one of your employees, you just champion Chelsea. Do the right thing fire Katie Rich and issue and apology","post_message":"\"Barron Trump deserves the chance every child does - to be a kid.\""},{"comment_id":"10154691859089778","commenter_b":"Smart enough to know that it's people like Trump that make the world go round. It takes the 1% to contribute the 99% of us that couldn't keep the economy a float without there financial support or contributions to the economy. What is ruining our economy is supporters like yourselves who probably believe in giving the minorities a place to stand in the bread line while they send there un-taxed & undocumented earnings home to there families living like royalty on the backs of the mighty American dollar. While the rest of registered documented citizens pay our taxes to make America great. I am all for immigrants who are here legally and lawfully it's you stupid idiots who support the system in the blind to allow otherwise.","commenter_a":"Racist people are coming out the woodworks. They are attacking Donald Trumps campaigned because they are to stupid to understand the truths of our Society. To stupid to understand simple economics, taxes and laws. They result to violence and idiotic actions. Because they are to stupid to see what's right and wrong!","post_message":"Protests erupted during a Donald Trump rally in Chicago, forcing him to cancel the rally. @webpagelink"},{"comment_id":"10153707450494218","commenter_b":"I DONT CARE if he was Sellings DRUGS or Selling His MOTHERRRRR These Six Police Officers TOOK A LIFEEEEEEE PPL.. ANd for that They Shall SUFFERThat's IT That's ALLLLL","commenter_a":"No justice for the 6 officers who were doing their job. What do we have police officers for? That needs to be explained..... Mr. Gray was a drug dealer plus numerous other things. Baltimore wants to keep drugs in their streets it seems! My thoughts only and Mr. Gray, well he would have gone to prison if he lived I hope.","post_message":"#BREAKING #FreddieGray Judge denies motion to dismiss charges against 6 police officers in death of Freddie Gray. He also denied a motion for State's Attorney Marilyn Mosby to recuse herself. Follow live updates: @webpagelink READ more here: @webpagelink"}]
