[{"comment_id":"10154254404659411","commenter_b":"ya protest naked on the streets like the old lady in Australia it is 100% success rate","commenter_a":"Excellent News! These EU Nazi fascists need to be confined to the dust bin of history, and this thieving scum Schulz, Junkyard and is cronies sent to the gulag for the remainder of their lives for ruining so many lives in pursuit of their s**t sack Utopian dream which extends no further then their own arse pocket of course. Now, on another note, anyone have any ideas on we can help this festering turd of an EUSSR to collapse any faster????","post_message":"'Implosion of the EU'"},{"comment_id":"1509765899325906","commenter_b":"Shut up bitch","commenter_a":"As much as i hate to see President Obama leave office, I can't wait. I can't wait to point out to my Republican friends that noone has knocked on your door and taken your guns, he did not declare himself a dictator and refuse to leave office and my personal favorite example of media driven paranoia......were you chipped??","post_message":"\"What EXACTLY has Obama ruined in this country?!?!\" Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154259751471509","commenter_b":"What because he supports the laws of the land? Yeah. Illegal immigrants are illegal. Period. Muslims harbor terrorists.. Period. We are 19 trillion in debt. Will take a business person to get out of it, not a crooked politician who put us here..period.. I can keep going","commenter_a":"That's the main reason Trump will be elected, we the people are pissed, Hillary lies, Obama lies, Congress lies and the media lies for them","post_message":"Ever felt that politicians were fibbing? Several CNN Opinion contributors weigh in on truth and lies in the political realm."},{"comment_id":"10156687877045725","commenter_b":"you are 100% illegal .","commenter_a":"Yeah you've hired illegal immigrants too","post_message":"I’m the only one on this stage who’s hired people. I’ve hired thousands of people! #GOPDebate"},{"comment_id":"10154086609949270","commenter_b":"@username I wouldn't scream foul if a woman was captured simply because she's a woman. Don't ASSume that, thanks darling! They take the risk just like any other man serving. You assume that a lot of women would want to jump in to combat roles over the 'safer' ones. Some might, yes. Not all. Just like having the Ranger tab it does not mean you will be in a Ranger regiment. Women are not afforded all paths in leadership like men are. I never said the standards should be lowered, did I? Nope. I VERY CLEARLY said \"If these women could not pass at the lower standards, then they have no business being part of it. So, they didn't make the cut, and yet you're still pissed off? \". Read it again, and again, and again until you understand what I wrote. Should I spell it out in simpler terms? ...","commenter_a":"There goes the military! Fools! They already lowered the standards for SEALs because of their little 5 year project that ended in 2015! They had to lower the standards and give them \"step boxes\" to complete the courses! What a crock of crap! Even at lowering the standards NO FEMALE PASSED! Certain \"jobs\" in the military should be left to the men! Females will put soldiers lives at risk when they get shot, twist an ankle, break a nail or just have a bad case of PMS! This government is ruining everything!","post_message":"The women are the first female soldiers to be accepted into the Special Forces Assessment and Selection and could report to Fort Bragg as early as October."},{"comment_id":"1147470615320800","commenter_b":"For one I'm not a dumb ass.So don't call me names.Im a lady.And I will vote Hillary","commenter_a":"Clinton for president","post_message":"BREAKING: ANONYMOUS Set To Drop MOTHER LODE On Hillary TOMORROW... Here's What We Know [VID] \"EVIDENCE EXPOSING THE LARGEST COVER-UP IN AMERICAN HISTORY!\""},{"comment_id":"1080143312021089","commenter_b":"Yep TRUMP 2016","commenter_a":"Looking forward to him becoming our next president asap.","post_message":""}]
