[{"comment_id":"1567259589966213","commenter_b":"She is a better person than all of you below!!! I am white and a Christian.","commenter_a":"I am so disgusted by all the haters. Eating healthy, and fighting childhood obesity benefits everyone in this country; or maybe you would like to pay the medical bills for all the diseases that are caused by lifestyle in this country. Even Trump with all his bragged about billions does not have th money to pick up that bill.","post_message":"She made a beautiful announcement then was called every racist name in the book."},{"comment_id":"537397173122691","commenter_b":"Letting illegals into the country","commenter_a":"Is there anything that does not get lefties in an uproar? Anything at all?","post_message":"This photo has San Francisco Leftists in an uproar!"},{"comment_id":"10152556429696680","commenter_b":"I think it has been established that there would be a guest worker allocation. I am more concerned with the 40% of Illegals that are OVER stayed Visa workers! They come here on Visitor,Student and Work Visa's and don't leave when their term limit is up!! They are taking jobs from all levels of American workers!!","commenter_a":"In the meantime how about passing E-Verify and prison and fines to those employers that hire illegals??","post_message":"The House might have to delay consideration of its border security bill until the middle of February. @webpagelink"},{"comment_id":"1114872955238500","commenter_b":"Dumb Bitch","commenter_a":"I'm rich. No I'm trans. No I'm rich. No I'm trans. Ahhh!","post_message":"um... Caitlyn Jenner Donald J. Trump"},{"comment_id":"10153279079299170","commenter_b":"With so many illnesses she has claimed, she must be unhealthy in the brain!! We already have one of those we don't need another one!!","commenter_a":"islamofascists have no respect for women, including Barry O. How could they have any respect for Hillary?","post_message":"If Hillary's such a precious little snowflake that Rand Paul is supposed to treat her with kid gloves, how is she supposed to deal with Putin, ISIS, The Norks, Iran, Asaad, Cuba, China, etc?"},{"comment_id":"976949909016658","commenter_b":"Female Opinions? Female Opinions Being Heard? Female Opinions Mattering? #BananaPeelSledToHell","commenter_a":"We need more where I live!!","post_message":"It's a slippery slope, America"},{"comment_id":"1001474073269501","commenter_b":"Muslims consist of .9% of our population. Bigotry around 20%","commenter_a":"I disapprove! He has caused nothing but destruction! The flooding of illegals and Muslims! They are murdering innocent Americans! Obama just sits back and enjoys the show. He lies about his crimes like Hillary does. I'll enjoy the show when Trump is president and arrests your ass!","post_message":"Do you approve or disapprove of the job President Obama is doing in office?"}]
