[{"comment_id":"10153432969041037","commenter_b":"Liars too?","commenter_a":"History lesson needed here - the NAACP is and always has been open to people of all races/ethnicity for membership and leadership. This story is a non-issue.","post_message":"NAACP's Rachel Dolezal: \"We’re all from the African continent.”"},{"comment_id":"10155165115483010","commenter_b":"Preach it lady!","commenter_a":"It's the parking lots and the teenagers. I don't care to fight with people vying for a parking spot or those backing out without looking and those who think they can drive at freeway speed in a parking lot. The kids! I know they love to hang out where they can see and be seen, but I don't like their fresh mouths and their \"It's all about me\" attitudes. Their parents didn't teach them how to be respectful.","post_message":"Department stores are struggling."},{"comment_id":"1073730232720030","commenter_b":"Their all prostitutes, lol","commenter_a":"Mika was raised and programmed to be a prostitute by her father. She's very accommodating when it comes to white politicians and Chinese business men.","post_message":"A hot town hall mic just exposed Trump as the fraud he is."},{"comment_id":"10156300548230389","commenter_b":"Gilbert, go back to the ignorant liberal hole you slithered out of. You spineless snake.","commenter_a":"Who in the Hell is Race baiting? It is Fox Propaganda Channel and @username. Who in the Hell supported the Racist Tea Party? Fox Propaganda channel. I see by the comments that you are the problem, not Obama. Your commenters would rather cut off their heads to spite their faces. That is why they listen to you, for the same reason the German people listened to Hitler.","post_message":"Question of the Day: Do you think President Obama has made race relations better or worse in this country?"},{"comment_id":"1091133320986005","commenter_b":"Hillary should be jailed as well","commenter_a":"Austin no your ignorant","post_message":"WATCH LIVE: Donald Trump on the final day of campaigning in North Carolina"},{"comment_id":"10153755876406337","commenter_b":"Fuck that hoe","commenter_a":"So I guess they're never ever ever getting back together","post_message":"IT'S OVER: Taylor Swift allegedly dumped Calvin Harris because of an, ahem, \"massage\"..."},{"comment_id":"565139210325963","commenter_b":"Just a thought, but doesn't having a system of getting illegal aliens jobs that no on else wants to do sound a little like the Slave-plantations system? After all, employers get poor, uneducated people to do jobs that others won't do. And they can abuse these workers with meager pay and living conditions. They can violate rights without facing consequences. Could be seen as a human rights violation fueled by greed.","commenter_a":"For everyone who thinks Mexican are illegal n don't know their history the white man is an illegal.. We Mexicans always been here","post_message":"Diego Reyna, a Mexican-Canadian, said he placed the Mexican flag atop the nearly completed Trump Tower because he was tired of disparaging remarks made by Donald Trump. \"MR Trump, we did our best work, your tower here in Vancouver is premium quality, and we were a crucial part of it, not just Mexicans but immigrants as a whole,\" he wrote on Facebook. \"The insults you have said about us, have not changed our work ethics.\" Reyna says he hopes his message of \"love and unity\" will reach the Republican presidential candidate."}]
