[{"comment_id":"1062576617115128","commenter_b":"I think if Americans knew the reason and how our fresh produce(picked by illegal and legal migrants) become contaminated with ecoli and other harmful filth- we would all choose trained Americans to harvest our FOOD. People pay more for organic produce, unsoiled produce is just as valuable.","commenter_a":"The farmers did it to themselves. They gave those jobs, back in the 60s, to illegals who worked for cents on the dollar - and American families were shoved out of the industry. Don't say there aren't people out there who won't do the work. There WERE people out there doing the work - and they threw them away. Let's FIRST - get rid of them ALL - and give it a year to play out to see where we actually NEED work visas. If american companies (and farmers) can show that they diligently TRIED to hire Americans and could not get the skill or number of people they needed - FINE, then they can apply to bring people in on VISAs.","post_message":"THE #1 ISSUE FACING AMERICA Recently, I joined Dr. Carson to discuss immigration. We met for 90-minutes. I shared my experiences, opinions, concerns, and solutions with him. Topics ranged from border security, terrorism, drug and human trafficking, the impact on jobs, wages, welfare, education, culture, and healthcare. HIGHLIGHTS OF WHAT I SHARED: 1. Last year, after announcing I’d explore running for president myself, Megyn Kelly asked why I wanted to be president? I replied, “I hold the sort of conservative values which America needs today. And in the same way Reagan kept his word by bringing home the hostages, I promise to secure the border and solve the immigration problem. I went on to say I'd protect the American people, their lives, their jobs, their health, and their children in the same manner I protect my own. I told her audience I was in love with America. Later that night ..."},{"comment_id":"961900420609625","commenter_b":"Of course Mary doesn't care lol ignorant people usually don't listen","commenter_a":"Your was hoping he would be our first African American president. Instead we got a communist African Muslim!!!","post_message":"President Obama delivers his farewell speech in Chicago."},{"comment_id":"10153715993757293","commenter_b":"Make it a felony to hire anyone illegal","commenter_a":"I've watched illegal immigrants take construction jobs from my fellow Americans for years. Build the wall.","post_message":"In a two-page memo to The Washington Post, Donald J. Trump detailed his plan to force Mexico to pay for a border wall"},{"comment_id":"389420827906465","commenter_b":"Tony, Many of today's pillars of righteous GOPer's come from illegal entry to the U.S. We often forget the illegal passage of our Italian, Irish, English, ancestors. You know the \"mention pot\". Key word that you are ignoring is RACISM. Hope that's not you, but it sounds like it might be. Have a good day !!!","commenter_a":"In a Nation of immigrants,mi would expect nothing less. The reactionary GOP is just plain backwards and have forgotten our heritage.","post_message":"President Obama has their back."},{"comment_id":"1871395319625852","commenter_b":"I can totally see her talking to the Queens of other countries not clomping around scowling at everyone that is pretty","commenter_a":"For a GOP Super Pac to do this to a presidential candidate's wife and family is inexcusable and wicked as hell. Look at her TODAY. She will be the most glamorous and classy first lady yet and envy of the nations.","post_message":""},{"comment_id":"10154969618344726","commenter_b":"muslim migrants.","commenter_a":"And people wonder why nationalistic skinheads are on the rise in that country.","post_message":"One poll finds German women no longer feel safe."},{"comment_id":"840577339312941","commenter_b":"I can't help but wonder at a few things, if the anti vac parents with children that have Measles now had seen to it that their kids had the MMR vac, would the kids be sick now and also, look at where the majority of the kids that have had and now have measles have in common...vacation to Disneyland...ummmm no illegal alien has that kind of money, unless they are coming from wealth in the first place. It is all too easy to blame the \"illegal aliens\" for everything wrong in out country...not always the case.","commenter_a":"Ya think? Duh....","post_message":""}]
