[{"comment_id":"10153487463364203","commenter_b":"Problem is not her parents. Problem is a whacked out white woman desperately wanting to be black.","commenter_a":"It's weird but I wonder why her parents threw her under the bus. Must be something else going on.","post_message":"The NAACP president in Spokane, Washington, has come under investigation after her parents said she been posing as black for years."},{"comment_id":"854160414621300","commenter_b":"That's because they don't know it, and they think they're smarter and know more than anyone else. Truth is, they're afraid of Gowdy!","commenter_a":"GO GET EM!!! If anyone can do it you can.Luv your passion and fire!!!The dems DON'T think anyone knows the Constitution...","post_message":"\"I'll make you this promise...\""},{"comment_id":"1183868738313543","commenter_b":"I'd rather have my daughter use the restroom with these people:","commenter_a":"Before you know it they will be in your kids public restroom if they aren't already, thanks to the new laws.","post_message":"UPDATE: The Winter Haven Police Department arrested 22-year-old Adam Timothy Tharp after he was caught flashing a 7-year-old girl at a Polk County library."},{"comment_id":"1033663213364148","commenter_b":"@username if there illegal how did they get your job??? I thought illegals couldn't be hired?","commenter_a":"Shut off all immigration, build the wall, get rid of illegal aliens. That in itself should generate a large number of jobs!","post_message":"Fox News had an illegal alien on during the #GOPDebate to ask candidates what they would do with illegal aliens. Shouldn't they be asking them if they would reduce immigration to help American workers?"},{"comment_id":"10152914682658598","commenter_b":"So do women.","commenter_a":"Weak! Some guys need to man up and become responsible","post_message":"Man Kills His Own Unborn Child After He Secretly Puts Abortion Pill in Girlfriend’s Drink"},{"comment_id":"10153990406082293","commenter_b":"@username apparently you believe so easily what Hillary says. She is a vicious Evil woman who cares about Money and Power and no one else. I have been around for all the Hillary Scandals and every one of them will be coming back at her during the next few months. I don't know how this woman can sleep at night for what she has done.","commenter_a":"She has been held to a higher standard. Republicans have spent decades trying to pull her down. #ImWithHer","post_message":"Hillary Clinton's honesty problem is growing."},{"comment_id":"485867691579702","commenter_b":"Sad to say but our state has that stupid caucus! Thanks to our friend Reid!","commenter_a":"Amen @username!","post_message":"Greetings from Ben Carson High School."}]
