[{"comment_id":"923226521098446","commenter_b":"Shut up Loretta, now!","commenter_a":"Not only telling the truth - but the DOJ just blatantly stated that they will take away your First Amendment rights!! So DOJ is after our 1st Amendment rights, Obama wants to take away our 2nd Amendment rights, the list goes on and on.....the hits keep on coming!","post_message":"Criticism of Islam equals Islamophobia, and the attorney general of the United States, Loretta Lynch, has just warned that people will be prosecuted for criticism of Islam -- i.e., telling the truth that Islamic terrorism exists. You can be prosecuted if you tell the truth about Islam."},{"comment_id":"961657090560706","commenter_b":"Ugly woman!","commenter_a":"I am sorry but on this point I do agree with her,but I do not agree with the fact she is on 20k a year,","post_message":"Benefits mum does not understand why we send money to Africa"},{"comment_id":"10156244248180354","commenter_b":"Stop importing the pigs and it wont be","commenter_a":"Learn English","post_message":"Obama's New America..."},{"comment_id":"447409202129260","commenter_b":"She is the best candidate!","commenter_a":"Dear God deliver us from this evil!","post_message":"Slap Yo'self! www.eaglerising.com"},{"comment_id":"10153315079826680","commenter_b":"Women are voting for her because she's the most qualified and she's been speaking up for us her whole political career. Not because we're shamed or bullied into it.#Imwithher","commenter_a":"And join her in hell","post_message":"POLITICO's Roger Simon says: It's a strange world when women are being shamed into voting for Clinton."},{"comment_id":"1862646097306537","commenter_b":"Now that is what real Democracy looks like. You go GIRLS with you in spirit.","commenter_a":"Beautiful","post_message":"What a successful march! Can we get 300,000 likes for these brave ladies? Read more HERE: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153143313576350","commenter_b":"Idiot!","commenter_a":"I think they are all smiling because they didn't know how to react. Maybe a nervous laughter? And they have more class than to be rude...even though he does deserve it!","post_message":"Kanye West had an impromptu moment last night with the TODAY anchors!"}]
