[{"comment_id":"1512598459048144","commenter_b":"Your the dumb ass!!","commenter_a":"You people are stupid if you think illegal immigrants get assistance. They stay in hiding so that they don't get caught and sent back. They can't get assistance without a social security card. Stop listening to dumb ass Trump.","post_message":"Trump says his plan to build a wall at the border is absolutely not negotiable. Do you support or oppose the wall?"},{"comment_id":"1403734329688680","commenter_b":"these mobs are planed and paid for by the elites and must be stoped","commenter_a":"These people need to be arrested. This is not peaceful protest. It's criminal.","post_message":"BREAKING: Trump Official RUSHED To Safety After What Mobb of Attackers Just Did To Her Outside Child School"},{"comment_id":"1056321337718549","commenter_b":"Racist bitch!!","commenter_a":"republicans say they are not scientists. Then they should keep their mouths shut about science.","post_message":""},{"comment_id":"545649178956022","commenter_b":"I've held that Cruz is probably more dangerous than trump because he has all the bigotry and hate but he is actually serious about it as opposed to trump who is just a bizarre orange man who is saying what he needs to get elected.","commenter_a":"Is that so? Then he's an even bigger idiot than I thought","post_message":"Ted Cruz knew exactly what he was doing by not outright endorsing Donald J. Trump."},{"comment_id":"10153757238999411","commenter_b":"Maria J Haloho A slut will be a slut anywhere","commenter_a":"Most Arabs are depraved sexual predators.Anyone who has ever seen Arabs on holiday in a European country can confirm that","post_message":"'Obviously neighbors aren happy about it, but it is what it is'"},{"comment_id":"10153636723007507","commenter_b":"^This is feminism. Mmmmm smell the equality!","commenter_a":"You know what? Doctors have been ignoring women's pain as imaginary forever. Everything is not about race.","post_message":"The need to constantly reiterate black humanity—because that’s what this comes down to—is both fatiguing, and frankly, infuriating."},{"comment_id":"10153784629291323","commenter_b":"So women are overly sensitive and need to \"man up\"?","commenter_a":"Actually, men do say and do the things they say on the internet in person to women, and the reaction by society and the bosses is about the same: yawn.","post_message":"\"If the things said by men to women on the internet were said by men to their female colleagues in workplaces, they would be fired. If they were said by men to women in public spaces, they would be removed [..] The belittling and bullying, threats and harassment, cyberstalking and outright hate speech directed to women on the internet every day is real-world behaviour with real-world consequence and it should oblige real-world punishments.\""}]
