[{"comment_id":"10153842971535950","commenter_b":"Mary, please remove yourself from the gene pool. Don't reproduce.","commenter_a":"Many western people feel targeted and afraid of muslims. You never know what they have underneath all that crap they have on. Why don't they go back to Muslims countries?! If they can't adapt them should not migrate.","post_message":"In Nice, a city with the ban, police can fine any woman wearing a burkini -- or force her to disrobe."},{"comment_id":"460052980821324","commenter_b":"Put the pussy on the chain-wax","commenter_a":"This headline is complete and utter garbage click bait bullshit. Mumford & Sons had nothing to do with THE CITIES/RESIDENTS. You can't blame a band for the amount of fans they attract, they're grammy award winning musciams coming of a 2 year hiatus after releasng a long awaited album. The city is the problem here for using this \"cleanout method\" which they are literally treating these people, HUMAN BEINGS, like trash and obviously have no problem using terms that state that. Blame the city not the band, oh and actually read the article.","post_message":"Not cool."},{"comment_id":"10153965204071680","commenter_b":"Vote Hillary !","commenter_a":"Bruce Moss","post_message":"Joe Biden: \"It gets down to Florida, Florida, Florida – not a joke! You all do your job, we get to go to bed early Tuesday night.\""},{"comment_id":"10154324283638854","commenter_b":"Like they say it for the first time !!! they say it all the time it is their law and authorities are to blame ! There is no way of knowing which Muslim will want to become a martyr by killing who ever their god tells them to kill !!! this religion must be totally banned in a Christian Country !!!","commenter_a":"The Gay community needs to vote for Donald Trump. If you vote for Hillary you can expect more of these infiltrator brought into this country unvetted.","post_message":"VIDEO: Speaker at Orlando Mosque Says Gays Must Die. SPREAD THIS EVERYWHERE!"},{"comment_id":"10153950593368984","commenter_b":"MAXAMED : WITH THIS NAME YOU SHOULD NOT BE SHOWING OFF!! JEWS ASURE THE WHOLE PLANET BELONG TO THEM, WHAT SAY YOU? FIRST CHANGE YOUR RIDICULOUS NAME, THEN AFTERWARDS CUT YOUR PENIS, ONLY TO SAVE THE WORLD OF PEOPLE LIKE YOU.","commenter_a":"A simple answer: If Muslims need to be treated like Muslims, then they should commit their crimes in Muslim countries. When in America, do as Americans do!!!","post_message":"Muslim inmates decided they needed special treatment because an Islamic holiday was coming up, so they started making insane demands. That's when the jailers responded with some unexpected news..."},{"comment_id":"947825155333866","commenter_b":"..i got 99 problems but a bitch ain't one","commenter_a":"Wax off wax on Daniel son !!!!","post_message":"This can't be real"},{"comment_id":"1333824080002554","commenter_b":"@username love that red dress","commenter_a":"Jessica Phillips @username Jasmin Pluto this is great","post_message":"WTF does \"girlfriend material\" even mean?..."}]
