[{"comment_id":"10154468706093869","commenter_b":"Maybe not, 45 may beat her to the prison. At least, those of us who are not bamboozled are hoping to see him in a federal prison.","commenter_a":"Dream on. Hillary will be convited and thrown in prison where she belongs.","post_message":"Today's daily cartoon by Tom Toro. Swipe through more cartoons with the New Yorker Today app: @webpagelink"},{"comment_id":"10152587508455163","commenter_b":"She read them their rights! Envyherlashes Tawana","commenter_a":"@username girl yes I was so happy Amber told them hoes wat it really IZ it's was going on ALLDAY yesterday!!!!!","post_message":"Amber Rose responds to Khloe Kardashian after calling her out for Kylie and Tyga comments"},{"comment_id":"10153007409220950","commenter_b":"What difference does it make if the victimizer was an illegal immigrant? They're no more likely to be criminals than anyone else.","commenter_a":"How about if your family was a victim of an illegal immigrant?","post_message":"Would you forgive the suspected Charleston shooter if your family were among the victims? @webpagelink"},{"comment_id":"10154012429911509","commenter_b":"Shut-up and go away!!","commenter_a":"Hi i am Ellie I am 17 years old hot Girl want to some Love able friend I live in USA Follow me I will Follow you Back Like me And make me friend <3 :D <3","post_message":"In Malibu, people call the cops on other people just for sitting on the beach. It's been going on for decades. Last weekend, we put access to beach property to the test. @webpagelink"},{"comment_id":"10150520192784999","commenter_b":"Muslims are killling every one left and right, with in and out side religion people. They should not live in the well of ignorance and they should accept other cultures. Most of the muslim managed countries are in bad shape, their contribution to the science and technology is zero. All the gulf countries were on donkeys before and now with oil they have money but the cannot compete with any one as they live with women, wine all the time. They fund money to third world country people to kill others and they sit and watch. No religion is bad, all we need is education and awareness.","commenter_a":"Who is #muhammad(PBUH) : He is the one who defended the rights of all humanity 1400 years ago. He defended men's, women's and children rights He commanded and fostered the love between relatives and neighbors.He established a coexistence relationship between Muslims and Non-Muslims He organized the relationship between the members of the family putting duties on sons and daughters towards the parents He fought injustice, called for justice, love, unity and cooperation for the good. He called for helping the needy, visiting the patients, love and exchanging advises between people. He prohibited (by orders from God) bad manners such as stealing, lying, torturing and murdering.He is the one who changed our lives and manners to be better. A Muslim doesn't steal A Muslim doesn't lie A Muslim doesn't drink alcohol. A Muslim doesn't commit adultery A Muslim doesn't cheat A Muslim doesn't kill innocent people A Muslim doesn't harm his ...","post_message":"How governments and other authorities in Mideast countries responded to the new Charlie Hebdo Officiel cover."},{"comment_id":"10154148275886162","commenter_b":"#FEELTHEBERN #DUMPTRUMP","commenter_a":"Yes, I did!","post_message":"SHARE if you got out and voted today! We'll be updating with all the latest results throughout the night: @webpagelink"},{"comment_id":"10153071798041051","commenter_b":"What a bitch","commenter_a":"Stupid! !","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."}]
