[{"comment_id":"1890218664531612","commenter_b":"Bitch please","commenter_a":"I wish they had either a dislike tag or a big BOO we could tag!","post_message":"By selecting this unqualified ideologue, Trump just declared war on public schools. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154308587221323","commenter_b":"Oh stop with this mythology bull, grow up!","commenter_a":"Quran is base of Islam. Quran do not say that homosexuality is pride. GOD bans this type of relation in all abrahamic faiths, but also GOD say that He will punish this sin, people re not allowed to harm gays. They only can make advise. So Sadiq Khan should tell about Quran and not his personal views, abot homoseuxuality, only then muslims will accept him like a muslim.","post_message":"\"The irony of Brexit repercussions is that those good old (or new) British values we bang on about seem to be falling to pieces around our ears. Diversity, unity, respect, equality might sound like cliches on replay – but they do work for us, if we work for them. That’s why approaches like that of Sadiq KhanKhan are so badly needed now. He’s somehow got his act together during a moment of such uncertainty, doubt and disappointment.\""},{"comment_id":"10153307437349641","commenter_b":"Well a man Isis noob is better than a super trained nato soldier who does nothing as all NATO soldiers do - nothing","commenter_a":"i dont think isis fighters are more than trained noobs :v","post_message":"ISIS \"moron\" gives away HQ location on social media:"},{"comment_id":"1191302950909160","commenter_b":"Time for the Trump wall","commenter_a":"we don't care that much where they come from, we only care to DEPORT them ASAP","post_message":"UNREAL! Look how many illegals from other countries are now coming in through Mexico!! WHERE they are from is ALARMING! @webpagelink"},{"comment_id":"10150597550159999","commenter_b":"If you want to, go ahead sugar tits","commenter_a":"Never question again why men don't take women seriously","post_message":"She dated him for his dog. Then another dog came around. Read on in The New York Times Opinion."},{"comment_id":"1014820688580048","commenter_b":"Time for muslims to take their a$$e$ back where they came from","commenter_a":"That's the national anthem. If you aren't willing to be An American than go home! And take the stinking socialist with you. You can take the atheists and the Mexicans.","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays @webpagelink"},{"comment_id":"1811896189089892","commenter_b":"Cause she was lying, and she knows we all know she is a liar!","commenter_a":"Wow.. a fair and unbiased job by Chris Wallace..finally!!...Trump didnt expose her as the lying criminal that she is as much as I hoped Hillary must have had an earpiece she was nodding yes through the whole debate...what a fake! Now lets listen to the corrupt media spin it left when its obvious Trump won.","post_message":"There was no doubt about it..."}]
