[{"comment_id":"10154073966458837","commenter_b":"Getting pregnant for most chicks doesn't cost anything ! Save a few bucks and don't buy a condom .......","commenter_a":"Omg! I'm really trying to understand her thought process at that time, but really can't! Some people have no brains and should never reproduce! There are so many women out here that are dying to be able to birth a child and you have pos ppl like this. Smfh!!!","post_message":"SHOPPING MOM ARRESTED - A Florida mom was arrested after leaving her 4-month-baby in an unlocked car while she went holiday shopping."},{"comment_id":"531668583690388","commenter_b":"GO AWAY!","commenter_a":"This bitch needs to change, or else....","post_message":"Hillary Clinton just said all Christians have to change their beliefs. She is the one who needs to change her beliefs. Do you agree Hillary Clinton it out of line?"},{"comment_id":"10153797502305779","commenter_b":"I wonder how people react to a naked hillary statue where you get to see that bitch in all her glory. Lol. Bet people would respond differently","commenter_a":"Gross!!!! The looks are uncanny!!!!!","post_message":"New naked Donald J. Trump statues appeared today, and now they're legal, backed by a mega-developer of their own."},{"comment_id":"1613087268994006","commenter_b":"Look at that smug look on her nasty face! She makes me want to puke","commenter_a":"Sending to the Khans..","post_message":"Appearing alongside Hillary Clinton, Khizr Khan asks rhetorically, \"Donald J. Trump, would my son Capt. Humayun Khan have a place in your America?\" @webpagelink"},{"comment_id":"825373110931702","commenter_b":"It's ok. Can't hurt anybody. He's irrelevant. Just laugh at him and move on.","commenter_a":"And this is why Trump won. Republicans are always told they must apologize, even by other Republicans.","post_message":"He's baaaaaack... WATCH:"},{"comment_id":"1704317133188732","commenter_b":"What's he going to sound like when he is eight? Just unreal! God Bless you buddy, keep it up","commenter_a":"Wow now that's something you don't ever see or hear unbelievable so beautiful never would of thought a 4 year old could sing like that.I think singing is in the future for this young child.","post_message":"Oh MY! This little guy knows his Dolly Parton."},{"comment_id":"10152697145362144","commenter_b":"Sam. The lowest approval rating ever goes to Obama.","commenter_a":"No he is not. I am so disappointed in how NOT liberal he is and I voted for him twice.","post_message":"Obama is the most liberal president since LBJ. But that's not what conservatives hate. They hate him because he's also the most effective Democratic president since LBJ."}]
