[{"comment_id":"468369446686969","commenter_b":"I believe these things are available in Africa where they can be real African's.","commenter_a":"We already know, they want to sit home doing nothing mooching on working people, make love and have babies to get more government checks, and get fried on dope.","post_message":"An all black student group, 'Being Black', is threatening violence if their demands are not met. We're tired of Al Sharpton, Eric Holder, and Obama's race baiting! Who agrees?"},{"comment_id":"10154482749054423","commenter_b":"@username doesn't watch this!!!! LEAVE HER OUT OF IT!","commenter_a":"Caitlin Leonard @username","post_message":"PSA: The cast of This Is Us is very sorry for making you cry every episode."},{"comment_id":"1776736589270843","commenter_b":"People don't care it shows what our country has become. Hillary will get plenty of votes","commenter_a":"Charged with 24 counts of fraud and still got 39% of vote. Unbelievable","post_message":"So long, farewell..."},{"comment_id":"10153843599995796","commenter_b":"@username - did white privilege cause 360,000 Union soldiers to die fighting to free the slaves?","commenter_a":"Black lives matter is a racist (by definition) organization funded by George Soros to spread a false narrative, agitate and wreak havoc. People who fall for it, like Ms. Hathaway, are never interested in \"having a conversation\".","post_message":"\"I believe the Black Lives Matter movement calls on us to acknowledge our white privilege and its unfairness, to listen to the lived experiences of our darker brothers and sisters and to help them to achieve a world in which people of all shades live in safety,\" Julia Hathaway writes in her OpEd."},{"comment_id":"10154809751863812","commenter_b":"Yup I'm buying it! Vanessa Duarte I found our house lol","commenter_a":"@username buy it","post_message":"The 3-bedroom property, located in Bracknell, Berkshire, served as the home where Harry Potter grew up with the Dursleys in the movies."},{"comment_id":"10154335392498812","commenter_b":"learn the law because you look like an idiot. TRANSGENDER people can use the bathroom, not men like you and I. I cant just say oh I want to go pee in the ladies room. that isn't how it works. I have a friend who is transgender and her license now says female. she looks like a female. should she go into the mens room? the law is for people like that, not just people who decide today to go in the opposite sex bathroom.","commenter_a":"I won't be listening to them anymore!!! Transgender people are not the only ones with rights,,,if you're a man who wants to use the ladies room get a sex change ....Liberalism is ruining our country,,,,what was a constitutional republic is turning into a socialist hell hole","post_message":"Pearl Jam cancels North Carolina concert, calling HB2 law \"a despicable piece of legislation that encourages discrimination.\" @webpagelink"},{"comment_id":"10153598373182232","commenter_b":"Tom and Debbie: the officer was not a customer of the establishment ... Both of you should read the story.","commenter_a":"Was he a customer?","post_message":"A post going viral on Facebook alleges that a Center City Starbucks refused to allow a uniformed Philadelphia Police officer to use the restroom at the coffee shop. Starbucks says they're aware of the incident and \"taking all necessary steps to ensure this doesn't happen in the future.\" DETAILS --> @webpagelink"}]
