[{"comment_id":"10153649562025950","commenter_b":"Dan Haggerty could have prob saved both..... but hes dead now. that man loved animals .__.","commenter_a":"It should never even get to the point of having to kill an already endangered animal. The zoo failed this gorilla and the little boy.","post_message":"At one zoo, qualifications include gun-loading skills, twice-annual target-shooting tests and a drill that looks like this:"},{"comment_id":"1183171455046239","commenter_b":"Who is she to decide who the child should live with","commenter_a":"I just read another story that he had reversed his decision, probably due to pressure from above.","post_message":"SOUND OFF: Judge believes a child is better off with a heterosexual couple."},{"comment_id":"10154034476612144","commenter_b":"@username you are a freaking trumpette woman which is disgusting. Go away","commenter_a":"Journalist should ask Trump for all his business and private emails when he demands Hillary's. Then point out she has released decades of tax returns and when is he going to pony up like a real candidate. The public has no more right to Hillary's private emails than they do to Trump's.","post_message":"No one is talking about this, but Donald Trump just screwed up and admitted the truth about his taxes."},{"comment_id":"10154493541114060","commenter_b":"Karolina Kulewicz yeyeee","commenter_a":"Congrats Daniel your city came second again! No shame in being runners up 😂😂","post_message":"1. Melbourne 2. Vienna 3. Vancouver"},{"comment_id":"693135860835189","commenter_b":"@username you are too old to be so stupid. Old white men are disgusting.","commenter_a":"Clinton is a LOSER. She may win the Democratic nomination but Sanders supporters will NEVER vote for her = she's lost the general election. Sanders can win it either as a Democrat or independent or third party. . Clinton forgot one thing...,she antagonized Sanders supporters so much that even if he begged they would not vote for her. Not a winning game plan.","post_message":"Hillary Clinton knows exactly how to beat Donald Trump, and she has what appears to be a winning game plan. --Andrew"},{"comment_id":"551369591720287","commenter_b":"She is a disgrace to every First Lady America ever had, not to mention every woman in America. neither she or her husband know their ass from their elbow.","commenter_a":"They need to be GONE !!!!!!!!","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"992176534225146","commenter_b":"Then pick that worthless POS Hillary.","commenter_a":"You can say trump is the lessor of 2 evils but if you think trump will be a good president you are a moron","post_message":"Here's what we've learned from undercover videos. Is this how our next President will do business? @webpagelink"}]
