[{"comment_id":"696122653842743","commenter_b":"They will catch these 2 cowards soon. Police Force do maximum.","commenter_a":"Going Back to origin country, muslim are not belong to europe, they are many coming politecal, assylum in germany, they should send bact to origen country , there muslim,","post_message":"Report: Two armed suspects in Paris shooting located in northern France"},{"comment_id":"10153771650684415","commenter_b":"Wake up!!? Fourty years of Democrats running this country..... Democraps running our country into the ground! EVERY AMERICAN CITIZEN WORKING PAYS 12% of his income to Social Security! Social Security is broke!!! People who have never paid a dime in ..are drawing on it, but they are going to reduce the benefits of those who PAID IN!!! Hmmm.... Only democraps think like that!!! @webpagelink","commenter_a":"Congress makes laws then the Govt turns around and will not enforce them thats why we slowly are losing America to Mexico...our immigration laws are not broken the Govt that will not enforce them is","post_message":"The First Amendment states: 'Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble …' yet despite these constitutional protections, speech-restrictive policies in our nation’s public colleges and universities remain. Today, I sent a letter to 162 public colleges and universities today asking them to update their free speech codes."},{"comment_id":"10153901120586336","commenter_b":"If the current laws are followed and enforced like they should be then no one who should not own a firearm would be able to buy a firearm from a license FFL Dealer. Read about it on the ATF website","commenter_a":"This will do nothing to stop the criminals from doing what criminals do. It will only hurt law abiding citizens.","post_message":"President Barack Obama is reportedly finalizing a proposal to expand background checks by executive order."},{"comment_id":"565139210325963","commenter_b":"Just a thought, but doesn't having a system of getting illegal aliens jobs that no on else wants to do sound a little like the Slave-plantations system? After all, employers get poor, uneducated people to do jobs that others won't do. And they can abuse these workers with meager pay and living conditions. They can violate rights without facing consequences. Could be seen as a human rights violation fueled by greed.","commenter_a":"For everyone who thinks Mexican are illegal n don't know their history the white man is an illegal.. We Mexicans always been here","post_message":"Diego Reyna, a Mexican-Canadian, said he placed the Mexican flag atop the nearly completed Trump Tower because he was tired of disparaging remarks made by Donald Trump. \"MR Trump, we did our best work, your tower here in Vancouver is premium quality, and we were a crucial part of it, not just Mexicans but immigrants as a whole,\" he wrote on Facebook. \"The insults you have said about us, have not changed our work ethics.\" Reyna says he hopes his message of \"love and unity\" will reach the Republican presidential candidate."},{"comment_id":"10154584993799497","commenter_b":"Thanks pussy","commenter_a":"U fuckin cucks","post_message":"Here what you need to know about the alt-right:"},{"comment_id":"10157068560150354","commenter_b":"When you ignorant fucking blacks start acting like black lives matter, maybe then I'll start to believe that black lives matter. Until that happens, and I doubt it ever will, keep killing each other and SHUT THE FUCK UP. Your BLM movement is a FUCKING JOKE;nothing more than LOW LIFE, FUCKING ANIMALS.","commenter_a":"I HOPE THIS IS AN ISOLATED INCIDENT. FOR THOSE WHO STOOD BY AND WATCHED, MAY THE SAME HAPPEN TO YOU.","post_message":"A shocking Chicago video reveals the horrifying death of 32-year-old Marques Gaines..."},{"comment_id":"939835422761174","commenter_b":"Damn...you are still at it? Get off the computer and go talk to the young men whose lives were destroyed. Go peer at those missing eyes. Go stand near the them who lost legs. Listen to the stories of the PTSD stricken. Then come speak this hunger for war. I took an oath to support and defend this constitution. I have great pride when I see little American children stumble to daycare with their backpacks on. I also know, the threat to us doesn't lie in a desert. No donkeys can cross the ocean alive. It's in the profiteers. Those folk who rattle dangers but are too old to pick up arms. Defending our country has been my lifelong business, but I won't say it's been without questioning where the profit is going! Re-read Sodom and Gomorrah. It wasn't about being gay...it was about PRIDE and INHOSPITALITY both of which ...","commenter_a":"You all should do a little research on Trump, did you know that when his father died Trump stole his brother's inheritance and did not get anything to his brothers kids either. He is a greedy bastard. The pathetic part of all of this is that this ignorant population who is supporting him right now think that he is going to do more for them. He doesn't give a rats ass about any of them at all whatsoever. He would structure tax laws and policies that would for their benefit him once he left the White House if he ever made it to presidency. And all those morons who voted for him would sit there with their asses handed to them.","post_message":"LOL! Somewhere, Pres. Obama is rolling on the floor with laughter! Video by Occupy Democrats, LIKE our page for more!"}]
