[{"comment_id":"624483627700413","commenter_b":"Someone gets it.","commenter_a":"Awesome, telling them to get a job is not on the list.","post_message":"Think what you're doing helps the homeless? Maybe it's time to think again. ~Amy"},{"comment_id":"1439319502750684","commenter_b":"Scum","commenter_a":"When will your congress do it's job and imprison that traitorest SOB???","post_message":"A horrified nation learned this week that President Obama handed over $1.7 billion in cash to the terror masters of Iran..."},{"comment_id":"10154954307148984","commenter_b":"You're the dumbass,bitch!","commenter_a":"Lol.you dumbasses believe in stump???lol. I hope you get what he gives you lol and more","post_message":"Paul Ryan is shaking things up with this unexpected announcement. He feels so strongly about this, he decided to make his feelings known during Donald Trump's crucial transition period..."},{"comment_id":"10154108644646178","commenter_b":"This is where GWB, Dickhead Cheney and all those racist MURDERER Cops belongs. They are the real MURDERERS !!!","commenter_a":"Stupidity abounds in the liberal media. Wake up folks!","post_message":"\"Well, actually, again, if you are a terrorist you belong in Guantanamo Bay. That where they should stay....\""},{"comment_id":"934884219913515","commenter_b":"@username they were not prostitutes. Those were his pimps.","commenter_a":"TRUMPS ASS LOOKS BETTER THAN RUBIO'S FACE. RUBIO IS A DAMN SWEATHOG!!!!!","post_message":"Marco Rubio mocks Donald Trump's face..."},{"comment_id":"10154713916667446","commenter_b":"It's her normal way. She's a bitch","commenter_a":"Trying to be as objective as possible.., she comes across as very angry and off putting , yikes","post_message":""},{"comment_id":"10155786065335329","commenter_b":"I sincerely hope you don't have children or grandchildren. Do not reproduce. You know who needs serious psychological help? People who are so close minded that they can't see out their \"perfect little bubble\" and judge anyone and everyone different than them. I love my generation because we are some accepting individuals. We want equality for all because WE ARE ALL HUMAN!! why does it matter to YOU personally what genitals someone has/wants. Who they lay down with behind closed doors. Why is considered \"crazy\" for the parents to support THEIR child's dreams and aspirations. Like got damn lady. Worry about your own snatch and keep your negativity to yourself. ✌💚","commenter_a":"Wow that family needs serious psychiatric help.","post_message":"\"By four, Samuel broke out in hives when we tried to cut his hair, and at five he told us, through tears, that he wanted to burn his face off because it wasn a girl face.\""}]
