[{"comment_id":"1360158044010314","commenter_b":"Yup :)","commenter_a":"Yes, America will get it right. Our next President will be Donald Trump. I pledge to all the women like me not to listen to the media who wants to portray Mr Trump as being against women, please don't listen to it. Mr Trump will be good to everybody in his administration. He is a fair man.","post_message":"THANK YOU, AMERICA! I love you!"},{"comment_id":"867761519952633","commenter_b":"Illegals can get drivers licenses in NC.....no problemo! Dumb!","commenter_a":"Illegals can drive drunk but I can't. Now that's discrimination. Lol","post_message":"BREAKING: Leaked Document Reveals SICKENING Order Obama Just Issued To Border Agents President Barack Obama has issued a new order for the Border Patrol not to arrest drunk drivers because driving while impaired is not a federal crime. The notice, With Alcohol-Impaired Drivers, directed the 4,000 U.S. Border Agents in the Tucson... #arrest #borderpatrol #drunk @webpagelink"},{"comment_id":"10153414468266323","commenter_b":"Took five years for my son to be. Diagnosed he is now ten","commenter_a":"This is fucking offensive. I can't believe the writer is a senco of all people.","post_message":"The range of options available to the discerning child-labeller is growing: social issue, learning difficulty, behavioural need, obsessive tendency, food intolerance or – my all time favourite – being “on the spectrum” ..."},{"comment_id":"10153720554479330","commenter_b":"Exactly Kathy!! Lets duct tape her mouth shut!!!","commenter_a":"Good!! Can we duct tape her mouth!?!? I don't care that she made a post after this one saying that she was trying to make a point and that the dog stopped barking, no excuses and the dog was probably scared that the human he trusted would do this again!! She needs to be held accountable for this!!","post_message":"UPDATE: Police in Florida plan to speak with the person behind this viral Facebook post. So many calls reporting it as animal abuse have flooded into police departments from Connecticut to Florida that they've had to call in extra workers. --> @webpagelink"},{"comment_id":"10152784029667093","commenter_b":"Apparently, Valerie loves being inbred too!","commenter_a":"If you're white you're right.","post_message":"Parker Co. teen accepts a plea deal, avoids life in prison... @webpagelink"},{"comment_id":"1693365440922113","commenter_b":"We need to take back our country from these liberal Morons! How dare they: your rights STOP where ours begin!","commenter_a":"Funded by MUSLIM BROTHERHOOD to divide & conquer!","post_message":"Black Lives Matter supporters spat and stood on the American flag outside a Donald J. Trump rally Sunday."},{"comment_id":"10153850610670575","commenter_b":"We will see...won't we? Vote Trump and Mexico will pay for the wall. All the others will not put up a wall. All the other candidates don't care about how many drugs are coming across the borders to ruin America and her children. Trump 2016.","commenter_a":"If he doesn't check his tone, he'll be out there with shovel in hand building the well.","post_message":"Maybe not you sir, but Mexico is paying for it!"}]
