[{"comment_id":"397229163813931","commenter_b":"Get these people deported","commenter_a":"if these goat humpers do not like the laws of the US they are free to leave any time they want","post_message":"Shock Poll! More than HALF of Muslim-Americans Think They Should be Allowed to be Governed by Sharia Law!"},{"comment_id":"678779465606192","commenter_b":"Woman you are so ignorant!","commenter_a":"Well hillary killed people so she should be arrested and u should be to for sticking up for her","post_message":"It's funny how that works, isn't it? Like Addicting Info for more great content!"},{"comment_id":"10155151298004170","commenter_b":"@username And what disappointed me the most was our President never called for people to work together and come together as a Nation. It was like he wanted the divide! So sad for this nation!!","commenter_a":"I figured this out after his first term. If you believe the media, he did a great job. The numbers don't lie. He did zero except stir up racial divide. That is his legacy.","post_message":"Years in office: Eight. Years with GDP growth of 3 percent or better: Zero. The final report on 2016 seals his fate as a historic failure."},{"comment_id":"10154099164360329","commenter_b":"DREAM HUBS","commenter_a":"@username your future hubby","post_message":"He never even read the books, but he researched them and made all the magical decorations himself. Read more: @webpagelink"},{"comment_id":"10155768590015557","commenter_b":"Lmao they must be the fugliest bunch of prostitutes in the planet. A darn shame for whoever plugged in that","commenter_a":"I'd rather do the 5 knuckle shuffle. Gross. Just legalize it, better quality.","post_message":"'It's been a problem around here for awhile,' Reading resident says following an undercover sting that resulted in the arrests of eight women on prostitution charges. More on the story in a live report from WFMZ's Ryan Hughes on #69News at 5:30."},{"comment_id":"10156323559275294","commenter_b":"I will respond honestly. I am on the fence with medicinal use. Not sure it needs to be legalized for this purpose but not totally against it. I am totally against recreational usage because the bad outweighs any benefits in my opinion. I do not see it helping the economy or benefitting society at all. Plus the 10 only benefitted from the bill did not help and it should be a law only not a change to the constitution.","commenter_a":"To everyone that voted no I want a legit response on to what was so wrong with amendment???","post_message":"Issue 3, which would have legalized marijuana in Ohio, was voted down by a nearly two to one margin yesterday -- but officials with Responsible Ohio say the fight isn't over. Click below for more, including a complete list of election results:"},{"comment_id":"10152960759722377","commenter_b":"this traitor could add votes from the foreign countries that paid her bribe money to her and bills family charity, like she will add the illegals vote here in the US when the election rolls around","commenter_a":"#ClintonResign","post_message":"The former secretary of state is looking for a more aggressive way to increase her poll numbers."}]
