[{"comment_id":"1003928746312028","commenter_b":"Trump for President. Get rid of the Muslims","commenter_a":"Wasn't it said that you are either with us or against us and any nation found to be harboring terrorist or terrorist training camps will be dealt with as an enemy of the state? If nothing is going to be done about these confirmed training camps by Obama and his administration does this not make them enemies of the American People.? Perhaps it's time for the Knights Templer to return. Take back America Trump 2016!","post_message":"It is confirmed there are 22 Jihadi Training Camps in the USA, but the FBI says nothing can be done about them. This new map shows exactly where they are so you can see if there's one in more in your state."},{"comment_id":"594411744025341","commenter_b":"You probably have one between your legs Shannon!","commenter_a":"Who cares! It's an inanimate object! Ever heard of idolatry? This is it!!!! True followers of Christ don't kneel before a statue, they kneel before the one true God.","post_message":"What does sheer animalistic Muslim hatred against Christians look like? Story below."},{"comment_id":"1799169303666092","commenter_b":"I'm still waiting to hear how sexual relations not involving vaginal Intercourse is not responsible and can't prevent pregnancy if you aren't ready for a child. Allllll ears, lol. Time to find a safe place for you, you can't handle the truth.","commenter_a":"I am 66 years old and I am sick and tired of old white men trying to rule my reproductive life and that of my daughter, and now of my granddaughter. NOT ON MY WATCH.","post_message":"Do you agree with Rachel Maddow? We definitely do."},{"comment_id":"10152980624100667","commenter_b":"Not.","commenter_a":"The Ross Perot of the 21st century :/","post_message":"Donald Trump declined to rule out a third-party presidential bid Thursday if he loses the Republican nomination. \"I will not make the pledge at this time,\" Trump said at the start of the GOP prime-time debate."},{"comment_id":"10154625084044270","commenter_b":"To me she is worthless. And don't care for this evil women. End of story!","commenter_a":"On no that's like putting killary in charge. She is a very evil women. Not good for New Mexico or the air force.","post_message":"President Donald Trump announced he will nominate Heather Wilson, a former congresswoman and Air Force Academy graduate, as the new United States Air Force secretary."},{"comment_id":"466812640175338","commenter_b":"Hang tee bitch.","commenter_a":"Close all borders indefinitely. NOW","post_message":"Muslim Refugee Beats And Rapes Woman In North Dakota While Yelling 'Allahu Akbar' [VIDEO] It's starting to happen in America. We cannot allow any more refugees into the U.S. Do you think we should close our borders to refugees?"},{"comment_id":"10153807572957169","commenter_b":"@username , so all women should quit tomorrow and stay home with their kids. Yeah, that would work out well.","commenter_a":"No, they are not even close to equally important. Your job raising your kid is far more important.","post_message":"It’s time we acknowledge that working parents have two jobs — the one at work and the one at home — and both are equally important to our economy (From PBS NewsHour)"}]
