[{"comment_id":"902649573193973","commenter_b":"And the nasty muslims rape goats","commenter_a":"There are police outside Catholic services in NYC right now. And Jewish services. But not allowed at mosques because it's insulting.","post_message":"“If you've got nothing going on [in mosques] but a beautiful religious service, why in His name would you not want to have police officers?” – Rudy Giuliani reacts to the #OrlandoShooting and Donald J. Trump's push for more surveillance"},{"comment_id":"800436556756837","commenter_b":"And for what he's done to military, vets... Americans! Bringing illegals and terrorists into our country to kill us!!!!","commenter_a":"Yes! Obama should be put in prison for intentionally violating the law and for threatening others, who do enforce the law, with being punished for that enforcement.","post_message":"This Federal Judge Just Took Down Obama For Betraying America. We need more people in this country who will stand up against him. Do you support this judge?"},{"comment_id":"1739956166245053","commenter_b":"Tommy @username lol","commenter_a":"@username 😉","post_message":"Sharing just in case, can't hurt :)"},{"comment_id":"10153297410416770","commenter_b":"She a turd......she better be praying..wrong thing to say,vote Trump","commenter_a":"Too late and why would you support a total liar?????","post_message":"Former Secretary of State Madeleine Albright is trying to fix a mess she made when she told women at a Hillary Clinton rally there's a \"special place in hell\" for them if they don't vote for Clinton."},{"comment_id":"10153959018846341","commenter_b":"The problem that Islam faces is that it is continuously moving backwards. Even in the Islamic golden era, the economy was reliant on slaves and infidels. The only successful Islamic countries today are the ones that have massive oil reserves. Muslims living in countries with no resources tent to live in poverty. This is why you always see Muslims migrating into infidel lands but you don't see infidels moving into Islamic lands. I do believe that Islam will dominate Europe. I have no doubt. Firstly the countries will be split into two with one being Islamic and the other being Christian but the Muslims will continue to migrate into the Christian countries because they will be poverty stricken. Because sharia is so retrograde Europe will imminently turn into another failed Islamic state as they have no resources. European winters can be very hard If everyone wants to pray 5 times ...","commenter_a":"unfortunate though, but this is the same way Palestinians are wailing, groaning and moaning everyday yet no one seems to care. Let's not unite in periods like this alone but all the time.","post_message":"The residents of Belgium capital city woke up Wednesday morning to a new reality, on the day after the terrorist attacks that killed at least 31 people."},{"comment_id":"10153931678551523","commenter_b":"You can't fix stupid! This bitch is flat out ignorant","commenter_a":"She's the same sister that said to take all the violence to the suburbs, but yet she condemns it. Lmao Yeah, condemns it when it's in her part of town, but to hell with the rest of the city and surrounding areas.","post_message":"One-on-one with the sister of Sylville Smith. She spoke exclusively with FOX6's A.J. Bayatpour on Monday. @webpagelink"},{"comment_id":"1368414533215688","commenter_b":"GOD bless them! I HATE cigarettes and the trillions of the non-biodegradable butts that filthy our planet and its waterways.","commenter_a":"Fine them sons of bitches. Why should they be above the law.","post_message":"Thoughts?"}]
