[{"comment_id":"565976566923900","commenter_b":"She is a serial killer.","commenter_a":"They could prove that she was a serial killer and they wouldn't care","post_message":"Here we go..."},{"comment_id":"10153270898427217","commenter_b":"Wife is an idiot to allow this! Publicity stunt completely!","commenter_a":"Great job, idiot parents. Way to teach your kids how to be sexist, abusive morons early in life.","post_message":"🎄🎄 Funny or offensive? 🎄🎄"},{"comment_id":"475643605893567","commenter_b":"Why not hit I would if she did that to me","commenter_a":"First up, this woman is NO lady!","post_message":"This lady just messed with the wrong 73 year-old."},{"comment_id":"1601162620179200","commenter_b":"Idiot. Build a wall","commenter_a":"Go back to Europe white folks... This is are land","post_message":"We're at a \"wall\" of taco trucks -- a protest in front of Trump International Hotel in Las Vegas ahead of tonight's final presidential debate."},{"comment_id":"10153264215531051","commenter_b":"prison is to good for thay bitch","commenter_a":"How about in her not taking care of an American ambassador in Bengazi","post_message":"Question: Do you think Hillary Clinton is guilty of criminal wrongdoing in her email scandal?"},{"comment_id":"10154662767663188","commenter_b":"Absolutely Michael! No Jake herrin Idiots like You are ruining this country!","commenter_a":"Sick of your BS Beck and I don't need your critique on any of this! He cleaned her clock and your whining butt just doesn't like it. If we lose this country it's because of idiots like you Beck!","post_message":"This was Donald Trumps best Performance in the debate. BUT remember the only goal is to ADD undecided voters. Charles Krauthammer just called Trumps performance Political Suicide. He is right. He was winning and then it began to break apart. They both have sealed their core long ago. Tonight was the last chance to bring the women that have been lost or questioning. Those Reagan democrats who worry about foreign policy, Russia or temperament. First 30 minutes were strong for him. He had some good lines and looked (at times) well informed. He had a great open borders section. While I cringed in the gun debate and abortion section. On the second Amendment Rubio, Cruz or almost any other candidate would have cleaned her clock when she spoke about 12 toddlers shooting people in DC. His pro choice response On partial birth abortion was the weakest I have ever heard. ..."},{"comment_id":"10153542396586336","commenter_b":"A third term would be so awesome. Obama could really clean everything up. Do away with guns and churches- and make EVERYBODY git GAY MARRIED! yupyupyup....","commenter_a":"I don't even listen to the guy bc all he does is lie and spew gutter trash. He's an embarrassment. I'm waiting for that executive order where he can \"order\" himself to have a 3rd term! Wonder if those neutered GOP \"leaders\" will actually do anything then or just \"say\" they will! They are all sickening!","post_message":"Do you agree with Charles Krauthammer?"}]
