[{"comment_id":"631712173663014","commenter_b":"Illegals should not have the right to vote.","commenter_a":"Trump is the answer our country needs at this point in time. I have a feeling that this election in November will bring record number of voters -- what I don't agree with is that illegals have the right to vote. That is why the Democrats are pushing this because otherwise they will lose. Voting should only be for US citizens. Looking forward to a better and greater America come January 2017. #Trump/Pence.","post_message":"Watch: This was the highest-scored moment of the entire 2016 Republican National Convention, and it happened during Donald J. Trump’s speech as he addressed the corruption surrounding Hillary Clinton. @webpagelink"},{"comment_id":"1166947526658609","commenter_b":"I am a Democrat and I will not vote for this woman!","commenter_a":"the bride of frankenfood. no mercy.","post_message":"Is she in trouble?"},{"comment_id":"860254627375604","commenter_b":"So their religion allows that then ? Bunch of fucking cowards .","commenter_a":"Time to nuke the FILTH........when will the uk and America finally stop bowing down to this scum","post_message":"Some women have been forced to seek hospital treatment after violent sexual encounters"},{"comment_id":"1052907811455998","commenter_b":"She looks like Hitler's nasty ass! THERE'S A PARTY GOING ON AND THE TRUMP TRAIN TO GET ON, CHOO CHOO, CHOO CHOO","commenter_a":"The left wing nuts see trump as a dictator. He's trying to follow the Constitution and our rule of law. What a bunch of morons","post_message":"Sarah Silverman is a _____________."},{"comment_id":"10155752505360354","commenter_b":"He is done by wanting Oprah as his VP! He shot himself in the foot in one day;","commenter_a":"A man who's made billions... yea, that's what we need, another corporate hive-mind in a leadership position. Wake up.","post_message":"Think Donald Trump lacks serious policy proposals? Think again."},{"comment_id":"1313910325313867","commenter_b":"Some body give me one logical reason to have women in combat.","commenter_a":"There are some exceptional women who can and have performed well. However, truth in science shows overall. Men hold up better. Women break down faster. So many things women do better. Leave the grunt work to us grunts.","post_message":"When will \"the party of science\" accept the truths that science tells us?"},{"comment_id":"10153369363747061","commenter_b":"Should make the short fat squatty ones! Nor everyone has a 12 inch waistline.","commenter_a":"Hello, Are you interested in the world of FAME?? Getting rich. powerful and famous? JOINING THE ILLUMINATI BRINGS YOU INTO THE LIMELIGHT OF THE WORLD IN WHICH YOU LIVE IN TODAY. YOUR FINANCIAL DIFFICULTIES ARE BROUGHT TO AN END. WE SUPPORT YOU BOTH FINANCIALLY AND MATERIALLY TO ENSURE YOU LIVE A COMFORTABLE LIFE. IT DOES NOT MATTER WHICH PART OF THE WORLD YOU LIVE IN. FROM THE UNITED STATES DOWN TO THE MOST REMOTE PART OF THE EARTH, WE BRING YOU ALL YOU WANT. BEING AN ILLITERATE OR A LITERATE IS NOT A BARRIER TO BE A MILLIONAIRE BETWEEN TODAY AND THE NEXT TWO WEEKS. YOU BEING IN THIS OUR OFFICIAL PAGE TODAY SIGNIFIES THAT IT WAS ORDERED AND ARRANGED BY THE GREAT LUCIFER THAT FROM NOW ON, YOU ARE ABOUT TO BE THAT REAL AND INDEPENDENT HUMAN YOU HAVE ALWAYS WISHED YOU WERE .SO IF YOU ARE INTERESTED IN ...","post_message":"There are some new Barbie dolls on the block: curvy, tall and petite! @webpagelink"}]
