[{"comment_id":"1383272325035057","commenter_b":"Donald is a leader and believe in America! Vote Trump 2016!!!!","commenter_a":"You can bet Lying ted is on that list!","post_message":"The process, meanwhile, is the only reason he will get even close to 1,237"},{"comment_id":"10153597366220329","commenter_b":"Like we're met to be best friends lol","commenter_a":"Craig! I still think it's you.","post_message":"It's not me, it's your god damn chargers."},{"comment_id":"10154160211386336","commenter_b":"Stfu feminist","commenter_a":"Thank you @username for backing Megyn Kelly. If the cry babies can't take the hard questions, they can watch the lamestream stations.","post_message":"Unbelievable. (Via: ViralHog)"},{"comment_id":"10153137359278717","commenter_b":"Yeah. It's so good because her employees are rubbing their private parts in your food.","commenter_a":"Lol! Good for her. The restaurant is so small, that I'm sure the other patrons were thankful for that. Btw she has GREAT food at her diner.","post_message":"The owner of Marcy's Diner in Portland, Maine says she doesn't regret yelling at a crying child despite the bad reviews she's been getting on Facebook: @webpagelink"},{"comment_id":"485272544994977","commenter_b":"I'm so sick of her","commenter_a":"So says the compulsive liar.","post_message":"The video shows Hillary Clinton snapping at an activist and calling out the Bernie Sanders' campaign for lying."},{"comment_id":"10153941294344342","commenter_b":"Trump = hate, fear, Hillary = corporate rep, liar, Bernie = peace, unity. He is right. I'd be happy to vote for him. Sad to just vote because I dislike someone more than the other option.","commenter_a":"Bernie wants to ban hydraulic fracturing everywhere. This would significantly reduce American energy production and directly cause oil&gas prices to raise. Not only this, the United States would have to depend on foreign oil once again. There is no reason to ban hydraulic fracturing and deny our citizens the right to exploit their resources for the benefit of us all. If you are convince fracking cause water to catch fire. I really encourage you to pull back a layer and devour the research. You can start by researching academic studies from Standford and Ohio University regarding hydraulic fracturing. Some of the chemicals used in the prop or fluid are hydrocarbons. Ofcourse if you go to ecowatch or earthjustice you will get an exaggerated and depressing perspective that is meant to excite you and encourage you to make a donation. So the few activist can pay for their mortgage and car ...","post_message":"\"I am running for president because I want to give the American people a real choice in this election.\""},{"comment_id":"10153933140869087","commenter_b":"It is their constitutional right to burn the flag just like the constitutional right to carry a gun. I might not agree with it b","commenter_a":"That's constitutional to do. Folks may not like it, but you can burn any flag. Free speech.","post_message":"Chaos as anti-Donald J. Trump protesters burn an American flag outside the GOP convention"}]
