[{"comment_id":"10153581092769087","commenter_b":"give us a number, @username. How many Americans should be murdered, raped, robbed or maimed by asshole criminals who should not even be here in the first place? Here are some crimes committed against Americans by Illegal ALIENS The Sanctuary city of San Francisco protected the previously convicted illegal alien gang member charged in the murder of Michael Bologna, 20, his brother Matthew, 16, and his father Anthony, 48 @webpagelink Illegal alien stabs to death 24 year old college student Lauren Bump @webpagelink Illegal alien charged with murder for vicious stabbing death of Kathleen Byham in a Wal-Mart parking lot @webpagelink Twice deported illegal alien charged with murder of Sheriff's Deputy Josie Fox, 37 @webpagelink Mary Nagle - was raped and murdered by illegal alien who then uses her cell phone to brag about crime to her friends and family @webpagelink Illegal Alien Kidnaps, Rapes, and Buries Alive an 8 ...","commenter_a":"\"I have been thinking a lot about Donald Trump, people say that he doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan, he's giving you an outline. Why? Every time that he has brought something to the table, the other candidates take it and run. Such as, immigration, \"the wall\" and other issues. I can guarantee you that he won't give you his full plans in detail until he is standing at the podium, next to one of the Democrats. THAT is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business, without a strategy, and a form of negotiation already set. This man is prepared in business and will be fully prepared when the time is right, in ...","post_message":"Republican front-runner Donald J. Trump leads his rivals by double digits in Michigan on the eve of the primary, according to a new poll."},{"comment_id":"10152899469751130","commenter_b":"Women tearing women down. This is why we can never have nice things.","commenter_a":"The face and stance totally remind me of the gorillas at the zoo lol.","post_message":"Do not f**k with Ronda."},{"comment_id":"1377095295664272","commenter_b":"And she will WIN !","commenter_a":"killery is an ass...panders to any voter cause","post_message":"Clinton isn’t letting this bigotry go unnoticed."},{"comment_id":"1318403084859330","commenter_b":"They wont be missed","commenter_a":"Awwww!","post_message":"There are some deaths that don't make us cry."},{"comment_id":"917384355021286","commenter_b":"I would love to see Trump/Carson..... Trump because you can't push him around. carson because the man is just smart!","commenter_a":"How does a troll like Trump make America great. When he can't run a business without filing for bankruptcy. You get no I screwed it up and need a do over in politics. Just ask GW Bush. Anyone hear Trumps policy other than he's going to be great. I I don't think so. Let's call him the carnival barker and clown show that he is. And his supporters if you don't like government than don't participate. A vote for a angry clueless egotistical clown won't help America.","post_message":"Republican 2016 frontrunner Donald Trump is a stain on our country. Image by Occupy Democrats."},{"comment_id":"984815688241627","commenter_b":"She is the best lying POS that know!","commenter_a":"She is the best","post_message":"“If you want a president who will tell you everything that’s wrong with America and who’s to blame for it, you’ve got plenty of other choices.…But if you want a president who will listen to you, work her heart out to make your life better, and together to build a stronger, fairer, better country—then you’re lookin’ at her.\" — Hillary today at the New Hampshire Democratic Party State Convention"},{"comment_id":"10158101758695291","commenter_b":"And you know this how?","commenter_a":"Amazed at the crowd who, like all Americans, except native Americans, are from somewhere else. Jesus would not only be proud of these marchers, he would march with them.","post_message":"Birmingham-Shuttlesworth International Airport immigration and refugee march"}]
