[{"comment_id":"614198468735487","commenter_b":"They died due to your lack of investigation! !!!!! Say it it was a terror attack. We MUST STOP THE MUSLIMS COMING IN.","commenter_a":"So sad","post_message":"FBI – Federal Bureau of Investigation Director Comey and Deputy Attorney General Yates brief on the latest in the Orlando shooting investigation. @webpagelink"},{"comment_id":"486290274888721","commenter_b":"Bernie sit yo old ass down u is not gonna win nother","commenter_a":"it's beneficial being educated in this!","post_message":"There is a BIG difference!"},{"comment_id":"10153907246193812","commenter_b":"I don't want them in California!! I don't want them in the United States. Send them all back with a rifle and ammunition to fight for their own country!!!","commenter_a":"But, but, refugees are not terrorists......","post_message":"JUST IN: Turkey arrests 8 suspected ISIS members who planned to travel to Germany posing as refugees, Turkish officials say."},{"comment_id":"657416461115599","commenter_b":"MAYBE SHE NEEDS MENTAL HEALTH !!!!! IF SHE IS THAT BLIND TO WHAT IS HAPPENING IN AMERICA WITH O BUMMER AS PRESIDENT , SHE MUST NEED GLASSES TOO !!!!!!","commenter_a":"She is a traitor and Muslim just like her husband. Impeach him and send all of them back to their Muslim homeland.","post_message":"Michelle just told her biggest lie to date... Her and her husband are liars, plain and simple. Do you agree the Obamas are traitors to America?"},{"comment_id":"10156157123040725","commenter_b":"Keep the illegals out","commenter_a":"I'm glad to get this input.","post_message":"Marco Rubio is weak on illegal immigration and will allow anyone into the country. Has worst attendance record in Senate- rarely there to vote on a bill!"},{"comment_id":"10153763080696350","commenter_b":"Of course he is being dismissed.. If he wasn't, there would be another riot. She needs her butt kicked out of school.. Very tired of this..","commenter_a":"This cop was so wrong with is action I am glad he was fired","post_message":"BREAKING: Sources say that the South Carolina deputy seen flipping a student in a classroom will be relieved of duty."},{"comment_id":"1180082675403600","commenter_b":"What a bitch and she says she is going to help the less fortunate! What a joke!","commenter_a":"And she has been for decades. So sad that so many black people are so clueless. This lying thieving dirt bag couldn't care less about anything but your vote.","post_message":"Talk about something the media will never show us. Look what happened when this young black girl got in Hillary's way. This is so sickening. Hillary is a complete and utter fraud."}]
