[{"comment_id":"10153029424263445","commenter_b":"You're a stupid ass welfare bitch. I can tell by your reaction","commenter_a":"Fuck you. You can't dictate what people do with their money. Plus, how do you know they don't have a kid with an awful disorder that benefit from pot? Your ignorance is showing. Check your privilege.","post_message":"ICYMI - Colorado Bans Use of EBT Cards at #Pot Shops"},{"comment_id":"10153227651945329","commenter_b":"Ikr how dare she maintain a healthy lifestyle, the bitch.","commenter_a":"She can fuck off","post_message":"More like baby washboard, amiright?"},{"comment_id":"1808975196000308","commenter_b":"This news is pretty old. ..... hanging on by a thread NBC","commenter_a":"Chris El Paisitahh","post_message":"The painter who turned Donald Trump's penis into a viral sensation says she's received death threats and alleges one Trump supporter punched her."},{"comment_id":"573047149521906","commenter_b":"God bless White people","commenter_a":"Wow if any of us \"peasants\" had our name attached to an on-going FBI investigation we wouldn't be able to get a job at Seven-eleven. Must be nice being that rich and connected","post_message":"\"This is an active and ongoing investigation.\""},{"comment_id":"10156248973870354","commenter_b":"that bitch!","commenter_a":"i was sexually harassed by Ashley Judd, she had her way with me, then tossed me aside","post_message":"When will liberal Hollywood stop its War on Women?"},{"comment_id":"712618255553616","commenter_b":"They are giving your money to the illegals.","commenter_a":"Moral standpoint! My husband is on disability because of 2 strokes. He cannot even get a part time job because of his disability. I'm on social security and we both do not make enough to get us through the month. We worked for our social security. It is our money. I hope people who are in the same boat as us will stand up to this major jackass!","post_message":"Trump will slash anything, as long as it doesn't affect HIS wallet."},{"comment_id":"1015835041846081","commenter_b":"She needs to take her conscience to another job.","commenter_a":"I'm getting real tired of her behind. My God's name is not Kim Davis. It's time for her to find a new job.","post_message":"BREAKING"}]
