[{"comment_id":"10154196330336770","commenter_b":"Beverly your character flaw is showing again! You need to get a job at disney oh I forgot your not a foreigner# you need to get a hobby!","commenter_a":"He isn't coming cause Trump plans to change the Visa programs so Disney will not be able to bring over cheaper labor and have Americans train their replacement anymore.","post_message":"Are you buying his reason?"},{"comment_id":"1338072722922864","commenter_b":"Boooo she's a TRUMPIDIOT!","commenter_a":"This lady knows nothing all she knows 200 million dollars is in her account for sitting there and talking s*** oh my God good job","post_message":"Senator Chris Murphy (CT) asks Education Secretary nominee Betsy DeVos, \"Do you think that guns have any place in or around schools?\" Check out her answer for yourself:"},{"comment_id":"1700674326840051","commenter_b":"Leave our flag alone!","commenter_a":"Leave it alone!","post_message":"Men and women have died defending our flag, don't mess with it. Do you think the flag should be left alone?"},{"comment_id":"10153312471793606","commenter_b":"Enough Rioting In Baltimore Already It's Time To Cleanup The Damage Those Idiots Made And To Restore Peace Better Yet Make Those Monkeys Who Damaged Baltimore Cleanup Their Own Mess","commenter_a":"<iframe width=\"330\" height=\"180\" src=\"@webpagelink\" frameborder=\"0\" allowfullscreen><\/iframe>","post_message":"#BaltimoreRiots: We're monitoring social media right now, and some people are tweeting to get out and riot AGAIN. @webpagelink"},{"comment_id":"10154092301891028","commenter_b":"she hates clowns","commenter_a":"@username and Leonora Fabio Chavez Don't tell Sarah About this lol","post_message":"Nope. The lore of creepy clowns purportedly trying to lure children into the woods sweeping the Carolinas and Ohio just made it to Tennessee. @webpagelink"},{"comment_id":"549834655207114","commenter_b":"These women are child abusers. Where is child protection?","commenter_a":"Yes !","post_message":"These two lesbians are trying to play god with their son. This is the world we are living in today. Do you think this is wrong?"},{"comment_id":"10154655814574411","commenter_b":"just give them what they wont , then the migrants can all go back home and rebuild","commenter_a":"Bill Jos","post_message":""}]
