[{"comment_id":"1245500588795529","commenter_b":"Clinton thugs!","commenter_a":"@username-- You proud of this?? After watching this, I'm gladly giving my vote to Trump now. These Mexicans don't represent me, & aren't \"Americans\" acting like thugs.","post_message":"MUST WATCH: Video documents months of violent attacks by the radical left on Donald Trump supporters that are COMPLETELY ignored by the mainstream media. This video compilation shows Trump fans assaulted all ACROSS the nation. Worse and not surprising, the media, the left, and Hillary Clinton herself BLAME Trump for these violent assaults when they should be blaming those attacking the Trump supporters. Show your support for Trump by getting the TRUMP: REAL HOPE, REAL CHANGE bumpersticker! --> @webpagelink"},{"comment_id":"10152958936935927","commenter_b":"You can bet if she was muslim, her actions would be perfectly justified ....they wouldn't jail her or tell her to get another job !!!!!!!","commenter_a":"The governor has the power to quietly transfer her people..he choose instead to jail her, its ridiculous..Muslims in the MTA in NYC refused to do their job based on religion reasons, it never even made the news and they were quietly transferred...not jailed. It was worked out quietly and amicably, yet this woman they choose to jail. The governor should be asked why he choose to make an example of her...","post_message":"WATCH: Governor Huckabee - \"You're telling me that you cannot make an accommodation for an elected Democrat county clerk from Rowan County, Kentucky?\""},{"comment_id":"761137067410204","commenter_b":"Good decision by the judge. This entitled brat needs to make better decisions.","commenter_a":"Just another teenage girl who never got proper parental guidance because the parents were too wrapped up in themselves.","post_message":"Outrage After Judge Orders Bristol Palin To Do THIS With Her Breast Milk This is just ridiculous. A mother should not be subjected to this. Do you agree or disagree with the judge?"},{"comment_id":"881610245305235","commenter_b":"She is skanky.","commenter_a":"Megyn Kelly is a waste of human potential. A bright and flashy exterior but of little inner substance.","post_message":""},{"comment_id":"10152929906987377","commenter_b":"Kendal , another stupid liberal !","commenter_a":"You're OUT, Bobby..!","post_message":"Bobby Jindal is calling for tougher gun laws."},{"comment_id":"10154009579409255","commenter_b":"It's an intense embarrassment for us here in Nevada. It's what happens when rational people don't vote in the midterm elections.","commenter_a":"Nevada? How about every other state in this country?! 😕","post_message":"How in the world are these people getting elected to office in Nevada?"},{"comment_id":"10153740918402217","commenter_b":"Good for the women!","commenter_a":"Or are they being left to clean up the rubbish left by the men? When it all goes wrong, people of the masculine variety will blame the women when it was 3 of their number who screwed it up in the first place!","post_message":"It may be a watershed moment."}]
