[{"comment_id":"10152789526371130","commenter_b":"I think her father is a proud lesbian.","commenter_a":"well this little girl is just over the top.. do you think her father is proud? I think not..","post_message":"\"I've been pegged with the word insensitivity. It's just how I've been sensitized and the tone I chose.\""},{"comment_id":"454178371439410","commenter_b":"Deport all savage backward ass cave dwelling Muslim","commenter_a":"Should ban all muslims completely","post_message":"Should The US Ban Islamic Veils In Public? Comment 'yes' or 'no'."},{"comment_id":"658224230997183","commenter_b":"She's buying her way out, watch. Criminal Just like Bush/Cheney. Ever see them traveling abroad? Ever wonder why?","commenter_a":"She is Ugly and a Liar just like Bill !!","post_message":"Judicial Watch announced it has filed a proposed order for discovery with a federal court that seeks the testimony of Hillary Clinton about her use of personal email account(s) for official State Department business. Judicial Watch discovery plan also seeks the testimony of Cheryl Mills, Clinton former chief of staff; and Jake Sullivan, former senior advisor and deputy chief of staff, as well as other current and former State Department officials. Please SHARE!"},{"comment_id":"10154173006980950","commenter_b":"No intel has verified that! Please name names & not newspapers","commenter_a":"If Russia hacked the election to favour Trump, then how did Hillary win the popular vote?","post_message":"NEW: Despite Vladimir Putin denials, U.S. intelligence sources confirm hacks and cyber operation of this scale could not have occurred without his blessing, CBS News' Jeff Pegues reports. @webpagelink"},{"comment_id":"10153951391170579","commenter_b":"We have millions of people on welfare because Illegals are doing the jobs they are qualified for...we can use guest workers legally if we need more workers...I don't see us the US needing them though","commenter_a":"The republicans are certainly changing their tune on immigration. But they have no choice. Nobody in their right mind believes that we can deport all illegal immigrants without devastating our economy and millions of families. Even Trump admitted that they could come right back, a weak attempt to lessen the blow of his ridiculous plan. Yet another win for Bernie Sanders, who has no need to flip on issues to garner support.","post_message":"Your takeaway from the 4th Republican Presidential Debate?"},{"comment_id":"976269069167192","commenter_b":"Bite yo tongue, girl!!! Lol","commenter_a":"Yolanda- see? You can breathe now. Lol","post_message":"THIS JUST IN: California emergency officials say a period of elevated risk of a large earthquake on the San Andreas Fault is over."},{"comment_id":"1263029653753561","commenter_b":"This wasn't even a debate, it was #RealityTV. But yeah, Clinton couldn't have lost because #herOpponent has a #MentalDisability. Trump supporters are right, it's unfair to him to expect him to be competent. Donald show us your crooked tax returns #WordsMatter. Do you want the most powerful person on Earth to have the mouth, the character, the words of Donald Trump?? There is no argument for Trump. #ItsAVoteForHillaryAndHerAgenda #StrongerTogether #Progress #AFutureToBelieveIn #LoveTrumpsHate #LatinosArentRapists #WomenArentMissHouseKeeping #UnitedAgainstRacism #YesWeCan #DontBooVote #WhenYouGoDownWeGoHigh #LatinosArentPigs #ClimateChangeIsntAHoax #MissUniverse1996IsntMissPigy","commenter_a":"Its pretty simple boycott all these biased media outlets. Let their billionaires spend their money keeping it afloat. They don't help their own countrymen. But, sure want to take down America. Sorry, you are a idiot if you can't see this. Sad, but true Hillary is their puppet a long with Bush. The problem is the people are waking up. I can only say arm yourselves. These outlets and their mindless bots working for them are going to still put out the same trash everyday. You take down Law enforcement, then Military divide the people and conquer Keep being idiots.You will be telling of the America I love as \"Once upon a time\" You know those pastuers are always greener till your there. Don't you bots find it interesting Hillary is pulling a large number of Jewish vote and Muslim. WTH do you think she has promised each side to ...","post_message":"Trump's tax plan: 1. Huge tax cuts for billionaires and millionaires like him. 2. A tax hike for millions of middle-class families."}]
