[{"comment_id":"10152917193351813","commenter_b":"Women have options. Don't have sex if you can't afford the reprocussions.","commenter_a":"Why would you vote to decrease the options women have for health care? Makes no sense at all.","post_message":"BREAKING: Senate fails to defund Planned Parenthood. The road ahead is uncertain, but for today logic prevails. We’ll continue to stand alongside our partner and access to care for millions."},{"comment_id":"10153518895070326","commenter_b":"And who believes her??? This must be a \"Clinton Joke\".","commenter_a":"the old scritch she does know how to lie though,,and has lots of crooked schemes up her sleeve","post_message":""},{"comment_id":"577283422434663","commenter_b":"Sandra Skolnik THE HILLARY VOTER ARE ,MUSLUMS ,ILEGAL IMAGRANTS, PEOPLE LIVINg in other countrIES silly woman that dont follow other candadits SO HOW DO THEY REALLY KNOW WHAT IS GOING THE WOMAN NEEDS TO BE INCITED SOON","commenter_a":"I'm starting to #FeelTheBern! Bernie Sanders has been consistent with his message throughout his career from climate change to #LGBT rights. @username not only voted in favor of the Iraq war but she also played a large role destabalizing the Middle East in Libya and Syria as Secretary of State. I hope New York, California, Pennsylvania and the remaining states get out and vote for Bernie Sanders before the FBI indicts @username over her mishandling top secret information on her private server. We need honest leadership not warmongers who destroy entire nations with irresponsible policies. Vote for peace! #FeelTheBern #BernieSanders2016","post_message":"It's understandable that Americans are angry. But instead of inciting violence, we should talk about how we’re going to address the challenges we have."},{"comment_id":"10152881225108445","commenter_b":"eat a dick","commenter_a":"Take this shit down. 666 ain't got shit to do with weed.. God blessed us with weed","post_message":"Kosher Cannabis Edibles Coming to New York"},{"comment_id":"1770834126470122","commenter_b":"She can't fit those shoes","commenter_a":"Of course she's going to copy from one of the smartest, classiest 1st ladies we've ever had!","post_message":"Portions of Melania Trump's speech on Night 1 of the Republican National Convention bear striking similarities to Michelle Obama's speech at the 2008 Democratic National Convention."},{"comment_id":"1220522774636943","commenter_b":"Lock her up!","commenter_a":"NOTHING TRUMP SAYS CAN CHANGE OUR MINDS WE WILL NOT VOTE FOR TRUMP . TRUMP IS A BASKET CASE . TRUMP IS A CRIMINAL . TRUMP LIES , LIES ,LIES","post_message":"CAST YOUR VOTE: The third and final debate between Hillary Clinton and Donald Trump before Election 2016. Vote for who you believe is winning and see the results LIVE. Vote here: @webpagelink"},{"comment_id":"1755875524653363","commenter_b":"The real coruption and illegal a tivities existing in this administration are the issues, but you are to cowardly to address them. Payments have already been made for Hillary to continue to play her corrupt anti American game. It is easy for the Clinton crime family to justify their dark Anti American activity. The message to her foreign friends antagonistic to the United States, and those buying positions on our taxpayer payed government payroll; Hillary is still open for bribery. Trying to rationalize their evil destructive behavior is despicable. The present administration and Hillary, studied, we're mentored, and follow the agenda of the most corrupt genocidal ideologies on earth. National Socialism, Communism, and Islam. Combined these ideologies have murdered and plundered close to a billion human beings. So why would any sane person with good intentions follow any of these ideologies? They would not, but the Clinton's do. The death, ...","commenter_a":"I've heard a lot of people say they used to like Beck but now they think he is completely bonkers.!","post_message":"Glenn Beck harshly criticized Breitbart executive Stephen Bannon, who is now the CEO of the Donald Trump campaign, saying that Andrew Breitbart himself is “spinning in his grave.”"}]
