[{"comment_id":"1246596595370794","commenter_b":"I commend you for being relentless and honorable. It is a very hard row you hoe in the cesspool in Washington D.C. I hope you have hazmat insurance. With deep respect, SFL","commenter_a":"Hon Gowdy, you have the support of the American people, Why, please tell, has the Congress of the United State, officials that we, the American people elected to represent us th the American peo have not brought charges against the current Administration, contempt, treason, murder, deriliction of duty, incompentence, assisting the enemies of the United States, Why Senator? Why? Why are you with the help of the rest of Washington letting us down?","post_message":"It’s taken way too long and way too much of our energy in simply gaining access to #Benghazi documents and witnesses. There continues to be time wasted negotiating with executive branch entities who do not want to give us what I believe Congress is entitled to."},{"comment_id":"10153257437420950","commenter_b":"Just hang the filthy basterds","commenter_a":"But then again they are innocent unarmed harmless individuals with bright futures ahead and their victim is the evil one","post_message":"Two 20-year-old men allegedly stole a cellphone from a man with cerebral palsy, beat him, recorded the assault on his phone and posted it to his Facebook page, police said."},{"comment_id":"997010993718412","commenter_b":"Islamic Terrorist, go home, stop trying to change the U.S.A.","commenter_a":"No true American is safe as long as Islam is allowed to exist in our nation! We true Americans must unite against this plague and the liberals who allow them to destroy our lives and wipe them from our nation so we can ensure the safety and security of our nation and the American people!","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack. He is a hero, and will always be remembered as so. Can we get 150,000 'LIKES' for this brave boy?"},{"comment_id":"10153963839661782","commenter_b":"Why is it ok for the woman to hit him ?","commenter_a":"Not ok you POS","post_message":"BREAKING: A video that shows Oklahoma running back Joe Mixon punching a woman two years ago has been released. We want to stress that this video might be disturbing. We are showing it to you in an effort to be transparent. Click on the link to watch the video now: @webpagelink"},{"comment_id":"696428793854373","commenter_b":"Because his mother does what every south african women does ! Drink and try to get pregnant so they can qualify for more government grants so they can get more money for doing nothing and then they will leave a child at the grandparents for the full monty payout !","commenter_a":"At the end of the day. Why the hell why was a 3 month old its own.","post_message":"This is horrifying!"},{"comment_id":"10152942027790399","commenter_b":"There is a word for women like her, but that would be an insult to hard working girls.","commenter_a":"That certainly says everything about her credibility, or lack thereof. :( AKA (I'll say anything for a buck)","post_message":"Megyn Kelly on msnbc: \"I’d have done O.K. there, too.”"},{"comment_id":"10154318363317232","commenter_b":"Why aren't they being plowed through? Run these scumbuckets down!","commenter_a":"Sent in the robot","post_message":""}]
