[{"comment_id":"10150676513679999","commenter_b":"You're right @username, when I bought my Yankees jersey, I bought the Rivera one. Best closer ever.","commenter_a":"Nothing like the Yankees of my childhood. Subway series, tino Martinez, Alfonso Soriano, David justice, pettitte, Bernie Williams, posada and jeter. It won't ever be the same.","post_message":"The New York Yankees are knocked out of the playoffs after losing, 3-0, to the Houston Astros in a wild-card game."},{"comment_id":"968868466550965","commenter_b":"Let's leave tomorrow!","commenter_a":"How do we get his life @username","post_message":"Can we apply?"},{"comment_id":"219022051835576","commenter_b":"Legal Immigration isn't a Problem! Melania Trump is a legal Immigrant!","commenter_a":"YES","post_message":"Senator Tom Cotton just introduced Trump's immigration proposal through the Senate! Sign the petition SUPPORTING the bill HERE: @webpagelink"},{"comment_id":"10154187252849657","commenter_b":"You are a very, very, very silly little women with no wisdom at all, and I doubt you ever had any. You are to old to think the way you do with lousy liberal logic.","commenter_a":"What I do understand is this, man is supposed to be smarter now than then, but yet the present man cannot product a document like the constitution. Isn't it sad that they are trying to destroy it because man cannot write a constitution now. The reason they can't is because they are not GOD fearing, like the founding fathers were.","post_message":""},{"comment_id":"10152826258466051","commenter_b":"I hope the bitch gets life","commenter_a":"Got what you deserve","post_message":"First she stole this cancer-stricken man’s dog. Then she had him euthanized."},{"comment_id":"10153763759623812","commenter_b":"Girl, shut up.","commenter_a":"Relax dad, she's not a teen, stupid and sad comment - life is about friends, why confuse a happy loving kid, who loves boys too as friends...","post_message":"This 2-year-old girl is crushed to hear that she can’t have a boyfriend, insists to her dad that she has someone special in her life. Her conviction is intense! @webpagelink"},{"comment_id":"1082992428420186","commenter_b":"She will never be in jail","commenter_a":"How can she send people to jail from her prison cell?","post_message":"Dangerous person!"}]
