[{"comment_id":"10155469339470093","commenter_b":"NOOOOOOOOOOO!!! PLEASE no!!!!! Idiot progressives!!!","commenter_a":"Why would this NOT piss off everyone in NY who are legal tax paying American citizens??","post_message":"The impossible may soon become possible."},{"comment_id":"10153124356001336","commenter_b":"IDIOTS PUT IDIOTS IN OUR WHITEHOUSE!!!","commenter_a":"It is not up to obama it is supposed to be congress and senate this is illegal","post_message":"\"Please just give this soldier the dignity of life! We give it to these guys down in Gitmo!\" Montel Williams questioned how Amir Hekmati, a Marine held in Iran's worst prison, is still in captivity while the Obama administration makes a deal with Iran. #FreeAmirNow"},{"comment_id":"1231385010209866","commenter_b":"Hahahahaha en fisica te salve de tu proyecto :v","commenter_a":"@username pa que se te de mejor química xD","post_message":"This is how they should teach chemistry in school. Video by Marie Skłodowska-Curie Actions."},{"comment_id":"1061821787247406","commenter_b":"fact, king obama ignored our federal immigration laws and gave amnesty to millions of illegal aliens including the illegal that killed Kate steinle. had he enforced our laws and put a stop to san Franciscos sanctuary city policies that woman would be ALIVE today. fact, obama blamed cops before the facts came in about doin their jobs. cops were killed after his comments. had king obama stood up for cops and denounced black violence those cops would be ALIVE! wake up Cynthia. who's to blame for this mess? every MORON that voted twice for king obama. 😡","commenter_a":"so when king obama blames police for doin their jobs and cops get killed it's not king Obama's fault? when king obama allowed illegal aliens to invade our communities and then kill innocent Americans like kate steinle it's not king Obama's fault? you leftest are MORONS and HYPOCRITES. 😄","post_message":"\"People have to understand that hateful rhetoric and words and harassment of doctors and harassment of women going to health centers have real implications.\" -Planned Parenthood President Cecile Richards"},{"comment_id":"460743430758281","commenter_b":"No! That's why you have insurance! If you don't want a kid and the responsibilities that go with it, don't have unprotected sex. Better yet, keep your legs together and your pecker in your pants!","commenter_a":"NO NO NO!!!!","post_message":"\"Whatever happens, this likely won’t be the last we hear from Notre Dame, or the Supreme Court, on the accommodation.\""},{"comment_id":"517177675137728","commenter_b":"here we go lone rider, is he picking up speed","commenter_a":"Looks like he is near Morongo Casino soon.","post_message":"Police pursued a stolen big rig near Riverside, California this afternoon."},{"comment_id":"10154506752502619","commenter_b":"Call Sarah please let me leave you with this I am Hebrew my tribe is Nazarene but I am not Jewish a lot of people and I know that you're not one of them get that mixed up quite a bit for it is possible to be Hebrew and not to be Jewish","commenter_a":"There were no unions until the 19th century when a bunch of Jewish garment workers in NYC publicly protested and marched through the streets for safe,decent places to work and a living wage. How dare this bunch of ignorant,uneducated pigs discuss human rights. They couldn't find Israel on a map if their lives depended on it. Their hatred is based on jealousy of the achievements of Israel and the will to survive in a world where hatred of Jews is very fashionable.","post_message":"Citing the Jewish state's \"long history of violating the human rights of the Palestinians,\" the United Electrical, Radio and Machine Workers of America have reportedly become the first nationwide union to join the boycott against Israel."}]
