[{"comment_id":"10154038920644091","commenter_b":"Ladies! Do your thang...","commenter_a":"he can save me any day. 😍","post_message":"One thankful New Yorker expressed his gratitude to the NYPD and New York City Fire Department (FDNY) with free coffee and treats."},{"comment_id":"10154683791611002","commenter_b":"Gross. She needs to be locked up and throw away the key","commenter_a":"Lock her up and throw away the key.","post_message":"A 38-year-old Dearborn Heights woman is accused of attempting to arrange a meeting for sex with whom she thought was a man and his underage daughter."},{"comment_id":"1795597093801212","commenter_b":"But Hillary won the popular vote..at least you won something","commenter_a":"Hopefully they get deported","post_message":"BREAKING: A massive protest of President-Elect Donald Trump is happening in downtown Chicago. It started outside the Trump Tower and is growing @webpagelink"},{"comment_id":"10153322962454170","commenter_b":"I was born in 1950, so I was privileged to know the Greatest Generation. I don't think there will ever be a better generation. Our culture is too self absorbed, lazy, and uncompromising to produce anything better.","commenter_a":"I agree with Stephanie.","post_message":"Wow. Amazing people. I never get tired of seeing stories about the greatest generation."},{"comment_id":"10154362784109062","commenter_b":"❤️","commenter_a":"Praying for the family...","post_message":"A heartbreaking loss for a family after a 14-year-old boy collapsed and died after school in Cleveland, Texas. Hear from the mother about how the teen is being remembered on KHOU 11 News at 6."},{"comment_id":"477887179066242","commenter_b":"That is so sick why would anyone want abort a unborn baby must one that already born i'll tell you who a sick mf that's who","commenter_a":"They have abortions like it's nothing, no big deal. I used to work with a woman that loudly explained to 2 co-workers how her Dr gave her some pills. She took the pills over a weekend and when she went to the bathroom the fetus fell out. I couldn't believe what I was hearing and was stunned. Made life seem cheap.","post_message":"This is INSANE...STOP THEM NOW! PLEASE SHARE TO EXPOSE THEM!"},{"comment_id":"444002905787317","commenter_b":"I wish someone would shoot that muslim nigger","commenter_a":"Unfortunately, the mass shootings will continue in the USA as long as the NRA continues to have such a strong influence, through its lobby, with the Republican Party in control of Congress. So many simple steps could be taken...background checks for instance or the banning of multiple-firing weapons ( one doesn't need a machine gun to kill Bambi! ) but the Republicans in Congress blocked even the discussion of background checks the last time it was brought up. With such intransigence in not even allowing discussion of the issue, I am afraid that no gun control law will be passed. President Obama is right to be furious as I am. As an American, I feel distressed, angry and frustrated but also, sadly, resigned. It is simply a matter of time until the next mass shooting. PS: Fewer than half of all Americans actually own a gun but those who do ...","post_message":"President Barack Obama is furious. Watch as he addresses the nation after another mass shooting. At least 10 were killed and 7 injured in a shooting at a community college in southwestern Oregon."}]
