[{"comment_id":"10154490537796509","commenter_b":"Hillary will not even go on FoxNews because she is afraid of the questions. Trump is on every liberal channel.","commenter_a":"Very good luck for Hillary clinton...MY she beat all her contestants...especially Donald Trump...","post_message":"Donald J. Trump's campaign attributed the decision to pre-existing campaign engagements, but it's likely to reignite discussion about the longstanding feud with Fox News and with Megyn Kelly."},{"comment_id":"410085892484700","commenter_b":"Yes, look at Seattle. They're thriving. Lol WTF. Way to make a point against yourself. The two highest min wage cities are Seattle and San Francisco and they're also the top two fastest growing metropolitan areas in the country right now.","commenter_a":"If you think shit is expensive now, just wait when the minimum wage is 10 bucks an hour...Walmart is in favor of this because people will only be able to afford to shop at Walmart instead of the locally owned businesses","post_message":"Walmart's announcement that it will raise its minimum wage to $10 an hour was claimed as a victory by both advocates and opponents of raising the federal minimum wage."},{"comment_id":"1230909136991106","commenter_b":"👌 well done my counterpart.","commenter_a":"Ill leave this here.","post_message":"Sad, but true..."},{"comment_id":"10155779429195389","commenter_b":"Yep all she would be is loose end","commenter_a":"She is a real winner, did she think she was gonna hook up with these guys? All she would be is a witness, I cannot fathom how stupid some people are!","post_message":"BREAKING NEWS: New York state prison employee Joyce Mitchell has been arrested on felony charges for providing material assistance to prison escapees, state police say. @webpagelink"},{"comment_id":"1544982162188475","commenter_b":"That's why I have your wife come over","commenter_a":"Yeah it changes kids it doesn't make them limp wristed liberals who don't know which gender they are . It makes them tuff , learn how to solve problems with others and gives them confidence!","post_message":"The more head blows a child sustained, the more changes were seen in their brain tissue, according to the study released Monday."},{"comment_id":"1004051086318087","commenter_b":"Hillary is a BIG LIAR","commenter_a":"HILLARY CLINTON 2016!ALL THE WAY TO THE OVAL OFFICE!!","post_message":"With just 100 days until the Iowa caucuses, James, a Hillary for Iowa organizer, is taking over @HillaryClinton on Twitter. Follow along to hear why he’s working hard to elect Hillary: @webpagelink"},{"comment_id":"10150959655894999","commenter_b":"f you want a president that - Is a dictator above the law criminal who controls the brainwashing media and FBI Starts a war with Russia, China, Syria because they're not part of NEW WORLD ORDER - Can't be trusted to protect the security of our nations borders, classified information, or lives of our ambassadors and spies - Opens door to Jihad Terrorism and rape culture while our veterans sleep in the streets - Take away your right to protect yourself with a gun from her Isis soldiers she and HUSSIEN created and brought in. - Sells your country to your enemies and gives your enemies nukes - Raise taxes and enslave us while paying our enemies billions - Steals from her charity - \"Loses\" 6 billion of your hard earned taxes money - Defends rapists and bullies the victims - Brainwashes her followers to attack \"deplorables\" and starts fights ...","commenter_a":"I hope you guys will vote for Jill...","post_message":"Our photographers are sharing Election Day scenes from Manhattan, Miami and polling sites across the country. Follow along here: instagram.com/nytimes"}]
