[{"comment_id":"1011118955590810","commenter_b":"This woman has to go, she is crazy :(","commenter_a":"Yes, it's about the continued spread of the lefts fourth Reich! Whose ultimate leader, Satan, must be proud! Hillary, Bernie, Obama and his flunkies all cut from the same deprived mindset!","post_message":"PAY ATTENTION “This action is about a great deal more than just bathrooms,” Loretta Lynch declared."},{"comment_id":"10153401968107411","commenter_b":"GOOD..,TIRED OF SMELLING DOG POOP ON A HOT SUMMER DAY we have filthy nasty neighbors with too many dogs...they don't clean the poop and it FEEDS RATS PEOPLE...","commenter_a":"Esoj Ornelas","post_message":"Mayor Emanuel and several Chicago aldermen are proposing a new ordinance that calls on property owners to clean their lots daily to keep them free of feces -- or face fines up to $500."},{"comment_id":"1703000273311505","commenter_b":"If they want want to demand, tell them to go home!","commenter_a":"First of all, you can buy any kind of food you choose on food stamps ( I work in a grocery store, if you could see what people buy with food stamps ) , secondly you can't DEMAND anything. If you have demands, demand it from your own country.","post_message":"Muslims On Welfare Benefits Make RIDICULOUS Demand About Food Stamps If you want special treatment, then go get a job. Do you agree beggars can't be choosers?"},{"comment_id":"1383240758404704","commenter_b":"Yes they are and the ones that are stirring the pot should should lick the spoon amen","commenter_a":"So let me get this straight.... talking about pussy a decade ago makes you a sexist and bad person; however, talking about and encouraging the killing of cops is justified??? Did I miss something? All these people are a bunch of hypocrites! Saying they want peace and justice when they are the ones continuously stirring the pot and causing an even bigger racial divide!","post_message":"It's people like Sharpton that continue Obama's racial divide in this country. This is absolutely disgusting! Let's expose Sharpton for the race baiting fraud he truly is by sharing this post 2,000 times."},{"comment_id":"1037527509601593","commenter_b":"Well America will allow idiots to have guns","commenter_a":"What a dingbat","post_message":"The first wolf spotted in the Grand Canyon for 70 years has been confirmed to have been shot dead."},{"comment_id":"10154044362479024","commenter_b":"Let's cleanse American by not letting his sorry ass back into the USA","commenter_a":"tell Will Smith that we were here frist , and to fuck off","post_message":"With video. Bad things usually happen when leftists start talking about \"cleansing...\""},{"comment_id":"1475217105828968","commenter_b":"You do not know what you are talking about! If woman cannot afford birth control then there will be a definate increase in unwanted pregnancy and ultimately more abortions than ever. Its a simple enough eqausion, NO PLANNED PARENTHOOD=NO AFFORDABLE BIRTH CONTROL=MORE ABORTIONS!","commenter_a":"Will never agree stay quite,agree or be agreeable to finance or support an organization that capitalizes on the murder of innocent children. And an organization that preys on the vulnerability of women in a bad situation, that is not women's rights but profit of murderers. It needs to be called what it is. Their profits and funding comes via. death and guilt not education.","post_message":""}]
