[{"comment_id":"10154969618344726","commenter_b":"muslim migrants.","commenter_a":"And people wonder why nationalistic skinheads are on the rise in that country.","post_message":"One poll finds German women no longer feel safe."},{"comment_id":"10156637699435354","commenter_b":"Political whore?","commenter_a":"If the polls leaned toward Bhudism, Hillary would relate to Buddhists.She tries to relate herself to whichever way the liberal winds blow. If one doesn't agree they are homophobic, racist or worse...a conservative.","post_message":"Haters gonna hate..."},{"comment_id":"10153574901357217","commenter_b":"Pete Bayliss Yes i no , the Muslims from the Middle east are taking over the World. we have more trouble with the Muslims from the Middle east then any other race of people here in Australia they are born hatters and want to kill us the free World , they give all the good Muslim people a bad name","commenter_a":"This is very sad but its WAR , and all kind of people get killed in WARS. we the World needs to get rid of ISIS no matter what it takes and innocent people are going to die while doing this . i hate Putin but he is the only one doing the best Jb in getting rid of ISIS.","post_message":"\"There will be no more doctors in Syria.\""},{"comment_id":"1015321351850138","commenter_b":"Obama has been working on changes to second amendment....all we need is more of the same...no way!!!","commenter_a":"Get over it....Hillary wants to take away oil field jobs and our guns too...no way she'll get my vote!","post_message":"\"I say that I will beat her easier than beating some of the people that I've just won [against.]\" Donald J. Trump hit at Hillary Clinton's record and explained why he believes women will vote for him. @webpagelink"},{"comment_id":"1639973446062778","commenter_b":"Fucking bitch...outsmarted herself and all her dumb ass supporters!","commenter_a":"I thought it was us racist white people truth is you did not deserve to be our president because we don't trust you your record suck your forein policy was terrible and caused so much death your husband disgust me and you lied about your server when you bleached bit your emails to hide your crimes blew it for you but what you did to our heros in Benghazi was the worst then to cheat in debates with Donna showed us your still the sneak we all know you are. Go away already your done","post_message":""},{"comment_id":"600652730065515","commenter_b":"Christians are doing it now to homosexuals, in Uganda","commenter_a":"They are savages. Anyone who can cut off a person's head is cold blooded.","post_message":"Attention Liberals: The Koran is a Satanic Manifesto & Christianity is not as bad as Islam!"},{"comment_id":"10153657767106051","commenter_b":"OMG... A bunch of women who can't stfu!","commenter_a":"This isn't a political website Lorretta so move on.","post_message":"Olivia Newton-John's ex vanished on a fishing trip 10 years ago. Now, more than a decade later, we finally know what happened to him."}]
