[{"comment_id":"10153930605634614","commenter_b":"Women.., please don't fight strangers...,they're not your husbands..,to be arguing all day...","commenter_a":"Only 13 years for her life. Really for someone killing a mother directly in front of her children what really he should of got life for each child plus mom no way appalled.","post_message":"Elizabeth Yanez was stabbed to death in front of her two children in a dispute over a parking space at the Santa Fe Springs swap meet. Her convicted killer, 23-year-old Reggie Cervantes, was sentenced to 13 years in state prison Tuesday for the 2014 attack. doesn make sense to me, nothing makes sense, the woman daughter said after witnessing the brutal attack. a parking space. How am I supposed to go on with my life? Read KTLA's story here: @webpagelink"},{"comment_id":"10154105407999166","commenter_b":"We are getting sick of black crap. Whites will start an uprising. Just wait","commenter_a":"If it was any other student you would be in an uproar...relax! He was wrong and you know it. We don't need this in schools. If they don't protect the safety of students, can you imagine what they would be up against. You don't wait til something happens then act. Let's think like adults here. This is 2016 not the 50s.","post_message":"JUST IN: Police say they have charged this Clemson student after he admitted to posting comments on a popular social media app, comments like \"let's do the Clemson protesters what Ohio did to the Kent State student protesters 40 years ago.\" He said he did it to \"make people mad\"."},{"comment_id":"466299333581093","commenter_b":"You sound like a true liberal","commenter_a":"Philip Sjostrom","post_message":""},{"comment_id":"1353337611353126","commenter_b":"What needs to happen if Trump wants to make America great again is give it back to the original owners. I think it's funny when Trump supporters say their not racist and some aren't, yet you must know that so many are. That's why there's a popular Trump chant \"Make America white again\" which is ignorant because it never was!!! You killed off the main population of natives then brought the Africans here to work your farms without as much as a thank you. If true justice and freedom or anything great were to happen in that case we would pack all you European folk up and send ya shipping. You bitch about minorities yet your ancestors brought our ancestors here, to a land stolen from anothers ancestors. You are the problem and the contradiction, you should leave. But really all we want is to live peacefully with everyone now ...","commenter_a":"Went from racist, Muslim, and a wife who was one of the uncouth \"first lady\" ever.","post_message":"America DOES NOT stand with Trump. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1085502584794544","commenter_b":"Good thing the fetuses don't care","commenter_a":"butchering humans is not health care","post_message":"Americans want funding for women's health."},{"comment_id":"879492268908016","commenter_b":"I wouldn't vote for the loud mouth scumbag for trash collector. She is the most unlady like female ever. All she does is run her big (I mean BIG) mouth. She just needs to go away with her non American husband and disappear.","commenter_a":"Donald","post_message":"There's a huge movement supporting Michelle making a run at POTUS in 2020. Who would you vote for, Donald Trump or Michelle Obama?"},{"comment_id":"10153052484116491","commenter_b":"GTFO illegals","commenter_a":"And he shouldn't! Go TRUMP! Out with those freeloading illegals!","post_message":"Even after losing a slew of business partners, including Macy's, NASCAR and NBC."}]
