[{"comment_id":"10153258824720329","commenter_b":"You know me too well","commenter_a":"Renda Rachel Sabrina","post_message":"WIN"},{"comment_id":"1008748529146158","commenter_b":"And you are a pussy","commenter_a":"Your not a hunter if your using a gun, your a murderer.","post_message":":("},{"comment_id":"10154770811534411","commenter_b":"come on now David, gotta bring the muslims into it. Bet your a fucking Tory, or one of those ukip nazis. Away and take your face for a shite","commenter_a":"@username being one of media that show Russia is not a problem in Syria after its jets bombs and kill thousands of women and children,Killing by bombing is still an act of terrorism and should not be favoured,just fool those who see one side of the coin and they dont want the truth to prevail","post_message":"'There is a hysteria which is being organised by politicians and the media against Russia to see Russia as the only problem in Syria'"},{"comment_id":"10153270797394342","commenter_b":".","commenter_a":"Climate change. The earth is warmer than it has ever been, which means bacteria, viruses, diseases, all have the perfect breeding ground to multiply in larger numbers than we have ever seen before.","post_message":"LEGIONNAIRES' DISEASE LATEST: As New York City grapples with its worst-ever outbreak of Legionnaires' disease, health experts are trying to understand why reported cases of the illness have risen across the country in recent years."},{"comment_id":"10153175852531990","commenter_b":"That ain't no woman either !","commenter_a":"400 lbs with a beard.....that ain't no woman!","post_message":"BEARDED WOMAN: So this happened. @webpagelink"},{"comment_id":"517019608487085","commenter_b":"Hell no, they can NOT stay! They are all guilty of a criminal offence. They are here ILLEGALLY, you dumb...","commenter_a":"The only path they should get is the road to the border where they would be deported.","post_message":"\"For the 11 and a half million who are here illegally, if they've not committed a crime since they've been here, I would give them a path to legalization.\" Today on \"Fox News Sunday,\" John Kasich discussed immigration."},{"comment_id":"678568942333684","commenter_b":"Muslims do like goats.","commenter_a":"Surely the king has more class than to let Hillary sit on his face !","post_message":"Hillary Clinton was just caught doing absolutely sickening with the Saudi King. She is not to be trusted. This is filthy. Do you think Hillary Clinton would make a terrible president?"}]
