[{"comment_id":"1221649794521715","commenter_b":"Thats not how a hoe talks to a pimp literally in this case","commenter_a":"He's just trying to cover his own butt.....","post_message":"The owner of the Nevada brothel where Lamar Odom was found unconscious says Khloe Kardashian's publicist has asked him to stop speaking to the media — a request that made him furious."},{"comment_id":"10153946118774071","commenter_b":"He is a #WhinyLittleBitch","commenter_a":"If he is not blaming it on the Mexicans, the women, the Muslims, the Democrats, the media or the moderator, it's the microphone. My God what a crybaby. I think Donald need a diaper change 😂","post_message":"Clinton slams Trump's debate performance: 'Anyone who complains about the microphone is not having a good night.'"},{"comment_id":"1615187908768322","commenter_b":"She is big piece of shit","commenter_a":"Oprah will have to answer to God , I believe Judas turned his back on Jesus . Oprah will have her day","post_message":"WHOA! Take her off TV."},{"comment_id":"10153221473348812","commenter_b":"What British chick?","commenter_a":"Better a bigger body than a nasty attitude. Maybe someone can help that British chick with THAT.","post_message":"Kelly Clarkson fires back at fat shaming comments: @webpagelink"},{"comment_id":"10155114674037558","commenter_b":"One sick BITCH!","commenter_a":"Let me make this clear! We paid taxes to support our children completely in our schools. We did not pay taxes to make you richer, honey... Getting a fat paycheck to make inappropriate jokes about hungry children is not funny to the best of humanity - Just to you! Ms. Rich Monster - (Your Word)","post_message":"You put these Republicans all in one room and they say some evil things."},{"comment_id":"10154156171661509","commenter_b":"Who ever used the word 'liberal'? Labels are so 90s. I support Bernie because of his integrity, his consistency and his sincerity. I see none of those qualities in Hillary. I see the opposite in Hillary. I support Bernie because of his policies. Hillary uses too many weasel words when she talks about policy. She likes to leave the door open because she plans to make a hard right as soon as she's elected. She owes too many favors to the banks, corporations and wealthy investors who back her. They need a return on their investment and good ol' Hillary will no doubt deliver the goods.","commenter_a":"The media is dying to have Bush v. Clinton 2.0 so badly but I've never met anyone in person who thinks either of them would make a good president. It's a media manufactured dream match. Both of them would be bad for America but good for ratings. as long As I live I never want to hear the name Bush again and Clinton's got way too much baggage. Policy-wise Hillary is just a kinder face to the same neocon agenda that Bush would be peddling. Sanders is our best hope. Let's stop moving Backwards, let's move forward!","post_message":"Jeb Bush says Hillary Clinton is a \"smart person\" but is \"beatable.\" @webpagelink"},{"comment_id":"10155209654718974","commenter_b":"Donald J. Trump 3 mins Statement Regarding Recent Executive Order Concerning Extreme Vetting is a proud nation of immigrants and we will continue to show compassion to those fleeing oppression, but we will do so while protecting our own citizens and border. America has always been the land of the free and home of the brave. We will keep it free and keep it safe, as the media knows, but refuses to say. My policy is similar to what President Obama did in 2011 when he banned visas for refugees from Iraq for six months. The seven countries named in the Executive Order are the same countries previously identified by the Obama administration as sources of terror. To be clear, this is not a Muslim ban, as the media is falsely reporting. This is not about religion - this is about terror and keeping our country safe. There are over ...","commenter_a":"Stay strong","post_message":"We're at Portland International Airport for the second day of the #nobanpdx protest against Donald Trump's executive order on immigration."}]
