[{"comment_id":"10153715327517894","commenter_b":"These hoes kill me acting like they the only one with a fucking opinion and that their opinion is the only one that's right bitch you got me fucked up Alex Carey and when I see some breast then I'll refer to transgender!","commenter_a":"I love @username, but I don't expect anything objective about Mariah Carey to come out here because @username and Mariah are besties. I'm sure there's more to the story than this.","post_message":"Nick Cannon Is Refusing to Sign Off on Mariah Carey Divorce Papers"},{"comment_id":"496205537248565","commenter_b":"@username OK crazy lady, you might need some medication","commenter_a":"I'm a full supporter of Bernie but I'm guessing he is done?? If so I'll have to support Clinton. One I support Democrats. Two. Trump is a disgusting fraud who makes us look horrible. So if it comes down to Clinton and trump VOTE CLINTON!!!","post_message":"Thank you, Ohio."},{"comment_id":"10153636348708132","commenter_b":"Eww she ugly","commenter_a":"I love her comedy routines and I think she is beautiful. I like to hold hips not bones.","post_message":"The endlessly quotable Amy Schumer!"},{"comment_id":"10154679365898797","commenter_b":"Let him alone","commenter_a":"Let him go! He did what any man would do for his wife! If that happened to me I'd have shot him! Either way the man would have died! Let him go!","post_message":"HUSBAND PROTECTS WIFE: A man has been arrested after beating and killing another man who had broken into his home and sexually assaulted his wife."},{"comment_id":"10154618294282577","commenter_b":"hey bitch","commenter_a":"Fu","post_message":"First Lady Michelle Obama hit out at Republican nominee Donald Trump dismissing several of his comments at the recent presidential debate."},{"comment_id":"10156264408410725","commenter_b":"The smart Americans will vote for Trump and Cruz. And that includes the \"legal\" Hispanics here. Trump wants to deport the millions of \"illegal\" immigrants..the ones who sneak in undocumented, or overstay their visas, or get deported and sneak back in...THE ONES THAT KEEP KILLING INNOCENT AMERICANS and drain our system! Get them the hell out.","commenter_a":"Go Trump!!! Hispanics for Trump 2016","post_message":"Join me Tuesday, November 3rd at 12PM in Trump Tower New York. I'll be signing copies of my new book CRIPPLED AMERICA. Don't miss it!"},{"comment_id":"10153205127216336","commenter_b":"They should be arrested, if any are on welfare they should lose their benifits..!!","commenter_a":"So they riot and loot because they don't have jobs and are poor?","post_message":"\"Because of my faith in God and people in the church that never gave up on me, I was able to pursue my own calling and purpose and destiny.\" Pastor Donte Hickman of Southern Baptist Church (Baltimore) told Gretchen Carlson that the youth in his community are not a lost cause."}]
