[{"comment_id":"575908422533751","commenter_b":"Kepp telling it girl !","commenter_a":"How true.","post_message":"Meghan McCain says that when Trump makes mistakes with his words \"it offends people sometimes and it can be controversial, but when Hillary makes mistakes, people die. Agree or disagree?"},{"comment_id":"930011010437419","commenter_b":"Lady u need help fuck grump","commenter_a":"\"Semame?\" Really, is spell checking really that difficult? I'm only pointing this out because it's a constant with your memes and videos. As funny as they are and as much as I enjoy them, please, for the love of God, use spell check. You look like buffoons when you misspell such easy words.","post_message":"WATCH: 10 years ago, Sesame Street called out trashy Donald Grump. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1719470721658124","commenter_b":"There illegals Zachary King..... there scared to death.....","commenter_a":"#Trump2016 TRUMP TRAIN","post_message":"Donald J. Trump has revealed how he would make Mexico pay for the wall. @webpagelink"},{"comment_id":"1062665507148980","commenter_b":"Scum","commenter_a":"They are a terrorist group and should all be locked up.","post_message":"Black Lives Matter Takes to Twitter to Celebrate the Slaughter of Baton Rouge Police. Here are Their Sick and Disturbing Tweets..."},{"comment_id":"10155169202635231","commenter_b":"You're rare Theresa -- women don't think this way.","commenter_a":"Wow, he couldn't just get married to a good woman???? He could've gotten it for the rest of his life...but that's how crazy some men are. Go figure!!!","post_message":"Warren Sapp paid some $600 for oral sex, which he allegedly taped using his cellphone camera."},{"comment_id":"1309366539106612","commenter_b":"You should be removed from this country","commenter_a":"Shariah law is NOT a law in this Christian country !!!!","post_message":"WELCOME TO THE NEW AMERICA!"},{"comment_id":"10152880338496636","commenter_b":"Says the white woman...","commenter_a":"Personally I think if the tribes want it built, the tribes should pay for it. It doesn't bother me one bit sitting unfinished and there are so many other things the state could spend the money on. How about paying our teachers a decent wage.","post_message":"You probably driven by this empty building. It had thousands of dollars poured into it, but it still sits as an empty shell. Thanks to a bill Gov. Mary Fallin signed, that may be changing soon."}]
