[{"comment_id":"1001556806534263","commenter_b":"A vagina is a sex organ. A boob is not. Stop comparing them.","commenter_a":"Society uses breast on ad to sell cars, burgers and every shits they want but when it comes to the natural uses, which is feeding a baby assholes loses their minds ? Should think twice before saying women who breastfeed don't have respect for themselves. What did our mothers/grandmothers did before powdered milk ?","post_message":"Women are brilliantly standing up to breast-feed shaming. Read a powerful example right here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"1718149915138787","commenter_b":"Why don't they remove these 3 evil women?","commenter_a":"I wouldn't waste 1 minute watching this group! They all look like they are wearing Halloween masks!","post_message":"Come... ON... Joy Behar needs to be banned from TV!"},{"comment_id":"10153351260137439","commenter_b":"Go home to your rodent pit ugly woman","commenter_a":"Why did they come to the USA? To bring death? Shame yourself Mother of Satan.","post_message":"@webpagelink"},{"comment_id":"769219589888459","commenter_b":"i have been there over and over the last time a mexican woman tried to give my mother her baby beged my mother to take the child this is a fact and sad but if mexico is so great then way are so many comming to America","commenter_a":"Who would want to move to Mexico? In dire stress, a person could find better options than that Anti American, drug cartel controlled country. Funny how they are so anti American, but so many scramble to get here huh? The citizens of Mexico don't even want to live there, and I can't say I blame them.","post_message":"Americas Freedom Fighters"},{"comment_id":"10155157527128132","commenter_b":"Two scary women1","commenter_a":"That is one scary woman.","post_message":"Like always, Janice Dickinson is not holding back."},{"comment_id":"10153414242381130","commenter_b":"And another. Oh those terrible feminists. @webpagelink","commenter_a":"Considering the male comments on this article, women aren't your equals. Thankfully.","post_message":"Ability? Absolutely. Opportunity? Nope."},{"comment_id":"10153481286598984","commenter_b":"Let's get this evil son of ? Out of office","commenter_a":"Wake up America Obama has an agenda and he is working it!","post_message":"This DHS agent just admitted the truth about Obama's disturbing agenda... so Obama sent his officials to do something terrible to her DAUGHTER. What do you think?"}]
