[{"comment_id":"10153529907489087","commenter_b":"Anybody is more trustworthy than Hillary","commenter_a":"Bernie is the only one to stand up to corruption, and is honest. Hillary changes her opinion like the wind to appeal to voters, she is bought and sold. Nothing she says is genuine.","post_message":"Bernie Sanders is still seen as the more trustworthy candidate, according to a new poll, with an overwhelming 75 percent of respondents agreeing he is “honest and trustworthy.”"},{"comment_id":"1397496900343360","commenter_b":"\"I support the racist abortion of millions of black and latino children\", that all I see when I see anyone saying the support Planned Parenthood. Sounds like something close to what Hitler did... eugenics, anyone? Margret Sanger? Big fan of Hitler? Come on, it can't be a coincidence that blacks are encouraged by white PP employees to abort their babies, right? #StopRacistPP #ShutItDown #UGetMoreBensWitKids","commenter_a":"Or took their VIAGRA away. Bet we'd get some action then.","post_message":""},{"comment_id":"10154051866134087","commenter_b":"His bitch better get ready to be deported and come here the right way","commenter_a":"fuck you ass","post_message":"Trump says maybe his deportation task force will be able to deport Clinton. READ MORE: @webpagelink"},{"comment_id":"596524653885918","commenter_b":"Hell no she's a racist and a bigot . Her husband did our country more harm than good. No way would I ever vote her into office.","commenter_a":"no way in Hell","post_message":"Would you vote for Michelle Obama if she ran for president one day?"},{"comment_id":"10153205140467426","commenter_b":"Lady shut the hell up negative nancy","commenter_a":"Please get some bike helmets for these young riders and teach them to wear it.","post_message":"Inspired by #Richmond2015? Happy riding kids!"},{"comment_id":"818563178203701","commenter_b":"For what? Please elaborate...","commenter_a":"Impeachment now","post_message":"Before we voted to defund President Obama's unconstitutional actions on immigration, Speaker Boehner read 22 direct quotes where President Obama argued, in his own words, that he couldn't act alone on immigration. Here are the quotes: March 31, 2008: “I take the Constitution very seriously. The biggest problems that we’re facing right now have to do with [the president] trying to … not go through Congress at all. And that’s what I intend to reverse when I’m President...” May 19, 2008: “I believe in the Constitution and I will obey the Constitution of the United States.” May 5, 2010: “Anybody who tells you … that I can wave a magic wand and make it happen hasn't been paying attention to how this town works.” July 1, 2010: “[T]here are those … who have argued passionately that we should … at least ignore the laws on the books... I believe such ..."},{"comment_id":"10153778934267098","commenter_b":"Told to put her phone diwn, LOL","commenter_a":"In other news, the NBA just suspended Ayesha Curry for Game 7.","post_message":"Twitter goes crazy over Ayesha Curry's tweet..."}]
