[{"comment_id":"10153312471793606","commenter_b":"Enough Rioting In Baltimore Already It's Time To Cleanup The Damage Those Idiots Made And To Restore Peace Better Yet Make Those Monkeys Who Damaged Baltimore Cleanup Their Own Mess","commenter_a":"<iframe width=\"330\" height=\"180\" src=\"@webpagelink\" frameborder=\"0\" allowfullscreen><\/iframe>","post_message":"#BaltimoreRiots: We're monitoring social media right now, and some people are tweeting to get out and riot AGAIN. @webpagelink"},{"comment_id":"10156583768975389","commenter_b":"Build #TRUMPWALL","commenter_a":"Google Trends data shows Donald Trump was the most searched candidate during the debate, both in Iowa and across the country.","post_message":""},{"comment_id":"569394436600860","commenter_b":"I'm going to Mexico...go ahead Trump, make Mexico build that wall. Im ready to get tha hell outta of US now!! () cant wait to see you make them pay for it!!","commenter_a":"this is just the start of making America great again.......brace yourself....:(","post_message":"Donald J. Trump's win has sparked turmoil in the global market. CNNMoney's Christine Romans and Richard Quest are talking about how the world’s economies are reacting to the election – share your comments and questions below."},{"comment_id":"10153575061332411","commenter_b":"I Won't Vote For Kirk, Either!!!!","commenter_a":"Oh come now, he's a multi-billionaire businessman he knows how to talk nice when he needs to","post_message":"\"Trump has not demonstrated the temperament necessary to assume the greatest office in the world,” Kirk said in a statement."},{"comment_id":"10154072934058352","commenter_b":"Bitch bye u all in mii shit","commenter_a":"But thatz still her bro .....","post_message":"Nicki Minaj posts $100,000 bail for older brother Jelani Maraj after he is charged with raping a 12-year-old"},{"comment_id":"586880071512025","commenter_b":"How about all the hate crimes and murders committed by Muslims? Islam is pure evil. So is Obama & Lynch.","commenter_a":"How many Americans were either killed or injured by Muslims in 2015??????","post_message":" is a pernicious thread that connects the act of violence against a woman wearing a hijab to the assault on a transgender man to ...\""},{"comment_id":"1057253901026942","commenter_b":"and raising the min wage only cuts jobs, hrs, and closes busnesses","commenter_a":"We've seen this movie! And it doesn't end well for most Americans","post_message":"Research has found that massive tax breaks for the wealthy don’t trickle down into economic growth."}]
