[{"comment_id":"10153436202258855","commenter_b":"No a chick with a dick Courtney Danielle Banks","commenter_a":"That one ugly dude","post_message":"Go get 'em, Vanessa!"},{"comment_id":"10153577383622061","commenter_b":"she is an african american woman and can clearly see the hand on the jacket is a white persons hand. Open your eyes","commenter_a":"This has to be photo shopped. The woman has 3 hands. 2 on her face and 1 on his coat. My father was a fireman too, but would not have been allowed to pull a stunt like this!","post_message":"WATCH: Firefighter goes to great heights, literally, to make one stunningly beautiful proposal!"},{"comment_id":"742295419269809","commenter_b":"Herman. You read my mind. Agree completely!","commenter_a":"Banty McBotox seriously needs a reality check. Watching them as they form a circular firing squad is quite amusing. carry on.","post_message":"Please, Democrats. Keep repeating this. We want you to believe it with every fiber of your being. Don't change course. Don't learn your lesson. VIDEO!"},{"comment_id":"527878314072059","commenter_b":"Put her in jail!!!!!!","commenter_a":"To recap: Hillary is \"the devil\" and has \"hatred in her heart\" and Trump is going to appoint a special prosecutor to \"put her in jail.\" This is how a democracy slouches into totalitarianism.","post_message":"Your reaction to the second presidential debate?"},{"comment_id":"1691864404387315","commenter_b":"Omg ....how adorable!! You want one Mark? Do you still have your hot tub?? You're all set! I'll baby sit for you!","commenter_a":"Signe Nielsen tror jeg har fundet dr - at passe denne lille pige","post_message":"Welcome to Chicago, sea otter pup! At 10 weeks old, this little lady was found on a California beach all alone. Now, she's got a new home at the Shedd Aquarium. See the full video and photos here: @webpagelink"},{"comment_id":"369558209835168","commenter_b":"She's going to die","commenter_a":"Lesley has asthma and she wants to come @username Christian Canales @username @username","post_message":"People living in Galena Park are being told to shelter in place because of a sulfur dioxide release at a Pasadena refining system. This is viewer video from Geno Salinas. Story --> @webpagelink"},{"comment_id":"722235994591000","commenter_b":"For sure! Madam President for Prison 2016 once Trump beats her.","commenter_a":"i can't wait to be able to call you Madam President!!","post_message":"16 days. IWillVote.com"}]
