[{"comment_id":"10153931678551523","commenter_b":"You can't fix stupid! This bitch is flat out ignorant","commenter_a":"She's the same sister that said to take all the violence to the suburbs, but yet she condemns it. Lmao Yeah, condemns it when it's in her part of town, but to hell with the rest of the city and surrounding areas.","post_message":"One-on-one with the sister of Sylville Smith. She spoke exclusively with FOX6's A.J. Bayatpour on Monday. @webpagelink"},{"comment_id":"711989458991632","commenter_b":"So you are saying if all guns were banned from legal americans the secret service would not need any guns? You obviously are another liberal idiot. Again shit for brains, criminals don't get their weapons legally. They will still get weapons illegally & then what are they going to use against an illegal weapon, throw cans of green beans & peas at them? Throw rocks at them? Why do liberal idiots refuse to understand CRIMINALS DON'T BUY WEAPONS PER SAY AT GUN SHOPS.","commenter_a":"Let's start at the very top and ban those guns that the SService are carrying all around Obama","post_message":"President Obama is taking guns out of all forms of entertainment. This is ridiculous. He can't get away with this. Do you think he is abusing his power to push his propaganda?"},{"comment_id":"1194644643902280","commenter_b":"Build that Wall!!!!!!👍😃","commenter_a":"Yes but did anyone die?? CA is full of Illegals.. Probably the judge is as well.. Give em Hell Trump!👍","post_message":"U.S. District Judge Gonzalo Curiel in San Diego called for the documents to be released."},{"comment_id":"10153996390124071","commenter_b":"@username STOP ALL WELFARE PROGRAMS AND WE WILL NOT BE FINE! THERE WILL BE MORE MENTAL HEALTH ISSUES, MORE DRUG ISSUES, MORE CRIME, MORE HOMELESSNESS, MORE TRAUMA.. THAT IS NOT THE ANSWER BUT IF THERE WAS A LIVING WAGE PUT IN PLACE WE WOULD HAVE LESS PEOPLE ON WELFARE THAT IS A GIVEN. TOO EASY..","commenter_a":"Velocity of Money: I think it's quite simple if you look at something called velocity of money. What does that mean? That is the money that gets spent back into the economy. When you have the top 1% getting money, they spend 5-10% of what they earn. When you have the lower end of the economy getting money, they spend 100-110% of what they earn. Since we are a consumer economy this will be good for business in the long term. Not for the people getting the $15 per hour.","post_message":"An economist explains why Clinton’s plan to raise the minimum wage to $15 might be 'too much, too quickly.'"},{"comment_id":"10153974538694228","commenter_b":"Wow. Two uneducated racists here.....Jean and Gary! Shame on you both!","commenter_a":"You can thank Trump for perpetuating this problem.","post_message":" Muslim? All of you should die! The man yelled from his car. He then went inside for his gun. Police are seeking hate crime charges."},{"comment_id":"1194513290647275","commenter_b":"Yep and a drunk driver that got behind of the wheel of a car but didn't hurt anyone should not be taken away from their family and put in jail when they were caught????","commenter_a":"She's a threat to no one. They just took a mother from he children who were born in this country!! We are the one's who are threatening the lives of people who trusted us and came here to make their lives better, just like Trumps mother did. Just think, if they had sent her back we wouldn't be dealing with this heartless man! What a blessing that would be. He's done more damage in less than 3 weeks than Nixon did in about 6 years and he wasn't this bad!!","post_message":"Immigration agents “said she’s a threat, but my wife isn’t a threat,” her husband said in an interview."},{"comment_id":"10153946404822439","commenter_b":"They invited these people into their country. Their circus. Their monkeys. When their country implodes, we must absolutely seal our borders against European refugees. Let them stay home and fight or die. Euronate on them. We don't want their disease, here. We have enough of their kind already.","commenter_a":"Poor refugees, still weak from their flight to Sweden. Let's hope Gustavus Adolphus is not entirely dead yet.","post_message":""}]
