[{"comment_id":"1178194115526177","commenter_b":"That's her idea of building America?","commenter_a":"Hillary supports blm and black panthers in that they say kill all whites and cops. And riots, looters, arsonists, and cop haters are all ok with Hillary.","post_message":"It's being called \"a monumentally stupid comment,\" and that's among the remarks we can print. You simply won't believe how Bernie Sanders is \"feeling the Bern\" from his own fans after saying white people don't know this one thing"},{"comment_id":"2113127628913184","commenter_b":"He just gained 3 points sweet","commenter_a":"HILLARY !!","post_message":"We’re in a drone flying above a voting center in Parma, Ohio #CNNElection #ElectionDay #MyVote (no sound)"},{"comment_id":"10154278163336509","commenter_b":"The Bush war, $7 trillion and counting!!! (Before) Good Schools and Good Incomes! (Now) Poverty, Guns, Incarcerations! $$ facebook doesn't want you to see this $$ As long as America's richest 1%, who now possess 70% of the wealth and don't bother to vote, have the Senators in their pockets the United States Government isn't representing the will of the people, it's the 1% that's running the show. I stand with Bernie Sanders, \"We're governed by an Oligarchy.\" The number of Americans living in poverty will continue to grow while the middle class will continue to shrink and working women will continue to enrich the wealthiest 1% for the next 20 years easily! (Able to afford the best and brightest, Hillary is a great political actor with a well rehearsed script.) She WILL make another Fortune!","commenter_a":"His plan is take more money from the successful and give it to people like freddie gray's neighbors......makes perfect sense.....","post_message":"Bernie Sanders seemed appalled by the conditions as he toured sites of unrest following the death of #FreddieGray. \"Anyone who took the walk that we took around this neighborhood would not think you are in a wealthy nation.\""},{"comment_id":"865107826951175","commenter_b":"Who cares / she's useless","commenter_a":"And, Donald Trump(ish) is not racist, bigoted, arrogant, insensitive, and lacking in political comprehension ???","post_message":"Fauxcahontas."},{"comment_id":"10153208171456167","commenter_b":"A Ass is a Ass .","commenter_a":"We should promote his show on our facebook....","post_message":"Warning: These are some truly disturbing and vile remarks."},{"comment_id":"10153660392802217","commenter_b":"Some of London does not speak for all of London.","commenter_a":"London didn't care when the rest of the U.K. Suffer so why should we care about london","post_message":"A mad half hour as \"Biblical\" rain hits London."},{"comment_id":"583392381839036","commenter_b":"No Mexican's aren't the only ones. All illegal immigration must be stopped. However Mexican's are the vast majority of illegals and our shared border is the place to start to stop it.","commenter_a":"Illegals come here from Mexico looking for a better life yet they want to turn the U.S. into Mexico...freakin' crazy, and stupid!","post_message":"\"The American taxpayers have reached a boiling point. We are tired of illegals taking American jobs. We are tired of illegals living off our tax dollars. We are tired of illegals causing mayhem in our streets,\" says Todd Starnes. Do you agree?"}]
