[{"comment_id":"1526598987356152","commenter_b":"First Ladies are suppose to always embrace hope and not be pessimists.","commenter_a":"Her lavish vacations on the taxpayers backs are over !!!!","post_message":"SHE'S BACK TO HATING AMERICA: It's the end of \"hope and change\" and Michelle, for one, isn't happy about it."},{"comment_id":"10155186975350809","commenter_b":"Great idea, I might even watch the show if they did that. However it will never happen. That would mean doing what you're preaching and Hollywood is the least likely group to do that . It's fine to give to charities at a safe distance, make photo ops with your body guards right outside the shot, but this would be invasive to their gilded lifestyle. So expect more of the same lectures from the podium and not much else.","commenter_a":"really @username???! @username?? Please!!!! Give me a break","post_message":"Conservative Hollywood actor Robert Davi throws down the gauntlet and calls Leftist Hollywood out on its hypocrisy with an incredible challenge: invite illegals and refugees to the Oscars and your private parties or admit you're a racist! Enjoy this delicious read..."},{"comment_id":"10153562142188717","commenter_b":"Yes! Please leave!","commenter_a":"good for her .. Tah Tah","post_message":"Raven-Symone, co-host of \"The View,\" swore on the talk show that she will move to Canada \"if any Republican gets nominated\" for president."},{"comment_id":"1761239377456582","commenter_b":"Why won't she just tell the story on camera instead of wasting all that paper? And why were they recording this in the bathroom? And why were two grown women laughing and taking pictures of her in the store? And why the hell didn't her mom beat the living hell out of them? So many damn questions. Wtf..","commenter_a":"People are getting DNA and hormones mixed up as if they are the same or even similar.","post_message":"Transgender teen shares powerful message on bullying: \"We're not a threat. We are just like any other kids. We only want people to accept and love us for who we are.\" @webpagelink"},{"comment_id":"1680724472211527","commenter_b":"The falwells have been stealing and lying to americans for years. So it goes without saying thieves run together.","commenter_a":"Fallwell has lost his gourd.","post_message":"What a great honor- the Reverend Jerry Falwell Jr. of Liberty University, one of the most respected religious leaders in our nation, has just endorsed me!"},{"comment_id":"704368863070943","commenter_b":"He covered the swamp with scum!!","commenter_a":"Tge ma is a F-ing Con-artist!!","post_message":"Did Trump \"drain the swamp\" like he promised during the campaign? Vote below! LIKE Occupy Democrats for more anti-Trump content!"},{"comment_id":"1075179569197597","commenter_b":"Crooked Worthless Hillary for Prison","commenter_a":"You brag about being a grandma on your Facebook page. Why don't you stay at home with your aides? Give your grandkids cookies and milk. America is a great country that influences the world. It needs a strong leader. POTUS is not a position for the weak and feeble.","post_message":"Danny Williams and his wife Leah lost their home after Trump University took advantage of them."}]
