[{"comment_id":"833182496827699","commenter_b":"@username is Donald Trump black daughter.. Calling a whole family criminals doesn't make you any better boo","commenter_a":"This niguh said jalapeño! Lol Dude should of gotten down and teach him how to gorilla jump that border!😂","post_message":"Border Patrol Was On Him With The Quickness!"},{"comment_id":"840567656083161","commenter_b":"Karla Huitron cause yo ass can eat","commenter_a":"Marry her ass quick!!!","post_message":"What u doing? #WSHH"},{"comment_id":"10152821539741051","commenter_b":"who teaches bulling in school better than teachers?there are people out there that have no business interacting with young people at all. she should be put in the stocks, in school, let her feel what he felt. sue them all back to rubble","commenter_a":"Unbelievable, how could this type of bulling be tolerated? That school needs new policy's.","post_message":"When this woman found out that her grandson had been publicly punished like this, she couldn't believe it."},{"comment_id":"1603692309937131","commenter_b":"Hillary got 2 million more votes. Americans REJECTED TRUMP","commenter_a":"\"Why are you really doing this?\" Despite the many rumors swirling on the Internet, the Stein/Baraka campaign genuinely believes in the power of grassroots democracy. Independently funded candidates like @username cannot stand a chance if our electoral system is rigged in favor of establishment, corporate-funded candidates. The evidence so far shows it is easy to hack many voting machines being used in elections. Aside from conducting a recount, we advocate Ranked Choice Voting and federal campaign financing, just a few solutions put forth by the Green Party in it's six-point plan for grassroots democracy. The Green Party Platform, which calls for \"publicly-owned, open source voting equipment and deploy it across the nation to ensure high national standards, performance, transparency and accountability; use verifiable paper ballots; and institute mandatory automatic random precinct recounts to ensure a high level of accuracy in election results.\" jill2016.com/recountfaq","post_message":"I am joined tonight with Kevin Ronca, the director and creator of the incredible docuseries, \"The Revolution Televised.\" Although only 13 minutes in length, each of these episodes get to the heart of the matter: exposing the corruption that has been taking place in our sick political system! I would like to invite you to join the conversation as we will be releasing the 4th episode in this series right now, followed by a live Q&A session between our viewers, me and Kevin about this extraordinary series and where he goes from here. I'm sure you all have heard about the dramatic developments at Standing Rock, including the announcement today by the Army Corps of Engineers (see below). Kevin is willing to go there with his team to bear witness to this very important struggle. --- Press Release from Army Corps of Engineers 11/25/16: @webpagelink -- Here are some of ..."},{"comment_id":"10153502208726350","commenter_b":"Too bad they don't pay the woman as much as the men. Men.... 9 million to make it to 16 round. Women.... 2 million for Championship win.","commenter_a":"Congratulations ...Great team","post_message":"\"It was just an epic journey. One we'll never forget.\" - Carli Lloyd to Matt Lauer. #WorldCup #SheBelieves #USWNT Cc: FIFA Women's World Cup"},{"comment_id":"344636695739845","commenter_b":"all of these OLD STUPID WOMEN & MEN sould be fired for not doing their job","commenter_a":"I saw her on TV....She's an Idiot !","post_message":"Democrat Leader Calls Israeli Leader and says He Doesn for Her"},{"comment_id":"460052980821324","commenter_b":"Put the pussy on the chain-wax","commenter_a":"This headline is complete and utter garbage click bait bullshit. Mumford & Sons had nothing to do with THE CITIES/RESIDENTS. You can't blame a band for the amount of fans they attract, they're grammy award winning musciams coming of a 2 year hiatus after releasng a long awaited album. The city is the problem here for using this \"cleanout method\" which they are literally treating these people, HUMAN BEINGS, like trash and obviously have no problem using terms that state that. Blame the city not the band, oh and actually read the article.","post_message":"Not cool."}]
