[{"comment_id":"10154286126010326","commenter_b":"Hillary was lost in the past , she didn't care about the milleniels and helped destroy the base. Bernie is the future and was ignored by the filthy rich who are more Republican like than ever. Republicans were endorsing her.","commenter_a":"Eyes on the prize folks. Blue is going to be a tag team extraordinaire. We know the goal, it's not about who is the leader, it must be all of our blue and all of us.","post_message":""},{"comment_id":"10154578809696336","commenter_b":"They are all corrupt !!! Time to clean house !!!","commenter_a":"Lol , I just remembered that Obama said hillary is more qualified than he is .","post_message":"\"The FBI's not supposed to be involved in spinning the news. Whenever you release sensitive materials on the Friday of a holiday weekend you are trying to affect the news cycle.\" Tucker Carlson said the timing of the FBI's release of documents relating to the Clinton server scandal \"discredits a venerable agency.\" @webpagelink"},{"comment_id":"10153206290841037","commenter_b":"And burn all the racist people in America","commenter_a":"burn all the bibles, korans, and any other religious text. They are blights.","post_message":"After being falsely accused of burning a Quran, Farkhunda was beaten, run over with a car and burned before her body was thrown into the Kabul River."},{"comment_id":"10153545736202014","commenter_b":"You are obviously ignorant to what really goes on behind bars. I hope you have the opportunity to find out one day. You are only one mistake away.","commenter_a":"He is the best thing for Maricopa County in so many ways - everyone needs to experience what it is like when you do not have a Sheriff Joe - it is shear chaos - the prisoners have the power and control - Bless Sheriff Joe and i wish we had more like him . So yes yes yes from me","post_message":"YES or NO: Do you approve of Joe Arpaio's job performance?"},{"comment_id":"10153128143973812","commenter_b":"Cows can't even read","commenter_a":"Japanese people have since killed 78% of all Dolphins seen in this video.","post_message":"WATCH: It seems more like a dream as you watch it, but for Alex Rivest, it was reality as he joined a large pod of dolphins off the coast of Hawaii's Big Island. This video was recorded in late December."},{"comment_id":"10153229951151130","commenter_b":"Because women are catty.","commenter_a":"Someone needs to get their nails done.","post_message":"\"I never again want to get so caught up in this virtual reality that I forget the physical world right behind me.\""},{"comment_id":"891529944370915","commenter_b":"Yes I'm still for Trump! Put this women in prison. Stupid Women Lost & she conceded.","commenter_a":"Yes","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"}]
