[{"comment_id":"10155114924485725","commenter_b":"If he was over 18 she will never get arrested","commenter_a":"I don't think it should be a big deal as long as the young man was over 18 years old. If older men can be with young woman why can't older women be with younger men also?","post_message":"A 38-year-old woman has been charged with having sex with her daughter’s teenage ex-boyfriend, police said. More details, and a photo of the accused ----> @webpagelink"},{"comment_id":"10153714584104087","commenter_b":"She's a pure Red in disguise.","commenter_a":"The PEOPLE are speaking. She's winning by a lot of votes.. doesn't matter what the internet thinks. Real people are voting, and real people are voting for her.","post_message":"Fresh off a commanding win in New York, Hillary Clinton has a 13-point edge in the biggest state up for grabs in next week's primaries."},{"comment_id":"10153095051856770","commenter_b":"\"please everyone\" stop paying attention to the talking pig.","commenter_a":"AMY you need to get out of your dad's shadow. He's an idiot. Just look at the death rate in every city the has very strick gun laws. If we did not count them in death by guns the United States would have the lowest death by fire arms than any other nation.","post_message":"Amy Schumer continues to advocate for stricter gun laws after a man opened fire and killed two people during a July screening of her movie “Trainwreck.”"},{"comment_id":"10152634515646813","commenter_b":"Mind your own damn uterus, mkay?","commenter_a":"ACLU's \"rape culture\" worship, Rape of the child in the womb with instrumentation. rape to death..","post_message":"VICTORY! Federal judge strikes down law that could have closed #Wisconsin abortion clinics, calling the law “a solution in search of a problem (unless that problem is access to abortion itself).\" @webpagelink"},{"comment_id":"10154557066322908","commenter_b":"feelthebern.org :)","commenter_a":"Do not vote for Bernie Sanders, he is VERY MISGUIDED!!!","post_message":""},{"comment_id":"10153507149617452","commenter_b":"Your so dumb @username. Get ready to go back to Mexico or Cuba or wherever u from. Smh","commenter_a":"you idiots still voting for Trump. Smh","post_message":"New York Primary: Donald Trump and Hillary Clinton have won their parties' primaries in New York."},{"comment_id":"10153112992879753","commenter_b":"How extremely sad... :( and the parents were to take CARE of her. The boy should be taken away...","commenter_a":"they need to be charge my grandson only has to say his ear hurt and it time to do something they are painful so put them away","post_message":"One-year-old Hope Delozier died from an ear infection because she couldn't count on the two people she should have mattered to the most. BS excuses. @webpagelink"}]
