[{"comment_id":"954958944620884","commenter_b":"all fuckin jerks,","commenter_a":"WORD","post_message":"ClashDaily.com"},{"comment_id":"10155208446069411","commenter_b":"Islam... set your clock back to 7th century as a women you will get a lot of respect....from those goat..f......wake up...woman","commenter_a":"Allah snickerbar...blowing up","post_message":"Fire is believed to be caused by an 'electrical problem' - @RemyBuisine on Twitter"},{"comment_id":"966246990097370","commenter_b":"Umm Ferguson, Watts Riots, La Riots. White people are out of control? Ok","commenter_a":"I pray for their families","post_message":"White supremacists shoot five people near the #BlackLivesMatter protests for Jamar Clark, a 24-year-old unarmed black man who was shot earlier this month by police. Protestors took to Twitter after the shooting & described the scene as chaotic, saying police maced the crowd before an ambulance arrived to assist the wounded. No arrests have yet to be made. DETAILS ----> @webpagelink"},{"comment_id":"10154629464758797","commenter_b":"She also needs to be medically sterilized so another child cannot be born to this vicious murderer","commenter_a":"7 YRS R U FUGGIN KIDDING ME SMH I HOPE HE AT LEAST DIES IN PRISON","post_message":"TODDLER MURDERED: Prosecutors say the beating was so bad that part of the 17-month-old boy's skull broke off in the medical examiner's hand during the autopsy..."},{"comment_id":"758333967690514","commenter_b":"Pure, unadulterated ignorance. Lots of it going around. That guard shut them down","commenter_a":"Some people have no respect. So sad.","post_message":"These two men laughed at a military memorial. This guard shut them up without hesitation. Do you hate disrespectful people like that?"},{"comment_id":"10153885822754087","commenter_b":"Lmao.. She's a moron","commenter_a":"@username hysterical","post_message":"Hillary Clinton took things a bit too literally during a recent campaign stop when she read the word “sigh” off her TelePrompTer instead of actually doing one. WATCH:"},{"comment_id":"10153957381501336","commenter_b":"FAIR TAX on consumption, please. Get the hookers, pimps, drug dealers etc. To pay tax! They have to eat too.","commenter_a":"Make states lower property tax too. It's screwing me on buying a house","post_message":"“No deductions, no loopholes.” Dr. Ben Carson revealed his tax plan this morning and said he would replace the current tax code with a 14.9% flat tax. (Via: Fox & Friends)"}]
