[{"comment_id":"10153442947898908","commenter_b":"This is wrong. I can just tell you it is wrong because of decay and expansion. We know that the universe was something different even if that was just a tiny speck. The way the article reads as if the universe has always been the way it is now and that is not the case. All these bible thumpers who don't understand basic science or astrophysics will use this to try to say God is real.","commenter_a":"the end is the beginning.... the beginning is the end...","post_message":"This is a tough thing to wrap your head around."},{"comment_id":"10153639382745950","commenter_b":"Clever ladies..some of those pre rape drugs put you out for life.","commenter_a":"Good job ladies, we gotta stick together as women or we'll all parish to the hands of the evil ones. May GOD bless them all","post_message":"It doesn't matter if you're a friend or a stranger. When these 3 women noticed a man allegedly slip something into his date's drink, they couldn't just sit there and watch it happen."},{"comment_id":"10154460389668445","commenter_b":"If this were on a normal sized girl, those panties would be muffin top city.","commenter_a":"What happened to the girl in the black suit her waist is half missing. Photoshop fail. Hahaha","post_message":"#Getstoned, caption this photo and tag two friends. These tees and more on sale shop.hightimes.com/collections/sale-items"},{"comment_id":"1332991433380908","commenter_b":"All im saying is some people shouldnt breed .","commenter_a":"poor skinny white Jesusy guy.. HOW COME I'm THE CHUMP !! ==========>.\"roll tide/ @webpagelink","post_message":"Counter-demonstrators outnumbered attendees of a \"pro-white\" rally at Stone Mountain Park in Georgia, home to a divisive landmark that pays tribute to Confederate leaders."},{"comment_id":"847481612018670","commenter_b":"Kick them out of the country,they do not deserve to live here! DEPORT!","commenter_a":"Deport them to Iran.","post_message":"OUTRAGEOUS: Little Muslim Rats At Public School Walk Out When NATIONAL ANTHEM Plays Do you agree they should be deported?! Share this EVERYWHERE if you do! @webpagelink"},{"comment_id":"1488225507869622","commenter_b":"LOSER !!!","commenter_a":"Good should have done that long time ago","post_message":"HAHA! He's FIRED!"},{"comment_id":"10153900591048812","commenter_b":"You mean creation of George W Bush and Cheney.","commenter_a":"You go France! I wish our president was like yours. We need to destroy this creation of Obama. But firstly we must impeach our muslim-terrorist president!","post_message":"TARGET ISIS: French fighter jets take off on mission to strike ISIS targets in Syria; at least 20 bombs were dropped on ISIS’s de facto capital in Raqqa. @webpagelink Video: Defense.gouv"}]
