[{"comment_id":"499187636938483","commenter_b":"Send her sorry ass back to the jungle with her relatives.","commenter_a":"Come and get them you POS!!!","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"997010993718412","commenter_b":"Islamic Terrorist, go home, stop trying to change the U.S.A.","commenter_a":"No true American is safe as long as Islam is allowed to exist in our nation! We true Americans must unite against this plague and the liberals who allow them to destroy our lives and wipe them from our nation so we can ensure the safety and security of our nation and the American people!","post_message":"15 Year Old Boy Stabbed To Death By Muslim Refugee For Protecting Young Girl From Sex Attack. He is a hero, and will always be remembered as so. Can we get 150,000 'LIKES' for this brave boy?"},{"comment_id":"523357894521457","commenter_b":"She would be the worst ever.","commenter_a":"The people that will vote for Hillary, see nothing wrong with all his sex scandles.......... it dosen't faze them !","post_message":"Bill Clinton's promiscuous behavior could ruin Hillary's chances. Excellent. Help us spread this and make sure she never get's into office. Do you agree that Hillary would be a terrible president?"},{"comment_id":"10153647913121051","commenter_b":"@username, Bitches and N***** 'are' two different words....sentence formulation goes a long way towards making one look less uneducated","commenter_a":"Hope the black girl punches the radio when rap artists use that word and call other women bitches","post_message":"Some people say this girl's angry reaction was justified. Others disagree. Decide for yourselves who is right."},{"comment_id":"569394436600860","commenter_b":"I'm going to Mexico...go ahead Trump, make Mexico build that wall. Im ready to get tha hell outta of US now!! () cant wait to see you make them pay for it!!","commenter_a":"this is just the start of making America great again.......brace yourself....:(","post_message":"Donald J. Trump's win has sparked turmoil in the global market. CNNMoney's Christine Romans and Richard Quest are talking about how the world’s economies are reacting to the election – share your comments and questions below."},{"comment_id":"10154432726796320","commenter_b":"Another white woman mad","commenter_a":"Oh let's not forget how a caucasian family looked away from there child in Disney and the alligator got him(🙏🏾) did they drag his parents threw the news talking about their backgrounds? Nooooooo but a African American child falls in a gorilla pit and they put his fathers picture up and he wasn't even around!!!!","post_message":"In a dramatic image, a protester is grabbed by police officers in riot gear after she refused to leave the road in front of the the Baton Rouge Police Department Headquarters on Saturday. She has been identified by multiple media outlets as Ieshia Evans, 35, a nurse and mother of a 5-year-old boy. (AP Photo/Max Becherer)"},{"comment_id":"10156722273625354","commenter_b":"I hope the whole crowd good her sorry ass.","commenter_a":"And who allows them their STAGE? Disgustingly racial, anti police and presidential common, ticket of 8 yrs. Ugh! Don't buy their future stage!","post_message":"***BLACK PANTHER PARTY SUPPORTER AND BLM RADICAL DONOR BEYONCE OWES AMERICA'S POLICE, ARMED FORCES, & VETERANS AN APOLOGY***"}]
