[{"comment_id":"10152883726561491","commenter_b":"No..I am retired military..my tune is if there were ZERO GUNS...if you remember Archie Bunker : his daughter said :\" daddy do you know how many people are killed with guns every year?\" And Archie said : \" would you rather they were pushed from windows\"! No my friend I only mean Yes we need guns for protection and they great out door sports.. I only wish we didn't need such deadly force. It is , to have a gun or guns an important right. Especially in other countries where many citizens cannot defend themselves from thier own evil corrupt governments who kill thier own citizens..like Assad in Syria..awful oh yes own constitutional right to have arms and guns is one of the best rights and part of free speech..that's how we won the revolutionary war and became our very own UNITED STATES OF AMERICA..if ordinary citizens had no guns ...","commenter_a":"Guns mankind's worst invention.","post_message":"The course of the bullet corrects midair."},{"comment_id":"964624156930666","commenter_b":"Fat wives also can wear jeans ^_^","commenter_a":"He must have a really fat wife.","post_message":"Sounds reasonable :/"},{"comment_id":"10150839207834999","commenter_b":"@Gabrielle Nicole Alvarez By that logic, any psychologist whose job it is to draw such distinctions about attraction is a paedophile and any feminist knowledgeable about different types of abuse is a rapist. @@username hebephilia concerns the early stages of puberty, so ephebophilia, attraction to mid-late teens, might be more fitting.","commenter_a":"And now we wait for the complaining pedophiles...","post_message":"Miss Teen USA is ditching bikinis for athletic wear."},{"comment_id":"1140463419377942","commenter_b":"Oh a gold dress, is that all? I thought maybe her penis was showing through her dress! Ha!","commenter_a":"For what she spent on that dress they could let all of the Afghanistan veterans keep the Enlistment bonuses they received 10 years ago instead of charging them $650 each a month until the entire $10,000 plus interest is paid back!","post_message":"It was Michelle Obama's final state dinner, and the first lady was trying to make a good impression. However, people noticed something wrong with her dress in a big way... now, it's making news everywhere. This is sick... it shows you who the Obama's REALLY are."},{"comment_id":"761137067410204","commenter_b":"Good decision by the judge. This entitled brat needs to make better decisions.","commenter_a":"Just another teenage girl who never got proper parental guidance because the parents were too wrapped up in themselves.","post_message":"Outrage After Judge Orders Bristol Palin To Do THIS With Her Breast Milk This is just ridiculous. A mother should not be subjected to this. Do you agree or disagree with the judge?"},{"comment_id":"1032100616836565","commenter_b":"This Woman is pure Evil.","commenter_a":"hillary maggie mae clinton..........cause the morning sun, when its in her age really shows her age","post_message":"Pro-abortion politicians have ramped up their war on the unborn for 2016. It's up to us to do everything we can to protect them by continuing to build support behind the Life at Conception Act! Click below to sign your petition to put an end to Roe v. Wade! www.nationalprolifealliance.com/lacvid_petitionfb.aspx?npla=IFH16&pid=fb171"},{"comment_id":"1160665140611621","commenter_b":"Men, have no business making any rules or laws that apply to women....PERIOD !","commenter_a":"Who elects these illiterate morons? New Hampshire, step up your game.","post_message":"These male legislators may not be grown-up enough to talk about women's bodies."}]
