[{"comment_id":"1736894583244313","commenter_b":"Jenny Fabbri Some of the images leaves much to be desired. Efforts are commended.","commenter_a":"Good, but they cannot do same for migrants?","post_message":"Awww... some amazing footage of a kitten revived by Italian coastguard's kiss of life..."},{"comment_id":"1687479528205826","commenter_b":"You can come to America if you do it legally if you want to go over the wall if there was a wall yes shoot to kill. That will be a deterrent to stop other illegals from trying to do it.","commenter_a":"Yes and shoot to kill anyone crossing from Mexico to the USA","post_message":"Yes, I do!"},{"comment_id":"932169176839778","commenter_b":"And, they won't ever listen to us when they have all these illegals voting for them! I hope the Democratice citizens are taking note of all that is going on in our country!","commenter_a":"Americans had better listen to Anne Coulter. She is right and she is warning Americans what I have also been saying. We are losing America to illegal immigrants because of obama.","post_message":"A new Pew Poll found that only 24% of Americans want to increase immigration to the U.S."},{"comment_id":"10153274022815326","commenter_b":"The DNC are the ones calling in the second string. I do like VP Biden, and respect him, but it is obvious that the DNC establishment see Hillary as a loser now. Senator Sanders is the ONLY candidate who is fighting for ALL of WE are the 99%. The media and their Oligarch Masters are afraid of Bernie Sanders, which is why they have been ignoring him. Bernie is fighting for WE the 99% regardless of race, age, gender, sexual orientation or beliefs. He should be getting 99% of ALL votes including republicans, democrats and independents. Let's all vote for our own self interests for a CHANGE. FEEL THE BERN? Everyone had better or we are doomed.","commenter_a":"The Dem establishment can't be too pleased if Biden does decide to run. Could hurt Hillary by splitting the establishment vote.","post_message":"Vice President Joe Biden is still figuring out if it is in his heart to run for President again in 2016. Biden is a fighter for the middle class, Ed Schultz and Katrina vanden Heuvel discuss. Watch the entire show at: @webpagelink"},{"comment_id":"1100490033318081","commenter_b":"Suck it up b**ch","commenter_a":"I thought this family was rich. What gives?","post_message":"Hardly 5 star quality... \"She explained a slight bit of displeasure about her accommodations and I explained to her this a jail, not a resort.\" -Sheriff Anderson @webpagelink"},{"comment_id":"10153856032800329","commenter_b":"Yea I agree. They should of had variety of women. Not all overweight women have round faces. Chubby face yes. They are all pretty but some of those cuts I wouldn't do on most women, regardless of their size.","commenter_a":"A round face shape doesn't mean you are over weight. And these cuts were not exactly flattering to these women. Ijs.","post_message":"Warning: this post will make you want to get your hair did asap."},{"comment_id":"10153827416061438","commenter_b":"Lol...really?She may be a whackjob but looks wise, she is a stunning women.","commenter_a":"It was pitiful and tragic to watch and it was clear that she is a desperate, washed up, narcissistic, actress whose looks are fading and relies upon her melodramatic sexuality rather than any improvisational or theatrical skills. Her girl, delivery was worse that the sound of a dentist drill and it was more emetic than aphrodisiac. The audience was truly stunned , as if they were witnessing the senile ego of a down and out prostitute consumed, devoured, by her own inflated ego turning tricks in the parking lot. Her exaggerated performance wreaked. It almost seemed cruel to not instantly cut to a commercial. It was truly wretched. Mr. Ed pissing on stage would have been a great improvement! And I sure that horse is dead!","post_message":"If you were left scratching your head, here’s a quick explanation."}]
