[{"comment_id":"10153671476736509","commenter_b":"Online predators? she lied about her age, and deceiving people. wtf is wrong with you. how would that be all those men's fault? she lied dude. i'm glad mom stopped it. we need to do something about females lying about age. why are the men in the wrong hear? but that's the double standard of women though. kids should not be on Facebook period. we need to regulate Facebook and make it for adults only. and use id's to sign in. just like in a bar. i applaud mom, she could of gotten pregnant the works. it would of been her own fault. why? because she lied and said she was a grown up when she clearly was not. mom has every right to give those people a chance to delete her. and i bet you real quick, those people removed her. good job mom. good job. kids don't belong ...","commenter_a":"So people are shitting on her for tough love because she's trying to protect her child from online predators? WTF is wrong with society.","post_message":"Tough love or public humiliation? This Denver mom gave some strong feedback about her daughter's suggestive Facebook postings: @webpagelink"},{"comment_id":"1098620013533448","commenter_b":"This is AMERICA AND AMERICANS should be able to fly OUR FLAG any time and any place in America we want to and if some foreigners don't like it then they can get the hell out of America now.","commenter_a":"The school should be ashamed. This is America and the flag is the symbol of freedom. Whoever is the leader of this school should be fired and never allowed to work in the school system again","post_message":"EPIC! The School Said The Flags Off Your Truck, His Response Set Em Straight (VIDEO) This is America! Don't like it then leave!"},{"comment_id":"10156613595445354","commenter_b":"I'm amazed at how ignorant she is!!!","commenter_a":"Wasserman Schultz is what you cal and air head. The elivator does not reach the top floor.","post_message":"\"...it’s incumbent upon us to stand with our Muslim brothers and sisters and make sure that we can push back hard...\""},{"comment_id":"10153848630809411","commenter_b":"About time someone stands against the crooked cops","commenter_a":"My wish is that these imagrants won their battle and that they rule in Europe as it were Europes wish that they rule in my country. :) Now its your turn.","post_message":"'Like a war'"},{"comment_id":"1121854401168903","commenter_b":"Stfu fat bitch","commenter_a":"Is it because they're assholes?","post_message":"They spend their lives eating rotten meat - so why don't they get sick?"},{"comment_id":"10153952600386336","commenter_b":"This will definitely stop the murders in Chicago. NOT! It's laughable how completely out of touch this clown is.","commenter_a":"Find Job... Fine job..Mr President.","post_message":"President Barack Obama will use executive actions to expand licensing requirements for small-scale sellers, according to reports."},{"comment_id":"10155009435559910","commenter_b":"Andre Lopez illegal immigrants can't vote. That's a lie","commenter_a":"lollllll \"won by a large electoral college vote\" he CANNOT let it go that he is the BIGGEST LOSER OF THE POPULAR VOTE EVER.","post_message":"WATCH LIVE: President Trump and Canadian PM Justin Trudeau hold a joint press conference."}]
