[{"comment_id":"10154765929828812","commenter_b":"That retort would demand a Breathalyzer test immediately in any Protective Custody or Dangerous-ness to the public situation. The man is incapable of formulating a complete and comprehensible sentence in English. Does he, maybe speak English a second language like some immigrants do? I've watched people get detained/PCd for less. He's going to lead the free world. We have illuminated the planet with a new low in the dummie-ing down of America.","commenter_a":"One temper tantrum away from WWIII","post_message":"Donald J. Trump says he \"could tell\" from intelligence officials' \"body language\" they were unhappy Pres. Barack Obama \"did not follow what they were recommending.\""},{"comment_id":"10153868800692377","commenter_b":"Hillary is a very nasty woman!!!","commenter_a":"He can call her what she is. A nasty woman. And it's just horrible......But she can call all of us deplorables and its ok. Don't be offended.","post_message":"Donald Trump stirred social media ire on Wednesday after he said, \"We have some bad hombres here\" and referred to Hillary Clinton as \"such a nasty woman.\""},{"comment_id":"878149845586082","commenter_b":":D mu mka kap hernia .. :'(","commenter_a":"Joe Jess","post_message":"This just shouldn't be possible..."},{"comment_id":"10153311065101167","commenter_b":"Three words: Token. Black. Woman.","commenter_a":"Why does anyone care what Stacey Dash has to say?","post_message":"Today on live TV on two separate programs, Fox News called Obama a \"total pussy\" who doesn't \"give a shit\" about terrorism:"},{"comment_id":"10153128873081051","commenter_b":"What a crazy bitch that is","commenter_a":"Some people shouldn't be allowed to breed.","post_message":"This man was worried when his girlfriend took off with their baby, but he tried to remain calm. Then he noticed the text messages she had sent him. That's when restraint went out the window and he called 911."},{"comment_id":"10154913988378701","commenter_b":"I would ban that woman from the store.","commenter_a":"What a fucken cunt!!!","post_message":"\"One of their female employees Jessie? Jennifer? J something is disgustingly obese, and each time we come in, although she does her job and is very polite, instantly makes my appetite disappear,\" the customer's Yelp review read in part."},{"comment_id":"10153199211227235","commenter_b":"Stupid bitch. Go read the Constitution you're currently wiping your ample ass with.","commenter_a":"Omg! Go away please.","post_message":"GOOD GRIEF!"}]
