[{"comment_id":"962147223853010","commenter_b":"Femmie=carpet munchingg","commenter_a":"And this is why I don't identify as a feminist. Yes, periods should not be stigmatized, yes womens sanitary products should not be taxed, yes we should try and supply women without access to sanitary products but publicity stunts like this are what give feminism a bad name. Let's all grow out our armpit hair and show it off on Instagram, not wear deodorant and bleed all over the place and while we're at it let's just devolve a little as well.","post_message":"'I ran with blood dripping down my legs for sisters who don’t have access to tampons...'"},{"comment_id":"1116491755058348","commenter_b":"This is great! Pam Sept Hill, Janet Blessinger Gleason, Kandace Herring and Colleen Lafferty Wilson did you see?","commenter_a":"Terri Andrews Joanna Tugwell. We so need to print this X","post_message":"More of this, please!"},{"comment_id":"1076420105745487","commenter_b":"But will that maggot go to Chicago?nope, why cause they are not Muslims!!!","commenter_a":"How sad that these voices will not be heard. It does not go along with Obama's agenda. The black race is being set up. He would rather get 13 percent of a country, pissed off at 87 percent of a country. It is a setup for failure folks.","post_message":"WATCH Black Chicago Residents Blame Obama For Crime And Joblessness: “He needs to resign”"},{"comment_id":"1175985589130223","commenter_b":"Eww she be ugly scary","commenter_a":"why is this infidel a councilwoman in the first place???","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"10156527615820206","commenter_b":"She's getting my vote. I want a woman in the White House.","commenter_a":"Seeing Carly on Tuesday, can't wait!!","post_message":"Such a great welcome from supporters in Mackinac Island, Michigan today!"},{"comment_id":"10154543039398132","commenter_b":"Two jerks","commenter_a":"Stay joyful! Happy birthday Blake","post_message":"Gwen Stefani celebrated Blake Shelton's big 4-0 with some epic throwbacks."},{"comment_id":"10153243373545950","commenter_b":"Go Hillary...to JAIL","commenter_a":"BREAKING NEWS: Donald Trump, Republican presidential candidate drowned today, apparently he was trying to learn to waterboard.","post_message":"President Obama banned the practice of waterboarding and other so-called \"enhanced interrogation techniques\" after he took office. But Donald J. Trump said he would \"bring it back\" to fight ISIS."}]
