[{"comment_id":"10153675023971409","commenter_b":"First of all .... what is she doing out of the kitchen ? She should be making sandwiches ..not pizzas","commenter_a":"Good that's life","post_message":"Jensen isn't sure yet if she'll take any official legal action, but she still wants to fully understand why she wasn't given equal pay."},{"comment_id":"936073656538031","commenter_b":"She is the one for the job. Let's go forward not backward.","commenter_a":"HILLARY will be a GREAT PRESIDENT.. #PRESIDENTHILLARYCLINTON2016","post_message":"Matt Lauer asks Hillary Clinton about the qualities that make her qualified to become Commander-in-Chief. More coverage on @webpagelink"},{"comment_id":"1263570023663025","commenter_b":"Be a lying pussy...ok","commenter_a":"Some People would not understand diplomacy, poise and intelligence go way further than acting out of anger and fear (like most of republicans are reacting) Obama is doing exactly what he is supposed to do!","post_message":"\"YOU ARE NEXT.\" President Barack Obama tells ISIS leaders they cannot hide. Read more: @webpagelink"},{"comment_id":"711006379048137","commenter_b":"THERE IS SOMETHING WRONG WITH THIS BRAINLESS MORON...CAN NOT LISTEN TO HER HAVE TO CHANGE THE CHANNELL.....I WISH THEY WOULD NOT PUT HER ON...DISAPOINTED CNN.","commenter_a":"I just cannot listen to her!!","post_message":"No, Donald Trump would NEVER try to draw attention to himself. /smh/ --Andrew"},{"comment_id":"10154105541082093","commenter_b":"Yea man! Go Donald. Get rid of the illegals. I can't wait","commenter_a":"Jeff Sessions = KKK! Another good ole boy for Donald trump...","post_message":"They held up hand signs saying, \"Go Jeffie Boy!\" and \"KKK\" ... The Alabama Republican was rejected for a federal judgeship 30 years ago amid accusations of racial insensitivity... @webpagelink"},{"comment_id":"10153763080696350","commenter_b":"Of course he is being dismissed.. If he wasn't, there would be another riot. She needs her butt kicked out of school.. Very tired of this..","commenter_a":"This cop was so wrong with is action I am glad he was fired","post_message":"BREAKING: Sources say that the South Carolina deputy seen flipping a student in a classroom will be relieved of duty."},{"comment_id":"10153825338913690","commenter_b":"... and what does anybody to prevent it, concerning slave traffickers???,","commenter_a":"Well it's right what you say, but where is Qatar in that case? Shouldn't Muslims help Muslims. I can't see any help from Saudi Arabia, Qatar or UAE!","post_message":"\"To have the small bodies of babies and children carried ashore or washed up on these idyllic beaches is devastating. I have seen children sleeping in the mud under a flimsy bit of cardboard, and kids shivering with blue lips and hands. We expect the situation to get much worse as winter really bites.\""}]
