[{"comment_id":"1347077192027276","commenter_b":"LuAnn...I guess you are ready to pick some fruits and veggies for 2 bucks an hour in any kind of weather mind you! Oh and then remember anything coming in from Mexico like tequila and avocados will cost you 20 cents more for every dollar the item costs! Hmmmmm! So, we are paying for the wall!","commenter_a":"Round 'em up ... head 'em out... back across the border... if they are here illegally they have already broken the law they do not need to be here number one . it's the rule of law .. number two .. it's common sense for the survival of the Republic ... BUILD THE WALL ... and whatever else it takes to keep them out .. they want to come in they can get in line and do the process ...","post_message":"Speaking at the CPAC today, President Trump says he intends to keep his campaign promises:"},{"comment_id":"996230513733330","commenter_b":"Hillary would then round up JEWS if she could ... Thats been done by HITLER","commenter_a":"How big of a f-----n idiot can some one that is running for office be she is going way to for","post_message":"BREAKING: Hillary Clinton accuses GOP of wanting to implement Nazi tactics."},{"comment_id":"995140990545649","commenter_b":"terrible how must the parents feel xxx","commenter_a":"SICK!!!!!!!","post_message":"She drives off with the baby's pram still wedged in her bumper"},{"comment_id":"10153574217106509","commenter_b":"And she IS being a butthole!","commenter_a":"I don't know why everyone gets mad at someone's expression of an opinion. Opinions are like buttholes, we all have em","post_message":"A female CEO is under fire after a Facebook post in which she said a woman should not be president of the United States. “That should be left to a man, a good, strong, honorable man,” she said. @webpagelink"},{"comment_id":"10155149699869558","commenter_b":"I just watched two segments of news, that being just a plain old person, it seems to me could be mutually worked out to everyone's benefit. It costs to become a citizen. AND our infrastructure is failing..Why cant' we find how willing these people are to be here by having them work for 2 or 3 months for construction, they could work for 4 hours for free to pay for citizenship, and 4 hours for pay for living expenses, A place to stay would be provided while they go through a 2 or 3 month vetting and so prove they really want to be here and are willing to honestly work for it.","commenter_a":"All you americans opposing trump are thick as hell he trying to save your country leave him alone let him do what is needed i wish we had him back off dont be thick all your lives","post_message":"\"That's not press bias. That's blatant dishonesty... The illegal immigration issue has been set up by the media to demonize Mr. Trump as a racist and a brutalizer of the poor.\" In his Talking Points Memo tonight, Bill O'Reilly ripped the mainstream media coverage of federal immigration officials arresting more than 600 people across at least 11 states last week. MORE: @webpagelink"},{"comment_id":"10152513756410927","commenter_b":"e is talking about his leader Satan","commenter_a":"Ha! The blind leading the blind. Schmuck. “This I say therefore, and testify in the Lord, that ye henceforth walk not as other Gentiles walk, in the vanity of their mind, Having the understanding darkened, being alienated from the life of God through the ignorance that is in them, because of the blindness of their heart:” Ephesians 4:17-18","post_message":"Obama says he has sought God's guidance in leading nation..."},{"comment_id":"1710328329254279","commenter_b":"@username they are too stupid to listen.....republicans are turning into the lowest pond scum.....shit for brains","commenter_a":"I don't like the media. They don't publish the news unless it goes there way.","post_message":"WHOA This is going to start a RIOT... Obama deserves to be in JAIL!"}]
