[{"comment_id":"695333573948652","commenter_b":"@username you are wants wrong with lawless America. So let me ask you for a honest answer if that's possible for you. Is she doing this because she cares about USA or just to be first woman president? Honestly now!!!","commenter_a":"You're still more concerned with his words than you are her actions. It's sad that laws only apply to people on the right and left for that matter but not her. You hilliary supporters should be ashamed. How do you sleep at night.","post_message":"This is horrific. We cannot allow this man to become president."},{"comment_id":"429495940593558","commenter_b":"The racists are AGAINST Trumo!","commenter_a":"The days of Nazi Germany are coming back if we don't stop this racist Trump. Blacks and Latinos must unite power to end this nonsense.","post_message":"The Secret Service rushed to shield Donald J. Trump after someone tried to jump a barrier during an Ohio rally on Saturday."},{"comment_id":"10156660915665354","commenter_b":"The woman should thank Ms Palin for keeping her employed. If she didn't resemble Sarah she wouldn't be working. Since there isn't much talent there.","commenter_a":"Sure, Sarah made Tina famous and rich. But Tina helped do the same for Sarah. I believe Sarah is laughing all the way to the bank....just as much as Tina is. Sarah did look a bit disjointed at the endorsement and Tina jumped on the opportunity to mock her. But Tina....sorry. You failed miserably. Didn't laugh at all. SNL is just sad. Don't watch any longer. The constant right bashing is boring and predictable.","post_message":"You saw this, right?"},{"comment_id":"715065121964948","commenter_b":"Good luck competing with India and China for FDI by multinational corporations. Unless you guys are okay with working for <US$1 an hour.","commenter_a":"Correct me if I'm wrong, cost of living will rise and NHS is at serious risk........... As far as I can see we're in real trouble!","post_message":"Is #Dexit on the cards? Could Denmark follow Britain? Paul Adams was in Copenhagen where there are already calls for a similar #EURef. You put your questions to him and Eurosceptic Danish pollster Erik Høgh-Sørensen. #FacebookLive"},{"comment_id":"502242713299642","commenter_b":"Fire him","commenter_a":"Break his legs then he will have an excuse not to stand.","post_message":"This Muslim NBA Star refuses to stand for the U.S. National Anthem. How disrespectful. Regardless of religion, you need to respect our country. Do you agree this NBA player needs to learn some respect?"},{"comment_id":"10153720536124087","commenter_b":"@username I bet you're wife is a illegal ass immigrant. Get ready to never see her again once he wins","commenter_a":"Cool. Soon there will be no minorities left for trump to insult. He'll start insulting the lackof intelligence of his supporters.","post_message":"GOP front-runner Donald J. Trump recalls phoning his credit-card company to see if an Indian call center would answer."},{"comment_id":"10153853099981680","commenter_b":"Abedin: she \"could not use a computer\" So much for Hillary being the great email mastermind.","commenter_a":"Ok, so what!! There is no federal statute that prohibits this! There is an executive rule, which if this article is true the Executive who created said rule exempted by communicating with Clintons private email. That said using a pseudonym may create legal issues for Obama that have never been thought about by lawmakers","post_message":"#Breaking: Obama used a pseudonym in emails with Clinton, FBI documents reveal @webpagelink"}]
