[{"comment_id":"1086763938002529","commenter_b":"\"The dangers of muslims...\" Yes, because American muslims have just been attacking other Americans day after day for years. Oh im sure theyre just waiting right? And in 10 years theyll still be waiting? And in 20, still waiting...","commenter_a":"Trying to desensitize the American people of the dangers of muslims.","post_message":"\"Mohamed Ahmed is not at a disadvantage because he's Muslim: On the contrary, as the reaction from Obama and the fawning media shows, he's privileged.\""},{"comment_id":"10154178082379726","commenter_b":"Yea and less than that are for your boy Cruz, and even less than that (way less) for Kasich. What is your point. Look who got 60% of the third largest state (NY) and watch where he is in the primary's tonight.","commenter_a":"For me, I hope Trump supporters realize he is only getting about 37-39 % of Republican votes on the average. I'm not talking about the one national poll that has him at 50%, I'm talking about the current raw, known facts, of these primaries. Nearly 2/3 of Republican voters want other than Trump.","post_message":"It's begun — even his fiercest critics are resigned to Trump's likely nomination."},{"comment_id":"10153483045518812","commenter_b":"She just wanted to be a hoe","commenter_a":"Is she right or is she wrong? If the male students have some privileges, so should the female students.","post_message":"High school graduate, who says she was penalized for what she said teachers and administrators described as “distracting” clothes, uses yearbook quote to strike back at school dress code: @webpagelink"},{"comment_id":"569394436600860","commenter_b":"I'm going to Mexico...go ahead Trump, make Mexico build that wall. Im ready to get tha hell outta of US now!! () cant wait to see you make them pay for it!!","commenter_a":"this is just the start of making America great again.......brace yourself....:(","post_message":"Donald J. Trump's win has sparked turmoil in the global market. CNNMoney's Christine Romans and Richard Quest are talking about how the world’s economies are reacting to the election – share your comments and questions below."},{"comment_id":"10153702195241336","commenter_b":"What a WANKER .","commenter_a":"No , they either are true to their faith or to their country , not both !","post_message":"\"Mr. Carson may be a good doctor but he is not ready to lead a great nation.\" Today on \"Sunday Morning Futures with Maria Bartiromo,\" Sen. Lindsey Graham responded to Dr. Ben Carson's comments that a Muslim should not serve as a president. @webpagelink"},{"comment_id":"1095090630555419","commenter_b":"Leave then lol i did","commenter_a":"Chicago is the worse place to live it's sad I fear for my child and don't want her outside because there's so many shootings each day","post_message":"WOMAN SHOT AT STOP LIGHT: A 24-year-old woman has been shot multiple times while at a stop light at 71st & Wentworth in the Englewood neighborhood. It happened just after 11 p.m. The car she was driving ended up coming to a stop in a grassy lot with its driver side window shot out. She is being treated at Christ Hospital in Oak Lawn where Diane Pathieu ABC7 joins us live with the latest."},{"comment_id":"10154272601268525","commenter_b":"How stupid are those girls...their on camera now...lol","commenter_a":"Shane Ornelas","post_message":"HULK HOGAN ROBBED: Not even the iconic wrestler's home is safe from holiday package thieves! STORY: fox10phoenix.com/entertainment/@username-story"}]
