[{"comment_id":"763624153793368","commenter_b":"@username..Bye Felicia, go suck an egg","commenter_a":"I would waited until he falls asleep, and pull me a loreana bobbitt ...get a Surgical scapple do a nice clean quick slice, get me some tweezers and carry it and throw it on the freeway, and let someone run over it. it ain't big anyway. second scenario, get some super glue and glue his little hands to his little tilwinkle!","post_message":"Did you catch this moment from Melania Trump at the inauguration? Via In The Know"},{"comment_id":"1214139651951673","commenter_b":"What a crock! Mr Trump is not a racist","commenter_a":"Sorry Jake but this isn't just about your skin color.it's also about a economic plan which the republican party has that is unfair. A foreign policy that won't work. -just about any plan they come up with is for the upper class.about much more than just you.","post_message":"18-year-old Jake Anantha was a Donald J. Trump supporter until he was kicked out of a rally. Anantha says he was being \"profiled\" and wants an apology. Watch more here: @webpagelink"},{"comment_id":"10153212099990927","commenter_b":"She and Whoopi are proof that there are people in this world that shouldn't be allowed to reproduce.","commenter_a":"She is so irrelevant.","post_message":"So if you don't ago along with Obama plans...you're racist? Only the 'View' Crew could come up with something so stupid."},{"comment_id":"867123823334246","commenter_b":"A woman has the right to decide who and what uses her body just like every other person.","commenter_a":"my rights stop where yours begine and vice versua","post_message":"Unborn babies deserve protection!"},{"comment_id":"10154006446451680","commenter_b":"She is a joke.","commenter_a":"Making sure this cult leader doesn't get away with anything and Elizabeth Warren is one tough woman. Good for her.","post_message":"\"The American people understand the revolving door,\" Elizabeth Warren said. \"They're really sick of it.\""},{"comment_id":"1197755483636319","commenter_b":"oh look a trump impersonator ! If you don't agree with him your a PIG!! a LOSER a total Disgusting human beings!! We're going to make America grate and get my red hats from China yea it going to be grate! They both suck but I trust her with the nations safety and economic well being . He can't get it wrong! It's not like he can claim chapter 11 to get out of paying his bills? Right Einstein!! Lol","commenter_a":"Some People think being president is always being right! about everything you do or try to do! It's not that simple. Back seat driving is easy , but when your responsibility is keep America as safe as possible and the world. Some things will not always go right. You guys are the haters The Republican Party of No","post_message":"It's funny because it's true."},{"comment_id":"1113532561997426","commenter_b":"@username you are dumb idiot. W. Bush was the want that gave the tax break to the richest and the big corporations. Do you think that the MF Republica will go along with that, has much they hate like you the President. Went you moron , stupid and idiot use the word SOCIALISM find first the meaning of that word MORON. THE LUCKY ONE IS THAT MF BUSH THAT SEND OUR KIDS TO BE KILL FOR HIS GREED. BUSH NEED NOT THE BE IN JAIL , NO BE PUT IN THE ELECTRY CHAIR, TOGETHER WITH CHENEY AND HIS ADMINISTRATION.","commenter_a":"More for the rich..less for the poor..thanks a lot.","post_message":""}]
