[{"comment_id":"10153856262981167","commenter_b":"And what do they show? Nothing in the previous 30K!","commenter_a":"Fixtion(sic) for Fox viewers like screaming \"fire\" in a theater.","post_message":"Really scraping the bottom of the barrel here"},{"comment_id":"1255997957800290","commenter_b":"Drop her ass off after 😂","commenter_a":"At least he was a gentleman and took you to dinner after.","post_message":"Separate bills please. #WSHH"},{"comment_id":"10154563644004087","commenter_b":"With the illegals being deported Shitlarys vote count drops","commenter_a":"Funny but if you libturds went to Mexico and tried to live and work there illegally you would end up in prison. Libturds want open borders for cheap votes, no matter how much it harms America. See: \"The Reason Trump Got Elected\" for further reference.","post_message":"The Congressional Hispanic Caucus is requesting a meeting with U.S. Immigration and Customs Enforcement after more than 300 undocumented immigrants were arrested in raids over a 48-hour time span."},{"comment_id":"10154056899827541","commenter_b":"Did you know that one the kkk used to lynch Italians as well?","commenter_a":"All you morons. This is an italian thing. And they are white. Get over it already. Its 2017 almost","post_message":"A high-ranking mob enforcer from Queens told a gambler who owed his boss money he was saved by the color of his skin."},{"comment_id":"972807806163282","commenter_b":"shes a Savage","commenter_a":"@username her","post_message":"The former Stanford University student who sexually assaulted a woman behind a dumpster was released from prison on Sept. 2, 2016. That a full three months early from his original six month sentence."},{"comment_id":"10152925868341336","commenter_b":"I agree Joanie, impeachable offense to release enemies from Gitmo to try to kill Americans again!","commenter_a":"Obama has committed treason with this big time!!! Why hasn't congress started impeachment.","post_message":"The U.S. Army has decided to charge Sgt. Bowe Bergdahl with desertion, according to Retired Lt. Col. Tony Shaffer. He told Bill O'Reilly that the Army \"wants to do the right thing\" but The White House \"wants this to go away.\" @webpagelink"},{"comment_id":"10154073966458837","commenter_b":"Getting pregnant for most chicks doesn't cost anything ! Save a few bucks and don't buy a condom .......","commenter_a":"Omg! I'm really trying to understand her thought process at that time, but really can't! Some people have no brains and should never reproduce! There are so many women out here that are dying to be able to birth a child and you have pos ppl like this. Smfh!!!","post_message":"SHOPPING MOM ARRESTED - A Florida mom was arrested after leaving her 4-month-baby in an unlocked car while she went holiday shopping."}]
