[{"comment_id":"10153930605634614","commenter_b":"Women.., please don't fight strangers...,they're not your husbands..,to be arguing all day...","commenter_a":"Only 13 years for her life. Really for someone killing a mother directly in front of her children what really he should of got life for each child plus mom no way appalled.","post_message":"Elizabeth Yanez was stabbed to death in front of her two children in a dispute over a parking space at the Santa Fe Springs swap meet. Her convicted killer, 23-year-old Reggie Cervantes, was sentenced to 13 years in state prison Tuesday for the 2014 attack. doesn make sense to me, nothing makes sense, the woman daughter said after witnessing the brutal attack. a parking space. How am I supposed to go on with my life? Read KTLA's story here: @webpagelink"},{"comment_id":"1312061745499049","commenter_b":"You two are makeing it hard for people that are serious about their beliefs your making them look bad,so knock it off!","commenter_a":"#Theydontrepresentme","post_message":"\"After sharing my thoughts about the recent Women's March on Facebook, rabid feminists quickly attacked, displaying their 'tolerance' as they 'lovingly' called me a twat and worse. That didn't bother me. What irritated me was the 'We did this for you' remarks. Before these feminists march for me again, there's something I want them to know.\" @webpagelink"},{"comment_id":"1089311434439529","commenter_b":"This surprised me.....even a blind squirrel finds a nut.","commenter_a":"The view sucks all those asswipes on that show should move to Brussels if trump gets elected..","post_message":"\"I can't believe I’m feeling this way...\""},{"comment_id":"1257959987602294","commenter_b":"You are completely ignoring many of the issues such as the inequality in wages between men and women, the dearth of equality in positions of power such as government and business, and, many other issues which have been a problem for many years. Most murders of women are by men as are rapes. Women are often expected to wear short skirts and behave in what men deem a \"feminine\" way on TV and in many businesses. An excellent example is Fox news.","commenter_a":"I think this poem/speech misses a huge issue and ignores the obvious. Humans as a whole are failing. This isn't just a man's issue. I see, daily, women tearing other women down. Calling them the same things you hear. It is a problem from all sides. We have failed to raise children with respect, love, and caring. That is the issue. To suggest it is only males is dishonest. We should accept it is a societal issue and not a male/female issue.","post_message":"She’s a “dangerous\" woman because she dares to speak her mind in an online community that openly harasses, disparages, and threatens women. Warning: contains strong language. (via Agnes Török Poetry)"},{"comment_id":"1322851284474589","commenter_b":"Or help take care of them in Forster Care?","commenter_a":"Not realistic, there are many people looking to adopt. The murdering of unborn children is not justifiable.","post_message":"Accurate."},{"comment_id":"10155065453241323","commenter_b":"You still refuse to answer the question.","commenter_a":"An admirable academic for sure . But; one line in the video had me chuckling \"And then population growth will stop\". Naive to think population growth will ever stop. Deluded dreamy lefty thinking.","post_message":"\"Let me show you the world\", said Swedish academic Hans Rosling, who has died aged 68. Here he demonstrates the dynamics of population growth, child mortality and carbon dioxide emissions. The challenge for the world is to get everyone out of extreme poverty and get the richest people to use less fossil fuels, he said."},{"comment_id":"10153304564243525","commenter_b":"Typical knee jerk, fear based response. The terror attack in Paris was masterminded by a Belgian, not a serian. The NSA is a lot harder to get through than the security in Paris. What we need to do is acept the refugees, like Germany has done, and educate them on taking back their contry from the corupt regime AND ISIS.","commenter_a":"This is a very sad situation.","post_message":"#BREAKING Governor Rick Scott says Florida will not be willing to accept any refugees from Syria. Florida joins the growing list of states that have sent similar notices to the federal government. STORY: @webpagelink"}]
