[{"comment_id":"10157370299475725","commenter_b":"@username Here in the Houston area too. This is wrong. Build the wall!!!!","commenter_a":"I thank God for Mr.Trump, being I live here on the border in the San Diego area, we need to take our country back, illegals are everywhere, coming up here to have there baby's. its so wrong! Please help us","post_message":"This is a MOVEMENT - to take back our country! We are going to go non-stop -- all the way up to November 8, 2016 --- and beginning in January 17th, we are going to MAKE AMERICA SAFE AND GREAT AGAIN! -DJT"},{"comment_id":"1167588859974389","commenter_b":"Bo Go Back To Fucking Your Sistermommy","commenter_a":"Isn't that great ! I am happy to see Trump gets that endorsement. Hillary is probably sick with envy but she got an endorsement from BLM...and other terrorist groups.","post_message":"Major Endorsement from our Heroes on the Frontlines..."},{"comment_id":"10153347624056509","commenter_b":"No.","commenter_a":"Hate crime. obviously","post_message":"Angry family members insist this had nothing to do with a parking spot, and a spokesperson said the suspect had threatened the victims before: @webpagelink What do you think? Share your thoughts in the comments."},{"comment_id":"684212015075058","commenter_b":"@username Your mom was penetrated 3 or 4 times in one day by a cave dweller","commenter_a":"The source file was on whitehouse.gov when they originally released it. I downloaded it, simply opened it in photoshop, and all of the layers were still accessible. I was able to remove words, dates, signatures and even fragments of words where they pieced them together. It was a complete fumble on their part.","post_message":"I thought this was just a conspiracy theory. But it actually happened today. #fakepresident? Edit: No we have not been hijacked, and our mods have diverse political opinions. This was from AP and tons of other sources both left and right, definitely not fake. Heavy was the most neutral we could find."},{"comment_id":"10154472139428271","commenter_b":"@username always cleared denotes nothing about guilt .","commenter_a":"I don't care how it happens the cops will always be cleared until we say no more.","post_message":"His mom called police because she knew he was in trouble. But minutes later her son was dead. The DA has cleared the officer involved in the shooting because the suspect had reached another officer's gun and fired a shot."},{"comment_id":"10155013183823984","commenter_b":"And your fat ass bitch!!","commenter_a":"He is a total brain dead idiot. Every state only has two senators. Even tiny little Rhode Island. We have 50 states and 100 senators. Congress is according to population. Actually we need to go back to how the founders originally had it, where the states legislatures picked Senators and when they misrepresented the state they could recall them. Then the Senators wouldn't be persuaded by donors.","post_message":"President Barack Obama just made a staggering announcement about the Electoral College days before the electors cast their official votes..."},{"comment_id":"10154258591333701","commenter_b":"What a bitch. Just say you don't want to exercise, don't take it to the next level.","commenter_a":"Once they hit 65 it should be mandatory yearly testing until age 75 in which case it needs to be testing every 6 months. Elderly people do not belong on the road. NOW before you idiots talk crap let me just tell you my father drove until he was 87 years old. When my brother and I reported him to the DMV at 83 years of age he was sly. He just went and took his drive test at the Silverton branch of the DMV and passed because all they had him do was drive around the block. Regardless, old people need to be allowed to ride the buss and max for free and stay out from behind the wheel!!.","post_message":"Police say nobody was injured in the crash, however there was something very familiar about it for everyone involved."}]
