[{"comment_id":"1598021397151640","commenter_b":"At least God is doing something to help with the immigration problem.","commenter_a":"He is a wonderful god","post_message":"WHOA!"},{"comment_id":"1370641286340188","commenter_b":"HE is transitioning. This FEMALE is taking a hormone that naturally occurs in both sexes bud. The hormone treatments are meant to change the development of certain features. Nails, hair, masculine chest, skin tone, fingers etc. Workout drinks for women such as, pre workout, come with testosterone for added boosts. Now, there are specific weight categories to ensure fairness. There is a woman that goes to my gym, I overheard her say she weighs 150lbs. She can bench as much as me. She can squat more than me. It's all about the work and dedication you put into your day and routine.","commenter_a":"Testosterone. Why SHE, shouldn't have been allowed to compete against boys or girls. Period.","post_message":"He didn't back down."},{"comment_id":"10153820420328816","commenter_b":"they are whores","commenter_a":"without the John Doe investigation we never find out the Walker's deputy cheif of staff steels $50,000 from a Veterns organization, Walker and his bunch are the worse kind of pigs.","post_message":"Scott Walker signed legislation Friday curtailing the ability of district attorneys to use the John Doe law to launch investigations like the probes they have conducted of his campaign and his aides and associates."},{"comment_id":"1370953329605967","commenter_b":"She can start any day....","commenter_a":"@username maybe Jerry will do this to Eddie someday soon. 😐","post_message":"The only thing that can calm this grumpy toddler is her love for her baby sister: @webpagelink"},{"comment_id":"551022975088282","commenter_b":"the only thing i would sacrifice for this transvestite is a bullet.","commenter_a":"What the hell makes her think she can change our constitution? She's a nobody married to a mistake & not worth the oxygen she breaths! & he is a waste of oxygen also.","post_message":"Michelle Obama wants to strip you of your 2nd amendment rights. No one, especially not this sad excuse for a first lady will take our rights away from us. Will you refuse to sacrifice your constitutional rights for Michelle Obama?"},{"comment_id":"10154099164360329","commenter_b":"DREAM HUBS","commenter_a":"@username your future hubby","post_message":"He never even read the books, but he researched them and made all the magical decorations himself. Read more: @webpagelink"},{"comment_id":"10152983014636051","commenter_b":"Yes, she should have been suspended. The foul language is not acceptable to use in school or anywhere else.","commenter_a":"i see nothing wrong she answered them in her opinion and where are the profanities? teacher is wrong and so is the school","post_message":"School officials took one look at this 14-year-old girl's answers on her sex-ed quiz and immediately suspended her."}]
