[{"comment_id":"10154986550662767","commenter_b":"@username DO SOME RESEARCH, BITCH!","commenter_a":"I hope he meets a terrible demise. Like I am talking, Isis style, execution. In high definition, with fabulous audio. Now, I would read THAT book, for sure. I wish nothing but the worst, to this radical islamic Kenyon born, Isis daddy! I wonder what chapter of the book describes Michelle, peeling off sweaty duct tape, and revealing the SCHLONG, that MADE THE FREAK BATHROOM BILL? Trump is wiping any, and everything, this TERRORIST has done. #HeDontMatter #GhostPresident","post_message":"Obama is widely expected to get the most lucrative contract ever for a post-presidential memoir."},{"comment_id":"1868770480033724","commenter_b":"Why, because the system is being drained my illegal aliens and the corrupt gov. Trump is fixing that open your eyes.","commenter_a":"This is as embarrassing as it can get. I wouldn't want to be president of a country if I had to think so negative about it. America is a great place to live but they r making some poorer each day. Cut Social Security, cut Medicare, cut insurance , cut food stamp, cut cut. Why?","post_message":"No. Words."},{"comment_id":"10153373415836130","commenter_b":"That's right.","commenter_a":"They NEVER thought it was a bomb. If they had, why was the school NEVER evacuated? They were racist, bigoted asses who lied when their hatred was bared to public scrutiny","post_message":"The family is “still deciding where he will go next.\""},{"comment_id":"10153278657786336","commenter_b":"Nice to meet you as well Sherrell.","commenter_a":"White lives matter too","post_message":"Police believe Daron Dylon Wint – the suspect in the D.C. quadruple murder – may be in Brooklyn, New York. DETAILS: @webpagelink"},{"comment_id":"978050422232298","commenter_b":"NOT A FAN of this pro-Muslim woman PERIOD!!","commenter_a":"She is the new definition of cool. Drop that mic and walk away.","post_message":"Mic drop."},{"comment_id":"1153132958040066","commenter_b":"All 3 should be skinned and decapitated!","commenter_a":"And everyone \"outraged\" are all Vegen, right?!! Where is the outrage for the 100's of 1000's of innocent babies murdered every year???!!!","post_message":"The U.S. tourist who who killed Zimbabwe's beloved lion, Cecil, received global condemnation as news spread. Read more here: @webpagelink"},{"comment_id":"10153150214411320","commenter_b":"so judging by the comments...women think that it is too much, and men not far enough. :D","commenter_a":"Nothing left for the imagination","post_message":"The cover of the Sports Illustrated Swimsuit Issue features Hannah Davis. She is wearing one of the most revealing bikinis yet for the annual issue. Do you think the magazine has gone too far? Read also: Plus sized model to appear in swimsuit issue: @webpagelink"}]
