[{"comment_id":"10153751332879369","commenter_b":"Ok, and most of those are probably illegal aliens .. lol","commenter_a":"Well there's tens of thousands of people for every Ex-American that leaves. So...bye.","post_message":"Americans are renouncing their citizenship over this."},{"comment_id":"10152820989551615","commenter_b":"I would be putting her inappropriately dressed (?) fat butt right out of the \"prom.\" She LOOKS like a moderately dressed hooker! Maybe that is closer to the truth than one might think.","commenter_a":"Wouldn't be necessary if the CHILDREN and their PARENTS actually knew how to dress appropriately.","post_message":"“You can't put ten pounds of mud into a five pound bag.\" One parent is threatening to sue for sexual harassment over a school handout about the dress code for graduation. It’s a story we’re talking about this morning on Channel 11. @webpagelink"},{"comment_id":"10152823954416130","commenter_b":"Sorry for caring about Charlotte by the way","commenter_a":"If this jerk telling you to get them isn't reason enough NOT to, then I don't know what is...","post_message":"\"The science is, you know, pretty indisputable. We’ve looked at this again and again. There is every reason to get vaccinated, but there aren’t reasons to not.\""},{"comment_id":"1080143312021089","commenter_b":"Yep TRUMP 2016","commenter_a":"Looking forward to him becoming our next president asap.","post_message":""},{"comment_id":"10153516438174087","commenter_b":"Only stupid people would let Syrian.people come to the U.S. Or illegals.","commenter_a":"Han er decideret syg i hovedet Oliver Dagn","post_message":"“I’m wondering if you would be able to look at [Syrian refugee children] in the face and tell them that they’re not allowed to go to school [here],” a voter asked Donald J. Trump. \"I can look in their face and say, ‘You can’t come here,’” Trump replied to applause."},{"comment_id":"10154133671460950","commenter_b":"There was only 1 person who refused to vote guilty all 12 have to agree, this piece of shit refused to vote guilty. There were 11 people who voted guilty","commenter_a":"Its the south and besides he had an all white jury and he shot the man in cold blood it was caught on camera and the jurors call it a mistrial","post_message":"WATCH: Judy Scott, mother of Walter Scott, reacts to a mistrial being declared in Michael Slager's trial: \"It's not over 'til God says it's over.\" @webpagelink"},{"comment_id":"10153126028062235","commenter_b":"Shame on her !!!","commenter_a":"Oh please! Hahahahahah!","post_message":""}]
