[{"comment_id":"10155284668713268","commenter_b":"Who the fuck cares, did it have anything to do with this country?","commenter_a":"How long before he has a stroke a day realizes he is being uaed","post_message":"\"This is a direct attack on [Pres. Trump's] policies and her [Ivanka Trump's] name,\" Press Sec. Spicer said on Weds. regarding Nordstrom's decision to drop Ivanka Trump's fashion line. @webpagelink"},{"comment_id":"840577339312941","commenter_b":"I can't help but wonder at a few things, if the anti vac parents with children that have Measles now had seen to it that their kids had the MMR vac, would the kids be sick now and also, look at where the majority of the kids that have had and now have measles have in common...vacation to Disneyland...ummmm no illegal alien has that kind of money, unless they are coming from wealth in the first place. It is all too easy to blame the \"illegal aliens\" for everything wrong in out country...not always the case.","commenter_a":"Ya think? Duh....","post_message":""},{"comment_id":"977838925598355","commenter_b":"Yes!","commenter_a":"Yes","post_message":"What do you think? Ferguson? Baltimore? Black Lives Matter? We've never seen so much division!"},{"comment_id":"1383067515067050","commenter_b":"Your whore fingertips are getting in the way of you making any sense. Maybe if you'd done anything intelligent with your life instead of studying how to do your hair and makeup you'd see just what a failure to society you are.","commenter_a":"To all the haters, STFU. If you dont like it GTFOO our country, bc WE elected her! USA USA USA!!! We are great and will continue to be great with Hillary leading us.","post_message":"History has been made!"},{"comment_id":"1766381716934834","commenter_b":"How many drunk, stoned, high on drugs?","commenter_a":"If YOU DONT LIKE THE DECISION THEN GET THE HELL OUT OF AMERICA!!!!!","post_message":"Trump protest continues in Portland. Story: @webpagelink"},{"comment_id":"578481392330649","commenter_b":"THEY LOOK SO FOOL OF IT.....SSSSSSSSSSSSSSSSSSS","commenter_a":"Pot, meet Kettle...","post_message":"“One of the greatest frauds in modern electoral history is Donald J. Trump pretending to be an outsider.\" Tonight on “Hannity,” Ted Cruz said that Trump is part of the establishment because he funded liberal Democrats for years."},{"comment_id":"10153580849383812","commenter_b":"I'll be there. Don't know if I'll fit in that box.","commenter_a":"This is just becoming the perfect excuse for some parents to abuse the internet and the kindness of others... What a joke, shame on the parents BY THE WAY, MY birthday is coming up, Im opening an invite to everyone and anyone!!! PO BOX for gifts to follow! LOL","post_message":"Hundreds attend 10-year-old boy's birthday after mom extends open invitation to the Internet when she finds she has no one to invite: \"He was grinning ear-to-ear.\" @webpagelink"}]
