[{"comment_id":"1001016903307871","commenter_b":"this woman is vial","commenter_a":"Can she get away with everything!! She and Bill both should have been in prison over this too!!","post_message":"Independent Counsel Laying Out Criminal Case against Hillary Clinton in Whitewater Land Scandal."},{"comment_id":"10153551784963984","commenter_b":"She wants some air time don't give it to her","commenter_a":"Yep","post_message":"These days, Donald Trump seems to be at the center of every controversy. He might just be in the midst of another one after this actress just thanked him for his stance on immigration... Do you agree with Donald Trump's views on immigration?"},{"comment_id":"696122653842743","commenter_b":"They will catch these 2 cowards soon. Police Force do maximum.","commenter_a":"Going Back to origin country, muslim are not belong to europe, they are many coming politecal, assylum in germany, they should send bact to origen country , there muslim,","post_message":"Report: Two armed suspects in Paris shooting located in northern France"},{"comment_id":"1742914335970564","commenter_b":"Where are we going to put all these people . ???? I just have not seem many pictures of great families knocking on our countr's door but mostly young to middle age men with anger and mean expression written all over their faces . How will we cope ????","commenter_a":"Noooooo","post_message":"That's a 550% increase!"},{"comment_id":"10155756776370615","commenter_b":"Refused. By Faux News? Well, it is official, her fifteen minutes are over.","commenter_a":"One sick puppy","post_message":""},{"comment_id":"1113471052062455","commenter_b":"Spot on Allen West ... that's Donald Trump","commenter_a":"\"I want to raise a generation of young people who are devoid of conscience, imperious, relentless, and cruel.\" - Adolf Hitler Obama and Hillary read this and are following it. Hillary did her college thesis on this topic. Now you can add Bernie Sanders to the mix. From Alinsky's Book, \"Rules For Radicals\": How To Create A Socialist State by Saul Alinsky There are 8 levels of control that must be obtained before you are able to create a social state. **The first is the most important.* *1) Healthcare Control healthcare and you control the people* *2) Poverty Increase the Poverty level as high as possible, poor people are easier to control and will not fight back if you are providing everything for them to live.* *3) Debt Increase the debt to an unsustainable level. That way you are able to increase taxes, and this will produce more poverty.* *4) ...","post_message":"Allen West Republic @webpagelink"},{"comment_id":"455232604658620","commenter_b":"Hillary Clinton!!!","commenter_a":"Bernie Sanders!!!","post_message":"Listening is always better."}]
