[{"comment_id":"589804961210083","commenter_b":"If they don't like it then they can suck chuck","commenter_a":"Love my Marines.","post_message":"These Marines make huge stand and show Muslims they're not afraid. Love it. We need to spread this and show these Marines we have their back. Do you support our troops?"},{"comment_id":"1244580435606816","commenter_b":"GET THOSE ANIMALS OUT OF HERE ....PLEASE PEOPLE GET THEM OUT.!!!","commenter_a":"30 minute response time? Sounds like they were having their dinner first.","post_message":"So grateful, so eager to assimilate..."},{"comment_id":"10154391312414614","commenter_b":"I think these pro illegals group should pay the billions it's costing Americans, show their support that way......","commenter_a":"Annndd I don't care.","post_message":"\"We wanted to point out that while he seems to think he can say what he likes in one place and not hear about it elsewhere, he is wrong,\" said one Scottish protester, referring to Trump's controversial comments about Mexican immigrants. point of the flag is to show solidarity with the Mexicans and every other group that Trump has decried, derided, insulted and tried to marginalize, said David Milne, a member of the Tripping Up Trump campaign."},{"comment_id":"856436467738235","commenter_b":"Hang her!","commenter_a":"I'm a cabbie and I wish I could catch every person that skips on me","post_message":"A judge told this teen she could either walk 30 miles within 48 hours--or go to jail. She chose the long walk. See what she did below. Do you think the punishment fits the crime?"},{"comment_id":"1509765899325906","commenter_b":"Shut up bitch","commenter_a":"As much as i hate to see President Obama leave office, I can't wait. I can't wait to point out to my Republican friends that noone has knocked on your door and taken your guns, he did not declare himself a dictator and refuse to leave office and my personal favorite example of media driven paranoia......were you chipped??","post_message":"\"What EXACTLY has Obama ruined in this country?!?!\" Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153602966152217","commenter_b":"@username what a silly girl.","commenter_a":"Because corruption in Nigeria is a way of life practised at all levels of society and to suggest a correlation between corruption in Nigeria and in Westminster is fatuous and ridiculous, that's why.","post_message":"Why is David Cameron \"lecturing\" Nigeria and Afghanistan on corruption when Tory MPs are being investigated for potential electoral fraud? That's the question raised by the Scottish National Party's Angus Robertson. @webpagelink #PMQs"},{"comment_id":"10153646970166336","commenter_b":"She'd be worse than that in the role of President!","commenter_a":"She jeopardized National security!! The idiot!!","post_message":"Hillary Clinton said in an interview Friday that she’s “sorry” her use of a personal email for State Department business has “been confusing to people,” but didn’t offer an outright apology for her actions."}]
