[{"comment_id":"1589075444729621","commenter_b":"To keep the Marxist Corrupt Hillary out!","commenter_a":"Why should anyone care what a theologian thinks about a political choice?","post_message":"ICYMI: Theologian Wayne Grudem lays out the moral case for voting Trump."},{"comment_id":"10152946623505399","commenter_b":"Not even worth her effort!","commenter_a":"As an Alaskan, may I just say, \"O please, Sarah. Please just go away. \"","post_message":"Well then."},{"comment_id":"592558244260673","commenter_b":"The wall will at least stop them from driving & walking over the border.","commenter_a":"build the wall in Mexico","post_message":"Will Trump build the wall? When will riots end? DML addresses these issues in his Walk & Talk. Please watch and share, and if you are new to DML then we ask you give us a LIKE."},{"comment_id":"861148387265123","commenter_b":"Female racist-in-chief.","commenter_a":"-who is she to make that decision, no man has that right - God creates life!","post_message":"What sorts of \"populations\" does it sound like Ruth Bader Ginsberg is interested in \"controlling\" here?"},{"comment_id":"10153617313036051","commenter_b":"Lazy ass bitch","commenter_a":"Is this for real?","post_message":"This 61-year-old woman and her jobless boyfriend live entirely off government benefits. Now, they have yet another request. When you find out what they want, you're going to be outraged."},{"comment_id":"10153532910231336","commenter_b":"It's a food product, not plastic. Keep it real.","commenter_a":"It's not even real cheese anyway!! People, you're eating flavored plastic to begin with!","post_message":"RECALL ALERT: 36,000 cases of Kraft Singles cheese slices recalled after customers reported choking on the plastic wrapping. (via Fox Business)"},{"comment_id":"10153291330611770","commenter_b":"Sorry to hear this!","commenter_a":"when we have a women president this is the gal I would vote for she is smart and very much better looking then Hillary. Really!!!!!!!!","post_message":""}]
