[{"comment_id":"902249986464524","commenter_b":"ridiculous..she was good enough to lay down and have a child with but now she's a hoe?","commenter_a":"SMDH now that an action right there to piss her off more. No woman wants the father of her child disrespecting her on media outlets. Let's see how long she gonna ban him from seeing his son now. Some guys never learn. No matter how much he hate her he need to handle their business in private. Who wants to grow up with the public and their father throwing shade at the person that gave birth them. U cant stop what the world thinks of Amber but Wiz should act more mature and handle it since he a Dad now. They need a mediator ASAP","post_message":"“Instagram Turnin’ These Wives Into Hos”: Wiz Khalifa Takes Cheap Shots At Amber Rose On New Song, “For Everybody” :("},{"comment_id":"1737156569841341","commenter_b":"Me too, streamed. He handled disrupters well.","commenter_a":"Loved it, not like being there but watched it live. Trump you are predestined to be our next President.","post_message":"I LOVE YOU NEW YORK! Thank you for a terrific night, ALBANY! LETS GET OUT & VOTE TRUMP next Tuesday, April 19th -- and lets WIN, BIG LEAGUE!"},{"comment_id":"1060332480688422","commenter_b":"Hillary foreign policy. Iran bad deal. Libya diaster, benghanzi four died on her watched as they pled for help and she wants more illegals and migrants to come in take over country putting our safey and jobs at risk. Voted for Iraq war, a war buillt on lies! Say No to Hillary!!!","commenter_a":"Whether Bernie likes it or not he has no say so over what this country's direction is.","post_message":"Our message in this campaign is of creating a nation and a vision based on social justice economic justice, racial justice, and environmental justice – and whether Donald Trump likes it or not, whether Hillary Clinton likes it or not, that is the future vision of this country."},{"comment_id":"10152878773282217","commenter_b":"Jeanette is a bit of an obsessed weirdo","commenter_a":"Organised religion is worse than organised crime","post_message":"Why is Magna Carta so important?"},{"comment_id":"1297466373615674","commenter_b":"HOW CAN ANYONE VOTE FOR THIS WOMAN WHO IS SO BLATANTLY FOR THE SUPER RICH !","commenter_a":"GO BERNIE !!! YES ... we surely need to implement a nationwide ban on this problem will destroy our only livable planet, Hillary support fracking... That's totally unacceptable and she is unfit to be pres.","post_message":"Fracking is a reckless, destructive and expensive practice and we must put an end to it all over this country. Add your name to say you support preventing the worst effects of climate change through the Keep it in the Ground Act."},{"comment_id":"1058949000851488","commenter_b":"Of course it would. My God you people with your guns. Enough already.","commenter_a":"None of the proposed legislation would have saved a single life... this is all political theater and a cover for the Democrat's failed foreign policy.","post_message":"Senator Chris Murphy: \"I'm mortified by today's vote, but I'm not surprised by it. We learned in the months after Sandy Hook that the NRA has a vice-like grip on this place. Even when 90% of the American public wants change.\" Full video here: @webpagelink"},{"comment_id":"10153238274816107","commenter_b":"Counseled women*","commenter_a":"Thank you Rand! The only one who stands for the people!","post_message":"Thanks to your continued pressure, this morning I'm pleased to announce that I've secured a commitment to have a vote on my bill to defund Planned Parenthood before the August recess! I pushed hard all weekend long to vote on defunding Planned Parenthood. My campaign sent out millions of emails mobilizing patriots like you to join this critical fight. It worked. I believe right now you are seeing the impact one man who's willing to stand for something can make in Washington, D.C. with the backing of millions of good folks like you. But now our job gets even tougher. Please call your U.S. Senators at (202) 224-3121 and insist they \"Stand with Rand\" and vote for my bill to defund Planned Parenthood. And please let me know you've got my back by adding your name as a Citizen Co-Sponsor: @webpagelink"}]
