[{"comment_id":"10158044327420354","commenter_b":"Yes then a finger dipped in purple dye.....lol","commenter_a":"Funny how these so-called \"errors and glitches\" always favor the democrats. Personally, I used a paper ballot.","post_message":"***BREAKING***"},{"comment_id":"986689444723866","commenter_b":"She's an idiot","commenter_a":"She's as smart as a bag of hammers. Attention seeking dweeb.","post_message":"Wait until you see this."},{"comment_id":"1859080321003763","commenter_b":"@username IDIOT!! No brains!!","commenter_a":"Don't give them the attention they want......they are not America they are not speaking for me!","post_message":"Protesters shut down dc"},{"comment_id":"1849468845289358","commenter_b":"@username rn she sitting on a strap thats why u so butt hurt😂😂😂😂","commenter_a":"She kicks some dude out of her show cause he didn't want to record her and now she does this shit... she's straight up trash.","post_message":"Doesn't look like this promoter is playing games! #WSHH #YoungMa"},{"comment_id":"10156663817835294","commenter_b":"That nasty women needs mandatory life in prison. Piece of garbage","commenter_a":"She didn't give the baby up! She left it in the toilet to die. That's not surrendering that poor baby.","post_message":"The police are releasing the photo and the video to bring awareness to California’s safe surrender law, which allows any newborn under 72 hours old to be surrendered without criminal charges."},{"comment_id":"10157096795925551","commenter_b":"Go back to sleep old woman","commenter_a":"She has shown her bias...can't be trusted anymore","post_message":"Well, imagine that."},{"comment_id":"10153187094616636","commenter_b":"Typical Welsh comments !!!","commenter_a":"Hoog cheats by throwing himself to the ground in an attempt to get a South African player a yellow card or worse. Not a word of aplogy from the player, coach or former players. Why is it the Scots are such bad losers.?","post_message":"Gavin Hastings said the sight of Joubert leaving the pitch was \"the worst thing I have seen on a rugby field in a very long time\""}]
