[{"comment_id":"899136066791297","commenter_b":"What? C'mon! Can the girls join the Boy Scouts?","commenter_a":"This says nothing good for Girl Scout leadership. If the leaders were of strong character, they would say \"he'll no\".","post_message":"Why would ANYONE think this is a good idea?!"},{"comment_id":"1023637380990606","commenter_b":"Bubble gum? Lol are you 12?","commenter_a":"I came to piss off pro vaxxers and chew bubble gum. Im all out of bubble gum.","post_message":"Way to go, anti-vaxxers."},{"comment_id":"10154209676831336","commenter_b":"Carolyn Ann Banet shut up hoe","commenter_a":"Women are dangerous, no matter what species!","post_message":"Yikes!"},{"comment_id":"10154453531128256","commenter_b":"I can see a domestic violence commercial. You go girl","commenter_a":"Well, question how do you work shooting or showing a weapon into a McDonald , Pepsi , Kentucky Fried Chicken, Nike commercial? Just asking, maybe that's why no offers.","post_message":"While companies like Winchester, Beretta and Otis Technology support Team USA's Kim Rhode, she doesn't have a single sponsor from outside the firearm industry."},{"comment_id":"10153414020695950","commenter_b":"A nebulizer doesn't even come CLOSE to the amount of power required for a VENTILATOR. Lady, are you freaking SERIOUS?","commenter_a":"Hope the family uses their blessing wisely now keep the lights off when not in use teach kids to open blinds for lighting in the day ...it's time people learn to turn things off when not in use to keep from having a bill u can't pay ....this firefighter was a true blessing","post_message":"After firefighters arrived at the house for a non-emergency medical call, they learned that one of the family's children requires a full-time ventilator to breathe. But the house no longer had electricity because the parents fell behind on payments, so one firefighter decided to light up the home with generosity."},{"comment_id":"1032254556867364","commenter_b":"I wonder if she was addicted to the same drugs smuggled across the Mexican border due to our insufficient border protection... #TRUMP16","commenter_a":"Oh Chelsea, what a story you have now, and a calling for the rest of your life... Nobody can tell the story you have to tell now!!! Hold on to that sobriety and to God, one day at a time... I love this... And love how well Hillary listens... #ImWithHer !!!!!! Sobriety means EVERYTHING!!!!! The best thing, of course, is to never even START drugs....","post_message":"\"I started doing drugs when I was 12 years old. At 15, I was doing anything I could really get my hands on.\" Substance abuse and drug addiction hurt our kids, friends, neighbors, and loved ones. We've got to solve this."},{"comment_id":"1223203257706743","commenter_b":"But hey lets bring in refugees... and keep illegals... It is good for America according ot Liberals and Democrats","commenter_a":"I agree with them. Shame on Disney.","post_message":"23 former IT employees at Disney are preparing to fight back..."}]
