[{"comment_id":"10158574220485206","commenter_b":"Ur a racist #sitthefuckdow","commenter_a":"We cannot wait for a Trump presidency. #WeThePeople must rise now & take back America which has been stolen from us!!! Trump touched me a year ago. He reached inside me and touched my heart and built a patriotic fire that flows deep through my veins and has given me hope that we can save America from the elitist New World Order Puppet Masters who would end our freedoms forever God bless Donald Trump!","post_message":"It would be a rare revolt."},{"comment_id":"10153620969383352","commenter_b":"Girl people have no life!!!","commenter_a":"He's having a separate party for her idiots!!!","post_message":"CHRIS BROWN SKIPS ROYALTY'S FIRST BIRTHDAY PARTY TO BE IN MIAMI. SOURCE SAYS HE DIDN'T GET HER A GIFT OR HELP PAY FOR CHUCK E. CHEESE EITHER!"},{"comment_id":"2081524555405540","commenter_b":"SHUT THE F UP! People like you are the Cause!","commenter_a":"You are a complete fool. America needs to bring God back into our nation. Then senseless killings and hatred would cease. All life matters.","post_message":"Here are Lena Dunham's TWEETS about \"White Americans\" in the wake of Alton Sterling's death..."},{"comment_id":"602171783246943","commenter_b":"I think he is a prick he makeing the country he inn charge with killing off his own people as black. And look at what they saying on here about him he needs to send two b52 bombers and carpet bomb all these evil peope o. Here calling him names lol","commenter_a":"I'm ready!","post_message":"\"The American People must be willing to call Barack Obama what He is in order to Defeat Him\""},{"comment_id":"556876431104063","commenter_b":"Put a cap in her ass :-)","commenter_a":"I'll still bone her! Even with a mangled face! What's the point of the story?\"did you see her legs?","post_message":"The police state: before and after... The Free Thought Project.com (Y)"},{"comment_id":"573866436115635","commenter_b":"She'll stand before God. Wouldn't want to walk in her young shoes","commenter_a":"Jennifer who?","post_message":"She's the biggest actress in the world right now, and Jennifer Lawrence has made an absolutely sickening statement about Christians. This is enough for me to want to boycott her movies from now on."},{"comment_id":"10155148038011336","commenter_b":"Trump doesn't refute facts in any logical way. He doesn't present evidence to the contrary, just declares that anything negative about him is fake news. Does this not concern any of you?","commenter_a":"Funny how people have forgotten the numerous times Obama called @username out during speeches, press appearances, and other forums. But Trump doing the same thing is suddenly \"horrible\" and shocking...","post_message":"\"He has EVERY RIGHT to call them out.\" On \"FOX & Friends Weekend,\" Herman Cain discussed President Donald J. Trump's often contentious relationship with some in the mainstream media."}]
