[{"comment_id":"10153419431089024","commenter_b":"Strange? No. Normal. These two are NOT our Allies.","commenter_a":"they're called \"handlers\", making sure their government's contributions are used wisely.","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10155013190899726","commenter_b":"Yup she's a nobody!","commenter_a":"Yes precious snowflake because you won't be happy until abortion is a Live pay per view celebration #sick","post_message":"'This isn't working, this two-party system'"},{"comment_id":"913594125361987","commenter_b":"Go ahead vote for her! Stink up America some more you fools!","commenter_a":"She's right, we can't let a Republican in the White House. Vote Blue and support whichever candidate wins the Democratic nomination. I happen to think Hillary has a better chance of beating any Republican, but Bernie as our president would be awesome too.","post_message":"YES! Whether you're a Bernie or Hillary supporter, there's no denying the debate audience really loved Hillary's closing remarks. Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"848280508611132","commenter_b":"Bye bye illegal parasites. Free ride is over. Self Deport before you're kicked out kicking and screaming.","commenter_a":"Donald Trump is the man. It's time to rid America of career politicians, and put someone in the White House that genuinely loves their country.","post_message":"820,000 crimes committed by illegal immigrants, here in America. Guess what! NOT WHEN I AM YOUR PRESIDENT! I can assure you of that! We will BUILD THE WALL- and Mexico is going to pay for it!"},{"comment_id":"10153047823716336","commenter_b":"Out of the mouth of babe!","commenter_a":"Someone's gotta tell her!!","post_message":"\"Dear Mrs. Obama, Thank you for trying to make my school lunch better, but you have ruined Taco Tuesday.\""},{"comment_id":"10154512685084411","commenter_b":"No copy paste","commenter_a":"copy paste. This is what you do ? Be creative guys.","post_message":"The Big Mac is dead, long live the DonMac!"},{"comment_id":"10154995598416037","commenter_b":"Robert, have you heard of sanctuary cities? Do you know why thy are called that? If you are illegally here this is where you go. Now how many illegals do you think are in California? Hello","commenter_a":"Good luck to him. Would be nice to see Democrats lose those 55 electoral votes every election. Half the people there aren't even American anyways.","post_message":"“We believe the country is like a Titanic, and the election of Donald J. Trump is the equivalent of the Titanic hitting the iceberg.”"}]
