[{"comment_id":"10154304263504203","commenter_b":"Haha crooked Dems are feeling the Bern, bet rigging the system doesn't seem to nice now does it DWS? Trump is going to destroy Crooked Hillary in November","commenter_a":"Dear Bernie.....GET OUT.","post_message":"Berning bridges."},{"comment_id":"10153364221881336","commenter_b":"Hey, when you choose to try to make your family into some kind of viral internet sensation, be prepared for the backlash.","commenter_a":"Hahah I think it's cute","post_message":"Did these parents take their family photo shoot too far?"},{"comment_id":"10155990261480354","commenter_b":"Stupid Bitch","commenter_a":"She couldn't try to offer the woman comfort in her last moments on earth? This young woman is cold hearted.","post_message":"Caption under the controversial photo translates: “I went to do the rounds and this lady was dying so selfieeee.”"},{"comment_id":"784480358346621","commenter_b":"The whores knew what they went to Mr. Cosby room for money and sex. I say they didn't get pay they got laid .","commenter_a":"My lord there is a lot of racists here!","post_message":"We can only dream! Cheney masterminded a war based on lies to funnel $37 billion in no-bid contracts to his \"former\" defense contractor company, Halliburton. When will his time be up? Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153546186781162","commenter_b":"The disturbing replies to this is that people actually think just because she is a woman, she can hit whoever she wants and continue to escalate a fight. Doesn't matter who or what she is. You don't hit people period. Had she not come back in, hit him and continued this, there would have never been a problem.","commenter_a":"I'm all for not putting hands on a woman. But where's this equal opportunity draw the line at? She smacked the taste out dudes mouth. Don't start what you can't finish","post_message":"PANERA ATTACK: A Panera bread manager is fired after he was filmed punching a female employee in the head and knocking her to the ground. WATCH: @webpagelink (Warning: Graphic video)"},{"comment_id":"10154043300342577","commenter_b":"All women do!!","commenter_a":"is it just me, or has this woman got the most annoying voice in the world? I just wanna punch her in the face","post_message":"Hillary Clinton's Greatest Hits! Vol:1- infowars.com/show"},{"comment_id":"10154700098471323","commenter_b":"All talk of this being an exercise in protecting democracy is simply a smokescreen. This lady is a member of the privileged elite aiming to derail the Brexit we voted for by seeing it completely emasculated to the point where the status quo will be preserved. The bankers and fund managers will never allow ordinary people their freedom. Only the rich are allowed to be free.","commenter_a":"All MPs are Selfserving PARASITES .The People have VOTED DEAL WITH IT .And Start bye getting our Borders sortted and RIP UP ALL EU LAWS Because we never needed them .FACT .And Stop Foreign Aid.We carnt afford it.And Spend the money on the people that need it in the UK..","post_message":"\"Neither the British people nor parliament have, however, voted on what form that leaving should take, or on which fundamental rights will be removed as a result of leaving. Those are questions that can be decided only by our sovereign parliament.\""}]
