[{"comment_id":"747059155450198","commenter_b":"How would a little girl see a transgender's penis? In the female washroom, everyone uses a stall with a door that locks. The only way a little girl would see one is if a pervert walked in the washroom. A true transgender would not exposed himself unnecessarily.","commenter_a":"I don't think its a good idea. I'm not concerned with transgendered using the women's restrooms,. I'm concerned with a pedophile using the restroom to grab a child. Or a rapist using the opportunity to grab a woman. I don't know that either scenario will ever happen...but it could. When it comes to safety, I think we should make every effort to keep women and kids safe.","post_message":"ClashDaily.com"},{"comment_id":"1387674034582344","commenter_b":"@username if i had a girlfriend i probably would not watch porn, but women are picky and i am nothing special.","commenter_a":"BAN PORNOGRAPHY...simple. It is a debauched and at times cruel form of sex and at the moment is fully open to those low-lives whose brain thinks it's fully acceptable to either engage in such ridiculous practices or expect their partners to or inflict it on others. Of course this terrible crime on this poor girl was inflicted by a deviant but the role of watching pornography put fuel to the fire...BAN IT!!!!!!","post_message":"The man who held Elizabeth Smart captive when she was a teenager regularly looked at pornography, which \"just led to him raping me more,\" the now 28-year-old woman says in a new video."},{"comment_id":"10154450699361323","commenter_b":"Umm... because she's a woman!","commenter_a":".On what grounds does such a person NOT rather enter in the MALE-items?....","post_message":"\"It is unquestionably a sensitive and complicated issue and one that has arisen many times at the Olympics and other sporting competitions where it has been alleged that male athletes have attempted to compete as women or, in Caster Semenya’s case, that a woman has an intersex condition, which provides an alleged unfair advantage.\""},{"comment_id":"636098806550073","commenter_b":"#FuckDonaldTrump","commenter_a":"You people are celebrating this? He has not done anything to you. Anyone applauding a man loosing a fortune for standing up for his beliefs is soiling their own humanity. By ruining his life, you are staining your own soul. All of you are behaving much worse than anything you are accusing him of (falsely I might add). Those lambasting him are the ugly ones. I have seen much more vulgar behavior from the anti-trump crowd than anything that has been used as ammunition against him, true or not (most of it is false).","post_message":"The numbers say that Trump casinos, stores, and golf courses have suffered most."},{"comment_id":"10153362420896028","commenter_b":"I and many Americans clearly disagree.","commenter_a":"Obama: You are a historic disgrace. No President in US history has ever approached the safety of Americans with the level of smug indifference that you do. You are soft on Muslim terrorists and degrading to Christians and Jews. You golf through American beheadings and yawn away the deaths of Americans at Islamic hands. You have ZERO Moral Authority.And we look forward to reminding you of that until the last second you leave office. Signed, True Americans... :D","post_message":"UPDATE 5:45 p.m. PST: Our livestream has ended. \"I know that after so much war, many Americans are asking whether we are confronted by a cancer that has no immediate cure,\" he said. Read more: @webpagelink WATCH LIVE: President Obama to address nation on San Bernardino mass shooting from the Oval Office @webpagelink"},{"comment_id":"987929541300100","commenter_b":"You guys just don't know anything about Muslims! !!!! Wake up.America they will take over your land People are clapping for her for what????????","commenter_a":"Should be concerned about all Americans instead","post_message":"Watch: Bernie Sanders teaches Republicans a lesson on how to respect Muslim Americans and end racism in America."},{"comment_id":"10153203503306130","commenter_b":"Funny how people attack Obama's character then defend this guy, it's very revealing really.","commenter_a":"Donald Trump scares you because he'll take away all your free stuff! Donald Trump scares you because he believes in working hard to get what you need, what you want. He will fix America and you will continue to whine and cry about your \"entitlements\" being taken away! Suck it up and go to work America!","post_message":"See a map of the world through The Donald’s eyes."}]
