[{"comment_id":"10152683418148067","commenter_b":"Don't worry. You're 10 times better looking than this homely chick.","commenter_a":"I'm 20 and my biggest accomplishment is not setting the house on fire.","post_message":"While her peers are chatting about boys and clothes, this teen is texting the CEO she hired to run her growing business. @webpagelink"},{"comment_id":"10153848630809411","commenter_b":"About time someone stands against the crooked cops","commenter_a":"My wish is that these imagrants won their battle and that they rule in Europe as it were Europes wish that they rule in my country. :) Now its your turn.","post_message":"'Like a war'"},{"comment_id":"10153476026331509","commenter_b":"ladies ... let me increase ur chances looool","commenter_a":"Looks like I'll be dead earlier than I thought lol","post_message":"Being alone and feeling lonely increases your chances of early death by roughly 30%, researchers say. Simply being in the presence of others may not be enough: @webpagelink via CNN Health"},{"comment_id":"10153005489041770","commenter_b":"And who says this female is not a partisan hack?","commenter_a":"This woman is an enemy to our country.","post_message":"\"There’s nothing more important to me as a Jew to ensure Israel’s existence is there throughout our generations.\""},{"comment_id":"10153105313784203","commenter_b":"Speaking of Obama not attending a rally in France, how about Bush, Cheney, and other Conservatives not attending the 9/11 memorial in their own country @webpagelink","commenter_a":"Unlike the communists digging up Kathy Griffin and Margaret Cho, Jay is actually funny.","post_message":"Why the hell do Republicans love Jay Leno so much?"},{"comment_id":"10156667193450725","commenter_b":"Only Trump Bernie or Sanders will make it that way","commenter_a":"Please SC, get out and vote to save our country from turning into a 3rd World nation. We are counting on you today.","post_message":"South Carolina voters have the future of our country in their hands. VOTE now (today), and MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10153133818461491","commenter_b":"Feminazis are the worst. Impossible to be around.","commenter_a":"Lame. I support women and women rights. But, the so-called feminism movement is not attempting equal rights, rather, they think women are superior to men. Everything about the femisnism movement is ironic and does more harm than good.","post_message":"Stephen Colbert is a feminist."}]
