[{"comment_id":"10154336382586729","commenter_b":"What a bitch...","commenter_a":"Maybe she could watch it from her prison cell!","post_message":"This woman...SMH"},{"comment_id":"10152547170886636","commenter_b":"@username. ..rode hard...and put away wet..too bad she didn't stay away wet","commenter_a":"This is a stupid law. If it gets passed. For the reasons you idiot liberals think. It is only a crime if you are wearing it in the commission of a crime. Think about that for a moment. If they charge you with a felony. They will add on a misdemeanor for wearing a hoodie. And then run it all together. So basically it's a nothing law","post_message":"Wearing your hoodie in public could soon be illegal in the state of Oklahoma"},{"comment_id":"10155992640990354","commenter_b":"They are none good roll models..they don't need these women as anything but singers..and you need to make sure they are dressing like hos..cause thats what all little girls seem to want to dress like..it's to late anyway..all of us have allowed them to face a world thats gone insane..they wont be in a world like we had..it's over..they will have abortion..hate..sex that kills..and men cutting off their heads and men raping them...so keep worrying about music..clothes..fingernails..princesses..and cutey stuff...they are doomed...and we let it happen.","commenter_a":"Taylor Swift is a good role model. Myley Cyrus is NOT a good role model. Taylor Swift writes and sings her amazing hit songs. What does Mylie Cyrus do? Sing and not good at all. My girls love Taylor Swift!","post_message":"Which is worse: Kiss Kiss or Bang Bang?"},{"comment_id":"1131647630206805","commenter_b":"I know. He's been promoting terrorism all throughout his presidency. The liberals are dead set on destroying this country. Obama is'nt even a citizen of this country. All of his records are sealed.","commenter_a":"This pos along with the president who endorses cair need to be locked up or shipped off to a Muslim country where they won't have any problems getting along with their fellow Muslim brothers. Muslims commit more atrocities than any other religion in the world and she has the nerve to call our servicemen and women murderers. This organization is a terrorist group and should be disbanded and everyone of them deported!!!!","post_message":"This is guaranteed to be the most vile and despicable thing you see all day..."},{"comment_id":"1509765899325906","commenter_b":"Shut up bitch","commenter_a":"As much as i hate to see President Obama leave office, I can't wait. I can't wait to point out to my Republican friends that noone has knocked on your door and taken your guns, he did not declare himself a dictator and refuse to leave office and my personal favorite example of media driven paranoia......were you chipped??","post_message":"\"What EXACTLY has Obama ruined in this country?!?!\" Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153711983118445","commenter_b":"Better take a look in the mirror you ugly bitch.","commenter_a":"Trump is a pig","post_message":"#Pot Matters: Trump on Drugs"},{"comment_id":"10153513530884456","commenter_b":"Yeah right. @webpagelink","commenter_a":"I have learned through the years that you initially say what is in your heart. Her statement trying to brush away her post is BS and everyone including herself knows that. Her feelings will not change, she will simply do a better job of hiding them. The commission and the public should call for her resignation.","post_message":"An elected Montgomery County official has released a statement following a controversial post on Facebook, which has sparked outrage among Montgomery County leaders and citizens. @webpagelink"}]
