[{"comment_id":"10154933648690695","commenter_b":"Stay in your lane lady","commenter_a":"I keep saying this and I will say it again ... why arent people protesting their brothers killing each other every night? Where are the Black lives matter groups? Or is that just when it involves a white man or police officer because I'm confused. I'm pissed that this man can't even go out in Atlanta to celebrate his new job! Why arent more people mad about this???!!!! Please tell me. They should have been looking up to this man for having his priorities straight! #alllivesmatter #theviolencehastostop #getyourneighborinorder","post_message":"Mitchell Mormon Jr. was celebrating a new job when police say someone shot and killed him."},{"comment_id":"10153952900813984","commenter_b":"She should Benin jail!","commenter_a":"How many of those radical Islamic terrorist countries donated to the Hillary fund. She knows they did.","post_message":"Hillary thought she'd jump on the opportunity to steal some attention from the Republicans during the debate, but it did NOT go as planned. Critics immediately fired back and pointed out something hilarious... Is Hillary Clinton one of the last people you would ever want to become president?"},{"comment_id":"10153509665060950","commenter_b":"I'm sorry but that doesn't even sound right. The solution that they put the fetus in does not destroy it. If that was the case every placenta, product of conception, etc, would be destroyed! Most product/tissue that comes from one's body goes into some sort of formalin. And about them giving you back tissue/poc, that will never happen. I don't believe any hospital will be like oh here, you can have your 19 week demised fetus. It's not going to happen.. That's like saying you want your uterus when they take it out. Someone told you a load of crap if that is really what transpired.","commenter_a":"I find that hard to believe. They have protocols to follow when it comes to medical waste. Right? (I honestly believe they do)","post_message":"The woman claims as she screamed for the employee to stop, she could see the face of her child as it was flushed."},{"comment_id":"10154025018063812","commenter_b":"Haha ahhaha he started a few months early than G! We'll see u there chap!","commenter_a":"@username look at georgie's bf!","post_message":"Prince George attends his first day of nursery school: @webpagelink"},{"comment_id":"1596151633736175","commenter_b":"This is what happens when their is no understanding of the real threat. Neither Iran or North Korea pose as large a threat as Climate Change. Not belief, understanding.","commenter_a":"Climate change does not matter to me North Korea and Iran want to destroy us probably a more urgent matter?","post_message":"Twenty-one kids and climate scientist James Hansen sued the Obama administration to take more aggressive action on climate. As of Thursday, the climate-change-denying 45th president has inherited the case."},{"comment_id":"10154438030826336","commenter_b":"Fat lesbians...","commenter_a":"Disgusting that Chick Fil HITLER would laugh about genocide.","post_message":"Celebrate #CowAppreciationDay at Chick-fil-A!"},{"comment_id":"10155066009203493","commenter_b":"Yes that's correct and he's taking out costs that we don't own and can start getting our capital to be spent on a structure that works for AMERICA. As opposed to all of these illegal aliens. No matter what the color of the skin is. I am a dual resident to California and Texas. California is beautiful to look at. The government and legislation there is literally nauseating. Whomever hasn't the ability to actually see the the chaos and the self destruction that the literalistic mentality creates is beyond a stupidity that I can even fathom. I got pulled over for tint on my windows. It cost me over $800 after it was said and done. And the levies are less than desirable. The roads are along the same avenue. However you can get on welfare there with ease and pay for nothing. Citizen or not. And the politicians and ...","commenter_a":"Jerry Springer, I mean Jerry Brown is wasting 3.5 BILLION of our money on a bullet train to nowhere , wake up people ! We are sinking ! Our next fight : MAKE CALIFORNIA GREAT AGAIN!!!!!!","post_message":"BREAKING NEWS: It's a storm so fierce, rescuers need rescuing as a firetruck falls into a massive crater. @webpagelink The frightening scene captured by our cameras on I-15 at the Cajon Pass as the freeway crumbles beneath the engine."}]
