[{"comment_id":"10158098122215192","commenter_b":"The Crusades need to happen again in Europe @username. Run out the same invaders once more.","commenter_a":"They should add terrorism to those charges. Just because he is not a muslim, doesnt mean he isnt a terrorist. He sure comes off as a muslim in appearance though. Could be a muslim convert. FBI and other authorities just doesnt want to tell us!","post_message":"Esteban Santiago, 26, was charged with an act of violence at an international airport resulting in death - which carries a maximum punishment of execution."},{"comment_id":"10154618294282577","commenter_b":"hey bitch","commenter_a":"Fu","post_message":"First Lady Michelle Obama hit out at Republican nominee Donald Trump dismissing several of his comments at the recent presidential debate."},{"comment_id":"10150889945159999","commenter_b":"Another great day for Mr Trump and another day Mrs. Clinton lost. Meeting with the Mexican President first and finding common ground, while she stays home and refuses to speak to the American people. Mexico will pay for the wall. It is in their best interest to keep American thugs and murderers out of Mexico","commenter_a":"If the real Native Americans take up this mantra we're all in trouble. D","post_message":"The photo-op allowed Donald J. Trump to please his nativist base and humiliate Mexico at the same time, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"10155045059411037","commenter_b":"NO!!!!!!!!!!!!!","commenter_a":"O come on!! Not her too!!!!","post_message":"Carrie Fisher died Tuesday, and Debbie has been distraught since Carrie's emergency on Friday."},{"comment_id":"10153216157089087","commenter_b":"Screw Carly the bitch","commenter_a":"She hit the nail on the head with that statement. Problem is that people are so selfish, narcissistic, and apathetic that they don't really LOOK at a person until its too late. Did I mention lazy? Handle problems on the front end and there will be less on the back end. Do you want to elect Carly Fiorina? Or a woman with multiple murders under her belt? Or a hatemongerer? Not my first choice, but I still like her.","post_message":"“The reason I’m running for president is because I don’t want to see hope fading from anyone’s eyes,\" Carly Fiorina said. \"When someone is addicted, you watch them disappear before your eyes.\""},{"comment_id":"1788246978118850","commenter_b":"She is garbage.....","commenter_a":"Your a f*cking idiot. Please leave the country. I'll buy your ticket.","post_message":"During a show in Tampa, Amy Schumer brought an audience member on stage and quizzed him about his decision to vote for Donald J. Trump."},{"comment_id":"1457667300971814","commenter_b":"Or fire her!","commenter_a":"I am ashamed of NBC. Rather than addressing the crude and disputable comment by one of your employees, you just champion Chelsea. Do the right thing fire Katie Rich and issue and apology","post_message":"\"Barron Trump deserves the chance every child does - to be a kid.\""}]
