[{"comment_id":"1531453513826452","commenter_b":"Yep, Asian Men are Sexy!!","commenter_a":"Don't feel bad Asians .. Black people either play a criminal or a slave majority of the time .. And/or there's only one black character in the entire film or show lol ..","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"10154233578003352","commenter_b":"Right! Stupid lady. No man is worth that.","commenter_a":"Here we go again....... The Childs mother is dead, the side chick is going to Jail and the Man is sleeping with a New Woman TONIGHT. IJS.","post_message":"Woman Allegedly Murdered Boyfriend’s Baby Mother Because He Got Her A Valentine's Gift!"},{"comment_id":"1721472904763525","commenter_b":"^^^Yet he has no blood on his hands. Killary got that cure little nickname for a reason. Several, in fact.","commenter_a":"We can not and must not settle for Clinton or worse Drumpf. The time is near and we must let everyone know, that If Bernie somehow doesn't win the nomination, we want him to run as a independent so we can put him in the White House. Too many people registered as independent did not have a chance to vote in closed primaries, if they did Clinton would not be leading with pledged delegates. The Democratic Party must be aware that if Bernie runs as an independent there is no chance of Clinton winning anything, so if they don't want Drumpf in the White House they should start backing Bernie now. Because there is no way in hell I'll ever vote for Clinton.","post_message":"Here's the promise I made to you on day one of this campaign: Not only will I fight to protect the working families of this country, but we’re going to build a movement of millions of Americans who are prepared to stand up and fight back. We’re going to take this campaign directly to the people – in town meetings, door to door conversations, on street corners and in social media. Right now we are in Indiana. Tune in live here:"},{"comment_id":"1513700471996539","commenter_b":"I agree with a person that wants sources: he is right to ask for them. I did not give some simply because it would take too much time on my part to gather them (about the same it would take to do the research on CRS and FATCA's actual consequences). These are the keywords you want: FATCA CRS money laundering Nevada","commenter_a":"Jumping on the demonize Putin wagon eh, big surprise coming from vice. This has nothing to do with Putin, but I see his name a hundred times. Clearly this leak came from the u.s. How about the American banks laundering drug money, or the us govt selling weapons to drug cartels, or CIA plane crashing full of cocaine, or u.s Senator macconell s boat full of cocaine. Won't touch that, because that's actual truth, stay away from that. Just another propaganda outlet for the u.s government.","post_message":"The Panama Papers were a big deal."},{"comment_id":"10150862298954999","commenter_b":"Hillary is the devil!","commenter_a":"Anyone who supports Trump, the human pile of fecal matter, at this point is also a human pile of fecal matter. Vote Hillary, Johnson, Stein, or write in Jesus for all I care, but for the love of all that is good and holy, do not vote for Trump.","post_message":"“I’m not going to relax,\" Christine Quinn told Donald J. Trump's former campaign manager. \"Because we have a man running for president of the United States who made a gold star mother have to go on TV and cry in front of America. This isn’t about politics——\""},{"comment_id":"10156312558675354","commenter_b":"What a self serving heartless bitch.","commenter_a":"She is a good for NOTHING LIER ,GET RID OF HER FOREVER !!!!","post_message":"PARTY TIME!!!"},{"comment_id":"1015168871918572","commenter_b":"Build the wall","commenter_a":"Bring it on, freight train.","post_message":"RT U.S. Imam “Muslims Have The RIGHT To Take The Property Of FILTHY Christians And Jews” @webpagelink"}]
