[{"comment_id":"10156550497830354","commenter_b":"It would seem to me that either of the following words would properly describe this situation; Epic... Fail, Fell, Fall.","commenter_a":"Weedoing out the useless.","post_message":"Distracted walking while using an electronic device led one man to a deadly 60-foot fall off a San Diego cliff on Christmas Day..."},{"comment_id":"10154144133589060","commenter_b":"@username I agree. She's one big mess. But they will elect her. Everyone loves a winner","commenter_a":"Lets make no mistake - Hillary has LOTS and LOTS of experience with many, many, many male (and some woman) leaders.","post_message":"Sanders espouses bold positions; Clinton talks about the world leaders she has met"},{"comment_id":"10153322219778188","commenter_b":"@username......... you're making me hungry!!!!!!","commenter_a":"Should they be wearing ball caps and tennis shorts? You equip with the best available to protect yourself.","post_message":"Local police are now often seen equipped with the same gear and weapons you would see in a war zone. How did this happen? @webpagelink"},{"comment_id":"10153184314438984","commenter_b":"This lady is a disgrace to our country. She needs to retire or get voted out so she can get a real life.","commenter_a":"Nancy Pelosi needs to shut up. Who cares what she thinks. She knew what to expect of the speech, stay away. People were there to support the PM not to listen to her senseless sniveling.","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"1131664770254026","commenter_b":"You should try to get one. Aiden needs a service dog as well.","commenter_a":"@username you need one!","post_message":"✔ Laundry ✔ Dishes ✔ Shopping WATCH: This service dog in training is wowing the internet with all the ways she helps her chronically ill owner @webpagelink"},{"comment_id":"10153507125536749","commenter_b":"So tell me how more gun laws are going to stop criminals and terrorist? or are going to do the only thing you do best Lie ,cheat and screw Americans! @webpagelink","commenter_a":"TURCIA = TU Rusia CIA","post_message":"The Clean Power Plan is part of American leadership on climate change."},{"comment_id":"1721734318116068","commenter_b":"Ean hahaha","commenter_a":"Daniel Howe","post_message":""}]
