[{"comment_id":"517159568465923","commenter_b":"Actually Humphrey already had it wrapped up","commenter_a":"One of the saddest days in our nation's history. I have no doubt he would've won the nomination and the election. I was only 12, but remember it like it was yesterday.","post_message":"RFK's loss still being felt."},{"comment_id":"10153997171416486","commenter_b":"Fools don't you see that your woman are raped by Muslim refugees.Germany is now blocked Christian immigrants in their country.","commenter_a":"Some of the biggest idiots .You people are.","post_message":"\"...we think that this is our time as Catholics to be the Good Samaritan, regardless of what is expected of us from countries overseas.\""},{"comment_id":"939237909458566","commenter_b":"Time to put two carrier groups in the area and drop lots of big fire crackers and line up some goats for the departed cave rats....but that raghead POS that lives in the WHITEHOUSE will do nothing","commenter_a":"Uh....why????","post_message":"BREAKING NEWS:"},{"comment_id":"10156351239605093","commenter_b":"I just wish humans leave wild life alone.","commenter_a":"Signed ✔️","post_message":"Hanako lives alone in a barren, concrete enclosure without grass, trees, or a pool. Elephants are well-known for having complex social bonds, but it's unclear when Hanako has last seen another elephant."},{"comment_id":"1493513274041749","commenter_b":"what a whimp","commenter_a":"The people of france must be so hurt by the utterings a man who surrendered his citzenship because he refuses to pay french taxes and became a Russian citzen instead. Comrade Dipstick needs to shut up","post_message":"'France is populated by imbeciles making wine and stinky cheese for tourists'"},{"comment_id":"888129164543273","commenter_b":"Now before you say.... \"white women do the same things on their shows!!!\"","commenter_a":"Total waste of an article, this list would have certainly dropped down to less than 10 had the writer just said the entire basketball wives franchise, love and hip hop franchise and real housewives etc. instead of going by each show and each city. Dumb","post_message":"‘Sorority Sisters’ Isn’t Alone… 10 Reality Shows That Were A Bad Look For Black Women"},{"comment_id":"923712007745578","commenter_b":"They and we need to not bring these people into our countries they can not and will not adapt to our cultures. Has there not been enough proof of that yet.","commenter_a":"Then, 10 infidels need to hunt down the five assholes that did this and, repay them ten fold.","post_message":"A Florida College Student Is Brutally Attacked By Five Muslims On Patrol Enforcing Sharia Law."}]
