[{"comment_id":"742295419269809","commenter_b":"Herman. You read my mind. Agree completely!","commenter_a":"Banty McBotox seriously needs a reality check. Watching them as they form a circular firing squad is quite amusing. carry on.","post_message":"Please, Democrats. Keep repeating this. We want you to believe it with every fiber of your being. Don't change course. Don't learn your lesson. VIDEO!"},{"comment_id":"1025172404211543","commenter_b":"That old gal is an idiot.","commenter_a":"She must not love her freedom, or freedom of choice,","post_message":"FOLLOW US FOR UPDATES----> Freedom Daily This is Monica Ball she is a peace protestor outside of Bradley University in Peoria Illinois she hates the troops and doesn't care about her freedom..... Anyone see her? If so make sure you let her know where you stand. Show her some love @webpagelink"},{"comment_id":"10157597315525294","commenter_b":"if ya momma was playing she,d get fined too!!!","commenter_a":"As usual we find a way to lose!!!!","post_message":"Plugged in: Josh McCown and Cam Erving injured. Browns blow first half lead. If McCown can't go, who should QB this week against Miami??"},{"comment_id":"441930219322192","commenter_b":"Jail this pervert!","commenter_a":"Creep","post_message":"Conservatives are bending over backwards trying to defend the Duggars. Gross!"},{"comment_id":"10153923917206130","commenter_b":"No this is an attention seeker.Most women don't do this,especially at someone's wedding.","commenter_a":"Nothing says lets party more than a baby on a boob. :)","post_message":"Now THIS is a cool mom. 😎"},{"comment_id":"964624156930666","commenter_b":"Fat wives also can wear jeans ^_^","commenter_a":"He must have a really fat wife.","post_message":"Sounds reasonable :/"},{"comment_id":"10150603929279999","commenter_b":"Aren't they real women? What's a real woman, and who doesn't qualify ?","commenter_a":"Perhaps a more diverse group by race, ethnicity and cultural but alarmingly the same re: the skinny, young and sullen look of mannequins rather than real women...","post_message":"Meet the woman behind the unconventional beauty of today's most successful models."}]
