[{"comment_id":"10156924916305405","commenter_b":"Kathy ugly woman inside and out. I don't talk to commie vermin!!","commenter_a":"Hillary will become president amidst your persistent digging. Republicans cannot even nominate a republican, the party is a total eclipse. Trump vs Hillary is a mono party.","post_message":"\"I have turned over all my emails…I have been incredibly open about doing that.\" Yet Clinton deleted more than 31,000 emails."},{"comment_id":"10153615881104199","commenter_b":"Crazy lady!","commenter_a":"White trash at its finest","post_message":" knew what was going to happen. I wanted it on tape. Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off road first time. She got behind me a second time and then went to go around again. I let her have the road, called 911, reported her and her plate number I started phone video which was in a holder on dashboard hands free"},{"comment_id":"10153382960318717","commenter_b":"I used to not like Mr. Trump. Then started to like him...sort of. Now I dislike him again.","commenter_a":"He's a prick","post_message":"The New York Times is angry that Donald J. Trump mocked one of its reporters who has a physical disability: @webpagelink"},{"comment_id":"10153987793981320","commenter_b":"She is such a bimbo","commenter_a":"They have to be kidding! She is a joke! Tina Fey would do a better job!","post_message":"Sarah Palin has officially endorsed Donald Trump for President, but does it matter? Thoughts?"},{"comment_id":"10153540508969087","commenter_b":"@username BY THE WAY BITCH, YOU ARE THE LOSER!","commenter_a":"HOW ABOUT WHEN YOU CHEATED ON YOUR FIRST WIFE WITH MARLA MAPLES AND GOT HER PREGNANT, DUMPED YOUR EIFE, MARRIED MARLA, THEN DUMPED HER TOO!!","post_message":"\"I have a very good marriage now. Melania's fantastic,\" Donald J. Trump told Anderson Cooper at the CNN town hall in South Carolina. \"But I had two women that I never blamed because I worked so hard that my job came first. Maybe I work too hard. I was a better father than I was a husband. But I worked very, very hard and I love doing it.\""},{"comment_id":"10154281842244726","commenter_b":"We the people ? ? ? , , , . Give me a break, , , your pigs in a cesspool of immorality . Eat shit and die.","commenter_a":"Hypocrites","post_message":"The Left would call violent protests a ‘hate crime’ if roles were reversed."},{"comment_id":"1157175910989546","commenter_b":"Why would ANYBODY admit they were a Republican after this years parade of idiots, never mind vote for them?","commenter_a":"Assholes are use of SHIT !!!!","post_message":"Three Republican presidential candidates befriend a pastor who just went on stage and gave the most bizarre anti-gay speech ever."}]
