[{"comment_id":"10153410983047787","commenter_b":"@username, she is an idiot!","commenter_a":"You are an idiot. Climate change causes prostitution I have never heard such a stupid coment.","post_message":"Diversity is our nation’s greatest strength – our currency should reflect that. I’m so glad that the Treasury Department agrees! Which shero would you like to see on #TheNew10?"},{"comment_id":"1766381716934834","commenter_b":"How many drunk, stoned, high on drugs?","commenter_a":"If YOU DONT LIKE THE DECISION THEN GET THE HELL OUT OF AMERICA!!!!!","post_message":"Trump protest continues in Portland. Story: @webpagelink"},{"comment_id":"849791398402742","commenter_b":"Well you be sure to let all those people know where that magic land is where all those wonderful jobs are just growing on trees!","commenter_a":"I think this is great. People will no longer abuse welfare and will actually get up and find a job.","post_message":"Arizona's Legislature cut $4 million from the budget by reducing the maximum time you can be on welfare from 5 years to 1 year. Critics say that it will cut funding for those who need it and can't find jobs. Supporters say it will encourage more to get off welfare and find work. What do you think?"},{"comment_id":"944173558951399","commenter_b":"Every thing that man spoke is true. Leave lady","commenter_a":"Muslim people you live in the United States . Take that f--king towel off your face . Your weak minded people . With no chance to Evolve , your stupid religion holds you back . Just get out of are country . So we can bomb you and get rid of you ! .","post_message":"A Muslim woman confronted a female cashier about her flag pin... What happened next is going VIRAL!"},{"comment_id":"10152817930862169","commenter_b":"Because vaccines are no longer mandatory and with all the immigrants coming into the country are bringing the diseases and worse into America. And our govt doesn't give a crap.","commenter_a":"bandwagon idiocy","post_message":"Tonight on FRONTLINE: How the Disneyland measles outbreak has redrawn the battle lines in the bitter vaccine war. @webpagelink See it at 10/9c"},{"comment_id":"10152884212556636","commenter_b":"I'm just waiting for the first comment to blame the feminazi conspiracy to neuter us poor downtrodden beta males...","commenter_a":"That would be defined as sexist. People are supposed to be interviewed based on experience, education,","post_message":"'Can you wear more make up next time?'..."},{"comment_id":"738159049657328","commenter_b":"I think that crooked, lying, evil bitch needs to be in prison","commenter_a":"K, this bit%h is really out there! She and her cronies want total power! I pray that God stops her!","post_message":"WOW. People NEED to listen to Hillary's response when asked if an individual's right to bear arms is a constitutional right... Do you think Americans should be scared of a Hillary Clinton presidency?"}]
