[{"comment_id":"10153336853341518","commenter_b":"Remember these two Stones Tablets were made to represent apart from commandments written on them. The first Stone Tablet represented the sin bearin Messiah who was to be born in the Holy Land in Canaan and the second Stone Tablet was to represent Messiah the KING who who was to be born in the Holy Land hidden in Africa. These Stone Tablets are buried in different places in Africa and they are Two Shrines of my God.","commenter_a":"Who cares? This is the problem with Judaism today; the discussion is over minutiae and not substance. People are ignorant regarding the mitzvot and the Chief Rabbinate is concerning themselves with this?","post_message":"The Israeli Chief Rabbinate has cut the arches off the 10 Commandments. (We want your comments, but please first read the actual and complete article and not just the Facebook excerpt. See link below...) ------------ Shalom Bear has published \"Squaring the Circle\" on JewishPress.com. @webpagelink"},{"comment_id":"10154011395049778","commenter_b":"Women get less pay than men so I guess the bill won't be worth the face value","commenter_a":"I really couldn't careless as long as the bill still spends the same.","post_message":"A woman will appear on the $10 bill beginning in 2020, the Treasury Department said Wednesday."},{"comment_id":"10152909977971051","commenter_b":"I agree kaelyn! Things like this should be an eye for an eye with this sick twisted woman!!","commenter_a":"I think 9 yrs is not enough but she should get the same treatment she gave her son. Pour boiling water on her starve her. And trekking police she was a troubled child cuz of her crack head mother is a tactic to get out of more jail time!!! Pour baby I feel for the kids","post_message":"This woman was embarrassed by her 9-year-old son’s disability – so she decided to torture him."},{"comment_id":"1410720895627548","commenter_b":"DISMANTLE THE USELESS ORGANIZATION CUT THEIR FUNDING !MONEY TALKS,","commenter_a":"I hope so!","post_message":"Is Trump getting closer to supporting H.R. 1205, the 'American Sovereignty Restoration Act,' to cut ties with the UN?"},{"comment_id":"10153643322467434","commenter_b":"@username, I am an actress...I can rip you apart in iambic pentameter. Words do matter and so do definitions. In order for RAPE to occur, SEX has to happen...or it is considered MOLESTATION...","commenter_a":"Wow...semantics. Yes, Brock Turner DID have sexual relations...or else he couldn't have RAPED her. Sex is kind of a requirement...the headline does NOT say \"consensual\". #GoodGrief","post_message":"Just because the law smiled upon a man who had sex with an unconscious woman behind a dumpster doesn’t mean this group of angry, armed protesters will do the same."},{"comment_id":"1413505585331340","commenter_b":"YOU are ONE CRAZY WOMAN!!!! You just wait.... Trump is going to eat you alive during your debates! Trump/Pence2016!!!","commenter_a":"I think she has short circuited or blown a fuse.","post_message":"Hillary Clinton says Donald J. Trump is spreading fear. Thoughts?"},{"comment_id":"10153441853036336","commenter_b":"A real lady doesn't hit a man. Haha.","commenter_a":"So how many times did he need to get hit by her before protecting himself?? She swung first...","post_message":"A Florida State Seminoles Football quarterback has been dismissed from the team after police released shocking video footage that shows the freshman punching a woman."}]
