[{"comment_id":"10153060149946051","commenter_b":"Bitch boy Yu still white nd YUr trash to pussy","commenter_a":"Nothing like white/black trash argueing!","post_message":"When this woman heard what a couple parked near her said, she lost it."},{"comment_id":"10152869461365927","commenter_b":"\"kill another Fetus now, we don't like Children anyhow\"","commenter_a":"If Republicans supported an organization that murdered 90,000 black babies last year OMG. PP would be the worst place since the death camps of the Nazi's. But godless \"Demon\"crats like Hillary are the true racist as they use PP as a form of population control to keep black birth rates down and the black population under control. Dems have always been the party of hate(KKK) and division, they still are they have just convinced the black race that they are their friends and supporters,,,,, really","post_message":"Planned Parenthood Director of Research Melissa Farrell makes STARTLING statement about dissecting aborted babies ..."},{"comment_id":"662343567228023","commenter_b":"Great Woman!","commenter_a":"Wonderful tribute","post_message":"I wanted to highlight a few women in my life who inspire me every day. My wife, Columba, for her work to curb domestic violence and for so much more. My mother, Barbara, who has been a tireless advocate for literacy for a quarter century and Toni Jennings, who was a fantastic partner and Lt. Governor of Florida. These women are all examples of what can be achieved when we #LeanInTogether"},{"comment_id":"10154739927446037","commenter_b":"Sorry, women ARE voting...lol","commenter_a":"Most pictures are worth a measly thousand words. This one's worth millions. I would never advocate voting for a woman just because she's a woman, but this suggests that might not be a bad idea.","post_message":""},{"comment_id":"1019570198153414","commenter_b":"She's a Witch!","commenter_a":"@username is showing us what a doucebag he really is. Desperate for people to believe such utter non-sense. Common Sean, the real hurricane is YOU for posting this as you are so full of hot air. lol The truth is \"The Ads were pulled when the news of the hurricane was brought to life not the other way around\" Trying to politicize an unfortunate event is plain evil and you posting this stuff to draw attention in the wrong way is absolutely @username like.. SAD Americans being fool by you.","post_message":"Absolute ghouls."},{"comment_id":"502672606580208","commenter_b":"Skinny African","commenter_a":"Chris, paddy maybe?","post_message":"Yes, marijuana gives you the munchies...but it can also make you thinner. Learn more here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"1134554249934436","commenter_b":"Lol. She is a democrat. I hope you never wander into a voting booth","commenter_a":"We must stop the democrats and Hillarys war on women and the unborn!","post_message":"Every dollar goes toward making sure Donald J. Trump never becomes president."}]
