[{"comment_id":"595790673878859","commenter_b":"SHE NEEDED TO LEAVE!!!","commenter_a":"Ragheads go home .","post_message":"This Muslim woman walked into a salon and demanded all the men leave so she could remove her headscarf. It didn't take long for her to realize she had made a huge mistake and this hairdresser was not going to accommodate her entitled behavior."},{"comment_id":"1231385010209866","commenter_b":"Hahahahaha en fisica te salve de tu proyecto :v","commenter_a":"@username pa que se te de mejor química xD","post_message":"This is how they should teach chemistry in school. Video by Marie Skłodowska-Curie Actions."},{"comment_id":"10153190313663984","commenter_b":"Get the bitch away from our kids school's.","commenter_a":"She fills up on bananas! Hard to keep her out of the tree!","post_message":"Ouch - Michelle Obama will not be happy to hear this. Are you sick and tired of the Obamas telling us all how to live?"},{"comment_id":"800733213450589","commenter_b":"Islam was banned from the US in 1952, but Obama doesn't want you to know that nor does he respect or uphold the U.S. law. The immigration and Nationality Act passed June 27, 1952 revised the laws related to immigration and naturalization and nationality for the United States. The act, which became Public Law 414, established both the law and the intent of congress regarding the immigration of aliens to the U.S. and remain in effect today. Among the many issues it cover, one in particular found in Chapter 2 section 212, the prohibition of entry to the U.S. if the alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means\" This, by it's very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House. Islamic immigration to the U.S. ...","commenter_a":"No! God gave them a place to make there home! we do not have the space!","post_message":"Dalai Lama Warns America And Europe About Muslim Refugees... Obama Shocked If this isn't a sign that we should close our borders than I don't know what is. Do you think we should let Muslim refugees into America?"},{"comment_id":"10153808852885950","commenter_b":"She Looks Like A Damn Meth Whore!","commenter_a":"The doctor should have never inseminated an old hag like this, i am 40 and have suffered two losses and it's so hard to adopt and this psycho bitch was allowed to keep these kids...will her doctor keep doing this and letting her have more innocent babies... Poor baby May She RIP","post_message":"The 13-day-old died inside the van where her mother had left the children for 38 minutes while she visited a cellphone store, police say."},{"comment_id":"465830173607563","commenter_b":"Bossy bitch!","commenter_a":"Just ban Michelle.","post_message":"Should We Ban This Word To Please Michelle? Comment 'yes' or 'no'."},{"comment_id":"1813003575594431","commenter_b":"Us white people got to go yuh eard meh","commenter_a":"Were pray tell is this \"white rage\"? I am white and I feel no rage nor the desire to go out in public and carry signs around. I am not happy with where this country is going but I am not out all day every day protesting and tearing things up..oh wait a minute...I work all day.","post_message":"According to a new book by Emory historian Dr. Carol Anderson, many of the struggles faced by the African-American community are the result of \"white rage.\""}]
