[{"comment_id":"10154055081001770","commenter_b":"Those girls are too skinny. They need to put some meat on those bones before they could be sizzling","commenter_a":"sizzling...but was she a Hillary voter?","post_message":"Are these sizzling photos too much for the internet to handle?"},{"comment_id":"954543751267694","commenter_b":"First of all she did NOT hit the officer first.. He had his arm around her neck before she hit the arm he had wrapped around her throat.. That's a natural human reaction.. Before HE touched her, she was seated in a chair","commenter_a":"Does anyone notice the difference?","post_message":"#AssaultAtSpringValleyHigh: The SC school resource officer who slammed a teenaged girl on the floor was sued twice in federal court. Cops charged in fatal shootings reaches a nationwide high in 2015. #CoreyJones’ final phone calls may detail the moments before his fatal shooting. Check out these stories and more in today's edition of the NewsOne Top 5, our rundown of the viral stories that we are still talking about today. ------> @webpagelink"},{"comment_id":"624073524449893","commenter_b":"Leave Trump alone, We love him","commenter_a":"I love Fox News","post_message":"A Fox News reporter just left for this surprising reason. No matter we stand behind Fox News. Do you support Fox News?"},{"comment_id":"776537535808625","commenter_b":"Bitter and jealous? Suck an A.","commenter_a":"you look like you eat porridge for breakfast from a silver spoon, bro","post_message":"The waiters had a little fun with me this AM. #nailsforbreakfast"},{"comment_id":"1028860963867355","commenter_b":"The bitch needs to shut up all she knows how to do is ly","commenter_a":"Lying again","post_message":"Senator Elizabeth Warren went after Donald Trump, slamming him as a \"thin-skinned, racist bully\" and \"proven failure\" who is only \"qualified to be fraudster-in-chief.\" What do you think about her comments?"},{"comment_id":"10152610870925950","commenter_b":"And go on a global eradication war to execute 2 billion Muslims.","commenter_a":"AND; the 100,000 troops need to come from the Middle Eastern nations (not the U.S.)!","post_message":"According to a CIA insider, it would take 100,000 ground troops to effectively respond to ISIS."},{"comment_id":"10154190661067541","commenter_b":"Now that's an ugly women","commenter_a":"Bannon you are a lot better looking than that thing in the left.","post_message":"Steve Bannon has a doppelganger, and her name is Rosie O'Donnell."}]
