[{"comment_id":"1155777891187482","commenter_b":"Clear to me this woman is smarter than you will ever be.","commenter_a":"This woman is a mercenary. She has no morals, ethics or integrity. Just a few months ago when she was on Ted Cruz' team she was bashing Trump for all the things that she is now defending him. She would say just about anything for a buck.","post_message":"Reports about Kellyanne Conway are greatly exaggerated."},{"comment_id":"1858429714391337","commenter_b":"Canadian has no say. Go home","commenter_a":"He's a fat, ugly, ignorant pig. Hit the sty.","post_message":"Simply pathetic."},{"comment_id":"1766321223645256","commenter_b":"If you are gay why are you voting for Hillary when she wants to bring in millions of refugees that believe gays should be executed? If you are Black, why are you voting for Hillary when she defends Planned Parenthood and admires Margaret Sanger, who wanted to abort as many black babies as possible and exterminate the black race because they are like \"weeds.\" Most of those clinics are in Black neighborhoods. If you are a Woman, how can you vote for Hillary when she has buried all of Bill's rape victims under the rug. As an attorney, Hillary also defended the rapist of a 12-year old girl and laughed about it later. She plays the woman-card and acts entitled; implying that she deserves your vote merely because of her sex. How is that gender neutral? If you have are a Miner, Steelworker or have a Factory job, why are ...","commenter_a":"He did not say because of how they prey! This is Dem spin! KILLARY only is concerned with illegals and refugee''s Get that big dem base full of those needing your handouts!! Does not matter if some want to kill us Really our money, but once it get to DC it's their money!! Her motto should be just give me your I WILL MAKE THE DEMOCRATS!!!! This country is going down fast!! Bombings, beheading, murders etc And our president is worried about where someone should PEE !! Big world leader! OBAMA A TOTAL JOKE!!","post_message":"\"In this great nation, where our founders put a fundamental principle forward of religious freedom, [Donald J. Trump] says ban all Muslims, don't let certain people into our America because of how they pray.\" What do you think of Sen. Cory Booker's comments about Donald Trump at the #DNC?"},{"comment_id":"10153393648949228","commenter_b":"Actually, it's not normal for any woman to expose herself in public... feeding or not. It's quite self-centered.","commenter_a":"We all have to have something to complain about. It's like the news gives us one good story and the rest has to be bad. Give it a rest people. It's a normal mother instinct. LEAVE IT ALONE","post_message":"\"The mall told me it's perfectly fine, perfectly legal to breast-feed."},{"comment_id":"1096108950465633","commenter_b":"Let em go and then build a wall around it so they stay gone","commenter_a":"I say let them go. Pull all the military bases and all the government jobs and everything that belongs to the United States of America, and that includes the dollar. Then round up all of the other Racists and Dumb Shits who blame all their trouble on Obama when it was Bush and the Republican majoritys falt and send them down to the new nation of Texas where they can be happy ever after. The United States will be better for it too.","post_message":"The majority of Texas Trump supporters say they'd rather secede from the U.S. than live under Hillary Clinton as president. Do you feel the same way?"},{"comment_id":"1067364476710422","commenter_b":"She's a corrupt evil lying witch.","commenter_a":"I am for @username all the way!!! She is experienced. She knows how to negotiate with foreign countries. She is a fighter for women and children. She will negotiate without bombs. She will keep us safe. She is the calm not the storm that Donald Trump is.","post_message":"Our choice is between the most experienced, qualified candidate in decades—and a man who once started a Twitter war with Cher. hillaryclinton.com/makeaplan"},{"comment_id":"684212015075058","commenter_b":"@username Your mom was penetrated 3 or 4 times in one day by a cave dweller","commenter_a":"The source file was on whitehouse.gov when they originally released it. I downloaded it, simply opened it in photoshop, and all of the layers were still accessible. I was able to remove words, dates, signatures and even fragments of words where they pieced them together. It was a complete fumble on their part.","post_message":"I thought this was just a conspiracy theory. But it actually happened today. #fakepresident? Edit: No we have not been hijacked, and our mods have diverse political opinions. This was from AP and tons of other sources both left and right, definitely not fake. Heavy was the most neutral we could find."}]
