[{"comment_id":"10153060785906519","commenter_b":"Hillary covered up for him all those years in AR because she knew he was going to be president. The wives of predators who cover up for them are almost as guilty as the offender. She only cares about one thing...power.","commenter_a":"Y'all still talking about Clinton and consensual sex. Oh I get it Hillary's running, so y'all need to bring that up again. Never mind that it isn't relevant! Or are we blaming Hillary for a spouse that strays?","post_message":"\"The actual facts of the matter are that Bill Clinton was a serial abuser of working-class women–he had exploited that power differential even in Arkansas...\""},{"comment_id":"1017271401662888","commenter_b":"Yes","commenter_a":"Yes","post_message":"A University of Texas/Texas Tribune Poll found Texan voters say illegal immigration is the greatest threat to the U.S. -- DO YOU AGREE? Comment with YES or NO"},{"comment_id":"917667135033132","commenter_b":"The ignorance of this bitches statement is mind boggling","commenter_a":"No McDonald's worker anywhere on this planet deserves anything But minimum wage... How are you gonna demand a higher wage but you cant even make sure there are fries in the bag with my order.... Always giving people the wrong shit, no sauce, no straw... Please pull up and wait at our drive thro becuase we cant make fast food fast enough.... Get the fuck outta here... Give that extra money to doctors or something... They cant fuck up or your dead..... Absolutely ridiculous... Fast food isn't a damn Career.","post_message":""},{"comment_id":"10153358285837439","commenter_b":"Well done Mr. Abbott! He should go one step further and ban/kick out ALL Muslims from the great continent of Australia!","commenter_a":"I am Australian and applaud this action by Tony Abbot. He is a staunch Catholic Christian, and a former Rhodes scholar who from what I,ve heard him say is aware of the fascist doctrines of Islam. Why other Western leaders insist on appeasement of Islam and jihadists is incomprehensible. And more importantly, suicidal.","post_message":"@webpagelink"},{"comment_id":"10155505963450354","commenter_b":"What about the other female that had a hold of the flag?","commenter_a":"Brava patriot.","post_message":"“I was just going over there to pick up the flag off the ground.\""},{"comment_id":"10153726432609087","commenter_b":"I'll buy her plane ticket","commenter_a":"Bye","post_message":"“I know a lot of people have been threatening to do this, but I really will,” Lena Dunham said about moving to Canada if Donald Trump is elected president."},{"comment_id":"882098448492244","commenter_b":"I think this witch would sell her own Daughter for a ticket into the white House . How many Free rides will this traitor Promise to illegal criminals to get her to her socialist/communistic palace . ??????","commenter_a":"NO NO NO .DO NOT ELECT THIS PERSON.","post_message":"Hillary can't keep track of what she says!"}]
