[{"comment_id":"1353803527975767","commenter_b":"Lock there asses up!","commenter_a":"Lol look how racist worded the article. If it were a black victim and white captors u know this headline would of been completely different hahaha hypocritical libs","post_message":"Four teenagers tortured a person with disabilities and streamed the horrific attack on Facebook Live. WARNING: Graphic footage."},{"comment_id":"847139551999340","commenter_b":"You can get rid of your living organism in your uterus all you want to and in 5 states up to 40 weeks. . It still doesn't take away from the fact that you chose to end this living organisms life. Basic biology hun","commenter_a":"Question: A six week old BABY and a six week old EMBRYO are about to be thrown from a very tall building. You can only save one. Which one would you choose?","post_message":"Isn't this amazing?"},{"comment_id":"10153648380297293","commenter_b":"so that justifies a breach in privacy, Richard?","commenter_a":"Why keep nude images of yourself either on your device or your email inbox especially when you're a person of public interest. Stupidity warrants punishment.","post_message":"Jennifer Lawrence, Kate Upton, and Lea Michele were among the celebrities whose photos were said to be in the Celebgate dump."},{"comment_id":"10154037878823984","commenter_b":"Mr. Trump from the time he started his campaign he has always states that all the illegals have to go back have to go back to Mexico and Central America but yet he is one of the largest employers in the Real Estate , Casinos , Hotels, and Golf Courses business, has bragged about hiring illegals to including his contractors and subcontractors and they love him 1. did he use e-verification to see if he or his contractors and subs to see if they had a work permit or they are who they say they are. 2. you claim you want to help the veterans but your company hires more illegals than vets. 3. if you are serious about what you are campaigning on why not be the first to fire or dismiss the illegal aliens and fill those jobs with veterans lead by example and make America great again ...","commenter_a":"Yup another lifer. GET RID OF POLITICAL LIFERS THAT ARE FEATHER BEDDING Stump for Trump. You Go Don, Go Don all the way to the WHITE HOUSE.","post_message":"Wow. The governor of Iowa is actively working against one of the GOP's most popular presidential candidates. This is very unusual for the Iowa caucus... the Iowa governor must feel very strongly about this. Do you agree with the Iowa Gov.?"},{"comment_id":"853718148092962","commenter_b":"Hope she goes to prison.","commenter_a":"She should pay it back and go to jail","post_message":"So long, farewell..."},{"comment_id":"645079822349263","commenter_b":"Get Him the Hell out of the White House!!!!!","commenter_a":"Yeah no! Maybe make some toilet paper with his face on it","post_message":"Obama is trying change our countries money. He has absolutely no right to even consider this change. Do you think Obama deserves to have his face on a dollar bill?"},{"comment_id":"1333556083351913","commenter_b":"Javier judging by the other comment threads on this post it seems that very many people at least in the USA disagree that those activities are as gender neutral as you do.","commenter_a":"None of this shit is new 😐 Men have always been barbers, tap dancers, ballet dancers, shoe makers, basket weavers, bakers, or tailors. What the hell is wrong with any of this stuff? More importantly... WHY are you pointing this normal stuff out as if it is odd???","post_message":"This mom is encouraging boys to do what they love — no matter what people have to say."}]
