[{"comment_id":"10153951989588701","commenter_b":"Is not like police had other things to do","commenter_a":"Seriously a 38 year old man. Grow up","post_message":"The Camas Police Department said every available officer responded to the scene and canvassed the neighborhood looking for a suspect that didn't even exist."},{"comment_id":"600522876804958","commenter_b":"His girls should have to take the test and eat the same crap that Michelle thinks should be served at our schools. They are no more important than my kids are regardless who they are.","commenter_a":"Go ahead you slime bag daddy you","post_message":"Obama just waved this law for his daughters just because he can. No one is above the law. He is a criminal. Do you agree Obama is not above the law?"},{"comment_id":"1339247516091906","commenter_b":"America is turning vile and to bad for those who can't see it. If we keep it up we all lose .","commenter_a":"That is because it's a love fest! Everyone eventually comes around and loves Trump! He will be our greatest president in modern history! #trump2016","post_message":"Fox News host Megyn Kelly and Republican presidential candidate Donald J. Trump met in New York City on Wednesday morning."},{"comment_id":"10153279079299170","commenter_b":"With so many illnesses she has claimed, she must be unhealthy in the brain!! We already have one of those we don't need another one!!","commenter_a":"islamofascists have no respect for women, including Barry O. How could they have any respect for Hillary?","post_message":"If Hillary's such a precious little snowflake that Rand Paul is supposed to treat her with kid gloves, how is she supposed to deal with Putin, ISIS, The Norks, Iran, Asaad, Cuba, China, etc?"},{"comment_id":"953925358000546","commenter_b":"^^see Lisa....THAT'S good parenting.","commenter_a":"Thats messed up. what if the kid is actually struggling in school ? The dad should help him with homework and take his xbox away TEMPORARILY and see whats the kids real issue.","post_message":"This is a warning to all Xbox-playing students — do your homework!!!"},{"comment_id":"10153315723671336","commenter_b":"God's hands sand feet here on earth. Do it for the least of these","commenter_a":"This is an American.","post_message":"Since Christmas, 28-year-old Nic Martinez has traveled along the East Coast in a 25-foot trailer re-fitted as a barbershop. Along the way, he stops and cuts hair for veterans and the homeless. #ProudAmerican"},{"comment_id":"10153231905295047","commenter_b":"Obama must be stopped, or the Supreme Court is complicit in his wrongful actions.","commenter_a":"Qut saying it, DO IT.","post_message":"When President Obama circumvents Congress to rewrite the law, he's acting more like a king than a President. His illegal Executive overreach must be stopped. Sign and Share our Supreme Court brief to take action: @webpagelink"}]
