[{"comment_id":"10152903748937507","commenter_b":"Women really hate unborn children.","commenter_a":"Republicans really hate women!","post_message":"Sure, let's put pregnant women in jail. That sounds like an effective use of taxpayer dollars."},{"comment_id":"1719470721658124","commenter_b":"There illegals Zachary King..... there scared to death.....","commenter_a":"#Trump2016 TRUMP TRAIN","post_message":"Donald J. Trump has revealed how he would make Mexico pay for the wall. @webpagelink"},{"comment_id":"952967998077006","commenter_b":"Ahhhh...NOOOOOOO! AMERICA WILL NEVER!","commenter_a":"I'm paying less thanks obamacare!","post_message":"Republicans won't ever admit the success of Obamacare. As with all of the Presidents winning policies, they prefer to ignore facts and spread lies."},{"comment_id":"10155485619961509","commenter_b":"Hillary is. Not a woman! She is a devil!","commenter_a":"Trump: Nobody has more respect for women than me, believe me.... 20 mins to Hilary \"What a Nasty woman\", this clown is the biggest joke ever.","post_message":"Hillary Clinton, citing Bernie Sanders, calls Donald J. Trump \"the most dangerous person in modern history to have run for president.\" @webpagelink"},{"comment_id":"10154931623678812","commenter_b":"Everytime i check most people that like trump are not from the United States like yourself from Australia you moron","commenter_a":"Trump is much more liked on all social media then Clinton the media is clearly lying with these polls","post_message":"Hillary Clinton has vaulted to a double-digit advantage in the inaugural ABC News 2016 election tracking poll, boosted by broad disapproval of Donald J. Trump on two controversial issues: His treatment of women and his reluctance to endorse the election’s legitimacy."},{"comment_id":"10156259154010354","commenter_b":"Well, she won't have to worry so much about those tax breaks she was looking for in America. Now she has not reason to stay here.","commenter_a":"You hate America and Republicans, well, that's fine, we won't bother to see your movies.","post_message":"The America hater's new movie is hemorrhaging cash..."},{"comment_id":"10154251674646636","commenter_b":"O don't back benefit sanctions , however if your gonna make a living out of claiming benefits do the job right , simple as","commenter_a":"He has a sighted carer (his brother) who opens all his mail and should have done it. Obviously they had never requested braille correspondence. So on that aspect I (for once) can't fault the DSS however to not reinstate the money after they appealed the decision is just ridiculous.","post_message":"Awful"}]
