[{"comment_id":"10154448392979749","commenter_b":"You Muslims should pick your fight with our MPS who love starting wars to make their friends rich most English have no problem with the way you run your country and don't want to have war with you.","commenter_a":"The british people love very much to fight","post_message":"UK troops had been due to leave Afghanistan this year but will now have their mission extended into 2017."},{"comment_id":"846780482084872","commenter_b":"You are an ignorant woman.","commenter_a":"This is making me sick, and it. Is a sin in the eyes of the lord.","post_message":"The sailor's boyfriend was nervous he would \"screw it up and fall in the water or something.\""},{"comment_id":"10153646192799342","commenter_b":"I hope they have to serve every minute if those 60 years! What trash!","commenter_a":"So sad......","post_message":"The details of this case are just awful."},{"comment_id":"1259707477396285","commenter_b":"@username a much better caption for that sound","commenter_a":"Ali Finneran","post_message":"Once you hear it, you can’t un-hear it. It will be forever with you. Just a warning."},{"comment_id":"475322915991622","commenter_b":"Tell them to go home","commenter_a":"If they do not like it then go back where you came from","post_message":"Muslims on welfare have finally gone too far. Enough is enough. We need to let these Muslims know that they can't come into our country and force their beliefs on us. Do you support Muslim deportation?"},{"comment_id":"1305722922778581","commenter_b":"Sean Connolly","commenter_a":"Logan Laybolt","post_message":"Tian Tian the panda enjoyed the snow this morning! Video via the Smithsonian’s National Zoo and Conservation Biology Institute"},{"comment_id":"1528186400555160","commenter_b":"Thank you!","commenter_a":"THE FREEDOM OF THE PRESS is more basic to the RIGHTS of Americans than; the right to bear arms to defend. When the constitution was written it took two conventions to come up with ten amendments, BUT the first amendment was the same not changed and was readily adopted as others were still being picked and discussed. THE BILL OF RIGHTS Amendment I Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the PRESS; or the right of the people peaceably to assemble, and to petition the government for a redress of grievances","post_message":"Sean Hannity wants to destroy freedom of the press by punishing any news outlet that told the ugly truth about Donald Trump."}]
