[{"comment_id":"10153114063969091","commenter_b":"Why wouldn't they? Everyone is scared to stand up for something. Sodomites wont be around my kids cause they're not gonna be in the scouts.","commenter_a":"Just close the organization down no one is going to send There kids with the Boy Scout leader who is gay, it's another thing to gay people have screwed up","post_message":"BREAKING NEWS: Boy Scouts expected to announce that it will allow openly gay adult leaders."},{"comment_id":"607614076095838","commenter_b":"Sorry asshole there is noway you're going to get rid of Jesus, don't believe it, just keep doing what you're doing.","commenter_a":"No thank you I'll follow Jesus","post_message":"What Obama just said will have you quivering in your sheets. He has completely lost it. Spread this and show America his true intentions. Do you agree Obama is a threat to American life?"},{"comment_id":"10152801044501130","commenter_b":"Mandatory blow jobs. Vomit.","commenter_a":"During womens periods I'm all for mandatory blowjobs and or anal sex","post_message":"The tampon scene, as it’s known, marks an important point in the relationship between Christian Grey and Ana Steele—but it was apparently a little bit too much for an R rating."},{"comment_id":"10153724479619614","commenter_b":"i hope that women go to jail for murder","commenter_a":"This person is not even human. She is garbage","post_message":"A New York woman who once worked for child protective services is accused of throwing her newborn daughter to her death from a seventh-floor window. Officials say the baby, her umbilical cord still attached, was alive when she was tossed from the building. Jennifer Berry, 33, was charged Tuesday with second-degree murder and manslaughter. The medical examiner says the little girl died from multiple blunt-force injuries consistent with a fall. Read KTLA's story here: @webpagelink"},{"comment_id":"10153539858966943","commenter_b":"Remove them all and start over!!!' No one connected in anyway to ANY family ties whatsoever should be allowed to remain in office ... Mass re-election for both democrats and republicans!!! These people are not American to continue sabotaging the hard working people of America! I don't go to work to pay tax to support ILLEGAL aliens!!!!","commenter_a":"take care of our unemployed that you as president have created then you might leave a legacy dumbass","post_message":"Next week the U.S. Equal Employment Opportunity Commission will sign a deal with Ecuador to Ecuadorian nationals with information, guidance and access to education and training resources to help them exercise their workplace rights. SHARE if you think the federal government should help American workers - not foreign workers!"},{"comment_id":"10154251661998144","commenter_b":"arrest them all","commenter_a":"These people mare a direct threat to our Country and the good honest people in it! Anything goes to move them! I'm fed up!","post_message":"Anti-Trump protesters blocked off an ambulance because they were upset about President Trump's executive orders"},{"comment_id":"10153482643681130","commenter_b":"its on your page Joseph Zawistan","commenter_a":"\"Recent graduate initiated hunger strike\"....Lol. Why don't you use your degree and go get a fuckin.job and concentrate on future like you're supposed to do when you graduate.","post_message":"There's been a call for three top Student Senate leaders to resign, and a recent graduate initiated a hunger strike."}]
