[{"comment_id":"510102432525283","commenter_b":"What a dumbass!","commenter_a":"Well duh!!! I thought everyone knew the all you can eat means is all YOU, just you, only you, your stomach, can hold, I didn't realize that there were ppl stupid enough to think they could go into a restaurant and get the all you can eat whatever and feed 5 or 6 of your friends on YOUR all YOU can eat ....are ppl really out there that are that stupid ? If so for the love of God spay and neuter them so as to prevent them from bringing more ridiculously stupid ignorant ppl into this world","post_message":"The Denny's workers here repeatedly tried to explain the rules about all-you-can-eat-pancakes to this lady - and that's when she completely snapped."},{"comment_id":"1379882718715731","commenter_b":"Illiterate angry white trash lady. #sad","commenter_a":"They lost the election because they rigged their nomination and backed the wrong candidate","post_message":"TheBlaze's Dana Loesch explains why Democrats lost the election at the Conservative Political Action Conference (CPAC) 2017. See more Dana @ theblaze.com/dana-loesch"},{"comment_id":"1236456179783965","commenter_b":"I was expecting a stripper jump on a pole. Boring.","commenter_a":"Nice speech, all lies","post_message":"Melania Trump speaks at the Republican National Convention. Watch the full live stream here: @webpagelink"},{"comment_id":"1365265100160183","commenter_b":"Joseph, a woman gave birth to a shadow demon in (I think) season 2.","commenter_a":"Its time to give serious thought of graduating this show to the big screen. Follow the same playbook used by the James Bond.","post_message":"All good things must come to an end. Unfortunately, Game of Thrones is one of them."},{"comment_id":"10154735667991756","commenter_b":"Hamas is a disaster, as is Israel's abuse of Palestinians. There are hookworms on two sides, sucking the life-blood out of two peoples.","commenter_a":"Not my monkey, not my circus. Let's keep our dicks tucked away for now.","post_message":"Of 1.9 million Gazans, 1.4 million need humanitarian aid, and the United Nations directly helps 1.1 million. Robert Piper, the U.N.'s humanitarian coordinator for the Palestinian territories is worried Israel's charges against the two aid workers could exacerbate a large aid funding shortage."},{"comment_id":"1562788604027088","commenter_b":"Time to block all idiots. Bye @username.","commenter_a":"Ohh come on!! You cannot compare between them!!seriously!!! REAGAN!!!! And you want to know why? Because he was for \"We the people\"!! Hand down!!! Climton signed NAFTA.... Huge disaster for our country!!! And please do not get me started on Hillary!!!","post_message":"Who was the better president: Ronald Reagan or Bill Clinton?"},{"comment_id":"439236556264638","commenter_b":"Put her in prison where she belongs.","commenter_a":"We need Hillary this country can't survive another repuck in the white house","post_message":"This is INSANE..."}]
