[{"comment_id":"898024070290648","commenter_b":"Scum","commenter_a":"What an ass","post_message":"Never, really?! Last night's theater shooting was a preventable tragedy. Louisiana has the weakest gun laws in the country, and one of the highest rates of gun violence. Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153124217341051","commenter_b":"Ive seen women pulling crap everything from getting a friend to flirt to wrecking a guys car.Stupid and insecure....","commenter_a":"she was watching too much titanic","post_message":"This woman wanted to test her boyfriend's love for her by climbing over the railing on a cruise ship to see if he'd come to her rescue. You can probably guess how that worked out."},{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"10153176368084614","commenter_b":"Thug is synonymous with what these lil twits were singing in the video. What a bunch of racist filth!","commenter_a":"Lol funny.. Being all hard in their mini bus but when they meet one of us they be scared as hell","post_message":"A fraternity has shut down its University of Oklahoma chapter after a disturbing video showed members singing a racist chant that used the n-word. Sigma Alpha Epsilon suspended all of the Oklahoma chapter's members and threatened to ban those responsible for life. In the video, the students are heard chanting, will never be a n----- in SAE. You can hang him from a tree, but he'll never sign with me.\" the video is indeed of OU students, this behavior will not be tolerated and is contrary to all of our values. We are investigating,\" the university's president said in a statement. Read KTLA's story here: @webpagelink"},{"comment_id":"988198774550796","commenter_b":"shes to stupid to even understand her own thought process...","commenter_a":"Learn self control, honey. Everybody was quick to pull out phones and record it! I have great respect for the lady who was talking to her but I have more for the woman who got up and got her kid out if there. This was just stupid, shouldn't of happened. Looking for a pay day.","post_message":"“She wouldn’t leave when asked and became more agitated throwing a paper she grabbed from over the counter and pulling away from PennDOT officials.”"},{"comment_id":"10152521923501135","commenter_b":"The automakers would like to sell you a new vehicle sooner rather than later.","commenter_a":"Jennifer A. Thompson","post_message":"Do you really need to idle your car on days like today? We separate the facts from the myth. WHAT WE FOUND: @webpagelink"},{"comment_id":"799197103604200","commenter_b":"Um Death, that's a No fucking brainer","commenter_a":"He needs to be in front of a firing squad. He appears to be full of racial hatred.","post_message":"BREAKING: Black Lives Matters Shooter Kills 7, Wounds 30 [VIDEO]. Things are getting out of control. They need to be stopped. What do you think his punishment should be?"}]
