[{"comment_id":"821129384591070","commenter_b":"Big whoop. The lady could sneeze, and the Left would twist it into a controversy!","commenter_a":"Some people are just so unhappy in their own lives they have to try and make others just as miserable. Get over yourself and get a REAL life!","post_message":"Sarah Palin kicks off 2015 with a little controversy..."},{"comment_id":"10153679672384586","commenter_b":"Cunts","commenter_a":"Aaron Andrew Bantoft this made me physically cry","post_message":"Imagine being alive for just ONE day... And then THIS happens, just because you were born male :("},{"comment_id":"10155206212838984","commenter_b":"It could also be that the libertards Have No Taste! They don't know a Good Thing When They See It!","commenter_a":"For the life of me , I cannot understand the obsession all these small minded liberals have with the Trump family. Is it jealously ?? You can't possibly spend that much time dwelling on people you don't even know. Lots of people weren't happy with the Obama presidency or his crude wife, but they didn't spend every waking moment stalking them, writing fake news about them. At this point I have serious concerns that there is a mental health epidemic in this country as far too many people are consumed with hatred that has no true origin. Hopefully the pharmaceutical companies can keep up with the demand for medications that clearly need to be prescribed.","post_message":"Maybe now this reporter will think twice before attacking the first lady."},{"comment_id":"933455743437871","commenter_b":"no first do their time in prison then be deported","commenter_a":"They should be put in jail for years and when their old, deport them. That is if they make it in jail at all.","post_message":"ClashDaily.com"},{"comment_id":"832375306811018","commenter_b":"Fire her, is this what she is teaching kids? She need to teach the prisoners not the kids!","commenter_a":"What an idiot teacher, she should be suspended and never get anymore money !!","post_message":"An elementary school teacher has been suspended for having her 3rd-grade students write \"get well\" letters to an inmate convicted of killing a police officer. What would you do if your child was in that classroom?"},{"comment_id":"894537217346746","commenter_b":"These damn emails enough already. So how do you handle your text or emails? Do keep them or do you delete them? Keep that national security was a what risk BS! Are you being bombed or shot at by Islamic radicals are they taking over your house? What the hell you got a gun use help the military out by the way according to Trump is a mess a total disaster.Trump is a man with no plan.#you many people say that. Its true he himself can't put one concrete issue and have a real solution not one. He has all the best people no really the best people helping him according to him. Loom, doom, and gloom are the same people who will run this country because Trump won't have a voice. Those same so call good people will run this country really. They know he's not qualified. They will ...","commenter_a":"You are wrong if you think Trump is a Republican.Yes he is their candidate, but his views are far from it.","post_message":"This guy needs to wake up and smell the coffee."},{"comment_id":"10154119917737234","commenter_b":"Donna anther corrupt politician","commenter_a":"Marine Waters","post_message":"Who Will Be The Next DNC Chair? The Vote Is Happening Now"}]
