[{"comment_id":"484296231775664","commenter_b":"Leave alone!","commenter_a":"Our flag is fine the way it is. If you don't like you may leave. Be careful the door doesn't hit you in the butt on your way out.","post_message":"Men and women have died defending our flag, don't mess with it. Do you think the flag should be left alone?"},{"comment_id":"1113642245398693","commenter_b":"Ummm....which part of the Constitution did he need help reading again ? Seems like the Constitution is only good for these biggots when it works in their favor...picking and choosing again...no wonder this Country is in such shambles right now. Get over it Ted Cruz...get over it.","commenter_a":"The thing is, how do Republicans make the, \"follow the constitution\" argument after this? The constitution is clear, that the President must nominate a Supreme Court Justice when there is a vacancy. Where in the constitution does it set a time limit based on when the vacancy occurs?","post_message":"Senator Ted Cruz tweeted: \"Justice Scalia was an American hero. We owe it to him, & the Nation, for the Senate to ensure that the next President names his replacement.\""},{"comment_id":"1313680338710499","commenter_b":"Dam so the bitch anit leaving","commenter_a":"I thought she said she was leaving the United States and my subconscious was hoping it was for good Her support threw the election for Obama she's lost all credibility with me","post_message":"Oprah Winfrey just STUNNED her fans with this massive announcement about Donald Trump's victory. Nobody saw this coming..."},{"comment_id":"10153907295491680","commenter_b":"@username your a bitter woman","commenter_a":"Another classless moron that thinks sexual abuse is ok 👌 way to go Rush, you are pathetic","post_message":"\"Men brag,\" Rush Limbaugh said on his long-running radio show."},{"comment_id":"1600976746609844","commenter_b":"wow.Its a cartoon.It was cute.Do you take every comic strip so seriously? It wasnt make a bold political statement it was just a cute funny comic.Let people enjoy things..Not everything is sexist.This is what gives feminism a bad name.Some of you take things so literally and so seriously.Lighten up.","commenter_a":"Oh no... people, this was meant to be cute and funny, and even a little disturbing. Don't make it a sexist thing, please? Let it be what it is.","post_message":"5. Don't sweat it. The world is our runway every day."},{"comment_id":"1868770480033724","commenter_b":"Why, because the system is being drained my illegal aliens and the corrupt gov. Trump is fixing that open your eyes.","commenter_a":"This is as embarrassing as it can get. I wouldn't want to be president of a country if I had to think so negative about it. America is a great place to live but they r making some poorer each day. Cut Social Security, cut Medicare, cut insurance , cut food stamp, cut cut. Why?","post_message":"No. Words."},{"comment_id":"889430217827633","commenter_b":"@username alright Kim calm down!","commenter_a":"Ellie Metchette @username","post_message":"It will be in 2017 and here is the new teaser trailer. // Stranger Things"}]
