[{"comment_id":"1184007451677789","commenter_b":"She's a stupid bitch lieing douche","commenter_a":"Another liar that is living off of taxpayers, was educated off of the taxpayers dime by lying.","post_message":"Sen. Elizabeth \"Fauxcahontas\" Warren just decided to make a video bashing Donald J. Trump. That wasn't a surprise... however, the humiliating error in the video WAS. This shows just how bumbling the Democrats are... what a failure."},{"comment_id":"1158183760868319","commenter_b":"Ya cause your a pussy","commenter_a":"Thanks Delta & united Airlines for the great work. U got my business.","post_message":"Humane Society's president said Delta \"has set a great example.\" \"No airline should provide a get-away vehicle for the theft of Africa's wildlife by these killers.\""},{"comment_id":"483503378504622","commenter_b":"Wow!","commenter_a":"This proves someone built something and is no more proof of God than stepping in a cowpie.","post_message":"This Will Shut Their Mouths!!!!"},{"comment_id":"695333573948652","commenter_b":"@username you are wants wrong with lawless America. So let me ask you for a honest answer if that's possible for you. Is she doing this because she cares about USA or just to be first woman president? Honestly now!!!","commenter_a":"You're still more concerned with his words than you are her actions. It's sad that laws only apply to people on the right and left for that matter but not her. You hilliary supporters should be ashamed. How do you sleep at night.","post_message":"This is horrific. We cannot allow this man to become president."},{"comment_id":"923764651058995","commenter_b":"I've officially had it, I want Muslims in Muslim countries period not here...","commenter_a":"It was going to happen sooner or later. Might as well start it now.","post_message":"RT Khalilah Sabra: Muslims to Start a Revolution in America"},{"comment_id":"10153621323058812","commenter_b":"oh grow up Jennifer!","commenter_a":"the cop over reacted why would she have to put her cig out. Give her a fine and move on!","post_message":"At press conference, Sandra Bland's sister shared that she believes Sandra's arresting officer Brian Encinia was \"picking on her. Point blank, period.\" @webpagelink"},{"comment_id":"862688910457525","commenter_b":"Women is just as bad","commenter_a":"Ryan selfish & sexism pig!!!!","post_message":"Ryan Giggs' brother: 'He never even apologised'."}]
