[{"comment_id":"1297641203604631","commenter_b":"She makes me want to throw up.. A big rich phoney.","commenter_a":"She don't make me feel anything. Politics does not dictate what I feel","post_message":""},{"comment_id":"1686157554986660","commenter_b":"Smart woman only a dummy would join Scientology!!","commenter_a":"Kirstie, you are beautiful and such a smart woman! I applaud your endorsement of Donald Trump. Don't let your \"neighbors\" get you down.","post_message":"I am sure people in Hollywood are losing their minds right about now, but this actress is NOT backing down. Do you support Kirstie Alley's presidential pick?"},{"comment_id":"1362278090453725","commenter_b":"GET THE FUCK OUT!","commenter_a":"Send them home","post_message":"Muslims Banning 9/11 Memorial Because It’s Racist. They have no respect for the country we live in. Do you think they are the racists?"},{"comment_id":"10154648260827550","commenter_b":"That's fine! Welcome to all who want to come to America LEGALLY.","commenter_a":"Grew up in a farming family. I admired and respected the migrant workers' desire to find a better life here in the United States.","post_message":"Do you support a border wall with Mexico?"},{"comment_id":"1670513393170878","commenter_b":"Hey he's jerking with his shit as lube on his pussy","commenter_a":"Wow it takes like 15 or more cops to take down 1 fucking guys.....pussy as pigs","post_message":"The most glorious thing we have ever seen. #thinblueline Footage from moments ago when protestors shut down HWY 70 near our shop. When the SHTF make sure you have the right SH*T @webpagelink"},{"comment_id":"1058387144217814","commenter_b":"Best part, Karen, they probably don't even make minimum wage, if they're paid at all! Little Hitler Youth!","commenter_a":"Wowzer... I see the RNC interns are working through the weekend, copying and pasting their GOP talking points. Working hard to keep women, minorities, the poor, our LGBT brothers & sisters and immigrants under their jackboots 24/7. Shameful.","post_message":"It’s 2016. The days of dismissing the pay gap as a \"women's issue\" are over."},{"comment_id":"10153143993045329","commenter_b":"That poor girl would eat both of you.","commenter_a":"@username @username Gerard Bravo 'Plus size' is where it's at.","post_message":""}]
