[{"comment_id":"1820431918212382","commenter_b":"Stupid whore","commenter_a":"Good !!!!","post_message":"My, my, my..."},{"comment_id":"1544982162188475","commenter_b":"That's why I have your wife come over","commenter_a":"Yeah it changes kids it doesn't make them limp wristed liberals who don't know which gender they are . It makes them tuff , learn how to solve problems with others and gives them confidence!","post_message":"The more head blows a child sustained, the more changes were seen in their brain tissue, according to the study released Monday."},{"comment_id":"999816333406704","commenter_b":"It's rough being a single parent. But \"usually \"women have less resources to work with.","commenter_a":"We single fathers do just as much.","post_message":"When you talk about heroes and heroines, at the top of that list is the single moms of America."},{"comment_id":"560508577442430","commenter_b":"No, illegal immigrants might think it's OK, like they already do from FD up thinking.. Our economy isn't built to give, give, give to u and the illegals. So yeah, they should go back to mexico, duhhh.","commenter_a":"Ur working at a fn hotel of course there's no job security. Fn fools.. smh. Don't like ur current situation? Gtf off ur ass n change it stop waiting for someone else's hands out!! That's ppls problem now days, want everything handed to u without doing a fn thing to deserve it.","post_message":"\"How do I feel working for Trump? I'm an immigrant. It's a job...We don't have security.\""},{"comment_id":"10152556429696680","commenter_b":"I think it has been established that there would be a guest worker allocation. I am more concerned with the 40% of Illegals that are OVER stayed Visa workers! They come here on Visitor,Student and Work Visa's and don't leave when their term limit is up!! They are taking jobs from all levels of American workers!!","commenter_a":"In the meantime how about passing E-Verify and prison and fines to those employers that hire illegals??","post_message":"The House might have to delay consideration of its border security bill until the middle of February. @webpagelink"},{"comment_id":"10152829318850667","commenter_b":"I concur, Josh! Emimen is a great rapper and I don't recall him ever saying the word. I could be wrong, but I don't recall it. I don't like the word used by any person but it definitely should not be said by him.","commenter_a":"You have the right to say whatever you want. The question is, do you have enough respect for others to know you shouldn't?","post_message":"Rapper Chet Haze, the son of Oscar-winning actor Tom Hanks and actress Rita Wilson, says that the slur is part of hip-hop culture and that he has a right to say it."},{"comment_id":"10155881549390354","commenter_b":"Melissa ! That is fantastic but many women don't have a clue that she is like that ! Great Job Melissa ! You really showed her as she is !","commenter_a":"LET ME APOLOGIZE IN ADVANCE FOR THE STRONG LANGUAGE CONTENT OF THE FOLLOWING....HOWEVER, IT NEEDS TO GET OUT FOR THE NATION TO KNOW THE CHARACTER OF HILLARY BEYOND HER POLITICAL WORDS. PLEASE COPY AND PASTE SO OUR COUNTRY WILL NOT BE SUBJECTED TO HER CONTINUAL LACK OF RESPECT FOR HERSELF AS WELL AS EVERYONE ELSE........Subject: Broomstick one There it is ........book, chapter and page.......the real Hillary LOOK THESE UP IN THE BOOKS AND PAGE NUMBERS CITED IF YOU WISH... EIGHT QUOTES FROM DIFFERENT BOOKS her actual words (1) \"Where is the Godamn flag? I want the Godamn fucking flag up every morning at fucking sunrise. From the book \"Inside the White House\" by Ronald Kessler, p. 244 Hillary to staff at the Arkansas Governor's mansion on Labor Day 1991. (2) off! It's enough I have to see you shit-kickers every day! I'm not going to talk to you, too!! Just ...","post_message":"In an increasingly uncertain world, Americans want to be able to believe that their leaders are speaking honestly. That may be the one skill that Hillary can never learn."}]
