[{"comment_id":"1128841157202139","commenter_b":"You STUPID, STUPID WOMAN. NO we as you call us\" White Folks\"are NOT going to stop saying ALL LIVES MATTER!!!. That is in no way a RACIST comment. In fact it is a very true comment. Where does all this stupidity come from. You need to read your BIBLE & pray long & hard before you start spouting these comments.","commenter_a":"NOT THE SHARPEST KNIFE IN THE DRAWER !!!!!","post_message":""},{"comment_id":"1381800741835583","commenter_b":"Smart woman makes Hillary look like ??? 😝","commenter_a":"Obama couldn't stand her, or for that matter, none of the democrats.","post_message":"Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe.Let's go back to 1990, October 30th, 1990. It's in London, in Parliament, Margaret Thatcher, during a debate on rejecting a move toward a more closely united Europe."},{"comment_id":"1157727034250343","commenter_b":"Bunch of scum bags","commenter_a":"Spin, spin, spin, is that all we get today ?","post_message":"CBS journalist ADMITS it's their job to protect Hillary Clinton's past."},{"comment_id":"1038718286244949","commenter_b":"If you vote democrat you do not think much of your country? Do not ever forget BENGHAZI","commenter_a":"They are a bunch of lowlife communist wanting to destroy the country from the Left wing.","post_message":"ClashDaily.com"},{"comment_id":"10153476732498132","commenter_b":"She can't sing or act....","commenter_a":"She's still hotter than Kim Kardshian and she has talent.","post_message":"She must be a magician with double-sided tape. #MetGala"},{"comment_id":"10153278538947293","commenter_b":"Mark no I meant auto, you just need a permit which is easy to get in Oregon","commenter_a":"For most of you who have never heard of Roseburg and are assuming that ucc and \"Umpqua\" are gun free areas...1: You are ignorant.. 2: Umpqua isn't a city it's a forrest that spans way farther than Roseburg and 3: Off the top of my head, I can think of at least 10 public places (that are NOT shooting ranges) in a 5 mile radius of ucc that people normally goto to discharge their automatic weapons.","post_message":"A U.S. official has identified the gunman in the Oregon community college mass shooting as Chris Harper Mercer."},{"comment_id":"474902102708278","commenter_b":"Suck a dick cnn","commenter_a":"The Dallas Police Officers were not killed by BLM members, but by an ex military man who was involved with ISIS! Pay attention!!! So much hate in this state. Disgusting. Thankful for the police protection here and their professional attitude. Stay safe all !","post_message":"We're in Phoenix, Arizona, where residents have gathered at City Hall to protest police violence and the recent shootings in Minnesota and Louisiana. (Source: CBS 5 AZ - KPHO/KTVK)"}]
