[{"comment_id":"10153599310496037","commenter_b":"I feel sorry for his wife, NO money in the world is worth having to sleep beside that every night.","commenter_a":"Arise Trump Republicans! Demand that all the other lame Republicans running for the GOP nomination quit AND bow down to The Don.. and boycott Fox News.. (^^^) (y)","post_message":"Donald J. Trump, angered by Megyn Kelly's line of questioning during the GOP debate, later told CNN that she had \"blood coming out of her eyes, blood coming out of her wherever.\""},{"comment_id":"10153934719761813","commenter_b":"@username Go run to your safe space. The ACLU would rather cast legal immigrants in with the illegal Alien filth than make a distinction between legal immigrants and these animals. It's not \"harsh\", it's calling this scum exactly what they are.","commenter_a":"Hey ACLU, these animals aren't \"undocumented immigrants\", don't lump this filth in with those that have legally immigrated here. They are Illegal Aliens, not legal permanent residences, naturalized citizens or here on visas. They broke the law and should be treated like the criminals they are; detained, processed and then deported back to their home countries along with their families. This garbage SHOULD live in fear, be harassed and made to feel uncomfortable. They should be detained, when local LEO interact with them, and then turned over to ICE/CBP for deportation.","post_message":"Since Election Day, the ACLU has seen a renewed sense of urgency from hundreds of thousands of Americans to protect civil liberties. One of our top priorities is ensuring that our communities don’t fall under siege in service of Trump’s quest to deport undocumented immigrants. To carry out his mass deportation scheme, Trump would have to cast his dragnet far deeper into American communities. Even if massive taxpayer dollars could be diverted to do so as a practical matter, the effort will erode the civil liberties of all. Millions of people who live and work along our nation's borders—from New York to Arizona, Washington State to Texas—are already living in increasingly militarized areas where they are stopped, harassed and treated in ways the U.S. Constitution does not permit. Read more about the work already in progress to ensure people’s rights are protected in border communities @webpagelink"},{"comment_id":"1720347271558389","commenter_b":"What a pathetic slut !!!!!!!","commenter_a":"Just another Wacko;showing her ignorance.","post_message":""},{"comment_id":"1264161686965709","commenter_b":"Sounds like the brides need to chill the hell out lol i would rather go on a awesome honeymoon then spend that kinda money just to walk to a isle... But that's just me and I'm a very different kinda women.","commenter_a":"Retarded....","post_message":"And about $16,000 of that is for the venue alone... STORY: @webpagelink"},{"comment_id":"961399343937315","commenter_b":"Polls mean nothing, Remember Reagan! Go Trump!","commenter_a":"Are you sure it is Cruz and all the lies he told and putting the blame on others like Obama well I am not there is others was ways to do it like the Gop and the liberal party L","post_message":"\"Ted Cruz SEVERELY CUTS Trump's national lead from 18% to 3% in ONE MONTH!\" Let's go, #CruzCrew!"},{"comment_id":"10154268012211336","commenter_b":"HURRY UP AND OD, MAKE AMERICA PROUD, FIDDY THENTS.","commenter_a":"50 cent. Ironically, that's also what his career is worth.","post_message":"In a video posted on Instagram, 50 Cent confronts a young man as he pushes a cleaning cart through the terminal and accuses him of appearing to be high on drugs."},{"comment_id":"1661010187498580","commenter_b":"Don't forget Texas borders!","commenter_a":"Focus now on what is at hand Mr. Trump. Put an end to ISIS, erect that wall, and focus on Florida and Canadian borders, lastly boost our economy. You have mentioned these 3 things before which garnered my attention, then my vote. Just give more ways of getting this done. Oh, hate to throw this in but there may be a few executive orders that need immediate attention! TRUMP 2016!","post_message":"Remember, I am self-funding my campaign, the only one in either party. I'm not controlled by lobbyists or special interests-only the U.S.A.!"}]
