[{"comment_id":"10153243017991336","commenter_b":"Thjey Used to Hang/Lynch MF Niggerrs like that before !!!!!! Where is the Klan !!!!!","commenter_a":"and Black people want respect....frigen Animals","post_message":"UPDATE: A third suspect has now been arrested after the shooting prompted a statewide manhunt. The suspects accused of killing two Mississippi police officers in the line of duty were reportedly arrested early this morning."},{"comment_id":"1049402575096281","commenter_b":"Talking about slavery isn't race-baiting. It's American history. Also, I didn't hear you mention the part about women's rights.... Did you also mean gender-baiting? If not, maybe you are the one stuck on race...","commenter_a":"America was great when americans had pride in your country instead of some fatherless minion trying to tear it apart to serve his race baiting tv program...","post_message":"“Make America Great Again” begs the question: when exactly was America great?"},{"comment_id":"10156088559505294","commenter_b":"In my opinion, the collarbone issue and sleeveless tops or dresses are a bit over the top. The women in most offices I've worked at wore sleeveless dresses and tops that were tasteful and appropriate. Even the women news anchors wear tasteful sleeveless outfits. I don't see a problem with that. I do however agree a dress code should be in place for kids in school. When they get out in the real world, there are rules, and they have to be followed. 48-50 years ago, we had to wear skirts or dresses that touched the floor if kneeled down. If it didn't touch the floor, we had to change. The guys had to wear belts. If they didn't have a belt, they had to pay 50 cents for a piece of masking tape with the word belt on it and tape it to their pants, and they better have ...","commenter_a":"I say all schools should have a dress code and make sure all students adhere to it. It teaches them to accept things in life their not happy about, but rules must be followed.","post_message":"It's back to school time, and we're hearing more stories about dress code violations. Students at one school in Chicago are protesting a rule that they wear only shirts and dresses with sleeves. Click below for more, and tell us: Are dress codes these days fair? Unfair? Do they go too far?"},{"comment_id":"10153341904559170","commenter_b":"And why haven't you taken responsibility for your actions?","commenter_a":"And why haven't you solved your people's problems yet, Herm? Too busy slangin pizzas and tap dancing for white folks?","post_message":"Deplorable."},{"comment_id":"10153497941541130","commenter_b":"Exactly, because feminism is about equality","commenter_a":"The funny thing is, if the ad said men are preferred, the women would be yelling sexism. Women are preferred? Sexism.","post_message":"\"The position requires filling in the responsibilities of a receptionist, so female candidates are preferred.\""},{"comment_id":"1864825540399867","commenter_b":"A few years prior: \"did you see the her sleeveless dress?! THE FIRST LADY HAS NO CLASS!\"","commenter_a":"I'll never get over our \"president\" saying he grabs women by the pussies and his supporters just shrugging their shoulders over it","post_message":"Here are five reasons why Trump is the opposite of a Christian. Special thanks to Cindi Brady. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152577498117623","commenter_b":"Just. ..whatever you do....please don't refer to her as female,","commenter_a":"I couldn't care less who marries whom, who lives with whom, who bangs whom...my question is. .how did that goofy masochistic idiot find 4 women dumb enough to want to be involved with him.","post_message":"A big announcement for the world's highest-profile polygamist. Kody Brown, of TLC's \"Sister Wives,\" has divorced his first wife in order to marry his fourth..."}]
