[{"comment_id":"1262054097174477","commenter_b":"Ann coulter is a real bitch period","commenter_a":"You are one Bitter woman and no one in your life to love or who loves you. I know being 52 is hard but please dont take out your bitterness on other people. They are passionate in their believes. Let them be and go find yourself a man. it will help I promise.","post_message":"Controversial conservative figure Ann Coulter took to Twitter on Thursday, attacking protesters who continue to reject president-elect Donald J. Trump ."},{"comment_id":"10152743535041973","commenter_b":"Women don't wreck things? You should've seen what my first wife did to the cable box!","commenter_a":"Sounds like teenagers at play.","post_message":"Eleven large boulders had been dug out of a steep bank below the trail and pushed down an embankment creating unstable soil, which is vulnerable to erosion from winter rains."},{"comment_id":"860254627375604","commenter_b":"So their religion allows that then ? Bunch of fucking cowards .","commenter_a":"Time to nuke the FILTH........when will the uk and America finally stop bowing down to this scum","post_message":"Some women have been forced to seek hospital treatment after violent sexual encounters"},{"comment_id":"1420083668051377","commenter_b":"Oh shes a female.. whoops","commenter_a":"Muslims r like a football team. The radicals /terrorist r the strikers. The extremists r the midfielders who feed the radicals. The defenders r the moderate Muslims who create diversions, deflect, defend and save Islam from legitimate criticisms n any accusations. They work as a team though they create the perception that the defenders have nothing to do with the strikers. The Liberals r the goalies who jump in when the situation gets worse with statements like Islam is a religion of peace @ De Joe Int'l ur comment had to be repeated.","post_message":"'We march through the night to cut and behead... Allahu Akbar'"},{"comment_id":"10152995075029342","commenter_b":"A lot of women think they have to \"eat for two\" which they don't and that gets out of hand.","commenter_a":"People will never be happy. If a woman gains 100 lbs during pregnancy, people will \"OMG THATS SO UNHEALTHY! \" BUT, someone who is healthy and in shape, people are still gonna have a problem with it. What I think it is, alot of women get extremely fat and think it's ok. They use pregnancy as an excuse to over eat. This woman CHOSE to stay fit and there is nothing wrong with that. Kudos to her!","post_message":"Sarah Stage, the internet-famous pregnant model, finally gave birth on Tuesday to an unexpectedly large baby boy:"},{"comment_id":"1923125384575450","commenter_b":"All of them are nasty ass bitches","commenter_a":"These trump people are so ridiculous they would spin a shit sandwich Trump fed them by claiming it's full of protein because of the nutz in it","post_message":"LOL! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10158365855655500","commenter_b":"RIP Carrie Fisher.","commenter_a":"Who cares don't watch, pops that's four words.","post_message":"Fashion, Beats and Bling are WFLA Lila Gross picks. What are your three words to describe the Oscars?"}]
