[{"comment_id":"10153091950239205","commenter_b":"IF YOU'RE ILLEGAL ALIENS IN AMERICA, THEN YOU HAVE NO BUSINESS HERE, JUST LIKE MEXICO TREATS AMERICANS! PEOPLE WHO WANT TO COME HERE LEGALLY ARE WELCOMED.","commenter_a":"The mexican solution (Donald Hitler )","post_message":"Donald J. Trump's detailed and foolish immigration plan explained."},{"comment_id":"1780142445541305","commenter_b":"Lmao","commenter_a":"What in the actual fuck","post_message":"Punching White Woman After Yelling Hate White People Not Hate Crime, Judge Rules"},{"comment_id":"10152865807076051","commenter_b":"This was set up by this girl and her friends - she made sure her friend was there with the video going b4 she hit the other girl-she needs to be put away for a long time and have her sorry ass beat in prison and see what a REAL asskicking is. I hope the victim doesn't get scared and not proceed with the charges.","commenter_a":"we can thank our president and people like al sharpton for all of this they have done as much as possible to entice race wars!!!","post_message":"A girl was at the park with her little brother when all of a sudden they were attacked. The little boy tried to stop the beating – but that just drew him into the line of fire."},{"comment_id":"10153270679648984","commenter_b":"Get rid of them","commenter_a":"Didn't look bcz I don't care much for trash","post_message":"Holy cow, I did not see this coming! After so many years lurking in the shadows!"},{"comment_id":"10155180907040649","commenter_b":"@username You are right but the other way around Soros running Obama and Hillary. They all need to go. God be with us all. Trump needs us more now than ever. Pray people and I mean pray as hard and often as you can. We will also fight them tooth and nail if need be and its looks like we are going to have to. Just stay awake, stand up no giving up and no giving in, we will not be taken down and we will win.","commenter_a":"They're rioters, not protesters. Well paid radical left-wing thugs. Call it like it is...and find out who's backing these people.","post_message":"Question of the Day: Do you think President Barack Obama and Hillary Clinton should condemn the violent left-wing protesters?"},{"comment_id":"10153013352396336","commenter_b":"Once again, an illegal alien!","commenter_a":"sounds like sabo tage to me. maybe even terroristic.","post_message":"\"A brush of death definitely came over me.\" – passenger Joel Bingham As more details emerge in a California train derailment that left dozens injured, investigators say the truck involved was not stuck on the tracks."},{"comment_id":"10155832964064062","commenter_b":"But you're gonna pay for that wall?? Here's some facts no fake or false ones where are you getting your info?? Russia? @webpagelink @webpagelink And if you make that much good for you hire trumps tax attorney trump hasn't paid for taxes you're crying about in 20 years, It'll help offset the insurance cost. I'm sure you can afford it.. And again democracy is majority of the vote as for the illegitimate vote why don't you believe the fact it was tampered with to make trump win? Guess 2+2 never equals 4 ..he won with little more than 25% of actual registered voters now tell me how that works?? As for God's being in government it's expressly written to be kept out by our founding fathers ..called separation of church and state.","commenter_a":"I feel sorry for the people who actually believe in him. They need God in their lives, seems as nothing in this earth can convince them they are being screwed lied to and alienating half of the world. Keep drinking that kool aid let's see what shambles we are left in.","post_message":"President-elect Donald Trump defended a plan this morning that would see the U.S. initially pay for a border wall with Mexico and be reimbursed at a later date."}]
