[{"comment_id":"10153135798986323","commenter_b":"oh no Claire Leivers you are being invaded by more vikings!","commenter_a":"Martin Theander ...thoughts ?","post_message":"A bridge too far?"},{"comment_id":"1015490965174099","commenter_b":"It takes a woman to clean up a big mess! I think she can do this!","commenter_a":"As usual, I am sure this is Not a accurate statement, as you have to factor in suicide and accidental shootings.","post_message":"Since the last #DemDebate, nearly 3,000 people have died from gun violence in the United States. It's time to act."},{"comment_id":"10153134315811336","commenter_b":"I don't believe a word she says along with that piece of trash ruining our country.","commenter_a":"Would that be illegal voters or the type that is human scum?","post_message":"Clinton's goal, according to two people close to her organization, is to make her second run for The White House more about voters and less about herself."},{"comment_id":"954144534678601","commenter_b":"Legal immigrants are not citizens so they do not have the right to vote! Educate yourself @username","commenter_a":"So the answer is to let 8 million non tax paying illegal immigrants vote so they can continue to collect government aid. Nice way to F the country up more you idiots.","post_message":"Obama has responded to Trump's hateful rhetoric the best way possible."},{"comment_id":"10153572018825695","commenter_b":"Yeah, it's like a 10 hour trip from here.","commenter_a":"@username we need to plan a trip there and check this out. Me you and Jason Snyder","post_message":"TRENDING: One lucky woman discovered the fifth largest diamond ever found at an Arkansas state park. @webpagelink"},{"comment_id":"1764590997115642","commenter_b":"Melanie can say she wrote her speech speaks what pea brain she have.","commenter_a":"Maybe because she copied it down in her own handwriting she THINKS she wrote it!","post_message":"WOW – Melania Trump’s plagiarism scandal just got even more interesting... Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"998201713572910","commenter_b":"Don't stop there. Get the rest of the scum","commenter_a":"How sad....","post_message":"Islamic State's chief singer-songwriter has been killed in an airstrike in Syria"}]
