[{"comment_id":"10153071601427434","commenter_b":"Some black women are hot","commenter_a":"You KNOW it was provable, terrible, and criminal when the nearly all white, all male jury found him guilty. Even they were horrified enough.","post_message":"A jury has found Daniel Holtzclaw guilty on 18 of the 36 charges he faced for allegedly assaulting at least 13 black women. He faces up to 263 years in prison."},{"comment_id":"995637910477067","commenter_b":"HATE this hypocrisy. It's perfectly acceptable to tell a skinny woman to eat a hamburger or something, but if that woman then responds with \"eat a salad\", she's seen as a cruel bitch. Hate it!","commenter_a":"Prefer Pink any day to those anoreic coat-hangers.","post_message":"We love this tweet from P!nk about how you don't need a \"perfect\" body to be happy. <3"},{"comment_id":"10152949847416615","commenter_b":"A job well done champ!!","commenter_a":"I need some of that cashola","post_message":"The New Castle Police Department says K9 Champ was instrumental in locating the $15K that was hidden throughout the residence..."},{"comment_id":"697839387073306","commenter_b":"She should have been arrested months ago!!!! Arrest her now and put her away for good!","commenter_a":"Our Justice Department is corrupt. They will not take appropriate action.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"},{"comment_id":"866874116779101","commenter_b":"who voted that fugly bitch in ?","commenter_a":"Because she's batshit crazy","post_message":"Watch this! I guarantee it's the STUPIDEST thing you hear all weekend..."},{"comment_id":"10154025197726717","commenter_b":"She leaked information about innocent people being murdered!!! I see nothing wrong with that!!!","commenter_a":"Fuck her, she leaked secrets. It's against the law, doesn't matter how you identify or what's between your legs","post_message":"Manning recently asked President Obama to commute her sentence, and supporters worry what a Trump presidency will mean for her."},{"comment_id":"876377039127570","commenter_b":"Hopefully the \"treatment\" is the same pain & suffering the little girls had to endure","commenter_a":"There is sex offender treatment in prison?","post_message":"Nicole Vaisey, 26, and her boyfriend, 40-year-old Stephen Howells, admitted that they kidnapped the two Amish girls."}]
