[{"comment_id":"10153243499636336","commenter_b":"We definitely need a Godly man in the White House. I thank God for him.","commenter_a":"Amen, Dr. Ben!","post_message":"Did you know? Presidential candidate Dr. Ben Carson, a retired neurosurgeon, revealed on Fox & Friends this morning why he prayed before every surgery."},{"comment_id":"10152898071811336","commenter_b":"illegal aliens no doubt !","commenter_a":"Are you kidding me, do parents have any responsibly any more.","post_message":"The nation's second-largest school district is eyeing a move to offer dinner to students at every school."},{"comment_id":"1529103134057563","commenter_b":"She should go to hell!!!!","commenter_a":"She should think before she speaks good about Obama and his laws","post_message":"Democratic presidential candidate Hillary Clinton says she supports President Obama a 100% \"in his fulfilling his constitutional duty to send a nominee for the court to the Senate.\" How do you feel about this?"},{"comment_id":"10153866703120575","commenter_b":"Yeah she has hate written all over her face. Smug bitch","commenter_a":"Megyn's dislike of Trump is obvious.,and a bit over the top, clouding her Demeanor, Neutrality, and Professionalism.,she may have to pay the Piper if Trump goes all the way,!! Though, I don't feel Trump is a Vengeful person,!!","post_message":"66,000 Signed Petition to Boot Megyn Kelly from FOX News Debate!"},{"comment_id":"10154160102065047","commenter_b":"GET US OUT OF THE UNITED NATIONS; THEY ARE NOT STANDING UP FOR 'BASIC HUMAN RIGHTS' FOR THESE WOMEN AND CHILDREN UNDER ISLAMIC RULE. WHY? THEY ARE RUN BY ISLAM NOW. GET THE UN OUT OF THE USA.","commenter_a":"Why do so many Americans support and justify this abomination???? The number of Islamic apologists is nauseating!","post_message":"Little girls in northern Kenya are being brutally tortured and enslaved. They're forced to marry men as old as their father or grandfather. Sign our urgent petition to demand an end to this evil practice."},{"comment_id":"10154995598416037","commenter_b":"Robert, have you heard of sanctuary cities? Do you know why thy are called that? If you are illegally here this is where you go. Now how many illegals do you think are in California? Hello","commenter_a":"Good luck to him. Would be nice to see Democrats lose those 55 electoral votes every election. Half the people there aren't even American anyways.","post_message":"“We believe the country is like a Titanic, and the election of Donald J. Trump is the equivalent of the Titanic hitting the iceberg.”"},{"comment_id":"1658752774184464","commenter_b":"Have you bothered -- of course you have not -- to realize the amount of business your new Fueher is doing in these very same countries? And continues to do so? At this moment anything HRC did is irrelevant.","commenter_a":"The Clinton Foundation accepts donations from the Saudi Arabian Royal family, who have had hundreds of people hung for being gay. But these moron Hillary supporters either don't know it or they're just willfully ignorant","post_message":"'I fully support Hamilton: An American Musical cast taking Mike Pence to task over equality, but..."}]
