[{"comment_id":"644967912360454","commenter_b":"That's a women? !","commenter_a":"He ain't banning a damned thing!","post_message":"A Hispanic student is banning whites from using this term... because it's racist? 'LIKE' if this is WRONG!!!"},{"comment_id":"10153552343052452","commenter_b":"What a shitbag","commenter_a":"These people have no shame... very sad..","post_message":"An Alhambra homeowner caught a package thief in the act and recorded the woman as she tried to swipe two boxes from his porch. Police are now searching for the culprit. abc7.la/1Wt5Auf"},{"comment_id":"1819104865025971","commenter_b":"You're an angel!!","commenter_a":"I literally did this the other day with a dog waking up after a dental. I wrapped her up, rocked her and kissed her and kept saying she would be ok, she was a good girl. It's hard to see them wake up scared and alone so as an assistant, we have to watch them while they're waking up, so why not keep them safe feeling and warm in your arms?","post_message":"Baby Meesha was coming out of surgery and was crying and scared. The vet wrapped her up in his arms and comforted her, singing to her and giving her kisses. A volunteer at the BARCS Animal Shelter walking by caught this tender moment. Turn up the volume for this one. STORY: FOX13news.com/news/@username-story"},{"comment_id":"518916724963287","commenter_b":"Is she holding a sex toy???!!!!!","commenter_a":"I cannot believe facebook has stuped so low to put this kind of crap on their page, I'm thinking it might be time to leave.","post_message":"THIS IS DISGUSTING..."},{"comment_id":"10153579902226135","commenter_b":"I think it's illegal to drive while drinking whether or not you have a child in the car...","commenter_a":"What's her name? I want to see if she has a Facebook.","post_message":"Initially, the woman is seen on video wearing only a tank top and underwear. Police says she appeared sluggish and smelled of alcohol."},{"comment_id":"10153446505791130","commenter_b":"I prefer the Wicked Witch is dead!","commenter_a":"Olha, Fer Montano!","post_message":"A songwriting expert reveals the reason."},{"comment_id":"960686434063090","commenter_b":"Get her outta here!","commenter_a":"Take her off the air she is a bigot also joy you can see the hate in her face when President Trump is mentioned","post_message":"Whoopi Goldberg has been relentlessly gunning for Trump. He's had enough, and so has America. Should Whoopi Goldberg be kicked off TV forever?"}]
