[{"comment_id":"10154254037283352","commenter_b":"Fuck that queen","commenter_a":"He must be on his period","post_message":"'I'd rather see a drag queen!' Elton John accuses Janet Jackson of lip-syncing"},{"comment_id":"10154229231904411","commenter_b":"If a woman have every right to show off her body or hair; then why can't she have the right to cover it? I haven't met any veil wearing ladies that have offended me in the least.","commenter_a":"The Golden Rule of Civil Rights is, One Mans Rights End Where Another Mans Rights Begin","post_message":"Awkward: Laurence Rossignol, who is ironically founder of the anti-discrimination organization SOS Racisme, compared Muslim women who wear veils to 'American negroes' who supported slavery"},{"comment_id":"10153237839494203","commenter_b":"Marxist Feminists are ugly and nasty.","commenter_a":"Would you describe a man as \"testy\", Daily Beast? Thought not.","post_message":" can spin her way out of this. She can explain her way out of this."},{"comment_id":"10154150780421028","commenter_b":"@username, she may be immoral and gross TOO but shes not running for president","commenter_a":"Just wondering if NBC will be firing Miley Cyrus from the Voice? There are some really raunchy offensive videos of her out there. Can't imagine why it's ok for her to put that filth out there recently, but he's being punished for something so old.","post_message":"Billy Bush is leaving the \"Today\" show following outrage over the leaked Donald Trump tape, the show's producer says. @webpagelink"},{"comment_id":"1081603935229468","commenter_b":"#I'mwithHer Go Girl all the way to the white House!!!.","commenter_a":"Hilary Clinton, vote for the most qualified candidate for president 2016","post_message":"This is not a single issue country. We need to address racial inequality as well as economic inequality."},{"comment_id":"1357815300916697","commenter_b":"LOSER. MOVE ALONG NOW!!!","commenter_a":"Made this myself fits them perfectly","post_message":"Stein planned to make an announcement about the Pennsylvania recount Monday outside the Trump Tower in New York."},{"comment_id":"10152839305921680","commenter_b":"Not this half latino nor his wife and father!","commenter_a":"And Latino will fall for it again.","post_message":"\"As a mother, grandmother, and American, I don’t know how a person can meet these young people ... and think of threatening them and their families with deportation,\" Hillary Clinton said."}]
