[{"comment_id":"515846775249931","commenter_b":"Does she know how ugly she is?","commenter_a":"Why would I care what a celebrity thinks or says.","post_message":"\"Oh, Donald Trump is whining about attention now?\""},{"comment_id":"1349045918521792","commenter_b":"You have a lot of names there Laurren.. The typical liberal feminist skank.. Way to go","commenter_a":"Just a suggestion for you @username people. If you dislike Trump and hate that he won a fair election then I suggest you retreat into your safe space for the next 4 years (at least). Shouldn't cause you too many problems as you probably don't have jobs anyway.","post_message":"This website is going viral, and Trump is not happy. You know what to do!"},{"comment_id":"1755875524653363","commenter_b":"The real coruption and illegal a tivities existing in this administration are the issues, but you are to cowardly to address them. Payments have already been made for Hillary to continue to play her corrupt anti American game. It is easy for the Clinton crime family to justify their dark Anti American activity. The message to her foreign friends antagonistic to the United States, and those buying positions on our taxpayer payed government payroll; Hillary is still open for bribery. Trying to rationalize their evil destructive behavior is despicable. The present administration and Hillary, studied, we're mentored, and follow the agenda of the most corrupt genocidal ideologies on earth. National Socialism, Communism, and Islam. Combined these ideologies have murdered and plundered close to a billion human beings. So why would any sane person with good intentions follow any of these ideologies? They would not, but the Clinton's do. The death, ...","commenter_a":"I've heard a lot of people say they used to like Beck but now they think he is completely bonkers.!","post_message":"Glenn Beck harshly criticized Breitbart executive Stephen Bannon, who is now the CEO of the Donald Trump campaign, saying that Andrew Breitbart himself is “spinning in his grave.”"},{"comment_id":"888228281273425","commenter_b":"Go baby go! There is no one more capable to speak for the down trotted, our Vets and what wars do to people than you! And you are a hero and thanks a million for your dedication and Service!","commenter_a":"Go Tammy!","post_message":"She’ll challenge GOP Sen. Mark Kirk in the 2016 election."},{"comment_id":"10153444104128690","commenter_b":"Americans breed Christians at alarming rates... They have taken over.","commenter_a":"stop buddist terrorist!","post_message":"The group has stoked anti-Muslim sentiment by saying Muslim communities have high birth rates and will eventually overrun the predominately Buddhist country even though they currently represent less than 10 percent of the population. @webpagelink"},{"comment_id":"10153933865898984","commenter_b":"Send her ass to cuba","commenter_a":"The mother was a moderate Muslim who supports what the extremists do. She may not participate in the killing, and so on, but she helps from the sidelines. Deport.","post_message":"This just adds to the mystery of the San Bernardino shooting. This is absolutely huge and it means that there's A LOT more to the story than we know... Share this with everyone. We need to get this out there."},{"comment_id":"10154466524309203","commenter_b":"She's disgusting","commenter_a":"Enough of the hate and racism. Every time they open their mouths, garbage comes out.","post_message":"CNN political commentator Hughes: \"hoping I not going to have to [brush up on] my #DoratheExplorer to understand some of the speeches given this week. #DNC #TimKaine"}]
