[{"comment_id":"1785689904981470","commenter_b":"I'm considered a minority, but I will NEVER support a lying pandering corrupt person no matter the gender. Many of us are onto her regardless of her pandering. I hope that bottle of hot sauce that she carries in her bag at all times, helps her because she's going to need it. I'm happy she dodged sniper fire in Bosnia, but at this point, \"What difference does it make?\"","commenter_a":"Women and minorities will elect Hillary. We do not need an inexperienced, ignorant, unpatriotic misogynist as President. He isn't even familiar with the Constitution or how our system of government works and he is a horrible human being who brags about not paying taxes, crushing small business, defaulting on loans and being sexually attracted to his daughter. It is hard to imagine someone less qualified being nominated but then he ran against a group of people without a clue.","post_message":"After their hard-fought primary battle in 2008, President Obama asked Hillary to serve as his secretary of state. Here's what foreign policy experts and world leaders think about her four years as America's chief diplomat:"},{"comment_id":"980094148726809","commenter_b":"@username Keep your dick in your pants!","commenter_a":"Well done! Any who object to a 'medieval theocracy' should take a good look at Northern Ireland if they want to see one in action. Bloody misogynist dinosaurs.","post_message":"Three women have handed themselves into a police station in Derry, stating they have procured and taken illegal abortion pills and requesting that they be prosecuted, in protest at Northern Ireland’s restrictive abortion laws."},{"comment_id":"10152660515486813","commenter_b":"Maybe , but I am not a damn Liberal pussy.","commenter_a":"Too f'ng bad , play stupid games , win stupid prizes . Its not a resort.","post_message":"HORROR in Georgia Prisons. ACLU's David Fathi sheds light on how America needs to twist the lens and reflect on how we treat those within the criminal justice system. @webpagelink"},{"comment_id":"10153127033512383","commenter_b":"Draw the little snakes out","commenter_a":"Bring it!","post_message":"UNAFRAID: Troops remain defiant on social media in the wake of the recent threat against military personnel from the Islamic State group."},{"comment_id":"508254089382552","commenter_b":"It's cheaper in the long run to deport them now.america can't continue to feed ,clothe,and give free everything to these people.Damn it our vets and needy in america should come first.","commenter_a":"We don't , and they don't assimilate ..","post_message":"NO."},{"comment_id":"1225000220856314","commenter_b":"You're so evil Hillary! @webpagelink","commenter_a":"We don't have a depleted military, you moron.","post_message":"\"We cannot have a depleted military.\" Donald J. Trump speaks to supporters about the military @webpagelink"},{"comment_id":"981436531916095","commenter_b":"This is also the reason women live longer lol","commenter_a":"Why is it always men!?? Lol just proves us women are the wiser more clever sex","post_message":"Why you should never play with swords"}]
