[{"comment_id":"1847896892115179","commenter_b":"And what about the interface of other devices?","commenter_a":"There is no break through. It has always been there. Anyone heard of Tesla? Um hello...","post_message":""},{"comment_id":"10153024704310927","commenter_b":"Bill; do you understand that the 08 housing crash was the result of the 01 dot-con crash and that crash was preceded by the savings & loan crash and crash backwards it goes back to drilling nuclear holes in the ground & Vietnam and then disasters back to 1913 non-federal reserve bank. That to sustain the illusion the fiat currency denominator had to be divided by greater volume than gold, then oil and now QE zero interest ether ?? Destroying the ME extends the time line that said nations can once again convert away from the bankrupt US dollar ??","commenter_a":"Just more political theatre. It has already been shown that the IRS did not target conservative groups. The were doing their jobs and broke no laws.","post_message":"Rep. Jason Chaffetz UNLOADS on IRS Commissioner John Koskinen while introducing resolution of impeachment: violated the public trust ... Impeachment is the appropriate tool to restore public confidence in the IRS ... .\""},{"comment_id":"1273398092695609","commenter_b":"Rosie is one of the most disgusting women","commenter_a":"protect your kid not your pigs","post_message":"Rosie is disgusting!"},{"comment_id":"10153178962341833","commenter_b":"Oh and not to mention we wouldn't have lasted a day against the British without guns.","commenter_a":"People just don't get the fact that we are still a democracy after 240 years in part because we as a population have the constitutional right to be armed. Let's see how long we would have lasted otherwise.","post_message":"Thank you for helping us reach 4.2 Million LIKES on Facebook! Like and Share the news with your friends!"},{"comment_id":"10153489348776756","commenter_b":"Only a woman could find something completely fucking trivial to bitch about a great thing.","commenter_a":"#FirstWorldNonProblems","post_message":"\"Can I just passively refuse to pass the beach balls back up until they collect around my feet in one incriminating pool? How coldly can I glare at the people who try to resurrect the beach balls I've silently condemned to the ground?"},{"comment_id":"10154242157722690","commenter_b":"@username oh yes she is. No way would a women just go Willy Nilly about massive death. We are big on keeping people safe. He twits bc someone put him down. Just think if a country pisses him off.","commenter_a":"We have two people running for office that are both out for themselves. Ones going to court Nov 28th on a fraud case for his fraud school then we have one about email server. I mean come on we don't have a great choice! They both SUCK!","post_message":"FBI to reopen Hillary Clinton email investigation after additional emails were discovered as part of a separate investigation."},{"comment_id":"1580252788658041","commenter_b":"PLEASE STOP POSTING WITH THIS DESPICABLE WOMAN. ENOUGH TORTURE ALREADY.!","commenter_a":"Shes wacked","post_message":"Conway says she is more “amused” than “worried” over the fact that none of the top notch schools in Washington want to accept her children."}]
