[{"comment_id":"10153512557096130","commenter_b":"LOL!!! NO SEX. WOMAN LISTEN TO MAN. YOU MADE OF RIB. SHUT UP. NO WORDS. BE SLAVE. yay the bible...-.-","commenter_a":"Well, I suppose human nature, being what it is, things won't change much for the better. However, if people would follow some of the teachings of the Holy Bible, regardless of their personal religious beliefs, the need for Planned Parenthood would pretty much go away.","post_message":"Enough is enough."},{"comment_id":"985335071559547","commenter_b":"Scumbag!","commenter_a":"First of all what was the point in having all of this kids man! Now a days 3 or 4 is a lot of kids man. 19 kids is like your freaking crazy! I only watch half of a episode and I change the channel mighty quick. The ones that are going to suffer are their kids.","post_message":"This \"family values\" hypocrite hoped you'd never see these."},{"comment_id":"10153931139325695","commenter_b":"Omg poor @username lmao. What a nut job . So should we deport whites for crimes? Since this wasn't really our land to begin with?","commenter_a":"Really disappointed with you, WSB.","post_message":"Our investigation found the number of refugees deported for violent crimes is skyrocketing, and it includes numerous refugees here in Georgia. Today at 5, the numbers that leaders call a \"game changer\" in the Syrian refugee debate."},{"comment_id":"10155170466528984","commenter_b":"Hire American instead of illegals","commenter_a":"COWARDICE","post_message":"This just in..."},{"comment_id":"827024174060503","commenter_b":"@username you move and take that communist Kenyan creep with you","commenter_a":"You libs are pure , unaldulterated \"mush\"! Your president is taking us down the road to nowhere and you are worried about the police killing a wonderful young \"punk\" who stole and bullied and tried to kill an officer? Get off welfare and get a job!","post_message":"\"The power to kill is the most awesome power that any government worker could possibly have. We have given that power to police, and then we have refused to monitor it.\" - Lawrence O'Donnell"},{"comment_id":"10153301412809641","commenter_b":"tuch","commenter_a":"Warning: china is about to end... u.s. is the most powerful country in the world!","post_message":"BREAKING: Nearly every U.S. federal government agency has been hit by a massive hack thought to originate from the Chinese military, and millions more workers could be affected: @webpagelink"},{"comment_id":"1333344573352236","commenter_b":"Omg! She LIED!!!!!!! IT HAS BEEN PROVEN. IT IS OVER","commenter_a":"While calling Breitbart a \"journalism\" might be pushing it, Breitbart should have thrown it's full weight behind Fields, and waged an all-out campaign against the Trump campaign until receiving a proper apology. The fact that they seemed to have abandoned her in light of evidence is despicable, and Breitbart needs to be held accountable.","post_message":"\"This is disgusting,\" former Breitbart editor Ben Shapiro said. \"No news outlet would stand for it.\""}]
