[{"comment_id":"10153637396193854","commenter_b":"He is a idiot and a monkey like that wife of his both ugly as sin he want be there much longer they have signed impeachment papers","commenter_a":"GO TO HELL","post_message":"Under Obama, U.S. Army Orders Soldiers To Scrape Bible Verses Off Their Rifle Scopes…"},{"comment_id":"10156809367690725","commenter_b":"U shush up cactus lady","commenter_a":"STOP, JUST STOP! Trump uses this sad news to advance HIS agenda, and the terrorists use his rhetoric to advance theirs. DONALD TRUMP, JUST SHUT UP!","post_message":"Watch this clip from earlier this year. Time and time again- I have been right about terrorism. It’s time to get tough!"},{"comment_id":"1027693250616162","commenter_b":"Suck","commenter_a":"@username 1mbps","post_message":"The technology is able to transmit up to 224 gigabits per SECOND."},{"comment_id":"1701496370115384","commenter_b":"GET OUT OF OUR home & go back to hell where u belong!","commenter_a":"yes!","post_message":"16 U.S. States Come Together To Ban Shariah Law It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"10152838085232014","commenter_b":"That woman is not a mother. A mother loving, nurturing, protective. That woman is a disgrace. She should never get those precious babies back.","commenter_a":"What's wrong with these people leaving their kids in cars alone o in apartments....seriously people stop having kids or don't have them at all if you're not going to be responsible.","post_message":"Police say a Phoenix mom left her two babies alone in an apartment with a bathtub full of water, a switchblade in reach, and an open door to the third-floor balcony."},{"comment_id":"10152887362811770","commenter_b":"Liar....","commenter_a":"gormless!!","post_message":"Pantsuit on fire!"},{"comment_id":"10152781007061615","commenter_b":"Our veterans go without while lazy a**es and foreigners collect cash, food stamps and free medical. What's wrong with this picture??? VETERANS AND ALL MILITARY SHOULD COME FIRST! They put their lives on the line so the lazy idiots and illegals don't have to. WAKE UP AMERICA AND GET YOUR PRIORITIES STRAIGHT!!! Rant over.","commenter_a":"but it was OK that he put his life on the line for this country give the man what he deserves","post_message":"DENIED. An American hero, unable to collect his military benefits when he needed them most. WPXI Rick Earle gets help for this veteran. His story is coming up tonight at 5:45 p.m."}]
