[{"comment_id":"10155157527128132","commenter_b":"Two scary women1","commenter_a":"That is one scary woman.","post_message":"Like always, Janice Dickinson is not holding back."},{"comment_id":"10154432155426509","commenter_b":"she is a liar","commenter_a":"In the end, She got voted because of her gender. Not saying she is bad, she is decent candidate but this woman thingy got to stop if she truly want to become a great president.","post_message":"\"In my second century, I look forward to seeing a woman president.\" She's 102 years old, and she turned out to her Iowa caucus to support Hillary Clinton: @webpagelink"},{"comment_id":"616683421873704","commenter_b":"I do too, Hillary won that election! They stole it and tainted our votes.","commenter_a":"Not my President impeach impeach impeach","post_message":"Share if you do too! Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153907246193812","commenter_b":"I don't want them in California!! I don't want them in the United States. Send them all back with a rifle and ammunition to fight for their own country!!!","commenter_a":"But, but, refugees are not terrorists......","post_message":"JUST IN: Turkey arrests 8 suspected ISIS members who planned to travel to Germany posing as refugees, Turkish officials say."},{"comment_id":"1073538729332546","commenter_b":"Terri must not have kids to make a statement like she or he made. Shame on you putting the blame on the mother.","commenter_a":"School needs to be held accountable and the bus driver for forcing her off. This can never happen to another child. They are lucky the right person found this child and returned her.","post_message":"A #Seattle bus driver is now off his route --- after a 7-year-old was found wandering Capitol Hill, crying. >> kiro.tv/WrongStop"},{"comment_id":"538835082988240","commenter_b":"Yes it would 😂 cause you a hoe","commenter_a":"@username this is how we would be with Mr kitty 😂😂","post_message":"\"I pay puppy support...\""},{"comment_id":"10154399903958797","commenter_b":"Idiots!!","commenter_a":"And then people wonder why they are shot. First responders should be licensed to carry and use if needed.","post_message":"WHO DOES THAT?! Two people have been charged with scratching and hitting paramedics on a Red Line platform in the South Loop Sunday night. Officials say the suspects walked up and hit the responders in the face and body before spitting in their faces."}]
