[{"comment_id":"1353932681333143","commenter_b":"No ma'am. Her CHOICE killed her. Let's call a spade a spade.","commenter_a":"Grieving or not that's totally unfair on her friends who by the sound of it were nit even taking g the drugs with her! RIP what a waste of life educating kids this age on drugs is the most important lesson here as they are bound to try them.","post_message":"'You f****** killed her'"},{"comment_id":"10153914495466491","commenter_b":"How is a white woman being racist unbelievable?","commenter_a":"Unbelievable that people would accuse Ellen being a racist","post_message":"Ellen DeGeneres took to social media to respond to the backlash."},{"comment_id":"1082059028539299","commenter_b":"And whites don't hey dumbass All lives matter you would know that if you stayed in school 😬","commenter_a":"Because Black LIES Matter to those thugs.","post_message":"It's no surprise that the people at Black Lives Matter aren't exactly known for their ability to stick to the facts. However, this new data about black \"victims\" absolutely DEMOLISHES their whole agenda. I guarantee the media doesn't report on this... let's spread this everywhere."},{"comment_id":"10155204940516337","commenter_b":"Well, those compys had gotten away before the story even started.","commenter_a":"I prefer the way the book ended.","post_message":"THE ORIGINAL ENDING of Jurassic Park might blow your mind..."},{"comment_id":"896491237077292","commenter_b":"Give me a break with the martyrdom... I don't think this is an appropriate way to handle this.. Sian is right.. her's will fade and you will be left with nasty looking legs.","commenter_a":"The things you do for love","post_message":"Their daughter couldn't be happier...she even points at the tattoos and yells 'match!'"},{"comment_id":"10154092301891028","commenter_b":"she hates clowns","commenter_a":"@username and Leonora Fabio Chavez Don't tell Sarah About this lol","post_message":"Nope. The lore of creepy clowns purportedly trying to lure children into the woods sweeping the Carolinas and Ohio just made it to Tennessee. @webpagelink"},{"comment_id":"924082021021384","commenter_b":"and hate smart women.","commenter_a":"What happened with the great Sara Palin she not running lol","post_message":"They might need a bigger stage..."}]
