[{"comment_id":"1170752382944790","commenter_b":"You can choose at any time not to have sex. Women don't have that luxury when it comes to their menstrual cycle.","commenter_a":"So? We pay sales tax on condoms?","post_message":"Forty U.S. states apply sales tax to menstrual products. via GlobalPost"},{"comment_id":"1064358433623633","commenter_b":"TRUMP GO back TO Hell","commenter_a":"Can these idiots be any more reprehensible?! The Repugs care only about the top 1%.","post_message":"The right's hostility toward the working poor is now front and center."},{"comment_id":"911884798904575","commenter_b":"\"I guess if you favor the right, the debt will grow, more jobs will be lost\" - The current President who is on the left raised the debt more than every other President combined. You acknowledge that there can be different factions on the left but not right apparently as well. If your main concern is the debt then you should lean more conservative as the primary goal is financial stability. Bush was not a conservative btw, he was more liberal. The main difference in policy between Obama and Bush (and possibly both parties in general atm) is \"what\" they wanted to spend money on but they both want to spend as much as they can get away with. I also do not accept your copy and pasted answer to Octavio's question. A definition doesn't tell anything. He's asking where you see the differences. It's also dishonest to call America ...","commenter_a":"Socialism works, as designed by the Founding Fathers, all of whom were socialists.","post_message":"Republican liar: 1 Bill Maher: Infinity"},{"comment_id":"10156198873145354","commenter_b":"Screw Faux News and that bitch Megyn Kelly.","commenter_a":"FOX is decending to a new low leval! I used to have it on all the time but now i will just tune in for one program!","post_message":"We have the intense Twitter exchange between Donald Trump and National Review editor Rich Lowry. Read the tweets!"},{"comment_id":"652489448217570","commenter_b":"Bella, ur out of your mind.","commenter_a":"I've never seen a bigger deal made out of nothing than Deflategate","post_message":"Uh-oh...This could be BAD NEWS for Tom Brady!"},{"comment_id":"10153253794632756","commenter_b":"Lol but she has a product of the worthless bum","commenter_a":"Go kkk.you have my support","post_message":"More flyers advertising the Ku Klux Klan turned up in a neighborhood in Luzerne County and authorities say there's not much they can do much about it."},{"comment_id":"1052489598132806","commenter_b":"A vote for Brad Thor is a vote for lying Hilary!","commenter_a":"beck cares about MONEY & POWER.he has to keep this mess up to TRY and stay in the limelight. just STOP-we want to WIN in nov. TRUMP 2016","post_message":"#Thor2016"}]
