[{"comment_id":"10155959716910725","commenter_b":"One last word....Yes AMERICA is gonna start showing her TRUE COLORS AGAIN!! Prepare!!","commenter_a":"For the first time in many MANY YEARS, my wife and I think we may very well take our country back!! GO TRUMP!!!","post_message":"We must stop the crime and killing machine that is illegal immigration. Rampant problems will only get worse. Take back our country!"},{"comment_id":"936127749836940","commenter_b":"And system fail too","commenter_a":"Sel Taylor","post_message":"I Just Got a Computer Chip Implanted In My Hand — and The Rest of The World Won’t Be Far Behind"},{"comment_id":"10152966322040047","commenter_b":"CRIMINAL","commenter_a":"Next they sell them for food ingrediants!!","post_message":"Planned Parenthood continues to defend its ghastly operations. Abortionists have confessed to changing their practices in order to harvest more body parts. Sign and Share our petition - demand that Congress further investigate the abortion giant and end the sale of babies' body parts."},{"comment_id":"1029144867143578","commenter_b":"@username maybe they should all go to Mexico instead .","commenter_a":"Trump. A habitual liar, narcissist, racist, fascist, five time draft dodger, four time bankruptcy filing, woman hating misogynist, bigoted bully. A man who only has money because he's a vaginal success. (Born into wealth.) A man who represents everything that's wrong with this country. Yet, people will vote for him. The very same individuals who stand to lose the most. Wake up. He only cares about himself.","post_message":"New Jersey Gov. Chris Christie offered up the latest twist of the Republican presidential primary when he endorsed Donald J. Trump on Friday."},{"comment_id":"1742743236000370","commenter_b":"Typical Bernie speech sounds like this.I like to thank my legs for supporting me.My arms for always having been by my side and as for my fingers-------I could always count on them.","commenter_a":"Thank you West Virginia and Nebraska...Im glad several of our states including Pa..can see what Trump needs to do.. JOBS....people need to get back to work.and Most hard working people want this...everyone needs to pay into the system..","post_message":"It is a great honor to have won both West Virginia and Nebraska, especially by such massive margins. My time spent in both states was a wonderful and enlightening experience for me. I learned a lot, and that knowledge will be put to good use towards the creation of businesses, jobs, and the strengthening and revival of their economies. I look forward to returning to West Virginia and Nebraska soon, and hope to win both states in the general election. Likewise, my time spent last week with the great people of Oregon will hopefully lead to another victory next Tuesday. Thank you! Donald J. Trump"},{"comment_id":"991233837660061","commenter_b":"Fuck them, go back to the shit hole you crawled out of.","commenter_a":"If our culture offends u get out!","post_message":"First bacon, then bikinis, then beer and now sports fans should watch their ... wardrobe selection so not to offend The Religion Of Peace? @webpagelink"},{"comment_id":"10152672442592169","commenter_b":"she works my nerves! MAKE HER STOP!!!","commenter_a":"mismatch, think that Mary and He should get together","post_message":"New Downton Abbey video -- do you think Branson and Bunting should be together? The cast give their thoughts. (A new episode airs Sunday at 9/8c on MASTERPIECE | PBS (Masterpiece Theatre))"}]
