[{"comment_id":"678910242299554","commenter_b":"She needs to ban herself and all the other idiots","commenter_a":"She has no authority to actually ban anything.","post_message":"You'll never believe what Michelle is trying to ban now... Ridiculous. She has no right and no authority to do this. Should we kick Michelle out of the White House?"},{"comment_id":"10153504055809024","commenter_b":"If she is that ugly let her hide.","commenter_a":"It dies offend me that someone would hate women so much to do this to them","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"10153177506924087","commenter_b":"Lmao! My uterus says otherwise but that's fine - enjoy your misogyny!","commenter_a":"Rand Paul is a fool. Trump 2016!","post_message":"\"I don't think you want a nominee that offends whole areas of the public, whole ethnic groups,” Rand Paul said. \"If you paint with a broad brush and you want to say, ‘well, most Hispanics are drug dealers and they’re rapists and murderers,’ well, that’s crazy talk, and that offends a whole segment of our population. I think most people who immigrated to this country are assets to our community and came here seeking the American dream, the same way my ancestors did.\""},{"comment_id":"389381401250154","commenter_b":"Well go home and get oyt of AMERICA ,no one made you come here and no one wants you here !!!!!","commenter_a":"Is Obama seeing this! Maybe He's the Antichrist.","post_message":"Muslim Leaders Show How ALL Muslims really think...."},{"comment_id":"1495644530464502","commenter_b":"Trump !! Hillary can't swim!!","commenter_a":"Butt wipe","post_message":"Watch Nebraska Senator Ben Sasse's speech LIVE to close out this year's #RSG16!"},{"comment_id":"10152647068355927","commenter_b":"She can be rich,but doesn't want the rest of us to be","commenter_a":"What's wrong with being rich? We pretty much all strive to be rich but the government does its utmost to prevent you. Good grief Hil.","post_message":"Great question..."},{"comment_id":"10154889440018701","commenter_b":"@username I totally agree with you ! So many people are making lame excuses for these kids! They were old enough to be out by themselves with no supervision,THEY MADE THE DECISION to do what they did,which KILLED PEOPLE and DESTROYED HOMES !! I hope the deaths and destruction is imbedded in their minds FOREVER !!! Bad choice of a way to spend your day ya little F***ERS !!!","commenter_a":"As a child a friend and I were playing with fire in a field. We accidentally set a huge bush on fire that could have easily spread out of control had we not had a drink with us. By the grace of god it didn't spread to all the near by homes. We were not trying to burn people's homes down. I think people need to realize that kids don't always think of what could happen. They are children! They will have this on them for the rest of their lives.","post_message":"Two minors have been arrested and accused of starting wildfires that killed 14 people in eastern Tennessee."}]
