[{"comment_id":"722009277961832","commenter_b":"Brunch?","commenter_a":"@username come visit","post_message":"Mark your calendars for Jan. 29. On that day only this year, more than 30 museums in Southern California will offer free general admission as part of the 12th annual Museums Free-For-All-Day."},{"comment_id":"10153986689364916","commenter_b":"\"Ever sinned bitch?\" Christ would be so proud @username","commenter_a":"Umm...which value first? Cheating on your wives (plural). Coveting your daughter? Bigotry? Hate? Self- love? Love of money? The commandment \"Love your neighbor (does not say except Muslim, Black and/or Hispanic) as yourself\"","post_message":""},{"comment_id":"10154482749054423","commenter_b":"@username doesn't watch this!!!! LEAVE HER OUT OF IT!","commenter_a":"Caitlin Leonard @username","post_message":"PSA: The cast of This Is Us is very sorry for making you cry every episode."},{"comment_id":"10154308446053984","commenter_b":"Unfortunately there is no share here or I would share it. Hate that lying crazy woman. Thanks for that info.","commenter_a":"This piece was copied from another post. It can be found on you tube in something called The Clinton Chronicles. If you're under 50 you really need to read this. If you over 50, you lived through it, so share it with those under 50. Amazing to me how much I had forgotten! When Bill Clinton was president, he allowed Hillary to assume authority over a health care reform. Even after threats and intimidation, she couldn even get a vote in a democratic controlled congress. This fiasco cost the American taxpayers about $13 million in cost for studies, promotion, and other efforts. Y Then President Clinton gave Hillary authority over selecting a female attorney general. Her first two selections were Zoe Baird and Kimba Wood both were forced to withdraw their names from consideration. Next she chose Janet Reno husband Bill described her selection as worst mistake. Some may not ...","post_message":"Democratic presidential front-runner Hillary Clinton just revealed that she believes Americans have too many guns in their homes, and I don't think one would have to take too wild of a guess as to what she would do about it if elected president... Do you think a Hillary presidency would be bad for America?"},{"comment_id":"10153212700939270","commenter_b":"Well I know it was out of service around that time but I'm sure that's what they did but it was a great ship","commenter_a":"Aw darn now no one is safe aboard that ship when that time of the month comes","post_message":""},{"comment_id":"961665563922802","commenter_b":"Lady, stop proving your ignorance","commenter_a":"if its a fairy tale explain how what and when where we got on this planet? we are aliens for god made us in his image not a fairy tale i have seen too much that i cannot explain that was unnatural to the human eye not to know its a fact there is a god and angels to go along with him so they should just wake up and smell the coffee","post_message":"Well.... this could put a damper on the tent revival."},{"comment_id":"10154442761894094","commenter_b":"Hopefully the other morons follow his wise protesting technique on Friday. Idiot.","commenter_a":"cool..or should i say hot...lol","post_message":"Two days before the inauguration, one man has started his crusade against President-elect Donald Trump, and it nearly cost him his life."}]
