[{"comment_id":"1703542769705464","commenter_b":"Nothing wrong with the east end of london. I used to go there most weekend to watch West Ham. Most of the whites moved out so blame them for not integrating.","commenter_a":"What a load of BS.. The best thing about britain is that its a big melting pot of all cultures and religions and we all get along fine apart from a small minority of extremists.","post_message":"According to a shocking new report"},{"comment_id":"1115178825215538","commenter_b":"What the hoes Milton","commenter_a":"Smh..that's sad ..the thing is a man will stay only if he WANTS to stay no matter how many babies you popping out the coochie..better get yo life..become a wife..and try to avoid the strife","post_message":"Desperate"},{"comment_id":"1262054097174477","commenter_b":"Ann coulter is a real bitch period","commenter_a":"You are one Bitter woman and no one in your life to love or who loves you. I know being 52 is hard but please dont take out your bitterness on other people. They are passionate in their believes. Let them be and go find yourself a man. it will help I promise.","post_message":"Controversial conservative figure Ann Coulter took to Twitter on Thursday, attacking protesters who continue to reject president-elect Donald J. Trump ."},{"comment_id":"10153910838991336","commenter_b":"And slap her face!","commenter_a":"Bless her heart...","post_message":"Carly Fiorina says tech companies need to be asked “to bring the best and brightest, the most recent technology to the table.” #GOPDebate"},{"comment_id":"10155514073390354","commenter_b":"Oh darn...NOT!!! Good riddance!! Hopes they ALL go up in flames. Enjoy those virgins, buttholes!!!","commenter_a":"Another dead terrorist, WOO HOO!!! KILL THEM ALL, LET GOD SORT THEM OUT!","post_message":"Height: 5'11\" Chest: 40\" Waist: 32 Currently Not Available for Bookings"},{"comment_id":"678327045675400","commenter_b":"Now if those same 27% would move to another country!!","commenter_a":"Oh, the Republikkkans. Your big daddy is a rapist yo! How he got here is a complete joke! GTFOH","post_message":"Polls show 27 percent of Trump voters won't accept the result if he loses."},{"comment_id":"1626581144301352","commenter_b":"Amy shular should just go do porn. Nothing else it will shut her pie hole with a dick in her mouth.","commenter_a":"Of course they won't leave. They won't be treated like \" royalty\" ( said sarcastically ) anywhere else 😩😩😩","post_message":"It was only a matter of time..."}]
