[{"comment_id":"10153027652339753","commenter_b":"If a woman forces her self on a man it's rape","commenter_a":"How the hell does a woman rape a man? I have never understood this concept. Especially when he's \"asleep.\"","post_message":"She was pregnant with her third baby when she committed the alleged rape. But would her sentence have been tougher if she were a man? @webpagelink"},{"comment_id":"10154230431661770","commenter_b":"Is that all they got going for them fake boobs, fake everything it looks like","commenter_a":"No one cares lol","post_message":"Kim Kardashian just wore the most ridiculous dress."},{"comment_id":"10156293544295354","commenter_b":"@username why don't you move to the UK where you will be safer after all criminals don't have guns because they are illegal there and everyone know criminals obey gun laws .","commenter_a":"I'm a huge 2nd amendment advocate and there are 1000 reasons why the gun control crowd is wrong, but I really don't care for this particular argument. Public people are at more risk than private people to become victims of crime. Any of us can become victims of random crime, stalkers, etc., but overall, the public officials and celebrities draw more risk in that regard. Hillary is so loathesome and widely despised, she probably would have been gone long ago if not for that armed security. I, OTOH, just recently bought my first gun and didn't piss off anyone enough to want to kill me. I like to use that famous Japanese quote in WWII as to why they didn't even consider invading the U.S. - \"Invade the U.S.? Impossible, there's a gun behind every blade of grass\". Our guns keep our nation safer and serve as, I hope, some ...","post_message":"Hillary Clinton: If you truly believe guns don't save lives, why do YOU have armed security protecting YOUR life with guns? We regular folk can't afford to live in million dollar mansions like you and Bill do. Why don't you want us to protect OUR families and children with guns when you use them to protect yours? Signed, AMERICA"},{"comment_id":"10153465651246545","commenter_b":"She Have to have police officers to work security. That's a city ordinance. If police don't work the event, her show will get cancelled. I think It will blow over tho and she'll be ok...","commenter_a":"I will say one thing...Police or No Police. The show will go on and will be sold out. So she is winning either way. So for those that are calling her racist. Why would all nationalities join in on the hate monger party and pay for a ticket. IJS","post_message":"The president of the Dallas Police Association said Saturday his group is not calling for a boycott of working security for Beyoncé's May concert at AT&T Stadium. However, he also said he wouldn't be surprised if many Arlington officers chose not to work the event."},{"comment_id":"10153611687931602","commenter_b":"And the fact that a grown woman liked it is equally disgusting. Grow up","commenter_a":"You know who also spoke his mind? ... Hitler.","post_message":"\"Trump? I love everything about him,'' said one voter. \"He speaks his mind and doesn't care if he offends anybody. He's saying, 'This is who I am — take it or leave it.'\""},{"comment_id":"10156710754945093","commenter_b":"I dont think so!Murderous old hag!","commenter_a":"Everyone should know she is the liar, news video proves it.","post_message":"This woman knows no shame."},{"comment_id":"1342391692491333","commenter_b":"Put her in jail","commenter_a":"Buses...bussed them in and still cannot fill a gym","post_message":"Hillary Clinton spoke at a campaign rally in Sanford, with one week left until the election."}]
