[{"comment_id":"10152829318850667","commenter_b":"I concur, Josh! Emimen is a great rapper and I don't recall him ever saying the word. I could be wrong, but I don't recall it. I don't like the word used by any person but it definitely should not be said by him.","commenter_a":"You have the right to say whatever you want. The question is, do you have enough respect for others to know you shouldn't?","post_message":"Rapper Chet Haze, the son of Oscar-winning actor Tom Hanks and actress Rita Wilson, says that the slur is part of hip-hop culture and that he has a right to say it."},{"comment_id":"915235905266169","commenter_b":"Womanizer","commenter_a":"The hundreds of thousands of people, millions voting for Trump are not going to vote for any other GOP candidate. If this chick succeeds in unseating Trump, she might as well work for Hillary Clinton. When American voters votes no longer count, it's no longer America","post_message":"Kendal Unruh is trying to do what 16 Republican presidential candidates and at least three super PACs spending more than $20 million could not do: take down Trump."},{"comment_id":"10153916819542426","commenter_b":"How about what Democrat Bill Clinton did for the black people? And how about Hillary supporting his bill and explaining that black people are \"super predators\"? Now we have a problem with unemployment. People are fighting for jobs, and Obama and Clinton want to allow THOUSANDS of immigants in our country to expand the fight over jobs. Illegal Mexicans are being hired before you or I because they are cheaper. Democrats have done none of you any favors.","commenter_a":"Truth. What gets me is that the Dems get elected in these cities then the voters blame Republicans for holding them back. How can someone you did not elect to run your city have any power to hold you back?","post_message":"\"You're living in poverty, your schools are no good, 58% of your youth are unemployed -- what the hell do you have to lose?\""},{"comment_id":"798386106976830","commenter_b":"MORONIC BITCH","commenter_a":"That shrill is so revolting! Don't know who is more disgusting, Conway or Trump!","post_message":"Maybe she really doesn't know better? Or is just plain stupid?"},{"comment_id":"1164891623572953","commenter_b":"No Obama, is a Muslim and I say screw all Muslims!! Trust No Muslim Ever!! Remove all Muslims from the United States. Trump, 2016, for 8 years!!!!","commenter_a":"Hell NO","post_message":"Another Muslim Holiday, And another Speech From Obama Greeting Them... Obama said he sides, with Muslims, maybe he should side with America FIRST! Do you side with muslims? take our poll!"},{"comment_id":"1275473112509215","commenter_b":"#GrabThemByThePussy #MakingSexualAssaultGreatAgain","commenter_a":"Deplorables say don't judge Trump for something he did ten years ago yet they keep bringing up something Bill Clinton did 20 years ago. Deplorables say Hillary is an enabler for standing by her cheating husband.... But Melania is a good wife for standing by her twice divorced husband who cheated on her while she was pregnant? Hypocrisy is the running mate of Donald Trump. And sexual assault. Don't forget that. #GrabThemByThePu$$y #MakeSexualAssaultGreatAgain","post_message":"\"Everyone knows how bright she is and how resilient she is, but...they're going to see how much she cares.\" —Joe Biden"},{"comment_id":"1353932681333143","commenter_b":"No ma'am. Her CHOICE killed her. Let's call a spade a spade.","commenter_a":"Grieving or not that's totally unfair on her friends who by the sound of it were nit even taking g the drugs with her! RIP what a waste of life educating kids this age on drugs is the most important lesson here as they are bound to try them.","post_message":"'You f****** killed her'"}]
