[{"comment_id":"10153061482070326","commenter_b":"I don't care who the media whores are in love with or paid to pretend they are in love with. If people would just vote for who they really want to win, we would beat them. Stop listening to the media tell you no one can beat Hillary.","commenter_a":"Thats because the media no longer represents the people. They want to talk about emails, when most of us are worried about just making it. I wouldn't sit down with you either.","post_message":"This is what Hillary Clinton does NOT do with the media."},{"comment_id":"1801596090092193","commenter_b":"Rot in jail bitches","commenter_a":"You mean to tell me. These people are so dumb that when they went out to do something this stupid. They didnt know anyone that would or could bail them out?.. That is pathetic","post_message":"Charlotte protesters want people's money for bail."},{"comment_id":"10153814359479411","commenter_b":"@username I don't have sex with animals unlike yourself.","commenter_a":"A monkey is still a monkey, even if you put a suite on it.","post_message":"Coming soon on RT Documentary - Congo's kings of style."},{"comment_id":"10154313794062464","commenter_b":"Makes sense to me that Hillary would hide all her secrets in bathroom....no one would go in there after her....even if she did wipe her server.....","commenter_a":"Love the boots!!! I hate pink!!!","post_message":"In the Washington Examiner today: “Could Wendy Davis challenge Ted Cruz in 2018?” Add your name to stand with the cowboy boots over the pink running shoes: @webpagelink"},{"comment_id":"537397173122691","commenter_b":"Letting illegals into the country","commenter_a":"Is there anything that does not get lefties in an uproar? Anything at all?","post_message":"This photo has San Francisco Leftists in an uproar!"},{"comment_id":"10153001294901636","commenter_b":"Yes they do!! So it's just one person that has sex with all these people?? Or different girls?","commenter_a":"I think it would be funny to see all these people exposed!!! You shouldn't be cheating. Even though your not doing it in person and physical contact, your still cheating talking to that person if your other half doesn't know about it!!!","post_message":"A dating website that helps married people cheat has been hit by hackers who threatened to release information about millions of customers."},{"comment_id":"10153068896931323","commenter_b":"Real Women Have Pulses.","commenter_a":"All this \"Men like curves\" stuff is crap. Most men will fuck anything with a pulse.","post_message":"\"There is no better way to celebrate and show off than by donning a bikini. When the #CurvesinBikinis ad in Sports Illustrated is released, the world will be watching and they’ll like what they see.\""}]
