[{"comment_id":"1613087268994006","commenter_b":"Look at that smug look on her nasty face! She makes me want to puke","commenter_a":"Sending to the Khans..","post_message":"Appearing alongside Hillary Clinton, Khizr Khan asks rhetorically, \"Donald J. Trump, would my son Capt. Humayun Khan have a place in your America?\" @webpagelink"},{"comment_id":"1315430658535467","commenter_b":"Hell yes! Build your wall and Get Over It!","commenter_a":"Could you guys please move on from this and actually report news.","post_message":"He's the \"Hamilton\" actor who gave a holier-than-thou speech to Vice President-elect Mike Pence at a performance of the play in New York City last week. Now, sick tweets have emerged that show the kind of person that Brandon V. Dixon REALLY is, and it's definitely not the kind of thing he wanted out there..."},{"comment_id":"1184608688264181","commenter_b":"Ha bitch","commenter_a":"Stupid motherfuckers🖕🏿🖕🏿🖕🏿","post_message":"No longer enrolled! #KansasState #WSHH"},{"comment_id":"1797949110492327","commenter_b":"Shut up","commenter_a":"LYING HAG!!!!","post_message":"Hillary Clinton speaks during a voter registration event."},{"comment_id":"10154575281024877","commenter_b":"Melania looks like Caitlyn Jenner. !! !!","commenter_a":"Jobin, I fell the same way sometime it takes something to open her eyes maybe this is it","post_message":"This is one of the main reasons we need to stop treating Melania like a helpless victim."},{"comment_id":"10152890870819753","commenter_b":"She's a thug period.","commenter_a":"Now we can't call this woman a thug. Because you steal doesn't make you a thug. Big time corporations, corporate officials etc steal all the time they are not considered thugs. Let's be honest your calling her that because she is black. When cute little orange country with blonde hair and blue eyes lifts Tory burch glasses oh she's got a disorder and she won't get slammed, she will be escorted gently. You can get mad at my post if you want. I majored in History for a reason. I will say she a problem in society she gives a bad name to black people, there is no excuse ever to steal material crap. I understand if your starving and stealing food. But this is inexcusable. However, no man ever needs to slam a woman on the floor FOR ANY REASON! If your a man and your so strong, RESTRAIN ...","post_message":"Even though she was able to successfully open the driver’s door of her getaway car, the man did not allow her to get much farther than that. He grabbed the shoplifting woman as she opened the door, turned her on her back and slammed her on the ground seconds later. You think he used excessive force?"},{"comment_id":"10153292399553984","commenter_b":"He has it coming to him.","commenter_a":"yes I do","post_message":"Obama's big plans have blown up in his face! That's got to hurt... Do you hope Obama finally gets the message?"}]
