[{"comment_id":"10152923499612217","commenter_b":"Are you tired of that excess fat in your body,having serious menstrual pain, weak erection, stretch mark,insomnia, stroke,fertility problem,pimples or any rough skin? We have the best and most affordable products for you.To get any of our products contact @username, BBM -2BDA0E2A.","commenter_a":"deepest sympathies to the families of all of the victims.......","post_message":"What we know about some of those who died #RememberTunisia"},{"comment_id":"10155959716910725","commenter_b":"One last word....Yes AMERICA is gonna start showing her TRUE COLORS AGAIN!! Prepare!!","commenter_a":"For the first time in many MANY YEARS, my wife and I think we may very well take our country back!! GO TRUMP!!!","post_message":"We must stop the crime and killing machine that is illegal immigration. Rampant problems will only get worse. Take back our country!"},{"comment_id":"693135860835189","commenter_b":"@username you are too old to be so stupid. Old white men are disgusting.","commenter_a":"Clinton is a LOSER. She may win the Democratic nomination but Sanders supporters will NEVER vote for her = she's lost the general election. Sanders can win it either as a Democrat or independent or third party. . Clinton forgot one thing...,she antagonized Sanders supporters so much that even if he begged they would not vote for her. Not a winning game plan.","post_message":"Hillary Clinton knows exactly how to beat Donald Trump, and she has what appears to be a winning game plan. --Andrew"},{"comment_id":"1738376596301641","commenter_b":"She wants you to lick it for her ! Lol","commenter_a":"Someone should tell her to lick her butt hole like a dog and mind her own dam business !","post_message":"Hillary Clinton told a group of supporters on Wednesday that America has \"too many guns.\" Yes, that's right. The presidential candidate who claims to respect the Second Amendment is upset that Americans own more guns than she is ok with."},{"comment_id":"10153957663196509","commenter_b":"i would run away too if rosie was my embarassing mother, RUN GIRL RUN......","commenter_a":"Gay parents would make any child go crazy!!!","post_message":"The 17-year-old had stopped taking medication for an undisclosed mental illness, Rosie O'Donnell said in a statement. @webpagelink"},{"comment_id":"1341308765907356","commenter_b":"Al Franken was a terrible comedian and an even worse senator. What a worthless piece of crap!","commenter_a":"Ouch!","post_message":"Stuart Smalley never had a chance."},{"comment_id":"10155119252083690","commenter_b":"@username U r a horrible women ur all posts r anti Islamic. ...shame on u..","commenter_a":"Correction: Racism sparks anger towards dude getting on with his life.","post_message":"A British boxing star has stirred far-right anger after posting a picture of himself taking part in Muslim prayers at a mosque in the UAE."}]
