[{"comment_id":"719778928160572","commenter_b":"SHE'S a lying BITCH!!!!!","commenter_a":"Maybe for your distorted economy, sissy. It's perfect for Free Enterprise Capitalism. Just picture perfect.","post_message":"Clinton says that despite his years of business experience, Trump is dangerous and \"shouldn't have his hands on our economy.\" What do you think about her comments?"},{"comment_id":"1586029795023236","commenter_b":"all you women who just need to color those grey hairs with Bleach blonde. So Vain.","commenter_a":"Richard Dryfus.....dude...you just lost the majority of your fan base. You must be a Criminal follower!","post_message":"He called Trump small dicked prick a unqualified racist who had for celebrity supporters."},{"comment_id":"1719470721658124","commenter_b":"There illegals Zachary King..... there scared to death.....","commenter_a":"#Trump2016 TRUMP TRAIN","post_message":"Donald J. Trump has revealed how he would make Mexico pay for the wall. @webpagelink"},{"comment_id":"1061923367225138","commenter_b":"Shes a rino like glenn.. no one cares..","commenter_a":"Good riddance, campaign for the liar Hillary.","post_message":"“This is not a decision I make lightly, for I am a lifelong Republican.”"},{"comment_id":"970236133016859","commenter_b":"Dumber than dumb. She thinks she is a republican because...?","commenter_a":"I'll bet dollars to donuts that she'll still vote republican in the next election. Dimwits gotta be dim......","post_message":"To save Obamacare, we need many, many more people like Erin to come forth."},{"comment_id":"10152793900772452","commenter_b":"Bad women drivers! ;)","commenter_a":"Who the hell runs over a motorcyclist and does not have a clue that they hit someone????! Thank god the other drivers made her stop FINALLY!!!","post_message":"The dramatic rescue of a motorcyclist who had been dragged underneath a truck on the eastbound 91 Freeway was caught on video. abc7.la/1EK2HcY The video was submitted to Eyewitness News by viewer Byron Holeman who used the #ABC7Eyewitness."},{"comment_id":"1922337691198281","commenter_b":"What easier place to pull off a mass murder? A gun free zone, loser!!! Did your law stop the murderer from having a gun?? Libs just keep getting dumber.","commenter_a":"another freaking retard liberal","post_message":""}]
