[{"comment_id":"10152881862581051","commenter_b":"Fry the bitch","commenter_a":"Sad god be with her","post_message":"When police responded to the 911 call, they saw this woman on her front lawn - covered in blood. But even that didn't prepare them for what was inside the house."},{"comment_id":"10154233668643132","commenter_b":"Michelle Lena Butler idiots on both sides.","commenter_a":"Why is a 50 year old and a 47 year old trying to even reproduce? Can their be laws against that please?","post_message":"\"I can't afford Melissa's doctor visits . . . I don't think I can afford the babies, so I just want to abort all three babies.\""},{"comment_id":"10153088515381336","commenter_b":"Withdraw so we can finance the terrorist to attack isis....","commenter_a":"Oh, the ones he referred to as JV?","post_message":"President Obama is expected to announce in the coming days a modified plan on U.S. troop withdrawal in Afghanistan to help the country’s new government fight the Taliban and other emerging insurgent groups."},{"comment_id":"1059501164087223","commenter_b":"a little racists are we? I don't see any white ladies up there dancing with her.","commenter_a":"nope didn't see it,...who is beyonce?","post_message":"Not so subtle."},{"comment_id":"10154432726796320","commenter_b":"Another white woman mad","commenter_a":"Oh let's not forget how a caucasian family looked away from there child in Disney and the alligator got him(🙏🏾) did they drag his parents threw the news talking about their backgrounds? Nooooooo but a African American child falls in a gorilla pit and they put his fathers picture up and he wasn't even around!!!!","post_message":"In a dramatic image, a protester is grabbed by police officers in riot gear after she refused to leave the road in front of the the Baton Rouge Police Department Headquarters on Saturday. She has been identified by multiple media outlets as Ieshia Evans, 35, a nurse and mother of a 5-year-old boy. (AP Photo/Max Becherer)"},{"comment_id":"10152523937956135","commenter_b":"Only issue is the sand doesn't wash down the drain as easily as salt when winter is over","commenter_a":"Sand is better. We use a salt and sand combo (more sand than salt) in the UP.","post_message":"Ever slide through a cold Interstate at night and wonder how exactly is salt supposed to melt ice?"},{"comment_id":"10150690692729999","commenter_b":"Maybe this can cut back on oil use?","commenter_a":"They should never have entertained the idea of the pipeline in the first place. Sending that dirty oil through our country was a really bad idea.","post_message":"Barack Obama has rejected the request to build the Keystone XL pipeline, saying it \"would not make a meaningful longterm contribution to our economy.\""}]
