[{"comment_id":"1062576617115128","commenter_b":"I think if Americans knew the reason and how our fresh produce(picked by illegal and legal migrants) become contaminated with ecoli and other harmful filth- we would all choose trained Americans to harvest our FOOD. People pay more for organic produce, unsoiled produce is just as valuable.","commenter_a":"The farmers did it to themselves. They gave those jobs, back in the 60s, to illegals who worked for cents on the dollar - and American families were shoved out of the industry. Don't say there aren't people out there who won't do the work. There WERE people out there doing the work - and they threw them away. Let's FIRST - get rid of them ALL - and give it a year to play out to see where we actually NEED work visas. If american companies (and farmers) can show that they diligently TRIED to hire Americans and could not get the skill or number of people they needed - FINE, then they can apply to bring people in on VISAs.","post_message":"THE #1 ISSUE FACING AMERICA Recently, I joined Dr. Carson to discuss immigration. We met for 90-minutes. I shared my experiences, opinions, concerns, and solutions with him. Topics ranged from border security, terrorism, drug and human trafficking, the impact on jobs, wages, welfare, education, culture, and healthcare. HIGHLIGHTS OF WHAT I SHARED: 1. Last year, after announcing I’d explore running for president myself, Megyn Kelly asked why I wanted to be president? I replied, “I hold the sort of conservative values which America needs today. And in the same way Reagan kept his word by bringing home the hostages, I promise to secure the border and solve the immigration problem. I went on to say I'd protect the American people, their lives, their jobs, their health, and their children in the same manner I protect my own. I told her audience I was in love with America. Later that night ..."},{"comment_id":"1208631035874947","commenter_b":"It's like they are in our brains.","commenter_a":"Hahahaha Donna Chin, @username @username! (Rix I think that number 9 & 11 will be very familiar to you Hahahaha)","post_message":"You know they're a real friend when you can be a dick to them."},{"comment_id":"10157183746875725","commenter_b":"#TrumpTrain #Women4Trump #MakeAmericaGreatAgain #BuildTheWall #Vets4Trump","commenter_a":"I live in Australia. I would not want them here. But worse would be Trump. I feel sorry for you all. This will be an election of abstention I think. God Help America.","post_message":"It's clear: scandals and controversies follow the Clintons, who will say and do anything to win."},{"comment_id":"10154937498024885","commenter_b":"She MAY have HAD fashion, but when she wears hideous clothes made for her. It speaks volumes.","commenter_a":"Ok Post Disgrace, we get it STL has a slightly few more liberal, reverse racist, nobodies then the rest of the Midwest. However, this is no time to be praising Osama Obama's wife. We just celebrated Christmas for God's let's try to keep the sane ones sane.","post_message":"\"She's made an effort to wear accessible fashion,\" designer Tracy Reese says. \"I think Jackie (Kennedy) was a great role model but she wore a lot of couture, and things that most Americans could not afford.\" Mrs. Obama, she says, has worn both high-end and moderately priced fashion."},{"comment_id":"1313221025411316","commenter_b":"Big ear bitch stfu","commenter_a":"Keep resisting arrest dumbasses 👌🏼... If you do what your told you'll be fine If not well then that's yo fucken fault Don't try to fight them , especially against a lot of cops.., that's retared your gonna lose If your rights are violated then take them to court. 😮👌🏼. Hopefully you guys learned something from this video","post_message":"Where the officers being too aggressive? #WSHH"},{"comment_id":"902128633188334","commenter_b":"I talked to my next door neighbors about the illegals. They were very verbally upset with the illegals. You see their whole family was born in Mexico and they all moved to Oklahoma Legally. The man told me it took them almost 12 years to get the whole family here. BUT they could have paid smugglers and had them all here in 2 years. They hate the illegals also. They said they give the rest of the Mexicans a bad rep.","commenter_a":"Welcome and thank you for doing it the right way","post_message":"Americas Freedom Fighters"},{"comment_id":"725368590987052","commenter_b":"That bitch should get shot","commenter_a":"Leave blondie","post_message":"Share if you agree."}]
