[{"comment_id":"578535808963586","commenter_b":"Little beaver !","commenter_a":"10208389159192541lol smh","post_message":"Happy Groundhog Day—here's to six more weeks of winter. Thanks to Believing in imaginary friends and fairy tales is outside of my age bracket for sharing."},{"comment_id":"1270891722952389","commenter_b":"@username says the woman whose profile pic says \" Make America Kind Again\"","commenter_a":"You know being born in this country is a requirement to be president.. There is no requirement to provide tax returns just in case you were wondering. If the dems win and Hillary is president you liberals better be ready to open your homes to refugees because they will be stuffing them into this country and fast as they can. The dems only care about one thing.. Power.. Staying in power and keeping others from having any including the citizens which is who should have the power. Take a look at what's happening in Europe right now it's not long before its happening here.. But the media won't report it because the dems will try to keep it from you. That's right the media is biased.. All media one way or the other.. So drink your flavor of koolaid and get ready because the liberals in this country are coming ...","post_message":"Great question, Mr. President. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153669076314641","commenter_b":"Stop immigrant in Europe","commenter_a":"ISIS/ISIL/ the so called religious GROUP they r not MUSLISMS they created by americans & isreal 2 blacklash islam! ABOUT JAHADY JOHN as his from where he born said AN \"ANIMAL A DOG\"","post_message":"\"Jihadi John,\" who may have been killed in a U.S. airstrike, is a Kuwaiti-born, middle-class Londoner."},{"comment_id":"10155112416861729","commenter_b":"Just ignore the cockroach she will leave.","commenter_a":"Whoever voted already needs to go and vote again in November 8th! We have learned (thanks to Hillary ) that we can vote multiple times! That way the democrats won't be able to control all the votes!!","post_message":"Your feel-good story of the day, folks!"},{"comment_id":"10152619988623525","commenter_b":"With lots of glitter...","commenter_a":"So, what will the bathroom towels have on them??????","post_message":"UPDATE: Hillsborough County Clerk Pat Frank says the office is ready to issue same-sex marriage licenses Tuesday morning, and she has reserved the park across from the office for potential crowds. \"I was hoping Judge Hinkle would revisit it and he's made it extremely clear now that it applies to every clerk in the state, that the ban against gay marriage is void...it never existed.\" MORE: @webpagelink"},{"comment_id":"1032518616814893","commenter_b":"Watch her pop that shit out right in the gym straining to hard","commenter_a":"People are so stuck on looking good they don't even take time out to enjoy being pregnant it's sad and looks nasty!","post_message":"Fitness Model Chontel Duncan Isn't Stopping Her Intense Workout Sessions Even During Her Pregnancy!"},{"comment_id":"10152562554341636","commenter_b":"Time to persecute muslims everywhere.","commenter_a":"I will never support terrorism but I also think we have to respect other people's religions...","post_message":"Ahmed Merabet had raised his hands up in surrender before being shot dead..."}]
