[{"comment_id":"10153459278655667","commenter_b":"Instead of talking about it, how about you guys do something about it? No amount of talk will stop someone from raping another.","commenter_a":"This is an incredibly important topic at the University of Pittsburgh. My fellow Pitt classmates are trying to continue the conversation and created this video about the objectification of women on our campus. If you feel strongly about the right to consent and say no, and want to support college students trying to make a difference check this video out: @webpagelink","post_message":"Vice President Joe Biden delivers an incredibly powerful and passionate speech on survivors of domestic abuse and rape at the University of Pittsburgh."},{"comment_id":"1411220458918808","commenter_b":"I honestly think you just don't understand because you have never been through it. Hopefully you never will. It's a tough road as a parent. But My SON JASON is the love of my life!","commenter_a":"why do people with autistic children often talk about \"mourning the death of the child they thought they had\"?? its the same kid. we're not car accidents to be grieved over. we are people.","post_message":"Greg and Maya are doing everything they can to make sure their son with autism is safe, comfortable, and — most of all — happy. Parenting 2.0 | An Upworthy Original Series"},{"comment_id":"10153527225684255","commenter_b":"pre-civil rights and more white privilege.","commenter_a":"War. Environmental disdain. Injustice for all but 'ordinary white folks'. Coat hanger abortions. Dirt roads. Family 'secrets'. Weapons. Vigilantes. Klansmen, those gallant white knights of chivalrous times. Tarring and feathering of \"revenues\". Constitutionally inspired militia to kill picketers and whining war vets. Cold hearted popes. Freedom to convert Jews to Jesus by whatever means necessary. Make hatred cool again.","post_message":"What do they mean when they say that? To which supposed golden age of America do they want to return? Who can say what is in the hearts of such people? #DailyKosClassics By Daily Kos user Steven D"},{"comment_id":"10153109676116051","commenter_b":"Fire the bitch","commenter_a":"UNBELIEVABLE ,THEY SHOULD BE CHARGED WITH THAT POOR LITTLE BABY DEATH,PRAYERS FOR THE FAMILY","post_message":"This EMT was dispatched to a home where an 8-month-old baby desperately needed assistance. The family was begging for help at this point. The EMT had a different plan, though."},{"comment_id":"10156643152565354","commenter_b":"Looks like a bad week for the Hollywood elites. He and Jada can cry on each other's shoulders. Just goes to show you that living in a mansion in Beverly Hills, riding in chauffeured limos, traveling the world and having the best of everything, still doesn't make these people happy. Pitiful!","commenter_a":"Booob!!!","post_message":"BAHAHAHA!"},{"comment_id":"10153206472131636","commenter_b":"Well said. If someone wants to dress from head to toe in black I have no problem with it, but full face coverage I find offensive and frightening. You can't read the expressions of a person with their face covered. Is it male or female? It's not necessary and definitely should be banned in the UK.","commenter_a":"There's a difference between Muslims who just wear the hijab (headscarf) and the niqab (face veil). The latter is simply cultural and is an import from Saudi Arabia and other countries that oppress woman (husbands don't like other men looking at their wives so will often make them wear one ) There is nothing in the Quran that says a woman has to wear one. I spend a lot of time in the Middle East and when in Rome and all that. It's not appropriate to have the niqab in our open society. British people might be tolerant but they don't have to be about absolutely everything. Women who wear the niqab segregate themselves from society. It's a barrier. The French have banned it and some other European countries have done the same. Britain should too. And before people start waving the \"islamophobic\" card. I happen to know a lot ...","post_message":"Staggeringly"},{"comment_id":"891767890959271","commenter_b":"She is so evil ...","commenter_a":"Ps..any one remember Al Gore and how graciously he accepted defeat..and why would HIllary allow science and fact to get in the way..","post_message":"Fact-Check: Hillary Clinton’s claim that partial birth abortion should be protected due to a number of women who have serious health issues is not supported by research."}]
