[{"comment_id":"747501402054427","commenter_b":"Wouldn't happen to my children. My kids are five,three and one. They know better than to go into a wild animal pens. Plus me and my wife keep our eyes on them all the time. Hands are held too at all times. No excuses for that gorilla to be killed. The parents were neglectful and should be charged with neglect and child endangerment. That gorilla didn't ask to be in the pen. Then to be killed for being a gorilla. I'm not saying leave the kid to die either. Sad situation that should of never happened.","commenter_a":"For all of those slamming the zoo for killing the gorilla, what if it was your kid who fell in? Would you want the zoo to let your kid die because the gorilla was endangered? We all need to think and put ourselves in others shoes before we start spouting off on things.","post_message":"Jack Hanna says he agrees with the decision that the Cincinnati Zoo made in killing the gorilla that was dragging a toddler who fell into its enclosure. Learn more: @webpagelink"},{"comment_id":"1370796892943097","commenter_b":"That was the sunniest, rainy Portland day with which I've ever been blessed","commenter_a":"How's Trump in his press secretary going to lie about this one? LOL","post_message":"Incredible images of the women's march protest happening all around the world."},{"comment_id":"10155254752442908","commenter_b":"@username Is that right? My life is in order. I am a home owner. I have had the same employer since 1994. I have never been on food stamps or welfare. I never take a vacation. If I do take time off, it is to do chores that has built up around the house. My wife (which also has a job and the same employer for 5 years) and I had 2 children, and raised them to be hard workers. Both my daughter and son in law to be have jobs. My daughter has two jobs. They are not planning on having children until they actually have their life started, and a place to call their own. They both have their own vehicles. Ones they have worked for and were not just given. Compare that to your life. Let me know... Then we can see who has spent their life ...","commenter_a":"Funny how some of these people are using the term 'greedy' to describe the rich, only to say that THEY want more money...face-palm.","post_message":"A few years ago, a $15 minimum wage was considered too radical. But when people see the justice of an idea, it catches fire very quickly."},{"comment_id":"1041072545948147","commenter_b":"You look like a witch already","commenter_a":"this the third post i've seen with this baby and all the \"after\" babies are different babies...the jig is up!!! i'm starting to suspect the witchcraft claim is true...this baby has changed to even 3 different complexions and facial features or somebody has nothing to do by come up with lies to make themselves feel righteous!!!!","post_message":"A little positivity out of a horrible situation 🙏 Baby Hope, who was found starving on a street in Nigeria after he was abandoned by his family over accusations of witchcraft, makes extraordinary improvements since he was helped by Danish aid Anja Ringgren Lovén."},{"comment_id":"10153621323058812","commenter_b":"oh grow up Jennifer!","commenter_a":"the cop over reacted why would she have to put her cig out. Give her a fine and move on!","post_message":"At press conference, Sandra Bland's sister shared that she believes Sandra's arresting officer Brian Encinia was \"picking on her. Point blank, period.\" @webpagelink"},{"comment_id":"582952285239212","commenter_b":"Vote Trump! Not crooked Hillary","commenter_a":"Trump is nothing but a narcissistic coward. He likes to dish it out but he can't take it. Semper Fi","post_message":"Watch: POWERFUL and MOVING... This WWII Veteran and former POW is literally brought to tears in this impassioned plea to Americans to keep Donald Trump away from the presidency. Let's make this brave veteran go viral. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153302631606636","commenter_b":"@username first claimed that all Muslims were terrorists and then claimed that any who thought so we're bigots. She must be so ignorant that to think that there are others that cannot read fast and with great stamina farer than her thoughts drivel out.","commenter_a":"Let me tell you there is no moderate or conservative Islam. Islam is Islam. There are not two Islams. Let me also mention that anybody harming any innocent person has nothing to do with Islam.","post_message":"It strictly follows Sharia rules"}]
