[{"comment_id":"871246712910789","commenter_b":"The face of an ugly, pathetic bitch.","commenter_a":"I would never have breast fed my daughter in public. A woman can go to the ladies room or bring a bottle with her when she's out. I think it's distasteful to breastfeed in public.","post_message":"\"I was almost in tears and creating my own wet t-shirt contest by the time I could pump again.\""},{"comment_id":"1016582615062710","commenter_b":"I bet her tits are as ugly as her face. Just sayin.","commenter_a":"You are absolutely the dumbest white woman I have ever seen.","post_message":"Another day, another crazy comment from the View crew."},{"comment_id":"756073464525834","commenter_b":"The best part about all these whining Christians & their rhetoric to defend Christ against a money hungry corporation(which bye strives to destroy mom& pop coffee shops) when ppl are already starving to death or hooked up on drugs. Your Christmas was actually started by Constantine, centered around & similar to pagan holidays to make the transition to Christianity easier. Constantine was actually a pagan until his death bed to where he rejoiced unto God and saved his soul. Why don't you silly Christians who so vehemently judge and live so unlike jesus did do some research on the Christmas tree... It's also pagan, right down to the star on top to the ornaments around it. America was founded on freedom of religion, but that only seems to apply if it's Christian. And yes, the indigenous natives were massacred by bible carrying spaniards, priests, English, Dutch etc. It doesn't matter ...","commenter_a":"This is my last bit about the god forsaken red cups (no pun intended), and thats it. And please read before commenting. Starbucks, is not \"catering to people outside this country\"... Starbucks is a free enterprise, and not obligated to tell you Merry Christmas, in fact, they are not obligated to even do something for the holidays. There are many born and raised here with different faiths and they ALL believe in god, just not Christmas. For example the Jewish believe in God whole heartedly, just not Jesus, which Christmas is about. They also celebrate Hanukkah this time of year. Christianity is not even the first religion in this country, and Christians came here and slaughtered the indiginous for not being Christian, so it's not surprising they still don't accept other religions or respect them. That being said, businesses SHOULD absolutely have the right to say Merry Christmas If they ...","post_message":"Oops doesn't really cover it."},{"comment_id":"998135870245890","commenter_b":"One thing about Hillary she's use to it","commenter_a":"Who are they going to blame when the current President is gone? If GOP members weren't so low information they'd know that these gifts stay with the US government unless the Obamas reimburse the government for the price of the \"gifts\". Another pathetic attempt to start an issue there isn't one.","post_message":"Once again, the right-wing media left out a few important details..."},{"comment_id":"1030490090346441","commenter_b":"Time to build a wall around Chicago.","commenter_a":"It's white people's fault...or financial disparity, or whatever else they want to blame all their actions on","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter @webpagelink"},{"comment_id":"1573408882718854","commenter_b":"These women are crazy to boycot her clothes. She is so classy.","commenter_a":"Please leave Ivanka out of this. She is a hard-working, talented woman, and her clothes are beautiful and affordable!","post_message":"Feeling the chill, Ivanka Trump?"},{"comment_id":"1328476607175126","commenter_b":"Lachy are you mad?! Let's do the gym like this next year! A Christmas wonderland","commenter_a":"@username Lachy Munro","post_message":"You think you love Christmas? This couple has more than 100 Christmas trees in their house."}]
