[{"comment_id":"953884527999046","commenter_b":"SCUM","commenter_a":"Ryan's as bad as the great imposter Obummer....","post_message":"BARACK OBAMA Finds Friend In “Fundamental Transformation Of America”: Shocking Way Ryan Betrayed Americans With $1.1 Trillion Bill Funding for Sanctuary Cities, benefits for illegal aliens, fully funded refugee programs, quadruples number of work visas for foreigners, release of criminal aliens, tax credits for illegal aliens and more..."},{"comment_id":"1134361886576067","commenter_b":"Totally agree!","commenter_a":"We need to have Trump supporters at all polling places. ALOT of cheating will be going on to stop Trump GET THIS WORD OUT.","post_message":"Things could always change, of course nothing is ever set in stone in a presidential race. But for the time being, Trump not only the party frontrunner, he is actually defining the race for everyone else"},{"comment_id":"1848158328804181","commenter_b":"Why would he not mention her. The media is so biased you know they won't mention her in any other way then to make excuses for her.","commenter_a":"Can he EVER answer a question WITHOUT mentioning Hillary Clinton??","post_message":"Donald J. Trump to George Stephanopoulos on being criticized for taking time off campaign trail to open new hotel: “Nobody complains when Hillary Clinton goes to an Adele concert.\" @webpagelink More tonight on ABC World News Tonight with David Muir and tomorrow morning on Good Morning America."},{"comment_id":"553770641467261","commenter_b":"Who even cares what that woman thinks? She's a murderer!","commenter_a":"Fricking Amazing, right!?!?! What a POS","post_message":"Is this hypocritical? WATCH: Hillary Clinton called out Donald J. Trump for his lavish lifestyle, despite living in luxury herself."},{"comment_id":"10153444568593984","commenter_b":"hillary shouldn't even be allowed to run, she and all her and obamas co-horts should be in jail for treason. and what would be so bad about going back to the 50's. that was a great time to grow up. at least the govt. was 80% honest and not 99% dishonest. if she gets elected then something is diffinitely wrong with this country and the people in it.","commenter_a":"Sorry Mr. Levin but unless the Republicans can come up with a candidate who doesn't still live in the 1950s and can stay out of people's bedrooms, Hillary will win.","post_message":"BOOM! Outspoken Levin just stepped up to the plate and asked what everyone else is thinking. Hillary will NOT like this one bit... Do you support Mark Levin?"},{"comment_id":"10153119692871130","commenter_b":"ughhh these bitches Emily Lee","commenter_a":"Can't wait!","post_message":"See how far women's rights have come in the first trailer for one of the year's top Oscar contenders: Suffragette, starring Carey Mulligan, Helena Bonham Carter and Meryl Streep."},{"comment_id":"1220297847993003","commenter_b":"174742062548592helle Simons, she had the ability to dispense medicine to stop their suffering and didn't. That makes her a monster.","commenter_a":"I think this article is written very poorly and from a single minded view . Being Saint does not mean that you are perfect as no one is . It means you have strived all their lives to fulfill Christ mission and to serve God . If you don't believe in the church values and mission then why do you care who we canonize? Also when it comes to caring for people with a large organization things are much more complicated . There are many people who max out on pain killers and still feel pain in the hospitals. So when it comes to pain meds that are very valuable and they may not work why administer them ? In places like Calcutta it is not just a question of money but also transportation . They in fact hold more money then they need to but I very well doubt ...","post_message":"Is Mother Teresa a saint or an expertly-managed brand?"}]
