[{"comment_id":"10154335459871509","commenter_b":"Bret, insults show a lack of intelligence, but continue.","commenter_a":"10 Reasons for Supporting Trump 1. Donald Trump is immune to special interest lobbying because he has accepted no donations or special interest money. No other candidate can make this claim. 2. Trump knows how to negotiate. No one builds an international business empire the size of Trump without being able to win at the negotiating table. 3. Donald Trump is an executive. The President of the United States is the Chief Executive Officer of our nation. We don need a policy expert or a legislator we need someone who knows how to run an organization. Trump is the only candidate who has a proven record as a successful executive on a large scale. 4. Trump is a man who tells the truth. He may not always say it in the most polished way, but our country has had enough suave liars. It is time for some straight forward honesty. ...","post_message":"Emotional scenes at Vancouver airport."},{"comment_id":"864666960316353","commenter_b":"I know! Power to the feminists. But that would make me feel dirty .","commenter_a":"Grace Te Moananui @username","post_message":"Armpit Hair Is Trending, And It’s A Step Forward For Women Everywhere"},{"comment_id":"10158270376090381","commenter_b":"Wacky Woman!","commenter_a":"Perserverance! Thanks for keeping us strong!","post_message":"Last night, Majority Leader Mitch McConnell attempted to silence not only Senator Elizabeth Warren, but the late Coretta Scott King. It was a shameful attempt to stifle the thorough debate on President Trump’s nominees that the American people expect and deserve. I applaud Senator Warren and my Democratic colleagues in the Senate for fighting on behalf of the millions of Americans who have demanded that the next U.S. Attorney General be committed to upholding our most fundamental constitutional rights. In the battles to come, both in Washington and in communities nationwide, I urge my colleagues to follow Senator Warren’s lead—as she persisted last night, so must we. We do not have the right to remain silent."},{"comment_id":"10152676390231519","commenter_b":"I always come across people who like to talk shit while hiding their face. Typical","commenter_a":"Mentioning Faux News isn't a \"liberal\" thing. The ones who mention it are humane, educated, not ignorant and are not racist. That's not \"liberal.\" People that watch Faux News other than for the laughs are both ignorant and racist. Period. They also hate democracy, hate poor people and hate minorities - I.e., they are thuggish punks. Wear your badges proud, you cowardly fascist creeps!","post_message":"This could end Brian Williams' career..."},{"comment_id":"1002924903097372","commenter_b":"Sad part is there are a lot of people in denial and they will actually vote for this idiot woman","commenter_a":"All today has shown America is that @username will make an outstanding president and that the Republicans are vindictive liars. The Republicans have admitted to spending over 4.5 million dollars of taxpayers money to fund a \"witch hunt\" designed solely to discredit Secretary Clinton and take down her poll numbers. They have confessed to this.","post_message":"Hillary has been testifying at the House Select Committee on Benghazi for hours, and what have we learned? That she was a Secretary of State devoted to upholding our nation's values abroad, practicing smart foreign policy, and keeping our diplomats as safe as possible. Add your name to say you're with her: hrc.io/201PFma"},{"comment_id":"547324122108733","commenter_b":"Hearing her, and the rest of these contemporary crashing bores, causes me macroaggressions","commenter_a":"This nation no longer understands the cause of anything. We have managed to create a group of retards who are only concerned with their own personal agenda, while at the same time, they have abandoned common sense and common decency...","post_message":"\"One day, these privileged snowflakes armed with their microaggressions will be in charge of HR departments all across the fruited plain,\" says Todd Starnes."},{"comment_id":"10156429465415354","commenter_b":"Whoopi, you dirty looking bitch Those Islamic Muslim women are in danger of being deported Our female population on the other hand is under threat of gang rape and murder by the Islamic Muslim terrorist.","commenter_a":"Moron...","post_message":"WATCH Whoopi unload on Donald Trump..."}]
