[{"comment_id":"10154322509929087","commenter_b":"Truth Hurts huh you little bitch? go whine and cry somewhere else. you sound like a little girl.. Here I'll give you your wubby","commenter_a":"This is the death of the Republican Party written as a victory. The backlash will be fierce and overwhelming if Trump behaves in office as if he has a mandate.","post_message":"#BREAKING: Hillary Clinton 's popular vote lead over Donald J. Trump is now over 2.3 million or 48.1 percent of the vote."},{"comment_id":"10152940675830090","commenter_b":"Someone who will secure our borders and send aliens back. It would be cheaper to send them back than to support them. Why should anyone want to work. But, those with pride will work 2-3 jobs to make ends meet.","commenter_a":"Jeb Bush and VP Mit Romney.","post_message":"The White House has been BLUE for too long—In 2016 we're taking it back. Start by taking the GOP Presidential Straw Poll: @webpagelink"},{"comment_id":"10154700098471323","commenter_b":"All talk of this being an exercise in protecting democracy is simply a smokescreen. This lady is a member of the privileged elite aiming to derail the Brexit we voted for by seeing it completely emasculated to the point where the status quo will be preserved. The bankers and fund managers will never allow ordinary people their freedom. Only the rich are allowed to be free.","commenter_a":"All MPs are Selfserving PARASITES .The People have VOTED DEAL WITH IT .And Start bye getting our Borders sortted and RIP UP ALL EU LAWS Because we never needed them .FACT .And Stop Foreign Aid.We carnt afford it.And Spend the money on the people that need it in the UK..","post_message":"\"Neither the British people nor parliament have, however, voted on what form that leaving should take, or on which fundamental rights will be removed as a result of leaving. Those are questions that can be decided only by our sovereign parliament.\""},{"comment_id":"537543736410961","commenter_b":"Elizabeth Warrren for VP on a Sanders/Warren ticket!","commenter_a":"Another socialist","post_message":"“I think that what the Democrats are doing is terrific,” Sen. Elizabeth Warren said. \"We’re out talking about the issues. I look at the Republican debates and the difference between what they’re doing and what the Democrats are doing that really shows who’s on whose side.”"},{"comment_id":"1686879181550201","commenter_b":"It had to be a woman. Why couldn't have just come up with a $3 bill. Leave well enough alone.","commenter_a":"Of all the really great black statesman the US has ever produced, wonder why they didn't pick Frederick Douglas, MLK? Oh yeah, they were republicans and Douglas said any black that would vote democratic was an idiot. Of course people are so ignorant now I have read where people have stated the democrats drew up the legislation for the civil rights act, in reality passed by a republican congress with a reluctant Democrat, Johnson signing it. Ignorance abounds","post_message":"BREAKING: OBAMA SUCCESSFULLY WHITEWASHES AMERICAN HISTORY…”Racist” President Andrew Jackson To Be Replaced With Harriet Tubman On $20 Bill"},{"comment_id":"10152595284751519","commenter_b":"If only the women on Fox News would start wearing tampons for earrings, maybe they'd be taken more seriously.","commenter_a":"How can any thinking woman vote republican? Stepford Wives comes to mind. How does the republican platform support women? Oh and Glen, ACA is winning. Read.","post_message":"We don't have to take Fox News' lies any longer. Here's how we fight back."},{"comment_id":"1099534980113254","commenter_b":"Anderson cooper is a killery bitch","commenter_a":"The country will be dancing in the streets if that happens. If anyone can get the job done, it's Donald J. Trump!!","post_message":"Donald Trump says he will prosecute Hillary Clinton if he becomes President of the United States."}]
