[{"comment_id":"950601424986485","commenter_b":"It is none of your concern if a person has an abortion, mind your own business!","commenter_a":"if a woman is too careless/stupid to not have 'protected' sex, then she gives up her right to murder an innocent child! BE A RESPONSIBLE PERSON not a murderer!!!!","post_message":"An excellent idea!"},{"comment_id":"10154490897799657","commenter_b":"That bitch wants your guns so she wont get shot.","commenter_a":"she is brain damaged","post_message":"How far is Hillary willing to go to get your guns?"},{"comment_id":"10156066398495354","commenter_b":"Just can't handle the truth or face reality can you, imagine that, a black playing the race card, what a shocker!","commenter_a":"Ramos may be Hispanic, but he is also rude and disrespectful to the other reporters in the room.","post_message":"Or maybe... because they attacked him first?"},{"comment_id":"10153097498516636","commenter_b":"She's attention seeking plain and simple","commenter_a":"She makes a good, logical point in my book. Why should menstrual blood be considered different than any other blood depicted in film, TV or video games? Can't have it both ways... I admit it's a pretty extreme way to make that point but you can't argue with the logic.","post_message":"Period drama"},{"comment_id":"854726854659317","commenter_b":"Build the wall","commenter_a":"The Donald has done it again @username","post_message":"I don't have time for political correctness and neither does this country. Donald J. Trump"},{"comment_id":"10153424886503598","commenter_b":"How do you plan a family without having a man involved. What they have encouraged is the prostituition of women both in devaluing young girls and women and when they become pregnant pretending to help. But their motive all along was to take a product that costs them nothing and process it( dissect and distribute) to the highest bidder.) to be used for unimaginable purposes. This philosophy is one of the most vile known to humankind. I know a woman who was told by her father when she was a teenager if you get pregnant you nor the child will be helped by me; she would be disowned. This man was a leader in his church but he had absolutely no Love from Christ in his heart. That is not Father God 'a kind of love. That is the kind of hard hearted ness that allowed these baby slaughterhouses to ...","commenter_a":"Amen","post_message":"After 27 Years of Killing Babies in Abortions, Abortion Clinic in Virginia Shuts Down for Good"},{"comment_id":"1676979775916397","commenter_b":"IF TRUMP CANT HANDLE SOME FEMALE MODERATOR HOW THE HELL WOULD HE HANDLE WORLD LEADERS? GIVE ME A BREAK. DONT EMBARRASS THE REST OF THE COUNTRY NH!!!","commenter_a":"New Hampshire vote for him! Trust Trump! Thank you for volunteers!","post_message":"I enjoyed a great breakfast at the Airport Diner! Everyone get out & vote in New Hampshire! Lets MAKE AMERICA GREAT AGAIN! Voting questions? @webpagelink"}]
