[{"comment_id":"10152952742422507","commenter_b":"I don't see how feeling guilty about things that happened hundreds of years ago has anything to do with what's happening now. Especially when it was perpetrated by not one person living today. It isn't about keeping people from coming here, as my grandparents are immigrants. It's about how they go about doing it. There is a right way and a wrong way. I see it everyday, the advantages people take of a broken system. If you choose to leave your blinders on to facts, that is your choice. Ignorance is bliss.","commenter_a":"WOW... it's been over half a millennia and this story has repeated all over the globe throughout history affecting all people everywhere at some point or another. This shit is pathetic to bring up.","post_message":"Turns out..."},{"comment_id":"1113637395343398","commenter_b":"Bye Bitch!","commenter_a":"Now that is ridiculous! Waste of time and very presumptuous woman.","post_message":"Fox News host Harris Faulkner is furious that a cute hamster toy bears the same name as her -- and she wants $5 million from the company that created it."},{"comment_id":"728722383954381","commenter_b":"this shit sad most if not all terrorist are from s Arabia and suni.. it hasn't even been 1 Iranian terrorist. and they fund ppl to defend they city that's not called funding terrorist. fuck trump AZ a U.S. citizen. I'm a shame of this racis country. that's why I fucking moved. fuck that bitch and his racis face. let that bitch try to come fuck w iran and see what happens. wer not Iraq or Syria. none of that. we strong. and we got them nukes and Russia and China fuck w us. let Israel bitch ass make move😎fuck Israel and s Arabia","commenter_a":"Should be interesting to see this brought up in Surpreme Court...","post_message":"The Muslim (country) ban."},{"comment_id":"1015223798498631","commenter_b":"I see what you did there","commenter_a":"That's gold","post_message":"Sorry folks."},{"comment_id":"10150666434674999","commenter_b":"Haters are a sure sign that future President Trump has hit the nerves of all those left wing panty waste liberals that pulled their heads out of the sand just long enough to realize that Hillary isn't the omnipotent goddess they thought she was. Dry those tears little babies. Like.....wipe it with a cloth.","commenter_a":"This country is such a mess, it would probably take a Donald Trump to get us back on track. Shows how far we have sunk. Thanks Obama.","post_message":"Something unmistakable has happened to Donald J. Trump since he announced his campaign for president in June: He has become a better candidate."},{"comment_id":"10153739914549714","commenter_b":"@username I was going to say that. Both are smokin' tho.","commenter_a":"Cara looks like a dude without makeup","post_message":"Richard Madden was pretty critical of Cara Delevingne and her cringeworthy Good Day Sacramento interview."},{"comment_id":"1171399196245487","commenter_b":"She's better than me!..step into my personal space uninvited and your eye will get dot!!!","commenter_a":"Where's the guy in the 8 ball jacket when you need him???","post_message":"A racist Trump supporter went ballistic on a black subway passenger in NYC. #MicBrights"}]
