[{"comment_id":"10153469428757144","commenter_b":"Those beautiful little WHITE girls are gonna be so bummed out when they come to understand that THEY are the minority. All that was missing in their routine was the Zeig Heil!","commenter_a":"\"Tomorrow Belongs to Me\"","post_message":"The internet is freaking out about this video. Watch it and you'll understand why."},{"comment_id":"1801596090092193","commenter_b":"Rot in jail bitches","commenter_a":"You mean to tell me. These people are so dumb that when they went out to do something this stupid. They didnt know anyone that would or could bail them out?.. That is pathetic","post_message":"Charlotte protesters want people's money for bail."},{"comment_id":"10152871641536051","commenter_b":"My husband served 20 years for this country and then a bitch like u get the freedom. U need to get the hell out of here and there may be someone out there that will really get mad and look for u bitch.","commenter_a":"Then WHY IS SHE HERE??? OHHHHH!!!! Cause she makes her $$$$$ here. Proud Americans STOP SUPPORTING THIS LOSER!!!!","post_message":"This musician says she hates absolutely everything about America."},{"comment_id":"1152030998150262","commenter_b":"You wouldn't believe it even if it was released. You'd say it was staged. Let the girl rip.","commenter_a":"How about releasing ALL the footage of her before , DURING , and AFTER her untimely murder!!! Its easy to let America view when she was alive. BS!!","post_message":"\"This video should demonstrate that people who are out there going through a lot of trouble to spread lies and mis-truths on Waller County — we are not going to stand idly by and allow that to happen.\""},{"comment_id":"10153044064759456","commenter_b":"That is exactly the thought that went through my head!","commenter_a":"Yet this A**hole gets a $500,000 bond.....whew this judicial system!","post_message":"A Montgomery man is being held on a $1.25 million bond after being arrested for allegedly trafficking methamphetamine. @webpagelink"},{"comment_id":"10152841288932061","commenter_b":"I LOVE Johnny Depp and most of his movies. This is disappointing. He should just send them home. Save their lives. They should not have to pay for his stupidity!","commenter_a":"Everyone else has to do this and so do you,Depp!","post_message":"Depp is in Australia to shoot the fifth edition of of the Caribbean, called Men Tell No Tales.\""},{"comment_id":"10155694737870294","commenter_b":"Why not?! Criminals can do it like gun-free zones didn't exist!","commenter_a":"Doesn't matter they'll do it anyway.","post_message":"Even if it passes, each university would still be able to decide if they wanted to allow guns on their campus."}]
