[{"comment_id":"10153281993713132","commenter_b":"She's beautiful, they would make a great couple","commenter_a":"What!?!?! Noris Lizbeth Robles","post_message":"But don't expect them to open up about their maybe-relationship any time soon. #Oscars"},{"comment_id":"1098350870176382","commenter_b":"All ILLEGAL immigrants are criminals. Come here legally and I will welcome you with open arms and warm smile.","commenter_a":"anyone with common sense knows that all immigrants aren't criminals, just like all whites aren't bigots, all blacks aren't ignorant, and all hispanics aren't lazy.","post_message":"ICE program focused on ‘national security’ detains immigrants with zero criminal convictions."},{"comment_id":"10153615779772452","commenter_b":"Fake IDs are already illegal. It's a third degree felony.","commenter_a":"17 and in a nightclub? Maybe now we should BAN fake ID'S. Should of never been there!","post_message":"One of the youngest victims of the #OrlandoShooting was 18-year-old Akyra Murray, a recent graduate of West Catholic Preparatory High School in Philadelphia. She graduated third in her class just last week. She was in Florida to celebrate her graduation and visit her brother."},{"comment_id":"10153478052978984","commenter_b":"This girl is one ignorant PIG !!","commenter_a":"This spoiled brat is headed down the same road as Brittny and Lindsey. She needs prayers not publicity.","post_message":"Pop star Miley Cyrus just said something highly disturbing about Christians. It's especially sad when you consider where she came from..."},{"comment_id":"10155083980414203","commenter_b":"April BABIES have NO REALITY according to YOU! THAT IS WHAT IS CRAZY. I don't listen to insane lunatics April.","commenter_a":"Thank you Pence for deciding what women can do with their bodies. When the time comes, if it hasn't already, that you need Viagra or any other penile disfunction medication or treatment, we will decide if you can get your dick pills or not. Oh and, fuck you Pence!!","post_message":"Today was a Mike Pence crowd."},{"comment_id":"922742544437395","commenter_b":"It's not so much stupid and idiocy as it is vicious.","commenter_a":"Mississippi. Period. Point Blank. (sorry to paint with such a broad brush, but.............)","post_message":"This racist needs to be fired now. Sign the petition to have him removed from office: @webpagelink"},{"comment_id":"990789407625962","commenter_b":"In coming President~Trump ^ seek and destroy all opposition within our borders and outside our borders VOTE TRUMP","commenter_a":"These and all jehadic Muslims are evil and need to be killed period.","post_message":"Who saw this coming? [Read below]"}]
