[{"comment_id":"1698726270383299","commenter_b":"@username I DON'T KNOW WHAT YOU ARE SMOKING OR DRINKING BUT EVERY SINGLE DAY HE LAYS OUT POLICY....1. CLOSED BORDER, 2. DEPORT ILLEGALS, 3, BUILD A WALL. 4 HEALTH INSURANCE OVER STATE LINES SO IT IS COMPETITIVE. 5. BUILD THE MILITARY...6. IMMEDIATELY DEFEAT ISIS...7 SMART TRADE NOT JUST FREE TRADE WHICH BROKE THE COUNTRY..8. CUT TAXES FOR MIDDLE CLASS..9...TAX COMPANIES GOING OUTSIDE THE USA TO MANUFACTURE AND SELL HERE WITH NO PENALTY. 10. SMALLER GOVERNMENT, TRIM COSTS, AND WASTE. 11. PLACE CONSERVATIVE JUDGES ON SC...HE WILL NAME THE CHOICES BEFORE ELECTION 12. PRO LIFE...13.NO SALARY FOR HIMSELF 14. EDUCATION BACK TO THE STATES...NO MORE COMMON CORE...I GO ON BUT YOU NEED TO PAY ATTENTION AND STOP SPOUTING LIES....YES ONCE HE GETS IN...THE PENTAGON AND OTHERS WILL GIVE HIM INFO HE DOES NOT YET HAVE ACCESS TO...BECAUSE OF THAT NEW INFO, HE MAY HAVE TO ALTER THINGS SOME...THAT'S TRUE OF EVERY ...","commenter_a":"Yeah. Donny Trump and his lackeys DO NOT get to redefine what a conservative is. Many many real conservatives have fought hard, long battles over the decades to pull this nation back onto the constitutional rails advocating for founding principles. This fight has always been against politicians of the democrat party and republican establishment put there in part with Donny Trump donations. Where was Donny when some were standing tall against amnesty? Where was Donny when some were fighting Obamacare? Where was Donny when some were fighting to get Planned Parenthood defunded? Where was Donny when a certain someone was fighting the unconstitutional DC gun ban? Where was Donny when average citizens were having their homes confiscated by local governments so rich people could use them instead............... He was on the other side, or silent......because it didn't benefit him personally to be on the right side. Trumpers are for a ...","post_message":"Dana Loesch unloads: \"She made it personal first — I’m just doing it the Trump way: you come at me, I’ll come back at you three times as hard. You like it now?\""},{"comment_id":"10154848659386509","commenter_b":"Disney will think twice about hiring him now","commenter_a":"He deserves it and never should have left his wife for that homewrecker ! His children should appeal anything and everything this tramp wants.","post_message":"A Los Angeles judge has granted Amber Heard a temporary restraining order against husband Johnny Depp."},{"comment_id":"10154165765599091","commenter_b":"#DrainTheSwamp #PayToPlay #RiggedElections #VoteFraud #NastyHillary #MAGA #CrookedHillary #NeverHillary #HillaryForPrison2016 #LockHerUp #BuildTheWall #BringBackJobs #LatinosForTrump #NoMoreClintons #BenghaziButcher #DefeatSocialism #BanIslam #EmailGate #CorruptMedia #ObamacareFail @webpagelink","commenter_a":"Congratulations and God bless!!!","post_message":"CONGRATS! Five female firefighters have graduated from the New York City Fire Department (FDNY) academy -- the most women to join New York's Bravest since 1982!"},{"comment_id":"1791974164423219","commenter_b":"@username Mexico has a wall at the south boarder but yet it's all ok for them? They built it to keep the freeloaders out, but it's so wrong for America to do it? Sorry if you want to be over run with illegals go move to Mexico. Otherwise support YOUR COUNTRY FIRST!","commenter_a":"Difference Clinton isn't a racist all Hispanics rapist, murders and thieves. Name one nation that has put a wall to keep a bordering country out. If every country in Europe can their border without a wall so can we.","post_message":"Controlled immigration wasn't \"extreme\" 20 years ago and its not \"extreme\" today..."},{"comment_id":"10153456933913132","commenter_b":"Oh my word!!!!! What in the hell?! If you don't want your baby there are plenty of ways to give it up safely! I will never understand women!!","commenter_a":"@username wtf is wrong with people","post_message":"Kimberly Pappas reportedly stored her baby in a drawer after giving birth in a bathroom at work."},{"comment_id":"658224230997183","commenter_b":"She's buying her way out, watch. Criminal Just like Bush/Cheney. Ever see them traveling abroad? Ever wonder why?","commenter_a":"She is Ugly and a Liar just like Bill !!","post_message":"Judicial Watch announced it has filed a proposed order for discovery with a federal court that seeks the testimony of Hillary Clinton about her use of personal email account(s) for official State Department business. Judicial Watch discovery plan also seeks the testimony of Cheryl Mills, Clinton former chief of staff; and Jake Sullivan, former senior advisor and deputy chief of staff, as well as other current and former State Department officials. Please SHARE!"},{"comment_id":"10152886398966378","commenter_b":"She makes me sick!!!!! And look at her with the big smile on her face,I'd like to smack the sh-- out of her!!!!! Loose your license!!!!","commenter_a":"Put an arrow through her head!","post_message":"NEW DEVELOPMENT: The case of a veterinarian fired over a Facebook post of a cat with an arrow through its head is heading to the DA for charges."}]
