[{"comment_id":"10152515657266717","commenter_b":"Not really applicable but you forgot \"love\" ;)","commenter_a":"Game, Set, Match. Give it up.","post_message":"Join our mailing list for a daily news recap: lgbtqn.at/mail Follow us on Twitter: lgbtqn.at/tw"},{"comment_id":"10153368767146694","commenter_b":"Those were not feminists, those were trolls.","commenter_a":"Meh to all the feminist crying. If you hate her characterization, you don't have to force the entire female gender into the issue. Also, the action figure industry is asinine. See how it screwed over Green Lantern TAS and Young Justice.","post_message":"Let's talk about The Avengers' Black Widow problem."},{"comment_id":"10153451774798132","commenter_b":"Some lesbians dress like men everyday.... Just saying.","commenter_a":"HE SAY'S HE IS A WOMAN BY ALL MEANS, BUT STILL DRESSING IN MEN'S DRESS SHIRTS?? humm I don't get that","post_message":"Here's what everyone will be talking about tomorrow."},{"comment_id":"1231960196816235","commenter_b":"Europe and America is being invaded...Those invaders who want to hurt us are being helped by our own president Barrack Obama. I have compiled videos and links that when put together, you will have a full understanding on how our country is being invaded. Please help spread this around the country--Radio stations, tv stations, governors,mayors, groups,unions, etc. Let's not act as democrats or republicans. we all need to unite and fight for our country as Americans. @webpagelink There is no refugee crisis. The six wealthy Gulf countries Qatar, the United Arab Emirates, Saudi Arabia, Kuwait and Bahrain have offered to receive exactly zero Syrian refugees. Did you ever wonder why these countries won help their fleeing Arabic Muslim companions? One word: Hijra. Hijra is the Arabic word for , used to besiege new territories.Those travelling are able bodied strong men who are very capable of doing harm. If there are ...","commenter_a":"Let them resettle with the Federal judge in his secured gated community!!!! But not on Texas!!!!!","post_message":"Texas hit a major setback on Monday after a federal judge rejected its efforts to block Syrian refugees from resettling in the Lone Star State."},{"comment_id":"1782129565361138","commenter_b":"@username SHES tying her hair up so it doesn't get in the way of the dick she about to suck bc she dosent wanna verbally apologise","commenter_a":"@username I don't get this, explain?","post_message":"Apology accepted"},{"comment_id":"10153134542104705","commenter_b":"Marianne Hutchinson maybe you should move to NZ???","commenter_a":"Merriam Mistlebauer","post_message":"The only thing we have to fear is fear itself.........and spiders."},{"comment_id":"10153066110302144","commenter_b":"No, No, No, No, No... You're in OUR HOUSE!","commenter_a":"americans welcome kenya....that kind of hecklessness cant be accepted","post_message":"\"Listen, you're in my house. You're not gonna get a good response from me by interrupting me like this. I'm sorry. No, no, no, no, no. Shame on you. You shouldn't be doing this.\""}]
