[{"comment_id":"1055356871225809","commenter_b":"Trump is clearly a tyrant.","commenter_a":"Go, @username! This man will bring down the Republic! He's a barbarian baying at the gates of our Rome. He wants to change the legal system our forefathers died for, deny us freedom of the press and access to unbiased information, encourages racism and discourages free exercise of religion. This will not end well.","post_message":"\"The Post will continue to cover Donald Trump as it has all along-- honorably, honestly, accurately, energetically and unflinchingly,\" Executive Editor Marty Baron said in response."},{"comment_id":"10152991512942377","commenter_b":"She broke the law just by living too long","commenter_a":"Do not pass go, do not collect $200M","post_message":"Hillary says she never received classified emails on her personal server. Do you believe her?"},{"comment_id":"10153570546732464","commenter_b":"I am sure that this wont just amount to more talk from you and that you will actually do something. Yeah right.","commenter_a":"GO TED, GO\"!!!!!","post_message":"Our first priority should be stopping a bad #IranDeal that jeopardizes the lives of Americans: www.stoptheirandeal.com"},{"comment_id":"1765571717063636","commenter_b":"@username STFU","commenter_a":"It's so nice to hear a candidate say he loves America and its people. Unlike Obama and Hillary who constantly tell us how horrible and deplorable we are and not fit to wipe their shoes. Vote Trump who would wipe our shoes if asked.","post_message":"An incredible evening in MIAMI, FLORIDA! This is a MASSIVE MOVEMENT. I LOVE YOU! -DJT"},{"comment_id":"10152668576767377","commenter_b":"And Hillary is a broke down bus","commenter_a":"ted needs to take a cruise, maybe to the north pole. maybe, he and santa can go ride a reindeer, and build some toys together.","post_message":"Why Ted Cruz is the Strongest Candidate for President in 2016."},{"comment_id":"1350752595003273","commenter_b":"Michelle is beautiful and elegant. However, she isn't even giving Trump a chance. We gave them 8 years. I'm so grateful Clinton lost.","commenter_a":"Good answer Trump","post_message":"During an interview with Oprah Winfrey, first lady Michelle Obama said that there was \"no hope\" under Donald J. Trump. The president-elect didn't sweat it, though... his response was PERFECT. This is why Trump will be such an epic president..."},{"comment_id":"10153028935676130","commenter_b":"You should, Chris. If you think that's ridiculous, I hope you never have a daughter and have to see her treated like sh*t by some guy who doesn't keep in mind that she's someone's daughter.","commenter_a":"The relationship dynamics between a husband and wife are a lot different than between a father and daughter. Why would a man necessarily care if his daughter is nurturing?","post_message":"Spoiler alert: It's super depressing."}]
