[{"comment_id":"1134361886576067","commenter_b":"Totally agree!","commenter_a":"We need to have Trump supporters at all polling places. ALOT of cheating will be going on to stop Trump GET THIS WORD OUT.","post_message":"Things could always change, of course nothing is ever set in stone in a presidential race. But for the time being, Trump not only the party frontrunner, he is actually defining the race for everyone else"},{"comment_id":"1354934454518383","commenter_b":"She's disgusting!","commenter_a":"Hillary ! Explain to this young girl why you support second trimester abortions ( ripping the body out limb at a time up to Five minutes before natural birth ) I'm not with that !!!","post_message":"This team has so much to be proud of. Whatever happens tonight, thank you for everything."},{"comment_id":"10152942027790399","commenter_b":"There is a word for women like her, but that would be an insult to hard working girls.","commenter_a":"That certainly says everything about her credibility, or lack thereof. :( AKA (I'll say anything for a buck)","post_message":"Megyn Kelly on msnbc: \"I’d have done O.K. there, too.”"},{"comment_id":"1065530533487804","commenter_b":"And yet she's still nasty as hell.","commenter_a":"I am a fair-skinned caucasian with vitiligo. I have always been grateful that my light skin color kept it from being as apparent as it is on a person with dark skin. I applaud the openness, but I find it interesting that the earlier pictures had the vitiligo spread on her face much more widely and less symmetrically.","post_message":"Here's a story for anyone who's ever hated feeling different — aka a story for everyone. - Franchesca \"Chescaleigh\" Ramsey"},{"comment_id":"10152708692641051","commenter_b":"Dumb girls, they were warned and went anyway.","commenter_a":"Earlier articles said they ran away to join ISIS's cause, they went , now they have to deal with their decision. Sorry, I have very little empathy for them. They basically told their parents, their government and God to go ___ themselves.","post_message":"These parents begged their daughters not to go. They went anyway."},{"comment_id":"378965758958385","commenter_b":"We need to start deporting all Muslims in this country. Or bedick them so they don't reproduce.","commenter_a":"DEPORT THEM ALL!!","post_message":"Norway started deporting radical Muslims by the thousands, then they saw something dramatic happen..."},{"comment_id":"10153306545444575","commenter_b":"Its hard to trust the justice system when everyone isn't treated equally","commenter_a":"I'm sure anyone could argue \"what the parent should have/have not been doing\"... It only takes a quick look away for something like a car accident or a child to run out in the street to happen. What's unfortunate , is that we as people, don't trust the justice system when we face situations as such and feel the need to take matters in our own hands. Praying for both of the families in this loss.","post_message":"A driver and his teen passenger were shot and killed by an unknown gunman while talking with police. Right before the shooting the driver hit and killed a toddler who ran into the street. “Today is not a good day — when an infant can lose his life, and then someone, a Good Samaritan tries to do the right thing and then all of a sudden a tragedy occurs,” said a city official."}]
