[{"comment_id":"1191285677577713","commenter_b":"The people voting for killary think they,ll get a free pass. Muslims don,t care! Go President Trump!","commenter_a":"If Trump loses I'm going to get a divorce reap all the benefits of a single mother children's free medical care food stamps free housing free utilities free cable free cell phone he will quit his job and work at a 7-Eleven and live in a separate unit from me But will still be together like they do, My kids will get free school lunches and breakfast free sports associated camps free YMCA free scholarships for free college:))))","post_message":"\"She’s going to open the borders, pack the Supreme Court and you are not going to have the same country. Maybe you like that, maybe you don’t. But we’re not going back to the status quo, period. And so Republicans need to understand if Trump loses, it is a new America, OK? A lot is on the line, whether you like him or not. That is real.”"},{"comment_id":"10152957252332434","commenter_b":"Next we'll be making adultery illegal, I suppose, because that leads to suicides as well.","commenter_a":"France is fucking ridiculous. You can't outlaw people's religious expression. You can't put people on trial for saying what they think, even if it's racist. It's fascistic and wrong. These aren't Western values.","post_message":"Le Pen compared the public prayer of Muslims to the Nazi invasion of France"},{"comment_id":"875277045852257","commenter_b":"You are a woman your body is naturally designed to bear children. It is worse when you make the choice to get pregnant.","commenter_a":"Most pro-aborts know there is an actual baby being killed. 99 percent of them have never had an abortion, yet have no problem telling others it's perfectly okay to have one. Pro-aborts are sick people.","post_message":"When was the last time you saw a baby announcement like this?"},{"comment_id":"10154170781271491","commenter_b":"Oh I bet \"she\" can run alright .. run out of the white house next year take her kids and Obama with \"her\"","commenter_a":"What a beautiful,sane & facts ridden reply !","post_message":"Just because one Obama is preparing to vacate the Oval Office that doesn’t mean everyone in his family has to follow suit."},{"comment_id":"1315765065158489","commenter_b":"I think.. Mexico already knows where the border is...start shooting.... enough said!","commenter_a":"Mr. Trump - take down that wall !!!","post_message":"Pres. Donald J. Trump wants to pay for his proposed wall by slapping a 20 percent tax on imports from Mexico. Do you think the tax is a good idea?"},{"comment_id":"10156759727355354","commenter_b":"He might make good filler for potholes.","commenter_a":"Stick your head into a stump grinder? Please?","post_message":"HUMBLE"},{"comment_id":"788288661319908","commenter_b":"Why is it that all of Trump's picks sound like great material for an Onion article?","commenter_a":"Sickening! The u.s.a. Is about to become an embarrassment","post_message":"Every single appointment is scarier and scarier."}]
