[{"comment_id":"10155891268485354","commenter_b":"Don't give a Shi# what race you are do something like this and it should be automatic death penalty!!!!!","commenter_a":"I'm surprised you can say \"black\" gangs. any one that can do that to another human should be swiftly executed for their absolute worthlessness to society.","post_message":"The gang of 6 forced \"the male victim to watch as his female companion was gang raped.\""},{"comment_id":"10154162143246756","commenter_b":"@username No, it doesn't. As a woman, you should pay attention to who thinks you aren't able to make decisions about your own body.","commenter_a":"Scalia institutionalized his vicious hatred of women and gay people and his lack of respect for the Constitutional rights of every American. If he didn't want people to speak ill of him after he was dead, he should have lived a different life. He was a hateful man and will be rightly remembered as one. Death doesn't suddenly turn a monster into Winnie the Pooh.","post_message":"Perhaps most of all, Scalia will be remembered for his scathing dissents. He was a reliable conservative, but every once in a while he broke rank."},{"comment_id":"1109554819065528","commenter_b":"Bitch please,","commenter_a":"To everyone hating on Superman, you don't have shit.","post_message":""},{"comment_id":"10153033026636336","commenter_b":"She should have let him back on","commenter_a":"Somebody better contact Social Services about that bus driver! He let a child walk 1/2 mile alone!","post_message":"An Indianapolis mother is outraged after her 6-year-old son was forced to walk home a half-mile through knee-deep snow after a bus driver dropped him off at the wrong stop and wouldn't let him back on."},{"comment_id":"10152820501225736","commenter_b":"And he signs new contract with Hair Club for Men.","commenter_a":"EEEEEEEEEE-HA!!!!!!!","post_message":"\"Due to the recent derogatory statements by Donald Trump regarding immigrants, NBCUniversal is ending its business relationship with Mr. Trump.\""},{"comment_id":"1001016903307871","commenter_b":"this woman is vial","commenter_a":"Can she get away with everything!! She and Bill both should have been in prison over this too!!","post_message":"Independent Counsel Laying Out Criminal Case against Hillary Clinton in Whitewater Land Scandal."},{"comment_id":"1211880145496741","commenter_b":"No to illegals.","commenter_a":"Mr. Gowdy, enlist some of your \"sleeping\" colleagues to assist!","post_message":"Thank you!"}]
