[{"comment_id":"10153311065101167","commenter_b":"Three words: Token. Black. Woman.","commenter_a":"Why does anyone care what Stacey Dash has to say?","post_message":"Today on live TV on two separate programs, Fox News called Obama a \"total pussy\" who doesn't \"give a shit\" about terrorism:"},{"comment_id":"10155881549390354","commenter_b":"Melissa ! That is fantastic but many women don't have a clue that she is like that ! Great Job Melissa ! You really showed her as she is !","commenter_a":"LET ME APOLOGIZE IN ADVANCE FOR THE STRONG LANGUAGE CONTENT OF THE FOLLOWING....HOWEVER, IT NEEDS TO GET OUT FOR THE NATION TO KNOW THE CHARACTER OF HILLARY BEYOND HER POLITICAL WORDS. PLEASE COPY AND PASTE SO OUR COUNTRY WILL NOT BE SUBJECTED TO HER CONTINUAL LACK OF RESPECT FOR HERSELF AS WELL AS EVERYONE ELSE........Subject: Broomstick one There it is ........book, chapter and page.......the real Hillary LOOK THESE UP IN THE BOOKS AND PAGE NUMBERS CITED IF YOU WISH... EIGHT QUOTES FROM DIFFERENT BOOKS her actual words (1) \"Where is the Godamn flag? I want the Godamn fucking flag up every morning at fucking sunrise. From the book \"Inside the White House\" by Ronald Kessler, p. 244 Hillary to staff at the Arkansas Governor's mansion on Labor Day 1991. (2) off! It's enough I have to see you shit-kickers every day! I'm not going to talk to you, too!! Just ...","post_message":"In an increasingly uncertain world, Americans want to be able to believe that their leaders are speaking honestly. That may be the one skill that Hillary can never learn."},{"comment_id":"507506722754821","commenter_b":"Who cares what he thinks?","commenter_a":"Is Kanye West Racist,,, he sure acts like it. In one word \"DENIAL\"... And yes Kanye if it was a \"WHITE\" entertainer I would feel the same way. This whole race card is getting played out, BILL COSBY is a rich NARCISSISTIC PREDATOR. Color shouldn't give ANYONE a pass.","post_message":"With just three words, Kanye West succeeded at creating yet another Twitter storm."},{"comment_id":"1728765537410558","commenter_b":"She's a Bitch!","commenter_a":"vanstone is an idiot","post_message":"Oh no... I'm praying for Bindi Irwin."},{"comment_id":"10154202048116336","commenter_b":"piss off, Dirty Mary. We're having fun!","commenter_a":"Who cares lol. We have terrorist cutting people's heads off and we are freely bringing them HERE to America and your talking about this nonsense? Wow!","post_message":"Miranda Lambert brought a date to the ACM - Academy of Country Music Awards! Lambert, who split with husband Blake Shelton in July, brought her new boyfriend Anderson East. @webpagelink"},{"comment_id":"10153899395243701","commenter_b":"Please take time to familiarize yourself with actual case law on this subject. Anyone under the influence of drugs or alcohol cannot legally consent to any sexual act. It makes no difference if she got that way voluntarily or involuntarily. YOU CANNONT CONSENT IF YOU ARE IMPAIRED. This is called rape","commenter_a":"I question this case also .... According to the accuser, Cosby urged her to take pills and to drink wine...... Urged her to do so??!!! So she did it to herself! I highly doubt an educated woman would take pills and drink in a room with one man without knowing the out come!! Personal responsibility is what all these people are not understanding! Read more: @webpagelink","post_message":"JUST IN: Bill Cosby has now officially been charged with sexual assault more than a decade after a woman told police the comedian drugged and violated her at his home near Philadelphia."},{"comment_id":"1150660831667337","commenter_b":"@username shut up fatass hoe","commenter_a":"America was built on hate! Just ask the Indians.... oh wait it's hard to find any because the white man almost killed off the whole entire race for land?? Land that was never theirs?? Land that is foreign to them? Oh and we are the savages?","post_message":"Good question #Philippines #WSHH"}]
