[{"comment_id":"10153048928789071","commenter_b":"We have to build a wall...","commenter_a":"@username gute Nacht murica","post_message":"A Univision reporter gets kicked out of a Trump event"},{"comment_id":"1807404516198292","commenter_b":"STOP THIS CRAP!","commenter_a":"Bs","post_message":"Clinton could still be president over Trump... Here's how. The Feds are getting involved. They have to be stopped. Do you still stand behind Donald Trump? Comment 'YES' or 'NO'"},{"comment_id":"1528607397159285","commenter_b":"Nobody has proved that Russia is behind it .","commenter_a":"I just can't take how Trump supporters defend this disgusting and vile piece of trash! Let's vote based solely on platform! Everyone keeps saying that they both have a lot of baggage, so let's level the playing field.","post_message":"\"To profess not to know at this point is willful misrepresentation,\" an official said."},{"comment_id":"827683380698175","commenter_b":"@username, so this guy should use the woman's bathroom?","commenter_a":"XY, XX there is nothing more, deal with it","post_message":"The American College of Pediatricians just made a SHOCKING statement about transgendering young children. Liberals are going to be pretty upset over this."},{"comment_id":"778598825583664","commenter_b":"Don't let Chump Trump know you Clown Car passengers responded to a Megan Kelly article...She is the enemy...Have you Repubics forgotten...Clown Car Rolls On","commenter_a":"Hey Tim, I like the pocket pool!!!","post_message":"Pulls no punches."},{"comment_id":"10153321016436051","commenter_b":"What kind of a twisted 'person' would do that? She belongs in a lock-up hospital.","commenter_a":"Anyone who does this when they are very young, will be sorry as they get older---","post_message":"Remember the woman who did this to an innocent animal? Well, she just got some bad news."},{"comment_id":"1009473349173573","commenter_b":"This woman is an idiot.","commenter_a":"#ArrestHillary #NeverHillary #GladlyPayforHillaryInJail","post_message":"FBI Federal Bureau of Investigation Director James Comey testifies on Hillary Clinton Email Investigation before House Oversight Committee. Complete video here: @webpagelink"}]
