[{"comment_id":"10156672176230615","commenter_b":"@username you're amazing. Marry me haha","commenter_a":"Let me be honest here. When the California primary happens I'm voting for Bernie. But if Hilary does win the democratic side I'll vote for her. No way am I letting a republican be president. Republicans will just do what they can to get rid of Obamacare, canceling out the rights for the LGBT community, sending our troops to meaningless wars. Hilary might go to war but however she might not. In the end I'm voting democrat for the presidency. A republican will just destroy this country and send us to hell. Not voting for democrat cause Hilary is it is voting for a republican.","post_message":"BREAKING –"},{"comment_id":"1144808412242519","commenter_b":"Keep them from working, take away their freebies and they will go back home on their own. Arrest the Gangster Types and deport them, then Build That Wall.","commenter_a":"He should be in jail with killary!","post_message":"A 4-4 tie decision by the Supreme Court upholds the lower courts decision and blocks President Obama's executive action on immigration (#DAPA). This means NO WORK PERMITS for the 4-5 million illegal aliens affected."},{"comment_id":"10153990315029062","commenter_b":"So sad.......where are the parents???","commenter_a":"Seriously? the kids are really that dumb/stupid......those grades are apalling......what did the students/teachers do from the start of the school year until now?","post_message":"Monroe demanded the HISD Superintendent Terry Grier immediately step down."},{"comment_id":"10153351373259614","commenter_b":"This woman wants to make decisions for you and for me.....","commenter_a":"Dummy","post_message":"A videotaped gaffe by Rep. Loretta Sanchez has sparked outrage among those who found the comment to be racially offensive. Sanchez, a candidate who wants to replace retiring Senator Barbara Boxer, was speaking at a California Democratic party convention event when she made a stereotypical Native American \"war cry.\" Referring to the difference between Indian Americans and Native Americans, the congresswoman tapped her hand to her mouth. Sanchez's main opponent, Attorney General Kamala Harris, was later asked for her reaction to the gesture. \"I don know what to say to that. That that that shocking,\" said Harris, whose mother is Indian. (Video courtesy of Uduak-Joe Ntuk) Read KTLA's story here: @webpagelink"},{"comment_id":"929882070454889","commenter_b":"Hillary is only winning by fraud.","commenter_a":"I can't tell the Bernie and Trump supporters apart until they end their angry rants with \"Bernie or Bust\" or \"Make America Great Again\". Two sides of the same coin...","post_message":"\"To be great, we can't be small. We have to be as big as the values that define America. And we are a big-hearted, fair-minded country. We teach our children that this is one nation under God, indivisible with liberty and justice for all, not just for people who look a certain way or worship a certain way or love a certain way, for all.\" —Hillary"},{"comment_id":"10152942027790399","commenter_b":"There is a word for women like her, but that would be an insult to hard working girls.","commenter_a":"That certainly says everything about her credibility, or lack thereof. :( AKA (I'll say anything for a buck)","post_message":"Megyn Kelly on msnbc: \"I’d have done O.K. there, too.”"},{"comment_id":"1710328329254279","commenter_b":"@username they are too stupid to listen.....republicans are turning into the lowest pond scum.....shit for brains","commenter_a":"I don't like the media. They don't publish the news unless it goes there way.","post_message":"WHOA This is going to start a RIOT... Obama deserves to be in JAIL!"}]
