[{"comment_id":"10153828127059749","commenter_b":"\"...coming to a fridge near you.\" No! No it's not! I don't associate with those they of people!","commenter_a":"George had this idea decades ago in form of Pudding skin singles :D","post_message":"We have reached new culinary lows."},{"comment_id":"939125846176797","commenter_b":"@username - absolutely, only 2 children & no marriages in what 8 years - that's actually fewer children that I would expect. She MUST have been using birth control.","commenter_a":"The audacity of this woman is amazing. She preaches abstinence, and criticizes women and girls for being irresponsible, all the while doing whatever the hell she pleases. I think having to pay child support is small potatoes compared to her hypocrisy. Karma will get you sooner or later. Pay up Bristol, it's your turn.","post_message":"Bristol Palin brought this upon herself. After all, she could have just practiced what she preached. Now, it's her turn to take responsibility."},{"comment_id":"10153993909761491","commenter_b":"A women should be happy she has big tits-men will ne ef stop looking at her","commenter_a":"I got chastised by a femminest about 3 months ago for saying that it was a crime against man","post_message":"\"I chose surgery because of how I felt, not because of what anyone else thought.\""},{"comment_id":"10155319935565294","commenter_b":"No! Our kids are getting more stupid every passing day! They NEED ALL the education they can get!!! :)","commenter_a":"No","post_message":"Should schools switch to a four-day week? Tell us what you think."},{"comment_id":"1171441452907864","commenter_b":"@username really Dems are racist?name a dem that wants to deport all Mexicans then get back to me..","commenter_a":"Good thing no one cares what Little Marco has to say. I'm sure Trump has no need for losers as VP either!","post_message":"In a statement on Facebook, Marco Rubio said he has no interest in being Donald J. Trump’s running mate and put VP rumors to rest."},{"comment_id":"10154075378206336","commenter_b":"@username that's not the law u ding bat.For years the law has been if Cubans can make it here they can stay. They were running to get away from the tyrant and then Castro when he took over. They do not run a cross our boarders. They come by boat through Florida. So as soon as Cubans arrive they are legal","commenter_a":"What an absolute Jerk. The Republican Obama. Clown Prince Trump.","post_message":"Donald J. Trump said he didn’t know if Marco Rubio was eligible to run for president and that “the lawyers have to determine that.”"},{"comment_id":"10153253284026756","commenter_b":"i like to read porn not watch it as much","commenter_a":"Meanwhile, people are praising a movie about a creepy, abusive man who likes to manipulate women into believing they want to be treated like emotional and sexual slaves.","post_message":"In which the vice president manages to invade all of our personal spaces, simultaneously."}]
