[{"comment_id":"10153542197218984","commenter_b":"This wouldn't be my daughter. First, they are in your country not theirs. They need to assimilate. This is why Muslims are taking over Europe. Read the book, \"While Europe Slept!\" Once we get a Christian president in the USA, the Muslims here will go back to their cubby holes. The Muslim president we have are giving them a very false sense of security.","commenter_a":"Unbelievable. They don't want to follow American customs, go back to wherever you came from.","post_message":"This school just ordered parents to make sure their daughters made Muslims happy in a sick way... this is full-on surrender. Spread this story... your children's school could be next!"},{"comment_id":"10153648435169705","commenter_b":"Whatever!!!! She's 140 lbs. That's not fat at all. Smfh","commenter_a":"She is definitely not fat","post_message":"Don't ever tell Ronda Rousey what to do with her body."},{"comment_id":"1630541213899658","commenter_b":"I TOTALLY AGREE..........ILLMINATE THEM AS SOON AS POSSIBLE..OR they will do it to YOU first!!!!!!!!!!!!! They DO NOT NEED to be here in the US of A but ONLY TO KILL MORE Americans.shoot first ask questions later.","commenter_a":"Dang, I need to get out of this hell hole state of celebrity librals and move to Texas where leaders are more concerned with the safety of our nation and not the designer dress to wear to the next award party.","post_message":"Get em' Sheriff... This is why you don't mess with Texas."},{"comment_id":"10158101758695291","commenter_b":"And you know this how?","commenter_a":"Amazed at the crowd who, like all Americans, except native Americans, are from somewhere else. Jesus would not only be proud of these marchers, he would march with them.","post_message":"Birmingham-Shuttlesworth International Airport immigration and refugee march"},{"comment_id":"1242224722465203","commenter_b":"\"because they make decisions based on gut feeling and emotions\" - And here come the Facebook comments that'll prove just that. *sigh*","commenter_a":"I'm sure some don't, same with men.","post_message":"This person is also a board member of Women in Science and Engineering. -_-"},{"comment_id":"10154246053623797","commenter_b":"They are being peaceful.","commenter_a":"No reason to protest. Have a vigil. Be peaceful!!","post_message":"#CHICAGO PROTESTS: Protesters swarm the Chicago Police HQ"},{"comment_id":"1394765567230964","commenter_b":"Because they enjoy it. They love to rape. That's it.","commenter_a":"Im still confused. Why does it seem that boys need to be educated against forcibly sexually attacking a woman? Like, hey! You shouldn't hurt that girl! Why is that something they need to be taught? Its like saying boys are rabid animals that need to be trained or something. Maybe they are, but why??!! I guess in the case of Nairobi born boys, if one in 4 women have been raped, perhaps they witness a lot of those attacks and it normalises the behaviour. But still. I am struggling to comprehend how a boy in ANY country comes to believe that raping a girl and causing her harm is normal. 😕","post_message":"In case you missed it: Take a look inside Kenya's successful rape prevention program."}]
