[{"comment_id":"10155440088805354","commenter_b":"Charlie, I guess it doesn't take much for you. When she stands up her boobs point south.","commenter_a":"Time for that old broad to retire.","post_message":"\"Why is it okay to show ass and no breast?\" - Madonna Fair question?"},{"comment_id":"10153471218374270","commenter_b":"What ever happened to OPSEC!","commenter_a":"What does that do? Piss them off?","post_message":"Big deal."},{"comment_id":"1702569516701619","commenter_b":"Soetoro the ineligibles wife did do that! But why are the D traitors who condone it with NFL players so upset??","commenter_a":"Oh yeah would of never heard the end of it.","post_message":"Oh, how they would SCREAM! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"842682652588978","commenter_b":"She needs to be kicked out of our country, we don't need trash like her kind around.","commenter_a":"Here's another puke, wants everything America has to offer but can't be happy with that, maybe the next time she appears in public, the police should not lift a finger to give it any protection, then she'll probably get stomped under the crowd, and she deserves every foot that would trample her arse!","post_message":"It is people like her that perpetuate hate. Police are the people that keep her safe. Do you think Beyonce needs to learn some respect?"},{"comment_id":"10152762818573635","commenter_b":"And little girls whose only purpose is to bear little boys?","commenter_a":"The world needs little b o y s to become husbands, fathers, governors, farmers, presidents, and the righteous church leaders who exalt Jesus Christ \"who o n l y\" was crucified for world sin, and to whom only we bow and worship.","post_message":"\"The choice to not have children is selfish. Life rejuvenates and acquires energy when it multiplies: It is enriched, not impoverished! Children learn to take charge of their family, they mature in the sharing of sacrifices, and they grow in appreciation of its gifts.\""},{"comment_id":"10153788091955950","commenter_b":"Jay the only way Hillary will win is if she lies cheats an steels the votes. Oh wait that's what she does for a living !!!","commenter_a":"This is nonsince TRUMP is not a quiter. He's in it to win it. An he WILL !!! TRUMP FOR PRESIDENT !!!!!!","post_message":"A Clinton plant? A Russian agent? Here's everything you need to know about all the far-fetched explanations of Trump's behavior."},{"comment_id":"10153803233601028","commenter_b":"No, seriously, she need to be deported to California.","commenter_a":"Deport her!","post_message":"Bound for Yale in the fall, a North Texas valedictorian revealed in her commencement speech that she is an undocumented immigrant. @webpagelink"}]
