[{"comment_id":"1239839009369460","commenter_b":"@username is a wetback that's gonna be deported.","commenter_a":"When the immigrants - illegal or not - leave the USA, be prepared to clean your own toilets. Americans are lazy. Plain and sheer.","post_message":"Under the Eisenhower program, immigrants inside the U.S. were rounded up and deported to remote places, resulting in deaths and criticism of human rights abuses."},{"comment_id":"10153259509053010","commenter_b":"I bet she could crush Eddie lol","commenter_a":"Had the biggest crush on Eddie Van Halen growing up...LOL..He DOES NOT look the same anymore!!!","post_message":"Van Halen's David Lee Roth put it best: \"We waited 45 years for this.\" More than four decades after it formed, Van Halen played its first nationally televised gig, on Jimmy Kimmel Live. (Roth ended up with that bandage on his nose.)"},{"comment_id":"1954618021430775","commenter_b":"It aint over till the fat lady sings,lol","commenter_a":"Mark my words, in future presidential elections, candidates will try to do what Donald Trump is doing.","post_message":""},{"comment_id":"10153321016436051","commenter_b":"What kind of a twisted 'person' would do that? She belongs in a lock-up hospital.","commenter_a":"Anyone who does this when they are very young, will be sorry as they get older---","post_message":"Remember the woman who did this to an innocent animal? Well, she just got some bad news."},{"comment_id":"10153431114481782","commenter_b":"@username, so this is a woman? @webpagelink","commenter_a":"It means that a child who is enrolled as a girl goes to the girls' restroom and a boy goes to the boys' restroom, regardless of what's listed on their original birth certificate. Some kids are born with indeterminate sex and as they get older they transition from the sex they were assigned to the one that really fits. Don't make this something it's not.","post_message":"The Obama administration is telling public schools that they must allow transgender students to use bathrooms and locker rooms consistent with their gender identity. @webpagelink"},{"comment_id":"977484695718405","commenter_b":"You know all this for a fact?? Otherwise move along snowflake","commenter_a":"That was awkward to watch she was looking like she can't wait to get away from him seriously but her face never moves Botox much","post_message":"President Trump and First Lady Melania Trump just shared their first dance at the inaugural ball. @webpagelink"},{"comment_id":"10150600601724999","commenter_b":"A woman is whatever she wants to be. That's kinda the point of feminism.","commenter_a":"For a group - women - who have been arguing for decades that they shouldn't be reduced to their reproductive organs so they can have more opportunities in life that have NOTHING to do reproduction, it's pretty ironic when those same people say someone can't be a woman because she doesn't have the proper bits or experiences with those bits.","post_message":"People who haven’t lived their whole lives as women shouldn’t get to define us. Read on in The New York Times Opinion."}]
