[{"comment_id":"1014005318629521","commenter_b":"Mine usually bark at noises or neighborhood dogs. However our Pit will ECHO in the house for 30 minutes when she wants to play. It only annoys us! However my neighbors digs howl for hours and have eaten my fence!","commenter_a":"Dang, what if the family isn't home?","post_message":"DOG BARKING ORDINANCE: Dallas city officials want to cut down on barking dogs. City officials have created an animal ordinance that says it is an offense if a person lets their dog bark for longer than 15 minutes. Would you agree with a similar ordinance in the Houston area? MORE ---> @webpagelink"},{"comment_id":"10153722838823984","commenter_b":"Pussy breath","commenter_a":"Through the key away","post_message":"A federal judge has ordered Kim Davis to remain in a jail cell until she agrees to issue marriage licenses to same-sex couples. The state is holding a metaphorical gun to her head, yet all she has done is stand firm in her conviction that marriage is between one man and one woman. Stand with us and sign the petition for Kim Davis to be released from jail immediately!"},{"comment_id":"930392377095536","commenter_b":"He is only talking about hoes and gold diggers people.","commenter_a":"Black women are steadily climbing the social ladder. I think this hostility stems from a fragile male ego and jealousy of the women's hard work and progress. A woman's progress only threatens weak men because now he sees the woman as competition when all she is trying to do is make something for herself and better her life. I've seen the mentality of these types of men. They think it's a competition and accuse black women of \"competing with black men\" by excelling in their careers and succeeding academically. Its really all jealousy. I've heard these types of men complain that \"An educated black woman will render the black male useless, and produce less babies, thus destroying the black race\", which really reveals that they rather you be stupid and uneducated and a baby factory, than self sufficient and educated. Ive literally heard black males argue AGAINST black women furthering ...","post_message":"Rapper Trick Daddy Thinks Latina and White Women Will Make Black Women 'Useless'"},{"comment_id":"560286244096415","commenter_b":"Conversion to Christianity. Messing with the Germans so the tribes demolished Rome. (Where we get the word vandalism from... The Vandal tribe.","commenter_a":"Hmmm how did greece burn this year...","post_message":"Does this seem familiar to you?"},{"comment_id":"10154566967589369","commenter_b":"She should have got the 11 yrs!","commenter_a":"5 years? That's it? Someone please give her real sentence when she gets to prison.","post_message":"Lethal doses of heroin and fentanyl were found in the body of 14-month-old Annabella Sagstetter last May."},{"comment_id":"10153943482835579","commenter_b":"Pregnant German girl burned alive by Turkish immigrants Two Turkish men burn 19 year old Germany girl alive in honor killing. conservative-headlines.com","commenter_a":"Nice one Obama, now they'll be hauling the \"skunk\" sludge through our country on trains and trucks. But it's easy to fool your numb skull followers isn't it.","post_message":"Pres. Obama kills Keystone XL pipeline, saying it's not in U.S. interests. Your comments? @webpagelink"},{"comment_id":"1578711192434391","commenter_b":"Oh hell yes lock her up","commenter_a":"Yes","post_message":""}]
