[{"comment_id":"10154253294384486","commenter_b":"Jack, this heartless bitch is worse than an animal","commenter_a":"make no mistake,this is an animal","post_message":"Only 12,000 more signatures needed...."},{"comment_id":"10153540508969087","commenter_b":"@username BY THE WAY BITCH, YOU ARE THE LOSER!","commenter_a":"HOW ABOUT WHEN YOU CHEATED ON YOUR FIRST WIFE WITH MARLA MAPLES AND GOT HER PREGNANT, DUMPED YOUR EIFE, MARRIED MARLA, THEN DUMPED HER TOO!!","post_message":"\"I have a very good marriage now. Melania's fantastic,\" Donald J. Trump told Anderson Cooper at the CNN town hall in South Carolina. \"But I had two women that I never blamed because I worked so hard that my job came first. Maybe I work too hard. I was a better father than I was a husband. But I worked very, very hard and I love doing it.\""},{"comment_id":"10153465334273132","commenter_b":"This case may seem cut n dry but so much time has gone by plus they never found his body.. I would not want to be a juror on this case","commenter_a":"They had a convict in prison who was even more than likely this little boy's killer. I think this is why this guy's 'confession' is so questionable. The investigators refused to admit they made a huge mistake, not surprisingly. I don't think they have the right guy, as for the real killer, I believe he died in prison. The whole thing is tragic.","post_message":"The jury has already been deliberating for 11 days."},{"comment_id":"1184608688264181","commenter_b":"Ha bitch","commenter_a":"Stupid motherfuckers🖕🏿🖕🏿🖕🏿","post_message":"No longer enrolled! #KansasState #WSHH"},{"comment_id":"10154003017405575","commenter_b":"Liberal bitch!!","commenter_a":"The entire Clinton family needs to take their millions and go home and stay there.","post_message":"This should be a wake up call to the #NeverTrumpers. They're coming after your guns."},{"comment_id":"1185050781573456","commenter_b":"This lady is nothing but pure Evil","commenter_a":"Same ole same ole.","post_message":"A top official was just discovered dead... he was scheduled to testify against Hillary Clinton in an up coming corruption case. Our thoughts and prayers go out to his family...this is just terrible."},{"comment_id":"10153932713210950","commenter_b":"@username that's my point. If she wanted to look like a pig she should have stayed on the farm lol","commenter_a":"It wasn't a few pounds, she got fat!! It was her job to maintain an appearance and she failed. If she didn't want to be judged for her appearance then don't enter a beauty pageant. Smh","post_message":"This former Miss Universe says Donald J. Trump's comments about her brought up bad memories from 20 years ago when she gained a few pounds after winning his beauty pageant."}]
