[{"comment_id":"10154400322244657","commenter_b":"In your illegal immigration poll Robert? Legal, voting hispanics want them gone.","commenter_a":"It doesn't matter. Now that the GOP candidates are in a pissing contest to see who can be the most xenophobic and racist while restarting the war on women, no Republican candidate has a a shot in 2016","post_message":"Does anyone have enough momentum to unseat Donald J. Trump? See which candidate rose and fell in the new Townhall.com / Hot Air poll:"},{"comment_id":"10154910667241162","commenter_b":"We both like thick @username, but for some strange reason she wanna be thin.","commenter_a":"Demetrius DaInfluence Hardy and @username told y'all it was debatable.","post_message":"We all agree that Chicago has the best pizza - but the debate in our newsroom is over deep dish or thin crust. What your pick? Our Hungry Hound did some research for you: @webpagelink"},{"comment_id":"10153903960665329","commenter_b":"Wtf!!! She don't play","commenter_a":"This is hilarious. @username Maria Maldonado","post_message":"#goals"},{"comment_id":"10156759727355354","commenter_b":"He might make good filler for potholes.","commenter_a":"Stick your head into a stump grinder? Please?","post_message":"HUMBLE"},{"comment_id":"10156077114395354","commenter_b":"She is a very dangerous person!","commenter_a":"You can fully understand why a lot of politicians want gun control after the shit they have pulled on the people . Some of them might well fear for their lives . With the present climate in this nation the people sure as hell aren't ready to give up their weapons . My advise is to stockpile ammo while you still can , before they ban sales .","post_message":"Here's what she's got planned for law-abiding, gun-owning citizens..."},{"comment_id":"2175292792696203","commenter_b":"Fire her","commenter_a":"I am sure there are plenty of dancers to replace her.","post_message":"Ungrateful Rockette Snowflake Posts Anti-Trump Rant Over Being Forced To Perform At Inauguration"},{"comment_id":"10153959018846341","commenter_b":"The problem that Islam faces is that it is continuously moving backwards. Even in the Islamic golden era, the economy was reliant on slaves and infidels. The only successful Islamic countries today are the ones that have massive oil reserves. Muslims living in countries with no resources tent to live in poverty. This is why you always see Muslims migrating into infidel lands but you don't see infidels moving into Islamic lands. I do believe that Islam will dominate Europe. I have no doubt. Firstly the countries will be split into two with one being Islamic and the other being Christian but the Muslims will continue to migrate into the Christian countries because they will be poverty stricken. Because sharia is so retrograde Europe will imminently turn into another failed Islamic state as they have no resources. European winters can be very hard If everyone wants to pray 5 times ...","commenter_a":"unfortunate though, but this is the same way Palestinians are wailing, groaning and moaning everyday yet no one seems to care. Let's not unite in periods like this alone but all the time.","post_message":"The residents of Belgium capital city woke up Wednesday morning to a new reality, on the day after the terrorist attacks that killed at least 31 people."}]
