[{"comment_id":"893405944041287","commenter_b":"Slap a hoe","commenter_a":"@username What An Idiot She Is","post_message":"Mom Forgets Her Baby In A Shopping Cart A valley mom walked out of a Fry's store in Gilbert this afternoon but left her newborn behind in the shopping cart. 40 minutes later the panicked mom realized her mistake and went back to get him. The baby is back with his family tonight. Photo: Katie McCulley. Full story: @webpagelink"},{"comment_id":"10152826258466051","commenter_b":"I hope the bitch gets life","commenter_a":"Got what you deserve","post_message":"First she stole this cancer-stricken man’s dog. Then she had him euthanized."},{"comment_id":"1427954837264260","commenter_b":"I consider reading this page to be a spectator sport. ;)","commenter_a":"Such a disgusting Olympics. The committee needs higher standards.","post_message":"And you thought Rio's green pool was worrying!"},{"comment_id":"10155187593643352","commenter_b":"Women do the same thing every day...I'm happy for these guys...lol","commenter_a":"He need a damn job like Mary j blidge husband. They some damn bums","post_message":"Do you believe this? Lamar Sally is taking Sherri Shepherd back to court for an additional $75,000 on top of the $4,100 in child support she already gives him every month. What is he smoking? ----> @webpagelink"},{"comment_id":"10156323895095354","commenter_b":"@username Your not aware of everything that went on or was said. I \"ASSUME\" he told her to GET UP and being Defiant and Arrogant she decided \"I'LL DO WHAT I WANT TO DO\" . She should have STOPPED what she was doing when she was TOLD TO. It was Harsh but perhaps the rest of the Class learned a Lesson. Crap like she pulled Disrupt a Class ands children that WANT to LEARN can't.","commenter_a":"Yes good for the cop, if you do not like this then do what your told to do by the cops.","post_message":"The FBI and DOJ have jumped in..."},{"comment_id":"949193028544815","commenter_b":"BLM is a terrorist organization, lets call it like it is.. Also the New Black Panthers are no better then blm..","commenter_a":"Good","post_message":"The Real Showdown with the BLM is about to Begin!. @webpagelink"},{"comment_id":"486025081592014","commenter_b":"I really really want her to go to jail","commenter_a":"This lying bitch only knows how to take care of her greedy self!!!!","post_message":"Hillary Clinton criticizes Republican Donald Trump's tax plan, calling it \"trickle down economics on steroids.\" Do you agree or disagree with Clinton on this?"}]
