[{"comment_id":"10152991347419712","commenter_b":"Good point cutty, still can't stand the guy. Good luck this weekend","commenter_a":"How is this scumbag celebrated?","post_message":"Here are five of Terrell Suggs' greatest chirps about the Patriots and quarterback Tom Brady, a team he doesn't exactly like."},{"comment_id":"565700806961575","commenter_b":"Don't they get it! We don't want her!","commenter_a":"Hillary will probably die before then of karma and natural causes!","post_message":"Trump-Clinton rematch for 2020?"},{"comment_id":"10153433309476051","commenter_b":"Tie her up in the yard with a plate of chicken wings just out of reach","commenter_a":"No compassion, no conscience ,scruples,morals..nothing but a worthless excuse for a person.I hope she has no children.","post_message":"Officials took one look at what this woman did to her dog and arrested her immediately."},{"comment_id":"1635226930076425","commenter_b":"Take those women.","commenter_a":"I hope they do leave...","post_message":"We might have to pay another country to take them..."},{"comment_id":"1246630588734477","commenter_b":"This braindead liberal moron should be put in a cage and shut her stupid mouth","commenter_a":"She's getting fatter and fatter too !! 😎","post_message":"Hit 'LIKE' if you think Whoopi is a complete IMBECILE who has no business being on national TV!!! @webpagelink"},{"comment_id":"10156397389135354","commenter_b":"@username .. Martin.. better yet go fuck your Obama loving Momma..","commenter_a":"Obama is anti american ... he wants the rest of the anti americans to come and invade us.. he has decleared war on americans..","post_message":"WATCH Trump explain his plan, and why he opposes Obama's Syrian \"refuge\" scheme..."},{"comment_id":"10155189089842439","commenter_b":"Please believe...that they are AT WAR with the rest of the non-islamic planet!!! The rest of the world will have to join together and obliterate them!!","commenter_a":"Why this evil group, can still perpetuate these senseless brutal killings of people, is difficult to fathom! This is one legacy!, Obama will be remembered for!....under him, the killings of human beings in the middle east became a sport! Obama, thank you very much!","post_message":"ISIS has released a new video showing a brutal execution of an Iraqi man. ISIS drowned the man in liquid detergent."}]
