[{"comment_id":"10152910753726336","commenter_b":"Reality check!!!!","commenter_a":"REALLY! If you believe this I have beachfront propoerty to sell you in Arizona, can you say \"stupid Americans\"!","post_message":"Do you agree? #SOTU LIVE coverage: @webpagelink"},{"comment_id":"1695714467362766","commenter_b":"You must have missed the fact that two pedophiles are involved in this legislation. One had to back down and the other is going strong. Has nothing to do with mixing anything up. It's the consequences and the perverts backing this type of legislation. Are you going to day pedophilia is okay now?","commenter_a":"Has a \"sign\" ever stopped a pedophile before?? No. Classifying transgender and pedophiles in a group together is just so wrong. Boys are sexually abused at double the rate girls are so why is everyone not up in arms for their sons? And statistically pedophiles prey on children they know. Family members/close friends not random children in a public bathroom. What does it matter what parts the person in the next stall over does or doesn't have? There in there to pee just like you and go on with their life! Thats my two cents on the whole subject! But apparently many people feel so differently and even though I don't understand it I respect that not everyone agrees!! I do however feel so heartbroken for the entire transgender community whose repeatedly being compared to pedophiles.","post_message":"\"This means a man can simply say he 'feels like a woman today' and enter the women's restroom... even if young girls or women are already in there,\" stated the American Family Association, which started the petition."},{"comment_id":"1057253901026942","commenter_b":"and raising the min wage only cuts jobs, hrs, and closes busnesses","commenter_a":"We've seen this movie! And it doesn't end well for most Americans","post_message":"Research has found that massive tax breaks for the wealthy don’t trickle down into economic growth."},{"comment_id":"10153225010746833","commenter_b":"These people should be tarred and feathered.","commenter_a":"This is what the liberals want.","post_message":" of New Jersey, warns Gordon VanGilder. The retired schoolteacher is the latest to fall victim to the Garden State gun laws the 72-year-old is facing up to 10 years in prison for having an antique flintlock pistol in his car. In this exclusive report, his attorney notes that VanGilder is facing the same felony charge for his unloaded mid-1700s firearm as he would be for a loaded .44 Magnum. is overreach, for sure, says VanGilder. @webpagelink"},{"comment_id":"490217177839688","commenter_b":"YOU BITCHES DON'T MISS ANY WELFARE MEALS DO YOU!","commenter_a":"Only thw Daily Dummies would bring more media attention to something like this. Learn the legal system who iduots. This guy wasn't guilty ever and the rest of Baltimore now knows it too.","post_message":"Baltimore city residents expressed disappointment in response to the city circuit court Monday finding a police officer not guilty in connection to the death of Freddie Gray."},{"comment_id":"467018143488766","commenter_b":"Liz...please shut up and go help your sexual victims","commenter_a":"Why don't we just ban Muslims from the military","post_message":"Should Christianity Be Banned To Please Muslims? Comment 'yes' or 'no'."},{"comment_id":"10153281993713132","commenter_b":"She's beautiful, they would make a great couple","commenter_a":"What!?!?! Noris Lizbeth Robles","post_message":"But don't expect them to open up about their maybe-relationship any time soon. #Oscars"}]
