[{"comment_id":"10153180295086051","commenter_b":"shes a smooth talking criminal, i'll give her that","commenter_a":"I very much hope so. The \"scandal\" the regressive party is touting is an expression of the kind of fear they have of her. I absolutely want Hillary to be the next President of the United States.","post_message":"Here's what Hillary Clinton had to say about her State Department e-mail scandal. Simple question: Do you think she'll be the next President of the United States?"},{"comment_id":"10152997127479330","commenter_b":"Oh my now there going to ban scissors.","commenter_a":"Oh my god scissors are bad the scissors just killed someone ban the scissors","post_message":"A horrifying story out of California… Police say a 15-year-old boy was stabbed to death with a pair of scissors right outside a middle school in LA. Now authorities are trying to figure out what led up to the deadly attack ---> @webpagelink"},{"comment_id":"499136410296158","commenter_b":"Go back to Mexico you trash","commenter_a":"Very disrespectful! I can say I'm embarrassed, what type of protest is this? I don't agree with Trump but I certainly don't agree with this. That guy in the white shirt with the Mexican flag under his hat is ridiculous. Obviously he does not know how to respond correctly and only starts welling stupid stuff. The only history they are making is to upset people to react upon their actions.","post_message":"Watch This Insane Reckless Trump Protester Nearly Kill People"},{"comment_id":"10153211498337894","commenter_b":"Lmao","commenter_a":"If that baby head is as wide as hers… Chrissy… You in danger gurl! LOL","post_message":"John Legend and Chrissy Teigen Are Having a Baby! [Photo]"},{"comment_id":"10153454248817377","commenter_b":"That is very wired how has Trump got millions more votes than Lyin' ted? Why does Trump almost have a 290 delegate lead? Why Has Trump won most States? Why does Trump only need 53% of remaining delegates to get to 1237 delegates and Lyin' Ted need all but 50 delegates or 92% of the remaining delegates? You may also want to got to real clear politics and recheck your poll.","commenter_a":"Contrary to the media narratives -New York is not the center of the Country - so, It is not a big deal to win your home state. The cheer leaders want other Northeastern States to fall in line behind New York. Conservatives believe that the voters in other Northeastern States have a mind of their own. This is also not a big deal win for Trump because of the all the votes cast for both the Democrats and Republicans running in the NY Primary, only 20% of the Vote went to Trump, even with his, so called, big victory... Which makes it clear that no Republican running is likely to win NY in the General Election. So - this Primary has very little significance for who should be the nominee.","post_message":"Donald J. Trump on New York Primary win:"},{"comment_id":"10152882517291051","commenter_b":"Just lie a Black woman to get defensive-----you have a crush on him? Michelle won't like it.","commenter_a":"A lot better the Barack Hussein Obama.","post_message":"The next time you meet someone who doesn't like their name, tell them about this guy and remind them that it could be worse."},{"comment_id":"1733106183573180","commenter_b":"Liar, murderer and thief! Hang that bitch.","commenter_a":"She is such a P.O.S. lol, if there is nothing to hide then why not release them, it's ridiculous! No one is asking for others transcripts, just her's because she is a proven liar...anyone supporting this woman needs to really see the truth and stop denying what she really is.","post_message":"During last night's debate, CNN moderator asked Hillary three times why she won't release transcripts of her speeches to Wall Street banks if there's nothing that she's trying to hide from voters. Do you think Hillary Clinton is hiding something in those speeches?"}]
