[{"comment_id":"953345841476863","commenter_b":"that same lie every fuckin time. let me guess. Cherokee. fuck that shit. bitch is lying. and she's just another white racist tryna curve us from the truth. you're nice shit don't fly around me. I'm gonna bring out the racist in you for everyone to see if you keep on. let's play","commenter_a":"I rarely hear a white person say either of these things, and if anything I hear blacks alday long say go back to Mexico to Spanish Americans","post_message":"We're waiting..."},{"comment_id":"1121293104578213","commenter_b":"A girl?!?? Good at a SPORT?!? Better insult her appearance!!","commenter_a":"Talking bout that horse face","post_message":"WNBA star Elena Delle Donne shared her free-throw secret and the encouraging words that drive her. - Erin Canty"},{"comment_id":"1041072545948147","commenter_b":"You look like a witch already","commenter_a":"this the third post i've seen with this baby and all the \"after\" babies are different babies...the jig is up!!! i'm starting to suspect the witchcraft claim is true...this baby has changed to even 3 different complexions and facial features or somebody has nothing to do by come up with lies to make themselves feel righteous!!!!","post_message":"A little positivity out of a horrible situation 🙏 Baby Hope, who was found starving on a street in Nigeria after he was abandoned by his family over accusations of witchcraft, makes extraordinary improvements since he was helped by Danish aid Anja Ringgren Lovén."},{"comment_id":"10154135106979330","commenter_b":"Scumbag","commenter_a":"Conservative idiots who are happy.. it will ultimately go to the Supreme Court and your ace has died. Oops.","post_message":"A judge has just ruled that the Obama administration is unconstitutionally spending federal money to fund Obamacare @webpagelink"},{"comment_id":"10153775640411178","commenter_b":"Bully!","commenter_a":"\"In the first place, we should insist that if the immigrant who comes here in good faith becomes an American and assimilates himself to us, he shall be treated on an exact equality with everyone else, for it is an outrage to discriminate against any such man because of creed, or birthplace, or origin. But this is predicated upon the person's becoming in every facet an American, and nothing but an American...There can be no divided allegiance here. Any man who says he is an American, but something else also, isn't an American at all. We have room for but one flag, the American flag... We have room for but one language here, and that is the English language... and we have room for but one sole loyalty and that is a loyalty to the American people.\" Theodore Roosevelt 1907","post_message":"Ben Carson makes a bold statement."},{"comment_id":"1089399481081062","commenter_b":"Hahahaha","commenter_a":"Matthieu Sinclair","post_message":""},{"comment_id":"1837165426513406","commenter_b":"Kiss my white ass","commenter_a":"and let me tell you something about being poor we were poor when i grew up i was very lucky we had food on the table there were times we didn't have ckristmas cuz we didn't have the money so when the democraps say we dont know how it feels to be poor they are so fucking full of shit minimum wage was less was about 3.00 an hour so you people today dont know how it is to be really poor","post_message":"Black Lives Matter Co-Founder Makes SICKENING Demand For Whites To Do THIS [VIDEO]. She is a bigot, her demands are creating racial tension. Do you think she is the racist?"}]
