[{"comment_id":"1103020493078450","commenter_b":"@username and Donald Trump's wife is a illegal alien what's your point","commenter_a":"Can somebody explain this to me. Donald Trump just had a physical done and all of his stats are great for 70-year-old man. But yet factor in the draft he couldn't pass a physical exam. Did he get more healthy in the last 50 years? No I don't think so. And it wasn't because of a physical disability. Because right after he dodge the draft he just went to college and play physical sports such as tennis squash and football. So now the medical Side of the argument is contradicting 50 years later. The physical part of it is completely out of the question at the time of the draft because of the sports he played right after he dodged a war. So what other excuse is there to keep you out of the draft? Please somebody answer this question. And these veterans today deserve to hear the answer to ...","post_message":"After four days spent recovering from pneumonia, Hillary Clinton returns to the campaign trail, chats with reporters aboard her plane @webpagelink"},{"comment_id":"10154502973076756","commenter_b":"@username do u recognize this woman in the pic? She's a Bay Area demonstration machine! I want to BE her!","commenter_a":"Wow.","post_message":"\"[W]e lack confidence that Judge Persky can fairly participate in this upcoming hearing in which a male nurse sexually assaulted an anesthetized female patient.\" -- Santa Clara District Attorney Jeff Rosen"},{"comment_id":"10153294493981438","commenter_b":"I hate her as corporate whore and war monger.","commenter_a":"I like her as Nerd and Law Student!","post_message":"Nerds are cool, and that is Hillary’s true self. She should two-strap her way to the White House."},{"comment_id":"1022812631106658","commenter_b":"You fucking cooks make this world more dense and dumb","commenter_a":"The cures are out there stop suppressing them","post_message":"Real talk for a second: someone I love very much has recently been diagnosed with terminal cancer, and I find myself growing even angrier with the charlatans who promise miracle cures and insult the incredible doctors and scientists who are working so hard to help the people afflicted with this terrible disease. They prey on desperate and sick people to line their own pockets. \"There is no alternative medicine. There is only medicine that works and medicine that doesn't work.\" Richard Dawkins Image via the Food Hunk."},{"comment_id":"1286110978131794","commenter_b":"Oh you mean like all the people who first came to America and created the United States? Then took half of Mexico? Oh ok. As long as this is clear and there are no glaring hypocrisies!","commenter_a":"Sorry, incorrect...if you overstay a visa, you are an illegal alien, If you ENTER the country illegally, you are an INVADER!!","post_message":"Allen West Republic"},{"comment_id":"10154165946748606","commenter_b":"Please don't stereotype. You can not speak for all Hispanics. We all don't \"love\" to drink and drive.","commenter_a":"RIP... The Hispanics love to drink and drive. Thank God mo one else involved this time.","post_message":"A car went airborne after hitting a beltway bridge abutment before landing on the roadway below, killing the driver. @webpagelink"},{"comment_id":"10153221748849087","commenter_b":"@username,where are you from?? You pig!! Photoshop your KKK outfit on your daddy...hahahahahaha","commenter_a":"IT WAS YOU, OBAMA who spoke these words at an Islamic dinner - \"I am one of you.\" IT WAS YOU, OBAMA who on ABC News referenced - \"My Muslim faith.\" IT WAS YOU, OBAMA who gave $100 million in U.S. taxpayer funds to re-build foreign mosques. IT WAS YOU, OBAMA who wrote that in the event of a conflict -\"I will stand with the Muslims.\" IT WAS YOU, OBAMA who assured the Egyptian Foreign Minister that - \"I am a Muslim.\" IT WAS YOU, OBAMA who bowed in submission before the Saudi King. IT WAS YOU, OBAMA who sat for 20 years in a Liberation Theology Church condemning Christianity and professing Marxism. IT WAS YOU, OBAMA who exempted Muslims from penalties under Obamacare that the rest of us have to pay. IT WAS YOU, OBAMA who purposefully omitted - \"endowed by our Creator\" - from your recitation of The ...","post_message":"“I do not believe Sharia is consistent with the Constitution of this country,” Dr. Ben Carson told The Hill. “Muslims feel that their religion is very much a part of your public life and what you do as a public official, and that’s inconsistent with our principles and our Constitution.”"}]
