[{"comment_id":"10152829564776770","commenter_b":"Go home Clintons","commenter_a":"Bullshit cover up","post_message":"Hillary is secretly a great person, says Clinton campaign"},{"comment_id":"10153735845537144","commenter_b":"The dog having a home is the goal isn't it? This woman didn't know the dog, she might not have liked it. The dog could have hated her. Yeah, the governor had an advantage and the guy's not my favorite. However, this whiny woman sems too needy and I'm not at all sure I would trust her to care for a pet.","commenter_a":"Another entitled old white guy. God how I despise his ilk.","post_message":"What. The. Hell."},{"comment_id":"10153632761623984","commenter_b":"Die bitch","commenter_a":"Coward!!!!!!!!!!!","post_message":"After calling out the suspect in this tragic police officer shooting, this city’s top cop dropped a huge truth bomb that could come as a big surprise to advocates of the \"black lives matter” movement. Do you agree with this police chief?"},{"comment_id":"1167588859974389","commenter_b":"Bo Go Back To Fucking Your Sistermommy","commenter_a":"Isn't that great ! I am happy to see Trump gets that endorsement. Hillary is probably sick with envy but she got an endorsement from BLM...and other terrorist groups.","post_message":"Major Endorsement from our Heroes on the Frontlines..."},{"comment_id":"10156552982575354","commenter_b":"Colorado? Thats stupid of a migration....I am disapointed california was a great republican state being ruined by demoxratic liptards","commenter_a":"Enough said - California: soooo fucking broke no thanks to Democratic ignorance. A liberal virus that occupied the west. All these liberal fucktards are moving to Colorado with their shitty habits, a virus that will continue to spread.","post_message":"A worthless piece of paper anymore?"},{"comment_id":"10150676513679999","commenter_b":"You're right @username, when I bought my Yankees jersey, I bought the Rivera one. Best closer ever.","commenter_a":"Nothing like the Yankees of my childhood. Subway series, tino Martinez, Alfonso Soriano, David justice, pettitte, Bernie Williams, posada and jeter. It won't ever be the same.","post_message":"The New York Yankees are knocked out of the playoffs after losing, 3-0, to the Houston Astros in a wild-card game."},{"comment_id":"10153404952670399","commenter_b":"Women see him and spontaneously abort.","commenter_a":"Cherry picking keeps religion alive.","post_message":"Way, way too much information."}]
