[{"comment_id":"10154533631771756","commenter_b":"Well, it's not final yet, but research has shown that kids in 3rd world countries have fewer food allergies because they have had hookworm infections. The hookworm releases enzymes that actully turn off parts of your dna that determine food allergies and other autoimmune diseases. It's in the worm's best interest to keep the host able to eat many things so that the worm can enjoy them, too.","commenter_a":"Tina Pak","post_message":"A research powerhouse attempts to solve the huge mystery of why food allergies have been skyrocketing in recent years."},{"comment_id":"10153415013561509","commenter_b":"Absolutely!! Old lady's got a warrant in Egypt . she's going nowhere that's why she hides out. Please run with her.","commenter_a":"Scott Walker 2016!!","post_message":"Virtually every potential Republican candidate will make their case to conservatives this week at #CPAC2015. Learn more about it in CNN's latest edition on #Snapchat. @webpagelink #CNNSnapchat #CPAC"},{"comment_id":"10153424802654255","commenter_b":"Hillary 2016.....@webpagelink","commenter_a":"That'd be great if a liberal were running.","post_message":"When liberals go to the polls, liberals win."},{"comment_id":"10154497774003812","commenter_b":"On that show, women would throw their shoes at him.","commenter_a":"Wake up Ellen...","post_message":""},{"comment_id":"1194513290647275","commenter_b":"Yep and a drunk driver that got behind of the wheel of a car but didn't hurt anyone should not be taken away from their family and put in jail when they were caught????","commenter_a":"She's a threat to no one. They just took a mother from he children who were born in this country!! We are the one's who are threatening the lives of people who trusted us and came here to make their lives better, just like Trumps mother did. Just think, if they had sent her back we wouldn't be dealing with this heartless man! What a blessing that would be. He's done more damage in less than 3 weeks than Nixon did in about 6 years and he wasn't this bad!!","post_message":"Immigration agents “said she’s a threat, but my wife isn’t a threat,” her husband said in an interview."},{"comment_id":"442004659257462","commenter_b":"Go home!","commenter_a":"The only thing that fat slob would bring to the White House is big-Big-Big Plate to feed his fat ass off of.","post_message":"Will Chris Christie's tough political style work in the White House?"},{"comment_id":"1753488154905363","commenter_b":"Bush signed NAFTA. Trump is supposed have a moron.","commenter_a":"Deplorable from Ohio","post_message":"Donald J. Trump speaks to the press after touring the Flint Water Plant and Facilities."}]
