[{"comment_id":"1281317941894705","commenter_b":"she is crazy in the head","commenter_a":"No","post_message":"So apparently everyone that doesn't support Hillary Clinton is just being juvenile, according to Streisand."},{"comment_id":"884338575001603","commenter_b":"Good Riddance to Hillary Clinton!!!","commenter_a":"It's about damn time!","post_message":""},{"comment_id":"10153014611669138","commenter_b":"\"Land of the free\"? Should be able to go where ever the hell we like! A sign isn't going to stop me","commenter_a":"Sheesh. Just did this last year and yeah it was slippery but everyone knew you did it at your own risk. As for the stairs being closed well you could step over the chain they put to block it. I'm actually taking my boyfriend in the next couple weeks since he's never been.","post_message":"\"The Park Board is disappointed that local media is encouraging this behavior by covering it without explaining that it is dangerous and illegal.\""},{"comment_id":"10153218783658869","commenter_b":"No inspired because I do not look up to her.","commenter_a":"Antes de ver a una mujer en la Casa Blanca, la clase política americana es capaz de buscar lo inexistente, y si hay hay que crearlo, de crea.","post_message":"Hillary Clinton cannot appear too strong without risking her likability ratings; she cannot appear too vulnerable without her credibility suffering. Herein lies her dilemma."},{"comment_id":"10152940577256336","commenter_b":"Enough of our young men have died. Keep them home and stop certain trash from coming into the USA. Then we won't have to worry about them.","commenter_a":"I heard today that he doesn't have a college degree. Low hanging fruit for the press to grab onto. Better fix that before he enters the national arena.","post_message":"Wisconsin Gov. Scott Walker, a potential 2016 Republican presidential candidate, said Sunday he is open to sending U.S. troops to the Middle East to defeat ISIS."},{"comment_id":"1854344181462778","commenter_b":"Trump!!! Build that wall!!!","commenter_a":"This time they'll just say \"we need to stop this black on black crime\"","post_message":"WARNING: This video is graphic and may be upsetting to some viewers. @webpagelink Officials released surveillance footage showing a violent takedown by an officer on a train platform in Houston. The officer resigned and authorities said the investigation was still ongoing."},{"comment_id":"953522348018789","commenter_b":"I demand that the offender's stop offending me. I'm tired of being offended. They get offended over Merry Christmas they get offended over In God We Trust, offended over the Ten Commandments... And the list goes on and on well if they don't like it move out of America.","commenter_a":"Why make something as general as a Cracker Barrel a racist issue? Stop creating trouble and problems needlessly! Enjoy this holy season and spread love and goodwill, not hate!","post_message":"Liberals are demanding that Cracker and Barrel change their name to this. We can let this happen. Let's show them our support. Can we get 30,000 'LIKES' to keep Cracker and Barrel the same?"}]
