[{"comment_id":"891767890959271","commenter_b":"She is so evil ...","commenter_a":"Ps..any one remember Al Gore and how graciously he accepted defeat..and why would HIllary allow science and fact to get in the way..","post_message":"Fact-Check: Hillary Clinton’s claim that partial birth abortion should be protected due to a number of women who have serious health issues is not supported by research."},{"comment_id":"10154232902826600","commenter_b":"It's called hustle lady! Wtf? No it's called dirt bag thief. It's not hustle it's theft. What a douch.","commenter_a":"Just don't understand why people think it's ok to take things that don't belong to them...no freakin' values or morals.. Disgusting!","post_message":"She was taken into custody without incident after being found through social media tips and “old fashion police work.”"},{"comment_id":"10154630548633132","commenter_b":"Her stepmom Melania looks like Caitlyn Jenner lol","commenter_a":"Not being mean but she reminds me of Miley Cyrus..","post_message":"Donald J. Trump and Marla Maples daughter Tiffany is addressing the nation."},{"comment_id":"10153744728059087","commenter_b":"And, to all of the pissy whiney Clinton supporters who complain about how \"mean\" Bernie has been to Hillary by his pointing out true negative aspects of her record--if Clinton prevails, Trump will decimate her and Bernie will never look so good to them.","commenter_a":"I call...bullshit. Bernie","post_message":"\"I sense some great deal of momentum, I sense some great victories coming,\" Bernie Sanders said after his stunning upset victory in Indiana. \"I think we can pull off one of the great political upsets in the history of the United States and in fact become the nominee for the Democratic Party and once we secure that position, I have absolute confidence that we are gonna defeat Donald Trump in the general election.\""},{"comment_id":"10153855259970329","commenter_b":"So the same saying goes if a female swimmer ... participated with the same enthusiasm. .. in a common wealth games ... yeah menstural blood after all ain't unhygienic. .. its holy","commenter_a":"It's not about it being shameful, it's about it being a private thing. Like going to the bathroom is a private thing.","post_message":"“We’re the ones having a period and we’re the ones having to pretend it doesn’t exist.\""},{"comment_id":"1001016903307871","commenter_b":"this woman is vial","commenter_a":"Can she get away with everything!! She and Bill both should have been in prison over this too!!","post_message":"Independent Counsel Laying Out Criminal Case against Hillary Clinton in Whitewater Land Scandal."},{"comment_id":"1032772820091472","commenter_b":"And white people killing white people. America is a violent country. One man can't change that! Sad, isn't it","commenter_a":"If he was still alive it still be the same thing black people killing black people so yea everything is the same thing it do not matter","post_message":"Absolutely!"}]
