[{"comment_id":"560649254116954","commenter_b":"Lady you are just plain stupid.","commenter_a":"I want to see a Sanders-Trump debate. If you think Hillary would wipe the floor with Trump, Bernie would \"bern\" the floor with Trump! Either way, Trump is a Loser.","post_message":"Wonder what a Hillary Clinton/Donald Trump debate would look like? Take a look."},{"comment_id":"495130020646953","commenter_b":"So work overtime so you can afford your eggs. Whining like a menstruating bitch with sand in her vagina isn't going to improve the situation.","commenter_a":"Fuck you MCdickbags watch egg inflation. Then this will make natural farm raised local eggs like $25 a carton","post_message":"McDonald's currently uses around 4 percent of all the eggs produced in the United States each year, around 2 billion eggs total."},{"comment_id":"10154399468414411","commenter_b":"Herna Suryani Fuck you you dumb cunt ..israel was given the land at the end of the 2nd world war in 1947..and all you have done since ,,is kill.. steal ...bitch..and moan.. so FUCK YOU CUNT !!!","commenter_a":"The ongoing 'Palestinian' terror attacks towards innocent Israeli citizens, leave Israel with no other choice. Israel must take tough decisions in order to protect its citizens and prevent the next terror attacks. 'palestinians' always choose terrorism over peace. Sadly","post_message":"This step will 'only increase the sense of injustice and frustration felt by Palestinians' - UN official"},{"comment_id":"1172807002807988","commenter_b":"But you know it's hard to dress a tranny and make anyone think they're a woman !!!","commenter_a":"Well this certainly has nothing to do with the article, but thank goodness Michelle's designer will not be dressing Melania. Think how hard it was to come up w flower gardens, etc to cover all the hair on Michelle's chest every time she dressed her. Melania's designer will have it much easier dressing a woman w a figure.","post_message":"Looks like Michelle saved her most patronizing comments for last. When you see what she just said, try not to lose it! Are you ready for Melania Trump to be the First Lady?"},{"comment_id":"678327045675400","commenter_b":"Now if those same 27% would move to another country!!","commenter_a":"Oh, the Republikkkans. Your big daddy is a rapist yo! How he got here is a complete joke! GTFOH","post_message":"Polls show 27 percent of Trump voters won't accept the result if he loses."},{"comment_id":"962643217106352","commenter_b":"all i can say is zombies! now we have to worry about zombies crossing the border, thanks south America.","commenter_a":"Freaky.","post_message":"A family in Honduras that claimed teen was screaming from inside her coffin have made international headlines with their actions."},{"comment_id":"1172930249409099","commenter_b":"I get chastised for bad grammar but she gets a free pass for talking about wanting to Murder Men. Cough** cough** cognitive dissidents. Cough** cough**","commenter_a":"Yes, it is called bandwagoning. And the sad fact of it is that now we will never know how many of them were being honest and how many are lying for the limelight. Cases like this only cast doubt on instances of rape, unfortunately. If you are victimized, report it immediately. Don't wait.","post_message":"Awful."}]
