[{"comment_id":"10154942733646873","commenter_b":"Sally Yates we need more of you. Well done.","commenter_a":"We have a dictator as presidentDon't agree with him ,you are fired","post_message":"Sally Yates had said the Justice Department would not defend in court Trump's immigration order."},{"comment_id":"1275116595847182","commenter_b":"@username You pathetic asswipe.","commenter_a":"Look at the number of blacks commiting crimes and try to tell me the only reason it's so obviously more blacks than whites is because of racism.","post_message":"Only White skin deserves justice?"},{"comment_id":"10153109676116051","commenter_b":"Fire the bitch","commenter_a":"UNBELIEVABLE ,THEY SHOULD BE CHARGED WITH THAT POOR LITTLE BABY DEATH,PRAYERS FOR THE FAMILY","post_message":"This EMT was dispatched to a home where an 8-month-old baby desperately needed assistance. The family was begging for help at this point. The EMT had a different plan, though."},{"comment_id":"1219104934776201","commenter_b":"And this is what this gremlin boils down to!","commenter_a":"This old man ain't going nowhere. Pump up the Trump.","post_message":"The conventional wisdom of the Democratic race holds that Vermont senator is the principled liberal challenging Hillary Clinton. But Bernie Sanders has moved too."},{"comment_id":"516541241803803","commenter_b":"@username then you should stfu!!","commenter_a":"If he violated a voting law, he should go to jail! Oh, wait! He was a drug dealer, had people killed, is a rapist, lied under oath, sold military information to China,.... STILL WALKING FREE!","post_message":"Do you think Bill Clinton should go to jail for this?"},{"comment_id":"10153320820056051","commenter_b":"Think it's a good idea, then neighbors can tattle on those. We must find some way to catch the thieves. And I agree with Marilyn , also. And there are many, many whites on welfare that shouldn't be,also.","commenter_a":"I like to see what I am buying and if ny money is well spent or wasted.","post_message":"This mayor is going to make the names and addresses of all welfare recipients public."},{"comment_id":"10152837029192894","commenter_b":"I do the housewives should be married","commenter_a":"I kinda have to agree @username what do u think ?","post_message":"NeNe Leakes Says Bravo Should Get Rid of All the 'Unmarried' Housewives -- Do You Agree?"}]
