[{"comment_id":"10153641804123487","commenter_b":"\"Staying Power\"....\"Explodes\"....Politics is so sexual.","commenter_a":"Who cares about the xenophobe clown? Why don't you cover the candidate with more real ideas: @webpagelink","post_message":"The GOP is doing some soul searching.."},{"comment_id":"544829205708653","commenter_b":"Free so the they can bomb and kill Israelis like their surrounding neighbours. No thanks","commenter_a":"I'm sure this will give the Zionists more reasons to steal land in Palestine I hope the poor people of Palestine will be free some day","post_message":"Wildfires are also threatening homes near Jerusalem and in the West Bank."},{"comment_id":"422053507998163","commenter_b":"After entering into discussions with egocentrics on Abortion, I have concluded the following: 1) Egocentrics callous their minds by clinging to the term fetus. 2) Egocentrics ignore the dictionary primary definition of child, \"1a :an unborn or recently born person\". 3) Egocentrics refuse to acknowledge a child exists until it breaths air. 4) Egocentrics ignore that sexual consent includes consent for sperm and egg to join thereby forming a new human being in the uterus. 5) Egocentrics dehumanize the new human being (child) by hammering the label \"fetus\", completely ignoring the relativity of \" the fetal stage\" development of a child. President Barack Obama told a group that harvesting organs from humans that are killed was and a tradition that needed to stop. He warned of dehumanizing marginal groups of humans and of the problems that arise when are not able to see someone else as a human being.\" Based ...","commenter_a":"No I don't think so","post_message":"Planned Parenthood and the 3% Abortion Myth"},{"comment_id":"10154680168205575","commenter_b":"@username that's a woman I would vote for","commenter_a":"You know, enough with this BS, I hope Trump wins again in 2020, and then Pence follows. These deranged off the rails nut cases think they lost now, just wait.","post_message":"Uh oh . . ."},{"comment_id":"10153899615080329","commenter_b":"They can go f****** themselves. Ur beautiful.","commenter_a":"I'm not Latino but I'm half Black and half American Indian and I've felt and been told I wasn't enough of either.","post_message":"Spoiler: You're perfect."},{"comment_id":"427873120742228","commenter_b":"hiliary could disapear forever and I reilly do not think she would be missed.Bill would be happy .The country would be a lot safer .Not to mention all those people who overheard something her loud mouth said would not have to die.A lot of people have died in her wake.EVIL EVIL EVIL WOMAN if thats what you want to call her.","commenter_a":"F#!#hillary","post_message":"Donald J. Trump has demanded Hillary Clinton apologize for making claims about him and ISIS propaganda that turned out to be false. Hillary's campaign just responded without holding anything back... Do you support Trump over Hillary?"},{"comment_id":"1123485461004965","commenter_b":"I like how Jeffery Nichols is the expert on how Women get pleasure. Don't ever believe what Women say lol.","commenter_a":"The correct position is penis in vagina. #savedyouaclick","post_message":"Size has nothing to do with it. (via HuffPost Canada Living)"}]
