[{"comment_id":"1270965036267418","commenter_b":"This poor dear is fighting an incurable disease and still want's to see American go back to being a great Nation again. Hillary keep you porn star and all the other jokers you can muster up. Melissa never give up dear, God can do miracles. Thanks for being a strong and down to earth women, unlike Hillary's choice of women.","commenter_a":"Rick Webb","post_message":"Former Miss Wisconsin USA Melissa Young, who is battling an incurable and fatal condition, said a note from Donald J. Trump in her darkest days reminded her that \"my purpose is to fight and I need to get up and fight.\""},{"comment_id":"10153189234471491","commenter_b":"I still want my coke 0. Gitty up !!!","commenter_a":"Hahaha! European countries welcoming muslim refugees beware! In a few years time......","post_message":"She filed a discrimination complaint."},{"comment_id":"618929588274862","commenter_b":"No one is now or ever has been against immigrants. It is ILLEGAL immigrants who are the issue.","commenter_a":"Republicans so easily forget that we are a nation of immigrants.","post_message":"WOW. Presidents Reagan and Bush Sr. sound an awful lot like Democrats in this 1980 debate... Video by Occupy Democrats, LIKE our page for more!"},{"comment_id":"974467552593717","commenter_b":"Fuck this cunt","commenter_a":"Love you Barbara...","post_message":"Senator Barbara Boxer, in 20 minutes, gave the BEST smackdown to the GOP I have ever seen -- calls them a \"national disgrace,\" and tells them to end their \"hostage\" taking of the DHS because of their \"hatred for the president.\""},{"comment_id":"998929483475806","commenter_b":"Don't know why.He has much more intelligence than Trump","commenter_a":"Cruz will make a great president and trump vice p.","post_message":"Thank you, Ted Cruz!"},{"comment_id":"10156142090560594","commenter_b":"I know","commenter_a":"Go back to Brooooooooklyn. Where you belong.","post_message":"If we can't have San Francisco Giants postseason wins, this is the next best thing."},{"comment_id":"1284456268283154","commenter_b":"Take her down, NOW! Before the Election!","commenter_a":"Vote Trump! There is just to much evidence of serious corruption to ignore. She is a criminal and a traitor to America!","post_message":"This is the end of Hillary Clinton's campaign, and it's all due to Congressman Jason Chaffetz releasing damning new evidence that will make sure Hillary sees the inside of a jail cell. The FBI isn't ignoring this anymore. Let's get 2,000 shares to prove that America has spoken and we want Hillary behind bars."}]
