[{"comment_id":"1062730680414093","commenter_b":"Donald trump can't even get 35% registered republicans Please do the math Trump can't win a general Election. You remember my words I'm not being nasty\" just call it in the know. You will find out I'm correct.","commenter_a":"This is for all of my fellow Florida voters. I just received my mail in ballot. Donald Trump is on the very bottom of the list, so please be careful and select him.","post_message":""},{"comment_id":"1128827183850702","commenter_b":"Hahahaha","commenter_a":"@username Benoit Badra @username thuggglifee","post_message":""},{"comment_id":"10152855879679753","commenter_b":"Bitch! F*cking bitch.","commenter_a":"My heart breaks for what that poor boy must have gone through.... how anyone can harm a child I'll never understand. I agree with others here. The parents knew he was being beaten. Something should have been done sooner.","post_message":"This woman did something horrifying to her 3-year-old nephew, all because he was having difficulty with a spelling lesson."},{"comment_id":"10153671476736509","commenter_b":"Online predators? she lied about her age, and deceiving people. wtf is wrong with you. how would that be all those men's fault? she lied dude. i'm glad mom stopped it. we need to do something about females lying about age. why are the men in the wrong hear? but that's the double standard of women though. kids should not be on Facebook period. we need to regulate Facebook and make it for adults only. and use id's to sign in. just like in a bar. i applaud mom, she could of gotten pregnant the works. it would of been her own fault. why? because she lied and said she was a grown up when she clearly was not. mom has every right to give those people a chance to delete her. and i bet you real quick, those people removed her. good job mom. good job. kids don't belong ...","commenter_a":"So people are shitting on her for tough love because she's trying to protect her child from online predators? WTF is wrong with society.","post_message":"Tough love or public humiliation? This Denver mom gave some strong feedback about her daughter's suggestive Facebook postings: @webpagelink"},{"comment_id":"10153448155621045","commenter_b":"Sure","commenter_a":"Elizabeth Kidd can we please please please go see this in 3D when it comes out ? Without the kids the first time lol","post_message":"Cannot wait! \"Keep on swimming.\""},{"comment_id":"367420056779622","commenter_b":"she should be in jail","commenter_a":"This is not right","post_message":"THIS is where tax money go..."},{"comment_id":"10150755555864999","commenter_b":"Because Bernie is a threat to their entire way of life.","commenter_a":"You guys are honestly so biased, this is good! I don't want a president who can't go 5 minutes without talking about their bible, and I much prefer a secular president, as does our Constitution with the whole separation of church and state thing. Why do.you have to twist everything in the world into a negative for bernie and positive for hillary.","post_message":"Unlike Hillary Clinton, who states emphatically that she is a Methodist “person of faith,” Bernie Sanders responds to questions about his beliefs by turning the conversation toward political ideals."}]
