[{"comment_id":"10157205870170354","commenter_b":"Cats don't like her.","commenter_a":"She can hate him all she wants but I bet more people in this world hate her pathetic ass. She is a washed up piece of shit who is completely irrelevant and means nothing to no one except maybe a few fucking cats","post_message":"Rosie O'Donnell's worst yet..."},{"comment_id":"10156550140360354","commenter_b":"WAKE UP AMERICA !","commenter_a":"Go girl!!","post_message":"What in the...?! And no, it's not a joke. It's a REAL lawsuit. Look at the documents..."},{"comment_id":"1526598987356152","commenter_b":"First Ladies are suppose to always embrace hope and not be pessimists.","commenter_a":"Her lavish vacations on the taxpayers backs are over !!!!","post_message":"SHE'S BACK TO HATING AMERICA: It's the end of \"hope and change\" and Michelle, for one, isn't happy about it."},{"comment_id":"589887647811084","commenter_b":"Please don't breed...","commenter_a":"Well I'd show an officer my id when asked, but some people feel differently and it's their right to walk away if they've done nothing wrong. Obviously she was never charged with \"jaywalking\", so in retrospect, she did nothing wrong according to her court hearing. Just saying.","post_message":"Are you kidding me?"},{"comment_id":"10153603915850667","commenter_b":"Thank you sir. You are right. Prayers for the family.","commenter_a":"Prayers^^^ These parents have to live with this loss for the rest of their days.This isn't the time to be judgemental or self righteous. Prayers and condolences are in order.","post_message":"The father struggled with the alligator to try to save his son, but was “unsuccessful.\" @webpagelink"},{"comment_id":"10152858304201336","commenter_b":"Enough is enough time to start locking these mothers up. They think they can just take over everything","commenter_a":"Man why doesn't this stuff happen in areas I'm in? I would never try to shout these people down. I'm going to physically knock them down. I simply cannot stand, nor will tolerate, this level of open disrespect. You have a right to protest, my right to protest in return is my choice, by the means I choose necessary.","post_message":"The protesters did not stop shouting until 100-year-old U.S. Navy vet Dario Raschio spoke up and said, \"Give me a chance. At least let us show a little respect for this occasion.\""},{"comment_id":"574645872704026","commenter_b":"@username so a woman that let Americans die that's the kind of person you think deserves to be president cause it's gonna be between the 2 think about that witch one is really worse","commenter_a":"Things will change when Trunp is president. The border police will have Trumps support. He'll also will support the Police & our brave service men & women. Vote Trump!","post_message":"Well that was easy..."}]
