[{"comment_id":"863341973762056","commenter_b":"It's not s scheduled White House speech. It's an impromptu get together organized by Boehner.","commenter_a":"I can't wait until the Republicans find out the Benjamin Netanyahu is not a Christian.","post_message":"Dozens of Democrats are skipping Netanyahu's speech -- including Senator Elizabeth Warren."},{"comment_id":"494096337456103","commenter_b":"Thank you San Diego Border Patrol for stopping these two.","commenter_a":"Aren't they lovely.","post_message":"BREAKING: Johnny Lewis Hartley, 39, and Mercy Mary Becerra, 43, were arrested midday Tuesday and are being held on suspicion of murder and child cruelty. When they tried to cross at the San Ysidro Port of Entry, Mexican authorities found the body of a 2-year-old child inside a duffel bag that Hartley had. \"The incident may have occurred in Whittier,\" San Diego police said."},{"comment_id":"10153402936366636","commenter_b":"It's funny lads, the women is clearly having a bit of fun. You all must be really fun at parties.","commenter_a":"Dad could be doing house duties as well. We can not say he does nothing at this house by watching a Video. I think the purpose of this is to show how this super-mom is capable of dealing with the 4 kids, multi-tasking, having patience, having the gentle touch, etc..","post_message":"We can't stop watching this video of a mum getting her four kids ready in record time"},{"comment_id":"10153001285494091","commenter_b":"Why have a trial for this garbage. Execute her already.","commenter_a":"savage.","post_message":"\"Everybody wants to know. Yes, I did kill her. The mother accused of killing her two children and storing their bodies in a freezer yelled in court that she killed them: @webpagelink"},{"comment_id":"633140033543242","commenter_b":"That's Ok She will BURN IN\"HELL\" Along with All The Rest of the Sheep That Followed HER !","commenter_a":"Ugly inside and out AND GETTING WORSE EVERY DAY","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"},{"comment_id":"10154404411899877","commenter_b":"Well said","commenter_a":"We have a long way to go when race and sexual identification are listed when recognizing someone for a new position. Only time sexual orientation should be consider is when trying to hook someone up on a blind date.","post_message":"A black, queer woman being named EIC is one of the biggest media brands in the world is EPIC!"},{"comment_id":"10152669093692434","commenter_b":"This girl is always bipping off about something, anything to get attention to her has been ass. All she ever was a girl in the movie and shitty tv show Clueless. She wasn't even the main character. She needs to sit her ass down and take 100 seats.","commenter_a":"She has ruined Clueless for me.","post_message":"“I’m not saying I’m a victim. I’m pissed off. I don’t wanna be a victim.” Stacey Dash is entirely owned by Meredith Viera in an incredibly awkward debate about the wage gap on The Meredith Vieira Show"}]
