[{"comment_id":"1410720895627548","commenter_b":"DISMANTLE THE USELESS ORGANIZATION CUT THEIR FUNDING !MONEY TALKS,","commenter_a":"I hope so!","post_message":"Is Trump getting closer to supporting H.R. 1205, the 'American Sovereignty Restoration Act,' to cut ties with the UN?"},{"comment_id":"10154063535716813","commenter_b":"Can I grab your pussy?","commenter_a":"I am so grateful for the @username and it's willingness to take a stand. I don't always agree with it's position, but I am always thankful for its existence and its hard work.","post_message":"ACLU Legal Director David Cole's closing remarks at Sen. Jeff Sessions’ confirmation hearing for attorney general. \"If someone applying to intern for one of your offices had as many questions in his record as Sen. Sessions has: racist comments, unethical conduct, padding of his resume, you would not hire him — absent the most thorough investigation and inquiry, if then. Sen. Sessions is not seeking to be an intern. He’s nominated to be the most powerful law enforcement officer in the nation.\""},{"comment_id":"10153110921541378","commenter_b":"Very glad the child's okay and I hope that scare woke up that woman to f****** reality","commenter_a":"How do you forget your CHILD in the car.","post_message":"DRAMATIC VIDEO: After allegedly leaving her 1-year-old alone in a hot car, a woman is confronted and a bystander incorrectly tells her that the child has died. That moment was caught on video:"},{"comment_id":"10153910519885695","commenter_b":"What a pig.","commenter_a":"He should be castrated .","post_message":"Jared Fogle's attorneys asked a judge for leniency, saying he is \"profoundly sorry.\""},{"comment_id":"10154261283691350","commenter_b":"Yes, those dang gators.","commenter_a":"@username, is this the real reason you're leaving Florida lol","post_message":"Is that thing real?!"},{"comment_id":"10153746801086336","commenter_b":"Sure abuser.","commenter_a":"Go to court when you are told to and this won't happen. Simple.","post_message":"\"I have a one-year-old son and I'm trying to take care of him by myself! I'm begging you, please!\" the woman cried to the judge before she was led away."},{"comment_id":"1707925176144398","commenter_b":"The shemale will sit alone","commenter_a":"He has no right to assume that the people who have died from gun violence would not have wanted to be able to carry That they might have been AGAINST gun free zones.. It's again his agenda if one of my family members had been one lost to these acts of violence I would demand that they NOT SPEAK ON THEIR BEHALF...THAT THE PRESIDENT make reference to the fact that he DOES NOT SPEAK for ALL CITIZENS","post_message":"The Obamas never miss an opportunity to shamelessly politicize an event. At the next State of the Union, Michelle Obama will be sitting next to an empty chair; and the outrageous reason why will have you shaking your head... Are you glad this will be Obama's final State of the Union?"}]
