[{"comment_id":"718123011626115","commenter_b":"BULLSHIT. And it has already been pointed out to you that the polar bear population has now reached record HIGH levels. The number of polar bears more than doubled since 2000, and increased FIVEFOLD since the 1960s. Pollar bears are thriving. Please don't disseminate this climate change crap.","commenter_a":"we can't even protect ourselves from these nazi socialist scumbags in charge","post_message":"If we do not fix this now they won't have a place to live much longer. Let's protect the Artic from Shell!"},{"comment_id":"10153562033956336","commenter_b":"Its not just the issue of illegals crossing the border and the US supporting them. The borders are open to terrorists coming across too and for both issues the bordetd need to be sealed ig we are to save our Country. Trump is right, without borders we don't have a Country.","commenter_a":"Ann Coulter is becoming the Johnny One-Note of 2016. SHUT UP ABOUT IMMIGRATION, ALREADY!!! There are dozens of issues out there that could (should) get your attention but every time I see you on @username you're yapping about immigration.","post_message":"\"The voters keep saying, 'We don't want any more immigration.' That's why Trump is so popular. So pick it up, Republicans.\" Do you agree with Ann Coulter about Donald J. Trump?"},{"comment_id":"1596151633736175","commenter_b":"This is what happens when their is no understanding of the real threat. Neither Iran or North Korea pose as large a threat as Climate Change. Not belief, understanding.","commenter_a":"Climate change does not matter to me North Korea and Iran want to destroy us probably a more urgent matter?","post_message":"Twenty-one kids and climate scientist James Hansen sued the Obama administration to take more aggressive action on climate. As of Thursday, the climate-change-denying 45th president has inherited the case."},{"comment_id":"1246473882081393","commenter_b":"TURN THEM LOOSE AN PAY THEM TO KILL AMERICANS !!!!","commenter_a":"Go figure that thank you Mr. Obama and miss Killory you guys are doing America so good","post_message":"REVEALED! Minnesota Mall Attacker ID'd As One Of Hillary's Somali Muslim Refugees!"},{"comment_id":"963164673751396","commenter_b":"Or, why do we have money to support refugees but not vets or social security?","commenter_a":"because welfare has got our money","post_message":"Americas Freedom Fighters"},{"comment_id":"10154692333454203","commenter_b":"EAT ME ASSHOLES!","commenter_a":"Dallas Lavalley","post_message":"This is how Donald J. Trump treats women."},{"comment_id":"10154234015931337","commenter_b":"You poor ignorant cunts...","commenter_a":"Howard Stern's Face is a roast all in it's own. Those giant dentures, cheap wig, and dick nose.","post_message":"FROM GIRALDO TO JESELNIK... These are the most vicious roast takedowns of all-time.'Comedy Knockout' premieres tomorrow on truTV at 10:30/9:30c. @webpagelink #ad"}]
