[{"comment_id":"1777601655795113","commenter_b":"Hilary is such a hypocrite. She is lighting the matches.","commenter_a":"But hey, Hillary over Trump for sure.","post_message":"The divisive rhetoric and encouragement of violence we're hearing from Donald Trump isn't just wrong—it's dangerous."},{"comment_id":"10154100932456968","commenter_b":"Has Steve Bannon taken over the POTUS Twitter account?","commenter_a":"Suggest that Trump and co. start keeping their mouths shut and start listening to America.","post_message":"He also threatened federal funds to UC Berkeley."},{"comment_id":"10154454034611350","commenter_b":"At least they can wear pants other than jeans","commenter_a":"I like the new rule. Ass and tits are not school appropriate.","post_message":"We shouldn't be teaching girls to alter their dress as to not 'distract' the boys.\""},{"comment_id":"10154611817649087","commenter_b":"Diana , sthu . Don't call me names . We went through 8 years of that black racist pos muslim traitor obama . Now we get a real American President that wants to help America and people like you don't even give him a chance . So crawl back under your rock and take obama with ya .","commenter_a":"So many liberals . I mean clueless liberals . With obama and hillary we would have been a 3rd world muslim country in no time . STHU and give Trump a chance . He's done more for America in weeks that obama did in 8 years .","post_message":"\"It's apparent that President Trump is clueless when it comes to nuclear weapons.\""},{"comment_id":"738159049657328","commenter_b":"I think that crooked, lying, evil bitch needs to be in prison","commenter_a":"K, this bit%h is really out there! She and her cronies want total power! I pray that God stops her!","post_message":"WOW. People NEED to listen to Hillary's response when asked if an individual's right to bear arms is a constitutional right... Do you think Americans should be scared of a Hillary Clinton presidency?"},{"comment_id":"10154422800373132","commenter_b":"These women are smart?? Lol OK.","commenter_a":"This show is a flake need to be cancel asap.","post_message":"That's quite the family heirloom, Kim Kardashian West. (via PeopleStyle)"},{"comment_id":"886812858022722","commenter_b":"Yea she looked so approachable at Chipotle! Fraudster.","commenter_a":"She is listening to what? She is too busy nodding her head all the time, so disingenuous. Listening?","post_message":"\"I want people to know I’m listening and I’m accessible...\""}]
