[{"comment_id":"1350025431679743","commenter_b":"Lmaoo thats why i say i cant be no girl","commenter_a":"See Babe Its Not Easy Being A Girl @username","post_message":"Women shouldn't have to spend a fortune on bras. Like ATTN: on Facebook."},{"comment_id":"10153184314438984","commenter_b":"This lady is a disgrace to our country. She needs to retire or get voted out so she can get a real life.","commenter_a":"Nancy Pelosi needs to shut up. Who cares what she thinks. She knew what to expect of the speech, stay away. People were there to support the PM not to listen to her senseless sniveling.","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10155057669604099","commenter_b":"Go away!","commenter_a":"Propaganda News has their disturbed audience...and their days are numbered. They have no one to blame but themselves! Buh-bye!","post_message":"The announcement comes a day after President Donald Trump's spat with the media sharply escalated."},{"comment_id":"10153834062371337","commenter_b":"You win the Internet today!!!","commenter_a":"Well, maybe when they introduce an HIV vaccine, she can get vaccinated.... Oh, wait...nevermind.","post_message":"Jenny McCarthy is not taking the Charlie Sheen news well..."},{"comment_id":"10152742769151167","commenter_b":"Rihgt Michael...just another Fox News whore","commenter_a":"Speaking as a Jew, I think someone needs to kick Tarantula upside her head.","post_message":"Vile."},{"comment_id":"1159186317427836","commenter_b":"Yep I pay almost $400 a month and have a $3800 deductible and so far haven't had anything covered except well visit:( my parents pay thousands for coverage now. The money has to come from somewhere.","commenter_a":"How can this be wrong? Why are so many Americans so disdainful toward ObamaCare? I don't get it?","post_message":"“It wasn’t about Democrats or Republicans, it was about our values as Americans...” A touching reminder from one American to another. (via NowThis)"},{"comment_id":"10153622148174497","commenter_b":"women can have some rights, just so long as they arent black mexican atheist homosexuals or anything.","commenter_a":"are men hogging up all of the rights again? come on guys... let the women have some of the rights.","post_message":"What is the path forward for women given the barriers to equality they face worldwide? The Onion explains women rights."}]
