[{"comment_id":"606523686188854","commenter_b":"@username i will not vote for @username, he is NUTS . just like Hillary.","commenter_a":"Will you Chip in today?: @webpagelink","post_message":"First they ignore you, then they laugh at you, then they fight you, then..."},{"comment_id":"1776377852617481","commenter_b":"Looks like he's winning. You're probably going to need to build a wall to keep us out.","commenter_a":"They're going to be the ones building a wall!","post_message":"LOL"},{"comment_id":"10152885011267507","commenter_b":"Woman put up with it because we are use to it. Woman are also so busy and have not prioritized changing this. Women will eventually say enough of this nonsense and put a stop to it for good. It is only a matter of time.","commenter_a":"Women in other developed countries are getting treated better ! Why do American women take this abuse ? No paid maternity leave , no paid sick leave , no paid or very meager paid leave , WTH is wrong with American women demand it and demand it now!!!","post_message":"Let's be good to our mothers today and EVERY DAY!"},{"comment_id":"1757186537848800","commenter_b":"BECAUSE SHE IS CROOKED","commenter_a":"Trump for president!","post_message":"\"When you look at the record, and when you look at what [Hillary Clinton's] actually done, when you look at Benghazi, when you look at all the instances over the last multiple decades… I think it fits.\" Donald Trump Jr. reacted to his father’s new nickname for the Democratic presidential candidate — \"Crooked Hillary.\""},{"comment_id":"10155008685674170","commenter_b":"Buy Global Warming , Ol AL GORE needs the MONEY !!! 😎","commenter_a":"Al Gore. Captain America. He is just another Delta Dawn, someone who feels he deserved to win, it was owed to him. Just like Chillory. So glad they are seeing that not every one likes them or shares their views.","post_message":"Well, they couldn't stop the electors from voting for Trump. But the left never gives up! This new plan sounds like something from a Scooby Doo episode."},{"comment_id":"559978767492171","commenter_b":"This @username guy can be on my tv screen anytime he likes. Hello, there 😍","commenter_a":"Hillary for President!","post_message":"Take a sneak peek at the MSNBC #DemDebate! Hillary Clinton and Bernie Sanders face off tonight at 9pm ET. Here's how to watch: @webpagelink"},{"comment_id":"10153519311713984","commenter_b":"you do see there is a white girl sating beside her and a couple of white boys with phones videoing they need to have there butts kicked","commenter_a":"This president is ramping up the racial discord for a reason, and it's not going to be good.","post_message":"A white woman was holding her toddler and minding her own business... but then this black teenager saw her and did something awful. The entire scene was caught on video... can you guess why Al Sharpton isn't saying anything about this?"}]
