[{"comment_id":"10153240346384087","commenter_b":"You are remarkably uninformed. Why do you passively accept propaganda?","commenter_a":"Abortions account for over 86% of Planned Parenthood revenues, according to President Cecile Richards, who makes over $520,000 annually. Richards made the admission while testifying before the House Oversight and Government Reform Committee on Tuesday. @webpagelink","post_message":"Rep. Jim Jordan interrupted Planned Parenthood President and CEO Cecile Richards 19 times in five minutes as he grilled her about the previous apology she had given about the leaked footage."},{"comment_id":"10153154397831051","commenter_b":"Trump is absolutely right. Illegal aliens are not immigrants by the way. They are merely common criminals. Criminal is not a race.","commenter_a":"I don't want their jobs but we need our benefits. Would you let your kid go hungry to feed a stranger?","post_message":"We went to the Donald Trump protest this week to speak to his supporters and critics. Here's what they had to say. Do you agree or disagree with Trump when it comes to immigration?"},{"comment_id":"10154818711864586","commenter_b":"BASTARDS","commenter_a":"these idiots should beSHOT!! \"COWARDS\"","post_message":"[GRAPHIC] If you drive a Toyota USA, General Motors, or Volkswagen car, you need to see this."},{"comment_id":"657748434349749","commenter_b":"CANCEL the game, go to half time show, then go home. Terminate the remainder of football season. Have each player turn in his jersey...","commenter_a":"I WOULD LOVE TO SEE AN ENTIRE STADIUM WALK AWAY FROM THIS CRAP...","post_message":"The entire team decided to pay tribute to Kaepernick and take a knee during the National Anthem. Guess how that worked out for them."},{"comment_id":"1004794989572137","commenter_b":"Bruno stfu you POG bitch","commenter_a":"Wtf is going on here? Don't you have pride and respect for the uniform you wear, for the veterans that fought many battles wearing that same uniform HOLY FUCK!","post_message":"The new Army drill and ceremony standard. #thanksobama ~Will"},{"comment_id":"1311726352220443","commenter_b":"Percy Lopez. ...taken to the cleaners, you have been schooled Percy, what's it like being a moron","commenter_a":"The best president ever!! Turned the economy 360 degrees after Bush's administration crashed it to the ground. You have done everything you could to help america Mr president. Your courage, dedication and integrity brought tears of gratitude to so many american people.","post_message":"'I can drink beer at 11.30am and Michelle won’t even know?'"},{"comment_id":"1049313658417628","commenter_b":"Too true!","commenter_a":"I see an IRS audit in staples future. ...","post_message":"Staples announces that because of Obamacare they're having to make some changes in the structure of their employees, and Obama does not like it and he takes out after them. \"Obama Slams Staples for Reducing Hours to Avoid Obamacare,\" and Staples responded."}]
