[{"comment_id":"687141811427171","commenter_b":"Impeach her husband and she'll go away with him!","commenter_a":"Look who's being bossy now!","post_message":"Michelle Running Campaign To Ban ‘Offensive’ Word From English Language. She has completely lost it. Do you find Michelle Obama offensive?"},{"comment_id":"1522859634396359","commenter_b":"\"Liberalism is a mental disorder\"...Dr Michael Savage. That woman is not fit to be that precious little boy's mother!","commenter_a":"I cannot watch this. This monster (mother) is horrible and I cannot imagine how frightened this little child was. She deserved to be punished.","post_message":"Imagine how the media would have been all over this story if the mother had been a Trump supporter furious at his defeat. And this story still hasn't made out of Houston. It's still just a local story."},{"comment_id":"906680809367341","commenter_b":"She is trailer park trash.","commenter_a":"Michelle has no class, she doesn't even look like a First Lady. In fact, she's not even First Lady material.","post_message":"This is EPIC"},{"comment_id":"10153161330059270","commenter_b":"Women shouldn't be allowed in the special forces. Period","commenter_a":"No surprise.","post_message":"No women pass Army Ranger School."},{"comment_id":"10154403319313812","commenter_b":"On their engines a 100,000 is a lot, only had to do my head gaskets or have a burned out valve. Meanwhile my duratec engine in the Mazda hit 300,000 with little power loss. We do love or did I should say our new 2016 Outback for the whole 600 miles we had it till yesterday it was the 85th car at the single dealership to be towed away to some lot in the middle of slc airport till god knows when Subaru can pull their head out and get entire steering colums to replace.","commenter_a":"I have 4 Subaru's in the family 2005, 2008, 2010, 2012. Three foresters one Tribeca. They all have been great. never had an issue with any of them. Two of them are over 100,000 miles. Love my Subie!","post_message":"RECALL ALERT: Subaru of America, Inc. recalls 52,000 cars and SUVs over potential steering failure and warns owners not to drive them."},{"comment_id":"967357503323727","commenter_b":"This sexist pig is just pissed because two women probably did better than he did. Tell this little ass to pick up his toys and go the hell home! Quit whining !","commenter_a":"If the truth be known, men are the weaker sex. Most of the genetic information is on the X chromosome and women have 2 Xs, men only one X. The Y chromosome has little genetic information, besides the male sex gene. Consequently, women are genetically stronger in many way ways and live longer. In many European countries women do a lot of the heavy work in the fields. In the US women are treated as somehow inferior, and men want to believe that they are \"weaker,\" but it is not necessarily so.","post_message":"This Republican misogynist is fuming that these two women passed the same Army Ranger course he did."},{"comment_id":"10155891268485354","commenter_b":"Don't give a Shi# what race you are do something like this and it should be automatic death penalty!!!!!","commenter_a":"I'm surprised you can say \"black\" gangs. any one that can do that to another human should be swiftly executed for their absolute worthlessness to society.","post_message":"The gang of 6 forced \"the male victim to watch as his female companion was gang raped.\""}]
