[{"comment_id":"971032156302726","commenter_b":"The Liberals should be deported along with the rest of the illegals","commenter_a":"Monday morning i was at the Dmv here in NC,and while waiting for the examier was attending to other people,i was listening to the other people around me. Everyone of us was ask if they were register to vote or if not they can register you right there. Five people were asked and all refused to sign up ! I got on my soapbox to the amusment of the examiers and told them about our sacred right to vote, they said nothing !","post_message":"Liberals want illegals to vote so they can cancel out your well informed vote."},{"comment_id":"1279396932093344","commenter_b":"This is why I hate narcan","commenter_a":"Horrible heroin.","post_message":"\"This child can't speak for himself but we are hopeful his story can convince another user to think twice about injecting this poison while having a child in their custody.\""},{"comment_id":"10150578591129999","commenter_b":"she has class","commenter_a":"Sexy","post_message":"Jennifer Lawrence in Dior couture at the Met Gala. See more photos: @webpagelink Credit: Josh Haner/ The New York Times"},{"comment_id":"10152983591416491","commenter_b":"Lena did it for 10 yrs. She's gross!!","commenter_a":"Lena was seven. Not 14 or 15. And Duggar raped his own sisters many times over many years. And who the hell is Palin? An irrelevant person seeking relevance.","post_message":"“I’m sickened that the media gives their chosen ones a pass for any behavior as long as they share their left-wing politics.”"},{"comment_id":"10153130571029726","commenter_b":"Is that considered a rhetorical question? I think you know, and I'll add that all those girls need to be caged.","commenter_a":"Animals.","post_message":"VIDEO RAW footage of 4 teens viciously beating a girl in Brooklyn McDonald's as a crowd cheers them on. Why do parts of society cheer and take pleasure from this type of sheer brutality?"},{"comment_id":"10152606529540950","commenter_b":"Okay says the 21 year old hag","commenter_a":"Old bag","post_message":"Hilary Clinton tweets support for getting children vaccinated @webpagelink"},{"comment_id":"801744643293915","commenter_b":"#HillNo #HillaRigged #NeverHer #LatinasForBernie","commenter_a":"hillary is going to get the majority of bernie voters to vote for her in the end and trump will be squashed.","post_message":"Of those surveyed, 74% said they have an unfavorable opinion of Donald J. Trump."}]
