[{"comment_id":"963644947039340","commenter_b":"But she is dirty","commenter_a":"She knows women's issues best","post_message":"Watch live as Hillary talks to students at New England College in New Hampshire about the issues on their minds."},{"comment_id":"904311766324849","commenter_b":"How do dicks like this get rich?","commenter_a":"Wow, what a dick!","post_message":"All I can say is that this guy is a total douche. What's your response to this video?"},{"comment_id":"933533113336146","commenter_b":"Humans suck","commenter_a":"I donate to Amur leopards monthly. I hope we can save these lovely creatures!","post_message":"We need to take action now or risk losing some of the most beautiful citizens of our world."},{"comment_id":"1209908089068937","commenter_b":"Stay strong","commenter_a":"Wow what nasty humans out there!!! Thank you so much to those of you that have some understanding of what I went through..","post_message":"A truly incredible transformation (Via Daily Mail Australia)"},{"comment_id":"1016709065044307","commenter_b":"Camille Valdez I don't think nothing would of happened if she was there unless she a trouble maker","commenter_a":"Cesar Chavez beginning down 9 days and not going to that school and it's Mexicans vs. blacks that's what it is there's going to be War","post_message":"#ALERT Police are at the scene of Cesar Chavez HS where several fights have broken out."},{"comment_id":"10153234485277293","commenter_b":"That's hard work for women","commenter_a":"Women must stay home and have babies that is strongest work in the world","post_message":"The research raises the question of whether the Marine Corps may press to keep the infantry and Special Operations, in particular, closed to women."},{"comment_id":"867761519952633","commenter_b":"Illegals can get drivers licenses in NC.....no problemo! Dumb!","commenter_a":"Illegals can drive drunk but I can't. Now that's discrimination. Lol","post_message":"BREAKING: Leaked Document Reveals SICKENING Order Obama Just Issued To Border Agents President Barack Obama has issued a new order for the Border Patrol not to arrest drunk drivers because driving while impaired is not a federal crime. The notice, With Alcohol-Impaired Drivers, directed the 4,000 U.S. Border Agents in the Tucson... #arrest #borderpatrol #drunk @webpagelink"}]
