[{"comment_id":"10154431289101523","commenter_b":"Can they deport you with him?","commenter_a":"Throw the books at them.........I'm calling for 10 yrs! Better yet deport them!!","post_message":"Guns, body armor and marijuana located during a traffic stop in Germantown."},{"comment_id":"10153509891501051","commenter_b":"Oh ya.....that'll stop the criminals from getting illegal guns!","commenter_a":"AGREE all the way","post_message":"Do you agree or disagree with the majority of Americans on this?"},{"comment_id":"10153759354128352","commenter_b":"She's a slut","commenter_a":"U can tell exactly who the sluts are on this post lol all the women who are defending her..","post_message":"Woman who was ‘slut shamed’ after her public threesome at Calgary Stampede went viral says she has no regrets – in video seen by 3.4million"},{"comment_id":"10154223634466770","commenter_b":"She's got great legs","commenter_a":"All these red carpet shows are about is who can have the most revealing, revolting and trashy outfit on! It's rare that there's a decent one, but I guess they're the ones not shown because they aren't revealing enough! Too bad these \"artists\" don't rely on talent!!!","post_message":"We didn't even know they made dresses this short."},{"comment_id":"1799616930271434","commenter_b":"Liar!","commenter_a":"The more she says it the less I believe it.","post_message":"\"Certainly my meeting with President Bill Clinton raises questions and concerns.\" Attorney General Loretta Lynch says says she will accept the recommendations of the FBI on whether to pursue charges against Hillary Clinton."},{"comment_id":"10153798223993132","commenter_b":"All white women fear intelligent black women!","commenter_a":"Im not at all surprised that a group of loud, obnoxious, self-important women threw a fit. Don't be disrespectful to other passengers, and then demand respect. You're not above others.","post_message":"But it may be too little, too late."},{"comment_id":"10153417590345329","commenter_b":"Nah,cause then feminists will bitch.","commenter_a":"Stop that already! Or make MomBodies a thing!","post_message":"DadBody goals right here via Leonardo DiCaprio."}]
