[{"comment_id":"10154044845821320","commenter_b":"Will it turn into ice by the morning","commenter_a":"Stay warm all from sunny California.","post_message":"Mike Woods updates the storm. Be sure to download the free FOX5NY WEATHER app to get Fox 5 weather on the go."},{"comment_id":"1596477097312385","commenter_b":"Illegal immigrants must not vote. That is against the law. All people must be made to show ID to make sure illegal immigrants are not voting and to make sure nobody votes more than once. It is simple common sense. For the very rare citizen who may not have ID they can assist them and pay the fees. It would only be a very few people. But everybody must show ID to vote and prevent voter fraud.","commenter_a":"Why do judges think only black people don't have IDs and considering everyone needs an ID for just about anything else, why would anyone not have an ID? All this law does is make sure there is not voter fraud...so in essence this ruling shows me that the court wants voter fraud, it's the only thing that makes logical sense. I think it may be time for other countries to oversee our democratic process or we need to stop telling them we will oversee theirs because we obviously have no moral high ground to speak on the subject in other countries.","post_message":"Unreal."},{"comment_id":"10153984867744411","commenter_b":"Saul Mendoza See, even Muslims know that Rapefugees are invaders","commenter_a":"Something is wrong as a muslim i am starting to realize people crossing borders easily are not refugees they are actually invaders , strict action must be taken to control borders","post_message":"Some 20,000 commuters travel from Denmark to Sweden every day"},{"comment_id":"10154303723989411","commenter_b":"@username I'm not sure all of them are refugees","commenter_a":"if cannot adapt the European lifestyle why want to lived in Europe. I just do not understand, much better they lived in arab countries and do their own style.","post_message":"'We are not anti-migration party, we are for controlled immigration. We cannot allow for the borders just to be open for everybody who wants to come in and settle down here. No other country does that'"},{"comment_id":"1585670881742175","commenter_b":"DRAIN THE SWAMP","commenter_a":"END THE CORRUPTION!","post_message":"WATCH LIVE: Donald Trump campaigns in Golden, Colorado before he comes to Phoenix."},{"comment_id":"1221649794521715","commenter_b":"Thats not how a hoe talks to a pimp literally in this case","commenter_a":"He's just trying to cover his own butt.....","post_message":"The owner of the Nevada brothel where Lamar Odom was found unconscious says Khloe Kardashian's publicist has asked him to stop speaking to the media — a request that made him furious."},{"comment_id":"10152610219894071","commenter_b":"Gabriel Emilio","commenter_a":"Bates PAPA Creighton","post_message":"They're killing it right now."}]
