[{"comment_id":"1686157554986660","commenter_b":"Smart woman only a dummy would join Scientology!!","commenter_a":"Kirstie, you are beautiful and such a smart woman! I applaud your endorsement of Donald Trump. Don't let your \"neighbors\" get you down.","post_message":"I am sure people in Hollywood are losing their minds right about now, but this actress is NOT backing down. Do you support Kirstie Alley's presidential pick?"},{"comment_id":"10153078064342994","commenter_b":"we're on that list so maybe. I NEED TO FLUSH SOME ICE","commenter_a":"Alexis Nichole Fortune hoping we close. 😩","post_message":"Our site has the complete list of school closings. Stay warm out there!"},{"comment_id":"1015377538499586","commenter_b":"Once they gain a hold in our political system does anyone think they won't usher in Sharia Law? Incompatible with our Democratic Republic!","commenter_a":"When Islam got started it destroyed what was decent in the Middle East. It's incompatible with anything.","post_message":"\"Do you think, fundamentally, Muslims from the Middle East are incompatible with American democracy?”"},{"comment_id":"10153311362744135","commenter_b":"Thank you \"Pieter\" for finally posting something informative. This may be the first time. As far as your buddy \"Kathleen\" goes, it matters because many of her negative comments apply to politicians in general, so it would be quite naive and hypocritical of her to constantly criticize Christie, let's say for lying, while supporting a candidate who also lies.","commenter_a":"Please discuss why you don't threaten to enforce federal guns laws in states, but only marijuana. This would show you as a complete hypocrite and fraud. Please explain why you have expanded the failed war on drugs, your words, in Jersey.","post_message":""},{"comment_id":"627551224082449","commenter_b":"What a nasty woman. ...","commenter_a":"Rosie is totally against any heterosexual type of sex,she would prefer all people were gay like her.s","post_message":"Rosie O'Donnell called Donald Trump a “demented human being,\" a “sexual predator,” and several other nasty things."},{"comment_id":"1597744450278312","commenter_b":"Needs the money for Muslim refugees AKA Isis terrorists!","commenter_a":"IF this true, I will be willing to bet that none of those being cut are democrats! JACK","post_message":"Americans will soon find out that they’re not getting the money that they were promised..."},{"comment_id":"10153396676558837","commenter_b":"What cracker dnt steal money there all crooks","commenter_a":"At Least in sweet water PD This is standard procedure","post_message":"OFFICER ARRESTED: Detective Armando Socarras, a 10-year veteran, was accused of taking $1,300 in drug money."}]
