[{"comment_id":"846780482084872","commenter_b":"You are an ignorant woman.","commenter_a":"This is making me sick, and it. Is a sin in the eyes of the lord.","post_message":"The sailor's boyfriend was nervous he would \"screw it up and fall in the water or something.\""},{"comment_id":"10154778794215470","commenter_b":"@username Get her to California!","commenter_a":"All I know is that my American dream was quite shattered when I was thrown out of my job after three decades because I was labeled \"old\" (over 50) and insurance premiums were too high, so I was replaced by four cheap employees. Who was protesting for me? Middle class dreams have been more than shattered - we are the poor working ourselves to death to pay for the poor that don't want to work?","post_message":"\"My story will be much like others who dedicated their lives to their dream — the American dream — and whose intentions and lives were turned upside-down on Friday without notice or reason.\""},{"comment_id":"860254627375604","commenter_b":"So their religion allows that then ? Bunch of fucking cowards .","commenter_a":"Time to nuke the FILTH........when will the uk and America finally stop bowing down to this scum","post_message":"Some women have been forced to seek hospital treatment after violent sexual encounters"},{"comment_id":"482004281990152","commenter_b":"Muslims are breaking our laws. Take down the sign and let muslims know that we have our own laws and as Americans we do not recognize sharia law.","commenter_a":"Shoot them all..","post_message":"First our schools, then our public areas, what's next? 'SHARE' this post, we have to let the nation know what the MSM won't. Do you agree Shariah must be stopped?"},{"comment_id":"10154130696774087","commenter_b":"PRAYING JUSTICE PREVAILS...After hearing about Obama using a fake name to communicate with Hillary on her unsecured personal server, it explains why Hillary was given a pass and never indicted. Their corruption is as thick as sewage all the way to the top of the White House. This is unacceptable. \"Deplorable\" is Hillary and Obama. Hillary and Obama for prison... Donald Trump for President!! Hillary is not an option... ##TrumpPence'16","commenter_a":"The GOP spent millions of our taxpayer money, and they proved that Hillary was blameless for the response to Benghazi. Just wait, the GOP might just open up yet another wasteful investigation. :D","post_message":"“What Hillary tried to set up and what they apparently spent months preparing is an ambush as false as Benghazi,” Newt Gingrich said."},{"comment_id":"1027700850605035","commenter_b":"Russia does not need turkey; Turkey are the back stabbers lying pigs!","commenter_a":"But Russia will miss alot if they cut relations wz Turkia","post_message":"Russia's Foreign Minister Sergei Lavrov has rejected the possibility of normalizing relations with Ankara after Turkey downed a Russian warplane inside Syria."},{"comment_id":"1546688018681408","commenter_b":"If we are about to start following the Bible, can we get this woman to shut her mouth first ??","commenter_a":"I'd pay money to see the look on her face at the innoguration.","post_message":"\"Okay, Hillary, now that Donald J. Trump is looking to help you heal and help the nation heal, would it be fair to say – to use your own words – 'It's time to give Donald Trump his chance to lead'?\" – Judge Jeanine Pirro @webpagelink"}]
