[{"comment_id":"10155415365743812","commenter_b":"Alfredo Aguilar This comment","commenter_a":"I see Trump's shipment has arrived. This explains his snorting problem. lol","post_message":"U.S. Coast Guard Cutter Midgett crew offloads more than 13 tons of cocaine at Naval Base San Diego that were seized in 21 separate incidents in the Eastern Pacific Ocean. @webpagelink"},{"comment_id":"1543012149092242","commenter_b":"Awww you pathetic little slut... Let me guess, yo baby daddy is black....","commenter_a":"Its funny because in the 5th grade i refused to stand for the flag, 5th grade and i already knew this country was crap and lacked concern for its citizens. My friends grandfather was a vet from vietnam and she refused to stand for the flag out of how this country treated its troops. And she had every right and justification. You guys are missing the meaning behind the flag, you cannot just take the good of a country and claim thats all the country is. There is injustice that is constantly being negated by people like you, and those in these comments, simply because you haven't experienced it. Get over yourself and your terrible nationalistic views about a country that couldnt care less about you. Reality is reality, that flag represents a government that openly allows racism to grow and continue in our judicial and enforcement systems.","post_message":"This store owner planned a signing event with Brandon Marshall but when Marshall protested the national anthem, the owner cancelled the event immediately... but what the owner did next is going viral. Good for this owner... he's a true patriot."},{"comment_id":"10153522112557690","commenter_b":"Amen","commenter_a":"Rest well kiddo !!! Hope your fam find some comfort in the lord !!!! From him we came and to him we shall return!!!","post_message":"Police say a Denton teenager died after being struck by an SUV while trying to cross the street. @webpagelink"},{"comment_id":"1368414533215688","commenter_b":"GOD bless them! I HATE cigarettes and the trillions of the non-biodegradable butts that filthy our planet and its waterways.","commenter_a":"Fine them sons of bitches. Why should they be above the law.","post_message":"Thoughts?"},{"comment_id":"508254089382552","commenter_b":"It's cheaper in the long run to deport them now.america can't continue to feed ,clothe,and give free everything to these people.Damn it our vets and needy in america should come first.","commenter_a":"We don't , and they don't assimilate ..","post_message":"NO."},{"comment_id":"10152739817385047","commenter_b":"Signed! Stop abortions!!!!!","commenter_a":"Lord I pray that Congress will do the right thing here & save these babies. In Jesus' name I pray amen","post_message":"Late-term abortion is being put to a vote this Wednesday in Congress—potentially putting a stop to abortion at and after 20-weeks gestation. Sign & Share this critical petition to tell Congress to defend life: @webpagelink"},{"comment_id":"1841357016150669","commenter_b":"Coming out now? It sure is a convenient time. Why is she reading it?Another thing if Trump was sexually abusing her why did she stay ? Why didn't she leave when he first kissed her. She stayed and he kissed her again. He put his hand on her breast and she still stayed? Give me a break! This woman is big time lying. This never happened!","commenter_a":"So many people are so stupid and are going to vote for Hillary but when she cause a war and all your children are sent to war and dying don't complain.","post_message":"\"I stood up and he came to me and started kissing me open-mouthed as he was pulling me towards him. I walked away and I sat down in a chair.\" - A former contestant on \"The Apprentice\" describes alleged unwanted sexual advancements made by Donald J. Trump. More: @webpagelink"}]
