[{"comment_id":"10153099040499726","commenter_b":"I'd like to get rid of your ass.","commenter_a":"Just another lie.","post_message":"WATCH: Democratic Representative: 'Tea Party People' Want To Bring Back Segregation, Get Rid Of Women's Rights."},{"comment_id":"1166185690114851","commenter_b":"I agree Awesome comment thanks :/","commenter_a":"OG gives zero fucks","post_message":"Uber driver loses it after man smokes weed in his car"},{"comment_id":"1579218252372572","commenter_b":"You k ow it is . She can't win. Otherwise","commenter_a":"Narcissists must have someone or something to blame for their inadequacies and failures.","post_message":"\"I'm afraid the election is going to be rigged, I'm going to be honest,\" Donald J. Trump told a crowd on Monday, just days after he criticized the \"unacceptable\" general election debate schedule."},{"comment_id":"10153517390897293","commenter_b":"TRUMP KNOWS HOW TO NEGOTIATE! Politicians see how you get things done! Everyone is talking about Trump, and he doesn't have to pay a penny! Awesome! This is a Revolution for Trump like I have never seen in my 63 years! Go Trump! The man with COMMON SENSE! Obama was bought by the Communist Billionaire George Soros. Soros' main objective is to destroy America. Soros is now buying Hillary. NEWS MEDIA IS BRAINWASHING AMERICA TO HATE TRUMP! The people who have ruled America behind the backs of Politicians they have paid to win will lose a lot of MONEY if Trump gets elected. Who are these people, well some of them OWN NEWS MEDIA STATIONS! How many World Leaders have been paying Politicians to run so they could have a payback when the Politician got into power? Notice how much money America sends to other Countries? Think about it, WHO ...","commenter_a":"Waaaaah.","post_message":"He's out of Thursday's debate."},{"comment_id":"10153160535761491","commenter_b":"Shes nowhere close to finny. Shes more along the lines of annoying.","commenter_a":"Non stop coverage of Amy Schumer won't work. She's still not funny.","post_message":"\"Amy and I were creatively made for each other,\" Jennifer Lawrence said."},{"comment_id":"388626891261906","commenter_b":"Rick have the nerve and turn them in!","commenter_a":"should politicians?","post_message":"This could be bad news for some people on food stamps."},{"comment_id":"574474082714162","commenter_b":"A voting majority will not vote for a re-hash of the Bush administration.","commenter_a":"Newt Gingrich, Mike Huckabee","post_message":"Question of the Day: Who should Donald J. Trump pick to be his running mate?"}]
