[{"comment_id":"10154134497810575","commenter_b":"I'm so sorry for your lost child. It sad and terrible we are being made to put up with these illegal criminal invaders.","commenter_a":"Hang him and the next ten people who allowed him to be here.","post_message":"NEW YORK GIRL DIES AFTER BEING HIT BY TWICE DEPORTED ILLEGAL ALIEN...."},{"comment_id":"675915449265700","commenter_b":"Muslims are animals,filthy Scum!","commenter_a":"Get rid of all muslims there nothing but problems.","post_message":"Putin just verbally destroyed this Muslim ambassador. He's on a mission to put an end to Muslim brotherhood. Are you glad someone is standing up to ISIS?"},{"comment_id":"10153454779861336","commenter_b":"If Mexicans went they would no longer be illegal aliens. They'd be going home.","commenter_a":"I didn't know NASA was racist theres no black astronauts on the list!","post_message":"NASA - National Aeronautics and Space Administration has named the four astronauts who will fly on capsules built by private companies — SpaceX and Boeing."},{"comment_id":"10153533859861615","commenter_b":"Get that creep off the streets, love that area. People are so sick.","commenter_a":"Diane Fickley Pesci","post_message":"“(He) blocked her so she couldn’t go any further that way and says, ‘Hey, want to have a good time?’” NOW ON CHANNEL 11 MORNING NEWS: A man is being questioned in connection with an attempted luring of a teenage girl -- in the parking lot of South Hills Village Mall. Hear what she and her mom did to help police track him down."},{"comment_id":"10154992177868905","commenter_b":"It really is better to have a world view. Try it some time.","commenter_a":"BBC has really gone down the tubes! Stick with news from your own country and leave ours alone!","post_message":"Watch LIVE: Latest Trump news, talking deportation and anti-Semitism. Get your questions to us in the comments section..."},{"comment_id":"1040961739305022","commenter_b":"Thats right. He you dont like it then get the hell out of MY COUNTRY","commenter_a":"I do want my country back...America...the land of the free from sea to shining sea, from mountain to desert...I want it all back, all the beauty and peace and sweat and hard work that we Americans have given this land...I want it back...my America...not some version that obammer thinks it is...not his America...my America..and if that offends anyone, that is just too damn bad.","post_message":"Americas Freedom Fighters"},{"comment_id":"1580252788658041","commenter_b":"PLEASE STOP POSTING WITH THIS DESPICABLE WOMAN. ENOUGH TORTURE ALREADY.!","commenter_a":"Shes wacked","post_message":"Conway says she is more “amused” than “worried” over the fact that none of the top notch schools in Washington want to accept her children."}]
