[{"comment_id":"960454674002831","commenter_b":"I agree and anyone with a brain knew what the little guy was doing. Your business and the buck stops at the top. But Rubio wouldn't know about a business or for that matter what it's like to take a job and show up to work! Only be a puppet whipping boy for the old lifetime old farts on the hill. Look on line about Rubio and pulling strings to help his drug dealing brother in law? Check it out! This is the jurk running for the top office? Or any office! What a joke and a choker! Did I get it right little man that sweets like a pig?","commenter_a":"The true story... Trump did not know the Sub contractor hired the polish workers but settled it anyway and took responsibility even though it was not his doing.. Rubio and Cruz are the con-artists and the liars. Typical politician bull-crap. @webpagelink","post_message":"MARCO-BOT is back!"},{"comment_id":"10153435267083352","commenter_b":"Sick woman!","commenter_a":"Grr.","post_message":"Lady Sets Out to Murder Two Moms, Take Their Babies, Then Tell Her Former Man That the Kids Are Twins From Him Her Scheme Goes Horribly Wrong and One Baby Dies"},{"comment_id":"1301129679938665","commenter_b":"Would it be ok if you calmed your titties and stopped being such a butthurt faggot?","commenter_a":"(Cough) tarnak farm friendly fire incident (cough)","post_message":"Sometimes it's not the enemy you need to worry about. ~Will"},{"comment_id":"10154523489186336","commenter_b":"This must be an attempt to try and dig yourselves out of the hole you're in.","commenter_a":"If you want to know what is really happening in the world bypass FOX and CNN, and go to alternative news sources. You will be amazed to see how much the American news media ignores. We are all living in the dark.","post_message":"Now more than ever, viewers are turning to Fox News Channel – Most Watched, Most Trusted!"},{"comment_id":"1720347271558389","commenter_b":"What a pathetic slut !!!!!!!","commenter_a":"Just another Wacko;showing her ignorance.","post_message":""},{"comment_id":"10152926517991491","commenter_b":"A predator is a predator no matter what age they are. I'll bet kids who murder should get away with it based on naivety and hormones too right? Hormones drive alot in a human beings, including aggression, so thats an excuse I guess.","commenter_a":"Go figure. Anti-gay bigot who thinks gays are predators is a predator himself. So much self projection among the religious.","post_message":"“I would do anything to go back to those teen years and take different actions.”"},{"comment_id":"10153291115837411","commenter_b":"@username, he pleaded guilty to 4 counts of manslaughter.","commenter_a":"He killed four ppl, But Bobby shmurder still locked up for a gun smh..White supremacy system for ya.","post_message":"Ethan Couch, the so-called \"affluenza\" teen convicted in a fatal 2013 drunken-driving accident who was taken into custody in Mexico, is back in America."}]
