[{"comment_id":"10153739265536323","commenter_b":"Plus 50 year old lesbians aren't click magnets :)","commenter_a":"The girls in the photo look like teenagers! Not 50 year old women.","post_message":"An emotional conundrum."},{"comment_id":"10154688029234749","commenter_b":"No, not all woman. Just ugly dogs like yourself","commenter_a":"Because the beard makes them extra ugly and nobody else wants them","post_message":"A little bit of stubble has a whole other meaning though..."},{"comment_id":"1427245267295499","commenter_b":"Half a gallon of milk. $2.50, a box of cereal can be found for under $5 in your local hood supermarket lol come on people, don't be this stupid. Don't be the person who goes out for $7 cereal.","commenter_a":"If it comes with refills, I'm in!","post_message":"It better be a gr-r-reat bowl of cereal."},{"comment_id":"10153941213411162","commenter_b":"Lacey why are women lazy for not changing their last name? You should speak for yourself only.","commenter_a":"isnt her name Erica Crosby.. ijs.., she was his wife.... right","post_message":"HUSBAND PLEADS GUILTY: Kyle Crosby, 29, has pleaded guilty to murdering his wife who went missing on New Year Eve, 2014. Erica Crippen body was found March 17. As part of a plea deal, charges against Crosby mother have been dropped. FULL STORY: @webpagelink"},{"comment_id":"611879509002628","commenter_b":"She was already insane!","commenter_a":"Whay too much PIE HOLE. Cuss at me, and your Freedom of speech, goes right out the window!!! Maybe she should resort to plan \"B\". Get a M/F'in JOB!!","post_message":"This welfare leech absolutely lost it when she couldn't get change with her EBT card. How pathetic. You cannot live off the hard work of other people. Are you tired of welfare leeches stealing your money?"},{"comment_id":"10156658380360354","commenter_b":"Has anyone noticed how the name has changed from refugees to migrants. They are not migrants they are foreign invaders Some people will never learn. You need to know who you are letting in your country. Know the history of Islam. We need to wake up in this country stop paying people to come here and destroy us. This was copied from a post by William Parrott When politically correct, tolerant, and culturally diverse societies agree to Muslim demands for their religious privileges, some of the other components tend to creep in as well. Here how it works. As long as the Muslim population remains around or under 2% in any given country, they will be for the most part be regarded as a peace-loving minority, and not as a threat to other citizens. This is the case in: United States Muslim 0.6% Australia Muslim 1.5% Canada Muslim 1.9% China ...","commenter_a":"How can anyone say that their religion does not allow this violence against non - Muslims?","post_message":"“How dare you run away from us?” one Muslim man allegedly yelled. “Christian girls are only meant for one thing. The pleasure of Muslim men.”"},{"comment_id":"10155017409098896","commenter_b":"I'm ok with a trump wall.","commenter_a":"Figures !","post_message":""}]
