[{"comment_id":"1008697665856648","commenter_b":"Deport them now ,let them go to enjoy Saudi Arabia!","commenter_a":"GOOD the muslims have NO right to tell others what to do and what not to do and no one has any right to attack anyone over an imagined religious superitory","post_message":"In protest, hundreds are posting photos of themselves wearing swimsuits in public places"},{"comment_id":"10153134132200933","commenter_b":"Adan the total pussy.","commenter_a":"Kasich is the best up there by far","post_message":"Check out Gov. Kasich's opening statement from tonight's #GOPDebate."},{"comment_id":"867761519952633","commenter_b":"Illegals can get drivers licenses in NC.....no problemo! Dumb!","commenter_a":"Illegals can drive drunk but I can't. Now that's discrimination. Lol","post_message":"BREAKING: Leaked Document Reveals SICKENING Order Obama Just Issued To Border Agents President Barack Obama has issued a new order for the Border Patrol not to arrest drunk drivers because driving while impaired is not a federal crime. The notice, With Alcohol-Impaired Drivers, directed the 4,000 U.S. Border Agents in the Tucson... #arrest #borderpatrol #drunk @webpagelink"},{"comment_id":"10153391027640950","commenter_b":"THEY DONT WANT CONTROL FOLKS.","commenter_a":"CBS, you need to get control of that audience, they really are ruining the debate. I want to listen to the candidates, not to cheers and jeers","post_message":"Marco Rubio to Ted Cruz: I don’t know how you know what I said on Univision because you don’t speak Spanish. Immediately, Cruz responds…in Spanish @webpagelink"},{"comment_id":"10155210015483132","commenter_b":"What about him he deserves a good women she's nasty","commenter_a":"Good for her! She deserves a good guy","post_message":"Things are heating up between Valentin Chmerkovskiy and Amber Rose!"},{"comment_id":"10153793456236336","commenter_b":"@username, actually I am quite the opposite. I believe that a 17 year old, is not a child anymore. I believe in raising kids to respect authority not defy it. I believe in order for people to succeed in this life, they need to learn to communicate appropriately and in the correct place. This punk did none of the above and she challenged because she thought she could control the authorities in the room. There was no brutality here at all and what the Officer did probably stopped the room from erupting in violence. Go watch @username's video and read the story. It may teach you something. Hopefully, this thug learned something from all she went through, but somehow I doubt it.","commenter_a":"I watched the entire video. You had a belligerent girl who refused to put away her cell phone. She was mouthy to the teacher, the principal and then the officer was called. He asked her nicely to obey. She refused to follow his orders even after being asked several times. He went to take her out of the chair, she hung on. He did not body slam her, as reported and actually she came out of the chair pretty easily. It just looked bad because the chair fell over. The officer was completely correct and the girl was completely wrong. They better clear this officer or they will be sending a very bad message and more kids or punks as the case may be, won't listen to their teachers either. Chaos will ensue in the classroom and order will be totally out the window.","post_message":"Do you think this is a case of excessive force or lack of respect for authority?"},{"comment_id":"10155065586189657","commenter_b":"She is garbage","commenter_a":"Gun owners - mentally disturbed. A man dressing up like a woman - \" Normal \" This is leftism.","post_message":"This wasn't a mistake, this was done on purpose."}]
