[{"comment_id":"10155463176480294","commenter_b":"Jordan Beier","commenter_a":"I saw about at two points when the injury could have happened (the roll, and when he was thrown out of the ring) and the dropkick could have finished off the injury but the way he was handled after the injury didn't help matters. According to the earlier reports he died at the hospital but he didn't look alive to me.","post_message":"When the bout ended, medical personnel transferred Aguayo to the hospital, where local media reports he was pronounced dead:"},{"comment_id":"10153566353686323","commenter_b":"Paul, I live in Heidelberg Germany. The Americans have left, and the army barracks have been filled with refugees. The plan was for 1200, but we have 1900. This summer, I drove to the UK. The British press reported trouble and riots in Calais and Dover - we sailed through, in both directions. Germany has taken 8x the number of refugees than Britain. And, incidently, I find that if I post here, I often receive an extremely rude and aggressive reply from someone in the UK. I find the British to be quite aggressive, probably frustration with the pro military, right wing, Banker Government, for whom they voted. (Preparing for a tirade of abuse here :) )","commenter_a":"Considering that the surge in recent immigration to EU is mainly due to military and political actions initiated and undeertaken by UK, US and France the hospitality displayed by Germany is more than commandable ... And the British attempts to refuse responsobility for the Lybian and middle eastern mess is plain shameful ...","post_message":"In July, Germany received 37,531 asylum applications, that is 5,586 more applications than the UK had in the whole of 2014."},{"comment_id":"10155284668713268","commenter_b":"Who the fuck cares, did it have anything to do with this country?","commenter_a":"How long before he has a stroke a day realizes he is being uaed","post_message":"\"This is a direct attack on [Pres. Trump's] policies and her [Ivanka Trump's] name,\" Press Sec. Spicer said on Weds. regarding Nordstrom's decision to drop Ivanka Trump's fashion line. @webpagelink"},{"comment_id":"10153466611918635","commenter_b":"Amen","commenter_a":"Amen, aleluya","post_message":""},{"comment_id":"10155018976064170","commenter_b":"The most classless woman and family I have ever seen. Good riddance.","commenter_a":"This is also fake news. There is no sign like that. Bye Herman.","post_message":"I'm sure Michelle will find some hope in that nice house they're about to move into."},{"comment_id":"1515851598455693","commenter_b":"That's ok i love the 6 i have","commenter_a":"I REALLY HATE TATTOOS BUT THIS IS GOOD","post_message":"It's not just about the conversation — it's about providing tangible support and help too."},{"comment_id":"10153631215978984","commenter_b":"Please take the baby away and never should she get back any of the children. Also, make sure that she cannot have any more kids.","commenter_a":"What a shame...","post_message":"The cops got the call so they went to this pregnant woman's home... but once they got there, they were stunned at what they saw. This was not something they had been trained for... they will never forget this."}]
