[{"comment_id":"10153068105811316","commenter_b":"That had to have been written by a 12 year old republican. Lol.","commenter_a":"hes telling the truth most dont want to hear","post_message":"Rapper: Caitlyn Jenner & MSM Promotion of Poor Values A Rebuke To God - @webpagelink"},{"comment_id":"10153910519885695","commenter_b":"What a pig.","commenter_a":"He should be castrated .","post_message":"Jared Fogle's attorneys asked a judge for leniency, saying he is \"profoundly sorry.\""},{"comment_id":"1197755483636319","commenter_b":"oh look a trump impersonator ! If you don't agree with him your a PIG!! a LOSER a total Disgusting human beings!! We're going to make America grate and get my red hats from China yea it going to be grate! They both suck but I trust her with the nations safety and economic well being . He can't get it wrong! It's not like he can claim chapter 11 to get out of paying his bills? Right Einstein!! Lol","commenter_a":"Some People think being president is always being right! about everything you do or try to do! It's not that simple. Back seat driving is easy , but when your responsibility is keep America as safe as possible and the world. Some things will not always go right. You guys are the haters The Republican Party of No","post_message":"It's funny because it's true."},{"comment_id":"10153452535630399","commenter_b":"Your attempt at cleverness comes off as fairly moronic.","commenter_a":"Obama should go to China........he might love being with his fellow Commies so much he Might not want to come back....","post_message":"Scott Walker takes on...Chinese economics."},{"comment_id":"886212474747508","commenter_b":"she is a trashy shank","commenter_a":"This guy rips her a new one. Good for you.","post_message":"Michelle Obama has no class, and he sets the record straight!"},{"comment_id":"10154047857863855","commenter_b":"Fake, phony and fraudster. Being a lesbian gave her no special privilege to ripoff people","commenter_a":"Bet she didn't see that coming!?","post_message":"RIP Youree Harris."},{"comment_id":"256901098085552","commenter_b":"So don't f with me I am from Louisiana I'll give u he'll and make ur ass cry like a baby are u still running don't say shot to me pat I won't say shot to u u ever meet a woman that hunt a allerigator I don't think so I can't hunt any thing we woman from Louisiana that hunt and fish are strong woman we don't take shot for nothing .","commenter_a":"Same could be said of Obama and his executive pen, but I didn't hear you snowflakes complaining then.....so why now? Because your criminal didn't win?.....boohoo! Get on with life.....you didn't see us doing the crap that is going on now when Obama was president......God help us......for 8 years. Quit crying and get on with it. I think Trump is going to do some great things for this country. Things that should have been done a long time ago......even before Obama came to be. I am looking forward to a better America....go get em Trump!!","post_message":"AMEN! This one is a MUST READ."}]
