[{"comment_id":"919415154748007","commenter_b":"Really u sound SPECIAL!!! thanks for making the black race look retarded all by urself!!! Ur what the white man lives to have on his side.. Wake up my sister. Don't matter what shade we are we are all black","commenter_a":"stop f****** with them mixies and get a. SISTER","post_message":"\"Dark Skin Activist\" Slams Kendrick Lamar Over Light-Skinned Fianceé: “I Will Never Support Him”"},{"comment_id":"10155243309639411","commenter_b":"Good @username get all this white people off welfare!","commenter_a":"It's OK , white people it's only for a day. You guys don't have to come off welfare in massive numbers tomorrow to make sure the strawberries get picked!","post_message":"People in Indianapolis joined the nationwide “Day Without Immigrants” movement in an effort to show how critical they are to the U.S. economy and way of life."},{"comment_id":"1047910738660847","commenter_b":"Exactly who would this little girl call if a robber happened to storm into her place of employment and point a gun at her, another employee or patron? Who would she be begging to step in between herself and a threat? Who would be more than willing to lay down his life for her? The answer is the man she refused to serve. I'm glad she lost her job. I hope others learn from her foolish mistake.","commenter_a":"hahahah yes!","post_message":"An Alabama Taco Bell employee who refused to serve police officers has been fired."},{"comment_id":"10158362932045500","commenter_b":"Her water didn't break yet","commenter_a":"Her water did not break","post_message":"BABY WATCH (10am update): Still no baby giraffe yet! When do you think mom April will give birth at Animal Adventure Park? Don't miss anything: @webpagelink"},{"comment_id":"10153737001138812","commenter_b":"This lady is still working there??????????????","commenter_a":"why not go ask a Muslim cleric to marry them get married in a mosque","post_message":"Another gay Kentucky couple denied marriage license by controversial clerk: @webpagelink"},{"comment_id":"1705740913046354","commenter_b":"Bitch!","commenter_a":"Go whoop, go now.","post_message":"Oh my gosh, I can't believe Whoopi Goldberg said this. Cancel The View right now."},{"comment_id":"1146502822036413","commenter_b":"We can make the illegals pay taxes.","commenter_a":"He can just file bankruptcy when it's done being built.","post_message":"Constructing an impassable wall along the U.S.-Mexico border would be a tall order — even for master real estate developer and 2016 GOP presidential candidate Donald J. Trump."}]
