[{"comment_id":"10153725740586336","commenter_b":"Who Cares. He's a Conservative Rapist","commenter_a":"Keep him on the other side of the Trump Wall.","post_message":"Police say Paul Jackson and his older brother, Vance Roberts, kidnapped prostitutes, drove them to Roberts' home and held them captive for days."},{"comment_id":"1099350153419328","commenter_b":"Wtf😱 she's going to be a double hoe😜","commenter_a":"Madisan","post_message":"A YouTube star recently revealed that she was born with two vaginas. Check out the interview here:"},{"comment_id":"10154376323356509","commenter_b":"Screw this Stepford wife!","commenter_a":"I had expected @username to declare Hillary Clinton the winner of this State of the Union but to my surprise @username has decided to no longer boycot Bernie Sanders. Wolf Blitzer called him \"a new face\" and very underestimated by the general public. Yes Wolf, he is a new face on @username and he was underestimated by @username but not by the general public. We all saw this coming, you better explain why you didn't: ignorance or incompetence?","post_message":"5.) \"Many of our best corporate citizens are also our most creative.\" -- Barack Obama during his State of the Union or Nikki Haley during the GOP rebuttal? #SOTU"},{"comment_id":"10154739927446037","commenter_b":"Sorry, women ARE voting...lol","commenter_a":"Most pictures are worth a measly thousand words. This one's worth millions. I would never advocate voting for a woman just because she's a woman, but this suggests that might not be a bad idea.","post_message":""},{"comment_id":"980526942073728","commenter_b":"Don't forget Mexicans I'm white.. had four kids ,a lazy ass dead beat American wouldn't pay child support on ,I met a 22 year old Mexican illegal I was 29 ..4 kids this man married me raised my four kids we had two of our own so 6 kids to raise Got my first home got his papers fixed got a home in Mexico My soul mate best friend passed away at age 47 working his self to death for his kids so build your damn wall Trump., IF ...you get president there are good men from Mexico I had the best","commenter_a":"What gets me is if people don't like Hillary Clinton then why do you come to @username. Others don't want to hear from Donald Frump supporters.The man is nothing but a racist,bigot,moron, and an idiot.And that's just being nice! Bill Maher gave Mr. Frump the perfect name. Whiney Little Bitch because that's all he does.Hillary will take him down and win. Just my opinion.","post_message":"BOOM! And there you have it! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"850731841652961","commenter_b":"Another inbred rightwing BITCH! lmao.. Throw her to the lions! :) I wouldn't wipe my ass with the satanic black book of lies she learns from.. \"C-NT!","commenter_a":"One ugly MF !!!","post_message":"Her lawyer says it's not about bigotry. She says it's about her faith. But bigotry comes in many forms, and she's using her faith to justify it:"},{"comment_id":"10156120572270354","commenter_b":"She is a Dumb o crap","commenter_a":"The city of Baltimore has an idiot for a mayor. I wonder if he is a Democrat or a Republican?","post_message":"“This settlement...avoids costly and protracted litigation that would only make it more difficult for our city to heal and potentially cost taxpayers many millions more in damages,” said Baltimore Mayor Stephanie Rawlings-Blake."}]
