[{"comment_id":"539636529560260","commenter_b":"She should be in jail","commenter_a":"NO FU*K YOU liberal artist Abby Martin !","post_message":"Liberal artist slams Chris Kyle with this t-shirt, but that's not even the worst part. This is awful. He was a true patriot who protected our country. Let's show his family our support. Can we get 20,000 'LIKES' for Chris Kyle?"},{"comment_id":"10154272601268525","commenter_b":"How stupid are those girls...their on camera now...lol","commenter_a":"Shane Ornelas","post_message":"HULK HOGAN ROBBED: Not even the iconic wrestler's home is safe from holiday package thieves! STORY: fox10phoenix.com/entertainment/@username-story"},{"comment_id":"10152732788836028","commenter_b":"That sick","commenter_a":"Aww, that's awesome! :)","post_message":"Thomas Sawicki and his boyfriend Shawn Brier were the lucky couple chosen to share the first kiss off the ship as fast-attack submarine USS San Francisco reunited with its home port at Naval Base Point Loma Monday afternoon. Families lined the dock awaiting the arrival of husbands, sons, dads and brothers returning from a seven-month stint in the Western Pacific: @webpagelink"},{"comment_id":"571795269654273","commenter_b":"Leave America","commenter_a":"Move to Syria.","post_message":"Here you go, peeps! If you're stumped for ideas check the comment section... they have plenty! @webpagelink"},{"comment_id":"1788323888048645","commenter_b":"SouthernBox Blues But why are the prisons full? Getting rid of the illegal aliens from them would help. If the little jackasses need to be locked up, do it. Just like Sheriff Joe, put them in a tent.","commenter_a":"Its time for Chicago to clean house . From the dirty politicians all the way down to these street thugs .","post_message":"WATCH: 71-year-old man shot while watering lawn; new Chicago shooting sparks outrage: @webpagelink"},{"comment_id":"10153481340240575","commenter_b":"This should be a crime!!!!! Go to hell!!!","commenter_a":"This is a BLACK DEVIL HE NEEDS TO BE EXTERMINATED!!!!!","post_message":"The Gateway Pundit - Farrakhan Shouts “Allahu Akbar!” and “White People Deserve to Die” In Latest Sermon (Video)"},{"comment_id":"861020107291072","commenter_b":"So many F$&k wits out there. How can they be so cruel?","commenter_a":"What a atrocious father!","post_message":"Girl thrown off bridge by man believed to be her father."}]
