[{"comment_id":"986811718026353","commenter_b":"\"The kids will eat it up, if it's packaged properly Steal a sound and imitate\"","commenter_a":"And thats why i loved him 👊","post_message":"Nirvana's Kurt Cobain is known for being something of a legend in music, but that's not all. In fact, he said some pretty on-point things during his time, especially about rape, bigotry, racism, and feminism."},{"comment_id":"10153733743438606","commenter_b":"Human nature wants us to create Heaven on Earth where everything is perfect and explained (No disasters, illnesses, wars, and sadness). That's exactly WHY people are sad and sick and at war. They can't reconcile it. I have no clue why bad things happen. But I do have my faith in God. I wouldn't dismiss for a moment why you feel your way. I hope you won't dismiss mine. I just can't see Bill Nye explaining this to me? I sincerely hope you have a great day 🌺","commenter_a":"You figure he wouldn't have orphaned and separated them years ago in the first place then.","post_message":"INCREDIBLE STORY! Two orphaned sisters separated decades ago in Korea have been reunited after miraculously getting hired on the same floor of a Florida hospital ----> @webpagelink"},{"comment_id":"10154111404003132","commenter_b":"They have it bad because Americans won't allow sharia law be submit to cower to Islam . Imagine that we refuse to stupid as the EU had been . OMG we want Muslims to be tested exactly as any other religion here . The nerve of us to refuse to cower grovel to Illegal immigrants or Islam . Imagine that wanting all to assimilate to Our laws ways traditions under our flag only if it offends you LEAVE go to Saudis Iranians enjoy sharia laws","commenter_a":"I didn't read anything about her being molested or disrespected. Maybe she went to the wrong rally? And who the hell says that a muslim woman should be more respected than anyone else? I don't care that she came in peace. As long as she left in one piece. I am sick of these muslims acting that everyone hates them. Some of us are just tired of their fictitious victimizations. There are real people in this country that have been victimized. Lets focus on them, instead of some nut job that is staging a silent protest because she wants to be special.","post_message":"\"I was not afraid of these people, because I truly believe that the decent people would have stood up and not permitted that,\" she said."},{"comment_id":"10152952082057452","commenter_b":"Shes beautiful","commenter_a":"So precious!","post_message":"This video of a baby seeing her parents’ faces for the first time after getting glasses will melt your heart: @webpagelink"},{"comment_id":"492953910886489","commenter_b":"I don't feel sorry for her. She had the right to marry four times. Fuck that bitch hope they fine her into poverty and hope she gets her ass tossed by a big butch inmate","commenter_a":"just give her a different job already","post_message":"Are you angry at the anti-gay clerk? Us too. But we also pity her."},{"comment_id":"879699705417529","commenter_b":"NO !!!!!! MORE !!!!!! ENFORCE THE LAWS & SEND THE ILLEGALS ALREADY HERE BACK TO \" WHEREVER \" THEY BELONG !!!!! WE NEITHER WANT THEM HERE ,,,, NOR CAN WE AFFORD TO SUPPORT ALL THEY ARE GIVEN !!!!! HELP THE PEOPLE IN AMERICA ,,,,, NOT THE ILLEGALS !!!!!!","commenter_a":"So if we harbor a criminal we go to jail, but providing \"sanctuary\" is different, right? Pffffft. A rose is still a rose....","post_message":"(VIDEO) HILLARY CLINTON'S TWISTED APPROVAL OF SANCTUARY CITIES FOR ILLEGAL ALIENS Stop the invasion!"},{"comment_id":"649003498581759","commenter_b":"On a more humorous note.","commenter_a":"The republicans in congress have failed to do their job for 7 years ,but the stupid voters put them back.How do you explain this ?","post_message":"We can make major changes in Washington DC with our votes in November. Armed Democrats"}]
