[{"comment_id":"10153934644331336","commenter_b":"Immoral women?","commenter_a":"I wonder what would happen if sexes were reversed. Point is, the guy will be wrong no matter which side he is on.","post_message":"He pinched her, so she punched him... hard."},{"comment_id":"1393322447348037","commenter_b":"NEVER Hillary!","commenter_a":"Petulant child is what Cruz is. Anyone who still endorses Cruz endorses Hillary Clinton!","post_message":"Comparing the print version of Ted Cruz's RNC speech to the rendition that got him booed off stage really does prove it's all in the delivery."},{"comment_id":"10154054771666574","commenter_b":"Thank you Senator @username. Please stand up to this narcissistic demagogue who is the president. Please encourage your Republican colleagues to stand up to the POTUS and his white nationalist advisors.","commenter_a":"A Free Ukrainian and freedom for Chechnya, Dogestan, Alania, Ingushetio, North Osseha, and other ethic republic under Russian occupation.","post_message":"President Donald Trump’s call with Vladimir Putin is scheduled to take place amid widespread speculation that the White House is considering lifting sanctions against Russia. For the sake of America’s national security and that of our allies, I hope President Trump will put an end to this speculation and reject such a reckless course. If he does not, I will work with my colleagues to codify sanctions against Russia into law. In just the last three years under Vladimir Putin, Russia has invaded Ukraine, annexed Crimea, threatened NATO allies, and intervened militarily in Syria, leaving a trail of death, destruction, and broken promises in his wake. Russia’s war on Ukraine has killed over 10,000 Ukrainian soldiers and civilians. Russia supplied the weapons that shot down a commercial aircraft over Ukraine and killed 298 innocent people. Russia has conducted a massive military buildup along NATO’s eastern flank, conducted large-scale military exercises, ..."},{"comment_id":"10153619254387439","commenter_b":"You stupid son of a bitch. She will never do a day in jail. Dream on asshole.","commenter_a":"FBI didn't seize a fucking thing, they were voluntarily turned over to the FBI and justice department. Geller is a rotten crotched liar.","post_message":"// google_ad_client = \"ca-pub-@username\"; google_ad_slot = \"@username\"; google_ad_width = 336; google_ad_height = 280; // ]]> // // ]]> Hillary is such a tool for jihad and a knave to her lover pal Huma Abedin, I don t care how this destroyer gets her comeuppance, as long as she does. Like Capone and tax evasion charges. It was hardly the worst of what he did, but it got him put away. She should be sitting in prison for Benghazi, but if this is the best we can do, so be it. Although I hardly trust the DoJ. WASHINGTON As pressure builds on Hillary Clinton to explain her official use of personal email while serving as secretary of state, she faced new complications Tuesday. It was disclosed her top aides are being drawn into a burgeoning federal inquiry and that two emails on her private account have been classified as “Top Secret.” ..."},{"comment_id":"10154886210018984","commenter_b":"If you assholes would only enforce our freaking laws there would be no need for the wall!","commenter_a":"The US can do anything when it puts it's people to work. Understandably, a physical wall can not be built in certain areas but our very brilliant problem solvers will find solutions for that. OBAMA never wanted to secure the border. Trump will turn loose the ingenuity of AMERICANS & the job will be done.","post_message":"The Republican Party is not wasting ANY time. Right after Donald Trump defeated Hillary, the GOP let everyone know where it stands on the wall..."},{"comment_id":"10154472400523645","commenter_b":"Pisses me off as much as a person on death row getting a heart transplant. Only in California","commenter_a":"I thought convicts were entitled to three squares, dental, and health care, not wants. How could the state be legally required to pay for it? this operation had nothing to do with his health. Just because he believed he was a woman? Well how many of the inmates believe they are innocent? Shall we bow to their wants and beliefs?","post_message":"Shiloh Heavenly Quine - convicted of first-degree murder, kidnapping and robbery for ransom - had the surgery in San Francisco on Thursday. She will reportedly be moved to a women prison after leaving the hospital. The state was legally required to pay for the operation."},{"comment_id":"10153113901480329","commenter_b":"Maybe she cover her face too in case it incites men to rape her. #goodgrief","commenter_a":"Bahaha! Don't flatter yourself lady. You're no Kate Upton!","post_message":"A Christian blogger has caused a stir online after publishing a blog post about her decision to stop wearing yoga pants because they cause men to think “lustful thoughts”."}]
