[{"comment_id":"10154524451224885","commenter_b":"I will guess her assets will be liquidated to pay the girls back.","commenter_a":"Serial killer.... I called it the day it happened. I hope those little girls in Troy get a pay out from the insurance company for their mothers life insurance now!","post_message":"BREAKING: A prosecutor filed charges of first-degree murder and armed criminal action Tuesday against Pamela Hupp in last week's killing of Louis R. Gumpenberger at her home."},{"comment_id":"10153476732498132","commenter_b":"She can't sing or act....","commenter_a":"She's still hotter than Kim Kardshian and she has talent.","post_message":"She must be a magician with double-sided tape. #MetGala"},{"comment_id":"10157614671450293","commenter_b":"Time to take car keys. Hope this turns out well.","commenter_a":"He may of said screw it and is partying in the infield at dega . Lol . But serious note hope yall find him safe","post_message":"Have you seen this man? He was last seen driving to Coldwater, Ala. to see his son. CLICK to see if you recognize him, and please contact police if you have any information:"},{"comment_id":"10152983014636051","commenter_b":"Yes, she should have been suspended. The foul language is not acceptable to use in school or anywhere else.","commenter_a":"i see nothing wrong she answered them in her opinion and where are the profanities? teacher is wrong and so is the school","post_message":"School officials took one look at this 14-year-old girl's answers on her sex-ed quiz and immediately suspended her."},{"comment_id":"1115117555187217","commenter_b":"Jette de Vries","commenter_a":"Nathalie Baranke","post_message":"If you have a cat you should do this immediately. (Via JukinVideo )"},{"comment_id":"10153954425955329","commenter_b":"Hahahaha her get away!","commenter_a":"@username, Jane Archer, @username, @username, can you please pleeeease do this with Poppi, Ricky, Harlou and Max?!?!?! HILARIOUS!","post_message":"brb gonna go test my dog's loyalty"},{"comment_id":"10153946404822439","commenter_b":"They invited these people into their country. Their circus. Their monkeys. When their country implodes, we must absolutely seal our borders against European refugees. Let them stay home and fight or die. Euronate on them. We don't want their disease, here. We have enough of their kind already.","commenter_a":"Poor refugees, still weak from their flight to Sweden. Let's hope Gustavus Adolphus is not entirely dead yet.","post_message":""}]
