[{"comment_id":"1123835504398528","commenter_b":"Fuck that stupid ass","commenter_a":"You are a complete asshole if you think this is a political issue IS AN AMERICAN issue and every single one of us should have a problem with this!","post_message":"So if we want the truth, that makes us disloyal? Bullsh*t! --Andrew"},{"comment_id":"635476119976300","commenter_b":"And we are apparently buying her cigarettes for her, good for nothing jackass. Where are the FATHERS, let those suckers pay for their babies they fathered!","commenter_a":"Deport !","post_message":"This immigrant says she's never returning to her country... Because she loves getting free money. She needs to be deported, we want our tax money back. Do you agree this immigrant should be deported?"},{"comment_id":"10153811887041770","commenter_b":"I never liked Nancy until I saw her genuine love and grief for the loss of her Husband.","commenter_a":"Well honey you know everybody laughed at Ronald Reagan because he was a movie star not a reality star cuz they didn't have that back then but he was still a movie star and they all laughed at him but guess what he broke down the wall he made this country great he made us unified and we love him and we love Nancy for The Classy wonderful woman that she was. Can we actually say that about what's an office now?","post_message":"Ann Coulter: “Why couldn’t it be a more genteel, a more elegant person like Mitt Romney. But as soon as you think that to yourself, you realize that is a creature that doesn’t exist in nature. For the attacks that Trump has come under, you have to be a tacky reality-TV star.”"},{"comment_id":"1345625752137184","commenter_b":"Sooo true Scott","commenter_a":"No true born-again Christian can consciously vote for Hillary!","post_message":"Which way is North Carolina voting? As #Election Day gets underway, Jenna Lee is live from Raleigh, North Carolina, talking to voters. #50states"},{"comment_id":"10156282182225354","commenter_b":"Why are they even getting licenses??","commenter_a":"Lord, don't even let me go there, cause my head will explode............","post_message":"Illegal immigrant activists complain that Colorado's illegals aren't getting their driver's licenses issued quick enough. Seriously..."},{"comment_id":"10154403030526523","commenter_b":"@username your a pussy.","commenter_a":"TRUMP IS A FLAMING HOMO","post_message":"President-elect Donald Trump responds to a new poll from CNN/ORC which found that he has an approval rating of just 40% ahead of his Friday inauguration. @webpagelink"},{"comment_id":"960983097307632","commenter_b":"At the last supper, JESUS told the disiples that if they had own sword, to sell the cloak to by one. Peter was carrying in the garden. This old mam does not know the BIBLE.","commenter_a":"If you own a gun you can't be a believer??? God has not revealed that to me. Where in scripture did He reveal that to you your holiness???","post_message":"Can you believe what the Pope said about gun owners? I'm stunned: @webpagelink"}]
