[{"comment_id":"10153316136926438","commenter_b":"... and so what if polygamy is \"legalized\" (lots of states already look the other way anyway) who would it hurt ?","commenter_a":"Yay polygamy.","post_message":"This was his best argument???"},{"comment_id":"10154942733646873","commenter_b":"Sally Yates we need more of you. Well done.","commenter_a":"We have a dictator as presidentDon't agree with him ,you are fired","post_message":"Sally Yates had said the Justice Department would not defend in court Trump's immigration order."},{"comment_id":"10152995708842217","commenter_b":"Really perhaps one glass too many some would say Suspicious.....","commenter_a":"Aww 😢💔 poor Cilla..","post_message":"She was sunbathing at her Spanish home when she she stood up, lost her balance and fell"},{"comment_id":"555507287934896","commenter_b":"I'll flip it back and not shop there until the board fires her","commenter_a":"Time to switch to Costco.","post_message":"What do you think of this?"},{"comment_id":"1173449382693296","commenter_b":"ANTI CHRIST HILLARY CLINTON IS BEING PROTECTED BY UN AND OBAMA! ISIS IS THEIR CHILD OF HATRED TOWARDS THE WORLD AND IS GROWING BY THE MIN THEY ARMED ISIS!","commenter_a":"Hmmm","post_message":"Should the US pull out of the United Nations over this?"},{"comment_id":"1676227239104065","commenter_b":"What a pig","commenter_a":"Suck it buttercup had your crap 8 years give us 4","post_message":"How classless can you get?"},{"comment_id":"10153610824739087","commenter_b":"So, I guess u rather lying, murderous Hillary to get the nomination.","commenter_a":"They don't have to support the nominee anymore than we have to! If Old butthole lips Trump gets the nomination you can bet I'll write my candidate in!","post_message":"“We have candidates who believe that they’re on the pathway to grabbing all the delegates for the nomination. Whether it’s posturing or whatever, I expect that they’ll eventually support the nominee,\" said RNC chairman Reince Priebus. \"We’ve always been able to come together before.”"}]
