[{"comment_id":"10152987263776130","commenter_b":"@axelnieto and @hugoaguilar. I never said people in Latin American countries aren't happy. I also never said that there is absolute no wealth or opportunity. I agree with you that it's not easy (which is what I was trying to make a point of to begin with) but it is there.","commenter_a":"They don't make work, wealth, and success important because their country doesn't give them the opportunity for that. Duh huffington post.","post_message":"\"Instead of making work, success and wealth the most important things in life, Latin Americans typically have family and community firmly at the top of their priority list.\""},{"comment_id":"10154609834091336","commenter_b":"I wonder where the laptop and hard drive went?","commenter_a":"Was there ever a doubt Hillary could be trusted. She can't even tell the truth about being sick. She's totally unethical and should never be allowed anywhere near the white house","post_message":"\"Mrs. Clinton delegated her legal security obligations to others. Those obligations to protect official Americans overseas, and especially in Benghazi.\" Gregory Hicks, the former Deputy Chief of Mission for Libya in Hillary Clinton's State Department, said he believes she cannot be trusted with our national security."},{"comment_id":"1122771727815880","commenter_b":"I wouldn't want that pussy fighting next to me.","commenter_a":"Draft Dodging Coward","post_message":"Donald Trump is just another Republican chicken-hawk. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"871509956275393","commenter_b":"Fuck u.bitch dani","commenter_a":"Whoopl.is.a.racist bitch","post_message":"They really destroy the argument for keeping the racist flag around."},{"comment_id":"10154043419071336","commenter_b":"First, voter fraud exists. People have gone to jail for it. And for every 1 person caught, you know there are more who aren't caught. And yes, foreign nationals who broke our laws to come here ARE less trustworthy, THEY BROKE OUR LAWS. We have enough home grown US haters and uninformed voters, we don't need to add people here illegally to the mix. They have no right to vote. If we can't ensure legal elections we are not protecting our sovereignty. Add that to unsecured borders and there is no USA any more. Try going to Mexico (or any country) illegally, see if they welcome you and let you chose their leaders. We are not bad people for wanting the same protections in our country that other countries offer their citizens.","commenter_a":"You mean undocumented democratic voters, right? CA has now given the right to vote to illegals. Supposedly in local races only. Who really believes that BS? What safeguards are in place to prevent them from voting in national races? None. And allowing them to vote in the first place is against the constitution. Just like illegals holding office is against the constitution. I shudder to think that CA's PC crap will pour into other states.","post_message":"\"We believe that this new law increases safety on California roads by putting licensed drivers behind the steering wheel,\" a spokesman for the California Department of Motor Vehicles said."},{"comment_id":"961399343937315","commenter_b":"Polls mean nothing, Remember Reagan! Go Trump!","commenter_a":"Are you sure it is Cruz and all the lies he told and putting the blame on others like Obama well I am not there is others was ways to do it like the Gop and the liberal party L","post_message":"\"Ted Cruz SEVERELY CUTS Trump's national lead from 18% to 3% in ONE MONTH!\" Let's go, #CruzCrew!"},{"comment_id":"10153443453313145","commenter_b":"It's not the agents it's the folks who can't seem to follow simple instructions or get grumpy when asked to do what everyone else has to.","commenter_a":"I fly weekly and it is always slow. Putting the tourist with five kids in pre check just slows it down even more. Nothing at OIA is for the business traveler only the tourists. Wish I had a choice of airports","post_message":"A study of the speed with which TSA agents get passengers through security lines at Orlando International Airport shows that times aren't what airport officials want to see. So how have you're experiences at OIA been?"}]
