[{"comment_id":"10153491983334087","commenter_b":"Look , she the cuase of all wars in Middle East , Voted for war in Irag ,war in Libya, war in Syria. She removed notorious terrorist group AKA \" MOJAHIDEEN \" out of terrorist list , so they can go to Syria . She is Republican","commenter_a":"Elizabeth Warren Sinks Clinton's Hopes for Endorsement @webpagelink","post_message":"“The difference between [Hillary Clinton] and Sanders is that she didn’t wait until the campaign to champion gun violence prevention,” said Dan Gross, president of the Brady Campaign to Prevent Gun Violence, which is endorsing Clinton in the presidential race."},{"comment_id":"10158494825160725","commenter_b":"Why do you care what others do????? It's a saturday. Most people get that day off . dRump loves the bossy bitches. Go grab a pussy","commenter_a":"Get a job/life.You have way to much time on ur hands.","post_message":"Thousands of demonstrators are expected to take to city streets this weekend for the Women's March on Chicago, one day after Donald Trump's inauguration."},{"comment_id":"1077408458966678","commenter_b":"Malyk Bonnet, how fortunate for that young woman that you trusted your indtincts and took some very brave action. You ARE a HERO!!!","commenter_a":"Benjamin Fournelle Sylvie Bonin","post_message":"This teen had a hunch, so he hopped on a bus to a different city. He might have saved a life. - Robbie Couch"},{"comment_id":"1262934473727561","commenter_b":"There is no 'weaker' version of the species. Both genders are the same species, just with physical differences.","commenter_a":"12,000 yrs. ago and they're still Lions 😭😭","post_message":"These images are just extraordinary. The cubs were just a few weeks old when they died."},{"comment_id":"10154145784326130","commenter_b":"Woman should act like woman? Barf, if a woman does not shave her legs she is still a woman and there is nothing wrong with that.","commenter_a":"This is kinda stupid I'm sorry. And why did she make her legs so goddamn hairy in the comics? I'm sure that's how they look in real life. Glad you found someone who wants to date someone with legs as hairy as his lol","post_message":"Nothing weirder than true love."},{"comment_id":"10154388991666162","commenter_b":"Stfu!","commenter_a":"Happy birthday you druggie idol you","post_message":"Prince was born on this day in 1958. He would have turned 58 today... @webpagelink"},{"comment_id":"481872515336662","commenter_b":"She's doing a great job! Leave her alone! You look half as good as she does, you wouldn't have a problem!","commenter_a":"She is great and a real threat to the liberals and they will go after her.","post_message":"Liberals are after Megyn Kelly after she falls victim to wardrobe malfunction. She is in trouble, we need to show her we have her back. Can we get 20,000 'LIKES' for Megyn Kelly?"}]
