[{"comment_id":"10153763759623812","commenter_b":"Girl, shut up.","commenter_a":"Relax dad, she's not a teen, stupid and sad comment - life is about friends, why confuse a happy loving kid, who loves boys too as friends...","post_message":"This 2-year-old girl is crushed to hear that she can’t have a boyfriend, insists to her dad that she has someone special in her life. Her conviction is intense! @webpagelink"},{"comment_id":"1136052583084752","commenter_b":"tainted bully!!","commenter_a":"hIS mOUTH RUNNETH OVAH!!! E","post_message":"Curt Schilling, an unemployed baseball commentator who moonlights as a volunteer political commentator on social media, has a hot take on President Obama: @webpagelink"},{"comment_id":"10154927875454174","commenter_b":"Build that wall","commenter_a":"Protesters now these days are who are dividing the races","post_message":"Protests are happening in cities across the U.S. once again while President Trump is reacting to the judicial order stopping his policy @webpagelink"},{"comment_id":"10154185935155779","commenter_b":"Minus the \"away\"","commenter_a":"Easy. U2. 9/11-victims' names scrolling through 'Where the Streets Have No Name'....that was not a performance, it was an event...every type of emotion, right on stage.","post_message":"There is no gig in music like the Super Bowl halftime show. You have 12 minutes to justify your legend. And with the Big Game set for this Sunday, what better time to rank the halftime shows from worst to best."},{"comment_id":"10154558927621323","commenter_b":"Sex is a biological need. If I'm in a relationship, I am entitled to sex. If she won't provide, I can find someone who will. Using sex as a weapon against men is ABUSE.","commenter_a":"Problem is there are too many uptight women out there. Articles like this don't help either. 'Intimacy'. Words like that make sex sound like some mythical state of enlightenment that we are trying to achieve. When the fact is its just some good old hard core fucking. Get all the mind fuck thoughts out your head and get sucking or licking and you'll soon get into it. We've had hard core porn for years now showing us how to get down and dirty with it so stop making a big deal about it. And if all else fails there's prostitutes who can do the job for you so just sub contract it out and let your partner get some for a change instead of walking round like a sex starved idiot.","post_message":"\"Drink is not the answer.\""},{"comment_id":"1187655654624295","commenter_b":"You couldn't even please your husband, what makes you think you can please us? #NeverHillary","commenter_a":"Nice","post_message":"In the presence of practical, tactical brilliance at Hamilton: An American Musical."},{"comment_id":"539030936307389","commenter_b":"@username you're not paying for my uterus. Lol.","commenter_a":"So, Kaine, a Roman Catholic, has a moral conflict with his faith when it comes to the death penalty (killing criminals) but no qualm whatsoever promoting the killing of unborn babies?","post_message":"Mike Pence is a good man who had a strong performance tonight. This evening Tim Kaine demonstrated that he would serve as just another enabler of the failed Obama-Clinton policies that have hurt our economy, taken away our freedom, and weakened our security. The choice for Americans is clear. We cannot afford a third term of President Obama, and Clinton-Kaine would only continue the disastrous policies of the last eight years."}]
