[{"comment_id":"10153629049609255","commenter_b":"Hey JEB. Your mom called: @webpagelink","commenter_a":"Pay no attention--he's speaking with his head---UP HIS ASS---AS USUAL !!","post_message":"Jeb! Bush, noted women's health expert."},{"comment_id":"931654693541670","commenter_b":"It's not just barbaric, it is one more tool of the rich used to keep the not-rich \"in their place\".","commenter_a":"I guess when you have universal medical coverage you don't realize what a nightmare our system is.","post_message":"The headline really begs the question, who the hell would ever want to visit the United States knowing they could be bankrupted if they should need medical care while they are here?/"},{"comment_id":"422994894562852","commenter_b":"All but trump need to drop out and quit wasting money! Hell give it to the vets and homeless! Trump!!!!!!!!","commenter_a":"Mitt Romney will hurt Marco Rubio campain, please do let him","post_message":"Help or hurt?"},{"comment_id":"547874932072371","commenter_b":"This bitch needs to get ready for jail!!!","commenter_a":"I think someone is throwing. Dinner !!","post_message":"WASH POST PAGE ONE SUNDAY: Hillary begins laying plans for White House agenda..."},{"comment_id":"10153945606794060","commenter_b":"Shut up!","commenter_a":"Turkey is the gateway for Islamists to enter Europe and the birthplace of fascism.","post_message":"For the Turkish nation Turkishness goes beyond nationality. But some citizens consider themselves more Turkish than others"},{"comment_id":"512454232283082","commenter_b":"To the person who said go back to Africa.... Pack your bags too & head back to Europe! Cuz white ppl ain't native to this land either. Dummy!","commenter_a":"Not worthy of my ear wax!","post_message":"Hip-hop legend Q-Tip is here talking about race and policing in America. Leave your questions in the comments."},{"comment_id":"10154331117659411","commenter_b":"News Flash: You've probably used the bathroom with a Trans person and not even known it. You know what Gender Neutral bathrooms are good for? A dad being able to use a changing table because those things are all to rare in the men's bathroom. Gender Neutral bathrooms make sense and honestly if you're so worried about your kids then go to the bathroom with them. Oh wait! Women can't go in men's bathrooms with their sons so their sons have to go alone or go into a women's bathroom just to piss.","commenter_a":"He wasn't even transgender. Criminals will break laws no matter what and being trans is not a mental illness!","post_message":"The girl mother, who was in the adjacent stall, heard her daughter screams and rescued her, while restaurant patrons held the suspect until police arrived."}]
