[{"comment_id":"881610245305235","commenter_b":"She is skanky.","commenter_a":"Megyn Kelly is a waste of human potential. A bright and flashy exterior but of little inner substance.","post_message":""},{"comment_id":"10153374154140329","commenter_b":"Karmas a bitch if you're an asshole","commenter_a":"People do spit in the food. I did it myself at McD's way the hell back when. Only when someone I really hated from school came through the line though. Nice big hock in their drink. Mmm...good times.","post_message":"\"We have all tried, and failed, to make a burger that looks like they do in the ad.\""},{"comment_id":"10152886398966378","commenter_b":"She makes me sick!!!!! And look at her with the big smile on her face,I'd like to smack the sh-- out of her!!!!! Loose your license!!!!","commenter_a":"Put an arrow through her head!","post_message":"NEW DEVELOPMENT: The case of a veterinarian fired over a Facebook post of a cat with an arrow through its head is heading to the DA for charges."},{"comment_id":"10152965778679641","commenter_b":"Nigeria should not only recall her ambassador but,should ask all indonesians to leave within 7days. Including \"INDOMIE NOODLES\" A Nigerians should stop patrpnizing INDOMIE NOODLES and anything associated with Indonesia","commenter_a":"I guess you better think twice before messing with illegal drugs in Indonesia.","post_message":"Indonesia executes six people, including five foreign nationals, by firing squad; Brazil and the Netherlands recall their ambassadors in response. @webpagelink"},{"comment_id":"10153520680806077","commenter_b":"Marine's can be so cocky ugh","commenter_a":"Some people are so trigger happy, its ridiculous and disturbing.","post_message":"Jesse Nelson's 32-year-old brother Christopher was killed after he tried to break into a house in Denver. \"Dying like this, it's not worth it,\" Nelson said."},{"comment_id":"900210363349638","commenter_b":"Yep, definitely my twin lol","commenter_a":"@username this you lol had to double take lol","post_message":"“There has never been anything like this seen in a fish’s gills before.\""},{"comment_id":"10154297442132098","commenter_b":"Wow, that's crazy","commenter_a":"Mie Mie the mystery is solved","post_message":"CONDO FIRE: A massive fire broke out a Concord condominium this afternoon. Story: @webpagelink"}]
