[{"comment_id":"10153723682667144","commenter_b":"It makes perfect sense to the Grand Ol' Party. Women should just kept their legs shut. Duh.","commenter_a":"Geeze, who would have guessed that access to birth control would result in lower pregnancy rates.","post_message":"An all-time low!"},{"comment_id":"10153640608237217","commenter_b":"All rights should be removed from these benefit shoppers. Refugees have an easy passage, it is only benefit shoppers that get into a boat. Look at the streets of Germany and Sweden now. Full of parasites loafing around with no intention of getting a job. The come for a free ride and have no intention of contributing.","commenter_a":"Almost all of the migrants in the Mediterranean are coming from Sub-Saharan Africa, who have no excuse to join Europe. It's been highlighted that most refugees from Libya (in civil war) have travelled to Egypt or Tunisia, instead of Europe. Even worse, they're just doing it for economic benefit (trying to get deep into Europe eg. Germany etc)","post_message":"The deaths are the result of three shipwrecks off the Libyan coast, UNHCR, the UN Refugee Agency says."},{"comment_id":"10152746962915950","commenter_b":"We get your point. She is NOT a man. Therefore she must be a Woman. Congratulations to her.","commenter_a":"She's not a female pilot, she's a Marine Corp Aviator! Semper Fi!","post_message":"Meet the first female pilot in the Navy's Blue Angels' 69-year history, Marine Corps Capt. Katie Higgins: @webpagelink"},{"comment_id":"10153656654198598","commenter_b":"I guess Margaret Sanger and her biggest admirer, Hillary, are accomplishing their evil goals!","commenter_a":"Whoa! That is alarming.","post_message":"More Black Babies in New York City are Aborted Than Born Alive"},{"comment_id":"10153620531441157","commenter_b":"Their just upset because she's not Hispanic!","commenter_a":"terriorist at its finest","post_message":"Islamic State claimed responsibility."},{"comment_id":"1346170432096021","commenter_b":"@username What makes you think it's civilized? Is it the fact that mankind is about to lose it head (literally) to religious beliefs by people that still throw stones and rape like cavemen! I see your education come from ''acadamia\"! Which is also still in the dark ages!","commenter_a":"@username Nutt, a researcher at Imperial College, had to crowdfund this LSD study. He calls LSD research \"the worst censorship of science there has ever been.\" Read more: @webpagelink","post_message":"For the first time ever, scientists scanned a brain on LSD using modern technology. What they saw was a more \"unified brain.\""},{"comment_id":"10153581092769087","commenter_b":"give us a number, @username. How many Americans should be murdered, raped, robbed or maimed by asshole criminals who should not even be here in the first place? Here are some crimes committed against Americans by Illegal ALIENS The Sanctuary city of San Francisco protected the previously convicted illegal alien gang member charged in the murder of Michael Bologna, 20, his brother Matthew, 16, and his father Anthony, 48 @webpagelink Illegal alien stabs to death 24 year old college student Lauren Bump @webpagelink Illegal alien charged with murder for vicious stabbing death of Kathleen Byham in a Wal-Mart parking lot @webpagelink Twice deported illegal alien charged with murder of Sheriff's Deputy Josie Fox, 37 @webpagelink Mary Nagle - was raped and murdered by illegal alien who then uses her cell phone to brag about crime to her friends and family @webpagelink Illegal Alien Kidnaps, Rapes, and Buries Alive an 8 ...","commenter_a":"\"I have been thinking a lot about Donald Trump, people say that he doesn't have a platform, that he just wants to make America great again. I have something to say about that, Donald Trump is not telling you his plan, he's giving you an outline. Why? Every time that he has brought something to the table, the other candidates take it and run. Such as, immigration, \"the wall\" and other issues. I can guarantee you that he won't give you his full plans in detail until he is standing at the podium, next to one of the Democrats. THAT is when he will reveal everything. He doesn't need to do that now. Donald Trump is a visionary. He doesn't go into business, without a strategy, and a form of negotiation already set. This man is prepared in business and will be fully prepared when the time is right, in ...","post_message":"Republican front-runner Donald J. Trump leads his rivals by double digits in Michigan on the eve of the primary, according to a new poll."}]
