[{"comment_id":"10154999301374411","commenter_b":"@username Fck off white trash","commenter_a":"Good. Cheats shouldn't prosper.","post_message":""},{"comment_id":"10154141343121336","commenter_b":"Trump won every state TONIGHT and barely lost Ohio.. why is it even still a question of who WE THE PEOPLE want and NEED to get behind?? Wake up! #NoHillary","commenter_a":"Trump is a buffoon. Hillary will bury him in a landslide. We must nominate a person who could win in November...a ticket like Kasich/Rubio, Kasich/Cruz, or Kasich/Fiorina.","post_message":"“Here’s our vision for America: It’s an America with a brighter future. It’s an America with greater opportunity for our kids… It’s an American with more liberty and more safety and more security. It is America that is greater tomorrow than it is today and than it was yesterday.” – Ted Cruz"},{"comment_id":"487710868083187","commenter_b":"Shut up.","commenter_a":"Supporting Bernie is supporting a blow FOR the middle class.","post_message":"It's a mistake to treat the \"black vote\" as a monolith."},{"comment_id":"10154151758449087","commenter_b":"@username Oh, please. Where are the arrests, the charges, the trials? Where are they? When did they happen? Where are the files? The proof? And here's the thing: Bill Clinton is NOT running for president. Whatever did or did not happen in the past is a \"he said, she said\" situation at this point. Or really a \"she said\" situation, and sadly, a LOT of women go after powerful men, married men, etc., and then cry \"rape\" when they don't get what they want. And I say that as a woman who would f**king kill a man who raped me. And once again, Bill Clinton is NOT running for POTUS. Donald Trump is a low-class disgusting creature who should NOT represent this great nation on the world stage.","commenter_a":"Let me know when Trump does something as bad as LEAVE 4 AMERICANS TO DIE..then you will hear my outrage..but you won't hear it over some locker room crap that Trump said.. Toughen up cupcakes..","post_message":"#BREAKING: Mike Pence was reportedly \"beside himself\" after hearing Trump's obscene remarks about women, and Pence's wife was \"furious.\""},{"comment_id":"10152762362423645","commenter_b":"smh...","commenter_a":"Marlo","post_message":"Wow. That must have been a strange night. Kurt Busch testifies that his ex-girlfriend is a 'trained assassin' who returned from a mission in blood-splattered gown."},{"comment_id":"1121791217896305","commenter_b":"Go back to school. Its not just to slow things down so you can understand!!","commenter_a":"\"We will reject bigotry and hatred and oppression' IM DONE LOL also you forgot a comma","post_message":"This is my pledge to the American people: as your President I will be your greatest champion. I will fight to ensure that every American is treated equally, protected equally, and honored equally. We will reject bigotry and hatred and oppression in all its forms, and seek a new future built on our common culture and values as one American people. -Donald J. Trump"},{"comment_id":"10155465475828797","commenter_b":"The president of Mexico is worried that if the drugs stop coming into the US , he will lose lots of money! Plus if all the Mexican criminals are send back , Mexico will be in more havoc !","commenter_a":"We The united states of America want President Trump to build a Border Wall just like Mexico! Also I would like to see the same Mexican LAWS on immigrants coming into their country, the same Mexican Law's in United States","post_message":"WATCH LIVE: Sec. of State Rex Tillerson and DHS Sec. John Kelly hold a joint press conference Thursday in Mexico City after meeting with Mexican officials, including President Enrique Peña Nieto."}]
