[{"comment_id":"1129314157104004","commenter_b":"WAKE UP PEOPLE PLEASE","commenter_a":"I did hit like on purpose it was an accident.","post_message":"**Terrorist attack on US Soil! This just in!**"},{"comment_id":"10154603481037994","commenter_b":"How can you kid nap your own kids is as stupid as how can your rape your own wife","commenter_a":"That's messed up. I wish I knew more but she shouldn't have to go to jail. She's a mom and those are her kids. She shouldn't have done what she did but at the end of the day those are her kids too.","post_message":"The mother was scheduled to return the two little girls to their father -- but never came back."},{"comment_id":"1146865702064592","commenter_b":"OMG, Catherine. Did you really say that? go wash your brain out with soap.","commenter_a":"Hillarys people Bribed the FBI to changed subpoena documents and change it from classified to a lower classification . If they can do something so illegal and get away with it. Think how the government can come after ANYONE! the Media owned by global elitist, Hillary is their puppet.","post_message":"Image from Meme GOP"},{"comment_id":"591571124359879","commenter_b":"@username : Educate yourself on the economy No wall it would cost over 530 billion in trade between US and Mexico costing over a million lost jobs in US alone and cause more than 3 states to go bankrupt. You may get a new fortified entry program but no wall.","commenter_a":"Trump failure to get Mexico to back down makes him look like the man who can't makes deals even with friends instead He was laid out and embarrassed by President Nieto of Mexico right from the beginning when they talked about the wall and was told Nexico would not pay for the wall , Nieto put Trump in his place so bad that Trump said they did not talk about payment of the wall . Trump was so embarrassed that on his flight back to US he changed his speech for the Arizona rally . This is a sign of a Man who can't control his emotions and would and could lead us into a Nuclear War .","post_message":"Government access and favors will no longer be for sale, and important email records will no longer be deleted and digitally altered! -DJT"},{"comment_id":"396121180569763","commenter_b":"Yes she definitely deserves to lose her license bigoted bitch","commenter_a":"Not only doctor in the world......find a new one...wouldn't want that dr touching my kid.","post_message":"Does the Hippocratic Oath allow for doctors to make this kind of choice?"},{"comment_id":"10153140940574205","commenter_b":"Perfection!","commenter_a":"Lol... Reminds me of the Mandelbaums on Seinfeld. \"You think you're better than me?\"","post_message":"In an effort to show how tough they are, Vladimir Putin and Dmitri Medvedev have released an exercise video."},{"comment_id":"10153968888907894","commenter_b":"I am with you Tee. These woman don't have any sense, you better get with a man with money. Get your own money as well.","commenter_a":"All these females calling her a gold digger but running around single as fuck with some random broke niggas kids they ain't even with....lmao...ladies it's wise to get with a man that can provide and keep yall asses out the welfare office and from working dead end jobs so you can actually raise your kids. ...but yall been taught it's proper and prideful to struggle with a dude that can't even purchase you a house let alone afford school uniforms for public school 😂😂😂😂","post_message":"60-Year-Old Mel Gibson and His 26-Year-Old Girlfriend Are Expecting"}]
