[{"comment_id":"1341519315888255","commenter_b":"Nice fireplace!","commenter_a":"#TurnOnGreenLightGreenShirt","post_message":"I'm live in my third Fireside Chat to talk about #NoDAPL and other pressing issues important to the 99%."},{"comment_id":"10154953325678984","commenter_b":"John, trump just said in his speech last night we have to unify. How can we when you make stupid statements like that!!","commenter_a":"President Trump should invite the Haitian Leaders, absolutely. And as a gift to them, hand over the Clinton's to them to face justice there.","post_message":"Obama probably isn't going to like this..."},{"comment_id":"1211550438923490","commenter_b":"Hope they kicked her muslim loving ass!","commenter_a":"It's all about lying and money....HO B. Are they peace loving people haha.!!!!","post_message":"In Indiana, a Muslim woman is making news after she thought the rules didn't apply to her. She demanded special treatment from an establishment and got something very, very different... what this manager gave her instead is going viral, and not everyone is in agreement with it."},{"comment_id":"10157992746740594","commenter_b":"@username if I'm going to make my mother get up in the middle of the night and travel four states to feed me she better be bringing more than a hot pocket.","commenter_a":"This is great, this is just what you liberal snowflakes need to cope with reality. It's nice that Google is providing portable \"safe-spaces\" for tomorrow's Captains of State Dependency.","post_message":"Turn photos of Donald Trump into adorable kittens with this Chrome extension."},{"comment_id":"10154273647523812","commenter_b":"Hell no!!!!","commenter_a":"@username so no beach this weekend","post_message":"Aerial video shows large school of sharks seen in Fort Lauderdale, Florida."},{"comment_id":"1098705460221855","commenter_b":"@username, you are for Hillary because she is all for bringing others like you here. When you come here, what did you get given to you???? I know you didn't come here with your own money, food, clothing, transportation, etcetera.... It's one thing when people came to this country because they had the hunger for the \"American dream.\" All of the immigrants coming into our country NOW, are money grubbing leaches. They don't respect our values, our flag, and don't care to make this country better.... Just to suck off uncle Sam's teet. I don't WANT to buy health insurance!!!!! WHY should I have to??!! What kind of freedom is THAT???? I think YOU need to do YOUR research!!","commenter_a":"We are taught at schools of what @username did for all American,especially The affordable Health cards. I believe that she will make tramandous change if elected. TRUMP is all set to be Casino manager. That's all.","post_message":"This is really happening—Donald Trump just officially accepted the Republican nomination for president. Share this if you agree: We can't let him anywhere near the White House."},{"comment_id":"10154382279344497","commenter_b":"Aye. Fuck bitches, make money.","commenter_a":"Single man enjoying free milk, basking in savings after not buying cows.","post_message":"Via ClickHole:"}]
