[{"comment_id":"1828017460760580","commenter_b":"Care less what Martha Stewart has to say period!","commenter_a":"I like Martha Stewart a lot.","post_message":"We're here live with Martha Stewart, who's ready to answer all your veggie-related questions! Ask away in the comments."},{"comment_id":"961966360614126","commenter_b":"I bet Walt Disney rolled over in his grave whenever he's found out what you become you are such a vulgar I can't even use the time lady because ladies do not act like that but I will come help you pack free of charge I don't care what you have and how many boxes how many trucks I will help free of charge just to get you out. And thank you for the promise","commenter_a":"Good","post_message":"THEY'RE OUTTA HERE!"},{"comment_id":"10154019054861509","commenter_b":"White Americans do not recognize anyone else","commenter_a":"American??? Wow, she is so ignorant. Many American citizens came here from other countries speaking another language. English, the American version, is what has been spoken here for many generations. However, we now have many citizens who speak Spanish, Russian, Mandarin, Vietnamese...We are a country of many. Let's stop the ignorance and the Palins of the world.","post_message":"Sarah Palin praised Jeb Bush on speaking Spanish, but said “let's speak American\" to unify the country: @webpagelink"},{"comment_id":"10154254891359411","commenter_b":"@username I'll piss on your sphincter","commenter_a":"I love anal sex. Anal orgasms are stronger than vaginal ones. Personally, I waited til I had kids to do it coz I didnt want to stretch out both holes, but if teens want to prematurely stretch out both holes simultaneously, that's their business.","post_message":""},{"comment_id":"10154964534141337","commenter_b":"@username so then why is everyone so butthurt about other immigrants coming in? What's done is done, they got in, the end","commenter_a":"An awful lot of illegally immigrated Europeans happy to see him deported on this page. Maybe you Mofos would be better off learning your native tongue, I know us Natives would love to see your cave dwelling, disease spreading barbarians back to where you emigrated from.","post_message":"Documenting the heartbreaking and unbelievable deportation of South Korean man Adam Crapser"},{"comment_id":"921257648004031","commenter_b":"Nope, Michelle can get naked with any woman she chooses. I'm okay with that. Hillary too. Lesbian love! Let's all celebrate that.","commenter_a":"I couldn't care less about the nude photos. That has no effect on my disdain towards Trump. I DO care about the fact that conservatives are fine with this, but would have a complete meltdown if this were Michelle Obama and call her every dirty name in the book.","post_message":"What kind of example would First Lady Melania provide for America's children? But let's hear more Fox \"News\" outrage about Michelle Obama's sleeveless dress PLEASE... sigh... Full photo here: @webpagelink"},{"comment_id":"901774593215623","commenter_b":"About time we had larger ladies ,","commenter_a":"looks interesting !!!","post_message":"'I feel sexy and confident'"}]
