[{"comment_id":"10154147730689071","commenter_b":"Lol you need help lady","commenter_a":"Good job trump. Keep up the good work. We need to be making more friends. Even if the liberals wanted to go to war with Russia led by Hillary. It's time for a new chapter in diplomacy.","post_message":"\"To be honest with you, the waters here seem like a little bit of a tempest in a teapot. I mean, it's striking to me that President Obama would reach out to a murdering dictator in Cuba and be hailed as a hero...\""},{"comment_id":"10153888153653352","commenter_b":"You said it all...Thank you!","commenter_a":"I feel she should have been fired.... possibly fined. Holding her in jail until she changes her mind is a waste of tax dollars and time.... yes this woman stood up for what she believed but she still had a job to do .... not only did she refuse to issue same sex marriage license but she didn't allow the people under her who were willing to issue them either.... that is wrong..... this woman used her title and athority and held an entire government staff to her religious beliefs ... she didn't have to issue them she could have let someone else do that and still be faithful to God's law.... this country was built on freedom of religion. That means no law can be withheld or upheld based on religious beliefs.... she made an oath to follow the laws of the US , as soon as the laws ...","post_message":"Defiant Court Clerk, Kim Davis, Will Be Held In Jail Until She Agrees To Issue Same-Sex Marriage Licenses! CHRISTIANS WHAT IS YOUR REACTION?"},{"comment_id":"10153678136737217","commenter_b":"You are falling into the hands of the extreme right wing portraying themselves as, \"for the working class.\"","commenter_a":"Voting out because the EU is corrupt. This country full and we should trade with the world. And I don't wont to be under a dictatorship . If it was not for the dedication of the doctors and nurses the NHS cant cope with demand .schools need a teacher. And two teaching assistants .not enough. Housing. And foreign criminals cant besent back","post_message":"What does Brexit mean? And who will be able to vote? Nine days before #EUref, here's a guide about some of the key questions."},{"comment_id":"10152931717926336","commenter_b":"They have no \"rights\" here in the US -- if they are here illegally they should be deported and if caught coming back into our country they should be put in a hard labor camp for 5 or more years --","commenter_a":"Thats all we need , one more moron!!","post_message":"U.S. Attorney General nominee Loretta Lynch said she believed in an illegal immigrant's \"right\" and \"obligation to work\" during Wednesday’s confirmation hearing."},{"comment_id":"1133219213367232","commenter_b":"Brian spot on brother our country is sick you hit nail on the head God bless you.","commenter_a":"AGREE, 100%. AMEN,","post_message":"YES!"},{"comment_id":"10153156333212093","commenter_b":"Agree @username, I appreciate your candor.","commenter_a":"I would have to say too bad. There are reasons why adoption laws are written the way they are. Just because various individuals attempted to circumvent the prior marriage laws to gain legal status instead of going about the legal routes and legal boundaries others have until the recent decision on same sex unions, is not a good enough reason to change the laws surrounding adoption and the laws against adoptive parents becoming involved with adopted children. Do they think they are the only \"couple\" who have this issue. There are countless stories of parents who adopted a child, got divorced, and one of the \"parents\" wanting to change the legal definition of the legal parent-child relationship. How about you made your bed when you tried to circumvent the laws to get around state and federal laws regarding things like insurance eligibility, income tax deductions, ect., just because there are ...","post_message":"Roland and Nino want to get married now that same-sex marriage has been legalized. The only catch is that they are already legally father and adopted son... @webpagelink"},{"comment_id":"521485418039751","commenter_b":"Caitlyn Jenner is a repudlicrat.","commenter_a":"Who wants a killer around them and yes HE killed someone","post_message":"'Transphobic'... Republican-hating... CONFUSION!!!"}]
