[{"comment_id":"596495133817002","commenter_b":"Please put this bitch in, just for the sake of good comedy.","commenter_a":"And Dems here's 8 more years. Repubs are screwed if we put these people up.","post_message":"This is easily the most hated person by liberals. They will begin freaking out in 3... 2... 1..."},{"comment_id":"10153454779861336","commenter_b":"If Mexicans went they would no longer be illegal aliens. They'd be going home.","commenter_a":"I didn't know NASA was racist theres no black astronauts on the list!","post_message":"NASA - National Aeronautics and Space Administration has named the four astronauts who will fly on capsules built by private companies — SpaceX and Boeing."},{"comment_id":"1825065494398013","commenter_b":"the people actually running for president and the SUPPORTERS of those candidates are two different things, dillan.","commenter_a":"The party of old white people is starting to show it's age","post_message":"BREAKING: 'I'm going to run in 2020. For president'"},{"comment_id":"10154019054861509","commenter_b":"White Americans do not recognize anyone else","commenter_a":"American??? Wow, she is so ignorant. Many American citizens came here from other countries speaking another language. English, the American version, is what has been spoken here for many generations. However, we now have many citizens who speak Spanish, Russian, Mandarin, Vietnamese...We are a country of many. Let's stop the ignorance and the Palins of the world.","post_message":"Sarah Palin praised Jeb Bush on speaking Spanish, but said “let's speak American\" to unify the country: @webpagelink"},{"comment_id":"952012654839207","commenter_b":"Pair of fucking idiots. Shouldn't be allowed to breed...","commenter_a":"Every once in a while I read something that haunts me for years","post_message":"The baby was strapped into a child-seat and left on the floor."},{"comment_id":"571127086402504","commenter_b":"Come on guys, the woman is desperate and nervous. You will see very soon who will come out on top. It's time for some real change.","commenter_a":"Look like this page is also scrambling to save Hillary. It's good to know sanders is getting to her. #feelthebern","post_message":"Bernie and his campaign are misleading voters about what Hillary said."},{"comment_id":"10153475865743645","commenter_b":"Yes and she is a real b:tch","commenter_a":"Was the gator named karma ?","post_message":"He jumped into a pond to hide from authorities and an alligator attacked him."}]
