[{"comment_id":"921294477938692","commenter_b":"Damn that bitch is fugly.","commenter_a":"Rothschild , Soros, Bush, Hillary, Bill, Hubbard, Gore, Planned Parenthood all are illuminati members. Sold their Soul to Satan","post_message":"“We don’t know all of the details about this particular incident, but we do know that our national epidemic of gun violence must be addressed,” Debbie Wasserman Schultz said Saturday after 3 people were killed at a Planned Parenthood in Colorado."},{"comment_id":"10153562770079228","commenter_b":"Lol right^^^?","commenter_a":"Should be fired","post_message":"She complained about protesters blocking rush hour traffic on I-70"},{"comment_id":"1836845559870004","commenter_b":"She doesn't deserve to be nominated.. What a laugh..","commenter_a":"Her expressions are the worst.... From her constant head nodding to her wide eyed expressions. And what's worse is when she opens that mouth of hers to spew out a constant stream of lies...","post_message":"Balloons are released to celebrate the official nomination of Hillary Clinton & Tim Kaine."},{"comment_id":"10153174947101545","commenter_b":"So what's your excuse then casey?! Bahahaha!!! Mama was drinking when she was pregnant with you?!","commenter_a":"Now she and her followers will claim that she was jailed for being a christian, as opposed to a bigot hiding behind Christianity.","post_message":"A Kentucky county clerk was found in contempt of court Thursday for her refusal to issue marriage licenses in wake of the Supreme Court decision to allow gays to wed."},{"comment_id":"10157547755435206","commenter_b":"I don't know who's worse: a rapist or a pedophile. This psycho is both.","commenter_a":"Should of chopped him in pieces .","post_message":"An Indian man took revenge against a 17-year-old boy who raped his 7-month-old baby daughter — by tying him to a tree and chopping off his hands."},{"comment_id":"10156459147080354","commenter_b":"if you went to stop all this killing then we have to get all the dam muslims out of America they don't care about living they been killing each other for years and now they are doing it here I hope America will open there eyes and make this move","commenter_a":"Don't worry everyone the government is screening all of these Syrian refugees.","post_message":"***BREAKING*** Muslim Killer Tashfeen Malik was in America on a K-1 (fiancée) visa and held a Pakistani passport. DEVELOPING..."},{"comment_id":"10154471352991337","commenter_b":"Lil girl","commenter_a":"Bitch I hope one of these hoes are next on the hit list of dead cops fuck the police bitch and if u don't like fuck u too hoe come get some bitch ass nigga I'm waiting for w a big ass weapon nigga find out what it is","post_message":"What happens in this video is not ok."}]
