[{"comment_id":"10153811229123433","commenter_b":"1. Hardly \"record\" when the number of abortions is going DOWN. In 1990, there were 1.6 million abortions performed. Today, it's a little over a million. Numbers don't lie. 2. Hundreds of thousands of women were getting abortions BEFORE Roe V Wade legalized them. You are more likely to die due to childbirth/pregnancy complications than an abortion. 3. You are contributing to your own problem. Teens that had received comprehensive sex ed were 60% LESS LIKELY to get pregnant. The states with abstinence only education have HIGHER rates of teen pregnancy compared to states that actually teach sex ed. Why do women get abortions? Unwanted pregnancy. Much less likely to get pregnant when you're using contraception. It's not rocket science. 4. Abortion isn't free. The Hyde Amendment prohibits any federal funding of abortions except in the case of incest, rape, or danger to the life of the mother. They most ...","commenter_a":"What do you call 350k annually, or 10,000 late term per year how many is \" record\"?@webpagelink","post_message":"From the trail in Iowa. Carly Fiorina wrongly claims that we're seeing \"record\" abortions. @webpagelink"},{"comment_id":"10153035327685399","commenter_b":"stop insulting snakes","commenter_a":"It's the eyes with this one... It's the kind of eyes you've seen on a snake.. Just makes your skin crawl","post_message":"Whoops"},{"comment_id":"1260055474038645","commenter_b":"Wonder who will pay her and the teachers salaries, and provide security and law enforcement if all the \"white people\" leave","commenter_a":"Have you seen it ? They can have it.","post_message":"Chicago Teachers Union Karen Lewis This City belongs” To Black People And Not White People."},{"comment_id":"10153687652479885","commenter_b":"That was stupid! Sounds like she needs to take that conceal carry class again!","commenter_a":"If you pull a gun out you need to pull the trigger. Shoot to kill not just threaten.","post_message":"A Florissant man was charged Tuesday with grabbing a pistol from a woman Saturday as she was trying to prevent him from attacking her friend in University City, then beating her and her friend with the gun and shooting one of the women."},{"comment_id":"10155399536459199","commenter_b":"Oh ok was wondering how close this happened it didn't specify what a sick man hope they catch him fast.","commenter_a":"Where is Lakewood Commons I live up by Lakewood high school?","post_message":"The man was about 6 feet tall and rode off on a green bicycle after exposing himself to the child."},{"comment_id":"1253710404722011","commenter_b":"@username you nailed it","commenter_a":"Actually, it's bullying - in his case, you know he would be doing just the same to a male competitor. I believe sexism is a river that runs through him, but I see a ogre of a bully when I see him...","post_message":"TRUTH. Thanks to Hostile Politics."},{"comment_id":"10154103102004170","commenter_b":"hillary is a pig liar","commenter_a":"Despicable HRC is! Oh, so despicable! 👎👎👎👎","post_message":"What kind of First Lady has so little class that she would say something nice about another First Lady, then apologize for saying the nice thing? Oh. Right."}]
