[{"comment_id":"10157066156885389","commenter_b":"Listen... Im pro-Trump and agree with a vast majority of his political stances; however, this wall fallacy is a dream.... a wall doesn't stop illegal entry, it only causes illegal entry to evolve. Initiating an armed presence is one of the most effective ways of mitigating unlawful entry by immigrants.","commenter_a":"Trump wants to rename USA to UST United States of Trump lol","post_message":"“We’re going to build a wall and it’s going to be a real wall… And it’s going to look beautiful because some day they’re going to call it ‘The Trump Wall.’” – Donald J. Trump at a rally in New Mexico"},{"comment_id":"853806161323392","commenter_b":"Ya I always thought she was odd shaped... not anymore. Taylor is way hot","commenter_a":"Smart girl: screw the paparazzi out of a big pay day and staying true to her values; all while looking gorgeous and being a positive role model for girls everywhere.","post_message":"She had a good reason – and it wasn't vanity."},{"comment_id":"936069706469980","commenter_b":"Colleen Boulden Jj Kane","commenter_a":"Ryan Lindgren take me here !","post_message":"Clark Griswold would be envious of this home on Prior Road in Wilmington, Delaware. The huge Christmas light display caught the attention of the SkyForce10 team while they were flying to another story. The set-up even has a walk-through section. Share your favorite lights displays with us here on Facebook or through the NBC10 app!"},{"comment_id":"537465956461211","commenter_b":"You are a total BS'er bitch ...","commenter_a":"Total billshit. I am part owner of a restaurant and we don't have this problem. We have health care for all employees and it didn't hurt our bottom line. The owner is just greedy and doesn't care about the employees.","post_message":" don have that kind of money. So instead of 50 or 60 people without health care, we have 50 or 60 people that aren employed anymore. It makes no sense."},{"comment_id":"1811896189089892","commenter_b":"Cause she was lying, and she knows we all know she is a liar!","commenter_a":"Wow.. a fair and unbiased job by Chris Wallace..finally!!...Trump didnt expose her as the lying criminal that she is as much as I hoped Hillary must have had an earpiece she was nodding yes through the whole debate...what a fake! Now lets listen to the corrupt media spin it left when its obvious Trump won.","post_message":"There was no doubt about it..."},{"comment_id":"834047250056984","commenter_b":"NO MORE ILLEGALS IN THIS COUNTRY ON WELFARE!","commenter_a":"Ladies and gentlemen, the next president of the United States, Donald Trump. Trump train all the way to the white house!!!! #trump2016","post_message":"Thank you Illinois! #SuperTuesday #MakeAmericaGreatAgain #Trump2016"},{"comment_id":"1738340076416341","commenter_b":"Women can be President too 21 Century America ,,,","commenter_a":"Vote Trump to end the Clinton Crime Cartel as we know it.","post_message":"Mike Pence \"signed an abortion law so extreme and so dangerous that even pro-life Republican women in the Indiana legislature spoke out and voted against it.\""}]
