[{"comment_id":"10154286126010326","commenter_b":"Hillary was lost in the past , she didn't care about the milleniels and helped destroy the base. Bernie is the future and was ignored by the filthy rich who are more Republican like than ever. Republicans were endorsing her.","commenter_a":"Eyes on the prize folks. Blue is going to be a tag team extraordinaire. We know the goal, it's not about who is the leader, it must be all of our blue and all of us.","post_message":""},{"comment_id":"1594655060832823","commenter_b":"Put her out there in the line of duty unarmed and we'll see how fast her mind changes!!!!!!!","commenter_a":"Impressive stupidity","post_message":"SHE'S INSANE!!! There's no GREATER Threat to America than these liberals who believe our Military, Guns and Police Officers are Dangerous! Lets get 5000 SHARES if you think these people dont DESERVE the freedom our military provides them!"},{"comment_id":"10153144950646350","commenter_b":"Or because girls are just jealous that \"that ugly skank\" will have taylor for life now","commenter_a":"Why is everyone a hater! Give them your best and move on! I think they are a wonderful couple! Congratulations!","post_message":"Congratulations, Lady Gaga!"},{"comment_id":"554679601385273","commenter_b":"Just look at that fugly face! Barf","commenter_a":"What an ugly dude!","post_message":"Of course Sally Kohn brought up white privilege..."},{"comment_id":"10154403319313812","commenter_b":"On their engines a 100,000 is a lot, only had to do my head gaskets or have a burned out valve. Meanwhile my duratec engine in the Mazda hit 300,000 with little power loss. We do love or did I should say our new 2016 Outback for the whole 600 miles we had it till yesterday it was the 85th car at the single dealership to be towed away to some lot in the middle of slc airport till god knows when Subaru can pull their head out and get entire steering colums to replace.","commenter_a":"I have 4 Subaru's in the family 2005, 2008, 2010, 2012. Three foresters one Tribeca. They all have been great. never had an issue with any of them. Two of them are over 100,000 miles. Love my Subie!","post_message":"RECALL ALERT: Subaru of America, Inc. recalls 52,000 cars and SUVs over potential steering failure and warns owners not to drive them."},{"comment_id":"10155746665275968","commenter_b":"@username so....that leaves people working and travelling abroad virtually unprotected.","commenter_a":"Those were the people in charge of the safety of all ambassadors. Wouldn't that constitute treason or gross negligence on the Trump cabinet that they don't have people in place in transition?","post_message":"😠 😨 😬"},{"comment_id":"455416051331721","commenter_b":"Bullish*t. That articulate enough for you?","commenter_a":"If there is one thing that is inescapably true about President Obama compared to the many predecessors that came before he is this: President Obama will be considered by history's standards as the most articulate president to ever occupy the white house! Period!","post_message":"President Obama's last State of the Union address is January 12th—don't miss it. @webpagelink"}]
