[{"comment_id":"10154192939617541","commenter_b":"Agree it's the dumbing down of America....","commenter_a":"He's such a child.. name calling , whining and bullying when he doesn't get his way. That behavior is definitely not what we should expect from our president!","post_message":"Trump says \"Pocahontas is now the face of\" the Democratic party."},{"comment_id":"10153242003291636","commenter_b":"Who gives a s**t the programs shite anyway I have better things to do with my life than watch reality shows","commenter_a":"Hannah Daw not the reason you thought","post_message":"'I screwed up'"},{"comment_id":"800733213450589","commenter_b":"Islam was banned from the US in 1952, but Obama doesn't want you to know that nor does he respect or uphold the U.S. law. The immigration and Nationality Act passed June 27, 1952 revised the laws related to immigration and naturalization and nationality for the United States. The act, which became Public Law 414, established both the law and the intent of congress regarding the immigration of aliens to the U.S. and remain in effect today. Among the many issues it cover, one in particular found in Chapter 2 section 212, the prohibition of entry to the U.S. if the alien belongs to an organization seeking to overthrow the government of the United States by \"force, violence, or other unconstitutional means\" This, by it's very definition, rules out Islamic immigration to the United States, but this law is being ignored by the White House. Islamic immigration to the U.S. ...","commenter_a":"No! God gave them a place to make there home! we do not have the space!","post_message":"Dalai Lama Warns America And Europe About Muslim Refugees... Obama Shocked If this isn't a sign that we should close our borders than I don't know what is. Do you think we should let Muslim refugees into America?"},{"comment_id":"1082470525182532","commenter_b":"You tell them Horace. Spend that EBT somewhere else.","commenter_a":"Well Texas is off my vacation choice permanently.","post_message":"In Texas, adults with the proper permits no longer need to hide the handguns they carry in their shoulder or belt holsters."},{"comment_id":"10158040412050206","commenter_b":"I was thinking that too. Where is the Air Marshal?","commenter_a":"Good on the pilot.... but where the hell are some of the passengers to help??? Seriously....bunch of cowards.","post_message":"This 25-year-old passenger was restrained by a pilot after pushing and threatening a flight attendant on an American Airlines flight into Charlotte, North Carolina. @webpagelink"},{"comment_id":"1278850128860187","commenter_b":"No way in hell will I change my faith or anything else for this evil bitch!!","commenter_a":"Wear red at the polls. Let's show the Clinton machine how we can show our support another way that can't be rigged. Polling lines full of Trump supporters should skew the view of the biased media. We are the media. We are the people. For the people by the people we will make this country great again. Go Trump!!","post_message":"This literally just happened, folks!"},{"comment_id":"10157151513605231","commenter_b":"Thank u god bless all of his children with love","commenter_a":"He had a dream and we are still dreaming and look how far that has got us police still killing us and now we helping them and everybody's out for themselves king would be shaking his head because we have sold out, we have become a consumer race of people for every other race but our on everybody makes money off of us just look around you where do you spend your black dollars ?","post_message":"On April 3, 1968, Dr. Martin Luther King, Jr. gave what would be his final and most recognized speech. On April 4, 1968, he was assassinated by a coward who doesn't even deserve to be named. Dr. King's contribution to the Civil Rights Movement and to the advancement of black people cannot be ignored. Thank you, Dr. King. \"Well, I don't know what will happen now. We've got some difficult days ahead. But it really doesn't matter with me now, because I've been to the mountaintop. And I don't mind. Like anybody, I would like to live a long life. Longevity has its place. But I'm not concerned about that now. I just want to do God's will. And He's allowed me to go up to the mountain. And I've looked over. And I've seen the Promised Land. I may not get there with you. But I want you to ..."}]
