[{"comment_id":"10154806560781509","commenter_b":"Hillary is a joke. Too bad we didn't have a good candidate. I will not vote for Clinton. The Democrats are losing voters in mass.","commenter_a":"NOT IN JAIL YET......it's not what you know (she knows stuff all) it's the case of WHO....","post_message":"Hillary Clinton just did a Donald J. Trump impersonation, mocking him in a hypothetical debate @webpagelink"},{"comment_id":"10154629464758797","commenter_b":"She also needs to be medically sterilized so another child cannot be born to this vicious murderer","commenter_a":"7 YRS R U FUGGIN KIDDING ME SMH I HOPE HE AT LEAST DIES IN PRISON","post_message":"TODDLER MURDERED: Prosecutors say the beating was so bad that part of the 17-month-old boy's skull broke off in the medical examiner's hand during the autopsy..."},{"comment_id":"10153369363747061","commenter_b":"Should make the short fat squatty ones! Nor everyone has a 12 inch waistline.","commenter_a":"Hello, Are you interested in the world of FAME?? Getting rich. powerful and famous? JOINING THE ILLUMINATI BRINGS YOU INTO THE LIMELIGHT OF THE WORLD IN WHICH YOU LIVE IN TODAY. YOUR FINANCIAL DIFFICULTIES ARE BROUGHT TO AN END. WE SUPPORT YOU BOTH FINANCIALLY AND MATERIALLY TO ENSURE YOU LIVE A COMFORTABLE LIFE. IT DOES NOT MATTER WHICH PART OF THE WORLD YOU LIVE IN. FROM THE UNITED STATES DOWN TO THE MOST REMOTE PART OF THE EARTH, WE BRING YOU ALL YOU WANT. BEING AN ILLITERATE OR A LITERATE IS NOT A BARRIER TO BE A MILLIONAIRE BETWEEN TODAY AND THE NEXT TWO WEEKS. YOU BEING IN THIS OUR OFFICIAL PAGE TODAY SIGNIFIES THAT IT WAS ORDERED AND ARRANGED BY THE GREAT LUCIFER THAT FROM NOW ON, YOU ARE ABOUT TO BE THAT REAL AND INDEPENDENT HUMAN YOU HAVE ALWAYS WISHED YOU WERE .SO IF YOU ARE INTERESTED IN ...","post_message":"There are some new Barbie dolls on the block: curvy, tall and petite! @webpagelink"},{"comment_id":"1008939885848662","commenter_b":"Thank you.","commenter_a":"I hate ghetto ratchet ignorant hood people. Their lives are so mediocre they literally just take up space and resources.","post_message":"The disrespect!"},{"comment_id":"10154403521603132","commenter_b":"I haven't read the article but I believe he is saying that he feels the death of Prince is a tragic loss as was 9/11. I know I haven't stopped crying since Thursday and I never met the man or knew him other than his movies and music. He was a beautiful soul and will be truly missed. @username take things so out of context it's unreal and always have to make things a issue where they should be no issue. Prince was a sexy, talented, giving man and I know I am devistated and I am a fan that will truly miss him.","commenter_a":"Prince was an amazing human being for so many reasons, but really??? 1) Comparing his, or any singular death, to 9/11 is crazy! 2) Why is this a race issue? It's like saying that only us Minnesotans are truly grieving.","post_message":"Dave Chappelle once impersonated Prince for a now-infamous Chappelle's Show skit."},{"comment_id":"1132568873502832","commenter_b":"Dont know. You went baiit an switch. Its about keeping these men out. Want more? @webpagelink","commenter_a":"To keep men pedophiles out womens bathrooms? Yes. I agree!","post_message":"How does this make ANY sense? Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153896267090329","commenter_b":"How about don't send dick pics to anyone. If she wants to see it she can come over...","commenter_a":"The only one I dont support is the woman who shared a screenshot of the dick pic. Yes, unsolicited nude photos are completely uncool. BUT if a woman sent a boob pic to a dude without Asking him if he wanted one, and he shared it on the internet ... Well this would be a whole different post.","post_message":"More and more every day, women are turning to the internet to find the justice the real world won't give them."}]
