[{"comment_id":"10152772572266051","commenter_b":"Awwww come on people . What the heck .people hunt all the time","commenter_a":"You can tell these activists and Hollywood people have never hunted whitetail?","post_message":"Some people are outraged over Matthew McConaughey’s hunting business. Decide for yourselves if there’s anything wrong with it."},{"comment_id":"10154616109355575","commenter_b":"THEY DON'T NEED A TAX BREAK. JUST TAX THEM COMING IN.","commenter_a":"Do it Donald, show all these NaySayers it can be done, save our Jobs, put America back to work.","post_message":"Trump doing more before he's President than Obama did in 8 years!"},{"comment_id":"10152978726794342","commenter_b":"Yep that's some more B.S. All of the jobs that illegals are here taking were done by American citizens before you came. Your comment is without any truth whatsoever!!!","commenter_a":"All this jobs yall dnt do the hispanic race does !","post_message":""},{"comment_id":"10150953576709999","commenter_b":"I know plenty of women who do this kind of thing in their little girl circles. It's just ridiculous that men get penalized for acting this way and women can do the same thing and nothing happen. This nation is full of reverse racism and reverse sexism. The things women say to each other in private can be just as dirty as what men say. On that note. TRUMP2016!","commenter_a":"Ivy League males can be pigs too. Well done. Now can we please raise the bar for male behavior ? Starting with the one running for office, by kicking his chauvinistic but off and continuing with everyone else, please ?","post_message":"A 9-page document contained photos and numeric ratings of female players at Harvard University in sexually explicit terms."},{"comment_id":"10154713916667446","commenter_b":"It's her normal way. She's a bitch","commenter_a":"Trying to be as objective as possible.., she comes across as very angry and off putting , yikes","post_message":""},{"comment_id":"738159049657328","commenter_b":"I think that crooked, lying, evil bitch needs to be in prison","commenter_a":"K, this bit%h is really out there! She and her cronies want total power! I pray that God stops her!","post_message":"WOW. People NEED to listen to Hillary's response when asked if an individual's right to bear arms is a constitutional right... Do you think Americans should be scared of a Hillary Clinton presidency?"},{"comment_id":"1765230837092544","commenter_b":"Wow. So many posts are against Hillary. How can she be leading in the polls? Media bias and manipulation, perhaps? Watch for a stolen election.","commenter_a":"He is not hiding anything and the bigger concern for Americans is how much Hillary lies.","post_message":"Does Donald Trump actually pay his fair share in taxes? Is he worth less than he says he is? Does he have unsavory connections to Russian oligarchs? Until he releases his tax returns, voters won't know for sure."}]
