[{"comment_id":"10156240783770389","commenter_b":"It was painful to watch! How annoying is Bernie??! Good Lord!!","commenter_a":"#PresidentTrump","post_message":"Dumb, dumber, and dumbest?"},{"comment_id":"10154865700468256","commenter_b":"Aaaaaaannnnndddd just fortifying my position even more!! Lmfao!","commenter_a":"I sit back, a giggle my butt off at all these liberals grasping at straws to stop Donald Trump. Such hypocrites, because just 8 years ago when Obama was elected, they were so critical of the \"birther\" cries from conservatives...... I guess when your horse loses the race, you go chasing unicorns!!","post_message":"Pressure on members of the electoral college to select someone other than Donald Trump has grown dramatically - and noisily - in recent weeks, causing some to waver ahead of the Monday vote."},{"comment_id":"875339435822246","commenter_b":"And that wig is horrible!","commenter_a":"No new news...She says that about all men. No shame and straight up tacky.","post_message":"Sherri Shepherd Wants To Sleep With Johnny Gill… @webpagelink"},{"comment_id":"10155106719593132","commenter_b":"She probably was in on it. What woman in her right mind would move in with a man whose wife mysteriously \"disappeared\" just 2 months prior? Both had to know she wasn't coming back.","commenter_a":"Girlfriend needs to be scared now. Similar to the Lacy Peterson case. Very sad!!","post_message":"Elizabeth Sullivan appeared to have vanished two years ago without a trace."},{"comment_id":"1851627945062122","commenter_b":"Rosie would hate it if her wife has a pic out there like Melania's and she were compared to other lesbians, just saying","commenter_a":"Rosie lacks any semblance of class... what a hateful, mean thing to do. Thank you God that Trump is our next president! This left wing ugliness is hard to take..","post_message":"OUTRAGE...! Rosie O'Donnell TWEETS naked photo of Melania Trump when comparing her to other First Lady photos. WARNING: Nudity. @webpagelink"},{"comment_id":"10153598643443812","commenter_b":"Hmmm....will it help us grow perfect women with nice titts?","commenter_a":"Cristian Reyes","post_message":"World's largest atom smasher detects new kind of subatomic particle called the 'pentaquark' -- a new form of matter: @webpagelink"},{"comment_id":"10153203727769342","commenter_b":"Way to go ladies","commenter_a":"Smdh","post_message":"It was an all-out brawl in the middle of the day, and ultimately, it was two women armed with a bat who came to the rescue of a young man in serious trouble. The incident was caught on camera."}]
