[{"comment_id":"1075434165805577","commenter_b":"I'll make my own mind up thanks","commenter_a":"BS","post_message":""},{"comment_id":"750864925104085","commenter_b":"with OUR money !!","commenter_a":"Absolutely","post_message":"Obama Caught Red Handed Financing Mosques Around The World He has been hiding who he is for his entire presidency. Do you think Obama is a Muslim?"},{"comment_id":"10153221748849087","commenter_b":"@username,where are you from?? You pig!! Photoshop your KKK outfit on your daddy...hahahahahaha","commenter_a":"IT WAS YOU, OBAMA who spoke these words at an Islamic dinner - \"I am one of you.\" IT WAS YOU, OBAMA who on ABC News referenced - \"My Muslim faith.\" IT WAS YOU, OBAMA who gave $100 million in U.S. taxpayer funds to re-build foreign mosques. IT WAS YOU, OBAMA who wrote that in the event of a conflict -\"I will stand with the Muslims.\" IT WAS YOU, OBAMA who assured the Egyptian Foreign Minister that - \"I am a Muslim.\" IT WAS YOU, OBAMA who bowed in submission before the Saudi King. IT WAS YOU, OBAMA who sat for 20 years in a Liberation Theology Church condemning Christianity and professing Marxism. IT WAS YOU, OBAMA who exempted Muslims from penalties under Obamacare that the rest of us have to pay. IT WAS YOU, OBAMA who purposefully omitted - \"endowed by our Creator\" - from your recitation of The ...","post_message":"“I do not believe Sharia is consistent with the Constitution of this country,” Dr. Ben Carson told The Hill. “Muslims feel that their religion is very much a part of your public life and what you do as a public official, and that’s inconsistent with our principles and our Constitution.”"},{"comment_id":"1227346460655830","commenter_b":"This bitch is an idiot.. lol","commenter_a":"Really? Trump wants to end Social Security, Medicare, Medicaid, Food Stamps, and Obamacare! Voting Democrat is the only way to stay alive!","post_message":""},{"comment_id":"933455743437871","commenter_b":"no first do their time in prison then be deported","commenter_a":"They should be put in jail for years and when their old, deport them. That is if they make it in jail at all.","post_message":"ClashDaily.com"},{"comment_id":"1118917194866740","commenter_b":"Thanks for stating this. I'm a follower of Christ and so glad you get it about Tebow.","commenter_a":"I'm not a Tebow fan, or a Florida Gators fan, or religious. But I never understood the hate directed at what seems to me to be a decent human being that threw his actions has shown hes willing to help anyone. Funny my fellow Athiest scream about this man \"shoving his faith in our face!\" Don't seem to mind shoving their Athiest views down everyone else's throat.","post_message":"\"The goal of this book was if you pick it up with your head down, you finish the book with your head held high knowing that God has an awesome plan for your life, you matter, and you're important -- and that's a bigger identity than anything that the world could ever offer.\" — Tim Tebow on his new book \"Shaken\""},{"comment_id":"10154934744787403","commenter_b":"@username sorry to disappoint but I'm all for Trump kicking all you Mexicans out of the country 😂😂😂😂😂","commenter_a":"Hypocrite","post_message":"BREAKING NEWS: President Donald Trump plans to suspend visas to seven Muslim-majority countries, draft order shows."}]
