[{"comment_id":"10152774797039877","commenter_b":"She still in hot water","commenter_a":"So wait a min. Im from cleveland lol. So this boy was 5'7 195 lbs bundled up pointing a fake gun at people in the park with his little sister..... Yea the cops did not have to kill him but no one thinks the parenting is to blame ??","post_message":"Extended Tamir Rice Video Shows Cop Tackle His 14-Yr-Old Sister As She Rushed To Her Dying Little Brother's Aid. Watch the heartbreaking video here. Grio fam, sound off with your thoughts on this extended video."},{"comment_id":"1591380840922039","commenter_b":"Legal Mexicans will stay,illegals will get deported..as it should be!!!","commenter_a":"Mexicans broke the fence at the border to come here illeagally, breaking the American immigration laws, so they should pay for the new repaired version (aka the wall) Copy & paste and share this comment if you agree, that way we can support Trump by making him look good.","post_message":"Wow, Mexico sounds like they're literally in the Apprentice boardroom with @Donald J. Trump pleading for him not to fire them. THIS is what it looks like when you've got a president who refuses to back down. It's a new day for America!"},{"comment_id":"10155008685674170","commenter_b":"Buy Global Warming , Ol AL GORE needs the MONEY !!! 😎","commenter_a":"Al Gore. Captain America. He is just another Delta Dawn, someone who feels he deserved to win, it was owed to him. Just like Chillory. So glad they are seeing that not every one likes them or shares their views.","post_message":"Well, they couldn't stop the electors from voting for Trump. But the left never gives up! This new plan sounds like something from a Scooby Doo episode."},{"comment_id":"10153485942076491","commenter_b":"Thanks for the suggestions Mark but I really don't care what yoy think I should be reading.","commenter_a":"He really should narrow that down to a top 10 list. Nobody likes to read that many books.","post_message":"It includes ‘The New Jim Crow’ by Michelle Alexander."},{"comment_id":"10152790927666051","commenter_b":"Sport illustrated is worse, these are woman with their babies, that's all. No big deal.","commenter_a":"Kai","post_message":"This woman was very surprised when her photos were removed. She didn’t think they were inappropriate at all. Decide for yourselves whether they should’ve been taken down."},{"comment_id":"10152839305921680","commenter_b":"Not this half latino nor his wife and father!","commenter_a":"And Latino will fall for it again.","post_message":"\"As a mother, grandmother, and American, I don’t know how a person can meet these young people ... and think of threatening them and their families with deportation,\" Hillary Clinton said."},{"comment_id":"10152865946012293","commenter_b":"Married men have to make more. There are others to provide for.","commenter_a":"Jamal Barcillano :)","post_message":"Marriage appears to transform men’s approach to work and the way employers treat them."}]
