[{"comment_id":"10153062363276162","commenter_b":"Black women are much more violent than all other women combined!!! Actually, violence is the worst among blacks. So stop saying there are bad in all races.. WE ALL KNOW THERE ARE BAD PEOPLE IN ALL RACES.. but the fact is that more blacks commit crimes than all other races combined.. WHY? WHY???? WHY????????","commenter_a":"Just the blacks stealing again. They'll catch them.. eventually as always.. then when they fight the cops, they'll complain that the cops used unnecessary force again.","post_message":"SMASH & GRAB: Thieves smashed a stolen car through the windows of a Best Buy in Lincoln Park early this morning. Officials aren't sure how much was stolen, but no one was injured in the break-in. FULL STORY: @webpagelink"},{"comment_id":"10153459242386409","commenter_b":"That will teach him to open his big Mouth !!","commenter_a":"This is ridiculous","post_message":"A murderer serving three life terms for killing three people saw two more decades added to his sentence after a Washington State parole board considering his request for early release felt his crimes called for a harsher punishment."},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx \" you big dummy \"","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"1358800054143336","commenter_b":"Are you for real???","commenter_a":"Yes @username, they are so utterly disgusting!! But remember, \"when they go low, we go high!'\". And they're just pissed knowing that Every penny Donald J. Trump has had or will ever have, can't buy him the class, dignity, and humanity of Barack Obama. #FarewellObama","post_message":"But wait -- where was Sasha?"},{"comment_id":"10154120855527908","commenter_b":"So California can just take water from somewhere else? I thought they already did that... And destroyed the water source. Humans can adapt and migrate with little effort. To dry? Move.","commenter_a":"How about we build a water pipeline instead? Ample areas of the country have excess while others are in drought. The worst that happens if it leaks a little is some flowers or trees grow :)","post_message":""},{"comment_id":"1250923198278313","commenter_b":"Another add payed for by the Clintons","commenter_a":"What happened to the American people deciding who will represent us. I'm so tired of this political old timers dictating our path","post_message":"“[Donald J. Trump] is a dangerous demagogue completely unsuited to the responsibilities of a United States president.” - Bruce Kovner, who has donated nearly $3 million to the Republican party"},{"comment_id":"10153373946241833","commenter_b":"HE is a mental defective!","commenter_a":"he can leave anyday and take his moron buddies with him.","post_message":"The chairman of the Senate Judiciary Committee wants Attorney General Eric H. Holder Jr. to explain why a Department of Justice gun ban list has a defective category consisting almost entirely of names belonging to military veterans and their dependents. disturbing to think that the men and women who dedicated themselves to defending our freedom and values face undue threats to their fundamental Second Amendment rights from the very agency established to serve them, Sen. Chuck Grassley, Iowa Republican, said in a statement Wednesday."}]
