[{"comment_id":"10152946623505399","commenter_b":"Not even worth her effort!","commenter_a":"As an Alaskan, may I just say, \"O please, Sarah. Please just go away. \"","post_message":"Well then."},{"comment_id":"10154162666938812","commenter_b":"Omg Hillary is a lier and got Americans killed! She only admits lieing when completely and totally caught","commenter_a":"Hillary should win Not that dumb Trump","post_message":"JUST IN: American Samoa Democratic Party says Hillary Clinton has won Democratic caucus. abcn.ws/1L42Yyx"},{"comment_id":"10154705023546729","commenter_b":"WICKED WITCH ! Karma has a major task with this Evil Bitch !","commenter_a":"she is beyond disturbing.","post_message":"He told the truth folks."},{"comment_id":"412948288893465","commenter_b":"An ugly skank. . . . living off tax payer money!!!","commenter_a":"POS !","post_message":"They just exposed the disgusting hotel bill Michelle Obama ran up in Cambodia... this is inexcusable. Hardworking Americans deserve better than her."},{"comment_id":"1493513274041749","commenter_b":"what a whimp","commenter_a":"The people of france must be so hurt by the utterings a man who surrendered his citzenship because he refuses to pay french taxes and became a Russian citzen instead. Comrade Dipstick needs to shut up","post_message":"'France is populated by imbeciles making wine and stinky cheese for tourists'"},{"comment_id":"10155243309639411","commenter_b":"Good @username get all this white people off welfare!","commenter_a":"It's OK , white people it's only for a day. You guys don't have to come off welfare in massive numbers tomorrow to make sure the strawberries get picked!","post_message":"People in Indianapolis joined the nationwide “Day Without Immigrants” movement in an effort to show how critical they are to the U.S. economy and way of life."},{"comment_id":"10152968959637452","commenter_b":"Why couldn't she just get out?","commenter_a":"Who really believes that was a suicide? Smh..","post_message":"\"Get out of the car! I will light you up!\" Authorities have released dashcam video of Sandra Bland's arrest about a week after she was found dead in her jail cell. FULL VIDEO: @webpagelink The medical examiner ruled the Chicago-area woman's death a suicide, but her family believes otherwise."}]
