[{"comment_id":"1847896892115179","commenter_b":"And what about the interface of other devices?","commenter_a":"There is no break through. It has always been there. Anyone heard of Tesla? Um hello...","post_message":""},{"comment_id":"1098705460221855","commenter_b":"@username, you are for Hillary because she is all for bringing others like you here. When you come here, what did you get given to you???? I know you didn't come here with your own money, food, clothing, transportation, etcetera.... It's one thing when people came to this country because they had the hunger for the \"American dream.\" All of the immigrants coming into our country NOW, are money grubbing leaches. They don't respect our values, our flag, and don't care to make this country better.... Just to suck off uncle Sam's teet. I don't WANT to buy health insurance!!!!! WHY should I have to??!! What kind of freedom is THAT???? I think YOU need to do YOUR research!!","commenter_a":"We are taught at schools of what @username did for all American,especially The affordable Health cards. I believe that she will make tramandous change if elected. TRUMP is all set to be Casino manager. That's all.","post_message":"This is really happening—Donald Trump just officially accepted the Republican nomination for president. Share this if you agree: We can't let him anywhere near the White House."},{"comment_id":"10152923328206051","commenter_b":"Screw you bitch.","commenter_a":"It don't count it was just a dog.","post_message":"This guy knew his injured neighbor couldn’t take her dog out for a walk, so he offered to. While the two were out, he killed it with an ax. Guess how much jail time he got. Wrong. Less."},{"comment_id":"10153353951364726","commenter_b":"She is adorable","commenter_a":"Uh oh!","post_message":"Tigger finds her dinner."},{"comment_id":"1135738829807996","commenter_b":"Lydia, you should learn to shut up","commenter_a":"What's next? Calling Thanksgiving Indigenous People's Day II? Why don't they pick their own day. Why is it, like MLK Day, they have to replace long beloved holidays?","post_message":"BREAKING: The City of Phoenix just became the largest city in the country to recognize Indigenous Peoples Day, unanimously voted by the city council. It will take place the second Monday of October."},{"comment_id":"10153467191368132","commenter_b":"She is definitely showing side boob. I wouldn't let my daughters wear that when they're old enough for prom","commenter_a":"I like the dress! Maybe we should teach our boys to control themselves instead of teach our girls they should feel ashamed of their bodies.","post_message":"What do you think of the open-back design?"},{"comment_id":"1089012597882184","commenter_b":"ANTI AMERICAN ASSHOLES","commenter_a":"That's what jackass's do!","post_message":"ClashDaily.com"}]
