[{"comment_id":"1359888287387770","commenter_b":"Stupid silly bitches","commenter_a":"And this is who women follow?","post_message":"SADLY, LIBERALS ARE TOO STUPID TO REALIZE WHAT THIS SIGNAL MEANS!"},{"comment_id":"1680552935568119","commenter_b":"#TrumpIsMyPresident #SendAllIllegalsHome for all American Citizens involved & thanks for all law enforcement","commenter_a":"Okay Obama, this is your last chance to speak against guns... oh wait , guns were not used?! Oh darn it! Well let's start trying to ban knives now too.","post_message":"Officials hold a news conference on The Ohio State University campus attack. @webpagelink"},{"comment_id":"10153492097934170","commenter_b":"Two F'n losers.","commenter_a":"There is a serious lack of testicular fortitude between those two!","post_message":"I'm very disappointed in the King v. Burwell ruling, but we shouldn't be relying on the courts to get rid of ObamaCare anyway. Here are the guys who need to do it."},{"comment_id":"10153067188779312","commenter_b":"your a funny hoe if u wanna live like that so be it","commenter_a":"No junk food or soda Should be like the old days . Meat, cheese, bread, can goods , fresh fruits and vegetables . THATS ALL","post_message":"A Florissant lawmaker wants to prevent the ability to purchase energy drinks with food stamps. Thoughts?"},{"comment_id":"10154276196928128","commenter_b":"more like a buzzard ,she will eat america alive","commenter_a":"People seem to forget!! This is what happens when you mess with the Clinton's!! You can share this from my page if you want. And I did not write this I copied it from someone else that posted it. And in case you have forgotten all the other bodies this witch has left in her wake......Just a quick refresher course we forget what has happened to many of the Clintons. 1- James McDougal Clintons convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr investigation. 2 Mary Mahoney A former White House intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown .. The murder happened just after she was togo public w:th her story of sexual harassment in the White House. 3 Vince Foster Former White House councilor, and colleague of Hillary Clinton at Little Rock ...","post_message":"Aaron David Miller asks: Is Hillary Clinton's hawkish past an accurate indication of how she would behave as president?"},{"comment_id":"1009448912521620","commenter_b":"I'm sick of seeing her scrunched up \"end of her world\" face. She and the others like her are the problem. Sorry cupcake, grow up and accept it.","commenter_a":"I dont see how any employer would want to hire these idiot mellinials.they dont think for themselves.they dont research for the trueth basicly you dont want morons working and running your buisiness.","post_message":"Ummm... WHAT?"},{"comment_id":"10153460362791336","commenter_b":"Trump has Americans interest for once , not what can Americans do for illegals .","commenter_a":"The Silent Majority is COMING OUT FOR Donald J Trump. The PC ERA IS OVER. THE TRUTH ERA IS HERE. Donald J Trump 21st Century Patriot.","post_message":"\"The silent majority is back, and we’re going to take the country back.\" On Saturday, Republican presidential hopeful Donald J. Trump spoke to thousands of cheering supporters in Arizona."}]
