[{"comment_id":"617513011783820","commenter_b":"Bitch stumbles all the time","commenter_a":"She's a friggen Drunk ....!","post_message":"Hillary stumbles boarding plane..."},{"comment_id":"10153685759487439","commenter_b":"Lets ban all Muslims and Idiots like u that have no more brains cause u do to much drugs and u are just as evil as them.","commenter_a":"Ban all Mosques and Muslims from all western civilization.","post_message":"A member of the Iraqi Christian community in Michigan wrote to alert me of a proposed mega-mosque going up in a Chaldean Christian community in Michigan. How frightening it must be to them when their Chaldean brethren in Iraq and Syria are being systematically cleansed from their centuries-old homelands under Muslim rule. The genocide of the Chaldean Christians accompanied by this:"},{"comment_id":"1030490090346441","commenter_b":"Time to build a wall around Chicago.","commenter_a":"It's white people's fault...or financial disparity, or whatever else they want to blame all their actions on","post_message":"Chicago Black Gang Member Lured Child From Playground And Executed Him Point Blank You mean #blackLivesMatter protestors are not rallying for this 9 year old boy who was executed by a thug! I guess his Black Life Didn't matter @webpagelink"},{"comment_id":"10153535731001157","commenter_b":"I don't 100% agree , but same happens when they send my child home from school with nothing but Spanish letters in a supposed \"Bilingual\" setting .","commenter_a":"Look's like a fag","post_message":"An Arizona mayor has refused an invitation to a meeting of U.S. and Mexican border city mayors because it was written in both English and \"Spanish/Mexican.\""},{"comment_id":"1726976590895675","commenter_b":"@username Drama queen.","commenter_a":". LETTERMAN'S TOP 10 REASONS TO VOTE DEMOCRAT 10. I vote Democrat because I love the fact that I can now marry whatever I want. I've decided to marry my German Shepherd. 9. I vote Democrat because I believe oil companies profits of 4% on a gallon of gas are obscene, but the government taxing the same gallon at 15% isn't. 8. I vote Democrat because I believe the government will do a better job of spending the money I earn than I would. 7. I vote Democrat because Freedom of Speech is fine as long as nobody is offended by it. 6. I vote Democrat because I'm way too irresponsible to own a gun, and I know that my local police are all I need to protect me from murderers and thieves. I am also thankful that we have a 911 service that gets police to your home in ...","post_message":"Good morning America! Big day ahead! Join me at 11amE - as I officially announce my Vice Presidential choice- Governor Mike Pence! Watch here: @webpagelink"},{"comment_id":"1840557005997054","commenter_b":"Out her in jail!!!","commenter_a":"Insanity needs to be STOPPED now. Gets some 'TEETH' into prosecuting ALL threats.","post_message":"Yet another one..."},{"comment_id":"1265882336765127","commenter_b":"And yes that woman looks horrible because she over does it ...like I said I wouldn't suggest coming every day for the rest of your life","commenter_a":"Ummm....I am a tanning salon OWNER! You are are misinformed in your information as we all have taken classes about tanning. My mother died of melanoma and never tanned a day in her life we get SOOOOO MANY people with medical conditions who have to tan some of which are young girls. Now they passed the new law in 2014 on minors but we are WIDELY sought out and remained a tanning salon for 17 years!!! You have to educate yourself on it. The media is giving it such a horrible rep just like they do with everything to make you all freak out the exact way u are. If we didn't know what we were talking about then why do we have clients come who beat breast cancer with a doctors note or psoriasis or cystic acne or ms eczema the list goes on. Your body NEEDS vitamin D ...","post_message":"The FDA proposed unprecedented new rules Friday that would bar anyone under 18 from using a tanning booth or sunlamp."}]
