[{"comment_id":"1776660905952346","commenter_b":"Pure, concentrated trash.","commenter_a":"Wow. I would be better of going to Hough and Central and picking something up, thank you.","post_message":"BLOWJOBS FOR HILLARY?"},{"comment_id":"10153249437958701","commenter_b":"What about whores?","commenter_a":"Taking offers on souls in exchange for this perfect diamond. Virgins get first preference.","post_message":"It's a 100-carat diamond, considered by experts to be \"perfect,\" and it's going on sale. Watch the full story, later tonight."},{"comment_id":"1218557638174745","commenter_b":"Jennifer look's like you like to swallow dick","commenter_a":"Chris brown beats in women","post_message":"LIVE NOW: Police are outside artist Chris Brown's home. Police were called to his home after a woman called 911 requesting help. MORE: fox13news.com/news/@username-story"},{"comment_id":"10152994999515326","commenter_b":"Screw you laurie. Are you a tea bagging bitch?","commenter_a":"Good man!","post_message":""},{"comment_id":"10154916215254330","commenter_b":"She should be arrested and lose her job.","commenter_a":"I am not saying this is right but I have seen countless similar things of people doing this type of thing to images of Obama so everyone should just chill with the outrage , where was the outrage when it was Obama images being hung !!","post_message":"The video shows a woman pointing what appears to be a toy gun at a video of President Donald Trump and pretending to shoot at him several times, saying \"Die!\" ---> @webpagelink"},{"comment_id":"994006457321423","commenter_b":"She should be drinking it!!","commenter_a":"What are the long term effects on the citizens of Flint Michigan.... Thanks Cher for showing your humanity","post_message":"Cher is doing her part to help out the people of Flint as they continue to deal with city’s water crisis. More than 180,000 bottles of water are being shipped to Flint courtesy of Cher and water company Icelandic Glacial, which pledged to double her donation. DETAILS ----> @webpagelink"},{"comment_id":"10153831851540695","commenter_b":"There are meds for your issues.","commenter_a":"They got to make Room for these Muslims... We Americans get kicked aside or a Boot in the rear.... Getting More Crazy by the day... America has been Captured by the Islamic Nation... Muslims are taking over... Life is about to change in America... to the Worse........","post_message":"Dozens of residents are homeless after being given 60 days to leave. The city says it plans to build high-rise apartments on the land."}]
