[{"comment_id":"971472706302942","commenter_b":"That's where she belongs! That's where she belongs! That's where she belongs! That's where she belongs! LOCK HER UP!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"More Wikileaks revelations: 1) Ted Cruz allegedly asked the DNC for MONEY to help fund his delegate fight in Cleveland (specifically: Eric Bennett to and from Ken Cuccinelli, R-Virginia working with Ted Cruz and the DNC to undermine the delegate selection before the convention). Working to push through rules changes in the rules committee and working to flip bound delegates against the rules and state law. All co-ordinated with the DNC. 2) Jake Tapper of CNN allegedly colluded with the DNC. They gave him questions to ask his interview guests. 3) Chuck Todd of NBC allegedly was also colluding with the DNC and put pressure on others at the network to go easy on Democrats at the DNC’s request. 4) The New York Times allegedly co hosted parties with the DNC. This is against the law. 5) Hillary Clinton allegedly setup a slush fund through the DNC to launder donor ...","post_message":"Live Now: Jesse Watters and Brian Kilmeade are here at the Facebook Live Lounge from the Democratic National Convention and they're taking your questions! Comment below:"},{"comment_id":"10153617533472061","commenter_b":"She's shark bait!","commenter_a":"@username did u see this yet? Omg I hope they find her.","post_message":"Video shows missing Carnival cruise ship passenger fell backward off rail. \"We hope and pray the U.S. Coast Guard is able to bring Samantha home.\" @webpagelink"},{"comment_id":"10154070918229330","commenter_b":"And that moron idiot Trump??? His posture is dangerous.... Anyone who thinks otherwise is misinformed and reckless, to say the least","commenter_a":"MY TWO CENTS - To all the people who love politics. I can’t predict the future but let’s take a hypothetical in which Donald Trump is the presumptive nominee. Let’s take it one step further and say for this narrative that he runs against Hillary Clinton. I think the race to be POTUS will be close, and irrespective of who wins, can you imagine of what Donald Trump is going to do with all the dirt on Hillary Clinton. She and her husband amassed a 200 million dollar fortune while in political office. If they both worked their entire lives for the government, they couldn’t make that kind of money, let alone have it in the bank. That didn’t go unnoticed. She got a $650,000 for a 45 minute speech from a “bank,” but swears she will kick their butts to the curb (yeah right). Her email server was used ...","post_message":"Nearly 8,000 people are expected to gather at the Convention Center when Donald Trump makes his way to Hartford tonight. @webpagelink"},{"comment_id":"1050256608364201","commenter_b":"Lol. Ridiculous! Hillary2016! !!","commenter_a":"Hillary, Hillary, Hillary. Time to throw in the towel NOW, so when you eventually convicted there is still a Democrat in the White House to pardon you. Keep on campaigning and the Grey Bar Hotel has your name all over it. As I said in my post titled, Smoking Gun: Hillary E-mail Instructs Aide to Delete Classified Markings, I don think anyone really expected Hillary to get a prison sentence, even if indicted, and then convicted, not until the most recent email anyway. Several days ago, The Daily Caller Reported: [FBI] has so much information about criminal conduct by her and her staff that there is no way that they walk away from this, Joseph diGenova, formerly the District of Columbia U.S. Attorney, told Laura Ingraham in a Tuesday radio interview. are going to make a recommendation that people be charged and then Loretta Lynch is going to have the ...","post_message":"Thank you, Ellen DeGeneres."},{"comment_id":"699261006928857","commenter_b":"Hey Amber suck dick","commenter_a":"That was here plan NOT to help kids eat healthy but to sto kids from eating and she did a good job of it, come on Read between the lines. smh","post_message":"BYE BYE! Congress Releases SOME MASSIVE Bad News To Michelle On Her Way Out of The White House!"},{"comment_id":"219022051835576","commenter_b":"Legal Immigration isn't a Problem! Melania Trump is a legal Immigrant!","commenter_a":"YES","post_message":"Senator Tom Cotton just introduced Trump's immigration proposal through the Senate! Sign the petition SUPPORTING the bill HERE: @webpagelink"},{"comment_id":"10156907192725594","commenter_b":"He is currently behind, I am not suggesting that he is not. What I am pointing out is that EVERY SINGLE POLL gives him a much wider lead over Trump than Hillary's lead. Most importantly in swing states. Who cares that Hillary won most of the Southern states, they are not going blue. Bernie won in most of the swing states and he polls dramatically better than her over Trump in those states. He may be losing the primaries, it is probable even. However if the point of this article is that Trump is such a threat to the presumptive Democratic nominee and we need to not be distracted by the primaries than it is fair to say, who is the better candidate to defeat Trump? Maybe for the sake of unity and defeating Trump, Hillary should bow out. You know, for the common good.","commenter_a":"I think we need to start asking the question is it time for Clinton to bow out of the race. Because if our main yardstick is not letting Trump be president all the polls are pretty clear, Sanders is our best bet.","post_message":"Yet Bernie Sanders is having none of it, frequently telling the thousands of supporters who attend his rallies that he still has a narrow path to the nomination."}]
