[{"comment_id":"840567656083161","commenter_b":"Karla Huitron cause yo ass can eat","commenter_a":"Marry her ass quick!!!","post_message":"What u doing? #WSHH"},{"comment_id":"10152578291366636","commenter_b":"But I'm not joking. Why would a western woman live there ?","commenter_a":"A list of things that doesn't offend these clowns needs to be published. How can any intelligent women move to this place?","post_message":"Pakistan is not happy with Imran Khan's new wife..."},{"comment_id":"719757218174186","commenter_b":"So, @username. Please give me a source of information you've taken part of that doesn't promote the hoax. How many articles have you red? How many books? How many documentaries? You know how in a trial both parts are allowed to talk? The jury then have to consider which story makes the most sense and who has the most solid proof. So I take it you've studied both sides thoroughly before you decided it's a crazy tin foil hat theory? I mean, only a huge fool would believe they understood something without reading both sides. And you're not a huge fool now are you?","commenter_a":"Of course not, it's a Globalist hoax to control the world population even more and finance the World Government which is an essential part of the New World Order. The Chinese are in on it of course but don't know why he thought it was their idea specifically","post_message":"-_-"},{"comment_id":"10153759354128352","commenter_b":"She's a slut","commenter_a":"U can tell exactly who the sluts are on this post lol all the women who are defending her..","post_message":"Woman who was ‘slut shamed’ after her public threesome at Calgary Stampede went viral says she has no regrets – in video seen by 3.4million"},{"comment_id":"10153128873081051","commenter_b":"What a crazy bitch that is","commenter_a":"Some people shouldn't be allowed to breed.","post_message":"This man was worried when his girlfriend took off with their baby, but he tried to remain calm. Then he noticed the text messages she had sent him. That's when restraint went out the window and he called 911."},{"comment_id":"10153853099981680","commenter_b":"Abedin: she \"could not use a computer\" So much for Hillary being the great email mastermind.","commenter_a":"Ok, so what!! There is no federal statute that prohibits this! There is an executive rule, which if this article is true the Executive who created said rule exempted by communicating with Clintons private email. That said using a pseudonym may create legal issues for Obama that have never been thought about by lawmakers","post_message":"#Breaking: Obama used a pseudonym in emails with Clinton, FBI documents reveal @webpagelink"},{"comment_id":"10153889494331438","commenter_b":"I just don't understand how people who vote for these whackjobs can imagine living in the world that they want to create. Talk about a hellhole..","commenter_a":"Ted Cruz's campaign statement that \"Muslim neighborhoods\" should be patrolled and militarized is possibly the least American thing I have read today. Land of the free, home of the brave? Nope, not so much because those brown people scare me! And who determines how many Muslims in one neighborhood is enough to warrant this police state attention? I live in a very nice neighborhood and although I don't know for sure (you can't tell someone's religion by looking, folks) there are possibly 4 or 5 Muslim families in my little 2 mile square housing tract. Would that qualify as a \"Muslim neighborhood\"? Jesus, these guys are scary. Bomb, kill, torture, create Muslim ghettos inside the United States. Ugh!","post_message":"Ted Cruz and Donald Trump have particularly harsh responses to the Brussels attacks."}]
