[{"comment_id":"1241511662632276","commenter_b":"Send his ass to jail","commenter_a":"Send him to jail","post_message":"This thug-in-training tried to act tough by sucker punching this white 12-year-old boy with a pair of brass knuckles. Too bad for him the District Attorney didn't think his brutal assault was as funny as he did... Now he's going to see what the real word is like! SHARE and let us know what you think should happen to this thug-in-training! @webpagelink"},{"comment_id":"892607410865802","commenter_b":"As far as an analogy, this is not \"I don't agree with you so I get to beat you.\" This was more like \"you're an abusive boss and I will not be quiet about it.\"","commenter_a":"I find it funny how these pro Trumpers freak out and say how violent Bernie supporters are when in reality it is Trump's hate filled rhetoric that instigates this reaction. God help us all.","post_message":"Californians are having none of Donald Trump's bigoted hate speech."},{"comment_id":"10155265316599199","commenter_b":"No. She was just bat s%$@ crazy","commenter_a":"Im sick of you Christians shoving your religion down our throats. Literally","post_message":"Court documents say the mother \"saw her daughter die and then placed her body in the shape of a cross\""},{"comment_id":"427873120742228","commenter_b":"hiliary could disapear forever and I reilly do not think she would be missed.Bill would be happy .The country would be a lot safer .Not to mention all those people who overheard something her loud mouth said would not have to die.A lot of people have died in her wake.EVIL EVIL EVIL WOMAN if thats what you want to call her.","commenter_a":"F#!#hillary","post_message":"Donald J. Trump has demanded Hillary Clinton apologize for making claims about him and ISIS propaganda that turned out to be false. Hillary's campaign just responded without holding anything back... Do you support Trump over Hillary?"},{"comment_id":"10153122245742377","commenter_b":"Ford didn't take any bail out money yet it is thriving.","commenter_a":"Bankruptcy isn't illegal or immoral, unlike some of Rubio's financial issues. And he never filed for personal bankruptcy, it was a few of his companies out of a thousand. He's a billionaire, yet Rubio has trouble paying credit cards. Truly Rubio doesn't want to go down this path with Trump.","post_message":"Rubio and Trump trade trash talk on finances."},{"comment_id":"398269070297688","commenter_b":"Deport them back to their country. They donot deserve being here in USA. NO BENEFTS TO THEIR FAMILIES.","commenter_a":"This is fucking hilarious I fucking hate the prison system, just a cash grab for our taxes anyway I want to see more of this plz illegals do your worst I am laughing so hard right now","post_message":"This is not a good image for those who are trying to support the rights of illegal aliens."},{"comment_id":"1832453327028289","commenter_b":"Always thought she is trash and this proves it.","commenter_a":"Arrest her","post_message":"Ever the provocateur, Madonna dropped a trio of f-bombs and admitted that she's \"thought an awful lot about blowing up the White House\" during a speech at the Women's March on Washington on Saturday."}]
