[{"comment_id":"10153593708856770","commenter_b":"#TRUMPorTAXREVOLT #BOYCOTTAMAZON #TRYCLINTONFORTREASON #TRYOBAMAFORTREASON #REMOVERYAN #REMOVEPELOSI #AUDITTHEIRS #DISENGAGEWITHTHEUN #DISENGAGENATO #DISBANDTHEELECTORALCOLLEGE #INSTITUTEPOPULARVOTE #HOLDMEDIAACCOUNTABLE #IMPOSETERMLIMITS #VETERANSB4ILLEGALS #BANISLAM #UPHOLDTHECONSTITUTION #REVERSEALLOBAMAORDERS #ARRESTSOROSFORINTERNATIONALTERRORISM #WORKFARE #NOCITIZENSHIPNOVOTE #KILLCOMMONCORE #PURGETHEGOP","commenter_a":"The Muslim Brotherhood government in Egypt CRUCIFIED CHRISTIANS IN DOWNTOWN CAIRO--and they remained Obama's favored government. After the Egyptian people threw them out, Obama continues to consider the Muslim Brotherhood the legitimate rulers of Egypt.","post_message":"The Obama administration’s disappointment with the U.K.'s Brexit contrasts sharply with its celebration of the Muslim Brotherhood’s election in 2012."},{"comment_id":"1087981781280741","commenter_b":"This has nothing to do with \"political correctness\" and everything to do with the agenda of those who wish to bring this country to its knees. Offend Who? Immigrants - legal and illegal? Muslims? Persons like George Soros? These are schools being attacted; our children, our countries highest symbol.","commenter_a":"How can u even think of not flying our flag anywhere in this country. If u have no respect for our flag get the heck out of my USA.","post_message":"Old Glory just got banned from High School football games for the most despicable reason imaginable. What do you think about this and how should students and their parents react?"},{"comment_id":"899984393370316","commenter_b":"Muslims offend me so throw them out","commenter_a":"Perhaps if the Muslims are so unhappy w/ their environment they might want to go home where they won't have to deal w/ such inconveniences. Furthermore, I hope the Smith family doesn't give up their spare lot. I'm so sick of the non-Muslim world walking on egg shells for these folks. I doubt their mother country would give on one issue to accommodate my American, Christian values if I had the misfortune to relocate to their country. Why are we constantly caving to these folks!?","post_message":"Pathetic! (MUST READ)"},{"comment_id":"10156019875440354","commenter_b":"Then lets deport them when they cause trouble!","commenter_a":"Why not? So should Italian Americans.","post_message":"Say what?"},{"comment_id":"10153718216276680","commenter_b":"That woman is a lunatic just like donald duck","commenter_a":"She must have drank the Trump kool aid!!!!","post_message":"Donald Trump’s spokeswoman blamed the policies of President Barack Obama and Hillary Clinton for the death of Army Capt. Humayun Khan, despite the fact that Captain Khan died in 2004."},{"comment_id":"736146246538727","commenter_b":"Big girl had to run!","commenter_a":"It appears the fat lady gave the skinny lady a good beating. She shouldn't have touched her. She appeared to be shielding her head and face as she was pounced on. Then, she gets in her car, probably not thinking rasionaly and overwhelmed by the incident, she blacked out and just lost it. She definitely was not acting in her right mind. She felt shielded in her car and since she couldn't beat them all up, took it to a whole new level. Neither of their actions are justifiable but that big girl needs to be taught a lesson to never ever touch anyone or beat on anyone like that ever again. Clearly, fatso is from the ghetto and couldn't control herself.","post_message":"A parking lot brawl between two women over a parking spot quickly turned into a demolition derby. How could you explain this to your insurance company? // Courtesy: GrindFace TV FULL STORY: @webpagelink"},{"comment_id":"10150858630504999","commenter_b":"Watch out you may be deported!!!!!","commenter_a":"Go Trump for 2016","post_message":"\"There has never been a man or a woman — not me, not Bill, nobody — more qualified than Hillary Clinton to serve as president of the United States of America,\" President Obama said. Read more: @webpagelink"}]
