[{"comment_id":"1170886402975254","commenter_b":"Great family, a drunk, his brother a cheating womanizer, and his lying idot of a wife","commenter_a":"It's ok he will be let go with no repercussions !! 1 he is a Clinton 2 he is in California","post_message":"Former President Bill Clinton's brother, Roger Clinton, has been arrested for DUI in Redondo Beach, California."},{"comment_id":"10153994398911341","commenter_b":"@username tutsis have no link to Israel,,,, Until the 60 s and the palestinian/antisemite propaganda, Palestine was considered as where the jews came from, before ww2 antisemites were shouting at jews to \" Go back to Palestine\"...","commenter_a":"6 millions zionists certainly not because a lot wanted to stay in their own country ... but after WWII ... a lot were seduced by the zionist propaganda. Holocaust was accelering factor of the zionist project already busy in the 20's and 30's with help of british, Rotschild bank and even nazi's (1933 haavara agreement)","post_message":" school education system only tells you about Anne Frank and the six million Zionists that were killed by Hitler."},{"comment_id":"1180369135336890","commenter_b":"She needs to go home, sit on a rocking chair on her front porch and wave to the people in Russia.","commenter_a":"They should be confined together in a room with no outside communication, in or out for at least ten years! Trump and Palin; both ignorant buffoons!","post_message":"Palin tries to take on the “spineless pundits” criticizing Trump - and fails miserably."},{"comment_id":"10150862465429999","commenter_b":"Here, here.","commenter_a":"The truth in the matter is that Washington is all about who has power and control of the agendas, no matter how awful their candidate. Withdrawing support from Awful Trump means conceding power to awful Hillary and the equally awful Democrats. The only way to break this power struggle is to elect more third party candidates that will force our elected public servants to compromise for the benefit of the American People.","post_message":"It's time for John McCain and other Republican leaders to set an example for their party by withdrawing support for Donald J. Trump, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"10153828127059749","commenter_b":"\"...coming to a fridge near you.\" No! No it's not! I don't associate with those they of people!","commenter_a":"George had this idea decades ago in form of Pudding skin singles :D","post_message":"We have reached new culinary lows."},{"comment_id":"507278876143443","commenter_b":"Sorry but I do not understand why faces of those son of bitches are hidden! People should know who they are ....","commenter_a":"Cut them off and save them This is why when they become adults they attack humans!!!!!!!!!!! Ps. We should not be entertained at a circus by animals but actual talent of humans. Animals should be left in their habitat!!!!!","post_message":"Have you ever heard a baby bear's spirit break? THIS is the circus."},{"comment_id":"606523686188854","commenter_b":"@username i will not vote for @username, he is NUTS . just like Hillary.","commenter_a":"Will you Chip in today?: @webpagelink","post_message":"First they ignore you, then they laugh at you, then they fight you, then..."}]
