[{"comment_id":"473513952773114","commenter_b":"She lied about her heritage stealing the opportunity from someone truly deserving and you thought she was principled. Lieing Hillary, Crooked Hiawatha!","commenter_a":"All it sealed was the fact that the vote I thought I'd be casting for Elizabeth Warren in 2020 will have to be cast elsewhere. Then Candidate Obama nailed it in 2008 when he said Hillary Clinton will change nothing, but say anything. A few pressers with Elizabeth Warren won't convince me that Hillary Clinton has suddenly become more progressive. It will just let me know that Elizabeth Warren isn't as principled as I had hoped and thought.","post_message":"Locked hand-in-hand in Ohio, Hillary Clinton and Elizabeth Warren sealed a powerful alliance Monday that could help unify the Democratic Party and give Donald J. Trump nightmares."},{"comment_id":"817971878238235","commenter_b":"WTF. Is she even more stupid then I thought.","commenter_a":"She is so stupid!!Does she have that kind of power or does that have to have congregational approvevl?","post_message":"Big news! What do you think about this?"},{"comment_id":"10153614987044199","commenter_b":"Disagree. I think she's a hero. Get this psycho off the road.","commenter_a":"I just watched the whole video and I call bs on the mom. She had 4 opportunities to take a turn and drive away from this woman. If you have your kid in your car it's not your time to stand your ground. Let her drive on, pull over let them go on their way, turn down another road go another way home. Don't keep following them especially when they keep randomly braking.","post_message":"UPDATE:"},{"comment_id":"10153692267024087","commenter_b":"Li'l ol' ladies with landlines","commenter_a":"In New York,Hillary has a 4-point lead over Sanderss...There is no doubt that she will win N.Y thanks to black votes but by a small margin......She is so popular among African Americans despite that her husband sent 2.4 million black males in jails..It is difficult to explain or justify thier desire to vote in favor of their oppressor..She has 16 points ahead of Sanders in the city of Philadelphia (Pennsylvania) once again thanks to black voters.Hlllary clinton is unpopular among independents and blue collars .It will be impossible for her to win the general election in November without these voters.. ..Only Sanders can persuade independents,and blue collars to vote for democrats in the next election...Sanders is also the only leading candidate with positive favorability at the national level. .","post_message":"\"This is the best territory for him on the calendar,\" Hillary Clinton's campaign chairman John Podesta said of Bernie Sanders's recent wins. \"Most of those were Western caucuses. But when you look at what happened overall in this election, she's gotten 2.4 million more votes than Bernie Sanders.\""},{"comment_id":"10153046934697894","commenter_b":"#SaveYourself #hatinAssHoes","commenter_a":"Because she can't find a job doing anything else #shade","post_message":"Dawn Richard Announces She’s a New Spokeswoman for PETA (People for the Ethical Treatment of Animals) [Photo]"},{"comment_id":"10153560422922629","commenter_b":"Hell yeah bitch","commenter_a":"This post glorifies violent masculinity.","post_message":"Two apparent members of the U.S. Marine Corps reportedly overpowered and halted the gunman."},{"comment_id":"10153358285837439","commenter_b":"Well done Mr. Abbott! He should go one step further and ban/kick out ALL Muslims from the great continent of Australia!","commenter_a":"I am Australian and applaud this action by Tony Abbot. He is a staunch Catholic Christian, and a former Rhodes scholar who from what I,ve heard him say is aware of the fascist doctrines of Islam. Why other Western leaders insist on appeasement of Islam and jihadists is incomprehensible. And more importantly, suicidal.","post_message":"@webpagelink"}]
