[{"comment_id":"1299685360072319","commenter_b":"And what if the fingerprint belongs to a psychopath or a killer ? This solution gives the wrong message, that guns are okay, you just need to make them safer. But guns are not okay. But Americans will never understand this unfortunately. America was build on guns and blood. What do you expect. Don't come now with the reason it's the same with a knife. You can use a knife for different things, but it can also kill someone. A gun though has only one aim and it was made only for one reason and one purpose. To kill. And it's a very unfair way of killing too. I hate guns, I wish they all would disappear.","commenter_a":"This is a great idea if it can be refined to the point of consistent performance!","post_message":"Can a fingerprint save a life? This teenager is working on \"smart gun\" technology. (via INSIDER)"},{"comment_id":"1250044951682199","commenter_b":"Trump Wall GET THEM OUT","commenter_a":"I think everytime racist ,stupid and fear-fueling comments this guys makes in public, a terrorist opens a bottle of champagne and cheer. I mean, this guys just really want an actual attack to occur... everyday with his stupid comments put us in a greater risk for an attack.","post_message":"Tonight, in eyebrow-raising Donald Trump claims: I predicted terrorism, because \"I can feel it.\" Full story: @webpagelink"},{"comment_id":"10153531244887377","commenter_b":"If she wanted privacy then don't run hypocrite","commenter_a":"they nef to vote you also a has been","post_message":"Sen. Dianne Feinstein: Criticism against Hillary Clinton is taken out of context and she broke no laws."},{"comment_id":"889809641117643","commenter_b":"We have a pussy in the White House who will do nothing to protect our service members!","commenter_a":"How many people in this thread actually read the article?","post_message":"The crew of two small Navy craft are being held by Iran."},{"comment_id":"10156036512370294","commenter_b":"Why doesn't she just create her own page?","commenter_a":"U r beautiful don't forget that","post_message":"'We recommend that you avoid focusing on certain body parts...' A mother and blogger who suffers from a chronic skin disorder that affects her face wanted to post a photo of herself without make-up to teach others about her disease. Facebook said no:"},{"comment_id":"554182668075021","commenter_b":"What lower wages, you mean lower taxes. If you don't want to birth a child, just keep those nasty little knees together","commenter_a":"They are poor, jobless and believe the American dream is dead because they are stupid enough to keep being tricked into voting democrat.","post_message":"Last year was the first time that millennials surpassed baby boomers and Gen-Xers to become the largest voting demographic in the US."},{"comment_id":"10156161317710354","commenter_b":"the American police would be arrested for this.","commenter_a":"\"....it became clear to German authorities that a significant number of migrants they were trying to process were NOT Syrian refugees...\" They finally came to that conclusion?","post_message":"Chanting \"ALLAH HU AKBAR”...Pelting Police with Giant Rocks...MORE... Follow Breitbart London for up-to-the-minute breaking coverage of the migrant crisis..."}]
