[{"comment_id":"10154073966458837","commenter_b":"Getting pregnant for most chicks doesn't cost anything ! Save a few bucks and don't buy a condom .......","commenter_a":"Omg! I'm really trying to understand her thought process at that time, but really can't! Some people have no brains and should never reproduce! There are so many women out here that are dying to be able to birth a child and you have pos ppl like this. Smfh!!!","post_message":"SHOPPING MOM ARRESTED - A Florida mom was arrested after leaving her 4-month-baby in an unlocked car while she went holiday shopping."},{"comment_id":"893596794095327","commenter_b":"Obama lead the ludicrous Iran Nuclear Deal. That was it for me. Iran has already violated the 5 year ban on developing and testing ballistic missiles which was part of the nuclear deal and guess what - do nothing Obama is just ignoring it. As far as national security goes - Obama is a disaster. And now he wants to bring in 10,000 refugees from ISIS territory who can not be vetted. Obama is not good for America or Israel.","commenter_a":"CORRECTION: It is under Obama that Israel has received more defense material than under any other previous administration! And these people have the gall to call him the worst President for Israel! And with His Highness' present standing in international diplomatic circles, his voice is hardly more than a \"whisper\" in the globalized wind! It's about time that people become aware of what he has wrought on Israel's reputation.","post_message":""},{"comment_id":"10155637604520354","commenter_b":"BO is merely the `uncriticisable blackface` of liberalism. Hillary is much more evil because she knows what she is doing.","commenter_a":"Obama has a plan....and it's working.","post_message":"This is what Obama calls \"defeating ISIS\"?"},{"comment_id":"1686671934920265","commenter_b":"Hey Vincent, your situated right next to the greatest country of the world and your country is in shambles!! That alone tells us how F'ed up you and your country / society is. You'd think there would be something positive your country would pick up to your benefit. Fix your dump and make it so great and build a wall to keep us out. We'd appreciate it. Asshole!!","commenter_a":"Just put a tax on any money going back to Mexico or central America. Build that Wall Mr Trump.","post_message":"EX MEX PREX: 'NOT PAYING FOR FUC*ING WALL'"},{"comment_id":"666105456853575","commenter_b":"This wench should go back to hell .... <3","commenter_a":"She sounds poorly educated. Does she know what a bigot Sharia Law is on women and gays??","post_message":"Maxine Waters Believes Americans are Bigots for Opposing Sharia Law @webpagelink"},{"comment_id":"1115178825215538","commenter_b":"What the hoes Milton","commenter_a":"Smh..that's sad ..the thing is a man will stay only if he WANTS to stay no matter how many babies you popping out the coochie..better get yo life..become a wife..and try to avoid the strife","post_message":"Desperate"},{"comment_id":"1174215552594104","commenter_b":"This is one time I hope your wrong,Rush! We don't want Hillary as President!","commenter_a":"You just ruined my day, Rush!","post_message":"Everybody is sending me e-mails about Hillary Clinton. Do any of you really, really think she's not going to be the nominee? Come on, let's get serious! There isn't anybody else that's gonna be the Democrat nominee. All of this doesn't mean anything."}]
