[{"comment_id":"10153167804586770","commenter_b":"What size cupp is she?","commenter_a":"can't be any worse than Obama.","post_message":"S.E. Cupp: \"I don't know how Trump's surrogates can sleep at night peddling this unconstitutional, un-conservative, and un-American garbage that is, frankly, from a guy that is never going to be president.\""},{"comment_id":"1162051423814886","commenter_b":"What is a liberal?","commenter_a":"Keep it up NBC your imaginary war on Trump is backfiring on you and fox! The more you bash the better he appears! He represents the millions you ignored for the last eight years! The people are turning against the press and are taking what he says to heart! Many Republicans and Democrats like him!","post_message":"Trump said the female journalist who moderated the GOP debate had \"blood coming out of her eyes, blood coming out of her wherever.\""},{"comment_id":"10156317776015354","commenter_b":"Stupid ass!!!!","commenter_a":"Sounds like a plan to me.","post_message":"“No surprise that someone who makes a living glorifying crime and violence is a cop-hater, too.” MORE..."},{"comment_id":"1455671454485613","commenter_b":"I thought alcohol is not allowed in their religion of peace.","commenter_a":"Drunk and drugged? Classic!","post_message":"The Rabbi looks like a natural at Jew Jitsu..."},{"comment_id":"1110994785663439","commenter_b":"All Hillary does is pander and shift her views to what's convenient for her.","commenter_a":"Democrats should Support Democrats , Bernie isn't a Democrat only in convenience, Playing basketball doesn't and shouldn't mean you support Minorities, where you live is who you are and in Vermont Bernie is 91% White?","post_message":"JUST IN: The Congressional Black Caucus PAC endorses Hillary Clinton for president."},{"comment_id":"10154001737221509","commenter_b":"Because marriage is between a man and a woman, look up sodam and gamora","commenter_a":"Why has she not been fired? Seriously, find another job if performing your duties as a PUBLIC SERVANT conflicts with your religious beliefs. BTW, homosexual marriage is NEVER mentioned in the bible.","post_message":"This Kentucky woman is still refusing to issue marriage licenses to same-sex couples on \"God's authority\" -- and in defiance of the Supreme Court. @webpagelink"},{"comment_id":"993863733987432","commenter_b":"Shut up Meg","commenter_a":"If only this call had been made in September 2001.","post_message":"That's probably not the kind of congratulatory phone call Netanyahu wanted."}]
