[{"comment_id":"10153176001911336","commenter_b":"They could rename the White House, Geratic Ward","commenter_a":"91% huh? @username lol","post_message":"\"I think I've got a good message. I think I've been more right than wrong on foreign policy.\" Today on Fox News Sunday, Sen. Lindsey Graham said he is considering running for president if he can raise enough campaign funds."},{"comment_id":"10153254096516509","commenter_b":"Send her to India","commenter_a":"I hope they capture her alive and she spends the rest of her days rotting in prison. Death for her is too kind.","post_message":"BREAKING NEWS: The female suspect in the #Paris grocery siege has escaped, the police union spokesman says. Watch Live Now: @webpagelink"},{"comment_id":"10153639349621636","commenter_b":"It was 25 degrees when I got off at Gatwick-hotter than the Med!","commenter_a":"What do you say POMY wimps!!","post_message":"'I think it might be too hot'"},{"comment_id":"10153555901929087","commenter_b":"GO #TRUMP !!! HECK YEAH...YOU BET!!! THE ONLY ONE WHO WORKS CIRCLES AROUND THE REST, WHO KNOWS EXACTLY HOW TO MAKE AMERICA GREAT AGAIN !!! YOU BET!!!","commenter_a":"Yes, he's a strong Christian who takes on the Pope and walks in the path of Christ, building walls, abusing women and attacking people of other cultures. If this guy's a Christian, I'm Christie Brinkley.","post_message":"\"I'm always audited by the IRS, which I think is very unfair. Maybe because of religion,\" Donald J. Trump said after tonight's #GOPdebate. \"Maybe because of the fact that I am a strong Christian...you see what's happened, you have many religious groups complaining about that.\""},{"comment_id":"10153750337633812","commenter_b":"Trayvon martin attacked Zimmer . Tired of the lies , zimmer lived in that neighborhood and had the same rights to walk as trayvon . Zimner's head veing slamned into the ground doesnt matter plus your ignorant white comment shows you don't know the facts . Zimmer is latino , black and white so stick your white privilege lie up your backside where your head is already stuck .","commenter_a":"A man who killed a lion is in hiding but the man who killed trayvon Martin is walking free?? Ohhh to be white in America","post_message":"Walter Palmer, the hunter tied to Cecil the lion killing, headed back to work: abcn.ws/1K0cdrW"},{"comment_id":"10150620952809999","commenter_b":"You people don't get it. Keep sticking your heads in the sand. You focus on what he says and not what Hillary has done","commenter_a":"Dump Trump.","post_message":"The P.G.A. became the first major golf organization to pull an event from one of Donald J. Trump's properties in response to his comments about Mexican immigrants."},{"comment_id":"10153305940576051","commenter_b":"If she is guilty, she should get the death penalty...","commenter_a":"\"Parents should be allowed to do whatever they want with their kids,\" we insist. \"It's THEIR children,\" we say. But what happens when the parents are sick and twisted? Huh? Don't kids have a right to be safe from their own parents?","post_message":"Even the grand jury was stunned that a mother could be so cruel to her own daughter."}]
