[{"comment_id":"10152998620161770","commenter_b":"She is a liar and cheat .","commenter_a":"That's because thousands of us protested on how the media thinks they can determine who they want on stage and trying to push there own agenda.. This was the absolute right decision on CNN behalf.. Remember CNN, ABC, fox, and the rest of the media scum that keeps trying make decisions on who can and can't be in any presidential debate.. All candidates should be allowed on stage..","post_message":"Carly Fiorina will join the other GOP candidates on CNN's debate stage."},{"comment_id":"10153435038829753","commenter_b":"tape her mouth","commenter_a":"KARMA is a BITCH....BITCH....I must say YOU are One SORRY ASS LOW LIFE BITCH .....I CAN'T STAND PEOPLE THAT ARE CRUEL TO ANIMALS.........If YOU are CRUEL to a Dog.. There's no telling what YOU might do to a Person....","post_message":"With over 100-thousand shares as of Saturday morning, Katie Brown, the woman who taped her dog’s mouth shut to stop it from barking, has still not removed the photo she took of her canine-reprimand off of her Facebook page. The photo has reportedly caused a flood of phone calls to the police station in South Daytona, Florida, where the woman’s Facebook account says she is residing. “This is what happens when you dont shut up!!!” That is the caption of the photo post Katie Brown put on her... @webpagelink"},{"comment_id":"889809641117643","commenter_b":"We have a pussy in the White House who will do nothing to protect our service members!","commenter_a":"How many people in this thread actually read the article?","post_message":"The crew of two small Navy craft are being held by Iran."},{"comment_id":"1787494751536145","commenter_b":"Such a whiner just give me a bottle of wine so I can shut the hell up","commenter_a":"Compared to what we have had the last eight years if Nixon was running I'd vote for him","post_message":"Clinton's running mate says Trump is even worse than President Nixon because he won't release his tax returns. Is he right?"},{"comment_id":"10153461487831636","commenter_b":"If this woman is happy to make her money from demonising victims whoever they may be then perhaps the rest of us should just think \"what a vile individual she is\" and distance ourselves. What she has successfully done, again, is to spark a debate about herself . Which is probably earning her a fortune . Stop reading the Daily Mail for a start . Johnson was found guilty in court by a jury. Quite rightly the judgement was made on evidence and fact. Not opinion and scaremongering . Let's just stop giving her air time.","commenter_a":"WTH bloody Katie Hopkins ffs again innit???","post_message":"Her comments have sparked a particularly vocal backlash"},{"comment_id":"10154375998138145","commenter_b":"Some women get pregnant and have babies only to blackmail the father of the baby . 5 min sex with a crazy chick get you scrued for lifetime","commenter_a":"REVOKE her parent card!!! right now before anything happens to that baby. I will gladly adopt","post_message":"She got 2 months in jail, but could have faced 5 years in prison. The baby now lives with his grandmother."},{"comment_id":"997192570318083","commenter_b":"She should run","commenter_a":"The horrifying thing about Ann Coulter is that.....someone has sex with her. The more horrifying thing is....there's a chance it's consensual.","post_message":"Many of Ann Coulter's fans were not happy with her dream ticket."}]
