[{"comment_id":"10153066110302144","commenter_b":"No, No, No, No, No... You're in OUR HOUSE!","commenter_a":"americans welcome kenya....that kind of hecklessness cant be accepted","post_message":"\"Listen, you're in my house. You're not gonna get a good response from me by interrupting me like this. I'm sorry. No, no, no, no, no. Shame on you. You shouldn't be doing this.\""},{"comment_id":"10154198214815496","commenter_b":"Kid is gonna put u away","commenter_a":"This is crazy they get to do this","post_message":"Live | The trial of the mom and dad accused of locking their son in a room for almost two years continues. More on what you're watching (and updates when the stream is down): @webpagelink More on the case | @webpagelink"},{"comment_id":"10153842177281636","commenter_b":"In other news, unelectable man set to win another election.","commenter_a":"hahahahaha where are the haters now? suckers!","post_message":"BREAKING"},{"comment_id":"10152608851681636","commenter_b":"we need freedom from jews.","commenter_a":"Mocking the prophet of as violent cult is different to mocking the deaths of 6 million people.","post_message":""},{"comment_id":"10153330405506130","commenter_b":"Exactly. Plus her job is simply to determine if a couple qualify for marriage under the law, not to marry them. She isn't advocating gay marriage by signing the licenses, her signature simply states they are lawfully allowed to wed. Her fucking religious views don't even apply to her job, the fucktard! She is simply trying to use religion to justify her bigoted attempt to judge others and not do her job. She is an employee of her state/county, and bound to the law. If she wants to have her religious views dictate her job she needs to be a clerk for a church. Then she can be a bigot all she wants.","commenter_a":"She is a public servant...to serve ALL the people...not just the ones she agrees with...there's a little thing called \"separation of church and state\"...","post_message":"\"We cannot be held hostage to the theatrics of religious extremists.\""},{"comment_id":"1890218664531612","commenter_b":"Bitch please","commenter_a":"I wish they had either a dislike tag or a big BOO we could tag!","post_message":"By selecting this unqualified ideologue, Trump just declared war on public schools. Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10153042151741680","commenter_b":"Aww, she don't like jail, maybe , I love being able to use this line right now, maybe if she wouldn't break the law, she wouldn't be in jail. Isn't that the line republicans always use.","commenter_a":"Davis is being duped by her attorney. As long as she refuses neither to resign her office nor to do her job, her attorney is the only person who's winning. She is a pawn.","post_message":"The controversy swirling around Kentucky county clerk Kim Davis is not letting up."}]
