[{"comment_id":"10153234639738701","commenter_b":"Portland should be really embarrassed","commenter_a":"Really??? With all the real people who have contributed their time and energy to the Parade over the years all they can come up with is a old smelly piece of rug???????????????????","post_message":"Just in case you were starting to think Portland's obsession with the #pdxcarpet was over..."},{"comment_id":"10153284046734228","commenter_b":"Th!at girl blacked her eye","commenter_a":"That dude is either Prior service (MP) or a local cop. His entire demeanor and physical behavior scream it. I don't think brandishing was the best idea either way..","post_message":"Teens who frequent the skate park say they aren surprised by the fight, but they can believe how it was stopped. A man pulled a gun. - @webpagelink"},{"comment_id":"367438390047230","commenter_b":"Devora Sexton and you are a cheap whore","commenter_a":"If a man's children and wife are a measure of him, Trump is a hell of a guy.","post_message":"Another reason Dems are terrified..."},{"comment_id":"1008697665856648","commenter_b":"Deport them now ,let them go to enjoy Saudi Arabia!","commenter_a":"GOOD the muslims have NO right to tell others what to do and what not to do and no one has any right to attack anyone over an imagined religious superitory","post_message":"In protest, hundreds are posting photos of themselves wearing swimsuits in public places"},{"comment_id":"10153518895070326","commenter_b":"And who believes her??? This must be a \"Clinton Joke\".","commenter_a":"the old scritch she does know how to lie though,,and has lots of crooked schemes up her sleeve","post_message":""},{"comment_id":"1233928029975949","commenter_b":"I got it!! She can't open her mouth without lying through her teeth!","commenter_a":"A few reasons not to vote for Hillary: 1. Knowingly and intentionally destroyed evidence in a criminal investigation. 2. Allowed Americans to be slaughtered when they could have been saved, then lied to the victims families and the American people about it. 3. Rigged the primaries against Bernie Sanders. 4. Selling military equipment and other favors for donations to the Clinton Foundation. 5. Threatening victims of her husbands sexual indiscretions. 6. Risked national security by sending classified information over an unsecured server. 7. Has lost her license to practice law due to dishonesty. I could go on and on with filegate, whitewater, etc., but I think you get the picture.","post_message":""},{"comment_id":"1076188252391484","commenter_b":"body slammed my ass this little cunt held on to the desk causing it to fall over with her nasty ass in it!!!! and now we'll have a litany about the evil whitey cop from some negro lawyer and welfare mama.","commenter_a":"Quick make a judgement before the facts come out.","post_message":"Student body-slammed by South Carolina officer"}]
