[{"comment_id":"10153626389226336","commenter_b":"Guns don't kill people husbands that come home from work early do.","commenter_a":"You need tougher idiot-control!","post_message":"\"I've got to do something going forward that makes her life meaningful and will always be with me. And this is the way to do it.\" – Andy Parker"},{"comment_id":"10153065757271636","commenter_b":"nope, men rape men too.","commenter_a":"Oh I see. Rapists are just misinformed. If only they had read this first, or someone had read it to them at an early age then we wouldn't have this problem that we have today. Women taking sensible precautions has nothing to do with preventing rape. Maybe we should write and share a ten point guide for thieves on why they shouldn't steal. Then we wouldn't have to lock our doors.","post_message":"Worth re-sharing"},{"comment_id":"10153428606317042","commenter_b":"Hell NO. They invited the idiot with the gun","commenter_a":"Yes.. including the idiot that set everything into motion causing the cancellation of the biggest time of their lives.. they could of ACCOMMODATED THEM INTO A ROYAL SWEET OR BALLROOM. ..I MEAN AT THE ASTORIA ...IM SURE THEY,SPENT A PRETTY PENNY. TRAUMATIZED AS WELL. SUE EVERYONE ... Not the doorman.... They were suppose to have a \"Dream Wedding and honeymoon\" ........ . Seriously.....","post_message":"COUPLE SUES HOTEL: The couple whose wedding was canceled after an accidental shooting in the Waldorf Astoria New York is filing a multimillion dollar lawsuit against the hotel. Do you think they should sue?"},{"comment_id":"1160927630633650","commenter_b":"I don't care, I eat it. Yum yum.","commenter_a":"But this is exactly what you do when you eat meat, fish or any kind of breathing animal....but you don't realise because someone did the dirty job for you. Wake up animal eaters.","post_message":"Not what you want to see when you're out shopping"},{"comment_id":"1393322447348037","commenter_b":"NEVER Hillary!","commenter_a":"Petulant child is what Cruz is. Anyone who still endorses Cruz endorses Hillary Clinton!","post_message":"Comparing the print version of Ted Cruz's RNC speech to the rendition that got him booed off stage really does prove it's all in the delivery."},{"comment_id":"10153259509053010","commenter_b":"I bet she could crush Eddie lol","commenter_a":"Had the biggest crush on Eddie Van Halen growing up...LOL..He DOES NOT look the same anymore!!!","post_message":"Van Halen's David Lee Roth put it best: \"We waited 45 years for this.\" More than four decades after it formed, Van Halen played its first nationally televised gig, on Jimmy Kimmel Live. (Roth ended up with that bandage on his nose.)"},{"comment_id":"1703284416593951","commenter_b":"Cruz pussy fake!","commenter_a":"Not true and you know it.","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"}]
