[{"comment_id":"10153181655947452","commenter_b":"Said the hipster wannabe as he hangs out at Starbucks thinking it improves his social status.","commenter_a":"Anybody who goes to Starbucks is an idiot. At Christmas or any other time of year.","post_message":"#MerryChristmasStarbucks: Starbucks' new design for its iconic red holiday cups has some customers feeling less than cheery, with one man saying the company \"removed Christmas from the cups because they hate Jesus.\""},{"comment_id":"10154268994748822","commenter_b":"Assclown fool","commenter_a":"I'm so proud to have this man as my governor and I'm ashamed of the Pennsylvanians (some of whom are commenting here) who are racists and religious bigots. Thank you Governor Wolf for representing ALL Pennsylvanians (even the ignorant ones) and for protecting our children!","post_message":"NEW: Gov. Tom Wolf's administration released a response plan after recent incidents involving racism and religious intolerance in Pennsylvania schools."},{"comment_id":"10153358816899099","commenter_b":"Hide the women and children.","commenter_a":"Countdown until someone is groped/raped or a fight,","post_message":"These streets will be closed Sunday for the Puerto Rican Day parade @webpagelink"},{"comment_id":"1095951603760962","commenter_b":"Don't forget her daughter got knocked up","commenter_a":"and her 'classy' son beat up his girlfriend...great family values","post_message":"When it comes to Donald J. Trump, the gloves are off."},{"comment_id":"1267032153376522","commenter_b":"What with the Department of Health Services do to \"right size\" the Wisconsin Well Woman Program again if women coming flooding back to the program if the Marketplace goes away?","commenter_a":"How do we make people aware of Ryan's many sleights-of-hands that harm people?","post_message":""},{"comment_id":"10152820540374342","commenter_b":"Run the woman down!","commenter_a":"If your gonna follow a potential road rage type person, keep the window rolled all the way up!","post_message":"\"Twice the lady tried to pass me on a two-lane road with double lines on a hill. She about ran me off-road first time.\" Then things got even more frightening for a mother and her child when the woman stopped in the middle of the road and charged at their car."},{"comment_id":"10156350810355354","commenter_b":"Deport these little bastards ASAP","commenter_a":"and the dems what these people in this country!","post_message":"Brace yourselves. Amnesty activists just launched a VIDEO that EVERY American should WATCH..."}]
