[{"comment_id":"963311450392051","commenter_b":"WILL MR. TRUMP STAY AHEAD ?! - @webpagelink","commenter_a":"Iiar liar pantsuit on fire.","post_message":"Hillary has been a champion for everyday families her whole life. That's why she's running for president."},{"comment_id":"10154233668643132","commenter_b":"Michelle Lena Butler idiots on both sides.","commenter_a":"Why is a 50 year old and a 47 year old trying to even reproduce? Can their be laws against that please?","post_message":"\"I can't afford Melissa's doctor visits . . . I don't think I can afford the babies, so I just want to abort all three babies.\""},{"comment_id":"1183868738313543","commenter_b":"I'd rather have my daughter use the restroom with these people:","commenter_a":"Before you know it they will be in your kids public restroom if they aren't already, thanks to the new laws.","post_message":"UPDATE: The Winter Haven Police Department arrested 22-year-old Adam Timothy Tharp after he was caught flashing a 7-year-old girl at a Polk County library."},{"comment_id":"10152881862581051","commenter_b":"Fry the bitch","commenter_a":"Sad god be with her","post_message":"When police responded to the 911 call, they saw this woman on her front lawn - covered in blood. But even that didn't prepare them for what was inside the house."},{"comment_id":"1811899142196174","commenter_b":"Then honey you an your country will be taken over. Woman you have made that country weak.","commenter_a":"Turn the other cheek!! Weakness will not be seen as strength by Muslims! They will eventually control and rule Germany! She is a liberal nut job and her options are few at this point! Damage is done!","post_message":"The insanity continues..."},{"comment_id":"10154288935233984","commenter_b":"What a bitch!","commenter_a":"You will know for sure when we run out water","post_message":"Dem Sen. Barbara Boxer just laid into this Catholic priest for appearing to question Pope Francis's warning on the dangers of global warming. Do you think global warming is a hoax?"},{"comment_id":"1392116457753526","commenter_b":"Illegals DO NOT FREAKING qualify for SNAP or any Welfare!","commenter_a":"So, how many of these people are illegal?","post_message":"This state is preparing to kick roughly 30,000 people off food stamps."}]
