[{"comment_id":"10154262289194877","commenter_b":"And this the female who said it.","commenter_a":"Put your picture up there probably a dog","post_message":"Not today Satan."},{"comment_id":"1457021290993798","commenter_b":"Bullshit they need to put her ass in prison","commenter_a":"jesse doesn't want her next to him at the gallows","post_message":"But, but...I thought she was innocent, Jesse?"},{"comment_id":"10153360842296162","commenter_b":"Hope they enjoy their 72 male virgins.","commenter_a":"Fuckkkkkkkkkkkk Muhammed!!!!!","post_message":"COP SAVED LIVES: The officer who returned fire at two men who shot assault rifles outside an event displaying cartoons of the Prophet Mohammad \"saved lives,\" according to authorities @webpagelink"},{"comment_id":"543745795816000","commenter_b":"We need to start carrying bacon with us and when they disrespect an American Bitch slap them with the bacon.","commenter_a":"Yes,yes! Or send their butts back! We don't want them here!","post_message":"This Fox News reporter was absolutely disrespected by these Muslims. They are out of control. If Muslims are going to live in our country they need to learn some manners. Do you agree Muslims have to assimilate or get out?"},{"comment_id":"10153944733281178","commenter_b":"She should be in jail.....sick, liar.....","commenter_a":"She's mentally ill or clinically insane.","post_message":"If this came from a Republican, their campaign would be immediately over. #TTT16"},{"comment_id":"1145471028827087","commenter_b":"Joy yes the Bible said far be it from the true God to act wickedly! Death is the last enemy, the pain we feel when a love one dies is beyond words indeed God don't cause wickedness n bad things to happen but he \"ALLOWS\" I lost my son who I love dearly and reading and focusing on JOB experience help me to keep my sanity! THANKS BE TO GOD.","commenter_a":"You would not believe how many people said \"everything happens for a reason\" or \"this was God's plan\" when my son was stillborn. It made me so angry, still does. There is no reason, the autopsy proved that.","post_message":"In case you missed it: Sometimes saying \"Everything happens for a reason\" can hurt the folks we mean to help."},{"comment_id":"1342964245730921","commenter_b":"Yes, Hillary ALL THE WAY!! Andrea, go away!!","commenter_a":"She asked the tough questions and Hillary was very professional and gave very informative answers. All together I think it's helped her giving this interview. Trump could never have been so poised with his answers. I think she has been doing great with her campaign. Hillary 2016","post_message":"This is not journalism by any measure."}]
