[{"comment_id":"10154278344319497","commenter_b":"Also @username","commenter_a":"Melissa Tim @username","post_message":""},{"comment_id":"1260485777320174","commenter_b":"I can't wait for President elect Donald Trump to take office and start tossing out the undocumented illegals..........I hope this joker is the first to go.","commenter_a":"that is so sick they should kick them all out","post_message":"BOOM! (WATCH)"},{"comment_id":"459509127578200","commenter_b":"She still has it","commenter_a":"I would love to dance with ..you go girl..!","post_message":"I can't stop laughing!"},{"comment_id":"10153922383952894","commenter_b":"Correction: When some women see a celebrity, all they see is their bank account. 🤔","commenter_a":"This is what they get for messing around with these white women, Chris Brown knows, when a some white women see a black male celebrity the first thing they see is a bank account and how can they set them up to get some money, when are you black male celebs gonna learn this, they wouldn't talk to you if you wasn't rich! DAMN!","post_message":"Chris Brown’s Accuser Baylee Curran Speaks, Says Chris Pulled a Gun on Her Over Jewelry [Video]"},{"comment_id":"1172100076163796","commenter_b":"Tape the bitches mouth shut and repeatedly butt fuck her","commenter_a":"Cruelty to animals is not OK.","post_message":"The internet is calling for blood after a woman posted a photo of her dog with its mouth duct-taped shut."},{"comment_id":"1612409662385087","commenter_b":"If we refuse service/sales to illegals we would be fined or jailed. They have rights, you know! More rights than American CITIZENS have!","commenter_a":"Hey...do not rent nor sell groceries or clothing or gas or anything else essential to their staying here....if we stick together their existence here will be short and sweet....","post_message":"This is stunning. After seeing this more countries might do the same. Do you think the two are connected?"},{"comment_id":"10152894854427756","commenter_b":"I use paper condoms.","commenter_a":"Thanks Obama. *shakes fist*","post_message":""}]
