[{"comment_id":"945138485506331","commenter_b":"Ya skinny women are repulsive...","commenter_a":"why on earth would she? She's beautiful! When I was body building in my 20's I wore a size 10 & weighed 150lbs the muscles in my legs & back we big had to wear mens pant & shirts... now at 56yrs old I weigh 155lbs & wear a size 8. I can assure you I don't look likre I did in my 20's even though there is only 5lbs difference. Muscle is denser & takes up less space..curves are better than stick woman anyday","post_message":"She weighs 160 pounds, and no, she's not worried about her dating prospects at all. (via HuffPost Canada Living)"},{"comment_id":"453687788168068","commenter_b":"The 2ND Amendment was created to stop future Politicians after 1789 From EVER disarming the American POPULACE, It was a RULE OVER The FEDERAL GOVERNMENT to Say Congress the courts and the President Could Not EVER! Make a Law to CURTAIL the AMERICAN PEOPLE FROM OWNING AND USING FIRERARMS, THE GOD GIVEN RIGHT OF THE PEOPLE TO KEEP AND BEAR ARMS, wait for it SHALL NOT!!! BE!! INFRINGED , THAT MEANS NO FIREARMS RESTRICTIONS, TO MY GOVERNMENT THAT MEANS YOU SHALL NOT PERIOD!. END OF DISCUSSION. NEXT GRIPE, SERVANTS OF WE THE PEOPLE.","commenter_a":"Seeing that his commands are what the fighting & killings are all about, it sounds about right, & if you believe that you will believe anything.","post_message":"Why Owning a Firearm is Not Just a Constitutional Right but a God-Given One!"},{"comment_id":"10154691859089778","commenter_b":"Smart enough to know that it's people like Trump that make the world go round. It takes the 1% to contribute the 99% of us that couldn't keep the economy a float without there financial support or contributions to the economy. What is ruining our economy is supporters like yourselves who probably believe in giving the minorities a place to stand in the bread line while they send there un-taxed & undocumented earnings home to there families living like royalty on the backs of the mighty American dollar. While the rest of registered documented citizens pay our taxes to make America great. I am all for immigrants who are here legally and lawfully it's you stupid idiots who support the system in the blind to allow otherwise.","commenter_a":"Racist people are coming out the woodworks. They are attacking Donald Trumps campaigned because they are to stupid to understand the truths of our Society. To stupid to understand simple economics, taxes and laws. They result to violence and idiotic actions. Because they are to stupid to see what's right and wrong!","post_message":"Protests erupted during a Donald Trump rally in Chicago, forcing him to cancel the rally. @webpagelink"},{"comment_id":"944552658926615","commenter_b":"People always wanna go after the other person. .. well guess what? .... THE DAUGHTER WAS THE ONE WHO HAD HER 16 YEAR OLD LEGS OPEN. AND WHAT 16 YEAR OLD BOY GONNA SAY NO TO PUSSY? smh","commenter_a":"I've got 4 daughters and a handfull of granddaughters--put me on her jury!","post_message":"MAD MOTHER: Police say say she beat up a boy after finding him in bed with her daughter. After he ran away, they say she took a baseball bat to his car."},{"comment_id":"451811115023381","commenter_b":"#DonaldTrump2016Bitches","commenter_a":"You should be embarrassed acting like a child picking on the other runners. Why can't you just tell people what you would do as president? Can't believe a potential president would act like a child...I thought you were different...","post_message":"Tomorrow is the most important Tuesday in a long time. Vote for me, & together we can stop Trump & win in November."},{"comment_id":"10150889986764999","commenter_b":"I don't. Our economy benefits tremendously from the labor, the buying power, and the taxes paid by undocumented labor. I for one don't want to have to pay $5 for an apple. We don't need no stinking wall. What a colossal waste of time and money.","commenter_a":"Who here does not want secure borders and our immigration laws enforced and why?","post_message":"The photo-op allowed Donald J. Trump to please his nativist base and humiliate Mexico at the same time, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"10152902814047623","commenter_b":"some whites were brought here as slaves cheese whiz","commenter_a":"Well the NAACP is racist but we arent trying take away their heritage or bill of rights","post_message":"Someone scrawled the word “racist” in black paint on a Confederate monument in uptown Charlotte overnight, officials said."}]
