[{"comment_id":"10153014301039205","commenter_b":"@alex you're fucken stupid saying illegals don't have a place in the U.S. We ALL are fucken immigrants idiot , what about the Chinese gangs and Russian mobs ? What about them ? What about the KKK and other racial groups who commit crimes ? It's not just us MEXICANS who are illegal it's EVERYONE , If anything the natives founded this land and the rest are immigrants .. Smdh","commenter_a":"Who's fucking side are y'all on? Trump may not be the nicest kid on the block but we are talking about a Drug Lord in a very dangerous drug cartel. Is yalls hatred that much for Trump that you support a drug cartel boss killing him?","post_message":"The FBI is now protecting Donald J. Trump"},{"comment_id":"10153534802752217","commenter_b":"It's knowledge obviously. Go look up the definition of Asylum if you are that uneducated @username","commenter_a":"They are all migrants, NOT refugees if they didn't claim asylum in Greece or Turkey for that matter. Your reporter needs educating.","post_message":"More than 11,000 refugees and migrants are camped on the Greek side."},{"comment_id":"976949909016658","commenter_b":"Female Opinions? Female Opinions Being Heard? Female Opinions Mattering? #BananaPeelSledToHell","commenter_a":"We need more where I live!!","post_message":"It's a slippery slope, America"},{"comment_id":"1040475262630610","commenter_b":"Many women who can't do hormonal, do the copper IUD. 10 years in, less of a fail rate than a tubal!","commenter_a":"If only BC didn't have so many side effects tho. I had to get off, I almost had a stroke at 30. Not to mention I gained 40 lbs😟","post_message":"Today is the fifty year anniversary of a court case that changed everything"},{"comment_id":"945417468827008","commenter_b":"Whomever is behind this un-American idea, should be investigated for insanity and on legal terms. The people (or group) seem not to have any interest in America. Has Obama contaminated this too?","commenter_a":"This maybe a big mistake, he is the only one who is not under control of big labor groups and unions, plus I feel the American people are tried of the same old crap, time for a big change.","post_message":"NOOOOOOOO!!!!"},{"comment_id":"1861021464115839","commenter_b":"Fits his class level.","commenter_a":"Ignorant","post_message":"WARNING: Graphic content"},{"comment_id":"10156018657180389","commenter_b":"Carly Fiorina thinks that men that do not want to vote for her are \"Sexist\"... All of you that support her are actually Feminist, or men that are ashamed of being men... Do you really want a Feminist like Hillary or Carly in the White House?","commenter_a":"Hey Sean! Gonna be seeing our man Ted Cruz tomorrow:))!","post_message":""}]
