[{"comment_id":"1282558331837218","commenter_b":"\"Accidently\" lol fucking worthless Muslim and dumb bitch.","commenter_a":"Lies way less maybe but on a much higher scale lady. Really how does she sleep at night knowing she wants to butt fuck half the country and rape our military. I look at that bitch and I cringe bc she just says hello kindly and you know she is lying.","post_message":"Another day, another Trump lie debunked."},{"comment_id":"10154151629042507","commenter_b":"Says the white bitch with a job and a Beamer....Dorothy saloum.....ha-ha!","commenter_a":"Hey @username liberals, Thanksgiving looks like gratitude. It's all about money to you socialists.","post_message":"If you have $50,000 you can join them."},{"comment_id":"559309340924025","commenter_b":"Get her fellow","commenter_a":"Lying is her number one forte","post_message":"SHARE to STAND with this NAVY SEAL!"},{"comment_id":"1091727720848238","commenter_b":"Those people should be sterilized","commenter_a":"Everyone who is against this is a damn hippje","post_message":"This is HUGE news."},{"comment_id":"10153182713489030","commenter_b":"You're clearly loose butthole","commenter_a":"Yeah, this show is as stupid as every druggy I have ever met, and not even close to being funny, uless you are a druggy too.","post_message":"Vote for Seth Rogen and Zac Efron's Workaholics video in this year's Webby Awards People's Voice. @webpagelink"},{"comment_id":"1246630588734477","commenter_b":"This braindead liberal moron should be put in a cage and shut her stupid mouth","commenter_a":"She's getting fatter and fatter too !! 😎","post_message":"Hit 'LIKE' if you think Whoopi is a complete IMBECILE who has no business being on national TV!!! @webpagelink"},{"comment_id":"10155546384855192","commenter_b":"Don't worry God would not choose an unworthy Woman to Have His Child. People no matter how much they serve Christ can still go through very hard times. He didn't say because you love Him, and serve Him that life would be easy.","commenter_a":"First of all to those that say praying won't help them.....You better understand that they don't worship God, or believe Jesus Christ died for their sins. Maybe that is why their world was shaken. God isn't playing. These are the end times. They need to stop the things they do, and accept Jesus Christ in their hearts.","post_message":"The death toll from Nepal's earthquake soared past 3,700 Monday and rescue workers are still struggling to reach two days after the disaster."}]
