[{"comment_id":"1459625230716396","commenter_b":"Send them home!","commenter_a":"Who's with me ?? BUILD the W. A. L. L.","post_message":"Deport them all, President Trump"},{"comment_id":"10154648148626509","commenter_b":"Women for Trrump!!!: \"They'll be on their knees soon enough.\"","commenter_a":"Woman and Americans for our next president Donald J Trump.. Welcome aboard it's a wonderful ride to the White House","post_message":"This mogul once said he's a member of \"the lucky sperm club.\" How Donald J. Trump sees himself, in his own words: @webpagelink"},{"comment_id":"1201515593201525","commenter_b":"Sad as it is. As often as this stuff happens and these woman still don't learn","commenter_a":"Update she was found dead and the man who did it is in custody. ;( RIP>","post_message":"UPDATE: Human remains found in a recycling bin have been tentatively identified as the missing Renton mother, Seattle police said. A suspect was arrested in Snohomish County. DETAILS >> kiro.tv/Renton-Mother"},{"comment_id":"10154134010956323","commenter_b":"Be careful, please. Chose a president because she is woman is sexism. Here in Brazil we already had our first woman president, and this brought to us hope about a better country, but now she is under impeachment process due responsibility crimes made and allowed by her. This not means that women are worst than men, au contraire, I have been working with many managers, directors and executives women and found professionals better than men. Point is, be careful with WHO is the woman you are choosing.","commenter_a":"No.","post_message":"\"Following a decisive victory in New York and with her path to the presidency ever-more surefooted, the possibility of the first female president is sinking in. And whatever your feelings about Hillary Clinton as the vessel for this achievement, it’s an extraordinary one.\""},{"comment_id":"10153416110184705","commenter_b":"It took a woman to git r done!!!","commenter_a":"good","post_message":"A woman scaled the 30-foot flagpole outside South Carolina's Statehouse and pulled down the Confederate flag."},{"comment_id":"10153464911441438","commenter_b":"And What was the point of that weak made up story? if a girl offers a blow job for a ride and decides not to give it, you're still not allowed to rape her. You can tell her to get the fuck out of your car, but no absolutely nothing in her behavior made her deserving of rape. Even if she got in the car ass naked.","commenter_a":"Sexual consent: latent sexism, in the flesh. Hey, bitches, I heard there is a drunk girl on the corner who doesn't want to walk home. Because she is an entitled whore, you taught her that it was ok because whatever she feels is more important than fact, she decides to solicit a random passerby in a car. \"I'll give you a blowjob for a ride,\" are her words. Yet, that interaction, with all of its attendant suggestions & latent sexism & the very fact that it would not have happened without HER initiative, is somehow NOT her responsibility. That's the latently sexist, bullshit truth of femifucktardism & all of you self raping bleeding gashes. 90% of the time, anyway. Protect me because I'm a whore with a bleeding gash and I have to have protection because of the biologically driven imperative, but don't hold me responsible for ANY of my ...","post_message":"Owen Labrie is guilty of sexual assault, but not rape. What?"},{"comment_id":"10152933128350671","commenter_b":"That's because when you were younger they weren't mixing the vaccination like cocktail drinks.","commenter_a":"I'm 45 year old hot all my vacs as a child and I'm ok","post_message":"The Senate on Monday reaffirmed the bill striking California's personal belief exemption for immunizations on a 24-14 vote."}]
