[{"comment_id":"825004334282616","commenter_b":"do that and u'll have gallstone in ur bladder","commenter_a":"Dose this truly work?","post_message":""},{"comment_id":"10150971534884999","commenter_b":"The thrust for stories to prove a Trump presidency will embolden bigots is so great right now, people are faking hate crimes.","commenter_a":"\"RISE IN HATE CRIMES\" -If 'Murican media is anything like Toronto's , they are rigorously hunting down stories that fit the appropriate narrative of the day.","post_message":"Kids are at risk of getting the message that racism and harassment are OK, Emily Bazelon writes in The New York Times Opinion Section."},{"comment_id":"988198774550796","commenter_b":"shes to stupid to even understand her own thought process...","commenter_a":"Learn self control, honey. Everybody was quick to pull out phones and record it! I have great respect for the lady who was talking to her but I have more for the woman who got up and got her kid out if there. This was just stupid, shouldn't of happened. Looking for a pay day.","post_message":"“She wouldn’t leave when asked and became more agitated throwing a paper she grabbed from over the counter and pulling away from PennDOT officials.”"},{"comment_id":"1720672154848520","commenter_b":"@username yes I'm voting for Hillary","commenter_a":"Vote for Hillary and you're voting for corruption. Vote for Trump and you're voting to make America great again!","post_message":"'Get of the fence' and VOTE TRUMP; ' at least he's like us!' - Robert Jeffress (pastor)"},{"comment_id":"1003928746312028","commenter_b":"Trump for President. Get rid of the Muslims","commenter_a":"Wasn't it said that you are either with us or against us and any nation found to be harboring terrorist or terrorist training camps will be dealt with as an enemy of the state? If nothing is going to be done about these confirmed training camps by Obama and his administration does this not make them enemies of the American People.? Perhaps it's time for the Knights Templer to return. Take back America Trump 2016!","post_message":"It is confirmed there are 22 Jihadi Training Camps in the USA, but the FBI says nothing can be done about them. This new map shows exactly where they are so you can see if there's one in more in your state."},{"comment_id":"10155148038011336","commenter_b":"Trump doesn't refute facts in any logical way. He doesn't present evidence to the contrary, just declares that anything negative about him is fake news. Does this not concern any of you?","commenter_a":"Funny how people have forgotten the numerous times Obama called @username out during speeches, press appearances, and other forums. But Trump doing the same thing is suddenly \"horrible\" and shocking...","post_message":"\"He has EVERY RIGHT to call them out.\" On \"FOX & Friends Weekend,\" Herman Cain discussed President Donald J. Trump's often contentious relationship with some in the mainstream media."},{"comment_id":"1019874124772308","commenter_b":"Not just Islam but all religions. Ban religions not humans","commenter_a":"Yes it is, and we need to remember what the Spanish Catholics did to the Native Americans, and what the \"Christian\" Protestands did to the \"Christian\" Quakers. Religion is not the issue here. It's hostility.","post_message":"Trump supporters should remember our OWN history before they foolishly suggest we should ban all Muslims from entering the country. Image by Occupy Democrats, LIKE our page for more!"}]
