[{"comment_id":"624793527653829","commenter_b":"I thought the window sign was funny too.","commenter_a":"Julie! lol","post_message":"If you are a Starbucks customer, you might be a racist... apparently."},{"comment_id":"1329933407046113","commenter_b":"Everything, everything she touches is corrupt.","commenter_a":"GREAT READ","post_message":"PATHETIC @webpagelink"},{"comment_id":"10153128305820933","commenter_b":"Kasich and Taylor can't be responsible when a trusted employee breaks rules behind their backs. Taylor has come out strong against the actions and has expressed deep disappointment that the Trust of the people was broken... as for Spencer (Tim) Balls crazy assertions. Kasich had nothing to do with the ordeal. Spencer (Tim) Ball has a vendetta against Worthington Christian Schools. Kasich's daughters attend the school. That is the only connection between the 2.","commenter_a":"Today's Columbus Dispatch (newspaper) had a good article revealing problems in the Lt. Gov.'s house.","post_message":"Gov. Kasich stopped to greet a small group in beautiful Peterborough, New Hampshire to end the week. See you again soon, New Hampshire! #nhpolitics #fitn"},{"comment_id":"10154954307148984","commenter_b":"You're the dumbass,bitch!","commenter_a":"Lol.you dumbasses believe in stump???lol. I hope you get what he gives you lol and more","post_message":"Paul Ryan is shaking things up with this unexpected announcement. He feels so strongly about this, he decided to make his feelings known during Donald Trump's crucial transition period..."},{"comment_id":"621306871404081","commenter_b":"TruDat","commenter_a":"I do not like Chris Cuomo I quit watching CNN and ABC because of garbage just like this we need to vote them out with not giving them a minute of our time. All Chris is concerned with is his desperate search to find something to attack any republican for but especially our our President Elect if you don't agree with his liberal view he will try to destroy and humiliate you Kellyanne has class and courage to face such an excuse for a reporter if I was her he wouldn't get five seconds of my time.i don't understand what makes him think that is just his President because as my President I feel he has a right to tweet about his opinions and I like seeing what his opinions are.","post_message":"Kellyanne Conway embarrassed CNN's Chris Cuomo for obsessing over Donald J. Trump's tweets..."},{"comment_id":"10152954324555399","commenter_b":"Well, they're not mutually exclusive qualities. A weasel can both **** others and have harmful effects, especially the more gradual and subtle kind.","commenter_a":"McConnell is a pernicious weasel. Reid will get even.","post_message":"An extraordinary act of trolling:"},{"comment_id":"10153183452347490","commenter_b":"The photographer is a WOMAN!","commenter_a":"I have 3 perspectives on this photo: as a PO in charge of the flag, it is against flag etiquette. As a Navy retiree, we need more people to support our militaries and this photo he is a defender of our country and our families. As a photographer this has no words to express how beautifully this photo turned out.","post_message":"THOUSANDS RALLY AROUND PHOTO -- Navy vet and photographer says she's getting more support, and business, after her photo of a baby cradled in the flag made national news:"}]
