[{"comment_id":"10153400579000329","commenter_b":"He's all yours, ladies lol","commenter_a":"Greg Paul Rachelle Krista","post_message":"His name is Brock O’Hurn and he's the king of man buns."},{"comment_id":"1667182103568902","commenter_b":"Obama doesn't like this country or anyone who isn't Muslim. Everything he has done has been to weaken this country. He has opened our doors to terrorists, communists, illegals and Ebola. He has no respect for our military at all. It doesn't take a genius to figure out what he's doing.","commenter_a":"Love Sheriff Clark.","post_message":"Barack Obama is a USELESS president. I am counting down the days till he's gone!"},{"comment_id":"1701496370115384","commenter_b":"GET OUT OF OUR home & go back to hell where u belong!","commenter_a":"yes!","post_message":"16 U.S. States Come Together To Ban Shariah Law It's only a matter of time before the rest of them follow. Do you think Shariah Law should be banned in America?"},{"comment_id":"1183094928399954","commenter_b":"Hate this woman!","commenter_a":"Imagine that.","post_message":""},{"comment_id":"1123357077760543","commenter_b":"She's gonna drop-kick Trump in the general election!!!!","commenter_a":"America actually did stop being great, but not for you because you a corporate puppet","post_message":"\"We don't need to make America great again. America has never stopped being great,\" Hillary Clinton delivers victory speech after #SCPrimary win: @webpagelink"},{"comment_id":"10154992608754723","commenter_b":"Enter with a Visa is legal so what exactly are you talking about. This woman held in JFK work for US ARMY for 10 years in Iraq and this is how she gets paid.","commenter_a":"Cut this out, you want to come to America come in legally like my parents and siblings did. Be willing to work hard and respect American vslues","post_message":"Protesters gather at JFK airport to fight the refugee ban and detainment of refugees."},{"comment_id":"10152814329771636","commenter_b":"The LibDems should have fought for a workable PR system when they had the opportunity.","commenter_a":"As much as I don't like the UKIP he is right","post_message":"'I now have to think seriously about my future life, and what I want to do'"}]
