[{"comment_id":"1226253117412922","commenter_b":"White peoples God George Soros funds these riots !","commenter_a":"If there is any one in the car, it is also attempted murder, and MUST be prosecuted.","post_message":"Nails it!"},{"comment_id":"927319353970153","commenter_b":"Who cares about whatever Sarah has to say....she's a nobody. Good grief !!","commenter_a":"BO doesn't care he's in office as a fraud perpetuating and feeding the muslime brotherhood on our dime","post_message":"HA HA!"},{"comment_id":"10154420630831378","commenter_b":"That's because she's a big liar too","commenter_a":"And less than 7 hours ago Kellyanne Conway said the White House has full confidence in Flynn.","post_message":"#BREAKING National security adviser Michael Flynn has resigned. @webpagelink"},{"comment_id":"10153055472862293","commenter_b":"Shut Up..get outta here!!!! Lol...forgive blacks..?? psscvhh","commenter_a":"Should \"White America\" forgive racist blacks?","post_message":"\"If we really believe that black lives matter, we won’t devalue our reality and cheapen our forgiveness by giving it away so quickly and easily.\" via Washington Post Opinions, Outlook, and PostEverything"},{"comment_id":"10153031341999705","commenter_b":"Sunset Avenue Dove Dove","commenter_a":"I need this in Florida!!!","post_message":"Ok, Starbucks."},{"comment_id":"10154103059341509","commenter_b":"LMAO He will never menstruate or go through menopause LOL","commenter_a":"His NAME is BRUCE Jenner. Will he give up his medal, because he won those medals as a Man","post_message":"A judge has granted a petition allowing Caitlyn Jenner to officially change her name and gender. @webpagelink"},{"comment_id":"633140033543242","commenter_b":"That's Ok She will BURN IN\"HELL\" Along with All The Rest of the Sheep That Followed HER !","commenter_a":"Ugly inside and out AND GETTING WORSE EVERY DAY","post_message":"People are finally getting fed up with Oprah... Great. Let's get this hack off the air once and for all. Should Oprah be kicked off TV?"}]
