[{"comment_id":"1870709889833499","commenter_b":"And what about those born with both genitals ?","commenter_a":"A person that has the female organ is female, and a person that has the male organ is a male, END OF THE CASE. Next please: ''The Kardashians Still Fighting Over a Pudding''","post_message":"Meet the cover girl who used to be a boy"},{"comment_id":"10153630936701955","commenter_b":"Idiots are using it for crack and other illegal substances !","commenter_a":"What a shitty headline. The doctors put him in a coma, not the e-cig. Drudge should have had more sense than to repost such drivel.","post_message":"Man In Coma After E-Cigarette Blows Up In His Face..."},{"comment_id":"10154390282749411","commenter_b":"Yeah, only to let them in later since we have open borders with yhem","commenter_a":"@username Lessa Katherine but sure.. let them into europe haha","post_message":"'This is my sincere thought'"},{"comment_id":"581504818688172","commenter_b":"we are \"nasty women\" and we vote!","commenter_a":"Your mother always said that you were a disappointment and a nasty little creep.","post_message":"The conviction of an Iraqi refugee plotting to blow up the Houston Galleria is exactly why I've been pushing so hard to immediately suspend the refugee program from terrorist hotspots. The current program is a Trojan Horse allowing ISIS and other terrorist groups an open invitation into the U.S."},{"comment_id":"667821613408417","commenter_b":"She needs to shut her big mouth!","commenter_a":"Moooooooo !!!!!! Eat more chicken !!!!","post_message":"Michelle Obama wants to destroy Halloween for kids across America. There is no chance that we will let her take Halloween away from our kids. Do you think Michelle Obama is a joke?"},{"comment_id":"10153599310496037","commenter_b":"I feel sorry for his wife, NO money in the world is worth having to sleep beside that every night.","commenter_a":"Arise Trump Republicans! Demand that all the other lame Republicans running for the GOP nomination quit AND bow down to The Don.. and boycott Fox News.. (^^^) (y)","post_message":"Donald J. Trump, angered by Megyn Kelly's line of questioning during the GOP debate, later told CNN that she had \"blood coming out of her eyes, blood coming out of her wherever.\""},{"comment_id":"1112383468868962","commenter_b":"So she's been here illegally since 1993........of course she'd vote for a criminal.","commenter_a":"If Facebook was not a thrown for liberals, and they removed news pages for being one sided, this would be the smoking gun","post_message":"She survived the holocaust — and years later, she’s getting her citizenship so she can vote for Hillary Clinton @webpagelink"}]
