[{"comment_id":"1085364771487531","commenter_b":"If we accept refugees we are accepting criminal cause that what they are disguised Isis Islam radicals","commenter_a":"Thanks governor for taking s stand To no refugees","post_message":"I appreciate our Gov. Nathan Deal taking a bold stand on this issue. We must secure our borders and know who is entering our communities. #gapol"},{"comment_id":"862139507221510","commenter_b":"Obama and Trump should get along splendidly then.","commenter_a":"Hillary is running a close second or maybe she is in first place.","post_message":"Yes he is! Do you agree with Trump?"},{"comment_id":"10154278163336509","commenter_b":"The Bush war, $7 trillion and counting!!! (Before) Good Schools and Good Incomes! (Now) Poverty, Guns, Incarcerations! $$ facebook doesn't want you to see this $$ As long as America's richest 1%, who now possess 70% of the wealth and don't bother to vote, have the Senators in their pockets the United States Government isn't representing the will of the people, it's the 1% that's running the show. I stand with Bernie Sanders, \"We're governed by an Oligarchy.\" The number of Americans living in poverty will continue to grow while the middle class will continue to shrink and working women will continue to enrich the wealthiest 1% for the next 20 years easily! (Able to afford the best and brightest, Hillary is a great political actor with a well rehearsed script.) She WILL make another Fortune!","commenter_a":"His plan is take more money from the successful and give it to people like freddie gray's neighbors......makes perfect sense.....","post_message":"Bernie Sanders seemed appalled by the conditions as he toured sites of unrest following the death of #FreddieGray. \"Anyone who took the walk that we took around this neighborhood would not think you are in a wealthy nation.\""},{"comment_id":"1109934812394016","commenter_b":"ah so cute. huma and hillary both have repeatedly philandering husbands.","commenter_a":"when your wife's in bed with the democratic presidential candidate and your home watching the children you have to do something ?????","post_message":"ANTHONY WEINER CAUGHT AGAIN: Sends Kinky Shot To Brunette With 4-Year Old Son Next To Him Get out the eye bleach..."},{"comment_id":"10154285934165575","commenter_b":"Bet Hillary can't do that!","commenter_a":"You knew it was coming....THE DANCING DONALD! Lol","post_message":"THIS COULD SPELL DISASTER FOR CROOKED HILLARY...."},{"comment_id":"10154413356958701","commenter_b":"Well that sounded racist against whites to me ALLLLLL LIVES MATTER IF U R BREATHING THAN U MATTER EVEN THE DECEASED MATTERS WE DONT FORGET ABOUT THEM SO EVERY BODY AND SOUL WHETHER ALIVE OR DEAD MATTERS SO STOP THE HATRED","commenter_a":"Scary! Those dens of racist hate are all over the country.","post_message":" do not say police lives do not matter, we do not say all lives do not matter, said Right Reverend W. Darin Moore. we do not apologize that we boldly say, and unapologetically and uncompromisingly declare, black lives matter."},{"comment_id":"10153946533833797","commenter_b":"Iam glad this guy grew some and told the girl to take a hike","commenter_a":"Love this! No one comes in between me and my little fur babies! 💜","post_message":"PET PEEVE: They always say a dog is man's best friend. And this guy is really proving it. One man chose his beagle when he was faced with the “it’s me or the dog” decision. More on the ad here:"}]
