[{"comment_id":"10153305166698984","commenter_b":"Please! Just let her go away!!!!!!","commenter_a":"18 U.S. Code 2071 - Concealment, removal, or mutilation generally (a) Whoever willfully and unlawfully conceals, removes, mutilates, obliterates, or destroys, or attempts to do so, or, with intent to do so takes and carries away any record, proceeding, map, book, paper, document, or other thing, filed or deposited with any clerk or officer of any court of the United States, or in any public office, or with any judicial or public officer of the United States, shall be fined under this title or imprisoned not more than three years, or both. (b) Whoever, having the custody of any such record, proceeding, map, book, document, paper, or other thing, willfully and unlawfully conceals, removes, mutilates, obliterates, falsifies, or destroys the same, shall be fined under this title or imprisoned not more than three years, or both; and shall forfeit his office and be disqualified from holding any office under the ...","post_message":"Wow. One of Hillary's first moves as a candidate may be the one that kills her campaign... Do you hope Hillary loses?"},{"comment_id":"10155011219571729","commenter_b":"She can't... And she doesn't plan on it either!!","commenter_a":"do not trust her to protect us.","post_message":""},{"comment_id":"10154392573271491","commenter_b":"It's only a temporary ban, you guys make it seem like it's a ban forever and second why is it that USA always has to help the world, we have our own problems to take care of... Maybe once things are clear here and we are able to eradicate a huge chunk of terrorism, because it's honestly never gonna go away completely, then the ban can be lifted... What does it matter where the terrorist attacks that were here came from, people just want to open the borders like its nothing, let's spend some of that money here for once and help American citizens instead of foreigners for once or for now at least...","commenter_a":"She fails to understand we are trying to make sure those same radical Islamists, like the same ones who tried to kill her, stay out of our country. I'm saddened to see a survivor of radical Islamic terrorism can't sympathize with the U.S. trying to prevent terrorists from sneaking in as refugees!","post_message":"Malala Yousafzai: \"I am heartbroken that today President Trump is closing the door on children, mothers and fathers fleeing violence and war.\""},{"comment_id":"593055850861224","commenter_b":"AmandaSmith I understand but people wake up in Florida and sometimes find Alligators walking in their yards or in the bottom of their swimming pools. Disney World was actually built around swamps. Yes they altered the swamps and created the lagoon but it has always had alligators in it. Sorry a toddler died because of the lack of understanding of that fact.","commenter_a":"Give me a break. My 7 year old heard about this and the first thing she said is \"why would they go near the water? It's Florida! Everyone knows there are alligators in Florida!\". We are from Wisconsin.","post_message":"A case against Walt Disney World would hinge on whether or not the resort knew about the alligators living in the resort's Seven Seas Lagoon."},{"comment_id":"10153328235374087","commenter_b":"Common ground to Ryan means all his way.","commenter_a":"Ass hole. One of the boys","post_message":"“You know, we have two ears and one mouth,” Paul Ryan said. “We got to use those in that proportion.”"},{"comment_id":"10154374594014087","commenter_b":"All other respectable women","commenter_a":"don't grab your pussy hahaha I dought there is a worry there.","post_message":"\"After months of attacks against women and minorities, women grab back.\""},{"comment_id":"1015138285280684","commenter_b":"To the bone","commenter_a":"They cut his head","post_message":"Ron Mott said the four Chicago teens who kidnapped and tortured a mentally challenged young man weren't \"trying\" to be criminals."}]
