[{"comment_id":"10157833652505615","commenter_b":"I think it's really stupid to be laughing at someone trying pretty much entirely on her own to recount an election everyone agrees was not by the book. When calling this election \"not by the book\" is a gross understatement. Forcing recounts in some critical swing states in a situation where the electoral vote and popular vote are completely different is a reasonable endeavor. What's absurd is how much of the establishment is willing to lie back and let this thing happen, then assure us in the same breath nothing truly terrible will come out of this administration because the establishment will prevent it. Actions speak louder than words, and the inaction of pretty much everyone other than Stein, Sanders, and Warren speaks volumes.","commenter_a":"Jill Stein, election spoiler, is going to put that money raised in her own pocket to pay her expenses.","post_message":"This Just In – Just a few hours til deadline..."},{"comment_id":"635677536633830","commenter_b":"Demons","commenter_a":"@username read the top comment 😂😂😂","post_message":"Name it! #WSHH"},{"comment_id":"1786615071570542","commenter_b":"Send them to Cuba , please. We do not want them.","commenter_a":"We dont really care what you think John Legend!! Why dont you, Colin, Beyonce, Kanye, Will & Barbara & all the other negative so-called celebrities move to Canada or Cuba & give us Americans a friggin break!!","post_message":"Singer John Legend also tweeted that the Star Spangled Banner is \"weak.\" @webpagelink"},{"comment_id":"10154040549579411","commenter_b":"YOU STUPID WOMAN! Read some history first...","commenter_a":"Muslims ruled India from 7th century till 1856. All Indian heritage is created by Muslims rulers they civilized curry mouncher but still not enough... In entire Muslim India history you cannot find Hindu execution or forced convert to Islam..... Same 700 years Muslim rule on Spain... No force to converte to Islam.. No execution.","post_message":"5 assailants arrested, including a barber"},{"comment_id":"10153692085070950","commenter_b":"There was a story not long ago of the White House sending out a million Green Cards to illegals. About a year ago there was a story on Obama sending out a million US citizen applications to green card holders.","commenter_a":"The story CBS did on Brexit tonight was horribly biased. The reporter all but predicted the end of the world (Communism). How better to get America to join the EU, than to bring us to our knees with Obama flooding the homeland with Mexican and south American (illegal alien) nationals? Low skilled labor and low information voters go together like Obama and Muslims. A match made in economic and cultural Hell.","post_message":"U.K.'s withdrawal from the European Union is already causing economic and political upheaval -- so what happens next?"},{"comment_id":"10153424886503598","commenter_b":"How do you plan a family without having a man involved. What they have encouraged is the prostituition of women both in devaluing young girls and women and when they become pregnant pretending to help. But their motive all along was to take a product that costs them nothing and process it( dissect and distribute) to the highest bidder.) to be used for unimaginable purposes. This philosophy is one of the most vile known to humankind. I know a woman who was told by her father when she was a teenager if you get pregnant you nor the child will be helped by me; she would be disowned. This man was a leader in his church but he had absolutely no Love from Christ in his heart. That is not Father God 'a kind of love. That is the kind of hard hearted ness that allowed these baby slaughterhouses to ...","commenter_a":"Amen","post_message":"After 27 Years of Killing Babies in Abortions, Abortion Clinic in Virginia Shuts Down for Good"},{"comment_id":"10152776917200779","commenter_b":"Bitch please...","commenter_a":"Too late, President Obama, you should have spoken out earlier!","post_message":"President Barack Obama voiced his disapproval of the recent rioting in Baltimore in a press conference today. \"There is no excuse for the kind of violence that we saw yesterday,\" he said. \"It is counterproductive.\""}]
