[{"comment_id":"1340506826002077","commenter_b":"Not me kick the muslims baxk to there own countries","commenter_a":"Why don't you go eat a goat turd sandwich and drop dead","post_message":"This is the congressman that stated the Islamization of America can't be stopped..."},{"comment_id":"1231714623549367","commenter_b":"She will fit in better there, anybody who watched Fox on election night knew how desperately she wanted Hillary to win!","commenter_a":"Good bye bye democratic stooge","post_message":"BREAKING: BUH-BYE MEGYN…The Woman Who Miscalculated Her Power With Viewers Is Leaving FOX To Join Liberal, Anti-Trump NBC"},{"comment_id":"10152989254431438","commenter_b":"Where are women who are frightened of a man in the women's room supposed to pee?","commenter_a":"How exactly do you prove you're a trans person?","post_message":"It's one of the most viciously sadistic, hypocritical bills the Florida legislature has ever considered."},{"comment_id":"10153933865898984","commenter_b":"Send her ass to cuba","commenter_a":"The mother was a moderate Muslim who supports what the extremists do. She may not participate in the killing, and so on, but she helps from the sidelines. Deport.","post_message":"This just adds to the mystery of the San Bernardino shooting. This is absolutely huge and it means that there's A LOT more to the story than we know... Share this with everyone. We need to get this out there."},{"comment_id":"10154592396721336","commenter_b":"What a concept...build a wall! Did they get the idea from President Bill Clinton?","commenter_a":"All borders need to be secured.","post_message":"In what could be a \"told you so\" moment for Donald J. Trump, the U.K. announced plans to build a \"big new wall\" at a border port in France to prevent migrants in nearby camps from sneaking aboard vehicles heading to Britain."},{"comment_id":"10157271699240354","commenter_b":"sure take foreign money and rule with foreign masters LOL NO way you fool.","commenter_a":"No you don't, it's payola, play for pay!","post_message":"WATCH Hillary Clinton's hatchet man, David Brock, concede 'Clinton Cash' is no conspiracy book and discuss how the Clinton Machine is hunkering down for Donald Trump's big Monday 'Clinton Cash' speech on Hillary's self-enrichment through the Clinton Foundation..."},{"comment_id":"1446844205342023","commenter_b":"She needs to STFU!!!","commenter_a":"Why publicly, tho? 😡","post_message":"This woman has some nerve...."}]
