[{"comment_id":"10154704340591509","commenter_b":"Don't feed the troll people.","commenter_a":"Why didn't this man order a bride from Russia, or a number of countries which pimp put their very ready and willing women.","post_message":"\"When I woke up I didn't know that I was in China.\""},{"comment_id":"10156004556150725","commenter_b":"Yes Please get RID of her!!","commenter_a":"Please get rid of Hillary Clinton....You rock @username","post_message":"Arriving to check out the border."},{"comment_id":"1062925700414568","commenter_b":"ruthless assholes w/$$ that want more $$ and have far right wing values!","commenter_a":"What idiot thought privatizing prisons was a good idea? Whoever it was... That's where they belong!","post_message":"Next time someone says we're a free country, have them read this."},{"comment_id":"10157136269005354","commenter_b":"Her brother got the gold mine, and we got the shaft. They all knew that, I think these Washington creeps all shared the pot.","commenter_a":"Restore coal mining, open the pipeline, open oil drilling on public lands, and make America Energy independent.","post_message":"****HILLARY CLINTON'S BROTHER BAGGED A GOLD MINE IN HAITI, AND HILLARY GAVE AMERICAN COAL WORKERS THE SHAFT****"},{"comment_id":"10154029521602411","commenter_b":"They why do u live there.? Give them back their land. U r part of the problem apparently","commenter_a":"Why is that something to celebrate? Another way of saying it is that's when the invaders successfully finished off stealing the land of the Potawatomi and Shawnee","post_message":"On December 3, 1818, Illinois became the 21st U.S. state."},{"comment_id":"10157350648655354","commenter_b":"Even if this woman is a prostitute...does that make it OK for the \"boy's club\"?????","commenter_a":"Wasn't that long ago if a girl did this it wasn't bragged about. It was an embarrassment to herself and family. I'm not that old and I think it's disgusting, and she should be cited for it.","post_message":"+++SHOCK+++ OAKLAND POLICE SEX SCANDAL WIDENS... WATCH:"},{"comment_id":"579913498825579","commenter_b":"Why not ?","commenter_a":"I want to be a billionaire....you got a problem with that?","post_message":""}]
