[{"comment_id":"837279236391341","commenter_b":"She's a stupid twat","commenter_a":"How dumb can any one person be?","post_message":"Come again??"},{"comment_id":"10156329985125354","commenter_b":"Stupid Hoe","commenter_a":"One Day ,,,Every Knee Will Bow and Proclaim Him Lord, including you Ms,Johansson...that is the day you will give an answer for this horrible mocking of Gods word you have done","post_message":"Surely Scarlett Johansson is working on a Koran version as well. Surely that's happening, right?"},{"comment_id":"1267016713333785","commenter_b":"Spanish and Latina aren't synonyms- Latina=a woman from Latin America. Spanish is from Spain. Jsyk !","commenter_a":"It's not really a stereotype when the cleaning industry is dominated by a majority of Latina woman. But I agree Latina women shouldn't be isolated to only this role, Spanish women work in a wide range of fields including healthcare, law and science. Many of these women have gone on to play great roles that where not maids. You start from the bottom.","post_message":"It's time to stop casting Latinas as hot-headed, sexy, maids."},{"comment_id":"10152900283295950","commenter_b":"You're the little bitch","commenter_a":"First of all, why the hell are 5th graders getting diplomas???","post_message":"One by one, Trinecia Blacklock's fifth grade classmates were called to walk across the stage to get their diplomas. The wheel-chair bound student waited for her turn, but her name was never read aloud — and she was left alone, sitting by herself."},{"comment_id":"10154370005056162","commenter_b":"She should be CHARGED with TERRIBLE TASTE in clothing!","commenter_a":"The legs are a lot longer than a lot of the short shorts that teenage girls get away with wearing all the time everywhere.","post_message":"TOO SHORT? A burlesque dancer says an airline stripped away her dignity when they told her to change her clothes if she wanted to board her flight... @webpagelink"},{"comment_id":"10153233297426336","commenter_b":"They come over here illegally an you birch about it so you shouldn't celebrate there customs from there country here go back there an live don't do it here","commenter_a":"You can celebrate any way you want....","post_message":"\"I do not think it is the props that are wrong, it is forgetting that this is actually a part of the Mexican heritage.\" Olga Gonzalez, a Northwestern University undergrad from Mexico, takes a nuanced look at Americans' celebration of Cinco de Mayo."},{"comment_id":"10153160986369705","commenter_b":"stupid cow","commenter_a":"Nothings more eerie than the words \"AMERICA\" and \"ISRAEL\". No photos needed.","post_message":"These eerie photos show Osama Bin Laden before 9/11."}]
