[{"comment_id":"1029144867143578","commenter_b":"@username maybe they should all go to Mexico instead .","commenter_a":"Trump. A habitual liar, narcissist, racist, fascist, five time draft dodger, four time bankruptcy filing, woman hating misogynist, bigoted bully. A man who only has money because he's a vaginal success. (Born into wealth.) A man who represents everything that's wrong with this country. Yet, people will vote for him. The very same individuals who stand to lose the most. Wake up. He only cares about himself.","post_message":"New Jersey Gov. Chris Christie offered up the latest twist of the Republican presidential primary when he endorsed Donald J. Trump on Friday."},{"comment_id":"10153382960318717","commenter_b":"I used to not like Mr. Trump. Then started to like him...sort of. Now I dislike him again.","commenter_a":"He's a prick","post_message":"The New York Times is angry that Donald J. Trump mocked one of its reporters who has a physical disability: @webpagelink"},{"comment_id":"10155254752442908","commenter_b":"@username Is that right? My life is in order. I am a home owner. I have had the same employer since 1994. I have never been on food stamps or welfare. I never take a vacation. If I do take time off, it is to do chores that has built up around the house. My wife (which also has a job and the same employer for 5 years) and I had 2 children, and raised them to be hard workers. Both my daughter and son in law to be have jobs. My daughter has two jobs. They are not planning on having children until they actually have their life started, and a place to call their own. They both have their own vehicles. Ones they have worked for and were not just given. Compare that to your life. Let me know... Then we can see who has spent their life ...","commenter_a":"Funny how some of these people are using the term 'greedy' to describe the rich, only to say that THEY want more money...face-palm.","post_message":"A few years ago, a $15 minimum wage was considered too radical. But when people see the justice of an idea, it catches fire very quickly."},{"comment_id":"154804301701173","commenter_b":"Here we go again with the silly questions by the press , get the popcorn out","commenter_a":"We don't like racists","post_message":"LIVE: White House Press Secretary Sean Spicer's daily briefing. Topics include the economy, domestic policy agenda, transgender bathroom policy, state's rights and the Supreme Court."},{"comment_id":"1713218088954908","commenter_b":"@username when have I blamed Muslims for everything? I am so sorry you think that but you have a right to your opinion. I do not hate Muslims I hate that there are Muslim extremist that are going against Israel and want to take what is theirs and deny them their rights. God gave them Israel and Jerusalem is their capital city. Muslims do not worship our God and they want to kill those that do not worship their God. So?","commenter_a":"Amen!! What a terrible screwed up country this is. Need more God in it and less evil. Who cares if the unwanted Muslims are offended ?? Go back to where you came from!","post_message":""},{"comment_id":"1189126694470722","commenter_b":"With all the beutiful woman in NYC you get a mop","commenter_a":"She only cares about money she will never have true love' She must work for the IRS or the Goverment","post_message":"When it comes to love, Martina Paillant won’t settle for someone who has a credit score below 700."},{"comment_id":"1531453513826452","commenter_b":"Yep, Asian Men are Sexy!!","commenter_a":"Don't feel bad Asians .. Black people either play a criminal or a slave majority of the time .. And/or there's only one black character in the entire film or show lol ..","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."}]
