[{"comment_id":"997192570318083","commenter_b":"She should run","commenter_a":"The horrifying thing about Ann Coulter is that.....someone has sex with her. The more horrifying thing is....there's a chance it's consensual.","post_message":"Many of Ann Coulter's fans were not happy with her dream ticket."},{"comment_id":"1183208918440780","commenter_b":"Stupid women. I'm one but Savannah is a regular person, comfortable in who she is. Why must she have makeup on after just having a baby. I'm not going to criticize her for that. Some people just don't know where their nose ends. Leave peoples' business alone. Who are you to make it your business?","commenter_a":"Seriously? People care whether or not she's wearing makeup? Giving birth is one of God's greatest gifts and I doubt He - nor Savannah's precious baby- cares about her beauty routine.","post_message":"\"We don't need any 'tips' on how to look good without makeup. We all look good without makeup. We just don't realize it until we realize what life is truly about.\""},{"comment_id":"10153178962341833","commenter_b":"Oh and not to mention we wouldn't have lasted a day against the British without guns.","commenter_a":"People just don't get the fact that we are still a democracy after 240 years in part because we as a population have the constitutional right to be armed. Let's see how long we would have lasted otherwise.","post_message":"Thank you for helping us reach 4.2 Million LIKES on Facebook! Like and Share the news with your friends!"},{"comment_id":"10153203581878984","commenter_b":"Didn't a bunch of people get in trouble for using their own private email accounts for using government email accounts during an election. Why is it different with this woman she should have to open up every single email ever written or received just because it was her so called private account she did government business on it so that exams her from any protection","commenter_a":"God Bless you, Trey Gowdy !!!","post_message":"Hillary’s private emails could contain the smoking gun regarding the scope of her involvement in the Benghazi attacks… Send an email to Rep. Gowdy demanding answers from Hillary and the State Department!"},{"comment_id":"10153597569599411","commenter_b":"@Zoran...again, you get a life...we are pretty happy and fine. Not like a poor illegal immigrants as Zoran trying to stay in the west....","commenter_a":"No one should feed barbarian Russian junta fascism invaders.","post_message":""},{"comment_id":"10153328109319087","commenter_b":"@username Let the refugees go fight for themselves.","commenter_a":"When are people going to accept that refugees are not terrorists?","post_message":"President Barack Obama still plans to allow 10,000 Syrian refugees into the country over the next year, despite terrorist attacks in Paris, at top aide said Sunday."},{"comment_id":"1001578793209206","commenter_b":"I should hope so. I thought charges had been brought before the court. Let's hope these 2 black women thugs go away for a long while and go to finishing school. Sarcasm intended","commenter_a":"Way to be behind in the news. Also i believeit was in indianapolis and the girl has been arrested on an unrelated charge. Yup mainstream news media at its best","post_message":"Shocking video out of Texas where a woman holding a child was assaulted by two other women."}]
