[{"comment_id":"10152957985436316","commenter_b":"Ignorant bitch. Talk about crime? I haven't heard of an illegal immigrant shooting up an elementary school or a movie theater. Americans are using drugs that's why drugs are trafficked here. Can you read a sociology book and gain better insight into social issues than base your opinions on ignorance?","commenter_a":"and all the anchor babies..they pop out 5 or 6 kids and they have welfare for life, the low life dads beg to stay because his child is \"american citizen\" .. so 1 breeder, 6 kids, 6 dads> IS 14 ILLEGALS ON WELFARE< running drugs, chop shops, gangs...all of this in a 1 bedroom apt in a apt complex that has 500 units... Now much money is being sent down a rat hole????","post_message":"The number of illegal aliens residing and working in the United States now outnumbers Americans who are unemployed and looking for a job, an issue that is certain to be a priority for tens of millions of voters in the 2016 presidential election: @webpagelink"},{"comment_id":"10152721267846813","commenter_b":"Did feminists put these dumb words in this clown's mouth?","commenter_a":"The problem comes from this institutionalized idea that men are superior to women and therefore can make decisions on behalf of women. It is a systemic problem that as a society we have been fighting externally, but have found challenges how to fight it internally.","post_message":"Should men be able to decide what happens to a woman’s body? Sound off in the comments section! #LetsTalk"},{"comment_id":"1542852682414651","commenter_b":"Nukes don't care about fetuses.","commenter_a":"Two Minutes to Midnightttt! The tiny hands that threaten doom!","post_message":"It was nice knowing you all."},{"comment_id":"10153199702710095","commenter_b":"We'll soon be seeing the kids wearing these shirts. Happens every election. Thanks for helping to clothe the poor in Africa and South America.","commenter_a":"Please take the time to read my little rant! And the article! Monday morning trash x 2 floors.. Plus 6 bathrooms to wipe up and make presentable, a floor and a half to sweep and mop, vacuum 1 study room, then I can begin in my own bathrooms according to schedule.. Ive mopped my half of 5th and finished up there about to sweep and mop my own whole floor.. All for $7.57 an hour.. Oh and I left our the part about the beer poured all over the floor near and in back of fifth floor trash cans.. Im not usually a complainer and I really feel sorry for the people that have been here longer than me. Pack the students in and don't worry these petty people will clean up whatever the students can throw at them.. I was also promised a raise after 6 months of my ...","post_message":"New Jindal for President shirts are available. Buy one today."},{"comment_id":"10154326726666729","commenter_b":"None... Technically. I do think they may have accidentally drifted into their waters..","commenter_a":"Why did our sailors surrender and why didn't we have any support for our sailors such as a helicopter? Something isn't right here, this stinks like Benghazi.","post_message":"We REALLY wish we didn't have to show you this, but this is what the results of feckless foreign policy leadership look like..."},{"comment_id":"10153713889518869","commenter_b":"this particular immigrant is a whore.......you dont get a pass for being an immigrant......","commenter_a":"an Immigrant bar whore toy bought by Donald....the end.","post_message":"The couple's courtship story is as chaste as its backdrop is louche: Donald saw Melania at an event, he asked her for number, but Donald had arrived with another woman—so Melania refused. He persisted."},{"comment_id":"10154241642885579","commenter_b":"@username And lucky for you Canadians, you have Justin Trudeau and Chrystia Freeland. They are both young, sensible and bright.","commenter_a":"I'm 73 years old and this is the strangest election I've ever seen in my life. It's scary as hell and I want to move , but nowhere to go. This is the demise of the country that has been predicted for decades. Going under , folks. It's been fun while it lasted.","post_message":"Marco Rubio: \"And so, while it is not God's plan that I be president in 2016 or maybe ever, and while today my campaign is suspended, the fact that I've even come this far is evidence of how special America truly is.\" Watch full speech here: @webpagelink"}]
