[{"comment_id":"10153393698278606","commenter_b":"The statement would they would have been fired if it was a white man is stupid,they should have been either way and the point is it wasn't, if this is the kind of judgement they you I wouldn't trust them to protect and serve","commenter_a":"It looks like two hunters with a deer...what's racist about it?","post_message":"One of the two police officers who was fired after posting this photo wants his job back: @webpagelink"},{"comment_id":"1557321691221611","commenter_b":"karma is a bitch at times","commenter_a":"When is it anybody else's business! Tell them to butt out!","post_message":"Way to go mom!!!"},{"comment_id":"1162368457165867","commenter_b":"CORRUPT - I GUESS CLINTON HAS SOMETHING ON YOU!! KARMA - I HOPE PEOPLE SEE THROUGH YOUR CONSPIRACY FOR HILLARY.... I AM GOING TO CALL TO BOYCOTT UTAH","commenter_a":"who, whit ,where ??","post_message":"Could Evan McMullin be the next President of the United States? Full story: @webpagelink"},{"comment_id":"10153261191949255","commenter_b":"Misogynist fraud","commenter_a":"What a dink tip","post_message":"Rand knows that women have cooties. Yuck."},{"comment_id":"719778928160572","commenter_b":"SHE'S a lying BITCH!!!!!","commenter_a":"Maybe for your distorted economy, sissy. It's perfect for Free Enterprise Capitalism. Just picture perfect.","post_message":"Clinton says that despite his years of business experience, Trump is dangerous and \"shouldn't have his hands on our economy.\" What do you think about her comments?"},{"comment_id":"1482924058407143","commenter_b":"lol you're a joke. Dude I'm older than you! But thanks for the compliment!","commenter_a":"Are you serious???? I'm black and this is sooooo ridiculous!!! It is NOT racist! I hate Neegan more than I hate this shirt....because I don't hate the shirt...at all...actually I might buy it! #TWD","post_message":"People are accusing this The Walking Dead T-shirt of being racist — is it? yhoo.it/2kMGla0"},{"comment_id":"10154258956738352","commenter_b":"Congratulations. Amazing lady.","commenter_a":"Twins!","post_message":""}]
