[{"comment_id":"10156001387100354","commenter_b":"I would prefer you be hung, Stabbed, set on fire, tar and feathered, AND THEN DECAPITATED. SAD THING, Americans NEVER GETTING WHAT THEY WANT OR NEED!","commenter_a":"How do so many of these guys have zero brains when it comes to breaking the law. They are truly brain dead about this!","post_message":"How, again, did this guy break into the top 10?"},{"comment_id":"10154456212209060","commenter_b":"Have yall seen an uncircumcised vagina? Yikes","commenter_a":",,,,yea but have yall seen an uncircumcised penis???? Yikes","post_message":"If men can become astrophysicists or master carpenters, surely they can learn to wash? Campaigners are fighting the perception that the benefits of circumcision outweigh the risks"},{"comment_id":"10153070915541051","commenter_b":"Put her in the outhouse and lock the door.","commenter_a":"😕","post_message":"This woman's husband was buried under a particularly big pile of manure when police finally discovered him."},{"comment_id":"1754158708182258","commenter_b":"Rip officer...fly high... You will be missed","commenter_a":"Whoever is doing the laughing get off this page very disrespectful","post_message":"The funeral service begins for Detroit Police Sgt. Ken Steil. Watch along live as loved ones and fellow officers remember his life: Read more: @webpagelink"},{"comment_id":"10153767932239411","commenter_b":"Anna Tagintseva shut your mouth bitch","commenter_a":"I know those Chinese universities are bullshiting all the time and yet @username believed it. And someone believe that China will go against US with the help from Russia? Come on, China and US need each other, while Russia will have to stand back and watch.","post_message":"'The increasing pro-active position by China is built on increasing sophisticated and powerful military technology in China defense and military sector. This factor makes US increasingly worried.' - Xin Zhang, Research Fellow at East China Normal University. (Op-Ed)"},{"comment_id":"554679601385273","commenter_b":"Just look at that fugly face! Barf","commenter_a":"What an ugly dude!","post_message":"Of course Sally Kohn brought up white privilege..."},{"comment_id":"1655877784709346","commenter_b":"Oh god between him and Trudeau ? That's not a choice , it's a bloody disaster looking for a place to happen Are there no good political leaders in this nation It would be the Canadian version of Clinton and Trump , to be fair to her she's a lot smarter than Trudeau","commenter_a":"Funny watching all the leftards do the exact same thing they did with trump with labels and lies and thinking we won't have the same results!","post_message":"Kevin O'Leary called Justin Trudeau a \"complete incompetent.\" Read more: @webpagelink"}]
