[{"comment_id":"1131664770254026","commenter_b":"You should try to get one. Aiden needs a service dog as well.","commenter_a":"@username you need one!","post_message":"✔ Laundry ✔ Dishes ✔ Shopping WATCH: This service dog in training is wowing the internet with all the ways she helps her chronically ill owner @webpagelink"},{"comment_id":"442634665940047","commenter_b":"A phony through and through. All she cares about is herself and power","commenter_a":"Indeed","post_message":"ICYMI - Hillary Clinton an Expert at being Fake"},{"comment_id":"10153064490042483","commenter_b":"Funny @username nowhere in your meme is there a picture of the woman you would force to become an incubator.","commenter_a":"Conservatives aren't pro life, they are just pro birth. They defund welfare and unemployment programs, don't support universal heathcare, want to deport \"anchor babies\" and so on. They need to stop pretending they care so much for unborn lives","post_message":"\"The federal government and several courts have made clear that a state cannot kick Planned Parenthood out of its Medicaid program simply because Planned Parenthood provides abortion,\" said Susan Watson, executive director of the ACLU of Alabama."},{"comment_id":"1430173077011648","commenter_b":"Crazy lady!","commenter_a":"Vote Trump all the way to the White House. This country is a business and should be run by a businessman. We have seen what the politicians have done to this country. Trump was self-funded and owes no one. It is time we the people donate to Donald Trump so he is not forced to accept special interest money. I don care how rich he is, he can keep bleeding money, let help him. It should be the American people that Trump owes and not special interest. Go Trump all the way to the White House. Make America Great Again! All aboard the Trump Train! Take America Back from CAIR, MOVE ON, BLM, Muslim Brotherhood and Liberal Terrorist!!!!! Vote Trump, bring jobs to America. Vote Trump if you want to get rid of unfair trade agreements..Save our Country!!!!!!!!!!! Keep out the refugee terrorists!!!! Save our countries jobs!!!! And a side ...","post_message":"Gee, wonder why?"},{"comment_id":"10153414800625933","commenter_b":"Liars make me sick.","commenter_a":"John, you seem very busy these days, but who is governing Ohio at this time? Do you plan to reimburse the Ohio tax payers ? That would be the right thing to do . You have been eliminated for months. Get back to making Ohio great. Do the job your being paid to do.","post_message":"Let’s Get It Done."},{"comment_id":"1510580285648823","commenter_b":"She is amazing. Jill is a bad ass","commenter_a":"Margy White @username","post_message":"True confessions: What was I doing in Russia? Speaking out against Putin following the US into catastrophic war in the Middle East, and calling for a weapons embargo and #PeaceOffensive in the region. Check out the video of my full remarks: @webpagelink"},{"comment_id":"1418008091611056","commenter_b":"I bet you a thousand dollars her girls didnt eat that crap they served. Im also sure she herself never ate that crap. She had a full service crew of chef's preparing her gourmet foods 24/7.","commenter_a":"Lunch program? What lunch program? My daughter will never eat lunch at school so I have to fix it for her everyday. On the few occasions where she had to buy it she says it's terrible and she didn't eat it. They serve stuff like corn dog tots with tater tots total processed garbage that doesn't even taste good. What tF is so hard about giving them a piece of chicken on a wheat roll with a piece of fruit?? It ain't rocket science people.","post_message":"Michelle Obama's legacy is already unraveling..."}]
