[{"comment_id":"10155456952478797","commenter_b":"His mom was white you racist white hater!","commenter_a":"African american? He's interacial! His mother is white, let's not forget her!","post_message":"Honoring Barack Obama, the 44th President of the United States and the first African American to serve as president. bit.ly/2mfD3IE"},{"comment_id":"10158270376090381","commenter_b":"Wacky Woman!","commenter_a":"Perserverance! Thanks for keeping us strong!","post_message":"Last night, Majority Leader Mitch McConnell attempted to silence not only Senator Elizabeth Warren, but the late Coretta Scott King. It was a shameful attempt to stifle the thorough debate on President Trump’s nominees that the American people expect and deserve. I applaud Senator Warren and my Democratic colleagues in the Senate for fighting on behalf of the millions of Americans who have demanded that the next U.S. Attorney General be committed to upholding our most fundamental constitutional rights. In the battles to come, both in Washington and in communities nationwide, I urge my colleagues to follow Senator Warren’s lead—as she persisted last night, so must we. We do not have the right to remain silent."},{"comment_id":"542034032653843","commenter_b":"Dumb ass","commenter_a":"Right....looks who is racist Obama... You! Who is BSing Whom?","post_message":"Obama just told the entire world that we have racist cops. He has absolutely no respect for the hardworking people that make this country work. Do you agree is a complete embarrassment to our country?"},{"comment_id":"10155583130286509","commenter_b":". Unlike Obama, Trump has control of congress and can appoint to the Supreme court due to the opening. Obama never had that amount of power. Plus Obama was a moron. Trump needs to build that wall. Trump needs to build camps and round up all illegals that can be found. Put them in internment camps till they can be removed to their country of origin. Or just put them in prison like he said for 5 years if they come in the country illegally. We have our president now like the minorities had Obama.","commenter_a":"It is not Van Jones' job to correct people to take away their fears. It is the Trump camp's job to do so. Don't tell people when to feel afraid and when not. You have to make them feel safe and welcome. Donald Trump is the President now. Now he has to do his job for ALL.","post_message":"\"You need to back off.\" CNN's Van Jones exchanged hot words with a Donald J. Trump supporter who argued Jones ought to repudiate fears among protesters that a Trump administration would create camps for illegal immigrants. @webpagelink"},{"comment_id":"1254862731220863","commenter_b":"Take your wife to Russia like bernie sanders","commenter_a":"Communist piece a shit. That's what happened in chigago last night communism","post_message":"Bernie Sanders gave an epic response after Donald Trump blamed him for violence at his campaign rally."},{"comment_id":"10155874943040354","commenter_b":"Black scumbags do not matter !","commenter_a":"I'm sure Al Sharpton and his ilk will spin this as a racial injustice and Obama will write his family. Probably won't claim him as looking like his son as he's been there and done that. All of them are sick sons of bitches.","post_message":"Police say the 82-year-old did one thing that likely saved her life..."},{"comment_id":"1131895816845262","commenter_b":"husbands fault not the woman","commenter_a":"Is this Hilary Clinton? Always the women's fault, cause the man didn't know he was married.","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."}]
