[{"comment_id":"10154493195323132","commenter_b":"@username Do you believe everything that you read on the interwebs? And why are you so gung ho about defending Schumer? Or are you simply into fat chicks?","commenter_a":"Is anyone here a marine biologist? We have a beached whale on our hands!","post_message":"Amy Schumer, Kate Hudson and Goldie Hawn are the epitome of squad goals on their Hawaiian vacation."},{"comment_id":"10155306004950725","commenter_b":"Those girls are animals.","commenter_a":"Throw her Ass in Jail with the real Women, not the Kiddos.","post_message":"A 16-year-old girl has been arrested after a vicious fight with a group of girls at McDonald's, police say. Watch a video of the brutal brawl here------> @webpagelink (WARNING: Violent nature could be disturbing to some viewers)"},{"comment_id":"10152513756410927","commenter_b":"e is talking about his leader Satan","commenter_a":"Ha! The blind leading the blind. Schmuck. “This I say therefore, and testify in the Lord, that ye henceforth walk not as other Gentiles walk, in the vanity of their mind, Having the understanding darkened, being alienated from the life of God through the ignorance that is in them, because of the blindness of their heart:” Ephesians 4:17-18","post_message":"Obama says he has sought God's guidance in leading nation..."},{"comment_id":"10154392654096509","commenter_b":"Hotel California!!!!","commenter_a":"my prayers ...rest in peace","post_message":"Glenn Frey played guitar and keyboard and took lead vocal duties for the Eagles on tunes like \"Take it Easy\" and \"Tequila Sunrise.\" What's your favorite song from the band?"},{"comment_id":"1294378153962270","commenter_b":"Look in the mirror bitch","commenter_a":"I aint spending no money on this hoes lmao","post_message":"Blac Youngsta claims none of the strippers looked good! #WSHH #BlacYoungsta"},{"comment_id":"1267284936616307","commenter_b":"Figures that the media would just cover his Donald Trump comments but not on climate change comments.","commenter_a":"And igloos.","post_message":"Stephen Hawking issued a dire warning, but it wasn't about Trump."},{"comment_id":"1021715281216809","commenter_b":"Definitely Dan!","commenter_a":"We are witnessing the greatest attack on our American Democracy since Citizens United! The DNC has chosen Hillary Clinton to be their next presidential nominee, and is doing whatever it takes to silence the voice of the people. We cease to be a Democracy when the Party receives millions in funding from the same media corporations that report biased coverage in an attempt to deceive voters. We cease to be a Democracy when the Party takes deliberate actions to suppress voter turnout, turns away registered voters, and commits election fraud in Arizona and across the country. We cease to be a Democracy when the Party selects super delegates (many of which are Lobbyists) who refuse to the listen to voice of the people the are intended to represent. We cease to be a Democracy when the Party simply removes a candidate from the ballot in Washington DC! A vote for ...","post_message":"Every success by Bernie is met with a story or column or talking head whose message is “but he can’t possibly win.” That's the media refrain because the Democratic establishment can't conceive of the possibility Bernie will win. That's because they aren't listening to Bernie's message and its resonance among Democratic and independent voters (as well as many Republicans). They don't know how determined Americans are to reverse the increasing concentration of wealth and political power that are eroding our economy and democracy. - Robert Reich"}]
