[{"comment_id":"1574139022896040","commenter_b":"Put this animal to death!","commenter_a":"Yeah, good luck with that.","post_message":"The Attorney General is required by ethics regulations to avoid even the \"appearance\" of a conflict of interest. She has clearly violated this regulation. SIGN THE PETITION to join us in demanding her resignation."},{"comment_id":"1085651791446290","commenter_b":"I say shut them down. There are many clinics for health reason, but NOT abortions! We need to STOP abortions (murder)!","commenter_a":"health screenings,fine..but why do our taxes have to pay for birthcontrol??Tell me again, I don't understand....","post_message":"Americans want funding for women's health."},{"comment_id":"1148960128472164","commenter_b":"Beat the whore","commenter_a":"Ok idiot, lets say this girl had no idea he was married and after realizing how dumb you are, he leaves you bcz he knows deep down that he is to blame not the girl....","post_message":"A woman found out that her husband had been cheating. She grabbed three of her friends and tracked down the mistress. What she did next is something you have to see to believe."},{"comment_id":"2041329586093459","commenter_b":"@username , good God man, he is not even President yet....give him some time, will you??? SUDDENLY you all expect him To do miracles??? Rome was not built in a day. Was it?? Worry about these HIPPY KIDS making trouble....poor kids didn't get their way and now they have to riot!! Instead of. Being happy that CROOKED HILLARY is finally away from shaking down and stealing from donated money meant for the poor, and sooo much more , they RIOT!!! Go figure....stupid YOUTH. !!!! That is what kids get as a COLLEGE EDUCATION THESE DAYS!!!","commenter_a":"And it took Donald Trump to do it with practically no help from the Republicans at all. John McCain with Sarah Palin couldn't do it 8 years ago, Romney choked 4 years ago when he didn't even mention the Benghazi attack and coverup when it happened less then 2 months before the election 4 years ago. So, Trump took matters into his own hands and won the Presidency - practically all by himself when he was against all odds, while also helping to secure The House and The Senate...!!! The Republicans have no excuse now...!!! But one thing is for sure, the Republicans and the Democrats sure better know who the BOSS is now..! It's time to get down to business for America..!","post_message":"So now we have the House, and now we have the Senate, and now we have the White House -- and now we have no excuses. There aren't any excuses anymore. The Republican Party has been given the full reins of this government in this country, and there is a mandate behind it."},{"comment_id":"10153703496814087","commenter_b":"#Notwithher #FrackyouHillary","commenter_a":"Hillary is all about terminating babies","post_message":"“I want to say something about this, since we’re talking about the Supreme Court and what’s at stake,” Hillary Clinton said at last night's Democratic debate. \"We've had eight debates before, this is our ninth,” Clinton said. “We've not had one question about a woman's right to make her own decisions about reproductive health care. Not one question.”"},{"comment_id":"10153583021397434","commenter_b":"Get that bomb ass dick!","commenter_a":"I had to open up my decoy facebook just to be able to \"anonymously\" say that I've slept with at least 160 different men and have never experienced this.","post_message":"After fucking, while you’re still a tangle of sweaty limbs and heaving torsos, your partner--probably still inside you--looks deeply into your eyes and whispers a husky and sensitive “hey.” Why?"},{"comment_id":"10157682940820389","commenter_b":"Such bullcrap that she can get away with this!!!","commenter_a":"OF COURSE THEY DID....TWO OF AMERICA'S BIGGEST MISTAKES... WAKE UP AMERICA...VOTE DONALD TRUMP .....","post_message":""}]
