[{"comment_id":"10153215419029726","commenter_b":"She is a much bigger problem than wild Willy","commenter_a":"possibly the only reason she wants to be president is so that she avoids prison time.","post_message":"Are YOU Ready for Hillary? Which is her bigger problem... Benghazi, missing emails, Wall Street? @webpagelink"},{"comment_id":"10156077468780354","commenter_b":"She'll be worse then Obama","commenter_a":"We can all hope that she is 80% of the way to the Big House!","post_message":"Before a single vote is cast?"},{"comment_id":"10153061886448188","commenter_b":"Show this to Omuslim in the White House, and remind him how EVIL his Muslim Terrorist pals are!","commenter_a":"The Quran says for them to kill all non believers of Allah......the ones that do not are called hypocrites .....why would anyone say this is not Islam? Quran (9:73) - \"O Prophet! strive hard against the unbelievers and the hypocrites and be unyielding to them; and their abode is hell, and evil is the destination.\" Dehumanizing those who reject Islam, by reminding Muslims that unbelievers are merely firewood for Hell, makes it easier to justify slaughter. It also explains why today's devout Muslims have little regard for those outside the faith.","post_message":"We as a company have aired or released many horrible images in our short tenure as a media outlet, none of which have risen to the level of depravity of the images of Lt. Muath Al-Kaseasbeh’s death. We had chosen not to release these images out of respect for the victim, his family and his countrymen, but also because we do not wish to spread fear and the message of psychopathic killers. This morning, I, as the owner and operator of TheBlaze, have changed my mind. After looking at the images again, I believe it is important for the world to see them. We have been lured into a poppy field where we have fallen fast asleep as grave danger quickly approaches. It is time to wake up. This is the enemy of all mankind. Make no mistake, this is a global jihad and it has everything to do with ..."},{"comment_id":"10154136860436051","commenter_b":"She does crack","commenter_a":"Clinton and what is that obsessive sniffing","post_message":"Who won the debate: Trump or Clinton?"},{"comment_id":"1218923861503062","commenter_b":"I wonder if this woman realizes what a joke she is. Department of Justice my butt. She has ruined any respect she may have had from the American people. What she may not realize is the Clinton's would leave her holding the bag if it covered their tracks!","commenter_a":"We don't need Attorney Generals that don't represent WeThePeople and the truth.","post_message":"Loretta Lynch, Attorney General can't seem to get her story straight about Hillary Clinton. This is what it looks like when your career crumbles right in front of you. Let's get 2,000 SHARES to show that we don't need CROOKS in office!"},{"comment_id":"10153683930231323","commenter_b":"@username No, your country has still resposibilities coming from your good age of colonialism and be honest to your self: IS are nothing else than organised crime and don't be so stupid to believe, that an group of organised crime needs \"illegal immigrants\" to spread the business. BTW: find out where the largest number of historical artefacts from the middle east, coming with an unclear origin, are traded? Don't be surprised when you find out that it is London and you you can easily find out, that it is business of billionGBP earning. Why do you think IS is destroying historical sites? So, all this happens under the control of your government, right in your neighbourhood...","commenter_a":"The people were on their way and Germany take action to relief all surrounding countries, who where not able to cope with a minor percentage of the people floating their countries. Yes, it is not easy, but Germany helps a lot of people and countries and yes, it is a massive task, but we (you and me and our governments...) have to deal with it.Why? Because we are causing the situations, why the people have to flee and have seek for shelter. So, I am living in Hamburg, my borough is called \"Bahrenfeld\" and we have a polpulation 23.000 people. Currently we have 3.200 refugee living here. And I can hardly understand, why a country, which has caused and initilized a lot of the current wars in the middle east, in order to earn oil money ----NO---- to fight terrorism (hahaaa), refuses to take part in the resposibility...Yes, my dear ...","post_message":"“Sometimes the smugglers arrive in the middle of the night and drop underage refugees off at the service station. The police call my child protection officer at 3am, who has to go to them, and if no accommodation can be found, he often ends up taking them home with him.\""},{"comment_id":"590616211130377","commenter_b":"Let her go live in one then.","commenter_a":"Deluded to the point of madness","post_message":"Nancy Pelosi Has To Be The Stupidest Person To Ever Walk The Planet!"}]
