[{"comment_id":"10154220565880575","commenter_b":"This is why immigrants need to be vetted and illegals should be shipped out of USA. TRUMP/PENCE","commenter_a":"Sunshine patriots, you'll do as you're told.","post_message":"Mothers of slain children killed by illegals hold protest in front of Paul Ryan's home."},{"comment_id":"1649233105382359","commenter_b":"@username well it doesn't seem to be on the minds of the ones that are. If it was they might not have sex at that moment","commenter_a":"That is nothing to brag about. You should find some other talking points to criticize Trump on. Abortion should be the last thing on a 14 yr old girls mind.","post_message":"Actress Ali Wentworth: When Trump Won My 14-Year-Old Daughter Complained There’d be “No Abortions!”"},{"comment_id":"10153187094616636","commenter_b":"Typical Welsh comments !!!","commenter_a":"Hoog cheats by throwing himself to the ground in an attempt to get a South African player a yellow card or worse. Not a word of aplogy from the player, coach or former players. Why is it the Scots are such bad losers.?","post_message":"Gavin Hastings said the sight of Joubert leaving the pitch was \"the worst thing I have seen on a rugby field in a very long time\""},{"comment_id":"873173032819817","commenter_b":"Why are so many women that insecure? Come on...","commenter_a":"No thats called someone having mental issues lol","post_message":"Warning to all couples."},{"comment_id":"10154250068154749","commenter_b":"How does she get away with this rubbish?????","commenter_a":"Diane Abbot is a hypocrite of the first order, always trying to play the race card if the argument does not go her way. As for JC he's a dead man walking yes massive grass roots support but his own back benchers are actively plotting against him and most are preying for bad election results so they can stage a coup. He's lost big backers, even the labour red tops are Luke warm at best. And grass roots support doesn't transfer to the ordinary man and woman on the street who see him as a reactionary 70s throwback and apologist. Labour will either ditch it before the next general election or face annihilation and ditch him and her after.","post_message":""},{"comment_id":"10154831608750211","commenter_b":"Selfish whiner","commenter_a":"What a crock of crap. Just trying to get some attention and get noticed as someone \"special\". Whatever......his loss.","post_message":" don feel accepted in the White House. With the president having so many strong opinions and prejudices I believe certain people might feel accepted there while others won."},{"comment_id":"10153141821778352","commenter_b":"Fuck that!!! I will be in no way shape or form involved in any queer shit in my household!!!! Point blank period NO SON OF MINE WILL EVER BE A GIRL!!!","commenter_a":"I could never accept my son being A Gay!!!!! Hell naw I'm not raising no queer in my household !!! Goodbye go live ya life but not in my fuckin house!","post_message":"'We don't support that': Christian parents who were blamed in their transgender daughter's suicide note REFUSE to accept her female identity after she walked in front of truck, but insist they loved 'him'"}]
