[{"comment_id":"10153253749121800","commenter_b":"Heard this on 98 rock on way to work....halliarous!","commenter_a":"Masoud Jalali","post_message":"\"To be clear, a guy on CNN just said, 'Hey, if people are looking for news, I'm sure they can find it somewhere.'\" -- Jon Stewart"},{"comment_id":"999172976798392","commenter_b":"Corruption in the state department is at an all-time high.","commenter_a":"Where does obeying law fall in this action? Do you collectively feel above the law and justified in defying it? Perhaps a bit of prison time and being branded as felons for the rest of your miserable entitled life will bring you back to your senses.","post_message":"¯\\\\_(ツ)_/¯"},{"comment_id":"371959982974642","commenter_b":"@username, Pelosi sucks!!!!!!!","commenter_a":"Teddy, you little Canadian anchor baby, it's time for you and me to have a little heart to heart talk. Firstly, let's face the facts. The people have spoken and it's Trumps year. Now there's two ways you can go here. You can fight tooth and nail to the bitter end. You'll lose and forever be seen as the jerk who tried to thwart the will of the people. Your political career will be over! Or, you can drop out and get behind Trump. You'll be seen as the man who helped to reunite the party and defeat Hillary Clinton. Play your cards right and you could set yourself up for a top position in the Trump administration. You're a young man Ted. After a successful 8 year Trump presidency, you could be in position to be the natural heir. Remember your hero, Ronald Reagen ran against Ford for the ...","post_message":"LETS MAKE AMERICA GREAT AGAIN!"},{"comment_id":"10152822886591130","commenter_b":"SHE* isn't 'dressed up as a woman. She is a fucking woman.","commenter_a":"Hold on a minute here, it's make your mind up here time fella/gal or whatever make & model you wake up wanting to be today as others (me) do mind where you take a piss as kids use these toilets and we need to protect from people who don't even know what sex they are from one toilet visit to the next !!!","post_message":"\"How we go about our business is none of yours.\""},{"comment_id":"1129381677098530","commenter_b":"Leona Helmsley was the \"Queen of Mean\", The Donald is the \"King of Con\".","commenter_a":"No can't believe you still endorse her after her comments about your supporters. Trump used the tax Laws . Unlike Hillary who lies about everything. Her young daughter bought a 10 million dollars home while she says your young supporters live in a basement!!!!!","post_message":"So, Trump goes around and says, \"Hey, I'm worth billions, I'm a successful businessman, but I don't pay any taxes. But, you, you make 15 bucks an hour, you pay the taxes, not me.\" That's why people are angry and want real change in this country."},{"comment_id":"10152776226595047","commenter_b":"stupid anti Christians !","commenter_a":"Can't let them get away with this.","post_message":"General Craig Olson thanked God for his military successes, and asked for prayer for those being deployed at a National Day of Prayer event. Because of his public declaration of his beliefs, an anti-Christian group is demanding he face a court martial. This is outrageous. SIGN & SHARE the petition to fight back: @webpagelink"},{"comment_id":"1230909136991106","commenter_b":"👌 well done my counterpart.","commenter_a":"Ill leave this here.","post_message":"Sad, but true..."}]
