[{"comment_id":"967744473282082","commenter_b":"Hillary, american people need your talented and exposure,","commenter_a":"Hillary, is key to solving, american problems,","post_message":"What we’ve seen too much of in the last few years is a spate of people who have reached for a gun before they really figured out what was going on. They’ve been much too eager to use that gun—we’ve seen it with policing and we’ve seen it with civilians. With police, first and foremost, they need to be trained and held accountable and disciplined in a way that prevents the reaction that we’ve seen way too much of. And with civilians—a lot of these “stand your ground” laws need to be rewritten. If you have to defend yourself, OK. But look at some of the instances we’ve had—Trayvon Martin, and too many more. Nobody should want to create circumstances in which innocent, unarmed people are killed—either by law enforcement or by civilians wielding guns. We’ve got to figure out how to deal with that."},{"comment_id":"869514233108326","commenter_b":"Wendy please get an education","commenter_a":"And yet they are doing the same to the Palestinians","post_message":"'I could have faced a bullet for kissing Mengele's boots.'"},{"comment_id":"1086019278181113","commenter_b":"She's going to crush her opponent into Cheeto Dust. BYE ORANGE FELICIA","commenter_a":"BS","post_message":"Democratic presidential candidate Hillary Clinton will be speaking at an early voting rally in Cincinnati, Ohio."},{"comment_id":"1034820419922610","commenter_b":"Fuck her","commenter_a":"Oh please she has an easy life it's the soldiers and other people have it hard and uncomfortable not her","post_message":"Michelle Obama Claims Her Life Is More Difficult Than A Soldier’s. This is the most ridiculous thing I've ever heard. Are you offended by this?"},{"comment_id":"1689857144590196","commenter_b":"I say do it, and take it even further....stop immigration altogether until a proper vetting system is implemented!!!","commenter_a":"It is unAmerican and wrong to have different rules for people of another religion. Have we really come to this? We are a free nation of fearless people, this is an insult to our national character. Trump would use that fear to further his own short term goals and incidentally the long term goal of ISIS to drive a wedge between Muslims and the rest of the world.","post_message":"Republican candidates are set to take the stage tomorrow for the final #GOPDebate of 2015. So, what do Donald J. Trump's friends think of his proposal to ban Muslim immigration to the U.S.?"},{"comment_id":"10152820501225736","commenter_b":"And he signs new contract with Hair Club for Men.","commenter_a":"EEEEEEEEEE-HA!!!!!!!","post_message":"\"Due to the recent derogatory statements by Donald Trump regarding immigrants, NBCUniversal is ending its business relationship with Mr. Trump.\""},{"comment_id":"1190828210956634","commenter_b":"Ist: ENFORCE THE IMMIGRATION LAWS, forbidding businesses from hiring ILLEGALS & H1B workers; 2d: DEPORT THE FAKE MUSIM \"refugees\"; 3rd: BUILD THAT WALL!!! 4th: BEGIN DEPORTATION OF ALL ILLEGAL ALIENS! That's enough for the first day. Most of our problems can be solved just by ending ILLEGAL IMMIGRATION!","commenter_a":"RESIGN....","post_message":"GREATEST QUESTION: @webpagelink"}]
