[{"comment_id":"988010784567676","commenter_b":"If they dislike our ways so much ,WHY HAVE THEY COME TO THE USA? We all should be telling them to go back to the country they came from.","commenter_a":"Death to Islam. Ban Islam in the USA","post_message":"BOOM!"},{"comment_id":"1879681238919909","commenter_b":"And these kind of people are what supported Hillary. No concern for the law, just like her.","commenter_a":"Animals.","post_message":"“What’s happening to America?” said David Wilcox, as he showed his wounds inflicted by the mob. “You’re supposed to be able to vote in peace! It’s supposed to be part of our democracy. And what happened is, I vote for somebody, and I get beaten, robbed, and my car stolen, and I have no way of getting my wife to and from work safe anymore,” he told the Chicago Tribune’s news crew."},{"comment_id":"1159671620816281","commenter_b":"Why didn't you keep your promise and leave this country? Because you were so sure Hillary was going to win! LOL just please shut up! Get over it! Do you think it you keep going on &. On, things ar going to change? NOT!!!","commenter_a":"Ted danson probably gags thinking of his past. Yes,he used to do the deed with that😁","post_message":"Whoopi definitely gets what she has coming after she made this dim-witted attempt to insult Trump. She so deserves the humiliation. Let's get 5,000 'LIKES' to show that America wants \"The View\" CANCELLED PERMANENTLY! @webpagelink"},{"comment_id":"10154185935155779","commenter_b":"Minus the \"away\"","commenter_a":"Easy. U2. 9/11-victims' names scrolling through 'Where the Streets Have No Name'....that was not a performance, it was an event...every type of emotion, right on stage.","post_message":"There is no gig in music like the Super Bowl halftime show. You have 12 minutes to justify your legend. And with the Big Game set for this Sunday, what better time to rank the halftime shows from worst to best."},{"comment_id":"1790088647891885","commenter_b":"Lois did you listen to Hillary's speech . It sounded like she didn't know democrats policies or didn't take thousands from PP and believes in term abortion . Oh she forgot thAt, 🇺🇸Trump🇺🇸","commenter_a":"Hillary calling someone corrupt? Wtf kind of drugs is she on? Her and her so called husband are the biggest, most corrupt crooks ever involved in American politics!","post_message":"Donald J. Trump: \"Hillary Clinton may be the most corrupt person ever to seek the presidency of the United States.\""},{"comment_id":"10154038979953279","commenter_b":"Very simple by democratically changing the Congress /Senate, and local states governments with stateswomen /men that supports Bernie's and we the people's agenda. If you think outside the subjugated status quo box where you live it is possible to allocate the economic resources where we want it to be instead of for example spending trillions on wars and then passing a debt bill to we the people so we paid more to wall street. Simple enough. We can even pass legislation specifying since that Iraq war was illegal due to lies for greed we can write off that illegal debt and don't paid to wall street. Hmm just brain storming the possibilities once we change the Congress, Senate, and Bernie is our POTUS. Just follow THE PANAMA PAPERS.","commenter_a":"Hillary is Cynical. But we the people know who the real champion for the 99% working class wealth producers is. Only Bernie Sanders is genuine and legit to the people. #NotHer15 #berniesanders #latinosforbernie #bernieorbust #creditgoestobernie","post_message":"\"I’m supporting Bernie Sanders because he says no to fracking. I’m supporting Bernie Sanders because we do need a single-payer healthcare system that takes care of everyone. And that is not a pipe dream.\" - Rosario Dawson"},{"comment_id":"10153519405836680","commenter_b":"You are exactly right @username. It's so sad how ignorant and blind people have become. Saying we need illegal immigrants. Wow. Have you people not seen what's going on in Europe. No they need to come to this country legally people... Thank God we are gonna get it fixed this November. And that's how it will be. We will have a safer country. Trump2016!!!!!!!!!!!!","commenter_a":"Let us call it what it really is \"Bernie Sanders hugs illegal aliens at campaign rally.\". They are not undocumented immigrants because they have not followed the immigration process to get here. They are criminals. Justice needs to be dealt out to them.","post_message":"Bernie Sanders hugs undocumented immigrants at campaign rally."}]
