[{"comment_id":"10157648853630389","commenter_b":"I cannot stand this woman! She's an evil individual!","commenter_a":"I think Hillary is in for a very soul awakening! God did not choose and Call a man, Donald J. Trump, to lose! Donald J. Trump, answered God's Call, he did not have to do this! God is still in Control and this is God's Creation, not the Clintons, BHO, Soros, the big bankers, or any government! Look at all of the corruption & evil that has been EXPOSED TO THE LIGHT AND HAS BEEN GOING ON FOR YEARS & YEARS AND GOD KNEW IT!!! Life is like a tapestry, we see the underside, the messy side, but God sees the finished beautiful side and knows the reasoning behind every stitch. We have repented and we have asked God to save this country, ask and it shall be given! Deuteronomy 32:35 'Vengeance is Mine, and retribution, In due time their foot will slip; For the day of their calamity is ...","post_message":""},{"comment_id":"425439057626422","commenter_b":"Can you imagine an entire supreme court of Ginsburgs? Elect Hillary and we'll have it. She is a wretched witch that is a discrace to the court and she's not alone.","commenter_a":"She woke up cranky from her nap.","post_message":"It was completely inappropriate for Justice Ruth Bader Ginsburg to attack Donald Trump’s candidacy. This is not the role of the Supreme Court, and it serves as another reminder of what we’re up against in 2016. Help me fight for the Constitution and protect the integrity of the Supreme Court by joining my Fight for the Court campaign. www.fightforthecourt.org"},{"comment_id":"10153560622578984","commenter_b":"Gotta get around it some how. And drugs is my number 2 family problem, I HATE DRUGS!","commenter_a":"I do support this family, the only thing is I think all bakers and places that sell Wedding cakes need to go out of business or stop baking cakes, stick with pastries.","post_message":"The government is after this family for refusing to bake a cake for a lesbian couple's wedding. The way they just responded is absolutely perfect... Do you support this family?"},{"comment_id":"10152976962214205","commenter_b":"Yea, you're right. My comment is stupid, cause it was meant to be. And all you idiots commenting on my stupid comment as if I'm serious lol What's even more ridiculous is \"the police have to do their jobs\". So that's why some ppl get Burger King and walked out of a building (when they've killed 9ppl) and other ppl get choked to death for selling loose cigs, or get shot to death on site for having a toy gun (a 12 year old btw). Or others mysteriously die by being shot in the back while cuffed and in the back of a cop car. Yea cops totally just doing their job by the books. So yea, thanks for \"proving\" me wrong on a comment that was clearly not serious to begin with. You butthurt idiots can shut your dick holsters and relax.","commenter_a":"Prolly told him \"good job son, you played your role perfectly. You did a good job as patsy for your government. Now here's your complimentary Burger King as promised.\"","post_message":"Did you know the cops bought Dylann Roof Burger King AFTER they arrested him? WTF?!"},{"comment_id":"592558244260673","commenter_b":"The wall will at least stop them from driving & walking over the border.","commenter_a":"build the wall in Mexico","post_message":"Will Trump build the wall? When will riots end? DML addresses these issues in his Walk & Talk. Please watch and share, and if you are new to DML then we ask you give us a LIKE."},{"comment_id":"10153366169796336","commenter_b":"This chick is STUPID!!!!!!","commenter_a":"Now all the blacks who have been passing themselves off as white will come forward to get media attention!","post_message":"\"She's been white all the way up until 2011, when she started to change the way she looked with the clothes she wore.\" Rachel Dolezal's brother joined \"The Kelly File\" to address his sister's recent claims to reporters."},{"comment_id":"398269070297688","commenter_b":"Deport them back to their country. They donot deserve being here in USA. NO BENEFTS TO THEIR FAMILIES.","commenter_a":"This is fucking hilarious I fucking hate the prison system, just a cash grab for our taxes anyway I want to see more of this plz illegals do your worst I am laughing so hard right now","post_message":"This is not a good image for those who are trying to support the rights of illegal aliens."}]
