[{"comment_id":"10153672150997217","commenter_b":"Watch your tongue","commenter_a":"Most muslims hate gays yet have no problem seeing a murderous paedophile prophet as a role model for all mankind? That's f***ed up I'm sorry but it is.","post_message":"BREAKING: The suspect for the mass shooting at Pulse Orlando gay nightclub is 29-year-old Omar Mateen, the BBC understands. It is believed the US citizen was not on a \"terrorism watch list\"."},{"comment_id":"410359492488277","commenter_b":"It's simple women why treat guys like crap then want to be with him poor guy didn't get none for years and this happen f all the women in the world cause if he look like Enrique Iglesias you will give it to him if he was in the street another story","commenter_a":"10 year in jail for him, at this age, is life imprisonment.","post_message":"If convicted, Bill Cosby faces up to 10 years in jail and a $25,000 fine."},{"comment_id":"10154326925529586","commenter_b":"The same thing happened to me! A few neighbors found it funny to toss their firecrackers over the fence during some lunch party. We came home to find our poor baby scratched up and shaking - stuck between a rose bush and fence. Horrible horrible how lightly some people take this!","commenter_a":"I used to love July 4th until someone decided to throw firecrackers in the yard with my dog. She passed her fears on and my dogs are so afraid they huddle against me and shake. I dare not leave my home out of concern for what my pets go through.","post_message":"URGENT: Your dogs & cats can be TERRIFIED of fireworks. Keep them safe this #FourthOfJuly."},{"comment_id":"10153738689479032","commenter_b":"Thanks to those who muck it up for other people. Your stupidity is so appreciated. Stop breeding too.","commenter_a":"Maribel Maldonado","post_message":"Visiting Fossil Creek? As of May 1, you need a permit. @webpagelink"},{"comment_id":"10154783600566336","commenter_b":"Did the first plagiarize too?","commenter_a":"Trump talked about immigrants, but first he should deport his own wife who is not even american and come here illegally","post_message":"History Quiz: Can you guess the first?"},{"comment_id":"10153607443456130","commenter_b":"She is a fucking war criminal.Are you guys fucking high?","commenter_a":"I hope when this all over H.A. Goodman writes Hillary Clinton a thank you letter, because writing about how bad he thinks she is regardless of the facts is basically his entire career.","post_message":"\"The only leading candidate in 2016 (Ted Cruz, like Trump and Clinton has a negative favorability rating) with positive favorability numbers is Bernie Sanders. Think about that for a moment.\""},{"comment_id":"779312755503344","commenter_b":"How about in the best interest of the Muslims, they don't belong here.","commenter_a":"why do we need them here??? what benefit are they to America??? wtf....","post_message":"Is Paul Ryan in our country's interests?"}]
