[{"comment_id":"10154081618264087","commenter_b":"There's nothing wrong with her we all saw her open a jar of pickles","commenter_a":"Selfish move since her so called Pneumonia is very contagious . She was in a crowd, she hugged a small child. Not a good thing when you have Pneumonia.Just another lie, how can you believe anything the Clintons or their Clown say.","post_message":"\"I think it shows that she's not one who likes to call in sick.\""},{"comment_id":"943252975710162","commenter_b":"I feel like singing. We say grace we say ma'am if ya ain't in to that we don't give a dam. Were from north california and south alabam and little towns all. Around this land. But on a serious note. Being politically correct has made our country weak. Made our children bad and taught them mom and dad will save me no matter what. And yes I do support trump. I'm against illegal immigration and gun control.","commenter_a":"If she would have been taught respect for authority at home this wouldn't have happened true thug trash.","post_message":"Some reasons why Officer Ben Fields should be fired immediately."},{"comment_id":"1774184492816291","commenter_b":"@username racist idiot.","commenter_a":"NO WAY! No one else should be added to Mt. Rushmore, but especially not Obama! There are a lot better President's that could have been added, but not him!","post_message":"Obama's Face To Be Inserted Into Mt. Rushmore. Don't mess with this national monument. Do you think Obama's face does not deserve to be up there?"},{"comment_id":"1734008936814080","commenter_b":"Kill them all with the wall","commenter_a":"Now time to sue the ones that let this happen","post_message":"Unacceptable..."},{"comment_id":"1558222467532092","commenter_b":"Oh, oh. Is this were the Kiju come from?","commenter_a":"And what will happen if we try and remove it? It will cause all kinds of movement in the earth's crust - aka DEVASTATING EARTHQUAKES!","post_message":"It's as much as 1,000km down, a third of the way to Earth's core."},{"comment_id":"10153514692996135","commenter_b":"No other president has lived on the \"people's money\" like obama has except maybe the clintons ! They have all had their homes before they got elected and actually used them for \"vacation\" time etc. among other things ! If I have to tell you you must have been asleep for the last 7 1/2 years !","commenter_a":"Pretty good sized house for making pocket change for 8 years. It is funny how all the poor people he was supposed to help are still living on the streets and in the slums of the city ! But the scum always rises to the top ! ! !","post_message":"Check out these photos."},{"comment_id":"10155009134559411","commenter_b":"So why can't they do the same over here when the terrorists return","commenter_a":"Danes are fucked-up in the head except her. Brave and lovely lady ! You should run for whatever kind of Governmental election and you`d do very well. All the best to you .","post_message":""}]
