[{"comment_id":"10154807734390115","commenter_b":"Marcia, Dont insult the neanderthals by comparing them to prolifers. 😂","commenter_a":"Wow, some one just said men cause pregnancy! Considering it take two haploid cells to make a child.","post_message":"LIVE: Planned Parenthood supporters hold a rally outside the St. Paul, Minnesota, headquarters alongside Planned Parenthood protesters."},{"comment_id":"10153484638827507","commenter_b":"Whining lil Bitch!","commenter_a":"Activist farmers? REALLY?! They got time for that shit?! I have a better idea, STOP suckling from the federal ethanol teat, get back to your damned fields, and grow the crops that feed the people!!!! I hope that you make a fortune, the HONEST way, and keep your damned MORONIC racial political opinions to yourself!","post_message":"This is important."},{"comment_id":"626305930908697","commenter_b":"@username Yeah, those toddlers with guns are out of control right now.","commenter_a":"I blame Obama and Bush, Bill and Bush snr for forever labeling all Muslims as terrorists . they didnt know that by doing so they created further hate for Muslims in america and this is the result","post_message":"Kim Kardashian West made her opinion known (via Daily Mail Celebrity)"},{"comment_id":"10153542197218984","commenter_b":"This wouldn't be my daughter. First, they are in your country not theirs. They need to assimilate. This is why Muslims are taking over Europe. Read the book, \"While Europe Slept!\" Once we get a Christian president in the USA, the Muslims here will go back to their cubby holes. The Muslim president we have are giving them a very false sense of security.","commenter_a":"Unbelievable. They don't want to follow American customs, go back to wherever you came from.","post_message":"This school just ordered parents to make sure their daughters made Muslims happy in a sick way... this is full-on surrender. Spread this story... your children's school could be next!"},{"comment_id":"10152775475131045","commenter_b":"Yes, don't nobody want to mess with this grandma about her grandchildren.","commenter_a":"As a grandparent I cannot Fathom how you could do this. I would protect my children and grandchildren with my last breath","post_message":"Breaking news out of Etowah County tonight. A jury found Joyce Garrard guilty of capital murder in the running death of her 9-year-old granddaughter."},{"comment_id":"1207405515987329","commenter_b":"HappyBirthday, Sir, \"It's one more candle and a trip around the sun\" !","commenter_a":"Happy Birthday Dr. Carson!!!","post_message":"#keepcalm"},{"comment_id":"10156548921815725","commenter_b":"Shameless lady you are shameless","commenter_a":"Can you only imagine this family in the white house! WOW They will bring back the class that our first family has been missing for the past 8 years.","post_message":"Thank you Ivanka Trump for the kind words. I am very proud of the role model you are for so many."}]
