[{"comment_id":"10152876050286680","commenter_b":"@username is a RACIST!","commenter_a":"It's amazing how anyone like the ultimate pre-millennial distributionist, Neocon, evangelical, can spout his bilge and people think he's accomplished something. If Cruz is the best this nation can do, we are done. We don't need pontificating, and pandering to Christian values. We need leadership, a complete change in course to get our government working for the people again. I don't see it happening. Cruz belongs at a shatuaqwa tent, not the Oval Office. He cost us 24 billion in a phony shut down, could care less about health care for the middle class or poor, voted against Veterans benefits increases and VA spending. He's a charlatan, and the Elmer Gantry of the GOP.","post_message":"Ted Cruz killed it at the conference of social conservatives. And Marco Rubio fell flat."},{"comment_id":"10152573528821717","commenter_b":"Greg Abbott in Texas! POS!","commenter_a":"He really is quite the Gov, is there a secret contest between him and Walker to who can screw a state more?","post_message":"Click here to follow LGBTQ Nation on Twitter: lgbtqn.at/tw"},{"comment_id":"1532736620362438","commenter_b":"Cool ! I am sure he wants no more illegals!","commenter_a":"Build the wall and lock your self in there","post_message":"Donald Trump speaks live at Indiana State Fairgrounds. For a close-up view, watch our stream on our website: @webpagelink"},{"comment_id":"10155835827900615","commenter_b":"About damn time they got these creeps off the air!","commenter_a":"Unfortunately another network will probably pick them up.","post_message":"BIG BREAKING NEWS –"},{"comment_id":"1157956670923761","commenter_b":"No can't be true!!! Germans wouldn't let that happen!!","commenter_a":"God help us ALL","post_message":"Goodbye Germany!"},{"comment_id":"799197103604200","commenter_b":"Um Death, that's a No fucking brainer","commenter_a":"He needs to be in front of a firing squad. He appears to be full of racial hatred.","post_message":"BREAKING: Black Lives Matters Shooter Kills 7, Wounds 30 [VIDEO]. Things are getting out of control. They need to be stopped. What do you think his punishment should be?"},{"comment_id":"689911851133407","commenter_b":"white trash...","commenter_a":"She needs never him also never to have children ever again","post_message":"This man repeatedly beat his wife's 5-year-old and would even send videos and pictures of the abuse to his wife. She refused to step in and both joked about beating and killing the girl. Well, a judge just decided what their punishment will be. Was justice served?"}]
