[{"comment_id":"10152867504581336","commenter_b":"What a ugly woman she is","commenter_a":"This is what Islam is all about........ @webpagelink","post_message":"Ayaan Hirsi Ali has something in common with the #CharlieHebdo editor murdered by terrorists in Paris: She is also on al Qaeda’s death list. She spoke to Megyn Kelly tonight on 'The Kelly File.'"},{"comment_id":"494539450746362","commenter_b":"one ugly woman","commenter_a":"Cruz started this slanderous crap and it backfired on him. But he is still trying to blame Trump for a rags publication. But he's right about one thing, we don't give a shit so he can shut the hell up about it. Trump has already moved on.","post_message":"Carly Fiorina accused Donald Trump of being a serial philanderer. Do you think there's any truth to it?"},{"comment_id":"1301129679938665","commenter_b":"Would it be ok if you calmed your titties and stopped being such a butthurt faggot?","commenter_a":"(Cough) tarnak farm friendly fire incident (cough)","post_message":"Sometimes it's not the enemy you need to worry about. ~Will"},{"comment_id":"977904432246897","commenter_b":"She is an EVIL woman an not sure why she isn't in JAIL @username!","commenter_a":"Who is that masked woman?","post_message":"It's a very simple question: “Have you seen those very, very controversial videos?”"},{"comment_id":"10152691933545950","commenter_b":"You look like a crooked bitch","commenter_a":"Yeah and what they are going to do give him the death penalty.....dam sure won't let him walk like they do those crooked a** cops","post_message":"A suspect has been arrested in the shooting of two police officers in Ferguson, Mo."},{"comment_id":"10154986550662767","commenter_b":"@username DO SOME RESEARCH, BITCH!","commenter_a":"I hope he meets a terrible demise. Like I am talking, Isis style, execution. In high definition, with fabulous audio. Now, I would read THAT book, for sure. I wish nothing but the worst, to this radical islamic Kenyon born, Isis daddy! I wonder what chapter of the book describes Michelle, peeling off sweaty duct tape, and revealing the SCHLONG, that MADE THE FREAK BATHROOM BILL? Trump is wiping any, and everything, this TERRORIST has done. #HeDontMatter #GhostPresident","post_message":"Obama is widely expected to get the most lucrative contract ever for a post-presidential memoir."},{"comment_id":"10153783532251336","commenter_b":"You drug addicts are so jealous that it went to the police station. I will say it again. I'm glad it went there. get yourselves off the streets. IDIOTS!!","commenter_a":"Glad it went to the police station. Keep it off the streets!","post_message":"Officers wrote in a Facebook post, \"If you were expecting these packages and would like to claim them, please come to Police Headquarters.\""}]
