[{"comment_id":"1409547482430213","commenter_b":"I will cut that bee-och","commenter_a":"And your boo Jennifer","post_message":"WE CANNOT HANDLE THIS."},{"comment_id":"1180596495393685","commenter_b":"We ain't going to miss you don't let the door hit you on the way out","commenter_a":"He accomplish nothing but racial tension","post_message":"Here is how Americans feel about Obama as he leaves office. Are you proud of what he accomplished for our country?"},{"comment_id":"1737156569841341","commenter_b":"Me too, streamed. He handled disrupters well.","commenter_a":"Loved it, not like being there but watched it live. Trump you are predestined to be our next President.","post_message":"I LOVE YOU NEW YORK! Thank you for a terrific night, ALBANY! LETS GET OUT & VOTE TRUMP next Tuesday, April 19th -- and lets WIN, BIG LEAGUE!"},{"comment_id":"10153519153652042","commenter_b":"Men go crazy over some pussy..smh","commenter_a":"Men gon wild..smh","post_message":"WANTED: This man allegedly shot the mother of his children twice in her face, police say."},{"comment_id":"10154831608750211","commenter_b":"Selfish whiner","commenter_a":"What a crock of crap. Just trying to get some attention and get noticed as someone \"special\". Whatever......his loss.","post_message":" don feel accepted in the White House. With the president having so many strong opinions and prejudices I believe certain people might feel accepted there while others won."},{"comment_id":"1826145551000226","commenter_b":"What the hell are they trying to accomplish??? They are so delusional... and if he is not your president get out!!! Christianity went out the window when we put a Muslim in over 8 yrs ago...","commenter_a":"If you dont like it move up north.free everything up there","post_message":"Anti-Donald Trump protesters marched downtown Denver Thursday night. (WARNING: This was a live feed and there may be profanity)"},{"comment_id":"1005484162805096","commenter_b":"That only applies to people who follow invisible friends.","commenter_a":"With all due respect I won't be taking advise from any Catholic leader when it comes to kids and sex. Religion does not, ever dictate what I do or my children do with their bodies.","post_message":"\"While the vaccination program is not inherently wrong, parents need to make an informed decision and communicate it in a way that can serve to strengthen their child in the virtue of chastity and reinforce her appreciation of abstinence as the only truly healthy choice.''"}]
