[{"comment_id":"1562788604027088","commenter_b":"Time to block all idiots. Bye @username.","commenter_a":"Ohh come on!! You cannot compare between them!!seriously!!! REAGAN!!!! And you want to know why? Because he was for \"We the people\"!! Hand down!!! Climton signed NAFTA.... Huge disaster for our country!!! And please do not get me started on Hillary!!!","post_message":"Who was the better president: Ronald Reagan or Bill Clinton?"},{"comment_id":"1007328145956900","commenter_b":"Then take your ass back to england and leave all the money you made from American box office sales.","commenter_a":"Then go home.","post_message":"Well, that seems a bit over the top."},{"comment_id":"10152532301590927","commenter_b":"In Mexico, illegal aliens trying to take up residence, jobs and asking for free healthcare are arrested, put on a bus and taken to the border to be dropped off without a second thought. If you're here in the United States illegally, you deserve to be arrested and shipped back to the border of the Country you originate from.","commenter_a":"Liberal bs.","post_message":"And the immigration debate gets personal again!"},{"comment_id":"10157350648655354","commenter_b":"Even if this woman is a prostitute...does that make it OK for the \"boy's club\"?????","commenter_a":"Wasn't that long ago if a girl did this it wasn't bragged about. It was an embarrassment to herself and family. I'm not that old and I think it's disgusting, and she should be cited for it.","post_message":"+++SHOCK+++ OAKLAND POLICE SEX SCANDAL WIDENS... WATCH:"},{"comment_id":"721943014570974","commenter_b":"lol bitches just saying the same shit to get pity and money","commenter_a":"Oh I bet she's a 'liar' too. So many baseless accusations that all sound exactly the same from people who never knew each other. Amazing.","post_message":"A protest was planned at the event."},{"comment_id":"10152817810411636","commenter_b":"Hmm yes thats the trouble with war..it creats unstable countries which then lets the door open to yet more evil!","commenter_a":"Don't forget he got rid of Saddam Hussain who was committing genocide to thousands of men women & children..on alnost a daily basis!","post_message":"Surprise, surprise"},{"comment_id":"982783361781141","commenter_b":"Agreed but those who think she is a liar and a criminal probably won't be swayed regardlees. I think those \"on the fence\" folks will be the factor in the next election not the lemmings who accept whatever is feed to them. My optimism is shaky but I'm hopeful.","commenter_a":"I say, keep it up. Most people will see this for what it is .. a transparent attempt to stop Hillary from becoming President. Anyone who watched the hearing knows she was poised and presidential unlike the GOP committee members. Gowdy was an unknown laughing stock but not he's a famous one.","post_message":"In trying to save his committee and his reputation, Trey Gowdy is now saying that Hillary was the whole problem, rather than admitting that this 'investigation' is a sham. What are your thoughts on his accusation?"}]
