[{"comment_id":"481790668675893","commenter_b":"GET THIS TROUBLE MAKER OUT OF THIS COUNTRY ....BEHEAD iSLAM","commenter_a":"Now that is one hell of a costume","post_message":"ARREST HIM!!!!!!!"},{"comment_id":"1813691558875997","commenter_b":"FU lying bitch","commenter_a":"She's fill of crap","post_message":"Hillary Clinton says people are \"concerned\" by Trump's \"divisive rhetoric\" and he needs to be stopped \"conclusively.\" Is she right?"},{"comment_id":"10154906449059657","commenter_b":"@username, no pics of yourself on your fb? why? you one of those fugly women trump wont touch? or maybe 1 of the low enducated he loves so much for your vote? poor liberal feminist, no body wants you.","commenter_a":"Yes, we all know that. It came from Rubio....why does the media always think that people are complete idiots? We can read, you know. There are tons of legit sites to go to, besides mainstream propaganda sites....","post_message":"Contradicts what his boss is saying..."},{"comment_id":"781508608584844","commenter_b":"Problem is giving amnesty to the ones here only perpetuates the problem. The next ones to jump the border will believe they will be given amnesty and so on and so on. Companies employing illegals need to be punished and no freebies, IE entitlements to non citizens.","commenter_a":"Do the house republicans have a plan to actually fix the problem? I know the tough talk is to \"just send them all back\" but those aren't plans. Sure wish yall had answers to problems instead of continuing this political theatre.","post_message":"Last night, a federal judge issued a preliminary injunction that effectively blocks President Obama's unilateral executive actions on immigration. The magnitude of the President's executive overreach on immigration cannot be ignored. The House passed legislation to stop the President's unlawful plan, but Senate Democrats will not even allow it to be debated. It is my sincere hope that Senate Democrats see this legal action as a wakeup call and let the House bill be considered in the Senate."},{"comment_id":"10153309975398128","commenter_b":"Rich girl with bad credit","commenter_a":"Let us all shed a tear for the rich girl...","post_message":"Even the daughter of the CEO of the largest U.S. mortgage lender found it hard to buy a home in one of the country’s hottest housing markets."},{"comment_id":"10153711983118445","commenter_b":"Better take a look in the mirror you ugly bitch.","commenter_a":"Trump is a pig","post_message":"#Pot Matters: Trump on Drugs"},{"comment_id":"947825155333866","commenter_b":"..i got 99 problems but a bitch ain't one","commenter_a":"Wax off wax on Daniel son !!!!","post_message":"This can't be real"}]
