[{"comment_id":"574728392714767","commenter_b":"You should be worried about all of these weekly race riots, terrorist attacks, and minority crime. All three of those factors are why Trump will win. People do not want a third Obama term, which is what Hillary offers. Why do YOU, white person support the Democratic Party, the party that hates you, and legalizes racial discrimination against you? You are like those Jews in 1932 Germany who supported the Nazi Party. You both follow the political party that calls for you demise.","commenter_a":"What I'm worried about is Mr. Reality TV turning what should be a serious debate into another stupid episode of The Apprentice, and the media not giving a damn because it makes for good ratings ... and then our dumbed-down electorate lapping it up.","post_message":"Tonight debate between Hillary Clinton and Donald J. Trump may be one for the ages. But history shows it not the great arguments we remember, but the zingers and gaffes."},{"comment_id":"1703284416593951","commenter_b":"Cruz pussy fake!","commenter_a":"Not true and you know it.","post_message":"Ted Cruz isn’t tough on immigration. He stood up for amnesty, not for Americans. President Trump will be the tough leader that America needs. #MakeAmericaGreatAgain"},{"comment_id":"10152883601267452","commenter_b":"cat gets hired and I can't as a college graduate.","commenter_a":"Miriam Salinas Lupita Mary Reyes","post_message":"A startup company in Romania has hired a cat as their new communications manager. @webpagelink"},{"comment_id":"1801403630131591","commenter_b":"WHEN SHE STEALS THE HAITIANS FOR HER DAUGHTER' S WEDDING, GOD SAVE AMERICA !! LOSER CRIMINAL HITLARY Nutjobs!!","commenter_a":"It feels like Hunger games in here with all the trash talks and the media coverage ... May the odds be ever in your favor ma'am","post_message":"Share this if you know someone who needs to see it. hillaryclinton.com/locate"},{"comment_id":"10154065483921770","commenter_b":"Welfare mothers make better lovers","commenter_a":"So does America. America doesn't revolve around the Clintons as they think it does . America is sick of them","post_message":"Even MSNBC is sick of hearing the Clintons' excuses: \"Seriously. Nobody cares. The game’s over. They lost.\""},{"comment_id":"945496635572234","commenter_b":"She is selling us out to the Arabians","commenter_a":"Butcher of Benghazi","post_message":"WATCH LIVE: Hillary Clinton addresses a crowd in Miami to talk Zika virus"},{"comment_id":"10153168898035950","commenter_b":"Says the jaded soul. We still love you.","commenter_a":"He really thinks his opinion really matters. I hope and pray to God he loses really bad so he can get off his arrogance. He is a very insecure man. You can see how he talks and communicates his body language very insecure man. His life is a big lie and is willing to say what it takes to take the country down. Amazing some coat see right through him. Must not be very bright people.","post_message":"The secret to real estate mogul Donald Trump's popularity in this election season has eluded pundits, pollsters, the Republican establishment, and really, everyone else. \"Honestly it's my looks,\" Trump said before a rally in Atlanta on Saturday. \"I'm very handsome. That's the only thing I can think of right now\""}]
