[{"comment_id":"987975737904514","commenter_b":"obitch isn't happy unless she's ruining things for chidren","commenter_a":"She has no Constitutional authority at all...why do we allow her interference in our schools, homes and communities?","post_message":"Michelle Obama wants to BAN HALLOWEEN!"},{"comment_id":"10153013319096336","commenter_b":"Alison, your a sad sad little mind young women. I sure hope you're raising your children better than you. SMDH #m0r0n #Gruber #StickAndStones #TruthHurts #ByeBye #LordGiveMeStrenthFromStupidPeople","commenter_a":"I knew as soon as I heard it was a \"produce truck\"","post_message":"\"A brush of death definitely came over me.\" – passenger Joel Bingham As more details emerge in a California train derailment that left dozens injured, investigators say the truck involved was not stuck on the tracks."},{"comment_id":"10154931623678812","commenter_b":"Everytime i check most people that like trump are not from the United States like yourself from Australia you moron","commenter_a":"Trump is much more liked on all social media then Clinton the media is clearly lying with these polls","post_message":"Hillary Clinton has vaulted to a double-digit advantage in the inaugural ABC News 2016 election tracking poll, boosted by broad disapproval of Donald J. Trump on two controversial issues: His treatment of women and his reluctance to endorse the election’s legitimacy."},{"comment_id":"838151202944602","commenter_b":"Perhaps she is trying to prove that while she is a Loser at every turn...she is no quitter. She enjoys Losing!","commenter_a":"Why do these people waste money to this degree ??? She's got no shot not even remotely possible . I'm just sayin ....what is the purpose of this ???","post_message":"Her presidential campaign just went down in flames."},{"comment_id":"491909840999596","commenter_b":"These are dangerous ragheads. I say,get them out if our country","commenter_a":"They want muslims areas fine we should have MORE NON-muslims areas!","post_message":"A Texas shopping center posted a sign that have Muslims outraged. It's about time someone stood up to them, we support them. Do you support their stand against Muslims?"},{"comment_id":"10154380784584877","commenter_b":"And this lady is Exhibit A.","commenter_a":"Maybe way back in the day... Im not trying to be funny but women of a certain background look good till about 35 and then start to look haggish","post_message":"People are still coming out of the woodworks to stake their claim on Prince's estate."},{"comment_id":"1100335149996537","commenter_b":"White people crossing the border are rapist and murderers","commenter_a":"I wish there was some way for me to give him a lift to Mexico","post_message":"Happening right now, police in upstate New York are going door-to-door, hunting for one remaining escaped prisoner from a maximum security prison. The two escaped nearly two weeks ago. The other was shot and killed by police earlier today. Much more tonight at 10."}]
