[{"comment_id":"10153802989025927","commenter_b":"If you are here legally you have nothing to fear, stop listening to liberals who pander fear...If you are here illegally than yes, you might wanna vacate before being made to leave...This is not a hard concept, it's quite simple, if you are here illegally leave and immigrate back legally, if you are here legally ...What are you worrying about?","commenter_a":"If these people want to engage in disrespecting this country by burning the American Flag and demonstrating allegiance to another the authorities should round them up and deposit them in that country they love so much. This is getting to be far far too common and needs to be stopped. They can go to these countries they love so much and demonstrate and destroy things there","post_message":"PROFESSOR: am getting many heartfelt notes from students who are in shock over the election returns and , rightly or wrongly for their families ..."},{"comment_id":"10154609834091336","commenter_b":"I wonder where the laptop and hard drive went?","commenter_a":"Was there ever a doubt Hillary could be trusted. She can't even tell the truth about being sick. She's totally unethical and should never be allowed anywhere near the white house","post_message":"\"Mrs. Clinton delegated her legal security obligations to others. Those obligations to protect official Americans overseas, and especially in Benghazi.\" Gregory Hicks, the former Deputy Chief of Mission for Libya in Hillary Clinton's State Department, said he believes she cannot be trusted with our national security."},{"comment_id":"682546678578123","commenter_b":"Historical facts, not rumors, not hearsay just plan undeniable facts. (This is just a small percentage of a much longer list ) Of the two candidates running for president... Only @username was caught lying to congress. Only @username was fired from a job for being unethical. Only @username deleted 30 some thousand emails after she was ordered to hand them over to the Fed. Only @username had that same computer wiped clean by professionals. Only @username got the rapist of a teenage girl off on rape charges then laughed about it. Only @username lied to the American people about Benghazi. Only @username lied to the American people about her emails. Only @username lied about being under sniper fire. Only @username lied about lying to the American people. Only @username was involved in \" Cash Cow \" Only @username has a long list of scandals. Only @username nationally belittled her husband's ...","commenter_a":"If you hate her so much why do you sad feckers bother to be here? And have you actually looked at Trump? The rest of the world are scared shitless that he'll get in. Oh, apart from Russia.","post_message":"Born before women could vote, Ruline just cast her ballot for Hillary in Iowa today. Join her: IWillVote.com"},{"comment_id":"1778254899059301","commenter_b":"Someone take care of Bernie so Lizzi shuts her piehole, please.","commenter_a":"Lester Holt seems to be giving Hillary longer time to speak than Donald!!","post_message":"TheDC presents the first debate between Hillary Clinton and Donald Trump. Starting at 9:00PM ET."},{"comment_id":"10153533383913145","commenter_b":"Ur an idiot. I blame your parents for that!","commenter_a":"I blame Obama for this guy.","post_message":"A Kissimmee doctor accused of sexually battering a patient could reopen his practice today. If he does so, it will be with some restrictions. A live report coming up at 7 a.m. on Eyewitness News This Morning on TV27 WRDQ."},{"comment_id":"499497803543925","commenter_b":"That shady bitch, I would never go to her freaking dinner!","commenter_a":"Thank You patty for doing the right thing .","post_message":"Patti LaBelle Finally Admits James Wright Chanel’s Video Increased Pie Sales, Invites Him to Thanksgiving Dinner [Video]"},{"comment_id":"10154042161636910","commenter_b":"USA Vets, homeless, the disabled! All of our own meaning legal USA citizens need to be taken care of FIRST. That's what we pay into. Get rid of who is faking it also.","commenter_a":"9th Circuit Court of Appeals issued a decision backing an earlier decision by a federal district court judge in Washington State that put President Trump national security Executive order affecting seven countries that harbor terrorists on hold. Activist Judges intruded into areas reserved by the Constitution powers which unambiguously gives constitutional powers to the President. That is why the 9th Circuit ruling is so fundamentally wrong by assuming the power of the President. It is the 9th Circuit that violated the Constitution under the Separation of Powers with its ruling. The fact is that President Trump clearly has the constitutional and statutory authority to issue this order. It is clear: radical Islamic terrorists are at war with America. President Trump order is a proper and constitutional way to protect America. Again, the directives contained in the President Executive Order are closely tethered to discretionary powers vested in the Executive Branch ...","post_message":"A MAJOR SETBACK FOR PRESIDENT TRUMP: The 9TH Circuit Court of Appeals has ruled unanimously against reinstating Trump's travel ban. Do you agree with the ruling? @webpagelink"}]
