[{"comment_id":"602980583159868","commenter_b":"The majority of these people have never seen much less used a toilet. The do it everywhere at any time. It's sickening besides disgusting and a health problem. Expect to see toilets broken or destroyed in bathrooms from now on.","commenter_a":"Another cost to be added to culturally incompatible immigration","post_message":"Public restrooms are going to get an unusual addition due to all the immigrants coming in. The reason for the change will make you sick."},{"comment_id":"1328476607175126","commenter_b":"Lachy are you mad?! Let's do the gym like this next year! A Christmas wonderland","commenter_a":"@username Lachy Munro","post_message":"You think you love Christmas? This couple has more than 100 Christmas trees in their house."},{"comment_id":"10156149703965294","commenter_b":"I'd take her dang license and make her walk because she is so dang stupid!!","commenter_a":"He was doing his job,she was in the wrong ,51 in a 20 school zone.she should have been arrested.feel sorry for the safety of the kids.","post_message":"At first, she pleads for mercy: \"Can you give me a warning please?.... I have so much frozen food in the car.\" But, when the deputy walks to his car and comes back, her attitude changes completely:"},{"comment_id":"10154909768331509","commenter_b":"The World knows Obama and Hillary have failed us.","commenter_a":"Trump might use be them, but Hillary will email them to someone..","post_message":"The U.S. president has the power to order a nuclear strike anywhere in the world at any moment -- so choose your next leader carefully, America. (via CNN Opinion)"},{"comment_id":"899262110108885","commenter_b":"So Damian... You too... Just bAck up bitch .... READ THE 4TH AMENDMENT !!!!","commenter_a":"I saw this video when it first came out. During the struggle the kid mounts the cop and beats his face in.. Consistently , cop struggled and shot him. Tall goofy for this one. Watch the full vid , kid is a douche asking for trouble","post_message":"\"I don't have a weapon..\" -- Some of Deven's last words. He was shot 7 times by a cop. Get RISE OF THE WARRIOR COP for free: @webpagelink WARNING: This video contains graphic content. The full story has finally been exposed, thanks to Matthew Cooke."},{"comment_id":"1142026852548536","commenter_b":"Hillary is done!! all thanks to Gucifer 2.0!!! Ding dong the witch is dead, the wicked witch @webpagelink","commenter_a":"hahaha..my grandsons are proud of hillary clinton for her campaign for president..they think donald trump is a bully and bigot..says a lot for a 16 year old and 12 year old!","post_message":"A lot has changed in the past two and a half decades. But the things we’re fighting for remain the same."},{"comment_id":"10154429812461051","commenter_b":"Damage fags","commenter_a":"Impeach Trump","post_message":"The World Bank claims Trump could be the best thing to ever happen to the American economy. Do you think they're right?"}]
