[{"comment_id":"10155896308790354","commenter_b":"I don't know about you folks but I'm sure getting tired of these niggers.","commenter_a":"Buy them a fucken air conditioner, get the money from Jackson's Toyota ripoff !","post_message":"***THIS JUST IN*** The environment is racist!"},{"comment_id":"10154307345026729","commenter_b":"I am a liberal and I totally agree with the poster, so why are you irritated with liberals; your reasoning doesn't make sense to me.","commenter_a":"Or becoming traitors and taking over federal buildings!","post_message":"This will definitely irritate liberals and the \"coexist\" crowd"},{"comment_id":"419941198130475","commenter_b":"Yes, Yes, she is a ruthless women!","commenter_a":"Youll keep up the good work","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"},{"comment_id":"893404867419235","commenter_b":"Really! Like WTF! Those sharks don't belong there! This bullshit is effecting tourism! Kill'em all, right?? You freakin gluttonous capitalistic bitches! 😡","commenter_a":"o_O *slow blink*","post_message":"Why isn't the government protecting our freedom of beach?"},{"comment_id":"1172807002807988","commenter_b":"But you know it's hard to dress a tranny and make anyone think they're a woman !!!","commenter_a":"Well this certainly has nothing to do with the article, but thank goodness Michelle's designer will not be dressing Melania. Think how hard it was to come up w flower gardens, etc to cover all the hair on Michelle's chest every time she dressed her. Melania's designer will have it much easier dressing a woman w a figure.","post_message":"Looks like Michelle saved her most patronizing comments for last. When you see what she just said, try not to lose it! Are you ready for Melania Trump to be the First Lady?"},{"comment_id":"10154323192091051","commenter_b":"Where do you people come up with this nonsense?! How is $30, for an ID, that lasts for years, beyond anyone's budget? The only people that can't get IDs, are people that are here illegally! FYI: states, and various organizations, will pay for a poor person's ID; There are no excuses!","commenter_a":"Lets get one thing straight, it isn't about the ID cards. Its about how, where ,what ,when ,and cost of those cards that determine whether they are a fraud protection, or a voter suppression! If IDs are required, it should be incumbent on the states to see that every eligible voter has one, therein lies the rub! By charging for them, even a little, it puts it out of the reach of some peoples budget. By placing the outlets for the cards away from wards and precincts with opposition voters in large numbers, such as the inner city that tends to vote Democratic, you can insure that many won't have them and therefore affect the vote. By requiring a special card and locating it well away from colleges and universities, you can limit the number of out of state students that vote, especially when the college is rural, since students ...","post_message":"Michigan legislators just passed the strictest voter ID law in the nation. Do you support voter ID laws?"},{"comment_id":"903256166376472","commenter_b":"Where does this B S come from !","commenter_a":"Stupidity","post_message":"Incredible!"}]
