[{"comment_id":"10155037130139369","commenter_b":"Sucker","commenter_a":"I'm 51 now and have paid into social security since my first job at 15 years old. I want MY money! Let them try and take our money. They'll have a revolution on their hands!","post_message":"That's $32,000,000,000,000."},{"comment_id":"10156257885050389","commenter_b":"What the hell are they waiting for?? Indict her already !!!","commenter_a":"she sure is aging fast","post_message":""},{"comment_id":"10153648565856320","commenter_b":"Gather them up like cattle. Send them to Iran or where ever and let them find isis","commenter_a":"Just stop with the protests and move on. If they only knew how ridiculous they look continuing to honor a criminal.","post_message":" recent acts of violence will not be tolerated in a community that has worked so tirelessly over the last year to rebuild and become stronger. - St. Louis County Executive Steve Stenger State of Emergency issued in St. Louis County, Mo., as they prepare for a second night of protests in Ferguson. More Details: @webpagelink"},{"comment_id":"10154286126010326","commenter_b":"Hillary was lost in the past , she didn't care about the milleniels and helped destroy the base. Bernie is the future and was ignored by the filthy rich who are more Republican like than ever. Republicans were endorsing her.","commenter_a":"Eyes on the prize folks. Blue is going to be a tag team extraordinaire. We know the goal, it's not about who is the leader, it must be all of our blue and all of us.","post_message":""},{"comment_id":"10152966300122093","commenter_b":"You Must love getting raped .. how was your child life stupid","commenter_a":"he's fine as hell he can be my massage therapist any day ;)","post_message":"This man posed as a massage therapist.... he then sexually assaulted the Dallas women he tricked.... @webpagelink"},{"comment_id":"10153040559681130","commenter_b":"Religion, Kartrashians, J.Lopez, M.Cyrus, and their ilk. Male dicktators ruling./ruining countries...","commenter_a":"I want to see a world without religion or Kardashians.","post_message":"Do you want to see a world without elephants, rhinos or gorillas?"},{"comment_id":"539553339568579","commenter_b":"Yes. Send them home. They CANT Obey Our laws","commenter_a":"To Syria, no return ever!!","post_message":"Furious Muslim students rush stage during American Sniper showing. They have no respect. If they don't like American Sniper they can leave. Do you agree these Muslims are out of line?"}]
