[{"comment_id":"10154341575671729","commenter_b":"Not a charge will be brought against this bitch","commenter_a":"How much worse does it have to get? Will a corrupt government be able to bury all the evidence? If Hillary survives the latest, democracy is finished.","post_message":"The hits just keep on coming..."},{"comment_id":"1766321223645256","commenter_b":"If you are gay why are you voting for Hillary when she wants to bring in millions of refugees that believe gays should be executed? If you are Black, why are you voting for Hillary when she defends Planned Parenthood and admires Margaret Sanger, who wanted to abort as many black babies as possible and exterminate the black race because they are like \"weeds.\" Most of those clinics are in Black neighborhoods. If you are a Woman, how can you vote for Hillary when she has buried all of Bill's rape victims under the rug. As an attorney, Hillary also defended the rapist of a 12-year old girl and laughed about it later. She plays the woman-card and acts entitled; implying that she deserves your vote merely because of her sex. How is that gender neutral? If you have are a Miner, Steelworker or have a Factory job, why are ...","commenter_a":"He did not say because of how they prey! This is Dem spin! KILLARY only is concerned with illegals and refugee''s Get that big dem base full of those needing your handouts!! Does not matter if some want to kill us Really our money, but once it get to DC it's their money!! Her motto should be just give me your I WILL MAKE THE DEMOCRATS!!!! This country is going down fast!! Bombings, beheading, murders etc And our president is worried about where someone should PEE !! Big world leader! OBAMA A TOTAL JOKE!!","post_message":"\"In this great nation, where our founders put a fundamental principle forward of religious freedom, [Donald J. Trump] says ban all Muslims, don't let certain people into our America because of how they pray.\" What do you think of Sen. Cory Booker's comments about Donald Trump at the #DNC?"},{"comment_id":"424495247675070","commenter_b":"No, it's us white people's fault................we don't give them enough !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"Right on!","post_message":"Could Bill O'Reilly be causing more harm than good by saying this?"},{"comment_id":"420582524733009","commenter_b":"No lying Bitch will run this Country!! You will be heavy investigated about all this money you have.","commenter_a":"No they never do on the left !!","post_message":"Is the press giving this enough attention?"},{"comment_id":"1703542769705464","commenter_b":"Nothing wrong with the east end of london. I used to go there most weekend to watch West Ham. Most of the whites moved out so blame them for not integrating.","commenter_a":"What a load of BS.. The best thing about britain is that its a big melting pot of all cultures and religions and we all get along fine apart from a small minority of extremists.","post_message":"According to a shocking new report"},{"comment_id":"10153907246193812","commenter_b":"I don't want them in California!! I don't want them in the United States. Send them all back with a rifle and ammunition to fight for their own country!!!","commenter_a":"But, but, refugees are not terrorists......","post_message":"JUST IN: Turkey arrests 8 suspected ISIS members who planned to travel to Germany posing as refugees, Turkish officials say."},{"comment_id":"10154526330973352","commenter_b":"I also stated that this evil woman deserves prison because she knew damn well what she was doing!!!","commenter_a":"This isn't mental health issue. She knew what she did was wrong as she hid the bodies. That's not mental health issues. First thing everyone wants to make of horrible crimes like this is that It's mental health issues. Bull shit. This woman knew what she was doin so call it what it is....it's EVIL. She is an evil woman who got tired of being a mom and decided to kill her children. No empathy for this murderer. Call it what it is. There are just evil people in the world sometimes. Not mental health impairments every time a parent murders their child. She needs to rot to death in a jail.","post_message":"Pictured: The 'pregnant' Phoenix mom, 29, and her three young sons that she 'stabbed to death before stuffing their dismembered bodies in a closet and suitcase and trying to kill herself'"}]
