[{"comment_id":"10154200210407411","commenter_b":"She has to pay her daddy","commenter_a":"Why doesn't she sue to stop the pay of the Senators/Representatives who's job it is to pass a balanced budget but who haven't done so in almost two years? It seems highly suspect to punish people who do their job but allow those who are unable to complete their primary assigned task to continue to be paid. Again, politics over people. Sad.","post_message":"Illinois Attorney General Lisa Madigan is seeking to stop state worker pay until legislators and Gov. Bruce Rauner approve a spending plan."},{"comment_id":"1001149379923298","commenter_b":"Watch out folks, she will give you the evil eye!","commenter_a":"HillbillyHillary at the Arkansas Pig festival,stumping for votes","post_message":"The video Hillary doesn't want you to see. This could sink her campaign! [Watch below]"},{"comment_id":"10153797502305779","commenter_b":"I wonder how people react to a naked hillary statue where you get to see that bitch in all her glory. Lol. Bet people would respond differently","commenter_a":"Gross!!!! The looks are uncanny!!!!!","post_message":"New naked Donald J. Trump statues appeared today, and now they're legal, backed by a mega-developer of their own."},{"comment_id":"10153122318985950","commenter_b":"The bitch is the devil.","commenter_a":"stand Firm Kim .Dont Backdown .The Devil Never wins unless You let him .","post_message":"Before returning to work today, Ky. clerk Kim Davis said she is being \"forced to disobey her God,\" and that she still won't authorize marriage licenses for same-sex couples."},{"comment_id":"1275842862475459","commenter_b":"Might have to tell family to leave Italy and come here as refugees","commenter_a":"You don't have to be a genius to see that's happening now. Send them all to the middle east","post_message":"EU admit immigration will destroy European values"},{"comment_id":"944552658926615","commenter_b":"People always wanna go after the other person. .. well guess what? .... THE DAUGHTER WAS THE ONE WHO HAD HER 16 YEAR OLD LEGS OPEN. AND WHAT 16 YEAR OLD BOY GONNA SAY NO TO PUSSY? smh","commenter_a":"I've got 4 daughters and a handfull of granddaughters--put me on her jury!","post_message":"MAD MOTHER: Police say say she beat up a boy after finding him in bed with her daughter. After he ran away, they say she took a baseball bat to his car."},{"comment_id":"871246712910789","commenter_b":"The face of an ugly, pathetic bitch.","commenter_a":"I would never have breast fed my daughter in public. A woman can go to the ladies room or bring a bottle with her when she's out. I think it's distasteful to breastfeed in public.","post_message":"\"I was almost in tears and creating my own wet t-shirt contest by the time I could pump again.\""}]
