[{"comment_id":"10152654360726636","commenter_b":"Dirty women, women in India are cleaner.. LOL","commenter_a":"Ewwwwwwww no way! Everyday girl me!","post_message":"One in three have gone three days without washing..."},{"comment_id":"760324150750635","commenter_b":"You sons a bitches!! Lmao","commenter_a":"Thanks a lot sister that was my favorite soda!! Gross! Jessica LeAnn Miko","post_message":"Disturbing Thing A Man Says He Found Inside A Freshly Opened Pepsi Can"},{"comment_id":"1009798209043227","commenter_b":"That woman will never learn.","commenter_a":"Pig","post_message":"Joy Behar calls out Carly Fiorina. Is she right?"},{"comment_id":"1081910365238548","commenter_b":"Your moms twat","commenter_a":"Donald Trump is a maggot-ridden crapsplatter from a syphillitic pink-assed baboon.","post_message":"Trump's new ad is directed at... a) George Lucas b) Princess Leia c) President Obama"},{"comment_id":"10154306058514062","commenter_b":"Women, always wear pants/skirts that have pockets. if they steal your purse and your gun is in it, you're screwed.","commenter_a":"And that's why I always have the Grim Ripper with me!!!","post_message":"So scary..."},{"comment_id":"10152902121277098","commenter_b":"Do you know any white girls from the sticks? Smh!","commenter_a":"White girls from the sticks are certainly the most psychotic!","post_message":""},{"comment_id":"1278673865484657","commenter_b":"I understand that Hillary has a criminal mind, and I never want someone like her in any office of our government. Her evil intentions are based upon her greedy lust for power and money. But with all due respect, Mr. Trump, what I find so incredibly \"shocking\" is that NO ONE CARES ENOUGH TO DO ANYTHING ABOUT HER!!! Everyone is pissing and moaning ALL THE TIME about Hillary and Obama, saying she done this, and Obama done that. BUT WHAT IS BEING DONE ABOUT THEIR REIGN OF TERROR? NOTHING. ZERO. ZILCH. NADA. To me that says that Americans are a bunch of APATHETIC ENABLERS. We the people deserve the lot we've been given because we, as a nation, have ALLOWED IT!!! #stoptheenabling #stopthetyranny #votetrump","commenter_a":"\"Because one wrong move can mean the difference between life and death.\" -Hillary Clinton, 8-25-16 We know that's true, Hillary. We know that's true. Signed: Ambassador Stevens Sean Smith Glen Doherty Tyrone Woods","post_message":"Hillary Clinton’s actions constitute all of the elements of a major criminal enterprise - she created a private illegal email server in order to hide her corrupt dealings. She did so knowing full well it would put American lives at risk by making classified information highly vulnerable to foreign hacking. But, she didn’t care – as long as it helped her get away with her crime, no risk to America was too great. Then, to further cover-up her crime, she deleted 33,000 emails to keep them out of the hands of authorities and the American public. As a further element of the criminal cover-up, she claimed under penalty of perjury that she turned over all of her work related emails. We now know this to be one more massive Clinton lie. The FBI found thousands of work-related emails she failed to turn over, including the new discovery this week of ..."}]
