[{"comment_id":"787563944661438","commenter_b":"No more shrubs!","commenter_a":"What do you expect from him, he is a Bush.","post_message":"Democrats have a field day mocking Jeb Bush for pretending to be \"his own man\" despite the fact his policy advisors list reads like a Who's Who from the Reagan administration and those of his father, George H.W. Bush, and his brother, George W. Bush #ItDoesntFallFarFromTheTree"},{"comment_id":"1835870700020882","commenter_b":"Woman belong in the streets, your right...","commenter_a":"Every single person that's out there marching there's 10 that wish they could have","post_message":"From CommonDreams: \"The second day of the Trump administration has seen an unprecedented wave of protests swell across the globe, as the Women's March on Washington and its sister marches on all continents—yes, including Antarctica—fight back against the U.S. president's frightening rhetoric.\""},{"comment_id":"1012583592144355","commenter_b":"and if we stay in toltel control","commenter_a":"More false propagander to try to get us to vote to stay in. The damage has already been done the EU Commission is an unelected, self sustaining, beaurocratic, and vastly overexpensive power crazed clique that will not change its self no matter what this person says. The only way to free ourselves of this shower is to vote to leave!","post_message":"Has the EU meddled too much in the daily lives of its citizens? @webpagelink"},{"comment_id":"1270965036267418","commenter_b":"This poor dear is fighting an incurable disease and still want's to see American go back to being a great Nation again. Hillary keep you porn star and all the other jokers you can muster up. Melissa never give up dear, God can do miracles. Thanks for being a strong and down to earth women, unlike Hillary's choice of women.","commenter_a":"Rick Webb","post_message":"Former Miss Wisconsin USA Melissa Young, who is battling an incurable and fatal condition, said a note from Donald J. Trump in her darkest days reminded her that \"my purpose is to fight and I need to get up and fight.\""},{"comment_id":"10155355195265354","commenter_b":"At least she kept it in country","commenter_a":"Hillary has went to panic mode dragging old hack Carville out, he's been out of it for a long time. Selling snakeskin boots an alligator hats now days. Back on Hillary payroll with a bunch of brand new excuses and lies.","post_message":"WATCH: James Carville Accidentally Admit Hillary Clinton Tried to Evade Congress With Secret Email #Oops!"},{"comment_id":"921257648004031","commenter_b":"Nope, Michelle can get naked with any woman she chooses. I'm okay with that. Hillary too. Lesbian love! Let's all celebrate that.","commenter_a":"I couldn't care less about the nude photos. That has no effect on my disdain towards Trump. I DO care about the fact that conservatives are fine with this, but would have a complete meltdown if this were Michelle Obama and call her every dirty name in the book.","post_message":"What kind of example would First Lady Melania provide for America's children? But let's hear more Fox \"News\" outrage about Michelle Obama's sleeveless dress PLEASE... sigh... Full photo here: @webpagelink"},{"comment_id":"10155879788485354","commenter_b":"Send them all back. Stop immigration period. Let's get a handle on it before starting it back up. We need to police our new immigrants better.","commenter_a":"FOOK AMNESTY","post_message":"Some truly shocking statistics in this article..."}]
