[{"comment_id":"894578323912842","commenter_b":"Then it would forever be a mystery. That hag will never tell the truth.","commenter_a":"Did they ask Hillary that question well when she tells the truth then they can come back and ask Rick that question.","post_message":"\"These are tough issues...\""},{"comment_id":"10153255897157894","commenter_b":"She has a problem period","commenter_a":"Somebody has a problem with authority","post_message":"Azealia Banks Under Investigation for Allegedly Beating Up a Security Guard [Video]"},{"comment_id":"555507287934896","commenter_b":"I'll flip it back and not shop there until the board fires her","commenter_a":"Time to switch to Costco.","post_message":"What do you think of this?"},{"comment_id":"10154369386141509","commenter_b":"Why are they racist? Because we want to deport illegal immigrants like every single country in the world? So the whole world is racist except for American liberal sissy's? Mexico deports all illegals so by your standards they're racist. England is racist. China is racist. Maybe your just a puppet?","commenter_a":"This won't sit well with the racist elements of the Republican party. Cruz is saying what I thought all along, the Republican party will never round up anyone. It's an election ploy with base voters.","post_message":"Texas Sen. Ted Cruz does not plan to authorize a special force to deport the undocumented immigrants currently in the country, he told CNN's Jake Tapper, setting up a policy contrast with Donald J. Trump. @webpagelink"},{"comment_id":"10157009352015557","commenter_b":"Did you not read the article? Duh","commenter_a":"They need to arrest the parents of these minors who gift him their child","post_message":"A Bucks County man is facing multiple sex charges after police say a dozen girls were found in his home, including one girl who was \"gifted\" to the man by her parents."},{"comment_id":"10153021428690399","commenter_b":"Karma is a bitch","commenter_a":"Bet he declares bankruptcy and sticks us with the bill. Typical freeloading conservative.","post_message":"smdh"},{"comment_id":"10153563435706162","commenter_b":"This is some shady bull. Why was she even in jail in the first place? That I'm not understanding she was pulled over for not signaling a lane change? How did she even manage to be asked to get out of the car or get out of the car to assault an officer? I wouldn't have gotten out for that violation right me my ticket or let me go period point blank. I would be respectful but i wouldn't let them take advantage. She should have not been in jail in the first.","commenter_a":"Abc won't let this go. Must be a good day to hate on the police. Even though there is only evidence she killed her self.","post_message":"Her primary cause of death was \"hanging.\" Family and friends want to know what happened to a Naperville woman found dead in a jail cell, after she was pulled over for a traffic stop while on a road trip with her mom: @webpagelink"}]
