[{"comment_id":"892169154214897","commenter_b":"Tucson, AZ.","commenter_a":"12s, where are you watching from???","post_message":"Watch: Seahawks leaving for Carolina!"},{"comment_id":"10158010051555354","commenter_b":"I like the way you think. You are a strong ,smart woman. Hillary? Not so much 😎","commenter_a":"That's funny....I'm a woman and I don't feel the least bit threatened by the FBI Investigation. I felt violated when Comey gave her a free ride the first time around - this time, not so much!","post_message":"THIS is the best the Left can do?!"},{"comment_id":"10154248071539714","commenter_b":"@username seriously what does being white have to do with anything.","commenter_a":"Isn't that discrimination? I mean I don't care. It could be a good thing. But with all the political pc going around. This is discrimination compared to what liberals say","post_message":"A former Uber driver and his wife are launching an alternative car service for female passengers only. (via Good Morning America)"},{"comment_id":"1008103192579543","commenter_b":"For those of you @username fans, I am posting this article to show the evils of this woman and why you should not vote for her. @webpagelink","commenter_a":"Hillery for prison in 2016","post_message":"\"As a South Carolinian, an African American man, and a father, I can't stop asking myself once again: Where does my community go from here?\" Clay Middleton, Hillary for South Carolina State Director, on the #AssaultAtSpringValleyHigh."},{"comment_id":"10152883726561491","commenter_b":"No..I am retired military..my tune is if there were ZERO GUNS...if you remember Archie Bunker : his daughter said :\" daddy do you know how many people are killed with guns every year?\" And Archie said : \" would you rather they were pushed from windows\"! No my friend I only mean Yes we need guns for protection and they great out door sports.. I only wish we didn't need such deadly force. It is , to have a gun or guns an important right. Especially in other countries where many citizens cannot defend themselves from thier own evil corrupt governments who kill thier own citizens..like Assad in Syria..awful oh yes own constitutional right to have arms and guns is one of the best rights and part of free speech..that's how we won the revolutionary war and became our very own UNITED STATES OF AMERICA..if ordinary citizens had no guns ...","commenter_a":"Guns mankind's worst invention.","post_message":"The course of the bullet corrects midair."},{"comment_id":"900210363349638","commenter_b":"Yep, definitely my twin lol","commenter_a":"@username this you lol had to double take lol","post_message":"“There has never been anything like this seen in a fish’s gills before.\""},{"comment_id":"10153894447031130","commenter_b":"I'm sure that's very concerning to her. News flash: women aren't interested in your opinion of them.","commenter_a":"She is not attractive or funny to me at all.","post_message":"And Amy Schumer looks fab, of course."}]
