[{"comment_id":"10152957013791336","commenter_b":"It's NOT HEALTHY to break into their homes or rob them or attempt To hurt their families......","commenter_a":"Why are all Americans so obsessed with guns, it's not healthy.","post_message":"Bonnie and Clyde's infamous pistols of choice — What are they worth? Find out tonight at 8:30p ET on Fox News Channel. (via Strange Inheritance)"},{"comment_id":"1052995884768693","commenter_b":"Miley Cyrus? The skank can't even keep her tongue in her mouth!","commenter_a":"Good who needs them!","post_message":"“I will give you a one-way ticket to the country of your choice, with the stipulation that you promise never to come back.” WATCH: Sean Hannity made an offer to the celebrities who are vowing to leave the country if Donald J. Trump becomes president."},{"comment_id":"1159474340740147","commenter_b":"we don't give flyin fk what she does lmfbo she is a pig an evil ugly witch","commenter_a":"Donald Trump CNN just reported you declined an invitation to speak at the NAACP convention. Are you nuts? Hillary accepted, you declined. All I hear about is how hillary is sensitive to the American people and even though she is a liar, there are a whole lot of American people that believe her. Right now I hear her speaking in a calm mature voice how this country is divided. Wow is she tearing your character completely apart. It's all about you she is saying. All this is about you. I got to tell you Trump old man, she is using every lying skill she has to make you look bad. Real bad. A bad guy. Yeah a real bad guy.","post_message":"I agree! Lets MAKE AMERICA GREAT AGAIN...VOTE FOR TRUMP! Thank you for your support- it means the world! DJT"},{"comment_id":"1558275617531277","commenter_b":"NICE PERSON..SHE LIES, ARGUES LIKE HE DOES. INTERUPTS,ALL SHE DOES IS TRASH HILLARY","commenter_a":"She really seemed like a nice person and I am hoping she gets as far way from that idiot as she can. She is way too good for him. She was going down the tubes with him.","post_message":"The wheels are falling off!"},{"comment_id":"10153077388711051","commenter_b":"What she can't read? So they don't like what your wearing take your business elsewhere duh but what she is wearing I see nothing wrong with she has more close on then most. The owner is an ass","commenter_a":"Seafood Nazi.","post_message":"When this woman was told that she was being kicked out of a store for her 'inappropriate' outfit, she thought it was a joke. Nope."},{"comment_id":"425066681021905","commenter_b":"That woman should of been kicked out.","commenter_a":"Look what we just missed- Wendy Rowe Ristine-#noblackfriday #somepeoplejustsuck","post_message":"Look at what a woman just did to a child at a Black Friday Sale."},{"comment_id":"10153583021397434","commenter_b":"Get that bomb ass dick!","commenter_a":"I had to open up my decoy facebook just to be able to \"anonymously\" say that I've slept with at least 160 different men and have never experienced this.","post_message":"After fucking, while you’re still a tangle of sweaty limbs and heaving torsos, your partner--probably still inside you--looks deeply into your eyes and whispers a husky and sensitive “hey.” Why?"}]
