[{"comment_id":"10155280506710329","commenter_b":"Things real vaginas eat","commenter_a":"I read that as \"vagina\" and then saw a picture of the cupcake looking thing...didn't think twice until I read the caption again. =)","post_message":"It's tastier than you think it is."},{"comment_id":"10153260031480095","commenter_b":"Please remove the ones that are already here and close our state's borders to all of them. This is a matter of defense, not of immigration.","commenter_a":"#LetThemInBobby Rescind your order! You are an embarrassment and I am ashamed of you.","post_message":"I just signed an Executive Order instructing state agencies to take all available steps to stop the relocation of Syrian refugees to Louisiana. The Obama administration continues to fail to provide critical information to state government or local authorities and has intentionally kept our state in the dark about their irresponsible refugee relocation plans. This is a matter of national security and a matter of Louisiana’s security. I will do everything in my power to stop this from happening."},{"comment_id":"985335071559547","commenter_b":"Scumbag!","commenter_a":"First of all what was the point in having all of this kids man! Now a days 3 or 4 is a lot of kids man. 19 kids is like your freaking crazy! I only watch half of a episode and I change the channel mighty quick. The ones that are going to suffer are their kids.","post_message":"This \"family values\" hypocrite hoped you'd never see these."},{"comment_id":"1192730294142303","commenter_b":"Sherry Ashrof","commenter_a":"Mike Simm","post_message":"Nice ice baby!"},{"comment_id":"654574044733174","commenter_b":"Forget you Hillary!!!! REMEMBER Benghazi????????? YOU'RE NOT GETTING MY VOTE!!!!! Rot in hell you piece of shit!!!!","commenter_a":"Fuck that Bitch.","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down. She is in trouble. Let's show her our support. Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"},{"comment_id":"1007260792718180","commenter_b":"You can cuck off to bitch","commenter_a":"So----don't sing","post_message":"Hello, it's me. I've been wondering if you think I give a crap what you think..."},{"comment_id":"10152955110391336","commenter_b":"What i do NOT understand is.....if kids get vaccinated....then why in the world are those parents concerned their kids will get the disease they've been vaccinated for??? Aren't the vaccines any good?? It's NOT the ppl who aren't vaccinating their children who are bringing disease to other in this country....it's the illegals who are flooding in here who are bringing this stuff with them!!! Blame the correct ppl if you're going to play the blame game....","commenter_a":"Well said Margaret","post_message":"A 3-year-old girl with leukemia was exposed to measles at an outpatient clinic in Arizona."}]
