[{"comment_id":"10153393648949228","commenter_b":"Actually, it's not normal for any woman to expose herself in public... feeding or not. It's quite self-centered.","commenter_a":"We all have to have something to complain about. It's like the news gives us one good story and the rest has to be bad. Give it a rest people. It's a normal mother instinct. LEAVE IT ALONE","post_message":"\"The mall told me it's perfectly fine, perfectly legal to breast-feed."},{"comment_id":"1859871360913002","commenter_b":"Can we please build that wall around his ugly face and throw dirt in his mouth!","commenter_a":"GEEZ LET THAT MAN BUILD THE WALL ... @webpagelink","post_message":"\"We will build a great wall along the southern border,\" Donald J. Trump told a crowd in Phoenix, Arizona, during his immigration speech. After a long pause, he continued: \"And Mexico will pay for the wall.\" @webpagelink"},{"comment_id":"10152958936935927","commenter_b":"You can bet if she was muslim, her actions would be perfectly justified ....they wouldn't jail her or tell her to get another job !!!!!!!","commenter_a":"The governor has the power to quietly transfer her people..he choose instead to jail her, its ridiculous..Muslims in the MTA in NYC refused to do their job based on religion reasons, it never even made the news and they were quietly transferred...not jailed. It was worked out quietly and amicably, yet this woman they choose to jail. The governor should be asked why he choose to make an example of her...","post_message":"WATCH: Governor Huckabee - \"You're telling me that you cannot make an accommodation for an elected Democrat county clerk from Rowan County, Kentucky?\""},{"comment_id":"10155094190367577","commenter_b":"Wtf.. Russia is not communist","commenter_a":"China is still a communist country, as is Russia. As before, they are again silent allies against the U.S. and her allies, the list of which is getting shorter daily. Russia and China both are fighting other countries to win the land and resources they want from them. It is a chess game and the plan has been in play for decades. They have gone from fighting the Middlle Eastern countries, to becoming their allies. Those countries are the ones who have professed to be America's and Americamn","post_message":"China has backstabbed the globalists by trying to become a military threat instead of just an economic powerhouse:"},{"comment_id":"1213211328691180","commenter_b":"Yes","commenter_a":"YES","post_message":"It's AMERICA! Learn it or leave! Comment yes or no! LIKE OUR PAGE!----> Freedom Daily"},{"comment_id":"10153880875017994","commenter_b":"Can't say officer I Didn't see it... Lol","commenter_a":"Sweet","post_message":"This is a pretty \"cool\" pic."},{"comment_id":"960803304010619","commenter_b":"That is where it starts. Where does it end?","commenter_a":"For Gods sake, no one is trying to unlock your average Americans phone. They want to unlock the California couple, Christmas party killer terrorists, phone. And for good reason. To find other connections.","post_message":"JUST IN: Donald J. Trump is calling for a boycott of Apple until the company agrees to the government’s demands and unlocks the phone used by one of the San Bernardino terrorists. What do you think?"}]
