[{"comment_id":"794052647345901","commenter_b":"LOL! Laughing mostly because I have a few friends like this guy...","commenter_a":"I believe it's called the \"pass the buck\" syndrome? Pity","post_message":"Image from Of the People, By the People, For the People"},{"comment_id":"526053707590689","commenter_b":"She needs to go back to the Chicago geto where she belongs!","commenter_a":"She is such a liar she acts socked but she has tapers in the White House","post_message":"\"I can't stop thinking about this. It has shaken to me to my core in a way that I couldn't have predicted,\" Michelle Obama said regarding Donald J. Trump bragging on a 2005 tape about his fame allowing him to \"do anything to women.”"},{"comment_id":"10154838337948797","commenter_b":"Mask? How did a hijab become a mask?","commenter_a":"Religious garment is to be used at church. As she lives in America she must take off the mask, is better for her to wear a miniskirt on this hot weather","post_message":"SOUND OFF: A woman wearing a hijab was asked to leave a Family Dollar store because of her Muslim face veil. When she protested that it was a religious garment, the manager explained that it is a high-crime area and the store gets \"robbed a lot. Was the store manager right in kicking her out? How would you have handled the situation? The best responses will go on air!"},{"comment_id":"1323274761102106","commenter_b":"Hillary is for WALL STREET, BIG BANKS and CORPORATE WELFARE!!!! Bernie was right!!! Don't let her steal our COUNTRY🇺🇸#NEVERHILLARY","commenter_a":"I think it's great that the majority of America is holding him accountable for being a sexual predator.","post_message":"Hillary Clinton is leading Donald J. Trump by 15 points in Virginia, up 8 points from two weeks ago."},{"comment_id":"10153206290841037","commenter_b":"And burn all the racist people in America","commenter_a":"burn all the bibles, korans, and any other religious text. They are blights.","post_message":"After being falsely accused of burning a Quran, Farkhunda was beaten, run over with a car and burned before her body was thrown into the Kabul River."},{"comment_id":"898473566912365","commenter_b":"@Patty Royer, please do not breed. America already has enough mouth breathing inbred idiots and you, madame, and I use that in it's professional sense, Are their Queen.","commenter_a":"And the Republicans encourage this kind of person.","post_message":"No surprise at all. Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1118742268187889","commenter_b":"ISLAM AND SHARIA LAW SHOULD BE BANNED FROM AMERICA PERIOD! THE MEMBERS OF THE OBAMA ADMINISTRATION NEED TO ALL BE REMOVED BY CONGRESS FOR TRYING TO TAKE OVER AMERICA THROUGH ISLAMIC RELIGION! PEOPLE LIKE OBAMA, HILLARY, LYNCH, HOLDER, GARLAND ARE ALL WORKING TO FORCE ISLAMIC BS UPON THIS COUNTRY! WE HAVE SECRETLY BEEN INVADED BY THESE POS TRAITORS AIMING TO BRING DOWN THE U.S. THROUGH ISLAM!","commenter_a":"finally a State with some b---s","post_message":"CELEBRATE!! VICTORY! South Carolina House Passes Bill Excluding Sharia Law From State Courts! THEY TOLD MUSLIMS HELL NO!"}]
