[{"comment_id":"10153304044791336","commenter_b":"Hope they show up in mine, I'll send them to hell.","commenter_a":"Please study these faces they could turn up in your neighborhood","post_message":"The five Taliban leaders traded a year ago for Sgt. Bowe Bergdahl could be free to travel as early as Monday as the terms of their supervised release are set to expire."},{"comment_id":"961273403971266","commenter_b":"Very funny.","commenter_a":"It would be a GREAT pick....! Watching Liberals heads spin and POP will be fun..! Plus Newt would wipe the floor with Hill-Lie-ary and anyone she chooses for VP.","post_message":"Trump has been asking confidants for input on Gingrich as a potential pick."},{"comment_id":"10153072331466051","commenter_b":"This woman is nuts and needs put away for a long time. How crewel!","commenter_a":"These people are so evil !!! what is this world coming to","post_message":"First she threw her ex-boyfriend's puppy into the oven. Then she turned the oven on. And then she called him up and told him where he could find his dog."},{"comment_id":"10154303703286178","commenter_b":"You sound like a feminist bro.","commenter_a":"So does this mean only woman can understand how to run a home ? What a CROOKED crock of chit HILLARY !","post_message":""},{"comment_id":"987975737904514","commenter_b":"obitch isn't happy unless she's ruining things for chidren","commenter_a":"She has no Constitutional authority at all...why do we allow her interference in our schools, homes and communities?","post_message":"Michelle Obama wants to BAN HALLOWEEN!"},{"comment_id":"10153907733031002","commenter_b":"I don't believe she \"deserved\" it at all. I also agree that a man that size obviously has other options to restrain someone. These girls need to realize these men aren't their daddy, brother, uncle.. They don't know how they are going to react, so they need to keep their hand to themselves. Neither party was right here.","commenter_a":"She Wasn't out of pocket. Just Because she was waiting for her brother that gave him the right to grab her up like she was an issue. This is a grown man, you don't punch a teenager on the face like she a man. He had no right to ever touch her, her brother was just trying to protect his sister, as he should.. PEOPLE are out of control.","post_message":"A mother is demanding answers after her daughter was punched during a heated exchange at a skating rink."},{"comment_id":"1542337212473798","commenter_b":"Anyway, porn is evil and consent can never be bought!","commenter_a":"Fact is, some women enjoy sex, some women enjoy porn, and by saying a woman cannot or should not participate, and that they are all manipulated, you are taking away their right to choose. Thats antifeminist. Further, you are aaying women, by nature, are easily manipulated and dont know whats good for them, and thats also antifeminist. I ssy, as long as a woman is freely chosing the career, and is informed of what it entails, then have at it.","post_message":"How do we make pornography better for actors and the people who consume it?"}]
