[{"comment_id":"10153638977331336","commenter_b":"Who said I only talked to one? I only mentioned ONE conversation","commenter_a":"Their apology means nothing if the employee was not fired immediately.","post_message":"The Pembroke Pines Police Department says that a uniformed officer was refused service at an Arby's simply for being a police officer."},{"comment_id":"1043787832310738","commenter_b":"So she cooks for him he does not eat rigjt away he showers then she but instead of making a plate of cooked food he decides to cook something different and its her fault.no he just know he can take advantage.nothibg wrong fixing a plate but he was petty.its childish","commenter_a":"This lady has time to waste, why is she asking the internet for advice when she could simply have a conversation with her man about this habit or preference. if she has an issue with making him a plate, then she should make it known..........geesh, communicate with the man instead asking us for our opinions since we do not know the whole story.","post_message":"Are his legs broken?! Anywho, what should this woman do?"},{"comment_id":"10153092364080779","commenter_b":"how about enforcing the laws.....dumb bitch.....","commenter_a":"If I hear gun control one more time... I couldn't feel worse for the families that lost loved ones today, but laws are NOT going to keep law abiding citizens safe from criminals, the mentally ill or those that intend on dying in a blaze of glory.","post_message":"Calling America's epidemic of gun violence \"a political choice we make\" and declaring of the nation's political class, \"we, collectively, are answerable to those families who lose their loved ones because of our inaction,\" President Barack Obama delivered one of the rawest speeches of his presidency today in response to the Umpqua Community College shooting rampage. Read it below."},{"comment_id":"10154030120894877","commenter_b":"waaaaaa look at us! we are terrible parents! we make bad decisions and get back men killed with our ignorance! yayyyyy! black men, you are lucky to escape the wombs of these criminal producing welfare brood mares!","commenter_a":"Very nice to see Americans giving these women love and support. Their bravery and commitment to honor their sons is wonderful to see.","post_message":"‘Mothers of the Movement’ deliver staggering testimony of loss, hope at DNC Grio fam, what did you think of their appearance? Watch the full clip and share your thoughts below."},{"comment_id":"1132662126754797","commenter_b":"Haaaa! Sandhopper burgers all round !!!","commenter_a":"@username they stole our business idea!!","post_message":""},{"comment_id":"1089340994496293","commenter_b":"Nope ! We won't be voting for her !","commenter_a":"What is she wearing; gift Wrap? I'm glad she's encouraging people to vote. Who you vote for is your personal choice.","post_message":"Miley Cyrus goes door-to-door at George Mason University registering college students to vote for Hillary Clinton abcn.ws/2dx2OnW"},{"comment_id":"10152988203790861","commenter_b":"You act like kids don't figure stuff out.","commenter_a":"I can just see a kid planning it out to steal the gun and shoot up the classroom.","post_message":"A Texas school district wants to allow teachers to carry guns in the classroom. Tell us what you think about arming teachers."}]
