[{"comment_id":"1738376596301641","commenter_b":"She wants you to lick it for her ! Lol","commenter_a":"Someone should tell her to lick her butt hole like a dog and mind her own dam business !","post_message":"Hillary Clinton told a group of supporters on Wednesday that America has \"too many guns.\" Yes, that's right. The presidential candidate who claims to respect the Second Amendment is upset that Americans own more guns than she is ok with."},{"comment_id":"1252586078101378","commenter_b":"close the borders is THAT step you @$$hole","commenter_a":"Yeah he may need to stop staging them, its transparent that since hes been in office we have had the highest amoumt of mass shootings ever, and seems it happens around the time he wants to push for more gun control. Is it me or am i going nuts.","post_message":"Knowing nothing about the causes of the #SanBernardinoShooting, Obama issues his mindless chant for more gun control. cnn.it/1Xzyg5u"},{"comment_id":"1030585200364962","commenter_b":"DON'T TRUST HER ... Obama and Hillary want to rescue 200,000 Muslims. This is the same two that couldn't rescue four Americans in Benghazi. ... #VoteTrump2016","commenter_a":"Hillary's background If you happen to see the Bill Clinton 5-minute TV ad for Hillary in which he introduces the commercial by saying he wants to share some things we may not know about Hillary's background, beware. A person who was there for most of their presidency and knows them better than just about anyone has listed a few corrections. Bill says: \"In law school, Hillary worked on legal services for the poor.\" The facts are: Hillary's main extra-curricular activity in law school was helping the Black Panthers, on trial in Connecticut for torturing and killing a federal agent. She went to court every day as part of a law student monitoring committee trying to spot civil rights violations and develop grounds for appeal. Bill says: \"Hillary spent a year after graduation working on a children's rights project for poor kids.\" The facts are: Hillary interned with Bob Truehaft, the ...","post_message":"Hoy, el Departamento del Trabajo acaba de anunciar nuevas reglas laborales que garantizarán el pago de horas extras a trabajadores que ganan hasta $913 dólares a la semana o $47,476 al año. Esto es más del doble que el límite pasado de $455 a la semana. Hillary: \"Aplaudo al presidente Obama y al Secretario del Trabajo, Pérez, por estas reglas sobre horas extras laborales, las cuales levantarán a trabajadores a nivel nacional y ayudará a que los salarios aumenten nuevamente para las familias trabajadoras. Durante el primer año de la implementación de estas reglas, millones de trabajadores adicionales serán elegibles para el pago de horas extras, finalmente cobrando totalmente por las horas que le dedican a sus trabajos... Nadie que trabaje 40 horas a la semana debería tener que mantener una familia en la pobreza”."},{"comment_id":"10156264408410725","commenter_b":"The smart Americans will vote for Trump and Cruz. And that includes the \"legal\" Hispanics here. Trump wants to deport the millions of \"illegal\" immigrants..the ones who sneak in undocumented, or overstay their visas, or get deported and sneak back in...THE ONES THAT KEEP KILLING INNOCENT AMERICANS and drain our system! Get them the hell out.","commenter_a":"Go Trump!!! Hispanics for Trump 2016","post_message":"Join me Tuesday, November 3rd at 12PM in Trump Tower New York. I'll be signing copies of my new book CRIPPLED AMERICA. Don't miss it!"},{"comment_id":"10153312130831051","commenter_b":"its a MUTE SUBJECT!!! THERES NOT ONE RUNNING FOR PRESIDENT ... AMERICANS ARE SICK OF THIS CRAP !!!!!!!!!!!","commenter_a":"I would beleive Mr Carson anyday over Obama or any of his men......","post_message":"The Obama administration just slammed Ben Carson for saying America shouldn’t elect a Muslim president. Who do you think is right here: Carson or the Obama administration?"},{"comment_id":"1117850661583687","commenter_b":"She is trash !!","commenter_a":"Or is it Michael Obama?","post_message":"Keep on Rockin In The Free World!"},{"comment_id":"10154107303310286","commenter_b":"This has been my home longer than it's been yours.","commenter_a":"Go home","post_message":"#BREAKING: Organizers estimate around 250,000 people flooded the streets for the Women's March on Chicago – more than three times the expected attendance. Details: nbcchi.com/eWVXidj"}]
