[{"comment_id":"1034093419959450","commenter_b":"@username OMG Yay! We should praise bernie more often! <3","commenter_a":"He needed to win by 57%. He barely squeaked by, and only tied in delegates. It was not a good day for him.","post_message":"Are you feeling the Bern?"},{"comment_id":"1196095087116904","commenter_b":"This women is craving Attention poor thing","commenter_a":"And they call this art !!!! How ??? Not on !!!","post_message":"She's doing what?"},{"comment_id":"1145471028827087","commenter_b":"Joy yes the Bible said far be it from the true God to act wickedly! Death is the last enemy, the pain we feel when a love one dies is beyond words indeed God don't cause wickedness n bad things to happen but he \"ALLOWS\" I lost my son who I love dearly and reading and focusing on JOB experience help me to keep my sanity! THANKS BE TO GOD.","commenter_a":"You would not believe how many people said \"everything happens for a reason\" or \"this was God's plan\" when my son was stillborn. It made me so angry, still does. There is no reason, the autopsy proved that.","post_message":"In case you missed it: Sometimes saying \"Everything happens for a reason\" can hurt the folks we mean to help."},{"comment_id":"10153676761856623","commenter_b":"I just don't understand how people would want to vote for this lying deceitful person with a terrible plot up her sleeve! She is a lying snake! Now I'm not saying a support trump either but this lady is just flat out terrible!","commenter_a":"I also keep two calendars, one for business one for personal stuff.","post_message":"Hillary Clinton kept two calendars when she was secretary of state — one for the public, but another that included meetings with political donors and loyalists, Wall Street bankers and Clinton Foundation contributors."},{"comment_id":"827683380698175","commenter_b":"@username, so this guy should use the woman's bathroom?","commenter_a":"XY, XX there is nothing more, deal with it","post_message":"The American College of Pediatricians just made a SHOCKING statement about transgendering young children. Liberals are going to be pretty upset over this."},{"comment_id":"942143152490588","commenter_b":"where are the feminists.. i mean the ones born with a vagina ?","commenter_a":"I'd be curious as to how the feminists view this. A transgender winning against women. Interesting point about puberty made by Rousey.","post_message":"Let's be real, she makes a good point..."},{"comment_id":"575908422533751","commenter_b":"Kepp telling it girl !","commenter_a":"How true.","post_message":"Meghan McCain says that when Trump makes mistakes with his words \"it offends people sometimes and it can be controversial, but when Hillary makes mistakes, people die. Agree or disagree?"}]
