[{"comment_id":"10157734459025354","commenter_b":"Bill can't wait to be in Las Vegas were the hookers are like running water! I did not have sexual relations with those hookers!","commenter_a":"The real deplorables are the 40 something % of true idiots that are still backing the Clintons- Trump people are fed up taxpayers-","post_message":"If she's \"feeling great\" as Team Hillary claims, why isn't she campaigning? What is going on? And why can't these two ever tell the truth?!"},{"comment_id":"10155398572138797","commenter_b":"The man never said it doesnt happen in the white community. But its not \"white history month\" he was pertaining to this month and what the race can do to honor their dedicated month. He did not say anything about tje white people not killing. Oh wait thought blacks killing blacks is justified right? The constant drive bys and convictions is oj because of your race? How about we say how about all the ghetto gang bangers and the wanna bes stop killing to honor this month whether black or white a thug is a freaking thug. Whites killing whites needs to stop also but we do not have a month dedicated to our history whether it be polish irish English. We will take gary and Chicago and all the mindless killing what race is it primarily? Oh wait its ok or white people's fault.","commenter_a":"I have an idea maybe for Black History Month. The young black kids can stop killing each other. But of course that won't happen.","post_message":"BLACK HISTORY MONTH: Today, and all month long, join us in celebrating the achievements, culture and contributions from black Americans across U.S. history."},{"comment_id":"10153065757271636","commenter_b":"nope, men rape men too.","commenter_a":"Oh I see. Rapists are just misinformed. If only they had read this first, or someone had read it to them at an early age then we wouldn't have this problem that we have today. Women taking sensible precautions has nothing to do with preventing rape. Maybe we should write and share a ten point guide for thieves on why they shouldn't steal. Then we wouldn't have to lock our doors.","post_message":"Worth re-sharing"},{"comment_id":"489292257897396","commenter_b":"As long as yours dangerous people out there with weapons there's no reason to take away mine. If you take away all the guns from law-abiding citizens all you will have left are criminals with guns and there's no way to get all of those guns away from them","commenter_a":"What's the point in saying this every time and never doing anything about it? Of course, more gun control. Giving guns to the general public is fucking stupid.","post_message":"Once again, America needs to answer this question..."},{"comment_id":"538835082988240","commenter_b":"Yes it would 😂 cause you a hoe","commenter_a":"@username this is how we would be with Mr kitty 😂😂","post_message":"\"I pay puppy support...\""},{"comment_id":"1580958245270761","commenter_b":"Charlie Shumate Kind of like how everyone has been brainwashed into becoming a queer, race mixer, feminine male... Man how the times have changed for the worst..","commenter_a":"Rachael Isabella too real though","post_message":"\"We need only go back to Hitler's Germany to see that it can happen to anybody. Anyone can become dissociated to the point where they are not seeing what is happening in front of their eyes.\""},{"comment_id":"1521502694809851","commenter_b":"And once again we don't riot , block busy streets and and make up bullshit like a certain group of people--- absolutely this is murder and a hate crime!!","commenter_a":"absolutely","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news. No riots, no protests, no media coverage. Do you think he should be charged with a hate crime?"}]
