[{"comment_id":"10154228299244218","commenter_b":"FYI this was NOT over drugs!","commenter_a":"clean up cecil county get drugs out the killed will stop . can,not count all the kids pasway in 20 year I live in cecil county iam way ingfor a call my son rusty is died I love rusty but he love his drugs","post_message":"Two people were killed in a shooting Monday night in Elkton, police said. @webpagelink"},{"comment_id":"10153515397661509","commenter_b":"Race and gender identity are two totally different issues lol","commenter_a":"That's disrespectful. If it had been a white person doing a racist joke. There would be no question if he crossed the line.","post_message":"Do you think Jamie Foxx crossed the line? Many viewers of the iHeartRadio Music Awards weren't too happy about his Bruce Jenner joke: @webpagelink"},{"comment_id":"948827975173732","commenter_b":"Alright, Rosa! Good for you and good for Latina women!","commenter_a":"Yes @username with the Latin vote you will be our president 2016 yeaaaa","post_message":"Hillary stands up for Planned Parenthood—and women's rights."},{"comment_id":"1230508030293998","commenter_b":"They can do this and the Toronto Blue Jays can't tell Gibbons to apologize to women?","commenter_a":"Charles once said he wasn't a role model. That's over. Well done to the Round Mound. Also, FWIW, while he has talked in the past about being a Republican, he has supported Democratic candidates consistently and all but begged Joe Biden to run for president before he came on the Final Four show.","post_message":"\"It’s my job, with the position of power that I’m in and being able to be on television, I’m supposed to stand up for the people who can’t stand up for themselves.\""},{"comment_id":"10153254451090671","commenter_b":"and that's why you women are pathetic ladies should not twist my words around","commenter_a":"most women are less productive as far as in the construction field is concerned but in the construction field I think they are paid the same I don't like working with women every time I do I have to work harder just to keep the same production schedule going","post_message":"Under the new law, an employer must show the “differences in wages are due to factors other than gender, that the factor is job related and reasonable and that these factors, rather than discrimination, account for the difference in pay.”"},{"comment_id":"10154330471404087","commenter_b":"....because in a hostile foreign environment you may well have to...I say it's sound advice.","commenter_a":"We will make this World great again!","post_message":"Retired Gen. James “Mad Dog” Mattis once explained his life philosophy to fellow Marines as: “Be polite, be professional, but have a plan to kill everybody you meet.”"},{"comment_id":"10153580764828352","commenter_b":"She needs to be done same way but leave her in the fire crazy birch.....stand there and ask her how it feel s and eat snacks in front of her ass she burns","commenter_a":"She look deranged with that crazy psycho stare","post_message":"Woman arrested for burning 8-year-old’s hands over open flame because she ate a snack without permission"}]
