[{"comment_id":"10154654026369160","commenter_b":"HOLLYWOOD ELITES..... TAKE DOWN YOUR WALLS AND YOUR GATES AROUND YOUR MANSIONS. We all want to have the right to walk onto your property, so that we can also enjoy the excessive good life that you live. We want to swim in your pools and relax in your hot tubs..... we want to sleep in your beds and wear your designer clothes.TAKE DOWN YOUR WALLS AND YOUR GATES!","commenter_a":"By the way the police had nothing to do with Nicole Brown and Ron Goldmans deaths. Awful nice of him in a past year how many officers lost their lives while just in their cars and were gunned down, 5 in Dallas protecting protesters against them, and 3 in Baton Rouge. Really thoughtful to attack the police which have been more of victims than offenders in this country.","post_message":"The director of \"O.J.: Made in America\" dedicated his Oscar to Nicole Brown Simpson and Ron Goldman, and then to \"the victims of police violence, police brutality, racially motivated violence and criminal injustice.\""},{"comment_id":"10155391661993797","commenter_b":"What a shame send this animal to jail .","commenter_a":"Very sad","post_message":"A young mother is facing child abuse charges after police say she kicked her 4-year-old daughter in the stomach for not brushing her teeth. The girl is hospitalized in critical condition."},{"comment_id":"1333030216717005","commenter_b":"She has no talent and is trash","commenter_a":"Levy a fine, and move on. That show was one of the best in a long time. Grande was very good.","post_message":"Singer and actress Ariana Grande surprised the \"Saturday Night Live\" audience and crew with an unexpected profanity during her monologue."},{"comment_id":"10155741989330192","commenter_b":"There are many democrats who share many of conservertive ideas.like ideas about gays ,abortions,veterans rights,the militery.","commenter_a":"They are called libtards for a reason... Those that oppose legal hunting are just bad shots.","post_message":"A group of conservationists is urging Gov. Rick Scott to cancel the bear hunt that is set to take place this fall."},{"comment_id":"581422622060041","commenter_b":"Hahaha!! Funny!! \"Blacks are lazy\" \"Super Predators\" \"Heel\" -Hillary Clinton on blacks","commenter_a":"Make America dumb again is his slogan this guy caught on tape making fun of so many people she makes a mistake with emails an everyone losses their minds he's not for the people of different cultures he order his supporters to attack people an they did why are you voting for him that's the real ?","post_message":"With Medal of Honor recipients seated behind him, Donald J. Trump tells supporters: \"They're so much more brave than me. I wouldn't have done what they did. I'm brave in other ways ... I'm financially brave.\" @webpagelink"},{"comment_id":"1162368457165867","commenter_b":"CORRUPT - I GUESS CLINTON HAS SOMETHING ON YOU!! KARMA - I HOPE PEOPLE SEE THROUGH YOUR CONSPIRACY FOR HILLARY.... I AM GOING TO CALL TO BOYCOTT UTAH","commenter_a":"who, whit ,where ??","post_message":"Could Evan McMullin be the next President of the United States? Full story: @webpagelink"},{"comment_id":"1403734329688680","commenter_b":"these mobs are planed and paid for by the elites and must be stoped","commenter_a":"These people need to be arrested. This is not peaceful protest. It's criminal.","post_message":"BREAKING: Trump Official RUSHED To Safety After What Mobb of Attackers Just Did To Her Outside Child School"}]
