[{"comment_id":"10154729754221729","commenter_b":"She's a cunt.","commenter_a":"It does matter what you call it Killary , our young people in the United States were once again attacked .","post_message":"Whoa. About damn time."},{"comment_id":"619633688227210","commenter_b":"Why do ugly, trashy white women date jiggers??? oH I THINK I HAVE HEARD WHY...","commenter_a":"Its amazing how hes racist agaisnt white men but not white women whats up with that","post_message":"Obama's ex girlfriend just came forward and dropped a shocking bombshell. This comes as no surprise. He can not be trusted. Are you tired of Obama's lies?"},{"comment_id":"10154490507826051","commenter_b":"Absolutely NOT! Lying Ghetto trash Marxists.","commenter_a":"Absolutely did not he's a Muslim has no class.","post_message":"Yes or no: Did the Obamas represent America with class and dignity?"},{"comment_id":"1236189426462383","commenter_b":"#ImNotWithHer","commenter_a":"You mean Hillary campaign staffers posing as sanders supporters","post_message":"Bernie Sanders supporters have taken to Twitter to reluctantly express support for Hillary Clinton using the unenthusiastic hashtag #GirlIGuessImWithHer."},{"comment_id":"870644459698474","commenter_b":"Hillary will win. I'll take more Clinton any day.","commenter_a":"That is disgusting! They just don't get it! We don't want another bush! But their greed will get the better of them!","post_message":"Getting closer to announcing?"},{"comment_id":"10154917863094654","commenter_b":"Can women join this Club??????","commenter_a":"this is the best!!!","post_message":"Handlers of Pennsylvania's most famous groundhog are set to announce whether the rodent will predict an early spring or six more weeks of winter. More about the legendary Punxsutawney Phil @webpagelink"},{"comment_id":"10153932351055950","commenter_b":"FEMALE FAT FARMS WILL RULE TRUMP PRESIDENCY... .LOL.LOL.LOL. FAT CHICK'S BEWARE","commenter_a":"If Hillary cared so much about women she would not have brought this woman's name up. That just shows she will use anyone to get her agenda out there. She's Evil. Just remember she was the person who brought this up on debate night.","post_message":"This former Miss Universe says Donald J. Trump's comments about her brought up bad memories from 20 years ago when she gained a few pounds after winning his beauty pageant."}]
