[{"comment_id":"10153820420328816","commenter_b":"they are whores","commenter_a":"without the John Doe investigation we never find out the Walker's deputy cheif of staff steels $50,000 from a Veterns organization, Walker and his bunch are the worse kind of pigs.","post_message":"Scott Walker signed legislation Friday curtailing the ability of district attorneys to use the John Doe law to launch investigations like the probes they have conducted of his campaign and his aides and associates."},{"comment_id":"10155829380115354","commenter_b":"Give it up Rubio!","commenter_a":"Of course he did!","post_message":"16 days after Trump gave his speech... why not stick his neck out before the media created this bandwagon?"},{"comment_id":"10153968888907894","commenter_b":"I am with you Tee. These woman don't have any sense, you better get with a man with money. Get your own money as well.","commenter_a":"All these females calling her a gold digger but running around single as fuck with some random broke niggas kids they ain't even with....lmao...ladies it's wise to get with a man that can provide and keep yall asses out the welfare office and from working dead end jobs so you can actually raise your kids. ...but yall been taught it's proper and prideful to struggle with a dude that can't even purchase you a house let alone afford school uniforms for public school 😂😂😂😂","post_message":"60-Year-Old Mel Gibson and His 26-Year-Old Girlfriend Are Expecting"},{"comment_id":"10153534266495399","commenter_b":"We don't need him and take little Mexico with you","commenter_a":"And he's supposed to be the \"smart\" one?","post_message":"Asked to clarify, Jeb said, \"Things happen all the time. Things. Is that better?\""},{"comment_id":"10153694586758132","commenter_b":"More than that! They would make her CEO due to affirmative action. Come on now!","commenter_a":"I wonder if a black woman decided to be white would she get a vanity fair interview? #whiteprivilege","post_message":"The latest from Rachel Dolezal."},{"comment_id":"10153775640411178","commenter_b":"Bully!","commenter_a":"\"In the first place, we should insist that if the immigrant who comes here in good faith becomes an American and assimilates himself to us, he shall be treated on an exact equality with everyone else, for it is an outrage to discriminate against any such man because of creed, or birthplace, or origin. But this is predicated upon the person's becoming in every facet an American, and nothing but an American...There can be no divided allegiance here. Any man who says he is an American, but something else also, isn't an American at all. We have room for but one flag, the American flag... We have room for but one language here, and that is the English language... and we have room for but one sole loyalty and that is a loyalty to the American people.\" Theodore Roosevelt 1907","post_message":"Ben Carson makes a bold statement."},{"comment_id":"10153202664107217","commenter_b":"Pmsl yes, parallel parking to the extreme","commenter_a":"@username u do this with jim?","post_message":"Now that's a nifty bit of parking 🚙 @webpagelink Footage: Guinness World Records"}]
