[{"comment_id":"980167608741328","commenter_b":"Trump should just buy there piss ant country..","commenter_a":"So funny","post_message":"What do you think of the proposal to ban Donald J. Trump from entering Mexico?"},{"comment_id":"10153378197295950","commenter_b":"go home please","commenter_a":"When will she realize she is in the wrong party for the rights of women and minorities?","post_message":"\"I have battled breast cancer,\" Fiorina voice says in the ad as clips of the candidate at various campaign events play out. \"I have buried a child. I have read my Bible. I know the value of life.\""},{"comment_id":"327851404005511","commenter_b":"Trump supported assault weapon ban","commenter_a":"And you guys don't have an enemies list? Apparently, Trump is at the top of your list. You really have to quit with the Hitler and Facist rhetoric. All that does is make me want to vote for Trump even more.","post_message":"Erick Erickson, you said it. Fascists and tyrants always have enemies lists."},{"comment_id":"1007260792718180","commenter_b":"You can cuck off to bitch","commenter_a":"So----don't sing","post_message":"Hello, it's me. I've been wondering if you think I give a crap what you think..."},{"comment_id":"10153105313784203","commenter_b":"Speaking of Obama not attending a rally in France, how about Bush, Cheney, and other Conservatives not attending the 9/11 memorial in their own country @webpagelink","commenter_a":"Unlike the communists digging up Kathy Griffin and Margaret Cho, Jay is actually funny.","post_message":"Why the hell do Republicans love Jay Leno so much?"},{"comment_id":"10152844746900667","commenter_b":"Gross looking. Many times, less is more.","commenter_a":"Ugly colors.","post_message":"\"Beautiful things happen when you take pride in yourself. #blackgirlsrock #kyebreaktheinternet,\" the prom queen wrote."},{"comment_id":"571127086402504","commenter_b":"Come on guys, the woman is desperate and nervous. You will see very soon who will come out on top. It's time for some real change.","commenter_a":"Look like this page is also scrambling to save Hillary. It's good to know sanders is getting to her. #feelthebern","post_message":"Bernie and his campaign are misleading voters about what Hillary said."}]
