[{"comment_id":"1333958173358453","commenter_b":"@username you racist prick","commenter_a":"#FakeNews THIS is what it really looked like.","post_message":"An estimated 700,000-900,000 people attended President Donald J. Trump's inauguration today, about half the number of people who attended Barack Obama's eight years ago. @webpagelink"},{"comment_id":"10152937049646051","commenter_b":"Hang her","commenter_a":"Loser","post_message":"A pregnant woman with drugs in her system crashed her car and killed a 5-year-old. When police told her the child had died, she had a two-word response for them."},{"comment_id":"10153642652659411","commenter_b":"Needs to be bombed to death. No more terrorism, no more parasitic immigrants.","commenter_a":"You want to slow down the migrant crisis? Stop bombing the Middle East!","post_message":"Op-Edge: 'The root cause is frankly Europe just not being prepared for this large scale numbers of people fleeing persecution and misery in other countries. Europe has rather just closed its eyes to reality and rather hoped that the situation might just go away' - Keith Best, former Vice Chair of the European Council for Refugees and Exiles"},{"comment_id":"10154937889184885","commenter_b":"She hates white people","commenter_a":"Such hateful petty people. A day after celebrating the birth of your savior and half of you aren't following his example in the slightest. You should be ashamed, but I doubt you really are. Michelle Obama is a human being. Just like you and me. What ill will has she done to you, that you would meet her with such contempt? I am no Trump supporter and I worry about his lack of qualification, but I don't say mean, hateful things about his wife. If she is going to work on internet bullying she may need to start with those that support her husband.","post_message":"\"She's made an effort to wear accessible fashion,\" designer Tracy Reese says. \"I think Jackie (Kennedy) was a great role model but she wore a lot of couture, and things that most Americans could not afford.\" Mrs. Obama, she says, has worn both high-end and moderately priced fashion."},{"comment_id":"1155384687884221","commenter_b":"That's what you get for working for him.....I wonder if he ever payed the little girls who sang and danced for him for a rally","commenter_a":"Trumps motto : if you're stupid enough to trust me you get what you deserve.","post_message":"If you work for Trump, you're going to get burned."},{"comment_id":"10154771311354312","commenter_b":"Suck it up buttercups, she lost, move on!","commenter_a":"Trump won so how is it that anyone can change that! that would be like all the Indian fans protesting the Cubs winning the world series and changing it to the Indians winning! he won just like any other president has won! I did not want Obama in for the second 4 years as a lot of people didn't but you did not see all of us out there doing what Clintons people are doing. If you ask me all of Clintons people are the problem here. If Trump does not do his job then impeach him! but give the guy a chance to MAKE AMERICA GREAT AGAIN!!","post_message":"People upset about Donald Trump's election floated an option that could deny him the White House."},{"comment_id":"1793816267524585","commenter_b":"Amy you should be ashamed for trying to get people to vote for that criminal!!! The things she's going to do to our country aren't going to effect you because you have money !!!","commenter_a":"I'd be much more concerned if I voted for someone who was indited and convicted of high crimes against the United States and humanity!","post_message":"\"Your voting history is public record.\""}]
