[{"comment_id":"1632303213733906","commenter_b":"This dumb chick is over reacting","commenter_a":"Yeah! No thanks your husband has already broken America","post_message":"One first lady has already lost to Donald Trump... could Michelle win in 2020?? @webpagelink"},{"comment_id":"1117850661583687","commenter_b":"She is trash !!","commenter_a":"Or is it Michael Obama?","post_message":"Keep on Rockin In The Free World!"},{"comment_id":"1072091946219346","commenter_b":"Loooool she's just a hoe","commenter_a":"@username its that deep","post_message":"Her bare shoulders were enough to get her sent home from school. Now this teen is baring her thoughts on sexist dress codes."},{"comment_id":"10154322509929087","commenter_b":"Truth Hurts huh you little bitch? go whine and cry somewhere else. you sound like a little girl.. Here I'll give you your wubby","commenter_a":"This is the death of the Republican Party written as a victory. The backlash will be fierce and overwhelming if Trump behaves in office as if he has a mandate.","post_message":"#BREAKING: Hillary Clinton 's popular vote lead over Donald J. Trump is now over 2.3 million or 48.1 percent of the vote."},{"comment_id":"10154125037012377","commenter_b":"Women are smarter than you think. This is always from a man's perspective that we are weaker. Always remember women birth your armies, their children suffer and die. The hands that rock the cradle rule the world. And when they send troops home blind and crippled, it's the woman wives and mother that take up the healing the grieving and the praying. God made us special that way. Someone has to have sense.","commenter_a":"I hope that Trump comes up with some way to penalize the Media when they publish lies.....They should not be able to get away with it.....they put up pictures that are not true with the stories.....the media has become a very negative view on anything with Trump...they dont have the truth in them......I have high hopes for President Trump and do believe he will do a great job.....It is time for all to quit all tthe stupid protesting and join together to help America!!!","post_message":"Americans reactions to President Donald Trump's inauguration were positive with more people saying they are now more hopeful about the next four years than those who are less hopeful, a Gallup Poll reveals."},{"comment_id":"10153101171403417","commenter_b":"Put sheldon Silver in JAIL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","commenter_a":"I wonder why it seems that so many Americans take homeland security so lightly?","post_message":"Last night on CNN, I discussed the impact of #Blizzard2015 on Long Island as well as security concerns after a drone crashed on White House grounds. Watch: @webpagelink"},{"comment_id":"989796557698481","commenter_b":"Women aren't human beings?","commenter_a":"women will die?????? really???? this is incredible... what about how many BABIES HUMAN BEINGS will die???????????","post_message":"Breaking ranks"}]
