[{"comment_id":"916726885042526","commenter_b":"Such a FOOL !!","commenter_a":"He must be hitting the bong again","post_message":"President Obama said he thinks he's been a pretty good president, and he could win if he ran again. What do you think? Read more at @webpagelink"},{"comment_id":"10153934719761813","commenter_b":"@username Go run to your safe space. The ACLU would rather cast legal immigrants in with the illegal Alien filth than make a distinction between legal immigrants and these animals. It's not \"harsh\", it's calling this scum exactly what they are.","commenter_a":"Hey ACLU, these animals aren't \"undocumented immigrants\", don't lump this filth in with those that have legally immigrated here. They are Illegal Aliens, not legal permanent residences, naturalized citizens or here on visas. They broke the law and should be treated like the criminals they are; detained, processed and then deported back to their home countries along with their families. This garbage SHOULD live in fear, be harassed and made to feel uncomfortable. They should be detained, when local LEO interact with them, and then turned over to ICE/CBP for deportation.","post_message":"Since Election Day, the ACLU has seen a renewed sense of urgency from hundreds of thousands of Americans to protect civil liberties. One of our top priorities is ensuring that our communities don’t fall under siege in service of Trump’s quest to deport undocumented immigrants. To carry out his mass deportation scheme, Trump would have to cast his dragnet far deeper into American communities. Even if massive taxpayer dollars could be diverted to do so as a practical matter, the effort will erode the civil liberties of all. Millions of people who live and work along our nation's borders—from New York to Arizona, Washington State to Texas—are already living in increasingly militarized areas where they are stopped, harassed and treated in ways the U.S. Constitution does not permit. Read more about the work already in progress to ensure people’s rights are protected in border communities @webpagelink"},{"comment_id":"1588312174810373","commenter_b":"Killery destroyed evidence after she received a subpoena from the FBI and she Lied under oath! Alot of people have went to jail for less! Our Government and the Media are so corrupt! The same people that have major shares in every media outlet are same people that fund Killery! Saudi and Arab countries!!! I hope you know how they treat Women? Children! Gays?","commenter_a":"This woman has no shame... She will say and do anything for power.. Wake up Dems you're trying to elect a criminal for president.","post_message":"Latest batch of WikiLeaks emails contain details on Hillary Clinton's narrative on Benghazi. @webpagelink \"We see an email exchange among John Podesta [and] other top aides, where Hillary Clinton was being coached on, in their words, 'how to stir up some moral outrage against Republicans' at this Benghazi hearing several months ago,\" Ed Henry reports."},{"comment_id":"1109934812394016","commenter_b":"ah so cute. huma and hillary both have repeatedly philandering husbands.","commenter_a":"when your wife's in bed with the democratic presidential candidate and your home watching the children you have to do something ?????","post_message":"ANTHONY WEINER CAUGHT AGAIN: Sends Kinky Shot To Brunette With 4-Year Old Son Next To Him Get out the eye bleach..."},{"comment_id":"10153586503151336","commenter_b":"Lmao @username is a pussy cuz a girl made it","commenter_a":"@username @username Cody Wilkerson","post_message":"Two women have made military history by becoming the first female soldiers to complete the U.S. Army's grueling Ranger Course."},{"comment_id":"1169496993094128","commenter_b":"Girl, you nuts.","commenter_a":"Don't believe everything you read, folks...apparently Nate Silver got a call from Washington, telling him to \"fix\" his poll numbers from last week. Trump is trumping HRC, and the media is lying to us all. Shoulda picked Bernie when they had the chance. #stillsanders #neverhillary #electionfraud #dnc","post_message":"Our latest polls-only election forecast gives Donald Trump an 17% chance to win the presidency. Polls-plus puts it at 24%"},{"comment_id":"10153213873086051","commenter_b":"Go to he'll bitch","commenter_a":"It's a lion it is legal to poach lions but legal for canned hunting everyone is having a cow because someone killed a famous Lion If you care so much about animals stop going to the zoo and the circus Stop buying products that test on animals donate to animal charitys Bitching on facebook solves nothing this man made a mistake leave him alone you self righteous idiots","post_message":"The hits just keep coming for Cecil The Lion's pride."}]
