[{"comment_id":"10154043419071336","commenter_b":"First, voter fraud exists. People have gone to jail for it. And for every 1 person caught, you know there are more who aren't caught. And yes, foreign nationals who broke our laws to come here ARE less trustworthy, THEY BROKE OUR LAWS. We have enough home grown US haters and uninformed voters, we don't need to add people here illegally to the mix. They have no right to vote. If we can't ensure legal elections we are not protecting our sovereignty. Add that to unsecured borders and there is no USA any more. Try going to Mexico (or any country) illegally, see if they welcome you and let you chose their leaders. We are not bad people for wanting the same protections in our country that other countries offer their citizens.","commenter_a":"You mean undocumented democratic voters, right? CA has now given the right to vote to illegals. Supposedly in local races only. Who really believes that BS? What safeguards are in place to prevent them from voting in national races? None. And allowing them to vote in the first place is against the constitution. Just like illegals holding office is against the constitution. I shudder to think that CA's PC crap will pour into other states.","post_message":"\"We believe that this new law increases safety on California roads by putting licensed drivers behind the steering wheel,\" a spokesman for the California Department of Motor Vehicles said."},{"comment_id":"659111814237594","commenter_b":"I hope you both get shot in the head!","commenter_a":"OMG! I can't believe I live in this country!","post_message":"All in the name of fighting tyrannical Obama and his assault on the Second Amendment. -- Robert"},{"comment_id":"10155143556313701","commenter_b":"Watch and you might learn something. @webpagelink","commenter_a":"The woman left behind her child in a hostile environment so she could save her own skin just to turn around and blame Trump's temporary travel ban as why her reunion with her child got delayed. Talk about one selfish mother.","post_message":"While in the vetting process a Somali refugee, named Sahara, gave birth to her son. Children are not automatically approved to travel, though, so she left her son with her mother in Uganda to speed up the process."},{"comment_id":"886882338071488","commenter_b":"Go hug an illegal alien.","commenter_a":"Obama has done nothing for this country but make us the biggest joke in the world!!!! Hillary is worse!!! She wrote her memoirs and can't remember a thing about Whitewater, Bengazi and now the emails? Worse Secretary of State next to Kerry. How is she qualified? We have become the laziest country in the world and too much self entitlement.","post_message":"Democrats win. It's not even close! Data source: BLS and The Wall Street Journal Read more here: @webpagelink Image by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10152869218796336","commenter_b":"They are illegal!","commenter_a":"Proud of them reporting TRUTH instead of warped pc bs.","post_message":"A California newspaper will continue to use the term \"illegals\" to describe people who enter the U.S. without permission, despite an attack on its building by vandals believed to object to the term."},{"comment_id":"1294762407204042","commenter_b":"She should be arrested!! She a used this horse and disrespected the law","commenter_a":"Arrest her, let her do her time cleaning out stables of horse droppings .. It's equal to mentality !","post_message":"\"She seems nice\""},{"comment_id":"1088448164564744","commenter_b":"MOB VIOLENCE - MUSHY FRAUDULENT L A C K OF LEADERSHIP. VOTE THEM OUT OUT OUT !!!!!!","commenter_a":"Is this what we call, \"Today's Leaders?\"","post_message":"This guy is nuts!"}]
