[{"comment_id":"10154153426863812","commenter_b":"I'm praying!!","commenter_a":"Pray for a safe return","post_message":"Amber alert issued for 2-month-old girl who was abducted from her home by armed kidnappers: @webpagelink"},{"comment_id":"1277527375611846","commenter_b":"@username, and you KNOW she absolutely will DO it, too!","commenter_a":"This election isn't about picking a president! It's about the Law..Yes the Law!!!!USA Law against Sharia law!! Wake up Americans, don't you Dare be fooled,don't you Dare wear the Americans are stupid label, show all those countries out there that your a brilliant Mind and your family will make a smart choice in votes for your Country and what it stands for! God bless our way of life.Amen","post_message":"Anti-Christian extremists are demanding that senior U.S. military chaplains be investigated and punished for praying in uniform. Sign our petition to fight back. We must defend our brave military chaplains."},{"comment_id":"1935250666534672","commenter_b":"How about i kick you instead?","commenter_a":"Look like they're from the bloody Purge","post_message":"... But refuse to quit because they 'love the limelight'."},{"comment_id":"1678604362359824","commenter_b":"@username how about i fuck your wife?","commenter_a":"Ah yes, Israel defending themselves against the crazed islamists wanting to destroy the country and kill all the jews. This page is turning into a progressive shitehole full of regressive thinking. NASTY.","post_message":"Literally the biggest assholes on the planet."},{"comment_id":"10157240650595294","commenter_b":"Nice dress","commenter_a":"I hope we get rain.","post_message":"Will rain get in the way of your Fourth of July celebrations? Jenn Harcher, Meteorologist is going to let us know!"},{"comment_id":"1009601765755554","commenter_b":"Brandon Douglas just remember this. This was a rigged election and the only ones that lost are us by excepting the way things.","commenter_a":"Don't give up Bernie! People still believe in you as being the right pick. Stand up and fight for the Presidency! People will back you!","post_message":""},{"comment_id":"10153228481536519","commenter_b":"Which means no one should have sex with her, dumb ass.","commenter_a":"Oh jeez these comments are sick! Yeah teach your girls to watch how much they drink (and get help if they can't control themselves).and situational awareness. BUT this girl was still raped. Those men are still guilty. If someone is that wasted they crash a bike into your house, you sure as hell don't have consent to sleep with them. If someone is passed out on a couch, you don't have an open invitation to rape them. You people need help","post_message":"\"The truth is... I don’t know the exact number of times I was sexually assaulted.\""}]
