[{"comment_id":"10154105541082093","commenter_b":"Yea man! Go Donald. Get rid of the illegals. I can't wait","commenter_a":"Jeff Sessions = KKK! Another good ole boy for Donald trump...","post_message":"They held up hand signs saying, \"Go Jeffie Boy!\" and \"KKK\" ... The Alabama Republican was rejected for a federal judgeship 30 years ago amid accusations of racial insensitivity... @webpagelink"},{"comment_id":"10152956267682061","commenter_b":"Congratulations, Ginger!!! We love you in Atlanta!","commenter_a":"Congrats","post_message":"Ginger Zee is pregnant and we couldn't be any more thrilled for her! Same with Lara and Amy Robach! @webpagelink"},{"comment_id":"507278876143443","commenter_b":"Sorry but I do not understand why faces of those son of bitches are hidden! People should know who they are ....","commenter_a":"Cut them off and save them This is why when they become adults they attack humans!!!!!!!!!!! Ps. We should not be entertained at a circus by animals but actual talent of humans. Animals should be left in their habitat!!!!!","post_message":"Have you ever heard a baby bear's spirit break? THIS is the circus."},{"comment_id":"1719470721658124","commenter_b":"There illegals Zachary King..... there scared to death.....","commenter_a":"#Trump2016 TRUMP TRAIN","post_message":"Donald J. Trump has revealed how he would make Mexico pay for the wall. @webpagelink"},{"comment_id":"1285543264804515","commenter_b":"No, and unless her ancestors were Native Americans, they were illegals and traitors to the Crown.","commenter_a":"She's as ignorant as she is ugly, does she not know anything about American history for Christ sake.","post_message":"Someone should tell Ann Coulter cocaine makes you age poorly."},{"comment_id":"10154622879034024","commenter_b":"I think she should sue the college to go back and redo the 4 years and maybe learn something.","commenter_a":"There's no way she could be that dumb and have finished high school.I think we need to have a new law enacted Where our leading officials must have t least a IQ of 117 or above.But Them that would knock out 85-90% of them .","post_message":"★★★ Patriots Who Dare... Join our fight to save America! ➠ Click Here @webpagelink/ #BB4SP"},{"comment_id":"1096493903701292","commenter_b":"suck republican dick, thomas! asshole!","commenter_a":"conservatives will go nuts in: 3, 2, 1...","post_message":"More than time to recognize that Black Lives Matter and there are too many incidents of police officers who believe otherwise."}]
