[{"comment_id":"10155866233724199","commenter_b":"@username trump wives were here illegally before became citizens , your an immigrant just like these people. The were properly vetted and that's a fact . S maybe you should go back where your from and see how fast you live after setting on one foot .","commenter_a":"IF YOU ARE NOT HERE LEGALLY THEN GET OUT ! WE HAVE LAWS AND THEY ARE GOING TO BE ENFORCED !","post_message":"Governor Jay Inslee reacts to President Trump's immigration ban. \"The unjustifiable chaos and cruelty caused by President Trump executive order is now on full display, right now at Sea-Tac airport.\" More: @webpagelink"},{"comment_id":"10153476790357490","commenter_b":"Rachelle that the way it was in the day...just saying...thank you for being a stupid bitch!!","commenter_a":"Oh Lord...way back in my day they got an Admin or Medical discharge...if the Navy wanted you to have a baby they would have issued you one with your seabag...","post_message":"MATERNITY LEAVE BOOST, ICYMI – Female sailors to get up to 18 weeks in the year after their baby is born:"},{"comment_id":"1658959434379097","commenter_b":"Nice boobs","commenter_a":"Sad.","post_message":"\"She could play a position if she wanted to,\" Donald J. Trump said of Sarah Palin, who threw her backing behind the real estate mogul on Tuesday."},{"comment_id":"10152927124907293","commenter_b":"because female popes get the same pay as male popes","commenter_a":"1. The premise is not even true. 2. The screaming irony of this makes me think that the @username picked this up from The Onion.","post_message":"\"Why should it be taken for granted that women must earn less than men?\" the pontiff said."},{"comment_id":"812675022209688","commenter_b":"@username, she should have been in jail a long time ago!!","commenter_a":"We need Trump 100%. Clinton is going to do nothing new for the @username people","post_message":"She disagreed with Donald Trump's proposal."},{"comment_id":"10153232276610496","commenter_b":"Fire them, then keep your doors locked.................that is exactly why they do not need to be in this country.","commenter_a":"Not showing up for 3 days to work with no explanation...how is that part of religious freedom...that many accomodationa are not made for Christians...and if Christians prayed in front of Muslims at the same workplace, Muslims would say they were offended...kind of one sided thinking ...","post_message":"\"Prayer is the first priority to every Muslim. We can sustain without a job, but we cannot sustain without prayer.\""},{"comment_id":"10153679249728352","commenter_b":"Pure Evil!!","commenter_a":"SUCH HATEFUL EYES","post_message":"The most hated man in America, 21, smirks as he is hauled away in cuffs and a bullet-proof vest after his arrest ‘for shooting nine people dead at South Carolina church bible study’"}]
