[{"comment_id":"1530656863908230","commenter_b":"Feminism is the CHOICE. You can choose to be a stay at home mom now, you are no longer forced.","commenter_a":"Feminism got women the right to vote, and the right to be equally taxed as men without suffering any of the consequences of their choices (like fighting in war) obviously women are indirectly affected by war too but....this devalued their job and oppourtunities as mothers, thus hurting the family structure by putting extra financial burdens on them to cover the extra tax load. This is why families cannot survive off of one income anymore (obviously there are other factors). Feminism made it seems petty and pathetic to be a stay at home mom and raise your children but it is the most important and difficult job in the world IMO.","post_message":"The work of stay-at-home moms is valued at more than $100K a year. Learn more about the stay-at-home mom stigma: @webpagelink Like ATTN: Video on Facebook."},{"comment_id":"410359492488277","commenter_b":"It's simple women why treat guys like crap then want to be with him poor guy didn't get none for years and this happen f all the women in the world cause if he look like Enrique Iglesias you will give it to him if he was in the street another story","commenter_a":"10 year in jail for him, at this age, is life imprisonment.","post_message":"If convicted, Bill Cosby faces up to 10 years in jail and a $25,000 fine."},{"comment_id":"10153705260739218","commenter_b":"All Lives Mater...another life ended and another life over.","commenter_a":"Every man woman and child makes their own decisions in life...don't know the circumstances but he has to deal with the outcome..not his father...prAyers to both families","post_message":"The son of a Baltimore Police Department commander has been charged with murder, sources have confirmed to the 11 News I-Team on Tuesday >> @webpagelink"},{"comment_id":"784349154999752","commenter_b":"Bitch","commenter_a":"Another racist liberal what does she have against Orange people. Ray","post_message":"Oh, Meryl...."},{"comment_id":"10154185747461717","commenter_b":"@username why don't you grow the f****** up","commenter_a":"So tired of women using their children as excuse for staying in a abusive relationship. Now that she did nothing, she will be in jail and loose her son.","post_message":"Her uncle said that Noor Salman was physically and mentally abused by Mateen and that she stayed with him for fear of losing custody of their son."},{"comment_id":"10153499829950329","commenter_b":"Whooooah Michelle Esquibel Gena Esquibel","commenter_a":"Jenna Benham","post_message":"For a \"kids\" party, yes. Definitely not for adults. *coughs*"},{"comment_id":"10153614155549117","commenter_b":"@username you seem perfectly willing to dismiss the notion that the unborn have rights. I have no idea when to legally call a fetus a human. If a pregnant woman is beaten and loses her child is it simple battery. I don't know. When I was young I learned hunting and gun safety and rule one, you don't shoot at noise, a rustle in the bushes. Why not? Because there is a chance it may be a person. A real libertarian solution would be upon finding out she is pregnant she must claim she doesn't want to take care of a child and surrender right to it. If someone else is willing to take that child and be legally responsible for it then it gets rights and she needs to take personal responsibility (libertarian) and not be aggressive towards the fetus and turn it over on delivery.","commenter_a":"The best thing libertarians could do is reexamine their approach to abortion as their current stand favors personal privacy over personal responsibility and non aggression. Another possibility is to slightly widen the area we need to defend, to treaties,in order to be safe at home. Remember, economic liberty is the most important issue.","post_message":"John McAfee: \"The truth is this year at least there's maybe a 0.005 percent chance that any candidate on this [L.P.] stage wins the election. If we don't, if we get 20 percent, I promise you, if we don't do something to win in a real sense, this world is going to collapse.\""}]
