[{"comment_id":"961900420609625","commenter_b":"Of course Mary doesn't care lol ignorant people usually don't listen","commenter_a":"Your was hoping he would be our first African American president. Instead we got a communist African Muslim!!!","post_message":"President Obama delivers his farewell speech in Chicago."},{"comment_id":"10155583130286509","commenter_b":". Unlike Obama, Trump has control of congress and can appoint to the Supreme court due to the opening. Obama never had that amount of power. Plus Obama was a moron. Trump needs to build that wall. Trump needs to build camps and round up all illegals that can be found. Put them in internment camps till they can be removed to their country of origin. Or just put them in prison like he said for 5 years if they come in the country illegally. We have our president now like the minorities had Obama.","commenter_a":"It is not Van Jones' job to correct people to take away their fears. It is the Trump camp's job to do so. Don't tell people when to feel afraid and when not. You have to make them feel safe and welcome. Donald Trump is the President now. Now he has to do his job for ALL.","post_message":"\"You need to back off.\" CNN's Van Jones exchanged hot words with a Donald J. Trump supporter who argued Jones ought to repudiate fears among protesters that a Trump administration would create camps for illegal immigrants. @webpagelink"},{"comment_id":"1587873301226283","commenter_b":"They won't do that. They are professionals and have ethics.","commenter_a":"This is how it is going to work now for the Libs. If you voted for Trump there will be a price to pay. Lost a lot of money because of Obama in Office and I let it be. Be careful Libs, Don't get Jammed up. Most of the Police, Firemen, and Military are Conservative. What would happen if they decide not to respond because your a known Lib.","post_message":"\"WON'T BE BULLIED.\""},{"comment_id":"1241458632577946","commenter_b":"@username I speak the same to everyone. But no one slaps me. And a pussy like you certainly wouldnt be the one to slap me. But as I stated in the original post. Plant some fucking trees if you don't like it.","commenter_a":"Yea and collapse the economy in less than 2 years. Get educated dumb ass. If you care for trees so fucking much then get the fuck off of Facebook and go plant some trees.","post_message":""},{"comment_id":"1120823271280022","commenter_b":"What you actually mean is that all women are idiots","commenter_a":"Proof that republican women are idiots.","post_message":"If we're going to be honest here, the thing that might be most shocking is that ANY women could look at ANY of these candidates in a favorable light."},{"comment_id":"1142341912527542","commenter_b":"well so are you","commenter_a":"You haven't made a good movie since Good Fellows, sit down and shut up before you piss yourself.","post_message":"Robert De Niro has launched an excoriating attack on Donald Trump. The actor doesn't pull any punches in his criticism calling him a 'fool', a 'bozo' and 'an embarrassment to the nation'. And that's probably the nicest stuff..."},{"comment_id":"635677536633830","commenter_b":"Demons","commenter_a":"@username read the top comment 😂😂😂","post_message":"Name it! #WSHH"}]
