[{"comment_id":"221003188363637","commenter_b":"@username And worse!!!! No wonder she needs to shop!","commenter_a":"Wait wait wait...I thought Trump's doctor told us that if elected, Trump would be the fittest, healthiest man to ever serve as President! You mean I was lied to about Trump???","post_message":"TELL US IN THE COMMENTS!"},{"comment_id":"1137787319581255","commenter_b":"She is a disgrace!","commenter_a":"\"When Democrats win, America wins.\" 😂","post_message":"Everything about the Clintons is fake, including Hillary's faux-Southern accent—listen! #Hillary2016"},{"comment_id":"1598147256865554","commenter_b":"She is such a pig , I can't stomach her !!!","commenter_a":"You sound \"Off Your Rocker\" !!! A lot of you are talking and showing signs that are vulgar and disgusting! My mother always said that a person shows their ignorance by what they say and do! Seems like a lot of ignorant women were there today!","post_message":"Remember when Michelle Obama said \"when they go low, we go high\"? Neither does Ashley Judd ===>"},{"comment_id":"871246712910789","commenter_b":"The face of an ugly, pathetic bitch.","commenter_a":"I would never have breast fed my daughter in public. A woman can go to the ladies room or bring a bottle with her when she's out. I think it's distasteful to breastfeed in public.","post_message":"\"I was almost in tears and creating my own wet t-shirt contest by the time I could pump again.\""},{"comment_id":"10153059344826336","commenter_b":"So the point is immigrants \"Mexican\" people aren't here to do harm they just want to make a living","commenter_a":"Immigrants that come to this country isnt because there criminals, there coming to work to help there familys back home or have a better living then what they had in there country, do you see immagrants stealling banks or doing criminal acts?!.... so maybe yall need to stop being so judge mental yall dont know what yall saying its not there falut that the goverment in mexico is so stupid and not helping there ppl so next time STOP criticizing OBAMA he's helping people that only want to work","post_message":"President Obama's executive action on immigration may be helping violent criminals stay within America's borders."},{"comment_id":"1182540631781356","commenter_b":"ISLAM'S WHORE","commenter_a":"One Can Only Hope!","post_message":"FINALLY!"},{"comment_id":"1157413281045845","commenter_b":"Oh Hillary .... go get a life!","commenter_a":"Stupidty and desperation","post_message":"Remember when Hillary Clinton said refusing to accept election results was \"horrifying\"?"}]
