[{"comment_id":"1857403831172162","commenter_b":"If brains were dynomite these broads couldn't blow their tampx loose.","commenter_a":"Reality sometimes is in our face This just the beginning","post_message":"Classy!"},{"comment_id":"1001016903307871","commenter_b":"this woman is vial","commenter_a":"Can she get away with everything!! She and Bill both should have been in prison over this too!!","post_message":"Independent Counsel Laying Out Criminal Case against Hillary Clinton in Whitewater Land Scandal."},{"comment_id":"1132425910108091","commenter_b":"The Duggars need to be rape themselves so they can experience what is like to be violated only then they will know that is not something you can can forget or forgive and it's even worse when the rapist is a family member that's supposed to protect you.","commenter_a":"Proves they believe girls/women have no value.","post_message":""},{"comment_id":"1125870684199336","commenter_b":"If just like to see her run away!","commenter_a":"Please, NO !","post_message":"Would you like to see Michelle Obama run for office one day?"},{"comment_id":"1009601765755554","commenter_b":"Brandon Douglas just remember this. This was a rigged election and the only ones that lost are us by excepting the way things.","commenter_a":"Don't give up Bernie! People still believe in you as being the right pick. Stand up and fight for the Presidency! People will back you!","post_message":""},{"comment_id":"1037656442936422","commenter_b":"@username , I agree .","commenter_a":"Absolutely! This is the first campaign I have been able to follow totally since I retired, and I am sickened by how words that I have heard myself are mis-quoted and lied about, mostly by the Democrats. The lies are really incredible to me. Do they think nobody is paying attention?","post_message":"Huckabee says the mainstream media is making sure Clinton is \"presented in the best light,\" and goes out of their way to make Trump look bad. Is he right?"},{"comment_id":"1043155299071968","commenter_b":"She is disgusting.","commenter_a":"She's scummy just ignore her 5% I Q","post_message":"JENNIFER LAWRENCE Recalls Attending Same Concert As Trump: “I was adamant on finding him and then making a video of me going, ‘Hey Trump, f*ck you!’” [VIDEO]"}]
