[{"comment_id":"390922764595794","commenter_b":"Amen","commenter_a":"Amen","post_message":""},{"comment_id":"1033509070100318","commenter_b":"@username yes you god damn do! Women throw sex parties and drink alcohol through dick straws for Christ sake! Most women are guilty of cheating at some point in their life. That's what we as a species do, we eat and have sex. Like or hate it, men hunt for women and women love it","commenter_a":"I find it very sad that WOMEN are defending it, what the fuck is wrong with you? I'm sorry you feel that you should allow a man to have his way with you. It's sickening.","post_message":"EPIC! Oh, and the woman in red is a REPUBLICAN! This happened tonight on CNN. Shared by Occupy Democrats, LIKE our page for more."},{"comment_id":"982153291907152","commenter_b":"The wall wont be anywhere as effective as you think. All it will do is provide more cover for traffickers.","commenter_a":"Texas here! We NEED THAT WALL!! 1 million dollars worth of drugs just confiscated last week that came from Mexico! Happens ALL the time! It must stop!","post_message":"Watch: Donald J. Trump addresses the American Legion National Convention in Cincinnati, Ohio"},{"comment_id":"10154469596571523","commenter_b":"How many illegal voters are on that too???!!!","commenter_a":"Who do they poll?? They never call me ever! I think they only poll those that are known demo's.....And personally he doesn't care what they think....he is just doing his job! GO TRUMP!!!","post_message":"President Donald J. Trump's approval rating reached a new low Saturday."},{"comment_id":"1263570023663025","commenter_b":"Be a lying pussy...ok","commenter_a":"Some People would not understand diplomacy, poise and intelligence go way further than acting out of anger and fear (like most of republicans are reacting) Obama is doing exactly what he is supposed to do!","post_message":"\"YOU ARE NEXT.\" President Barack Obama tells ISIS leaders they cannot hide. Read more: @webpagelink"},{"comment_id":"10153461006671717","commenter_b":"Welp since all the lesbians I see on here basically think its hilarious, and a silly hearted statement meant with no hate or bias I guess you're just one of those super bitchy \" right to be offended\" people that wake up everyday looking for a reason to be Cunty.","commenter_a":"I'm not buying it. I don't think the joke was just in good humor. There's enough language here to clearly see that he was being hateful towards the LGBT community. After all, he did say the word \"lesbian\". Isn't that enough to ban him and boycott him from everything? Shouldn't we be calling him hateful names for his aweful transgretions?","post_message":"Funny or die?"},{"comment_id":"10153400550747042","commenter_b":"Good thing those girls were white, if they were black they probably would've been arrested","commenter_a":"The cops are doing their job! These girls are breaking the law. Now let's give the cops a big round applause (being sarcastic)","post_message":"KIDS' STAND SHUT DOWN: They were trying to earn money to buy their dad a special gift for Father's Day."}]
