[{"comment_id":"10153961752341037","commenter_b":"Duh, obamacare is funded by government (taxpayer dollars)","commenter_a":"If obamacare is so great, why is it that the clintons & sanders are not enrolled in it?","post_message":"Bernie Sanders airbrushed the complexities of trying to overhaul health care all over again and Hillary Clinton offered a selective reading of her rival's record on gun control in the latest Democratic presidential debate."},{"comment_id":"1264161686965709","commenter_b":"Sounds like the brides need to chill the hell out lol i would rather go on a awesome honeymoon then spend that kinda money just to walk to a isle... But that's just me and I'm a very different kinda women.","commenter_a":"Retarded....","post_message":"And about $16,000 of that is for the venue alone... STORY: @webpagelink"},{"comment_id":"10153583021397434","commenter_b":"Get that bomb ass dick!","commenter_a":"I had to open up my decoy facebook just to be able to \"anonymously\" say that I've slept with at least 160 different men and have never experienced this.","post_message":"After fucking, while you’re still a tangle of sweaty limbs and heaving torsos, your partner--probably still inside you--looks deeply into your eyes and whispers a husky and sensitive “hey.” Why?"},{"comment_id":"10153615563223812","commenter_b":"Well some people family don't care","commenter_a":"(rolling eyes) if she was white and was found hung in a cell, no one would say a word.","post_message":"While Sandra Bland's family and supporters have been calling for an independent investigation into her death, the DA plans to release the dash-cam footage from her arrest: @webpagelink"},{"comment_id":"10153306552824087","commenter_b":"Good question Eli Richardson Why do straight liberal females have a problem with men using their facilities?","commenter_a":"Even though that has never happened in the couple hundred cities that already have such protections. My city (also in Texas) has had it for 6 years, never a single issue. It's pure hate of trans people. It's transphobia that drives countless people to suicide. It's unacceptable.","post_message":"The Houston Equal Rights Ordinance became better known by detractors as the “bathroom ordinance,” after opponents warned that some protections related to the use of public bathrooms would allow sexual predators to go into women’s bathrooms."},{"comment_id":"10153639899983132","commenter_b":"She didnt make the show! Nene thought the show revolved around her, she cant handle the truth!","commenter_a":"Well that show won't last without her, I will not watch anymore.","post_message":"EXCLUSIVE: NENE LEAKES is leaving the Real Housewives of Atlanta but teases an exciting new project: \"I'm actually going to be doing a new primetime television show with a big legend.\" @webpagelink"},{"comment_id":"10154047914259740","commenter_b":"Prayers for him and his family and all the law enforcement.","commenter_a":"Prayers for the officers","post_message":"The officer was shot Saturday morning while investigating a report of a break-in."}]
