[{"comment_id":"10153356571252093","commenter_b":"Pretty sure I could peel an orange by age 6. (Or if they just CAN'T, that's what mothers are for!","commenter_a":"That people are so lazy they'd pay for a peeled orange is discouraging.","post_message":"If only nature had a way to cover and protect these oranges.... @webpagelink"},{"comment_id":"752331831534238","commenter_b":"This guy is DANGEROUS!!! USA will not be a safe place if this ass hole wins. countries like RUSSIA! Will declared WAR on USA. He is thinking to pressure MEXICO to pay for a wall base in WAR!!! Mexico has many ALLIES! WWIII Don't make a bad decision people!","commenter_a":"He is the devil","post_message":"Watch Trump directly contradict himself — watch more here: @webpagelink"},{"comment_id":"10153997229702042","commenter_b":"You ladies don't have knees or you like the attention... Knee to the groin!!","commenter_a":"Get him off the streets","post_message":"Police are looking for this man who allegedly groped and rubbed his groin against a subway rider on the train. \"SHARE\" this post to help police find this man."},{"comment_id":"962607787132303","commenter_b":"I am a Turkish citizen, as well as a British,! all our cities, streets and everywhere in Turkish borders are full of Syrians.. More than 2.5 million people officialy! Isn't that enough?? You still call yourself\"human\"?? We are sharing our bread and shelters with them. What about you? When it comes to talking about peace and human rights, you are the best, huh?Act now! It's the right time! Or do you prefer watching this American film on vision in your comfy sofas forever??? Barry in mind! ISIS is USA, UK, and IS'REAL terrorist organisation!!! They r the ones! Making, and forcing them to die or leave their homes.!! Then UK, USA, and IS'REAL terrorist organisations can get an easy access to their recourses, gold, diamond, oil, and gas.!!!! You both got it!!!","commenter_a":"If the EU keep housing them they will keep coming and is only going to make the problem worse. If they really wanted safety then they would have stayed in Muslim Turkey. They are all out for the benefits that get lavished on them. You cant blame them and most people would do the same.","post_message":"Bikinis, sun loungers ... and a tide of despair"},{"comment_id":"10153031617927217","commenter_b":"Nope, women can't","commenter_a":"Can they pee standing up?","post_message":"While the two women will graduate this week, they will not serve in the US Army's 75th Ranger Regiment. The US military has yet to lift a ban on women serving in the fighting force."},{"comment_id":"10153210442256336","commenter_b":"Good!! Put that b!tch in jail....","commenter_a":"Were they on Hillary Clinton's server?","post_message":"A Treasury Department watchdog has recovered roughly 6,400 emails from Lois Lerner and turned them over to Congress – reviving the investigation into the IRS targeting of conservative groups."},{"comment_id":"1592202987743626","commenter_b":"She needs to go to jail and pay a Big big fine to get back some of those illegal millions she got","commenter_a":"anyone following trump is b😀😀 tshit car cra !!!!!!","post_message":"\"I think [Hillary Clinton's] greatest accomplishment will be getting out of her email scandal.\" — Donald J. Trump @webpagelink"}]
