[{"comment_id":"10153059344826336","commenter_b":"So the point is immigrants \"Mexican\" people aren't here to do harm they just want to make a living","commenter_a":"Immigrants that come to this country isnt because there criminals, there coming to work to help there familys back home or have a better living then what they had in there country, do you see immagrants stealling banks or doing criminal acts?!.... so maybe yall need to stop being so judge mental yall dont know what yall saying its not there falut that the goverment in mexico is so stupid and not helping there ppl so next time STOP criticizing OBAMA he's helping people that only want to work","post_message":"President Obama's executive action on immigration may be helping violent criminals stay within America's borders."},{"comment_id":"10153262054135779","commenter_b":"It's funny cuz it's true.","commenter_a":"\"...MTV then responded by phasing music out altogether over the course of the next few decades, essentially defeating the entire point of why they're there in the first place.\"","post_message":"In 1983, while promoting 'Let's Dance,' David Bowie takes the then two-year-old network MTV to task for playing virtually no videos by black artists. Watch the amazing interview below."},{"comment_id":"10153128305820933","commenter_b":"Kasich and Taylor can't be responsible when a trusted employee breaks rules behind their backs. Taylor has come out strong against the actions and has expressed deep disappointment that the Trust of the people was broken... as for Spencer (Tim) Balls crazy assertions. Kasich had nothing to do with the ordeal. Spencer (Tim) Ball has a vendetta against Worthington Christian Schools. Kasich's daughters attend the school. That is the only connection between the 2.","commenter_a":"Today's Columbus Dispatch (newspaper) had a good article revealing problems in the Lt. Gov.'s house.","post_message":"Gov. Kasich stopped to greet a small group in beautiful Peterborough, New Hampshire to end the week. See you again soon, New Hampshire! #nhpolitics #fitn"},{"comment_id":"10153664693511336","commenter_b":"Until Obama resigns she stays","commenter_a":"I'm sorry Governor Huckabee chose to support this action. She is a public official and her religious beliefs can not interfere with her professional responsibilities and duties. Is this how he would respond if he was Prresident of the U.S.? I'm disappointed in you Governor. She should resign her position if she is unwilling to comply with the law!","post_message":"Gov. Mike Huckabee joined Fox & Friends this morning to discuss his support of Kentucky county clerk Kim Davis, and why he believes she's remaining \"steadfast\" to her beliefs."},{"comment_id":"1686157554986660","commenter_b":"Smart woman only a dummy would join Scientology!!","commenter_a":"Kirstie, you are beautiful and such a smart woman! I applaud your endorsement of Donald Trump. Don't let your \"neighbors\" get you down.","post_message":"I am sure people in Hollywood are losing their minds right about now, but this actress is NOT backing down. Do you support Kirstie Alley's presidential pick?"},{"comment_id":"10155231887371037","commenter_b":"@username Proof he has no respect for the other branches of government.","commenter_a":"It's pretty sad that he's got to be the target of all this hate. It seems so many people can't go a single day without being hateful or judgemental. How can a group of people that claim to be loving and caring be so hateful and ugly hearted?","post_message":""},{"comment_id":"1807825672796282","commenter_b":"If he gets in please let him build that wall to protect our Canadian women and girls from him and His followers.","commenter_a":"This is what I commented on his \"apology\": You literally said: you grab women by the p----. You kiss them and don't even wait. That sir is sexual assault. You should be apologizing for your behavior not your words. And what about the 13 year old who accused you of rape? Your own wife accused you of rape as well and you shut her up in your divorce settlement. You sir are a disgusting misogynist and will say what you need to to deflect the attention from your personal flaws. You are projecting onto Clinton what you've done yourself. And this isn't about Bill Clinton. This is about who should be the next president, you or Hillary. Your past behavior is proof that you don't care about the women of this country, and Hillary has shown she does. Additionally, President Obama yesterday just signed a bipartisan bill that passed the ...","post_message":"For hours on Friday night, the political world waited for the rarest of expressions from Donald J. Trump — a heartfelt apology. What viewers got was anything but."}]
