[{"comment_id":"10153877851737217","commenter_b":"A girl has no name","commenter_a":"Don't you mean 'so called' Abu Mohammad al-Adnani. If you are going to pre fix names with 'so called' you might as well be consistent. Silly 'so called' BBC Lol","post_message":"Spokesman for so-called Islamic State Abu Mohammad al-Adnani has been killed in Syria, IS-affiliated media has said."},{"comment_id":"10155064205902178","commenter_b":"Don't they know it's a \"shark free zone\"! This method works for criminals who take heed to gun free notices.","commenter_a":"Joe Daniel","post_message":"An 11-year-old boy was bitten by a shark off the coast of North Carolina yesterday, the second incident in as many weeks. >>>wral.com/@username"},{"comment_id":"10156238965050354","commenter_b":"Hillary isn't change She is Washington She is the establishment Everything that is wrong with America Is what Hillary represents!!!!!!","commenter_a":"Are lawmakers going to allow themselves to be sued when a citizen is killed because they can't protect themselves?","post_message":"DEVELOPING..."},{"comment_id":"10153593606745575","commenter_b":"@username That would require the removal of the colored beast as well as the illegals as they are responsible for 49/50 murders in NYC ofr instance. 96% of all crimes in that city and a whopping 98% of all gun assaults. Liberal American preaches these two species are to be housed, fed, clothed, educated and given the best medical treatment in return for their confusion between acting civilized and acting like animals.","commenter_a":"You women need to vote Republican or this will become common.","post_message":""},{"comment_id":"10154383447230745","commenter_b":"She modeled nude! Soft porn!","commenter_a":"Trump is not going to make it past 2017......Bigly!","post_message":"WATCH LIVE: President Trump makes an announcement — will he take questions from the press? @webpagelink"},{"comment_id":"1792151467673200","commenter_b":"Right a true nasty woman!","commenter_a":"The only \"educational\" facet in Rosie is her nastiness! Period.","post_message":"Rosie O'Donnell says she posted a tweet questioning whether Donald Trump's 10-year-old son is autistic because she found it \"educational.\""},{"comment_id":"10153729476553433","commenter_b":"Why oh why does she lie so?","commenter_a":"Both parties are dead, the American Political System is dead. We need a complite overall. Let's start by Bernie and go from there!!! Two things need to happen A major bring out the vote campaing.....Bernie need to win by a landslide If that is not enough we need to come out into the streets by the millions and demand justice....even the day of the convention.....send a clear message that we are not going to take it anymore!!! THE AMERICAN PEOPLE ARE READY FOR A REVOLUTION TOGETHER WE WILL WIN BERNIE SANDERS 2016 President for ALL People The only choice #Bernie 2016 #FeelTheBern #WeWillWin","post_message":"Carly Fiorina said Gens. Petraeus, McChrystal, Mattis, Keane, Flynn all \"retired early because they told President Obama things that he didn’t want to hear.\" Well, Gen. John Keane retired in 2003, for starters. @webpagelink"}]
