[{"comment_id":"10153997696177300","commenter_b":"@username I feel so sorry for you ... I wish he wins and become president so you learn what immigration is ... I want to see you get kick out of another country. Remember the wall is for you not to scape. You Americans dumb supporters are morrons and losers","commenter_a":"The establishment wants a puppet, and clearly they found one in Rubio! The establishment hasn't learned that the more they ram their same old politics (taking care of donors and lobbying corporations) down our throats by telling us to vote AGAINST Trump, that we stand taller, rise stronger with you Mr. Trump. You are for us and we are for you.","post_message":"Yes, Donald Trump could win the White House in November."},{"comment_id":"1658752774184464","commenter_b":"Have you bothered -- of course you have not -- to realize the amount of business your new Fueher is doing in these very same countries? And continues to do so? At this moment anything HRC did is irrelevant.","commenter_a":"The Clinton Foundation accepts donations from the Saudi Arabian Royal family, who have had hundreds of people hung for being gay. But these moron Hillary supporters either don't know it or they're just willfully ignorant","post_message":"'I fully support Hamilton: An American Musical cast taking Mike Pence to task over equality, but..."},{"comment_id":"1065479603531539","commenter_b":"Only more proof that you can't fix stupid! Who gives a damn what these idiots think? I sure don't.","commenter_a":"To heck with DC's","post_message":"The last time they did this, thousands of their CDs were destroyed..."},{"comment_id":"645119115621270","commenter_b":"GET A JOB BITCH!","commenter_a":"Who's going to pay . . . .? YOU ARE!!!!!","post_message":"America.....someday."},{"comment_id":"822069341254814","commenter_b":"Two egocentric over weight idiots !","commenter_a":"The best news I have heard for I would have voted for Christie and Trump I know can get us back on track for our money and bill problems. way to go Christie hope you make vice President what a great team you two would make for America.","post_message":"Thank you Governor Chris Christie! It is time to MAKE AMERICA GREAT AGAIN!"},{"comment_id":"1011455315580612","commenter_b":"Is this guy a republican?","commenter_a":"Ignorance perpetuation personified!!!!!","post_message":"This guy is a complete moron."},{"comment_id":"10152593040747093","commenter_b":"Both need supervision. That dog could have killed that child.","commenter_a":"Can't blame a 3 year old.","post_message":"Parents of a 3-yr-old attacked by a dog are not happy...b/c the dog’s owners aren't going to get rid of the pet… @webpagelink"}]
