[{"comment_id":"10154306922931943","commenter_b":"Can I demand answers to what laws ye dupes say she broke?","commenter_a":"Criminal","post_message":"Hillary Clinton must be held responsible for using \"private\" email accounts and a hidden email server as Secretary of State to conduct government business in violation of the law! Judicial Watch is the one organization with a proven 20-year track record of investigating, exposing, and prosecuting Hillary Rodham Clinton and company. Please SHARE!"},{"comment_id":"1817145371836310","commenter_b":"@username MY BAD...I THOUGHT YOU WERE A WOMAN...NOW I UNDERSTAND...","commenter_a":"Yep. She got mitch slapped, and now she's gnashing teeth. I can't thank you enough mitch. Bravo. I thought you were a spineless rhino, and you probably are, but this is brilliant.","post_message":"Elizabeth Warren took to Facebook Live after being silenced on the Senate floor for quoting a 1986 letter by Coretta Scott King. Now, supporters are rallying behind her with #ShePersisted. @webpagelink"},{"comment_id":"10153073313318445","commenter_b":"The queen only has a cheeky one tho!","commenter_a":"Come on America if the queen can have it. Why can't we?","post_message":"UK's First #Cannabis Pharmacy Opens in London!"},{"comment_id":"1400391526679146","commenter_b":"I was at fort Wainwright... Fucking miserable place no doubt (it was -37 when that pic was taken)","commenter_a":"Thank you for all you do!!","post_message":"I remember hoping I'd get frostbite so my chain of command would get an ass chewing. This is about as miserable as it gets. ~Will"},{"comment_id":"1026033040752819","commenter_b":"And all those boobs in a row on display.","commenter_a":"I feel like the word \"leggy\" came up a lot in this article. As if the author was sorta fixated on this one thing about the girls who tormented her and swift in particular in a sorta Freudian way. Like, \"The evil reign of Taylor Swift, with her forever legs, way too long to be street-legal, stretching between pencil skirts and slightly worn Converse, glossy in the pink-frosted Malibu dusk... Um, I mean, hen culture and mean girls and stuff.\" I don't necessarily disagree with what she's saying, but she is really, really aware of Taylor Swift's legs.","post_message":"If T Swift and her squad rub you the wrong way, you're not alone. Here's why."},{"comment_id":"1267878706625395","commenter_b":"I'm pretty sure she wouldn't need your worthless vote anyway. Trash","commenter_a":"Can't wait til January 20th when your gone!! If you run for president in 2020 you won't get my vote! You put your nose into eating healthy school lunches thatgo into the trash everyday and restaurants.","post_message":"Happy Birthday to outgoing First Lady Michelle Obama!"},{"comment_id":"10153399487739411","commenter_b":"wrong , Britain has nothing to be ashamed about, its not British people planting bombs and blowing their own kind up, if you haven't got anything useful to say except the usual stereo typical crap then stfu and go away, preferably to the middle east if you think the people are so great. Its funny how people such as yourself preach \"tolerance\", care to show an example of tolerance shown by Islam or its followers","commenter_a":"To that ignorant little britain first shitbag you do not represent my country, Britain is built on the back of slavery, racism and bigoted xenophobic imperialism but today it SHOULD stand for tolerance, cosmopolitanism and living in peace with our collective of ethnicities from all corners of the former empire (Including Wales and ireland, remember when it was fashionable to hate the Irish too, wake up muppet divide and conquer is as old as politics itself.)","post_message":""}]
