[{"comment_id":"10154058052466336","commenter_b":"the muzroach must not remain on the face of the earth no more","commenter_a":"He probably wouldn't have been caught coming across Obama's border.","post_message":"Police say they seized four air rifles, eight scopes and 200,000 .22-caliber bullets."},{"comment_id":"454539224670672","commenter_b":"After we bomb the hell out of them , before we put the truss in harms way, and have other countries fighting to. We are close to bankruptcy like Greece, we should not do it alone.","commenter_a":"Should be an option but not the only one. Tired of these numbskulls. So ready to use other people's blood but not their own The Bush family did that, the Obama. Ass did it even he said was not. Clinton did it. If The Saudis want to keep their kingdom let them do it, if the Turks want their country let them invest their oeople, Jordanians, yemens. AND STOP ALL IMIGRATION INTO THE USA","post_message":"Donald Trump wants to send more US ground troops to fight ISIS. Do you agree or disagree with his plan?"},{"comment_id":"1615187908768322","commenter_b":"She is big piece of shit","commenter_a":"Oprah will have to answer to God , I believe Judas turned his back on Jesus . Oprah will have her day","post_message":"WHOA! Take her off TV."},{"comment_id":"865723720214442","commenter_b":"Abortion is murder, and most unwanted pregnancy are related to sin sex with a man they don't love a date of selfish reasons like I am not ready now I am in school or the man runs off or even the man wants her to get one and even beats her.","commenter_a":"There is a planned parenthood in Knoxville that advertises abortions on their website. So why this woman decided to self abort is a puzzle.","post_message":"While attempting to self-abort with a coat hanger, the woman became worried about her own safety. Her boyfriend took her to the hospital where doctors delivered a 24-week-old baby weighing just 1.5 pounds."},{"comment_id":"10153675678941037","commenter_b":"I always thought I was a billionaire on Fridays, but by Monday reality always let me know otherwise.","commenter_a":"Hey John J. Reardon check out this guy disrespecting the Marines !","post_message":"From the upcoming Donald J. Trump biography"},{"comment_id":"10157013356035500","commenter_b":"Sure they do. After its dead. Please! Lol","commenter_a":"They are checking the contents of the stomach of the gator to see if there are any human body parts. They do this by gastric lavage.","post_message":"BREAKING: Officials have captured a large gator at the lake and will examine the gator stomach contents to see if there are human remains. Read more: @webpagelink"},{"comment_id":"1011157232323867","commenter_b":"I heard this interview last night. It was in reference to him making less money.","commenter_a":"LOL","post_message":"That'll convince voters."}]
