[{"comment_id":"1660809704139737","commenter_b":"No. Go away Hillary.","commenter_a":"No Hillairy liar hill itzs in her name add Bill Clinton it says liar on hill ton of bills","post_message":"Hillary Clinton: \"It is with humility, determination and boundless confidence in America's promise that I accept your nomination for President of the United States.\" Watch more here: @webpagelink"},{"comment_id":"988010784567676","commenter_b":"If they dislike our ways so much ,WHY HAVE THEY COME TO THE USA? We all should be telling them to go back to the country they came from.","commenter_a":"Death to Islam. Ban Islam in the USA","post_message":"BOOM!"},{"comment_id":"10153599468079024","commenter_b":"Obnoxious establishment audience. Am I watching Jerry Springer folks?","commenter_a":"can you have the audience quit with the noise, so we can actually hear the questions being asked? it's rude","post_message":"Republican presidential hopefuls take the stage in South Carolina as CBS hosts the ninth GOP debate tonight. Watch live here: @webpagelink. Read the latest updates on CBS New York: @webpagelink"},{"comment_id":"10152807038616636","commenter_b":"Muslims are still a small minority in England. They may cause trouble, but they are controllable.","commenter_a":"Message to Islamlist functionalists.... don't fu**k with the British people...if you want war ....you have it !!!! We'll wipe you off the planet !!!","post_message":"Breaking: Isis have warned of ‘even bigger and more bitter’ things to come..."},{"comment_id":"717585195090025","commenter_b":"With your logic, then what about all those moms bringing their little boys into women's locker rooms and bathrooms? They have penises and they don't belong there. Send them by themselves into a men's room and wish them good luck with the pedophiles who might be there.","commenter_a":"Just because it happens in YOUR family doesn't mean the whole of the rest of society must have their mores changed because YOUR bro/sis has identity issues. This is not and access issue. This is not and equality issue. This is a PERSONAL issue to approx 1.6 million adults and unless your bro/sis has had their genitals 'fixed' I don't want them wagging about in the locker room with my grand kids and great grands. After the 'fix' is in and they've chemically changed themselves to be more like what they think/want to be, I have less of an issue with it. mym","post_message":"Speaking out."},{"comment_id":"697839387073306","commenter_b":"She should have been arrested months ago!!!! Arrest her now and put her away for good!","commenter_a":"Our Justice Department is corrupt. They will not take appropriate action.","post_message":"FBI wants to take down Hillary Clinton after she is caught in huge act of espionage. She needs to be thrown in prison. We can't let her get away again. Do you think Hillary Clinton should be arrested?"},{"comment_id":"1219104934776201","commenter_b":"And this is what this gremlin boils down to!","commenter_a":"This old man ain't going nowhere. Pump up the Trump.","post_message":"The conventional wisdom of the Democratic race holds that Vermont senator is the principled liberal challenging Hillary Clinton. But Bernie Sanders has moved too."}]
