[{"comment_id":"1001898416489082","commenter_b":"Puke and barf!","commenter_a":"Muslim views and laws have no place in America. We have our own laws we don't need islamic sharia laws here,say no to anything muslim.","post_message":"\"Forget the so-called \"Jewish controlled media.\" In the West today wealthy Saudi royals pull all media strings.\""},{"comment_id":"852398211532955","commenter_b":"The DEMOCRAT PARTY IS A DEATH CULT! American deaths do not matter except to attack the Constitution! Democrats and their media mouthpieces HATE Christians, Jews, and conservatives, but support Islam because... ISLAM = DEATH CULT DEMOCRAT PARTY = DEATH CULT (facts): - The Democrat Party has a KNOWN NAZI (Soros) as its key financier and leader. - Fast & Furiously providing weapons to murdering gangs while trying to disarm Americans. - Freeing violent felons to MAIM AND MURDER AMERICANS! - Pushing an open border illegal alien invasion to RAPE AND MURDER AMERICANS, INCLUDING CHILDREN--, then BLOCKING KATE'S LAW which would have reduced all of this! - Treasonous support to fund Iranian terrorism (and nukes). - Ignoring the Islamic RAPE AND MURDEROUS SLAUGHTER OF CHILDREN, WOMEN, AND CHRISTIANS. - Freeing terrorists for a deserting traitor. - Promoting a race war that Satanist Charles Manson would be proud of. - Supporting Planned ...","commenter_a":"It's only been \"home grown\" since you started importing your Muslim brothers into the country.","post_message":"Here it comes..."},{"comment_id":"10153194256163812","commenter_b":"humanity at it best.","commenter_a":"Anaa Rodriguez Jesus Rodriguez Beto Rodriguez no salgan!","post_message":""},{"comment_id":"645397708975441","commenter_b":"Wow, does he have any world facts available to him?","commenter_a":"My 15 year old answered the question","post_message":"This is just laughable."},{"comment_id":"1135192056570151","commenter_b":"Margaret, did you even watch the debate? I think you were the one snorting. Poor Hillary was having a meltdown. Her rigged plan with crooked moderators backfired.","commenter_a":"They are calling the debate the \"sleazy stalker\" debate! Trump not only was of absolutely no substance but he was creepy! Hillary WON! Go Hillary!","post_message":"A good night for Democrats."},{"comment_id":"10153960643118984","commenter_b":"Just take ur stinking ass and ir ugly ass women with u","commenter_a":"You all need to vote ... get rid of this crap ....","post_message":"I can't imagine what this woman must have felt when this Muslim cab driver did this... Do you support this judge's decision?"},{"comment_id":"10154451446444614","commenter_b":"Good that is what she gets. She is a cruel person","commenter_a":"She needs to be criminally charged and have to register as a sex offender.","post_message":"Dani Mathers has been banned from all LA Fitness gyms after she took a photo of a woman inside a locker room and posted it on social media with disparaging comments about her body."}]
