[{"comment_id":"10153478052978984","commenter_b":"This girl is one ignorant PIG !!","commenter_a":"This spoiled brat is headed down the same road as Brittny and Lindsey. She needs prayers not publicity.","post_message":"Pop star Miley Cyrus just said something highly disturbing about Christians. It's especially sad when you consider where she came from..."},{"comment_id":"10154985622284687","commenter_b":"She schould blame her father for this","commenter_a":"Brilliant ! Will do","post_message":" is just it's a wonderful line. I own some of it. I fully I'm going to give a free commercial here. Go buy it today, everybody. You can find it online."},{"comment_id":"10153603488066680","commenter_b":"The only law that need making is that ONE that makes it illegal for people to break the law!!","commenter_a":"The Boston bomber used a pressure cooker, Oklahoma was fertilizer. Killers will find a way. Let's blame the perpetrators, the ideology,not inanimate objects. Law abiding citizens should not have there rights tampered w. Let's enforce the laws we have.","post_message":"\"We need to have the hard discussion and talk about gun laws that allow an individual to legally purchase weapons that facilitate mass killing. We have to have those hard discussions,\" Lynch said Tuesday."},{"comment_id":"1231187963602033","commenter_b":"Hell yed","commenter_a":"I was told that these people that get these free cell phones, they get not 1 cell phone but 4 phones each. I asked how can that be? He told me that they have all these different programs and they apply for them all. It's insane. I say stop the cell phones!!!!!! Cannot wait. Such waste of our, the taxpayers money.","post_message":"Boom! PLEASE LIKE and SHARE The President Donald J. Trump page for all the latest Trump related news! 100percentfedup.com"},{"comment_id":"10153436441037439","commenter_b":"STFU mooslins and go back home.","commenter_a":"Not me Jesus is Lord.We are not under any bondage to fear any thing.They are fighting a losing battie.","post_message":""},{"comment_id":"689911851133407","commenter_b":"white trash...","commenter_a":"She needs never him also never to have children ever again","post_message":"This man repeatedly beat his wife's 5-year-old and would even send videos and pictures of the abuse to his wife. She refused to step in and both joked about beating and killing the girl. Well, a judge just decided what their punishment will be. Was justice served?"},{"comment_id":"10152724871896045","commenter_b":"She wasn't spanked. She was whipped with a STUDDED belt.","commenter_a":"I wouldn't shame my kid in that way but there's nothing wrong with a spanking. Spare the rod spoil the child. If you don't guide them as parents they don't learn.","post_message":"A Florida woman is charged with child abuse after she sent her daughter to school with a t-shirt shaming her about bad grades. It's what the school noticed after giving the girl a new shirt to wear that got the mother arrested."}]
