[{"comment_id":"10153701497529740","commenter_b":"Ben what is the answer. I'm sure more violence isn't but then what. Flowers, prayer, a handshake. These people, I use that term loosely, are predators. How do you stop a predator? You can try and take the source of the problem. Drugs for the money and high. Its a start. Not as easy as you might think.","commenter_a":"Tell the felon to STFU. Chicago is out of control. Most of us are not in that city's position. You can't control a city like that unless you show aggressive behavior and make these criminals know you mean business. This might not work in most places but Chicago is falling apart.","post_message":"The highly awarded Cmdr. Glenn Evans who has thrown himself in front of bullets to save fellow officers is now under scrutiny for same aggressive tactics that he's been praised for."},{"comment_id":"613516002130239","commenter_b":"Women wear ties","commenter_a":"Men are expected to wear ties, that's also sexist.","post_message":"Nicola Thorp says she was laughed at for asking if a male colleague was expected to wear heels too. 👠👠"},{"comment_id":"10153187675581336","commenter_b":"Obviously the Muslim student. If she doesn't want to watch it go get a coffee or do something else. I mean I don't like certain movies but instead of causing a ruckus I just don't go see it. Remember...we do live in a FREE country.","commenter_a":"We're just going to let them dictate to us what we can watch in our own country!?!","post_message":"President of the University of Maryland College Republicans: \"This isn't a racist film. It's about a decorated American war hero who [risked] his life for you and me and all the viewers.\""},{"comment_id":"10154836011454641","commenter_b":"Muslims should be exterminated..ambassadors of evil!","commenter_a":"And now he funds terrorism, giving weapons to the same people that have just been found to of made a mass grave in Aleppo of civilians. Scumbag.","post_message":"He was broke after running a losing campaign, his credit card was declined and he was quickly losing hope on pursuing a career in politics."},{"comment_id":"1140743049271284","commenter_b":"Little girl, you are asking for a theocracy, which America is not. Time for you to leave and go to Iran, pookie. No one wants your cowardly, uneducated, anti-American traitor self here.","commenter_a":"If God said it, it is settled!, no matter what any pervert says! And the supreme court is not supreme!, God is!","post_message":" represent the people, and the people have shown several times that they are opposed to this, and are in favor of traditional marriage, state Rep. Bill Chumley, R-Woodruff."},{"comment_id":"1163328470392328","commenter_b":"A worthless bitch","commenter_a":"She is an amazing woman that should be admired. A class act.","post_message":"First Lady Michelle Obama continues to top lists of most admired women in the world. Do you admire her?"},{"comment_id":"578535808963586","commenter_b":"Little beaver !","commenter_a":"10208389159192541lol smh","post_message":"Happy Groundhog Day—here's to six more weeks of winter. Thanks to Believing in imaginary friends and fairy tales is outside of my age bracket for sharing."}]
