[{"comment_id":"10153275718534726","commenter_b":"Sometimes really rebellious kids need a bad scare, and yes, they should be afraid of cops. It's societies way of dealing with bad people. It's the people that don't fear cops that I worry about.","commenter_a":"good","post_message":"@webpagelink"},{"comment_id":"1220141934692263","commenter_b":"Most hard working Latino's are no different than any other American that love their country. They want good jobs and a dependable future that illegals won't take their jobs. If they vote for Hillary they know their jobs will be gone. Either by illegal immigration, Middle East immigration or bad trade agreements that will move their jobs overseas. @webpagelink","commenter_a":"Love it.. No only I don't want him for my daughter I don't want him for my sons Trump is bully bully should never be rewarded.. I'm voting blue don't matter who, because Red is to dangerous to give my vote too","post_message":"According to Hillary Clinton's team, the intention of the ad is to show the effect Donald J. Trump's \"hateful rhetoric towards women is having on our daughters.\""},{"comment_id":"10153402936366636","commenter_b":"It's funny lads, the women is clearly having a bit of fun. You all must be really fun at parties.","commenter_a":"Dad could be doing house duties as well. We can not say he does nothing at this house by watching a Video. I think the purpose of this is to show how this super-mom is capable of dealing with the 4 kids, multi-tasking, having patience, having the gentle touch, etc..","post_message":"We can't stop watching this video of a mum getting her four kids ready in record time"},{"comment_id":"10153551887101130","commenter_b":"it was funny....people lighten up","commenter_a":"Be serious. Not offensive","post_message":"You be the judge."},{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"},{"comment_id":"10157024443115354","commenter_b":"But you'll let your politicians scrub the term \"illegal alien\" from your laws!!! Just another step towards amnesty!!!","commenter_a":"We began a WRITE IN campaign for Donald Trump in Colorado. We will show America we can not only Recall Libtard Legislator's who go after our Gun Rights, we will also go after Fascists hidden in the GOP.","post_message":"Colorado Republicans OUTRAGED..."},{"comment_id":"10153321016436051","commenter_b":"What kind of a twisted 'person' would do that? She belongs in a lock-up hospital.","commenter_a":"Anyone who does this when they are very young, will be sorry as they get older---","post_message":"Remember the woman who did this to an innocent animal? Well, she just got some bad news."}]
