[{"comment_id":"1703542769705464","commenter_b":"Nothing wrong with the east end of london. I used to go there most weekend to watch West Ham. Most of the whites moved out so blame them for not integrating.","commenter_a":"What a load of BS.. The best thing about britain is that its a big melting pot of all cultures and religions and we all get along fine apart from a small minority of extremists.","post_message":"According to a shocking new report"},{"comment_id":"944373212266686","commenter_b":"Planned Parenthoods primary function is abortion. Enough said. Defund it.","commenter_a":"Only 3% of Planned Parenthood's funding goes to providing abortion. None of that money comes from taxpayers. Defunding Planned Parenthood means defunding millions of dollars in preventive care, cancer screening, contraception (which reduces abortion), STI screening, and other such essential services. I'm pro-choice, but if you guys have such a problem with abortion, why don't you just campaign to force Planned Parenthood to stop providing abortion services and leave everything else intact?","post_message":"Wow."},{"comment_id":"10156247602125354","commenter_b":"Waaah, send them home","commenter_a":"Ha ha ha ha ha","post_message":"Newsflash: you wouldn't BE in jail had you not illegally entered the country."},{"comment_id":"1237059042980790","commenter_b":"He's got my vote. illegals get out","commenter_a":"Trump is a racist POS!!!","post_message":"There may be a lot of other games out there that look similar, but Call of Duty is still in a class of its own."},{"comment_id":"10158325816450192","commenter_b":"@username I do worry about that difference is I can go in the bathroom with my son. Can't do that with my daughter. Point is if you a swinging a sausage you have no reason to be in a womans bathroom.","commenter_a":"@username How is it fair to let a man use the same restroom as my Daughter. Its not marginalization of those that are different its preventing those that don't need to.be exposed to it. Sorry to.many sick-o's in the world today to alow this.","post_message":"The Trump administration will revoke federal guidelines telling public schools to let transgender students use bathrooms and locker rooms matching their chosen gender identity, a government official said Wednesday."},{"comment_id":"10153287032506770","commenter_b":"Ugliest drag queen","commenter_a":"She sucked big time!!","post_message":"Did you see her performance?"},{"comment_id":"1000377376688677","commenter_b":"Just stay the hell out of America...we don't need your crap here.......Stay in your own country......These buttwipes are allowed to do this in their country, so go home and do what you want, keep it out of America!!!!!!","commenter_a":"1. First the US gov attacks its own people on 9.11 in false flag operation 2. They blame the attack on Osama Bin Ladin, a fictitious character created by the CIA and played by several actors. 3. The US makes war on two countries using false pretexts for war, both times. 4. The US uses drones to kill \"terrorists\" which include many innocent Islamic peoples 5. The US gov pretends to kill OBL as some kind of fake victory. Obviously, they cannot allow the remains to be scrutinised so they jetison it at sea and take no photographs either. All lies. 6. The US War on Terror is very similar to the Crusades where four centuries of young Christian men were lied to by the Pope and told to go brutalise and savagely attack innocent Saracens who were safeguarding the Holy sites in Palestine 7. In the US, whites kill ...","post_message":"And he wanted to take a second wife 'because it was allowed under Islamic law'"}]
