[{"comment_id":"1032739630099842","commenter_b":"Bigotry must be confronted every time it raises it's ugly head. Shamefull Republicans","commenter_a":"Newsflash! Only God can judge. These so-called phony 'christians' will go to hell before anyone else....","post_message":"A Florida church and anti-gay pastor saw a quick backlash from residents of the community after putting up a hateful anti-gay sign."},{"comment_id":"10155182405833984","commenter_b":"The only sane thing this woman has said in years","commenter_a":"YES !!","post_message":"Nancy Pelosi just dropped a lot of jaws with what she had to say about impeachment. Donald Trump will definitely want to hear about this..."},{"comment_id":"545444305663576","commenter_b":"She will kill the U S A","commenter_a":"MORE LIES!!! Her horns are really showing out! Gggrrrr","post_message":"Hillary Clinton says that Donald J. Trump's idea of making \"America great again\" is code for \"let's take America backward.\" Thoughts?"},{"comment_id":"10152914112731680","commenter_b":"Many of us are of the opposing thought of this comment. The founding fathers had plenty to say for support of separation of church and state. If you are referring to the Declaration of Independence, the one time there is use of the word g-d, it is the document used for the separation from England, it is not our law or government structure. The Constitution is a secular document and no where within its body is the word G-d, bible, Jesus, etc used.","commenter_a":"Don't bank on it... Many Americans, republican & democrat, are really disturbed by the recent directions our government has dragged us... Anti-antisemitism, antichristianity, pro-Islam, pro-gay, pro-socialism, pro-communism, anti-gun, anti-speech two-way racism with one-way consequences... Many are fed up. There are NO good choices for candidates out there in either party so far.","post_message":"The 2016 map is favorable for Democrats, but margin for error is slim."},{"comment_id":"10153665753806336","commenter_b":"That was THEN! This is NOW! The law of the land NOW is all that matters! Let go of the past and get with what needs to be done now! NO more illegals. I don't care if they are baby's or adults, they have to go back! They don't belong here period!! Stop saying we are all here illegally too, it makes it clear you think it is ok for these things to happen. I see most of your last names are hispanic.","commenter_a":"The correct term is illegal alien not illegal immigrant...read the constitution..those people have no rights here and neither do those born here from illegal aliens...the constitution says they are not citizens of this country.","post_message":"Border Patrol officers near San Diego noticed that the driver, a U.S. citizen, was acting weird, so they used imaging technology to inspect the car."},{"comment_id":"10154205810731179","commenter_b":"Ah misogynist women are the *best*.","commenter_a":"Don't flatter yourself lmao. Look at his wife 😍😍","post_message":"#WomensMarch"},{"comment_id":"10152776917200779","commenter_b":"Bitch please...","commenter_a":"Too late, President Obama, you should have spoken out earlier!","post_message":"President Barack Obama voiced his disapproval of the recent rioting in Baltimore in a press conference today. \"There is no excuse for the kind of violence that we saw yesterday,\" he said. \"It is counterproductive.\""}]
