[{"comment_id":"10153881891966782","commenter_b":"I think you ladies are missing the point of the story","commenter_a":"Here let me help you pay attention Army=soldier Navy=sailor Marine corps=marines Air force=AIRMAN you're welcome get it straight","post_message":"A Kirtland Air Force Base soldier and his wife are getting a lot of attention for something they posted online. @webpagelink"},{"comment_id":"10154081202079205","commenter_b":"We now need the DNC to forever get rid of super-delegates. This should be an immediate mission, so this never happens again. Contact the DNC and demand we end the Super-Delegates! #DNC #NoMoreSuperDelegates #ListenToVoters #VotesMatter @webpagelink Mailing address: Democratic National Committee 430 South Capitol St. SE Washington, DC 20003 Main phone number: 202-863-8000","commenter_a":"Yes it was a circus , that's too bad , 15 rounds Trump TKO not a knockout","post_message":"What did the polling look like heading into the CNN New York Democratic Debate, did the polls impact #BernieSanders or #HillaryClinton performance in the debate?"},{"comment_id":"1579218252372572","commenter_b":"You k ow it is . She can't win. Otherwise","commenter_a":"Narcissists must have someone or something to blame for their inadequacies and failures.","post_message":"\"I'm afraid the election is going to be rigged, I'm going to be honest,\" Donald J. Trump told a crowd on Monday, just days after he criticized the \"unacceptable\" general election debate schedule."},{"comment_id":"236858020109682","commenter_b":"Get the lady off the pic","commenter_a":"He got in there by something called \"voting\". Just saying","post_message":"LIVE VIDEO: 'Not My Presidents Day' anti-Donald J. Trump protests are happening across the country. WARNING: Viewer discretion is advised"},{"comment_id":"10154242655245470","commenter_b":"@username bush got much much more killed. Both are evil.","commenter_a":"Wasn't there a war going on? You all are concerned about her supposedly lying and 4 military personnel died? Any concern about weapons of mass destruction lie GW Bush told and has been responsible for 7000 deaths?","post_message":"The suit claims the victims' deaths \"were directly and proximately caused by the negligent and reckless actions of Defendant Clinton.\""},{"comment_id":"10155037977401509","commenter_b":"Hillary basically said hey let's use intelligence to figure out where they are coming from. Trump just wants to get the military involved and kill them all.","commenter_a":"Both called for war so what's the difference? Obama's the one who's weak. Ms. Clinton is a savage compared to Obama and Trumps Attila The Hun lol","post_message":"Donald J. Trump and Hillary Clinton struck different tones following the attack."},{"comment_id":"1707811955905494","commenter_b":"Sara are you looking in the mirror while you type???","commenter_a":"Yea its stressing me out my gosh what more does this man have to do before he actually gets in trouble??? OH AND THE FRUSTRATION THAT WE THE PEOPLE OF THE USA HAVE NO VOICE","post_message":"Two-thirds of Americans say that the future of the nation is a significant source of stress, according to a new poll."}]
