[{"comment_id":"1091099404330292","commenter_b":"And we should sue strip clubs that don't have fat chicks dancing too and put them all out of business!!!","commenter_a":"I just can't even with this clown. Projection at its finest.","post_message":"Whenever Trump came to visit, managers say they scrambled to make sure only the youngest, thinnest, most attractive women were on duty: “Mr. Trump doesn't like fat people.”"},{"comment_id":"1025513424232102","commenter_b":"THAT BITCH NEVER HAD A MIND","commenter_a":"Who's gives a fling f--k what these assholes say .nobody watches that so called show anyway.get ready to pack bitch","post_message":"I think I can see steam coming from her ears! @webpagelink"},{"comment_id":"519948784859162","commenter_b":"They should be deported","commenter_a":"yes","post_message":"Students Replace ‘Under God’ With ‘Under Allah’ In Pledge. If you are going to live in our country, you should respect our culture. Do you think this is wrong?"},{"comment_id":"1118006468215013","commenter_b":"and illegals.","commenter_a":"Lol same old democrap bs. Yes the GOP is trying to keep Millon's from voting. Millions of dead people.","post_message":"Mrs. Clinton is out accusing the Republicans once again of plotting voter fraud, and she is making this allegation in front of African-American audiences."},{"comment_id":"10152910836255779","commenter_b":"Simply stated, the majority of the comments on this thread express what she is all about. Feminism, my eye tooth!","commenter_a":"Remember the days when you had to have talent to make the cover of @username? #TakeMeBack","post_message":"Reality-TV juggernaut, selfie queen, actress, model, mother, Internet-breaker, entrepreneur and video game subject Kim Kardashian has something to say: \"I believe that I am so much smarter than I'm portrayed.\" The 34-year-old megastar talks about her scandals, family, and feminism in our wide-ranging new cover story. Here are 11 highlights you won’t want to miss: @webpagelink"},{"comment_id":"10153840278814497","commenter_b":"That would put a LOT of male caucasians over 30 out of country.","commenter_a":"50% Talent competition and 50% swimwear competition.","post_message":"Step 1: Filled-out refugee application materials are thrown onto a large, unorganized pile of folders on a desk at the United States immigration headquarters"},{"comment_id":"10153691446913984","commenter_b":"Trey what the bitch in jail","commenter_a":"Someone should call that witch on the carpet. She's a corrupt liar, but I guess that I am supposed to be OK with that because she is a Liberal.","post_message":"Looks like Hillary Clinton just got another piece of bad news, and it's from one of her least-favorite people. 'Bulldog' Gowdy is hot on the trail! Do you support Trey Gowdy's fight to hold Hillary accountable?"}]
