[{"comment_id":"10153290298049087","commenter_b":"You think the people who think that immigrants constitue criminals when in reality they commit less crimes than native born Americans are the smart people? Crossing the border doesn't make you a criminal since in 49 States, crossing the border is a civil issue.","commenter_a":"Donald trump's campaign is all about making America racist again. It isn't coincidental that all of his supporters are idiots.","post_message":"“I’m going to unify. This country is totally divided,” Donald J. Trump said in an interview with CNN's Jake Tapper. “Barack Obama has divided this country unbelievably, and it’s all hatred, what can I tell you, I’ve never seen anything like it. I’m going to unify the country.”"},{"comment_id":"895880550545124","commenter_b":"An actual woman.","commenter_a":"This is a weak argument.","post_message":"Maybe liberals should have thought about how much they wanted to focus on Michelle and Melania's speeches before they started losing their minds. With so many people looking at the speeches this was gonna happen."},{"comment_id":"10150755555864999","commenter_b":"Because Bernie is a threat to their entire way of life.","commenter_a":"You guys are honestly so biased, this is good! I don't want a president who can't go 5 minutes without talking about their bible, and I much prefer a secular president, as does our Constitution with the whole separation of church and state thing. Why do.you have to twist everything in the world into a negative for bernie and positive for hillary.","post_message":"Unlike Hillary Clinton, who states emphatically that she is a Methodist “person of faith,” Bernie Sanders responds to questions about his beliefs by turning the conversation toward political ideals."},{"comment_id":"902972626429153","commenter_b":"This has nothing to do with muslims.Shut up!","commenter_a":"give muslims a planet and they'd still not be satisfied","post_message":"The barbarism continues"},{"comment_id":"556876431104063","commenter_b":"Put a cap in her ass :-)","commenter_a":"I'll still bone her! Even with a mangled face! What's the point of the story?\"did you see her legs?","post_message":"The police state: before and after... The Free Thought Project.com (Y)"},{"comment_id":"430918413735174","commenter_b":"No inadiment object kills, ie, knife, gun, car, tire iron. It takes people to pick them up use/drive to kill someone. If y'all did your research, guns are not the leader in killing people. Your wife's Rolling pin is up there. Smh at some of you.","commenter_a":"Just waiting for the \"guns don't kill people\" squad","post_message":"\"More than half the women murdered each year are killed with firearms — and in nearly 75 percent of those deaths, the weapon is a handgun.\" Fault Lines: Death in Plain Sight, tonight at 10pET"},{"comment_id":"475959349195637","commenter_b":"@username BITTER GAY HATER!!!","commenter_a":"@username 2016!","post_message":"Tony Perkins Rallying Iowans for Ted Cruz: @webpagelink"}]
