[{"comment_id":"547567615431531","commenter_b":"And these stupid women continue to bash America when they could be free from the tyranny they have lived with for generations!","commenter_a":"This is not an act of religion, it is an individual's act. We all know who Lorena Bobbitt is but dont go around saying all white christian women go around cutting off male genitals. Perspective people, perspective.","post_message":""},{"comment_id":"595270947330151","commenter_b":"Absolutely the most corrupt female politician! Bad for the US!","commenter_a":"Hillary is a PIG","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down. She is in trouble. Let's show her our support. Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"},{"comment_id":"10153513797158701","commenter_b":"Snaggleteeth women put up with more bs. Lol gross though!","commenter_a":"I have great teeth, and I cannot even get a date! I always wonder how snaggletooth women like that get a date.......LOL","post_message":"A Georgia woman is accused of going on a violent, drunken rampage after her boyfriend refused her advances."},{"comment_id":"10153780150441509","commenter_b":"That's nasty","commenter_a":"Shave your freakin pits.","post_message":"What do you think about the growing trend? The \"free to be hairy\" notion has caught the attention of some of Hollywood's most notable stars, too. @webpagelink"},{"comment_id":"955289837857113","commenter_b":"How about we start with u lady . What a Moron!","commenter_a":"She should start with herself.","post_message":"(Video) 2 lies woven together to justify depopulating the Earth... Full Story: @webpagelink"},{"comment_id":"10153573434494087","commenter_b":"Oh for the love of God, I fear for the United States when that evil emotional vampire gets the keys to your White House!!! Vote Trump. Vote Sanders, for all things decient don't have that evil woman near the White House","commenter_a":"Trump for President and Hillary for Prison","post_message":"Two of the top three most retweeted tweets of last night's Republican debate were from Hillary Clinton, while none of the GOP candidate even entered the top 5."},{"comment_id":"10153457138529342","commenter_b":"With clothing like this... Close the borders!","commenter_a":"Ya'll do know that \"Mexican\" isn't a race, it's a nationality...","post_message":"Have you seen Jonathan Figueroa? He's believed to be driving a maroon Ford Taurus. He's a person of interest after a mother and child were found dead in a southeast Houston home. #abc13 FULL STORY---> @webpagelink"}]
