[{"comment_id":"10155063304006350","commenter_b":"She's 100% right. She's a true narcissist, there would be no room for a child.","commenter_a":"not everyone is and that's totally fine. I hate when people keep asking childless women and insisting. LEAVE THEM ALONE!","post_message":"One role Oprah Winfrey insists she wasn't suited for: motherhood."},{"comment_id":"10153473377133132","commenter_b":"She needs a vaginal reconstruction!","commenter_a":"WEIRDO","post_message":"Still haven't bought a gift for mom? The 19 Kids and Counting matriarch is going to fix that."},{"comment_id":"1782119588705977","commenter_b":"@username Dumbocraps can't read. They need pictures.","commenter_a":"never once have I cared or wondered \"What would Eric Trump think?\" about... anything.","post_message":"Donald J. Trump's son thinks that his tax returns should stay private."},{"comment_id":"10152691933545950","commenter_b":"You look like a crooked bitch","commenter_a":"Yeah and what they are going to do give him the death penalty.....dam sure won't let him walk like they do those crooked a** cops","post_message":"A suspect has been arrested in the shooting of two police officers in Ferguson, Mo."},{"comment_id":"1209490769090378","commenter_b":"Hillary is no lady she is more of a whore.","commenter_a":"We've already learned that this lady is a huge liar. What she says, and what she can do, are 2 different things. Obama just got blocked, so, hopefully this we won't have to worry about it and Trump will just be elected. Fingers crossed.","post_message":"DON'T let this woman be elected!!! @webpagelink"},{"comment_id":"10153828491470329","commenter_b":"marry me","commenter_a":"@username 2, especially 2","post_message":"We might as well put a ring on it at this point."},{"comment_id":"922774087855770","commenter_b":"And my favorite flavor of boot is the one I'd plant square in your ass for being such a pussy...sir.","commenter_a":"SO, he converted to Islam a couple months ago and he is talking about oppression in America!!!!! He is some kind of stupid ignoramus.","post_message":"You thought him not standing was bad? This is FAR WORSE."}]
