[{"comment_id":"990159621088681","commenter_b":"Party affiliation is not THE ISSUE & what you should be voting on here Is Making America BETTER, PROSPEROUS & SAFER. IF YOU WANT MORE LIES..MORE CORRUPTION ...MORE $$$$$$$ GIVEN TO THE MIDDLE EAST...MORE WEAPONS SUPPLIED TO THE RADICAL GROUPS....MORE ILLEGALS COMING IN... MORE MURDERS..SANCTUARY CITIES... ...VOTE HILLARY.. YOU are the SHEEP. THE UNION HAS MADE YOU FOLLOWERS. SOUNDS LIKE MOST UAW MEMBERS ARE WISING UP. LOCAL 909 MEMBERS HAVE. EDUCATE YOURSELVES. WATCH: CLINTON CASH HILLARY THE MOVIE HILLARY'S AMERICA 13 HOURS READ: GUILTY AS SIN PARTNERS IN CRIME CRISIS OF CHARACTER ....and so much more... Investigate the CLINTON FOUNDATION.. HOW THEY HELPED (LOL) HAITI. They stole billionsof donations from these poor people. CLINTONS ARE FULL OF LIES. THEY MUST NOT BE TRUSTED! !! HILLARY CLINTON IS A WICKED WOMAN..for those who follow LOUIS FARRAKHAN, he States this fact, he also states how obama has failed his people. Look it ...","commenter_a":"Out of all the people in this work and these two clowns are the only choice","post_message":"Donald J. Trump is speaking this afternoon at Macomb Community College in Warren."},{"comment_id":"1263441190347909","commenter_b":"Exiguimos la Cabeza de Juan Manuel Santos Calderon Presidente Eunuco de Colombia, Denodado Comandante santiago de las Farc, lo mismo que de los Altos mandos de las Fuerzas armadas por traidores y por aceptar el soborno del Gobinero Naco terrorista Criminals de Santos y su Asquerosa Estirpe. Esto es lo que dir un honesto y verdadero Jefe de estado. Los Colombianos pueden tener la tranquilidad que sea cual sea su elecci en el plebiscito, estar seguros porque las fuerzas del Estado no se doblegar y se han fortalecido\" No lo que dijo Santos? Emisario de FARC y Presidente de los narco terroristas genocidas de las Farc. est preparadas para guerra urbana si se cae proceso: La mas asquerosa extorsion y amenaza a los Ciudadanos. Justicia Verdad Patria o Vida.","commenter_a":"Senator, please oppose any and all gun control propsed by the Democrats. They simply want to disarm the American people to suit their own separate agenda.","post_message":"Today, Senator Nelson and I urged the U.S. Small Business Administration (SBA) to provide assistance to the small businesses in the Orlando area that have been closed off to the public in the aftermath of the Orlando attacks. In a letter to SBA Administrator Maria Contreras-Sweet, we requested assistance to the affected businesses, such as disaster relief loans. Read the letter here: @webpagelink"},{"comment_id":"10154166342376717","commenter_b":"FUCK HER","commenter_a":"I think Caitlyn is a fake I mean if she was a true Transgender she would've turned her back on trump a long time ago","post_message":"The transgender reality star and former Olympian is believed to have accepted the invitation and is looking for a plus-one to accompany her."},{"comment_id":"10153771279973908","commenter_b":"Gotta be relaxed, to perform","commenter_a":"Another reason why Trump is not Presidential material. (LOL)","post_message":"Collective Evolution"},{"comment_id":"10153233936119170","commenter_b":"Yes, she belongs there. Always enjoyed this show and hae a good laugh at some stupid people.","commenter_a":"Fodder for \"World's Dumbest Drivers\".","post_message":"Behold a video of the worst parking job in human history. Newsworthy? Probably not. Hilarious? Definitely."},{"comment_id":"941727655948060","commenter_b":"the reason Trump is doing so well is that most Conservatives like me are sick of the way our country has gone down for the last 7 years..it got worse not better. Veterans treated shamefully especially the wounded in our VA hospitals. THe amount of our money that has been given to terrorist countries that hate us. And the flooding of our country with illegals who are given everything when we have many poor who could use help. Plus we do not know who or what has been coming here. Some that could be dangerous to our citizens and have been..","commenter_a":"Trump!!","post_message":"The Indiana primary may be the end -- and it's THIS WEEK. Make your voice heard by clicking the link & voting now."},{"comment_id":"10153364359422411","commenter_b":"Female castration","commenter_a":"What do they do about the women?","post_message":"A Republican from Alabama has introduced a bill that would require sex offenders to pay for their own surgical castration before being released from state custody."}]
