[{"comment_id":"10153888700337464","commenter_b":"You gotta get all the brainless and illegals to stop voting democrats, its the democrats that arm criminals but prevent legal law abiding people to legaly arm themselves","commenter_a":"What happened to carson?","post_message":"Justice Scalia’s passing tonight underscores the stakes of this election. Voters must determine who on this stage has the judgement to nominate and confirm principled constitutionalists to the court."},{"comment_id":"10152945760561051","commenter_b":"Great job for the AF vet I'm a 8 year vet from the ARMY I would have done the same maybe just a little more aggressive.","commenter_a":"No way the protesters are students. They are agitators.","post_message":"When this Air Force vet saw protesters stepping all over the American flag, she walked over to pick it up. Things escalated quickly from there."},{"comment_id":"10154254037283352","commenter_b":"Fuck that queen","commenter_a":"He must be on his period","post_message":"'I'd rather see a drag queen!' Elton John accuses Janet Jackson of lip-syncing"},{"comment_id":"597418893776211","commenter_b":"@username Jill stein is a communist and belongs in jail for vandalizing construction vehicles at standing rock and she's crazy","commenter_a":"Bernie needs to take a young politician under his wing and mentor them so one or two elections down the road the only politician in america with a moral bone in their body isn't pushing 90.","post_message":"Mr. Trump, you told working people you were on their side. You know what? Millions of us are going to demand you keep your promise."},{"comment_id":"783835985050207","commenter_b":"Ginny don't forget under obummer gas was over $5 a gallon. Our healthcare got destroyed. Illegals flooded our country sanctuary cities like where Kate from the unpassed Kate's law was MURDERED by a loser criminal ILLEGAL career criminal thug. I could go on but I've found that the foolish people out there that haven't woken up yet never will.","commenter_a":"I love how about Obama and Hillary want to save the world but not America","post_message":"Obama plans on bringing in 10,000 Syrian refugees, but Hillary Clinton wants to increase that to 65,000. What do you think?"},{"comment_id":"861148387265123","commenter_b":"Female racist-in-chief.","commenter_a":"-who is she to make that decision, no man has that right - God creates life!","post_message":"What sorts of \"populations\" does it sound like Ruth Bader Ginsberg is interested in \"controlling\" here?"},{"comment_id":"10153765647881336","commenter_b":"The thing we are worried about is the fact this woman can become president when she has a possibility of doing all that.","commenter_a":"George W. Bush lies America into a pointless war that kills over 4,000 Americans, and deletes 5 million e-mails=eh okay with Republicans. 4 people die somewhere in the world and Hillary has her own server so that RWNJ's and terrorists can't hack her=throw Hillary in jail. The hypocrisy is thick with Republicans.","post_message":"Question: \"If Hillary Clinton wins, how many years will she serve in the first term?\" Answer: \"In prison?\""}]
