[{"comment_id":"10157370446315354","commenter_b":"Let a woman kill them.","commenter_a":"Bring see how many get wiped out America is not afraid of you cowards","post_message":"As the ISIS cancer grows, the threat comes closer and closer."},{"comment_id":"1757645291122332","commenter_b":"@username or because the people who own the farms/fields can get away with paying illegals less money than legal citizens. Lived in a farming town and saw it happen all the time. I have no problems with anyone coming here legally, paying taxes and doing everything else American citizens do.","commenter_a":"This video only proves that we need Trump. Every statistic stated was \"illegal\" immigrants working in our country. I honestly thought it was a joke. Time for Americans to start working again and quit hiring illegals to do the jobs.","post_message":"If Donald Trump's immigration plan came true, the results would be scary. See the biggest immigration myths here: @webpagelink Like ATTN: on Facebook."},{"comment_id":"10153811060584614","commenter_b":"Take the guns....and the illegal criminals will be the only ones with them...","commenter_a":"90% of the immigrants are Muslims male between 18 - 30..and are military savvy....the are probably guilty...a planned take over.....Germany is next...","post_message":"Update: At least 150 people were killed in Friday's Paris and Saint-Denis shootings and bombings, French officials say."},{"comment_id":"10152876050286680","commenter_b":"@username is a RACIST!","commenter_a":"It's amazing how anyone like the ultimate pre-millennial distributionist, Neocon, evangelical, can spout his bilge and people think he's accomplished something. If Cruz is the best this nation can do, we are done. We don't need pontificating, and pandering to Christian values. We need leadership, a complete change in course to get our government working for the people again. I don't see it happening. Cruz belongs at a shatuaqwa tent, not the Oval Office. He cost us 24 billion in a phony shut down, could care less about health care for the middle class or poor, voted against Veterans benefits increases and VA spending. He's a charlatan, and the Elmer Gantry of the GOP.","post_message":"Ted Cruz killed it at the conference of social conservatives. And Marco Rubio fell flat."},{"comment_id":"10153320820056051","commenter_b":"Think it's a good idea, then neighbors can tattle on those. We must find some way to catch the thieves. And I agree with Marilyn , also. And there are many, many whites on welfare that shouldn't be,also.","commenter_a":"I like to see what I am buying and if ny money is well spent or wasted.","post_message":"This mayor is going to make the names and addresses of all welfare recipients public."},{"comment_id":"631512343684752","commenter_b":"That last one is not a fact. It's a talking point. I am a white Christian and I hate his policies. Not him. I hate socialism. It's working do well in Venezuela. The dems are the ones throwing the race card around to get people's minds off the facts. For example, a few people have health care now that didn't before. But more people lost their health care than gained it. Obama care is forcing insurers nd doctord out of the market which cause a loss of coverage.","commenter_a":"Bahahaha...I would LOVE to see legitimate sources.","post_message":"Facts suck, huh?"},{"comment_id":"10153371491386336","commenter_b":"Not American and horrible woman","commenter_a":"Mother Teresa.","post_message":"With your help, #TheNew10 will be decided later this summer."}]
