[{"comment_id":"236462700148781","commenter_b":"I heard he won by a lot and everyone is happy. Next please","commenter_a":"Dagmar! Free Press just means that they can't be censored or jailed! He doesn't have to speak to the press! No ....NO VIOLATION OF THE 1ST!!","post_message":"Join us as President Donald J. Trump delivers the Weekly Address."},{"comment_id":"895683467194573","commenter_b":"He's not crazy, his mother had him tested!","commenter_a":"I know he's an idiot","post_message":"President Paul?"},{"comment_id":"10156291676570500","commenter_b":"So so sad!","commenter_a":"Was it her baby or was she babysitting ?!","post_message":"Deputies say they found him in possession of child porn sent to him by his wife. @webpagelink"},{"comment_id":"10154472139428271","commenter_b":"@username always cleared denotes nothing about guilt .","commenter_a":"I don't care how it happens the cops will always be cleared until we say no more.","post_message":"His mom called police because she knew he was in trouble. But minutes later her son was dead. The DA has cleared the officer involved in the shooting because the suspect had reached another officer's gun and fired a shot."},{"comment_id":"10154413353871519","commenter_b":"Nope. Good luck, though!","commenter_a":"They better NOT. You will get the same help you gave President Obama, 0. Now, GTFOH","post_message":"This is an offer they are not likely to take him up on."},{"comment_id":"10154298930434497","commenter_b":"Also, I don't appreciate you insulting my intelligence without provocation and based on assumption. You should work on how to prevent yourself from treating people like shit who don't deserve it.","commenter_a":"I know this is satire, but they broke my suspension of disbelief, with the suggestion that a television company actually covered Bernie's campaign...","post_message":"Via Onion Politics:"},{"comment_id":"10157403698925354","commenter_b":"This was a public city pool not a water park","commenter_a":"It happened at a water park here,as well, but never made the news?? What I want to know is how the refugees were able to afford the park. I have passes for my family but it is not cheap.","post_message":"IT'S STARTING. ***Report: Massachusetts Syrian 'Refugee' Swimming Pool Sex Attack of 13-Year-Old Girl***"}]
