[{"comment_id":"10153067188779312","commenter_b":"your a funny hoe if u wanna live like that so be it","commenter_a":"No junk food or soda Should be like the old days . Meat, cheese, bread, can goods , fresh fruits and vegetables . THATS ALL","post_message":"A Florissant lawmaker wants to prevent the ability to purchase energy drinks with food stamps. Thoughts?"},{"comment_id":"10154398240872293","commenter_b":"There is strength in numbers. So many Nasty Women","commenter_a":"Bikers for Trump and oath keepers pls be ready to welcome them!","post_message":"While President-elect Donald Trump’s remarks served as an impetus for the protest, a march organizer said it won’t be an anti-Trump rally."},{"comment_id":"10154888080729099","commenter_b":"@username idiot","commenter_a":"Yorkshire UK. Police shot a person the other Day, Last time they shot someone was 6 years ago.","post_message":"Breaking News: Police have shot and killed a man in Prospect Heights. The shooting comes less than 12 hours after an NYPD officer fatally shot a man in Canarsie @webpagelink"},{"comment_id":"590301711160408","commenter_b":"She looks to be about 100 years old in this photo, Ban her ugly mug from FB","commenter_a":"When she becomes a licensed nutritionist then maybe somebody might listen to her. Her plan not only sucks but it is no where near the enough food. A child needs more than 200 calories for lunch.","post_message":"What Michelle Obama is banning now is just plain unacceptable. The American people are tired and finally fighting back. Do you agree Michelle Obama should mind her own business?"},{"comment_id":"1923069711254227","commenter_b":"so far 1.5 million people have liked my last comment PERIOD!!!","commenter_a":"My gawd it's an immigrant disrespecting the flag! Shouldn't O'Reilly and Hannity be all over this? Lqtm","post_message":"Oh, how they would SCREAM! Shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"10154861039595575","commenter_b":"What is this woman doing Hallucigenics?","commenter_a":"i thought she was paying them to leve, and she made a big mistake,,, what the hell, is this old or what,","post_message":"They call her the Hillary Clinton of Europe..."},{"comment_id":"1387168331361699","commenter_b":"its always the ugly chicks that hate trump... wonder why. lol","commenter_a":"PLEASE HE ISN'T THE PRESIDENT ANY MORE N PEOPLE STILL TALK SHIT. HE N HIS FAMILY WERE THE BEST","post_message":"America's fighter pilots have had enough. They say Barack Obama is helping the Islamic State group, and they have the evidence to prove it... Do you think that the president is helping our most hated enemy?"}]
