[{"comment_id":"10153408842481162","commenter_b":"Beautiful and God BLESS you both!!!","commenter_a":"Wonderful","post_message":"BEST. GIFT. EVER! Steven Turner Jr. was set to walk across the stage at his high school graduation, when there was a pause in the ceremony. \"I got really worried and nervous, I thought she forgot my name,\" Turner said. But on stage there was more than his diploma waiting for him. His mom, Petty Officer 2nd Class Vera Turner, surprised him with open arms. She had been deployed with the Navy for the past 9 months, and returned home just in time to see her son graduate. FULL STORY: @webpagelink"},{"comment_id":"1905981339634270","commenter_b":"O, yea...nothing to do with what a shit candidate Hillary was or the DNC rigging the primary...it's all stupid, racist, immigrant hating, uneducated fools...still don't get it do you. Bullying people you don't agree with by \"being offended\" and calling names lost y'all the election. Try a conversation without inviting your hate first, and stop listening to the alphabet news hate and fear mongers.","commenter_a":"Laura Dittmann watch this. I tell you wutttttt lol","post_message":"Donald Trump's own voters fell for a giant lie. -- Trae Crowder"},{"comment_id":"1117807908334921","commenter_b":"@username Where is she from?","commenter_a":"Well what did you expect! Trump doesn't trust immigrants","post_message":"Donald J. Trump's peek at Melania Trump's ballot inspired a flood of jokes"},{"comment_id":"903300846390748","commenter_b":"Shoot her, her life does not matter here","commenter_a":"All lives matter, but standing on the flag is WRONG","post_message":"REPULSIVE: [VIDEO] WOMAN WALKS ON AMERICAN FLAG AT #BlackLivesMatter PROTEST, As US Service Members In Uniform Turn Their Backs On Her"},{"comment_id":"10153572594101051","commenter_b":"Gee, did you even graduate from high school????!!!!! You foul mouthed witch!!!!","commenter_a":"I dont blame them!! It probably sickens them that crazy angry trump uses their music while he talks his trash!!","post_message":"One of the world's most legendary rock bands just told Donald Trump they want nothing to do with him."},{"comment_id":"948931958516352","commenter_b":"Somebody exterminate these animals !!!","commenter_a":"Just run their fat black asses over because black lives do not matter - at least not to black people so why should I give a flyin' fuk about 'em.","post_message":"Merry Christmas from Hillary, Barack, and Black Lives Matter!"},{"comment_id":"10153874445353132","commenter_b":"Women WE MUST UNITE AGAINST STUPIDITY!,","commenter_a":"Did y'all read the article or just start running off at the mouth?! I, too, had the same reaction until I actually read the article. This congressman did not come up with this if his own accord. It was reported to him by the ones who trained them. THEY said there was special treatment.....not the congressman.","post_message":"\"Fighters must be prepared and capable. If they are not, people will die.\""}]
