[{"comment_id":"10153538663841130","commenter_b":"Cristian Cabrera","commenter_a":"Marisa have you seen these guys??","post_message":"No mailman is safe..."},{"comment_id":"10155804568635725","commenter_b":"Tell Andre ignorant ass to just go kill himself!! You never hit a girl you shine!","commenter_a":"Lmao attacking him?? it's a Football f**** player against a girl. Did u not see how she threw that punch lmao how is a grown ass man/athlete gonna look w that argument on court?? Lol and why didn't he leave her alone after she seemed to push him away?? Cuz she said the N word!!! Ha so it all makes sense now!!! Oh my god someone bring the guillotine!!! Not the N word!! Bring all the rappers too!!! This is an injustice!!! Lol","post_message":"Florida State University quarterback De'Andre Johnson is telling his side of the story of the now-viral video where he is seen punching a woman in the face at a campus bar, including what he says the woman said to him right before the attack ----> @webpagelink"},{"comment_id":"10153055382512061","commenter_b":"That woman. Was disgusting","commenter_a":"I'm sure there must of been a 'medical' term for the reasoning....","post_message":"\"I asked him why I couldn't do it and he said, you're black.'\" Black delivery driver replaced after customer wanted whites only: @webpagelink"},{"comment_id":"835588663194002","commenter_b":"As I was reading this article and the comments it evoked, which as a believer I support 100%, this thought came to me - what's to prevent a Godless government from forcing churches to perform gay marriage ceremonies much as they've strong armed bakeries and wedding venues?","commenter_a":"They will have to be married @ the Justice of the Peace. You can't force ministers, priests, rabbis, etc to marry them.","post_message":"The Supreme Court's decision on same-sex marriage doesn't change anything. The position of the Bible on marriage is not negotiable. #marriage #SupremeCourt"},{"comment_id":"945724052142706","commenter_b":"Why would anyone vote for Hillary though? She's worse","commenter_a":"How could any Americans ever vote for a bigoted, vulgar, narcissistic billionaire who lies about almost everything and has advanced no policies or arguments other than strong and smart enough to do it. This is what happens when you get voters whose worldview consists of \"The Apprentice\", \"Keeping Up With the Kardashians\" along with \"Fox and Friends\". The masses of stupid going to the polls, very scary indeed.","post_message":"Donald Trump is on the verge of winning the Republican National Committee nomination, as the party plummets into a civil war that could destroy it entirely."},{"comment_id":"1014609198628438","commenter_b":"She s the normal one!","commenter_a":"Oh I think this woman should be arrested and taken into custody as she is obviously a sociopath with a gun!!","post_message":""},{"comment_id":"10154700098471323","commenter_b":"All talk of this being an exercise in protecting democracy is simply a smokescreen. This lady is a member of the privileged elite aiming to derail the Brexit we voted for by seeing it completely emasculated to the point where the status quo will be preserved. The bankers and fund managers will never allow ordinary people their freedom. Only the rich are allowed to be free.","commenter_a":"All MPs are Selfserving PARASITES .The People have VOTED DEAL WITH IT .And Start bye getting our Borders sortted and RIP UP ALL EU LAWS Because we never needed them .FACT .And Stop Foreign Aid.We carnt afford it.And Spend the money on the people that need it in the UK..","post_message":"\"Neither the British people nor parliament have, however, voted on what form that leaving should take, or on which fundamental rights will be removed as a result of leaving. Those are questions that can be decided only by our sovereign parliament.\""}]
