[{"comment_id":"10154471840033433","commenter_b":"John Mossman well then he took one for the team when he helped conceive his daughters.","commenter_a":"Worst Muslim eva. Eating bacon on a non zabihah beef burger, drinking beer, smoking, wearing shorts, not observing Ramadan...","post_message":"Pants on Fire for town hall audience member: \"You know our current president is (Muslim). You know he's not even an American.\""},{"comment_id":"10154307369739099","commenter_b":"Well a attack on citizens is a attack on all of us as well punk","commenter_a":"So DeBlasio you're still going to give criminals a free pass you hypocrite ?","post_message":"\"An attack on our police is an attack on all of us,\" Mayor de Blasio said @webpagelink"},{"comment_id":"860168877353787","commenter_b":"She has such a nasty attitude and doesn't try to hide it. Very haughty woman.","commenter_a":"She looks like she's giving him attitude. Why's does she always have \"that\" look on her face when she looks at whites and anyone else she considers below her?","post_message":"Caption this photo in the comments! ...... Former President George W. Bush and first lady Michelle Obama speak before President Barack Obama delivers a speech and takes a symbolic walk across the Edmund Pettus Bridge. (AP Photo/Bill Frakes)"},{"comment_id":"10153681462888984","commenter_b":"Let's have a face to face.","commenter_a":"I am, and I have always liked her because she is honest!!","post_message":"Sarah Palin just put something on Facebook that immediately went viral... this image is exactly what Hillary didn't want America to see. Palin is never scared to tell it like it is... we should be grateful for her courage and patriotism."},{"comment_id":"10150889986764999","commenter_b":"I don't. Our economy benefits tremendously from the labor, the buying power, and the taxes paid by undocumented labor. I for one don't want to have to pay $5 for an apple. We don't need no stinking wall. What a colossal waste of time and money.","commenter_a":"Who here does not want secure borders and our immigration laws enforced and why?","post_message":"The photo-op allowed Donald J. Trump to please his nativist base and humiliate Mexico at the same time, the Editorial Board writes in The New York Times Opinion Section."},{"comment_id":"782624725204041","commenter_b":"SJ Shang dumbshit, the topic is how the allegedly peace-loving Muslims treat their kids. We have enough problems with idiots shooting each other in the US, we don't need more sand monkeys doing the same, whats so hard to understand about that? But you want to digress, fine. Americans desperately want to have dope legalized, to make themselves feel good. 80% of Americans are overweight, because they are lazy, they love to pop and abuse prescription pills and illegal drugs. They don't drink and drive responsibly, insist on texting while driving and play Candy Crush on the job. They refuse to live within their means, balance a checkbook. The last thing they need is one more useless addiction, and yet they whine and yammer about their right to be high .\"Dope fixes everything. If we smoked dope nobody would die from cancer anymore\"","commenter_a":"But we don't want Obama to address white Christian American murderers of children here because he might take our guns. Seems legit.","post_message":"I want a REAL president to step in and take these bastards out once and for all..."},{"comment_id":"10156415559120354","commenter_b":"This woman.. Needs to be sent to a Muslim refugee camp ... What a sorry idiot ...","commenter_a":"Bill should be running for president","post_message":"“56% of Americans believe that the Syrian refugees have odds that are at values — their values are at odds with our values. That may not be wrong. If you are in this religion, you probably do have values that are at odds. This is what liberals don’t want to recognize.\""}]
