[{"comment_id":"723294587810406","commenter_b":"Leah sure! Hillary's leaked email referrer's to Mexican's as \"taco bowls\". That says it all right there. Racist as anybody can be.","commenter_a":"Hillary no lo hace un coche de usted . Solo su voto","post_message":"\"Do all the good you can. Measure your life by the positive effect you can have on other people’s lives. Be of service to one another.\" —Tim Kaine"},{"comment_id":"1782129565361138","commenter_b":"@username SHES tying her hair up so it doesn't get in the way of the dick she about to suck bc she dosent wanna verbally apologise","commenter_a":"@username I don't get this, explain?","post_message":"Apology accepted"},{"comment_id":"10153559818581519","commenter_b":"I guess you Hillary Shills were just waiting for me to log back in to kick your asses right?","commenter_a":"The West Coast was MADE for Bernie Sanders... If Washington State has gone for him overwhelmingly you can expect California and certainly Oregon to follow suit. We need this man as President! The greed of the 1% cannot continue!","post_message":"3 reasons why Bernie Sanders won’t give up"},{"comment_id":"10153413521069255","commenter_b":"Loose lips sink ships.","commenter_a":"Santorum doesn't even know that the Pope is in fact a scientist! He is a chemist! Santorum is the idiot!","post_message":"Yes. That Rick Santorum said that."},{"comment_id":"1014820688580048","commenter_b":"Time for muslims to take their a$$e$ back where they came from","commenter_a":"That's the national anthem. If you aren't willing to be An American than go home! And take the stinking socialist with you. You can take the atheists and the Mexicans.","post_message":"OUTRAGEOUS: MUSLIM Students At Public School Walk Out When NATIONAL ANTHEM Plays @webpagelink"},{"comment_id":"10154323932234091","commenter_b":"I am so so so tired of the general public making excuses for these clowns and demanding we idolize them and refer to them as heroes. A LOT of them are just low IQ goons who made it through a few weeks of police academy and are let loose on the streets to act juvenile and bully citizens. And the more people worship them and expect the rest of us to, the more emboldened they feel to keep up this embarrassing and sometimes even deadly behavior.","commenter_a":"Yet another incompetent coward revenue collector.","post_message":"\"We thought (the officer) was texting on his phone. Because the whole three hours we were sitting here, he was the one standing there. We saw him on his phone, but we didn't think an officer would do that.\""},{"comment_id":"677448822404448","commenter_b":"These women are idiots!!!!!!!!!!","commenter_a":"OMG!!!","post_message":"\"We finally have this god that's going to come down and help us all.\" Here's what two \"Trumpettes\" think about Donald J. Trump's Twitter rant against former Miss Universe Alicia Machado. Watch more: @webpagelink"}]
