[{"comment_id":"740770189446892","commenter_b":"Close all the borders already!!! Damn Obama!!","commenter_a":"Hang that Mo**ey!","post_message":"BREAKING: Muslim Teen Refugee Charged With Murder For Beating 97 Yr Old WWII Veteran To Death This is what happens if we let refugees into our country. This needs to stop. Do you agree we should close our borders?"},{"comment_id":"1529103134057563","commenter_b":"She should go to hell!!!!","commenter_a":"She should think before she speaks good about Obama and his laws","post_message":"Democratic presidential candidate Hillary Clinton says she supports President Obama a 100% \"in his fulfilling his constitutional duty to send a nominee for the court to the Senate.\" How do you feel about this?"},{"comment_id":"1801521536786663","commenter_b":"We can send all the \"safe space\" cry babies here. It will be perfect Trump will just need a longer wall. Oregon? You want in on this? Please speak up before we order materials for the wall","commenter_a":"Please do.","post_message":"The group said they plan to seek independence through the United Nations."},{"comment_id":"1614611835509066","commenter_b":"you're welcome u baster","commenter_a":"I'm going to the toilet and leaving my phone on charge, I expect loads of likes when I'm back. Thank you","post_message":"US President-elect Donald J. Trump will soon be accompanied at all times by a military aide carrying the nuclear \"football,\" enabling him to order a nuclear strike at a moment's notice."},{"comment_id":"10154324283638854","commenter_b":"Like they say it for the first time !!! they say it all the time it is their law and authorities are to blame ! There is no way of knowing which Muslim will want to become a martyr by killing who ever their god tells them to kill !!! this religion must be totally banned in a Christian Country !!!","commenter_a":"The Gay community needs to vote for Donald Trump. If you vote for Hillary you can expect more of these infiltrator brought into this country unvetted.","post_message":"VIDEO: Speaker at Orlando Mosque Says Gays Must Die. SPREAD THIS EVERYWHERE!"},{"comment_id":"10153518818316162","commenter_b":"Well, some women are just total knockouts....","commenter_a":"Women injured and pride parade. The pride parade should be banned!","post_message":"A 25-year-old woman was knocked out when a drone struck her in the head during the pride parade @webpagelink"},{"comment_id":"10154959476789411","commenter_b":"@username president Melania Trump after Pence. Lollll","commenter_a":"\"Psychologists tell us that 3 and 4 year olds often lie to get their way because they don’t have a moral understanding of the importance of telling the truth. 4 and 5 year olds often bully other children because bullying is a way of asserting their dominance and making themselves feel more secure in a world that is beginning to seem very scary. 5 and 6 year olds are often thin-skinned and vindictive toward peers who criticize or make fun of them because they are at a stage when they have exaggerated concerns about the opinions of others toward them. 6 and 7 year olds are often excessively narcissistic because they don’t understand their place in the world and haven’t yet developed the moral capacity for empathy. It follows that Donald Trump’s emotional age is somewhere between 3 and 7. Assuming that the Electoral College makes him President on December ...","post_message":"Unlike most presidents, Carter has refused to let his successors do the job they were elected to do. On Jan. 20, he will be pushed aside by Obama."}]
