[{"comment_id":"1009873989035649","commenter_b":"Is this bitch right about anything she should go back into hiding","commenter_a":"FAIL!!!","post_message":"Joy Behar calls out Carly Fiorina. Is she right?"},{"comment_id":"1066896063328404","commenter_b":"Get these suckers!","commenter_a":"Billie. Do you need to suck each and every bit of lefty nonsense and regurgitate it?","post_message":"Four House Democrats are calling for an investigation into the Center for Medical Progress (CMP) as the group’s deceptively edited video attacking Planned Parenthood continues to fall apart under public scrutiny."},{"comment_id":"10154355616737293","commenter_b":"He deserves a bullet.","commenter_a":"He looks like Gov. Christie","post_message":"The gruesome revelations are a stark contrast to Kohlhepp’s professional image. But details from his childhood hint at a deeply troubled individual."},{"comment_id":"10153924016401130","commenter_b":"Oh grow up all of you. Why should she need to put a cover over her breasts. You put a cover over your mind and give thanks that mothers can feed portably whilst not being excluded. I'm sure you can train your mind to manage to view a pair of breasts as a feeding devise and look at how your own mind processes this function. Women relinquish enough do to our biology - can't we at least feed and belong at the same time?","commenter_a":"She should have stayed home. Not her day.","post_message":"Now THIS is a cool mom. 😎"},{"comment_id":"1870709889833499","commenter_b":"And what about those born with both genitals ?","commenter_a":"A person that has the female organ is female, and a person that has the male organ is a male, END OF THE CASE. Next please: ''The Kardashians Still Fighting Over a Pudding''","post_message":"Meet the cover girl who used to be a boy"},{"comment_id":"1907053972848209","commenter_b":"THROW THIS BITCH OUT OF THE COUNTRY. PLEASE","commenter_a":"not my president","post_message":"She isn't backing down."},{"comment_id":"10155217718349411","commenter_b":"Sanders is most sensible politician than other American leaders the only guy who is not a Zionist boot licker long live socialism Nothing wrong in being socialist , socialism is the best ideology that distributes wealth equally there is never extreme rich or extreme poor in socialist societies take examples from Danmark , Finland , Norway etc you see how well they are doing","commenter_a":"Donald Trump is your President! Because I'm American hispanic and I'm tired of how all of these coward racist liberals that hate America like Obama, and his supporters are trying to turn this great country into a 3rd world one. Unfortunately, one of the biggest problems we have right now is the media and entertainment that are always trying to tell us how to think. They have created enough imbeciles that would re-elect a failure like Obama. Even more, I'm supposed to bow down to anti-American Obama, love liberal policies no matter how destructive they are, love bigger enslaving government, and be in favor of illegal immigration because of the color of my skin... disgusting. That's why I and others support Donald Trump. Please support the movement by getting the \"Trump Strong\" t-shirt at:www.teespring.com/trumpstrong . And let's Make America Strong Again! Thank you.","post_message":""}]
