[{"comment_id":"10153057265651051","commenter_b":"Freaking gross! Got what she deserved!","commenter_a":"Sick","post_message":"Some people say this principal deserves the death penalty after what she made a 2-year-old and 5-year-old do. Decide for yourselves if that’s true."},{"comment_id":"10152776917200779","commenter_b":"Bitch please...","commenter_a":"Too late, President Obama, you should have spoken out earlier!","post_message":"President Barack Obama voiced his disapproval of the recent rioting in Baltimore in a press conference today. \"There is no excuse for the kind of violence that we saw yesterday,\" he said. \"It is counterproductive.\""},{"comment_id":"10157053900475354","commenter_b":"Crooked Hillary could not/ would not keep America and Americans safe. She ignored the call for help from Ambassador Stevens even before the attack. Then she tells Americans one story while she tells her daughter a different one...crooked, crooked Hillary can't be trusted.","commenter_a":"The BLM and anybody who supports them are just a bunch of RACIST ass holes and Dirty Fukn TRAITORS to themselves and to the USA. \"Multiculturalism\" and \"diversity\" is all BULLSHIT and VERY DANGEROUS to EVERYBODY it will DESTROY everything. Islam is DEATH. DEATH to Islam long live the Infidel","post_message":"BOLD."},{"comment_id":"10154164931281162","commenter_b":"with your last name you should go back where you came from...why are you here in the US","commenter_a":"Cuba please keep Obama and his family. Also don't forget the mother-in-law","post_message":"Pres. Obama touches down in Cuba, making him the first sitting president to set foot in the country in almost 90 years: @webpagelink"},{"comment_id":"800358286665935","commenter_b":"Shutup you cornballs","commenter_a":"Fundamentalists linear thinking both secular and religious can't enter the narrative. A generation that cannot discern connotations and denotations. We are in an intellectual and spiritual decline. Stupid stupid mobs","post_message":"This thug should have just obeyed the damn law! Read why Jesus lived in a police state: @webpagelink Crimes he committed: illegal fishing, loitering and homelessness, feeding people without a permit, not caring about paying taxes, whipping corrupt bankers, inciting insurrection, claiming to be above the empire."},{"comment_id":"10154608110303701","commenter_b":"She's a real winner. Just block her idiot ass.","commenter_a":"Good hes a pos","post_message":"A Sherwood man is being charged with manslaughter for a crash that killed a 2-year-old in Deschutes County, according to police."},{"comment_id":"10153587762999087","commenter_b":"She's above the law.","commenter_a":"Bloody Hell , Hillar-ious Hellary should have been an evil stand up comedian..","post_message":"Hillary Clinton on dropping out of the race if indicted: \"Oh for goodness, that is not going to happen. I'm not even answering that question.\" #DemDebate"}]
