[{"comment_id":"10154153426863812","commenter_b":"I'm praying!!","commenter_a":"Pray for a safe return","post_message":"Amber alert issued for 2-month-old girl who was abducted from her home by armed kidnappers: @webpagelink"},{"comment_id":"10153096190609614","commenter_b":"What kind of women gives up their child?","commenter_a":"Great daddy! This baby is so LUCKY to have such loving and loyal to baby kind of daddy!","post_message":"After this baby mom abandoned him because he was born with Down syndrome, his father stepped in to raise the son he calls and as a single dad. Leo Forrest was born in Armenia last month. Upon learning of the genetic condition, his mother and her family gave up on the child. They also told Samuel Forest he would no longer be welcome in their home if they decided to keep him, according to a GoFundMe page set up to help Forrest and the baby. Faced with a difficult choice -- his wife or his infant son the new father chose Leo. She has since filed for divorce, he says. Forrest is returning to Auckland, New Zealand, where he is originally from, to raise the baby. Read KTLA story here: @webpagelink"},{"comment_id":"1082059028539299","commenter_b":"And whites don't hey dumbass All lives matter you would know that if you stayed in school 😬","commenter_a":"Because Black LIES Matter to those thugs.","post_message":"It's no surprise that the people at Black Lives Matter aren't exactly known for their ability to stick to the facts. However, this new data about black \"victims\" absolutely DEMOLISHES their whole agenda. I guarantee the media doesn't report on this... let's spread this everywhere."},{"comment_id":"675915449265700","commenter_b":"Muslims are animals,filthy Scum!","commenter_a":"Get rid of all muslims there nothing but problems.","post_message":"Putin just verbally destroyed this Muslim ambassador. He's on a mission to put an end to Muslim brotherhood. Are you glad someone is standing up to ISIS?"},{"comment_id":"10154090302722452","commenter_b":"So someone purchased a ticket for this bear, and the TSA couldn't screen it so it could go on the plane?!","commenter_a":"If he bought a ticket then he should have been allowed to bring it on the plane","post_message":"A YouTube star bought a plane ticket for a massive teddy bear as a stunt, but was forced to abandon the bear at LAX."},{"comment_id":"472553692939711","commenter_b":"No.. She's Stupid.","commenter_a":"There is no way she is that stupid... I don't believe anyone can be that stupid! Her motive is to make ISIS sound misunderstood, to make you hesitate, and allow ISIS to grow. She is like Obama, is helping their brothers is arms, ISIS.","post_message":"I honestly don't even know where to start with this. It is absurd beyond belief."},{"comment_id":"10153659892877093","commenter_b":"Woman","commenter_a":"Bomb that guy","post_message":"HOUR-LONG STANDOFF: The woman refused to get out of her SUV & cooperate with police. She tried to drive away and was finally taken into custody... @webpagelink"}]
