[{"comment_id":"10156132117065725","commenter_b":"I appreciate you being so kind and politically correct. And you laid out a solid, arguably INDISPUTABLE, case there. But, as you pointed out, this is absolutely willful ignorance, so real facts don't mean anything when talking to a trump supporter. They have a feeling, form a belief from that feeling, and then that feeling morphs into a \"fact\" without any due diligence. And, unfortunately, all of their beliefs stem from feelings of bigotry (irrational hatred of an entire group of people). I'd love to have an honest conversation with a trump supporter about his policies. But they won't, because trump doesn't have any feasible policies, he simply says things are bad or good (which we all have the ability to do). What any trump supporter does when confronted with a lack of actual policy, with his track record of insults and short sighted aggression, is blame someone else somewhere ...","commenter_a":"The man did not make a \"nasty or controversial statement.\" He made a series of absolutely false allegations. Correcting him after he spoke could not possibly have been construed as interfering with his right of free speech; you would have only been interfering with his right to be ignorant. Which, apparently, is a sacred right to some of your supporters. And if somebody had made a series of absolutely false statements about you to the President, yeah, I'm pretty sure he would have corrected them.","post_message":"If someone made a nasty or controversial statement about me to the President, do you really think he would come to my rescue? No chance! If I would have challenged the man, the media would have accused me of interfering with that man's right of free speech. A no win situation!"},{"comment_id":"486290274888721","commenter_b":"Bernie sit yo old ass down u is not gonna win nother","commenter_a":"it's beneficial being educated in this!","post_message":"There is a BIG difference!"},{"comment_id":"10154352960083037","commenter_b":"Haha!! This dude is a savage!!","commenter_a":"@username you as a maintenance worker hahaha 😆😆😆😆","post_message":"A KXAN viewer sent us this video today. A maintenance worker at an Austin apartment complex was caught taking a swig of booze. How would you react?"},{"comment_id":"1527434820649594","commenter_b":"@username she's a cow","commenter_a":"They are like at least 5 articles about Kim Kardashian every day.. Kinda tired of this. She was robbed and shes still rich and has millions in the bank. Its not the end of the world. They are things & news that are MORE important than Kim's life!","post_message":"Kim Kardashian West's friends are rallying around her"},{"comment_id":"10154176527056770","commenter_b":"Shut up and crawl back in your hole.","commenter_a":"He's a creep for saying that!","post_message":"'Avengers' director Joss Whedon made a lot of outlandish comments on Ivanka Trump and Jared Kushner."},{"comment_id":"10153196939420047","commenter_b":"Remove yourself from The United States of America. You Don'T America's Ways. LEAVE!!!","commenter_a":"It probably should be removed. Does a nation that promotes the murder of the unborn and celebrates a counterfeit\"marriage\" trust in the one, true God who has revealed Himself in Scripture? Nope. Meaningless words that don't impress the God of all creation at all. Repent and believe the Gospel.","post_message":"Avowed atheist Michael Newdow is at it again. He's just filed a federal lawsuit demanding that \"In God We Trust\" be removed from U.S. currency. We must remain vigilant in defending the Constitution from yet another assault on our religious heritage."},{"comment_id":"1824233217832680","commenter_b":"Yep! I saw what DT paid for in this campaign, thousands and thousands of his campaign signs , thru WV, Ohio, Mi. Drove it many times from NC due to a deaths in my family. I couldn't believe how many I saw and where they were. Really in the oddest of places too. Someone was paid to put them up.","commenter_a":"I love my Affordable health Care, it has saved my life. It's very important to have coverage for everyone in our country. You never know when you my need it. The health care conglomerate has made it expensive, big Pharm etc..etc.. not OUR President! What he did was great for this nation, and yes I would tweak a few things but all-in-all we need this for a healthy people!","post_message":"Your experience with the Affordable Care Act? #ACA"}]
