[{"comment_id":"10152768793527377","commenter_b":"I am white and I criticize him because he is an nut. I voted for Obama twice and decry racism. Much of the criticism toward Obama was WAY over the top that NO white guy with the same basic Democrat policies would have faced. The fact that Snopes had to crerate a whole separate page dedicated to just the massive amount of fake viral emails smearing Obama and outright lying with claims so outrageous that any snae person would immediately question but Conservatives swallowed hoook, line and sinker because of their hateful, irrational, racist bias says it all","commenter_a":"He's a good man and could be a good leader , Vice President too!","post_message":"Black “mascot,” “court jester,” “minstrel show”? Tucker says about Dr. Carson."},{"comment_id":"952692328160353","commenter_b":"I actually do darling. No go back to sticking your head back into a special orafice... ;-)","commenter_a":"As he should. Obamacrap only works, if you don't. LEACHES.","post_message":"It wasn't a good day for Justice Scalia."},{"comment_id":"1066274426802142","commenter_b":"I have $10 that says that first woman in that video doesn't know how to spell diligence.","commenter_a":"Just a bunch of ignorant fear mongers, there is much more violence fine by people that sound and look just like them than any Muslims within the states.","post_message":"Did Donald Trump alienate his supporters by calling for a ban on Muslims entering the United States? NBC News asked attendees of Trump's rally in South Carolina what they thought. Watch more: @webpagelink"},{"comment_id":"967763486668466","commenter_b":"Smart, educated women are actually voting for Hillary. Don't fool yourselves.","commenter_a":"What is it about the Democratic platform that is appealing? Higher taxes, weaker security, open borders, murdering babies, a very real risk of WWIII... ya'll must really hate America","post_message":"\"Get this Donald: nasty women are smart, nasty women are tough, and nasty women vote.” —Elizabeth Warren"},{"comment_id":"806491062782835","commenter_b":"Its funny the democratic party started the Confederate nation and fought to keep slavery. Robert byrd retired in 2010 a Democrat longest serving politician in history and was active member of the klan. Imagine all yhr bills he voted on due to his racist views. Alot of the Democrats knew he was a klan member and said nothing. Pull some ones opinions off line and use them to your benefits but truth is your being lied to but 99% of politicians and the first to speak up you all attack.lol just like o malley saying all lives matter and Democrats attacked him for that. Yet alone he is democrat himself. Get it through your heads we are done with the hypocrits and lies and political correctness","commenter_a":"Can someone please explain to me who they are polling to get Trump in the lead?","post_message":"And yes, it's really his number."},{"comment_id":"10153252345186990","commenter_b":"Roger Morris it is Justin Bieber!","commenter_a":"Lisset Medina","post_message":"#SB50 SIGHTING: Justin Bieber spotted taking pictures with fans in San Francisco. @webpagelink Have you spotted any Super Bowl celebs yet? Tell us below! [Via @JBCrewdotcom]"},{"comment_id":"995597563869829","commenter_b":"@username you are free to get the hell out","commenter_a":"Nobody takes Huff po seriously . I read it to see what liberal homos think.","post_message":"Should news sites cover Donald Trump as politics or entertainment?"}]
