[{"comment_id":"10154780678681509","commenter_b":"The day has finally come when guys can legally go into a womans bathroom lol thats amazing","commenter_a":"There's no recorded incidents of trans people doing anything untoward in rest rooms - Republican Christian politicians on the other hand, there's lots! Ban them.","post_message":"It's deadline day for North Carolina Gov. Pat McCrory. The U.S. Justice Department says the state's controversial bathroom law is in violation of the Civil Rights Act and gave him until today to respond. McCrory says what he chooses to do goes beyond the Tar Heel state -- it will affect the majority of Americans."},{"comment_id":"367258316795796","commenter_b":"This is against the establishment clause of the Constitution!!","commenter_a":"Send all of those goat lovers back to the sand dunes!","post_message":"Allah is replacing God in our schools..."},{"comment_id":"1242854355764972","commenter_b":"WHO THE F^CK ARE YOU ANYWAYS GO LEAVE NOW MAKE AMERICA GREAT BY ALL YOU BUTT F^CKING TRAITORS LEAVE","commenter_a":"good by trash","post_message":"Looks like we're going to need a second Trump Train...one that takes all these people south of the border..."},{"comment_id":"928764863812971","commenter_b":"She would be a nightmare! She can't even run a business.","commenter_a":"No.","post_message":"It's official."},{"comment_id":"10153438446318984","commenter_b":"Give her nothing she encouraged the animals","commenter_a":"hire the thugs who destroyed, burned, looted and rampaged in your streets...serves 2 purposes, gives them a job, gets them off aid, and the plus........your city gets cleaned up by those who wrecked it, with your permission..so use your dollars, not mine","post_message":"The fact that she expects Americans to do THIS for her after the things she's said and the way she handled the riots is truly mind boggling. Are you outraged by the Baltimore mayor's request?"},{"comment_id":"10152957252332434","commenter_b":"Next we'll be making adultery illegal, I suppose, because that leads to suicides as well.","commenter_a":"France is fucking ridiculous. You can't outlaw people's religious expression. You can't put people on trial for saying what they think, even if it's racist. It's fascistic and wrong. These aren't Western values.","post_message":"Le Pen compared the public prayer of Muslims to the Nazi invasion of France"},{"comment_id":"461209797400647","commenter_b":"This isn't the dark ages, human beings are starting to accept all people. Perhaps the asswipes on this thread should become more tolerant and stop wasting all their energy on irrational hatred.","commenter_a":"What awesome gay couple would want to be married by a bigoted pastor? There are plenty of other ordained people who will be more than happy to marry a beautiful couple!!! Peace!!","post_message":"Breaking..."}]
