[{"comment_id":"723507841151844","commenter_b":"Now her dumb ass should know better 😂😂😂","commenter_a":"@username @username bruh lol","post_message":"This pretty much sums up my life #WSHH"},{"comment_id":"10153016776944117","commenter_b":"Cause she was terrible. @webpagelink","commenter_a":"Because they are willing to sell out.","post_message":"From RUSH drummer Neal Peart to Rep. Paul Ryan to Uber CEO Travis Kalanick. Why do famous people deny that they admire Ayn Rand?"},{"comment_id":"10153629049609255","commenter_b":"Hey JEB. Your mom called: @webpagelink","commenter_a":"Pay no attention--he's speaking with his head---UP HIS ASS---AS USUAL !!","post_message":"Jeb! Bush, noted women's health expert."},{"comment_id":"1195300027229716","commenter_b":"Nope, they would be saying who wants a whore for president. Very hypocritical.","commenter_a":"If Trump is so rich, why can't he afford better concealer? I mean damn, look at him in this picture.","post_message":"GREAT question!"},{"comment_id":"10153676761856623","commenter_b":"I just don't understand how people would want to vote for this lying deceitful person with a terrible plot up her sleeve! She is a lying snake! Now I'm not saying a support trump either but this lady is just flat out terrible!","commenter_a":"I also keep two calendars, one for business one for personal stuff.","post_message":"Hillary Clinton kept two calendars when she was secretary of state — one for the public, but another that included meetings with political donors and loyalists, Wall Street bankers and Clinton Foundation contributors."},{"comment_id":"894267073955650","commenter_b":"She makes me sick!!!!! Gag!!!","commenter_a":"Not even smart enough to keep her mouth shut.","post_message":"OUCH: Meet the Press plays brutal montage of Hillary Clinton flip-flopping on various issues @webpagelink"},{"comment_id":"236858020109682","commenter_b":"Get the lady off the pic","commenter_a":"He got in there by something called \"voting\". Just saying","post_message":"LIVE VIDEO: 'Not My Presidents Day' anti-Donald J. Trump protests are happening across the country. WARNING: Viewer discretion is advised"}]
