[{"comment_id":"10153674136304641","commenter_b":"true... we just cant equate these refugees with terrorists.","commenter_a":"Its not about religion you fool! It's about your country's safety! Get that through your head!","post_message":"U.S. President Barack Obama's harshest remarks were for Texas Sen. Ted Cruz."},{"comment_id":"842682652588978","commenter_b":"She needs to be kicked out of our country, we don't need trash like her kind around.","commenter_a":"Here's another puke, wants everything America has to offer but can't be happy with that, maybe the next time she appears in public, the police should not lift a finger to give it any protection, then she'll probably get stomped under the crowd, and she deserves every foot that would trample her arse!","post_message":"It is people like her that perpetuate hate. Police are the people that keep her safe. Do you think Beyonce needs to learn some respect?"},{"comment_id":"10153947256054369","commenter_b":"You don't know much about the Black Hills or surrounding areas, do ya there, Todd and friends.","commenter_a":"What the hell is there to do in South Dakota","post_message":"You work hard, here's where to retire well."},{"comment_id":"10154652833671336","commenter_b":"BUILD THE WALL!!!","commenter_a":"let's end this by voting for trump","post_message":"A man who allegedly killed two people and kidnapped a third one over the weekend in the Dallas area had been deported three times to Mexico in the last two decades, immigration officials said on Wednesday."},{"comment_id":"1251904504850405","commenter_b":"scum. I hope someone cuts your dick off. Then you can really be a women. Until then stay in your own damn bathroom and leave us women alone. One of these days yours is coming.!!!!!!!!!!!!!!!!","commenter_a":"single occupancy facilities is the only sensible answer. But that ain't good enough for the terminally aggrieved.","post_message":"👏 👏 👏 (via The Huffington Post)"},{"comment_id":"875381432484713","commenter_b":"I dont know about you ladies but I sure dont want to see no 35 year old pop star.","commenter_a":"Kenya once again showed what a messy, ugly, and miserable woman she is. Claudia is Kenya's equally despicable sidekick. Demetria needs to grow a brain of her own. NENE LEAKES showed she is the Queen of RHOA. And Cynthia continues to talk tough, but if someone says boo to her, she will break down in tears when all is said and done. Phaedra was dead wrong for asking Demetria is she had done crack, but Demetria had one of the night's best comebacks with the 'all we have in common is the number 8'!","post_message":"“Your Clit Has Left Your Body!\" Phaedra's Shade, NeNe's Wrath and Claudia's Toes Are Unleashed #RHOA Ep. 10 @webpagelink"},{"comment_id":"1164072160294870","commenter_b":"Did I hurt your feelings Harvard? Suck it up Nancy","commenter_a":"No I don't want you out of the White House I want you in prison he's a lowlife scumbag Obama you're just as bad as Hillary Clinton prisons too good for you I think you we voted a terrorist to run our country. U scumbag","post_message":"Yes!"}]
