[{"comment_id":"1277469425634935","commenter_b":"Oh yeah she must of smoked weed. Pshhh... don't be a dummy. Ppl don't smoke weed and drive in the wrong lane. If that were to be true millions off Ppl would be headed the wrong way. This lady was off her rocker I highly doubt it's do to weed or alcohol.","commenter_a":"Yeah legalize marijuana... will get more cases of wrong way drivers. But that's okay as long we have our freedom. That was a sarcastic remark. No to drunk driving no to marijuana no to drugs","post_message":"WRONG-WAY DRIVER: It's happened again -- DPS troopers used stop sticks to stop a woman who led them on a wrong-way freeway chase that began in Phoenix and ended in Mesa. Thankfully, no one was injured. STORY: @webpagelink"},{"comment_id":"981909798535164","commenter_b":"No, I don't think he have to.","commenter_a":"No","post_message":"Bernie Sanders doesn't talk very much about faith beyond saying he's culturally Jewish. Jimmy Kimmel asked him, point blank, if he believes in God, and he framed his answer in a rather unique way. Do you think a president must have a belief in a god to be a good leader?"},{"comment_id":"10154382058398606","commenter_b":"These chicks will walk on hot stones for me but keep disrespecting their sisters","commenter_a":"@username Smdh. Why would anyone do that?","post_message":"More than 30 people suffered burns to their feet and lower extremities at a Tony Robbins seminar after the motivational speaker encouraged them to walk across hot coals. @webpagelink"},{"comment_id":"1813322542237935","commenter_b":"Then what makes her capable of running our country","commenter_a":"Mrs Magoo👹","post_message":"Hillary Clinton tells the public: Don't bring up my health! Then she tells the FBI: My health kept me from remembering the answers to your questions!"},{"comment_id":"10154901503909641","commenter_b":"From our childhood we used to draw it on our notebook hoping for good fortune and will continue I dun care what the world says","commenter_a":"James Higgins-Durnan","post_message":"Conal Footwear apologized and recalled a line of boots after a viral image showed they left swastika imprints @webpagelink"},{"comment_id":"10154095809901094","commenter_b":"Only aliens would do what they are doing, along with stopping any alternative or sustainable agendas, fuel sources.","commenter_a":"Of course. Alien agenda. They are terraforming the planet for the tall greys. Chemtrails have the make up chemically for their perfect atmosphere. Pumping it into the earth with fracking etc. Polluting the oceans. Terraforming the planet. Goal is set for 2029. Decrease the human population to 500,000. Believe it or not this is the plan. The NWO/'Globalist' agenda IS the alien agenda. Total take over. Out of the shadows","post_message":"US Navy documents reveal plans to inject 20,000 tons of heavy metals, plastics and other highly toxic compounds over the next two decades into the oceans where it conducts its war games."},{"comment_id":"917503514939106","commenter_b":"Shut up bitch","commenter_a":"Surely another upstanding citizen.","post_message":"BREAKING: New police body cam video reveals the disturbing moment a white cop killed Eric Harris, an unarmed black man in Tulsa, Oklahoma. #EricHarris #BlackLivesMatter"}]
