[{"comment_id":"10153365455244087","commenter_b":"@username , that is BULLSHIT! They purchased the assault rifles they used IN CALIFORNIA!","commenter_a":"No one has lost any rights to guns under Obama. No one has had any guns taken away under Obama. If ONLY the right wing could learn to try to GOVERN instead of just doing things that appeal to their right wing base, that would be just great!","post_message":"“Coming in the wake of the terror attack here in Paris, this horrific murder underscores we are at a time of war,” Sen. Ted Cruz said yesterday. “Whether or not the current administration realizes it or is willing to acknowledge it, our enemies are at war with us.\""},{"comment_id":"10154858585008797","commenter_b":"If they are here illegal. they are just deported . That's why I care if they are here illegal!! they'll just come back in to commit more crimes..","commenter_a":"How many are legal citizens","post_message":"GANG BUST: After nearly three years of undercover investigation, a total of 96 felony charges have been filed against 16 gang members."},{"comment_id":"1214110285315058","commenter_b":"Great that's sounds good to me.Now tell him to tell his people to tell the kids and tell the hate groups,especially the kkk and others to stop yelling white power and build a wall and bulling people.Tell him to stop terrorizing people from Mexico that have been here for years that he is going break up families.That a good start.That's not God's ways.This is an America for all.","commenter_a":"God gave us a choice and decent rules to go live by but unfortunately some people just don't follow God's rules and a trump is produced.Using Vile language,threatening people,a wife that is no example to little girls but everybody in the republican camp adores him.He's gonna save the world.Not!","post_message":"If you claim to be a “Christian” but support Donald Trump and all the hate and bigotry he embodies, you’re a hypocrite."},{"comment_id":"10152938422949877","commenter_b":"girl shut up","commenter_a":"#foodforthought","post_message":"Half Of Atlanta's Newly Diagnosed HIV Patients Have AIDS, Study Finds. Read more on these staggering numbers out of Atlanta. Grio fam, share your thoughts on what needs to happen to reverse this."},{"comment_id":"10156899392785725","commenter_b":"Hope she gets jail time","commenter_a":"hillary who shed the blood of innocent American at Libyan embassy. Obama and clinton who created all conflicts possible in America ( income war, gender war, age war, war on women, Race wars) driving wedges among the people. Hillary clinton and bill clinton war on women explained by Roger Stone on youtube","post_message":"As President of the United States of America- I will see to it that the AWARENESS continues -- I will be in a position to immediately handle all of the issues at the VA --- nobody will look after our Veterans --- our heroes, like me. I guarantee that!"},{"comment_id":"900665266646768","commenter_b":"abortions have been going on before obama ever took office","commenter_a":"Abortion is indeed murder, and he is the ring leader behind it all.","post_message":"Eight years with a pro-abortion radical is eight too many. No more pro-aborts in the White House!"},{"comment_id":"1792755454298802","commenter_b":"Yeh and you and your daughter took some of those jobs to China.. hypocrite..","commenter_a":"Jonathan oh this guy. How many apologies will he have to make?","post_message":"US presidential candidate Donald J. Trump has issued this apology for obscene comments he made about women in a newly released videotape from 2005. Follow the latest on this story: @webpagelink"}]
