[{"comment_id":"493650944158819","commenter_b":"Get rid of her","commenter_a":"Well her whole life she's been breaking the law, she corrupt .","post_message":"Hillary's career could be over after she was exposed doing this. Good. Let's end it right here, right now, once and for all. Do you agree Hillary Clinton should be relieved of her duties?"},{"comment_id":"10152815775186680","commenter_b":"she looks like Michelle Duggar!","commenter_a":"She wants ANOTHER wasted 15 minutes...go away...","post_message":"“There is no way that she did not know what was going on, that women were being abused and accosted by her husband,” Jones said."},{"comment_id":"861215140607271","commenter_b":"Alex, it wasn't proven to be false. Please cite the \"proof\".","commenter_a":"I respect you Senior Airman but your comparing Ron Paul & Jessie Ventura to the killer as \"typical\", is absolutely ludicrous. I don't even know where to start I'm so disappointed.","post_message":"EXPOSED: Chris Kyle Killer Didn Have PTSD, Was A Typical Anti-War Punk Like Bradley Manning. I like to know if Routh or his family had any contact with Jesse Ventura in the days before he murdered Chris Kyle. Allen West and Walid Shoebat are also trying to sort out if his anti-war beliefs had graduated to jihadi sympathizing or... #americansniper #dallasobserver #guns @webpagelink"},{"comment_id":"1384025364955130","commenter_b":"Good god what a shit show........our nations democracy is at risk..ELECTORS DO YOUR JOB AND PROTECT AMERICANS FROM THEMSELVES","commenter_a":"Oh brother....","post_message":"Conway again defending one of Trump's intolerably dangerous views."},{"comment_id":"10153811887041770","commenter_b":"I never liked Nancy until I saw her genuine love and grief for the loss of her Husband.","commenter_a":"Well honey you know everybody laughed at Ronald Reagan because he was a movie star not a reality star cuz they didn't have that back then but he was still a movie star and they all laughed at him but guess what he broke down the wall he made this country great he made us unified and we love him and we love Nancy for The Classy wonderful woman that she was. Can we actually say that about what's an office now?","post_message":"Ann Coulter: “Why couldn’t it be a more genteel, a more elegant person like Mitt Romney. But as soon as you think that to yourself, you realize that is a creature that doesn’t exist in nature. For the attacks that Trump has come under, you have to be a tacky reality-TV star.”"},{"comment_id":"838910662903525","commenter_b":"@username Take your temper tantrum elsewhere! Hillary's got this! #HillYes","commenter_a":"LOL JK BUILD THE WALL DEPORT THEM ALL TRUMP 2016","post_message":"I was so moved to receive this honor from Puyallup Tribal leaders."},{"comment_id":"10154731956548797","commenter_b":"@username - Canadian!","commenter_a":"What the hell is wrong with this city? What is the death toll so far for this month?","post_message":"FATAL STABBING ON RED LINE: CTA Red Line trains are suspended between 35th and Garfield after a woman was stabbed to death on a train Thursday afternoon."}]
