[{"comment_id":"1287852217938587","commenter_b":"Don't worry Hillary is gonna make it all go away!","commenter_a":"everything is so simple, what would you do if you were in their place?? if you were from the illuminati or some sort of influence to the world?? right? we would do whatever it takes, use the media and technology or any type of power given to us to lie to ppl to influence the. and make them thing whatever we want to think...population control","post_message":"Now that we finally know the Orlando shooter's real motive, the question remains: why did the FBI try to hide it for so long?"},{"comment_id":"10153519311713984","commenter_b":"you do see there is a white girl sating beside her and a couple of white boys with phones videoing they need to have there butts kicked","commenter_a":"This president is ramping up the racial discord for a reason, and it's not going to be good.","post_message":"A white woman was holding her toddler and minding her own business... but then this black teenager saw her and did something awful. The entire scene was caught on video... can you guess why Al Sharpton isn't saying anything about this?"},{"comment_id":"1014005318629521","commenter_b":"Mine usually bark at noises or neighborhood dogs. However our Pit will ECHO in the house for 30 minutes when she wants to play. It only annoys us! However my neighbors digs howl for hours and have eaten my fence!","commenter_a":"Dang, what if the family isn't home?","post_message":"DOG BARKING ORDINANCE: Dallas city officials want to cut down on barking dogs. City officials have created an animal ordinance that says it is an offense if a person lets their dog bark for longer than 15 minutes. Would you agree with a similar ordinance in the Houston area? MORE ---> @webpagelink"},{"comment_id":"10152949847416615","commenter_b":"A job well done champ!!","commenter_a":"I need some of that cashola","post_message":"The New Castle Police Department says K9 Champ was instrumental in locating the $15K that was hidden throughout the residence..."},{"comment_id":"10153196800261051","commenter_b":"Shut up you bitch! !","commenter_a":"I thought for sure she would want to be a Ferguson protester!","post_message":"Michelle Obama was asked a simple question: If you could have any other job in the world, what would it be? Here's her response."},{"comment_id":"10155071797057235","commenter_b":"@username Melania is smart. She's living in New York with her son and her parents. Trump isn't even home half the time. All she has to do is keep up appearances. Show up at the Inauguration and a few key events.","commenter_a":"Yeah. You don't even have to know him to know this was gonna happen. Just watch him for the last 20 years. Why didn't his family talk him out of it.","post_message":"The giant orange baby-man president hates his job. Nobody could have predicted this..."},{"comment_id":"648669105287702","commenter_b":"That Bitch be ugly!!!!","commenter_a":"So be it","post_message":"Whoopi Goldberg Says She Might Leave The Country If Trump Is Elected. Well I guess she's going to say goodbye. Will you happy to see her go?"}]
