[{"comment_id":"10158012155960354","commenter_b":"Prosecute her! Drain the swamp!","commenter_a":"lock donna brazil up.........","post_message":"“Stealing valuable proprietary confidential information is illegal, and debate questions are highly confidential,” said Ken Sukhia, who served as United States Attorney for North Florida and who has prosecuted numerous white collar crimes."},{"comment_id":"1113874841966859","commenter_b":"Beck, that British English is English English, as in the correct way to speak ENGLISH. ;)","commenter_a":"I’m with everyone else, “Learnt”?","post_message":"How many of these were you taught?"},{"comment_id":"692830987553004","commenter_b":"Fr we were running thangzz up in that bitch","commenter_a":"@username i don't miss Carrows but I miss working with you. 😿😻","post_message":"Too lit! #WSHH"},{"comment_id":"617240545084050","commenter_b":"Gabe Monfried","commenter_a":"She was checking up on Bill","post_message":"It was really strange when Hillary was missing from the podium last night. Not very presidential!"},{"comment_id":"1040961739305022","commenter_b":"Thats right. He you dont like it then get the hell out of MY COUNTRY","commenter_a":"I do want my country back...America...the land of the free from sea to shining sea, from mountain to desert...I want it all back, all the beauty and peace and sweat and hard work that we Americans have given this land...I want it back...my America...not some version that obammer thinks it is...not his America...my America..and if that offends anyone, that is just too damn bad.","post_message":"Americas Freedom Fighters"},{"comment_id":"10154173812304205","commenter_b":"As long as she keeps getting elected, she wont feel the need for change!","commenter_a":"If she was a basketball coach, she'd be fired. Continue to work for your district in CA, but someone else from another part of the country like for example a representative from Wisconsin or Michigan should lead. The Democrats are pussies.","post_message":"Nancy Pelosi wants to assure you that everything is fine in the Democratic party. She is wrong."},{"comment_id":"10153094131986378","commenter_b":"Nothing is going to happen to this so called mother ...because if a white judge sentenced her to prison..she'll pull the race card.......","commenter_a":"Can we leave her in a hot car???","post_message":"TODDLER LEFT IN 117-DEGREE CAR: An Arizona mom has been charged with child abuse after surveillance video showed her leaving her toddler locked inside a hot car while she went shopping at Walmart. See the surveillance footage:"}]
