[{"comment_id":"10153837326772293","commenter_b":"To know how irresponsible and corrupt a candidate is, is worthy to know. Even the main stream news, democrats and the I.A report denouncing Hillary of improper acts in office is added to her bungling of Libya and other important areas. You can't make this up. I'm sure if even convicted of treason her stiff supporters would kiss her ring before she flew away on her broom.","commenter_a":"Thanks for that pearl of wisdom Newt. While you were trying to impeach President Clinton, you and Hyde, Livingston were having affairs of you own..hypocrisy much!!","post_message":"“Part of it is, he’s just trying to throw stuff in the air and keep her rattled,” Newt Gingrich said."},{"comment_id":"10154180577936770","commenter_b":"no he isn't","commenter_a":"He is violating the constitution again. Smh.","post_message":"Liberals are accusing Donald Trump of implementing a \"Muslim ban\""},{"comment_id":"404568359667759","commenter_b":"They all need to go somewhere else!","commenter_a":"what is wrong with the United States flag this is United States we have the right to fly our flag just like any other country","post_message":"Why do some people want to ban our flag?"},{"comment_id":"1800550493547458","commenter_b":"Good idea but im barefoot anyway","commenter_a":"@username would you use it?","post_message":"The iron horseshoe is now a thing of the past."},{"comment_id":"10152900911316336","commenter_b":"Jane looked to further her movie career ,it didn't work.Scumbag","commenter_a":"Traitor!","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."},{"comment_id":"10156264408410725","commenter_b":"The smart Americans will vote for Trump and Cruz. And that includes the \"legal\" Hispanics here. Trump wants to deport the millions of \"illegal\" immigrants..the ones who sneak in undocumented, or overstay their visas, or get deported and sneak back in...THE ONES THAT KEEP KILLING INNOCENT AMERICANS and drain our system! Get them the hell out.","commenter_a":"Go Trump!!! Hispanics for Trump 2016","post_message":"Join me Tuesday, November 3rd at 12PM in Trump Tower New York. I'll be signing copies of my new book CRIPPLED AMERICA. Don't miss it!"},{"comment_id":"654574044733174","commenter_b":"Forget you Hillary!!!! REMEMBER Benghazi????????? YOU'RE NOT GETTING MY VOTE!!!!! Rot in hell you piece of shit!!!!","commenter_a":"Fuck that Bitch.","post_message":"Hillary Clinton wants the Fox News host's head, but she's not backing down. She is in trouble. Let's show her our support. Can we get 10,000 'LIKES' for this Fox News Host's stand against Hillary?"}]
