[{"comment_id":"10152704207984135","commenter_b":"Don't tell me how to live my life, bitch!","commenter_a":"And now on this part of our safari, we see on our right a fat Rino. The gazelle on it's left hasn't to worry, for Rinos are herbivore. This particular Rino, unfortunately, is an omnivore. Watch out, Laura!","post_message":"w/ Laura Ingraham at #CPAC2015"},{"comment_id":"10154194875640009","commenter_b":"This woman is a black retard, like the retarded black guy that was standing behind her when she spoke about the Kremlin invading KOREA. You let goofballs like this in a leadership position, you'll get a 3rd world country.","commenter_a":"the poor that is","post_message":"ICYMI"},{"comment_id":"821190501249706","commenter_b":"just his type, they can have fruit loops together","commenter_a":"Yeh but our leader will meet with a woman eating fruit loops in a bathtub! !! POS","post_message":"The White House is FURIOUS with Boehner for breaking protocol! Looks like somebody doesn't like the taste of their own medicine!"},{"comment_id":"10153391212533984","commenter_b":"Dumb ass!!!","commenter_a":"Another actor who thinks his opinion matters to anyone with an IQ over that of a houseplant....sooooo sorry George, but you really should stick to acting.","post_message":"This might lose George a few fans. What's worse than announcing he'll give this candidate 'whatever they want,' was the claim he made about a scandal that surrounds this particular 2016 hopeful..."},{"comment_id":"10153945606794060","commenter_b":"Shut up!","commenter_a":"Turkey is the gateway for Islamists to enter Europe and the birthplace of fascism.","post_message":"For the Turkish nation Turkishness goes beyond nationality. But some citizens consider themselves more Turkish than others"},{"comment_id":"1275842862475459","commenter_b":"Might have to tell family to leave Italy and come here as refugees","commenter_a":"You don't have to be a genius to see that's happening now. Send them all to the middle east","post_message":"EU admit immigration will destroy European values"},{"comment_id":"2040319902861153","commenter_b":"Trump dont controll the border walls he will make trouble here in border town n Mexico... we have crime here due to there here already the Cartels n Zetas in da USA in the border cities... USA build walls the always around or underneath or make ladder in the walls","commenter_a":"Wow. You hate waterboarding of terrorist and protest on the streets of America on their behalf. But the beheadings of American soldiers, christians and innocent civilians in the Middle East and nothing said on the streets of America. And you call yourself an American. Seems like the left is more interested in open bathrooms and open borders, hmmm?","post_message":"Wake up, America!"}]
