[{"comment_id":"864666960316353","commenter_b":"I know! Power to the feminists. But that would make me feel dirty .","commenter_a":"Grace Te Moananui @username","post_message":"Armpit Hair Is Trending, And It’s A Step Forward For Women Everywhere"},{"comment_id":"873173032819817","commenter_b":"Why are so many women that insecure? Come on...","commenter_a":"No thats called someone having mental issues lol","post_message":"Warning to all couples."},{"comment_id":"1542895312670081","commenter_b":"#Trump #Trump2016 #MakeAmericaGreatAgain #WomenForTrump #VeteransForTrump #IllinoisForTrump #ArizonaForTrump #TrumpTrain #TrumpForPresident #TrumpAmerica #TrumpBuildThatWall","commenter_a":"All you guys are a joke trump is running as a republican because he knows you're dumb enough to fall for his show, look up trump interview news week 98","post_message":"Politicians are trying to chip away at the 2nd Amendment. I won’t let them take away our guns!! #MakeAmericaGreatAgain #Trump2016 Text TRUMP to 88022 to get exclusive updates!"},{"comment_id":"10153475368683984","commenter_b":"What in the hell is wrong with people like her. She should be deported fro America after serving appropriate jail time.","commenter_a":"Big shock.","post_message":"I can't believe THIS is what parents had their children doing while protesting the Texas pool-party incident... Shocking... Do you think what these parents did was outrageous?"},{"comment_id":"10154962513977235","commenter_b":"That's Trump's kinda gal. She and Melanoma should get together and compare notes.","commenter_a":"Shows how repub's don't have a brain of their own! The just regurg other people's info and apparently aren't too concerned about the ethics of theft 👎🏼","post_message":"\"The book contained a complete cut and paste job on Keynesian economics taken from off the internet.\" BUSTED!"},{"comment_id":"969458729761266","commenter_b":"Eat a dick,you stupid bitch.I do have personal pictures on my page that's how much you know.","commenter_a":"And you, @username, are an asshole, and so fugly you don't have the balls to post a real pic.","post_message":"Michelle Obama is simply the best First Lady ever."},{"comment_id":"857261721036748","commenter_b":"He is a terrible president regardless of anything else.","commenter_a":"I'm sick of this crap!...He's a great President..Who cares what religion he is?","post_message":"Scott Walker says he doesn't know if President Obama is a Christian."}]
