[{"comment_id":"1356943270993679","commenter_b":"Take away about 15-20 million illegal immigrants and where are you? Be careful what you wish for.","commenter_a":"Yet, those \"islands\" hold the majority of the population... which will continue to increase as urbanization increases. You can play spatial games with maps all you want, but the reality is, our country should be predicated on the idea of one person, one vote (equal representation).","post_message":"This is actually a very informative map."},{"comment_id":"1551325111574622","commenter_b":"This is HER country.","commenter_a":"Now do we really care what this looney tune thinks or if she accepts Trump...if she does not accept him....send her out of the country!","post_message":"No one could have said this better."},{"comment_id":"10153687652479885","commenter_b":"That was stupid! Sounds like she needs to take that conceal carry class again!","commenter_a":"If you pull a gun out you need to pull the trigger. Shoot to kill not just threaten.","post_message":"A Florissant man was charged Tuesday with grabbing a pistol from a woman Saturday as she was trying to prevent him from attacking her friend in University City, then beating her and her friend with the gun and shooting one of the women."},{"comment_id":"1774184492816291","commenter_b":"@username racist idiot.","commenter_a":"NO WAY! No one else should be added to Mt. Rushmore, but especially not Obama! There are a lot better President's that could have been added, but not him!","post_message":"Obama's Face To Be Inserted Into Mt. Rushmore. Don't mess with this national monument. Do you think Obama's face does not deserve to be up there?"},{"comment_id":"1218557638174745","commenter_b":"Jennifer look's like you like to swallow dick","commenter_a":"Chris brown beats in women","post_message":"LIVE NOW: Police are outside artist Chris Brown's home. Police were called to his home after a woman called 911 requesting help. MORE: fox13news.com/news/@username-story"},{"comment_id":"1601468970152449","commenter_b":"Victoria SD you stupid bitch","commenter_a":"If only Khan talked about Islamic terrorist attacks as much as he talks about DJT - using his son's death to score points for a flawed ideology! Damage control!","post_message":"Khizr Khan, the father of a slain Muslim soldier, says Donald Trump is \"incapable of empathy.\""},{"comment_id":"10153361923310796","commenter_b":"Google it or California DMV website. Wake up.","commenter_a":"With over 50% of new California Driver's Licenses issued to illegals will anyone challenge voter fraud in Mexifornia?","post_message":"Republican presidential front-runner Donald Trump blasted Mitt Romney in Maine on Thursday after the party’s 2012 nominee criticized him, saying Romney would have “dropped to his knees” for his endorsement four years ago."}]
