[{"comment_id":"10153473054219087","commenter_b":"Also you're basically saying someone who has the same democratic socialism plan as MLK Jr is a Marxist. Please don't insult the intelligence of Bernie Sanders supporters. We know the difference and you sir are just trying to fear monger ppl into thinking that.","commenter_a":"Perhaps Bernie will be made to answer tough questions on his absurd views on governance. Bernie Sanders: A demagogue is on the rise The populist fever is now running rampant. A demagogue is on the rise. His appeal is founded in the notion that the professional political class has both failed and ignored the plight of a disaffected but vocal minority. In terms of substance, he leaves much to be desired. In style, however, he captivates and inspires. On the debate stage, he touts his surging poll numbers, spouts unrealistic but tantalizing anti-elitist policy preferences, and berates the moderators for asking him tough questions all to the cheers of his committed band of malcontents. Noah Rothman @webpagelink","post_message":"CNN abruptly announced today that it will hold a town hall with the Democratic presidential candidates in Iowa on Monday -- one week before voters in the state head to the polls for the first-in-the-nation caucuses."},{"comment_id":"10153194214264411","commenter_b":"That goes to zionist jews pigs from europe","commenter_a":"it's very important to distinguish between real Muslims and crazy fanatics who preach radical Islam. They just hide behind pseudo faith in God to do terrible things...","post_message":""},{"comment_id":"10150574072889999","commenter_b":"Exactly, politicians and police could learn a lot from thisman","commenter_a":"this is how a real man behaves - God Bless you Mr. Taylor","post_message":"Malcolm Taylor, a Baltimore city bus driver, was watching the riots unfold on television, and saw some of the players he coaches in youth football among the rioters. He gathered 15 friends, including some church pastors, and went to the riots near Mondawmin Mall to try to calm things down."},{"comment_id":"978476018838818","commenter_b":"How can a woman like this evil face.","commenter_a":"Oh for God's sake.","post_message":"PLEASE SHARE: Seattle police have released a photo and have identified the man suspected of setting his girlfriend on fire in South Seattle last night. Police are looking for 62-year-old John Turner >> @webpagelink"},{"comment_id":"10153008307071130","commenter_b":"Justifying double standards while still playing the perpetual victim. Yay modern feminism.","commenter_a":"Are we not gonna talk about how a 50+ year old lady forced herself on a 20 something guy? Because if it was the other way around, I'm sure you'd have milked it every possible way.","post_message":"In the ongoing saga of things brands should never tweet..."},{"comment_id":"999515513474836","commenter_b":"No shit ..told u that a while ago......u stubborn Dominican","commenter_a":"Especially after what happened in France.... I usually dont say much but liberal democrats can go scratch... ...its gonna happen here soon.......","post_message":"Watch: Pres. Obama calls out Republicans for pretending the Bush Recession was the \"golden era\" and refusing to give him credit for fixing their mess."},{"comment_id":"540816769423579","commenter_b":"Don't run 3rd party now. We would get blamed for a Hillary victory. There may not be much a republican party left in 2020, so that would be the time to start a new party.","commenter_a":"I think we should run a third party candidate now!","post_message":"Should conservatives start a third party? Should they begin one now and put it in place for 2020 or Should they run a candidate now? How would they not be blamed for a Hillary Win? Do you have the stomach for bloody politics to drive the final stake in the heart of Mitch McConnell's corrupt GOP? I have an opinion. I may surprise you. I want to hear Yours. Let's keep the name calling to a minimum let's have an actual debate based on Reason?"}]
