[{"comment_id":"10152886018669091","commenter_b":"Jaaajaj buena idea","commenter_a":"She can move to another planet . I really dont care","post_message":"\"If this happens -- I am moving to Canada. The CEO of a company is getting attention for a controversial Facebook post, where she says that female shouldn't be president.\" Here her reasoning: @webpagelink"},{"comment_id":"10153564922718984","commenter_b":"I think the Hispanic people think that the U.S. owes them everything. Being a hairdresser I did lots of H/cuts on men. They wanted every hair on their head to be Perfect. It really bothered me when so many men came in the salon just to wait until the H/C was finished. They would bring young girls with them, who could interpret the English language. It was so hard for the young girls to be put in the middle to speak for them & me. This should be a wake up call due to illegal immigrants.","commenter_a":"We all know this!!!","post_message":"This frustrated sheriff just sent a huge message to America that perfectly sums up Donald J. Trump ... his words are going viral and it's easy to see why. What do you think about what this sheriff just said about Trump?"},{"comment_id":"10155031331646320","commenter_b":"You are on my prayer list.","commenter_a":"Stay strong","post_message":"Detective Steven McDonald was hospitalized earlier today after suffering a heart attack. Our thoughts and prayers are with the McDonald family. A former U.S. Navy hospital corpsman and third generation police officer, Steven McDonald was shot three times in the line of duty on July 12, 1986. The shooting left him quadriplegic. Several months after his injuries, he said that he had forgiven the 15 year-old who had shot him."},{"comment_id":"10153735329829205","commenter_b":"Fuck clinton and her globalist allies","commenter_a":"Come on Loretta lynch meets bill Clinton on the Tarmac before the Benghazi report. See the movie 13 hours in Benghazi please don't tell me that every person in that movie was lying about what happened that night. There was no reason why they all resigned? Like you yourself said maybe technically they did nothing wrong but morally ? And who was to blame ? And what happened after ? And let's not forget the laugh. I would never vote or defend the Donald but let's not call a word on cnn anything but spin for Hillary. They have not even reported on the so called technical issues with the voting errors or for what went wrong with Nevada. Seriously do you honestly think that your viewers cannot see through your crap when you are crapping too ?","post_message":"Michael Cohen is one of Donald J. Trump’s top advisors, an a lawyer. He may have just committed libel against Hillary Clinton."},{"comment_id":"1708500929417584","commenter_b":"My native American vote for Trump Try to keep this in mind, Donald Trump did not steal your money. Donald Trump did not raise your taxes. Donald Trump did not quadruple the price of food. Trump is not stirring a race war. Trump did not leave any US soldiers in Benghazzi to be slaughtered and desecrated by Muslims. Trump did not send the US Navy to fight for Syrian Al-Qaeda. Trump did not arm ISIS and systematically exterminate Christians throughout the Middle East. Trump did not betray Israel. Trump did not provide financing and technology to Iran's nuclear weapons program. Trump did not give our military secrets to China. Trump did not remove our nuclear missile shield in Poland at the behest of Russia. Trump did not shrivel our military, and betray our veterans. Trump did not cripple our economy. Trump did not increase our debt to 20 trillion dollars. ...","commenter_a":"Trump is the worst person in the world.","post_message":"Unfortunately - when some people do not like what they hear, they have a tendency to smear the facts. As your next President of the United States of America - you will be proud of your leadership in Washington, D.C. - and know that our best interests will be for you, the AMERICAN PEOPLE. WE will be WORKING FOR YOU!"},{"comment_id":"10153913650358010","commenter_b":"Male, female, you are still a crazy bitch.","commenter_a":"Bill Clinton is the WHITE BILL COSBY and she is a LIAR","post_message":"We're 309 days away from Election Day."},{"comment_id":"10153653886305950","commenter_b":"Shut up, whore.","commenter_a":"The teen should have complied. And his parents did a terrible job.","post_message":"The aggressive confrontation nearly cost the teenager his life."}]
