[{"comment_id":"623726524464132","commenter_b":"LOCK HER UP ---THROW AWAY THE KEY","commenter_a":"That kind of memory or lack thereof makes her a danger to herself and others.","post_message":"Tom Fitton is LIVE discussing Hillary Clinton's response to Judicial Watch questioning under oath and more in our Weekly Update. [for higher volume touch sound icon on screen or turn your speakers up ]"},{"comment_id":"10156617842095354","commenter_b":"This is just another Obama liar. Do not pay too much attention to her....Someday everything that they have done will come back and bite them in the butt.","commenter_a":"I've got to ask: Is Shultz starting to look more and more like Jar Jar Binks? What's going on there? I must avert my eyes.","post_message":"***FIRESTORM OF DEMOCRAT LIES***"},{"comment_id":"1068079936600104","commenter_b":"Most Mexicans ARE Indians....there for they are home.....my people the INDIANS OWN THIS LAND!","commenter_a":"Dems are the ones dividing the nation by spewing their judgement and hate on all those that don't agree with their views.","post_message":"WATCH: Donald J. Trump hosts campaign rally at the Fox Theatre in Atlanta. @webpagelink"},{"comment_id":"10153016885814117","commenter_b":"The word you will never hear from your wife, @username.","commenter_a":"Perhaps the costs of CC regulation should be compared to the costs of climate change inaction? CEA finds what economists would call “increasing marginal costs” of delay. If we don’t make a concerted effort to keep the rise in average global temperature within the range consistent with modest costs and instead allow it to stabilize one degree Celsius higher, the annual additional damages would equal 0.9 percent of global output. A longer delay that added another degree would cause additional annual damages of 1.2 percent of global output. That’s a total change of 2.1 percentage points. To illustrate those annual costs more tangibly, 2.1 percent of current U.S. GDP, which is about a fifth of world output, is roughly $360 billion. The story doesn’t end there, however. There’s a lot of uncertainty around these estimates. Acting sooner rather than later is insurance against unpleasant surprises. We’re happy to pay fire ...","post_message":"Today, President Obama and the EPA are announcing the final regulations that would establish President's Clean Power Plan. How much will it cost you?"},{"comment_id":"917835871594729","commenter_b":"This is a very old photo of Hillary...she has become too old and out of date to be the Democratic President we need!","commenter_a":"Be nice if She would make up Her mind!","post_message":"Are you supporting Hillary 2016? Then go to DemStarter.com right now and show your support: @webpagelink Hillary is in 3rd place in pledged support behind Elizabeth Warren and Bernie Sanders on DemStarter.com, but we're still just days into it. Go to DemStarter.com, and show your support for Hillary, or for your favorite Democrat!"},{"comment_id":"1578057615587695","commenter_b":"10 Days and she will be our president","commenter_a":"@username am I right Cody Martinez","post_message":""},{"comment_id":"10153864002342217","commenter_b":"Always the ones left behind, always on the pity party stage, always the why me question, always on the help me podium, it is exhausting.","commenter_a":"Most atletes from other climes left Rio as soon as they completed their stakes. Africa! Africa!! Africa!!! They will never cease to amaze.","post_message":"Kenyan athletes are stranded in a Rio shanty town after the closure of the Olympic village, the team captain says."}]
