[{"comment_id":"788040247961250","commenter_b":"you were pounced on by women....","commenter_a":"I feel so sorry for him. When did we as a people become so cynical, unfeeling, intolerant and belittling. He made an old person's mistake - we old farts are often out of sync with the modern culture - it's not a crime. Did anybody consult the women he worked with before they dumped him??","post_message":"\"They haven’t even bothered to ask for my side of affairs.\""},{"comment_id":"10154391127173181","commenter_b":"Good grief, this woman needs to get a life!","commenter_a":"Me, me, me, me, me, me, me, me, me, me,me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me,me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me,me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me, me.","post_message":"...continues, globally, to overwhelm my appearance at the Oscars, on the occasion of my record-breaking 20th nomination, and to eclipse this honor in the eyes of the media, my colleagues and the audience, wrote Meryl Streep in a scathing statement about the Oscar dress dustup."},{"comment_id":"10153938173248967","commenter_b":"That girl a punk","commenter_a":"It's been crazy windy. Was hard to walk.","post_message":"What's that nickname for Chicago, Illinois, again? Stay safe, people"},{"comment_id":"757206074401067","commenter_b":"Go suck off another jihadi, Dilosh asshoIe.","commenter_a":"How can you go into someone else's land. Occupy it, then claim self defence when a 16 year old kid attacks. Isn't he the one doing self defence since its you that on his land?","post_message":""},{"comment_id":"10155299383400354","commenter_b":"Those of us who are legal US citizens in need can't get help yet we give those who are illegal help. When I fractured my neck in 3 places and shattered my leg all I got was 200 in food stamps. I was 55 and I lost everything. Stop giving this country away to those who disrespect with their very first action. Coming here illegally.","commenter_a":"They are giving them ids and other things so they can once again steal the presidency through illegals voteing. Get out and vote stop the craziness. Our president is in office illegally as he is not a US born citizen. So of course he is for illegals.","post_message":"NYC's New Illegal Alien ID Program Includes Free Membership to 33 Top NY Venues, Including the Metropolitan Museum of Art."},{"comment_id":"703232799867298","commenter_b":"Yes! Wipe them off of the Earth!","commenter_a":"Unfortunately this is what needs to be done to get this sickness out as best we can","post_message":"Several ISIS leaders have just been taken out. Good riddance. Should we send our air force back to Syria to end ISIS for good?"},{"comment_id":"10154011395049778","commenter_b":"Women get less pay than men so I guess the bill won't be worth the face value","commenter_a":"I really couldn't careless as long as the bill still spends the same.","post_message":"A woman will appear on the $10 bill beginning in 2020, the Treasury Department said Wednesday."}]
