[{"comment_id":"1178752805478081","commenter_b":"Sick the American get off this privacy","commenter_a":"If someone comes to my door wearing that outfit,I will personally egg them.......","post_message":"It's nowhere near October, but one ensemble is already on track to be named the most controversial Halloween costume of 2015."},{"comment_id":"827081283993961","commenter_b":"Moochele needs to shut her ugly mouth.","commenter_a":"We can't stand her either.","post_message":"Is she serious?"},{"comment_id":"468706906587237","commenter_b":"She is a Dumb Idiot!","commenter_a":"We dont need awoman Preident .that is for immigration ....","post_message":"Carly Fiorina just had these harsh words for Donald Trump. Do you agree or disagree?"},{"comment_id":"439208642934096","commenter_b":"She should be fired !!!!!!!!!!!!!!!!!!!","commenter_a":"The teacher should be fired and possibly sent to Afghanistan!","post_message":"An Illinois teacher was placed on leave after stomping on the American flag in front of students. That teacher should be ashamed; the American flag deserves to be flown everywhere with respect and honor! ForAmerica"},{"comment_id":"10154545590463010","commenter_b":"#NeverHillary #NeverTrump #JillStein2016","commenter_a":"Hmm, funny that you could say all the exact same things about Clinton. Time to stop pretending she's better than he is. Sorry y'all - we let the US drift so far to the Right a Trump popped out, but that isn't his fault. Particularly when he isn't the war criminal candidate between the two major party offerings...","post_message":"Psychiatrists aren't supposed to psychoanalyze presidential candidates. A Yale psychiatry professor writes in Los Angeles Times Opinion:"},{"comment_id":"10153690611426756","commenter_b":"The woman is the patient.","commenter_a":"It's interesting the idea that the woman is the \"patient\" so her health is all that matters. I've always pictured prenatal care as for both the mom and baby together.","post_message":"Over the years, residents have come to Janet Singer, a nurse midwife, with tricky questions about performing abortions: Where does life actually begin? How do doctors’ personal beliefs play out in their clinical care? And what’s really best for mothers? She thought the public would benefit from hearing their experiences, so she asked four residents to write about them."},{"comment_id":"1211880145496741","commenter_b":"No to illegals.","commenter_a":"Mr. Gowdy, enlist some of your \"sleeping\" colleagues to assist!","post_message":"Thank you!"}]
