[{"comment_id":"495141487277558","commenter_b":"And you do? Cause your so fucken righteous and enlightened?? Get the fuck out of here it's called war we didn't start it but we damn sure finished it fuck them! They killed our people, we killed theirs.","commenter_a":"So your all saying they blew up a few ships of ours and that justifies nuking a whole city your all a bunch of in breed morons that lack logic and intelligence and have no awareness of the real world around you","post_message":"Since the bombs were dropped, the U.S. government, U.S. high school history texts, and the American public have asserted that dropping the bombs was necessary. But is that really the case?"},{"comment_id":"1698243613797536","commenter_b":"@username u racist chink","commenter_a":"Dimash Shayan we gotta do this","post_message":"Japan is hiring full-time ninjas!!!"},{"comment_id":"1015223798498631","commenter_b":"I see what you did there","commenter_a":"That's gold","post_message":"Sorry folks."},{"comment_id":"10153128335637377","commenter_b":"This has moved into the realm of pathetic and into hilariousness. Enjoy your bondage sir. Maybe try to forgive \"white\" America for its oppression and causing your \"struggle\" from 1960. Today, In this Great Country, Freedom is a choice, along with all its wonderful benefits. I beg you sir to chose it, its so much better than your aged and historical mind of past racisms and injustices. I look at your page and I see hate and division and lies, man and it saddens me. We're Americans and the media has us divided. I hate that. Its a new day bro, leave these young kids alone with your junk, let them grow up in a world without your racist wounds from the past. I shame you and the media for this junk. I have spoken my heart, this chain is closed for me","commenter_a":"You must know, this is not about equality, at its root its about domination from a revengeful spirit. There will be no end to this until they \"feel\" whites are subservient. This state has cowered to the media and social media pressures in lieu of implementing meaningful and lasting University policy changes of \"equality\". We should prepare for ....What and who is next?","post_message":"\"He just resigned for committing the crime of being a white male,\" Limbaugh said, calling it as \"a social justice warrior's story.\""},{"comment_id":"680629115421379","commenter_b":"She needs to just go away already.","commenter_a":"We can let her become president","post_message":"Hillary Clinton slammed Donald J. Trump's \"I'm with you\" proclamation, writing on Twitter, \"Not included: women, African Americans, LGBT people, Muslims, Latinos, immigrants...\""},{"comment_id":"1016852955001727","commenter_b":"Calais wasn't a jungle before these muslim herds invaded it and consequently turned it into filthy, unsafe jungle!!! Let them go to muslim countries for a better life, they do not belong to Europe!!! They cannot and will not assimilate. EVER!!!","commenter_a":"Welcome to Europe, here you be safe and free","post_message":"\"It's slowly, slowly starting to become colder and I don't know what are their plans, these people, because if it starts snowing, most of the people, they're going to start coughing and getting sick and probably dying in that jungle.\" Read more: @webpagelink"},{"comment_id":"10153845354225579","commenter_b":"I guess Elizabeth you didn't get the memo. Women are excluded from being president as well! You all don't have the fortitude to do what is clearly a mans job!","commenter_a":"Really..Because the shame is on all of the Obama administration. I happen to agree with Dr. Ben Carson..","post_message":"Senator Harry Reid: on Dr. Carson. The Senate minority leader responds to Dr. Ben Carson remarks on Muslims."}]
