[{"comment_id":"882172088504463","commenter_b":"Do you guys know Bernie is a SOCIALIST.. A SOCIALIST !!!! why do you guys hate America so much, I tell you why, because YOU HAVE NO IDEA HOW IT IS TO LIVE IN A SOCIALIST SYSTEM , go to any South American Coutry , tell any parson who have lived under this system that YOU support a Socialist in America, be careful you might get your ass kicked due to stupidity ...pick a Socialist country, live there for 6 months then wee talk ....IGNORANT!!!!!!!","commenter_a":"It's one thing to get elected as Mayor of Burlington, VT, then, Congress, and the US Senate with a population of 800,000 where $5 or $10 makes a difference and running for President. We all know the game is fixed. And, as an incumbent, it was fixed in his favor.","post_message":"Five years ago, the Supreme Court issued what I think is one of the most disastrous decisions in its history, Citizens United v. FEC. Billionaires buying elections is not what our Constitution stands for. Add your name to my petition if you agree that our democracy is not for sale: @webpagelink"},{"comment_id":"10157076515550354","commenter_b":"Agree . No one uglier or nasty except her daughter !","commenter_a":"Where's my $$$? Ohhhh...she wants online trolls who will say something good about her....my mistake...","post_message":"SURPRISE!"},{"comment_id":"1212661252101912","commenter_b":"Lmfao bitch","commenter_a":"@username and you can't even do 5 seconds LOL","post_message":"A policeman just planked for 8 hours and broke the Guinness World Record."},{"comment_id":"10152670705340671","commenter_b":"Glad she was able to fight him off but lets be smart about it ladies.","commenter_a":"What was she doing jogging in the dark at 5 am in the morning. I am not condoining she got attack. But account for ones own safety is what I am saying.","post_message":"The woman was able to fight the attacker off, police say."},{"comment_id":"10153422129686636","commenter_b":"legal migrants not border jumping criminals","commenter_a":"Trump is a right wing extremist who perpetrates racial stereotypes about minorities to serve an agenda. Trump is an opportunistic bigot who has historically enjoyed good relations with Muslims but to become elected, he has jumped on the bandwagon of Islamaphobia. Attacking the Mexican community is also another opportunistic attempt to create hatred, division and anger. The most beautiful thing about America is its a nation of immigrants. A melting pot of many nationalities and a true leader would do everything in their power to unite all of us as opposed to dividing through religious and racial hatred.","post_message":"Well played, Canada"},{"comment_id":"10153903118333690","commenter_b":"Israeisl go there with American pasports","commenter_a":"Donald Trump need to stop Americans going to Muslim Countries whether it,s visit or work","post_message":"US Republican front-runner Donald Trump wants to ban all Muslims from entering the United States. Elsewhere in the world, Tuesday marked the 50th anniversary of the Race Relations Act in the UK, which outlaws discrimination on the grounds of colour, race, ethnic or national origin. So, how has racism changed over time?"},{"comment_id":"2471637393058961","commenter_b":"@username still better than that lying bitch you voted for","commenter_a":"Why do you guys keep asking the same stupid question...I guarantee you no one on the right has changed their minds...now maybe some on the left came to their senses","post_message":"Would you like to see this duo in the White House again?"}]
