[{"comment_id":"837004389725950","commenter_b":"Oh so sad.","commenter_a":"Amen!!!!!","post_message":"Absolutely! Thanks to our friends at Democratic Memes for this great image. Give their page a like and let them know we sent you!"},{"comment_id":"10153686038898984","commenter_b":"DO NOT PASS GO....DO NOT COLLECT ANY MORE OF OUR MONEY......GO DIRECTLY TO JAIL....GITMO.......HOPEFULLY....barack HUSSEIN ......WILL FOLLOW !!!!","commenter_a":"YES!","post_message":"Wow. It looks like winning the presidency is about to become the last thing on Hillary's mind... Do you think Hillary should be indicted?"},{"comment_id":"10153779416811509","commenter_b":"I pledge allegiance to the flag of the United States of America......not the flag that fought against it #patriot","commenter_a":"People need education on the history of the flag and the different types of confederate flags. The black confederate flag is the bad one.","post_message":"Mississippi's House Speaker says his \"state's flag has become a point of offense that needs to be removed.\" The Confederate flag appears in the top-left corner. @webpagelink"},{"comment_id":"999058010215871","commenter_b":"Only palestinian tribe are Jews enemie because predatory tribe wants to grab everything from the Jews Included the History","commenter_a":"It is good you have such a strong army with all the enemys around you! May God be on your side!","post_message":"A beautiful moment full of love and appreciation at the 2016 Jpost Annual Conference. Share this video if you think that the Israel Defense Forces is the greatest army in the world!"},{"comment_id":"10153707771213598","commenter_b":"Oh wow, so I guess she never felt them moving around in there for the last FOUR months of her pregnancies. That was probably a monkey or a frog moving around in there. Right. Stupid, evil excuse for a woman.","commenter_a":"Her remarks don't make a bit of sense. What in the world she thought was growing in her body got 9 months, and she is swelling and gaming weight, etc. did any of her babies kick and move around? Was she skinny when her children were born? She just instantly gave birth to a baby out of the blue! Wow! Just plain stupid.","post_message":"Planned Parenthood President: My Childrens’ Lives Began at Delivery, Not Conception"},{"comment_id":"10153301288059411","commenter_b":"Yeh the Danish who's having sex with dogs are Muslims too. Many US states still legalize animal sex until today. Bow down to your ziojew masters and shag some horses","commenter_a":"Jews been making porno videos using American girls and animals ( dogs, horses) for centuries now. Disgusting vermin","post_message":"No more animal brothels"},{"comment_id":"1761239377456582","commenter_b":"Why won't she just tell the story on camera instead of wasting all that paper? And why were they recording this in the bathroom? And why were two grown women laughing and taking pictures of her in the store? And why the hell didn't her mom beat the living hell out of them? So many damn questions. Wtf..","commenter_a":"People are getting DNA and hormones mixed up as if they are the same or even similar.","post_message":"Transgender teen shares powerful message on bullying: \"We're not a threat. We are just like any other kids. We only want people to accept and love us for who we are.\" @webpagelink"}]
