[{"comment_id":"1513869335297739","commenter_b":"I would like to know how to follow the day to day Congressional sessions. I would also like to know how to find out who in Congress reported for work when Congress was in session. I would like to know the Congressional schedule, pay, vacation time, healthcare benefits including what company handles their care. I would like to know of any other benefits they receive, as an example- I believe there is a gym in the Congressional building. These are the questions I want answered. Please direct me to the places I can find these answers. Thank you and your team for the hard work and excellent reporting all year. I become informed by the you and sound very smart as I share it all. Hah! Rest up and enjoy the holidays.","commenter_a":"We will need you more than ever in 2017. Keep up the critical thinking, it seems to be a lost art with so many. Merry Christmas.","post_message":"Just a quick note to our BillMoyers.com readers that we are going on a much-needed holiday break. Thanks to all of you for reading, sharing and commenting on our content in 2016. We’d love to hear your thoughts on what you’d like to see from us in 2017. Please share your ideas in the comments section below. And have a wonderful holiday! See you in the new year."},{"comment_id":"10152552248390736","commenter_b":"Obama doesn't want anything that will improve the country. It is against his plan for a Muslim takeover.","commenter_a":"Get started on the over-ride and start taking with the House to get this president impeached!","post_message":"The Keystone pipeline would bring a reliable supply of energy into our country – providing opportunity, creating jobs and lowering the cost to ship goods, products and crops. The idea that Congress is sidestepping the normal process is out-of-touch with reality. This project has been studied for more than six years and has been given the green light at every obstacle. Arkansans and all Americans can see that President Obama is the real hurdle to Keystone. I will continue to support this project, and I urge the Senate to quickly vote to override this veto."},{"comment_id":"10153132255848145","commenter_b":"Thank you Rachel Payne Nunlist! :)","commenter_a":"I'm sure I will get major flack for this, but the older kids were 10 & 8!!!! Why don't they OPEN THE STUPID DOOR??? I'm not saying the mom was right, the kids could have for sure been taken, but for heavens sake, 10 & 8 is still 10 & 8 when it comes to a hot locked car!!!","post_message":"When a passerby found three young children alone in a locked car, police were called. The children's mom was found a few minutes later in a tanning salon. Here's what happened: @webpagelink #wftv"},{"comment_id":"1066819213408210","commenter_b":"Welcome home honey, Americans take care of each other. We want more proud immigrants like you!","commenter_a":"I am not a us citizen yet,but I hate seeing american burning a us flag..she not the one to fight for her freedom..she didn't even think to the forefathers that fight for her freedom right now..that has no respect at all..","post_message":"WATCH: A police officer takes an American flag away from a protester who was trying to burn it outside the GOP Convention in Cleveland."},{"comment_id":"10153521942669369","commenter_b":"Criminals will just buy another brand.","commenter_a":"Good. Maybe less guns on the streets.","post_message":"It's the end of an era."},{"comment_id":"10153127033512383","commenter_b":"Draw the little snakes out","commenter_a":"Bring it!","post_message":"UNAFRAID: Troops remain defiant on social media in the wake of the recent threat against military personnel from the Islamic State group."},{"comment_id":"1076303882387835","commenter_b":"Stoooopid bitch! ! ! ! ! ! !","commenter_a":"Folks, QUIT talking about her, just let her fade away to hell.","post_message":""}]
