[{"comment_id":"10155246118099749","commenter_b":"Just the words am looking for..... Thanks Gladys!!!!!!","commenter_a":"Awww! Whoever is using this little girl for political propaganda should know that she just won't get him or her any positive result.","post_message":"The seven-year-old girl, who became the symbol of the tragedy unfolding in Syria, has addressed President Trump in a moving video."},{"comment_id":"924171167620224","commenter_b":"It has to be big for him to screw this entire nation. Very very sad.","commenter_a":"What do you think this administration has on Justice Roberts that would make him vote twice for a law that is unconstitutional...","post_message":"John Roberts again sides with Obama."},{"comment_id":"10155757585249829","commenter_b":"Why not boycott Budweiser simply because it is not good beer?","commenter_a":"Melania???????","post_message":"Trump supporters on social media were furious: \"Never drinking Budweiser you should respect the AMERICAN president instead you mock with liberal propaganda.\""},{"comment_id":"931007510269923","commenter_b":"You Don't Hit a Woman,You Turn and Walk Away !!","commenter_a":"Will someone please beat this woman beater up and take away his nfl career.","post_message":"Florida State University quarterback De’Andre Johnson is charged with misdemeanor battery."},{"comment_id":"10152844746900667","commenter_b":"Gross looking. Many times, less is more.","commenter_a":"Ugly colors.","post_message":"\"Beautiful things happen when you take pride in yourself. #blackgirlsrock #kyebreaktheinternet,\" the prom queen wrote."},{"comment_id":"1765102733707241","commenter_b":"What a pig","commenter_a":"Mariana Vilella","post_message":"Hillary Clinton: \"It's just awfully good that someone with the temperament of Donald Trump is not in charge of the law in our country.\" Donald J. Trump: \"Because you'd be in jail.\""},{"comment_id":"10154610047733132","commenter_b":"This breaks my heart seeing this adorable fella like this.","commenter_a":"Help him !!!!","post_message":"Just one look in this poor guys' eyes tells you he's deeply unhappy. (via PEOPLE Pets)"}]
