[{"comment_id":"10153239564994369","commenter_b":"when you can't beat them, copy them!","commenter_a":"Made in china","post_message":"This is Samsung's newest phone"},{"comment_id":"10152920542711107","commenter_b":"Yes! Stop her!","commenter_a":"Yes","post_message":"Can you and I get 10,000 more signatures on Facebook? Over 21,000 of you have sent your \"Stop Lynch\" Emergency Fax Petition through Facebook -- and your voice is being heard loud and clear. Momentum is building against her confirmation thanks to your outpouring of opposition. In fact, two previously undecided Republicans announced their intention to vote against her nomination. But you and I can't stop now. As you know, Loretta Lynch has proven herself to be an advocate for the lawless conduct of the Obama administration and not an advocate for the rule of law. That's why I'm counting on you to keep the pressure on and urge my colleagues to vote \"no\" on her confirmation. Sign your \"Stop Lynch\" petition right away!"},{"comment_id":"10153589260353822","commenter_b":"Rebecca .... get out of the basement ....","commenter_a":"Requiring people to carry a concealed weapons permit is just another way the government can get your money. Do people actually think that criminals pay to carry a concealed weapon?? No, they don't. I think this is a great law, go WV!!","post_message":"Effective late May, people in West Virginia will be able to legally carry concealed guns in public without permits or training."},{"comment_id":"1191908450861681","commenter_b":"wake up and smell the flowers Jill.... get the Frack out of the race...\\\\","commenter_a":"Plus, the Green platform is 50 good, 50 incoherent","post_message":"(LU) Your run will strip votes away from Clinton. Bernie Sanders knows this. That’s why he isn’t running as a third party candidate."},{"comment_id":"10153714763793132","commenter_b":"I seriously dislike this arrogant woman who will not be kind to Shannon, she's stupid not to learn from the others. She's annoying...","commenter_a":"The color is BLUE!!!!","post_message":"The Real Housewives of Orange County star made a beautiful gesture."},{"comment_id":"10153306499856770","commenter_b":"She's pathological. Plain and simple.","commenter_a":"Yeah Hillary, you are just the best liar around!!!","post_message":"Hillary Clinton claimed, \"I have tried in every way I know how, literally from my years as a young lawyer, all the way through my time as Secretary of State to level with the American people.\""},{"comment_id":"10154177550736509","commenter_b":"She was legal to have sex in those two states! End of story!","commenter_a":"Did he KNOW she was a minor? That should make all the difference.","post_message":"The 17-year-old girl's cell phone had evidence of \"inappropriate communications over the last several weeks between (25-year-old Steven) Sheerer and the minor,\" the prosecutor said."}]
