[{"comment_id":"10155450012565354","commenter_b":"Common Women are not going to waste 2000/yr on themselves. That is uncommon disposable income.","commenter_a":"You are not close to \"the common woman,\" if you refer to her as \"the common woman.\"","post_message":"Gwyneth is quickly becoming our favorite celebrity."},{"comment_id":"10154379818081509","commenter_b":"Go away Judy womble","commenter_a":"Shut up Donald...go away","post_message":"\"I think she's right -- I am angry.\" In an interview on Erin Burnett OutFront, Donald J. Trump responded to Nikki Haley's remarks about him after #SOTU. @webpagelink #TrumpOnCNN #SOTUresponse"},{"comment_id":"10153646192799342","commenter_b":"I hope they have to serve every minute if those 60 years! What trash!","commenter_a":"So sad......","post_message":"The details of this case are just awful."},{"comment_id":"10153042580654411","commenter_b":"What a bitch ^^","commenter_a":"I condemn whatever happened in Paris and whoever did it wasn't a human for sure. But this is a shame. They kinda provoking people to do stupid stuff and it's like fuel on the fire. Shame on Charlie Hebdo","post_message":"'We will not give up, otherwise all of this will not have any sense.'"},{"comment_id":"420003978124197","commenter_b":"She's getting back what she deserves ! Treasonous witch !","commenter_a":"She's a loser","post_message":"Republican Presidential candidates are all ganging up on Hillary Clinton. Is this fair?"},{"comment_id":"1027758113945859","commenter_b":"What a bunch of liberal pussies you all are.....keep smoking that pot and living in your mom's basement LOL","commenter_a":"I love you Bernie!","post_message":"In just a few days, voters across New York will make their choice for the presidential nomination on Tuesday, April 19. The entire country will be watching as the results come in. And with your help, New York will send a profound message to the political and economic establishment in this country. That's why we're asking you to commit to vote for Bernie."},{"comment_id":"10154227254693256","commenter_b":"So give your vote to Hillary. Obama lover!","commenter_a":"\"NEVER\" - Trump, and that's not a \"Suggestion\" Mr. Trump, and that goes for \"John Miller\" either. What a Joke not him....... LOL! I say GO for it Mitt!","post_message":"Conservatives, even those not all that enamored of him in 2012, are beginning to entertain the possibility of Mitt Romney."}]
