[{"comment_id":"1113874841966859","commenter_b":"Beck, that British English is English English, as in the correct way to speak ENGLISH. ;)","commenter_a":"I’m with everyone else, “Learnt”?","post_message":"How many of these were you taught?"},{"comment_id":"10154177550736509","commenter_b":"She was legal to have sex in those two states! End of story!","commenter_a":"Did he KNOW she was a minor? That should make all the difference.","post_message":"The 17-year-old girl's cell phone had evidence of \"inappropriate communications over the last several weeks between (25-year-old Steven) Sheerer and the minor,\" the prosecutor said."},{"comment_id":"564263730449143","commenter_b":"She prolly snuck it in in her lady part","commenter_a":"Pam murdered Russ Farias wife Betsy and framed Russ","post_message":"Pam Hupp charged with murder - O'Fallon, Missouri Police and St. Charles County Prosecuting Attorney's Office hold a press conference on charges related to last week's shooting. Hupp has been charged with 1st degree murder in the shooting death of Louis Gumpenberger. She was arrested Tuesday. She was a central figure in a highly publicized murder trial covered extensively by Fox 2 News."},{"comment_id":"10154743139306508","commenter_b":"She's a liar ....","commenter_a":"The funny thing is the same scenario happened in Egypt four years ago with the Muslim brotherhood president Morsi, when someone beside him was telling him what to say and was caught the very same way Pelosi is caught now. I think same same school, no difference","post_message":"She didn't know people could hear her"},{"comment_id":"10152837029192894","commenter_b":"I do the housewives should be married","commenter_a":"I kinda have to agree @username what do u think ?","post_message":"NeNe Leakes Says Bravo Should Get Rid of All the 'Unmarried' Housewives -- Do You Agree?"},{"comment_id":"10152965938402232","commenter_b":"Your so right Geoffrey....why would she purchase a seat, in coach if she had no intention of using it?? So she could board the plane and hope she didnt get caught? That is not the time to have a disscussion about FCC rules!!! She should have a car seat with her....I hope the faa fines her for holding up the plane for over an hour..how many others passengers missed their connections.....just because she has a disability doesn't make her any more important then any other passenger. It seems like NO ONE today wants to follow rules...","commenter_a":"No one is mentioning the fact that they bought the child a seat in coach, and they were resting comfortably in first class. Essentially ignoring the child for the flight.","post_message":"The 3-year-old girl has a debilitating condition in which she is unable to move her arms and legs, or to hold her head up on her own, according to her mother who was holding her daughter on her lap when a flight attendant became \"visibly upset.\" @webpagelink"},{"comment_id":"10153880875017994","commenter_b":"Can't say officer I Didn't see it... Lol","commenter_a":"Sweet","post_message":"This is a pretty \"cool\" pic."}]
