[{"comment_id":"1133897243307426","commenter_b":"Matt AtkinsonJack Nicholls looks like im moving","commenter_a":"Luis Barillas this reminds me of donuts after work. Hahaha","post_message":"Not recommended for our home viewers.... @webpagelink"},{"comment_id":"829720727076952","commenter_b":"Where all snakes live","commenter_a":"The fall of Ramadi to ISIS demonstrate Obama's success.","post_message":"Must be a comfortable rock the White House is living under..."},{"comment_id":"10153584485708812","commenter_b":"So did Jesus preach love or condemnation??? I'm confused! Wait, actually YOU ARE CONFUSED! Don't buy the nonsense you are listening to on Sundays. Save your 10%, and search your soul for the truth! Ironic how the same people who follow Jesus (a man of love and forgiveness), are the ones who are most hateful and judgmental","commenter_a":"Wow... Let's see what's next... You give a little & then they want more. SMH","post_message":"South Carolina House approves bill removing Confederate flag from Statehouse grounds: @webpagelink"},{"comment_id":"1292895457407386","commenter_b":"FFFFFFFFFFFFFFFFFFFUUUUUUUUUUUUU UGLY BITCH","commenter_a":"Frau Kraut...... you have destroyed Germany ... so shut up.","post_message":"Why would Merkel think issuing Trump a not-so-thinly veiled warning, on the day after his amazing win, was a good move politically?"},{"comment_id":"1150560135003462","commenter_b":"Pathetic Kardashian whore.","commenter_a":"you go it right she is pathetic","post_message":"Caitlyn Jenner joined the festivities in Cleveland where she explained her reasons for being a Republican."},{"comment_id":"910779442445965","commenter_b":"YES THAT IS WHAT WE SPEAK. THE ILLEGALS CAN LEARN IF THEY HAVE A BRAIN OR FIGURE STUFF OUT FOR THEMSELVES. THEY CAME HERE NOW THEY CAN FOLLOW THE LAWS OR START Walking or swimming. either way learn or leave.","commenter_a":"Yes to english","post_message":"He wants to make this this official language of our country. People are up in arms. Do you think he's right?"},{"comment_id":"10153561162560530","commenter_b":"No, she hit him and kneed him in the balls","commenter_a":"Why didn't this show how he was shoving through the crowd and her up against the bar and that's why she got mad?","post_message":"Surveillance video from a Tallahassee, Florida bar shows Florida State University quarterback De'Andre Johnson and a woman engaging in a bar fight in June 2015. STORY: @webpagelink"}]
