[{"comment_id":"656793474487890","commenter_b":"Hillary the Felon says Trump is prejudice and she is just telling the same manipulative lies over and over. Mexicans do need to be properly vetted and screened because they are coming from a country knee deep in political corruption and organized crime. This lying fraud is trying to get her voters to think Trump is racist and prejudice but fails to acknowledge the gallons of red blood leaking into mexican streets because GOVERNMENT DISARMED ALL LAW ABIDING CITIZENS. It is NO QUESTION, Hillary wants Australian styled gun abolition, want proof? Ask and you will receive! She fails to acknowledge mexico is sending rapists and drug dealers en masse to deal much like Fidel sent his POW to Miami. There IS NO DOUBT this Felon is going to drag us into a civil war with her ideologies on government. Syrian and muslim refugees who have turned Germany into the brink ...","commenter_a":"#Trump2016 #HillaryForPrison #DNCLeak #DNCWalkout #CrookedHillary #ClintonCorruption #RiggedSystem Debbie Wasserman Schultz was the co-chair of Hillary's 2008 presidential run, where she lost the nomination to Obama. So, in order to lock down the nomination for 2016, Hillary would've had to put Schultz in charge of the DNC and manipulate it from within. In order for this corruption scheme to work, the Clintons would have needed first to, not only get the current DNC chair at the time to step down, but also get them to recommend Schultz for the position. A big request. And the Clintons would have likely needed to promise a powerful favor to that DNC chair, something more prestigious than being head of the Democratic party. So who was that person and what did they get in return? The previous chair of the DNC prior to Debbie Wasserman Schultz was... Tim Kaine. Let that sink in for a ...","post_message":""},{"comment_id":"10153464372430667","commenter_b":"Of COURSE you do, feminazi.","commenter_a":"Joe Biden didn't seem to give much credence to Anita Hill. Perhaps he could find a way to remove Clarence Thomas?","post_message":"Part of the pledge: To intervene in situations where consent has not or cannot be given."},{"comment_id":"10153130571029726","commenter_b":"Is that considered a rhetorical question? I think you know, and I'll add that all those girls need to be caged.","commenter_a":"Animals.","post_message":"VIDEO RAW footage of 4 teens viciously beating a girl in Brooklyn McDonald's as a crowd cheers them on. Why do parts of society cheer and take pleasure from this type of sheer brutality?"},{"comment_id":"1223203257706743","commenter_b":"But hey lets bring in refugees... and keep illegals... It is good for America according ot Liberals and Democrats","commenter_a":"I agree with them. Shame on Disney.","post_message":"23 former IT employees at Disney are preparing to fight back..."},{"comment_id":"10155894213345354","commenter_b":"Hillary is a cunt!","commenter_a":"Killary is the epitome of all the ills of this world rolled into 1 savage stinking carcass.","post_message":"Short memory!"},{"comment_id":"10153828870277217","commenter_b":"why don't you to go suck his tits, they're probably bigger than yours. lighten up.","commenter_a":"why does he have his tits out? I'm offended, he's breast feeding in public.","post_message":"Syrian rebels say the city of Aleppo was attacked by government forces using chlorine gas. Warning: video contains disturbing images."},{"comment_id":"1139700699375519","commenter_b":"Stop All Muslims. Send them back where they came from.","commenter_a":"Wrong not here","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"}]
