[{"comment_id":"10153167764854714","commenter_b":"Well,please make sure neither of you go out in a bikini then.","commenter_a":"Empowering her to be a porn star. Tacky tacky tacky","post_message":"Model Hannah Davis says her Sports Illustrated Swimsuit Issue cover is “empowering.” What do you think? @webpagelink"},{"comment_id":"587852428063303","commenter_b":"@username WOMEN ARE THE FIRST TEACHERS OF MEN","commenter_a":"Amusing that Trump is too dim-witted to debate real issues affecting our country. Hahaha Republicans! Ready for Hillary 2016!","post_message":"Trump thinks attacking Hillary's marriage will save him. He'll soon find out how wrong he is."},{"comment_id":"1088236524530691","commenter_b":"Humans are a parasite on this planet, we are unable to live in balance it's time for another extinction.","commenter_a":"It prob all happened because of climate change","post_message":"New evidence suggests there have been 6 mass-extinctions since life began."},{"comment_id":"1073645179326169","commenter_b":"^^^boom^^^","commenter_a":"Christian's don't commit Adultery Hypocrites Do God is Revealing what is done in the Dark. Nothing is hidden from God","post_message":"DEVELOPING: Possibly Millions More Christians Have Committed Adultery Using Ashley Madison Than Previously Thought. #FallingAway #AshleyMadison"},{"comment_id":"1057199377724507","commenter_b":"Sensing feminists being triggered","commenter_a":"What u gone do now @username??? Does Hillary still own y'all? Who y'all gone brain wash now ??? The swamp has been drained it's time for the real Americans to take back this united States we the people are apathetically sick of corruption!!!!","post_message":"Many people did not believe Donald J. Trump could win the election @webpagelink"},{"comment_id":"10153212063865950","commenter_b":"U go girl.....GIRL POWER....kick that pussy ass thieves ass","commenter_a":"Wow. Go serena","post_message":"When Serena Williams saw a thief snatch her phone at a restaurant, she took matters into her own hands. Without thinking, she jumped up, leaped over a chair or two and chased the suspect down. She was on him in a flash."},{"comment_id":"960647347306835","commenter_b":"I can't find what I'm looking for now.","commenter_a":"I try not to think of them at all...","post_message":"What do you think of these massive new changes coming to your local Target store?"}]
