[{"comment_id":"10153366308391336","commenter_b":"Ewww! What a scanky hoe!","commenter_a":"I bet they didn't even use condoms... - Don't they care about STD's on DEATH ROW or in Maximum Security?","post_message":"Shepard Smith reported that Joyce Mitchell, the prison worker accused of helping two convicted murders escape from Clinton Correctional Facility, reportedly had sexual relationships with both killers."},{"comment_id":"10153149843920090","commenter_b":"NOT this woman ;)","commenter_a":"too bad all the women will vote for her, for no reason other than shes a woman, like the minorities voted for Obama...with no reason other than he is black","post_message":"Share this with your friends & neighbors—take the pledge to Stop Hillary! Start here: @webpagelink"},{"comment_id":"10154312293629330","commenter_b":"She's a lying murderer","commenter_a":"God help us if he wins!","post_message":"Donald Trump has been officially nominated as the Republican candidate for president at the GOP convention in Cleveland ---> @webpagelink"},{"comment_id":"10153491983334087","commenter_b":"Look , she the cuase of all wars in Middle East , Voted for war in Irag ,war in Libya, war in Syria. She removed notorious terrorist group AKA \" MOJAHIDEEN \" out of terrorist list , so they can go to Syria . She is Republican","commenter_a":"Elizabeth Warren Sinks Clinton's Hopes for Endorsement @webpagelink","post_message":"“The difference between [Hillary Clinton] and Sanders is that she didn’t wait until the campaign to champion gun violence prevention,” said Dan Gross, president of the Brady Campaign to Prevent Gun Violence, which is endorsing Clinton in the presidential race."},{"comment_id":"10158061833465354","commenter_b":"White bitch bahaha!","commenter_a":"Samantha Bee can blow her fuckin brains out for all I care. Lamestream shill. Stop feeding her.","post_message":"Dear Democrats, Please, PLEASE keep up your trashing of the 60,000,000 Deplorables who elected President-Elect Donald Trump. With every smug, arrogant, elitist, hyperbolic swipe you take, you further confirm why We the People rejected you in the first place. So please, keep it up! Sincerely, The Deplorables"},{"comment_id":"1705288253066676","commenter_b":"@username Building a wall is doable? Finding and deporting millions of illegals is doable? Banning Muslims is doable? Explain how","commenter_a":"So good looks qualify you to be VP of the USA? More reason to be afraid for our country. In addition to being racist and ignorant, this guy is shallow and beyond stupid (although we knew about the stupid part before)","post_message":"\"She’s got the beautiful looks,\" Eric Trump said. \"She's got — she’s smart. She's smart smart smart smart. ... She’s certainly got my vote.\""},{"comment_id":"457639131093334","commenter_b":"Fuck her","commenter_a":"She doesn't even have the power to shut down a lemonade stand.","post_message":"Will You Cave To Michelle And Only Eat Where She Wants? Comment 'yes' or 'no'."}]
