[{"comment_id":"962643217106352","commenter_b":"all i can say is zombies! now we have to worry about zombies crossing the border, thanks south America.","commenter_a":"Freaky.","post_message":"A family in Honduras that claimed teen was screaming from inside her coffin have made international headlines with their actions."},{"comment_id":"10155380353783797","commenter_b":"Smh Freaking Nazis","commenter_a":"KevinNajera","post_message":"HOLOCAUST REMEMBRANCE DAY: Today marks the liberation of the Auschwitz Nazi death camp on January 27, 1945. Take a moment to remember the millions killed. bit.ly/2k1HfMq"},{"comment_id":"1279026295523755","commenter_b":"Translation: \"such a nasty woman\"/\"Bitch\"","commenter_a":"I just have to laugh about this because he represents himself so horribly and it just scores points for Hillary. She is tough and takes it like a woman because women are strong and tough!","post_message":"Absolutely deplorable."},{"comment_id":"1707955089264613","commenter_b":"We have an American president now-thank god","commenter_a":"I wonder how quick INS would offer a job to an immigrant that came to this country LEGALLY? I'll be more than happy to deport the illegals.","post_message":"Entitled Immigrants Protesting Trump Are PISSED After They Just Got NASTY Surprise When They Showed Up To Work Today!"},{"comment_id":"10153259731496615","commenter_b":"They are grown women they knew exactly what they were doing","commenter_a":"Stop calling these Ppl victims they knew what they were doing everyone knows Cosby is married what type of woman will got to a hotel room for drinks with a married man they had their own agenda miss me with that victim bs","post_message":"BREAKING: Bill Cosby has been charged with sexually assaulting a woman in Pennsylvania more than a decade ago. @webpagelink"},{"comment_id":"10153157541959641","commenter_b":"Yes Dilma get the hell out!","commenter_a":"protests? you can't never even think about it ! if you join to a manifestation group you can get killed or lose your job if you be an influent person , you can get bribed and many people are shut because of these reasons this is the message that we've been received from our fathers the message has been transmitted from generations to generations a message of fear were the law is to rule the poor .","post_message":"Hundreds of thousands marched in Sao Paulo, Brazil, with one message for President Dilma Rousseff: Get out. cnn.it/1ynM33B"},{"comment_id":"10156623129805389","commenter_b":"He wrote an entire book about it. Would you like copy?","commenter_a":"Great. How? How exactly is he going to create jobs? This guy just says he's going to make things great without details. He is making hollow promises. You know who else did that? Obama. He did the same thing. Actually, he did it without insulting people and sounding like the middle linebacker of a high school running for class president on the platform of beating up nerds and gym class all day long.","post_message":"“I am going to be the greatest jobs president that God ever created.” WATCH the highlights from Donald J. Trump’s New Hampshire primary victory speech. #Hannity"}]
