[{"comment_id":"10152699029652377","commenter_b":"Idiot comment of the day","commenter_a":"Top reason. He is not Obama!","post_message":"Marco Rubio for President 2016?"},{"comment_id":"671493889666053","commenter_b":"doesn't she have a criminal record??","commenter_a":"What a moron. She's been convicted of shoplifting, and has been on welfare. Everything that comes out of her mouth is a real stretch of the truth, to put it kindly. Another one who wouldn't know the truth if it bit her on the ass.","post_message":"Oy this woman makes my eye twitch. ~tiff"},{"comment_id":"1702706209988180","commenter_b":"Stupid Question! Why should illegals be allowed to vote here? Do we vote in their country??????? NO!!!!!!","commenter_a":"YES","post_message":""},{"comment_id":"10154161281331636","commenter_b":"But if you are in line at the time of closing they have to stay open to allow you to vote. This orange plague on our Country needs to GO!","commenter_a":"Seriously he doesn't like democracy you elect him you'll have a dictator who you will have to overthrow","post_message":"BREAKING"},{"comment_id":"1337467809657543","commenter_b":"Actually...now.women will do time for....oh what's that word.... MURDER! Hahahahhahahaha","commenter_a":"Abortion happens. Now if it happens in a sterile clinic with a doctor or in a back alley with a coat hanger, it's still going to happen.","post_message":"The so-called \"heartbeat bill\" approved Tuesday would result in what would be one of the most stringent abortion restrictions in America."},{"comment_id":"10153097012535329","commenter_b":"Lauren Youssef","commenter_a":"Lily, Marielle we need this!","post_message":"BuzzFeed Life can confirm that these delightful Oreos are VERY REAL AND VERY GOOD."},{"comment_id":"540816769423579","commenter_b":"Don't run 3rd party now. We would get blamed for a Hillary victory. There may not be much a republican party left in 2020, so that would be the time to start a new party.","commenter_a":"I think we should run a third party candidate now!","post_message":"Should conservatives start a third party? Should they begin one now and put it in place for 2020 or Should they run a candidate now? How would they not be blamed for a Hillary Win? Do you have the stomach for bloody politics to drive the final stake in the heart of Mitch McConnell's corrupt GOP? I have an opinion. I may surprise you. I want to hear Yours. Let's keep the name calling to a minimum let's have an actual debate based on Reason?"}]
