[{"comment_id":"1242854355764972","commenter_b":"WHO THE F^CK ARE YOU ANYWAYS GO LEAVE NOW MAKE AMERICA GREAT BY ALL YOU BUTT F^CKING TRAITORS LEAVE","commenter_a":"good by trash","post_message":"Looks like we're going to need a second Trump Train...one that takes all these people south of the border..."},{"comment_id":"678568942333684","commenter_b":"Muslims do like goats.","commenter_a":"Surely the king has more class than to let Hillary sit on his face !","post_message":"Hillary Clinton was just caught doing absolutely sickening with the Saudi King. She is not to be trusted. This is filthy. Do you think Hillary Clinton would make a terrible president?"},{"comment_id":"615120388649797","commenter_b":"I don't think it should be considered treason, I think it IS treason. How do you Snopes check this? And where is the link to the Washington Post article?","commenter_a":"Guys we have no choice. They are so advanced we have no choice","post_message":"This should be considered treason."},{"comment_id":"482704838584476","commenter_b":"Yea just can't fix stupid... While Obama tries to shove his deal down Americas throat - Iran is laughing at us, buying weapons and building bombs - Better war with them today than tomorrow - Iran has no purpose, no value - Just make it a dust bowl.","commenter_a":"Nuke China & Iran!","post_message":"So, please Obama explain us, how this deal prevent war?"},{"comment_id":"10153161330059270","commenter_b":"Women shouldn't be allowed in the special forces. Period","commenter_a":"No surprise.","post_message":"No women pass Army Ranger School."},{"comment_id":"10152863339776491","commenter_b":"Just think all the traffic that's been through her!! Her germs have germs!!","commenter_a":"Can you imagine being the one that has to kiss those lips? Ugh. I mean uuuugggghh!","post_message":"\"Every time I say something that’s extremely truthful out loud, it literally breaks the Internet.\""},{"comment_id":"1539781299650210","commenter_b":"Trump will CRUSH Hillary!!","commenter_a":"if you know Hillary will lose against Trump click like","post_message":"Wendy Long: Trump's 'America First' Platform Will Grow GOP Nationwide."}]
