[{"comment_id":"1062576617115128","commenter_b":"I think if Americans knew the reason and how our fresh produce(picked by illegal and legal migrants) become contaminated with ecoli and other harmful filth- we would all choose trained Americans to harvest our FOOD. People pay more for organic produce, unsoiled produce is just as valuable.","commenter_a":"The farmers did it to themselves. They gave those jobs, back in the 60s, to illegals who worked for cents on the dollar - and American families were shoved out of the industry. Don't say there aren't people out there who won't do the work. There WERE people out there doing the work - and they threw them away. Let's FIRST - get rid of them ALL - and give it a year to play out to see where we actually NEED work visas. If american companies (and farmers) can show that they diligently TRIED to hire Americans and could not get the skill or number of people they needed - FINE, then they can apply to bring people in on VISAs.","post_message":"THE #1 ISSUE FACING AMERICA Recently, I joined Dr. Carson to discuss immigration. We met for 90-minutes. I shared my experiences, opinions, concerns, and solutions with him. Topics ranged from border security, terrorism, drug and human trafficking, the impact on jobs, wages, welfare, education, culture, and healthcare. HIGHLIGHTS OF WHAT I SHARED: 1. Last year, after announcing I’d explore running for president myself, Megyn Kelly asked why I wanted to be president? I replied, “I hold the sort of conservative values which America needs today. And in the same way Reagan kept his word by bringing home the hostages, I promise to secure the border and solve the immigration problem. I went on to say I'd protect the American people, their lives, their jobs, their health, and their children in the same manner I protect my own. I told her audience I was in love with America. Later that night ..."},{"comment_id":"612057282315211","commenter_b":"God she's an idiot lmao can't fix a fake blond moment","commenter_a":"This girl has a show? It is cheaper to produce this than real news that impacts people's lives. A little girl with a big mouth is our national dialogue? Cheap.","post_message":"Trevor Noah's performance was a thoughtful invasion, a methodical exploration behind enemy lines."},{"comment_id":"10153478854858188","commenter_b":"I see he didn't answer the second question. First answer was also rediculous since he has given all our prisoners from guantanamo away","commenter_a":"Glad he was put in his place.","post_message":"Wow."},{"comment_id":"10154467163611051","commenter_b":"Madonna this is a women who invaded her on body with a cross,scum is all i can say ,yes she should be in jail","commenter_a":"trump does not have moral privilege to call anyone an ugly name, since he owns every ugly name one can muster to describe his repugnant behavior. Madonna does not come close to the names lying trump has called President Obama. Madonna \"tells it like it is\" and that is too much for Right wing nut bags.","post_message":"Donald Trump says he has only one word to describe Madonna."},{"comment_id":"469071613283419","commenter_b":"she b a back stabber","commenter_a":"She fits in with Sharpton an Jackson","post_message":"Oprah releases shockingly racist statement that is causing a lot of controversy. She's the biggest racist we know, and we won't stand for it. Do you agree Oprah is racist?"},{"comment_id":"1202111446538878","commenter_b":"Ain't none OF these HOES VIRGINS!! EVERY GIRL BEEN WITH SOMEONE BEFORE YOU GOT IT . THIS DAY AND AGE..","commenter_a":"Everybody saying he having diddys seconds are dumb by that logic every girl you've been with is technically seconds sometimes more than seconds 😭😭😭😭 might be hundreds","post_message":"Damn! #WSHH"},{"comment_id":"2471637393058961","commenter_b":"@username still better than that lying bitch you voted for","commenter_a":"Why do you guys keep asking the same stupid question...I guarantee you no one on the right has changed their minds...now maybe some on the left came to their senses","post_message":"Would you like to see this duo in the White House again?"}]
