[{"comment_id":"1820350008207308","commenter_b":"She will sell us out to the highest Middle Eastern bidder","commenter_a":"GIVE US A LIKE! -----> @username your TRUSTED Conservative News","post_message":"TRUMP LIVE! Donald J. Trump Rally in Sioux City, IA Like us for TRUSTED conservative news---> Freedom Daily"},{"comment_id":"10153853522001336","commenter_b":"Your Governor says yes to more refugees.","commenter_a":"I just found out that approximately 130 Syria refugees are here in PA .","post_message":"“What I want is a watch list. I want surveillance programs. Obviously there are a lot of problems. I want a database for the Syrian refugees that Obama’s gonna let in.” Donald J. Trump went “On the Record’ to clarify his recent comments, emphasizing that he wants to keep track of the Syrian refugees entering the United States, not all U.S. Muslims. @webpagelink"},{"comment_id":"10152674104515667","commenter_b":"Leave her alone!","commenter_a":"She's not bald, she just had her hair pulled back. But even if she was bald she still looks beautiful.","post_message":"ICYMI: Michelle Obama looked a bit different on Wednesday's episode of \"Jeopardy!\""},{"comment_id":"10154517046780329","commenter_b":"Not bad, but these sudden death quizzes are pretty f***ing unpopular. I would have hoped y'all would have gotten the point.","commenter_a":"Mike Snee","post_message":"There are 20 questions, but as soon as you get one wrong, you LOSE. (via BuzzFeed Quiz)"},{"comment_id":"957334017635027","commenter_b":"He actually was not shackled. Its amazing how many people read cop blocks statement and dont even watch video or just flat out imagine what your seeing all because cop block intentionally manipulated you.","commenter_a":"Look, whatever the guy was arrested for, it doesn't make it right for that cop to beat on him. Even with the guy getting in the cops face and yelling. It doesn't make it right. The fucking guy is shackled. Cops aren't gods! They have no right to pass judgment and treat you like an animal.","post_message":"POLICE BRUTALITY caught on video! Is anyone REALLY going to try to justify this? From (Y) Counter Current News - MBD"},{"comment_id":"10153560622578984","commenter_b":"Gotta get around it some how. And drugs is my number 2 family problem, I HATE DRUGS!","commenter_a":"I do support this family, the only thing is I think all bakers and places that sell Wedding cakes need to go out of business or stop baking cakes, stick with pastries.","post_message":"The government is after this family for refusing to bake a cake for a lesbian couple's wedding. The way they just responded is absolutely perfect... Do you support this family?"},{"comment_id":"10153644073950861","commenter_b":"They can get married with benefits now. What the hell else do they want?","commenter_a":"The Florda man is at it again","post_message":"The display, based on the holiday depicted in \"Seinfeld\", will be 6-feet tall, wrapped in the colors of the gay pride rainbow flag and topped with a disco ball."}]
