[{"comment_id":"10154305889759312","commenter_b":"Walmart doesn't pay a \"living wage\" either. They can't go get a job at Kmart.","commenter_a":"There are a lot of businesses that do this, why only go after jimmy johns? It's not \"unfair\". What are e in 2nd grade? If you work at Pepsi, you can't work at Coke.","post_message":"The state of Illinois says a practice at Jimmy John's is \"unfair to Illinois workers and bad for Illinois businesses. Do you agree?"},{"comment_id":"1195653430467095","commenter_b":"This woman is trash","commenter_a":"You suck, big time.","post_message":"***FIRESTORM***"},{"comment_id":"737426566424213","commenter_b":"Good Lord, this woman doesn't have a clue.","commenter_a":"Michelle Marjan","post_message":"Betsy DeVos, Trump nominee for Secretary of Education, is remarkably unqualified for the job. Full video: @webpagelink"},{"comment_id":"10155219757361159","commenter_b":"They should be deported and he should be in prison.","commenter_a":"So............your entire family is full of criminals and you're going on television to identify them right before we finally start enforcing the immigration laws in this country? Definitely stupid enough to be a Democrat.","post_message":"\"They got a false Social Security card, they got a false identification, they got a false driver license prior to us passing AB 60, they got a false green card, he admitted."},{"comment_id":"10153722777028822","commenter_b":"if that female can do it and make it big go for it i would like to see it","commenter_a":"Its bound to happen because they are plentiful and killing it in the minors and its just a matter of time before one breaks into the big leagues. Smh...","post_message":"What do you think? Do you agree with Pittsburgh Pirates manager Clint Hurdle?"},{"comment_id":"539015142953445","commenter_b":"Scum of the earth all of them! !!","commenter_a":"But they're a Religion of Peace!","post_message":"These guys are SCUM!!!"},{"comment_id":"10152817676244877","commenter_b":"Wonderful woman","commenter_a":"RIP Queen of Gospel Music.","post_message":"ON THIS DAY IN HISTORY: On January 27 1972, The Queen of Gospel, Mahalia Jackson passed away at age 60. She became one of the most influential gospel singers in the world and was heralded internationally as a singer and civil rights activist. LIKE and SHARE to remember the Queen of Gospel!! >>@webpagelink"}]
