[{"comment_id":"10153899615080329","commenter_b":"They can go f****** themselves. Ur beautiful.","commenter_a":"I'm not Latino but I'm half Black and half American Indian and I've felt and been told I wasn't enough of either.","post_message":"Spoiler: You're perfect."},{"comment_id":"1151612978215863","commenter_b":"Nah, Katie. You want to talk about the real world?? Hillary Clinton is the candidate of the \"real world,\" where people DO suffer, most certainly. They are primarily people of color. They are Arabs and Persians living under constant threat of US drones. They are black youth who have been dubbed super-predators by Hillary, who have been beaten and bloodied by the police that she helped arm, and that she helped expand. They are Hondurans and Egyptians and Libyans who have been subjugated by the regimes in their countries, regimes that only exist because we can't seem to keep our fingers out of everyone else's pie. Neoliberal policy has caused more suffering in this world than even Trump promises to bring. Secondly, voting in line with ones genuine ideology is not reprehensible in the slightest. If everyone understood that, maybe we wouldn't be stuck in the two-party, lesser-of-two-evils rut that ...","commenter_a":"Lmao, fat chance on that one. His endorsement solidifies that he has been enveloped into the Democratic Party, where social movements go to die. His most ideologically loyal supporters will be voting for #JillStein, because #NeverHillary , and #NeverTrump","post_message":"Most of the #FeelTheBerners who now say they’ll go third party would otherwise be backing Clinton."},{"comment_id":"10155469522230354","commenter_b":"Where do these idiots come from on the left, try to bring in women to compete with fox and there is nothing between the ears.","commenter_a":"Those tampon dangles must have penetrated her brain.","post_message":"Believe it or not, it actually gets worse..."},{"comment_id":"10152855879679753","commenter_b":"Bitch! F*cking bitch.","commenter_a":"My heart breaks for what that poor boy must have gone through.... how anyone can harm a child I'll never understand. I agree with others here. The parents knew he was being beaten. Something should have been done sooner.","post_message":"This woman did something horrifying to her 3-year-old nephew, all because he was having difficulty with a spelling lesson."},{"comment_id":"722398331226681","commenter_b":"Miley Cyrus is so gross. She's going to be a washed up disgusting old lady if she makes it that far.","commenter_a":"Who would believe anything that raunchy ugly thing says anyway ?","post_message":"Class act, that Cyrus!"},{"comment_id":"10153150963247483","commenter_b":"I am totally convinced that libs are the only people that post comments on AL.com. Must be a lib ran organization. Oh I forgot, its part of the media!","commenter_a":"Assholes","post_message":"\"In my judgement, with respect to Hillary Clinton, she will be a unique president if she is elected by the public next November, because the day she's sworn in is the day that she's subject to impeachment because she has committed high crimes and misdemeanors,\" Congressman Mo Brooks"},{"comment_id":"1416682211693618","commenter_b":"Ya we we'll come u 2 da seat Hillary","commenter_a":"She is a wonderful woman, read this to get the proof @webpagelink","post_message":"A reminder heading into tonight's debate."}]
