[{"comment_id":"10153736965291336","commenter_b":"She dosen't know what she's talking about .Shout up !!","commenter_a":"Think she's irrelevant at this point","post_message":"\"Every single Republican candidate for president is against marriage equality. Every one of them. Many of them are against anti-discrimination laws. Many are against same sex couples adopting.” – Hillary Clinton"},{"comment_id":"10153757618426336","commenter_b":"You're a complete @$$hole !","commenter_a":"Hey Campus Employee where are you going to? I'm going to Disneyworld (Suckers!!!)","post_message":"Kathryn Thompson, who works the night shift at an on-campus coffee shop, has always dreamed of taking her autistic grandson to Walt Disney World."},{"comment_id":"10152632178256813","commenter_b":"Shut up Statist. No one deserves jail because of an unpaid weed ticket. Jail should only be for Killers, Rapists, and Burglars. Is that too much to ask?","commenter_a":"I see, so break the law, claim you're poor, and get away with breaking the law. Talk about \"privilege\". :/ Being poor is NOT a \"justification\" for not taking responsibility for one's own acts. No more than being rich is a \"justification\" for not being responsible for one's own acts. It's interesting how people complain that the rich aren't being held responsible for committing violations of the law, then claiming that the poor should NOT be held responsible. Rich person doesn't pay their taxes, they belong in jail. Poor person doesn't pay for legal fines and fees, they should just be entirely excused for breaking the law. Interesting.","post_message":"Kevin Thompson was jailed for five days because he couldn't afford to pay fines and fees from a traffic ticket. Last week, we reached a settlement that promises to prevent others from being improperly jailed for being poor in DeKalb County. @webpagelink"},{"comment_id":"10153571133258132","commenter_b":"Shut up Tina","commenter_a":"Regardless of what this family would've, could've, should've said...90% of you made your judgement the second you heard \"the news\". Until it happens in our own family, none of us have the right to judge. Just as I don't have the right to judge all of you with your incredibly hateful comments. So I won't.","post_message":" watched him like all the time. I took him to work with me. We just poured our life into him.\""},{"comment_id":"1057489254266735","commenter_b":"Deport all illegals ..............","commenter_a":"The funny thing is that it's NOT about amnesty. It's about getting control of a situation that's currently OUT of control. If we don't move forward with the current plan, than what? Yes folks we are not in the same situation, but a much worse one. SIMPLE! Think about it, they are already currently living here and paying NO taxes. Unless we can beam these people up bye my calculations, YEP, there still here. Let's look back at what was actually said, the President NEVER said he was going to legalize any body's current status, just give them a chance to apply while working on there current status. Is it such a bad idea to have these people come out of the dark?","post_message":"I've been telling people for I don't know how many years, you know it as well as I do that's what this is all about. But no Democrat's ever admitted it."},{"comment_id":"10152945596811336","commenter_b":"most schools require children to be up to date on vaccines - if you want to enroll kids in school it has to be done. But it does need to be a parent's decision- there might be extenuating circumstances where they chose not to.","commenter_a":"When commenting on a liberals post, check your grammar and punctuation carefully because that's the only comeback they've got.","post_message":"Sen. Rand Paul got a booster shot just a day after he injected himself into the national vaccine debate: @webpagelink"},{"comment_id":"10153826114722994","commenter_b":"What about them lying women. Who spred there legs to get bill money. I still respect bill. I still watch he's show.. get on the man who allowed them underage girls to come into that mansion..","commenter_a":"If the press and police will get over their prejudice and look at white males the way to they do black males as suspects, it would be a lot of white children alive today! \" They deserve a voice too! It's no coincidence, that these types of crimes don't get the scrutiny, they deserve. This is why child kidnappings, molesters, underground child porn rings, Internet pedophiles, thrive in suburbia, because they're white. R.I.P! Little one, the press will catch on sooner or later. The way I feel about inner city children dying by bullets in Detroit, is the same way I feel about suburban children dying at the hands of a kidnapper. They all deserve to live.....","post_message":"11-year-old Jacob Wetterling vanished in October 1989 while riding his bike. Almost 26 years to the day, police in Minnesota say they have a person of interest - and it was someone they looked at just days after he disappeared."}]
