[{"comment_id":"1748878815344677","commenter_b":"1150623618341674Harshit @username","commenter_a":"Matteo Rinalducci","post_message":"They Grow Up So Fast."},{"comment_id":"527521687455792","commenter_b":"Don't give her anything free ,I bet she would loose some weight then maybe she will like what she sees,maybe if she was real hungry she would find a job,how about stopping everyone's welfare look what a cost saving that would be and it would help our United States we wouldn't have to feed a bunch of free loaders .","commenter_a":"Oink, Oink !!","post_message":"I couldn be more disgusted by what she saying"},{"comment_id":"10153438388656336","commenter_b":"Adam you dysfunction perverted twist ! This is america and illegal alien will be deported soon or later ! With traitors !!!","commenter_a":"Just listen to the Donald😆","post_message":"ICE said the tragedy could have been prevented if they had been notified of the suspect's release."},{"comment_id":"10154228299244218","commenter_b":"FYI this was NOT over drugs!","commenter_a":"clean up cecil county get drugs out the killed will stop . can,not count all the kids pasway in 20 year I live in cecil county iam way ingfor a call my son rusty is died I love rusty but he love his drugs","post_message":"Two people were killed in a shooting Monday night in Elkton, police said. @webpagelink"},{"comment_id":"10152866488206336","commenter_b":"that IS child endangerment..someone needs to be locked up--along with the snake........","commenter_a":"Some are just nuts","post_message":"This video footage of a 14-month-old girl playing with the family pet might make you a little nervous."},{"comment_id":"10153374833224497","commenter_b":"I miss that trashy bitch.","commenter_a":"whatever happened to amber richardson?","post_message":"\"I had some great drugs in my day, but seeing my baby for the first time? I wouldn trade that for all the ecstasy in the world.\""},{"comment_id":"10153177294431336","commenter_b":"How can a female win the MENS race? Read much?","commenter_a":"That's a female???","post_message":"JUST IN: Lelisa Desisa has won the men's race at The Boston Marathon in an unofficial time of 2 hours, 9 minutes, 17 seconds. It's the second victory for the Ethiopian, who won the marathon in 2013 just hours before the attacks. @webpagelink"}]
