[{"comment_id":"1666754860284644","commenter_b":"As a veteran educator with 31 years experience, I am appalled by Betsy DeVos's level of complete and utter incompetence. As a parent of a special needs child, I am alarmed and sickened at her flippant discard of imperative federal laws that protect those that cannot protect themselves. Shame on you, Donald Trump, for promoting her, and shame on you, Betsy DeVos, for accepting a position for which you have zero aptitude.","commenter_a":"Once again Senator Kaine, your questioning along with others brought out that she has NO clue. Our children cannot afford to have this kind of management over their education. Scary!!","post_message":"I worry about the effects of a leader who thinks 'government sucks' on the morale of teachers. Disappointed Betsy DeVos does not support equal accountability and IDEA for all schools getting tax dollars."},{"comment_id":"10153552801752464","commenter_b":"@username>>>>I like and agree with your post about \"freedom of press\", but I also agree with what Mark posted about \"mainstream media\". The truth is Soros owns most of the news media and everyone , including the media, is getting \"paid off these days. I am even starting to believe that our SCOTUS is getting paid for their votes from what I have been seeing lately. After saying all that, what you say is true that people can pick and choose; but we live in a day of uninterested, uninformed, misinformed people who only go with what they hear the most, whether it is factual or not. Do you ever watch \"Watters World\" on the Bill O'Reilly show, \"The Factor\". It is so discouraging to see people of voting age, especially college kids, who are so uninformed, just dumb about history and politics. Maybe you can find it on YouTube ...","commenter_a":"I'm for @username. Donald Trump has nothing on Cruz, but Cruz has on Trump. Cruz is an honest, God fearing man who has been standing up AGAINST Washington ( Washington Cartel is what Ted calls them) ever since he has been a senator. He has fought against democrats AND republicans FOR the choices of the American people. HE never cowered or gave in to Obama's wishes even though he has been falsely accused and criticized for being against Obama policies that Mitch McConnel and John Boehner gave into.","post_message":"An honor to join thousands of courageous conservatives in South Carolina yesterday who agree now is a time to lead and #DefundPlannedParenthood: @webpagelink"},{"comment_id":"10155284282375294","commenter_b":"Lets bathe her in lice then fill a bag with mayo and drownd her in it","commenter_a":"@username wow ppl are stupid","post_message":"A tragic ending after a family attempted to use a home remedy to treat an 18-month-old girl with lice."},{"comment_id":"10153648380297293","commenter_b":"so that justifies a breach in privacy, Richard?","commenter_a":"Why keep nude images of yourself either on your device or your email inbox especially when you're a person of public interest. Stupidity warrants punishment.","post_message":"Jennifer Lawrence, Kate Upton, and Lea Michele were among the celebrities whose photos were said to be in the Celebgate dump."},{"comment_id":"10152700445176051","commenter_b":"Another snobby bitch","commenter_a":"You guys are all assholes siding with the trailer woman... There goes the neighborhood ... These answers talk about what has happened to the country... If you want to live in a trashy neighborhood, move to one. Don't trash up the one you are in due to your own selfishness...","post_message":"When this woman saw a note one of her neighbors left for her, she couldn’t believe it."},{"comment_id":"1008697665856648","commenter_b":"Deport them now ,let them go to enjoy Saudi Arabia!","commenter_a":"GOOD the muslims have NO right to tell others what to do and what not to do and no one has any right to attack anyone over an imagined religious superitory","post_message":"In protest, hundreds are posting photos of themselves wearing swimsuits in public places"},{"comment_id":"10154185747461717","commenter_b":"@username why don't you grow the f****** up","commenter_a":"So tired of women using their children as excuse for staying in a abusive relationship. Now that she did nothing, she will be in jail and loose her son.","post_message":"Her uncle said that Noor Salman was physically and mentally abused by Mateen and that she stayed with him for fear of losing custody of their son."}]
