[{"comment_id":"575985222606198","commenter_b":"Yes","commenter_a":"More money to waist.","post_message":"Do you support a lottery in Alabama?"},{"comment_id":"704293576413843","commenter_b":"Can't wait to be done with the racist goat humper","commenter_a":"Yay for Trump!!! Bye bye Obama!","post_message":"LIVE VOTE: With Trump taking office, are you grieving or cheering? Let us know why in the comments and see what others think. Join us for continuing coverage as President-elect Donald Trump prepares to take office, straight ahead on The Four!"},{"comment_id":"2159179167640729","commenter_b":"Shut up you liberal ugly lying witch that THINKS she's as beautiful as Melania Trump (secretly jealous of her) get off the tv cause no one wants to look at or listen to you skank!","commenter_a":"Boo👀jk😊","post_message":"\"I feel like it was an attempted bullying.\""},{"comment_id":"492953910886489","commenter_b":"I don't feel sorry for her. She had the right to marry four times. Fuck that bitch hope they fine her into poverty and hope she gets her ass tossed by a big butch inmate","commenter_a":"just give her a different job already","post_message":"Are you angry at the anti-gay clerk? Us too. But we also pity her."},{"comment_id":"10152872089786135","commenter_b":"Nations aren't doing too well and filled with hate, before this law was passed.","commenter_a":"We all know what God does to nations that disobey His word and goes rampant","post_message":"BREAKING: U.S. Supreme Court requires states to recognize marriage between two people of the same sex. LIVE UPDATES: @webpagelink"},{"comment_id":"672451282894291","commenter_b":"@username The trump wall is ! I want mexico to build it ! If you arent part of the solution you are the problem .","commenter_a":"When a unstopable force meets a unimpregranable wall It is time to vote for Trump ! Hope I spelled that right libs and spell check police !","post_message":"Donald J. Trump said he didn't call Ted Cruz 'Lyin' Ted' in his New York victory speech because \"I thought it would be very undignified for me to get up at that particular moment with ... pretty much the world watching.\""},{"comment_id":"900773723315710","commenter_b":"And how is this news? Last time I checked, Mail was supposed to be a page for news.","commenter_a":"just kill them all anyway","post_message":"In these exclusive pictures, she goofs around like a typical London schoolgirl. Here we reveal what poisoned the mind of the 15-year-old who's run off to join ISIS."}]
