[{"comment_id":"402875396503722","commenter_b":"silly sarah sure is a pompus bitch","commenter_a":"Rather look at her vs Billary! What a pompous bitch!","post_message":"Sarah Palin had some strong views on Hillary Clinton's email accounts. Is this as big an issue as she claims?"},{"comment_id":"1756054801276415","commenter_b":"Though what border did the Muslims come ?","commenter_a":"Don't mess with Texas!","post_message":"BREAKING: Texas Lt. Governor Announces That Texas Has Finally Shut Down The Border. It's about time. With or without a wall, we will protect our country. Do you think we need to close our borders to Mexico?"},{"comment_id":"10152945596811336","commenter_b":"most schools require children to be up to date on vaccines - if you want to enroll kids in school it has to be done. But it does need to be a parent's decision- there might be extenuating circumstances where they chose not to.","commenter_a":"When commenting on a liberals post, check your grammar and punctuation carefully because that's the only comeback they've got.","post_message":"Sen. Rand Paul got a booster shot just a day after he injected himself into the national vaccine debate: @webpagelink"},{"comment_id":"1104371989582553","commenter_b":"Don't kiss any bugs, Suzanne--even if they swear they'll turn into a handsome prince. Only frogs for that.","commenter_a":"Thanks for that. I'll be obsessing on this for weeks now.","post_message":"“Kissing bugs” may sound sweet, but they have infected at least 12 people in Texas with a parasite that causes a deadly disease. >>kiro.tv/KissingBug"},{"comment_id":"676882525784251","commenter_b":"STOP IT !","commenter_a":"When did this actually happen? Yikes...............","post_message":"An oil spill the size of Manhattan is devastating the Gulf of Mexico, and nobody's talking about it. #MicBrights"},{"comment_id":"10154007566964091","commenter_b":"Sick women..","commenter_a":"Something is really wrong with this world.","post_message":"The mom claims she and her daughter \"hit it off.\" She lost custody of her children when they were young, and had only recently reconnected with her."},{"comment_id":"10153401840176336","commenter_b":"idiot and she if she would have fell and killed herself, her family would be suing. Stupidity NEVER ends.","commenter_a":"To me the flag symbolizes opposing the fed. I think that unites me with a lot of those flying the flag. Blessed to have made it to south carolina.","post_message":"A woman was arrested after climbing the flagpole in front of the South Carolina Statehouse and removing the Confederate Flag. @webpagelink"}]
