[{"comment_id":"10153010796814586","commenter_b":"Stop the dog slaughter. Stop killing,our animals. MONSTERS!!!","commenter_a":"Sigurd Rognan","post_message":"Dogs are speaking out for their friends being KILLED FOR LEATHER in China & sold all over the world. SHARE if you never WEAR your BEST FRIEND! JOIN THE MOVEMENT: @webpagelink #DogLeather [By posting your photo on Facebook, tagging PETA & using the hashtag #DogLeather, you are acknowledging that you have read & agree to our terms of submission: @webpagelink"},{"comment_id":"10154054920697093","commenter_b":"Just let this crazy lady live in her imaginary world.","commenter_a":"I feel the closet racists gathering on this post.","post_message":"Small protest happening now at the old Tarrant County Courthouse in response to the Fort Worth viral video arrest. bit.ly/2hYduuA"},{"comment_id":"10153149917160667","commenter_b":"@username And I should lose my right to own gun's because of what he and a few others have done? Not going to happen.","commenter_a":"We have to stop this hate Americans have towards Muslims all bc of some crazies. I mean heck go read on Christianity through the years and check out what they've done!","post_message":"#HokiesDontHate is being used in a campaign by Muslim students to \"extinguish ignorance\" on campus."},{"comment_id":"739571439509370","commenter_b":"Suzette, no, she doesn't. She just encourages them to get abortions so they can go back to their life and most likely get pregnant again.","commenter_a":"So here's an actual SOLUTION for all the pro-life people... Rather then protest, why don't you offer to help those poor, confused girls seeking an abortion? Perhaps these women feel they have no other option. So why don't you offer to help them out, since you love babies so much? Offer to take these girls in & give them an alternative, especially since a lot of them fear that their family is going to shun them due you to this unplanned pregnancy. Then, pay for all of their medical bills for all the doctor visits they'll need, including the hospital birth. Then, while the mother recovers at YOUR house, you can raise the baby you desperately wanted to save when she leaves to go on with the life that she wanted to live. I think that would work. Why don't all you pro-life people go and do that? Oh wait, ...","post_message":"Planned Parenthood doesn't want anyone to know this? Then spread this EVERYWHERE!"},{"comment_id":"10152734015363525","commenter_b":"going to get cold tonight!!","commenter_a":"Wtf...???","post_message":"Road trip to Lakewood Ranch. Who's in?"},{"comment_id":"10152890870819753","commenter_b":"She's a thug period.","commenter_a":"Now we can't call this woman a thug. Because you steal doesn't make you a thug. Big time corporations, corporate officials etc steal all the time they are not considered thugs. Let's be honest your calling her that because she is black. When cute little orange country with blonde hair and blue eyes lifts Tory burch glasses oh she's got a disorder and she won't get slammed, she will be escorted gently. You can get mad at my post if you want. I majored in History for a reason. I will say she a problem in society she gives a bad name to black people, there is no excuse ever to steal material crap. I understand if your starving and stealing food. But this is inexcusable. However, no man ever needs to slam a woman on the floor FOR ANY REASON! If your a man and your so strong, RESTRAIN ...","post_message":"Even though she was able to successfully open the driver’s door of her getaway car, the man did not allow her to get much farther than that. He grabbed the shoplifting woman as she opened the door, turned her on her back and slammed her on the ground seconds later. You think he used excessive force?"},{"comment_id":"10153725721616770","commenter_b":"Donald is getting rid of illegal immigrants That doesn't belong in America","commenter_a":"Judy white your are a Democratic like them ripping the people of America no jobs Don't you know that God got Donald trump's back Revelation 18 the fall of Babylon and all trades deals .if Hillery Clinton knew god maybe she would be president But she hates god . remember god is greater.any humans On earth no one can overcome what god Has planned can try .","post_message":"New pro-amnesty campaign manager for Donald J. Trump says \"deportation force\" now \"TBD\""}]
