[{"comment_id":"1220522774636943","commenter_b":"Lock her up!","commenter_a":"NOTHING TRUMP SAYS CAN CHANGE OUR MINDS WE WILL NOT VOTE FOR TRUMP . TRUMP IS A BASKET CASE . TRUMP IS A CRIMINAL . TRUMP LIES , LIES ,LIES","post_message":"CAST YOUR VOTE: The third and final debate between Hillary Clinton and Donald Trump before Election 2016. Vote for who you believe is winning and see the results LIVE. Vote here: @webpagelink"},{"comment_id":"10156512492735354","commenter_b":"Togetherness...as long as all the women keep their mouth shut. Maybe the punchline is exactly what I wrote.","commenter_a":"What does this photo actually say? It says girls are annoying. Girls talk too much. Girls should be seen and not heard. Whatever a girl says is not important. Men do not want to hear what a girl has to say. Little boys have a voice but little girls do not. The husband's voice is more important than his wife's. Seriously? I can't even imagine what kind of \"joke\" they were trying to tell with this photo. This is hardly funny at all. It's not that this is necessarily offensive, it's just frickin' sad, ignorant, and misogynistic. Congratulations to this mother and father...they have essentially taught their daughters a very important lesson as to their place in this world...and that they have NO VOICE!","post_message":"A firestorm of controversy has erupted over a viral Christmas card depicting a man's wife and girls with mouths taped shut..."},{"comment_id":"10153696504537300","commenter_b":"Fidel Castro is a white elitist who took from everyone regardless of race.","commenter_a":"So this is written by someone who \"escaped\" from Cuba 46 years ago and found \"safe haven\"...please! More from the wealthy elite, whiter Cubans who wanted to keep the poor suffering so they could benefit. Tools of the racist and capitalist US government in their mistreatment of Latin American nations and Indigenous and Black people throughout the Americas!","post_message":"The latest from columnist Fabiola Santiago on the need for reform of the Cuban Adjustment Act. What do you think?"},{"comment_id":"10153997229702042","commenter_b":"You ladies don't have knees or you like the attention... Knee to the groin!!","commenter_a":"Get him off the streets","post_message":"Police are looking for this man who allegedly groped and rubbed his groin against a subway rider on the train. \"SHARE\" this post to help police find this man."},{"comment_id":"10153009927864586","commenter_b":"Let someone stand on that bitch's head!","commenter_a":"I still cant get over the idea that an organization that euthanized dogs and cats and put them in dumpsters is denouncing anything to do with being cruel to animals. Google the pics... PETA EUTHANIZED ANIMALS","post_message":"ICYMI: Sarah Palin posted a picture of her son STANDING on the family dog & thinks it's totally okay: @webpagelink The most important thing we can teach our children IS COMPASSION. SHARE if you agree!"},{"comment_id":"944852772272626","commenter_b":"Those skank lesbians should choke on the next thing they eat.","commenter_a":"Ten Reasons for Supporting Trump 1. Donald Trump is immune to special interest lobbying because he has accepted no donations or special interest money. No other candidate can make this claim. 2. Donald Trump knows how to negotiate. No one builds an international business empire the size of Mr. Trump without being able to win at the negotiating table. 3. Donald Trump is an executive. The President of the United States is the Chief Executive Officer of our nation. We don need a policy expert or a legislator we need someone who knows how to run an organization. Mr. Trump is the only candidate who has a proven record as a successful executive on a large scale. 4. Donald Trump is honest. Mr. Trump is a man who tells the truth. He may not always say it in the most polished way, but our country has had enough suave liars. ...","post_message":"\"...for emotional suffering....\""},{"comment_id":"854169234726517","commenter_b":"How about rapist?","commenter_a":"If trump is despicable, what does that make Hillary ?","post_message":"\"He’s just despicable,\" Letterman said, adding that Donald J. Trump may very well prove the saying that \"anyone can grow up to be president.\""}]
