[{"comment_id":"10154305889759312","commenter_b":"Walmart doesn't pay a \"living wage\" either. They can't go get a job at Kmart.","commenter_a":"There are a lot of businesses that do this, why only go after jimmy johns? It's not \"unfair\". What are e in 2nd grade? If you work at Pepsi, you can't work at Coke.","post_message":"The state of Illinois says a practice at Jimmy John's is \"unfair to Illinois workers and bad for Illinois businesses. Do you agree?"},{"comment_id":"10153767198963690","commenter_b":"@username it is not just three countries being destroyed, all the countries in Europe to which the refugees are going will be destroyed economically, culturally, life as they know it will never be the same.","commenter_a":"Saddam a cde to be missed, a last Iraqis leader","post_message":"\"There are plenty of Iraqis for whom Saddam is a nightmare that they never want to see again. His legacy here, though, is complicated. It's not as simple as 'Dictator Bad, Democracy Good,' as the architects of the Iraq war would have you believe.\" Al Jazeera's Imran Khan, in Baghdad, filed this Reporter's Note."},{"comment_id":"10153313439013984","commenter_b":"Sick bitch...you go girl..to hell","commenter_a":"She fed the hungry so all you people that have never been hungry think about that you idiots some people don't know what its like to have an empty belly so you go girl","post_message":"The disgusting hatred from the left never ceases to amaze me. Do you support this young woman?"},{"comment_id":"10153018351676336","commenter_b":"Disgusts me to see girls acting like this and the bystanders with the cell phones out! Come on now","commenter_a":"As a parent, I would be MORTIFIED to see my child standing there videoing the fight! Doesn't anyone have compassion any more? \"Mean girls\"... smh... it's out of control! We should have evolved beyond this.....","post_message":"A shocking photo appears to show the moment a Texas mother pulled out a gun and pointed it at a high school student."},{"comment_id":"10153930858301320","commenter_b":"Hoes will be hoes","commenter_a":"Kinda what he gets for being stupid.","post_message":"It was an expensive night. After a night of clubbing Knicks forward Derrick Williams took these two women back to his apartment and they made off with more than $600,000 worth of jewelry. Details: @webpagelink"},{"comment_id":"10152903989921336","commenter_b":"Just say your sorry, it'll be ok, long time ago let it go.","commenter_a":"The sooner the better","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."},{"comment_id":"10153146614743984","commenter_b":"You Dum bitch","commenter_a":"IMPEACH OBAMA NOW that damn MUSLIM","post_message":"Wow. I'm sure this is the last thing Obama wanted to slip out to the public. Do you think Obama is one of our worst presidents ever?"}]
