[{"comment_id":"1837044486583115","commenter_b":"Build the wall already and send her back","commenter_a":"this is funny , only because these two willfully ignorant","post_message":"Leftists Attack - Man Harassed For Wearing #BuildTheWall T-shirt SHARE if you WANT TRUMP To Build the WALL! WARNING: Strong Language!"},{"comment_id":"10155583130286509","commenter_b":". Unlike Obama, Trump has control of congress and can appoint to the Supreme court due to the opening. Obama never had that amount of power. Plus Obama was a moron. Trump needs to build that wall. Trump needs to build camps and round up all illegals that can be found. Put them in internment camps till they can be removed to their country of origin. Or just put them in prison like he said for 5 years if they come in the country illegally. We have our president now like the minorities had Obama.","commenter_a":"It is not Van Jones' job to correct people to take away their fears. It is the Trump camp's job to do so. Don't tell people when to feel afraid and when not. You have to make them feel safe and welcome. Donald Trump is the President now. Now he has to do his job for ALL.","post_message":"\"You need to back off.\" CNN's Van Jones exchanged hot words with a Donald J. Trump supporter who argued Jones ought to repudiate fears among protesters that a Trump administration would create camps for illegal immigrants. @webpagelink"},{"comment_id":"10154389558756336","commenter_b":"@username LOL! it's the world who runs to, scrambles to get to, imitates and leaves all behind to get to The US not the UK! We don't need to catch up with anywhere, no one's out in front of us!.....hence a hella immigration problem!","commenter_a":"Hey aren't guns illegal there? This must be a misunderstanding I'm sure, take your gun control and stick it up your a$$ Thought Europe(Germany) had very strict gun laws? Just goes to show you that the bad guys will ALWAYS find a way to get guns!!!!","post_message":"Breaking News: There are reports of a “threat situation,” involving \"some sort of weapon\" at a German movie theater in Viernheim, according to police. @webpagelink"},{"comment_id":"488963091300703","commenter_b":"Amen and Amen. If you have no respect for our country then stay out. I believe in freedom but don't come over here trying to change this country into the country you left. If your country was so great then why did you leave?","commenter_a":"I see no problem in this","post_message":"What do you think of Donald J. Trump's plan to combat terrorism? @webpagelink"},{"comment_id":"10153432953951130","commenter_b":"Its not hard at all. Check craiglast there everywhere. I can sell you mine. Thats the point!!","commenter_a":"It's such a pain in the ass to get guns now. Why would anyone want more gun laws?","post_message":"A majority of Americans want stricter gun laws, and now we have the poll numbers to prove it."},{"comment_id":"10153240346384087","commenter_b":"You are remarkably uninformed. Why do you passively accept propaganda?","commenter_a":"Abortions account for over 86% of Planned Parenthood revenues, according to President Cecile Richards, who makes over $520,000 annually. Richards made the admission while testifying before the House Oversight and Government Reform Committee on Tuesday. @webpagelink","post_message":"Rep. Jim Jordan interrupted Planned Parenthood President and CEO Cecile Richards 19 times in five minutes as he grilled her about the previous apology she had given about the leaked footage."},{"comment_id":"10155302269621509","commenter_b":"He may be dead but he was right. There are some crashes that you can be in that you won't survive if you were wearing an armored suit. Its proven fact that everywhere they have changed the laws regarding wearing helmets deaths have increased. It happens around here a lot and most of the deaths are caused by head trauma, no helmet.","commenter_a":"what a tragic irony!","post_message":"A state lawmaker who voted to repeal universal helmet laws has died in a motorcycle crash. He was wearing a helmet at the time."}]
