[{"comment_id":"866874116779101","commenter_b":"who voted that fugly bitch in ?","commenter_a":"Because she's batshit crazy","post_message":"Watch this! I guarantee it's the STUPIDEST thing you hear all weekend..."},{"comment_id":"532673453589901","commenter_b":"Linda are you drunk? Your comment makes no sense. Girl get yourself together.","commenter_a":"If he does not support Obama he should not have to speak to him. It's a free country so far.","post_message":"Obama is outraged after Tom Brady made an epic stand against him. This is amazing. We have is back, let's show him our support. Can we get 10,000 'LIKES' for Tom Brady's stand against Obama?"},{"comment_id":"10153204052806051","commenter_b":"@username-You are a chicken !!!","commenter_a":"Obama is a terrorists","post_message":"This sign about President Obama is sparking a lot of controversy. Decide for yourselves if it's fair."},{"comment_id":"659146920942553","commenter_b":"Muslim terrorist","commenter_a":"YOU BET I AM!","post_message":"Members of ISIS are disguising themselves as refugees so that they can funnel into Europe. Terrorists have breached European borders, things are about to elevate. Are you worried Obama will let terrorists into our country?"},{"comment_id":"10153200362991943","commenter_b":"Cause she's sn idiot","commenter_a":"obama and his ilk will kill us long before the climate.","post_message":"Why is Obama EPA administrator, Gina McCarthy trying to scare Americans into believing \"Climate Change\" could kill them?"},{"comment_id":"10152647068355927","commenter_b":"She can be rich,but doesn't want the rest of us to be","commenter_a":"What's wrong with being rich? We pretty much all strive to be rich but the government does its utmost to prevent you. Good grief Hil.","post_message":"Great question..."},{"comment_id":"10154222477216717","commenter_b":"I want her and trump dropped in the middle of Aleppo ASAP.","commenter_a":"What swamp did this creature slime her way out of!!!' I wish she would slither back in!!'","post_message":"Trump advisor Kellyanne Conway also said that detained Muslim travelers would be \"disposed of\" on a case-by-case basis."}]
