[{"comment_id":"10154660794741756","commenter_b":"Shut Up Clown!","commenter_a":"If Venus or Serena were caught using this stuff they would have been stripped of everything!! Those double standards.Lol","post_message":"\"If it's not banned, athletes will use it.\""},{"comment_id":"858797117508627","commenter_b":"& the rich bastards don't give a shite.","commenter_a":"rockthevote.com","post_message":"Unless we take bold action to address climate change, our children, grandchildren and great-grandchildren are going to look back on this period in history and ask a very simple question: Where were they?"},{"comment_id":"1639973446062778","commenter_b":"Fucking bitch...outsmarted herself and all her dumb ass supporters!","commenter_a":"I thought it was us racist white people truth is you did not deserve to be our president because we don't trust you your record suck your forein policy was terrible and caused so much death your husband disgust me and you lied about your server when you bleached bit your emails to hide your crimes blew it for you but what you did to our heros in Benghazi was the worst then to cheat in debates with Donna showed us your still the sneak we all know you are. Go away already your done","post_message":""},{"comment_id":"10153994821081409","commenter_b":"Voting should only be done in person with ID on paper ballots. Who marked that mail in ballot? Who is at the keyboard for online voting? Do you have a repeatable count of the votes? Again, voting in person with ID with paper ballot.","commenter_a":"Voting should be the same in every state, county, city, town, whatever. Mail in ballots should be available to everyone. I think eventually we should go to online voting if we can keep the republicans from tampering with it.","post_message":""},{"comment_id":"775776192555196","commenter_b":"When God or nature grants you a vagina and uterus, you'll have a say in reproductive rights. Until then, NO. You canNOT force your girlfriend to continue an unwanted pregnancy to term, you creep. That's rape.","commenter_a":"So if a father wants his baby a woman can kill it with out his permission I guess a man only has rights to a child when a woman wants his money for the next 18 years rape is the only time abortion is ok if it's not from rape abortion is murder stop sugar coating avoiding responsibility if a woman wants a child and a man doesn't can he force an abortion no woman do not have exclusive rights over children just because you carry it for nine months a child beongs to both male and female hate me if you want to but my child was MURDERED! With out my say!! How is that equality?!","post_message":"Elizabeth Banks, Bellamy Young, and others share abortion stories to #drawtheline."},{"comment_id":"10153964560712885","commenter_b":"are you fucking dump lock that bitch UP!!!!!!!!","commenter_a":":( :( not cool","post_message":""},{"comment_id":"2175292792696203","commenter_b":"Fire her","commenter_a":"I am sure there are plenty of dancers to replace her.","post_message":"Ungrateful Rockette Snowflake Posts Anti-Trump Rant Over Being Forced To Perform At Inauguration"}]
