[{"comment_id":"10153014667776955","commenter_b":"I lived in NY, not the first blizzard or the last...whats different now is the libtards have forced energy production to stagnate or decline while the population increased - aka people are going to freeze to death in their own homes. This is just nature being nature. Lets not make something out of nothing.","commenter_a":"Good place for it.","post_message":"BLIZZARD WATCH NYC, BOSTON HISTORIC"},{"comment_id":"10155098283689411","commenter_b":"Bitch","commenter_a":"Politics and sex don't belong together. Also, what a dirty whore.","post_message":"'Everything is ok'"},{"comment_id":"10157707332290354","commenter_b":"Deport her ass","commenter_a":"If you vote Hillary you are just inviting scum like this into our country.","post_message":"What did she mean by this?"},{"comment_id":"567332390082204","commenter_b":"The dumbest woman in America alive .","commenter_a":"What a goofy broad.","post_message":"What are they going to call it, Mount Dumb-Dumb? -Conover"},{"comment_id":"1771925833072094","commenter_b":"Well, WE the people are voicing concern about muslim people who leave in US for free and hate us; WE the people.!","commenter_a":"assimilate and don't threaten to kill us or kill us. Or rape us. You're in America. Become American. Eezy peezy.","post_message":"Muslims are voicing concern on social media about a Trump presidency. @webpagelink"},{"comment_id":"10154859585584726","commenter_b":"Unfortunately in the eyes of progressives the answer is no. Meanwhile a slutty whore like Madonna can sell anything and everything she wants.","commenter_a":"Boy what hypocrites we have in show business. The left is losing it and it is getting really old!","post_message":"Can't a guy sell what he wants to sell?"},{"comment_id":"10153058205158984","commenter_b":"Good job, give the woman a raise.","commenter_a":"Would her employer be happier if she was the one who was shot??? I commend her for having the courage to stand up for herself","post_message":"I don't think this robber thought that holding a woman on the ground at gunpoint would land him a bullet to the face, but this gal delivers more than just pizzas! Do you think this woman should be afraid of getting fired for defending her life?"}]
