[{"comment_id":"558632694347761","commenter_b":"Oh Karen, you drank the Kool-Aid!","commenter_a":"Clinton News Network is the Communist News Network! Suppressing the american people and the truth and shutting down live feed the minute anyone mentions anything negative about your Wicked Queen is disgraceful! Your network is just as bad as the National Inquirer with fake reporting! You continue to try and brainwash americans into believing the left wing propaganda. News Flash...millions of americans are starting to use their own brains, which you can no longer control! Continue to cheer for Killary, because you're proving to the american people that your network is as crooked as she is!","post_message":"“There’s no quote. You’re not gonna find a quote from me,” Donald J. Trump told Hillary Clinton. Well, we found a few. Watch 4 of Trump's statements from the debate stage that don't seem to match up with what he previously said @webpagelink"},{"comment_id":"1612409662385087","commenter_b":"If we refuse service/sales to illegals we would be fined or jailed. They have rights, you know! More rights than American CITIZENS have!","commenter_a":"Hey...do not rent nor sell groceries or clothing or gas or anything else essential to their staying here....if we stick together their existence here will be short and sweet....","post_message":"This is stunning. After seeing this more countries might do the same. Do you think the two are connected?"},{"comment_id":"10153294741338984","commenter_b":"California idiots are the cause of the decline of morals! Create a safe haven for idiots called Cali weirdness!","commenter_a":"Everyone knows that Parker","post_message":"DEVASTATING! In his own words, Obama proves time and again he's a calculating liar. Will you join millions of other Americans in demanding Obama be impeached?"},{"comment_id":"10153069537647293","commenter_b":"lol holly you do realize \"lust\" existed before the legalization, right? plenty of both gay and straight couples letting lust \"win\" on a regular basis. the legalization of same-sex marriage allows same-sex couples in LOVE to get married. so yes, love wins.","commenter_a":"Give it up haters. Love won. You lost.","post_message":"\"This is no time for fear or outrage or politicizing. We see that we are strangers and exiles in American culture.\""},{"comment_id":"879093232228004","commenter_b":"She is an ugly person!","commenter_a":"Maybe she can hire a personal assistant to help her with clothes and makeup...","post_message":"$20,000,000.00 a year?! Shoot, I wouldn't pay her $20 a year."},{"comment_id":"617240545084050","commenter_b":"Gabe Monfried","commenter_a":"She was checking up on Bill","post_message":"It was really strange when Hillary was missing from the podium last night. Not very presidential!"},{"comment_id":"10158323534995594","commenter_b":"Stupid idiot. He is not sending out legal immigrants.","commenter_a":"Closing stores and businesses won't make America Great Again","post_message":"“I feel like I want to put the message out that I am ashamed that I gave him my vote, and I wish I could repeal and replace my vote for him.”"}]
