[{"comment_id":"2159179167640729","commenter_b":"Shut up you liberal ugly lying witch that THINKS she's as beautiful as Melania Trump (secretly jealous of her) get off the tv cause no one wants to look at or listen to you skank!","commenter_a":"Boo👀jk😊","post_message":"\"I feel like it was an attempted bullying.\""},{"comment_id":"795005380646682","commenter_b":"Y'all must be crazy","commenter_a":"Drain the swamp","post_message":"The United Nations resides on American soil, and the U.S. pays about 25% of its budget."},{"comment_id":"1717305195178742","commenter_b":"@username Did you smoke crack before your post? Americans can be Asians. Using your logic, Latinos and Latinas can't be Americans either. And all blacks would be African. Also, those nations are far from being heterogeneous like ours.","commenter_a":"Yes Asian men are not portrayed in a very nice light especially in american media. however, I find many Asian men to be attractive. love the facial structures and there is nothing like a guy with a sword.","post_message":"It's time to stop casting Asian actors as unsexy nerds. Like ATTN: on Facebook."},{"comment_id":"10155094190367577","commenter_b":"Wtf.. Russia is not communist","commenter_a":"China is still a communist country, as is Russia. As before, they are again silent allies against the U.S. and her allies, the list of which is getting shorter daily. Russia and China both are fighting other countries to win the land and resources they want from them. It is a chess game and the plan has been in play for decades. They have gone from fighting the Middlle Eastern countries, to becoming their allies. Those countries are the ones who have professed to be America's and Americamn","post_message":"China has backstabbed the globalists by trying to become a military threat instead of just an economic powerhouse:"},{"comment_id":"10154498360755958","commenter_b":"You mean the Virginia Mary who gave birth to JESUS. I highly doubt that is the reason for the hijab..when many women rose up in the middle east against wearing it.","commenter_a":"I am amazed and sickened by the racist comments posted here. She is a doctor working in America saving American lives. She can wear whatever she chooses because this is America. Wow...","post_message":"\"I'm so happy to be back here in Cleveland.\" The Cleveland Clinic resident who was forced out of the U.S. under President Trump's executive order is back home and speaking out for the first time."},{"comment_id":"10153356838133690","commenter_b":"Let ur sister to mumbai to get a rape","commenter_a":"Pak and ISI will use the money to fund terrorists !!","post_message":"Pakistan and China have held close diplomatic, military and economic ties for decades, but these projects would represent the largest investment in Pakistani history. @webpagelink"},{"comment_id":"606394809493701","commenter_b":"Wish they would come here n do that to woman who use lil kids as weapons against their Dads .","commenter_a":"Christians werent complaining when they wiped out the indians or burned people in the south","post_message":"Show this a liberal."}]
