[{"comment_id":"10153924127869197","commenter_b":"My condolences to the family","commenter_a":"God bless her","post_message":"This 10-year-old girl died after she pushed two other children out of harm's way. Read more about the courageous rescue by Kiera Larsen --> @webpagelink"},{"comment_id":"1168788129800109","commenter_b":"******TRUMP..... 2016 **** DESTROY ISLAM AMEN....pass the ammo \"SWIPER NO SWIPING\" *no illegals voting Quote..DORA THE EXPLORER *BLACK LIVES MuRDER ...jokes","commenter_a":"Lol She should have to wear a lie detector at all time....that zaps her when she fibbs","post_message":"Be sure to visit us at @webpagelink/ and like us at @webpagelink"},{"comment_id":"1132662126754797","commenter_b":"Haaaa! Sandhopper burgers all round !!!","commenter_a":"@username they stole our business idea!!","post_message":""},{"comment_id":"1115743115130630","commenter_b":"No Jay Reed, it doesn't offend me because, undocumented immigrants pay taxes, create business, and help the country's economy. Undocumented immigrants don't obtain unexpected or desabilty benefit even when they pay to the programs.","commenter_a":"California has no place for this disgusting xenophobic individual. Dump Donald Trump where he belongs. .the trash Dump.","post_message":"Protesters smashed a police cruiser and at least one fight broke out after Donald J. Trump's rally in Southern California Thursday night."},{"comment_id":"10153264316296336","commenter_b":"Civil liberties can cram it where the sun don't shine! Freedom of speech for ALL.","commenter_a":"How about this group goes f@$#s it self","post_message":"A civil liberties group says this United States Air Force general should be court-martialed for speaking about how God has guided his career."},{"comment_id":"10150802483299999","commenter_b":"Takes one to know one.","commenter_a":"Takes one to know one!","post_message":"Ted Cruz called Donald J. Trump a “pathological liar\" and a “narcissist at a level I don’t think this country has ever seen.”"},{"comment_id":"1245546388827745","commenter_b":"Don't disparage whores.","commenter_a":"Barrasso. It's embarassing to watch these whores. These scumbags have gotten so emboldened they don't even try to hide their crimes.","post_message":"Right after leading the floor debate in support of Scott Pruitt’s nomination to lead the EPA, Sen. John Barrasso attended a high-dollar fundraiser hosted by energy lobbyists."}]
