[{"comment_id":"1890349187852006","commenter_b":"One does not have to TRY to cast america in a bad light..... The racists & Nazis here do a good enough job by themselves. America is NOT great, & will never be great again until the cancer which arrived here In 1492 is removed. Swim back to Europe racist beast","commenter_a":"Stupid, stupid, stupid. I only still like this site cuz i wanna read what propoganda u spew next. Has anybody else thought that this site is communist run, or pro russian. They always try to find ways to cast the US in a very bad light","post_message":"OMG, did you hear? $$ Dump: @webpagelink DAPL Raid: @webpagelink Drone Bomb: @webpagelink Join Us: The Free Thought Project"},{"comment_id":"10153882688173984","commenter_b":"We have created the Immigration Laws for a reason and when needed we have enhanced them to be stricter. Anyone that thinks anyboby that does not come into our country legally should be allowed to stay are Un-American. They are taking Jobs from hard working Americans. There is no excuse to let them stay.","commenter_a":"Even Bill O'Racist recognizes how evil Adolf Trump's plan is...wow","post_message":"Bill O'Reilly thought it was a good idea to try and teach Trump a lesson about his deportation plan - it definitely didn't work out for him... Do you agree with Donald J. Trump on immigration?"},{"comment_id":"942297612493435","commenter_b":"Yep....her attitude says it all!","commenter_a":"\"What difference does it make?\"","post_message":"\"I will not quit on you. I will fight for you. I will be there for you every single day.\"—Hillary in Iowa City, Iowa yesterday via Hillary for Iowa"},{"comment_id":"10154182818316943","commenter_b":"WE ALL KNOW WHAT SHE DID WITH THEM!!! TRAITOR","commenter_a":"Breaking Leaders who are above the Law. Oh but what Hillary did isn't wrong... Give us a break. Amazing when American Citizens even a Police Officer was arrested & charged for helping the enemy. But she can do it and not held accountable... Since when did Leaders come under a double standard system. Even other's say for one to commit treason not held accountable. Law & Order a Justice System that's fair & honest...","post_message":"Among the 14,900 federal documents Hillary Clinton is said to have failed to turn over to the State Department in 2014 are some related to the Benghazi attacks, according to Judicial Watch. - via The Daily Caller"},{"comment_id":"10152683402245667","commenter_b":"She must like getting stuff for free.","commenter_a":"He's republican. Enuff said. Lost my vote.","post_message":"Marco Rubio has \"something\" important to say."},{"comment_id":"10152595284751519","commenter_b":"If only the women on Fox News would start wearing tampons for earrings, maybe they'd be taken more seriously.","commenter_a":"How can any thinking woman vote republican? Stepford Wives comes to mind. How does the republican platform support women? Oh and Glen, ACA is winning. Read.","post_message":"We don't have to take Fox News' lies any longer. Here's how we fight back."},{"comment_id":"10156237879600594","commenter_b":"Her posture? She's not modeling, she's out on a boat with her nieces. I doubt they would have been in the picture if the intent was to be \"sexy\". She wearing a bathing suit. So what?","commenter_a":"The body is fine, the bikini is ugly and her posture is horrible.","post_message":"Ariel Winter takes the online hate and spins it into a message for all the bullied girls out there: \"YOU ARE BEAUTIFUL\""}]
