[{"comment_id":"10153518818316162","commenter_b":"Well, some women are just total knockouts....","commenter_a":"Women injured and pride parade. The pride parade should be banned!","post_message":"A 25-year-old woman was knocked out when a drone struck her in the head during the pride parade @webpagelink"},{"comment_id":"10154274574160329","commenter_b":"Grace Lee Justin Bloch","commenter_a":"Gabriel Cortez","post_message":"OMG!!!"},{"comment_id":"10153007851971051","commenter_b":"Sick ass bitch!wtf","commenter_a":"Why don't sickos like this get life in prison or death? Rapists and molesters are released to hurt more people? The system is messed up!!!!!","post_message":"This babysitter repeatedly sexually assaulted a little girl. Last week, justice was finally served."},{"comment_id":"10153442091264877","commenter_b":"That's right, Westley :) * waits for the obligatory hoteper insult about evil black feminists*","commenter_a":"This song is not about Black women. At best, the song attempts to denounce negative stereotypes of Black men. I appreciate the effort, but he has a lot more work to do.","post_message":"David Banner Shows Support for Black Women in New Song 'Marry Me.' It's the rapper like you've never heard him before. Listen to the audio below. Grio fam, what do you think of Banner's tribute? Sound off!"},{"comment_id":"927319353970153","commenter_b":"Who cares about whatever Sarah has to say....she's a nobody. Good grief !!","commenter_a":"BO doesn't care he's in office as a fraud perpetuating and feeding the muslime brotherhood on our dime","post_message":"HA HA!"},{"comment_id":"10154233852123445","commenter_b":"Eww shut up bitch i do but ive seen u more than her 👊😛","commenter_a":"@username @username @username @username haha hell yea i do !😂😂😂😂","post_message":""},{"comment_id":"10154731956548797","commenter_b":"@username - Canadian!","commenter_a":"What the hell is wrong with this city? What is the death toll so far for this month?","post_message":"FATAL STABBING ON RED LINE: CTA Red Line trains are suspended between 35th and Garfield after a woman was stabbed to death on a train Thursday afternoon."}]
