[{"comment_id":"1156989694324963","commenter_b":"Fuk that NIG GERR BITCH","commenter_a":"SHE IS A HORRIBLE HUMAN PERIOD","post_message":"Michelle Obama Banned Valentines Day In Schools She can't take love away from America's children. Do you think she is a horrible first lady?"},{"comment_id":"10153752277268984","commenter_b":"Hell No!!! Women in combat will be a liability and not an asset!!! I am all about women achieving their highest, but to EVER say a woman physically has the same strength as a man, is absolutely false!! Our culture teaches males to protect females, our Military does NOT need that liability in battle!!!!!","commenter_a":"Sorry ladies but I feel that only a few of us can fit certain gender roles in many male jobs. No standards should be lowered to make women fit . Some can apply but not all can make it.","post_message":"Shortly after the US military lifted its ban on women serving in combat, the Marine Corps began a year-long experiment - here's the result... What do you think about women serving in combat?"},{"comment_id":"648235325326484","commenter_b":"She has! Wake up!","commenter_a":"Killary should release her tax papers too! She is a liar and a murderer!","post_message":"Yesterday, Hillary Clinton blasted Donald J. Trump in a heated speech on the economy. So now, Trump is firing back... hard: @webpagelink"},{"comment_id":"1090578067658503","commenter_b":"Then came Tuesday, \"decades day.\" Ibe dressed as a slave. The student said that, through his outfit, he had wanted to keep the dialogue about slavery going. He felt that at school the topic was sometimes covered up. \"I was like, OK, I need to make my voice heard and make sure these people did know that slavery did happen back in the day,\" he said in a phone interview Wednesday. Ibe's look didn't last long. He arrived Tuesday to the school in Missouri City about 30 minutes early, he said. When he walked through the main entrance and began down the hallway, he said an assistant principal pulled him into an office. They waited for the principal, who told him the outfit was inappropriate and that he needed to change, Ibe said. But taking off the outfit didn't mean he would drop the issue. At 9:29 a.m., Ibe asked ...","commenter_a":"Deplorable behavior!!! Trump has brought out the worst in people. God helps us.","post_message":"This is BEYOND deplorable..."},{"comment_id":"1089383177744009","commenter_b":"eeeuuuuuuu - did she get that in her back yard?","commenter_a":"That looks awful.","post_message":"You as a parent do not know what's best for your kid. You don't know how to raise your kid right. You certainly do not know how to properly feed your child, and Michelle Obama and the government are going to do it for you and they're not gonna give you any choice in the matter."},{"comment_id":"880520761983346","commenter_b":"Perfect pic of her with her mouth wide open.","commenter_a":"She is scum.","post_message":"Tom Selleck is awesome!"},{"comment_id":"10153639899983132","commenter_b":"She didnt make the show! Nene thought the show revolved around her, she cant handle the truth!","commenter_a":"Well that show won't last without her, I will not watch anymore.","post_message":"EXCLUSIVE: NENE LEAKES is leaving the Real Housewives of Atlanta but teases an exciting new project: \"I'm actually going to be doing a new primetime television show with a big legend.\" @webpagelink"}]
