[{"comment_id":"687880108038609","commenter_b":"of course they arn't all murders and gang members that's why the wall will have a door or did you miss that part in the cnn chopped up version of that speech? the ones who want to be Americans can stay the rest can f off.","commenter_a":"These comments are disturbing. These are parents, children, families...not murders, drug dealers or rapists. Instead of \"building a wall\" or treating them like shit we should be coming together with Mexico so that they don't need to come here. They need help, we have a problem, so why are the two countries not putting their heads together to figure out a way to HELP","post_message":"Thousands of Central American children and families are arriving in Texas."},{"comment_id":"1027250217329982","commenter_b":"Samantha please do me a favor you sound like and intelligent young lady .HERE GOES LOOK AT SOCIALISUM IN SOUTH AMERICA THE People ARE STARVING LIVING LIKE RATS AND THE BIG BOYS ARE TAKING THE MONEY 85 percent TAXATION SAME CRAP IN CANADA AND THEY WILL SWARE ITS THE GREATEST FREEDOM AND FREE MARKETS ARE THE ONLY WAY NOT CONTROL","commenter_a":"Every state should have open primaries. Pretty disappointed in my state of NY. So many people can't vote because of this.","post_message":""},{"comment_id":"10153619663514877","commenter_b":"maybe he got 3 ugly wives.","commenter_a":"he int even cute, so his game must be strong, lol, just divorce the loser, with three wives he will not have an account, hahahah","post_message":"Man charged with being married to three women after second wife catches him on Facebook. Grio fam, what would you do if you found out your spouse was married to someone else via social media? Sound off below!"},{"comment_id":"1308235872529496","commenter_b":"Such a HORRIBLE breed!! !!","commenter_a":"I hate pit bulls ... If judge Judy doesn't like em.... It's good enough for me .... Example here!!","post_message":"Noah suffered injuries to his head and face and underwent emergency plastic surgery."},{"comment_id":"10154186189827894","commenter_b":"What a bitch","commenter_a":"Real petty","post_message":"Ouch! Sheree Whitfield Responds to Kenya Moore's Chateau Shade: 'My Mother Loves Me' [Video]"},{"comment_id":"1407318236234112","commenter_b":"@username seek help and do it quickly!","commenter_a":"@username is under investigation by the FBI, she should not be allowed to run for President or own a gun or have people hired by her having guns there are laws against organized crime and she should be put on a no fly list, but because the Government is corrupted and is allowing Hillary to sell favors to Americas enemies which is Treason she'll get away with it.","post_message":"A great day to hit the campaign trail in Ohio with Elizabeth Warren."},{"comment_id":"10153699132454060","commenter_b":"Do you mean the hate speach espoused by the feminist campaigners? Such as the hashtag killallwhitemen and maletears","commenter_a":"hate speech is hate speech. We must identify and stop it.","post_message":"“Just because you lop off your dick and then wear a dress doesn't make you a fucking woman.\" Hate speech or just offensive? Cardiff University students think the former"}]
