[{"comment_id":"1415259475160745","commenter_b":"Nobody hates better than feminists.","commenter_a":"The hate is real from the Internet warriors lol. So many people driven by hate... I wonder if poked if they would ooze black.","post_message":"Is this what a feminist looks like?"},{"comment_id":"10154279210266028","commenter_b":"Don't you say Hey to me you ugly girl!","commenter_a":"@username @username Oh geez!","post_message":"The two classic American novels have been temporarily pulled from shelves in one Virginia school district following complaints from a parent. @webpagelink"},{"comment_id":"10154877505644351","commenter_b":"Build it electrify it arm the wall with automatic weapons cameras night vision electrify deep into the ground to kill tunnellers pass new deportTion laws make it a felonie criminal act to border hop punishable by years in a very bad prison","commenter_a":"His whole campaign was based on building a wall!! Of course he should, we need secure borders!!","post_message":"Thoughts?"},{"comment_id":"10154376040464641","commenter_b":"making of The Taken 3 (Must watch Unbelievable) @webpagelink","commenter_a":"That's what we should be doing focusing on the dummies in the audience, the cockroaches","post_message":"Donald J. Trump's controversial \"Second Amendment people\" comment made Darrell Vickers' bearded jaw drop."},{"comment_id":"10156899392785725","commenter_b":"Hope she gets jail time","commenter_a":"hillary who shed the blood of innocent American at Libyan embassy. Obama and clinton who created all conflicts possible in America ( income war, gender war, age war, war on women, Race wars) driving wedges among the people. Hillary clinton and bill clinton war on women explained by Roger Stone on youtube","post_message":"As President of the United States of America- I will see to it that the AWARENESS continues -- I will be in a position to immediately handle all of the issues at the VA --- nobody will look after our Veterans --- our heroes, like me. I guarantee that!"},{"comment_id":"723350804480361","commenter_b":"Wow... look at the Drumpf whore pounding out her propaganda. Nice work little slut. You get the executive card from the orange tinted prolapse","commenter_a":"This is not true. I know who got the letters and you were not one of them. Poser","post_message":"We were forced to comply with a Cease and Desist sent by Melania Trump's paid doberman. This is the future of journalism under a Trump presidency."},{"comment_id":"714279835348897","commenter_b":"More trigger happy pigs.","commenter_a":"Better to be tried by twelve than carried by six. Today's cops are not the cool headed officers of old. They are post 911 trigger happy thugs who think Johny Jihad is around ever corner. DO NOT CALL KEYSTONE COPS until the threat is gone or dead and your guns are put away.","post_message":"A Huntsville woman seemed to have been perfectly justified in firing upon a violent ex who walked through a restraining order. Whether she was a threat when she turned towards responding officers with the shotgun still in her hands is under investigation."}]
