[{"comment_id":"10158040412050206","commenter_b":"I was thinking that too. Where is the Air Marshal?","commenter_a":"Good on the pilot.... but where the hell are some of the passengers to help??? Seriously....bunch of cowards.","post_message":"This 25-year-old passenger was restrained by a pilot after pushing and threatening a flight attendant on an American Airlines flight into Charlotte, North Carolina. @webpagelink"},{"comment_id":"1576836375956014","commenter_b":"And yes, you will pay for that f'n wall!","commenter_a":"Fox apologized to Trump and invited him in May. He is a liar","post_message":"The former president of Mexico, Vicente Fox Quesada, says Donald J. Trump is using his visit to Mexico with President Enrique Peña Nieto to boost his sinking poll numbers. @webpagelink"},{"comment_id":"10152818238035927","commenter_b":"LOL! Funny..I've never seen a Good Looking Gay Couple...Lol!","commenter_a":"How can this be a gay Marriage? The one on the right looks like a man!","post_message":"This Ohio judge may take some heat for his recent decision on gay marriage ..."},{"comment_id":"10156069283810354","commenter_b":"@Kristin ... \"you serious Clark?\" is a quote from the movie Christmas Vacation : )","commenter_a":"Well, when schools in a Tennessee district are banning the USA flag, why not the gay pride flag?","post_message":"“...police reportedly confiscated a gay pride flag…” Will the Left ban the gay pride flag now?"},{"comment_id":"10154318363317232","commenter_b":"Why aren't they being plowed through? Run these scumbuckets down!","commenter_a":"Sent in the robot","post_message":""},{"comment_id":"10153278657786336","commenter_b":"Nice to meet you as well Sherrell.","commenter_a":"White lives matter too","post_message":"Police believe Daron Dylon Wint – the suspect in the D.C. quadruple murder – may be in Brooklyn, New York. DETAILS: @webpagelink"},{"comment_id":"10156528840915389","commenter_b":"She's a troll. Ignore her and maybe she'll go away","commenter_a":"The best parts of LIFE are free and easy to do.","post_message":"ICYMI: 89-year-old World War II veteran Bryan Sperry scores a touchdown during The University of Kansas alumni flag football game! Sperry played on the Kansas Football team from 1946-1948. @webpagelink"}]
