[{"comment_id":"10154108457106782","commenter_b":"She probably screwing him","commenter_a":"Of course she supports him. She's nearly as stupid as he is.","post_message":"Kellyanne Conway, the high-profile White House counselor, has come under fire from Democratic and Republican lawmakers, fact checkers and the media. But she's so far maintained the support of her boss, President Donald Trump. @webpagelink"},{"comment_id":"10154518044354342","commenter_b":"An animal gives birth to its young......will care for it, and not abandon its young. Humans are worse than animals..........spay this thing at once, she needs not tpo reproduce again, EVER!!!!","commenter_a":"Praying for healing.","post_message":"UPDATE: Police say the mother of a baby born in a Walmart bathroom, then left in a trashcan has been arrested. The baby is still alive, but in critical condition."},{"comment_id":"10153452410792235","commenter_b":"LOL He is such a nut","commenter_a":"Ted, I prescribe driving your chevy to the levy...","post_message":"You mad, bro?"},{"comment_id":"10152903989921336","commenter_b":"Just say your sorry, it'll be ok, long time ago let it go.","commenter_a":"The sooner the better","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."},{"comment_id":"10154274374674445","commenter_b":"Meant north Falmouth not Nana! These txt terms get ahead of me lol!","commenter_a":"Granddaughters & sister-in-law-,law live in E,& Nana Falmouth have to check it out!, saw on local TV Chronicle last night!","post_message":"Chronicle on WCVB Channel 5 is exploring the beauty of Cape Cod. What's your favorite spot to visit each year? Watch live: @webpagelink"},{"comment_id":"10152983591416491","commenter_b":"Lena did it for 10 yrs. She's gross!!","commenter_a":"Lena was seven. Not 14 or 15. And Duggar raped his own sisters many times over many years. And who the hell is Palin? An irrelevant person seeking relevance.","post_message":"“I’m sickened that the media gives their chosen ones a pass for any behavior as long as they share their left-wing politics.”"},{"comment_id":"10152904243581636","commenter_b":"If she wanted to kill herself she would have hope she frys!","commenter_a":"Those poor babies. This poor woman. I can't say I understand killing her babies, but she is very obviously severely depressed. I only wish she had gotten the medical attention she so clearly needs before she took such drastic measures.","post_message":"Officials say a Connecticut mother who allegedly murdered her two children left a suicide note next to the children bodies, explaining why she killed them."}]
