[{"comment_id":"10158633377120725","commenter_b":"Funny, president Obomba deported more people than any president in us history. Liberals worship him. Trump deports people and out come the crybabies and the protests.","commenter_a":"Why deport the good people? I don't get this ine","post_message":"Advocates believe the roundups and arrests mark a shift in enforcement under the Trump administration."},{"comment_id":"10153733130168855","commenter_b":"What an ugly hag.","commenter_a":"Its going to take gallons and gallons of makeup to hide her superficiality...","post_message":"\"Caitlyn Jenner wants attention, and she doesn’t especially care who’s harmed as a result.\""},{"comment_id":"892166267491828","commenter_b":"Why always Iran?","commenter_a":"Erdogan is a disgrace to Turkish people.","post_message":"Iran has summoned Turkey's charge d’affaires to hear Tehran's protest against Turkish President Recep Tayyip Erdogan's “improper” remarks regarding the Islamic Republic's alleged regional ambitions. Read more: @webpagelink"},{"comment_id":"501298436725116","commenter_b":"Need more Americans like him . Hope he can beat all the charges . Muslims need to go back home !","commenter_a":"Not a hate crime","post_message":"A lesson he'll NEVER forget..."},{"comment_id":"10153846448114087","commenter_b":"No matter what I will never vote for Hillary!","commenter_a":"If, and that's s big if, she ousts her you can guarantee she'll give/get her some other position of influence and big money either public or private sector.","post_message":"Bernie Sanders has put ousting Democratic National Committee Chairwoman Debbie Wasserman Schultz at the top of his list of demands, putting pressure on Hillary Clinton to get rid of an ally accused by her rival’s supporters of tilting the race in her favor."},{"comment_id":"1407318236234112","commenter_b":"@username seek help and do it quickly!","commenter_a":"@username is under investigation by the FBI, she should not be allowed to run for President or own a gun or have people hired by her having guns there are laws against organized crime and she should be put on a no fly list, but because the Government is corrupted and is allowing Hillary to sell favors to Americas enemies which is Treason she'll get away with it.","post_message":"A great day to hit the campaign trail in Ohio with Elizabeth Warren."},{"comment_id":"10152708840057014","commenter_b":"The only ones wanting her are the freebie seekers. And the ILLEGALS !!!!!!!!","commenter_a":"Absolutely. Sorry to the GOP because all of their candidates are LOSERS","post_message":"Would you consider voting for Hillary for President?"}]
