[{"comment_id":"10153724515436770","commenter_b":"She has no womb or ovaries.","commenter_a":"Transgenders are just psychologically \"challenged\" individuals with a normal complement of either male or female sex chromosomes. A genetically male transgender would (quite correctly) not be allowed to compete in a woman's race whereas a genetically female transgender would only get beaten were she to compete in a male race. Caster is (it seems) totally different. If an intersex she has two X chromosomes that would normally make a female but, unlike true females she also possesses male Y chromosomes that will give some male characteristics. If she has Y chromosomes then she isn't qualified to compete in female races but, as with female transgenders, there is little point in her trying (and she should not with two X chromosomes) to compete in male races.","post_message":"South African runner Caster Semenya dominated the women's 800-meter final Saturday in Rio, finishing well ahead of the competition to take home the gold medal. Turns out Semenya is widely believed to be “intersex.\""},{"comment_id":"856436467738235","commenter_b":"Hang her!","commenter_a":"I'm a cabbie and I wish I could catch every person that skips on me","post_message":"A judge told this teen she could either walk 30 miles within 48 hours--or go to jail. She chose the long walk. See what she did below. Do you think the punishment fits the crime?"},{"comment_id":"10153505844154714","commenter_b":"But THEY can't have their own..male with male doesn't make babies","commenter_a":"You made a typo. You said \"her family\". You mean Bruce spent the day with his family.","post_message":"It was Caitlyn Jenner's first Father's Day as an out trans woman."},{"comment_id":"10154501796200861","commenter_b":"A form of The old bait and switch. ....I don't feel sorry for the jewelry store...you knew better","commenter_a":"I'm not saying profiling works every time but it would of worked this time","post_message":"Do you know any of these men? Police need your help."},{"comment_id":"10153718777033690","commenter_b":"Why don't the Saudis and Qatari take them all. The are wealthy nations with more real state than Europe. We definitely don't want them here in the US we have enough dealing with illegals coming from our southern border...!","commenter_a":"Take 30 seconds to sign (and possibly share) this petition asking the US government to take in 65000 Syrian refugees. Germany is expected to accept 800,000 refugees this year, while the US has accepted less than 1,000 thus far. Let's do a small part to encourage the U.S. government to be socially responsible. This is a humanitarian crisis and the Syrian refugees have nowhere to go. You can vote no matter where you are from. @webpagelink","post_message":"\"The world sees Germany as a country of hope and chances,\" German Chancellor Angela Merkel said at a news conference last week. Despite all the positive energy, however, some observers are questioning how the tens of thousands of newcomers, many of whom are conservative Muslims, will integrate and adapt to German society."},{"comment_id":"817971878238235","commenter_b":"WTF. Is she even more stupid then I thought.","commenter_a":"She is so stupid!!Does she have that kind of power or does that have to have congregational approvevl?","post_message":"Big news! What do you think about this?"},{"comment_id":"897189237043996","commenter_b":"No I hope not we need Hillary to run in 2016 . With all her baggage she will guarantee a Republican in the White House . She will be so busy trying to cover her tracks in crimes she won't have time to campaign ! And Billy's little visits to Orgy Island is going to be the next ship to sail !","commenter_a":"Hillary will walk all over him!","post_message":"He went to high school with Jeb Bush."}]
