[{"comment_id":"10154088708589087","commenter_b":"Including Melania Trump, she's illegal so vote for Hillary Melania!! LOL!","commenter_a":"the legal immigrants (hispanic and otherwise) should get onboard the Trump train...the illegal immigrants should vote for Hillary.","post_message":"House Hispanic Democrats said Trump is a \"cloud hanging over us\" as they begin celebrating Hispanic Heritage Month."},{"comment_id":"1205011436232276","commenter_b":"Hahaja pornhub and fat bitches fighting over fooood lmfao","commenter_a":"@username #14 😂. That's Steve","post_message":"Enjoy This Week's Vine Comp! #WSHH #Vine #Compilation"},{"comment_id":"10154716032249714","commenter_b":"Triggered a feminist. Didn't take long. What benefits will hillary do for you? Decrease tax rates hah funny. Zoe you sound little butt hurt you might need to see proctologist.","commenter_a":"Woah Woah Woah More Democratic Propaganda. Time to settle down @username.","post_message":"\"The first time I doubted my looks and worth was in kindergarten.\""},{"comment_id":"10155879788485354","commenter_b":"Send them all back. Stop immigration period. Let's get a handle on it before starting it back up. We need to police our new immigrants better.","commenter_a":"FOOK AMNESTY","post_message":"Some truly shocking statistics in this article..."},{"comment_id":"10153069061709342","commenter_b":"Has She wore it all year? Then it would of been out of respect and not show","commenter_a":"Let her wear it!!!!","post_message":"A Native American high school senior is fighting for her right to wear an eagle feather with her cap and gown. She says its about respecting her heritage. School officials call it decoration."},{"comment_id":"10153648380297293","commenter_b":"so that justifies a breach in privacy, Richard?","commenter_a":"Why keep nude images of yourself either on your device or your email inbox especially when you're a person of public interest. Stupidity warrants punishment.","post_message":"Jennifer Lawrence, Kate Upton, and Lea Michele were among the celebrities whose photos were said to be in the Celebgate dump."},{"comment_id":"212919912399673","commenter_b":"Karishma Bisheshar @username guys do ul remember this song...","commenter_a":"So sweet!","post_message":"You're my Honeybunch, Sugarplum Pumpy-umpy-umpkin, You're my Sweetie Pie You're my Cuppycake, Gumdrop Snoogums-Boogums, You're the Apple of my Eye And I love you so and I want you to know That I'll always be right here And I love to sing sweet songs to you Because you are so dear.. <3"}]
