[{"comment_id":"1137409276317081","commenter_b":"Hillary threatened by a female!? The Republican Party just makes me laugh!","commenter_a":"Hillary Clinton threatened by Melania??? lol give me a break.","post_message":"\"It's just another example of... when Hillary Clinton is threatened by a female, the first thing she does is try to destroy the person\": Donald J. Trump's campaign manager Paul Manafort addresses allegations that Melania Trump's #GOPConvention speech was plagiarized @webpagelink"},{"comment_id":"10155832964064062","commenter_b":"But you're gonna pay for that wall?? Here's some facts no fake or false ones where are you getting your info?? Russia? @webpagelink @webpagelink And if you make that much good for you hire trumps tax attorney trump hasn't paid for taxes you're crying about in 20 years, It'll help offset the insurance cost. I'm sure you can afford it.. And again democracy is majority of the vote as for the illegitimate vote why don't you believe the fact it was tampered with to make trump win? Guess 2+2 never equals 4 ..he won with little more than 25% of actual registered voters now tell me how that works?? As for God's being in government it's expressly written to be kept out by our founding fathers ..called separation of church and state.","commenter_a":"I feel sorry for the people who actually believe in him. They need God in their lives, seems as nothing in this earth can convince them they are being screwed lied to and alienating half of the world. Keep drinking that kool aid let's see what shambles we are left in.","post_message":"President-elect Donald Trump defended a plan this morning that would see the U.S. initially pay for a border wall with Mexico and be reimbursed at a later date."},{"comment_id":"1640792116219030","commenter_b":"That takes some balls","commenter_a":"What a pair to draw too. How can anyone support these idiots.","post_message":"Details you'll want to know are here: @webpagelink"},{"comment_id":"1062283227145482","commenter_b":"Glad you decided to be a Republican, Eric! Your bigoted remarks belong with them.","commenter_a":"Chan Zilla, even white people are getting sick of white people's bullshit...","post_message":"The significance of the march on the Confederate museum should not be lost. The Confederacy in and of itself was built on racial terrorism."},{"comment_id":"10152955255282452","commenter_b":"@username, abortion is legal even in the third trimester.","commenter_a":"How about we teach students and other young girls about birth control (not making it a religious issue) and make it more available to the public so we wouldn't have so many abortions in the first place. I don't like abortion, who the hell does anyways? But we shouldn't ban it. Let's push our efforts into making it as rare as possible instead.","post_message":"Anti-abortion activists on Tuesday released an undercover video showing a senior Planned Parenthood official discussing the disposition of parts from aborted fetuses. @webpagelink"},{"comment_id":"10153378828583984","commenter_b":"Yes","commenter_a":"Yes","post_message":"The Obama Administration’s pattern of rubber stamping these cases has significantly increased this percentage in the US. Do you support securing our border?"},{"comment_id":"10153077388711051","commenter_b":"What she can't read? So they don't like what your wearing take your business elsewhere duh but what she is wearing I see nothing wrong with she has more close on then most. The owner is an ass","commenter_a":"Seafood Nazi.","post_message":"When this woman was told that she was being kicked out of a store for her 'inappropriate' outfit, she thought it was a joke. Nope."}]
