[{"comment_id":"10152878773282217","commenter_b":"Jeanette is a bit of an obsessed weirdo","commenter_a":"Organised religion is worse than organised crime","post_message":"Why is Magna Carta so important?"},{"comment_id":"10154399468414411","commenter_b":"Herna Suryani Fuck you you dumb cunt ..israel was given the land at the end of the 2nd world war in 1947..and all you have done since ,,is kill.. steal ...bitch..and moan.. so FUCK YOU CUNT !!!","commenter_a":"The ongoing 'Palestinian' terror attacks towards innocent Israeli citizens, leave Israel with no other choice. Israel must take tough decisions in order to protect its citizens and prevent the next terror attacks. 'palestinians' always choose terrorism over peace. Sadly","post_message":"This step will 'only increase the sense of injustice and frustration felt by Palestinians' - UN official"},{"comment_id":"10154125606926615","commenter_b":"Those mountains r no joke girl","commenter_a":"For a few inches of snow????","post_message":"11 ALERT: Several school districts have decided to send students home early today, before the snow begins to fall. Keep checking this link for updates. FULL LIST: @webpagelink"},{"comment_id":"982153291907152","commenter_b":"The wall wont be anywhere as effective as you think. All it will do is provide more cover for traffickers.","commenter_a":"Texas here! We NEED THAT WALL!! 1 million dollars worth of drugs just confiscated last week that came from Mexico! Happens ALL the time! It must stop!","post_message":"Watch: Donald J. Trump addresses the American Legion National Convention in Cincinnati, Ohio"},{"comment_id":"1120933471338794","commenter_b":"Lol","commenter_a":"These uneducated hillbillies dont care because they cant afford to buy a trailer anyway...","post_message":"Millions upon millions of his poorest voters just got terrible news."},{"comment_id":"10153308437364877","commenter_b":"In the words of Redd Foxx \" you big dummy \"","commenter_a":"DF really??? And Ya'll all over Kanye this morning???? BEAHAHAHAAAA","post_message":"NEW ORLEANS (AP) — Former President George W. Bush returned Friday to New Orleans — the scene of one of his presidency's lowest points — to tout the region's recovery from the nation's costliest natural disaster on the 10th anniversary of Hurricane Katrina."},{"comment_id":"10153117013549740","commenter_b":"We wouldn't have any thugs!","commenter_a":"Good idea","post_message":"\"We need to get around this idea that you can resist arrest. You can’t. You just can’t do it. It results in potential injuries to the officer, to the suspect. And we need to change that, and the way to change that is to start penalties for it.\""}]
