[{"comment_id":"1094512657300125","commenter_b":"@username you know what they say, a slap in the face puts a bitch in her place","commenter_a":"No shit. I don't understand why people have been going nuts that someone was taking their guns away in the first place. That's not the goal. No one's changing 2nd amendment.","post_message":"EVERY American needs to understand this!"},{"comment_id":"10153534824302550","commenter_b":"She wasted our tax dollars on fantasy.","commenter_a":"Why is everyone so negative? A thirteen year old took a state to court. That says alot. Why is it OK for the president to waste money talking about climate change but not her. Get your heads out of your Butts people. She is not the problem, but did try to come up with a solution","post_message":"A judge has ruled against a 13-year-old girl who took North Carolina to court over climate change More ---> @webpagelink"},{"comment_id":"10156406946480354","commenter_b":"She'll be a thief til her last breath!!!!!!!!!!!!!!!","commenter_a":"Hillary Clinton is a corrupt, old, nasty glory seeker.","post_message":"\"Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\" Hillary Clinton is a _________________."},{"comment_id":"703232799867298","commenter_b":"Yes! Wipe them off of the Earth!","commenter_a":"Unfortunately this is what needs to be done to get this sickness out as best we can","post_message":"Several ISIS leaders have just been taken out. Good riddance. Should we send our air force back to Syria to end ISIS for good?"},{"comment_id":"1116747615049049","commenter_b":"Women frequently nurse their Babies in the train station where I work - I applaud it as natural and organic and cannot imagine why in Heaven's name it is such an issue - (we all come with identical equipment and this is what breasts are for) Nursed Babies are much healthier than those bottle fed","commenter_a":"Beautiful","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"},{"comment_id":"10153782383018984","commenter_b":"Yes I agree with the teacher. With the country like it is, how did she know it was not a bomb. Thank, to her for keeping our students safe. I wish they would all go back to there own Country .","commenter_a":"Just wanting to get more free money. They need to kick the whole damn family out of the country.","post_message":"There's already plenty of controversy and speculation surrounding the case of the 14-year-old boy Ahmed Mohamed, who brought his clock to school - and now what his family just did is taking it all one step further, Do you still stand by this school's decision to call the authorities?"},{"comment_id":"10155018976064170","commenter_b":"The most classless woman and family I have ever seen. Good riddance.","commenter_a":"This is also fake news. There is no sign like that. Bye Herman.","post_message":"I'm sure Michelle will find some hope in that nice house they're about to move into."}]
