[{"comment_id":"750074615183116","commenter_b":"THIS IS AMERICA & WE BETTER START PAYING ATTENTION BEFORE IT'S TOO LATE! SHARIA LAW BELONGS NOWHERE IN AMERICA.","commenter_a":"Let go hunting America ...Get them out of our country before they hurt our love ones ...","post_message":"Muslims take over THIS U.S. town and immediately begin implementing Sharia law. You cannot force others to follow your religious laws. Do you think this is wrong?"},{"comment_id":"1022737904430216","commenter_b":"Yuge piss on Shillery Clinton. Name ONE more disgusting pig who ever lived?","commenter_a":"Nobody kicks a dead dog. Hillary's attack shows that her campaign sees Cruz as a real threat. Ron Nehring, keep up the good fight.","post_message":"Ted Cruz: “John Kerry was not a little wrong, he was wildly, extraordinarily wrong. Facts matter. Science matters. Data matters.\""},{"comment_id":"1292895457407386","commenter_b":"FFFFFFFFFFFFFFFFFFFUUUUUUUUUUUUU UGLY BITCH","commenter_a":"Frau Kraut...... you have destroyed Germany ... so shut up.","post_message":"Why would Merkel think issuing Trump a not-so-thinly veiled warning, on the day after his amazing win, was a good move politically?"},{"comment_id":"10154094997078132","commenter_b":"don't reproduce...","commenter_a":"Jus had my babies let me put my fake lashes in n do my makeup for the pic..","post_message":"The only thing keeping Jaeyln and Luis apart is a year."},{"comment_id":"10154385658569197","commenter_b":"@username good one","commenter_a":"They should cancel all outdoor activities in sports .. Those poor kids too hot for them","post_message":"It's 9am and the heat index is already at nearly 100! What are you doing to stay cool today?"},{"comment_id":"10153481340240575","commenter_b":"This should be a crime!!!!! Go to hell!!!","commenter_a":"This is a BLACK DEVIL HE NEEDS TO BE EXTERMINATED!!!!!","post_message":"The Gateway Pundit - Farrakhan Shouts “Allahu Akbar!” and “White People Deserve to Die” In Latest Sermon (Video)"},{"comment_id":"10153758962823445","commenter_b":"Trump wants to build a 30 trillion dollar wall. I'm guessing you thought that would be free....","commenter_a":"Everything should be free or according to Bernie. Typical politician lying out his ass just so he can get more young people votes. He needs to go back to the old folks home and have his depends changed He's so full of shit.","post_message":"Bernie Sanders: \"Pot Should Not Be a Federal Crime.\""}]
