[{"comment_id":"864879717035938","commenter_b":"Voter fraud will get her elected anyway","commenter_a":"I would like to ask, How many Hilrack supporters have been in the military or had someone they love in the military and how many believe in God. The drive behind the Hilrack campaign is to REMOVE GOD from this country and then she will remove the military. READ \"The battling boys of Bengazhi\" Thats their agenda!!! The aid she gave to them will be repeated with any and all protecters of America. Why do you think all the Clinton money is in Canada???","post_message":"She's done. Please help us spread this. America needs to see it. Do you think Hillary is not fit to be president?"},{"comment_id":"10153770425869153","commenter_b":"You can't possibly be that stupid Christine ....","commenter_a":"just read where radical islamic muslims will come in with Syrian refugees so yes I agree with Trump","post_message":"What are your thoughts on Donald Trump's comments?"},{"comment_id":"10153193599506770","commenter_b":"I think Audrey had her brain aborted !","commenter_a":"Will she have an abortion since Grandma Hillary wants everybody to have abortions.","post_message":"Hillary's going to be a grandma again."},{"comment_id":"1128827183850702","commenter_b":"Hahahaha","commenter_a":"@username Benoit Badra @username thuggglifee","post_message":""},{"comment_id":"1784975415104883","commenter_b":"Quit talking the talk and walk the walk and prosecute this Bitch already for crying out loud!!!!!! No more POS criminal Clintons in the White House!!!!!!!","commenter_a":"We need to start a new Party, the Constitutional Conservative Party.","post_message":"DML explains about indicting Hillary Clinton for her emails -- what would it do? Plus, little inside info from pollsters who say Trump leading in polls nationally by Tuesday. Watch, share, and if you are new to DML please give this page a LIKE."},{"comment_id":"10153103752973854","commenter_b":"Every last one of them ...","commenter_a":"The shameful sellouts are: 1.Mark Amodei (R-NV) 2.Mike Coffman (R-CO) 3.Ryan Costello (R-PA) 4.Carlos Curbelo (R-FL) 5.Jeff Denham (R-CA) 6.Charlie Dent (R-PA) 7.Mario Diaz-Balart (R-FL) 8.Bob Dold (R-IL) 9.Renee Ellmers (R-NC) 10.Chris Gibson (R-NY) 11.Richard Hanna (R-NY) 12.Crescent Hardy (R-NV) 13.Joe Heck (R-NV) 14.John Katko (R-NY) 15.Peter King (R-NY) 16.Adam Kinzinger (R-IL) 17.Frank LoBiondo (R-NJ) 18.Tom MacArthur (R-NJ) 19.Martha McSally (R-AZ) 20.Pat Meehan (R-PA) 21.Devin Nunes (R-CA) 22.Dave Reichert (R-WA) 23.Ileana Ros-Lehtinen (R-FL) 24.Chris Smith (R-NJ) 25.Fred Upton (R-MI) 26.David Valadao","post_message":"These 26 Traitorous Republicans Voted Against Blocking Amnesty – Must Be Defeated In 2016"},{"comment_id":"10153338669186323","commenter_b":"^That hyperbolic Feminazi your mother warned you about","commenter_a":"Yeah! It's Natalie PortMAN not Natalie PortWOMAN","post_message":"“It’s a very female thing of being afraid to say: ‘I’m the boss, and this is how I want it.’”"}]
