[{"comment_id":"10153555901929087","commenter_b":"GO #TRUMP !!! HECK YEAH...YOU BET!!! THE ONLY ONE WHO WORKS CIRCLES AROUND THE REST, WHO KNOWS EXACTLY HOW TO MAKE AMERICA GREAT AGAIN !!! YOU BET!!!","commenter_a":"Yes, he's a strong Christian who takes on the Pope and walks in the path of Christ, building walls, abusing women and attacking people of other cultures. If this guy's a Christian, I'm Christie Brinkley.","post_message":"\"I'm always audited by the IRS, which I think is very unfair. Maybe because of religion,\" Donald J. Trump said after tonight's #GOPdebate. \"Maybe because of the fact that I am a strong Christian...you see what's happened, you have many religious groups complaining about that.\""},{"comment_id":"831982023505806","commenter_b":"This woman needs to take the beam out of her eye before plucking the speck out of mine.","commenter_a":"The key point is she CHOOSES what to wear. So long as it is her choice, and not forced upon her, that's fine.","post_message":"Christian mom explains why she decided to stop wearing leggings:"},{"comment_id":"1640586052910285","commenter_b":"Close them.Then make it tough to come to America.Its to DAMN easy now,,that's why were lousy with illegals.","commenter_a":"NO!","post_message":"Senator Tom Cotton just introduced Trump's immigration proposal through the Senate! Sign the petition SUPPORTING the bill HERE: @webpagelink"},{"comment_id":"779579485508565","commenter_b":"Mia King you are just making things worse. People of all races kill period! I could waste my time looking for articles of blacks killing whites but I'm not trying to keep the racist shit going.","commenter_a":"The TRIBAL ATTACK is alive and well. Took seven (7) FUCKING NEGRAHS to beat up one (1) homeless white man. Put these porch monkies one-on-one and they run like the cowards they are.","post_message":"Dear liberals and the #BlackLivesMatter movement, police and white people are not the problem. This is the problem...Sickening."},{"comment_id":"10157139733295354","commenter_b":"\"Lets bring in 1000's of Muslim refugees\" Sincerely, Libtards of America","commenter_a":"Have you seen this on BBC today ?????When Donald J. Trump offered to make Sadiq Khan an \"exception\" to his ban on Muslims travelling to the US, here's how the new London Mayor responded.","post_message":"***BREAKING***"},{"comment_id":"1181726388516881","commenter_b":"Yep, infidelity has nothing to do with a woman's looks. It's opportunity.","commenter_a":"Been there done that ....it sickens me even the prettiest girls get cheated on which tells me that it is not about how good you look,how skinny you are, or even how rich you are you see how when they make their minds up and don't want to work at fixing anything well we need to stop giving second chances too.","post_message":"Check out what Keshia had to say about the lie that was their relationship. What do you think of her comments?"},{"comment_id":"10152841288932061","commenter_b":"I LOVE Johnny Depp and most of his movies. This is disappointing. He should just send them home. Save their lives. They should not have to pay for his stupidity!","commenter_a":"Everyone else has to do this and so do you,Depp!","post_message":"Depp is in Australia to shoot the fifth edition of of the Caribbean, called Men Tell No Tales.\""}]
