[{"comment_id":"1296742057059213","commenter_b":"She is trifling","commenter_a":"This bitch stealing, got caught and now trying to act tough and threaten someone who is working to make a living for themselves. That bitch need to get a reality check and her welfare check taken. Cussing in front of her kid and possibly fighting and then what? Just sad.","post_message":"Rachet behavior at it's finest! #WSHH"},{"comment_id":"891182254405684","commenter_b":"He has already done a better job than Obama ishani August ,why don't you move to Cuba or the middle east,there you would find out what \"raping \" in a country is all about.do you feel safe with open borders?","commenter_a":"I am just so proud of President Trump, he is keeping his promesses, he is a man of his word. Wait until he gets sworn in, things will start moving for great changes.","post_message":"Do you support our president, Donald Trump? Comment YES or NO."},{"comment_id":"10154336325219062","commenter_b":"Bradley Darrell see above message..","commenter_a":"To suggest the Pope has a liberal agenda is just showing ignorance. Conservatives claiming the Pope is pro-gay, pro-abortion, anti-marriage, blah,blah. The Pope has never said he agrees with those things, he has said it's not his place to judge others who have that life style. Just like Jesus would do today. He loves everyone without reservation. Something sorely lacking in today's society.","post_message":"Pope Francis says addressing climate change `can no longer be left to a future generation'"},{"comment_id":"1086763938002529","commenter_b":"\"The dangers of muslims...\" Yes, because American muslims have just been attacking other Americans day after day for years. Oh im sure theyre just waiting right? And in 10 years theyll still be waiting? And in 20, still waiting...","commenter_a":"Trying to desensitize the American people of the dangers of muslims.","post_message":"\"Mohamed Ahmed is not at a disadvantage because he's Muslim: On the contrary, as the reaction from Obama and the fawning media shows, he's privileged.\""},{"comment_id":"10153310258470090","commenter_b":"www.thefightforjustice.com Former bank employee goes head to head in the courtroom against bank and lawfirm-10 years and counting- Many exposed and the list is growing!","commenter_a":"Hideously profane y","post_message":"All of the above. We want to know WHY you don't want another Clinton in the White House. Tell us here: @webpagelink"},{"comment_id":"10153218753159270","commenter_b":"God will deal with this! He did it once.","commenter_a":"But your only going to enforce Christians to marry gays, but muslims can do whatever they want?","post_message":""},{"comment_id":"1787974808090517","commenter_b":"When a woman as dumb as a rock has been a Senator, Secy of State, and candidate for president of the USA, my God , makes one wonder how many ignorant people have voted for her.","commenter_a":"awwwww wasn't trained???? They keep saying she's so \"intelligent\" and the most \"Qualified\". Everything about her is BS! The absolute worst Democratic candidate EVER!","post_message":"A senior Department of State official claimed there is no documentation showing former Secretary of State Hillary Clinton ever received training in the proper handling of classified materials, according to a June 30 Department of Justice filing in U.S. District Court."}]
