[{"comment_id":"1647007322270889","commenter_b":"@username great values you're teaching your kid. Enjoy karma","commenter_a":"Yeah well cyclists need to be safer, in Utah they over take actual roads holding up traffic passing people off.","post_message":"Biking in America is way too dangerous. (Video: ATTN:)"},{"comment_id":"423132557811339","commenter_b":"Al Sharpton is a racist !","commenter_a":"Afraid this will spread as it has in the past.","post_message":"Could this violence against police spread around the country?"},{"comment_id":"10154011395049778","commenter_b":"Women get less pay than men so I guess the bill won't be worth the face value","commenter_a":"I really couldn't careless as long as the bill still spends the same.","post_message":"A woman will appear on the $10 bill beginning in 2020, the Treasury Department said Wednesday."},{"comment_id":"10154273647523812","commenter_b":"Hell no!!!!","commenter_a":"@username so no beach this weekend","post_message":"Aerial video shows large school of sharks seen in Fort Lauderdale, Florida."},{"comment_id":"10153493676581770","commenter_b":"Them bitches will kill you quick as their men.its their belief.","commenter_a":"It's about time!","post_message":"A collection of brave individuals acting on behalf of a little-known non-profit is running daring operations to free Islamic State sex slaves, including literally cutting the chains binding a woman to a bed."},{"comment_id":"10153837280246051","commenter_b":"@username I totally agree with you! If people would not hire illegals at the first place, illegals would not be in the USA!","commenter_a":"The end! \"Beating the system\", fucking seriously! There is a system for a reason. How many people do it the right way and how many are unable to do so because of people like her and her family \"beating the system\"! Her scholarship should be revoked!","post_message":"This Yale-bound valedictorian stood in front of her entire school and made an announcement that stunned everyone:"},{"comment_id":"10153580246221636","commenter_b":"Where we going? X","commenter_a":"@username when that degrees done, emigrate xx","post_message":"It's getting more and more expensive being a student"}]
