[{"comment_id":"1104371989582553","commenter_b":"Don't kiss any bugs, Suzanne--even if they swear they'll turn into a handsome prince. Only frogs for that.","commenter_a":"Thanks for that. I'll be obsessing on this for weeks now.","post_message":"“Kissing bugs” may sound sweet, but they have infected at least 12 people in Texas with a parasite that causes a deadly disease. >>kiro.tv/KissingBug"},{"comment_id":"10152896761617293","commenter_b":"and the mob was mad when he called thm out too .... NEXT!! -","commenter_a":"Nothing like calling them as he (and most of the rest of the world) sees 'em!","post_message":"\"Currently, an evil front is being formed against us,\" he said. \"Now the pope has joined this conspiracy.\""},{"comment_id":"10152717878976770","commenter_b":"Too many nut-jobs in higher education these days. Bet she sues the school if she gets sunburn.","commenter_a":"Stupid is as stupid does and we all know you can't fix stupid.","post_message":"We're pretty sure that's not going to work..."},{"comment_id":"10152918950086336","commenter_b":"What a doll!","commenter_a":"What a cutie and smart too!","post_message":"An incredibly brave 4-year-old girl is being credited with saving her pregnant mother who suffered a seizure and couldn't reach the phone."},{"comment_id":"10153396293173525","commenter_b":"@username, yes I do know that. It has never happened despite 45 of 50 states allowing open carry, and some that have NEVER PROHIBITED it since they became states. No open carrier has ever been \"taken out' by a criminal.","commenter_a":"Kinda think it's dumb. Makes you a target basically. Someone will see ur gun and be like let me take them out first... Ya kno... Element of surprise is better.","post_message":"OPEN CARRY: The same law that's being proposed here in Florida just went into effect in Texas, and to celebrate, several groups rallied at the State Capitol carrying their guns. STORY: @webpagelink"},{"comment_id":"811714602251233","commenter_b":"Shut up murdering swine","commenter_a":"You forgot to add that the sky is falling!!!","post_message":"So it begins... If you think the GOP bashing of President Obama has been bad, watch what they do to Hillary."},{"comment_id":"1345400498836549","commenter_b":"They need to go in and kill every one of those cockroaches.","commenter_a":"DUH !!!","post_message":"QUITE ALARMING FOR EVERY WESTERN COUNTRY!"}]
