[{"comment_id":"10153948445168812","commenter_b":"you gonna adopt it?","commenter_a":"And for Christmas the pup should be freed from its current owners and gifted to a loving home.","post_message":"A pup from Hardin County, Iowa, got a sweet surprise this Thanksgiving when she was gifted a brand new dog house after living outside for almost three years."},{"comment_id":"962171047226860","commenter_b":"She's a loser. She should stay with a loser.","commenter_a":"Well it's about time! Now she and Hillary can be together.","post_message":"Breaking: Huma Abedin announces she's separating from Anthony Weiner one day after husband's new sexts emerge."},{"comment_id":"10154719758246729","commenter_b":"It's Kommiefornia. What do you expext! The same state that protects murdering illegals and ignores the FEDS!","commenter_a":"Yes, the word conceal is not used, however to bear arms is, so I guess we must be back to open carry, a 45 on every hip. I hope you don't mind if I should play the Rifleman as Chuck Connors can not.","post_message":"\"Shall not be infringed,\" right? Wrong."},{"comment_id":"10154156972868984","commenter_b":"ONE MORE TIME TO ALL OF YOU WHO BELIEVE THAT ALL OF US ARE INNOCENT OF EVERYTHING UNTIL WE ARE CHARGED AND THEN FOUND GUILTY IN A COURT OF LAW! IF THIS WAS YOU, A FAMILY MEMBER OR A FRIEND WOULD YOU GO SCREAMING JAIL THE SOB OR BITCH? OUR JUDICIAL SYSTEM IS BASED ON \"THE wPRESUMPTION IF INNOCENCE\" THAT ASSUMPTION PROTECTS ALL OF US FROM BEING JAILED WITHOUT DUE PROCESS! A FEW OF YOU BRING UP GENERAL PETREAUS, HE WAS A GREAT GENERAL AND IS AN HONORABLE MAN BUT HE PLEAD GUILTY OF ALL CHARGES INCLUDING DIVULGING HIGHLY CLASSIFIED INFORMATION TO HIS BIOGRAPHER WHOM HE WAS ALSO HAVING AN AFFAIR WITH. HILLARY HAS DENIED ALL CHARGES, WHICH IS ALSO HER LEGAL RIGHT UNDER OUR SYSTEM OF JUSTICE, AND NOW THE DOJ IN CONCERT WITH WHATEVER THE FBI CAN DERIVE FROM THEIR INVESTIGATION MUST PROVE THAT SHE IS GUILTY IN ...","commenter_a":"Dems are majority lawyers. Lawyers believe that if lies are stated long enough, they're perceived as truth and once a statement is made, it can't be undone. You can never un-ring the bell. She will continue to lie until way after she's indicted.","post_message":"Hillary Clinton just keeps digging herself deeper with this one... Is she your absolute LAST choice for president?"},{"comment_id":"10153810212319087","commenter_b":"stupid picture talking bitch. @webpagelink","commenter_a":"this is good. \"Rarely does a presidential election hit the unthinkable issues that can completely divide a nation and endanger the peace and security of that nation. It seems Donald Trump is poised to kick down doors concealing issues that mainstream media and mainstream candidates fear to even discuss. The competence level of our leaders in government and their weak attempt to compete in world markets is one of this countries forbidden issues. The other forbidden issue is the democratic party position that Islam has nothing to do with violence, as opposed to Donald Trump explosive position that hates us. It a good bet that America is about to get an education in what Islam represents and what its intentions are, as perceived by Donald Trump. I believe the two afore stated issues will sharply divide the American electorate and could possibly threaten the peace in some instances. Donald Trump ...","post_message":"Here are five of the most important primary fights to watch this month that could determine who will win this fall's battle for control of Congress."},{"comment_id":"997631186950175","commenter_b":"That would be a terrible thing to do and there are many who would adopt that precious child","commenter_a":"Well if I was pregnant with a fetus with Down's Syndrome I would abort the fetus. Not everyone can raise a special needs child. I would not put it up for adoption, that would not be an option. That's just my opinion.","post_message":"Yes it does!"},{"comment_id":"10153914215895950","commenter_b":"Go fuck your cousin you wrong turn hillbilly bitch","commenter_a":"11 kids 10 women(I can only imagine what they look like...) there'll be no problem finding pallbearers for this one...Goodbye & Good Luck...","post_message":"Police say Walker, a.k.a. Shawty Lo, may have been the victim of a hit and run."}]
