[{"comment_id":"1430173077011648","commenter_b":"Crazy lady!","commenter_a":"Vote Trump all the way to the White House. This country is a business and should be run by a businessman. We have seen what the politicians have done to this country. Trump was self-funded and owes no one. It is time we the people donate to Donald Trump so he is not forced to accept special interest money. I don care how rich he is, he can keep bleeding money, let help him. It should be the American people that Trump owes and not special interest. Go Trump all the way to the White House. Make America Great Again! All aboard the Trump Train! Take America Back from CAIR, MOVE ON, BLM, Muslim Brotherhood and Liberal Terrorist!!!!! Vote Trump, bring jobs to America. Vote Trump if you want to get rid of unfair trade agreements..Save our Country!!!!!!!!!!! Keep out the refugee terrorists!!!! Save our countries jobs!!!! And a side ...","post_message":"Gee, wonder why?"},{"comment_id":"10153228787618984","commenter_b":"Well he still did his job get unlicensed uninsured drivers off the streets. They are a huge reason insurance prices are so dam high. Besides Mexicans from across the boarder are becoming the majority especially in states like Arizona!! I'd vote for Sheriff Joe every day of the week and twice on Sunday.","commenter_a":"More LE needs to do that to rid America of the damn illegals","post_message":"I cannot believe he admitted this. Liberals will be giddy. He'll really need his supporters to step up now... Do you still support Sheriff Joe Arpaio?"},{"comment_id":"10155711262144657","commenter_b":"Yep!","commenter_a":"He already does......see Trumpsters have always had a direction to Trump.....we do not CNN Clinton news nerwork or any other left stream bias pieces of crap. This way we get the info before lamestream media manipulates it.","post_message":"Calm down, everyone."},{"comment_id":"735262859947913","commenter_b":"If Melania was one of my students, she would be sitting in my office now for a little chat about plagiarism and the consequences according to school policy. Similar to students in the past, she is defensive and blaming others for her plagiarism.","commenter_a":"And the Deval Patrick 10/15/06 vs President Obama 2/8/16","post_message":"Compare Melania Trump’s speech with Michelle Obama’s 2008 speech. Donald J. Trump campaign denies the speech plagiarizes parts of Michelle Obama's: @webpagelink"},{"comment_id":"10153924246056800","commenter_b":"Bye Felicia","commenter_a":"I can't! Im done with this show....this used to be one of my favorite shows that would tell it more or less like it was. But now its just a one sided political agenda. Goodbye daily show may you rest in peace","post_message":"Activist DeRay Mckesson talks about the tenets of the Black Lives Matter movement."},{"comment_id":"486290274888721","commenter_b":"Bernie sit yo old ass down u is not gonna win nother","commenter_a":"it's beneficial being educated in this!","post_message":"There is a BIG difference!"},{"comment_id":"10153522112557690","commenter_b":"Amen","commenter_a":"Rest well kiddo !!! Hope your fam find some comfort in the lord !!!! From him we came and to him we shall return!!!","post_message":"Police say a Denton teenager died after being struck by an SUV while trying to cross the street. @webpagelink"}]
