[{"comment_id":"936069706469980","commenter_b":"Colleen Boulden Jj Kane","commenter_a":"Ryan Lindgren take me here !","post_message":"Clark Griswold would be envious of this home on Prior Road in Wilmington, Delaware. The huge Christmas light display caught the attention of the SkyForce10 team while they were flying to another story. The set-up even has a walk-through section. Share your favorite lights displays with us here on Facebook or through the NBC10 app!"},{"comment_id":"10152762818573635","commenter_b":"And little girls whose only purpose is to bear little boys?","commenter_a":"The world needs little b o y s to become husbands, fathers, governors, farmers, presidents, and the righteous church leaders who exalt Jesus Christ \"who o n l y\" was crucified for world sin, and to whom only we bow and worship.","post_message":"\"The choice to not have children is selfish. Life rejuvenates and acquires energy when it multiplies: It is enriched, not impoverished! Children learn to take charge of their family, they mature in the sharing of sacrifices, and they grow in appreciation of its gifts.\""},{"comment_id":"10153055349059170","commenter_b":"Nah he's not Indian. Fake birth certificate. He wants his muslim army to overtake America.","commenter_a":"Bobby has it right. He's a great Patriot. Would make a great president.","post_message":"To those who want to silence talk of God - because they're afraid of how it will affect election outcomes - reconsider your priorities. Looks like Bobby Jindal has this right. (And in no way did he mean what is critic here thinks he meant.)"},{"comment_id":"1353412211336912","commenter_b":"Women outlive men because they don't marry women!","commenter_a":"Good grief, it's been known for eons that women have greater endurance, etc., etc. I'm reminded of a book written in the 1950s by noted anthropologist Ashley-Montagu, entitled \"The Natural Superiority of Women.\" The male anatomy excels in only one area: upper body strength, a left-over from prehistoric humans. Ashley-Montagu is not by any means the first to recognize and write about this. It should be obvious to anyone, really, when you recognize that, despite the physical ravages of child-bearing, women live longer than men.","post_message":"Questions about Clinton’s health just won’t go away — partly because they fit so neatly with longstanding sexist tropes about women’s weakness."},{"comment_id":"10153898443761770","commenter_b":"In GOD we TRUST....Vote for Trump/Pence 2016..Hillary hate guns because dangerous to the toddlers!!! But In the GOD's name why she's ok to rip out the unborn 9 months in the womb...and Hillary sharing our national classify to others and exchange to pay her ...GOD bless American people to support Trump... because only Trump/Pence can stop government corrupt, bring job, boom the economy, protect our family and help veterans, military and make America safe and great again... that Hillary been extremely careless to protect our national security....and Trump will stop Hillary accepting money from foreign country that treat LGBTQ and women like animal... and Hillary call all my Africa-American friends \"SUPER PREDATOR \" and insulting all my Latinos & Latinas \"NEEDY & BOWL of TACO\"","commenter_a":"Who gives a damn","post_message":"Nate Schmidt of the Washington Capitals sits down with David Hookstead to talk about life as an NHL player."},{"comment_id":"10153833805055329","commenter_b":"@username Jordani SIM!!!","commenter_a":":') @username @username Sam Powers","post_message":"Right in the feels. Hayao Miyazaki"},{"comment_id":"1893598704195217","commenter_b":"@username oh I know how to read... Someone is benefiting.","commenter_a":"At least revenue will be generated from taxes! 👍🏼","post_message":"THIS JUST IN: Proposition 64, which legalizes recreational marijuana use, has been approved by California voters. Here's everything you need to know: @webpagelink"}]
