[{"comment_id":"10153739265536323","commenter_b":"Plus 50 year old lesbians aren't click magnets :)","commenter_a":"The girls in the photo look like teenagers! Not 50 year old women.","post_message":"An emotional conundrum."},{"comment_id":"10152892433531051","commenter_b":"What about the elderly and the disabled you stupid bitch.","commenter_a":"If you don't have Children, You shouldn't be drawing food Stamps!!\"","post_message":"This state just kicked 9,000 people off food stamps."},{"comment_id":"10153888700337464","commenter_b":"You gotta get all the brainless and illegals to stop voting democrats, its the democrats that arm criminals but prevent legal law abiding people to legaly arm themselves","commenter_a":"What happened to carson?","post_message":"Justice Scalia’s passing tonight underscores the stakes of this election. Voters must determine who on this stage has the judgement to nominate and confirm principled constitutionalists to the court."},{"comment_id":"1766871976928173","commenter_b":"We have no idea what he's going to do, he's never been given a chance, The Clintons however.....what have they done? Let's see, when in office 1 went on trial for impeachment. The other has numerous investigations against her for treason, putting our national security at risk multiple times, accusations of selling American uranium to Russian companies in exchange for massive donations to \"The Clinton Foundation\" who was soliciting funds to send to the Haitians who were devastated by one of the worst earthquakes in history, yet only received a small fraction of what was raised......and while consumed with sealing her deal with the Russians, neglected action in Benghazi which cost the lives of US soldiers......... So, I don't know what Trump will do, but if I had to pick between the lesser of two evils, I would say you can't get much more evil than that witch who camouflages ...","commenter_a":"We truely don't want him in our state. We have his lil brother John Bel Boma and that is enough. We'll just hold on until Trump wins.","post_message":"Dear Mr. President: How’s the vacation going on Martha’s Vineyard? Pretty swell place for sure. Ocean breeze, beautiful homes, and packed out with America’s top 1% of the 1%—you must be in your element. And golf? I’m sure you’re playing so much golf, you’re getting almost tired of it. But then, you never tire of golf. You just seem to tire of that “Presidency thing.” My neighbors in Louisiana aren’t having it so good, Mr. President. They are underwater—again. Historic floods that have impacted or destroyed 40,000 homes and left thousands of families homeless are sure ruining their hopes for a summer vacation this year. Probably will take away hopes for a summer vacation next year as well. Their once nice homes are now waterfront property. In fact their homes don’t just front the water—they are IN the water and the water is in them. I realize that in the ..."},{"comment_id":"10152774559661051","commenter_b":"He Should criticizing Christians when so many muslims are creating problems all around the world.","commenter_a":"Rot in hell.","post_message":"President Obama says Christians should stop criticizing Islam because \"people committed terrible deeds in the name of Christ.\" And he didn't stop there."},{"comment_id":"537911889728124","commenter_b":"Public service would be great; picking up road trash; working in the parks; finding real jobs and repaying money bilked from you and me. OR, whatever; probably don't need to put them in already over-crowded prisons; make them work, not get free room and board in jail.","commenter_a":"Yes indeed","post_message":"It's about time! Do you think all welfare abusers should be arrested?"},{"comment_id":"369558209835168","commenter_b":"She's going to die","commenter_a":"Lesley has asthma and she wants to come @username Christian Canales @username @username","post_message":"People living in Galena Park are being told to shelter in place because of a sulfur dioxide release at a Pasadena refining system. This is viewer video from Geno Salinas. Story --> @webpagelink"}]
