[{"comment_id":"10153198316596336","commenter_b":"Wilma Loo...Who LOVES you Girlfriend ? ;-)","commenter_a":"Translation:We hid the money in offshore accounts in tax evading countries,wiped our servers clean,burned all copies and rewrote history.Nothing to see here,move along,move along.","post_message":"“We made mistakes.” The Clinton Foundation has issued a statement after improperly reporting some of its donations. @webpagelink"},{"comment_id":"10152922886022377","commenter_b":"Lock her up and throw away the key!!!","commenter_a":"Her mug shot will be her best picture.","post_message":"Criminal charges coming soon for Hillary Clinton?"},{"comment_id":"10153543031078812","commenter_b":"If you are crossing borders illegally... You broke the law, entered our country without proper credentials and then I'm suppose to foot the bill? Hell no, if I have to follow the rules, then so should the ILLEGAL immigrants!!!","commenter_a":"In my opinion he offended not only #mexicans but all imigrantes that have to cross any border w/ USA. MY RESPECT to anyone that comes to the USA trying to have a better life.","post_message":"NEW: Univision dropping Miss USA pageant and cutting all business ties with Donald Trump over comments about Mexican immigrants: @webpagelink"},{"comment_id":"900098320056924","commenter_b":"What a stupid bitch","commenter_a":"Carmen Favela girls dick ride the shit out of drake 😂😂","post_message":"Drake Fan Calls Cops On Meek Mill & Rats Him Out To His Probation Officer For Threatening Drizzy!"},{"comment_id":"10153767520167994","commenter_b":"Alicia Anne , try Jennie Craig","commenter_a":"I no longer have any remorse for anyone in an accident. I see drivers acting like morons every morning and every night...until they start acting like humans, people will continue to die. Michigan drivers are all a bunch of morons.","post_message":"The Davison Freeway westbound remains closed as investigators comb the scene where a man was killed in a crash."},{"comment_id":"10154959476789411","commenter_b":"@username president Melania Trump after Pence. Lollll","commenter_a":"\"Psychologists tell us that 3 and 4 year olds often lie to get their way because they don’t have a moral understanding of the importance of telling the truth. 4 and 5 year olds often bully other children because bullying is a way of asserting their dominance and making themselves feel more secure in a world that is beginning to seem very scary. 5 and 6 year olds are often thin-skinned and vindictive toward peers who criticize or make fun of them because they are at a stage when they have exaggerated concerns about the opinions of others toward them. 6 and 7 year olds are often excessively narcissistic because they don’t understand their place in the world and haven’t yet developed the moral capacity for empathy. It follows that Donald Trump’s emotional age is somewhere between 3 and 7. Assuming that the Electoral College makes him President on December ...","post_message":"Unlike most presidents, Carter has refused to let his successors do the job they were elected to do. On Jan. 20, he will be pushed aside by Obama."},{"comment_id":"1344505415570466","commenter_b":"yes 1999 ...only recently explore in earnest","commenter_a":"Actually it was found few years ago.","post_message":""}]
