[{"comment_id":"1347295655336172","commenter_b":"Go touch your vagina","commenter_a":"I hear bruce","post_message":"Caitlyn Jenner is speaking out after Trump withdrew protection for trans students."},{"comment_id":"10152978558206051","commenter_b":"Ive seen mothers making babies for the purpose of the money BULLSHIT lazy ass mothers","commenter_a":"if you're TOO POSH to push STOP HAVING BABIES :p","post_message":"This pregnant mom of 11 gets $60,000 per year in benefits, but she still wants the government to pay for a c-section for her next baby. And that's not her only request."},{"comment_id":"1552392261455878","commenter_b":"You forgot to show the filthy, disgusting women in vagina costumes.","commenter_a":"I'm sick of vagina.","post_message":"Congratulations to the women marching around the world today. We will not go back to the days when women had to risk their lives to end a pregnancy. The decision to have an abortion must remain one for a woman, not the government. And we will not go backward to a time before Planned Parenthood, when millions of women had no access to birth control or cancer screenings. We must go forward to ensure full reproductive justice for all women."},{"comment_id":"10154596759964166","commenter_b":"Only applies to men though... Women can murder their babies. Just ask killery","commenter_a":"What is \"feticide\" ?","post_message":"JUST IN: The man accused of killing a pregnant teacher and dumping her body has bonded out of jail. His bond was set at $500,000."},{"comment_id":"1550216494995180","commenter_b":"I think Parkinsons...she looks like hell in that picture. Go home Killary and be a grandma","commenter_a":"I don't get the whole thing of her making appearances looking like a crazy cat lady. She's either sick, gone off the deep end, or trying to pull something. I don't know which, but she really just needs to find something else to do. She can still have a full life, but this is over.","post_message":"“As a Democrat, I am frustrated and ashamed. Unlike Hillary Clinton, I realize that America’s history was built not just on its gallant winners but also on its noble losers.” — Bryan Dean Wright, former CIA ops officer and member of the Democratic Party"},{"comment_id":"10154459591051320","commenter_b":"A Man hungry woman will sale their children's soul to keep a man at whatever price...Sad to say ...but true.","commenter_a":"I don't get how the mother didn't know. I'm sure this poor little girl had to be showing signs of withdrawing from people, especially him. She had to be acting different. Jesus this was going on for 5 years under this woman's nose. It's so sad that this child had no one to go to and kept this secret up to this point. I pray they don't let her have this baby. And for all you right to lifers, I'm sorry, this is a 13 year old child who shouldn't be expected to keep a baby resulting from a rape, when she's a baby herself. I pray that she doesn't have severe emotional scarring and other issues. Poor child... Smh. As for the POS, I hope they split him in half in prison and he bleeds to death.","post_message":"Disgusting: Police say Mark Sutton had been raping his girlfriend's daughter since she was 8-years-old. The mother found out when she took her 13-year-old daughter to the hospital and discovered she was four months pregnant."},{"comment_id":"1190103767694524","commenter_b":"SOROS supposedly promised her the election so that is why she thinks she has it. THEY WERENT COUNTING ON TRUMP TO TAKE OVER!!! LOL GO TO HELL BITCH> WE NEED TRUMP NOT SOME GANGSTER BITCH AND HER CULT!!!","commenter_a":"Nobody bothers to mention that the last time the Clintons were in the white house they stole furniture and silverware and were forced to pay or return it.","post_message":"Hillary thinks she's already won. This kind of sick behavior is UNACCEPTABLE in a constitutional republic!"}]
