[{"comment_id":"10153913161040329","commenter_b":"\"Suck you dry and take you out for lunch\" she's a country lass, it is obvious: barley, then gooseberries.","commenter_a":"I couldn't actually finish reading it because it made me feel physically sick. Subhuman intellect isn't something to broadcast proudly, you misogynistic douchebags.","post_message":"\"It's people like you who make it clear women should never have been given rights.\""},{"comment_id":"485687248279822","commenter_b":"The problem is when she decided to do this job the law was different. Leave her alone. Why should she be penalized for her beliefs?","commenter_a":"she, does not want to work....so go home lady","post_message":"If you can't do your job, maybe you shouldn't have it..."},{"comment_id":"10152738606735950","commenter_b":"What an asshole!","commenter_a":"That makes me happy","post_message":"WATCH: First Lady Michelle Obama shows off her dance moves during the annual White House Easter egg roll @webpagelink"},{"comment_id":"10153929310543037","commenter_b":"Lesbians get their own series since they probably could beat the guys, @webpagelink","commenter_a":"This event is unfair....lesbians have a total advantage. ;-)","post_message":"The event will host 200 teams with 5,000 people."},{"comment_id":"967042846696781","commenter_b":"No. Smokers gotta find their own way outta hell...not on my tax dollar tganks!","commenter_a":"If you really want to quit smoking you can afford to buy it as cigarettes cost a fortune, put the money to better use","post_message":"Controversial..."},{"comment_id":"1672968102966647","commenter_b":"@username If she's 201 lbs I'm a dolphin.","commenter_a":"Plus sized? She's not even rubenesque. A way to help Sports Illustrated tell if their model is plus size or not to ask ask \"if we don't tell people she is plus size, will anyone know?\"","post_message":"A trailblazing move by Sports Illustrated Swimsuit."},{"comment_id":"670286056475622","commenter_b":"@username Andrew Givney","commenter_a":"Jordan Monroe","post_message":"'Tis the season to turn up."}]
