[{"comment_id":"1284672578275634","commenter_b":"The woman is Wacko !!","commenter_a":"And so are the Subpoenas!","post_message":"Six weeks after the election, email leaks are plaguing Hillary Clinton."},{"comment_id":"10155495328191509","commenter_b":"@username you should be ashamed voting a criminal!!!","commenter_a":"Could we think less of him? Really, he's been in the public eye for 30 years. We know what he is and she is. I'm not voting for a person. I am voting for the economy, the Supreme court, and the best chance for the US.","post_message":"Garry Kasparov suggested that the Russians could possess information on Donald J. Trump that is at least as damaging as WikiLeaks releases have been for Hillary Clinton."},{"comment_id":"676882525784251","commenter_b":"STOP IT !","commenter_a":"When did this actually happen? Yikes...............","post_message":"An oil spill the size of Manhattan is devastating the Gulf of Mexico, and nobody's talking about it. #MicBrights"},{"comment_id":"10153567569125927","commenter_b":"The history of Islam counters everything he says about it. No surprise as he must have flunked history.","commenter_a":"pathological liar","post_message":"\"A perversion of Islam that has taken root ... that is appealing to even folks who don't necessarily know anything about Islam, and aren't even practicing Islam in any serious way ...\""},{"comment_id":"711583065610489","commenter_b":"He hates America and the American people, why cant people see that...","commenter_a":"He is a Traitor and Muslim.","post_message":""},{"comment_id":"10153386535509099","commenter_b":"What shame. Thought most grown women are maternal. I was right \"MOST\" not all.","commenter_a":"Maybe we should stay home with our babies.","post_message":"A hidden nanny cam captured more alleged abuse against the 3-year-old girl and 1-year-old twins @webpagelink"},{"comment_id":"897189237043996","commenter_b":"No I hope not we need Hillary to run in 2016 . With all her baggage she will guarantee a Republican in the White House . She will be so busy trying to cover her tracks in crimes she won't have time to campaign ! And Billy's little visits to Orgy Island is going to be the next ship to sail !","commenter_a":"Hillary will walk all over him!","post_message":"He went to high school with Jeb Bush."}]
