[{"comment_id":"882172088504463","commenter_b":"Do you guys know Bernie is a SOCIALIST.. A SOCIALIST !!!! why do you guys hate America so much, I tell you why, because YOU HAVE NO IDEA HOW IT IS TO LIVE IN A SOCIALIST SYSTEM , go to any South American Coutry , tell any parson who have lived under this system that YOU support a Socialist in America, be careful you might get your ass kicked due to stupidity ...pick a Socialist country, live there for 6 months then wee talk ....IGNORANT!!!!!!!","commenter_a":"It's one thing to get elected as Mayor of Burlington, VT, then, Congress, and the US Senate with a population of 800,000 where $5 or $10 makes a difference and running for President. We all know the game is fixed. And, as an incumbent, it was fixed in his favor.","post_message":"Five years ago, the Supreme Court issued what I think is one of the most disastrous decisions in its history, Citizens United v. FEC. Billionaires buying elections is not what our Constitution stands for. Add your name to my petition if you agree that our democracy is not for sale: @webpagelink"},{"comment_id":"1220911264593201","commenter_b":"@username who is illegal stupid!!!","commenter_a":"FINAL, now THAT is something to celebrate because: #BarackObama is a sociopathic liar, a national disgrace, an enemy of the Constitution, racially divisive, a promoter of black genocide by abortion, denies the threat of radical Islam and then supports that threat, a communist sympathizer and a traitor to civilization. That is his legacy.","post_message":"SATURDAY: Watch President Obama's final White House Correspondents' Dinner - LIVE on C-SPAN (TV) and here on C-SPAN's Facebook page. More here: @webpagelink"},{"comment_id":"10154260147516051","commenter_b":"@username you ignorant bitch !!! If the illegals voted and they can't vote then how did they vote if they are illegals ????dumb ass !!! You racist ass bitch !!!","commenter_a":"The majority of Americans elected Mr Trump. Millions of Clinton votes were cast by illegals who had no right to vote. You people need to respect the process and get over it","post_message":"The majority of Americans dispute Trump's right to rule since he lost the popular vote by almost two million votes. Do you think the candidate who gets the most votes should win?"},{"comment_id":"10153792156382439","commenter_b":"I would be pulling my children out of that school and looking for a different country to live in... preferably muslim free....","commenter_a":"Sounds a lot like how they kicked of the 3rd Reich.","post_message":"As part of a school project, German children are required to cook and clean and change the bed linens for refugees. The host country becomes subservient to the invaders. A letter written by the Schleswig-Holstein Ministry of Education and Vocational Training, says “pupils will spend a day in a transit accommodation and help for example, fix up as beds as well as help in the collection of donations.“"},{"comment_id":"618380188311949","commenter_b":"Go home? Come back Nikki, come back!","commenter_a":"I've hated being called \"Nikki\" all my life as a nickname, but in Prince's honor, I guess I'll go home and get my grind on. :-(","post_message":""},{"comment_id":"10153942859244024","commenter_b":"Let's ban YOU !","commenter_a":"Disgraceful","post_message":"He supposedly got \"PTSD\" from shooting an AR-15 and now wants to ban \"God Bless America\" from baseball games. @webpagelink"},{"comment_id":"477777845756672","commenter_b":"Bull Crap, Hillary.","commenter_a":"Please take a good look at Chicago !!!","post_message":"Hillary Clinton's answer to crime is always to just crack down on law-abiding gun owners - not law breakers. But the American public is seeing through her gun control lies for what they really are: meaningless rhetoric."}]
