[{"comment_id":"1037567749698799","commenter_b":"Facebook is trying to silence him tonite","commenter_a":"Completely cut off","post_message":"Watch Live: Donald J. Trump holds a rally in Sterling Heights, Michigan."},{"comment_id":"975573942535660","commenter_b":"I'm not American but,I live here and I love to live here!And Hope to be in army or something one day I think dems are so much smarter! Let's go dems!","commenter_a":"brain dead","post_message":"RIGHT ON! Bernie just hit it out of the park at the Democratic debate when asked if he's a capitalist."},{"comment_id":"10153131166411051","commenter_b":"Muslims, get out of our country, go to where you are sickheaded and treat others like dirt..we don't want you here..you are sick and so disrespected..we can't stand you or your way of thinking.","commenter_a":"I'll continue to do things the way I normaly do. If you are offended by it then that's you're problem.","post_message":"A woman's painting was rejected because it might offend some Muslims. Decide for yourselves if there's anything wrong with the image."},{"comment_id":"10153383704554411","commenter_b":"Examples?","commenter_a":"Texas has always been a disaster.","post_message":""},{"comment_id":"1820054648241595","commenter_b":"I agree the farther him an his tranny wife are from the white house the better !","commenter_a":"What is wrong with you people. Thank God he's on vacation and not going to get involved and make things worse!","post_message":"Nothing gets in the way of Barack Obama's golf game."},{"comment_id":"10154864481904170","commenter_b":"I know enough about Trump and Clinton. Only one has committed crimes worthy of prison time. Can't dispute facts.","commenter_a":"Ivanka is an amazing woman which demonstrates that President Trump is not only successful in business, but with his family too. A real winner in every sense of the word. #MAGA","post_message":"This should get people's attention."},{"comment_id":"10153997969131770","commenter_b":"No we want our WALL","commenter_a":"I bet she does. I want the wall right now.","post_message":"Mexico foreign affairs minister says her dream is OPEN BORDERS, with no walls."}]
