[{"comment_id":"10154787328718984","commenter_b":"Perhaps she should have kept her mouth shut and the White House wouldn't have to protect her!!","commenter_a":"BS....houses don't talk. We are about to witness the biggest revolt on DC and heads will be rolling. Trump will clean house literally. The most crooked leaders plus the worst media in the world. People are po'ed and WE aren't going to take it anymore.","post_message":"Right after Michelle Obama took the stage and launched an attack on Donald J. Trump that sent the media into a frenzy, the White House delivered a message to the Republican candidate that did NOT go unnoticed..."},{"comment_id":"10155892133225231","commenter_b":"Nancy you have the right attitude. The train operators succumbed to some questionabally motivated sour pusses and got a snootful of bad publicity. So dumb. Ladies of that age/demographic have disposable income.","commenter_a":"Laughing and talking too loud? Those are the ladies I want to ride with!","post_message":"They had no idea that laughing and talking \"too loud\" would get them escorted off the train."},{"comment_id":"1541756345884108","commenter_b":"Needs to be castrated","commenter_a":"someone please castrate this idiot","post_message":"The 'abhorrent' paedophile has been jailed for just THREE years"},{"comment_id":"472078136250114","commenter_b":"Haha What a bitch","commenter_a":"Good for them. If they don't like prayer they need to leave the activity. To Hell with them.","post_message":"An atheist group complained about prayers at sporting events. This is how the community responded."},{"comment_id":"1447392598607688","commenter_b":"Style and Clinton DO NOT go together; she dresses worse than a bag lady.","commenter_a":"Oh Lordy, how gross!","post_message":"Hillary Clinton? You mean THAT Hillary Clinton?"},{"comment_id":"10153517844123984","commenter_b":"They needed to know.","commenter_a":"This is the most retarded thing anyone has ever posted on faceboook.","post_message":"Mega-church TV pastor Joel Osteen just made a sickening announcement about Muslims... Spread this absolutely everywhere... the REAL Joel Osteen needs to be exposed. Do you agree that Osteen is a fraud?"},{"comment_id":"10153454248817377","commenter_b":"That is very wired how has Trump got millions more votes than Lyin' ted? Why does Trump almost have a 290 delegate lead? Why Has Trump won most States? Why does Trump only need 53% of remaining delegates to get to 1237 delegates and Lyin' Ted need all but 50 delegates or 92% of the remaining delegates? You may also want to got to real clear politics and recheck your poll.","commenter_a":"Contrary to the media narratives -New York is not the center of the Country - so, It is not a big deal to win your home state. The cheer leaders want other Northeastern States to fall in line behind New York. Conservatives believe that the voters in other Northeastern States have a mind of their own. This is also not a big deal win for Trump because of the all the votes cast for both the Democrats and Republicans running in the NY Primary, only 20% of the Vote went to Trump, even with his, so called, big victory... Which makes it clear that no Republican running is likely to win NY in the General Election. So - this Primary has very little significance for who should be the nominee.","post_message":"Donald J. Trump on New York Primary win:"}]
