[{"comment_id":"10153004550474411","commenter_b":"U shts invaded our lands. Ur the problem.","commenter_a":"ban the Muslim black garbage bags","post_message":""},{"comment_id":"1868221936741025","commenter_b":"@username STUART BAILLIE IS RIGHT. AL SHARPTON IS THE ONLY MORON THAT LOST WEIGHT. ROSIE AND WHOOPI WILL NEED AN AIRBUS TO LEAVE HERE. THEY WILL HAVE TO MAKE A CUSTOMIZED GAS TANK TO HOLD ENOUGH FUEL TO GET IT OFF THE GROUND. NASA HAS ITS WORK CUT OUT FOR SURE. MAYBE THE ENTERPRISE USED ON STAR TREK WOULD WORK. BEAM THEM UP SCOTTIE. WARP 10","commenter_a":"I thought this fat fucking pig was leaving the country if Trump won. Just another piece of shit liar that won't leave as promised.","post_message":"Rosie O'Donnell has a new job."},{"comment_id":"10157183746875725","commenter_b":"#TrumpTrain #Women4Trump #MakeAmericaGreatAgain #BuildTheWall #Vets4Trump","commenter_a":"I live in Australia. I would not want them here. But worse would be Trump. I feel sorry for you all. This will be an election of abstention I think. God Help America.","post_message":"It's clear: scandals and controversies follow the Clintons, who will say and do anything to win."},{"comment_id":"10152776226595047","commenter_b":"stupid anti Christians !","commenter_a":"Can't let them get away with this.","post_message":"General Craig Olson thanked God for his military successes, and asked for prayer for those being deployed at a National Day of Prayer event. Because of his public declaration of his beliefs, an anti-Christian group is demanding he face a court martial. This is outrageous. SIGN & SHARE the petition to fight back: @webpagelink"},{"comment_id":"10153328235374087","commenter_b":"Common ground to Ryan means all his way.","commenter_a":"Ass hole. One of the boys","post_message":"“You know, we have two ears and one mouth,” Paul Ryan said. “We got to use those in that proportion.”"},{"comment_id":"1191540644208167","commenter_b":"Two lesbians using sperm, fornication and evil","commenter_a":"Does this mean the she he cheated on the female? I mean someone had to party load in that right?","post_message":"Fernando Machado and Diane Rodríguez announced their pregnancy, believed to be the first of its kind in South America, on social media."},{"comment_id":"10153344147357439","commenter_b":"Lol is that where Muslims come from? Wow didn't know that!","commenter_a":"Send them back to Egypt.","post_message":"DC Area Professor To Catholic University: Too Many Crosses On Campus For Muslim Students To Pray @webpagelink Anywhere American law and Islamic law conflict, it's American law the inevitably has to give way. These demands for special accommodation are everywhere. Hertz, Heinz, Costco, IKEA, Target, Wal-mart, Disneyland, McDonalds and hundreds of others have all been in the cross-hairs. Islamic demands and the ensuing lawsuits in order to impose sharia...."}]
