[{"comment_id":"940985469275259","commenter_b":"She was a Man Baby!","commenter_a":"What do they do with pictures of Golda Meir, who was prime minister of their own country?","post_message":"Someone should remind this \"news\"paper that we're in the year 2015."},{"comment_id":"10153807572957169","commenter_b":"@username , so all women should quit tomorrow and stay home with their kids. Yeah, that would work out well.","commenter_a":"No, they are not even close to equally important. Your job raising your kid is far more important.","post_message":"It’s time we acknowledge that working parents have two jobs — the one at work and the one at home — and both are equally important to our economy (From PBS NewsHour)"},{"comment_id":"1101281803258742","commenter_b":"Bite me bitch. Ever heard of auto correct.","commenter_a":"This came from the Advocate (our local paper) and I am sharing it because it is exactly how most of us feel about Trump. The Media just doesn't get it....they can't believe that people are so angry that they can no longer be manipulated! Millions of trump supporters feel this way about Donald J. Trump..... \"We don't care if the guy swears... or how many times he's been married...or who he voted for, or what his income tax return shows. We want the problems fixed. Yes he's an egomaniac, but we don't care. We know he's not a racist, or bad to women, or all the other things the liberal media is trying to label him with. We know he's raised a good family, and that says a lot about him. The country is a mess because politicians suck, the Republican Party is two faced & gutless, and illegals are ...","post_message":"Even this focus group by Fox News's Frank Luntz agrees Hillary CRUSHED Trump. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"879492268908016","commenter_b":"I wouldn't vote for the loud mouth scumbag for trash collector. She is the most unlady like female ever. All she does is run her big (I mean BIG) mouth. She just needs to go away with her non American husband and disappear.","commenter_a":"Donald","post_message":"There's a huge movement supporting Michelle making a run at POTUS in 2020. Who would you vote for, Donald Trump or Michelle Obama?"},{"comment_id":"1390094244343935","commenter_b":"I hope she does. Even easier for Trump to win","commenter_a":"No I don't. There are other qualified people.","post_message":"Want to see Elizabeth Warren on Hillary Clinton's White House ticket? It might not be so easy."},{"comment_id":"1218654931501590","commenter_b":"Amen!","commenter_a":"It might have something to do with the fact that they make veteran Officers from other agencies retake the academy if they try to switch to their Department.","post_message":"10News' Phil Buck digging deeper to find out how Hillsborough County Sheriff's Office is still working to keep you safe in spite of deputy shortage @webpagelink"},{"comment_id":"1003687313057656","commenter_b":"The tears flow as I watch and read this... For all of you Christian Conservatives out there, REPUBLICANS IN CONGRESS PARTICULARLY, we need to open our hearts and welcome the Syrian refugees in, otherwise we cannot call ourselves \"CHRISTian\". The refugees will be vetted over a 2-3 year period ~ they're not coming tomorrow. Be compassionate ~ that is what we are about here in the USA, remember our quote on the Statue of Liberty, which was a gift to us from France (!), welcoming immigrants and refugees: \"Give me your tired, your poor, your huddled masses, yearning to be free.\" How about we practice what we're preaching with this message?","commenter_a":"Tears.","post_message":"Watch this and you will get chills. Shared by Occupy Democrats, LIKE our page for more."}]
