[{"comment_id":"10153552801752464","commenter_b":"@username>>>>I like and agree with your post about \"freedom of press\", but I also agree with what Mark posted about \"mainstream media\". The truth is Soros owns most of the news media and everyone , including the media, is getting \"paid off these days. I am even starting to believe that our SCOTUS is getting paid for their votes from what I have been seeing lately. After saying all that, what you say is true that people can pick and choose; but we live in a day of uninterested, uninformed, misinformed people who only go with what they hear the most, whether it is factual or not. Do you ever watch \"Watters World\" on the Bill O'Reilly show, \"The Factor\". It is so discouraging to see people of voting age, especially college kids, who are so uninformed, just dumb about history and politics. Maybe you can find it on YouTube ...","commenter_a":"I'm for @username. Donald Trump has nothing on Cruz, but Cruz has on Trump. Cruz is an honest, God fearing man who has been standing up AGAINST Washington ( Washington Cartel is what Ted calls them) ever since he has been a senator. He has fought against democrats AND republicans FOR the choices of the American people. HE never cowered or gave in to Obama's wishes even though he has been falsely accused and criticized for being against Obama policies that Mitch McConnel and John Boehner gave into.","post_message":"An honor to join thousands of courageous conservatives in South Carolina yesterday who agree now is a time to lead and #DefundPlannedParenthood: @webpagelink"},{"comment_id":"10153255182937452","commenter_b":"Richard Valdez what's up with that street. Last week was the guy and now this. So sad!","commenter_a":"That's what happens when you think cars can fly 😕","post_message":"1 person is dead and another was hospitalized after a head-on collision with a big rig in Gardena."},{"comment_id":"1077408458966678","commenter_b":"Malyk Bonnet, how fortunate for that young woman that you trusted your indtincts and took some very brave action. You ARE a HERO!!!","commenter_a":"Benjamin Fournelle Sylvie Bonin","post_message":"This teen had a hunch, so he hopped on a bus to a different city. He might have saved a life. - Robbie Couch"},{"comment_id":"1250106475030208","commenter_b":"There actually is a move to get women to sign up for the draft right now (though it won't matter because there will likely never be another draft) But you wouldn know about that because the draft is one of the only things meninists have to bitch about. But","commenter_a":"Why arent feminists fight for equal representation in sanitation? Or equal representation is crab fishing? Or equal representation in the draft. Women should sign up for the draft #genderequality","post_message":"\"But in order to help, those of us who do understand have to know what women are up against.\""},{"comment_id":"10153141581576336","commenter_b":"This is because the Tri County area in Mi is one of the largest Muslim areas in the country. I'm sick of it too, this whole scenario is not going to end well for Christians.","commenter_a":"GARBAGE!","post_message":"Students at the University of Michigan successfully petitioned to cancel a campus screening of 'American Sniper' – claiming the film promotes anti-Muslim rhetoric and made them feel unsafe."},{"comment_id":"1252850228086868","commenter_b":"Hang the bitch","commenter_a":"You all just racist that's why you all up all in trumps ass with his bull so take you all racist ass and do what you do best talk mess about real ppl. Trump going to blow your mind when he turns on you and do what's right","post_message":"Hillary Clinton is desperate these days and has even officially taken to getting down on her knees to beg the American people after Congress announced their next big plans for the corrupt Clinton – and the brutal nature of them has got to have Hillary downright horrified. @webpagelink"},{"comment_id":"10153568531759705","commenter_b":"Umm for reals...","commenter_a":"10154509258848856Eva Sellers Uhm, clearly they missed the Jammie era.","post_message":"What's the sexiest decade of sleepwear?"}]
