[{"comment_id":"10153586503151336","commenter_b":"Lmao @username is a pussy cuz a girl made it","commenter_a":"@username @username Cody Wilkerson","post_message":"Two women have made military history by becoming the first female soldiers to complete the U.S. Army's grueling Ranger Course."},{"comment_id":"10152779839917093","commenter_b":"Looks like young man, yes respectful,young man was very patient with his mother for not striking her Yes that was courageous of her to find her child and protect him. God bless you guys. I hope you can see that there is so much unspoken love in this video.","commenter_a":"A mom who cares. Very brave woman!","post_message":"Mom finds her son in the middle of the Baltimore riots... many are calling her Mom of the Year for what she does next. @webpagelink"},{"comment_id":"1137553239588633","commenter_b":"I will not vote for Hi$$ary under any circumstances in November. It will not come to that because Bernie will win as he has the people behind him. They have done everything to suppress Bernie but they will fail. If she steals the nomination with the help of the corrupt DNC and the corporate media then please do as I and many other liberal progressives and take the Bernie or bust pledge. It is way past voting for the lesser of two evils. I refuse to be bullied into supporting her when I know that she is basically a GOP lite and if she is nominated we will lose. I will not help her and my vote is not for sale. So if it ever comes to that, I will cast my vote proudly in November for the only candidate that supports me - Bernie Sanders . I will do ...","commenter_a":"I'm not voting for Bernie as much as I like him only because I'm afraid it will be wasted. He's great but I don't believe he'll be elected. I'm going to lose it if Trump gets in","post_message":""},{"comment_id":"907290132700573","commenter_b":"Grossly misinformed woman, too.","commenter_a":"You reap what you sow, so when your harvest comes in, don't be crying cause it ain't what you wanted. You sow perversion & corruption, you will reap your harvest.","post_message":"Will marriage equality really kill people, cause 900,000 abortions and undermine heterosexual men?"},{"comment_id":"434449293346332","commenter_b":"Oh Cheryl chill out","commenter_a":"Anyone who thinks this is ok and there is at least one person here, (@username, seems to think so) is an idiot.","post_message":"When a student couldn't pay for her lunch, school officials decided to do this with the food instead."},{"comment_id":"1119467821481588","commenter_b":"Yay!!!","commenter_a":"Exactly his point!","post_message":"San Francisco 49ers quarterback Colin Kaepernick says he has received death threats for making his views known"},{"comment_id":"10157371932040500","commenter_b":"Build that wall!","commenter_a":"Lithia FL","post_message":"WFLA Ian Oliver talking about Sunday weather and the latest on the tropics including Invest 99L."}]
