[{"comment_id":"1482924058407143","commenter_b":"lol you're a joke. Dude I'm older than you! But thanks for the compliment!","commenter_a":"Are you serious???? I'm black and this is sooooo ridiculous!!! It is NOT racist! I hate Neegan more than I hate this shirt....because I don't hate the shirt...at all...actually I might buy it! #TWD","post_message":"People are accusing this The Walking Dead T-shirt of being racist — is it? yhoo.it/2kMGla0"},{"comment_id":"494539450746362","commenter_b":"one ugly woman","commenter_a":"Cruz started this slanderous crap and it backfired on him. But he is still trying to blame Trump for a rags publication. But he's right about one thing, we don't give a shit so he can shut the hell up about it. Trump has already moved on.","post_message":"Carly Fiorina accused Donald Trump of being a serial philanderer. Do you think there's any truth to it?"},{"comment_id":"10153356243998908","commenter_b":"I'm sure American Indians don't want those free loaders here either, even legal immigrants who did the hard work to become citizens don't want them here. We need a real President who has the guts to deport these leeches.","commenter_a":"We need a man like him in office now. He deported millions of illegals, he was a great President, unlike our current one.","post_message":"Collective Evolution \"In the councils of government, we must guard against the acquisition of unwarranted influence, whether sought or unsought, by the military industrial complex. The potential for a disastrous rise of misplaced power exists, and will persist.\" - President Eisenhower."},{"comment_id":"10156722273625354","commenter_b":"I hope the whole crowd good her sorry ass.","commenter_a":"And who allows them their STAGE? Disgustingly racial, anti police and presidential common, ticket of 8 yrs. Ugh! Don't buy their future stage!","post_message":"***BLACK PANTHER PARTY SUPPORTER AND BLM RADICAL DONOR BEYONCE OWES AMERICA'S POLICE, ARMED FORCES, & VETERANS AN APOLOGY***"},{"comment_id":"10153910972008812","commenter_b":"it should be 25 to life","commenter_a":"He's gonna be getting plenty of footlongs where he's going lol","post_message":"JUST IN: Ex-Subway spokesman Jared Fogle sentenced to over 15 years in prison after pleading guilty to child pornography charges."},{"comment_id":"10153323760987994","commenter_b":"They are puppy mill dogs. They over breed these poor dogs and none of them ever see a vet...so the puppies are that are born are just as unhealthy....","commenter_a":"I purchased two kittens from there and 1 died within 24hrs, they told me \"bring it back and I'll replace it\", they gave me another one and it died 2 days later along with the other one","post_message":"A Mount Clemens pet store is being sued by nearly a dozen customers."},{"comment_id":"945496635572234","commenter_b":"She is selling us out to the Arabians","commenter_a":"Butcher of Benghazi","post_message":"WATCH LIVE: Hillary Clinton addresses a crowd in Miami to talk Zika virus"}]
