[{"comment_id":"10152926517991491","commenter_b":"A predator is a predator no matter what age they are. I'll bet kids who murder should get away with it based on naivety and hormones too right? Hormones drive alot in a human beings, including aggression, so thats an excuse I guess.","commenter_a":"Go figure. Anti-gay bigot who thinks gays are predators is a predator himself. So much self projection among the religious.","post_message":"“I would do anything to go back to those teen years and take different actions.”"},{"comment_id":"541079112748211","commenter_b":"Well then lady's better take another look at HiLAIRy nothing respectable there","commenter_a":"Both Hillary & Donald Trumpet don't belong as our President! Trumpet definetely can't be our President. He's full of so much anger & rage! Lord help us all! And, with Hillary, we risk open borders & even bigger issues with illegal immigrants! Our poor country doesn't stand a chance with either candidates! I don't trust either candidates!","post_message":"WATCH: Undecided voters describe Donald J. Trump and Hillary Clinton's debate performance in one word. #FoxNews2016 #Debates2016 How would you describe their performances? @webpagelink"},{"comment_id":"1868221936741025","commenter_b":"@username STUART BAILLIE IS RIGHT. AL SHARPTON IS THE ONLY MORON THAT LOST WEIGHT. ROSIE AND WHOOPI WILL NEED AN AIRBUS TO LEAVE HERE. THEY WILL HAVE TO MAKE A CUSTOMIZED GAS TANK TO HOLD ENOUGH FUEL TO GET IT OFF THE GROUND. NASA HAS ITS WORK CUT OUT FOR SURE. MAYBE THE ENTERPRISE USED ON STAR TREK WOULD WORK. BEAM THEM UP SCOTTIE. WARP 10","commenter_a":"I thought this fat fucking pig was leaving the country if Trump won. Just another piece of shit liar that won't leave as promised.","post_message":"Rosie O'Donnell has a new job."},{"comment_id":"1209908089068937","commenter_b":"Stay strong","commenter_a":"Wow what nasty humans out there!!! Thank you so much to those of you that have some understanding of what I went through..","post_message":"A truly incredible transformation (Via Daily Mail Australia)"},{"comment_id":"1504784736221446","commenter_b":"U sound like a bitch","commenter_a":"And the award for the most useless attempt at contribution to society goes to.... The author of this article. Wonder if that student debt you got from studying journalism at university was worth it. Merry Christmas","post_message":"As you can imagine, it did not go well."},{"comment_id":"10152932277682093","commenter_b":"Ppl who support a rapist are ignorant! PERIOD !","commenter_a":"I think rape is a very good reason to take a star off the walk of fame. Rape is not just any thing. You're right people do bad things all the time. Rape is not a bag thing. It's one of the worst things. And he did it over and over. He is a sick man. And they should take it away. And if any other rapist are there let's get rid of them all","post_message":"COSBY CONTROVERSY – Activists call for the removal of Cosby’s star from the Walk of Fame. Thoughts?"},{"comment_id":"722235994591000","commenter_b":"For sure! Madam President for Prison 2016 once Trump beats her.","commenter_a":"i can't wait to be able to call you Madam President!!","post_message":"16 days. IWillVote.com"}]
