[{"comment_id":"10152977390881130","commenter_b":"#fatgirlwasted","commenter_a":"@username YASSSSSS!","post_message":"Stoners, rejoice!"},{"comment_id":"10153963839661782","commenter_b":"Why is it ok for the woman to hit him ?","commenter_a":"Not ok you POS","post_message":"BREAKING: A video that shows Oklahoma running back Joe Mixon punching a woman two years ago has been released. We want to stress that this video might be disturbing. We are showing it to you in an effort to be transparent. Click on the link to watch the video now: @webpagelink"},{"comment_id":"1002365369819992","commenter_b":"Then why did she have a professional IT tech wipe it?","commenter_a":"The cat is out of the bag. Now they can give up the untrustworthy propaganda about Hillary.. We all know who America can't trust- Republicans","post_message":"Tomorrow, Hillary will testify in front of the House Select Committee on Benghazi. She’ll answer their questions, remember the brave Americans lost in the attack, and outline the need for our country's continued leadership abroad. Let her know you’re with her by sharing this. hrc.io/WithHer"},{"comment_id":"10153024489644614","commenter_b":"Good question Michael, I'm gun illiterate, I though ALL guns had a safety :/. I was trying NOT to be cynical, but was wondering, if you hust had dinner with your wife, and you're entering an elevator, what possible reason do you have to unholster your weapon? Makes you go hmmmmmmmm","commenter_a":"Poor guy ..... perfect example of ALWAYS following safety procedures. If he was off duty, why didn't he have the safety on? But hey, nobody's perfect, and he is paying dearly for this mistake, physically, and I'm SURE! at his job with the ribbing he's getting frim his fellow officers.","post_message":"A Kentucky police officer accidentally shot himself while standing next to his wife in a Cincinnati elevator, and the entire incident was captured by surveillance video. Officer Darryl Jouett removed his gun from its holster and was apparently trying to put it in his pocket when it went off. A bullet ricocheted off the elevator door and hit him in the stomach. Jouett on Monday told WCPO - 9 On Your Side he was at home and on the mend. Read KTLA's story here: @webpagelink"},{"comment_id":"960936923986215","commenter_b":"She is loud!!! Trump!!!","commenter_a":"Now I'm really confused, Trump is not the true conservative, and I thought Palin was.","post_message":"Sarah Palin is ready for someone who can take down ISIS and #MakeAmericaGreatAgain- are you?"},{"comment_id":"863462260369465","commenter_b":"Phony witch","commenter_a":"This women is dumber than a board. Does she think no one notices?","post_message":"Hillary Clinton, you forgot to address your private jet in your climate change speech."},{"comment_id":"10153216754526167","commenter_b":"Madam President get used to it.","commenter_a":"But Hillary sucks","post_message":"Finally, everyone starting to agree that we need to shut it down. It's instructive to look at how we got to this point."}]
