[{"comment_id":"10153414242381130","commenter_b":"And another. Oh those terrible feminists. @webpagelink","commenter_a":"Considering the male comments on this article, women aren't your equals. Thankfully.","post_message":"Ability? Absolutely. Opportunity? Nope."},{"comment_id":"1067364476710422","commenter_b":"She's a corrupt evil lying witch.","commenter_a":"I am for @username all the way!!! She is experienced. She knows how to negotiate with foreign countries. She is a fighter for women and children. She will negotiate without bombs. She will keep us safe. She is the calm not the storm that Donald Trump is.","post_message":"Our choice is between the most experienced, qualified candidate in decades—and a man who once started a Twitter war with Cher. hillaryclinton.com/makeaplan"},{"comment_id":"470909953099585","commenter_b":"Every state should step up and protect our America, muslims can keep their beliefs to themselves, ban Shariah Law in all 50 states!!!","commenter_a":"WTF","post_message":"Muslims trying to force Shariah Law on Alabama just got owned. Good. We won't stand for Shariah Law in America. Do you agree this should happen in all 50 states?"},{"comment_id":"712618255553616","commenter_b":"They are giving your money to the illegals.","commenter_a":"Moral standpoint! My husband is on disability because of 2 strokes. He cannot even get a part time job because of his disability. I'm on social security and we both do not make enough to get us through the month. We worked for our social security. It is our money. I hope people who are in the same boat as us will stand up to this major jackass!","post_message":"Trump will slash anything, as long as it doesn't affect HIS wallet."},{"comment_id":"917658245037632","commenter_b":"@username...You Black Ass Nigga","commenter_a":"We're celebrating Indian slaughter","post_message":"What y'all got? #Thanksgiving"},{"comment_id":"989149777896374","commenter_b":"Es ist wie . Die REICHEN WERDEN IMMER REICHER UND DIE ARMEN IMMER . Die Schere geht immer weiter auseinander.....und dann sind die Leute noch so naiv und w diese Typen, die keine Ahnung haben, vom wirklichen Leben. ....und Leute wie Bernie Sanders, l man fallen.","commenter_a":"Raising wages does absolutely nothing. If you raise minimum wage to the argued $15 an hour, you would have to raise everyone else's wages the same percentage. Now that it costs more to pay workers, manufacturers now have to increase retail prices to make up the difference. This achieves nothing and you're back to square one. You get paid more, but products cost more. 1 to 1 is the same ratio as 4 to 4. Paying more money for the same exact thing is the precise definition of inflation. This mind set is why recessions exist in the countries that follow this policy.","post_message":"The Walton family, the owners of Wal-Mart, is the wealthiest family in America. Middle class taxpayers should not have to pay billions more in taxes in order to subsidize the wealthiest family in America. That's absurd."},{"comment_id":"686707531519825","commenter_b":"Don't bother coming back here bitch ! if you do , they need to hang ya.","commenter_a":"Keep her.","post_message":"A woman who left home to join ISIS just got served up some karma. Good. Anyone supporting ISIS is a traitor to America. Click 'LIKE' if you agree!"}]
