[{"comment_id":"10153400550747042","commenter_b":"Good thing those girls were white, if they were black they probably would've been arrested","commenter_a":"The cops are doing their job! These girls are breaking the law. Now let's give the cops a big round applause (being sarcastic)","post_message":"KIDS' STAND SHUT DOWN: They were trying to earn money to buy their dad a special gift for Father's Day."},{"comment_id":"985293351528112","commenter_b":"Well the high taxes on import/exported goods and labor, access fees to our harbors and Panama Canal or fees to get visas will sure help to pay for wall. LOL!","commenter_a":"Your country will PAY for the wall knucklehead, we hold the ACE CARD, your economy is DEPENDENT on USA! USA is a self contained nation. This is something a LOT of Americans have forgotten, this country is SELF CONTAINED, we don't need to import, we have RAW MATERIALS for EVERYTHING you can think of! I can't wait for factories growing all over USA like grass when Trump occupy the Oval Office.","post_message":"We're 'Not Going To Pay For That F*cking Wall'"},{"comment_id":"1776377852617481","commenter_b":"Looks like he's winning. You're probably going to need to build a wall to keep us out.","commenter_a":"They're going to be the ones building a wall!","post_message":"LOL"},{"comment_id":"1336033269792120","commenter_b":"Lol mybe we all should get a dogs and then all the Muslims will live.Cause thay thank dogs r evil ant that funny .","commenter_a":"He was acting like a mad dog, so he got what he deserved!!","post_message":"When This Muslim Migrant FAILS To Surrender, Police Let Their K9 SHRED Him To Pieces! (VIDEO) LOL! Sorry! Even \"Beggin' Strips\" can't save you now! LOL!!!!!! :D"},{"comment_id":"1062077417179756","commenter_b":"She is a fraud !","commenter_a":"bad squaw","post_message":"WATCH: CHEROKEE PEOPLE Express Disgust Over \"Lying\" Elizabeth Warren Faking \"Native American Heritage\" To Get Prestigious Law Professor Job [VIDEO] @webpagelink"},{"comment_id":"1073897729311987","commenter_b":"@username LOCK HER UP!","commenter_a":"@username. First American woman likley to pardon her self for her many crimes if ever elected.","post_message":"The women of Team USA broke through glass ceilings, wrote history, and showed the world what it means to represent the red, white, and blue. Read some of their stories: hrc.io/2bQa5y3"},{"comment_id":"1225058540866079","commenter_b":"Got to Hell Nancy Pelosi! You are lost.","commenter_a":"Brain damaged fool! You're a disgrace!","post_message":"The American people should know: central to the Ryan budget is voucherizing Medicare and cutting Medicaid. Seniors have a lot to lose."}]
