[{"comment_id":"10153364221881336","commenter_b":"Hey, when you choose to try to make your family into some kind of viral internet sensation, be prepared for the backlash.","commenter_a":"Hahah I think it's cute","post_message":"Did these parents take their family photo shoot too far?"},{"comment_id":"10153389055716770","commenter_b":"Wow is she stupid or what. Racist pig.","commenter_a":"Sure we can play with a bad bad boy and you will get bad results","post_message":"A CNN guest argued that her ex-CIA panel-mate was unqualified to talk about ISIS because he's white."},{"comment_id":"794416220665090","commenter_b":"Eat a dick.","commenter_a":"One word...SCHMUCK","post_message":"PA President demands bodies of ‘martyrs’ killed in recent attacks, says Israeli public ‘deceived’ by leaders"},{"comment_id":"1342374952487749","commenter_b":"We dont need these winers let them stay home,they wont be missed","commenter_a":"Let them skip more peaceful that way no whining","post_message":"LAME EXCUSES! CRYBABY DEMOCRATS To Skip Inauguration For FAKE Reasons Petty AND Partisan!"},{"comment_id":"1629069924061974","commenter_b":"She's beyond dumb she is STUPID","commenter_a":"You people keep forgetting shes not the stupied one, its the people who voted her back in","post_message":"WOW! Huckabee Asks Nancy Pelosi If She’s \"Racist” Or \"Just Dumb” Over Dr. Ben Carson Comments"},{"comment_id":"10153704026896350","commenter_b":"And what kind of Kenyan or African name was it. Something no-one can pronounce or spell I'm sure.","commenter_a":"s","post_message":"Aww, we think the name is perfect!"},{"comment_id":"10153814122893984","commenter_b":"I think if gay couples have to go to another office in another county, then their taxes should follow where they get services. I'm sure if Kim's paycheck was affected by how many licenses she issued then her religious beliefs would't be as important.","commenter_a":"Hey, wait a minute.....where's the outrage towards the Muslim bakeries (several) who refused service to gay couples planning weddings because of their religious beliefs? And why did the Muslim Target store cashier get an allowance to her job description to specify items she refused to ring up for a customer when they wanted to purchase a bottle of wine? And why did the Muslim flight attendant (<----surreal, isn't it?) get a religious liberty allowance to her job description by refusing to serve alcohol to a passenger? Yeah, okay. Had Kim been a Muslim, this narrative would have flipped to sympathize on the side of religious liberty. But she's not Muslim. She's just a Christian adhering to her religious rights, and in a respectful way, might I add. Respectful. Take a page, all you vulgar-mouthed, whiny, double standard hypocrites. It is what it is: religious liberty. Further, as stated in the ...","post_message":"The letters from Kim Davis that were just uncovered could drastically change how people think about this case. Do you stand with Kim Davis?"}]
