[{"comment_id":"939262232775539","commenter_b":"Hey pam how about I come over and slam you're stupid ass to the ground and throw you across the room, see how you like being manhandled","commenter_a":"No the policeman was right!! No damn respect for anyone any more, just makes me sick!!!!","post_message":"BREAKING NEWS! The cop ASSAULTED a young girl in her South Carolina high school classroom has JUST been FIRED! Do you agree with this decision by his department? Does it change anything? Let us know and help SPREAD THE WORD about the power of #FilmingThePolice! From (Y) Counter Current News - MBD"},{"comment_id":"1663552577266891","commenter_b":"Yes--indeed. This woman's behavior is appalling.","commenter_a":"Trump supporter! Makes me sick!","post_message":"Attacked as they prayed? A group of Muslim men say a worshiper was hit in the face and doused with coffee in a confrontation with an irate woman in a NorCal park. abc7.la/1Qgwbam “You are very deceived by Satan,” the woman yells as the wild scene is caught on camera. Should she face criminal charges? Why she’s not backing down, in her own words."},{"comment_id":"10153055382512061","commenter_b":"That woman. Was disgusting","commenter_a":"I'm sure there must of been a 'medical' term for the reasoning....","post_message":"\"I asked him why I couldn't do it and he said, you're black.'\" Black delivery driver replaced after customer wanted whites only: @webpagelink"},{"comment_id":"10153422515817235","commenter_b":"There are a good number of female cops killing for nothing.. Just look it up.","commenter_a":"Another petulant, controlling, entitled man killing a woman who told him 'no'. I'm really sick of men behaving this way simply because he can't get his own way. Women do not DO this. Why do men?","post_message":"Protecting and serving the hell out of you."},{"comment_id":"1063700283715505","commenter_b":"No more illegals","commenter_a":"Keep legal immigrant families together. I have so many waiting in the Philippines waiting to legally come. The other illegals can wait to be legal like the rest or let all immigrants come to USA.","post_message":"The Supreme Court’s deadlocked ruling on immigration leaves families like Karla’s under the threat of deportation. We need a president that will fight to keep families together, not tear them apart."},{"comment_id":"1528359970798514","commenter_b":"Hillary is a traitor!","commenter_a":"At what point do you recognize the whole process is a farce and Hillary's presidency has been predetermined and bought since 2008?","post_message":"What questions do you have about the Democratic and Republican primary races? We are live with WSJ's Aaron Zitner and Dante Chinni now."},{"comment_id":"10153352792949203","commenter_b":"Woman hating much","commenter_a":"They are very stupid people who deserve no sympathy. I'll bet drug dealers and mafia members get assaulted too.","post_message":"Porn stars are people too."}]
