[{"comment_id":"1009798209043227","commenter_b":"That woman will never learn.","commenter_a":"Pig","post_message":"Joy Behar calls out Carly Fiorina. Is she right?"},{"comment_id":"1001898416489082","commenter_b":"Puke and barf!","commenter_a":"Muslim views and laws have no place in America. We have our own laws we don't need islamic sharia laws here,say no to anything muslim.","post_message":"\"Forget the so-called \"Jewish controlled media.\" In the West today wealthy Saudi royals pull all media strings.\""},{"comment_id":"10155353294040231","commenter_b":"Your mom is a monkey","commenter_a":"I'm going to leave this right here. #Unapologetic #BlackAgenda @webpagelink","post_message":"Yet another black person has become a hashtag after being killed by a police officer."},{"comment_id":"10150572291974999","commenter_b":"Ok head in a pressure cooker, she chop the guy? that is cold, women have alternatives like \"the police\", runing away, any place she runs to will be better than prison for life or death. So she did the crime, now do the punishment she had her choice.","commenter_a":"....she killed the guy, put his head in a pressure cooker and then chop the rest of him before telling anybody. Do you know how long that must have been? china did exactly what was right and her sentence isnt harsh at all. Anyone asking for a lighter sentence is out of their mind. She needs to sit in jail for a while and maybe see a head doctor.","post_message":"Women in China who killed abusive spouses were once routinely executed, but as the scale of domestic violence began to emerge in the early 2000s — officials say one in four marriages is affected, activists say one in three — lengthy prison sentences became the norm instead."},{"comment_id":"10152742769151167","commenter_b":"Rihgt Michael...just another Fox News whore","commenter_a":"Speaking as a Jew, I think someone needs to kick Tarantula upside her head.","post_message":"Vile."},{"comment_id":"10153354138131680","commenter_b":"Any evidence statistically of that. Or is that what you think as a HRC supporter. Also I voted for Obama and I support Sanders this election.","commenter_a":"Her decision is very unpopular in Hawaii. Hawai'i Democrats are Obama Democrats. I would expect that she will face a primary challenge as a result.","post_message":"\"I’ve decided I cannot remain neutral and sit on the sidelines any longer.\""},{"comment_id":"10152900911316336","commenter_b":"Jane looked to further her movie career ,it didn't work.Scumbag","commenter_a":"Traitor!","post_message":"Fonda said she made a \"huge mistake\" that led many to think she was against soldiers fighting in Vietnam, and that it's something she'll take to her grave."}]
