[{"comment_id":"10157311512285294","commenter_b":"So... she's not a plagiariser, she's a liar. Guess her and Hillary have something in common after all.","commenter_a":"But didn't Melania say she had no help? Now this? I'm confused I call bull on this one","post_message":"\"I asked to put out this statement because I did not like seeing the way this was distracting from Mr. Trump's historic campaign for president and Melania's beautiful message and presentation.\""},{"comment_id":"1107945392631847","commenter_b":"Even though the Stupid bitch cuts my sandwiches diagonally.","commenter_a":"Bernie is in my dead pool. Die Bernie... The sooner the better!!!","post_message":"Here's actor Mark Ruffalo and director Matthew Cooke on why Bernie Sanders is the right candidate at the right time. Video shared by Occupy Democrats, LIKE our page for more!"},{"comment_id":"1350273158317846","commenter_b":"It's about time this evil and corrupt woman FINALLY gets the justice she deserves!!!","commenter_a":"The corruption is rampant which explains why she could run...and sadly win her party's nomination","post_message":"With just five days to go..."},{"comment_id":"1710841849170298","commenter_b":"We cant have a woman as president we need Bernie or a republican","commenter_a":"Hillary is the devil.","post_message":"We did it, New York. Together, there's nothing we can't do. Watch Hillary live from NYC—and if you've got her back, chip in here: hrc.io/1VhzzV3"},{"comment_id":"10153184324863984","commenter_b":"One dumb ugly bitch","commenter_a":"Dislike this skag.........","post_message":"People are NOT happy about this, and they're calling her out for it big time. Do you support what Benjamin Netanyahu said during his speech?"},{"comment_id":"10154414829691051","commenter_b":"You've been programed on 30 years of BULLSHIT that has not stuck, she's not perfect no politician is but to have this mfer win is just off the fucking charts people will suffer from this including me but these racist mfers will suffer a rath of bs way worse when Gw was in office.","commenter_a":"I think it's a good thing. I honestly don't think that America would have a problem with a Female President, I just don't think that America wants Hillary Clinton to be that First Female President. She's got a rough track record, a record that has a lot of corruption and lies written upon said track record, and the American people see that. She's done a lot of great things in her life, but alas, being President will not be one of them.","post_message":"It looks like Hillary Clinton is done with politics for good. Is that good or sad news to you?"},{"comment_id":"736296849894226","commenter_b":"POOR GAS ON THEM AND LET THEM BURN","commenter_a":"He should have the same thing done to him.","post_message":"A black man in Baltimore poured gasoline on two white men, and there is nothing on the news. No riots, no protests, no media coverage. Do you think he should be charged with a hate crime?"}]
