[{"comment_id":"680360518742918","commenter_b":"Yeah ted😄,, me and my uncle Malcolm Fisher love ya!!!","commenter_a":"I refused to watch his garage band act but I'll take your word on it!","post_message":"Tonight America saw a powerful demonstration that it is time to move on beyond President Barack Obama. #SOTU2015"},{"comment_id":"10154479545156320","commenter_b":"Because of a speech. Sheeeesh","commenter_a":"What an amazing speech by everyone last night at the convention.I really think Hilary Clinton will be the President of the United States of America.","post_message":"12 years after rising to national prominence at the 2004 DNC, President Barack Obama took to the convention stage to try to bolster Hillary Clinton's candidacy to succeed him. #DemsinPhilly"},{"comment_id":"10153291697646350","commenter_b":"It was beautiful . I have seen the stage play at least 20 times with groups and sung by many, and it is great to hear the different sounds.","commenter_a":"If you ever saw Phantom on stage or saw the movie, you know Josh Groban did it justice. Kelly did not. She about ruined my favorite song for me, from which my wedding vows were taken. Kind of like nails on a chalkboard for me.","post_message":"We could listen to Josh Groban and Kelly Clarkson sing The Phantom of the Opera all day."},{"comment_id":"969458729761266","commenter_b":"Eat a dick,you stupid bitch.I do have personal pictures on my page that's how much you know.","commenter_a":"And you, @username, are an asshole, and so fugly you don't have the balls to post a real pic.","post_message":"Michelle Obama is simply the best First Lady ever."},{"comment_id":"466812640175338","commenter_b":"Hang tee bitch.","commenter_a":"Close all borders indefinitely. NOW","post_message":"Muslim Refugee Beats And Rapes Woman In North Dakota While Yelling 'Allahu Akbar' [VIDEO] It's starting to happen in America. We cannot allow any more refugees into the U.S. Do you think we should close our borders to refugees?"},{"comment_id":"10153563127821680","commenter_b":"Gotta love how she tries to spin this. No other SOS ever had a orivate, unsecured server in their house. Morning Joe shows her lie repeatedly. @webpagelink She needs to drop out. Even Politifact.com found her statement to be a lie. @webpagelink/ #NeverHillary #BernieOrBust","commenter_a":"I lied and I'm going to lie some more.. Hillary2016","post_message":"\"There may be reports that come out, but nothing has changed,\" Hillary Clinton said. \"It's the same story.\" Read more: politi.co/1P0pUQK"},{"comment_id":"10154111304162541","commenter_b":"Shut up","commenter_a":"Like Trump, Steve Harvey is also a racist and mysognist. Between his extremely offensive dating advice for women and his extremely offensive comments about Asians, Steve and Don the Con have a lot in common.","post_message":"\"I walked away feeling like I had just talked with a man who genuinely wants to make a difference in this area,\" Steve Harvey said."}]
