[{"comment_id":"10153324235171051","commenter_b":"Since some of you females here want to crucify the father let me be the first to defend him. The child was the one that is being held, not the father. They have enough evidence to hold him and charge the kid. We don't know what kind of man the father was or what custody agreement him and the mother had. The child is the one being charge and we should leave it like that until something new comes out.","commenter_a":"Where is the father of the fetus & how far along was she? Nobody noticed the front door open on Friday or Saturday? A single mother living in that house? They said the kid had been missing a couple days as well but their news broadcast says the boy disappeared after his mothers death. What was he doing there? How did he get there? The neighbor & sister both say the boy was a good kid, good grades, non trouble maker and she was a great mother who loved & protected her family. Almost all pregnant women who die, do so at the hands of the baby's father.","post_message":"This pregnant woman was killed by the one person she trusted most in the world."},{"comment_id":"10154551576694030","commenter_b":"White people love mayo and ranch. I lovvee ranch bruh.","commenter_a":"I didn't see this as particularilly white. Like people of color don't use mayo?????","post_message":"You can't help who you are. Kyle Kinane's Loose in Chicago premieres tonight at 12a/11c."},{"comment_id":"10153888700337464","commenter_b":"You gotta get all the brainless and illegals to stop voting democrats, its the democrats that arm criminals but prevent legal law abiding people to legaly arm themselves","commenter_a":"What happened to carson?","post_message":"Justice Scalia’s passing tonight underscores the stakes of this election. Voters must determine who on this stage has the judgement to nominate and confirm principled constitutionalists to the court."},{"comment_id":"10154500349722994","commenter_b":"Yes! If someone is wrong they should pay!! Thank you hun. Wish I wouldn't have settled because I probably wouldve gotten more going to court! Never settle sweetheart 👍💯","commenter_a":"This happened to me before but by the time I found out it was pillaged, dash kit, sounds, Windows missing. I went to court and sued DPD they settled out of court.","post_message":"Andrew Carter has been walking, riding his bike and taking the bus for nearly two years now - unaware his stolen car had been recovered the entire time."},{"comment_id":"1180631801992422","commenter_b":"THE wall is necessary","commenter_a":"Hell no!!! I don't want to see a big freakin wall between my state (Texas) and Mexico (with whom we've been friendly for a LONG time). Way to go, Trump...maybe you can start a war with Mexico 😠 Brilliant!","post_message":"Agree or disagree: It's time to build Trump's wall at the border."},{"comment_id":"10152973288751130","commenter_b":"No its sad you women believe that men always negotiate harder. Please provide some scientific evidence of this, other than that try harder.","commenter_a":"Isn't that sexist to say men negotiate better than women? Lol","post_message":"“Men negotiate harder than women do, and sometimes women get penalized when they do negotiate.\""},{"comment_id":"579001232257569","commenter_b":"THIS HAS ALWAYS BEEN A PROBLEM FOR A LONG TIME ITS CALLED THUGS AND OUTLAWS IN CHICAGO.THIS STARTS AT HOME WHEN THESE THUGS DO NOT HAVE A FATHER TO SHOW THEM THE WAY.THINGS WILL NEVER CHANGE IN CHICAGO WHEN YOU HAVE WOMEN THROWING THERE LEGS UP TO ANY MAN WALKS BY FOR MONEY.IT WILL NEVER CHANGE. THEN THE MEN WALKS OFF AND FINDS ANOTHER ONE TO KNOCK UP.THE WORLD KNOWS ABOUT THESE PEOPLE.ITS LIFE IN CHICAGO.","commenter_a":"What a joke","post_message":"BLACK LIVES HYPOCRITES! Gun-Controlled Chicago: 21 Shot, 1 Stabbed, 1 Dead In 24 Hours Amazing they can unite and riot for TRUMP but can't for the constant murders and shootings plaguing THEIR community! IF you are pissed off LIKE AND SHARE THIS!"}]
