[{"comment_id":"1391779917508701","commenter_b":"lol white girl troll","commenter_a":"The confederate flag, rebel flag doesn't stand for slavery nor against blacks. But it's OK for them to tote around black panther crap which is known as a black supremacy group?? Get a life and find something meaningful and real to whine about.","post_message":"The House has voted to ban the display of the Confederate flag on flagpoles at Veterans Administration cemeteries."},{"comment_id":"1141972632481659","commenter_b":"I think they should exact a form of sharia law on these ME males. Cut their peckers off. They are stealing from these women","commenter_a":"Europe wake up and time to get you at of my bed. We can't except no more of this crime it's disgusting and these middle eastern got to go bye bye and ready for there deportation sentence. We don't want to hear no more of liberal excuses oh it's racist.Racist my face those people deserve there jail sentence and then there deportation sentence.","post_message":"Drip, drip, drip: News of more Muslim sex attacks leaks out"},{"comment_id":"10154716032249714","commenter_b":"Triggered a feminist. Didn't take long. What benefits will hillary do for you? Decrease tax rates hah funny. Zoe you sound little butt hurt you might need to see proctologist.","commenter_a":"Woah Woah Woah More Democratic Propaganda. Time to settle down @username.","post_message":"\"The first time I doubted my looks and worth was in kindergarten.\""},{"comment_id":"936764406358981","commenter_b":"what tits. he was smelling her fart","commenter_a":"\"Joe stop staring at my tits, thanks.\" ~ Hillary","post_message":"Can you imagine? Talk about our country going to hell in a handbasket…"},{"comment_id":"1393467647339928","commenter_b":"Yep, that is exactly what I believe!","commenter_a":"I was a democrat and anti gun, after I saw San Barnadino I changed my opinion .rump is right if we had few people in that work place gun straped around their hip bullets would have go the other way too. We could have kill those radical fanatics right there and the death toll of Americans would have been much less. I can guarantee that.","post_message":"BREAKING: NRA endorses Donald Trump at national convention"},{"comment_id":"10152955356009071","commenter_b":"I know I said LMAO, but really hit me up... could use the help. ;-)","commenter_a":"Dear anyone... please contact me if you're up for some pro bono work to sharpen your skills! Lmao!","post_message":"It's a known fact that hacking makes money. But how much money?"},{"comment_id":"10153190313663984","commenter_b":"Get the bitch away from our kids school's.","commenter_a":"She fills up on bananas! Hard to keep her out of the tree!","post_message":"Ouch - Michelle Obama will not be happy to hear this. Are you sick and tired of the Obamas telling us all how to live?"}]
