[{"comment_id":"1178825752155659","commenter_b":"Bitch is crazy","commenter_a":"Delusional!","post_message":"HILARIOUS"},{"comment_id":"558741910917069","commenter_b":"Well a lot of the problem is, is she is a woman. I guarantee you she is going to have to fight a lot to become President, now and if she becomes president it will only get worse.and I am not voting for her.","commenter_a":"Shut up, Ben!!! You're out of this race.....","post_message":"Does Clinton's use of a private email server prove she has poor judgment and is unfit to be president?"},{"comment_id":"10153647913121051","commenter_b":"@username, Bitches and N***** 'are' two different words....sentence formulation goes a long way towards making one look less uneducated","commenter_a":"Hope the black girl punches the radio when rap artists use that word and call other women bitches","post_message":"Some people say this girl's angry reaction was justified. Others disagree. Decide for yourselves who is right."},{"comment_id":"10152973215291519","commenter_b":"So you are saying that black women are easier to compete with than whites women? I don't think so","commenter_a":"She couldn't compete with other white women so she became a light skinned black woman. Using our own weakness against us.","post_message":"The cringe factor here is off the charts..."},{"comment_id":"10153417298067434","commenter_b":"Yeah everyone needs this guy in the women's bathroom","commenter_a":"This is how we protect our women... not guarding bathrooms for trans \"predators\".","post_message":"\"I was going on about something and saw Monica staring behind and making a funny face. I stopped. 'What’s going on?' After a few second she said 'That guy just put something in her drink.'”"},{"comment_id":"1253721481351661","commenter_b":"whoop, found some time capsules","commenter_a":"Chris Lloyd","post_message":"According to a new study, there are two massive structures, located around 2,896 kilometers below the planet’s surface – one below the Pacific Ocean and the other beneath the Atlantic Ocean."},{"comment_id":"680629115421379","commenter_b":"She needs to just go away already.","commenter_a":"We can let her become president","post_message":"Hillary Clinton slammed Donald J. Trump's \"I'm with you\" proclamation, writing on Twitter, \"Not included: women, African Americans, LGBT people, Muslims, Latinos, immigrants...\""}]
