[{"comment_id":"1690646117862352","commenter_b":"Yes. She's milking it like she used to milk her moms boobs lmao","commenter_a":"@username Jacob Nowell @username aww sky used to do this shit lmao","post_message":"Wouldn't you want a nice massage from this cat too?"},{"comment_id":"10154721377651320","commenter_b":"Don't forget Al Sharpton hanging there too.. shes a joke!","commenter_a":"Really ? So how do you handle having Jay Z in the Whitehouse with the crap that comes out of his mouth that he makes money off. Shaken to your bones ?","post_message":"Thoughts?"},{"comment_id":"1575163439454943","commenter_b":"Thank God for this smart young man I hope he can get thru to these thugs who have done this.","commenter_a":"I tip my hat to this young man who certainly possesses a depth of wisdom and pray he and many more like minded can be first to reach out in some way that only he and others are acceptable for the larger purpose TALKING to others about the failure that they have caused but need to turn back to!!!!","post_message":"One Milwaukee resident has a message for rioters destroying his community. And it completely DEFIES the liberal media's narrative."},{"comment_id":"2117406141818910","commenter_b":"@username Lmao...lmao...lmao...lmao...lmao","commenter_a":"So now he he is blaming his own voters if he loses. Face it trump you are going to be the one who loses to a girl and in a big way.","post_message":"Donald J. Trump says he \"will never, ever forgive\" voters if he loses the election."},{"comment_id":"10154383447230745","commenter_b":"She modeled nude! Soft porn!","commenter_a":"Trump is not going to make it past 2017......Bigly!","post_message":"WATCH LIVE: President Trump makes an announcement — will he take questions from the press? @webpagelink"},{"comment_id":"10154083070804160","commenter_b":"Go to Hell","commenter_a":"Won't this trump puppet go jump off a cliff already","post_message":"\"Bow down.\""},{"comment_id":"1140743049271284","commenter_b":"Little girl, you are asking for a theocracy, which America is not. Time for you to leave and go to Iran, pookie. No one wants your cowardly, uneducated, anti-American traitor self here.","commenter_a":"If God said it, it is settled!, no matter what any pervert says! And the supreme court is not supreme!, God is!","post_message":" represent the people, and the people have shown several times that they are opposed to this, and are in favor of traditional marriage, state Rep. Bill Chumley, R-Woodruff."}]
