[{"comment_id":"418030251654903","commenter_b":"Why not, she gets away with murder!!","commenter_a":"Bad, evil, lying laugh quack! 👎","post_message":"As Hillary Clinton finally announces her not-so-surprising candidacy for the 2016 presidential race, how do you rate her chances?"},{"comment_id":"1580958245270761","commenter_b":"Charlie Shumate Kind of like how everyone has been brainwashed into becoming a queer, race mixer, feminine male... Man how the times have changed for the worst..","commenter_a":"Rachael Isabella too real though","post_message":"\"We need only go back to Hitler's Germany to see that it can happen to anybody. Anyone can become dissociated to the point where they are not seeing what is happening in front of their eyes.\""},{"comment_id":"10152879630121336","commenter_b":"Shes got her hands full.","commenter_a":"Blessings","post_message":"A Montana woman gave birth to a set of identical triplet boys in early December, a rare occurrence — especially without the aid of fertility drugs. @webpagelink"},{"comment_id":"812922865409803","commenter_b":"Imagine being the daughter of the two biggest a$$es in recent history - how would YOU react?","commenter_a":"she is a teenager, let her alone .... I am as anti-obama as the hext person, but geeeeeeeeeeez ... don't attack a kid","post_message":"Why is she supporting this?"},{"comment_id":"475643605893567","commenter_b":"Why not hit I would if she did that to me","commenter_a":"First up, this woman is NO lady!","post_message":"This lady just messed with the wrong 73 year-old."},{"comment_id":"1686157554986660","commenter_b":"Smart woman only a dummy would join Scientology!!","commenter_a":"Kirstie, you are beautiful and such a smart woman! I applaud your endorsement of Donald Trump. Don't let your \"neighbors\" get you down.","post_message":"I am sure people in Hollywood are losing their minds right about now, but this actress is NOT backing down. Do you support Kirstie Alley's presidential pick?"},{"comment_id":"1135738829807996","commenter_b":"Lydia, you should learn to shut up","commenter_a":"What's next? Calling Thanksgiving Indigenous People's Day II? Why don't they pick their own day. Why is it, like MLK Day, they have to replace long beloved holidays?","post_message":"BREAKING: The City of Phoenix just became the largest city in the country to recognize Indigenous Peoples Day, unanimously voted by the city council. It will take place the second Monday of October."}]
