[{"comment_id":"10152927124907293","commenter_b":"because female popes get the same pay as male popes","commenter_a":"1. The premise is not even true. 2. The screaming irony of this makes me think that the @username picked this up from The Onion.","post_message":"\"Why should it be taken for granted that women must earn less than men?\" the pontiff said."},{"comment_id":"1258250390858975","commenter_b":"She's trash too,","commenter_a":"No jobs or their boss refuses to buy group health insurance and a heavy extra tax next year for not having health insurance. All those young healthy folks need to buy premiums so the insurance companies keep up their profits.","post_message":""},{"comment_id":"1005120462832757","commenter_b":"and for that she deserves what amounts to life in prison?","commenter_a":"Ummm she took abortion pills and left her baby in a dumpster, then took herself to the hospital.","post_message":"\"What this prosecution makes clear is... abortion being recriminalized in America\""},{"comment_id":"1213019208717830","commenter_b":"@username So...a ticket paid for means she can do whatever she wants and not follow rules and regulations. I'm pretty sure it is clearly stated in the paperwork you sign before sailing that you will be left behind if you are not back on the ship on time.","commenter_a":"Horrible. They waited a whole 30 minutes how about waiting til she's back. What if she had been kid napped or in a hospital. No compassion what so ever, makes me sick. If she can see that ship depart they are at fault.","post_message":"A woman looked on with horror as the cruise ship on which she was vacationing left a port in Bahamas, leaving her on the island while her children were on the ship."},{"comment_id":"10155692576378572","commenter_b":"hit her in the ass with the INK","commenter_a":"good riddence to you old girl you will be replaced go join Isis","post_message":"SHE IS ALSO A HILLARY CLINTON SUPPORTER..."},{"comment_id":"10155928923344199","commenter_b":"This is the best.","commenter_a":"Breanna Barrick","post_message":"'Church, singing and sex:' That's what this couple says has kept them together for 75 years! More: via.q13fox.com/Xirhe"},{"comment_id":"10153189013365736","commenter_b":"Please don't insult scum. Scum must be very embarrassed to be compared to HER!","commenter_a":"Of course she did it. Using that poor boys abduction to get her face on T.V. What an evil woman n","post_message":"Kyron Horman's stepmother Terri Horman gives People magazine an exclusive interview about the disappearance in June, 2010 of the 7-year-old."}]
