[{"comment_id":"10152722362786680","commenter_b":"Shut up","commenter_a":"NO","post_message":"\"I think presidents have the right to pick their team.\""},{"comment_id":"10152981521492235","commenter_b":"Surpising?! I think not.","commenter_a":"No surprises here. The sad thing is so many of today's Democrats and Republicans choose to ignore their party's histories and instead make excuses for it - such as saying because things happened years ago it was acceptable.","post_message":"What these presidents said in private and what they did in public were often sharply at odds."},{"comment_id":"853235784752651","commenter_b":"Too bad there aren't more moms like her.","commenter_a":"I love that she is wearing bright yellow...for all to see.","post_message":""},{"comment_id":"10155755235340725","commenter_b":"U mean I have to marry ur ass!? Ugh","commenter_a":"Patti McGough, let's meet at Daley center on tuesday.","post_message":"#BREAKING: Supreme Court rules all gay couples have a constitutional right to marry-----> @webpagelink"},{"comment_id":"1834672043468268","commenter_b":"Well if she wants to waste her money.... Whatever","commenter_a":"wasted money","post_message":"Actress Meryl Streep loves throwing her money into politics. Particularly when it involves Barack Obama and Hillary Clinton."},{"comment_id":"10152793900772452","commenter_b":"Bad women drivers! ;)","commenter_a":"Who the hell runs over a motorcyclist and does not have a clue that they hit someone????! Thank god the other drivers made her stop FINALLY!!!","post_message":"The dramatic rescue of a motorcyclist who had been dragged underneath a truck on the eastbound 91 Freeway was caught on video. abc7.la/1EK2HcY The video was submitted to Eyewitness News by viewer Byron Holeman who used the #ABC7Eyewitness."},{"comment_id":"1149041588518531","commenter_b":"I'm a nasty woman too. FUCK DEPLORABLE INC.","commenter_a":"I guess I'm just a nasty woman!!!","post_message":"I don't think this is what Donald Trump expected to happen."}]
