[{"comment_id":"10156188886135354","commenter_b":"Suzanne, you're a dumb bitch. Shut the fuck up","commenter_a":"Scott walker Mexican Americans legals are against illegals we are with DonaldTrump not because we are Mexicans but this is our country n our children need a better America not free loader hard working for a better America since 1800 hundreds my family been hereover 200 hundreds years we love America we have to be great again my decision n my family DonaldTrump is the great America we need","post_message":"Scott Walker calls for a “limited number of candidates who can offer a positive conservative alternative to the current front-runner.”"},{"comment_id":"10152942027790399","commenter_b":"There is a word for women like her, but that would be an insult to hard working girls.","commenter_a":"That certainly says everything about her credibility, or lack thereof. :( AKA (I'll say anything for a buck)","post_message":"Megyn Kelly on msnbc: \"I’d have done O.K. there, too.”"},{"comment_id":"10153217092086943","commenter_b":"Heads need to roll for this and indictments handed down. My what our government has come to. Nothing but self serving law breaking idiots.","commenter_a":"@username is relentless about getting to the truth. They work for the people by continuing to tirelessly go after these corrupt polititions and agencies in our government who some how think they are above the law. Congress has caved into the stall tactics by this corrupt administrations Justice dept, Irs, and State Dept. Thanks @username.","post_message":"This is from an Investor's Business Daily editorial yesterday: \"Thanks to a band of lawyers called Judicial Watch, and no thanks at all to the mainstream press, we are learning about a shady October 2010 meeting between former IRS official Lois Lerner, Justice Department officials and the FBI.\""},{"comment_id":"1145471028827087","commenter_b":"Joy yes the Bible said far be it from the true God to act wickedly! Death is the last enemy, the pain we feel when a love one dies is beyond words indeed God don't cause wickedness n bad things to happen but he \"ALLOWS\" I lost my son who I love dearly and reading and focusing on JOB experience help me to keep my sanity! THANKS BE TO GOD.","commenter_a":"You would not believe how many people said \"everything happens for a reason\" or \"this was God's plan\" when my son was stillborn. It made me so angry, still does. There is no reason, the autopsy proved that.","post_message":"In case you missed it: Sometimes saying \"Everything happens for a reason\" can hurt the folks we mean to help."},{"comment_id":"10156248973870354","commenter_b":"that bitch!","commenter_a":"i was sexually harassed by Ashley Judd, she had her way with me, then tossed me aside","post_message":"When will liberal Hollywood stop its War on Women?"},{"comment_id":"10153637396193854","commenter_b":"He is a idiot and a monkey like that wife of his both ugly as sin he want be there much longer they have signed impeachment papers","commenter_a":"GO TO HELL","post_message":"Under Obama, U.S. Army Orders Soldiers To Scrape Bible Verses Off Their Rifle Scopes…"},{"comment_id":"921881311183439","commenter_b":"Obama go home to Kenya. Illegals go back to countries you came from. Need to help our own not illegals who drain our economy and increase our national debt......","commenter_a":"Dumbama suck donkey dic","post_message":"Will you accept Obama's latest \"order\"?"}]
