[{"comment_id":"760141017451798","commenter_b":"he also spoke at her rallies against Obama Care!! he should be thrown out for being publicly biased BC he knows he had to make decisions on it so it is illegal for him to do that!! his teaturd wife is insane too!!! apparently if your rich, you are above the law! time for a big change here!!!","commenter_a":"And what about Thomas \"inadvertently\" forgetting to report 1.6 million in income his wife earned lobbying and speaking against healthcare? How is he still on the Supreme Court?","post_message":"Very interesting."},{"comment_id":"10153328261067093","commenter_b":"****Illegal immigrants.","commenter_a":"It's funny y'all keep talking about Democrats. I guess y'all are the same incompetent people that voted for Bush twice. Donald Trump has his head up his anus. He doesn't know the first thing about running a country. Let me guess he had y'all at Wall? He would build one to stop immigrants. All immigrants aren't bad they just want a better life. LeRhonda Flowers","post_message":"A resident of a tiny island in Canada is rolling out the welcome mat if Americans want to flee after Election Day.... @webpagelink"},{"comment_id":"10155008685674170","commenter_b":"Buy Global Warming , Ol AL GORE needs the MONEY !!! 😎","commenter_a":"Al Gore. Captain America. He is just another Delta Dawn, someone who feels he deserved to win, it was owed to him. Just like Chillory. So glad they are seeing that not every one likes them or shares their views.","post_message":"Well, they couldn't stop the electors from voting for Trump. But the left never gives up! This new plan sounds like something from a Scooby Doo episode."},{"comment_id":"10150742367724999","commenter_b":"Yes Debra! Preach","commenter_a":"What?!! Do you really think young women voters can ignore that Hillary chose a MONSANTO lobbyist as her campaign manager? We'll wait for Elizabeth Warren, thank you very much. In the meantime- Senator Sanders is our Mr. Clean.","post_message":"Hillary Clinton's older feminist supporters had a message for young women who are not backing her candidacy: Shame on you. Update: Gloria Steinem later said she \"misspoke.\""},{"comment_id":"800436556756837","commenter_b":"And for what he's done to military, vets... Americans! Bringing illegals and terrorists into our country to kill us!!!!","commenter_a":"Yes! Obama should be put in prison for intentionally violating the law and for threatening others, who do enforce the law, with being punished for that enforcement.","post_message":"This Federal Judge Just Took Down Obama For Betraying America. We need more people in this country who will stand up against him. Do you support this judge?"},{"comment_id":"556876431104063","commenter_b":"Put a cap in her ass :-)","commenter_a":"I'll still bone her! Even with a mangled face! What's the point of the story?\"did you see her legs?","post_message":"The police state: before and after... The Free Thought Project.com (Y)"},{"comment_id":"10154082717346037","commenter_b":"You're an old hag and a criminal","commenter_a":"Hilary for president of America 2016!","post_message":"Hillary Clinton and Ted Cruz have received the most funding from the groups so far."}]
