[{"comment_id":"1049396555150863","commenter_b":"I thought you made a great partner to clint in fight movies rest in peace Jeff","commenter_a":"I like him. He was a good supporting actor. Underrated, in my opinion.","post_message":"Actor Geoffrey Lewis, known for his long working relationship with Clint Eastwood and for a slew of roles in television and film, has died at age 79. @webpagelink"},{"comment_id":"10154465845766162","commenter_b":"This is different, this girl has some evil in her!!","commenter_a":"Huh? Well that's just stupid. I tell you to jump off a cliff, and you do it... You're the idiot.","post_message":"A teenager who sent her boyfriend dozens of text messages encouraging him to take his own life and told him to \"get back in\" a truck filled with carbon monoxide fumes must stand trial for involuntary manslaughter: @webpagelink"},{"comment_id":"10150839207834999","commenter_b":"@Gabrielle Nicole Alvarez By that logic, any psychologist whose job it is to draw such distinctions about attraction is a paedophile and any feminist knowledgeable about different types of abuse is a rapist. @@username hebephilia concerns the early stages of puberty, so ephebophilia, attraction to mid-late teens, might be more fitting.","commenter_a":"And now we wait for the complaining pedophiles...","post_message":"Miss Teen USA is ditching bikinis for athletic wear."},{"comment_id":"1113642245398693","commenter_b":"Ummm....which part of the Constitution did he need help reading again ? Seems like the Constitution is only good for these biggots when it works in their favor...picking and choosing again...no wonder this Country is in such shambles right now. Get over it Ted Cruz...get over it.","commenter_a":"The thing is, how do Republicans make the, \"follow the constitution\" argument after this? The constitution is clear, that the President must nominate a Supreme Court Justice when there is a vacancy. Where in the constitution does it set a time limit based on when the vacancy occurs?","post_message":"Senator Ted Cruz tweeted: \"Justice Scalia was an American hero. We owe it to him, & the Nation, for the Senate to ensure that the next President names his replacement.\""},{"comment_id":"10155606763470492","commenter_b":"OMG it happen on number 7 train everyday. this lady on the photo is nothing. many of them insists squeeze inside and the worse is stink body smell that hit your nose.","commenter_a":"Tiffany Yeung","post_message":"Behold, the Incredible Levitating Lady."},{"comment_id":"10153901120586336","commenter_b":"If the current laws are followed and enforced like they should be then no one who should not own a firearm would be able to buy a firearm from a license FFL Dealer. Read about it on the ATF website","commenter_a":"This will do nothing to stop the criminals from doing what criminals do. It will only hurt law abiding citizens.","post_message":"President Barack Obama is reportedly finalizing a proposal to expand background checks by executive order."},{"comment_id":"10153532117044586","commenter_b":"Test on the bimbos that model, that's what I say. Ugly monsters","commenter_a":"Please, help, Humane Society International...please.","post_message":"TERRIBLE NEWS: Here are some of the animals who will be hurt for Victoria's Secret."}]
