[{"comment_id":"10153276953617293","commenter_b":"Whitesplaining.","commenter_a":"I guess since the whitest guy in the world doesn't find it offensive it must not be.","post_message":"\"I don’t find it offensive,\" Jeb Bush said. \"Native American tribes generally don’t find it offensive.”"},{"comment_id":"10156200412990354","commenter_b":"Well she just proved what a stupid twat she is!","commenter_a":"Who?","post_message":"So loving and tender, those pro-abortion activists."},{"comment_id":"10153614097404199","commenter_b":"Victim or not, that was still unacceptable behavior. She tried to attack her! That lady could have just kept going.... BUT she chose road rage.","commenter_a":"That mom wasn't scared. She was pissed at the person driving recklessly. If she was scared, she could of pulled herself out of the situation at many different side roads and pull offs. She choose to keep following someone she new was driving aggressively putting herself and child in more danger.","post_message":"UPDATE:"},{"comment_id":"920944947962651","commenter_b":"soo then Michael is right , those other species of plants are no good , , chop em down & replace them with hemp.","commenter_a":"they need to fix this, and they can, if every person in China planted even just one tree, imagine :) Jude","post_message":"This documentary film went wildly viral with over 200 million views in it's first week online. Now Chinese officials are afraid that you'll see it too."},{"comment_id":"1493513274041749","commenter_b":"what a whimp","commenter_a":"The people of france must be so hurt by the utterings a man who surrendered his citzenship because he refuses to pay french taxes and became a Russian citzen instead. Comrade Dipstick needs to shut up","post_message":"'France is populated by imbeciles making wine and stinky cheese for tourists'"},{"comment_id":"10156300548230389","commenter_b":"Gilbert, go back to the ignorant liberal hole you slithered out of. You spineless snake.","commenter_a":"Who in the Hell is Race baiting? It is Fox Propaganda Channel and @username. Who in the Hell supported the Racist Tea Party? Fox Propaganda channel. I see by the comments that you are the problem, not Obama. Your commenters would rather cut off their heads to spite their faces. That is why they listen to you, for the same reason the German people listened to Hitler.","post_message":"Question of the Day: Do you think President Obama has made race relations better or worse in this country?"},{"comment_id":"10153665753806336","commenter_b":"That was THEN! This is NOW! The law of the land NOW is all that matters! Let go of the past and get with what needs to be done now! NO more illegals. I don't care if they are baby's or adults, they have to go back! They don't belong here period!! Stop saying we are all here illegally too, it makes it clear you think it is ok for these things to happen. I see most of your last names are hispanic.","commenter_a":"The correct term is illegal alien not illegal immigrant...read the constitution..those people have no rights here and neither do those born here from illegal aliens...the constitution says they are not citizens of this country.","post_message":"Border Patrol officers near San Diego noticed that the driver, a U.S. citizen, was acting weird, so they used imaging technology to inspect the car."}]
