[{"comment_id":"10152606529540950","commenter_b":"Okay says the 21 year old hag","commenter_a":"Old bag","post_message":"Hilary Clinton tweets support for getting children vaccinated @webpagelink"},{"comment_id":"1015223798498631","commenter_b":"I see what you did there","commenter_a":"That's gold","post_message":"Sorry folks."},{"comment_id":"10154305617489205","commenter_b":"Filthy slut!","commenter_a":"The world ends tomorrow","post_message":"Donald Trump Appears At Pre-Inauguration Lincoln Memorial Concert"},{"comment_id":"10154021624482464","commenter_b":"Adultery is one of the ten commandments thou shalt not commit adultery","commenter_a":"I vote biblically, for someone who stands for righteousness and one who cares about the things of God and not his own ambitions. A true servant of God's and the people of this nation. My vote and prayers go to @username. Proverbs 29:2 says when the righteous rule, the people rejoice. God is giving the body of Christ another chance to get this right in 2016! Cruzin all the way to the White House! My president is @username!!","post_message":"\"The only person running for president to publicly admit to have been bitten by an octopus.\""},{"comment_id":"1734664193415362","commenter_b":"Don't Worry Bernie supporters.. !! Hillary will never win, well never let her ! #FeelTheBern #NotMeUs #HesWithUs","commenter_a":"Hillary is the clear choice for the White House!","post_message":"What a week."},{"comment_id":"10154577788564726","commenter_b":"New York should have voted smarter.","commenter_a":"They are so crazy. Now I start feeling sorry for them.","post_message":"He's taking a queue from Obama's playbook..."},{"comment_id":"1116747615049049","commenter_b":"Women frequently nurse their Babies in the train station where I work - I applaud it as natural and organic and cannot imagine why in Heaven's name it is such an issue - (we all come with identical equipment and this is what breasts are for) Nursed Babies are much healthier than those bottle fed","commenter_a":"Beautiful","post_message":"An interesting discourse here about nursing in public. What are your thoughts?"}]
