[{"comment_id":"1036028619826340","commenter_b":"Keep walking it back Donald, pretty soon the wall will be some bushes and a couple signs","commenter_a":"Dump Trump","post_message":"I have never liked the media term 'mass deportation' - but we must enforce the laws of the land!"},{"comment_id":"10152978726794342","commenter_b":"Yep that's some more B.S. All of the jobs that illegals are here taking were done by American citizens before you came. Your comment is without any truth whatsoever!!!","commenter_a":"All this jobs yall dnt do the hispanic race does !","post_message":""},{"comment_id":"10153547862267894","commenter_b":"This bitch cant act bye","commenter_a":"I think Nene should focus on her acting career. I enjoyed just having her pop up on a few episodes as a guest and not a wife.","post_message":"NeNe Leakes Reportedly Offered $2.5 MILLION to Return to ‘The Real Housewives of Atlanta’"},{"comment_id":"871509956275393","commenter_b":"Fuck u.bitch dani","commenter_a":"Whoopl.is.a.racist bitch","post_message":"They really destroy the argument for keeping the racist flag around."},{"comment_id":"10153275884859877","commenter_b":"Pigs don't eat pizza.","commenter_a":"It sounds pretty delicious but obviously racist.","post_message":"NY pizzeria apologizes for promoting racist ‘Pic-a-Nika’ pizza - but some of those ingredients are suspect. Grio fam, what do you think of the owner's response to the backlash? Do we believe his explanation for the \"mistake\"?"},{"comment_id":"10152798547942452","commenter_b":"Upon last survey, they only found ~three smelt in the delta! All the smelt live in temperature controlled tanks at UC Davis... to the tune of about $2.5 million tax payer dollars per year. THE SMELT ARE GONE, no matter what they do in the delta. If it weren't the smelt, another fish or animal would be chosen to take its place. We're suckers... hook, line, and sinker! Israel had severe water shortages too... they are now able to be a water exporter. They built reclamation, desalinization, and now have more than they need. California is building an f'ing bullet train to nowhere! But, what if a smelt got pulled into the desalinization plant intake?","commenter_a":"Maybe if our state government quit selling our water rights to Evian arrowhead dasani etc we wouldn't have this problem","post_message":"BREAKING NEWS: California water regulators adopted sweeping, unprecedented restrictions Tuesday on how people, governments and businesses can use water amid the state's ongoing drought. abc7.la/1QkO1GA"},{"comment_id":"560286244096415","commenter_b":"Conversion to Christianity. Messing with the Germans so the tribes demolished Rome. (Where we get the word vandalism from... The Vandal tribe.","commenter_a":"Hmmm how did greece burn this year...","post_message":"Does this seem familiar to you?"}]
