[{"comment_id":"10154125037012377","commenter_b":"Women are smarter than you think. This is always from a man's perspective that we are weaker. Always remember women birth your armies, their children suffer and die. The hands that rock the cradle rule the world. And when they send troops home blind and crippled, it's the woman wives and mother that take up the healing the grieving and the praying. God made us special that way. Someone has to have sense.","commenter_a":"I hope that Trump comes up with some way to penalize the Media when they publish lies.....They should not be able to get away with it.....they put up pictures that are not true with the stories.....the media has become a very negative view on anything with Trump...they dont have the truth in them......I have high hopes for President Trump and do believe he will do a great job.....It is time for all to quit all tthe stupid protesting and join together to help America!!!","post_message":"Americans reactions to President Donald Trump's inauguration were positive with more people saying they are now more hopeful about the next four years than those who are less hopeful, a Gallup Poll reveals."},{"comment_id":"10158142280770293","commenter_b":"A bankrupt city full of criminals... we will stay in Shelby county and spend our tax dollars in Shelby county... will not spend a dime there","commenter_a":"Hopefully they will lose all Federal funding for not following the Federal law. They need to be concerning themselves with NOT being in the top ten places that are unsafe.","post_message":"#BREAKING: The Birmingham City Council took a position on the travel ban by passing a sanctuary city resolution this afternoon. READ more on this developing story >>"},{"comment_id":"408303332684881","commenter_b":"Maxine, you don't know much do you. The minorities already have the right to vote. Sorry if they won't let you count the votes that some people made with the names of dead people. Illegal aliens don't have the right to vote, because they are not citizens of the USA.","commenter_a":"As long as the current conservative, sorry ass Republicans are controlling both the House and Senate, there will never be a vote on a new Voting Rights bill!!!:( They are against anything good for minorities, women, seniors, and the working class.","post_message":"On this day in 1965 President Johnson gave his Voting Rights Act Address to Congress. Today, we should DEMAND Congress pass a new Voting Rights Act. Sign this petition if you agree."},{"comment_id":"10154262733576615","commenter_b":"The men don't have to be gay .. the killer doesn't have to be gay.. if there even is a killer, it could be male or female.. (although the odds are low of that ) .. I'm just saying it's funny how I feel it would be different if this many bodies were found and they were female. I don't like how ppl instantly assume this many men just walked into the river accidently drunk.. especially when their have been bodies found in garbage cans and other areas as well. It may be a big city but a serial killer theory is plausible and cannot be excluded when this many individuals seemingly \"walked into the river\" accidentally. The men are young mostly college aged looking ... if someone is targeting them it could be for a variety of reasons. The only thing they seem to have in common is they ...","commenter_a":"I can't be the only person that's starting to get the impression there may be a serial killer in Pittsburgh","post_message":"JUST IN: Skeletal remains found earlier this week in a trash can have been identified as Dominick Brown, a Penn Hills man who went missing in 2012, his family tells Channel 11 News."},{"comment_id":"10154162143246756","commenter_b":"@username No, it doesn't. As a woman, you should pay attention to who thinks you aren't able to make decisions about your own body.","commenter_a":"Scalia institutionalized his vicious hatred of women and gay people and his lack of respect for the Constitutional rights of every American. If he didn't want people to speak ill of him after he was dead, he should have lived a different life. He was a hateful man and will be rightly remembered as one. Death doesn't suddenly turn a monster into Winnie the Pooh.","post_message":"Perhaps most of all, Scalia will be remembered for his scathing dissents. He was a reliable conservative, but every once in a while he broke rank."},{"comment_id":"10154028893376051","commenter_b":"He is going to build a wall. Send back the goobacks and bomb Isis. Has my vote. If he triples the debt the libtards shouldnt mind. They have no concept of paying bills.","commenter_a":"Does that mean that Trump will put the country in more debt than it has been before him? Does it mean that Trump will instigate a covert plan to arm terrorist nations? Why exactly is that a good thing?","post_message":"Brexit leader Nigel Farage says Donald Trump reminds him of a modern-day Ronald Reagan. Will you be supporting Trump this November?"},{"comment_id":"10154301833998487","commenter_b":"The onus should be on the Jewish men: if they believe that women should not be swimming with them, then the men will just have to find someplace to swim.","commenter_a":"No. Your religion is your problem. If the pool wants to allow certain groups, including religious groups, to reserve the pool for certain blocks of time (like a water fitness class), that would be okay.","post_message":"Should city pools accommodate women whose religious beliefs forbid them to swim in front of men?"}]
