[{"comment_id":"10155037125378459","commenter_b":"Hey the angry ex wife is back!!!!!","commenter_a":"You know when there is a big headline telling you the absolute truth about anything on social media that you are in for a load of bullshit.","post_message":"The Truth About Oprah Winfrey Oprah Winfrey meets in secret with THE MOST evil men and women in the world every year and is given talking points to push on her audience..."},{"comment_id":"10153676106271636","commenter_b":"Jaysus.. its 2016 and still people believe this is real... all the people in these prank videos are in on it... are we just going to ignore that? And for the record I have seen tons of videos of girls clipping guys' crotches with paperclips and pouring hot sauce over them in the name of prank .. these videos are cutely dubbed \"bf/gf pranks\" what the hell?","commenter_a":"What a F**CKING idiot...","post_message":"It's been branded misogynistic"},{"comment_id":"10154158954704641","commenter_b":"Good luck!!! Wonderful! !","commenter_a":"This is the guy that we need to operate our military","post_message":"He's been attending community college part-time since he was 7."},{"comment_id":"1194913097195385","commenter_b":"shame on you that is racist and you being irish you would under stand that do not be like that sarah","commenter_a":"I know his brother Mr Poopoo !","post_message":"Chinese officials detained Ai Weiwei for 81 days and seized his travel documents in 2011, charging him with tax evasion, an accusation he has long denied."},{"comment_id":"10153250521056509","commenter_b":"It's not just FL, horrible people live everywhere...","commenter_a":"Why does so much f*d up sh*t happen in Florida!?!?","post_message":"A 5-year-old Florida girl was killed after her father tossed her off a bridge from his car, police said Thursday. @webpagelink"},{"comment_id":"10153474188676350","commenter_b":"But they can't make babies it takes a man and a woman to have s baby","commenter_a":"So wrong","post_message":"#BREAKING: Supreme Court makes same-sex marriage legal nationwide in landmark decision."},{"comment_id":"10153177294431336","commenter_b":"How can a female win the MENS race? Read much?","commenter_a":"That's a female???","post_message":"JUST IN: Lelisa Desisa has won the men's race at The Boston Marathon in an unofficial time of 2 hours, 9 minutes, 17 seconds. It's the second victory for the Ethiopian, who won the marathon in 2013 just hours before the attacks. @webpagelink"}]
