[{"comment_id":"10152826905226130","commenter_b":"Lisa Longbine you are without a doubt one of the biggest tools of society. Why dont you do some research before sounding even more ignorant than you already do. Measels is on the rise mostly due to the huge amount of diseased illegals entering the country by the millions. Due some research tool...","commenter_a":"There's a reason why people don't want their kids getting vaccinated. The fact that their daughter can't get vaccinated is proof enough that they're dangerous","post_message":"My daughter has cancer. Your unvaccinated kid put her in danger. Here’s what I have to say to you."},{"comment_id":"1128870593839354","commenter_b":"They not are migrants ffs, They are invaders. When will our government's wake the duck up!!!","commenter_a":"These people are deranged.... Catch them and give them an immediate death sentence............Shut all the boarders..... Keep filth out to protect our own...","post_message":"Migrant rape fears spread across Europe"},{"comment_id":"10154319204506729","commenter_b":"And this should include Hillary as well. The woman has delusions of grandeur and is a serial liar. These are all distorted mental behaviors and both should be institutionalized.","commenter_a":"Psychosis: Possible symptoms include delusions, hallucinations, talking incoherently, and agitation. The person with the condition usually isn't aware of his or her behavior. Critical: consult a doctor for medical advice","post_message":""},{"comment_id":"557055264492970","commenter_b":"What scum bunnies.","commenter_a":"It should be simple, if you don't vote, then don't complain! But it seems the ones who didn't vote, are the ones crying, whining, rioting and be rude!","post_message":"\"That's sort of amusing,\" Donald J. Trump senior adviser Kellyanne Conway tweeted."},{"comment_id":"10153383704554411","commenter_b":"Examples?","commenter_a":"Texas has always been a disaster.","post_message":""},{"comment_id":"1777986365799226","commenter_b":"She is above the law,she doesn't, cheat or steal!","commenter_a":"As a woman I don't want the first female president representing me as someone who is a corrupted, lying, manipulator and fraud who thinks she is above the law. #Hillaryforprison.","post_message":"Hillary Clinton holds campaign rally in Cedar Rapids, Iowa after FBI announces they are reviewing email investigation. abcn.ws/2fnHba3"},{"comment_id":"10153961148192869","commenter_b":"such a vile, vile woman.","commenter_a":"I don't understand how any woman that has a daughter could vote for Hillary Clinton, sorry she is the poorest excuse for a champion of women and children that I have ever seen.","post_message":"In the war of the Presidential candidates, Donald Trump has taken some heat for his over-the-top characterizations of Hillary Clinton. Admittedly, this is the first campaign in my memory in which one candidate actually called the other a “monster.” But one woman who finds Hillary’s behavior truly monstrous has finally put her name and face behind that charge. This required courage, not just because it goes against the Clintons --- that’s always a scary thing to do --- but also because it relates to the fact that she was raped at age 12 and Hillary defended the man who raped her. The man pleaded guilty to a lesser charge and spent just a few months in jail. This was early in Hillary’s career, in Arkansas, in her one big courtroom trial. (The defendant had reportedly requested a female lawyer.) Certainly every defendant has the Constitutional right to a legal defense, ..."}]
