[{"comment_id":"10153456483261051","commenter_b":"I suggest you keep your bitch ass on the internet @username. You don't want to handle it in person.","commenter_a":"Most of the commenters here are transphobic scum. I hope none of you end up with a transgender child.","post_message":"This man handled his child’s funeral arrangements. When her friends showed up and looked inside the casket, they couldn’t believe their eyes."},{"comment_id":"476667025791225","commenter_b":"I agree","commenter_a":"He's right on!","post_message":"Donald Trump spoke out against gun-free zones in last night's debate, calling them \"target practice for the sickos.\" Agree or disagree? Via Opposing Views"},{"comment_id":"680890588768186","commenter_b":"Close them all down and get rid of all the Muslims!!! They dont belong here in Our Country!!!","commenter_a":"Donald Trump is our man and he has the balls to stand up and speak his mine for the people to help us to clean our house and to put the people who made this mess were they belong. We need to get our country back in working conditions. Get our school back saying the pledge ALEIGENT and believing in God again. So let's get our flag flying high and our spirits back. And this rotten president out with his terrorist people and kicking all to the curve (this mean get them the hell out of our Country they destroy our country enough. ).","post_message":"Donald Trump announced his plan to close Mosques, but keep watching. Muslims everywhere are furious. But he doesn't care. Do you support Donald Trump?"},{"comment_id":"10153474188676350","commenter_b":"But they can't make babies it takes a man and a woman to have s baby","commenter_a":"So wrong","post_message":"#BREAKING: Supreme Court makes same-sex marriage legal nationwide in landmark decision."},{"comment_id":"10152931413566491","commenter_b":"Love how in America, its the land of free ONLY if you don't go against the status quo or what's defined as \"normal.\" I'm a straight dude, and guess what? When it comes to gay people, I mind my own business. I support the human right to love, so long as no one is hurt. I just wish minding one's business was actually expressed by the many who love to use it for themselves only.","commenter_a":"Obviously there are a lot of Christians or Islamists or whatever commenting on here with a ton of negativity about this. Being a Christian myself, God does not teach us to hate on people for choosing to marry the same sex. He teaches us to love others amd treat them fairly. Give your head a shake people.","post_message":"After the historic Ireland vote, here's where else gay marriage is legal."},{"comment_id":"10154211754086509","commenter_b":"Immigration, no; Illegal invasion, yes!!!","commenter_a":"I get that people are against immigration. But some of these comments go to show how Inhumane people are. Sickening. (Since people don't know how to read and have messaged me ugly things saying how I should take them in...I'm going to state that I agree with immigration restrictions but I do not agree with having them DROWNED or KILLED.) Jeez.","post_message":"A Polish teacher asked students to calculate how many Syrian refugees had to be thrown overboard for a boat to stay afloat and reach Greece."},{"comment_id":"1515851598455693","commenter_b":"That's ok i love the 6 i have","commenter_a":"I REALLY HATE TATTOOS BUT THIS IS GOOD","post_message":"It's not just about the conversation — it's about providing tangible support and help too."}]
