[{"comment_id":"10154138437276323","commenter_b":"Did the author ever hear about choice. this is the kind of thing that drives one crazy about women","commenter_a":"It's our choice","post_message":"“We’ve been groomed – by the media, by advertisers, and now by ourselves – to understand that our gender has to try harder, to consume more, when it comes to our appearance. We’ve been taught to fear growing old.”"},{"comment_id":"10154166342376717","commenter_b":"FUCK HER","commenter_a":"I think Caitlyn is a fake I mean if she was a true Transgender she would've turned her back on trump a long time ago","post_message":"The transgender reality star and former Olympian is believed to have accepted the invitation and is looking for a plus-one to accompany her."},{"comment_id":"571634943014885","commenter_b":"Ya 10 ft wall and make mexico pay for it that wall will never be build","commenter_a":"@username to fucking childish.","post_message":"After vowing to take the high road during his presidential campaign, Marco Rubio changes his stance on making personal attacks against Donald J. Trump. ►Watch last night's full episode: @webpagelink"},{"comment_id":"966131710165214","commenter_b":"The people Hitler was fighting nare in control of America now.#GoZioniost#FickZionoistPuppets","commenter_a":"Hillary and Obama are a cancer to our country.","post_message":"Is it happening again? Join Us: The Free Thought Project"},{"comment_id":"722432601238848","commenter_b":"Idiot bitch","commenter_a":"No clue what-so-ever.","post_message":"She doesn't have a clue, does she? No idea how totally ignorant she sounds. --Andrew"},{"comment_id":"541837822650909","commenter_b":"blow hard............lies lies lies.....#USA4DJT, #MakeAmericaGreatAgain, #VoteTrumpForPresident","commenter_a":"So sorry this is his last year","post_message":"Your reaction to President Obama's State of the Union Address?"},{"comment_id":"10154876629414411","commenter_b":"Ĺol Canada doesn't care. Second biggest land mass on Earth, only 40 million people live here. We will put all the Americant's a few hundred km north west of Alaska. Enjoy the polar bears bitches.","commenter_a":"Please send him to Mars! We Canadians don't need this dickhead in our beautiful country...","post_message":""}]
