[{"comment_id":"10152694140572452","commenter_b":"Joanna Funes wtf lol","commenter_a":"Ewww I mean it this for real? Nikki Deleon Lexi Richman Ashleigh Gray","post_message":"WHAT'S THAT SMELL? Burger King announced Wednesday that it will soon be selling a Whopper-scented perfume @webpagelink"},{"comment_id":"10154352960083037","commenter_b":"Haha!! This dude is a savage!!","commenter_a":"@username you as a maintenance worker hahaha 😆😆😆😆","post_message":"A KXAN viewer sent us this video today. A maintenance worker at an Austin apartment complex was caught taking a swig of booze. How would you react?"},{"comment_id":"10152945760561051","commenter_b":"Great job for the AF vet I'm a 8 year vet from the ARMY I would have done the same maybe just a little more aggressive.","commenter_a":"No way the protesters are students. They are agitators.","post_message":"When this Air Force vet saw protesters stepping all over the American flag, she walked over to pick it up. Things escalated quickly from there."},{"comment_id":"941252249248581","commenter_b":"Oh Bill, you handsome devil...lol, NOT!!!","commenter_a":"It couldn't happen to a more deserving bunch of lying propagandists Hell Bent on fomenting Hate, Racial War & Spewing Male Bovine Feces.","post_message":"Fox News has enlisted two of their biggest twits to play the victim card and accuse Dish Network of censorship as the battle between the two rages on for a fourth straight week."},{"comment_id":"674562089401036","commenter_b":"The asshole cant do it","commenter_a":"Yes because the jails are full of Muslims. And what other matters does he have more important. What an absolute joke a president sticks his nose in these matters. Time for the states to push back.","post_message":"Obama administration has decided that they are going to ban pork products. This is just getting ridiculous. They need to come back to reality. Do you think the Obama administration is out of control?"},{"comment_id":"398269070297688","commenter_b":"Deport them back to their country. They donot deserve being here in USA. NO BENEFTS TO THEIR FAMILIES.","commenter_a":"This is fucking hilarious I fucking hate the prison system, just a cash grab for our taxes anyway I want to see more of this plz illegals do your worst I am laughing so hard right now","post_message":"This is not a good image for those who are trying to support the rights of illegal aliens."},{"comment_id":"565139210325963","commenter_b":"Just a thought, but doesn't having a system of getting illegal aliens jobs that no on else wants to do sound a little like the Slave-plantations system? After all, employers get poor, uneducated people to do jobs that others won't do. And they can abuse these workers with meager pay and living conditions. They can violate rights without facing consequences. Could be seen as a human rights violation fueled by greed.","commenter_a":"For everyone who thinks Mexican are illegal n don't know their history the white man is an illegal.. We Mexicans always been here","post_message":"Diego Reyna, a Mexican-Canadian, said he placed the Mexican flag atop the nearly completed Trump Tower because he was tired of disparaging remarks made by Donald Trump. \"MR Trump, we did our best work, your tower here in Vancouver is premium quality, and we were a crucial part of it, not just Mexicans but immigrants as a whole,\" he wrote on Facebook. \"The insults you have said about us, have not changed our work ethics.\" Reyna says he hopes his message of \"love and unity\" will reach the Republican presidential candidate."}]
