[{"comment_id":"1072924802728530","commenter_b":"So your saying, that I'd have a needle put in my eye for something that wouldn't be used since I sleep when it's able to use.... interesting....","commenter_a":"@username .. hackers never stop ... xD","post_message":"Who wants to be able to see in the dark?"},{"comment_id":"10154335910931130","commenter_b":"Just a joke? Really? So if you ever get assaulted verbally or sexually it's just a joke?","commenter_a":"Oh please. Hillary laughs at getting a guilty rapist off, what does it matter now, and trump was just making a joke. Get real.","post_message":"Talk about RIGGED!"},{"comment_id":"1513798078640217","commenter_b":"@username Prove that lady!!!!!!","commenter_a":"Obama has publicly said he was born in Kenya so has his tranny wife.... What more do you need ?","post_message":"Donald J. Trump \"has really started his political activity based on this racist lie,\" Hillary Clinton said."},{"comment_id":"10153105889332235","commenter_b":"Oh no! Someone stole my vagina!","commenter_a":"\"Like she'd protect her purse or phone\" not even touching the objectification of a woman's anatomy there, but yeah let's make it legal to steal those too, that'll stop people stealing them. Am I right!?!?!","post_message":"Just. Wow."},{"comment_id":"614198468735487","commenter_b":"They died due to your lack of investigation! !!!!! Say it it was a terror attack. We MUST STOP THE MUSLIMS COMING IN.","commenter_a":"So sad","post_message":"FBI – Federal Bureau of Investigation Director Comey and Deputy Attorney General Yates brief on the latest in the Orlando shooting investigation. @webpagelink"},{"comment_id":"470890583106641","commenter_b":"@username YOU'RE the looser ! And that's why you'll loose in November also !","commenter_a":"Hillary Clinton all the way to the White House !!!!","post_message":"WATCH LIVE: Hillary Clinton answers question LIVE in commercial break!"},{"comment_id":"1402866583068901","commenter_b":"HOW DO YALL EXPLAIN RICE COMMITTING CRIME AGAINST THE U.S, HOW BOUT HOW OBAMA LIED ABOUT ASSAD NOT HAVEING CHEMICAL WEAPONS. OBAMA LIED ! HOW BOUT TRUMP BEING PROVEN RIGHT ABOUT THE SURVEILLANCE ON HIM AND TEAM! HOW DO YOU FELL ABOUT YOUR CHILDREN BEING TAUGHT SHIRA LAW IN SCHOOL. ECT....","commenter_a":"I am glad to see to the media is holding their ground and calling him out. We need them to stay strong and sound the bullshit alert as needed.","post_message":"Trump lied SO much today, CBS had to call him out. Video by Occupy Democrats, LIKE our page for more!"}]
