[{"comment_id":"1141174309285545","commenter_b":"PUT THESE RAGHEADS OUT IF THEY CAN'T COMPLY!!!","commenter_a":"No","post_message":"The military doesn't bend their rules for their soldiers. If you want to serve, then fall in line. Do you think our society has become too sensitive?"},{"comment_id":"1011118955590810","commenter_b":"This woman has to go, she is crazy :(","commenter_a":"Yes, it's about the continued spread of the lefts fourth Reich! Whose ultimate leader, Satan, must be proud! Hillary, Bernie, Obama and his flunkies all cut from the same deprived mindset!","post_message":"PAY ATTENTION “This action is about a great deal more than just bathrooms,” Loretta Lynch declared."},{"comment_id":"850731841652961","commenter_b":"Another inbred rightwing BITCH! lmao.. Throw her to the lions! :) I wouldn't wipe my ass with the satanic black book of lies she learns from.. \"C-NT!","commenter_a":"One ugly MF !!!","post_message":"Her lawyer says it's not about bigotry. She says it's about her faith. But bigotry comes in many forms, and she's using her faith to justify it:"},{"comment_id":"10155334834981509","commenter_b":"Police ddnt kill here the one who shoot her is her boss to shut her up.. Druglords her in phillipines are afraid now they kill all there people who knows evrything to there bussnes. Cnn researcher maybe now is grade 7 only ahahah","commenter_a":"WTF is going over there? Why isn't this President condemning these murders if he is not then he is in part at blame!","post_message":"The daughter of a runaway British lord has become one of the highest profile victims of the Philippines' war on drugs."},{"comment_id":"1713686355585143","commenter_b":"Stick it bitch.","commenter_a":"They came into office with 1 are 3 million they now have 12 to 20 more million...Don't tell me she's not getting paid...","post_message":"Are you... KIDDING ME!? So sick of Barack Obama & Michelle Obama..."},{"comment_id":"10153055349059170","commenter_b":"Nah he's not Indian. Fake birth certificate. He wants his muslim army to overtake America.","commenter_a":"Bobby has it right. He's a great Patriot. Would make a great president.","post_message":"To those who want to silence talk of God - because they're afraid of how it will affect election outcomes - reconsider your priorities. Looks like Bobby Jindal has this right. (And in no way did he mean what is critic here thinks he meant.)"},{"comment_id":"1322864184423514","commenter_b":"Tear down their tereorist head quarters that's what all mosque's are . And deport them all","commenter_a":"good on you Donald deport them all","post_message":"TRUMP IS GOING TO CLEAN UP THE INSANITY THAT HAS BECOME AMERICA!"}]
