[{"comment_id":"10153575430048525","commenter_b":"It is absolutely ludicrous that a law had to be made for that. What she did was animal cruelty.","commenter_a":"It used to be legal but in 2011 they pass the bill in Florida banning sex between humans and animals.","post_message":"Deputies say they arrested her after seeing video. STORY: www.fox13news.com/news/florida-news/@username-story"},{"comment_id":"659146920942553","commenter_b":"Muslim terrorist","commenter_a":"YOU BET I AM!","post_message":"Members of ISIS are disguising themselves as refugees so that they can funnel into Europe. Terrorists have breached European borders, things are about to elevate. Are you worried Obama will let terrorists into our country?"},{"comment_id":"10151087068944999","commenter_b":"ALL ILLEGALS LEAVE AMERICA NOW!","commenter_a":"I wonder how many of them are legal immigrants. What's wrong with deporting illegal immigrants?","post_message":"On Thursday, foreign-born residents stayed home, or took to the streets, in protest of President Trump's immigration policies."},{"comment_id":"1134898503249901","commenter_b":"That's supposed to make me want to vote for her?????????","commenter_a":"From a Bernie Delegate: A hard day for most of us. I have contacts within both campaigns. Here what I was told yesterday and today. Clinton campaign to vote down every concession made to Bernie on the platform if he did not endorse her prior to the convention. Knowing that Superdelegates were not going to switch to his side without something major happening, the best he could do was hold on to the progressive concessions he won for US on the platform. He could not, in good consciousness let the GOP and Trump win, especially when we have a potential half of the Supreme Court Justices that will be replaced within the next 4-8 years. He was looking out for the future of our movement and our nation in this very hard decision he made. This post is not to tell you to vote for Hillary, or to not leave ...","post_message":"In the coming weeks, I will be announcing the creation of successor organizations to carry on the struggle that we have been a part of these past 15 months. I hope you will continue to be involved in fighting to transform America. Our goal will be to advance the progressive agenda that we believe in and to elect like-minded candidates at the federal, state and local levels who are committed to accomplishing our goals."},{"comment_id":"680890588768186","commenter_b":"Close them all down and get rid of all the Muslims!!! They dont belong here in Our Country!!!","commenter_a":"Donald Trump is our man and he has the balls to stand up and speak his mine for the people to help us to clean our house and to put the people who made this mess were they belong. We need to get our country back in working conditions. Get our school back saying the pledge ALEIGENT and believing in God again. So let's get our flag flying high and our spirits back. And this rotten president out with his terrorist people and kicking all to the curve (this mean get them the hell out of our Country they destroy our country enough. ).","post_message":"Donald Trump announced his plan to close Mosques, but keep watching. Muslims everywhere are furious. But he doesn't care. Do you support Donald Trump?"},{"comment_id":"10153577547513352","commenter_b":"Amber shut your ass up looking like momma June. Fat ass","commenter_a":"This sight sucks","post_message":"In sickness and in health: Soldier marries fiancée despite brain injury that left her unable to recognise him just days before their wedding… and then spent five years teaching her to walk, eat and speak again"},{"comment_id":"10154732145028690","commenter_b":"@username he will never be found guilty of those accusations. He's too powerful. That family is too powerful. And when it's the word of the victim against the word of the powerful accused, especially in cases of rape and sexual assault, we all know the public will side with the powerful beloved, charming, charismatic Bill. Especially when his wife is about to win a historic election. This speaks volumes about the rape culture in this country. This is the same story played across this country everyday. This is why so many women remain silent. As someone who values national security and the reputation and values of this country, I can't in good conscience vote for either of these abhorrent people. Trump is the orange muppet love child of Ford Fairlaine and Biff from Back to the Future, and the Clintons are the example of a powerful enterprise who represents ultimate ...","commenter_a":"Bill Clinton isn't up for election, that argument is lame and dead as some are trying to compare these events. What Trump said amounts to sexual assault...\"you grab them by the pu***.\" Trump has been accused many times of sexual assault and rape, with the latest accusation raping a 13 year old girl. If guilty, Trump should be spend the rest of his menial life in prison. Trump is unfit.","post_message":"\"Horrific\", \"sickening\", \"poisonous\" - Donald Trump blasted over lewd and sexually charged comments he made about women @webpagelink"}]
