[{"comment_id":"1118814734807982","commenter_b":"174742062548592helle Tenney let it first be understood I can care less for evil feminist. My point is why go to a frat house that is known for Alcohol drugs and loose women having sex up stairs, when you know inappropriate things always happen in places like that. Secondly, I'm sure she was there drinking in an unsafe environment but I don't condone anyone being raped but we should ask ourselves why the Hell do women keep going to places that are historically unsafe for women? Lastly, women lie so much about rape and other things that no one knows when they are telling the truth. There has been several times when men have been falsely accused of rape and we found out later that she was just trying to cover up the fact that she decided to sleep with the whole football team at once. I see the police reports ...","commenter_a":"Ok but why was she even there in the first place?!!!!!! Why do girls go into Frat houses?!!!!","post_message":"Sexual assault on US college campuses is a major problem and we can't ignore it any longer. In an exclusive interview, US Vice President Joe Biden outlines how he's leading the charge to change the way we fight this epidemic by going straight to the source. Get the full experience at mic.com/enough"},{"comment_id":"1142481939134045","commenter_b":"F*** that nicole. That's not kool. Omg! 😨","commenter_a":"@username Logan Rose","post_message":"Would you? #WSHH"},{"comment_id":"1248241848569316","commenter_b":"They are coming in on cargo planes in the dead of night and then being bused throughout our country. Once they reach \"refugee\" status they can roam throughout America without any restrictions. Refugee is just a word to make it look right........it is not. Illegals are just criminals and not the best for our country. The new immigrants are not the same that came over after WWII who felt blessed and were willing to be woven into the fabric of America. The new ones are coming for only the money and the Demos are only aiding and abetting them for the votes. Plain and simple.","commenter_a":"Trump is the biggest liar out there. \"We did not discuss paying for the wall\" - Trump \"I made it clear that Mexico will not pay for the wall.\" - Nieto \"Chicago Police told me crime will stop in one week\" - Trump \"We did not discuss stopping crime in one week\" - Chicago PD \"The NFL sent me a letter about the presidential debates\" - Trump \"We did not send any letter to Trump\" - NFL Promises on deportation of illegal immigrants, self-funding of his campaign, no teleprompter, muslim ban, and release of his tax returns, now confirmed LIES. Who still believes conman Trump? #LyingTrump Feel free to share.","post_message":"Donald J. Trump's claim that the federal government has no idea how many undocumented immigrants are in the United States is false."},{"comment_id":"756693807767590","commenter_b":"Ian","commenter_a":"Joshua","post_message":"...bruh"},{"comment_id":"1708135839246157","commenter_b":"Wasn't British ppl rebuilt London Coventry Liverpool after WW2, immigrants can have their place IF they have something to offer in return","commenter_a":"The multicultural experiment hasn't worked ... ethnic ghettos are the proof. People like to live amongst like minded people, it's just natural behaviour.","post_message":"Swear oath to live in Britain"},{"comment_id":"10154026339057464","commenter_b":"Wisconsin people must have cheese for brains! How else can you explain why they are listening to Mitt and the Republican party supporting Cruz.! With Cruz you'll get another Bush style government paying higher taxes and less jobs! Only Trump has a solution to bring jobs back to America!","commenter_a":"I want the media to go after Cruz like they have gone after Trump. They are so biased and they make me sick. Media, please ask Ted this question: Have you been unfaithful to your wife? AND don't stop asking him until he answers that simple question!","post_message":"It's not too late to enter to win tickets to the championship game in Houston --> @webpagelink"},{"comment_id":"10153106152611336","commenter_b":"Imagine, Christian leaders to lead a Christian group? Lol!","commenter_a":"Maybe Cal state I should be recognized","post_message":"A Christian organization at California State University, Stanislaus has been de-recognized because the group wanted its leaders to be Christian."}]
