[{"comment_id":"952261771573668","commenter_b":"You don't have to like Trump to have your PUSSY groped!","commenter_a":"I'm telling ya people, you dont have to like Trump personally but you all have to get out there to vote for him to stop this stuff. Its unreal. Its almost like we are living in 1960's Soviet Union.","post_message":"This makes me sick..."},{"comment_id":"10153903407251336","commenter_b":"Her teeth are still loose she can't knaw on a steak... Cheap date. (y)","commenter_a":"She could have easily ducked her commitment, all things considered, but didn't. I gained more respect for Ronda over this classy gesture in the face of her recent defeat and widespread public mockery, than any of her knockout wins. Much love to her and our Armed Forces.","post_message":"UFC superstar Ronda Rousey kept her promise and accompanied U.S. Marine Lance Cpl. Jarrod Haschert to his Marine Corps Ball in South Carolina on Friday."},{"comment_id":"10153414800625933","commenter_b":"Liars make me sick.","commenter_a":"John, you seem very busy these days, but who is governing Ohio at this time? Do you plan to reimburse the Ohio tax payers ? That would be the right thing to do . You have been eliminated for months. Get back to making Ohio great. Do the job your being paid to do.","post_message":"Let’s Get It Done."},{"comment_id":"1573408882718854","commenter_b":"These women are crazy to boycot her clothes. She is so classy.","commenter_a":"Please leave Ivanka out of this. She is a hard-working, talented woman, and her clothes are beautiful and affordable!","post_message":"Feeling the chill, Ivanka Trump?"},{"comment_id":"10153715951406002","commenter_b":"There are not enough words to describe the opinion I have of this woman and the her unspeakable actions.","commenter_a":"In my eyes what she did is not much different than an abortion.","post_message":"A 24-year-old Eastpointe woman who already has three children is charged in connection to the death and abandonment of a newborn who was found at a Roseville recycling center."},{"comment_id":"1571850159771728","commenter_b":"Wish you would replace Pelosi!!!! Sick of her!","commenter_a":"Hopefully she'll endorse the only true Constitutionalist Conservative, Ted Cruz.","post_message":"This campaign was always about citizenship—taking back our country from a political class that only serves the big, the powerful, the wealthy, and the well connected. Election after election, the same empty promises are made and the same poll-tested stump speeches are given, but nothing changes. I've said throughout this campaign that I will not sit down and be quiet. I'm not going to start now. While I suspend my candidacy today, I will continue to travel this country and fight for those Americans who refuse to settle for the way things are and a status quo that no longer works for them. Our Republican Party must fight alongside these Americans as well. We must end crony capitalism by fighting the policies that allow it to flourish. We must fix our festering problems by holding our bloated, inept government bureaucracy accountable. Republicans must stand for conservative principles that lift people ..."},{"comment_id":"2130174917081223","commenter_b":"He is better off with out the old hag!","commenter_a":"Hell of a man","post_message":""}]
