[{"comment_id":"10155010955881350","commenter_b":"I need that hippo.","commenter_a":"Sydney Elise Harville","post_message":"WATCH: Make your Monday better with this hippo waddle. @webpagelink"},{"comment_id":"10153177506232885","commenter_b":"Scumbag whore.","commenter_a":"Unwhite Bastards.","post_message":"At a complete loss for words right now! This is absolutely disgusting and an abuse of the right to free speech!"},{"comment_id":"10153915924607217","commenter_b":"The most and popular muslim holy wars, were against the Romans and Persians. because they were arrogant and in face of God wills.","commenter_a":"Not forgetting the millions of Hindus killed by Muslims in India ..one of the world's greatest forgotten genocides","post_message":"The fire at the Islamic Center of Fort Pierce may have been timed to coincide with the Muslim holiday Eid al-Adha and the anniversary of the 9/11 attacks."},{"comment_id":"10153117067891350","commenter_b":"Lil cunt","commenter_a":"Abbey Maclean","post_message":"This is just too cool! Watch our own Natalie Morales transform into a zombie for The Walking Dead."},{"comment_id":"837370303025890","commenter_b":"Your just another Dumb Female","commenter_a":"Slick willy fits him better","post_message":"Just call him Adam."},{"comment_id":"1069182599857726","commenter_b":"Fine, you'll never get another cent! You bitch or butch or Satan worshiper!","commenter_a":"Their coffee tastes like shit anyway.","post_message":"Starbucks CEO takes hard stand. They just lost our business forever. Will you go somewhere else to get your coffee from now on?"},{"comment_id":"921974804515254","commenter_b":"my favorite teacher was/is Mrs Cathy Zavacky-Barrek. She was my kindergarten teacher and I was a cry baby.she always made me feel comfortable and loved away from my mommy....The sweetest teacher ever, nice, loving, but also had control of her class...","commenter_a":"My favorite teacher was in 6th grade. He believed in me when I felt like no one else did- may he rest in peace. My favorite college professor (also my academic advisor) helped guide me along the path I needed to be the first in my immediate family to get a Bachelor's degree (thank you for that Bob)","post_message":"What stories do you have about YOUR favorite teacher?! #NationalTeacherAppreciationDay"}]
