[{"comment_id":"10152597227421615","commenter_b":"Thank you....so are y'all! Oh I forgot...so is Y'all @username!","commenter_a":"Please use proper English...y'all is not a world in the English language! I guess I am racist, also!!","post_message":"#BREAKING NEWS UPDATE: A 17-year-old boy has been arrested and is facing adult charges in connection with a shooting at the Monroeville Mall last night. @webpagelink"},{"comment_id":"10153189366828132","commenter_b":"Yes for real!!! That's hilarious.. but just a secret, I do it to. Except when they stare, I sing to them. And they sometimes laugh or look at me like","commenter_a":"I could so see Mervin doing Danielle!","post_message":"This police officer from Dover, Delaware, has some serious moves!"},{"comment_id":"10153580091211601","commenter_b":"This Bit*h has a special place reserved for her in hell.","commenter_a":"HELL IS WAITING FOR HER","post_message":"In a Washington Post feature on Planned Parenthood, Cecile Richards, President of the nation’s largest abortion chain, says every abortion restriction in this nation must be challenged and removed."},{"comment_id":"1588983808072440","commenter_b":"Why are gender confused women so ugly??","commenter_a":"Very dangerous! Students looking for a leader. Maybe a Pol Pot?","post_message":"“I’m never going to argue with people’s feelings,” she says... before explaining why she rejects the feelings of conservatives who have been silenced."},{"comment_id":"499187636938483","commenter_b":"Send her sorry ass back to the jungle with her relatives.","commenter_a":"Come and get them you POS!!!","post_message":"Michelle Obama just made a major move on gun confiscation. This is ridiculous, restrictive gun laws cause HIGHER murder rates. Will you refuse to allow Michelle to take away the 2nd amendment?"},{"comment_id":"1023820500989519","commenter_b":"Ask Planned Parenthood to pay for it - Bitch.","commenter_a":"There are enough uber wealthy Dems to pay this. Why not hit up Oprah? This is spare change for Holliwood.","post_message":""},{"comment_id":"10152735928791680","commenter_b":"Of course. I know there is no way Hillary's home had anywhere near the \"Defense in depth\" that the government has. She decided to run her job from her less secure home. She brought it upon herself. ISPs and private servers are hackers easiest and most favorite targets, especially the traffic to and from. Take an IT course sometime. This info is taught at the basic level.","commenter_a":"Democrats can be mean brainwashed SOBs: @webpagelink","post_message":"Louisiana Gov. Bobby Jindal took his socially conservative message Thursday straight into the belly of the liberal beast: the New York Times’ opinion pages."}]
