[{"comment_id":"814799585299285","commenter_b":"Yes me to!! We better not be dumb enough to let another one get in like Hillary Clinton! We can't afford to have her ruin our country and drive it farther into the ground than Obama already has!!","commenter_a":"Can't wait for Obama to leave office","post_message":"President Obama will address the nation tonight. He needs to acknowledge RADICAL ISLAMIC TERRORISM! On Friday night in North Carolina, I was asked what I would say to Obama - at this point:"},{"comment_id":"555507287934896","commenter_b":"I'll flip it back and not shop there until the board fires her","commenter_a":"Time to switch to Costco.","post_message":"What do you think of this?"},{"comment_id":"10153809111181336","commenter_b":"You will feel it when your movies plays to less than half the audience shows up..","commenter_a":"IDIOT","post_message":"Quentin Tarantino has finally responded to the firestorm that’s been brewing since he criticized police officers at a rally last weekend, and he says he won't be \"intimidated.”"},{"comment_id":"1076328745721469","commenter_b":"I got bafar as well","commenter_a":"Woooow @username","post_message":"This is really, really weird. Check out the explanation here: bit.ly/1bRZ7nn Via by AsapSCIENCE."},{"comment_id":"1273398092695609","commenter_b":"Rosie is one of the most disgusting women","commenter_a":"protect your kid not your pigs","post_message":"Rosie is disgusting!"},{"comment_id":"10154400820486051","commenter_b":"@username Suck it up Buttercup, it's the middle class that pays the taxes that all you losers live on. President Trump has done more, so far than Obama has done in 8 years. Oh I forgot he (BHO) has flooded America with illegals that are: murderers, rapist and child molestersl. The best thing that can happen for the USA is the Big One hit and take California with it.","commenter_a":"Rock on Rosie! Trump is scum! All these despicable people supporting him would make america great again by leaving. They are what is wrong with our country.","post_message":"Rosie O'Donnell just made a very controversial accusation against Donald Trump."},{"comment_id":"10152743678847434","commenter_b":"Danielle D'Andrea This bitch is my hero","commenter_a":"@username lolololol save above the knee","post_message":"\"I didn’t lose my two front teeth until I was in 5th grade, which is late. And that very same week, I got my period. Which is early. So I was just this jack-o-lantern with tits walking around, and I had one of those moms that was like, ‘You don’t need to shave above your knees.’\" - Amy Schumer"}]
